{"title": "Chapter 666: Settling Pans Gate", "id": 666, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-666-settling-pans-gate", "volume_title": "Volume 7", "body": "<h1>Chapter 666: Settling Pans Gate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 666: Settling Pan’s Gate</u></strong></p><br/><p>Xiao Yan stood on the rock stairs after having exited First Elder Su Qian’s study. He lifted his head to the sky and exhaled a breath of air. Medusa was following like a shadow behind him. Her pretty face was cold, and was unwilling to utter even a single word.</p><br/><p>There would occasionally be some Inner Academy’s Elders coming and going from the study. These people who possessed quite a high status within the Inner Academy, stopped their footsteps and eagerly chatted and smiled with Xiao Yan. They did not have the slightest Elder demeanor that they used when speaking with ordinary students. Of course, they clearly knew in their hearts that their so-called Elder status did not have the slightest use in the face of this young man in front of them.</p><br/><p>Xiao Yan sent off those Elders who had greeted him before he quietly sighed in relief. It had only been a couple of months since they had met. Did they really need to be so warm and enthusiastic?</p><br/><p>“Where do you need to go next?” An ice-cold voice containing some impatience sounded from behind Xiao Yan. It was actually Medusa who had waited for over half a day.</p><br/><p>“I thought that you wanted to continue being a mute.” Xiao Yan turned around and studied Medusa’s vertical eyebrows on her pretty face while he spoke with a smile.</p><br/><p>Medusa once again displayed a taut face in the face of Xiao Yan’s teasing. The latter could only helplessly shake his head at this. He said, “Let’s go. We will make a trip to ‘Pan’s Gate’ first. I don’t know when the next time I will return after making this trip to the Jia Ma Empire. Therefore, it is best that I settle everything properly.”</p><br/><p>Xiao Yan raised his feet and took the lead to walk outside after he spoke. Medusa was just like a ghost as she closely followed.</p><br/><p>Xiao Yan’s return to ‘Pan’s Gate’ naturally caused ‘Pan’s Gate’ to immediately boil. A countless number of people swarmed over from all directions. Their purpose was to give a reverent cheer to this mysterious leader whom they could hardly see. Xiao Yan’s current reputation within the Inner Academy had already reached a certain level. There was no student from any previous batch who could reach such a level.</p><br/><p>Wu Hao, Hu Jia, Lin Yan, Xiao Yu, and other important people in the upper echelons of the ‘Pan’s Gate’ once again gathered within the meeting room of ‘Pan’s Gate’ because of Xiao Yan’s return.</p><br/><p>“You created such a big commotion the moment you returned. There is currently an unknown number of brothers from ‘Pan’s Gate’ waiting outside for you to reveal yourself.” Xiao Yu shook her head as she glanced at Xiao Yan, who was seated in the leader’s seat, after hearing the noise float in from outside the hall.</p><br/><p>Xiao Yan smiled. He did not expect that he would actually cause such a big commotion by just showing himself.</p><br/><p>“You have disappeared for a couple of months again this time around. What do you want to do now that you are back?” Lin Yan made a big motion as he sat on his chair and rolled his eyes toward Xiao Yan.</p><br/><p>Xiao Yan was silent. He immediately spoke in a slow manner, “Everyone, this time around, I have returned to tell all of you that I may perhaps be leaving the Jia Nan Academy, and returning to the Jia Ma Empire within these two months.”</p><br/><p>The original joyous atmosphere within the hall immediately became still after Xiao Yan spoke. Everyone looked at one another. They also knew a little about Xiao Yan’s past. Hence, they naturally knew what he intended to do when they heard him saying that he was returning to the Jia Ma Empire. Therefore, no one opened their mouths to hold him back.</p><br/><p>Hu Jia was finally the first to speak after remaining quiet for a long while. “So soon?”</p><br/><p>Xiao Yan bitterly laughed as he faced everyone who had suddenly become much quieter. He sighed, “That’s right, I have already prepared everything. The Xiao clan is still waiting for me to return. I cannot delay any longer.”</p><br/><p>Everyone was silent. A moment later, numerous voices that appeared as though they had come to a prior agreement appeared, “I will leave with you!”</p><br/><p>Xiao Yan was stunned. He looked at everyone who was looking at each other and felt his heart become warm. He smiled and said, “I also hope so. However, it is too risky returning to the Jia Ma Empire this time around. The strength of the Misty Cloud Sect might not be any weaker than the line-up of the strong people that Han Feng had gathered to launch a sneak attack on the academy two years ago. Moreover, what will happen to ‘Pan’s Gate’ if all of you leave? This is our blood and sweat.”</p><br/><p>Wu Hao and Hu Jia immediately became dispirited when they heard this.</p><br/><p>“I have agreed with you back then right?” Lin Yan spread his hands and smiled at Xiao Yan. “There is no longer much use for me to remain in the Inner Academy now. It might be better for me to leave and strike out with you.”</p><br/><p>Xiao Yan also hesitated for a moment when he saw Lin Yan’s smiling face. He nodded his head and spoke, “I shall not say any arrogant words. I am reassured with your strength. Moreover, there is not much use for you to remain in ‘Pan’s Gate’. It is fine if you follow me.”</p><br/><p>Lin Yan’s face could not resist twitching when he heard Xiao Yan’s words. What did he mean by there was not much use for him to remain in ‘Pan’s Gate’? Was this fellow’s words not too damaging?</p><br/><p>“What about me? Even this fellow can go, don’t tell me I can’t?” A tender clear voice suddenly sounded. Xiao Yan looked at the white-clothed little girl who was standing with her hands by her waist. He could not help but hesitate for a moment. Although Zi Yan’s strength was indeed stronger than Lin Yan, they were not going to go to the Jia Ma Empire for a tour. There was quite a lot of danger in it. He was not too willing for this cute, little girl to be dragged into it.</p><br/><p>“Are you thinking of not helping me refine the ‘Body Transformation Pill’? You liar, are you looking for a beating?” Zi Yan immediately raised her little eyebrows when she saw Xiao Yan hesitate. She clenched her little fist and stared at Xiao Yan angrily. She had become vexed at having stayed in the Inner Academy for so many years. Naturally, she needed to grasp this opportunity to leave and venture into the outside world. Most importantly, she would not need to eat those awful medicinal ingredients by following beside Xiao Yan. Of course, she naturally hid these words in her heart. She definitely needed to look for the most righteous reason.</p><br/><p>Xiao Yan felt neither able to laugh nor cry when faced with Zi Yan’s cute angry stare. He mused for a moment before nodding his head and said, “It is fine if you follow me. However, you must agree that you will listen to everything I say. Otherwise, I will send you back!”</p><br/><p>Although the little girl was naive in nature, there was no need to doubt her strength. It was likely that her frightening strength had increased greatly after not having met for two years. That kind of strange strength was likely something that would cause even an elite Dou Huang to suffer should they collide head on.</p><br/><p>“Chi, I am not afraid of you.” A gloating expression surfaced on Zi Yan’s face when she heard Xiao Yan’s reply. However, she curled her mouth and did not show any sign of weakness.</p><br/><p>Xiao Yan once again turned his gaze to Hu Jia and Wu Hao by the side. He mused for a moment before slowly speaking, “I think that the both of you should have already heard some news. I have established a faction named ‘Xiao Gate’ within the ‘Black-Corner Region’. The academy’s ‘Pan’s Gate’ might have limitless potential, but there is a natural drawback in its management. The students will leave after they graduate. Moreover, the ‘Fire Energy’ within the Inner Academy will also fail to provide for them the means to survive in the outside world. Hence, I wish for you to pay some attention. You can introduce those students who have graduated in the future into ‘Xiao Gate’. Of course, this is entirely voluntarily. There is no need to try and force them if they are unwilling.”</p><br/><p>Xiao Yan had always viewed the potential of ‘Pan’s Gate’ seriously. Most of those students who were able to enter the Inner Academy were people who possessed a great talent. If they were groomed properly, they would definitely gain achievements in the future. This would be an extremely great potential strength if he was able to gather them.</p><br/><p>“Joining ‘Xiao Gate’? Is this not a little inappropriate? Since the ‘Xiao Gate’ is established in the ‘Black-Corner Region’, it can be considered a faction of the ‘Black-Corner Region’. You should also be aware that the place is always a deep taboo among the students of the Jia Nan Academy.” Wu Hao and Hu Jia knit their brows, and voiced their thoughts when they heard this.</p><br/><p>“Ke ke, I am naturally aware of this point. However there has been repeated friction between Jia Nan Academy and the ‘Black-Corner Region’. During such a time, guarding against the ‘Black-Corner Region’ is not a long term solution. If ‘Xiao Gate’ is able to expand in the future and quite a number of its members are students who graduated from the Inner Academy, do you think that this faction would act in a friendly or hostile manner when they meet groups from the Inner Academy who have gone out to train?” Xiao Yan laughed softly and slowly asked.</p><br/><p>“Moreover, once ‘Xiao Gate’ gradually takes shape in the future, it might even be able to act as a middleman to regulate the relationship between the Jia Nan Academy and the ‘Black-Corner Region’.”</p><br/><p>Wu Hao and Hu Jia frowned as they thought deeply. They naturally knew that these factions within the academy did not have the strictness of the sects and gangs in the outside world. No matter how one put it, they were still students. It was not possible to put in place traitor rules for the sect etc. This action of Xiao Yan was to turn ‘Pan’s Gate’ into a talent reservoir for ‘Xiao Gate’. Being a faction of the ‘Black-Corner Region’, the various rules within ‘Xiao Gate’ were definitely very strict. The overall mobilization ability of this kind of faction would naturally exceed ‘Pan’s Gate’ by ten or even a hundred times. It was not bad if they were currently able to make plans for the future when they had to leave the Jia Nan Academy.</p><br/><p>“If you are worried, the two of you can temporarily manage the ‘Xiao Gate’, which lacks someone to manage it during this period that I am away. This way, the both of you will be better able to completely understand the implication of this.” Xiao Yan smiled as he suggested.</p><br/><p>“You are the true leader of ‘Pan’s Gate’. You have the right to make such decisions… since you possess such a thinking, we will obey you.” Wu Hao and Hu Jia smiled. They mused for a moment before they nodded and spoke</p><br/><p>“‘Pan’s Gate’ would have scattered were it not because of you guys. What has it got to do with me?” Xiao Yan sighed.</p><br/><p>“Were it not because of the reputation that you had garnered, what use would there have been in simply relying on the two of us?” Wu Hao shook his head. Although Xiao Yan had seldom participated in matters regarding ‘Pan’s Gate’, they clearly knew that it was likely impossible for ‘Pan’s Gate’ to reach this size without Xiao Yan’s reputation. Xiao Yan’s position within the hearts of all the members of ‘Pan’s Gate’ could clearly be seen from the commotion that was created when Xiao Yan returned.</p><br/><p>“The two of you need not flatter each other. Let’s do as Xiao Yan says with regards to this matter. Wu Hao and my strength are too weak, and we would likely not be of much help if we were to follow you to the Jia Ma Empire. Therefore, we will stay behind to manage ‘Pan’s Gate’ and try to understand ‘Xiao Gate’. We will come and help you when we breakthrough to the Dou Wang class.” Hu Jia rolled her eyes and immediately agreed.</p><br/><p>Xiao Yan smiled and nodded. He also slowly sighed in relief within his heart. The most important thing was that ‘Pan’s Gate’ had been settled properly. This indeed allowed him to release the heavy stone in his heart. Next, he would quietly wait for two months, and wait for Xiao Li to gather all the helpers on his end. After which, the return plan would formally begin!</p><br/>\n</div>"}