{"title": "Chapter 661: The Ingredients Needed to Refine a Body", "id": 661, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-661-the-ingredients-needed-to-refine-a-body", "volume_title": "Volume 7", "body": "<h1>Chapter 661: The Ingredients Needed to Refine a Body</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 661: The Ingredients Needed to Refine a Body</u></strong></p><br/><p>Xiao Yan smiled as he observed Yao Lao’s relieved expression. He roughly described the situation back then. However, Yao Lao’s eyes narrowed and his expression immediately changed when Xiao Yan spoke about the appearance of the people from the ‘Hall of Souls’ while he was killing Han Feng.</p><br/><p>“You said that Han Feng’s Spirit was taken by a member of the ‘Hall of Souls’?” Yao Lao knit his brows and spoke with a solemn face.</p><br/><p>“Aye.” Xiao Yan nodded. His heart became worried when he saw Yao Lao’s serious manner, and he could not help but carefully ask, “Why? Teacher, is there something wrong?”</p><br/><p>Yao Lao knit his brows and mused for a moment. He seemed to be considering something before he slowly spoke, “If it is like this, it is likely that Han Feng did not die so easily.”</p><br/><p>Xiao Yan was startled. He discovered where the problem lay and immediately asked with a frown, “Teacher, you mean that the ‘Hall of Souls’ will help him revive?”</p><br/><p>“You should also be clearly aware that when a spirit has reached a certain strength, it is able to leave the body and remain alive. Of course, one’s strength would be greatly reduced. This is similar to my current condition… moreover, the ‘Hall of Souls’ clearly possesses a deep understanding for spiritual bodies. Although I am not certain about why they want to capture the spiritual bodies that roam the continent, it is clear from their attack tactics that they clearly possess a great damaging effect toward spiritual bodies.” Yao Lao voiced his thoughts, “That evil animal Han Feng had some connection with the ‘Hall of Souls’ in the past. Back then, the members of the ‘Hall of Souls’ had participated when he killed me. Fortunately, I had some preparations after that and managed to escape from the ‘Hall of Souls’.”</p><br/><p>“Hence, it is difficult to say for certain that the ‘Hall of Souls’ would not use some unusual method to allow him to remain alive in this world now that Han Feng is in their hands.”</p><br/><p>“This ‘Hall of Souls’ is actually so troublesome. It really is an oversight… speaking in this way, it is likely that Han Feng is not completely dead. What a pity.” Xiao Yan knit his brows and smiled bitterly as he shook his head, sighing somewhat regretfully.</p><br/><p>“There is nothing to feel pity about. From a certain point of view, you have already killed him once. Even if he remains alive with the help of the ‘Hall of Souls’, his actual strength will definitely be greatly reduced. Even if he wanted to do something, it is likely difficult for him to pose much of a threat.” Yao Lao shook his head and immediately spoke with a serious face, “However, from what you have said, the thing that concerns me most is that those strange fellows from the ‘Hall of Souls’ already clearly know that my spirit is in your body. Perhaps, they will send a dispatch to attack you in the future.”</p><br/><p>“Appropriate measures will be taken when the time come. Let’s discuss this when they finally come and find me. Coincidentally, my father’s disappearance seems to be somewhat related to them. It is just as well if they come.” Xiao Yan raised his eyebrows and laughed coldly while possessing absolute confidence.</p><br/><p>“Given your current strength, you need not be afraid of being hunted by an ordinary member of the ‘Hall of Souls’. However, the faction known as the ‘Hall of Souls’ is really too strange and unpredictable. Even I am uncertain just how strong they actually are. Therefore, it is best to act carefully.” Yao Lao voiced his opinion.</p><br/><p>“That is only natural. A lion must do its best if it wants to capture a rabbit. Moreover, we are now that rabbit. We will definitely end up being captured by them if we aren’t careful.” Xiao Yan smiled and replied.</p><br/><p>Yao Lao nodded slightly. He mused for a moment and appeared to have recalled something. Suddenly, he turned his head toward Queen Medusa who was a short distance away and said with a smile, “There is something I wish to discuss privately with my disciple. Can you please step away for a moment.”</p><br/><p>Medusa pressed her eyebrows together after hearing Yao Lao’s words. She glanced at Xiao Yan who was well before snorting coldly. After which, she turned around. Her body strangely disappeared from beside the bonfire with a flash.</p><br/><p>“It is really unexpected that her strength would actually increase this much after her spirit merged with that of the ‘Heaven Swallowing Python’. With her current strength, forget about you, it would be dangerous for me to attempt to beat her even with my current strength.” Yao Lao’s gaze stared at the spot Medusa had disappeared from before sighing a moment later. There was actually a trace of fear in his words.</p><br/><p>“Ke ke, teacher, you need not be worried. She will not act against me for at least a year. Moreover, if something were to happen to me, I am able to request that she intervenes. While you were in a slumber, I have taken advantage of her strength a couple of times to act in an imposing manner.” Xiao Yan smiled and said.</p><br/><p>“You little devil, really have a lot of wicked ideas. You are actually even able to subdue such a vicious woman. However, you should still be careful. This woman is just like an unruly female leopard. She will be a great assistant if you can tame her properly. However, once you fail, it is likely that you will be the first person she swallows in retaliation.” Yao Lao smiled first before reminding Xiao Yan.</p><br/><p>Xiao Yan smiled and nodded.</p><br/><p>“Let’s discuss some proper business first.” Yao Lao’s eyes stared at Xiao Yan. His gaze had some anxiety to it as he spoke, “The ‘Fallen Heart Flame’ has already been successfully refined by you? In that case, the two kinds of ‘Heavenly Flame’... have they merged?”</p><br/><p>Xiao Yan parted his mouth and smiled as he watched Yao Lao’s manner. He slowly extended his hand and flicked his finger. A wisp of Glazed Lotus Heart Flame surfaced on it. Since Xiao Yan was in a weary state at this moment, the wisp of flame was very small. However, this did not hinder the frightening temperature from spreading.</p><br/><p>“The merger has really succeeded!” Yao Lao’s expression was somewhat excited as his gaze stared at that wisp of dark-green flame. This ‘Flame Mantra’ was something that even he had not practiced. Hence, he was also uncertain whether it would truly able to swallow and merge the ‘Heavenly Flames’. After all, only one ‘Heavenly Flame’ could exist within the body of a single person. This was common knowledge within the alchemist world. Even someone as strong as Yao Lao back then only dared to absorb one kind of ‘Heavenly Flame’, much less anyone else. However, this mysterious ‘Flame Mantra’ had now broken this common sense and completely reversed it!</p><br/><p>One could imagine just what kind of commotion it would cause once the special effects of the ‘Flame Mantra’ were made public!</p><br/><p>One type of ‘Heavenly Flame’ was sufficient to allow an alchemist or a fire affinity practitioner to possess an incredibly great strength. What if one had two types, three types, or even more? It would likely not be overboard to describe the great accumulated strength as being able to destroy the sky and earth.</p><br/><p>Xiao Yan smiled as he studied Yao Lao’s agitated face. His finger was gently inserted into the wisp of dark-green flame. He immediately pulled it back and the dark-green flame was divided into two clusters of flame with different colors. The one on the left was green in color while the one on the right was colorless and invisible.</p><br/><p>“It can actually be separated after the merger?” Yao Lao could not help but express great surprise when he saw the two clusters of familiar flame on both of Xiao Yan’s hands. His face was immediately stunned.</p><br/><p>“If they are separated, they consume a lot of Dou Qi. However, the advantage is that the two could be used for different purposes. If they are merged together, its strength is much more frightening.” Xiao Yan smiled. He once again merged the two flames into the Glazed Lotus Heart Flame as he raised his head to Yao Lao and asked curiously, “Teacher, what will be the rank of this Glazed Lotus Heart Flame that I have merged and formed on the ‘Heavenly Flame Ranking’?”</p><br/><p>Yao Lao’s hand swayed above the dark-green flame as he mused for a moment. He finally said somewhat helplessly, “Those ‘Heavenly Flame’ on the ‘Heavenly Flame Ranking’ are all extremely rare. Even I was unable to see all of them. Therefore, I am naturally unable to evaluate this Glazed Lotus Heart Flame of yours. However, from my guess, it should not be ranked lower than my ‘Bone Chilling Flame’.”</p><br/><p>Xiao Yan merely shrugged his shoulders at this vague reply.</p><br/><p>“That’s right… since you have already swallowed and merged the ‘Fallen Heart Flame’, the ‘Flame Mantra’ should have evolved right?’ Yao Lao suddenly asked.</p><br/><p>“Yes. I think that my ‘Flame Mantra’ should have stepped into the Di class right?” Xiao Yan rubbed his head and spoke uncertainly.</p><br/><p>“Try and circulate your Qi Method. I will examine it.” Yao Lao mused for a moment before placing his hand on Xiao Yan’s heart as he spoke.</p><br/><p>Xiao Yan immediately did as he was told after hearing this. His mind moved, and the ‘Flame Mantra’ Qi Method within his body began to circulate rapidly. With the circulation of the Qi Method, the surrounding natural energy began to ripple swiftly as a natural energy swiftly entered Xiao Yan’s body. After which, it underwent various refinements before being stored all over his body.</p><br/><p>“Aye. This energy absorption speed is indeed much stronger than before. From the looks of it, it has indeed entered the Di class. However, it should only be at the Di Class Low Level.” Yao Lao withdrew his hand and immediately spoke with a smile, “However, given the uniqueness of the ‘Flame Mantra’ Qi Method, it could be comparable to a Di Class Middle Level Qi Method even though it is at the Di Class Low Level. With this current Qi Method level, it should be sufficient for you to squander Dou Qi without worry.”</p><br/><p>Xiao Yan nodded his head and laughed softly, “Teacher, I have already merged two kinds of ‘Heavenly Flame’. Can I help you refine a body that can accommodate your spirit?”</p><br/><p>Yao Lao was startled when he heard these words of Xiao Yan. He immediately felt somewhat gratified in his heart. He rubbed Xiao Yan’s head and spoke with a faint voice, “It might be barely possible if there are two types of ‘Heavenly Flames’ but there should not be much of a problem if my ‘Bone Chilling Flame’ is added. However, the ingredients needed to refine a body are really far too rare and even frightening. Therefore, we cannot rush this.”</p><br/><p>“What are the ingredients needed? Now, I am also in possession of some strength within the ‘Black-Corner Region’. Perhaps I can get someone to look for them.” Xiao Yan inquired.</p><br/><p>“These things are not things that can be obtained by just searching.” Yao Lao laughed bitterly. However, he could only helplessly nod his head when he saw Xiao Yan’s earnest gaze. He said, “There are not many things you need if you want to refine a body that could truly accommodate my spirit. It only requires three kinds of things.”</p><br/><p>Xiao Yan hurriedly became focused when he saw Yao Lao lift three fingers. He immediately gave Yao Lao his ear as he listened carefully.</p><br/><p>“First, Bone Growing Blood Fusing Pill.”</p><br/><p>“Second, the blood essence of a rank 7 Magical Beast.”</p><br/><p>“Third, the skeleton of an elite Dou Zong.”</p><br/><p>Xiao Yan’s originally solemn expression also gradually become dull when he heard the three things that slowly escaped from Yao Lao’s mouth.</p><br/><p>Bone Growing Blood Fusing Pill? This was something that Xiao Yan had some knowledge about. A medicinal pill at the peak of the seventh tier. It could even step into the eighth tier. Legend has it that it was an extremely great medicine that could immediately save a half-dead person who still had a breath left.</p><br/><p>The blood essence of a rank 7 Magical Beast? God, was that not describing Queen Medusa?</p><br/><p>The skeleton of an elite Dou Zong?</p><br/><p>This… did he really needed to go and look for an elite Dou Zong to kill? Given his current ability, it was difficult to say just who would kill who...</p><br/>\n</div>"}