{"title": "Chapter 684: Giving Others The Taste Of Their Own Medicine", "id": 684, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-684-giving-others-the-taste-of-their-own-medicine", "volume_title": "Volume 7", "body": "<h1>Chapter 684: Giving Others The Taste Of Their Own Medicine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 684: Giving Others The Taste Of Their Own Medicine</u></strong></p><br/><p>The laughter reverberated through every single corner of the capital like a devil’s curse, causing everyone’s body to suddenly stiffen. They became just like statues, unable to move…</p><br/><p>Xiao Yan?</p><br/><p>This name which had already become somewhat foreign caused the faces of many people in the city to be at a loss after hearing it. Three years was enough time for people to forget many things. Of course, this kind of faded memory needed only a small trigger in order to allow it to once again return to everyone’s mind.</p><br/><p>Under this soft laughter, the faces of many people continued to be at a loss for a moment before waves of exclamations were suddenly emitted.</p><br/><p>“Xiao Yan? He is that fellow who had turned the Misty Cloud Sect upside down three years ago?”</p><br/><p>“Wasn’t it said that he had died while being chased by the Misty Cloud Sect?”</p><br/><p>“Nonsense! He was only chased out of the Jia Ma Empire by the Misty Cloud Sect. However, it is really unexpected that he has already become this strong in these short three years. It is really too terrifying…”</p><br/><p>“The Xiao clan seems to be the clan destroyed by the Misty Cloud Sect right?”</p><br/><p>“Hee hee, didn’t you hear what he had just said, he has come to collect debt. The Misty Cloud Sect, tsk tsk, looks like they need to be prepared to repay the blood debt! This Xiao Yan was able to turn the Misty Cloud Sect upside down three years ago and even killed their First Elder. From the looks of his attack just now, it is clearly much stronger than three years ago. Hee hee, looks like this Misty Cloud Sect cannot be arrogant for much longer…”</p><br/><p>Private conversations from all over the city were repeatedly spread. Within only a short period of time, this information was spread throughout the capital. The black-robed, young man carrying the heavy ruler in the sky had once again been found in the memories of everyone from three years ago.</p><br/><p>......</p><br/><p>Jia Lao watched the black-robed, young man flapping his jade-green fire wings in the sky from the tall tower within the imperial city. Even though he had identified the latter through his aura earlier, this guardian of the imperial family still let out a long sigh when he saw Xiao Yan truly reveal his identity. A glow flickered within both of his eyes. He smiled and spoke in a manner as though he had removed a heavy burden, “How unexpected, how really unexpected. This fellow has actually returned once again. Ha ha, it is likely that it won’t be so easy for the Misty Cloud Sect to fulfill its wild ambitions this time around!”</p><br/><p>“Great grandfather, he is…” Yao Ye slowly recovered from the shock of the person in the sky defeating Yun Du and the three others with one punch. Her eyebrows became vertical when she heard the somewhat familiar name as she spoke.</p><br/><p>“Do you still remember the Yan Xiao from the Alchemist Grand Meeting back then?” Jia Xing Tian laughed.</p><br/><p>A glow flickered in Yao Ye’s eyes. She had also recalled that renowned person within the capital three years ago. Shock drew across her elegant, pretty face, “It is actually him… was he not chased out of the Jia Ma Empire by the Misty Cloud Sect?”</p><br/><p>“Ke ke, he can naturally return after leaving…” Jia Lao laughed and said, “I told you back then that this person was definitely not an ordinary person. Tsk tsk, three years ago, his true strength was but that of a Da Dou Shi. Now, however, from the sharpness and speed that he had displayed when he intervened earlier… it is likely that even I am no match for him!”</p><br/><p>Yao Ye was immediately stunned when she heard this. She was extremely clear about Jia Xing Tian’s strength. The only person in this entire Jia Ma Empire who could defeat him was likely that old roan from the Misty Cloud Sect. However, no matter how one put it, Yun Shan was an expert who had been training for many years. Yet, this Xiao Yan was merely around twenty years old even if they rounded up his age!</p><br/><p>An elite Dou Huang who was only around twenty years old. Even with Yao Ye’s cool head, just thinking about this caused her to be momentarily absent-minded. This fellow was indeed frightening…</p><br/><p>“Great grandfather’s eyes are indeed very sharp. Fortunately, we did not gain any enmity with him…” Yao Ye gently patted her voluminous breasts as she spoke in a rejoiced manner.</p><br/><p>“Ugh, actually back then I did think that this fellow would definitely be extraordinary in the future but I never expected that he is able to reach this level within just three short years…” Jia Lao sighed. A gloating expression immediately surfaced on his face as he said, “However, this is just as well. The Misty Cloud Sect has destroyed the Xiao clan and has already become irreconcilable enemies with Xiao Yan. In this way, Jia Ma Empire has an additional strong person like Xiao Yan. Hee hee, I no longer need to be overly worried about Yun Shan!”</p><br/><p>“Yao Ye, remember, make contact with Xiao Yan after today’s matter is over. At the very least, we must let him gain a favorable opinion of our imperial family.” Jia Lao mused for a moment before suddenly speaking.</p><br/><p>An unusual glow flickered within Yao Ye’s eyes as she looked at the black-robed, young man flapping his jade-green fire wings in the sky. This fellow, could really be considered a great genius favored by the heavens…</p><br/><p>“I suggest that we immediately maneuver our army to suppress the Misty Cloud Sect’s attack. Although acting at this moment could not be considered to be delivering charcoal in a snowstorm, it is better than waiting for everything to settle. It is likely that the effect of trying to show our goodwill will be extremely weak at that time.” Yao Ye fluttered her eyelashes gently and spoke in a gentle voice. However, she was displaying an impressive schemingness. She naturally possessed a mind that an ordinary person could not compare with in order to be groomed as the female emperor of the Jia Ma Empire.</p><br/><p>TL: delivering charcoal in a snowstorm - lending a hand when another needed it the most</p><br/><p>Jia Xing Tian hesitated a little upon hearing this before nodding heavily. He knew that he would be somewhat stupid if he were to still be indecisive at such a moment. Now that the Jia Ma Empire possessed a strong person like Xiao Yan, they would have some chances of victory even if they were to end up fighting with Yun Shan in the future.</p><br/><p>Yao Ye immediately rejoiced when she saw Jia Xing Tian nod his head. She immediately ceased speaking any nonsense and immediately began to give the command...</p><br/><p>At the Alchemist Association, Fa Ma exhaled a breath that was suppressed in his chest. He lifted his head and studied the black-robed, young man in the distant sky. A smile was revealed on his old face. He also knew that Xiao Yan’s sudden appearance would break the situation where the Misty Cloud Sect dominated the Jia Ma Empire.</p><br/><p>“This fellow is indeed not an ordinary person. Yun Shan, allowing him to flee back then might well be the thing that you regret the most in your entire life.”</p><br/><p>....</p><br/><p>The Mu clan. The head of the Mu clan, Mu Cheng, also slowly withdrew his gaze from the sky and turned his head to look at all the core members of the Mu clan. He could not resist proudly laughing, “All of you have short-sighted mouse eyes. Back then, all of you found so many excuses when I said to quietly lend Xiao Yan a hand. Does it now feel good to have a slap thrown on your faces? Ha ha!”</p><br/><p>All the clan members in the Mu clan could only smile bitterly and nod their heads when they saw the proudly laughing Mu Chen. All of them helplessly moaned in their hearts. Who was able to imagine that the fellow who was being chased like a dog that had lost its home back then would actually be able to reach a stage where he could truly challenge the Misty Cloud Sect within a short three years?</p><br/><p>Compared to the various laughs in the other few areas, the atmosphere in the Nalan clan appeared exceptionally stiff and depressing. This depressing atmosphere was emitted from the completely stiffened Nalan Jie’s body after that soft laughter of Xiao Yan’s sounded.</p><br/><p>Nalan Su also bitterly sighed as he looked at Nalan Jie, whose face was so stiff that he appeared like a dry corpse. That expert in the sky who could reverse the entire situation of the Jia Ma Empire had nearly become their son-in-law back then…</p><br/><p>“Father…” Nalan Su finally could not resist whispering a moment later.</p><br/><p>“Ugh…” A sigh which was filled with dense bitterness was slowly emitted from Nalan Jie’s mouth. He waved his hand in a depressed manner and said, “Although I am not certain if Xiao Yan will still pay attention to us at this moment, we should try our best to make contact with him for the sake of our clan.”</p><br/><p>“Father, it’s all because of Yanran’s selfish, young character. Otherwise…” Nalan Su could not help but say when he looked at Nalan Jie’s dejected manner.</p><br/><p>“We cannot put the entire blame on her. Back then, Xiao Yan helped me expel the poison, but we did not help him when he ended up being chased after by the Misty Cloud Sect because we were afraid of the latter. It is likely that Xiao Yan will not forget about this matter given his character. Hence, I am also responsible for these matters…” Nalan Jie smiled sadly and mocked himself, “It is really unexpected that in my old age my eyes would become this blind and my heart this muddled…”</p><br/><p>Nalan Su was silent. He could sense just how much regret was in Nalan Jie’s heart at this moment… However, there was no medicine for regret that they could purchase in this world…</p><br/><p>The black-robed, young man, who was carrying the heavy ruler in the sky, slowly turned around. He studied the completely stunned Hai Bodong not far away. He smiled slightly and slowly bowed, “Old Hai, thank you for taking care of the Xiao clan these few years.”</p><br/><p>“Xiao Yan?” Hai Bodong muttered. A moment later, he finally recovered and looked at the somewhat familiar young face. A wild joy gradually surged onto his face, “You brat, you have finally return!”</p><br/><p>Xiao Yan also smiled when he saw Old Hai’s extremely excited face. However, he did not have the time to go into the details when a cry filled with disbelief was transmitted over, “Xiao Yan? How can it be? You are actually still alive?”</p><br/><p>“I will first dispatch these people here before conversing more with Old Hai.” Xiao Yan smiled to Hai Bodong before turning his head and looking at the faces of disbelief of Yun Du and the other three people not far away. He laughed softly, “How can I die so easily when I have yet to kill old dog Yun Shan with my hands? Back then, I said that I, Xiao Yan, will return once again…”</p><br/><p>Yun Du’s expression changed rapidly. Xiao Yan’s sudden appearance had completely broken their initial plan. However, it was fortunate that this fellow was exactly the same as he was back then. There was only him alone. Given the enormous faction of the Misty Cloud Sect, this fellow would not gain anything even if he were to return!</p><br/><p>“Arrogant brat. There is no need for the Sect Leader to act if we want to deal with you! We have already taken precautions to deal with any person who blindly comes to create trouble!” Yun Du raised his head and suddenly let out a cold laugh. He immediately and swiftly took out a signal container from his storage ring and pulled at it with a great force. A gorgeous firework suddenly charged up and spread apart in the distant sky!</p><br/><p>A couple of stern whistles suddenly sounded from outside of the capital not long after the fireworks exploded. Immediately, five rays of light swiftly drew through the sky and appeared in the sky a moment later!</p><br/><p>The city immediately emitted waves of exclamation following the appearance of the five human figures. One could see five bright Dou Qi wings. These five people were actually all experts of the Dou Wang class! It seemed that the Misty Cloud Sect had truly put in a great effort in order to eliminate the Primer clan without any obstacles!</p><br/><p>Seven Dou Wangs, two Dou Huangs. This kind of frightening lineup once again caused the entire city to emit a sound of the inhalation of cool air. This Misty Cloud Sect faction was indeed extremely frightening. From the looks of it, even with the return of a strong person like Xiao Yan today, one would have difficulty obtaining much of an advantage.</p><br/><p>“Are you going to rely on larger numbers again? Indeed, a dog cannot stop itself from eating shit.” Xiao Yan was also startled when he saw the nine human figures suspended in the sky. However, he immediately laughed with some interest.</p><br/><p>“Xiao Yan, be careful, you cannot be careless!” Hai Bodong swiftly rushed to Xiao Yan’s side and spoke with a solemn expression.</p><br/><p>Xiao Yan smiled and nodded. He immediately raised his gaze and looked at Yun Du on the opposite side. Suddenly he laughed, “Do you think that I will still suffer the same disadvantage that I suffered back then without making any preparations?” Xiao Yan suddenly clapped his hands softly after saying this. That clap was just like thunder that swept across the sky.</p><br/><p>Yun Du and the others were stunned when they saw Xiao Yan’s actions. An instant later, the sound of rushing wind suddenly sounded from Xiao Yan’s back.</p><br/><p>The gazes of the entire city were hurriedly shifted when the sound of rushing wind appeared. Finally, numerous gazes became dull as they looked at the sky outside of the capital. Over ten human figures were swiftly rushing over from that direction. The Dou Qi wings on the backs of these people were so bright that they appeared extremely dazzling.</p><br/><p>“Next, let us give you a taste of your own medicine…”</p><br/><p>The expressions of Yun Du and the others instantly turned pale when Xiao Yan’s teasing laughter sounded!</p><br/>\n</div>"}