{"title": "Chapter 698: Mixed Bone Molding Pill", "id": 698, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-698-mixed-bone-molding-pill", "volume_title": "Volume 7", "body": "<h1>Chapter 698: Mixed Bone Molding Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 698: Mixed Bone Molding Pill</u></strong></p><br/><p>Xiao Yan’s expression instantly and uncontrollably darkened when he heard these two names being spat out by Hai Bodong. His eyes flicked about and there was some anger faintly seeping out from them.</p><br/><p>“Yun Shan wants to help Gu He and Yun Yun hold a wedding?” Everyone in the hall was also stunned when they heard Hai Bodong’s words. They looked at one another in a speechless manner.</p><br/><p>“This old fellow… what does he intend to do by doing such a thing now?” Mu Chen knit his brows and asked in a deep voice.</p><br/><p>“What else? He is naturally planning to recruit Gu He at this moment. Gu He has become somewhat alienated in the Misty Cloud Sect after Yun Yun was locked up during these few years. He would occasionally use the excuse of searching for medicinal ingredients to leave. Moreover, he would remain away for extended periods of time.” Jia Xingtian curled his lips and laughed coldly, “A tier 6 alchemist is someone that Yun Shan must treat respectfully even with his strength… however, it is really unexpected that he would actually be willing to use Yun Yun to trap Gu He.”</p><br/><p>“Gu He was always attracted to Yun Yun. However, in the past, the latter is a sect leader and was haughty in nature. Moreover, there was also too many things she needed to consider. Hence, Gu He could only treat her with respect in his capacity as an Elder and did not cross the line by even a little. A sharp-eyed person could see that it was merely one-sided on Gu He’s part.” Hai Bodong voiced his thoughts. He glanced at the gloomy face of Xiao Yan, being aware of some of the issues between Xiao Yan and Yun Yun. “Hence, this wedding might be completely controlled by Yun Shan. His intention is to completely pull Gu He, this alchemist grandmaster to the Misty Cloud Sect’s side.”</p><br/><p>“Looking at the situation according to the feelings Gu He has for Yun Yun, he might really become a fang of the Misty Cloud Sect if this marriage is completed successfully…” Jia Xingtian frowned intently and spoke with a deep voice. They had made quite a lot of contact with Gu He and naturally understood him quite well.</p><br/><p>“However, Yun Yun has never held any special feelings for Gu He. She is also a haughty person. Unless Yun Shan uses some special tactics, it is likely that Yun Yun will not submit to marrying a person whom she doesn’t like.” Nalan Jie’s eyes looked at Xiao Yan’s expression before speaking.</p><br/><p>Xiao Yan finally waved his hand after hearing the random discussion from everyone. The gloominess on his face had been suppressed until most of it had scattered. His eyes glanced at everyone before he slowly spoke, “Gu He possess an extremely great reputation within the Jia Ma Empire. It would likely be extremely troublesome if the Misty Cloud Sect has his help. Hence, we will naturally need to try our best to break this marriage… Old Hai, when is Yun Shan holding the wedding?”</p><br/><p>“Two days from now.”</p><br/><p>Xiao Yan narrowed his eyes. A dark fog flashed across his eyes as he spoke faintly, “In that case, I would like everyone to prepare everything during these two days. Two days later will be the day that we will have our decisive battle with the Misty Cloud Sect!”</p><br/><p>“So soon?” Everyone was shocked when they heard this.</p><br/><p>“Once Gu He really stands at the Misty Cloud Sect’s side and gathers some strong people over, it is likely that it would be even more difficult to defeat the Misty Cloud Sect.” Xiao Yan shook his head and replied.</p><br/><p>A couple of people mused for a moment when they heard Xiao Yan and could only nod their heads. If they gave Gu He sufficient time, it was likely that he might really gather quite a number of experts from all over the place.</p><br/><p>“Mister Xiao Yan, as long as you are able to defeat the experts within the Misty Cloud Sect, you can leave the remaining disciples for our imperial family’s army to deal with. I will also quietly issue an order to some of the commanders and generals who control large armies during these two days and get them to quietly remove the Misty Cloud Sect’s spies and strength within the cities.” Yao Ye mused for a moment before she smiled and said to Xiao Yan, “As long as mister Xiao Yan can kill Yun Shan, the remaining members of the Misty Cloud Sect will definitely be completely eliminated from the Jia Ma Empire…”</p><br/><p>Although the imperial family could not compare with the Misty Cloud Sect in terms of high level experts, they, who possessed the empire’s machinery, would easily be able to eliminate the Misty Cloud Sect, that had lost its leader, from the empire.</p><br/><p>“In that case, we will rely on princess Yao Ye at that time.” Xiao Yan merely smiled after hearing this. The Misty Cloud Sect was deeply rooted within the Jia Ma Empire. Only the imperial family who controlled the entire empire had the large resources to completely eliminate them. This point was something that Xiao Yan had no choice but to admit. If the imperial family were to be in charge of such a thing, their effectiveness would undoubtedly be many times greater than him.</p><br/><p>“However… if Gu He is to really stand on the Misty Cloud Sect’s side…” Hai Bodong’s gaze looked at Xiao Yan, hesitated for a moment before speaking.</p><br/><p>“I have said that the blood feud between the Misty Cloud Sect and I can only be resolved if one of us dies. There is no other method than this. Hence, no one is able to hinder me from destroying the Misty Cloud Sect. Gu He is also no exception.” Xiao Yan smiled faintly. Some dark, cold killing intent flashed across his dark-black eyes. “If he really wants to help the Misty Cloud Sect, we shall just attack and kill him together. Of course, this is a method that is used only as a last resort. He is an extremely proud person. I will use other methods to discourage him and get him to withdraw at that time…”</p><br/><p>“We shall do as you say since you have already come to a decision. The Primer clan will do our best to help you two days later.” Hai Bodong patted Xiao Yan’s arm and spoke in a deep voice.</p><br/><p>“The Alchemist Association will also do its best to help.” Fa Ma smiled and spoke to Xiao Yan. “This time around, the old me will bet everything on you.”</p><br/><p>Xiao Yan grinned and nodded as he looked at the declaration of these two people. His gaze immediately swept toward Jia Xingtian and he randomly spoke with a smile, “I have heard that the imperial family has a guardian beast that is extremely strong. This matter is extremely important and I’m afraid that Jia Lan must bring it out.”</p><br/><p>Jia Lao was startled when he heard this. He exchanged gazes with Yao Ye before laughing bitterly as he said, “The imperial family does indeed have a rank 6 guardian Magical Beast with a strength that is comparable to a seven or eight star Dou Huang. However, it is likely to have difficulty participating in the battle.”</p><br/><p>“Why?” Xiao Yan frowned. A Magical Beast that was comparable to an eight star Dou Huang possessed an extremely great fighting strength. Among those present, it was likely that only Jia Xingtian and Hai Bodong after he recovered his peak strength could contend with it.</p><br/><p>“Mister Xiao Yan, this is not because our imperial family is holding back. Instead, it is because the Secluded Sea Scaly Beast fought for our imperial family for many years, resulting in its body to be filled with hidden injuries. Its injuries erupted some time earlier and its condition is extremely apathetic. Its strength is not even half of what it was at its peak. It is likely that it would not have much of an impact.” Yao Ye pressed her lips and softly spoke when she saw Xiao Yan’s frown.</p><br/><p>“Injuries?” Xiao Yan lifted his eyebrows. However, he spoke with a smile, “Perhaps I can help. After all, everyone should not forget that I am also an alchemist.”</p><br/><p>Yao Ye and Xingtian Tian continued to smile bitterly after hearing his words. They said, “We know that mister Xiao Yan is also an alchemist. However, we even invited association head Fa Ma to take a look back then. However, he said that in order to completely cure the Secluded Sea Scaly Beast, we would need a kind of medicinal pill called the ‘Mixed Bone Molding Pill’.”</p><br/><p>“Mixed Bone Molding Pill?” Xiao Yan muttered in his mouth.</p><br/><p>“This kind of medicinal pill has extremely noticeable effects on the injuries of a Magical Beast. However, it is of a relatively high tier. It has reached that of a full-tier 6 medicinal pill. Even someone of my ability would have difficulty successfully refining a medicinal pill of this tier. Hence…” Fa Ma by the side helplessly opened his mouth to speak, “It is likely that the only one in this Jia Ma Empire who can refine this kind of medicinal pill is Gu He. However, the imperial family currently has a stiff relationship with the Misty Cloud Sect. It is clearly not quite possible to ask him to help refine it.”</p><br/><p>Jia Xingtian sighed. If not for the great decline in strength of the Serene Sea Scaly Beast, he would also not need to be this afraid of the Misty Cloud Sect.</p><br/><p>“Leave the matter of the medicinal pill to me… since all of us are in the same boat, I will naturally not be selfish.” Xiao Yan mused for a moment before he suddenly replied.</p><br/><p>Everyone was startled when they heard this. Numerous stunned gazes swept toward Xiao Yan. Asking him to refine a tier 6 medicinal pill? If this was the case, did it not mean… this fellow’s medicinal refinement skills had actually broken through to the sixth tier within a short three years?</p><br/><p>Compared to everyone’s stunned looks, Fa Ma’s and Qi Mier’s expressions were exceptionally interesting. Being alchemists, they were extremely clear just how difficult it was to increase one’s alchemy tier. However, this fellow in front of them had leaped from a tier 3 alchemist to a tier 6 alchemist within three short years. This kind of speed could only be described as frightening…</p><br/><p>“No wonder he is able to obtain the favor of that old man. This talent is really something that no one could match up to…”</p><br/><p>“Although the ‘Mixed Bone Molding Pill’ is a tier 6 medicinal pill, it is not extremely difficult to refine. With my current medicinal refining skills, I should have quite a high chance of success.” Xiao Yan ignored all the stunned gazes from around him and said with a smile, “Jia Lao can send someone to bring the medicinal ingredients over later. I will naturally hand over the medicinal pill tomorrow.”</p><br/><p>Jia Xingtian and Yao Ye exchanged looks after seeing Xiao Yan’s face which did not appear to be joking. They had difficulty hiding the joy between their brows as they hurriedly responded courteously. As long as they were able to allow the Serene Sea Scaly Beast recover its strength, the strength of the imperial family would naturally soar once again. If this were to be the case, it would cause them to be much calmer.</p><br/><p>“I will immediately dispatch someone to send the medicinal ingredients to mister Xiao Yan after this. We do not care about the success rate as long as mister is able to refine it. The imperial family is fine no matter how many medicinal ingredients are used.” Yao Ye joyfully laughed. Her tone appeared exceptionally extravagant. Although the medicinal ingredients used to refine the ‘Mixed Bone Molding Pill’ were no ordinary items, it was naturally not a problem for the rich stores of the imperial family.</p><br/><p>Xiao Yan smiled while looking at the two joyful people. He said, “The two of you need not thank me. You will be taking quite the risk in this decisive battle with the Misty Cloud Sect. Naturally, the more strong individuals the better. If that Serene Sea Scaly Beast is able to recover its strength, it would be a great help to us.”</p><br/><p>Yao Ye and Jia Xingtian hurriedly nodded when they heard this. The old man smiled until he could not shut his mouth. They did not lose out in this cooperation…</p><br/><p>Xiao Yan sighed in relief only after seeing that most of the things were settled. He threw his gaze out of the window and looked afar. His faint voice reverberated beside everyone’s ears.</p><br/><p>“I would like to ask everyone to gather all the fighting strength they can during these two days. Two days later, this large joint army of ours will fight to the death with the Misty Cloud Sect!”</p><br/>\n</div>"}