{"title": "Chapter 692: Females Picking On Each Other", "id": 692, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-692-females-picking-on-each-other", "volume_title": "Volume 7", "body": "<h1>Chapter 692: Females Picking On Each Other</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 692: Females Picking On Each Other</u></strong></p><br/><p>Xiao Yan smiled and said, “Relax, leave the Misty Cloud Sect to me. I will make them pay the blood debt that they owe our Xiao clan many times over. Of course, there is also the disappearance of father… I will get them to pay the price for all of these, a price that is worse than death.”</p><br/><p>“You are currently the pillar supporting the entire Xiao clan. As long as you remain standing, the Xiao clan will stand proudly. Hence, you must be extremely careful when you act!” Xiao Li softly said.</p><br/><p>Xiao Yan nodded slightly. He placed Xiao Ding’s reminder in his heart before lifting his eyes and slowly sweeping them around him. The clan members were currently no longer as cautious and anxious as they were earlier. A kind of unusual expectation and confidence filled their faces. The origin of this confidence came from him!</p><br/><p>At this moment, Xiao Yan once again sensed that the heavy burden on his shoulder was really heavy…</p><br/><p>“Father, rest assured that I will let the Xiao clan once again return to the peak in my hands! Definitely, definitely…”</p><br/><p>The Misty Cloud Sect’s attack on the Primer clan ultimately ended up with them suffering severe losses. Just as everyone thought that the strongest faction within the Jia Ma Empire would erupt into a thunderbolt-like anger, the former had unexpectedly descended into an unusual silence. This kind of strange action caused many people to be at a complete loss.</p><br/><p>Xiao Yan and the others might also feel surprise at this unusual silence of the Misty Cloud Sect but they did not think too deeply into it. Since the other party wanted to give them time to make contact with the other factions, they would do as the other party wished.</p><br/><p>Hai Bodong had also displayed an extraordinary effectiveness during this period of time. Within a short day, he had already made contact with the remaining few large factions of the capital. With the return of the strong Xiao Yan and his display of shocking strength in front of many people that day, there was naturally not a single faction who dared to easily slight Hai Bodong’s current suggestion. Hence, the contacting work was extremely easily.</p><br/><p>The meeting place where they would discuss matters was located at the Alchemist Association, which had been maintaining a neutral position within the Jia Ma Empire.</p><br/><p>Being the place that had gathered over half of the alchemist within the empire, the gathering ability that the Alchemist Association possessed within the Jia Ma Empire was naturally far from ordinary. Although chairman Fa Ma’s medicinal refining abilities were a little inferior to Pill-King Gu He, he was far beyond what the latter could compare with in terms of seniority. Hence, even Gu He had to be a little courteous in front of Fa Ma. Due to this, locating the meeting place in the Alchemist Association was not the least bit unappropriate.</p><br/><p>Xiao Yan coincidentally met Hai Bodong and Ya Fei who were about to leave when he arrived at the Primer clan early in the morning.</p><br/><p>“Hee hee, you little fellow…” Hai Bodong laughed out loud when he saw Xiao Yan. He was just about to greet the latter when he saw the beautiful face that contained a bewitching feeling behind Xiao Yan. His face twitched a little as he coughed dryly and said, “I was just about to send someone to look for you. I have already made contact with the imperial family, the Mu clan, and the Nalan clan to meet at the Alchemist Association today to discuss some collaboration issues.”</p><br/><p>Xiao Yan smiled and nodded. He patted Zi Yan’s head which was looking all around the place from his side. Since he was worried that this little girl would be abducted by Medusa to go and steal other people’s medicinal ingredients, he could only bring her by his side. However, he was somewhat speechless in the face of Medusa following him. It seemed that this woman possessed a great interest for Zi Yan.</p><br/><p>“Xiao Yan, this is?” Ya Fei, whose pretty face contained a gentle smile was also startled when she saw Medusa following close behind Xiao Yan. She immediately smiled and asked without revealing anything.</p><br/><p>“A friend. You can call her Cai Lin.” Xiao Yan appeared to have sensed that something was not quite right under the focus of Ya Fei’s watery peach blossom eyes. Hence, he could only answer vaguely.</p><br/><p>“Ke ke, so it’s Miss Cai Lin.” Ya Fei raised her eyebrows upon hearing this. She took two steps forward, observing Medusa’s exquisite, flawless face that caused even her to feel like exclaiming out loud. She smiled and said, “Miss Cai Lin is indeed beautiful. No wonder you are following beside Xiao Yan di-di.”</p><br/><p>TL: di-di - younger brother</p><br/><p>To the side, Xiao Yan was immediately startled when he heard Ya Fei’s words. These words were spoken as though he coveted other people’s beauty. Why was it that this Ya Fei jie was a little different today compared with yesterday? Was she jealous? Xiao Yan quietly pondered in his heart.</p><br/><p>TL: jie - older sister</p><br/><p>As a man, it was perhaps difficult for Xiao Yan to sense some of the thoughts of a woman. However, Medusa managed to sense the slight enmity and caution in the tone of the woman in front of her, who similarly possessed an extremely extraordinary appearance and demeanor. Her long eyelashes blinked slightly and her lazy eyes swept over Xiao Yan and Ya Fei. She could vaguely sense that this beautiful lady in front of her had some special feelings toward Xiao Yan.</p><br/><p>For some unknown reason, Medusa involuntarily knit her eyebrows when she thought of this. An unknown emotion rose in her heart. This kind of emotion caused her to feel somewhat frustrated. Hence, her pretty face turned to Xiao Yan and her tone turned a lot colder, “Why are we dragging on the conversation here instead of doing serious things?”</p><br/><p>Xiao Yan was also startled when he saw that Medusa’s expression had suddenly turned cold. His gaze immediately swept over both Ya Fei’s face and then her face. His heart felt puzzled. Why was it that both women were not quite normal today?</p><br/><p>“*Cough*...*cough*...*cough*...*cough*...*cough*” Hai Bodong by the side was an extremely experienced person in his old age. He managed to see the somewhat unfriendly atmosphere between Ya Fei and Medusa at a glance and immediately let out a dry cough as he hurriedly pulled Ya Fei behind him. Should this ferocious, beautiful female snake suddenly attack, Ya Fei would likely be unable to even endure a single blow given her strength.</p><br/><p>“Ya Fei, all of the auction houses of the clan will once again open today. These matters are also troublesome. You should hurry over to direct and settle them. Xiao Yan’s group and I still need to hurry to the Alchemist Association…”</p><br/><p>Although Ya Fei was somewhat unwilling, she could only nod her head when she heard Hai Bodong’s orders. However, just before she left, she slowly walked in front of Xiao Yan and extended her jade-like snow-white delicate hands to gently help him flatten his somewhat messy robe. She gently said, “Little fellow, don’t be impulsive in this meeting. Every person whom you can rope in is one extra person for you to use. It will also be good if they end up becoming a sacrifice. Now, you not only carry the fate of the Xiao clan… but you also owe me a promise. You better not shamelessly forget about it.”</p><br/><p>Xiao Yan sniffed the faint fragrance that was transmitted from in front of him and felt the gentle feeling that was brought over when Ya Fei’s delicate snow-white hand brushed against him. His heart moved a little as he revealed his bright white teeth and said with a smile, “Of course I will not forget about it. Just before I left back then, I had said that I will try my best to help you even if Ya Fei jie wants to become a queen in the future.”</p><br/><p>Ya Fei smiled as she covered her mouth and laughed lovingly, “I am not interested in being a queen…”</p><br/><p>Hai Bodong let out a dry laugh as he saw the two of them flirting with each other. He could sense that the face of Medusa behind Xiao Yan was becoming increasingly colder.</p><br/><p>“Alright, I shall take my leave first. All of you should hurry to the Alchemist Association. My information network has been observing the Misty Cloud Sect recently. I will inform you if there is any news.” Ya Fei patted Xiao Yan’s head gently and ceased lingering. When she turned her body, her gaze vaguely glanced at Medusa. Her sleek, red lips were raised a little, feeling a little joy.</p><br/><p>Xiao Yan watched her alluring figure sway as it slowly disappeared from his sight. Only then did he turn to Medusa, smile, and say, “Let’s go.”</p><br/><p>“If you have not seen enough, you can follow her and continue watching…” Medusa glanced at Xiao Yan as she laughed coldly. She immediately turned around and headed out of the manor.</p><br/><p>“This woman… why is she behaving so strangely today?” Xiao Yan shook his head when he saw Medusa’s back and spoke in a somewhat stunned manner.</p><br/><p>“She’s jealous. All women are like that…” Hai Bodong by the side laughed and immediately raised his thumb toward Xiao Yan. “Little fellow, you are really good. You actually managed to tame this beautiful female snake whose name frightened the entire Jia Ma Empire back then. One word! Impressive! Two words, Very strong! Three words, Very very strong.”</p><br/><p>TL: The one word, two word, three word thing sounds horrible because of translation</p><br/><p>What a cold joke...</p><br/><p>“Jealous?” Xiao Yan suddenly laughed out loud when he heard this. He immediately shook his head. He did not think that Medusa could possess such an emotion. Moreover, tame… forget about it. Who knew if she would immediately turn hostile after the one year agreement and kill him. It was better to avoid messing around with this kind of woman.</p><br/><p>“Ke ke, this little girl… seems to be a little different? In what way is she different? Why do I feel…” Hai Bodong suddenly paused his gaze on the white-clothed little girl who was holding Xiao Yan’s hand and spoke in surprise. He discovered that despite his strength, this little girl actually gave him a feeling of being difficult to see through. This kind of feeling caused him to be in an extremely bad mood!</p><br/><p>“Old man, don’t randomly look. Otherwise, I will ask Cai Lin jie-jie to beat you up! Perverted old man, go and die!” Zi Yan was somewhat displeased when Hai Bodong gaze swept over her. She curled her small mouth and spoke in a bratty manner.</p><br/><p>Xiao Yan smiled and patted Zi Yan’s head. He smiled and spoke to Hai Bodong, “You should not underestimate Zi Yan. There should hardly be anyone in the Dou Wang class who is a match for her. Even some Dou Huangs would not feel good after coming into contact with her punch…”</p><br/><p>Surprise flashed across Hai Bodong’s eyes when he heard these words. This little girl actually possessed such a frightening strength?</p><br/><p>Xiao Yan merely smiled in the face of the surprise on Hai Bodong’s face. He did not describe Zi Yan’s origin in detail, clearly understanding that Zi Yan’s potential was extremely extraordinary. Once he managed to refine a ‘Body Transformation Pill’ in the future, it was likely that her strength would not lose to Medusa… moreover, the frightening unusual strength of hers was something that even Xiao Yan was afraid of.</p><br/><p>It could be predicted that in the future, Zi Yan would be a great help of Xiao Yan. Albeit this day was going to be a little far away….</p><br/><p>“Let’s go to the Alchemist Association…” Xiao Yan stretched his lazy waist, and did not continue to be entangled on this topic. His gaze turned toward the spot where the Alchemist Association was located and laughed faintly, “Let’s go and see those old familiar faces. I wonder if after three years, I will have the feeling of the people being different despite the surroundings being the same.”</p><br/><p>“A small Da Dou Shi back then had already become an ultimate existence who could easily kill elite Dou Huangs. Isn’t this the feeling of people being different despite the surroundings being the same? For example, that old fellow Jia Xing Tian, he is still lingering at the peak of the Dou Huang class after three years. Yet you… have already completely transformed.” Hai Bodong laughed.</p><br/><p>“Hence, when you meet them this time around, the expressions of these people will definitely be more interesting compared to three years ago.”</p><br/><p>Xiao Yan smiled slightly when he heard the gloating tone in Hai Bodong’s voice. He pulled Zi Yan, turned around and walked out of the Primer clan. After which, he slowly walked in the direction of the Alchemist Association.</p><br/><p>“The imperial family, the Alchemist Association, the Mu clan… and the Nalan clan. We have really parted for a long time. I wonder if all of you still remembered the name Xiao Yan during these three years?” Xiao Yan passed through the numerous streets before his group appeared in front of the Alchemist Association’s entrance half an hour later. He looked at the familiar door of the Alchemist Association and slowly sighed while muttering within his heart.</p><br/>\n</div>"}