{"title": "Chapter 706: Fighting Gu He", "id": 706, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-706-fighting-gu-he", "volume_title": "Volume 8", "body": "<h1>Chapter 706: Fighting Gu He</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 706: Fighting Gu He</u></strong></p><br/><p>The atmosphere in the sky immediately became tensed with swords drawn after Gu He’s furious laughter sounded.</p><br/><p>The expressions of Jia Xing Tian and the others suddenly changed when they heard that Xiao Yan actually made such a promise. Although the former’s strength had soared greatly, there was quite a big risk if he wanted to defeat Gu He within ten exchanges. Today, all the factions had gathered and headed to the Misty Cloud Sect in the hopes of destroying it in one go. Moreover, there was a one hundred thousand member army from the imperial family that had begun to surround the foot of the mountain. If Xiao Yan were to make any mistakes at this moment and allow Gu He to receive ten of his attacks, did they really need to stop all their attacks, which they had prepared for a long time for?</p><br/><p>Would it not be too childish if this were the case? Once they withdrew today, it was likely that the Misty Cloud Sect would attack all out the next day and come and look for them one at a time.</p><br/><p>Xiao Yan waved his hand when he saw everyone’s expression. After which, he flapped his jade-green fire wings on his back and an unusual heat caused the people around him to feel a boiling hot feeling. The calm, young face caused Jia Xing Tian and the others to calm down a little.</p><br/><p>“Relax, given my blood feud with the Misty Cloud Sect, I will definitely not act recklessly…” Xiao Yan smiled and spoke slowly.</p><br/><p>Everyone exchanged glances with one another after hearing this. They did not continue saying anything upon seeing Xiao Yan’s insistence. No matter how one put it, they still held quite a lot of confidence toward the current Xiao Yan. Moreover, they clearly understood Xiao Yan’s character and naturally knew that he would not create some mess in such a place.</p><br/><p>“Xiao Yan, be careful. Gu He has already advanced to the Dou Huang class. Moreover, he also controls a kind of extremely powerful flame. Although it is not a ‘Heavenly Flame’, its strength cannot be underestimated.” Fa Ma reminded in a deep voice.</p><br/><p>Xiao Yan nodded slightly. His gaze glanced at the purple fire wings on Gu He’s back. As long as it was not a ‘Heavenly Flame’, it would not pose much of a threat to him.</p><br/><p>Jia Xing Tian and the others paused before slowly pulling back after a brief hesitation. They gave the both of them a spacious area in the sky.</p><br/><p>The private conversations below greatly diminished after everyone moved back. Although there had been lots of news about Xiao Yan spreading throughout the Jia Ma Empire recently, many people had never personally seen this young man, who had returned with great strength, in the one-sided battle within the capital that day. Hence, quite a number of people adopted an attitude of watching by the side with cold eyes when they heard that Xiao Yan shamelessly boasted that he could defeat Gu He within ten exchanges. Some of the experts who had quite the relationship with Gu He could not help but mockingly shake their heads. Everyone said that this fellow had a great strength but he was ultimately just a young, arrogant brat...</p><br/><p>Yun Shan once again turned around and sat back in the leader’s seat. His eyes looked at the two people in the sky and the corner of his mouth was lifted into a slight dark smile. He already knew that Gu He would be unable to endure this humiliation and intervene. Although the ten exchange agreement did exceed his expectations a little, it was likely that this would mean that Gu He would go all out. At that time, he should be able to cause Xiao Yan some injuries even if he lost to Xiao Yan.</p><br/><p>Below the wedding stage, Yun Yun could not help but raise her pretty face at this moment. A pair of bright eyes looked at the the black robe in the sky. She felt as though she had difficulty moving as she looked at the familiar face in a startled manner. The face had a little less tenderness and a little more maturity compared to three years ago. Clearly, the young man back then had completely transformed during these three years.</p><br/><p>A transformation from a weakling to a strong person!</p><br/><p>When Jia Xing Tian and the others withdrew from the sky, the atmosphere there suddenly became sharp with Gu He’s eyes staring intently at Xiao Yan in front of him. Three years ago, this black-robed, young man could only contest with his disciple. Yet, three years later, he actually dared to create this ten exchange agreement in front of him. This transformation was that between the Heavens and the Earth.</p><br/><p>“Today, I will defeat you in front of her!” Gu He slowly spoke. His voice had just sounded when an incomparably powerful purple Dou Qi surged out from his body. Dou Qi lingered on his skin and writhed repeatedly, appearing like clusters of purple-colored substance-like flame that was emitting a hot temperature.</p><br/><p>Xiao Yan’s voice did not fluctuate much as he glanced at the gloomy looking Gu He. “If you insist on allowing yourself to be wielded by Yun Shan like a spear, it is only natural that I will not show any mercy…”</p><br/><p>“In that case, we will see whether you have the qualifications to do so.” Gu He angrily smiled. He clenched his fist and Dou Qi fluctuated. An instant later, it agglomerated and formed a deep-purple longsword in his palm. A fierce flame burned on the longsword.</p><br/><p>Xiao Yan smiled. His hand faced the ground from a distance and suddenly grasped with his five fingers. With the grabbing of his hand, the black-colored ruler that had been inserted in the ground immediately shot out before transforming into a black shadow that flashed and returned to Xiao Yan’s hand.</p><br/><p>Quite a number of people let out an exclamation when they saw this skill that Xiao Yan had carelessly revealed. Being able to control a weapon from such a great distance would require one’s Dou Qi to reach quite a stringent precision. It was unexpected that Xiao Yan was able to have such control over his Dou Qi at such an age.</p><br/><p>“Ten exchanges.” Xiao Yan raised the heavy ruler flat and pointed it at Gu He before softly speaking.</p><br/><p>Gu He’s face trembled slightly. He did not continue to say any unnecessary words as his eyes widened. He let out a sharp cry and flapped the purple fire wings on his back. His body instantly transformed into a purple figure that shot explosively toward Xiao Yan in a lightning-like manner.</p><br/><p>His body flashed across the sky and the sharp sword tip easily cut through the air with the help of the powerful Dou Qi. In the blink of an eye, the sword’s tip had already reached Xiao Yan’s chest.</p><br/><p>“Clang!”</p><br/><p>A black figure flashed and an enormous heavy ruler strangely appeared in front of Xiao Yan. It was just like a thick shield that easily blocked the purple fire longsword.</p><br/><p>The sword and ruler collided, and a sharp wind immediately spread out from the point of contact. It shook the air and caused numerous ripples to form.</p><br/><p>“Chi!”</p><br/><p>Gu He’s wrist shook after his attack was futile. His sharp longsword was just like an unusual poisonous snake as it swiftly rotated and moved across the heavy ruler before piercing abruptly forward.</p><br/><p>“Clang!”</p><br/><p>The sharp longsword had just flashed past the heavy ruler when a long finger was swiftly extended out. The finger was immediately flicked and a glob of wind accurately struck the sword, bouncing it aside. The heavy ruler was waved at the same time and smashed toward Gu He’s face.</p><br/><p>Gu He’s body moved back and easily dodged Xiao Yan’s attack. His eyes suddenly became stern as the Dou Qi flowed wildly within his body. The sword trembled intensely and numerous afterimages instantly appeared in front of his body while it shook constantly.</p><br/><p>“Thousand Flame Sword Blades!”</p><br/><p>The sword images that appeared in all directions covered the front of Gu He’s body within a couple of breaths. His hand trembled and the purple fire longsword was shoved heavily forward. Immediately, the countless number of afterimages pierced toward Xiao Yan like a torrent.</p><br/><p>The hot sword images filled Xiao Yan’s eyes. Although the countless number of afterimages appeared illusionary, the force that was carried on them was not something that could be underestimated. If Xiao Yan were to carelessly receive such an attack, the true sword glow that was hidden in the afterimages would instantly appear unexpectedly, catching one completely unprepared.</p><br/><p>One would be able to see Gu He’s true ability just by looking at the sword technique Dou Technique he used. It was indeed not something an ordinary expert could compare with. Moreover, the Dou Qi was supported by the purple fire, giving it an even greater strength. Hence, numerous cheers sounded in the open ground below when Gu He’s attack was unleashed. The expression of Jia Xing Tian and the others involuntarily tightened.</p><br/><p>Compared to the cheers and worries of others, Xiao Yan’s mind was void of the slightest ripple. His gaze calmly looked at the hot sword images that came from all directions. The ruler in his hand was lifted horizontally and immediately drew a somewhat mysterious arc. His hand trembled and the body of the ruler carried blurry black figure that pierced out in a dexterous manner. Although it seemed to not carry any strength, the ruler technique faintly carried a great wave-like movement where one wave surpassed the other in terms of the sharpness in its attack.</p><br/><p>Chi! Chi!</p><br/><p>The heavy ruler that drew a mysterious arc instantly came into contact with the countless numbers of sword figures. In that instant, a powerful force suddenly erupted from the sword figure. In addition, regardless of how many sword figures there were, they had difficulty breaking through the boundary of the mysterious slow pace dance of the heavy ruler. This manner was as though arrows were raining down from all directions. When the arrows met the great sea-like waves, all of them were swallowed regardless of how many of them were present.</p><br/><p>Gu He’s face changed slightly as he sensed the strange force that was being emitted from the other party’s heavy ruler. He could sense that the sword that was hidden in the afterimages was gradually being pulled nearer the heavy ruler.</p><br/><p>“This little fellow does indeed have some skill!” This thought passed through his heart. His hand shook and a sword figure instantly escaped from the many afterimages, piercing toward Xiao Yan’s chest.</p><br/><p>The sword figure had just revealed itself when the heavy ruler that had a kind of strange dancing pace suddenly increased its speed. A suction force immediately erupted and pulled the longsword such that the direction of its attack changed.</p><br/><p>Gu He was startled when the direction of the longsword attack changed. He was just about to move when the black shadow in front of him suddenly flashed. A palm that contained a frightening force was violently struck over. Seeing the other party’s attack, Gu He refused to step back even a little. His expression turned cold and the Dou Qi on his palm swiftly agglomerated. He immediately pressed against Xiao Yan’s palm unceremoniously.</p><br/><p>“Bang!”</p><br/><p>Both palms collided and a soul-stirring explosion immediately erupted across the sky. Two human figures immediately shot back.</p><br/><p>Xiao Yan staggered. His withdrawing figure stabilized before he swung his wrist. He raised his head and looked at Gu He who had flown back a couple of dozens of meters only to smile. After the exchange earlier, he had already ascertained that Gu He’s current strength should be around that of a three star Dou Huang. Perhaps it was because of the purple fire but Gu He’s fighting strength was comparable to a four or five star Dou Huang.</p><br/><p>“Xiao Yan, we have already finished eight exchanges earlier.” Gu He flapped his purple fire wings to stabilize his body. He felt his somewhat numb hand before raising his head and letting out a cold laugh.</p><br/><p>Within a short blink of an eye, they had already exchanged eight moves. Yet, from the looks of the battle, it seemed that both parties were equal in strength. From the situation, it seemed that Xiao Yan’s shameless ten exchange agreement earlier was nothing but a joke.</p><br/><p>Gu He did not hide his voice. Hence, the faces of everyone in the open ground had suddenly turned somewhat interesting. Some people even burst out laughing. This fellow was indeed just a little brat who acted arrogantly by relying on that little strength of his.</p><br/>\n</div>"}