{"title": "Chapter 718: Unexpected Turn of Events", "id": 718, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-718-unexpected-turn-of-events", "volume_title": "Volume 8", "body": "<h1>Chapter 718: Unexpected Turn of Events</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 718: Unexpected Turn of Events</u></strong></p><br/><p>The huge open ground had turned unusually quiet at this very moment. Everyone’s faces were dull as they looked at this sudden unexpected change that had occurred. Some of the Elders from the Misty Cloud Sect were all at a loss. Was this mysterious Protector Wu not the sect leader’s helper? Why…</p><br/><p>The chewing sound reverberated across the unusually quiet sky. Some people could imagine just what kind of frightening scene was happening within the black fog. A person’s body became chilly just thinking about it.</p><br/><p>“What happened?” Xiao Yan was also shocked by this sudden scene. He tried his best to struggle and prevent himself from falling unconscious. He took out a medicinal pill from his storage ring and stuffed it into his mouth. He soon sensed the warm energy that appeared within his empty body. His blurry vision was also slightly clearer as his gaze stared intently at the cluster of black fog before asking in surprise.</p><br/><p>“That fellow seems to have swallowed Yun Shan’s spirit…” Yao Lao’s face was unusually solemn at this moment. He could sense the a dark, cold, unusual aura within the black fog was swiftly becoming stronger.</p><br/><p>Xiao Yan’s expression changed slightly when he heard this. It was unexpected that this Protector Wu was actually so ruthless. He had drawn out Yun Shan’s spirit without a word before swallowing it. From the looks of it, it seemed that today’s matter was not over.</p><br/><p>“The experts from the ‘Hall of Souls’ are extremely strange. It is unexpected that they are actually able to forcefully swallow spirits to increase their strength. However, according to what I think, this kind of Secret Technique should have an extremely great side effect. Even if he could successfully swallow Yun Shan’s spirit at this moment, it is likely that he will have to pay quite a hefty price in the future. Otherwise, he would not wait until this moment to use it.” Yao Lao spoke in a deep voice.</p><br/><p>“What do we do next?” The corner of Xiao Yan’s mouth twitched. The intense pain that was transmitted from his wrist caused his arm to repeatedly tremble. However, this moment was not the time for him to recuperate. Hence, he could only ask his question in a solemn manner.</p><br/><p>“We cannot allow him to successfully swallow Yun Shan’s spirit!” Yao Lao narrowed his eyes. A cold glint immediately flashed through his eyes. He waved his sleeves and a rich ‘Bone Chilling Flame’ appeared before rushing toward the cluster of black fog.</p><br/><p>The dense white flame flew across the sky. However, just as it was about to knock into the black fog, the latter suddenly fluctuated intensely. A dark, cold fog immediately surged out and collided with the flame. The two eroded each other before finally turning into nothingness.</p><br/><p>“Tsk tsk, Yao Chen, do you think you can break the Secret Technique of our ‘Hall of Souls’?” A strange dark laugh was emitted as the black fog fluctuated. The voice immediately changed and resounded through the sky, “Since Yun Shan is currently dead, there is no longer a need to support the Misty Cloud Sect. It is time that I should take some things back!”</p><br/><p>The expressions of all the Elders changed drastically when they heard the dark laughter being emitted from the black fog. They immediately seem to understand something and all of them hurriedly withdrew.</p><br/><p>However, just as their bodies moved, a strange suction force suddenly erupted from the cluster of black fog. This suction force swept in all directions. It did not pose much harm to an ordinary person but some of the bodies of those Misty Cloud Sect’s Elders who had turned around and fled suddenly stiffened. Their bodies stopped like puppets and a painful expression surged onto their faces, causing them to appear unusually distorted and ferocious.</p><br/><p>“What are you doing?” Yun Yun’s pretty face also changed greatly when they saw the distorted painful faces of the Misty Cloud Sect’s Elders. Some of these Elders were the mainstay of the Misty Cloud Sect. If any mishap were to happen to them, the Misty Cloud Sect would truly be finished.</p><br/><p>Yun Yun suddenly felt a powerful Dou Qi gradually surface within her body while she shouted. She was startled before immediately understanding that the seal that Yun Shan had placed on her body had begun to automatically disappear following his fall. The automatic undoing of the seal at this moment caused the despair on her face to become even denser.</p><br/><p>“Tsk tsk, they received their strength from my ‘Hall of Souls’. Otherwise, how can the strength of your Misty Cloud Sect soar so greatly within three short years? Since you have obtained the benefit, it is currently time to pay the price for it.” A dark, cold laugh was emitted from the black fog.</p><br/><p>“Out! Out! Out!”</p><br/><p>The cold cry of Protector Wu suddenly appeared. Immediately, the bodies of over a dozen Misty Cloud Sect’s Elders immediately became flaccid as they fell. Numerous illusionary spiritual bodies floated out from them in all directions and slowly rose into the air amid a countless number of shocked eyes. Finally, they were all absorbed into that cluster of black fog.</p><br/><p>Yun Yun’s lovely body trembled as she looked at the Misty Cloud Sect’s Elders who had instantly lost their lives. A green color gradually surged on her pretty face. A moment later, a furious sharp cry resounded over the place as a powerful Dou Qi surged out from her body!</p><br/><p>“Bastard! Return their spirits!”</p><br/><p>A pair of green-colored Dou Qi wings swiftly surfaced on her back as Yun Yun’s pretty face turned green. She immediately flapped her wings and instantly rushed into the sky before rushing over to that cluster of black fog.</p><br/><p>“Humph, overestimating your own strength! A smelly fool who thinks too highly of one’s strength!”</p><br/><p>Protector Wu within the black fog emitted a cold laugh when he sensed Yun Yun rushing over. A black-colored arrow aura suddenly shot at Yun Yun’s forehead.</p><br/><p>Yun Yun’s pretty face was ice-cold. She moved her finger and a thread of sharp sword aura rushed out from the tip of her finger before violently colliding with that arrow force. Finally, it completely disappeared, having offset this attack by the other party. Yun Yun flapped her wings and appeared beside the black fog. A sharp green-colored longsword, that gave off a bright luster, appeared. The sword shook. It carried a sharp sword cry and a sharp sword aura as it rushed toward the black fog.</p><br/><p>Bang! Bang! Bang! …</p><br/><p>The sword aura had just left when a low, deep sound was emitted from the black fog. The black fog suddenly surged and swallowed the sword aura before swiftly scattering in front of Yun Yun. The black fog surged and a majestic energy rushed toward Yun Yun.</p><br/><p>Powerful Dou Qi hurriedly surfaced from Yun Yun’s body as she sensed the swiftly scattering black fog. After which, it collided with the black fog.</p><br/><p>Bang! Bang!...</p><br/><p>Yun Yun’s body appeared to have received a heavy blow when the energy explosion sounded. She swiftly fell from the sky. Only after a couple of flaps from the wings on her back did she manage to stabilize her body while wearing a pale face. Given her strength, it was indeed difficult for her to contend with Protector Wu.</p><br/><p>“I’m afraid that it is over for this Misty Cloud Sect…” Xiao Yan looked at the Misty Cloud Sect’s Elders who were devoid of any lifeforce. After which, he took another glance at the pale-faced Yun Yun before shaking his head and speaking softly.</p><br/><p>“The greatest problem now is not the Misty Cloud Sect but that fellow.” Yao Lao’s expression was solemn. He could sense that Protector Wu’s aura had already been strengthened to a somewhat frightening extent after having absorbed the spirits of Yun Shan and a couple of Elders from the Misty Cloud Sect. It was difficult for the victor to be decided when these two engaged in the big fight earlier. However, now Protector Wu’s strength had soared and even Yao Lao was not confident that he could defeat Protector Wu.</p><br/><p>Xiao Yan smiled bitterly and nodded. Now that the Dou Qi in his body had been completely exhausted, he no longer had even a little strength left. Even if he wanted to lend a hand, he did not have the ability to do so.</p><br/><p>“The defensive layer of black fog when this fellow is swallowing spirits is unusually strong. It looks like it is impossible to interrupt… there might be some trouble today.” Yao Lao sighed. He turned his head to look at Xiao Yan by the side while a flicker was revealed in his eyes.</p><br/><p>This was the first time that Xiao Yan had heard that uneasiness and lack of confidence in Yao Lao’s words during all these years. His blood covered face changed a little as he spoke in a deep voice, “No matter what happens, I will not let teacher fall into the hands of the ‘Hall of Souls’!”</p><br/><p>Yao Lao smiled and patted Xiao Yan’s shoulders. He slowly said, “Just do your best. I have taught you whatever I can teach you. You will have to rely on yourself for everything else. Ke ke, the ‘Hall of Souls’ might be strong but sooner or later, there will be a day that you will be able to contend with them.”</p><br/><p>Xiao Yan’s heart suddenly tightened when he heard that Yao Lao was actually using a tone to settle the matters in the event of his death.</p><br/><p>The ripple of that cluster of black fog grew increasingly more intense while the two of them conversed softly. In the end, it seemed to be boiling as it repeatedly spat out black circles into the sky. After the black circle was spat out, the black fog began to swiftly shrink. A moment later, a human figure who was completely covered by a dark-black armor slowly appeared in front of everyone’s line of sight.</p><br/><p>The black-colored armor was dark and deep in color. It was made of an unknown material and was covered with strange lines. At a detailed glance, they were actually numerous ferocious looking human head lines. If one were to take an even more careful glance, one would discover that these human heads were those of the Misty Cloud Sect’s Elders whose spirits were forcefully sucked away.</p><br/><p>This unusual dark scene caused everyone present to feel intimidated. Their hands and feet were ice-cold.</p><br/><p>Protector Wu revealed himself once again. A dark, cold aura that was at least a couple of times stronger than earlier slowly rose. Finally, it covered the entire Misty Cloud Mountain. At this moment, the originally clear sky also turned dark as a chilly wind blew one after another.</p><br/><p>“This vicious demon!”</p><br/><p>Yun Yun’s entire body trembled as she looked at the human heads that had surfaced on the unusual armor, which were filled with pain. She clenched her silver teeth tightly. An unusual fury caused her pretty face to become slightly distorted!</p><br/><p>“This protector’s target is Yao Chen and it has nothing to do with you. If you continue to act fretfully, this protector will first eliminate your Misty Cloud Sect before even Xiao Yan can.” Protector Wu who had appeared glanced indifferently at Yun Yun and laughed in a dark, cold manner.</p><br/><p>Yun Yun inhaled a deep breath of air. She slowly suppressed her fluctuating mood. She immediately waved her delicate hand and an angry cry resounded across the sky.</p><br/><p>“All Misty Cloud Sect’s disciples, deacons, Elders, listen up!”</p><br/><p>“Form the formation!”</p><br/><p>The countless number of Misty Cloud Sect’s disciples on the open ground were initially startled when they heard Yun Yun’s order before immediately agreeing with a united furious sound. They let out numerous orderly voices before sitting cross-legged on the ground. Finally, waves of unceasing white-colored energy fog surged out from all directions.</p><br/><p>“Stubborn fool!”</p><br/><p>Protector Wu immediately let out a dark, cold laugh when he saw Yun Yun’s action. However, just as she was about to act, a sharp forceful sword aura suddenly shot to the sky from the mountain behind the Misty Cloud Sect. A clear, sharp whistle resounded in everyone’s ears.</p><br/><p>A powerful aura suddenly surged from behind the mountain the moment the sword whistle sounded.</p><br/><p>“This aura…” Xiao Yan was slightly startled in the sky before he suddenly narrowed his eyes.</p><br/><p>“Nalan Yanran?”</p><br/>\n</div>"}