{"title": "Chapter 740: Meeting an Acquaintance", "id": 740, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-740-meeting-an-acquaintance", "volume_title": "Volume 8", "body": "<h1>Chapter 740: Meeting an Acquaintance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 740: Meeting an Acquaintance</u></strong></p><br/><p>Ling Er’s gaze paused momentarily on the black robe before swiftly shifting up. A young, handsome face that was covered with a calm expression appeared in her sight.</p><br/><p>She opened her sleek, red, small mouth as she looked at the young face, feeling somewhat absent-minded. For some unknown reason, she repeatedly felt that she seemed acquainted with this face. However, she was still unable to think of where she had seen it no matter how she recalled at this moment.</p><br/><p>Ka Gang, who was on the ground after being beaten, took the opportunity to climb to his feet. He ignored the trace of blood on the corner of his mouth and charged forward to protect Ling Er. He raised his head and spoke with gratitude to the black-robed, young man in front of him, “Mister, thank you very much for rescuing us!”</p><br/><p>Many people on the street had also recovered at this moment. Their gazes were shocked as they looked at this black-robed, young man who appeared quite young. Although they were very surprised that he was able to force back the scarred man, who was a three star Dou Shi, with a strike, many people revealed pitiful gazes toward him. Did this little, young fellow not know just how arrogant and despotic the Snake Nest Mercenary Company was in the Qingshan Town? With the support of the He clan from the Black Rock City, no one within a five hundred kilometer radius of the Magical Beast Mountain Range dared to offend the Snake Nest Mercenary Company. It was for no reason other than this He clan possessed an expert who was a genuine Dou Wang!</p><br/><p>The few men who were clearly people from the Snake Nest Mercenary Company hurriedly ran to help the man with the blade scar up since he was injured. After which, many pairs of vicious gazes were thrown toward the black-robed, young man.</p><br/><p>“ Pooh!” The scarred man stood up with great difficulty. His face was pale as he spat out the fresh blood in his mouth. His gaze was vicious as he looked at Xiao Yan’s calm face. He laughed furiously, “Good little fellow, you are really bold. You actually dare to offend our Snake Nest Mercenary Company in Qingshan Town? Do you not know that our Company Leader is the son-in-law of the He clan?”</p><br/><p>Xiao Yan faintly glanced at the scarred man and shook his head. He had really not heard of the so-called He clan.</p><br/><p>“This sir, Ka Gang is extremely grateful to you for your favor. However, you should try to leave as soon as possible. Once the experts from the Snake Nest Mercenary Company arrive, it will be difficult for you to leave.” Ka Gang sighed softly as he looked at the vicious gaze of the scarred man. He pushed Ling Er toward Xiao Yan and softly begged, “Mister, please bring Ling Er and leave Qingshan. If you feel that it is troublesome, you can get her to leave after you exit the small town. I will stop them!”</p><br/><p>“I won’t go! If you are going to die, let’s all die together. In any case, the Bloody Battle Mercenary Company will definitely be unable to live beyond today. There is no meaning to me living if that is the case.” Ling Er did not move when she heard this. She simply clenched her teeth and cried.</p><br/><p>“You…” Ka Gang became furious. However, he could only sigh dispiritedly when he saw the tragic face of Ling Er. He waved his hand and said, “Forget it, forget it, you should hold the dagger under your sleeves properly. If you are captured, you can commit suicide to avoid being humiliated.”</p><br/><p>Xiao Yan by the side looked at these two people while feeling neither able to laugh nor cry. He shook his head and laughed softly, “Uncle Ka Gang, you can be reassured that if I wish to protect the two of you today, no one in this Jia Ma Empire will dare touch you.”</p><br/><p>Ka Gang was startled in the face of Xiao Yan’s somewhat familiar form of address. He bitterly laughed, “I appreciate mister’s good intention. However, the Snake Nest Mercenary Company is not something that you can contend with. Ling Er and I will delay them. You should leave quickly.”</p><br/><p>“Hee hee, leave? You want to leave after wounding your grandpa? How could there be such a nice thing?” A savage smile immediately formed on the scarred man’s face on the other side. His hand swiftly took out a fire cylinder from his chest pocket. After which, he pulled at it and a signal flew to the sky before exploding.</p><br/><p>TL: Calling oneself another person’s grandfather is a form of insult</p><br/><p>“All the exits in Qingshan Town have been sealed by my Snake Nest Mercenary Company. Where can all of you go to?” That scarred man looked at Ka Gang and Ling Er whose faces instantly turned pale. The sinister smile on his face grew even wider. With a wave of his hand, he cried out furiously, “Kill everyone other than that girl.”</p><br/><p>Over a dozen people behind that scarred man immediately spread out upon hearing the order. They drew their sharp weapons from their waists and covered them with a thin layer of Dou Qi. After which, they looked at Xiao Yan with ill intent.</p><br/><p>Xiao Yan was expressionless as he watched the ten plus people that had swiftly charged over. He slowly stepped forward and spoke in a calm voice, “Anyone who takes another step forward will die!”</p><br/><p>These words of Xiao Yan ended up with only the cold laughter of the ten plus people. It was naturally impossible to stop the latter’s footsteps by even a little.</p><br/><p>Xiao Yan lowered his eyes when he saw this. A faint fierce glow flashed across them. An invisible flame quietly rose on the tip of his finger.</p><br/><p>Puff! Puff!</p><br/><p>A strange scene quietly appeared on the street the moment the flame appeared. All one could see was that the bodies of those ten plus individuals, who were charging toward Xiao Yan, suddenly stiffened. Immediately, they emitted a puff sound in front of the many stunned gazes from around and without any warning… transformed into black ashes that scattered over the ground!</p><br/><p>The somewhat noisy street had suddenly become quiet at this moment. Everyone widened their eyes and stared at the large pile of black ashes that appeared on the ground in a terrified manner. Some people had merely blinked their eyes but when they opened them once again, they could only watch people, who had been perfectly normal a moment ago, transforming into a pile of ashes in front of their eyes…</p><br/><p>This strange scene caused a chill to appear from deep within the hearts of a countless number of people. Although the hot sun was currently in the sky, cold sweat repeatedly rolled down their forehead.</p><br/><p>The mouth of that scarred man who had a fierce aura had opened as wide as a duck’s egg at this moment. His eyes were filled with shock. It was a long while later before he recovered. His body hurriedly moved back. He staggered and fell onto the ground as he spoke in shock, “You… what are you doing?”</p><br/><p>When Xiao Yan had acted a moment earlier, he had failed to sense even the slightest ripple of Dou Qi. Yet, those ten plus people had bizarrely turned into black ashes.</p><br/><p>With the emission of the scarred man’s shocked voice, Ka Gang and Ling Er also recovered from their shock. They looked at the black-robed, young man in front of them and a wild joy gradually surfaced in their eyes. It was unexpected that this young man actually possessed such a frightening strength. It seemed that they had regained the hope of being rescued.</p><br/><p>Xiao Yan’s gaze indifferently looked at the scarred man who was staggering back. His hand was slowly lifted as it pointed toward the latter from a distance. The invisible flame suddenly flashed and appeared in his palm.</p><br/><p>Puff!</p><br/><p>Another deep muffled sound appeared. The scarred man had yet to reveal even the slightest expression when the fierce heart flame that had appeared within his body incinerated him into a pile of black ashes.</p><br/><p>Everyone on the street involuntarily inhaled a breath of cold air as they watched the scarred man also transform into ashes. Their gazes were appalled as they looked at Xiao Yan while their feet involuntarily took a couple of steps back. From the looks of it, they seemed to be afraid that Xiao Yan would suddenly point that finger of a grim reaper toward them. Only at this moment did they understand that this young person was not trying to act strong as he stepped forward but he truly possessed the qualification and strength to look down on the Snake Nest Mercenary Company.</p><br/><p>Xiao Yan gently patted his hands on each other after randomly finishing off these people. There was not much fluctuation within his gaze despite having taken over a dozen lives. Given the wicked and fierce aura of these people, it was obvious that they were definitely not good people. It was nothing if he killed them. He would not feel the slightest burden.</p><br/><p>Xiao Yan turned his head and looked at Ka Gang and Ling Er. He laughed softly and slowly said, “Uncle Ka Gang, it has been so many years since we have seen each other. It is unexpected that you are still in this small Qingshan Town.”</p><br/><p>Ka Gang, whose gaze was originally filled with respect and fear, was immediately stunned when he heard these words from Xiao Yan. He carefully studied the latter’s face. His heart, however, was muttering about when he had become acquainted with such a strong person.</p><br/><p>Ling Er by the side was staring intently at that face. She knew she had met him before while Ka Gang was feeling uncertain. She suddenly muttered softly a moment later, “Uncle Ka Gang, he seems to be somewhat similar to Xiao Yan who had destroyed the Wolf Head Mercenary Company a couple of years ago…”</p><br/><p>Ka Gang’s body suddenly shook when he heard Ling Er’s words. His body suddenly trembled as he looked at Xiao Yan with disbelief. The memory that was buried deep under the years was swiftly found. Finally, the young man’s somewhat tender face, whom he had met once back then, slowly matched up with the Xiao Yan in front of him.</p><br/><p>“Little brother Xiao Yan… is it really you?” Ka Gang cried out involuntarily while the shock in his eyes became denser. The Xiao Yan back then was merely a Dou Zhe who had not even reached the Dou Shi class. Yet, now, he was able to turn over a dozen Dou Zhe and a Dou Shi into ashes by raising his hand. How could that tender, young man compare with this demeanor of an expert?</p><br/><p>Xiao Yan smiled slightly and nodded.</p><br/><p>Ka Gang’s face was instantly filled with joy when he saw Xiao Yan nod his head. He immediately hesitated a little before clenching his teeth abruptly as he knelt down. He begged, “Brother Xiao Yan, the Bloody Battle Mercenary Company has met with a great disaster. I beg you to lend a hand and rescue it. Ka Gang is willing to do anything you say after it is over!”</p><br/><p>Ling Er was also biting her red lips gently and looking at Xiao Yan from behind Ka Gang. Emotions were churning within her heart. Who could have imagined that the young man, whom she had repeatedly ridiculed due to her immaturity, was actually currently in possession of such a terrifying strength.</p><br/><p>Ling Er also hurriedly knelt down as this thought churned in her heart. If she wanted to rescue the Bloody Battle Mercenary Company, she could only rely on this young man in front of her.</p><br/><p>“His name is similar to the chief of the ‘Yan Alliance’ that has recently spread and caused an uproar. However, it is rumored that the chief of the ‘Yan Alliance’ holds a strength that can fight with a legendary elite Dou Zong. Looks like it is only a situation where their names are similar…” Ling Er’s gaze flickered while she softly spoke in her heart. There should be at least a few hundred if not thousands of people with the name Xiao Yan in the enormous Jia Ma Empire. Moreover, the chief of the Yan Alliance was far too glaring. Even she did not dare to think along that line. She only thought that their names were similar.</p><br/><p>Xiao Yan waved his sleeves and a gentle force lifted the two people to their feet. He softly asked, “Is it that Snake Nest Mercenary Company? What is their strength like?”</p><br/><p>Ka Gang hurriedly nodded when he heard this. He quickly replied, “Their Company’s leader is a six star expert Dou Ling with an extremely great strength. No one could match him within the entire Qingshan Town. I wonder if little brother Xiao Yan can…”</p><br/><p>“Six star Dou Ling huh…” Xiao Yan mused for a moment before he immediately laughed, “Uncle Ka Gang, I still need to enter the Magical Beast Mountain Range to do something during this trip of mine. Perhaps I won’t be able to remain for too long here…”</p><br/><p>Ka Gang’s expression immediately became gloomy when he heard Xiao Yan’s words. His body appeared to have all of its energy sucked out from it. Ling Er behind him also clenched her hand tightly. She miserably mocked herself. Even though that person had some friendship with them back then, it did not reach the point where he would help them offend an expert Dou Ling.</p><br/><p>“You should hold onto these five bottles properly. If you are to meet the Company leader of that Snake Nest Mercenary Company, you can use Dou Qi to activate them. After which throw one of them over. The danger will naturally resolve itself automatically. Additionally, this jade plate can make contact with me once. If you really meet with a big matter of life and death in the future, you can break it. I will appear and help you.” Xiao Yan flicked his finger. Five small jade bottles and a jade plate flew toward Ka Gang. Each of the jade bottles possessed an extremely tiny fire lotus.</p><br/><p>Ka Gang was startled as he received the jade bottles. He was somewhat in a daze. The Company leader of the Snake Nest Mercenary Company could actually be killed by relying on these small jade bottles?</p><br/><p>“I still have other matters to do today so I will bid you goodbye. We should be able to meet again if there is a chance in the future.” Xiao Yan smiled. He did not wait for Ka Gang to recover when his body shook and strangely disappeared in front of the many stunned gazes around him.</p><br/><p>“Cluck!”</p><br/>\n</div>"}