{"title": "Chapter 743: Little Fairy Doctor?", "id": 743, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-743-little-fairy-doctor", "volume_title": "Volume 8", "body": "<h1>Chapter 743: Little Fairy Doctor?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 743: Little Fairy Doctor?</u></strong></p><br/><p>Xiao Yan’s cry was like thunder that reverberated over the mountain range. The black figure that was about to disappear paused momentarily because of his voice.</p><br/><p>Xiao Yan looked at the human figure that had paused momentarily in the distance. The guess in his heart was confirmed by their hesitation. He did not expect that he would still be able to see her in this place after so many years. However, why was the current her completely different compared to the past? Could it be… Could it be that the so-called ‘Woeful Poison Body’ had already completely erupted?</p><br/><p>When this thought rolled in Xiao Yan’s heart, he flapped the wings on his back abruptly without thinking. His body rushed over toward the black figure.</p><br/><p>The black figure shook a little after it seemed to have sensed Xiao Yan’s actions. However, it did not turn around. The dense gray fog surged out from its body. Immediately, the gray fog burst apart amid a slight muffled sound. The figure strangely disappeared into nothing.</p><br/><p>The cluster of gray fog that had burst apart swiftly scattered after the human figure vanished. A moment later, it turned into nothingness.</p><br/><p>Xiao Yan’s figure flew across the sky. By the time he chased and shot over, the black figure had already completely disappeared without a trace. He could only tense up his face, tightly clench his fist and softly cursed, “This person… why does she not dare see me?”</p><br/><p>Medusa also swiftly followed behind Xiao Yan. Her gaze cautiously swept over the sky and immediately asked with a frown, “You are acquainted with the person from earlier?”</p><br/><p>“If I have guessed correctly, that person should be a friend of mine from many years ago. However…” Xiao Yan bitterly laughed. He thought about the matter. In the end, he did not reveal the matter of the Little Fairy Doctor possessing the ‘Woeful Poison Body’.</p><br/><p>“This person’s poison skill is strange and unpredictable. However, its emotional fluctuation seem to be quite great when I exchanged blows with them earlier. Its seems like this person is awake at times and unconscious at others… perhaps the reason that they are unwilling to meet you is because of this.” Medusa did not press Xiao Yan over the matter. She changed the topic and voiced her thoughts.</p><br/><p>Xiao Yan’s face was tense as he searched around him while feeling some dissatisfaction. However, it was a futile attempt. He could only gently inhale a breath of air. From the looks of the situation, it seemed that the worse possible situation she had mentioned, when they parted back then, had already occurred…</p><br/><p>“That person has already left. Let’s go back. Zi Yan is still in the valley.” Medusa said.</p><br/><p>Xiao Yan could only nod his head when he heard this. He turned around, hesitated for a moment, before turning back once again. While he looked at the vast sea of trees, he suddenly spoke in a deep voice, “Little Fairy Doctor, I may not know what has happened to you during these years, but I said back then that no matter how you change, I, Xiao Yan, will still see you as my friend. This promise has not been shaken even a little even until now!”</p><br/><p>Xiao Yan’s voice rolled over this mountain range while being carried by some Dou Qi. It was a long while later before it gradually disappeared.</p><br/><p>There was still no reaction after his voice sounded. Xiao Yan laughed out bitterly. He could only turn around and fly toward the valley with Medusa.</p><br/><p>A black figure looked at the figure that had just turned around on the top of a mountain where unusual rocks stood. The black figure’s pale-white hand grabbed tightly onto an enormous rock by the side. One could see that the enormous rock actually emitted waves of white fog after the hand grabbed onto it. A ‘chi chi’ sound continued unceasingly.</p><br/><p>The black figure’s eyes watched Xiao Yan until he returned to the valley. Only then was the hand slowly released. A black handprint that was an inch deep was left behind on the enormous rock.</p><br/><p>Some loss surfaced in the indifferent gaze under the black-colored cloak. A moment later, numerous scenes that had been buried deep within her memories quietly rose. That young man called Xiao Yan also appeared.</p><br/><p>“Xiao Yan…” A clear female’s voice that carried a distant memory was emitted from under the cloak. This voice was completely different from the awful hoarse voice from earlier. Clearly, she had used that voice on purpose in order to hide her identity.</p><br/><p>“It is unexpected that I would meet you once again… I came here to wait for half a month every year. However, since you have appeared again, I will not come here again in the future…” The pale-white hand slowly pulled open the cloak covering her head. Immediately, white snow-like hair came pouring down like waterfall. An ashen face that was somewhat thin was revealed in the air.</p><br/><p>This face still had some of the contour from back then. However, it had lost the gentle smile and the ethereal demeanor that warmed a person’s heart. Instead, her eyes revealed an additional gray-purple. At a glance it appeared like threads of coldness and ruthlessness were being emitted from the demon-like appearance.</p><br/><p>At this moment, this face that was viewed like a grim reaper within the Chu Yun Empire faintly contained some memories and bitterness.</p><br/><p>“Don’t blame me for not meeting you. I only hope to forever maintain that kind Little Fairy Doctor in your heart and not the current one whose hands are filled with countless amounts of blood… the Poison Woman.”</p><br/><p>“It is just that I did not expect the words that I said back then to become true. Hopefully, we will not meet again in the future… my fate is like this. Being born from disaster and dying amid disaster…”</p><br/><p>Those gray-purplish eyes studied the little mountain valley from a distant. The memories from back then churned in her mind, causing a warm smile to slowly lift on the face, which had maintained a cold indifference for a couple of years. From this smile, one could vaguely see a resemblance to the Little Fairy Doctor. It was the same smile that caused a countless number of mercenaries within Qingshan Town to think of her as the fairy in their hearts…</p><br/><p>The smile was like an epiphyllum, scattering after only being maintained for an instant. She slowly shut her eyes. A moment later, her eyes once again recovered their earlier indifference after being opened once again. Those eyes glanced at the valley for the final time before she put on her cloak and ceased feeling any nostalgia. Her body transformed into a gray fog and quietly disappeared…</p><br/><p>By the time Xiao Yan and Medusa had returned to the small valley, they saw that Zi Yan’s little face had become somewhat purplish-red. Both of them immediately became anxious. It was unexpected that the poison of the Little Fairy Doctor was actually this frightening. Zi Yan had only inhaled a little of it, but such a symptom had already appeared. A poison master was indeed an occupation that created only fear and hate.</p><br/><p>Although Zi Yan’s face was purplish-red, her mind was still conscious. She hurriedly came forward to greet Xiao Yan and Medusa when she saw the two return. However, her breathing had clearly become much rougher compared to before.</p><br/><p>Xiao Yan grabbed Zi Yan’s arm and inserted a thread of Dou Qi into her body. He searched her body but was unable to find even a little trace of the poison. His face immediately sank. It was unexpected that the antidote he had refined actually did not have much effect on this poison air…</p><br/><p>“How is she?” Medusa hurriedly asked after seeing Xiao Yan’s action.</p><br/><p>“I am unable to find where things are amiss. Looks like the poison is hidden very deeply. It is just that I don’t know what the poison is like…’ Xiao Yan shook his head as he replied.</p><br/><p>“The poison all over that fellow is something that even I am afraid of, much less Zi Yan. What do we do now?” Medusa asked with an ugly expression.</p><br/><p>Xiao Yan hesitated for a moment. He flipped his hand and the jade bottle that the Little Fairy Doctor had tossed over earlier appeared in his hand. Medusa by his side knit her brows tightly when she saw this. She demanded, “You want to use the thing that figure gave you? Who knows whether the thing that this strange person gave you is really an antidote. Who is going to be responsible if any accidents happen and Zi Yan is harmed?”</p><br/><p>Xiao Yan helplessly shook his head when he saw Medusa’s protective manner. He did not think that the latter had already started to cherish Zi Yan to such an extent. He could only reply, “Although I don’t know what happened to her, I believe that she would not lie to me. Moreover, do you have any other method if we do not use this? Being poisoned is a matter that cannot be delayed.”</p><br/><p>Medusa also hesitated for a moment when she heard this. A moment later, she could only nod her head. After all, there was currently no other solution to this matter.</p><br/><p>“If there is any problem with the antidote, I will definitely take that person’s life no matter who she is!” Medusa coldly spoke with some worry when she saw Xiao Yan pour out a bright-red medicinal pill from the jade bottle.</p><br/><p>Xiao Yan nodded helplessly. He stuffed that medicinal pill into Zi Yan’s mouth. The latter obediently swallowed it. However, it seemed that this medicinal pill’s taste was not good, resulting in a frown to form on her small face.</p><br/><p>Although the medicinal pill tasted awful, its effects were clearly quite good. The purple-red color on Zi Yan’s small face immediately began to disappear at a rate visible to the naked eye after the pill had just entered her body. It completely disappeared in merely a moment.</p><br/><p>Xiao Yan and Medusa sighed in relief when they saw this scene. The former wiped cold sweat off his face. He bitterly laughed. It was unexpected that given his current alchemy skill, he was actually rendered helpless by a random amount of poison gas by the Little Fairy Doctor. Although their studies were different, poison and medicinal pills did indeed have some similarities regardless of how one put it. Hence, Xiao Yan naturally felt somewhat helpless.</p><br/><p>“Ugh, I really don’t know just what she has experienced during these years. Not only did her strength soar to an extent where even Medusa has to treat her seriously but her poison skills have also become so unpredictable…” Xiao Yan sighed softly within his heart. His gaze was thrown toward the small cottage. Back then, she had secretly hid herself in this place and swallowed poison while he was training. The moment he thought about how such a kind and cute girl had to swallow those lethal poisons all day, Xiao Yan’s heart involuntarily felt a soreness. She was a woman who had the roughest fate among all the people whom he had met during these years.</p><br/><p>However, compared to the soaring of the Little Fairy Doctor’s strength and poison skills, the thing that caused Xiao Yan to feel most uneasy was the cold and indifferent gaze which could even be said to be numbing. It was difficult to imagine that these eyes would appear on that warm and kind girl from back then.</p><br/><p>Xiao Yan swung his head with all his might and tossed aside the thoughts in his head. He slowly walked toward the small straw cottage. In any case, he should first get his strength to breakthrough to the Dou Huang class. Xiao Yan had a premonition within his heart that he might still see the Little Fairy Doctor again in the future… however, he did not know just what kind of situation it would be when they next met.</p><br/>\n</div>"}