{"title": "Chapter 763: Three Thousand Lightning", "id": 763, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-763-three-thousand-lightning", "volume_title": "Volume 8", "body": "<h1>Chapter 763: Three Thousand Lightning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 763: Three Thousand Lightning</u></strong></p><br/><p>The hearts of everyone in the fortress tightened when they looked at Xiao Yan who had momentarily fell into a disadvantage. Medusa’s battle with Yan Luo Tian had already entered into a white-hot stage. If Xiao Yan was unable to block the three Mulan Elders at this moment, it was likely that the effect would be too horrible to imagine.</p><br/><p>“Relax, there should not be any problem. That fellow still has many trump cards which he had not used.” Hai Bodong was frowning intently while he laughed and tried to comfort himself.</p><br/><p>Jia Xing Tian and the others nodded slightly when they heard this. They were extremely clear about the tactics of Xiao Yan. The might of the unusual fire lotus that caused even Yun Shan to be blasted until the point where he lost his fighting strength was extremely frightening. If Xiao Yan created this thing, it was likely that an elite Dou Zong would suffer quite a great disadvantage when facing him.</p><br/><p>Yue Mei by the side shook her head when she heard them speak. She did not understand Xiao Yan. Hence, she was not clear about what kind of tactics Xiao Yan possessed. All she did was to watch the earlier battle where Xiao Yan had clearly fallen into a disadvantage. If this continued for some time, it seemed certain that Xiao Yan would be wounded.</p><br/><p>“This fellow is indeed overexerting himself…” Yue Mei quietly sighed within her heart. A bitter smile also surfaced on her face.</p><br/><p>After having conversed briefly with the few people on the fortress, she had hurriedly thrown her gaze toward the two battlegrounds in the sky that would determine the fate of the Jia Ma Empire.</p><br/><p>The wings on Xiao Yan’s back flapped and his body was suspended in the sky. A glow swiftly flashed across his dark-black eyes.</p><br/><p>After the couple of probes he made earlier, he had discovered that it seemed that only one of the three of them could attack at any single time. This person’s aura would also be raised to the point where it could contend with a Dou Zong at that instant. In other words, it meant that the ‘Three Beast Savage Skill’ that the three of them practiced combined the strength of the three of them together in order to reach the Dou Zong class. This kind of Dou Zong strength could only be used by one person. While this person was using it, the strength of the other two would definitely decline.</p><br/><p>This kind of Qi Method was similar to a situation where the strength of the two remaining people was temporarily given to the third person, enabling him to possess a Dou Zong class strength.</p><br/><p>Xiao Yan narrowed his eyes slightly. If this was really the case, this Qi Method of theirs might be forced to reveal quite a big flaw as long as he dodged the Dou Zong class person and took advantage of the situation to attack the other two.</p><br/><p>Xiao Yan’s body paused for a moment. However, the three Mulan Elders did not give him much time to catch his breath. That tiger-headed Elder once again moved and suddenly rushed out.</p><br/><p>A low, deep tiger roar was emitted from his mouth and the blood-colored glow grew even denser. The tiger-headed Elder clenched his fist and the blood-colored glow surged. It immediately agglomerated into an extremely sharp energy tiger claw. The tiger claw cut through the empty air and left behind a couple of faint scars.</p><br/><p>“Brat, go and die!”</p><br/><p>The tiger-headed Elder let out a roar and his body suddenly shot forward. He appeared in front of Xiao Yan in an instant, and his sharp tiger claw appeared exceptionally strange under the dye of the blood-colored energy. His hand trembled and the tiger claw grabbed at Xiao Yan’s throat in a vicious manner. From the looks of its momentum, it was likely that Xiao Yan would die on the spot if he were to be grabbed by it despite having the protection of the Glazed Lotus Core Flame.</p><br/><p>Xiao Yan’s eyes slightly shrank as he observed the tiger claw being swiftly enlarged. The silver glow under his feet suddenly flashed in a strange manner and his body also trembled slightly.</p><br/><p>Chi!</p><br/><p>The tiger claw contained an incomparable force as it lunged forward. It immediately grabbed Xiao Yan’s throat violently in front of the countless number of shocked gazes in the fortress. However, the expected fresh blood did not appear despite Xiao Yan’s throat being struck. Instead, the claw passed right through it.</p><br/><p>Those shocked gazes on the fortress only finally let out a heavy sigh of relief after seeing this.</p><br/><p>“An afterimage?”</p><br/><p>The tiger-headed Elder let out an exclamation after the tiger claw passed through the figure. He immediately let out a cold laugh as his foot suddenly and violently kicked toward a certain part of the air without turning his body.</p><br/><p>“Bang!”</p><br/><p>The foot contained a powerful strength as it was heavily swung toward a certain part in the air. A black figure immediately flashed as it flew back upon being kicked by this powerful force.</p><br/><p>The tiger-headed Elder turned his head. His gaze was filled with a bloodthirstiness as he looked at Xiao Yan who flew back, only to be startled. He could clearly see a cold smile on the face of this young man.</p><br/><p>The tiger-headed Elder’s eyes moved after his heart became momentarily startled. He realized that the direction in which Xiao Yan was pulling back was where the lion-headed Elder was positioned in the formation.</p><br/><p>During this split second, Xiao Yan had borrowed the momentum from the kick of this tiger-headed Elder and instantly flashed to the front of this lion-headed Elder. He clenched his fist and the green veins on his hand swiftly expanded like worms before viciously stricking forward.</p><br/><p>“Octane Blast!”</p><br/><p>A low, deep cry sounded as Xiao Yan’s fist smashed toward the lion-headed man’s heart area in a lightning-like manner. However, Xiao Yan’s expression suddenly changed when he was just about to strike. This was due to him discovering that an elite Dou Zong class aura had suddenly surged out from the body of the lion-headed Elder.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s fist carried a powerful aura as it heavily smashed into the chest of the lion head Elder. The chest of the latter slowly caved in at a frightening arc.</p><br/><p>The lion-headed Elder’s gaze was dark and cold as he looked at Xiao Yan in front of him, whose expression had changed slightly. He smiled in a sinister manner as he immediately gave a sudden slap against Xiao Yan’s small stomach. A frightening strength surged out in all directions in a flood-like manner from the spot where the chest caved in.</p><br/><p>Bang!</p><br/><p>A frightening strength surged over wildly from Xiao Yan’s arm. It caused his sleeves to completely burst apart. His body also once again flew away in a lightning-like manner as though it had suffered a heavy blow.</p><br/><p>When Xiao Yan suffered serious injuries and was forced back once again, the mood of everyone on the fortress also tensed up again. Instead, the black masses that formed the alliance army emitted a deafening cheer.</p><br/><p>Xiao Yan flapped the fire wings behind him and forcefully stabilized his body. A solemn look appeared in his eyes. This ‘Three Beast Savage Skill’ mysteriousness seems to have somewhat exceeded his expectations.</p><br/><p>“Brat, looks like you have seen through something.” The tiger-headed Elder stood in the sky and coldly laughed as the three of them once again surrounded Xiao Yan. He was naturally able to sense that Xiao Yan had clearly borrowed his strength to approach one of the other two. From the looks of the situation, Xiao Yan likely knew that the ‘Three Beast Savage Skill’ could only be used by one person to possess a Dou Zong’s strength.</p><br/><p>“The ‘Three Beast Savage Skill’ is one of the most profound Qi Methods of our Mulan Valley. How could it be worth being praised if it is so easily overcome? Although this Qi Method can only allow one person to possess the strength of a Dou Zong, the three of our essences have completely merged together. With just a thought, that Dou Zong class strength can be transferred to another person’s body within an extremely short period of time. That speed of yours is far from being able to surpass the speed at which this strength is transferred.” The lion-headed Elder patted his chest and mocked. These things were not considered secrets. Anyone who had exchanged blows with them would be able to gradually sense it. Hence, speaking about it would not cause any problems.</p><br/><p>Xiao Yan frowned slightly. These three people had already practiced the ‘Three Beast Savage Skill’ until its pinnacle. They were able to transfer the strength among themselves as they pleased. If one did not manage to catch them completely off-guard, one must be able to face that frightening Dou Zong class strength head-on no matter which of the three they faced.</p><br/><p>However, these three people were also no ordinary weaklings. Even though Xiao Yan had used the ‘Three Thousand Lightning Movement’, he still had difficulty escaping their senses. It was somewhat difficult to catch them off-guard…</p><br/><p>“Three Mulan Elders, what are you doing? A little Dou Huang actually exhausts so much of your time?” A sudden furious roar sounded in the distance while these thoughts lingered in Xiao Yan’s heart. When he glanced over, he could see that the fellow who yelled had fallen into a disadvantage in the face of Medusa’s vicious attack.</p><br/><p>“Why are you wailing? This little fellow is also not some ordinary expert Dou Huang. His ability to withstand being beaten is extremely strong.” The tiger-headed Elder knit his brows while he twitched his lips and spoke in his heart. However, his face gradually became chilly. Those bright-red eyes were staring intently at Xiao Yan while his voice rang out to his two companions, “Quickly finish him.”</p><br/><p>“Yes.” The two other Elders nodded their heads while the bright-redness in their eyes also grew denser. The blood-red energy that covered their bodies also became much stronger.</p><br/><p>Xiao Yan let out a long sigh as he sensed the aura of the three people. He immediately shut his eyes slowly. When he did so, an extremely bright silver-colored glow suddenly erupted from under his feet. This light swiftly spread up and wrapped around his entire body within a breath’s time.</p><br/><p>Xiao Yan’s eyes suddenly opened while the glow spread up. However, his dark-black pupils had suddenly turned into silver-colored ones that appeared quite strange!</p><br/><p>“Three Thousand Lightning Movement: Three Thousand Lightning!”</p><br/><p>Both of Xiao Yan’s eyes changed as his hands suddenly formed numerous complicated hand seals. Afterimages of his handprints flew about before suddenly becoming still a moment later. His body also shook violently. Two silver-colored glows that were completely similar to Xiao Yan began to separate from his body under the changed expressions of the three Mulan Elders.</p><br/><p>Three Thousand Lightning!</p><br/><p>The highest realm of the Three Thousand Lightning Movement. Xiao Yan had finally unleashed this Di class agility technique to its peak level after having reached the Dou Huang class!</p><br/><p>After the two silver-colored images appeared, the three individuals separated into three directions. They each shot explosively toward one ofthe three Mulan Elders!</p><br/><p>The faces of the three Mulan Elders finally turned unusually ugly at this moment as they looked at the three figures, unable to differentiate between the actual body and the afterimages.</p><br/>\n</div>"}