{"title": "Chapter 760: Three Beast Savage Skill", "id": 760, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-760-three-beast-savage-skill", "volume_title": "Volume 8", "body": "<h1>Chapter 760: Three Beast Savage Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 760: Three Beast Savage Skill</u></strong></p><br/><p>The three old men who appeared in the sky were wearing green-colored robes. However, there was a lion, a tiger and a bear on their three respective robes. These drawings did not appear to be something created from ordinary sewing. Instead, they appeared to have been agglomerated from a certain kind of mysterious energy. Hence, when a person’s eyes swept over them, the three unusually savage beasts seemed to be staring with their bright-red vicious eyes. If it was someone who did not have a strong mental strength, their legs would involuntarily become limp under these violent gazes that were filled with killing intent.</p><br/><p>Although the auras of these three green-robed old men were merely at the peak of the Dou Huang class, a seriousness that was difficult to hide covered Medusa’s face. The ‘Three Beast Savage Skill’ that these three people practiced was extremely strange. The fighting strength when they fought together was extremely shocking. Even she had to treat them seriously.</p><br/><p>The black masses of the army from the three empire alliance outside of the fortress immediately erupted into a thunder-like cheer the moment the three Great Elders from the Mulan Valley appeared. Compared to the great increase in their morale, Xiao Ding and the others in the fortress felt their hearts slightly sink.</p><br/><p>“Dammit, these shameless bastards. No matter how one puts it, they are experts who possess great reputations in the northwestern region. Yet, they actually bully others with numbers.” Hai Bodong’s expression was ugly as he looked at the three old men who had appeared in the sky. He could not resist cursing angrily.</p><br/><p>Jia Xing Tian’s expression was similarly ugly as he nodded. He mused for a moment, clenched his teeth and said, “Why don’t the two of us go out and help Medusa block them for a moment? It would be good if we can buy her some time.”</p><br/><p>“Hold your horses. If the both of you also attack, the other experts from the three sects would definitely not just stand back and watch. At that time, we will end up bringing forward the eruption of the big battle. It would also be extremely difficult to achieve your intentions.” Xiao Ding’s expression was solemn as he shook his head and spoke.</p><br/><p>“What do we do then? Don’t tell me that we should just watch her get surrounded and attacked?” Hai Bodong frowned intently as he replied.</p><br/><p>“Ugh, all we can do now is to hope that Queen Medusa will be able to block them. There is no other solution.” Xiao Ding bitterly laughed and sighed. Any planning would not help this situation where they were had a disadvantage in all aspects.</p><br/><p>Hai Bodong and Jia Xing Tian could only unwillingly storm their feet when they heard this. They were at a complete disadvantage in this situation. However, it was just as Xiao Ding had said, they had no solution despite knowing that they were at a disadvantage. The number of the other party’s elite Dou Zongs was not lesser than their side. They also had more experts in the Dou Huang and Dou Wang class. What else could they do but end up in a disadvantageous situation?”</p><br/><p>“It would be fine if Xiao Yan was here. With his strength, it should not be too much trouble blocking Yan Luo Tian and the three Elders from the Mulan Valley. As long as Medusa is given some time, it is possible to defeat one of them…” Fa Ma by the side, who had not spoken for a long time, softly sighed.</p><br/><p>Xiao Ding and the others also sighed when they heard this. Although this was indeed the case, that fellow was undertaking a retreat. Who knew just when it would end?</p><br/><p>“Ke ke, Queen Medusa, don’t blame us for not being a gentleman. After all, you are not some weakling. If we don’t join hands, it is likely that we would be unable to do anything to you.” The flickering gold goose wings on Yan Luo Tian’s back were flapped as he laughed toward the solemn Medusa.</p><br/><p>“If you want to join hands then just do so. There is no need to find some sad sounding excuse? Aren’t you afraid of disgracing your status as the Sect Leader of the Gold Geese Sect?” Medusa coldly laughed. Her words were filled with ridicule.</p><br/><p>Yan Luo Tian laughed. However, he was unconcerned with Medusa’s ridicule. He clenched his hand and a golden glow appeared. Finally, it transformed into a strange golden-colored longsword. The longsword was covered with goose feathers like sharp thorns.</p><br/><p>“Hee hee, Sect Leader Yan, Queen Medusa is not an ordinary person. Even by joining hands, we will not pose much pressure to her…” A Mulan Valley Elder whose robe showed a black bear on it laughed in a somewhat sharp voice while a blood-red glow flickered across his dense eyes.</p><br/><p>Yan Luo Tian laughed. His eyes glanced at the enormous Black Mountain Fortress behind only to suddenly speak, “Queen Medusa, all we are after is the Jia Ma Empire. It has not much to do with your Snake-People Race. If you are willing to lead your Snake-People Race away from this place, our three large empires will promise to allow you to reproduce on this plot of land. Why do you wish to join them in their dying struggle?”</p><br/><p>Medusa’s eyes indifferently swept over him when she heard this. She questioned, “Do you really treat this Queen as a three year old? Isn’t saying such things now a little too childish?”</p><br/><p>The smile on Yan Luo Tian’s face became slightly stiff. He gently shook the goose wing sword in his hand and laughed faintly, “In that case, I will make the Snake-People Race disappear from this northwestern region forever…”</p><br/><p>“With you?” Medusa raised her eyebrows. The ridicule on her bewitching face was even greater.</p><br/><p>“By the three Elders from the Mulan Valley and me.” Yan Luo Tian laughed. He turned his head to the three Elders from the Mulan Valley. “Three Elders, let’s do it!”</p><br/><p>“Aye!”</p><br/><p>The three green-robed Elders nodded when they heard this. They immediately took a step back and formed a brilliant formation that could attack and defend. Following the appearance of this formation, three powerful Dou Qis that were green, red, and blue surged out from the bodies of the three of them!</p><br/><p>The Dou Qi that surged out did not scatter. Instead, they moved in that formation and rushed out. Finally, the three Dou Qis intertwined with each other and formed a perfect ring that linked the essence of the three of them.</p><br/><p>Following the completion of the ring, the robes of the three Elders immediately unleashed an earth-shaking beast roar that was filled with a savage aura. Their clothes flapped and the fierce lion, tiger, and bear turned into a bloody-red energy. The energy surged out and covered the bodies of the three people.</p><br/><p>When this blood-red energy surged out, the fighting aura belonging to the three old men also gradually scattered. Replacing them was a frightening aura that was not any weaker than Yan Luo Tian’s aura!</p><br/><p>“Ke ke, the Mulan Valley’s ‘Three Beast Savage Skill’ is indeed worthy of being a Middle Di Class Qi Method that has been passed down from ancient times. Such a combined body effect is really incomparably marvelous…” Yan Luo Tian immediately laughed out loud as he sensed the majestic aura that was faintly emitting a savage feeling. However, a deep greediness flashed across his eyes while he laughed.</p><br/><p>“It is but some fluff. How could it be more intricate than the Sky Walking Goose agility Dou Technique of the Gold Geese Sect…” The blood-red energy wrapped around the three green-robed Elders. Finally, it transformed into a blood-red beast head on their heads. Looking from a distant, the three Elders from the Mulan Valley seemed to have become three half-human half-beast creatures. That voice from earlier had been emitted from the mouth of the old man who had transformed into a tiger-headed human.</p><br/><p>Perhaps it was due to the Qi Method but this old man’s voice also faintly carried a tiger roar that shook one’s soul.</p><br/><p>Medusa’s eyes were solemn as they swept over the three Elders from the Mulan Valley. She also sighed softly in his heart. A big fight today was indeed unavoidable.</p><br/><p>Medusa swiftly focused her mind after she sighed. She tossed aside the distractions in her heart. A majestic seven colored energy surged out from her body like a torrent before turning into a seven colored rainbow that fell from the sky. Her body was in the middle of that rainbow.</p><br/><p>Yan Luo Tian’s eyes shrank slightly when he saw this aura of Medusa. She was indeed worthy of being an existence who could contend with that abnormal fellow from the poison sect. He admitted that he was inferior to that majestic Dou Qi. However, it was fortunate that he was not alone today…</p><br/><p>He quietly gave a look to the three Elders of the Mulan Valley. Immediately, the four people shot out together. They instantly unleashed an earth-shaking Dou Qi that caused a countless number of people below to feel a fear.</p><br/><p>Yan Luo Tian’s speed was extremely quick. In merely a breath, he had appeared in front of Medusa. The goose wing sword in his hand shook, and the sword shot out like a poisonous serpent. A sharp sword aura caused the surrounding space to fluctuate intensely.</p><br/><p>Medusa’s expression did not change as she observed this sudden attack. She clenched her delicate hand and a seven colored snake-shaped longsword agglomerated and appeared. She swung her hand and the sword’s body was twisted into a strange arc. Its tip went around the goose wing sword on Yan Luo Tian’s hand and immediately pushed violently forward!</p><br/><p>“Hmph!”</p><br/><p>A frightening force swarmed over from the body of the sword. Yan Luo Tian let out a muffled snort and the large goose wings on his back suddenly flapped. The goose wings immediately became like sharp arrows as they attacked every single part of Medusa’s body.</p><br/><p>The longsword in Medusa’s hand emitted a clear sword whistle as she sensed the cold air around her. The longsword immediately shook and dense afterimages quickly appeared, covering her body within a short instance.</p><br/><p>Qiang! Qiang!</p><br/><p>The goose wings shot over and smashed against the dense sword images. The sword images swiftly transformed into nothingness as both parties depleted their strength.</p><br/><p>The moment the sword images finally transformed into nothingness, Yan Luo Tian’s eyes flickered. A seal was formed in his hand and a bright-golden light that contained a powerful energy surfaced in front of him. Finally, it shot toward Medusa, who was close by.</p><br/><p>The seven colored sword images flashed. Medusa was just about to receive this attack head-on when a low and deep roar that contained a savage aura suddenly appeared behind her. A sharp fist wind that carried the sharp sound of space-tearing violently appeared.</p><br/><p>The sudden sneak attack caused Medusa’s face to change a little. She clenched her delicate hand and a seven colored energy swiftly agglomerated. Finally, she violently threw it to her back.</p><br/><p>“Bang!”</p><br/><p>The clear sound of energy exploding suddenly resounded over the sky. Medusa let out a muffled snort in front of a countless number of gazes and her body withdrew over ten steps. On the other hand, Yan Luo Tian and the three Mulan Elders only took two steps back. Clearly, Medusa was at a disadvantage by fighting two people in this exchange by herself.</p><br/><p>“Despicable! Fighting two against one and yet you still dare to use a sneak attack!” Hai Bodong and the others on the wall once again let out a furious curse upon seeing this.</p><br/><p>“Ha ha, Medusa, it seems that you were seriously injured in your fight with the Sect Leader of the Poison Sect. I want to see just what you can rely on to block us today!” Yan Luo Tian laughed out loud. A joy erupted in his eyes when he learned of Medusa’s injuries.</p><br/><p>Medusa’s face was chilly. She did not argue with him as the Dou Qi in her body galloped like floodwater. The natural energy in the outside world began to fluctuate intensely upon being beckoned by the Dou Qi within her body. From the looks of it, it seemed that she was really planning to go all out.</p><br/><p>Yan Luo Tian and those three Mulan Elders were startled when they saw this action of hers. They immediately laughed coldly and began to maneuver the Dou Qi within his body.</p><br/><p>A countless number of gazes watched the intense fluctuations of natural energy in the sky. All of them knew that a frighteningly big Dou Zong class battle was about to completely erupt!</p><br/><p>“Ugh… things are really bad.”</p><br/>\n</div>"}