{"title": "Chapter 762: Intense Fight!", "id": 762, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-762-intense-fight", "volume_title": "Volume 8", "body": "<h1>Chapter 762: Intense Fight!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 762: Intense Fight!</u></strong></p><br/><p>The bodies of the three Mulan Elders were suspended in the sky. Majestic Dou Qi filled the area and even the air trembled a little.</p><br/><p>An incomparable confidence also surged within the hearts of the three Elders as they sensed the enormous strength of the Dou Qi within their bodies resonating with the natural energy. They instantly suppressed the hesitation caused by some unusual aspects of Xiao Yan.</p><br/><p>“Ha ha, chief Xiao, today, we will let you know that you are but a joke. We might still be afraid if it was the Misty Cloud Sect of the past. However, the Yan Alliance that has just been established does not possess this qualification.” Bloodthirsty intent flashed across the eyes of that lion-headed Elder as he laughed out loud.</p><br/><p>Xiao Yan shook his head as his eyes studied the wildly laughing lion-headed Elder with an indifferentness. His hands made seals and he softly laughed, “I, Xiao Yan, was able to destroy the Misty Cloud Sect that all of you feared. Naturally, I am also able to destroy you.”</p><br/><p>“Skyfire Three Mysterious Change!”</p><br/><p>Xiao Yan’s hand seal suddenly changed after his words sounded. He immediately let out a low cry within his heart. When this low cry sounded, the Glazed Lotus Core Flame swiftly moved along his veins and circulated in a mysterious manner. Waves of wild, violent energy immediately spread out and filled each and every corner of his body.</p><br/><p>Xiao Yan’s current true strength should be around that of a one star Dou Huang. However, by relying on the mysterious ‘Flame Mantra’ and his body, which was many times stronger than an ordinary Dou Huang, his fighting strength was such that even a three or four star expert Dou Huang would not be able to beat him. Additionally, he could increase his strength through the ‘Skyfire Three Mysterious Change’. He was also able to fight even when facing a seven or eight star Dou Huang. If he were to include some extraordinarily powerful Dou Skills and the effects of the ‘Heavenly Flame’ he would be able to match an expert at the peak of the Dou Huang class.</p><br/><p>Of course, if he wanted to contend with an elite Dou Zong, it would be still lacking even if he included all of these. However, Xiao Yan possessed a trump card that had the qualification to injury or even kill an elite Dou Zong!</p><br/><p>The three Mulan Elders were initially surprised when they felt Xiao Yan’s aura suddenly soar. However, they immediately shook their heads with disdain in their hearts. Was this the support that caused him to be so arrogant?</p><br/><p>“If this is your trump card, us three old men must tell you that you, as the chief of the ‘Yan Alliance’, will completely lose face in front of so many people from the Jia Ma Empire today.” The tiger-headed Elder coldly laughed. There was a slight tiger roar in his voice.</p><br/><p>Xiao Yan ignored the other party’s cold laugher and clenched his fist. The Heavy Xuan Ruler flashed and appeared. It randomly cut through the air while carrying the sharp sound of rushing wind.</p><br/><p>A silver-colored glow suddenly appeared on Xiao Yan’s feet as the heavy ruler paused abruptly. Immediately, a slight thunderous roar rang out. His body suddenly turned into a black line that explosively rushed forward!</p><br/><p>The three Mulan Elders were somewhat surprised when they saw this speed of Xiao Yan. They quickly let out a cold laugh. That tiger-headed Elder strode forward and appeared at a certain spot which coincidentally sealed Xiao Yan’s attack.</p><br/><p>A bloody glow flashed in the tiger-headed Elder’s bloodthirsty eyes which were watching Xiao Yan charge over. He clenched his fist abruptly and a bloody glow agglomerated. Immediately, it smashed toward Xiao Yan without any fanciful skill.</p><br/><p>This punch did not have any trickiness or viciousness. All it possessed was an extremely heavy strength. Even the surrounding space began to show signs of distortion under this frightening strength. The spreading air curved into a partially visible arc and an invisible air bubble formed on his fist. It carried an ear-piercing sound as it whistled through the sky.</p><br/><p>Xiao Yan’s expression did not change when he faced this opening attack from the tiger-headed Elder. The Dou Qi in his body began to carry a roar as it whizzed down his veins like floodwater. His hand tightly gripped the ruler’s hilt and a dense jade-green flame swiftly surged out, completely covering that heavy ruler. Both of his hands immediately took hold of the ruler and smashed it viciously toward the blood-colored fist of that tiger-headed Elder without dodging a little.</p><br/><p>Qiang!</p><br/><p>The clear sound of metal colliding was suddenly emitted the moment the attacks collided. The ears belonging to the countless number of people began to whistle repeatedly. Some of the weaker people even felt a piercing-pain in their eardrums.</p><br/><p>A powerful force spread out in all directions like a ripple from the point of collision in the sky. The two figures made contact with each other before suddenly withdrawing.</p><br/><p>A surging strength that was transmitted from the heavy ruler shook Xiao Yan’s hand until it was a little numb. The strength of this tiger-headed Elder on the opposing side had somewhat exceeded his expectations. However, it seemed that the other party had greatly exhausted himself.</p><br/><p>That tiger-headed Elder stabilized his body after his feet took a few steps back. His eyes were dark and solemn as he looked at the sleek redness that had appeared because of the hot searing-pain on his fist. He involuntarily grumbled softly, “Heavenly Flame? You actually possess a ‘Heavenly Flame’?”</p><br/><p>The jade-green flame on Xiao Yan’s heavy ruler a moment ago was something that this tiger-headed Elder had witnessed before. However, he had never thought about it to that level. After all, a ‘Heavenly Flame’ was too rare. When he made contact earlier, he suddenly realized that the blood-red energy that the three of them had merged and formed began to turn faint under the burning of the jade-green flame. Only then did his heart have this sudden thought.</p><br/><p>With his experience, he naturally understood that a flame that was able to incinerate this kind of blood-red energy until nothing of it was left was definitely not an ordinary flame. The only thing that could do this on the Dou Qi continent was likely the most frightening ‘Heavenly Flame’.</p><br/><p>The two other Elders expressions sank when they saw the tiger-headed Elder suffering a disadvantage. They had indeed underestimated this fellow.</p><br/><p>“Don’t fool around. Let’s attack together and kill him!” The lion-headed Elder stared at Xiao Yan with bloodthirsty eyes. He waved his hand as he spoke in a deep voice.</p><br/><p>The other two Elders nodded when they heard this. Their cunning selves naturally knew what was called suffering an unexpected loss. The tiger-headed Elder had suffered a disadvantage earlier because of his insufficient care. It was difficult to be certain whether this fellow possessed any other trump cards. Hence, they ought to finish him off quickly.</p><br/><p>Since they had already decided within their hearts, the three Mulan Elders naturally did not delay even a little. The three human figures flashed forward. In merely a breath’s time, they had approached Xiao Yan. After which, they spread out abruptly and formed a triangular formation that surrounded Xiao Yan.</p><br/><p>Xiao Yan brows knit slightly when he saw the actions of these three people. He could clearly sense that all of his retreat paths had already been sealed by these three people. In this formation, he had no other solution than to face the other party’s attacks head-on.</p><br/><p>“This Mulan Valley does indeed have some skill. I think that their strength is likely not any weaker than the Misty Cloud Sect.” Surprise flashed across Xiao Yan’s heart as the sweat pores on his back stood up. The heavy ruler in his hand violently smashed behind him without any hesitation.</p><br/><p>“Bang!”</p><br/><p>A body flashed and appeared as the heavy ruler fell. It was that bear-headed Elder. At this moment, both of his hands had faintly transformed into a pair of large bear paws after being wrapped by the blood-colored energy. He actually extended his hand and forcefully grabbed the heavy ruler upon extending the bear’s paw.</p><br/><p>Xiao Yan hand pulled back but the heavy ruler did not move. His expression sank slightly as his mind moved. A dense jade-green flame swiftly surged out. Under the grilling of this jade-green lotus flame, the enormous blood-colored energy bear paws immediately emitted a ‘chi chi’ sound as it emitted waves of white smoke. However, the Elder refused to release his hands. An earth-shaking furious roar suddenly sounded and the green veins on his hands pulsed. An frightening strength immediately erupted and it snatched the Heavy Xuan Ruler over.</p><br/><p>Xiao Yan’s eyes were not even raised when his Heavy Xuan Ruler was forcefully snatched away. The silver glow under his feet flashed and his body rushed out. Numerous vaguely visible afterimages appeared.</p><br/><p>This distance was covered by Xiao Yan’s speed within a couple of blinks. His fist abruptly tightened and the joints of his fingers suddenly protruded out. He immediately struck viciously and heavily against the bear-headed Elder’s chest.</p><br/><p>“Octane Blast!”</p><br/><p>An extremely powerful force was suddenly erupted when the fist was still around half a foot from the bear-headed Elder’s chest. A vaguely visible force flew through the sky as a sharp tearing noise whistled by the side of his ear.</p><br/><p>“Bang!”</p><br/><p>Even the bear-headed Elder could not dodge in time from such a close distance. Hence, he could only firmly receive this blow from Xiao Yan.</p><br/><p>A frightening force seeped out from the chest of the bear-headed person. A concave shape clearly appeared on the former’s chest. His footsteps also repeatedly let out a ‘thrump thrump’ sound a couple of times. Only then did his shoulders tremble violently as he forcefully stabilized his body.</p><br/><p>Xiao Yan forced the bear-headed person back with one strike. His brows were knit slightly. Given his outstanding Spiritual Perception, he discovered that the aura of this bear-headed Elder had drastically weakened.</p><br/><p>A pressuring wind once again attacked from his back while a doubt was flashing within Xiao Yan’s heart. The owner who had unleashed this attack had actually reached the Dou Zong class.</p><br/><p>Xiao Yan’s reaction was quick while the thought flashed in his heart. He let out a low cry and a jade-green flame swiftly surged out from his body like a volcano erupting. It instantly agglomerated into a jade-green fire armor on his body.</p><br/><p>That dense wind quickly arrived after the fire armor was formed. It immediately struck heavily on that thick layer of fire armour, erupting into a powerful force that caused even the air to shake a little.</p><br/><p>A muffled snort was emitted from his throat upon having received this kind of heavy blow. A silver glow flashed under his feet as his body dodged like a swimming fish.</p><br/><p>That lion-headed Elder coldly laughed when he saw his fist striking Xiao Yan. However, he did not give chase and instead withdrew one step.</p><br/><p>Xiao Yan’s eyes slightly shrank when he saw the other person taking a step back. He discovered that the aura of that lion-headed Elder had suddenly fell from that of a Dou Zong class to a Dou Huang class when he had stepped back.</p><br/><p>Xiao Yan narrowed his eyes. He lowered his head and looked at the fire armor. On his chest numerous crack lines had appeared. The light from the flame scattered as he rubbed it with his hand. The fire armor once again recovered. Once he had completed this action, another Dou Zong aura attack came from his back as expected. Xiao Yan did not even need to think this time around. It should be that tiger-headed Elder who had yet to attack.</p><br/><p>A thought swiftly flashed within his heart as Xiao Yan suddenly turned around. His right hand was wrapped by a jade-green flame as it violently smashed against that tiger-headed Elder.</p><br/><p>Hmph!</p><br/><p>Xiao Yan once again let out a muffled snort when the two made contact. His footsteps swiftly withdrew. He was indeed unable to gain the upper hand in a head-on collision with an elite Dou Zong.</p><br/><p>Xiao Yan’s feet stomped on the ground. He stabilized his body and wiped off a trace of blood from the corner of his mouth. He lifted his head and studied the tiger-headed Elder, who had withdrawn after unleashing that attack. Moreover, his aura had also suddenly weakened to the Dou Huang class while he did so.</p><br/><p>Xiao Yan’s gaze swept over the three human figures around him who were looking at him with malicious intent. The corner of his mouth was slowly lifted into a cold smile.</p><br/><p>“So it is like this…”</p><br/>\n</div>"}