{"title": "Chapter 770: People Have Changed Despite Everything Else Remaining The Same", "id": 770, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-770-people-have-changed-despite-everything-else-remaining-the-same", "volume_title": "Volume 8", "body": "<h1>Chapter 770: People Have Changed Despite Everything Else Remaining The Same</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 770: People Have Changed Despite Everything Else Remaining The Same</u></strong></p><br/><p>A great storm seemed to have formed in Xiao Yan’s heart as he observed this pretty face which was still somewhat familiar. He never expected this so-called Sect Leader of the Poison Sect would actually be the first friend of the other gender he had while he was training back then. She was the Little Fairy Doctor who had been regarded as a fairy in the hearts of a countless number of Qingshan Town mercenaries!</p><br/><p>That pure kind woman… was now the sect leader of the Poison Sect who had caused a countless number of people to feel a fear just from hearing her name? This kind of extreme transformation still caused Xiao Yan to feel a disbelief now that he had seen it with his own eyes.</p><br/><p>The white-haired woman’s lovely body also trembled slightly when she heard the cry that was transmitted from Xiao Yan’s mouth. Her gray-purplish eyes flickered slightly. Her pale-white hand immediately rubbed away the blood stain on the corner of her mouth. After which, she placed her blood by the side of her mouth and carefully sucked the blood into it. Her gray-purplish eyes gradually recovered her calmness after she did all this. She looked at Xiao Yan once again and faintly said, “I am not whatever Little Fairy Doctor. You have mistaken me for someone else.”</p><br/><p>“Nonsense!”</p><br/><p>Xiao Yan’s eyes immediately widened when he heard this. He unceremoniously let out an angry curse. The white-dressed, kind girl back then had left behind an extremely deep impression. Moreover, her unusual constitution and the need to consume poison to continue surviving caused Xiao Yan to have difficulty forgetting her. Hence, he immediately became furious when he heard the other party’s words.</p><br/><p>“What are you doing? You are also someone from the Jia Ma Empire, why do you still want to start this war?” Xiao Yan inhaled a deep breath of air. A fury was dancing in his eyes as he asked with a low voice.</p><br/><p>The white-haired woman was quiet. A moment later, she slowly said, “The Little Fairy Doctor whom you know has already died. The current me is the leader of the Poison Sect, Sky Poison Woman.”</p><br/><p>Xiao Yan suddenly felt a foreign feeling as he studied the Little Fairy Doctor, whose expression had been cold and indifferent from the beginning. The her back then might be aware of the condition within her body, but had still stubbornly maintained that kindness. She had wrapped herself firmly and did not wish for other people to be hurt because of her. That kind smile that invaded people’s hearts caused a countless number of people to be drowned within it. However, that somewhat alluring thing had already left her.</p><br/><p>“Is it because of the ‘Woeful Poison Body’?” Xiao Yan clenched his fist tightly as he spoke. Her transformation had caused him to feel a pain within his heart.</p><br/><p>“I have originally been born from woe and my reason for surviving was to spread misery.” The eyes of the Little Fairy Doctor were slightly absent-minded while she looked at the furious Xiao Yan. She appeared to have recalled some of the things back then. Her cold and indifferent face slowly became warmer as she softly said, “Back then, I once told you that I will sooner or later end up like this. This is the fate of the ‘Woeful Poison Body’. It has been the case throughout the generations.”</p><br/><p>“It is not like there is no cure for the ‘Woeful Poison Body’. You are merely allowing yourself to fall!” Xiao Yan furiously reprimanded with a painful heart.</p><br/><p>“As long as anyone touches the current me, that person will die in the most painful manner in front of me. You don’t understand the events that have happened to me these years…” The Little Fairy Doctor’s face revealed a loneliness. After she had left the Jia Ma Empire back then, she had also thought that she would be able to suppress this so-called ‘Woeful Poison Body’. However, reality was extremely cruel.</p><br/><p>She had stayed in a small mountain village for a year after she had left the Jia Ma Empire. There, she had stayed in the house of two old people who were without children. The two elderly saw that she was cute and kind and had persuaded her to stay in the small mountain village. Moreover, they viewed her like their own child and the people in the village viewed her as part of the family. She was extremely happy during that year. She, who had been displaced since she was young, had never enjoyed this kind of blissful feeling that warmed the areas deep in her heart with the exception of the unforgettable genuine friendship she had with Xiao Yan in Qingshan Town.</p><br/><p>She treasured this feeling extremely greatly and had repeatedly swore that she would protect it. However, the eruption of the ‘Woeful Poison Body’ caused all of this to change.</p><br/><p>First, it was the two old people, who had viewed her as their daughter, dying in the most painful manner in front of her all because they had touched her body. Although the two elderly people were looking at her with kind and gentle eyes just before they had died, it was these eyes that truly caused her heart to be pierced into pieces.</p><br/><p>There were some people in the village who had died in a painful manner because of her after the two elderly people died. In the end, she had finally dragged her tired body and left with the corpses of the two old people in front of the hateful and fearful eyes of the people in the village.</p><br/><p>She buried the corpses of the two elderly people and knelt in front of their graves until she nearly fainted. By the next time she had awoken, her hair had turned snow-white in color.</p><br/><p>She touched her white hair which caused some people to be afraid and finally understood that she was a bane existence who would bring woe to the people around her. Since that was the case, what was the use of being kind? She treated people kindly only to see them dying in the most painful manner in front of her. Was this kind or cruel?</p><br/><p>After coming to terms with this, the kindness the Little Fairy Doctor always showed was forced to hide deep within her heart. The person who was released was the cold and emotionless Sky Poison Woman!</p><br/><p>By looking at the rapidly changing expression on the Little Fairy Doctor’s face, Xiao Yan was aware that quite a number of things had happened to her these few years. These events were perhaps the reason for her transformation.</p><br/><p>Xiao Yan sighed quietly in his heart. His heart also appeared to be in a complete mess. He knew that since she possessed the ‘Woeful Poison Body’, the Little Fairy Doctor would definitely not be able to live a smooth life. The ‘Woeful Poison Body’ would repeatedly torture hers as well as the people around her.</p><br/><p>Grug!</p><br/><p>The sound of blood being spat out was suddenly emitted from behind Xiao Yan just as he was quietly sighing in his heart. He turned around to look, only to be shocked. He saw that Medusa’s expression had suddenly become pale.</p><br/><p>“What is it?” Xiao Yan asked in surprise as he hurriedly turned around.</p><br/><p>“Her blood contains poison!” A painful look flashed across Medusa’s face. She quickly clenched her silver teeth and moved the Dou Qi within her body, trying her best to expel the poisonous liquid that was destroying the interior of her body.</p><br/><p>Xiao Yan’s face also changed when he heard this. He turned around and looked angrily at the Little Fairy Doctor.</p><br/><p>“Whoever touches the ‘Woeful Poison Body’ will be unlucky. She can only blame herself.” The Little Fairy Doctor ignored Xiao Yan’s gaze while she spoke. Those icy-cold eyes of hers were looking at Medusa.</p><br/><p>“It is merely a little poisonous liquid yet you want this Queen to submit? This Queen is able to take your life even before the poison acts!” Medusa’s eyes suddenly turned cold as she spoke in a dense manner.</p><br/><p>“Do you want to come and try?” The Little Fairy Doctor’s grayish-purple eyes also unleashed a cold glint as she spoke without backing down.</p><br/><p>“Enough!” Xiao Yan immediately roared furiously when he saw that the two people were about to fight once again.</p><br/><p>Xiao Yan’s roar caused the two of them to be a little quieter. When he saw this, he raised his head to the Little Fairy Doctor and said in a deep voice, “Little Fairy Doctor, I once told you back in the little valley that I, Xiao Yan, will still be your friend regardless of whether you reach this stage in the future. These words are still the case even now!”</p><br/><p>“I have already forgotten about those matters back then.” The eyes of the Little Fairy Doctor glimmered as she coldly replied.</p><br/><p>“If you have forgotten, you can come and attack me.” Xiao Yan coldly smiled. After which, he actually walked toward the Little Fairy Doctor without any defense.</p><br/><p>“Be careful!” Medusa hurriedly said when she saw Xiao Yan’s actions. That woman’s entire body was filled with lethal poison. Even she felt somewhat troublesome when coming into contact with it.</p><br/><p>Xiao Yan waved his hand and indicated to her that there was no need to worry. His footsteps did not pause even once.</p><br/><p>The face of the Little Fairy Doctor vaguely changed when she saw Xiao Yan walking over. Her eyes revealed a struggling expression.</p><br/><p>Xiao Yan’s footsteps paused in front of the Little Fairy Doctor. He looked at that pale-white face where her grayish-purple eyes were lowered. He sighed, “You have not forgotten. The ‘Woeful Poison Body’ is not something that is without cure. There is no need for you to despair.”</p><br/><p>“How easily said!” The corner of the Little Fairy Doctor’s mouth revealed a tragic look. She was clearer than anyone about how terrifying the ‘Woeful Poison Body’ was.</p><br/><p>Xiao Yan knit his brows when he saw her expression. After which, he extended his hand and tried to touch the Little Fairy Doctor’s pale-white face. However, the latter was cautious and she hurriedly took a few steps back. She sternly cried out, “Are you seeking to die?”</p><br/><p>“I only wish to let you know that even though the ‘Woeful Poison Body’ may be unusual, it is not something that can kill whoever it wishes to. Therefore, there is no need for you to give up on yourself. Moreover, you are already no longer that ignorant girl from back then, and I am also no longer that little Dou Zhe back then who was forced to flee miserably after being chased by a small Mercenary Company.” Xiao Yan smiled. His feet slipped and he appeared beside the Little Fairy Doctor. His hand moved and grabbed the Little Fairy Doctor’s hand.</p><br/><p>The Little Fairy Doctor was anxious when her arm was grabbed. She hurriedly used her strength to flee as she angrily asked, “What exactly are you trying to do?”</p><br/><p>Xiao Yan smiled. He raised his hand. At the moment, the palm of his had already turned extremely black. His heart moved and the ‘Glazed Lotus Heart Flame’ immediately surged out. When the flame rose, that dark-black color swiftly faded away. In an instant, his hand recovered to what it previous vigor. With the ‘Glazed Lotus Heart Flame’ protecting him, most poison would be purified by it. The only exception would be those extremely lethal and unmatchable poisons.</p><br/><p>Xiao Yan’s hand waved toward the somewhat stunned Little Fairy Doctor. His face had also gradually become increasingly more solemn as he slowly said, “If you still treat me as your friend, you should stop continuing to error on. If you are like this, you will only increase the rate at which the ‘Woeful Poison Body’ will erupt. The moment it completely erupts, no human or beast within a five hundred kilometre radius will survive. Everything will be too late at that time.”</p><br/><p>“Even though you can isolate the lethal poison of the ‘Woeful Poison Body’ it is definitely impossible to undo it…” The Little Fairy Doctor shook her head slightly and spoke with a bitterness. She had also investigated many as much as she could during these few years. However, she did not find even a little information about resolving the ‘Woeful Poison Body’.</p><br/><p>“The ‘Woeful Poison Body’ is naturally born. It is indeed very difficult to resolve.” Xiao Yan nodded. He studied the Little Fairy Doctor’s eyes, which had lost their luster, and spoke in a deep voice, “It might be impossible to undo it but I can help you completely control it!”</p><br/>\n</div>"}