{"title": "Chapter 786: Recruiting Gu He", "id": 786, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-786-recruiting-gu-he", "volume_title": "Volume 8", "body": "<h1>Chapter 786: Recruiting Gu He</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 786: Recruiting Gu He</u></strong></p><br/><p>Xiao Yan was extremely interested in what Fa Ma said. Alternatively, he could be said to be very interested in getting Gu He to join the Yan Alliance. Hence, he got Fa Ma to lead the way the next morning as they hurried to the place where Gu He lived along with Hai Bodong.</p><br/><p>Gu He had naturally left the Misty Cloud Sect after the Misty Cloud Sect had dissolved back then. However, he did not leave the Jia Ma Empire. Instead, he chose to live in an isolated mountain range not far from the Misty Cloud Mountain. That place was the current destination of Xiao Yan’s group.</p><br/><p>The place where Gu He lived in isolation was not very far from the capital. Given the speed of Xiao Yan’s group, they arrived around half an hour later. The easily managed to find the straw cottage that was hidden in the mountain forest with Fa Ma leading the way.</p><br/><p>Xiao Yan met a familiar person from the past at this place. It was Liu Ling, who had once fought with him for the champion spot during the Alchemist Grand Meeting in the capital back then. The latter was clearly stunned when he saw these few people who had suddenly appeared. Only when his gaze shifted to Xiao Yan’s face did he speak with surprise, “Xiao Yan? Why are you here?”</p><br/><p>Liu Ling felt quite a complicated feeling toward Xiao Yan. Both of them had been around the same level back then. However, now he was merely a tier 4 alchemist who was working hard to get to tier 5 while the latter already possessed the ability to contend with his teacher, Gu He. This kind of gap naturally caused him to feel a little dispirited.</p><br/><p>“Ke ke, brother Liu, can I trouble you to pass a message to grandmaster Gu He. Just say that Xiao Yan wishes to meet him.” Xiao Yan smiled at Liu Ling as he spoke quite courteously.</p><br/><p>Liu Ling hesitated after hearing this courteous tone of Xiao Yan. He nodded once before turning his body to walk into the straw cottage. He was very clear about the current status of Xiao Yan within the Jia Ma Empire, and naturally knew that the latter was no longer the young man who did not have much of a background.</p><br/><p>Xiao Yan sent Liu Ling into the straw cottage with his eyes before his group swept their eyes all over the place. They immediately nodded. This Gu He really knew how to choose a place. This location was isolated with few people around. There were usually hardly anyone who could arrive in this place. It was considered a good spot to live in isolation.</p><br/><p>The door of the straw cottage slowly opened as the few of them were looking around. A human figure slowly began to walk out. He glanced over Xiao Yan’s group indifferently before speaking, “All of you actually managed to find this place. Looks like the current Yan Alliance faction has really spread all over the Jia Ma Empire. May I know if you are here to look for trouble today or is there some other matter?”</p><br/><p>The person who revealed himself was naturally Pill-King Gu He who had disappeared for a long time. Liu Ling was standing behind him with a slightly bowed body. Gu He’s gaze swept over Xiao Yan’s group and felt a little uncertain about their motives for this trip.</p><br/><p>“You are really still showing this dislikable appearance.” Fa Ma involuntarily shook his head and scolded with a smile when he heard this.</p><br/><p>“Old fellow, you must definitely be the one who brought them here.” Gu He glanced at Fa Ma before his gaze immediately moved to Xiao Yan’s body. He indifferently said, “Yan Alliance chief, just say what issue you have. I still have a medicinal ingredient field that I have yet to manage today. I shall not accompany all of you to wait here if there is nothing.”</p><br/><p>“Elder Fa Ma has said that grandmaster Gu He is not a narrow-minded person. In that case, I shall not beat around the bush. My main aim for coming today is to invite grandmaster to join the Yan Alliance Pill Hall.” Xiao Yan smiled. He did not say any unimportant things. He instead started with the key topic. He knew that beating around the bush would cause someone like Gu He to feel impatient.</p><br/><p>“Join the Yan Alliance?” A strange expression immediately surfaced on Gu He’s face when he heard this. He lazily waved his hand and said, “Forget it. I am quite happy with this current life of mine. I shall not go and join the fun of those large factions. They are so noisy that it causes one to feel irritated.”</p><br/><p>“Ugh, you… aren’t you hoping to enter that ‘Pill Tower’ to train? The potential of the current Pill Hall is far greater than the Alchemist Association. If you join, it is likely that this hope will not be difficult to achieve in the future.” Fa Ma involuntarily spoke in a helpless manner when he heard Gu He’s response.</p><br/><p>“Old fellow… you can forget about using this to lure me. Do you really think that I don’t have any path to enter that ‘Pill Tower’? If I did not think of myself as a citizen of the Jia Ma Empire, do you think that given my alchemist skills, there would not be some powerful alchemist organization trying to recruit me if I leave this place?” Gu He curled his mouth and coldly laughed.</p><br/><p>“Ugh…” Fa Ma could not help but become speechless when he heard this. He looked at Xiao Yan in a somewhat embarrassed manner. He naturally knew that Gu He would try to be recruited by someone no matter where he went, anywhere in the Dou Qi continent. After all, a tier 6 alchemist was not a common commodity that one could find all over the place.</p><br/><p>Xiao Yan could not help but feel somewhat speechless when he heard that the condition, that had appeared to possess quite a great allure in Fa Ma’s mouth, ended up being without even the slightest attraction to Gu He. This old fellow was indeed not reliable…</p><br/><p>The embarrassment on Fa Ma’s face became denser when he saw Xiao Yan’s face.</p><br/><p>“Grandmaster Gu He, that being said, you don’t seem to have much interest in the other alchemist associations from other empires. Since this is the case, why don’t you consider the Yan Alliance? Is it because of the issue between the two of us?” Xiao Yan’s eyes slid to Gu He as he slowly spoke.</p><br/><p>Gu He narrowed his eyes and studied Xiao Yan. His voice was suddenly calm as he questioned, “You really wish for me to join the Yan Alliance?”</p><br/><p>“Given grandmaster Gu He’s medicinal refining skills, I believe that no faction would simply just give up.” Xiao Yan waved his hand and laughed.</p><br/><p>“It is not impossible for me to leave with you. However, you must agree to a condition of mine.” Gu He’s eyes slowly swept over Xiao Yan’s body. A moment later, he narrowed his eyes as he replied.</p><br/><p>“What condition?” Xiao Yan raised an eyebrow. He did not agree immediately and instead asked a question in a cautious manner.</p><br/><p>“Have a medicinal refining match with me! I will join the Yan Alliance if you win. What do you say?” Gu He’s eyes glowed as he looked at Xiao Yan. A wildfire suddenly surged into his tone. He had taken his loss to Xiao Yan in the match back then to heart. Today, he wanted to use the alchemist skills he specialized in to compete with Xiao Yan.</p><br/><p>The faces of the people present, with the exception of Xiao Yan, changed when they heard Gu He’s words. Gu He’s medicinal refining skills was widely known in the Jia Ma Empire. Even Fa Ma did not have much confidence when it came to competing with medicinal refining skills with him.</p><br/><p>“You… why don’t you change it to some other condition? Given your status, isn’t it bullying if you compete with Xiao Yan over medicinal refining skills.” Fa Ma knit his brows as he blurted out.</p><br/><p>Gu He ignored Fa Ma’s words. His eyes were glowing as they focused on Xiao Yan, who was deep in thought. He muttered with his mouth, “Bully? Ever since I was defeated in his hands back then, I ceased treating him as someone from whatever younger generation. Old fellow, don’t tell me that you dare to treat this fellow as someone from the younger generation? From how I see it, it is likely that his medicine refining skills are not weaker than yours.”</p><br/><p>Fa Ma curled his mouth upon hearing this. He had watched Xiao Yan refine medicinal pills quite a number of times recently and clearly understood just what level Xiao Yan’s medicine refining skills had reached. If one looked from the surface, Xiao Yan’s medicinal refining skills would at the very least not be poorer than his.</p><br/><p>“Xiao Yan, what do you say? Have a match with me. If you win, I will join the Yan Alliance. If you lose, you will cease coming to disturb me in the future.” Gu He’s gaze was calm as he studied Xiao Yan and spoke.</p><br/><p>Xiao Yan mused for a moment while being the focus of the few gazes around him. Immediately, he smiled and nodded. He said, “Since grandmaster Gu He has such a thought, Xiao Yan will do as you say. However, I hope that you will not find some other excuse to reject me after the victor is determined.”</p><br/><p>“You are indeed worthy of being the chief of the Yan Alliance. There has not been an alchemist within the Jia Ma Empire who dared say such words to me in so many years.” Gu He laughed instead of being angry when he heard Xiao Yan’s words. He gave an inviting gesture with his hand and laughed, “In that case, please enter the house. Old man Fa Ma, all of you can just wait here. Liu Ling, take care of them.”</p><br/><p>Gu He took the lead to turn around and walk into the straw house after he finished speaking. Xiao Yan did not hesitate as he swiftly lifted a leg to follow behind.</p><br/><p>Fa Ma and Hai Bodong could only helplessly shake their heads as they watched the two people walk into the straw house and shut the door tight. The latter sat down on a rock and muttered, “Old fellow, who do you think has a greater chance of winning?”</p><br/><p>Fa Ma shook his head when he heard this. He bitterly laughed, “How is it easy to tell? Gu He naturally has his unique points in order to be called a Pill-King. However that little fellow Xiao Yan is not an ordinary person. From watching his occasional attempts at refining pills, it is likely that he also has the skill of a tier 6 alchemist. Therefore… it is difficult to predict the ending.”</p><br/><p>Hearing this, the teapot in Liu Ling’s hand by the side suddenly stiffened when he was carefully pouring tea for the two of them. Tea ended up pouring onto a rock by the side. He turned his head and looked at the tightly shut door with shocked eyes. Never did he think that the little alchemist man from back then would actually be able to reach the same tier as teacher after being away for a couple of years…</p><br/><p>“I wonder if he can surpass teacher?”</p><br/><p>This so-called Alchemist match continued for two full days. No one outside knew just what kind of intense match Xiao Yan and Gu He had undergone during this period of time. However, from the looks of how waves of medicinal fragrances repeatedly surged from the straw house, one could tell that the match was not as relaxing as one imagined.</p><br/><p>On the second night, the tightly shut straw house door slowly opened in front of the bitterly waiting people. Two somewhat miserable looking human figures slowly walked out.</p><br/><p>Fa Ma and the other two immediately swarmed over when they saw the appearance of these two people. They anxiously asked, “Who won?”</p><br/><p>Xiao Yan and Gu He did not reveal the answer to who was the winner of this match. However, Gu He brought Liu Ling and left the place he had lived in isolation the next day after Xiao Yan’s group left. The place that they headed to was the capital.</p><br/><p>Fa Ma and Hai Bodong felt a slight awe in their hearts when Gu He announced that he would join the Yan Alliance. Their eyes contained disbelief as they looked at the smiling black-robed young man. It seemed that this fellow had indeed obtained an advantage in that match…</p><br/><p>With Gu He joining the Pill Hall, the strength of the latter naturally became even greater. Some of those few free alchemist within the empire also began to join the Pill Hall one after another after Gu He set an example. In a short while, the size of the Pill Hall swiftly expanded.</p><br/><p>Around one month or so after Gu He announced that he had joined the Pill Hall, Xiao Yan, who had nothing else to do, finally received a messenger bird from the Chu Yun Empire. He removed the scroll from it and slowly pulled it open. His expression drastically changed.</p><br/><p>“Someone from the ‘Hall of Souls’ has appeared. Come over quickly!”</p><br/>\n</div>"}