{"title": "Chapter 781: Fighting Many Alone", "id": 781, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-781-fighting-many-alone", "volume_title": "Volume 8", "body": "<h1>Chapter 781: Fighting Many Alone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 781: Fighting Many Alone</u></strong></p><br/><p>“Xiao Yan, what do you intend to do?”</p><br/><p>The two Mulan Elders did not dare to make any unusual movements. They stared at Xiao Yan’s hand-claw wrapped around the tiger-headed Elder’s throat. At this moment, the latter only needed to use a little strength to kill the Elder on the spot. They could only cry out sternly in the fear of harming their companion.</p><br/><p>“Nothing, I am merely getting rid of the problem at its roots.” Xiao Yan faintly smiled. His voice was quite calm.</p><br/><p>However, it was these calm words that caused the hearts of the three Mulan Elders to sink. Although they had taken precautions, they did not expect Xiao Yan to actually take such a big risk and come to the three army alliance’s grounds to launch a sneak attack on them.</p><br/><p>“If you kill him, you will completely become enemies with our Mulan Valley. At that time, it is likely that the situation will turn into one where we won’t give up until you die!” The Mulan Elder on the left side studied Xiao Yan with dark, solemn eyes while he spoke in a ferocious manner.</p><br/><p>“My Yan Alliance was nearly eliminated by all of you. Isn’t it a little too late to say this?” Xiao Yan’s faint smile remained on his face, but now contained some denseness. His hand tightened slightly while he said this. The tiger-headed Elder’s face immediately turned red. He widened his mouth and started panting.</p><br/><p>The two Mulan Elders’ faces twitched. They finally inhaled a deep breath of air a moment later. They suppressed the fury within their hearts and one of them said, “Xiao Yan, as long as you let him off, I swear that the Mulan Valley will no longer find trouble with the Jia Ma Empire and the Yan Alliance. What do you say?”</p><br/><p>“Nothing.” Xiao Yan continued to smile as he replied.</p><br/><p>The eyes of the two Mulan Elders shrank. Their hands, which were behind their backs, suddenly began to form seals without leaving any traces. Their mouths, however, used a deep voice to speak, “If you aren’t satisfied, we can use our Mulan Valley’s ‘Three Beast Savage Skill’ to exchange for his life. How is it? This Qi Method of ours is a Di class Middle level Qi Method. You have personally experience just what its strength is like.”</p><br/><p>“Three Beast Savage Skill?” Xiao Yan’s eyes moved slightly upon hearing these words. The eyes of the two Mulan Elders flashed with joy that was difficult to detect. However, they did not have time to speak before Xiao Yan laughed, “I am indeed very interested in this Qi Method. However, he must die!”</p><br/><p>Xiao Yan’s eyes suddenly became dark, cold at the end of his words. A jade-green flame suddenly surged from his hand. His middle finger immediately pierced forward and penetrated the throat of the tiger-headed Elder under the cover the the fire glow.</p><br/><p>Grug! Grug! Gurg! Gurg!</p><br/><p>A pillar of blood suddenly shot out and eventually left a piercing, bright-red blood stain in the snow-white tent.</p><br/><p>The two Mulan Elders blankly stared at the tiger-headed Elder, whose life force was swiftly disappearing. The latter’s body was slowly falling in a flaccid manner. The eyes of the two Mulan Elders immediately split. If they were given a little more time, they would be able to forcefully circulate the ‘Three Beast Savage Skill’. As long as they placed their combined strength into the tiger-headed Elder’s body, breaking through Xiao Yan’s clamped hand would definitely have been extremely easy. However… they lacked just a little…</p><br/><p>“Bastard Xiao Yan. The old me will turn your bone into ashes today!”</p><br/><p>A furious savage roar suddenly sounded as powerful Dou Qi suddenly surged out from the bodies of the two Elders. The momentum that was created by the Dou Qi blew away the enormous tent. The figure inside was immediately revealed to the eyes of the experts from the Mulan Valley who were patrolling in the sky.</p><br/><p>Xiao Yan’s expression was also ice-cold. The liquid blood on his hand had already been vaporized by the flame. With the help of his sharp Spiritual Perception, he naturally understood what these two old fellows were doing in secret. However, for them to assume that this could delay him, did they really think that he was some inexperienced little fellow who had just left home?</p><br/><p>“Capture him! Regardless of whether he is dead or alive!” One of the Mulan Valley Elder’s finger pointed at Xiao Yan while his furious roar resounded over the entire camp. The death of the tiger-headed Elder would be an extremely serious blow to their Mulan Valley. Having lost him, it was no longer possible to use the ‘Three Beast Savage Skill’ and having lost the ‘Three Beast Savage Skill’, the Mulan Valley had lost the ability to frighten those factions within their empire that were looking at them with ill intent. This was definitely fatal to their Mulan Valley.</p><br/><p>It was because of this reason that the two Mulan Elders were so furious at this moment.</p><br/><p>Many human figures shot into the campsite after the Mulan Valley’s Elder furiously roared. They swiftly appeared on the middle area. Numerous dense, cold eyes from the ground, the sky, and the top of the tents were staring intently at Xiao Yan. Their eyes were filled with a dark and chilly killing intent that seemed intent on tearing Xiao Yan’s corpse into ten thousand pieces.</p><br/><p>Xiao Yan’s face also changed slightly when he saw so many experts. With his Spiritual Perception, he could sense that there were three elite Dou Huangs present. Adding the two Mulan Elders, there was a total of five elite Dou Huangs. If they were to join hands, even Xiao Yan would be forced to temporarily seek shelter.</p><br/><p>Of course, it was not that Xiao Yan did not want to flee but there was nowhere to do so. These experts from the Mulan Valley were extremely experienced in combat. They had sealed off all the escape route he could take the moment they appeared. Hence, he could only forcefully charge through if he wanted to flee.</p><br/><p>Xiao Yan suddenly crouched down while this thought flashed through his heart. He ruthlessly broke a finger of the tiger-headed Elder in front of the stunned gazes of the people around him. He obtained the Storage Ring on it. He stuffed it into his breast pocket as his feet stomped on the ground. His body suddenly shot to the sky.</p><br/><p>“Stop him! Stop him now! Regardless of whether he is dead or alive! Anyone who kills him will be promoted to an external valley Elder!”</p><br/><p>The two Mulan Elders were momentarily stunned because of Xiao Yan’s action. By the time they had recovered, they suddenly became like a cat that had its tail stepped on. They immediately jumped and shouted in a raving manner.</p><br/><p>The reward that the two Mulan Elders promised seemed to possess a great allure in the eyes of these experts from the Mulan Valley. The eyes of those experts in the sky immediately turned red. Each of them let out an inflamed roar as they crazily charged toward Xiao Yan.</p><br/><p>Xiao Yan flapped the fire wings on his back as he dodged the head-on attack of an elite Dou Huang. His expression was dark and cold as he struck violently toward the head of an expert Dou Wang by the side. Flame surged immediately and the punch hit the latter. His head became like watermelon that burst apart immediately.</p><br/><p>After killing an expert Dou Wang with a single punch, Xiao Yan’s face was covered with some blood. His dark-black eyes gradually revealed a bloodthirsty, ferocious look as he once again violently charged forward and rushed toward the exit of the campsite with all his might.</p><br/><p>“Bang! Bang! Bang! Bang! Bang! Bang!”</p><br/><p>The fist that was covered by the Glazed Lotus Heart Flame violently collided with an expert Dou Huang. A powerful energy wind exploded from the spot where the two collided. Xiao Yan’s shoulders trembled while that expert Dou Huang, whose strength was around that of one star, seemed to have received a heavy blow as he flew back. In the end, he spat out two mouthfuls of fresh blood. His eyes were filled with shock as he looked at Xiao Yan whose entire body was covered with fresh blood. It was likely that he did not expect to be defeated so miserably after just one exchange in the hands of Xiao Yan, who seemed like someone in the same class as him.</p><br/><p>Although this punch of Xiao Yan might have shaken and injured that Dou Huang, the latter had managed to quietly stop his speed for an instant. It was during this instant that the two Mulan Elders, who had been staring at Xiao Yan with pernicious eyes, suddenly rose. One was at the front while the other was at his back. Their mouths emitted a mad angry roar as a bloody glow gathered on their fists. The bloody glow finally transformed into a savage bear head and a savage lion head!</p><br/><p>“Fierce Bear Ground Splitting Fist!”</p><br/><p>“Lion Inch Force!”</p><br/><p>Xiao Yan’s expression was solemn as he sensed the sharp, bloodthirsty attacks from his front and back. They had basically locked all of his retreat routes. His face also became slightly solemn as his hand seal moved and a circular dark-green fire ring swept in all directions with his body at the middle.</p><br/><p>“Fire Ring Explode!”</p><br/><p>A low roar sounded and the swiftly spreading jade-green fire ring ruthlessly collided with the fierce attacks of the two Mulan Elders. Immediately, a clear energy explosion resounded across this sky like thunder.</p><br/><p>Wild and violent energy swiftly spread. The fire ring gradually disappeared but Xiao Yan still sensed two hidden force striking toward him. The ruthless attacks, which were targeted at his chest and back, caused his throat to emit a soft groan.</p><br/><p>While Xiao Yan was injured, the two Mulan Elders were also blasted by the Glazed Lotus Heart Flame until fresh blood dripped down from their fists. Clearly, both parties had suffered some injuries during this head-on collision.</p><br/><p>Xiao Yan had yet to have the time to catch his breath after temporarily forcing the two Mulan Elders back when over ten powerful forces suddenly shot over from all directions. They aimed at all the fatal points on Xiao Yan’s body as they wrapped around him. Clearly, after having suffered the sharp close range attack from Xiao Yan, these experts from the Mulan Valley began to avoid a close range battle. Instead, they chose to rely on their powerful Dou Qi to put off Xiao Yan’s movement.</p><br/><p>Xiao Yan could ignore these Dou Qi attacks if there was only one of them. However, with so many of them attacking in an orderly manner, even he could not just allow them to hit him as they wanted to. Hence, he swiftly used the Glazed Lotus Heart Flame to form a jade-green fire armor on the surface of his body.</p><br/><p>Some of the Dou Qi pillars might have been scattered by Xiao Yan but there were still over ten of them that smashed against the fire armor. The energy wave that was formed from the intense explosion caused a great tremor to appear within Xiao Yan’s body.</p><br/><p>“Dammit… I will be held back by them in this place if this continues!” These Dou Qi pillars might not injure Xiao Yan too much, but they caused his speed to be reduced. By borrowing this reduced speed, the two Mulan Elders and the other few elite Dou Huangs had already completed the nursing of their auras. Their eyes revealed a fierce glint while they stared at Xiao Yan. Powerful Dou Skills were swiftly being agglomerated.</p><br/><p>Xiao Yan’s heart sank as he sensed the many powerful Dou Skills that were being gathered around him. Just as he was about to go all out and prepare to blast these bastards to death with the ‘Angry Buddha Lotus Flame’ once again, a ray of light suddenly rushed over from the distant sky. Within a couple of flashes, it went on a rampage and charged into this chaotic sky. A graceful lovely figure twisted before appearing in front of Xiao Yan. She extended her delicate hand and the Dou Qi pillars that rushed from all over the place disappeared into nothing.</p><br/><p>The black figure turned her head, revealing a calm and exquisitely bewitching face. It was surprisingly Medusa!</p><br/><p>Her eyes swept over Xiao Yan’s blood covered body and immediately sensed his somewhat chaotic aura. Her bewitching, long pupils revealed a dark, cold killing intent.</p><br/><p>“Next, leave them to me. I will let these two old fellows pay the price.”</p><br/>\n</div>"}