{"title": "Chapter 796: Four Wings Sky Demon Scorpion", "id": 796, "volume": 8, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-796-four-wings-sky-demon-scorpion", "volume_title": "Volume 8", "body": "<h1>Chapter 796: Four Wings Sky Demon Scorpion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 796: Four Wings Sky Demon Scorpion</u></strong></p><br/><p>The light seal did not hesitate as it ruthlessly smashed into Wu Ya’s body in front of the countless number of gazes. A soul-stirring explosion resounded over the sky.</p><br/><p>The face of even expert at the peak of the Dou Huang class, Wu Ya, was covered by an unusual redness upon receiving this heavy attack. He felt a sweetness in his throat and a mouthful of fresh blood was involuntarily wildly thrown up. The aura of his entire body was completely weary and the pair of Dou Qi wings were partially visible. A moment later, he fainted because of the intense pain that was transmitted from his chest. He fell head first to the ground.</p><br/><p>The eyes of the experts from both sides surrounding them were stunned as they looked at Wu Ya who had fallen because of his serious injuries. Some fear suddenly surged in their hearts. There was an additional horror in their eyes when they looked at the black-robed figure in the sky. If it was that Elder whom he had killed earlier, other people could still unconvincingly attribute it to his use of the Secret Technique. However, Wu Ya was a genuine expert at the peak of the Dou Huang class and even he was now seriously injured. Other than those at the Little Fairy Doctor’s level, it was likely that the chief of the Ten Thousand Scorpion Gate, Xie Shan, was the only person from both sides who could defeat him. However, even if he could win, it was likely that Xie Shan would have difficulty reaching the point where he could severely injure the someone like Wu Ya with just one strike.</p><br/><p>However, this young, black-robed person in front of them had done just that. This caused a great storm to brew in the hearts of many people.</p><br/><p>Xiao Yan ignored the many stunned and shocked gazes from around him. He inhaled a deep breath of air and swiftly took out a couple of medicinal pills that could recover Dou Qi from his storage ring. After which, he stuffed them into his mouth. Even though he had advanced to the Dou Huang class, using the ‘Open Mountain Still’ still exhausted a large amount of Dou Qi. Fortunately, he no longer fell into a weak state the moment he used it like in the past.</p><br/><p>With the medicinal pills entering his body, the temporarily empty Dou Qi feeling within him gradually disappeared. Xiao Yan’s eyes were indifferent as he looked at the falling Wu Ya. He knew that this old fellow was merely seriously injured and had not truly been killed. It was likely that he would recover his strength if he rested a couple of months after this. This was not something that Xiao Yan, who was someone who would eliminate the roots if he wanted to cut the grass, was willing to see.</p><br/><p>A faint killing intent flashed past Xiao Yan’s eyes. A spiraling fire glow was suddenly agglomerated at the tip of his finger. However, a furious roar suddenly exploded from nowhere when he was just about to shoot it toward Wu Ya. A sharp force that carried a fishy wind suddenly shot over.</p><br/><p>The suddenly sharp wind caused Xiao Yan’s face to vaguely sink. He could sense that the person who had attacked seemed to be a little stronger than Wu Ya. It was likely that the only person within the Ten Thousand Scorpion Gate who had such strength was the chief of the Ten Thousand Scorpion Gate, Xie Shan.</p><br/><p>Xiao Yan did not turn around and block it as this thought flashed through his heart. Silver glow flashed under his feet and the faint thunder roar resounded across the sky. Xiao Yan’s body faintly trembled.</p><br/><p>“Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi! Chi!” Sharp wind arrived the instant the silver glow appeared. It ruthlessly struck the vital points on Xiao Yan’s back. However, no low and deep sounds appeared when the hits landed. Instead, the serene, blue tip of the rod penetrated the body without noise.</p><br/><p>“An afterimage?”</p><br/><p>Xie Shan’s eyes immediately shrank when he saw that the blue rod penetrated the body of ‘Xiao Yan’ without causing a even a little fresh blood to flow out. The rod shook and shattered the afterimage. His eyes swept over the place. He furiously discovered that Xiao Yan had appeared above the head of Wu Ya who was falling to the ground.</p><br/><p>Xiao Yan raised his head as if he had sensed that furious gaze. He revealed a faint smile before the fire glow on his hand became like a drill that mercilessly shot into the top of Wu Ya’s head. A blood hole immediately appeared and the life force in Wu Ya’s eyes swiftly disappeared. Finally, it solidified amid a mixture of fear and shock.</p><br/><p>“Bastard, my Ten Thousand Scorpion Gate will not rest until you die!”</p><br/><p>Xie Shan was immediately furious after seeing that Xiao Yan had actually killed Wu Ya in front of him. His eyes viciously stared at Xiao Yan as he let out a low roar.</p><br/><p>After killing Wu Ya, Xiao Yan let out a breath. After using so much Dou Qi to use the ‘Open Mountain Skill’, if the effect was merely seriously injuring Wu Ya, he definietely would not have been satisfied. In addition, from the gaze that Wu Ya had towards Xiao Yan from before, he was obviously in deep contempt of Xiao Yan. Leaving enemies was not the style of Xiao Yan.</p><br/><p>Xiao Yan completely ignored Xie Shan’s furious roar. Even if he did not kill Wu Ya, it was likely that they would not let him off should the Poison Sect be defeated today. Hence, he could completely disregard such threats.</p><br/><p>Xiao Yan patted his hand and lifted his head. He looked at the ferocious face of Xie Shan and laughed, “I’m sorry. Chief Xie Shan spoke a little too late.”</p><br/><p>“Brat, tell me your name if you have the guts to! Don’t do things a nameless villain would do.” Xie Shan cried out as stared gloomily at Xiao Yan. He swung the blue rod and pointed it at Xiao Yan.</p><br/><p>When Xiao Yan had killed that Elder earlier, Xie Shan had already made sure to pay attention to him. However, he had difficulty freeing himself because he was being delayed by an expert from the Poison Sect. It was unexpected that by the time he had injured the Poison Sect expert and forced him back, Xiao Yan had already seriously injured Wu Ya. This caused him to become infuriated. Wu Ya’s strength could be considered to be one of a few even within the Ten Thousand Scorpion Gate. If he just died in this place, it was likely that Old Xie would fly into rage when he learned of the news. Hence, he did not bother about chasing after the injured expert from the Poison Sect. Instead he hurriedly turned around to attempt a rescue. However, he did not expect Xiao Yan to be so slippery and actually kill the seriously injured Wu Ya in front of him.</p><br/><p>“Yan Xiao. Since chief Xie Shan pays so much attention to me, you can firmly remember it in your heart.” Xiao Yan laughed. His eyes swept over the surrounding chaotic battleground and his heart immediately sighed in relief. The experts from the Poison Sect were not as useless as he had imagined. Although they had less expert Dou Huangs than the Ten Thousand Scorpion Sect after the betrayal of the five Elders, they had a few more expert Dou Wangs compared to the other side. Therefore, despite this battle being intense with people occasionally withdrawing from injuries, a one-sided battle did not appear.</p><br/><p>“Razor tongued brat!”</p><br/><p>A gloominess flashed across Xie Shan’s eyes. He raised his head and looked at the frightening energy ripple that was seeping out from the Dou Zong battleground high in the sky. After which, he looked around him and spoke in a dark voice, “Foolish resistance. Today, your Poison Sect will have difficulty escaping from the calamity of a destroyed sect!”</p><br/><p>Xie Shan suddenly took out a blue-colored whistle from his Storage Ring after his words sounded. A low whistle was emitted from it.</p><br/><p>Xiao Yan felt a little surprised in his heart as he watched Xie Shan perform this action. His eyes looked around but did not discover anything that was not right. It was possible that the other party was acting for him.</p><br/><p>However, the entire mountain top suddenly trembled while Xiao Yan was feeling doubt in his heart. A sharp hissing sound immediately rang out from the poison fog filled gorge that was not far away. An instant later, an enormous being charged out of the fog and appeared in front of a countless number of gazes.</p><br/><p>Xiao Yan’s expression changed a little when he lifted his head to look at the enormous being lingering in the sky.</p><br/><p>Giving the thing that had appeared a rough glance, it seemed to be an enormous scorpion that was a couple of hundred feet in size. On the back of this enormous scorpion were four pairs of wings. Its enormous hairy dark-black legs stood in the sky. There were sharp sawteeth that were as long as a person’s thigh on its legs. A quiet purple glow appeared from it. A scorpion tail that was as long as its body was swinging without a pattern. The sharp tip of the tail contained a cold glint.</p><br/><p>The sudden appearance of this enormous scorpion immediately caught everyone’s attention. The faces of some of the experts from the Poison Sect drastically changed upon seeing this being. They cried out in surprise, “Four Wings Sky Demon Scorpion? Why has it appeared here?”</p><br/><p>Xiao Yan’s eyes revealed a solemness as he looked at the enormous, ferocious scorpion. He could sense that this enormous scorpion was a genuine tier 6 Magical Beast.</p><br/><p>“Tsk tsk, this is a Magical Beast guardian that Old Xie spent a great effort in order to rein in. Today is the first time that it has revealed itself. I’ll let you try to see how formidable it is.” Xie Shan strangely laughed. The whistle in his mouth once again emitted a strange sound. Following the spreading of the sound wave, the Four Wings Sky Demon Scorpion immediately emitted a hissing sound. It immediately flapped its enormous wings and charged toward Xiao Yan like a meteorite.</p><br/><p>The enormous wind pressure that fell from the sky caused Xiao Yan to frown. A silver glow flashed under his feet and his body suddenly withdrew.</p><br/><p>“Hei, you wish to flee? Weren’t you very arrogant earlier?” Xie Shan laughed coldly when he saw Xiao Yan withdrawing. His body moved and appeared beside Xiao Yan. The blue rod that contained an unusual smell violently smashed toward Xiao Yan’s head.</p><br/><p>Xiao Yan lowered his head and dodged the rod. He was just about to move back again when a sharp wind suddenly broke through the air and arrived. An enormous black figure fell from the sky. It was surprisingly the enormous tail-needle of that Four Wings Sky Demon Scorpion.</p><br/><p>Xiao Yan clenched his hand as he sensed the sharpness of the wind. The Heavy Xuan Ruler flashed and appeared before violently smashing toward the sky. Finally, it collided with the enormous tail-needle. The powerful strength might have forced back the Four Wings Sky Demon Scorpion but Xiao Yan also took a couple of repeated steps back. There was seldom anyone who could gain the upper hand when fighting a Magical Beast with strength.</p><br/><p>“Dammit, this beast and human actually coordinate their attacks so well. All of their attacks flow naturally as though they were a single person. It seems that it is the whistle in that fellow’s mouth that is playing tricks… looks like I must send that whistle flying.” Xiao Yan tightened his somewhat numb hand while his mind muttered gloomily in his heart.</p><br/><p>The Four Wing Sky Demon Scorpion did not give Xiao Yan any rest time as this thought flashed in Xiao Yan’s heart. Two enormous black metal-like pincers danced as they clipped toward Xiao Yan.</p><br/><p>Xiao Yan frowned intently as he sensed the attack from the Four Wing Demon Scorpion that followed close behind. He was just about to withdraw once again when a sharp hissing sound was suddenly emitted from the sky. The pair of enormous black metal-like pincers suddenly shrank back.</p><br/><p>The sudden scene that appeared caused Xiao Yan and Xie Shan to be stunned. A clear tender voice laughed and was transmitted from the sky during this period of time.</p><br/><p>“Leave this big fellow to me. Xiao Yan, you can just calmly deal with that fellow…”</p><br/>\n</div>"}