{"title": "Chapter 817: Blood Sword Wu Hao", "id": 817, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-817-blood-sword-wu-hao", "volume_title": "Volume 9", "body": "<h1>Chapter 817: Blood Sword Wu Hao</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 817: Blood Sword Wu Hao</u></strong></p><br/><p>Waves of thunder-like beast roars would occasionally be emitted within the lush, green mountain forest, frightening numbers of resting birds within the forest flew away. The flapping sound that was brought about by their wings caused the air to become much more tense.</p><br/><p>There was a precipitous mountain wall covered by this lush greenery. The lower part of the mountain peak was split, forming an enormous gully. Looking from it at a great distance, it appeared just like a valley. Both sides of the valley had precipitous rock walls that were difficult to climb. The only exit was one that was not even twenty feet wide.</p><br/><p>A large group of people were currently clustered in this valley. Most of their faces were pale-white. However, there was not much panic between their brows. They were holding their weapons in their hands as their gazes coldly swept over the mountain peak and the valley exit.</p><br/><p>This group of people was quite young. They were around seventeen to nineteen years old. It was the age when people had the greatest vigor. There was also a roughly even ratio of males to females. The young ladies had eye-catching appearances. Their lively aura that was specifically possessed by young ladies was even more striking. However, these beautiful young ladies all displayed pale-white faces at this moment. This lovely and weak manner caused people to show an even greater tender loving care.</p><br/><p>A couple of solemn-looking men and women stood at the center of this group of people. Their eyes stared intently at the distant valley’s exit. The cold glint of some human figures were flashing at that spot.</p><br/><p>“Elder Wu, what do we do now? The people from the Demon Flame Valley have already sealed off the exit. The surrounding mountain walls are also unusually steep. Unless one is an expert Dou Wang, no one will be able to escape.” A middle-aged man who was around thirty years old looked at around their desperate state, and softly sighed. He laughed bitterly while speaking to the back of a man who held a heavy blood-red sword.</p><br/><p>The man who was carrying the heavy blood-red sword slowly turned around when he heard this, revealing a face that was filled with a stern expression. This face was somewhat familiar. It was also that of one of the founders of ‘Pan’s Gate’ back then. He was Xiao Yan’s good friend, Wu Hao!</p><br/><p>The current Wu Hao undoubtedly appeared much more mature compared to two years ago. That bloody aura that caused one’s heart to feel a chill had also become much fainter. Of course, this did not mean that it was weaker. Instead, the current him had gradually withdrawn that bloody aura into his body. If it was said that his previous self was a bloody crimson sword that revealed all its barbs, the current him was a sword with an edge that was covered by a scabbard. Naturally, once that scabbard was removed, that sharp bloody aura within it would completely erupt.</p><br/><p>“Let’s wait. Hopefully, Mai Di and the others were able to flee successfully. As long as they sent got out a message, any experts from the academy nearby should come and rescue us.” Wu Hao sighed and spoke as his eyes slowly swept over the faces of everyone in the valley.</p><br/><p>“This damn Demon Flame Valley. If I am able to get out this time around, I will definitely get cousin brother Xiao Li to settle this matter properly!” A tall, beautiful lady wearing instructor robes by the side coldly spoke.</p><br/><p>The lady was wearing a red instructor robes that seemed to have added a mature and enchanting aura to her. The corner of her skirt had a split that extended halfway. When the corner of the skirt moved, her long, round, sexy legs would cause those male students behind to involuntarily take a couple more glances despite them being in this kind of desperate condition. They quietly praised in their hearts, “Instructor Xiao Yu is really becoming more and more womanly…”</p><br/><p>Xiao Yu. This lady who was wearing red instructor robes was actually Xiao Yan’s older cousin sister, Xiao Yu, who had been staying in the Jia Nan Academy!</p><br/><p>Wu Hao vaguely nodded upon hearing Xiao Yu’s words. He immediately spoke in a helpless manner, “I’m afraid that those fellows won’t give us such a chance…” His expression suddenly changed when his words sounded. His gaze suddenly shifted to the valley’s exit as he spoke in a deep voice, “You should all be a little more careful. Protect the students properly. The people from the Demon Flame Valley seem to be moving.”</p><br/><p>The faces of Xiao Yu and the couple of instructors were shocked when they heard this. They immediately withdrew and spread out, surrounding those young male and female students.</p><br/><p>“Ke ke, it is really unexpected that it would actually be the renowned Bloody Sword Wu Hao from the Jia Nan Academy. I have heard so much about you…” A human figure flashed and moved at the mountain peak where the valley’s exit was located. A gray-robed person flapping his Dou Qi wings appeared there. He looked down at everyone in the valley from a high vantage point and laughed out loud.</p><br/><p>There were over ten black-clothed men standing behind the gray-robed man. Numerous dense gazes shot toward everyone in the valley.</p><br/><p>“The people from the Demon Flame Valley always like to use these kinds of sneaky tactics. If you have the guts, you should come down and fight with me!” Wu Hao’s eyes studied the gray-robed person as he coldly laughed.</p><br/><p>“Ha ha, the reputation of the Bloody Sword Elder is extremely renowned in the ‘Black-Corner Region’. Of course, that kind of all out attacking method reverberates like thunder in other’s ears…” Another laugh sounded. Immediately, a human figure flashed and appeared once again. Looking at the Dou Qi wings that were flapping on his back, it was clearly another expert Dou Wang.</p><br/><p>Wu Hao’s gaze was dark and solemn as he looked at the two expert Dou Wangs above the valley. His heart sank. His current strength was merely a four star Dou Wang. Looking at the aura of these two people, they were clearly of similar strength as him. If it was a one-on-one fight, he had the confidence that he would definitely defeat the other party. However, if it was two against one, he would clearly end up at a disadvantage. If it really reached the last stage where they staked their lives to go all out, he would definitely cause the two people on the other side to suffer great losses even if he ended up being defeated.</p><br/><p>These people did not choose to act despite having surrounded Wu Hao’s group because they were afraid of his all out fighting tactic. After all, one did not only require a little courage to really stake one’s life and go all out. These two expert Dou Wangs had quite a high position within the Demon Flame Valley. They were unwilling to part with their positions and risk their lives against this Wu Hao.</p><br/><p>“Elder Wu Hao, if you take the initiative and surrender today, I can guarantee you that we will not harm any student of the Jia Nan Academy. What do you say?” The gray-robed person from earlier laughed.</p><br/><p>“Do you really treat me like a three year old child? If I really fall into your hands, my ending will likely be at least ten times worse than dying in battle.” Wu Hao coldly continued to laugh. “You two cowards are merely hiding and don’t dare to fight me head-on. You really cause the Demon Flame Valley to lose face!”</p><br/><p>“Hee hee, Elder Wu, there is no need for you to provoke us. I know that you have put your hope on two people who have fled. However, your calculations might not be as good as you think. An injured Da Dou Shi who is carrying a burden wants to throw off being chased by our Demon Flame Valley’s elite assassins?” The other expert Dou Wang coldly laughed.</p><br/><p>Wu Hao’s expression changed. His fist also slowly tightened.</p><br/><p>“Moreover, do you really think that you alone can protect them? Hee hee, once our Demon Flame Valley’s Fourth Elder arrives, I will see just how you can act arrogantly? Tsk tsk, these little girls from the Jia Nan Academy are quite beautiful. Moreover, all of them are covered with haughtiness. At that time, we might be able to auction them off for quite a lot of money after we will drag them back and teach them properly.”</p><br/><p>A bloody aura suddenly surged from Wu Hao’s body when he heard this lewd laughter. His eyes were savage as he glared at the expert Dou Wang who had spoken. His voice was sinister as he spoke, “Bastard from the Demon Flame Valley. Sooner or later, I will let all of you become dead souls under by sword!”</p><br/><p>“Ha ha, brat, you should say this after you leave this place alive.”</p><br/><p>Wu Hao’s dense voice merely caused the two expert Dou Wangs to laugh while facing the sky.</p><br/><p>Their arrogant laughter reverberated over the valley. The beautiful faces of quite a number of young ladies paled. Although most of them had some background, this kind of background did not hold much sway in a chaotic place like the ‘Black-Corner Region’.</p><br/><p>“We can only forcefully charge now. Otherwise, we will really not have the slightest chance once the Fourth Elder from the Demon Flame Valley arrives. Four instructors, you will follow me and do your best to block them. Xiao Yu, you will lead everyone else and charge forward at that time. Do not turn around!” Wu Hao inhaled a deep breath of air, turned his head, and spoke with a deep voice.</p><br/><p>“Yes!”</p><br/><p>Xiao Yu tightly bit her lower red lip. She tightened her delicate hand, clearly understanding that Wu Hao’s group would risk their lives to obstruct the other side. Otherwise, it would be extremely difficult to delay the two expert Dou Wangs from the other side.</p><br/><p>Wu Hao’s hand slowly gripped the heavy sword on his back. A sky-surging bloody aura suddenly erupted from Wu Hao’s body. He immediately let out a furious roar as his body charged toward the valley’s exit as a bloody figure. The large group of students behind hurriedly followed. Waves of powerful Dou Qi seeped out. Although they may appear individually weak, their aura did have some strength when merged together.</p><br/><p>“Hee hee, are they finally about to go all out… stop them!”</p><br/><p>The two expert Dou Wangs immediately let out cold laughter upon seeing the actions of Wu Hao’s group. They immediately cried out in deep voices.</p><br/><p>When their cry sounded, the originally empty top of the valley suddenly saw the appearance of numerous black-clothed people. These people rushed down. They tightly gripped their sharp weapons as they charged at Wu Hao’s group.</p><br/><p>“Kill!”</p><br/><p>Wu Hao’s blood-red eyes focused on the black-clothed human-tide that surged over. He emitted a furious roar as his heavy sword violently hacked down. Dozens of feet large blood-colored sword glows shot out. They sliced a couple of black-clothed people in front of him.</p><br/><p>Fresh blood spluttered. However, this did not cause the attacks of the black-clothed people to slow. Numerous human figures rushed over and swiftly surrounded Wu Hao’s group. Their swords immediately moved in unison!</p><br/><p>“Clang! Clang!”</p><br/><p>The students from the Jia Nan Academy clashed with the black-clothed group. Sharp Dou Qi surged as both parties killed until their eyes turned red. Although the former group did not have as much combat experience as the latter group, they were superior in having a firmer foundation. By joining hands, the former was able to block the other party’s attacks.</p><br/><p>Wu Hao was at the very front of this group, forming an arrow that shot toward the valley’s exit. Two powerful Dou Qis suddenly rushed down from the sky just as they were about to reach the exit. The blood sword in Wu Hao’s hand was swung and a blood glow shot out. Finally, it blocked the two Dou Qis that came from the sky.</p><br/><p>Two human figures rushed down as their Dou Qi explosively shot out. They immediately joined hands and attacked Wu Hao. The latter hurriedly met them with all his strength. In an instant, powerful Dou Qi surged out, forming a sharp sword glow that caused a layer of dirt on the ground to be removed.</p><br/><p>“Clang!”</p><br/><p>Sparks were accompanied by the sounds of metal colliding as an energy ripple burst forth. Wu Hao and the two expert Dou Wangs hurriedly took a step back. Blood traces appeared on the former’s mouth. That aura of his was even more violent.</p><br/><p>On the other hand, the two expert Dou Wangs merely rubbed their somewhat numb hands. They looked at the red-eyed Wu Hao and knit their brows. In their hearts, they silently cursed this was indeed someone who did not want his life…</p><br/><p>A blood redness also surged onto Wu Hao’s face. His eyes stared intently at the two Elders who were blocking their way. Knowing in his heart that he could not delay any longer, he circulated the Dou Qi within his body to its limit. Blood-colored Dou Qi shrouded his body like a bloody fog. A bloody stench filled the entire valley.</p><br/><p>The faces of the two expert Dou Wangs changed slightly when they felt Wu Hao’s aura. This was indeed a troublesome fellow…</p><br/><p>A faint elderly laugh suddenly resounded in the sky just when Wu Hao was prepared to use all his strength. Finally, it reverberated mightily in the valley.</p><br/><p>“Hee hee, you are indeed worthy of your name Blood Sword. This bloody Dou Qi is the most dense one that the old me has ever seen with the exception of those fellows from the Blood Sect.”</p><br/><p>The two Demon Flame Valley’s expert Dou Wangs immediately rejoiced upon hearing this old-sounding laugh. On the other hand, the faces of Wu Hao’s group suddenly became pale. They slowly lifted their heads, only to see a green-robed old man standing in the sky. A frightening aura that was much stronger than an expert Dou Wang seeped from him…</p><br/>\n</div>"}