{"title": "Chapter 821: Turbulent Times", "id": 821, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-821-turbulent-times", "volume_title": "Volume 9", "body": "<h1>Chapter 821: Turbulent Times</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 821: Turbulent Times</u></strong></p><br/><p>The smile on Wu Hao’s face was slowly withdrawn when he heard Xiao Yan’s question. He frowned intently, mused for a moment before saying, “This Demon Flame Valley is also an old faction within the ‘Black-Corner Region’. It has existed for quite a long time. The strength of the valley is also unusually great. Originally, they did not have much conflict with the Jia Nan Academy. Due to ‘Xiao Gate,’ our relationship has become like fire and water during this one to two years.”</p><br/><p>“What’s the matter?” Xiao Yan was slightly startled. This matter was actually related to ‘Xiao Gate’?</p><br/><p>“The main reason is that ‘Xiao Gate’ is developing too quickly. It could be considered a renowned faction within the ‘Black-Corner Region’. The expansion of a faction will naturally involve some unavoidable issues with other factions. Hence, due to some issues, ‘Xiao Gate’ and the Demon Flame Valley have had some conflicts. With the increase in the intensity of these conflicts, a big battle is naturally unavoidable…” Wu Hao sighed helplessly. “In the beginning, this Demon Flame Valley had revealed its powerful strength as an old faction. ‘Xiao Gate’ was repeatedly defeated in their few battles. In the end, the Jia Nan Academy finally intervened and helped ‘Xiao Gate’ defeat the Demon Flame Valley. During the battle we killed a couple of experts from the Demon Flame Valley. It was due to this that the Demon Flame Valley and the Jia Nan Academy formed an enmity.”</p><br/><p>“This Demon Flame Valley’s tactics are extremely despicable. After bearing a grudge with the Jia Nan Academy, they quietly attacked the students from the academy who went out to train. Quite a number of students have died to their hands during these one to two years. These actions have completely angered the Jia Nan Academy. Originally, we seldom intervened unless ‘Xiao Gate’ was in deep trouble. In the end, it basically became a big battle between the Jia Nan Academy and the Demon Flame Valley. A life and death battle will erupt the moment the experts from both sides meet.” Wu Hao grit his teeth when he spoke until this point. Clearly, he felt extremely furious about the despicable means of the Demon Flame Valley.</p><br/><p>Xiao Yan’s expression slowly turned dark and solemn as he watched Wu Hao’s furious face. Attacking the ordinary students. This kind of tactic was so unscrupulous that it made one’s hair stand. No wonder the Jia Nan Academy would be so furious. It even gave up its neutral stance and began a war with the Demon Flame Valley.</p><br/><p>“Not long after the Jia Nan Academy and the Demon Flame Valley began a war, the latter recruited all the experts who had joined hands with Han Feng in attacking the Inner Academy back then. Their main purpose is to oppose the Jia Nan Academy… the strength of this Demon Flame Valley is quite strong. Even with the strength of the Jia Nan Academy, it is difficult to eliminate. Hence, the big battle has continued to remain in a stalemate. In this way, the academy would dispatch strong people to guard the students each time they would come out to train. However, word of this was unexpectedly leaked this time around and the other side discovered our traces. If you had not appeared in time, it is likely that the people here would not have had a good ending…” Wu Hao frowned as he continued speaking.</p><br/><p>“If we were to compare their foundations, it is likely that the time that the Demon Flame Valley has existed is much shorter than the Jia Nan Academy right?” Xiao Yan mused as he spoke. The Jia Nan Academy might only have First Elder Su Qian as their only elite Dou Zong on the surface, but he knew that the academy definitely hid an extremely frightening strength. One example was those two hall guardians in that mysterious valley.</p><br/><p>“Those guardians will not intervene until the academy reaches a point where its survival hovers on the brink. Not one of them has appeared even during the emergency moment when Han Feng attacked the Inner Academy…” Wu Hao bitterly laughed.</p><br/><p>Xiao Yan could only nod his head helplessly when heard this. These old fellows might be strong, but they were all antiquated people who only knew how to abide by the rules.</p><br/><p>“Does that Demon Flame Valley also possess an elite Dou Zong?” Xiao Yan frowned and asked. First Elder Su Qian was a genuine expert Dou Zong. If even his intervention could not finish off the Demon Flame Valley, it was likely that the other party also possessed an elite Dou Zong.</p><br/><p>“Yes. The valley chief of the Demon Flame Valley is also an elite Dou Zong. However, he usually spends most of the time in retreat and seldom appears in the ‘Black-Corner Region’. An ordinary person does not know much about him. A genuine expert in the ‘Black-Corner Region’ does not have much interest in snatching the so-called Black Ranking. Hence, you should not be assured that this thing measures the overall strength of the ‘Black-Corner Region’. By being able to survive for such a long time around the Jia Nan Academy, it is not an exaggeration to say that this chaotic region is a place riddled with hidden dragons and tigers.” Wu Hao spoke in a deep voice, “Even the strength of the Gold Silver Elders would possess a great gap when compared to these true experts.”</p><br/><p>Xiao Yan slightly nodded. From the looks of the situation now, the ‘Black-Corner Region’ did indeed hide its roots deep. The original him was indeed as short-sighted as a mouse, actually thinking that the Gold Silver Elders were the strongest people within the ‘Black-Corner Region’.</p><br/><p>Of course, the current Xiao Yan was naturally not the one who possessed the strength of a Dou Wang from two years ago. The current him was a genuine expert Dou Huang. It was not as though there were no elite Dou Zongs who had been defeated in his hands. He believed that should he exchange blows with Han Feng from back then with his current strength, he would definitely not need to use Yao Lao’s strength like he had done before in order to defeat the latter.</p><br/><p>“Looks like this ‘Black-Corner Region’ had been going through turbulent times during my two years of absence…” Xiao Yan sighed softly after hearing Wu Hao describe the changes in the ‘Black-Corner Region’ during these two years.</p><br/><p>“Your return this time around… won’t be just to visit us, right?” Xiao Yu by the side glanced at the Little Fairy Doctor beside Xiao Yan as she asked a question.</p><br/><p>Xiao Yan rubbed his nose and laughed, “I have some matters that require me to look for First Elder. Moreover, the ‘Fallen Heart Flame’ within the Inner Academy’s ‘Blazing Sky Qi Refining Tower’ has likely been exhausted, no?”</p><br/><p>“To think that you actually remembered this. It was exhausted half a year ago. If the First Elder had not been held back by the Demon Flame Valley, making him unable to leave, it is likely that he would have already charged to the Jia Ma Empire to capture you.” Xiao Yu rolled her eyes at Xiao Yan as she replied.</p><br/><p>Xiao Yan involuntarily felt somewhat embarrassed when he heard this.</p><br/><p>“Since you are also going to look for First Elder, why don’t you return with us to the Jia Nan Academy?” Wu Hao laughed and changed the topic.</p><br/><p>Xiao Yan hesitated for a moment before shaking his head. He said, “The ‘Black-Corner Region’ is holding a large scale auction. I need to go and take a look. This time, I have come to search for some information on a batch of medicinal ingredients and I might be able to obtain some news there.”</p><br/><p>“The auction in the Black Emperor City, right? I have also heard of it. Indeed it is the largest auction within the ‘Black-Corner Region’ during these few years.” Wu Hao was startled. He immediately knit his brows and said, “In that case, I shall not stop you. However, you need to be careful when you reach the Black Emperor City. That place has basically gathered over half of the experts and factions within the ‘Black-Corner Region’. According to my information, it seems that the Demon Flame Valley will also participate in it.”</p><br/><p>Xiao Yan gently nodded. He laughed, “Relax, if I really meet that Demon Flame Valley, I will coincidentally have the opportunity to see just how strong this faction, which can contend with the Jia Nan Academy, really is.”</p><br/><p>“Let’s go, I will protect all of you for a certain distance. Once that auction in the Black Emperor City is over, I will make a trip to the academy.” Xiao Yan smiled as he spoke to Wu Hao and Xiao Yu.</p><br/><p>“Alright. As long as we reach a city, we will be able to communicate with the Jia Nan Academy. We will be safe at that time.” No one rejected Xiao Yan’s suggestion. Although the people from the Demon Flame Valley who had chased them had all been killed, Wu Hao was seriously injured. They would naturally be much safer with someone as strong as Xiao Yan protecting them.</p><br/><p>Wu Hao did not continue to delay after they finished their discussion. He let out a yell and ordered everyone to quickly begin moving. After which, they swiftly left this small valley where they had lingered on the line between life and death…</p><br/><p>With a flick of Xiao Yan’s finger, the corpse of Xie Zhen was turned into ashes on the ground. This way, the Fourth Elder from the Demon Flame Valley quietly disappeared like smoke.</p><br/><p>They spent around two hours traveling after they left the valley before a city appeared amid some tall mountains. Xiao Yan ensured that Wu Hao’s group was settled before they separated once again. He continued to hurry to the Black Emperor City. The time when the auction would begin was quickly nearing. Hence, Xiao Yan could only pick up his pace.</p><br/><p>Although Wu Hao was quite interested in the large scale auction in the Black Emperor City, he was naturally unable to request to follow them with so many burdens hanging around him. After all, the current Black Emperor City was extremely chaotic and filled with all sorts of people. Should any accident happen, it was likely that one would be unable to find a person in it. Therefore, he could only wait in this city for the experts from the Jia Nan Academy to rush over and eventually send these students, who had suffered a great shock, back to the academy.</p><br/><p>Xiao Yan’s three man group had already swiftly left this city while Wu Hao was feeling depressed because of his responsibilities. They quickened their pace and flew to the location of the Black Emperor City according to the map.</p><br/><p>After non-stop fast traveling for a day, Xiao Yan’s group gradually approached the Black Emperor City. As their distance from the Black Emperor City decreased, Xiao Yan was also somewhat astonished to discover that the human flow that was heading to the Black Emperor City had begun to increase. Clearly, these people were also headed to the Black Emperor City because of the auction.</p><br/><p>In a place like the ‘Black-Corner Region’, it was only natural that some conflict would erupt with the presence of more people. The Little Fairy Doctor initially felt somewhat surprised at the belligerence of the people in this place as they saw bloody battles appearing periodically. In the end, she was actually able to ignore them just like Xiao Yan and Zi Yan.</p><br/><p>They continued traveling in this manner. It was only when evening arrived did an enormous city outline become partially visible at the edge of their sight…</p><br/><p>That enormous city at the end of the main road finally appeared in Xiao Yan’s sight as they approached.</p><br/><p>Xiao Yan studied the towering city wall from a distance as he stood on the top of a slope. Shock flashed across his eyes.</p><br/><p>This Black Emperor City was indeed just as its name suggest. Its grand size did not cause that ‘Emperor’ word to be outshone. The dark-black city wall, that extended to the horizon, contained a frigid feeling. Under the remaining sunlight, the black-colored city wall appeared just like a mirror that reflected a faint glow.</p><br/>\n</div>"}