{"title": "Chapter 839: The Start of the Show", "id": 839, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-839-the-start-of-the-show", "volume_title": "Volume 9", "body": "<h1>Chapter 839: The Start of the Show</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 839: The Start of the Show</u></strong></p><br/><p>The location where the Black Emperor Sect held the auction was an exceptionally large open ground located in the middle of the city. Even though this was the case, the Black Emperor Sect seemed to have somewhat underestimated the attraction of this auction.</p><br/><p>When Xiao Yan’s group arrived at the auction and saw the seemingly endless black masses of human traffic, they immediately felt speechless. Each of these fellows was even more crazy than the other.</p><br/><p>Fortunately, the Black Emperor Sect seemed to have expected such a situation. Hence, they had designed a tunnel that was for the use of the experts from the ‘Black-Corner Region’. After Xiao Yan’s group made some inquiry, they took a couple of turns and successfully arrived in front of the tunnel.</p><br/><p>There were many guards from the ‘Black Emperor Sect’ guarding this tunnel. Their hands carried sharp weapons that contained cold glints. The fierce human traffic that was shaken to the point of not daring to approach. A couple of Black Emperor Sect’s Elders were also randomly standing at the tunnel’s entrance. The powerful Dou Qi that spread out from their bodies caused the people around to feel a constant pressure.</p><br/><p>At this moment, there would occasionally be some people entering this special tunnel. Each time this happened, it would attract a low exclamation from the massive crowd around. Those who were able to enter from this place were mostly those experts and factions who possessed great reputation within the ‘Black-Corner Region’. These great people were those that the ordinary people within the ‘Black-Corner Region’ had difficulty seeing.</p><br/><p>Those few Elders from the Black Emperor Sect would smile and come forward amid those exclamations. They would courteously invite each group to enter the tunnel.</p><br/><p>Xiao Yan’s three man group slowly climbed the stairs in front of the many gazes. After which, they made their way to the entrance of the tightly guarded tunnel.</p><br/><p>The many gazes around glanced at these three foreign figures. Two of them were completely wrapped in large black robes. Not even the contour of their bodies was revealed under the cover of the robe’s shadows. The person who attracted the greatest attention among the three was the white-clothed Little Fairy Doctor with snow-white hair. Her ethereal demeanor caused the eyes of quite a number of people to brighten.</p><br/><p>“Who are these skilled individuals? Why have we never heard of them?”</p><br/><p>“I’m not certain… are they from outside of the ‘Black-Corner Region’.”</p><br/><p>The Little Fairy Doctor’s appearance one that was extremely foreign to the people from the ‘Black-Corner Region’. Immediately, many people began to engage in private conversations with some uncertainty.</p><br/><p>The three Black Emperor Sect’s Elders guarding the door discovered the three of them while everyone was feeling some uncertainty. Their faces changed when they saw the cold-faced white-clothed Little Fairy Doctor. All of them hurriedly revealed a warm smile on their faces and stepped forward to greet the group.</p><br/><p>From their manner, it was clear that they already knew of the Little Fairy Doctor’s strength. They were likely also present in that pill refining storm back then.</p><br/><p>“Ke ke, mister Yan Xiao, you have finally arrived.” A Black Emperor Sect’s Elder in green robes cupped his hands toward Xiao Yan and laughed.</p><br/><p>Xiao Yan, who was completely hidden under a black robe, randomly nodded to this Elder. He did not reply unnecessarily.</p><br/><p>The Elder did not dare to feel the slightest dissatisfaction from this somewhat haughty manner. The ability of an alchemist who could refine a high grade tier 6 medicinal pill was far from what him, a Black Emperor Sect Elder, could compare with. Moreover, there was an elite Dou Zong with ice-cold eyes by Xiao Yan’s side.</p><br/><p>“Ke ke, please come in.” After conversing a little with Xiao Yan and seeing that the other party was not interested, the Elder tactfully moved aside while continuing to speak with a smile.</p><br/><p>“Thank you very much.” Xiao Yan cupped his hand to that Elder. He bluntly led the other two and entered the specially reserved tunnel. After which, they disappeared from everyone’s eyes.</p><br/><p>“Hu… that woman. Her aura is really cold. The Dou Qi within my body almost stopped circulating while standing beside her. She is indeed worthy of being an elite Dou Zong.” That green-robed Elder rubbed the cold sweat off his face after watching Xiao Yan’s group disappear within the tunnel. Finally, he spoke with some lingering fear in his voice.</p><br/><p>“That Yan Xiao should be the person who was refining medicinal pills back then, right? How unexpected. He actually possesses such an achievement at such a young age. Compared to him, even the junior sect leader is a little inferior.” An Elder softly sighed.</p><br/><p>“I really wonder what is their background. We have never heard of these three people within the ‘Black-Corner Region’.” Another old man frowned and muttered.</p><br/><p>“Forget it, these matters are not things that we should be thinking.” The green-robed Elder shook his head. His gaze swept over the tunnel before he saw another group of people appearing. A smile once again surfaced on his face as he stepped forward.</p><br/><p>Xiao Yan’s group passed through the dimly lit tunnel. A couple of minutes later, the space in front of them suddenly opened up, and an extremely big auction ground appeared in the eyes of the three of them.</p><br/><p>Xiao Yan involuntarily clicked his tongue and praised as he glanced at the unknown number of densely packed seats on the auction ground. This was the first time in his life that he had witnessed an auction of this size. Compared to this place, the auction that the Primer clan held in the Jia Ma Empire was like a tiny being meeting someone greater. They could not even be talked about together.</p><br/><p>At this moment, the enormous auction grounds were packed by quite a number of people. Hence, various voices gathered together, appearing somewhat noisy.</p><br/><p>The three of them had just walked out of the tunnel when a somewhat pretty and unusually sexily clad female servant came forward. She respectfully inquire, “Three sirs and miss, may I know if you have a VIP jade plate?”</p><br/><p>Xiao Yan’s gaze swept across this female servant’s clothes, which were almost no different than wearing nothing. He discovered that it was difficult to hide some of her exposed nakedness, and he could not help but feel stunned. The Black Emperor Sect was actually resorting to this sort of tactic?</p><br/><p>A soft snort suddenly sounded behind Xiao Yan while his heart was stunned. Only then did he awkwardly smile. He did not dare to bother about whether the snort was emitted from the large or small beauty behind him as he hurriedly took out the jade plate that Mo Ya had given them earlier. He then handed it over.</p><br/><p>The expression on the female servant’s face became even more respectful and humble after receiving the jade plate. She respectfully greeted the three of them again, bowed, and said, “Please follow me.” She turned around after speaking, swayed her delicate snake-like waist and led the way. Xiao Yan hurriedly maintained a forward gaze as he followed close behind.</p><br/><p>The three of them followed the female servant and took a couple of turns within the auction ground. Awhile later, they finally stopped somewhere near the front of the auction ground. After which, she bowed and withdrew.</p><br/><p>The front row of the auction ground was composed of many extremely small rooms. Their constructions were unique, appearing exceptionally luxurious. When someone sat within one, the various noises from behind seemed to become distant. Xiao Yan’s eyes looked forward and saw that he had a good view. He absorbed the various corners of the auction ground into his eyes.</p><br/><p>Xiao Yan directed the two others to take a seat in this VIP room. After which, he shrank his body into a soft and comfortable chair. His gaze slowly swept over some of the other VIP seats.</p><br/><p>At this moment, quite a number of people were sitting in their VIP seats. Hence, the appearance of Xiao Yan’s group attracted quite a number of gazes. The Little Fairy Doctor’s unique appearance was naturally unforgettable. Hence, she was recognized with just a sweeping gaze.</p><br/><p>“The black-robed person in the middle should be that mysterious alchemist from two days ago, right? I wonder what his background is. If the ‘Black-Corner Region’ possessed an alchemist of such a tier, it is likely that everyone already knows of him.” Fang Yan spoke in a deep voice. He sat in a VIP seat while he knit his brows and looked at Xiao Yan, whose entire body was wrapped in a black robe.</p><br/><p>The couple of Demon Flame Valley’s Elders beside him also shook their heads slightly in the face of his doubt.</p><br/><p>“Hopefully, they will not become our obstruction…” The gray-robed person slowly spoke in a hissing voice. Those dark, dense eyes under the gray robes stared intently in Xiao Yan’s direction. For some unknown reason, that familiar feeling was becoming more obvious…</p><br/><p>Xiao Yan discovered these gazes that possessed ill intent after Fang Yan’s groups gazes collectively gathered on Xiao Yan’s group. His brows under the black robe knit together before his gaze immediately drifted past the red-haired Fang Yan and paused on the gray-robed person. For some unknown reason, this fellow was repeatedly giving him a dangerous and strange feeling.</p><br/><p>Xiao Yan gently swung his head and suppressed the emotions in his heart. He shut his eyes and began to rest, waiting for the auction to begin.</p><br/><p>A large number of people began to enter the auction ground not long after Xiao Yan shut his eyes. More and more human figures appeared in the VIP seats up front. After half an hour, almost all the seats had been taken.</p><br/><p>Xiao Yan’s eyes slowly opened in the shadows of the black robe after the seats had all been filled. He softly sighed, “It looks like there are indeed quite a number of experts attracted by this Bodhisattva Body Transformation Saliva…”</p><br/><p>After gathering details with his eyes shut earlier, Xia Yan discovered that other than First Elder Su Qian and that mysterious gray-robed person, there were at least two obscure auras within VIP seats. Those who were able to hide their strength in front of his sharp Spiritual Perception were either elite Dou Zongs or those who had used some Secret Technique to hide their aura. These two types of people would definitely not be ordinary.</p><br/><p>The Little Fairy Doctor slightly nodded. A solemness appeared in her grayish-purple eyes. The difficulty of snatching this Bodhisattva Body Transformation Saliva had somewhat exceeded her expectations…</p><br/><p>The clear sound of a gong suddenly rang out from the middle of the auction ground while Xiao Yan mused. It immediately lingered over the entire auction and suppressed the noise.</p><br/><p>The ringing of the gong slowly ceased and an energy light ring slowly rose. Finally, it locked the auction table within it like a cage. This was a kind of protective measure. Most of the people within the ‘Black-Corner Region’ were lawless. Something like robbing the auctioned items had occurred before. Although the Black Emperor Sect was not an ordinary faction, it was best to be careful. After all, the items that were to be auctioned this time around were far too valuable. Should any mishap occur, the Black Emperor Sect would lose all its face.</p><br/><p>Xiao Yan softly exhaled as he observed the circular energy ring that had risen. It was finally about to begin…</p><br/>\n</div>"}