{"title": "Chapter 852: Splitting a Corpse", "id": 852, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-852-splitting-a-corpse", "volume_title": "Volume 9", "body": "<h1>Chapter 852: Splitting a Corpse</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 852: Splitting a Corpse</u></strong></p><br/><p>Xiao Yan smiled as he quickly looked over the Magical Beast corpse that had appeared in the room. His body moved and he leaped down from the bed. After which, he slowly walked to the side of the corpse. His eyes slowly took in the sight before him.</p><br/><p>Due to this Magical Beast corpse having been dead for a long time, the flesh on its entire body had dried and shrunk together. Therefore, Xiao Yan was unable to identify just what Magical Beast it was from its outer appearance. However, Xiao Yan did not have much interest in the body of this Magical Beast. His only interest were the jade-like bone wings of this Magical Beast since they could help him refine a pair of high quality Sky Bird Nine Flying Wings.</p><br/><p>Xiao Yan shifted his feet, and stopped when he was next to the jade-like bone wings, which were twenty to thirty feet wide. His hand gently rubbed the bone wings. An frigid feeling could be felt from his hand. However, this icy-cool feeling contained a faint warmth. It was difficult to imagine that this dried corpse, that had been dead for an unknown number of years, would still be able to emit heat.</p><br/><p>These jade-like bone wings were somewhat transparent. Hence, Xiao Yan was able to see an unusual energy with his naked eye. It seemed to be flowing a within the bone wings.</p><br/><p>“Clang! Clang!”</p><br/><p>Xiao Yan’s finger gently knocked on the jade-like bone wings. The toughness that was transmitted to his hand caused Xiao Yan to nod his head in satisfaction. His eyes immediately narrowed as his Spiritual Strength followed his finger and quietly entered those wings.</p><br/><p>Xiao Yan’s spiritual strength carefully traveled through his bones. However, before he could let it loose, the bone wings suddenly emitted a bright jade-like glow. Xiao Yan’s spirit immediately appeared to have entered a tornado. A wild and violent suctioning strength brutally tore his spiritual strength into nothing.</p><br/><p>Xiao Yan’s narrowed eyes were suddenly opened. His hand withdrew as though it had been shocked by electricity. His eyes revealed a thread of lingering fear as they study the jade-like bone wings. Some shock surged into his heart. He did not expect the bone wings to hide such a wild and violent wind affinity energy. Moreover, the thing that caused Xiao Yan to be most surprised was that the wind energy still emitted a miniscule feeling of heat. These two kinds different affinities were perfectly preserved in these wings. Such a situation was really mysterious.</p><br/><p>“It is indeed worthy of being an ultimate fierce beast about to breakthrough to the eighth rank. Despite having been dead for many years, its wings are still able to preserve such a wild and violent energy. If these are used to refine the Sky Bird Nine Flying Wings, the product might be greater than originally expected.” Xiao Yan licked his lips. Some fiery heat gradually surfaced in his dark-black eyes. This time around, he might really have gained a treasure. It was worthwhile to spend a couple of medicinal pills even if the interior of this Magical Beast corpse was only a pile of rotten flesh. Just these bone wings would be able to match the value of those medicinal pills.</p><br/><p>Xiao Yan gently rubbed his hands. His eyes once again glanced at this large Magical Beast corpse. His hand shook and a sharp longsword appeared. A layer of a jade-green fire quietly seeped out. It lingered around the blade. The hot temperature caused this steel longsword to emit a tiny bit of white smoke.</p><br/><p>Chi!</p><br/><p>Xiao Yan positioned the longsword before he violently pierced it into the spot where the jade-like bone wings connected to the corpse. The expected resistance did not appear. The skin on the surface of the dried Magical Beast was like beancurd as the longsword penetrated it.</p><br/><p>Xiao Yan sighed in disappointment when he felt this. It seemed that the skin of this Magical Beast lost its toughness from the rot over the years. His intentions of using it to create a hide armor could only be dismissed.</p><br/><p>Chi!</p><br/><p>Xiao Yan tightly gripped the sword hilt in his hand as he swung the longsword to slowly cut off the skin at the bottom of the bone wings. Once the skin on the surface was cut off, an unusually white flesh was revealed under it. However, not the slightest amount of blood seeped out.</p><br/><p>Although Xiao Yan felt somewhat surprised that this Magical Beast meat was maintained for many years without rotting, he could only shake his head in disappointment after studying it in detail. There was not the slightest amount of energy mixed in this flesh. It was likely that the only reason it was able to survive for so long was because it was covered by skin.</p><br/><p>Xiao Yan’s blade carefully created two large holes in this dried Magical Beast’s corpse. After which, he took out the jade-like bone wings, and carefully placed them on the ground.</p><br/><p>The jade-like bone wings, that had left the body of the Magical Beast, did not show any signs of dimming. This caused Xiao Yan to sigh in relief. He was somewhat worried that this thing would transform into a pile of useless things the moment they left the body. Looking at them now, his worry was unnecessary.</p><br/><p>Xiao Yan extended his head into one of the two large holes after removing the bone wings. A sour stench that caused one to feel giddy vented from it, choking him until he hurriedly stopped breathing.</p><br/><p>Xiao Yan shrank back. He hesitated for a moment before clenching his teeth and saying, “I don’t believe that such a large body does not hold anything.” The sword blade was swung after his voice sounded. It cut with a couple of light arcs, and swiftly left behind over a dozen deep sword scars.</p><br/><p>Thin wire-like sword scars slowly curled before swiftly expanding. A couple of blinks later, they split apart like a slit. The Magical Beast corpse appeared to have been split into multiple pieces as it collapsed. Dense, white flesh was revealed. This large fellow was disemboweled by Xiao Yan.</p><br/><p>A thick, sour stench seeped out after this dried Magical Beast corpse was opened by Xiao Yan. Finally, it curled up and emitted a ‘chi chi’ sound when it met the ceiling. The ceiling was immediately corroded in front of Xiao Yan’s stunned eyes. An enormous hole was formed. If one stood beneath it, one would be able to see the crescent moon hanging in the night sky.</p><br/><p>Xiao Yan clicked his tongue, and marveled the sight after the sour stench completely scattered. He carefully stood beside that Magical Beast corpse that was cut open. His gaze swept over it before disappointment appeared in his eyes. One could see that the interior of this Magical Beast corpse was only filled with dense, white flesh. Not even a small piece of bone remained, much less any internal organs.</p><br/><p>“Don’t tell me that they were corroded by that acidic gas? But why is it that this flesh has not corroded?” Xiao Yan knit his brows and doubtfully muttered. However, he still had no answer a moment later.</p><br/><p>“Dammit, even if the acidic gas is able to corrode its bones and organs, what about the Monster Core? That is the spot where a Magical Beast’s energy agglomerates. It’s impossible that it was also corroded by the acidic gas, right?” Xiao Yan frowned. His hand continued to grip the longsword as he randomly cut the dense, white flesh over ten times. This was especially the case at the Magical Beast’s head. However, only a shockingly white color remained where the flesh parted. The head was completely empty without the slightest trace of blood or organs, much less a Monster Core.</p><br/><p>“Does this large fellow only have these bone wings?” Xiao Yan once again cut some pieces of meat. However, it was futile. He could only helplessly abandon the longsword and softly curse.</p><br/><p>“Ugh, forget it. With these bone wings, I can be considered to have recouped what I spent. If it doesn’t have anything else, then so be it.” Xiao Yan was depressed for a moment before he shook his head. Just as he was planning to store the corpse of this Magical Beast he had dissected, a tender, clear voice suddenly sounded in the room.</p><br/><p>“You are actually committing such a disgusting act at night.”</p><br/><p>Xiao Yan was startled when he heard this familiar voice. He immediately raised his head and saw that Zi Yan was shaking her two small snow-white legs on the roof where the acidic gas had corroded it away. She was curling her mouth and staring at him.</p><br/><p>“Why aren’t you asleep so late at night? What are you doing running to the roof of my room?” Xiao Yan sat down in a chair and laughed as he rolled his eyes at Zi Yan.</p><br/><p>“Originally, I intended to sleep but ended up sniffing a scent that caused me to feel extremely uncomfortable. After which, I woke up and searched for the source of the scent.” Zi Yan gently leaped into the room. She used her leg to kick at the mysterious Magical Beast corpse that had been disemboweled. She said, “So it originated from this thing.”</p><br/><p>Xiao Yan lazily leaned against the backrest of this chair. He laughed, “If you are interested, you can just take it away. I don’t know if the meat that has been inside it for an unknown number of years can still be eaten.”</p><br/><p>Zi Yan, whose back was facing Xiao Yan, ignored his teasing. A pair of gem-like eyes slowly swept over the Magical Beast as a faint purple light slowly hovered over her.</p><br/><p>As the purple light hovered, Zi Yan suddenly picked up the longsword on the ground before cutting ten white nails off the claws of the Magical Beast in front of Xiao Yan’s stunned gaze. She carefully placed them on a table.</p><br/><p>“What are you doing? You won’t really want these things, will you?” Xiao Yan helplessly complained after feeling stunned at what she did. He casually pulled over a half-a-finger-long nail and gently pressed it. The latter caved like soft mud. It had already lost all of its hardness.</p><br/><p>Zi Yan was somewhat excited in the face of Xiao Yan’s lack of interest. She urged, “You should help by taking out your ‘Heavenly Flame’ to burn these things.”</p><br/><p>Xiao Yan was immediately startled when he heard this. He was just about to inquire a little more when he saw Zi Yan’s extremely anxious manner. Without saying anything unnecessary, he flicked his finger and a wisp of a jade-green flame surfaced on his finger. After which, it wrapped around the pale-white nail of the claw.</p><br/><p>A scene that caused Xiao Yan to be shocked slowly appeared as the ‘Heavenly Flame’ danced. One could see the soft pale-white mud-like nail did not instantly turn into ashes under the grilling of the ‘Glazed Lotus Heart Flame’. Instead, it gradually shrank at an extremely slow pace. Following the shrinking of its size, the pale-white color gradually disappeared. A green-red color replaced it. The sharp edges of the nail revealed a cold glint amid the ‘Heavenly Flame’ that caused even Xiao Yan to feel a chill.</p><br/><p>“This…”</p><br/><p>The burning continued for around ten minutes or so before the pale-white nail transformed into a sharp knuckle-sized green-red thorn. The green and red mixed together appeared like the merger of wind and flame as it emitted a whizzing heat. Even Xiao Yan was stunned when he saw this mysterious scene. Who would have thought that this thing… would have turned into this after being cooked by the ‘Heavenly Flame’.</p><br/><p>Could this be the essence that was hidden under the body? In other words… was this mysterious Magical Beast corpse was not as useless as he had imagined?</p><br/>\n</div>"}