{"title": "Chapter 853: Green-Red Blood", "id": 853, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-853-green-red-blood", "volume_title": "Volume 9", "body": "<h1>Chapter 853: Green-Red Blood</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 853: Green-Red Blood</u></strong></p><br/><p>“You know what’s valuable in this dried corpse, right?”</p><br/><p>The heat in Xiao Yan’s eyes was slowly withdrawn as he suddenly stared at Zi Yan beside the table. He spoke in a somewhat fervent manner. If not because of this girl’s prodding, it was likely that he would never have found out that this claw would reveal such a mysterious scene after being grilled by the ‘Heavenly Flame’.</p><br/><p>Xiao Yan glanced at this green-red spike that was exceptionally sharp despite its small size. He grabbed it and gently pulled it across the surface of the table. Immediately, the hard table that was made from solid wood broke apart like beancurd. The point where it broke apart was as smooth as a mirror.</p><br/><p>“What a sharp bone spike…” The sharpness of this thing caused Xiao Yan to gently inhale a breath of cool air. Almost instantly, the gaze he used to look at Zi Yan became an ardent one. Since this girl knew the method to resolve the secret of this claw, it was likely that she was also aware of other things, right?</p><br/><p>Zi Yan merely lifted her exquisite chin in a proud manner in the face of Xiao Yan’s gaze. She said, “You should help this young miss refine these ten pieces and help me use them to create a knuckle glove. Hee hee, this will be my weapon in the future.”</p><br/><p>Xiao Yan was startled when he heard this. He immediately lowered his head to study this sharp bone spike in his hand. The moment he thought of being struck by this small thing, he involuntarily began to shiver. If this thing cooperated with Zi Yan’s frightening strength in delivering a punch, it was likely that even an expert Dou Huang would suffer a serious blow even if he did not die.</p><br/><p>In his anxiety to know about the secrets of this mysterious Magical Beast, Xiao Yan could not be bothered to find fault with this little fellow who got carried away. He carefully placed the bone spike in his hand down before picking up the remaining nine pale-white nails. A jade-green flame curled and rose as these nails were thrown in with a random toss.</p><br/><p>The nine pale-white nails once again revealed a similar change following the heat from the Glazed Lotus Heart Flame. The pale-white color slowly disappeared as an unusual green-red color replaced it. They also shrank in size.</p><br/><p>The grilling continued for around half an hour or so before the jade-green flame suspended in front of of him slowly disappeared. The nine green-red bone spikes within it also fell. Immediately, Xiao Yan waved his hand, and they were wrapped by a gentle wind as they landed gently on the remaining half of the table.</p><br/><p>The surprise expression in Xiao Yan’s eyes became much paler after these ten bone spikes were grilled. He exhaled and wiped off the cold sweat on his forehead.</p><br/><p>Zi Yan by his side happily grabbed the ten green-red bone spikes. After which, she carefully put them into her pouch before smiling at Xiao Yan.</p><br/><p>“How did you know that the claws would turn into this manner after being roasted by the ‘Heavenly Flame’?” Xiao Yan glanced at Zi Yan. He asked a question somewhat uncertainly. Thinking back to Zi Yan’s manner earlier, it was clear that she had already known that these things were useful to her. Otherwise, she would not have specifically dug out what seemed to be useless pale-white bone-like nails.</p><br/><p>“I am also not certain. In any case, I just had the feeling that those things would be useful to me, so I extracted them.” Zi Yan knit her delicate eyebrows, and replied with an uncertain tone in the face of Xiao Yan’s question.</p><br/><p>Xiao Yan was startled upon hearing this. His frown quickly deepened. Turning his head slightly, he shifted his gaze to the mysterious Magical Beast corpse that had been disemboweled. He muttered, “Don’t tell me that you are really related to this thing? Unfortunately, this thing has already been dead for far too long. One can no longer make out its shape. Otherwise, we might be able to guess something based on its appearance.”</p><br/><p>“In any case, it won’t be of the same species as me. Moreover, I feel a great discomfort for it. I even felt extremely cheerful when I saw it had been split apart by you.” Zi Yan curled her lips as she replied.</p><br/><p>“Cheerful? Don’t tell me that this Magical Beast’s original form is an enemy of your species?” Xiao Yan was stunned as he inquired.</p><br/><p>“I have no idea. I am not even aware of what kind of Magical Beast I am. Who cares what it is?” Zi Yan knit her brows and replied.</p><br/><p>“Forget it, let’s not bother about what it actually is. Girl, next, you should be telling me how to deal with this dried corpse, right?” Xiao Yan changed the topic and smiled. He spoke after seeing that Zi Yan was unwilling to talk about it.</p><br/><p>“Burn it. Burn the ugly flesh. There will naturally be something that you want.” Zi Yan waved her hand, and responded in a simple manner.</p><br/><p>Xiao Yan was startled when he heard this. He immediately ceased speaking any nonsense as he curled his hand. A suction force surged out and pulled a large piece of dense white flesh in front of him. He immediately opened his mouth and spat out a jade green flame. It spurted out of his mouth and wrapped around that cluster of flesh.</p><br/><p>Waves of frighteningly high temperatures spread out after coming into contact with the flesh. Finally, all of them entered that piece of flesh.</p><br/><p>The dense, white meat repeatedly emitted a ‘chi chi’ sound as the high temperature pervaded it. Its size also repeatedly shrank under the flame. This burning continued for around five minutes or so before the table-sized flesh turned to the size of a head. Its white color had also disappeared. A green-red gradually surged onto it.</p><br/><p>This kind of green-red color became increasingly denser as the flame burned with greater intensity. In the end, it completely agglomerated together. This agglomeration transformed into a drop of green-red blood in front of Xiao Yan’s joyous eyes. It seeped out of the flesh, passing through the flame to drip down.</p><br/><p>Xiao Yan’s eyes were sharp and his hands were nimble as he swiftly took out a high grade jade bottle from his Storage Ring. After which, he captured the drop of green-red blood in it.</p><br/><p>Xiao Yan sighed in relief only after obtaining that drop of blood. He raised his head and glanced at the burning jade-green flame. After this drop of green-red blood fell, the flesh disappeared into nothing within the flame. Not even a piece of ash remained behind.</p><br/><p>With a gentle flick of Xiao Yan’s finger, the jade-green flame in front of him slowly disappeared. He lowered his head to glance at the jade bottle in his hand. His nose gently sniffed at the mouth of the bottle. A rich wild and violent energy, that caused him feel shocked, followed his nostrils and entered his body. The shocked Xiao Yan hurriedly used his Dou Qi to suppress it. He continued to be busy for awhile before he resolve that wild, violent energy with a ‘Heavenly Flame’.</p><br/><p>After that wild and violent seed in the pure energy was dispersed by the refining power of the ‘Heavenly Flame’, that exquisitely powerful energy began to circulate. It quietly spread into Xiao Yan’s limbs and bones.</p><br/><p>The scattering of this energy caused caused Xiao Yan’s heart to be startled. He suddenly realized that the physical strength that was contained within the muscles in his skin seemed to have quietly increased a little. Although this increase was extremely minute, it was still clearly sensed by Xiao Yan.</p><br/><p>“This blood… actually possesses the special effect of strengthening one’s physical strength?’ Xiao Yan recovered, and threw his gaze at the jade bottle in his hand. A heat gradually surged into his eyes. Normally, a person’s physical strength could only rely on one’s talent and effort. It was unexpected that this mysterious green-red blood would possess such a mysterious effect.</p><br/><p>Xiao Yan inhaled a breath of cool air. His heart once again felt shocked by the mysterious Magical Beast corpse. He immediately laughed as he suddenly sucked with his hand. A large piece of meat was pulled over and the Glazed Lotus Heart Flame was summoned once again.</p><br/><p>After personally sensing this mysterious green-red blood’s beauty, Xiao Yan would naturally not think that this corpse was just a pile of completely useless rotten flesh. Over the next hour, he spent a great effort to burn that pile of pale-white flesh with the Glazed Lotus Core Flame.</p><br/><p>Xiao Yan had obtained more green-red blood through this burning. However, the only thing that caused him to feel slightly dissatisfied was that he had only managed to refine a mere five drops of green-red blood even after burning half a room of flesh.</p><br/><p>Xiao Yan studied the jade bottle with the five drops of green-red blood. They did not merge together despite being stored in the same place. He could only helplessly shake his head. With a wave of his hand, he made the Glazed Lotus Heart Flame in front of him disappear. He parted his mouth and smiled when he put the jade bottle into his Storage Ring. It was unexpected that this Magical Beast Corpse, which the Black Emperor Sect saw as worthless, would actually end up being turned into such a thing in his hands. From the way Xiao Yan saw it, the value of these five green-red drops of blood were definitely not worth any less than the jade-like bone wings. From a certain perspective, they might even be greater than the latter…</p><br/><p>This liquid blood contained an extremely wild and violent energy. From the way the interior of Xiao Yan’s body churned after he had inhaled a single breath earlier, one could not carelessly consume this thing. Otherwise, it would definitely cause one to end up with the miserable end of having one’s body burst apart. However, this was not considered a difficult point of view from Xiao Yan’s perspective. He was an alchemist and had experienced such wild and violent seeds in pure energy before. As long as he was given sufficient time, he would definitely be able to absorb all of the drops of blood. At that time, how high would the physical strength of his body soar?</p><br/><p>Therefore, Xiao Yan did not waste the five medicinal pills this time around. If that old fellow Mo Tian Xing knew that Xiao Yan had gained such a great benefit from this dried corpse, it was likely that he would be so furious that he would end up vomiting blood on the spot. This thing was something that their Black Emperor Sect had studied a countless number of times. However, they did not find anything unusual other than its jade-like bone wings were extraordinary…</p><br/><p>Yet, it was these things, that they thought had no value, that allowed Xiao Yan to gain a great bargain without reason.</p><br/><p>Xiao Yan slowly recovered from his excitement. His gaze once again swept over the remaining shriveled head and the enormous skin. He involuntarily licked his lips. Until this moment, the most precious thing, the Monster Core, had yet to appear.</p><br/><p>Normally speaking, a Monster Core that had agglomerated all of a Magical Beasts energy would not simply just disappear out of the blue. In other words, either the shriveled head or the skin that remained should hide the important Monster Core.</p><br/><p>Xiao Yan involuntarily swallowed a mouthful of saliva. He thought about how the Monster Core of a fierce beast, that had been about to breakthrough to the eighth rank, was about to land in his hand. His entire body felt hot.</p><br/>\n</div>"}