{"title": "Chapter 869: Leave", "id": 869, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-869-leave", "volume_title": "Volume 9", "body": "<h1>Chapter 869: Leave</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 869: Leave</u></strong></p><br/><p>Xiao Yan smiled after watching Mo Tian Xing slowly withdraw. However, the ‘Angry Buddha Lotus Flame’ in his hand did not show the slightest sign of scattering. Instead, under the stimulation of the Dou Qi within his body, it turned a darker green. Moreover, the Little Fairy Doctor had also taken the opportunity to appear beside Xiao Yan, protecting him. Her clear cold gaze was locked onto the withdrawing Mo Tian Xing. The words of these old foxes did not possess any thing to trust.</p><br/><p>However, Mo Tian Xing did not dare to play any tricks in front of Xiao Yan’s groups menacing gazes. He obediently withdrew some distance before sweeping his gaze around the sky. His expression involuntarily changed after failing to discover any traces of Mo Ya and Qi Shan. Immediately, his gaze hurriedly swept all around. His body moved a moment later, transforming into a ray of light as he rushed over to the spot where Mo Ya had landed earlier. Around two minutes later, Mo Tian Xing held a miserable human figure who possessed a weary breath. He slowly ascended into the air.</p><br/><p>“He he, this little girl really does not know how to hold back. However, I already had thoughts about teaching this fellow a lesson. Today, I shall consider this an early lesson…” Mo Tian Xing grabbed Mo Ya and only released the large stone in his heart when he learned that the latter was still alive. He laughed to Zi Yan. However, despite the smile on his face, a furious and sinister expression hid deep within his eyes. From the looks of it, he would have charged over and killed Zi Yan had he not been afraid of the Little Fairy Doctor and the ‘Angry Lotus Buddha Flame’ in Xiao Yan’s hand.</p><br/><p>Xiao Yan smiled, appearing to have not sensed the hidden enmity within Mo Tian Xing’s eyes. His mouth emitted a whistle and the experts from both ‘Xiao Gate’ and the Jia Nan Academy swiftly escaped from their entanglement, and swiftly rushed over to the location of the former.</p><br/><p>“Are you alright?” Xiao Li hurriedly asked when he appeared in front of Xiao Yan. That anxious manner of his seemed to be afraid that Xiao Yan had suffered some injuries.</p><br/><p>Xiao Yan smiled and shook his head. After seeing that everyone’s aura had become somewhat unstable due to them experiencing a big battle, he waved his hand and said, “The Black Emperor Sect will no longer intervene. Han Feng and the experts from the Demon Flame Valley present are nothing to be afraid of.”</p><br/><p>Xiao Li laughed. His gaze was filled with fear as he glanced at the fire lotus in Xiao Yan’s hand. It was emitting a frightening energy which caused his entire body to feel uneasy. He laughed, “You really do have some ability to frighten Mo Tian Xing off without even attacking.”</p><br/><p>Xiao Yan smiled and said, “That old fellow is afraid that I will use the ‘Angry Buddha Lotus Flame’ to disturb him and allow the Little Fairy Doctor to use the opportunity to attack. Otherwise, just this ‘Angry Buddha Lotus Flame’ alone would not be enough to frighten off this old fox.”</p><br/><p>“Have you gotten ahold of the thing?” Xiao Li vaguely nodded before immediately using a voice that could only be heard by the two of them to inquire.</p><br/><p>Xiao Yan laughed softly before lowering his chin in front of Xiao Li’s surprised eyes.</p><br/><p>“Sect leader Mo, you should not be tricked by this little fellow. Your actions today have already offended him. Even if he does not find trouble with you today, he will definitely come and look for you in the future. How will you deal with them alone?” Han Feng’s cold cry suddenly resounded over the sky while Xiao Yan and Xiao Li were conversing. Finally, it was transmitted into Mo Tian Xing’s ears.</p><br/><p>Mo Tian Xing knit his brows when he heard Han Feng’s words. Immediately, he spoke in a calm manner, “This is a matter of my sect and you need not be bothered with it. Although your promise to me is attractive, it is on the precondition that I have the life to enjoy it. Therefore, you should fend for yourself.”</p><br/><p>Given Mo Tian Xing’s shrewdness, he was naturally aware that his strength could only be equal to that of the Little Fairy Doctor. If Xiao Yan, who posessed a shocking strength, was included, he would definitely be defeated. Moreover, the fate of being defeated might mean losing this old life of his. Mo Tian Xing did not need to ponder on whether to choose between his life and temptation.</p><br/><p>Mo Tian Xing’s words caused Han Feng’s face to twitch. After cursing ‘old bastard’ in his heart, he withdrew his body from Su Qian’s suppression.</p><br/><p>Han Feng’s heart clearly understood that if Mo Tian Xing really washed his hands off, he would have no other choice but to flee for his life. After all, he alone could not contend with two elite Dou Zongs. Moreover, there was Xiao Yan who was prepared to throw the frightening fire lotus Dou Skill at any moment…</p><br/><p>If he were to continue being entangled in such a situation, he could only be described as seeking death. Han Feng, who had similarly muddled within the ‘Black-Corner Region’ for many years, also understood that nothing was more important than this life of his.</p><br/><p>“Xiao Yan, don’t think that you will be alright by holding onto the Bodhisattva Body Transformation Saliva. I will not give up. Today, you have killed three Elders from the Demon Flame Valley. The Old Ground Demon Ghost (Nickname) will not let you off. At that time, you will definitely have difficulty escaping death even if you have the Jia Nan Academy’s backing!” Han Feng withdrew his body and swiftly created a safe distance between Su Qian’s and Xiao Yan’s group. His gaze swept around him before a ferocious smile flashed across his eyes as he let out a sharp cry.</p><br/><p>Han Feng did not hide this cry of his. Hence, his words immediately fell into the many ears the surrounding mountain range. Private conversations erupted in an instant.</p><br/><p>“The Bodhisattva Body Transformation Saliva is in Xiao Yan’s hands?”</p><br/><p>“Xiao Yan? Is that the chief of ‘Xiao Gate’?”</p><br/><p>“Hee hee, the Bodhisattva Body Transformation Saliva is really a good thing. If one wants to leave with it safely, one must have some ability…”</p><br/><p>Xiao Yan knit his brows when he heard the private conversations around the mountains. He sensed the greedy gazes that were shot over from all directions. He immediately glanced at Han Feng in an icy-cold manner. The latter had clearly released this information on purpose. His aim was to turn Xiao Yan’s group into everyone’s enemy.</p><br/><p>“Xiao Yan, leave quickly. This news will likely cause many people to have envious eyes. Only by returning to the Jia Nan Academy can be considered safe.” Su Qian’s figure swiftly appeared beside Xiao Yan as he spoke with a solemn expression.</p><br/><p>“Who is the Old Ground Demon Ghost?” Xiao Yan asked somewhat uncertainly.</p><br/><p>“The founder of the Demon Flame Valley. Moreover, he could also be considered a genuine old person within the ‘Black-Corner Region’. He is of an even earlier generation than Mo Tian Xing. Come to think about it, he could even be said to be an expert of the headmaster’s generation. Of course, this Old Ground Demon Ghost’s strength is naturally far inferior to the headmaster’s power. However, according to what I know, the current him should possess the strength of a five or six star Dou Zong.” Su Qian’s expression changed slightly when this name was mentioned. He hesitated a little before explaining him in a deep voice.</p><br/><p>“A five or six star Dou Zong huh…” Xiao Yan’s expression also changed when he heard this. It was likely that an ‘Angry Buddha Lotus Flame’ formed from the merger of two kinds of ‘Heavenly Flames’ would have difficulty injuring an expert of that level.</p><br/><p>“It is unexpected that the Demon Flame Valley would actually possess such an expert…” Xiao Yan frowned and softly sighed.</p><br/><p>“You also need not be too worried. This Old Ground Demon Ghost frequently undertakes retreats. Moreover, he will undertake retreats from decade to decade. He will seldom appear if it is not a matter that involves the survival of the Demon Flame Valley… moreover, even if he does appear, that old fellow might not dare to do anything to my Jia Nan Academy. That old ghost is extremely afraid of the headmaster.” Su Qian smiled and comforted when he saw Xiao Yan’s worry.</p><br/><p>“That headmaster that has not been seen is even less reliable than that Old Ground Demon Ghost. During my many years in the Jia Nan Academy, I am still unaware of his appearance…” Xiao Yan involuntarily laughed when he heard this.</p><br/><p>“*Cough*... this, the headmaster is indeed extremely mysterious. That old fellow loves to travel all over the place. That… honestly speaking, even I have not seen him for over a decade.” Su Qian dryly coughed. He wanted to explain a little but he involuntarily grumbled in the end.</p><br/><p>Xiao Yan’s sleeves wiped off the cold sweat on his forehead as he helplessly shook his head. His gaze became slightly dense as it swept over Han Feng in the sky. After which, he nodded slightly and said, “Forget it. I don’t care. Let’s return to the Jia Nan Academy.”</p><br/><p>Although Xiao Yan’s heart really wanted to get the Little Fairy Doctor and First Elder Su Qian to kill Han Feng, such a situation was unsuitable. After all, the Little Fairy Doctor and First Elder Su Qian would have to exhaust themselves if they wanted to kill Han Feng. Once Xiao Yan lost the great fighting strength of these two, it was likely that even he would not have the confidence to successfully bring the Bodhisattva Body Transformation Saliva back to the Jia Nan Academy.”</p><br/><p>Su Qian also sighed in relief when he saw that Xiao Yan did not intend to attack Han Feng. He had exchanged blows with Han Feng earlier, and clearly understood just how troublesome and cunning the latter was. At that time, they would suffer some injuries even if they killed him. In this situation where everyone was watching them with ill intent, any losses they suffered would definitely ignite the greed in some people’s hearts. When it came to that, there would really be an endless amount of trouble.</p><br/><p>“Let’s go…”</p><br/><p>Xiao Yan gently waved his hand and the experts from ‘Xiao Gate’ and the Jia Nan Academy clustered together. They cautiously studied their surroundings before the group rushed in the direction of the Jia Nan Academy under Xiao Yan’s command in front of everyone’s eyes.</p><br/><p>Since they were afraid of someone launching a sneak attack, Xiao Yan did not scatter the ‘Angry Buddha Lotus Flame’ in his hand. Instead, he placed it above his head, causing it to appear like a lamp. That hot light suppressed the greed in the hearts of quite a number of people.</p><br/><p>The departure of Xiao Yan’s group stirred up quite a big commotion. Many people’s gazes lingered between greed and fear. Finally, quite a number of people were unable to endure the greed in their hearts, so they quietly followed from a distance…</p><br/><p>Han Feng stood in the sky. His gaze was dark and cold as he stared at the backs of Xiao Yan’s group, which were starting to disappear. A moment later, he coldly laughed and a suction force surged. Immediately, three corpse, who had lost their lives earlier, flew up before remaining suspended in front of him.</p><br/><p>Han Feng’s gaze swept over the corpse of Fang Yan and the two Elders, which were turning cold. The denseness in his eyes grew even more intense. His mouth parted to form a smile, revealing white teeth. He muttered to himself, “My good junior, hopefully, you will be able to successfully bring the Bodhisattva Body Transformation Saliva back to the Jia Nan Academy. At that time, I will have a way to invite the Old Ground Demon Ghost out. After which… it will be time for your ‘Xiao Gate’ to be destroyed!”</p><br/><p>“Therefore, don’t disappoint this senior!”</p><br/><p>A ferocity that chilled one’s heart suddenly surged onto Han Feng’s face when he finished speaking his words.</p><br/>\n</div>"}