{"title": "Chapter 879: Refine", "id": 879, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-879-refine", "volume_title": "Volume 9", "body": "<h1>Chapter 879: Refine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 879: Refine</u></strong></p><br/><p>Xin Lan finally placed down the large rock that was pressing on her heart after seeing Xiao Yan nod his head. A smile that originated from her heart surfaced on her face. She endured the excitement in her heart as she laughed, “In that case, I hope that we will have a joyful cooperation.”</p><br/><p>Xiao Yan smiled. Honestly speaking, the excitement in his heart was not much weaker than Xin Lan’s feelings. He had finally found a clue about another ‘Heavenly Flame’ after such a long time. Although there was still a great gap to reach the ‘Three Thousand Burning Flame,’ at the very least, the current Xiao Yan had a target. He need not randomly look all over the place like he did in the past.</p><br/><p>“When will we leave? There is quite a long distance from the Jia Nan Academy to the Central Plains…” Xin Lan raised her pair of large transparent eyes and inquired somewhat anxiously.</p><br/><p>“Allow me to settle the issue of the Burning Sky Qi Refining Tower in the Inner Academy first…” Xiao Yan smiled as he replied. Although he was extremely anxious in his heart to head to the Central Plains, it was likely that he would be killed by First Elder Su Qian with a slap here if he were to just run away now.</p><br/><p>“What is there to be anxious about. Even though you managed to get Xiao Yan’s help, it is likely that he will not be able to allow your clan to enter the Elder’s seat with his current alchemy skills. Although a tier 6 alchemist is rarely seen in this place, it is not considered a top expert within the Pill Tower. You should be extremely clear about this.” Su Qian by the side rolled his eyes and reminded snappily.</p><br/><p>“Hee hee, Xin Lan naturally knows this. However, big brother Xiao Yan has already become a tier 6 alchemist at such an age. Such talent is rarely seen even in the Pill Tower. Hence, Xin Lan has confidence in him.” Xin Lan saucily smiled as she spoke, aware that Su Qian was a little unhappy about her pulling Xiao Yan away.</p><br/><p>Su Qian rolled his eyes at Xin Lan. His gaze immediately turned to Xiao Yan. After sighing, he said, “I know that you have quite a lot of things on your back. Therefore, you need to anxiously increase your strength. Honestly speaking, the Central Plains is indeed a good place to hone yourself. That place is where the truly top experts and factions gather. If you are able to create a name for yourself there, it will definitely benefit you. However, you should also be careful. That place is no longer a place like the ‘Black-Corner Region.’ You should be more cautious when you act. As for the ‘Pill Gathering,’ it is the most important gathering in the alchemist world. Although your current alchemy skill is considered outstanding, attempting to aim for the top ten is not an easy matter…</p><br/><p>Xiao Yan’s heart felt warm after hearing Su Qian’s reminder. He quietly nodded. For it to be a holy ground in the hearts of all the alchemists on the continent, Xiao Yan naturally understood that the alchemists gathered there definitely possessed some skill. No one would be ordinary.</p><br/><p>“Alright, it is already quite late today. You should go and rest first. I have already helped arrange a place for you to stay. You can come and discuss the matter of replenishing the Heart Flame in the Blazing Sky Qi Refining Tower tomorrow.” Su Qian waved his hand and smiled as he spoke.</p><br/><p>Xiao Yan and Xin Lan nodded when they heard this. They bowed and said thanks to Su Qian before slowly withdrawing from the Meeting Room.</p><br/><p>Su Qian finally let out a soft sigh after seeing the two people exit from the door. He muttered, “The Central Plains. I have not been there for many years. I really miss it. However, it is likely that the place now belongs to the young people…”</p><br/><p>The sky had already become completely dark after they exited the Meeting Room. Stars were flickering in the sky as faint moonlight scattered down, causing one’s skin to feel a slight coldness.</p><br/><p>Xiao Yan and Xin Lan chatted a little after they exited the door before they finally parted. After which, Xiao Yan did as Su Qian had instructed and returned to the room that had been prepared for him.</p><br/><p>Xiao Yan violently fell on the soft bed after returning to his room. After being entangled with those fellows from the ‘Black-Corner Region’ for such a long time, he was also quite exhausted. Despite his mental tiredness, an excited glint that was difficult to hide still leaped in his eyes. The information he had obtained about the ‘Three Thousand Burning Flames’ was undoubtedly joyous news to him.</p><br/><p>“Pill Tower…” Xiao Yan muttered in his mouth. His heart felt some anticipation. He also possessed great curiosity for this faction that was regarded by many alchemists as holy ground. If he were able to make a name for himself there, teacher might feel somewhat pleased…</p><br/><p>Xiao Yan suddenly recalled Su Qian’s earlier reminder as this thought flashed through his heart. His expression immediately became slightly solemn. Being the Central Plains that was in the middle of the Dou Qi continent, the level of the experts there would definitely far exceed that of the Jia Ma Empire or even the ‘Black-Corner Region.’ With his current strength, he would not dare to say that he was fearless to act as he pleased even within the ‘Black-Corner Region,’ much less the Central Plains where the top experts from the continent gathered…</p><br/><p>“Looks like I will need a more defensive tactic… otherwise, it is likely that I won’t even be able to flee should I really meet with some trouble…” Xiao Yan licked his tongue and shook his head. The tiredness was tossed out of his head as he did so. After which, he sat cross-legged on the bed and flicked his finger. A glow appeared from the ring on his finger. Immediately, a pair of ten-foot-long bone wings appeared in front of him.</p><br/><p>The bone wings somewhat transparent jade color was crystal clear and extremely pleasing to the eye. Some substances that possessed a spirit were flowing within the bones, causing it to appear to be filled with an unusual lifeforce.</p><br/><p>These jade bone wings were naturally the wings of the mysterious Magical Beast that Xiao Yan bought for a high price from the auction of the Black Emperor Sect. They would be an excellent ingredient to create a pair of Sky Bird Nine Flying Wings with. If he succeeded, Xiao Yan would have an additional method to protect his life in the future. Although Xiao Yan had never experienced it personally, he could vaguely guess that it would be difficult to find someone who could match his speed, even among the elite Dou Zong, should he use the Sky Bird Nine Flying Wings, made from the jade bone wings. Thus, he would obtain a way to keep his little life…</p><br/><p>Xiao Yan had been adopting a fearful attitude toward the Central Plains. Currently, he was unaware of when he would step into that place since he still needed to complete his preparations to prevent himself from being unable to react in time should something sudden happen.</p><br/><p>Xiao Yan’s heated gaze slowly withdrew from the jade bone wings that were suspended in front of him. He waved his hand and a shiny golden scroll appeared in it. It was the scroll detailing the refinement of the Sky Bird Nine Flying Wings.</p><br/><p>After opening it gently with his hands, Xiao Yan’s attention was gradually focused on it. He began to study the refinement method…</p><br/><p>Xiao Yan finally read the scroll in detail without missing a single word after spending nearly an hour. Only then did he frown slightly as he slowly withdrew the scroll. Finally, he fell silent.</p><br/><p>The Sky Bird Nine Flying Wings was indeed a rare kind of flying Dou Technique. Moreover, it mainly relied on the quality of the materials used to create it in order to raise its speed. This was similar to another kind of evolution method. However, this scroll did indeed have its own unique point, but there was quite a large requirement in the way if one wanted to refine this Sky Bird Nine Flying Wings. Other than the most important Magical Beast wings ingredient, one would need quite a number of other various ingredients. However, this was not considered too difficult. Xiao Yan had a rich store. Thus, he possessed most of the ingredients needed.</p><br/><p>However, the thing that was currently causing Xiao Yan the greatest headache was the prerequisite for refining the Sky Bird Nine Flying Wings. It required him to remove the remaining Magical beast aura within the Magical Beast wings that he had prepared. Everyone knew that the wings of a Magical Beast possessed some remaining aura of its actual self. If one wanted to create a flying Dou Skill, one must first remove the remaining aura within the wings… this point caused Xiao Yan to feel extremely troubled. It was fine if the wings that he had prepared had merely been an ordinary Magical Beast. However, the owner of these jade bone wings was clearly not some ordinary Magical Beast. Xiao Yan was extremely clear about this in his heart. This was because he had made contact with the remaining aura within the jade bone wings the night he had dissected this Magical Beast.</p><br/><p>Although the contact ended extremely fast, Xiao Yan could still sense the wild, fierce, violence that remained in the aura. Clearly, it was not an easy task to remove such a fierce aura. Thus, this was an exchange which involved great risk. If one were not careful, one would be eroded by the remaining aura. Perhaps, it might leave behind a fierce seed within one’s heart, resulting in a drastic change in one’s character…</p><br/><p>Xiao Yan stared intently at the jade bone wings suspended in front of him. His expression was somewhat volatile as he struggled a little in his heart. He felt quite afraid of the mysterious Magical Beast. Despite having been dead for so many years, it was still able to leave behind such a powerful aura. He really did not know just how frightening it was when it was at its peak.</p><br/><p>The jade bone wings suspended in front of Xiao Yan emitted a faint light after seemingly having sensed Xiao Yan’s struggle. It’s appearance appeared to be mocking him…</p><br/><p>Silence continued for a while within the room. A long time later, Xiao Yan tightly clenched his fist. He inhaled a deep breath. The hesitation and struggle within his dark-black eyes swiftly dissipated. If one wanted to obtain something, it was only natural that one would have to pay with something. There are no free lunches in this world—Xiao Yan clearly understood this point in his heart.</p><br/><p>“If I am unable to even deal with the remnant aura of a Magical Beast that died an unknown number of years, how will I fight against the mysterious and unpredictable ‘Hall of Souls’ in the future? How will I negotiate with that frightening faction behind Xun Er?”</p><br/><p>Xiao Yan’s eyes swiftly became determined as these words flashed through his heart. The current him had finally become determined. He would fight the remnant aura within the jade bone wings!</p><br/>\n</div>"}