{"title": "Chapter 883: Arrival", "id": 883, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-883-arrival", "volume_title": "Volume 9", "body": "<h1>Chapter 883: Arrival</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 883: Arrival</u></strong></p><br/><p>The originally relaxed atmosphere of the hall immediately became tense because of that one sentence from Xiao Li. Everyone seated here was very familiar with the ‘Black-Corner Region.’ They were clearly aware of just what kind of troublesome person this Old Ground Demon Ghost was.</p><br/><p>“I have really underestimated that fellow Han Feng. If I had known earlier, I should have gotten him to stay…” A dark solemness flashed across Xiao Yan’s eyes as he slowly spoke.</p><br/><p>“Even if Han Feng did not go and inform him about this matter, it is likely that it would sooner or later be passed into the Old Ground Demon Ghost’s ears. This old fellow is usually extremely protective of his own. Now that the three great Elders of the Demon Flame Valley have fallen by your hand, he would naturally be extremely angry upon hearing the news.” Su Qian shook his head. His expression was somewhat solemn. Clearly, that so-called Old Ground Demon Ghost increased the pressure on him.</p><br/><p>“First Elder, what do we do now? Given the Old Ground Demon Ghost’s character of avenging any grudge, he will likely turn his anger on the Jia Nan Academy. At that time, there will likely be great trouble.” An Inner Academy Elder spoke with a solemn expression.</p><br/><p>“The Demon Flame Valley and our Jia Nan Academy already have great hatred for each other that built up during these few years. The Old Ground Demon Ghost is the founder of the Demon Flame Valley and should be aware of the conflict between both parties. However, he has never shown himself to resolve it. Instead, he has the intention to condon this. Moreover, the death of Fang Yan and the two others compounded this case. Perhaps, that Old Ground Demon Ghost will really launch a campaign…” Another Elder analyzed the situation with a similar solemn expression.</p><br/><p>Su Qian nodded his head. A cold smile surfaced on his face as he said, “This old fellow who will not die. Does he really think that he can underestimate our Jia Nan Academy just because the headmaster is absent? If he really wants to do something, our Jia Nan Academy will accompany him. I really don’t believe that he would dare smash our Jia Nan Academy.”</p><br/><p>“Hmph, when the headmaster was present in the past, that old fellow led the Demon Flame Valley like a tortoise and did not dare to offend our Jia Nan Academy. Yet, they have taken this kind of opportunity to act mighty. What a despicable fellow.” An Elder coldly snorted with great disdain.</p><br/><p>“From now on, the Jia Nan Academy will enter an alert state. Xiao Li, you should dispatch more spies to watch the Demon Flame Valley. Report any movements they make immediately. Since the Old Ground Demon Ghost is unwilling to leave things be, the old me shall tell him that even if the headmaster is absent, this Jia Nan Academy will not allow him to act as he please!” Su Qian cried out in a deep voice.</p><br/><p>Xiao Li nodded slightly. Xiao Gate and the Jia Nan Academy were basically on the same boat. Any trouble that befell the Jia Nan Academy would not benefit Xiao Gate at all. Moreover, the source of this matter was undoubtedly related to their Xiao Gate. The Old Ground Demon Ghost would definitely not let them off.</p><br/><p>Su Qian’s gaze glided over to Xiao Yan and the Little Fairy Doctor. He said, “The both of you should try your best to remain within the Inner Academy during these few days. We will be able to take care of the situation should any sudden problem occur.”</p><br/><p>Xiao Yan nodded his head. This matter had started because of him. It was impossible for him to shirk his duty. The Little Fairy Doctor by Xiao Yan’s side heeded his lead. Even if the opponent was an old expert within the ‘Black-Corner Region’ she would not be disadvantaged in the slightest if she were to really go all out to fight. The ‘Woeful Poison Body’ was born and groomed by nature and had never been afraid of anything…</p><br/><p>“Next, we will wait for the activity of the Old Ground Demon Ghost. That old fellow is really becoming more and more arrogant. He still does not have the qualification to destroy our Jia Nan Academy!” Su Qian slowly let out a cold laugh. Some fury leaped within his eyes. During these few years, quite a number of students had perished to the hands of the Demon Flame Valley. He had long been filled with anger because of this. Now, the Demon Flame Valley still dared to launch a campaign and find trouble at their core. Did they really think that he, Su Qian, was molded from mud?</p><br/><p>The hall was somewhat quiet as everyone studied the gloomy and cold expression of Su Qian. Xiao Yan and Xiao Li exchanged a glance. Their brows were filled with a solemness. It seemed that this time around, they were really going to face a difficult battle. After all, that Old Ground Demon Ghost was at the very least a six or seven star elite Dou Zong. Honestly speaking, such a strength could really be considered the strongest person that Xiao Yan had met in all these years…</p><br/><p>After the discussion that day ended, the defense of the Inner Academy was greatly increased. Moreover, they also placed restrictions on the comings and goings of the students. With such large activity, many students within the Inner Academy sensed an atmosphere that was not quite right. They had the intention to ask, but when they saw the tensed expressions of the Elders, they quickly swallowed the words in their mouths. Anyone could tell that the mood of the Elders in the Inner Academy was currently quite bad. If they were to go ask now, it was likely that they would suffer a little.</p><br/><p>Of course, the increase in the defenses also included the Jia Nan Academy’s Outer Academy and the surrounding region around the academy. The Law Enforcement Unit of the academy was out in force and had laid a thorough defensive line in the surrounding region. Any person from the ‘Black-Corner Region’ who randomly budged in would be given a vicious punishment.</p><br/><p>In the face of this great activity of the Jia Nan Academy, the many factions within the ‘Black-Corner Region’ had also been alerted. Some people who were well-informed seemed to have understood something after connecting the matter of the big fight over the Bodhisattva Body Transformation Saliva that had happened in the ‘Black-Corner Region’ some time ago and the recent activity of the Demon Flame Valley. They immediately became somewhat shocked. That old demon that had not appeared in the ‘Black-Corner Region’ for so many years was finally planning to attack the Jia Nan Academy?</p><br/><p>The Demon Flame Valley and the Jia Nan Academy were two old factions with long tradition in the ‘Black-Corner Region.’ Should these two factions engage in an all out fight, their battle would be little different than a great explosion for the ‘Black-Corner Region.’ Hence, the entire ‘Black-Corner Region’ was spreading information about this within a short period of time. They faintly felt the feeling of pressure that came before a storm…</p><br/><p>Everyone wanted to know just which of these two old factions, with similarly long traditions, would emerge victorious in a head on collision.</p><br/><p>Of course, some of the well-informed people within the ‘Black-Corner Region’ naturally knew that the Jia Nan Academy’s headmaster was a Dou Zun class ultimate expert. If this heavyweight person were present at the Jia Nan Academy, it was likely that the Demon Flame Valley would not dare to launch a campaign even if they were given more courage. Unfortunately, however, that mysterious headmaster of the Jia Nan Academy had disappeared for quite a number of years. Who knew whether the current him was dead or alive?</p><br/><p>Having lost this kind of heavyweight ultimate expert guarding it, would the Jia Nan Academy be able to endure the might of the founder of the Demon Flame Valley, the Old Ground Demon Ghost?</p><br/><p>While the outside world had turned into an uproar because of the activity of the Jia Nan Academy, Xiao Yan and the others peacefully remained within the Inner Academy. They might know that the Old Ground Demon Ghost was an extremely troublesome existence, but they would use the right method to deal with the issue when the time arrived. After the initial worry, Xiao Yan had become much more relaxed. Even though the Old Ground Demon Ghost’s strength was really unmatched by anyone in the Jia Nan Academy, it would likely not be an easy matter if he really wanted to flatten the Jia Nan Academy.</p><br/><p>A six or seven star Dou Zong might be frightening, but it was not as though Xiao Yan was without the ability to resist. If he became really infuriated, he would go all out to merge the three types of ‘Heavenly Flame’ and get that Old Ground Demon Ghost to suffer a great loss…</p><br/><p>By adopting such an attitude, Xiao Yan did not display much worry or concern during these few days. He would occasionally make a trip to ‘Pan’s Gate,’ and would refine medicinal pills in front of the many alchemists in ‘Pan’s Gate’ to give them some pointers. As he obtained the cheers from the alchemists, his mysterious and untouchable position in the hearts of many members of ‘Pan’s Gate’ became one that was much closer.</p><br/><p>During his occasional free time, he would stay for awhile in the Inner Academy’s medicinal ingredient stores or the training room. Under this calm heart of Xiao Yan, the effect of his training was quite impressive. During a couple of trainings, he faintly felt a premonition of being about to advance. It seemed that if he were given an opportunity, it would be an extremely smooth matter to breakthrough to a five star Dou Huang.</p><br/><p>The matter of replenishing the Heart Flame of the Blazing Sky Qi Refining Tower was delayed for a period of time. Currently, their great enemy was right in front of them. Maintaining his peak condition was of utmost importance. If he were to act right now, he would definitely suffer a loss. This would not be considered a good thing in the face of the big battle that was imminent…</p><br/><p>Numerous heads were moving in the spacious open ground. A couple of supple figures were flashing like agile monkeys as powerful Dou Qi collided. Each time this occurred, it would bring about numerous roars and cheers from the crowd.</p><br/><p>Xiao Yan was sitting on a high seat with the Little Fairy Doctor and Zi Yan seated beside him. The competition below was not held by the Inner Academy. Instead, it was something that had been initiated by the students. Due to Xiao Yan having shown himself quite frequently within the Inner Academy, he was invited to observe and judge the matches. Xiao Yan did not discriminate against this request. Instead, he possessed a little interest. He had fought quite a number of arena battle with others, but it would be the first time he was seated in a judge’s seat. Hence, he did not reject the extremely sincere invitation of these students.</p><br/><p>Xiao Yan held a teacup in his hand and leaned against the chair. He smiled as he watched the intense battle in the arena. A moment later, he slowly stood up after a student was victorious. However, before he could announce the victor, his expression suddenly changed. He immediately raised his head and he stared intently in an easterly direction. A large group of extremely powerful auras had suddenly appeared there. Moreover, there was a frightening aura present that caused one’s heart to feel a little afraid…</p><br/><p>“They have arrived…”</p><br/><p>A solemn expression also surfaced on the Little Fairy Doctor’s face by the side as she slowly spoke.</p><br/><p>The action of Xiao Yan and the others caused quite a number of people below to feel stunned. While they were at a loss, an old voice that appeared to penetrate space resounded over the sky in a thunder-like manner.</p><br/><p>“Little fellows of the Jia Nan Academy, have all of you actually failed to receive this ancestor who has come to visit? Is this what Mang Tian Chi teaches you?”</p><br/><p>Xiao Yan’s eyes slowly narrowed when he heard the thunder-like cry that shook one until one felt giddy and dazed. The fists under his sleeves suddenly tightened.</p><br/><p>“Have they… finally arrived?”</p><br/>\n</div>"}