{"title": "Chapter 889: Extermination Fire Lotus", "id": 889, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-889-extermination-fire-lotus", "volume_title": "Volume 9", "body": "<h1>Chapter 889: Extermination Fire Lotus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 889: Extermination Fire Lotus</u></strong></p><br/><p>“Bang!”</p><br/><p>Two vague black figure collided with a bang in the sky. When a soul-stirring energy ripple was emitted, two human figures appeared shaken until they hurriedly took a couple of steps back. Both parties emitted a groan…</p><br/><p>When the two vague black figures stabilizing their bodies, one could finally identify that they were Su Qian and Han Feng, who had erupted into an intense big battle earlier. At this moment, the clothes of the both of them were tattered after having engaged in a bloody fight. Their hair was scattered all over, causing them to appear extremely miserable. However, if one were to carefully observe them, one would discover that Su Qian’s aura was a little weaker. Clearly, he had fell into a little disadvantage during this intense battle with Han Feng…</p><br/><p>Su Qian carelessly wiped off the blood trace from the corner of his mouth. His gaze stared intently at Han Feng on the opposite side. A surging Dou Qi lingered around him, carrying waves of whistling wind sound. His clothes moved without the presence of any wind, emitting a fluttering sound.</p><br/><p>“Hee hee, First Elder Su Qian. It seems that you are really old…” Han Feng’s slowly calmed the Dou Qi within his body that was in an upheaval. After which, he slowly raised his head and mocked Su Qian.</p><br/><p>“You are nowhere better. After having gifted your own ‘Heavenly Flame’ to turn yourself into this manner that is neither human nor ghost, it seems that it was not a worthwhile choice…” Although Su Qian had fallen into a disadvantage, he was extremely experienced with age. His tone still appeared very calm.</p><br/><p>Han Feng’s face twitched. The smile on his face was maintained but a dense, cold killing intent surged out of his eyes like floodwater.</p><br/><p>“I wonder if you will still have the face to teach in front of all these students from the Inner Academy if I were to defeat you in front of all of them?” Han Feng smiled in a cold manner. His sleeves shook and a powerful, hot Dou Qi immediately surged from his body in all directions. Finally, it swept horizontally across the sky and suppressed Su Qian’s aura.</p><br/><p>Su Qian frowned slightly under the pressure of the aura. He waved his hand and held back the Inner Academy’s Elders not far away who were ready to intervene. After which, he inhaled a deep breath and the Dou Qi within his body completely surged out like a mountain stream…</p><br/><p>“Hee hee, Old fellow Su Qian. Ever since I advanced to the Dou Zong class, I have yet to kill an elite Dou Zong before. Today, you shall be my first!” Han Feng laughed ferociously. His body slowly rose. However, it had just risen by over ten meters when the surrounding natural energy around him suddenly began to revolt…</p><br/><p>The sudden change caused Han Feng to be shocked. He hurriedly lowered himself and was just about to investigate with his eyes when a vast and mighty energy that was filled with destruction quietly surfaced in the sky…</p><br/><p>Upon sensing this destructive energy, the expressions of everyone present immediately turned pale-white. Even an expert Dou Zong would sense a horror that seeped from a place deep within his soul in the face of such energy.</p><br/><p>Han Feng’s and Su Qian’s bodies violently trembled at this moment. After which, they abruptly lifted their heads. Their frightened eyes shot followed the direction where the destructive strength originated from. However, their faces immediately became dull when they discovered the creator of the energy.</p><br/><p>A black-robed, young man was flapping his eye-catching gem-like bone wings in the distant sky. Waves of muffled thunder repeatedly sounded in the sky. Of course, the thing that caused Han Feng and Su Qian to become dull was not the bone wings. Instead, it was the washbasin size fire lotus that was suspended in front of Xiao Yan at the moment…</p><br/><p>The fire lotus was colorful and beautiful. Its color denseness was far greater than anything prior to it. Hence, it appeared exceptionally beautiful. However, it was this demon-like beauty that caused Han Feng and Su Qian to feel a heartfelt fear. This was because they clearly sensed just what kind of frightening energy was contained within the colorful fire lotus. In the face of this kind of strength, even an elite Dou Zong would feel fear.</p><br/><p>“This fire lotus… why is it that its strength is so great?” Su Qian swallowed a mouthful of saliva with all his might. He was aware that Xiao Yan possessed a fire lotus Dou Skill with quite an extraordinary strength. Moreover, he had even personally witnessed it. However, there was an extremely vast difference with the current fire lotus was compared to the one back then.</p><br/><p>On the opposite side of Su Qian, the dullness on Han Feng’s face had also gradually been withdrawn. His expression was repeatedly changing as he stared at Xiao Yan. The fists in his sleeve had also slowly tightened. Just when the killing intent within his heart surged, Xiao Yan, who was controlling the colorful fire lotus in the sky, threw an indifferent gaze over after having sensed something in his heart…</p><br/><p>Han Feng felt a shock run through his body under this indifferent gaze. It was as though a basin of cold water was poured down from the sky, causing his entire body to become still. A thread of fear faintly trickled out of his heart. If Xiao Yan were to throw the colorful fire lotus in over at this moment… Han Feng knew that he would definitely not have the slightest chance of survival today…</p><br/><p>The killing intent in Han Feng’s eyes swiftly disappeared. An extremely forceful and ugly smile was lifted on Han Feng’s face. After which, his head shivered and he quickly turned his gaze away. Although he knew that this colorful fire lotus of Xiao Yan was most likely going to be thrown at the Old Ground Demon Ghost, he also knew just how great a hatred Xiao Yan possessed for him. If Xiao Yan’s thinking was a little chaotic, Han Feng would really end up being extremely unlucky.</p><br/><p>A smile full of ridicule surfaced on Xiao Yan’s pale face as he looked at Han Feng, who had shivered and shifted his gaze away. After which, Xiao Yan withdrew his attention. His gaze was brought back to the colorful fire lotus in front of him. Although the ‘Life Transforming Flame’ was not a genuine ‘Heavenly Flame,’ its strength was extremely extraordinary. Moreover, the merger of flames created a kind of extremely frightening, wild, violent energy from the various changes during the merger. This kind of creation only required some catalyst. This ‘Life Transforming Flame’ was the best replacement at this moment.</p><br/><p>Merging the ‘Life Transformation Flame’ into the ‘Angry Buddha Lotus Flame’ naturally possessed an extremely great risk. During the short merger time earlier, Xiao Yan had basically underwent a couple of life and death moments. Each time, he had narrowly brushed past death. However, it was fortunate that he had a Spiritual Strength that far surpassed alchemists of the same tier. Moreover, he had reached the pinnacle with regards to the kind of equilibrium required within the fire lotus. Hence, he was able to head off a disaster each time and successfully merge the ‘Life Transforming Flame’ into the ‘Angry Buddha Lotus Flame,’ forming the strongest and most terrifying ‘Angry Buddha Lotus Flame’ that he had ever created… Xiao Yan called it…</p><br/><p>“Extermination Fire Lotus!”</p><br/><p>Being the creator, Xiao Yan could not have known more about the strength of this fire lotus. Moreover, even he felt alarmed at this kind of strength during the creation. If a little of the destructive strength were to seep out during this creation, the first person who would have his corpse completely destroyed by it was likely him…</p><br/><p>Xiao Yan was barely able to maintain this current fire lotus under the support of his powerful Spiritual Strength since a fire glow repeatedly percolated from the fire lotus. From this seeping of energy, it was clear that Xiao Yan did not control this fire lotus as precisely as the ‘Angry Buddha Lotus Flame’ that he had created in the past. Of course, being able to maintain this ‘Extermination Lotus Flame’ at an equilibrium was already the result of Xiao Yan maintaining it with all his might. Advancing another step forward was not something that he could achieve now…</p><br/><p>Even though this was the case, the fire lotus was already formed under Xiao Yan’s control. Next, it was time to completely unleash this frightening energy!</p><br/><p>Even the Old Ground Demon Ghost could only shiver under this destructive strength!</p><br/><p>Xiao Yan’s hand dragged the colorful fire lotus. His dark-black eyes slowly paused on the body of the Old Ground Demon Ghost, who had already ceased fighting. A dark and dense arc was slowly lifted on his pale face…</p><br/><p>The Old Ground Demon Ghost’s expression turned ugly for the first time after he sensed Xiao Yan’s dense gaze. His hands repeatedly quivered under his sleeves. At this moment, a thread of regret had surged into his heart. He did not expect that a little four star Dou Huang brat, whom he thought he could kill with one hand, would actually be able to unleash a frightening energy that caused even him to feel afraid…</p><br/><p>The Old Ground Demon Ghost’s throat rolled. He widened his dried mouth before speaking in a hoarse voice, “The old me will leave now…”</p><br/><p>The sky had descended into an unusual silence after the appearance of the fire lotus. Hence, the voice of the Old Ground Demon Ghost was transmitted into everyone’s ear. The fear and horror within the hoarse voice was also noticed by everyone. At this moment, a countless number of people felt an absurd feeling. An expert from the same generation as the mysterious headmaster had actually said such soft submissive words to Xiao Yan.</p><br/><p>Numerous gazes endured the energy pressure that was transmitted from the sky as their heated eyes stared at the black-robed, young man. That somewhat skinny figure had seared an imprint, that was difficult to remove, within the hearts of these students from the Inner Academy. Perhaps these students might end up going in all directions many years later. However, they would still firmly remember this rarely witnessed scene today. That name, Xiao Yan, would also accompany them all the time. He might become the most outstanding student of the Jia Nan Academy in history…</p><br/><p>Xiao Yan’s emotionless eyes looked to the Old Ground Demon Ghost. He tilted his head slightly and immediately saw the Little Fairy Doctor, whose pretty face was covered with a pale whiteness while she carried a blood trace on the corner of her mouth. He immediately smiled. This smile, however, caused the heart of the Old Ground Demon Ghost to instantly sink.</p><br/><p>“It’s too late… since you have come, there is no longer a need for you to leave…”</p><br/><p>The soft voice was like a snowflake that carried an icy-cold chill as it drifted down from the sky.</p><br/><p>The voice reverberated slightly before Xiao Yan gave a toss with his hand. The colorful fire lotus fell from his hand before transforming into a very straight light of fire that shot after the Old Ground Demon Ghost. The empty air where the fire glow passed was torn, forming a dark-black spatial crack that appeared to be a ferocious huge mouth that could swallow a person…</p><br/><p>The pores all over the Old Ground Demon Ghost’s body suddenly became erect as he watched the fire lotus quietly rush over. His eyes had suddenly shrunk to that of a pinhole…</p><br/>\n</div>"}