{"title": "Chapter 881: Overbearing Bone Wings", "id": 881, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-881-overbearing-bone-wings", "volume_title": "Volume 9", "body": "<h1>Chapter 881: Overbearing Bone Wings</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 881: Overbearing Bone Wings</u></strong></p><br/><p>Xiao Yan’s tightly shut eyes were slowly opened within a room. A glint flashed in his dark-black eyes before swiftly disappearing.</p><br/><p>A mouthful of turbid air followed Xiao Yan’s throat as it was slowly exhaled. At this moment, Xiao Yan not only did not show any appearance of fatigue even after a big spiritual battle but he had also strengthened his Spiritual Strength due to him having swallowed a lot of the remnant aura. His originally somewhat tired body was once again filled with energy.</p><br/><p>Xiao Yan’s eyes slowly slide to the jade bone wings suspended in front of him after having opened them. After the refinement earlier, they seemed to appear even more crystal clear. Moreover, the fierce aura that had vaguely seeped out of them earlier had become much fainter. Clearly, the effects of the refinement were beneficial.</p><br/><p>The jade bone wings drifted down as Xiao Yan beckoned with his hand. He grabbed them and an icy-cold feeling that contained a hint of jade-like warmth was felt where Xiao Yan’s hand made contact with it, leaving him with an extremely comfortable feeling.</p><br/><p>Xiao Yan’s hands held the jade bone wings and played with them admiringly for quite awhile. Only then did he click his tongue after having enjoyed them sufficiently. After which, he flicked his finger and a fierce jade-green flame suddenly surged from his body. It slowly escaped his body and rose in the space in front of him.</p><br/><p>After controlling the jade-green flame’s temperature with his Spiritual Strength, Xiao Yan tossed his his hand and the jade bone wings parted from him. They were thrown into the large cluster of flames floating in mid-air.</p><br/><p>A ‘puff’ sound was immediately emitted from the jade-green flame after the jade bone wings were thrown into them. The flame soared and a frightening temperature spread out from within, grilling the entire room until it was like a furnace.</p><br/><p>Xiao Yan’s eyes did not move as he watched the jade bone wings be grilled by the flames. Following the increase in the temperature, traces of gray air, that were difficult to detect, were released from the bone wings with a ‘chi chi’ sound. That air then transformed into nothingness and scattered under the frightening temperature of the Glazed Lotus Heart Flame.</p><br/><p>“It is unexpected that these remnant auras were hidden so deeply. If not for the Glazed Lotus Heart Flame, it likely would have been extremely difficult to force all of them out…” Xiao Yan glanced at the gray-colored air that was looking to flee, but instead was immediately vaporized. He could not help but shake his head and sigh.</p><br/><p>Xiao Yan’s hand did not hesitate even a little when he spoke. He controlled the Glazed Lotus Heart Flame temperature and allowed it to rise…</p><br/><p>A moment after the flame’s temperature soared, the gray airflow’s emission speed from the jade bone wings gradually slowed. Earlier, it was still possible to frequently see it. Now, only a faint thread of air would be emitted every two to three minutes. Clearly, under the frightening temperature of the Glazed Lotus Heart Flame, the remnant aura hidden within the jade bone wings had been gradually forced out.</p><br/><p>This kind of high temperature grilling continued for around an hour. In the end, Xiao Yan sighed in relief after not seeing a thread of air emitted despite being grilled for half an hour. It seemed that the aura within the bone wings had been completely expelled.</p><br/><p>After completing the removal, Xiao Yan did not simply withdraw his flame. Instead, he maintained the temperature of the flame. Using that constant temperature he repeatedly grilled the jade bone wings.</p><br/><p>This kind of grilling continued for another two hours or so. Finally, the jade bone wings, which had been void of any activity, displayed hints of a transformation. One could see a droplet of thick jade-colored liquid quietly fall from the crystal clear surface of the bones. This jade liquid bead did not disappear. Instead, it remained in the flame and slowly churned.</p><br/><p>A chain effect seemed to have been sparked after the first droplet of the jade liquid appeared. Unceasing amounts of jade-colored liquid seeped out of the bone marrow before finally releasing a trickling sound as all of them fell down. Less than half an hour later, a small half-inch-deep pool of liquid was forming under the jade bone wings, and the size of the jade bone wings had shrunk by more than half…</p><br/><p>This transformation of the jade bone wings did not cause Xiao Yan to feel any panic or loss. His gaze remained calm as his hand seal controlled the flame’s temperature, maintaining at a constant temperature. It neither increased nor decreased…</p><br/><p>With the flow of time, the size of the jade bone wings grew increasingly smaller. The amount of jade liquid under them increased and became denser…</p><br/><p>“Tap.”</p><br/><p>A soft yet clear sound suddenly reverberated through the room. Xiao Yan suddenly opened his tightly shut eyes and raised them slightly. He immediately discovered that the jade bone wings had completely disappeared. What replaced the wings was a thick jade liquid. Moreover, due to the high temperature of the Glazed Lotus Heart Flame, small bubbles had started to rise within the liquid and strange energy would be emitted each time a bubble exploded…</p><br/><p>A smile of relief surfaced on Xiao Yan’s face as he observed the pool of jade liquid. After refining it with great difficulty for such a long time, he had finally refined it. Were it not for the Glazed Lotus Heart Flame, it was likely that the time needed to refine it would have been at least ten to twenty times as long.</p><br/><p>Xiao Yan’s mind moved slightly and the jade-green flame’s temperature suddenly soared. Xiao Yan’s expression also gradually became solemn. He flipped his hand and over ten bones that contained a silver color appeared. He tossed these silver-colored bones into the flames. After which, they gradually transformed into a silver powder amid a wave of strange thunder-like noises. The powder was then scattered into the jade-colored liquid.</p><br/><p>These silver-colored bones were Magical Beast bones with the lightning affinity. Their surfaces had been filled with lightning affinity energy that had yet to be scattered. At this moment, they were being mixed with the flying wings that were about to be formed, strengthening the flying wings. Should the wings meet with a thunderstorm, they would be able to achieve a resonance effect with the lightning affinity energy in the sky, enabling their speed to increase.</p><br/><p>Xiao Yan took out some strange and unique items from his Storage Ring one after another after having thrown these silver-colored bones into the flames. There were feathers, spiked bones, randomly shaped wings, etc. Although these items were all different, all of them possessed something in common. They all contained some energy. Although the energy they contained were not extremely strong, it would be like adding wings to a tiger when it came to what would be created.</p><br/><p>Xiao Yan studied the jade-colored liquid whose color had changed a little. He slowly exhaled a breath and changed the seal formed by his hands. One could feel that the Glazed Lotus Heart Flame’s temperature was beginning to decrease. This decrease suddenly came to a stop after it was reduced to a certain degree. Finally, it mirrored a warm flame used to stew something as it slowly grilled the pool of jade liquid…</p><br/><p>Xiao Yan also sighed in relief after seeing that the flame was emitting a warm temperature. After which, he slowly shut his eyes. Next, he took some time to brew a pill. Once this period of time had smoothly past, he would be able to craft the Sky Bird Nine Flying Wings.</p><br/><p>After Xiao Yan slowly shut his eyes, the room once again descended into a silence. There was only the sound of the gentle rustling of the jade-green flame as well as the sudden noise of a bubble bursting…</p><br/><p>The brewing time continued for nearly two days and two nights. Even Xiao Yan felt somewhat surprised about this. However, it was fortunate that he was well prepared this time around. Hence, he made no mistakes. During this period of time, he had also found an opportunity to inform First Elder Su Qian and the others. Therefore, they did not come and disturb him. Instead, he requested that this place become a restricted area that an ordinary person was not allowed to enter.</p><br/><p>Xiao Yan slowly opened his tightly shut eyes after two days and two nights. The first thing he did was to throw his eyes to the jade-green flame.</p><br/><p>A jade-colored liquid was slowly flowing within the fiercely burning jade-green flame. At this moment, it seemed to be extremely thick as though it was about to solidify. It seemed that if this grilling were to last another couple of hours, that liquid might turn into a cluster of hard jade rock…</p><br/><p>Xiao Yan gently exhaled. His Spiritual Strength slowly spread from between his brows and swiftly invaded the flame. After which, it smoothly entered the extremely viscous jade-colored liquid.</p><br/><p>The thick jade liquid shook violently following the invasion of Xiao Yan’s Spiritual Strength. It seemed to possess a life force as it began to wiggle. The way it moved was as if a large, invisible hand was attempting to pull something…</p><br/><p>The wiggling continued for half an hour or so before the pool of jade liquid strangely turned into a pair of enormous ten-foot-long bone wings… Quite a number of inch long silver thorns had grown on the edge of the bone wings. A faint lightning lingered on it as well. The other parts of the bone wings also possessed mysterious, different-colored lines, giving it an extremely peculiar and beautiful appearance. If he used this pair of wings to go out and fly, it was likely that he would appear extremely eye-catching.</p><br/><p>A wild joy that was difficult to hide surged into Xiao Yan’s eyes as he studied the bone wings that he had formed. He inhaled a deep breath of air as a thought passed through his mind. The temperature of the Glazed Lotus Heart Flame suddenly soared!</p><br/><p>The temperature merely soared for a couple of minutes before it gradually came to a stop. When the flame began to return to Xiao Yan’s body, miniature bone wings, about the size of a hand, emitted a faint jade luster, and remained gently suspended in front of Xiao Yan…</p><br/><p>Gratification surfaced on the corner of Xiao Yan’s mouth as he looked over these miniature bone wings. He bit his middle finger and a droplet of fresh blood dripped down. It landed on the bone wings.</p><br/><p>The fresh blood had just made contact with the bone wings when they swiftly absorbed it. After which, an intense jade light was emitted. With a ‘suo’ sound, they transformed into a light ray and shot into Xiao Yan’s body…</p><br/><p>Xiao Yan sensed a searing pain on his shoulders after the bone wings entered his body. Immediately, a pair of pale purple wings fell from his shoulders. Xiao Yan swiftly received them and let out a bitter laughter. It was unexpected that these bone wings would actually be so overbearing. Without the agreement of its owner, they had expelled the Purple Cloud Wings from his body. These wings really possessed a boundless arrogance and an overbearing attitude…</p><br/><p>Xiao Yan curled his lips slightly. His mind moved and he immediately heard a ‘Chi La’ sound. The large bone wings that emitted a jade glow suddenly shot out of his back. As the bone wings slowly flapped, Xiao Yan sensed that the surrounding natural wind affinity energy had become extremely sensitive. He involuntarily licked his mouth. It seemed that this time around, he had really refined a treasure. Although it was overbearing, it seemed to possess the capital to be…</p><br/>\n</div>"}