{"title": "Chapter 888: Crazy", "id": 888, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-888-crazy", "volume_title": "Volume 9", "body": "<h1>Chapter 888: Crazy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 888: Crazy</u></strong></p><br/><p>Although the Little Fairy Doctor felt some doubt in her heart, all she did was merely nod her head. She softly said, “I will help you buy sufficient time…”</p><br/><p>Xiao Yan gently exhaled when he heard this. He stared at the Old Ground Demon Ghost before he flapped his wings and slowly withdrew. His heart had also somewhat rejoiced that he had successfully refined the Sky Bird Nine Flying Wings before this big battle. Otherwise, he really did not have the confidence to be able to flee for such a long time under the attacks of the Old Ground Demon Ghost…</p><br/><p>The eyes of the Old Ground Demon Ghost turned cold when he saw Xiao Yan move back. He violently swung his sleeves and a dark-black ice awl shot toward Xiao Yan in a lightning-like manner.</p><br/><p>“Chi!”</p><br/><p>The black-colored ice awl had just been shot out when a dense corrosive grayish-purple Dou Qi shot over and violently collided with it. The ice awl was turned into nothingness amid a wave of ‘chi chi’ sound.</p><br/><p>“Your opponent is me…” The Little Fairy Doctor’s tall lovely figure was suspended in the sky. A breeze blew, causing her long snow-white hair, that extended to her buttocks, to slowly dance in the wind. Her emotionless eyes stared at the Old Ground Demon Ghost as she slowly spoke.</p><br/><p>The Old Ground Demon Ghost coldly laughed as he frowned. The then turned to the Little Fairy Doctor in front of him, “Although I do not know why your strength has suddenly soared by a certain amount, the current you is at the very most able to contend with a five star Dou Zong. The old me, on the other hand, has already long entered the seven star Dou Zong level!”</p><br/><p>“Is that so…” The corner of the Little Fairy Doctor’s mouth carried a slight non-committal arc. Her long hands were gently extended and dense grayish-purple Dou Qi followed her sleeves and climbed out. Finally, it lingered around her hand, squirming a little before transforming into two gray and purple snakes. The enormous snakes extended their tongues and a vague stench drifted out as they hissed.</p><br/><p>“Chi!”</p><br/><p>The enormous gray and purple snakes formed from Dou Qi had just appeared when they hissed at the Old Ground Demon Ghost with great intelligence under the Little Fairy Doctor’s control. They swung their tails and transformed into two vague gray lines that rushed toward the Old Ground Demon Ghost in a lightning-like manner.</p><br/><p>The Old Ground Demon Ghost let out a cold snort as he observed the huge grayish-purple snakes that came rushing over. He flicked his finger and black, cold air swiftly flowed in front of him. It immediately transformed into a couple of sharp ice spikes. It carried a whistling sound as it violently shot toward the two grayish lines.</p><br/><p>“Chi!”</p><br/><p>The two gray threads, that had shot over in a lightning-like manner, suddenly paused. Immediately two grayish-purple poison fogs shot out of their savage mouths. The sharp ice sculpture was swiftly eroded into nothingness. Taking this opportunity, their speed suddenly increased and they appeared in front of the Old Ground Demon Ghost within an instant. They widened their large mouths and two bright-red glows were suddenly shot out!</p><br/><p>The Old Ground Demon Ghost waved his sleeves as his eyes locked onto the attacks of the two grayish-purple snakes. The cold air flowed in front of him before eventually turning into a mirror-smooth ice cube that completely blocked the blood glow.</p><br/><p>“Chi Chi!”</p><br/><p>The blood glow immediately emitted a dense white vapor the moment it made contact with the ice mirror, swiftly corroding the thick ice mirror at a speed visible to the naked eye. However, the blood glow also swiftly shrank while the ice mirror was being corroded, but it completely vanished when it was just about to completely penetrate the ice mirror…</p><br/><p>Seeing this futile attack, the cold smile on the Old Ground Demon Ghost grew even denser. The ice mirror in front of him slowly melted and immediately transformed into a black fog that continued to shrink back into his body. After which, he clenched his hand and two dark-black clouds agglomerated. They formed two enormous ghost hands that grabbed the enormous gray and purple snakes. The hands pinched violently and the snakes burst apart…</p><br/><p>The Little Fairy Doctor’s face not only did not change upon witnessing the destruction of these two enormous snakes, but had instead revealed a strange smile in her eyes. Her delicate hand swiftly formed a seal as her gentle voice said, “My fresh blood is not something good. Next time, you should not stingily withdraw the Dou Qi that had been contaminated by my blood into your body…</p><br/><p>The expression of the Old Ground Demon Ghost involuntarily changed upon hearing the Little Fairy Doctor’s words. The corner of his mouth trembled and cold air surged out of his body in all directions. Although the cold air was powerful at this moment, there was a little chaos within it… it seemed that the poison blood that he had absorbed into his body had already begun to take effect.</p><br/><p>“It is unexpected that even your blood contains poison. Moreover, the poison within it is so potent. However, this is useless against me!” A dark and solemn voice was slowly transmitted from the Old Ground Demon Ghost’s mouth. At this moment, the surface of his body was covered by a black-colored ice crystal. One could see some bright-red colors within these ice crystals. From the looks of it, he was relying on his powerful Dou Qi to forcefully expel the poison blood from his body.</p><br/><p>The Little Fairy Doctor was not surprised at seeing that the Old Ground Demon Ghost was actually able to gradually force out the poison blood. This was because she clearly understood that the poison blood that had entered one’s body might be fatal to an ordinary expert, but it was not considered troublesome for someone with his strength to forcefully expel it from their bodies. All it did was cause one to be distracted. This was also something that she needed. If she wanted to give Xiao Yan sufficient time, it was somewhat difficult if she relied on her strength. However, with the interruption of the poison blood, the matter had become much more relaxing…</p><br/><p>The time during this critical moment was not allowed to be wasted. The Little Fairy Doctor clenched her delicate hand and grayish Dou Qi swiftly surged out of her body. After which, she moved her body and appeared in front of the Old Ground Demon Ghost. Her hand rose sharply…</p><br/><p>The Old Ground Demon Ghost was unable to remain as relaxed as he had been in the face of the Little Fairy Doctor’s attack that had suddenly become sharp. He needed to divide his strength in order to force out the poison blood in his body. Hence, he was unable to rely on his pressuring strength to defeat the Little Fairy Doctor. For a moment, he was actually being firmly pestered by the Little Fairy Doctor…</p><br/><p>The Old Ground Demon Ghost’s eyes would occasionally drift to where Xiao Yan was located while he was being pestered by the Little Fairy Doctor. The ghost flame in his eyes leaped slightly when he saw a green and an invisible flame suspended in front of the latter. He had already heard from Han Feng that Xiao Yan was in control of a ‘Heavenly Flame’ Dou Technique. This thing was his skill to protect his life. Its strength was extremely frightening. However, the Old Ground Demon Ghost had let out a little sigh of relief after sensing it personally. The merger of the two kinds of ‘Heavenly Flames’ did indeed possessed an extremely powerful and violent energy. However, it was not able to pose much of a risk with only two. After all, the strength of a seven star Dou Zong was not a joke…</p><br/><p>Xiao Yan stood in the air at a spot in the sky not far above the battleground between the Little Fairy Doctor and the Old Ground Demon Ghost. He gently flapped the bone wings on his back. Each time, the flapping would be accompanied by a thunderous sound.</p><br/><p>At this moment, a green flame and an invisible flame were suspended in his hand. The flame was faintly emitting a warmth, causing the atmospheres temperature raise over ten times as much as it was before. The ‘Angry Buddha Lotus Flame’ from the merger of two kinds of ‘Heavenly Flames’ actually did not possess much of a threat toward an expert like the Old Ground Demon Ghost...</p><br/><p>Xiao Yan gently exhaled. The white fire seal between his brows emitted a faint temperature. A dense white-colored flame slowly drifted out before landing in front of him. At this moment, he could only rely on teacher’s ‘Bone Chilling Flame’...</p><br/><p>The natural energy of the area immediately became somewhat chaotic following the appearance of the Bone Chilling Flame. Hot temperature scattered down from the sky, causing a countless number of people to be covered with perspiration. It was useless even with Dou Qi covering the surface of their bodies. The temperature of a ‘Heavenly Flame’ was not something ordinary Dou Qi could cover.</p><br/><p>Xiao Yan studied the three clusters of flame with a solemn expression and did not hesitate even a little. A thought passed through his mind and numerous afterimages were formed by his hands. The three clusters of flame began to collide under his control…</p><br/><p>The Old Ground Demon Ghost’s face finally became a little concerned when he sensed the natural energy that had suddenly become wild in the sky. This strength was already sufficient to pose a threat to him. Unexpectedly… that little fellow was actually able to reach such a level. It seemed that he could not delay any longer.</p><br/><p>The Old Ground Demon Ghost clenched his hand suddenly as this thought flashed through his heart. His eyes popped out like a dead fish’s eyes and the cold air within his body grew even denser. A moment later, he suddenly widened his mouth and a bright-red ice cube shot out of it.</p><br/><p>The ice cube contained some slowly moving viscous blood within it. When it burst apart, the liquid blood completely solidified before finally cracking apart, turning into nothingness.</p><br/><p>The face of the Little Fairy Doctor changed when she saw that the poison blood had been forced from the Old Ground Demon Ghost’s body this quickly. Before she had the chance to withdraw, an extremely frightening fist of wind suddenly arrived. All she could do, since she was unable to dodge in time, was to forcefully receive it.</p><br/><p>“Grug!”</p><br/><p>The frightening force spread out in a flood-like manner from the point of contact. A paleness immediately surfaced on the Little Fairy Doctor’s pretty face before she involuntarily spat out a mouthful of fresh blood. Her body also ended up swiftly withdrawing by a couple of steps.</p><br/><p>Seeing the fresh blood that came pouncing at him, the Old Ground Demon Ghost, who had suffered once, hurriedly waved his sleeves. Cold air was spat out and solidified the blood into ice crystals before they could make contact with his body. After which, all of them burst apart.</p><br/><p>“Your strength is unable to block the old me! I will give you one last chance. The old me will not kill you if you turn around and leave!” The Old Ground Demon Ghost coldly smiled and negotiated with the Little Fairy Doctor.</p><br/><p>The Little Fairy Doctor wiped off the blood trace on the corner of her mouth. Her face was icy-cold. Without replying, her body flashed and she once again rushed forward.</p><br/><p>“You’re seeking death!”</p><br/><p>A killing intent surged within the eyes of the Old Ground Demon Ghost when he saw the Little Fairy Doctor persistently attack him to keep him occupied. After which, he met her with killing intent all over his body. Frightening energy ripples formed when the two figures met as a thunder-like explosion immediately sounded in the sky.</p><br/><p>The three colored fire lotus in Xiao Yan’s hand was finally forming in the sky. His eyes began to flicker as he watched this fire lotus form. An ‘Angry Buddha Lotus Flame’ that was formed from the merger of three kinds of ‘Heavenly Flame’ was basically the strongest energy that Xiao Yan could control. He was always filled with confidence when facing an opponent. However, he had become a little uncertain this time around. This was because his enemy today was far too troublesome. A seven star Dou Zong was considered an expert on the upper level of the golden pagoda across the entire Dou Qi continent. The current Old Ground Demon Ghost was even stronger than Protector Wu after he had swallowed Yun Shan’s soul back then…</p><br/><p>The three colored ‘Angry Buddha Lotus Flame’ was Xiao Yan’s trump card. With his current strength, he was only able to use it once before he fell into a weary state. In other words, he only had one chance. If the fire lotus did not kill the Old Ground Demon Ghost, today… the worst scenario might appear… hence, he must ensure that this strike was a fatal one to the Old Ground Demon Ghost!</p><br/><p>“Grug!”</p><br/><p>During the time when Xiao Yan’s mind was flickering, the Little Fairy Doctor, who was facing the Old Ground Demon Ghost was once again shaken until she spat out a mouthful of fresh blood. At this moment, the paleness on her face was growing more intense. Each star within the Dou Zong class had an extremely large gap. Moreover, the Old Ground Demon Ghost was a full three stars stronger than her…</p><br/><p>Xiao Yan’s face twitched slightly when he looked at the Little Fairy Doctor, who had spat out blood, and the Old Ground Demon Ghost, who was smiling ferociously. A craziness gradually surged into his dark-black eyes. He inhaled a deep breath, opened his mouth slowly and a grayish-brown flame drifted out slowly…</p><br/><p>This cluster of flame was the ‘Life Transforming Flame’ that Xiao Yan had snatched from Fang Yan and the other two back then. Although it was not a genuine ‘Heavenly Flame,’ it still contained a powerful strength. If it were to merge with the three colored fire lotus, the strength of the ‘Angry Buddha Lotus Flame’ would reach a historical level of frightening for the first time. Although he would lose half of the ‘Life Transforming Flame’ as a result, it was better than losing his life.</p><br/><p>Xiao Yan inhaled a deep mouthful of hot air as a wild fierceness appeared in his eyes. Since this old bastard wanted them to die, he would definitely drag him to the bottom even if he had to risk his life.</p><br/><p>Xiao Yan finally ceased hesitating as a viciousness flashed across his eyes. A thought passed through his heart and the cluster of grayish-brown flames was thrown into the three colored fire lotus!</p><br/><p>The wind in the sky and the cries and exclamations completely disappeared the instant the ‘Life Transforming Flame’ entered the cluster. A frightening energy that was filled with destruction was quietly being born…</p><br/>\n</div>"}