{"title": "Chapter 898: Initial Mastery of the Ruler Technique", "id": 898, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-898-initial-mastery-of-the-ruler-technique", "volume_title": "Volume 9", "body": "<h1>Chapter 898: Initial Mastery of the Ruler Technique</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 898: Initial Mastery of the Ruler Technique</u></strong></p><br/><p>The bright-red magma world was filled with a deadly silence. It seemed void of any traces of life. The vast, seemingly endless magma was just like a pool of still water that did not even form the slightest ripple. The quietness seemed to cover every single inch of this magma world…</p><br/><p>“Bang!”</p><br/><p>A low, deep sound suddenly appeared in this quiet magma world. Immediately, the viscous magma seemed to be stirred by something as it began to furiously rise and fall. An enormous magma fire wave whistled and rose before finally falling down, shooting out a magma flow in all directions while emitting a loud bang.</p><br/><p>A human figure stood on the magma under the whistling of the magma’s fire wave. His body was naked and a layer of white, viscous liquid covered his exposed skin. At this moment, his hand was holding a large, heavy ruler while he danced swiftly. Numerous profound arcs formed. Following the dancing of the heavy ruler, a continuous ruler figure swiftly spread out and enshrouded his entire body. The magma that landed with a bang was swiftly being reflected aside when it made contact with the ruler figure that was like a dragnet. The ruler figures were dense as they danced, appearing to have superimposed on each other by an unknown number. They blocked the incoming magma flow without allowing it to enter. This dense defense really left one speechless.</p><br/><p>A heavy magma fire wave landed with a bang and shot out, forming a magma flow that permeated the air. After which, it slowly calmed down. The human figure who stood on the magma also panted heavily and slowly stopped the ruler figure’s dancing. When the final ruler figure disappeared, it revealed a young man’s face. This face was filled with some excitement and tiredness. It was Xiao Yan, who had entered the magma world to train.</p><br/><p>Xiao Yan’s heavy ruler ceased dancing. He wiped the perspiration off his forehead. The kind of momentum needed when a ten-foot-large magma wave smashed down was terrifying. It really forced one to focus all of one’s attention. Otherwise, should that hot magma flow land on one’s body, it was likely that one’s flesh would immediately turn into grilled meat.</p><br/><p>Xiao Yan ceased his training. Only then did he sense the waves of numbness that were transmitted from his hand. He lowered his head and glanced at the Heavy Xuan Ruler, only to see that it was covered with magma. The hot temperature followed the ruler’s body and spread, causing his hand to be fiery hot. However, it was fortunate that this little temperature was not considered much of a problem to Xiao Yan. His gaze moved back to his body as he involuntarily frowned a little.</p><br/><p>One could see that Xiao Yan’s body, which was covered with cold liquid, currently had quite a couple of bright-red spots. Clearly, some of the magma wave had broke through in earlier. However, it was fortunate that there was the cold liquid cover that stopped it from causing too much harm to his body. Although there was no great harm, it also indicated that Xiao Yan’s ‘Six Joint Body Flowing Ruler’ had not been successfully mastered. According to what was written on the scroll, someone who wanted to master the Six Joint Body Flowing Ruler would at least have to be able to enter this magma wave as he pleased without even a little of the magma touching him. After all, when one were to fight with others in the future, the presence of any openings in one’s defenses would not allow a couple of drops of magma to stealthily enter. Rather, it would be fatal Dou Qi…</p><br/><p>“This Six Joint Body Flowing Ruler is indeed not as easy to practice as I expected…” Xiao Yan shook his head and softly sighed.</p><br/><p>Of course, Xiao Yan, who was dissatisfied with this training speed of his, was unaware that being able to practice the ‘Six Joint Body Flowing Ruler’ to such an extent within these short fifteen days was something was extremely difficult to achieve. Even with Xiao Yan’s training talent should he not have already used a heavy ruler to begin with, found the perfect training location, and had the teaching of the spiritual imprint this would not have been possible. After all, regardless of how one put it, this was a Di class Dou Skill. If one could master it so easily, it would appear somewhat childish. One could just guess this by thinking of just how much Xiao Yan has suffered in order to practice the Di class Low level ‘Flame Splitting Tsunami.’</p><br/><p>Xiao Yan returned the heavy ruler in his hand to his storage ring. His toes pressed on the magma and a pair of crystal clear bone wings extended out. They were flapped and his body flashed above the magma, and flew to the cave on the mountain wall.</p><br/><p>It had already been half a month since Xiao Yan had entered this magma world. During this half a month, he had basically not taken even half a step out. He would only occasionally head to the hole and report to the Elder, who was standing guard, in order to avoid them thinking that he had met some mishap below.</p><br/><p>Half a month of tireless training where food and sleep were forgotten might be bitter and lonely, but the effects were extremely obvious. Currently, the Dou Qi in Xiao Yan’s body was becoming increasingly rich. According to his senses, he had already gradually moved toward the level of a six star Dou Huang. Moreover, he did not know whether it was because of the fire affinity energy being exceptionally pure or what, but Xiao Yan had discovered that the Dou Qi within his body seemed to have become much hotter. Of course, he had also obtained the reward of becoming even more familiar with the ‘Six Joint Body Flowing Ruler.’ Although he currently could not be considered to have mastered it, at the very least he was much better now than when he had begun practicing it.</p><br/><p>Xiao Yan endured the waves of aches all over his body as he entered the cave. He immediately sat cross-legged and swiftly entered his training state. During this period of training, he had discovered that each time he practiced the ‘Six Joint Body Flowing Ruler,’ the absorption rate of his body would be exceptionally high. He could even faintly hear his cells, bones, veins, muscles, and his many organs emit waves of hungry voices when the powerful fire affinity energy entered his body.</p><br/><p>The advancement in his strength caused Xiao Yan to go through a kind of loneliness that was difficult to endure. Currently, he was about to head to the Central Plains where experts gathered, a place where dragons and tigers hid. It was not the ‘Black-Corner Region,’ and it was not the Jia Ma Empire. In these two places, Xiao Yan might be able to rely on his current strength to survive. At that place, however, he would not be able to survive.</p><br/><p>Moreover, attempting to obtain the top ten in the so-called ‘Pill Gathering’ held by the Pill Tower was not an easy matter. After all, being the gold-plated alchemist gathering for the entire Dou Qi continent meant countless of medicine refining geniuses would gather at the stage named ‘Pill Gathering.’ Wanting to stand out from people who possessed shocking alchemist talent was impossible unless one had some genuine ability.</p><br/><p>Even though Xiao Yan medicinal refining talent was outstanding, he did not dare to slight that ‘Pill Gathering,’ where even Yao Lao had participated. This was Xiao Yan’s greatest motivation, to endure the loneliness and go all out to raise his strength. After all, only by obtaining the ‘Three Thousand Burning Flame’ would he be able to undo the Demon Poison Spot within his body as well as rescue Yao Lao and his father…</p><br/><p>Xiao Yan’s eyes, that contained a fatigue, once again became determined as these thoughts flashed in his heart. His eyes were slowly shut, and he continued the bitter training!</p><br/><p>There was no concept of time in the quiet magma world. However, Xiao Yan was able to clearly sense the growth of his strength. Moreover, the training of the ‘Six Joint Body Flowing Ruler’ had gradually fallen on a track. Everything was progressing in an orderly fashion. According to this speed, Xiao Yan would be able to charge to the sixth star Dou Huang class within another two months!</p><br/><p>During this period of time, the unknown summoning intent also appeared even more frequently. This caused Xiao Yan to feel doubtful. Currently, he was certain that there was indeed some mysterious item deep within the magma calling to the Fallen Heart Flame in his body. Although he was certain, Xiao Yan did not dare to act recklessly. This magma world might be completely silent but Xiao Yan faintly felt a dangerous aura from within it. He had basically spent this period of time training in this area, afraid that he would be unable to flee should any unexpected change occur.</p><br/><p>“Bang!”</p><br/><p>The enormous magma fire wave heavily crashed down before finally carrying a loud noise that reverberated within this space. The naked Xiao Yan was standing within this fire wave. The heavy ruler in his hand danced while his face appeared solemn. Under the orbit of the profound dancing, a continuous ruler figure surfaced around his body. It appeared like a dragnet that completely wrapped around his body. The magma that came smashing over would be gently pushed aside by the force contained in the ruler’s figure. Looking from a distance, it appeared as though there was a whirlpool being created by the ruler figure within the fire wave. The magma that scattered down would be shot aside when it made contact with the ruler figure whirlpool. The dense defense where even wind could not penetrate did indeed show something worthy of being praised…</p><br/><p>Xiao Yan, whose ruler was dancing within the fire wave, abruptly correlated his eyes. A soft cry erupted from the tip of his tongue and his hand suddenly paused on the heavy ruler. The heavy ruler vibrated swiftly the instant the ruler figure defense disappeared and a couple of after images appeared one after another!</p><br/><p>“Raging Flames!”</p><br/><p>The cry resounded over the magma world. Two four-hundred-foot-tall fire glows crossed each other as they exited the heavy ruler. They were like a somewhat crude ruler web that shot out. The powerful strength that erupted at that instant tore apart the heavy magma wave in front of it.</p><br/><p>“Bang!”</p><br/><p>The magma that shot in all directions suddenly fell, creating a great magma flow. Faint circular jade-green flames spread from Xiao Yan’s body, blocking the magma flow.</p><br/><p>A joy surged into Xiao Yan’s eyes as he faced this boiling magma. Being able to unleash the ‘Raging Flame’ of the ‘Six Joint Body Flowing Ruler’ meant that he could be considered to have an initial mastery. This achievement was obtained in less than a month. Such speed was considered extremely fast. It was likely that even Xiao Yan himself had never expected this.</p><br/><p>Xiao Yan inhaled a deep breath of hot air, parted his lips, and smiled. He was just about to return to the cave to rest when his expression suddenly changed. Almost instantly, he lowered his head in an abrupt manner and stared intently at the bottomless magma sea. Earlier, the deep region of the magma had emitted another summon. Moreover, the summoning strength this time around was stronger than any other time.</p><br/><p>“Below… just what is there? Why is it able to cause the Fallen Heart Flame to react so much?”</p><br/><p>Xiao Yan’s eyes flickered. His expression also changed a little. He had become full of curiosity because of the unknown summoning during this period of time. However, he was unwilling to randomly investigate due to his cautiousness. Today, however, he was somewhat interested. Perhaps, there would be some unexpected things below…</p><br/><p>This time… he shall take the risk once!</p><br/>\n</div>"}