{"title": "Chapter 902: Tian Huo Zun Zhe", "id": 902, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-902-tian-huo-zun-zhe", "volume_title": "Volume 10", "body": "<h1>Chapter 902: Tian Huo Zun Zhe</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 902: Tian Huo Zun Zhe</u></strong></p><br/><p>Xiao Yan clearly felt an unusual ripple sweeping over his body when he broke through the layer of transparent light. This ripple swiftly disappeared when it made contact with the Fallen Heart Flame on his body, allowing Xiao Yan’s body to successfully enter it.</p><br/><p>When he penetrated the barrier, the bright-red color that filled his eyes was swiftly scattered. Replacing it was a kind of misty and faint cream-white-colored light. Xiao Yan immediately stabilized his body. His gaze was extremely cautious as it swept in all directions. Finally, it paused on the mysterious skeleton that was suspended in the middle.</p><br/><p>The space in this place was clearly the light barrier that Xiao Yan had seen earlier. Perhaps it was due to his sight, but this place appeared much bigger at this moment. However, one could still take in the entire place with a glance.</p><br/><p>Xiao Yan turned his head as his eyes searched outside the light barrier. The blood-colored fire lizard leaders were discovered by him. His expression immediately became somewhat solemn. He did not expect that this mysterious magma race would actually possess such experts. The strength of these blood-colored lizard people was clearly greater than the one he had killed earlier. According to Xiao Yan’s guess, it was likely that they had already reached the peak of the Dou Huang class. This caused Xiao Yan’s heart to become increasingly cautious. After all, who knew if there were any stronger people within this fire lizard race.</p><br/><p>If there were, the situation would become quite unfortunate. Xiao Yan’s strength might not be reduced greatly within the magma by relying on the strength of the ‘Heavenly Flame.’ However, the opponent had a great numerical advantage. Should Xiao Yan be surrounded, it was likely that he would have little chance to survive.</p><br/><p>“Dammit. This magma world is indeed not as calm as it appears on the surface.” Xiao Yan clenched his teeth and scolded softly.</p><br/><p>The fire lizard people outside of the light barrier seemed to be unable to sense its location. Hence, they wandered up and down for awhile before dispersing in all directions in front of Xiao Yan’s eyes. Xiao Yan only sighed in relief when the last red figure disappeared into the magma. He might have killed quite a number of fire lizard people in the big battle earlier, but he was also greatly exhausted.</p><br/><p>Xiao Yan’s body was suspended in this white space as he rested for a moment. Only after some of the Dou Qi within his body had recovered did he stand up and carefully walk to the mysterious skeleton.</p><br/><p>As he approached the mysterious skeleton, Xiao Yan could sense the summoning feeling within his heart become increasingly denser. Now, he had finally understood that the beckoning that he had felt above the magma had originated from this mysterious skeleton or… the Fallen Heart Flame.</p><br/><p>Xiao Yan’s eyes drifted over the mysterious skeleton a little longer before his gaze was involuntarily thrown to the invisible flame on the skeleton…</p><br/><p>This Fallen Heart Flame was only the size of a head. The temperature that it emitted was far inferior to the Fallen Heart Flame within Xiao Yan’s body. If one were to describe the Fallen Heart Flame within Xiao Yan’s body as a matured form, this Fallen Heart Flame in front of Xiao Yan was in its baby stages.</p><br/><p>Of course, regardless of whether it was in a baby or mature stage, this thing was a ‘Heavenly Flame.’ It was extremely difficult for a ‘Heavenly Flame’ to be formed. It required the accumulation of a countless amount of time. Moreover, this invisible flame that did not appear violent had likely existed for a very long time. However, Xiao Yan did not know why two ‘Heavenly Flame,’ that were the same, would appear in the same place. This kind of mysterious scene was something that Xiao Yan had never heard of.</p><br/><p>Xiao Yan’s eyes were locked intently on the Fallen Heart Flame. He inhaled a deep breath of air. This kind of baby ‘Heavenly Flame’ might possess some use to the ‘Flame Mantra,’ but it was likely that it would not be very great. After all, the evolution of the ‘Flame Mantra’ required quite a frightening amount of energy. It was clear from looking at this small thing that it did not possess the necessary energy.</p><br/><p>Xiao Yan’s hand rubbed his chin. He mused for a moment before his hand suddenly paused. A joy surfaced within his eyes. This baby like Fallen Heart Flame might not be of much use for him, but it would definitely be a jou, that descended from the sky, to the Inner Academy. Once they had this thing, the Blazing Sky Qi Refining Tower would be able to open again. Moreover, its effects would not be weakened by much compared to the past. As long as there was an unceasing amount of Dou Qi being poured in, it would enable the activation of the Blazing Sky Qi Refining Tower that was called the ‘Training Accelerator.’</p><br/><p>Thus, not only would the Inner Academy benefit from it but this baby Fallen Heart Flame would be able to gradually evolve. In due time, it would definitely evolve into a mature ‘Fallen Heart Flame.’ Moreover, a ‘Heavenly Flame’ which was groomed from young would be much easier to tame in the future. The matter of the mature ‘Fallen Heart Flame’ rebelling like it did in the past would no longer occur. A century later, the Fallen Heart Flame that had successfully evolved might even be a great support to the Inner Academy!</p><br/><p>After all, a ‘Heavenly Flame’ would evolve and form its own intelligence sooner or later. At that time, it would be little different from an ordinary person. It would definitely protect the Inner Academy like its home when that time came. Would the Inner Academy not possess an additional ultimate guardian at that point in time?</p><br/><p>An excitement rose within Xiao Yan’s heart when he thought of the many benefits that it would have for the Inner Academy. He always felt a headache and guilt when dealing with the problem of how to completely solve the exhaustion of the Blazing Sky Qi Refining Tower. The appearance of this baby Fallen Heart Flame had undoubtedly resolved this problem. The slight guilt within his body would finally disappear.</p><br/><p>Xiao Yan involuntarily parted his lips and smiled when he thought about this. After which, he slowly walked forward. He curled his hand and captured the baby Fallen Heart Flame.</p><br/><p>When he was just around two meters from the skeleton, a bright, white light suddenly erupted from the interior of the white skeleton. The sudden unexpected change caused Xiao Yan to be startled. He hurriedly withdrew. When he was just about to do so, he was shocked to realize that an enormous force had caused him to remain still.</p><br/><p>Xiao Yan’s stilled body caused his expression to swiftly change. A fleeing notion was lingering within his heart. The white glow in front of him wiggled slowly before it transformed into an illusionary old human figure.</p><br/><p>The human figure had white-colored robes on. His hair was snow-white and he had an elderly face. A faint flicker flashed across both of his eyes. This illusionary human figure had just appeared when Xiao Yan sensed a kind of pressuring feeling that spread out from his heart…</p><br/><p>“Fallen Heart Flame? How unexpected… it has been subdued by someone…” The illusionary human figure glanced at Xiao Yan before he immediately spoke. His voice was filled with a feeling that was difficult to describe.</p><br/><p>Xiao Yan’s heart involuntarily felt a chill when he heard these words. He naturally knew that the illusionary human figure in front of him was a spiritual body. However, he did not expect that the other party had managed to see the Fallen Heart Flame within his body at a glance.</p><br/><p>“This little fellow was unaware that old sir is here and had rudely intruded. Please forgive me.” Xiao Yan spoke extremely courteously while thoughts swiftly flew around his heart.</p><br/><p>The illusionary human figure ignored Xiao Yan’s courtesy as his gaze stared at Xiao Yan for a moment. Finally, he beckoned with his hand.</p><br/><p>With the beckoning of the old human figure, Xiao Yan was shocked to discover that the Fallen Heart Flame within his body flew out uncontrollably before eventually landing in the other party’s hand.</p><br/><p>“Old mister, what do you mean by this?” This scene caused Xiao Yan’s heart to sink as he furiously cried out.</p><br/><p>The Fallen Heart Flame was just like an invisible long snake that lingered and moved around the old human figure’s palm. That obedient manner caused Xiao Yan’s expression to change slightly. He had clearly already completely refined the Fallen Heart Flame. How was it possible for it to be this obedient in a stranger’s hand?</p><br/><p>“Why? Are you surprised?” The old person glanced at Xiao Yan, almost like he was aware of the doubt in Xiao Yan’s heart. An unknown smile surfaced on the corner of Xiao Yan’s mouth as he faintly explained, “This is because I was the pervious owner of the Fallen Heart Flame. Although you have refined it, it still does not pose much of a resistance to me. Moreover, do you really think that you can defeat the old me in flame controlling ability?”</p><br/><p>“The previous owner?” Xiao Yan’s eyes shrank slightly upon hearing these words. He dryly laughed, “Ke ke, old mister should not tease the little me. When I was subduing the Fallen Heart Flame back then, I did not sense that it had an owner.”</p><br/><p>“You are naturally unable to sense it because I had already given it freedom when I was about to die. It is not wrong to say that it is without owner at that time.” The white-robed old man laughed.</p><br/><p>Xiao Yan swallowed a mouthful of saliva. He did not expect that he would end up meeting the previous owner of the Fallen Heart Flame in this place. If what the old man had said was true, it was likely that he had been dead for quite a number of years. At the very least, First Elder Su Qian was completely unaware of this manner.</p><br/><p>However, the thing that Xiao Yan was most worried about was whether this old fellow would take back the Fallen Heart Flame. The ‘Heavenly Flame’ was extremely important to Xiao Yan. If it were forcefully snatched from him, it would end up causing a great amount of harm to him. Hence, he would have to keep it regardless of what happen even if he had to risk his life. The white-robed old man in front of him might be an ultimate expert but the latter was ultimately just a spiritual body at this moment.. Moreover, looking at the thinness of the spirit, it seemed that he was not too strong.</p><br/><p>“Relax, I will not snatch your Fallen Heart Flame. Strictly speaking, I have long since been a dead person. My spirit has suffered all sorts of hardship during these many years. The thing that you are seeing now is but the thread of a remnant spiritual imprint. It cannot cause any harm to you.” The old man faintly explained.</p><br/><p>Xiao Yan felt somewhat embarrassed when he was about to sigh in relief upon hearing the words that targeted what he was thinking. He hurriedly smiled and said, “This senior has spoken too seriously. May I know old sir’s name?”</p><br/><p>The white-robed old man smiled. His smile possessed a pride that came from within his bones as he said, “The old me is Yao Tian Huo. Other people also called me Tian Huo zun zhe.”</p><br/><p>“Zun zhe?”</p><br/><p>Xiao Yan’s heart leaped violently upon hearing this form of address. Xiao Yan clearly understood what this suffix behind the name represented. Clearly, this mysterious white-robed old man deep within the magma was an elite Dou Zun who had shaken the continent at one time!</p><br/>\n</div>"}