{"title": "Chapter 904: Mysterious Existence", "id": 904, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-904-mysterious-existence", "volume_title": "Volume 10", "body": "<h1>Chapter 904: Mysterious Existence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 904: Mysterious Existence</u></strong></p><br/><p>Tian Huo zun-zhe was startled when he heard Xiao Yan’s words. He smiled slightly and said, “Why don’t you tell me what the condition is.”</p><br/><p>Xiao Yan stared intently at Tian Huo zun-zhe. He softly said, “I hope that old mister will protect the little me for one year if you really recover your strength.”</p><br/><p>“Protect you for one year?” Tian Huo zun-zhe was stunned when he heard this. A smile that contained a deeper meaning immediately surfaced on his face. “Little fellow, you really don’t suffer any losses. You are actually asking me to be a bodyguard for one year? You should know that an elite Dou Zun is not someone that an ordinary person can just request for help.”</p><br/><p>Xiao Yan smiled and said, “A year’s time is merely just a short while to an expert of old mister’s strength. Moreover, I am also aware that as long as mister is able to successfully repair his soul, it would not be too difficult for you to revive. I think that this is sufficient for me to hire old mister for one year, no?”</p><br/><p>“Little fellow, you really do know how to speak. It is not too much of a problem for me to protect you for one year. Of course, the precondition is that you are able to repair my spirit. With my current spirit’s strength, I won’t be able to endure for a couple of years.” Tian Huo zun-zhe mused for a moment before slowly nodding his head and replying with a solemn voice.</p><br/><p>“Old mister, you can rest assured. It is not the first time I have helped someone repair their soul. I can be considered to have some experience. Although your spirit is seriously injured, it is not impossible to repair.” Xiao Yan smiled as he responded. He had inherited quite a lot of medicinal formulas from Yao Lao. There was no lack of medicinal formulas for medicinal pills that healed one’s soul. However, the medicinal ingredients that they required were things that were quite difficult to find. One would require quite a long time in order to find them.</p><br/><p>“Hopefully, the old me is not mistaken…” Tian Huo zun-zhe looked at Xiao Yan with deep eyes. After which, he ceased hesitating. He tossed with his hand and the infant Fallen Heart Flame’s body that was in his hand drifted to Xiao Yan.</p><br/><p>Xiao Yan carefully received this Fallen Heart Flame. When he made contact with it, he could sense the weakness of this small thing. He immediately forcefully endured the joy within his heart as he swiftly took out the ‘Flame Gathering Pot’ from his Storage Ring and gently placed the flame into it.</p><br/><p>A faint warmth curled up after the Fallen Heart Flame entered the ‘Flame Gathering Pot.’ Xiao Yan could gradually feel an invisible ripple quietly spreading. Being extremely familiar with the Fallen Heart Flame, Xiao Yan naturally understood that this invisible ripple was the thing that the Blazing Sky Qi Refining Tower needed…</p><br/><p>Xiao Yan sighed as though he had just been relieved of a huge burden after having resolved the trouble of the Inner Academy. He swung his hand and stored the ‘Flame Gathering Pot’ into his Storage Ring. After which, he waved the ‘Five Ring Flame Expelling Technique’ in his hand to Tian Huo zun-zhe. He smiled and said, “The little me shall be disrespectful and accept this thing.” Xiao Yan stored the scroll into his Storage Ring after speaking.</p><br/><p>TL: It is disrespectful to simply take something especially when he has yet to earn it</p><br/><p>Tian Huo zun-zhe involuntarily shook his head helplessly upon seeing the action of Xiao Yan. He held that snow-white Storage Ring before looking to the pile of bones. He sighed, “Please also take these bones of mine. There is also some special use for the bones of an elite Dou Zun.”</p><br/><p>Xiao Yan would naturally not reject this little request of Tian Huo zun-zhe. He beckoned with his hand and a suction force surged out before he pulled the pile of bones into his Storage Ring,</p><br/><p>Xiao Yan finally patted his hand after doing all this. His gaze turned to the area outside of the light barrier. The bright red magma did not appear to have any lizard people. However, Xiao Yan, who had suffered some losses once, knew that these fellow’s figures were extremely difficult to sense in the magma. He might end up having his trace discovered the moment he went out. At this moment, Xiao Yan was unable to deal with so many lizard people. Moreover, from what Tian Huo zun-zhe had said, there seemed to be experts from the lizard race whose strength could contend against a Dou Zun. If Xiao Yan were to meet the lizard people of that class now, it was likely that he would have difficulty fleeing.</p><br/><p>“Those fire lizard people were extremely sensitive to the magma flow. Any slight movement within the magma will be discovered by them. Additionally, there is a large number of them. The more you kill, the more there will be. In the end, you will attract the truly strong ones within the tribe over. At that time… things would end up troublesome.” Tian Huo zun-zhe reminded by the side. Currently, he needed to rely on Xiao Yan to help him repair his soul. It was only natural that he would not simply just watch him be torn into pieces by those snake people.</p><br/><p>Xiao Yan nodded slightly before speaking with a frown, “Above this magma is the Jia Nan Academy. It is likely that there will be unimaginable consequences if these fellows charge up one day…”</p><br/><p>“There is no need to worry. These living creatures can only survive within the magma. If they leave the magma, they would end up just like fish left out of water and end up dying automatically.” Tian Huo zun-zhe spoke faintly.</p><br/><p>Xiao Yan only sighed in relief when he heard this. He bitterly laughed, “I wonder how these fellows were created. Nature is indeed filled with mysteries. Moreover, this place is not even the bottom of the magma. I wonder just what could exist further below…”</p><br/><p>Xiao Yan stopped abruptly when he had just spoken until this point. This was because he saw the face of Tian Huo zun-zhe by the side being covered by a horror that was difficult to hide.</p><br/><p>Tian Huo zun-zhe had his mouth open as horror surged onto his face. At this moment, Xiao Yan suddenly sensed cold air rushing from under his feet to the top of his head. Damnit… just what kind of frightening place is this? It had actually caused an expert, who had already become a Dou Zun, to reveal such an expression?</p><br/><p>The strange and unusual atmosphere lingered over this place. It was a long while later before Tian Huo zun-zhe panting sound broke the silence.</p><br/><p>“Little fellow, on the account of you helping me, I will advise you not to be curious and head down. Although I don’t know exactly what is below, I am able to vaguely sense that there is an extremely frightening existence there…” Tian Huo zun-zhe inhaled a deep breath of air, waved his hands, and slowly spoke.</p><br/><p>Xiao Yan swallowed his saliva upon seeing this solemn expression of Tian Huo zun-zhe. He hurriedly nodded. Was there some Dou Sheng class existence in the magma world below that was able to cause an elite Dou Zun to be this afraid?</p><br/><p>“I was able to vaguely sense it only at the instant my physical body crumbled. If it was some orther time, I would definitely have difficulty sensing it. Moreover, at times, I thought that this mysterious fire lizard race could be a guardian to the bottom of the magma world.” Tian Huo zun-zhe slowly added.</p><br/><p>Xiao Yan wiped off some cold sweat. This borderless magma world was becoming increasingly mysterious in his heart. Not only was it able to create two Fallen Heart Flames, but it was even able to create a strange race like the fire lizards. There was even a mysterious existence even an elite Dou Zun was afraid of below…</p><br/><p>“Looks like I should leave this place as soon as possible…” Xiao Yan muttered in his mouth as he made the decision to leave this damn magma world as soon as possible. This place really caused him to feel too much pressure.</p><br/><p>“You should recover your strength first if you wish to leave. With the Dou Qi currently within your body, it would be difficult for you to successfully reach the surface of the magma. This place is extremely safe. You need not worry about being discovered by them. You can wait until you are safe before practicing the ‘Five Ring Flame Expelling Technique.’ Your body possesses the ‘Heavenly Flame.’ If you were to use this fire control technique, its strength would definitely soar.” Tian Huo zun-zhe opened his mouth and suggested from the side.</p><br/><p>Xiao Yan nodded. After the big battle earlier, the Dou Qi within his body had been exhausted. In order to avoid being discovered by those fire lizard people, he had to be in his peak condition.</p><br/><p>With this thought flashing through his heart, Xiao Yan swiftly sat cross-legged. His hand had just formed the training seal when his heart moved. Both of his fingers shook and a red-colored bead appeared. This bead had been obtained from the interior of those fire lizard people.</p><br/><p>“Fire bead?” Tian Huo zun-zhe was startled when he saw the red bead in Xiao Yan’s hand. He immediately nodded and said, “It is unexpected that you were able to discover this treasure within the bodies of the lizard people. This thing might contain an extremely dense fire affinity energy but it is far too wild and violent. There is likely quite a great risk in consuming it.”</p><br/><p>Xiao Yan smiled. Could the fire affinity energy be even more violent than a ‘Heavenly Flame’? Being in possession of two kinds of ‘Heavenly Flame,’ Xiao Yan was able to use the most forceful method to refine and swallow them…</p><br/><p>Xiao Yan flicked his finger and the red-colored bead landed in his mouth. It was like a cluster of flame that followed Xiao Yan’s throat and entered his body. Xiao Yan’s skin had also turned fiery-red at this moment…</p><br/><p>Tian Huo zun-zhe knit his brows when he saw Xiao Yan ignore his advice and swallowed the fire bead. He immediately recalled something and laughed. Shaking his head, he said, “I forgot that you possess a ‘Heavenly Flame.’”</p><br/><p>Tian Huo zun-zhe’s eyes paused on Xiao Yan’s body. Only when the latter’s skin gradually recovered to normal did he finally nod. Both of his hands were placed behind him. He raised his head, looked at the bright red magma, and sighed. He muttered, “It is unexpected… the old me has survived to see the sun again. It seems that the heavens really do not wish to kill me…”</p><br/><p>The thing that Xiao Yan swallowed was a basic ‘Fire bead’ that could not be considered a high level. Hence, he merely spent around twenty minutes or so before completely refining the fire bead. After which, his face was filled with joy as he sensed the Dou Qi that swiftly filled his body.</p><br/><p>“It is indeed quite a good tonic. By relying on these ‘fire beads’ within the Storage Ring, I should be able to successfully reach a six star Dou Huang. However, I should hurry up and leave this place now…” Xiao Yan sighed in relief as he sensed the interior of his body being gradually filled with Dou Qi.</p><br/><p>“I will use all my strength to use spatial strength in order to hide the magma movement. You should make full use of the time. Given my current condition, I will not be able to maintain it for long…” Tian Huo zun-zhe smiled and spoke. He turned his head and watched Xiao Yan stand up.</p><br/><p>Xiao Yan nodded his head when he heard this. His heart rejoiced at not doing anything reckless because his head had become giddy at the profits. This Tian Huo zun-zhe might be in an extremely poor condition, but it was obvious that he was not without any ability to retaliate as he had claimed.</p><br/><p>Tian Huo zun-zhe moved his hand seal slightly upon seeing this. Xiao Yan placed the white-colored Storage Ring on his finger, and a blurry figure flashed and entered it. A faint ripple spread out from that Storage Ring, making the light barrier in front of Xiao Yan slowly part…</p><br/><p>The light barrier had just been split when Xiao Yan stepped forward. His body transformed into a green-colored figure. After which, he shot forth in a lightning-like manner. At the same time, a faint spatial strength spread from the white-colored Storage Ring, completely solidifying the surrounding magma ripple…</p><br/><p>The moment the light barrier parted, Xiao Yan and Tian Huo zun-zhe did not discover that a-couple-dozen-foot-wide light pillar was slightly opening at the crimson-red magma world’s bottom. It opened and closed, appearing just like a pair… of eyes.</p><br/><p>Xiao Yan’s figure quietly flew through the magma before his heart suddenly moved. His hand, that had been in his sleeve, shook and a fragmented jade appeared in it. At this moment, the ancient jade, that almost never reacted, was emitting a faint warmth…</p><br/><p>Xiao Yan’s hand gently rubbed the ancient jade. A storm rose within his heart. This was because this jade was surprisingly the heirloom of the Xiao clan… the Tuo She Ancient God Jade!</p><br/>\n</div>"}