{"title": "Chapter 900: Magmas Living Creatures", "id": 900, "volume": 9, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-900-magmas-living-creatures", "volume_title": "Volume 9", "body": "<h1>Chapter 900: Magmas Living Creatures</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 900: Magma’s Living Creatures</u></strong></p><br/><p>The hot breeze arrived suddenly. At the crucial moment, Xiao Yan displayed his somewhat frightening retaliation strength. One could see a silver glow flashing under his feet as his body twisted into a strange arc and the breeze passed by just above Xiao Yan’s shoulder. The hot wind caused a fiery pain to be transmitted from his shoulder.</p><br/><p>Xiao Yan’s body trembled after dodging the attack. He swiftly withdrew. While doing so, he turned his body around, and he looked in the direction where the wind originated. His face once again became stunned.</p><br/><p>There was an enormous ten meter red colored figure swimming within the magma. Its color was similar to that of the surrounding magma. If one did not observe carefully, it would be difficult to discover it. Moreover, the crimson body was covered with red scales, and its five-foot-long red scaly tail swung slightly. The red figure stood with both legs, but its legs were unusually large. Its head was also rounded and covered with tiny scales. A pair of tiny eyes emitted a faint fierceness. Its large mouth was parted slightly, revealing densely packed sharp teeth. From the appearance of this thing, it seemed that it was a lizard that could walk on two legs.</p><br/><p>From its outer appearance, this mysterious red-colored figure was clearly not a human. Instead, it was a kind of mysterious living being. Xiao Yan was completely unaware of just what kind of living creature it was since he had never seen anything that could live in magma in the past.</p><br/><p>Xiao Yan sighed in relief after discovering that the other party was not a human. However, he did not release the cautiousness within his heart. He had not sensed even the slightest aura during this journey. Yet, this mysterious living creature had unleashed an attack at him without him even sensing it. Clearly, it was quite strong. Moreover, the latter had the homeground advantage. If Xiao Yan did not act carefully, he might really end up failing when he least expected to.</p><br/><p>“Ji ji!”</p><br/><p>While Xiao Yan’s eyes were staring intently at the magma creature, it was also fiercely staring at him. Both parties faced each other for a moment before the fierce glow within the eyes of the magma creature suddenly surged. An ear piercing cry was emitted from its mouth. After which, it swung its tail and a sharp beast claw parted the magma, shooting straight toward Xiao Yan.</p><br/><p>“You are seeking death!”</p><br/><p>Xiao Yan’s eyes turned slightly cold as he saw the magma creature charging over once again. He suddenly waved his sleeves and a jade-green Dou Qi pillar spat out of his palm. After which, it violently smashed into the magma creature, forcing it to withdraw over ten meters. Only then did it hiss and stabilize its body. However, after being taught an initial lesson. A crimson, wild violence immediately surged into the eyes of this magma creature. It widened its large mouth that was covered with sharp teeth and the surrounding magma immediately flowed in swiftly. Finally, it transformed into a-foot-long magma ball that launched at Xiao Yan like a cannonball.</p><br/><p>“Hmph!” Killing intent surged within Xiao Yan’s heart when he saw that this thing was going to continue pestering him. He widened his palm before suddenly clenching it. One could see the magma fireball swiftly shooting over. Then, its speed was reduced before it finally turned into a pile of magma that split apart when it was still a couple of meters from Xiao Yan. It returned to the magma sea around it.</p><br/><p>The mysterious magma being became furious after seeing that Xiao Yan had once again resolved its attack. It repeatedly emitted a ‘ji ji’ sound from its large mouth before widening and closing it. Numerous head-sized magma-balls were swiftly spat out and repeatedly shot at Xiao Yan.</p><br/><p>Xiao Yan’s body flashed in a ghost-like manner as he dodged the magma-balls one at a time. When he realized that the magma being was able to spit out an unceasing number of powerful magma-balls, he frowned. The silver glow on his feet flickered and his body carried a magma ripple that appeared behind the magma being in a lightning-like manner. He curled his fingers and his hand formed a blade-like form and violently inserted it into the chest of the magma being.</p><br/><p>Although the scales of this magma being were extremely hard, Xiao Yan’s hand blade, which became sharper than a knife under the stimulation of his Dou Qi, easily penetrated its chest after a mere instant.</p><br/><p>The eyes of the magma being struggled intensely after suffering this fatal blow. A fierceness flashed appeared in its eyes. Immediately a sharp ‘ji ji’ sound was repeatedly emitted from his mouth. Finally, it spread swiftly within the magma like waves of water.</p><br/><p>The ‘ji ji’ sound continued for a moment before it gradually weakened. The life within the magma being’s eyes also swiftly scattered. Xiao Yan’s coldly looked at this gradually stiffening magma being before he slowly withdrew his hand. His feet were about to withdraw from the body of the magma being when a thought suddenly passed through his heart. He fiddled with the interior of the body with his hand. When he finally withdrew it, there was a bright-red bead in it.</p><br/><p>Xiao Yan’s hand was void of even the slightest amount of fresh blood after being withdrawn from the body of the magma being. All it had was a kind of grease. The bright-red bead flickered and emitted a faint hotness.</p><br/><p>Xiao Yan studied this bright-red bead somewhat curious. Surprise immediately flashed across his eyes. He discovered that there seemed to be a powerful fire affinity energy contained within the bead. This kind of energy was even purer than the energy that he could absorb from the magma world. Moreover, the quantity was also quite significant. Xiao Yan would have to at least train for two days in order to absorb a similar amount of energy compared to what lay within this small bead.</p><br/><p>“This should be something that is similar to the Monster Core within a Magical Beast. However, this thing is a rarely seen tonic for a person who practices fire affinity energy. Unfortunately, its energy is far too wild and violent and cannot be consumed directly. Otherwise, it would be similar to some high tier medicinal pill…” Xiao Yan’s eyes were filled with surprised. If others intended to absorb this thing, they would have to use other things to resolve the wild violence within. However, it was not too much trouble for Xiao Yan, who possessed a ‘Heavenly Flame.’ Hence, he could consume and absorb this thing. However, what caused him to feel somewhat regretful was that there was only one of this bead. The effect of it would not be too great. All he would accomplish was a loss of a couple day’s worth of training.</p><br/><p>Xiao Yan sighed regretfully. He held the bright-red bead in his hand as his gaze once again shot into that transparent light circle. However, his expression suddenly changed. His gaze was immediately thrown to the west of the bright-red magma. An intense commotion had suddenly been transmitted from that direction.</p><br/><p>Xiao Yan’s gaze stared intently at the area where the magma ripple originated. Dou Qi within his body was ready to move. His face was solemn. This magma world was indeed filled with danger…</p><br/><p>The bright-red magma swiftly rippled. A moment later, Xiao Yan’s eyes shrank abruptly. He could see a large group of red-colored figures behind the magma. They were just like a group of fish that came swarming over. Numerous eyes that contained a fierceness as well as mouths filled with large teeth caused the skin on Xiao Yan’s head to become numb. Indeed, there was not only one of the damn lizard person…</p><br/><p>Xiao Yan beckoned with his hand and the Fallen Heart Flame suspended above his head was withdrawn into his body. A powerful jade-green flame surged out of Xiao Yan. He would have difficulty escaping from those fire lizard people. Hence, he could only go all out and battle them.</p><br/><p>Within a couple of short blinks, the hundred red-colored figures flashed and rushed over before finally surrounding Xiao Yan. Their eyes were fierce and violent as they stared intently at the bright-red bead in Xiao Yan’s hand.</p><br/><p>Xiao Yan swiftly stored the bead in his Storage Ring in front of the focus of so many fire lizard eyes. It seemed that these fellows had been summoned by the lizard person from earlier just before it died. It was unexpected that there was such a large number of beings living under this magma that Xiao Yan had not noticed in the past.</p><br/><p>The jade-green flame on the surface of Xiao Yan’s body became denser while his eyes revealed a cautiousness as they slowly swept over the lizard people. These lizard people seemed to be quite afraid of the Glazed Lotus Heart Flame. Hence, they merely surrounded Xiao Yan but did not immediately charge forward to tear him into pieces.</p><br/><p>This stalemate did not last for very long before it was broken by the unwillingness of the fire lizard people. Their eyes were bright-red while a sharp ear piercing ‘ji ji’ sound was emitted from their mouths. Finally, they parted the magma and charged at Xiao Yan in a lightning-like manner.</p><br/><p>Xiao Yan’s expression changed a little as many lizard people surrounded and attacked him. His hands tightened. Sharp palm winds that carried some heat were formed as he attacked, making intense ripples within the magma. These attacks smashed precisely into the many red-colored figures that came charging over.</p><br/><p>There were many of these lizard people. Moreover, they knew how to control the strength of the magma. Even if an ordinary expert at the peak of the Dou Wang class were to be surrounded by them, they would be extremely miserable. However, they were not a large threat to Xiao Yan. Each time his palm wind shot out, a hidden force would shatter a lizard person. Hence, there were nearly twenty lizard people who had died to Xiao Yan’s hands after exchanging blows for only a couple of minutes.</p><br/><p>“Ji ji.”</p><br/><p>With an increasing number of fire lizard people being killed by Xiao Yan’s hands, the remaining lizard people finally understood just how strong the person in front of them was. However, they did not retreat because of this. Instead, more ear-piercing sonic waves began to be swiftly transmitted from their mouths.</p><br/><p>Xiao Yan’s expression changed slightly in the face of the action of these fellows. From the scene earlier, he naturally understood that these fellows were summoning their companions. With his current strength, it was indeed not too difficult to deal with over a hundred snake people. However, if there were thousands or even more of them, it was likely that the unlucky one would end up being him.</p><br/><p>Xiao Yan suddenly clenched his teeth as this thought flashed across his heart. He did not bother with the transparent light barrier anymore. His body moved and fled up. Just when his body had moved for over ten meters away, an intense ripple was transmitted from above the magma. Immediately, Xiao Yan saw red-colored figures appearing in his sight…</p><br/><p>Moreover, the thing that caused Xiao Yan’s heart to sink was that there was an exceptionally large lizard person at the front of the many red-colored figures. Even Xiao Yan felt some faint pressure when facing this lizard person. Clearly, the strength of this big fellow had far exceeded that of the ordinary lizard people…</p><br/><p>“It is troublesome this time around…”</p><br/><p>Xiao Yan could only stop his body, inhale a deep breath of air, and mutter as he watched the large group of fire lizard people heading over.</p><br/>\n</div>"}