{"title": "Chapter 906: Advancing Again", "id": 906, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-906-advancing-again", "volume_title": "Volume 10", "body": "<h1>Chapter 906: Advancing Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 906: Advancing Again</u></strong></p><br/><p>Time quietly rolled by like the sand between one’s fingers in this deadly quiet, ancient magma world. A short amount of time was unable to cause the endless magma to show even the slightest bit of activity. Time had become inconsequential in this place…</p><br/><p>A month passed by in the blink of an eye.</p><br/><p>Due to those so-called ‘fire beads,’ Xiao Yan’s progress during this one month was extremely quick. After swallowing and refining around fifty plus of them, he could clearly sense that the Dou Qi vessel within his body, that had expanded during the last advancement, was once again transmitting a swelling feeling. This situation told Xiao Yan that his current self was already at the peak of a five star Dou Huang. As long as he had an opportunity, he would be able to easily advance and breakthrough to become a six star Dou Huang!</p><br/><p>Upon reaching this stage, Xiao Yan also knew that continuing to focus and train was no longer the most optimum path. Although one cannot slack off during one’s training, one should also know that one would not be able to make it by being too anxious. Simply put, stubbornly training would cause one to go downhill. Hence, Xiao Yan ceased his consistent day and night training after he realizing that he had reached the peak of the five star Dou Huang class. Instead, he started to train the ‘Six Joint Body Flowing Ruler’ he had just achieved initial mastery in.</p><br/><p>Time slowly passed by while Xiao Yan was practicing the ruler technique. During the period that followed, Xiao Yan had placed the matter of training his Dou Qi aside. Most of his attention was placed on practicing this Dou Technique, causing him to become increasingly familiar with the ‘Six Joint Body Flowing Ruler.’ The first skill of the ruler technique ‘Splitting Flame’ was starting to displayed by him with greater smoothness and strength…</p><br/><p>The effect of focusing on a certain thing was indeed far greater than splitting one’s attention. After his great effort in training during this period of time, Xiao Yan’s understanding of the ‘Six Joint Body Flowing Ruler’ became increasingly deeper. Each time he used it, he would form a dense ruler web that even wind could not penetrate. He was already able to enter and leave the magma as he wished without even a drop of liquid magma touching him. This kind of metal container like defense was reminiscent of the spiritual imprint within the scroll.</p><br/><p>During the occasional period where Xiao Yan was free when practicing the ‘Six Joint Body Flowing Ruler,’ Xiao Yan would study a little of the so-called ‘Five Ring Flame Expelling Technique.’ This practice was an incredible eye-opener for Xiao Yan.</p><br/><p>A fire controlling technique was self explanatory. It was a method that was used to control a flame. Such a skill was something that Xiao Yan had never practiced. His usual control of the flame while attacking was on a superficial level. That controlling method was far from the sophistication of the ‘Five Ring Flame Expelling Technique.’ At the very least, just the flame controlling method alone was something that even Han Feng could not match from a certain point of view. The reason Xiao Yan had not been at a disadvantage when fighting with Han Feng using the ‘Heavenly Flames’ was mostly because of the former’s powerful Spiritual Strength that far exceeded an ordinary alchemist…</p><br/><p>Therefore, the current Xiao Yan had undoubtedly felt something like budging into a completely new territory when he came into contact with the ‘Five Ring Flame Expelling Technique.’ The various flame controlling methods that were recorded in the technique were not only beautiful but also only exhausted the smallest amount of Spiritual Strength to control the flame in the most exquisite manner. Moreover, it was able to unleash an extremely great force.</p><br/><p>Tian Huo zun-zhe did not reveal himself while Xiao Yan was practicing the ‘Five Ring Flame Expelling Technique.’ It seemed that using the spatial strength when he was in the magma had exhausted him too greatly. Hence, he seldomly revealed himself. However, Xiao Yan was unconcerned about this. Although he had made contact with such a fire controlling skill for the first time, he was at the very least a tier 6 alchemist who had relied on himself to create the overwhelmingly frightening ‘Angry Buddha Lotus Flame.’ Many flame controlling techniques were basically things that he understood upon reading. Xiao Yan’s powerful Spiritual Strength had caused him to possess a talent that an ordinary person had difficulty matching in terms of medicinal refinement and flame control.</p><br/><p>During the remaining time, Xiao Yan had, without any accident, submerged himself into the mysterious world of flame controlling with the ‘Five Ring Flame Expelling Technique.’ Within less than ten days, Xiao Yan’s ability to control flames was basically multiplying…</p><br/><p>Within this heart-shattering flame control world, Xiao Yan’s opportunity to advance had unknowingly and quietly arrived…</p><br/><p>When the feeling of being about to breakthrough appeared, Xiao Yan was practicing the first wolf-shaped fire spirit of the ‘Five Ring Flame Expelling Technique.’ After sensing the strange feeling that spread out from deep within his soul, Xiao Yan immediately scattered the hand seal and used his fastest speed to return to the cave.</p><br/><p>Xiao Yan sat cross-legged in the clean and empty cave. He forcefully endured the waves of unusual ripples that were being transmitted from his body. With a flick of his finger, over ten red-colored ‘fire beads’ appeared in front of him. After which, Xiao Yan swiftly shut his eyes and formed a training seal with his hands.</p><br/><p>The seal had just been formed when the surrounding space began to fluctuate. Waves of red-hot energy surged around Xiao Yan’s body. After which, the energy appeared like many bright-red, long snakes, lingering over the surface of his body. Finally, they followed his breathing and entered his body.</p><br/><p>This magma world was filled with an extremely powerful fire affinity energy. This would undoubtedly cause Xiao Yan’s advancement to be much easier. He did not need to worry about the energy being exhausted or causing some unexpected change during his advancement. Moreover, his Storage Ring still contained quite a few ‘fire beads. Even if an accident were to occur, the powerful energy contained in these ‘fire beads’ would ensure the successful completion of his advancement…</p><br/><p>An increasing amount of fire affinity energy entered Xiao Yan’s body. So much had entered that his skin had gradually turned bright-red. Threads of white fog rose from his head and numerous veins began to wiggle like earthworms on his skin, appearing quite terrifying.</p><br/><p>Under the unceasing energy of the outside world, Xiao Yan’s body was swiftly being transformed. Each time he advanced, the interior of his body would undergo a small transformation. This kind of transformation was just like an expansion, transforming a small pond into a small lake. The Dou Qi that his body could accommodate would also increase a couple of times. At the same time, the many veins, bones, muscles, etc. within his body would display a varying degree of strengthening, causing the power within one’s body to grow…</p><br/><p>As Xiao Yan’s advancement gradually entered a white hot stage, the ripples within the cave became even more intense. In the end, the entire cave was covered by a red fire affinity energy. Xiao Yan’s figure was just like a black hole sitting in the middle of the energy, greedily swallowing all the energy that surged toward his body…</p><br/><p>This unending swallowing continued for nearly two days. Only then did the dense red fire energy gradually pale. A young man with a naked upper body began to be revealed.</p><br/><p>Xiao Yan’s advancement continued for around three days. Only then did it slowly come to an end…</p><br/><p>When the final string fire affinity energy entere Xiao Yan’s body, the mountain cave descended into silence. The powerful aura that spread out of Xiao Yan’s body was completely withdrawn into at this moment. Not even a little of it leaked…</p><br/><p>The young man’s upper body was naked as he sat on the ground. His eyes were tightly shut, and he appeared like a meditating monk. He did not even move a little. If one could not still sense his vague aura, it was likely that one would really think that an accident had occurred during the advancement, resulting in a deviation of training from the correct path.</p><br/><p>The quiet atmosphere within the cave continued for around half an hour or so when a soft breathe finally broke the silence.</p><br/><p>Calm breathing entered and left Xiao Yan’s nose in a cycle. His eyes slowly opened, but did not seem to reflect any changes besides being a little brighter. However, if someone familiar with Xiao Yan was present, that person would discover that Xiao Yan aura seemed to have become much hotter and more drawn out compared to before.</p><br/><p>Xiao Yan waved his hand as he opened his eyes, storing the ‘fire beads’ in front of him, that he had prepared but had not ended up using, into his Storage Ring. After which, he sensed the powerful aura that had soared a couple of times within his body. A satisfied smile was lifted on the corner of his mouth.</p><br/><p>The advancement this time around had not only allowed Xiao Yan to completely stabilize at the six star Dou Huang leve, but had also caused the Dou Qi within his body to become a little hotter. Xiao Yan understood that this should be due to the energy of this place. However, it was fortunate that he had the protection of the ‘Heavenly Flames.’ Thus, the wild violence did not affect Xiao Yan.</p><br/><p>“The feeling of advancement is really wonderful…”</p><br/><p>Xiao Yan spread his hands as he stood at the entrance of the cave. He laughed softly. At this moment, the veins, muscles, bones, and even his cells within his body all seemed to be in peak condition. As long as his hand moved slightly, the strength that was waiting to erupt within his body would suddenly erupt like a volcano.</p><br/><p>Within two short months, Xiao Yan had once again completed a breakthrough. If word of this speed were to spread, it would likely cause quite a number of elite Dou Huangs to die of embarassment. At this level, it was common for an elite Dou Huang to spend a year or even a couple of years in order to raise their strength by one star. Yet, Xiao Yan had completed this within two months. This kind of talent and luck was really stunning.</p><br/><p>Xiao Yan randomly clenched his hand as he sensed the fierce force that would erupt at any moment. He used a great force and swung his fist toward the rock wall. The enormous strength penetrated the tough rock as the Dou Qi spat out formed a deep hole that was over ten meters deep. The surrounding wall revealed a slight crack while some rock dust spread. Clearly, Xiao Yan’s control over his strength had already improved compared to before. It was gathered on one spot and not spread out, causing his blow to possess even greater strength and speed. Xiao Yan smiled. The corner of his mouth revealed an arc. He was just about to test his strength when his brows suddenly lifted. His eyes glanced to the hole that headed to the Blazing Sky Qi Refining Tower. There seemed to be the sound of rushing wind appearing there.</p><br/><p>Under Xiao Yan’s focus, the rushing wind sound in the hole came increasingly closer. A moment later, a figure appeared in front of Xiao Yan’s eyes.</p><br/>\n</div>"}