{"title": "Chapter 918: Exchanging Blows Again", "id": 918, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-918-exchanging-blows-again", "volume_title": "Volume 10", "body": "<h1>Chapter 918: Exchanging Blows Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 918: Exchanging Blows Again</u></strong></p><br/><p>The sudden change that occurred in the sky caused everyone to be stunned. Numerous eyes stared at Han Feng’s hand as he slowly withdrew it from Protector Tie’s body. Their hearts involuntarily chilled when they saw the savage smile on his face. This fellow… his heart was really vicious. He was actually able to act against his companion without any hesitation.</p><br/><p>This vicious tactics of Han Feng shocked quite a number of people. The dislike of him within many people's hearts also became greater. This included Old Ying Shan. Although he was not considered a good person, he would still not do something as shameless as attack his companions. Moreover, if Han Feng was able to attack Protector Xuan without any scruple, it was likely that Han Feng could decide to attack Old Ying Shan without feeling the slightest burden.</p><br/><p>Han Feng was unaware of the thoughts within everyone’s heart. At this moment, Protector Xuan’s spirit gradually became illusionary after having lost his body because of Han Feng’s unexpected murderous act.</p><br/><p>Han Feng indifferently looked at this spirit that had become illusionary and the corner of his mouth was lifted into a savage greedy smile. He widened his mouth and black fog agglomerated within his mouth. It immediately transformed into a strange black spiral. The suction force surged as he swallowed Protector Xuan’s spirit…</p><br/><p>Han Feng’s body immediately trembled after Protector Xuan’s spirit entered his body. A wildly violent yet majestic aura swept from his body like a tornado. The surrounding air fled under the pressure of such an aura.</p><br/><p>A black fog that was so dense that it could almost cover one’s mind surged out of Han Feng’s body. While his aura surged, Han Feng’s size also clearly expanded by two circles. There were even some bubbles that were formed by energy and began to revoltingly pulse on his skin. Clearly, Han Feng had obtained an extremely great Spiritual Strength after swallowing Protector Xuan’s spirit but the power of this strength was something that he had difficulty controlling. It was due to this lack of control did these energy bubbles form…</p><br/><p>Han Fen never hesitated when he attacked and killed Protector Xuan, nor did he hesitate when he swallowed of his spirit. His actions were extremely smooth and natural. Hence, by the time everyone recovered, they sensed the majestic aura that surged out of Han Feng’s body…</p><br/><p>The strength of this aura was something that even the Little Fairy Doctor was inferior to. According to her estimation, the strength of the current Han Feng should have already reached the peak of a five star Dou Zong. He was one level higher when compared to the Little Fairy Doctor.</p><br/><p>Xiao Yan’s brows knit as he sensed the spreading aura from Han Feng’s body. This kind of disgusting scene of swallowing a soul was not something that he had seen for the first time. It seemed that most of the people from the ‘Hall of Souls’ knew this skill, a skill that caused one to feel incomparably disgusted. Relying on swallowing the spirit of a companion to strengthen one’s own strength might result in quite a severe sequelae in the future, but they would at least be able to obtain a temporary strength for a certain amount of time.</p><br/><p>“I will deal with him…” The grayish-purple eyes of the Little Fairy Doctor stared at Han Feng. She felt his rising aura and softly spoke.</p><br/><p>“Together… help me buy some time.” Xiao Yan gently exhaled as he replied in a deep voice.</p><br/><p>“Ah, although there might be some difficulty defeating him in his current condition, I am absolutely confident that I can delay him.” The Little Fairy Doctor smiled sweetly and nodded.</p><br/><p>“Try you best not to undo the seal of the ‘Woeful Poison Body’...” Xiao Yan glanced at the moving smile on the Little Fairy Doctor before sighing softly.</p><br/><p>The Little Fairy Doctor was slightly startled as she softly replied, “I’ll try my best. However, the opponent we face this time is not weak. It will be quite troublesome to deal with them if I don’t undo the seal.”</p><br/><p>Xiao Yan bitterly laughed upon hearing her reply. He said, “The reason I asked you to follow beside me was to help you control the ‘Woeful Poison Body.’ Instead, the time until your ‘Woeful Poison Body’ erupts is growing closer… if any sudden situation were to occur and something happened to you, how do you expect me to have a peace of mind?”</p><br/><p>The Little Fairy Doctor gently smiled. She said, “Although this period of time is filled with danger, I have been far happier than when I was alone in the Chu Yun Empire. Hence, if anything were to happen, it is because I have a terrible fate. It has nothing to do with you…”</p><br/><p>“Do you think that I will think this way?” Xiao Yan helplessly shook his head as he replied.</p><br/><p>The Little Fairy Doctor covered her small mouth, and her long eyelashes came together. She blinked as she laughed in spite of herself and said, “It seems that you won’t…”</p><br/><p>“Is your flirting over? If it is, you can all prepare to die.” A cold voice that contained an incomparable killing intent suddenly sounded, interrupting the conversation between Xiao Yan and the Little Fairy Doctor. Their eyes slide to Han Feng, who was suspended in the sky covered in a black fog…</p><br/><p>At this moment, it seemed that Han Feng had already absorbed Protector Xuan’s Spiritual Strength. This caused his strength to leap forward for a short period of time. As he sensed the powerful energy flowing within his body, the slight fear he felt for the Little Fairy Doctor completely vanished. A dense killing intent that was difficult to extinguish replaced it.</p><br/><p>Han Feng was suspended in the sky. Under the cover of the surrounding black fog that traveled in all directions, he appeared just like a demon that had climbed from hell, filled with evil and a dark, cold aura…</p><br/><p>The Little Fairy Doctor took a couple of steps as she walked through the empty air. Waves of majestic gray-colored Dou Qi poured out of her body like floodwater after she slowly took a couple of steps forward. Her Dou Qi then lingered around her body. Traces of a stench vaguely appeared. The extremely strong corrosive properties contained within the Dou Qi caused even the air to transmit waves of unusual acidity.</p><br/><p>Xiao Yan gently exhaled as he looked at the Little Fairy Doctor, who had stepped forward. His eyes revealed his indifference as he glanced at Han Feng. After which, Xiao Yan slowly stepped back. The Green Lotus Core Flame, Fallen Heart Flame, and even the Bone Chilling Flame… quietly appeared as he stepped back…</p><br/><p>“Hmph!”</p><br/><p>Han Feng understood what Xiao Yan was planning to do after seeing the three ‘Heavenly Flames’ around him. He immediately let out a cold snort. The snort was wrapped by powerful Dou Qi and swiftly spread out. The air fluctuated slightly wherever it passed.</p><br/><p>A cold indifference flashed across the Little Fairy Doctor’s grayish-purples eyes. She waved her delicate hand, and the surging gray-colored Dou Qi lingering around her moved with a whistle, forming an enormous Dou Qi light curtain appeared in front of her.</p><br/><p>The sonic wave continued on before finally colliding against the Dou Qi light curtain with a bang, causing ripples to rise on the surface.</p><br/><p>“Chi!”</p><br/><p>The sonic wave suddenly smashed into the light curtain. However, it did not shatter the light curtain. This was merely a probing attack by Han Feng. He clenched his hand one again, and the black fog around him swiftly gathered, transforming into an enormous hundred-foot-tall longsword. Sharp miserable screeches were repeatedly transmitted from the longsword. A faint spiritual finger emanated from all over the sword’s body.</p><br/><p>“Go.”</p><br/><p>Han Feng’s gaze was filled with a stern killing intent. He flicked his finger and a cold cry was transmitted from his mouth. The enormous fog longsword trembled before gradually turning illusionary…</p><br/><p>A solemness flashed in the Little Fairy Doctor’s eyes as she watched the unusual longsword. She could clearly sense just what kind of frightening energy was contained in the black sword. Dou Qi and Spiritual Strength mixed with one another. The strength that was formed from their mixture was far stronger than ordinary Dou Qi.</p><br/><p>The Little Fairy Doctor inhaled a deep breath. Her long hands suddenly formed seals. Immediately, waves of deep-grayish Dou Qi began to spurt from her body like a fountain.</p><br/><p>“Sky Corrosive Rain!”</p><br/><p>The Dou Qi flew into the sky and swiftly agglomerated into a gray-colored cloud layer. Soon deep-gray colored rain scattered down from above in all directions. This gray-colored liquid body might appear to be without any energy, but a sharp-eyed person would be able to notice an extremely faint black scar appear in the air where the rain droplet fell…</p><br/><p>These rain droplets that contained a lethal poison did not land on the ground. When they had descended a certain distance, they would suddenly scatter before transforming into a poison gas that rose and reentered the gray cloud. After which, they once again transformed into a raindrop and scattered down. This cycle repeated endlessly…</p><br/><p>Xi! Xi!</p><br/><p>The densely packed deep-gray raindrops fell from the sky as a black figure broke through the air and appeared in the rain. Its sharp sword aura shot toward the Little Fairy Doctor.</p><br/><p>However, the moment the enormous black-colored longsword revealed itself, the countless raindrops seemed to be pulled by a suction force as they shot toward it from all directions. The black fog on the longsword’s surface emitted waves of ‘Chi Chi’ sounds as it gradually became fainter. Its penetrating speed had also become much slowly, appearing as though it had been inserted into an extremely deep quagmire.</p><br/><p>Han Feng in the distance frowned when he saw that the black fog longsword appeared to have difficulty progressing even an inch within the rain. The Little Fairy Doctor’s tactics were strange. This kind of potent poison strength could even corrode Dou Qi…</p><br/><p>“It might have been difficult for me to defeat you in the past. Now, however…”</p><br/><p>“Spiritual Chant!”</p><br/><p>A cold smile surfaced on Han Feng’s face. His hand suddenly changed and an extremely powerful Spiritual Strength surged from between his brows!</p><br/><p>Hum!</p><br/><p>The black fog longsword trembled intensely while the Spiritual Strength flowed. Immediately, a strange sonic wave spread out from within it…</p><br/><p>The Little Fairy Doctor’s body trembled slightly as the sonic wave entered her ear. The waves of piercing pain that were transmitted from within her spirit caused her expression to change. This black fog longsword was able to attack one’s spirit?</p><br/><p>An emptiness appeared within the Little Fairy Doctor’s grayish-purple eyes as her spirit was damaged. The black fog longsword grabbed this opening and transformed into black-colored lightning that broke through the rain’s restriction. It carried a sharp force as it viciously shot toward the Little Fairy Doctor’s vital point, her throat.</p><br/><p>The sharp wind produced a tiny blood trace on the Little Fairy Doctor’s long snow-white neck. However, at this instant, the emptiness within the Little Fairy Doctor’s eyes suddenly disappeared. Her originally grayish-purple eyes were instantly transformed into different colored eyes that were pure-purple and pure-gray respectively…</p><br/><p>At this moment, the seal of the ‘Woeful Poison Body’ was once again activated...</p><br/>\n</div>"}