{"title": "Chapter 919: Fire Lotus, Kill!", "id": 919, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-919-fire-lotus-kill", "volume_title": "Volume 10", "body": "<h1>Chapter 919: Fire Lotus, Kill!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 919: Fire Lotus, Kill!</u></strong></p><br/><p>The space in front of the Little Fairy Doctor had strangely become much more distorted with the transformation of her eyes. The speed of the black-colored longsword, that seemed to have shot over like lightning, slowed again when it entered the distorted space!</p><br/><p>“Sky Sinister Poison Hand!”</p><br/><p>A voice that was void of any emotion was softly spat out from the Little Fairy Doctor’s mouth. Immediately, a grayish-purple majestic Dou Qi surged out of her body. It instantly formed two enormous Dou Qi hands. These Dou Qi hands were extended and immediately grabbed the black fog longsword.</p><br/><p>The enormous black fog sword had difficulty penetrating further after facing such resistance. However, the sharp, dark, cold sword aura at its tip caused the Little Fairy Doctor’s skin to emit waves of piercing pain. After having swallowed Protector Xuan’s spirit, Han Feng’s strength was greater than hers. It was naturally no longer as relaxing as it was in the past to block him. After all, each star level within the Dou Zong class was an enormous gap. It was quite difficult to leap across it.</p><br/><p>The grayish-purple Dou Qi hands and the black fog longsword descended into a stalemate. A moment later, a cold glint flickered through the Little Fairy Doctor’s eyes. The seal on her hand suddenly changed and a soft cry was spat from her mouth!</p><br/><p>The cry had just sounded when the large Dou Qi hands expanded. Immediately, one of them grabbed the tip of the sword while the other grabbed its hilt. The grayish-purple Dou Qi, which was extremely corrosive, swiftly surrounded the sword. After which, the sword suddenly snapped.</p><br/><p>“Crack!”</p><br/><p>A clear sound resounded over the sky. One could see that the enormous black fog longsword had been broken into two by the Little Fairy Doctor. The Dou Qi and Spiritual Strength contained within it was swiftly corroded by the grayish-purple Dou Qi…</p><br/><p>“Hmph!”</p><br/><p>Han Feng’s body also shook when the black fog longsword was brutally destroyed by the Little Fairy Doctor. His throat emitted a faint voice as he laughed in a dark manner, “One really could not tell that a woman like you would possess such powerful tactics. However, despite having destroyed my spirit sword, it is likely that the spirit glow on it has given you a hard time, right?:”</p><br/><p>The Little Fairy Doctor’s face was cold and indifferent. She ignored Han Feng’s words. Her delicate hands that were forming a seal trembled gently a couple of times. The unusual spirit sword glow had mostly ignored her Dou Qi defenses, and had instead attacked her spirit. Had she not been an elite Dou Zong and had not possessed great Spiritual Strength, it was likely that she would have suffered a serious injury this time around.</p><br/><p>Dou Qi slowly rotated on the Little Fairy Doctor’s hand. The piercing pain and numbness gradually paled. Her eyes glanced at Xiao Yan, who was putting all his attention on merging the fire lotus. Finally, she sighed in relief after sensing that the fire lotus within Xiao Yan’s hand was agglomerating into an embryonic form.</p><br/><p>At this moment, Han Feng had similarly sensed the frightening energy ripple spreading from Xiao Yan’s hands. His expression changed slightly. With a slight movement of his body, he instantly disappeared from where he had been before. He appeared again not too far away from Xiao Yan. However, before he could advance again, a graceful figure appeared in front of him like maggots in the tarsal bones. She swung her sharp grayish-purple fingernails. They gently cut through the sky as they pierced toward his chest.</p><br/><p>Han Feng’s heart became furious after his body was blocked. His footstep gently stepped aside, dodging the Little Fairy Doctor’s attack. Instantly, his figure flashed and once again rushed toward Xiao Yan without giving up. However, he had only taken a couple of steps when the Little Fairy Doctor once again appeared in front of him. This continued a couple of times, causing Han Feng’s face to be filled with a greenish color. He let out a cold cry and powerful Dou Qi surged out, traveling in all directions. The wind from his fist sounded like thunder strikes as it formed a dark, cold hurricane that swept toward the Little Fairy Doctor.</p><br/><p>The Little Fairy Doctor did not dare slight Han Feng’s furious attack. The Dou Qi within her body was circulated to its maximum speed. Undoing the seal of the ‘Woeful Poison Body’ had also caused the poison within her Dou Qi to become even more potent. This poison was what Han Feng was most afraid of. Hence, he had not dared to attempt anything risky during these exchanges despite having gained the upper hand.</p><br/><p>Two blurry figures crossed each other in a lightning-like manner in the sky. An ordinary expert could not even see the figures of these two. Only those with sharp eyes could use the help of the ripples being created to lock onto the two figures.</p><br/><p>Su Qian and Old Ying Shan faced each other from a distance not far below the battleground of the Little Fairy Doctor and Han Feng. They did not use their full strength in their occasional exchanges because Old Ying Shan already had a retreating notion within his heart. He knew that the so called union today was most likely going to fail. Moreover, Xiao Yan’s group clearly had a grudge that was difficult to resolve with Han Feng. All that he was after, on the other hand, was the Bodhisattva Body Transformation Saliva. He did not wish to participate in all the problematic matters between the others. Hence, he did not reveal any ability when fighting with Su Qian. Su Qian understood this point. In any case, his aim was to delay Old Ying Shan and prevent him from intervening in the battle above. Since Old Ying Shan was happy to delay time, Su Qian would naturally not object…</p><br/><p>If Han Feng were to know that the helper he had spent great effort to invite was playing such a trick at this critical time, it was likely that he would be so furious that his Dou Qi would not even be able to flow properly.</p><br/><p>The open ground was completely silent. At this moment, the experts invited by both sides did not fight because they knew that the true battleground was above… They were only here for support and not actual use. Although the many experts present would be able to pose some threat to a Dou Zong if they were to join hands, they were not foolish enough to do something that required them to risk their lives and offend an elite Dou Zong for no reason.</p><br/><p>Today’s matter was a grudge between Xiao Gate and the Demon Flame Valley, Xiao Yan and Han Feng. These experts did not wish to get involved with this matter… after all, if they were to stand on the wrong side, they would end up suffering in the future. Hence, remaining neutral at this moment and not helping either side was the most appropriate choice.</p><br/><p>Quite a number of people quietly wiped off some cold perspiration as they watched the shocking momentum of the battle in the sky. The fight between experts of the Dou Zong class was indeed dazzling. This kind of majestic strength where one could shake space with the raise of one’s hand was the level that a countless number of people pursued.</p><br/><p>“Bang!”</p><br/><p>An intense energy explosion resounded through the sky with a ‘bang.’ Enormous Dou Qi fireworks accompanied the powerful ripple-like hurricane as it spread out. The two crossing figures also quickly withdrew with heavy footsteps.</p><br/><p>The Little Fairy Doctor’s feet ruthlessly stomped on empty air. Each time her foot landed, the air would emit some waves. This continued for over a dozen steps before the Little Fairy Doctor finally stabilized her body. She gently inhaled and exhaled a couple of times, wiped off a thread of blood on the corner of her mouth, and raised her head. Her gaze was icy-cold as she glared at Han Feng on the opposite side with his sleeves shattered.</p><br/><p>Compared to the Little Fairy Doctor, Han Feng’s appearance was a little miserable. On the whole, however, his injuries were much lighter than the Little Fairy Doctor’s wounds after the earlier stunning battle. His strength had already exceeded the Little Fairy Doctor after having swallowed Protector Xuan’s spirit.</p><br/><p>The Little Fairy Doctor’s breathing slowly calmed. A cold smile gradually surfaced on her face. She could sense an unusually wild and violent, frighteningly hot energy agglomerating not far behind her…</p><br/><p>Shifting her eyes slightly, she could see that Xiao Yan was flapping his bone wings to remain suspended in the air not far behind her. A three colored fire lotus slowly rotated above his palm.The space surrounding it formed threads of spatial cracks as this little thing rotated…</p><br/><p>Xiao Yan nodded to the Little Fairy Doctor after seeing her catching her eyes. His mouth gently moved.</p><br/><p>The Little Fairy Doctor’s eyes blinked as she absorbed the sound transmitted from Xiao Yan to her ear. She immediately nodded without anyone noticing.</p><br/><p>“Dammit!”</p><br/><p>Han Feng had also sensed when the fire lotus in Xiao Yan’s hand was formed. His expression instantly became much uglier as his heart violently cursed.</p><br/><p>Cursing was one thing, but Han Feng’s actions were not the least bit slow. He clearly understood just how frightening this fire lotus, merged from three kinds of ‘Heavenly Flames,’ was. He did not dare to slight it. Dark-black fog surged out of his body in all directions. In merely a short moment, it formed a black cloud that covered the sky. The thick, black fog emitted a chillness that caused one to feel extremely pressured.</p><br/><p>The black fog covered the sky. It emitted a tidal-wave-like cold feeling. Waves swept continuously as though there was no end to it. This black fog sea was formed from all of the Dou Qi within Han Feng’s body, and possessed an extraordinary might…</p><br/><p>A cold smile flowed over Xiao Yan’s face as he watched the black fog that covered the sky. He gently waved his sleeves and the three color fire lotus left his palm. With a flick of his finger, it swiftly shot toward the black fog…</p><br/><p>The Little Fairy Doctor’s eyes stared intently at the fire lotus that shot over. She suddenly bit the tip of her tongue when it passed by her head. A mouthful of fresh blood, that contained a hint of purple, was spat out before it adhered to a part of the fire lotus…</p><br/><p>“Hurry and withdraw!”</p><br/><p>Xiao Li’s heart was shocked when he saw the fire lotus in Xiao Yan’s hand fly out. He immediately pulled at Zi Yan beside him and hurriedly withdrew… he knew just how terrifying the strength of the fire lotus was.</p><br/><p>Su Mei and the others were startled upon hearing Xiao Li’s cry. They did not hesitate as all of them hurriedly withdrew out of the valley like rabbits. Some of the experts and faction leaders in the open ground also followed. However, some of the more cautious people hesitated and refused to follow, afraid they might fall for a trap…</p><br/><p>Xiao Li’s group had just rushed out of the valley when the three colored fire lotus in the sky, carrying a gorgeous fire tail, charged into the cold fog that permeated the sky…</p><br/><p>“Bang!”</p><br/><p>The silence continued for a moment after the fire lotus rushed into the black fog region. After which, a soul-stirring explosion suddenly resounded from the black fog. A frightening fire wave, a thousand feet tall, suddenly spread out of the black fog.</p><br/><p>The entire valley began to shake from the spreading remnant fire wave. Enormous crack lines began to climb out like spiderwebs as huge rocks fell with loud bangs. The entire valley that had built from Black Metal Rock suddenly collapsed.</p><br/><p>Upon seeing this scene, the expressions of the many experts who had not left earlier instantly turned white…</p><br/>\n</div>"}