{"title": "Chapter 934: Pill Formed", "id": 934, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-934-pill-formed", "volume_title": "Volume 10", "body": "<h1>Chapter 934: Pill Formed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 934: Pill Formed</u></strong></p><br/><p>With the expulsion of the pressure within the blood liquid, the medicinal strength of the Dragon Blood Ganoderma and the other medicinal ingredients was finally released. After which, they steadily interacted with the majestic force within the blood and began a slow merger. A powerful strength repeatedly flowed within…</p><br/><p>By borrowing Zi Yan’s strength, Xiao Yan barely passed this roadblock. Although it was filled with danger, Xiao Yan was not completely without gain. Currently, the strength contained within this cluster of medicinal liquid was quite strong. After all, not only did it contain a drop of Magical Beast blood within it, but it also possessed a drop of essence blood from Zi Yan. Although Xiao Yan did not know exactly what kind of Magical Beast Zi Yan was, she was definitely an extraordinary from the way it was able to suppress the powerful pressure. If this pill refinement succeeded, it was likely that this Heaven Soul Blood Bone Pill would be the highest grade Secret Technique that the Snake-People Race had ever used…</p><br/><p>After helping Xiao Yan settle the pressure issue, Zi Yan did not remain and disturb him. She glanced at the churning medicinal liquid in the medicinal cauldron with envy before smacking her mouth. Her body moved and she rushed out of the area where the rock platform was located.</p><br/><p>Su Qian and the others only sighed in relief when they saw Zi Yan coming out. They were naturally able to tell that this little girl had lent a big helping hand to Xiao Yan earlier.</p><br/><p>“Currently, the problem has been resolved. It is likely that the subsequent refining is only a problem of time, right? Ke ke, if this little fellow is able to refine a tier 7 medicinal pill on the first attempt, he will really be somewhat incredible. According to what I know, there is a great chance of failure even when some tier 7 alchemists refine a tier 7 medicinal pill.” Su Qian laughed while fondling his beard. He looked at Xiao Yan on the rock platform, whose expression had once again become solemn.</p><br/><p>The many Elders around, who shared the same thoughts, also smiled and nodded when they heard Su Qian’s words. A tier 7 medicinal pill belonged to the legendary level to them. Forget about consuming one. The number of times that they had seen such a pill with their own eyes in their lifetime could be counted with one’s fingers. After all, it had been many years since an alchemist who had the ability to refine a tier 7 medicinal pill had appeared within the ‘Black-Corner Region.’ Even Han Feng back then had never successfully refined a tier 7 medicinal pill…</p><br/><p>While everyone was heaving a sigh of relief, Xiao Yan’s mind was once again focused on the interior of the medicinal cauldron. His Spiritual Strength was poured into it, processing information about the flame temperature and the various reactions of the different medicinal liquids during the merger.</p><br/><p>The jade-green flame wrapped around a half-fist-sized cluster of medicinal liquid within the cauldron. This cluster of liquid was somewhat colorful. On a whole, most of it was a bright-red color. However, that bright-red color contained quite a number of energies that possessed various colors that were slowly being merged…</p><br/><p>Xiao Yan sighed in relief as his Spiritual Strength sensed the calmness in the cluster of liquid. After the earlier unexpected change, the situation now had become much more stable. From the looks of it, he would be able to agglomerate it into a medicinal pill embryo after all the medicinal strength within it had completely merged.</p><br/><p>Of course, this was a slow process. Xiao Yan expected that the time needed for this merger would be at least five days…</p><br/><p>Xiao Yan inhaled a slow breath in his heart. His eyes were slowly shut as he split some attention to circulate the Flame Mantra and absorb the surrounding natural energy. His Spiritual Strength continued to linger within the medicinal cauldron, controlling the flame temperature as well as the merger between the various medicinal strengths…</p><br/><p>All that he needed to do, at this moment, was quietly wait.</p><br/><p>The wait took a total of six days.</p><br/><p>During these six days, the human crowd that had gathered within the Inner Academy had gradually scattered. However, everyone’s gaze would involuntarily be thrown to the rock platform everyday when they woke up. They would look at the unmoving rock-like figure and would feel some respect.</p><br/><p>Almost everyone had gotten used to the scene on the rock platform during the six days. They were uncertain just how long Xiao Yan needed for this kind of pill refinement. However, they would involuntarily click their tongue after personally witnessing this pill refinement. No wonder a tier 7 medicinal pill was so precious. It was unexpected that the refinement alone was so troublesome and complicated. A lot of time and effort would have to be spent. The alchemist would even have to gamble his own life…</p><br/><p>Su Qian, the Little Fairy Doctor, and the others would habitually and frequently wait for a period of time in the sky during these six days. Only after seeing that Xiao Yan did not show any activity did they slowly left.</p><br/><p>Xiao Yan’s aura during these couple of days had also gradually become one that was vaguely present. Even his breathing had become extremely faint. He appeared just like an old monk who was about to die in a sitting posture. His aura was fleeting and difficult to pinpoint. If not for Su Qian’s extraordinary experience, which allowed him determine that Xiao Yan was in a mysterious and profound condition, it was likely that he would have been worried that some trouble had occurred during the pill refinement…</p><br/><p>Although Xiao Yan had fallen into a silence like a meditating old monk, the interior of the medicinal cauldron seemed to be like a ground flame, that had been started by lightning from the sky, as it emitted repeated banging sounds. An extremely frightening Spiritual Strength whistled and lingered within. Under this Spiritual Strength, even the Glazed Lotus Core Flame could only obediently allow itself to be ordered around…</p><br/><p>If some high tier alchemist were to be present at this moment to witness the appearance of Xiao Yan, it was likely that they would be extremely stunned. This was because the condition that Xiao Yan was currently in was called the ‘Pill Spirit Realm’ in the alchemist world. Within this kind of mysterious condition, one’s Spiritual Strength would be magnified without limit. In front of this short-lived but extremely frightening Spiritual Strength, the pill refinement would not possess even the slightest chance of failure. In other words, as long as one entered this condition, this pill refinement would definitely succeed!</p><br/><p>Unfortunately, this kind of condition was something that one could only encounter by chance and not something that one could obtain by wishing for it. Encountering it entirely depended on one’s luck. Clearly, Xiao Yan had been blessed by the Heavens this time around…</p><br/><p>Six days slowly passed. When the seventh morning arrived, a thread of sunlight broke over the land. It shot over from the sea of trees in the distance before shining on the rock platform, wrapping around the black-robed, young man.</p><br/><p>Under this warm sunlight, Xiao Yan, who had shut his eyes tightly for six days, trembled a little before slowly opening them.</p><br/><p>His dark-black eyes reflected the shining sunlight that caused people to feel dizzy. His eyes contained a powerful strength along with a layer of fog. It seemed that he had advanced by a level. Moreover, a quiet aura slowly spread from Xiao Yan’s body like an awakened lion. This aura was actually much purer compared to six days ago. If Xiao Yan was at the initial stage of a six star Dou Haung in the past, the current him was standing at the peak of a six star Dou Huang. Breaking through to the seventh star was within reach…</p><br/><p>This pill refinement was really beneficial to Xiao Yan.</p><br/><p>Xiao Yan was also slightly startled when he sensed the aura that spread out of his body. A deep thought flashed across his eyes. Clearly, he did not expect himself to undergo such a great change. During these couple of days, he had indeed been in a kind of mysterious and profound condition. In that condition, his Spiritual Strength seemed to have undergone the greatest transformation. The extremely complex medicinal strength merger within the medicinal cauldron was not only agglomerated by him, but there had not been the least bit of unnecessary exhaustion in the process.</p><br/><p>Based on common sense, the chances of successfully refining the Heaven Soul Blood Bone Pill this time around would not have been very high because the pill contained the additional medicinal strength of a Dragon Blood Ganoderma and also a drop of Zi Yan’s essence blood. Thus, it no longer completely adhered to the method in the medicinal formula. It should be known that even if an inconspicuous medicinal ingredient from the medicinal formula was missing, there was a chance of it causing the pill refinement to fail. After all, each medicinal formula was successful after a countless number of attempts by the predecessors. One could just imagine the difficulty the later generation would face by attempting to change it out of the blue…</p><br/><p>If Xiao Yan had not luckily enter that kind of mysterious and profound condition where his Spiritual Strength had been limitlessly magnified, it was likely that even if Xiao Yan could not have forcefully formed a medicinal pill embryo, he would definitely have failed at the last step. It must be said that he was extremely lucky to be able to succeed by such an unbelievable opportunity…</p><br/><p>Xiao Yan’s gaze slowly slide toward the medicinal cauldron. He looked at the purple-red-colored embryonic medicinal pill that was wrapped within the flame. A smile of having been relieved of a great burden also surfaced on Xiao Yan’s face.</p><br/><p>The embryonic medicinal pill was around the size of a dragon’s eye. Its entire body was purple-red in color. Its surface was filled with potholes, giving it an ugly appearance. However, Xiao Yan could sense the majestic medicinal strength within it. This kind of strength had the mysterious effect of improving a person’s training talent.</p><br/><p>It was commonly known that one’s training talent came during one’s birth. It was extremely difficult to raise it. However, this so-called Heaven Soul Blood Bone Pill was able to improve it. Just this point made it worthy of its tier 7 name…</p><br/><p>The embryonic medicinal pill had already been formed. Next was the final pill brewing step. This step was completely without any risk after Xiao Yan had entered that kind of ‘Pill Spirit Realm’ condition because all of the medicinal strength had already been perfectly merged when the embryonic pill was formed. In other words, even if Xiao Yan did not perform this last step, this embryonic medicinal pill’s effect would not be any different…</p><br/><p>Of course, being an alchemist, Xiao Yan would naturally pursue perfection. Hence, he did not skip the final step. He maneuvered his strength and repeatedly suppressed the medicinal pill. The jade-green flame that lingered around it slowly weakened. It emitted a faint warmth that slowly seeped into the embryonic medicinal pill. The pungent fragrance that was emitted by the medicinal pill was sufficient to cause one’s heart to be stirred…</p><br/><p>The final pill brewing step did not last for too long. Around ten hours later, the embryonic medicinal pill that was filled with potholes had transformed into a thumb-sized pill. The ugly potholes on the surface had quietly disappeared. A red and a purple color covered the outer shell of the sleek, round medicinal pill, causing one to be fond of it. At this moment, even the most ignorant farmer knew that this medicinal pill was extraordinary.</p><br/><p>The purple and red colors were just like a Yin Yang fish as they outlined the surface of the medicinal pill. At a glance, it seemed to possess some intelligence and was extremely mysterious. The faint clear fragrance around the medicinal pill braced one’s attention each time one sniffed it.</p><br/><p>The moment the medicinal pill was about to be formed, the sky within the Inner Academy suddenly and swiftly became dark. Layers of dark clouds swiftly agglomerated in the sky. One could see silver-colored lightning within the dark clouds, swimming like silver snakes.</p><br/><p>This scene that had suddenly appeared in the sky caused everyone in the academy to stop. They looked at the dark murky clouds in the sky. An instant later, they appeared to share the same thought as their eyes suddenly turned to the direction where the rock platform was located. At this moment, a black figure was standing with his hands behind his back at that spot. His gaze was studying the unusual change in the sky with neither shock nor fear…</p><br/><p>“A tier 7 medicinal pill… is it about to be born? Big brother Xiao Yan… he actually succeeded?”</p><br/><p>Xin Lan raised her head from within a yard in the ‘Pan’s Gate’ manor. She looked at the dark clouds in the sky and a trembling excitement quietly rose within her heart.</p><br/>\n</div>"}