{"title": "Chapter 948: Demon Snake Xia Mang", "id": 948, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-948-demon-snake-xia-mang", "volume_title": "Volume 10", "body": "<h1>Chapter 948: Demon Snake Xia Mang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 948: Demon Snake Xia Mang</u></strong></p><br/><p>Night gradually covered the entire desert. The moon hung like a silver plate high up in the distant sky, scattering its faint cool moonlight over the land…</p><br/><p>There were few people within the desolate desert. However, there was surprisingly some fire and hearty human voices appearing on a hill. The sound spread and significantly reduced the quiet coldness around.</p><br/><p>Quite a number of large piles of fire were emitting sparks that flew toward the sky from within the camp on the hilltop. The light from the flames lit the entire camp ground until it was quite bright. Many people were surrounding the piles of fire. Their hands held some wine jars as they laughed out loud. After which, the bottles collided together, emitting a ‘ping’ sound amid some laughter.</p><br/><p>Xiao Yan sat beside a pile of fire. He smiled as he watched these large men around him, who had drunk until they had flushed faces. This kind of atmosphere was something that he had seldom endured.</p><br/><p>“Brother Xiao Yan, here. Drink a little to warm your body. The desert is cold.” A laugh suddenly sounded while Xiao Yan was fiddling with the flame. Immediately, a wine jar flew toward him. Xiao Yan extended his hand and accurately grabbed it. After which, he raised his head to look at Han Chong, who had the smell of alcohol all over him. He then smiled with a nod. “Thank you big brother Han Chong.”</p><br/><p>After saying this, he raised the wine jar and gulped two mouthfuls. The fiery heat rose from his stomach, causing a flush to surface on his face.</p><br/><p>“Ha ha, little fellow Xiao Yan, not bad. You still possess some spirit of a man.” Some of the surrounding Han clan’s guards involuntarily smiled and praised when they saw that Xiao Yan had drank half a bag of potent wine in one shot.</p><br/><p>Xiao Yan smiled to everyone. He was just about to speak when the tent in the middle of the campsite suddenly opened. A figure that appeared extremely alluring under the moonlight immediately appeared in front of everyone’s gazes. That figure was Han Xue.</p><br/><p>At this moment, Han Xue appeared to have just bathed. Hence, her smooth black hair carried some moisture as it floated down. At this moment, she appeared to have the additional enchantment of a woman. This caused quite a number of younger Han clan’s guards to have quicker heartbeats upon seeing her.</p><br/><p>Han Xue walked out of her tent. Her gaze randomly glanced around once. After which, she sat down beside a fire not far from Xiao Yan’s group. She took out a dagger and took a piece of grilled meat from the fire rack before slowly placing it into her small mouth. The elegance from her slow chewing appeared to be incompatible with the surrounding rough chewing atmosphere. However, it must be said that the current Han Xue was extremely beautiful and moving.</p><br/><p>The voices of Han Chong and the others were unknowingly suppressed after Han Xue had come out. Their dirty jokes were also hurriedly swallowed into their stomach.</p><br/><p>Xiao Yan turned his head and looked at Han Xue who appeared to have a delicateness that belonged to a woman under the fire light which was mixed with the stern coldness from the daytime.</p><br/><p>“Hee hee, why? Have you been smitten by xiao-jie (young lady)?” Han Chong by the side suddenly rushed forward while Xiao Yan was focusing on Han Xue and softly teased. The warm smile on his face caused these strong man to appear somewhat insignificant at this moment. Of course, all of them were men. Hence, there was no need to hide these words.</p><br/><p>Xiao Yan was startled when he heard this. He immediately laughed and shook his head.</p><br/><p>“There is no need to be embarrassed. Who younger than thirty in this guard unit is able to escape xiao-jie’s enchantment? However, all of them understand that they can only think about such matters in their hearts. Xiao-jie is already an elite Dou Wang at such a young age. Her great talent is only surpassed by elder young miss in the entire Han clan. With the status and position of us guards, it is little different from attempting to get something far beyond us.” Han Chong patted Xiao Yan’s chest and sighed.</p><br/><p>Xiao Yan nodded slightly. Although he was unaware of just how strong the Han clan was, being the young lady of the Han clan, Han Xue’s status was naturally higher than these guards. Hence, these young men in the clan who harbored a crush on her would likely end up with a dashed dream…</p><br/><p>“However, xiao-jie (young miss) is indeed quite a good person. Although she is usually very stern, she treats us guards quite well. If any guard ends up seriously injured in a mission, she would get the clan to fork over some money to give to that guard’s kin. It should be known that once a person lost his use in other places, the other party would abandon you. One should consider himself lucky if the other party doesn’t quietly kill you because they are afraid that you will leak some secret.” Han Chong smacked his mouth and said.</p><br/><p>Xiao Yan was startled. It was unexpected that this cold-looking lady would actually have such a kind heart.</p><br/><p>Han Xue did not have a big appetite. Hence, she stood up after just a short while. Her pretty eyes swept over the tents before immediately getting ahold of Han Chong. She spoke indifferently, “Those on duty tonight should not drink alcohol. The others should also drink less. Everyone should pay more attention when we pass through the territory of the demon snake Xia Mang tomorrow.”</p><br/><p>She did not stay any longer after saying these words. With gentle footsteps, she slowly entered her tent before extinguishing the light within it.</p><br/><p>The atmosphere within the camp grounds was no longer as relaxing as it had been earlier once Han Xue re-entered her tent. Some people knit their brows before softly cursed. Due to Xiao Yan being quite far away, he was unable to clearly hear what was being said. However, he could vaguely make out something demon snake. It was likely the whatever demon snake Xia Mang that Han Xue had mentioned earlier.</p><br/><p>“Ugh, damn it, I had forgotten about that greedy and lecherous bastard. Alright, let’s all stop drinking. Double the guards tonight and ensure nothing goes wrong.” Han Chong held the wine jar and violently poured it into his mouth. After which, he tossed the wine jar aside, stood up, and spoke in a deep voice.</p><br/><p>Everyone also began to toss the wine jars aside after hearing Han Chong’s cry. After which, they scattered and strengthened the defenses and patrols of the campground.</p><br/><p>Xiao Yan was a little stunned when he looked at the campgrounds, which had swiftly become a lot more solemn. A moment later, he stood up and asked, “Big brother Han, just what is that demon snake Xia Mang?”</p><br/><p>Han Chong laughed bitterly when he heard this. He said, “We will pass by a place called the Ten Thousand Snake Gorge. That place is the territory of a demon snake called Xia Mang. That fellow’s strength might have just reached the Dou Huang class, but even some experts at the peak of the Dou Huang class don’t wish to get entangled with him because he, as the demon snake, is able to control all the poison snakes rank 4 and below in the Ten Thousand Snake Gorge. Hence, he has occupied that spot for many years. One has to pay an expensive toll if one wants to successfully pass through it. Anyone who refuses will have have difficulty leaving the Ten Thousand Snake Gorge alive.”</p><br/><p>“A Dou Huang class demon snake? It actually possesses an intelligence and knows how to occupy a territory and be a bandit?” Xiao Yan’s face was somewhat strange when he spoke.</p><br/><p>“Rank 6 Magical Beast mostly have quite a high intelligence. Moreover, this Xia Mang has eaten a Demon Transformation Pill. Hence, it can escape its snake shape. Its intelligence is also higher than other rank 6 Magical Beast.” Han Chong said.</p><br/><p>“Demon Transformation Pill? This medicinal pill is actually able to allow a Magical beast to transform its body? I remember that only a Body Transformation Pill has such an effect and that is a tier 7 medicinal pill.” Xiao Yan spoke in a stunned manner.</p><br/><p>“The Demon Transformation Pill is only a tier 6 medicinal pill. Its effect is indeed similar to that of a Body Transformation Pill. However, it only allows a partial transformation and its effect is far inferior to a Body Transformation Pill. Such a medicinal pill is most sought after in some Magical Beast clan.” Han Chong explained.</p><br/><p>Xiao Yan only sighed in relief after hearing this. He no understood the worry of Han Xue and everyone else. After all, the strongest in this convoy of theirs was Han Xue, and she only had the strength of a Dou Wang. She was undoubtedly far inferior when compared to Xia Mang.</p><br/><p>“Hopefully this fellow will not ask for a huge sum tomorrow. Ugh, brother Xiao Yan, you should go and rest first. I still need to command the others to strengthen our defenses and make the proper preparations.” Han Chong sighed. Immediately, he patted Xiao Yan’s shoulders, turned around, and walked toward a tent.</p><br/><p>Xiao Yan looked at the campground, which had become much quieter. He could only helplessly shake his head. He turned and returned to his own tent. However, Xiao Yan did not sleep immediately upon returning to the tent. Instead, he took out a bottle of medicinal liquid, which he had used when training in the magma world back then from his Storage Ring. After which, he applied it all over his body. That kind of icy-cool feeling caused the piercing pain within his body to be greatly reduced. Moreover, Xiao Yan was able to sense a thread of warm energy following his skin and slowly merge into his body.</p><br/><p>“After a couple more days, the injuries that I have received should gradually improve. At that time, my body will be able accommodate the entry of some Dou Qi.”</p><br/><p>Xiao Yan sensed the change within his body and his expression also relaxed. He put the linen clothes back on his body. After which, he sat cross-legged and entered a training state, carefully absorbing the natural energy to repair his injured body.</p><br/><p>The next day, Xiao Yan opened his eyes when some noise sounded within the campsite. He clenched his fist, sensed the weakening pain within his body, and involuntarily smiled. Perhaps it was because he ended up frequently injured, but his recovery rate in the face of such injuries caused even him to feel surprise.</p><br/><p>After getting up and arranging his clothes, Xiao Yan walked out of the tent. He smiled at Han Chong’s group, who was hurrying to pack up the camp, before stepping forward and lending a hand.</p><br/><p>Han Chong’s group, which was aware of Han Xue’s character, did not reject Xiao Yan’s help. They simply smiled and handed some simpler tasks to Xiao Yan.</p><br/><p>Xiao Yan threw the tent in his hand into a carriage and had just turned around when a serene fragrance passed by him. The figure immediately paused and a pair of pretty eyes swept over. A faint voice also sounded, “You will continue to remain in the carriage today. Don’t come out.”</p><br/><p>She did not give Xiao Yan the opportunity to speak. She returned to her own carriage. After which, a moving cold cry was emitted from within it.</p><br/><p>“Start the convoy!”</p><br/><p>The corner of Xiao Yan’s mouth twitched involuntarily as he looked at the convoy, which was proceeding forward with a creaking sound. “This person is really not bad. I will just wait and see. If any accident is to happen, I will quietly lend a hand.”</p><br/>\n</div>"}