{"title": "Chapter 941: Red Clothed Young Lady", "id": 941, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-941-red-clothed-young-lady", "volume_title": "Volume 10", "body": "<h1>Chapter 941: Red Clothed Young Lady</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 941: Red Clothed Young Lady</u></strong></p><br/><p>When the first rays of sunlight penetrated the window and transformed into light spots that shot onto the ground, Xiao Yan, who had his eyes shut, finally slowly opened them. He softly muttered, “Looks like there is a need to head to the city center to take a look. After all this place is the only Wormhole within a thousand kilometer radius of Horizon City…”</p><br/><p>Xiao Yan sighed softly and rolled off the bed. He bathed a little before heading out to gather the Little Fairy Doctor and the other two. The group walked out of the inn and rushed to the city center.</p><br/><p>Xiao Yan’s four men group was slowly walking down the main road, that had an unending amount of traffic. Perhaps it was because it was still morning, but the air contained moisture that existed in the mountain forest, giving them a refreshing feeling.</p><br/><p>The two sides of the street, paved with bluestones, would occasionally transmit various cries. A dazzling array of merchandise had placed in the shops on both sides. The huge human flow was just like ants that were penetrating through them. Horizon City was emitting an exceptionally busy, constricted feeling.</p><br/><p>“It is rumored that the ancestor of the Luo clan is inviting helpers to repair the Wormhole. We can go and take a look. We will decide whether to lend a hand depending on the situation. After all, the factions within Horizon City are too complicated. It is not wise for us to get involved.” Xiao Yan’s feet were slowly progressing at a special pace. His gaze swept over the shops on both sides of the street while his mouth spoke indifferently.</p><br/><p>“Yes.” The Little Fairy Doctor nodded slightly when she heard this. She was the only one among them who had stepped into the Dou Zong class and possessed the ability to control spatial strength.</p><br/><p>Da! Da!</p><br/><p>Waves of horse hooves were suddenly transmitted from the front of the street while Xiao Yan was conversing with the Little Fairy Doctor. Immediately, the street became chaotic. A fiery-red figure rushed over from the end of the street, knocking over a countless number of people along the way. When these people took a look with furious eyes, they discovered that there was a young lady in bright-red clothes on the horse. The young lady appeared extremely attractive, but there was a thread of wild arrogance between her brows. A bright-red whip hung from her small waist while a proud lovely laughter reverberated across the street.</p><br/><p>The red horse was just like a flame that fwhiped over from the distant. Within a couple of blinks, it appeared a short distance from Xiao Yan’s group.</p><br/><p>“A good dog doesn’t block the road! All of you, move aside for this miss! Otherwise, no one will take responsibility if you are stomped to death!”</p><br/><p>The red-clothed, young lady cried out. Her brows immediately bunched up as she looked at the few figures in front of her who did not move.</p><br/><p>Xiao Yan, who was originally going to dodge aside, immediately revealed a cold expression when he heard these words. He disliked this kind of arrogant woman the most. He placed the leg, which he had just lifted, back down and continue slowly walking forward without lifting his eyes.</p><br/><p>“Hmph, you’re seeking death!”</p><br/><p>This action of Xiao Yan was naturally absorbed into the red-clothed, young lady’s eyes. She let out a cold snort as her hand grabbed the whip. Immediately, a red shadow rushed forward amid a clear air tearing sound, carrying a wind as it was swung at Xiao Yan.</p><br/><p>Xiao Yan’s face continued to remain calm. He randomly clenched his hand and the whip was automatically caught. After which, he pulled at it randomly.</p><br/><p>“Ah!”</p><br/><p>The enormous force that was transmitted from the whip caused the red-clothed, young lady to let out a sharp cry. Her body was pulled down from the horse, and she landed on the ground on her butt.</p><br/><p>“As***le, bastard you dare attack this lady?” The face of the red-clothed, young lady immediately turned green when her buttock made contact with the ice-cold dirt. She furiously roared at Xiao Yan, appearing like an angered female tiger.</p><br/><p>“I am merely teaching you a lesson on behalf of your elders…” Xiao Yan glanced at the red-clothed, young lady. He immediately ignored her as he led the Little Fairy Doctor and the others down the street.</p><br/><p>“What are you? You actually dare to teach me a lesson? Who do you think you are?” The indifferent words Xiao Yan gave her had completely angered this red-clothed, young lady. Immediately, her voice became much sharper. “Uncle Hua, uncle Lui, kill this as***le!”</p><br/><p>The young lady’s sharp cry had just sounded when two old figures swiftly rushed through the air and arrived, blocking Xiao Yan’s man group.</p><br/><p>The two figures, who appeared in front of Xiao Yan, had gray and white hair respectively. By observing the aura of these two, it seemed that their strengths were around a five to six star Dou Huang and could be considered quite strong.</p><br/><p>“This friend, my clan’s young lady is indeed a little mischievous. However, she is after all a girl. Isn’t it a little inappropriate for you to treat her like this…” The gray-haired, old man initially glanced at the red-clothed, young lady, whose face was flushed red with anger. After which, he looked to Xiao Yan, and frowned as he spoke.</p><br/><p>With his eyesight, he was naturally able to sense the aura of this black-robed, young man in front of them was little different from theirs. It was even a little strong. Hence, their words were not too domineering.</p><br/><p>“That is why she is currently still alive.” Xiao Yan raised his eyes. His voice was still calm, but he was not a kind person. If it had been an arrogant male who dared curse at him today, the punishment would not have just been getting pulled down from a horse.</p><br/><p>At this moment, quite a number of people had gathered around the street because of this unexpected occurrence. These people shook their heads when they saw the red clothed young lady. Immediately, they threw some pitiful gaze towards Xiao Yan’s group. This red clothed young lady was a famous little demoness in Horizon City. Anyone who meet her could only consider themselves unluckily. It was unexpected that this fellow actually dared to attack her today. Looks like they should be people who had come from outside the city.</p><br/><p>The expressions of the two old men changed slightly in the face of Xiao Yan’s calm words that hid a chill. Their eyes became somewhat sinister. The red-clothed, young lady was the most doted granddaughter of the ancestor of the clan. Hardly anyone in this Horizon City dared to say such words.</p><br/><p>“You as*****. You still dare to be so arrogant in Horizon City. By striking this lady, my grandfather will definitely not let you off. If you are wise, you will kneel down now, kowtow to this miss and apologize…” The red-clothed, young lady had climbed to her feet at this moment. Losing such face in front of so many people was something that she, who had an unusually great pride, had difficulty accepting. Immediately, her small face had significantly changed due to her fury. However, before her furious cry was completely voiced, a ghost-like figure suddenly appeared in front of her, and the figure swung its hand. It immediately landed a violent strike onto the young lady’s face in front of a countless number of stunned gazes.</p><br/><p>“Slap!”</p><br/><p>A clear sound appeared on the street. At this moment, everyone’s hearts quivered violently. This slap… was really too cool.</p><br/><p>The red-clothed, young lady turned her head. Five somewhat purplish-red fingerprints appeared on her face. A thread of blood overflowed from the corner of her mouth. Her eyes were filled with disbelief. She could not believe that there was really a person who dared to give her a slap.</p><br/><p>“He will not kill you if you dare curse again. I will!”</p><br/><p>An indifferent ice-cold voice that was filled with killing intent slowly sounded from in front of the red-clothed, young lady, causing her body to tremble. She slowly raised her head, only to see a plain dressed beauty standing with a pretty face that contained an evilness. When both of their eyes met, the red-clothed, young lady was able to see genuine killing intent radiating from from the other party’s eyes.</p><br/><p>“How dare you!”</p><br/><p>The sudden slapping sound caused the two old men to be stunned. Immediately, they let out a furious cry. Their bodies moved and they rushed toward the Little Fairy Doctor in a lightning-like manner.</p><br/><p>The two people had just moved when the faint sound of rumbling thunder appeared. Immediately, a black figure appeared in front of them. Two fists were thrown out. The shockingly wild energy that momentarily erupted caused the expressions of the two to change. They hastily met the punches.</p><br/><p>“Bang!”</p><br/><p>The sound of flesh colliding suddenly rang out. Immediately, everyone was stunned to see the two old men, with a strong reputation within Horizon City, swiftly step back. The black-robed, young man appeared to be like an unmoving rock.</p><br/><p>“You only have yourselves to blame for this matter today. If you continue to be insensible, do not blame me for being vicious!”</p><br/><p>Xiao Yan’s gaze was dark and cold as he looked at the two old men. The killing intent within his eyes contained traces of coldness. The matter today was fast reaching his bottom line.</p><br/><p>The two old men did not dare to make any unnatural movements after having been deterred by the strength that Xiao Yan had displayed. They could only cry out bitterly in their hearts. This little grand-aunt had dominated the city for so many years and had finally collided with the tip of a spear. This little fellow might appear young, but he was extremely strong. The attack earlier was something that hardly anyone within their clan could display.</p><br/><p>“This friend, I am a member of the Luo clan. The young lady who offended you earlier is the young miss of the Luo clan. Please do not hurt her on account of the Luo clan.” The gray-haired, old man sighed in his heart as he cupped his hands together and pleaded.</p><br/><p>“Luo clan?” Xiao Yan frowned slightly when he heard this. Although he already knew that the background of this lady was likely not weak, he did not expect her to be a member of the Luo clan in Horizon City.</p><br/><p>“You… you dare hit me?”</p><br/><p>Only at this moment did the red-clothed, young lady finally recover from her stunned state. She rubbed the fiery hot fingerprint mark on her face. Her hands trembled as she pointed at the Little Fairy Doctor in front of her. The anger in her eyes had reached a frightening degree.</p><br/><p>After her words sounded, the red-clothed, young lady took out a jade plate from her Storage Ring in her fury. After which, she violently broke it and viciously said, “Slut, you dare strike me? My grandfather will not let you off. Once you land in this Miss hands, I will definitely cut your fingers off one at a time!”</p><br/><p>The Little Fairy Doctor’s gaze merely glanced at the red-clothed, young lady coldly as the latter cursed viciously. Immediately, a faint indifferent voice was transmitted from beside her ear.</p><br/><p>“Hit her again. With such a vicious heart, leaving her be will only lead to a calamity…”</p><br/><p>The corner of the Little Fairy Doctor’s mouth curled when she heard this. She immediately raised her hand once again in front of the shocked eyes of the red-clothed, young lady and unceremoniously gave her a tight slap.</p><br/><p>Slap!</p><br/><p>This slap had just landed when a gray-colored light shot over from the center of the city. It immediately appeared in the air above the street. His gaze swept under him. A majestic aura suddenly surged out and swept in all directions. A dark, solemn voice reverberated unceasingly throughout the street.</p><br/><p>“The actions of the few of you really look down on my Luo clan!”</p><br/>\n</div>"}