{"title": "Chapter 945: Frightening Tunnel", "id": 945, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-945-frightening-tunnel", "volume_title": "Volume 10", "body": "<h1>Chapter 945: Frightening Tunnel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 945: Frightening Tunnel</u></strong></p><br/><p>The thing that appeared in front of Xiao Yan’s group was a storm that had formed from silver-colored spatial strength. It coincidentally sealed off the entire tunnel. The turbulent suction force that was transmitted from the silver-colored storm caused the space boat, Xiao Yan was in, to repeatedly tremble, sort of feeling as though it was about to crumble.</p><br/><p>“Space Storm…”</p><br/><p>Xin Lan muttered to herself. Her expression had become much paler as she stared at the raging silver-colored storm within the tunnel. It was unexpected that this unlucky thing had still appeared.</p><br/><p>“Is this the Space Storm… it is indeed quite terrifying. Such a powerful spatial strength is something that even an elite Dou Zong would have difficulty displaying…” Xiao Yan’s eyes stared intently at the silver-colored storm, that was like an enormous python, as he slowly spoke.</p><br/><p>“What do we do now?” The Little Fairy Doctor’s eyebrows were vertical as she asked.</p><br/><p>“We can only forcefully charge through it. According to my guess, we should not be far from the exit. As long as we can reach the exit, we will be able to escape the Space Storm.” Xin Lan forcefully suppressed the thread of terror within her heart as she gave a suggestion.</p><br/><p>Xiao Yan knit his brows slightly when he heard this. He looked at the Space Storm that was gradually spinning toward them. A moment later, he sighed and said in a deep voice, “Little Fairy Doctor, prepare to charge forward. You will protect the body of the ship. I will control its speed!”</p><br/><p>“Yes.” The Little Fairy Doctor nodded. She did not say anything else as her lovely body drifted back. Majestic Dou Qi surged out in all directions, transforming into a giant grayish-purple python. The enormous python wrapped the ship within its body before raising its head and hissing at the sky.</p><br/><p>“Go! Zi Yan, Xin Lan, hold on tight!” A deep cry was transmitted from Xiao Yan’s mouth. Immediately, he waved his sleeves and powerful Dou Qi was poured into the space boat. Finally, it transformed into a fierce pushing force that caused the space boat to shoot off like an arrow with a ‘xiu’ sound.</p><br/><p>After forcing the boat to its maximum speed, the space boat transformed into a faint-silver-colored figure. With a flash, it leaped a thousand meters before finally running headlong into the raging silver storm.</p><br/><p>Bang! Bang!</p><br/><p>The space boat had just charged into the storm when the body of the boat began to vibrate. Creaking sounds were repeatedly emitted, as though it was a lonely boat navigating a great storm, facing the miserable fate of being shattered.</p><br/><p>Xiao Yan’s expression gradually turned gloomier as he sensed the frightening tearing force that was emitted from the space storm. It was fortunate that the Little Fairy Doctor was strong. If it had been some other person, it was likely that they would have difficulty blocking this kind of spatial tearing. Even though this was the case, the Little Fairy Doctor would definitely not be able to last long. Hence, he needed to charge out of this damn place as soon as possible.</p><br/><p>This thought flashed across Xiao Yan’s heart as he violently clenched his teeth. More powerful Dou Qi shot out. The speed of the space boat was gradually raised to its limit. Threads of faint-silver-colored Spatial Force flickered repeatedly like a light…</p><br/><p>The space boat’s small figure was insignificant within the enormous space storm. Even though Xiao Yan had unleashed the boat’s maximum, the tearing force of the surrounding space was not reduced at all. Instead, it became even more terrifying. In the end, the enormous grayish-purple energy python, that had been wrapped around the space boat, began to show signs of becoming illusionary. Clearly, even the Little Fairy Doctor had difficulty completely blocking the wild and violent suction of space.</p><br/><p>“Zi Yan, help her!” Xiao Yan cried out in a deep voice. His eyes solidified upon sensing the intense bumps that were being transmitted from the body of the ship.</p><br/><p>Zi Yan did not pipe up with any nonsense when she heard Xiao Yan’s cry. Her small hands swiftly formed numerous seals that left one dazzled. Immediately, waves from a strange purple-colored glow surged out of her body.</p><br/><p>With the help of this crystal glow, Zi Yan’s small body suddenly began to swiftly grow. Her purple hair also grew like wild grass. In a mere instant, she transformed into someone with hair similar to a purple-colored waterfall, extending to her buttocks. Zi Yan had used a Secret Technique during this critical moment, enabling her strength to be raised to its peak…</p><br/><p>When Zi Yan became that sexy purple-haired beauty, the aura that spreading from her body greatly rose. In the end, it faintly exceeded Xiao Yan’s aura.</p><br/><p>“Condensate Spirit!”</p><br/><p>A clear cry was transmitted from Zi Yan’s mouth. A bright purple glow shot from the top of her head. It vaguely agglomerated and formed an extremely large mysterious beast spirit. Due to Zi Yan’s purple light being too bright, it was difficult to clearly see the appearance of that beast spirit.</p><br/><p>This purple-colored beast spirit had just appeared when it let out a soul-stirring roar toward the sky. The voice transformed into faint purple-colored sonic waves that repeatedly spread out in all directions, suppressing the tearing strength of the space storm.</p><br/><p>The pressure the Little Fairy Doctor was immediately reduced with Zi Yan’s help. Her pretty face was tensed as she diverted some attention to swiftly repair the enormous energy python that had been shattered by the space-tearing strength.</p><br/><p>Xiao Yan’s face eased slightly as he sensed the somewhat calmer boat. However, he did not relax even a little within his heart. He knew that the tearing strength of the storm would become even more frightening. It was only the beginning!</p><br/><p>The calmness did not last very long just as Xiao Yan had expected. An even more intense bump struck once again. The wild and violent Spatial Strength was just like numerous poisonous snakes, snapping at people as they surged out from within the storm. They violently bit at the enormous energy python wrapped around the boat. Under the powerful pushing force, the creaking sound that was emitted from the space boat became more and more intense.</p><br/><p>Xiao Yan’s face was filled with a solemness. A moment later, his throat suddenly emitted a low roar. Both of his hands pressed on the energy input point at the front of the ship as waves of Dou Qi followed his arms and surged out like a wave of water…</p><br/><p>Xiao Yan went all out to maintain the speed and prevent the boat from being pulled into the empty space by the storm. The purple glow outside Zi Yan’s body also became denser. In the end, her toes appeared to be half an inch above the boat. A crystal layer like purple-colored glow slowly spread out from her palm before lingering outside of the boat.</p><br/><p>A strange scene started to occur when this purple-colored light aura appeared. The wild and violent spatial strength pouncing over was being reflected back by the crystal glow. After which, they continued to collide with the spatial strength. Explosive sounds appeared, causing the illusionary space to become extremely distorted.</p><br/><p>The purple-colored crystalline glow was effective However, it exhausted Zi Yan very quickly. Hence, the crystal glow continued for a short few minutes before it ended up shattering. Zi Yan’s throat also emitted a low muffled groan as a thread of fresh blood followed the corner of her mouth and seeped down. Her gem-like eyes had become much dimmer.</p><br/><p>“Big brother Xiao Yan, we are about to reach the exit!”</p><br/><p>Xin Lan’s joyful voice was just like a heart tonic while everyone was clenching their teeth and enduring. Xiao Yan raised his head and did indeed see a silver-colored light circle suddenly appearing in the distant darkness. That place was the exit of the Wormhole!</p><br/><p>“Bang!”</p><br/><p>Before Xiao Yan’s group could let out a joyful cry at having seen the exit, an unusually frightening Spatial Strength violently struck the boat. The strength was extremely great. Were it not for the Little Fairy Doctor going all out to maintain the boat, it was likely that it would have been scattered on the spot.</p><br/><p>Xiao Yan used a short amount of time to glance behind him. His eyes involuntarily shrank. He saw that the Space Storm had suddenly become unusually wild and violent at this moment. A frightening suction force surged out in all directions from within the storm. Under that suction force, the space boat speed had swiftly slowed down.</p><br/><p>Xiao Yan’s eyes turned red upon sensing the speed of the space boat. If they were to be dragged into the storm again, it was likely that their group could forget about getting a chance to escape.</p><br/><p>“Roar!”</p><br/><p>A low roar was transmitted from Xiao Yan’s throat. Numerous green veins appeared on his face in a ferocious manner, looking just like earthworms. Jade-green Dou Qi wildly poured into the interior of the boat like a flame, causing the speed of the space boat to increase a little.</p><br/><p>The speed of the space boat had just been increased when the suction force emitted from the storm greatly soared. In an instant, the two ended up in a stalemate. The enormous space storm was slowly moving toward Xiao Yan’s group.</p><br/><p>“The speed has already reached its maximum. If this continues, we will be dragged back sooner or later!”</p><br/><p>Xiao Yan’s eyes turned bright-red. He suddenly turned his head and cried out to Zi Yan, “Come and pour Dou Qi in. Increase its speed.”</p><br/><p>Zi Yan was shocked by this manner of Xiao Yan. She did not dare to ask any extra questions as she swiftly rushed over. Immediately, her hands were placed on the input point. The energy within her body swiftly surged out.</p><br/><p>After Zi Yan replaced him, Xiao Yan shook his shoulders and a pair of enormous bone wings were spread out. The bone wings immediately moved and he flew away from the space boat in front of Xin Lan’s stunned eyes. After which, he landed on the tail of the boat and waved his sleeves. A frightening wind surged out of his sleeve before striking the boat, pushing the space boat forward.</p><br/><p>The instant Xiao Yan pushed the space boat, a counter force caused Xiao Yan’s body to be momentarily stilled. However, it was fortunate that his reaction was fast. Bright lightning flashed under his feet. The bone wings were flapped wildly under the sound wave of muffled thunder, blocking the suction force that was transmitted from behind. His body chased after the space boat.</p><br/><p>The suction force that was transmitted from the Space Storm behind was becoming more and more terrifying. With Zi Yan’s strength alone, it was obvious that she had difficulty maintaining the speed, yet the Little Fairy Doctor needed to protect the boat’s body. Hence, the space boat that was being pushed forward showed a sign of moving back.</p><br/><p>“Bastard!”</p><br/><p>Xiao Yan’s face was flushed red. His veins repeatedly pulsed. The bone wings on his back were flapped and his body once again appeared at the tail of the space boat. He let out an angry cry as his arms pushed the boat. Wild wind was shot out before violently pushing the boat. One could see the space boat transforming into a silver glow that shot out. The next instant, it appeared at the end of the tunnel. Finally, it flashed forward before disappearing within the silver glow…</p><br/><p>Xiao Yan heaved a sigh of relief as he watched the space boat successfully leave. He turned his head slightly and looked at the close storm. The skin on his head involuntarily turned numb. He went all out to flap his bone wings while activating the Three Thousand Lightning Movement to its limit. Numerous afterimages repeatedly appeared. The next instant, the frightening suction force that was transmitted from behind was turned into nothingness…</p><br/><p>Xiao Yan had finally approached the exit of the tunnel while fleeing in this crazy manner. Just when he was about to charge out, his skin suddenly felt a chill. His body immediately pounced to the ground instinctively.</p><br/><p>“Xiu!”</p><br/><p>A ten-foot-large silver-colored Spatial Strength shot past his head like a silver snake. After which, it struck the exit, causing the silver glow to wildly surge.</p><br/><p>Xiao Yan suddenly sensed the many times stronger suction force from behind when the silver glow surged. His heart was startled. The bone wings moved, and he used all his strength, transforming into a silver glow that eventually reached the silver glow, signifying the exit of the tunnel…</p><br/><p>Xiao Yan’s body had just made contact with the silver glow when it suddenly disappeared. With his disappearance, this space had become void of life once again. Only that enormous Space Storm was still raging, and did not scatter for a long while…</p><br/><p>…………</p><br/><p>In the middle of a lush, green plain was an open ground filled with rock fragments. The ground in the middle of the open ground was filled with many mysterious seals. These seals were emitting a faint silver glow as they faintly emitted a space ripple.</p><br/><p>The open ground was quite quiet. At a certain instant, a wild wind suddenly appeared out of nowhere. A silver-colored light circle surfaced from the middle of the open ground. The figure of a boat flashed out before swiftly becoming smaller. Finally, it revealed three miserable figures on it.</p><br/><p>The silver-colored light circle slowly disappeared as the three people landed.</p><br/><p>“Where is Xiao Yan? Why is he not out?”</p><br/><p>After landing, the Little Fairy Doctor hurriedly asked. Her heart had suddenly turned cold when she saw that his familiar figure was not with them.</p><br/><p>At this moment, Zi Yan had once again turned back into the appearance of a little girl. However, her expression was extremely pale at this moment. Her gem-like eyes stared at the place where the silver-colored light circle had disappeared. There was a faint fog gathering there.</p><br/><p>Xin Lan was similarly startled for a moment because of this. However, when she saw the flickering silver colored runes on the ground, she finally sighed in relief. She said, “Relax, big brother Xiao Yan has already successfully exited the space tunnel…”</p><br/><p>“Where is he then?” The Little Fairy Doctor and Zi Yan had basically opened their mouths at the same time, demanding an answer.</p><br/><p>“He has indeed left. However, it seems that the position of the space tunnel had changed at the last moment. Hence… the current him should have been sent to some other spot in the Central Plains… as for where he is no… I, I don’t know either…”</p><br/><p>Xin Lan’s stammering voice caused the bodies of the other two to slowly stiffen.</p><br/>\n</div>"}