{"title": "Chapter 952: Hong Clan", "id": 952, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-952-hong-clan", "volume_title": "Volume 10", "body": "<h1>Chapter 952: Hong Clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 952: Hong Clan</u></strong></p><br/><p>It was just as Han Chong had said. The journey after the Ten Thousand Snake Gorge was extremely smooth. During the remaining couple of days, they did met with some small trouble, but it did not cause the convoy’s speed to be reduced. Tian Bei City was also coming closer during these couple of days of traveling.</p><br/><p>After some recuperation during these couple of days, Xiao Yan’s strength had recovered by about seventy to eighty percent. The injuries that he had suffered within his body had also swiftly recovered under the double effect of Dou Qi and medicinal pills. Looking at this progress, it was likely that he would recover faster than he had expected.</p><br/><p>Of course, despite the gradual recovery of his strength, Xiao Yan did not reveal any of it. He liked these forthright men of the convoy, and he did not wish to cause them to feel respectful toward him because of the revelation of his strength. He didn’t want them to end up becoming distant from him after adding a little something else onto the friendship they had made during these few days.</p><br/><p>With Xiao Yan’s current strength, it was likely that even Han Xue within the convoy would have difficulty discovering it if he chose to hide his aura. Moreover, due to the little Spatial Strength within his body, even some experts at the peak of the Dou Huang class or even elite Dou Zongs would have difficulty identifying his true strength if he wanted to hide it. There was no need to even discuss about Han Xue’s ability to do so.</p><br/><p>Although Xiao Yan thought that he had hidden it perfectly, he realized that Han Xue’s attitude toward him during these couple of days’ journey appeared to be changed. After she had instructed Han Chong, no one asked Xiao Yan to do any manual work in the convoy. Xiao Yan laughed bitterly in his heart in the face of such special treatment. Were the instincts of a woman really this frightening? He had absolute confidence that he did not expose any traces, but Han Xue seemed to have vaguely sensed something. Occasionally a faint doubt and deep thoughts would flash in her eyes while she watched Xiao Yan.</p><br/><p>Moreover, Han Xue would frequently appear in front of Xiao Yan when she was free and randomly chat with him. However, the content of the chat was secretly inquiring about Xiao Yan’s identity and background. Of course, with the experience Xiao Yan had gained over the years, he would naturally not give himself away in front of a girl like her. The serious and vague replies caused Han Xue to return empty-handed each time. After continuing to put in effort in this direction, she felt quite furious about the feeling of having struck a pile of cotton.</p><br/><p>Xiao Yan felt helpless in his heart in the face of this scene. He could only try his best to increase the gap between Han Xue and him to avoid really causing this sensative woman to discover something.</p><br/><p>Han Xue was probing and uncertain during the journey. When they set up camp on the fifth day, a messenger bird with the emblem of the Han clan flew from the distant direction of Tian Bei City.</p><br/><p>Han Xue received the messenger bird’s message from a guard’s hand and slowly opened it. Her pretty eyes moved while her beautiful face slowly turned ice-cold. A fury even flashed across her eyes.</p><br/><p>The camp, which was laughing unceasingly, became much quieter upon seeing the change in Han Xue’s expression. Everyone stood up. Their gazes were focused on Han Xue at the middle.</p><br/><p>“Xiao-jie (young lady), what has happened?” Han Chong asked with a deep voice.</p><br/><p>“It is the letter that has been transmitted from within the clan. The letter mentioned that the Hong clan is planning to attack the Han clan soon and they asked me to be careful.” Han Xue clenched her hand slightly while she spoke with an icy-cold voice.</p><br/><p>“Hong clan? Dammit, it’s these bastards again.” Waves of curses sounded from all around when they heard the words ‘Hong clan.’</p><br/><p>“What are they planning to do this time around?” Han Chong frowned and asked.</p><br/><p>Han Xue eyelashes blinked slightly. She immediately spoke in a faint voice, “That old fellow, who will not die from the Hong clan, is thinking of getting older sister and I to marry Hong Chen together. However, his ultimate motive is to swallow our Han clan and become the true overlord of Tian Bei City.”</p><br/><p>The expressions of quite a number of people in the convoy darkened upon hearing this. Clearly, the condition that the Hong clan had issued caused they to be extremely furious.</p><br/><p>“Dammit. Does this Hong clan really think that our Han clan can be manipulated by others as they pleased? They actually dare to make such a bastard’s request.” Han Chong furiously said.</p><br/><p>Han Xue’s pretty face was still ice-cold in the face of Han Chong’s furious voice. Her head shifted slightly and suddenly paused on the young man seated by the side of a flame. However, he appeared to have not heard the words from this side. He merely lowered his head and toyed with the pile of fire. Seeing this, Han Xue’s eyebrows were clustered together. She turned her gaze aside and coldly said, “We will be entering Tian Bei City’s area tomorrow. Everyone should be extra careful.”</p><br/><p>“Understood!”</p><br/><p>Everyone cried out in union.</p><br/><p>Han Xue nodded her head. She snorted softly at some unknown person and walked into her own tent.</p><br/><p>The people in the camp finally returned to the side of the fire after Han Xue’s pretty figure disappeared. Their faces alternated between being bright and dark under the fire light. That so-called Hong clan seemed to be an even greater threat than the demon snake Xia Mang.</p><br/><p>“Big brother Han, is that Hong clan very strong?”</p><br/><p>The quiet atmosphere continued for a long time before Xiao Yan, who had been focused on maintaining the fire, stood up, stretched his lazy waist, and asked a question.</p><br/><p>“If we really talk about it, the Hong clan is the strongest clan within the Tian Bei city. Even our Han clan is a little inferior to it. The most important reason is that the Hong clan has a little relationship with the Wind Lightning Pavilion. The most outstanding person of this generation, Hong Chen, is someone from the Wind Lightning Pavilion and is highly regarded within it.” Han Chong sighed before speaking with a bitter smile, “The Hong clan has relied on this big tree to greatly expand its reputation and influence within these short few years. After all, the Wind Lightning Pavilion can be considered a top tier faction within the entire northern region of the Central Plains. Our Han clan is far too inferior when compared with it.”</p><br/><p>“Wind Lightning Pavilion?” Surprise flashed across Xiao Yan’s eyes when he heard this familiar name again. The matter of this world was really filled with coincidences.</p><br/><p>“So what if it is the Wind Lightning Pavilion? Dammit, if that Hong clan really dares to act, the old me will kill a couple of them before I die even if I cannot defeat them.” A somewhat young guard beside the fire spoke with a face filled with fury.</p><br/><p>Han Chong did not take the angry words of these young people to heart. He patted Xiao Yan’s shoulders and said, “Brother Xiao Yan, looks like the Han clan is about to face some unrest. I will ask xiao-jie (young miss) to give you some money after reaching Tian Bei City. You should leave by yourself and avoid getting involved.”</p><br/><p>Xiao Yan smiled, but remained non-committal.</p><br/><p>“Alright, everyone should rest early. Increase the number of guards tonight. Everyone better keep their eyes open tomorrow. We should be safe once we return to the clan.” Han Chong sighed, stood up, and waved his hand. After which, he turned around and left, leaving everyone else to curse at the fire with furious hearts.</p><br/><p>Xiao Yan flicked his finger gently as he stared at the somewhat tired back. A wooden stick in his hand flew into the fire. After which, it became like an arrow that shot deep underground…</p><br/><p>Xiao Yan patted his hands and stood up. He greeted everyone before slowly returning to his tent. After entering it, he once again sighed softly and muttered to himself.</p><br/><p>“Ugh… something like a favor really weighs on you…”</p><br/><p>…</p><br/><p>The sun hung high in the sky where the clouds were absent for thousands of kilometers. Numerous light rays carried a high temperature as they repeatedly scattered down. Under this hot weather, even the trees on the sides of the road began to bend in a sickly manner.</p><br/><p>A convoy was galloping over the spacious road, raising dust that soared to the sky along the way.</p><br/><p>“Everyone, be more focused. We will be entering the territory of Tian Bei City soon!”</p><br/><p>A stern cry was suddenly emitted from within the convoy. Everyone’s hearts tightened. They raised their heads and looked at the stone signboard at the end of the road. All of their hands involuntarily touched the weapons on their backs. The hands, which they used to hold the reins, also emitted some perspiration.</p><br/><p>The convoy galloped forward like an infuriated wild bull and flew down the road with a rumbling noise. Within a short couple of minutes, they approached the stone tablet that was used as a road sign.</p><br/><p>Xiu! Xiu! Xiu!</p><br/><p>The convoy had just passed the stone tablet when the sharp sound of rushing wind suddenly reverberated over the place. Immediately, an innumerable number of arrows shot out of the trees on both sides of the roads, covering the entire convoy as they did so.</p><br/><p>The sudden arrival of the arrows surprised quite a number of people. However, it was fortunate that they were already prepared. Numerous Dou Qis erupted and blocked all of the arrows.</p><br/><p>“Ke ke, looks like they are already prepared, but unfortunately…”</p><br/><p>Laughter was slowly emitted from the woods. Immediately a large number of black figures swiftly swarmed out and completely blocked the road that led to Tian Bei City. The two old men at the front of the group of black figures were the ones that Han Chong and the others were most concerned about.</p><br/><p>The two people were wearing pale-red robes. There was a similar red-colored badge on the chest area of their clothes.</p><br/><p>“People from the Hong clan.”</p><br/><p>Han Chong’s group shrank their eyes as they looked at the red-colored badge.</p><br/><p>“Ke ke, Miss Han Xue, please come out. Us two old fellows have come because of you…” The two old men ignored Han Chong and the other guards. Instead, their eyes stared at the carriage where Han Xue was located as they faintly laughed.</p><br/><p>“Creak…”</p><br/><p>The door of the carriage was slowly opened and a pretty, cold-faced Han Xue slowly descended from it. Her frosty gaze stared at these two old men as she coldly laughed, “It is unexpected that the two Elders Hong Mu and Hong Lie have come just to catch a little girl like me. I am really honored.”</p><br/><p>Although she spoke in this manner, Han Xue’s heart gradually sank. These two Elders of the Hong clan had a strength around that of a four star Dou Huang. They were even stronger than that Xia Mang. Now that these two had acted together… it was likely that she would have a difficult time escaping from the calamity today.</p><br/><p>“There is no need to say this nonsense. The old me is only following orders. You should leave with us!” The expressionless Hong Lie glanced at Han Xue as he spoke.</p><br/><p>“Dream on!”</p><br/><p>A cold glint flashed across Han Xue’s eyes. She tightened her hand and a longsword flashed and appeared in it.</p><br/><p>“Stubborn fool.”</p><br/><p>Hong Lie shook his head when he saw Han Xue resisting. An impatience flashed across his eyes. He stepped forward and appeared in front of her. With a wave of his hand, a hot, powerful wind that carried a pressurizing aura blocked all of Han Xue’s paths of retreat.</p><br/><p>A paleness surfaced on Han Xue’s face as she looked at Hong Lie, who had used all his strength from the start. She immediately clenched her silver teeth and threw a palm forward.</p><br/><p>“Bang!”</p><br/><p>Both palms made contact and the wind that permeated out immediately shocked the surrounding people until they hurriedly stepped back. Han Xue’s lovely body was like a kite whose string had broken as she hurriedly took over a dozen unsteady steps back before stabilizing her body.</p><br/><p>“You can be considered to have some ability to receive one palm from the old me. No wonder you have caught the young master’s eye.” Hong Lie’s body did not move. He glanced at Han Xue who had moved back. He indifferently spoke. Immediately, he stepped forward once again and appeared in front of Han Xue. The wind on his palm whistled as he continued to attack.</p><br/><p>A tragic despondent look surfaced on Han Xue’s face as she sensed Hong Lie’s even fiercer attack. She basically did not have much capital to contend against an elite Dou Huang…</p><br/><p>The palm wind suddenly arrived. However, just before it landed on Han Xue’s body, an invisible force suddenly appeared. With a bang, it easily resolved Hong Lie’s palm wind. The remaining strength also shook him until he took a couple of repeated steps back.</p><br/><p>The sudden unexpected change caused everyone to feel stunned. Han Xue suddenly turned her head after being startled. Her pretty eyes locked onto the carriage where Xiao Yan was located.</p><br/><p>“Ugh, bullying someone younger just because you are old, yet you actually act so righteously. You have really trained until you have thick skin at your age…”</p><br/><p>A helpless voice also slowly sounded while everyone was stunned. However, this time around, the voice was clear and strong. It was no longer that elderly tone from the last time…</p><br/>\n</div>"}