{"title": "Chapter 954: Tian Bei City", "id": 954, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-954-tian-bei-city", "volume_title": "Volume 10", "body": "<h1>Chapter 954: Tian Bei City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 954: Tian Bei City</u></strong></p><br/><p>A serene fragrance was lingering within the carriage. Some hand-picked decorations decorated it, giving this carriage a female’s touch. It was difficult to imagine that Han Xue, who appeared cold and indifferent on the outside, would actually possess the mentality of a little woman in her heart…</p><br/><p>Xiao Yan was a little uneasy as he sat on a chair in the carriage. On the opposite side was Han Xue, who was retrieving a teacup and personally filling it with tea. After which, she gently pushed it in front of Xiao Yan in a somewhat unsmooth manner. From the looks of this, this young lady of the Han clan had seldom done the work of waiting on others.</p><br/><p>However, it was also because of this that Xiao Yan felt uneasy. Having already gotten used to the cold indifference of Han Xue, he could not really adapt to her suddenly becoming so warm within such a short period of time.</p><br/><p>Xiao Yan held the teacup and sensed the faint warmth and remnant fragrance. He raised his eyes slightly and coincidentally collided with her pretty eyes. At that moment, he involuntarily let out a bitter laugh and said, “Young Lady Han, please say what you wish to say.”</p><br/><p>“Call me Han Xue. I am really unworthy of this ‘young lady’.” Han Xue also slowly sat down. She glanced at Xiao Yan and softly said, “It is unexpected that the person who was on the brink of death, that we had randomly picked up in the desert, would actually be an expert who hides extremely well. Regardless of the case, Han Yue shall thank you here for rescuing us twice on this journey.”</p><br/><p>“It’s nothing, if not for your help, it is likely that I might have been food to some wolf. Lending a hand and rescuing all of you is something that I ought to do. Young la... there is no need to worry about these matters. I am not after some reward from you.” Xiao Yan waved his hand and laughed.</p><br/><p>Han Xue curled her mouth into a smile. Her usual cold face also bloomed into a warm moving smile. After some hesitation, she slowly asked, “Are you leaving once we arrive in Tian Bei City?”</p><br/><p>“That should be the case if no accident occurs.” Xiao Yan paused for a moment before nodding and replying.</p><br/><p>Disappointment flashed across Han Xue’s pretty eyes when she heard this. Her hand touched the teapot. A moment later, she summoned her courage and said, “Mister Xiao Yan, can I ask you to help me with something?”</p><br/><p>“The matter between the Han clan and the Hong clan?” Xiao Yan placed the teacup in his hand down and inquired with a calm voice.</p><br/><p>Han Xue bit her lower red lip with the back of her teeth and nodded gently.</p><br/><p>“You really overestimate me. For the Hong clan to be able to dominate the Tian Bei City for so many years, its strength is definitely not weak. What help can I give with my strength alone?” Xiao Yan slowly said. Having just arrived at the Central Plains, he really did not wish to offend someone the moment he stuck his foot in this place. This was especially the case when this Hong clan had some connection with the whatever Wind Lightning Pavilion. Xiao Yan knew that this faction that had specially been introduced by Xin Lan was likely extremely strong. With his current strength, it was likely difficult for him to contend with them.</p><br/><p>“Mister Xiao Yan should also be an alchemist too, right?” Han Xue spoke somewhat anxiously. “Moreover, your tier would likely be quite high. Even the Hong clan would likely not easily offend a high tier alchemist. Hence, if you are willing to lend a hand, the Han clan would definitely be much more relaxed.”</p><br/><p>Xiao Yan raised his eyes slightly. He looked at the pleading look and anxiety on Han Xue’s face and involuntarily let out a bitter laugh. This trouble really gave him a headache.</p><br/><p>“Mister Xiao Yan, as long as you are willing to help the Han clan through this difficulty, the Han clan will definitely give you a satisfactory reward. If… if you really think that won’t do, I am willing to be your concubine. Please lend a hand!” A bright-redness suddenly surged up Han Xue’s pretty face as she clenched her silver teeth and spoke.</p><br/><p>“*Cough*...” These words of hers nearly caused Xiao Yan to spit out the tea in his mouth. He hurriedly stood up, waved his hand, and said, “Don’t. I am used to being alone and will really not be used to it if someone follows beside me. I will give this matter some thought. Let’s leave it as it is for now. Goodbye.”</p><br/><p>Xiao Yan hurriedly turned around, pulled open the door of the carriage, and fled after saying these words. He did not expect that this ice-cold Han Xue would actually be so bold in such matters. She was even bold to the point where he was unable to endure.</p><br/><p>Han Xue was startled as she watched Xiao Yan flee from the carriage in a miserable manner. A moment later, she let out a smile. Ever since she had met him, she had never seen this old-well-like unfathomable young man act this way. It was unexpected that he actually had such a reaction because of her words. It was really extremely interesting.</p><br/><p>“This person is not bad… but I can tell that he is the type who doesn’t like trouble. Ugh, moreover, the strength of the Hong clan is so great. Pulling him in might be a kind of trouble for him. I was a little rash…”</p><br/><p>Han Xie laughed softly before gradually calming down. She sighed and spoke with a distant voice.</p><br/><p>After Xiao Yan had exposed his strength, the people in the convoy gave him additional respect as he had expected. Something like the unrestrained joking from a couple of days earlier no longer occurred. Although Xiao Yan had long since expected this, he still involuntarily laughed in his heart. His strength was really so great that it was unreachable in the eyes of these people…</p><br/><p>This kind of change caused Xiao Yan to feel a little uneasy. However, it was fortunate that there was only a short journey left. The outline of an enormous city vaguely appeared in their sight when evening approached.</p><br/><p>Han Chong also sighed in relief when he saw the city, appearing to have released a heavy burden. Seeing their reaction, Xiao Yan also understood that this was the so-called Tian Bei City…</p><br/><p>Xiao Yan’s gaze swept randomly before taking two steps back. Coincidentally he stopped beside Han Chong, who hurriedly cupped his hands together when he saw Xiao Yan approach only to feel a gentle force blocking him. A helpless voice was immediately transmitted into his ears, “Big brother Han, there is no need to be so courteous. My life was rescued by you. Don’t call me whatever mister. Just call me as you did in the past.”</p><br/><p>“Miste… Brother Xiao Yan, you’re too courteous. With your current strength, it is likely that you would have been fine even without our rescue.” Han Chong hesitated a little before he spoke with a smile. However, his voice still contained an awe that was difficult to hide.</p><br/><p>Xiao Yan felt helpless. He flicked his finger and a medicinal pill landed in Han Chong’s hand without leaving a trace. He softly said in a random voice, “Keep the medicinal pill properly. It can aid you in increasing your chances of success of breaking through to the Dou Wang class.”</p><br/><p>Han Chong’s body suddenly trembled upon hearing this. Excitement appeared in his eyes. He had remained at the peak of the Dou Ling class for many years, but had yet to show any signs of breaking through. He knew that some high tier medicinal pills had the unique properties of aiding one in breaking through. However, the price of that kind of medicinal pill was incomparably high. How could he afford one with his wealth?</p><br/><p>“Brother… brother Xiao Yan, this gift is too valuable…” Han Chong spoke in a trembling voice. His eyes had become somewhat red because of his excitement.</p><br/><p>“Is it more valuable than my life?” Xiao Yan smiled and teased.</p><br/><p>“Brother Xiao Yan, you… are you planning to leave?” Han Chong carefully stored the medicinal pill away before suddenly asking.</p><br/><p>Xiao Yan was quiet for a moment, feeling somewhat unsure of how he should reply.</p><br/><p>“Ke ke, brother Xiao Yan. There is nothing hard to say. You do not have much of a relationship with the Han clan. Yet, you have rescued us twice along this journey. Even if you wish to return the favor, you have already done more than enough. The Hong clan is powerful. It would not be good if you are dragged in…” Han Chong smiled and spoke upon seeing his reaction.</p><br/><p>Xiao Yan was silent.</p><br/><p>Da! Da!</p><br/><p>The sound of horse hooves was transmitted from the city’s gate in the distance while Xiao Yan was chatting with Han Chong. It immediately galloped in their direction.</p><br/><p>Han Chong’s group, which had already been frightened before, hurriedly tightened the grip on the weapons in their hands upon seeing this activity. A moment later, however, a sharp-eyed person joyously said, “It’s our people.”</p><br/><p>The sound of horse hooves swiftly stopped in front of the convoy. Immediately, a figure leaped down from the horse. This person looked to be around twenty-three to twenty-four years old. He was wearing some brilliant clothes and looked extremely energetic. His face was also a little handsome. His tall body gave him an imposing appearance. However, Han Chong’s group knit their brows slightly together when they saw him.</p><br/><p>Han Xue also walked out of her carriage when the sound of horse hooves appeared. Her pretty eyes paused on Xiao Yan first, but he appeared to have not sensed them. He only bothered to chat with Han Chong. Seeing this, she could only unwillingly clench her teeth, turn her head, and look at the man, who had descended from the horse. Her eyebrows were slightly knit together.</p><br/><p>“Xue mei, are you alright?” A joy surged into the eyes of the man when he saw Han Xue. He swiftly walked forward and inquired in a concerned manner.</p><br/><p>TL: mei - sister, can be use an intimate way of calling a younger female relative.</p><br/><p>“I’m fine.” Xue Mei randomly replied. The corner of her eyes suddenly glanced at Xiao Yan who was slowly stepping back. She quickly turned around and cried out loud, “Stand where you are!”</p><br/><p>Xiao Yan could only stop his body when he saw Han Xue looking over and helplessly spread his hands to Han Chong.</p><br/><p>Han Xue’s pretty eyes stared at Xiao Yan. A moment later, she appeared to have thought of something. Her eyes dimmed and she softly said, “I have acted wilfully. If mister Xiao Yan really wishes to leave, please do so. Thank you for your care during this journey. Hopefully we will have the affinity to meet again in the future.”</p><br/><p>Xiao Yan bitterly laughed after she said such words. If he were to turn around and leave after she said those words, it was likely that the others would look at him with disdain.</p><br/><p>“Ugh, I will stay behind and take a look, but you should not place too much hope in me…” Xiao Yan sighed as he responded.</p><br/><p>“Really?”</p><br/><p>Han Xue said. Her dim eyes that caused one to feel one’s heart shatter immediately emitted a moving expression after hearing this.</p><br/><p>Xiao Yan could only nod his head when he saw this pretty face that appeared enchanting because of her happiness. His heart once again let out a bitter laugh. Something like a favor… was really as heavy as a mountain…</p><br/><p>“Xue Mei, who is this? It looks as though he is extremely unfamiliar. Is he also a guard of our Han clan?” The handsome man by the side naturally felt a jealousy surge out of his heart when he saw the usually cold and indifferent Han Xue revealing such ladylike mannerisms in front of this ordinary young man. Immediately, he randomly smiled and inquired. His tone contained exceptional disdain toward the guards, which had a servant like status.</p><br/><p>“Han Lin, you better be more courteous to my guest. He is not a guard, but an Honorary Guest whom I have invited on behalf of the Han clan. If you continue to randomly say any nonsense, don’t blame me for turning against you!” Han Xue suddenly turned her body. Her pretty face appeared to have completely transformed into a chilly one as she coldly chided.</p><br/><p>Han Lin’s face alternated between green and white upon being reprimanded by Han Xue in such a manner. He was immediately unable to control himself as he coldly laughed, “Honorary Guest? Xue Mei, I think that you have got things wrong, no? According to the rules of our clan, the first rule of an Honorary Guest is that he must have the strength of a Dou Huang. Although you are the daughter of the clan head, you cannot simply ignore the rules of the clan, can you?”</p><br/><p>A moving smile was suddenly revealed on Han Xue’s originally cold and indifferent face when she heard this. She waved her hand and some guards escorted two people from a carriage before throwing them in front of Han Lin.</p><br/><p>“He was able to capture Hong Mu and Hong Lie, these two Elders of the Hong clan alive. Why don’t you tell me if he is qualified?”</p><br/>\n</div>"}