{"title": "Chapter 964: Unexpected Change", "id": 964, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-964-unexpected-change", "volume_title": "Volume 10", "body": "<h1>Chapter 964: Unexpected Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 964: Unexpected Change</u></strong></p><br/><p>Xiao Yan had habitually revealed the Three Thousand Lightning Movement, which he had kept hidden, and successfully dodged the attack of this lightning beast. However, his body had just paused when the lightning beast sensed something. It raised its head to the sky and cried out furious. All four of its legs violently stomped on the ground. The crack lines spread and its body once again transformed into lightning that shot toward Xiao Yan.</p><br/><p>“Hmph!”</p><br/><p>A cold expression flashed across Xiao Yan’s face after meeting this lightning beast a couple of times. It was likely that this skill was Hong Chen’s killing move. Its strength was indeed quite great. It was likely a Di class Dou Skill. However, it seemed to require essence blood to activate. Thus, once this skill was used, he would descend into a weary state. In other words, the current Hong Chen was no longer in possession of fighting strength. As long as Xiao Yan was able to settle this lightning beast that was transformed from the lightning Dou Qi in Hong Chen’s body, this battle would end with the Hong clan losing.</p><br/><p>Xiao Yan swiftly took a couple of steps back. His hands swiftly formed some seals as numerous afterimages flew, causing one’s eyes to be dazzled. Following the formation of his hand seal, a wave of jade-green crystal glows swiftly surged from his hand.</p><br/><p>The hand seal was moved while the wild beats in front attacked once again. It was even accompanied by a little lightning roar. Xiao Yan frowned slightly. His footsteps withdrew once again and his mouth was also swiftly pulsing. In the end, he became like a toad as he suddenly opened his mouth. Immediately, a soul-stirring lion tiger roar charged up to the sky.</p><br/><p>“Lion Tiger Gold Shattering Roar!”</p><br/><p>The sudden substance-like sonic wave was spread out from Xiao Yan’s mouth quickly. In the face of a head-on collision with this sonic wave, the lightning beast’s body that was viciously pouncing over paused immediately. The thunderbolts all over its body were flashing wildly like electricity. Its four limbs also rubbed against the ground as it was forced back dozens of meters before finally managing to completely block the strength of the sonic wave.</p><br/><p>The strength from the sonic wave had just scattered when the lightning beast enormous eyes flickered. A low roar was emitted as it raised its forelimbs. Its enormous body pounced forward like a hungry tiger, that had found its prey, and it leaped dozens of meters forward before appearing above Xiao Yan’s head. Its savage mouth, covered in a lightning glow, viciously bit toward Xiao Yan’s head.</p><br/><p>Xiao Yan did not withdraw again in the face of the wild bite from the lightning beast. The rate at which his hands formed the seal became faster. An instant later, they suddenly paused and the bright jade-green crystal glow swiftly agglomerated into a mysterious energy handprint.</p><br/><p>This jade-green energy handprint was only the size of a palm. Its entire body was emitting a crystal luster, looking as though it was being manufactured by a green-colored crystal which gave it an exquisite appearance. Not only was its appearance beautiful, but the energy that was contained within it was quite frightening.</p><br/><p>While the handprint was formed, the dark figure above Xiao Yan’s head had also swiftly arrived. A cold smile surfaced on his face as he raised his head and looked at the enormous mouth of the lightning glow. His body dodged and his arm curled in a strange manner before pressing into the lightning beast’s head!</p><br/><p>“Sea Flipping Seal!”</p><br/><p>The lightning beast immediately unleashed a frightening roar when the two met. Crackling lightning arcs leaped all over its body. However, these lightning glows swiftly disappeared in a strange manner when they made contact with the jade-green crystal light.</p><br/><p>“Smash!”</p><br/><p>A chill flashed across Xiao Yan’s eyes as his mouth suddenly emitted a low cry. His hand shook violently and the strength of the light seal suddenly erupted!</p><br/><p>The bright jade-green glow was just like a sun that had exploded at this moment. The strength of the light covered the wild and violent lightning glow on the body of the lightning beast. Under the erosion of this majestic energy, the arrogant lightning beast emitted a sobbing whine. In the end, it turned into a silver-colored light spot with a ‘boom’ sound, and burst apart in front of numerous shocked eyes…</p><br/><p>The light seal had also swiftly disappeared the moment the lightning beast burst apart. Xiao Yan’s eyes were cold as he glanced at the shocked face of Hong Chen in the distance. He tightened his hand and the heavy ruler once again appeared. His feet stepped on the ground and his body instantaneously disappeared.</p><br/><p>Hong Chen’s expression changed the moment he saw Xiao Yan’s body disappear. He looked at the Mighty Lightning Hammer beside him and his hand hurriedly extended out. Before his hand could make contact with the hammer, however, a fierce wind viciously smashed into his body. The fierce force shook his body until it was dragged over the ground, forming a scar that was dozens of meters long.</p><br/><p>“Grug.”</p><br/><p>Hong Chen spat out a mouthful of fresh blood after suffering a heavy blow once again. Before he could get up, the black figure came attacking again. Finally, it carried the momentum of a lightning bolt as it ruthlessly came slamming onto Hong Chen’s head.</p><br/><p>“I admit defeat!”</p><br/><p>Hong Chen’s eyes shrank as he hurriedly cried out when he saw the enormous body of the ruler appearing.</p><br/><p>“Chi!”</p><br/><p>The heavy ruler came to a sudden stop when it was still half-a-foot from Hong Chen’s head. The force that was contained in it was transmitted down through the air and slammed Hong Chen’s entire body into the ground. Hong Chen appeared like a toad that had been flattened. His entire body appeared extremely miserable.</p><br/><p>At this moment, Xiao Yan was holding the ruler with one hand. The enormous ruler’s body paused above Hong Chen’s head while his entire body was pressed into the ground. This scene caused the entire Sky Stone Stage to become dead quiet.</p><br/><p>No one had expected such an ending. At the beginning, no one had thought that this renowned young genius of the Tian Bei City would be defeated in such a terrible and miserable manner by an unfamiliar-looking young man…</p><br/><p>The fight had lasted for a period of time, but anyone with truly great eyesight would have been able to discover that Hong Chen had used all of his strength while the linen-clothed, young man appeared like a rippleless old well since the beginning. He seemed like bottomless water that was unfathomable, making it difficult for others to predict anything…</p><br/><p>“He has really won…”</p><br/><p>Everyone from the Han clan in the Han clan’s seats looked at Hong Chen in the arena who was forced by Xiao Yan’s heavy ruler until he dared not even move. They inhaled a deep breath of air and muttered in a manner that suggested they did not quite dare to believe the situation.</p><br/><p>“Although I had already thought highly of him, it seems that I have still underestimated him. This young man is indeed incredible…” Han Chi softly exhaled as he sighed.</p><br/><p>The two happiest people were Han Yue and Han Xue. Han Yue sighed in relief, appearing as though she had removed a heavy burden while Han Xue was inexplicably happy. The skinny figure in the arena had unknowingly left behind an unforgettable imprint within her heart…</p><br/><p>“Clap clap!”</p><br/><p>The Sky Stone Stage was quiet for a moment before the silence was gradually broken by a wave of applause and cheers. The exciting battle between the younger generation had caused them to feel that their trip was worthwhile. This was especially the case for the linen-clothed, young man who had left them with an extremely deep impression.</p><br/><p>The expressions of the people from the Hong clan were unusually ugly amid the cheers of the entire place. Originally, they had thought that they had trapped the Han clan, but they ended up trapping themselves. They had lost all their face today.</p><br/><p>Xiao Yan slowly retracted his Heavy Xuan Ruler while standing in the arena. He lowered his head, glanced at Hong Chen before turning around to leave.</p><br/><p>Xiao Yan’s body had just turned around when a savage and vicious expression flashed across Hong Chen’s eyes while he lay on the ground. Both of his hands pressed on the ground and a lightning hidden arrow shot out of his sleeves and pierced toward Xiao Yan’s back.</p><br/><p>The sudden unexpected change had immediately caused a countless number of people to let out an exclamation. Immediately, curses sounded. Xiao Yan had let Hong Chen lived, yet the latter had actually dared to perform such a despicable and cowardly act…</p><br/><p>“Chi!”</p><br/><p>The lightning hidden arrow accurately struck Xiao Yan’s back in front of many shocked gazes before penetrating it. However, not even a little trace of blood appeared as a result. Instead, it caused the figure to gradually become blurry.</p><br/><p>“Afterimage?”</p><br/><p>Hong Chen’s heart was immediately shocked upon seeing this scene. He hurriedly pulled back. However, his feet had just stepped back when his body suddenly stiffened. A hand had unknowingly been placed on a spot behind him.</p><br/><p>“Stop!”</p><br/><p>Numerous furious roars were immediately emitted from the Hong clan’s seats when they saw Xiao Yan suddenly appearing behind Hong Chen. The gray-clothed, old man immediately moved, transforming into a blurry figure that shot toward the arena.</p><br/><p>“You have given this life of yours away. Don’t blame anyone but yourself.”</p><br/><p>A soft voice was transmitted into Hong Chen’s ear while a terrifying chill was spreading from Hong Chen’s heart. Before he could beg for mercy, a force had already been ruthlessly shot into his back.</p><br/><p>“Grug!”</p><br/><p>A mouthful of fresh blood was wildly spat out and Hong Chen’s body feebly fell. Finally, his head smashed onto the ground.</p><br/><p>Xiao Yan unleashed a breath and kicked out at the same time, sending Hong Chen’s body flying toward a force that was shot over.</p><br/><p>The gray-clothed, old man who was rushing over was just about to attack when he saw Hong Chen shooting toward him. He immediately waved his sleeve and the force was reduced. His hand grabbed Hong Chen and hurriedly observed him. Immediately, the man’s expression turned gloomy. Hong Chen did indeed still have a trace of breath remaining. However, the veins in his body had been completely broken by Xiao Yan’s palm. In other words, even if Hong Chen was healed, it was likely that he would be a cripple.</p><br/><p>The gray-clothed, old man’s gaze was sinister as he turned to Xiao Yan. In his extreme anger, he ended up laughing, “Good, good. You actually dared to kill someone from my Wind Lightning Pavilion. Brat, you will definitely regret it!”</p><br/><p>The old man swung his sleeves after his words sounded. A wind wrapped around the unconscious Hong Chen before throwing him toward Hong Li’s group who was following close behind. Hong Li received Hong Chen only for his expression to turn green immediately. His gaze was filled with a vicious expression as he looked at Xiao Yan.</p><br/><p>“Regardless of who you are, my Hong clan will not rest until you die!”</p><br/><p>Hong Li’s vicious voice caused the noisy Sky Stone Stage to gradually become quiet.</p><br/><p>Xiao Yan’s expression did not change in the face of these vicious words of Hong Li. He replied with a faint voice, “According to what clan head Hong has said, it is my fault for retaliating when he launched a sneak attack against me? You should also know that if I had not been quick to dodge earlier, my ending would not have been any better than his.”</p><br/><p>“The old me doesn’t care about this. You have beaten my son into a cripple. I will use your life as repayment!” Hong Li spoke in a savage manner.</p><br/><p>Xiao Yan coldly laughed.</p><br/><p>“There is no need for you to say anything more. Today, you will not be able to escape.” The gray-clothed, old man’s gaze coldly looked at Xiao Yan as he slowly said. “Before this, however, you must tell the old me just where you have learned the Three Thousand Lightning Movement from. The Wind Lightning Pavilion definitely does not have a disciple like you!”</p><br/><p>Xiao Yan knit his brows slightly. It had indeed been recognized, but so what if it had.</p><br/>\n</div>"}