{"title": "Chapter 971: Incomplete Scroll", "id": 971, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-971-incomplete-scroll", "volume_title": "Volume 10", "body": "<h1>Chapter 971: Incomplete Scroll</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 971: Incomplete Scroll</u></strong></p><br/><p>The place that appeared in front of Xiao Yan was a lightning world. Unimaginable numbers of thunderbolts came smashing down from the empty sky like a waterfall. They carried a soul-stirring bang along with a rich Heaven’s Might.</p><br/><p>Xiao Yan’s Spiritual Strength had just appeared in this lightning world when the numerous tilting lightning bolts seemed to have sensed him. With a ‘chi la’ sound, they cut through the air and suddenly emitted a glow, covering the entire sky.</p><br/><p>Xiao Yan’s brows were slightly knit in the face of these lightningbolts that had been shot in all directions. He knew that these were not genuine bolts of lightning, but were instead things created from Spiritual Strength that had been left within the scroll. This caused him to feel some joy.</p><br/><p>“Scatter!”</p><br/><p>With a tap of his finger in the empty sky, a powerful Spiritual Strength materialized where his finger had pressed, erupting out in an unceasing manner.</p><br/><p>The countless numbers of lightning bolts, that came rushing over, immediately crumbled wherever the Spiritual Strength moved. The lightning transforming into silver-colored light spots, that permeated the sky, before slowly turning into nothing.</p><br/><p>Xiao Yan broke the remnant Spiritual Strength within the scroll with his finger before he slowly swept his gaze around. The entire place was filled with a glaring silver color. Below was an extremely large silver lake. Lightning swam all over the lake like silver snakes, giving it the appearance of an electric pond.</p><br/><p>There was nothing else present in this place other than the electric pond below. It was also void of any information related to the so-called Three Thousand Lightning Illusionary Body.</p><br/><p>Xiao Yan’s gaze scanned this space an inch at a time before it finally paused on the electric pond below. His brows were bunched up. After musing for a moment, he once again pressed gently into the electric pond.</p><br/><p>Powerful Spiritual Strength swiftly surged down and finally swept through the electric pond. The lightning glow that lingered above swiftly scattered. Following the scattering of the lightning glow, the lake gradually became as clear as a mirror.</p><br/><p>Xiao Yan’s eyes were focused on the electric pond, which had turned clear. A moment later, a slight ripple quietly rose on its surface. Numerous words formed from the lightning glow wherever the ripple reached.</p><br/><p>Xiao Yan stood high in the air and looked down. He was coincidentally able to clearly read these words made out of lightning. Joy surged into his eyes. He focused his mind as his eyes carefully swept over those words, firmly remembering them in his mind.</p><br/><p>There were not many words formed from lightning glow on the surface of the lake. After around ten minutes or so, they Xiao Yan had commit them to memory. However, when Xiao Yan began to organize and practice it within his heart, he ended up knitting his brows tightly once again.</p><br/><p>According to Xiao Yan’s guess, the information was indeed related to the method of practicing the Three Thousand Lightning Illusionary Body. However, the sequence was completely chaotic. One could not gain the slightest clue from reading it.</p><br/><p>“Chen Yun possessed quite a high position within the Wind Lightning Pavilion. He should not be in possession of a fake Dou Technique, but why is it that I cannot see any of the training methods for it? Moreover, if I look at it carefully, I seem to feel that there are many things missing.” Xiao Yan softly muttered.</p><br/><p>Xiao Yan mused for a moment before once again shutting his eyes. He began to slowly organize the chaotic information within his mind. This organizational process continued for nearly an hour…</p><br/><p>By the time Xiao Yan opened his eyes again, the doubt within them had already disappeared. After this long period of study, he had indeed discovered some problems. This was indeed the training method for the Three Thousand Lightning Illusionary Body. However, it was incomplete. It was merely a portion of the entirety. The feeling of it possessing a defect had originated from this earlier.</p><br/><p>“The Three Thousand Lightning Movement has already been divided into a few portions. This Chen Yun possessed only one of them. How regretful…” Xiao Yan sighed somewhat gloomily. However, he felt that it was normal after thinking about it. Being the most prized treasure in the Wind Lightning Pavilion, how could this Three Thousand Lightning Illusionary Body be placed in the hands of an Elder. Placing them separately was the safest method.</p><br/><p>“I wonder where the remaining portions are. If I have the chance, I will definitely gather all of them. If I am able to successfully master this Three Thousand Lightning Illusionary Body, it will definitely be a great help in the future.” Xiao Yan gently sighed. He once again glanced at this lightning world and shook his head. His body gradually became pale and disappeared a moment later.</p><br/><p>Following Xiao Yan’s disappearance, this lightning world once again became rampant with a wild violence.</p><br/><p>Xiao Yan slowly opened his eyes within the cave. He looked at the bright-silver-colored scroll in his hand and involuntarily laughed. It was not easy to obtain a Di Class High Level Dou Technique. However, it was fortunate that he had not gained nothing. At the very least, he had obtained a portion of the method to practice the Three Thousand Lightning Illusionary Body. According to his guess, the remaining portions should be in the hands of the other Elders from the Wind Lightning Pavilion. If he had the opportunity in the future, he might be able to think of a way to get them.</p><br/><p>After softly laughing, Xiao Yan stored the silver-colored scroll into the Serene Sea Ring. After which, he shifted his mind away from it. Currently, the most important thing was to remove the so-called Blood Lightning Seal in his body. Otherwise, it would really be as Chen Yun had said. With this thing as a beacon, he would be sensed no matter where he was.</p><br/><p>Xiao Yan exhaled gently and swiftly entered his training state. His mind sank into his body and began to scan every inch of it.</p><br/><p>However, Xiao Yan was stunned to discover that there was nothing unusual within his body after the scan finished. There was not the slightest trace of the Blood Lightning Seal.</p><br/><p>“It is impossible for it not to exist. I personally witnessed that thing enter my body…” Xiao Yan muttered. A thought immediately passed through his mind and the Glazed Lotus Heart Flame followed his veins, and was slowly circulated. Finally, it erupted and spread throughout every part of his body.</p><br/><p>The flame burned fiercely within his body. A moment later, Xiao Yan finally sensed an unusual feeling being transmitted over. His mind moved and appeared at the spot where the unusual feeling had originated from.</p><br/><p>The spot where the unusual feeling was transmitted from was an isolated place. However, it was still found with the full search conducted by the Glazed Lotus Heart Flame. At this moment, there was a tiny scarlet-silver imprint on this vein. A vague weak glow was flickering as the flame burned.</p><br/><p>“It has indeed hid itself very deep. If not for the strength of the ‘Heavenly Flame,’ it is likely that I would have difficulty finding it.” Xiao Yan looked at this scarlet-silver-colored seal and coldly laughed. He could sense that this trace of seal contained a strange energy. Xiao Yan was not unfamiliar with this kind of energy. When he was practicing the Three Thousand Lightning Movement back then, he had also absorbed a thread of this kind of Wind Lightning Strength from the wind and thunder…</p><br/><p>This kind of energy was a little stronger than an ordinary Dou Technique. If an ordinary person were planted with such a seal, it was natural that he would not dare to forcefully remove it because the Wind Lightning Strength would cause a lot of damage to the internal parts of one’s body should it explode. However, it was fortunate that despite the Wind Lightning Strength being troublesome, the strength of the ‘Heavenly Flame’ was even more troublesome and strange!</p><br/><p>A cluster of jade-green flames swiftly spread out as a thought passed through his mind. After which, it wrapped the seal and the vein within it. A frighteningly high temperature immediately permeated the place.</p><br/><p>Due to the Glazed Lotus Heart Flame having been completely refined by Xiao Yan, this kind of high temperature would not harm him, and it would cause his veins to feel a warm comfortable feeling. On the other hand, that blood lightning seal had become a little distorted under the high temperature. Threads of blood colored energy gradually turned into nothingness as the high temperature penetrated it…</p><br/><p>“This Blood Lightning Seal does indeed possess a strangeness. Even the ‘Heavenly Flame’ required a good amount of time in order to remove it. However, this is because my strength is a little weak. Looks like I should raise my strength as soon as possible. Perhaps I should also consume a Mighty Huang Pill…” Xiao Yan muttered to himself. He studied the Blood Lightning Seal as it gradually turned paler within the ‘Heavenly Flame.’</p><br/><p>The Mighty Huang Pill was a high tier medicinal pill that was only effective to an expert Dou Huang. An expert Dou Huang would have the chance to raise his strength by one or even two stars if he consumed it. However, a person could only consume such a medicinal pill once. After which, it would lose its effect. Fortunately, Xiao Yan had never consumed one. However, the current situation was one where he might have to rely on this thing…</p><br/><p>“Once I have removed this Blood Lightning Seal, I will find another safe place to consume the medicinal pill and raise my strength in an attempt to quickly breakthrough to the Dou Zong class. The strength of a Dou Huang is far from sufficient to roam the Central Plains!”</p><br/><p>Xiao Yan made up his mind and hurriedly focused his attention, urging the ‘Heavenly Flame to swiftly refine the Blood Lightning Seal.</p><br/><p>This refinement continued for around two hours before the Blood Lightning Seal turned into a cluster of blood-colored fog that was finally vaporized into nothingness under the grilling of the flame.</p><br/><p>Xiao Yan slowly opened his eyes when the Blood Lightning Seal completely disappeared. He sighed in relief, appearing to have released a heavy burden as he said, “I have finally settled this… now, it is time for me to leave!”</p><br/><p>Xiao Yan stood up from the ground and tidied himself. After which, he returned the Earth Demon Puppet to his Storage Ring and walked swiftly to the entrance of the cave. Just as he was about to open the enormous rockdoor at the entrance of the cave, a rumbling loud voice was suddenly transmitted from outside. The intense trembling caused the interior of the cave to become shaky.</p><br/><p>“Xiao Yan, come out!”</p><br/><p>Just when Xiao Yan was stunned by this unexpected change, a furious roar reverberated over the mountain range like thunder!</p><br/><p>“Chen Yun? He has actually chased me to this place…”</p><br/><p>Xiao Yan’s expression instantly became ugly when he heard the roar from outside. It was unexpected that the old fellow hated him to such an extent. He had actually followed him within such a short period of time. Since Chen Yun dared to give chase, it was likely that Hong Tian Xiao had also arrived. If Xiao Yan did not use some true skill when facing two elite Dou Zongs, it was likely that the matter today would not end well.</p><br/><p>Xiao Yan inhaled a deep breath. A ruthless expression also flashed within his eyes. These two old fellows were pressing him. As the saying went, a rabbit would also bite someone in its anxiety, much less Xiao Yan, who was a fierce wolf with sharp teeth.</p><br/><p>“Hee hee, little fellow, it is unexpected that the old me has found you in such a miserable setting when I woke up. It is really a blessing to my eyes…”</p><br/><p>When Xiao Yan was planning to go all out in his heart, an elderly teasing laughter suddenly sounded within his heart without any forewarning.</p><br/><p>“Old Mister Yao?”</p><br/><p>Xiao Yan exclaimed when he heard this familiar laughter. A joy that was difficult to hide surged into his eyes.</p><br/>\n</div>"}