{"title": "Chapter 976: Nine Star Dou Huang", "id": 976, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-976-nine-star-dou-huang", "volume_title": "Volume 10", "body": "<h1>Chapter 976: Nine Star Dou Huang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 976: Nine Star Dou Huang</u></strong></p><br/><p>Clouds lingered over the mountain peak as space rippled. Wave after wave of mottled energy swiftly appeared. It surged into the body of the young man seated on the edge of the mountain peak from all directions. Faced with this endless pouring in of energy, Xiao Yan’s body also appeared like a bottomless pit. It did not show any sign of being filled regardless of how the energy poured into him.</p><br/><p>Xiao Yan had already maintained this state for three days ever since he had consumed the Mighty Huang Pill. His body was just like an unmoving rock during these three days. Only the repeatedly rotating energy swirl above his head on the mountain peak emitted a soft howling sound.</p><br/><p>The enormous medicinal strength of the Mighty Huang Pill within Xiao Yan’s body had already transformed into surging Dou Qi that flowed like floodwater within Xiao Yan’s veins. Moreover, there was an unceasing amount of natural energy surging in from nature. It was refined by the ‘Heavenly Flame,’ transforming into pure Dou Qi that merged into this large cluster of energy.</p><br/><p>Although there was a large quantity of natural energy, the remaining pure Dou Qi, that Xiao Yan absorbed, was of a small quantity after numerous refinements. However, it was at least better than nothing. Accumulated water would eventually form a river while dripping water would eventually penetrate a rock. Such accumulation over time would reach quite a frightening level. The Dou Qi within most of the practitioners had been acquired in this manner. Relying on medicinal pills to raise one’s strength was, after all, a short-cut. It could not be used excessively or one would fail to reach a higher level due to the faster training speed.</p><br/><p>However, if one really wished to talk about it, this was the first time that Xiao Yan had used a medicinal pill to raise his strength. He had never used a Dou Spirit Pill when he was in the Dou Wang class. Hence, he was not in the category of overuse.</p><br/><p>The training of Xiao Yan lasted for quite a long time. The medicinal strength of the Mighty Huang Pill within his body had already been completely refined a day earlier. However, he did not immediately move. Instead, he chose to continue training. This was because he had vaguely sensed that the medicinal strength of the Mighty Huang Pill alone would be insufficient to allow him to raise his strength by two stars. He always pursued perfection in everything he did. It was a golden opportunity this time around. Naturally, he needed to grasp it and raise his strength by the greatest possible extent…</p><br/><p>Another four days passed while Xiao Yan maintained this attitude. During these seven days, Xiao Yan had placed all his attention on absorbing the natural energy. Under this unceasing absorption, the Dou Qi that flowed within his veins had gradually surged and become forceful. Each time it circulated, it would bring about an unceasing amount of energy. Such a filled feeling caused him to possess an impulse to roar at the sky…</p><br/><p>Of course, such an impulse was naturally suppressed by him. He clearly knew that if he let out a roar, the hard work that he had put in during his training would likely be wasted.</p><br/><p>Time swiftly passed during the training. The mountain peak was still as quiet as before. Occasionally, the Earth Demon Puppet would suddenly raise its head and throw a punch toward a spot not far from the mountain. A frightening force penetrated the air and smashed a Magical Beast, that had flown within a hundred meter radius of the mountain peak, into a pile of flesh. During this period of time, this mountain peak had basically become a forbidden ground within the mountain range. The Magical Beasts that had suffered some losses had also learned to be much more obedient. They would take a detour when passing through this place. Therefore, Xiao Yan’s training progressed in an extremely stable manner.</p><br/><p>A little activity finally appeared on the morning of the eighth day. The energy swirl above Xiao Yan’s head trembled a couple of times before slowly scattering. The fluctuating space around him had also gradually returned to its calm state.</p><br/><p>The energy swirl had disappeared for a short while before Xiao Yan’s eyelids began to twitch gently. A moment later, they were slowly opened.</p><br/><p>The dark-black eyes were ancient yet ordinary. They were so calm that they appeared to have just awoken. There was not the slightest ripple within them.</p><br/><p>The training seal was gently scattered. Xiao Yan slowly raised his head and his hand spread out in a flat manner. A thought passed through his mind and the surging Dou Qi that flowed within his veins immediately began to churn. Finally, it was like a horse that had lost its restraint as it fled Xiao Yan’s veins and merged into his body…</p><br/><p>With the majestic Dou Qi having merged with every part of Xiao Yan’s body, a sharp glow suddenly appeared in Xiao Yan’s dark-black eyes. His aura was also raising straight up at this moment. It swiftly broke through the seven star level and crossed into the eight star level!</p><br/><p>The aura did not come to a stop after breaking through to the eight star level. Instead, it surged wildly. The clothes on Xiao Yan’s body fluttered in the absence of the wind, and the stone Xiao Yan was seated on also emitted a ‘crack’ sound. A couple of tiny lines appeared in the stone. The surrounding permeating fog also appeared to have been pulled apart by a pair of invisible hands.</p><br/><p>The fog rapidly swelled. A moment later, Xiao Yan finally reached the peak of the eighth star. A layer of invisible film suddenly appeared and suppressed the rising aura.</p><br/><p>Xiao Yan clenched both his hands abruptly as he sensed the faint clogging feeling. He did not stop at this point. Instead, he suddenly stood up and let out a long howl toward the sky.</p><br/><p>A clear crane-like cry instantly penetrated the clouds and resounded over the mountain range. It was a long while before it calmed down.</p><br/><p>The howl lasted for quite a long time, as though a breath was forced to its limit. Xiao Yan’s face had also become flush-red because of this. Green veins pulsed like earthworms on his face, giving him a ferocious appearance.</p><br/><p>“Break it!”</p><br/><p>Xiao Yan’s hands were clenched tightly. The piece of enormous rock under his feet suddenly burst apart. Rock fragments flew in all directions as a stern cry was emitted from Xiao Yan’s mouth.</p><br/><p>“Crack!”</p><br/><p>Somewhere, a non-existent layer was broken. The aura belonging to Xiao Yan, which had ceased rising, rose once more, breaking through the eighth star level, finally stopping on the ninth star!</p><br/><p>The aura had just broken through to the ninth star when it came to a sudden stop. Xiao Yan’s body collapsed in a weary manner. His hands supported himself on the ground while he panted repeatedly with a flushed face. Although his limbs had already become weak, there was a joy that was difficult to hide within his eyes. He knew that the current him had broken through to the ninth star level with the help of the Mighty Huang Pill and his own resolution!</p><br/><p>In other words, the current Xiao Yan was a nine star Dou Huang. There was only the gap of one star to the Dou Zong class!</p><br/><p>Although this one star has halted a countless number of experts, Xiao Yan had confidence in himself. This Dou Zong would not be his end!</p><br/><p>“Little fellow. Not bad. You actually know how to push forward a little at such a moment, relying on your willpower to advance. The old me has not seen this for many years…” Tian Huo zun-zhe’s sigh was slowly emitted while Xiao Yan was panting.</p><br/><p>“Old mister Yao has overpraised me. It is just that a break was being restrained in my heart, and I wished to spit it out. However, it is unexpected that I broke through this barrier.” Xiao Yan rubbed away the cold sweat on his forehead and laughed. After the earlier weariness, he could sense a majestic Dou Qi surging through his body. That weary feeling swiftly disappeared.</p><br/><p>“Regardless of how it happened, it is still not something easy to achieve…” Tian Huo zun-zhe laughed.</p><br/><p>Xiao Yan beamed. He stood up from the ground and twisted his body. The bones all over began to crackle. A comfortable feeling, that came from deep within his body, traveled through his entire body, causing Xiao Yan to involuntarily let out a groan.</p><br/><p>“Is this the feeling of a nine star Dou Huang… it is indeed very strong…”</p><br/><p>Xiao Yan clenched his fist and suddenly threw a punch out. The space in front of him immediately fluctuated. A sharp sonic boom was formed on his fist, which possessed an extremely great might. The strength of this force was really a couple of times stronger than a couple of days ago.</p><br/><p>After inhaling a breath of somewhat moist air, Xiao Yan turned his head. He glanced at the Earth Demon Puppet before involuntarily smiling. Using this thing as a guard was really quite good.</p><br/><p>“Now that I have consumed the Mighty Huang Pill, I should leave this place. After having killed Chen Yun, it is likely that the Wind Lightning Pavilion will not take such a blow lying down. It is now not the best time to clash head-on with them. I should find a city with a Wormhole and leave this place to hide from them. Trying my best to break past the Dou Huang class as soon as possible is the most important thing…”</p><br/><p>Xiao Yan mused for a moment. Finally, he waved his hand and stored the Earth Demon Puppet into his Storage Ring. After which crystal bone wings were expanded from behind his back. Wild wind rose with a flap of the bone wings, blowing away the fog around the mountain peak. Xiao Yan’s body had transformed into a ray of light that rushed out before flying to the exit of the mountain range.</p><br/><p>The forest had finally become sparse after Xiao Yan flew through the mountain range for a couple of hours or so. The outline of a city also vaguely appeared in Xiao Yan’s eyes.</p><br/><p>Xiao Yan landed not far from the city. After which, he swiftly headed to the entrance of the city. However, he hesitated for a moment upon seeing some human figures on the road. He took out a Doupeng from his Storage Ring, covered his head, and finally walked toward the city.</p><br/><p>Xiao Yan’s gaze paused on the entrance of the city when he was close to it. Quite a number of human figures had gathered there. He vaguely able heard some words like ‘wanted.’</p><br/><p>With a slight frown, Xiao Yan approached the city’s entrance without anyone noticing. His gaze swept over the wall where the crowd had gathered and his eyes immediately solidified.</p><br/><p>A bright silver paper was on the city wall. It contained the portrait of a person on it. Surprisingly, it was that of Xiao Yan’s head. Below the drawing was a silver-colored tower-shaped seal. This badge had once appeared on Chen Yun’s chest…</p><br/><p>Clearly, this was a wanted poster. Its target was Xiao Yan.</p><br/><p>Many curious people were gathered in front of the wanted poster. Numerous discussions popped up.</p><br/><p>“It is rumored that this little fellow killed Chen Yun of the Wind Lightning Northern Pavilion. No wonder the Wind Lightning Northern Pavilion has issued a wanted order…”</p><br/><p>“Really? This fellow looks no older than his twenties. That Chen Yun is an elite Dou Zong.”</p><br/><p>“Chi, you have not heard about the matter in Tian Bei City the other day. The Hong clan of the Tian Bei City has been turned into a miserable state.”</p><br/><p>“What is the use of issuing a wanted order now. No one knows just where he has run off too. He might have already left the northern region.”</p><br/><p>“The Wind Lightning Pavilion has not only issued a wanted order, but the Han clan of the Tian Bei City has also been placed under house arrest by the people from the Wind Lightning Northern Pavilion. They should be thinking of using them to force Xiao Yan out. However, it is not like that Xiao Yan is a fool. How could it be possible for him to fall into their trap when he clearly knows that there are three experts from the Wind Lightning Northern Pavilion in Tian Bei City…”</p><br/><p>Xiao Yan’s body trembled violently upon hearing the last sentence. His face under the Doupeng had suddenly turned gloomy. His tightened fist also emitted a cracking sound.</p><br/><p>“Wind Lightning Pavilion…”</p><br/><p>A voice that contained a sinister killing intent softly seeped out of the gap between Xiao Yan’s teeth! The fury and hatred within it was not the least bit hidden. Clearly, Xiao Yan had grown extremely angry at this moment. His usually expressionless-self had unleashed the anger that he had suppressed within his heart.</p><br/>\n</div>"}