{"title": "Chapter 997: Wang Chen", "id": 997, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-997-wang-chen", "volume_title": "Volume 10", "body": "<h1>Chapter 997: Wang Chen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 997: Wang Chen</u></strong></p><br/><p>Xiao Yan smiled slightly as he looked at the pretty face, filled with disbelief. His voice had become much gentler as he softly asked, “Are you alright?”</p><br/><p>Those matters back then had completely vanished the moment the Misty Cloud Sect had disband. Xiao Yan was not a narrow-minded person. He had gradually forgotten those matters. When he recalled them now, he could only describe them as the frivolousness of youth.</p><br/><p>Nalan Yanran was also a little startled at the gentle manner in which Xiao Yan spoke. She had seldom seen Xiao Yan speak to her in such a calm manner. After all, she was aware of just what kind of trouble and harm that the events back then had brought to this prideful man.</p><br/><p>“I’m fine… thank you.”</p><br/><p>Nalan Yanran’s pretty eyes flickered slightly while she shook her head and softly replied.</p><br/><p>“It seems that this friend really want to act like a hero rescuing a beauty.” The expressions of the three yellow-clothed men sank when they saw Xiao Yan ignore them right from the beginning. The one who called himself Huang Tian earlier confronted him with a gloomy voice.</p><br/><p>“Get lost.”</p><br/><p>Xiao Yan did not shift his eyes even a little as he softly spoke. After which, he slowly walked to Nalan Yanran’s side and glanced at the black-colored energy that was entwined around her body. He involuntarily laughed with a soft cold voice, “Darkness affinity Dou Qi is really rare. However, you actually launched a sneak attack despite your strength. This is really rather disdainful.”</p><br/><p>Xiao Yan grabbed Nalan Yanran’s snow-white wrist after saying those words. A wisp of jade-green flame surfaced on the tip of his finger before it shot out in a lightning-like manner.</p><br/><p>In the face of Xiao Yan’s swiftly flicked finger, the black-colored energy which entwined around Nalan Yanran’s body appeared like snow that had met fire as it swiftly melted.</p><br/><p>The man in deep-yellow clothes on the tree branch narrowed his eyes as he looked at Xiao Yan below. This was especially the case when he saw him easily expel the black-colored energy on Nalan Yanran’s body, causing his eyes to involuntarily shrink a little more.</p><br/><p>As the black-colored energy on her body gradually disappeared, Nalan Yanran also once again recovered her freedom and gently opened her palm. Seeing this, Xiao Yan also hurriedly released his hand. He was just about to speak when Nalan Yanran’s expression changed slightly. She hurriedly cried, “Be careful!”</p><br/><p>Xiao Yan, who was facing Nalan Yanran, smiled. He immediately turned his body around and his heavy ruler appeared in his hand. The heavy ruler contained a powerful wind as it was violently swung.</p><br/><p>“Crack.”</p><br/><p>The black ruler violently smashed into three long spears. The powerful force shattered the long spears into pieces. Seeing this, a shock surfaced within the hearts of Huang Tian and the other two. They threw aside the spear handles in their hands and swiftly pulled back.</p><br/><p>Xiao Yan’s eyes indifferently swept over the three of them. The heavy ruler in his hand was inserted into the ground. His feet stomped on the ground and a wind lightning sound appeared. His body also strangely disappeared.</p><br/><p>Huang Tian and the other two were startled when they saw Xiao Yan disappear in a strange manner. They were just about succeed in positioning their backs to face each other to protect themselves when a ghost-like figure appeared in front of them. Sharp wind made of fists suddenly arrived and viciously landed on the armor on the surface of their bodies.</p><br/><p>“Bang!”</p><br/><p>The fists landed heavily on the three of them. At the same time, a terrifying force came pouring out. Those three were just like kites whose strings had broken. They flew backwards before colliding into a couple of large trees. A mouthful of fresh blood was spat out of each of their mouths.</p><br/><p>Defeating three four stars Dou Huangs with just a single move. Nalan Yanran’s hand involuntarily covered her red lips when she saw this scene. Immediately, her gaze was filled with complexity while looking at that skinny back. This young man, whom she once thought of as trash, had walked ahead of her. All she could do was look up to him. It was the case a couple of years ago and it was still the case now that a couple of years had passed…</p><br/><p>Huang Tian and the other two curled together on the ground like prawns, moaning. The armor on their bodies had been shattered by one punch from Xiao Yan. They could not understand just why they were unable to even withstand a blow from this brat with their strength. It was likely that one could hardly find any people even in the entire northern regions of the Central Plains who could do this. The fellow in front of them… just where did he come from?</p><br/><p>“Clap clap!”</p><br/><p>An applause was suddenly transmitted from the tree branch above. A man with a scar on his face slowly stood up. His gaze was focused on Xiao Yan as he revealed an ugly smile, “Not bad, you are called Xiao Yan? May I ask if the one who has a conflict with the Wind Lightning Pavilion is you?”</p><br/><p>Xiao Yan glanced at the scarred man before narrowing his eyes. This person was extremely strong. There was a vast difference in strength between him and those three earlier.</p><br/><p>“Xiao Yan, be careful. He is very strong.” Nalan Yanran’s hand gently beckoned to the dense fog, and a white figure flashed and appeared. After which, it pounced into her embrace, transforming into a cute white fox. She spoke in a worried voice while hugging this white fox.</p><br/><p>“Why are they attacking you?” Xiao Yan nodded and asked.</p><br/><p>“There is a natural maze outside of the Heaven Eye Mountain. If a person who isn’t aware of it walks in, it is likely that he will be trapped within it until the energy tide is over. This Psychic White Fox of mine is immune to the maze. One will be able to successfully walk out of the maze if one follows it. They are attacking me because they wish to snatch the white fox away.” Nalan Yanran’s hand gently rubbed the soft fur of the white fox as she softly explained.</p><br/><p>Xiao Yan only came to a sudden understanding upon hearing this. It was unexpected that there was actually a maze in front. Fortunately, he did not randomly barge in. Otherwise, even with his Spiritual Perception, it was likely that he would be trapped for a long while. The thing which he really could not afford to waste now was time…</p><br/><p>“I am not interested in your white fox. I don’t need such a thing. However, these three fellows need it…” The man with a knife scar spoke indifferently. “I have some old friendship with a person from the Ground Spirit Gate. He had instructed me to bring these people to the front of the maze before we left… my method is a secret of the faction and cannot be shared with others. Therefore, I can only find a Psychic White Fox to lead them.”</p><br/><p>“We will not hand the White Fox to you. Please leave…” Xiao Yan smiled slightly to the scarred man as he spoke.</p><br/><p>“I, Wang Chen, is not someone who can be so easily dispatched.” The scarred man parted his mouth and grinned. There was a faint dense feeling within it.</p><br/><p>“Wang Chen? The Yellow Spring Pavilion’s Wang Chen?” Nalan Yanran involuntarily exclaimed when those words sounded. Her pretty face also changed a little.</p><br/><p>“Yellow Spring Pavilion?” Xiao Yan was also startled. Immediately he broke into a smile. He had met people from three of the four pavilions along the way, and wondered when he would meet someone from the so-called Fallen Star Pavilion.</p><br/><p>“Xiao Yan, why don’t we hand the white fox to them? This Wang Chen is extremely bloodthirsty. Moreover, he is very strong. It is likely that he is already the peak of the Dou Huang class. According to rumors, he had once fought with some Dou Zong class old demon and did not die…” Nalan Yanran bit her lower red lip with the back of her teeth. She struggled for a moment before finally spoke hesitantly. She did not wish to drag Xiao Yan into this mess.</p><br/><p>“How will we pass through the maze without the white fox?” Xiao Yan turned his head and glanced at Nalan Yanran. He seemed to be aware of her concern as he grinned and said, “Relax, leave him to me.”</p><br/><p>Nalan Yanran was stunned when she saw the smile of the young man. For some unknown reason, her heart felt a firm and safe feeling. All she could do was gently nod her head.</p><br/><p>“You can forget about the white fox. If you want it, we will just have to see if you have the ability…” The smile on Xiao Yan’s face had become much dimmer. His hand slowly grabbed the Heavy Xuan Ruler beside him as he spoke.</p><br/><p>The smile on Wang Chen’s face involuntarily became denser upon hearing Xiao Yan’s words. Anyone familiar with him knew that each time he happily smiled, was the time when the killing intent within his heart had become extremely dense.</p><br/><p>“I have met with Tang Ying from the Ten Thousand Sword Pavilion not long ago and exchanged blows with him. He said there would be a person even more fun to play with behind. I think that he was talking about you.” Wang Chen slowly lowered his hand. A dense, black-colored energy swiftly lingered over it. He looked at Xiao Yan as his bright red tongue licked his lips. An instant later, his eyes suddenly turned dark, “In that case, allow me to see if you are as fun to play with as he described.”</p><br/><p>Wang Chen’s body suddenly transformed into a black line that shot out after his words sounded. In the blink of an eye, he appeared in front of Xiao Yan. His fist, which was covered with black energy, carried a bloody wind as it struck towards Xiao Yan’s heart without any fancy moves.</p><br/><p>“Be careful!”</p><br/><p>Nalan Yanran hurriedly reminded when she saw Wang Chen suddenly attack.</p><br/><p>“Bang!”</p><br/><p>A black figure flashed and stood in front of Xiao Yan like a shield in a lightning-like manner. The fist immediately smashed into it, emitting deep sound.</p><br/><p>“Corpse Eroding Hand!”</p><br/><p>His fist swiftly spread and transformed into a kind of permeating dark-black color. It strangely bypassed the enormous ruler and headed for Xiao Yan’s throat.</p><br/><p>Wang Chen’s attack trajectory was somewhat strange. It swayed all around, appearing like a wooden doll that was not being controlled. It did not appear fast, but it caused one to have a strange feeling of having a difficult time dodging it.</p><br/><p>Xiao Yan’s gaze was intently watching the dark-black hand, which was quickly being magnified in his eyes. An instant later, his eyes coagulated. A jade-green flame surged onto his fist without hesitation before he threw a punch out.</p><br/><p>“Boom!”</p><br/><p>The fist struck the dark-black hand in an extremely accurate manner. The hot flame caused Wang Chen’s hand to emit a dense, white smoke. In the face of a ‘Heavenly Flame,’ the corrosive properties of Wang Chen’s darkness affinity Dou Qi were completely ineffective.</p><br/><p>The powerful collision brought about a strong air wave that spread apart with a bang. It struck the enormous trees nearby until their trunks were snapped apart. The ground had thus become a complete mess.</p><br/><p>“Heavenly Flame?”</p><br/><p>The exchange of the fists continued for an instant before Wang Chen’s expression changed. His feet hurriedly pulled back and the Dou Qi within his body surged. Immediately, he forced out the small wisp of jade-green flame from his palm. His expression gradually became gloomy when he saw that flame.</p><br/><p>Xiao Yan’s finger flicked the Heavy Xuan Ruler, returning it to his Storage Ring. He glanced at Wang Chen. This person was indeed strong. However, he was not much a threat from Xiao Yan’s perspective. Although darkness affinity Dou Qi was strange and unpredictable, it was miserably suppressed in the face of a ‘Heavenly Flame.’ If they were to really fight, Xiao Yan was confident he had a seventy percent of killing this person.</p><br/><p>Wang Chen smiled in a dark, cold manner. He did not even look at Huang Tian and the two others as his body withdrew and entered the dense fog. A voice was slowly emitted as he did so.</p><br/><p>“No wonder Tang Ying thinks so highly of you. You do possess some ability. Today’s matter will end here. I will wait for you on the Heaven Mountain Stage and see if you have the ability to arrive there…”</p><br/>\n</div>"}