{"title": "Chapter 993: Brief Fight", "id": 993, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-993-brief-fight", "volume_title": "Volume 10", "body": "<h1>Chapter 993: Brief Fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 993: Brief Fight</u></strong></p><br/><p>The enormous mountain range was covered in fog, appearing just like a Magical Beast from ancient times at this moment. Numerous deep rumbling sounds were emitted from the sky of the mountain range. Accompanying the appearance of these loud sounds was a vast energy that came from all directions.</p><br/><p>“Boom!”</p><br/><p>The vast energy churned quickly within the dense fog. In the end, it emitted a sound similar to the churning of ocean waves. This strange scene caused quite a number of people to let out an exclamation. Nature was indeed filled with mysteries.</p><br/><p>The enormous energy tide accompanied the surging. A moment later, it charged through the clouds and spread in a crashing manner. This tide shocked some of the people who had remained in the sky, forcing them to rush down. If they were to be swept away by the frightening energy tide, even an elite Dou Zong would likely be hurt even if they did not die.</p><br/><p>The enormous energy tide turned into a colorful one.. Under the sunlight, it appeared just like an incomparably spacious river. It hung in the sky, looking extremely gorgeous. However, under its brilliance hid a fatal danger.</p><br/><p>Wave after wave of colorful energy spread out from within the mountain range in an unceasing manner. At this moment, quite a number of people had sensed the energy within the Heaven Eye Mountain Range become fierce and powerful. Its appearance was like the Heaven Eye Mountain Range had turned into a magnet that attracted all of the energy over.</p><br/><p>Even Xiao Yan could not help but feel shocked in the face of this spectacular scene. By relying on his extraordinary Spiritual Perception, he could clearly sense the colorful energy within it had reached an extremely frightening level.</p><br/><p>“This place is indeed worthy of being the Central Plains. Such a scene is not something that one would be blessed enough to see in other places…”</p><br/><p>Xiao Yan stood up after letting out a soft laugh. His gaze was thrown toward the Heaven Eye Mountain Range. At this moment, the energy within the mountain range had become so dense that it caused one to be surprised. Although one would not be able to train for long within it, such an attempt would definitely make for some efficient training. No wonder so many people were attracted despite clearly knowing that there were only ten spots in the Heaven Mountain Blood Pool. It was likely that quite a number of people were planning to train within the mountain range during this period of time.</p><br/><p>Xiao Yan’s gaze shifted over the mountain range before finally pausing on the entrance. The great sea of people there had already begun to move. Regardless of where one was, the first always had some special benefit. It was likely that the first person who entered this Heaven Mountain Blood Pool would also obtain the best effect. Hence, everyone wanted to be that lucky first…</p><br/><p>Xiao Yan’s eyes looked at the sea of people only to end up smiling. There was a fiery heat within his eyes. The fight for this Heaven Mountain Blood Pool had somewhat exceeded his expectations. It was likely that this competition would also be quite exciting. Moreover, he also wanted to try and see just what level the members of the younger generation in the Central Plains were at.</p><br/><p>“Bang!”</p><br/><p>A chaotic sound of footsteps as well as a loud roar suddenly sounded while this thought lingered in Xiao Yan’s heart. Immediately, he saw the large sea of people noisily moved, forming a human flow that wildly surged into the mountain range.</p><br/><p>“Has it begun…”</p><br/><p>The entire surroundings of the Heaven Eye Mountain Range had become fiery hot within an instant…</p><br/><p>“Screech!”</p><br/><p>A clear cry from a crane sounded and the enormous, colorful crane in the sky immediately flapped its gigantic wings. It flew down, bringing about a wild wind along the way that caused the sea of people below to spread apart. Only some strong people were able to keep their body stable enough to borrow the force of the wind, allowing them to rush to the entrance of the mountain range.</p><br/><p>“Elders, the both of you should wait outside of the mountain range. Leave the rest to me.” The colorful-dressed lady on the enormous crane glanced at the torrent-like human flow below before speaking faintly to the two old men on the enormous crane.</p><br/><p>“Yes.” The two elders hurriedly nodded their heads when they heard her words.</p><br/><p>The colorful-clothed lady smiled gently upon seeing this. This fight for the Heaven Mountain Blood Pool was a grand event that occurred once every three years. Moreover, most of those who joined were from the younger generation. Being able to stand out in this place was proof of one’s ability and talent.</p><br/><p>The colorful-clothed lady pressed her toes gently on the crane’s head. With a twist of her delicate waist, she transformed into a colorful light that shot forward. In a couple of flashes, she appeared at the front of the flow of people. Her black hair danced in the wind behind her. This mesmerising scene caused quite a number of men to reveal a look of amazement in their eyes.</p><br/><p>The colorful-clothed lady did not turn her head around to look at the sea of people behind her. Although she knew that there were some people who were quite skilled behind her, these people did not reach the level where they could catch her attention.</p><br/><p>The colorful lady’s toes pressed against empty air and a faint silver glow appeared. She looked at the entrance within close proximity and the corner of her mouth was involuntarily lifted into a faint arc. Her figure was just like a noble phoenix that descended toward the entrance.</p><br/><p>“Chi!”</p><br/><p>The rushing sound of rapid wind suddenly appeared when the colorful-clothed lady was about to fly into the entrance. Something flashed over extremely quickly. Within two breaths, the figure had rushed above the lady’s head.</p><br/><p>The sudden appearance of the human figure also caused the colorful-clothed lady to be slightly startled. Her brows were immediately knit together as her hand was clenched toward the human figure in front of her. A fierce suction force immediately surged from her hand.</p><br/><p>“Hmph!”</p><br/><p>That human figure merely let out a cold snort in the face of this colorful-clothed lady’s attempt to stop him. He flipped his hand and a wild and violent wind surged out of his sleeves. The two invisible winds collided in mid-air, emitting a low, deep sound as they did so. With the aid of the repulsion force, the human figure drew an arc through the air, landing in the mountain range.</p><br/><p>“Dammit, who is that little fellow? He has actually entered the mountain range ahead of Miss Feng?”</p><br/><p>“Ha ha, the old me has said that with so many present, there will definitely be dark horses appearing. It is just that I did not expect it to be so soon…”</p><br/><p>“.........”</p><br/><p>The expression of the colorful-clothed lady was quite ugly after seeing that an unknown person had actually entered before her. She let out a snort in the face of the noise behind her. Her body moved, transforming into a figure that quickly entered the mountain range.</p><br/><p>........</p><br/><p>The mountain range was covered with a dense fog. This fog contained a somewhat wild, violent energy that greatly limited one’s sight.</p><br/><p>A figure broke through the forest and entered this quiet mountain range. He gently landed on the ground, revealing a young face. This figure was Xiao Yan.</p><br/><p>“She is indeed worthy of being called the most outstanding person among the younger generation within the Wind Lightning Pavilion. She does possess some ability…” Xiao Yan glanced behind him after landing on the ground, and laughed within his heart. Immediately, he threw his gaze all around him and involuntarily let out a frown. The energy fog was too dense. Additionally, this Heaven Eye Mountain Range was vast. It was going to be difficult to reach the Heaven Mountain Blood Pool.</p><br/><p>A graceful colorful figure landed within the mountain range while Xiao Yan was frowning. Her pretty eyes swept around her and instantly paused on the back of a person not far in front of her.</p><br/><p>Xiao Yna did not turn his head despite sensing the slight activity behind him. Instead, his body moved and swiftly rushed into the mountain range.</p><br/><p>“Halt!”</p><br/><p>The colorful-clothed lady immediately cried out coldly upon seeing that Xiao Yan was about to leave.</p><br/><p>However, Xiao Yan appeared to have not heard her cry. His footsteps had instead become even faster.</p><br/><p>“Chi!”</p><br/><p>The rushing sound of wind suddenly appeared behind him while Xiao Yan was increasing his pace. His expression turned slightly chilly. His footsteps staggered as a colorful satin accompanied by a sharp wind shot past his head, narrowly missing it. Finally, the colorful satin penetrated through an enormous tree in front of him.</p><br/><p>Although the colorful satin seemed to be made of cloth, it possessed a metallic luster. Clearly, it was not an ordinary item.</p><br/><p>Surprise also flashed through the pretty eyes of the colorful-clothed lady when she saw Xiao Yan strangely dodge her attack. Her hand shook and another colorful satin shot out from her sleeves. This satin appeared like a poisonous snake that curled in midair and trickily entwined around Xiao Yan.</p><br/><p>A fury had also risen in Xiao Yan’s heart in the face of this lady’s repeated disturbance. He abruptly turned around and extended his hand in a lightning-like manner, grabbing the satin that shot over as he did so. A jade-green flame appeared in his palm before immediately touching the satin, turning it into a fire trail that shot toward the lady.</p><br/><p>The colorful-clothed lady’s face turned cold when she saw the fire trail heading over. A powerful green-silver Dou Qi that seemed to be the merger of wind and lightning shot along the satin. Finally, it violently collided with the trail of fire.</p><br/><p>“Bang!”</p><br/><p>A low, deep explosion erupted in this quiet mountain range. These two powerful energies scattered most of the dense fog around. A half a meter deep pit appeared on the ground.</p><br/><p>At this moment, quite a number of people had entered the mountain range. They hurriedly rushed over upon hearing the activity in this area. All of them were startled when they saw that the person fighting was the renowned Miss Feng. Their surprised eyes were quickly thrown toward the unfamiliar-looking man opposite her. Someone who could exchange blows with her was definitely not an ordinary person.</p><br/><p>“A Dou Qi formed from the merger of wind and lightning? Miss Feng from the Wind Lightning Pavilion does live up to her reputation.” Xiao Yan’s eyes stared intently at the colorful-clothed lady as he slowly spoke. At the same time, the colorful satin did not show any signs of breaking despite having experienced such a violent attack.</p><br/><p>It was indeed unexpected that this woman possessed a body that contained two elements. Such a constitution might not be as rare as the ‘Woeful Poison Body,’ but it was also seldom seen. If one were to talk about it, Xiao Yan could be also considered to possess a body that contained two elemental affinities, fire and wood. Of course, the fire affinity formed the majority of his constitution while wood was only present in a small amount. This was the case for every single alchemist since this was the requirement.</p><br/><p>A two elemental affinity constitution was not very suitable for training because the elements were not pure. It was still alright for a constitution like that of Xiao Yan. The wood affinity only occupied a small part of his body. However, this woman in front of him was not only able to train until now, but was actually able to perfectly merge these two elemental Dou Qis together. The strength of this merged Dou Qi would soar…</p><br/><p>“By being able to destroy my Wind Lightning Pavilion’s Nine Heavenly Lightning Prison Formation and successfully escape from northern pavilion chief Fei Tian’s hands, you also live up to your reputation…” The colorful-clothed lady’s pretty eyes focused intently on the skinny, young man in front of her before suddenly laughing softly, “Don’t you agree, Xiao Yan?”</p><br/><p>The faces of the surrounding people suddenly paled when these words were uttered!</p><br/>\n</div>"}