{"title": "Chapter 1006: Transaction", "id": 1006, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1006-transaction", "volume_title": "Volume 11", "body": "<h1>Chapter 1006: Transaction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1006: Transaction</u></strong></p><br/><p>The attempt to breakthrough the sonic wave checkpoint had gradually reached the end by the time Xiao Yan returned to the rock platform. The thing that caused him to be stunned was that three people had successfully reached the mountain top during this short period of time. Thus, there were nine people on the rock platform. However, after putting aside the two spots for the Gold Swallowing Mouse, there were only eight spots for the Heaven Mountain Blood Pool remaining. In other words, there was one person among the nine of them who would lose the opportunity to enter the Heaven Mountain Blood Pool.</p><br/><p>Xiao Yan looked at the person who was the last to charge through the checkpoint after landing on the rock platform. After which, he sensed the strength of the sonic wave and involuntarily frowned. It seemed that the current sonic wave was much weaker than before.</p><br/><p>Xiao Yan’s heart contained some doubt as he fell deep into thought. A moment later, he looked at the somewhat weary-looking Gold Swallowing Mouse and immediately understood the reason. He let out a bitter laugh. It was unexpected that the people behind him had gained such a great advantage after he had used the Lion Tiger Gold Shattering Roar.</p><br/><p>According to the strength of the mouse tide sound array earlier, at least one of the three people who had succeeded in crossing the checkpoint would have difficulty passing through it. The other two might not have had such an easy time crossing it. Xiao Yan had unintentionally helped create a passing condition for those fellows behind.</p><br/><p>Of course, even though these people possessed such a good condition to cross the checkpoint, they still needed to possess some strength. Those three people earlier all had the strength of a seven star Dou Huang and could not be considered weak.</p><br/><p>Xiao Yan sighed helplessly in his heart. Xiao Yan’s gaze turned to a figure that was miserably flashing on the rock stairs. He shook his head slightly. This person’s strength was only around that of a six star Dou Huang. His chance of success of passing through this mouse tide sound array was not very high.</p><br/><p>As Xiao Yan had expected, this figure’s Dou Qi was finally exhausted just as he was about a couple dozens of meters from the mountain top. His face turned white and a mouthful of fresh blood was spat out. After which, his body miserably shot back and finally landed heavily on the platform. His face was one that was not resigned to the situation.</p><br/><p>Those people on the platform, who had failed before, also sighed when they saw that this person’s efforts were futile. Their gazes bitterly looked at the mountain top. There were already more than eight people there. In other words, they no longer had the chance to ascend to the peak.</p><br/><p>“The challenge is over. For those who failed, there will be someone to send you off the Heaven Eye Mountain.” Jin Shi glanced at those unwilling people on the platform while his faint voice announced their fate.</p><br/><p>The faces of quite a number of people became much paler when they heard Jin Shi’s words. However, he ignored them. He waved his hand and a couple of strong people with human bodies and mouse heads walked out, sealing off the rock stairs. After which, Jin Shi’s body flashed and appeared at the top of the mountain in a ghost-like manner before looking down at Xiao Yan’s group from a higher spot.</p><br/><p>Xiao Yan’s group hurriedly bowed when they saw Jin Shi appeared. They clearly knew that regardless of who it was, whoever offended the people from the Gold Swallowing Mouse Tribe would likely end up suffering for it.</p><br/><p>Jin Shi nodded. He slowly landed on the ground before walking toward the deep parts of the mountain peak. “Follow me.”</p><br/><p>Xiao Yan and the others did not dare to slight Jin Shi after hearing this. All of them swiftly followed at his pace.</p><br/><p>A strange rock forest was at the peak of Heaven Eye Mountain. If one raised one’s head in this place, one would coincidentally be able to see the fluctuations of the extremely dense energy tide. The energy pressure that vaguely spread from it caused one’s heart to involuntarily feel a chill.</p><br/><p>The colorful energy tide was just like a wave as it spread out again and again, an extremely majestic scene.</p><br/><p>Xiao Yan’s group swiftly jumped through the strange rocks while they endured the energy wave in the sky. This continued for awhile, their footsteps followed Jin Shi before gradually coming to a stop.</p><br/><p>All of them slowly climbed a steep slope. The scene that appeared in front of them immediately caused them to inhale a breath of cool air.</p><br/><p>In front of Xiao Yan’s group was an extremely spacious volcano. Wisps of hot fog, that contained fire poison, were repeatedly spat out. In the middle of the volcano was a small pool which was around ten feet in diameter. At this moment, the pool was almost empty. One could vaguely see a fiery-red lava-like substance in it.</p><br/><p>“That is the Heaven Eye Blood Pool. However, now is not the time when the energy tide is at its peak. When it reaches the peak, the entire mountain range’s energy will gather at this volcano. At that time, the blood pool will also overflow. All of you only need to enter it at that time.” Jin Shi pointed at the pool at the middle of the volcano and faintly spoke.</p><br/><p>Everyone’s heart involuntarily leaped when they heard this. Their eyes also became a lot hotter when they looked at the pool. If they could soak in it, they would be able to save an unknown number of years of tough training.</p><br/><p>“All of you need to remember that the interior of the Heaven Mountain Blood Pool contains an extremely dense fire poison. Hence, you cannot stay in it for too long. All of you must come out after at most three days. Otherwise, if the fire poison enters your body, it is likely that it will be difficult to expel even if your teachers do it personally. The fire poison has accumulated over a countless number of years. Once it enters your body, it will be just like maggots in one’s bones. Other than some high tier alchemists, it is likely that no one can remove it.” Jin Shi spoke with a deep voice.</p><br/><p>The expressions of quite a number of people changed a little upon hearing these words. It was unexpected that there was such a danger within this Heaven Mountain Blood Pool.</p><br/><p>Xiao Yan’s gaze swept over Jin Shi. His heart suddenly understood something. No wonder Xiao Yan felt that he had accumulated an injury. From the looks of it, the injury should be related to this fire poison.</p><br/><p>“Additionally, there are nine of you presently here. In other words, one of you will not be able to enter the Heaven Mountain Blood Pool. You will have to decide who cannot enter.” Jin Shi raised his eyelids and slowly said.</p><br/><p>The atmosphere became mysterious after these words sounded. With the exception of Feng Qing Er and the three others, those other individuals by themselves began to slowly step back a little. There was a little more caution within their eyes as they looked around them.</p><br/><p>Jin Shi was unconcerned about their reaction. He had just turned around when his footsteps suddenly paused. His eyes turned to Xiao Yan and said, “Follow me.”</p><br/><p>Everyone present, including Xiao Yan, was startled when they heard this. Immediately, they threw some unusual gazes at him.</p><br/><p>Being the party involved, Xiao Yan hesitated a moment and was just about to speak when he saw Jin Shi slowly walked toward the entrance to the volcano. He headed to another peak where a rock pavilion was located. Seeing this, Xiao Yan could only nod his head. He said something to Nalan Yanran and swiftly followed.</p><br/><p>Jin Shi was already standing with his hands behind his back when he saw Xiao Yan arrived at the rock pavilion. His gaze looked to the colorful energy tide in the sky. He was even able to see that gray-clothed, old man whom he had meet at the maze earlier within the rock pavilion.</p><br/><p>Jin Shi smiled toward Xiao Yan when he saw him arrive. He glanced at Jin Gu before speaking, “Little fellow, do you know why I have called you over?</p><br/><p>Xiao Yan was quiet for a moment when he heard this. After which, he immediately asked, “Because of elder Jin Shi’s internal injury?”</p><br/><p>Xiao Yan clearly sensed Jin Shi’s body tremble slightly the moment he spoke. Jin Gu, on the other hand, laughed out loud and said, “See, I already said that this fellow is not an ordinary alchemist.”</p><br/><p>Jin Shi slowly turned around. His originally calm eyes had become exceptionally sharp at this moment. He stared at Xiao Yan and asked somewhat doubtfully, “You are able to tell that I am suffering from internal injuries?” One could not fault him for doubting. It should be known that even some top tier 6 alchemist did not reach this level. Could this young man in front of him, who was twenty plus years old, be at a higher tier than this?</p><br/><p>“Aye, I am able to see a little.” Xiao Yan slightly nodded.</p><br/><p>“Are you confident you can treat it?” Jin Shi took two steps forward and inquired in a deep voice.</p><br/><p>“I can take a look.” Xiao Yan hesitated for a moment and unceremoniously sat down in front of a rock table. After which, he pointed at the rock chair beside him. Jin Shi’s mouth twitched upon seeing this, but he could only obey and sit down.</p><br/><p>Xiao Yan grabbed Jin Shi’s arm. His eyes narrowed while a thread of Spiritual Strength swiftly entered his body.</p><br/><p>Jin Shi and Jin Gu exchanged glances after seeing Xiao Yan shut his eyes. They did not interrupt him by saying anything. Most alchemists were eccentric in nature. Back then, they had suffered a lot just to find an alchemist to help take a look. Xiao Yan was many times better when compared to them.</p><br/><p>Xiao Yan continued his probing for awhile before he finally slowly opened his eyes. The expression in them was somewhat solemn.</p><br/><p>“How is it?” Jin Gu by the side hurriedly asked.</p><br/><p>“The fire poison has entered the body and seeped deep into the bones. This is the first time that I have seen such deep-seated fire poison. It is extremely difficult to expel it.” Xiao Yan withdrew his hand and shook his head. His gaze involuntarily contained some pity when looking at Jin Shi. Were it not because of this fellow’s great strength, it was likely that he would have turned to ashes from this fire poison.</p><br/><p>The expressions of Jin Shi and Jin Gu became much gloomier when they heard Xiao Yan uttering a similar observation as some other high tier alchemists.</p><br/><p>Xiao Yan rubbed his finger gently over the table when he saw the appearance of these two. A moment later, he finally said, “Although it is extremely difficult to expel, it is not completely without a solution…”</p><br/><p>“Crack!”</p><br/><p>The rock table in front of Jin Shi immediately formed some cracks the moment these words sounded. His eyes were heated as he raised his head and stared intently at Xiao Yan. His voice had finally become anxious, “You… mister Xiao Yan is able to expel the Heaven Mountain Fire Poison in my body?”</p><br/><p>Xiao Yan smiled, but did not reply. His gaze slide to the area outside of the rock pavilion, appearing unformatable.</p><br/><p>Jin Shi and Jin Gu were startled when they saw this. They immediately seemed to have understood something. Jin Shi hesitated a moment before finally clenching his teeth as he softly said, “As long as you can completely expel the Heaven Mountain Fire Poison in my body, I will give you an opportunity that will guarantee your successful advancement to a Dou Zong!”</p><br/><p>Shua!</p><br/><p>The gaze that was looking away from the rock pavilion seemed to have instantly turned back. Xiao Yan’s eyes had also become extremely heated at this moment. He did not hesitate as a heavy word was uttered from his mouth!</p><br/><p>“Agreed!”</p><br/>\n</div>"}