{"title": "Chapter 1000: Heaven Mountain Stage", "id": 1000, "volume": 10, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1000-heaven-mountain-stage", "volume_title": "Volume 10", "body": "<h1>Chapter 1000: Heaven Mountain Stage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1000: Heaven Mountain Stage</u></strong></p><br/><p>Xiao Yan’s eyes stared intently at the humble-looking, gray-clothed, old man. A moment later he finally smiled, cupped his hands together, and politely inquired, “This old sir should be an elder of the Gold Swallowing Mouse Tribe, right?”</p><br/><p>The Heaven Eye Mountain Range had the effect of suppressing any overly strong person from entering it, yet the strength of this old man in front of him had already exceeded this limit. It was likely that he was not someone from the outside world. In that case, he ought to be a local expert. Additionally, the entire Heaven Eye Mountain was the territory of the Gold Swallowing Mouse Tribe. It was likely that this person was someone from the Gold Swallowing Mouse Tribe.</p><br/><p>The gray-robed, old man was startled upon hearing this. He leaped down from the tree branch. He looked over Xiao Yan once before smiling and saying, “Little fellow’s eyesight is indeed quite good.”</p><br/><p>Xiao Yan smiled. Having remembered what Nalan Yanran had told him earlier, Xiao Yan would naturally not say anything to offend this member of the Gold Swallowing Mouse Tribe. Moreover, this person was quite strong and likely possessed a high position in the clan. It was likely that one would suffer by offending him.</p><br/><p>“This younger self is Xiao Yan. I have been reckless to turn this place into this manner. Hopefully, old sir would not blame me.” Xiao Yan smiled. A jade bottle swiftly appeared in his hand. After which, he handed it over. “These are some ‘Qi Mending Pills.’ Although I know that these things might be nothing in old sir’s eyes, they do possess quite a great effect when used to recover one’s Dou Qi.”</p><br/><p>Qi Mending Pill was a tier 5 expendable type medicinal pill. It had the effect of allowing a Dou Huang or a Dou Zong to recover their Dou Qi at a faster rate, and was considered a higher tier expandable medicinal pill.</p><br/><p>The gray-clothed, old man was startled upon seeing this action of Xiao Yan. However, his narrowed eyes immediately brightened when he heard the name ‘Qi Mending Pill.’ Medicinal Pills were even rarer from a Magical Beasts perspective because only humans had alchemists. Although some Magical Beast were able to refine medicinal pills by relying on their talent, they were too few in number. This Qi Mending Pill might not be of a very high tier, but its effect of swiftly recovering one’s Dou Qi caused the gray-robed, old man to be attracted.</p><br/><p>“Hee hee, little fellow, I felt that you were very pleasing to the eye when I first saw you.” The gray-robed, old man licked his lips and laughed. After which, he did not put up an act as he unceremoniously received the jade bottle from Xiao Yan. After which, he glanced around him, waved his hand and said, “It’s fine. I will get someone to clean up this place. Little fellow need not be worried. I will also help you clear some of these troublesome things.”</p><br/><p>Xiao Yan grinned and nodded. He cupped his hands to the gray-robed, old man and respectfully said, “In that case, thank you old sir.”</p><br/><p>“The old me is Jin Gu. Don’t call me whatever old sir…” The gray-clothed, old man laughed. His gaze wandered around Xiao Yan’s body once before he suddenly said, “Little fellow, you are an alchemist, right? Such a scent is not something that an ordinary person possesses.”</p><br/><p>Xiao Yan hesitated for a moment. The other party clearly had a special talent when it came to the sense of smell. Hence, he did not hide anything and gently nodded his head.</p><br/><p>“Hee hee, alchemist. This thing is really too rare…” A strange glow flashed across the eyes of Jin Gu when he saw Xiao Yan nod his head. He immediately smiled and said, “You should enter first. That little girl’s Psychic White Fox does not have a problem passing through the maze. However, there are still quite a number of obstructions if you wish to successfully reach the Heaven Mountain Blood Pool. Relax, the old me is not someone who will not work after receiving something. I will inform the others to take special care of you.”</p><br/><p>Xiao Yan’s heart rejoiced upon hearing this. He really did not lose out by giving away these medicinal pills. This old fellow did indeed possess quite a high position in the Gold Swallowing Mouse Tribe. Since Xiao Yan had obtained what he needed, he did not stay any longer. After cupping his hands to Jin Gu, he turned around, and entered the tree door.</p><br/><p>Jin Gu involuntarily fondled his beard as he watched Xiao Yan disappear behind the tree door. His expression was one of deep thought while he softly muttered, “This little fellow is also an alchemist, but I wonder if he has reached our requirement. If it is possible, we will be able to save quite a lot of trouble…”</p><br/><p>Xiao Yan had just stepped into the tree door when the area in front of him suddenly brightened. His mind immediately felt somewhat giddy. By the time he recovered, he was stunned to realize that the surrounding space had been permeated by a layer of dense fog that could not be scattered.</p><br/><p>The density of the fog in this place was at least ten times denser than that of the fog in the mountain range. Moreover, the thing that caused Xiao Yan to feel troubled was that the fog in this place could not be penetrated by Spiritual Strength. When it was spread, it seemed to be met with a great obstruction, making it difficult to achieve a probing effect.</p><br/><p>“Is this that so called maze. It is indeed troublesome…” Xiao Yan solemnly swept his eyes around him as he softly said.</p><br/><p>Xiao Yan suddenly felt his hand turn cold when he was speaking to himself. Immediately, Nalan Yanran’s gentle voice was transmitted from beside him, “There is no need to panic. It’s me.”</p><br/><p>Xiao Yan’s tensed arm slowly relax. His gaze followed the direction where the voice originated from and glanced over. However, he was shocked to find that there was nothing there, yet the touch that was transmitted from his hand clearly told him that Nalan Yanran was beside him.</p><br/><p>“There is no need to look. This maze can block one’s sight. Even though we are close together, we are still unable to see the other party’s body. I will pull you with me. With the Psychic White Fox leading the way, it should not be too difficult to get out of this place.” Nalan Yanran’s voice was slowly transmitted over, aware of the doubt in Xiao Yan’s heart.</p><br/><p>Xiao Yan nodded slightly upon hearing this. His heart rejoiced a little. It was fortunate that he had met Nalan Yanran along the way. Otherwise, even he would have been trapped within this maze…</p><br/><p>The dense fog permeated the maze while the gentle touch from his hand appeared just as though one was touching top quality jade. The lovely, gentle feeling caused one to feel unwilling to part with it. This caused Xiao Yan’s heart to involuntarily shake. However, this kind of feeling was swiftly suppressed by Xiao Yan the moment it appeared. He immediately lowered his head in embarrassment, and allowed Nalan Yanran to pull him as they slowly advanced.</p><br/><p>This quiet advancement continued for nearly half an hour before Xiao Yan sensed that the surrounding fog seemed to have gradually become much thinner.</p><br/><p>“We are about to leave the maze…” Beside Xiao Yan, Nalan Yanran emitted a soft voice that seemed to have placed down a heavy burden.</p><br/><p>Nalan Yanran’s voice had just sounded when a wind blew over. The surrounding dense fog intensely fluctuated. They swiftly withdrew and the surrounding scene slowly appeared.</p><br/><p>An extremely majestic-looking mountain peak appeared in front of Xiao Yan and Nalan Yanran. At this moment, the two of them were at the bottom of the halfway point. Enormous mice that were covered by gold hair repeatedly shuttled around on the two sides of the somewhat steep mountain road.</p><br/><p>“These should be Gold Swallowing Mouse. Do not harm them. Otherwise, it will definitely anger the Gold Swallowing Mouse Tribe…” Nalan Yanran’s pretty eyes looked at the large golden-colored mice as she uttered a reminder.</p><br/><p>“Yes.” Xiao Yan tilted his head.</p><br/><p>“Let’s go. The halfway point is where the Heaven Mountain Stage is. After that will be some checkpoint that the Gold Swallowing Mouse Tribe has placed. Only by successfully passing through them will one be able to reach the Heaven Mountain Blood Pool at the top.” Nalan Yanran hugged the white fox while her finger pointed toward the middle of the mountain as she sweetly smiled.</p><br/><p>“Heaven Mountain Stage?” Xiao Yan’s eyes narrowed when he heard this. This place was the Heaven Mountain Stage Tang Ying had mentioned. Moreover, he had said that they might have a chance to cooperate there. It was likely that he was talking about cooperating to pass the checkpoint.</p><br/><p>“There are likely quite a number of people currently present there. The checkpoints that the Gold Swallowing Mouse Tribe usually put up are quite difficult. Although those who arrive here are not weak, it is quite difficult if one wishes to break through them.” Nalan Yanran laughed.</p><br/><p>Xiao Yan also smiled. There was a fiery heat in his eyes as he beamed, “In that case, let’s go. We should not allow others to occupy the eight spots before us…”</p><br/><p>Xiao Yan’s toes pressed on the steep rock stairs after his words sounded. Immediately, his body transformed into a black shadow that swiftly rushed to the middle of the mountain. Nalan Yanran quickly followed behind him.</p><br/><p>……</p><br/><p>The middle of the Heaven Eye Mountain was an extremely spacious platform. The platform was built from orderly arranged stones. There were rock stairs that reached the top of the Heaven Eye Mountain on one side of the platform. However, the front of the rock stairs was currently guarded by some human-bodied Gold Swallowing Mouse.</p><br/><p>There were nearly twenty human figures gathered on the platform away from the rock stairs. They were divided into different sized groups. Some of them were alone, some of them were in threes while some of them were in larger groups…</p><br/><p>These people were scattered on the platform and were whispering to one another. While doing so, their gazes would repeatedly sweep toward the steep road that led to the platform. Based on the time, the maze should be about to shut. Once the time’s up and the maze closes, it would be time for them to attempt to break through the checkpoint…</p><br/><p>A colorful figure, which was exceptionally eye-catching in the human crowd with her noble phoenix-like aura, easily became one of the main characters present. This woman was naturally Miss Feng from the Wind Lightning Pavilion.</p><br/><p>While she was randomly conversing with a person beside her, the pretty eyes of this colorfully clothed lady would repeatedly sweep toward the rock stairs. The corner of her mouth contained a faint ridicule. A moment later, she gently shook her head. It seemed that she had indeed somewhat overestimated that person. It was unexpected that he was unable to even reach this Heaven Mountain Stage…</p><br/><p>“Gong!”</p><br/><p>A gong sound slowly resounded over the platform while a somewhat small, old figure slowly walked out. His gaze swept over the place indifferently as he said in a somewhat weak voice, “Time’s up, let the attempt to break through the checkpoint begin…”</p><br/><p>The colorful-clothed lady completely withdrew her gaze when she heard this person open his mouth. It seemed that the person had merely relied on the powerful spirit as she had expected. However, that advantage was completely non-existent in this Heaven Eye Mountain Range.</p><br/><p>The rushing sound of wind appeared while everyone’s gazes were shifting. Immediately, two figures shot over from the rock stairs like two arrows. After which, they steadily landed on the platform. A cool and bright laughter was randomly emitted.</p><br/><p>“Sorry, I have arrived a little later. Hopefully, I did not interrupt the checkpoint passing, did I?”</p><br/><p>The pretty eyes of the colorfully clothed lady solidified upon hearing this laughter. She slowly turned her head and glanced at the smiling young face. A moment later, she could only let out a cold snort and turn her head away.</p><br/>\n</div>"}