{"title": "Chapter 1028: Holy Demon Phoenix Icon", "id": 1028, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1028-holy-demon-phoenix-icon", "volume_title": "Volume 11", "body": "<h1>Chapter 1028: Holy Demon Phoenix Icon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1028: Holy Demon Phoenix Icon</u></strong></p><br/><p>The jade-green fire lotus slowly bloomed like a delicate lotus. A fluorescent light lingered over it, giving it a soul-stirring beauty. However, under this shocking beauty hid a terrifyingly destructive, wild, violent strength.</p><br/><p>The ray of light shot over just as the fire lotus was blooming. Immediately, it violently collided with the center of the fire lotus in front of innumerable eyes!</p><br/><p>Two attacks that contained a frightening energy collided like meteorites at this moment!</p><br/><p>The collision unexpectedly did not result in a loud noise. The intense light ray and the jade green light entangled with one another, repeatedly eroding each other. A tiny line spread from the empty air where the two lights collided.</p><br/><p>The entire stadium was completely quiet. Everyone’s eyes were firmly staring at the point of collision of between the fire lotus and the light ray. Although the expected loud sound was absent, some of those with sharp senses could vaguely sense the might of the frightening energy.</p><br/><p>The fire lotus slowly rotated. Its jade-green glow made it look like a green-colored crystal. Flame lingered all over it. Regardless of how strong the light ray was, it had difficulty breaking through the fire defense. Instead, the ray of light gradually turned dim while these two eroded each other…</p><br/><p>This face off continued as the ripple in the air also became more visible. In the end, a wild suction force was emitted from the point of collision, sucking the rock fragments on the ground into the circular light and shattering them into powder.</p><br/><p>The ripple continued around two minutes or so before gradually weakening as the light ray dimmed. Finally, it completely disappeared.</p><br/><p>Even after the light ray disappeared, the jade-green fire lotus continued to rotate at a steady pace. However, its jade-green color had become much dimmer. Clearly, the mutual erosion earlier had exhausted a large amount of the fire lotus’s energy.</p><br/><p>The final victor between the two frightening Dou Skills was the unknown fire lotus. At this moment, numerous exclamations sounded in the stadium. Those seated were extremely familiar with the might of the Wind Lightning Pavilion’s Wind Killing Finger. However, they did not expect, that even after it was used with Feng Qing Er, it still ended up being blocked by Xiao Yan’s unheard of fire lotus…</p><br/><p>Feng zun-zhe’s tensed body relaxed in the VIP seats. The spiraling wind on his hand slowly disappeared. His eyes stared at the slowly rotating fire lotus as surprise flashed through them. The wild, violent energy contained within the fire lotus was something that caused him to feel startled.</p><br/><p>“That old fellow does not know this move. Don’t tell me that Xiao Yan has learned this Dou Technique from other places? But why is it that even I have never heard of such a powerful Dou Technique ?” Feng zun-zhe felt some doubt. He immediately turned his head to look at Lie zun-zhe, whose face appeared as deep as water. A faint smile involuntarily appeared on Feng zun-zhe’s face.</p><br/><p>“No wonder he has been picked by that stubborn old fellow, who holds such high expectations. Xiao Yan’s talent is much greater than Han Feng’s…”</p><br/><p>“This fellow has received Feng Qing Er’s Wind Killing Finger…” At the edge of the arena, Tang Ying and Mu Qing Luan looked at the light ray which had disappeared. Shock appeared in their eyes. They had faced the might of the Wind Killing Finger before. Naturally, they understood the strength of such Dou Technique. However, the scene today had caused them to involuntarily sigh in their hearts. This Xiao Yan, who had suddenly appeared, was likely much stronger than them…</p><br/><p>Feng Qing Er stood in the empty air. Her graceful body revealed an alluring curve under the cover of the colorful dress. Her eyes were icy-cold as she watched the light ray below disappear. Her heart might have been shaken, but her expression did not reveal it.</p><br/><p>When the light ray disappeared, the jade-green lotus flame, suspended above the pit, began to rotate faster and faster. It emitted a ‘swoosh’ sound as it made a beautiful green fire tail as it swiftly shot toward Feng Qing Er in the sky.</p><br/><p>Feng Qing Er’s eyebrows became vertical when she saw the fire lotus came at here. She moved her hand and the enormous, colorful phoenix let out a cry. It appeared above her head in a lightning-like manner. A circular seven-colored light barrier spread out of her body, wrapping her within.</p><br/><p>“Boom!”</p><br/><p>The fire lotus arrived just as the light barrier was formed. Immediately, it was like a bomb as an enormous fire wave exploded against the light barrier.</p><br/><p>The large explosion was like a beautiful firework as it flew across the sky. Under the attack by the wild, violent energy, a circular ripple swiftly spread over this seven-colored light barrier!</p><br/><p>The speed at which the ripple spread increased. In the end, the light barrier was unable to endure the frightening explosive strength. It shattered amid a loud noise.</p><br/><p>The light barrier shattered and the remaining flame charged in. It unceremoniously collided with the enormous, colorful phoenix. That great strength sent it flying with a sharp cry. Some colorful cloths were torn from it at this moment. They drifted down from the body of the colorful phoenix.</p><br/><p>The colorful phoenix was sent flying, revealing Feng Qing Er behind it. However, her condition appeared to be a little better. Her body moved, leaving behind a couple of afterimages in the sky. At the same time, her body dodged the remaining fire wave.</p><br/><p>Although she had dodged the fire wave, it was obvious that Feng Qing Er’s state was a little more miserable in this exchange. This had also caused the iciness on her face to become denser.</p><br/><p>Feng Qing Er’s lovely figure flew back after her feet pressed against the empty air. She landed on the body of the colorful phoenix, which had become dilapidated. The back of her teeth bit her finger before she pressed it abruptly on the back of the colorful phoenix.</p><br/><p>“Soul Swallowing Bloodline!”</p><br/><p>With that cry, a dense-red glow suddenly erupted from her palm. It swiftly wrapped around colorful phoenix. Within that strange-red glow, the colorful phoenix’s body swiftly diminished. Finally, it turned into a dense red glow that was swallowed by Feng Qing Er’s small mouth.</p><br/><p>Feng Qing Er’s lovely body shook when the red glow entered her body. Immediately, a pair of colorful phoenix wings extended behind her. At the same time, her aura swiftly soared.</p><br/><p>The soaring aura did not continue for long before it came to a stop. However, Feng Qing Er had rose from the strength of a one star Dou Zong to a three star Dong Zong. This kind of crazy increase caused one to be a little stunned just watching it.</p><br/><p>Xiao Yan’s figure also appeared in the arena when Feng Qing Er’s aura was soaring. He knit his brows and glanced at her. Immediately, he let out a cold laugh as the seals formed by his hands swiftly changed.</p><br/><p>“Skyfire Three Mysterious Change!”</p><br/><p>A cold cry was emitted within Xiao Yan’s heart. Flame surged from his body before swiftly returning to it. His aura also abruptly soared in a similar fashion. However, it came to a stop when he had barely reached the strength of a three star Dou Zong.</p><br/><p>Xiao Yan felt some astonishment in his heart when he sensed that the Skyfire Three Mysterious Change had only enabled him to raise his strength by two stars. When he had used it as a Dou Huang, it was not difficult to raise his strength by three stars, yet it was currently barely able to reach two stars. The gap between them each star was really quite big.</p><br/><p>After musing a little in his heart, Xiao Yan finally understood why. The gap between each star in the Dou Zong class was much wider than the Dou Huang class. When using the same Secret Technique, it was only natural that the technique would have difficulty obtaining the same effect as in the past.</p><br/><p>“However, Feng Qing Er is actually able to raise her strength by over two stars. It seems the Secret Technique she has used is definitely quite high. It should be a little stronger than this incomplete Skyfire Three Mysterious Change of mine.” Xiao Yan muttered in his heart. It seemed that when he had the time, he would need to think of a way to complete the Skyfire Three Mysterious Change. Otherwise, he would be at left at a disadvantage if he were to fight with an expert who also possesses a Secret Technique.</p><br/><p>“Since it has already come to this, it is only natural that I cannot delay things any longer. Determining the victor is most important…”</p><br/><p>Xiao Yan looked at Feng Qing Er who was flapping a pair of seven-colored wings in the sky. A moment later, his eyebrows were suddenly knit together. His gaze was somewhat uncertain as he stared at the phoenix wings on her back. For some unknown reason, he felt a kind of familiarity when looking at them.</p><br/><p>While Xiao Yan was feeling doubtful, Feng Qing Er’s green-silver eyes suddenly became cold as she remained in the sky. Majestic Dou Qi surged out of her body, transforming into an enormous phoenix icon behind her.</p><br/><p>This phoenix was completely black in color and gave one a kind of demonic feeling. The phoenix’s eyes stared at Xiao Yan from a distance as an unusual pressure fell from the sky!</p><br/><p>Under this pressure, even the energy in the surroundings had become somewhat chaotic. Numerous shocked voices were being emitted from outside the arena…</p><br/><p>Xiao Yan’s eyes stared intently at that enormous black-colored phoenix icon. His entire body felt chill as he did so. At this moment, he understood that it seemed that Feng Qing Er was similar to Mu Qing Luan in that they were both not humans. Instead, their original forms were Magical Beasts. However, it was the first time that Xiao Yan had met a Magical Beast that possessed such a pressure in all these years…</p><br/><p>Feng Qing Er’s pretty eyes did not contain the slightest emotion as they stared at Xiao Yan. A moment later, she gently raised her arm. Her finger pointed at Xiao Yan from some distance away. Her bone-chilling voice carried a kind of unusually strong, domineering aura!</p><br/><p>“Holy Demon Phoenix Icon, swallow the Heaven and Earth!”</p><br/><p>When the cold cry sounded, the illusionary black phoenix behind Feng Qing Er appeared to have returned to life. It let out a sharp cry to the sky. Immediately, it flipped its enormous pair of wings and a hundred-foot-tall blackness carried an extremely frightening strength as it violently shot toward Xiao Yan like a meteorite.</p><br/><p>Xiao Yan’s eyes stared intently at the unusually dark-black light that covered this place. His brows moved and the Bone Chilling Flame swiftly surged out. When he was about to do something, he suddenly sensed a fluctuation from his Storage Ring. He became shocked. His mind moved, and he sensed the origin of the fluctuation within his Storage Ring.</p><br/><p>It was a jade bottle. Within the jade bottle was a few drops of green-red blood that contained a frightening energy…</p><br/><p>Xiao Yan was stunned as he looked at the droplets of green-red blood that he had refined from the mysterious corpse back then. He immediately seemed to have recalled something as his eyes shrank. His gaze looked at Feng Qing Er in the sky as a shocking thought spread from his heart.</p><br/><p>“She… she is someone from the Heaven Demon Phoenix tribe?”</p><br/>\n</div>"}