{"title": "Chapter 1024: Identity Revealed", "id": 1024, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1024-identity-revealed", "volume_title": "Volume 11", "body": "<h1>Chapter 1024: Identity Revealed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1024: Identity Revealed</u></strong></p><br/><p>Wang Chen’s savage laughter caused everyone present to be stunned. A moment later, ‘shua’ sounds appeared as a countless number of eyes carried some disbelief and paused on Xiao Yan, who had suddenly stopped in the arena.</p><br/><p>“Xiao Yan? That Xiao Yan who has a grudge with the Wind Lightning Pavilion?”</p><br/><p>“That Xiao Yan who forcefully broke the Nine Heavenly Lightning Prison Formation that the three great Elders of the Wind Lightning Northern Pavilion had placed. The one who escaped from Fei Tian’s hands?”</p><br/><p>Countless numbers of people outside of the arena had instantly become completely stunned. No one expected that the unknown, young man, who had defeated Wang Chen, was actually Xiao Yan, who had recently created an uproar in the northern region. Moreover, the thing that really cause them to feel a great disbelief was that this person actually dared to come to Lightning Mountain despite his conflict with the Wind Lightning Pavilion? Was… was this not delivering himself to be captured?</p><br/><p>“This fellow… is actually Xiao Yan? Is he crazy?” Tang Ying opened his mouth. His cold face revealed a stunned expression when he looked at Xiao Yan.</p><br/><p>“This fool… he has really come?” Mu Qing Luan’s pretty face was filled with shock. She had never expected that this fellow would dare to come to this Lightning Mountain.</p><br/><p>“It is actually him… no wonder… unexpectedly… his courage has reached such an extent. Looks like he really does not hold any regard for my Wind Lightning Pavilion.”</p><br/><p>Feng Qing Er’s pretty eyes looked at Xiao Yan as the corner of her lips was slowly lifted into a slight arc. A faint chillness and arrogance was present in it. She had always truly hoped to have an exchange with him. She would restore the reputation of the Wind Lightning Pavilion through it. Unfortunately, she lacked the opportunity to do so last time.</p><br/><p>Lei zun-zhe and the others in the VIP seats were stunned as they looked at the noise over the entire place. A moment later, they had finally recovered. A smile on their face was also slowly withdrawn as they stared at Xiao Yan in the arena with expressionless faces. Lei zun-zhe’s finger gently tapped on the armrest. The slight sound gave off an extremely pressurizing feeling to it.</p><br/><p>Lei zun-zhe had also heard of Xiao Yan’s name. Relying on one’s strength to turn the Wind Lightning Northern Pavilion into such a miserable state was not something that an ordinary person could achieve.</p><br/><p>“Fei Tian, is he that Xiao Yan?” Lei zun-zhe’s eyes revealed a lightning glow vaguely flickering as he turned his head to Fei Tian by the side and indifferently asked.</p><br/><p>The dense-looking Huang Quan zun-zhe gloatingly laughed in his heart as he clearly sensed the anger that was hidden in Lei zun-zhe’s voice. He shrank his body back. It was unexpected that this fellow was the Xiao Yan who had caused an uproar recently. Thus, the matter today would be a little fun…</p><br/><p>Feng zun-zhe and Jian zun-zhe by the sides were similarly startled because of this. Their gazes were a little strange as they observed Xiao Yan. However, they did not say anything. This was a problem of the Wind Lightning Pavilion, and it was inappropriate for them to say anything.</p><br/><p>The silver-robed Fei Tian hurriedly got up when he heard Lei zun-zhe’s words. At this moment, his face had become slightly ugly. He had already been scolded by Lei zun-zhe more than once over the matter with Xiao Yan. Moreover, he had also suffered the ridicule of those two others beside him. It was unexpected that the matter, that had been temporarily put aside today, was brought up again.</p><br/><p>Fei Tian clenched his fist under his sleeves. He took two steps forward and his sinister eyes turned to Xiao Yan in the arena as he coldly said, “Brat, take off the thing on your face!”</p><br/><p>The gazes of the entire place shifted along with the voice. They all gathered on Xiao Yan. Most of the people present knew that there was a conflict between the Wind Lightning Pavilion and Xiao Yan. If Xiao Yan’s identity was confirmed, this little fellow would likely be unlucky today. Regardless of how strong he was, he would definitely be unable to successfully escape alive amid being surrounded by so many experts from the Wind Lightning Pavilion.</p><br/><p>Xiao Yan’s eyes also became slightly dark and solemn in the face of the countless numbers of gazes. He did not expect to be recognized by Wang Chen. It was likely due to the ‘Heavenly Flame.’ When they had exchanged blows back then, Wang Chen was aware that the ‘Heavenly Flame’ of Xiao Yan had a suppressing effect on his Dou Qi. Naturally, he had a deep impression of it.</p><br/><p>Xiao Yan’s eyes were cold as they swept over Wang Chen, who was smiling in a savage manner. Immediately, a body hurried over. Lin Yan held a long spear in his hand and appeared beside Xiao Yan with a solemn face. Finally he asked in a deep voice, “Do you want to charge out?”</p><br/><p>Xiao Yan slightly shook his head. Given the strength of the two of them, it was likely that their chances of successfully escaping were very low if they forcefully tried to break out.</p><br/><p>“Just leave it to me…” Xiao Yan waved his hand and slowly raised his head. He immediately laughed in a cold voice as his hand grabbed his face. An item made of skin fell from it, revealing Xiao Yan’s original face. Since he was already unable to hide, there was naturally no need to conceal his face any longer.</p><br/><p>“Why? Pavilion chief Fei Tian, are you planning on attacking me again today?”</p><br/><p>Fei Tian’s face turned dark and cold when he saw Xiao Yan’s face, that had been deeply imprinted in his memory. His throat emitted a furious laugh as his body moved. A thunder resounded over the place and his figure suddenly disappeared!</p><br/><p>Xiao Yan’s expression changed when he saw Fei Tian’s body disappear. He sent Lin Yan back with palm as lightning glow flickered on his feet. His body slightly shook.</p><br/><p>Xiao Yan’s body had just trembled when Fei Tian appeared behind him in a ghost-like manner. His hand-claw, which was covered by lightning, violently penetrated through Xiao Yan’s chest. However, it was unfortunate that not the slightest amount of fresh blood appeared.</p><br/><p>“Afterimage?”</p><br/><p>Fei Tian’s hand shook and the afterimage was shattered. He slowly turned around, and his eyes coldly landed Xiao Yan suspended in a spot a few dozen meters above the ground. He coldly laughed, “It has only been a couple of months since I last saw you, but your strength has improved. No wonder you are so arrogant.”</p><br/><p>“The Wind Lightning Pavilion is only so-so. It specializes in the elders bullying the younger ones and using its numerical advantage to bully others!”</p><br/><p>Xiao Yan’s gaze was ice-cold as he stared at Fei Tian. A moment later, he suddenly let out a laugh. His eyes were raised as he looked at the expressionless Lei zun-zhe in the VIP seats. He mocked, “If Lei zun-zhe really feels that this little self has a great enmity with the Wind Lightning Pavilion, why don’t you act personally? With your Dou Zun’s strength, the little me will definitely be unable to survive one exchange from you. Why do you need to make it so troublesome?”</p><br/><p>Xiao Yan’s words immediately stirred an uproar in the stadium. Quite a number of people wondered if Xiao Yan had knocked his head against something. He dared to provoke Lei zun-zhe at this time? However, some of the smarter individuals let out a quiet praise in their hearts after being stunned. What kind of status did Lei zun-zhe had? A elite Dou Zun, an existence that was like a giant in the Central Plains region. His status had a massive gap with Xiao Yan that was difficult to measure. This was the case regardless of whether it was in terms of reputation or ability. After Xiao Yan spoke those words, Lei zun-zhe would not dare to personally attack Xiao Yan today unless he wished to gain the reputation of bullying someone younger just because he was older!</p><br/><p>In other words, these words of Xiao Yan had helped sever a truly dangerous roar. With his current strength, other than facing an elite Dou Zun, he would still have the ability to flee even against an expert like Fei Tian.</p><br/><p>“This brat is really cunning…”</p><br/><p>Jian zun-zhe softly laughed before glancing at Lei zun-zhe by the side, who remained expressionless.</p><br/><p>“There is no need to play these tricks in front of this venerable self (Dou Zun). There is no need for this venerable self to act in order to capture you.” Lei zun-zhe’s gaze stared indifferently at Xiao Yan. There was a little ripple within his voice.</p><br/><p>“With an elder like the Northern Pavilion in front acting, there is naturally no need for Lei zun-zhe to act. In any case, these things are something that the Wind Lightning Pavilion commonly does. Moreover, if the Northern Pavilion chief fails, there is still the Western Pavilion chief and Southern Pavilion chief.” Xiao Yan laughed.</p><br/><p>“Ha ha, brat, there is no need to speak with such thorny words. The western and southern pavilions will not intervene in the matter of the northern pavilion.” A large strong-looking man with naked arms laughed out loud in a thunder-like voice from the VIP seat. He was the pavilion chief of the Western Pavilion.</p><br/><p>Fei Tian frowned slightly when he heard this laughter. The status between Xiao Yan and him was really too different. Back then, he had no choice but to attack. It was unexpected that Xiao Yan still managed to flee. This had caused him to lose a great face. It was due to this that he was unable to control himself, and had launched an attack the moment he saw Xiao Yan. However, he found it difficult to make a decision on what he should do once he recovered his reasoning. If he were to really act when others did not, he would definitely end up with a reputation of bullying the weak. The Wind Lightning Pavilion was not the Yellow Spring Pavilion. It did not want such a reputation.</p><br/><p>However, if he did not attack at this moment, the other experts of the same generation within the Wind Lightning Pavilion would definitely not take the initiative to intervene unless Lei zun-zhe gave the order. Thus, choosing whether to attack or not was a headache to him.</p><br/><p>Fei Tian struggled for a moment in his heart before a ruthless expression finally flashed across his face. This Xiao Yan had caused his Wind Lightning Northern Pavilion to lose its reputation. He would definitely not let Xiao Yan off today.</p><br/><p>After Fei Tian had made up his mind within his heart, a majestic, frightening strength slowly woke from within his body. Under the traction of this frightening aura, the layers of clouds in the distant sky emitted a rumbling sound. Silver lightning flickered within them as thunder sounded!</p><br/><p>Xiao Yan’s eyes sank when he saw this. He did not expect this old fellow to be willing to end up with a bad reputation by insisting on attacking him…</p><br/><p>“Xiao Yan, run!”</p><br/><p>Lin Yan hurriedly cried out from within the arena. Fei Tian’s strength was really too frightening. Even though Xiao Yan had advanced to the Dou Zong class, the gap between Xiao Yan and him was really too difficult to measure. Xiao Yan basically had no chance of victory if the two battled.</p><br/><p>Xiao Yan slightly shook his head. This place was Lightning Mountain, the headquarters of the Wind Lightning Pavilion. It was easier said than done when it came to escaping. Only by taking a risky fight would he have a chance to live. Moreover…</p><br/><p>Xiao Yan’s eyes lifted up as he looked into the distance. Finally, they paused on the green-robed Feng zun-zhe, who appeared extremely free and easy in the VIP seats. Was this person a trustworthy person like his teacher had mentioned?</p><br/><p>Xiao Yan would naturally not announce Yao Lao’s name in public. Immediately, he inhaled a deep breath, cupped his hands together, and said in a deep voice, “Feng zun-zhe, this little self wishes for you to see something!”</p><br/><p>Feng zun-zhe was startled when he saw Xiao Yan suddenly speak to him. He immediately smiled and said, “Little fellow, this matter is between you and the Wind Lightning Pavilion, and it doesn’t seem to be related to my venerable self (Dou Zun)?” Feng zun-zhe was not acquainted with Xiao Yan. Naturally he would not offend the Wind Lighting Pavilion for Xiao Yan after having just met him for the first time. This was the case even if Feng zun-zhe was not afraid of the Wind Lightning Pavilion.</p><br/><p>Xiao Yan grinned. He took off the ancient black ring, that Yao Lao had left behind, from his finger. After which, he tossed it to Feng zun-zhe. If he was indeed as Yao Lao had described and was worthy of his complete trust, Feng zun-zhe’s subsequent actions should prove something. Of course, if the results were different than what Xiao Yan imagined, Xiao Yan would still settle the future matters by himself.</p><br/><p>Feng zun-zhe knit his eyebrows and looked at the dark-black object that flew over. Under a countless number of gazes, Feng zun-zhe grabbed the item with his hand. After which, he slowly opened his hand. An unusually familiar dark-black ring was lying within it.</p><br/><p>The faint smile on Feng zun-zhe’s face slowly stiffened the moment his eyes saw the black ring. At the same time, it appeared as if the entire stadium had stilled…</p><br/><p>At this instant, Feng zun-zhe’s body seemed to transform into a statue. His eyes were dull as he stared intently at the ring with a deep spiritual imprint. A frightening storm was whistling and forming above his head…</p><br/><p>Although he did not utter a single word, everyone knew that Feng zun-zhe was currently feeling an agitation in his heart he could not hide!</p><br/><p>After a short while, Feng zun-zhe’s body gradually relaxed in front of a countless number of stunned gazes His hand held the ring tightly as he leaned against his backrest. Both of his eyes were gradually shut and a soft voice carrying a tone that bore no argument was slowly emitted.</p><br/><p>“No one is allowed to touch this person!”</p><br/>\n</div>"}