{"title": "Chapter 1021: Come", "id": 1021, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1021-come", "volume_title": "Volume 11", "body": "<h1>Chapter 1021: Come</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1021: Come</u></strong></p><br/><p>The voice that had suddenly sounded by the side of his ear caused Lin Yan to be startled. The thoughts in his mind became dull for a moment before his eyes suddenly widened. He suddenly turned around. Both of his eyes revealed a wild joy and surprise when he saw that familiar face.</p><br/><p>“Shh, don’t say anything…”</p><br/><p>Xiao Yan merely smiled and whispered when he saw Lin Yan’s stunned expression.</p><br/><p>Lin Yan immediately reacted upon hearing this familiar voice again. An excitement that was difficult to describe swiftly surged into his eyes. He parted his mouth and nodded. Using a voice that only the two of them could hear, he said, “Good fellow, why have you come to the Central Plains?”</p><br/><p>Xiao Yan grinned in the face of Lin Yan’s excited expression. After which, he waved his hand, indicating that this was not the place to chat.</p><br/><p>Lin Yan also woke up when he saw this. His gaze swept around. The sudden unexpected situation back then had clearly attracted the gazes of everyone present. All of them were able to see Xiao Yan suddenly entering the arena to rescue him from Wang Chen’s hands with a Blitzkrieg tactic.</p><br/><p>Quite a number of Wind Lightning Pavilion’s expert guards around the arena immediately rushed over when they what Xiao Yan did. A furious sound was emitted from the arena, “Who are you? Why have you interrupted the competition?”</p><br/><p>Over a dozen Wind Lightning Pavilion’s experts with Dou Qi wings on their backs were suspended in the air. They surrounded Xiao Yan with cold, stern eyes. The weapons that they held in their hands vaguely emitted a cold glint.</p><br/><p>The sudden unexpected change had similarly exceeded Wang Chen’s expectations. When he had recovered, his dark, cold eyes were immediately locked onto Xiao Yan. The black-colored daggers in his hand gently rubbed against each other, emitting a creaking sound that caused one’s heart to feel cold.</p><br/><p>“According to the rules of the Grand Meeting, one cannot continue to attack anyone who admits defeat. However, this person ignored the rules earlier. Instead of going after him, why is everyone questioning me?” Xiao Yan released the hand grabbing Lin Yan’s shoulder. After which, he raised his head and glanced at the dozen plus experts from the Wind Lightning Pavilion as he spoke in a faint voice. Xiao Yan did not wish to expose his identity here. Hence, he had suppressed his voice on purpose, causing it to appear a little hoarse.</p><br/><p>The dozen plus experts from the Wind Lightning Pavilion were stunned when they heard Xiao Yan’s words. All of them glanced at Wang Chen. They had naturally witnessed the scene earlier. However, he was a member of the Yellow Spring Pavilion. Moreover, that Huang Quan zun-zhe was currently in the VIP seats. What decision could the few of them make in this situation. Naturally, they could only choose to close one eye. However, they did not expect that Xiao Yan would intervene. Moreover, they had never expect that this person who had intervene did not appear to have understood the situation. Could the background of this Wang Chen be measured with the treatment of an ordinary person?</p><br/><p>Although they thought in this manner, they would naturally not dare to speak like this in public. After all, Wang Chen was the unreasonable one in this manner. Xiao Yan’s rescue might be somewhat against the rules, but it was within reason.</p><br/><p>“He is but trash who relied on luck to reach this point. It’s fine if I kill him. What’s so great about that?” The experts from the Wing Lightning Pavilion might not dare to say it, but Wang Chen could act this fearlessly. He immediately let out a cold laugh. There was disdain within his evil voice.</p><br/><p>“You as****!”</p><br/><p>A furious flame surged into the eyes of the fiery-tempered Lin Yan when he heard this. He had just taken a step forward when he was grabbed by Xiao Yan.</p><br/><p>Lin Yan could only grit his teeth violently after being grabbed by Xiao Yan. He turned around and stared at him in a dissatisfied manner. In his memory, Xiao Yan did not appear to be the kind of person who would swallow such an insult.</p><br/><p>“It looks like the people from the Yellow Spring Pavilion only have such quality. The reason you are able to last until now is because you are relying on the reputation of the Yellow Spring Pavilion. There is nothing worthwhile to be arrogant about…” Xiao Yan held Lin Yan as his eyes looked at Wang Chen and coldly laughed. He had similarly found this person to be quite an eyesore.</p><br/><p>The expression in Wang Chen’s eyes had turned as chilly as a poisonous snake when he heard this. A ferocious look vaguely appeared on his face.</p><br/><p>The gazes of the other competitors around the arena looked over. Their eyebrows were knit when their eyes swept over Xiao Yan. Immediately, they shook their heads and muttered, “Reckless fellow.”</p><br/><p>On the surface, Xiao Yan’s strength was specifically suppressed at the level of an eight star Dou Huang. With his current Spiritual Strength, even an expert like Fei Tian would likely have difficulty clearly seeing his exact strength, much less these people. However, there was one exception. Her pretty eyebrows were slightly bunched together when her eyes landed on Xiao Yan for the first time. A special sense that she was born with caused her to feel that he was vaguely familiar.</p><br/><p>“It is not up to you as a younger generation to discuss what the Yellow Spring Pavilion is like. Whose disciple are you? Tell this old me. By being able to teach such an arrogant disciple, it is likely that your teacher should also possess some ability, no?” Xiao Yan’s cold laugh had just sounded when Huang Quan zun-zhe from the seats in the middle of the stadium raised his eyebrows and glanced at Xiao Yan. His faint voice contained a dense, cold feeling.</p><br/><p>Huang Quan zun-zhe sized Xiao Yan up when he spoke these words, and surprise flashed across his eyes. At a glance, he could tell that this person’s appearance was purposefully altered. The thing that caused him to be most surprised was that this fellow’s aura had a kind of obscure feeling to it. When he was about to perform a deeper observation, he sensed that the other party was covered within a layer of extremely hot flame. Although there were many obstructions, his old, sharp eyes could still tell that this fellow’s strength was likely at least at the peak of the Dou Huang class.</p><br/><p>This kind of feeling of having his sight blocked caused Huang Quan zun-zhe to be stunned. He had the strength of a Dou Zun, yet he was unable to see through the strength of a member of the younger generation.</p><br/><p>While Huang Quan zun-zhe was feeling stunned by this, Lei zun-zhe, Feng zun-zhe, and Jian zun-zhe also shared this same feeling. All of them felt somewhat surprised in their hearts.</p><br/><p>The sudden words uttered by Huang Quan zun-zhe caused Xiao Yan’s brows to be slightly knit. He did not expect that these old fellows would intervene and speak in this kind of competition between the younger generation. Immediately, he cupped his hands and spoke in a manner that was not inferior, “Huang Quan zun-zhe really thinks too highly of the little me. I am merely speaking the truth as it is. This friend of mine has already admitted defeat, but the other party still launched a killing move. This action has already violated the rules of the competition. The remaining three Dou Zun sirs have seen it clearly with their own eyes. I think that everyone knows just who is right and who is wrong in their hearts.”</p><br/><p>Quite a number of people felt admiration when they saw that Xiao Yan did not panic even a little when facing four elite Dou Zuns. This mentality was not something that an ordinary person possessed. After all, every single elite Dou Zun was a giant. It was not overboard to say that they could summon clouds with a flip of their hand and call the rain by turning it.</p><br/><p>This reply of Xiao Yan had also somewhat exceeded the expectations of Lei zun-zhe and the two others. Before they could reply, however, the expression of Huang Quan zun-zhe had become much darker. His voice was ice-cold as he uttered, “A mere advantage of words. Lei zun-zhe, finish off this little trouble and don’t hinder the progress of the competition.”</p><br/><p>One could not see any emotion on Lei zun-zhe’s face as his finger gently tapped his armrest. He smiled faintly. His eyes swung to Feng zun-zhe and Jian zun-zhe beside him as he asked, “Ke ke, how do the two of you think we should deal with this matter?”</p><br/><p>This old fellow was really cunning. He knew that it was easy to offend others like this. Wang Chen was in the wrong. If he favored him too much, everyone would think that the Wind Lightning Pavilion was unfair, damaging its reputation in the process. If he did not do anything, it was likely to offend Huang Quan zun-zhe. Hence, he had thrown this hot potato to Feng zun-zhe and Jian zun-zhe.</p><br/><p>“Let’s do it according to the rules. Anyone who commits an offence in the competition must suffer a heavy punishment. However, on account of this being the first offense of this person, let him suffer fifty strikes of the thunder rod and expel him from Lightning Mountain.” Huang Quan zun-zhe spoke in an indifferent tone. That tone of his appeared to be discussing an insignificant manner. Of course, given his strength, he did indeed possess the qualification to say these words.</p><br/><p>“He is not the one in the wrong. Are you trying to cause Lei zun-zhe to end up being called unfair by randomly punishing this person?” Feng zun-zhe laughed and glanced at Huang Quan zun-zhe as he replied.</p><br/><p>Huang Quan’s zun-zhe’s eyes became a lot more dangerous when he heard this. The Yellow Spring Pavilion did not have a reputation of being nice. If he allowed Xiao Yan to leave in peace after he openly ridiculed them, the reputation of the Yellow Spring Pavilion would be lost.</p><br/><p>“Ke ke, Feng zun-zhe is right. Although this person has interrupted the competition, he had a reason for doing so. Moreover, the actions of Wang Chen clearly show that he does not have any regards for the rules. It will really be difficult to explain things if the other person was punished. Why don’t we do this. Let’s all take a step back and allow this person to leave with his friend. The Grand Meeting will continue. What do you say?” Jian zun-zhe rubbed his beard as he laughed.</p><br/><p>Lei zun-zhe was startled. Immediately, he shook his head helplessly in his heart. These two old fellows were clearly intending on getting Huang Quan zun-zhe to lose face. However, what they had said was also reasonable. His Wind Lightning Pavilion was not the Yellow Spring Pavilion. Its style of doing things was also completely different. All Lei zun-zhe could do at that moment was smile apologetically to Huang Quan zun-zhe.</p><br/><p>Huang Quan zun-zhe’s face became much uglier when he saw the expression of Lei zun-zhe. His gaze were icy as he observed Xiao Yan, who had sighed in relief within the arena. A faint fierceness flashed across his face. Immediately, a calm voice was emitted ahead of Feng zun-zhe, “Since you think that Wang Chen has endured until the end because he relied on my Yellow Spring Pavilion, this venerable self (Dou Zun) shall give you an opportunity to exchange blows with him. You can bring your friend with you and leave peacefully regardless of the results. What do you say?”</p><br/><p>Huang Quan zun-zhe’s words immediately stirred an uproar in the stadium. Xiao Yan also frowned. It seemed that this old fellow did not possess the magnanimity that an elite Dou Zun ought to have.</p><br/><p>“Don’t care about this old fellow who won’t die. Let’s leave…”</p><br/><p>Lin Yan’s expression slightly changed. He pulled Xiao Yan with the intention to leave. It was unexpected that this old fellow would say such words. He understood Wang Chen’s strength very well. It was likely that only Feng Qing Er and a couple of others present could fight with him.</p><br/><p>“If you do not dare to fight, you should kowtow three times to teacher. This matter will end if you do so. Otherwise, you will not be able to leave.”</p><br/><p>Wang Chen’s bright-red tongue gently licked his sharp dagger as he ferociously laughed at Xiao Yan.</p><br/><p>Xiao Yan’s dark-black eyes stared intently at Wang Chen. The hands under his sleeves were tightly clenched.</p><br/><p>Should he fight or should he not fight?</p><br/><p>The eyes of everyone present paused on Xiao Yan. All of them wanted to know just how this young man, who appeared neither submissive nor overbearing, would deal with Wang Chen’s provocation. Although most of the people present did not hold much hope, they still wished for Xiao Yan to fight with Wang Chen due to him being too displeasing to the eye.</p><br/><p>Xiao Yan finally sighed slowly in front of everyone a moment later.</p><br/><p>“Xiao Yan, don’t be reckless…”</p><br/><p>Lin Yan hurriedly said. His expression changed when he saw Xiao Yan’s actions.</p><br/><p>Xiao Yan turned his head and smiled. After which, he freed himself from Lin Yan’s grip as he softly said, “Relax… a person who has come from the Inner Academy will not be weaker than some random person from the Yellow Spring Pavilion.”</p><br/><p>Xiao Yan slowly took a step forward after saying those words. His eyes looked at Wang Chen, and a simple word caused the hot blood of the countless number of people present to boil.</p><br/><p>“Come…”</p><br/>\n</div>"}