{"title": "Chapter 1020: Chaotic Filtering", "id": 1020, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1020-chaotic-filtering", "volume_title": "Volume 11", "body": "<h1>Chapter 1020: Chaotic Filtering</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1020: Chaotic Filtering</u></strong></p><br/><p>After Lei zun-zhe words rang out, the atmosphere in the arena suddenly became tense. Fifty-three gazes swept across each other. Their eyes were filled with caution for the other party. In this kind of chaotic situation, all one needed to do was to get themselves to continue remaining in order to obtain victory. At the same time, however, most of the people knew that this selection was extremely harsh and cruel.</p><br/><p>Only eight among the fifty-three people would remain. Four of these eight positions were already occupied by the people from the four pavilions. In other words, only four among the other forty-nine people would be able to remain.</p><br/><p>Four out of forty-nine. One could just imagine just what kind of intense battle would erupt as a result of such a filtering method.</p><br/><p>While the atmosphere in the arena was tense, the stadium around it also became quiet. Countless numbers of eyes were staring at the arena without blinking. The people inside were all considered the top among the younger generation. Other than a small portion of them, most of the people possessed a strength that they were really proud of. The battle that erupted between these people would naturally catch the attention of others.</p><br/><p>Ever since Xiao Yan discovered Lin Yan’s figure, his eyes had remained focused on him. With his eyesight, he was naturally able to tell the latter’s strength at a glance. Four star Dou Huang. This strength might be considered quite good in other places, but it was barely considered to meet the requirement to participate in the competition in this place.</p><br/><p>“It is unexpected that he has actually reached the Dou Huang level after having not met for a couple of years. I remember before I undertook the retreat back then, Lin Yan’s strength was merely at the Dou Wang class. It seems that he should have also met with some lucky and unique encounters during these years…” Xiao Yan’s eyes rotated over Lin Yan’s back as he softly muttered to himself.</p><br/><p>A lucky and unique encounter was not some fantasy in the Central Plains. Xiao Yan was able to borrow the help of the Heaven Mountain Blood Pool to breakthrough to the Dou Zong class. Naturally, other people would also be able to obtain some unique encounters that an ordinary person would find it difficult to experience. The Central Plains were extremely vast. Who was able to completely investigate the interior of those vast mountain ranges?</p><br/><p>“However, for some unknown reason, Lin Xiu Ya and Liu Qing are not with him. The three of them should have left together…” Xiao Yan muttered. He had quite a good impression of Lin Yan and the two others. Moreover, when he had just broken through to the Dou Wang class, Lin Yan and the other two still followed him despite knowing that he had a great enemy like the Misty Cloud Sect. This favor was something Xiao Yan did not allow himself to forget. However, these three fellows had left by themselves because of boredom after the matter of the Misty Cloud Sect was settled. Thus, Xiao Yan had lacked the opportunity to return the favor.</p><br/><p>“Clang!”</p><br/><p>The atmosphere in the arena had reached such a tense and unbearable level while Xiao Yan was muttering to himself when someone finally could no longer endure it. He took the lead to attack as the weapon in his hand pierced toward a person a short distance from him. However, the people within the arena were in an extremely cautious state. This person’s figure was discovered the moment he moved. The person who was attacked allowed the Dou Qi in his body to surge in his anger. Immediately, he tightened his grip on the weapon in his hand and attacked the one who had launched a sneak attack.</p><br/><p>With the two exchanging blows, the tense atmosphere in the arena instantly collapsed. Waves of various-colored, powerful Dou Qi surged out. After which, the entire arena had completely descended into chaos.</p><br/><p>Over fifty Dou Huang class Dou Qi had spread to every single corner of the stadium. A powerful energy pressure permeated the stadium, causing quite a number of people to feel a pressure.</p><br/><p>Dou Qi spread in all directions in the arena as chaos continued to spread. At this moment, almost everyone beside them was their opponent. Hence, every single person acted like frightened birds. As long as someone entered within a few dozen feet from them, the Dou Qi within their bodies would involuntarily unleash a fierce attack on the person who had barged into their territory.</p><br/><p>In this chaos, it was only natural that situations of a few people joining hands against another became a common occurrence. At this moment, one could only consider such a person unlucky. In the face of attacks by a couple of people at a similar level, that person would be swiftly defeated within less than ten exchanges.</p><br/><p>Chaos was a kind of catalyst. Seeing the chaotic battle in the arena that caused one’s skin to turn numb, the surrounding gallery erupted into a soul-stirring cheer. Quite a number of people’s faces and necks reddened because of the atmosphere. From the looks of it, they seemed to wish that they were one of those present in the arena.</p><br/><p>The deafening sound wave caused Xiao Yan to feel quite helpless. A thought flashed through his heart and his Dou Qi covered both of his ears, completely isolating him from the noise. His gaze, on the other hand, had remained focused on the chaotic battle.</p><br/><p>At this moment, the arena had descended into complete chaos. The clear sound of colliding Dou Qi and clashing blades reverberated around. In this chaotic situation, there was a continuous number of people vomiting blood and withdrawing despite the people present being strong individuals. This place was far too chaotic. If one managed to defend their front, they were unable to defend their back. Enemies were all around them. If one was careless, there would be a fatal blow heading one’s way. Blades did not possess eyes in such a competition. Being injured was a frequent matter. If one shouted ‘I admit defeat’ just before suffering a fatal blow, there would naturally not be a killing move against launching against the loser according to the rules.</p><br/><p>The chaos continued for less than ten minutes, but there were over a dozen seriously injured competitors who had no choice but to leave the arena. After all, if they were to continue fighting, it would likely no longer just be a question of serious injuries…</p><br/><p>The chaos in the battleground had also somewhat exceeded Xiao Yan’s expectations. Originally, he had thought that this kind of grand competition would choose a traditional one-on-one elimination method. Unexpectedly… it had resorted to this hodgepodge elimination… hence, not only would one require ability, but one would also need a certain amount of luck. After all, even a hero would fall after being outnumbered. Even if one was an expert at the peak of the Dou Huang class, the result of him being unluckily attacked by over a dozen Dou Huangs would also likely be quite miserable.</p><br/><p>Of course, the person that really exceeded Xiao Yan’s expectations was Lin Yan. His strength could only be considered intermediate in this place. However, he was not eliminated despite over ten minutes passing. Xiao Yan only managed to tell some of the reasons after carefully observing him.</p><br/><p>“This Lin Yan’s agility… seems to be very strange… but it is just too ugly.”</p><br/><p>Xiao Yan was deep in thought as he watched Lin Yan’s agility, which appeared extremely ugly to the point of being awkward. On the surface, it was just like a duck swaying left and right. However, under Xiao Yan’s eyesight, he was able to tell that this agility Dou Technique was definitely not ordinary. It profoundness was not inferior to the Three Thousand Lightning Movement.</p><br/><p>“This fellow really has had a unique encounter during these years…” Xiao Yan smiled. He was certain that this ugly, awkward agility technique was something that Lin Yan of the past had never practiced. Clearly, it should be something that he had obtained during these years of training.</p><br/><p>Xiao Yan sighed in relief when he saw that Lin Yan was able to endure. Regardless of the situation, he and Lin Yan had quite a good relationship. It was natural that he would feel happy to see him gain an achievement today.</p><br/><p>Xiao Yan’s eyes shifted away from Lin Yan and slowly swept over the arena. Immediately, he narrowed his eyes. The arena might currently be extremely chaotic, but there were still four safe, small circles. The owners of these four small circles were Feng Qing Er, Mu Qing Luan, Tang Ying, and Wang Chen…</p><br/><p>The aura of these four was maintained at the peak of the Dou Huang class. Their faces were cold as they studied the somewhat chaotic battleground around them. Anyone who dared to step into their territory would immediately receive a fierce attack. The strength of the four of them could be considered top notch in this place. Although there were a couple of others who performed quite well in the arena, they clearly did not dare to randomly make contact with these four.</p><br/><p>The chaos continued within the arena. It had basically become a filter where people were eliminated. Those who remained were swiftly becoming fewer and fewer.</p><br/><p>Following the swift reduction in numbers, the chaos within the arena gradually diminished, especially the case when there were only eleven people remaining in the arena. The chaotic arena immediately became unusually quiet. The eleven people were scattered all over the place. While they were panting, they were also cautiously watching each other.</p><br/><p>Xiao Yan beamed when his eyes swept over the arena and discovered that Lin Yan was among them. However, the weakest person within the arena was also him. Other than Feng Qing Er and the three others, most of the others remaining were seven star or eight star experts. Of course, the reason he was able to endure until now was mainly because of his strange agility Dou Skill.</p><br/><p>Being unique, it was naturally much easier for Lin Yan to attract the attention of the others. It was the first time in so many Four Pavilion Grand Meeting that someone was able to endure until now with just the strength of a four star Dou Huang.</p><br/><p>Of course, such good luck would naturally not continue to accompany Lin Yan. After the eleven people in the arena had briefly rested, the ten others immediately turned their gazes toward him with ill intent. A red-clothed man among them, who had reached the strength of an eight star Dou Huang, stomped on the ground. His body shot straight toward Lin Yan like an arrow.</p><br/><p>Seeing that he had attracted the attention an eight star Dou Huang, Lin Yan’s expression involuntarily changed. That strange agility was unleashed as he narrowly dodge the fierce attack that arrived. At the same time, his footsteps also quickly withdrew.</p><br/><p>That red-clothed man let out a cold laugh after his futile attempt. The large blade in his hand was drawn until many afterimages appeared. His body moved and quickly gave chase like the maggots in one’s bones. The sharp blade glow in his hand forced Lin Yan to pull back.</p><br/><p>Xiao Yan had already stood up on the silver wood. His eyes narrowed as he watched Lin Yan, who narrowly escaped time and time again. He would not watch Lin Yan die from another person’s blade. If it came to a critical juncture, he would naturally intervene and rescue him.</p><br/><p>“But… something seems wrong…”</p><br/><p>Xiao Yan’s eyes firmly stared at the two where one was chasing and the other fleeing. His brows were suddenly knit together. That red-clothed man had a couple of chances to injure Lin Yan earlier, but he did not attack. From the looks of it, it seemed as though he was purposefully chasing Lin Yan?</p><br/><p>Xiao Yan’s eyes congelated as he mused a little. Immediately, his gaze paused on a yellow-robed man with a cold face closest to Lin Yan. This person was not unfamiliar to Xiao Yan because he was Wang Chen from the Yellow Spring Pavilion. At this moment, he was like a poisonous snake as he looked at Lin Yan approaching his territory. The corner of his mouth revealed a sinister look.</p><br/><p>“That fellow is planning on forcing Lin Yan into Wang Chen’s attacking range!”</p><br/><p>Xiao Yan’s heart turned cold. This fellow was really vicious. He was thinking of using another person to do his dirty deed!</p><br/><p>Just when Xiao Yan had discovered the intention of the red-clothed man, Lin Yan, who was swiftly withdrawing, finally took a step into Wang Chen’s attacking range.</p><br/><p>A chill surged into Lin Yan’s heart when his feet stepped into range. Immediately, he saw the red-clothed man in front of him smile sinisterly as he swiftly pulled back. The corner of his eyes drifted, only to see a black-colored pillar that contained an incomparable amount of killing intent shooting toward his throat like a poisonous snake.</p><br/><p>“Stop, I admit defeat!”</p><br/><p>Lin Yan felt his heart immediately turn numb when he saw this black-colored pillar attack. The gap between Wang Chen and him was really too great. Even with the help of his agility, he was no match for him.</p><br/><p>However, Wang Chen merely laughed in the face of Lin Yan’s cry. He was a bloodthirsty person and blood had to appear on his hand. How was it possible for him to withdraw his attack.</p><br/><p>“Dammit, you shameless bastard.”</p><br/><p>Lan Yan furiously cursed with a pale face when he saw that this fellow did not let him off despite having admitted defeat. Nevertheless, cursing was one thing. At this critical moment, his strange ugly agility was hurriedly displayed. His body swayed strangely as he swiftly withdrew.</p><br/><p>“Bang!”</p><br/><p>The black pillar shot over like a poisonous snake, striking Lin Yan’s shoulders.</p><br/><p>“Chi!”</p><br/><p>Lin Yan immediately vomited a mouthful of fresh blood after suffering this heavy blow. His body rubbed on the ground, forming a scar that was dozens of meters long. Had he not avoided being struck in a fatal point, it was likely that he would have died.</p><br/><p>The scene in the battleground had stirred waves of curses outside of the arena. Wang Chen used such a vicious attack when the other party had already admitted defeat. From the looks of it, he did appear a little despicable.</p><br/><p>Wang Chen completely ignored the noise outside of the arena. His gaze was dark and cold as it stared at Lin Yan. The other party’s earlier curse had clearly stirred the killing intent within his heart. Immediately, he let out a cold smile. His hand was clenched and two long black daggers rolled down from his sleeves. His body shot out in a lightning-like manner and appeared in front of Lin Yan in the blink of an eye. The daggers in his hands did not hesitate as they turned into black glint that trickily and viciously pierced toward Lin Yan’s chest. Lin Yan didn’t have the time to dodge.</p><br/><p>“Dammit, this fellow is really shameless. He has really thrown away the face of the Yellow Spring Pavilion!”</p><br/><p>If Wang Chen earlier actions were said to have stirred some boos, this current action of his had infuriated quite a number of people. Immediately, many furious curses were emitted from all directions.</p><br/><p>The many curses appeared to have merely caused the smile on Wang Chen’s face to become colder. However, the actions of his hands were not the least bit slowed. Li Yan could only watch as the black glint, which contained a cold air pierced toward a fatal spot. Moreover, he did not possess any ability to dodge it…</p><br/><p>“Am I about to die here?”</p><br/><p>A soft muttering sounded in Lin Yan’s heart. Just when he was prepared to shut his eyes and await his death, however, a suction force suddenly surged from behind him. His body also involuntarily pulled back. Immediately, he sensed a warm hand patting his shoulders. After which, a helpless voice which seemed familiar appeared beside his ear without any forewarning.</p><br/><p>“You, do you have nothing better to do, but come here and participate?”</p><br/>\n</div>"}