{"title": "Chapter 1038: Practicing the Flame Creation Skill", "id": 1038, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1038-practicing-the-flame-creation-skill", "volume_title": "Volume 11", "body": "<h1>Chapter 1038: Practicing the Flame Creation Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1038: Practicing the Flame Creation Skill</u></strong></p><br/><p>Two rays of light shot over from the distant sky. The wind that had been created from the fast speed whistled continuously through the air.</p><br/><p>“We are now on the boundary of the northern region. However, if we simply rely on our own flying, it is likely that we will need two to three months in order to reach the Pill Region. However, we are quite lucky. There is a city called Sky Maple City not far from this place. There is coincidentally a wormhole that leads to the middle of the Central Plains there. If we were to take that route, we will be able to save over half the time.” Lin Yan, who was leading at the front, suddenly turned his head and spoke to Xiao Yan. Two rays of light flashed through the sky.</p><br/><p>Xiao Yan nodded upon hearing this. All he wanted was to arrive in the Pill Region as soon as possible. If he were to estimate the time, he had been separated from the Little Fairy Doctor’s group for half a year. He wondered just how they were faring…</p><br/><p>“However, you should hide your appearance as much as possible. After the matter with the Lightning Mountain, your current reputation is not inferior to that of Feng Qing Er. Moreover, you possess that so-called Ancient Phoenix Essence Blood in your body. I’m afraid that Feng Qing Er will not give up. She will quietly search for you. It is better for you to cover your appearance a little.” Lin Yan reminded.</p><br/><p>Xiao Yan naturally did not reject Lin Yan’s suggestion. Feng zun-zhe had also mentioned that he should try to avoid coming into conflict with the Heaven Demon Phoenix tribe at this moment. Those fellows were no ordinary individuals. If their relationship soured, they would be extremely troublesome to deal with. This was especially the case on the precondition of them having to also deal with the ‘Hall of Souls.’</p><br/><p>Xiao Yan took the skin-like item from his Storage Ring and placed it over his face. This thing might be useless against a sharp-eyed expert, but it was an extremely convenient way to hide one’s appearance.</p><br/><p>Lin Yan smiled and nodded when he saw Xiao Yan once again transforming into the ordinary appearance that Lin Yan saw when they had been reunited. After which, he turned around and looked in front of him. The faint outline of an enormous city appeared on the edge of their sight…</p><br/><p>“Let’s go. We are arriving. Speed up.”</p><br/><p>Lin Yan waved his hand. After which, he suddenly increased his speed and rushed toward the distant city. Xiao Yan followed close behind him.</p><br/><p>As the saying went, a horse would die from galloping if one followed the sight of a mountain and ran. Although they were able to vaguely see the outline of the city, Lin Yan still had to fly for nearly twenty minutes or so with his speed before that enormous city gradually appeared in front of their eyes.</p><br/><p>The both of them descended from the sky and successfully entered this city called Sky Maple City. Xiao Yan did not hurry toward the wormhole after entering the city. Instead, made his way to the largest auction house in the city. After which, he spent quite a great amount of money and purchased three types of beast flames.</p><br/><p>These kinds of beast flames were usually obtained from the bodies of Magical Beasts. Their strength was not considered great. Some even failed when compares to a flame agglomerated from Dou Qi. Of course, one must also look at the level of the Magical Beast. Those beast flames within some frighteningly strong Magical Beast were naturally quite strong. One example was the unusual black flame of Feng Qing Er. If one of those old demons from the Heaven Demon Phoenix tribe appeared, it was likely that even if Xiao Yan unleashed the Glazed Lotus Heart Flame to its limit, he might not be able to suppress the other party. This was the gap between their strengths.</p><br/><p>Lin Yan was also quite surprise that Xiao Yan was collecting such beast flames. However, seeing that Xiao Yan did not give an explanation, he chose not to inquire. Only after Xiao Yan had gathered all the things that he needed did Lin Yan led Xiao Yan to the center of Sky Maple City.</p><br/><p>……</p><br/><p>Xiao Yan stood in the spacious open ground at the center of Sky Maple City. He looked at the thousand-foot-tall dark-black wormhole and involuntarily inhaled a breath of cold air. It was likely that one could only find such a spectacular item in the Central Plains.</p><br/><p>“The wormhole of Sky Maple City is created by two elite Dou Zuns together. It is extremely stable and not a single spatial storm has appeared after so many years of use. Thus, the human traffic within Sky Maple City was at a level that no other city within five hundred kilometers could compare with it.” Lin Yan smiled and spoke when he saw Xiao Yan’s shocked manner.</p><br/><p>“Two Dou Zuns, no wonder…” Xiao Yan came to a sudden understanding after hearing this. The number of elite Dou Zuns whom he had seen during these years could be counted with one hand. They were basically the few that Xiao Yan had seen at the Lightning Mountain a couple of days ago. In the past, such a strength was really unattainable from his perspective.</p><br/><p>“Let’s go. It is already quite late. If we delay any longer, the wormhole will be closed for the day.” Lin Yan waved his hand and swiftly climbed the stairs. After paying two shares of the expensive toll to the guards in front of the wormhole, the two of them successfully entered the wormhole.</p><br/><p>Lin Yan took out a palm-sized crude, small boat before entering the wormhole. Xiao Yan had seen this thing. A space boat. It was a transport one could use to fly through a wormhole. When Xiao Yan’s group had arrived in the Central Plains back then, they had also rode on this small thing. However, it was obvious that the quality of this boat belonging to Lin Yan was not very good. It looked exceptionally simple.</p><br/><p>“The price of a space boat is extremely expensive. This thing might appear simple and crude, but it cost me a total over two million gold coins in order to get my hands on it. I have risked my life and relied on killing two rank 6 Magical Beast in order to obtain the two million gold coins.” Lin Yan’s face turned a little red when he saw Xiao Yan’s eyes, and he immediately defended himself.</p><br/><p>“Hee hee, however, it is fortunate that I managed to luckily enter a cave after having killed those two rank 6 Magical Beast. The agility Dou Technique I am practicing was obtained from that place. It might look ugly when it is being used, but this agility skill is at the Di class middle level.” Lin Yan became a little enraptured when he spoke until the end. It seemed that he had gained quite a lot from his unique encounter.</p><br/><p>“What is this agility Dou Technique called?” Xiao Yan was somewhat curious. He had seen Lin Yan’s agility technique. Although it appeared ugly, it was quite practical.</p><br/><p>“Bat Duck Dodging Fire Steps.” Lin Yan rubbed his head and spoke with some embarrassment. The name of this agility Dou Technique lacked ornamental value, just like the way it was used.</p><br/><p>“It is quite a good agility Dou Technique. With this agility Dou Technique, it is likely that even some six star Dou Huangs will not be able to harm you.” Xiao Yan looked at the queue in front, nodded, and softly replies.</p><br/><p>“This Bat Duck Dodging Fire Steps also have a matching Qi Method known as Fire Bat Method. However, it is only at the Di class low level. Hee hee, I am able to reach this strength during these years all thanks to this Fire Bat Method…” Lin Yan moved closer to Xiao Yan and proudly laughed.</p><br/><p>Xiao Yan also laughed when he heard this. His heart immediately let out a soft sigh. Currently, the Flame Mantra was stuck at the Di class low level. A Qi Method of this level might be sufficient for him when he was in the Dou Huang class, but now that he had advanced to the Dou Zong class, his requirement for Qi Methods had also become even harsher. It seemed that he needed to quickly raise the Qi Method’s level…</p><br/><p>“I am about to enter the Pill Region and should also prepare some items as soon as possible. It is best that I practice the Flame Creation Skill that I have obtained. Otherwise, the remaining ‘Life Transforming Flame’ would only support my usage of the Extermination Fire Lotus once. This is not enough…” Xiao Yan thought in his heart. Although he had already advanced to the Dou Zong class, the only powerful trump card he had that could kill an old demon like Fei Tian was this Extermination Fire Lotus. Hence, he needed to prepare this thing beforehand. The Pill Region was situated in the middle of the Central Plains region. Other than the Pill Tower, there were many powerful factions that were not weaker than the Wind Lightning Pavilion there. If he wanted to survive in that place, he would find it difficult to navigate it should he not possess some trump cards.</p><br/><p>While Xiao Yan was deep in thought, the queue had reached their turn. The two of them strode forward and entered the enormous wormhole. A spatial fluctuation appeared and the two of them disappeared into it.</p><br/><p>……</p><br/><p>The interior of the dark-black spatial tunnel had two spatial walls that had been created from spatial strength on both sides. If one’s gaze were to pass through the silver-white wall, one would be able to see an endless emptiness beyond. This kind of darkness appeared to be endless, causing one to feel a chill within one’s heart.</p><br/><p>Xiao Yan sat on that simple and crude space boat while Lin Yan was seated in front. He was controlling the space boat as it advanced. There were quite a number of various-sized space boats around them, which were also filled with quite a number of people. With so many people traveling, the quiet space tunnel no longer appeared lonely. There was laughter and chatting noises repeatedly being transmitted from around them.</p><br/><p>“We will require at least a month’s time in order to pass through this wormhole. You should rest first. It is fine if I control this boat.” Lin Yan turned his head and spoke o Xiao Yan after the space boat had gotten on the right track.</p><br/><p>Xiao Yan did not reject Lin Yan’s offer when he heard this. He smiled and nodded. Coincidentally, he required this month’s time in order to practice the Flame Creation Skill.</p><br/><p>A thought passed through Xiao Yan’s mind and a crimson scroll immediately appeared. There was a heat being vaguely emitted from it. This was naturally the Flame Creation Skill Xiao Yan had obtained from the Demon Flame Valley back then…</p><br/><p>The old Flame Creation Skill required three people to practice it in order to form a Life Transforming Flame. However, this scroll in Xiao Yan’s hands had undergone much alteration by the Old Ground Demon Ghost over many years. Not only did it not require three people, but the ‘Life Transforming Flame’ that was formed would no longer exhaust the life force within one’s body. It was of a much higher grade compared to the original skill. At the very least, even Xiao Yan ended up being surprised by the Old Ground Demon Ghost’s ability. Improving a Dou Technique was not a simple task…</p><br/><p>Xiao Yan’s hand slowly opened the scroll. His Spiritual Strength also entered it. A large amount of information immediately surged into his mind. This information was naturally the true training method of this Flame Creation Skill!</p><br/><p>While Xiao Yan had shut his eyes and studied the Flame Creation Skill Dou Technique, the space boat flew swiftly under Lin Yan’s control, flying toward the extremely distant end of the space tunnel. The exit led to the middle of the Central Plains, a region which possessed an even greater attraction than the northern region…</p><br/>\n</div>"}