{"title": "Chapter 1039: Refining Beast Flame", "id": 1039, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1039-refining-beast-flame", "volume_title": "Volume 11", "body": "<h1>Chapter 1039: Refining Beast Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1039: Refining Beast Flame</u></strong></p><br/><p>Numerous rays of lights flashed in the spacious tunnel. One could even vaguely see the outline of some boats.</p><br/><p>Lin Yan alone was sufficient to handle the matter of controlling the space boat. Hence, Xiao Yan did not need to divert any attention. He placed all his focus on the Flame Creation Skill. If he could learn this Flame Creation Skill within this one month long journey through the space tunnel, it would be advantageous to Xiao Yan.</p><br/><p>Of course, this Flame Creation Skill was the top level Dou Technique of the Demon Flame Valley. There would naturally be something extraordinary to it, and it would likely be quite difficult if one wished to master it within a short period of time. However, this clearly did not obstruct Xiao Yan since he decided to practice it.</p><br/><p>Xiao Yan’s attention became completely engrossed in the training method recorded in the scroll on the first day of travel. The ‘Flame Creation Skill’ of the past required three people to practice it together and sacrifice their life force in order to create the ‘Life Transforming Flame.’ However, after the added improvements by the Old Ground Demon Ghost over the years, the current Flame Creation Skill was completely different from its previous form.</p><br/><p>After studying this improved Flame Creation Skill properly, Xiao Yan involuntarily felt astounded at the ability of the Old Ground Demon Ghost. The drawbacks of this Flame Creation Skill had been remedied by him. Of course, as a result, the already tedious training method had become even more complicated.</p><br/><p>According to what was recorded on the scroll, the improved Flame Creation Skill required three types of beast flames. After which, one would have to merge the three types of beast flames in one’s body and use one’s Dou Qi to refine and compress them a countless number of times until they were refined to their limits. After which, one had to perfectly merge these three beast flames together. If one succeeded, one will form a ‘Life Transforming Flame’ fire seed.</p><br/><p>Of course, this wisp of fire seed would naturally not be able to support Xiao Yan’s usage of the Extermination Fire Lotus. He needed to find various beast flames, refine them according to the method recorded in the Flame Creation Skill and merge them into this fire seed, allowing the fire seed to continuously expand and strengthen…</p><br/><p>This might not seem too difficult if one simply heard the procedure, but it could end up stumping most people if one were to attempt it. The nice part was beast flames were very common. One would usually be able to purchase some from large auction houses. However, it was not an easy matter to get them to safely merge in one’s body. Every flame discriminated against each other. It was the case for the Heavenly Flames and was also the case for beast flames. If one was careless when merging the three types of beast flames, one would end up suffering a serious injury.</p><br/><p>Moreover, even if one safely merged the three types of beast flames in one’s body, refining them was also a bitter task. The requirement for one’s Spiritual Strength was harsh. After all, the refinement of the Flame Creation Skill was quite special. It required one to force threads of one’s Dou Qi into the flame during the refinement. Such penetration would require one to constantly pay attention to any slight changes within the flame. If one’s Spiritual Strength was weak, it would not be possible to perform this task.</p><br/><p>The final step of merging the three flames, once they had been refined, together was also a dangerous task. If anything became amiss during the process, the merger would end up failing, and the explosion of the flame within one’s body would end up leading one to lose more than one would have gained.</p><br/><p>Due to the reasons above, there was enough evidence to prove that the difficulty of practicing this Flame Creation Skill was many times harder than practicing the original version of it.</p><br/><p>After understanding its difficulty, even Xiao Yan ended up feeling somewhat speechless. That Old Demon Ground Ghost was indeed worthy of being a seven star Dou Zong. He was able to improve the Flame Creation Skill using this method. Regardless of how one put it, the ‘Life Transforming Flame,’ that the current Flame Creation Skill makes, no longer hurt the life force within one’s body. Hence, the Flame Creation Skill had abandoned its bad reputation of self harm.</p><br/><p>Xiao Yan’s Spiritual Strength was slowly withdrawn from the scroll. He exhaled a long breath and mused for a moment. With a wave of his hand, three jade bottles appeared. There were three clusters of fierce burning flames within the jade bottle. They were blue, brown, and red in color. These three clusters of flames were naturally the three types of beast flames that Xiao Yan had obtained from the auction house. These three beast flames were meant to be used to practice the Flame Creation Skill…</p><br/><p>“The first step is to merge the three types of beast flames into my body…”</p><br/><p>Xiao Yan’s eyes looked at the burning flames within the jade bottles. With a flick of his finger, the jade bottles burst apart. Immediately, the three clusters of flame were released.</p><br/><p>Xiao Yan glanced at the three clusters of burning flame and let out a cold laugh. Other people might be a little afraid of merging them into their bodies, but the current Xiao Yan could be called a fire-playing specialist. There were three types of ‘Heavenly Flames’ within his body, and the might of these beast flames was far inferior to the ‘Heavenly Flames.’</p><br/><p>Xiao Yan opened his mouth and a suction force surged out. He sucked the three beast flames into his mouth and swallowed them.</p><br/><p>The three types of beast flames had just entered Xiao Yan’s body when the Glazed Lotus Heart Fame pounced on them, surrounding them before they could even unleash heat.</p><br/><p>The Heavenly Flames were the top of all flames. In front of it, these beast flames were just small fry. Even their fiercely rising fire seeds became a lot more sluggish.</p><br/><p>Xiao Yan smiled when he saw this. This process was really far too simple and was not a challenge to him. Even without the Glazed Lotus Heart Flame protecting the interior of his body, with this body of his that had experienced the refinement of many nature treasures like the Heaven Mountain Blood Pool and the Ancient Phoenix Essence Blood, he would barely be harmed even if these beast flames were to explode.</p><br/><p>A thought passed through Xiao Yan’s mind as these three types of beast flames become sluggish. Three bundles of powerful Dou Qi mixed with some jade green flame swiftly surged out. After which, they each wrapped around the individual clusters of beast flames.</p><br/><p>“The second step, refinement…”</p><br/><p>Xiao Yan muttered in his heart. Dou Qi immediately moved as he desired, transforming into three clusters of swiftly rotating Dou Qi. Following the rotation of the clusters of Dou Qi, the pressure within them greatly soared. Under this pressure, the three clusters of ‘Beast Flames’ began to alternate between light and dark tints.</p><br/><p>While the pressure strength was soaring, Xiao Yan’s Spiritual Strength also invaded into the flame. Immediately, the flame seed within the beast flames began to change. They were studied in detailed by Xiao Yan. Using this, Xiao Yan sensed the pressure within and determined if he ought to strengthen or weaken them. With his current Spiritual Strength, performing this task was an extremely simple matter. Everything smoothly progressed.</p><br/><p>All the steps began to progress quite smoothly under the monitoring of Xiao Yan’s outstanding Spiritual Strength. The merger and refinement began without any accident. Of course, this kind of refinement was not something that could be completed within a short period of time. It required a long period of continuous improvement in order to completely purify the three types of beast flames.</p><br/><p>Xiao Yan understood this point. Hence, all his attention was placed on this refinement after having entered his training state. He had an abundant amount of Spiritual Strength, and he did not need to worry about exhaustion…</p><br/><p>The time within the space tunnel swiftly passed while Xiao Yan was deeply engrossed in the refinement. During this period of time, Lin Yan could tell that Xiao Yan was training, so he did not disturb him. This allowed Xiao Yan to perform the beast flame purification without any other concerns…</p><br/><p>.....</p><br/><p>One day after another passed in this monotonous wormhole. However, Xiao Yan remained in his training state. He did not show any signs of waking. Seeing this, Lin Yan also did not dare to interrupt him, afraid he might accidentally cause something to go wrong with Xiao Yan…</p><br/><p>Time flew by and twenty days passed in the blink of an eye.</p><br/><p>Lin Yan had controlled the space boat throughout the twenty days. It was fortunate that he was currently an expert Dou Huang and that the space boat did not exhaust a great amount of Dou Qi. Hence, Lin Yan was able to endure. On the other hand, Xiao Yan appeared like a meditating old monk during these twenty days as he sat within the cabin. If Lin Yan could not sense the life force within Xiao Yan’s body, it was likely that even he would have thought that something had happened to Xiao Yan during his training.</p><br/><p>“Ugh, this fellow… just what is he practicing. He has remained in his training condition for a long time…” Lin Yan sat at the front of the boat. His hand poured a wave of Dou Qi into the space boat in a habitual fashion. After which, he looked at Xiao Yan in the cabin, shook his head helplessly, and muttered to himself.</p><br/><p>While Lin Yan was muttering to himself, Xiao Yan’s body, which had not moved even a little during the twenty days, slightly trembled. His tightly shut eyes were slowly opened.</p><br/><p>Joy surged up Lin Yan’s face when he saw Xiao Yan suddenly open his eyes. After which, he heaved a sigh of relief, but did not say anything to interrupt Xiao Yan.</p><br/><p>Xiao Yan, who had opened his eyes, let out a long breath. Joy also flashed within his eyes. His palm was opened and three insignificant thumb-sized flames quietly appeared. After which, they flew around his finger like spirits. A faint heat was vaguely emitted. After Xiao Yan’s twenty days of tireless training, the three types of beast flames were undoubtedly many times stronger than before.</p><br/><p>“I have finally completed the refinement…”</p><br/><p>Xiao Yan heaved a sigh of relief within his heart as he studied these three tiny beast flames. If not for his outstanding Spiritual Strength, it was likely that he would not have been able to endure this prolonged refinement. If another person attempted this, it was likely that one would have difficulty refining these three beast flames to such an extent without half a year’s time. After all, they did not possess a ‘Heavenly Flame’ to suppress them…</p><br/><p>“Next, will be the final merging step. If I am able to successfully merge and form a fire seed, I will have successfully mastered this Flame Creation Skill. As long as I find more beast flames to feed it in the future, it will sooner or later grow into the ‘Life Transforming Flame,’ needed to use the Extermination Fire Lotus…”</p><br/><p>Xiao Yan softly muttered to himself. There was a solemness on his face while he spoke.</p><br/><p>After all, this final merging step was the most difficult and dangerous step of this Flame Creation Skill!</p><br/>\n</div>"}