{"title": "Chapter 1040: Fire Seed", "id": 1040, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1040-fire-seed", "volume_title": "Volume 11", "body": "<h1>Chapter 1040: Fire Seed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1040: Fire Seed</u></strong></p><br/><p>Xiao Yan’s eyes were focused on the three wisps of flames on his fingers. A moment later, he raised his head and smiled apologetically to Lin Yan at the front of the boat. He said, “It is likely that you will need to control the space boat during the remaining journey. This Dou Skill that I am practicing still lacks the final step.”</p><br/><p>Lin Yan grinned and nodded when he heard this. He said, “This is a small matter. You can just relax and train as long as no unexpected circumstances occur. Additionally, there should be another ten days or so until the end of the wormhole. You must wake up before we leave. There will be some bumps when leaving the wormhole, and they might end up disturbing you.”</p><br/><p>Xiao Yan slightly smiled. His eyes returned to the three small wisps of flame. His expression gradually became solemn. His success in practicing the Flame Creation Skill would determine whether he could continue using that Extermination Fire Lotus of his. That was Xiao Yan’s killing move. It would be a great loss if he could no longer use it.</p><br/><p>“Merge…”</p><br/><p>Xiao Yan gently exhaled a breath and once again slowly shut his eyes. The three wisps of beast flames on his finger emitted a ‘sou’ sound and entered his body…</p><br/><p>Xiao Yan’s mind sank into his body. Three tiny wisps of beast flames swam in all directions within a cluster of jade-green flames. However, when they arrived a certain distance from the jade-green flame, they would withdraw in shock. In front of a ‘Heavenly Flame,’ an ordinary beast flame resembled subjects seeing an emperor. They would feel extremely afraid.</p><br/><p>Xiao Yan’s mind focused on these three wisps of beast flames he had refined after twenty days of tireless effort. A moment later, he finally made up his mind. An order was emitted from his heart.</p><br/><p>Following the release of this order, an invisible strength immediately rushed out and firmly grabbed these three wisps of beast flames. After which, he collided them together in a violent manner!</p><br/><p>“Bang!”</p><br/><p>The three types of beast flames collided with each other and a great repulsion force immediately erupted. A three-colored fire wave spread apart. However, reaction was slowly suppressed by the Glazed Lotus Heart Flame, that completely surrounded the beast flames, when the wave made contact with it.</p><br/><p>Xiao Yan was unconcerned that the flames had erupted. A thought passed through his heart, and an enormous might forcefully merged the three wisps of beast flames together!</p><br/><p>The three types of beast flames were forcefully pressed together. Their resistance soared, and the originally calm surfaces of the flames appeared to be boiling. Tiny air bubbles repeatedly rose from within the flames, as though it was about to explode.</p><br/><p>The change of the flame did not cause Xiao Yan’s expression to change. When he attempted to create the Angry Buddha Lotus Flam back then, was really considered soul-stirring. Any slight mistake would have caused him to perish in the Heavenly Flames. Compared to the scene back then, the three types of beast flames was really a simple matter.</p><br/><p>Although it was a simple matter, it was the step one needed to undertake in order to practice the Flame Creation Skill. Hence, Xiao Yan naturally needed to put forth all his effort.</p><br/><p>However, with the experience of merging the Heavenly Flames from back then, Xiao Yan did not appear extremely busy during the merger this time around. His Spiritual Strength invaded the flame that was being merged with lightning-like speed.</p><br/><p>The moment the Spiritual Strength invaded the fire, Xiao Yan sensed the wild violence that was spreading within it. It was just like a volcano that was about to erupt. Three types of flames resisted each other. Each time the flames collided, the violence within each flame would grow a little more. If this continued, an eruption would occur sooner or later.</p><br/><p>Xiao Yan’s heart gradually become solemn as he sensed the premonition of a volcano erupting within the flame. A thought passed through his mind, and the jade-green flame, that was surrounding, was reduced in size. Following this shrinkage, the pressure within the jade-green flame suddenly soared!</p><br/><p>Following the swift expansion of the pressure, the wild violence within the flame grew many times. At a glance, it appeared to be about to erupt. However, Xiao Yan did not show any indication of weakening his grip…</p><br/><p>“Bang!”</p><br/><p>The pressure became terrifying, and the flame, that was forcefully being merged together, could no longer endure it. A muffled sound appeared as it suddenly exploded like an erupting volcano!</p><br/><p>With the explosion of the flame, a powerful fire ripple spread in all directions. After which, it collided with the surrounding Glazed Lotus Heart Flame. The wild and violent force caused the Glazed Lotus Heart Flame to fluctuate…</p><br/><p>The wild, violent force completely poured against the Glazed Lotus Heart Flame. However, it was fortunate that Xiao Yan had already been prepared. Hence, the Glazed Lotus Heart Flame was not scattered by the force. Otherwise, even with the strength of Xiao Yan’s body, he would suffer a little if he received such a blow.</p><br/><p>Although the force from the exploding flame was suppressed, it seemed that this merger did not appear to be very successfully.</p><br/><p>The three wisps of flames within the jade-green flame had scattered. Three extremely tiny flame seeds were drifting within. These three flame seeds were extremely small. Their flickering manner appeared as though they would be extinguished by just breathing near it.</p><br/><p>During the explosion, the three wisps of flames seemed to have lost the wild violence hidden within them. They drifted about like a candle’s light…</p><br/><p>Xiao Yan’s heart sighed in relief as he looked at the three wisps of fire seedlings, which could be extinguished with just a breath. Immediately, he emitted a soft laugh. A thought passed through his heart, and the three wisps of fire seeds fluttered before making contact with each other…</p><br/><p>The contact this time around did not result in the intense reaction like earlier. Under the hidden control of Xiao Yan’s Spiritual Strength, the three wisps of fire seeds quietly blended together. After which, the three wisp of fire began to show signs of merging under the ingenious suppression Xiao Yan had created around them!</p><br/><p>The signs were extremely faint. However, they were still detected by Xiao Yan’s Spiritual Strength. Immediately, a joy surged within his heart. He steadied his mind and maintained the special pressure as he slowly and gradually merged these three wisps of flame seeds…</p><br/><p>This kind of merger was not something that could be accomplished from just a day’s effort. This was a subtle job that required a long period of stable pressure. Therefore, one needed to use one’s Spiritual Strength to control any slight changes within the flame. However, with Xiao Yan’s strength, he was able to complete most of these steps perfectly. All that he needed to do was wait for time to pass…</p><br/><p>......</p><br/><p>One day after another passed while Xiao Yan focused on merging these three types of beast flames. In the blink of an eye, nearly nine days passed. After nearly twenty nine days of traveling, the space boat was approaching the end of the wormhole…</p><br/><p>Lin Yan sat cross-legged at the front of the boat. He habitually poured a wave of Dou Qi into the boat before rubbing his forehead. There was a tired expression on his face. The one month of control might not be exhausting for his Dou Qi, but it did consume a great deal of his attention.</p><br/><p>“We will be able to leave the wormhole after another day. Is this fellow not done yet?” Lin Yan looked at Xiao Yan, who was in the cabin of the boat. After which, he looked at the other space boats that appeared exceptionally excited because they were about to arrive at their destination. He involuntarily let out a bitter laugh. It seemed that he had become a boatsman for Xiao Yan for a month…</p><br/><p>“There will be an intense space ripple when leaving the wormhole. Xiao Yan will definitely be disturbed by it at that time. If such a situation ends up causing the Dou Qi in his body to wildly move, it will not be a mere simple matter…” Lin Yan mused for a moment before softly sighing, “Forget it, if he doesn’t wake up before we leave the wormhole, I can only forcefully wake him up…”</p><br/><p>Lin Yan hurriedly braced his attention after making up his mind. He controlled the space boat and maintained a stable speed. The boat transformed into a ray of light that rushed toward the end of the wormhole…</p><br/><p>A day’s time was not considered long. During this period of time, Xiao Yan still did not show any signs of waking up. This caused Lin Yan's face to involuntarily reveal some anxiety. He could clearly sense the spatial strength in this place becoming denser. They were getting closer to the wormhole’s exit.</p><br/><p>Lin Yan slightly raised his eyes. He could vaguely see a silverish, circular light ring. Lin Yan turned his head and looked at Xiao Yan at the cabin. Finally, he clenched his teeth, stood up, and strode toward Xiao Yan.</p><br/><p>Lin Yan’s hand swiftly swung toward Xiao Yan’s shoulder after entering the cabin. However, before his hand landed on Xiao Yan’s shoulder, a jade-green flame surged out of Xiao Yan’s body in a lightning-like fashion, shooting at Lin Yan!</p><br/><p>Lin Yan’s expression changed when he saw this. He could sense the frightening energy contained within the jade-green flame. He maneuvered his body, and the ugly agility technique was quickly displayed. He dodged the jade-green flame with it.</p><br/><p>Before Lin Yan could sigh in relief after having dodged the flame, a hot wind suddenly pounced over from behind him. He turned his head in fear and saw that a jade-green flame was swiftly magnifying in his eyes.</p><br/><p>Even with the help of Lin Yan’s unusual ability skill, he would have difficulty dodging it from such a close distance. Hence, he only watched as the flame rushed toward his body.</p><br/><p>“Stop!”</p><br/><p>Fortunately, a soft cry suddenly sounded within the cabin just as the jade-green flame was about to crash into Lin Yan’s body. The flame immediately paused in an extremely obedient manner. However, its hot temperature caused a searing pain to rise on Lin Yan’s back. He hurriedly leaped aside as a result.</p><br/><p>Lin Yan felt a lingering fear in his heart as he stared at the jade-green flame after having leaped to one side. Only then did Lin Yan turn his eyes to Xiao Yan, who had opened his eyes at some point. He let out a bitter laugh, “You have finally woken up.”</p><br/><p>Xiao Yan smiled and nodded at Lin Yan. He extended his hand and pulled the jade green flame into his body. After which, he rubbed his fingers gently, and a wisp of a pale-white bone-like fire seed quietly rose with a ‘chi’ sound…</p><br/><p>This wisp of a pale-white-colored flame was the result of the successful merger of the three types of beast flames. It was also the seed of a new generation of ‘Life Transforming Flame!’ In the future, Xiao Yan would have to rely on this little thing to use the Extermination Fire Lotus…</p><br/><p>Xiao Yan returned the pale-white fire seedling to his body with satisfied eyes. Only then did he stand up and walk out of the cabin. His eyes landed on the enormous silver-colored ring a short distance away. He involuntarily grinned.</p><br/><p>“Pill Region, Three Thousand Burning Flame. I have arrived…”</p><br/>\n</div>"}