{"title": "Chapter 1045: Heading to the Burning Flame Valley", "id": 1045, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1045-heading-to-the-burning-flame-valley", "volume_title": "Volume 11", "body": "<h1>Chapter 1045: Heading to the Burning Flame Valley</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1045: Heading to the Burning Flame Valley</u></strong></p><br/><p>Cheng Yao’s expression had turned quite ugly when he heard Elder Chi Huo’s words. However, due to the other party’s status, he could only clench his fists tightly regardless of how dissatisfied he was. He viciously glanced at Liu Qing. His eyes were filled with fury.</p><br/><p>Although Cheng Yao knew that the situation had turned around because of Xiao Yan’s appearance, he really had difficulty forming hatred toward a tier 7 alchemist. This was because he clearly understood just how great of an ability a tier 7 alchemist possessed…</p><br/><p>Compared to Cheng Yao’s ugly expression, Liu Qing’s face was covered in a joyous one. He cupped his hands toward Elder Chi Huo as he smiled and said, “Thank you very much, Elder Chi Huo.”</p><br/><p>Elder Chi Huo smiled and waved his hand. His eyes landed on Xiao Yan beside Liu Qing. He quickly stepped forward, cupped his hands, and smiled as he said with great politeness, “Ke ke, may I inquire about young friend’s name.”</p><br/><p>“Yan Xiao.” Xiao Yan smiled and cupped his hands toward Elder Chi Huo.</p><br/><p>“Young friend Yan Xiao already possesses such an achievement at his age. This is really unbelievable. May I know which great person is young friend’s teacher?” Elder Chi Huo laughed. Regardless of how outstanding Xiao Yan’s talent was, it was unlikely for him to reach such a stage if there was no one to guide him.</p><br/><p>“He is merely a mountain hermit and cannot be considered a great person.” Xiao Yan laughed and pushed this question aside without making it obvious.</p><br/><p>Seeing that Xiao Yan did not wish to speak more about this topic, Elder Chi Huo hurriedly shut his mouth. He might be an Elder of the Burning Flame Valley, but he was just an expert Dou Zong. He still maintained a courteous tone to a tier 7 alchemist.</p><br/><p>“Ha ha, Liu Qing, the Wormhole of the Tianhuang city shall be managed by your Liu clan during the three years from today on. All you need to do is deliver the tribute to the Burning Flame Valley on time every year.” Elder Chi Huo’s eyes slide to Liu Qing as he spoke with a friendly smile.</p><br/><p>The Wormhole provided a healthy income. The Liu clan might be able to obtain the management rights, but they would have to pay a portion of it as tribute to the Burning Flame Valley. This had been the rule over the years.</p><br/><p>Liu Qing smiled and nodded. He was naturally aware that the reason Elder Chi Huo was being this courteous to him was due to Xiao Yan.</p><br/><p>“There is already a result as to who will manage the Wormhole. Ke ke, young friend Yan Xiao, may I know if you have the time to accompany the old me to the Burning Flame Valley?” Elder Chi Huo rubbed his hands and smiled as he asked Xiao Yan a question. His mission was to find a high tier alchemist. Now that Xiao Yan had beaten Zeng Xiu half to death, he would end up with a tragedy if Xiao Yan did not follow him to the Burning Flame Valley.</p><br/><p>Xiao Yan mused for a moment when he heard this. He was quite interested in the Burning Flame Valley. Of course, his interest originated from the Skyfire Three Mysterious Change and the so-called Nine Dragon Lightning Flame. Although Xiao Yan had more or less put aside his thoughts about the flame, he would be able to gain a greater understanding of Heavenly Flames if he could see it.</p><br/><p>“May I know why the Burning Flame Valley is searching for high tier alchemist?” Xiao Yan finally asked after momentarily thinking.</p><br/><p>“Ke ke, my Valley Chief wants to refine a high tier medicinal pill and requires the cooperation of some high tier alchemists. Young friend Yan Xiao, please be reassured that this matter will not be difficult. The Burning Flame Valley will reward you greatly once you succeed.” Elder Chi Huo hurried said.</p><br/><p>“Refining a medicinal pill?” Xiao Yan narrowed his eyes. The strength of the Valley Chief of the Burning Flame Valley was likely not weaker than Feng zun-zhe. A medicinal pill that he required was likely a tier 7 one. It was not easy to refine a medicinal pill of this tier.</p><br/><p>“The Valley Chief of the Burning Flame Valley is also an alchemist?” Xiao Yan suddenly thought of something and asked with some surprise. Most of the time, a pill refinement relied on one’s own strength. How could the help of outsiders have any effect?</p><br/><p>Elder Chi Huo looked at Xiao Yan with surprise when he heard this.</p><br/><p>“The Valley Chief of the Burning Flame Valley is not an alchemist. Although he is extremely interested in alchemist, he is unable to become one due to him not meeting all the requirements. However, he is also a person with outstanding ability. With his ability to control flames, he is able to control a Heavenly Flame to refine some medicinal pills. However the tier of these pills is not very high. If he wants to refine a high tier medicinal pill, he will need other alchemists to aid him…” Liu Qing by the side approached Xiao Yan and softly explained.</p><br/><p>Xiao Yan was involuntarily startled when he heard these words. He immediately clicked his tongue. Someone who was not an alchemist was able to refine medicinal pills? This Valley Chief of the Burning Flame Valley was really extraordinary. This was the first time that Xiao Yan had heard of such a thing during all these years. However, Xiao Yan also understood that it was something that relied on the Heavenly Flame and the control one had over the flame. Without the exquisite Spiritual Strength of a true alchemist that could see through everything within a medicinal pill, the medicinal pills that were refined would usually possess tiny flaws.</p><br/><p>“It is likely the Heavenly Flame the Valley Chief of the Burning Flame Valley relies on is the Nine Dragon Lightning Flame… currently there is still a period of time until the Pill Gathering is conducted. Perhaps I can take this opportunity to head to the Burning Flame Valley to obtain the remaining two changes of the Skyfire Three Mysterious Change…” Xiao Yan muttered in his heart. The Skyfire Three Mysterious Change was very important to him. If he complete this Secret Technique, it was likely that his fighting strength would soar. Should he meet an expert like Fei Tian in the future, he would be able to fight him head-on. The interior of the Pill Region was filled with experts. This would be even more true during the Pill Gathering. Hence, Xiao Yan needed to try his best to raise his strength!</p><br/><p>“Since I have already intervened, I will naturally not withdraw.”</p><br/><p>Xiao Yan made up his mind in his heart before speaking to Elder Chi Huo with a smile.</p><br/><p>Elder Chi Huo sighed in relief when he heard this. The smile on his old face had also increased. With a wave of his hand, an enormous bird that was covered in flames flew over from outside of the open ground. He cupped his hands toward Xiao Yan as he smiled and said, “In that case, the old me shall wait for young friend above.”</p><br/><p>Elder Chi Huo’s body rose up and immediately landed on the back of the enormous bird after his voice sounded.</p><br/><p>“Xiao Yan, do you really plan to head to the Burning Flame Valley?” Lin Yan by the side hurriedly asked when he saw Elder Chi Huo leap onto the back of the enormous bird. He was aware that Xiao Yan possessed the Skyfire Three Mysterious Change. If this was discovered by the Burning Flame Valley, it would likely result in some trouble.</p><br/><p>Xiao Yan nodded. One could not gain anything if one did not take risks. Moreover, the Burning Flame Valley is the one who needed his help this time around. As long as he was clever, it should not be too difficult for him to obtain the completed version of the Skyfire Three Mysterious Change.</p><br/><p>“Ke ke, I heard that quite a number of alchemists have been invited to the Burning Flame Valley this time around. All of them possess some skills. If they can successfully help the Valley Chief of the Burning Flame Valley refine the medicinal pill, I’m sure that the reward will be extremely great. With the reputation of the Burning Flame Valley, they would not mistreat anyone.” Liu Qing smiled as he gave his input. He had a good understanding of the Burning Flame Valley.</p><br/><p>Xiao Yan smiled. He was unconcerned about what kind of reward there was. It would be enough if he could obtain the completed version of the Skyfire Three Mysterious Change.</p><br/><p>“Lin Yan, you should stay in Tianhuang City during this period of time. I will return once I am done. Additionally, Liu Qing, there is something that I need to trouble you with.” Xiao Yan mused for a moment before speaking.</p><br/><p>“You can tell me if there is anything. I will not even frown as long as I can do it.” Liu Qing patted his chest and spoke in an unrestrained manner.</p><br/><p>“Help me investigate any information related to a lady called the Little Fairy Doctor in the Middle Region during this period of time.” Xiao Yan slowly said. “Additionally, help me investigate a clan. There is a girl called Xin Lan in it.”</p><br/><p>Xiao Yan did not know how the Little Fairy Doctor was doing after being apart for such a long time. Hence, Xiao Yan needed to obtain some news as soon as possible. The Liu clan had been in the Middle Region for a long time, it was likely that their ability to gather information was better than his. As for Xin Lan, Xiao Yan ultimately did not know just which clan she belonged to. Since he had made her a promise, Xiao Yan would naturally not hide on purpose.</p><br/><p>“The Little Fairy Doctor?” Liu Qing fondled his chin and nodded. He said, “I have never heard of this name. However, I will send someone to the Pill Region to investigate. As for that girl called Xin Lan, it will be a little difficult to investigate… from the way I see it, this should not be her surname. There are a countless number of various-sized clans in the Middle Region. Attempting to find her clan is no different than finding a needle in a haystack.”</p><br/><p>“Her clan seems to have once entered the Pill Tower Elders seat. However, their name should have been removed by now.” Xiao Yan said.</p><br/><p>“Oh?” Liu Qing’s expression changed a little when he heard this. The clans that could enter the Pill Tower’s Elders seats were no ordinary factions. Even if its name had been removed, its strength would definitely be something that their Liu clan would not be able to compare with.</p><br/><p>“Now the scope of the search has been greatly reduced. Alright, leave this matter to me. I will settle this matter by the time you return.” Liu Qing mused for a moment before replying with a grin.</p><br/><p>Xiao Yan nodded. He would save himself the trouble of randomly roaming around like a headless housefly.</p><br/><p>Xiao Yan chatted with the other two after giving appropriate instructions. When the fiery-red, enormous bird in the sky emitted a sharp cry, Xiao Yan finally cupped his hands to Liu Qing and Lin Yan. His toes pressed on the ground as his body leaped into the sky.</p><br/><p>Lin Yan hurriedly spoke when he saw Xiao Yan move, “Be careful.”</p><br/><p>Xiao Yan smiled and nodded to Lin Yan. His body immediately moved and he steadily landed on the back of the enormous bird.</p><br/><p>“Ha ha, is young friend Yan Xiao ready?” Elder Chi Huo hurriedly spoke with a smile when he saw Xiao Yan come up.</p><br/><p>Xiao Yan slightly smiled. He cupped his hands to Elder Chi Huo and said, “Elder Chi Huo, please lead the way.”</p><br/><p>Elder Chi Huo grinned, gave polite reply, and waved his hand. The enormous bird under his feet let out a sharp cry. It flapped its enormous wings as it swiftly flew toward the northern sky in front of many envious gazes while bringing about a hot, wild wind.</p><br/>\n</div>"}