{"title": "Chapter 1049: Reward", "id": 1049, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1049-reward", "volume_title": "Volume 11", "body": "<h1>Chapter 1049: Reward</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1049: Reward</u></strong></p><br/><p>Tang Zhen was startled when he saw all the gazes in the hall gathering on Xiao Yan’s body. He hesitated for a moment before opening his mouth to ask, “This young friend Yan Xiao, would you like to give it a try?”</p><br/><p>Tang Zhen was naturally aware that quite a number of people present were adopting the mentality of wanting to watch a good show. However, from the way he saw it, since Xiao Yan dared to come to this Burning Flame Valley, he should also possess some ability. After all, he was quite assure of Elder Chi Huo’s abilities.</p><br/><p>The red-clothed lady beside Tang Zhen crossed her hands over her chest. Her pretty eyes were looking at Xiao Yan with interest. She also wanted to know whether this young man, who was praised by Tang Zhen earlier, had some ability or if he was merely a country bumpkin.</p><br/><p>“Since I have come to the Burning Flame Valley, I will naturally have to give this test a try.”</p><br/><p>Xiao Yan slightly smiled in front of many eyes and slowly nodded.</p><br/><p>Some alchemist grandmasters in the hall involuntarily revealed ridicule on their faces when they heard this. Even they were unable to endure for long against the Nine Dragon Lightning Flame, much less such a young fellow.</p><br/><p>“Since young friend Xiao Yan is interested, please give it a try. If you are able to pass, you and Grandmaster Huan will fill up the two spots.”</p><br/><p>Tang Zhen raised his hand as he spoke. At the same time, he smiled, feeling a little surprised by Xiao Yan’s boldness.</p><br/><p>Xiao Yan slowly stood up. He looked at the silver flame suspended in the air of the large hall. Immediately, he clenched his hand, and a cluster of jade-green flames curled up and rose on it.</p><br/><p>Xiao Yan’s current control of the Glazed Lotus Heart Flame had reached the extent where he could manipulate it at will. Putting it bluntly, other than the most unfathomable Tang Zhen, if anyone seated here were to compete with him in terms of flame control, none of them would be able to compare with him. This included the two External Elders of the Pill Tower.</p><br/><p>The appearance of the jade-green flame caused some people in the large hall to knit their eyebrows. Under Xiao Yan’s suppression, they were unable to sense even a little of the temperature that spread from the flame.</p><br/><p>“Such a low temperature flame is likely inferior to even that of some flames that are formed from Dou Qi, right?”</p><br/><p>Although the alchemist seated in this place were all haughty, they were not fools. Naturally, they were aware that it was impossible for this temperature to be the true temperature of this flame. However, all of them could not understand why Xiao Yan had suppressed the flame.</p><br/><p>Tang Zhen on the leader’s seat frowned without anyone noticing. His eyes stared firmly at the flame. He could vaguely sense that this jade-green flame was not that simple…</p><br/><p>Xiao Yan was unconcerned about the surrounding eyes. A thought passed through his mind as his Spiritual Strength entered the flame. The flame wiggled, transforming into a palm-sized exquisite jade-green fire lotus.</p><br/><p>The flame slowly rotated. It was completely jade-green in color, appearing just like top quality jade. Its flawless manner was just like an artistic work that gave one the feeling of being unwilling to part with it.</p><br/><p>Xiao Yan flicked his finger gently, and the fire lotus slowly rotated as it approached the cluster of silver-colored flames in the air. After which, it quietly merged into it in front of everyone’s anxious eyes…</p><br/><p>The nine fire dragons immediately sensed something when the jade-green fire lotus entered the cluster of silver flames. They carried a deep dragon roar as they swiftly pounced over!</p><br/><p>A cold smile surfaced on the faces of the few alchemist grandmasters when they saw this scene. The ridicule in their eyes became even denser. That manner was as though they had foreseen the miserable situation that would occur a moment later.</p><br/><p>However, the scene they anticipated did not appear as they had imagined. The cold smiles had just climbed up their faces when they suddenly stiffened. Immediately, the eyes of everyone in the large hall protruded out!</p><br/><p>The nine fire dragons carried a fierce momentum as they ruthlessly surrounded the fire lotus within the interior of the silver-colored flame. However, they instantly became sluggish. A moment later, everyone saw a scene that caused them to be stunned. The nine fire dragons, which were still acting in a mighty and majestic manner, appeared to have seen a frightening thing at this moment. All of them fled in a lightning-like manner.</p><br/><p>After the nine fire dragons fled far away, they once again slowly swam closer. However, they only dared to linger around the fire lotus. They wandered around continuously, but did not dare to pounce forward and bite the fire lotus like they had during previous occasions.</p><br/><p>This scene caused others to feel a disbelief and caused the entire large hall to descend into a strange silence. Those alchemist grandmasters who were waiting to watch a show displayed exceptionally comical expressions on their faces when they looked at the separate fire lotus and fire dragons within the flames.</p><br/><p>Tang Zhen’s expression had also become a lot more solemn at this moment. There were not many flames in this world that could cause the Nine Dragon Lightning Flame to be this afraid. Moreover, he was certain at this moment that the jade-green flame Xiao Yan had summoned was definitely a kind of Heavenly Flame!</p><br/><p>“The flame is jade-green in color. However, there doesn’t seem to be any Heavenly Flame on the Heavenly Flame Ranking that possesses such a luster. The only one similar to the color is the Green Lotus Core Flame that is ranked nineteenth, but its luster is not so dense. Moreover, even if it is the Green Lotus Core Flame, it would not be able to cause the Nine Dragon Lightning Flame to be this afraid. This young man doesn’t appear to be a simple person…” Tang Zhen muttered softly in his heart. He had never thought that this young person in front of him would also possess a Heavenly Flame…</p><br/><p>The red-clothed lady beside Tang Zhen also gained an unusual glint in her pretty eyes because of this scene. This man, who appeared quite young, was indeed not a country bumpkin. However, she did not know just what her chances were if she fought with him. The hands of the red-clothed lady involuntarily felt somewhat itchy when she thought of this. If their current location was not inappropriate, it was likely that she would have headed down and issued a challenge to Xiao Yan. It was not the first time that she had done such a thing. Even Tang Zhen felt helpless that she was so competitive despite being a girl.</p><br/><p>Shock also surged in the eyes of the two External Elders from the Pill Tower within the large hall at this moment. With their experience, they were naturally able to vaguely guess just what the jade-green flame was.</p><br/><p>“How unexpected… this person, who looks so young, actually possesses a Heavenly Flame. I wonder just how many alchemists will be interested if this news spreads…”</p><br/><p>When they thought of this, the eyes of those two swept over the large hall without being noticed. They did indeed see a greedy expression surging into the eyes of some people. Those seated in this place possessed some reputation in the Middle Region, yet even they end up feeling avarice. From this, it was possible to see just how much allure a Heavenly Flame possessed to an alchemist.</p><br/><p>Ten minutes swiftly flowed by in the silent, large hall. Xiao Yan beckoned with his hand when the ten minutes had just ended. The fire lotus rushed out of the flame without experiencing any loss. Finally, it emitted a boom and blasted apart, turning into a cluster of flames that entered Xiao Yan’s hand.</p><br/><p>“Valley Chief Tang, may I know if I have passed?”</p><br/><p>Xiao Yan withdrew his flame, kept his gaze focused on Tang Zhen, and smiled as he asked with his hands cupped together.</p><br/><p>“Ke ke, do you still need the old me to voice the result? Congratulations, young friend Yan Xiao. Including you, the old me has truly gathered two people.” Tang Zhen’s hand fondled his beard as he laughed out loud. His eyes immediately slid to Elder Chi Huo as he said, “Chi Huo, you have handled your task in a manner that is as satisfactory as it always is. You were able to find a young and outstanding person like young friend Yan Xiao.”</p><br/><p>Elder Chi Huo’s face revealed a smile when he heard this. He respectfully said, “I was merely lucky. Being able to meet young friend Yan Xiao can be considered my luck.”</p><br/><p>Some alchemist grandmasters’ faces in the large hall became somewhat unnatural when they heard Tang Zhen’s words. This was especially the case for Grandmaster Mo who had ridiculed Xiao Yan earlier. His expression looked as though he had just swallowed a housefly. This scene was something that he had never expected. Moreover, he simply could not understand just how Xiao Yan came to possess a Heavenly Flame at such an age?</p><br/><p>“He’s only relying on the help of the Heavenly Flame. There’s nothing great about it…”</p><br/><p>Grandmaster Mo’s lips slightly twitched as he continued to stubbornly laugh in a cold manner.</p><br/><p>Xiao Yan really did not like this old fellow who spoke words that really caused others to despise him. After glancing at him, Xiao Yan shifted his eyes away and completely ignored him.</p><br/><p>Tang Zhen also grinned. With his eyesight, he was naturally able to tell that this young man called Yan Xiao definitely possessed some skill. His alchemist skill might well be at a level that hardly anyone here could compare with.</p><br/><p>“Everyone, please rest assured. I will invite everyone to watch when the medicinal pill refinement is in progress…”</p><br/><p>The cold smile on Grandmaster Mo’s face grew denser upon hearing Tang Zhen’s words. His eyes turned to Xiao Yan as he faintly said, “Although you possess a Heavenly Flame, you will only end up ruining things if you lack ability. If you were to destroy the precious medicinal ingredients of Valley Chief Tang, it is likely that you will not be able to compensate him.”</p><br/><p>“Thank you for your reminder. This Grandmaster Mo can just watch from the side. Just leave the matter of aiding Valley Chief Tang in refining a medicinal pill to Grandmaster Huan and me.” Xiao Yan Yan smiled as he replied.</p><br/><p>The hidden mockery in Xiao Yan’s words caused Grandmaster Mo to become dull. His face involuntarily twitched while the teacup he was holding shook. From the looks of it, he was greatly angered by these words of Xiao Yan.</p><br/><p>“Hee.”</p><br/><p>The red-clothed lady involuntarily let out a giggle when she saw Xiao Yan anger Grandmaster Mo to such an extent with just one sentence. However, she hurriedly shut her mouth when she saw Tang Zhen glare at her.</p><br/><p>“Ke ke, everyone, let’s not argue over this. The medicinal ingredients needed to refine the medicinal pill might be precious, but with the ability of my Burning Flame Valley, we are still able to gather all of them. Therefore, there is no need for any mental burden when aiding the old me in refining the medicinal pill.” Tang Zhen waved his hand as he softly laughed.</p><br/><p>“Additionally, the medicinal pill refinement this time around will not be a simple one. Hence, the old me shall state this clearly beforehand. As long as the two of you can aid me in successfully refining it, the reward will definitely be something that is to your satisfaction. Ke ke. Of course, you can just request if the two of you need anything.”</p><br/><p>Xiao Yan’s heart immediately pounded when he heard Tang Zhen’s words. He cupped his hands together and smiled as he asked, “May I know if this reward includes some Qi Methods or Dou Techniques of the Burning Flame Valley?”</p><br/><p>Tang Zhen was startled when he heard this. He looked at Xiao Yan while pondering the question. After which he laughed, “As long as it is not some secrets of the Burning Flame Valley that cannot be passed to others, everything else is included. May I know just what young friend Yan Xiao has set his sights on?”</p><br/><p>Xiao Yan’s heart pounded. His eyes bore down on Tang Zhen as he slowly uttered, “Skyfire Three Mysterious Change…”</p><br/>\n</div>"}