{"title": "Chapter 1051: Fire Bodhisattva Pill", "id": 1051, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1051-fire-bodhisattva-pill", "volume_title": "Volume 11", "body": "<h1>Chapter 1051: Fire Bodhisattva Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1051: Fire Bodhisattva Pill</u></strong></p><br/><p>Lush greenery covered the enormous valley. Occasionally, a fire-red maple tree could be found mixed in, making it extremely soothing to the eye.</p><br/><p>There was a spacious square that was built from crimson-colored mountain rocks in the middle of the valley. The middle of the square had a stone stage that was over a hundred feet tall. There were quite a number of human figures currently around this square. Most of the people were wearing red clothes. Clearly, they were the disciples of the Burning Flame Valley.</p><br/><p>There was a somewhat tall platform located on the other side of the square. Its height might not be comparable to the towering stage in the square, but it was coincidentally able to overlook the entire place. The view from that spot was extremely good. At this moment, quite a number of people were standing on this platform with their hands behind their backs. If one were to carefully examine them, they would see that they were those so-called alchemist grandmasters from the large hall earlier.</p><br/><p>The rushing sound of wind materialized amid the private conversations that were going on in the square. Immediately, four figures rushed over from the distance and gently landed on the stone stage. Their figures were revealed to be the Valley Chief of the Burning Flame Valley, Tang Zhen, the red-clothed lady called Huo Er, Xiao Yan, and the External Elder of the Pill Tower, Grandmaster Huan.</p><br/><p>The appearance of Tang Zhen caused the private conversations around the square to weaken. All the disciples of the Burning Flame Valley present knew that Tang Zhen was going to join hands with two alchemist grandmaster to refine a medicinal pill. Naturally, they did not dare to randomly make any noise, fearing that they would interrupt the refinement of the medicinal pill.</p><br/><p>Tang Zhen landed. His gaze slowly swept around him. After which, he turned his head and looked to Xiao Yan and Grandmaster Huan. He smiled as he asked, “Are the both of you prepared?”</p><br/><p>Xiao Yan and Grandmaster Huan nodded when they heard his question.</p><br/><p>“The medicinal pill that the old me wishes to refine this time around is called the Fire Bodhisattva Pill. It is a tier 7 high grade medicinal pill. This is a portion of the medicinal formula. The two of you will get one each. All you need to do is follow the instructions on the medicinal formula during the refinement and perform your allocated task.” Tang Zhen waved his hands and two scrolls flew to Xiao Yan and Grandmaster Huan respectively.</p><br/><p>The two of them hurriedly received the scroll. After which, they immediately inserted their Spiritual Strength into them, swiftly remembering the medicinal formula in their minds.</p><br/><p>After around ten minutes or so, Xiao Yan finally opened his closed eyes in a slow manner. The medicinal formula recorded in the scroll was incomplete. There was only a portion of it. It was likely that Tang Zhen did not wish to allow the two of them to learn the complete medicinal formula. However, Xiao Yan had no objections. A tier 7 medicinal pill formula was extremely rare. How was it possible to randomly give it to another person?</p><br/><p>“However, just a portion of the medicinal pill is already so complicated. I wonder just how complicated the full formula is. It is indeed worthy of being at the tier 7 high grade…” Although Xiao Yan had only seen a portion of the medicinal formula, he was able to vaguely tell the difficulty of refining this medicinal pill.</p><br/><p>“Have the both of you finished reading?” Tang Zhen smiled and inquired after seeing Xiao Yan and Grandmaster Huan open their eyes.</p><br/><p>The both of them nodded.</p><br/><p>“It is likely that refining this medicinal pill will require a long time. Therefore, both of you should be mentally prepared. Do not allow any accidents to occur midway through…” Tang Zhen’s expression was a little solemn when he spoke. He greatly valued this pill refinement. If it were to fail, it would result in quite a big blow to him.</p><br/><p>Xiao Yan and Grandmaster Huan were both experienced people. They were clearly aware of this point and did not make any objections.</p><br/><p>“The old me is not an alchemist and does not have as precise a control over my Spiritual Strength as the both of you. Hence, I will perform the refinement of the medicinal ingredients. However, the merger of the medicinal ingredients will depend on the both of you.” Tang Zhen pointed to two sides after speaking. There were two stone seats there. “If there is no problem, please take a seat.”</p><br/><p>Xiao Yan and Grandmaster Huan exchanged glances. They smiled and nodded to each other. After which, their bodies moved and they appeared on the stone seats. After which, the both of them sat down.</p><br/><p>Tang Zhen’s feet pressed on the ground after seeing that the two of them had taken their seats. His body appeared on a rock chair on another side. With a glance at the red-clothed lady beside him, he commanded in a deep voice, “Huo Er, do not allow anyone to interrupt us during this pill refinement period!”</p><br/><p>“Yes, father.”</p><br/><p>The red-clothed lady called Huo Er lowered her chin slightly. Her pretty eyes swept around and stole a glance at Xiao Yan. After which, she leaped down from the stone stage and began to organize the disciples of the Burning Flame Sect, tightening the defenses of this area.</p><br/><p>After arranging everything appropriately, Tang Zhen’s expression gradually turned solemn. He waved his sleeve and one could see an enormous item flying out of his Storage Ring. After which, it landed heavily in the middle of the stone stage. Its heavy weight caused the stone stage to tremble a little.</p><br/><p>Xiao Yan and Grandmaster Huan looked at this ten-foot-large medicinal cauldron. The medicinal cauldron was fiery-red in color. There were numerous drawings of volcanoes erupting on the walls of the medicinal cauldron. A wave of violent aura would pounce on one when one glanced at it.</p><br/><p>Xiao Yan had just taken a look at this fiery-red medicinal cauldron when he became aware that the quality of this medicinal cauldron was likely not poorer than his Ten Thousand Beast Cauldron.</p><br/><p>“Mountain Melting Cauldon. This is something on the ‘Heavenly Cauldron Ranking.’ It is unexpectedly held in Valley Chief Tang’s hands. How it leads one to feel envious.” Grandmaster Huan looked at this fiery-red cauldron. The envious look in his eyes was extremely dense.</p><br/><p>“I only found it through good luck back then.” Tang Zhen smiled. After which, he waved his sleeves once again. One could immediately see densely packed medicinal ingredients continuously flying out of his Storage Ring. After which, they lingered in the air above this stone stage. From the looks of it, there were at least a hundred of them.</p><br/><p>A dense medicinal fragrance spread the moment these medicinal ingredients appeared. Clearly, they were not ordinary items. The requirement many medicinal ingredients in order to refine this Fire Bodhisattva Pill did indeed live up to its reputation of being a tier 7 high grade medicinal pill.</p><br/><p>Tang Zhen’s expression became more and more solemn after these medicinal ingredients were summoned. He clenched his hand and a silver-colored flame surged. Nine fire dragons swam around within it, emitting a shocking dragon might.</p><br/><p>“Grandmaster Huan, consume this medicinal pill. It will allow the Nine Dragon Lightning Flame to feel a little more affinity with you. Thus, you will be able to endure for a longer time.” Tang Zhen tossed a silver-colored pill to Grandmaster Huan. He immediately glanced at Xiao Yan and smiled as he asked, “Young friend Yan Xiao, you don’t need this thing, do you?”</p><br/><p>Xiao Yan nodded. His soul was protected by the Glazed Lotus Heart Flame. This Nine Dragon Lightning Flame might also be a Heavenly Flame, but it was unable to do anything to him.</p><br/><p>Tang Zhen smiled when he saw Xiao Yan’s response. He flicked his finger and the silver-colored flame rushed out. It immediately entered the Mountain Melting Cauldron. With a ‘chi’ sound, it transformed into a fierce flame. The nine small fire dragons within it swiftly expanded. After which, the dragons opened and closed its mouth as they swam within the medicinal cauldron, spitting out numerous silver-colored flames.</p><br/><p>“Since everyone is ready, let’s… begin!”</p><br/><p>The smile on Tang Zhen’s face was withdrawn as he solemnly spoke while looking at the silver flames rising within the medicinal cauldron.</p><br/><p>A glaring glint shot out of both of Tang Zhen’s eyes the moment his voice sounded. Both of his hands grabbed at the empty space. The medicinal ingredients floating in the air immediately rushed down. After which, they were continuously thrown into the medicinal cauldron!</p><br/><p>These medicinal ingredients had just entered the medicinal cauldron when the nine fire dragons let out deep dragon roars and pounced over. Immediately, they swallowed them in one go. The fire glow on their bodies suddenly became dense.</p><br/><p>While Tang Zhen began to refine medicinal ingredients, Xiao Yan and Grandmaster Huan hurriedly focused their minds. Their Spiritual Strength surged from between their brows and swiftly entered the medicinal cauldron under the protection of their own flames...</p><br/><p>The two of them sensed the frightening temperature within the cauldron the moment their Spiritual Strength entered it. It was still alright for Xiao Yan, but the expression of Grandmaster Huan changed a little. The Nine Dragon Lightning Flame inside was even stronger than during the test. However, it was fortunate that Tang Zhen had given him a medicinal pill earlier. Otherwise, it was likely that he would have difficulty enduring for a long time.</p><br/><p>“You two, the first batch of medicinal ingredients is about to complete their refinements. I will leave the matter of merging them to the both of you!”</p><br/><p>Tang Zhen’s voice suddenly sounded beside their ears a short while after their Spiritual Strengths entered the medicinal cauldron.</p><br/><p>Xiao Yan and Grandmaster Huan felt their heart tense the moment they heard his voice. Their minds flipped through the first part of the medicinal formula as they prepared to act…</p><br/><p>Around twenty minutes or so later, the nine fire dragons in the medicinal cauldron suddenly shook. Their enormous mouths were opened as cluster after cluster of substances, that contained extremely dense medicinal fragrances, spat out of their mouths.</p><br/><p>These substances were the essence medicinal strength that were left behind by those medicinal ingredients. Some were in starch form while others were in liquid or solid forms. At this moment, they were all suspended within the medicinal cauldron…</p><br/><p>“Do it!”</p><br/><p>These pure medicinal strengths, that had just had their impurities removed, had just appeared when Tang Zhen’s solemn voice quickly followed.</p><br/><p>Xiao Yan and Grandmaster Huan inhaled a deep breath of air when they heard Tang Zhen’s words. After which, their Spiritual Strengths swept out. With their respective knowledge of the medicinal ingredients, they began to separate some of the medicinal liquids that belonged to the medicinal formula. After which, they used their Spiritual Strengths to wrap around them. Their respective flames surged out and began to slowly merge these refined medicinal strengths according to the instructions on the medicinal formula…</p><br/><p>With the sweeping Spiritual Strength of Xiao Yan and Grandmaster Huan, the medicinal ingredients suspended in the medicinal cauldron were completely swept away. The both of them were veteran alchemists with extremely great experience. Although it was the first time they cooperated, no flaws occurred.</p><br/><p>Tang Zhen sighed in relief when he saw these two people working precisely without making any mistakes. A thought immediately passed through his mind as another batch of medicinal ingredients were sucked into the medicinal cauldron. After which, he began the refinement once again!</p><br/><p>On the platform a short distance away, the alchemist grandmasters hurriedly threw their attention over when they saw that the pill refinement had begun. When they saw that Xiao Yan was able to easily keep up with Tang Zhen and Grandmaster Huan’s pace, their faces became somewhat unnatural. This was especially the case for that Grandmaster Mo. His expression was the ugliest. Earlier, he had even said that Xiao Yan was only able to pass the test because he was relying on the might of the Heavenly Flame. However, this current scene was just like a ruthless slap to his face because he clearly understood in his heart that even if he personally joined the refinement, it was impossible for him to follow the refinement pace of Tang Zhen and a tier 7 alchemist…</p><br/><p>Tang Huo Er’s pretty eyes were staring unblinkingly at the stone stage from the side of the square. She only sighed in relief when she saw that Xiao Yan did not appear to panic. She immediately smiled and softly muttered, “Looks like father’s eyesight is quite precise. This fellow is not some country bumpkin who only know how to make excessive demands… however, I wonder if he will be able to help father successfully complete this pill refinement…”</p><br/>\n</div>"}