{"title": "Chapter 1050: Strive", "id": 1050, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1050-strive", "volume_title": "Volume 11", "body": "<h1>Chapter 1050: Strive</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1050: Strive</u></strong></p><br/><p>“Skyfire Three Mysterious Change?”</p><br/><p>Tang Zhen and the red-clothed lady by the side were startled when they heard Xiao Yan’s words. They immediately frowned. The Skyfire Three Mysterious Change was one of the key treasures of the Burning Flame Valley. Although this kind of Secret Technique was useless to some people, it was an incredibly sharp weapon for those who possessed a Heavenly Flame in their bodies!</p><br/><p>The Skyfire Three Mysterious Change was able to use a kind of special method to circulate the flame hidden within one’s body, allowing one to unleash an extremely powerful strength for a short period of time. Every change could unleash a kind of flame. When the three changes were superimposed on each other, its might would be quite terrifying. Of course, the energy that was unleashed from this kind of flame was quite violent. If one were to forcefully unleash it when one’s body was not strong enough, it would lead to an energy backlash…</p><br/><p>Hence, even the interior of the Burning Flame Valley had preserved this Skyfire Three Mysterious Change in an extremely stringent manner. Only the core disciples were able to obtain the first change of the Skyfire Three Mysterious Change. The other two changes would depend on their contribution to the faction and their talent. If one were to really count, it was likely that one could count the number of people who practiced the complete version of the Skyfire Three Mysterious Change with one’s fingers. Even the disciples of the valley would have difficulty practicing the complete version. From this, one could tell just how greatly the Burning Flame Valley valued this Skyfire Three Mysterious Change.</p><br/><p>Xiao Yan’s eyes intently stared at Tang Zhen. His fists also slightly tightened under his sleeves. He needed to obtain the Skyfire Three Mysterious Change. If Tang Zhen refused, it was likely that he would have to spend some effort…</p><br/><p>The people in the hall all felt extremely surprised by Xiao Yan’s request. They did not expect him to ask for so much. Although this high class Secret Technique known as the Skyfire Three Mysterious Change might be useless to some people, it possessed a great allure to others. There was an unknown number of people in the outside world who wished to obtain it. This little fellow’s appetite was really quite big.</p><br/><p>Tang Zhen was quiet for awhile before he slowly shook his head. He looked at Xiao Yan and said, “The Skyfire Three Mysterious Change is one of the key treasures of the Burning Flame Valley. According to the rules, it cannot be gifted to outsiders. Even though I am the Valley Chief, I cannot go against the rules. Hence, you should choose something else…”</p><br/><p>Xiao Yan’s heart sank when he heard this. It seemed that he had underestimated the position of the Skyfire Three Mysterious Change in the Burning Flame Valley… would he have to simply give up?</p><br/><p>The Skyfire Three Mysterious Change was a Secret Technique that seemed almost tailor-made for Xiao Yan. He possessed many types of Heavenly Flames. When the three changes were unleashed at the same time, the increase in his strength would be extremely frightening. Hence, Xiao Yan really desired it at all cost.</p><br/><p>“Valley Chief, the Skyfire Three Mysterious Change is extremely important to me. Can’t you make an exception?” Xiao Yan asked, refusing to give up.</p><br/><p>Tang Zhen sighed. He waved his hand and said, “Young friend Yan Xiao, the other Qi Methods or Dou Techniques in my Burning Flame Valley are also extraordinary items. Changing your request to something else will also benefit you.”</p><br/><p>Xiao Yan intently frowned. A moment later, he suddenly said, “Valley Chief Tang, is this medicinal pill refinement extremely important to you?”</p><br/><p>Tang Ying hesitated for a moment after hearing this. He glanced at the red-clothed lady beside him as he slowly nodded. “It is very important. Moreover, this medicinal pill must be successfully refined within half a year’s time. I already have the intention of asking those old fellows from the Pill Tower to refine it if this refinement fails.”</p><br/><p>“Yet you did not go and find the people from the Pill Tower. It is likely that the reward they will request is extremely high, no?” Xiao Yan softly said. He immediately continued, “May I know just how high the chance of success is if this Grandmaster Huan and I aid you in your pill refinement?”</p><br/><p>Tang Ying tightly knit his brows. A moment later, he slowly replied, “Fifty percent.” This number was his highest estimate. This medicinal pill was a little different from an ordinary medicinal pill. It was exceptionally difficult to refine it.</p><br/><p>“Using a Heavenly Flame to refine a medicinal pill can increase the chances of success by a little. With my help, the chances of success will increase…” Xiao Yan slightly smiled slightly as he spoke. He was not being arrogant. Instead, he was confident in his alchemist abilities. This, along with his Spiritual Strength that was much stronger than an ordinary tier 7 alchemist, gave him the absolute confidence to say these words.</p><br/><p>Tang Zhen looked at Xiao Yan with some surprise when he heard these words. However, there was little doubt left in his eyes after the test earlier. This man, who appeared quite young, was indeed not a simple character.</p><br/><p>I am not trying to boast by saying these words. Instead, I wish to inform Valley Chief Tang that hiring me will definitely not be a mistake. This little chance of success might cause this pill refinement to exceed Valley Chief’s expectations.” Xiao Yan’s eyes bore into Tang Zhen as he explained his talent.</p><br/><p>Tang Zhen’s finger gently drew on the table as he said, “Does young friend Yan Xiao not plan on giving up on the Skyfire Three Mysterious Change?”</p><br/><p>“If Valley Chief Tang feels that this pill refinement is more important than the Skyfire Three Mysterious Change, perhaps we can give it a try…” Xiao Yan’s eyes swept over the red-clothed lady at the side without leaving a trace as he softly suggested.</p><br/><p>Xiao Yan’s words caused Tang Ying to become dull. He tightly knit his brows, glnaced at the red-clothed lady beside him, and mused for a long while. Only then did he slowly nod his head. He said, “This pill refinement is indeed extremely important to me. It is even more important than the Skyfire Three Mysterious Change…” Tang Ying paused when he spoke until this point. His eyes immediately looked at Xiao Yan as he laughed, “Young friend Yan Xiao, the old me really admires the glib of your tongue. After you put it this way, it seems that the value of my Burning Flame Valley’s Skyfire Three Mysterious Change has diminished. I agree with your words. However, even I cannot change the rules of the Burning Flame Valley.”</p><br/><p>Xiao Yan widened his mouth and could only bitterly laugh when he heard this. He really did not have any other method if these words had no effect.</p><br/><p>“However…” Tang Zhen looked at Xiao Yan. His tone had suddenly changed as he said, “If you successfully help me refine the pill this time around, I might perhaps be able to give you a chance. If you can grab it, the Skyfire Three Mysterious Change will belong to you.”</p><br/><p>Xiao Yan immediately rejoiced when he heard these words. Although Tang Zhen did not promise to give him the Skyfire Three Mysterious Change, there was, at the very least, a chance. Regardless of how bleak this chance was, it was ultimately better than turning against the Burning Flame Valley. Xiao Yan had witnessed the strength of the Wind Lightning Pavilion. This Burning Flame Valley was named one of the three great valleys. Its strength was even greater than the Wind Lightning Pavilion. Therefore, it was best if he could avoid being on bad terms.</p><br/><p>“In that case, I shall thank Valley Chief Tang.” Xiao Yan cupped his hands to Tang Zhen as he replied and smiled.</p><br/><p>Tang Zhen waved his hand. He let out a sigh and said, “Don’t thank me first. All of this balances on the precondition of the successful refinement of the medicinal pill. Moreover, even if the pill refinement is to succeed, whether you are able to successfully bring the Skyfire Three Mysterious Change away with you will depend on your ability.”</p><br/><p>Xiao Yan nodded. He was naturally aware that it was impossible to obtain the Skyfire Three Mysterious Change without any hindrances.</p><br/><p>“Since there are no more questions, everyone should return to the guest rooms and take a rest. Chi Huo…” Seeing that there were no other questions, Tang Zhen waved his hands toward Elder Chi Huo. He hurriedly stepped forward, cupped his hands to everyone, and smiled as he said, “Please follow me.”</p><br/><p>Xiao Yan and the others stood up when they saw him. They cupped their hands to Tang Zhen before following Elder Chi Huo out of the large hall.</p><br/><p>The hall once again became quiet after Xiao Yan’s group left. The smile on Tang Zhen’s face was also slowly withdrawn. He let out a gentle sigh.</p><br/><p>“Father, are you really planning on handing the Skyfire Three Mysterious Change to Yan Xiao?” The red-clothed lady turned her body around. Her pretty eyes looked at Tang Zhen as she bit her lower red lip with the back of her teeth and asked.</p><br/><p>“Ugh, Huo Er, you should know how important the medicinal pill being refined this time around is to you. Back then, you wanted to forcefully merge with the Nine Dragon Lightning Flame, but ended up receiving a backlash from the flame. Although you have managed to keep your life, it left behind a great sequelae. If this continues, your life force will be exhausted within less than a year.” Tang Zhen revealed affection in his eyes. He stood up, patted the red-clothed lady’s shoulders, and continued, “The success rate of me refining this medicinal pill is just as Yan Xiao has said. It is not very high. Although this person is young, I dare say that he does indeed possess some ability. With his help, the chances of this medicinal pill being successfully refined will significantly increase.”</p><br/><p>“However, the Skyfire Three Mysterious Change is a top Secret Technique of the Burning Flame Valley. Even if father has agreed, it will be very difficult to pass through the Elders Council…” The red-clothed lady’s eyes turned red as she softly said.</p><br/><p>“I have also said that I am only giving Yan Xiao a chance. At that time, I can allow him to enjoy the treatment of the core disciples. As long as he has the ability and meets the test requirement, the Elders Council will not say anything more. After all, I am the Valley Chief.” Tang Zhen smiled, waved his hand, and informed her.</p><br/><p>The red-clothed lady could only nod her head when she heard this. She gently grit her silver teeth as she said, “It’s all that person’s fault. He is asking for so much.”</p><br/><p>“Ke ke, although this fellow is unceremonious, he does possess some ability. He is already able to subdue a Heavenly Flame at such an age. One could explain it if he possessed the help of an expert. However, if he has relied on himself, that would be a little too terrifying…” Tang Zhen laughed.</p><br/><p>“He has purposefully hide his appearance. However, his actual age should be similar to what is on the surface. The old me has never heard of such a foreign and young tier 7 alchemist appearing in the Middle Region. I think that this Yan Xiao should also be a fake name…”</p><br/><p>“Hiding his head and showing his tail. He is most likely not a good person.” The red-clothed lady muttered. Clearly, she bore a large grudge because Xiao Yan had used the pill refinement to force Tang Zhen to make a choice.</p><br/><p>Tang Zhen shook his head. He affectionately patted the red-clothed lady’s head before turning around and walking out a side door of the large hall.</p><br/><p>“Alright, stop muttering. Go and make preparations. The pill refinement will begin this afternoon. If the medicinal pill is refined, it can be considered to have remove a heavy burden in my heart… ke ke, I am a little curious about what ability that Yan Xiao possesses. Hopefully, he really lives up to my expectations…”</p><br/>\n</div>"}