{"title": "Chapter 1062: Succeed", "id": 1062, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1062-succeed", "volume_title": "Volume 11", "body": "<h1>Chapter 1062: Succeed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1062: Succeed</u></strong></p><br/><p>The three-colored fire lotus rotated over Xiao Yan’s palm. Each time it rotated, the surrounding space would form numerous dark-black spatial lines that caused one’s heart to feel a chill.</p><br/><p>The appearance of the fire lotus allowed everyone to clearly sense the natural energy suddenly become fierce and untamed. Moreover, the temperature was also swiftly rising…</p><br/><p>This unusual phenomenon resulted in the expressions of everyone changing. Even Tang Zhen revealed a shocked expression in his eyes. That strange three-colored fire lotus seemed to hide a terrifying destructive power. Moreover, this kind of strength was something that he felt somewhat familiar with…</p><br/><p>“This is… the Heavenly Flame’s strength?”</p><br/><p>Tang Zhen’s eyes shrank as he thought within his heart!</p><br/><p>Among those who experienced a change in their expressions because of the appearance of the fire lotus included the person involved in the battle, Wu Chen. Due to his close proximity, he was the one who had the deepest understanding of the destructive strength contained within the fire lotus. In the face of the exquisite, three-colored fire lotus, the third Elder of the Burning Flame Valley finally revealed a look of disbelief for the first time. He would have never imagined that Xiao Yan, a one star Dou Zong, would be able to unleash this frightening strength, even he was terrified of, even if he had broken his head in the process.</p><br/><p>“How is this possible?”</p><br/><p>A glow swiftly flashed across Wu Chen’s eyes. A moment later, he suddenly clenched his teeth and a ruthless expression appeared in his eyes. Although Xiao Yan’s fire lotus was frightening, his Dominating Fire Demon Palm was also not ordinary. No one knew just who would be defeated in the other party’s hands!</p><br/><p>Wu Chen, this old demon, who had become experienced with age, was not only not shaken by the fire lotus but had instead formed a greater fighting intent at this moment. This was because he clearly understood that he might still win if he advanced, but if he were to withdraw, he would definitely lose!</p><br/><p>Regardless of whether the ten exchanges had reached, any carelessness on his part would result in him becoming extremely miserable because of this beautiful, three-colored fire lotus.</p><br/><p>The ruthlessness in Wu Chen’s eyes became even more intense while this thought flashed through his heart. The majestic Dou Qi in his body whizzed as the red glow surged on his enormous hand. There was a vague mysterious fire-red seal that was vaguely present on his palm. A glaring glow caused quite a number of people around him to hurriedly shut their eyes.</p><br/><p>“Dominating Fire Demon Palm, Fire Demon Encasing World!”</p><br/><p>The aura within Wu Chen’s body surged with the loud cry. His hand swelled in a lightning-like manner. In an instant, it had swelled to ten feet in size. Looking from a distance, he appeared just like a lamp that was emitting a strong glow.</p><br/><p>After this cry sounded, the mysterious red seal in Wu Chen’s palm also swelled. The wild, violent energy contained within it also increased!</p><br/><p>“Third Elder has used the strongest Fire Demon Seal in the Dominating Fire Demon Palm…”</p><br/><p>Numerous surprised cries sounded from the empty ground as they looked at Wu Chen’s hand, which had swelled. No one expected that this test, which would only last for ten exchanges, would end up become this life and death face off. They were all clearly aware that the current Wu Chen had already used all of his eight star Dou Zong’s strength. Moreover, the key person who caused this was a young one star Dou Zong. This scene caused quite a number of people to feel ridiculous. The gap between a one star and eight star Dou Zong was not something that an ordinary item could measure…</p><br/><p>Xiao Yan’s expression did not change as the fiery-red glow soared above his head. He really disliked Wu Chen. He seemed really intent on not giving him any chances during this ten exchange test. Even if he had to use most of his strength in this last chance, Wu Chen still did not show any signs of hesitation. All of this was to prevent Xiao Yan from successfully obtaining that Skyfire Three Mysterious Change.</p><br/><p>Wu Chen’s attacks were all extremely heavy-handed during these couple of exchanges. If Xiao Yan did not possess any skill, it was likely that his fate would not have been good. This was the ultimate reason why Xiao Yan had hardened his heart and used the three-colored fire lotus!</p><br/><p>Since you do not wish to allow me to have an easy time, I shall make you pay the price for it!</p><br/><p>A vicious expression flashed across Xiao Yan’s dark-black eyes. His hands were suddenly swung and the three-colored, exquisite fire lotus suddenly shot out!</p><br/><p>Wu Chen let out a furious roar the moment the fire lotus shot out, “Dominating Fire Demon Seal!”</p><br/><p>The roar had just sounded when the mysterious fire-red seal glow immediately surged. The symbol fell from Wu Chen’s hand at that instant before transforming into a shocking glow. Even space shook because of its frightening strength as it rushed down in a lightning-like manner!</p><br/><p>The glow and the three-colored lotus floated closer together. In a mere instant, the two collided between Wu Chen and Xiao Yan like meteorites. They contained a terrifying strength in front of a countless number of gazes!</p><br/><p>The entire place was quiet when the two collided. An innumerable number of expressions on everyone’s faces seemed to have stilled at this moment.</p><br/><p>Bang!</p><br/><p>This kind of unusual silence lasted for only a breath’s time. After which, an energy storm that frightened even an elite Dou Zong instantly brewed at the spot where the two collided!</p><br/><p>“Grug!”</p><br/><p>The energy storm had just appeared when the fast rotating energy tail violently swung into Xiao Yan and Wu Hao’s body. Immediately, the two appeared to have received a heavy blow as they spat out a mouthful of fresh blood. Their bodies appeared just like kites with their string cut as they flew backwards. They landed heavily, rubbing and creating a hundred meter long scars on the ground. Only then, did they slowly come to a stop!</p><br/><p>After the two were sent flying, the frightening energy storm began to increase in intensity. Flame surged within it. Not only did this cause the temperature of this place to rise, but it also stirred the energy, turning it wild and violent. No one dared to randomly absorb this energy into one’s body at this moment…</p><br/><p>The enormous energy storm was over a thousand feet in size. It appeared like a hurricane as it spread across the sky. The fierce, violent pressure that rained down from the storm caused the expressions of those present to involuntarily change.</p><br/><p>At this moment, the empty space outside of the hall had been completely shattered. Wave after wave of energy strikes continuously spread from the storm. Even some of the enormous trees in the distant forest broke after being implicated by the force.</p><br/><p>All the Elders of the Burning Flame Valley in front of the large hall, including the second Elder, inhaled a deep breath of cold air. They could sense that if they were to be dragged into the frightening energy storm in the sky, it was likely that they would at least suffer serious injuries even if they did not die…</p><br/><p>Tang Zhen’s face was stern. No one had expected things to turned into this state. This was merely just a test, but the things that were created seemed as though one was attempting to destroy the entire Burning Flame Valley.</p><br/><p>“If I do not take care of this mess, it is likely that the Burning Flame Valley will be turned into chaos by this thing…”</p><br/><p>Tang Zhen could only slowly sigh after being quiet for a moment. He glanced at the second Elder beside him.</p><br/><p>The second Elder quivered because of Tang Zhen’s glance. His face was immediately covered with a bitter smile. He knew that the matter today had completely angered Tang Zhen. However, being an Elder, he needed to step forward and take care of these matters. After all, the Skyfire Three Mysterious Change was not an ordinary thing…</p><br/><p>Tang Zhen ignored the bitter smile on the second Elder’s face. His foot slowly stepped forward. The space became distorted and his body appeared to have instantly teleported in front of the enormous energy storm in the sky. His finger gently cut through the empty space in front of him and an enormous spatial line appeared. After which, his hands were inserted into the spatial line before suddenly pulling it apart!</p><br/><p>With this pulling action, a crack, over a hundred feet in size, immediately formed in space. That crack line contained an endless darkness, which caused one to vaguely feel afraid.</p><br/><p>Tearing space, this soul-stirring ability was likely something that only an ultimate expert at the Dou Zun class was able to perform.</p><br/><p>“Go!”</p><br/><p>Tang Zhen’s hands faced the enormous energy storm from a great distance. He suddenly clenched them. After which, the quickly rotating energy storm gradually came to a stop. Finally, it was violently pushed before being tossed into the dark-black crack line!</p><br/><p>The energy storm had just been thrown into the spatial line when it swiftly mended. In an instant, it completely vanished. That frightening energy storm that raged over the place disappeared with it…</p><br/><p>The many surrounding disciples from the Burning Flame Valley finally sighed in relief after seeing the frightening thing disappear. They immediately wiped the cold sweat off their faces. If Tang Zhen had not intervened today, it was likely that this place would be turned into ruins.</p><br/><p>Tang Zhen exhaled after having finished off the energy storm. He returned his somewhat trembling hands under his sleeves. He had a clear understanding of the Dominating Fire Demon Palm. It was impossible for it to create such a frightening energy storm. In that case, it seemed that the storm this time around was triggered by the mysterious fire lotus…</p><br/><p>“This Xiao Yan is indeed not an ordinary person. He is able to get the Heavenly Flame to unleash such might. My Burning Flame Valley has controlled the Nine Dragon Lightning Flame for many years, but we are unable to reach such a stage. This boy… is really extraordinary.”</p><br/><p>Tang Zhen sighed quietly in his heart. He involuntarily cherished such talent. However, on second thought, Xiao Yan likely already possessed a teacher in order for him to reach such a level. Immediately, disappointment flashed through his eyes.</p><br/><p>Tang Zhen’s eyes swept under him as he stood in the sky. After which, they paused on the spot where Xiao Yan and Wu Chen had landed. At this moment, the both of them struggled for a moment before climbing to their feet with much difficulty. They looked at each other from a distance. There was some provocation in their gazes…</p><br/><p>“The ten exchanges are over. Wu Chen, you have lost.” Tang Zhen slowly descended from the sky and spoke in a faint voice.</p><br/><p>The miserable looking Wu Chen was startled when he heard Tang Zhen’s voice. Immediately, he grit his teeth unwillingly. He did not expect that he would lose to a younger generation, a result that was completely unexpected. Although he was not satisfied, his heart involuntarily formed a chill when he recalled the frightening energy storm from earlier. If he had been swept into it, it was likely that he would, at the very least, end up seriously injured.</p><br/><p>Xiao Yan wiped the trace of blood off of the corner of his mouth. His expression vaguely contained a paleness. However, there was an even greater heat to it. Back then, the three-colored fire lotus was unable to do anything to an eight star Dou Zong. Now, however, it was already strong enough to do some damage. In other words, he had another method to deal with an expert of this level in the future…</p><br/><p>Tang Zhen’s eyes slid to Xiao Yan. He smiled slightly and his voice had become a little friendlier.</p><br/><p>“Since Wu Chen has already lost, according to the rules, the Skyfire Three Mysterious Change should belong to you… congratulations.”</p><br/>\n</div>"}