{"title": "Chapter 1069: Whereabouts", "id": 1069, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1069-whereabouts", "volume_title": "Volume 11", "body": "<h1>Chapter 1069: Whereabouts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1069: Whereabouts</u></strong></p><br/><p>A gloomy expression flashed across Xiao Yan’s face when he saw the green-clothed, old man stand up.</p><br/><p>“Leave quickly…” Xin Lan’s expression also changed as she hurriedly turned to Xiao Yan and commanded.</p><br/><p>The two Elders who had blocked Xiao Yan’s path of retreat seemed to have heard her words. Dou Qi slowly surged from their bodies. A cold smile was present on their faces.</p><br/><p>“If you are really Xin Lan’s friend, please remain in the Ye clan for awhile. We might still be able to have a proper discussion…” The green-clothed, old man’s eyes stared intently at Xiao Yan while he spoke in a deep voice.</p><br/><p>Xiao Yan was expressionless. The current him was only concerned about the Little Fairy Doctor’s situation. Where would he find the time to bother about whatever Ye clan…</p><br/><p>“Follow me.”</p><br/><p>Xiao Yan’s gaze turned to Xin Lan as he spoke. After which, he turned around and walked toward the exit of the hall. The two Ye clan’s Elders, who were blocking the door, were completely ignored by him.</p><br/><p>This action of Xiao Yan caused Xin Lan to be a little startled. She looked at his back and knew that if she did not follow him herself, it was likely that Xiao Yan would no longer bother about the promise he had given her… a struggle flashed across Xin Lan’s face when she thought of this. She suddenly clenched her silver teeth, turned around and followed close behind Xiao Yan.</p><br/><p>“Insolence!”</p><br/><p>A fury immediately surged into the faces of the two Ye clan Elders blocking the exit when they saw Xiao Yan’s arrogance. They let out a cold cry and the both of them attacked in unison. Their hands contained a surging force as they grabbed at Xiao Yan’s shoulders in a lightning-like manner.</p><br/><p>Xiao Yan’s expression did not change in the face of an attack by two three star Dou Zongs. He flicked his finger and a silver glow flashed. A silver-colored figure immediately appeared…</p><br/><p>Clang!</p><br/><p>The two Elder’s sharp-eagle-claw-like hands rushed over in a lightning-like fashion. After which, they heavily collided with the silver-colored figure. A metallic sound as well as sparks were emitted when both parties made contact.</p><br/><p>This contact caused the expressions of the two Elders to drastically change. Before they could pull back, however, a pair of silver-colored metallic arms penetrated the silver glow while revealing afterimages. They ruthlessly landed on the respective chests of these two with such a fast speed that they could not react.</p><br/><p>“Grug!”</p><br/><p>The silver-colored metallic fists did not carry any majestic Dou Qi. However, it unleashed shocking damage when the fists landed on the bodies of the two Elders. The both of them flew back like kites with broken strings. Finally, they were forced out of the hall. Two mouthfuls of fresh blood were spat out soon after.</p><br/><p>The interior of the hall was once again in complete silence as everyone looked at the two Elders, who were suddenly sent flying from the large hall. Quite a number of people quietly swallowed a mouthful of saliva. Numerous shocked eyes paused on the silver glow beside Xiao Yan. Following the gradual disappearance of this silver glow, a silver-colored figure was slowly revealed.</p><br/><p>“This is the last time. Next time, I will not show any mercy!”</p><br/><p>Xiao Yan’s back faced the people from the Ye clan. His voice contained some ice-cold killing intent. The repeated hindrances had gradually exhausted his patience.</p><br/><p>The gloomy expression of the green-clothed, old man at the leader’s seat slowly became solemn. His eyes stared intently at the completely still silver-colored human figure beside Xiao Yan. He sensed a dangerous feeling from its body.</p><br/><p>Currently, the Earth Demon Puppet had undoubtedly been greatly strengthened after absorbing the Pill Lightning at the Burning Flame Valley. According to Xiao Yan’s guess, it should be able to fight head-on against a seven star Dou Zong. This First Elder of the Ye clan was merely a six star Dou Zong. It was impossible for him to be a match for the Earth Demon Puppet.</p><br/><p>“This is…a puppet?”</p><br/><p>The green-clothed, old man’s eyes paused on the Earth Demon Puppet for a moment. Finally, he appeared to have discovered something. His eyes narrowed while he slowly spoke, looking at Xiao Yan with surprise as he did so.</p><br/><p>Xiao Yan did not reply. He waved his sleeves and once again stored the Earth Demon Puppet into his Storage Ring. He demanded, “Can I bring Xin Lan with me now?”</p><br/><p>The green-clothed, old man tightly frowned. His gaze was focused on Xiao Yan. This mysterious, young man had not only reached the Dou Zong class at such a young age, but he was also in possession of a puppet with a mind-boggling strength. It seemed that his background was quite impressive. No wonder Xin Lan would always be confident when speaking about him…</p><br/><p>“The old me is Ye Zhong, the first Elder of the Ye clan. Is this young friend named Xiao Yan?” The gloominess in the green-clothed, old man’s face was slowly withdrawn as he cupped his hands to Xiao Yan. The strength that Xiao Yan had displayed was sufficient to shake the current Ye clan. Hence, his tone was clearly much more polite than it was earlier.</p><br/><p>Xiao Yan nodded but did not wish to remain for long. He raised his leg and walked out of the hall. Xin Lan behind him hesitated for a moment before turning her head to Ye Zhong. She said, “First Elder, I will return once big brother Xiao Yan settles his issues.” Xin Lan hurriedly followed Xiao Yan after replying to him</p><br/><p>Ye Zhong widened his mouth when he saw this situation. However, he could only let out a sigh. He ceased saying anything and allowed the two of them to leave.</p><br/><p>“First Elder…” The fourth Elder, who had been defeated by Xiao Yan with one palm, climbed to his feet at this moment and looked at Ye Zhong.</p><br/><p>Ye Zhong waved his hand and sighed, “Forget it, let them leave. This Xiao Yan might indeed not be an ordinary person. The Ye clan might really have to rely on him this time around.”</p><br/><p>“How can it be? He might be very strong, but this little strength is far from sufficient from allowing our Ye clan to enter the Pill Tower Elders seat… isn’t putting our hope on a person whose background we are unfamiliar with a little…” That fourth Elder hesitated for a moment before speaking.</p><br/><p>“We have no choice. Currently, quite a number of strong factions are setting their sights on our Ye clan. If we do not adopt any measures, it is likely that the Ye clan will really be finished…” Ye Zhong shook his head and helplessly uttered.</p><br/><p>“Now… let’s hope that this young man called Xiao Yan is really as capable as Xin Lan described. Moreover, it is likely that the matter today has given him a bad impression of our Ye clan. Ugh, this is also a matter that gives me a headache…”</p><br/><p>…</p><br/><p>Xiao Yan grabbed Xin Lan’s arm after having led her out of the Ye clan. He flew out of the city. A moment later, he finally stopped on a mountain top outside of the city.</p><br/><p>“You should be aware of the matter regarding the Little Fairy Doctor, right?” Xiao Yan immediately asked in a deep voice after having landed on the mountain top.</p><br/><p>Xin Lan slightly nodded. The back of her teeth bit her lower red lip as she softly said, “Back then, Little Fairy Doctor jie-jie, Zi Yan, and I successfully exited the Wormhole. After which, we spent a couple of months to reach the Pill Region. Once we arrived in the Pill Region, an immoral faction called the ‘Yuxian Gate’ set their eyes on Little Fairy Doctor jie-jie due to her beauty. In her anger, she killed everyone in that faction. However, Yuxian Gate’s chief is also an elite Dou Zong. Although he ended up dying to Little Fairy Doctor jie-jie’s hands, she had also suffered some injuries. Coincidentally, it had resulted in the weakening of the seal and the Woeful Poison Body erupted. Finally… she was discovered by someone…</p><br/><p>“The Woeful Poison Body is a representation of disaster in the Pill Region because there have been a number of disasters that have been created as a result of the Woeful Poison Body erupting… therefore, the news of the Woeful Poison Body had just spread when many factions attacked her. The Ice River Valley is the most active one. However, their intention is not to destroy the Woeful Poison Body. Instead, they wished to obtain this special body because the Ice River Valley loves to collect different kinds of unique bodies. After which, they will use a special method to transfer the soul of an expert within the valley into the body. Thus, they will be able to obtain some of the ability in her body…”</p><br/><p>Xiao Yan’s expression gradually became dark and solemn when he heard Xin Lan’s words. This Ice River Valley was indeed not something good.</p><br/><p>“Some time earlier, the place the Little Fairy Doctor had been hiding was discovered by the Ice River Valley. After which, she exchanged blows with the other party’s experts and suffered a serious injury… big brother Xiao Yan… Xin Lan is useless. I cannot even be of any help.” Xin Lan’s eyes also turned red when she spoke until this point. She had blamed herself over her helplessness.</p><br/><p>Xiao Yan inhaled a deep breath of air. He waved his hand and said. “This is not your fault… you should know where the Little Fairy Doctor is currently at, right?”</p><br/><p>“Yes, I have received the information that Little Fairy Doctor jie-jie has sent to me. However, that place is currently surrounded by the experts from the Ice River Valley. I am unable to even enter.” Xin Lan nodded and said.</p><br/><p>“Where is it?”</p><br/><p>“Fallen God Stream.”</p><br/><p>“It is indeed that place…” Xiao Yan narrowed his eyes and spoke in a low voice.</p><br/><p>“Although Little Fairy Doctor jie-jie has fled the encirclement of the Ice River Valley, she has suffered a serious injury and doesn’t dare reveal herself. However, the Fallen God Stream has already been surrounded by the Ice River Valley. The terrain there might be complicated but it is only a matter of time before she is found…” Xin Lan softly said, “Big brother Xiao Yan, what do you plan to do now?”</p><br/><p>“What else can I do…” Xiao Yan stood up. His eyes looked to the north as a dense, cold glint flashed across them. “Head to the Fallen God Stream!”</p><br/><p>“In that case, I shall lead the way for you! I know how to find Little Fairy Doctor jie-jie once I enter the Fallen God Stream.” Xin Lan clenched her teeth and informed him.</p><br/><p>Xiao Yan slightly nodded. Immediately, he seemed to have recalled something and asked, “That’s right, where is Zi Yan? Has she been following beside Little Fairy Doctor?”</p><br/><p>“Zi Yan…” Xin Lan was startled when she heard this. She immediately let out a bitter laugh, “She has been missing not long after we arrived in the Pill Region…”</p><br/><p>“Missing?” Xiao Yan’s expression immediately changed.</p><br/><p>“She cannot be described as missing either. She left a message for us saying that she suddenly sensed something and wanted to return home…”</p><br/><p>“Return home?”</p><br/><p>Xiao Yan tightly knit his brows. Zi Yan’s identity had always been a mystery. However, Xiao Yan could vaguely guess that her identity was definitely extremely strong. He wondered just where her so called home was…</p><br/><p>“Ugh, hopefully that girl is fine. Now, we can only wait until the Little Fairy Doctor’s problems are settled before finding her…”</p><br/><p>Xiao Yan sighed. He once again grabbed Xin Lan and moved his body, rushing to the northern sky as he did so. He needed to find the Little Fairy Doctor as soon as possible!</p><br/>\n</div>"}