{"title": "Chapter 1085: Peak of the Dou Zong Class", "id": 1085, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1085-peak-of-the-dou-zong-class", "volume_title": "Volume 11", "body": "<h1>Chapter 1085: Peak of the Dou Zong Class</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1085: Peak of the Dou Zong Class</u></strong></p><br/><p>The entrance to the valley was a path that was a couple of dozen feet wide. The Little Fairy Doctor and Xin Lan were seated cross-legged on the walls beside the path. The Earth Demon Puppet, with its hollow eyes, was beside them.</p><br/><p>Xin Lan held her cheeks with her hand as her gaze repeatedly swept over the valley. There had been no commotion in the valley during these couple of days of waiting. She really did not know how things were progressing…</p><br/><p>“Ugh…” Xin Lan softly sighed. She stretched her lazy waist and was just about to speak to the Little Fairy Doctor beside her when the Little Fairy Doctor’s tightly shut eyes were suddenly opened. A grave expression instantly surged onto her pretty face.</p><br/><p>“What is it?”</p><br/><p>Xin Lan was shocked when she saw the appearance of the Little Fairy Doctor, and she hurriedly asked.</p><br/><p>“The people from the Ice River Valley… have arrived…” An icy cold glint flashed across the Little Fairy Doctor’s pretty eyes. She slowly stood up from the ground as a faint killing intent gradually wreathed out of her body.</p><br/><p>Xin Lan’s expression also changed when she heard the Little Fairy Doctor’s words. Her eyes hurriedly looked to the outside of the valley. She indeed saw some white figures in the distance.</p><br/><p>“You are the Woeful Poison Lady, right?”</p><br/><p>While Xin Lan was looking at the area outside of the valley, an indifferent, old voice was suddenly transmitted from the distance. After which, it landed in the ears of the Little Fairy Doctor and Xin Lan.</p><br/><p>The Little Fairy Doctor did not reply to this voice. An icy-cold expression was present in her eyes. She clenched his fist and grayish-purple Dou Qi slowly extended out like two enormous pythons. Immediately, they meandered around her body…</p><br/><p>A gentle ripple was suddenly formed in the air at the entrance to the valley not long after the old voice sounded. Immediately, a hunched-backed figure, holding a snake-shaped walking stick, slowly appeared in front of the Little Fairy Doctor’s and Xin Lan’s eyes.</p><br/><p>Following the appearance of this hunched-backed figure, sounds of wind parting appeared behind him. A moment later, numerous white figures landed behind the hunchbacked figure in an orderly fashion. This group of people was silent after making their appearance. A killing intent was vaguely and slowly spreading at the same time, causing the surrounding poison gas to scatter.</p><br/><p>The Little Fairy Doctor’s eyes narrowed when the old man holding a snake-shaped walking stick appeared. She quietly tightened her hands and said in a clear cool voice, “It is indeed an expert at the peak of the Dou Zong class. This Ice River Valley is really willing to put in the effort!”</p><br/><p>“Ha ha, it is not overboard for the old me to act for the Woeful Poison Lady. Moreover, according to the rules of my Ice River Valley, those who have killed the Elders of my valley will also be captured and put to death.” The old man holding the snake-shaped walking stick was naturally the Elder Tian She from the Ice River Valley, who had entered the Fallen God Stream in search of Xiao Yan’s group. At this moment, his narrow eyes were looking at the Little Fairy Doctor above him. He smiled slightly while his voice contained an unconcerned tone.</p><br/><p>“He is… Ice River Valley’s Elder Tian She?” Xin Lan, who was behind the Little Fairy Doctor, revealed a somewhat pale-white face due to the large group of Ice River Valley’s experts that had appeared. When her eyes paused on that old man, her paleness grew even more intense as she involuntarily cried out.</p><br/><p>“Elder Tian She?” The Little Fairy Doctor was startled. Immediately, her face changed a little. Even someone like her, who had entered the Pill Region a short while ago, had heard of this person’s name. It was rumored that this old fellow was not only strong, but had also practiced the Ice Zun Force of the Ice River Valley to a peak level. An ordinary Dou Zong was unable to even last ten exchanges against him. Moreover, each time this person fought, he would not leave anyone alive. Additionally, he relied on the overbearingness of his Ice Zun Force to freeze his opponents into life-like ice sculptures, causing one to feel terrified just by looking at it.</p><br/><p>The fierce reputation of this old fellow was quite well-known in this Middle Region. The Little Fairy Doctor had not expected the Ice River Valley to dispatch this old demon.</p><br/><p>“Why are there only the two of you? I remember there seemed to be a young man and a spiritual body that possessed a great strength, no?” Tian She gently stuck the snake-shaped walking stick into the ground as he laughed, “Ask the both of them to come out. Today, the old me shall not let anyone off. Otherwise, it would be difficult for me to account to the Valley Chief.”</p><br/><p>“I’m afraid that you don’t have that ability.” The Little Fairy Doctor coldly laughed. She turned her head to Xin Lan and said, “Head to the valley. Look after Xiao Yan and Tian Huo zun-zhe.”</p><br/><p>Xin Lan hesitated for a moment after hearing her words. However, after thinking about how she would only be a burden to the Little Fairy Doctor, she could only clench her teeth and swiftly withdraw. After which, she leaped into the valley.</p><br/><p>“It seems that all of them have hid in the valley. Could it be that they were injured when fighting the Sky Poison Dragon Scorpion Beast the last time?” Tian She was unconcerned about Xin Lan leaving. None of these people would be able to flee today.</p><br/><p>The Little Fairy Doctor knit her eyebrows. She did not expect this old demon to be aware of their fight with the Sky Poison Dragon Scorpion Beast. He was indeed somewhat skilled…</p><br/><p>“Old She, leave this woman to us. You can just rest…” One of the three white-clothed, old men beside Tian She glanced at the Little Fairy Doctor before speaking in a respectful manner.</p><br/><p>“There’s no need. The old me is also extremely interested in this Woeful Poison Lady…” Tian She suddenly rubbed the back of his ear when he spoke until this point. There was a brown scar at that spot. An ugly hole was vaguely present in the scar. It was as though the flesh had been dug out of that spot. It caused one to shiver when looking at it.</p><br/><p>Tian She rubbed this brown scar. A chill suddenly surged out of both of his eyes. “I can’t remember just when I exchanged blows with that last person that had the Woeful Poison Body. However, I have a deep memory of that person. Today, allow the old me to see just what level this Woeful Poison Body has reached.”</p><br/><p>The three white-clothed, old men looked at each other after hearing this. None of them dared to say anything more. Being defeated by the expert who possessed the Woeful Poison Body back then had left a bloody scar in the heart of Tian She. They did not dare to say anything over this matter.</p><br/><p>“All of you should guard the four corners of this valley. Do not allow anyone to escape!” Tian She lifted the snake-shaped walking stick as he slowly walked forward. After which, his feet stepped on empty air as he climbed to through the air. His eyes glanced at the Little Fairy Doctor and the Earth Demon Puppet beside her before laughing with a faint voice, “Other than you, there will not be anyone else alive in this valley.”</p><br/><p>The Little Fairy Doctor’s face was icy-cold. Her eyes swept over the valley without leaving a trace while her hands involuntarily tightened. There was still no activity within the valley. It seemed that the merger of Tian Huo zun-zhe with his physical body had yet to finish.</p><br/><p>“I can only try my best to delay the time. Hopefully, Xiao Yan can increase the speed of the merger!”</p><br/><p>The Little Fairy Doctor inhaled a gentle breath. She shifted her legs. Her foot had just stepped forward when the Earth Demon Puppet seemed to have been dragged by something. A ‘boom’ sound appeared as its foot stomped violently on the ground. After which, it rushed toward Tian She in the sky.</p><br/><p>The Little Fairy Doctor hurriedly followed after seeing this. The vast and mighty Dou Qi on her palms transformed into two grayish-purple large Dou Qi pythons. They emitted a hissing sound as they cut through the distant air and bit at Tian She.</p><br/><p>“Is this that puppet? It is indeed a little extraordinary. However, the true peak of the Dou Zong class is not someone you can fight against by relying on numbers…” Tian She smiled indifferently in the face of the Earth Demon Puppet as it led the attack. He clenched his shriveled hand and one could see the space in front of the Earth Demon Puppet fluctuate. A moment later, it transformed into a real substance.</p><br/><p>“Bang!”</p><br/><p>The Earth Demon Puppet violently collided against the space wall. The rebounding effect returned most of the force to the body of the puppet, sending the Earth Demon Puppet flying.</p><br/><p>Tian She slowly raised his shriveled hand after randomly forcing back the Earth Demon Puppet. After which, he faced the Little Fairy Doctor and made a sudden grabbing motion. Immediately, a ten-foot-large, cold air palm shot out and grabbed the two large grayish-purple Dou Qi pythons. With a ruthless pinch, the two enormous pythons crumbled, transforming into countless energy spots that scattered to the ground.</p><br/><p>A cold smile surfaced on Tian She’s face after having shattered the enormous pythons. He waved his hand and an enormous palm appeared in front of the Little Fairy Doctor in a lightning-like fashion. After which, it was violently slammed down.</p><br/><p>The Little Fairy Doctor’s pretty face changed slightly when she sensed the shocking cold air that had suddenly arrived. She could sense the circulation of the Dou Qi within her body was clogged in the face of this shocking cold air.</p><br/><p>“What powerful Ice Zun Force!”</p><br/><p>A seriousness surged onto the Little Fairy Doctor’s face. Dense, grayish-purple Dou Qi swiftly surged out of her body. After which, it gathered above her head.</p><br/><p>“Bang!”</p><br/><p>The large, cold ice palm landed without any obstruction, colliding with her grayish-purple Dou Qi. Frightening cold air surged out. Immediately, tiny ice flakes surfaced on her grayish-purple Dou Qi. The enormous palm completely smashed the Little Fairy Doctor’s defenses in a tricky manner.</p><br/><p>“Grug!”</p><br/><p>Her defenses were easily broken and the enormous force sent her body across space before she had the time to withdraw. Immediately, a mouthful of fresh blood was spat out. Her lovely body flew backwards like a kite with a broken string. Finally, she smashed into the wall. The powerful force caused fissures to appear on the mountain wall.</p><br/><p>The Little Fairy Doctor was forced back in defeat after merely one exchange. An expert at the peak of the Dou Zong class was this powerful.</p><br/><p>Tian She smiled slightly after having defeated the Little Fairy Doctor with one palm. He was about to give chase when a silver-colored figure once again rushed over without fearing death. A silver glow was flickering over its fist!</p><br/><p>Faint disdain surfaced in Tian She’s eyes when he sensed the sharp wind contained on the fist of the silver-colored figure. All the puppet had was brute strength. It was still fine if it was dealing with an ordinary Dou Zong. However, it was undoubtedly just a reckless act against him.</p><br/><p>Snow-white, cold air swiftly gathered on Tian She’s hand. In the blink of an eye, it transformed into an ice fist that struck forward!</p><br/><p>Bang!</p><br/><p>The ice fist and the fist of the Earth Demon Puppet violently collided at a speed that caused a great impact. Ice flakes immediately flew in all directions!</p><br/><p>Tian She coldly laughed as the ice flakes shot out from the ice fist, and his arm suddenly and strangely wiggled, like a snake, before it suddenly shook!</p><br/><p>Boom!</p><br/><p>The floodwater-like force surged out while the arm was wiggling. This force contained the strength of the Earth Demon Puppet. That strange wiggling technique seemed to have completely reflected the Earth Demon Puppet’s attack.</p><br/><p>The force spread out in a ripple form and a half-a-finger-deep fist mark sank into the chest of the Earth Demon Puppet. If it did not possess any life nor feel any pain, it was likely that Tian She’s hand would have killed it.</p><br/><p>Even though this was the case, the Earth Demon Puppet was still violently thrown down. Finally, it shattered a couple of large rocks before it was deeply imprinted in the mountain wall.</p><br/><p>“You’re only so-so…”</p><br/><p>The snake-shaped walking stick in Tian She’s hand gently pressed against the empty air as Tian She swiftly glanced at the defeated Little Fairy Doctor. He faintly laughed, “The current you is indeed much weaker compared to the last person in possession of the Woeful Poison Body. Obediently return with me to the Ice River Valley and you might still have a chance to survive. Otherwise, your fate will not be better than the others…”</p><br/><p>The Little Fairy Doctor’s face was ice-cold. She wiped away the trace of blood on the corner of her mouth. The seal formed by her hands changed and was just about to undo the seal of the Woeful Poison Body when a soft laugh suddenly spread from the valley.</p><br/><p>“I think that there is no need to return to the Ice River Valley. This Fallen God Stream is not a bad burial ground. It should be quite a good place for your old bones to be buried here...”</p><br/><p>Tian She slowly withdrew the smile on his face while he stood in the air. His eyes were gloomy as they landed on the entrance of the valley. Two figures were slowly walking out.</p><br/><p>Tian She’s eyes paused on the young figure. Soon after, they turned to the old man, who was wearing a smile. After which… his gloomy face slowly stiffened.</p><br/><p>“Dou Zun?”</p><br/><p>His soft voice contained a little dullness and shock as it suddenly spread, causing the air around to quietly freeze.</p><br/>\n</div>"}