{"title": "Chapter 1086: Throwing An Egg Against A Stone (Useless Effort)", "id": 1086, "volume": 11, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1086-throwing-an-egg-against-a-stone-useless-effort", "volume_title": "Volume 11", "body": "<h1>Chapter 1086: Throwing An Egg Against A Stone (Useless Effort)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1086: Throwing An Egg Against A Stone (Useless Effort)</u></strong></p><br/><p>“Dou Zun?”</p><br/><p>These two simple words appeared to possess an demonic power that instantly caused the air above the land to solidify. The chilly killing aura that was formed by the many Ice River Valley’s disciples completely collapsed in the face of these two words!</p><br/><p>Two figures slowly walked out of the entrance of the valley. Xiao Yan lifted the Little Fairy Doctor up, and saw the hint of blood on the corner of her mouth. The slight smile on his face involuntarily tightened. However, this smile was filled with a killing aura and a chilly feeling.</p><br/><p>“Have you succeeded?”</p><br/><p>“The Little Fairy Doctor looked at Tian Huo zun-zhe behind Xiao Yan and asked joyfully.</p><br/><p>Xiao Yan grinned slightly and nodded. He asked, “Are you alright?”</p><br/><p>“It’s just some minor injuries.” The Little Fairy Doctor randomly replied. This time around, she had paid some attention and did not allow the Ice Zun Force to invade her body. Additionally, that Tian She wanted to capture her alive. Therefore, he had held back when he launched his palm attack. It was due to this that her injuries were not considered serious.</p><br/><p>Xiao Yan grabbed the Little Fairy Doctor’s hand. He only felt assured after probing her. Turning his head, he looked at Tian She in the sky, whose face had suddenly turned volatile and uneasy. He smiled as he said, “This elder’s blows are really heavy.”</p><br/><p>Tian She’s expression was dark and solemn as he glanced at Xiao Yan. After which, he let out a cold snort. His eyes slid to Tian Huo zun-zhe. Although he had yet to say a word, the vague pressurizing feeling that spread from his body caused Tian She to feel as though his heart had tightened. This kind of pressure was something that he had only sensed from the Ice River Valley’s Valley Chief and another old demon who had always surpassed him. Those two had truly stepped into the Dou Zun class!</p><br/><p>In other words, this plain old man was definitely a Dou Zun expert!</p><br/><p>“The appearance of this person should be that of the spiritual body back then… at that time, he had only reached the level of an eight star Dou Zong. Now, however, it seems like that was done on purpose…” A thought quickly passed through Tian She’s heart in this quiet atmosphere. Due to Tian Huo zun-zhe’s soul completely merging with this new body, even the appearance of the body had changed. It had turned into one that was similar to Tian Huo zun-zhe’s soul. Therefore, Tian She had managed to recognize Tian Huo zun-zhe as the spiritual body from just a glance.</p><br/><p>“This friend, we can choose not to pursue the matter of you having killed the Elder of the Ice River Valley. However, my Ice River Valley cannot let off these people. Hopefully, on account of my Valley’s Chief face…” Tian She was worthy of being an expert renowned for a long time. Even when facing an elite Dou Zun, he was still able to calm himself after losing his composure. He cuppred his hands respectfully to Tian Huo zun-zhe, but he was interrupted before he could say all that he wanted to say.</p><br/><p>“I am unfamiliar with your Valley Chief. The old me doesn’t think I need to give him any face…” Tian Huo zun-zhe gently twisted his arm. He still felt a little unfamiliar after having merged with this body. However, this feeling of possessing a physical body was really too wonderful. He glanced at Xiao Yan beside him and smiled. After which, he raised his head and answered Tian She with a smile.</p><br/><p>Tian She’s expression slightly sank when he heard this. With his status and strength, it had been a long time since someone dared to say such words to him.</p><br/><p>While Tian She’s expression had sunk, the three Ice River Valley’s Elders not far below also gradually recovered from their shock. Their gazes contained disbelief as they looked at the old man behind Xiao Yan. Dou Zun? How was it possible that this group of people would possess an expert at such a level?</p><br/><p>Being expert Dou Zongs, they clearly understood just how frightening a Dou Zun was. They had never expected this situation, where nothing could have gone wrong, would undergo such a drastic change within an instant. Dou Zun… that was an ultimate expert that even Elder Tian She would have difficulty defeating even if he personally fought!</p><br/><p>The three Ice River Valley’s Elders exchanged glances with each other. Their mouths were filled with bitterness. The change of this situation was really testing one’s ability to resist a blow. Earlier, they were the wolves surrounding the goats. However, in the blink of an eye, a fierce tiger appeared among these goats. The change of identities from the hunter to the hunted seemed a little too quick…</p><br/><p>“The old me is aware that you are not a nice person. Similarly, the old me also belongs to the type of people who will take revenge against those who offend me. Since you have wounded someone, you will naturally have to pay the price for doing so…”</p><br/><p>Tian Huo zun-zhe gave a faint smile while the expressions of the people from the Ice River Valley were volatile. He turned his head to Xiao Yan and said, “Leave them to me.”</p><br/><p>Xiao Yan slightly nodded. He lifted the Little Fairy Doctor and slowly took two steps back before softly saying, “Since the Ice River Valley intends to deliver such a big gift, we should just accept it.”</p><br/><p>Tian Huo zun-zhe smiled and nodded. His robes suddenly rose despite the absence of any wind. The surrounding air was like a wave of water as it began to swiftly fluctuate. A mighty force slowly spread out.</p><br/><p>“This friend, do you really wish to become enemies with my Ice River valley? Don’t think that you can be fearless just because you are an elite Dou Zun! My Ice River Valley has never been afraid of anyone!” Tian She’s eyes became darker when he saw the situation. The snake-shaked walking stick in his hand struck the empty air ruthlessly as he coldly cried out.</p><br/><p>Tian Huo zun-zhe acted as though he did not hear this cold cry. The space around his body began to fluctuate even more intensely. Under this kind of fluctuation, the surrounding rock fragments began to tremble. They quickly split apart, transforming into countless grains of tiny sand…</p><br/><p>A denseness flashed across Tian She’s eyes when he saw Tian Huo zun-zhe ignoring him. An elite Dou Zun was indeed extremely strong. However, it was impossible to get him to withdraw with just this. It was not as though he had never seen an elite Dou Zun!</p><br/><p>“Everyone from the Ice River Valley, listen up. Form the Strong Dragon Mysterious Profound Formation!” Tian She swiftly took a couple of steps back and cried out to the members of the Ice River Valley below in a stern manner.</p><br/><p>All the members of the Ice River Valley shivered when they heard Tian She’s cry. However, these people were also considered the elites in the Ice River Valley. They immediately spread apart and formed an extremely mysterious formation. Tian She was located at the eye of the formation.</p><br/><p>Hah!</p><br/><p>Wave after wave of low cries was repeatedly being emitted from the mouths of the Ice River Valley’s disciples. Immediately, clusters of white-colored cold air shot from the tops of their heads. The white-colored cold air of the three Ice River Valley’s Elders were the strongest.</p><br/><p>Countless blobs of strange-white-colored, cold air rose before agglomerating in the sky, lingering over Tian She’s body. At this moment, both of his eyes furiously opened. The seal formed by everyone’s hands swiftly changed, forming numerous dazzling afterimages.</p><br/><p>“Strong Dragon Mysterious Profound Formation, Blood Offering Summons the Profound Dragon!”</p><br/><p>Tian She’s fingernail cut the tip of his finger. Fresh blood shot out and immediately merged into the murky, cold air. He widened his mouth and an unusually mighty deep-blue air shot out. Finally, it agglomerated with the many intermingling vapors. As it swiftly wiggled, a thousand-foot-large, frosty dragon slowly appeared in the sky.</p><br/><p>This icy-cold, enormous dragon was really huge. The surface of its body was covered with countless numbers of blood traces. An ice-cold bloody glint flickered in the eyes of the large dragon. Its gaze stared at everyone below, looking at them as one would look at an ant. This large dragon did not merely appear powerful. There was a dragon’s might seeping out of its body.</p><br/><p>A paleness surged on the faces of Tian She and those people from the Ice River Valley when the ice-cold, large dragon appeared. The skin of some of the disciples had even become much drier. Their hair also showed signs of a weathering-yellow color.</p><br/><p>Xiao Yan frowned slightly as he looked at this icy-cold dragon. The Ice River Valley really lived up to its name. They possessed such a mysterious formation. However, at a glance, it seemed the price they paid to use this kind of formation was significant…</p><br/><p>Tian Huo zun-zhe’s body was suspended in the sky. His eyes looked at the large dragon as some surprise flashed through them. This icy-cold dragon was agglomerated from the Dou Qi and Essence Blood of all the people here from the Ice River Valley. Its might far exceeded that of an ordinary peak level Dou Zong.</p><br/><p>“This friend, if you withdraw now, my Ice River Valley will still see you as a VIP!” Tian She spoke in a deep voice while his eyes stared intently at Tian Huo zun-zhe, whose robes were fluttering despite the absence of any wind.</p><br/><p>“You are merely bluffing.” Tian Huo zun-zhe faintly replied.</p><br/><p>“You are bringing this on yourself!” A cold glint flickered in Tian She’s eyes. He did not believe that this dragon, formed from everyone’s Dou Qi, posed no threat to this person in front of them!</p><br/><p>“Go!”</p><br/><p>Tian She furiously cried out as he pointed his finger at Tian Huo zun-zhe. The icy-cold, large dragon in the sky immediately let out a roar. It widened its large mouth as a dragon aura, dozens of feet large, shot toward Tian Huo zun-zhe in a lightning-like fashion. Faint white-colored ice fragments appeared wherever the dragon’s aura passed.</p><br/><p>Tian Huo zun-zhe’s finger gently cut the space in front of him as he looked at the icy-cold dragon aura that shot over. The air was just like thin paper as it was torn apart. A dark-black spatial crack, that looked just like a pocket, appeared out of nowhere. The dragon’s aura was sucked into it.</p><br/><p>Tian Huo zun-zhe rubbed the crack with his hand after the dragon’s aura was absorbed into it. The spatial line strangely disappeared. He raised his head, aimed his hand at the distant dragon, and suddenly clenched it.</p><br/><p>“Spatial Strangling!”</p><br/><p>The space of the entire place immediately began to fluctuate after Tian Huo zun-zhe’s soft cry sounded. The space around the icy-cold, large dragon swiftly became distorted. Spatial folds could even be vaguely seen.</p><br/><p>“Crack!”</p><br/><p>A dark-black broken layer appeared after the folds revealed themselves. The large dragon’s body was forcefully torn apart by the spatial distortion. After which, it was swallowed into the dark-black crevice.</p><br/><p>The icy-cold dragon immediately roared at the sky after its body broke. Its enormous body carried an incomparable sonic boom as it charged over toward Tian Huo zun-zhe.</p><br/><p>Tian Huo zun-zhe revealed an empty smile as he watched the icy-cold, large dragon charge over. His suddenly clenched his hand!</p><br/><p>Crack! Crack! Crack!</p><br/><p>More space was swiftly distorted. Numerous folds continuously appeared. The location where each fold appeared was the spot where the dragon was located. It had yet to even reach a thousand feet from Tian Huo zun-zhe when its enormous body was shattered into pieces and swallowed into nothingness.</p><br/><p>By the time the icy-cold, large dragon had charged at Tian Huo zun-zhe, only its enormous head remained. Tian Huo zun-zhe extended his hand and pressed it on the dragon’s forehead. With a flick of his finger, that ice dragon was shattered into ice fragments that permeated the sky…</p><br/><p>“ Throwing an egg against a stone, utterly weak…”</p><br/><p>The faces of Tian She and the others immediately turned red the moment the ice dragon was shattered. They spat out mouthfuls of fresh blood at the same time!</p><br/><p>An elite Dou Zun was this terrifying!</p><br/>\n</div>"}