{"title": "Chapter 1101: Qing Hai", "id": 1101, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1101-qing-hai", "volume_title": "Volume 12", "body": "<h1>Chapter 1101: Qing Hai</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1101: Qing Hai</u></strong></p><br/><p>Xiao Yan, who had appeared in front of Protector Wu’s sight, had a face filled with a dense ferocity. There was some faint traces of blood on the corner of his mouth, and his clothes were in tatters. At a glance, he appeared a little miserable. Clearly, the sweeping fire storm earlier had caused him to suffer some injuries. Of course, these little injuries were not worthy of even being mentioned if they were compared to Tian She’s group.</p><br/><p>Protector Wu’s body stiffened in the face of that dense voice. His expression had turned much whiter. He could clearly sense the fierce force brewing in the hand on his neck. If the killing intent in Xiao Yan’s eyes rose, it was likely that Protector Wu would immediately die in his hands.</p><br/><p>Xiao Yan’s left hand wiped away the trace of blood from the corner of his mouth. His eyes did not contain the slightest emotion as they stared at Protector Wu. This Protector Wu from the Hall of Souls had displayed a fierce might on the Misty Cloud Mountain in the Jia Ma Empire back then and had even captured Yao Lao in front of Xiao Yan’s eyes. A couple of years after that incident, he had finally fallen to Xiao Yan’s hands in the most miserable condition…</p><br/><p>“Back then, did you imagine that you would end up in this situation today?”</p><br/><p>Xiao Yan parted his mouth and smiled. However, the smile was dangerous. His soft voice caused a chill to rise in Protector Wu’s heart.</p><br/><p>“If you kill me, the Hall of Souls will definitely make it difficult for you to survive in the Central Plains region. You should clearly be aware that my Hall of Souls is not the Ice River Valley!” Protector Wu forcefully endured the chill within his heart. He hardened his mouth and threatened him in a deep voice.</p><br/><p>Xiao Yan’s eyes glanced over before he indifferently laughed.</p><br/><p>An uneasiness suddenly rose in Protector Wu’s heart when he heard this laugh. Before he could struggle, a hot, invisible flame surged out of Xiao Yan’s palm and swiftly wrapped around him!</p><br/><p>“Ah!”</p><br/><p>The invisible flame had just made contact with Protector Wu’s body when he suddenly emitted a sharp, miserable screech. The special soul-burning effect of the Fallen Heart Flame was painful as torture to the current Protector Wu, who no longer had the protection of that mysterious, black fog…</p><br/><p>A miserable sharp screech resounded over the sky. After which, it spread across the entire Ye City. A countless number of people quietly swallowed a mouthful of saliva.</p><br/><p>Xiao Yan acted as though he did not hear Protector Wu’s miserable screech. His eyes were cold and indifferent as he looked at Protector Wu, who was becoming sluggish within the flame. He only flicked his finger just as Protector Wu’s soul was about the scatter and sucked the flame into his body. At this moment, Protector Wu’s head was drooping. His aura was extremely weak. The waves of searing pain emitted from deep within his soul caused his body to involuntarily twitch.</p><br/><p>“Is it very painful?”</p><br/><p>Xiao Yan looked at the extremely weary Protector Wu. His hand, wrapped around Protector Wu’s neck, increased its strength. A savage expression once again surged up his young face. “The bitterness that teacher has suffered in the Hall of Souls is likely ten thousand times greater than this. Therefore, it is only right that your soul be completely scattered!”</p><br/><p>Protector Wu’s body twitched. After this burning by the Fallen Heart Flame, he did not even possess any strength left to speak. He widened his mouth, but no voice was emitted. If one were to describe his current emotion, it would be a type of regret. This kind of regret was not because he had captured Yao Chen. Instead, the regret was because he had not killed off Xiao Yan with a slap back then!</p><br/><p>The Xiao Yan at that time was just like an ant in his eyes. One slap and he would have easily taken his life. However, there was no medicine for regret in this world. It was due to all the factors back then that had resulted in this current situation…</p><br/><p>“Clap clap!”</p><br/><p>A clear clapping sound suddenly rang out from the sky. Xiao Yan’s eyes followed the sound and glanced over, only to see a smiling Tian Huo zun-zhe and the gloomy-faced Tian Shuang Zi opposite him.</p><br/><p>“It is unexpected… even the old me has miscalculated this time around…” Tian Shuang Zi slowly spoke. His eyes were gloomy as he stared at Xiao Yan.</p><br/><p>Xiao Yan glanced at Tian Shuang Zi. He was just about to speak when waves of weariness were emitted from his body. He knew in his heart that the Skyfire Three Mysterious Flame had already reached the time limit.</p><br/><p>Xiao Yan swiftly took a couple of medicinal pills, that recovered Dou Qi, out of his Storage Ring and stuffed them into his mouth. Only then did his pale-white face appear a little better.</p><br/><p>“Your ability to defeat Tian She’s group by relying on your two star Dou Zong strength has exceeded the expectations of the old me. Unfortunately… my Ice River Valley will not allow any mistake this time around…” Tian Shuang Zi faintly spoke.</p><br/><p>Xiao Yan’s eyes narrowed when he heard his words. A thought passed through his mind and the Earth Demon Puppet a short distance away rushed over with lightning-like speed. After which, it stood guard beside him. At this moment, Xiao Yan’s condition was gradually weakening. There was no telling just how things would develop if another strong enemy were to appear…</p><br/><p>“There is no need to use words to scare the younger generation. You will not be able to act today…” Tian Huo zun-zhe raised his eyes. After which, he glanced at Xiao Yan and said, “You should rest first. Leave this person to me…”</p><br/><p>Xiao Yan slightly nodded when he heard this. His eyes cautiously stared at Tian Shuang Zi. His current condition was unsuitable to continue fighting. If that old fellow were to attack him, it was likely that Xiao Yan would not even be able to last five exchange!</p><br/><p>“Rest? Do you really think that the people from my Hall of Souls can just randomly be captured?”</p><br/><p>An indifferent voice slowly resounded over the sky like a thunderous roar just when Xiao Yan was about to turn around and withdraw, causing a countless number of people to become shocked!</p><br/><p>After this indifferent voice sounded, one could see the cold air barrier, that surrounded Ye City, began to ripple. Immediately, the cold air was forcefully torn apart. A black fog surged in from all directions. After which, it lingered in the sky in front of a countless number of shocked eyes.</p><br/><p>The black fog surged before it slowly faded a moment later. Ten figures were revealed under it. The auras of these ten figures were all quite strong, especially for the figure in the leader’s spot. He was a black-robed, blue-haired, old man. Not even a little energy seeped from his body. However, this entire area shook intensely the moment he appeared…</p><br/><p>“A Dou Zun from the Hall of Souls?”</p><br/><p>Waves of uproars suddenly erupted within Ye City when the ten figures appeared. Quite a number of people revealed dull faces. This Ye City could be called extremely lively today. Experts one would hardly ever see were revealing themselves one after another.</p><br/><p>Xiao Yan’s body also suddenly stiffened when this group appeared. His face instantly became gloomy. He did not expect the people from the Hall of Souls to make it here this moment.</p><br/><p>Tian Huo zun-zhe’s expression had also changed slightly at this moment. His eyes stared firmly at the blue-haired, old man. Other people might not be able to sense his aura, but he was clearly able to sense it.</p><br/><p>“This person’s strength is even greater than Tian Shuang Zi in front. It is likely that he has reached the strength of a two star Dou Zun. Today… the situation is becoming worse.”</p><br/><p>Compared with Xiao Yan’s and Tian Huo zun-zhe’s expressions, Tian Shuang Zi’s face revealed a smile at this moment. He glanced at Tian Huo zun-zhe’s expression and his heart involuntarily felt a little joyful. He cupped his hands to the blue-haired, old man and laughed, “Ke ke, it is actually Qing Hai zun-zhe. It is unexpected that this problem has even alarmed a great person like you…”</p><br/><p>“Tian Shuang Zi, it has been a long time since we have last met. How do you do…” The blue-haired, old man, who was addressed as Qing Hai, cupped his hands to Tian Shuang Zi. He said with a faint smile, “I have merely received an urgent message. This venerable self is coincidentally leading some people to perform a task. I have come out of curiosity after receiving the message…”</p><br/><p>“Honorable Elder Qing Hai, quickly capture Xiao Yan. He is someone whom the Hall Chief has personally ordered to be captured!”</p><br/><p>Protector Wu, who was being grabbed in Xiao Yan’s hand, also appeared to have gained some sanity just before his death after seeing the appearance of Qing Hai. A hoarse, low roar was shouted from his throat with all his might.</p><br/><p>Xiao Yan’s eyes turned cold. An invisible flame surged out and wrapped around Protector Wu. After which, he took out a jade bottle from his Storage Ring and stuffed Protector Wu into it with his miserable screams. Xiao Yan’s finger then rubbed the mouth of the bottle and formed a fire seal.</p><br/><p>Xiao Yan tossed the jade bottle into his Storage Ring. His eyes were ice-cold as he looked at Qing Hai’s group in the distance.</p><br/><p>Qing Hai’s muddled eyes slightly narrowed upon seeing that Xiao Yan had sealed Protector Wu in front of his own eyes. His eyes revealed some surprise as he stared at Xiao Yan and questioned, “You are that Xiao Yan?”</p><br/><p>Xiao Yan did not reply to his words. He shifted his feet and moved himself behind the Earth Demon Puppet.</p><br/><p>“Ke ke, how unexpected… you dare to swagger about despite being the target of the Hall of Souls. This courage of yours is really not bad…” Qing Hai laughed when he saw that Xiao Yan did not reply. He shook his head and spoke somewhat lazily, “Release that fellow. You should also make a trip to the Hall of Souls with this venerable self…”</p><br/><p>Tian Huo zun-zhe’s face sank when he heard Qing Hai’s words. His body was just about to move when Tian Shuang Zi in front of him followed close behind. He appeared just like Tian Huo zun-zhe’s shadow, holding him back at the same time.</p><br/><p>“Get lost!” Tian Huo zun-zhe’s expression was gloomy as he coldly cried out.</p><br/><p>“Ke ke, I will not mind doing so if you have the ability…” Tian Shuang Zi faintly laughed. After which, he said to Qing Hai zun-zhe. “This person is also a companion of Xiao Yan. However, you can just leave him to the old me. You can just focus on capturing that brat.”</p><br/><p>Qing Hai’s turbid eyes swept over Tian Huo zun-zhe. Surprise flashed across them. Immediately, he nodded and laughed, “In that case, I shall trouble you. This venerable self will come and aid you after capturing Xiao Yan.”</p><br/><p>Tian Shuang Zi nodded with a grin. He looked at Tian Huo zun-zhe across from him, whose face was gloomy. A dense smile flashed across Tian Shuang Zi’s eyes.</p><br/><p>Qing Hai withdrew his eyes from Tian Huo zun-zhe. After which, they slide to the ice-cold face of Xiao Yan. With a faint smile, he gently pressed his foot against the empty air and the space in front of him swiftly became distorted…</p><br/><p>This action of Qing Hai caused Xiao Yan’s expression to slightly change. His body quickly withdrew. However, a crazy expression flashed across his eyes while his body was swiftly withdrawing!</p><br/><p>Xiao Yan’s body had just pulled back when the space in front of him became distorted. Immediately, Qing Hai zun-zhe’s body appeared. A shriveled hand was clenched and the space around Xiao Yan instantly solidified, locking Xiao Yan in place.</p><br/><p>This solidified space was something that Xiao Yan would naturally be able to escape from should he be in his peak condition. However, after having used the Skyfire Three Mysterious Change he was in his weakest moment. How would he be able to escape…</p><br/><p>“Little fellow, there is not a single person my Hall of Soul wants but cannot obtain…”</p><br/><p>Qing Hai’s face wore a smile as he slowly stepped through the empty air. He walked toward Xiao Yan. After which, he paused in front of Xiao Yan. He extended his hand and grabbed at the top of Xiao Yan’s head!</p><br/><p>The crazy expression in Xiao Yan’s eyes grew denser as he watched the hand come closer. The few types of Heavenly Flames within his body began to swiftly merge…</p><br/><p>Just when Qing Hai’s hand was about to reach the top of Xiao Yan’s head, the surrounding solidified space was suddenly shattered. A mightier spatial strength spread out with lightning-like speed. Even Qing Hai’s body showed some signs of sluggishness at this moment.</p><br/><p>The space solidified as an elegant, white-clothed figure slowly appeared in front of Xiao Yan in front of a countless number of eyes. A bone-chilling voice reverberated across the sky.</p><br/><p>“Hurt him and you will die!”</p><br/>\n</div>"}