{"title": "Chapter 1117: Repaying Debt", "id": 1117, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1117-repaying-debt", "volume_title": "Volume 12", "body": "<h1>Chapter 1117: Repaying Debt</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1117: Repaying Debt</u></strong></p><br/><p>A calm voice slowly resounded over the sky. After which, it gently spread…</p><br/><p>The dozen plus Black Submerged Army members, who were Ling Quan’s subordinates, were stunned. They had never expected Ling Quan to be this miserably defeated in Xiao Yan’s hands. They had clearly seen the lightning-like exchange earlier. Xiao Yan didn’t even use a single Dou Technique since the beginning!</p><br/><p>In other words, Xiao Yan had relied on the Dou Qi within his body, yet not only did he block all of Ling Quan’s Dou Techniques but he had captured Ling Quan in a lighting-like fashion after only a couple of exchanges!</p><br/><p>The shock that had been formed by this scene was considerably great to them!</p><br/><p>“This… he is the trash of the Xiao clan that commander Ling Quan spoke of? Such strength… even among the members of the younger generation of the Gu clan, he could be ranked within the top ten!”</p><br/><p>The dozen plus people faced each other. All of them saw a shocked expression in each other’s eyes. Xiao Yan’s simple attack had given them a great shock.</p><br/><p>“This little fellow’s fighting experience is much greater than Ling Quan’s fighting experience. Moreover, his Dou Qi is sturdy. At one glance, one can tell that he is someone with a very strong foundation. Ling Quan’s strength was obtained after having undergone the Di altar baptism. Moreover, it has not been tempered much after the baptism. Compared to Xiao Yan’s Dou Qi, his Dou Qi is extremely faint…”</p><br/><p>The black-clothed elders slowly nodded after watching the scene in the sky. Their voices contained some praise. From the sturdiness of Xiao Yan’s Dou Qi, they could tell that he had truly relied on himself to train one step at a time. A person with such tough character would definitely advance much further on the training road compared to Ling Quan in the future.</p><br/><p>“This fellow Ling Quan has really sough out his own humiliation this time around…”</p><br/><p>Xun Er by the side did not feel the least bit surprised by the lightning-like battle earlier. She had a impeccable understanding of Xiao Yan’s strength. Ling Quan had been blessed with outstanding talent since he was young. Although he had undergone the elite training of the Gu clan, he had seldom experienced a life and death duel. His combat experience was just like that of the Heavens and the Earth when compared with Xiao Yan. Normally, it was not possible to tell anything from one’s aura, but the gap between the two was clearly revealed now that they had fought.</p><br/><p>Ling Quan’s expression had turned ashen because of Xiao Yan’s evaluation, which was filled with pity. His body continuously trembled. A moment later, his face suddenly turned as red as blood. The Dou Qi within his body turbulently surged!</p><br/><p>“Roar!”</p><br/><p>Ling Quan’s face was as bright-red as blood. His aura had also suddenly soared at this moment. A majestic, silver-colored Dou Qi agglomerated in his palm in a lightning-like fashion. Innumerable silver snakes wiggled all over the place. His palm subsequently shook and violently smashed toward Xiao Yan’s hand.</p><br/><p>“Bang!”</p><br/><p>Ling Quan’s sudden change had caused Xiao Yan to slightly lift his eyebrows. His hand curled as he narrowly dodged the hand of Ling Quan that flew over. His right hand was tightened into a fist as he punched toward Ling Quan’s chest with lightning-like speed!</p><br/><p>“Bang!”</p><br/><p>The lightning glow on the surface of Ling Quan’s body hovered before rapidly rotating. It formed a half-foot-large lightning shield in front of his chest in the blink of an eye, completely blocking this punch from Xiao Yan in the process.</p><br/><p>“Do you think that you, trash from the Xiao clan, has the qualification to evaluate this commander?”</p><br/><p>The lighting shield formed wave after wave of ripples as it blocked the force on Xiao Yan’s fist. Ling Quan’s face had become unusually ferocious at this moment. Blood lingered in his eyes, causing him to appear quite terrifying.</p><br/><p>“Secret Technique?”</p><br/><p>Xiao Yan’s eyes narrowed as he sensed the aura of Ling Quan, which had suddenly soared. His body flashed and he nimbly took over a dozen steps back.</p><br/><p>“Transforming Blood Skill? This fellow really doesn’t want to live. He has even used this kind of self-harming Secret Technique.” The expressions of the black-clothed elders in the courtyard involuntarily sank when they saw this. Immediately, their gazes turned to Xun Er as they asked, “Young miss?”</p><br/><p>“There is no need to bother about him…” Xun Er shook her head. The corner of her mouth contained a faint, cold smile, “He is merely seeking his own humiliation.”</p><br/><p>A lightning glow flashed all over Ling Quan’s body in the sky. A blood-red thing was vaguely seeping out. His gaze stared savagely at Xiao Yan as he clenched his fist. A lightning long-spear, filled with traces of blood, slowly appeared.</p><br/><p>Xiao Yan watched Ling Quan, who was carrying a frightening momentum. His eyebrows were vaguely knitted. The Secret Techniques of the Gu clan was quite strong. Currently, the strength of this fellow should be close to the level of a seven star Dou Zong…</p><br/><p>“However, regardless of how strong the Secret Technique is, it is completely useless if one does not possess a firm foundation. Until now, you have yet to reach even half of my expectations…”</p><br/><p>Xiao Yan slowly shook his head. He had indeed overestimated this Ling Quan a little. Although Ling Quan’s strength had reached that of a five star Dou Zong, from the way Xiao Yan looked at it, he was at the very most similar to a four star Dou Zong. If he did not possess the help of those high class Dou Techniques, even some three star Dou Zongs with a strong foundation could fight with him for over a hundred exchanges.</p><br/><p>Ling Quan had used a Secret Technique and forcefully raised his strength to that of the peak of a six star Dou Zong, near that of the seventh star level. However, in the eyes of Xiao Yan, who had used the first change of the Skyfire Three Mysterious Change, Ling Quan still did not pose much of a threat.</p><br/><p>“What do you consider yourself? Once this commander captures you, I will personally treat this mouth of yours!”</p><br/><p>Xiao Yan’s words had caused the ferocity within Ling Quan’s eyes to become denser. A moment later, he finally let out a dense smile. His body trembled and disappeared from the spot…</p><br/><p>Xiao Yan slowly shook his head after seeing Ling Quan’s figure disappear. His feet suddenly but gently shifted half a step to the left.</p><br/><p>“Chi!”</p><br/><p>After his feet had just shifted, the space behind Xiao Yan suddenly rippled and a lightning-like spear penetrated out of it like a bolt of lightning. After which, it brushed by Xiao Yan’s shoulder and flew past…</p><br/><p>The body of the spear suddenly shook after it missed. Immediately, it curled into a strange arc as it ruthlessly shot toward Xiao Yan’s head.</p><br/><p>Xiao Yan’s expression did not change. He leaned his head back and the long-spear skimmed past his face. His feet stomped on empty space at the same time, and his body rotated swiftly like a gyroscope. Soon after, an extremely forceful kick was ruthlessly swung at the empty space beside him!</p><br/><p>“Bang!”</p><br/><p>The kick flew out and a ripple was formed from the empty space. Ling Quan’s body flashed and appeared. A lighting glow shield once again appeared in front of him. However, this shield was unable to block all the force. The remaining strength still shook Ling Quan until he miserably took a couple of steps back.</p><br/><p>Ling Quan’s expression had become dark and solemn after his body pulled back. With the help of his withdrawing momentum, the seal on his hands once again changed and a majestic Dou Qi was swiftly formed on his palm!</p><br/><p>Xiao Yan narrowed his eyes upon seeing this. His body moved, transforming into a blurry black line that rushed out. After suffering from the last loss, Ling Quan no longer dared to approach Xiao Yan. His hand released the lightning long-spear, and his body formed a half-rotating stance. At the same time, his feet ruthlessly kicked the handle of the long spear!</p><br/><p>Chi!</p><br/><p>The lightning long-spear was just like a silver dragon. Borrowing this fierce force, it shot toward Xiao Yan in a ferocious manner!</p><br/><p>Xiao Yan’s figure paused as he watched the silver glow shooting over. An afterimage remained while his body suddenly accelerated. His body leaped, and his toes accurately pressed on the body of the long-spear. After slight contact, Xiao Yan’s body appeared in front of Ling Quan in a ghost-like manner.</p><br/><p>“Sea Flipping Seal!”</p><br/><p>Xiao Yan had just materialized when a chilly glow flashed across Ling Quan’s eyes. The energy-crystal-like handprint ruthlessly smashed toward Xiao Yan’s front.</p><br/><p>Ling Quan’s handprint was swiftly expanded in Xiao Yan’s dark-black eyes. Xiao Yan’s head suddenly turned with great surprise. At the same time, his palm rushed out from beside his ear as he extended his hand. After which, his elbow ruthlessly cut forward like a blade!</p><br/><p>“Crack!”</p><br/><p>Xiao Yan’s elbow was covered by a jade-green flame as it ruthlessly smashed against Ling Qian’s wrist. The powerful force caused Ling Quan’s wrist to emit a clear bone-cracking sound.</p><br/><p>Xiao Yan’s attack was ruthless and swift. He did not even allow Ling Quan to react even a little as his elbow smashed Ling Quan’s wrist. A merciless expression also flashed across his eyes as his fist, that was covered by a jade-green flame, ruthlessly smashed toward Ling Quan’s face.</p><br/><p>Before Ling Quan’s miserable cry could be emitted, because of the intense pain that was transmitted from his wrist, the hot and fierce wind, that blew in front of him, caused his head to be covered with cold sweat. During this short dozen plus exchanges with Xiao Yan, he could truly be considered to have experienced what it meant by staking one life to take another. Moreover, the thing that caused Ling Quan’s heart to become cold was that only Xiao Yan was attempting to take another’s life during the entire fight. Each time Ling Quan attacked, Xiao Yan would dodge right at the most dangerous and critical moment!</p><br/><p>“Bang!”</p><br/><p>The fist that was wrapped by jade-green flame was just about to strike Ling Quan when a lightning barrier once again appeared. It barely managed to block the punch amid a low and deep sound.</p><br/><p>Before Ling Quan could relax after having blocked Xiao Yan’s attack, he was shocked to find so many fist shadows suddenly appearing in front of him. The fierce and vicious force contained in each fist shadow caused his heart to tremble.</p><br/><p>Bang! Bang! Bang!</p><br/><p>The fist shadows poured onto the light shield in front of him like a storm, causing ripples to continuously form. A moment later, a ‘boom’ finally sounded. The shield burst apart under this clear sound!</p><br/><p>“Bang!”</p><br/><p>A coldness appeared in Xiao Yan’s eyes when the lightning shield was blasted apart. Xiao Yan’s fist changed, and it ruthlessly slammed into Ling Quan’s face with his shocked eyes.</p><br/><p>“Grug!”</p><br/><p>Xiao Yan’s fist landed firmly, causing Ling Quan to spit out a mouthful of fresh blood along with a couple of teeth. His body violently shot backwards like a bird with its wings broken. After which, he heavily collided into a wall of the courtyard. The frightening force shook the wall until it collapsed. Rock fragments flew in all directions, transforming into a pile of rubble…</p><br/><p>Xiao Yan was expressionless. His body flashed, and he landed from the sky. A leg ruthlessly shot out and kicked the pile of rubble. A sharp miserable scream sounded after a deep, dark hole was formed.</p><br/><p>Xiao Yan’s foot slowly landed on the rubble. He curled his hand and a suction force surged out. Many rock fragments were shattered. After which, Ling Quan, who was covered in fresh blood, was revealed under the rock fragments. After glancing at Ling Quan, Xiao Yan grabbed with his hand and sucked Ling Quan into his palm from across space.</p><br/><p>“Commander Ling Quan, does this trash of the Xiao clan possess the qualification to evaluate you?”</p><br/><p>Xiao Yan’s hand gently held Ling Quan’s neck. Currently, all he needed to do was use a little strength and this commander of the Black Submerged Army, who had acted arrogantly in front of him back then, would lose his life!</p><br/><p>Ling Quan struggled for a moment as he looked at the smiling face. His eyes finally revealed some terror. He recalled that Xiao Yan had never even used one Dou Technique in this fight with him!</p><br/><p>This was a kind of contempt, but even though this was the case, Ling Quan still lost… moreover, he had lost so miserably…</p><br/><p>Only at this moment did he understand that the Xiao Yan, standing in front of him, was no longer that small Dou Ling from the Inner Academy back then…</p><br/><p>A river flows thirty years west and thirty years east. One should never look down on a young person…</p><br/><p>TL: Never look down on the young as they got a lot of time to grow</p><br/><p>Today, it was his turn to repay the debt from back then.</p><br/>\n</div>"}