{"title": "Chapter 1126: Spiritual States", "id": 1126, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1126-spiritual-states", "volume_title": "Volume 12", "body": "<h1>Chapter 1126: Spiritual States</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1126: Spiritual States</u></strong></p><br/><p>This kind of change was not obvious, but it gave Ye Zhong’s group a kind of strange feeling. It appeared as though Xiao Yan, who was in front of them, had become more dazzling than before he had undertaken the retreat.</p><br/><p>The Little Fairy Doctor and Tian Huo zun-zhe were also a little startled because of this change. The Little Fairy Doctor was still fine but Tian Huo zun-zhe seemed to have fallen deep into thought…</p><br/><p>Xiao Yan was a little surprised upon seeing so many people outside the door after he walked out of the training room. He helplessly shook his head and questioned, “Elder Ye Zhong, there is no need for such grandness, is there?”</p><br/><p>“Ke ke…” Ye Zhong hurriedly recovered upon hearing his words. He laughed before waving his hand and scattering the clan members who had gathered here. With a smile, he said, “Mister Xiao Yan. We will begin our journey to the Holy Pill City tomorrow. Are you prepared?”</p><br/><p>Xiao Yan nodded. It was unexpected that time had passed so quickly during his retreat. Nearly a month had passed within the blink of an eye.</p><br/><p>“Mister Xiao Yan, nothing is wrong with you, is there?” Ye Zhong glanced at Xiao Yan. He seemed to vaguely sense a kind of faint pressure when he was close to Xiao Yan. This kind of pressure seemed originate from deep within his soul, causing him to find it difficult to ignore.</p><br/><p>Xiao Yan revealed an uncertain expression in the face of Ye Zhong’s question. He frowned and asked, “What can happen to me?”</p><br/><p>From the way Xiao Yan acted, it seemed he was unaware of the slight change.</p><br/><p>Ye Zhong was somewhat stunned when he saw Xiao Yan’s lost manner. Could it be that he was mistaken?</p><br/><p>“It is not that you are mistaken. This fellow’s Spiritual Strength seems to have risen during this retreat…” Tian Huo zun-zhe finally shifted his eyes away from Xiao Yan. He smiled as he spoke.</p><br/><p>“Spiritual Strength?”</p><br/><p>Xiao Yan was stunned when he heard this. He immediately fondled his chin and mused, “Now that you mention it, I seem to have suddenly found it much easier to refine pills when compared to before. Moreover, my control over the flame has become even more exquisite as well… However, can’t Spiritual Strength only grow when one’s level increases? My strength is currently still at the level of a four star Dou Zong. It is only a little more stable compared to when I had just advanced to it…”</p><br/><p>Tian Huo zun-zhe glanced at Xiao Yan with a strange expression. A moment later, he finally raised his eyebrows and said, “Looks like that teacher of yours did not inform you about matters relating to Spiritual Strength… but this is only natural. An ordinary person can only bend according to this exceedingly mysterious thing known as the the soul. They cannot control it. Even the you only knew how to control your Spiritual Strength, but you do not have a deep understanding of it…”</p><br/><p>Xiao Yan and Ye Zhong pondered Tian Huo zun-zhe’s words. Xiao Yan came to a sudden but complete understanding while Ye Zhong continued frowning. This argument was something that he had seen in some of the ancient books in the clan.</p><br/><p>“Spiritual Strength does not have a difference in grade but it possesses a difference in state…”</p><br/><p>Tian Huo zun-zhe faintly smiled and explained, “Of course, very few people these days have heard this statement because this kind of Spiritual State is something that most experts cannot touch over their entire lives. Do you know why so many alchemists have remained at the seventh tier all their lives? It is because of this Spiritual State…”</p><br/><p>“Spiritual State…”</p><br/><p>Xiao Yan frowned. He had really never heard of this thing. However, the soul is the source of life. Nothing will exist without the soul. If one’s soul was not destroyed, one would still possess a thread of life. Anyone would maintain a healthy respect for this kind of mysterious thing.</p><br/><p>However, Xiao Yan only knew that his Spiritual Strength was quite strong. He understood little else. Moreover, Xiao Yan had only reached the level of a tier 5 alchemist back when Yao Lao was captured. At that time, he was unqualified to learn about whatever Spiritual State. He had lacked the teaching of Yao Lao during these few years, causing him to be completely unaware of some of the information related to peak level alchemists. This so-called Spiritual State was one of those things…</p><br/><p>“What I have said is likely something that only alchemist grandmasters who have reached the eighth tier know. Otherwise, one could only find information in some ancient books…” Tian Huo zun-zhe slowly explained. If he had not been from this era, it was likely that he would have been unable to provide Xiao Yan with an explanation.</p><br/><p>“The Spiritual States are divided into four levels. The Mortal State, Soul State, Heavenly State, and Di (God) State… most people, even alchemists who are below the eighth tier, remain at the Mortal State. There is only slight variations in might between most people’s Spiritual Strengths. In the past, you were at this level but just much stronger than an ordinary person…</p><br/><p>“With luck, some tier 7 alchemists may be able to vaguely touch the Soul State. If a person’s Spiritual Strength has reached this level, it will gain a certain effect. That effect is to endow a soul, providing a medicinal pill with spirituality… you should be aware that most tier 8 medicinal pills possess a spirituality. It is due to this spirituality that enables them to reach the eighth tier. Regardless of how outstanding the pill refinement Technique of an ordinary alchemist is, the medicinal pill that they create will never reach the eighth tier if they are unable to provide the pill with a spirit…</p><br/><p>“Heavenly State, you should be aware that when it comes to a tier 9 medicinal pill, its intelligence will not be any different from an ordinary person. This is equivalent to a kind of creation, the creation of life. One must not only provide it with spirituality, but one must also have the might of nature. In order to achieve this, one would need to reach the almighty Heavenly State. It is likely that very few people on this continent can achieve this level…</p><br/><p>“As for the Di State… this only exists in legends. Even I have only heard of it. However, I think you should be aware of the top tier of the Spiritual States… Di (God) tier. All that I can tell you is that this state is related to the Di tier medicinal pill. The Di tier medicinal pill… is related to the legendary Dou Di.</p><br/><p>“However, it is not known just how many people have failed to reach this state…”</p><br/><p>Tian Huo zun-zhe’s voice was regretful when he finished speaking. However, Xiao Yan’s group was no longer able to sense the regret in his voice. The few of them had been shaken into a giddy state by the words Tian Huo zun-zhe had uttered.</p><br/><p>Other than Ye Zhong, who had some vague memory of Spiritual States, everyone else, even The Little Fairy Doctor, felt a little lost. She had just advanced to the Dou Zun class. In terms of experience, she was unable to compete with an old demon like Tian Huo zun-zhe.</p><br/><p>“This… it seems that I have also read these theories in some ancient books. However, they did not describe it in such detail like old mister Yao. When I saw them back then, I thought that they were merely a fallacy and did not pay much attention to them…” Ye Zhong finally recovered after a while. He spoke in a somewhat vexed manner. “My Ye clan ancestor was also a tier 8 alchemist back then. However, he did not leave behind any information regarding Spiritual States…”</p><br/><p>“The soul is an extremely mysterious existence. Some alchemists would be at a complete loss even if they broke through because of a lucky opportunity…” Tian Huo zun-zhe glanced at Xiao Yan and said, “The previous you did not have the qualification to come into contact with this information. I originally thought that your teacher would have told you about it. However, seeing your appearance, it seems that I inferred poorly…”</p><br/><p>Xiao Yan bitterly laughed and explained, “I was merely a tier 5 alchemist when teacher fell into the hands of the Hall of Souls. How could I come into contact with such information…”</p><br/><p>“Your current Spiritual State seems to have touched the Soul State. When you can enter the Soul State will depend on how blessed you are… it is rumored that there was a special training method for training one’s spirit during the ancient times. It is called Soul Technique. However, it has clearly been lost because even I have never seen anything about the so-called Soul Technique…” Tian Huo zun-zhe laughed.</p><br/><p>“The spirit can be trained?” Xiao Yan immediately cried out in surprise upon hearing this. His face was filled with disbelief. On the current Dou Qi continent, one’s soul could only be strengthened along with the increase of one’s might. Alternatively, one could consume some natural treasures, but being able to train it through a training method was something that Xiao Yan had never heard of.</p><br/><p>“I have already said that it was during the ancient times…” Tian Huo zun-zhe rolled his eyes as he replied.</p><br/><p>Xiao Yan bitterly smiled and shook his head upon seeing him roll his eyes. Training one’s spirit. This was really a little too unbelievable. Xiao Yan was not too interested in whatever Soul State. His crazy pill refinement during his retreat had caused his head to remain in a semi-conscious state, which resulted in some tier 7 high grade medicinal pills failing despite having a chance to succeed. However, he felt that something was not quite right now that he thought of it. He had clearly sensed that he had become a little more familiar with refining tier 7 high grade medicinal pill…</p><br/><p>“Looks like I will need to find an opportunity to study it properly in the future. If I wish to advance into the eighth tier, I will need to comprehend these so-called Spiritual States…”</p><br/><p>Xiao Yan mused in his heart. Tian Huo zun-zhe’s words had undoubtedly opened a new world for him to explore. Only now did he understand that the soul was related to the advancement beyond that of a tier 7 alchemist…</p><br/><p>“No wonder there are so many tier 7 alchemists while tier 8 alchemists are so rare… it is likely that some tier 7 alchemists are not aware of the so-called Spiritual States.”</p><br/><p>“However, it would be best if I am able to obtain a kind of Soul Technique that enables me to train my soul. With this thing, I should be able to advance to the Soul State in a much smoother manner. Unfortunately… it has already been lost…” Xiao Yan’s heart was filled with regret when he thought about this. The loss of these Soul Techniques might be the main reason why the current generation of alchemists had difficulty advancing to the eighth tier.</p><br/><p>“I wonder if the Pill Tower possesses a Soul Technique? By being able to become the holy ground in the hearts of a countless number of alchemists, it is likely not an ordinary place. Hopefully, I will be able to obtain some news regarding a Soul Technique on my trip to the Holy Pill City. Who knows when this kind of thing will appear…”</p><br/><p>Xiao Yan sighed. He had made up his mind. During this trip of his to the Holy Pill City, finding a Soul Technique would be an important task!</p><br/>\n</div>"}