{"title": "Chapter 1132: Tier 7 Middle Grade Alchemist", "id": 1132, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1132-tier-7-middle-grade-alchemist", "volume_title": "Volume 12", "body": "<h1>Chapter 1132: Tier 7 Middle Grade Alchemist</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1132: Tier 7 Middle Grade Alchemist</u></strong></p><br/><p>The atmosphere within the room had become unusually quiet because Xiao Yan’s earlier sentence. Their eyes were stunned as they looked at Xiao Yan. It was a moment later before the shock disappeared and slowly transformed into scoff…</p><br/><p>“Hee hee, Ye Zhong, since when has your members of the Ye clan started playing this kind of grand tactic? This is the testing point of the Pill Tower. It is not your Ye clan’s testing area…” The gray-clothed, old woman coldly laughed after being the first to recover.</p><br/><p>The three young man and woman from the Bai clan by her side turned their mocking eyes to Xiao Yan after the old woman’s cold laugh rang out. It appeared as though they were watching a show. None of them believed that this little fellow, who had never come to the Pill Tower, would possess the qualification to take the test for a tier 7 middle grade alchemist badge.</p><br/><p>Although the three people from the Qiu clan did not laugh like the Bai clan, their eyes swept across Xiao Yan with some doubt. Clearly, they also thought that this little fellow was bluffing.</p><br/><p>“This place will not tolerate you joking around. Are you certain you wish to take the test for a tier 7 middle grade badge?” The white-haired, old man also revealed a shock in his eyes as he looked at Xiao Yan. Immediately, his expression became solemn as he asked in a deep voice.</p><br/><p>While the white-haired, old man spoke, his eyes also turned to Ye Zhong beside Xiao Yan. The shock in his heart involuntarily became even more intense upon seeing the slight smile on Ye Zheng’s face. Could this little fellow really possess such an ability? Such a young tier 7 alchemist. This was a little incredible!</p><br/><p>“Yes.” Xiao Yan continued to nod upon hearing the deep voice of the white-haired, old man. He immediately cupped his hands together and asked, “I will be troubling Elder Han. May I know what steps are needed in order to take the test for a tier 7 middle grade alchemist?”</p><br/><p>The expression of the white-haired, old man also became graver after hearing Xiao Yan’s insistence. If Xiao Yan was not a fool, he would not use this test to seek his own humiliation in such a situation. Even though this was the case, he really felt some disbelief in his heart…</p><br/><p>“Since you insist, we will do as you say. Hopefully, you are not joking around. Additionally, you can just call me Deacon Han. I am unworthy of the title Elder…” Han Li slowly nodded as he replied.</p><br/><p>“Chi…”</p><br/><p>Xiao Yan smiled and nodded. However, a snicker sounded from the side. He turned his gaze, only to see the cold woman from the Bai clan. The corner of her mouth contained a chilly ridicule. Clearly, she despised Xiao Yan’s actions.</p><br/><p>According to normal circumstances, she was the one being tested for the highest tier among those present. She would naturally be the most dazzling person within this special examination room. However, this kind of situation where she was the center of attention had been broken by Xiao Yan’s random disturbance. Her heart was naturally a little displeased. Moreover, in her heart, she felt that Xiao Yan was attempting to act grand by taking the test for the tier 7 middle grade badge. With the Ye clan declining to a point where it could not decline further, how could it be possible for such talent, which even the Bai clan could not compete with, to appear…</p><br/><p>Xiao Yan merely smiled in the face of a certain woman’s laugh that was full of contempt. What he had experienced was far from what this woman, who had been greatly sought after within the clan could imagine. His mental state would not be affected by this kind of childish enmity and disdain from her.</p><br/><p>“Since everyone has already decided, we should begin…”</p><br/><p>Han Li waved his hand. After which, he pointed at the four doors behind him. Each of these four doors had their own ancient words above them. They were ‘Tian, Di, Xuan, Huang…’</p><br/><p>“Those taking the test for the tier 6 middle grade should enter the Xuan room. The one taking the high grade should enter the Di room…” Han Li’s gaze turned to Xiao Yan after saying those words. He said, “As for you, you will wait for their test to finish. After which, I will personally lead you into the Tian room and personally conduct the test for you.”</p><br/><p>Xiao Yan titled his head in acknowledgment.</p><br/><p>“Everyone else should enter their respective rooms…” Han Li nodded and commanded after seeing that no one had any objections.</p><br/><p>Hearing this, the other five people from the Bai and Qiu clan, with the exception of Xiao Yan, separated and entered the rooms that represented their level. The white-clothed, cold lady appeared like an arrogant swan as she entered the Di room alone. The remaining four people entered the Xuan room.</p><br/><p>The place gradually became quiet after the five people entered the rooms. Xiao Yan stood there. His eyes swept around him before he shut them to recuperate.</p><br/><p>That old woman from the Bai clan glanced at Xiao Yan. She spoke in a sharp tone, appearing to be dissatisfied with the silence. “Ye Zhong, the young people that your clan teaches these days are really becoming arrogant. No wonder you are unable to find any members of the younger generation you can use these days…”</p><br/><p>Ye Zhong coldly smiled and replied, “Using one’s position to bully others. It is just that the old me does not wish to argue with you. With your tier 7 low grade level, you do not have the qualification for the old me to pay attention to you. Did you not forget your disgusting mannerisms when my Ye clan was strong back then?”</p><br/><p>Ye Zhong’s fierce retort caused the old woman’s face to instantly become green. Her eyes were dark and dense as she stared at Ye Zhong. She laughed sharply, “Alight, I will remember these words of yours. Once your Ye clan is removed from the five great clans, I will let you regret the words that you have said today!”</p><br/><p>The old man from the Qiu clan by the side slightly frowned. Although he also looked down on the Ye clan, which was in decline, it did not reach the point of adding insult to injury. After all, all clans rose and fell. No one could guarantee that the other party would not rise again…</p><br/><p>“Noisy, not only are the young from the Bai clan uneducated but even the old are the same!”</p><br/><p>Ye Zhong’s expression was gloomy in the face of the sharp voice from the gray-clothed, old woman. Before he could speak, Xiao Yan opened his eyes. He coldly glanced at the woman and faintly spoke.</p><br/><p>“Little bastard, who do you think you are? You dare to speak to me in this manner!”</p><br/><p>Xiao Yan’s words caused the face of the gray-clothed, old woman to turn dark and chilly. Ye Zhong’s strength was a little stronger than hers. Therefore, she was able to endure a little of his cold mockery. However, this Xiao Yan was merely a member of the younger generation in her eyes!</p><br/><p>The body of the gray-clothed woman moved after uttering these words. She rushed forward very quickly, and her sharp nails ruthlessly pierced toward Xiao Yan’s throat like blades!</p><br/><p>Xiao Yan’s dark-black eyes looked at the old woman rushing over. He narrowed his eyes and slowly clenched his hands under his sleeves. The Dou Qi within his body was flowing at this moment. He did not mind giving this noisy old woman a lesson she would not forget in this place…</p><br/><p>“Stop!”</p><br/><p>Just when the Dou Qi within Xiao Yan’s body surged and he was prepared to attack, a human figure suddenly flashed and appeared in front of him. He cried out in a deep voice, “This is a branch tower of the Pill Tower, not your Bai clan. You better keep yourself in check!”</p><br/><p>The gray-clothed, old woman’s expression changed when she saw Han Li was blocking in front of Xiao Yan. Her body immediately moved, and she took two steps back. Her gaze was dense as she stared at Xiao Yan and said, “Little bastard. You better not let this old me find you alone. Otherwise, I do not mind letting the Ye clan lose a member of the younger generation…”</p><br/><p>When she finished speaking, the old woman’s dark and cold eyes slid to Ye Zhong, who had not moved.</p><br/><p>A strange smile surfaced on Ye Zhong’s face in the face of the old woman’s dark and dense eyes. If this old woman were aware that even Tian She from the Ice River Valley had been beaten by Xiao Yan to the point of being seriously injured, would she have the courage to utter these words?</p><br/><p>Xiao Yan’s eyes were calm as they glanced at the gray-clothed woman. He slowly spread his hands under his sleeves with his palms facing up. If Han Li had not suddenly intervened, it was likely that this hateful old woman would no longer have the strength to say anything by now…</p><br/><p>Xiao Yan’s calm, disregardful gaze resulted in the gray-clothed, old woman feeling an urge to twitch the corner of her eye. This brat… although he did not speak much, each and every action he made was filled with an endless amount of arrogance. This point also caused Xiao Yan to appear displeasing in her eyes.</p><br/><p>The eyes from the old man from the Qiu clan also paused on Xiao Yan’s body. He immediately shook his head as he quietly sighed in this heart. This member of the younger generation from the Ye clan really could not make it. Offending an expert from the Bai clan in such a place was really not a logical thing to do…</p><br/><p>The room had become much calmer after Han Li appeared. However, the eyes of the gray-clothed, old woman became denser as she looked at Xiao Yan. They caused one to feel somewhat chilled…</p><br/><p>“Creak…”</p><br/><p>This unusually quiet atmosphere continued for an unknown amount of time before the tightly shut Xuan door was slowly opened. Four people slowly walked out. Other than one person, whose face was flushed red, the chests of the remaining three had a badge on them. A flame was winding around the badge, forming a tower shape. There were six purple-gold stars emitting a glaring glow on it.</p><br/><p>If one were to carefully observe these six purple-gold stars, one would discover that the sixth star was a little dimmer compared to the previous five stars. This was the indication of the middle grade. If it was the low grade, the star would be even dimmer. However, if it was the high grade, the star would be as bright as the other stars…</p><br/><p>“The tier 6 middle grade test has completed. Two people from the Qiu clan have passed while one person from the Bai clan has passed…” Han Li glanced at the four of them before slowly speaking.</p><br/><p>A smile surfaced on the face of the old man from the Qiu clan upon hearing this while the gray-clothed, old woman frowned. She viciously started at the man who had failed to pass the test.</p><br/><p>Soon after these words from Han Li sounded, the tightly shut Di door was slowly opened. A white-clothed woman slowly walked out with arrogant footsteps. Her voluminous chest had a flickering badge. There were six bright purple-gold stars on it.</p><br/><p>Tier 6 high grade!</p><br/><p>“The test for the tier 6 high grade is over. The Bai clan has passed.”</p><br/><p>The announcement of Han Li made the arrogant smile on the white-clothed woman wider. She felt the envious gazes and her vanity was greatly satisfied.</p><br/><p>The cold woman walked to the side of the gray-clothed, old woman. Her eyes stared at Xiao Yan with great interest. She really wanted to see just how he would let his grand act end.</p><br/><p>“Next will be the tier 7 middle grade test. I will personally conduct the test. Follow me...:”</p><br/><p>Han Li’s gaze was somewhat helpless as he glanced at Xiao Yan, who had appeared indifferent from the beginning. He shook his head and walked to the Tian examination room. Xiao Yan did not hesitate upon seeing Han Li walk away. He followed Han Li and the both of them slowly disappeared into a the room in front of the many gazes.</p><br/><p>The gray-clothed, old woman’s group might have already finished the test, but they did not immediately leave. Instead, their eyes revealed ridicule as they stared at Ye Zhong and laughed in a dark manner.</p><br/><p>“Tch tch, I want to remain behind and see if that brat still has that awful mouth when he fails the test. Ye Zhong, looks like you will lose some face again today!”</p><br/>\n</div>"}