{"title": "Chapter 1136: Copper Plate", "id": 1136, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1136-copper-plate", "volume_title": "Volume 12", "body": "<h1>Chapter 1136: Copper Plate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1136: Copper Plate</u></strong></p><br/><p>The red-robed elder did not even manage to open his mouth before Xiao Yan’s figure disappeared by the stairway. Although he struggled over the price within his heart, he understood that the one who could hold out longer would gain the advantage in this transaction. All of them were experienced players when it came to attempting to play hard. It was only a matter of who could simmer until the other party could not endure any longer. That person would be the true winner…</p><br/><p>Xiao Yan was not surprised by the red-clothed, old man’s silence. Hence, his feet did not pause. Instead, he headed to the top floor.</p><br/><p>There were two elderly men standing at the entrance to the stairs that led to the top floor. These two people wore faces that were full of friendly smile. However, the robes on their bodies indicated that they were people from the trade fair. Neither of them wore an alchemist badge on their chest. However, from the vast and might Dou Qi that spread from them, it was obvious that these two people were strong expert Dou Zongs.</p><br/><p>These two old men were initially startled upon seeing Xiao Yan’s group walking over. Their eyes swiftly flashed across the badge on Xiao Yan’s chest. His bright tier 7 badge caused surprise to flicker in their eyes. It was rare to find such a young tier 7 alchemist.</p><br/><p>Their eyes paused on Xiao Yan for a moment before turning to Ye Zhong, the Little Fairy Doctor, and Tian Huo zun-zhe. Their eyes slightly narrowed when they passed over the latter two. Although they were unable to sense the exact strength of these two, they understood that these two were frightening existences who had advanced to the Dou Zun class…</p><br/><p>“Ke ke, important guests, are you planning to head to the top floor?”</p><br/><p>Of the two, the yellow-robed, old man took the lead to step forward. He cupped his hands together and asked with a courteous smile.</p><br/><p>Xiao Yan grinned, cupped his hands together, and nodded.</p><br/><p>“The few of you seem very unfamiliar. It should be the first time that you have come to this alchemist trade fair, right?” The yellow-robed elder asked with a smile.</p><br/><p>“Why? Could it be that one must be a regular in order to go up?” Xiao Yan raised his eyebrows and questioned.</p><br/><p>“Ke ke, sir really knows how to joke. The old me is only posing a random question. Please follow me if you wish to head to the top floor…” The yellow-robed, old man hurriedly shook his head upon hearing his reply. Although he was quite strong, those who could enter the top floor were all extraordinary people. He naturally did not wish to offend them.</p><br/><p>The yellow-robed, old man took the lead as he turned around. After speaking, he walked forward. Xiao Yan’s group slowly followed behind him.</p><br/><p>The few of them climbed up a short flight of stairs while following the yellow-robed, old man. However, Xiao Yan discovered at least five hidden gazes sweeping over their group from some hidden areas during this short flight of stairs, which was just twenty meters long.</p><br/><p>“Looks like this alchemist trade fair does indeed have some background…”</p><br/><p>Xiao Yan muttered in his heart. After which, he slowly climbed the final step. The most mysterious top floor appeared in his sight.</p><br/><p>The legendary top floor of the alchemist trade fair was not really spacious when compared to the two floors below. However, the sprawling decorations took some effort. This place was not as dazzlingly bright as the second floor. Faint-green, warm jade covered the floor. There was a faint warmth surging into one’s feet when one stepped on the floor, causing one’s entire body to feel unusually comfortable.</p><br/><p>There were very few people on this top floor, that was covered with warm jade. At a glance, there were only a couple dozen people. However, Xiao Yan understood that these dozens of people were true experts or alchemist grandmasters who could stir a commotion in the outside world.</p><br/><p>The appearance of Xiao Yan’s group naturally attracted the attention of some people on the top floor. Immediately, some gazes turned to them. Some surprise flashed across their eyes when they saw the badge on Xiao Yan’s chest as well as the group behind him. Such a young tier 7 middle grade alchemist and two elite Dou Zuns. This lineup was quite strong. Just which wealthy faction did they hail from?</p><br/><p>Although these people felt curious in their hearts, all of them understood the rules of this place. Hence, it was naturally impossible for them to foolishly try to inquire. This was considered taboo in such a place.</p><br/><p>“Ke ke, you can let me know if there is anything that you need. I might be able to provide you with some information.” The yellow-robed elder spoke with a grin.</p><br/><p>Xiao Yan mused for a moment upon hearing his words. He nodded and replied, “I need two types of medicinal ingredients. Ten Thousand Year Old Green Spiritual Vine and Snow Bone Ginseng…”</p><br/><p>“Ten Thousand Year Old Green Spiritual Vine, Snow Bone Ginseng…” The yellow-robed elder muttered the words in his mouth. He thought for a moment and said, “They are all very rare medicinal ingredients. They are likely used to refine a high tier medicinal pill. I do not have any information about the Ten Thousand Year Old Green Spiritual Vine, but as for this Snow Bone Ginseng… it must be said that your luck is good. There is a Snow Bone Ginseng among the items being traded on this floor…”</p><br/><p>“Oh?” Xiao Yan’s eyes brightened. It was unexpected that a random inquiry had enabled him to obtain information about the Snow Bone Ginseng.</p><br/><p>“Ke ke, follow me…” The yellow-robed, old man grinned. After which, he turned around and walked to the northern corner. Xiao Yan hurriedly led the other three and followed.</p><br/><p>Xiao Yan’s group followed the yellow-robed elder for some distance before they finally came to a stop at a corner to the north of the top floor. There was a jade platform placed on this spot. Curling chilly air rose from the platform before spreading apart, causing the temperature of the surrounding area to decline.</p><br/><p>There were some medicinal ingredients, scrolls, medicinal pills, etc. sparsely displayed on the jade platform. From the looks of it, all of them appeared to be extraordinary items.</p><br/><p>There were quite a number of people gathered around the jade platform. Clearly, they were quite interested in the things on it.</p><br/><p>Xiao Yan’s eyes leaped over the jade platform and paused onto the gray-haired, old man’s body behind it. This old man was sloppily dressed. His face was filled with a laziness as he bent over the jade platform. He ignored the surrounding observers and dug in his ear without any concern.</p><br/><p>“Ke ke, Old Yan. Your business is quite good today, right?” The yellow-robed, old man squeezed to the side of the stone platform as he smiled and asked the gray-haired, sloppy, old man.</p><br/><p>“Good my a**! These people only look, but don’t buy. They even say that these things are too expensive. If they think they are too expensive, they can head to the lower floor to shop…” The sloppy, old man rolled his eyes. He spat saliva on the ground without due care of his image.</p><br/><p>The surrounding people were a little embarrassed upon hearing his words. However, this kind of trade fair was not a suitable place to argue with him. Hence, they could only awkwardly leave.</p><br/><p>Xiao Yan was startled by the attitude of this sloppy, old man. His gaze swept over the other party’s chest. There was also a tier 7 badge there. However, it was a tier 7 high grade badge. Clearly, the other party was a tier 7 high grade alchemist.</p><br/><p>“Mister, this is the Snow Bone Ginseng that you need. However, the things this Old Yan sells are all quite expensive. Therefore, you should be mentally prepared…” The yellow-robed, old man pointed his finger to the jade platform where a cold air lingered. There was a jade box there. Inside the jade box lay a snow-white, bone-like ginseng.</p><br/><p>Xiao Yan’s gaze focused on the snow-white ginseng. He slowly nodded a moment later. From the looks of the glow forming above the ginseng, it should be the Snow Bone Ginseng.</p><br/><p>“There is no need to look. No fakes exist here. Do you wish to buy it?” The sloppy, old man glanced at Xiao Yan. His gaze paused a little longer on the badge on Xiao Yan’s chest. “If you wish to obtain the Snow Bone Ginseng, the price is a tier 7 high grade medicinal pill.”</p><br/><p>Xiao Yan slightly frowned upon hearing this. Tier 7 high grade medicinal pill… this fellow was able to utter such words.</p><br/><p>“This old mister, the Snow Bone Ginseng might be precious, but the medicinal pill that it can be used to refine is merely a high grade seventh tier pill. Moreover, that is on the precondition of it acting in consort with other rare medicinal ingredients. Isn’t it a little overboard to seek this price for just this Snow Bone Ginseng of yours?” Xiao Yan slightly smiled and asked.</p><br/><p>“Hee, lad, you really have a way with words. However, your words are reasonable. The old me shall take one step back, a tier 7 middle grade. However, the precondition is that you must take out a medicinal pill I want…” The sloppy old man laughed. After which, he changed his tone. Clearly, the so-called tier 7 high grade pill he had started off with was purposefully attempting to fool others.</p><br/><p>Xiao Yan only nodded upon hearing these words. Using a tier 7 middle grade medicinal pill to exchange for the ingredient was a condition he could accept.</p><br/><p>Of course, despite being able to accept that condition, Xiao Yan did not immediately agree to the terms. His eyes slowly swept over the jade platform.</p><br/><p>Although this sloppy, old man kept a terrible appearance, it must be said that the things he sold were all high quality items. The other few rare medicinal ingredients displayed caused Xiao Yan to involuntarily feel a little speechless. The price of these medicinal ingredients would likely not be lower than the Snow Bone Ginseng.</p><br/><p>Xiao Yan slowly shifted his eyes. Just when he was about to withdraw his gaze, it suddenly paused. He was staring at the corner of the jade platform. There was a faint-yellow copper plate at that spot. That copper plate was covered with some green copper rust. If one were to look carefully, one would be able to see some vague and unique drawings on it.</p><br/><p>The items on the jade platform all looked good. At a glance, one could tell that they were extraordinary items. Only this faint-yellow copper plate appeared like trash among a pile of treasures. It did not attract one’s attention.</p><br/><p>Xiao Yan’s eyes paused on this copper plate. His eyebrows were slightly knitted. After he carefully observed it, he discovered that he was unable to see anything that stood out on this copper plate. Based on his senses, he found that this thing was so ordinary that it could not be anything more…</p><br/><p>However, it was this extremely ordinary feeling that caused Xiao Yan to feel a little strange.</p><br/><p>“Xiao Yan, if it is possible, try to obtain that copper plate. I have seen that drawing once. It is something that only appeared in the ancient times. Although I do not know its exact use, anything related to the ancient era is usually not simple…”</p><br/><p>While Xiao Yan was feeling uncertain, a gruff, elderly voice suddenly sounded beside his ear.</p><br/><p>Xiao Yan’s heart was shaken upon hearing Tian Huo zun-zhe’s voice being transmitted to him. However, his face revealed nothing. A moment later, Xiao Yan slowly nodded. A fiery heat that an ordinary person would not discover surged into his dark-black eyes…</p><br/>\n</div>"}