{"title": "Chapter 1140: Anonymous Word Formula", "id": 1140, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1140-anonymous-word-formula", "volume_title": "Volume 12", "body": "<h1>Chapter 1140: Anonymous Word Formula</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1140: Anonymous Word Formula</u></strong></p><br/><p>“What is the use of this Spirit Nourishment Powder?”</p><br/><p>Xiao Yan’s eyes were shining as he looked at the five tiny pale-yellow specks of dust within the room. He licked his mouth and inquired.</p><br/><p>Tian Huo zun-zhe fondled his beard. He mused for a moment before slowly replying, “This Spirit Nourishment Power was quite renowned even during the ancient times. It is not only an item one must have in order to refine medicinal pills tier 8 and above but it is also able to nourish one’s soul if the dust merges with the soul, gradually strengthening the spirituality of one’s soul. From there, one could step into that so-called Soul State.”</p><br/><p>Joy surged into Xiao Yan’s eyes the moment he heard Tian Huo zun-zhe’s words. It seemed that these inconspicuous little things hid great ability.</p><br/><p>“During ancient times, some of the alchemists who had touched the soul state would try their best to obtain this Spirit Nourishment Powder… this thing is just like a magnet that attracts spirituality. If it merges with one’s soul, it would enable the soul to fill with spirituality without one realizing it. Moreover, it also possesses a good catalytic effect when it comes to some unique conditions where one would gain an understanding.” Tian Huo zun-zhe smiled and replied.</p><br/><p>Xiao Yan slightly nodded. The joy in his eyes was difficult to hide. He really did not take a loss from this transaction. The value of this so-called Spirit Nourishment Powder was indeed far from what the medicinal formula for the Elemental Heart Pill could compare with. Moreover, the thing that surprised him was that this powder could strengthen the spirituality of one’s soul…</p><br/><p>The Soul State required the soul to be able to bestow a medicinal pill with spirituality. However, the precondition of this effect was that one’s soul must be filled with sufficient spirituality. Nevertheless, if one did not have a special method to train one’s soul, one would not be able to sense this so-called spirituality.</p><br/><p>Moreover, this kind of soul training method had completely disappeared after a countless number of years of history. Hence, one could only borrow the help of external items or lucky encounters in order to enter a mysterious condition and raise the spirituality of one’s soul. Similar to the two previous experience that Xiao Yan…</p><br/><p>Unfortunately, this kind of condition was something that one could luckily encounter, but not attempt to seek out. Naturally, one could not enter it just because one wanted to. Hence, this kind of mysterious item, that could strengthen the spirituality within one’s soul, had become exceptionally rare and precious in this era.</p><br/><p>“Only a small number of tier 8 alchemists are able to refine this kind of Spirit Nourishment Powder after learning how to refine it. However, I think that the refining method of the Spirit Nourishment Powder has already been lost…” Tian Huo zun-zhe’s eyes were a little curious as he stared at the shiny powder within the flame. I have only seen such a thing in some ancient books and have never personally seen it.”</p><br/><p>“If you wish to refine a tier 8 medicinal pill in the future, the chances of success will be significantly raised if you add this Spirit Nourishment Powder into it, After the refinement, the pill will be even purer than other tier 8 medicinal pills…”</p><br/><p>Surprise flashed across Xiao Yan’s face after he had listened to Tian Huo zun-zhe’s words. It was the first time that he had heard that one needed to add this so-called Spirit Nourishment Powder when refining a tier 8 medicinal pill.</p><br/><p>“Ke ke, the secret of this thing can be considered to have been broken, and the old me can be considered to have finished my task. Otherwise, you will end up nagging my ear saying that I have caused you to lose a medicinal formula…” Tian Huo zun-zhe smiled after seeing Xiao Yan’s face. After which, he stood up and said, “It is already getting quite late, and you should rest early. Tomorrow is the so-called five great clan test. Do not tarry. That old fellow Ye Zhong has placed all of his hope on you.”</p><br/><p>Tian Huo zun-zhe turned around and left after speaking. The Little Fairy Doctor also said something to Xiao Yan. She briefly hesitated before slowly leaving.</p><br/><p>Xiao Yan smiled as he watched the two of them leave the room. His eyes turned back to the five pale-yellow pieces of dust within the flame in front of him. After musing for a moment, he finally could not resist beckoning with his hand. A Soul Nourishment Powder escaped from Xiao Yan’s flame and remained suspended in front of him.</p><br/><p>Xiao Yan slowly shut both of his eyes after staring at this Spirit Nourishment Powder. While his eyes were shut, a suction force suddenly surged out. This suction force caused the shiny, pale-yellow speck to transform into a tiny ray of light that shot into Xiao Yan’s forehead before it finally disappeared…</p><br/><p>Xiao Yan’s body intensely trembled when this powder merged with his forehead. His face suddenly tightened as waves of faint pain were emitted from his head.</p><br/><p>Xiao Yan frowned. He endured the faint pain he felt. Based on his senses, the Spirit Nourishment Powder was like a bullet as it ruthlessly attacked his soul before penetrating through it…</p><br/><p>Fortunately, this kind of pain did not last for long before it gradually disappeared…</p><br/><p>Xiao Yan only sighed in relief after feeling the the pain gradually disappeared. However, he had just sighed in relief when he suddenly sensed his surroundings form a strange fluctuation. Threads of a faint, unusual flow seeped from this fluctuation before slowly invading his forehead…</p><br/><p>After this unusual flow entered his body, Xiao Yan immediately felt a wild joy. He sensed the spiritual aura contained in his soul begin to grow at an extremely slow pace!</p><br/><p>“It is actually spiritual aura?”</p><br/><p>Xiao Yan had thought of all methods to increase the spiritual aura within his soul, but he had failed to increase his soul by even a little. However, with this Spirit Nourishment Powder, spiritual aura, which could not be improved by relying on an ordinary method, could be extracted by him and merged with his soul…</p><br/><p>Xiao Yan felt a wild joy as he sensed the strengthening spiritual aura within his soul. It was a long while later before he gradually focused his mind. After he calmed down, a pale-yellow dust of light vaguely appeared in his mind. An unusual suction force was being emitted from it. This kind of suction force was weak, but it appeared to possess a kind of strange strength that extracted spiritual energy, which many experts could do nothing about, from the surroundings…</p><br/><p>The seemingly chaotic spiritual aura slowly seeped out of the space around. It continuously entered through the space between Xiao Yan’s brows.</p><br/><p>This spiritual aura absorption continued for nearly three hours before the glow and suction force emitted by the pale-yellow dust gradually weakened. Clearly, this kind of Spirit Nourishment Powder was unable to last for long…</p><br/><p>The glow emitted by this light particle dimmed. A long while later, a slight ‘crack’ suddenly sounded within Xiao Yan’s head.</p><br/><p>The Spirit Nourishment Powder cracked apart and that strange suction force came to a halt. The surrounding spiritual aura immediately disappeared. It was futile regardless of how Xiao Yan tried to suck it in…</p><br/><p>Xiao Yan involuntarily laughed upon sensing this change. However, just when he was about to withdraw from this condition, feeling helpless, the Spirit Nourishment Powder, which was about to disappear from his mind, suddenly unleashed an intense glow. Even Xiao Yan’s soul felt an intense pain under this glow.</p><br/><p>The intense pain gradually subsided. While Xiao Yan was still feeling panicked, an extremely vague, elderly mumble was emitted from where the light erupted…</p><br/><p>“The limit of Soul… shut the Heavenly Spirit… absorb the spirit forge, the soul…”</p><br/><p>The indistinct elderly voice softly resounded in Xiao Yan’s mind. It appeared just like sacred words, causing one to gain a trance-like feeling.</p><br/><p>The trance-like feeling did not cause Xiao Yan to become absentminded. Although the elderly voice in his mind was unclear, he still tried to remember as much as possible. This elderly voice resounded three times before it completely scattered…</p><br/><p>Xiao Yan slowly opened his tightly shut eyes. There was an expression of contemplation on his face.</p><br/><p>“It is rumored that some experts are able to leave behind a spiritual imprint on certain items. If I have guessed correctly, that elderly voice from earlier should have been left behind by an expert from the ancient times. However, due to the great amount of time that has passed, the voice has become indistinct…” Xiao Yan softly muttered to himself.</p><br/><p>“The limit of Soul… shut the Heavenly Spirit… absorb the spirit forge, the soul…”</p><br/><p>Xiao Yan frowned and softly muttered. A moment later, he thought, “It seems to be a kind of word formula. However, it is clearly incomplete. I wonder what it is used for…”</p><br/><p>Xiao Yan mused for a moment to no avail. He could not help but helplessly shake his head. After which, he stored the four remaining pieces of Spirit Nourishment Powder into his Strong Ring. The effect of this thing, being able to absorb the spiritual aura, was too important to Xiao Yan. Unfortunately, it could only last a very short period of time. He could not afford to squander them. Hence, he could not easily use it. After all, he might need these things to increase his chance of success when he refined medicinal pills in the future…</p><br/><p>Xiao Yan softly sighed as he sat cross-legged on the bed. After which, he slowly shut his eyes. His mouth also moved slightly while he did so. If one were to carefully listen, one would discover that Xiao Yan was whispering the word formula he had obtained from the Spirit Nourishment Powder earlier…</p><br/><p>A low and indistinct sound slowly resounded around the room. This continued for half an hour before the calm interior of the room finally began to form an unusual ripple!</p><br/><p>Swoosh!</p><br/><p>Xiao Yan’s tightly shut eyes suddenly opened when that ripple was formed. His face was filled with shock. An instant earlier, he had sensed the presence of spiritual aura within his surroundings!</p><br/><p>This kind of thing had only happened twice to him when he had entered the strange conditions before. However, Xiao Yan was certain that he had not entered that kind condition earlier!</p><br/><p>Xiao Yan tightly knit his brows. A moment later, he suddenly clenched his hand. A glaring glint erupted within his dark-black eyes.</p><br/><p>“Is this because of that word formula?”</p><br/>\n</div>"}