{"title": "Chapter 1151: Mysterious Black Robed Person", "id": 1151, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1151-mysterious-black-robed-person", "volume_title": "Volume 12", "body": "<h1>Chapter 1151: Mysterious Black Robed Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1151: Mysterious Black Robed Person</u></strong></p><br/><p>The deep-blue-colored flame appeared extremely mysterious. The flame was like transparent sea water that slowly spread apart as it rose. Its faint ripple was just like ripples of water…</p><br/><p>The Glazed Lotus Heart Flame within Xiao Yan’s body fluctuated the moment this deep-blue flame appeared. He was not unfamiliar with this kind of fluctuation because every time a Heavenly Flame met another Heavenly Flame, both flames would form this kind of special fluctuation…</p><br/><p>Moreover, Xiao Yan was also familiar with this deep-blue flame. He had seen it on Han Feng’s body back then…</p><br/><p>Sea Heart Flame, a Heavenly Flame ranked fifteenth on the Heavenly Flame Ranking…</p><br/><p>Xiao Yan’s eyes stared at the deep-blue flame on the black robed person’s body. A moment later, his voice was a little deep as he asked, “Han Feng’s Sea Heart Flame?”</p><br/><p>Back when Han Feng had reappeared after having been rescued by the people from the Hall of Souls, he had lost this Sea Heart Flame. From what he had said, it had been taken away by the Hall of Souls. Now, this person, who had suddenly appeared in front of him, was a member of the Hall of Souls. It was obvious that this Heavenly Flame was the Sea Heart Flame that Han Feng had lost!</p><br/><p>“Ke ke, your eyesight is not bad…” The black-robed person did not deny this as he faintly laughed. Under his black robes, his glowing eyes stared at Xiao Yan in a somewhat heated manner. He said, “I know that you possess more than one Heavenly Flame in your body. The reason I have come to look for you this time around is not to capture you and bring you back to the Hall of Souls. That is something for the others to do. My ultimate aim… is the Qi Method you practice!</p><br/><p>“The Qi Method that allows Heavenly Flames to merge with each other!”</p><br/><p>A killing intent that was difficult to suppress suddenly rose within Xiao Yan’s heart as he sensed the searing hot eyes under the black robes. Flame Mantra was his greatest secret. Anyone who dared desire it needed to be killed!</p><br/><p>“This is Holy Pill City. The limbs of the Hall of Souls really reach far…” Xiao Yan laughed in a cold and dense manner. The Dou Qi within his body appeared like floodwaters as it whizzed and surged forward. His entire body remained in an extremely cautious state. In order for this black-robed person to appear in this place in such a quiet manner, that person’s strength must be terrifying. At the very least, Xiao Yan sensed a dangerous aura from the other party that required him to treat this person seriously.</p><br/><p>“That Qi Method is something that I had gotten my hands on first. However, that old fellow Yao Chen used a despicable method to snatch it from me. I am currently only taking back the thing that belongs to me…” The black-robed man softly laughed. He raised his head slightly. With the help of the moonlight, one was able to see a little of the man’s pale chin.</p><br/><p>Xiao Yan’s eyes immediately focused when he heard this man’s words. He knew the Flame Mantra was something that Yao Lao had found from damaged ruins back then. Moreover, it was rumored that countless numbers of experts had been attracted to the ruins. Although Xiao Yan did not personally witness what happened, he could guess that an intense battle had to have erupted for the things that remained.</p><br/><p>“I know that there are two elite Dou Zuns within this place. However, I have already used a Spiritual Lock in this small courtyard. They will not be able to discover anything for some time…” The black-robed person moved his sleeve and a shriveled hand that seemed to be nothing but skin on bone slowly extended from his sleeves. He clenched his hand and a cluster of deep-blue flames was swiftly formed into something like a ball.</p><br/><p>“Hand over the Qi Method and I will spare your life tonight…”</p><br/><p>Xiao Yan coldly laughed. A silver glow flashed under his feet, and he appeared on the wall of the small courtyard. A jade-green flame surged out and smashed into the invisible barrier on the wall.</p><br/><p>“Bang!”</p><br/><p>A low, deep sound appeared. Xiao Yan’s punch was unable to break the invisible barrier. All it did was cause some ripples to appear.</p><br/><p>“Stubborn fellow. Do you think that you are Yao Chen?” The black-robed figure’s voice had become cold when he saw what Xiao Yan attempted. He randomly waved his sleeves and the deep-blue flame swiftly agglomerated into a blue-colored fire spear. With a swing, the spear cut through the empty air, transforming into a blue shadow that shot toward Xiao Yan with a sharpness.</p><br/><p>Xiao Yan’s expression was ice-cold. His body shook and the sound of thunder appeared. His body disappeared from the spot almost instantly and dodged the blue-colored fire spear.</p><br/><p>“Sea Restraining Net.”</p><br/><p>The hand of the black-robed person suddenly grabbed at the empty space behind him after Xiao Yan’s figure disappeared. Numerous deep-blue fire lines shot from his five fingers. They swiftly intertwined with each other to form a fire net, which wrapped around the empty air.</p><br/><p>“Chi!”</p><br/><p>An enormous heavy ruler suddenly hacked down and appeared where the fire net had rushed over. It continued down with great might and ruthlessly slammed into the deep-blue-colored fire net.</p><br/><p>Sizzle sizzle!</p><br/><p>The Glazed Lotus Heart Flame collided with the Sea Heart Flame and a sizzling sound immediately erupted. The two types of Heavenly Flames began to wildly corrode each other…</p><br/><p>“Break!”</p><br/><p>Xiao Yan’s eyes turned chilly during the erosion. The jade-green flame suddenly erupted and violently danced, forcefully splitting apart the deep-blue fire net.</p><br/><p>Xiao Yan’s body swiftly pulled back. While he did so, the jade-green flame on his hand was split into two, transforming into the Green Lotus Core Flame and the Fallen Heart Flame. After which, they merged once again. Within a short few breaths’ time, an exquisite jade-green fire lotus appeared…</p><br/><p>With Xiao Yan’s current strength, creating this fire lotus by merging of two flames had already reached the point where it was easy as he please…</p><br/><p>Xiao Yan flicked his finger after the fire lotus was formed. It carried a beautiful firetail as it rushed toward the black-robed person.</p><br/><p>Xiao Yan waved his hand after the fire lotus rushed over. The Earth Demon Puppet appeared. Under Xiao Yan’s order, the puppet charged at the black-robed person without any fear of death. At the same time, Xiao Yan’s body once again pulled back and appeared by the invisible barrier. Both of his fists appeared like a storm as they swiftly landed on the barrier. This caused the Spiritual Lock to continuously form ripples.</p><br/><p>“Not a bad Dou Technique. It is able to merge Heavenly Flames. Looks like that Qi Method has been beneficial to you…” The black-robed person smiled in a dense manner. The deep-blue flame, that adhered to his ten fingers, swiftly moved in the space in front of him. Immediately, a cluster of deep-blue flames agglomerated into the shape of a fireball. After which, the fireball split to form a fissure that swallowed the jade-green fire lotus.</p><br/><p>The deep-blue-colored fireball had just swallowed the jade-green flame when an unusually powerful explosion materialized within it. The fireball exploded apart. Jade-green flames shot in all directions, destroying the tidy, small courtyard and turning it into complete chaos.</p><br/><p>The jade-green flame was around five feet from the black-robed person when the Sea Heart Flame automatically launched an attack, reflecting it away. Hence, this Angry Buddha Lotus Flame failed to cause even the slightest harm to the black-robed person. From this, one could tell just how terrifying the strength of the black-robed person was.</p><br/><p>The black-robed person flicked his finger after blocking the attack of the fire lotus. Over a dozen deep-blue fire lines shot from the tip of his finger. After which, they firmly trapped the Earth Demon Puppet that had rushed over. It was unable to break the entanglement of the fire ropes regardless of how it struggled…</p><br/><p>“With your strength, you are still unable to break the Spiritual Lock that I have placed…”</p><br/><p>The black-robed person faintly spoke. He looked at Xiao Yan, who was using his strength to attack the Spiritual Lock, with indifferent eyes after easily resolving the fire lotus and the Earth Demon Puppet.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s fist violently smashed against the barrier. His expression became uglier as he looked at the spreading ripple. It was unexpected that this mysterious, black-robed person was actually this strong. Based on his guess, the strength of this person had likely reached a three star or even a four star Dou Zun!</p><br/><p>Although Xiao Yan’s expression was a little ugly, he did not lose focus. This black-robed person might be strong, but Xiao Yan was not some persimmon that anyone could randomly knead...</p><br/><p>“I do not have much time. If you continue to remain stubborn, you should not blame me for killing you…” The black-robed man’s eyes were indifferent as they stared at Xiao Yan. He gently stepped through empty air and slowly took one step at a time toward Xiao Yan. This was Holy Pill City. His actions must not be made known to others. Otherwise, if those people from the Pill Tower were to discover them, things would definitely be quite troublesome.</p><br/><p>Xiao Yan expression became ice-cold as he glared at the black-robed figure slowly walking over. He flicked his finger and a wisp of jade-green flame shot onto the Earth Demon Puppet a short distance away, blasting apart the fire ropes binding its body.</p><br/><p>The Earth Demon Puppet’s body moved after it was freed. It rushed in front of Xiao Yan and stood before him like a metal tower…</p><br/><p>Xiao Yan widened his mouth after rescuing the Earth Demon Puppet. A jade-green flame was spat out before splitting into the Green Lotus Core Flame and the Fallen Heart Flame. He rubbed the dark-black ring on his finger and a dense-white Bone Chilling Flame appeared…</p><br/><p>“Ha ha, three types of Heavenly Flame? Not bad, not bad. The rumors are indeed true. Looks like I will gain a lot this time around…”</p><br/><p>The black-robed person was a little surprised when he saw the three clusters of Heavenly Flames in front of Xiao Yan. He immediately let out a loud laugh as he clenched his palm. The deep-blue flame rushed out of his palm. It slowly spread apart and completely wrapped around him. Looking from a distance, that black-robed man appeared just like a fire god, looking extremely mighty.</p><br/><p>Xiao Yan’s eyes were dangerous. He inhaled a deep breath of air and a grayish-white-colored flame slowly rolled up his throat…</p><br/><p>“Life Transformation Flame…”</p><br/><p>A chill surged within Xiao Yan’s eyes as he looked at this grayish-white flame in front of him. He immediately waved his hand, and he started to merge the four types of flames together in front of the stunned gaze of the black-robed person.</p><br/><p>“Are you courting death?”</p><br/><p>The expression of the black-robed person slightly changed. His body moved, and he transformed into a black shadow that shot toward Xiao Yan with lightning-like speed. The deep-blue flame was swiftly gushing out of his palm.</p><br/><p>The speed of the black-robed man was extremely swift. He seemed to have merged with space as he had appeared in front of Xiao Yan the moment he moved. His hand was curled, and he carried a sharp force that ruthlessly grabbed at the top of Xiao Yan’s head.</p><br/><p>Xiao Yan was just about to activate his Three Thousand Lightning Movement to dodge after sensing the black-robed person’s sharp attack when a slight shattering sound suddenly resounded over the courtyard. Xiao Yan’s swept around, only to find that the invisible barrier, that had covered the courtyard, had been shattered into a countless number of tiny spiritual fragments…</p><br/><p>A vast aura suddenly swept down from the stars when the spiritual barrier was broken. At the same time, a calm voice that was filled with vicissitude slowly reverberated over this small courtyard.</p><br/><p>“The territory of the Pill Tower is not one that will allow your Hall of Souls to act wildly…”</p><br/><p>The face of that black-robed person immediately changed when this voice sounded. He lifted his head to look at the sky as he cried out in a hoarse voice, “Xuan Kong Zi?”</p><br/>\n</div>"}