{"title": "Chapter 1175: Medicinal Ingredient Square", "id": 1175, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1175-medicinal-ingredient-square", "volume_title": "Volume 12", "body": "<h1>Chapter 1175: Medicinal Ingredient Square</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1175: Medicinal Ingredient Square</u></strong></p><br/><p>Xiao Yan slowly exhaled when he saw Old Mu Gu disappear in the distorted space. He had finally shaken off this old demon. However, from the looks of it, this Old Mu Gu did not appear to be giving up. A true life and death battle would definitely erupt when they met in the future.</p><br/><p>Xiong Zhan, who was just like a giant tower on the ground, also coldly snorted upon seeing Old Mu Gu leave. After which, his enormous body began to swiftly shrink. Within a short couple of breaths, he had turned back into the big, strong man Xiao Yan had seen earlier.</p><br/><p>Upon seeing Xiong Zhan turn back into his human form, Xiao Yan hugged Zi Yan closer, and rushed down from the sky. He placed her down before cupping his hand to Xiong Zhan and said, “Thank you for your help big brother Xiong Zhan.”</p><br/><p>“Hey, big fellow. He is someone extremely close to me. Calling you ‘big brother’ means he thinks very highly of you. Moreover, he is a tier 8 alchemist. Should he randomly refine a medicinal pill and hand it to you as a gift, you will have gained a great reward.” Zi Yan by the side revealed her two small canine teeth as she spoke to Xiong Zhan in a threatening gesture. She was aware of the character of this Xiong Zhan. He would completely ignore the person if that person was not someone he was familiar with. She did not wish for Xiao Yan to end up bearing with the attitude of this rude fellow.</p><br/><p>Xiong Zhan was startled when he heard this. His eyes were somewhat surprise as he looked at Xiao Yan. His expression changed a little as he asked, “Tier 8 alchemist?”</p><br/><p>Even with his strength, he had to treat an alchemist of this tier politely because the medicinal pills he needed at this level of his could only be refined by tier 8 alchemists.</p><br/><p>The world of the strong was one where strength was honored. If Xiao Yan did not possess any ability, that Xiong Zhan might feel some disdain in his heart even after giving Zi Yan face. However, after hearing that Xiao Yan was a tier 8 alchemist, his attitude had drastically changed.</p><br/><p>“I am not a tier 8 alchemist. Currently, I am still only at the high grade seventh tier…” Xiao Yan smiled and replied without hiding anything.</p><br/><p>Xiong Zhan was once again stunned in his heart when he heard Xiao Yan’s frank reply. A rare good impression rose within his heart. Other people always tried to make themselves look better. It was unexpected that Xiao Yan would willingly reveal his level. This point caused Xiong Zhan, who had a forthright character, to feel a little pleased.</p><br/><p>“However, I am currently finding some things. If I manage to gather all of them, perhaps I might be able to reach the eighth tier.” A good impression of Xiong Zhan rose within Xiao Yan’s heart after he saw that Xiong Zhan did not reveal an expression of disdain because of his level. Immediately, he changed his tone and laughed, “If I am able to advance to the eighth tier in the future, big brother Xiong Zhan can come and look for me if you need anything. I will definitely lend a hand if it is within my ability to do so.”</p><br/><p>“Ha ha, alright. I will remember your words. If you really advance to a tier 8 alchemist, this old bear will definitely come and look for you.” Xiong Zhan involuntarily laughed out loud when he heard this offer. His laughter was just like thunder as it resounded over the sky.</p><br/><p>“Big fellow, it is rumored that Xiao Yan will require some task items to pass this Pill Gathering. In any case, you have so many things here. Let’s go and take a look first. It is a waste if you keep them all…” Zi Yan grabbed Xiao Yan’s clothes and commanded to Xiong Zhan. After which, she ignored him. She moved her body, pulled Xiao Yan, and quickly rushed to the top of the mountain.</p><br/><p>Xiong Zhan widened his mouth upon hearing this. However, he could only sigh. This little grandaunt was really difficult to serve.</p><br/><p>Xiao Yan had reached the enormous stone hall in a couple of minutes with Zi Yan leading him. There were two Magical Beasts with fierce auras at the entrance to the stone hall. When they saw Xiao Yan’s foreign face, they immediately stood up. A low, furious roar resounded over the place.</p><br/><p>“Go play by the side.”</p><br/><p>Zi Yan took the lead to walk forward. Her small hand was randomly waved. Those two seemingly fierce high rank Magical Beasts emitted a low whimper before they held their tails between their legs and hurriedly withdrew a great distance away. They felt a pressure emitted from Zi Yan that came from their bloodlines. This caused them to be without any desire to resist.</p><br/><p>Xiao Yan contemplated the reason upon seeing this scene. These two Magical Beasts possessed strength that had reached the seventh rank. They were not weaker than the Mysterious Water Tiger Snake that Xiao Yan had met. However, they appeared weak in front of Zi Yan. It seemed that the background of this girl was quite great…</p><br/><p>Xiao Yan followed Zi Yan as they quickly entered the stone hall. They shuffled down a couple of corridors and arrived at a spacious square within the large hall.</p><br/><p>Xiao Yan’s footsteps had just entered the square when a medicinal fragrance, so rich it literally adhered to things, violently surged over. This caused him to violently quiver on the spot. After which, he raised his head and looked at the densely packed medicinal ingredients in the square. His face became dull at this moment.</p><br/><p>“Rising Dragon Flower Heart… Red Flame Fruit… Sulphur Flame Spiritual Saliva…”</p><br/><p>Xiao Yan’s stunned gaze swept over the medicinal ingredients that had been neatly arranged in front of him. These items were considered extremely rare items in the outside world. However, they were randomly placed in this place like white cabbages.</p><br/><p>Xiao Yan’s eyes swept over the place for a moment. He finally recovered and inhaled a deep breath of air. After which, he suppressed the shock within his heart, looked at Zi Yan and bitterly laughed, “The both of you have moved all of the precious medicinal ingredients in this Ten Thousand Mountain Range to this place, right?”</p><br/><p>Zi Yan laughed. She nodded and said, “You can choose whatever you want here and can even take all of them with you when the time comes. After all, that big fellow is going to leave. Leaving them here will only benefit others…</p><br/><p>Zi Yan’s voice had just sounded when Xiong Zhan’s feet involuntarily trembled after following them into the hall. The corner of his mouth twitched a couple of times. Zi Yan was right. In any case, he was about to leave this terrible place. However, Xiong Zhan still felt his heart bleed despite thinking in this manner.</p><br/><p>“You can just choose what you need. Just leave a little for me when you leave.” Xiong Zhan rubbed his large hands with great force and spoke with an expressionless face.</p><br/><p>Xiao Yan involuntarily smiled when he saw Xiong Zhan run his hands. He laughed, “Big brother Xiong Zhan really knows how to joke. The things here all belongs to you. It is already very good of you to lend some of them to me. How can I snatch your things?”</p><br/><p>“Damn damn. He has already said that he only wants a little. It’s fine, right?” Zi Yan turned her head suddenly when she uttered these words. Her large, watery eyes revealed a bright-purple glow. That purple glow was different from normal. At a glance, it appeared to form the shape of a dragon.</p><br/><p>Xiong Zhan’s strong body trembled involuntarily when he saw the dragon-shaped purple glow. A pressure, that originated from his bloodline, caused his blood to have the impulse to boil.</p><br/><p>“This… this is the ancestor dragon pressure?”</p><br/><p>A shocked expression flashed across Xiong Zhan’s eyes. His straight body involuntarily and quietly hunched over a little. He hurriedly laughed, “That’s right. That’s right. Little grandaunt is right. Brother Xiao Yan can just take them. If you take too little, you will be looking down on me, Xiong Zhan. I will be displeased.”</p><br/><p>Xiao Yan widened his mouth, feeling neither able to laugh nor cry. This Xiong Zhan was indeed interesting. He helplessly nodded. His gaze glanced at Zi Yan who was smiling at him from the side. His finger was gently flicked on her clear forehead. He knew the reason Xiong Zhan had experienced a sudden change was probably because of this little girl.</p><br/><p>“Since big brother Xiong Zhan has put it this way, Xiao Yan will not hold back. Currently, I do indeed need a couple of things…” Since Xiong Zhan had already put it this way, there was not much for Xiao Yan to say. He cupped his hands together before carefully entering the square piled with rare medicinal ingredients. His eyes carefully swept over them as he attempted to find the medicinal ingredients he needed.</p><br/><p>The medicinal ingredients in this square was basically the collection of the entire Ten Thousand Medicinal Mountain Range. There were many types of medicinal ingredients. It was enough to cause one to feel dazzled by looking at them. Therefore, even though Xiao Yan was quite good at identifying medicinal ingredients, he still spent nearly half an hour or so before finding the three types of medicinal ingredients he needed.</p><br/><p>“Dragon Core Nine Leaves Mushroom… Demon Blood Spiritual Fruit Pulp… Ascending Immortal Grass…”</p><br/><p>These three types of medicinal ingredients were the tasked items of Xiao Yan this time around. However, at this moment, he had completely gathered them in this place. Thus, his task had been completed in an effortless manner…</p><br/><p>Even Xiao Yan involuntarily became absent-minded as he looked at the three types of rare medicinal ingredients in his hands. He immediately shook his head with a bitter smile. It was likely that he would be the person who had completed his task in the smoothest manner in all the previous and future Pill Gatherings.</p><br/><p>Xiao Yan threw his mind back to the square after having placed these three tasked items into his Storage Ring. Currently, he needed a special medicinal ingredient called the Heavenly Numb Jade Essence. This thing was a critical substance to mediate the Core Soul Marrow. As long as one found this thing, he would be able to completely remedy the Core Soul Marrow. At that time, his soul would be able to rely on it to completely transform and truly enter that so-called Soul State. The eighth tier would also open its doors to him!</p><br/><p>It was not easy to find this Heavenly Numb Jade Essence. It was a rock, yet it was not exactly a rock. If one was not an extremely experienced person, one would find it difficult to identify from a pile of random rocks.</p><br/><p>Xiao Yan’s eyes steadily swept over the middle of the square. Time swiftly flowed by amid this slow investigation. An hour passed by within the blink of an eye. Xiong Zhan had already turned around and impatiently walked out of the stone hall during this period of time. Only Zi Yan remained seated on some stone stairs. Her small hands supported her cheeks as she watched Xiao Yan’s back. She would yawn occasionally while doing so…</p><br/><p>Xiao Yan’s footsteps did not become hurried because of the flow of time. One could not be half-hearted when identifying medicinal ingredients. After all, quite a lot of medicinal ingredients were similar in appearance. If one was not serious, identifying them was a very difficult task.</p><br/><p>Finding medicinal ingredients was also an extremely time consuming task. However, it was fortunate that the Heavens did not let down those who were sincere. When Xiao Yan’s feet had gradually walked to the other end of the square, they finally paused. His eyes were focused intently on an inconspicuous spot. There was a green-colored rock quietly lying in fragrant soil…</p><br/>\n</div>"}