{"title": "Chapter 1172: Fleeing For Ones Life", "id": 1172, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1172-fleeing-for-ones-life", "volume_title": "Volume 12", "body": "<h1>Chapter 1172: Fleeing For Ones Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1172: Fleeing For One’s Life</u></strong></p><br/><p>Xiao Yan’s reaction was swift and the reactions of the others were also quite quick. Just when Xiao Yan had turned around and left, Song Qing and the rest had also immediately escaped the battleground. After which, they used all their strength to rush explosively to the forest!</p><br/><p>“Swoosh!”</p><br/><p>Cao Ying was at the front of everyone fleeing. Moreover, she was the first to escape the moment the spatial barrier broke. However, a couple of breaths’ time after she had cried out, a figure flashed over from behind her. Within the blink of an eye, that figure had overtaken her. Her pretty eyes swept over to see who it was. Who else could this figure be other than Xiao Yan?</p><br/><p>Those who were fleeing were not fools. They did not flee in the same direction. Instead, their eyes glanced at each other before they began rushing in all directions. Within a couple of flashes, they had fled into the vast forest.</p><br/><p>“Chase, do not let anyone of them off!”</p><br/><p>The black-clothed man was shocked since the spatial barrier had been broken quickly by Cao Ying. He hurriedly recovered and cried out in a dense voice.</p><br/><p>“Understood!”</p><br/><p>The dozen plus black-clothed man hurriedly acknowledged after hearing the order of the black-clothed man. After which, they began to scatter in an orderly manner, giving chase to the fleeing individuals as they did so.</p><br/><p>“I want to see just how long you can struggle!”</p><br/><p>The black-clothed man’s cold eyes shot in the direction Xiao Yan and Cao Ying had disappeared. He immediately let out a cold laugh as his body shook. The surrounding space slowly wiggled and his body disappeared in a strange manner.</p><br/><p>Two figures rushed away like agile monkeys within this lush, green forest. The speed of these two was as quick as lightning. Their bodies flashed between the forest and disappeared.</p><br/><p>“Chi!”</p><br/><p>Two people rushed out without turning their heads around. Suddenly a ripple appeared from the trees beside them. A figure immediately appeared from within.</p><br/><p>The sudden appearance of this figure startled Xiao Yan and Cao Ying. Their gazes hurriedly swept over and found that it was Song Qing.</p><br/><p>Joy flashed across Song Qing’s face when he saw the two of them. His feet stepped through the empty air as he rushed over and said, “Quick leave, there are some black-clothed people blocking that direction…”</p><br/><p>He knew that these words were useless after speaking them because Xiao Yan and Cao Ying did not reduced their speed even a little. Instead, their bodies flashed and their speed significantly increased.</p><br/><p>Song Qing’s face twitched when he saw this. However, he did not have time to say anything else at the moment. He unleashed his speed to the maximum and hurriedly followed.</p><br/><p>The three of them wildly fled within the sea of trees. Their target was the top of the mountain. If they wanted to shake off the black-clothed Dou Zun, they would have to attract something that he was afraid of. The only one who could contend against this black-clothed Dou Zun was likely the ultimate beast at the top of it.</p><br/><p>The three figures rushed over the forest like a wild gale, causing the withered leaves on the ground to dance…</p><br/><p>Xiao Yan’s expression was solemn. A bright silver glow continuously appeared. His flashing figure would occasionally leave some afterimages in the air that would slowly scatter.</p><br/><p>“Creak!”</p><br/><p>Xiao Yan’s feet had just landed on a large tree when he curled his knee. He was just about to borrow the strength to shoot explosively forward when his expression suddenly changed. His foot curled in a strange arc and his body shot backwards instead!</p><br/><p>“Bang!”</p><br/><p>Soon after Xiao Yan’s figure pulled back, the space a short distance from where his foot had landed suddenly distorted. A black figure immediately appeared in front of the three of them from nowhere. His cold eyes caused the hearts of Xiao Yan’s group to sink.</p><br/><p>“Your speed is quite quick. Unfortunately, it is still insufficient to shake off this venerable self.” The black-clothed man appeared and glanced at Xiao Yan trio before laughing.</p><br/><p>A cold glint flashed in Xiao Yan’s eyes when he saw this. This fellow was indeed troublesome to deal with.</p><br/><p>“Do not waste the time of this venerable self…” The black-clothed man appeared to have gradually lost his patience. His eyes suddenly turned dark and chilly. He curled his hand and a deep-blue crystal layer surged out of his body. After which, it formed an energy crystal hand claw.</p><br/><p>The claw had just been formed when the black-clothed man waved his sleeves. The crystal claw disappeared into nowhere!</p><br/><p>“Be careful!”</p><br/><p>Xiao Yan’s heart trembled when he saw the crystal claw disappear, so he hurriedly cried out a warning. After having exchanged blows with this black-clothed man earlier, Xiao Yan was aware of just how terrifying that deep-blue crystal layer was.</p><br/><p>Xiao Yan trio had separated into three directions after the cry sounded. They pulled back with lightning-like speed at the same time.</p><br/><p>The space in front of Cao Ying suddenly formed an intense ripple while the three of them were withdrawing. Immediately, the crystal claw forcefully penetrated space and grabbed at her in a ruthless manner. From the looks of it, that black-clothed Dou Zun was planning on attacking Cao Ying first.</p><br/><p>When the hand claw came grabbing over, Cao Ying was a little shocked to discover that the surrounding space had been forcefully solidified!</p><br/><p>Her figure was no longer able to move under this solidified space! Hence, she could only watch as the large crystal beast reached over.</p><br/><p>Xiao Yan and Song Qing had also sensed Cao Ying suddenly descend into a dangerous situation. Their expressions changed. The eyes of that Song Qing slightly flickered. An instant later, he violently grit his teeth as his feet pressed on a tree branch. His body fled into the forest with lightning-like speed and disappeared in the blink of an eye.</p><br/><p>Xiao Yan knit his brows when he saw Song Qing abandon Cao Ying to flee by himself. He looked at Cao Ying, who was bitterly enduring while clenching her silver teeth. All he could do was let out a quiet sigh. Song Qing might be able to do such a shameless thing, but he, Xiao Yan, was really unable to…</p><br/><p>After sighing in his heart again, Xiao Yan flicked his finger. A silver-colored figure rushed out of his Storage Ring. After which, it swiftly appeared in front of Cao Ying, using its body to block her.</p><br/><p>“Crack!”</p><br/><p>The Earth Demon Puppet had just appeared when that energy crystal hand violently grabbed it. One could only see its incomparably strong body immediately form numerous crack lines. There was even the low, deep sound of flesh exploding.</p><br/><p>“Go!”</p><br/><p>Xiao Yan immediately cried out sternly after having used the Earth Demon Puppet to help Cao Ying block the attack.</p><br/><p>This sudden helping hand had startled Cao Ying. Her pretty eyes immediately looked at Xiao Yan in a deep manner. Her red lips were gently widened. A slight sound was transmitted to Xiao Yan’s ears, “Thank you.”</p><br/><p>Cao Ying also understood what kind of a situation it was after the words sounded. She did not stay for long. Her delicate body moved, and she swiftly rushed into the forest.</p><br/><p>Xiao Yan beckoned with his hand after Cao Ying turned around and rushed into the forest. He hurriedly pulled the Earth Demon Puppet, that had nearly been turned to scraps, back into his Storage Ring. A silver glow flickered under his feet. After which, he unleashed the Three Thousand Lightning Movement to its limit. He was accompanied by a series of afterimages as he rushed into the dense forest in another direction.</p><br/><p>The expression of the black-clothed Dou Zun finally turned dark when he saw his attack was once again without any gains. His cold eyes swept over the directions where the three people had fled. They immediately paused on the spot where Xiao Yan left from.</p><br/><p>“Since you love to rescue others, this venerable self shall see just who will come to rescue you this time around?”</p><br/><p>A dense voice was emitted from the black-clothed Dou Zun’s mouth. After which, his body shook, and he once again disappeared in a strange manner. From the looks of it, Xiao Yan’s interventions had truly angered him.</p><br/><p>Xiao Yan’s figure rushed through the forest in a lightning-like manner. His expression was currently dark and solemn. Although there was no black-clothed Dou Zun figure behind him, he could vaguely feel that he was being locked onto by that fellow.</p><br/><p>Clearly, that person had chosen Xiao Yan among the trio.</p><br/><p>“Bastard. If you really force me to that extent, I will let you pay a bloody price even if I have to go all out to the point of being seriously injured!”</p><br/><p>Xiao Yan’s figure had continued to wildly charge for a distance, but that locked on feeling did not weaken. Instead, it became even more intense. Immediately, a fierce glint flashed across Xiao Yan’s eyes. Although the other party was an elite Dou Zun, it was impossible for him to bite Xiao Yan’s tough bones if this Dou Zun did not possess a good set of teeth!</p><br/><p>After this thought flashed across Xiao Yan’s heart, his speed increased. In the end, Xiao Yan only able to see a blurry black line rush through the air of the forest. However, he was unable to see any of it while it wildly rushed past…</p><br/><p>Xiao Yan’s foot stepped on empty air. He looked through the gaps in the forest as he looked at the top of the mountain, which was approaching…</p><br/><p>“Chi!”</p><br/><p>Xiao Yan’s eyes suddenly shrank soon after a sigh was released within his heart. His feet stomped on empty air, and his body was forcefully stopped. His eyes were filled with a deep darkness as he looked at a tree branch a short distance from him. A black-clothed human figure was seated with his legs crossed at that spot.</p><br/><p>“Regardless of how intelligent prey is, it will not be able to escape from the hands of the hunter.”</p><br/><p>The black-clothed Dou Zun raised his eyes. His gaze glanced indifferently at Xiao Yan as he ferociously laughed.</p><br/><p>“Xiao Yan. This venerable self wants to see if there will be anyone who will show up and rescue you this time around. I will definitely take your Heavenly Flames!”</p><br/><p>A thought suddenly passed through Xiao Yan’s heart when he heard these words. His eyes swept over the black-clothed Dou Zun. There was a slight change in his expression as he exclaimed, “You… you are Old Mu Gu?”</p><br/><p>The black-clothed Dou Zun was slightly surprised when he heard this. After which, the savage smile on his face became even more prominent. He asked, “Can’t you recognize me?”</p><br/><p>Xiao Yan’s heart involuntarily sank when he heard the words of the black-clothed Dou Zun not denying anything. This fellow… was indeed Old Mu Gu. He possessed such an ability to deceive the three giant heads of the Pill Tower and enter the Pill Realm…</p><br/><p>“It is also just as well that you have recognized me. You can at least die knowing why. No matter how one puts it, the both of us have some relationship. If we were to really discuss about it, you might perhaps even have to call this venerable self teacher-uncle.” Old Mu Gu laughed in a dark and chilly manner.</p><br/><p>TL: teacher-uncle - junior of one’s teacher who shares the same master as one’s teacher</p><br/><p>“I am not so blessed.” Xiao Yan involuntarily laughed when he heard this.</p><br/><p>Old Mu Gu laughed and did not mind. His eyes were somewhat hot as he stared at Xiao Yan. “This time around, this venerable self will not hold back. I will first kill you and take your soul. This venerable self has his own methods of getting you to reveal the Flame Mantra!”</p><br/><p>After laughing in a dense, cold manner, Old Mu Gu clenched his hand. That large claw, which was formed from a deep-blue energy, once again appeared in front of him. He waved his sleeves and the enormous claw disappeared in a strange manner…</p><br/><p>Xiao Yan’s expression also changed when he saw the enormous claw disappear. After the exchange earlier, he already understood that this thing could penetrate space itself. It was elusive, making it difficult for one to defend against it…</p><br/><p>Xiao Yan was not wrong. The space in front of him became distorted while Xiao Yan concentrated. An enormous crystal claw rushed out and grabbed at him.</p><br/><p>The momentum of the large claw was extremely shocking. Xiao Yan also understood just how terrifying this thing was. Even the Earth Demon Puppet had nearly been crippled when the claw had grabbed it. With the strength of his body, it was likely that he would explode into a pile of bloody flesh with just a pinch.</p><br/><p>However, it was fortunate that he was already prepared. The moment the large claw had appeared, the silver glow under Xiao Yan’s feet flashed before the claw could even lock onto him. Within an instant, he had appeared in empty ground around a couple of dozen meters away.</p><br/><p>“Hmph!”</p><br/><p>Old Mu Gu coldly laughed upon seeing Xiao Yan’s swift reaction.</p><br/><p>His laughter had just sounded when Xiao Yan was dazzled. The large crystal hand, filled with an unusual Spiritual Pressure, once again appeared in a strange fashion. After which, the hand grabbed with lightning-like speed. The surrounding space once again solidified.</p><br/><p>The solidification of the surrounding space caused Xiao Yan’s expression to change. This crystal large hand was really too troublesome to deal with. It was unusually difficult to even dodge it. An elite Dou Zun was indeed extraordinary…</p><br/><p>Xiao Yan abruptly clenched his teeth as numerous thoughts flashed across his heart. His eyes did not blink as he stared at the large claw that had come violently grabbing over. Dou Qi within his body began to be maneuvered at this moment. The current him really needed to engage in an all out final battle!</p><br/><p>The enormous claw flashed. It opened and was just like a ghost claw as it pinched at Xiao Yan’s head!</p><br/><p>Xiao Yan’s expression had become completely grave as he watched the large claw grow larger in his eyes. His hand seal changed as he did so.</p><br/><p>“Skyfire Three Mysterious Change, first change!”</p><br/><p>“Skyfire Three Mysterious Change, second change!”</p><br/><p>Two cries sounded one after another within Xiao Yan’s heart, causing the Dou Qi within his body to suddenly soar. The surrounding solidified space had also become much more relaxed.</p><br/><p>“Skyfire Three Mysterious Change, third change!”</p><br/><p>Xiao Yan’s vicious eyes looked at Old Mu Gu with a ferocious smile on his face. He inhaled a deep breath of air. The seals formed by his hands changed once again as he prepared to use all of his strength!</p><br/><p>Just as Xiao Yan’s hand seal was formed, the space in front of him strangely distorted. Immediately, a strong figure stepped out of the distorted space and stood in front of Xiao Yan like a metal tower.</p><br/><p>A vast, calm breath suddenly surged out of the strong body like a sweeping storm when it appeared.</p><br/><p>This kind of feeling was as though the one in front was not a person, but instead, a sky-supporting mountain!</p><br/><p>“Hee hee, murdering openly in my territory. You really don’t give me any face, do you?”</p><br/><p>The figure had just appeared when he let out a rough laugh in front of Xiao Yan’s stunned eyes. After which, the figure clenched his five fingers tightly. A punch without any fancy moves was suddenly thrown, and it heavily collided with the large claw!</p><br/><p>“Bang!”</p><br/><p>The two collided. The crystal-like large claw, which possessed an unusually great strength, had been forced back by over a dozen meters. After which, it flew through the air and vaguely revealed some cracks.</p><br/><p>“Who has come?”</p><br/><p>This sudden unexpected change caused Old Mu Gu to cry out furiously after being startled.</p><br/><p>That strong man had yet to say anything after Old Mu Gu’s cry sounded when an alluring laughter suddenly resounded over the forest.</p><br/><p>“Old fellow, I will not care if you chase after the others. However, you cannot kill Xiao Yan…”</p><br/><p>“Zi Yan?”</p><br/><p>Xiao Yan, who was in a stunned state, was immediately even more startled when he heard this familiar voice. Joy quickly surged into his eyes.</p><br/>\n</div>"}