{"title": "Chapter 1173: Zi Yan, Xiong Zhan", "id": 1173, "volume": 12, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1173-zi-yan-xiong-zhan", "volume_title": "Volume 12", "body": "<h1>Chapter 1173: Zi Yan, Xiong Zhan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1173: Zi Yan, Xiong Zhan</u></strong></p><br/><p>Old Mu Gu’s expression slightly changed when he heard the clear and loud voice that resounded over the forest. His eyes swept around before suddenly shooting to the tree branch of a large tree, only to see a purple-clothed, little girl there. Both of her legs were gently swinging.</p><br/><p>Even with Old Mu Gu’s calmness, he was involuntarily startled when he saw this little girl. His eyes were covered with shock. Those who could enter the Pill Realm were all alchemists that participated in the Pill Gathering. However, this little girl in front was clearly not one of them. Just how did she enter this place?</p><br/><p>The purple-clothed, little girl ignored the surprised gaze of Old Mu Gu. Her small hand pressed against the tree branch and her lovely, small body leaped down from high above. After which, it gently landed in front of Xiao Yan. She involuntarily laughed when she saw Xiao Yan’s stunned expression before giving him a strange face. Her lovely and pretty actions were really likeable.</p><br/><p>“Zi Yan… why are you here?”</p><br/><p>The shock within Xiao Yan’s eyes lasted for a good amount of time before gradually disappearing. He grabbed this little girl, who had disappeared for quite a while, and pulled her to his side. After which, he carefully looked at her. Her jade-carving appearance was as cute as it was before, giving her an appearance similar to a porcelain doll.</p><br/><p>“I have escaped. Hee hee, I knew that you were participating in the Pill Gathering, so I came here to wait for you…” Zi Yan smiled like a little fox. Both of her eyes narrowed into a crescent shape.</p><br/><p>“I have been very pitiful. After having left, I no longer had any tasty Yaowan. Everyday, those hateful fellows would pour some disgusting stuff for me to eat…”</p><br/><p>Zi Yan grabbed Xiao Yan’s clothes. Her large watery eyes immediately became moist. Her life during this period of time was really too awful from her point of view. It was just like a life in hell when compared to the times she was beside Xiao Yan. Therefore, she had hurriedly took the opportunity to flee once she had the chance to do so…</p><br/><p>“Your tribe members?” Xiao Yan was astonished before he immediately understood something. After which, he asked in a surprised manner.</p><br/><p>Zi Yan violently nodded. From the looks of it she greatly hated the way her tribe members treated her. However, if those members of her tribe came to be aware of this, they would likely be so furious that they would end up spitting out blood. In this world, one was not rewarded for being a good person.</p><br/><p>Xiao Yan helplessly shook his head. He did understand Zi Yan’s character. Every word was exaggerated many times over when spoken from her mouth. Hence, he did not really believe these words of hers. As for whatever thing that was being fed to her… at the very least, this girl appeared quite lively. She was undoubtedly many times better than when she had left back then.</p><br/><p>“Hey, have you finished chatting. Little grandaunt, this fellow is not someone easy to deal with…” That strongly built man turned his head somewhat impatiently and spoke to the two while Xiao Yan and Zi Yan were chatting.</p><br/><p>TL: grandaunt in this case refers to a woman that was difficult to serve</p><br/><p>“Big fellow, there is no need for you to be anxious. Go and beat him. Your task will be considered nearly over once you finish him off.” Zi Yan curled her small mouth before pointing at the gloomy-faced Old Mu Gu a short distance away. She instructed in a crisp voice.</p><br/><p>That large man and Old Mu Gu’s faces involuntarily twitched when they heard her words.</p><br/><p>“You really think quite highly of me. It is already not bad that I can block him. If not for my constitution, I would not be able to beat him.” The large man helplessly replied. He appeared quite speechless when it came to the task Zi Yan had assigned him.</p><br/><p>“May I know who this friend is?” Xiao Yan looked at him. He smiled, cupped his hands together, and inquired politely.</p><br/><p>“He is called Xiong Zhan. I call him big fellow. He is the chief of this Ten Thousand Medicinal Mountain Range. Hee hee, all of the natural treasures in this place are managed by him…” Zi Yan laughed. A greediness flashed across her watery eyes.</p><br/><p>That large man called Xiong Zhan involuntarily shuddered when he heard Zi Yan’s words. He thought of the precious medicinal ingredients being eaten by Zi Yan as tidbits. This little fellow was really someone who wasted treasures.</p><br/><p>“Chief?”</p><br/><p>Xiao Yan’s heart was slightly startled. If one put it this way, would this Xiong Zhan not be that ultimate beast talked about by Song Qing’s group?</p><br/><p>“This friend, it is really not my intention to barge into this mountain. The old me shall apologize to you if I have offended you in any way. However, this person is a target that I must capture. I hope that you will not interfere!” Old Mu Gu a short distance away finally spoke with a gloomy face. Although Xiong Zhan’s level was inferior to him, his fighting strength was extremely shocking. It was impossible to tell just who would end up dying to whose hands.</p><br/><p>Xiong Zhan rolled his eyes upon hearing this. After which, he responded in an irritated manner, “You have heard what this little grandaunt said earlier. I must protect this person. Why don’t we do it this way? I will not bother about you barging into the mountain, and you should just turn around and leave. What do you say?”</p><br/><p>The corner of Old Mu Gu’s mouth twitched. His eyes gradually became cold. This time around, he had the intention of capturing Xiao Yan at any costs. The hinderance of anyone would not be able to shake his determination!</p><br/><p>“In that case…” Old Mu Gu became silent for a moment. A fierce glint suddenly surged within his eyes as he yelled in a dense voice, “You can go and die!”</p><br/><p>The dense voice had just sounded when Old Mu Gu waved his sleeves. That crystal hand, which had been forced back by Xiong Zhan earlier, once again rushed out. Within a flash, the hand appeared in front of Xiong Zhan. The large hand was tightly clenched, forming a fist that violently smashed at the Xiong Zhan’s head!</p><br/><p>“Chi!”</p><br/><p>The wind from the fist had arrived before the punch did. That terrifying fist wind caused the ground under Xiong Zhan’s feet to sink by nearly two feet despite them being a great distance apart. An enormous fist imprint appeared on the ground.</p><br/><p>“Hee, the old me has dominated for so many years. I have not met anyone who dares tell me to go and die. Who do you think you are?”</p><br/><p>A fierceness flashed across Xiong Zhan’s face when he saw Old Mu Gu attacking at the first sign of a disagreement. His fist was clenched tightly and a deep-yellow energy surged out of his body. A fist was violently thrown out, and it chose the most direct, non-fanciful method to collide with the large crystal fist.</p><br/><p>“Bang!”</p><br/><p>The two violently collided and a terrifying ripple rushed out with lightning-like speed. All the grass within a hundred meter radius were cut by half a foot. Some of the gigantic trees’ trunks were cut. A large amount of sawdust erupted from the spot where they broke.</p><br/><p>Xiao Yan’s eyes and hands were swift. When that forceful ripple erupted, he had hugged Zi Yan, and moved his body. After which, he rushed to the sky, lowered his head, and looked at a patch of yellow soil that had appeared within the vast sea of trees. He was involuntarily a little speechless. It was indeed worthy of a battle between the Dou Zun class. Such a great destructive strength had been created by just a raise of one’s hand.</p><br/><p>Xiong Zhan ended up taking two steps back within the forest now permeated by dust. The ground shook each time his feet landed. This continued two times before he managed to completely stabilize his body. He immediately raised his head, and his eyes were unusually hot as he looked at Old Mu Gu across from him. He cried out, “Alright, it is enjoyable! Again!”</p><br/><p>Old Mu Gu’s expression turned dark and cold. He glanced at the large crystal claw that was once again sent flying. One could see the cracks on it had become denser.</p><br/><p>“The fighting strength of this Xiong Zhan is really great. In what way is he just an expert that has half a foot into the Dou Zun class as Song Qing had mentioned? From the looks of it, he has likely already advanced to the Dou Zun class. Otherwise, it would have been impossible for him to face Old Mu Gu head on without too much of a disadvantage.” Xiao Yan softly spoke. Surprise involuntarily flashed across his eyes when he looked at the battle below.</p><br/><p>“The big fellow has already advanced to the Dou Zun class a couple of years ago.” Zi Yan, who was in Xiao Yan’s embrace, curled her mouth and revealed some information.</p><br/><p>“It is fortunate that I did not listen to Song Qing while he was fanning the flames. Having only half a foot into the Dou Zun class and completely entering the Dou Zun class were two completely different concepts. With the lineup of Song Qing earlier, they would only deliver themselves to death by going there.” Xiao Yan involuntarily smacked his tongue when he heard this. This Song Qing was indeed untrustworthy.</p><br/><p>On the yellow soil that was being forcefully created, Old Mu Gu’s eyes were dark and dense as he stared at Xiong Zhan, who had a face filled with the intent to battle. Some killing intent also flashed across his heart. The level of difficulty in dealing with Xiong Zhan had far exceeded his expectations. However, this was impossible to get him to give up. Immediately, his shriveled hands rolled out of his sleeves and began to form seals with lightning-like speed!</p><br/><p>“Nether Demon Fire Arm!”</p><br/><p>A deep-blue flame swiftly erupted from Old Mu Gu’s body like a volcano following the cold cry emitted. It immediately surged into the large crystal claw.</p><br/><p>With an increasing amount of deep-blue flames surging into the large crystal claw, one could see the lines on the surface of the large claw gradually mend. A deep-blue arm of fire was slowly extended from the back of the large claw. The flame rose, causing this arm to give others a kind of extremely cold feeling. It appeared just like the arm of a death god.</p><br/><p>A grave expression flashed across Xiong Zhan’s face when he saw the large arm with deep blue coloured fire lingering over it. A low roar was emitted from his throat. The large hand trembled slightly.</p><br/><p>“Those who hinder this venerable self shall die!”</p><br/><p>A dark chilly expression flashed across Old Mu Gu’s eyes. His hand seal suddenly changed and that large flame arm immediately rushed up. After which, it appeared just like a meteorite as it ruthlessly smashed down on the spot where Xiao Zhan was located. The space along the way suddenly crumbled, revealing many dark-black spatial holes.</p><br/><p>The large fire hand rushed down. When it was a certain distance away, the flame on it suddenly soared. The large fire hand also swelled with the wind. In an instant, it had transformed into something nearly a hundred feet around. An enormous dark shadow covered the forest within a hundred meter radius!</p><br/><p>“Roar!”</p><br/><p>Xiong Zhan let out a ferocious roar to the sky after sensing the hot energy pressure that was being transmitted from it. His body also began to swell with a ‘swoosh swoosh’ sound at this instant. Dark-black, long hair surged out of his body in all directions. Finally, he tightly clenched his enormous fist. A glaring, deep-yellow energy surged out like floodwater. At this instant, Xiao Zhan appeared to have merged with this enormous mountain, using the strength of the mountain to unleash a shocking strike!</p><br/><p>The large fire hand rushed down. An instant later, it collided with Xiong Zhan’s enormous fist!</p><br/><p>The mountain shook and all the beasts trembled as a result.</p><br/>\n</div>"}