{"title": "Chapter 1260: Kill", "id": 1260, "volume": 13, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1260-kill", "volume_title": "Volume 13", "body": "<h1>Chapter 1260: Kill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1260: Kill</u></strong></p><br/><p>Xiao Yan already had a killing intent towards Chen Tian Nan within his heart ever since the latter first lead a large group of people to the Pill Tower to capture him. However, he was merely a nine star Dou Zong back then. It was quite difficult to kill this old fellow. Hence, he did not act. Now that they have met again, Xiao Yan had yet to act when this old fellow had attacked first. Moreover, looking at the vicious stance of the latter, it was clear that he really wanted to take Xiao Yan’s life.</p><br/><p>Xiao Yan would naturally not show mercy to this kind of enemy, who possessed a desire to kill him. Although the Profound Xuan Sect might not be very strong, the Profound Sky Sect behind them caused people to be a little afraid. No one could guarantee that this old fellow would find some great trouble for Xiao Yan due to his grudge against the latter. It was not Xiao Yan’s character to leave a potential danger alone. Moreover, the situation in this place was currently chaotic. It was likely that news would not really spread if he killed this old fellow here.</p><br/><p>These thoughts flashed across Xiao Yan’s heart. He looked at Chen Tian Nan, who appeared quite miserable under the attack of the Sky Demon Puppet. His face also became increasingly icy.</p><br/><p>Chen Tian Nan’s strength was around that of a two star Dou Zun. On the other hand, with the fighting strength of the Sky Demon Puppet, it would not be at a disadvantage even when facing an expert at the peak of the three star Dou Zun class. Hence, it was naturally able to firmly suppress the former in their fight.</p><br/><p>“Bang!”</p><br/><p>Chen Tian Nan violently collided head on with the Sky Demon Puppet in the midair. The frightening strength that was transmitted through his arm immediately caused him to take over a dozen staggering steps in the midair. Bloody Qi rose within his body. A pale white expression surfaced on his face. The Sky Demon Puppet did not feel any pain, it was like a killing machine when it fought. As long as Xiao Yan did not ask it to step, it would never stop. Chen Tian Nan would suffer quite a great disadvantage when they fight.</p><br/><p>After having fallen into a disadvantage despite the long fight, Chen Tian Nan already had the intention to withdraw within his heart. The reason he dared to snatch the scroll from Xiao Yan was because Xiao Yan was facing enemies from all directions. Not only did the experts from the Hall of Soul had an enmity with him but even the gazes that the Heaven Demon Phoenix’s group used to look at him were unfriendly. At this moment, Chen Tian Nan would naturally wish to add insult to injury, given his character. However, he did not expect that the current Xiao Yan was actually completely different from the one at the Pill Tower back then. That endless number of tactics had caused his heart to feel a little afraid.</p><br/><p>“Looks like I can only withdraw first. Once the chaos of this place end, the Hall of Soul and the rest will definitely find trouble with this brat. At that time, I will secretly attack and kill this brat. At the same time, I will also snatch the scroll back.”</p><br/><p>Chen Tian Nan finally decided to cease fighting while this thought flashed across his heart. He raised his head and looked at the Sky Demon Puppet, which had rushed over once again. His body hurriedly pulled back, intending to withdraw into the chaotic battleground.</p><br/><p>“Humph, where are you going?”</p><br/><p>However, Chen Tian Nan had just stepped back when an icy cold voice suddenly sounded from behind him. At the same instant, a extremely frightening hot wind also arrived.</p><br/><p>This sudden attack had also caused Chen Tian Nan’s expression to change. He swiftly turned around instinctively as his palms, which were covered in Dou Qi, were hurriedly thrown forward.</p><br/><p>“Bang!”</p><br/><p>The fierce wind suddenly spread apart at this moment. Chen Tian Nan, who hurriedly exchanged blows with his opponent, immediately felt a oppression in his heart. His body was forcefully shaken until it withdrew for a couple of dozen metres. He hurriedly raised his head, only to see a skinny figure standing at the spot where he had fell back from earlier.</p><br/><p>“Xiao Yan!”</p><br/><p>Chen Tian Nan immediately gritted his teeth and cried when he saw that figure.</p><br/><p>Xiao Yan was expressionless. Purple-brown flame surrounded his body, causing him to appear like a fire god. His feet were stepping on the empty air as he walked over towards Chen Tian Nan.</p><br/><p>“You wish to kill me?” Chen Tian Nan involuntarily narrowed his eyes and coldly said when he saw this manner of Xiao Yan.</p><br/><p>The corner of Xiao Yan’s mouth was lifted into a dense arc. Vast and mighty Dou Qi swiftly gathered in his palm.</p><br/><p>“With just this one star Dou Zun strength of yours?” Chen Tian Nan laughed furiously. He was just about to take the initiative to attack when an unusually sharp wind was suddenly transmitted from behind him. This caused his expression to change. He hurried turned around and met it. Both of his palms danced and his powerful Dou Qi formed an impenetrable energy web in front of him.</p><br/><p>“Bang bang!”</p><br/><p>The Sky Demon Puppet waved its arm. Each time it was swung, it would bring about an ear-piercing sharp wind splitting sound. Space collapsed and numerous dark black crack lines appeared.</p><br/><p>“Boom!”</p><br/><p>Chen Tian Nan quietly cried out bitterly when faced with this fierce attack by the Sky Demon Puppet. His body continued to pull back. The strength of the Sky Demon Puppet had basically suppressed him until he only had the ability to defend.</p><br/><p>“If this continues, I will sooner or later be seriously injured in the hands of this puppet. Looks like I cannot be entangled any longer. Bastard brat. The old me will remember this debt. Sooner or later, the time will come for you to repay it!” Chen Tian Nan viciously cried out within his heart. His palm wind suddenly strengthened as he forcefully pushed aside the attack by the Sky Demon Puppet. His toes pressed on the ground and his body flew backwards.</p><br/><p>Chen Tian Nan’s heart had just sighed in relief as his body stood in the midair when a dangerous feeling suddenly spread out from deep within his heart. The goosebumps all over his body stood up at this moment.</p><br/><p>“Sky Burying Seal!”</p><br/><p>A slight cold cry that carried some cold wind quietly resounded beside Chen Tian Nan’s ear while Chen Tian Nan’s heart was permeated with a sense of danger.</p><br/><p>“This is bad!”</p><br/><p>Chen Tian Nan’s expression instantly became pale when he sensed the activity behind him. Xiao Yan’s speed was so quick that it had exceeded his expectations.</p><br/><p>“Bang!”</p><br/><p>Dou Qi hurriedly surged within Chen Tian Nan’s body as he reacted to the situation. Before he could completely form a defence behind him, a palm size purple-brown handprint gently landed on his back. A frightening force surged out like floodwaters.</p><br/><p>“Grug!”</p><br/><p>A sleek redness immediately surged up Chen Tian Nan’s pale white face after he forcefully received this heavy blow. A mouthful of fresh blood was involuntarily spat out. His body also staggered and withdrew, knocking against a couple of experts as he did so. That force had also shaken these unlucky fellows until they vomited a couple mouthfuls of blood.</p><br/><p>Chen Tian Nan’s body transformed into an arc that flew towards the distant. His face was covered with blood as he turned around with much difficulty. His eyes were vicious as he looked at the increasingly distant Xiao Yan. That vicious poisonous feeling caused one to have goosebumps.</p><br/><p>“Little bastard, if I do not avenge this, I, Chen Tian Nan, will have been a sect leader in vein. In the future, I will definitely get you to regret your action today!”</p><br/><p>Chen Tian Nan roared viciously within his heart. He was originally the type who would take revenge for any grudge. Xiao Yan had nearly killed him on the spot. This vengeance was sufficient to allow him to remember it for a lifetime.</p><br/><p>“Bang!”</p><br/><p>Numerous vicious thoughts flashed across Chen Tian Nan’s heart. His body also landed heavily on the ground, rubbing and forming a deep gully. After which, he violently collided onto the hard pillar of the large hall. Immediately, he spat out another mouthful of fresh blood.</p><br/><p>After struggling shakily onto his feet, Chen Tian Nan’s eyes penetrated through the crowd and looked at the indifferent looking Xiao Yan in the distant with vicious eyes. After which, he turned around and left.</p><br/><p>“Puff!”</p><br/><p>Chen Tian Nan had just turned around when his body suddenly became stiff. A dark golden fist penetrated through his chest. Fresh blood adhered onto the dark golden arm and continued to drip downwards.</p><br/><p>Those eyes of Chen Tian Nan stared firmly at the hollow face. Only then was he aware that Xiao Yan had truly felt a murderous intent towards him. The latter would not give him any chance to take revenge.</p><br/><p>“What a vicious tactic…”</p><br/><p>Blood seeped out from within Chen Tian Nan’s mouth. His lifeforce also swiftly disappeared from within his body. Immediately, his stiff body collapsed slowly. Finally, it fell onto the ground. This chief of the Profound Xuan Sect, Chen Tian Nan, who had reached the strength of a two star Dou Zun, had fell in the combined attack of Xiao Yan and the Sky Demon Puppet in this manner…</p><br/><p>“You can only blame yourself for everything…”</p><br/><p>The chillness on Xiao Yan’s face was gradually withdrawn when he saw Chen Tian Nan collapsing slowly. He originally had no enmity with Chen Tian Nan. However, the latter insist on thinking that Chen Xian had died in his hands and had tried to kill him with all sorts of methods. Chen Tian Nan deserved this ending of his today.</p><br/><p>Xiao Yan kept the Sky Demon Puppet into his Storage Ring after having like Chen Tian Nan with lightning like speed. Tian Huo zun-zhe, Little Fairy Doctor and the others also flashed over. Finally, the few of them once again gathered and cautiously watched the chaos within the large hall.</p><br/><p>“What happen to that human puppet? Are you alright?” Xiao Yan glanced at Little Fairy Doctor and asked.</p><br/><p>“I’m fine. I have lured the human puppet to another place. These things might possess the desire to kill but they do not possess any intelligence…” Little Fairy Doctor smiled sweetly as she replied.</p><br/><p>Xiao Yan nodded slightly. His eyes swept over the place.</p><br/><p>“The Heaven Demon Phoenix tribe and Wind Lightning Pavilion has each obtained a scroll. The Ice River Valley and the Burning Flame Valley has also gained something. Additionally, another two scrolls has landed into the hands of two experts, who are quite strong.” Tian Huo zun-zhe softly spoke from the side.</p><br/><p>Xiao Yan was startled when he heard this. After which, he nodded once again. These factions had come prepared. Moreover, there were also some truly experts amongst those who had come alone. It was not too surprising for them to obtain the scrolls.</p><br/><p>“What should we do now? There are only three scrolls remaining, which are being snatched by people. An unknown number of people has already died because of those three scrolls… do we need to snatch another one?” Little Fairy Doctor asked.</p><br/><p>“If we snatch more of it, it will cause those who has yet to obtain any treasure to lose their sense of reasoning…” Xiao Yan shook his head. He knitted his brows slightly and replied, “Moreover, the feeling that these ten scrolls give me does not appear like a Tian class Dou Technique…”</p><br/><p>“You mean… these ten scrolls are all fake?” Little Fairy Doctor and the rest asked in shock.</p><br/><p>“These scrolls are indeed Dou Techniques or Qi Methods which are quite strong. However… they are likely not the Tian class Dou Technique. All of us are likely fooled…” Xiao Yan narrowed his eyes and muttered.</p><br/><p>Little Fairy Doctor and the others also knitted their brows tightly when they heard these words. They rotated their eyes and suddenly said, “Those fellows from the Hall of Soul… what are they planning to do?”</p><br/><p>Xiao Yan was startled. His eyes followed the sight of Little Fairy Doctor, only to see old ghost Zhai Xing and a couple of Hall of Soul expert was actually adopting an encircling formation as they slowly walked towards the Dou Sheng skeleton at the middle of the large hall.</p><br/><p>“Their target is the Dou Sheng skeleton?” Tian Huo zun-zhe commented in a deep voice.</p><br/><p>“Should we intervene and stop these fellows?” Zi Yan spoke with a desire to see some action.</p><br/><p>Xiao Yan’s eyes were staring intently at the skeleton that was seated on the stone chair. His eyes suddenly shrunk a moment later. An instant earlier, he had seen the finger of that skeleton trembling slightly.</p><br/><p>“This… this Dou Sheng skeleton is alive?”</p><br/><p>A shock suddenly spread out from Xiao Yan’s heart at this moment!</p><br/>\n</div>"}