{"title": "Chapter 1261: Dou Sheng Skeleton", "id": 1261, "volume": 13, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1261-dou-sheng-skeleton", "volume_title": "Volume 13", "body": "<h1>Chapter 1261: Dou Sheng Skeleton</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1261: Dou Sheng Skeleton</u></strong></p><br/><p>The sudden drastic change in Xiao Yan’s expression also attracted the notice of Little Fairy Doctor’s group. Everyone were startled as they carefully asked, “What is it?”</p><br/><p>Xiao Yan inhaled a deep breath of cold air. He looked at old ghost Zhai Xing and the others who are increasingly close to the stone chair. A bad feeling suddenly rose within his heart. An instant later, he suddenly grabbed Zi Yan and Qing Lin beside him and cried out in a deep voice, “Pull back quickly!”</p><br/><p>“Ugh?”</p><br/><p>This unusual action of Xiao Yan caused Little Fairy Doctor and the rest to be at a loss. However, everyone trusted Xiao Yan’s words. Hence, they might be uncertain of the reason for this action of his but they still immediately turned around and hurriedly followed him.</p><br/><p>While Xiao Yan’s group was hurrying back, old ghost Zhai Xing’s group had also stepped into a ten feet radius of the stone chair. Both of his eyes were fiery hot as he watched the seated skeleton. Dou Sheng. This level possessed an allure that even they could not resist. An elite Dou Sheng might be able to be called the top expert of this continent but there was still too much of a gap to the true peak…</p><br/><p>Dou Zun and Dou Sheng was basically a great leap apart. The gap between the two was basically impossible to be make-up by anything…</p><br/><p>“Is this the bones of an elite Dou Sheng…”</p><br/><p>Old ghost Zhai Xing’s eyes were wild and hot as they stared at the jade white skeleton. He involuntarily leaked his tongue. His feet took another two steps forward and his large hand directly grabbed towards the skeleton.</p><br/><p>“Chi!”</p><br/><p>When the hands of old ghost Zhai Xing were about to touched the skeleton, a slight wiggling had suddenly appeared in that space. Immediately, they appeared to have transformed into countless number of extremely sharp spatial thorns that ruthlessly pierced onto old ghost Zhai Xing’s hand.</p><br/><p>The slight pain that was emitted from his hand caused old ghost Zhai Xing to be startled. He hurriedly withdrew his hand, only to discover that quite a lot of fresh blood had already flowed out from his hand. There were a couple of droplets amongst them that had gently dripped on the skeleton that was sitting down.</p><br/><p>An uneasy emotion quietly spread out from the heart of old ghost Zhai Xing as he looked at the fresh blood that landed on the jade white skeleton.</p><br/><p>“Zhai Xing Tianzun, what is it?”</p><br/><p>The couple of Hall of Soul experts, who had surrounded him asked uncertainly. They were also startled when they saw old ghost Zhai Xing suddenly becoming stunned.</p><br/><p>Old ghost Zhai Xing appeared as though he did not hear their scream. His eyes firmly stared at the blood that dripped onto the skeleton. At this moment, these blood appeared like water that had touched cotton when they rolled onto the bones. It ended up quietly seeping into the bones.</p><br/><p>The eyes of old ghost Zhai Xing suddenly shrunk when the blood completely seeped into the bones. At this moment, he suddenly sensed that some life had actually once again surged within this skeleton that had been dead for an unknown number of years.</p><br/><p>“This is bad. Withdraw quickly!”</p><br/><p>Old ghost Zhai Xing finally reacted to the situation. The moment he sensed that lifeforce, an anxious roar was emitted from within his mouth. At the same time, his feet stomped onto the ground and his body flew backwards in a lightning like manner.</p><br/><p>Old ghost Zhai Xing’s reaction was quick but the other few experts from the Hall of Soul were a little slower. Hence, they only began to use their agility and pull back after being stunned for a moment. However, it was already too late at this moment…</p><br/><p>When they had just pulled back, the jade white skeleton that was seated on the stone chair had already shook gently. After which, two clusters of faint blood red colour suddenly flashed and appeared within the empty skull.</p><br/><p>“Ah!”</p><br/><p>This Dou Sheng’s skeleton slowly raised its head when the blood glow appeared. An earthshaking roar was suddenly emitted from his mouth at this moment in a thunder like manner!</p><br/><p>The frightening roar had transformed into a substance like sonic wave in an instant. It became like a storm as it spread apart in a lightning like manner with the stone chair being at the centre.</p><br/><p>“Bang!”</p><br/><p>The first that was implicated by the sonicc storm was naturally the few experts from the Hall of Soul, who were a little slow to react. The sonic wave caught up with them in an instant. Immediately, their bodies appeared to be like sandbags that had been struck by a cannonball. They immediately burst apart and turned into a bloody fog that spread apart with a ‘bang’/</p><br/><p>“Humph!”</p><br/><p>That old ghost Zhai Xing had also yet to escape from the attacking range of the sonic wave. However, he was strong and he had reacted sufficiently quickly. Hence, he did not instantly burst into a bloody fog like the other unlucky fellows. However, that sonic wave that swept over still caused some blood to churn within his body. A low and deep muffled sound appeared in his throat. Clearly, he had also suffered some injuries.</p><br/><p>Even with the strength of old ghost Zhai Xing, he was unable to endure a sonic wave roar from this Dou Sheng’s skeleton. Hence, this sonic wave could be truly considered the scythe of a death god for most people belonging to the Hall of Soul.</p><br/><p>Quite a number of experts within the large hall were currently still chasing the three remaining scrolls. The sharp sonic wave spread with a lightning speed. The many figures in the mid air suddenly stiffened. Immediately, a ‘bang’ sounded and they blasted apart like a blood fog. In an instant, the entire large hall had been filled with a rich blood fog.</p><br/><p>This sudden bloody scene had also caused everyone to wake up from the allure of the Tian class Dou Skill. Some shock swiftly surged up their faces. Dou Qi surged out from their bodies without being held back as the many figures withdrew a great distance from the centre of the large hall in a miserable manner, appearing like dogs, which had lost their homes.</p><br/><p>The sonic wave spread. After causing this slaughter that caused one’s heart to feel a chill, everyone finally scattered with some ugly expression. They looked at the slowly scattering blood fog in the midair. A rich shock and chillness appeared within their hearts. At least a hundred people had died under that sonic wave earlier. Amongst these people were two elite Dou Zuns!</p><br/><p>“A sonic wave that can kill even elite Dou Zuns…”</p><br/><p>Everyone who had escaped a calamity violently swallowed a mouthful of saliva at this moment. Even an expert like that black robed old man from the Heaven Demon Phoenix tribe also had a face covered with cold sweat at this moment.</p><br/><p>“Old ghost Zhai Xing, what have you done?”</p><br/><p>Tang Zhen, who had recovered from this unexpected change, suddenly turned their furious eyes towards old ghost Zhai Xing, who had escaped. His voice was furious as they spoke.</p><br/><p>Everyone turned their furious eyes towards old ghost Zhai Xing when they heard Tang Zhen furious voice. All of them had clearly saw that this manner was caused by this old ghost.</p><br/><p>Upon being stared at furiously by so many experts, even old ghost Zhai Xing ended up twitching the corner of his mouth. His mouth was filled with bitterness. He had also never expect that things would suddenly become like this. A skeleton that had clearly lost all of its strength was actually be able to suddenly unleash such a frightening strength.</p><br/><p>Xiao Yan’s group did not suffer much injuries because they were quick to pull back. However, the skin on their heads were involuntarily numb when they saw that there were less than half of the number of people left within the large hall at this moment. Was that skeleton not a little too frightening?</p><br/><p>“The old me is unaware of why that skeleton that had been dead for countless number of years will suddenly erupt. A couple of experts from our Hall of Soul are also dead…” Old ghost Zhai Xing inhaled a deep breath of air and spoke in a deep voice with the intent of washing off his responsibility. There were many experts present. It was impossible for him to offend all of them with his strength alone.</p><br/><p>“If it was not because your fresh blood had landed on the skeleton, how would it have awakened? Are you trying to shrink from your responsibility after things had become like this?” Xiao Yan laughed coldly when he heard the explanation.</p><br/><p>The expression of old ghost Zhai Xing changed when he heard these words from Xiao Yan. However, upon sensing an increasing number of furious gazes from around him, he could only cup his hands together and said, “This matter is indeed because of the recklessness of the old me. However, the most important thing now is not to hold others accountable. If the old me guess correctly, that Dou Sheng skeleton should be a thought left behind by that expert when he was alive. It is not difficult to deal with. As long as we join hands, we will definitely be able to suppress it.”</p><br/><p>“Just a thought alone is already so frightening. If another of that sonic wave earlier arrives, it was likely that not many people in this place can survive.” Tang Zhen’s expression was as deep as water. Quite a number of experts from the Burning Flame Valley had been killed by the sonic wave. If it was not because now was not the right moment, he would have been unable to control himself and attack old ghost Zhai Xing.</p><br/><p>“Since we have already obtained the scroll, all of us should just leave. This things is too frightening…” Someone within the crowd softly said. His voice contained a horror that could not be hidden. That kind of strength was really too frightening.</p><br/><p>“It is not possible to leave. This thought will definitely finish off everyone who has barge into the remains. Should we flee, it is likely that no one will be able to leave alive.” Old ghost Zhai Xing spoke in a deep voice.</p><br/><p>Xiao Yan narrowed his eyes slightly. He felt that this old ghost seemed to really desire to finish off this Dou Sheng’s skeleton. However, given old ghost Zhai Xing’s cautious character, he would definitely not risk his life like this for no reason…</p><br/><p>Old ghost Zhai Xing’s words had also stirred some chaos. Some of the weaker individuals had an even richer horror on their faces. However, no one dared to turn around and flee.</p><br/><p>“Creak…”</p><br/><p>During the time when even was in a chaos, the interior of the large hall that was permeated by a blood fog suddenly emitted a slight sound of bone moving. This sound immediately silenced all the commotion. Numerous horrified eyes were staring at the middle of the large hall permeated by a blood fog. Horror spread in an increasingly serious manner at this moment.</p><br/><p>“Clatter clatter…”</p><br/><p>The sound of bone touching the ground became closer. That sound was not loud but it appeared to be stepping on everyone heart, causing everyone to feel extremely pressured.</p><br/><p>“Be careful… do not separate.”</p><br/><p>Xiao Yan’s expression was grave. He turned his head and softly spoke to Little Fairy Doctor’s group. This situation seemed to have already exceeded their control. It would really be too frightening for the skeleton of a Dou Sheng to be revived.</p><br/><p>Little Fairy Doctor and the rest also nodded. If things were not done properly this time around, it was likely that everyone here would end up dying, It was likely that hardly anyone present could forcefully resist the kind of sonic wave attack from earlier.</p><br/><p>The blood fog within the large hall slowly rippled under the gaze of everyone. Immediately a blood red skeleton that had been dyed red took slow steps out of the blood fog and appeared in front of everyone’s gazes.</p><br/><p>“Those who barge into the remains shall die!”</p><br/><p>The blood coloured skeleton halted its footsteps a hundred metres in front of everyone. It raised its head. Blood light flickered within those empty eyes. An ancient hoarse indifferent voice quietly resounded within the large hall.</p><br/>\n</div>"}