{"title": "Chapter 1270: Hei Qing", "id": 1270, "volume": 13, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1270-hei-qing", "volume_title": "Volume 13", "body": "<h1>Chapter 1270: Hei Qing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1270: Hei Qing</u></strong></p><br/><p>The overbearing furious laughter was just like a thunder from the heavens that swept over the entire sky. The extremely powerful dragon’s might that was contained in the furious laughter caused the Dou Qi within the bodies of quite a number of people to appear a little blocked at this moment.</p><br/><p>“Ancient Void Dragon!”</p><br/><p>Huang Xuan trio’s eyes were shocked as they looked at the strong figure, which had stepped out from within the spatial crack line. A horror finally surged up their hearts. Although the Heaven Demon Phoenix tribe was a tip tribe that was on par with the Ancient Void Dragon in the Magical Beast world, they understood that the ultimate being in the Magical Beast world had always been the Ancient Void Dragon. Although the Heaven Demon Phoenix tribe had been tolerating this position for many years, they still did not dare to perform even the slightest unusual activity. During the ancient times, even their ancestors, the Heaven Phoenix tribe, had difficulty suppressing the Ancient Void Dragon, much less they, the descendants of these Heaven Phoenix?</p><br/><p>Huang Xuan trio could still put on a strong front when facing Zi Yan, who was a child Ancient Void Dragon. However, in front of a true matured Ancient Void Dragon, that strong front had disappeared faster than anything else.</p><br/><p>The three of them swiftly exchanged glances. Dou Qi suddenly surged within their bodies as they forcefully tried to escape from the solidified space. Their bodies flashed and they withdrew explosively.</p><br/><p>“Slam!”</p><br/><p>However, the three of them had just moved when the strong human figure that had strided out of some space let out a cold laughter. He strided forward and his large hand violently slammed downwards across the distant space. After which, everyone were stunned to see that a clear sound was suddenly emitted from the faces of Huang Xuan trio. A blood red palm imprint had appeared on the faces of the three of them.</p><br/><p>“Grug!”</p><br/><p>Huan Xuan trio immediately spat out a mouthful of fresh blood after this palm slammed downwards. Their bodies flew backwards, appearing as though they had suffered a heavy blow. Finally, he violently landed on the ground in front of the shocked gazes from the many experts of the Heaven Demon Phoenix tribe. The frightening force smashed the incomparably hard square until three enormous deep pits were formed.</p><br/><p>“Hiss…”</p><br/><p>Everyone violently inhaled a breath of cool air as they watched Huang Xuan trio, who were lying in the deep pit while being covered with fresh blood. Cold sweat continued to flow on the face of Feng Qing Er’s group. A terrified expression was present. Three experts, who had reached the strength of a five star Dou Zun, were actually… unable to even endure a slap from that Ancient Void Dragon?</p><br/><p>Xiao Yan’s group in the sky was also speechless at this scene. They faced each other. After which, they watched the strong back beside Zi Yan. Their hearts were completely shakened. Was this the strength of a matured Ancient Void Dragon? It was indeed frightening. According to Xiao Yan’s guess, it was likely that the strength of this Ancient Void Dragon would have at least reached that of a seven to eight star Dou Zun level. Otherwise, it was impossible for him to easily beat up Huang Xuan trio until the latter did not have any ability to retaliate.</p><br/><p>The entire sky had become quiet because of the ruthless slam. That Bing He zun-zhe in the distance, who was engaging in an intense battle with Tang Zhen, was shocked to the point that he hurriedly stopped fighting. His forehead was covered with cold sweat. Ancient Void Dragon. This was the most mysterious Magical Beast tribe in the continent. Even he had hardly even seen it a couple of times. Unexpectedly, he had once again seen one today.</p><br/><p>“Just who exactly is that Xiao Yan? Not only can he get the help of the Gu clan but now, he can even summon an Ancient Void Dragon over… this person… cannot be offended!” This thought swiftly flew within Bing He zun-zhe’s heart. An extreme fear towards Xiao Yan had quietly surged deep within his heart at this moment.</p><br/><p>“Who else dares to come snatch it?”</p><br/><p>The strong figure crossed his hands across his chest and simple stood in the sky in this random manner. That incomparable overbearing feeling spread. No one in this entire square dared to open their mouth to speak.</p><br/><p>“Mister is likely an elder in from the Ancient Void Dragon tribe. Yet, you are acting mightily in front of us, these younger generation of the Heaven Demon Phoenix tribe. What ability do you have?”</p><br/><p>The white haired man was usually an extremely haughty individual. He involuntarily cursed quietly when he saw so many experts from the Heaven Demon Phoenix tribe was frightened by the expert of the other party until none of them dared to reply. Immediately, he spoke in a deep voice.</p><br/><p>“Your Heaven Demon Phoenix tribe actually have the face to say such words to the old me? Those three frivolous birds earlier had done such a thing.” The large man wearing a simple skin clothes on the empty space lowered his head and looked down at the white haired man. He immediately said, “Those who do not wish to suffer a punch should roll aside. Don’t grumble to this father. The old me already see all of you frivolous birds as an eyesore. Is this Dragon Phoenix Origin Fruit something that you can meddle with?”</p><br/><p>The large man’s ‘this father’ revealed his domineering aura. The faces of quite a number of people became distorted. From these words, they understood that there was no need to talk reason with him. Instead, one should use one’s fist to talk. Those whose fist were not hard enough should get lost…</p><br/><p>The face of the white clothed man alternated between green and white. He clenched his fist tightly but did not dare to continue saying anything. Given the strength of the large man, a punch was sufficient to kill him.</p><br/><p>“Cough…”</p><br/><p>Huang Xuan trio had finally climbed up miserably from the deep pit on the square. They wiped off the fresh blood on their faces and looked at each other. They appeared a little dispirited. It seemed that there was completely no chance to get Dragon Phoenix Origin Fruit. Even if the Heaven Demon Phoenix tribe could really continue dispatching an expert that could match him, the Ancient Void Dragon would definitely not allow the Heaven Demon Phoenix tribe to obtain it since they had already noticed the Dragon Phoenix Origin Fruit.</p><br/><p>“Little girl, this time around, Uncle Hei is not late, right?”</p><br/><p>The large man finally turned around and spoke smilingly towards Zi Yan after deterring the entire place.</p><br/><p>“There is still that old bastard!” Zi Yan turned her small hand,pointed towards old ghost Zhai Xing a short distance away and said.</p><br/><p>The expression of old ghost Zhai Xing immediately changed when he saw Zi Yan pointing over. He put up a brave front and cried out, “The old me is a member of the Hall of Soul!”</p><br/><p>“What nonsense soul. Do you think that the Hall of Soul will dare to declare war against our Ancient Void Dragon if I beat you up?” That large man, who called himself Uncle Hei, widened his eyes. His fan like large hand was once again lifted and it violently slapped at old ghost Zhai Xing from a distance.</p><br/><p>The large man waved his hand. Xiao Yan’s group had sensed that an extremely mysterious ripple had suddenly been lifted in the space. It was this kind of ripple that had transmitted the frightening strength of that large man over within an instant.</p><br/><p>“I have heard that the Ancient Void Dragon possessed a talent to shuttle through the empty space. It is likely that their usage of spatial strength is something that no one can compare with…” Xiao Yan muttered to himself within his heart.</p><br/><p>The expression of old ghost Zhai Xing became extremely ugly when he saw the large man attacking as he pleased. Dou Qi hurriedly surged out from his body and formed a defence on it.</p><br/><p>“Bang!”</p><br/><p>A frightening strength merged into the space almost instantly. After which, it poured onto the body of old ghost Zhai Xing. A redness directly surged up the latter’s face. A mouthful of fresh blood was also involuntarily spat out. His body also miserably staggered backwards by a couple of dozens of metres before slowly stabilizing itself.</p><br/><p>“Move further away. People like you are not qualified to touch the people here!”</p><br/><p>The large man’s expression became cold as he cried out sternly after sending old ghost Zhai Xing rolling away.</p><br/><p>Old ghost Zhai Xing rubbed away the fresh blood on the corner of his mouth. He clenched his fist tightly and his eyes contained a dark chillness as well as an unwillingness. However, it was suppressed in front of the absolute strength of the large man. He also understood that it was pointless to say anything more. Instead, it would only invite even more fists. With the help of the Ancient Void Dragon today, he could only just stare at those Dou Sheng bones on Xiao Yan’s body.</p><br/><p>Xiao Yan’s group exchanged gazes with each other as they looked at the silent square. They let out a bitter laughter. This was definitely the absolute pressure from strength. Everything was useless in the face of true strength.</p><br/><p>“Yes, you have done quite well… this time around, I will not complain about you.” Zi Yan was also quite satisfied when she saw the situation. She nodded and spoke in a magnanimous manner.</p><br/><p>The large man was speechless when he heard the word ‘complain’. His face was depressed. Clearly, he had suffered quite a lot of losses.</p><br/><p>“Humph, you can be considered to be quick this time around. Should anything happen to the Dragon Phoenix Origin Fruit, it is not something that can be make up with by confinement…” Zi Yan curled her small mouth and snorted softly.</p><br/><p>“Hee hee…”</p><br/><p>The large man, who called himself uncle Hei, rubbed his head and laughed. He naturally understood the importance of the Dragon Phoenix Origin Fruit. If this thing was to really land in the hands of the Heaven Demon Phoenix tribe, those old fellows within the clan would definitely not let him off easily.</p><br/><p>“Hey, this is Hei Qing. He is also a tribe member of the Ancient Void Dragon tribe… they are my friends.” Zi Yan turned her head and smilingly spoke to Xiao Yan’s group. The last sentence was naturally spoken to the large man called Hei Qing.</p><br/><p>“Xiao Yan greets elder Hei Qing.”</p><br/><p>Xiao Yan cupped his hands together. He was aware that although this large man did not appear very old, he was definitely an old demon who had lived for countless number of years.”</p><br/><p>“Oh… you are that Xiao Yan huh. Uh uh… Xiao Xuan’s descendant. It is unexpected that the Xiao clan can still produce such a person. It is indeed worthy of once being one of the eight ancient clans… unfortunately, the bloodline seemed to have turn into scrap.” Hei Qing glanced at Xiao Yan and smilingly said. His last sentence, however, was something that only he himself could hear.</p><br/><p>“Xiao Xuan? Eight ancient clans?” Xiao Yan was startled. He had heard the term in front. Xiao Xuan, the most outstanding ancestor of the Xiao clan. However, he was a little at a loss about the term behind.</p><br/><p>“When I became acquainted with that fellow Xiao Xuan back then, I… was almost the same age as Zi Yan.” Hei Qing parted his mouth and smiled. He patted Zi Yan’s head. However, he did not reply to the questions. Changing the topic, he waved his large hand and said, “Let’s not talk anymore and leave. I will bring all of you away from here. Otherwise, these fretful fellows will start chipping away again.”</p><br/><p>Although Xiao Yan was filled with doubt, it was inappropriate for him to say anything when he heard this. All he could do was to nod his head.</p><br/><p>Hei Qing’s large hand was randomly waved when he saw this situation. The empty space in front of him also formed a crack line. After which, he took the lead to step into it in front of the many gazes. Xiao Yan and the rest behind hesitated for a moment before following him into it.</p><br/><p>After the final person stepped into the spatial crack line, Hei Qing’s cold cry rumbled from the crack line and resounded by the ears of everyone from the Heaven Demon Phoenix tribe.</p><br/><p>“Humph, Heaven Demon Phoenix tribe, all of you better hold back a little when you do anything from now on. Do not really think that just because my Ancient Void Dragon will not appear. Our tribe is not even afraid of the Ancient Heaven Phoenix, much less you descendants who relies on the inheritance of the Heaven Phoenix blood!”</p><br/><p>The expression of Huang Xuan’s group became unusually ugly when they heard this cry that was filled with a dense threat.</p><br/>\n</div>"}