{"title": "Chapter 1280: Unleash", "id": 1280, "volume": 13, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1280-unleash", "volume_title": "Volume 13", "body": "<h1>Chapter 1280: Unleash</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1280: Unleash</u></strong></p><br/><p>“Bang!”</p><br/><p>Two human figures that were covered by vast and mighty Dou Qi clusters collided violently in the sky. Frightening earthshaking noise shot towards the cloud. Even the clouds that floated in the sky had been shaken until they scattered at this moment. No one dared to step within a thousand feet radius of the two. With such a terrifying Dou Qi attack, it was likely that even an ordinary elite Dou Zun would have difficulty blocking it.</p><br/><p>“Ha ha, how enjoyable!”</p><br/><p>Xiao Yan violently collided with old ghost Zhai Xing. The strong and fierce force shook Xiao Yan until he pulled back by over a dozen steps. His face was also covered with a desire to battle. Due to there being too big of a gap when they battled with old ghost Zhai Xing earlier, he was unable to exchange blows head on with the other party. All he could do was to rely on his speed and agility to dodge. After which, he began to display his Dou Qi attack. It was the first time this kind of bold head on collision had occurred.</p><br/><p>Compared with Xiao Yan’s loud laughter, old ghost Zhai Xing’s expression had become increasingly gloomy. In front of the many experts within the Hall of Soul, he, a Hall of Soul Tianzun, was unable to finish of a younger generation even after such a long time. He had really lost a great amount of face.</p><br/><p>“You can just try to act strong in front of the old me. The old me shall see just how many lives can the Falling Star Pavilion fork out to let you squander!” Old ghost Zhai Xing inhaled a deep breath of air. His tone had suddenly become sinister as he spoke.</p><br/><p>Xiao Yan’s eyes took the opportunity to sweep around the interior of the star realm when he heard this. His heart sunk a little. Although some of the Elders in the Falling Star Pavilion were still able to fight with the experts from the Hall of Soul, those ordinary disciples were no match for them. Although they relied on their large number to prevent too many deaths, there would also be occasionally some Falling Star Pavilion disciples dying from the sneak attacks by the experts from the Hall of Soul.</p><br/><p>“I really cannot continue to drag this out. There is a need to finish off this old ghost quickly…”</p><br/><p>Xiao Yan mused a little in his heart. After which, he slowly nodded. He quietly took out a couple of medicinal pills to recover Dou Qi from his Storage Ring and stuffed all of them into his mouth. However, he did not immediately swallow them. After doing all these, his gaze finally turned towards old ghost Zhai Xing. He let out a cold laughter and the Dou Qi within his body followed a strange path and circulated rapidly.</p><br/><p>Following the circulation of his Dou Qi, a dark golden light gradually appeared on Xiao Yan’s right palm. At the same time, his feet stepped gently on the air and walked towards old ghost Zhai Xing.</p><br/><p>Seeing Xiao Yan slowly walk over, a ferocious smile also surfaced on old ghost Zhai Xing’s face. Xiao Yan adopted the intention of ending this battle as soon as possible and it was the same for him. With his eyesight, he could naturally tell that Xiao Yan was displaying a Dou Technique. However, he did not care. The only that Xiao Yan could frighten him with was the fire lotus that relied on the merger of four types of flames. Other than this, he did not think that Xiao Yan could possess any threat towards him. Even though Xiao Ya’s strength could barely fight head on with him now, he also understood that this ability to fight was something that Xiao Yan had forcefully obtain by using the secret technique. Once the secret technique reach its time limit, it would be an easy matter to kill Xiao Yan.</p><br/><p>“Now, allow the old me to let you see just what is the true strength of a five star Dou Zun!”</p><br/><p>The ferocious expression on old ghost Zhai Xing’s face became increasingly wide. Vast and mighty Dou Qi spluttered. After which, it transformed into a viscous substance. It wiggled strangely before agglomerating into a dark black ghost head blade. This large blade was extremely strange. A layer of strange dark black crystal covered it. The blade’s edge gently cut through the air and a thumb size crack line suddenly appeared.</p><br/><p>Old ghost Zhai Xing’s hand held the large blade tightly. His gaze was dense as he watched Xiao Yan walking over slowly. Numerous afterimages were suddenly formed by the large blade. After which, it hacked down furiously from across the space.</p><br/><p>“Shattering Star Blade!”</p><br/><p>After old ghost Zhai Xing’s low and deep roar resounded over the place, the entire sky suddenly became dark. Countless number of stars were suspended behind old ghost Zhai Xing. After which, they transformed into numerous small rays of light that gathered onto the large blade. Following the gathering of these rays of light, the energy on the large blade also became increasingly frightening!</p><br/><p>“Die!’</p><br/><p>Old ghost Zhai Xing smiled in a dense manner. The blade hacked downwards. Following the fall of this blade, the space in front of him fell apart almost instantly. Numerous spatial crack line appeared. Finally, a thousand feet large sharp blade glow forcefully split the space in front in an incomparably overbearing manner. It transformed into a lightning that shot explosively towards Xiao Yan!</p><br/><p>Such a powerful blade glow suddenly appeared in the sky. It immediately attracted the focus of countless number of eyes. A surprised expression immediately surfaced in the eyes. Star shattering blade. This was the greatest trump card of old ghost Zhai Xing. Countless number of experts had died under this blade. However, after old ghost Zhai Xing had joined the Hall of Soul, he had seldom met any expert who could cause him to once again display this greatest trump card of it. Unexpectedly, it could be currently seen in this place…</p><br/><p>“Old ghost Zhai Xing Star Shattering Blade can be considered to be at the peak of the Di class Dou Techniques. Its strength is extremely shocking. There are very few Dou Technique of the same class that could forcefully receive this attack. That Xiao Yan is likely going to be out of luck…”</p><br/><p>Some of the experts observing from outside of the Falling Star Pavilion involuntarily shook their heads when they saw this situation.</p><br/><p>Xiao Yan’s eyes rippled slightly in the face of this frightening sharp blade glow that could tear the world. His slow forward moving footsteps also paused for a moment. The dark golden light on his right palm also became increasingly dense.</p><br/><p>“It is too late to think of escaping now!”</p><br/><p>Seeing Xiao Yan pause his footsteps, old ghost Zhai Xing thought that the former was shakened by this blade glow. He immediately laughed coldly.</p><br/><p>However, Xiao Yan acted as though he did not hear this cold laughter. His gaze focused intently on his right palm. The dark golden colour at that spot had reached the limit of its brightness before an extreme deep black glow finally trembled and surfaced.</p><br/><p>With the surfacing of this black light, the bright golden glow also quickly disappeared. Instead, the black spot became increasingly large. That manner was as though the golden glow’s energy was being swallowed by the black light.</p><br/><p>With the rapid expansion of the black light, Xiao Yan also sensed the Dou Qi swiftly flowing out from his body. He hurriedly swallowed the medicinal pills in his mouth with a ‘gulp’. After which, he suddenly raised his head. At this moment, that thousand feet large blade glow was already a couple of dozen metres in front of him. The sharp wind caused tiny blood traces to appear on his skin.</p><br/><p>“Consider it your honour to be able to die under the Star Shattering Blade of the old me!”</p><br/><p>The blade glow approached. At this moment, even with Xiao Yan’s fast speed, he was unable to dodge the attack. Old ghost Zhai Xing involuntarily laughed out loud when he saw this. This hateful brat would finally die in his hands today.</p><br/><p>“Hu…”</p><br/><p>A faint smile was slowly lifted on Xiao Yan’s face when he heard old ghost Zhai Xing’s loud laughter. His hand suddenly landed heavily on the empty space in front of him. A dense cry suddenly resounded!</p><br/><p>“Great Heaven Creation Palm!”</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s palm landed and the space itself basically collapsed almost instantly. A dark black light sphere that caused one’s heart to feel cold swiftly spread from his palm. After which, it violently collided with the sharp blade glow.</p><br/><p>“Chi!”</p><br/><p>The two collided. The intense explosion that exceeded everyone’s expectations did not appear. That blade glow appeared to have entered a deep bottomless black hole as it charged in. Not the slightest fluctuation was created. Even the rate at which the black light expended was not slowed.</p><br/><p>“Hiss!”</p><br/><p>Everyone inhaled a breath of cool air from shock upon seeing this scene. Their eyes were filled with disbelief. It was likely that few amongst those present could receive that attack of old ghost Zhai Xing, yet… yet that extremely powerful blade glow appeared to be without even the slightest ability to resist under that strange black light sphere.</p><br/><p>“How is this possible?”</p><br/><p>At this moment, everyone’s head were blurry. All they could do was to repeatedly mutter in their minds.</p><br/><p>The disappearance of the blade glow also caused old ghost Zhai Xing to be stunned. He suddenly recovered and looked at the familiar black light sphere. Those eyes of his abruptly widened as he exclaimed, “Great Heaven Creation Palm? Tian class Dou Technique? How did you obtain it?”</p><br/><p>Old ghost Zhai Xing had personally witnessed the Great Heaven Creation Palm at the ancient remains back then. That frightening strength was something that was deeply ingrained in his memory even until now. This kind of Tian class Dou Technique, which he greatly coveted, had actually landed in Xiao Yan’s hand!</p><br/><p>“It’s those three ribs!”</p><br/><p>Old ghost Zhai Xing could be considered to have reacted quickly. He almost immediately recalled the three ribs that Xiao Yan had ripped from the skeleton that day. Clearly, if the Tian class Dou Technique really did exist, it should be on those ribs.</p><br/><p>“This cunning bastard!”</p><br/><p>Old ghost Zhai Xing’s heart was bleeding from regret. His expression became gloomy as he looked at the spreading black light sphere. His body hurriedly pulled back.</p><br/><p>“You wish to escape?”</p><br/><p>Xiao Yan merely laughed coldly when he saw old ghost Zhai Xing fleeing. His hand suddenly shook and the black light sphere expansion rate suddenly increased. At the same time, an incomparable suction force surged out from within the dark black light sphere.</p><br/><p>Under this suction force, old ghost Zhai Xing’s speed immediately slowed. After which, he was shocked to see the black light sphere spreading over rapidly. The fear of death finally climbed onto his heart at this moment. He clearly understood that if he was sucked into the light sphere, it was likely that even he would die immediately.</p><br/><p>“Bang bang bang!”</p><br/><p>Old ghost Zhai Xing hurriedly unleashed numerous powerful Dou Qi pillars at this critical moment where death approached. However, these attacks did not even create a ripple when landing on the light sphere before they strangely disappeared. This kind of endless devouring caused a helplessness to surge up old ghost Zhai Xing’s heart.</p><br/><p>“Die!”</p><br/><p>Xiao Yan’s eyes turned chilly as he watched old ghost Zhai Xing, who was in close proximity. The rate at which the light sphere spread suddenly increased.</p><br/><p>“Ninth Tianzun sir, please save me!”</p><br/><p>Old ghost Zhai Xing, who was unable to escape after using all of his abilities, finally opened his throat at this critical moment. A miserable sharp roar resounded over the sky.</p><br/>\n</div>"}