{"title": "Chapter 1283 - Ban (Half) Sheng", "id": 1283, "volume": 13, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1283-ban-half-sheng", "volume_title": "Volume 13", "body": "<h1>Chapter 1283 - Ban (Half) Sheng</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1283: Ban (Half) Sheng</u></strong></p><br/><p>The spatial crack line slowly spread and the icy bone chilling monstrous aura also permeated the place. Immediately, a white figure finally slowly stepped out from the space. Finally, it appeared in front of the countless number of eyes.</p><br/><p>“Ninth, it is expected that you have actually activated the spatial jade piece…”</p><br/><p>The white figure slowly appeared as an indifferent voice sounded.</p><br/><p>“Humph, stop being annoying. You should take a good look at the opponent this time around!” Ninth Tianzun frowned and spoke in a deep voice.</p><br/><p>The white figure slowly raised his head when he heard ninth Tianzun words. He had an old face and his hair was white. Even both of his eyes were dense white in colour, causing one to feel a kind of extremely icy cold feeling. At a glance, he appeared just like a block of ice.</p><br/><p>“Yao Chen huh…”</p><br/><p>The white figure’s eyes paused on Yao Lao’s body a short distance in front. He was slightly startled before he immediately seemed to have sensed something. A little ripple appeared in his white eyes. “You have recovered your strength?”</p><br/><p>“The Hall of Soul is really well prepared. It is still not rest assured despite dispatching a ninth Tianzun. It has actually dispatched even you.” Yao Lao glanced at that eighth Tianzun and spoke faintly.</p><br/><p>“No wonder… with your strength alone, you are indeed no match for him. It seems that the loss from today’s mission is quite great.” Eighth Tianzun’s snow white brows twitched a little. He glanced at those experts from the Hall of Soul fleeing into the distance before speaking.</p><br/><p>“He has just regained a body. Although his strength has recovered, it will have difficulty reaching its peak. I alone might not be sufficient but if the two of us were to join hands, it is not possible to tell just who will be defeated.” Ninth Tianzun’s expression was slightly sinister as he said.</p><br/><p>“You should not underestimate this old fellow…” Eighth Tianzun knitted his brows and said.</p><br/><p>“Why? Are you afraid? We are the leaders of this mission. If it fails, it is likely that we will have difficulty accounting to the top, no?” Ninth Tianzun glanced towards eighth Tianzun when he spoke until this point. He continued, “Moreover, you have once been defeated in his hands back then. It has been a sore point for you all these while. If you do not make an attempt today, it is likely that you will no longer have such an opportunity in the future.</p><br/><p>Hearing this, the hand of eighth Tianzun, which was fondling his beard, paused. Some fluctuating rose within his white eyes. A moment later, he nodded slowly and said, “In that case… let’s attack. I also really wish to know if the current Yao Chen is as mighty as the one back then…”</p><br/><p>“Relax, with us combining our strength, we will be able to fight even a nine star Dou Zun. Currently, Yao Lao had just obtained his body and will definitely be unable to use it with great familiarity. It is not bad for him to possess even seventy to eighty percent of his strength…” Ninth Tianzun laughed. Immediately, his eyes became stern. He clenched his hand suddenly and a vast and mighty fluctuation spread from his hand. Following the spreading of this ripple, the entire place quickly became moist. Rain droplets were formed out of nowhere. At a glance, they were densely packed together and appeared to stretch endlessly.</p><br/><p>Xiao Yan stood on the top of a mountain. He frowned slightly as he watched those raindrops in front of him. His hand grabbed one of them, only to be startled to find that the interior of this raindrop contained an extremely dense water affinity energy. Although this kind of energy appeared gentle and calm, it possessed an extremely strong erosion properties. Based on Xiao Yan’s guess, if this droplet of strange raindrop was to be shot over at great speed, it would likely be easily able to penetrate through the Dou Qi defence of an expert Dou Huang.</p><br/><p>Just one droplet alone possessed such a terrifying destructive strength. Just how terrifying the destructive strength would be should the densely packed endless raindrops in the sky gather together?</p><br/><p>“It is said that the advancement of every star in the Dou Zun class would cause one’s strength to soar greatly. These words are indeed true…”</p><br/><p>Xiao Yan softly muttered. He currently had the strength of a two star Dou Zun. After unleashing the Skyfire Three Mysterious Change, he was only able to reach the strength of a four star Dou Zun. Moreover, this was because the materials he used to unleash the Skyfire Three Mysterious Flame were three types of Heavenly Flames. If it was some other flames, it was likely that he would not even be able to raise his strength by one star.</p><br/><p>Moreover, despite Xiao Yan having reached the strength of a four star Dou Zun, he only possessed two methods to kill someone of old ghost Zhai Xing’s strength. One was to merge the Annihilation Lotus Flame with four Heavenly Flames. The other was to rely on the Tian class Dou Skill, Great Heaven Creation Palm, that he had learnt. Other than these, he no longer had any methods.</p><br/><p>From this, one could tell just how great the different between the levels within the Dou Zun class was. If one did not possess a special technique, it was quite difficult to fight across the levels.</p><br/><p>Yao Lao stood in the air in the distant sky. His eyes were calm as he watched the mysterious raindrops that spread across the sky. Any raindrop that appeared within a thousand feet from him would explode the moment it was formed.</p><br/><p>At this moment, everyone’s eyes, regardless of whether it was the disciples of the Falling Star Pavilion or the experts in the distance, were gathered in the sky. Everyone could tell that these two top experts within the Hall of Soul were preparing to unleash a truly earthshaking attack at this moment...</p><br/><p>“Gather!”</p><br/><p>Ninth Tianzun’s expression was unusually grave at this moment. A sharp cry had suddenly sounded from his throat as the seals formed by his hands changed.</p><br/><p>After the sharp cry by ninth Tianzun sounded, the mysterious rain droplets that filled the sky immediately shook. They immediately rushed explosively towards him amidst waves after waves of air splitting ‘swoosh’ sound. Finally, it swiftly agglomerated in front of ninth Tianzun. Within the blink of an eye, a thousand feet large azure rain ball had slowly appeared…</p><br/><p>The rain ball was enormous. It was completely blue in color. While it rotated slowly, the monstrous energy that spread from it caused the expressions of quite a number of people to turn ashen. If this energy was to explode, it was likely that this mountain range would be wracked and flattened in an instant…</p><br/><p>When the rain ball was formed, eighth Tianzun by the side also inhaled a deep breath of air. He raised his hand and pointed towards the rain ball from a great distance. Dense white chilling air suddenly spluttered out from his hand. Finally, it adhered onto the rain ball.</p><br/><p>“Crack, craack!”</p><br/><p>The dense white ice swiftly spread apart upon making contact with the rain ball. Within a short moment, that blue rain ball had become an enormous ice ball. Moreover, the energy that it contained within it was also becoming increasingly frightening.</p><br/><p>The strength of a Dou Skill that two elite Hall of Soul experts joined hands to unleash was sufficient to shatter even one’s soul!</p><br/><p>“Things has become a little out of hand this time around…”</p><br/><p>Those experts in the distance looked at the enormous ice ball in the sky. The terrifying energy fluctuation that spread from the ice ball caused even their souls to feel pressured. While their face was pale, these people also began to withdraw. If such a frightening energy was to explode. The entire mountain range would be flattened. They would likely also be buried with this place.</p><br/><p>“Swoosh swoosh swoosh…”</p><br/><p>The expression of Feng zun-zhe’s group within the Falling Star Pavilion was solemn as he watched those experts swiftly pulling back. From the looks of the energy contained within this ice ball, it was likely already too late to escape even if they started running now…</p><br/><p>“Yao Chem, back then, this venerable self was defeated in your hands. I wonder if you have the ability to blocked this combined attack of the two of us today!”</p><br/><p>Eighth Tianzun’s face had become a little paler after he turned the rain ball into an ice ball. Clearly, this attack had exhausted quite a great amount of his strength.</p><br/><p>Yao Lao merely twitched his eyebrows in the face of the loud cry by the eighth Tianzun. There was little emotional fluctuation on his face. It was as though the enormous ice ball that could destroy the mountain range did not exist.</p><br/><p>“Humph, I want to see just how long you can try to act brave!”</p><br/><p>Ninth Tianzun involuntarily laughed coldly in the face of this calmness by Yao Lao. Both of his hands formed numerous seals with lightning like speed. A moment later, his face suddenly reddened. A mouthful of fresh blood was spat out and shot onto the enormous ice ball. An explosive cry suddenly sounded.</p><br/><p>“Rain Heaven Erosion!”</p><br/><p>A cry that was filled with an incomparable dominance resounded over the sky. Ninth Tianzun duo suddenly pushed forward with their hands. The enormous ice ball shook for a moment before it began to rotate rapidly. Finally, it rushed explosively towards Yao Lao with lightning like speed amidst a deafening rumbling sound.</p><br/><p>During the time that the ice ball rushed forward, a frightening energy ripple spread from it. Every inch of the surrounding space crumbled. A thousand feet large dark black spatial crack line appeared from the empty space like a black ribbon.</p><br/><p>Seeing the destructive strength of the ice ball, those fleeing experts were completely terrified. They went all out to increase their speed as they rushed out of this mountain range.</p><br/><p>Xiao Yan’s expression was grave as he watched the enormous ice ball from the mountain top. Immediately, his eyes paused on Yao Lao, who had not even moved. His heart sighed in relief after seeing the latter’s expression.</p><br/><p>“What a frightening attack… pavilion chief… can he block it?”</p><br/><p>All the disciples of the Falling Star Pavilion were extremely tensed at this moment. In the face of this terrifying strength, even this entire mountain range had become exceptionally small. At such a moment, all that they could do was to place their hope on Yao Lao.</p><br/><p>“Today, you and the Falling Star Pavilion shall be destroyed under the combined strength of the both of us!”</p><br/><p>A wild and heated expression surfaced in the eyes of ninth Tianzun and eighth Tianzun when they saw the frightening ice ball becoming increasingly closer to Yao Lao.</p><br/><p>When the ice ball entered a thousand feet from Yao Lao, the latter finally slowly raised his hand in front of the countless number of gazes.</p><br/><p>An icy cold smile involuntarily surfaced on the faces of ninth Tianzun duo when they saw that Yao Lao was actually thinking of forcefully receiving this ice ball.</p><br/><p>“Stop!”</p><br/><p>However, the smiles of the two had just appeared when it suddenly stiffened under the subsequent faint voice…</p><br/><p>The soft cry was slowly spread from Yao Lao’s mouth. Immediately, everyone was stunned to see that the fast rotating ic ball suddenly stilled when it was still some distance from Yao Lao…</p><br/><p>The entire mountains was deathly silent. That ninth Tianzun duo had a dull expression at this moment. Their combined attack was something that even an expert at the peak of the Dou Zun class could not stop as he pleased!</p><br/><p>Yao Lao’s hand was gently inserted into the enormous ice ball. His calm water like voice slowly resounded over the sky.</p><br/><p>“The current me is indeed unable to unleash my full strength. However, it is more than enough to deal with the two of you. This is because…”</p><br/><p>Upon speaking until this point, an expression of a cat teasing a mouse suddenly appeared on Yao Lao’s face.</p><br/><p>“The current me is no longer at the peak of the Dou Zun class. Instead, it is… Ban Sheng!”</p><br/>\n</div>"}