{"title": "Chapter 1309: Void Lightning Pool", "id": 1309, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1309-void-lightning-pool", "volume_title": "Volume 14", "body": "<h1>Chapter 1309: Void Lightning Pool</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1309: Void Lightning Pool</u></strong></p><br/><p>“Swoosh!”</p><br/><p>An enormous light shadow rushed through empty space like lightning. A strange ripple spread from this light figure and blocked the omnipresent tearing force that was being emitted from the emptiness.</p><br/><p>The light figure gradually approached. Only then would one discover that it was an enormous black dragon. A figure was seated on the head of the large dragon. That figure appeared to be Xiao Yan.</p><br/><p>“The Ancient Void Dragon is worthy of its name. Only they are able to roam around as they please within this empty realm. If some other Magical Beast or human expert tried to roam like this, they would not be able to move so smoothly even if they could fly within this place for short distances.”</p><br/><p>Xiao Yan looked at the empty space that was swiftly flying by. His mouth could not resist letting out a low exclamation. A spatial collapse could occur within this empty realm at any moment. Moreover, the omnipresent tearing force could tear an ordinary elite Dou Zun into pieces. Unless one possessed the ability to preserve one’s life, there were seldom anyone who dared to travel within this emptiness.</p><br/><p>“Little brother Xiao Yan, we should be able to reach the “Void Lightning Pool” that third Elder mentioned…” During the time that Xiao Yan was muttering to himself, that enormous black dragon suddenly spoke with the human language. That tone was surprisingly that of Hei Qing.</p><br/><p>“Aye.”</p><br/><p>Xiao Yan nodded slightly. His heart vaguely felt some anticipation. That so-called “Void Lightning Pool” was where lightning gathered according to Elder Zhu Li. It was rumored that that space was extremely mysterious. It emitted a natural suction force that caused a large amount of energy to gather in chaos before eventually forming into a countless number of thunderbolts. It was usually quite a dangerous area. If Xiao Yan hadn’t been so insistent, Elder Zhu Li would not have mentioned it.</p><br/><p>Hei Qing swung his huge tail in empty space and his enormous body shot forward in a lightning-like manner. In the blink of an eye, a bright glow formed as his body disappeared at the end of the emptiness…</p><br/><p>“Chi!”</p><br/><p>Xiao Yan’s eyes narrowed when he sensed the whistling wild wind that rushed by his ears. A moment later, he discovered that the end of the empty space had begun to vaguely leak a flickering silver light. There was an unusually wild and violent energy materializing there.</p><br/><p>“Have we arrived…”</p><br/><p>Xiao Yan’s heart moved as he sensed this somewhat familiar energy. He slowly stood up on the enormous dragon head as his eyes stared at the silver luster.</p><br/><p>The silver luster was rapidly growing. A rumbling thunder also resonated next to Xiao Yan’s ears in an earth-shaking manner.</p><br/><p>“Hiss…”</p><br/><p>Xiao Yan took in the scene in front of him while standing on the enormous dragonhead. His eyes were filled with shock.</p><br/><p>A nearly ten-thousand-foot-large ‘lake’ appeared in front of Xiao Yan. However, the interior of the ‘lake’ did not consist of ordinary water. Instead, it was filled with bright silver thunderbolts…</p><br/><p>This was a lightning pool that had been formed from thunderbolts!</p><br/><p>Loud rolling thunder roared from the lightning pool as Xiao Yan stood in front of it. It caused one’s heart to trembled. Anyone standing at this spot would feel exceptionally small.</p><br/><p>“What a dense thunderbolt strength…”</p><br/><p>Xiao Yan slowly recovered from this shock a long while later as he muttered to himself. The thunderbolt strength contained within this lightning pool was far stronger than all of the Pill Lightning attracted during the Pill Gathering.</p><br/><p>“It is indeed a dangerous place. Little brother Xiao Yan, are you certain you wish to train here?”</p><br/><p>The enormous dragon that Hei Qing had transformed into studied this spacious lightning pool with astonished eyes. The energy of this place caused even him to feel a little afraid. He had not expected this empty space, which was not very far from the Eastern Dragon Island, to be so dangerous.</p><br/><p>Xiao Yan smiled and nodded. With this lightning pool, he believed that he would be able to repair the damaged Sky Demon Puppet and rapidly increase the strength of the remaining ten Demon Puppets. It would not be impossible for them to be strengthened until they became Sky Demon Puppets.</p><br/><p>If they were able to really reach that stage, Xiao Yan would possess eleven Sky Demon Puppets. This was equivalent to eleven elite Dou Zuns. This lineup was really quite powerful…</p><br/><p>“Old brother Hei Qing, I will enter first. I will send a signal if something happens.” Xiao Yan was anxious to enter the pool. He spoke to Hei Qing with a grin.</p><br/><p>Hei Qing was helpless when he saw that Xiao Yan really wanted to enter the lightning pool. He could only nod his head and say, “I will guard the lightning pool during this period of time until you finish your training. If you meet any unexpected problems, you’ll release the signal we agreed upon earlier, and I will enter and rescue you…”</p><br/><p>“Ha ha, in that case, I will trouble old brother Hei Qing.”</p><br/><p>Xiao Yan grinned. He understood that these were the instructions that Elder Zhu Li had given Hei Qing. He ceased saying anything more and gave one last smile and nod. His toes pressed against the enormous dragon’s head, and his body rushed forward with lightning-like speed. A Heavenly Flame swiftly surged and wrapped around his body.</p><br/><p>“Splash…”</p><br/><p>The moment Xiao Yan charged into the lightning pool, many thunderbolts began to rush over like snakes. These bolts of lightning smashed toward Xiao Yan, but only emitted a slight muffled sound when they came into contact with the Heavenly Flames. Finally, they would be annihilated. Although the thunderbolts were mighty, they were still inferior when compared with a Heavenly Flame that possessed a destructive strength. This qualification and ability is what allowed Xiao Yan to charge into this lightning pool alone.</p><br/><p>A powerful glow erupted around the large black dragon when he saw Xiao Yan land into the lightning pool without a problem. The dragon swiftly turned into a strong figure. Both of his legs were crossed and he sat down within the empty space. His eyes focused on the interior of the lightning pool…</p><br/><p>“Bang bang bang!”</p><br/><p>Silver snake-like thunderbolts continued to detonate within the lightning sea. Xiao Yan quietly stood within the protection of the Heavenly Flame. The surrounding thunderbolts had perhaps become afraid of the strength of the Heavenly Flame since there were not as many thunderbolts wildly attacking Xiao Yan now.</p><br/><p>Seeing that the lightning pool did not riot because of his entry, Xiao Yan also sighed in relief within his heart. He sensed the surrounding thunderbolt strength, hesitated for a moment and finally lifted his foot and walked deep into the lightning pool. He walked in this manner for nearly a thousand feet or so before he finally came to a stop. The lightning strength of this place was quite rich. Moreover, it vaguely gave Xiao Yan a kind of partially present pressure.</p><br/><p>“If I venture deeper, it is likely that the thunderbolt strength would be even more terrifying. At the deepest parts, it was likely that even a Heavenly Flame will not be able to block it…”</p><br/><p>Xiao Yan revealed an expression of deep thought. This empty realm lightning pool had gathered lightning strength for countless number of years. Naturally, it was extremely terrifying. If he was careless and stir the lightning pool’s retaliation, it was likely that he would instantly be turned to ashes even with the protection of the Heavenly Flame...</p><br/><p>“Let’s use this place…”</p><br/><p>After deciding, Xiao Yan ceased hesitating and sat down at this place. He calmed himself down a little and waved his hand. The Sky Demon Puppet, which had been beaten by the Elder of the Profound Sky Sect until many holes were present, flashed and appeared.</p><br/><p>The dark golden glow over the current Sky Demon Puppet was extremely dim. Every part of its body was dented. Some parts of the shrivelled skin were showing signs of cracking.</p><br/><p>“These fellows were really ruthless. Hee, Profound Sky Sect… you will have to pay for this debt sooner or later.”</p><br/><p>Xiao Yan laughed coldly. Immediately, he inhaled a deep breath of air. His sleeve was swung and a gentle force pushed the Sky Demon Puppet in front of him towards a spot a short distance away. That place was one where the thunderbolt strength specially gathered towards…</p><br/><p>Bang bang bang!</p><br/><p>The Sky Demon Puppet had just flown out when the permeating thunderbolt seemed to have been attracted by something. They suddenly turned and wildly smashed onto the Sky Demon Puppet in a violent fashion. However, these seemingly wild and violent thunderbolt were just like water coming into contact with a sponge when they touched the body of the Sky Demon Puppet. All of them would immediately disappear…</p><br/><p>Wild lightning danced within the lightning pool. Numerous hundred feet or even a hundreds of feet large thunderbolt began to revolt violently at this moment. They were accompanied by a rumbling thunder sound that struck towards the Sky Demon Puppet from all directions. Under this kind of wild and violent furious thunderbolts, the dim dark golden body of the Sky Demon Puppet actually began to become bright at an extremely slow pace. Some of its dents gradually protruded out once again…</p><br/><p>This healing speed was extremely slow. The thunderbolt strength in this place might be enormous but in terms of its actual might, it was inferior to a true five coloured pill lightning. Hence, the healing speed was naturally much slower.</p><br/><p>Although it was a little slow, Xiao Yan was still quite satisfied with it. If he was to refine pills in order to attract Pill Lightnings to heal the Sky Demon Puppet, there was no telling just how many high tier medicinal pills he would need to refine. This kind of bitter task would not be any easier than helping Zi Yan refine the Dragon Phoenix crystal layer…</p><br/><p>“According to this speed, the Sky Demon Puppet can likely be completely healed within half a month…”</p><br/><p>Xiao Yan grinned as he watched the Sky Demon Puppet being wrapped by bright thunderbolts. He hesitated for a moment before suddenly flicking his Storage Ring. Ten Earth Demon Puppets appeared beside him.</p><br/><p>“I wonder if these Earth Demon Puppets can be completely strengthened into Sky Demon Puppets here?’</p><br/><p>Xiao Yan licked his mouth. A fiery heat danced within his dark black eyes. If these ten Earth Demon Puppets could be evolved into Sky Demon Puppets and that they were to form a formation with the original Sky Demon puppet, he wondered just what kind of level would the final Sky Demon Puppet formed from the superimposing of strength reach.</p><br/><p>Xiao Yan’s heart immediately became boiling hot when he thought until this point. This kind of increase in strength was really too alluring.</p><br/>\n</div>"}