{"title": "Chapter 1305: Chaos", "id": 1305, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1305-chaos", "volume_title": "Volume 14", "body": "<h1>Chapter 1305: Chaos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1305: Chaos</u></strong></p><br/><p>Numerous rays of light suddenly appeared in the empty space. A moment later, rays of light slowly descended to the Ancient Dragon Island. The light scattered and numerous figures with powerful auras appeared.</p><br/><p>Most of these figures were wearing dark-golden armor. There was a dragon image on their armor. The dragon seemed to vaguely be moving, appearing as though it was alive. It even appeared to be emitting wave after wave of a powerful Dragon Pressure. Other than these people wearing dark-golden armor, there were some human figures with naked upper bodies. These people appeared quite large and strong. They had an awe-inspiring visual impact.</p><br/><p>“It’s the people from the Western Dragon Island and the Southern Dragon Island!”</p><br/><p>Numerous voices that contained some anger immediately reverberated around the Ancient Dragon Island when they saw these human figures.</p><br/><p>“Xia Ao, you actually dare to lead people to my Eastern Dragon Island? What great ability!”</p><br/><p>The space in the sky became distorted. Numerous figures appeared. The old man leading them was Elder Qi You, who had chatted with Elder Zhu Li back then. At this moment, his usually impassive face had become extremely stern. A mighty feeling without anger was vaguely emitted from him.</p><br/><p>“Ha ha, old fellow Qi You, you should not vent your anger on me. I am only here on orders to invite the great person with the royal bloodline back to the Western Dragon Island.” A large man with thick eyebrows wearing a dark-golden armor slowly took two steps forward. When he stepped forward, empty space appeared to tremble. He glanced at Qi You, who was within a defensive barrier and loudly laughed.</p><br/><p>“I’m afraid that the Western Dragon King wishes to imprison the royal bloodline on the Western Dragon Island, no? Hmph, he is merely a branch of the royal bloodline, yet he dares to call himself a dragon king. Isn’t he afraid of killing himself?” Qi You coldly laughed.</p><br/><p>The large man called Xia Ao faintly said, “The current Ancient Dragon tribe has split into four. Regardless of the reason, the Western Dragon King possesses a royal bloodline. He has a stronger gathering ability than you people with ordinary bloodlines. If one were to talk about it, your Eastern Dragon Island is the one that should not exist. Among the four islands, only your island is not led by someone with a royal bloodline. This kind of existence will not be accepted!”</p><br/><p>“It is not up to the other three dragon kings to decide what is acceptable or not. The Ancient Void Dragon tribe does not have whatever North, South, East or West Dragon Kings. It only has the former Dragon Emperor. The remainder do not possess any qualification to implement any tribe rules.” Qi You raised his eyebrows as he replied.</p><br/><p>“Hee hee, I am also too lazy to utter any nonsense to you, old fellow. This time around, I have come under orders. Please hand over the great person who possesses a royal bloodline. Otherwise, this matter will really likely not end well…” Xia Ao curled his mouth as he made a demand.</p><br/><p>“Because of you?”</p><br/><p>Qi You’s expression turned cold. He clenched his fist and a frightening energy hurriedly gathered.</p><br/><p>“Hee, Qi You, in terms of combat strength, your Eastern Dragon Island is the weakest among the four islands. If my Western Dragon Island’s Dragon Armor army were to invade, this Eastern Dragon Island would not be able to endure for long.” Xia Ao waved his hand when he saw that Qi You was preparing to fight. The dark-golden human figures behind him slowly stepped forward. A powerful pressure gathered and spread toward the dragon island.</p><br/><p>When this pressure spread, the expression of Elder Zhu Li, who was deep within the dragon island, slowly became gloomy. He looked at Xiao Yan, who was still seated in front of the large cauldron. He the said in a deep voice, “All of you should protect mister Xiao Yan properly. Do not allow any accidents to occur to him!”</p><br/><p>“Understood!”</p><br/><p>Some low and deep cries were emitted from the surrounding mountains when Elder Zhu Li’s voice sounded.</p><br/><p>Zhu Li only nodded upon hearing their replies. His body moved and disappeared in a strange manner. The next time he appeared, he was already in front of Qi You’s body. He lifted his head and swept his calm eyes over the human figures suspended in empty space. It paused on the group of large human figures with naked upper bodies.</p><br/><p>“The Dragon Armor army from the Western Dragon Island and the Barbarian Dragon army from the Southern Dragon Island. The elite fighters of these two islands have been dispatched. May I know who is the commander of the Barbarian Dragon army?”</p><br/><p>“Ha ha, you are indeed worthy of being Elder Zhu Li. The old me is still discovered by you even though I am hiding by the side…”</p><br/><p>The empty space slowly became distorted after Elder Zhu Li’s voice sounded. A pale-skinned elder wearing simple skin clothes appeared from nowhere and laughed at Elder Zhu Li within the Dragon Island.</p><br/><p>“It is actually Elder Man Yan…”</p><br/><p>Elder Zhu Li glanced at this elder. His voice did not contain too much fluctuation as he indifferently spoke.</p><br/><p>“Elder Zhu Li, hand the person over. We have come under orders… the Ancient Void Dragon tribe has already become like this. I think that it will be extremely difficult to unite the tribe again. The three great Dragon Kings will not allow such a thing to happen.” Man Yan sighed. He he looked at Zhu Li before speaking in a deep voice.</p><br/><p>“What nonsense! Hand over? Do you really think that my Eastern Dragon Island can be bullied? If the First Elder and Second Elder weren’t both undertaking a deep retreat, would the three islands dare to come to my Eastern Dragon Island to act arrogantly?” A figure suddenly rushed to the sky. He cried out loud without being afraid of the pressure that spread from the many experts from the Western Dragon Island.</p><br/><p>“Hei Qing, you still possess this terrible temper that asks to be beaten up.” Xia Ao glanced at Hei Qing. After which, he turned to Man Yan and said, “We do not have much time to waste. Let’s attack…”</p><br/><p>After his words sounded, the dark-golden dragon armor on Xia Ao’s body suddenly emitted a bright-golden light. A monstrous aura swept out of their bodies like a storm. A deep dragon roar was faintly emitted from the golden light.</p><br/><p>“Dragon Armor army, attack. Bring back the great person who possesses the royal bloodline!”</p><br/><p>Xia Ao suddenly waved his hand. The many figures wearing dragon armor all let out a stern cry in unison. Fierce auras surged out. They transformed into numerous rays of light that charged explosively into the Ancient Dragon Island.</p><br/><p>“Ugh... let’s attack.”</p><br/><p>Man Yan sighed and gave a command when he saw them attack.</p><br/><p>The human figures with naked upper bodies nodded when they heard his order. Their arms rapidly shook when they clenched their fists. In the blink of an eye, their two arms transformed into dragon claws that were covered with pale-purple scales. Their bodies flashed and charged into the Ancient Dragon Island.</p><br/><p>“Stop them!”</p><br/><p>Elder Zhu Li cried out in a deep voice. His face turned gloomy when he saw the many figures charging into the Dragon Island.</p><br/><p>“Understood!”</p><br/><p>Numerous blurry figures suddenly charged over from the Ancient Dragon Island after Elder Zhu Li’s voice sounded. In an instant, vast and mighty auras swept over the sky. The muffled sound of flesh colliding violently with other flesh and the loud explosions of energy resonated across the sky.</p><br/><p>“Bang!”</p><br/><p>Hei Qing, who wore a gloomy expression, violently punched a person with a naked upper body whose hands had turned into dragon claws. The person spat out blood and withdrew. Before he could once again charge forward, Elder Zhu Li had appeared in front of him.</p><br/><p>“Hei Qing, go and protect Xiao Yan. Do not allow any accidents to happen to him. Leave this place to me.” Elder Zhu Li spoke in a deep voice.</p><br/><p>Although Hei Qing was a little unwilling to leave the battlefield, he also understood Xiao Yan’s importance at this moment. At that moment, he could only clench his teeth. His body pulled back with lightning-like speed. Within a couple of flashes, he entered the deepest part of the Ancient Dragon Island.</p><br/><p>“Zhu Li, allow the old me to be your opponent…”</p><br/><p>After dispatching Hei Qing to protect Xiao Yan, Elder Zhu Li’s eyes focused on the space in front of him. The grayish-white-skinned Man Yan was slowly appearing at that spot. At this moment, his body was beginning to form some purple dragon scales. His hands had also become sharp dragon claws. Man Yan had turned into a half-human half-dragon with a dragon body, dragon claws, and dragon arms.</p><br/><p>An extremely monstrous aura slowly spread from Man Yan’s body after the transformation was complete. Even the surrounding space had become extremely distorted as a result.</p><br/><p>“We have not met for many years. I wonder if the current you have broken through the Dou Zun class!”</p><br/><p>Man Yan’s eyes also revealed a dark-purple color because of the transformation of his body. He smiled at Zhu Li and his feet gently pressed down. An intense fluctuation suddenly appeared. His body was like lightning as it appeared in front of Elder Zhu Li in an instant. He waved a dragon claw and a frightening energy followed.</p><br/><p>“Bang bang bang!”</p><br/><p>The entire Ancient Dragon Island erupted with earth-shaking sounds. Numerous battlegrounds appeared in the sky above the Dragon Island. The originally calm and quiet atmosphere no longer existed at this moment.</p><br/><p>Two of the dragon islands had dispatched their elite forces. This fighting strength could wash any top tier faction in the Central Plains with blood. In the face of this sudden sneak attack, the Eastern Dragon Island was initially caught off-guard. Fortunately, it possessed quite a number of experts. After experiencing the initial chaos, the battle was finally stabilized.</p><br/><p>While the dragon island had descended into an intense fight, the deepest part of the dragon island still maintained a peacefulness. A frightening temperature still spread over the mouth of the volcano. Within the large cauldron, Zi Yan’s body, which was originally hard, slowly regained its softness. One could vaguely sense a terrifying ocean-like energy flowing within her body.</p><br/><p>“Swoosh swoosh swoosh!”</p><br/><p>Hei Qing’s expression was solemn as he stared at the interior of the large cauldron from the air. Suddenly a wave of rushing wind sounds were transmitted from the distance. This caused his expression to change a little. He turned his head, only to see ten exceptionally fierce auras rushing over with lightning like speed.</p><br/><p>“Stop them. Do not allow them to disturb Xiao Yan!” Hei Qing coldly cried out when he saw these fellows barging over.</p><br/><p>“Chi chi!”</p><br/><p>Hei Qing’s cry had just sounded when numerous human figures quickly rushed forward and stopped the human figures in the distance. A big battle erupted immediately upon contact.</p><br/><p>Although those who had come were blocked, Hei Qing’s expression remained quite ugly. He understood that the last Northern Dragon Island would definitely not sit back and do nothing since the Western and Southern islands had received word. With the strength that the Eastern Dragon Island currently possessed, stopping an attack by these two islands was already extremely difficult. If the Northern Dragon Island were to intervene, it would really be dangerous.</p><br/><p>Hei Qing clenched his fist as his eyes focused intently on the skinny young man seated in front of the huge cauldron. He muttered, “Xiao Yan, be quicker…”</p><br/>\n</div>"}