{"title": "Chapter 1326: A Lesson", "id": 1326, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1326-a-lesson", "volume_title": "Volume 14", "body": "<h1>Chapter 1326: A Lesson</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1326: A Lesson</u></strong></p><br/><p>Dark clouds rolled across the sky. The enormous battleship slowly came to a stop above this endless mountain range, attracting a countless number of gazes.</p><br/><p>Everyone on the battleship gathered at the front of the ship. They looked at the precipitous mountain range below and sensed the auras of many experts within the mountain range. Quite a number of people were speechless. This was indeed worthy of being the headquarters of the Gu clan. The number of experts had already reached a terrifying number.</p><br/><p>“Ke ke, everyone here is an important guest of the Gu clan. Please proceed!”</p><br/><p>Quite a number of people politely responded after hearing that elderly voice resound across the battleship. After which, they moved their bodies and rushed down from the battleship before flying toward the cluster of buildings in the middle of the mountain range. That place was where the Gu clan would receive them.</p><br/><p>Xiao Yan stood at the front of the ship but he did not move. His eyes were locked on a mountain in the distance. Tian Huo zun-zhe and the rest were standing behind him. Only the Little Fairy Doctor’s eyes were locked on the distance. A complicated emotion was present in her eyes.</p><br/><p>After staring for a long while, the figure on the top of the cloud finally began walking on the clouds. Her clothes fluttered as she appeared like a fairy. She carried an ethereal feeling as she stepped over the clouds and headed over in front of the many eyes. Finally, she was suspended outside of the battleship.</p><br/><p>The eyes of everyone on the battleship were thrown over when they saw the sudden appearance of this green-clothed lady. A surprise appeared within their eyes.</p><br/><p>This lady was wearing a pale-green dress. Her long black hair was randomly restrained as it spread across her narrow waist. It stretched all the way to her buttocks. Her hair would drift with the gentle wind when it blew over., appearing out of this world… moreover, her pretty face caused this world to turn. Her alluring eyes were filled with an ethereal feeling, resulting in one having difficulty looking away.</p><br/><p>After toppling a city, her beauty would topple a country. (Extremely beautiful)</p><br/><p>Such an unparalleled beauty could really bring disaster to a country and its cities. Faced with such a lady that seemed to be born from the spiritual aura of the world, a perfect man would feel ashamed in front of her. It was as though such a person could not be found in this world…</p><br/><p>A gentle smile was slowly lifted onto Xiao Yan’s face as he studied her face with its soul deep familiarity.</p><br/><p>“Xiao Yan ge-ge.”</p><br/><p>The green-clothed lady revealed a smile in front of many eyes. Her lovely figure flashed and appeared on the battleship. After which, a gentle voice sounded beside Xiao Yan’s ears.</p><br/><p>The familiar form of address was just like a heavy hammer that struck ruthlessly against the softest part within Xiao Yan’s heart. He felt the impulse to violently embrace this person in front of him.</p><br/><p>“Little girl, you are becoming more and more beautiful…” Xiao Yan forcefully endured that impulse. He softly laughed, extended his hand, and rubbed Xun Er’s head in front of the stunned gazes of the warriors from the Black Submerged Army.</p><br/><p>Gu Zhen looked at the lady, who had revealed a beautiful smile. However, he merely gave a bitter smile. He was aware that this kind of smile was something that had bloomed because of this person. It seemed that only when she was in front of this person would the indifferent female goddess Xun Er truly reveal this young lady-like emotion.</p><br/><p>“This little fellow has actually hooked onto this female goddess of the Gu clan. No wonder those fellows from the Gu clan treated him like that… however, this little fellow is really too great.” That gentle-looking young man from the Yan clan watched this scene from a corner of the battleship. His face involuntarily filled with admiration.</p><br/><p>“It will not be easy. The current Xiao clan is not the Xiao clan from back then…” The red-clothed lady with a veil over her face paused her eyes on Xun Er before softly speaking.</p><br/><p>“Ha ha, you should not underestimate Xiao Yan. Being able to walk to this stage, where even we must view him seriously, from a wasted bloodline clan, is not something that an ordinary person can achieve… it is not impossible for the Xiao clan to prosper because of him.” Huo Xuan laughed and spoke indifferently.</p><br/><p>The few people by the side involuntarily raised their eyebrows when they heard Huo Xuan high praise of Xiao Yan. However, they did not say anything. Clearly, they did not really trust his words.</p><br/><p>“Xiao Yan ge-ge, can you accompany Xun Er for a walk?”</p><br/><p>Xun Er briefly reminisced about old times with Xiao Yan before she smiled and moved. After which, she rushed toward the mountain range. Xiao Yan behind her slowly inhaled a breath. He was aware that the reason Xun Er had shown herself to him was because she wished to display her determination to some in the Gu clan. Since this girl had acted without fear, Xiao Yan would naturally not act cowardly.</p><br/><p>“Hee hee, since this is the case, allow me to see just how great this Gu clan is!”</p><br/><p>A pride surged into Xiao Yan’s heart as he glanced over the continuous mountains that seemed permeated with an ancient aura. He loudly laughed, waved his hand, and led the Little Fairy Doctor’s group from the battleship. After which, he swiftly chased Xun Er.</p><br/><p>Bang!</p><br/><p>However, Xiao Yan’s sharp Spiritual Perception caught ten extremely powerful eyes sweeping over his body the moment he left the battleship. All of these eyes contained an extremely powerful pressure. It was as though even the surrounding space had stilled at this moment.</p><br/><p>Hmph!”</p><br/><p>Xiao Yan’s expression sank as he sensed the change of the surrounding space. These people from the Gu clan really did wish to ruthlessly teach him a lesson.</p><br/><p>“Bang!”</p><br/><p>A hot flame suddenly exploded in the sky at that moment. The frightening fire wave spread in a rumbling fashion with Xiao Yan at the middle. That frightening temperature caused quite a number of people on the battleship to reveal a shocked expression.</p><br/><p>“What a powerful Heavenly Flame!”</p><br/><p>The red-clothed lady called Huo Zhi revealed a strange feeling in her eyes. She stared intently at the figure within the fire wave. At the same time, the fire seal between her brows also became hotter.</p><br/><p>The flame raged and spread. The surrounding stilled space had suddenly split apart at this moment. Xiao Yan stepped with the flame and was suspended high in the sky. His eyes locked onto certain spots within the mountain range. The owners of these gazes were extremely powerful. However, it was really a ridiculous dream if they wished to rely on the pressure contained in their eyes to suppress Xiao Yan!</p><br/><p>“Huh?”</p><br/><p>A surprised exclamation materialized from the mountain range after they watched Xiao Yan break their solidified space in such an easy manner.</p><br/><p>“How presumptuous! Elders, don’t you know what etiquette is? Attacking the moment you meet a guest of the Gu clan. Are you trying to get others to think that our Gu clan is full of barbarians?”</p><br/><p>Xun Er’s lovely body flashed and appeared beside Xiao Yan as the fire wave surged. Her bright eyes were ice-cold as she overlooked the mountain range. Her cold and indifferent voice resonated.</p><br/><p>“Young miss’ words are too serious. We have not seen a member of the Xiao clan for many years. Now that we have met one, we ended up becoming momentarily excited and wished to probe his strength.”</p><br/><p>An elderly figure slowly appeared in the sky after Xun Er’s words had just sounded. This person was wearing gray robes. His face was cold, stern, and old-fashioned. His eyes contained an unfriendliness as he glared at Xiao Yan</p><br/><p>Xiao Yan stared at the gray-robed old man who had appeared. Clearly, he was one of those who had attacked him earlier.</p><br/><p>“An eight star Dou Zun, huh…”</p><br/><p>Xiao Yan’s gaze swept over the gray-clothed old man. A fluctuation flashed across his eyes. He coldly laughed in his heart. It seemed that there were quite a number of people within the Gu clan who hated him. This trip to the Gu clan would not be smooth.</p><br/><p>“Elder Gu Qian, today is the day that our Gu clan is receiving guests. This act of yours is a little overboard. Leave, you will not do it again…”</p><br/><p>A faint voice slowly spread from deep within the mountain range before finally resounding over the sky.</p><br/><p>“Understood!”</p><br/><p>Gu Qian respectfully cupped his hands to the deepest part of the mountain range when he heard these words. After which, he bowed to Xun Er and glanced indifferently at Xiao Yan. Then, he turned around and rushed to the deepest parts of the mountain range.</p><br/><p>“Xiao Yan ge-ge, are you alright?”</p><br/><p>Xun Er watched Gu Qian leave before turning around to softly ask.</p><br/><p>“I’m fine.” Xiao Yan smiled and shook his head.</p><br/><p>“Xiao Yan ge-ge, do you now know why Xun Er didn’t want you to come to the Gu clan earlier?” Xun Er sighed. She did not expect these pedantic old fellows to not be able to control themselves. They had thought of attacking and deterring Xiao Yan the moment he had arrived at the Gu clan.</p><br/><p>Xiao Yan smiled. He was naturally aware that Xun Er did not wish for him to come to the Gu clan to be mocked. Hence, she had repeatedly asked him to raise his strength before coming to look for her.</p><br/><p>“Let’s go. I already understood what I would face before I came to the Gu Realm… these matters cannot be left for you to bare alone. You have helped me withstand them for so many years, and it should be my turn…” Xiao Yan smiled as he spoke. With his current strength, he did possess the qualification to utter these words. If that Elder Gu Qian were to attack earlier, Xiao Yan would not allow him to gain the slightest advantage!</p><br/><p>Xun Er was slightly startled when she heard Xiao Yan’s gentle voice. She sweetly smiled. She had indeed helped Xiao Yan delay the Gu clan for a long time. Fortunately, the current her had dragged it out until Xiao Yan had grown. The current Xiao Yan already possessed the ability to bear all of this with her.</p><br/><p>A figure was standing with his hands behind his back on top of a steep mountain. His eyes watched Xiao Yan and Xun Er in the sky. A trace of black and white hair gently drifted in front of his forehead. A pair of cold demon-like eyes were visible under his hair.</p><br/><p>“This Xiao Yan has finally come…”</p><br/><p>A strange laugh suddenly sounded while a silver-robed man strangely appeared from behind.</p><br/><p>“Gu Yao, looks like the relationship between Xun Er and him is quite good. Are you not intending on giving up?” The silver-robed man looked at the black-and-white-haired man in front of him and teased him.</p><br/><p>“He is not a member of the Gu clan. Hence, he cannot be together with Xun Er. I will wake him up…” The other man’s calm voice was without the slightest fluctuation. It was as though he was mentioning an insignificant matter.</p><br/><p>“What if he insists on not leaving?” The silver-robed man laughed.</p><br/><p>The man’s eyes were lifted slightly as he muttered, “Then let him die…”</p><br/>\n</div>"}