{"title": "Chapter 1322: Hun Ya", "id": 1322, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1322-hun-ya", "volume_title": "Volume 14", "body": "<h1>Chapter 1322: Hun Ya</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1322: Hun Ya</u></strong></p><br/><p>The two pair of eyes interacted with each other. There was a flame flowing within each of their eyes. It appeared as though the space between the two of them had gradually become hot…</p><br/><p>“Puff!”</p><br/><p>The four eyes faced each other. A moment later, a cluster of flames suddenly materialized out of nowhere between the two individuals. The ripple from the flame incinerated some nearby tables and chairs into ashes…</p><br/><p>Xiao Yan’s body trembled when the flame burst apart. A solemn expression flashed across his face. The Heavenly Flame within the body of this red-dressed woman was likely extraordinary.</p><br/><p>“What happened?” The Little Fairy Doctor quickly arrived by Xiao Yan’s side. Her eyes followed his gaze and paused on the group of unfamiliar people before softly asking.</p><br/><p>“Nothing…”</p><br/><p>Xiao Yan shook his head. He gave the red-dressed lady a deep look. Although he greatly coveted Heavenly Flames, he was not a fool. This woman was someone from the Yan clan Yao Lao had mentioned. Although Xiao Yan felt extremely unfamiliar with this clan, a faction that could be ranked alongside the Gu clan and the Hun clan likely possessed a powerful strength. He would not offend them because of a Heavenly Flame.</p><br/><p>“Let’s go.”</p><br/><p>There were many pairs of eyes within the wine shop. Xiao Yan did not wish to remain for long. Hence, he turned around and walked out of the building. The Little Fairy Doctor and the rest hesitated for a moment before closely following him.</p><br/><p>“Huo Zhi, how is it?” The white-robed man smiled and asked when he saw the backs of Xiao Yan’s group leaving.</p><br/><p>“A very strong Heavenly Flame…” The red-robed lady called Huo Zhi softly replied. A faint ripple rose within her quiet lake-like eyes. “If I have the chance, I would really like to exchange blows with him. I want to see whether this Red Lotus Ye Flame, which is ranked seventh on the Heavenly Flame Ranking, or his Heavenly Flame is stronger…”</p><br/><p>“You are only interested in these things.” The white-robed man helplessly shook his head and said. “This Xiao Yan should be a member of the Xiao clan. It is unexpected that the clan, whose bloodline has become waste, is actually able to produce such a person. It is really unbelievable.”</p><br/><p>“The Xiao clan had the closest relationship with the Gu clan back then, but that was when they were strong. The friendship between the clans will forever be built on the foundation of having similar strength. If there wasn’t opposition from some of the Elders within the Gu clan, the tomb of Xiao Xuan would have been forcefully opened by them…” That gentle-looking man grinned and said. “The tomb of a peak expert is something that even the Gu clan cannot resist.”</p><br/><p>“Those are merely some radicals. There is no need to place everyone in the same category.” The white-robed man shook his head. He stretched his lazy waist and laughed, “I am still most interested in the Heavenly Tomb that is opened once every twenty years. Although the Heavenly Tomb is within the Gu Realm, the members of the eight clans are qualified to enter it according to the agreement from back then. The tomb of Xiao Xuan is also inside. I wonder if there will be any one who will truly be able to barge in there…”</p><br/><p>“Aye, I wonder if the members of the other clans have arrived. Normally, they will not miss such a big event.” That rough-eyebrowed man nodded and spoke.</p><br/><p>“Who cares about them. If they do not come, we will have fewer competitors. Let’s leave.” The white-clothed man curled his lips. After which, he stood up and walked out of the building. The few people behind him followed at a steady pace.</p><br/><p>“It looks like the situation is even more troublesome than what I have heard. Most of these eight great commanders hold a grudge with you. Today, if the Elder from the Gu clan had not appeared, it is likely that Lin Xiu would have attacked you…” The Little Fairy Doctor frowned and spoke on their way back to their house.</p><br/><p>“ ，，。”，，，，，，，。</p><br/><p>“It is only natural for there to be trouble. If everything proceeded smoothly within this Gu clan, I would feel troubled.” Xiao Yan laughed. He was unconcerned about those eight great commanders. That Lin Xiu might be a six star Dou Zun, but he still did not pose a threat from Xiao Yan’s point of view. The only person among these eight great commanders whom Xiao Yan felt a little worried about was the first commander, who had yet to show himself.</p><br/><p>“The ones I am worried about aren’t these eight great commanders. Instead, I am worried about the four great generals. They are the most talented people among the younger generation of the Gu clan. According to their potential, they are also the ones with the greatest possibility to become the Black Submerged King. You should be aware that the lowest requirement for each Black Submerged King is to reach the Ban Sheng class…” The Little Fairy Doctor spewed more information with a solemn voice.</p><br/><p>“Ban Sheng, huh…”</p><br/><p>Xiao Yan momentarily stopped walking. His dark-black eyes were filled with a graveness. The so-called four great generals were the true troublesome individuals. Facing these monster-like people really caused Xiao Yan to feel some pressure.</p><br/><p>“If it’s a blessing, it’s not trouble. If it’s trouble, there is no escaping it… it is pointless to say all this now. If trouble wishes to find us, there will be nothing we can do. Regardless of whether it is for the reputation of the Falling Star Pavilion or my Xiao clan, there are some things that are unavoidable.” Xiao Yan shook his head. The four great generals might indeed be troublesome, but they weren’t enough to cause Xiao Yan to step back because of the difficulty. There was nothing that he had not seen during these years. There were really not many people among the same generation that could get him to withdraw without fighting.</p><br/><p>Even the true geniuses from the Gu clan would not be able to force him to back down.</p><br/><p>“Huh?”</p><br/><p>The fist under Xiao Yan’s sleeve suddenly tightened when this thought flashed across his heart. It was at this moment that he suddenly paused. It was as though he had sensed someone arriving. He abruptly lifted his head, and his gaze landed on the end of a small path in the forest. Three figures in black robes were randomly standing there. A dangerous feeling quietly spread from them.</p><br/><p>The Little Fairy Doctor and the rest also sensed something when Xiao Yan discovered the three. The Dou Qi within their bodies began to circulate.</p><br/><p>“You are that Xiao Yan from the Xiao clan right?”</p><br/><p>The leader of the three black-robed individuals shook his black robe slightly and a somewhat shady laugh was slowly emitted. The laughter did not sound old. Clearly, its owner was not some old demon.</p><br/><p>“Who are you?” Xiao Yan knit his brows and asked.</p><br/><p>“Ha ha, I thought that you would have deep memories of us…” The black-robed leader laughed when he heard Xiao Yan’s question.</p><br/><p>Xiao Yan’s expression sank when he heard this response. His eyes carefully swept over the three of them. A familiar feeling surged into his heart, causing his expression to become dense. “People from the Hall of Souls?”</p><br/><p>“Compared to this name, I would prefer to hear you call us the Hun clan…” The black-robed man laughed. However, his laughter contained a sinister intent that could not be hidden.</p><br/><p>Xiao Yan’s expression was ice-cold. He started at these three people in a dense manner. Dou Qi swiftly circulated within his body. It was unexpected that he would meet people from the Hall of Souls here!</p><br/><p>“There is no need to act like this. The task of capturing you should not be done by me. Therefore, I also do not have any intention of intervening. I have only come here because I wished to see how far the Xiao clan, which had firmly suppressed my Hun clan, has fallen…” The black-robed man grinned.</p><br/><p>“You can get lost after seeing what you want!”</p><br/><p>The Little Fairy Doctor coldly laughed. She clenched her hand, and a vast and mighty Dou Qi agglomerated into a Dou Qi whip in her hand. Her hand was ruthlessly swung. The long whip penetrated through air and explosively shot toward the black-robed person.</p><br/><p>“Presumptuous!”</p><br/><p>The other two figures coldly cried out when they saw the Little Fairy Doctor attack. They shook their sleeves and a clear crashing sound appeared. Two dark-black chains rushed out like poisonous snakes. They ruthlessly collided with the long Dou Qi whip.</p><br/><p>“Bang!”</p><br/><p>A frightening wind was created when they collided. The surrounding trees were immediately turned into dust…</p><br/><p>“The reason I have come is not to attack you. All I wish to do is give you advice. Opposing my Hun clan will not lead to a good end…” The black-robed leader merely smiled when the blows of both parties were exchanged. He raised his head a little. A pale skinny young face was revealed under the black Doupeng. At this moment, the face that was revealed contained a dense smirk.</p><br/><p>“Relax, sooner or later, you will swallow these words of yours.” Xiao Yan calmly replied.</p><br/><p>“Ke ke, I really hope for that day. However, I think that your final fate will not be much different from Xiao Xuan…” The black-robed man softly laughed. His body slowly became illusory with this laugh. A moment later, it completely disappeared in a strange manner.</p><br/><p>“Remember my name, Hun Ya. My ancestor was one of those who had seriously injured Xiao Xuan back then, resulting in his death. Therefore, this time around, the person who will finish you off will likely be me… this is fate. You will not be able to escape it. Ha ha.”</p><br/><p>A faint laugh was slowly emitted from the empty space after the three black-robed figures disappeared. Finally, it resounded over the entire place. It was a long time later before it slowly disappeared.</p><br/><p>Xiao Yan was without expression. His gaze only withdrew from the spot where those three had disappeared after the laugh had scattered. After which, he walked toward the house without a single word, but no one saw the clenched fist under his sleeve. A fierce glint flashed within his dark-black eyes.</p><br/><p>“Hun Ya huh… since this is the case, the debt that your ancestor owed will be paid by you. The Gu Realm possesses the tomb of ancestor Xiao Xuan. Hence, let this place become the place where you will be buried!”</p><br/><p>The Little Fairy Doctor’s group studied Xiao Yan’s back. Although Xiao Yan was remaining quiet, they could sense a dense killing intent seeping from his body. Clearly, Hun Ya had really sparked the murderous desire in Xiao Yan’s heart.</p><br/><p>“This fellow will regret it…”</p><br/>\n</div>"}