{"title": "Chapter 1323: Opening of the Gu Realm", "id": 1323, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1323-opening-of-the-gu-realm", "volume_title": "Volume 14", "body": "<h1>Chapter 1323: Opening of the Gu Realm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1323: Opening of the Gu Realm</u></strong></p><br/><p>Three days swiftly passed as everyone waited. Xiao Yan’s group did not head out during these three days. Lin Xiu and the others did not appear in front of them again, likely due to being reprimanded by Elder Gu Xun. However, Xiao Yan’s group understood that such a method would not solve the problem.</p><br/><p>Of course, Xiao Yan was not really concerned about such trouble. Ever since that person from the Hall of Souls called Hun Ya had appeared, his focus had basically been transferred to this person.</p><br/><p>From the words that Hun Ya had said, Xiao Yan was aware that this person likely possessed some status within the Hun clan. After all, he possessed an ancestor who was strong. It was likely that Hun Ya also possesses a strong background within that Hun clan. Otherwise, he would not have two seven star Dou Zun experts as guards beside him. An expert of this strength would hold the position of a Tianzun within the Hall of Souls. An ordinary person would not be able to command them.</p><br/><p>The words Hun Ya had said also hinted at the mystery behind the death of his ancestor Xiao Xuan. It seemed that he was surrounded and attacked by many experts. This ancestor of Hun Ya was one of them.</p><br/><p>These matters occurred far too long ago. It was impossible to investigate them. Since this fellow had given him such murderous intent, there was nothing wrong with placing this matter on this fellow. Xiao Yan could not see through the strength of Hun Ya. It was likely that he possessed some special method to hide his strength. Based on Xiao Yan’s guess, he was definitely quite strong. That faint sense of danger was not something an ordinary person could give him…</p><br/><p>Although Xiao Yan was a little afraid of this person, it did not hinder the murderous intent within his heart. As long as this person remained in the Dou Zun class, the current Xiao Yan possessed the qualification to make him feel regret!</p><br/><p>The Gu Sacred City became unusually lively when the morning sun on the third day rained down. Today was the day that the door to the Gu Realm would open. Most of the people present were curious about this mysterious place. Not many people in this world possessed supernatural people to create a realm.</p><br/><p>While wave after wave of noise was being emitted from the city, Xiao Yan’s group was ready to leave. They exited the manor, followed the human flow, and swiftly headed to the middle of the city.</p><br/><p>There was an extremely enormous lake in the middle of the Gu Sacred City. The lake was unusually clear. One was unable to see the other edge with a glance. That kind of depth caused people to feel creeped out.</p><br/><p>At this moment, the surroundings of the lake were occupied by many human figures. Even the top of the surrounding buildings had many figures on them. Many gazes gathered on the clear lake. Numerous people wearing armor were standing tall on the lake. A powerful aura spread, causing no one to be bold enough to step onto the lake.</p><br/><p>“Everyone, the Gu Realm will open soon. The area within the Gu Realm is extremely vast. It is unavoidable to lose your way if you randomly roam around. Should you end up barging into some spatial cracks, it is likely that you will end up dying in empty space. Therefore, I hope that everyone will not randomly roam around after entering.” Elder Gu Xun, whom Xiao Yan’s group had met yesterday, was standing in the middle of the lake. He was crying out in a loud and clear voice.</p><br/><p>“There will be someone to receive you after entering the Gu Realm. After which, they will send everyone to the central area of the Gu Realm, the Gu Sacred Mountain Range… there are also the Gu clan descendant citizens within the Gu Realm. I hope that everyone will not disturb them. Otherwise, you might be blacklisted by our Gu clan… is everyone clear?”</p><br/><p>Some courteous replies were emitted from outside of the lake after Gu Xun’s words were heard.</p><br/><p>“Gu clan descendant citizen?”</p><br/><p>Xiao Yan was slightly startled when he heard this term.</p><br/><p>“The Gu clan descendant citizen is the lowest level within the Gu clan, but it is also the most important level. After multiplying for a countless number of years, there are quite a number of Gu clan descendant citizens within the Gu Realm. All of them possess the Dou Di bloodline within their bodies. However, this bloodline is insignificant. Of course, some accidents or variations occur that result in the strength of their bloodline becoming stronger. Once these special descendant citizens are discovered, their statuses soar as they become a true member of the Gu clan. They will enjoy an incomparable honor.” Tian Huo zun-zhe smiled as he explained.</p><br/><p>“A countless amount of new blood… no wonder the Gu clan hasn’t declined over time.” Xiao Yan nodded. With such a large amount of descendant citizens, no wonder the Gu clan has an endless number of young geniuses. They are ultimate geniuses that were selected from a hundred thousand or even a million people.</p><br/><p>Tian Huo zun-zhe smiled and nodded.</p><br/><p>While the two were conversing, waves of ripples had suddenly appeared on the clam lake. Everyone sensed an extremely frightening spatial fluctuation spreading from the space above the lake.</p><br/><p>“Chi!”</p><br/><p>An extremely bright light pillar suddenly shot out when this kind of frightening spatial ripple had reached its peak. It connected with the energy of the city.</p><br/><p>“Rumble!”</p><br/><p>A thunder-like sound was suddenly emitted from the space above the ripple when the two connected. Space split apart in front of numerous shocked eyes. A moment later, a large door that led into the unknown deeps of space appeared in front of the many eyes present.</p><br/><p>“The spatial door that leads to the Gu Realm has been opened. Everyone, please enter!”</p><br/><p>Gu Xun smiled as he looked at the enormous spatial door. After which, he spoke in a loud and clear voice.</p><br/><p>Gu Xun’s words had just sounded when some figures around flashed. They rushed over and appeared in front of the spatial door. After curiously observing it, some skilled and bold individuals took the lead. They felt very assured when it came to the Gu clan and were not worried that the Gu clan would do anything to them.</p><br/><p>With someone taking the lead, a commotion occurred in the crowd behind. Everyone began to rush toward the spatial door one after another. Even when faced with such a large scale, the spatial door appeared like a bottomless pit. No matter how many people squeezed in, it did not ripple even a little.</p><br/><p>“Let’s get moving…”</p><br/><p>Xiao Yan smiled when he saw that there was no unusual signs on the spatial door. He took the lead to walk toward the lake. His foot stepped on the water, and he headed to the spatial door. The Little Fairy Doctor and the others followed close behind.</p><br/><p>The edges of the spatial door were heavily guarded by the warriors of the Black Submerged Army. Xiao Yan saw Ling Quan and the second commander, Lin Xiu, who had revealed himself back then, at the leader’s spot. He did not see the third commander Yang Hao. It was likely that he was still recuperating. After all, Xiao Yan’s attacks had been quite heavy.</p><br/><p>Lin Xiu narrowed both of his eyes when he saw Xiao Yan’s group walking over. He glanced at Elder Gu Xun, who was busy. After which, his foot gently took a step to the left and coincidentally blocked the path in front of Xiao Yan’s group.</p><br/><p>Xiao Yan acted as though he did not see this roadblock. His feet continued to walk along the route that he had taken earlier. Finally, the bodies of the two gently collided together.</p><br/><p>“Bang!”</p><br/><p>A slight sound was quietly emitted the moment the collision occurred. The lake water under their feet suddenly formed many intense circular waves. However, the force which both people used was perfectly controlled. Hence, this ferocious collision did not stir much of a commotion.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan was without expression. His shoulder rapidly shook in a strange manner. Wave after wave of force came one after another with lightning-like speed and continuously collided with Lin Xiu’s shoulder.</p><br/><p>“Groan!”</p><br/><p>Lin Xiu’s expression paled as they collided again. The force that was being transmitted from Xiao Yan’s body was so hot that it was frightening. Moreover, that heat also hid a chill. The interlacing of the two immediately caused his shoulder to become numb. A muffled moan was emitted from his throat as his feet staggered back three steps on the surface of the lake. That final step even caused his foot to fall into the lake.</p><br/><p>Clearly, this second commander of the Black Submerged Army was unable to gain an advantage in this collision.</p><br/><p>Xiao Yan’s expression was clam. He glanced at Lin Xiu’s ugly expression but did not say anything. He once again stepped forward and headed toward the spatial gate.</p><br/><p>“Xiao Yan, you should not be arrogant. There will naturally be someone to deal with you within the Gu Realm! I will wait for you to climb out like a dead dog!”</p><br/><p>Xiao Yan’s act of ignoring him caused the veins on Lin Xiu’s head to bulge. He finally clenched his teeth the moment that Xiao Yan was about to enter the spatial door. A low and sinister voice was transmitted into Xiao Yan’s ears.</p><br/><p>“You worry too much, second commander… you should take care of yourself first.”</p><br/><p>Xiao Yan’s body paused, and he indifferently smirked. After which, he did not remain any longer. He stepped into the spatial door. The space rippled, and he quickly disappeared.</p><br/><p>“Groan!”</p><br/><p>Lin Xiu once again moaned when Xiao Yan disappeared. Immediately, a trace of blood seeped from the corner of his mouth in front of the stunned eyes of some people from the Black Submerged Army.</p><br/><p>“Bastard!”</p><br/><p>Lin Xiu’s expression was gloomy. Dou Qi surged to his right shoulder. After which, he suddenly spread his palm. A purple-brown flame mixed with a dense white color was shot out of his palm. It was shot into the lake, which emitted an extremely dense white fog and a sizzling sound.</p><br/><p>This flame was naturally something that Xiao Yan had inserted into Lin Xiu’s body when they had exchanged blows earlier. However, Lin Xiu had been unwilling to show weakness in front of Xiao Yan earlier. It was due to this that he forcefully endured it. Nevertheless, he did not expect that forcefully enduring these frightening flames to cause such a degree of destruction within his body.</p><br/><p>“Xiao Yan, I have underestimated you! However, it is not your turn as a bastard of a wasted clan to act arrogantly in my Gu Realm!</p><br/><p>“There will naturally be someone to deal with you in the Gu Realm. I will wait here for when you climb out like a dead dog!</p><br/><p>“Young miss isn’t someone that a person as lowly as you can desire!”</p><br/>\n</div>"}