{"title": "Chapter 1325: Gu Zhen", "id": 1325, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1325-gu-zhen", "volume_title": "Volume 14", "body": "<h1>Chapter 1325: Gu Zhen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1325: Gu Zhen</u></strong></p><br/><p>Huo Xuan bade Xiao Yan farewell and left after chatting with for awhile. Xiao Yan’s face revealed an expression of contemplation as he studied Huo Xuan’s back from the side. It was obvious that this Huo Xuan was here to express goodwill. Perhaps part of the reason was because of his current strength, but this was not completely the case. After all, the former was a member of the Yan clan. Moreover, the current Yan clan was not as dilapidated as the Xiao clan.</p><br/><p>“This person is not simple. Even I am unable to see through his strength. He is indeed worthy of being from one of the eight ancient clan, appearing mysterious and unfathomable…”</p><br/><p>Tian Huo zun-zhe and the others, who had withdrawn to the side, finally came over and exclaimed after seeing Huo Xuan leave.</p><br/><p>Xiao Yan nodded. If he had guessed correctly, the strength of Huo Xuan should be that of a seventh star Dou Zun or stronger. Otherwise, he would not have been able to hide his strength from Tian Huo zun-zhe, whose strength had reached that of a six star Dou Zun. However, if one were to really talk about being mysterious, Xiao Yan still felt that the red-clothed lady was even more unfathomable. These ancient clans were indeed extraordinary. Fortunately, from the actions of Huo Xuan, the Yan clan was at least relatively friendlier.</p><br/><p>“It will require half a day to travel from here to the Gu Sacred Mountain Range of the Gu Realm. We can only rest on the battleship during this time. Let’s go…”</p><br/><p>Xiao Yan softly laughed. After which, he led everyone to the other side of the battleship. This battleship was extremely large. However, its defenses were exceptionally tight. They came across fully armed warriors of the Black Submerged Army every few steps they took. This caused Xiao Yan to feel slightly surprised. It was likely that such a lineup would not be needed if they were merely here to receive this group…</p><br/><p>“It seems that the Gu clan are worried about the people who have entered the Gu clan, but it is only expected. The energy of this Gu Realm is so dense. If one stayed here to train, one would train much quicker than in the outside world. Some people with ulterior motives might secretly find a place to hide and train…” Xiao Yan pondered the thought. The conduct of the Gu clan was really watertight.</p><br/><p>Following Xiao Yan’s group’s gradual advancement, they slowly arrived at a spot near the head of the battleship. There were much fewer people here compared to other places. However, the defenses around this area were not weak at all.</p><br/><p>Xiao Yan seemed to lack interest once he walked to the head of the battleship. He was about to turn around and leave when his eyes suddenly paused on the front of the ship. There was a long-haired man with brilliant clothes seated there. A small wooden table had been set up in front of him. Two clear teacups had been placed on it.</p><br/><p>Xiao Yan narrowed his eyes as he stared at this back. After which, he turned around and left without saying anything. He could sense the vast and mighty aura that was vaguely spreading from this person’s body. Moreover, he did not like this kind of pretence.</p><br/><p>“Friend from the Xiao clan. Since you are here, please take a seat…”</p><br/><p>However, Xiao Yan had just turned around when a faint laugh was transmitted into his ear, causing him to stop.</p><br/><p>Xiao Yan’s expression was calm. His eyes exchanged glances with the Little Fairy Doctor’s group but did not leave. Turning around, he walked toward that man and sat down opposite him. He raised his eyes and faintly inquired, “Someone from the Gu clan?”</p><br/><p>The appearance of this long-haired man was not handsome. It could even be called ordinary. However, it gave one a mysterious convincing feeling.</p><br/><p>“Ha ha, I am Gu Zhen.” The long-haired man laughed.</p><br/><p>Xiao Yan quietly nodded. His eyes swept across those surrounding warriors of the Black Submerged Army and discovered that the eyes of these people contained a respect when they looked at this person. This respect, which originated from their hearts, was something that did not appear even when they were facing the second commander Lin Xiu.</p><br/><p>“Black Submerged Army’s First Commander?” Xiao Yan was quiet for a moment before he softly asked.</p><br/><p>The hand the long-haired man used to lift his teacup shook upon hearing these words. A circular ripple spread within the teacup as he laughed, “You are indeed worthy of being a member of the Xiao clan.”</p><br/><p>“Are you waiting here in order to help Ling Quan’s group get back their faces?” Lin Dong asked without expression.</p><br/><p>“Ha ha, those few little fellows have irritable characters and poor restraint. By letting them experience what it means by there is always someone greater, they will learn to withdraw some of their haughtiness. Moreover, they would not dare to come and look for me for something like helping them get back their face.” Gu Zhen laughed.</p><br/><p>Xiao Yan stared at Gu Zhen in front of him. This person was quite gentle. This kind of light and gentle control was something that Xiao Yan had seen for the first time among the younger generation.</p><br/><p>“Do you know why there are so many Black Submerged Army warriors guarding this battleship?” Gu Zhen was unconcerned about Xiao Yan’s focus as he suddenly asked a question.</p><br/><p>“You are worried about people remaining in the Gu Realm, right?” Xiao Yan randomly replied.</p><br/><p>“This is only part of the reason. There are a large number of descendant citizens inside the Gu Realm. They are the foundation of the Gu clan and are also the most important level within the Gu clan… their bodies possess the Dou Di bloodline. Although this amount is so thin that it is negligible, occasionally some variations form. These people will become the new blood of the Gu clan… of course, the reason that they possess such a chance to evolve is because of the Dou Di bloodline existing within their bodies…” Gu Zhen softly said. “However, this kind of bloodline is extremely faint. It could easily be suppressed. The method to overlay this bloodline is very easy. As long as one weds an outsider…</p><br/><p>“The Gu clan values the Dou Di bloodline. Therefore, we are worried that someone from outside the clan will cause this bloodline strength to disappear… as a result, we have taken precautions against anyone remaining in the Gu Realm for even a short period of time…”</p><br/><p>Gu Zhen’s words paused when he said this. He looked at Xiao Yan and said, “This is the case for an ordinary descendant citizen and it is also the case for the core members of the Gu clan. Within the rules of my Gu clan, there is a clear rule that one is not allowed to wed outside of the clan! You are likely aware of what I wish to convey, right?”</p><br/><p>Xiao Yan’s expression remained clam. He softly said, “I know but it is still useless against me.”</p><br/><p>“These few sentences of mine naturally do not hold the hope of getting you to abandon your intentions. However, you should also be aware of just how greatly the Gu clan values the Dou Di bloodline. In order to ensure that the bloodline continues on, it is very difficult for there to be anything between you and the young miss.” Gu Zhen slowly placed his teacup down and said, “One should know when to withdraw in a difficult situation no matter what one can do. Otherwise, it is likely that it will be good for no one. This is not a threat, but a reminder… if you really like young miss, you should not drag her down. The current Xiao clan has completely declined.”</p><br/><p>Xiao Yan gently rotated the Storage Ring on his finger. A moment later, he suddenly laughed, “Is the Dou Di bloodline really that powerful?”</p><br/><p>Gu Zhen was stunned when he heard Xiao Yan’s words. He immediately smiled and replied, “Is there even a need to give a reply? These ancient clans are still strong even now. This is the best proof.”</p><br/><p>Xiao Yan smiled but was non-committal. He continued asking, “What level must one reach in order to cause the Gu clan to ignore the bloodline?”</p><br/><p>“Dou Sheng.” Gu Zhen lifted his brow and slowly answered.</p><br/><p>“In that case, I will reach that level…” Xiao Yan grinned and responded.</p><br/><p>“This is not a simple matter like opening one’s mouth. Remember, I am talking about a Dou Sheng. A genuine Dou Sheng and not a… Ban (Half) Sheng!” Gu Zhen frowned and said. “My Gu clan has never lacked experts at the peak of the Dou Zun class. However, they are unable to reach that level even after spending their entire life trying. I am aware that your talent is quite good. However, there are people within my Gu clan who are even more talented than you. Even these people are not confident that they can advance to a Dou Sheng. Just how can you be confident that you can achieve it?”</p><br/><p>“This is because you are members of the Gu clan while I am not… this is because you people rely on the great strength of the Dou Di bloodline while I do not…” Xiao Yan smiled as he explained his confidence.</p><br/><p>“As for whether I can reach the Dou Sheng class. Time will prove everything…”</p><br/><p>The smile on Gu Zhen’s face was slowly withdrawn. His eyes stared at the confident face in front of him. A moment later, he finally sighed, “I am naturally quite satisfied if you really are confident. However, once you experience the difficulty of advancing to the Dou Sheng class, I hope that you will leave young miss because it will be bad for both of you if this continues.”</p><br/><p>“Thank you for the reminder. I was able to reach this point today from being a trash of the Xiao clan by relying on not giving up. I am not the least bit afraid of facing the Hun clan. It is the same for the Gu clan!”</p><br/><p>Gu Zhen’s face revealed a complicated expression when he heard that laugh beside him Not giving up. These were three simple words, but there were not many who could achieve their meaning…</p><br/><p>“Bang!”</p><br/><p>The battleship suddenly shook while Gu Zhen was sighing softly in his heart and the surrounding spatial fluctuation slowly disappeared. The speed of the boat was also reduced. A lush green mountain range in the distance appeared within one’s sight.</p><br/><p>“Have we arrived at the Gu Sacred Mountain Range…”</p><br/><p>Xiao Yan’s heart suddenly pounded as the battleship flew closer to the mountain range, which was covered by clouds and fog. His body paused for a moment before he suddenly turned his head. His eyes shot to a mountain in the distance that was covered by clouds. A misty green figure was vaguely present there. Even though they were far apart, Xiao Yan could still sense a familiarity and longing from deep within his bones.</p><br/><p>Two pairs of eyes interlaced with each other from across a vast distance. It appeared as though they had solidified.</p><br/><p>Gu Zhen slowly stood up. He looked at the female deity-like figure on the mountain top. A complicated smile appeared on his face. During these many years, the only person who could get her to personally come to this place to receive someone was likely this man in front of him…</p><br/><p>“Xiao Yan, there is a great difference in opinions toward you within the Gu clan. Everything will be fine if you can reach the Dou Sheng class. If you cannot, it is likely that you will meet with many difficulties. Therefore, I hope that you are able to achieve what you have said… young miss’s eyesight should be quite good.”</p><br/><p>Xiao Yan quietly nodded. From his conversation with Gu Zhen, he could sense the pressure Xun Er was facing within the Gu clan.</p><br/><p>“No one can stop me from being together with Xun Er, not even the Gu clan!”</p><br/>\n</div>"}