{"title": "Chapter 1334: Great Silent Destruction Finger", "id": 1334, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1334-great-silent-destruction-finger", "volume_title": "Volume 14", "body": "<h1>Chapter 1334: Great Silent Destruction Finger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1334: Great Silent Destruction Finger</u></strong></p><br/><p>Four types of Heavenly Flames were suspended in the sky. Their frightening temperatures caused the air to become dry. Fortunately, everyone here was quite strong. Hence, perspiration did not fill their faces. Even though this was the case, the eyes of quite a number of people revealed a shock. A Heavenly Flame was an extremely rare object. It was unexpected that Xiao Yan possessed four of them at this moment. This number was quite terrifying.</p><br/><p>“Falling Heart Flame?”</p><br/><p>Mang Tian Chi looked at the cluster of invisible flames that was rotating around Xiao Yan. He was startled before crying out in a stunned voice.</p><br/><p>This Falling Heart Flame was something that Mang Tian Chi had placed a seal on back then. Hence, he was naturally very familiar with it. He did not expect this Heavenly Flame, which had been sealed at the bottom of the Blazing Sky Qi Refining Tower in the Inner Academy, to land in Xiao Yan’s hands.</p><br/><p>...</p><br/><p>“Four types of Heavenly Flames… how is this possible? How can four types of Heavenly Flames exist in a person’s body? Isn’t he afraid that these Heavenly Flames will come in conflict and end up exploding?”</p><br/><p>The member of the Yan clan with the gentle face was staring at the four types of Heavenly Flames in the sky in a stunned manner as he muttered to himself.</p><br/><p>“Green Lotus Core Flame, Falling Heart Flame, Bone Chilling Flame, Three Thousand Burning Flame…” Huo Xuan’s eyes also stilled on the sky. A moment later, he inhaled a deep breath of air. His eyes still displayed his shock. As a member of the Yan clan, they were extremely sensitive to flames, especially Heavenly Flames. Their Yan clan had gained four types of Heavenly Flames after many years, yet Xiao Yan controlled this number of Heavenly Flames alone.Their hearts were naturally a little shaken.</p><br/><p>“His Qi Method possesses the miraculous effect of merging Heavenly Flames. The flame that he had displayed in the past had been formed from the merger of four Heavenly Flames… this kind of miraculous effect is something that even our clan Qi Method “Fire Emperor Mysterious Scripture” does not possess…” The red-dressed lady with a veil over her face bunched up her brows as she softly spoke.</p><br/><p>“This person is indeed not as simple as he appears on the surface…”</p><br/><p>“A strange Qi Method, a number of Heavenly Flames… this Xiao Yan really surprises others…”</p><br/><p>On the other side of the square, the man with a medicinal cauldron drawing on his forehead was using fiery hot eyes to stare at Xiao Yan in the sky. His eyes contained a greediness in them. A Heavenly Flame contained an incomparable allure to an Alchemist. Even with his status in the Yao clan, he needed to put in great effort to obtain a Heavenly Flame as an inheritance. It was unexpected that the disciple of someone abandoned by the Yao clan possessed four types of Heavenly Flames!</p><br/><p>Even if all the Heavenly Flames within the Yao clan were added up, they would not even be able to match such a number of Heavenly Flames.</p><br/><p>“He is able to keep four types of Heavenly Flames within his body without suffering a backlash. He must possesses something to suppress them. If I have guessed correctly, it is the Qi Method he practices… if I have the opportunity, I will capture this fellow and force him to hand over his Qi Method and his Heavenly Flames… if I am able to obtain this Qi Method and his four Heavenly Flames, hee hee, it will be my turn to take the clan head of the Yao clan in the future…” The man’s eyes flashed. His eyes became boiling hot as they looked at Xiao Yan.</p><br/><p>Due to the appearance of four types of Heavenly Flames, the gazes of everyone here gathered on Xiao Yan. Various thoughts flashed across the minds of everyone present. There were those who were envious, those who were jealous, and naturally those who were greedy…</p><br/><p>“It is unexpected that you possess four types of Heavenly Flames. However, if this is your support, it is perhaps time to end things here!”</p><br/><p>Gu Yao’s eyes swept over the four types of Heavenly Flames. A faint surprise flashed through his eyes as he let out a cold laugh. Both of his hands moved and numerous after images appeared. Following the forming these hand seals, a wild wind that was whistling through the sky suddenly came to a halt at this moment. Even the dark clouds lingering in the sky ceased moving. A monstrous destructive aura slowly spread from Gu Yao’s body…</p><br/><p>Most of the people around the stadium revealed different looks when they sensed the aura of complete destruction that was spreading from Gu Yao’s body. Under the cover of this kind of destructive aura, a dispirited feeling began to vaguely appear in their hearts…</p><br/><p>“Has he actually been forced to this extent… it is already quite good for Xiao Yan to reach this stage.”</p><br/><p>The three Gu clan Elders conducting the ceremony in the sky revealed grave expressions. The three of them looked at each other and nodded. They cried out in unison and the Dou Qi within their bodies surged out without holding back. They poured their Dou Qi into the Dou Qi light barrier that covered the entire square, causing it to become thicker…</p><br/><p>“This is… Great Silent Destruction Skill!”</p><br/><p>Xun Er gently inhaled a breath of air. A grave expression flashed across her eyes. It was unexpected Gu Yao was forced to use such a Dou Skill in order to obtain victory. Xun Er could not be more familiar with this so-called Great Silent Destruction Skill because she had once practiced this Dou Skill. That frightening strength of annihilating all life was still deeply ingrained in her memory even now.</p><br/><p>“Xiao Yan can be considered to have won by having forced Gu Yao to use a Tian class Dou Skill. Even if he pulls back at this moment, there is no reason for the people in the Gu clan to say anything more…” The smile on Mang Tian Chi’s face was withdrawn as he spoke in a deep voice.</p><br/><p>“It is useless, Xiao Yan will not withdraw…” The Little Fairy Doctor replied. Her eyes were focused on the figure in the sky as she said, “He will definitely not take even half a step back even if he has to fight until both of them end up with serious injuries…”</p><br/><p>“Rather break than bend… this little fellow is really ruthless. Relax, I will intervene if it really comes to a critical moment…” Mang Tian Chi nodded. A pleased expression appeared in his eyes. Whether it was in terms of strength or character, Xiao Yan wes extremely likable from his point of view. What Su Qian had said was indeed true.</p><br/><p>“Tian class Dou Skill, huh…”</p><br/><p>Xiao Yan studied Gu Yao. Gu Yao had shut his eyes and allowed even his own life to quietly diminish. His face became more and more grave. The Gu clan was an ultimate faction within the Central Plains. After a countless number of years of inheritance, Tian class Dou Skills, which were extremely difficult to find in the outside world, definitely existed in their clan. Moreover, their strengths were likely quite great. If Xiao Yan was even a little careless, he might end up dying. Hence, he needed to put in all his effort.</p><br/><p>Xiao Yan inhaled a deep breath of air. He beckoned with his hand and a bright red bead appeared in it. This cluster of hot flames erupted when the light from the sky scattered down. This flame was naturally the “Sun Flame” that Xiao yan had obtained from the Ye clan back then. It would need to make up for the last type of flame at this moment.</p><br/><p>“Five Ring Flame Expelling Technique!”</p><br/><p>Following the appearance of the last type of flame, a furious cry was suddenly emitted from Xiao Yan’s heart. The seal formed by his hands changed, and the five types of flames suspended in front of him hurriedly began to move.</p><br/><p>“Wolf Spirit, form!”</p><br/><p>Within a short moment, a sharp cry was emitted from Xiao Yan’s throat. The wolf-like fire spirit formed by the Sun Flame swiftly appeared in the sky.</p><br/><p>“Leopard Spirit, form!”</p><br/><p>“Lion Spirit, form!”</p><br/><p>“Tiger Spirit, form!”</p><br/><p>Xiao Yan formed four types of fire spirit in one go. He also felt the Dou Qi within his body rapidly being depleted. His hand seal changed once again cried out loud, “Dragon spirit, form!”</p><br/><p>After Xiao Yan’s cry sounded, the final Three Thousand Burning Flame began to rapidly wiggle. An instant later, a mountain-sized dragon fire spirit appeared in the sky.</p><br/><p>“Five Ring Flame Expelling Formation!”</p><br/><p>The five spirits complemented each other. A frightening temperature spread across the sky. The dark-black clouds in the distant sky were vaporized until they were a little thin and illusory. The trees that were close to the stadium withered at a pace visible to the naked eye. Finally, they emitted a ‘bang’ and burst into a cluster of ashes…</p><br/><p>The five enormous fire spirits formed a strange formation in the sky while Xiao Yan stood in the middle of it.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan inhaled a deep breath of air after sensing his rapidly diminishing Dou Qi. His eyes immediately looked at Gu Yao in the distant sky. At this moment, Gu Yao’s eyes were still tightly shut while allowing the destruction aura to spread from his body and become denser.</p><br/><p>“Five Ring Flame Expelling Coil!”</p><br/><p>Xiao Yan was not a pedantic who needed to wait until his opponent had gathered his strength before attacking. His hand seal changed and a stern cry was emitted from his mouth.</p><br/><p>After his cry sounded, the five enormous fire spirits around him began to roar to the sky. They began to rotate at a rapid speed. Under this frightening rotation, the space where Xiao Yan was standing crumbled. Numerous enormous dark black lines appeared in the sky like ferocious large mouths.</p><br/><p>“Bang bang!”</p><br/><p>With the increasing speed of the rotating fire spirits, the area around Xiao Yan eventually turned into a two-thousand-foot-large five-colored fire coil. The fire coil was suspended above Xiao Yan’s head as it rapidly rotated. Waves of explosive sounds were emitted from it. The frightening energy that spread from it caused even the Elders from the Gu clan, like Gu Qian and Gu Xu, to display a different expression.</p><br/><p>Tian Huo zun-zhe watched the enormous five-colored fire coil that covered half the sky. The fiery heat within his eyes became increasingly hot. Was this the true strength of the Five Ring Flame Expelling Technique? Such a level could indeed be comparable to the so called Tian class Dou Skill!</p><br/><p>“Gu Yao, try and receive this technique of mine!”</p><br/><p>Xiao Yan in the sky, raised his right hand up high in front of a countless number of eyes, reaching toward the enormous five-colored fire coil that was above him. A loud cry suddenly sounded. He abruptly swung his hand and the incomparably large five-colored fire coil was accompanied by a rumbling-thunder-like sound as it flew through the sky like a meteorite. It shot toward Gu Yao in front of a countless number of shocked eyes.</p><br/><p>“A firefly dares to compete with the bright moon’s light!”</p><br/><p>The five-colored fire coil crossed the sky and arrived. At the same time, Gu Yao’s tightly shut eyes were suddenly opened. A cold laugh sounded. He slowly extended a finger and gently pressed down on the empty air!</p><br/><p>“Great Silent Destruction Finger!”</p><br/>\n</div>"}