{"title": "Chapter 1346: Pursue and Escape", "id": 1346, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1346-pursue-and-escape", "volume_title": "Volume 14", "body": "<h1>Chapter 1346: Pursue and Escape</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1346: Pursue and Escape</u></strong></p><br/><p>An unusually powerful energy pressure radiates from the enormous energy curtain when one approached it…</p><br/><p>“What a powerful energy pressure. If one does not possess sufficient strength, one would turn into dust when passing through this layer of light…” Xiao Yan paused outside of the energy curtain. His hand gently penetrated it and sensed the pressure. Finally, he cried out with some surprise.</p><br/><p>“Aye, normally speaking, anyone whose strength is below a five star Dou Zun would not be able to enter.” Xun Er smiled as she replied. “Even the weakest energy body in the second level will possess the strength of a five star Dou Zun. Those who cannot reach this strength will be delivering themselves to death even if they can enter.”</p><br/><p>“Just the entrance to the second level requires the strength of a five star Dou Zun. Would the entry to the third level not require a seventh or eighth star strength?” Xiao Yan frowned and asked.</p><br/><p>“This is more or less the case.” Xun Er covered her mouth and softly laughed. “This energy pressure might be strong, but given Xiao Yan ge-ge’s strength, you should not find it to be much of a problem…”</p><br/><p>“Let’s head to the entrance of the third level before talking more.” Xiao Yan shook his head. He studied the light curtain in front of him before extending his hand to Xun Er. He smiled and said, “Let’s go in…”</p><br/><p>“Aye.” Xun Er gently nodded. After which, she placed her hand in Xiao Yan’s hand and allowed him to drag her along. They slowly walked into the enormous light curtain.</p><br/><p>After the two of them gradually entered the light curtain, golden-yellow and purple-brown flames began to slowly surge from their bodies. They completely suppressed the powerful pressure that came from the light curtain.</p><br/><p>This energy curtain was around a thousand feet long. The duo walked for nearly ten minutes before they sensed the energy pressure slowly weaken.</p><br/><p>“We are about to exit…”</p><br/><p>Xiao Yan narrowed his eyes and observed the end of the energy light a short distance away. He also sighed in relief. His footsteps suddenly quickened as he pulled Xun Er and shuttled through this extremely thick light curtain.</p><br/><p>“Hu…”</p><br/><p>After exiting the light curtain, the energy pressure covering his body completely disappeared. Xiao Yan was just about to sigh in relief when Xun Er’s somewhat anxious voice swiftly appeared beside his ear, “Be careful!”</p><br/><p>A chill surged in Xiao Yan’s heart after the voice entered his ear. A silver glow flashed under his feet as his body shook. An after-image appeared in the original spot.</p><br/><p>“Bang!”</p><br/><p>A couple of unusually sharp energy forces arrived with lightning-like speed after the after-image appeared. A wild and violent energy tore the after-image into pieces within an instant.</p><br/><p>Xiao Yan’s figure once again appeared around ten meters behind the after-image. He frowned as he glanced around, only to see around ten energy bodies suspended in the air. Their empty yet cold eye sockets locked onto him.</p><br/><p>“Energy body… moreover it is an energy body that possesses the strength of a five star Dou Zun..”</p><br/><p>Xiao Yan’s frown tightened when he saw these powerful energy bodies. Ten five star Dou Zun energy bodies had gathered together. This kind of lineup had never appeared on the first level. It was unexpected that they had ended up being attacked by such a lineup the moment they entered the second level.</p><br/><p>“There is still a bloody scent here. Someone has purposefully lured them here…” Xun Er’s body flashed and appeared beside Xiao Yan. She looked at the surrounding energy bodies before she knit her brows and spoke.</p><br/><p>“It should be Hun Ya’s handywork…” Xiao Yan narrowed his eyes. The only people who could do this was Hun Ya’s group, whom they had seriously injured earlier.</p><br/><p>“Can you sense the auras of those two?” Xiao Yan’s eyes were locked o the ten energy bodies around him as he asked.</p><br/><p>“No. These two fellows are as sly as foxes. They probably fled after luring these energy bodies over…” Xun Er shook her head and replied. “Let’s first deal with these fellows first. Otherwise, the bloody scent here will lure even more energy bodies.”</p><br/><p>“Aye, let’s finish the fight quickly. Any delay may result in an unexpected change…”</p><br/><p>Xiao Yan’s expression was grave as he nodded. The second level was indeed filled with danger. The ten energy bodies with the strengths of five star Dou Zuns would cause even an ordinary six star Dou Zun to flee after meeting them. Fortunately, it was not very difficult to finish them off when he and Xun Er joined hands.</p><br/><p>“Understood…”</p><br/><p>Xun Er gently nodded. After which, she twisted her delicate body and disappeared in a strange manner. Xiao Yan stomped his foot on the ground when her body disappeared. He rushed in the other direction with lightning-like speed.</p><br/><p>The battle continued for a short period of time. The two figures returned to each other in less than ten minutes. They looked at the messy ground around them, looked at each other, and smiled. Each of them opened their hands. Ten pigeon-sized energy cores appeared. An unusually dense energy lingered around the energy cores. The energy appeared like a fog that possessed a spirituality.</p><br/><p>“The eastern side is where the bloody scent disappears. Hun Ya and Hun Li probably headed that way. Based on what I know, the eastern side is also the location of the third level. What should we do?” Xun Er’s pretty eyes shifted to the east. A chill flowed through her eyes.</p><br/><p>“Let’s follow them. These two must not be allowed to remain…” Xiao Yan smiled. However, his smile was exceptionally cold. These two fellows had launched a sneak attack and had even set a trap here. Xiao Yan could not possibly act as though he had not witnessed these actions.</p><br/><p>“Since you wish to play, I shall play with you until the end!”</p><br/><p>“The second level is far smaller than the first level. If everything proceeds smoothly, we will reach the entrance to the third level in less than half a month’s time.” Xun Er softly said.</p><br/><p>“Let’s go. We will split these energy cores equally and absorb them along the way.”</p><br/><p>Xiao Yan nodded. His body moved, and he transformed into a blurry figure that rushed forward. Xun Er nodded and quickly followed behind him.</p><br/><p>Two figures, flying at the speed of light, suddenly paused far in front of Xiao Yan’s group, where their sight could not reach. These two figures turned their heads and looked at the area far behind them.</p><br/><p>“They have entered the second level. Those energy bodies have also been finished off by them…” Hun Li, who was left with a single arm, spoke in a deep voice. His face was still pale, but his aura had stabilized. There was a great number of energy bodies here. They were good at healing his injuries.</p><br/><p>“Let’s head to the third level first and ignore them. You should recuperate from your injuries during this period of time. Otherwise, we will be no match for them. If we have calculated things correctly, those fellows will arrive at the second level soon. If Xiao Yan and Xun Er gather with Gu Qing Yang and the rest, we will be no match for them…” Hun Ya frowned and spoke in a dark and cold voice.</p><br/><p>“Moreover, reaching the third level early will help our plan. At that time, we’ll wait for all those fellows to gather and then finish all of them off at once. Hee hee, everyone knows that the Heavenly Tomb is dangerous. No one will say anything if those people die here…” A ruthless expression surfaced on Hun Ya’s face as he softly spoke.</p><br/><p>“Aye.”</p><br/><p>Hun Li nodded. The corner of his mouth was lifted into a dense expression. They had ended up suffering a loss when they had attempted to take advantage of the situation. One of his own hands was lost. Given his character, he would definitely seek revenge for this debt.</p><br/><p>“Let’s go. I want to see whether they can follow us…”</p><br/><p>Hun Ya coldly laughed. He waved his sleeve and a black fog surged out. It entered the surrounding energy fog while his body swiftly rushed forward. Hun Li followed close behind.</p><br/><p>“Bang bang!”</p><br/><p>The expressionless Xiao Yan waved his hand at the surrounding space and a hot wind swept out, shattering the souls hidden within the energy fog.</p><br/><p>“What irritating things…”</p><br/><p>Xun Er knit her brows as she watched these spiritual bodies pounce over. The outer appearance of these spiritual bodies was not much different from an energy body. However, they were controlled by Hun Ya. Normally, these souls hid in the fog, but now as soon as Xiao Yan’s group approached, they would pounce over and self-destruct. Although the force was not strong, it was extremely irritating, and Xiao Yan’s group had already faced a self-destruct attack over a hundred times during this one week.</p><br/><p>“The injuries of Hun Li are more or less healed…” Xiao Yan finished off the final spiritual body before twisting his neck. He spoke in a faint voice. Despite Hun Ya’s group’s miserable state from being chased, it was still possible to see scattered energy imprints revealing that Hun Li’s injuries were rapidly healing.</p><br/><p>“What have our gains been during this period of time?”</p><br/><p>“Thirty-eight grade five energy cores, twenty-five grade six energy cores, six grade seven energy cores, one grade eight energy core…” Xun Er thought quietly for a moment before replying. Although they had been chasing Hun Ya during this period of them, they did not forget about their aim to train themselves. Any energy bodies that they met along the way turned into an energy core that appeared in their hands. Some days earlier, they had luckily met an energy body that had reached the strength of an eight star Dou Zun. Xiao Yan and Xun Er had wasted a lot of time in order to finish it off. An energy body of such strength already possessed its own intelligence. The difficulty level was naturally far from what an ordinary energy body could compare with.</p><br/><p>“Unfortunately, we have not met any nine star Dou Zun energy bodies. With your current strength, only an energy core of such a grade is useful to you.” Xiao Yan regretfully lamented. Most of these energy cores had been absorbed by him. Xun Er had only used an extremely small portion. Although he was aware that the these energy cores didn’t do much for Xun Er, he also understood that she was purposefully finding excuses to give them to him.</p><br/><p>Xun Er smiled and softly commented, “Five more days until we can reach the third level. The tomb of the ancestor of the Xiao clan, Xiao Xuan, should be there…”</p><br/><p>Xiao Yan slowly nodded when he heard her words. Anticipation surged within his heart. He felt a premonition that Xiao Xuan’s tomb contained some things that his ancestor had left behind for his descendants…</p><br/>\n</div>"}