{"title": "Chapter 1358: Appear", "id": 1358, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1358-appear", "volume_title": "Volume 14", "body": "<h1>Chapter 1358: Appear</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1358: Appear</u></strong></p><br/><p>As Xiao Yan’s group’s expressions changed, Hun Ya’s eyes became even darker and colder. He strangely laughed, “Do you feel that everything has changed? This relationship between the hunter and the hunted seems to have begun to change.”</p><br/><p>Xiao Yan’s group ignored his strange mockery. Their eyes were staring at the two gray-clothed old men in front of Hun Ya. Although the bodies of these two people were no different from an ordinary person, their eyes were filled with an emotionless indifference. Xiao Yan’s group could still sense that these two old fellows were energy bodies…</p><br/><p>“Just where did these two bastards find Dou Sheng energy bodies? Why would such an expert help them?” Gu Hua frowned and softly cursed.</p><br/><p>Gu Zhen stared at the two elders. A moment later, he shook his head as he said, “Because these two people are members of the Hun clan. Although they have already died, their spirits remained because of the Heavenly Tomb. It looks like these two fellows have come prepared…”</p><br/><p>Gu Qing Yang slowly nodded. He voiced his thoughts, “Let’s separate and flee. Two Dou Shengs. Even though they are just energy bodies, we are no match for them. We will not have even the slightest chance of victory if we fight against them head-on.”</p><br/><p>Everyone was quiet when they heard his words. It was unexpected that they would end up binding themselves this miserable because of these two homeless strays. They had to go through various difficulties to arrive here.</p><br/><p>“Xiao clan… has actually not been annihilated, huh…”</p><br/><p>A gray-clothed old man’s indifferent eyes paused on Xiao Yan. He spoke while everyone was quiet.</p><br/><p>“Elder Hun Diao, the Xiao clan no longer exists. However, this fellow has relied on himself to reach this height. Therefore, you must eliminate him this time around. Otherwise, the Xiao clan might really end up recovering.” Hun Ya respectfully explained the situation to him.</p><br/><p>“He did not rely on the strength of the bloodline, huh…” Surprise flashed through Elder Hun Diao’s eyes when he heard this. He immediately nodded and said, “Since this is the case, he should indeed be eliminated.”</p><br/><p>“Alright, let’s not talk any more. Kill them and quickly leave. This place is too close to that area. Things might change if we delay.” The other gray-clothed elder frowned and spoke in a deep voice.</p><br/><p>Hun Diao’s eyes rippled when he heard the other elder’s words, causing him to nod. His foot slowly stepped forward. When his foot stepped forward, space itself fluctuated in an intense manner. Circular spatial ripples spread from under his feet.</p><br/><p>“Flee!”</p><br/><p>Gu Qing Yang cried out softly when he saw Hun Diao move. His body took the lead as he transformed into a ray of light that shot to his left. Xiao Yan and the rest also rushed off on their own at the same time. Their directions were all different.</p><br/><p>“Lock!”</p><br/><p>The gray-clothed elder, who had yet to act, coldly smiled when he saw Xiao Yan’s group fleeing. He suddenly clenched his hand, and all the noise within a thousand feet suddenly stilled. Time seemed to have come to a standstill along with it…</p><br/><p>The figures of Xiao Yan’s group turned into statues within this stilled space. Their rotating eyes revealed a horror. Was this the strength of a genuine elite Dou Sheng? They could control any space at will. Within this space, time or the space itself could be modified by them.</p><br/><p>Hun Ya involuntarily laughed when he saw Xiao Yan’s group forced to stop. If they could get all of these fellows to remain here, a great gap would appear within the younger generation of the Gu clan. It would be quite a big blow to an ancient clan like the Gu clan if they lost this kind of precious blood.</p><br/><p>“Bang!”</p><br/><p>While a pleased emotion appeared within Hun Ya’s heart, an extremely hot golden flame suddenly erupted within the still space. The flame appeared like a phoenix rising from the ashes. The energy that erupted at that instant struck this stilled space until it began to ripple.</p><br/><p>“Bang!”</p><br/><p>A purple-brown flame suddenly erupted in the fluctuating space because of the eruption of the golden flame. As the frightening temperature rose, the offensive ripple that had been strengthened caused the entire space to become unstable.</p><br/><p>The Dou Qi within the bodies of Gu Qing Yang and the rest circulated when the space became unstable. They combined their strength and escaped their restraints. However, they did not separate and flee again. Instead, they gathered together with solemn expressions. After the fight earlier, they understood that fleeing did not pose any obstruction to these two elite Dou Shengs. It would only cause the resistance on their side to diminish.</p><br/><p>“Huh?”</p><br/><p>Surprise flashed across the eyes of the two gray-clothed old men when they saw Xiao Yan’s group rely on their own strength to escape the stilled space.</p><br/><p>“You do indeed possess some ability. However, this is insufficient!”</p><br/><p>Hun Diao coldly laughed. He widened his mouth and rolling black clouds surged from it. They agglomerated into black python tens of thousand of feet large with a roar. It swung its huge tail, and Xiao Yan’s group could hear crackling sounds emitted from space itself. Empty space was shattered by the attack of this enormous python.</p><br/><p>Such a frightening attack caused the expressions of Xiao Yan’s group to become much uglier. An elite Dou Sheng was terrifying, and this was just an energy body. If they were facing a genuine Dou Sheng, just how unimaginably terrifying would that battle be?</p><br/><p>“Together!”</p><br/><p>A rich feeling of danger surged into Gu Qing Yang’s heart when he looked at the enormous black python as it broke through the space and whistled over. With his strength, it was extremely difficult to block the attack of an elite Dou Sheng. The difference between Sheng and Zun was so large that it could blow some people’s minds…</p><br/><p>Everyone nodded when they heard Gu Qing Yang’s low cry. This kind of death-like danger was something that even Saint Xue Dao from earlier did not give them. If they did not join hands to deal with it, all of them would really end up dying here today.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan exhaled a deep breath. The Skyfire Three Mysterious Change was unleashed by him. Energy gathered in a lightning-like manner on his right hand. When faced with an expert of such strength, none of them were given any time to warm up. All they could do was go all out in order to gain the slightest chance of survival.</p><br/><p>While Xiao Yan was unleashing all his strength, the Dou Qi within the bodies of Gu Qing Yang, Xun Er, and the rest also began to surge. Powerful Dou Qi pressures lingered beside them like a whirlwind, shattering all the surrounding large stones.</p><br/><p>“Great Heaven Creation Palm!”</p><br/><p>A dark-black light spot appeared in Xiao Yan’s palm in a lightning-like fashion. It suddenly slammed to life in the empty space in front of him.</p><br/><p>“Chi!”</p><br/><p>The palm landed on empty space. Then a dark-black light sphere quickly appeared and swiftly spread out.</p><br/><p>“Silent Destruction Finger!”</p><br/><p>While Xiao Yan had unleashed his Tian class Dou Skill, Xun Er, Gu Qing Yang, and the rest also unleashed the same Dou Skill. It was the Tian class Dou Skill that Gu Yao had once unleashed back then, the Silent Destruction Finger!</p><br/><p>An enormous dark-black finger broke through the space behind them. After which, the black light sphere and the finger ruthlessly collided with the large black python that had torn through air as it shot over..</p><br/><p>“Bang!”</p><br/><p>The frightening collision resulted in an earth-shaking explosion. A frightening energy storm swept out from the point of collision!</p><br/><p>The energy storm swept over the sky. An enormous black figure suddenly shot out from within. It ruthlessly slammed toward Xiao Yan’s group. Upon closer inspection, it was the snake tail of that enormous python. Although this snake tail was covered with injuries, it had not been destroyed by Xiao Yan’s group.</p><br/><p>The snake tail carried an extremely frightening wind pressure as it ruthlessly swung toward Xiao Yan’s group. The sonic boom that was created blasted the ground apart, forming a countless number of large pits…</p><br/><p>A paleness surged onto the faces of Xiao Yan’s group as they sensed the frightening strength of the snake tail. Despite so many of them attacking at the same time using Tian class Dou Skills, they were still unable to block it.</p><br/><p>“Let’s go all out!”</p><br/><p>Gu Hua clenched his teeth. The ground trembled intensely under the sonic boom. At this moment, it was too late even if they wished to flee…</p><br/><p>Xiao Yan’s expression was gloomy. The Heavenly Flame in his hand was circulated. He was also aware that he had no other choice but to go all out…</p><br/><p>“Chi!”</p><br/><p>While Xiao Yan’s group was preparing to retaliate, the space in the distance fluctuated. A figure suddenly flashed and appeared. With a wave of his sleeve, a gentle force lifted Xiao Yan’s group, pulling them to the deepest part of the Heavenly Tomb with lightning-like speed.</p><br/><p>“Saint Xue Dao?”</p><br/><p>The reinforcement that suddenly arrived caused Xiao Yan’s group to be startled. Surprise surged on Xiao Yan’s face when he saw the person who had intervened. No one had expected Saint Xue Dao to rescue them.</p><br/><p>“Dammit. Just where did these bastards come from? If that fellow discovers that you were killed here, he will definitely wash everything in blood again!” That Saint Xue Dao ignored Xiao Yan’s group. His body shot away while he was cursing with a gloomy expression.</p><br/><p>“Hmph, a mere Ban Sheng dares to act atrociously in front of the two of us? Are you seeking death?” The sudden unexpected change surprised the attacking duo. They quickly recovered and furiously laughed. They suddenly turned their bodies and cried out, “Lock!”</p><br/><p>Saint Xue Dao’s body suddenly stilled after the angry cries of those two sounded. Surprise also surged onto everyone’s faces at this moment. Two elite Dou Shengs were indeed at a level that was far from what he could compare with.</p><br/><p>“You dare to meddle with this little ability…”</p><br/><p>Hun Diao’s two-man team coldly laughed. Their feet stepped on the empty space as they appeared in front of Saint Xue Dao. Their hands were curled as they ruthlessly slammed toward his chest. If just one fist were to land, Saint Xue Dao would be smashed until nothing remained.</p><br/><p>“Chi!”</p><br/><p>However, Hun Diao’s group’s fists were still half a foot from Saint Xue Dao when they suddenly stopped!</p><br/><p>“Who is it?”</p><br/><p>The Dou Sheng duo’s expressions changed as they furiously cried out after their fists were halted.</p><br/><p>“It looks like there are still remaining members of the Hun clan in this Heavenly Tomb…”</p><br/><p>A faint voice that was filled with an ancient aura slowly reverberated through everything when the furious cry of the Hun Diao duo sounded. The space where the Hun Diao duo had stilled started to collapse when this voice sounded.</p><br/><p>“Xiao Xuan?”</p><br/><p>A frightened expression surged onto the faces of Hun Diao and the other elder when they heard this voice.</p><br/>\n</div>"}