{"title": "Chapter 1357: Two Dou Sheng", "id": 1357, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1357-two-dou-sheng", "volume_title": "Volume 14", "body": "<h1>Chapter 1357: Two Dou Sheng</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1357: Two Dou Sheng</u></strong></p><br/><p>“You are a member of the Xiao clan?”</p><br/><p>The scimitar that contained a dense bloody scent suddenly came to a stop half a foot above Xiao Yan’s head. Saint Xue Dao’s eyes were frightened as he stared at Xiao Yan’s forehead. His voice actually contained some fear.</p><br/><p>The Great Heaven Creation Palm, which was swiftly gathering in Xiao Yan’s palm, also paused because of the strange actions of Saint Xue Dao. Xiao Yan frowned, and his toes pressed on the ground as his body swiftly withdrew. He demanded, “How do you know?”</p><br/><p>Saint Xue Dao’s eyes stared intently at Xiao Yan’s brows. The partially visible clan tattoo that had surfaced at that spot earlier had completely vanished. However, his heart clearly understood that this clan tattoo was definitely familiar to him because this clan tattoo appeared as frightening as the devil in his distant memory.</p><br/><p>“Didn’t all the members of the Xiao clan die…”</p><br/><p>Saint Xue Dao muttered. His eyes involuntarily swept to the deepest part of the Heavenly Tomb when he uttered these words. A deep fear flashed across his eyes.</p><br/><p>“What happened?” Gu Qing Yang, Xun Er, and the rest also rushed to Xiao Yan’s side at this moment. They looked at Saint Xue Dao, who had suddenly stopped attacking, as they asked with soft voices full of doubt.</p><br/><p>“I’m not certain…” Xiao Yan shook his head, but he did not abandon the caution in his heart. The strength of an elite Ban Sheng was too powerful. Even with many of them joining hands, it would still be extremely difficult to deal with him. If they were careless, it was even possible for their entire group to die here.</p><br/><p>Gu Qing Yang also frowned when he heard this. This Saint Xue Dao might only be an energy body, but it still possessed an intelligence and memories from when it was alive. Just what had caused him to feel such fear?</p><br/><p>“This little fellow is actually a member of that Xiao clan… given the incredible abilities of that person, he has definitely sensed him entering. If I kill him, I will have difficulty escaping that person’s murderous desire in the future.” Saint Xue Dao’s eyes rapidly flickered. A moment later, the bloody aura that spread over his body was slowly withdrawn. His hand was swung and the scimitar disappeared. He glanced at Xiao Yan and ordered him somewhat unwillingly, “Go! Consider yourself lucky this time around!”</p><br/><p>Xiao Yan’s group was stunned to hear his words. They exchanged glances with each other. They did not understand why this fellow had suddenly changed his mind.</p><br/><p>“Walk west from here. This narrow path is where many experts gather. You should be able to avoid most of them if you walk to the west and you will then reach your destination.” Saint Xue Dao spoke somewhat impatiently when he saw everyone’s flabbergasted expressions.</p><br/><p>“Thank you very much elder…”</p><br/><p>Xiao Yan exchanged glances with Gu Qing Yang and the rest. After which, he hurriedly cupped his hands respectfully to Saint Xue Dao. Subsequently, they slowly stepped back. The Dou Qi in their bodies remained in a state where it could erupt at any time. Only after having withdrawn by over a hundred meters and seeing that Saint Xue Dao did not do anything, they sighed in relief within their hearts. They quickly turned around and rushed deeper.</p><br/><p>Saint Xue Dao watched Xiao Yan’s group as they left quickly. Only then did he curl his mouth. His eyes looked wandered to the deepest part of the Heavenly Tomb as he muttered to himself, “Hmph, you owe me a favor this time around. You should at least let me off when you come and clear up the place in the future, right?”</p><br/><p>“That fellow… he is really strange. Earlier, he was filled with a desire to kill, but then he suddenly turned into a nice person in the blink of an eye…”</p><br/><p>The energy fog spread over the land. A couple of figures shuttled by. Gu Hua glanced behind him before speaking with a frown.</p><br/><p>“He seems to have been able to identify that I am a member of the Xiao clan…” Xiao Yan’s eyes were cautiously sweeping around him as he randomly replied.</p><br/><p>“Each time your aura soars, the clan tattoo of the Xiao clan appears on your forehead. He is a former top expert. How can he not recognize it…” Gu Qing Yang smiled and replied.</p><br/><p>“What?” Xiao Yan’s body paused when he heard this. He turned his head with a surprised face and asked, “What clan tattoo do I have?”</p><br/><p>“Don’t you know?” Gu Qing Yang’s group were also surprised when they saw that Xiao Yan appeared even more at a loss compared to them. Gu Qing Yang said, “This clan tattoo seems to only be able to appear temporarily. It disappears pretty quickly… reasonably speaking, you should not even possess a clan tattoo. A clan tattoo relies on the strength of the bloodline to be activated. However, the strength of the Xiao clan’s bloodline has been completely exhausted…”</p><br/><p>Xiao Yan frowned. How could he understand it himself? His forehead had a flame imprint on it, and this flame mark had gradually paled after he successfully swallowed the Bone Chilling Flame. As for that whatever clan tattoo, he had definitely never seen it before.</p><br/><p>“When my aura is soaring, I am using the Skyfire Three Mysterious Change. However, what has that got to do with the clan tattoo of my Xiao clan?” Numerous mysteries flashed through Xiao Yan’s mind, but he did not find the slightest answer. This caused his frown to tighten.</p><br/><p>“That Saint Xue Dao from earlier is not afraid of the Xiao clan tattoo. This thing does not possess even the slightest strength…” A thought flew through Xiao Yan’s heart. “The reason that he had let us off is likely due to something else. Moreover, this thing should be related to the clan tattoo of the Xiao clan…”</p><br/><p>However, just what was related to the Xiao clan tattoo in the Heavenly Tomb that could deter Saint Xue Dao, who possessed the strength of a Ban Sheng?</p><br/><p>“It’s Xiao Xuan!”</p><br/><p>Xun Er by the side suddenly came to an answer. Xiao Yan was still fine when these words were uttered. However, a chilled aura seeped from under the feet of Gu Qing Yang’s group. Xiao Xuan had already died for so many years. How could he still terrify this Saint Xue Dao?</p><br/><p>“The Heavenly Tomb is extremely mysterious. Since an elite Ban Sheng like Saint Xue Dao can survive through any means and possess his spirit from when he was alive, could elder Xiao Xuan, who reached the peak of the Dou Sheng class, also rely on this method to survive?” Xun Er slowly explained her reasoning.</p><br/><p>Gu Qing Yang’s group was speechless. Their eyes immediately turned to Xiao Yan. Although Xiao Yan’s expression remained calm, they could still sense that his heart was fluctuating intensely at this moment.</p><br/><p>“Let’s go. All of these mysteries will be solved when we reach our destination…”</p><br/><p>Xiao Yan softly replied. The speed of their bodies suddenly increased. He transformed into a blurry black line that charged into the faint energy fog. Xun Er and the others exchanged gazes behind him before quickly following.</p><br/><p>During the subsequent journey, Xiao Yan’s group followed the path that Saint Xue Dao had pointed out to them. The energy bodies they were sensing had become much stronger. There were some who were even stronger than Saint Xue Dao. However, it was fortunate that Xiao Yan’s group had avoided the scanning of these experts by following the gaps between the energy bodies territories. Thus, they were not hindered along the way…</p><br/><p>“We should have truly entered the deepest region of the Heavenly Tomb…”</p><br/><p>Xiao Yan’s group relied on the chaotic rocky terrain to hide themselves. They rested for a moment before Gu Qing Yang looked at the deepest darkest part and voiced his thoughts.</p><br/><p>“It is indeed worthy of being the most dangerous place. The surrounding energy bodies appear to be too frightening. Even the nine star energy bodies can only be a guard....” Gu Hua bitterly laughed. Being in a place where numerous experts were located, they finally discovered just how weak they were. They were existences that many young clan members of the Gu clan looked up to in the Gu Realm. Here, however… they seemed to be ant-like existences. They needed to be careful even when they spoke.</p><br/><p>The others could only helplessly smile when they heard his words. This place was not a place that they should have come to. Being able to reach this far had already exceeded their expectations.</p><br/><p>“Based on our speed, we should reach the tomb of Xiao Xuan that is recorded in the ancient books very soon…” Xun Er looked at Xiao Yan and softly informed him.</p><br/><p>“This path is still quite smooth. It looks like that Saint Xue Dao has given us a lot of help. However, this place is indeed too dangerous. We should get moving soon…” Xiao Yan nodded and immediately urged.</p><br/><p>“Aye.”</p><br/><p>The others agreed with these words. They hurriedly stood up.</p><br/><p>When they had just got up and prepared to once again hurry on their journey. However, a slight rushing wind sound had suddenly appeared in front of them. Immediately, two black figures slowly landed on a large rock. They overlooked everyone from above. Their eyes contained a mockery like a cat playing with a mouse.</p><br/><p>“Xiao Yan, your speed is really a little too slow…”</p><br/><p>The expressions of Xiao Yan’s group suddenly changed when they heard this dangerous laughter. They suddenly raised their heads and looked at the two figures in the distance. Their faces sank a little. “Hun Ya, Hun Li!”</p><br/><p>“Hee hee, I wondered who it was. It is actually you two homeless dogs, who had fled before. Why do you have the courage to appear now?” Gu Hua unceremoniously ridiculed the two figures when he saw them.</p><br/><p>The gloomy-faced Xiao Yan quietly gave a hand signal when Gu Hua uttered these words. The Hun Ya duo had been hiding from them. Given their strength, where would they get the guts to openly appear in front of Xiao Yan’s group. Anything out of the ordinary definitely meant that something was wrong. Since these two had dared to appear, it was likely that they had something to rely on.</p><br/><p>“Relax, the ones who will be homeless strays this time around will definitely be you…”</p><br/><p>Hun Ya strangely smiled in the face of Gu Hua’s ridicule, and then Hun Li and him slowly withdrew. When they withdrew, two gray-clothed sinister-looking old fellows quietly appeared in front of them in a ghost-like manner…</p><br/><p>“Dou Sheng?”</p><br/><p>An indescribable feeling of danger immediately rose within their hearts when they saw these two gray-clothed old men appear!</p><br/>\n</div>"}