{"title": "Chapter 1362: Blood Fusion", "id": 1362, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1362-blood-fusion", "volume_title": "Volume 14", "body": "<h1>Chapter 1362: Blood Fusion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1362: Blood Fusion</u></strong></p><br/><p>“Dragon Phoenix bloodline strength?”</p><br/><p>Xun Er was also startled when she heard Xiao Xuan’s stunned voice. She asked somewhat uncertainly, “What is this thing?”</p><br/><p>Dragon Phoenixes had rarely appeared on the Dou Qi continent’s history. Hence, even though Xun Er was a member of the Gu clan, she was still extremely unfamiliar with this term.</p><br/><p>Xiao Xuan also revealed a surprised expression in his eyes as he studied Xiao Yan in the blood pool. It was difficult for him to imagine that there was still such a thing hidden within Xiao Yan’s body. It should be known that a legendary existence like the Dragon Phoenix was something that even he had never personally seen.</p><br/><p>“A Dragon Pheonix is a mysterious creature that possesses the bloodline of the Ancient Void Dragon and the Ancient Heavenly Phoenix. This is the true supreme creature of the Magical Beast world. However, they have only appeared a few times. Even I have never personally seen such an existence.” Xiao Xuan slowly explained.</p><br/><p>“A mysterious creature that possesses both the bloodline of the Ancient Void Dragon and the Ancient Heavenly Phoenix?” Xun Er knit her brows. She was aware that Zi Yan’s actual body was an Ancient Void Dragon, but she had never heard of when Xiao Yan had communicated with an Ancient Heavenly Phoenix, an ancient Magical Beast that had disappeared a long time ago.</p><br/><p>“I am also not aware of just where this Dragon Phoenix bloodline strength came from…” Xiao Xuan spoke somewhat helplessly. “From the looks of the situation, it seems that the removal of blood earlier did not remove this Dragon Phoenix bloodline strength. As more of the Xiao clan bloodline strength surged into Xiao Yan’s body, the Dragon Pheonix bloodline could not endure the pressure involuntarily erupted…”</p><br/><p>“Will this have an impact on Xiao Yan ge-ge?” Xun Er frowned and asked.</p><br/><p>“If we cannot remove the resistance of the Dragon Phoenix bloodline strength, the Xiao clan’s bloodline strength will not merge in Xiao Yan’s body. If it forcefully barges in, it will cause Xiao Yan to be seriously injured.” Xiao Xuan frowned. He felt a headache forming. This Dragon Phoenix bloodline was also extremely powerful. It was comparable to a genuine Dou Di bloodline. Although the strength of this kind of bloodline was not very powerful within Xiao Yan’s body, it could not be underestimated.</p><br/><p>“What should we do?” Xun Er asked in a somewhat worried voice.</p><br/><p>Xiao Xuan mused for a moment. His eyes shifted to Xun Er as he asked, “Little girl, are you willing to help me or rather Xiao Yan?”</p><br/><p>“Elder Xiao Xuan, please state whatever help you need…” Xun Er rolled her eyes. She did not hesitate as she answered him.</p><br/><p>“I need some Gu clan bloodline strength!” Xiao Xuan stared intently at Xun Er. A wild heat surfaced in his eyes as he explained, “I know that the bloodline strength of two clans is difficult to merge. This is something that I had personally experienced back then, but it is precisely because of failure that I am aware of why it didn’t work. The two types of powerful bloodline strengths have difficulty reconciling with each other. However, things are different. The strength of this Dragon Phoenix bloodline is not inferior to a Dou Di bloodline. By using it as a mediating item, it might be able to merge the Gu and Xiao bloodline strength. Moreover, it will even be able to resolve some of the problems that the Dragon Phoenix bloodline created…”</p><br/><p>“Merging bloodline strength…”</p><br/><p>Even with Xun Er’s calmness, her face involuntarily changed when she heard Xiao Xuan’s words. Something like the bloodline strength was viewed as the highest secret in each clan. They would definitely not allow outsiders to obtain it, and with the two of them being Dou Di bloodlines, they were basically in a state of opposition. It was impossible to merge them. If one were to try to forcefully merge them, the results would be quite serious.</p><br/><p>“I am aware that this thought is quite crazy. Back then, I have already dabbled with such a thought because I think that the bloodline of a Dou Di might be able to allow the descendants of the Dou Di to possess an extraordinary talent, but this bloodline inheritance has definitely caused some things to be lost or go missing… it is precisely because of this lack of something that the experts within these ancient clans who can reach the Dou Di class end up diminishing. The process also becomes more difficult…” Xiao Xuan appeared to be aware of the thoughts within Xun Er’s heart. He shook his head and explained his plan.</p><br/><p>“I have experimented with it back then, but ended up failing… since that time, I have never mention such a thing. However, now… is perhaps an opportunity.”</p><br/><p>Xun Er looked at Xiao Xuan’s elderly face before once again looking at Xiao Yan in the blood pool. Xiao Yan’s eyes remained shut. She hesitated for a moment before finally sighing softly and saying, “Elder Xiao Xuan, are you really confident?”</p><br/><p>“Eighty percent!” Xiao Xuan mused a moment before replying.</p><br/><p>Xun Er once again hesitated for a moment after hearing this. She clenched his silver teeth gently before she nodded. She said, “Since this is the case, I’ll do as Elder Xiao Xuan says!”</p><br/><p>“I shall represent Xiao Yan and the entire Xiao clan to thank you first!” Xiao Xuan cupped his hands to Xun Er with a solemn expression as he thanked her in a deep voice.</p><br/><p>Xun Er could only smile when she witnessed Xiao Xuan’s great politeness. If it wasn’t for Xiao Yan, she would definitely not agree to Xiao Xuan’s crazy request. She understood in her heart that Xiao Yan possessed a great number of enemies from powerful factions. If he wished to be victorious over them all, he would need to possess a powerful strength. Should the so-called bloodline merger succeed, it would undoubtedly help Xiao Yan on his path.</p><br/><p>Xun Er inhaled a gentle breath of air. Her hand rapidly formed a couple of mysterious seals before her nail gently cut her jade-like wrist. A trace of blood appeared. Droplets of fresh blood slowly dripped down from her palm before falling into the blood pool.</p><br/><p>As these fresh blood drops fell into the blood pool, the fluctuations of pool slowly came to a halt. A five-foot-large hollow area was swiftly formed. The blood that had fallen from Xun Er’s hand gathered in that hollow area. At this moment, the blood did not scatter. Instead, it continued to gather before turning into a fist-sized blood ball that floated on the blood pool…</p><br/><p>“Elder Xiao Xuan. This is the most blood of the bloodline that I can take out. If I continue taking more out, it will affect my bloodline grade. Should the clan sense this matter, they will definitely connect it to Xiao Yan ge-ge. At that time, his situation will become even more dangerous.” After another drop of blood rolled down her wrist, Xun Er rapidly rubbed her hand over it. The blood immediately halted. Only then did she lift her somewhat pale face as she softly informed Xiao Xuan.</p><br/><p>“It is already enough, thank you.”</p><br/><p>Xiao Xuan once again cupped his hands to Xun Er. He was once the clan head of the Xiao clan. Naturally, he understood just what kind of great risk Xun Er took by being willing give some Gu clan bloodline strength to Xiao Yan. This bloodline strength might seem like only a little, but Xun Er would need to train for two years to replenish it. This favor was indeed magnanimous.</p><br/><p>Xun Er slightly shook her head. Her pretty eyes looked at Xiao Yan in the blood pool. His eyes were still tightly shut. A gentle and pretty smile surfaced on the corner of her mouth, but she did not say anything.</p><br/><p>“You should take a good rest first. Leave the remaining things to me. Relax, I will definitely hand you a Xiao Yan ge-ge, who is even more perfect…”</p><br/><p>Xiao Xuan fondled his snow-white beard and laughed. After which, his eyes landed on the blood pool. Both of his hands formed numerous seals with lightning-like speed. A low cry was emitted from his mouth at the same time, “Agglomerate!”</p><br/><p>After Xiao Xuan’s low cry sounded, the blood pool rapidly began to rotate. A whistling sound started to hum, but not even a little drop of pool water spilled out. Xiao Yan stood at the middle of this swirl. His body was like an unmoving stone statue.</p><br/><p>With the increase in the intensity of the rotating blood pool, a purple-golden light spread over Xiao Yan’s body. It appeared to have been suppressed as it gradually became much dimmer.</p><br/><p>“Chi!”</p><br/><p>While the purple-golden light became dim, a blood ball half-a-fist large suddenly shot out of the rapidly rotating blood. It broke through the purple-golden light with lightning-like speed and heavily struck Xiao Yan’s chest. The moment it did so, the blood ball swiftly merged into Xiao Yan’s body at a rapid speed.</p><br/><p>Xiao Yan’s body suddenly began to tremble after the blood ball sank into it. Numerous tiny blood symbols began to shoot out of his skin. Within the blink of an eye, they dyed him red with blood.</p><br/><p>Xun Er’s face immediately turned pale when she saw Xiao Yan’s body. However, Xiao Xuan merely inhaled a deep breath of air. His hand seal once again changed as the rapidly rotating pool of blood formed many fountains that continuously shot toward Xiao Yan’s body. Every time a blood fountain made contact, it would strangely enter Xiao Yan’s body.</p><br/><p>With an increasing amount of violent blood pouring into Xiao Yan, the two different bloodline strengths began to erode each other in Xiao Yan’s body like an all out battle. It seemed like they would not give up unless they destroyed the other party.</p><br/><p>“Roar!”</p><br/><p>While the two Dou Di bloodline strengths were eroding each other, the Dragon Phoenix bloodline strength that was hidden in a certain part of Xiao Yan’s body surged out after being urged by Xiao Xuan. A soul-stirring dragon roar and phoenix cry vaguely sounded.</p><br/><p>The Dragon Phoenix bloodline strength charged into the two eroding Dou Di bloodlines as the third party. The three types of bloodline strengths merged together. This, along with Xiao Xuan’s perfect control, caused the two types of strength to weaken…</p><br/><p>The three types of bloodline strengths formed a thri-colored blood cluster under Xiao Xuan’s control. This mysterious cluster continued to rotate and the three types of bloodlines began to show signs of merging…</p><br/><p>The progress was excruciatingly slow. It lasted for an entire month. After the month was up, the rotation suddenly came to a halt. A mysterious purple-red slowly flowed out of the sphere…</p><br/><p>This kind of bloodline was a completely new bloodline strength. It was a type of bloodline that fused two Dou Di bloodlines and the Dragon Phoenix bloodline!</p><br/>\n</div>"}