{"title": "Chapter 1364: Peak of an Eight Star Dou Zun!", "id": 1364, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1364-peak-of-an-eight-star-dou-zun", "volume_title": "Volume 14", "body": "<h1>Chapter 1364: Peak of an Eight Star Dou Zun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1364: Peak of an Eight Star Dou Zun!</u></strong></p><br/><p>Xiao Xuan and Xun Er’s eyes were focused on Xiao Yan as they stood outside of the blood pool. Their faces were filled with a seriousness and a nervousness.</p><br/><p>“Xiao Yan, you must not lose your rational thoughts…”</p><br/><p>Xiao Xuan tightly clenched his hands. His mouth continued to softly mutter words.</p><br/><p>“Bang!”</p><br/><p>While Xiao Xuan continued to mutter, a strange muffled sound was suddenly emitted from Xiao Yan’s body. The two watched Xiao Yan’s face become an extreme purple-red color, and his soaring aura began to rapidly revert.</p><br/><p>“Hu…”</p><br/><p>Xiao Xuan and Xun Er heaved a sigh of relief when they sensed Xiao Yan’s aura rapidly weaken. Fortunately, Xiao Yan had maintained his calm in the face of great temptation.</p><br/><p>Xiao Yan’s aura quickly diminished. Within a couple of minutes, it had weakened from the peak of the ninth star to around the sixth star. However, this was not something that the previous six star Xiao Yan could compare with. Both were similar levels but there was a significant difference.</p><br/><p>“This fellow has suppressed it very ruthlessly… however, this will incur a rebound…”</p><br/><p>Xiao Xuan smacked his lips. He did not expect Xiao Yan to suppress his aura from the peak of the ninth star back to the sixth star.</p><br/><p>This thought had just flashed within Xiao Xuan’s heart when Xiao Yan’s aura, which had been suppressed to the sixth star, began to rebound. However, the speed of this rebound was being controlled by Xiao Yan, so it was a lot slower.</p><br/><p>Peak of the sixth star… seventh star… peak of the seventh star… eighth star… ninth star...</p><br/><p>Xiao Yan’s aura slowly rose, stopping once it had rebounded to the ninth star. However, it did not rise to the peak of the ninth star again.</p><br/><p>However, Xiao Yan’s expression changed when his aura reached the ninth star. It was forcefully suppressed by him again. This time, the aura could no longer be suppressed any further after reaching the peak of the seventh star.</p><br/><p>“The energy is too dense. There will still be a rebound… but this should be the final one.” Xiao Xuan nodded as he sensed Xiao Yan’s rising and falling aura. From the looks of the current situation, all the changes were under Xiao Yan’s control, which made Xiao Xuan a lot less worried. Xiao Yan’s performance really satisfied him.</p><br/><p>Xun Er by the side also smiled and nodded. The energy that Xiao Yan had absorbed was far too dense, but this density caused the Dou Qi within his body to be too thin. It needed to be compressed in order to allow the Dou Qi to recover its usual denseness.</p><br/><p>“Blup blup…”</p><br/><p>Bubbles continued to be emitted from the clear pool. Xiao Yan’s aura finally showed some signs of rising again after pausing for a moment. Within less than five minutes, it easily broke through the seventh star and reach the eighth star. Finally, it came to a complete stop at the peak of the eighth star.</p><br/><p>“Peak of the eighth star…”</p><br/><p>Xiao Xuan and Xun Er sighed in relief after sensing Xiao Yan’s stabilized aura. His strength had risen by two stars. Fortunately, this level should be within Xiao Yan’s control. Xiao Yan had found the most suitable equilibrium in terms of the great increase in strength.</p><br/><p>After Xiao Yan’s aura completely stabilized, his eyes, which had been shut for one and a half years, finally began to twitch. A moment later, they were finally opened in front of Xiao Xuan and Xun Er.</p><br/><p>“Chi!”</p><br/><p>Two purple-red lights shot out of both of Xiao Yan’s eyes like pillars when they were were opened. It caused a towering stone pillar within the large hall to turn into dust with a bang.</p><br/><p>The light that shot out was slowly diminished a moment later. However, Xiao Yan’s originally dark-black eyes had gained an additional purple-red color, causing them to appear quite unusual.</p><br/><p>“Hu…”</p><br/><p>A mouthful of hot eroding air followed Xiao Yan’s throat as it was slowly spat out. Upon sensing the ocean-like Dou Qi, a joyous feeling suddenly formed. Immediately, a clear voice that vaguely possessed a dragon roar and phoenix cry bellowed from his mouth.</p><br/><p>“Roar!”</p><br/><p>The roar was like thunder as it rolled through the hall. It shook the room until it trembled.</p><br/><p>“Ha ha, how refreshing!”</p><br/><p>The roar reverberated across this hall for a moment before gradually disappearing. Xiao Yan loudly laughed. His hand slammed the surface of the water, and his body rushed out in a flash. He gently landed beside the blood pool. A frighteningly powerful aura that could not be increased any further swept in all directions like a storm.</p><br/><p>“Congratulations, Xiao Yan ge-ge.”</p><br/><p>Xun Er sweetly smiled and congratulated him when she saw him smoothly exit his retreat.</p><br/><p>Xiao Yan grinned and stretched his lazy waist. His hand randomly grabbed in front of him and the space itself appeared dented. After sensing the feeling of being filled with a majestic energy, Xiao Yan was confident that if he fought Gu Yao again, he would be able to defeat Gu Yao within twenty exchanges with no Dou Skills.</p><br/><p>A peak eight star Dou Zun, in terms of level, the current him had truly caught up to Gu Yao, Gu Hua, and the rest who were considered the young geniuses of the Gu clan.</p><br/><p>“Thank you ancestor!”</p><br/><p>Xiao Yan turned to Xiao Xuan by the side, who had become old-looking. With a wave of his sleeve, he unhesitatingly knelt in the direction of his ancestor and thanked him in a deep voice.</p><br/><p>Forget about Xiao Xuan’s seniority. Xiao Xuan had turned himself into this state in order to preserve the final bloodline of the Xiao clan and had waited a countless number of years. He was worthy of receiving a kotow from Xiao Yan!</p><br/><p>Xiao Xuan smiled in a pleased manner. His eyes were filled with a gentleness as he helped Xiao Yan to his feet. He said, “The Xiao clan has a chance to be revitalized now. My waiting here for so many years was really worthwhile… however, the one you should thank this time around is likely your little girlfriend. If not for her help, you would not have been able to merge the three types of bloodlines.”</p><br/><p>Xiao Yan was slightly startled. He turned his head and looked at the smiling Xun Er, but she slowly shook her head at him. Xiao Yan naturally understood her meaning. She did not wish for there to be a clear divide between the two of them. A warmth immediately surged into his heart. What else could a man wish for after gaining such a woman.</p><br/><p>“Xiao Yan, currently, a new bloodline seed has been planted deep within your heart. You need to protect it properly. Do not let any mishaps befall it. It will play a critical role in determining if you will reach the Dou Di class…” Xiao Xuan’s expression was solemn as he continued, “If you reach the Dou Di class, the wasted bloodline in the bodies of those members of the Xiao clan will once again be revived, and the bloodline will be even stronger than in the past!”</p><br/><p>“This is the only hope to revitalize the Xiao clan!”</p><br/><p>Xiao Yan quietly nodded. His hand gently rubbed his chest. It was just possible for him to vaguely feel his strong and powerful heartbeat. Each time it beat, it seemed to cause the Dou Qi within his body to ripple a little.</p><br/><p>“Additionally, you should be careful of the Hun clan. I have come into contact with them many times, and this clan is quite mysterious and strange. Even when the Xiao clan was at its peak, we could only fight equally with them. The Xiao clan had a peak period among the eight ancient clans. At that time, the Xiao clan was the strongest while the Gu clan was the second. However, the Hun clan was the most unusual…”</p><br/><p>“Based on my guess, the strength of the Hun clan is likely a little stronger than even the Gu clan…” Xiao Xuan’s expression was solemn. Back then, the Xiao clan had engaged in a big battle with the Hun clan and had roped in many helpers. However, they were ultimately unable to gain much. This was enough to prove how powerful the Hun clan was. Moreover, the Hun clan had a long history, but it appeared that its bloodline hadn’t been exhausted. This was something that Xiao Xuan had never understood, but he was ultimately unable to obtain a true answer.</p><br/><p>The expressions of Xiao Yan and Xun Er changed when they heard Xiao Xuan’s words. Xun Er was clearly aware of the strength of the Gu clan. The Gu clan had fought with the Hun clan during these years and had won most of the time. Hence, she found it difficult to accept it when she heard Xiao Xuan mention that the Hun clan could be stronger than the Gu clan.</p><br/><p>“The Gu clan is indeed the most stable clan among the eight clans. However, the Hun clan is far too mysterious… there is hardly anyone in this world who truly understands them…” Xiao Xuan sighed. He waved his hand when he saw Xiao Yan and Xun Er frowning. He said, “In any case, before you reach the Dou Sheng class, you should try to be careful. You possess the Tou She Ancient God’s Jade in your hand. The members of the Hun clan will definitely come and look for you…”</p><br/><p>Xiao Yan nodded. He clearly understood in his heart that regardless of whether it was because of a grudge between the two clans or some other personal issues, those fellows from the Hun clan would definitely not let him off easily, but it was impossible to shrink back for any reason. He would definitely not submit before he truly reached that final step, even if his opponent was the most mysterious Hun clan among the eight ancient clans!</p><br/><p>“It has already been two years since you have entered the Heavenly Tomb. There is still around a year left before you will be sent out. You should train more during this one year and get used to your strength that has soared…” Xiao Xuan patted Xiao Yan’s shoulder. He immediately clenched his hand and a scroll with various flame drawings appeared in his hand.</p><br/><p>“This is the complete version of the Skyfire Three Mysterious Change. It also possesses the final step. If you successfully learn it, you will succeed in creating the clan tattoo. If the bloodline strength is used in union with it, it will unleash the strength of the clan tattoo to its limit.”</p><br/><p>Xiao Yan’s eyes immediately landed on the scroll when he heard Xiao Xuan’s words. A heat surged within his eyes. The completed version of the Skyfire Three Mysterious Change had finally landed in his hands.</p><br/>\n</div>"}