{"title": "Chapter 1372: A Completely New Falling Star Pavilion", "id": 1372, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1372-a-completely-new-falling-star-pavilion", "volume_title": "Volume 14", "body": "<h1>Chapter 1372: A Completely New Falling Star Pavilion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1372: A Completely New Falling Star Pavilion</u></strong></p><br/><p>An unusually clear lake sparkled in the middle of the Gu Sacred City. The sunlight scattered into many glaring rays…</p><br/><p>“Chi!”</p><br/><p>An intense ripple suddenly stirred on the calm lake’s surface as an enormous spatial crack slowly tore through the air. Many human figures swiftly rushed out of it after it appeared. Finally, they landed on the ground, and in an instant, the somewhat quiet city had become lively again.</p><br/><p>Xiao Yan hurried out of the spatial door and finally appeared on a building. His eyes swept around. Without waiting for the members of the Gu clan to come and receive him, he moved and flew toward the city gate of Gu Sacred City. The experts from the Gu clan acted as though they did not see him. None of them stopped him, allowing him to hurry to the city’s gate before finally disappearing from their sight.</p><br/><p>XIao Yan smoothly rushed out of Gu Sacred City. Only then did he stop in the air and look at the greenery that spread to the horizon. His heart involuntarily exhaled a long breath. Although the Gu Realm was extremely spacious and possessed a denser energy as compared to the outside world, Xiao Yan ultimately felt that this Central Plains gave one an even greater freedom for some unknown reason…</p><br/><p>“Next, I should hurry back to the Falling Star Pavilion…”</p><br/><p>Xiao Yan did not remain in this spot for long. He took out a map to identify where he needed to go. After which, his body turned into a brilliant light that hurried to the northern horizon with lightning-like speed. Hr disappeared into the horizon in the blink of an eye.</p><br/><p>Xiao Yan did not stop for a prolonged period of time during this subsequent journey. At his full speed and with the help of a couple of spatial wormholes, he spent five days or so before reaching the territory controlled by the Falling Star Pavilion.</p><br/><p>Xiao Yan clearly sensed that there were many more experts’ auras around him after entering the Falling Star Pavilion’s territory. Some of the important cities along the way had gained two to three elite Dou Zuns. This was a strength even within the Central Plains region. However, Xiao Yan clearly understood that with Yao Lao, this great golden signboard, it was not difficult to gather these experts to aid them.</p><br/><p>Xiao Yan felt somewhat at ease after not coming across any chaotic scenes along the way. Although the defenses had been strengthened, the pressure that a big battle created was absent.</p><br/><p>Xiao Yan did not take any short stops in the cities that belonged to the Falling Star Pavilion. He hurried to the Falling Star Pavilion. Hence, in a short half day, he had reached the mountain range of the Falling Star Pavilion. Subsequently, he turned into a ray of light that charged into the realm where the Falling Star Pavilion was located…</p><br/><p>The atmosphere within the star realm was peaceful. Although the size of this place could not be compared with a place like the Gu Realm, it could still be considered similar to a city. It could accommodate over a hundred thousand people without any problems.</p><br/><p>Densely packed Falling Star Pavilion disciples were training in an orderly fashion in a somewhat spacious square. Numerous powerful cries gathered together, appearing like thunder that resounded all around.</p><br/><p>The current star realm undoubtedly possessed a new look when compared to the past. The originally arduous mountain range had been opened up and clusters of buildings had been built on them. Many human flows walked along them like ants, causing it to appear extremely lively. Moreover, many more powerful auras were vaguely being emitted from the enormous mountains in the middle of the star realm, covering every part of the star realm. The current star realm truly possessed an iron-wall-like feeling…</p><br/><p>“Chi!”</p><br/><p>A ray of light suddenly flashed and appeared within the peaceful star realm. It was accompanied by an extremely wild momentum as it flew over from afar. It charged toward the mountain at the middle of the star realm.</p><br/><p>“Who dares to cause trouble within the star realm?”</p><br/><p>Some furious cries suddenly resounded in the sky of the star realm when the ray of light appeared. One could hear numerous ‘swoosh’ sounds as many elderly figures appeared in the sky. After which, they furiously cried out in unison, “Still!”</p><br/><p>The space in the sky rapidly solidified after the ten furious elderly cries sounded. While everyone thought that the figure was about to stop, they were stunned to see that the ray of light not halt and its speed suddenly increased. It broke through the solidified space without any resistance in front of the many startled eyes. Finally, it appeared behind those elders in a ghost-like manner.</p><br/><p>“Ha ha, it has only been half a year since I left, but the defenses have become this tight…” That figure stopped in front of the many gazes. Immediately, a black-robed young man with black hair slowly appeared and laughed.</p><br/><p>“Who are you?”</p><br/><p>These elders, who had attempted to stop the figure earlier, observed Xiao Yan with grave eyes. After the scene earlier, they no longer dared to underestimate this exceptionally young black-robed man. Moreover, they could sense a vague pressure radiating from his body. This kind of pressure was something that only a handful of people in the Falling Star Pavilion could make them feel.</p><br/><p>The activity in the sky attracted the attention of the Falling Star Pavilion disciples training on the ground. Many stunned gazes looked at Xiao Yan in the sky. Their mouths were amazed. It was the first them that they had witnessed the ten guest Elders not gain an advantage despite having attacked at the same time.</p><br/><p>Xiao Yan smiled in a bitter and helpless manner when he saw the uncertain eyes of those Elders. He had only been away for half a year, yet almost no one recognized him…</p><br/><p>“Junior Pavilion Chief!”</p><br/><p>A couple of elderly figures finally rushed over from the main mountain while Xiao Yan was feeling helpless. They were initially startled before crying out in pleasant surprise.</p><br/><p>The ten Falling Pavilion Guest Elders and countless Falling Star Pavilion disciples were stunned when they heard this joyous cry. Their eyes glanced at Xiao Yan with some disbelief. Xiao Yan’s reputation was quite great within the Falling Star Pavilion, but it had only been a short while since many people had come to the Falling Star Pavilion. Hence, this was the first time many people had seen him.</p><br/><p>“He is actually that junior pavilion chief of our Falling Star Pavilion…”</p><br/><p>“Hee hee, junior pavilion chief is really handsome…”</p><br/><p>“Stop being ‘boy-crazy.’ How can someone like the junior pavilion chief fancy us…”</p><br/><p>“I heard that the junior pavilion chief is also the Pill Gathering Champion. He is also an elite Dou Zun. I joined the Falling Star Pavilion because of him. It is unexpected that I have finally seen this legendary person today. Hee hee…”</p><br/><p>“......”</p><br/><p>While many heated conversations sprung up below, a yellow-robed elder, who seemed to be the leader of the group of Guest Elders, hurriedly came forward and greeted Xiao Yan. Although he was older than Xiao Yan, the stronger person was the master. Currently, Xiao Yan’s achievements in every aspect were far from what the Guest Elders could compare with. Hence, their tones were naturally extremely polite. They did not dare to be the least bit disrespectful.</p><br/><p>“Elder is too courteous.”</p><br/><p>Xiao Yan faintly smiled. After which, his eyes swept around him before an admiration appeared in them. The Falling Star Pavilion had undergone a drastic change during this short half a year. With such a large number of experts guarding it, it was likely that even the Hun clan would not dare to easily attack. From the auras that he could sense on the surface, the strength of the current Falling Star Pavilion was not weaker than the Profound Sky Sect or the Flower Sect. Moreover, the Falling Star Pavilion may have even surpassed them.</p><br/><p>“Ha ha, you have finally returned…”</p><br/><p>The space behind Xiao Yan fluctuated while his eyes swept across the star realm. An elderly figure slowly appeared. That figure was surprisingly Yao Lao.</p><br/><p>“Teacher.”</p><br/><p>Xiao Yan hurriedly bowed and respectfully greeted Yao Lao.</p><br/><p>“Greetings pavilion chief!”</p><br/><p>The Guest Elders by the side also respectfully greeted Yao Lao when he appeared. Yao Lao seldomly revealed himself, so Yao Lao was a mysterious existence in the eyes of these Guest Elders. It was unexpected that he would personally come and receive this junior pavilion chief the moment he appeared.</p><br/><p>“You have become rather refined after a trip to the Gu Realm…”</p><br/><p>Yao Lao smiled and shook his head. He waved his hand at the Guest Elders. After which, he swept his eyes over Xiao Yan and some satisfaction surfaced in them. He said, “Not bad, not bad, within half a year, you have advanced to an eight star Dou Zun from a five star Dou Zun. It looks like you have gained a lot from this trip…”</p><br/><p>Some shock appeared in the eyes of those Guest Elders when they heard Yao Lao’s praise. This person was indeed worthy of being the junior pavilion chief. Such an increase was really too frightening.</p><br/><p>Xiao Yan smiled. With Yao Lao’s strength, he was naturally able to see through Xiao Yan, who subsequently nodded in reply.</p><br/><p>“Let’s go. We’ll head down first. I have waited a long time for your return…” Yao Lao spoke with a smile.</p><br/><p>“Aye.” Xiao Yan nodded. His eyes swept around him before he frowned. He softly asked, “Teacher, has the Little Fairy Doctor and the rest not returned?”</p><br/><p>“They have returned, but they left again…” Yao Lao replied.</p><br/><p>“Left? Where?” Xiao Yan asked in a startled voice.</p><br/><p>“This is also the reason I have been waiting for you. We received some news soon after you entered the Heavenly Tomb. After which, I asked the Little Fairy Doctor and the rest to quickly return. After which, they hurried to the Jia Ma Empire…”</p><br/><p>“Jia Ma Empire?” The familiar name caused Xiao Yan to feel stunned. However, it only lasted for an instant before his face experienced a drastic change.</p><br/><p>“Something happened to the Yan Alliance?”</p><br/><p>[a]Jia Ma Empire?</p><br/>\n</div>"}