{"title": "Chapter 1381: Completely Different from Before", "id": 1381, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1381-completely-different-from-before", "volume_title": "Volume 14", "body": "<h1>Chapter 1381: Completely Different from Before</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1381: Completely Different from Before</u></strong></p><br/><p>After this cold cry was made, the black fog that spread over the distant sky fluctuated before scattering apart. A blue figure slowly stepped through the air. Within a couple of flashes, the figure appeared a thousand feet from Xiao Yan.</p><br/><p>“I was wondering who it was. It is actually you, a homeless stray. Unexpectedly, you possess the courage to return to this place… in that case, I will also capture you and bring you back with the rest.” The ninth Tianzun’s eyes looked at Xiao Yan in a chilly manner as he coldly laughed.</p><br/><p>“I’m afraid that you do not possess the qualifications…”</p><br/><p>Xiao Yan smiled. If he had met this ninth Tianzun before entering the Heavenly Tomb, things might have been a little troublesome. However, just Xiao Yan’s current strength was no weaker than his. If they were to exchange blows, Xiao Yan was confident he could force the ninth Tianzun to remain here forever.</p><br/><p>Xiao Yan has never feared anyone within the same level!</p><br/><p>“What arrogant words! You really think that you can be haughty with the growth in your strength. Today, I’m afraid that you won’t be able to leave this place!”</p><br/><p>The ninth Tianzun coldly cried out. However, he did not attack immediately. He was no fool. He could tell that Xiao Yan’s strength had improved by leaps and bounds because he had seriously injured Shi Tian with just one strike. Hence, he would naturally be a little careful, given his cautious nature.</p><br/><p>“Chi!”</p><br/><p>The black fog behind the ninth Tianzun rippled after his cold voice sounded. Three figures immediately rushed over and stood beside the ninth Tianzun. Their sinister eyes swept over Xiao Yan as they laughed in a strange manner, “It is actually this brat. It is rumored that our Hall of Souls has failed many times to capture him…”</p><br/><p>“Why don’t we act together and capture him? We will be given great credit if we can bring this brat back.”</p><br/><p>Cai Lin and the others on the wall were startled when they saw the sudden appearance of these people. They could sense the frightening auras of these four people…</p><br/><p>Xiao Yan’s eyes swept over the three black-robed old men who had suddenly appeared. These three were clearly experts from the Hall of Souls. Their strengths were also around that of an eight star Dou Zun. Thus, they were relatively strong. It seemed that theses were the four eight star Dou Zun experts mentioned in the information Xiao Yan had obtained.</p><br/><p>“Ha ha, those from the Hall of Souls always like to do such things…”</p><br/><p>A loud laugh was transmitted from behind Xiao Yan when the three black-robed old men appeared. They were the three Hu elders who Yao Lao had hired. Due to the frightening lineup that Xiao Yan had brought with him, the Yan Alliance had already stabilized the situation. Those enemy experts who had charged onto the wall had been eliminated. The remaining individuals from the Profound Lion Sect had lost a great amount of their vigor from earlier because of the sudden appearance of these dozens of elite Dou Zuns. They did not dare to randomly charge over at the moment...</p><br/><p>The three Hu elders managed to find the time to come to Xiao Yan’s aid after stabilizing the situation. The three of them were quite well-known in the Central Plains region. Hence, they were not afraid of the Hall of Souls, so their tones were a little rude.</p><br/><p>“Three Hu elders? It is unexpected that you old farts who refuse to die have also come. Looks like you have really lived too long. Even your brains are deluded…”</p><br/><p>The expression of the ninth Tianzun in the sky sank when he saw the three Hu elders. He immediately let out a cold laugh. From the looks of it, he had clearly heard of the Hu elders.</p><br/><p>“Ha ha, other people might be afraid of your Hall of Souls, but we are not. This world is so huge. Do you really think that your Hall of Souls can dominate it?” The eldest Hu brother curled his mouth. He did not pay heed to this threat from the ninth Tianzun.</p><br/><p>“Junior pavilion chief, this noisy old fellow will be left to you. The three of us will take care of the three others. What do you say?”</p><br/><p>Xiao Yan slightly smiled and immediately nodded upon hearing the words of the eldest Hu brother. The three Hu elders were also eight star Dou Zuns. It would not be a problem for them to deal with three experts of similar strength.</p><br/><p>“Ha ha, in that case, let’s see who will be able to finish off their opponent first…” The oldest Hu brother loudly laughed. Dou Qi surged out of his body in all directions. The second and third Hu brothers followed close behind. After which, they separated and rushed to attack the other two black-robed elders.</p><br/><p>“Hmph, since all of you wish to deliver yourself to us, we shall accept your offers!”</p><br/><p>Those three black-robed elders chuckled in a sinister tone when they saw the three old Hu brothers rushing over. Dark fog surged out of their bodies as they moved, transforming into three black balls of smoke that heavily collided with the Hu brothers. Immediately, frightening energy fluctuations swiftly expanded.</p><br/><p>The ninth Tianzun frowned when he saw the six individuals engage in a fight within an instant. He had not expected Xiao Yan to bring so many experts from the Central Plains.</p><br/><p>“Our mission this time around is to capture all the members of the Xiao clan. Looks like we must first deal with this person today…”</p><br/><p>A glint flashed over the ninth Tianzun’s eyes before a ferocious glow appeared in them. He clenched his hand without any unnecessary words and dark chilly air swiftly gathered. It finally turned into a layer of black crystals that covered his right hand. At the same time, his foot stepped through empty air and his body disappeared in a strange manner in front of many gazes.</p><br/><p>“What swift speed…”</p><br/><p>The faces of the Yan Alliance experts on the wall became anxious when they saw the ninth Tianzun disappearing in a flash.</p><br/><p>“Such speed… is still insufficient.”</p><br/><p>Xiao Yan in the sky merely shook his head. He waved his hand to strike the empty space beside him with lightning-like speed. An illusory figure immediately appeared from the spot where the wind from his palm reached. A dark and chilly palm violently clashed with Xiao Yan’s hand.</p><br/><p>“Bang!”</p><br/><p>A wind containing a dark chill mixed with a strong heat before erupting from the point of contact as both palms clashed. Space itself was shaken until it became distorted.</p><br/><p>“Eight star Dou Zun?”</p><br/><p>The powerful wind erupted and the ninth Tianzun’s body appeared, but his expression changed because of the hot and cold forces that were erupting around his arm like floodwater. A groan was emitted from his throat as he was forced back over a dozen steps. Shock immediately surged onto his face. After an initial exchange, he had suddenly realized that the current Xiao Yan had reached the eighth star of the Dou Zun class!</p><br/><p>The ninth Tianzun clearly remembered when he met with Xiao Yan half a year ago. Back then, Xiao Yan had just reached the fifth star. Although he had sensed that Xiao Yan’s aura had soared, he had not expected this great increase to reach such a terrifying extent.</p><br/><p>The experts of the Yan Alliance on the wall erupted into a cheer when they saw Xiao Yan had obtained the upper hand in a head-on clash with the ninth Tianzun. A shock that could not be hidden also appeared in their eyes. By being able to force the ninth Tianzun, who was an eight star Dou Zun, back, the strength of the current Xiao Yan must have reached that of an eight star Dou Zun.</p><br/><p>“Ugh, Xiao Yan had only just reached the Dou Huang class when he left back then… it has only been a few short years, yet his strength has soared to such an extent. We have no choice but to admire him.”</p><br/><p>Hai Bodong and the rest faced each other. He helplessly sighed a moment later During these years, he had relied on the medicinal pills accumulated by the Yan Alliance to breakthrough to the Dou Zong class after experiencing much difficulty. Originally, he thought that he was fairly quick, but there was no way for them to even compare with Xiao Yan.</p><br/><p>“It has been over half a year since we last met, yet you have not even improved a little…”</p><br/><p>Xiao Yan shook his head when he saw the ninth Tianzun’s shock. Xiao Yan’s strength had reached the peak of an eight star Dou Zun. The ninth Tianzun was now a little weaker than Xiao Yan. Back then, Xiao Yan had already been able to engage the ninth Tianzun in an intense battle with just the strength of a five star Dou Zun. Now, this so-called ninth Tianzun no longer posed even the slightest threat to him.</p><br/><p>“Brat, it is still too early for you to be pleased!”</p><br/><p>The ninth Tianzun’s face immediately turned a little green when he heard Xiao Yan’s words. A seal was formed by his hand with lightning-like speed as a muffled cry was emitted from his throat. The dark chilly air around them swiftly gathered into many thousand-foot-tall energy palms after this cry sounded. Palm wind whistled and furiously struck at Xiao Yan from all directions.</p><br/><p>Faced with the ninth Tianzun’s powerful attack, Xiao Yan stepped through empty space and acted like he was taking a leisurely stroll. Many after-images appeared, causing the many large energy palms to miss. Some of the large energy palms that could not be dodged were forcefully shattered with a flick of Xiao Yan’s wrist.</p><br/><p>Xiao Yan stepped through empty air in front of the countless number of gazes present. He stepped closer and closer to the ninth Tianzun. Regardless of how the red-faced ninth Tianzun tried to block Xiao Yan, he was unable to cause Xiao Yan to pause for even a moment. Watching this battle, everyone understood that Xiao Yan’s strength had far surpassed the ninth Tianzun’s strength!</p><br/><p>“Bang!”</p><br/><p>A purple-brown flame rose in Xiao Yan’s hand and forcefully shattered an enormous energy palm that was approaching his body before his footsteps finally came to a stop. He lifted his head and looked at the ninth Tianzun, whose expression was a little pale. A faint smile appeared. They were both eight star Dou Zuns, but Xiao Yan’s strength had surpassed him by many times. Adding the Ancient Insect Emperor Cloth and the Dragon Phoenix Ancient Armor, the ninth Tianzun’s attacks were no longer able to harm him. This battle, which was on a completely different level, did not have any meaning from the beginning.</p><br/><p>“He is not just at the eighth star. He is at the peak of the eighth star… this person is improving at an impossibly rapid pace. I can no longer match him…”</p><br/><p>Regardless of how ugly the ninth Tianzun’s expression was when he watched Xiao Yan shatter his attacks, he had to admit that his current strength was no match for Xiao Yan. He decisively clenched his teeth and stomped a foot on empty air, causing his body to suddenly withdraw.</p><br/><p>“Since you are already here, why do you need to leave?”</p><br/><p>Xiao Yan grinned after seeing the Ninth Tianzun flee. Xiao Yan’s body slowly disappeared, and he was already behind ninth Tianzun when he appeared. His right hand gently slapped the empty air, and a cluster of black light swiftly spread while accompanied by a faint destructive aura…</p><br/><p>The ninth Tianzun’s expression suddenly became pale as he sensed the annihilation aura that spread over with lightning-like speed. With Xiao Yan’s current strength, unleashing a Tian class Dou Skill like the Great Heaven Creation Palm was like the sickle of a death god for the ninth Tianzun!</p><br/><p>The ninth Tianzun suddenly lowered his head while his heart was covered with an aura of death. He looked at the ground below and his voice sharply cried out.</p><br/><p>“Fourth brother, save me!”</p><br/>\n</div>"}