{"title": "Chapter 1398: Three Ghost Scorpion Demon", "id": 1398, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1398-three-ghost-scorpion-demon", "volume_title": "Volume 14", "body": "<h1>Chapter 1398: Three Ghost Scorpion Demon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1398: Three Ghost Scorpion Demon</u></strong></p><br/><p>Xiao Yan’s group’s hearts shook when they heard Yao Lao’s words. Their eyes looked to the front where a faint wind lightning sound was present. A couple of dozen seconds later, three black glows suddenly rushed over from the distance!</p><br/><p>The speed of the three black glows was extremely terrifying. Within a flash, they appeared a thousand feet away. However, they suddenly appeared to have sensed something when they were just about to enter the mountain where Yao Lao was located. They immediately paused, and three dark, cold and ruthless gazes shot over. They paused on the group on the mountain.</p><br/><p>“Yao Chen? It is actually you!”</p><br/><p>The three of them were stunned when they saw Yao Lao. A furious voice soon appeared.</p><br/><p>Xiao Yan’s eyes observed the other party while these three were exclaiming. The leader was a somewhat skinny figure. His face was dark and stern, and from the looks of it, he was the person who had made the bid at the trade fair earlier. There was another elder and a man, who appeared somewhat younger, behind him. Although the last man appeared young, both of his eyes revealed an age that was not any younger than the other two old demons.</p><br/><p>Other than the younger-looking man, whose appearance was a little better, the remaining two gave one a dark and chilly feeling. Moreover, the auras that were vaguely emitted from their bodies were quite terrifying.</p><br/><p>“Three He Demon Ghosts, It has been a long time since we have met…” Yao Lao placed his hands behind him and laughed.</p><br/><p>“You are the person who had bid against the ole’ me earlier?” The skinny old man, who was the leader, glared at Yao Chen in a ruthless manner before he suddenly demanded.</p><br/><p>Yao Lao smiled after seeing Tian He Zi recover. He did not say any unnecessary words. “Hand over the ancient map...:”</p><br/><p>“Tsk tsk. How unexpected. The renowned Yao zun-zhe, Yao Chen, on the continent is doing something like stopping someone and robbing treasure from them!” Tian He Zi strangely laughed when he heard Yao Lao’s words.</p><br/><p>Yao Lao smiled and spoke in an unconcerned manner, “If it was someone else, I might have thought twice. Fortunately, it is the three of you. Therefore, I do not feel any mental burden. Other people might be considered humans, but I do not regard the few of you as such…”</p><br/><p>“Hmph, Yao Chen, don’t think that the three of us are afraid of you just because you have advanced to the Ban Sheng class. Back then, we were able to beat you until you fled being injured. We are still able to do so today!” The brutal-looking Di He Zi spoke with a dark and cold voice.</p><br/><p>“Why don’t you give it a try? We will also be able to resolve our grudges from back then…”</p><br/><p>Yao Lao grinned. He stomped his foot on the ground and his body appeared in front of those three in a ghost-like fashion. Monstrous Dou Qi suddenly surged out of his body, and the sky suddenly turned dark. Wild wind raged and whistled across the sky.</p><br/><p>The expressions of Tian He Zi’s group changed when they saw Yao Lao stirring such a force, especially Tian He Zi’s expression. Although he was only half a step away from the Ban Sheng class, he understood just how large this difference was. An intense battle was unavoidable if they wished to escape today.</p><br/><p>“Bang!”</p><br/><p>Yao Lao did not give the three of them any extra time. He clenched his hand and dark clouds surged from the sky as a ten-thousand-foot-large fire hand suddenly formed. After which, it explosively hurtled the He Zi trio.</p><br/><p>“Attack together!”</p><br/><p>A dark vicious expression flashed across the eyes of Tian He Zi’s group when they saw Yao Lao attacking as he pleased. They let out a furious roar as Dou Qi surged from their bodies. After which, they turned into three thousand-foot-large light pillars that ruthlessly collided with the enormous flame hand.</p><br/><p>“Bang!”</p><br/><p>The two collided and a frightening wind ripple surged out in all directions. The enormous mountains around were shaken by that energy ripple until they burst apart.</p><br/><p>“Hmph!”</p><br/><p>As a frightening wind swept apart, Tian He Zi and his two brothers’ footsteps staggered. They hurriedly took two steps back. A muffled voice was emitted from Tian He Zi’s throat. He had suffered a small loss in this hurried cooperation of theirs.</p><br/><p>“The strength of this old fellow is so terrifying?”</p><br/><p>The three of them were unable to gain an advantage despite joining hands. The expressions of Tian He Zi’s group changed. Their eyes flickered. Suddenly, they turned to Xiao Yan’s group on the mountain and sinisterly said, “Third brother, those three are together with this old fellow. Capture them. Remember that they must live!”</p><br/><p>The three of them would definitely enter into a bitter battle if they were to fight Yao Lao. Hence, it was better to capture Xiao Yan’s group and use them as hostages. Only then would they be able to successfully escape.</p><br/><p>“Aye.”</p><br/><p>Ren He Zi looked into the distance when he heard this. An evil smile slid over his face as he nodded and said, “Give me a couple of minutes!”</p><br/><p>His feet stepped on empty air after his voice sounded. He rushed in the direction of Xiao Yan’s group. Yao Lao frowned when he saw this. He was just about to intervene when Tian He Zi and Di He Zi suddenly unleashed the Dou Qi within their bodies until their limits. After which, they unleashed a tricky attack from all directions.</p><br/><p>“You are seeking death!”</p><br/><p>Yao Lao’s eyes turned chilly when he saw this. Tian He Zi and the other two could barely fight him with their combined strength, yet they dared to separate. They were really committing suicide. He was not too worried about Xiao Yan’s group. Although Ren He Zi was a six change peak Dou Zun, it would be impossible for him to finish off Xiao Yan’s group within a short period of time.</p><br/><p>Murderous desire surged within Yao Lao’s heart. The space around him swiftly became distorted. After which, he exchanged blows with Tian He Zi again, and a frightening energy ripple once again spread across the sky.</p><br/><p>While Tian He Zi and his brother were pestering Yao Lao, Ren He Zi appeared a short distance in front of Xiao Yan’s group with lightning-like speed. His heated eyes suddenly paused on Cai Lin and the Little Fairy Doctor’s well-proportioned and lovely figures.</p><br/><p>“Ha ha, it is unexpected that I can meet two exquisite beauties. This is the greatest gain of this trip.”</p><br/><p>Ren He Zi’s eyes were incomparably hot as they looked at Cai Lin and the Little Fairy Doctor. The appearance and demeanor of these two women was not what those meat cauldrons within the Cloud Rain Sect could compare with. They had surpassed everything. Lewd thoughts immediately began to grow wildly within his heart once he saw them.</p><br/><p>Cai Lin and Little Fairy Doctor’s pretty face gradually turned icy as they sensed Ren He Zi’s lewd eyes. Dou Qi gathered with lightning-like speed in their hands.</p><br/><p>“Hee hee, die brat. Leave the beauties behind!”</p><br/><p>Ren He Zi licked his lips. A punch was thrown toward Xiao Yan from across a distance. A frightening sonic boom was formed from his fist, and it rumbled across the sky.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s face was void of expression. His feet abruptly stomped on the ground. The mountain in front of him suddenly blasted apart as a hundred-foot-large hot lava cylinder shot out. It poured down from the sky and stirred clusters of flames on the mountain top.</p><br/><p>Xiao Yan took the opportunity to glance at Yao Lao’s battle in the distance after having blocked Ren He Zi’s attack. At this moment, Tian He Zi and his brother were in a situation where they were completely overwhelmed. From the looks of the battle, they would not be able to endure for long.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan softly sighed in his heart. Both of his hands formed numerous complicated hand seals, and a clan tattoo surfaced between his brows. With its appearance, Xiao Yan’s aura soared from the peak of an eight star Dou Zun to a three change peak Dou Zun.</p><br/><p>Ren He Zi was a six change peak Dou Zun expert. He was much stronger than Xue He zun-zhe. Hence, Xiao Yan had no choice but to be cautious since his opponent was considered the strongest Dou Zun among those he had met and fought.</p><br/><p>“Brat, you do indeed have some skills. However, the old me dislikes those who enjoy multiple women. You can rest assured that the old me will take good care of these two beauties after you die!”</p><br/><p>Ren He Zi let out a sharp laugh after sensing Xiao Yan’s soaring aura.</p><br/><p>“Bang!”</p><br/><p>Cai Lin’s face turned extremely cold when she heard Ren He Zu’s obscene words. Her lovely figure leaped into the sky and dark clouds churned. Her figure turned into a ten-thousand-foot-long Seven-Colored Heaven Swallowing Python. Her enormous body was hidden within the dark cloud, appearing like a dragon.</p><br/><p>“Oh? This beauty’s actual body is the extinct Seven-Colored Heaven Swallowing Python. Ha ha, how delicious. The old me likes it!”</p><br/><p>Ren He Zi was startled when he saw Cai Lin turn into a Seven-Colored Heaven Swallowing Python, but he soon let out a loud laugh.</p><br/><p>“Crash!”</p><br/><p>Ren He Zi’s loud laugh had just sounded when a colorful thunderbolt suddenly smashed down from the dark clouds. After having transformed, Cai Lin’s aura had also soared. She was equivalent to an eight star Dou Zun human expert. However, Ren He Zi merely waved his sleeve in the face of such an attack. A wave of majestic Dou Qi forcefully vanquished her attack.</p><br/><p>“Woeful Poison Body, activate!”</p><br/><p>The Little Fairy Doctor’s face was icy-cold. Her hand seals changed, and her beautiful long black hair suddenly turned silvery-white. A Dou Qi glow that contained a fatal poison rushed toward Ren He Zi with lightning-like speed.</p><br/><p>“Huh? This beauty has the Woeful Poison Body? Ha ha, all of you are exquisite…”</p><br/><p>Ren He Zi once again laughed out loud as he sensed the lethal poison within the pillar, but he did not appear relaxed. His body hurriedly pulled back as he dodged this lethal poison pillar. The Woeful Poison Body was too intense. It would be somewhat troublesome if he touched even a miniscule amount.</p><br/><p>“These two beauties are really ruthless. One is a Seven-Colored Heaven Swallowing Python while the other has a Woeful Poison Body. With the both of them joining hands, an ordinary peak Dou Zun would really be no match for them. However, hee hee, they have unfortunately met this elderly-self…” Ren He Zi laughed in a strange manner. The lewd smile on his face became even denser, but he was just about to attack when his expression suddenly changed. A terrifying energy ripple that caused a fear to appear in his heart suddenly unfurled from the distance.</p><br/><p>A shock flashed across Ren He Zi’s eyes when he sensed this energy ripple that could destroy everything. He hurriedly raised his head and saw five clusters of flame suspended in front of the black-clothed young man on the mountain top. Other than the last type of flame, the remaining four types of flames caused his expression to drastically change.</p><br/><p>“Four types of Heavenly Flames?”</p><br/><p>Xiao Yan saw the drastic change on Ren He Zi’s face, but his expression did not change. A dense cold smile was lifted on the corner of his mouth. This was the first time he had added the “Life Transforming Flame” after having refined the Bone Chilling Flame…</p><br/><p>Four types of Heavenly Flame and one fake Heavenly Flame!</p><br/><p>It was a five-colored Angry Buddha Lotus Flame that Xiao Yan had never used before!</p><br/>\n</div>"}