{"title": "Chapter 1399: Four And Half Coloured Angry Buddha Lotus Flame", "id": 1399, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1399-four-and-half-coloured-angry-buddha-lotus-flame", "volume_title": "Volume 14", "body": "<h1>Chapter 1399: Four And Half Coloured Angry Buddha Lotus Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1399: Four And Half Coloured Angry Buddha Lotus Flame</u></strong></p><br/><p>“This brat is really mysterious. He only possesses the strength of someone at the peak of an eight star Dou Zun, yet he is able to unleash such a frightening strength!”</p><br/><p>Ren He Zi’s expression was volatile as he stared at the flames churning in Xiao Yan’s hands, and a great wave rose within his heart. However, this shock quickly turned into a dark ruthlessness. He suddenly threw a punch and the space in front of him emitted a crashing sound as it burst apart. A dozens-of-foot-large dark-black spatial line appeared. That spatial crack became a black ruthless poisonous snake that rushed toward Xiao Yan with lightning-like speed.</p><br/><p>“Bang!”</p><br/><p>An enormous spatial crack quickly spread across the sky, but it was still a couple hundred feet away from Xiao Yan when a couple of colorful thunderbolts suddenly smashed down from the sky. They ruthlessly struck the spreading crack, causing the spatial crack to pause momentarily before it quickly exploded apart.</p><br/><p>The expression in Ren He Zi’s eyes sank when his attack was blocked. He lifted his eyes to look at the enormous Seven-Colored Heaven Swallowing Python in the sky and strangely laughed, “Beauty, since you insist on intervening, the old me shall finish off the both of you first!”</p><br/><p>Ren He Zi’s body flashed after he uttered those words. He immediately turned into a ray of light that shot toward the Seven-Colored Heaven Swallowing Python in the sky. A punch was immediately thrown ruthlessly forward, and a low and deep sonic boom was formed as it whizzed toward the Cai Lin.</p><br/><p>“Chi!”</p><br/><p>Cai Lin’s thousand-foot-long tail was suddenly swung when she saw Ren He Zi’s attack. The frightening strength caused space itself to tear apart. It ruthlessly collided with the powerful palm wind, and a frightening storm swept across the sky. The Seven-Colored Heaven Swallowing Python, which Cai Lin had turned into, was forced back thousands of feet.</p><br/><p>“Hee hee, beauty, you are no match for this elderly-self!”</p><br/><p>Ren He Zi lewdly laughed after forcing back Cai Lin with a punch. He was just about to turn around when many sharp rushing wind sounds appeared beside his ear, and Dou Qi pillars with lethal poisons trickily pierced toward a couple of fatal spots on his body.</p><br/><p>Ren He Zi frowned when he sensed this attack. His feet stepped on empty air and the space behind him distorted into something like a metal wall. The Dou Qi pillars collided with it and emitted clear ‘clang’ sounds.</p><br/><p>“Two beauties, why do you need to fight all out for this brat? The both of you will definitely enjoy yourselves by following the old me…” Ren He Zi’s laughed, but before he could finish speaking, he saw Xiao Yan press the five types of flames together in the distance. His face involuntarily twitched.</p><br/><p>“This madman. He is actually merging the Heavenly Flames…”</p><br/><p>The look in Ren He Zi’s eyes was altered. Although he didn’t know why this brat was doing something so crazy, his instincts told him that he would end up dying if he allowed this brat to continue. He immediately rotated his body and ceased bothering with Cai Lin and the Little Fairy Doctor. He turned into a ray of light that shot toward Xiao Yan.</p><br/><p>“Xiao Yan, be careful!”</p><br/><p>The Little Fairy Doctor hurriedly issued a reminder when she saw Ren He Zi move. She also hurriedly moved her body and followed.</p><br/><p>Xiao Yan lifted his head when he sensed the intense sound of rushing wind bull toward him. Xiao Yan looked at Ren He Zi’s dense dark face as he headed his way. A cold laugh sounded from Ren He Zi. Green-red bone wings spread swiftly behind Xiao Yan and a silver glow flashed under his feet. His body appeared a thousand feet away, causing Ren He Zi to miss.</p><br/><p>“What frightening speed!”</p><br/><p>Ren He Zi felt shock materialize in his heart when he saw Xiao Yan dodge him in such a relaxed manner. Before he could continue chasing Xiao Yan, two extremely ferocious attacks were launched from behind him. Those attacks came from Cai Lin and the Little Fairy Doctor, who had followed him over.</p><br/><p>Ren He Zi did not dare to allow these two, who had joined hands, to randomly attack him. He had no choice but to turn around. Dou Qi surged out from his body as he ruthlessly collided with the two attacks behind him.</p><br/><p>“Bang!”</p><br/><p>The three of them engaged in an intense battle. Thunder-like explosions resounded across the sky as wave after wave of frightening force spread like floodwater. They shook the sky until space became distorted.</p><br/><p>“Moan!”</p><br/><p>Cao Lin and the Little Fairy Doctor emitted a groan from their mouths when they violently collided with Ren He Zi. Their bodies were forced back. Although their bodies’ constitutions were different from others, there was too wide a gap between Ren He Zi and them. It was difficult for them to win even if they joined hands.</p><br/><p>Although they did not possess the strength to be victorious, the two of them continued to persevere. They completely ignored the injuries that had appeared in their bodies from the counterattack. Their bodies had just stabilized when many lightning-like attacks continued to strike Ren He Zi. They caused Ren He Zi to react with chaotic responses.</p><br/><p>While their battle had become extremely heated, Tian He Zi’s and Di He Zi’s faces had become a little pale as they fought Yao Lao. The two of them together were no match for Yao Lao. If they weren’t great at cooperating, their defenses would have long since been breached. Even though this was the case, it was obvious that they were unable to endure for long.</p><br/><p>“Third brother, what are you doing? Why are you still showing mercy to ladies at this moment? Are you seeking death?”</p><br/><p>Tian He Zi and his brother turned paler after they were ruthlessly forced back by Yao Lao once again. Their eyes glanced into the distance as they involuntarily cried out. None of them had expected Ren He Zi to be held back by two ladies whose strength did not exceed that of an eight star Dou Zun.</p><br/><p>The pressure around Tian He Zi and his brother suddenly increased after their furious voices sounded. A thousand-feet-large flame fist fell from the sky and ruthlessly smashed into them. Although they had Dou Qi protecting them, that frightening wind still struck the both of them until they spat out a mouthful of fresh blood and flew backwards.</p><br/><p>“This is bad, big brother’s group cannot endure any longer…”</p><br/><p>Ren He Zi’s heart sank when he saw Tian He Zi and his brother spit out blood and withdraw. “Since I am unable to capture that brat, I shall capture a beauty as a hostage. Otherwise, we will be finished today!”</p><br/><p>This thought lingered within Ren He Zi’s heart. He gave up on capturing Xiao Yan as his palm shattered an enormous colorful thunderbolt. After which, his large hand suddenly grabbed at the Little Fairy Doctor. The space around her instantly stilled.</p><br/><p>“Bang!”</p><br/><p>The Little Fairy Doctor’s expression changed when she sensed space still around her. Dou Qi surged from her body, causing the solid space around her to tremble, but she was not able to break free.</p><br/><p>“Tsk tsk, beauty, the old me shall bring you with me this time around!”</p><br/><p>Ren He Zi’s figure flashed away while the Little Fairy Doctor was attempting to shatter the distorted space and retreat. He appeared in front of the Little Fairy Doctor and gave her a lewd smile. His large hand reached toward her.</p><br/><p>“Woo!”</p><br/><p>Cai Lin in the sky felt her heart sink when she saw this person give up on targeting Xiao Yan. Instead, he had decided to capture the Little Fairy Doctor. She hurriedly activated the thunderbolt strength within the dark clouds and shot them toward Ren He Zi from all directions. Ren He Zi merely clenched his hand when these attacks came down, and they were completely shattered by a distortion in space.</p><br/><p>“Beauty, you are mine!”</p><br/><p>Ren He Zi let out a strange laugh after shattering all the thunderbolts. His eyes were extremely heated as he looked at the expression on the Little Fairy Doctor’s face. His hand was about to grab her shoulder.</p><br/><p>“It is too early for you to be happy!”</p><br/><p>As Ren He Zi’s large hand was about to grab the Little Fairy Doctor, a cold laugh suddenly reverberated behind him. The Ren He Zi’s face changed when he heard this voice. He suddenly turned around and his eyes shrank. A exquisite basin-sized five-colored fire lotus cut through the air and rushed his way.</p><br/><p>This fire lotus contained five colors and fire seedlings continued to rise around it. A frightening extermination force emanated from it. Even Ren He Zi felt his limbs become ice-cold because of this annihilation force. Such a might was comparable to some Tian class middle level Dou Skills!</p><br/><p>“Thick Earth Bell!”</p><br/><p>Ren He Zi’s limbs might have been icy-cold, but he did not lose his reasoning. His hand seals rapidly changed as Dou Qi surged from his body in all directions and an enormous bell quickly appeared. His body quickly hid within it.</p><br/><p>“Sizzle!”</p><br/><p>An enormous snake tail rushed down from the sky when Ren He Zi used his defensive Dou Skill. It swiftly wrapped around the Little Fairy Doctor and pulled her away.</p><br/><p>“If you wish to find a beauty, you can go and find one in hell!”</p><br/><p>Xiao Yan’s expression was dark and cold as he glanced at Ren He Zi in the large bell. Ren He Zi’s eyes had revealed a panic. A cold smile was lifted on the corner of Xiao Yan’s mouth as the bone wings on his back were flapped. His body withdrew with lightning-like speed. At the same time, the seal formed by his hands changed.</p><br/><p>“Explode!”</p><br/><p>After this word was spat out from Xiao Yan’s mouth, the five-colored fire lotus suddenly paused next to the bell shape. It subsequently exploded in front of Ren He Zi’s shocked eyes.</p><br/><p>“Bang!”</p><br/><p>The entire place trembled because of this explosion. All the mountains within a ten-thousand-foot-radius emitted a ‘boom’ as they were blasted into dust. In an instant, the mountain range had turned into a desert. Sand and rocks flew while smoke permeated the air…</p><br/><p>A five-colored fire lotus, no… this could only be described as a four-and-a-half-colored Angry Buddha Lotus Flame, was this terrifying!</p><br/><p>Forget about Ren He Zi. Under this frightening explosion, even an expert with Tian He Zi’s strength would be turned into nothing in an instant!</p><br/>\n</div>"}