{"title": "Chapter 1394: Ancient Hall", "id": 1394, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1394-ancient-hall", "volume_title": "Volume 14", "body": "<h1>Chapter 1394: Ancient Hall</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1394: Ancient Hall</u></strong></p><br/><p>Space Town was not very large. It was only comprised of a couple of intersecting ancient streets, and there were many people in this small town. Moreover, all of them were extremely powerful individuals. They were all top tier experts in the outside world while they were simply common and ordinary here.</p><br/><p>Xiao Yan and the two others followed Yao Lao as they wandered across a couple of ancient streets. They did not stop along the way because of the dazzling items on both sides. They hurried to their destination before finally stopping at the end of a street.</p><br/><p>Their destination was on the edge of Space Town. The surroundings had become quite empty, and it was no longer as noisy as before. An ancient building stood at this spot as an extremely old feeling spread from it. It was as though it had been standing there forever, causing one to be afraid of slighting it.</p><br/><p>There were two expressionless old men in gray robes standing outside of the building. The two of them stood without moving, appearing just like statues. However, there was still a powerful Dou Qi fluctuation vaguely spreading around their bodies, causing one’s heart to feel awed. Just these two door guards alone had reached the level of six star Dou Zuns. An expert of such a level would be be treated as a VIP even in the Profound Sky Sect or the current Falling Star Pavilion.</p><br/><p>From this, one could tell the high standards of this spatial trade fair!</p><br/><p>“This Ancient Treasure Pavilion is not a place that anyone can just enter. One must obtain an invitation from the three Great Sects in order to enter… obtaining this invitation is not as easy as one might imagine.” Yao Lao smiled. Unless one was an expert or faction that was worthy of being trusted by the three Great Sects organizing the spatial trade fair, one would not be able to obtain this invitation. Yao Lao could be considered an old patron. Naturally, it was not too difficult for him to obtain an invitation.</p><br/><p>Xiao Yan’s trio nodded slightly. Not just anyone could come here.</p><br/><p>Yao Lao walked toward the door after his words sounded. He flicked his finger and a red glow shot out of his sleeve and headed toward the two old men. One of the old men grabbed it, and the red glow turned into a bright-red invitation card.</p><br/><p>“Welcome…”</p><br/><p>The expressionless old men revealed a change when they received the red light. Their turbid eyes glanced at Yao Lao’s group before bowing. One of them waved his sleeve and four black lights shot toward Xiao Yan’s group. After which, the light remained suspended in front of them. The lights were surprisingly dark-black Doupengs.</p><br/><p>“Most who enter this place hide their identities. After all, one does not display one’s wealth. These Doupengs are specially made by the three Great Sect. It can prevent others from probing…” Yao Lao smiled as he explained. He immediately put on the Doupeng, which hid his entire body. Xiao Yan’s group also put them on.</p><br/><p>“Let’s go…” Yao Lao smiled. After which, he led the way into the pavilion that was filled with an ancient aura. Xiao Yan’s group followed close behind. Xiao Yan’s eyes swept around when their footsteps entered this ancient pavilion. The building was dimly lit and appeared ordinary. There was nothing special to it nor was there any feeling of treasure.</p><br/><p>“Four guests, please follow me…”</p><br/><p>A gray-robed old man quickly walked over while Xiao Yan was observing his surroundings. He softly informed them before walking to the deepest part of the dim building. Yao Lao did not say anything as he followed. He was very familiar with his surroundings. The trio behind him quickly followed.</p><br/><p>The group walked through some corridors of the building for a couple of minutes. Finally, they stopped in front of a large bronze door. That old man also paused his footsteps and cupped his hands to Yao Lao. He did not say anything unnecessary as he quietly left.</p><br/><p>“This is our destination…”</p><br/><p>Yao Lao softly stated. After which, he slowly pushed open the ancient bronze door. A faint light shot out from within, but Yao Lao did not dodge it. Instead, he took a step and walked in.</p><br/><p>Xiao Yan’s trio followed him through the bronze door. Xiao Yan’s eyes were narrowed, and after the intense light disappeared, an ancient hall that was half the size of a stadium appeared in front of their eyes. The interior of the ancient hall was filled with many stone chairs. At this moment, many figures were already seated, and these people’s faces were also hidden by a black Doupeng like Xiao Yan’s group. No one could tell the other party’s identity.</p><br/><p>The entrance of Xiao Yan’s group attracted some scanning eyes, but these eyes quickly shifted away. Xiao Yan still sensed some eyes secretly scanning over them. It seemed that they were planning to discover their identities through an opening.</p><br/><p>Yao Lao did not respond to these inquisitive gazes. He walked to a slightly more deserted spot and sat in a chair. He waved his sleeve and the surrounding space became distorted.</p><br/><p>“There are many experts present. We must be careful. Otherwise, our conversations can be discovered by them…” Yao Lao faintly explained.</p><br/><p>Xiao Yan nodded when he heard this. His eyes swept around him. He discovered quite a number of spatial traces in some other spots. Clearly, the others present were quite cautious.</p><br/><p>“Let’s quietly wait first. The transactions in this place will likely begin very soon…” Yao Lao softly spoke before becoming quiet. Xiao Yan could sense that Yao Lao seemed to be slowly scanning the hall at this moment. It seemed that he wanted to discover these people’s backgrounds.</p><br/><p>Xiao Yan was naturally unable to help Yao Lao much when it came to such probing. With his eighth star Dou Zun strength, he might be considered extremely strong in the outside world, but there was at least ten people in this room that could surpass him. Plus he was naturally too lazy to scan the room. Otherwise, he might end up attracting some unnecessary trouble.</p><br/><p>While Yao Lao probed, the rest remained silent as two hours quietly passed. Some figures wearing black Doupengs entered the hall during these two hours. A rough glance revealed that there were over a hundred people present.</p><br/><p>“Hu…”</p><br/><p>Yao Lao by the side softly sighed while Xiao Yan was waiting with boredom. Only then did Xiao Yan turn his head and softly inquire, “Have you managed to find anything?”</p><br/><p>“Ha ha, there have been some gains. It seems that some familiar people have come…” Yao Lao smiled, but he did not reveal who these familiar people were, so Xiao Yan could only helplessly shake his head.</p><br/><p>“Clang!”</p><br/><p>A clear gong sound suddenly appeared in this quiet ancient hall while Xiao Yan was feeling helpless, and a white-haired white-bearded old man, who looked like a dying man, slowly appeared in front of everyone’s eyes from distorted space.</p><br/><p>Xiao Yan knit his brows under the Doupeng when he discovered the white-haired old man. Based on his senses, this half-dead old man was quite frightening. The strange fluctuation that only an elite Dou Sheng possessed vaguely appeared around him.</p><br/><p>“Nine Change Peak Dou Zun, huh…”</p><br/><p>Xiao Yan muttered to himself. This white-haired old man likely had half a foot in the Ban Sheng class. If the Dou Qi within his body were suppressed once more, it would undergo a transformation that would allow him to advance to a Ban Sheng!</p><br/><p>“This is the mountain chief of the Reflecting Treasure Mountain, old man Bao Shan. He has seen an unimaginable number of treasures in his lifetime and has extremely sharp eyes. When I first met him back then, he was already a renowned expert across the Central Plains. The current him has already become a Nine Change Peak Dou Zun. He is only a short distance from a Ban Sheng…” Yao Lao soft voice was transmitted into the ears of Xiao Yan’s trio.</p><br/><p>“Nine Change Peak Dou Zun.”</p><br/><p>Cai Lin and the Little Fairy Doctor revealed grave expressions on their faces when they heard these words, especially Cai Lin. Her heart was a little shaken. The Central Plains were indeed worthy of being the area with the highest standard in the Dou Qi continent. If such an expert came to the north-western part of the continent, that expert would definitely be at the top, but he had appeared to host the trade fair. Of course, this was not an ordinary trade fair.</p><br/><p>“Ha ha, it is another spatial trade fair. How is everyone doing…” That old man Bao Shan swept his eyes over the large hall. His elderly voice echoed beside everyone’s ears, but no one present responded to his greeting. The atmosphere of the hall was still strangely quiet.</p><br/><p>Old man Bao Shan was also unconcerned with this response. It was not the first time he had experienced this. He waved his sleeve and the space around him slowly became distorted. It seemed like a spatial prison had surrounded old man Bao Shan.</p><br/><p>“The old rules still apply. Everyone should not mind it too much…”</p><br/><p>Old man Bao Shan smiled after doing this. After which, he stood on the auction stage in front, let out a cough, and said, “Almost everyone is here. In that case, I shall not say anything unnecessary. Let’s begin this trade fair…”</p><br/><p>After the final sentence of old man Bao Shan sounded, all the gazes within the large hall immediately gathered on him. There was some anticipation and excitement vaguely present. Everyone knew that the things offered at this trade fair were not ordinary!</p><br/>\n</div>"}