{"title": "Chapter 1391: Returning to the Falling Star Pavilion", "id": 1391, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1391-returning-to-the-falling-star-pavilion", "volume_title": "Volume 14", "body": "<h1>Chapter 1391: Returning to the Falling Star Pavilion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1391: Returning to the Falling Star Pavilion</u></strong></p><br/><p>The wormhole that was connected to the Falling Star Pavilion was located in the deepest part of the Yan Alliance, protected by an extremely tight defense. Xiao Yan did not make this wormhole known to the public. Although the fees collected from those using the wormhole would be quite a fat sum, Xiao Yan felt that it was better to keep a low profile when it came to such things. Otherwise, it might stir some unnecessary trouble since there was only one wormhole that lead to the Central Plains from deep within the north-western part of the continent. It would cause many to feel jealous if word were to spread.</p><br/><p>A dark-black wormhole was suspended in the air within an incomparably large hall. It was slowly rotating while waves of shocking spatial fluctuations were emitted from the wormhole.</p><br/><p>“Is this a wormhole…”</p><br/><p>The eyes of Cai Lin’s group were a little stunned and curious as they observed this wormhole. This was their first time seeing a wormhole. Such a thing was rarely seen in a place like the north-western region of the continent.</p><br/><p>Xiao Yan smiled and nodded. Standing beside him was the Little Fairy Doctor, Tianhuo zun-zhe, and Qing Lin. Those experts who had been invited had already returned to the Central Plains soon after resolving the trouble from the Profound Lion Sect.</p><br/><p>“Big brother, second brother, we will be leaving. If anything happens in the future, you can send someone to the Falling Star Pavilion. There will be someone there to receive you…” Xiao Yan turned his head, looked at Xiao Ding and Xiao Li before he spoke with a smile.</p><br/><p>The Xiao duo nodded when they heard this information. “Understood. Take care.”</p><br/><p>Xiao Yan smiled, but he did not say anything unnecessary. He cupped his hands to everyone present and then took the lead to step into the wormhole. He immediately disappeared. Cai Lin, who was carrying Xiao Xiao, swiftly followed behind him as did the Little Fairy Doctor’s group.</p><br/><p>Xiao Ding and Xiao Li softly sighed with a sense of loss as they watched Xiao Yan’s group disappear within the wormhole. They remained a little longer before leading their people away.</p><br/><p>The Inner Hall of the Falling Star Pavilion—</p><br/><p>“This is… your daughter?”</p><br/><p>Yao Lao was studying the white-clothed little girl. She was hugging Xiao Yan’s thigh and using her large dark-black eyes to stare at him. His elderly face was covered with a stunned expression.</p><br/><p>Xiao Yan involuntarily smiled and nodded when he saw the way Yao Lao acted. He was aware that Yao Lao had been captured by the Hall of Souls when Cai Lin was suspected of being pregnant. Therefore, he was unaware of this situation, so Xiao Yan briefly explained what had occurred back then.</p><br/><p>“Hee, how unexpected, how really unexpected…”</p><br/><p>Even with Yao Lao’s usual unperturbed temperament, he still involuntarily shook his head after hearing Xiao Yan’s story. His eyes swept over Cai Lin as he teased, “Back then, this wife of yours really hated you. If not for the old me, I’m afraid that you would have been killed by her…”</p><br/><p>Cai Lin’s cold face turned a little red when she heard Yao Lao’s words. Back then, she had quietly exchanged blows with Yao Lao many times. However, she had not expected the old man from back then, who had appeared only a little stronger than her, to actually be so strong.</p><br/><p>“Xiao Xiao, quickly greet grand-teacher.” Cai Lin gently patted Xiao Xiao’s little head and softly told her what to do.</p><br/><p>Hearing this, Xiao Xiao blinked her large black eyes. She glanced at Xiao Yan somewhat hesitantly. Only after seeing him smile and nod her head, she timidly called out, “Grand-teacher…”</p><br/><p>“Ah…”</p><br/><p>A joyous smile emitted from Yao Lao’s heart surfaced on his face after he heard Xiao Xiao’s soft voice. He did not have any children but regarded Xia Yan as his own son. From his perspective, Xiao Yan’s daughter was just like his very own granddaughter. Regardless of how strong an old man at his age was, their hearts would ultimately feel a gentleness for little children.</p><br/><p>Yao Lao walked forward. The corner of his eyes contained a smile as he touched Xiao Xiao with a face full of love. After which, his shriveled hand squeezed Xiao Xiao’s little hand. A joy surfaced in his eyes a moment later as he said, “What a powerful Spiritual Strength. She is also of the fire affinity and her body similarly possesses a trace of wood. It not out of the realm of possibility for her to be an alchemist…”</p><br/><p>Xiao Yan smiled when he heard Yao Lao’s exclamation. He had already sensed that Xiao Xiao could be an alchemist with her constitution. Her current abilities were much better than his back then. If she was properly groomed, her future potential would be extraordinary.</p><br/><p>“Her Spiritual Strength is even stronger than when I discovered you back then. Moreover, her constitution is many times greater than yours. If she is properly groomed, her future achievements will be even greater than yours, her father’s…” Yao Lao’ had an excited glint in his eyes. This kind of glint was something that Xiao Yan had seen when he had met Yao Lao for the first time.</p><br/><p>Xiao Yan smiled when he heard Yao Lao’s evaluation. Talent and constitution might be important, but one’s future achievements were determined by one’s perseverance. The reason that Xiao Yan was able to reach this stage today was not because he had relied on his talent. Instead, he had achieved breakthroughs from lingering between life and death during one bloody battle after another…</p><br/><p>A true expert did not rely on talent but on great perseverance!</p><br/><p>Yao Lao’s hand continued to pinch Xiao Xiao’s bones. His hands used a little more force, causing Xiao Xiao’s little mouth to pout. She continued grumble, causing everyone to laugh.</p><br/><p>“Why doesn’t the old me teach the little Xiao Xiao in the future?”</p><br/><p>Yao Lao finally lifted his head after pinching her for a long while. His eyes looked at Xiao Yan as he asked without any hesitation. Even he wasn’t able to restrain himself when faced with Xiao Xiao, who was like perfect raw jade.</p><br/><p>Xiao Yan smiled and nodded when he Yao Lao’s suggestion. He had brought Xiao Xiao back to the Falling Star Pavilion to be trained by him No one among those he was acquainted with could surpass Yao Lao’s medicinal refinement skills. It was naturally best for him to personally groom Xiao Xiao.</p><br/><p>Xiao Yan also understood in his heart that Xiao Xiao’s talent might be extremely attractive, but her talent wouldn’t be enough to cause an expert like Yao Lao to feel anxious. Yao Lao truly regarded Xiao Xiao as his granddaughter and wished she would grow up perfect. This caused Xiao Yan to feel a little moved in his heart.</p><br/><p>“This child has been traveling with you through the wormhole for a couple of days. Let her properly rest first…” Yao Lao lovingly patted Xiao Xiao’s head and handed her back to Cai Lin with some unwillingness. Subsequently, he instructed someone to help Cai Lin and her daughter settle down.</p><br/><p>“In that case, the both of you should continue chatting.”</p><br/><p>Cai Lin was someone who was mindful of others. She was aware that this teacher and disciple needed to speak about something. Hence, she softly spoke to Xiao Yan before leaving slowly with Xiao Xiao.</p><br/><p>Yao Lao withdrew his eyes only after seeing Cai Lin take Xiao Xiao away. He smiled and said, “Little fellow, you have helped give birth to a good daughter… however, you being together with Medusa has exceeded my expectation.”</p><br/><p>Xiao Yan spread his hands. The relationship between him and Cai Lin was quite complicated. Who would have imagined that Queen Medusa, who had been chasing Xiao Yan with a murderous intent for many years, would actually become his wife?</p><br/><p>“I have also heard about the matter this time around. Being able to dispatch two Tianzuns is sufficient to show that the Hall of Souls is not fooling around. However, they suffered a great loss this time. The ninth Tianzun was killed on the spot by you, and that fourth Tianzun was beaten half to death before fleeing…” Yao Lao fondled his beard and laughed.</p><br/><p>“Honestly speaking, I do not know what the Hall of Souls is planning to do. This clan has always been mysterious and unfathomable. They definitely carrying out a scheme from the way they are gathering souls… moreover, from the recent increase of soul gathering, this scheme is likely progressing very quickly. Based on the information that I have obtained, it seems that some big wars have erupted in other parts of the continent outside the Central Plains. The Hall of Souls is likely involved in these wars…” Yao Lao mused.</p><br/><p>“Oh? Wars has erupted across other parts of the continent?” Xiao Yan’s expression changed upon hearing this. He felt a little uneasy. Just what were these fellows from the Hall of Souls planning?</p><br/><p>“Aye.” Yao Lao’s nodded with a solemn expression. He softly sighed a moment later and changed the topic of conversation. “There is still half a month left before the spatial trade fair begins. We should also properly prepare during this period of time. Those who are able to participate in the spatial trade fair are all top experts and powerful factions. The Purifying Demonic Lotus Flame is too attractive. Since we have been able to obtain news about it, other factions will also be aware of it. Hence, we will definitely have to pay a great price in order to compete for the final map fragment.”</p><br/><p>Xiao Yan nodded. The Purifying Demonic Lotus Flame was ranked third on the Heavenly Flame Ranking. This rank alone indicated its great strength. Its allure was naturally something that need not be mentioned. Even though it was just a map fragment, its value would be quite frightening. It would not be easy to successfully obtain it from the many competitors.</p><br/><p>“Regardless of what happens, we need to obtain the Purifying Demonic Lotus Flame. There are four map fragments. Three of them are in your hands. We must obtain the last piece no matter what.” Yao Lao remarked. The Heavenly Flames in the top three spots of the Heavenly Flame Ranking possessed an extremely destructive force. These three types of Heavenly Flames were extremely rare in the world. Even after tens of thousands of years or even hundreds of thousands of years, it would be difficult to form another one. It was even rumored that the world did not dare create too many of the top three Heavenly Flames due to them being overly powerful. Only when one of the Heavenly Flames completely disappeared, would a second flame appear after tens of thousands of years…</p><br/><p>This divine thing was feared by the spirits of the world!</p><br/>\n</div>"}