{"title": "Chapter 1390: Before Departure", "id": 1390, "volume": 14, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1390-before-departure", "volume_title": "Volume 14", "body": "<h1>Chapter 1390: Before Departure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1390: Before Departure</u></strong></p><br/><p>After resolving the war with the Profound Lion Sect and the trouble within the Pill Hall, Xiao Yan relaxed during the period of time that followed. The Yan Alliance might be huge, but it had done well under the management of Cai Lin, Xiao Ding, and the others. They would naturally arrange everything after the big battle. There was no need for Xiao Yan to intervene. Thus, Xiao Yan was happy to have some time for leisure. He left little Xiao Xiao alone and properly enjoyed the feeling of being a father.</p><br/><p>During this period of time, Xiao Yan also used some of his free time to open the wormhole scroll that Yao Lao had given him. The Mysterious Yellow Fortress was not far from the Jia Ma Empire, and this place was an extremely important location. Hence, the wormhole that lead to the Falling Star Pavilion was connected to the Mysterious Yellow Fortress. Regardless of which side faced trouble in the future, one party would be able to reinforce the other with great speed.</p><br/><p>The establishment of the wormhole would undoubtedly allow the Yan Alliance’s hidden strength to soar. With the Falling Star Pavilion supporting it, a second faction would not be able to compete with the Yan Alliance in this north-western region. Dominating the north-western part of the continent was only a matter of time.</p><br/><p>During this period of time, Xiao Yan also obtained some of the information regarding the development of the Yan Alliance. The thing that caused Xiao Yan to be surprised was that Xiao’s Gate—the faction his second brother, Xiao Li, had established in the Black-Corner Region—had also joined the Yan Alliance a couple of years ago. It was also a location that the Yan Alliance could expand to in the future. With the support of the Yan Alliance and ‘Pan’s Gate,’ which Xiao Yan had founded in the Inner Academy, the development of Xiao’s Gate was also quite impressive. It had vaguely become a great existence within the Black-Corner Region.</p><br/><p>Once the time was ripe in the future, the many factions that were owned by Xiao Yan, like the Yan Alliance, Xiao’s Gate, and the Falling Star Pavilion, would completely merge. It would become a powerful faction that spread over three large regions of the Dou Qi continent. Its potential was indeed limitless…</p><br/><p>The three Xiao brothers had gathered within a quiet courtyard deep within the Yan Alliance. Cai Lin was playing with Xiao Xiao a short distance away. The crisp laughter of the little girl unceasingly appeared within the courtyard, filling it with liveliness. It had been many years since Xiao Yan had enjoyed such a peaceful time.</p><br/><p>Xiao Yan involuntarily smiled when he saw the enchanting expression that surfaced on Cai Lin’s cold face while she played with Xiao Xiao. As long as she was in front of Xiao Xiao, the deputy chief of the Yan Alliance, who appeared icy-cold in the eyes of others, seemed to undergo a transformation into a great beauty filled with a mother’s love. Her warmth caused the heart of anyone looking at her to quiver.</p><br/><p>During this period of time, Xiao Yan and Cai Lin had also held a simple Xiao clan wedding conducted by Xiao Li and Xiao Ding. This wedding was not grand since only Xiao Ding and Xiao Li attended it. No great fanfare was held either, but it was said that an elder brother was like one’s father. It could be considered a serious ceremony with Xiao Ding and Xiao Li present.</p><br/><p>Regardless of what the case was, the things that Cai Lin had done for the Xiao clan and the Yan Alliance were enough to make Xiao Yan feel guilty. He need to give her this status.</p><br/><p>Xiao Ding and Xiao Li heard of Xiao Yan’s the various experiences over these years as they sat within the courtyard. The were involuntarily shaken by the many narrow misses. Their lives during these years had not been relaxing because of the Yan Alliance, but Xiao Yan had frequently charged through danger, and things had been quite difficult for him during these years.</p><br/><p>The both of them softly sighed when they thought about this. They studied the side of the mature and firm face of the young man in front of them. The burdens of the entire Xiao clan weighed down on him. Anyone else would already have collapsed from the pressure, but Xiao Yan had done his best to become stronger for the Xiao clan and to rescue their father...</p><br/><p>“Third brother, it has been tough on you these years…”</p><br/><p>Xiao Yan was startled when he heard his big brother Xiao Ding’s abrupt words. He softly replied, “What is this little hardship if it will allow our family to reunite? Big brother and second brother are even willing to sacrifice their lives for me. I would be too inhumane if I did not work hard to improve…”</p><br/><p>The three brothers exchanged glances after hearing Xiao Yan’s words. They smiled with a common understanding. There was no need to say anything else to someone with a blood relation, which was closer than anything.</p><br/><p>Cai Lin some distance away revealed a faint grin on her face when she saw the three smiling brothers. This feeling of having a family caused her heart to feel extremely comfortable. The effort she had put in these years was worthwhile.</p><br/><p>“It is unexpected that our Xiao clan possesses such a history…”</p><br/><p>Surprise surfaced on Xiao Ding and Xiao Li’s faces when they heard Xiao Yan describe the matters related to the Xiao clan in detail within the courtyard. They had not expected their Xiao clan, who only had a small reputation in Wu Tan City, to actually be from that Xiao clan. The Xiao clan from the eight ancient clans renowned throughout the Dou Qi continent.</p><br/><p>“However, our Xiao clan’s bloodline strength has been exhausted. The final amount of it has been passed to me by ancestor Xiao Xuan…” Xiao Yan softly sighed. His body shrank in the spacious chair as he said, “The reason that the Xiao clan has attracted the probing of a large faction like the Hall of Souls is precisely because this Xiao family was once that Xiao clan.”</p><br/><p>“However, you said that the bloodline strength of the Xiao clan has been exhausted. Why would the Hall of Souls attack us? Based on the information that I have obtained, it seems that the Hall of Souls plans to capture everyone with the blood of our Xiao clan?” Xiao Ding knit his brows and voiced his thoughts.</p><br/><p>Xiao Yan’s finger gently tapped on the armrest of the chair. There was some doubt between his brows. Just what were those people from the Hall of Souls planning to do? The bodies of the current members of the Xiao clan no longer possessed even the least bit of bloodline strength. What was the point of capturing them? Could it be that they were planning to use these people as hostage to get him to hand over the Tou She Ancient God Jade? However, just his father as hostage was enough. Capturing the others was unnecessary.</p><br/><p>“I wonder what those people from the Hall of Souls are up to…” Xiao Yan shook his head, but his heart became a little more cautious. The Hall of Souls usually did not do anything that was meaningless. Since they were interested in the Xiao clan, they definitely had a motive.</p><br/><p>“Relax, the current Xiao clan is gradually developing. Its members have been scattered by us in the Yan Alliance. It is impossible for the Hall of Souls to capture all of them. Once our faction becomes strong in the future, we will gather all the scattered clan members again...:” Xiao Ding faintly smiled and explained when he saw Xiao Yan frowning.</p><br/><p>Xiao Yan gently nodded. Big brother really had a way of doing things. After having experienced those matters from back then, he would naturally not let them easily occur again.</p><br/><p>“Second brother, this is a secret technique scroll. You can practice it as it instructs. You can also pass it to some outstanding clan members…” Xiao Yan mused for a moment before taking out the Skyfire Three Mysterious Change and handing it to Xiao Li. The Skyfire Three Mysterious Change had been created by ancestor Xiao Xuan. It used a special method to allow the clan members to practice and create a clan tattoo. Although his clan members no longer possessed any bloodline strength and were unable to unleash the full strength of the clan tattoo, it was still able to significantly increase one’s strength.</p><br/><p>The flames that were required to practice the Skyfire Three Mysterious Change did not necessarily need to be Heavenly Flames. They only needed to find some beast flames that were a little inferior.</p><br/><p>Xiao Li accepted the scroll that Xiao Yan handed him. He was aware that Xiao Yan did not possess any subpar things. Since Xiao Yan had said that it was useful, Xiao Li would naturally not doubt him.</p><br/><p>“The situation of the Yan Alliance has been settled. I will not intervene in the remaining matters. Therefore, I will be hurrying back to the Central Plains in two days…” Xiao Yan voiced his thoughts after seeing Xiao Li accept the scroll.</p><br/><p>“So soon?” Xiao Ding and Xiao Li spoke somewhat unwillingly when they heard his words.</p><br/><p>“Ha ha, the wormhole between the Yan Alliance and the Falling Star Pavilion has been built. One will not need to take too much time to travel between those two places. The both of you can head over and take a look if you have the time. I will inform the Falling Star Pavilion.” Xiao Yan smiled as he spoke to them. After counting the days, the so-called spatial trade fair was about to begin. He needed to hurry back as soon as possible. The Purifying Demonic Lotus Flame was far too important to him. If he were able to obtain it, he might be able to breakthrough the Dou Zun class. Only when one truly reached the Dou Sheng class would one have the qualification to fight with a faction like the Hall of Souls. Otherwise, Xiao Yan would not dare to head over and rescue his father.</p><br/><p>“You are leaving the day after tomorrow?” Cai Lin had also heard these words. She pulled Xiao Xiao over and asked.</p><br/><p>“Aye, this time around, you should also return with me to the Falling Star Pavilion to meet teacher…” Xiao Yan softly laughed. He regarded Yao Lao Like a father. Now that Cai Lin was his wife, she would naturally have to meet him.</p><br/><p>“That old... mister from back then?” Cai Lin rolled her eyes as she inquired. If she had not been afraid of Xiao Yan’s teacher, she, as the queen of the Snake-People tribe, would have killed Xiao Yan many times over.</p><br/><p>Xiao Yan nodded. He squatted down, patted Xiao Xiao’s head, and softly said, “Additionally, we will bring Xiao Xiao to the Falling Star Pavilion. It is the safest place I know of. Moreover, teacher can instruct her. The current her can already begin training…”</p><br/><p>An unwillingness flashed across Cai Lin’s eyes when she heard Xiao Yan’s words, but she still nodded in agreement. She was aware that Xiao Yan was doing this for Xiao Xiao’s sake.</p><br/><p>Xiao Yan slightly smiled after issuing his instructions. He lifted his head and looked in the direction of the wormhole. Purifying Demonic Lotus Flame, it had been over a decade. I am finally getting closer to you…</p><br/>\n</div>"}