{"title": "Chapter 1403: Practicing the King Kong Glass Body", "id": 1403, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1403-practicing-the-king-kong-glass-body", "volume_title": "Volume 15", "body": "<h1>Chapter 1403: Practicing the King Kong Glass Body</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1403: Practicing the King Kong Glass Body</u></strong></p><br/><p>Xiao Yan’s group did not continue to remain after making up their minds. They immediately moved and hurried back to the Falling Star Pavilion. After returning to the pavilion, the group rested for two days. Information related to the Bodhisattva Ancient Tree began to sweep across the Central Plains with a frightening storm-like speed during these two days.</p><br/><p>With the simple name, Bodhisattva Ancient Tree, the entire Central Plains had undoubtedly turned into a mess at this moment. Even the old demons who lived in seclusion had appeared because of this earth-shaking news.</p><br/><p>Although the Ancient Wasteland Region was quite dangerous, the danger merely existed because there was insufficient allure. This time around, the allure of the Bodhisattva Ancient Tree was something that no one could resist. Hence, this so-called forbidden ground no longer deterred anyone. The Dou Sheng class represented the peak level across the continent. A countless number of people had fought their entire lives in order to reach this legendary level. As long as there was even the slightest thing that could raise the chances of them reaching that level, everyone would pounce over without any hesitation.</p><br/><p>Even if they were moths pouncing into a flame, none of them would hesitate even a little!</p><br/><p>Clearly, the appearance of the Bodhisattva Ancient Tree stirred a great storm across the Central Plains!</p><br/><p>While various factions throughout the Central Plains were experiencing a great commotion, Xiao Yan, who had rested for two days, gradually recovered. However, he did not leave. Instead, he found a secluded chamber and undertook a retreat.</p><br/><p>After having heard Yao Lao’s words, Xiao Yan’s heart had honestly began to view the Purifying Demonic Lotus Flame seriously. He was clearly aware that Yao Lao would not lie to him, and Yao Lao’s experience was far from what he could compare with. Since Yao Lao had spoken such words, Yao Lao would definitely not allow him to touch the Purifying Demonic Lotus Flame unless he reached the Dou Sheng class. In that case, he could only start to concentrate on his next aim—the Bodhisattva Ancient Tree that was about to appear!</p><br/><p>If he wished to reach the Dou Sheng class within three years, he needed to borrow the strength of the Bodhisattva Heart. Otherwise, it was impossible to advance in time.</p><br/><p>Time was something that Xiao Yan was aware of after thinking about training in the Heavenly Tomb back then. The energy in that place was a couple of times denser than in the outside world. Xiao Yan might have trained three years within the Heavenly Tomb, but if he had not obtained the inheritance of his ancestor, Xiao Xuan, it probably would have been impossible to reach his current level and one would find it more difficult to train during the later stages of the Dou Zun class. He was currently only at the peak of an eight star Dou Zun. There was still the ninth star and the peak of the ninth star above him. After reaching the peak, he would still need to experience the nine changes in order to breakthrough to the Dou Sheng class!</p><br/><p>With this many steps, it was impossible for an ordinary person to finish the training within thirty years, much less in a mere three years.</p><br/><p>Even though Xiao Yan possessed an extremely great talent and had the aid of many medicinal pills, it was impossible for him to reduce this amount of time by ten times or more!</p><br/><p>Hence, he needed to take this opportunity to enter the Ancient Wasteland Region and obtain the Bodhisattva Heart.</p><br/><p>Only with the Bodhisattva Heart would his strength soar within three years and reach the Dou Sheng class. Otherwise, when the Purifying Demonic Lotus Flame appeared in three years time, he could only be an observer that watched this Heavenly Flame become someone else’s property.</p><br/><p>Xiao Yan was unable to endure such a thing. Hence, he had to obtain the Bodhisattva Heart!</p><br/><p>Moreover, the Bodhisattva Ancient Tree had clearly stirred the attention of many factions within the Central Plains. It was not as easy to successfully obtain the Bodhisattva Heart from the hands of these countless individuals. There would also be some like Tian He Zi or stronger old demons among them. Hence, Xiao Yan must try his best to increase his strength!</p><br/><p>The fastest way to increase one’s strength was undoubtedly to practice a high class Dou Skill. It was Xiao Yan’s intention to practice the ‘King Kong Glass Body,’ which he had just obtained, during this retreat.</p><br/><p>This thing was a Tian class Dou Skill and definitely possessed an extraordinary strength. If he could successfully practice it, he would be more confident during this trip to the Wasteland Region.</p><br/><p>The scent of sandalwood lingered within the quiet room. Xiao Yan sat on a stone bed. He clenched his hand and a dark-golden scroll appeared in it. He lifted the scroll, and he saw a couple of ancient words on the side.</p><br/><p>“King Kong Glass Body!”</p><br/><p>Xiao Yan gently exhaled and placed the scroll on his forehead. This Tian class Dou Skill was not as troublesome as the Great Heaven Creation Palm. One could just use one’s Spiritual Strength to obtain it. The reason that it was so troublesome last time was because that was the elite Dou Sheng’s intention.</p><br/><p>The scroll touched Xiao Yan’s brow while a thought passed through his heart and a golden light shot out of the scroll. An enormous amount of information surged into Xiao Yan’s mind like floodwater.</p><br/><p>“The King Kong Glass Body, Tian class low level Dou Skill turns one’s body into metal that nothing can pierce or destroy. When one fully masters this Dou Skill, one’s body turns into King Kong. Their body becomes ninety-nine feet in size, extremely strong, and a dazzling golden light appears. One’s fist will shatter the sky while one’s feet will crack the land!”</p><br/><p>After reading the large golden words that reverberated around his head, Xiao Yan was able to sense just how domineering this Dou Skill was. This was a Dou Skill that used Dou Qi to strengthen one’s physical body. Upon studying this Dou Skill’s method, he involuntarily let out a sigh of admiration. It was indeed a powerful Dou Skill that could only be created by an elite Dou Sheng.</p><br/><p>The current Xiao Yan could be considered to have extremely picky eyes. The Dou Skills that he had practiced included some Tian class Dou Skills, so his practice of this skill was quite smooth. It was said that all techniques would be clear after one mastered one technique. The various Dou Skills might have different training methods, but all of them ultimately shared the same root. Once one mastered this point, it was not difficult to learn other Dou Skills with the exception of some unique ones.</p><br/><p>In order to practice this ‘King Kong Glass Body,’ one needed to merge one’s Dou Qi with one’s bones, blood, and flesh using a unique method. The Dou Skill was harsh on one’s physical body. Fortunately, Xiao Yan’s physical body had undergone many refinements by various natural treasures. Although he did not dare to call his body undefeatable, it was at least able to withstand the harsh requirement needed to practice the ‘King Kong Glass Body.’</p><br/><p>“Hu…”</p><br/><p>Xiao Yan exhaled through his mouth. He slowly shut his eyes and began trying to practice this so-called ‘King Kong Glass Body’ according to the method recorded on the scroll.</p><br/><p>“Crack crack!”</p><br/><p>Soon after Xiao Yan shut his eyes, a golden light shot out of his body before it suddenly swelled a little. There was even a faint bone-cracking sound that appeared.</p><br/><p>This growth became faster as the golden light became denser. Within less than half a minute, Xiao Yan’s body had become twice its size. At a glance, he appeared like a small giant. Moreover, his originally pale skin had been dyed a dark-golden color.</p><br/><p>Xiao Yan’s body swelled to twice its size before it ceased becoming stronger. The golden light gradually dimmed and his body swiftly shrank. Within the blink of an eye, it had returned to its previous state.</p><br/><p>“Grug!”</p><br/><p>Xiao Yan suddenly opened his eyes after his body shrank back to its original size. A mouthful of bright-red blood was spat out, dying the ground red.</p><br/><p>The corner of Xiao Yan’s mouth twitched after spitting out a mouthful of fresh blood. His expression became quite ugly. This damn scroll did not mention that practicing this ‘King Kong Glass Body’ requires one to endure an intense pain… imagine a person’s body suddenly swelling a couple of times its size, just what would the body feel? Its skin would tear, its muscles would break, its bones would shatter…</p><br/><p>“No wonder there’s such a harsh requirement for one’s physical body. If it was someone with a weaker constitution, the first swell from earlier would have caused their body to burst apart…” Xiao Yan shook his head in a speechless manner. He quietly sighed. Regardless of how much pain he felt, he needed to practice it. It was impossible not to pay a price if one wished to obtain great strength…</p><br/><p>If Xiao Yan was able to endure this kind of intense pain, he would get used to such a transformation with his constitution. At that time, he would be able to truly unleash the might of the King Kong Glass Body, but he needed to continue swelling his body, allowing his skin, muscles, and bones to get used to this kind of intense pain…</p><br/><p>“Ugh, practicing this Dou Skill is a kind of torture…”</p><br/><p>Xiao Yan miserably sighed in his heart. He once again shut his eyes as a golden light shot out. His body swelled once again before shrinking. After which, it swelled and shrank again as fresh blood was spat time and time again. It was as though blood was free as he continued to spit it out of his mouth. Fortunately, the fresh blood that was spat out diminished with the flow of time…</p><br/><p>Half a month passed while Xiao Yan was undertaking a retreat…</p><br/><p>During this half a month, the Central Plains had descended into chaos. Countless factions had already dispatched their people to head near the Ancient Wasteland Region, but the main forces did not move because they were waiting for the accuracy of the information to be confirmed…</p><br/><p>Once the Bodhisattva Ancient Tree truly appeared, it would create an unusual phenomenon. At that moment, the entire Central Plains would be able to sense the change. Only when they truly sensed this kind of phenomenon would these factions, which were ready to move, truly become excited!</p><br/><p>Another five days slowly passed with this restlessness…</p><br/><p>When the first ray of morning light shot to the land on the sixth day, a clear aura suddenly began to sweep from the north-eastern sky across the Central Plains. It was like a wave that suddenly swept over the sky and scattered into the distance…</p><br/><p>Anyone who inhaled this clear air would have a similar image appear deep within their minds…</p><br/><p>It was that of an ancient towering tree. An intelligent aura spread from this ancient tree!</p><br/><p>This was the legendary Bodhisattva Ancient Tree!</p><br/><p>A commotion had finally broken out across the Central Plains at this moment!</p><br/>\n</div>"}