{"title": "Chapter 1412: Nine Star Dou Zun!", "id": 1412, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1412-nine-star-dou-zun", "volume_title": "Volume 15", "body": "<h1>Chapter 1412: Nine Star Dou Zun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1412: Nine Star Dou Zun!</u></strong></p><br/><p>Pain!</p><br/><p>A bone-deep intense pain!</p><br/><p>Pain was the only thing Xiao Yan felt after leaping into the Heaven Demon Blood Pool. The interior of the pool was filled with an extremely wild and violent energy. This energy appeared to have been stirred as it struck Xiao Yan’s body from all directions like countless poisonous snakes!</p><br/><p>The Ancient Heavenly Demon Python had thrown some unknown things into this blood pool, causing it to boast some extremely strong corrosive properties. Wisps of white smoke erupted the moment the tendrils came into contact with Xiao Yan’s skin, which resulted in an intense pain that drilled into one’s heart.</p><br/><p>“Hiss...”</p><br/><p>Xiao Yan inhaled a violent cool breath in his heart because of this intense pain. His hand seal subsequently changed and his Heavenly Flame erupted from his body. It turned into a circular flame barrier that covered him.</p><br/><p>“I do not believe that I am unable to deal with you, a mere Heaven Demon Blood Pool, since I was able to finish off your creator!”</p><br/><p>“Sizzle sizzle!”</p><br/><p>The wild and violent energy that had erupted immediately emitted a sizzling sound the moment the Heavenly Flame appeared. This energy was vaporized by the Heavenly Flame. The remaining energy gradually became gentle after being refined by the Heavenly Flame. It turned into unusually pure energy that seeped into Xiao Yan’s body.</p><br/><p>“Hu!”</p><br/><p>Xiao Yan only sighed in relief after sensing that the energy had become a little more gentle. The Heavenly Flame was only able to refine the corrosive properties that could harm him. The remaining energy was beneficial to Xiao Yan and would pour into his body after being refined.</p><br/><p>As wave after wave of gentle pure energy continued to surge into Xiao Yan’s body, he could feel these energy roaming around his skin, muscles, and bones. Each time this energy disappeared, Xiao Yan clearly sensed the strength of his body grow stronger at a slow rate.</p><br/><p>“This place is indeed a perfect training ground!”</p><br/><p>Joy involuntarily rose within Xiao Yan’s heart when he sensed the slight change in his body. With this progress, he would be able to rely on the energy of this blood pool to train the King Kong Glass body to its peak, and he would be able to breakthrough the eighth star and advance to a ninth star Dou Zun!</p><br/><p>The energy in this Heaven Demon Blood Pool was quite terrifying after having accumulated natural treasures that had been gathered by the Heaven Demon Python over hundreds of years, but this was only from Xiao Yan’s perspective. The energy within the blood pool might be terrifying, but it was also impure. The Heaven Demon Python was a brutal creature with low intelligence and a powerful physical body. Even if its cubs were to absorb this energy, it would only allow them to evolve quickly. If any other human were to attempt to absorb it, the interior of their body would turn into a mess by this impure energy. At that time, not only would one’s strength fail to advance, but one’s many years of bitter training might also be ruined.</p><br/><p>Fortunately, this kind of mottled energy did not pose too much of a problem to Xiao Yan since he possessed a Heavenly Flame. Under the frightening temperature of the Heavenly Flame, any impurities instantly disappeared.</p><br/><p>Xiao Yan crossed his legs and sat in the blood pool as an increasing amount of energy poured into his body. He merely sat in the blood pool, waiting. Both of his eyes were tightly shut as he quietly waited for the moment of his breakthrough!</p><br/><p>Two days passed by in the blink of an eye while Xiao Yan was quietly training.</p><br/><p>Cai Lin, Little Fairy Doctor, Yun Yun, and the others had remained at this mountain belonging to the Heaven Demon Python during these two days. This place was considered quite safe due to there being no ferocious beasts around. The Ancient Heaven Demon Python that was under Qing Lin’s control had been released. It simply entrenched itself on the mountain top and spat out a dense black fog all day long. Quite a number of experts arriving in this place during these two days, but their expressions changed and they chose to take a detour when they saw this big fellow. Everyone knew the brutalness of these ferocious beasts when they went all out. Moreover, this ferocious beast was at the peak of the Dou Zun class. There would definitely be injuries and death if they fought it. Those who had come to this place seemed to be after the Bodhisattva Ancient Tree. Who would come and engage in an all out battle with a red-eyed ferocious beast for no reason?</p><br/><p>By relying on the ferocity of the Heaven Demon Python, everyone lived in peace during these two days. They quietly waited for Xiao Yan to successfully exit his retreat.</p><br/><p>The water in the blood pool deep inside the cave had already been reduced by half and the scarlet hue of the water had diminished. Over half of the energy within it had disappeared as Xiao Yan devoured it during these two days.</p><br/><p>A figure with half his body exposed was present in the middle of the blood pool. The skin of the current Xiao Yan was a lot more rosy compared to two days ago. It seemed as though there was an endless amount of blood hidden under his skin…</p><br/><p>At this moment, Xiao Yan’s eyes were still tightly shut. His entire body did not move, appearing just like a statue. However, everyone could sense an extremely powerful energy brewing within Xiao Yan’s body at this moment. This energy was like a volcano that was about to erupt. It was searching for the opportunity to breakthrough…</p><br/><p>This opportunity was something that one needed to wait for…</p><br/><p>The water in the Heaven Demon Blood Pool continued to reduce as everyone waited. When the third day arrived, the water within the Heaven Demon Blood Pool was exhausted…</p><br/><p>A countless number of dense-white bones were revealed in the Heaven Demon Blood Pool after the water was exhausted. These bones contained some strange unknown things in them. A rich bloody scent spread from them while Xiao Yan sat like a statue surrounded by these many bones. A blood-colored light was quietly circulating under his skin…</p><br/><p>This quietness continued for around two hours before an invisible ripple suddenly swept away from Xiao Yan’s body!</p><br/><p>“Bang!”</p><br/><p>This invisible fluctuation erupted, and in an instant, it had shattered those bones in the blood pool into dust. The ripple continued to spread, and it collided on the mountain wall. Even the entire cave trembled…</p><br/><p>Xiao Yan’s aura suddenly soared when this invisible fluctuation was emitted. This soaring was basically instantaneous. It was like a volcano erupting, appearing as fast as lightning and as ferocious as thunder!</p><br/><p>“Bang!”</p><br/><p>The soar in his aura merely lasted for a moment before a low muffled sound appeared from deep within Xiao Yan’s soul. The Dou Qi in his body widely soared at this moment. His long hair danced as his robes fluttered. Many cracks swiftly spread from the spot he sat. They covered the blood pool basin in the blink of an eye.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s tightly shut eyes were suddenly opened when this sound from deep within his soul appeared. A blood glow lingered in his eyes.</p><br/><p>“King Kong Glass Body!”</p><br/><p>After this cry was emitted from Xiao Yan’s throat, a golden light began to radiate from his body. His body swelled quickly under this brilliant golden light: ten feet, thirty feet, fifty feet, seventy feet, eighty feet…</p><br/><p>Xiao Yan’s body continued to rapidly swell. In the blink of an eye, his body reached eighty feet in height. Moreover, it did not show any signs of stopping!</p><br/><p>“Ah!”</p><br/><p>Xiao Yan’s body seemed to have met a kind of bottleneck the moment it swelled until it was eighty-nine feet tall. The swelling swiftly slowed. However, Xiao Yan was unwilling to remain at this stage. His face turned flushed as he cried out!</p><br/><p>“Bang!”</p><br/><p>After this cry sounded, Xiao Yan’s body, which had ceased swelling, suddenly became bigger once again. It reached ninety feet!</p><br/><p>A giant that seemed to be completely made from gold stood within the mountain. An overbearing indestructible aura surged out of its body. Finally, the giant’s legs curled as it suddenly stomped on the ground!</p><br/><p>“Bang bang bang!”</p><br/><p>This violent stomping caused the ground to sink by over ten metres. That golden giant, which Xiao Yan had transformed into, emitted a ‘swoosh’ sound as it violently collided with the top of the mountain cave like a cannonball. It continued to charge up and formed a large tunnel with its frightening strength. Xiao Yan seemed to have penetrated the mountain. His body charged toward the mountain peak from within the mountain with lightning-like speed!</p><br/><p>“Boom!”</p><br/><p>Xiao Yan’s speed was extremely quick. In less than half a minute, a large tunnel formed within the mountain. Eventually, his body rose, and it broke through the top of the mountain while emitting a loud sound before appearing in the sky!</p><br/><p>“Roar!”</p><br/><p>The gigantic body with a golden luster paused in the sky. A breath was blocked in its throat. Finally, this breath turned into an earth-shaking roar that reverberated into the distance…</p><br/><p>Cai Lin’s group had sensed something when Xiao Yan was forcefully breaking through the mountain. Hence, they rushed into the air and saw a giant golden figure tunneling through the mountain…</p><br/><p>“His aura has soared. Has he successfully broken through to a nine star Dou Zun…” Cai Lin softly muttered when she sensed Xiao Yan’s strong aura.</p><br/><p>“Ha ha, junior pavilion chief’s training speed is really something to marvel at.” Elder Qing Chen softly sighed. He had spent almost all of his life in order to reach this stage, yet Xiao Yan had already reached it at his young age. Moreover, Elder Qing Chen clearly understood that he might not be a match for Xiao Yan if they were to really fight.</p><br/><p>Those Elders from the Flower Sect also exclaimed and nodded. When they had met Xiao Yan for the first time back then, he had merely been a two star Dou Zun. It had only been less than two years, but he had already reached the ninth star. This speed caused them to feel ashamed.</p><br/><p>Nalan Yanran’s pretty eyes looked at the figure that was filled with an incomparably overbearing strength. A gloominess and self-ridicule flashed across her eyes. That man, whom she had viewed as trash back then and insisted on ending their engagement, had currently tossed her far behind him… the thing that caused her to feel depressed and helpless was that she seemed to have formed some faint feelings for this man, who would have become her husband. Even though she understood that it was only one-sided on her part…</p><br/><p>“This is perhaps my retribution from back then,” She thought in her heart.</p><br/>\n</div>"}