{"title": "Chapter 1410: Sieging the Heaven Demon Python", "id": 1410, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1410-sieging-the-heaven-demon-python", "volume_title": "Volume 15", "body": "<h1>Chapter 1410: Sieging the Heaven Demon Python</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1410: Sieging the Heaven Demon Python</u></strong></p><br/><p>An extremely steep and dangerous mountain stood on one side of the main road, like a giant python. Clusters of black vapors continued to rise and covered the sky within a hundred meter radius. No ferocious beast dared to step within this territory because this place was the territory of the Ancient Heaven Demon Python!</p><br/><p>The Ancient Heaven Demon Python was an extremely rare mutated beast. If one were to look in terms of seniority, its bloodline was considered to be relatively close to that of some ancient ancestors within the snake clan, but its murderous desire was too strong, causing its intelligence to be far inferior to the Nine Serene Deep Ground Python tribe. Hence, the Nine Serene Deep Ground Python looked down on the Ancient Heaven Demon Python. After all, it was merely a killing machine that possessed great strength and did not possess any intelligence.</p><br/><p>The blood of the Ancient Heaven Demon Python was good at tempering and refining one’s physical body. Of course, Xiao Yan’s current body was relatively strong after having been refined by various natural treasures. An ordinary treasure could no longer strengthen Xiao Yan’s body anymore and even the Heaven Demon Python’s blood wouldn’t be able to do much. Therefore, the thing that he was targeting was not the Ancient Heaven Demon Python’s blood. Instead, it was the Heaven Demon Blood Pool that it had spent hundreds of years accumulating.</p><br/><p>This Heaven Demon Blood Pool was filled with natural treasures and a pure energy that the Ancient Heaven Demon Python had spent great effort to find over hundreds of years or longer. As time progressed, the energy gathered within it reaches an extremely terrifying level. If an ordinary person were to step into it, that person’s body would burst apart because of the frightening energy. Only the descendants of the Ancient Heaven Demon Python could endure it.</p><br/><p>Of course, nothing was absolute. Something that others could not endure did not mean that Xiao Yan could not endure it. His body’s strength was no longer weaker than some Magical Beasts after undergoing various refinements and strengthenings. Hence, the Heaven Demon Blood Pool was the perfect nourishment for him. This time around, he might not only be able to train the King Kong Glass Body until the peak, he also might use the opportunity to breakthrough to the ninth star of the Dou Zun class. At that moment, his strength would significantly soar. He would benefit if his strength increased while roaming this Ancient Wasteland Region that was filled with danger.</p><br/><p>“The Ancient Heaven Demon Python is here…”</p><br/><p>Yun Yun softly informed them when she arrived a short distance from the large mountain where black fog lingered.</p><br/><p>Xiao Yan nodded with excited eyes. He did not speak much as he said in a deep voice, “Let’s go! Prepare to attack!”</p><br/><p>Xiao Yan’s figure turned into a black shadow after his words sounded, and he swiftly rushed toward that enormous black mountain. Cai Lin, Qing Lin, the Little Fairy Doctor and the rest quickly followed behind him. The group from the Flower Sect hesitated for a moment before they followed Yun Yun and gave chase.</p><br/><p>Xiao Yan’s group suppressed their auras until they were very weak. They quickly charged into the thick black fog that lingered around the mountain. An extremely deafening snake hiss was suddenly emitted. Soon after, the entire mountain trembled, and one could hear many sounds of whistling wind appear. A thousand-foot-long black snake tail shot out from the mountain with lightning-like speed. It ruthlessly slammed toward Xiao Yan’s group.</p><br/><p>“Hmph!”</p><br/><p>Seeing that the senses of this Ancient Heaven Demon Serpent were so sharp, Xiao Yan let out a cold snort and quickly took two steps forward. A bright golden light suddenly erupted from his body, and in the blink of an eye, his skinny figure suddenly swelled until he was seventy feet tall. He appeared like a shiny golden giant.</p><br/><p>After using the King Kong Glass Body, Xiao Yan’s large hands, which appeared to be made of gold, were suddenly thrown forward. Both of his fists ruthlessly collided with that enormous black serpent tail.</p><br/><p>“Bang!”</p><br/><p>A frightening wind raged when the two clashed before exploding. Fortunately, the people present were not mediocre individuals, so they did not suffer much damage.</p><br/><p>A storm surged and the golden giant that Xiao Yan had transformed into was forced to take two steps back. However, that enormous black snake tail was also forced back. Its scales had been significantly damaged. After activating the King Kong Glass Body, Xiao Yan’s physical body had been strengthened to a frightening level.</p><br/><p>“Roar!”</p><br/><p>Having suffered a slight loss, a furious earth-shaking roar quickly resonated across the sky. The roar was filled with violence. Soon after, the entire mountain began to quiver. Finally, one could hear a loud “bang” as a thousand-foot-long black python shot out of the towering mountain!</p><br/><p>This black giant python was huge. Its entire body was covered with scales, and a dense layer of black fog lingered over these scales. The head of the giant python was relatively terrifying because it was not an ordinary snake face. At a glance, it appeared more like a ferocious giant human’s face. It gave one the chills when one looked at it. No wonder this monster was called the Heaven Demon Python.</p><br/><p>Dark clouds began to gather in the sky the moment this Ancient Heaven Demon Python appeared and a terrifying black energy agglomerated within the clouds with lightning-like speed. It was relatively powerful.</p><br/><p>Its large red eyes, which were at least ten feet in size, appeared like two enormous red lamps hanging in the sky. They were filled with violence and murderous intent as they stared at Xiao Yan’s group.</p><br/><p>Everyone’s expression involuntarily changed as they looked at the enormous being lingering in the sky. This Ancient Heaven Demon Python was indeed not an ordinary creature...</p><br/><p>“Attack!”</p><br/><p>Xiao Yan’s eyes stared at the Heaven Demon Python as he cried out in a deep voice. This big fellow had reached the strength of a five change peak Dou Zun. He could only rely on everyone attacking together if he did not use the Angry Buddha Lotus Flame.</p><br/><p>“Understood!”</p><br/><p>Cai Lin nodded when she heard Xiao Yan’s cry. Her delicate figure leaped forward as she turned into a Seven-Colored Heaven Swallowing Python that was not any smaller than the Ancient Heaven Demon Python within the churning clouds. An invisible pressure spread, causing the ferocity of the Heaven Demon Python to diminish. In terms of bloodline purity, a Heaven Demon Python could not compare to this Heaven Swallowing Python, which was able to challenge the Ancient Heaven Serpent during the ancient times!</p><br/><p>However, this Heaven Demon Python was still an unusually violent and ferocious creature. Hence, the little pressure that it sensed was unable to hinder its killing intent. Forget about the Heaven Swallowing Python—even if a genuine Ancient Heaven Serpent were to arrive, this red eyed fellow would still dare to bite it.</p><br/><p>“Bang!”</p><br/><p>Clouds churned in the sky. Cai Lin, who had turned into the Heaven Swallowing Python, summoned numerous enormous colorful thunderbolts. After which, they continuously struck the Heaven Demon Python.</p><br/><p>“Puff!”</p><br/><p>That Heaven Demon Python opened its large ferocious mouth as Cai Lin attacked. Many black lights that were filled with a stench were spat out and received all those colorful thunderbolts. Although it was a little inferior to the Heaven Swallowing Python in terms of its bloodline, its strength far surpassed Cai Lin. Hence, it held the upper hand in this fight.</p><br/><p>Bang!</p><br/><p>The golden giant that Xiao Yan had transformed into turned into a golden light that arrived in front of the Heaven Demon Python in a flash while it was busy unleashing its attack. A frightening storm immediately formed under his fist as it ruthlessly smashed against the Heaven Demon Python’s body.</p><br/><p>“Ao!”</p><br/><p>This merciless punch from Xiao Yan scattered the black fog around the Heaven Demon Python. Even the black scales on its body were blasted apart.</p><br/><p>Elder Qing Chen, Yun Yun, the Little Fairy Doctor, and the rest unleashed their attacks when Xiao Yan struck. Frightening Dou Qi whistled across the sky and landed on the body of the Heaven Demon Python from all directions. The air that was blasted apart was something that even the Heaven Demon Python could not endure.</p><br/><p>“Chi!”</p><br/><p>However, this Heaven Demon Python was quite ferocious. Its huge eyes were bloody red as it ignored the many air explosions on its body. It swung its huge tail and ruthlessly struck Xiao Yan, who had caused it the most harm.</p><br/><p>“Clang!”</p><br/><p>The enormous snake tail heavily smashed into Xiao Yan’s body, emitting the clear sound of metal colliding. Sparks flew in the process.</p><br/><p>“Hmph!”</p><br/><p>Xiao Yan’s throat emitted a muffled moan after suffering such a serious blow. He forcefully endured the frightening strength as he reached out with his hands and firmly grabbed the Heaven Demon Python’s huge tail. Soon after, a purple-brown flame suddenly gushed out of his body and swiftly traveled down the Heaven Demon Python’s body. It quickly incinerated the dense black fog.</p><br/><p>“Hiss hiss!”</p><br/><p>The sudden terrifying temperature caused the Heaven Demon Python to go crazy as its large body continued to wiggle. The surrounding tall mountains would be shattered into rock fragments if they were struck by its tail.</p><br/><p>“It is really difficult to deal with this fellow…” Everyone’s heart involuntarily felt speechless when they saw the stubbornness of this Heaven Demon Python. If Xiao Yan and Cai Lin were not pressuring it from the sky, it was likely that the remaining people would not be able to endure the force from just a swing of its tail.</p><br/><p>Xiao Yan held the Heaven Demon Python with all his strength as one of his fists wildly smashed into its tail. A violent force and a hot flame smashed its tail until blood flowed like a river. Although this caused the Heaven Demon Python to feel an immense amount of pain, it had also stirred its ferocious instincts. Its resistance became even more intense.</p><br/><p>“Young master Xiao Yan, force its eyes to look at me!”</p><br/><p>A voice was suddenly transmitted into Xiao Yan’s ears while he gradually started to feel like he wouldn’t be able to hold the struggling Heaven Demon Python. The voice caused him to brace his attention. That voice belonged to Qing Lin.</p><br/><p>“Roar!”</p><br/><p>Xiao Yan inhaled a deep breath of air. Dou Qi from his body poured into his arms. A frightening strength suddenly surged and forcefully maneuvered the Heaven Demon Python’s body, turning it in the process!</p><br/><p>That Heaven Demon Python became furious as Xiao Yan repeatedly pulled and pushed it. It was planning to go crazy when a five-foot-large jade-green demonic eye suddenly appeared in its sight. Three green flowers rapidly rotated within the eye as a numb feeling, originating from deep within the Heaven Demon Python’s soul, caused its body to stiffened. It slowly became gentle. The murderous intent and violence within its large blood-red eyes quickly diminished…</p><br/>\n</div>"}