{"title": "Chapter 1436: Imminent War", "id": 1436, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1436-imminent-war", "volume_title": "Volume 15", "body": "<h1>Chapter 1436: Imminent War</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1436: Imminent War</u></strong></p><br/><p>The Falling Star Pavilion was undoubtedly at its most secure this year because today was the day mentioned on the challenge card that came from the “Profound River Alliance”!</p><br/><p>The Falling Star Pavilion still did not know why the “Profound River Alliance” would launch a major campaign, but regardless of what the case was, the Falling Star Pavilion would not reveal any fear in front of others. The news that the experts from the “Profound River Alliance” would gather at the Falling Star Pavilion had already spread. Hence, many people had hurried to the Falling Star Pavilion during these few days. Everyone understood that the conflicts that had been experienced over these two years had caused the “Profound River Alliance” and the Falling Star Pavilion to truly become enemies. With this sudden situation occurring after both parties had suppressed themselves for such a long time, it would definitely be an extremely spectacular show. Many experts naturally did not want to miss such an interesting situation.</p><br/><p>The Falling Star Pavilion did not take any actions to expel the people who intended to watch the show after hearing the news. Instead, it had provided the pavilion with a reason to dispatch experts to watch the people. Anyone who acted unusual would be treated like an enemy and killed.</p><br/><p>As the anticipation of many people grew, the day stated on the challenge card slowly arrived.</p><br/><p>There was an extremely tall mountain where the main hall of the Falling Star Pavilion was located. The slopes of the mountain were extremely steep and dangerous. It was difficult for an ordinary person to ascend it. Moreover, the peak of the mountain seemed to have been hacked apart by an axe. This area had been turned into an extremely spacious and smooth square. This place was where the Falling Star Pavilion received guests.</p><br/><p>At this moment, many people stood within this densely packed square. Numerous powerful auras rose and spread across the sky. Everyone could tell that the Falling Star Pavilion had become an extremely dangerous place. Subsequently, the people in the square waited for the experts from the “Profound River Alliance” to arrive.</p><br/><p>Yao Lao stood with his hands behind him at the center of the square. His eyes were calm. Cai Lin, the Little Fairy Doctor, Qing Lin and some Guest Elders of the Falling Star Pavilion stood behind him. This lineup was sufficient to stir the exclamations of some of the surrounding observers.</p><br/><p>“We did not manage to gain much intelligence related to the operations of the Profound River Valley this time around. It is rumored that even some of the elders in the “Profound River Alliance” do not know why they are attacking this time around…” Cai Lin suddenly spoke as she looked in the direction of the entrance to the star realm.</p><br/><p>“Aye.”</p><br/><p>Yao Lao slightly nodded. They were too pressed for time. It was indeed a little difficult to obtain top secret information.</p><br/><p>“The star realm has already entered a state of high alert. Some of the weaker disciples have already been relocated and most of the Elders have been summoned back.” Cai Lin softly reported. “Everything is prepared. We are only waiting for the “Profound River Alliance” to come.”</p><br/><p>Yao Lao nodded again. He was just about to speak when his eyes hardened. He looked at the entrance to the star realm and faintly said, “They are here…”</p><br/><p>The hearts of everyone present tightened after hearing Yao Lao’s words. Their eyes gathered on the entrance of the star realm. A big hole was slowly torn at that space. Immediately, a monstrous aura brutally charged into this realm like an evil ferocious beast. A faint laugh that was filled with a dark chill resounded within the star realm like rolling thunder.</p><br/><p>“Yao Chen, it has been many years since we last met! How are you?”</p><br/><p>After hearing this thunder-like voice reverberating through the air, one could see a large number of people swarming through the spatial crack. They immediately turned into many rays of light that appeared in the sky above the square within a couple of flashes.</p><br/><p>While this large group of people rushed into the star realm, the Dou Qi within the bodies of all the Falling Star Pavilion Elders began to quietly circulate. Their eyes were filled with caution.</p><br/><p>Yao Lao slowly lifted his head. His eyes looked at the leader’s spot of the large group. A dark-gray-robed human figure stood in the sky at that spot. This person had long gray hair, and his face did not have many wrinkles. If not for the aged aura that filled his glittering blue eyes, no one would have regarded him as an old demon who had lived for hundreds of years.</p><br/><p>At a glance, this gray-robed person appeared extremely ordinary. Even the aura within his body was like that of an ordinary person. His entire person appeared unassuming, but everyone understood that a person who could stand there was definitely not a simple character.</p><br/><p>“Old demon Tian Ming… it is unexpected that you are still alive.”</p><br/><p>Yao Lao’s eyes paused on this gray-robed figure as he slowly laughed.</p><br/><p>“Ha ha, even someone like you, who only had a soul left, can be revived. How can the old me die so easily?” That gray-robed human figure smiled after hearing this reply. His voice was calm as he spoke.</p><br/><p>Yao Lao lifted his eyelids. He ignored old demon Tian Ming and swept his eyes over the large group behind him. It was obvious that the experts from the “Profound River Alliance” had all come. There were at least a hundred people present, and around half of this group possessed the strength of a Dou Zun. This lineup, along with the Ban Sheng old demon Tian Ming, could be described as terrifying.</p><br/><p>This lineup might appear unusually powerful, but it was clearly insufficient if one wished to rely on these people to destroy the Falling Star Pavilion. After these years of development, the number of experts in the Falling Star Pavilion was not less than the amount in the “Profound River Alliance.” Moreover, Yao Lao was also an elite Ban Sheng like that old demon Tian Ming!</p><br/><p>“The Falling Star Pavilion and the Profound River Alliance have difficulty coexisting. In the end, the old me must ultimately step forward. Yao Lao, on the account us being acquaintances in the past, as long as your Falling Star Pavilion withdraws five hundred kilometers from the territories of the Profound River Alliance and promises not to start any conflict with the Profound River Alliance in the future, our Profound River Alliance will withdraw today.” Old demon Tian Ming’s faint voice was transmitted through the air, causing the expressions of many Falling Star Pavilion to change.</p><br/><p>“You must be dreaming!” Cai Lin’s replied in an icy-cold voice. Withdrawing five hundred kilometers? Wouldn’t that mean that the Falling Star Pavilion would shrink by half? Moreover, they must promise not to have any conflict with the Profound River Alliance in the future? Would that not mean that they would have to submit to these people? How would the Falling Star Pavilion continue to survive in the Central Plains if they agreed to these terms?</p><br/><p>“It is obvious that these people are provoking us.” The Little Fairy Doctor knit her brows as she spoke. The Profound River Alliance should be clearly aware that it was impossible for them to agree to such terms.</p><br/><p>Yao Lao’s eyes calmly stared at old demon Tian Ming. A moment later, a cold smile appeared on his face. He did not withdraw.</p><br/><p>The other experts around the surrounding mountains did not dare to display any unusual actions at this moment. From the looks of it, the Profound River Alliance was clearly intending to start a war with the Falling Star Pavilion…</p><br/><p>“Yao Chen, what do you say? Have you made up your mind?” Old demon Tian Ming’s rolled his eyes as he asked after waiting for a moment.</p><br/><p>Yao Lao laughed after hearing these questions. He asked, “Do you think the Profound River Alliance has the qualification to utter these words, given its strength?”</p><br/><p>“In that case, do you mean that you disagree?” Old demon Tian Ming withdrew the cold smile on his face and slowly demanded.</p><br/><p>Yao Lao smiled and nodded. He suddenly waved his hand at the same time.</p><br/><p>“Bang bang!”</p><br/><p>Many extremely powerful auras suddenly erupted from the surrounding mountains as Yao Lao waved his hand. Wave after wave of Dou Qi light pillars spluttered out. They entwined themselves in the sky and finally bloomed. It appeared like a big formation that surrounded old demon Tian Ming’s group in the sky.</p><br/><p>The people on the surrounding mountains were slightly startled when they saw this sudden unexpected change. It seemed that this Falling Star Pavilion had come prepared. The good show today was finally about to start.</p><br/><p>“Yao Chen, it seems that you really won’t give in until you are faced with grim reality!”</p><br/><p>Old demon Tian Ming watched the Dou Qi light curtain lower from the surrounding sky. A cold smile slowly appeared. After which, his eyes landed on Yao Lao as he said, “Given the strength of my Profound River Alliance, it is indeed difficult to destroy your Falling Star Pavilion. However, do you think that this elderly-self would be so foolish to deliver myself to your hands without absolute confidence?</p><br/><p>Yao Lao’s group frowned after hearing this question.</p><br/><p>“Two misters, please show yourselves!”</p><br/><p>Old demon Tian Ming laughed in a strange fashion. Following which, he let out a loud cry.</p><br/><p>“Chi!”</p><br/><p>The space beside old demon Tian Ming suddenly began to wiggle in front of everyone’s eyes after his words sounded. A spatial crack was formed and two clusters of dark monstrous auras swiftly flew out of this crack in space like floodwater.</p><br/><p>Yao Lao’s expression slowly sank as he sensed these two familiar auras. His eyes stared intently at the crack in space as he spit out in a gloomy voice, “Hall of Souls! You people have indeed intervened!”</p><br/><p>“Tsk tsk, Yao Chen I said before that your Falling Star Pavilion will be turned into ruins sooner or later. However, you should also be glad that this has been delayed by two years!” A churning black fog surged out of the crack in space and two figures slowly appeared in front of many pairs of eyes. At the same time, a dark and cold laugh also sounded.</p><br/><p>“Gu You!”</p><br/><p>A dense expression flashed across Yao Lao’s eyes after hearing this strange laughter.</p><br/><p>A black fog churned in the sky before slowly scattering. Two figures appeared in front of everyone’s eyes. The first was a skeleton-like old man who was surprisingly the second Tianzun of the Hall of Souls, Gu You, whom they had met in the Ancient Wasteland Region. Another figure stood behind him. Although the aura of this person was not as strong, this person also possessed the strength of a Ban Sheng, but it was that of an initial level Ban Sheng.</p><br/><p>Two Ban Shengs! If one included old demon Tian Ming, there was a total of three of them!</p><br/><p>This lineup immediately caused many to gently inhale a breath of cool air. The faces of some Elders from the Falling Star Pavilion began to turn pale.</p><br/><p>“Yao Chen, do you need to reconsider the conditions that I offered earlier?” A strange smile surfaced on old demon Tian Ming’s face as he asked in a sinister manner.</p><br/><p>Yao Lao’s expression was gloomy. He slowly clenched his hand under his sleeve.</p><br/><p>“Yao Lao, it is pointless to admit defeat. Given the Hall of Souls’ and Profound River Alliance’s methods, it is impossible for them to continue to allow us to survive.” Cai Lin’s face was icy-cold. A chilly glint flickered within her pretty eyes. “Now, we have no other choice but to fight them to death.”</p><br/><p>The surrounding Falling Star Pavilion’s experts looked at Yao Lao and waited for his decision.</p><br/><p>“Hu…”</p><br/><p>Yao Lao gently exhaled. A moment later, he nodded. He also understood this reasoning.</p><br/><p>“Since this is the case… let’s… fight with them!”</p><br/><p>A ferocious expression surfaced on Yao Lao’s face after he uttered those last few words.</p><br/>\n</div>"}