{"title": "Chapter 1435: Challenge Card", "id": 1435, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1435-challenge-card", "volume_title": "Volume 15", "body": "<h1>Chapter 1435: Challenge Card</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1435: Challenge Card</u></strong></p><br/><p>On the surface, the Gu clan was the strongest clan among the six remaining ancient clans. No one doubted the strength they possessed.</p><br/><p>If one were to describe the Hun clan, this clan could be considered the clan with the longest history among the eight ancient clans. This clan had existed since ancient times. It was usually extremely mysterious and even the other ancient clans did not dare to say that they clearly understood its strength. Although the Hun clan did not reveal that they were the strongest during the big wars of the old, anyone who carefully recall the events would discover that the Hun clan had never fallen into a disadvantage...</p><br/><p>They were neither victorious nor defeated. From a certain point of view, that was quite frightening to accomplish. Hence, even the Gu clan maintained a healthy amount of fear for this mysterious ancient clan.</p><br/><p>These two ancient clans represented the strongest factions within the Dou Qi continent. Other than these two clans, not a single faction could eliminate the entire Ling clan without anyone noticing.</p><br/><p>Hence, the Gu clan and the Hun clan were undoubtedly the most suspicious factions related to the disappearance of the Ling clan. Although the other four ancient clans did not possess absolute evidence to determine the culprit, it was obvious that they became more cautious toward the Hun clan and the Gu clan after this incident regarding the Ling clan. If the other party was really after the Tou She Ancient Jade, they would definitely not stop. Since they were in possession of the remaining four ancient jade, one of them was likely to be the next target.</p><br/><p>The Gu clan appeared quite depressed as they dealt with this doubt that had appeared from nowhere, but they also understood the seriousness of this matter. Any actions they made would likely stir some unnecessary suspicion. Hence, they could only remain quiet. At the same time, the Hun clan did as they always did. They ignored everything and did whatever they wanted to do. In any case, the Hun clan did not require any allies. They did not care about what the others thought.</p><br/><p>Therefore, the matter regarding the Ling clan was gradually suppressed as both parties continued to remain quiet. The six ancient clans did not start a major war. Following the flow of time, this matter seemed to have been forgotten by others, but some people were aware that a split had formed among the six ancient clans. All of the clans were cautious…</p><br/><p>The matter of the Ling clan stirred quite a big commotion in the Central Plains, but the ancient clans usually kept a low profile. Hence, this commotion lasted for half a year before it gradually diminished. There were interesting occurrences happening daily within the Central Plains, so there was an uncountable number of topics to talk about. Even a big matter like the disappearance of the Ling clan could not continue being the dominant topic.</p><br/><p>Following the various interesting incidents that occurred across the Central Plains, one season changed to another. It had been nearly two years since Xiao Yan had undertaken his retreat.</p><br/><p>During these two years, there was still no signs of activity from the deep mountain where Xiao Yan had took his retreat. Wild grass grew, covering the large stone door. During these two years, the young disciples that the Falling Star Pavilion had recruited gradually became senior disciples. A new generation once again entered the Falling Star Pavilion to provide new blood for this faction…</p><br/><p>After Xiao Yan’s quiet retreat lasted for two years, even some of the Guest Elders began to feel a little pessimistic. The deep part of the mountain was too quiet. Normally speaking, breaking through to the Ban Sheng class should be an earth-shaking event. It would definitely attract an unnatural phenomenon, but the sky did not even hint at the slightest strange occurrence ever since Xiao Yan had undertaken his retreat.</p><br/><p>Given Yao Lao’s sharp eyes, he was naturally able to sense some of the thoughts that these Elders felt in their hearts. However, he did not say anything. He had always adopted the greatest trust when it came to Xiao Yan. Back when he had been captured by the Hall of Soul, Xiao Yan had relied on his own strength to make it to the Central Plains and rescue him from the hands of the Hall of Souls. All that Xiao Yan could rely on to achieve this was his own strength.</p><br/><p>Ever since that day, Yao Lao understood that this tender eagle, which had been hiding under the protection of his wings, had already soared through the sky!</p><br/><p>This continent, which was interesting and strange, was ultimately a stage for him. This was something that Yao Lao believed without a doubt.</p><br/><p>Yao Lao studied the enormous stone door that was covered in moss a short distance away. It was a long while later before he softly sighed softly, “Ugh, little fellow. This retreat of yours really worries others…”</p><br/><p>“Yao Lao!”</p><br/><p>A ray of light suddenly rushed over from the distance while Yao Lao was softly sighing. A delicate beautiful figure appeared behind Yao Lao. That figure surprisingly belonged to Cai Lin. She had spent most of her time during these two years in the Falling Star Pavilion. Yao Lao had tried his best to refine various medicinal pills and had activated the Falling Star Pavilion to search for various natural treasures all for Cai Lin. Hence, Cai Lin’s strength had risen from a five star Dou Zun to the peak of the Dou Zun class.</p><br/><p>This kind of improvement could be considered quick. Being a Seven-Colored Heaven Swallowing Python, the strength of Cai Lin’s body was stronger than Xiao Yan’s body. As long as she possessed sufficient energy, the increase in her strength would not slow. The Seven-Colored Heaven Swallowing Python had been an extremely powerful existence since ancient times. She had undoubtedly held a great advantage in terms of talent compared to Xiao Yan’s bitter training.</p><br/><p>“What’s wrong?”</p><br/><p>Yao Lao turned his head after seeing Cai Lin appeared. He saw her somewhat grave face and asked in surprised.</p><br/><p>Cai Lin’s pretty eyes swept over the stone door in the distance. Her eyes dimmed as she took out a blood red card and said, “This was delivered by the Profound River Alliance.”</p><br/><p>“What is it?” Yao Lao frowned. He received the card and opened it. Three large dark-red words were immediately captured by his eyes.</p><br/><p>“Declaration of war?”</p><br/><p>A cold smile also surfaced on Yao Lao’s face when he saw these words. His eyes were lowered.</p><br/><p>“Half a month from now, my Profound River Alliance will arrive at the Falling Star Pavilion. We will fight and see who is stronger. The winner takes all!”</p><br/><p>“They are actually taking the initiative to head to my Falling Star Pavilion? How arrogant. It seems that the old demon Tian Ming can no longer resist intervening.” Yao Lao narrowed his eyes and coldly laughed.</p><br/><p>“The Profound River Alliance has been quiet for over a year. This time around, they have suddenly issued a battle challenge and are planning to head to our Falling Star Pavilion. It seems that they must feel confident to do this. We must be cautious.” Cai Lin voiced her opinions.</p><br/><p>Yao Lao slightly nodded. Ever since the Falling Star Pavilion’s war with the “Profound River Alliance” a year ago, the Profound River Alliance had not launched any other campaigns against the Falling Star Pavilion. Yao Lao understood in his heart that it was not because these people were unwilling, rather they did not want to push the Falling Star Pavilion too far. After all, Yao Lao’s Ban Sheng strength was on display for all to see. If they wished to defeat the Falling Star Pavilion, they needed to first defeat Yao Chen.</p><br/><p>However, if they wanted to kill a Ban Sheng, especially a high level one, the Profound River Alliance needed to take out two powerful Ban Sheng in order to succeed!</p><br/><p>Even with the strength of the Profound Sky Sect, they were unable to take out two Ban Shengs. There was only a grand Elder within their sect who had reached the Ban Sheng class, but this Ban Sheng old demon had not appeared for many years. Other than this person, the “Profound River Alliance” did not possess any other Ban Sheng. Although there were many sects in the alliance, these sects were far inferior to the Profound Sky Sect. It was naturally impossible for them to possess any experts at the Ban Sheng level. It was obvious that the Ice River Valley was unable to produce one…</p><br/><p>A single Profound Sky Sect Grand Elder was clearly only able to match Yao Lao, but it would not be possible to kill Yao Lao.</p><br/><p>It was precisely because of this lack of strength that the “Profound River Alliance” had only started some minor conflicts and had only gained a small advantage during this one year. Despite wanting to destroy the Falling Star Pavilion, they were unable to intervene in those areas with a greater amount of profit.</p><br/><p>This time around, they dared to issue a battle challenge, and they had even used the headquarters of the Falling Star Pavilion as the site of the challenge. No one would believe that this challenge was not problem.</p><br/><p>“Issue the orders to summon all the Elders who are not busy with important tasks. Additionally, order those Elders guarding the key cities to be very cautious during this period of time and to guard against any sneak attacks by the Profound River Alliance” Yao Lao’s shriveled hand gently rubbed the invitation in his hand. He continued in a deep voice, “Additionally, dispatch some spies to gather information inside the Profound River Alliance. We must know why these people suddenly possess the courage to come forth.”</p><br/><p>“Understood.”</p><br/><p>Cai Lin slightly nodded. She had already issued all of these orders when she had received the challenge card. After her performance over these two years, the current Cai Lin was held in high regard within the Falling Star Pavilion. Everyone were aware of her status. Moreover, Xiao Yan had been determined by Yao Lao to be the next pavilion chief. In other words, Cai Lin was half a pavilion chief’s wife. Even some Elders had to obey her orders. Additional, after these two years of war, everyone also understood that she was not merely a flower vase on display.</p><br/><p>Her ruthless decisiveness was something that even some men could not compare with!</p><br/><p>“During this period of time, the caution level in the Falling Star Pavilion will be raised to its highest.” Yao Lao coldly laughed. “I wish to see just what trick that old demon Tian Ming intends to play!”</p><br/><p>Cai Lin nodded once again. Her pretty eyes could not resist looking at the tightly shut rock door. She softly asked, “Is there still no activity from him?”</p><br/><p>Yao Lao was slightly startled. He nodded gently and looked at Cai Lin’s somewhat dim eyes. He laughed, “There is no need to worry. Nothing will happen to him. According to my guesses, he will successfully exit his retreat very soon…”</p><br/><p>Cai Lin bitterly laughed. She had heard these words quite lot over these two years.</p><br/><p>“Let’s go. There are still many things that we need to do to prepare. The Profound River Alliance has come with ill intent.” Yao Lao waved his hand. After which, he turned around and slowly left.</p><br/><p>Cai Lin’s pretty eyes looked at the stone door. A moment later, she finally sighed, turned around, and followed Yao Lao.</p><br/><p>However, no one sensed the moss on the large rock door tremble soon after those two left. A tiny line suddenly surfaced on the stone door…</p><br/>\n</div>"}