{"title": "Chapter 1446: Small Pill Tower", "id": 1446, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1446-small-pill-tower", "volume_title": "Volume 15", "body": "<h1>Chapter 1446: Small Pill Tower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1446: Small Pill Tower</u></strong></p><br/><p>“Not a human?”</p><br/><p>Xiao Yan felt his skin explode apart at this moment. The corner of his mouth twitched. It was a long while later before he suppressed his voice and softly asked, “A legendary Di tier medicinal pill?”</p><br/><p>All medicinal pills that had experienced a nine-colored Pill Lightning would possess some intelligence, but the medicinal pills were mostly in the form of a beast. Some of the legendary tier 9 medicinal pills were able to take on a human form, and it was even possible for them to train. However, Xiao Yan had only read about these pills in some ancient books.</p><br/><p>“Ha ha, a Di tier medicinal pill was extremely rare even in ancient times. How can anyone refine one now?”</p><br/><p>Xuan Kong Zi was not surprised to see Xiao Yan’s shock. He had also been stunned for a long time before recovering the first time he had heard about the ancestor’s actual form.</p><br/><p>“The elder who refined ancestor was one of the founders of the Pill Tower, but that elder has already died… a year before he was about to die, he spent all his effort to refine a medicinal pill. This ancestor had been exhausted when the pill formed and ended up quietly dying. However, a tendril of his spirit entered the tier 9 medicinal pill in a strange fashion, causing this tier 9 medicinal pill to undergo a transformation…”</p><br/><p>“Subsequently, this medicinal pill turned into a human form that did not leave the Pill Tower. It remained behind as a guardian of the Pill Tower. From a certain point of view, this ancestor could be described as a unique avatar of that elder, but the control of this avatar is rather complicated.” Xuan Kong Zi laughed as he explained. “With the flow of time, the ancestor has rescued the Pill Tower from destruction time and time again. In the end, no one could match his status in the Pill Tower, but he was not really interested in this. He would go missing after the Pill Tower stabilized. No one could find him.”</p><br/><p>Xiao Yan wiped his cold sweat off. The origin of this ancestor in the Pill Tower was mysterious. A mutated tier 9 Xuan Pill…</p><br/><p>Xiao Yan was clearly aware of the division of tier 9 medicinal pills. The ninth tier was separated into three grades, tier 9 Treasure Pill, tier 9 Xuan Pill, and tier 9 Golden Pill. The tier 9 medicinal pills that appeared in this world were mostly Treasure Pills. One was basically unable to find Xuan Pills, and the distant tier 9 Golden Pills were likely something that only appeared in ancient times.</p><br/><p>After the tier 9 Golden Pill was the legendary… Di Pill.</p><br/><p>No one currently living on this continent could refine this medicinal pill.</p><br/><p>“That elder was able to refine a tier 9 Xuan Pill and cause it to mutate. It is likely that his strength was, at the very least, a five or six star Dou Sheng…” Upon thinking about this, Xiao Yan’s heart involuntarily felt shaken by the strength the Pill Tower had once possessed.</p><br/><p>“Forget it, there is no need to discuss the matter related to the ancestor anymore. He has been missing for many years, and there is no telling when he will appear. Perhaps, he is now in the form of a baby doing the so-called ‘experiencing life’.” Xuan Kong Zi waved his hand. His tone was helpless because of this legendary ancestor who had been missing for many years. The last time he had met the ancestor, the ancestor was a seventeen-to-eighteen-year-old youth. There was no way to tell what he had become now.</p><br/><p>“What about the matter of the alliance?” The shock in Xiao Yan’s heart was gradually withdrawn as he asked.</p><br/><p>“Since the ancestor is not around, all the major matters of the Pill Tower are decided by the Main Elder Council of the Small Pill Tower by voting.” Xuan Kong Zi replied.</p><br/><p>“It must go through the Main Elder Council, huh. In that case, it will be a little troublesome. Most of the old fellows there are pedantic. It will be difficult to get them to vote in support of the alliance.” Yao Lao frowned and said.</p><br/><p>“There are a total of ten seats in the Grand Elder Council. The three of us, being the three great heads of the Pill Tower, are also inside. Even though this is the case, we only have three votes…” Xuan Yi helplessly explained. “Moreover, the remaining seven old fellows are much more experienced than us. Our words will not have much of an impact on them.”</p><br/><p>“Only three votes. That is insufficient.” Yao Lao shook his head as he replied. Although this Main Elder Council was relatively democratic and its decision was dependant on the number of votes for and against a certain decision, some of the old fellows inside were extremely pedantic. Most of them would be against this alliance. As long as there was a difference of a single vote in this Main Elder Council, the result would be fixed. No one could modify the decision.</p><br/><p>“It is not as though there is no hope. Two of the seven Elders have an extremely great enmity with the Hall of Souls. If we can convince them, we will have five votes. Hence, we will have an equal number of votes as those other old fellows.” Xuan Kong Zi mused for a moment and explained.</p><br/><p>“Oh? Can you be certain about this?”</p><br/><p>Yao Lao’s eyes brightened upon hearing this. If it was five votes against five votes, there was a lot of wiggle room for hope.</p><br/><p>“I cannot be certain, but I can at least give it a try. Why don’t you and Xiao Yan follow me into the Small Pill Tower? Once I report this matter, those old fellows will definitely be a little shocked.” Xuan Kong Zi laughed.</p><br/><p>“Aye, alright. It has been many years since I have entered that place.” Yao Lao hesitated for a moment before nodding. He looked at Xiao Yan and laughed, “Those who have gathered are all alchemist gurus who once possessed an extremely well-known reputation across the Central Plains. You are lucky to be able to enter. It will be an eye-opener.”</p><br/><p>“Ha ha, with Xiao Yan’s current abilities, he will probably be opening those old fellows’ eyes.” Xuan Yi laughed.</p><br/><p>Xuan Kong Zi smiled and stood up. He walked to the end of the large hall before pressing his hand against a smooth jade-like wall. A ripple spread from his palm, and everyone saw the wall began to swiftly wiggle. In the blink of an eye, the wall had turned into a slowly rotating spatial tunnel.</p><br/><p>“A self-created realm, huh. This Small Pill Tower really exists inside a created realm.” Xiao Yan muttered in his heart after seeing this tunnel appear.</p><br/><p>“Let’s go.”</p><br/><p>Xuan Kong Zi smiled after opening the spatial tunnel. After which, he took the lead and walked into the tunnel. Xiao Yan’s group followed. The tunnel slowly scattered after the last person entered. After which, it turned back into a hard wall.</p><br/><p>...</p><br/><p>After traveling a short distance through the spatial tunnel in less than a minute, the light in front of Xiao Yan suddenly brightened. By the time he opened his eyes, he discovered that he was already standing on a towering green mountain. Clouds lingered in the sky, giving the land an extremely misty appearance.</p><br/><p>“What a dense medicinal ingredient scent…”</p><br/><p>Xiao Yan’s nose twitched. His eyes swept around, and he was surprised to discover that this entire mountain was filled with many medicinal gardens. Tons of extremely rare medicinal ingredients in the outside world were growing in clusters in these gardens.</p><br/><p>“This is just like a second Pill Realm…” Some surprise flashed across Xiao Yan’s eyes as he looked around.</p><br/><p>“These medicinal gardens belong to various owners. They are the new lives of those old fellows…” Xuan Kong Zi smiled. After which, he lifted his foot and walked to the top of the mountain. Xiao Yan’s group quickly followed behind him. It was possible to see some elderly figures amid the surrounding lush medicinal sea. These old men might appear like farmers growing medicinal ingredients, but Xiao Yan could sense an extremely powerful spiritual fluctuation coming from each of them. These old medicinal farmers had obtained a high level of attainment in terms of Spiritual Strength.</p><br/><p>They did not pay much attention to Xiao Yan’s unfamiliar face. Yao Lao by the side attracted many surprised gazes. Some old fellows stepped forward to greet Yao Lao along the way. Clearly, they had been acquainted with Yao Lao in the past.</p><br/><p>The group passed by a couple of mountain roads before they stopped at the peak of the mountain. Xuan Kong Zi’s group settled Xiao Yan and Yao Lao in a somewhat simple stone house before hurrying away. They were going to report the matter of the alliance.</p><br/><p>Xiao Yan and Yao Lao were aware that they could not rush this matter. Hence, the both of them sat in the house and rested. They waited for a couple of hours before Xuan Kong Zi finally returned with the other two in tow.</p><br/><p>“Two pieces of news, one is good and one is bad…”</p><br/><p>Xuan Kong Zi bitterly laughed after entering the house. He looked at Xiao Yan and said, “The good news is that we are able to gather five votes to support it…”</p><br/><p>Xiao Yan and Yao Lao’s attention was braced after hearing the good news. Five votes might not result in a victory, but it at least represented some hope.</p><br/><p>“The bad news is that in three days, the Main Elder Council will accept a new Elder. This new Elder will also possess one vote. Unfortunately, the one with the greatest chances of entering the Main Elder Council is also an extremely pedantic old fellow… you are acquainted with that old fellow.” Xuan Kong Zi’s eyes landed on Yao Lao as his words fell.</p><br/><p>Yao Lao frowned before asking, “Old demon Hou?”</p><br/><p>“Aye… it is that old fellow who did not see eye to eye with you.” Xuan Kong Zi helplessly continued, “Whether it is from his pedantic views or some other reason, he will definitely vote against the alliance if he becomes the new Elder. You had stepped on him during the Pill Gathering back then. This old fellow has been extremely displeased for many years…”</p><br/><p>“If you had not left the Small Pill Tower back then, you would have long since become an Elder of the Main Elder Council… we would not need to feel such a headache over this matter now.” Xuan Yi glanced at Yao Lao and spoke in a faint voice.</p><br/><p>Yao Lao could only bitterly smile when he heard these words.</p><br/><p>“What should we do now? If that old fellow really votes against the alliance, there is no hope for the alliance.” Tian Lei Zi asked in a deep voice.</p><br/><p>Xuan Kong Zi and Yao Lao became quiet after hearing him speak.</p><br/><p>“It is not totally hopeless. Won’t everything be fine if we don’t allow that old demon Hou to become a new Elder?” Xuan Yi suggested.</p><br/><p>“That is easy to say but difficult to do. Who in the Pill Tower Mountain can compete with old demon Hou? Old Yao might be able to, but he withdrew from the Pill Tower on his own accord back then. According to the rules, he does not possess the qualification to compete.” Xuan Kong Zi shook his head as he spoke</p><br/><p>Xuan Yi parted a lock of hair from her forehead and smiled a strange smile. Her eyes shifted to Xiao Yan.</p><br/><p>“Old Yao do not have the qualification to compete, but Xiao Yan does. He is the Pill Gathering champion and a potential successor to be the giant head of the Pill Tower. This status does give him the qualification to compete… it will just depend on whether he will be able to defeat old demon Hou. After all, that old fellow was someone who nearly took the Pill Gathering champion spot from Yao Chen back then.”</p><br/>\n</div>"}