{"title": "Chapter 1443: Killing Another As A Deterrent", "id": 1443, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1443-killing-another-as-a-deterrent", "volume_title": "Volume 15", "body": "<h1>Chapter 1443: Killing Another As A Deterrent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1443: Killing Another As A Deterrent</u></strong></p><br/><p>The battle in the star realm had ended in an overwhelming fashion as Xiao Yan exited his retreat. Xiao Yan and the Falling Star Pavilion’s reputation across the Central Plains would soar because of this big battle.</p><br/><p>He had fought three great Ban Sheng with his own strength resulting in two deaths and one injury. He had even ended up getting an elite Dou Sheng from the Hun clan to personally intervene in order to help the last elite Ban Sheng flee.</p><br/><p>The news of this battle caused the expressions of everyone who heard about it to change. In the eyes of many people, an elite Ban Sheng was a legendary existence, yet two of these experts, who seemed untouchable to an ordinary person, had been killed by Xiao Yan. Others were involuntarily shocked by these results. After this incident, no other factions in the Central Plains would easily underestimate this rising faction.</p><br/><p>Compared to the rise of the Falling Star Pavilion, the Profound River Alliance was in an incomparably dismal state. The only elite Ban Sheng in the Profound Sky Sect had been killed by Xiao Yan. The large group of experts who had followed the elite Ban Sheng to the star realm had ended up dying as well. Everyone was aware that the Profound River Alliance would face difficult times ahead. With their strength, they no longer had the ability to fight with the Falling Star Pavilion, especially after losing a peak expert like old demon Tian Ming.</p><br/><p>Under this panic, many sects that had joined the Profound River Alliance began to worry all day long. Some even hurriedly withdrew from the Profound River Alliance in an attempt to draw a clear line between them. These withdrawals ended up adding insult to injury to the Profound River Alliance. Its destruction was only a matter of time.</p><br/><p>While the Central Plains was in an uproar because of the big battle in the star realm, the Falling Star Pavilion appeared relatively quiet. They cleaned up the mess in the star realm during the first few days. This large scale attack by the Profound River Alliance had caused the Falling Star Pavilion to suffer significant losses, but these losses appeared insignificant when compared to the other party.</p><br/><p>This peacefulness lasted for three days before the revenge of the Falling Star Pavilion officially began.</p><br/><p>The retaliation of the Falling Star Pavilion was led by the Dou Sheng Xiao Yan and the Ban Sheng Yao Lao. The Profound River Alliance suffered a complete and miserable defeat. They had even failed to form an effective defense before the Falling Star Pavilion had occupied the headquarters of the Profound River Alliance, which was also the headquarters of the Profound Sky Sect. After the chief of the Profound Sky Sect was randomly killed by a slap from Xiao Yan, everyone understood that this Profound Sky Sect, which once possessed a ferocious reputation in the Central Plains, was finished…</p><br/><p>The Profound River Alliance did not even manage to last a day before everyone within the alliance began to scatter in panic. Those small sects, who had been using the name of the Profound Sky Alliance to conduct scams, instantly changed their stances. Not only did they not lend a hand when they saw members of the Profound River Alliance, they went all out to beat them when they were down. It appeared as though they were trying to show how much they hated the Profound River Alliance.</p><br/><p>The Falling Star Pavilion was unconcerned about these fence-sitters. After taking the Profound River Alliance headquarters, the large contingent began to separate and attack the stronger factions within the Profound River Alliance, like the Ice River Valley and the Wind Lightning Pavilion. These two factions had contributed to the attack on the Falling Star Pavilion. These fellows were like the teeth and claws of the Profound Sky Sect. They were naturally not let off.</p><br/><p>This time around, Xiao Yan and Yao Lao eliminated these sects as a deterrent.</p><br/><p>Wind Lightning Pavilion—</p><br/><p>Xiao Yan remained suspended in the sky. He looked at the extremely chaotic mountain that was encompassed by a sea of fire. An indifferent expression was in his eyes. He had lead an army from the Falling Star Pavilion here. Along the way, he had eliminated a couple of the claws and teeth of the Profound River Alliance. He did not show any mercy at this moment. He was clearly aware that the Falling Star Pavilion would have been many times more miserable given the methods of the Profound Sky Sect and the Hall of Souls if he had not left his retreat in time.</p><br/><p>Now was not the time to show mercy. The weak were food for the strong within the Central Plains. Only a powerful strength allowed one to survive!</p><br/><p>“Xiao Yan, my Wind Lightning Pavilion has a good relationship with the Heaven Demon Phoenix tribe. The Heaven Demon Phoenix tribe will definitely not let you off for daring to destroy my Wind Lightning Pavilion!” An elite Dou Zun from the Falling Star Pavilion smashed Lei zun-zhe until he flew back and spat out a mouthful of fresh blood. Lei zun-zhe’s eyes were vicious as they stared at Xiao Yan.</p><br/><p>“The Heaven Demon Phoenix tribe, huh…I will resolve my grudge with them in the future.” Xiao Yan observed Lei zun-zhe in an indifferent manner. When he had first arrived at the Wind Lightning Mountain Range, Lie zun-zhe appeared unreachable in his eyes. That person was an elite Dou Zun who could kill Xiao Yan by clenching his hand. However, both parties positions had switched.</p><br/><p>“My Falling Star Pavilion has twenty-eight experts who died to your hands. When you killed them back then, you should have understood that this day would come.”</p><br/><p>Xiao Yan lowered his head. He slowly extended his hand and aimed it at Lei zun-zhe.</p><br/><p>Lei zun-zhe’s face was shocked upon seeing Xiao Yan lift his arm. He activated the Three Thousand Lightning Movement to its limit and many after-images appeared in the sky.</p><br/><p>“Three Thousand Lightning Movement, huh…”</p><br/><p>Xiao Yan faintly laughed when he saw the many after-images. His hand was gently clenched.</p><br/><p>“Bang!”</p><br/><p>Space itself immediately collapsed after his hand was clenched. An after-image in the distance suddenly stopped as a dense blood shot out. Lei zun-zhe did not even emit a miserable screech as he turned into mincemeat.</p><br/><p>Xiao Yan slowly withdrew his hand. He did not even glance at the cluster of blurry flesh. With a sweep of his eyes, a Falling Star Pavilion Elder quickly hurried over. He used a respectful voice to say, “Junior pavilion chief, we have managed to gain some information regarding the Han clan as you have instructed. For some unknown reason, they have been suppressed by the Wind Lightning Pavilion over the years. Currently, their clan’s strength has already shrank by ninety percent. They could only be considered a second tier clan in Tianbei City. Their lives are quite miserable…”</p><br/><p>Xiao Yan was slightly startled upon hearing this. He immediately became quiet as an apology flashed in his eyes. He had a pretty good idea why the Han clan had been suppressed by the Wind Lightning Pavilion. It was most likely because they had been close to him back then. He had been busy training these years and had forgotten the trouble he had brought them.</p><br/><p>“Have you already sent some people over?”</p><br/><p>Xiao Yan softly sighed. He was not an ungrateful person. If Han Xue had not rescued him when he had first arrived in the Central Plains, he might have ended up dying in the desert. Although he had helped the Han clan crush the imposing Hong clan within the Tianbei City, the Han clan was then suppressed by the Wind Lightning Pavilion until it fell from a top tier faction to its current desolate state.</p><br/><p>“Elder Gan three-man team has already headed over!” That Elder from the Falling Star Pavilion respectfully responded.</p><br/><p>Xiao Yan slightly nodded. His eyes glanced at the northern sky. Both of his hands were placed behind him as he became quiet.</p><br/><p>Tianbei City, Han clan—</p><br/><p>“Bang!”</p><br/><p>The eyes of everyone from the Han clan were stunned as they looked at the three old men who had suddenly appeared. Their auras were so mighty that they were terrifying. A random wave of a sleeve was all it took to send a few experts out of the courtyard with blood flowing from their mouths. Those few experts had come to the Han clan to find trouble. They lay on the ground with unknown fates.</p><br/><p>“I am Han Chi, the head of the Han clan. May I know the reason for these Elders’ visit…”</p><br/><p>A middle-aged man with some white hair carefully stepped forward and respectfully inquired.</p><br/><p>Two tall and beautiful ladies stood on either side of the man. The lady on the left had long silver hair. Her lovely body appeared well-proportioned as she gave off a cold vibe. The lady on the left seemed slightly younger. Her pretty appearance revealed her extraordinary demeanor. Both of these ladies were naturally Han Yue and Han Xue from the Han clan. They were the first acquaintances Xiao Yan had found after arriving in the Central Plains.</p><br/><p>“Ha ha, clan head Han need not be so courteous. The three of us are from the Falling Star Pavilion. This time around, we have come on the orders of the junior pavilion chief. May I know if clan head Han is interested in expanding the Han clan by becoming the next ‘Wind Lightning Pavilion’ in this northern region?” A white-haired old man smiled as he inquired.</p><br/><p>“Falling Star Pavilion?”</p><br/><p>Everyone from the Han clan was stunned.</p><br/><p>“It’s him…” Han Xue muttered. Her lovely figure trembled while she stood behind Han Chi.</p><br/><p>“It’s Xiao Yan.” Han Yue by the side also hurriedly recovered and softly explained.</p><br/><p>This name was too well-known across the Central Plains…</p><br/><p>“The Wind Lightning Pavilion will no longer exist in this northern region in the future. If the Han clan is interested, you can replace it. The three of us will do our best to help.” The Falling Star Pavilion Elder laughed.</p><br/><p>Han Chi was momentarily startled upon hearing these words. His body intensely trembled as a wild joy filled his face. The Falling Star Pavilion was soaring within the Central Plains. If their Han clan could hop onto this large tree, they would not even to bother about the old Wind Lightning Pavilion, much less the other clans.</p><br/><p>“Ha ha, clan head Han, please rest assured that junior pavilion chief has personally mentioned this. There is no mistake…” That Elder laughed after seeing Han Chi’s excitement grow.</p><br/><p>“Did he not come?” Han Xue bit her lower red lip with the back of her teeth. Her bright eyes looked at the Elder as she softly asked.</p><br/><p>That Elder from the Falling Star Pavilion hesitated for a moment after hearing her question. He shook his head. With his eyesight, he was naturally able to tell that the young lady possessed some feelings for the junior pavilion chief, but he did not know whether these feelings were one-sided or mutual. Hence, he did not dare to slight her. He quickly took two jade bottles from his Storage Ring and handed them to Han Xue and Han Yue before saying, “The junior pavilion chief instructed me to give these to you ladies. The junior pavilion chief has also requested me to thank Miss Han Xue for rescuing him back then.”</p><br/><p>Han Xue’s originally bright eyes dimmed as she stared at the jade bottle. She quietly nodded and took the jade bottle. Without speaking, she turned around and left. Han Yue by the side could only sigh after seeing her leave. She followed Han Xue out of the room before hugging her soft delicate waist. She always knew that this younger sister of hers had some feelings for Xiao Yan, but Xiao Yan was too dazzling.</p><br/><p>Han Yue lowered her head slightly and looked at Han Xue’s curled red lips. She could see a stubbornness on Han Xue’s face. This stubborn girl was unwilling to give up even at this stage. Han Yue could only softly sigh. That kind of man was not someone women like them could subdue…</p><br/>\n</div>"}