{"title": "Chapter 1441: Hun clan Dou Sheng", "id": 1441, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1441-hun-clan-dou-sheng", "volume_title": "Volume 15", "body": "<h1>Chapter 1441: Hun clan Dou Sheng</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1441: Hun clan Dou Sheng</u></strong></p><br/><p>A dark-black arm was extended from the spatial crack. This arm was extremely shriveled and looked as though a layer of black skin had been wrapped around some bones. That dry skin vaguely revealed some strange lines that emitted a black aura…</p><br/><p>The appearance of this arm seemed to have caused the sky to become much dimmer. An unusual suction force spread from the arm’s hand that seemed like it could suck one’s soul into it.</p><br/><p>Xiao Yan’s expression had become grave the moment this black arm appeared. A thought flashed through his heart and the black plate surrounded by a ring of fire, floating a short distance away, suddenly emitted a ‘swoosh’ sound as it rushed over. It shrank to the size of a palm that adhered to his fist before he violently swung it forward.</p><br/><p>“Bang!”</p><br/><p>The black plate surrounded by a ring of fire heavily collided with the dark-black hand. A dense black light immediately shot out and wrapped around that arm.</p><br/><p>“Sizzle sizzle!”</p><br/><p>The owner of the shriveled arm was quite cautious as this black light ray shot out. The black lines on the skin of the arm hurriedly wiggled. They appeared like a waking poisonous snake before they rushed out to deal with the black light ray. After which, the two of them ruthlessly collided and quietly annihilated each other...</p><br/><p>“Clang!”</p><br/><p>After the two attacks annihilated each other, the black arm was suddenly extended and forced that black plate back. It then grabbed Gu You. The spatial crack quickly expanded and a suction force surged from it. It was quickly sucking Gu You in.</p><br/><p>“You wish to leave?”</p><br/><p>Xiao Yan’s eyes were slightly cold after seeing Gu You be pulled away. Although he did not understand why this Hall of Souls Dou Sheng refused to show himself, he did not wish to allow this person to successfully rescue Gu You, so Xiao Yan took a couple of steps forward and pressed his finger on Gu You’s body with lightning-like speed. Gu You’s skin ended up being blasted apart. The powerful Dou Qi covering the surface of his body did not manage to hinder this sharp hot wind.</p><br/><p>“Ah!”</p><br/><p>Gu You let out a miserable screech after Xiao Yan created a couple of bloody holes in his body. His face was ashen.</p><br/><p>“Stay here!”</p><br/><p>Xiao Yan coldly laughed as Gu You let out a miserable cry. He swung his finger toward Gu You’s forehead like a thunderbolt. If he struck Gu You, that frightening force would pop Gu You like a watermelon that had smashed against the ground.</p><br/><p>“Hmph, you of the younger generation are really going overboard!”</p><br/><p>A elderly cry finally reverberated from the dark-black spatial crack as Xiao Yan attempted this killing blows. The black arm tighten its grip on Gu You’s shoulder and swiftly pulled him into the crack. At the same time, that mysterious Dou Sheng extended a black finger that collided violently with Xiao Yan’s finger.</p><br/><p>“Bang bang bang!”</p><br/><p>A frightening storm rippled from the point of contact as the two fingers collided. The empty space within a thousand feet was shaken until it crumbled!</p><br/><p>“Bam bam!”</p><br/><p>Xiao Yan ended up being forced back a couple of steps after the two fingers clashed. His eyes were ice-cold as he looked at the dense-black hand. A moment later, that black hand became purple-red, likely as a result of the Heavenly Flame.</p><br/><p>“Little fellow, you should not feel pleased. My Hun clan has made a mistake by allowing you to become this strong, but do not think that my Hun clan is afraid of you just because you have reached the Dou Sheng class. If you wish to rescue your father Xiao Zhan, then you should head to the Hun realm. The old me awaits you!” Black air lingered around the black hand as it quickly withdrew into the spatial crack. At the same time, a dark elderly voice was transmitted into the star realm.</p><br/><p>“Rest assured. I will head to the Hun realm sooner or later!”</p><br/><p>Xiao Yan looked at the dark-black spatial crack and coldly laughed. He did not recklessly charge into the crack. No one doubted just how powerful the Hun clan was. He might have reached the Dou Sheng class, but it did not mean that he could act fearless. Back then, his ancestor Xiao Xuan had been a peak Dou Sheng, but he still ended up defeated by a group from the Hall of Souls. Even less needed to be said about Xiao Yan, who was only at the one star Dou Sheng. Of course, he might be afraid in his heart, but he would not act weaker than the other party. He did not lose this verbal engagement.</p><br/><p>“How arrogant. If something wasn’t restricting me, this elderly-self would have appeared and killed you today to avoid any future trouble…” The person in the spacial crack was clearly furious because of Xiao Yan’s cold laughter. He ceased speaking as a black air surged from the spatial crack line. After which, the crack line rapidly shrank in front of many people’s eyes. It eventually disappeared.</p><br/><p>“Xiao Yan, regardless of how you struggle, you will eventually end up a prisoner of my Hun clan. That was the fate of your ancestor. You will not be able to escape!”</p><br/><p>A vague voice passed through the closing space and was slowly transmitted into Xiao Yan’s ears just as the spatial crack disappeared.</p><br/><p>Xiao Yan’s expression was cold and indifferent as he stared at the spot where the spatial crack had vanished. His eyes flickered. The Hun clan’s experts were indeed strange and unpredictable. The space of the star realm had been locked by him earlier. Unexpectedly, it had still been penetrated by that Hun clan Dou Sheng, who ended up rescuing Gu You.</p><br/><p>“That person earlier was likely an existence at the peak of the one star Dou Sheng class. I wonder if he is the so-called First Tianzun…” Xiao Yan pondered the thought. At this moment, he was only at the initial level of a one star Dou Sheng. He was still much weaker when compared to that person earlier, but with the help of his Heavenly Flame’s strength, Xiao Yan would not be afraid of him even if they were to fight.</p><br/><p>“Now that I have broken through to the Dou Sheng class, the Hun clan will not ignore me like they did in the past. If they really want to perform some tricks, they will dispatch a true expert.” Xiao Yan’s eyes flashed. His heart also became a little more cautious. He guessed that a truly intense battle would erupt the next time he would meet the people from the Hun clan.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan softly exhaled in his heart. He turned around and looked at the Falling Star Pavilion disciples and Elders. At this moment, all of them had been shaken by the frightening battle from earlier to the point of being completely silent.</p><br/><p>“All Elders will return to your duties. Clean up this mess. Those with injuries should swiftly recuperate. All disciples should continue your activities as usual…” Xiao Yan looked over the entire star realm from high above. His faint voice appeared in everyone’s ears.</p><br/><p>“Understood!”</p><br/><p>Everyone hurriedly and respectfully cried out after hearing these orders. After this battle, Xiao Yan’s reputation within the Falling Star Pavilion had undoubtedly reached a peak. A true Dou Sheng’s strength was enough to make everyone present willingly submit.</p><br/><p>Xiao Yan moved after seeing the separating human traffic. He once again appeared on the square. At this moment, the expressions of Yao Lao, Cai Lin, and the others were much better, likely because of the medicinal pills.</p><br/><p>“Teacher, Cai Lin, are you alright?” Xiao Yan quickly stepped forward and asked.</p><br/><p>“Ha ha, I’m fine…” Yao Lao waved his hand. His eyes were pleased as they swept over Xiao Yan. A smile that could not be hidden was present on his face.</p><br/><p>“The current you has finally surpassed your teacher…” Yao Lao softly sighed in an emotional manner. When he had first met Xiao Yan, Xiao Yan was merely the trash of a humiliated clan. Over these years, that youth from back then had relied on a shocking perseverance to slowly arrive at this point. Only the youth himself was aware of the pressure and bitterness that he had experienced along the way.</p><br/><p>Time flies and that tender eagle had finally soared to the sky. At this moment, Xiao Yan had finally stepped onto the peak of this Dou Qi continent!</p><br/><p>A giant and an alchemist guru…</p><br/><p>The achievements of this youth, who had been described as trash back then, would cause the most perfect genius to pale.</p><br/><p>“The person who had intervened earlier should be a Hall of Souls Dou Sheng, right?” Yao Lao lifted his head and asked.</p><br/><p>“That’s right, he is very strong, but he seemed to be worried about something and did not dare to appear.” Xiao Yan nodded and replied in a somewhat uncertain voice.</p><br/><p>Yao Lao full of doubt. If that Hun clan Dou Sheng attacked earlier, Xiao Yan would have ended up in a bitter fight, but the surprising thing was that the Dou Sheng only stubbornly rescued Gu You. He had refused to reveal himself regardless of how Xiao Yan provoked him...</p><br/><p>“It is likely that that person is restrained by something…” Yao Lao could only say this after giving it some thought.</p><br/><p>Xiao Yan slightly nodded, but he did not remain entangled by this topic. He softly said, “Let’s return to the hall first. After that, please tell me about what has occurred during these two years…”</p><br/><p>“Aye.’</p><br/><p>Yao Lao nodded. He stood up with Xiao Yan supporting his arm. After which, the group swiftly hurried to the main hall of the Falling Star Pavilion.</p><br/><p>Yao Lao, Xiao Yan, and the rest sat around the large main hall. After which, Xiao Yan quietly listened to the Little Fairy Doctor and the rest describe what had happened during these two years.</p><br/><p>“Profound River Alliance, huh…”</p><br/><p>A chill flashed across Xiao Yan’s face after he heard that the Profound River Alliance had been formed by the Profound Sky Sect and some other factions.</p><br/><p>“Today, old demon Tian Ming has been killed by your hands. Moreover, a large number of experts from the Profound River Alliance died here, so they will not be a threat in the future, but we will appear too weak if we do not seek revenge. Therefore, I will personally lead our people to destroy them once the mess in the star realm has been cleaned up. None of the factions that joined the Profound River Alliance will be let off!” A cold glint flashed through Yao Lao’s eyes. If Xiao Yan had not exited his retreat in time, the Falling Star Pavilion would have been destroyed by the Profound River Alliance.</p><br/><p>Xiao Yan slightly nodded. His finger gently knocked on the table. A moment later, he slowly said, “The Profound River Alliance is already an insignificant threat. However, with the strength of our Falling Star Pavilion, we are still unable to fight the Hall of Souls. It looks like we need to take a hint from the Profound Sky Sect and establish a truly large alliance!”</p><br/>\n</div>"}