{"title": "Chapter 1458: Underground Serene Snake Network", "id": 1458, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1458-underground-serene-snake-network", "volume_title": "Volume 15", "body": "<h1>Chapter 1458: Underground Serene Snake Network</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1458: Underground Serene Snake Network</u></strong></p><br/><p>Commander Qin’s body trembled after seeing Xiao Yan become furious. He hurriedly shut his mouth.</p><br/><p>“It looks like Zi Yan is in a bad situation…” Cai Lin hurried forward and spoke with knit brows. “Shall we hurry to the empty realm and help them?”</p><br/><p>Xiao Yan’s eyes flickered. He shook his head a moment later and said, “There is no hurry now. As long as the experts from the Heaven Demon Phoenix tribe and the Nine Serene Deep Ground Python tribe do not head to the empty realm, Zi Yan should be able to hold on. We need to delay the Heaven Demon Phoenix tribe and the Nine Serene Deep Ground Python.”</p><br/><p>Cai Lin gently nodded and ceased speaking upon hearing this plan.</p><br/><p>After making up his mind within his heart, Xiao Yan once again got some information from commander Qin’s mouth. He was only willing to let the matter rest after commander Qin no longer had anything to say.</p><br/><p>“Can you now let us off? I have already told you all that you wish to know.” Commander Qin weakly spoke. Most of the blood within his body had already been lost. He would really become a cripple if this continued.</p><br/><p>Xiao Yan indifferently swept his eyes over commander Qin. His fingers pressed against the air and instantly sealed the Dou Qi within the bodies of those few individuals. He waved his sleeve and threw them into a dark gap in the deep abyss. There was a countless number of tunnels in this abyss. Even the Nine Serene Deep Ground Python tribe was unable to clearly tell where every tunnel led. These people were thrown inside with their Dou Qi sealed. Whether they survived would depend on their luck.</p><br/><p>“Let’s go. We will head to the Nine Serene Spring.”</p><br/><p>Xiao Yan did not remain any longer after dealing with those few people. He waved his hand and took the lead as he rushed deeper underground. Cai Lin, the Little Fairy Doctor, and Cai Lin followed close behind.</p><br/><p>The terrain of the underground world was extremely complicated, but Xiao Yan’s group was already well prepared for their trip. They had procured a detailed map. Hence, within an hour, they had reached the underground world. They travelled around a couple of snake-people tribes and finally reached the main area of the Nine Serene Deep Ground Python within half an hour or so, the underground Serene Snake network.</p><br/><p>The underground Serene Snake network was where the headquarters of the Nine Serene Deep Ground Python was located. It was a holy site in the hearts of many of the snake tribes. Being a holy site, this underground Serene Snake network was naturally well-guarded. Even an ordinary snake-person would not be able to enter.</p><br/><p>“It is indeed worthy of being one of the three big tribes of the Magical Beast world. There are really many experts within this mountain range.”</p><br/><p>Xiao Yan’s group appeared on a hill near the underground Serene Snake network. Their eyes looked at the mountain range in the distance as they muttered to themselves.</p><br/><p>“It is unexpected that I am able to see the snake-people tribe in this place. Moreover this size is many times larger than my tribe…” Cai Lin was also a little surprised as she looked at the crowded snake-people tribes on the plains and exclaimed. “I once read the genealogy of the tribe. My tribe moved to the Vast Tager Desert a long time ago, but I do not know if we came from this Beast Region.”</p><br/><p>Xiao Yan smiled. Hie eyes slid over the deeper parts of the underground network as he said, “The Nine Serene Spring should be in the deepest part of the underground network, but there are many hidden experts present in that place. There are even some Ban Sheng class experts. It would be a little troublesome if we disturb them, so all of you should hide your auras.”</p><br/><p>“Understood.”</p><br/><p>Cai Lin’s group nodded after hearing Xiao Yan’s orders. The Nine Serene Deep Ground Python was quite strong. Their group had ventured into the other party’s territory. Even though Xiao Yan possessed a Dou Sheng strength, he would probably not have an easy time if they were discovered.</p><br/><p>“Swish!”</p><br/><p>Xiao Yan waved his sleeve. The space around him quickly became distorted before firmly wrapping around everyone. The space fluctuated and everyone strangely disappeared.</p><br/><p>The current Xiao Yan had already advanced into a peak level existence in this world. He could use spatial strength with great proficiency now. He could even walk within the empty realm. Although Xiao Yan was bringing three people with him, it did not exhaust him too much. Hence, he shuttled through space and hurried toward the underground Serene Snake network. They did not attract any special attention along the way.</p><br/><p>While Xiao Yan approached the deepest parts of the underground Serene Snake network, he sensed the auras of the experts inside becoming stronger. There were even even some Spiritual Perceptions that possessed some doubt when they swept over the space where he hid. It was likely that they had sensed something. Fortunately, these simple sweeps did not expose Xiao Yan’s group.</p><br/><p>With the help of Xiao Yan’s spatial abilities, their group narrowly dodged the detection of many experts along the way. They quietly entered the deepest parts of the underground Serene Snake network.</p><br/><p>There was an enormous black abyss in the deepest parts of the underground Serene Snake network. This abyss was a thousand feet wide and appeared bottomless. A shockingly dark and cold aura continued to whiz up from deep below like a gale. An ordinary expert would feel one’s blood and Dou Qi freeze if one stood at this spot.</p><br/><p>The bottom of this deep abyss hid the Nine Serene Deep Ground Python’s holy pool, the Nine Serene Spring. It was also the destination of Xiao Yan’s group.</p><br/><p>There were few defenses within the deep abyss because everyone understood that the dark and cold gales that continuously blew from the deep abyss were natural guards. Even Dou Zong class experts would not dare to easily venture deep into it.</p><br/><p>“Chi!”</p><br/><p>The air above this place suddenly distorted while a dark and cold wind blew. A couple of figures appeared. They were naturally Xiao Yan’s group.</p><br/><p>Xiao Yan glanced at the deep abyss after appearing. He smiled but did not linger. His sleeve was waved once again, and a dense spatial force wrapped around the group. It forcefully broke through the extremely cold gale and rushed to the bottom of that black abyss.</p><br/><p>The abyss was extremely deep. Even with Xiao Yan’s speed, he only managed to see the ground of the abyss after around ten minutes or so. An extremely huge lake appeared in his eyes as he approached the ground. A dark and chilly aura that could freeze the Dou Qi within one’s body spread from it.</p><br/><p>The lake was extremely huge. The water in it was deep-yellow. There seemed to be a traces of a fresh-blood-like luster flowing within this deep-yellow color. Wisps of pale-yellow vapor mixed with the faint blood and then seeped out of it. Finally, the vapor rose and whizzed to the sky.</p><br/><p>“This is the legendary Nine Serene Spring.”</p><br/><p>Xiao Yan sighed in relief after looking at the yellow lake. He slowly approached it. He was able to sense an obscure dark and cold energy entering his body the closer he got to the Nine Serene Spring.</p><br/><p>“This place is too dark and chilly. Even Nine Serene Deep Ground Pythons will not be able to endure this for long. Hence, no one will come to this place unless there is a special circumstance. This gives us sufficient time.” Little Fairy Doctor softly spoke. She was a great distance from the lake. The dark and cold force in this place caused even her to feel extremely terrible.</p><br/><p>Xiao Yan nodded. He finally stopped beside the Nine Serene Spring and bent down. His hand touched the lake, only to immediately hear a sizzling sound. A deep-yellow icy crystal began to swiftly climb up his arm.</p><br/><p>“It is indeed strong. No wonder even teacher has said that he is unable to reach the bottom of this spring.”</p><br/><p>Xiao Yan was slightly startled after sensing how terrifying the dark and cold force of this Nine Serene Spring was. His Heavenly Flame began to circulate within his body. It finally seeped out and quickly melted the ice layer.</p><br/><p>“Cai Lin, I will enter the bottom of the spring and obtain the Spring Blood Crystal. You should enter the spring once I succeed. I will help guard you.” Xiao Yan swung his fist, turned his head, and spoke to Cai Lin beside him. Only Xiao Yan and Cai Lin were able to approach this spring among their group. Xiao Yan was able to approach it because of his strength and the Heavenly Flame while Cai Lin could naturally approach it because of her constitution.</p><br/><p>“Aye. You should be careful. Just pull back if you cannot do it.” Cai Lin slightly nodded and worried about him in a grave voice. The dark and cold force of this Nine Serene Spring was too frightening. It was difficult to imagine that such an extreme cold could exist in this world. She had initially doubted Yao Lao when she heard him say that this place could allow her to advance to a Nine-Colored Heaven Swallowing Python. However, now she understood that this was a real possibility.</p><br/><p>Xiao Yan nodded. He was currently a genuine Dou Sheng. With four types of Heavenly Flame guarding him. He did not believe that he would not be able to resist the Nine Serene Spring’s dark and chilly force.</p><br/><p>“All of you should hide yourselves while I am in the Nine Serene Spring to avoid being discovered by others.” Xiao Yan once again spoke to the Little Fairy Doctor’s group behind him. Without wasting any time, a rich Heavenly Flame began to swiftly seep out of a countless number of pores on his body. A frightening high temperature made contact with the cold vapor, and a white fog began to erupt in all directions.</p><br/><p>“Splash!”</p><br/><p>Xiao Yan softly sighed with a grave expression after summoning the Heavenly Flame. His body moved, and he charged into the Nine Serene Spring. After which, he rushed to the bottom of the spring with lightning-like speed.</p><br/><p>“Sizzle sizzle!”</p><br/><p>A white smoke rose after Xiao Yan leaped into the Nine Serene Spring. Gurgling bubbles continued to appear. Clearly, this was a result of the Heavenly Flame.</p><br/><p>Cai Lin beckoned with her hand and scattered that white smoke pillar. She only sighed in relief after the smoke ceased appearing. Her pretty eyes landed on the Little Fairy Doctor and Qing Lin as she said, “We should hide ourselves first and discuss what to do after Xiao Yan comes out…”</p><br/><p>“Aye.”</p><br/><p>The Little Fairy Doctor and Qing Lin nodded after hearing his words. Both of their bodies flashed as they hurried into the surrounding darkness. Their auras were also suppressed.</p><br/><p>Cai Lin also withdrew into the darkness by the side after seeing the Little Fairy Doctor and Qing Lin hide. The area around the Nine Serene Yellow Spring once again became completely silent. The occasional sound of rushing wind appeared in the sky far above. Fortunately, no one ventured into the deep abyss to probe…</p><br/>\n</div>"}