{"title": "Chapter 1467: Soul Battle", "id": 1467, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1467-soul-battle", "volume_title": "Volume 15", "body": "<h1>Chapter 1467: Soul Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1467: Soul Battle</u></strong></p><br/><p>“Back then, I had once tried to obtain the ‘Yellow Spring Divine Anger’ training method and the Demon Saint essence blood within the stone tablet. However, my Spiritual Strength had only just entered the stone tablet when it was struck and I coughed up blood in defeat. I had to recuperate for half a year in order to recover.”</p><br/><p>Yao Ming softly sighed after seeing Xiao Yan’s grave expression. His eyes wandered over the stone tablet with some fear as he said, “Even though my current strength is many times greater than back then, I have a feeling that my fate would not be any better even if I made another attempt now.”</p><br/><p>“The stone tablet does indeed contain an extremely powerful Spiritual Strength. That Spiritual Strength also seems to possess a kind of mysterious pressure. If I guess correctly, the attainments of that Demon Saint Huang Quan in the training of his soul had likely reached a relatively frightening level.” Xiao Yan nodded slightly and replied.</p><br/><p>“How can someone half a step in the Dou Di class be a simple person?” Yao Ming bitterly laughed. He immediately asked, “How is it? Brother Xiao Yan, are you confident?”</p><br/><p>“I am not confident, but I can make an attempt.”</p><br/><p>Xiao Yan’s eyes stared at the stone tablet only to shake his head and reply. Although the gap between he and Demon Saint Huang Quan was like the sky versus a stream, there was only the spiritual remains of the Demon Saint Huang Quan within the stone tablet. It was difficult to predict the victor if they were to clash.</p><br/><p>“Since this is the case, I will have to rely on brother Xiao Yan.” Yao Ming rejoiced after hearing this reply. “You should leave as soon as possible if you discover anything wrong.”</p><br/><p>“Aye,”</p><br/><p>Xiao Yan gently nodded. His body moved before he appeared on a stone seat in front of the stone tablet. He slowly sat down while the soul beneath his brows began to move.</p><br/><p>“Do not allow anyone to disturb me during this period of time…”</p><br/><p>Xiao Yan softly spoke. His body shook a little before a somewhat illusory figure stepped out of his brow. Finally, it was stopped in front of the stone tablet.</p><br/><p>Yao Ming quietly praised Xio Yan after seeing that his soul take a human form similar to his actual body. The matters of the soul were far too illusory and ethereal. Dou Qi had ended up dominating the continent. There were very few experts who would place much emphasis on the training of one’s soul. Although the soul was the foundation of a person, it couldn’t obtain a dominating effect when fighting with others without a special method, which was disproportional to the effort and time required to practice it. Hence, most expert’s Spiritual Strength could merely be called an ordinary level. It was impossible for them to turn their illusory soul into an actual body of substance like Xiao Yan could.</p><br/><p>Xiao Yan’s spiritual body was suspended in front of the stone tablet. His eyes scanned the tablet. It was a long while later before he took a step forward in front of Cai Lin’s group. The somewhat illusory body collided with the stone tablet.</p><br/><p>“Chi!”</p><br/><p>The surface of the ancient tablet seemed to form a circular ripple like a liquid the moment the two collided. Xiao Yan’s soul also appeared as though it had been devoured and strangely disappeared in front of the stone talisman.</p><br/><p>“Rumble!”</p><br/><p>Thunderbolts roared like a storm in the air, containing an ancient aura. The loud sound shook the square until it trembled.</p><br/><p>“Is this the hidden space within the stone tablet…”</p><br/><p>Xiao Yan’s body floated in air. He glanced around this unusual space and surprise flashed across his eyes. After which, he looked into the distant to what appeared to be the edge of this space.</p><br/><p>“This Demon Saint Huang Quan really lives up to his reputation by being able to create a realm in the stone tablet…”</p><br/><p>Xiao Yan softly sighed and gently stepped on air. He slowly walked deeper into the created space. The thunderbolts in the sky appeared as though they were being stirred while his legs moved. They suddenly struck him from all directions, but Xiao Yan’s expression did not change as this attack came. His footsteps did not falter. Any bolt of lightning that reached a fifty-foot-radius around his body suddenly shattered by an invisible force. It was as though he was within a protective barrier.</p><br/><p>“Bang!”</p><br/><p>Those thunderbolts seemed to be aware that there was nothing they could do to stop Xiao Yan as he continued to venture deeper. Hence, they gradually came to a halt. A deep-yellow cloud layer suddenly surfaced in the sky above Xiao Yan when the final thunderbolt vanished. Soon after, an extremely powerful gale suddenly tore through the air and violently pressed down on him.</p><br/><p>“Yellow Spring Finger…”</p><br/><p>Xiao Yan’s feet slowly paused. He lifted his head and looked at the enormous finger, tearing through the sky from the layer of clouds. A slight ripple appeared in his eyes as he gently waved his sleeve. A vast and mighty Spiritual Strength immediately surged out. It turned into a huge finger that finally smashed into that Yellow Spring Finger with a rumbling sound.</p><br/><p>“Bam!”</p><br/><p>The space fluctuated as the two collided, but there was no energy explosion. The two collapsed upon contact and were both annihilated.</p><br/><p>“Bang!”</p><br/><p>The Yellow Spring Finger had only just shattered when the ground under his feet suddenly cracked apart. A huge yellow hand rushed out with lightning-like speed. It appeared below Xiao Yan in a flash. The hand was clenched and firmly grasped Xiao Yan</p><br/><p>“Shatter”</p><br/><p>A calm voice was slowly emitted from within the large hand. A powerful spiritual storm swept out in an instant, shaking the hand until it broke apart.</p><br/><p>“Demon Saint Huang Quan, reveal yourself. These techniques will not be able to defeat me…”</p><br/><p>Xiao Yan once again appeared after the huge yellow palm was destroyed. He lifted his head and looked into the distance. His faint voice was just like thunder as it spread through the realm.</p><br/><p>“Rumble!”</p><br/><p>A mountain broke through the ground not far in front of Xiao Yan soon after the his voice was emitted. It pulled the ground up as it rose. Finally, it stood above in a towering fashion. There was an enormous throne on the top of the mountain. A human figure in yellow clothes sat upright on it while an aura that caused even the world to tremble slowly spread.</p><br/><p>“Young fellow, this is not a place that you should have come to. Go back.”</p><br/><p>The faint voice contained a pressure that seemed to originate from one’s very soul as it was slowly transmitted into Xiao Yan’s ear. Numerous ripples spread from Xiao Yan’s body when he heard this voice.</p><br/><p>Xiao Yan’s eyes focused on the figure on the throne. A moment later, a smile danced on his lips as he said, “Although you were once a peak level expert in this world, you are now a stubborn thought of a remnant soul left behind. “</p><br/><p>“Thief, you actually dare to behave rudely in front of me!”</p><br/><p>The human figure seated on the throne suddenly widened his eyes upon hearing Xiao Yan’s words. An extremely strong spiritual strength surged with lightning-like speed. It ruthlessly shot toward Xiao Yan like a blade.</p><br/><p>“Useless little tricks.”</p><br/><p>Xiao Yan smiled after seeing this attack. His body advanced instead of pulling back. He waved his sleeve. A majestic spiritual fluctuation spread and blocked Demon Saint Huang Quan’s spiritual attack.</p><br/><p>“I will leave immediately if you hand over the training method for the Yellow Spring Diving Anger and the Demon Saint essence blood!”</p><br/><p>“You should defeat me before thinking of getting your hands on the Yellow Spring Divine Anger and essence blood.”</p><br/><p>Demon Saint Huang Quan suddenly stood up. The area surrounding the mountain collapsed the moment he got up. “Advanced heavenly state soul. You are the strongest person that I have met in so many years. Unfortunately, you still have a large ways to go to the perfect heavenly state. My soul has already surpassed the perfect heavenly state and has reached the Di state! You actually dare to fight me!”</p><br/><p>“Di state?”</p><br/><p>Xiao Yan’s violently heart pounded upon hearing these two words. Some shock surfaced in his eyes. This was the first time that he had heard of someone attain a spiritual strength at the Di state. Hardly anyone within the current Dou Qi continent would able to reach this state. The Demon Saint Huang Quan did indeed live up to his reputation.</p><br/><p>“I will really would not dare to fight you if you were Demon Saint Huang Quan. However, you are currently a mere remnant spirit!”</p><br/><p>Xiao Yan slowly inhaled a breath of air. His foot suddenly stepped in front of him as his body swelled thousands of feet in an instant. It was just like a giant that stood between the sky and the earth. The giant looked down on Demon Saint Huang Quan before clenching his large fist and violently throwing a punch.</p><br/><p>“What rudeness!”</p><br/><p>Demon Saint Huang Quan suddenly lifted his head and let out a furious roar. Both of his palms suddenly pressed against the ground. The land of this realm immediately trembled before it split apart. Numerous large hands broke free from the ground. They violently smashed into the spiritual giant’s body that Xiao Yan had formed.</p><br/><p>“Destroy!”</p><br/><p>The powerful attack caused Xiao Yan’s spirit to emit an intense ripple. Xiao Yan did not dare to underestimate his opponent, so he widened his mouth and a spiritual strength, which contained a strange heat, erupted. After which, it ruthlessly charged down. The countless numbers of large hands were shattered upon contact. Even the shaking ground ended up being suppressed.</p><br/><p>“Your Spiritual Strength actually possesses the power of a Heavenly Flame?”</p><br/><p>The expression of Demon Saint Huang Quan changed after contact was made. A strange hand seal formed with lightning-like speed. After which, he placed the hand seal beside his mouth. An unusually frightening fluctuation rose. Space itself crumbled as this fluctuation appeared. It appeared as though doom’s day was arriving.</p><br/><p>“Yellow Spring Divine Anger…”</p><br/><p>Xiao Yan’s expression became unusually grave when he sensed that fluctuation, which caused him to feel a little frightened. A fight between souls was even riskier than a fight between Dou Qi. If one was careless, one’s very soul would be shattered. If one’s soul was destroyed, one’s very life would vanish from this world.</p><br/><p>Demon Saint Huang Quan’s attack caused even Xiao Yan to feel a dangerous aura.</p><br/><p>The stories told about the Yellow Spring Divine Anger frightening many elite Dou Shengs was not just a mere rumors</p><br/>\n</div>"}