{"title": "Chapter 1460: Yao Ming", "id": 1460, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1460-yao-ming", "volume_title": "Volume 15", "body": "<h1>Chapter 1460: Yao Ming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1460: Yao Ming</u></strong></p><br/><p>Xiao Yan frowned as he studied the shriveled human figure. The figure struggled within the restraints of the metal chains. It was a long while later before Xiao Yan asked, “Who are you? Why have you been trapped here?”</p><br/><p>“Hu hu…”</p><br/><p>The skeleton-like human figure had exhausted a great amount of strength during the struggle earlier and had begun to pant. Xiao Yan could sense an extremely dark and cold energy being emitted from those four large metal chains, exhausting the figure’s Dou Qi. This caused the figure to remain in an extremely weak state, but it would not hurt his life. All this figure could do was live on the edge of his last breath amid this everlasting exhaustion.</p><br/><p>“Whoever trapped this fellow is really ruthless. This is even more vicious than directly killing him…” Surprise flashed across Xiao Yan’s heart. It was unexpected that he had stumbled across such a mysterious thing at the bottom of the Nine Serene Spring.</p><br/><p>“I am the tribe chief of the Nine Serene Deep Ground Python tribe, Yao Ming…” That skeleton-like human figure caught his breath for a moment before finally replying to Xiao Yan’s question. His voice was extremely hoarse. It was like a rock was scratching glass, an extremely ear-piercing noise.</p><br/><p>“Rescue me. As long as you rescue me, I will agree to any condition you propose!” The person who called himself Yao Ming stared at Xiao Yan with pleading eyes as he pleaded aloud.</p><br/><p>“The tribe chief of the Nine Serene Deep Ground Python tribe?” Xiao Yan frowned but remained unaffected by the plea. He replied in a faint voice, “From what I know, the tribe chief of the Nine Serene Deep Ground Python tribe should be someone called Yao Xiaotain, right?”</p><br/><p>“That offal, that bastard! He is the one who used an evil scheme to snatch my position and sealed me at the bottom of this Nine Serene Spring. Ah! That bastard. He has made me suffer simmering in this dark and cold force for centuries. If I am lucky to see the sky again, I, Yao Ming, will ensure he suffers a fate worse than death!” Yao Ming’s eyes immediately turned blood-red after the name Yao Xiaotian entered his ears. An endless hatred surged within his eyes. His crazy roar continued to reverberate around the bottom of the spring.</p><br/><p>Xiao Yan was quietly speechless upon hearing this cry. This fellow had been sealed in this place for centuries. This fate was indeed quite pitiful. The dark and cold force of the Nine Serene Spring was just like sharp blades as it invaded one’s body That piercing pain was something that an ordinary person could not endure, yet this person in front of him had suffered this bitterness for centuries. Even Xiao Yan involuntarily shook his head after learning this information.</p><br/><p>“Can you tell me about the relationship between you and that Yao Xiaotian?” Xiao Yan spread his hands and asked.</p><br/><p>“I am Yao Xiaotian’s elder brother by blood.” Yao Ming hesitated for a moment before speaking in a hoarse tone. “I should have been the true successor as the tribe chief of the Nine Serene Deep Ground Python tribe. Many of the Elders in the tribe favored me. It would normally have been impossible for Yao Xiaotian to be the tribe chief. He also understood this in his heart. Hence, he was usually extremely respectful to me, but he was secretly brewing an evil plot. He first poisoned me and then attacked me when my strength declined. Finally, he sealed me at the bottom of this Nine Serene Spring.”</p><br/><p>“Why did he not simply just kill you? That would save him a lot of trouble.” Xiao Yan asked.</p><br/><p>“That is because he does not even wish for my death to be easy… ha ha, this brother of mine really treats me unusually ‘well’!” Yao Ming could not help but break into a hoarse laughter after reaching this last sentence. His laughter was filled with his misery and his fury.</p><br/><p>Xiao Yan was quiet. Xiao Ding and Xiao Li were willing to sacrifice their lives to protect him. Hence, he he couldn’t even imagine how these two, who were brothers, ended up hating each other so much.</p><br/><p>“You wish for me to rescue you? You should understand that Yao Xiaotian is currently the clan head of the Nine Serene Deep Ground Python tribe. He will definitely be able to maneuver many Elders. Your fate will probably not be good once you appear.” Xiao Yan remarked.</p><br/><p>“I have the Nine Serene Profound Stick. This is a keepsake of the Nine Serene Deep Ground Python tribe’s chief. Only the true tribe chief can hold it. Once I escape and finish off Yao Xiaotian, I will be the new tribe chief. The other Elders will not dare to attack me!” Yao Ming hurriedly explained.</p><br/><p>“What is your strength like? How strong is that Yao Xiaotian?” Xiao Yan narrowed his eyes and asked.</p><br/><p>“I was merely an intermediate level Ban Sheng when I was sealed here. Simmering in the spring for centuries might have caused me to suffer an endless bitterness, but it has also allowed my strength to soar. I have reached the second star of the Dou Sheng class. If I am allowed to see sky again, the Dou Qi within my body will quickly recover and reach its peak state…” Yao Ming said. “Moreover, Yao Xiaotian was merely at the peak of the Dou Zun class while I was a Ban Sheng back then. With his talent, he has likely reached a one star Dou Sheng strength after so many years, but he has a trusted aid. It is the First Elder of the Nine Serene Deep Ground Python tribe. According to my guesses, this Elder should also possess the strength of a one star Dou Sheng by now. Back then, this old dog had also aided Yao Xiaotian in seriously injuring and sealing me.”</p><br/><p>“Two one star Dou Shengs?”</p><br/><p>Xiao Yan’s heart felt slightly shocked upon hearing this strength. This Nine Serene Deep Ground Python really did possess a strong foundation. It was possible to name two genuine elite Dou Sheng’s in the tribe. If one were to add this Yao Ming to the mix, there was a total of three of Dou Shengs. Such strength was indeed worthy of being present in one of the three largest tribes in the Magical Beast world.</p><br/><p>The thing that surprised Xiao Yan was that this Yao Ming was not as powerful as he had expected. This was perhaps due to his physical body. A Magical Beast was ultimately a little different from a human.</p><br/><p>“My greatest obstruction are these two people. The Nine Serene Deep Ground Python tribe will be controlled by me once they are eradicated. Young friend, you will be my savior. I, Yao Ming, might not be a kind and friendly person, but I keep my word… once I control the Nine Serene Deep Ground Python tribe, I will try my best to help fulfill any request you make.” Yao Ming’s eyes glittered as he looked at Xiao Yan and spoke in a deep voice.</p><br/><p>Xiao Yan clenched his fist under his sleeve, but he did not immediately replied. His eyes flashed. He had been thinking of a method to break the alliance of the three dragon islands and had also thought about finding some external parties to help Zi Yan ever since he heard what had happened. However, he had not come up with a good idea no matter how hard he thought. After all, the Nine Serene Deep Ground Python tribe was not a faction that the Profound Sky Sect could compare with. This tribe possessed a great strength. He might be able to fight with this tribe if he called some experts over from the alliance, but it would undoubtedly be a little difficult if Xiao Yan tried to handle this by himself.</p><br/><p>Xiao Yan had also heard about Yao Xiaotian. This person had indeed used all sorts of schemes to achieve his aims. He was also cold and ruthless. He was only concerned about what he could gain. Given his character, he would definitely agree to an alliance with the three dragon islands to fight against Zi Yan’s Eastern Dragon Island, but only if he gained a lot. At that time, Zi Yan would face many opponents. Even though she had an extremely rare dragon-phoenix constitution, she would not be able to handle all of them.</p><br/><p>However, if this Yao Ming could really gain control of the Nine Serene Deep Ground Python tribe, it would undoubtedly ruin the schemes of the three great dragon islands. Losing such reinforcement would undoubtedly be a great blow to them.</p><br/><p>“I cannot trust you.”</p><br/><p>This thought flashed within Xiao Yan’s mind for a moment before he finally lifted his head. He looked at Yao Ming and slowly shook his head. He knew too little about this Yao Ming. He was unable to comprehend Yao Ming’s character. If this person had become an ungrateful fellow after being rescued and ended up biting him, he would really end up feeling a great injustice.</p><br/><p>Hearing Xiao Yan utter these words, Yao Ming widened his mouth, but he was unable to say anything. He would not be able to get Xiao Yan to trust him after they had just met.</p><br/><p>“However, there is still a way to get me to rescue you. I can even help you snatch back your position as tribe chief after rescuing you. However, there is a condition…” Xiao Yan’s eyes flickered. He stared intently at Yao Ming as he uttered his proposition, “You will release your soul and allow me to place a spiritual imprint in it. If you lie to me, I will detonate the spiritual seal. At that time, you will definitely be seriously injured even if you are an elite Dou Sheng. Your strength will remain stagnant.”</p><br/><p>Yao Ming’s expression changed slightly after hearing this idea. This was equivalent to handing his life to another.</p><br/><p>“I can only trust you if you do this. If you refuse, I will simply turn around and leave immediately. Honestly speaking, I really do not wish to get involved in this mess.” Xiao Yan explained in a deep voice.</p><br/><p>Yao Ming tightly clenched his teeth. His eyes continuously flickered. His character was such that he did not wish to be restrained by another, but the fury and hatred in his heart swelled the moment he thought of the bitterness he had suffered over the hundreds of years. He quickly clenched his teeth and let out a low roar, “Alright, we will do as you say. I can no longer endure the hatred in my heart. I must tear that bastard into thousands of pieces!”</p><br/><p>“Alright!”</p><br/><p>Xiao Yan joyously cried out after hearing that Yao Ming had actually agreed to his proposal.</p><br/><p>“Hu…”</p><br/><p>Yao Ming inhaled a deep breath of air. A flicker flashed over his brow and an invisible Spiritual Strength surged out. Finally, it formed a large black snake in front of him.</p><br/><p>Xiao Yan smiled after watching Yao Ming take the initiative to summon his soul. His mind moved and a hint of a heated soul swiftly shot forth before it quickly invaded the forehead of that black giant snake. The snake’s body violently trembled the moment that spiritual imprint entered. The snake quickly scattered and returned to Yao Ming’s brow.</p><br/><p>Xiao Yan could sense Yao Ming’s spiritual fluctuation the moment his soul returned to his brow. All Xiao Yan needed was a thought and the spiritual imprint, which contained the strength of a Heavenly Flame, would explode and shatter Yao Ming’s soul into pieces.</p><br/><p>“That’s right, I have come to this Nine Serene Spring to find a Spring Blood Crystal. Do you know where that thing is?” Xiao Yan smiled and asked after resolving this trouble.</p><br/><p>“The Spring Blood Crystal is very rare even in the Nine Serene Spring. Normally speaking, it requires a thousand years before a palm-sized piece will form. I have swallowed these things during these few hundred years…” Yao Ming hesitated for a moment after hearing this question. He suddenly widened his mouth and a blood light rushed out. Finally, this blood light stopped in front of Xiao Yan. The light was a palm-sized blood-colored crystal. The middle of the crystal seemed to possess an endless flowing blood, giving it an exceptionally strange appearance.</p><br/><p>“Is this the Spring Blood Crystal…”</p><br/><p>Xiao Yan softly muttered as he studied the blood crystal with its strangeness.</p><br/>\n</div>"}