{"title": "Chapter 1497: Eight Wasteland Destruction Flame", "id": 1497, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1497-eight-wasteland-destruction-flame", "volume_title": "Volume 15", "body": "<h1>Chapter 1497: Eight Wasteland Destruction Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1497: Eight Wasteland Destruction Flame</u></strong></p><br/><p>Three figures slowly surfaced from the black fog. One of them was wearing black robes. There was nothing special about his face. He appeared just like an ordinary person as a pair of rough hands rolled from his sleeves, but it was this ordinary figure that caused most people present to cease breathing. Their eyes were grave and afraid...</p><br/><p>Chief of the Hall of Souls!</p><br/><p>These four simple words held a prestige that no one in this Central Plains could compare with. Even though this mighty name had been accumulated through years of bloodshed, not a single faction other than the new ‘Sky Mansion Alliance’ dared to openly display their hostility to them. Part of the reason for this might be due to the Hun clan, but the Hall of Souls also possessed a deterrence that belonged to them.</p><br/><p>In the distant past, the chief of the Hall of Souls had once exterminate dozens of sects overnight. Blood flowed like a river that night while corpses were scattered all over the land. Five experts who had reached the second star of the Dou Sheng class had fallen miserably to his hands.</p><br/><p>That night established the ferocious reputation of the Hall of Souls. It also led to the Hall of Souls being the overlord of the Central Plains. Even the Pill Tower did not dare to easily clash with him!</p><br/><p>At this moment, this mighty person, whose fierce reputation was once infamous across the entire Central Plains, was quietly floating in the sky. His eyes were just like a meditating old monk since they did not reveal the slightest fluctuation. Regardless of whether the gazes from his surroundings were filled with fear or hatred, he never shifted his eyes.</p><br/><p>“Chief of the Hall of Souls…”</p><br/><p>Xiao Yan’s eyes slightly narrowed. His gaze roamed the figure. The faint spiritual fluctuation that was emitted from within the chief’s body was the same as the powerful soul Xiao Yan had met a couple of days ago.</p><br/><p>While Xiao Yan was observing the chief of the Hall of Souls, the chief of the Hall of Souls seemed to have detected something and slowly turned his head. Those ancient rippleless-well-like eyes landed on Xiao Yan. He observed Xiao Yan before speaking in an indifferent voice, “The fallen Xiao clan has actually produced someone with such talent. This is a failure on the part of my Hall of Souls…”</p><br/><p>“Hall chief, this brat is too cunning. Although we never viewed him seriously in the past, the experts we dispatched each time were all more than enough to kill him, but each time around, he always overcame the danger. Moreover, his strength also ended up soaring…” A human figure behind the chief of the Hall of Souls spoke in a respectful manner. He slowly lifted his head and revealed half of his face. It naturally belonged to the deputy chief of the Hall of Souls.</p><br/><p>“In time to come, this fellow might end up becoming another Xiao Xuan.” The chief of the Hall of Souls ignored the deputy chief’s words and continued to speak in a calm voice. His voice remained calm, appearing a little strange and mysterious…</p><br/><p>The deputy hall chief widened his mouth after hearing the chief of the Hall of Souls give Xiao Yan such a high evaluation. He looked at the figure next to him who had yet to speak and dryly laughed, “Regardless of how strong that brat is, he is not be stronger than junior clan head. Even if Xiao Yan will be the next Xiao Xuan, it should be known that Xiao Xuan’s fate was not a good one…”</p><br/><p>“Ha…” An undefined laugh was emitted from the nostrils of the Hall of Souls’s chief. He slowly shook his head and softly said, “That’s hard to predict…”</p><br/><p>“He possesses five types of Heavenly Flames, namely the Green Lotus Core Flame, Falling Heart Flame, Sea Heart Flame, Bone Chilling Flame, and the Three Thousand Burning Flame… Heavenly Flames are far too wild and violent. They will definitely try engulfing each other upon contact, but he is able to deal with them peacefully. This should be an effect of his Qi Method.” That human figure slowly lifted his head while the chief of the Hall of Souls looked at him. Light landed on his face, revealing the face of a man that was in his thirties. The face appeared quite young, but there was no expression on it. Joy and sadness were absent. It gave one the feeling that all his features were stiff. Of course, the most eye-catching feature was this person’s eyes.</p><br/><p>Both of his eyes were dark-black. They were a kind of extremely pure black. There were no whiteness in his eyes. Only a cluster of ink-like blackness was present. Looking from a distance, it appeared as though two black beads had forcefully been inserted into his eyes. A chill would rise within one’s heart upon being looked at by that pair of eyes.</p><br/><p>This person turned his head and observed Xiao Yan from a great distance. His voice was soft and cold. “Based on what I am aware of, Yao Chen once obtained a mysterious Qi Method that could merge Heavenly Flames from that Ancient Remains. Xiao Yan is practicing that Qi Method. The reason he is able to swiftly advance to this level is because of that Qi Method. Of course, one must also not underestimate his ability. Even if an ordinary person practices this Qi Method, that person might not end up better than him.”</p><br/><p>After having merely observed Xiao Yan from afar, this person was not only able to see through the Heavenly Flames within Xiao Yan’s body, he was also able to guess the origin of the Qi Method that Xiao Yan practiced. His observation skills would cause one to break out in cold sweat.</p><br/><p>“He is a very difficult opponent to deal with… however, I should be able to kill him.” The black-robed man slowly stated.</p><br/><p>“Ha ha, that’s only natural. Although junior clan head is merely an advanced two star Dou Sheng, even I would not be able to defeat you. It is an easy matter for you to kill the initial two star Dou Sheng Xiao Yan. Looks like the position of clan head of the Hun clan will belong to junior clan head in the future.” The deputy chief of the Hall of Souls smiled as he tried to curry favor.</p><br/><p>The black-robed man curled his mouth upon hearing these words. However, he looked at the deputy chief of the Hall of Souls and said, “You should listen to what the hall chief is thinking before uttering these words.”</p><br/><p>“Junior clan head is thinking too much. The clan head has an overwhelming strength and has been in control of the Hun clan for thousands of years without showing any sign of tiring. It is too early to talk about these matters…” The hall chief faintly smiled before he shook his head and replied.</p><br/><p>The black-robed man gently lifted his eyelids, but did not continue discussing this somewhat taboo topic. His eyes shifted away from Xiao Yan as he looked at the shattered space. He asked, “When should we act?”</p><br/><p>“Wait… wait for the Purifying Demonic Lotus Flame to break the seal. This will make it lose quite a lot of energy. We will act once it is about to break the seal…” The rough large hands of the Hall of Souls’ chief crossed each other as he spoke.</p><br/><p>The black-robed man slightly nodded. His pure black eyes once again glaced at Xiao Yan in the distance before he shut his eyes.</p><br/><p>“Is that the chief of the Hall of Souls? He is indeed frightening…” Ancestor Hou Yun and the rest withdrew their gazes. Their faces were filled with a grave expression as Ancestor Hou Yun made a comment.</p><br/><p>Xiao Yan slightly nodded. Only after seeing the chief of the Hall of Souls in person, he realized just how terrifyingly strong he was. Even Xiao Yan felt that he did not have any chance of victory against such an expert.</p><br/><p>“This person is a great enemy. Be careful…” The smile on Zi Yan’s face by the side had disappeared. Her lovely body gently shifted half-a-step and coincidentally blocked half of Xiao Yan’s body. She was the only one among those present who could block the chief of the Hall of Souls. Moreover, she understood that even if she fought him, she would be no match for him. The best result would be to retreat alone.</p><br/><p>“Relax, they will not attack before obtaining the Purifying Demonic Lotus Flame.” Xiao Yan shook his head and laughed.</p><br/><p>“Ha ha, brother Xiao Yan, you have also come to join the fun…” A loud and clear laugh was suddenly transmitted over from the distance while Xiao Yan was reassuring everyone. The rushing sound of wind immediately appeared as a couple of figures appeared beside him with lightning-like speed.</p><br/><p>Xiao Yan’s eyes followed the rushing sound of wind. A stunned expression flashed across his eyes. He hurriedly headed over before he cupped his hands together and warmly smiled. “It is actually brother Hou Xuan. It has been a long time since we last met. How are you?”</p><br/><p>There were three human figures who had appeared from the rushing wind. The person leading them was a handsome man with white clothes. That familiar face was that of a member from the Yan clan whom Xiao Yan had become acquainted with in the Gu Realm, Hou Xuan. Beside him was the same red-clothed lady with a veil over her face. This time around, there was an additional purple-clothed old man with them.</p><br/><p>“Brother Xiao Yan is indeed an extraordinary person. It has only been a short couple of years since we have last met, yet you have actually reached the Dou Sheng class…” Huo Xuan cupped his hands to Xiao Yan as he praised. He had likely discovered Xiao Yan’s current strength.</p><br/><p>“Ha ha, isn’t brother Huo Xuan also a high level Ban Sheng?” Xiao Yan slightly smiled. His heart was somewhat shocked. The speed at which Hou Xuan’s strength was increasing was quite ferocious. Had Xiao Yan not consumed the Bodhisattva Heart, it was likely that he would have been left far behind.</p><br/><p>“Huh… inside your body…” Xiao Yan’s eyes carefully observed Huo Xuan in front of him while he felt surprised. He let out a ‘huh’ sound as he looked at the smiling Huo Xuan and asked, “You… have refined a Heavenly Flame?”</p><br/><p>“With the help of the Elders, I have luckily subdued the Eight Wasteland Destruction Flame from the clan. Otherwise, it would have been impossible for my strength to soar by such an extent…” Huo Xuan smiled and did not hide anything.</p><br/><p>“The Eight Wasteland Destruction Flame ranked eighth on the Heavenly Flame Ranking?” Xiao Yan’s hand trembled. He was aware that the Yan clan possessed four types of Heavenly Flames. Two among them were ranked in the top ten, but he had not expected the other flame, besides the Red Lotus Ye Flame, to actually be the Eight Wasteland Destruction Flame!</p><br/><p>“It is indeed worthy of being an ancient clan. It possesses such a collection…”</p><br/><p>Xiao Yan was filled with envy within his heart. He had run all over the continent, but the highest ranked Heavenly Flame he had obtained was merely ranked ninth, the Three Thousand Burning Flame. It was unexpected that this Hou Xuan had obtained such a high ranking Heavenly Flame after simply making a trip back.</p><br/><p>“Brother Xiao Yan, this is my Yan clan’s Elder Huo Yao. He also possesses a Heavenly Flame, but it is only ranked sixteenth, the Fire Cloud Water Flame…” Huo Xuan pointed at the purple-clothed Elder beside him and laughed.</p><br/><p>“Another Heavenly Flame…”</p><br/><p>Xiao Yan once again bitterly laughed upon hearing this. Putting it this way, the three people in front of him were carrying three types of Heavenly Flames from the Yan clan. If the five types of Heavenly Flames in him were included, would it not mean that a total of eight types of Heavenly Flames were present?</p><br/><p>“Ha ha, Xiao Yan ge-ge, there are more than eight types…”</p><br/><p>A clear chime-like voice suddenly rinto Xiao Yan’s ear as though it was aware of Xiao Yan’s thoughts.</p><br/><p>“Xun Er?”</p><br/><p>A joy immediately surged onto Xiao Yan’s face the moment that bone deep familiar voice was heard.</p><br/>\n</div>"}