{"title": "Chapter 1492: Absorbing the Soul Essence", "id": 1492, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1492-absorbing-the-soul-essence", "volume_title": "Volume 15", "body": "<h1>Chapter 1492: Absorbing the Soul Essence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1492: Absorbing the Soul Essence</u></strong></p><br/><p>“Those with affinity have the right to obtain any spiritual object in this world. It seems that both you and this soul essence fit each other…”</p><br/><p>Yao Lao involuntarily smiled and remarked after watching Xiao Yan use one sentence to resolve the hidden negative emotions within the soul light cluster.</p><br/><p>“These people from the Hall of Souls have committed all sorts of evil deeds…” Xiao Yan softly sighed. He waved his sleeve as he put this soul light cluster within his Storage Ring. After which, he looked around him. At this moment, the remaining people within the Man Hall with the exception of the deputy hall chief, who had escaped, had all been killed. Although many of the experts from the Hall of Souls were spiritual bodies that would vanish from the world upon death, there were still many of them who possessed a physical body. Hence, this area was covered with corpses. A rich bloody scent rose to the sky.</p><br/><p>A slight ripple appeared in Xiao Yan’s eyes when he observed this scene. He quickly became indifferent. He had seldom engaged in such a massacre, but he would not feel the slightest mercy for these people who aided others in committing atrocities. All of these people had hands that were stained with lives. Even the Xiao clan had nearly been eliminated by these people from the Hall of Souls!</p><br/><p>“Let’s leave.”</p><br/><p>Xiao Yan did not wish to stay in this corpse-covered territory for long. After grabbing the soul light cluster, he turned around and rushed out of the mountain range. Yao Lao and the rest behind carefully searched the area once more before they swiftly followed him.</p><br/><p>Around ten minutes after Xiao Yan’s group left, the space on a mountain a short distance away began to fluctuate. A black figure appeared from it and finally entered the ruins of the hall. His expression quickly became gloomy after seeing the dug up ruins. Fury and regret filled his eyes.</p><br/><p>“The souls that my Man Hall has collected with much difficulty for a hundred years were taken away by that brat. If word of this reaches the clan, even I will be severely punished!”</p><br/><p>That black figure was naturally the deputy hall chief of the Hall of Souls, who had fled earlier. At this moment, he was looking at the empty depths of the hall. His expression had turned a little pale. The Man Hall was considered an important branch hall within the Hall of Souls. The souls that it imprisoned were also relatively strong. Thus, the soul essence it had collected was extremely powerful. Now, that soul essence had been taken by Xiao Yan and those imprisoned souls had also been released by him. This loss was something that even the Hall of Souls could not endure!</p><br/><p>“That brat has an expert from the Ancient Void Dragon tribe guarding him. With my strength alone, I am no match for her. Other than the hall chief, no one within the Hall of Souls can kill that brat. This is the danger that comes from allowing a tiger to grow.” The deputy hall chief of the Hall of Souls shook his head in frustration. Back then, Xiao Yan had been an extremely tiny ant in the eyes of the Hall of Souls, yet after a decade, the ant from back then had slowly grown to a point where the entire Hall of Souls could not deal with him. The speed at which he had grown really caused one to feel an endless regret from just thinking about it. If they had paid a little more attention back then, they would have been able to get rid of a great enemy early on!</p><br/><p>“The Purifying Demonic Lotus Flame will descend on this world in two months. The hall chief will definitely get involved then. If the clan is able to obtain the Purifying Demonic Lotus Flame, we will be able to jump our plans forward. This can help make up for the losses of the destruction of the Man Hall…” The eyes of the deputy hall chief rapidly flashed. A moment later, he finally clenched his teeth. The space around him fluctuated as his body slowly disappeared.</p><br/><p>“We failed snatch the Purifying Lotus Demon Flame the last time around, delaying the Hun clan’s plans. This time around, our Hun clan will definitely obtain it. Once we obtain that demon flame, the clan will no longer need to follow the so-called clan agreement. At that time, the clan’s experts will intervene and Xiao Yan will only end up dieing!”</p><br/><p>“Hmph, Xiao Yan. Just you wait My Hun clan will definitely have our revenge. You have destroyed our Man Hall, but the next time around, we will destroy your Sky Mansion Alliance!”</p><br/><p>The deputy chief of the Hall of Souls disappeared from the world, but his wicked, vicious voice slowly lingered and did not disappear for a long time.</p><br/><p>The news that a Hall of Souls hall had been destroyed might not have been announced, but it was obvious that one could not hide such shocking information. Hence, within a short one week after the incident, this matter seemed to have grown wings and rocketed around the Central Plains, stirring a ton of shock.</p><br/><p>The factions in the Central Plains were all clearly aware of the strength of the Hall of Souls. This overbearing existence had been standing at the top of the Central Plains. Even the Pill Tower had ended up at a disadvantage during many battles with them. Hence, many people did not dare to take revenge despite having suffered to the Hall of Souls. All they could do was suppress the hatred in their hearts. After hearing such news, it was natural that some people would feel a great joy. The new super faction known as the Sky Mansion Alliance also began to be regarded seriously.</p><br/><p>Back then, no one had thought much about this alliance. After all, the Hall of Souls was too strong, and the alliance had been attacked some time earlier. This had caused many to think that the alliance was beginning to sway in the face of a storm. However, the alliance had taken this action to inform everyone that the ‘Sky Mansion’ was unafraid of the Hall of Souls…</p><br/><p>Something like destroying the Man Hall of the three Tiangang Halls was something that the Pill Tower had never accomplished even during their war with the Hall of Souls. This time around, the alliance had succeeded in doing what they couldn’t. The ‘Sky Mansion Alliance’ had undoubtedly shown everyone that they possessed the strength to fight with the Hall of Souls.</p><br/><p>Due to the destruction of the Man Hall, the entire Central Plains and the alliance ended gaining an extremely excited atmosphere. While this occurred, Xiao Yan spent a couple of days resting, so he could refine and absorb the soul essence soon. His spiritual state was at the advanced Heavenly State. He was a little stronger than even Yao Lao, but there was still one state after this advanced state. It was the Perfect Heavenly State!</p><br/><p>Only after reaching the Perfect Heavenly State would it be possible to progress to the legendary “Di State”!</p><br/><p>A Di State soul was seldom formed even during the ancient times. Those who could reach this level were mostly peak existences during that era. An example was someone like Demon Saint Huang Quan…</p><br/><p>Although stepping into the ‘Di State’ did not mean that one would be able to become a genuine Dou Di, there was one point that need not be doubted. After reaching the peak of the ninth star of the Dou Sheng class, one’s spiritual strength would allow one’s strength to soar beyond the limit and progress again. One might even be able to become the so-called “Half Di” existence like Demon Saint Huang Quan!</p><br/><p>Of course, the advancement of one’s spiritual state was extremely difficult. Hardly anyone had reached the Perfect Heavenly State even across the entire continent. That mysterious ancestor of the Small Pill Tower, who liked to have fun roaming the world might be one person. The Gu clan’s and the Hun clan’s heads might also have reached that state, but regardless of how one counted, the numbers would be miserably small…</p><br/><p>Xiao Yan sat on a large rock on a mountain in the star realm as a layer of clouds floated around it. There was a five-foot-large light cluster floating in front of him. A gentle and pure luster continued to be emitted from it. Light landed on the surrounding grass and leaves, causing them to become a richer green.</p><br/><p>Xiao Yan’s eyes studied this soul light cluster as he gently exhaled. He extended his hand and touched the light cluster. Following this contact, Xiao Yan was able to sense the vast and mighty strength that this soul essence cluster contained. That feeling caused the soul on his brow to feel extremely warm…</p><br/><p>“Puff!”</p><br/><p>Xiao Yan widened his mouth. A cluster of grayish-brown flames with a faint blue was spat out. The Heavenly Flame within his body had already refined the ‘Sea Heart Flame.’ Of course, the growth after refining this Heavenly Flame was insignificant, something that Xiao Yan had expected. His strength had merely advanced a little, but not enough to reach the intermediate second star of the Dou Sheng class. The ‘Flame Mantra’ had also improved a little, but it had merely advanced from a Quasi-Tian class Qi Method to a Tian class low level Qi Method. The increase was not obvious.</p><br/><p>Xiao Yan did not feel depressed because of this situation since his heart had been prepared for this. He was already an elite Dou Sheng, which was different from his strength back then. An ordinary Heavenly Flame would no longer be able to catch his eye…</p><br/><p>The flame appeared and floated below the soul light cluster before it turn into a raging flame that wrapped around the light cluster. Although the soul essence was relatively pure, this was something that had been obtained from the Hall of Souls. It was always good to be extra careful.</p><br/><p>The high temperature gradually seeped into the soul light cluster before it began to boil. There was whips of extremely faint black vapor that was were emitted from it. This black vapor quickly vanished.</p><br/><p>Xiao Yan lifted his brow upon seeing these black vapors. He could sense extremely weak thoughts within them. These had been inserted by the experts from the Hall of Souls. If one absorbed these black tendrils into one’s soul, they would end up resulting in a severe sequela.</p><br/><p>“These people from the Hall of Souls are indeed extremely vicious…”</p><br/><p>Xiao Yan waved his sleeve. The flame soared as it completely refined all of the black vapors hidden deep within the light cluster. After removing these black vapors, the soul light cluster became more crystal clear. At a glance, it looked as though it was an illusion.</p><br/><p>This refinement continued for half an hour before Xiao Yan slowly scattered the flame. He looked at the crystal-like soul cluster in front of him and finally sighed. His hands moved to form a seal as his Spiritual Strength surged out of his brow. It turned into a human figure that looked like Xiao Yan. This figure sat in front of the soul light cluster before widening his mouth. A suction force surged from it…</p><br/><p>The soul light cluster trembled after this suction force appeared. An unusually pure soul essence drifted from the soul cluster. It lingered around Xiao Yan’s body before flowing into his mouth, nostrils, and pores as it continuously surged into him…</p><br/><p>The surface of Xiao Yan’s soul began to form a mysterious crystal-like layer as he began to absorb more and more of the soul essence…</p><br/>\n</div>"}