{"title": "Chapter 1490: Bloodbath", "id": 1490, "volume": 15, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1490-bloodbath", "volume_title": "Volume 15", "body": "<h1>Chapter 1490: Bloodbath</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1490: Bloodbath</u></strong></p><br/><p>The human figure that had appeared in front of Xiao Yan was completely wrapped within a black fog. Two unusually dark and dense eyes shot out of the fog, causing one’s heart to feel a lingering fear. This mysterious person was surprisingly the deputy chief of the Hall of Souls, who had intervened when the ‘Sky Mansion Alliance’ was formed back then!</p><br/><p>“Xiao Yan, you are forcing my Hall of Souls to hand you the corpse of Xiao Zhan…”</p><br/><p>The black fog slowly rippled as an unusually pale face was revealed. That face did not appear old. Instead, it appeared like a youth, but the tone that this youth used was unusually sinister. This allowed one to understand that this person’s age was definitely not what he revealed on the surface.</p><br/><p>“I have said that if anything happens to my father, I will hand the Tou She Ancient God Jade to the Gu clan.” Xiao Yan faintly smiled. He did not feel the slightest fear. If one were to reveal even the slightest weakness to these people from the Hall of Souls, these people would grab onto it and one would never be able to recover. Even though he was constantly worried about Xiao Zhan’s safety in his mind, he did not reveal such thoughts through his actions. Otherwise, the ones who would end up suffering would be his father and him.</p><br/><p>“There is no need for it. You will perhaps not be given such an opportunity. I will personally bring you back to the Hun clan this time around and allow the both of you to be reunited…” A cold and indifferent smile surfaced on the face of the deputy hall chief. “Originally, the clan was planning to allow you to live a little longer. However, it seems you do not treasure such an opportunity…”</p><br/><p>Xiao Yan was noncommittal. He was too lazy to utter such nonsense to this deputy chief. With a wave of his hand, a hot flame suddenly shot toward the large pit below. He was planning on beating a dog when it was down, so he would finish off the First Tianzun in this place.</p><br/><p>The eyes of the deputy chief of the Hall of Souls immediately turned cold after he saw Xiao Yan attack to kill in front of him. He flicked his finger and a black vapor rolled out. The black vapor turned into a black dragon that swallowed the flame. After which, his large hand reached for Xiao Yan. Black fog shot out of his fingers in all directions. These black fogs transformed into five large chains that rushed toward Xiao Yan with a crashing sound.</p><br/><p>“Do not think that you can act arrogantly just because you have broken through to the second star of the Dou Sheng class. You are not even worth mentioning in front of me!”</p><br/><p>A ferocity surfaced on the deputy hall chief’s face. His strength was an advanced three star Dou Sheng, and he was only a little weaker compared to the three great dragon kings from the three dragon islands. This kind of strength could completely destroy Xiao Yan!</p><br/><p>However, Xiao Yan’s expression continued to remain calm as the deputy chief of the Hall of Souls sharp attack came. Xiao Yan did not intend to do deal with this attack. Instead, he grabbed at the large pit below from a great distance. A large fire hand appeared in the sky and reached for the large pit below.</p><br/><p>“You are seeking death!”</p><br/><p>The eyes of the deputy hall chief turned gloomy when he saw Xiao Yan completely ignore him. He gave a dense smile as the black chains encircled Xiao Yan before suddenly tightening!</p><br/><p>“Clang clang!”</p><br/><p>The space around Xiao Yan suddenly fluctuated when the black chains were about to entwine around him. An extremely wild and violent chaotic spatial flow spread. A terrifying tearing force shattered those chains.</p><br/><p>“Who is it?”</p><br/><p>The sudden intervention caused the deputy hall chief to feel startled. His eyes hurriedly swept around as he cried out in a cold voice.</p><br/><p>“You are also not worth mentioning in the eyes of this emperor!” A cold voice slowly sounded after the deputy hall chief uttered those words. The deputy hall chief then saw a lovely well-proportioned figure suddenly appear in front of Xiao Yan. He could sense a relatively dense pressure emanating from this figure.</p><br/><p>“Who are you? This is a matter of my Hall of Souls. Outsiders should not intervene least you get implicated!” The deputy hall chief’s eyes were grave as he stared at the purple-haired figure and demanded in a deep voice.</p><br/><p>“Is the Hall of Souls very great…” Zi Yan curled her lips upon hearing this. She appeared to hold great disdain. During the powerful and prosperous times of the Ancient Void Dragon tribe, they were not even afraid of the Hun clan. Even less needed to be said about a subordinate faction of the Hun clan, such as the Hall of Souls.</p><br/><p>“Xiao Yan has said that he will turn this place into a bloodbath today…” Zi Yan’s pretty eyes swept over this deputy hall chief of the Hall of Souls. She faintly smiled and said, “Wouldn’t it have been fine if you simply continued to hide inside? Why do you need to come out and seek death?”</p><br/><p>“How arrogant! I’m afraid that you do not have the ability to kill me!” The deputy hall chief’s expression was extremely ugly as he cried out in a cold voice. This was the first time in many years that he had heard such an obvious threat and felt looked down upon. Although he could sense that Zi Yan was an expert who had reached the fourth star of the Dou Sheng class, he might not end up dead if they were to really fight.</p><br/><p>Xiao Yan glanced at this deputy hall chief before completely ignoring him. He maneuvered his hand, causing the large flame hand to pull the First Tianzun from the large and deep pit. At this moment, the First Tianzun’s arm had exploded into a bloody fog as fresh blood covered his body. Even his soul had been wounded by the ‘Yellow Spring Divine Anger’ from earlier. His sight had even become a little blurry since his physical body and even his soul had suffered severe damage…</p><br/><p>Xiao Yan’s eyes calmly observed the First Tianzun, who seemed to be so badly wounded that he was unable to retaliate. His large fire hand pulled the First Tianzun over, but that dull old face suddenly revealed a renewed ferocity when the First Tianzun was less than a hundred feet from Xiao Yan. His body started to swell.</p><br/><p>“Boom!”</p><br/><p>The swelling body was only midway done when Xiao Yan clenched his fist without expression. The large fire hand mercilessly crushed the First Tianzun. This frightening force caused the First Tianzun’s physical body to burst apart.</p><br/><p>“Swoosh!”</p><br/><p>A black light suddenly shot away after the First Tianzun’s physical body had exploded. It wildly shot toward the deputy hall chief of the Hall of Souls.</p><br/><p>“Trying to escape?” Xiao Yan let out a cold snort after noticing that the soul of the First Tianzun was planning to flee. When it came to such an expert, it was possible to change to another physical body and be reborn as long as one’s soul was not destroyed. At that time, he would become a big threat again. Naturally, it was impossible for Xiao Yan to simply allow such a threat to escape, so he flicked his finger and the large fire hand turned into a fire web that wrapped around the First Tianzun’s soul.</p><br/><p>“How dare you!” The expression of the deputy chief of the Hall of Souls sank upon seeing Xiao Yan’s attempt to capture the First Tianzun. He lifted his hand and a black fog erupted from his sleeve in all directions. The black fog blotted out the sun and permeated the air as it swept toward Xiao Yan.</p><br/><p>“You will not be able to attack in front of this emperor!”</p><br/><p>Zi Yan coldly laughed when this deputy hall chief attacked. Her hands formed a seal with lightning-like speed and a dark-golden luster erupted from her body. In the blink of an eye, this luster formed a huge golden dragon. The dragon widened its mouth and acted like a large whale that was swallowing water. Within a couple of inhalations, the dragon had devoured the black fog even with the fog’s extremely powerful erosion properties.</p><br/><p>“The Ancient Void Dragon tribe?” The deputy chief of the Hall of Souls exclaimed after seeing the large golden dragon that Zi Yan had summoned.</p><br/><p>“Come back!”</p><br/><p>Xiao Yan reached out with his hand after Zi Yan blocked the deputy hall chief of the Hall of Souls. The fire web wrapped around the First Tianzun’s soul. The high temperature radiating from the web caused the First Tianzun to let out a miserable screech. Soon after, the soul flew back and landed in Xiao Yan’s hands.</p><br/><p>Xiao Yan looked at the cluster of black fog in the fire web in his hand. The black fog churned before gathering into the face of First Tianzun. There was an incomparable viciousness filling that face.</p><br/><p>Xiao Yan ignored the hatred of the First Tianzun. He shrank the fire barrier and formed a fire jade bottle. After which, he placed a spiritual seal onto it and tossed it into his Storage Ring. Since that fellow was the First Tianzun of the Hall of Souls, he would definitely be aware of many secrets. It might be possible to gain some information about the Hall of Souls’ motive for gathering souls from his mouth…</p><br/><p>“It is unexpected that you are even able to request the Ancient Void Dragon tribe to help you!” The deputy hall chief of the Hall of Souls involuntarily laughed in extreme anger after watching Xiao Yan seal the soul of the First Tianzun. A four star Dou Sheng could be considered a top expert even within the Hun clan. He had not expected Xiao Yan to be able to invite such an expert this time around.</p><br/><p>“However, my Hall of Souls is not a place that a young fellow like you can turn into a bloodbath just because you wish to!”</p><br/><p>The deputy hall chief of the Hall of Souls suddenly pulled back. At the same time, a silver jade token appeared in his hand. He shattered the token and an extremely dense spatial fluctuation began to rapidly spread, but he was stunned to find that a spatial tunnel did not appear after the spatial token was broken. The spatial energy fluctuated for a moment before slowly disappearing.</p><br/><p>“I have already used the chaotic spatial flow to surround the space in this area. No spatial ripple can be emitted. Hence, you will not be able to summon any reinforcements even if you use a spatial jade token…” Zi Yan spoke with a smile as she mocked the deputy chief of the Hall of Souls, whose expression gradually became ugly.</p><br/><p>The deputy hall chief’s face twitched. His heart finally sank. This time around, Xiao Yan’s group had really come prepared…</p><br/><p>“The Hall of Souls has been chasing after both my teacher and me for so many years. It is now time to repay that debt. Relax, I will tear down the Heaven, Earth, and Man halls one at a time…” Xiao Yan’s eyes were filled with a dense promise as he looked at the deputy chief of the Hall of Souls and spoke.</p><br/><p>“Xiao Yan, the only mistake that my Hall of Souls has made during these years is failing to kill you early on. This has allowed you to gain strength, but you should not be happy. Although my Hun clan cannot attack you because of the agreement between the ancient clans, it will not be long before the agreement will not be able to restrain my Hun clan. At that time, you will discover that my Hun clan far exceeds your imagination…”</p><br/><p>The deputy hall chief of the Hall of Souls inhaled a deep breath of air. He looked at this devastated space. Even half of the large black hall had collapsed. A large number of the experts from the Hall of Souls had been lost during the energy wave that had been emitted from the earlier battle. This time around, the losses of the Man Hall were incomparably miserable…</p><br/><p>“At that time… your Xiao clan and the Sky Manion Alliance will be completely eliminated!”</p><br/><p>The deputy hall chief of the Hall of Souls laughed a dense laugh as his body suddenly exploded. Black fog spread and forcefully tore the chaotic spatial flow apart. His body moved, shot into the tear, and disappeared. This person had abandoned everyone within the Man Hall…</p><br/>\n</div>"}