{"title": "Chapter 1507: Cooperation", "id": 1507, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1507-cooperation", "volume_title": "Volume 16", "body": "<h1>Chapter 1507: Cooperation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1507: Cooperation</u></strong></p><br/><p>The entire place quickly became silent as everyone stared at the white-robed man, who had suddenly appeared on the magma pillar. Numerous pairs of eyes were looking at him with excitement and greed. Given the eyesight of everyone present, they were naturally able to identify that the true form of the man in front of them was the Purifying Demonic Lotus Flame!</p><br/><p>“Purifying Demonic Lotus Flame. It is unexpected that you have mastered the Purifying Demonic Lotus Saint’s Nightmare Heaven Fog to such an extent over one thousand years. You really let one look at you in a different light.”</p><br/><p>The black-robed chief of the Hall of Souls on a mountain rock lifted his head. His expression was slightly ugly as he stared at the Purifying Demonic Lotus Flame. He had also been trapped in the illusion earlier. If the illusion hadn’t suddenly broken apart, even he would not have discovered that he was still in an illusion.</p><br/><p>“This demonic flame is becoming stranger. This time around, we must not allow it to continue to roam free. If it is allowed to escape, the Central Plains will definitely suffer a great calamity!” That Elder Yao Wangui from the Yao clan stared at the Purifying Demonic Lotus Flame with heated eyes. Greed continued to flow from his heart. He had never heard of a Heavenly Flame building strange illusions, which even he was unable to detect, ever since he had begun to train. The experience earlier allowed him to sense just how terrifying the Purifying Demonic Lotus Flame was. It was also precisely because of this power that the greed within his heart had soared many times over.</p><br/><p>Many people around nodded after hearing Yao Wangui’s words. Their faces were a little horrified as they stared at the Purifying Demonic Lotus Flame. The strength the Purifying Demonic Lotus Flame had displayed was far too frightening.</p><br/><p>The white-robed man on the magma pillar looked at the chief of the Hall of Souls and the others without containing even the slightest emotion in his eyes, but he ignored them as his eyes locked onto Xiao Yan, who had remained quiet. A moment later, his icy-cold voice slowly demanded, “Why is it that you can break my Nightmare Heaven Illusion?”</p><br/><p>“I was lucky, I guess.” Xiao Yan spread his hands. It was naturally impossible for him to reveal the truth. This demonic flame realm was filled with a strange aura. At a glance, one could tell that this Purifying Demonic Lotus Flame was an extremely troublesome character. He was not confident he could subdue it now. Moreover, that mysterious light cluster in his head was his only hope. He would naturally not expose it.</p><br/><p>“It is actually this lad who broke the illusion?”</p><br/><p>Many people in the surrounding sky threw some surprised gazes at Xiao Yan after hearing the words of the Purifying Demonic Lotus Flame. They would never have expected Xiao Yan to be the first to break the illusion that the Purifying Demonic Lotus Flame had created over a thousand years with just the strength of a two star Dou Sheng.</p><br/><p>“Brother Xiao Yan is indeed skilled. Ha ha, looks like all of us here owe you a favor.” Huo Xuan, who was a short distance away, laughed.</p><br/><p>The chief of the Hall of Souls and the people from the Yao clan curled their mouths upon hearing this laughter. It was naturally impossible for them to accept that they were set free because of Xiao Yan’s good intentions. Xiao Yan was merely trying to survive…</p><br/><p>The white-robed man stared at Xiao Yan with cold and indifferent eyes. He would never believe this reason. Wouldn’t the Nightmare Heaven Fog that he created be a joke if one could break the illusion with just good luck?</p><br/><p>“Forget it, I will naturally get you to explain to me how you broke it in detail once you become my fire slave. Although all of you escaping the illusion has exceeded my expectations, your final fates will still be the same.” The white-robed man waved his hand and an invisible fluctuation spread. The cream-colored light cluster in the sky slowly disappeared in the process.</p><br/><p>Everyone was startled upon seeing this change. The Purifying Demonic Lotus Flame had covered the spatial tunnel. From the looks of it, it was obvious that the Purifying Demonic Lotus Flame was intending to kill everyone present!</p><br/><p>“Demonic Flame Refining Heaven!”</p><br/><p>A fierce cream-white flame suddenly erupted from the white-robed man’s body soon after the spatial tunnel was removed. It rapidly grew. Within the blink of an eye, it had enveloped the entire area, appearing just like a fire prison as it wrapped around Xiao Yan’s group.</p><br/><p>Then four enormous cream-white fire curtains poured down from the sky. They connected with the sea of magma below. Looking from a distance, it appeared as though a cube prison had been formed that connected the sky and the land.</p><br/><p>Xiao Yan’s group clustered together. Xiao Yan’s expression was grave as he looked at his surroundings. They could sense a terrifying temperature that caused their expressions change rapidly spreading apart.</p><br/><p>“He wishes to refine all of us…” Yao Lao remarked in a grave tone.</p><br/><p>“The strength of the Purifying Demonic Flame is extremely frightening. Its current self is likely equivalent to a peak five star Dou Sheng. Adding the unique ability of the demon flame, it would be able to fight even a six star Dou Sheng. No one here will be able to surpass it in terms of strength…” Xiao Chen, who had not opened his mouth, slowly spoke. He understood the Purifying Demonic Lotus Flame very well and clearly possessed an idea of its current strength.</p><br/><p>“Peak fifth star…”</p><br/><p>Everyone’s expressions altered upon hearing this information. There was an extremely big gap between each level within the Dou Sheng class, especially when the actual form of the other party was the third ranked Heavenly Flame, the Purifying Demonic Lotus Flame. It would be incomparably troublesome to fight it.</p><br/><p>“Bang bang!”</p><br/><p>A low explosion suddenly sounded a short distance away while everyone’s hearts were being cautious. Xiao Yan’s group hurriedly turned their heads, only to watch many figures explode into clusters of blood fog. The blood fog had just appeared when it was vaporized by that frighteningly high temperature.</p><br/><p>These sudden deaths from the explosion of one’s body immediately caused many people to panic. They had not seen an attack be unleashed, but these people…</p><br/><p>More and more figures exploded out of the blue as everyone began to feel a more panicked. The deep bangs caused one’s scalp to turn numb. This method of killing really left no traces…</p><br/><p>“Be careful. The Purifying Demonic Lotus Flame is extremely strange. It can use one’s emotions as a source to burn one’s body. Those who do not wish to die should avoid having random thoughts!” Someone with great experience finally cried out loud as this panic spread.</p><br/><p>The remaining people hurriedly suppressed the emotional fluctuation within their hearts after hearing this cry. They tried their best to remain calm and the self-destructions gradually diminished.</p><br/><p>“These people do not even possess the qualification to become my fire slaves…”</p><br/><p>The white-robed man lifted his eyes in an indifferent manner. His voice was icy-cold and mysterious. “Those below the Dou Sheng class, explode in flames!”</p><br/><p>“Bang bang bang bang!”</p><br/><p>The entire area became chaotic the moment the white-robed man’s final words sounded. Over eighty percent of the elite Dou Zuns exploded apart at this moment. It appeared as though a bomb had been planted within their bodies…</p><br/><p>“What terrifying methods this person uses…”</p><br/><p>Xiao Yan’s group began to sense their feet become cold after seeing over half the people in the sky disappear in the blink of an eye. Fortunately, those experts from the Sky Mansion Alliance had not entered. Otherwise, over half of them would have died because of a single sentence from this white-robed man.</p><br/><p>“Well, only those who remain have the right to become my fire slaves…”</p><br/><p>That white-robed man’s handsome face revealed a smile after seeing the sky becoming a lot emptier. He waved his hand and ten magma pillars shot out of the sea of magma below. The magma pillars exploded apart and ten figures in cream-white fire armor appeared around the white-robed man.</p><br/><p>“They are… all elite Dou Shengs!”</p><br/><p>Xiao Yan quickly inhaled a breath of cool air as he glanced at the ten figures with hollow eyes. These ten figures were all fire slaves. The most shocking thing was that these people had all reached the Dou Sheng class. The strongest fire slave among them had the strength of an advanced three star Dou Sheng!</p><br/><p>Everyone present was dull as they faced the Purifying Demonic Lotus Flame’s lineup. Even the chief of the Hall of Souls frowned.</p><br/><p>“There will be many people who think highly of themselves barging in each time I tear open the seal. Unfortunately, all of them eventually become my obedient fire slaves…” The white-robed man smiled as he looked at everyone and softly said. “This time around, my reward is destined to be a lot greater.”</p><br/><p>“Hu…”</p><br/><p>The chief of the Hall of Souls stared at the lineup in the distance. One person whose strength was approaching the sixth star of the Dou Sheng class and another ten one-to-three-star Dou Shengs. This lineup was something that even the Hall of Souls could not bring out!</p><br/><p>“Everyone, regardless of whatever grudges we have formed between us, we must join hands if we wish to survive and defeat the Purifying Demonic Lotus Flame this time around…” The chief of the Hall of Souls first looked in the direction of Xiao Yan’s group. Zi Yan and Gu Nanhai were all extremely outstanding individuals. Things would become a lot more troublesome if they refused to cooperate.</p><br/><p>The eyes of many experts flickered slightly after hearing the chief of the Hall of Souls’ words. Given the fierce reputation of the Hall of Souls, no one had ever thought of cooperating with these people…</p><br/><p>The chief of the Hall of Souls was unsurprised at seeing everyone become quiet. He added in a faint voice, “All of you should hurry up and decide. Of course, if anyone is confident that they can finish off the Purifying Demonic Lotus Flame alone, I guarantee that I will not intervene…”</p><br/><p>“Although the Hall of Souls’ notorious reputation has spread far and wide, what you say does make some sense. This Purifying Demonic Lotus Flame does not appear to be intending on allowing us to simply leave…” Elder Huo Yao from the Yan clan hesitated for a moment before finally opening his mouth to speak. Given the current situation, banding together was definitely something they needed to do.</p><br/><p>The Yao clan’s, the Lei clan’s, and the Shi clan’s Elders mused for a moment before nodding after hearing the Yan clan agree to the suggestion.</p><br/><p>“What should we do?”</p><br/><p>Xun Er softly asked after seeing the chief of the Hall of Souls look at them. Cooperating with the Hall of Souls was undoubtedly equivalent to working with a tiger.</p><br/><p>Xiao Yan lifted his head. His eyes exchanged glances with the chief of the Hall of Souls for a moment before he smiled He softly said, “We will do as hall chief has suggested. Let’s cooperate and defeat the Purifying Demonic Lotus Flame first…”</p><br/><p>Those who had agreed to cooperate all adopted the mentality of obtaining the Purifying Demonic Lotus Flame. Regardless of what the case was, the most important thing was to defeat the Purifying Demonic Lotus Flame first because they could only survive if it was defeated. At the same time, they would all experience the opportunity to snatch the body of the demon flame!</p><br/><p>Everyone formed their own schemes even though they decided to cooperate.</p><br/>\n</div>"}