{"title": "Chapter 1514: Old Man Hun Mo", "id": 1514, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1514-old-man-hun-mo", "volume_title": "Volume 16", "body": "<h1>Chapter 1514: Old Man Hun Mo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1514: Old Man Hun Mo</u></strong></p><br/><p>That palm, which originally had no problem striking Xiao Yan, ended up experiencing an unexpected situation. The expression of the chief of the Hall of Soul became gloomy. His eyes glanced at the spot behind Xiao Yan. A person in ordinary clothes was quietly standing at that spot. This person appeared extremely ordinary, but his aura was strange and unfathomable, causing one to have difficulty guessing his exact strength.</p><br/><p>“Who are you?” The chief of the Hall of Souls revealed dark and solemn eyes while he cried out. Although he possessed a high position within the Hun clan, the era when Xiao Xuan was alive far too long ago. Hence, it was impossible for him to recognize the person in front of him as the Blood Axe Xiao Chen, who had been quite renowned in the Xiao clan back then.</p><br/><p>“Ancestor Xiao Chen.”</p><br/><p>Xiao Yan quickly recovered. He quietly sighed in relief after Xiao Chen finally intervened. This ancestor of the Xiao clan had not fought ever since he had escaped the illusion. He merely hid by the side regardless of the intense battles Xiao Yan fought. He would only intervene when Xiao Yan was truly facing a critical moment of life and death.</p><br/><p>Xiao Chen waved his hand. His character was quiet and eccentric. He was unwilling to say much at this moment. All he did was lift his foot and slowly walk in front of Xiao Yan. His eyes stared at the chief of the Hall of Soul on the other side before he asked in a hoarse voice, “He is a member of the Hun clan, right?”</p><br/><p>Xiao Yan slightly nodded.</p><br/><p>“In that case, I’ll just kill him…”</p><br/><p>Xiao Yan felt awed in his heart after hearing Xiao Chen’s low and deep voice. His eyes were a little strange as he glanced at Xiao Chen’s back. Only at this moment did he discover that he had never truly been able to see through the actual strength of this ancestor. Although Xiao Chen had been able to defeat Zi Yan and Gu Nanhai while in the illusion, he appeared to have barely have been able to defeat them. Based on Xiao Yan could infer, Xiao Chen should be an advanced four star Dou Sheng. Even if he was a little stronger, it was likely that he was only an initial five star Dou Sheng, but after Xiao Chen’s words escaped his mouth, Xiao Yan finally realized that his guess had been a little on the low side…</p><br/><p>“A couple thousand years of being imprisoned in the illusion. Even if he could not train normally during this long period of time, the little accumulations of achievements, like how dripping water can eventually erode through a stone, would still be enough to shock people. Looks like ancestor Xiao Chen possesses some confidence since he dares to utter these words.”</p><br/><p>“You are a member of the Xiao clan?”</p><br/><p>The chief of the Hall of Souls narrowed his eyes as he stared at Xiao Chen. A moment later, he suddenly recalled the words Xiao Yan had spoke earlier. His eyes abruptly shrank while his tone was filled with disbelief. “How can it be possible? The Xiao clan has already declined. How can it still possess an elite Dou Sheng?”</p><br/><p>From Xiao Chen’s appearance, it was obvious that he had not simply managed to train to this level within a short few decades like Xiao Yan. In that case, he had definitely existed for a long time. Why was it that the Hun clan did not possess any information on him?</p><br/><p>Xiao Yan’s expression did not show the slightest sign of being affected when he saw the hall chief’s shock. His feet merely stepped through the air as he advanced forward. With every step he took, his aura soared like a churning wave. It rose higher and higher as he became even stronger...</p><br/><p>Intermediate four star… advanced four star… intermediate five star…</p><br/><p>Xiao Yan and the others revealed surprise as they stared at Xiao Chen’s back. Xiao Chen’s aura had broken through the fourth star of the Dou Sheng class within a couple of breaths’ time and had reached the intermediate fifth star of the Dou Sheng class!</p><br/><p>This strength was a level stronger than the chief of the Hall of Souls!</p><br/><p>“Who exactly are you?”</p><br/><p>A change finally appeared on the expression of the chief of the Hall of Souls after sensing Xiao Chen’s terrifying aura. He let out a stern cry as Hun Feng and the deputy hall chief of the Hall of Souls rushed over from behind him. Their eyes revealed a changing expression as they stared at Xiao Chen. They had clearly started to panic because of this sudden unexpected change.</p><br/><p>“No wonder ancestor Xiao Chen has been able to endure in the illusion of the Purifying Demonic Lotus Flame for so many years. His strength has actually reached such a level…” A joy flashed across Xiao Yan’s eyes as he muttered.</p><br/><p>“You are really irritating!”</p><br/><p>Xiao Chen merely frowned when he heard the chief of the Hall of Souls stern cry. He clenched his hand in the empty space in front of him, and a large blood-colored object formed in his hand. In the blink of an eye, this object turned into a giant blood-colored axe. He rotated his hand and the blood-colored axe tore through the air in an instant. It was accompanied by waves of sonic booms as it furiously hacked at the hall chief’s group below with lightning-like speed.</p><br/><p>“Quick, withdraw!”</p><br/><p>The expression of the chief of the Hall of Souls changed when he saw Xiao Chen attacked. He waved his sleeve and forced back Hun Feng and the deputy hall chief. After which, his mouth swelled and a five-foot-large black light ball swiftly shot out of his mouth. Waves of miserable screeches were emitted from this ball of light as though countless of souls were devouring each other within it.</p><br/><p>“Swish!”</p><br/><p>The blood-colored figure flashed in the sky. Everyone saw a huge blood-colored axe appear above the black light ball, which had just been spat out of the mouth of the chief of the Hall of Souls. A faint voice soon rang out. One could see a bloody line cut through the dark-black light ball. Ater which, a ‘bam’ sounded and it slowly cracked into two…</p><br/><p>“Grug!”</p><br/><p>The black light ball had yet to even explode when it was slashed into two by the enormous blood-colored axe. The chief of the Hall of Souls spat out a mouthful of blood. His expression became a little weak as he hurriedly withdrew with a pale face. Xiao Chen’s attack was unbelievably sharp. It seemed as though the world would split under the edge of the blood-colored axe. That overbearing aura caused one’s heart to tremble.</p><br/><p>“Three sky breaking axe!”</p><br/><p>An axe gently slashed the chief of the Hall of Souls’ attack apart. Xiao Chen did not hold back. He took two steps forward without uttering a word. The large blood-colored axe in his hand was slashed forward three times with a ‘swoosh’ sound.</p><br/><p>The three axe attacks merged together, and an ordinary person could only see a red light flash across the sky with their naked eyes. Only experts like the chief of the Hall of Souls could clearly see three bright-red bloody lines rushing through the sky. They arrived in front of him almost instantly with an extremely terrifying speed.</p><br/><p>The three blood lines appeared weak, but the chief of the Hall of Souls could sense an extreme danger from them.</p><br/><p>“Spiritual barrier technique!”</p><br/><p>The body of the hall chief trembled because of this danger. His soul surfaced from his brow, and the arms of his soul strangely exploded...</p><br/><p>“Buzz buzz!”</p><br/><p>Black clouds suddenly surged from all directions and blotted out the sun the moment[a][b][c] both of his spiritual arms exploded. This almost endless sky seemed to have been saturated by a black fog in the blink of an eye. Countless numbers of sharp spiritual waves spread from the black fog. It appeared like a demonic sound that crazily invaded the depths of everyone’s mind.</p><br/><p>“Bang bang bang!”</p><br/><p>Three bloody lines tore through the many layers of black clouds. As the first bloody line broke into the clouds, many ripples began to swiftly form on it. Within a short instant, the first bloody line was forcefully scattered. Even the second bloody line had vaguely become visible.</p><br/><p>“Split!”</p><br/><p>A black fog spread as a sudden hoarse voice slowly gave a command. Soon after, layers of black clouds suddenly burst apart before a bloody line rushed out with lightning-like speed. Finally, it shot into a certain part of the black cloud with shocking speed.</p><br/><p>“Grug!”</p><br/><p>The sound of a mouthful of fresh blood being thrown up was emitted as the bloody line shot into a specific region. Soon after, the black clouds that permeated the sky stilled and swiftly withdrew at a speed visible to the naked eye.</p><br/><p>Everyone’s could see the sky when the black clouds withdrew. They quickly looked over and saw the chief of the Hall of Souls’ body covered in blood. He stood trembling a short distance away. A terrifying wound had appeared from his shoulder to his abdomen. One could even see moving internal organs inside his body. Clearly, that strike from earlier had seriously injured the chief of the Hall of Souls.</p><br/><p>Xiao Chen displayed an indifferent expression as he glanced at the chief of the Hall of Souls, but there was some surprise in his eyes. Clearly, he had not expected the hall chief to survive. An unknown number of experts had fallen to this strike back in his era…</p><br/><p>The chief of the Hall of Souls revealed ferocious and dense eyes as he stared at Xiao Chen. He hurriedly took out a couple of jade bottles from his Storage Ring. After which, he applied the medicinal liquid inside to his wound, causing a sizzling white fog to rise. Both of his hands rapidly formed a seal. A black light curtain suddenly appeared and imprisoned both Xiao Chen and him.</p><br/><p>“Old Mo, it is time to intervene after having watched the show for such a long time, right?” The chief of the Hall of Souls suddenly cried out after having created the black light prison.</p><br/><p>Xiao Yan and the others revealed a sudden change in expression after hearing the words of the chief of the Hall of Souls. This Hun clan had hidden an expert in this place?</p><br/><p>“Ugh, Hun Mie Sheng, you are really a disappointment…”</p><br/><p>A low elderly sigh finally sounded while Xiao Yan’s group swept their eyes around.</p><br/><p>Xiao Yan suddenly turned his head. His eyes landed on a group of people a short distance away. A gray-clothed old man, whose strength had merely reached the high level Ban Sheng class, shook his head. He slowly stepped forward with a face full of disappointment. Some changes occurred on his face as a pair of long black eyebrows were lowered, giving him an extremely mysterious appearance.</p><br/><p>Xiao Yan had roughly glanced over this old man amid the chaotic battle earlier, but the old man had been chased by a fire slave until he was forced to flee in all directions. Hence, Xiao Yan had not paid much attention to him, yet he had never expected this ordinary old man to hide his strength so well.</p><br/><p>“Old man Hun Mo! You are here? Does your Hun clan really plan on breaking the agreement?”</p><br/><p>Gu Nanhai and the Elders from the other ancient clans revealed extremely ugly expressions as they looked at this black-eyebrowed old man. Their eyes vaguely contained some fear.</p><br/><p>“The agreement… is nothing when it comes to the demonic flame essence.”</p><br/><p>This old black-eyebrowed man, who was called Old Man Hun Mo, smiled. His eyes swept over Xiao Yan’s group, but he did not attack. Instead, he softly sighed and shifted his eyes to the distant empty space. He inquired, “Old demon from the Small Pill Tower, why are you still hiding yourself now that this old man has shown himself?”</p><br/><p>[a]Is there a sun in this magma realm?</p><br/><p>[b]More like a common expression the author use without considering the context</p><br/><p>[c]The author does that quite often.</p><br/>\n</div>"}