{"title": "Chapter 1510: Tianluo Sealing Demon Formation", "id": 1510, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1510-tianluo-sealing-demon-formation", "volume_title": "Volume 16", "body": "<h1>Chapter 1510: Tianluo Sealing Demon Formation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1510: Tianluo Sealing Demon Formation</u></strong></p><br/><p>The Dou Sheng fire slave quietly stood beside Xiao Yan with a numb and hollow face. Only that terrifying energy fluctuation that was vaguely being emitted from its body allowed one to feel just how powerful it was.</p><br/><p>“However, this symbol can only temporarily control the fire slave. Once the Purifying Demonic Lotus Flame splits its attention, the Heavenly Flame will definitely use the fire bead to break the symbol seal and once again obtain control of the fire slave.” Xiao Yan’s eyes scanned the fire slave beside him. A slight flicker flashed within them. In order to completely control the fire slave, he needed to finish off that fire bead within its mind because that fire bead was the only way the Purifying Demonic Lotus Flame could control them.</p><br/><p>“However, the Purifying Demonic Lotus Flame probably can’t split its attention…”</p><br/><p>Finishing off that fire bead was not something Xiao Yan would be able to do within a short period of time. Hence, he did not entertain this thought for long. He swept his eyes across the other battles. The fire slaves battling Xun Er and the First Elder had been suppressed to the point that they were forced to retreat. The dense-white flame on their bodies had become dimmer. From the looks of it, it was only a matter of time before they obtained victory.</p><br/><p>Xiao Yan sighed in relief after verifying that Xun Er and the First Elder weren’t experiencing any problems. He was just about to turn away when an extremely overbearing energy fluctuation was suddenly emitted from a short distance away. The Heavenly Flame within Xiao Yan’s body trembled slightly because of this fluctuation.</p><br/><p>The movement of the Heavenly Flame within his body caused Xiao Yan to lift his eyebrows. His eyes followed the direction the fluctuation had originated from. In that direction, one could see a fire floating in the sky. A pair of thousand-foot-large flame wings extended from the backside of the fire. Those flame wings were flapped and flames spread in all directions like a storm. These flames filled with an overbearing feeling.</p><br/><p>“Is this the Eight Wasteland Destruction Flame?”</p><br/><p>Envy involuntarily flashed across Xiao Yan’s eyes as he looked at the pale-black flame behind Huo Xuan. The Eight Wasteland Destruction Flame was an overbearing flame. It was ranked sixth on the Heavenly Flame Ranking. There was no need to detail its great strength since just this ranking alone explained everything.</p><br/><p>Huo Xuan’s strength might be inferior to his opponent’s might, but with the help of the Eight Wasteland Destruction Flame, the fire slave, which had reached the advanced first star of the Dou Sheng class, was being beaten until it was unable to retaliate. If the demonic flame wasn’t blocking most of the invasion of the Wasteland Destruction Flame, it would have been quickly defeated.</p><br/><p>“Being born in such a big clan is indeed a blessing. At the very least their resources are not something that an ordinary person can compare with…” Xiao Yan softly sighed. Honestly speaking, even he desired a Heavenly Flame like the Eight Wasteland Destruction Flame. He had roamed the continent in order to find Heavenly Flames, but the highest ranked Heavenly Flame he found was the ninth ranked, the Three Thousand Burning Flames. This was lacking compared to the Eight Wasteland Destruction Flame.</p><br/><p>“Bang!”</p><br/><p>A low and deep mutter was emitted from another direction while Xiao Yan was quietly sighing within his heart. His eyes followed the sound before slightly narrowing.</p><br/><p>“Hun Feng?”</p><br/><p>Hun Feng and an advanced two star Dou Sheng were fighting there. Both parties boasted similar strength, but that fight was not a stalemate. Instead, it was unusually swift and furious. Xiao Yan merely saw Hun Feng gently land a palm on the fire slave’s body. After which, the demonic flame on the surface of fire slave’s body turned into a line of fire that swiftly rushed into Hun Feng’s palm!</p><br/><p>It looked as though the demonic flame was being devoured!</p><br/><p>“He actually dares to swallow the demonic flame?” Even Xiao Yan’s expression involuntarily changed after seeing this scene. Although these demonic flames did not possess the will of the actual Purifying Demonic Lotus Flame, they still possessed an exterminating force. Even he did not dare to simply swallow these flames, but this Hun Feng actually dared to devour them.</p><br/><p>Given Hun Feng’s character, this was definitely not a reckless act. By putting it this way, Hun Feng was confident he could swallow these demonic flames. Even Xiao Yan, who had practiced the Flame Mantra, did not possess such an ability!</p><br/><p>Hun Feng’s scarlet tongue licked his lips after devouring the fire slave’s demonic flame. He appeared as though he had not enjoyed it enough, but he seemed to have sensed Xiao Yan’s eyes. He turned his head and stared at Xiao Yan. After seeing Xiao Yan’s expression, his lips was involuntarily lifted into a dense smile.</p><br/><p>“This fellow is indeed a little mysterious…”</p><br/><p>Xiao Yan’s expression gradually returned to its usual calm. His heart reinforced the caution he felt for Hun Feng. The feeling that Hun Feng gave him was the most dangerous among all the members of the younger generation!</p><br/><p>“Hiss!”</p><br/><p>A sudden and extremely frightening energy fluctuation exploded from that huge battle some distance away while a caution soared within Xiao Yan’s heart. A sharp howl was suddenly emitted from the mouth of someone. This howl clearly originated from the Purifying Demonic Lotus Flame, but there seemed to be an additional fury and wounded feeling in his current voice. It seemed that the combined attack from seven four-star Dou Shengs caused someone as powerful as him to feel quite terrible.</p><br/><p>Fighting with large numbers ultimately possessed its strength, especially when this sea of people was made up of elite Duo Shengs…</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s eyes landed on the enormous battleground. He was just about to speak when his expression suddenly changed. His head suddenly swung to a fire slave a short distance away. He saw a shocking light suddenly shoot out of the eyes of the fire slaves. An unusually wild and violent energy rippled with lightning-like speed.</p><br/><p>“Quick, withdraw! It is about to self-destruct!”</p><br/><p>Xiao Yan was quiet for an instant after seeing this light. He hurriedly cried out to Xun Er.</p><br/><p>Yao Lao’s group revealed shocked faces upon hearing Xiao Yan’s cry. A self-destructing elite Dou Sheng was not a simple matter. Such a strength possessed the ability to destroy the world…</p><br/><p>“Bang!”</p><br/><p>The fire slave’s body swelled at a speed visible to the naked eye while Yao Lao’s group hurriedly pulled back. After which, the body exploded apart in front of many shocked pairs of eyes…</p><br/><p>An indescribably frightening energy storm swept across the sky with a shocking speed. A hundred-thousand-foot-large crack forcefully tore through the air down to the magma sea region tens of thousands of feet below. It reached the deepest region of the magma…</p><br/><p>“Grug!”</p><br/><p>Some of the unlucky individuals, who were slow to run, ended up spitting out fresh blood after the violent energy gently swept through their bodies. A mouthful of fresh blood was spat out. Every inch of the meridians in their bodies was shattered as their flesh broke apart…</p><br/><p>The fire slave had self-destructed and nearly caused everyone, other than those from the big battleground, to explosively pull back. After the first fire slave self-destructed, the remaining individuals eyes, other than the fire slave being controlled by Xiao Yan, emitted an intense light pillar at this moment. After which, their faces were completely dull as they chased Xiao Yan and the rest who had begun to flee.</p><br/><p>Even experts like the deputy hall chief began to swiftly withdraw when they saw these fire slaves fearlessly charge over. Even someone as powerful as them could only temporarily hide when an elite Dou Sheng self-destructed.</p><br/><p>“Bang bang bang!”</p><br/><p>Although Xiao Yan’s group’s reactions were quick and were able to escape a calamity, not everyone was this lucky. A couple of fire slaves had charged in front of some experts just prior to exploding. After which, they exploded in front of these experts stunned eyes. A destructive energy shattered those unlucky people into nothing…</p><br/><p>After a couple of earth-shaking explosions echoed across this realm, over half of the number of experts who had entered the demonic flame realm were lost. Some of those who had luckily survived revealed stunned eyes as they looked at the hundred-thousand-foot-large magma hole. They did not expect these fire slaves to actually self-destruct...</p><br/><p>Six out of nine fire slaves had successfully self-destructed. The remaining three were unlucky enough to be caught within the terrifying explosions from the other self-destructing fire slaves. Hence, before they could self-destruct, they were shattered into nothing by wild and violent energy.</p><br/><p>The eyes of Xiao Yan’s group were dull as they stared at the completely empty and cloudless sky. They immediately became quiet. These self-destructing fire slaves had nearly caused them to die...</p><br/><p>“This Purifying Demonic Lotus Flame is really ruthless. It has simply allowed its Dou Sheng fire slaves to self-destruct. This grand manner is something that even the Hun clan and the Gu clan cannot do.” Xiao Yan inhaled a deep breath of air and spoke with some lingering fear in his heart.</p><br/><p>Xun Er and the others nodded in agreement by the side. All elite Dou Shengs were precious. Who would allow them to self-destruct?</p><br/><p>“Everyone, lend me your strength. Now is the best moment to seal the demonic flame!”</p><br/><p>A loud cry suddenly reverberated from the enormous battle in the distance while Xiao Yan’s group was sighing in relief from having escaped a calamity. The chief of the Hall of Souls charged toward the sky with a miserable appearance before he slammed against empty air. A hundred-thousand-foot-large black formation appeared in the sky. The middle of the large formation locked onto the Purifying Demonic Lotus Flame below!</p><br/><p>“It is actually the Tianlou Sealing Demon Formation!”</p><br/><p>Xun Er immediately let out an exclamation upon seeing the enormous black formation in the sky. From her expression, it was obvious that this formation was quite famous.</p><br/><p>“Alright!”</p><br/><p>It was clear that even Gu Nanhai and the rest recognized this large formation, but they could not worry much at this critical moment. They rapidly considered the situation before furiously crying out. Six vast and mighty energy pillars that caused one to tremble surged out from all directions. They charged into the large formation in the sky.</p><br/><p>“Swoosh!”</p><br/><p>The somewhat pale-looking chief of the Hall of Souls hurriedly changed his hand seal after being supported by such a vast and mighty energy. The large formation shook. A completely black pillar that was covered in mysterious symbols suddenly erupted from the middle of the formation. It smashed into the Purifying Demonic Lotus Flame below with lightning-like speed.</p><br/><p>“Tianlou refining flame. Essence transformation!”</p><br/><p>A heated expression surfaced on the face of the chief of the Hall of Souls in the sky. His eyes greedily looked at the Purifying Demonic Lotus Flame below, which had been struck. The Purifying Demonic Lotus Flame would have difficulty escaping!</p><br/>\n</div>"}