{"title": "Chapter 1512: Earthshaking Clash", "id": 1512, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1512-earthshaking-clash", "volume_title": "Volume 16", "body": "<h1>Chapter 1512: Earthshaking Clash</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1512: Earthshaking Clash</u></strong></p><br/><p>A powerful flame spread over Xiao Yan’s palm as it was thrown forward. It unceremoniously slammed toward Hun Feng’s face.</p><br/><p>“With just you?”</p><br/><p>An icy-cold smile rose on Hun Feng’s face. He looked at the powerful Heavenly Flame on Xiao Yan’s palm and the corner of his mouth widened. “I have heard that you have merged a couple of Heavenly Flames. Although this might be powerful in the eyes of others, it is not worth mentioning in front of me!”</p><br/><p>Hun Feng’s placed his palms together as he coldly laughed. His right palm was suddenly swung forward. He did not dodge. Instead, his right palm made firm contact with Xiao Yan’s palm.</p><br/><p>“Bang!”</p><br/><p>A powerful energy ripple swept apart as both palms made contact. It forcefully pushed back the neighboring two Ban Shengs as space itself became a lot more distorted.</p><br/><p>“This merged Heavenly Flames is the what you are so proud of. Today, I will show you how feeble it actually is!” Hun Feng laughed a sinister and cold laugh. An extremely mysterious purple-black light suddenly flashed across those pure-black eyes. An unusual devouring strength erupted from his palm, and Xiao Yan suddenly discovered that the Heavenly Flame on his palm was being absorbed into Hun Feng’s body a little at a time. Moreover these Heavenly Flames had lost contact with his senses after entering Hun Feng’s body.</p><br/><p>“This fellow is indeed a little strange!”</p><br/><p>This devouring caused Xiao Yan’s heart to feel slightly startled. His hand immediately shook as he resolutely withdrew his palm. His right foot kicked the black light pillar with lightning-like speed and sent it flying into the sky. At the same time, his expression had become stern. The Dou Qi in his body crazily surged like an ocean wave. Many extremely powerful Dou Skills were unceremoniously sent flying toward Hun Feng. Although Hun Feng was only an advanced two star Dou Sheng, this fellow was even more dangerous than the deputy chief of the Hall of Souls in Xiao Yan’s eyes.</p><br/><p>“Flame Splitting Tsunami!”</p><br/><p>“God Seal Skill! Four Seal merger!”</p><br/><p>“Bang bang!</p><br/><p>“Splitting Wind Tiger Roar Palm!”</p><br/><p>“Black Collapsing Force!”</p><br/><p>Hun Feng did not feel the slightest fear when these sharp attacks erupted from Xiao Yan at this moment. Not only did he not withdraw, he instead unleashed the Dou Qi within his body to its limits. Many extremely powerful high class Dou Skills were unleashed. They spread with shocking speed. In an instant, energy erupted in the sky, and the earth-shaking Dou Skills caused many to be quietly shocked.</p><br/><p>A purple-brown sea of flames appeared in the sky. All the remaining experts began to flee as this sea of fire spread. Only Xiao Yan and Hun Feng continued to remained entangled within this sea of flames. Xiao Yan was becoming more fierce through fighting with the help of the fire’s might, but Hun Feng did not fall to a disadvantage. That terrifying sea of flames did not pose an obstruction to him…</p><br/><p>“That Xiao Yan does indeed have some ability. He is able to battle Hun Feng equally…” The chief of the Hall of Souls looked at the two, who had engaged in an extremely intense battle. He slightly frowned. Although Hun Feng was merely an advanced two star Dou Sheng, his fighting strength was similar to a three star Dou Sheng. Additionally, the Dou Skills he practiced were all the top Dou Skills of the Hun clan, significantly raising his fighting strength. He had not expected Xiao Yan to be able to fight Hun Feng by relying on his initial two star Dou Sheng strength.</p><br/><p>“Give me a little more time and I will be able to fight again. At that time, there is no need to…” The eyes of the chief of the Hall of Souls rapidly flashed. Finally, he looked at the sky above the sea of fire. A black light pillar was floating at that spot, emitting a faint luster. It seemed to possess a demonic force that caused one to feel a crazy impulse.</p><br/><p>“This time around, my Hun clan will definitely obtain the Purifying Demonic Lotus Flame!” The chief of the Hall of Souls clenched his fist and let out a low roar within his heart.</p><br/><p>“Yellow Spring Finger!”</p><br/><p>“Yellow Spring Palm!”</p><br/><p>The grave-looking Xiao Yan flashed in the sky and appeared above Hun Feng. The finger and palm were unleashed simultaneously as a huge energy finger and palm broke through the air. They ruthlessly rushed toward Hun Feng below.</p><br/><p>“Futile actions!”</p><br/><p>However, Hun Feng coldly smiled and shook his head when he saw Xiao Yan’s ferocious attack. He pressed his finger against the empty space as two thumb-sized purple-black light rays suddenly erupted from his finger. These rays of light collided with the Yellow Spring Finger and Yellow Spring Palm. No energy explosion sounded upon contact. The two weak light rays simply eroded the Yellow Spring Finger and Yellow Spring Palm in an instant.</p><br/><p>“Have it been devoured…”</p><br/><p>Xiao Yan’s eyes became cold after sensing this devouring strength. After this exchange of blows, he began to gain an understanding of Hun Feng. There seemed to be something within this person’s body that possessed the mysterious effect of devouring many things. Even some of the Heavenly Flame within his body would be swallowed if he was not careful.</p><br/><p>“If you only possess these techniques, this battle can end now…” Hun Feng slowly lifted his head. Those pure-black eyes had gained a purple-black light in them. A symbol slowly appeared on his brow. Hun Feng’s aura soared the moment the clan tattoo appeared. In the blink of an eye, his aura had suddenly broken through to the third star of the Dou Sheng class.</p><br/><p>A thought passed through Xiao Yan’s heart after seeing Hun Feng summon his clan tattoo. Xiao Yan’s vast and mighty Spiritual Strength lingering on his brow quietly surged. A life-like body slowly appeared beside him.</p><br/><p>“Spiritual avatar…”</p><br/><p>Hun Feng’s eyes hardened after seeing this spiritual avatar form beside Xiao Yan. The strength of this spiritual avatar was not weaker than Xiao Yan himself. Moreover, the Spiritual Strength that Xiao Yan possessed was the only aspect in which he felt inferior.</p><br/><p>It was likely that no one other than the chief of the Hall of Souls at his peak could compare with Xiao Yan’s Perfect Heavenly State Spiritual Strength. Even the core genius of the Hun clan was no exception...</p><br/><p>“Five Ring Flame Expelling Technique!”</p><br/><p>Xiao Yan rushed high into the air after the spiritual avatar appeared. Clusters of Heavenly Flames surged out of his body. After which, they transformed into enormous fire spirits and swiftly formed the Five Ring Flame Expelling Formation.</p><br/><p>Xiao Yan’s spiritual avatar formed numerous hand seals with lightning-like speed with a grave expression while Xiao Yan’s actual body unleashed a powerful strike. Xiao Yan’s spiritual body suddenly swelled a couple thousand feet in size as a ten-thousand-foot-large spiritual illusion surfaced on his body!</p><br/><p>Yellow Spring Divine Anger!</p><br/><p>Moreover, this was the Yellow Spring Divine Anger unleashed by Xiao Yan’s spiritual avatar. Its might was even more powerful than when it was unleashed by Xiao Yan’s body!</p><br/><p>The sea of flames spread across the entire sky. An enormous five-colored fire plate slowly rotated as a wild and violent energy gathered within it.</p><br/><p>A solemness surged onto Hun Feng’s face when faced with Xiao Yan’s attack. A purple-black Dou Qi began to surge onto the surface of his body. Dou Qi rose and a fire seedling seemed to have suddenly flashed by.</p><br/><p>The surrounding experts hurriedly pulled back after having sensed the battle atmosphere of this world. They were afraid of getting implicated by the assault.</p><br/><p>“Five Ring Flame Expelling Plate!”</p><br/><p>Xiao Yan’s expression was icy-cold as he stood in the sky. His finger suddenly pointed at Hun Feng below. A couple-thousand-foot-large fire plate that was above his head suddenly whistled down. Space itself cracked an inch at a time as it traveled. Even the magma sea region tens of thousands of feet below forcefully split apart until a ten-thousand-foot-wide gully was formed.</p><br/><p>“Yellow Spring Divine Anger!”</p><br/><p>The illusory figure beside the spiritual avatar suddenly opened its mouth the moment the fire plate whistled down. An earth-shaking spiritual attack suddenly rushed forward.</p><br/><p>“Mou!”</p><br/><p>“Heaven Swallowing Mirror!”</p><br/><p>The grave expression on Hun Feng’s face became more dense when he sensed this terrifying attack. A mouthful of purple-black light was spat out of his mouth. It immediately transformed into a purple-black mirror-like light curtain, which spread in front of him with lightning-like speed. Everything that touched this purple-black light curtain, regardless of whether it was a Heavenly Flame or energy, was completely devoured in an instant...</p><br/><p>The earth-shaking attacks from both parties suddenly collided in front of many stunned eyes. No brilliant energy sparks or earth-shaking explosions appeared. Only a cruel momentary erosion existed...</p><br/><p>The flame on the five-colored fire plate became dim at a speed visible to the naked eye upon contact with the purple-black light curtain, but an extremely intense energy fluctuation formed on the purple-black light curtain. The fluctuations rapidly spread and finally covered the entire light curtain.</p><br/><p>That sonic spiritual attack quickly arrived behind the fire plate. It ruthlessly crashed into the light curtain in waves...</p><br/><p>“Hmph!”</p><br/><p>Hun Feng’s body shook after facing such a terrifying attack. A muffled groan was emitted from his throat. He had not expected Xiao Yan’s attack to be this unexpectedly powerful. As this wild and violent energy strike came down, the devouring strength of the Sky Devouring Mirror could not be fully unleashed.</p><br/><p>“Break i!”</p><br/><p>Xiao Yan glanced at the continuous ripples forming on the Sky Devouring Mirror from the sky. His body moved, and he merged with his spiritual avatar. The huge illusory figure, which was about to vanish, once again widened its mouth and emitted a soul-stirring spiritual sonic wave!</p><br/><p>“Mou!”</p><br/><p>The spiritual assault arrived in the blink of an eye. Hun Feng’s expression became a lot uglier at this moment. His toes pressed against empty space while his body hurried back. At the same time, the Sky Devouring Mirror shattered.</p><br/><p>“Ha ha, thank you for allowing me to win…”</p><br/><p>Xiao Yan faced the sky and laughed out loud after forcing Hun Feng back. His body moved, and he once again appeared in front of the black light pillar. He reached out with his large hand and grabbed the light pillar in it!</p><br/><p>“Purifying Demonic Lotus Flame, you are mine!”</p><br/>\n</div>"}