{"title": "Chapter 1523: Breaking Out of the Cocoon", "id": 1523, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1523-breaking-out-of-the-cocoon", "volume_title": "Volume 16", "body": "<h1>Chapter 1523: Breaking Out of the Cocoon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1523: Breaking Out of the Cocoon</u></strong></p><br/><p>The Shi clan was one of the eight ancient clans. Although the Shu clan was not as well-known as the Gu clan or the Hun clan, it was still one of the eight ancient clans and not an ordinary existence. The Shi clan usually kept a low profile and rarely would news related to them spread, but keeping a low profile did not mean that they were weak. This Shi clan was relatively strong when gauged by their fighting strength. The Shi clan was a lot stronger than the Ling clan, which was the first to disappear. There were many powerful individuals within the clan who possessed an extremely powerful foundation.</p><br/><p>However, a super faction that possessed such a great foundation had once again mysteriously vanished overnight. Just thinking about the clan’s disappearance was sufficient to cause one to feel a chill within one’s heart.</p><br/><p>The Shi clan had disappeared the same way the Ling clan had. Their realms had both been shut before they disappeared. Once the realms reopened, millions of clan members and descendant citizens could not be found. Not one of them remained…</p><br/><p>Clusters of experts from various factions felt a chill rise from their feet to their hearts. These experts had entered the realm of the Shi clan and found the realm completely quiet and lifeless. Just what kind of terrifying existence could eliminate millions of individuals? Some of these millions of individuals included those top experts from the Shi clan. All of those experts were existences within the Central Plains that could shake the world with the stomp of a foot…</p><br/><p>Despite such existences, the Shi clan was still completely removed from this world…</p><br/><p>The information regarding the disappearance of the Shi clan appeared like a hurricane as it swept across the Central Plains. Every faction was startled by this shocking information. Some of those with sharp senses could vaguely tell that something was not quite right. All of these ancient factions were incomparably strong and their inheritance had lasted for thousands of years, yet two clans had completely vanished within a short ten years. If such a matter had only occurred once, it could be written off as a fluke. If it occurred twice, it would really be strange. Moreover, the way both clans had disappeared was exactly the same. This gave one the idea that the perpetrator, who made the Ling and Shi clans vanish, should be the same person or rather the same faction…</p><br/><p>However, a situation that caused one to feel troubled followed. Everyone knew that there were only two factions across the entire continent that could quietly eliminate the ancient Ling clan and the ancient Shi clan. Those two factions were the Hun clan and the Gu clan.</p><br/><p>In an instant, many guesses and doubts were thrown toward these two factions. The Hun clan did not respond to these guesses, which matched their usual style. However, the Gu clan felt a headache forming as doubts were cast their way. Their relationship with the other ancient clans had been quite good, but the relationships between them had become a little awkward after the Ling and Shi clans had disappeared. The other few clans were clearly beginning to feel some doubt and fear for the Gu clan. Even some of their regular interactions had been halted.</p><br/><p>The Gu clan clearly felt a headache because of this troubling news that had appeared out of the blue, but the events this time caused them to be cautious. These developments were clearly not beneficial to the Gu clan. The faction who had struck had likely involved the Gu clan in their scheme on purpose. However, the Gu clan upper echelons felt some doubt and uncertainty because they couldn’t figure out how it was possible for the Hun clan to possess such a frightening strength if they were really the perpetrator? They had managed to avoid the probing of many of the Gu clan’s experts and eliminated the Ling and Shi clans without anyone else noticing either. Alternatively, could there be another terrifying existence that they did not know about within the Central Plains?</p><br/><p>Regardless of the Gu clan’s guesses, they did not possess any evidence to prove their innocence to the other three clans. Hence, they could only remain quiet in the face of this suspicion…</p><br/><p>As the Gu clan and Hun clan remained silent, the remaining three clans of the eight ancient clans—which were the Yao clan, Lei clan, and Yan clan—suddenly announced an alliance one month after the Shi clan had vanished. They called themselves the ‘Three Clan Alliance.’</p><br/><p>The establishment of the ‘Three Clan Alliance’ had an extremely great impact on other factions. This was the first time an alliance had been formed by the three ancient clans since ancient times. After all, these clans were vary competitive and had experienced many conflicts. It was easier said than done to abandon everything and form an alliance, but this time around, the three clans felt a great unease because an unknown danger. They did not wish to become the next Ling clan or Shi clan, but this mysterious murderer had been able to quietly eliminate the Ling clan and the Shi clan, so it was probably not going to be an overly difficult matter for that perpetrator to eliminate one of them. In order to protect their clan’s bloodline, they had no other choice but to form an alliance at this moment…</p><br/><p>The other factions on the Central Plains slightly relaxed when the ‘Three Clan Alliance’ did not launch an army into the Central Plains after announcing their alliance. Instead, they spent plenty of resources to build a tunnel between their realms. Thus, if one party was attacked, the other two would be able to swiftly provide support through the spatial tunnel.</p><br/><p>After the spatial tunnels between the three clans were formed, the three clans appeared impregnable. At this moment, these clans finally began to gradually relax. After which, they also started to dispatch some experts. These experts continuously entered and exited the Shi clan’s realm in an attempt to find some evidence to point to a culprit…</p><br/><p>The Central Plains was always extremely interesting, so nothing could remain in the spotlight for long. Even shocking events like the disappearance of the Shi clan and the formation of an alliance by the three clans had gradually left the spotlight around half a year later. Moreover, that mysterious perpetrator had seemed to have disappeared without a trace. It caused one to feel an uneasiness while sighing in relief…</p><br/><p>After being shocked for a period of time, the ‘Sky Mansion Alliance’ also regained its calm. It continued to engage in an endless struggle with the Hall of Souls. At this moment, the two big factions were completely at odds. Today, one would attack the other’s city. Tomorrow, the other would destroy one’s branch hall. They exchanged a tit for a tat as they engaged in endless battles. However, long term fight had begun to benefit the Sky Mansion Alliance. They were using this war to gain more strength. Not only had this war allowed the fighting strength of the alliance to become more powerful and unified, it had also attracted an increasing number of small factions, who had been pressured by the Hun clan, to join them.</p><br/><p>Hence, during this one and a half years of war, the size of the Sky Mansion Alliance had expanded many times over when compared to before the war. The number of experts within the alliance did not lose to the Hall of Souls.</p><br/><p>Gaining strength through war had allowed the alliance to grow even stronger.</p><br/><p>However, there was a matter that caused Yao Lao’s group fill with worry and anxiousness even as their strength soared. The source of these feelings was naturally Xiao Yan. It had been one and a half years since the demonic flame realm had shut back then, but they still hadn’t obtained the slightest news related to Xiao Yan…</p><br/><p>This lack of news had caused many people’s heart to become a little anxious. The Sky Mansion Alliance’s chief might be Yao Lao, but in the hearts of many people, that skinny and strong back was their mental support. They thought that as long as that skinny back was supporting them, the Sky Mansion Alliance would never fall!</p><br/><p>Regardless of how anxious they felt, reality was cruel. There had been no activity from that place even now…</p><br/><p>Time would not pause because of anyone. Hence, after the demonic flame was sealed for two whole years, the strands of hope in the hearts of many began to gradually dim. Yao Lao’s group could do nothing to stem such a situation. They could only halt some offensive battles and turn to defense.</p><br/><p>While the Sky Mansion Alliance changed its fighting method, the demonic flame realm had finally revealed some life after being quiet for two years…</p><br/><p>The demonic flame realm was still as hot as ever as n enormous crystal egg floated in the sky above the magma sea region. The surface of the crystal egg was sparkling. Occasionally, there was a faint fire seedling leaping up and down, appearing just like a fairy that was filled with spirituality.</p><br/><p>“Crack!”</p><br/><p>A faint sound was suddenly emitted from the silence. If one’s eyes glanced over, one would see that the surface of the crystal egg had slowly started to crack. After this first crack appeared, an increasing number of cracks began to gradually climb across the crystal egg. In the end, a large crystal shell fell from the top…</p><br/><p>“Bang!”</p><br/><p>A pink and golden light suddenly rose into the sky after the crystal egg crack. Finally, this light turned into a curtain that scattered down from the distant sky.</p><br/><p>“Clamour!”</p><br/><p>An arm was suddenly extended from the light pillar as a figure violently stretched its lazy waist. The bones all over its body emitted a thunder-like sound that echoed around the sky.</p><br/><p>“I have finally exited my retreat…” A naked figure stepped out of the light pillar. Who else could the face of the figure belong to other than Xiao Yan? However, his black hair scattered over his shoulders, giving him a free and handsome appearance. If one were to carefully observe his eyes, one would discover that they had turned into two extremely tiny fire lotuses. The lotuses rotated and a mysterious suction force was vaguely emitted from them, as though one’s soul could be dragged into them.</p><br/><p>“Ah, Xiao Yan ge-ge, why are you not wearing any clothes!”</p><br/><p>A clear voice that sounded like a flowing spring in a valley while accompanied by an embarrassment appeared behind Xiao Yan soon after he had stepped out of the light pillar. Xiao Yan turned around and looked at the beautiful figure, whose long black hair scattered over her delicate waist like a waterfall. Perhaps it was because she had been in a slumber while training, but the current Xun Er’s exquisite, peach-like face lacked a tenderness; instead, it had gained the hint of a soul-stirring enchantment. Adding the faint embarrassment on her face, all it took was one glance and Xiao Yan was captivated…</p><br/><p>“My wife is indeed beautiful…”</p><br/><p>The naked man stepped through the empty air and scratched his head before he smiled and complimented the embarrassed lady in front of him.</p><br/>\n</div>"}