{"title": "Chapter 1534: Final Round", "id": 1534, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1534-final-round", "volume_title": "Volume 16", "body": "<h1>Chapter 1534: Final Round</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1534: Final Round</u></strong></p><br/><p>“What?”</p><br/><p>The chief of the Hall of Souls’ expression underwent a change upon hearing these words. Old Man Hun Mo possesses the strength of an advanced five star Dou Sheng. On the other hand, Xiao Chen was merely an intermediate five star Dou Sheng. Given such a gap, it should not be difficult for Old Man Hun Mo to be victorious.</p><br/><p>“If it was really so easy to deal with Xiao Chen, he would not have gained such a reputation back then…” Hun Qian Mo replied in a faint voice. Although his reputation had been well-known during that era, it was still lacking when compared to someone like Xiao Chen. If Xiao Chen had not been trapped in an illusion for so many years, it was likely that even he would be no match for Xiao Chen.</p><br/><p>The chief of the Hall of Souls frowned. He lifted his head and studied the intense battle. At this moment, Xiao Chen still seemed to be at a disadvantage. At a glance it seemed that he was in a panic while dealing with the combined attacks of Old Man Hun Mo and the Soul Curse Toad.</p><br/><p>“Hopefully everything will be smooth…”</p><br/><p>“Clang!”</p><br/><p>The Soul Curse Toad’s huge body was like a cannonball as it ruthlessly struck the large axe. That frightening attack forced Xiao Chen a couple of steps back. After having stabilized his body, a dark and chilly wind rushed toward a fatal spot on his back with vicious and tricky movements. Xiao Chen twisted his body and swing the axe behind him. It sent that poisonous-snake-like chain flying.</p><br/><p>Although Xiao Chen had blocked this dangerous attack, his blood axe rebounded. His entire arm felt a little numb.</p><br/><p>“Xiao Chen, regardless of how experienced you are, I surpass you in terms of strength. The thought of defeating me is nothing but a fantasy of an idiot!” Old Man Hun Mo’s figure appeared on the head of the Soul Curse Toad. He looked at Xiao Chen and coldly laughed, “In front of all the heroes in the world, you, a renowned powerful person from back then, has been forced into such a miserable state. It is better to simply withdraw and avoid the humiliation!”</p><br/><p>Xiao Chen’s figure flashed and appeared in the air. He glanced at Old Man Hun Mo. Not a single fluctuation appeared on his old face, but the vast and mighty Dou Qi that fluctuated around his body suddenly weakened. Both of his hands gripped the axe handle tighter as he lifted it above his head.</p><br/><p>“One axe strike and I’ll finish you off.”</p><br/><p>“Hmph, arrogant!” Old Man Hun Mo displayed a slightly cold face when he heard this arrogance. His heart became cautious. The mighty Dou Qi within his body swiftly circulated like floodwater. It formed countless Dou Qi swirls on the surface of his body.</p><br/><p>Xiao Chen lifted his blood axe high above his head. The Dou Qi around his entire body was gradually destroyed. If it wasn’t still possible to see his figure with one’s naked eye, everyone would have started to think that his breath had suddenly disappeared from this world.</p><br/><p>“Rumble!”</p><br/><p>Layer after layer of dark clouds suddenly appeared as his aura disappeared. Lightning danced within the dark clouds like silver snakes. A loud rumbling sound reverberated through the sky.</p><br/><p>Xiao Chen’s aura suddenly erupted the moment a thunderbolt surged. His aura was like an actual pillar of air as it shot toward the clouds. The most shocking aspect was that Xiao Chen had soared to the advanced level of the fifth star of the Dou Sheng class!</p><br/><p>“How is this possible?”</p><br/><p>Old Man Hun Mo’s face drastically changed as he sensed Xiao Chen’s aura suddenly catch up with him. He had clearly detected Xiao Chen’s actual strength at the intermediate level of the fifth star of the Dou Sheng class. How could it…</p><br/><p>“Universe cut, severing the universe!”</p><br/><p>Xiao Chen did not provide Old Mo with any time to react. The moment his aura soared, the blood axe in his hand abruptly made a strange arc across the sky. Soon after, a thumb-thick bloody line appeared in the sky. The air the bloody line cut seemed to have been severed into two. Lightning rumbled as a bloody aura soared into the sky while a murderous desire churned.</p><br/><p>“Swish!”</p><br/><p>Old Man Hun Mo felt his limbs turn cold as he faced the strange bloody line, which was rapidly magnifying in his eyes. An aura of death quietly rose from deep within his heart, but it was fortunate that he was not an ordinary person. He quickly suppressed the panic in his heart. A brutalness rose on his shriveled face at the same time. If he did not risk it all at this moment, he would definitely find it difficult to escape death!</p><br/><p>“Devour curse insect!”</p><br/><p>Old Man Hun Mo’s hand pressed on the Soul Curse Toad’s head in front of countless pairs of eyes. The Soul Curse Toad immediately emitted a sharp cry as a blood glow erupted. Everyone watched as the enormous body of the Soul Curse Toad melted at a rate visible to the naked eye. Finally, it turned into a pool of viscous blood that was swallowed into Old Man Hun Mo’s stomach.</p><br/><p>“Gulp!”</p><br/><p>After Old Man Hun Mo swallowed the Soul Curse Toad, his body began to spit out clusters of blood. At a glance, he appeared quite frightening and the mighty Dou Qi that lingered around his body appeared quite terrifying. At this moment, his Dou Qi had become extremely violent.</p><br/><p>“Wail!”</p><br/><p>An earth-shaking wail was emitted from Old Man Hun Mo’s mouth. The energy of the world swiftly gathered in Old Man Hun Mo’s unusually large mouth. Within a short instant, a viscous blood ball appeared.</p><br/><p>“Bang!”</p><br/><p>The viscous blood ball rushed out in front of many pairs of eyes the moment it appeared. Finally, it collided with the blood line that was sliding across the sky!</p><br/><p>“Bang!”</p><br/><p>A powerful blood light spread upon collision, enveloping the entire mountain range in a dark red color. Some violent emotions quietly appeared in the hearts of some of the weaker individuals. This caused their eyes to turn a bloody red, but it was fortunate that those who had come were individuals with some strength. Their strength protected them from handing control over to the violent emotions.</p><br/><p>The eyes of Xiao Yan’s group on the Fallen Mountain continued to scan blood-colored ball that was thousands of feet across. Even though there was a great distance between them and the ball. They could still sense the frightening energy that was contained within the blood ball. If this energy spread, at least half of the Fallen Mountain would turn into flat land…</p><br/><p>“Where is ancestor Xiao Chen?”</p><br/><p>Xiao Yan was about to start to search because of this thought flashed through his heart when two figures suddenly flew out of the huge blood-colored light ball. These two figures heavily shot into two different mountains. A frightening force shook these two mountains until they collapsed.</p><br/><p>This scene caused everyone to feel startled. They had just let out an exclamation when two figures flew out in a swaying fashion. Their blood covered bodies appeared somewhat miserable.</p><br/><p>“Ancestor Xiao Chen!”</p><br/><p>“Elder Hun Mo!”</p><br/><p>Both parties were startled after seeing the miserable appearances of these two individuals. Clearly, no one expected them to fight with such ruthlessness.</p><br/><p>Xiao Chen wiped the trace of blood off his face. He glared at Old Man Hun Mo in the distance and his eyes became somewhat grave. His strength was indeed only at the intermediate level of the fifth star of the Dou Sheng class. He was unable to continuously unleash that attack from earlier, which could match an advanced five star Dou Sheng. However, the regretful thing was that Old Man Hun Mo was also a ruthless individual. He actually swallowed the curse insect at the last moment and averted a disaster.</p><br/><p>Of course, swallowing the curse insect might have greatly increased his strength but the sequela he would experience would also be quite serious. Within the next few decades, this old fellow would have difficulty increasing his strength due to his Dou Qi being consumed by the curse insect.</p><br/><p>Xiao Chen controlled his somewhat weak body and slowly landed beside Xiao Yan. At this moment, both he and Old Man Hun Mo no longer possessed any strength to continue fighting. While Xiao Chen’s injury was a result of exhaustion, Old Man Hun Mo was really a little miserable.</p><br/><p>“Ancestor Xiao Chen, are you alright?” Xiao Yan hurriedly asked after seeing Xiao Chen landed. At the same time, he swiftly handed Xiao Chen a medicinal pill that radiated a medicinal fragrance.</p><br/><p>“I’m fine. However, I’m afraid that this match is also a draw. We’ll have to rely on you for the final round…” Xiao Chen received the medicinal pill and swallowed it. Finally, he lamented in a somewhat regretful voice.</p><br/><p>Another draw!</p><br/><p>Yao Lao and the others by the side involuntarily and bitterly laughed. Two of the three matches bad ended in a draw. This was a little comical, but this meant that the most important match fell to Xiao Yan.</p><br/><p>“Leave the final match to me…”</p><br/><p>“Draw… Hun clan’s Elder, you are really too arrogant this time around!”</p><br/><p>The chief of the Hall of Souls tightly frowned. Clearly, he was a little dissatisfied by the result Old Man Hun Mo had obtained.</p><br/><p>“Hmph, why don’t you give it a try next time around?” Old Man Hun Mo’s face became cold. His heart was filled with fury at this moment. Not only did he fail to win, he had even lost the Soul Curse Toad. Moreover, the injuries within his body were giving him a great headache.</p><br/><p>“I have already told you to engage in an all out war with the Sky Mansion Alliance, yet all of you have insisted on this whatever upper echelon battle. Now, you have bitten off more than you can chew. If you lose the final match... hmph, there will really be a good show to see when the time comes!” Old Man Hun Mo furiously yelled.</p><br/><p>“The existence of the Hall of Souls is extremely important to our Hun clan. Now is not the time to collide head-on with others. If you really wish for an all out war, you will naturally be able to fight all you like after our plan has been completed in the future.” The chief of the Hall of Souls replied in a faint voice.</p><br/><p>“Stop uttering nonsense. Mie Sheng, prepare yourself. The final match is between you and Xiao Yan…” Hun Mo Qian’s eyes glanced at the distant Xiao Yan as he said, “This match between the both of you will determine the victor this time around…”</p><br/><p>The chief of the Hall of Souls slightly nodded.</p><br/><p>“That brat is extremely cunning and is in possession of the Purifying Demonic Lotus Flame. You better not end up unexpectedly losing.” Old Man Hun Mo coldly spat out.</p><br/><p>“The Purifying Demonic Lotus Flame, huh…”</p><br/><p>The chief of the Hall of Souls involuntarily exchanged glances with Hun Qian Mo by the side. A strange smile flashed across his eyes. The chief immediately swung his sleeve and slowly stepped forward.</p><br/><p>“This chief wishes to experience just how powerful the Purifying Demonic Lotus Flame is in his hands.”</p><br/>\n</div>"}