{"title": "Chapter 1546: Cai Lin Exiting Her Retreat", "id": 1546, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1546-cai-lin-exiting-her-retreat", "volume_title": "Volume 16", "body": "<h1>Chapter 1546: Cai Lin Exiting Her Retreat</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1546: Cai Lin Exiting Her Retreat</u></strong></p><br/><p>The enormous nine-colored light pillar pierced the sky. Its beautiful luster caused the land to appear a lot livelier…</p><br/><p>“This is…”</p><br/><p>This sudden unexpected change caused many to feel shocked and stunned. Clearly, they did not understand where the nine-colored light pillar originated from.</p><br/><p>“This kind of pressure…” Yao Ming and the other Elders from the Nine Serene Deep Ground Python tribe stared at the light pillar with shocked and uncertain eyes. They were able to detect a pressure that originated from within both their bloodlines and souls…</p><br/><p>“Bang!”</p><br/><p>Huang Tian’s enormous Demon Phoenix body was unable to stop in time. It violently collided with the light pillar in front of countless pairs of startled eyes. A loud earth-shaking sound abruptly reverberated across the sky. The sky and land seemed to tremble because of this fierce collision.</p><br/><p>“Crack crack!”</p><br/><p>After Huang Tian’s full force collision, the nine-colored light pillar cracked. A huge crack line formed as though it was possible to break a light pillar. The surface of the light pillar blasted apart, and a ten-thousand-foot-long nine-colored snake tail suddenly erupted from the light pillar. It was swung and firmly wrapped around Huang Tian’s body. The light pillar collapsed and a huge nine-colored python that was even larger than Huang Tian glaringly appeared in front of many pairs of eyes.</p><br/><p>“Hiss…”</p><br/><p>The inhalation of cold air immediately sounded one after another as everyone looked at the huge nine-colored python, which filled the sky. Shock surged into the many pairs of eyes present.</p><br/><p>“This is… Seven-Colored Heaven Swallowing Python!”</p><br/><p>Those Elders from the Nine Serene Deep Ground Python tribe revealed stunned eyes as they stared at the brilliant python. The large python’s body radiated with nine colors. It was colorful and extremely beautiful. Those human-sized scales contained a gorgeous luster as they covered that enormous body. The body of the snake slowly wiggled. It vaguely emitted an overwhelming feeling that seemed to be able to easily shatter a mountain range. This feeling shook one’s heart.</p><br/><p>“It is not a Seven-Colored Heaven Swallowing Python… it is the legendary Nine-Colored Heaven Swallowing Python!”</p><br/><p>A great wave seemed to have stirred in Yao Ming’s heart at this moment. The Nine-Colored Heaven Swallowing Python was a divine creature that seemed only exist in the ancient folktales. From a certain point of view, such an existence was even stronger than the ancestor of the snake type Magical Beast, the Ancient Heaven Python. Due to them being few in numbers, the reputation of the Nine-colored Heaven Swallowing Python was far inferior to the Ancient Heaven Python. However, being the tribal chief of the Nine Serene Deep Ground Python tribe, Yao Ming naturally understood the strength of this Nine-Colored Heaven Swallowing Python...</p><br/><p>Even during ancient times, the Nine-Colored Heaven Swallowing Python had hardly ever appeared. Moreover, each time it did, it would stir shock within the snake tribe. Yao Ming had never imagined that he would actually be able to personally see this divine beast, which only existed in the legends…</p><br/><p>The current Nine Serene Deep Ground Python tribe was the tribe with the closest bloodline to the Ancient Heaven Python among the snake tribes, but this pride was not even worth mentioning in front of a Nine-Colored Heaven Swallowing Python because the bloodline of the Nine-Colored Heaven Swallowing Python was a little stronger than the Ancient Heaven Python from a certain point of view.</p><br/><p>The pressure from his bloodline originated from this!</p><br/><p>“Cai Lin actually possesses such an identity. No wonder Xiao Yan allowed her to train in the Nine Serene Spring…” At this moment, Yao Ming finally understood why Xiao Yan had allowed Cai Lin to train inside the spring, which even he could not stay in for long.</p><br/><p>“A Nine-Colored Heaven Swallowing Python? How is this possible? How can there be any Nine-Colored Heaven Swallowing Python remaining on the continent!”</p><br/><p>Huang Tian’s huge body was firmly restrained. He looked at the nine-colored python in front of him, which was staring at him with icy-cold snake eyes and extending its snake tongue. A shocked expression surged within his eyes as he involuntarily cried out in disbelief.</p><br/><p>The huge python in front of him was an existence comparable to the Heaven Phoenix. Why did it still exist in this world?</p><br/><p>The snake eyes of the huge nine-colored python remained icy even as Huang Tian roared in disbelief. The huge snake tail that had been firmly wrapped around his body gradually constricted tighter. That terrifying squeezing force broke the metallic feathers on Huang Tian’s body. The bones in his body continuously emitted a strange creaking sound. Even the space itself had become a little distorted…</p><br/><p>“Dammit!”</p><br/><p>A shock and fury flashed through Huang Tian’s huge eyes as he sensed the powerful pressure that contorted his body. He let out a sharp cry toward the sky as a bright golden light shot out of his body in all directions. Under the golden light, the feathers on Huang Tian’s body suddenly stood up. They were like sharp blades as they wildly hacked at the the huge nine-colored python’s body. Sparks started to rain down like a firestorm.</p><br/><p>“Hiss hiss!”</p><br/><p>The eyes of the nine-colored huge python gained a colder glint as Huang Tian’s struggled to retaliate. He saw the snake head sway and dozens of seven-colored snake scales suddenly fell. These scales shook and changed into dozens of enormous Seven-Colored Heaven Swallowing Pythons in front of many shocked eyes. After which, the snake tails entangled with each other like a snake web. Finally… dozens of Seven-Colored Heaven Swallowing Python cried out toward the sky. The snake web subsequently shrunk at a speed visible to the naked eye.</p><br/><p>“Bang bang bang!”</p><br/><p>The rate at which the snake net shrunk was frightening. A squeezing force, which could not be described, was formed by the net made out of snakes. Even space itself collapsed.</p><br/><p>“Hiss hiss!”</p><br/><p>Huang Tian was at the middle of the frightening squeezing force. He involuntarily felt some panic and fear despite his strength. Even he would likely be seriously injured if he were struck by that net. A desire to withdraw immediately rose in his heart. His enormous body strangely shook as he forcefully freed himself slightly from the Nine-Colored Heaven Swallowing Python. Soon after, his huge body quickly shrank and transformed into a human figure in front of many pairs of eyes.</p><br/><p>The wings on Huang Tian’s back were flapped after he returned to his human form. Wind blew and thunder reverberated as his body penetrated space and hurriedly rushed out of the snake web.</p><br/><p>“Bang!”</p><br/><p>Huang Tian was extremely fast and ferocious. Both of his wings were flapped and he narrowly fled through a gap in the snake net. Just as he thought that he had escaped, an enormous shadow suddenly descended from the sky. A bright and colorful snake tail ruthlessly smashed into his body. The powerful air explosion smashed into the ground a hundred thousand feet below, forming a ten-thousand-foot-wide pit.</p><br/><p>Huang Tian immediately spat out a mouthful of fresh blood after being firmly struck by this snake tail. The frightening strength shook him until his internal organs shifted. His body was just like a cannonball as it flew away. Finally, he violently shattered a mountain in front of many stunned eyes. After which, he rubbed across the ground and formed a ten-thousand-foot deep gully before he came to a slow halt.</p><br/><p>Many pairs of eyes looked at the gully, which stretched into the horizon. Their throat involuntarily quivered. Their eyes had gained an additional fear when they looked at the Nine-Colored Heaven Swallowing Python in the sky again… even an ordinary elite Dou Sheng would likely be turned into a bloody fog from this tail strike…</p><br/><p>“Gulp…”</p><br/><p>The bodies of those experts from the Heaven Demon Phoenix tribe stiffened at this moment. Their expressions were stunned. None of them dared to move forward to rescue Huang Tian because of the incomparably intense pressure radiating from the sky.</p><br/><p>While the entire sky seemed to have fallen into silence, the enormous nine-colored Heaven Swallowing Python in the sky slowly began to curl up its huge body. Then, a colorful and brilliant luster surged from its body before the Heaven Swallowing Python’s large body began to shrink. Finally, it turned into a beautiful figure with enchanting curves in front of many startled eyes.</p><br/><p>The luster in the sky gradually scattered. That enchanting figure appeared in the eyes of many figure.</p><br/><p>Cold, enchanting, and capable of bringing disaster to a country…</p><br/><p>The hearts of many pounded at a faster rate once they saw this bewitching appearance mixed with an iciness. Such a person could be described as the ultimate temptation…</p><br/><p>The bewitching figure revealed herself in the sky. Her hand pointed at the dozens of Seven-Colored Heaven Swallowing Python in the sky and beckoned. The snakes whistled down before turning into many seven-colored lights that rushed into her body.</p><br/><p>“Those are actually spiritual bodies of Seven-Colored Heaven Swallowing Pythons?”</p><br/><p>Only after she began collecting those Seven-Colored Heaven Swallowing Python did Yao Ming and the others shockingly discover that these Heaven Swallowing Pythons were not made of energy. Instead, they were true Heaven Swallowing Python souls!</p><br/><p>Dozens of Seven-Colored Heaven Swallowing Python souls!</p><br/><p>Even Yao Ming’s head become a little giddy after realizing what they were. The remaining Elders from the Nine Serene Deep Ground Python tribe all revealed dull gazes, appearing just like fools. How could so many of these extremely rare Seven-Colored Heaven Swallowing Pythons appear at once?</p><br/><p>The beauty in the sky completely ignored their shock. Her eyes, which contained a lazy iciness, slowly swept her surroundings, as though she was a queen inspecting her subjects, appearing cold and mighty, but anyone who made contact with this pair of eyes, which contained a trace of laziness, would feel their hearts beat harder. Some of those mentally weak individuals revealed bright-red faces as the Dou Qi within their bodies became chaotic.</p><br/><p>The demonic beauty’s eyes merely swept briefly over the area below. They shifted away without pausing. After which, she turned her head slightly and looked at an area a short distance behind her. A black-clothed young man was standing in the air. His face contained some gentle smile. A pair of dark-black eyes were filled with joy.</p><br/><p>Her eyes paused on that young figure as the mouth on her bewitching face slowly lifted into an arc. She was like a blooming peony that was filled with great allure. Her beauty was soul-stirring.</p><br/>\n</div>"}