{"title": "Chapter 1542: Huang Tian", "id": 1542, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1542-huang-tian", "volume_title": "Volume 16", "body": "<h1>Chapter 1542: Huang Tian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1542: Huang Tian</u></strong></p><br/><p>“What happened?”</p><br/><p>Yao Lao by the side was startled after seeing Xiao Yan’s reaction. He hurriedly asked a question.</p><br/><p>Xiao Yan’s eyes flickered. He handed the scroll in his hand to Yao Lao. Yao Lao received it and frowned. He was aware of the relationship between Xiao Yan and the Nine Serene Depp Ground Python tribe. Moreover, the most important thing was that Cai Lin was still undertaking a retreat at the Nine Serene Spring within the Nine Serene Deep Ground Python tribe. The scroll had said that there was unusual activity at the spring. It was likely related to Cai Lin. No wonder Xiao Yan would react with such intensity.</p><br/><p>“The Heaven Demon Phoenix tribe… what are these people planning to do?” Yao Lao frowned and wondered.</p><br/><p>Xiao Yan slowly withdrew the powerful aura that had erupted from him. He had formed a big grudge with the Heaven Demon Phoenix tribe. Last time around, he had forcefully captured the Demon Phoenix tribe’s junior tribe chief and two of its elite Dou Shengs and had used them as hostages in order to help the Ancient Void Dragon tribe. These hostages had caused the Demon Phoenix tribe to be afraid of acting recklessly. Although this had resolved the threat faced by the ancient dragon, he had also completely offended the Demon Phoenix tribe.</p><br/><p>However, Xiao Yan was unafraid of offending them. Moreover, his strength had greatly soared. There was even less of a need for him to feel afraid. However, he couldn’t figure out why the Heaven Demon Phoenix tribe would find trouble with the Nine Serene Deep Ground Python tribe at this moment.</p><br/><p>“How do you view this matter?”</p><br/><p>Yao Lao glanced at Xiao Yan. Although the Heaven Phoenix tribe was powerful, the Sky Mansion Alliance was not afraid of them with their current strength.</p><br/><p>“There is no need to drag the alliance into this matter. The Heaven Demon Phoenix tribe is not an ordinary faction. The alliance has just stabilized itself. Some unnecessary trouble will involuntarily finds its way over if the alliance engages in a war with the Heaven Demon Phoenix tribe. Moreover, the Hall of Souls quietly looking on with ill intent.” Xiao Yan voiced his thoughts.</p><br/><p>“I will bring the Little Fairy Doctor and Qing Lin with me to the Beast Region.”</p><br/><p>“Only the three of you?” Yao Lao knit his brows slightly. The Heaven Demon Phoenix tribe was not an ordinary faction. Additionally, the Beast Region was their main camp. Although Xiao Yan’s strength had soared, it was still a little inappropriate for him to venture in alone.</p><br/><p>“Relax…” Xiao Yan smiled. With his current strength, there were extremely few places around this continent that he could not go.</p><br/><p>“Why don’t you bring elder Xiao Chen along?” Yao Lao hesitated for a moment and suggested with a worried tone.</p><br/><p>“The alliance is currently in the limelight and the ancestor of the Pill Tower is a free and easy person who is difficult to find. There must be an expert with some weight present at the headquarters of the alliance. If I leave, we can only rely on ancestor Xiao Chen.” Xiao Yan shook his head. He glanced at the worried Yao Lao and involuntarily laughed, “Teacher, there is no need to be worried. With my current strength, even if I meet a six star Dou Sheng and cannot beat him, it should not be difficult for me to escape. Moreover, the tribe chief of the Heaven Demon Phoenix tribe has yet to reach this level…”</p><br/><p>Yao Lao was unable to say anything more after hearing Xiao Yan insist. He merely asked, “When do you plan on leaving?”</p><br/><p>“This matter cannot be delayed. I will leave now. Cai Lin has been in a retreat for too long. I have started to worry. This time around, I can head over to take a look…” Xiao Yan grinned as he replied.</p><br/><p>Yao Lao sighed after hearing this. “Be careful.”</p><br/><p>Xiao Yan nodded. He did not say anything more. His body moved, and he turned into a bright light that rushed out of the deep mountains. After which, he swiftly found the Little Fairy Doctor and Qing Lin. Subsequently, the three of them tore through space and rushed toward the Beast Region at full speed.</p><br/><p>The huge size of the Beast Region was not the least bit inferior to the Central Plains. Moreover, this place contained an uncountable number of interesting events like the Central Plains.</p><br/><p>The most dazzling existences within the Beast Region were undoubtedly the three large tribes that stood at the top. These three tribes were the Ancient Void Dragon tribe, the Heaven Demon Phoenix tribe, and the Nine Serene Deep Ground Python tribe… among these three large tribes, the Ancient Void Dragon tribe had not revealed themselves for a long period of time. The Nine Serene Deep Ground Python tribe might be large in numbers, but it was weaker than the Heaven Demon Phoenix tribe in terms of the quality of experts. Hence, during these years where there was no news of the Ancient Void Dragon tribe, the position of the Heaven Demon Phoenix tribe in the Beast Region was no different to that of the Hall of Souls in the Central Plains in the past…</p><br/><p>The Beast Region was exceptionally lively during this period of time. The main characters of this liveliness were the Heaven Demon Phoenix tribe and the Nine Serene Deep Ground Python Tribe from the three great tribes.</p><br/><p>In the past, no one would have expected the Heaven Demon Phoenix tribe to launch a large campaign against the Nine Serene Deep Ground Python tribe. They maneuvered plenty of experts within the tribe and charged toward the Nine Serene Deep Ground Python tribe’s headquarters. Moreover, they had surrounded the headquarters until nothing could pass. The swords-drawn atmosphere caused the Beast Region to feel a little anxious. Everyone understood that if the two large tribes were to start a war, it would not be a small fight like the wars between other tribes.</p><br/><p>Hence, countless pairs of eyes continued to observe the situation after the Heaven Demon Phoenix tribe surrounded the Nine Serene Deep Ground Python tribe.</p><br/><p>The deep underground abyss, snake underground network—</p><br/><p>The headquarters of the Nine Serene Deep Ground Python tribe was covered in pressurizing atmosphere. Countless Nine Serene Deep Ground Python tribe experts’ eyes contained cold glints as they looked to the sky outside of the underground network. That place was filled with human figures. Many huge wings covered the sky like dark clouds.</p><br/><p>“Tribal chief, the Heaven Demon Phoenix tribe has really gone overboard. They have actually charged into our territory. If our tribe does not respond, we will definitely end up becoming a joke. At that time, which tribe would dare to rely on us?” Over a dozen figures stood on a majestic mountain in the middle of the underground snake network. An old man with an icy expression spoke in a deep voice to a strong back.</p><br/><p>Some voices agreed after this old man’s words sounded. They were furious that the Heaven Demon Phoenix tribe would so arrogant.</p><br/><p>“Elder Mo, this matter is not so simple. The chief of the Heaven Demon Phoenix tribe has personally led an army over this time around. That old fellow has the strength of an advanced five star Dou Sheng. Who among our Nine Serene Deep Ground Python tribe can match him?” A gray-clothed old man with a somewhat old-fashioned face frowned as he spoke.</p><br/><p>“Hmph, are you trying to say that we will have to simply watch the Heaven Demon Phoenix tribe step on the head of the Nine Serene Deep Ground Python tribe in front of so many people?” The elder from earlier coldly snorted.</p><br/><p>“We cannot put it this way. The aim of the Heaven Demon Phoenix tribe is merely the lady training within the Nine Serene Spring. If we hand her over…” That old-fashioned man smiled. Before he could finish uttering more words, that strong figure at the front let out a cold snort. That low snort immediately caused the old-fashioned man to hurriedly shut his mouth with a somewhat pale expression.</p><br/><p>“My Nine Serene Deep Ground Python tribe will not hand her over. Once we do, other people will think that my Nine Serene Deep Ground Python tribe is afraid of the Heaven Demon Phoenix tribe. Being one of the three great tribes, I cannot afford to lose face! Do not mention this matter again!” The strong figure turned around. His face was filled with a mighty demeanor even without being angry. This face belonged to the chief of the Nine Serene Deep Ground Python tribe, Yao Ming!</p><br/><p>That Elder, who seeked peace, could only suppress the words in his mouth after hearing Yao Ming’s firm words. He muttered, “However, today is the deadline that the Heaven Demon Phoenix tribe has set. If we do not hand her over…”</p><br/><p>Everyone’s heart sank even though those last few words were not uttered. The tribal chief of the Heaven Demon Phoenix tribe, Huang Tian, possessed the frightening strength of an advanced five star Dou Sheng. Even Yao Ming was unable to block him.</p><br/><p>“Elder Mo, have you sent the message?” Yao Ming mused for a moment before asking in a deep voice.</p><br/><p>“It has already been sent.” Elder Mo nodded upon hearing this question. He immediately hesitated, “But, will mister Xiao Yan really hurry over in time?”</p><br/><p>The matter of the Sky Mansion Alliance defeating the Hall of Souls had already spread over the entire Central Plains. There were many people in this Beast Region who had also heard the news. Naturally, the matter of Xiao Yan defeating the chief of the Hall of Souls had tagged along with this information. Hence, many Elders highly anticipated this savior. Although they did not dare to say that Xiao Yan would be able to force Huang Tian of the Heaven Demon Phoenix tribe back, at the very least, the Heaven Demon Phoenix tribe would not dare to be this arrogant if he were present.</p><br/><p>“Now, let’s just quietly wait for good news… he will come…”</p><br/><p>Yao Ming smiled. He looked to the distant sky and spoke with absolute certainty.</p><br/><p>“Yao Ming, three days is already up. Have you decided whether you will hand that person over or start a war?” However, Yao Ming had only just lifted his head when a calm voice containing a powerful pressure reverberated by the ears of every Nine Serene Deep Ground Python tribe member like thunder.</p><br/><p>The expressions of those Elders on the mountain became extremely ugly after hearing this voice.</p><br/><p>Yao Ming’s eyes were gloomy. His body moved and he rushed high into the sky. His eyes turned away from the mountain range. A huge Demon Phoenix was flapping a pair of thousand-foot-long wings in the sky. A purple-golden-robed figure was standing with his hands behind him on the head of a Demon Phoenix. A pair of golden eyes that contained an incredible dignity shot over.</p><br/><p>“Tribal chief Huang Tian, the person training inside the Nine Serene Spring is Xiao Yan’s woman. Xiao Yan will not simply leave things be if you dare touch her.” Yao Ming responded in a deep voice.</p><br/><p>“Ha ha, what a good ‘won’t leave things be’...” The eyes of the purple-golden-robed man revealed a faint mocking expression upon hearing this. “Xiao Yan kidnapped my son and threatened my tribe. He even possesses the wings of my Demon Phoenix tribe. This person is already an enemy of my Heaven Demon Phoenix tribe. Do you think that this king cares about ‘leaving things be’?”</p><br/><p>Yao Ming frowned. It seemed that this old ghost was determined to capture Cai Lin today.</p><br/><p>“I will give you one more minute to consider. Give this king your final response…”</p><br/><p>Huang Tian looked at Yao Ming indifferently as he slowly gave him an offer. His words had just sounded when he slowly shut his eyes. After doing so, the atmosphere of this land suddenly became intense.</p><br/><p>One minute swiftly passed amid this tense atmosphere. However, Yao Ming’s expression remained gloomy. He did not show any signs of handing that person over.</p><br/><p>Huang Tian’s shut eyes were once again opened after this final second passed. An icy-chill surged into his golden eyes.</p><br/><p>“Since Xiao Yan has the courage to threaten this king with my son, this king shall do the same to him. I will capture his woman before deciding what to do!”</p><br/>\n</div>"}