{"title": "Chapter 1556: Gathering Spirits", "id": 1556, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1556-gathering-spirits", "volume_title": "Volume 16", "body": "<h1>Chapter 1556: Gathering Spirits</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1556: Gathering Spirits</u></strong></p><br/><p>If one were to rank the Nine Mysterious Golden Lightning like a Heavenly Flame on the Heavenly Flame Ranking, this lightning would boast a position equivalent to the Purifying Demonic Lotus Flame or even the Nihility Devouring Flame.</p><br/><p>This Nine Mysterious Golden Lightning would only appear after refining a tier 9 golden pill. It was an earth-shaking matter each time this lightning appeared. The world would quiver and even elite Dou Shengs would appear tiny and insignificant under the might of this lightning. Within some of the ancient books, there were records of the unusual natural phenomenons forming when an alchemist, who had reached the peak, refined a tier 9 golden pill.</p><br/><p>The most frightening aspect of this unusual phenomenon was the Nine Mysterious Golden Lightning. Even an ordinary elite Dou Sheng would be turned into dust if that expert touched it even a little.</p><br/><p>Of course, the Nine Mysterious Golden Lightning was extremely rare even during the golden age of the ancient era. It had been thousands of years since the Nine Mysterious Golden Light had appeared on the Dou Qi continent. In other words, the tier 9 golden pill had not appeared on the Dou Qi continent for thousands of years!</p><br/><p>However, probably no one in the world could refine this divine medicinal pill.</p><br/><p>Even Xiao Yan could only remain quiet before these words. Given his medicinal refinement skills, he might not dare to say that he was the best on the continent, but it would not be difficult for him to be rank among the top three. However, the highest tier medicinal pill that he had ever refined was a tier 9 treasure pill. He had never attempted to refine the tier 9 mysterious pill. Even less needed to be said about the higher ranked tier 9 golden pill…</p><br/><p>Hence, the legendary Nine Mysterious Golden Lightning was something he had only ever read about in the ancient books. Although he had never seen it, he was still able to recognize the Nine Mysterious Golden Lightning at first glance because of his sharp spiritual perception.</p><br/><p>“This place… has actually produced a Nine Mysterious Golden Lightning…”</p><br/><p>Even with Xiao Yan’s fortitude, he involuntarily felt his breathing became a little difficult at this moment. It was a long while later before his mouth finally emitted a low mutter without him even realizing it. His voice was filled with shock and disbelief.</p><br/><p>The huge golden lightning dragon lay in the deepest part of the lightning sea. Its eyes were tightly shut. Golden lightning arcs continued to flash over its body. An extermination-like energy quietly spread, causing the empty realm to appear extremely distorted.</p><br/><p>The densely-packed bolts of Black Demon Lightning lingered ten thousand feet away from the golden lightning dragon, as though they were worshiping their king.</p><br/><p>“Gulp…”</p><br/><p>Xiao Yan involuntarily swallowed a mouthful of saliva as he examined this scene. That faint sound was exceptionally loud in this completely quiet realm. Hence, many bolts of the Black Demon Lightning suddenly turned and charged at Xiao Yan like many furious pythons.</p><br/><p>Xiao Yan merely withdrew once the Black Demon Lightning beings started to charge over. His eyes rapidly flickered as he turned around and fled. He was not afraid of the Black Demon Lightning, but he could not afford not to be afraid of the lightning dragon, which appeared to be in a slumber. He could sense a terrifying aura emanating from the dragon’s body. He admitted that he was far inferior to that aura Based on his guess, if one used human levels to measure the lightning dragon’s strength, this lightning dragon… was likely equivalent to a seven star Dou Sheng.</p><br/><p>This level was something that Xiao Yan could not fight against. Hence, he did not hesitate to turn around and flee after discovering the level of the dragon’s aura.</p><br/><p>“Bang bang!”</p><br/><p>Xiao Yan’s fleeing attracted an increasing number of Black Demon Lightning beings, so they chased after him. In an instant, the deepest parts of the lightning pool seemed to have churned. Xiao Yan had barged into their holy land and seemed to have infuriated them. Bolts of Black Demon Lightning surged from all directions, headed toward Xiao Yan. Under the assault from such a number of Black Demon Lightning beings, even Xiao Yan ended up feeling his scalp go numb. He waved his hand and the Northern King appeared above his head. Xiao Yan’s shoulder subsequently shook as Little Yi appeared. After which, Little Yi flew below him. Both the Northern King and Little Yi guarded Xiao Yan from above and below respectively.</p><br/><p>The waves of Black Demon Lightning beings arrived after Xiao Yan summoned Little Yi. However, a suction force erupted from the Northern King and Little Yi when they were a hundred feet away from Xiao Yan. All of these bolts of lightning were absorbed into the duo’s bodies.</p><br/><p>“Let’s go.”</p><br/><p>Xiao Yan did not dare to remain still after easily blocking the attacks of the Black Demon Lightning beings. A pair of bone wings appeared on his back. He was just about to hurriedly flee away when the pores all over his body suddenly opened wide. He hurriedly turned around and coincidentally saw the golden lightning dragon within the lightning pool slowly open its eyes. Lightning flashed and thunder roared within the dragon’s eyes, as though the entire world had shot into those huge dragon eyes.</p><br/><p>“This is bad. That big fellow has awakened…” Dragon’s pair of cold emotionless eyes stared at Xiao Yan, causing him to feel as though his head was about to explode. The green-red bone wings on his back were flapped with great force as his body turned into a ray of light which fled from this lightning pool.</p><br/><p>“Rumble!”</p><br/><p>The golden lightning dragon widened its huge mouth after seeing Xiao Yan flee at such a rapid speed. A thousand-foot-large golden lightning emitted a crackling sound as it shot out at the speed of light. Within a flash, it had caught up to Xiao Yan.</p><br/><p>The golden lightning, which rushed at Xiao Yan from behind, caused his eyes to narrow. This speed left no room for him to escape. He decisively turned his body around. Majestic Dou Qi swiftly gathered on the surface of his body like an enormous black-hole-like swirl. With a wave of his hand, the Northern King was placed in front of him. Little Yi also flashed with a fire glow as he appeared on Xiao Yan’s shoulder again. His small face currently revealed a rare solemness.</p><br/><p>Xiao Yan was not given the opportunity to sigh in relief after forming many layers of defenses. The golden lightning filled his eyes before it ruthlessly struck the Northern King’s body.</p><br/><p>“Bang!”</p><br/><p>That powerful collision sent the Northern King’s body backwards. Xiao Yan hurriedly pressed on its back, but he was unable to block that huge force. Instead, he was also sent flying.</p><br/><p>Although the Northern King’s body was sent flying, its ability to absorb lightning strength once again appeared. One could see many golden lightning arcs leaping around its body. They were like tiny insects that continuously burrowed into its body. At the same time, Xiao Yan had been struck by the lightning since his hand had been touching the Northern King’s body. That frighteningly wild and violent energy shook and destroyed the Dou Qi swirl on the surface of his body. Fortunately, Little Yi quickly stepped forward. He completely unleashed his devouring power and ruthlessly sucked in these golden-colored lightning arcs.</p><br/><p>“Chi chi!”</p><br/><p>The enormous golden lightning wrapped around Xiao Yan, Northern King, and Little Yi. Many huge lightning arcs continuously flickered. The surrounding Black Demon Lightning beings, which had been rushing over, hurriedly came to a halt before fleeing into the distance. None of them dared to even come close to the golden lightning.</p><br/><p>Xiao Yan clenched his teeth while surrounded by the lightning arc. After Little Yi had devoured the golden lightning, an extremely destructive and mighty energy surged into his body. This was the energy that Little Yi had feed back to him. Xiao Yan hurriedly focused his mind on top of feeling shocked. He firmly controlled this vast and mighty energy, directing it through his medians. Wherever this energy passed, tiny golden arcs would flash before his body would emit waves of piercing pain. Even after being filtered by Little Yi, the energy from this Nine Mysterious Golden Lightning still caused Xiao Yan to suffer. Fortunately, the interior of his body had already been strengthened by the Black Demon Lightning. Hence, he did not need to worry about any danger despite suffering a bitter sensation.</p><br/><p>A golden lightning glow flickered. Xiao Yan tried his best to refine the wild and violent energy within his body. After a couple of minutes, the cold perspiration on his face finally diminished. That rebellious wild-horse-like energy gradually turned into waves of floodwater like pure Dou Qi that flowed into his bones. Xiao Yan suddenly discovered that his strength, which had ceased rising earlier, had actually began to once again grow at a slow pace. If this trend continued, he would likely reach the advanced level of the five star of the Dou Sheng class within a short moment!</p><br/><p>This sudden surprise caused Xiao Yan’s face to involuntarily reveal joy. However, this joy had yet to spread when he was awoken by a ‘crack’ sound. His eyes hurriedly shifted to the Northern King, only to find that its skin, which was covered in golden lightning arcs, had cracked and formed a faint gap.</p><br/><p>“What a terrifying Nine Mysterious Golden Lightning. Even the body of the Northern King cannot endure it.”</p><br/><p>Xiao Yan’s heart immediately became cold after seeing the crack that had formed. If Little Yi had not used his fire spirit to refine the lightning, even Xiao Yan would not dare to absorb this destructive energy. He immediately waved his hand and hurriedly put the Northern King into his Storage Ring. Xiao Yan had spent a lot of effort in order to refine this puppet. He would really feel his heart ache if the Northern King were to be destroyed in this place.</p><br/><p>Xiao Yan’s body rapidly withdrew after he stored away the Northern King. Little Yi on his shoulder unleashed his devouring power to its limit. Finally, he absorbed the rest of the golden lightning into his body all at once. Immediately, the surface of his small body exploded and formed many golden lightning glows. The Purifying Demonic Lotus Flame within was unleashed to its limit to madly refine this lightning.</p><br/><p>“I have broken through!”</p><br/><p>Xiao Yan’s body suddenly shook as an increasing amount of vast and mighty energy surged into Xiao Yan’s body. A joy rose within his eyes. His strength had been elevated to the advanced level of the fifth star of the Dou Sheng class by relying on the strength of this Nine Mysterious Golden Lightning. He had, at the very least, saved half a year’s of training!</p><br/><p>“Hurry and leave!”</p><br/><p>Xiao Yan’s body hurriedly withdrew as he relied on Little Yi to swallow the last bit of the Nine Mysterious Golden Lightning. His eyes glanced at the deepest part of the sea of lightning as he withdrew. Many huge lightning arcs suddenly exploded from the golden lightning dragon’s large body. A dragon roar containing a great misery reverberated across this sea of lightning in an earth-shaking manner. The Black Demon Lightning beings around it withdrew into the distance in fear.</p><br/><p>“A spiritual aura is gathering. This Nine Mysterious Golden Lightning is actually trying to form a spirit!”</p><br/><p>This understanding caused Xiao Yan’s rapidly withdrawing figure to suddenly pause. His eyes quickly flickered. Although this Nine Mysterious Golden Lightning was extremely terrifying, it did not possess an intelligence. In other words, it could not be called a spirit. This so-called spiritual gathering was actually the formation of intelligence. If this Nine Mysterious Golden Lightning succeeded, it would turn into an existence similar to the Purifying Demonic Lotus Flame of the past, a Nine Mysterious Golden Lightning with intelligence!</p><br/><p>Of course, this was not something that Xiao Yan desired. However, the Nine Mysterious Golden Lightning would enter an extremely weak state while forming a spirit…</p><br/><p>Even with Xiao Yan’s mental fortitude, his heart began to pound at a greater speed as he thought of its weakened state.</p><br/>\n</div>"}