{"title": "Chapter 1555: Nine Mysterious Golden Lightning", "id": 1555, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1555-nine-mysterious-golden-lightning", "volume_title": "Volume 16", "body": "<h1>Chapter 1555: Nine Mysterious Golden Lightning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1555: Nine Mysterious Golden Lightning</u></strong></p><br/><p>Within the empty realm lightning pool, Xiao Yan forcefully suppressed the excitement in his eyes after a long while. He looked at Little Yi on his shoulder. The only one who could endure the Black Demon Lightning’s wild and violent energy assault was this fire spirit.</p><br/><p>The crystal droplet on the corner of Little Yi’s mouth became even denser when Xiao Yan glanced over. He immediately rubbed his flabby hands on his face and flew forward. Finally, he appeared in the air above a cluster of Black Demon Lightning A circular pink flame that emitted a devouring power spread from his body. Any strand of the Black Demon Lightning that touched this fire circle would meet a suction force that could not be resisted. They were unable to escape regardless of how they struggled. Finally, all of them flew along the edges of the fire circle before entering Little Yi’s small body…</p><br/><p>“Crackle!”</p><br/><p>The surface of Little Yi’s body began to flicker with many black arcs after the many bolts of Black Demon Lightning had been devoured. The Black Demon Lightning that entered his body was swiftly refined by the Purifying Demonic Lotus Flame and then turned into an extremely pure energy that spread apart.</p><br/><p>While Little Yi was wildly devouring the Black Demon Lightning, Xiao Yan remained sitting in the empty space. Wave after wave of an unusually pure and powerful energy began to appear within his body without any warning. He focused his mind and controlled this energy, circulating it along route designated by the Flame Mantra Qi Method. Finally, this energy transformed into powerful Dou Qi that merged into every part of Xiao Yan’s body…</p><br/><p>Xiao Yan had shut his eyes and had focused his mind. He could clearly hear the countless cells within his body emitting a voice filled with desire and joy as this energy was shuttled around. Just one Black Demon Lightning was comparable to an entire day of training for Xiao Yan!</p><br/><p>It was impossible to even compare the effectiveness between the two because they were truly vastly different!</p><br/><p>“If it is possible to absorb all of this Black Demon Lightning, it not be difficult to reach the advanced level of the fifth star of the Dou Sheng class!” Xiao Yan glanced sideways at the Black Demon Lightning, which filled the deepest parts of the lightning pool, with narrowed eyes. A faint smile lifted onto the corner of his mouth before he shut his eyes. He began to refine and absorb the powerful energy surging from his body at an increased speed!</p><br/><p>The quiet deepest parts of the empty realm lightning pool were currently emitting waves of roaring thunder. Many giant-python-like black thunderbolts whistled down. Their might covered this area as tens of thousands of thunderbolts moved together. In front of this spectacular spectacle, even an elite Dou Sheng would feel extremely tiny…</p><br/><p>There were two whirlpool-like existences within the black lightning sea. Many black thunderbolts whistled around these two spots, causing them to be surrounded. Regardless of how ferocious the bolts were, the two regions were like bottomless pits that could not be filled. All of the bolts of Black Demon Lightning, regardless of quality, would eventually disappear with a black flash of light…</p><br/><p>Those two gluttonous individuals tirelessly and crazily devoured clusters of Black Demon Lightning. A figure was seated at the edge of the deepest region of this lightning pool. Many black lightning arcs would occasionally flee from his skin, setting off his black clothes and hair, giving him an exceptionally mysterious and unfathomable appearance.</p><br/><p>This devouring was destined to last for a long time. Fortunately, the amount of lightning within the lightning pool in the empty realm had already reached a relatively frightening extent after evolving over an uncountable number of years. Otherwise, they would have been devoured by these two black-hole-like existences within a short period of time.</p><br/><p>The lightning pool was hidden within the endless empty realm where seldom a person traveled. Even elite Dou Shengs, who occasionally barged into this realm, would not dare to simply enter the lightning pool. Hence, Xiao Yan’s training progressed unusually smoothly without anyone disturbing him.</p><br/><p>Time flew by during this training. Within the blink of an eye, one month had quietly passed.</p><br/><p>During this one month, there was no telling how many bolts of Black Demon Lightning the Northern King and Little Yi had devoured. That enormous, seemingly endless, devouring caused the number of Black Demon Lightning within the deepest part of this lightning pool to become a lot fainter. Of course, after devouring such a vast amount of Black Demon Lightning, both the Northern King, Little Yi, and even Xiao Yan had naturally gained incomparable benefits.</p><br/><p>The Northern King’s body had become a slightly deeper shade of black after being refined for an entire month. The black color possessed an unusual demonic force. At a glance, it appeared like a continuously rotating black hole. At attack that landed on it would be devoured by the black hole.</p><br/><p>The strange black glow lingered around the Northern King’s body. From a distance, it appeared as though an extremely thin layer of black-colored armor had been formed on his body. The armor was deep and dark, causing the Northern King to appear a little mysterious.</p><br/><p>The current body of the Northern King, which could only be described as terrifying, would be able to fight equally with a genuine six star Dou Sheng. Moreover, it had inherited the rich battle experience of the northern dragon king, forcing its opponent to truly regard it as an elite six star Dou Sheng!</p><br/><p>After the northern dragon king’s body had been strengthened to this level, it seemed to have vaguely touched a limit. Regardless of how it absorbed the Black Demon Lightning, the effect was extremely insignificant. Xiao Yan could only helplessly shake his head. Regardless of how perfect it had been made, a puppet was ultimately a puppet. It was already extremely difficult to strengthen it to such an extent. It would likely be far too difficult to make it even stronger.</p><br/><p>While the Northern King had obtained a wonderful result, Xiao Yan and Little Yi, who had madly devoured Black Demon Lightning for a month, had also made significant gains. Xiao Yan had not only risen an initial five star Dou Sheng to an intermediate five star Dou Sheng, he had also reached the peak of the intermediate level. It was not impossible for him to reach the advanced level within a short period of time. As for Little Yi, his body was still as tiny as before, but it was possible to vaguely see some black lightning arcs flashing through the pink flame on his body. After devouring such a large amount of Black Demon Lightning, tendrils of Black Demon Lightning had actually begun to appear within the Purifying Demonic Lotus Flame. This caused the offensive strength of the Purifying Demonic Lotus Flame to significantly rise.</p><br/><p>Xiao Yan was relatively satisfied with his gains, but the problem the Northern King had experienced also occurred to Xiao Yan a month later. After his strength had been raised to the intermediate level of the fifth star of the Dou Sheng class, Xiao Yan’s body seemed to have developed a resistance for the Black Demon Lightning. The obvious increase in his strength from earlier had diminished, so he had no choice but to withdraw from his training state.</p><br/><p>Xiao Yan opened his eyes, which had been shut for a month[a][b][c]. There was also a faint black arc of lightning flashing within them. His mouth was slightly widened as a low lightning roar was emitted from his throat.</p><br/><p>“Hu…”</p><br/><p>Air, which contained some black lightning, was released from Xiao Yan’s mouth. He stood up as waves of a clear cracking sound were emitted from his body. The majestic and endless strength he felt seemed just like a huge dragon had hidden itself within his muscles. The huge dragon could rise with just a thought and unleash a frightening destructive force that would make one speechless…</p><br/><p>“I was just about to step into the advanced level of the fifth star of the Dou Sheng class… how unfortunate.”</p><br/><p>Xiao Yan briefly examined his body before he shook his head in regret. He beckoned with his hand. A red light and a black light rushed out of the deepest part of the lightning pool. In a flash, it appeared beside Xiao Yan. These lights were the Northern King and Little Yi, who had been devouring the Black Demon Lightning for a month.</p><br/><p>Xiao Yan’s eyes swept over the Northern King whose body seemed to be covered in a black crystal. The crystal flickered with a mysterious luster as an aura, which caused even him to feel wary, gradually spread apart, causing others to not want to underestimate it.</p><br/><p>“Perfect…”</p><br/><p>Xiao Yan’s finger touched the Northern King’s arm. From this touch, he understood that if a huge dragon was hidden in his muscles, there were ten or more of them hidden in the Northern King’s skin.</p><br/><p>Such a puppet could only be described as perfect.</p><br/><p>Xiao Yan’s eyes shifted to Little Yi after observing the Northern King. Little Yi’s appearance did not appear to have changed much, but there seemed to be black arcs of lightning present.</p><br/><p>“The Northern King has already reached its limit. The Black Demon Lightning is unable to raise its strength any more. My body has also begun to form a resistance against the Black Demon Lightning’s energy. The effects of continuing to train will greatly diminish…” Xiao Yan’s mulled over the matter. A moment later, he finally felt like leaving. After having been away for a month, Cai Lin and the rest would have become a little worried. This might be a good place to train, but it was impossible for him to remain here for much longer.</p><br/><p>“It is time to leave…”</p><br/><p>Xiao Yan softly sighed. He lifted his head and once again glanced at the lightning pool. He had just turned his body when the deepest part of the lightning pool, which had gradually quietened down because Little Yi and the Northern King had ceased devouring the lightning, suddenly fluctuated. Immediately, black lightning flickered through the pool. They swarmed toward the dark region in the middle from all directions.</p><br/><p>Xiao Yan was startled after the lightning move. He immediately frowned. His eyes scanned the deepest part of the lightning pool. There seemed to be an unusual pressure growing there. This pressure felt similar to the pressure Black Demon Lightning emitted. However, it was many times stronger…</p><br/><p>Xiao Yan’s eyes stared at that area. His eyes flickered. A moment later, he slowly rose into the air and absorbed Little Yi into his body. He made the Northern King walk in front of him as they slowly headed toward the dark region.</p><br/><p>The strange pressure increased as they approached the dark region. In the end, Xiao Yan’s footsteps came to a sudden halt. His dark-black eyes contained a trace of shock as they stared at the middle of the lightning sea. A huge dragon, which seemed to be made of gold, was entrenched at that spot. Golden thunderbolts shot from the surface of its body…</p><br/><p>“This is… the Nine Mysterious Golden Lightning that can only be attracted by a tier 9 Golden Pill (highest tier 9 medicinal pill)…”</p><br/><p>[a]It says one month but shouldn't it be two? The paragraph above says a month later Xiao Yan experienced the same problem as the Northern King did. The Northern King didn't have this problem until a month in though.</p><br/><p>Is it supposed to just be the same month of time instead of a month later?</p><br/><p>[b]true. But I guess the author forgot about the one month before....</p><br/><p>Actually no, two paragraphs earlier, Lin Dong seems to have awoken to deal with the Northern King</p><br/><p>[c]Yeah he awoke to deal with the Northern King, but the paragraph right before this one states this \"Xiao Yan was relatively satisfied with his gains, but the problem the Northern King had experienced also occurred to Xiao Yan a month later.\"</p><br/><p>That sentence makes it seems like he woke up, dealt with the Northern King, then went back to training, then experienced the same problem as the Northern King a month later.</p><br/>\n</div>"}