{"title": "Chapter 1553: Northern King", "id": 1553, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1553-northern-king", "volume_title": "Volume 16", "body": "<h1>Chapter 1553: Northern King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1553: Northern King</u></strong></p><br/><p>A sharp frightening wind whistled through the chamber. The black-metal-like fist of the northern dragon king was just like the sickle of a death god as it mercilessly shot toward Xiao Yan’s head.</p><br/><p>This sudden unexpected change would have caused anyone else to turn pale in shock, but the smile on the face of that skinny figure standing in front of the fire cauldron did not disappear. Just glanced at the northern dragon king, who had broken free from the cauldron, and extended his finger before pressing it down from some distance away.</p><br/><p>“Bang!”</p><br/><p>After Xiao Yan pressed his finger down, the northern dragon king, who was rushing over, suddenly stiffened. Wave after wave of pink flames suddenly erupted from his body without warning. They wrapped around his body before invading from all possible entrances. They swiftly swarmed into the northern dragon king’s head before wrapping around the lingering soul that was controlling his body.</p><br/><p>“Bastard, what have you done to his king?”</p><br/><p>The sudden unexpected change caused the northern dragon king to feel shocked and furious. He let out a stern roar.</p><br/><p>“Northern dragon king, you have overestimated yourself by attempting to use a technique that hides your soul in front of me…” Xiao Yan merely smiled as the northern dragon king let out a shocked and furious roar. His Spiritual Strength was many times stronger than this northern dragon king. How could he make a simple mistake like missing a soul fragment? However, what had just occurred was what he had hoped would happen.</p><br/><p>Although a body refined by an ordinary refinement method became tougher and became immune to pain, a puppet was ultimately only a puppet. It did not possess its own fighting experience. Xiao Yan was naturally unwilling to use the northern dragon king’s body to refine such a basic puppet. With his current strength, he would refine the best puppet he could since he wished to refine one</p><br/><p>A perfect puppet not only required a metal-like body and an immunity to pain, it also required a great fighting experience and many killing methods. However, a puppet was normally controlled by its owner. If the owner ignored it, the puppet would become dull regardless of how strong it was. This type of puppet was far from being perfect. In order to resolve this weakness, one needed to construct the puppet with as much intelligence, or rather battle experience, as possible…</p><br/><p>The northern dragon king had fought in an uncountable number of battles throughout his life. He was an extremely experienced fighter. As long as his soul fragment was refined and merged with the puppet, the puppet that would be formed would truly become a killing machine!</p><br/><p>Back then, Xiao Yan had shattered the soul of the northern dragon king, but he had left this soul fragment hidden within the northern dragon king’s body alone. This soul fragment had inherited the viciousness of the northern dragon king. It had been hiding during this period of time and had only rose to cause trouble after Xiao Yan had tempered the body until it was extremely strong. Unfortunately, this remnant soul was unaware that this was a trap to lure him out…</p><br/><p>Only by merging this soul fragment with this body would the puppet be perfect.</p><br/><p>“I have finally found you…” Xiao Yan glanced at the northern dragon king, who had been surrounded by a pink flame, and faintly smiled. He could sense that the Heavenly Flame had surrounded the northern dragon king’s remaining soul.</p><br/><p>“Don’t…”</p><br/><p>The northern dragon king seemed to have detected something at this moment. Shock flashed across his eyes. Before he could finish speaking, however, Xiao Yan had indifferently waved his hand. The Purifying Demonic Lotus Flame surged forward and swallowed the soul fragment like a tornado. Its terrifyingly high temperature refined it within a couple of minutes.</p><br/><p>After the northern dragon king’s final soul fragment was refined, a somewhat illusory air flow suddenly appeared within the Purifying Demonic Lotus Flame. After which, this air flow slowly drifted under Xiao Yan’s control before merging with the head of the puppet.</p><br/><p>After the illusory flow entered the northern dragon king’s head, the hollow eyes of the puppet gradually revealed a cold golden luster. This luster was set off by the puppet’s black-metal-like body. Looking from a distance, it appeared extremely majestic and emanated a great deterrence. Moreover, its originally somewhat stiff body gradually replaced. This loosening was not a form of weakness. Instead, it hid the puppet’s frightening strength, which could erupt at a moment’s notice, in a place where one’s eyes could not reach. Allowing the puppet to be more effective when it erupted and killed.</p><br/><p>Xiao Yan signed in relief as he observed the black metal figure standing in front of him. He flicked his finger. A drop of essence blood shot out of his finger. Finally, it landed on the puppet’s brow before transforming into a faint blood seal. A mental connection was also formed when seal appeared.</p><br/><p>“In the future, you shall be called… Northern King.”</p><br/><p>That strong-looking black figure’s face moved after hearing Xiao Yan’s words. Finally, an emotionless hoarse voice was slowly emitted from its mouth, “Understood, master.”</p><br/><p>This puppet was different from those Sky Demon Puppets in the past. The Sky Demon Puppets did not possess an intelligence. They needed to be controlled by people when fighting others. However, this “Northern King” would automatically attack with just a thought from Xiao Yan. Moreover, it would not look sluggish like a regular puppet would when fighting against others. It appeared as though it was no different than if the northern dragon king had been revived…</p><br/><p>“The current Northern King should be comparable to a five star Dou Sheng…” Xiao Yan fondled his chin. His eyes continued to observe the Northern King. A puppet that could match a five star Dou Sheng, there was no telling just how much of a commotion such news would stir if it spread. However, Xiao Yan still felt a little unsatisfied. The northern dragon king had vaguely reached the sixth star of the Dou Sheng class, and with the unusually strong body of the northern dragon king, the limit of this puppet should be higher.</p><br/><p>“A puppet is unable to unleash Dou Qi. It completely relies on the strength of its physical body when attacking. With the current physical body of the Northern King, refining it with the Purifying Demonic Lotus Flame would not do much…”</p><br/><p>In the past, the Earth Demon Puppet had relied on absorbing lightning in order to raise its strength. Xiao Yan had used a similar refinement method for this puppet and had refined some special ingredients into the Northern King’s body. In other words, the current Northern King would possess the ability to absorb lightning. Moreover, the limit of this absorption was far from what those Sky Demon Puppets in the past could compare with. Hence, the only thing he needed to consider was where he could find a sufficient lightning strength. If he were to rely on refining medicinal pills to attract Pill Lightning, Xiao Yan would not be able to break the Northern King through to the sixth star of the Dou Sheng class even if he worked himself to death.</p><br/><p>“Perhaps it is time to head to that place…”</p><br/><p>Xiao Yan mused for a moment before he softly laughed. He did not remain any longer as he turned around and walked out of the chamber. The Northern King followed close behind him like a shadow.</p><br/><p>Xiao Yan immediately came across Cai Lin in the courtyard after exiting the quiet room. She also turned her head after detecting him. A stunned expression flashed across her eyes when she saw the Northern King behind Xiao Yan. The body of the northern dragon king had undergone a drastic change after the Purifying Demonic Lotus Flame had refined it for over ten days. With its black-metallic-like body, no one would recognize it as the infamous northern dragon king of the Ancient Void Dragon tribe with just a glance!</p><br/><p>“The refinement was a success?”</p><br/><p>Xiao Yan nodded. He did not remain for long. After briefly explaining the situation to Cai Lin, he led the Northern King into the air and swiftly rushed into the empty realm outside of the dragon island.</p><br/><p>“Rumble!”</p><br/><p>The low and deep roar of thunder roar echoed in the distance within the dark empty realm. If one swept one’s eyes around, one would find a glowing silver light near the edge of the darkness where huge thunderbolts crazily whistled by like huge dragons.</p><br/><p>Xiao Yan’s body remained suspended in the realm. His eyes swept over the extremely huge lightning pool in front of him. This place was where he had refined the Sky Demon Puppets back then and also where he had met the headmaster of the Inner Academy, Mang Tian Chi from the Lei clan, for the first time. At that time, Mang Tian Chi had appeared extremely miserable since he was being chased by those strange black lightning beings. At that time, Xiao Yan only knew that those black lightnings were terrifying and that he could not touch them. This time around, his target were those black lightning beings, who had forced Mang Tian Chi to flee in horror back then…</p><br/><p>He needed to rely on the lightning strength of this lightning pool in order to raise the strength of the Northern King to a truly perfect level!</p><br/><p>“Let’s go…”</p><br/><p>His ark-black pupils observed the thunderbolts surging within the lightning pool. Xiao Yan faintly smiled as his body took the lead to fly forward. The Northern King’s black body followed close behind him.</p><br/><p>Back then, Xiao Yan had needed to be extremely careful when he had entered the lightning pool of the empty realm. He had been afraid of attracting tens of thousands of lightning strikes at the same time, but now he appeared quite at ease in this strange region that was filled with a frightening strength. His body steadily floated through the lightning pool. The wildly flashing thunderbolts would suddenly come to a halt when they were still hundreds of feet from Xiao Yan before turning tail and running with some panic. They were able to detect a relatively frightening existence within the somewhat strong body…</p><br/><p>Xiao Yan did not pause along the way. He rushed to the deepest part of the lightning pool. With the Purifying Demonic Lotus Flame protecting his body, the lightning strength did not dare to charge forward. From the looks of it, this third-ranked Heavenly Flame did live up to its reputation…</p><br/><p>The lightning pool of the empty realm was extremely vast, but with Xiao Yan’s speed, he had reached the deepest part within less than ten minutes.</p><br/><p>“No wonder even headmaster Mang Tian Chi could only turn around and flee back then…”</p><br/><p>Xiao Yan glanced at his dim surroundings after reaching the deep regions. He then shifted his eyes to examine a black lightning cluster, which appeared like huge dragon as it slowly wiggled within the darkness. Even with his current strength, his expression involuntarily became grave.</p><br/><p>The grave expression lasted for a moment before Xiao Yan slowly sighed. Some joy rose onto his face. If the Northern King absorbed this lightning, it would be able to reach a perfect level. At that time, it could even fight against an elite six star Dou Sheng!</p><br/><p>This kind of help would be very useful to Xiao Yan!</p><br/>\n</div>"}