{"title": "Chapter 1579: Escape", "id": 1579, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1579-escape", "volume_title": "Volume 16", "body": "<h1>Chapter 1579: Escape</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1579: Escape</u></strong></p><br/><p>The frightening extermination storm swept apart within the Yao Realm. Other than a small number of extremely powerful individuals, most of those who were struck by it were turned into ashes in an instant. The might from the self-destruction of a seven star Dou Sheng could really annihilate the world.</p><br/><p>“This old lunatic…”</p><br/><p>Faced with this extermination storm that spread across the place, those experts from the Hall of Soul, who were originally planning on stopping Xiao Yan’s group had no choice but to quickly withdraw. Even someone as strong as Hun Jing and Hun Yan could only step back at stay low at this moment.</p><br/><p>The storm continued for a couple of minutes before it gradually weakened. After the extermination ripples disappeared, a hundred thousand feet large hole appeared on the ground below. The bottom of the hole was completely black. It was as though one could not see the bottom. Such a frightening destructive force caused the eyes of Hun Yan and the others to shrink slightly.</p><br/><p>Hun Jing’s and Hun Yan’s eyes immediately turned towards the direction which Xiao Yan’s group had fled towards as the storm scattered. However, they merely saw a spatial crack that was slowly being repaired. Xiao Yan and the others had already vanished. Clearly, they had fled from the spatial crack.</p><br/><p>“Damnit!”</p><br/><p>Hun Jing’s expression was gloomy upon seeing this scene. He let out a soft curse and suddenly grabbed towards the spot where Yao Dan had self-destructed. Immediately, a glow flew over. Finally, it turned into an ancient jade that appeared in his palm. From its appearance, it was something similar to that Tou Shen Ancient God Jade in Xiao Yan’s hand. It seemed that this was the ancient jade that belonged to the Yao clan.</p><br/><p>“Why have you let that brat flee?” Hun Huzi’s figure also appeared beside Hun Jing as he spoke with a sunken expression. Elder Wanhuo and the rest had already been completely killed at this moment. The former did not have much ability to resist in front of a seven star Dou Sheng.</p><br/><p>Hun Jing held the ancient jade. He lifted his eyelid and looked at the extremely miserable Hun Yan who had headed over. At this moment, green and white intertwined on his face. He did not expect that he had actually been turned into such a miserable state by Xiao Yan even after attacking personally.</p><br/><p>“This brat does indeed have some ability. No wonder he is able to cause our Hun clan to suffer losses time and time again…” Hun Yan’s eyes were gloomy. However, he did not shrink from his responsibility. The destructive force that Xiao Yan had unleashed earlier was something that even an ordinary seven star Dou Sheng would not be able to produce. Moreover, from the information that they had obtained, Xiao Yan did not possess such a fighting ability. There was nothing to laugh about him suffering such a loss.</p><br/><p>“We must not allow them to flee successfully. Although we are now no longer afraid of the Gu clan learning of this news, that brat does possess a Tou She Ancient God Jade in his hand. We will be able to save a lot of trouble in the future if we obtain it.” Hun Huzi said. He had been played by Xiao Yan while he was refining pill earlier. Now, it was only natural that he did not wish to see the latter escape.</p><br/><p>“We should resolve the matter of the Yao clan first. Our mission is to collect the bloodline strength of the Yao clan. As for Xiao Yan’s group, humph, how can it be so easy for them to escape. There are still Hun Sha and Hun Tu outside of the Yao clan’s realm. Send the news to them. Ask them to dispatch one of them to kill Xiao Yan!” Hun Yan spoke coldly, “If it is not because the both of them needs to help Nihility sir to stabilize the spatial seal, it would be impossible for that brat to tear open a spatial crack and flee…”</p><br/><p>“Aye.” Hun Jing also nodded. He glanced at this realm, which was filled with a bloody stench. A cruel smile involuntarily flashed across his eyes as he spoke in a dense voice, “With this bloodline strength from the Yao clan, it will be able to extend our Hun clan for another thousand years. At that time, once our plan succeeds, the clan head will become the first person in thousands of years to step into the Dou Di class. At that time, the entire Dou Qi continent would be under the rule of our Hun clan. Even the Gu clan can only grovel at our feet!”</p><br/><p>“Originally, this day would have come much earlier. In the end, it was hindered by the Xiao clan. Back then, our attack on the Xiao clan had caused our clan to suffer quite a serious loss. We have only recovered until our peak after recuperating for so many years. Otherwise, we would not need to be overly afraid of the Gu clan.” Hun Huzi’s tone was ferocious as he said.</p><br/><p>“Everything is worth it to eliminate the Xiao clan. That clan is far too difficult to deal with. If they were to join hands with the Gu clan in the future, it might really be possible for them to threaten our Hun clan. We must eliminate them. Moreover that Xiao Xuan… even our clan head at his peak is afraid of him. We must not allow such an enemy to remain.” Hun Jing spoke in a deep voice. A frightened expression flashed across his eyes when he mentioned that name. It was as though he had recalled the earthshaking miserable battle back then.</p><br/><p>Hun Yan took out a medicinal pill and swallowed it. His eyes were dark and cold as he looked at the lingering battles still present below. He involuntarily let out a dark and cold smile.</p><br/><p>“Start collecting the bloodline strength. With these bloodline, the clan head might be able to advance another level. At that time, our Hun clan will launch an all out attack!”</p><br/><p>The space hundreds of kilometres away from the Shennong Mountain Range suddenly became distorted. A spatial crack line appeared. Immediately, many miserable looking figures continued to rush out from it. Everyone only heaved a sigh of relief after landing on the mountain. They had finally escaped from the prison where they would have to die.</p><br/><p>“Are you alright?”</p><br/><p>Yao Lao wiped off his cold sweat. Being able to escape from the realm sealed by the Hun clan was considered a miracle. However, he quickly turned his eyes towards Xiao Yan. His expression changed slightly after seeing the injury on the latter’s chest.</p><br/><p>“I’m alright…” Xiao Yan clenched his teeth. His hand rubbed over his wound. Wisps of pink flame entered his injuries. Immediately, white smoke was emitted. Traces of black vapour was being forced out from the wound by the Purifying Demonic Lotus Flame.</p><br/><p>Xiao Yan finally sighed in relief after resolving the eroding Qi present within his injury. He stuffed a medicinal pill into his mouth and recuperated for a moment. Only then did he turn his head and looked at the unusually quiet mountain range behind him. No one could have imagined that the realm within this mountain range had already turned into a complete bloodbath with corpses lying all over it.</p><br/><p>Beside Xiao Yan, those dozen over younger generation of the Yao clan, whom Xiao Yan had rescued from the Yao Realm, were kneeling towards the mountain range with expressions that were full of grief. A couple of ladies amongst them had involuntarily cried. Having been constantly living under the protection of the Yao clan all their lives, they had never felt so helpless and hopeless before.</p><br/><p>Compared to the others, Yao Tian and Yao Ling were a little calmer. Although there was still an endless despair within their eyes, they did not display it on their face. The both of them had matured greatly after experiencing this great change.</p><br/><p>“Mister Xiao Yan, there is nothing that we can do to repay this great favour of yours. If there is a change in the future, the Yao clan will definitely repay you with our lives!” Yao Tian turned around, cupped his hands tightly towards Xiao Yan and spoke in a deep voice. Beside him, Yao Ling had also gathered her pretty eyes onto Xiao Yan and bowed slightly.</p><br/><p>“All of you should continue living. There is no need to repay anything. If it is not because those elders from the Yao clan had sacrificed their lives to fight, no one would be able to escape.” Xiao Yan waved his hand. His heart also felt some pity towards the misfortune that had befell Yao Tian’s group. From today onwards, Yao Tian was no longer the brightest star of the Yao clan. The latter would be just like him and needed to rely on his own strength. Whether Yao Tian could revived the clan would determine on his own ability.</p><br/><p>“What should we do next?” Yao Lao sighed and asked.</p><br/><p>“The Hun clan is far too brutal. There are many chiefs and Elders from the various sects on the Central Plains who had been killed by them this time around. If news of this spread, the Hun clan will definitely become the common enemy of everyone. However, these factions are just like ants from the perspective of the Hun clan and they will have difficulty catching its attention…”Xiao Yan revealed an expression of deep thought. A moment later, he said, “We must head to the Gu clan. Currently, the only one able to fight with the Hun clan is the Gu clan. They will definitely not stand idly and watch after such a thing had happened. At that time, only by combining with the Yan and Lei clan will it be possible to restrain the Hun clan. Otherwise, the other ancient clans will also have difficulty escaping this great calamity.”</p><br/><p>From the way the Hun clan was able to easily eliminate the Yao clan, even the Yan and Lei clan would likely end up with the same fate. Of course, the Sky Mansion Alliance would likely end up with an even more miserable fate. In terms of foundation, the alliance still had some gap when compared with these ancient clans.</p><br/><p>Xiao Yan had never believed that the Hun clan would let the Sky Mansion Alliance off. Hence, he must think of a solution as soon as possible. Otherwise, when the Hun clan attacks the alliance, the result would not be any better than the scene today.</p><br/><p>“Teacher, you should first return to the alliance and make arrangement. Raise the defence level to its highest. Those that need to be shifted should proceed secretly. Tell everyone to be cautious.”</p><br/><p>Yao Lao hesitated upon hearing this. Finally, he nodded. Given his strength, he would not be able to provide Xiao Yan with much of a help by following the latter. Instead, he would only be a burden.</p><br/><p>“The Shennong Mountain Range is not longer safe. I shall accompany you to the Sky Mansion Alliance. I heard that that old demon from the Pill Tower is also there. It has been many years since I have seen him. I really wish to meet him.” Old Man Shen Nong hesitated for a moment before speaking. The Hun clan was also targeting him. If he continued to remain alone, he would really be unlucky if the Hun clan was to discover his trail.</p><br/><p>Xiao Yan was also startled upon hearing these words. He immediately rejoiced. This Old Man Shen Nong was not only a six star Dou Sheng but his alchemist skills was something that few could match. If he could stay at the alliance, the strength of the alliance would soar greatly. Xiao Yan was naturally happy to see such a situation.</p><br/><p>“Yao Tian, both you and your sister should head with me to the Gu clan. The both of you will need to explain the matter of the Yao clan in order for those Elders from the Gu clan to believe. The remaining people should head to the Sky Mansion Alliance first. What do you say?” Xiao Yan looked towards Yao Tian and Yao Ling and asked.</p><br/><p>“We will listen to mister Xiao Yan’s orders.” Yao Tian and Yao Ling exchanged glances before nodding their heads. Although Xiao Yan was not very old, they clearly understood in their hearts that there was indeed an extremely great gap between them and Xiao Yan.</p><br/><p>“In that case, let’s get going…”</p><br/><p>Xiao Yan sighed softly. His internal injuries had been significantly recovered during this short period of time. His voice had just sounded when his expression suddenly changed. He turned his head abruptly and looked at a mountain a short distance away. There was a figure carrying a huge dark red ghost blade on his shoulder leaning on a huge tree. Those savage red eyes appeared just like a bloody sea.</p><br/><p>“Ugh, have I been discovered…”</p><br/><p>A ferocious smile rose on that figure’s face after he detected Xiao Yan’s gaze. An evil aura suddenly soared.</p><br/>\n</div>"}