{"title": "Chapter 1585: Intermediate Six Star", "id": 1585, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1585-intermediate-six-star", "volume_title": "Volume 16", "body": "<h1>Chapter 1585: Intermediate Six Star</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1585: Intermediate Six Star</u></strong></p><br/><p>Xiao Yan’s tensed heart also let out a heavy sigh after hearing Gu Yuan’s words. He had already personally witnessed the frightening strength of the Hun clan. Other than the Gu clan, it was likely extremely hard to find any other faction on the Dou Qi continent other than the Gu clan, which could fight it. If the Gu clan still choose to do nothing, the Sky Mansion Alliance would likely be faced with a threat to its survival…</p><br/><p>The many Elders from the Gu clan within the large hall also revealed a somewhat complicated expression after seeing Gu Yuan making his decision. They understood that the Gu clan would not be able to change its decision after today. The two largest super factions on the Dou Qi continent was finally able to fight again after a thousand years. Moreover, this time around, it would likely be a real life and death battle!</p><br/><p>The victor survives while the loser dies!</p><br/><p>Gu Yuan’s decision quickly spread to the entire upper echelon of the Gu clan. In an instant, the atmosphere within the Gu Realm became a little tense. Many experts were being dispatched to the Central Plains to closely monitor every action of the Hun clan.</p><br/><p>Xiao Yan did not immediately leave the Gu Realm while the Gu clan had entered into a cautious state. There was still quite a lot of energy from the tier 9 Mysterious Pill lingering within his body. Having these energy remaining in his body was not beneficial to him. Hence, he must swiftly refine it. Otherwise, these wild and violent energy might once again cause him body some harm.</p><br/><p>A bamboo house stood on a quiet mountain. Gentle breeze blew and the bamboo forest swayed. It appeared just like a green ocean wave.</p><br/><p>“Xiao Yan ge-ge, the medicinal ingredients you need are all here. Is there anything else that you are missing?” Xun Er stood prettily within the bamboo house. Her elegant clothes could not hide her alluring beautiful figure. Her unusually exquisite pretty face contained a gentle smile. Any heroic like person would become soft under that smile.</p><br/><p>Many jade boxes were floating in front of Xun Er. Various shocking energy was vaguely scattered from within the jade boxes. Clearly, they were not ordinary things.</p><br/><p>Xiao Yan randomly glanced with his eyes before focusing on the most beautiful figure. He stepped forward and hooked with his arm. The delicate wrist was unceremoniously pulled into his embrace as he laughed, “I am still lacking a beauty…”</p><br/><p>Xun Er’s pretty face turned slightly red upon hearing Xiao Yan teasing her. She glared at him, only to appear extremely exchanting. This caused Xiao Yan to feel his eyes becoming a little heated. The temptation when this goddess like beauty in the hearts of the younger generation of the Gu clan revealed such a bewitching expression was really irresistible.</p><br/><p>Xun Er gently leaned in Xiao Yan’s embrace. Her somewhat icy cool hand suddenly removed Xiao Yan’s clothes gently. A couple of finger large red bloody scars were revealed. It had been left behind by one of the four demon saints of the Hun clan, Hun Yan, back at the Yao Realm. Although the injury had been turned into a couple of shallow bloody scars, it was still possible to guess just how serious the injury was back then.</p><br/><p>Xun Er’s finger touched these bloody scar. Those crystal like clear eyes revealed a little heartache. She gently clenched her teeth and softly said, “These fellows from the Hun clan really deserve to die.”</p><br/><p>“Ha ha, it is only a small wound…” Xiao Yan laughed. He quickly held Xun Er’s face and directly bit on her gently lips. After which, he finally laughed loudly and released her face, which had become embarrassed. His body moved and he appeared on the bed. With a wave of his hand, the many jade boxes split apart and turned into various medicinal ingredients, which floated in front of him.</p><br/><p>“Xun Er, help me stand guard. I need some time to refine the Mysterious Pill’s medicinal strength in my body. Try to prevent anyone from disturbing me during this period of time.”</p><br/><p>Xiao Yan’s expression became grave as he entered into a serious topic. He let out a low cry and Little Yi swiftly appeared on his shoulder. It widened its mouth. A fire cauldron flew out and directly absorbed all of these floating medicinal ingredients.</p><br/><p>The redness of Xun Er’s face slowly diminished after she saw Xiao Yan began his refinement. She nodded gently and softly withdrew from the room. She flipped her hand and shut the door. Only then did her hand touched her lips. Her eyes revealed a gentle expression.</p><br/><p>“Ha ha, young miss…”</p><br/><p>An elderly laughter suddenly sounded from behind Xun Er while she was being absent minded. Xun Er hurriedly turned around and looked at Ling Ying a short distance behind. Her pretty face reddened as she immediately grinned and said, “Old Ling.”</p><br/><p>Ling Ying smiled kindly. He walked to Xun Er’s side and his eyes looked into the room. Suddenly, he muttered to himself, “Young miss’s eyesight is indeed far from this blurry old eyes of mine can compare with. Although I have sensed that young master Xiao Yan’s achievement in the future will likely be quite great back then, I have never imagined that he will be able to reach his current level…”</p><br/><p>Xun Er smiled sweetly. Those sparkling pretty eyes contained some pride. She might still remain calm and indifferent when others praised her. However, if they were to praise Xiao Yan, her heart would involuntarily reveal a joy.</p><br/><p>“Ugh, recalling what happened back then really leaves one absentminded. Over a decade ago, young master was still doing his best in order to defeat a mere Nalan Yanran. Now, however… even the clan head acknowledged his achievement.” Ling Yan laughed as he cherished those memories.He still remember that he had even secretly rapped Xiao Yan before. After all, the both of them were in two completely different worlds back then. At that time, Xiao Yan would not be able to successfully be with Xun Er no matter what. However, these decades of continuous effort had allowed the useless person from the Xiao clan back then to reach the peak of the continent.</p><br/><p>Xun Er sat on the stairs. Her hands held her cheeks and her pretty eyes appeared distant. Finally, she smiled gently. She was very fortunate that she had spent her childhood living in that small Wu Dan City. Regardless of whether it was now or in the future, the memories would be retained deep within her heart.</p><br/><p>The medicinal pills that Xiao Yan needed to refine were not of a very high tier. However, it was a little unfamiliar to him. This was because the medicinal pills had the effect of resolving the wild and violent force within the tier 9 Mysterious Pill and allow him to successfully refine the energy from it.</p><br/><p>Although it was possible to gradually refine the medicinal strength by relying on the Purifying Demonic Lotus Flame, the speed of doing so was not only slower but it would also result in quite a big loss for Xiao Yan. A tier 9 Mysterious Pill was not something that he could simply refined as he pleased. If it was not because he had absorbed the energy of the other three embryonic pill, which resulted in some unexpected changes, it was impossible for him to really refine a tier 9 Mysterious Pill. Since he had already consumed it, he must definitely maximize its effect.</p><br/><p>With Xiao Yan’s current skill, he only required half a day or so to refine these medicinal pills. There were already three different coloured medicinal pill floating in front of him when by sunset.</p><br/><p>The three medicinal pills were the size of a thumb. They had different colours but were filled with spirituality.</p><br/><p>Xiao Yan opened his eyes. He widened his mouth and directly swallowed the three medicinal pills into his body. His body quickly moved and hurried into the fire cauldron in the midair. Little Yi waved its hand and a pink fire dragon wrapped around Xiao Yan’s body.</p><br/><p>After the three medicinal pills entered Xiao Yan’s body, most of the medicinal strength from the tier 9 Mysterious Pill still lingering within it began to loosen. Adding the support from the Purifying Demonic Lotus Flame, the hard energy crystals were quickly melted. It turned into an extremely powerful liquid energy that flowed fiercely within Xiao Yan meridians. At the end, it even emitted waves of swoosh swoosh sound.</p><br/><p>Xiao Yan sat within the cauldron. His expression was solemn. With an increasing amount of energy being refined into powerful Dou Qi that merged into his body, his aura, which had just broken through the six star Dou Sheng class, had gradually become firm and even showed signs of once again climbing slowly. The frightening strength of a tier 9 Mysterious Pill was once again unleashed.</p><br/><p>This refinement by Xiao Yan continued for ten days in the blink of an eye. During these ten days, the energy of the energy of the tier 9 Mysterious Pill within Xiao Yan’s body had been refined a cluster at a time. Finally, it turned into churning Dou Qi, which merged into his body.</p><br/><p>On the eleventh day, Xiao Yan, who was in the cauldron, slowly opened his eyes. Immediately, many fire dragons rapidly entwined around his body. Finally, it turned into fire lines that were inhaled into his nose. The fire cauldron had also quietly disappeared.</p><br/><p>Xiao Yan’s feet gently landed onto the ground. He shut his eyes and sensed his surroundings. A satisfied smile immediately rose onto his face. The result of this refinement was within his expectations. His strength was not only stabilized at the six star Dou Sheng class but he had even leaped into the intermediate six star Dou Sheng class. This tier 9 Mysterious Pill had actually allowed his strength to soar by one star. Its effect was really praise worthy. A tier 9 Mysterious Pill was indeed extraordinary.</p><br/><p>“Unfortunately, at this level, my body has already become quite sensitive towards the medicinal strength. Even if I consume another tier 9 Mysterious Pill in the future, it will likely not produce such a result. Unless I consume the even higher grade tier 9 Golden Pill…”</p><br/><p>Xiao Yan clenched his hand. He immediately felt some regret. If the tier 9 Mysterious Pill still possessed such an effect, he would do his best to refine it a couple more times. After all, if he was to train normally, he would at least need many years in order to advance by one star. Yet, a tier 9 Mysterious Pill was able to shorten this by dozens of times.</p><br/><p>“Creak…”</p><br/><p>The door was slowly pushed opened as Xiao Yan ended his training. Xun Er smiling walked in. Her beautiful figure was full of temptation under the sunlight.</p><br/><p>“Xiao Yan ge-ge, congratulations on the advancement of your strength…”</p><br/><p>Xiao Yan smiled after seeing Xun Er’s saucy smile. He rubbed his hands together. With his current strength, he was able to use the power of the Nine Mysterious Golden Lightning. However, there was ultimately a limit to such a strength. Hence, he should not easily used it unless it came to a critical moment.</p><br/><p>“Xiao Yan ge-ge, the members of the Yan and Lei clans have already arrived at the Gu clan. Father has said to invite you over.”</p><br/><p>“Oh? Have they finally arrived.. “</p><br/><p>Xiao Yan lifted his brow. He immediately nodded. Currently, he was not alone. There was still the Sky Mansion Alliance behind him. Even an ancient clan like the Gu clan would not easily disregard this large faction on the Central Plains.</p><br/>\n</div>"}