{"title": "Chapter 1599: Di State Soul", "id": 1599, "volume": 16, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1599-di-state-soul", "volume_title": "Volume 16", "body": "<h1>Chapter 1599: Di State Soul</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1599: Di State Soul</u></strong></p><br/><p>“Ancestor…”</p><br/><p>Xiao Yan looked at Xiao Xuan, who was smiling warmly. His nose involuntarily felt a little soul.</p><br/><p>“Refine and absorb it…” Xiao Xuan grinned. He flicked his finger and the crystal clearly light cluster in front of him slowly flew downwards. Bright light was continuously emitted from within. It appeared just like a warm sun.</p><br/><p>Xiao Yan watched the crystal clear light cluster suspended in front of him. The vast and mighty Spiritual Strength spreading within it was as deep and unfathomable as the ocean. Even his perfect Heavenly State soul appeared quite tiny in front of this Spiritual Strength. The Heavenly Tomb soul was formed by the soul fragments of countless of experts after their deaths. The Spiritual Strength it contained could only be described as terrifying.</p><br/><p>“Ancestor, Xiao Yan will definitely revive the glory of the Xiao clan!”</p><br/><p>Xiao Yan inhaled a deep breath of air. He once again knowtow respectfully towards Xiao Xuan in the sky. After which, he did not say anything more. He took a stride forward and directly walked into the bright light cluster. Immediately, a light flashed and swallowed Xiao Yan’s entire body into it.</p><br/><p>Xiao Xuan’s body appeared a little pale as he stood in the sky. He looked at the crystal clear light cluster, which appeared just like a sun. A pleased smile was formed on his face. He was extremely satisfied with this descendant. Perhaps, Xiao Yan was able to finish what he was unable to do back then…</p><br/><p>“There’s still some time. Hopefully, I can wait until you exit your retreat…”</p><br/><p>Xiao Xuan muttered. He immediately sat outside of the light cluster. Those calm eyes occasionally swept over the ground. All the energy bodies hurriedly looked away and back off by a great distance under his glance. The Spiritual Essence of the Heavenly Tomb soul was a great temptation to them. However, it was clear that no one dared to allow this temptation to take root under the deterrence of Xiao Xuan.</p><br/><p>This place was a seemingly endless sea. Waves churned over the sea. There seemed to be waves of roars that originated from within one’s soul resounding over this place.</p><br/><p>Xiao Yan’s body floated in the air above the sea. His eyes looked towards the sea below. There was a dense shock within his eyes. The light cluster did not appear large but he did not expect that there was another world behind it. After Xiao Yan’s probing of this sea, he had ended up with a shocking conclusion. This sea was actually completely formed by Spiritual Strength.</p><br/><p>It was the first time that Xiao Yan had seen such a vast and mighty frightening Spiritual Strength. Compared to this Spiritual Sea, his perfect Heavenly State soul appeared to be completely insignificant.</p><br/><p>“Unexpectedly, the Heavenly Tomb soul is this terrifying. No wonder even Ancestor has to ignite his own soul…” Xiao Yan frowned tightly. Only at this moment did he understand why Xiao Xuan would have to use this kind of mutual suicide method when attacking the Heavenly Tomb soul despite his ability. It was actually because even Xiao Xuan did not have the confidence to defeat the Heavenly Tomb soul in his normal state.</p><br/><p>“The Heavenly Tomb soul had already disappear. All the Spiritual Strength is this place does not have an owner…”</p><br/><p>Xiao Yan’s throat rolled involuntarily. If rumours of this was to spread, it was likely that all the experts from the continent would rush over in a crazy fashion. As long as one was able to refine the Spiritual Strength of this place, their soul would definitely reach a relatively terrifying level. It was even possible to reach that legendary Di State soul!</p><br/><p>This gift that Xiao Xuan had bestowed upon him was a really great one.</p><br/><p>Xiao Yan clenched his fist tightly. His eyes also gradually became determined. Now was not the time to be indecisive. The reason Xiao Xuan had paid such a hefty price to provide him with this gift was to allow him to possess some ability to resist the Hun clan. Xiao Yan currently did not have much time left. He must not waste it!</p><br/><p>“The flow of time in this place is also different compared to the Heavenly Tomb…”</p><br/><p>Xiao Yan lifted his head. He looked at this space and a grave expression was formed in his eyes. He discovered that the richness of the Spiritual Strength in this place had actually altered the flow of time. From a certain point of view, this was a Heavenly Tomb that had been shrunk by many times. However… the flow of time in this place was likely even slower than that of the Heavenly Tomb.</p><br/><p>A Heavenly Tomb within the Heavenly Tomb!</p><br/><p>“Hu!”</p><br/><p>Xiao Yan let out a long breath. He gradually steadied his emotions. The time in this place was slowly than that of the Heavenly Tomb. This was good for him. Otherwise, he did not know if he was really able to refine all of these vast and mighty spiritual sea within two months or so…</p><br/><p>Xiao yan sat in the air. His body slowly descended from the sky and landed on the surface of the sea. Spiritual Strength swiftly surged out from his brow. After which, a low cry sounded and it turned into a huge illusory figure that was a couple of thousand feet in size. The illusory figure covered around Xiao Yan and sat down.</p><br/><p>Fierce Purifying Demonic Lotus Flame began to spread from within the huge spiritual illusory body. It directly dyed the spiritual illusory figure into a flame covered person. A terrifying heat spread throughout this space.</p><br/><p>“Rumble!”</p><br/><p>The Spiritual Sea, where Xiao Yan was located, began to whistle after the Purifying Demonic Lotus Flame covered Xiao Yan’s spiritual illusory body. A ten thousand feet large swirl was formed below it. Spiritual Strength shot out from all directions. It seemed to have suffered a kind of intense pull as it began to turn into many thousand feet large spiritual water pillar that continuously shot into the huge spiritual illusory figure.</p><br/><p>“Sizzle sizzle!”</p><br/><p>The seemingly real spiritual water pillar heavily smashed onto the spiritual illusory figure. However, waves of sizzling sound was erupted after the spiritual water pillar touched the Purifying Demonic Lotus Flame. Dense white fog rose. Finally, it turned into a cloud that covered Xiao Yan’s huge spiritual illusory body.</p><br/><p>The spiritual strength of this place might be considered vast and mighty but it was a little mottled. After all, the Heavenly Tomb soul had been formed by absorbing countless of souls belonging to dead experts. However, this was not considered troublesome for Xiao Yan, who possessed the Purifying Demonic Lotus Flame. The purification ability of the Purifying Demonic Lotus Flame was extremely useful when it came to refinement. Moreover, there was also Little Yi present within Xiao Yan’s body. With just a thought, all of the purifying ability would merge into the spiritual strength within his body and refine it into the purest form.</p><br/><p>Many huge spiritual water pillars continuously leaped from the surface of the vast and mighty sea like huge pythons. Finally, they poured onto the spiritual illusory figure seated in the sky. It caused the huge illusory figure to gradually emit a fluorescent light after a fog that could cover the sun was erupted. Looking from a distance, it actually appeared like a divine statue standing in this world and was filled with a monstrous pressure.</p><br/><p>This refinement effect could cause many to be greatly shock. The spiritual sea had also began to form many huge waves with the flow of time as it continuously rumble over this world.</p><br/><p>While Xiao Yan was devouring and refining the spiritual strength like a whale, the pressure emitted from his soul also gradually became increasingly terrifying. His surging spiritual strength gradually approached the legendary state at a steady pace…</p><br/><p>One month passed. It had been a month within the Heavenly Tomb since Xiao yan had entered the cluster of light. Xiao Yan did not show any sign of exiting his retreat during this month. The interior of the light cluster did not emit any strange fluctuation. Everything was exactly the same as one month ago…</p><br/><p>Xiao Xuan was quietly sitting outside of the crystal clear light cluster. Both of his eyes were slightly shut. He appeared like a meditating monk. His body had become much paler as compared to a month ago. Moreover, from his appearance, he had also began to age. Everyone could tell that he was already about to reach the end of his life. However, he continued to wait persistantly.</p><br/><p>Many energy bodies on the ground watched Xiao Xuan’s gradually paling body. They felt some grief. The saddest thing was the fall of a hero. Xiao Xuan was a matchless individual both when he was alive and when he was dead. However, he was now merely showing the lethargy of an ordinary old man.</p><br/><p>The eyes under the white eyebrow twitched. They were slowly opened. His elderly face revealed a smile as he looked at the cluster of light in front of him. His body had also become a lot more illusory at this moment.</p><br/><p>“Little fellow, my time’s almost up…”</p><br/><p>The old man’s soft mutter resounded over the sky.</p><br/><p>One month within the Heavenly Tomb was just like a year for Xiao Yan, who was deep within the spiritual sea.</p><br/><p>The enormous spiritual illusory figure sat on the sea. Rich cloud covered the entire world. The spiritual illusory figure had become increasingly real. At the end, it had basically been turned into a real giant that was a couple of thousand feet in size. That manner was as though it was a Xiao Yan that had been magnified by many times.</p><br/><p>Xiao Yan’s breathing was just like thunder. A dense cloud surged into his nostrils like a dragon cloud. His hair was like a ten thousand feet huge waterfall. His clothes fluttered and a kind of terrifying huge wave was stirred on the surface of the sea. A king of the world like aura seemed to be vaguely emitted from the enormous spiritual body.</p><br/><p>This aura was as though his was the overlord of souls!</p><br/><p>Many energy bodies quietly sigh after the final day of the second month within the Heavenly Tomb had arrived. This was because the elderly figure in the sky had paled until it was almost invisible. Even though this was the case, the old man continued to wait quietly. An obsession seemed to have allowed him, who had reached his end, to remain in this world.</p><br/><p>“It seemed… I am unable to wait for it to happen.”</p><br/><p>The already transparent like figure in the quiet sky fluctuated slightly. Xiao Xuan grinned. His eyes revealed a little regret.</p><br/><p>“Little fellow, I feel extremely rest assured that the Xiao clan has you. Goodbye…”</p><br/><p>Xiao Xuan’s eyes were slowly shut. His body also became increasingly pale.</p><br/><p>“Bang!”</p><br/><p>However, the space within the Heavenly Tomb suddenly trembled intensely while Xiao Xuan’s body was about to disappear. A ripple that seemed to belong to the overlord of the world swiftly spread. All the energy bodies involuntarily shuddered wherever the fluctuation spread. That pressure could not be resist.</p><br/><p>The eyes of Xiao Xuan, who was about to vanish, finally revealed a pleased expression after detecting this fluctuation.</p><br/><p>“This descendant Xiao Yan bids Ancestor farewell!”</p><br/><p>In front of countless pairs of shocked eyes, a ten thousand feet large figure, which caused one to hold one’s breath, swiftly appeared in the sky. Immediately, the figure slowly knelt down towards Xiao Xuan.</p><br/>\n</div>"}