{"title": "Chapter 1603: Burial Sky Mountain Range", "id": 1603, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1603-burial-sky-mountain-range", "volume_title": "Volume 17", "body": "<h1>Chapter 1603: Burial Sky Mountain Range</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1603: Burial Sky Mountain Range</u></strong></p><br/><p>The Burial Sky Mountain Range stood at the north-western region of the Central Plains. It was likely that many on the current continent were unfamiliar with this region. However, it was extremely well known to some of the older generation of the ancient clans. This was because this place was where the Hun and Xiao clans had fought back then. The big war had once shook the entire Central Plains.</p><br/><p>There was an ancient battlefield deep within the mountain range. The battlefield was extremely vast and there was usually many Magical Beasts present. It could be considered a dangerous place. Hence, it appeared a little desolated.</p><br/><p>The ancient battlefield today appeared somewhat mysterious. Those Magical Beasts which used to roam unchecked, had completely disappeared. It was actually impossible to find even a single Magical Beast on this huge battlefield. That scene appeared as though they had detected an earthshaking big battle that was about to erupt in this place.</p><br/><p>“Swoosh swoosh!”</p><br/><p>A series of loud rushing wind sound suddenly resounded over the mountain range, which all was absent of all beast roars. One could see a large number of figures appearing in the horizon. Within a couple of flashes, they had appeared in this ancient battlefield.</p><br/><p>“We have arrived…”</p><br/><p>Gu Yuan’s feet gently landed on the ground. His eyes swept over this battleground that had been turned into ruins. His eyes appeared a little complicated. The big war between the Hun and Xiao clan back then had begun in this place. It was unexpected that their battle with the Hun clan would also begin in this place thousands of years later.</p><br/><p>“Search the mountain range.”</p><br/><p>Many experts from the three clans rushed forward after everyone had just landed. They swiftly gave this mountain range a brief search as a precaution against any ambush that the Hun clan had placed.</p><br/><p>“It seems that the Hun clan has yet to arrive.” Yan Jin stepped forward. He looked at this somewhat desolated ancient battleground and remarked.</p><br/><p>Gu Yuan nodded slightly. Other than some Magical Beasts which were trembling under their pressure, there was no signs of any auras from the experts of the Hun clan.</p><br/><p>“Those from the Sky Mansion Alliance have arrived.” Xiao Yan suddenly lifted his head and smilingly watched the northern sky. Some familiar ripples was vaguely emitted from that spot.</p><br/><p>Everyone looked in the direction after Xiao Yan’s words sounded. However, they were unable to see anyone. Nevertheless, no one doubted Xiao Yan’s words at this moment. Other than Gu Yuan, it was likely that no one else present could compare with Xiao Yan in terms of Spiritual Strength.</p><br/><p>Soon after everyone focused their eyes, some rushing wind sound had suddenly appeared in the northern sky. After which, a black mass of human figures rushed over from all directions. Their numbers was actually not any inferior to the number of people the three clans mobilized.</p><br/><p>“It looks like the Sky Mansion Alliance has really dispatch all its strength.” A surprise flashed over Yan Jin’s and Lei Ying’s eyes as they looked at the vast and mighty lineup. Although the Sky Mansion Alliance might be inferior to the Yan and Lei clans in terms of elites, the number of experts they possessed had reached a terrifying level.</p><br/><p>“Ha ha, it seems that we are not late…”</p><br/><p>Black shadows swiftly appeared in the mountain range from all directions in front of everyone’s eyes. The person in front was naturally Yao Lao. Behind him were Cai Lin, Little Fairy Doctor, Xiao Chen and the others. Even the ancestor of the Pill Tower and Old Man Shen Nong had followed. It seemed that Yao Lao had the others had been busy recruiting this elder, who possessed an extremely great attainment in alchemist skills.</p><br/><p>Both parties had naturally engaged in polite conversation as the large army gathered. The ancestor of the Pill Tower and Old Man Shen Nong could be considered to be familiar with the three clans. They naturally had a lot to talk now that they had met. Xiao Chen, only the other hand, merely glanced at those from the three clans before walking towards Xiao Yan.</p><br/><p>“Are you alright?”</p><br/><p>Xiao Chen glanced at Xiao Yan. His stern face revealed a smile as he asked.</p><br/><p>Xiao Yan also grinned in the face of this kin, who could also be considered his ancestor. He nodded. However, he did not tell Xiao Chen about what had happened to Xiao Xuan at this moment. He understood that Xiao Chen and Xiao Xuan were very close. If the former was to learn about this news, it would likely be a big blow to him. Hence, there was no harm in temporarily keeping it a secret.</p><br/><p>A fragrance suddenly pounced over while Xiao Yan was chatting with Xiao Chen. He lifted his head and saw Cai Lin’s bewitching cold face.</p><br/><p>Xiao Yan rubbed his nose and laughed dryly after seeing Cai Lin’s somewhat cold manner.</p><br/><p>“Elder sister Cai Lin, we have met again. Is Xiao Xiao doing well?”</p><br/><p>Xun Er, who was standing beside Xiao Yan, saw Cai Lin slowly walking over. A ripple appeared in her eyes before she inquired with a gentle smile.</p><br/><p>Cai Lin’s cold face revealed a slight smile upon hearing this. He softly said, “Aye, she’s well. However, she is bemoaning that a certain person being absent from home all the time.”</p><br/><p>Xun Er smiled upon hearing those words. Xiao Yan by the side could only shake his head helplessly. It seemed that Cai Lin was a little displeased that he had been missing for such a long time.</p><br/><p>“Are your injuries healed?” Cai Lin curled her lips slightly after seeing Xiao Yan’s manner. Her tone was suddenly a lot gentler. Although she was a little angry with Xiao Yan for not returning home despite being injured, rational thought still dominated her mind. That feeling was merely something that a woman normally had.</p><br/><p>“Aye, I’m fully recovered…” Xiao Yan smiled. He immediately swept his gaze around and asked, “Isn’t the alliance afraid of someone destroying its foundation with so many of its experts being dispatched?”</p><br/><p>“Yao Lao has said that this is very important to you…” Cai Lin replied.</p><br/><p>Xiao Yan was startled. His heart immediately became warm.</p><br/><p>With the arrival of the army from the Sky Mansion Alliance at the ancient battlefield, the entire mountain range had quickly became a lot more lively. Moreover, there were also many experts from the Central Plains outside of the mountain range who had been attracted because of the activity. However, they did not dare to step into the mountain range after arriving at the Burial Sky Mountain Range. This was because they could sense that the auras gathered in this place had reached a terrifying level. If they were to be dragged into a battle at such a level, it was very likely that they would end up dying…</p><br/><p>After a brief interaction following the gathering both both parties, everyone once again became cautious. Their sight spread over the place and encompassed the entire Burial Sky Mountain Range. Any activity present would be immediately feedback to Xiao Yan’s group.</p><br/><p>Time slowly passed amidst this wait. The moment the bright sun reached its peak, Xiao Yan and Gu Yuan, who had been sitting on a huge rock, suddenly opened their eyes together. A low voice caused everyone to become suddenly tensed.</p><br/><p>“They have arrived…”</p><br/><p>The interior of the mountain suddenly revealed layers of black fog after the voices of those two sounded. Black fog lingered over the place. Finally, it turned into a huge spatial tunnel. Numerous mighty sinister auras surged from it.</p><br/><p>Black fog surged in the sky and directly cut off the sunlight. Immediately, the temperature of the surroundings fell. A kind of dark and cold aura spread.</p><br/><p>“Ha ha, this Burial Sky Mountain Range has not been so lively for a long time…”</p><br/><p>The black fog churned in the sky and Hun Tiandi’s figure appeared from nowhere. His eyes swept over the large army below. A smile appeared on his face as he spoke.</p><br/><p>The Nihility Devouring Flame, the four demon saints of the Hun clan and many other Hun clan’s experts also flashed and appeared behind Hun Tiandi. It seemed that the Hun clan was also clearly aware of the battle today. Hence, it had also maneuvered quite a lot of experts.</p><br/><p>“Hun Tiandi, return the ancient jades of our three clans. Otherwise, we will definitely attack your Gu Realm in the future!”</p><br/><p>Lei Ying let out a cold cry. His expression sunk after seeing Hun Tiandi appeared. Losing the ancient jade had caused him to be extremely furious. Naturally, he could not suppress the anger in his heart now that he had seen the other party.</p><br/><p>“Attacking the Hun Realm. Ha, there is perhaps no one with the strength to do so in the present world…” Hun Tiandi laughed out loud in the face of Lei Ying’s furious cry. He immediately ignored the former as his eyes were thrown towards Xiao Yan. He spoke in a faint voice, “What do you plan to do? Are you going to use the ancient jade to exchange for the person you want or are you going to forcefully snatch him?”</p><br/><p>“I wish to meet my father!”</p><br/><p>Xiao Yan’s eyes did not shift away as he stared at Hun Tiandi and slowly said.</p><br/><p>Hun Tiandi glanced at Xiao Yan upon hearing this. He immediately waved his hand and the space behind him fluctuated. The sound of chains soon sounded. After which, a prison, which was formed from black fog, appeared in the sky. There was an elderly figure seated within. Many chains tightly entangled around him like poisonous snakes.</p><br/><p>Xiao Yan’s eyes were focused on that elderly figure the moment the prison appeared. His body involuntarily trembled.</p><br/><p>Although it was a little blurry, the blood flowing within Xiao Yan immediately told him that the figure was indeed his father, Xiao Zhan!</p><br/><p>Decades had passed. The high spirited clan head from back then had become this white haired elderly figure. His originally strong body had become skinny and frail during this time. He ahd been imprisoned for decades!</p><br/><p>Xiao Yan’s body continued to tremble. He looked at the heavy metal chains on that elderly figure. Waves after waves of wild murderous intent churned within his heart. He clenched his fist tightly allowing his nails to press into his palm. Droplets of blood rolled out from them and fell.</p><br/><p>“Hun Tiandi, if I have the opportunity to do you, I will turn your Hun clan upside down!”</p><br/><p>Xiao Yan’s blood red eyes suddenly turned towards Hun Tiandi. His voice was hoarse and low. At the same time, an incomparably frightening spiritual fluctuation spread in wave like fashion with him at the centre. Immediately, dark clouds churned and thunder roared.</p><br/><p>“Di State Soul?”</p><br/><p>Those experts from the Hun clan, who had just gave Xiao Yan a smile of disdain suddenly had stiffened expressions after the spiritual fluctuation was emitted. Even Hun Tiandi finally had a slightly altered expression. Clearly, he did not expect that Xiao Yan’s Spiritual Strength had actually soared until such an extent within a short half a month.</p><br/><p>“What a great Xiao Yan…”</p><br/><p>Hun Tiandi’s voice was low and deep. There was a faint murderous intent within it. The current Xiao Yan had finally caused him to feel a little threatened.</p><br/><p>“Xiao… Xiao Yan?”</p><br/><p>The elderly figure being heavily restrained by the metal chain within the cage suddenly trembled because of Hun Tiandi’s words. He slowly lifted his head. A turbid expression appeared in his eyes. Finally, they paused on the black clothed young man, who was floating in the sky a short distance away. His body stiffened immediately. Tears rolled down from his eyes. His hoarse elderly voice was filled with an incomparable sadness.</p><br/><p>“Yan… Yan-er…”</p><br/>\n</div>"}