{"title": "Chapter 1604: Father-Son Reunion", "id": 1604, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1604-father-son-reunion", "volume_title": "Volume 17", "body": "<h1>Chapter 1604: Father-Son Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1604: Father-Son Reunion</u></strong></p><br/><p>The entire place was completely silent. Only the elderly voice, which caused one to feel an endless amount of sadness reverberated across the sky.</p><br/><p>Xiao Yan was still a weak youth when they had separated back then. However, that separation at that time had lasted for decades. Hatred filled the youth’s heart during this long period of time. He had trained with all his might, escaping from death time and time again while breaking through his limit…</p><br/><p>All of it was merely to rescue his father, who had once doted on him and allow the latter to once again enjoy life in his old age.</p><br/><p>Gu Yuan and the others became quiet as he looked at the somewhat skinny young man in the air. They knew quite a lot about Xiao Yan’s past. Hence, they clearly understood just how much effort and sacrifice he had put in. An ordinary person was only able to see his extraordinary achievement. However, they had forgotten just how many life and death battles were hidden under this glaring achievement…</p><br/><p>“This fellow is really a man. No one in my Lei clan can compare with him…”</p><br/><p>Lei Ying sighed softly and muttered. Xiao Yan was able to slowly climb from being the tender youth back then until a giant that even they must regard seriously. Moreover, he also needed to escape from the assassins that the Hun clan had dispatched during this period of time. The difficult journey had not only failed to cause the youth to have an early death but had instead become a grindstone for him to step onto the path of the strong!</p><br/><p>All of them admitted that they would definitely be unable to do better than Xiao Yan if they were in his shoes.</p><br/><p>After all, Xiao Yan relied only on himself. The once prominent Xiao clan did not leave him with any wealth.</p><br/><p>The experts from the Lei clan were quiet in the face of Lei Ying’s soft sigh. They were unable to refute him.</p><br/><p>“Xiao Yan ge-ge…”</p><br/><p>Xun Er bit her lips softly. Her pretty eyes contained a redness as she looked at the repeatedly trembling back. She was able to sense the surging emotions in the latter’s heart. She was well aware of the effort Xiao Yan had put in during these years.</p><br/><p>That elderly figure within the prison lifted his hand with great difficulty. His eyes stared intently at the black clothed young man. He could still see some traces of the youth from back then on the already matured face. The son, whom he was once proud of, had really once again appeared in front of him.</p><br/><p>“Child…”</p><br/><p>Tears continued to flow from his eyes. After which, he suddenly pounced forward. His voice was hoarse as he roared, “Yan-er, leave!”</p><br/><p>After being imprisoned by the Hun clan for so many years, he was clearly aware of just how terrifying the Hun clan was. The Dou Huang or even Dou Zong, who could dominate the Jia Ma Empire back then was only considered ordinary in that place. Such a strength was sufficient to cause one to feel a sense of hopelessness.</p><br/><p>Xiao Yan looked at the elderly figure, who was being restrained by heavy metal chains. A moment later, he smiled and lifted his head. He inhaled a deep breath of air. Regardless of how much hardship he had suffered, his father was at the very least still alive.</p><br/><p>“What a touching scene…”</p><br/><p>Hun Tiandi laughed faintly. His eyes looked towards Xiao Yan and said, “Perhaps you should be thanking us. Your father has an ordinary talent. If he was to train normally, he will not be able to reach the Dou Huang class in his lifetime. In order to allow him to live safely until now, we have given him quite a lot of medicinal pills of our Hun clan. Otherwise, such accident might have long since happened to him…”</p><br/><p>“Aye, I will…”</p><br/><p>Gu Yuan and the others frowned upon hearing Hun Tiandi’s words. However, a smile rose on Xiao Yan’s face. He nodded gently and laughed, “You can be rest assured that Xiao Yan will remember this big favour.”</p><br/><p>Lei Ying and the others were startled as they looked at the smile on Xiao Yan’s face. A dense chill rose within their hearts. A person with a ferocious look was not terrifying. A terrifying person was someone who was able to keep a smile on his face while a murderous intent was surging within his heart.</p><br/><p>Hun Tiandi’s face twitched slightly. Xiao Yan’s talent was as glaring as Xiao Xuan back then. However, the former’s viciousness had clearly greatly surpassed Xiao Xuan.</p><br/><p>Hun Tiandi stared at Xiao Yan’s blood red eyes. He clearly understood that the words Xiao Yan had uttered earlier were not mere words of anger. If Xiao Yan was given the opportunity, Hun Tiandi believed that the former would definitely exterminate the entire Hun clan until none of them remained! However, it was likely extremely difficult for such an opportunity to appear…</p><br/><p>“Transaction?”</p><br/><p>Xiao Yan clenched his hand. An ancient jade flashed and appeared. It was the final Tuo She Ancient God Jade. Xiao Yan did not try using a counterfeit jade. This was because he understood that this method would not work on an expert like Hun Tiandi.</p><br/><p>A greed and desire flashed across Hun Tiandi’s eyes as he looked at the ancient jade in Xiao Yan’s hands. Once he obtained this final piece of ancient jade, he would learn of the location of the Tou She Ancient God Mansion and subsequently open it. At that time, he would truly leap into becoming the overlord of this world once he obtain the embryonic Di tier pill inside it. At that time, the so called alliance would be just like an ant in his eyes. A flip of his hand could easily destroy it…</p><br/><p>The bodies of Lei Ying’s group became a lot more tense after they saw Xiao Yan take out the ancient jade. However, no one uttered anything to stop Xiao Yan at this moment. From Xiao Yan’s appearance earlier, he would likely turn against anyone who tried to stop him from rescuing his father at this moment.</p><br/><p>“We will exchange the person and jade together. You should understand just how simple it is for me to kill your father. Hence, you better not allow me to see you pulling any tricks…” Hun Tiandi withdrew his eyes and slowly said.</p><br/><p>Xiao Yan glanced at Hun Tiandi. He spread his hand and the ancient jade slowly rose under his control. Seeing this, Hun Tiandi also waved his sleeve. The prison formed by the black fog scattered. With a flick of his finger, those metal chains on Xiao Zhans body were all released. Finally, he clenched his hand. It turned into a black ray of light that grabbed onto Xiao Zhan.</p><br/><p>“Here!”</p><br/><p>Hun Tiandi waved his large hand. Xiao Zhan was brought to Xiao Yan under the restrain of the black light. After which, a thought passed through Xiao Yan’s mind and the ancient jade also shot directly towards Hun Tiandi. At the same time, Xiao Yan pressed his toes on the air and shot forward. His large hand grabbed onto Xiao Zhan. A suction force erupted and he pulled the latter over. He slashed his hand downwards and the black restrain around Xiao Zhan’s body was cut.</p><br/><p>Hun Tiandi grabbed onto the ancient jade just as Xiao Yan had managed to rescue Xiao Zhan. Even with his calmness, he could not help but laugh out loud as he sensed the warmth in the ancient jade. Now that the ancient jade was in his hand, he was already able to see himself stepping into the stage that he dreamed of.</p><br/><p>“Father!”</p><br/><p>Xiao Yan’s excited body trembled involuntarily as he caught hold of Xiao Zhan. His body flashed and he quickly flew into the alliance. After which, he carefully placed Xiao Zhan down.</p><br/><p>“Yan-er… it is really you!”</p><br/><p>Escaping from the restraint and being rescued had occurred in a split second to Xiao Zhan. He had just recovered his focus when he saw the face that was in close proximity. His trembling hand touched Xiao Yan’s face. That terrified manner was as though he was afraid that this was only an illusion. This was in spite of him constantly hoping for this day to come.</p><br/><p>“Father, you have suffered. Sorry…”</p><br/><p>Seeing that thin ice like appeared of Xiao Zhan, even Xiao Yan could not help but feel his eyes turn red. Both of his legs heavily knelt in front of the former. Even the huge rock under him had ended up with many crack lines.</p><br/><p>“It is really you…”</p><br/><p>Xiao Zhan’s hands touched Xiao Yan’s face in a trembling fashion. He sensed the warmth and his tears rolled down uncontrollably. This scene caused all those around to feel sad.</p><br/><p>“Yan-er, quick get up. It is all because father is useless…”</p><br/><p>Xiao Zhan wiped off his tears. He hurriedly lifted Xiao Yan to his feet and looked at this face, which had become more matured than back then. His face involuntarily revealed a pleased expression. The thing that a father really wanted to see was the growth of his child. The person whom he was most worried about when he was captured back then was this youngest son. However, this child was his greatest miracle and pride...</p><br/><p>Xiao Yan inhaled a breath as he looked at the messy Xiao Zhan, who appeared much older compared to back then. He softly said, “Father, big brother and second brother are all waiting for you. I will bring you to meet them once the matter here is over. Now, however… allow me to settle some matters.”</p><br/><p>“Protect my father.” Xiao Yan turned his head and spoke to those experts from the Sky Mansion beside him.</p><br/><p>“Alliance chief, you can be rest assured that we will protect him until our deaths!”</p><br/><p>Those dozens of Sky Mansion experts, who had reached the peak of the the Dou Zun class, immediately replied respectfully after hearing this. Immediately, they moved and appeared around Xiao Zhan, providing him with a tight protection.</p><br/><p>“Yan-er, this…”</p><br/><p>Xiao Zhan was startled as he watched this scene. These people around him all possessed powerful and terrifying auras. They were considered quite strong even in the Hun clan. However, he felt a great disbelief in his heart as he watched these experts in his eyes being incomparably respectful when speaking to Xiao Yan. Could it be that the young son whom he had once needed to protect had already become this powerful?</p><br/><p>“Father, there is no need to worry. They will guard you.”</p><br/><p>Xiao Yan withdrew the emotions within his heart. He smiled slightly towards Xiao Zhan before turning around. An extremely dark and chilly murderous intent covered his eyes. The murderous desire in his heart had reached a rich and unrestrainable extent!</p><br/><p>Hence, he must kill!</p><br/><p>Gu Yuan, Lei Ying and the others threw their gazes over when Xiao Yan had turned around. They looked at him. There was also a chill surging in their eyes. The Hun clan had already managed to gather all of the Tou She Ancient God Jade. They must definitely not be allowed to leave smoothly.</p><br/><p>Xiao Yan lowered his chin in the face of their glances. He quickly lifted his head and looked towards Hun Tiandi, who was holding onto the ancient jade and laughing wildly towards the sky. A ferocious arc was formed on the corner of his mouth. Immediately, he smiled and spoke softly.</p><br/><p>“Let’s attack…”</p><br/><p>Surging murderous intent spread over the entire place as the words sounded!</p><br/>\n</div>"}