{"title": "Chapter 1621: The Space At The Bottom Of The Magma", "id": 1621, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1621-the-space-at-the-bottom-of-the-magma", "volume_title": "Volume 17", "body": "<h1>Chapter 1621: The Space At The Bottom Of The Magma</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1621: The Space At The Bottom Of The Magma</u></strong></p><br/><p>A red flame surged within the magam. Xiao Yan crossed his arms over his chest. He looked at the densely packed mysterious creatures around him and laughingly said, “Since there is a guardian, may I inquire about what it is guarding?”</p><br/><p>“Human, leave immediately or die!”</p><br/><p>The two densely white fire lizard people’s eyes were filled with an icy chill as they stared at Xiao Yan. Those words that they were unfamiliar with were slowly spoken by them.</p><br/><p>The surrounding lizard people revealed some ferocity within their eyes after the words of those two sounded. Their scales had become much darker.</p><br/><p>Xiao Yan had a calm expression. His face was not altered because of the surging murderous intent around him. If he had met with this lineup back then, it was likely that he would have been terrified to death. Now, however… two mere Ban Shengs and a group of insignificant experts did not pose the least bit of threat against him.</p><br/><p>“I will definitely head to the bottom of the magma today!”</p><br/><p>Xiao Yan laughed softly. His body did not move. Instead, a vast and mighty spiritual fluctuation swiftly spread from his brow with lightning like speed.</p><br/><p>“Buzz buzz!”</p><br/><p>The magma suddenly shook intensely after this spiritual fluctuation spread. There was a vague buzzing sound being emitted. Soon after, the bodies of the many fire lizard people around suddenly trembled. A heaven like spiritual pressure rose from deep within their souls, causing them to tremble. Their formation became a complete mess in an instant.</p><br/><p>The two completely white fire lizard people had a change in expression upon seeing this scene. Before they could let out a sharp cry. However, the magma in front of them had suddenly exploded. A vast and mighty indescribable fluctuation ruthlessly exploded on their bodies.</p><br/><p>“Bang!”</p><br/><p>Tens of thousand feet of magma wave swiftly spread. The two white fire lizard were directly blasted away. Blood was spat out from their mouths. Their eyes contained a rich shock as they looked at Xiao Yan.</p><br/><p>“Get lost!”</p><br/><p>Xiao Yan had a stern expression. A thunder like cry exploded from the tip of his tongue. Vast and powerful spiritual fluctuation was hidden within his cry as it violently spread. It directly caused the area within a hundred thousand feet of this magma sea region to form giant waves.</p><br/><p>“Bang bang bang!”</p><br/><p>The sound spread and the countless lizard people around were sent flying away. However, Xiao Yan had controlled his strength well. Although he had forced back these lizard people, he did not take their lives. After all, he was not familiar with this place and he could not predict just what kind of unexpected occurrence would occur if he engage in a large scale slaughter of these creatures.</p><br/><p>Regardless of what the situation was, this place could possibly have been left behind by the last Dou Di on this Dou Qi continent. Being careful was definitely the right choice.</p><br/><p>The bottom of the magma was turned upside down by Xiao Yan. Those fierce looking fire lizard had also withdrew a great distance with shocked faces. They looked at the demon god like figure from a great distance away. That frightening spiritual pressure caused even their souls to tremble…</p><br/><p>“Those who dares barge into the tomb of the God will suffer divine punishment!”</p><br/><p>The two completely white fire lizard people swallowed the sweet blood in their mouths and roared with a hoarse voice.</p><br/><p>Xiao Yan merely smiled faintly in the face of such a threat. His heart began to feel certain that there was definitely something existing at the bottom of the magma. The tomb of the God that these creatures had spoken about was likely the Tou She Ancient God Mansion!</p><br/><p>A fiery heat rose into Xiao Yan’s eyes the moment he thought of this. He licked his lips and his eyes looked towards the black magma below. There appeared to be some frightening thing lingering at the end of this seemingly bottomless magma, which caused one’s pores to stand.</p><br/><p>“Hopefully I am right…”</p><br/><p>Xiao Yan softly muttered. His body moved, turning into a fire glow that rushed towards the bottom of the magma with lightning like speed.</p><br/><p>Those fire lizards hesitated for a moment as they looked at his figure. Ultimately, however, they did not intervene to stop him. From the situation earlier, they clearly understood that if Xiao Yan had not shown mercy, it was likely that all of them would have already died.</p><br/><p>“Foolish human, you are seeking your own death!”</p><br/><p>The two completely white lizard people exchanged glances. Finally, they snorted coldly and moved, merging into the magma and swiftly heading into the distance.</p><br/><p>Without the obstruction of those fire creatures, Xiao Yan’s speed had also increased greatly. However, regardless of how frighteningly fast he was, he was still unable to reach the end of the magma. The road in front had become viscous and blurry because of the rippling magma.</p><br/><p>Xiao Yan frowned slightly in the face of this situation. However, he did not give up. The depth of this magma sea had far exceeded his expectations. This was no longer something that the strength of a person could create. Perhaps only by reaching that level would one possess such an ability.</p><br/><p>“I don’t believe that there is really no end to this magma…” Xiao Yan let out a low laughter. His body flew past like a meteorite. A vacuum was formed wherever it passed. The magma within it had actually been shattered into nothing.</p><br/><p>“Bang bang bang!”</p><br/><p>Xiao Yan charged through the magma with great ease. The colour of the surrounding magma had already gradually turned from bright red into complete black at some unknown moment.</p><br/><p>After the magma had turned into this colour, Xiao Yan’s speed had also been greatly reduced. There seemed to be a kind of mysterious heat hidden within this magma. This heat energy was something that even the Purifying Demonic Lotus Flame could not easily purify in a short period of time.</p><br/><p>After the change of the surroundings, Xiao Yan’s eyes had also began to flicker rapidly. However, the caution within his eyes was gradually became denser when a forewarning suddenly surged within his heart. Immediately, he stilled his rapidly descending body!</p><br/><p>“Puff!”</p><br/><p>The magma around Xiao Yan shook and exploded as Xiao Yan came to a rapid halt. His eyes directly looked in front of him. From his Spiritual Perception, this place… seemed to be the end of the magma. However, he could only see an endless magma.</p><br/><p>Xiao Yan’s eyes continued to flash. Suddenly, he extended his hand. The Purifying Demonic Lotus Flame surged over it and gently touched the magma in front of him.</p><br/><p>“Buzz!”</p><br/><p>The magma began to fluctuate as Xiao Yan’s hand touched the magma. His hand directly disappeared. That manner was as though he had touched the boundary of another realm.</p><br/><p>“A realm is hidden at the bottom of the magma…” Xiao Yan watched this scene and involuntarily inhaled a breath of cool air. He currently possessed the ability to build a realm. However, it was likely that even Hun Tiandi and Gu Yuan would find it extremely difficult to build a realm at the bottom of this magma.</p><br/><p>“The Tou She Ancient God really lives up to his reputation!”</p><br/><p>Xiao Yan laughed softly. A shock appeared in his calm heart. The only person in the last ten thousand years who had the ability to do this was that only Dou Di!</p><br/><p>At this moment, Xiao Yan was already eighty percent certain that the Tou She Ancient God Mansion was located in this place!</p><br/><p>A wild excitement leaped within those dark black eyes. Xiao Yan merely hesitated for a moment before he clenched his teeth and suddenly stepped forward. He directly strided into the realm at the bottom of the magma!</p><br/><p>“Chi!”</p><br/><p>The original magma flow that filled his ears disappeared the moment he entered that mysterious space.</p><br/><p>A somewhat dim and quiet endless space appeared in front of Xiao Yan/ This realm had been quiet for an unknowingly long period of time. The entire realm was filled with an extremely ancient scent.</p><br/><p>Xiao Yan’s eyes slowly swept over this place. It was completely empty. There was nothing strange. He frowned slightly as his body cautiously advanced.</p><br/><p>Xiao Yan flew through this empty space. He finally paused a couple of minutes later and focused his eyes on a spot in the distance. There was a vague cluster of light suspending over that place.</p><br/><p>Xiao Yan hesitated for a moment as he looked at the cluster of light. Finally, he clenched his teeth and flew over. With his gradual approach, the situation within the cluster of light was caught by his eyes.</p><br/><p>It was a stone door, a hundred thousand feet large stone door!</p><br/><p>The stone door quietly stood in the empty space. It was as though it would exist for eternity. An ancient desolate aura slowly spread from it and reverberated over the sky.</p><br/><p>There was a similarly large square in front of the stone door. Xiao Yan paused at a spot that was a great distance from the ancient stone door. His eyes dully watched this mysterious scene within the dim space. At that instant, he was actually left speechless.</p><br/><p>Xiao Yan appeared just like an ant as he stood in front of the majestic stone door. A respect surged within his heart without him realising it. Soon after, however, he was suddenly aware that a caution had rose within his heart. This stone door gave him an impulse that he could not control. The entire place was indeed extremely mysterious and unfathomable.</p><br/><p>Xiao Yan’s eyes swept over the stone door. Finally, they paused at the top of it. Three ancient words were present. His eyes suddenly shrunk when they drifted towards those words. His heart began to pound wildly.</p><br/><p>“Ancient God Mansion!”</p><br/><p>The ancient words did not appear overly beautiful. It was ordinary but it seemed to possess an endless night that seemed to control the world!</p><br/><p>“I have finally found you…” The smile on the corner of Xiao Yan’s mouth suddenly widened as he looked at the three ancient words.</p><br/><p>The smile on the corner of Xiao Yan’s mouth had lasted only for a moment when a chill suddenly appeared in his heart. It was as though there was something observing him.</p><br/><p>This feeling caused Xiao Yan’s expression to gradually become solemn. His eyes swept around him but he did not discover anything. A moment later, his eyes narrowed and he slowly lowered his head. At the same time, a fire pillar shot out from his finger!</p><br/><p>The fire pillar spread over this dark world. Xiao Yan’s eyes also hardened at this moment. He was stunned as he looked at the space below. The blood on his body seemed to have stilled.</p><br/><p>“This is…”</p><br/><p>Xiao Yan felt as though his skin had explode within the quiet space.</p><br/>\n</div>"}