{"title": "Chapter 1626: One Against Two", "id": 1626, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1626-one-against-two", "volume_title": "Volume 17", "body": "<h1>Chapter 1626: One Against Two</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1626: One Against Two</u></strong></p><br/><p>“Hun Yuantian?”</p><br/><p>Xiao Yan merely smiled as he saw the two old men, whose body were covered with a rich deathly aura. One of them was Hun Yuantian, whose Deathly Silence Gate had been snatched by Xiao Yan back then.</p><br/><p>“Little bastard, you have ruins the plans of my Hun clan. You must definitely die today!”</p><br/><p>Hun Yuan Tian’s eyes were vicious as they stared at Xiao Yan. Back then, Xiao Yan had taken advantage of his carelessness to snatch the Deathly Silence Gate, causing the Death World to completely collapse. This had resulted in the Hun clan’s army to have no choice but to retreat. If it was not because of the current critical state of affairs, it was likely that he would be seriously punished for making such a big mistake even though he was considered a veteran.</p><br/><p>Even though this was the case, he was still frequently reprimanded by Hun Tiandi during this period of time. Naturally, his hatred towards Xiao Yan was currently quite intense.</p><br/><p>Xiao Yan simply curled his mouth in the face of Hun Yuantian’s vicious words. Immediately, he glanced at the two people in front of him. A grave expression flashed across his eyes. The Hun clan had directly dispatched two eight star Dou Shengs to hold him back. From this, it was obvious that the Hun clan intended to kill him.</p><br/><p>Although it might be extremely troublesome for Xiao Yan to deal with this, it was also not a simple matter for the opponent to defeat him. After all, he was presently a genuine seven star Dou Sheng. Adding his Di State soul, his true fighting strength had far surpassed an ordinary eight star Dou Sheng. Although these two were cooperating, they might not be able to beat him.</p><br/><p>This thought appeared within Xiao Yan’s heart. His eyes swiftly swept over the many intense battles throughout the entire Black-Corner Region. Wild and violent Dou Qi spread as many figures fought each other, causing the sea of magma below to continuously emit many thousand feet large magma pillars.</p><br/><p>“The battle is in a stalemate. However, my being able to hold back two of the other parties eight star Dou Sheng will greatly reduce the pressure on the alliance army.”</p><br/><p>The battle was at a stalemate while the sky was like a huge meat grinder. A continuous stream of experts from both parties spat out blood and fell into the magma below. The great heat below turned them into ashes.</p><br/><p>“Little bastard, go and die!”</p><br/><p>Hun Yuandi’s eyes became increasingly vicious as he looked at Xiao Yan. At the end, he finally could not resist the fury within his heart. With a stern cry, he swung his hand forward. That palm wind, which was covered with a deathly aura, was swung towards Xiao Yan. One sniff of that scent caused one to feel the life force within one’s body to gradually disappear.</p><br/><p>“You have really thought too highly of yourself!”</p><br/><p>Xiao Yan laughed coldly after seeing Hun Yuantian attack. The Purifying Demonic Lotus Flame swept out from within his body like a storm. After which, it turned into a giant fire palm that forcefully received the attack by Hun Yuantian. That strange deathly aura of the other party had also been swiftly purified by the purifying strength of the Purifying Devouring Lotus Flame.</p><br/><p>“Hun Tiansheng, let’s attack together and kill this brat!”</p><br/><p>Hun Tiandi’s expression changed as the attack made contact. He could sense that the current Xiao Yan was actually much stronger than back then. After which, he hurriedly cried out.</p><br/><p>The other dark and icy faced eight star Dou Sheng old man also nodded after hearing his cry. The former flashed and appeared behind Xiao Yan. Deathly aura lingered over his finger before it was pressed forward ruthlessly.</p><br/><p>“Death God Finger!”</p><br/><p>“Get lost!”</p><br/><p>The huge black finger broke through the space. It was just about to touch Xiao Yan when the latter threw a punch backwards. A terrifying firestorm was formed under his fist as it whistled forward and directly struck onto the huge black finger.</p><br/><p>“King Kong Glass Body!”</p><br/><p>Xiao Yan suddenly cried out loud after he threw a punch. His body suddenly swelled to a thousand feet. Bright golden light surged out from within his body.</p><br/><p>“Extermination Fire Body!”</p><br/><p>The King Kong Glass Body had just been unleashed when Xiao Yan once again acted with lightning like speed. Purifying Demonic Lotus Flame wildly shot out from within his body. His huge body also quickly became crystal clear. Two body strengthening Dou Qi were unleashed simultaneously. This was something that only Xiao Yan could do after having stepped into the Di State soul!</p><br/><p>Xiao Yan’s aura had become violent and sharp after two body strengthening Dou Qi were unleashed together. His large hand was swung and a palm slammed towards Hun Yuantian. At the same time, he also flicked his finger!</p><br/><p>“Yellow Spring Palm!”</p><br/><p>“Great Heaven Creation Palm!”</p><br/><p>“Yellow Spring Finger!”</p><br/><p>Three different Dou Skills were formed under Xiao Yan’s palm at almost the same time. After which, they violently smashed angrily towards Hun Yuantian.</p><br/><p>Even Hun Yuantian involuntarily had a change in expression after seeing these attacks from Xiao Yan. This ability to use multiple Dou Qi together was something that even he did not have.</p><br/><p>“Death Tomb!”</p><br/><p>Dense deathly aura wildly surged out from within Hun Yuantian’s body. Finally, it turned into a ten thousand feet large black tomb in front of him. There was a sharp sound resounding from the tomb.</p><br/><p>“Bang bang bang!”</p><br/><p>Many Tian class Dou Skills descended from the sky and violently crashed onto the huge black tomb. Huge energy waves spread, causing the space within ten thousand feet to collapse into a dark black void.</p><br/><p>Faced with this wild and violent explosion, the deathly aura on the black tomb also rapidly disappeared. Finally, a ‘bang’ sounded and it exploded apart.</p><br/><p>“Chi!”</p><br/><p>Xiao Yan was just about to continue giving chase after glancing at the collapsed tomb when his ear moved. He suddenly turned. His huge fist reflexively smashed ruthlessly onto the space behind him.</p><br/><p>“Bang!”</p><br/><p>The space rippled and a giant black stone pillar broke out from it. It collided heavily with Xiao Yan’s fist. Immediately, a loud and clear sound appeared. Xiao Yan and the stone pillar were sent flying backwards.</p><br/><p>Xiao Yan’s body took over a dozen steps back before he stabilized himself. A sweetness rose from his throat. However, this was quickly swallowed by him. The strength of Hun Shengtian was even stronger than Hun Yuantian. He had also used his full strength when he attacked. However, this kind of collision might have caused Xiao Yan to feel a little terrible but he did not appear to be in a good condition either.</p><br/><p>Xiao Yan lifted his eyes. He looked at Hun Tiansheng, who had appeared with a stone pillar in his hand. The latter’s face was flush red. Even his aura had started to fluctuate intensely.</p><br/><p>“Damn brat. No wonder you are able to snatch the Deathly Silence Gate from Hun Yuantian’s hands…” Hun Shengtain stared densely at Xiao Yan and spoke in a low and deep voice.</p><br/><p>“It is becoming increasingly difficult to deal with this brat. Let’s attack together and exhaust him to death!” Hun Yuantian flashed and appeared beside Hun Shengtian before speaking in a dense voice.</p><br/><p>Xiao Yan laughed coldly after hearing these words. He waved his hand and a black light cluster suddenly appeared in it. Finally, it was transformed into a huge giant black gate. It was surprisingly the Deathly Silence Gate.</p><br/><p>“Go it!”</p><br/><p>Xiao Yan waved his sleeve after summoning the Deathly Silence Gate. An intense suction force immediately surged out from within the gate and dragged Hun Yuantian duo into it.</p><br/><p>“Hee, brat, you actually dare to deliver yourself to us!”</p><br/><p>Hun Yuantian duo’s eyes brightened after seeing Xiao Yan taking out the Deathly Silence Gate. They did not even put up a resistance as they used the suction force to charge into the Deathly Silence Gate.</p><br/><p>A cold smile flashed across Xiao Yan’s eyes after seeing the actions of those two. He would naturally not repeat the same foolish mistake that Hun Yuantian had once made!</p><br/><p>Hun Yuantian duo appeared within the Deathly Silence Gate. However, they were hurrying to look for the spiritual stone to remove Xiao Yan’s spiritual imprint when they suddenly discovered that this Deathly Silence Gate was actually filled with a monstrous flame!</p><br/><p>“Something’s wrong, let’s escape!”</p><br/><p>The expressions of Hun Yuantian duo changed upon seeing the pink flame that spread over the place. This Deathly Silence Gate had already been meddled with by Xiao Yan.</p><br/><p>“Bang bang!”</p><br/><p>However, the both of them had just pulled back when the Purifying Demonic Lotus Flame around them surged over from all directions. The flame turned into many fire dragons that bite wildly at the duo.</p><br/><p>“Boom!”</p><br/><p>Hun Yuantian duo waved their sleeves. Mighty Dou Qi pillars scattered the fire dragons that pounced onto them. Their bodies flashed and they appeared at the entrance to the Deathly Silence World.</p><br/><p>A ten thousand feet figure suddenly firmly blocked the exit when the two of them appeared in front of the entrance to Deathly Silence World. Soon after, a terrifying spiritual sonic wave suddenly struck at them!</p><br/><p>“Mou! Mou! Mou!”</p><br/><p>Three continuous Yellow Spring Divine Anger were unleashed. That terrifying spiritual sonic wave attack directly sent Hun Yuantian duo flying backwards by ten thousand feet. This wild attack caused their souls to become a little giddy.</p><br/><p>“Since you have entered, you can forget about leaving!”</p><br/><p>Xiao Yan’s icy cold laughter rumbled throughout the Deathly Silence Gate. The seal formed by his hands changed and many six coloured flames, which were filled with an extermination force swiftly appeared in his palm. Finally, they continuously flew into the Deathly Silence Gate.</p><br/><p>The fire lotus came one after another. They floated in the air of the Deathly Silence Gate but did not attack Hun Yuantian duo. Instead, they were being gathered one after another.</p><br/><p>Within that short moment of time, there was already ten Extermination Fire Lotus. This number caused the expressions of Hun Yuantian duo to change. They were not afraid of one Extermination Fire Lotus. However, if ten of them were added together and exploded within this confined space, even the two of them would not be able to endure it.</p><br/><p>“Charge out of here!”</p><br/><p>The both of them exchanged glances and clenched their teeth. Immediately, they turned into two rays of light that shot towards the exit with lightning like speed. They decided to endure Xiao Yan’s Yellow Spring Divine Anger and charge out from the Deathly Silence Gate!</p><br/><p>“It’s too late…”</p><br/><p>Xiao Yan merely smiled coldly as he watched the action of those two. He threw another three Extermination Fire Lotus inside. After which, a thought passed through his mind and all the Extermination Fire Lotus within the Deathly Silence Gate wildly exploded at this moment.</p><br/><p>Moreover, Xiao Yan suddenly slammed his palm onto the Deathly Silence Gate when the Extermination Fire Lotus exploded. The spiritual imprint on the spiritual stone had also been blasted apart.</p><br/><p>“Bang!”</p><br/><p>The Deathly Silence Gate suddenly unleashed waves of black fog as the spiritual stone broke. After which, the space itself also began to collapse at this moment. An indescribable destructive force crazily swept towards Hun Yuan duo with the exterminating strength of the fire lotus explosion.</p><br/><p>“He had let the Deathly Silence Gate self-destruct!”</p><br/><p>An extreme shock and heartache rose onto Hun Yuantian’s eyes after he saw this scene. He had been building this Deathly Silence Gate for hundreds of years. Yet, Xiao Yan had simply command it to self-destruct…</p><br/><p>“Bnag!”</p><br/><p>However, that terrifying force had already come striking at him while this thought flashed across his mind. It directly devoured the both of them!</p><br/><p>Xiao Yan watched the Deathly Silence Gate that had exploded wildly from the sky. His body swiftly pulled back and wiped off the cold sweat on his forehead. This time around, these two old undying demons would be seriously injured even if they did not die…</p><br/><p>“How can it be so easy to snatch it back?” A low and cold laughter sounded. Xiao Yan’s heart shook as he turned towards the sea of magma below. An incomparably large swirl had appeared at that spot. It was as though something was about to appear.</p><br/><p>“Ancient God Mansion, is it finally about to surface…”</p><br/><p>Xiao Yan’s eyes became increasingly icy cold as he watched this scene.</p><br/>\n</div>"}