{"title": "Chapter 1623: Conversation", "id": 1623, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1623-conversation", "volume_title": "Volume 17", "body": "<h1>Chapter 1623: Conversation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1623: Conversation</u></strong></p><br/><p>“Bang!”</p><br/><p>The sound of magma exploding suddenly resounded across the tunnel that led to the underground magma world at the bottom of the Blazing Sky Qi Refining Tower. Immediately, a somewhat miserable figure charged out from the magma in front of the stunned gazes of Xun Er’s group.</p><br/><p>“Xiao Yan ge-ge!”</p><br/><p>Xun Er hurried forward. Her expression changed drastically upon seeing that figure.</p><br/><p>“I’m fine.” Xiao Yan’s body flashed and landed. He wiped off the trace of blood remaining on the corner of his mouth. Those eyes of his were solemn as they looked at the magma tunnel. He involuntarily clenched his fist. It was unexpected that there was actually such a terrifying existence at the bottom of the magma.</p><br/><p>“What happened?” Su Qian, Mang Tian Chi and the rest exclaimed. They were also startled by this appearance of Xiao Yan. All of them were clearly aware of Xiao Yan’s strength. Yet, even he was turned into such a miserable state. Just what kind of terrifying thing was at the bottom of the magma?</p><br/><p>“Old Mang, inform clan head Gu Yuan and the rest that the news is confirmed…” Xiao Yan spoke in a deep voice with a solemn expression.</p><br/><p>Mang Tian Chi’s face twitched violently upon hearing this. His heart involuntarily pounded violently. He understood the importance of this matter. Immediately, he did not dare to slight the situation as he directly turned around and hurriedly left to inform Gu Yuan and the others of this new information.</p><br/><p>“The Ancient God Mansion is really located at the bottom of the magma?” Cai Lin was a little startled as she looked at the magma tunnel and asked. After all, she had stayed inside it for a period of time back then. Yet, she did not sense anything.</p><br/><p>“Aye.” Xiao Yan nodded. He immediately gave a summary about what had occurred at the bottom of the magma. Xun Er and the rest involuntarily had a drastic change in expression after they heard that there was a mysterious creature comparable to Gu Yuan and Hun Tiandi in the realm at the bottom of the lake.</p><br/><p>“Fortunately, that mysterious creature appears to be unable to leave that realm. Otherwise, there will likely be big trouble today.” Xiao Yan laughed bitterly and rejoice a little as he spoke. Base on the strength that the big fellow had displayed, it was likely that no one present would be able to subdue it if it charge out.</p><br/><p>“Next, let’s wait for the alliance army to arrive. If we allow the Hun clan to succeed this time around, it is likely that there will no longer be any opportunity for us to turn things around…” Xiao Yan sighed softly. If Hun Tiandi was allowed to obtain the embryonic Di Pill, he might really end up breaking through to the Dou Di class. At that time, no one in this world would be able to fight him. Even the alliance army would not be able to do so…</p><br/><p>Xun Er and the rest nodded upon hearing this. This was all they could do for now.</p><br/><p>The main hall within the Hun realm.</p><br/><p>“Did you say that your mission has failed?” Hun Tiandi sat on the leader’s seat and looked at the trembling kneeling figure below with narrowed eyes as he demanded in a faint voice.</p><br/><p>“Yes… for some unknown reason, our trail had been detected by Xiao Yan’s group. Hun You and the others had been chased by Xiao Yan’s group soon after they arrived at the Black-Corner Region. All of them had perished in the hands of Xiao Yan’s group.” The figure below was covered with cold sweat. However, his words were still quite clear.</p><br/><p>“How is it possible for Xiao Yan to know of their whereabouts?” Hun Tiandi’s expression sunk as he demanded.</p><br/><p>“Clan head, Xiao Yan was once a student of the Jia Nan Academy in the Black-Corner Region. I’m afraid that it is because the academy had detected danger and had requested his help. I do not think that he is aware of our intention!” That person hurriedly said.</p><br/><p>“Humph, that brat is as sly as a fox. Who knows just what he is thinking? Moreover, if it is not because he had detected something prior to this, how would he be able to arrive in time even if the academy did send a message requesting for help?” The Nihility Devouring Flame by the side snorted coldly.</p><br/><p>Those bowing figures below widened their mouths upon hearing this. However, all of them voiced their agreement.</p><br/><p>“You mean… could it be that Xiao Yan is also aware of the information that the Ancient God Mansion is located in the Black-Corner Region?” Hun Tiandi frowned and asked. This was information that they had managed to learn after spending great effort to gather all the ancient jade. How could Xiao Yan directly learn of it?</p><br/><p>“We cannot exclude this possibility. Didn’t that fellow roam the Black-Corner Region before? Who knows what he had detected?” Black flame surged within the eyes of the Nihility Devouring Flame. He spoke in a deep voice, “Regardless of whether he had detected anything, it is also time for us to move. Otherwise, it would be a severe blow to us if any trouble occurs!”</p><br/><p>“Aye, any delay might result in unexpected changes.”</p><br/><p>Hun Tiandi mused for a moment before nodding. Clearly, news of Xiao Yan’s appearance in the Black-Corner Region had caused him to feel an unease.</p><br/><p>“What about that Gu Yuan?” The Nihility Devouring Flame said. Recently, Gu Yuan had been monitoring the Hun clan’s realm. He would definitely detect something if a large group of experts was dispatched from this place.</p><br/><p>“I have already got someone to build a wormhole at the north-western region which connects to the Hun realm. At that time, you will intervene and led a group to the Black-Corner Region. I will delay Gu Yuan.” Hun Tiandi spoke in a faint voice.</p><br/><p>“Aye.”</p><br/><p>The Nihility Devouring Flame hesitated for a moment upon hearing this. Finally, he nodded.</p><br/><p>“As long as I am able to obtain the embryonic Di Pill within the Ancient God Mansion, the so called alliance army will be nothing but ants…” Hun Tiandi lifted his head. He looked at the top of the large hall. An icy cold smile surfaced on his face as he softly spoke to himself.</p><br/><p>Gu Yuan sat on a stone tower at the top of the star realm. Vast and mighty spiritual fluctuation rippled around him, causing the stone tower to be filled with a terrifying pressure. Other than a handful of people, no one else dared to approach the area within a thousand feet from the stone tower in the face of this pressure.</p><br/><p>Gu Yuan’s expression was as deep as water as he sat at the top of the stone tower. Both of his eyes were shut. The vast and endless Spiritual Strength entered into the empty space. It probe deep into the location where the Hun realm was located using a mysterious method. After which, traces of Spiritual Strength entwined around the place. In this way, he was able to detect any slight fluctuation in the space around that place.</p><br/><p>“Buzz!”</p><br/><p>The empty space suddenly began to fluctuate intensely while Gu Yuan continued to probe. Immediately, it turned into a human figure that stood with his hands behind him.</p><br/><p>Gu Yuan, who was at a stone tower a great distance away, suddenly opened his eyes when the human figure appeared. Immediately, he let out a cold snort. His body moved and disappeared. He was already in front of that figure the next time he appeared.</p><br/><p>“Hun Tiandi!”</p><br/><p>A cold glint flashed across Gu Yuan’s eyes as he looked at the white clothed seemingly refined man in front of him.</p><br/><p>“Of the four of us back then, only the two of us are left. This world is indeed ever changing.” Hun Tiandi looked at Gu Yuan. He smiled faintly and remarked.</p><br/><p>“The fall of the other two is greatly related to you.” Gu Yuan laughed coldly.</p><br/><p>Hun Tiandi was noncommittal. He looked at Gu Yuan before he suddenly said, “If you are willing to cooperate with me, I will definitely help you once I advance into the Dou Di class in the future.”</p><br/><p>Gu Yuan was startled. He did not expect that Hun Tiandi would actually try to recruit him. However, he quickly smiled and asked, “Do you think that is possible?”</p><br/><p>“How unfortunate. You are one of the few people who I hold in high regard.” Hun Tiandi shook his head in disappointment, seemingly aware of Gu Yuan’s answer. He lifted his head and looked at the empty space before he suddenly muttered, “It is rumoured that an elite Dou Di is all mighty. But why is it that those elite Dou Di from back then had completely disappeared?”</p><br/><p>Gu Yuan frowned tightly but did not reply.</p><br/><p>“These answers would likely be revealed once I advance to the Dou Di class.” Hun Tiandi stared at the endless empty space. There was a strange luster flashing passed them. He immediately turned towards Gu Yuan and laughed, “This world will not be able to restrain me!”</p><br/><p>His words was wild and proud. However, there was also a monstrous aura surging from it. Even Gu Yuan had not laughed at these words. This was because he understood that this opponent whom he had fought secretly for thousands of years, did indeed possess the boldness and potential to utter these words…</p><br/><p>“You are planning to delay me, right?” Gu Yuan stared at Hun Tiandi. Given his intelligence, he naturally saw through the reason why the latter did not attack. Since this was the case, it was obvious that the other party had only one intention. It was to hold him back.</p><br/><p>Hun Tiandi laughed upon hearing this. He calculated the time and smilingly said, “It is about time…”</p><br/><p>“The Ancient God Mansion is at the Black-Corner Region, right?” Gu Yuan narrowed his eyes and said.</p><br/><p>The smile on Hun Tiandi’s face stiffened when these words were spoken. It quickly disappeared as he replied, “You are indeed aware of it…”</p><br/><p>Hun Tiandi did not hide anything. This was because he understood that since Gu Yuan had uttered those words, the latter definitely understood the situation quite well. Otherwise, it would only be a wasted effort.</p><br/><p>“It seems that the Heavens is not helping you.” Gu Yuan laughed.</p><br/><p>“We will soon find out just who will lose…” Hun Tiandi spread his hands. He paused for a moment before asking, “Is it because of Xiao Yan?”</p><br/><p>He was naturally asking about why Gu Yuan was aware of the location of the Ancient God Mansion.</p><br/><p>Gu Yuan smiled. He neither admitted nor denied it.</p><br/><p>“He is really a scrooge…” Hun Tiandi involuntarily shook his head. His heart felt an unknown feeling. Who could have imagined that the declined Xiao clan would actually produce such a person. Even his Hun clan had suffered many losses in his hand. Now, even the Ancient God Mansion was first detected by Xiao Yan…</p><br/><p>“It is all because of that group of fools who had been hiding some information…” Hun Tiandi sighed softly. If it was not because Xiao Yan had gradually stood out in the Central Plains, it was likely that he would still be unaware that the latter had actually escaped from the many attacks by the Hun clan. By the time he had learnt of all these, the youth from back then had already spread his wings. Due to the many schemes taking place, he also did not have the time to bother about him. Who could have expected that this small mistake would actually end up creating such a big trouble for them.</p><br/><p>“You will end up suffering if you underestimate him…” Gu Yuan smiled. He was quiet for a moment before he said, “He will perhaps be even more outstanding than Xiao Xuan.”</p><br/><p>“Oh?” Hun Tiandi lifted his brow. He smiled faintly and said, “It seems your evaluation is quite high. However, since my Hun clan is able to kill the first Xiao Xuan, we will naturally be able to kill the second one…”</p><br/><p>“Gu Yuan, now, let’s head to the Black-Corner Region and have a look!” The space around Hun Tiandi was slowly distorted. His body gradually vanished.</p><br/><p>A cold glint flashed across Gu Yuan’s eyes as he looked at Hun Tiandi, who had disappeared. His body flashed and he directly appeared within the Meeting Room of the star realm. He looked at Lei Ying and the others before waving his hand and ordered in a deep voice, “The alliance will head to the Black-Corner Region. This time around, we must definitely stop the Hun clan!”</p><br/>\n</div>"}