{"title": "Chapter 1634: Fail", "id": 1634, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1634-fail", "volume_title": "Volume 17", "body": "<h1>Chapter 1634: Fail</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1634: Fail</u></strong></p><br/><p>This sudden action of Hun Tiandi exceeded everyone’s expectations. Even the Nihility Devouring Flame, who was standing behind, had a change in expression. Immediately, his expression became a little gloomy. Everyone wanted to obtain the Di tier embryonic pill. However, no one expected that Hun Tiandi would swallow it in such a reckless manner…</p><br/><p>“Bastard!”</p><br/><p>Zhu Kun’s and Gu Yuan’s expressions became dark and solemn after seeing this scene. A rich murderous intent surged in their eyes as he coldly cried out, :</p><br/><p>“Hun Tiandi, you are asking to die!”</p><br/><p>“Ha ha, seeking death? That is not guaranteed!”</p><br/><p>Hun Tiandi laughed towards the sky upon hearing this. The smile on his face became a little mysterious. At this moment, brilliant light began to rise from within his body. The injuries caused by the combined attacks of Gu Yuan and Zhu Kun was completely healed in an instant. Waves after waves of frightening energy ripples slowly seeped out from within his body.</p><br/><p>The expressions of Gu Yuan and Zhu Kun were once again altered after they detected the aura within Hun Tiandi’s body, which had suddenly become many times stronger.</p><br/><p>“The energy of the embryonic pill had begun to erupt. His strength will soar by many times for a short period of time. After that, however, it is likely that his body and soul would be filled by the increasingly terrifying energy until they explode.” Gu Yuan’s eyes flashed. He did not panic as he spoke in a deep voice.</p><br/><p>“Do not give him any opportunity to refine it. All we need to do is to quickly stop him and we will be able to force the Di tier embryonic pill from within his body!” Zhu Kun’s expression had become very grave. He immediately cried out in a low voice, “Attack!”</p><br/><p>Gu Yuan nodded upon hearing his cry. Hun Tiandi’s group had gained a great advantage when it came to subduing the Di tier medicinal pill. Moreover, at the critical moment, the Transforming Pill Ring that was formed by the Nihility Devouring Flame, ended up restraining the all mighty Di tier medicinal pill until it could not retaliate.</p><br/><p>“Chi!”</p><br/><p>The two individuals moved as they desired. A thought had just appeared when they rushed across the sky and shoot towards Hun Tiandi.</p><br/><p>“Ha ha, all of you are currently no match for me!” Hun Tiandi was unafraid after seeing the two rushing over again. He laughed out loud. Both of his fists were clenched before they were suddenly thrown forward.</p><br/><p>“Bang!”</p><br/><p>After Hun Tiandi’s fists were thrown forward, two ten thousand feet large vacuum space were directly formed in the sky.</p><br/><p>Gu Yuan’s and Zhu Kun’s expressions changed after seeing this wind, which had suddenly become a lot more terrifying. He hurriedly unleashed his Dou Qi to receive the attack. Immediately, two deafening loud sound exploded in the sky.</p><br/><p>“Bam bam!”</p><br/><p>A frightening extermination storm exploded from Gu Yuan’s and Zhu Kun’s hand. The directly pushed Xiao Yan duo back by thousands of feet. On the other hand Hun Tiandi continued to stand proudly in the sky. Moreover, the ripple spreading from within his body also became increasingly terrifying.</p><br/><p>Seeing the situation in the sky changing abruptly, Xiao Yan and the others experienced a great change in expression. It was unexpected that after devouring the Di tier medicinal pill, Hun Tiandi’s strength would actually soar until such an extent. Moreover, everyone understood that this was only at the initial strengthening stage. If Hun Tiandi was allowed to successfully refine the Di tier embryonic pill, he would advance to the Dou Di class. At that time, there would really be no opportunity to turn things around!</p><br/><p>“Gu Yuan, ultimately, I am still victorious in this fight!”</p><br/><p>Hun Tiandi stepped on the empty air. He looked at Gu Yuan and Zhu Kun before laughing out loud. He had prepared and schemed for many years before he finally reached this most critical stage!</p><br/><p>“It is likely that you are feeling extremely terrible inside right? Do not be happy too early!” Gu Yuan laughed coldly.</p><br/><p>Hun Tiandi was not irritated upon hearing this. All he did was laughed in a faint voice. He shut his eyes slightly. A drunken expression was revealed in them. It had been many years since he had felt such an increase in strength…</p><br/><p>“Are you able to hold on?” The Nihility Devouring Flame behind Hun Tiandi involuntarily said. If Hun Tiandi really ended up exploding due to being too full of energy, the Nihility Devouring Flame would definitely be no match for Gu Yuan and Zhu Kun combined.</p><br/><p>“You are far too reckless!” The Nihility Devouring Flame was a little furious as he spoke. No one knew if it was because Hun Tiandi had devoured the Di tier embryonic medicinal pill or because the latter had snatched the pill from his hands.</p><br/><p>“You can be rest assured. I know my limits.” Hun Tiandi laughed faintly. He did not appear to panic because of the wildly soaring Dou Qi within his body.</p><br/><p>The Nihility Devouring Flames eyes flashed after hearing these words. All he could do was to nod his head and said, “Are you fine now?”</p><br/><p>“All I need to do is to safely leave.”</p><br/><p>Hun Tiandi laughed. That appearance of his was unusually calm. It was as though he did not bother about Gu Yuan and Zhu Kun.</p><br/><p>“Trying to leave? Do you think that it is so simple?”</p><br/><p>Gu Yuan and Zhu Kun laughed coldly at this moment. Monstrous Dou Qi surged. After which, it crazily erupted towards Hun Tiandi.</p><br/><p>However, Hun Tiandi merely waved his hand gently in the face of an attack by the two. He easily blocked the attacks.</p><br/><p>Hun Tiandi’s finger drew passed the space beside him when Gu Yuan duo were blocking his attack. A spatial crack appeared.</p><br/><p>“Bang bang bang!”</p><br/><p>Gu Yuan and Zhu Kun duo became increasingly wild upon seeing this scene. Powerful Dou Qi pillars, which caused one’s heart to tremble, penetrated through the empty space. It continuously smashed onto the Dou Qi defence in front of Hun Tiandi. Ripples were stirred in the process.</p><br/><p>Hun Tiandi chose to ignore the attacks from those two. He hand grabbed below him and forcefully sucked those experts from the Hun clan over before throwing them into the crack in space.</p><br/><p>“Bang bang!”</p><br/><p>An extermination like fluctuation was transmitted from behind. Hun Tiandi’s face twitched. There was a trace of blood flowing down from the corner of his mouth.</p><br/><p>“You…”</p><br/><p>The Nihility Devouring Flame was greatly startled upon seeing this scene. It seemed that the condition within Hun Tiandi’s body was not as good as he had claimed. Of course, fighting against two advance level nine star Dou Shengs’ attacks was not something that he could simply ignore even if he had the protection of the Di tier embryonic pill.</p><br/><p>“Gu Yuan, I have said that I will ultimately be victorious in this situation… once I completely refine the Di tier embryonic pill, it would be the time that your Gu clan, Lei clan, Yan clan, Sky Mansion Alliance and Ancient Void Dragon tribe completely vanish from this world!”</p><br/><p>Hun Tiandi swallowed the fresh sweet blood in his mouth. He turned his head and looked densely at Gu Yuan’s group. His tone was dark and cold as he spoke.</p><br/><p>“Go!”</p><br/><p>Hun Tiandi grabbed the Nihility Devouring Flame and tossed his to the spatial crack after his voice sounded. Seeing this, the Nihility Devouring Flame quickly became anxious. He said, “There is still my…”</p><br/><p>Before he could finish speaking, however, he saw a couple of bloody cracks appearing on Hun Tiandi’s neck. Immediately, he understood that the latter was unable to fight. All he could do was to clench his teeth unwillingly and rushed towards the spatial crack.</p><br/><p>“Roar!”</p><br/><p>Gu Yuan’s and Zhu Kun’s expression changed after they saw that Hun Tiandi was actually able to split the space present. A low roar sounded. After which, an energy tide surged and crazily surged towards Hun Tiandi.</p><br/><p>“Bang bang bang!”</p><br/><p>The heavy mountain like wild tide ruthlessly smashed onto Hun Tiandi’s back. His expression quickly paled. Many bloody wounds split all over his body. Blood shot out and he was dyed into a bloody person in the blink of an eye.</p><br/><p>However, Hun Tiandi and the Nihility Devouring Flame relied on this pushing force to charge directly into the crack in space. In a flash, he had vanished. The spatial crack also quickly disappeared.</p><br/><p>“Swoosh!”</p><br/><p>Gu Yuan and Hun Tiandi duo appeared at the spot where the crack in space was. A frightening ripple was surging from their hands. They tore violently but the space itself had only fluctuated for a moment. No crack lines appeared...</p><br/><p>“Damnit!”</p><br/><p>Gu Yuan and Zhu Kun’s expression immediately became ugly upon seeing this scene. This Ancient God realm was frighteningly stable. They would have to return to the place where they had entered from if they wished to leave. However, by the time they did so, it was likely that Hun Tiandi’s group would have escaped far away.</p><br/><p>The expressions of those two were gloomy as they slowly descended from the sky. They looked at the similarly quiet group. Finally, they could only sigh.</p><br/><p>“Daughter, that bastard is far too cunning…” Zhu Kun looked at Zi Yan, rubbed his hands together and laughed bitterly.</p><br/><p>Zi Yan glanced at him. After which, she looked at the quiet Xiao Yan. She shook her head and softly said, “What should we do now? Hun Tiandi had obtained the Di tier embryonic pill. If he is allowed to successfully refine it, there would likely really be a big trouble.”</p><br/><p>“We will charge directly to the Hun Realm now!” Lei Ying’s expression was ferocious as he spoke.</p><br/><p>Everyone exchanged glances after hearing this. They immediately nodded. This was the only thing that they could do now. If they sat back and did nothing, their fate would be similar to the Ling and other ancient clans.</p><br/><p>Xiao Yan sighed softly in his heart. He was aware that Hun Tiandi would not be this foolish. The latter was aware that his current condition was ill suited for combat. Hence, either they would not return to the Hun clan or they would use some methods to hide the Hun realm. Although hiding a realm was extremely troublesome, it would not be difficult given Hun Tiandi’s ability. Moreover, the Hun clan had prepared for this for thousands of years. Naturally, they would be fully prepared.</p><br/><p>“Hopefully, that fellow will be unable to refine the Di tier embryonic pill. Otherwise…”</p><br/><p>Xiao Yan curled his mouth. He lifted his head and glanced at the others, only to discover that there was also some worry their eyes. Once Hun Tiandi broke through to the Dou Di class, there would really be no one in this world who can restrain him. Given his vengeful character, all the factions in the alliance army would definitely suffer from his destructive vengeance.</p><br/><p>“It is pointless to think of more. Gather our people and hurry to the Hun realm. We will hold back Hun Tiandi before they could prepare themselves. As long as we do not give him any time to refine the Di tier embryonic pill, he would end up exploding from the energy of the Di tier embryonic pill without us needing to do anything!” Gu Yuan inhaled a deep breath and spoke in a deep voice.</p><br/><p>Everyone nodded upon hearing this.</p><br/><p>“Ugh… wait a moment…” Zhu Kun’s eyes suddenly flashed after he saw that everyone planned to leave. He laughed, “Since we have come to this place, we must naturally not leave empty handed. All of you should step aside. I will bring this square and the stone statue out of this place.</p><br/><p>Xiao Yan’s group was stunned. Their eyes swept over the square. Although there were many Heavenly Flames present, they were no different than some specimens. It was pointless to take them. That statute had also once again become original with the departure of the Di tier embryonic pill.</p><br/><p>“You can do as you like.”</p><br/><p>Gu Yuan was currently in an extremely bad mood. He waved his hand, turned around and rushed towards the spatial tunnel. Everyone followed behind him.</p><br/><p>Xiao Yan was one of the last to leave. He took another glance at Zhu Kin before frowning slightly. This old dragon emperor would not do something completely useless. Could it be that there is something strange about the square at the stone statue?</p><br/><p>Xiao Yan thought for a moment but it was a futile effort. All he could do was to take a deep look at the smiling Zhu Kun. After which, he proceeded to follow Gu Yuan.</p><br/>\n</div>"}