{"title": "Chapter 1636: The Calamity of the Central Plains", "id": 1636, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1636-the-calamity-of-the-central-plains", "volume_title": "Volume 17", "body": "<h1>Chapter 1636: The Calamity of the Central Plains</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1636: The Calamity of the Central Plains</u></strong></p><br/><p>“Hiss!”</p><br/><p>Everyone present inhaled a deep breath of cool air after hearing Gu Yuan’s words. A shock surged within their eyes.</p><br/><p>Creating a Di tier medicinal pill? Who in this world had the ability to do such a thing? Hun Tiandi was not an alchemist. How could he refine it?</p><br/><p>“The medicinal pill has an embryonic form, meaning most important step in a pill refinement was completed by the Tou She Ancient God. If Hun Tiandi is able to finish the final pill forming step, it is not impossible for this Di tier embryonic pill to become a true Di tier medicinal pill.” Xiao Yan licked his lips and slowly explained.</p><br/><p>“We have indeed underestimate Hun Tiandi’s wild ambition. Although the Di tier embryonic pill is powerful, there are only some chance of success in allowing him to breakthrough to the Dou Di clas. However, if he refined the Di tier embryonic pill into a true Di tier medicinal pill, he would magnify this chance of success by many times. One can even say that as long as he possess an actual Di tier medicinal pill, he would able to step across the barrier that had hindered him for thousands of years…”</p><br/><p>The originally doubtful individuals became quiet after hearing Xiao Yan, who could be considered as the top alchemist on the current Dou Qi continent, speaking in this manner. The Di tier embryonic pill was not what Hun Tiandi genuinely wanted. Instead, he wanted a true Di tier medicinal pill!</p><br/><p>“In that case, now should be quite a good opportunity for us, right? Since Hun Tiandi needed to complete the final step of the Di tier embryonic pill, he would definitely have to reveal himself. At that time, we will intervene and stop him!”Lei Ying spoke in a deep voice.</p><br/><p>“I do not know what kind of secret method Hun Tiandi had used but he had already completely merge with the Di tier medicinal pill. With his current strength, it is likely extremely difficult for even Zhu Kun and I to stop him.” Gu Yuan shook his head. He paused for a moment before speaking, “I think that if it not because refining the Di tier medicinal pill is currently the most important thing, the Hun clan would likely have come invading us…”</p><br/><p>Everyone were startled upon hearing this. The situation was getting from bad to worse. Back then, they were still able to fight equal. Moreover, with the appearance of Zhu Kun, the alliance army had even gained the upper hand. In the end, this upper hand had completely vanished in such a short amount of time…</p><br/><p>“What should we do? Don’t tell me that we will simply just watch him truly refining a Di tier medicinal pill? There is still a chance if we fight now. Once the Di tier medicinal pill’s final step is completed, there will really be no one to stop Hun Tiandi.” Lei Ying spoke in a deep voice.</p><br/><p>Everyone nodded after Lei Ying spoke. Currently, the situation was the worst possible one. They would really be finished if they did not act…</p><br/><p>Gu Yuan placed his hands behind him. Their expressions were gloomy as the stares at the indescribable enormous light cauldron. A moment later, he said, “We will temporarily wait and see. Refining a Di tier medicinal pill is not something that can be completed immediately. We need to calculate the best moment to strike.”</p><br/><p>Everyone mused for a moment after hearing this. Finally, they nodded. The situation might be extremely terrible but they must not panic.</p><br/><p>The Central Plains had descended into quite a big commotion at this moment. The source of this commotion was naturally the huge light cauldron that was formed in the sky . The ripple vaguely emitted from it caused many experts to feel uneasy.</p><br/><p>Half a day or so after the light cauldron appeared, a black light appeared in the distant sky. Finally, a black light shot out from all directions in front of the countless pairs of eyes and formed an extremely huge formation. After this formation appeared, a figure with long scattered hair also appeared at the middle of the formation.</p><br/><p>“Hun Tiandi!”</p><br/><p>Gu Yuan’s group, who had been monitoring the development of the situation, shrunk their eyes the moment they saw the figure hidden within the large formation. All of them focused on that spot.</p><br/><p>“Gu Yuan, now, do you regret not agreeing to cooperate with me back then?”</p><br/><p>A pair of eyes penetrated through the clouds from within the formation and shot towards a certain spot on the Central Plains. A faint voice that vaguely contained an extremely terrifying pressure, resounded over the entire Central Plains.</p><br/><p>Gu Yuan’s expression was as deep as water. Both of his hands were clenched tightly but he did not speak.</p><br/><p>“My many years of planning is finally useful now… ultimately, I am the winner of this thousand year battle…”</p><br/><p>The huge formation that covered the entire Central Plains suddenly unleashed many light pillars after Hun Tiandi’s voice sounded. These light pillars directly shot to various spots on the land.</p><br/><p>“Rumble!”</p><br/><p>The entire Central Plains seemed to have shook violently the moment the light pillar landed on the ground.</p><br/><p>A city stood on a flat plains somewhere within the Central Plains. It was very lively and could be considered to be a highly populated city.</p><br/><p>“Bang!”</p><br/><p>However, this liveliness did not continue for long. A huge crack suddenly spread over the city as the land began to shake. Immediately, many strong individuals rose into the air in shock. Before they could react, however, a black light had suddenly broke from the land and covered the entire city within it.</p><br/><p>“Boom boom boom!”</p><br/><p>The many human figures within the city suddenly exploded under the cover of the black light pillars. A bloody fog and shattered flesh burst apart.</p><br/><p>This sudden unexpected occurrence caused everyone to become stunned. The looked at the human figures who that had exploded into a bloody fog. A deep horror and shock swiftly surged out from within his heart like floodwater.</p><br/><p>The city descended into chaos amidst the horror. All of them crazily fled towards the city gate. Some of the stronger individuals even leaped into the air and escaped. Before they could escape, however, the panic from the self-destruction spread apart. In an instant, blood fog spread within the city. The viscous blood and shattered flesh buried half of the city.</p><br/><p>Black light pillar covered the city in a bloody sea. Waves of bloody aura flowed and slowly rose. Finally, it turned into a blood coloured light pillar. It charged towards the sky and rushed into the huge large formation that covered the Central Plains.</p><br/><p>Blood light shot out and the black light disappeared. It left behind a bloody scent, which was so dense that it caused the place to be a repulsive death city.</p><br/><p>“Creak…”</p><br/><p>The people who had just entered the city at the entrance. He looked at the slowly opening city gate. Joy had yet to appear on their faces when their eyes were filled with a bloody sea that surged forth. Immediately, a sharp cry resounded.</p><br/><p>A situation that was similar to this city was being enacted in many parts of the Central Plains. Dense bloody fog had basically covered the sky above the entire Central Plains. Even the air had been mixed with a rich bloody scent.</p><br/><p>The entire Central Plains had began to panic at this moment.</p><br/><p>Gu Yuan, Xiao Yan and the others stood in the air of a city a short distance from the Sky Mansion Alliance. They looked down at the sea of blood in the city below. Their faces were completely green.</p><br/><p>“What happened?” Yan Jin watched this scene, inhaled a cold breath and said.</p><br/><p>Gu Yuan had a green face. He waved his sleeve and the cracks in the city was forcefully pulled apart. The sea of blood was expelled.</p><br/><p>With the spreading of the cracks, a blood coloured formation appeared underground. Dense white bones filled the place. A dark and stern aura surged towards the sky.</p><br/><p>“Devouring Spirit Eliminating Life formation.” An involuntary exclamation sounded. Shock surged onto the faces of Yan Jin and the others after seeing the formation hidden underground.</p><br/><p>“What ruthless technique…” Lei Ying clenched his teeth and said.</p><br/><p>Devouring Spirit Eliminating Life formation. It was an extremely vicious formation that originated from the ancient times. This formation would turn all life covered within its boundary into blood. Moreover, it would forcefully extract energy from within the blood. Due to this formation being overly vicious, it had long since ceased to exist. Unexpectedly, this Hun clan was able to unleash it!</p><br/><p>“These formations had been placed by the Hun clan. It seems that the Hall of Soul’s mission might appear to be collecting souls on the surface but they have quietly placed many of these Devouring Spirit Eliminating Life formations underground within the Central Plains.” Gu Yuan spoke in a gloomy voice, “The Hun clan is really well prepared for this…”</p><br/><p>“With so many Devouring Spirit Eliminating Life formation forcefully absorbing energy, the speed at which Hun Tiandi refine the Di tier medicinal pill will significantly increase…” Xiao Yan lifted his head, looked at the huge formation in the distant sky and said. “However, this Devouring Spirit Eliminating Life formation also requires an extremely great amount of energy to activate… I think that the Hun clan had exhausted all of its energy at this moment. They are betting everything on this!”</p><br/><p>“Let’s return and discuss our plan. The Hun clan has created such a great massacre. It could be considered the enemy of everyone. If we gather everyone’s strength, it might be possible to fight them.” Gu Yuan waved his hand. After which, he rushed towards the headquarters. Everyone hurriedly followed.</p><br/><p>Xiao Yan glanced at their backs, only to sigh softly. Although they had the strength in numbers, the strength of Hun Tiandi alone would likely be able to battle all the experts in this world should he advance to the Dou Di class. This was the terrifying aspect of an elite Dou Di!</p><br/><p>“We can only do our best…”</p><br/><p>Everyone had only just returned to the headquarters when they saw Zhu Kun, who had been missing for over half a month standing outside the large hall. Zi Yan was standing behind him.</p><br/><p>“It is unexpected that this fellow would actually have such a technique…” Zhu Kun sighed after seeing Xiao Yan and the others. Clearly, they had also detected the action of Hun Tiandi.</p><br/><p>Gu Yuan nodded quietly and said, “Now, all we can do is to try our best to gather more people. As long as we can break the big formation in the sky, Hun Tiandi’s beautiful dream will be shattered.”</p><br/><p>However, even he could only laugh bitterly when he uttered these words. An ordinary expert was as insignificant as an ant in Hun Tiandi’s eyes. However, just how many experts like them existed in the Dou Qi continent?</p><br/><p>“We can only do this now. However, once Hun Tiandi is allowed to advance into the Dou Di class, everything will be over.” Xiao Yan laughed bitterly and said.</p><br/><p>Zhu Kun was quiet. His hand rubbed together in a habitual fashion. After which, he glanced at Zi Yan behind him. Finally, he inhaled a deep breath of air and said, “It is not completely over. He can advance into the Dou Di class… on our side, we can also create one…”</p><br/>\n</div>"}