{"title": "Chapter 1632: Terrifying Di Tier Embryonic Pill", "id": 1632, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1632-terrifying-di-tier-embryonic-pill", "volume_title": "Volume 17", "body": "<h1>Chapter 1632: Terrifying Di Tier Embryonic Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1632: Terrifying Di Tier Embryonic Pill</u></strong></p><br/><p>This thought had just rose from his head when it swiftly spread to every part of Xiao Yan’s body and he could no longer escape from it.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan inhaled a deep breath of air. He suppressed the great shock within his heart. If he guessed correctly, this Tou She Ancient God was really terrifying. Other than the first ranked Heavenly Flame on the Heavenly Flame Ranking, all the other</p><br/><p>“These Heavenly Flames might possess their original Heavenly Flame essence but it appears as though all of its energy had disappeared. Currently, they are merely ordinary flames with their original forms…” Xiao Yan’s eyes swept over those towering stone pillars behind him and involuntarily felt somewhat regretful. If it was possible to devour and refine them, it was likely that his strength would reach a relatively terrifying extent.</p><br/><p>Swallowing twenty types of Heavenly Flames together. It was likely that hardly anyone past or present, had been able to do it.</p><br/><p>Little Yi sat on Xiao Yan’s shoulder. Its small face was a little complicated. It looked at the second stone pillar and the expression on its small face was a little complicated. The expression seemed to be lost, painful, terrifying…</p><br/><p>Xiao Yan’s hand gently patted on Little Yi’s head. He could already be certain that Little Yi and the Nihility Devouring Flame were restrained on this stone pillar. In the end, however, the two of them had somehow escaped. Perhaps something unexpected had occurred, resulting in their memories become blurry or missing.</p><br/><p>Of course, this was only Xiao Yan’s guess. It was likely that no one in the world was aware of what exactly happened. After all, the parties involved, namely the Purifying Demonic Lotus Flame and the Nihility Devouring Flame, had already felt their distant memories becoming blurry.</p><br/><p>“Where is the Di tier embryonic pill?”</p><br/><p>Hun Tiandi withdrew his eyes from the stone pillar. He looked at the Nihility Devouring Flame at the side and softly said.</p><br/><p>The Nihility Devouring Flame turned his head. His eyes looked at the edge of the square. The stone hall at that spot was enveloped within a dense fog. It caused one to be unable to see through the scene inside.</p><br/><p>“Woosh woosh!”</p><br/><p>The Nihility Devouring Flame widened his mouth. A suction force surged. It directly swallowed the fog permeating over the place into his body. With the scattering of the fog, a huge shadow suddenly enveloped the entire place. Everyone hurriedly lifted his head, only to be shocked as he saw a hundred thousand feet tall stone statue suddenly appeared in their eyes!</p><br/><p>The stone statue appeared to be like an old man. That appearance was not unfamiliar to Xiao Yan. It was the owner of the Ancient God Mansion, the legendary Tou She Ancient God</p><br/><p>The stone statue stood in the sky and an extremely powerful aura that seemed to dominate the world scattered from it. Even Xiao Yan’s group seemed to be pressed by a mountain under the aura. A couple of weaker individuals even knelt on the ground, shattering the hard stone ground into dust.</p><br/><p>Many light clusters danced around the stone statue. It appeared extremely brilliant when seen from afar.</p><br/><p>“These are… Qi Method and Dou Skills?”</p><br/><p>Xiao Yan narrowed his eyed as he looked at these clusters of light. His heart was quickly shaken. This was because he discovered that those light cluster actually contained some ancient scrolls inside it. He could sense an extremely strong spirituality from those scrolls. This kind of spirituality was not inferior to the so called Tian class high level Qi Method or Dou Skills!</p><br/><p>Hundreds of Tian class Qi Method and Dou Skills. Even though everyone present were extraordinary, such a collection still caused their breath to involuntarily become heavier. Tian class Qi Method and Tian class Dou Skill could be considered quite rare even in the Gu and Hun clan. In this place, however… they have become commonplace as they filled one’s sight.</p><br/><p>Although the Tian class Dou Skill and Qi Method were extremely attractive, it did not result in much desire from experts like Gu Yuan and Hun Tiandi. Hence, their eyes swept over them before turning towards another spot. However, it was still impossible to see the so called Di tier embryonic pill.</p><br/><p>“It has been a long time since this place had been so lively…”</p><br/><p>A faint elderly voice suddenly descended from the sky while everyone were frowning. It resounded beside everyone’s ears.</p><br/><p>This sudden elderly voice caused everyone to be shocked. They hurriedly rotated their bodies and finally stilled their eyes on the arm of a stone statue. There was an elderly figure standing with his hands behind him on that spot. His eyes were indifferent as they looked at everyone. The expression in their eyes appeared as though they were observing an ant.</p><br/><p>“Tou She Ancient God!”</p><br/><p>The eyes of Xiao Yan’s group swept towards the old man in simple clothes before they let out a startled exclamation. The appearance of the latter was exactly the same as that stone statue! Moreover, the unique bright long hair was something that no one could replicate!</p><br/><p>“The Ancient God is still alive?” A incomparably shocking thought surged into everyone’s heart as they dumbly looked at the old man with at aura that seemed to surpass that of this world.</p><br/><p>“What happened?” Hun Tiandi’s expression was a little ugly. He looked at the Nihility Devouring Flame and spoke in a deep voice. He did indeed sensed a terrifying aura from this old man. This kind of aura belonged to the Tou She Ancient God!</p><br/><p>The Nihility Devouring Flame lifted its head. His eyes stared intently at the old man. A moment later, he suddenly opened his mouth and said, “He is not the Tou She Ancient God… he is the Di tier embryonic pill!”</p><br/><p>Hun Tiandi, Gu Yuan and the others were startled after hearing these words. Immediately, their eyes revealed a strange glint as they slowly locked onto the old man.</p><br/><p>“Nihility Devouring Flame, what are you doing?” The old man on the stone statue was startled as he furiously cried out.</p><br/><p>“What do you mean by what am I doing?” The Nihility Devouring Flame frowned and asked after hearing his furious cry.</p><br/><p>“Bastard, if I had not helped you and the Purifying Demonic Lotus Flame to severe your restrains back then, how would the both of you escape? Back then, the both of you had promised me to rescue me from this place!” That old man… or rather the Di tier embryonic pill, cried out in a stern voice.</p><br/><p>The bodies of everyone present trembled abruptly after they heard his cry. His eyes were surprised as they looked at the Nihility Devouring Flame and the Purifying Demonic Lotus Flame on Xiao Yan’s shoulder. They… had actually been trapped in this place in the past?</p><br/><p>The Nihility Devouring Flame had a change in expression. He thought for a long while but he was still unable to find such a scene from his memories. All he could do was to speak in a faint voice, “I’m sorry, I completely do not remember about the matter you have said. However…”</p><br/><p>His words paused after he spoke until this point. “However, I am indeed here to rescue you this time around. Come with me…”</p><br/><p>The expression of the Di tier pill was a little dark and stern. He stared at the Nihility Devouring Flame for a long while before turning towards the Purifying Demonic Lotus Flame on Xiao Yan’s shoulder and asked, “Purifying Demonic Lotus Flame, do you still remember our agreement back then?”</p><br/><p>“Huh?” Little Yi was startled. It quickly grabbed Xiao Yan’s shoulder, shook its head and said, “I have never met you…”</p><br/><p>The Di tier medicinal pill’s expression became extremely gloomy after hearing this. A moment later, it seemed to have thought of something. He looked at the stone statue beside him, clenched his teeth and muttered, “This is done by you, right…”</p><br/><p>“Follow us.” The Nihility Devouring Flame looked at the Di tier medicinal pill and laughed.</p><br/><p>“Humph, it is likely that you are after my actual form, right?” The Di tier medicinal pill smiled coldly, looked at the Nihility Devouring Flame and said.</p><br/><p>The Nihility Devouring Flame smiled. After which, his expression became stern as he said, “Attack!”</p><br/><p>“Bang!”</p><br/><p>Hun Tiandi suddenly shot forward explosively after his words had just sounded. Monstrous Dou Qi spread. Finally, it turned into a tide as it ruthlessly smashed towards the Di tier embryonic pill.</p><br/><p>“An insignificant trick.” The Di tier embryonic pill laughed coldly after seeing this. His finger gently pointed forward. That monstrous energy tide that pounced towards him was actually cut apart!</p><br/><p>“It is extremely difficult to deal with this Di tier embryonic pill. We should capture it first.otherwise, Hun Tiandi might end up obtaining it.” Zhu Kun remarked in a deep voice after seeing Hun Tiandi attacked.</p><br/><p>“Aye, all of you should be on your guard against the other members of the Hun clan.”</p><br/><p>Gu Yuan nodded. After which, he gave the instruction to Xiao Yan’s group. The both of them flew out. Immediately, the energy in this place became wild and violent. Waves after waves of attacks, which caused the sky and earth to collapse, continuously attacked the Di tier embryonic pill.</p><br/><p>Faced with the attacks from Hun Tiandi, the Nihility Devouring Flame, Zhu Kun and Gu Yuan, that Di tier embryonic pill did not show any signs of panic. A frightening ripple spread as he lifted his hand. It blocked the attacks from those four. While he might appear unhurt, he was unable to move due to him being held back.</p><br/><p>Xiao Yan’s group involuntarily inhaled a breath of cool air as they saw that the Di tier embryonic medicinal pill did not end up in a disadvantage even when facing the four strongest experts on the present continent. Just one Di tier embryonic pill was already this terrifying. Just how terrifying would the true Di tier medicinal pill be?</p><br/><p>It was likely that even an elite Dou Di would find it somewhat troublesome when faced with a medicinal pill of this tier.</p><br/><p>The many experts from the Hun clan were ready to cause trouble when the intense big battle broke out in the sky. A cold glint flashed in Xiao Yan’s eyes. He wavef his hand. Yan Jin and the others rushed forward and blocked all the experts from the Hun clan.</p><br/><p>The experts from the Hun clan had a slight change in expression after they saw the Hun clan stopping them. However, they did not attack. Clearly, they wished to wait for the big battle in the sky to come to an end. This was because all of them understood that the battle there was the most important one!</p><br/><p>Whoever managed to obtain the Di tier embryonic pill would immediately be able to turn the battle around!</p><br/><p>Hence, they were aware that there was little effect regardless of what kind of intense battle they fought.</p><br/><p>“Bang bang bang bang bang!”</p><br/><p>Five figures accompanied with a strength that could destroy the world, crazily smashed against each other in front of everyone’s eyes. The energy fluctuation from them caused even the hearts of those located far away to be frightened. Fortunately, this realm was extremely stable. Hence, this big battle did not lead to a rip in space…</p><br/><p>Xiao Yan lifted his head. He looked at the wild and violent energy fluctuation in the sky, which caused one to feel a chill. His fist was slowly clenched tightly. The present situation was really a little complicated. The strength displayed by the Di tier embryonic pill was car too frightening.</p><br/><p>Hence, they currently not only needed to take precaution against the Hun clan snatching the Di tier pill but they also needed to guard against any injury or deaths inflicted by the Di tier embryonic pill on Gu Yuan and Zhu Kun. These two results were definitely fatal to the alliance army. Hence, there was really far too many variables in this chaotic battle!</p><br/>\n</div>"}