{"title": "Chapter 1642- Hun Di (Dou Di), Hun Tiandi!", "id": 1642, "volume": 17, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-1642-hun-di-dou-di-hun-tiandi", "volume_title": "Volume 17", "body": "<h1>Chapter 1642- Hun Di (Dou Di), Hun Tiandi!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 1642- Hun Di (Dou Di), Hun Tiandi!</u></strong></p><br/><p>All live cease to exist in the face of this calamity.</p><br/><p>The blood cloud covered the Central Plains for three months. However, it did not show any signs of weakening.</p><br/><p>During these three months, the prosperous and lively Central Plains had become unusually messy and desolated. Everyone were in panic as they searched for safe places to hide. Many had even ventured underground in hopes that doing so would allow them to hide from this calamity.</p><br/><p>Thick blood cloud covered the sky above the Central Plains. Dense revolting bloody stench permeated the air. The land was bright red. Viscous blood dyed the Central Plains until it became like the land of the demons.</p><br/><p>Dense white bone drifted within the sea of blood. There appeared to be countless sharp screeches reverberating within the sky, causing one's pores to stand.</p><br/><p>Such a massacre was extremely rare even in the history of the Dou Qi continent. After all, regardless of what kind of big battle erupted, an ordinary person would most likely not intervene. However, the Hun clan could be considered extremely heartless this time around. Their massacre would not stop because of anyone’s identity.</p><br/><p>Many people became increasingly hopeless in their hearts as they looked at the blood cloud in the sky, which left one’s heart cold. With more time passing by, the energy gathered within the formation became increasingly terrifying. Everyone knew that once Hun Tiandi broke out from his retreat, no one in this world would be able to stop him!</p><br/><p>The entire land was covered by death and darkness. The despair caused one to tremble despite not feeling cold.</p><br/><p>Sky Mansion Alliance headquarters.</p><br/><p>Many figures stood on a tall stage. Their eyes contained a gloominess as it penetrated through the huge defensive barrier in the sky. Finally, they looked at the blood cloud permeating the sky.</p><br/><p>Hun Tiandi’s aura is becoming increasingly strong. I can sense that he is about to succeed…” The pressure and silence continued for a moment before Zhu Kun slowly spoke.</p><br/><p>The hearts of the few people beside him involuntarily sunk upon hearing his words.</p><br/><p>“Don’t tell me that we are simply just going to watch him complete the final step?” Lei Ying clenched his teeth. His voice had some grievance that could not be described. They were just like tortoises during this period of time. All of them had shrunk into the defensive barrier. This kind of feeling was considered a kind of torture towards his somewhat fiery hot temper.</p><br/><p>“The formation has been formed. Just the energy gathered within the blood cloud is sufficient to give us trouble. There is no need to even talk about charging inside and engage in a life and death battle with Hun Tiandi.” Gu Yuan shook his his head. There was a rich helpless feeling within his eyes. The strength of Hun Tiandi was no longer something that they could compare with. They might be able to temporarily maintain his body. It was quite a difficult thing. It was really wishful in thinking of attack now.</p><br/><p>Hearing this, everyone’s fist were involuntarily clenched. Even they were felt a little hopeless in the face of this situation. Even less needed to speak of the others.</p><br/><p>“The area around the alliance was also filled with conflict. Those factions which had come to seek protection began to fight each other in order to occupy a safe position…” Yan Jin sighed softly.</p><br/><p>“These useless trash. Back then, they were simply idling by the side when we are fighting with the Hun clan. Now that they have tasted the bitter pill, they actually dare come to seek our protection!” Lei Ying cried furiously.</p><br/><p>Everyone smiled bitterly. Where would these factions find the courage to participate in the war between the alliance army and the Hun clan?</p><br/><p>“There is no need to be overly pessimistic. We still have some hope…” Gu Yuan braced his attention, smiled and said.</p><br/><p>Everyone appeared to have recalled the final hope upon hearing this. Light surged within their eyes. Indeed, they still had some hope...</p><br/><p>“Now… all we can do is pray that Xiao Yan will be able to successfully accept the Ancient God inheritance. That is the only way for us to turn things around… otherwise,this Central Plains will really be finished.</p><br/><p>The skinny young man’s image floated in his mind as Gu Yuan spoke softly, “However, I do believe that he will show us a miracle…”</p><br/><p>“It is naturally for the best if that is the case…”</p><br/><p>It seemed as though Gu Yuan’s words were infectious. The originally tensed group relaxed slightly. A smile appeared on their faces.</p><br/><p>Time slowly passed amidst the horror and hopelessness of countless individuals. The blood cloud that enveloped the sky created such a pressure that one had the impulse to become mad.</p><br/><p>Three months… four months… five months… half a year…</p><br/><p>The blood cloud in the sky became increasingly deep and solemn. At the same time, they also became increasingly thick. At times, even the sunlight had difficulty penetrating.</p><br/><p>An increasing number of blood light swept across the sky during this period of time. The surge of each blood light would be accompanied by a bloody scent that rose to the sky.</p><br/><p>However, with an increasing number of people swarming into the defence barrier that the Sky Mansion Alliance had placed, some of the terrifying blood light gradually changed their target. At the end, they even began to smash onto the defensive barrier. Fortunately, there were many powerful individuals in the alliance. Hence, stabilizing this defensive barrier did not pose much of a problem. Of course, each time the blood light charged towards the defensive barrier, it naturally caused many to panic. After all, the only protection everyone had was the defensive barrier in the sky!</p><br/><p>Once this defensive barrier was broken, they would become a member of the corpses that covered the land!</p><br/><p>Half a year slowly passed while countless number of individuals were feeling terrified. No overly great earthshaking big battle erupted during this half a year. However, the pressurising bloody stench was a much greater cause of craziness compared to any big battle.</p><br/><p>The blood cloud merely covered half of the Central Plains during this half a month’s time. No experts from the Hun clan appeared. Even Hun Tiandi’s voice did not appear in the sky. However, the fierce and monstrous aura from the sea of blood was becoming increasingly terrifying with the flow of time…</p><br/><p>On the seventh month after the formation covered the whole of the Central Plains, the sea of blood in the distant sky finally revealed some ripples.</p><br/><p>The sea of blood churned. A whirlpool appeared within the sea of blood. After which, a huge blood coloured lotus slowly rose from the sea of blood.</p><br/><p>A figure was seated on the blood lotus. Blood coloured hair fell like a waterfall. Some even fell into the sea of blood. The figure floated on the sea of blood like a demon spreading its wings.</p><br/><p>“A strength that leaves one intoxicated…”</p><br/><p>The human figure’s tightly shut eyes were slowly opened. The scarlet colour that filled it caused huge waves to rise within the sea of blood.</p><br/><p>“Crash!”</p><br/><p>The space behind Hun Tiandi became distorted when he opened his eyes. A human figure covered in black flames appeared.</p><br/><p>“Those descendant citizens from the Ling, Shi and Yao clans had all been thrown into the blood pool. Sixty to seventy percent of the descendant citizens from the Hun clan has also been thrown in. However, this had led to much dissatisfaction.” The Nihility Devouring flame looked at the human figure, whose hair had turned into the colour of blood, and said.</p><br/><p>Those blood eyes of Hun Tiandi fluctuated slightly. He laughed softly. The blood lotus was rotated and he looked directly at the Nihility Devouring Flame.</p><br/><p>The black flame in the eyes of the Nihility Devouring Flame leaped after he was being watched by Hun Tiandi. He asked in a faint voice, “What is the matter?”</p><br/><p>“There seems to be something extra mixed within the energy of the sea of blood?” Hun Tiandi laughed.</p><br/><p>“Oh?” The black flame within the eyes of the Nihility Devouring Flame withered intensely.</p><br/><p>Hun Tiandi was full of smiles. His hand was suddenly extended into the sea of blood in front of him. After which, he grabbed violently. The entire sea of blood began to churn. Subsequently, traces of black light agglomerated in his palm. Finally, it transformed into a cluster of black flame.</p><br/><p>“If I were to absorb these energy into my body, a devouring seed would likely have been planted right?” Hun Tiandi smiled as he looked at the cluster of black flame. After which, he faced the Nihility Devouring Flame and said, “It looks like you aren’t loyal to me?”</p><br/><p>“You have forced me to do this!”</p><br/><p>Fierce light suddenly shot out from the eyes of the Nihility Devouring Flame. Both of his hands suddenly pressed on the sea of blood. A ripple was emitted. Soon after; the sea of blood fluctuated. Endless black flame spread from it and crazily erupted towards Hun Tiandi.</p><br/><p>“Attack!”</p><br/><p>The Nihility Devouring Flame suddenly let out a stern cry when the Nihility Devouring Flame attacked. One could see the surrounding space fluctuate. Dozens of figures appeared. They hesitated for a moment before widening their mouths and spat out a cluster of dense black flame!</p><br/><p>These black flames swiftly gathered. Finally, they turned into a strange array on the sea of blood. They subsequently covered Hun Tiandi.</p><br/><p>“Ha ha, it looks like you have quietly schemed during these years. These Elders have actually been unknowingly controlled by you…” Hub Tiandi spoke with some surprise after seeing these familiar figures.</p><br/><p>“Hunph. Forget about these elders. Most of the clan members of the Hun clan have a bloodline seal that I have placed within their bodies. Hun Tiandi, do you really think that I am unprepared? With just a thought of mine, your Hun clan will suffer serious losses!” The Nihility Devouring Flame laughed coldly. “Originally, I would not have swarp to this. However, you actually plan to kill me . You cannot blame me for acting first!”</p><br/><p>“Suffer serious loss?”</p><br/><p>Hun Tiandi shook his head. The expression in his eyes suddenly became dark and dense. “As long as I am around, the Hun clan will never end up suffering serious losses!”</p><br/><p>“Your current self can also forget about fighting me. That is merely suicidal!”</p><br/><p>Hun Tiandi suddenly stood up from the blood lotus. He laughed out loud towards the sky. His mouth widened immediately and a suction force erupted. That black flame array covering him was turned into a line of fire that was swallowed by him.</p><br/><p>An aura that seemed to surpass this world suddenly surged out from within Hun Tiandi’s body as he attacked. Immediately, a giant wave rose from this endless sea of blood.</p><br/><p>“Bang bang bang!”</p><br/><p>The sea of blood below those dozens of Elders from the Hun clan surged. Finally, they were wrapped by blood bubbles. Those blood bubbles were shrunk violently and one was able to hear many muffled sound appearing. Their bodies were exploded into splutters of blood that merged into the sea of blood.</p><br/><p>These experts from the Hun clan did not even have the opportunity to react before they were directly killed by Hun Tiandi!</p><br/><p>“You have already succeeded?”</p><br/><p>The Nihility Devouring Flame finally paled from shock after sensing the vast and mighty aura that surpassed the world.</p><br/><p>“I have succeeded for half a month and I was merely waiting for you…” Hun Tiandi licked his bright red lips. His palm was aimed at the Nihility Devouring Flame before grabbing gently. “In order to congratulate me on successfully becoming the first elite Dou Di in ten thousand years, please hand me your essence flame.”</p><br/><p>“Hun Tiandi, the lives of those clan members of the Hun clan can be taken by me with just a thought. Do not blame me for being ruthless if you dare attack!” The Nihility Devouring Flame roared.</p><br/><p>Hun Tiandi paused momentarily upon hearing this. He turned his head and looked at the Nihility Devouring Flame with a strange expression. He said, “You have been with me for such a long time. Don’t tell me that you are unaware of my character?”</p><br/><p>The Nihility Devouring Flame felt his heart becoming cold. This fellow was willing to pay any price in order to achieve him aim, even if the price was the entire Hun clan!</p><br/><p>“Come over…”</p><br/><p>Just as the Nihility Devouring Flame had comprehended this and planned to flee, however, he was shocked to discover that his body was no long able to move!</p><br/><p>“Explode!”</p><br/><p>Hun Tiandi wore a smile. He gently aimed and clenched his hand at the Nihility Devouring Flame. The latter’s body exploded apart. It turned into black flames that permeated the sky as it crazily fled in all directions.</p><br/><p>Hun Tiandi glanced at the fleeing black flame. He widened his mouth and a suction force erupted. The many black flames swiftly flew backwards and entered into his mouth.</p><br/><p>“Your present strength is just like an ant in my eyes…”</p><br/><p>Hun Tiandi elegantly rubbed the corner of his mouth with the back of his hand after easily swallowing the Nihility Devouring Flame into his body. His scarlet lips appeared extremely evil.</p><br/><p>“Now… it seems to that I should head over and finish off those troublesome fellows.”</p><br/><p>Hun Tiandi’s eyes were thrown towards the land. A strange smile surfaced on his face. At the same time, a voice, which contained an endless bloodthirstiness resounded over the Central Plains in a vast and mighty fashion.</p><br/><p>“Remember that today is the day that I, Hun Tiandi, has gain the title of a god!”</p><br/>\n</div>"}