{"title": "Chapter 7", "id": 7, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-7", "volume_title": "Volume 1", "body": "<h1>Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 3 Chapter 1 Episode 3/Chapter 1: The dragon knight (1)</p><br/><p>TL: Tsubak</p><br/><p>ED: Raigeh</p><br/><p>Tae Ho took in a deep breath after passing through the door. He did that because of the countless warriors that were filling up the wide place. Even when counting roughly they seemed to be over the thousands.</p><br/><p>Even though he and Heda got in through the same place, it seemed like they came out in different places.</p><br/><p>‘What do I do now?’</p><br/><p>He couldn’t see anyone that could guide him.</p><br/><p>After looking for a while he realized that they seemed to be gathering with their own legions. It was easy to distinguish them because the symbol of each legion was engraved on their warriors and shields.</p><br/><p>‘And I’m the only one for Idun.’</p><br/><p>Did he just have to be standing here?</p><br/><p>Tae Ho realized why Bjorn and Heda cheered him up. Wouldn’t he have to be alone every time he came to this place?</p><br/><p>‘Um, so I’m the solitary wolf?’</p><br/><p>Tae Ho looked at his surroundings.</p><br/><p>“Oh, young man! We meet again.”</p><br/><p>“Bjorn!”</p><br/><p>A pleasing voice was heard at his back. Tae Ho unconsciously elevated his voice and welcomed Bjorn.</p><br/><p>“Kuku. It seems like it was awkward to be alone. So, how is your Legion?”</p><br/><p>Bjorn smirked and asked with expecting eyes. Tae Ho shrugged and answered.</p><br/><p>“It wasn’t that bad.”</p><br/><p>He wasn’t lying. Just like Heda said, as he didn’t have anyone above or below him, it was a bit comfortable.</p><br/><p>“Oh? Really? It seems like it is because the Valkyrie in charge of you is quite the beauty. Well, all the Valkyries are pretty. And their bodies are also stunning.”</p><br/><p>As Bjorn laughed and spoke with a loud voice, the warriors at their surroundings showed some interest.</p><br/><p>“What, which legion does he belong to?”</p><br/><p>“Whichever it is, the Valkyrie of our legion is the prettiest.”</p><br/><p>“Nonsense. I’m sure that our Valkyrie is the prettiest. She even said that she would be expecting from me in this battle.”</p><br/><p>“How funny. She was saying that to me. Why don’t you clear your ears?”</p><br/><p>Everyone said one or two words and soon, the warriors started to glare at each other.</p><br/><p>“Come at me!”</p><br/><p>“Ohh, it’s a fight!”</p><br/><p>“I’m betting on the blonde one!”</p><br/><p>And a fight really did start. The other warriors cheered and spectated.</p><br/><p>“Hoho, what a warm sight.”</p><br/><p>Bjorn nodded while crossing his arms. It seemed like he really did think that it was a warm scene.</p><br/><p>‘Um, the Ragnarok is happening right now, right?’</p><br/><p>The great war that had the fates of the planets on the line.</p><br/><p>But thinking about it, this place was like this since yesterday. As Tae Ho started to watch the fight with a rather resigned face, Bjorn said.</p><br/><p>“Well, I’m glad that it isn’t too bad. But should I say that it’s a cultural thing each legion has? You know, there are many things like that. We don’t have much information as to what place Idun’s legion is as they have really few warriors.”</p><br/><p>Looking at his face, it seemed like he was asking what place it was. But Tae Ho also didn’t have any particular words to say. Because a culture existed when many people gathered. As Tae Ho was the only one, the standards of culture didn’t exist.</p><br/><p>“It’s normal. What about you?”</p><br/><p>Although there may be a big difference in what Tae Ho and Bjorn called normal, Bjorn smiled after listening to that and replied.</p><br/><p>“Tir is the God of courage. Thanks to that, our legion is really hot. But the warriors aren’t the only ones, the Valkyries are also the same.”</p><br/><p>‘So can I think of it as being a hot-blooded legion?’</p><br/><p>Tae Ho remembered the athletic clubs he saw on mangas and movies. So thinking about the atmosphere of the Valhalla he saw for two days, it was comparatively common.</p><br/><p>“Is Idun’s legion’s blessing related to life?”</p><br/><p>“Yes, they say that it’s harder to die.”</p><br/><p>Tae Ho could only reply like this for now as he hadn’t experienced it directly. But Bjorn’s eyes shone with just this and then he nodded.</p><br/><p>“Oh, that’s a really cool blessing.”</p><br/><p>Because it would be hard to find a better blessing than one that makes you hard to die.</p><br/><p>It seemed like Bjorn’s amazement was sincere, so Tae Ho felt a little bit better. Because whatever the case, he had already received the blessing.</p><br/><p>“What about Tir’s legion?”</p><br/><p>“They gift the warrior’s courage which doesn’t know fear and a strong mental strength.”</p><br/><p>“Oh.”</p><br/><p>It was a blessing suitable of the God of courage. Tae Ho looked at the warriors that were still fighting and asked.</p><br/><p>“Bjorn, can you tell me about the other legions?”</p><br/><p>“You really are curious.”</p><br/><p>Bjorn laughed and then looked at the warriors like Tae Ho did.</p><br/><p>“Odin’s legion is proficient at using rune magic and are also immune to several kinds of magic. Thor’s legion receives a strong blessing of thunder, and for Heimdal’s legion they can see and hear from a really long distance.”</p><br/><p>They all had their own strong points, but the thunder of Thor he saw yesterday had a really strong impression. A blessing of thunder. Do their bodies get covered in thunder?</p><br/><p>Tae Ho waited for Bjorn to keep explaining with really curious eyes. But Bjorn smiled and then shook his head.</p><br/><p>“It will get really long if I explain one by one, so get to know it little by little. You will get to know it if you stand on the same battlefield even if you don’t want to.”</p><br/><p>Those weren’t wrong words. Tae Ho also didn’t need this information immediately so he decided to ask other things.</p><br/><p>“Bjorn, so will we be fighting together like yesterday?”</p><br/><p>Although they were gathered by legions, it didn’t mean that it had an order.</p><br/><p>Was doing a dogfight like yesterday a common thing here?</p><br/><p>But fortunately, Bjorn shook his head.</p><br/><p>“No, originally they go to the battlefield by legions. That way it’s easier to distinguish the merits of each legion, and they will also be able to unite better that way. But aren’t their legions that have few members like yours? That’s because they can’t just fight by legions.”</p><br/><p>“It seems like the legions with few members make an alliance.”</p><br/><p>“That’s right. You really are fast to catch on.”</p><br/><p>Bjorn laughed as if he liked him and then kept explaining.</p><br/><p>“Compared to yesterday, we will have a commander today. Normally, an inferior ranked warrior or a lowest ranked warrior with a lot of experience gets to become the commander.”</p><br/><p>It seemed like the fight from yesterday was special.</p><br/><p>‘Well, it’s not that they have been at war for a few days.’</p><br/><p>If they had fought without a commander, the Ragnarok would have ended a long while ago with Asgard’s defeat.</p><br/><p>“Warriors! Gather!”</p><br/><p>It was then. A familiar yell filled the entire hall. It was certainly Reginleif’s voice.</p><br/><p>“Our Valkyrie has come. Let’s meet on the battlefield.”</p><br/><p>Bjorn patted Tae Ho’s shoulders and disappeared with quick steps. Looking at how he spoke, it seemed like Reginleif belongs to Tir’s legion.</p><br/><p>‘But where do I have to go?’</p><br/><p>The warriors that were cheering and watching all started to move as they were told to gather.</p><br/><p>Tae Ho looked at his surroundings and saw that there were flags with symbols engraved on the walls. It seemed like they were gathering in front of those flags.</p><br/><p>‘Idun is over there.’</p><br/><p>He saw Idun’s symbol, a golden apple. The other legions had several flags lined up, but as Idun’s legion had only one, it was more showy.</p><br/><p>After passing by the warriors that went en masse, he could see the warriors lined up below their respective flags. It was amazing to see that the warriors that act as if they didn’t have an order respected their order this well.</p><br/><p>As Tae Ho stood in front of Idun’s flag all alone, the gazes of the warriors all gathered in him. They had marvelous faces.</p><br/><p>‘Wasn’t it more marvelous yesterday?’</p><br/><p>Because he was wearing proper armor today, but yesterday he was wearing the uniform of his pro gaming team.</p><br/><p>‘Anyways, I really am a solitary wolf.’</p><br/><p>Tae Ho just looked at the front after he straightened his expression. If he started to mind those gazes, only he would be the one to feel more complicated. He was practicing the wisdom he obtained in his long pro-gamer life when he felt that the gazes of the warriors started to turn to another place. As he reflexively turned his head, he could see a strong and big warrior getting in front of him.</p><br/><p>“I’m Ragnal of Heimdal’s legion. I will be leading you guys in this battle.”</p><br/><p>He was wearing his helmet firmly and had a round shield at his back.</p><br/><p>When you added Tae Ho with the surrounding warriors, the number would roughly amount to a hundred. And as the warriors in other legions were also similarly gathered, it seemed like there were only tens of commanders that were like Ragnal.</p><br/><p>Ragnal looked at everyone with serious eyes and explained in a low voice.</p><br/><p>“The objective of this battle is to recover the territory we lost at the gnolls. So we will be an attacking squad.”</p><br/><p>He didn’t really explain what a gnoll was, but it seemed like the other warriors knew what it was.</p><br/><p>‘Is it the gnoll I know?’</p><br/><p>A dog-headed monster that appeared often in games. Now that he saw, the things he fought yesterday also were dog-headed.</p><br/><p>“The front line has already started attacking. We will descend in the middle of the battlefield.”</p><br/><p>It was a similar situation to yesterday. Ragnal looked at the warriors again and said.</p><br/><p>“I will always be at the front. Just follow me.”</p><br/><p>His smiling face at the end seemed really reliable.</p><br/><p>“Prepare to charge!”</p><br/><p>“Prepare to charge!”</p><br/><p>The sound of the horn trumpets was heard with the voices of the Valkyries. A huge violet door appeared behind Ragnal.</p><br/><p>Ragnal raised his axe and yelled.</p><br/><p>“Let’s go warriors of Valhalla. For Asgard and the nine planets!”</p><br/><p>“For Asgard!”</p><br/><p>The warriors cheered. Maybe it was because of the atmosphere, but Tae Ho also raised his sword and yelled.</p><br/><p>“Warriors! Follow me!”</p><br/><p>“Uoo!”</p><br/><p>“Let’s go!”</p><br/><p>The warriors charged towards the violet door with Ragnal at the front. Tae Ho also ran towards the door while holding his sword tightly. He remembered Heda’s words, that told him not to die.</p><br/><p>‘Let’s live!’</p><br/><p>He didn’t think of dying. He had already died once, but he was living and breathing in this moment.</p><br/><p>He passed through the door. The cold air penetrated his lungs. He could see the white plains and black smoke, and the blood splattered everywhere and heaps of ashes.</p><br/><p>“Allies have come!”</p><br/><p>“Push them!”</p><br/><p>It was the same dogfight as yesterday. Tae Ho made a firm resolution and then placed his eyes on the front. It was to find Ragnal, that said to just trust in him and follow him.</p><br/><p>“Let’s go! Follow me!”</p><br/><p>Ragnal yelled at the front. He really seemed reliable. He was always at the front, as to keep what he had said. He felt excited just looking at his back.</p><br/><p>But it was also only for a moment.</p><br/><p>“Kuooo!”</p><br/><p>A roar that seemed to shake the whole battlefield was heard and then the earth rang. A huge and white dog-headed monster was charging from the front. Even at first glance, it seemed to be 5 or 6 times bigger.</p><br/><p>It was really fast. And its sword was even faster.</p><br/><p>Ragnal disappeared from his sight. He couldn’t know if his body became torn to pieces or if he was sent flying. The important thing was that the commander disappeared and that the monster had reached in front of the warriors and was swinging his sword.</p><br/><p>‘The boss appeared right off the bat!’</p><br/><p>And Ragnal is really weak!</p><br/><p>He didn’t even have time to complain. Tae Ho perceived intuitively the moment the warriors close to Ragnal became mincemeat.</p><br/><p>He made eye contact with the monster.</p><br/><p>And it threw its body towards Tae Ho.</p><br/><p>&lt; Episode 3 – The dragon knight (1) &gt; End</p><br/>\n</div>"}