{"title": "Chapter 8", "id": 8, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-8", "volume_title": "Volume 1", "body": "<h1>Chapter 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 3 Chapter 2 Episode 3/Chapter 2: The dragon knight (2)</p><br/><p>TL: Tsubak</p><br/><p>ED: Raigeh</p><br/><p>It was impossible to stop it.</p><br/><p>He realized that as soon as he saw it. That everything would end the moment he allowed even one hit to get him.</p><br/><p>Tae Ho invested all of his runes in agility. Meanwhile, the monster kicked the ground once more and after Tae Ho blinked once, it was already in front of him.</p><br/><p>Bang!</p><br/><p>The sword that fell from above was like a thunderbolt. But Tae Ho didn’t even know how he dodged it. He rolled on the ground and after distancing himself, he raised his head to look at it.</p><br/><p>He could feel its gaze. After he saw it up close, he got to know that it was bigger than his imagination. Even though it was lowering its posture, it seemed like its head reached 5mts.</p><br/><p>He felt numb. It seemed like its gaze was piercing him. The teeth he could see from its open mouth was terrifying.</p><br/><p>However, Tae Ho didn’t cower down and faced him. He breathed roughly. Although it was a single breath, his body stopped trembling. And rather, strength returned to his legs.</p><br/><p>[ Saga: Immortal warrior ]</p><br/><p>And at that moment, the two of them moved. The sword he swung at a low height passed in front of Tae Ho’s eyes. Tae Ho charged forward instead of falling back and then swung his sword to slice its thigh.</p><br/><p>It was shallow.</p><br/><p>Its skin was tougher than he thought and his muscles were hard. Tae Ho wanted to step back when it moved again. The low swing of the sword passed in front of Tae Ho again.</p><br/><p>Tae Ho dodged it once more by pulling back. And as soon as his feet reached the ground, he rolled sideways. Thunder fell once again in the place Tae Ho was at.</p><br/><p>Bang!</p><br/><p>He dodged its attack three times by now. He could feel the gazes of the warriors near him. And he could also feel the rage of the monster.</p><br/><p>‘Stay calm. Concentrate.’</p><br/><p>He would counterattack after dodging. Attack the leg and break his stance.</p><br/><p>It was like a game. The method was similar to when he caught a boss monster.</p><br/><p>He had only one life. And his opponent had plenty of hp. And its attack was really tremendous.</p><br/><p>But he still had to do it.</p><br/><p>“Kuoooo!”</p><br/><p>The monster cried. And at the same time, the gnolls near it came charging while crying. The warriors that lost their commanders acted on their own. A part of them charged towards the gnolls and another part charged towards it, the giant gnoll.</p><br/><p>“Aim for its leg!”</p><br/><p>One of the warriors yelled. And at the same time, three of the warriors that charged aimed for the leg of the giant gnoll. However, the monster didn’t stay still. He jumped to the air and dodged the attacks.</p><br/><p>“Kuo!”</p><br/><p>It cried and swung his sword widely after landing. The warriors retreated hurriedly, but one of the three got hit in his shoulder and his neck was also sent flying.</p><br/><p>The smell of blood spread. The two warriors that dodged the attack, raised their weapons again to attack the leg of the gnoll once again.</p><br/><p>And Tae Ho thought. That the legs were no good.</p><br/><p>Tae Ho was thinking about attacking his leg to lower its posture and then attack his vitals like his eyes or neck, but he became certain with the recent clash. That this strategy was now pointless, now that it was already guarding his legs.</p><br/><p>Then how?</p><br/><p>The giant gnoll jumped towards Tae Ho suddenly and swung his sword. It wasn’t only the gnoll, but his sword also looked like a dump truck.</p><br/><p>Tae Ho also barely dodged its attack this time. After the sword passed right above his head, Tae Ho’s eyes chased the head of the giant gnoll.</p><br/><p>It was still high. It was a height he wouldn’t reach by jumping. But hitting its legs was pointless.</p><br/><p>Tae Ho rolled on the ground. The monster turned quickly. And right then, Tae Ho charged forward again.</p><br/><p>Heda had said.</p><br/><p>That the saga is a reproduction of the original. But the ones that can use it properly are few.</p><br/><p>[ Saga: The charge of a warrior is just like a storm ]</p><br/><p>His body became fast.</p><br/><p>But it was still lacking. When he was playing the game that was meant for picking the members of the national team, Kalsted’s charge was really like a storm and it swept the battlefield. There was no one that could stop Kalsted, that was riding the skies and pouring thunder.</p><br/><p>Reproducing that was still impossible. But it was fine even if it was just a single step.</p><br/><p>If he could step on the sky.</p><br/><p>If he could kick on the air!</p><br/><p>He jumped. And then, jumped even higher by kicking on the air.</p><br/><p>The monster turned completely. But he couldn’t see Tae Ho. Because Tae Ho was higher than its head.</p><br/><p>“Uoooo!”</p><br/><p>Tae Ho yelled while falling over its head. The monster raised its head reflexively and Tae Ho’s sword aimed for its eye.</p><br/><p>“Kuooo!”</p><br/><p>The tip of the sword pierced its eye. Bright blood splattered, and the monster cried loudly.</p><br/><p>Tae Ho, that was holding on his stuck sword, got grabbed by the gnoll and got thrown to the ground. The moment he fell on his back he felt pain and shock that seemed to break his body, but maybe it was because of Idun’s blessing that he didn’t lose consciousness.</p><br/><p>“Pant. Pant.”</p><br/><p>Tae Ho raised his body with difficulty. He could see the gnoll that was in pain.</p><br/><p>The senses of the pro gamer Lee Tae Ho said. The legendary dragon knight Kalsted ascertained him. That this was the time to kill it.</p><br/><p>Tae Ho gritted his teeth and endured the pain. He kicked the ground once again and ran towards it. He didn’t have a weapon right now, but it didn’t matter.</p><br/><p>Another thing Heda had told him.</p><br/><p>The saga isn’t simply meant for strengthening your body.</p><br/><p>It could do things beyond that.</p><br/><p>[ Saga: The sword of the warrior ]</p><br/><p>Tae Ho gripped the air. The start of ‘Dark Age’. He could start to feel the sword he used to kill the first named boss monster, the orc warrior Graksha, on the Korean server.</p><br/><p>“Uooooo!”</p><br/><p>Tae Ho kicked the ground once more. And then, he jumped high and cut off the neck of the monster that was grabbing his head in pain.</p><br/><p>The neck split and blood flowed like a fountain. Tae Ho couldn’t land properly and rolled on the ground, and then used his sword as a cane and rose. And at the same time, just like a coincidence, the huge body of the gnoll fell down with a loud noise.</p><br/><p>The surrounding warriors gulped air. Even the warriors that were still in the middle of fighting were looking at Tae Ho. And then, all of them started to yell loudly.</p><br/><p>“Woohoo!”</p><br/><p>“Idun’s warrior!”</p><br/><p>“The monster has died!”</p><br/><p>The gnolls lost morale. And the warriors yelled more loudly. Tae could feel his heartbeat. He raised his sword unconsciously and roared. And then, red smoke started to get out of the corpse of the giant gnoll’s corpse and got absorbed by Tae Ho.</p><br/><p>He had more than ten lowest runes and two inferior runes. Energy overflowed from his body.</p><br/><p>Tae Ho breathed in and then looked at the sword in his hand. It was the sword Kalsted used when he was low leveled. Although it was merely low ranked as it only had the basic rune magic engraved in it, it was one of the few strong weapons when it came out on the server.</p><br/><p>The third saga, the sword of the warrior.</p><br/><p>He was certain that it was could recreate the weapons Kalsted used.</p><br/><p>Tae Ho then thought of the strongest sword in the global server and at the same time the personal sword of Kalsted, the ‘dragon sword Astellone’ but it was impossible as of now. It was impossible to recreate Astellone with Tae Ho’s current level.</p><br/><p>‘But one day.’</p><br/><p>Tae Ho clenched his fists tightly and raised his head. The warriors that had cleared the gnolls at his surroundings were looking at him. And one of them said.</p><br/><p>“The enemies are still coming. We have to keep attacking.”</p><br/><p>The warrior with the horned helmet pointed at the direction the gnolls were coming at with his axe. The gnolls were charging from beyond the white plains. And the attack objective was sure to be over there too.</p><br/><p>The warrior looked at Tae Ho again. Some shrugged their shoulders and some made gestures with their chins as if urging him.</p><br/><p>Tae Ho could guess why they were acting like that. And that’s why he clenched his weapon once again.</p><br/><p>Because there had to be a someone leading a group. And Tae Ho also didn’t like to break the momentum.</p><br/><p>“Warriors! Charge!”</p><br/><p>Tae Ho’s cry spread in the air. His ears started to get red at the embarrassment but there was no one that cared about that small change. The warriors yelled loudly and charged towards the gnolls. Tae Ho was next to them.</p><br/><p>Tae Ho’s eyes looked at the enemy. Every time he took a step, he became stronger. It wasn’t because he invested his runes.</p><br/><p>[ Synchro rate: 5% ]</p><br/><p>Tae Ho’s sword transformed and became sharper.</p><br/><p>&lt; Episode 3 – The dragon knight (2) &gt; End</p><br/>\n</div>"}