{"title": "Chapter 20", "id": 20, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-20", "volume_title": "Volume 1", "body": "<h1>Chapter 20</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 6 Chapter 2 Episode 6/Chapter 2: God’s precious metal (2)</p><br/><p>TL: Tsubak</p><br/><p>ED: Ren</p><br/><p>10 Valhalla warriors.</p><br/><p>20 dwarf warriors.</p><br/><p>They were the remaining ones after excluding 3 warriors of Valhalla and 5 dwarves that couldn’t do battle because of their injuries.</p><br/><p>The dwarves armed themselves with a round shield and a sword or axe, and the warriors that lost their shields due to the rain of arrows received new ones from the dwarves.</p><br/><p>After the preparations were done, Siri calculated the time. It would soon be midday.</p><br/><p>“Let’s go!” Isaac urged the warriors and stood at the front. Siri followed at the back..</p><br/><p>The fortress of the dwarves was divided, as the underground passage was connected with the mines and the fortress was above ground. The place the Unt was wasn’t underground but above ground, and on top of that was the top floor of the fortress, the second floor.</p><br/><p>“I’m confident on not encountering any enemies until we reach the top. But starting then, we will have to fight with all our strength.”</p><br/><p>It seemed like Isaac was nervous because his voice started to tremble. Siri nodded and then said to Tae Ho in a low voice, “Tae Ho, tell me immediately if you see something.”</p><br/><p>Siri had overcome danger twice thanks to Tae Ho. It seemed like she trusted him quite a bit.</p><br/><p>“Beyond that door, the top floor will appear.”</p><br/><p>After moving past the blocked or broken passageways for quite a while, Isaac pointed to a big metallic door. The dwarves were breathing in or pulling their weapons closer to their bodies, and the warriors of Valhalla also glared at the door while steeling themselves.</p><br/><p>“Starting now, it will be a battle of speed. Let’s go!” he said.</p><br/><p>After they opened the door, they saw a big hall that had a high ceiling, unlike the passageway. The dwarves started to run with all their strength with their short legs and the warriors of Valhalla ran lightly while being aware of their surroundings.</p><br/><p>“Over there!”</p><br/><p>“They are flocking in!”</p><br/><p>Isaac and Tae Ho yelled at the same time. Isaac’s eyes were looking at the right crossroad and Tae Ho’s eyes were looking beyond his back.</p><br/><p>Boom! Boom! Boom! Boom!</p><br/><p>As dozens of heavily armed dwarf ghouls came charging, the entire hall seemed to ring. Red letters approached quickly.</p><br/><p>“Keep running!</p><br/><p>Siri ordered them to keep running instead of fighting. Isaac had turned around the corner, and the warriors also kept running.</p><br/><p>“They are also coming in front of us!”</p><br/><p>After Tae Ho yelled, Siri and Rolph took out their crossbows. Two dwarf ghouls that were charging from the front fell down and Isaac took in a breath and then yelled, “I will entrust you the front!”</p><br/><p>Siri and the warriors charged forward. Tae Ho also grabbed Runefang and passed the dwarves.</p><br/><p>“Turn back! Fire!”</p><br/><p>There were only tens of ghouls in front of them but there were dozens of them behind them. In addition, they felt like more ghouls were coming from the path they hadn’t taken.</p><br/><p>The dwarves turned back at Isaac’s order and then they stood in a line and raised a wall of shields. And then they took out three pieces of metal that looked like the head of a dragon from beyond those spaces.</p><br/><p>Chwaaak!</p><br/><p>Fire surged from the heads of the dragons. The fire instantly devoured the ghouls.</p><br/><p>“Forgive me!” Isaac yelled while looking at the burning ghouls. Some warriors of Valhalla that turned to look back admired, and Tae Ho pushed back a dwarf ghoul with his shield and then crushed its head.</p><br/><p>“Keep going! Starting from here it becomes a single path, so we will stop them!”</p><br/><p>It wasn’t an easy task. The ghouls that were lit on fire tried to take one more step instead of collapsing, and in the first place, there were just too many ghouls.</p><br/><p>However, Siri nodded. Isaac smirked and made a gesture with his chin towards the warriors of Valhalla and the warrior that was at the rear raised a flamethrower a dwarf had given him.</p><br/><p>“Let’s go!”</p><br/><p>Siri didn’t turn back. And Tae Ho, who was charging forward with her, did the same.</p><br/><p>Explosions were heard from behind them. The yells of the dwarves and the sound of metal clashing rang through the hall.</p><br/><p>“Incoming!” Tae Ho yelled, as soon as he climbed the stairs. Ten ghouls, that were guarding the room that had the Unt, came charging towards them. Siri and Rolph fired their crossbows, and the warrior with the flamethrower smiled and said, “I’m also firing!”</p><br/><p>The head of the dragon spat fire this time too. The warriors cheered and the ghouls screamed.</p><br/><p>“Don’t drop your guard!”</p><br/><p>Isaac had used three flamethrowers. They couldn’t cover the entire hall with just one. The ghouls fired their crossbows from beyond the fire, and the warriors of Valhalla charged while covering their heads with the shield, instead of making a shield wall.</p><br/><p>“Valhalla!”</p><br/><p>“Ullr!”</p><br/><p>“Odin is looking!”</p><br/><p>Their arms trembled every time the crossbow hit. But the warriors didn’t stop. They swung their swords and axes towards the ghouls.</p><br/><p>“Idun!” Tae Ho also yelled and swung Runefang. He gave a quick glance at the hall but he didn’t see any more red letters.</p><br/><p>“Open it!”</p><br/><p>At Siri’s order, two warriors opened the big and heavy marble door. Rolph and three warriors fired their crossbows randomly, and the warrior that was fascinated by the flamethrower charged forward and spat more fire.</p><br/><p>“In the ceiling!” Tae Ho yelled.</p><br/><p>Stragos.</p><br/><p>The one that had brought the tragedy to the dwarven fortress was hanging from the ceiling.</p><br/><p>“Kwaak!”</p><br/><p>Just as Isaac and Rolph had explained, it really was a grey monster. It wasn’t only on his head, but almost his entire body was covered by strange tattoos. He threw himself towards the warrior holding the flamethrower, and the warrior turned the flamethrower towards the monster, but it wasn’t enough. The nails of the Stragos slashed the arm of the warrior.</p><br/><p>“Kuak!”</p><br/><p>The arm got cut off by the attack. The flames coming out from the flamethrower fell to the ground and started to burn the air, and as soon as the Stragos landed, it swung his arm again and cut off the head of the warrior.</p><br/><p>Blood started to pour out from the warrior that had lost his arm. Rolph and Siri fired arrows towards the monster, and two warriors raised their shields and tried to bash him.</p><br/><p>“Uoooooo!”</p><br/><p>It was a charge resembling a rhinoceros, but it didn’t reach him. The Stragos fell back almost ten meters with just one leap.</p><br/><p>“Kill them, my servants!”</p><br/><p>As the Stragos yelled, the dwarf ghouls that were waiting in several rooms started to get out and charged towards the warriors. And that number was close to 20.</p><br/><p>“Shield Wall!”</p><br/><p>Siri charged forward instead of falling back and raised her shield. The arrows fired by the ghouls hit their shields, and Rolph groaned.</p><br/><p>It was a strange thing. They would only get surrounded if they kept going like this, but Siri and the warriors kept moving towards the inside of the room while maintaining their Shield Wall.. The dwarf ghouls fired their crossbows again, and the Stragos glared at the group.</p><br/><p>And Tae Ho also glared back. The structure of the room he had heard from Isaac resembled the actual room. big circular room. There was a pillar made of stone was on the other side of the door and the holy anvil was on top of it.</p><br/><p>However, Tae Ho didn’t even look at the Unt on top of the anvil. He looked at other places with the dragon’s eye and in the end, he was able to find it.</p><br/><p>“I’m going!”</p><br/><p>“Go!” Siri yelled and released the Shield Wall. The warriors started to charge towards the ghouls at the same time and then took their attention.</p><br/><p>Tae Ho ran. It wasn’t towards the glaring Stragos or towards the holy anvil, but towards the wall.</p><br/><p>Isaac had said that the Unt could only be refined by starlight and moonlight. It was a wonder how it could be refined by those things but there was something he had thought of after listening to Isaac. In addition, hadn’t Isaac said thatthis room was meant to refine the Unt?</p><br/><p>They refined the Unt in this place. And for that, they needed starlight and moonlight. On top of that, this place was on the top floor. If he connected all of the conditions, then one result emerged.</p><br/><p>And so he asked, and Isaac affirmed.</p><br/><p>“Open it!” Rolph yelled. Tae Ho pulled on the switch that was on the wall, and in that moment a loud sound was heard in the ceiling.</p><br/><p>Kugagagaagaga!</p><br/><p>The ceiling opened, just like a dome. And the sun, that was at the highest at midday, showed up.</p><br/><p>“Kuaaak!”</p><br/><p>The dwarf ghouls that had their skins exposed started to yell. Although the ones that had their bodies covered seemed to resist it a bit, they couldn’t show proper movements. The reason was because of the Stragos.</p><br/><p>Smoke started to surge on the body of the Stragos, which was only wearing pants. Because of that he let out a terrible cry and tried to dodge the sun, but there was no way he could dodge the sun that was right above him, and the ceiling was still opening even now.</p><br/><p>“Now is the time! Kill him!”</p><br/><p>Two warriors charged towards the Stragos. And then, the Stragos swung his two hands and started to mumble something in a low voice.</p><br/><p>Something wasn’t right. Because of that, Siri, who was facing the dwarf ghouls, left them alone and turned her crossbow towards the Stragos.</p><br/><p>Siri’s arrow pierced the shoulder, but it didn’t stop mumbling. In addition, the tattoos on his torso started to shine brightly.</p><br/><p>“Hit his head!” Rolph yelled. The warrior swung his axe vertically, and the Stragos yelled something like a chant instead of mumbling anymore.</p><br/><p>Tae Ho looked at the sky and then understood what he had done.</p><br/><p>Dark clouds were coming towards them. It wasn’t a natural cause. The clouds that had gathered were only covering the ceiling of the fortress and blocking the sunlight.</p><br/><p>The axe stabbed on his shoulder. Then the Stragos pierced the chest of the warrior with his nails, and although both of them yelled equally, the one that fell was the warrior.</p><br/><p>“Kuhak!”</p><br/><p>The Stragos yelled evilly. Tae Ho looked at the ceiling once again. It was because the biggest letters he had seen until now was approaching.</p><br/><p>“Get away from him!” Tae Ho yelled. Siri, Rolph and the warriors charging towards him flinched, and the warrior that was already close to him got covered in acid that fell from the sky.</p><br/><p>“Uaak!”</p><br/><p>The warrior fell while screaming. A black monster that seemed to be a fused monster of a bat and a lizard appeared from the ceiling. It was so big that its wings were about ten meters wide.</p><br/><p>It stood on the borders of the ceiling and started to pour down acid again. The warriors could only dodge the acid and fall back, and the Stragos smiled evilly and ran towards the wall. As the clouds were already blocking the sunlight, it seemed as if he was going to ride the monster and pour acid.</p><br/><p>He couldn’t just look idly. Tae Ho also ran like the Stragos. When he reached the wall, Tae Ho kicked on the air and jumped.</p><br/><p>[Saga: The Charge of a Warrior is Just Like a Storm]</p><br/><p>The Stragos got on the monster, which had lowered its head. Tae Ho jumped once more into the air and flew towards him.</p><br/><p>As he had never imagined that Tae Ho would jump on the air, the Stragos got hit by Tae Ho’s body slam and fell from the monster. Tae Ho hurriedly extended his arms and grabbed the neck of the monster.</p><br/><p>“Make him fall!”</p><br/><p>The Stragos, that fell to the ground, swung his claws and ordered the monster. And then, the monster surged to the sky. It seemed as if he was planning to drop Tae Ho from a high point.</p><br/><p>“Tae Ho!” Siri and Rolph yelled urgently. Tae Ho grabbed the neck of the monster tightly and then realized one thing.</p><br/><p>He was accustomed to it.</p><br/><p>Riding on monsters, that is.</p><br/><p>Flying in the sky with a monster.</p><br/><p>Because the Dragon Knight Kalsted was indeed a Dragon Knight. Gryphons and Wyverns were obvious things, and he had even ridden and fought on the strongest aerial monster, a dragon!</p><br/><p>[Saga: The one that can handle dragons]</p><br/><p>[Synchro rate: 8%]</p><br/><p>The empty slot filled up. And simultaneously, his synchro rate went up.</p><br/><p>“Turn your head!” Tae Ho grabbed the head of the monster and ordered. The monster resisted but it turned unwillingly. The overwhelming and unyielding spirit of Tae Ho made that possible.</p><br/><p>Siri and Rolph opened their eyes widely and the warriors of Valhalla cheered instinctively, but the Stragos realized that something wasn’t right.</p><br/><p>“Let’s go!” Tae Ho ordered, and the monster moved towards the ground and then started to spit acid.</p><br/><p>&lt; Episode 6 – God’s precious metal (2) &gt; End</p><br/>\n</div>"}