{"title": "Chapter 22", "id": 22, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-22", "volume_title": "Volume 1", "body": "<h1>Chapter 22</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 6 Chapter 4 Episode 6/Chapter 4: God’s precious metal (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: Ren</p><br/><p>A huge monster had crashed, explosions had occurred, and the scars left by the weapons made the room a mess. But only the holy anvil was in perfect shape.</p><br/><p>“It’s a really big anvil.”</p><br/><p>“You are right. It’s really big.”</p><br/><p>“Even a person would be able to lie down on it!” The warriors that had gathered admired.</p><br/><p>Even Tae Ho thought that the holy anvil was huge, even when it was his first time seeing an anvil. Although he didn’t know much, he did know that it would be some times bigger than a normal anvil.</p><br/><p>There were rune letters on the pillar made from stones, and a big white anvil that had several black spots on it was on top of that. And once again, there was a silver metal the size of a fist above that.</p><br/><p>“Wait. Is that little thing the Unt?”</p><br/><p>“Warriors of Valhalla! We came to help!”</p><br/><p>The loud voice made the warriors gulp down their question. Just as they expected, it was Isaac and the dwarves.</p><br/><p>Isaac, whogot into the room first, looked at the burning corpse of Maguros and the beheaded Stragos and then smiled brightly.</p><br/><p>“You did it!”</p><br/><p>Isaac wasn’t the only one that was excited. The dwarves that had covered themselves with a bandana or a cape to block the sunlight, started to burst into laughter.</p><br/><p>“Isaac, is your group fine?”</p><br/><p>As Siri asked calmly, Isaac nodded heavily as if he had gotten a hold of himself.</p><br/><p>“It’s not that we haven’t suffered any damages, but we are fine. Mercury is one of our specialties.”</p><br/><p>The dwarves had used their flamethrowers and the flashbang. When looking at the explosion the flamethrower made, it was highly probable that they had a proper bomb or something.</p><br/><p>Isaac smiled, as if telling them not to worry and approached the warriors on his short legs.</p><br/><p>“Is the Unt fine?”</p><br/><p>“Check it yourself. We wouldn’t know, even if we looked at it.”</p><br/><p>As Rolph stepped aside, Isaac started to hurry towards the anvil and then nodded.</p><br/><p>“Mm, the holy anvil blocked the evil strength well. The Unt is safe.”</p><br/><p>It seemed like the black spots were traces of being led astray.</p><br/><p>As Isaac was greatly satisfied, after looking at the other warriors as if gathering their opinions, Rolph asked carefully, “Isaac, is this all?”</p><br/><p>“That’s right. That’s why I told you that it was really precious. It’s a miracle that we dug something of that size.”</p><br/><p>Isaac looked at the other dwarves as if that wasn’t the case and then everyone nodded at the same time.</p><br/><p>However, it wasn’t that great for the warriors. What would they do with just a piece the size of a fist?</p><br/><p>“I think that it won’t do much difference even if they take it.”</p><br/><p>As one of the warriors spoke, Isaac got worked up.</p><br/><p>“What are you saying? You are able to make many things with an Unt of that size! Be it an axe, a sword or several rings!”</p><br/><p>Certainly, it might be possible to make an axe or a sword with it. If it were a small one to cut down lumber, that was.</p><br/><p>“How much do you need to make Mjolnir?”</p><br/><p>Tae Ho thought of the hammer Thor held and then Isaac started to think and pointed at the corpse of the burning Maguros.</p><br/><p>“If we take into account the compression, then the size of that monster?”</p><br/><p>The warriors all turned to look at Maguros. Just looking at its size, it was several times bigger than the holy anvil.</p><br/><p>An Unt the size of a fist; and Mjolnir needed Unts as big as Maguros’s corpse.</p><br/><p>“And the enemies can make Mjolnir?”</p><br/><p>As the warriors looked at Isaac with cold eyes, he hurriedly cleared his throat.</p><br/><p>“Hm, hmhm. Well, I’m not certain. I was just taking in the probabilities.”</p><br/><p>As he cleared his throat consecutively while saying that he didn’t lie, the warriors started to jeer him but Tae Ho nodded.</p><br/><p>‘I was convinced.’</p><br/><p>Stragos was certainly strong. He was a real monster that almost annihilated the entire dwarf mine.</p><br/><p>But he was lacking compared to Mjolnir. If an Unt capable of making Mjolnir existed in this mine, then monsters much stronger than Stragos would have flocked here.</p><br/><p>Siri also seemed to have thought the same thing, as she was nodding slightly.</p><br/><p>“But still, thanks to you we were able to avenge our brothers. We thank you sincerely.”</p><br/><p>Isaac, who was still clearing his throat while being jeered by the warriors,then hit his chest like the warriors of Valhalla and said, “We just did what he had to as warriors of Valhalla.”</p><br/><p>Then the warriors of Valhalla, who seemed to be weak towards compliments became embarrassed and Siri replied with a calm voice, “We are still grateful nonetheless, whether that was your task or an action that doesn’t ask to be rewarded.”</p><br/><p>Isaac smirked and then turned to look at the dwarves. While Isaac was being jeered at, the others had been inspecting the anvil and then placed the Unt in a box and handed it to Isaac.</p><br/><p>“Isaac.”</p><br/><p>“Yeah.”</p><br/><p>Isaac touched the box with a complicated expression and then approached Siri.</p><br/><p>“Here, take it.”</p><br/><p>Isaac gave her the box. Siri blinked as if she was surprised and then asked instead of receiving the box, “Will it be fine?”</p><br/><p>“It’s fine. We were planning to give it to Valhalla after we refined it anyways. But after seeing this, you may know that refining the Unt after this disaster is impossible. And even if we are holding onto it, other monsters may come to take it. That’s why I will pass on the honor of refining this Unt to the master crafters of Valhalla.”</p><br/><p>Refining an Unt seemed to be a real glory, such that the dwarves wore a really regretful expression. Siri looked at those dwarves for a moment and then spoke to Isaac.</p><br/><p>“I understand. I will respect your will.”</p><br/><p>As Siri grabbed the box with a respectful motion, Isaac gritted his teeth and let go of the box.</p><br/><p>[The Strong Willed]</p><br/><p>[Isaac]</p><br/><p>Isaac turned his eyes away purposefully, to shake off his regrets, and Siri also hid it quickly in her cape, as if being considerate of him.</p><br/><p>Only after they hid the box did Isaac lift his head and say towards Siri and the warriors, “Now, what about drinking some beer? We have to celebrate having taken revenge for our brothers and grieve for them. We also have to treat our benefactors!”</p><br/><p>“Ohh!”</p><br/><p>“Are we tasting dwarf beer?”</p><br/><p>“Dwarf beer!”</p><br/><p>As the warriors cheered and enjoyed it, even Isaac started to feel so good that he yelled, “Of course! We will give you the barrel itself!”</p><br/><p>“You are cool! You are a man!”</p><br/><p>“You really do know something!”</p><br/><p>They seemed to would put their arms around their shoulders at any time. However, Siri poured cold water on the scene.</p><br/><p>“No, that’s impossible. We don’t have the time. We have to return quickly.”</p><br/><p>‘Gasp?!’</p><br/><p>“How can that be!”</p><br/><p>“You are too much!” The warriors complained, while wearing teary faces, but Siri was blunt.</p><br/><p>“Isaac, we will be returning. I’m sorry we can’t help you with cleaning up.”</p><br/><p>He had to quickly tell Valkyrie Rasgrid about what had happened in the mine. In addition, an army was charging from the west to attack the fortress. It wasn’t the time to be drinking beer leisurely.</p><br/><p>But it was still dwarf beer.</p><br/><p>The warriors looked at Isaac with earnest eyes and Isaac glanced at Siri, but there was no change in her expression. In the end, the one that gave up first was Isaac.</p><br/><p>“Um, I can’t do anything about it. But still, we can’t send away our benefactors with empty hands. We will give you one each, so follow us.”</p><br/><p>“Are you giving us a barrel each?”</p><br/><p>Rolph was also a warrior of Valhalla, so he asked with quite an expectant voice. And as the depressed warriors all raised their heads, Isaac smirked.</p><br/><p>“I will give you something better than that. Have you heard about the dwarf armory?”</p><br/><p>“Dwarf armory!”</p><br/><p>“Weapons made by dwarves!”</p><br/><p>“Follow me!”</p><br/><p>As Isaac led the way confidently, the warriors turned to look at Siri and she smiled bitterly, as if she couldn’t help it, and then nodded.</p><br/><p>“Now, take one you like!” Isaac yelled as they reached in front of the armory. The warriors that were jumping about while waiting for the door to open all brightened and went in running.</p><br/><p>Swords, axes, bows, shields, armor, helmets, etc. The various equipment were lined up on the walls and the furniture. It seemed like there were at least a hundred of them.</p><br/><p>Even the calm Siri seemed to have been so excited that her steps were quite fast while coming to the armory. Tae Ho just stood still at the entrance instead of following everyone else and activated his saga.</p><br/><p>[Saga: The Eyes of a Dragon Can See Through All Things]</p><br/><p>In Dark Age, normal weapons were colored in white. And after he started to look while being aware of that, words appeared over the many weapons in a heap.</p><br/><p>[Has an excellent weight balance]</p><br/><p>[Huge axe]</p><br/><p>[Hard]</p><br/><p>[Round shield]</p><br/><p>However, Tae checked another thing instead of reading the letters.</p><br/><p>‘Gold… No, please let there at least be blue.’</p><br/><p>The special equipment would be named with a color.</p><br/><p>It was highly probable that this place had only gathered the normal weapons, seeing that only white letters appeared in a heap. But still, Isaac wouldn’t just let them take those things away. It was possible that there was special equipment.</p><br/><p>‘Bingo.’</p><br/><p>He saw blue words. Tae Ho moved towards the blue words without even looking at any other place.</p><br/><p>[The fast and light]</p><br/><p>[Hawk’s wing coat]</p><br/><p>There was a grey coat adorned with feathers below the blue letters.</p><br/><p>As Tae Ho tried to check it more closely to know its use, a voice was heard from behind him.</p><br/><p>“To try to pick the wing coat, you have good eyes. And that thing is also excellent when used for defense. It can block blades and has resistance towards magic because of the magic in it. In addition, if you wear it your movements become better.”</p><br/><p>It was Isaac. But according to how he spoke, it didn’t seem to be a normal defensive equipment. Tae Ho looked at Isaac, who was smiling as proudly as if he was looking at his son and then asked honestly, “Isaac, what’s a wing coat?”</p><br/><p>“Huh? You don’t know what a wing coat is?”</p><br/><p>“Yes.”</p><br/><p>Isaac blinked at Tae Ho’s answer. His eyes were asking how he had picked it then, but Tae Ho was just waiting for Isaac to answer.</p><br/><p>In the end, Isaac was the one that explained.</p><br/><p>“If you wear the wing coat and recite the given chant, you will be able to transform. The things you chose are the wings of a hawk, so you will be able to transform into a hawk.”</p><br/><p>“Into a hawk?”</p><br/><p>“That’s right. The Valkyries all have a swan’s wing coat. If they have to fly away urgently they will transform into a swan.”</p><br/><p>‘So Heda can also transform into a swan?’</p><br/><p>Tae Ho imagined Heda transforming into a swan. It wasn’t easy to imagine it but he thought that it would suit her.</p><br/><p>“How is it? Try transforming into a hawk after you return.”</p><br/><p>It was quite an attractive proposal, because transforming into a hawk and flying in the sky were all interesting things.</p><br/><p>“Uh, wait.”</p><br/><p>However, Tae Ho thought of another thing in the next moment.</p><br/><p>They would return to Black Fortress.</p><br/><p>How?</p><br/><p>“Uaaaaa! Habasini Tooo Isaheeee!”</p><br/><p>The black structures that looked like coffins crossed the sky with an amazing speed. Siri’s voice was heard beyond the voices of the warriors.</p><br/><p>“You will bite your tongue! Shut your mou- Ugh?!”</p><br/><p>“Captain Siri?!”</p><br/><p>“Captain?! Did you bite your ton… Ugh!”</p><br/><p>The warriors bit their tongues in consecution. Tae Ho shut his mouth tightly as to not join them and clenched the arm that was holding the hawk’s wing coat.</p><br/><p>‘I will also get accustomed to this.’</p><br/><p>Someday.</p><br/><p>The black flash became faster. The Black Fortress wasn’t that far.</p><br/><p>&lt; Episode 6 – God’s precious metal (4) &gt; End</p><br/>\n</div>"}