{"title": "Chapter 21", "id": 21, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-21", "volume_title": "Volume 1", "body": "<h1>Chapter 21</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Episode 6/Chapter 3: God’s precious metal (3)</p><br/><p>TL: Tsubak</p><br/><p>ED: Ren</p><hr/><br/><p>The thick green acid melted the floor. Stragos rolled on the ground, barely dodging the acid, and after that opened his eyes as if he could hardly believe it.</p><br/><p>“Maguros!”</p><br/><p>As he yelled desperately, the monster Tae Ho was riding roared in reply. It seemed like it was saying that it didn’t intend to attack.</p><br/><p>[The Enraged]</p><br/><p>[Stragos: Bergot]</p><br/><p>[Resisting]</p><br/><p>[Maguros]</p><br/><p>The two were in red. Tae Ho grabbed the neck of the monster called Maguros tightly and smiled bitterly. Just like the other sagas, it seemed like ‘The One That Can Handle Dragons’ was also incomplete. He couldn’t control Maguros completely yet. But there was still another method.</p><br/><p>“Fly again!”</p><br/><p>Maguros roared loudly and then surged into the air. However, it didn’t last long this time. Tae Ho turned Maguros again.</p><br/><p>“Go! Return to your owner!”</p><br/><p>It was a flight closer to a vertical dive. Maguros roared, and Stragos realized what Tae Ho was about to do.</p><br/><p>“You evi-”</p><br/><p>He couldn’t finish cursing. Maguros started to dive towards the ground. Precisely speaking, it was above Stragos’s head.</p><br/><p>The roar and the cries were mixed. Maguros’s neck, which fell head on, got bent and that huge beast crashed onto Stragos. Its huge wings got bent at a strange angle.</p><br/><p>The warriors of Valhalla pulled back or assumed a defensive stance. Siri and Rolph each looked at different places. Siri looked at the sky, and Rolph looked at Maguros that had crashed.</p><br/><p>A smile appeared on Siri’s face. And Rolph, who had looked at the sky late, called out Idun’s name.</p><br/><p>Tae Ho was in the air. He had jumped before Maguros crashed and was spinning in the air.</p><br/><p>“Uwat!”</p><br/><p>Tae Ho maneuvered in the air rather sloppily and then started to roll after he landed. Rolph laughed freshly and Siri looked at the Maguros again and ordered, “Fire! Finish him for certain!”</p><br/><p>The warriors of Valhalla reacted. The ones that had crossbows, including Rolph, started to fire arrows consecutively, and the ones that didn’t started to throw their axes.</p><br/><p>In the middle of this, Tae Ho let out a groan and touched the ground. Although he had maneuvered in the air, as it was from quite high it hurt a lot. But it wasn’t the time to shrink down in pain. Tae Ho’s eyes still saw the red letters. Although it had almost died, it wasn’t dead yet. And it was the same for the Stragos.</p><br/><p>He needed to deal the final blow. Tae Ho gritted his teeth and stood up and then a nice thing entered his eyesight.</p><br/><p>‘The flamethrower!’</p><br/><p>It was the flamethrower that the warrior that had been killed by Stragos had been holding. Although the part of the head where the fire came out was bent, it didn’t matter that much. It would still be useful.</p><br/><p>Tae Ho threw the flamethrower towards Maguros and at the same time yelled towards Rolph, “Rolph! Explode it!”</p><br/><p>It was too short, but Rolph understood it. He fired an arrow towards the flamethrower that fell near the armpit of Maguros and then activated his saga.</p><br/><p>[Saga: The Arrow of the Hunter Calls for an Explosion]</p><br/><p>Bang!</p><br/><p>The arrow that hit the flamethrower exploded. And in that moment, an explosion much bigger than Tae Ho had imagined occurred.</p><br/><p>‘These crazy dwarves!’</p><br/><p>He had expected an explosion, but he didn’t think it would be this much. Were they carrying those things like nothing?</p><br/><p>Whatever Tae Ho’s thoughts were, the big explosion covered Maguros immediately. It seemed like the sticky liquid covering Maguros’s skin was making the fire grow more.</p><br/><p>The warriors of Valhalla opened their eyes roundly at the sudden explosion, but it only lasted for a moment. Then they enjoyed the situation and cheered like always.</p><br/><p>“We won!”</p><br/><p>“We beat it!”</p><br/><p>“Burn them more! More!”</p><br/><p>Some of the warriors seemed to want to make the fire bigger, so they threw the nearby dwarf ghouls in as lumber.</p><br/><p>Siri laughed while being at a loss for words but then nodded slowly. Her stiff expression seemed to be loosened up a bit.</p><br/><p>Rolph turned to look at Tae Ho instead of looking at the scene his arrow had made.</p><br/><p>“I was really amazed. Are you okay?” e walked while asking.</p><br/><p>Tae Ho nodded and answered, “I’m fi… not yet!”</p><br/><p>“Kuaaaaaaak!”</p><br/><p>A roar exploded along with Tae Ho’s voice. And Stragos surged up from the fire. One of his arms was destroyed, and there were terrible burns on all of his body but he was still alive.</p><br/><p>His black nails became long. Then he swung his claws towards the nearest warrior at a speed that was hard to follow with the eyes. The warriors holding the bodies of the dwarf warriors tried to block with the ghouls, but it wasn’t enough. The claws of Stragos slashed the waist of the warrior deeply.</p><br/><p>The warrior grabbed at his waist and fell and Stragos yelled once again. His skin was recovering a bit. Siri then pulled the trigger.</p><br/><p>The arrow hit his back and then got shaken but after that, he disappeared.</p><br/><p>“Tae Ho!” Siri yelled. Stragos kicked the ground with an amazing strength and then charged towards Tae Ho, instead of Siri that had fired the arrow. Although they were 10 meters away, it was meaningless</p><br/><p>‘Don’t joke!’</p><br/><p>At that moment, Tae Ho grabbed at the air. The warrior’s sword activated and Runefang blocked Stragos’s claws.</p><br/><p>Bang!</p><br/><p>Tae Ho got pushed back. Stragos attacked Tae Ho once more after landing. He attacked with overwhelming strength and speed. Tae Ho didn’t breathe. He concentrated on Stragos’s claws. Some attacks scratched Tae Ho, but they weren’t lethal.</p><br/><p>Stragos urgently attacked.. Tae Ho looked at his attack calmly and then swung Runefang roughly. Runefang parried Stragos’s claws and hissingle left hand got bounced back.</p><br/><p>Bang!</p><br/><p>An explosion occurred at Stragos’s back. It was Rolph’s arrow. Stragos tried to stand up, even when letting out a terrible cry, and then one more arrow hit his head like a drawing.</p><br/><p>It was Siri. Her eyes were directed beyond its head with thearrow stuck in it. Tae Ho was the one there.</p><br/><p>Tae Ho swung Runefang. It was a beautiful trajectory. The sharp blade hit the neck and advanced like that. He beheaded him in an instant.</p><br/><p>The warriors gulped air. Contrary to them, Tae Ho breathed out. Runefang sliced the air after cutting down Stragos’s head and then he fell down. The head that got separated from the body rolled on the ground.</p><br/><p>Boom.</p><br/><p>Tae Ho perceived the sound late. He breathed out once more and the warriors cheered. Siri didn’t break her firing posture even after Stragos’s head fell, and only after Tae Ho dropped Runefang did she loosen her shoulders and let out a sigh of relief.</p><br/><p>[Stragos’s corpse]</p><br/><p>The red letters transformed to become white, which represented neutrality. Tae Ho released the Dragon’s Eye and then sat down as if collapsing.</p><br/><p>“Idun’s warrior!”</p><br/><p>“Idun’s pride!”</p><br/><p>The warriors yelled and approached Tae Ho. Tae Ho closed his eyes tightly instead of welcoming them.</p><br/><p>It hurt. It hurt like hell. It seemed as if it was because of the poison in his nails, that he felt as if his wounds were burning.</p><br/><p>However, Tae Ho smiled bitterly. He breathed in calmly and checked himself.</p><br/><p>[Synchro rate: 9%]</p><br/><p>It had also risen this time. And Tae Ho became certain.</p><br/><p>‘It’s related to the completion of the saga.’</p><br/><p>It wasn’t only the Immortal Warrior. The other sagas were also related to the synchro rate. If he investigated a bit more, he would know how far his saga could reach and what he could transform into sagas more clearly.</p><br/><p>‘And…’</p><br/><p>He was right in front of the 10%.</p><br/><p>‘There’s something.’</p><br/><p>There would be a change the moment he reached 10%. It wasn’t something anyone had particularly decided on, but Tae Ho felt that way. It was the prediction of the progamer Lee Tae Ho, not Kalsted’s.</p><br/><p>“Tae Ho! Are you okay?!”</p><br/><p>“You aren’t dead, right?!”</p><br/><p>“Wake up! Let’s celebrate the victory!”</p><br/><p>The warriors surrounded Tae Ho and talked loudly. Tae Ho just nodded suitably and then laid down.</p><br/><p>‘Let’s sleep like this.’</p><br/><p>He was hurt and also exhausted.</p><br/><p>However, he didn’t feel even a little bit of sleep.</p><br/><p>‘Idun’s blessing.’</p><br/><p>Tae Ho smiled bitterly. As he stood up, giving up on sleeping, the warriors laughed again.</p><br/><p>“Ohh! Spirit entered your eyes again!”</p><br/><p>“That was a nice attack!”</p><br/><p>“Absorb the rune quickly!”</p><br/><p>While being urged by the warriors, Tae Ho extended his hand towards Stragos. Then red smoke started to appear like fire.</p><br/><p>“Wow.”</p><br/><p>It was three times the amount than when he killed Red Eyes. For it to be this much even when taking off Siri’s and Rolph’s share, it seemed like he was a much bigger figure than he had thought.</p><br/><p>‘Well, he did call dark clouds and did many things.’</p><br/><p>Tae Ho nodded and then clenched his fist lightly. The runes he had absorbed made him feel full and filled his chest.</p><br/><p>“You have done great. It was an amazing performance.”</p><br/><p>Siri approached and the warriors opened a path for her. Tae Ho smiled and said, “You and Rolph too.”</p><br/><p>Because the arrows of those two people had played a really big role.</p><br/><p>He turned to look at Siri and Rolph and then retrieved the remaining runes from Stragos’s body. After that came the treatment of the injured and the retrievement of the deceased.</p><br/><p>“Okay, let’s check on this thing called Unt.”</p><br/><p>At Siri’s words, all the warriors turned to look at the holy anvil.</p><br/><p>The Gods’ precious metal, Unt. The object that had caused all of this.</p><br/><p>The warriors, who were filled with curiousness, walked hurriedly. It was the same for Rolph and Siri.</p><br/><p>‘Ah, I was about to forget.’</p><br/><p>Tae Ho, who was following them from the rear, stopped in his place and then went towards the still burning Maguros’s corpse.</p><br/><p>Retrievement of the rune.</p><br/><p>Red smoke started to get sucked into Tae Ho’s palm again.</p><br/><p>&lt; Episode 6 – God’s precious metal (3) &gt; End</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/valhalla-saga-chapter-20\" id=\"prev_chap\" title=\"Chapter 20\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/valhalla-saga-chapter-22\" id=\"next_chap\" title=\"Chapter 22\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"95237\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}