{"title": "Chapter 24", "id": 24, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-24", "volume_title": "Volume 1", "body": "<h1>Chapter 24</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 7 Chapter 2 Episode 7/Chapter 2: Valkyrie (2)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><br/><p>The people remembered the name of one man.</p><br/><p>Dragon knight Kalsted.</p><br/><p>The strongest man in Dark Age.</p><br/><p>&amp;</p><br/><p>Pa!</p><br/><p>The air split broke and exploded. Tae Ho felt it when the wyvern ripped the air with its wings. He detected it. And he closed his eyes because of that.</p><br/><p>Kalsted, the one that had the bloodline of a dragon.</p><br/><p>He told him. He whispered to the pro gamer Lee Tae Ho.</p><br/><p>The things he could do. The new area he could now reach.</p><br/><p>“Tae Ho!”</p><br/><p>Siri yelled and put more strength in her arms grabbing on Tae Ho’s waist. Tae Ho opened his eyes at her voice that was filled with earnest. The wind still blew strongly. The wyvern flew riskily. Tens of harpies were gathering towards them at the same time.</p><br/><p>“Ah.”</p><br/><p>Tae Ho said. His yell, that was closer to an exclamation, was filled with dullness. So Siri yelled once again.</p><br/><p>“Tae Ho! Get a hold of yourself!”</p><br/><p>“Grab tightly!”</p><br/><p>Tae Ho yelled. Siri agreed in his cheerful yet powerful order. She stuck closer to Tae Ho’s back and put more strength in her arms.</p><br/><p>“Let’s go!”</p><br/><p>Tae Ho ordered. He grabbed the reins and lowered his posture and then activated the power of his saga.</p><br/><p>[Saga: The one that can handle dragons]</p><br/><p>It wasn’t simply controlling. The wyvern, that was tired because of overexerting itself, felt strength getting through its wings. It was like it was unleashing the potential even it didn’t know it had.</p><br/><p>Tae Ho laughed. He read the wind. Then he turned his head to look at the harpies charging towards them like bees and then turned his body. He made a big turn along the wyvern and then activated his saga once more.</p><br/><p>[Saga: The charge of a warrior is just like a storm]</p><br/><p>It didn’t only limit to Tae Ho. The strength of the saga also applied to the wyvern’s flight. In addition, the strength was different than before. It was only by a little but it was closer than what Kalsted had done.</p><br/><p>A new wind blew. The wind that blew like a whirlwind accompanied the wyvern’s flight. It shook the atmosphere along the blowing wind.</p><br/><p>Chkwaaaa!</p><br/><p>The wyvern passed through the harpies. The wind teared up the harpies, and the harpies couldn’t keep their balance on the shaking air. There were some that became a mess, and some that hit themselves and fell. The harpies numbering more than 20 couldn’t even touch Tae Ho.</p><br/><p>The wyvern roared. It turned while riding the wind as if it enjoyed flying with Tae Ho. At that moment, Siri leaned her body towards Tae Ho and swung her right arm to look behind her. Tae Ho, that was in the middle of spinning, turned to look at Tae Ho and then read Siri’s saga with his saga that had become more powerful.</p><br/><p>[Saga: The eyes of the dragon can see through all things]</p><br/><p>[Saga: The arrows of the witch never misses its target]</p><br/><p>Siri’s saga. You could know what it did just by reading the title. Siri pulled the trigger consecutively and the arrows that got fired pierced through the chests of the harpies like a lie.</p><br/><p>“One more time!”</p><br/><p>Siri yelled. Tae Ho smirked and did as she wished. He passed through the harpies once more.</p><br/><p>“Uwaaaa!”</p><br/><p>“Catch and kill them!”</p><br/><p>“Finish them!”</p><br/><p>The warriors yelled above the fortress. While the dead harpies fell down, they damaged the gnolls that were on the ground and made them perplexed.</p><br/><p>“Tae Ho! Be careful!”</p><br/><p>Rolph, that was looking at the sky, yelled. It was because he had seen the harpies fall and then saw the wyvern riders turn towards Tae Ho.</p><br/><p>The number of the wyvern riders were 3.</p><br/><p>And Tae Ho also noticed them. Because of that he lowered his posture even more and told Siri to lower her posture like him and grab him tighter.</p><br/><p>Because they would fly with a special method from now on.</p><br/><p>One of the specialties of the dragon knight Kalsted.</p><br/><p>The fighting method that gave the program Lee Tae Ho the nickname of ‘The king of shooting’.</p><br/><p>“Follow me, follow me!”</p><br/><p>The strange aura that was flowing on the wyvern’s wings disappeared. But instead, the flying method of the wyvern became sharper.</p><br/><p>The wyvern riders chased at Tae Ho’s back. Two of the three targeted the wings of Tae Ho’s wyvern and breathed out fire.</p><br/><p>Tae Ho couldn’t see that scene. But he could feel it. As he shifted his weight to his right, the wyvern tilted his body immediately. The fire breaths of the other wyverns passed below and above the wyvern’s wing.</p><br/><p>Popong!</p><br/><p>The fireballs exploded. Tae Ho’s wyvern made a complete turn in the air. If it were a normal wyvern, it wouldn’t have been able to do that, but the strength of the saga made that possible.</p><br/><p>Siri gritted her teeth to gulp down her shout. The wyvern made a turn and surged up, and the wyvern rider that was trying to close in the tail of Tae Ho’s wyvern could only charge forward like that.</p><br/><p>Tae Ho’s wyvern drew a beautiful line again. The wyvern, that seemed to be doing acrobatics in the air, soon caught the back of the wyverns that had breathed out fire.</p><br/><p>However, Tae Ho didn’t try to execute his lance charge. That wasn’t the only ability he could use in a dogfight.</p><br/><p>Crash!</p><br/><p>Tae Ho’s wyvern flew above the other wyvern closely and bit the rider. After biting it strongly it turned it spat him and then turned its head. And the other wyvern rider was in that direction.</p><br/><p>Fire breath.</p><br/><p>It was weak because it fired it in a hurry but it didn’t matter. The rider, that got covered in fire, let out a cry and fell and the wyvern that had lost its wyvern didn’t know what to do.</p><br/><p>Now, only one wyvern rider remained. Tae Ho said after looking at the last wyvern rider flying towards them late.</p><br/><p>“Captain Siri!”</p><br/><p>The arrow with an incomparable precision hit the forehead of the rider. Tae Ho charged like that and swung Runefang that was set on fire. The flame sword made a problem in one of the wings of the opposite wyvern. But it was enough with just that. Because Tae Ho and Siri weren’t the only ones on the battlefield!</p><br/><p>Rolph’s exploding arrow made the wyvern fall. A huge crossbow, that seemed to have been activated late, fired huge arrows at the chest of the wyvern that didn’t have its rider.</p><br/><p>Three harpies and twenty harpies.</p><br/><p>He had nullified their aerial forces.</p><br/><p>The warriors cheered and Tae Ho looked down the ground. He saw the enemy forces trying to climb the fortress.</p><br/><p>“Pant, pant, pa…..”</p><br/><p>Siri breathed roughly at his back. She had never imagined that they would fly in this way consecutively.</p><br/><p>And Tae Ho looked farther away instead of delivering her safely to the ground. And the Valkyries Rasgrid and Reginleif, that were looking at Tae Ho’s performance, also turned to look at the place he was looking at.</p><br/><p>The grey mist that resembled a pillar. The enemy forces that were coming out of it endlessly.</p><br/><p>Just how many enemies would there be in there? Would more wyvern riders and harpies come out? Or would even more gnolls appear?</p><br/><p>It was neither. At that moment Rasgrid opened her eyes abruptly, and Reginleif clenched her fists. And Valkyrie Ingrid, that was encouraging at the warriors, could only turn her head at the terrible uneasiness.</p><br/><p>Beyond the mist. What was inside of it. And what appeared now.</p><br/><p>Tae Ho also saw it. The strengthened eyes of the dragon were telling him.</p><br/><p>The huge red letters.</p><br/><p>The letters shining in a scarlet red, as if warning him of the greatest danger.</p><br/><p>The mist dispersed. No, it broke. The existence shaking the ground roared and broke the mist.</p><br/><p>[Utgard-Loki’s warrior]</p><br/><p>[Giant: Hgut]</p><br/><p>As tall as 20 meters.</p><br/><p>The giant that was even bigger than the fortress charged towards it.</p><br/><p>&amp;</p><br/><p>The warriors of Valhalla knew.</p><br/><p>That the God’s of Asgard had a long time enemy.</p><br/><p>The existence of the giants that had the strength as the Gods and lived on the other side of the planet.</p><br/><p>However, they only knew their existence because of the stories. Thanks to that, they felt overwhelming pressure at the giant charging towards them. They couldn’t think anything for a moment. And when they barely realized that the existence in front of their eyes was an enemy, it was already in front of the fortress.</p><br/><p>The giant had a different look to that of a human. Its upper body was greatly developed, and its body was a grey that resembled a rock. Perhaps, it may really be made with rocks.</p><br/><p>Its head was similar to the gnolls. It’s long and black hair covered his face and his chest. It’s two eyes that had a long distance between them were round and shone in a yellow light.</p><br/><p>The giant was holding a giant blunt weapon in its right hand. And obviously enough, the giant swung its blunt weapon towards the fortress.</p><br/><p>“Oh, sacred power of the runes!”</p><br/><p>Valkyrie Reginleif yelled like thunder. At that moment, a blue and strong light appeared on the fortress and pushed back the giant and the gnolls that were hanging on it by a great distance.</p><br/><p>The gnolls, that crashed on the ground, groaned in pain and twitched. The giant stepped on those gnolls and then glared at Reginleif that had activated the rune magic of the Black Fortress.</p><br/><p>But Reginleif didn’t dodge his eyes at all. The giant roared and raised its blunt weapon, and the warriors gulped air. Reginleif put more strength at the runes.</p><br/><p>Babang!</p><br/><p>A loud sound exploded towards the air. The blunt weapon hit a wall that couldn’t be seen with your eyes. The ground shook, and Reginleif let out a groan.</p><br/><p>She would be able to endure a few more hits at most. If she could use the rune magic of Black Fortress however much she wanted, she would have used it the moment the gnolls attacked.</p><br/><p>The giant raised his blunt weapon regardless of knowing that or not. Valkyrie Ingrid hurriedly looked towards Rasgrid. She asked for permission with her eyes.</p><br/><p>However, Rasgrid didn’t have the permission to let the Valkyries participate in the battle. She gritted her teeth and then discovered the black crow Hugin, that was looking down the battlefield.</p><br/><p>Rasgrid opened her mouth. And in that instant, the second blow of the giant hit the Black Fortress.</p><br/><p>Bang! Bababang!</p><br/><p>A shock that was bigger than the first attack occurred. Followed by the loud sound, the sound of the wall breaking was heard, and Reginleif that was hanging on the walls yielded.</p><br/><p>The color of the faces of the warriors of Valhalla changed. As valiant as they were, it was rare for them to be scared to this extent, but they couldn’t stop shaking in front of this giant.</p><br/><p>In the other hand, the gnolls yelled in joy. The group that was hidden in the mist also raised their weapons and sang the destruction of Valhalla.</p><br/><p>The giant raised its blunt weapon again. Reginleif bit her lips and glared at the monster, and Ingrid ran towards Rasgrid. Rasgrid looked at the sky and pleaded.</p><br/><p>“Odin!”</p><br/><p>‘A giant has appeared. Even if it’s rank is low, it’s not something the lowest ranked warriors should fight. Allow us, the Valkyries, to participate in the battle. Let us fight the giant directly!’</p><br/><p>‘I won’t allow it.’</p><br/><p>His voice rang in her head. Rasgrid hurriedly turned to look at her side. The crow Hugin was seated on her shoulder.</p><br/><p>Rasgrid’s cold face crumbled. And Hugin faced Rasgrid with a casual face.</p><br/><p>‘Just like you said, it’s merely a lowest ranked giant. The battles of the lowest ranked warriors are all a test. So I won’t allow the Valkyries to intervene.’</p><br/><p>Why had she proposed to bring reinforcements? And why did she only gather lowest ranked warriors?</p><br/><p>This place was the battlefield. And at the same time, the place for growth and test.</p><br/><p>What Valhalla needed wasn’t weak but numerous warriors. It was warriors strong enough to beat Ragnarok.</p><br/><p>Rasgrid opened her mouth to protest. But nothing came out her mouth. Because she knew Odin well. She knew really well that he was the God of the cruel and brutal war.</p><br/><p>The giant started to attack for the third time. And Reginleif gritted her teeth. Ingrid ran towards Reginleif instead of Rasgrid. She worked hard to try to help Rasgrid find her cool, but it wasn’t easy.</p><br/><p>The third attack. The invisible wall broke down completely. The gnolls cheered and Reginleif staggered.</p><br/><p>She won’t be able to stop the next attack. The fourth attack would hit the fortress.</p><br/><p>But at that moment.</p><br/><p>Hugin twisted its beak and smiled.</p><br/><p>The reason was simple.</p><br/><p>There was a group of people moving towards the giant on top of the fortress.</p><br/><p>&lt; Episode 7 – Valkyrie (2) &gt; End</p><br/>\n</div>"}