{"title": "Chapter 44", "id": 44, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-44", "volume_title": "Volume 1", "body": "<h1>Chapter 44</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 14/Chapter 1: Garmr’s soul fragment (1)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><hr/><br/><p>Tae Ho and Siri were actually in a really tired state. It was because they had already fought two fierce battles even though it didn’t last too long.</p><br/><p>Siri was the one that was especially exhausted. Even though she was supported by the sagas, the flight Tae Ho requested her to do was of a really high level. In addition, it wouldn’t be an exaggeration to say that she had fought Garmr alone.</p><br/><p>The moment Tae Ho activated the ‘one that handles dragons’ he realized that Siri’s exhaustion was quite big. Perhaps Siri putting on a teary face that wasn’t like her was already proof of that.</p><br/><p>“Hang on a little bit more captain Siri.”</p><br/><p>Tae Ho lowered his posture after whispering to her and then transmitted his strategy.</p><br/><p>In the first place, Tae Ho wasn’t planning on intervening against Rasgrid’s fight against the fire giant directly.</p><br/><p>Because they were on a different level. The two of them weren’t beings that Tae Ho could currently face.</p><br/><p>“Listen well, our objective isn’t dealing damage. It’s to take the aggro.”</p><br/><p>They would let Rasgrid do all the attacking. Their task was to not let the fire giant defend or dodge properly, or keep disturbing it.</p><br/><p>Siri just entrusted her body to Tae Ho’s saga instead of asking anymore. Tae Ho faced the giant and Rasgrid that were far away and flew up and instead of putting away Garmr’s soul fragment inside of Unnir he held it with his left arm.</p><br/><p>The thing the fire giant was looking for was Garmr’s soul fragment. Then what would happen if he kept showing it to the giant? Just like a fisherman shaking the bait.</p><br/><p>‘Also.’</p><br/><p>He would attack the top of that. It wasn’t important if he could actually damage it. It would be worth it if he could keep getting on its nerves.</p><br/><p>Siri rode in the wind. She drew a big circle around the fire giant and Rasgrid and Tae Ho kept firing a beginner spear made through the ‘warrior’s sword’.</p><br/><p>Siri didn’t even have to use her saga. Their target was a giant as tall as 7 meters, so there was no need to aim. It would get on its nerves even if it grazed it!</p><br/><p>“Kuaak!”</p><br/><p>And as expected the giant started to get frustrated. Even though it was facing Rasgrid, it turned its head or its eyes and checked Tae Ho’s location. In addition, it even threw some attacks at him.</p><br/><p>“Good!”</p><br/><p>Tae Ho yelled in joy and Rasgrid attacked the opening that was made. Siri flew over a fireball and said with warm eyes.</p><br/><p>“How wicked.”</p><br/><p>“Sorry?”</p><br/><p>Siri didn’t speak again and Tae Ho aimed at the back of the giant. The giant, that had allowed some attacks from Rasgrid, seemed to have decided do ignore Tae Ho’s attacks that it didn’t even turn back.</p><br/><p>It wasn’t a bad response. Because the beginner spears Tae Ho threw towards the giant was so weak it couldn’t even leave a scratch on it.</p><br/><p>However, this was also what Tae Ho wanted. And the reason Siri saved her saga was for this moment.</p><br/><p>[Saga: Sword of the warrior]</p><br/><p>The thing he made was a Heavy Lance.</p><br/><p>[Saga: The arrows of a witch never misses its target]</p><br/><p>The Heavy Lance, that was empowered by the power of a God, drew a sharp trajectory. The fire giant got surprised and turned its body but it was already late. The Heavy Lance struck its ear, and the giant let out a pained roar.</p><br/><p>Right then, the harpies charged towards Tae Ho. Maybe it was because Siri had used her saga that she stumbled for a moment but she passed through the harpies with the help of the ‘charge of the warrior’. She took a big turn and after turning their heads they saw Rasgrid that was preparing her final attack to deal with the giant that had stumbled because of the blow in its ear.</p><br/><p>“Sword that splits the sky!”</p><br/><p>It was just like the name implied. At Rasgrid’s yell, a white aura started to surge to the sky. It became a sword like its name and cut the earth in two.</p><br/><p>The head of the giant was cut in two. Although it wasn’t split, it was enough with that. Fire surged up and the body of the giant got burnt in an instant and fell down like a burnt tree.</p><br/><p>Booooooom-</p><br/><p>A sound similar to a landslide was heard. Rasgrid turned to look at Tae Ho and he could know instinctively.</p><br/><p>Rasgrid smiled. Although he couldn’t see well because she was far away he could know.</p><br/><p>The battle continued. Although new giants didn’t appear, the number of boulders falling from the sky increased. It seemed like they wanted to overturn the situation through sheer numbers.</p><br/><p>However, Valhalla didn’t stay still. Tae Ho just looked at a distant place while fixing his back instead of jumping into the battlefield.</p><br/><p>And then, it started to pour down. The killer thing. The rain of steel that didn’t lose to the flaming boulders!</p><br/><p>Bang! Bang! Bang! Bang!</p><br/><p>Warriors of Valhalla started to get out of the metal structures when it landed on the ground. And the cheers of the warriors covered the battlefield.</p><br/><p>“Odin!”</p><br/><p>“Tir!”</p><br/><p>Strategies didn’t work anymore. It seemed like the giants also realized that, that no more flaming boulders fell from the sky. Tae Ho landed in a safe place far away from the battlefield with Siri and said.</p><br/><p>“Captain Siri, we can rest now right?”</p><br/><p>Siri just chanted instead of replying as she was as tired as she could be.</p><br/><p>&amp;</p><br/><p>The battle ended. Corpses of monsters filled the battlefield. It was a complete victory.</p><br/><p>However, the warriors of Valhalla didn’t put their weapons back. Each of them was looking at the center of the battlefield while holding their weapons.</p><br/><p>About 100 warriors.</p><br/><p>Warriors of the Great War were standing on that place. They lost their light and were dimming again as if the promised time with Valhalla was up, but it was different for everyone else on the battlefield. The warriors of the Great War were all starting to shine.</p><br/><p>“Oh Valkyrie, lead our souls to Valhalla. We will go to Odin and boast about today’s fight.”</p><br/><p>The warrior at the front said. Rasgrid erased her ice like the expression and smiled gently.</p><br/><p>“Exalted warriors, I will make a promise that won’t change for eternity. Valhalla will always welcome you.”</p><br/><p>Rasgrid raised her sword. And then Rasgrid’s appearance that was wearing armor changed. Rasgrid swung her sword once more while wearing a dress.</p><br/><p>A path of light opened up. It was a beautiful rainbow path that connected the ground to the sky.</p><br/><p>“Bifrost…..”</p><br/><p>Originally, the stairs that connected the mortal world Midgard with the world of Gods Asgard.</p><br/><p>The warrior that was looking still at the stair of light put on a nice smile and then raised his voice and yelled.</p><br/><p>“Warriors of Valhalla! Our battle today will remain in history! And remember! Let’s meet again! On a new battlefield!”</p><br/><p>“On a new battlefield!”</p><br/><p>“On a new battlefield!”</p><br/><p>The warriors of the Great War yelled, and the warriors of Valhalla took deep breaths. They raised their swords and cheered for the warriors that were leaving.</p><br/><p>“For Asgard and the nine planets.”</p><br/><p>The warrior looked at Rasgrid and said for the last time. And then placed his foot on the stair of light. All of the warriors of the Great War got on the rainbow stair.</p><br/><p>And Rasgrid, that was looking at them, turned her head. She called Tae Ho and Siri with a gesture of her eyes.</p><br/><p>“You have done well. The merits you have accomplished are really big.”</p><br/><p>The two of them had performed better than what she expected. It would be glad about just tying its feet, but to have defeated it.</p><br/><p>She still needed to investigate the flow that occurred afterward, but she could know instinctively. The ones that had made the flow were the two people in front of her.</p><br/><p>“Forgive me for having to leave early because I have to lead the warriors. I will return first and prepare a reward according to your merit.”</p><br/><p>Rasgrid glanced at the stair of light and said. It seemed like she also had to leave along the warriors.</p><br/><p>“Thank you. And also here…..We used it well.”</p><br/><p>Tae Ho gave her the dragon wing clothes that was well folded. Although he really wanted this item, it was correct to give it back as he had borrowed it from her.</p><br/><p>Rasgrid put on a vague smile after receiving the wing coat and then turned to look at Siri and said.</p><br/><p>“You have done well, Siri. Wasn’t Tae Ho’s flight really violent?”</p><br/><p>At the sympathetical words, Siri grabbed her aching back and nodded. However, Siri regained her usual serious expression and hit her chest as an etiquette and said.</p><br/><p>“I just did my best as a warrior of Valhalla.”</p><br/><p>Rasgrid faced Siri that seemed to have shining eyes and then looked at Tae Ho.</p><br/><p>“Tae Ho, Reginleif, and Gandur will come soon. Let the remaining tasks to the two of them.”</p><br/><p>Although she didn’t say anything else he seemed to know what she meant. She would probably be saying to give them Garmr’s soul fragment, that was the objective of the giants.</p><br/><p>“I understand.”</p><br/><p>“Right. The two of you have done really well.”</p><br/><p>The warriors of the Great War were already on the shining stairs. Rasgrid placed her lips on Tae Ho’s and Siri’s forehead in turn.</p><br/><p>“Let Odin’s blessing be with you.”</p><br/><p>Rasgrid’s blessing.</p><br/><p>She smiled and turned back and then got on the shining stairs. She went to Valhalla while leading the warriors.</p><br/><p>“How beautiful.”</p><br/><p>Siri said in a low voice. Because going to Valhalla while holding the hands of a Valkyrie was the dream of the warriors. Although it was something all the warriors had gone through once, it didn’t mean that the meaning disappeared. It wasn’t only Siri but the warriors of Valhalla also looked at the leaving warriors with feelings of reverence.</p><br/><p>‘It is cool indeed.’</p><br/><p>Although Tae Ho had come to Valhalla with different feelings from the warriors, he could only admit the scene in front of him. He felt like a part of him was choking.</p><br/><p>And how much time had passed? It was then that Rasgrid and the warriors reached a high place and the path of light disappeared.</p><br/><p>“Warrior Tae Ho, warrior Siri.”</p><br/><p>A familiar voice was heard from the sky. They looked up and saw Valkyrie Reginleif and Gandur. Transforming into a beautiful lady from a swan was a really mystical scene.</p><br/><p>Reginleif looked at Siri and Tae Ho gallantly like always and then frowned.</p><br/><p>“The two of you are really exhausted. I’m sorry but I can’t allow you to rest yet. Can you tell me what happened briefly?”</p><br/><p>Siri glanced at Tae Ho and he started to tell the things that happened in the trace of the Great War. Reginleif, that had listened to everything, carefully put the fragment of Garmr’s soul in a box she took out from the air.</p><br/><p>“The merits of the two of you are indeed really big. Rest for now. Let’s listen to the details at a later time.”</p><br/><p>Reginleif spoke rather quickly and but back the chest in the air again and then placed her lips on the both of them just like Rasgrid had done.</p><br/><p>“Let Tir’s blessing be with you.”</p><br/><p>They felt like they were more comfortable in mind and body. Siri trembled as if she enjoyed the blessing and closed her eyes and Tae Ho looked at Gandur that was next to Reginleif.</p><br/><p>“What?”</p><br/><p>“Ah, I wondered if Gandur wouldn’t bless us.”</p><br/><p>Although it wasn’t that he wanted to receive a kiss from Gandur, but not receiving was also a bit strange.</p><br/><p>‘Collecting…..that’s not it.’</p><br/><p>No, or perhaps it was?</p><br/><p>Gandur smirked at Tae Ho’s words and then shook her head.</p><br/><p>“The greed of humans have no end. But it is indeed right to do it.”</p><br/><p>Gandur placed her lips on Siri’s forehead that was closer to her and then approached Tae Ho. As Tae Ho closed his eyes while expecting the blessing, Gandur glanced sideways and then placed her lips on Tae Ho’s cheeks.</p><br/><p>“Let Ullr’s blessing be with you.”</p><br/><p>Although it wasn’t his lips, Tae Ho got surprised because it was an unexpected place. Gandur laughed while looking at that Tae Ho and then turned around and then flew away after transforming into swans.</p><br/><p>Was it only Gandur’s joke?</p><br/><p>Tae Ho touched his cheeks unconsciously and looked at the swans, and Siri that saw that said in a low voice.</p><br/><p>“So, that was the reason?”</p><br/><p>A joyful voice.</p><br/><p>Tae Ho flinched and looked sideways and then he could realize why Gandur had done that.</p><br/><p>“Hi again?”</p><br/><p>Although it was similar to what he heard usually, the tone was a bit different.</p><br/><p>Tae Ho made eye contact with Heda that was putting on a smile that seemed fake and then hurriedly lowered his hand from his cheek.</p><br/><p>&amp;</p><br/><p>The giant of strength Harad was caught in an awful mood.</p><br/><p>It wasn’t because the attack had failed. Because he had taken it into account in the first place. And spreading seeds of fire that would become the omen of a big fight was also his objective.</p><br/><p>But the problem lied in another place.</p><br/><p>The giant of night Avalt. He didn’t really think that there would be a seed there as Avalt had just stepped down from the place.</p><br/><p>But there was actually a seed there. In addition, the way it had appeared was close to being the worst.</p><br/><p>But the biggest problem was that Valhalla realized that because of the stupid giant of fire.</p><br/><p>The giants were aiming for Garmr’s soul fragment.</p><br/><p>Valhalla wasn’t a powerless foe. They may have already realized what they were trying to do after gathering the fragments of Garmr’s soul.</p><br/><p>It was a mistake he hadn’t even thought of. He couldn’t even imagine that things would take a turn for the worse like this.</p><br/><p>But that mistake wasn’t the only reason that put the giant of strength Harad in a foul mood.</p><br/><p>Utgard Loki.</p><br/><p>The magician king didn’t say anything about this mistake. He didn’t even punish him nor said any words.</p><br/><p>And that truth put Harad in a terrible pain.</p><br/><p>Would he be thinking that he wasn’t even worthy of being punished? Was he already outside of his eyes? No, perhaps this case by itself wasn’t important at all. Because it was merely a small battle.</p><br/><p>Harad was anxious. And the giant of the night Avalt looked at that Harad from the sides and felt a strange feeling.</p><br/><p>What was the reason?</p><br/><p>Was it because he knew that not punishing him would harass him more?</p><br/><p>The other giants thought like that. But Avalt was different. He thought differently.</p><br/><p>‘Perhaps.’</p><br/><p>The magician king would have already foreseen this situation. Harad making a mistake would have been what the magician king had wanted.</p><br/><p>“It turned out like the king wanted.”</p><br/><p>Even though Avalt’s space was the darkness, a small voice passed its ears as if it was whispering. The giant of the night didn’t turn his eyes to check the owner of the voice. It was obvious that the snake-like voice came from Asgard’s giant king, Loki.</p><br/><p>What the king wanted.</p><br/><p>What he was seeking.</p><br/><p>The giant of the night ended his thoughts. And he covered himself with a denser darkness.</p><br/><p>He didn’t believe in Loki. However, he agreed that it had turned out just like the king had wanted.</p><br/><p>So he would throw away his delusions and perform his duty. Because he was one of the five fingers of the magician king. Accomplishing what the king wanted was also what Avalt himself wanted.</p><br/><p>he would wait for Asgard’s reaction. And then wait for the next order of the magician king.</p><br/><p>The giant of night Avalt decided. He closed his eyes slowly as if being closed in darkness.</p><br/><p>&amp;</p><br/><p>“Hm, so that happened. You received blessings from Rasgrid, Reginleif and also Gandur.”</p><br/><p>Heda stood in between a Black Flash and nodded and said without any emotions.</p><br/><p>Tae Ho, that was lying on a Black Flash, stiffened up. Even if that wasn’t the case, the Black Flash was really like a coffin.</p><br/><p>Siri, that lied down on the Black Flash that was next to him laughed. It seemed like she was really enjoying this situation.</p><br/><p>Heda looked at Tae Ho. He flinched reflexively and Heda laughed once more as if she couldn’t endure it.</p><br/><p>“I’m joking. Joking.”</p><br/><p>Because she already knew why Gandur had done that in the first place.</p><br/><p>Heda fixed the mattress of Tae Ho and continued saying.</p><br/><p>“Keep resting for now. Siri, you are also exhausted. Do you know how many times you used your saga?”</p><br/><p>The two people had really used their sagas to their limit. Although Tae Ho could somehow endure it because he invested quite a lot of runes on his concentration, it wouldn’t be weird for Siri to collapse at any moment. It wasn’t for nothing that Heda made the two of them lie down on the Black Flash.</p><br/><p>“Siri, thank you a lot.”</p><br/><p>“Don’t mention it.”</p><br/><p>Siri and Heda exchanged smiles and then Heda spoke again.</p><br/><p>“There are a lot of people to take care of, so you should sleep. Let’s speak about the remaining things at a later time.”</p><br/><p>Heda spoke up to there and then lowered her posture after approaching Tae Ho. Tae Ho just waited for Heda as he was already accustomed to her blessing.</p><br/><p>“Let Idun’s blessing be with you.”</p><br/><p>Her voice trembled more than usual.</p><br/><p>Tae Ho opened his eyes quickly but Siri had already turned her body. He saw that she was a little bit embarrassed.</p><br/><p>“Let Idun’s blessing be with you.”</p><br/><p>Heda also blessed Siri and then stood up. Tae Ho just closed his eyes instead of trying to see her face. Maybe it was because of her blessing that he fell asleep in an instant.</p><br/><p>And that was the reason why Tae Ho couldn’t feel it.</p><br/><p>Inside of Unnir.</p><br/><p>The fragment of the unknown weapon was emitting a faint light.</p><br/><p>&lt; Episode 14 – Garmr’s soul fragment (1) &gt; End</p><br/>\n</div>"}