{"title": "Chapter 52", "id": 52, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-52", "volume_title": "Volume 1", "body": "<h1>Chapter 52</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 17/Chapter 1: The God of Thunder (1)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><hr/><br/><p>They could only stop. It was impossible to ignore the sound of the thunder regardless of what they were doing.</p><br/><p>It would be good to call it the instinct of the giant. Perhaps, it was also a fear that was engraved in his soul.</p><br/><p>Because the thunder was like that.</p><br/><p>The giant of night Avalt let out an exclamation. Even though he was looking from a distant place it still made his body turn stiff.</p><br/><p>“Harad.”</p><br/><p>They had wasted too much time. No, the opponents had reacted too fast.</p><br/><p>But it was meaningless whichever it was. Now wasn’t the time to be thinking like that.</p><br/><p>“Harad.”</p><br/><p>Flee.</p><br/><p>Avalt spread the darkness of the night.</p><br/><p>&amp;</p><br/><p>The giant of strength Harad looked backwards. He could hear the lightning flashing from inside the black clouds.</p><br/><p>Harad curled himself. He hurriedly turned his fist that was about to hit Tae Ho and defended. It was the right decision.</p><br/><p>Because lightning was always faster than thunder.</p><br/><p>Babang!</p><br/><p>Thunder hit after the lightning. It crossed the cracked ground and blue thunder fell.</p><br/><p>Clouds were gathered in the sky. And he was standing in the middle of the rough wind.</p><br/><p>“Hello.”</p><br/><p>The greeting that seemed to be a mumble was heard too clearly. The God of Thunder laughed like a man, suitable to be the strongest warrior in Asgard. He, that had already closed in Harad, swung Mjolnir.</p><br/><p>Short and fast.</p><br/><p>But like the beginning of the world.</p><br/><p>The strength behind Mjolnir hit Harad’s domain. The ground exploded once more, and Harad’s huge body got sent flying hundreds of meters.</p><br/><p>Kwagagagagagang~!</p><br/><p>Thunder fell from the sky as if chasing Harad. A pure white light exploded and called for a thunder.</p><br/><p>Thor looked at Harad that was being pushed back. A curtain of the night appeared in the air and was covering Harad. It was the power of the giant of the night, Avalt. He wanted to make him return however he could.</p><br/><p>But Thor saw that and didn’t let it go.</p><br/><p>Sparks appeared in his blue eyes. Then, blue thunder started to explode from his body.</p><br/><p>That was his strength. And also the strength Mjolnir had.</p><br/><p>Thor threw Mjolnir. The weapon that was made with the unts was like a thunder of a God itself. Thunder fell down from the sky once more. It was just like declaring that all of this territory belonged to Thor.</p><br/><p>Bang! Bang! Bang! Bang!</p><br/><p>The thunder pierced the curtain of night. It teared up the darkness.</p><br/><p>The giant of night Avalt cursed. He despaired at the strength of the really strong God of Thunder.</p><br/><p>The giant of strength parried Mjolnir with all his strength. The sky and the ground cried in pain because of the aftershock generated by the clash between Mjolnir and Harad’s fists. Harad roared and Mjolnir and Harad’s fist bounced back at the same time.</p><br/><p>Mjolnir returned back to the hands of its owner. Black smoke surged up from Harad’s fist, instead of red blood.</p><br/><p>Ahh.</p><br/><p>Ahhhh.</p><br/><p>Harad sighed and admired. He had determined himself.</p><br/><p>He would die by fighting. He wouldn’t flee. How could a warrior flee from this place?</p><br/><p>He was the giant of strength. In the first place, fleeing didn’t suit him at all. He couldn’t imagine himself dying with his back turned.</p><br/><p>Everything was a mess. He couldn’t retrieve the soul fragment. Couldn’t kill Ragnar and also couldn’t trample on the root of the future. It was a really grim failure.</p><br/><p>If it was the giant of night Avalt, he would be analyzing even in this moment.</p><br/><p>How did Thor arrive so fast? Was there no method to flee? A method to trick his eyes?</p><br/><p>He was someone he didn’t want to see. He didn’t suit with him, Harad at all.</p><br/><p>However just like Avalt did, Avalt also recognized him. Because of that he requested in a low voice.</p><br/><p>To give him strength.</p><br/><p>To let him fight on the last battlefield with all his strength.</p><br/><p>No, it wasn’t the end. It wasn’t the last. Because he would fight against the God of Thunder with all his strength!</p><br/><p>Harad laughed. But the giant of the night didn’t curse out. He just closed his eyes and moved his fingers. He controlled the threads that were on the tip of his fingers and retrieved the curtain of night that was meant to hide Harad. Instead, he gave more strength to Harad.</p><br/><p>The black night took shape. It became the right arm of Harad.</p><br/><p>Thro gripped Mjolnir. But he didn’t charge towards him immediately. He was just glaring at him with his eyes covered in sparks.</p><br/><p>He was waiting for him. As expected of the God of battle of Asgard. The great warrior that leads Valhalla.</p><br/><p>Harad clenched his fist that had black smoke surging from it and then expressed his last manner to his lord.</p><br/><p>“My king! Observe my last battle!”</p><br/><p>He retrieved his fist that pierced through the sky and looked at the front. He created big black fire that resisted against the thunder.</p><br/><p>“I’m going God of Thunder.’</p><br/><p>He could guess the reason why Thor had pushed him back with the first attack. It was to protect them by getting them far away.</p><br/><p>He wanted to match him. He wanted to the favor for having waited for him.</p><br/><p>But he couldn’t.</p><br/><p>Because he was the giant of strength. He was a commander of the magician king, Utgard Loki!</p><br/><p>He would make an achievement. He would make a situation that was a little bit more favorable for his lord.</p><br/><p>He would sweep them all up with the aftershock of the fight.</p><br/><p>He would tramble on the root of the future along with Ragnar.</p><br/><p>Harad charged forward. The body of the huge giant was enough to cross the plains in an instant.</p><br/><p>Thor read Harad’s intentions. And because of that he made thunder explode and charged towards him. His red cape fluttered.</p><br/><p>Kwagagagagagagang!</p><br/><p>He covered the sky and the ground with thunder. It seemed like the white and blue light that exploded was enough to make you blind.</p><br/><p>Bracky looked at the thunder and lightning and cheered. The knocked out Rolo was luckily rolling in a far place.</p><br/><p>Ragnar spat saliva mixed with blood and woke up the warriors of Thor’s legion. Although they had their hearts and souls taken by the mythological scene occurring in front of them, the voice of the Viking king Ragnar still worked.</p><br/><p>Thor was pushing back Harad. Ragnar spat out once and was about to go to Tae Ho.</p><br/><p>However he stopped before he could take two steps. Although he was covered in thunder so you couldn’t find him easily, he stopped because he saw a white swan covered in golden light descending towards the ground.</p><br/><p>“Fall back! If you get swept, you will die!”</p><br/><p>Ragnar urged the warriors of Thor’s legion again, that were absent minded. Before he returned he looked at the place the swan descended once more.</p><br/><p>&amp;</p><br/><p>It seemed like he would go deaf because of the thunder. The red and dim vision became darker every time.</p><br/><p>He would die like this.</p><br/><p>Even if it was Idun’s blessing, it still had its limits.</p><br/><p>However Tae Ho didn’t let go of the thread of consciousness he had left. Even though he knew that it wouldn’t be painful anymore if he let it go and that it would be more comfortable he didn’t do so.</p><br/><p>It wasn’t his strength alone. Heda’s blessing that was added every night became an anchor for Tae Ho. He closed his eyes. He was losing the senses in not only his arm but his entire body.</p><br/><p>He couldn’t hear the thunders anymore.</p><br/><p>But he heard another thing.</p><br/><p>Something soft touched his cheeks. Warmness spread at his senses that were numb. A moist aura of life passed from his dry lips.</p><br/><p>‘Heda.’</p><br/><p>He could see Heda’s face from beyond his dim vision. It seemed like she was crying and also angry.</p><br/><p>“Don’t die!”</p><br/><p>Heda yelled sharply and hurriedly moved her hands. She sucked the coagulated blood in Tae Ho’s mouth and then stole his lips. She placed her lips on Tae Ho’s, that were a bit open, and gave him the best blessing.</p><br/><p>Tae Ho opened his eyes. However, they had lost focus. They were dark eyes that seemed like life was going to get turned off soon.</p><br/><p>Heda breathed. She extended her trembling hand and then toko out a piece of a golden apple from her waist. She chewed it herself for Tae Ho, that didn’t even have the strength to close his mandible, and kissed him again. She pushed the crushed apples with her tongue.</p><br/><p>Tae Ho gulped that down. It was really slow but it passed through his throat.</p><br/><p>Vitality started to return in Tae Ho’s eyes. Heda cried and smiled. She put the remaining piece of a golden apple in her mouth and delivered it to Tae Ho again.</p><br/><p>It would be different from that day. She wouldn’t lose again like that day.</p><br/><p>Heda touched Tae Ho’s face. She placed her lips again on his and started to cry golden tears.</p><br/><p>&amp;</p><br/><p>The sound of thunder was heard from far away.</p><br/><p>He could also hear warm whispers from far away. It seemed like everything was beyond a curtain.</p><br/><p>‘Heda.’</p><br/><p>Tae Ho could somewhat guess what had happened.</p><br/><p>The best God of battle of Asgard he saw the first day he entered Valhalla- The God of Thunder, Thor, had come.</p><br/><p>It seemed like Heda had also come. Although he didn’t know what she did, he was sure that his body was recovering.</p><br/><p>They had come to catch a wild gryphon but what the hell was this?</p><br/><p>Tae Ho thought the same thing as Ragnar and dropped his shoulders. Because whatever the case, it seemed like it had been solved.</p><br/><p>‘I can just leave the giant to Thor.’</p><br/><p>Although he was a bit worried about Ragnar and Bracky, he felt like they would be fine if it was them. But rather, the one he was worried about was Rolo.</p><br/><p>‘Let’s wake up.’</p><br/><p>Maybe he had eaten a piece of a golden apple that his body was recovering quickly. He had to open his eyes quickly to make Heda relieved.</p><br/><p>However he couldn’t open his eyes. The sound of the thunder was too far. It seemed like Heda’s breath and warmth was blocked with an unseeable wall that he couldn’t reach it.</p><br/><p>How so?</p><br/><p>He got scared. What if he had brain paralysis? That his body was alive but his consciousness wasn’t.</p><br/><p>No, there was no way. If that was the case he wouldn’t even be able to think right now. And in the first place, didn’t the warriors of Valhalla go to Valhalla to become steel warriors when they died?</p><br/><p>“How pretty. She is almost master’s equal. But of course, master is much prettier.”</p><br/><p>A voice was heard from behind. Only then did Tae Ho realize that he was standing inside the darkness. And he had certainly heard the voice that was heard behind him, before.</p><br/><p>In the memory he saw through Gae Bolg.</p><br/><p>No, before he rolled on the ground, before he threw Gae Bolg to the giant of strength.</p><br/><p>‘I will help you.’</p><br/><p>Tae Ho turned back.</p><br/><p>Just like he had expected, a handsome man was standing in the darkness. And it wasn’t a darkness anymore. It was a green plains that was below a bright sky.</p><br/><p>The man that was standing in the middle of the plains was wearing white clothes. He was holding a white spear with one hand, and he was putting a charming smile while looking at Tae Ho.</p><br/><p>“Nice to meet you. Erin’s successor that will receive everything from me.”</p><br/><p>“Sorry?”</p><br/><p>As Tae Ho asked back at the nickname he hadn’t even thought of, he slightly frowned. And then he mumbled in a low voice as if he didn’t have any choices and said directly.</p><br/><p>“I, Cu Chulainn will become your teacher from now on.”</p><br/><p>The prince of light, Cu Chulainn.</p><br/><p>The great warrior of the destroyed world, Erin.</p><br/><p>He extended his hand towards Tae Ho.</p><br/><p>&amp;</p><br/><p>&lt; The God of Thunder (1) &gt; End</p><br/>\n</div>"}