{"title": "Chapter 73", "id": 73, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-73", "volume_title": "Volume 1", "body": "<h1>Chapter 73</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 22/Chapter 8: Saga (8)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><hr/><br/><p>The Tyrant Bress was an obstinate guy.</p><br/><p>He started to hold a new grudge after losing Scathach.</p><br/><p>He got enraged at the fact that Adenmaha got taken from him.</p><br/><p>But he didn’t move hurriedly. He lowered himself and got patient.</p><br/><p>The opportunity came faster than he thought. The warriors of Valhalla had appeared in Midgard. And Tae Ho was among them.</p><br/><p>Asgard and Midgard was close but far at the same time. Although it was certainly closer than Svartalfheim or Vanaheim, the existences of Asgard couldn’t easily go down to Midgard.</p><br/><p>When he grasped their exact location, the warriors of Valhalla had already cleared a case. But fortunately enough, they didn’t return to Asgard but remained for the next expedition.</p><br/><p>The Tyrant Bress didn’t move himself. As he had already lost Midak, rather than spending more underlings hastily, he chose to think of other methods while sitting in his throne.</p><br/><p>Garmr’s soul fragment.</p><br/><p>What the warriors of Valhalla were gathering.</p><br/><p>However they weren’t the only ones looking for it. The giants also desired Garmr’s soul fragment.</p><br/><p>Bress stayed patient this time too. He chose to encourage another one instead of speaking to the magician king Utgard Loki, that was impossible to negotiate fairly.</p><br/><p>He had plenty of subjects. Recently, Harad the giant of strength that was one of Utgard Loki’s underlings had died.</p><br/><p>The giants also had ambition and honor. He proposed a request to the one that wanted to take the empty spot among the five fingers.</p><br/><p>Become a soldier of himself and fight in Midgard.</p><br/><p>Retrieving two soul fragments that not even Harad could retrieve it wasn’t a small achievement, so it wasn’t impossible to become one of the five fingers.</p><br/><p>There wasn’t even a need to look for it.</p><br/><p>The first giant agreed to the negotiation.</p><br/><p>A rain of runes fell down the sky. The warriors of Valhalla laughed and Bracky swung his hammer in joy.</p><br/><p>Adenmaha complained. Siri told her to get off her with a joking tone. Valkyrie Ingrid store away the soul fragment she had retrieved.</p><br/><p>Tae Ho soothed Adenmaha. He got down from Siri’s back and turned to look at Ingrid while laughing.</p><br/><p>Ingrid, that felt his gaze, raised her head. Although she usually had a stiff expression, she was now showing a soft smile towards him.</p><br/><p>Tae Ho also smiled towards her. And then, the space above Tae Ho’s head split up.</p><br/><p>There was no sound. It offset the peculiar vibration that occurred when the rain of runes fell down the sky.</p><br/><p>A shadow.</p><br/><p>When he realized that it had become dark it was already too late.</p><br/><p>‘Tae Ho!’</p><br/><p>Cuchulainn raised his voice first. And at the same time the Sword piece vibrated greatly. Tae Ho raised his head hurriedly and Ingrid did the same but a beat late. Her eyes widened.</p><br/><p>Bang!</p><br/><p>A fist fell down. The really huge fist crushed Ingrid. The ground split up and the forest shook.</p><br/><p>A loud sound was heard in consecution and the giant then landed on the ground. The giant that was easily twenty meters tall, had the face of a snake. The giant, that was covering himself with the leather of a beast, raised his fist again.</p><br/><p>[Balzak]</p><br/><p>He could barely distinguish his name. When Tae Ho faced the blood like name of the giant he hurriedly turned his head. Ingrid’s letters was still green. Although it was faint as if it was going to disappear at any time, it wasn’t white.</p><br/><p>It was a perfect surprise attack. The reason why Balzak spent his one opportunity on Ingrid was simple.</p><br/><p>She was a Valkyrie and had Garmr’s soul fragment.</p><br/><p>“Ingrid!”</p><br/><p>Harabal, the warrior of Njord’s legion, yelled. At the same time, the time that had stopped started to flow normally again.</p><br/><p>The giant released an invisible force. The forest shook greatly once again and the forest started to move. It wasn’t done by Garmr’s soul fragment. It was done by the fomoires that had soon gathered.</p><br/><p>Harabal ran towards Ingrid. Notung, that was next to him, ran along him and guarded him. The warriors of Valhalla started to face the fomoires, that looked like beasts, that started to gather from the sides, and Bracky glared at Balzak.</p><br/><p>At the same time Balzak’s eyes moved to another direction. One looked at Ingrid, and the other one quickly scanned the battlefield.</p><br/><p>Balzak moved. He didn’t forget the fact that he was a giant. He loosened the snake tail that was covering him and thrashed the ground. He executed an attack that seemed like it would sweep all the warriors of Valhalla and the fomoires and then surged to the air.</p><br/><p>The shadow covered them once again. Harabal ran faster towards Ingrid and Bracky charged the ground. He swung his hammer towards Balzak without even having the time to gather thunder.</p><br/><p>Kwagang!</p><br/><p>A loud explosion was heard. But the thunder was lacking. It wasn’t enough to push back Balzak, that was trying to land on the ground much harder. Balzak looked at the twitching Ingrid and Harabal, that was trying to cover her with his body. He swung his fist with enough strength to crush the both of them.</p><br/><p>“No!”</p><br/><p>Notung yelled. Harabal threw himself over Ingrid and Bracky gathered thunder hurriedly. Then Siri charged the ground.</p><br/><p>And she moved.</p><br/><p>‘Ugh, really!’</p><br/><p>The only thing that could stop a huge existence was another huge existence. Tae Ho threw Adenmaha towards Balzak and she transformed into the form of a sea serpent. She clashed against Balzak, that was about to swing his fist towards the ground.</p><br/><p>Kwagagang!</p><br/><p>The sea serpent and the giant rolled on the ground. Although it wasn’t a proper body slam, it was enough to break the posture of Balzak, that was in the air.</p><br/><p>Notung opened his eyes abruptly and Bracky ended up laughing while still gathering thunder.</p><br/><p>However Tae Ho couldn’t stay idle. As soon as she rode back on Siri, he extended a summoning rock.</p><br/><p>‘Adenmaha!’</p><br/><p>‘Be careful!’</p><br/><p>Adenmaha left a warning instead of cursing and returned to Idun’s residence. She had already spent a lot of strength against the winter tree forest. If he made her stay behind when she couldn’t even raise a finger properly, she may get done by the enraged Balzak. He had to summon her back immediately.</p><br/><p>“Bracky!”</p><br/><p>Tae Ho called Bracky. Balzak, that let out a roar and rose from his place, was strong. Although he seemed weaker than the giant of strength Harad, that was the only thing he could know. He couldn’t even grasp how strong he was.</p><br/><p>He had to finish him quickly. Harabal carried Ingrid quickly. Notung pushed away the fomoires that had gathered and opened up a path.</p><br/><p>Bracky swung his hammer once again and gathered thunder. The remaining three intermediate ranked warriors gathered next to Bracky.</p><br/><p>The forest shook once more. The trees flocked over the warriors as if they would gulp them down, just like when it was being controlled by Garmr’s soul fragment.</p><br/><p>It wasn’t an improvised attack. Just looking at the fomoires, you could realize that it was planned beforehand.</p><br/><p>Balzak rose his body. Tae Ho, that was riding on Siri, took out a summoning rock. It was the last summoning rock that was charged by Heda that he could use to summon Rolo.</p><br/><p>“Go!”</p><br/><p>Siri took a big leap and bounced her hips. Tae Ho, that was already prepared, kicked Siri’s back to jump even higher and called Rolo. Right at that moment Cuchulainn yelled like a scream.</p><br/><p>‘Close your eyes! Resist it with the power of a God!’</p><br/><p>Tae Ho reflexively closed his eyes. However it only reached Tae Ho. Balzak emanated an explosive magic power towards Rolo, that had appeared in the air.</p><br/><p>They were evil eyes that had a strong power of a curse. Rolo became completely petrified and fell. Harabal and Notung, that were running while showing their backs were safe, but it wasn’t the case for Bracky and the other warriors. They couldn’t move from their glaring posture.</p><br/><p>Balzak raised his feet. He tried to stamp down on Rolo that was closest to him. Tae Ho hurriedly opened his eyes and then kicked in the air and at the same time activated a summoning rock. He recalled back Rolo with the breath of a hair.</p><br/><p>Bang!</p><br/><p>Balzak stamped on the ground. The attack was so strong it split the ground.</p><br/><p>Bracky and the warriors, that hadn’t completely dispelled the petrifying effect, fell to the ground. Siri also fell and rolled on the ground, as she was running with all her might. Harabal kept running and Notung turned back to join the fight.</p><br/><p>Balzak looked at Tae Ho. He swung his right hand towards Tae Ho, that was trying to continue kicking the air.</p><br/><p>It was sharp and fast. Tae Ho couldn’t dodge his palm because he concentrated on sending back Rolo. He suffered the attack that was like a wall crashing towards him and was sent flying to the ground.</p><br/><p>“Tae Ho!”</p><br/><p>Siri trembled and raised her body. Bracky, that stood up while gritting his teeth, fired a thunderbolt towards Balzak’s ankle. He let out a pained roar but it didn’t fall down. It stamp down at Bracky’s direction as if trying to soothe his anger.</p><br/><p>Bracky rolled to dodge the attack. However, two of the three warriors couldn’t dodge it. They flew tens of meters when they got kicked by Balzak. And trees started to gather at their direction.</p><br/><p>‘Tae Ho! Wake up! Tae Ho!’</p><br/><p>Cuchulainn yelled. Tae Ho heard his voice. He felt dizzy but he didn’t lose consciousness. He felt Idun’s blessing and tried to stand up. But it wasn’t easy. The attack of the giant wasn’t merely physical. The attacks of the giant held evil magic behind them, just like how intermediate ranked warriors wielded the power of a God.</p><br/><p>Siri bit the staggering Tae Ho. She hurriedly leaped towards him and Balzak’s tail sweeped the place Tae Ho was standing before. The head of a snake, that was at the end of the tail, chased after Siri stubbornly.</p><br/><p>Siri made a decision calmly. She hurriedly shook her head, which was biting on Tae Ho, and threw him. When Tae Ho was rolling on the ground, Balzak’s tail bit Siri. She let out a pained scream that came out from the pain of havaing all her body pierced and struggled fiercely.</p><br/><p>Siri’s golden fur got dyed in blood. A poison, that was good to call it a curse, spread quickly. Siri couldn’t maintain the shape of a wolf anymore.</p><br/><p>Balzak’s surprise attack was effective. The warriors of Valhalla couldn’t even attack Balzak and lost half of their forces.</p><br/><p>The safe Notung started to breathe in and thought. There was no way to win like this. He would have to fight to save one more person.</p><br/><p>Bracky also thought the same thing. He glanced towards Olmar, that belonged to Hedmod’s legion, while gripping his hammer.</p><br/><p>Bracky and Notung let out a roar and charged towards Balzak. Olmar ran towards Siri and Tae Ho instead of following them.</p><br/><p>“Thor!”</p><br/><p>“Heimdal!”</p><br/><p>Bracky and Notung yelled the names of their respective Gods and used the power of a God. Balzak tried to activate the evil eyes once more but reacted instantly. Instead of utilizing the petrify that wouldn’t work, he took out the whip he was holding in his waist and swung it.</p><br/><p>The forest got split. Bracky and Notung jumped at the exact moment to jump over the whip. Balzak’s tail charged towards Notung, as if it had been waiting for them to jump up, but Notun was also waiting for the same thing. He calmly swung his axe and attacked the tail that had the head of a snake.</p><br/><p>The snake let out a scream and crouched down. Balzak also let out a painful scream and Bracky, that had already landed, approached Balzak like lightning.</p><br/><p>Balzak hurriedly moved his feet. Bracky rolled on the ground to dodge the attack and leaped towards his feet and swung his hammer.</p><br/><p>Babang!</p><br/><p>A thunderbolt fell down on the knee of Balzak. In addition, this attack was executed with the full strength of Bracky.</p><br/><p>Balzak, that had his knee crushed, let out a scream and fell down. Bracky rolled on the ground as he couldn’t land properly and then stood up again and gripped his hammer tighter. But he was at a limit. The attack just now was meant to completely tear off one of his legs rather than breaking his knee. It wouldn’t be excessive to say that the attack was executed with all of his strength.</p><br/><p>But Balzak’s leg didn’t get torn off. In addition, it was even recovering. The wound started to close as if he was reversing time.</p><br/><p>“This is crazy.”</p><br/><p>Bracky let out a curse and then the petrifying curse fell down on him. Bracky, that had used all his strength and the power of a God, couldn’t resist against the curse. Balzak kicked the petrified Bracky with his remaining leg. Even if it was Bracky that had a strong body, he couldn’t stand up after this attack.</p><br/><p>The speed which Balzak’s knee was recovering got faster.</p><br/><p>Notung staggered and stood up, and Olmar ran while holding the unconscious Siri. Tae Ho spat blood and then breathed in.</p><br/><p>‘Flee. He isn’t someone you can face currently.’</p><br/><p>Cuchulainn’s words weren’t wrong. However he, that had said those words, and Tae Ho himself knew the truth.</p><br/><p>They couldn’t flee. It wasn’t because they couldn’t give up on Garmr’s soul fragment.</p><br/><p>They couldn’t leave Bracky and the other warriors that had become a mess.</p><br/><p>And most of all, there was no way Balzak would let go of them.</p><br/><p>Cuchulainn realized that this plot was set up by the Tyrant Bress. Not having expected that he could lay a hand like this in Midgard was his carelessness.</p><br/><p>He had some grudges against Tae Ho. Although he may not be able to catch the other warriors, he would catch Tae Ho however he could.</p><br/><p>And Tae Ho also thought the same. So he rather chose to take this situation in.</p><br/><p>‘If Notung takes Bracky and escapes.’</p><br/><p>Tae Ho would buy time for them. He would take his attention so that everyone else could escape.</p><br/><p>Tae Ho thought quickly. The situation was the worst right now.</p><br/><p>He couldn’t call Rolo anymore.</p><br/><p>Although he still had a summoning rock left to summon Adenmaha, she couldn’t fight anymore.</p><br/><p>Using Gae Bolg, that had expended all of its strength to defeat the Kraken, was impossible.</p><br/><p>Balzak stood up with the leg that was fine and then gripped the whip.</p><br/><p>Tae Ho breathed out and then decided.</p><br/><p>“Heda.”</p><br/><p>He called her in a low voice. He felt like he got strength with just that. Tae Ho smiled faintly and Cuchulainn realized what he was about to do.</p><br/><p>What Ragnar had forbidden him.</p><br/><p>The usage of Erin’s power, saying that it was still too early for him.</p><br/><p>‘Geass.’</p><br/><p>The one that had planted the seed of the geass to Tae Ho was Cuchulainn. Because of that he gulped out to groan.</p><br/><p>A geass was a two edged sword. You had to take the risk of having a big restriction to obtain a strong power.</p><br/><p>Tae Ho activated the seed of the geass. He made the first geass after Erin got destroyed.</p><br/><p>Balzak noticed the change. He hurriedly swung his whip as he felt danger instinctively.</p><br/><p>Tae Ho moved his body and then activated the geass and kicked the air.</p><br/><p>The whip swept the ground. Balzak’s surroundings had changed to become an open field rather than a forest.</p><br/><p>Cuchulainn felt anxious. What had Tae Ho sworn? Did he have the power to defeat the giant in front of him in his hands?</p><br/><p>And at some point. When Tae Ho kicked the air once again Cuchulainn got to know what it was.</p><br/><p>‘Tae Ho?!’</p><br/><p>Tae Ho had certainly used the geass. But Tae Ho’s basic capabilities didn’t change. There was only one thing that changed.</p><br/><p>The total amount of the power of a God.</p><br/><p>Idun’s strength that covered Tae Ho’s entire body!</p><br/><p>Notung looked at Tae Ho. Even Olmar, that was running while carrying Siri, could turn to look back.</p><br/><p>It was a strong power of a God that was difficult to feel in Midgard. It seemed like the power of a God was a few times greater than what he could usually use.</p><br/><p>Cuchulainn knew what geass Tae Ho had set up. Because of that he couldn’t understand the current situation.</p><br/><p>Tae Ho amplified the power of a God for a moment. But had instead put on the restriction of not being able to use the power of a God for fifteen days.</p><br/><p>This thing wasn’t a proper geass. You had to set a pledge for the geass and you could obtain strength for life unless you went against that pledge.</p><br/><p>Tae Ho’s geass was a condition. It was as strength that worked temporarily and was an abnormal geass that the restriction was already decided.</p><br/><p>The warriors of Erin didn’t use this kind of geass. Because for them, the geass was a means to improve their capabilities as warriors. What they needed was a strength to accompany them at any time.</p><br/><p>But Tae Ho was different.</p><br/><p>He thought differently. A temporary strength with a condition could also be useful for Tae Ho.</p><br/><p>Because Tae Ho was a warrior of Valhalla before being a warrior of Erin.</p><br/><p>What Tae Ho had wasn’t only the geass!</p><br/><p>The reason he put a restriction in his power of a God.</p><br/><p>The reason why he restricted it to only the strength of a God instead of what he would obtain through the geass.</p><br/><p>Balzak looked at Tae Ho. Tae Ho also glared at him and kicked the air once. Instead of transforming into a hawk, he gathered all of the power of a God to one place.</p><br/><p>What Ragnar had shown him.</p><br/><p>He still couldn’t catch up to him. But at least, he could watch in the same direction as him.</p><br/><p>The strength of the warriors of Valhalla.</p><br/><p>Their story that would remain as a legend, surpassing the anecdotes!</p><br/><p>[Mythology ranked saga: Idun’s warrior]</p><br/><p>A blinding golden light was emanating from Tae Ho’s entire body.</p><br/><p>&lt; Episode 22 – Saga (8) &gt; End</p><br/>\n</div>"}