{"title": "Chapter 87", "id": 87, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-87", "volume_title": "Volume 1", "body": "<h1>Chapter 87</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 25/Chapter 4: Paul’s sword (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: Isleidir</p><hr/><br/><p>A day had passed.</p><br/><p>After crossing the door of space and arriving Nidavellir, Tae Ho took a deep breath and placed down the person he was carrying on his back. He was so big and tall that his feet were dragging even when Tae Ho was carrying him.</p><br/><p>“Bracky, Bracky. We arrived. Wake up.”</p><br/><p>He shook him quite strongly but he didn’t show signs of waking up. Siri, that had accompanied Tae Ho, grabbed the bottle of water she was carrying.</p><br/><p>The effect was immediate. As soon as she poured it on his face, Bracky opened his eyes and woke up.</p><br/><p>“Huk! Where are we?”</p><br/><p>Bracky only rose up his upper body and asked. It was a dark, cold and moist place.</p><br/><p>Tae Ho let out a sigh as if he knew this would happen.</p><br/><p>“Nidavellir. You told me you were going together with us.”</p><br/><p>“I did?”</p><br/><p>“Yes, yesterday at the bar in Anaheim.”</p><br/><p>Although he was really drunk.</p><br/><p>Bracky put on a thinking face at Tae Ho’s words but it only lasted for a moment. Wondering about useless things like this wasn’t his style.</p><br/><p>“Um, well, I guess I did.”</p><br/><p>Because Tae Ho wouldn’t have lied to him.</p><br/><p>Whether he was drunk or not, Bracky was the type to go by with words.</p><br/><p>“Hey, Siri. You are also pretty today.”</p><br/><p>Bracky smiled and said. Siri laughed in spite of herself and then nodded and hit her chest.</p><br/><p>“Bracky, thanks for coming in your days off.”</p><br/><p>“Hmph, endless adventures is a basic thing for the king of vikings. I will always welcome an adventure in a new world. So where did you say this was?”</p><br/><p>If he hadn’t said that last sentence he would have been so cool.</p><br/><p>Siri let out a sigh inwardly and then glanced at her surroundings and said.</p><br/><p>“Nidavellir, the world of the dwarves.”</p><br/><p>“Oh, then this is the world deep underground that I only heard in stories. I don’t know about the surface, but this is the first time I came underground.”</p><br/><p>Bracky seemed to have understood the scenery as he was told that he was underground.</p><br/><p>Svartalfheim, that had a ceiling of branches was dark, but it wasn’t comparable to Nidavellir that was underground. If it wasn’t for the lights made by the rune magic of Tae Ho, then they wouldn’t even be able to see in front of them.</p><br/><p>Siri breathed the cold air that resembled the air of winter and then breathed out white steam and said.</p><br/><p>“It’s also our first time. In addition……..”</p><br/><p>“In addition?”</p><br/><p>“I don’t know about moving alone for a moment in the expeditions, but it’s the first time I came to a place this far without a Valkyrie.”</p><br/><p>The group that came to this expedition were Siri, Tae Ho, and Bracky. There was no Valkyrie that would lead them.</p><br/><p>“Oh, that’s true. I’m getting a bit uneasy.”</p><br/><p>It was also the first time Bracky moved without a Valkyrie. Tae Ho smirked as if soothing Bracky’s uneasiness.</p><br/><p>“There’s no Valkyrie but we have captain Siri, so don’t worry.”</p><br/><p>“That’s also true.”</p><br/><p>“I can’t understand you guys.”</p><br/><p>The one that understood and laughed was Bracky and the one that frowned was Siri.</p><br/><p>Bracky just laughed magnanimously instead of explaining and then rose up completely.</p><br/><p>“But what are we going to do here? I must have agreed even before asking what we were going to do, right?”</p><br/><p>He was right. Bracky had agreed as soon as they told him to accompany them.</p><br/><p>Tae Ho smiled bitterly when he remembered that he said some cheesy words like ‘if it’s with you guys don’t even mention Niflheim, I will even go to the palace of Hela as many times you want’ after that and then opened the mouth of Unnir. It was to take out Liberatus.</p><br/><p>“You remember that this was on the palace of Kataron, right?”</p><br/><p>“Right, it was a really painful experience for me.”</p><br/><p>Because he fell into debt for having lost to Siri.</p><br/><p>Bracky dropped his shoulders as if he got depressed. If it wasn’t for that bet he could be playing and enjoying more in Anaheim.</p><br/><p>Tae Ho felt that he would get even more depressed if he just left him alone so he said quickly.</p><br/><p>“Anyways, the Paul that is said to have made this sword left a map in it. And that’s why we came here.”</p><br/><p>“Oh. I understand. Having left a map is telling you that you should find him. Just like how a woman sends you a smile.”</p><br/><p>Bracky laughed and winked towards Siri, and she received that with a taciturn face.</p><br/><p>“Let’s go.”</p><br/><p>Because the place the map was pointing was quite far from this place.</p><br/><p>Tae Ho’s group decided to move closer to a river that flowed next to them instead of visiting the dwarf village that was near the space door. It was a river made with all the underwater gathered but it was as cold as ice.</p><br/><p>As Tae Ho took out Scuabtuinne from Unnir and threw it, the boat that was the size of a toy became as soon as a real boat.</p><br/><p>Tae Ho then summoned Adenmaha. There were two reasons why he called her through the summoning rock instead of traveling together. First, Adenamaha was studying with Scathach and the other one was that he could recall her if they were in an urgent situation.</p><br/><p>Tae Ho had saved Adenmaha and Rolo by returning them when they were in danger in the battles in Midgard. Being able to break away from the battlefield whenever you wanted was a really strong point.</p><br/><p>Scuabtuinne was a boat that could navigate by itself and although Bracky was an experienced sailor, this was a river of Nidavellir he experienced for the first time. If they were with Adenmaha, that could control water, then they could relax even if they sailed in an unfamiliar place.</p><br/><p>“How creepy.”</p><br/><p>Even if that wasn’t the case Nidavellir was already cold, but as the river was also cold the chill was quite something. In addition, as their surroundings were completely black they felt that it was colder.</p><br/><p>“Shall I lighten it a bit more?”</p><br/><p>Tae Ho looked at the ball of light he had made with his rune magic and then Adenmaha, that was next to him, grabbed his hands.</p><br/><p>“Don’t.”</p><br/><p>“Why?”</p><br/><p>At Tae Ho’s question, Adenmaha flinched for a moment and then checked her surroundings and whispered in his ear.</p><br/><p>“I think it will be scarier if we can see with more clarity.”</p><br/><p>Because she didn’t know what was in the darkness. And in the underground, there were plenty of terrible looking bugs.</p><br/><p>Although she whispered quietly, as their surroundings were really quiet Siri and Bracky ended up hearing what she said. Siri had her mouth shut but it seemed like she agreed with her.</p><br/><p>But the darkness was also threatening. Because they may be something observing them from a place they couldn’t see.</p><br/><p>Because of that Tae Ho first activated the ‘eyes of the dragon’. Even if he couldn’t see, he was able to discern the color of the words.</p><br/><p>And a few seconds later.</p><br/><p>Tae Ho smiled lamentingly and gulped dry saliva and Adenmaha asked hurriedly with a pale face.</p><br/><p>“Why? Can you see something? Are there any strange things?”</p><br/><p>It seemed like she was quite surprised that her use of polite words was really natural. Tae Ho smiled once again and then erased the things he had seen from his mind. There were an overwhelming number of bugs on the floor and also on the ceiling and walls.</p><br/><p>“Uh, yes. Let’s lighten it a bit more.”</p><br/><p>To the point where they couldn’t see the ceiling.</p><br/><p>Siri slightly increased the speed of Scuabtuinne while Adenmaha shrieked and put on a teary face.</p><br/><p>&amp;</p><br/><p>Although moving through the river was quite creepy, it was really comfortable. Tae Ho’s group arrived their destination in only two days and went towards the village marked on the map after retrieving Scuabtuinne.</p><br/><p>Nidavellir was a place you could describe as an artificial subterranean place. The place where the ceiling was low was merely 2 meters high but on the places where it was high, it reached tens of meters.</p><br/><p>The floor, walls, and ceiling were stones that were hard and smooth at the same time and as sunlight didn’t enter this place everything around them was cold.</p><br/><p>The dwarf village that was built on a place that was ten meters high, had its front blocked with a big wall of stones. You could feel the remnants of humans in their surroundings, but the biggest difference was the existence of light.</p><br/><p>The jewels carved in the ceiling emanated faint light like the moon or the stars in the night. Thanks to that they could clearly see around them even without the help of the ball of light.</p><br/><p>“Beautiful.”</p><br/><p>Siri looked at the jewels carved in the ceiling and said with a loud voice in front of the gates of the village.</p><br/><p>“We are warriors of Valhalla. There’s something we want to ask.”</p><br/><p>It was because she sensed that there were dwarves beyond the wall. After that, one dwarf extended his head over the walls and said quickly after checking on Siri, Tae Ho, and Bracky.</p><br/><p>“Wait a moment. The elder will come soon.”</p><br/><p>His eyes were doubting if they really were warriors of Valhalla but Siri just received his gaze without discomfort.</p><br/><p>And after a bit of time passed the gates opened up and a dwarf with a cool white beard and several young dwarves with good bodies appeared.</p><br/><p>“I am the elder of this village Gordon. Why have you come to this place warriors of Valhalla?”</p><br/><p>The dwarf elder, Gordo, spoke in an alert tone but it didn’t seem like he was avoiding Tae Ho’s group. They felt like they were going through some procedures.</p><br/><p>“We are intermediate ranked warriors of Valhalla Siri, Bracky, and Tae Ho.”</p><br/><p>Siri hit her chest twice and then went straight to the point.</p><br/><p>“We came to this place looking for the one called Paul. Do you know about him?”</p><br/><p>“Can you tell me why you have come to look for him?”</p><br/><p>Gordon asked immediately. Siri turned to look at Tae Ho and he took out Liberatus from Unnir.</p><br/><p>“It’s a sword made by Paul. There was a map on it and this place showed up.”</p><br/><p>It wasn’t only Gordon but the other dwarves that were with him also showed interest in Liberatus. It seemed like they had a way to recognize it just like how only masters could, but several of them let out marks of exclamation even though they saw it from afar.</p><br/><p>“So that’s the case. It seems like the story will become long, do you mind if we change places?”</p><br/><p>“This is your land so we will follow your will.”</p><br/><p>At Siri’s answer, Gordon and the dwarves let out satisfied smiles. It seemed like they were happy that Siri respected them.</p><br/><p>“She’s as reliable as a Valkyrie.”</p><br/><p>Bracky mumbled in a low voice and the dwarves started to lead them. There were several houses that were slipperily connected with each other and they resembled a stalactite and rocks that were chiseled with water drops for a long time.</p><br/><p>The house of the elder Gordon was especially big, and the inside of it was as bright as the morning thanks to the big jewel that was stuck in the ceiling.</p><br/><p>“We like it a bit darker but it should be suitable for you.”</p><br/><p>“Thank you for your consideration.”</p><br/><p>Gordon nodded a few times at Siri’s answer and then offered the group a seat. As the chairs of the dwarves were really small, the group had to sit on the ground with a cushion.</p><br/><p>Gordon said immediately.</p><br/><p>“It’s already been 30 years since Paul visited this village. I’m talking about the time when I only had two wrinkles on my forehead.”</p><br/><p>It hadn’t been 20 years since Paul set up Kataron so there may be more places he visited in that time.</p><br/><p>Gordon closed his eyes as if he was remembering the past.</p><br/><p>“He casually appeared one day and defeated a demon that had pushed the village to the brink of annihilation. He was a man with a lot of skills. He helped the recovery of the village through the use of several magics and mystical powers and when the village got stabilized he disappeared suddenly, just like when he first appeared.”</p><br/><p>It was similar to Kataron. Because of that, Tae Ho waited for Gordon’s words and Gordon said the words Tae Ho was waiting for.</p><br/><p>“But he didn’t leave alone. He stuck a sword made with a girder on the place he defeated the demon and disappeared.”</p><br/><p>“Ohh! Girder!”</p><br/><p>Bracky let out an exclamation right then. Gordon’s eyes widened and said.</p><br/><p>“Oh, you know about the girder? Certainly, intermediate ranked warriors of Valhalla. How knowledgeable!”</p><br/><p>Looking at Gordon’s face it seemed like he was really surprised. But Siri and Tae Ho put on embarrassed expressions and Bracky gave out the answer Tae Ho was expecting.</p><br/><p>“No, I don’t. What’s a girder?”</p><br/><p>“I’m saying this just in case, but not all the warriors of Valhalla are like this.”</p><br/><p>Siri said in a low voice but it was doubtful if her words were convincing enough.</p><br/><p>Gordon answered with an astringent face.</p><br/><p>“The girder is a mystical and magical metal. Objects made with girder can save magic power or life power in it and can suppress it.”</p><br/><p>“Is this sword also made with a girder?”</p><br/><p>Tae Ho extended Liberatus again. And then Gordon sniffed and said.</p><br/><p>“Well, I do smell girder in it.”</p><br/><p>Tae Ho also sniffed but just decided that he was right. As the attributes of all races were different, he thought that there was something only dwarves could smell.</p><br/><p>Siri asked Gordon again.</p><br/><p>“Can you tell us the place the sword is at?”</p><br/><p>Based on the story until now, it was an object comparable to the village’s treasure.</p><br/><p>And fortunately, Gordon nodded.</p><br/><p>“I will. In the first place, Paul left a map for this place for a reason. In addition, aren’t you warriors of Valhalla? You are the most reliable existences in Asgard.”</p><br/><p>Gordon left the village.</p><br/><p>The place where the sword was at wasn’t that far away from the village. After walking for about thirty minutes with Gordon’s slow steps, a place that was much bigger than what they saw until now appeared, and there was a big boulder surging in the middle of the place like a mountain.</p><br/><p>‘Rainbow colored words.’</p><br/><p>He could see rainbow colored words on top of the sword stuck in the boulder. When he got closer to it he could see that it was much bigger than Liberatus.</p><br/><p>‘Rather than a sword, it looks like a club.’</p><br/><p>Tae Ho agreed at Cuchulainn’s words. It was a weapon that should rather be called as a lance for lance charging.</p><br/><p>[Liberatus’s prototype]</p><br/><p>Tae Ho read the rainbow colored words inwardly and approached the boulder. But Bracky stepped ahead of him and said.</p><br/><p>“Can I try first?”</p><br/><p>It seemed like he remembered what happened in Kataron. Tae Ho hesitated for a moment but then nodded.</p><br/><p>“As you wish.”</p><br/><p>“I will pull it out this time.”</p><br/><p>Bracky smirked, then ran and grabbed the sword with his two hands. Cuchulainn clicked his tongue at that.</p><br/><p>‘That’s pointless. No one aside of Erin’s successor will be able to pull it out.’</p><br/><p>It was when he spoke like that. Although the sword didn’t get pulled out, it did move a bit and the boulder trembled. It was the overwhelming strength of Bracky.</p><br/><p>“Kuho.”</p><br/><p>But he still couldn’t pull it out. As Bracky panted and stepped back, Cuchulainn got relieved and Tae Ho hurriedly stepped in front.</p><br/><p>“I will try now.”</p><br/><p>As Bracky panted and nodded, Tae Ho grabbed the hilt of the sword. And then the sentence of the Milesians appeared on top of Tae Ho’s hand and it got pulled out easily.</p><br/><p>“Kugh! I almost had it!”</p><br/><p>“I don’t think that’s the case.”</p><br/><p>Siri said in a low voice next to Bracky and Tae Ho checked the sword he had pulled out. It was so big that the blade seemed to be 2 meters long.</p><br/><p>‘It has the same structure as Liberatus. There’s an object hidden inside of it.’</p><br/><p>It was the same as Kataron. The rainbow colored words must belong to the item inside of it rather than this sword.</p><br/><p>What could be inside?</p><br/><p>Could it also be a fragment of Gae Bolg?</p><br/><p>Tae Ho started to recite the release chant he learned from Scathach. And then the sword split in two and the weapon inside of it showed up.</p><br/><p>It was a really peculiar looking sword. The sword with a dull color had a triangular shape that became narrow as it reached the peak and there was one more handle you could grab on next to the hilt just like an oar of a boat.</p><br/><p>Cuchulainn took a breath and couldn’t say anything for a moment. It wasn’t because he also saw the rainbow-colored words like Tae Ho.</p><br/><p>It was because he knew the name of this sword. He even faced it several times.</p><br/><p>‘Caladbolg.’</p><br/><p>The sword of Cuchulainn’s enemy and killer, Fergus mac Roich.</p><br/><p>A solid thunderbolt and a strong attack that can even destroy mountains.</p><br/><p>The day Erin got destroyed Fergus mac Roich lost his life. His sword and all his things disappeared under the fire of Sutr.</p><br/><p>The Unknown sword piece vibrated. Tae Ho took a deep breath and grabbed Caladbolg. The sentence of the Milesians shone once again and Tae Ho could feel it.</p><br/><p>It was real. This sword was really Caladbolg, the sword the hero Fergus mac Roich used.</p><br/><p>Siri gulped dry saliva unconsciously. Gordon let out sighs of admiration several times and Bracky turned to look at the ground.</p><br/><p>A vibration could be felt. It was small at first but it became bigger. The ground even started to split up.</p><br/><p>Bracky rose from his place and grabbed Gordon and held him in his side with one arm.</p><br/><p>It wasn’t a normal earthquake. The vibration was only occurring in this place and not the entire ground.</p><br/><p>Tae Ho, that was looking at the sword, raised his head. A sentence made of light appeared on top of the rainbow colored words. It was a sentence that everyone could read.</p><br/><p>The one that has the qualifications, I will ask you to finish what I couldn’t.</p><br/><p>I hope you arrive before the seal disappears.</p><br/><p>Finish.</p><br/><p>What he couldn’t do so.</p><br/><p>“He’s coming! He’s coming! It’s coming!”</p><br/><p>Gordon yelled with a scared voice. Siri could sense it. Paul couldn’t completely defeat the demon. He had just sealed it up.</p><br/><p>And in this moment, the seal was undone. Because the sword, that was the key to the seal, was pulled out.</p><br/><p>The ground shook and the demon pierced the split ground and showed up. It was a huge serpent that had a body of stones. Just looking at the part that had risen to the surface, it seemed to be much bigger than Adenmaha.</p><br/><p>It glared down at the group with its red eyes. Gordon screamed and Siri let out a calm breath and pulled out her sword. Braky laughed and then held his hammer.</p><br/><p>Tae Ho put back the prototype of Liberatus in Unnir and then gripped Caladbolg. It was speaking to him through the sentence of the Milesians. How he had to use it, what he had to do to bring out its real power.</p><br/><p>[Saga: The one that controls gale and thunder]</p><br/><p>The thunder that appeared on Tae Ho’s hands got transmitted to Caladbolg. It covered the sword and exploded.</p><br/><p>Caladbolg, the sword of thunder.</p><br/><p>The sound of thunder announced the start of the fight.</p><br/><p>&lt; Episode 25 – Paul’s sword (4) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}