{"title": "Chapter 86", "id": 86, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-86", "volume_title": "Volume 1", "body": "<h1>Chapter 86</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 25/Chapter 3: Paul’s sword (3)</p><br/><p>TL: Tsubak</p><br/><p>ED: Isleidir</p><hr/><br/><p>There were several stories recorded in the ‘book of Erin’s invasions’ that was used to record the history of Erin.</p><br/><p>It was because there were that many leading species that led Erin’s history.</p><br/><p>In the first place, the name of ‘Erin’s invasions’ in the history book was proof of that.</p><br/><p>The first ones to start Erins history were a race of people that were known as the Van. This organization, that had a Goddess called Cessair as its leader, could have set up a culture of its own, however, its reign didn’t last long.</p><br/><p>The reason for that was the appearance of the fomoires.</p><br/><p>The king of the fomoires, Cichol, spread a strong plague and put the Van’s on the brink of death but also invaded Erin directly and didn’t leave anyone alive.</p><br/><p>But even the era when the fomoires reigned supreme couldn’t last long.</p><br/><p>The second group of people that appeared in Erin, the Partholon, were different to the Van’s. They rather succeeded in launching a surprise attack on the fomoires and succeeded on defeated Cichol, the king of the fomoires, after a long war.</p><br/><p>After they chased away the fomoires from Erin they became the second rulers of Erin. But the final and strongest curse king Cichol left harassed them without stop. In the end, the Partholons couldn’t endure the curse of Cichol and Erin became an ownerless land once again.</p><br/><p>The third group to rule Erin was a group called as the Nemed. However, they were defeated in their fourth great war against the fomoires and all the people of their race became enslaved to the fomoires.</p><br/><p>After that, the ancestors of the ones that had fled of the tyranny of the fomoires had returned once again and they were the Fir-holg and Tuatha De Danann.</p><br/><p>Tuatha De danann, that had driven out the Fir-holgs that had established some force after the fomoires, started a large scale war against the fomoires that were a long time enemy of Erin.</p><br/><p>And in that war, Lugh the king of Gods defeated the king of fomoires Balor and attained victory.</p><br/><p>It was now the time of peace.</p><br/><p>However, Tuatha De Danann got faced with a new challenge.</p><br/><p>It was the appearance of the Milesians, a strong race of humans.</p><br/><p>The Milesians drove the Tuatha De Danann away and reigned Erin. The Tuatha De Danann fled to the underground world and the Milesians, that got to dominate Erin completely, defeated the fomoires that were invading intermittently and opened the gates to a new era.</p><br/><p>“The Milesians and the Tuatha De Danann aren’t complete enemies. They fought at times but also cooperated with each other.”</p><br/><p>Cuchulainn finished his long explanation and let out a long sigh. Tae Ho, that became a spectator, let out a sigh of admiration.</p><br/><p>“Uh, it’s somewhat complicated. It’s this side also the same?”</p><br/><p>Tae Ho, that was crouching down, turned around and asked. It wasn’t Heda but Adenmaha, that arrived just when the story was about to start.</p><br/><p>Heda quickly shook her head.</p><br/><p>“Not at all. The Aesir fought against the Vanir and the Aesir won, and that’s the end. Ah, additionally the relationship between the Aesir and the Vanir isn’t bad right now. Freya-nim and Freyr-nim are of the Banha race.”</p><br/><p>“It’s so like Valhalla. How simple.”</p><br/><p>As Tae Ho nodded with a satisfied face, Heda smiled brightly. On the other hand, Cuchulainn put on an absurd expression and continued speaking.</p><br/><p>“Anyways, what I just told you is the basic history of Erin. As you are the successor of Erin you should study more later.”</p><br/><p>“Mm, so anyways. The last ones to dominate Erin were the Milesians right?”</p><br/><p>“Right, it’s somewhat sad but you should at least remember that clearly.”</p><br/><p>There was a sense of excellence showing in the face of Cuchulainn, that had started to act as a teacher, that he wasn’t accustomed to. Scathach, that was looking at the sides, said.</p><br/><p>“Just like Cuchulainn explained, the Tuatha De Danann and the Milesians could coexist together. There’s also a time that the Goddess of war, Morrigan, court shipped Cuchulainn.”</p><br/><p>Scathach said ‘isn’t that right?’ in a low voice and turned to look at him. Cuchulainn cleared his throat at her eyes that were shining vaguely.</p><br/><p>“Hm hm.”</p><br/><p>Cuchulainn was a man with a lot of lovers.</p><br/><p>Scathach drew a sly smile and then looked at Tae Ho again.</p><br/><p>“Because of that the Tuatha De Danann and the Milesians shared many things among them. You can know just by looking at Adenmaha, that was a Tuatha De Danann, use a geass. The geass was a power of all of Erin.”</p><br/><p>In addition, even the fomoires used it. Although it was only a part of it, compared to the Tuatha De Danann and the Milesians.</p><br/><p>Cuchulainn raised his fist that had the sentence of light and said.</p><br/><p>“What I will transmit to you now is the power of the Milesians. I’m telling you just in case but there are some that mastered the power of the Milesians just like how master mastered the power of the Tuatha De Danann.”</p><br/><p>“Right.”</p><br/><p>Cuchulainn had started to speak a lot, maybe because he started to explain a lot of things at once. He smacked his lips once and said casually.</p><br/><p>“I will say it briefly. Simply said, the power of the Milesians is the communication with the tools.”</p><br/><p>Tae Ho tilted his head as he had heard something completely unexpected. Cuchulainn lightly clenched his fist as if he was satisfied and then continued explaining.</p><br/><p>“The tool in your hands…..in your case or mine it should be a weapon. The Milesians handled their weapons better than any other race through the communication with their tools.”</p><br/><p>Because handling a tool was the strength of a human.</p><br/><p>“I’m not talking about conversing with your weapon. It’s understanding it and sharing feelings with it. Then, you will be able to do things like this.”</p><br/><p>Cuchulainn paused for a moment and then spread his palm near his waist. And then, the sword that was sheathed in his waist got out of its own and got held by Cuchulainn.</p><br/><p>“This is the basic stage. You could say that it’s the level that the weapon answers the call of its owner. Um, it’s similar to raising a dog. A dog comes running to you when you call it, right?”</p><br/><p>“It’s somewhat cheap but easy to explain.”</p><br/><p>Adenmaha said in a low voice. Cuchulainn kept speaking when Tae Ho and Heda were nodding.</p><br/><p>“If you are able to reach the peak and listen to the voice of the sword, you will be able to do more things. You won’t only be able to hold your strength in your sword more effectively but will be able to bring out a strength beyond what your sword can originally unleash.”</p><br/><p>This was the reason why Cuchulainn had said that it would help on his attribute training. If you used the power of the Milesian, you would be able to unleash anything much stronger, be it an attribute or the power of a God.</p><br/><p>“And if you go a step higher than this….”</p><br/><p>Cuchulainn put down the dagger he was holding but it didn’t fall to the ground. It spun around Cuchulainn and then followed the movements of his hands and moved in the air.</p><br/><p>“You will be able to control it this freely in a short distance.”</p><br/><p>“Just like being with a hunting dog?”</p><br/><p>“That’s a good comparison, I like it.”</p><br/><p>Cuchulainn smirked and flicked his finger. And then, the dagger returned to its sheath as if being sucked into it.</p><br/><p>“But there’s a limit on handling weapons that have no real connection to you or had a short interaction like this dagger. The companion of a warrior is his weapon, so the real power of the Milesians will unleash only when one finds a real companion. For me, it’s Gae Bolg.”</p><br/><p>The weapon Cuchulainn named right now was made with Scathach’s magic. In the first place, being able to face Tae Ho face to face like this was thanks to Scathach’s power.</p><br/><p>If Cuchulainn was alive, then all the fragments of Gae Bolg would have gathered if he just called for it.</p><br/><p>Tae Ho, that was listening to Cuchulainn’s explanation while sitting down, raised his hand and asked.</p><br/><p>“Can’t you control several at once?”</p><br/><p>Not one sword, but several swords.</p><br/><p>Cuchulainn put on an absurd face and answered.</p><br/><p>“Hey, didn’t I tell you about the companions? How can you think of something that playboyish as soon as you listen to my explanation?”</p><br/><p>“Cuchulainn, I don’t think it’s something you should be saying.”</p><br/><p>Because Cuchulainn himself was a playboy that had several lovers.</p><br/><p>Cuchulainn got greatly bewildered at Scathach’s low refuting and then cleared his throat.</p><br/><p>“Hm hm. Anyways, it’s not that it’s impossible but it’s really hard. If you want to control it freely, you need the connection that has accumulated for a long time.”</p><br/><p>The warriors didn’t use as many weapons as one thought. Because if you were a warrior for a long time, a weapon you got accustomed to would appear.</p><br/><p>There were really few warriors be it in Erin or Asgard that changed their equipment every time they got a bit stronger.</p><br/><p>But it was different for Tae Ho. The dragon knight Kalsted changed his equipment every time he reached a certain level in Dark Age. And all those weapons had their respective stories with him.</p><br/><p>Cuchulainn actually knew that truth to a certain extent. And he thought that if it was Tae Ho, he may really be able to control several weapons at the same time.</p><br/><p>But he still shook his head. Just like there was only one love Cuchulainn couldn’t forget, there was only one true companion for a warrior.</p><br/><p>“The power of the Milesians doesn’t just stop at handling weapons. Becoming one with the weapon and going past the boundary is the real peak. And there’s only one weapon that you will be able to do that with. A real companion you will spend your life with, a weapon you won’t drop even at the last moment. Don’t you also have a weapon like that?”</p><br/><p>Cuchulainn had Gae Bolg.</p><br/><p>His enemy and Executioner, Fergus mac Roich, had Caladbolg.</p><br/><p>Tae Ho nodded unconsciously. Because he thought of only one sword, no, remembered in his heart the moment he heard the story.</p><br/><p>Dragon Sword Astellone.</p><br/><p>The last piece that completed the strongest dragon knight Kalsted in Dark Age.</p><br/><p>The final sword that was recorded in the ‘warrior’s equipment’.</p><br/><p>Cuchulainn laughed in a good mood.</p><br/><p>“The thing that will be your root is the saga, not the geass. But the power of the Milesians will be of great help to you. It won’t even disturb with the saga. I assure you that it will rather increase the good effects.”</p><br/><p>Cuchulainn extended his fist towards Tae Ho. Tae Ho also extended his fist as if he understood what Cuchulainn wanted. The fists of the two people touched and then a new message of light appear on the back of Tae Ho’s hands – the sentence of the Milesians.</p><br/><p>&amp;</p><br/><p>Ragnar returned to Idun’s residence after two days.</p><br/><p>And as soon as he returned he inspected Tae Ho’s saga.</p><br/><p>“So the seed of the geass really disappeared. But it’s not that it disappeared completely. You should also feel it but it melted in your saga.”</p><br/><p>Up to this point, it was as Tae Ho felt it.</p><br/><p>Ragnar placed his hand on Tae Ho’s shoulders and said.</p><br/><p>“Tae Ho, the saga is a realization of a story. The strength you executed with the help of the geass became your legend. On top of this, the power of a God was added and the strength of the saga that was once more strengthened became bigger. Your new saga ‘Idun’s warrior’….is really a miracle like saga that was made by these things overlapping themselves.”</p><br/><p>Every time Tae Ho used ‘Idun’s warrior’ he could connect with Idun directly. It was a peculiar type of saga that even Ragar heard for the first time.</p><br/><p>“But it’s not certain that it will occur once again. I’m also in doubt if you will be able to use another geass as an expedient. The most important thing of all is that you violated the geass because you received a restriction.”</p><br/><p>Cuchulainn had also said something similar.</p><br/><p>For a warrior of Erin to violate a geass was a really incredible thing. The reason why Cuchulainn got shocked when Tae Ho used the restriction as a premise was because of that.</p><br/><p>“The power of the Milesians is good. It also suits well with the saga and power you have and has no after effects. Actually, if possible, I would like to master it myself.”</p><br/><p>The ones that could acquire the power of the Milesians were the warriors of Erin.</p><br/><p>If Tae Ho wasn’t a successor of Erin he wouldn’t have been able to learn it.</p><br/><p>“I did well on requesting Rasgrid. Your base on the attributes is really well set up.”</p><br/><p>“I’m glad.”</p><br/><p>Tae Ho said sincerely.</p><br/><p>And then Ragnar read the painful days of lessons Tae Ho had to face and laughed.</p><br/><p>“For now it will be the same just like when you first used the power of a God. Operate the attributes a little bit every day. It is important to get accustomed to the point you are able to use it even though you aren’t that conscious of it.”</p><br/><p>Ragnar finished his lessons by picking the main points and direction like always. His teaching method was completely different to Rasgrid, that directed all the directions perfectly.</p><br/><p>“Well, I will end the nagging here. You are going to Nidavellir?”</p><br/><p>“Yes, I’m planning to find the person that made Liberatus.”</p><br/><p>“Hm, it’s certainly worthwhile to go.”</p><br/><p>Ragnar had already heard the story related to Liberatus from Heda. If it really was a survivor of Erin, and in addition was a skilled person comparable to Scathach, it would surely be of help to Tae Ho and also to Idun’s legion.</p><br/><p>“Only….I or Heda won’t be able to go with you as it’s outside of Asgard. Although you have Adenmaha I’m still uneasy. Go with good comrades.”</p><br/><p>“Captain Siri?”</p><br/><p>“Not only her. This expedition was quite big and you had performed great so all of the comrades that returned with you must have received days off similar to you. Find guys that will go with you from them. The camaraderie accumulated in the battlefield is thicker than blood so you will certainly be able to find someone who will accompany you.”</p><br/><p>Tae Ho nodded at Ragnar’s words. Although it hadn’t been a month, the memories from Midgard were ones he wouldn’t be able to forget.</p><br/><p>Someone to accompany him to Nidavelir.</p><br/><p>A reliable ally he would be able to entrust his back to.</p><br/><p>“It seems like you have thought of someone.”</p><br/><p>Ragnar said while smiling and Tae Ho nodded.</p><br/><p>&lt; Episode 25 – Paul’s sword (3) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}