{"title": "Chapter 85", "id": 85, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-85", "volume_title": "Volume 1", "body": "<h1>Chapter 85</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 25/Chapter 2: Paul’s sword (2)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><hr/><br/><p>That place was the front lines to protect the world.</p><br/><p>The boundary between Asgard and the world called as Erin.</p><br/><p>You could see a fragment of the destroyed world from beyond the blue sky. The destroyed continents, dried up rivers, and the corpses of the living beings that could be seen on that planet weren’t as romantic as a floating island.</p><br/><p>Stars fell down the night sky and a huge path of fire, that seemed to be a sun, could be seen from far away. It was the fire of Muspelheim, the fire that burnt down Erin.</p><br/><p>Although a hundred years have passed since the Great War, the fire didn’t weaken at all. It rather grew bigger and closed the distance with Asgard.</p><br/><p>Ragnar Lodbrok.</p><br/><p>The great viking king stood in a fortress made of steel and looked in front of him. The perpetual was close to him, different from the fire that was burning down a planet. It was the blizzard made by the Frost giants that came from Jotunheim.</p><br/><p>The magician king Utgard Loki wasn’t the only giant king. The king of the Frost giants, Harmarti, possessed an army so big it was difficult to even count them. Although a hundred years have passed, no one knew the complete force Harmarti had.</p><br/><p>Ragnar closed his eyes for a moment and leaned his ear on the sound of the horn trumpet. The sound, that was heard close by, came from the warriors of Valhalla.</p><br/><p>The ones protecting the front lines of Asgard were the warriors above the intermediate rank. If they weren’t there, then Harmarti and his army would have charged over Asgard like a hail covering the coast.</p><br/><p>Ragnar opened his eyes and turned to look at the top of the fortress. Countless steel warriors were standing on top of it as if they were part of the fortress.</p><br/><p>Most of them were lowest ranked or inferior ranked warriors that had lost their lives. However no one in the front lines ignored them. Because they were the real fortress protecting Asgard. They were the great warriors that rose up after shaking off death.</p><br/><p>Ragnar breathed out. He looked at the white steam coming out from his mouth and turned around. Thor was standing on that place even though the sound of thunder wasn’t heard.</p><br/><p>“Ragnar Lodbrok.”</p><br/><p>“Greetings to the God of thunder.”</p><br/><p>Ragnar hit his chest twice. Thor also did the same and then stood next to Ragnar.</p><br/><p>“It’s a regretful scene.”</p><br/><p>Thor said. His eyes were roaming on the distant fragments of Erin.</p><br/><p>Thor remembered the destruction of Erin. Because he saw it burn with his own eyes. He was on that place when Erin got destroyed.</p><br/><p>The scene of a planet burning down and disappearing couldn’t be expressed by words. Thor couldn’t forget the misery he felt until now.</p><br/><p>Ragnar was also there. Because of that he knew what meaning the destruction of Erin had for Thor. Thor’s pain didn’t only stop at the destruction of Erin.</p><br/><p>When Loki betrayed Asgard he chose the side of the giants while leaving behind his brother Thor and Asgard.</p><br/><p>Ragnar smiled bitterly. It was a more heartbreaking expression than tears.</p><br/><p>The misery continued even after the destruction of Erin. Because the Great War occurred. There were countless deaths on that war.</p><br/><p>Ragnar remembered the tragedy that occurred in Idun’s legion. He couldn’t forget the back of the woman shedding tears in front of a pile of corpses.</p><br/><p>He breathed out again. It was intentional. Thor and Ragnar put aside the past and looked at the present.</p><br/><p>“Is the warrior from that time doing good?”</p><br/><p>“If you are talking about Tae Ho, yes, he is doing well.”</p><br/><p>“I heard he was famous.”</p><br/><p>“Yes, he will become strong.”</p><br/><p>Ragnar answered immediately. Thor looked at Ragnar as if it was unexpected and then put on a smile.</p><br/><p>“For the unparalleled Ragnar to say that. It’s been a really long while since I saw that.”</p><br/><p>“Because he’s someone that will become that big.”</p><br/><p>It wasn’t only because of the saga Tae Ho had. It was the conclusion that Ragnar, that had seen countless warriors and was a great warrior himself, had come to.</p><br/><p>Ragnar’s two eyes resembled a wolf. Thor erased his smile for a moment and looked at Ragnar. He took a deep breath and nodded.</p><br/><p>“Well, it may be obvious as he’s the disciple of none other than Ragnar Lodbrok. I will be waiting for the day to fight on the same battlefield as him.”</p><br/><p>Thor was always sincere. Ragnar answered with a smile. Talking about Tae Ho in detail was unnecessary right now.</p><br/><p>“Thor, great God of thunder. I will be returning now.”</p><br/><p>He had already finished his business. The reason why he stayed until now was to say his farewell to Thor.</p><br/><p>Thor put on a regretful face but he didn’t hold him back. He lightly patted on Ragnar’s shoulder to express his affection for him and then fixed his posture. Ragnar also fixed his posture and expressed etiquette.</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>Ragnar turned around. Thor looked at his back for a moment and then also turned around and looked at the direction where the giants were standing at. He looked at the remnants of Erin.</p><br/><p>&amp;</p><br/><p>“Is this all?”</p><br/><p>“I think so.”</p><br/><p>Adenmaha looked at he message that appeared in the air and frowned, and Scathach nodded calmly.</p><br/><p>There was no voice or words left in the message of Liberatus. There was only a map.</p><br/><p>“Uh….Nidavellir?”</p><br/><p>The world of the dwarves.</p><br/><p>As Adenmaha mumbled while looking at the map, Tae Ho asked once again.</p><br/><p>“Do you know what that is?”</p><br/><p>“Somewhat? I think it’s something like a treasure map.”</p><br/><p>There was a specific location marked on the magical message. Tae Ho nodded and Scathach opened her mouth.</p><br/><p>“The place located in the map is a place that not even the dwarves go frequently. It’s a good place to hide something…..or hide from someone.”</p><br/><p>Her words had credibility as it came from her, that had already hid in Nidavellir once.</p><br/><p>“A treasure map. It makes me excited.”</p><br/><p>Adenmaha put on the eyes of a dreaming girl and said. It seemed like she unexpectedly liked these things.</p><br/><p>‘There may really be a treasure there. Perhaps, the one called Paul may have another fragment of Gae Bolg. And if there’s a legacy from Erin it’s also right for you to have it, as you are the successor of Erin.’</p><br/><p>Cuchulainn said calmly. Tae Ho, that was just listening silently, raised his hand and asked.</p><br/><p>“Um, it’s kind of sudden but can I ask a question?”</p><br/><p>‘What is it?’</p><br/><p>“Is that successor of Erin thing a formalized position?”</p><br/><p>Cuchulainn had always told him that Erin’s legacies belong to you, the successor of Erin.</p><br/><p>Tae Ho just heard those words as ‘they are all ownerless items now so it’s obvious for you, that is somewhat related, to have it.’ But now that he heard it, it seemed like it had a meaning beyond that.</p><br/><p>Cuchulainn called Scathach instead of answering immediately.</p><br/><p>‘Master.’</p><br/><p>“Right, I will teach you.”</p><br/><p>Scathach could listen to Cuchulainn’s voice even though she wasn’t placing her hand on Gae Bolg. As Scathach waved her hand, Cuchulainn appeared next to Tae Ho that was taking a similar shape as her.</p><br/><p>“It’s more comfortable to speak now. Well, to answer you, that’s right. The successor of Erin is a seat that is chosen fairly.”</p><br/><p>Cuchulainn walked and stood next to Scathach. As all of them were really good looking, they were seen as a really suitable couple.</p><br/><p>“Erin’s destruction came really suddenly but it wasn’t that we didn’t have time. The kings of Erin prepared a successor of Erin in case Erin got destroyed. Because they needed someone to lead the survivors and raise Erin some day.”</p><br/><p>Simply said, it was an inheritor. It was commonly seen in wars.</p><br/><p>“But it wasn’t that all the kings in Erin agreed to this. However it was agreed by the strongest forces representing Erin.”</p><br/><p>Cuchulainn spoke up to there and then extended his fist so that his back of the hand could be seen.</p><br/><p>“Tae Ho, extend your fist.”</p><br/><p>Tae Ho also extended his fist. And then a flashy sentence made of light appeared on top of the back of Tae Ho’s hand.</p><br/><p>“It’s the message of light that proves that you are the successor of Erin. It’s something I originally had.”</p><br/><p>It was a sentence that moved to Tae Ho’s hands naturally the day Cuchulainn and Tae Ho had a conversation for the first time.</p><br/><p>“That sentence contains the writings of several kings. Master, can I ask you to do it?”</p><br/><p>“Okay.”</p><br/><p>Scathach moved her hand again and then the sentence that was on Tae Ho’s hand appeared in the air ten times bigger.</p><br/><p>Cuchulainn pointed at several parts of the sentence and said.</p><br/><p>“The sentence of the God of light Lugh, the king of the Tuatha De Danann, the owner of the Red branch knights and my lord Conchobar mac Nessa and the leader of the Fianna knights Fionn mac Cumhaill, the sentence of Miev the wicked woman of rarity, and the sentence of master, the queen of the land of darkness.”</p><br/><p>Tae Ho didn’t know well but it was different for Adenmaha. She opened her mouth unconsciously and admired. It was because they really were the kings that represented Erin just like Cuchulainn had said.</p><br/><p>In addition it wasn’t the end. Cuchulainn pointed at the last sentence and said.</p><br/><p>“It’s the sentence of King Arthur, the leader of the knights of the round table and the king of Camelot.”</p><br/><p>“King Arthur?!”</p><br/><p>As Tae Ho raised his voice unconsciously Cuchulainn tilted his head.</p><br/><p>“Right, do you know him?”</p><br/><p>“Well, a bit.”</p><br/><p>There was a high possibility for King Arthur to be different to what he knew just like the north european mythology he knew was different from Asgard. But his heart beat excitedly. King Arthur was a legendary king even Tae Ho knew through games, novels, movies, etc.</p><br/><p>Cuchulainn continued explaining.</p><br/><p>“I’m not the only one that received the sentence of light. But i was the only one that remained alive among the ones that received it. And Tae Ho, you received that from me. So you are the real successor of Erin.”</p><br/><p>“If the one that made Liberatus is a successor of Erin, he will recognize the validity of that sentence of yours.”</p><br/><p>Scathach added. Tae Ho turned to look at Adenmaha after nodding.</p><br/><p>“Do you know what it is?”</p><br/><p>“I can feel a strong authority from it. There’s even the sentence of the God of light, the king of the Tuatha De Danann in it.”</p><br/><p>“Is it.”</p><br/><p>The race of the Tuatha De Danann was composed by Gods. As Adenmaha was a citizen of the Tuatha De Danann, it was obvious to feel some authority in the sentence of the God of light Lugh.</p><br/><p>With the same reasoning, if the one that made Liberatus belonged to a force of one that set up the message, then there was a high probability he would recognize Tae Ho’s authority. Because Erin was a world where the authority of the king was recognized, compared to the world Tae Ho lived in.</p><br/><p>“You are in your days off anyways because of the expedition, right? Let’s go find the maker of Liberatus or the legacies of Erin.”</p><br/><p>“It’s a treasure hunt.”</p><br/><p>Adenmaha’s eyes shone again at Cuchulainn’s words.</p><br/><p>Scathach laughed at that and continued speaking to Tae Ho.</p><br/><p>“That’s a good idea. But there’s something you need to prepare before that.”</p><br/><p>It wasn’t preparing for the treasure hunt just like Adenmaha thought.</p><br/><p>“Tae Ho, you should know because you faced it yourself but Bress is a stubborn guy. You don’t know when he will attack you again. So we have to prepare for that.”</p><br/><p>He had already attacked Tae Ho twice in Midgard. In addition as he had failed the two times, his resentful feelings must have grown bigger.</p><br/><p>“The mystical powers of the Tuatha De Danann isn’t something you can learn in a short time. In addition there are many cases that i’m not with you, Tae Ho. We can’t keep bothering Idun-nim for this either.”</p><br/><p>Sending down divine messages every day and maintaining for a long time wasn’t a normal heavy labor.</p><br/><p>“The introduction has been long. I will tell you the conclusion. Give Adenmaha to me.”</p><br/><p>Scathach said and Tae Ho blinked. After a moment of silence Adenmaha got a hold of herself and yelled surprisedly.</p><br/><p>“Wha, what are you talking about! Ah, there’s no need to speak politely. What are you talking about you witch!”</p><br/><p>Just how did she come to the conclusion to give Adenmaha to her based on what they were talking until now?</p><br/><p>Scathach looked at the angry Adenmaha and looked at Tae Ho and explained.</p><br/><p>“Adenmaha may be immature and weak but she’s still a Goddess of Tuatha De Danann. I will transmit the mystical powers of Tuatha De Danann to her. She will have a lot of time to study as she remains in the residence and compared to you Tae Ho, that has to learn several things at the same time, Adenmaha just has to learn the mystical powers. As she already has the basics she will be fast on learning.”</p><br/><p>Simply said it was a division of labor. Adenmaha was a family of Tae Ho and he could call her whenever he wanted.</p><br/><p>“Tae Ho, you should keep slowly learning the mystical powers like you are doing right now. I will teach Adenmaha and then she can teach you later.”</p><br/><p>“I understand. I will leave Adenmaha in your care.”</p><br/><p>“Right.”</p><br/><p>“Hey, the one that will be learning is me.”</p><br/><p>As Adenmaha, that was the one they were talking about, got excluded she spoke with a bulgy face but Tae Ho just lightly swung his fist.</p><br/><p>“Fighting.”</p><br/><p>Adenmaha’s eyes became sharper. Scathach laughed at that but she soon fixed her expression and said.</p><br/><p>“Tae Ho, I still haven’t finished speaking.”</p><br/><p>Scathach turned to look at Cuchulainn that was right next to her and said.</p><br/><p>“Cuchulainn, I barely know what you are thinking about. But in my opinion, I think that it’s time.”</p><br/><p>“I also think the same. And I think that I roughly know his aptitude.”</p><br/><p>“Right, it’s enough with that. Start transmitting him the power.”</p><br/><p>They were speaking without the concerned party this time too. Tae Ho, that was just listening, asked.</p><br/><p>“Transmission of the power….Are you talking about the geass?”</p><br/><p>Because he learnt that Erin’s power that was comparable to Asgard’s was the geass.</p><br/><p>But Cuchulainn and Scathach shook their heads almost at the same time.</p><br/><p>“It’s not the geass.”</p><br/><p>Just like Asgard didn’t only have the saga, Erin also didn’t only have the geass.</p><br/><p>Cuchulainn was observing Tae Ho and waiting for the right time just like what his conversation with Scathach said. And he judged that it was the right time.</p><br/><p>“I needed a bit of time after observing how you fight and making a decision. Because you are a warrior of Valhalla before being a warrior of Erin. If you learn several powers, you may not be able to digest it all and will rather become weaker. But it is now time. This will also help you on understanding the attributes you are learning right now.”</p><br/><p>What Cuchulainn first promised.</p><br/><p>The heritage of the strong human race that defeated the Tuatha De Danann and the fomoires and reigned supremacy in Erin.</p><br/><p>“It’s the power of the Milesians.”</p><br/><p>A new sentence of light appeared in Cuchulainn’s fist.</p><br/><p>&lt; Episode 25 – Paul’s sword (2) &gt; End</p><br/>\n</div>"}