{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 27/Chapter 2: The sword of selection (2)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>Long ago, there had been a sword wedged within a stone.</p><br/><p>It was said that whoever pulled out the sword would one day become king, but no one was able to do it.</p><br/><p>No one, until a small and frail child appeared one day.</p><br/><p>—</p><br/><p>The origin of a saga is its legend.</p><br/><p>There was a legend behind the Sword of Selection, a sword which only answered to its king.</p><br/><p>Now, Tae Ho had drawn such a sword.</p><br/><p>An image of a child pulling the sword from a rough boulder was displayed in his mind.</p><br/><p>The first legend that he, a child who’d become a king, had created.</p><br/><p>A pristine light emanated from Caliburn.</p><br/><p>Tae Ho realized the light was identical to that which had shone as Arthur, King of Camelot, had drawn it for the first time.</p><br/><p>It was Camelot’s glory. Caliburn’s glory, which reigned supreme like the sun.</p><br/><p>Caliburn barred it teeth against Clarent’s darkness which empowered the night, and the world shifted as broad daylight erupted to flip the murky atmosphere on its side.</p><br/><p>The specters of Camelot who battled against Valhalla’s warriors suddenly howled. They, who had rebelled to follow Mordred, greatly feared repeating the same mistakes as before.</p><br/><p>Their evil aura was scattered. The black fog that enveloped the specters was instantly eradicated in the presence of Caliburn’s glory, and the chains which anchored their souls revealed themselves.</p><br/><p>The chains broke. They broke and were pulverized into dust.</p><br/><p>A flood of resentment was released as the chains were destroyed. The specters of Camelot cried and yelled as their century-long melancholy was finally put to an end.</p><br/><p>‘Our king.’</p><br/><p>The specters of Camelot vanished. They, whose souls had wandered purposely for close to a hundred years, had finally received the rest they deserved.</p><br/><p>Mordred wouldn’t do the same, however. He watched the emancipated specters disappear and roared like a cornered beast. His rage and hatred had reached a new level.</p><br/><p>Clarent reacted to Mordred’s violence. It released countless specters as if planning to erase the sun before it. The specters quickly coalesced to form the shape of a pitch-black wave.</p><br/><p>The Treasure Sword, Clarent, had originally been a weapon that represented the throne of a race far beyond Erin’s borders.</p><br/><p>Long ago, King Arthur had claimed Clarent only after defeating its owner in battle.</p><br/><p>Because of this, Clarent held a deep-rooted resentment towards both King Arthur and Camelot, and it was entirely possible that the union between Clarent and Mordred was due to the intense maliciousness both had.</p><br/><p>Ingrid, who stood closest to Tae Ho, gazed intently at the wave of specters charging in their direction.</p><br/><p>The simultaneous cries of countless, tortured souls was too terrible even for her to endure for long.</p><br/><p>However, Ingrid didn’t fear the oncoming wave, for she stood alongside a powerful light which burned like the sun.</p><br/><p>Like before, the specters composing the dark wave were unshackled from the binding magic, and the wave shook before shattering. Although the quantity of specters had been multiplied tenfold, the result was no different before Caliburn. The specters matched against the glory of Camelot evaporated like a stream of lies. The power of the sun crushed down upon the darkness and ushered the specters to their rightful places of rest.</p><br/><p>Unlike before, something miraculous was happening.</p><br/><p>Figures had begun forming alongside Tae Ho.</p><br/><p>The warriors of Valhalla couldn’t distinguish them, but it was different for Merlin. He couldn’t stop his tears from falling.</p><br/><p>The figures- no, the <i>knights</i> were those of the Knights of the Round Table.</p><br/><p>Although they were only remnants, it was an incomparably beautiful sight. It seemed that, even after death, the souls of the Knights of the Round Table still remained to fight alongside the King of Camelot.</p><br/><p>Upon witnessing this, Mordred howled once again. He couldn’t endure it anymore.</p><br/><p>He gazed at Tae Ho, and an image of his father appeared in his mind.</p><br/><p>He recalled the moment in which he’d stabbed the chest of King Arthur with Clarent.</p><br/><p>Clarent seethed and emanated a red and blackish light as Mordred roared and charged towards Tae Ho.</p><br/><p>Tae Ho saw Mordred and calmly leaned his ear towards Caliburn’s blade.</p><br/><p>The light which Caliburn eminanted was concentrated into a single point. Instead of blazing as the sun did, the light exploded atop the blade’s tip like a brilliant, white star.</p><br/><p>Mordred slashed Clarent forward with all of his might.</p><br/><p>Tae Ho made no attempt to dodge him. As he faced Mordred head on, Caliburn swung out to meet Clarent.</p><br/><p>‘<i>BOOM</i>‘</p><br/><p>As the swords touched, a deafening explosion rocked heaven and earth.</p><br/><p>Each sword was one befitting a king, but there was a decisive difference in status.</p><br/><p>The ones wielding them were different.</p><br/><p>One was a real successor of Erin whom Caliburn had selected.</p><br/><p>The other was a rash usurper that had never been destined for kingship.</p><br/><p>That was the quantifiable difference, and it had already decided the outcome of this fight.</p><br/><p>Mordred saw in Tae Ho the image of King Arthur. He recalled Arthur’s eyes as he’d pierced his chest, and a fissure in his soul that hadn’t healed with time was reopened.</p><br/><p>“Ahh.</p><br/><p>“Ahhhhhh!!”</p><br/><p>Mordred dropped Clarent, and he pitifully fled from the proximity of both blades like a broken man. The witch’s blood flowing through his veins activated speed magic in consecution.</p><br/><p>Tae Ho didn’t chase him, for Clarent stubbornly still released power despite having lost its wielder and pressed hard upon the glory of Camelot.</p><br/><p>But such efforts were short lived. Instead of suppressing Clarent with brute force, Tae Ho opted for another option.</p><br/><p>The knights’ souls-they were there to guide Tae Ho along a better path.</p><br/><p>The white light of Caliburn and the red, blackish light of Clarent became entangled. As Clarent’s aura slowly melted into its opponent’s, Tae Ho found that the best word to describe the scene was ‘purification’.</p><br/><p>Camelot’s glory grew weak, but it was no different for the energy of Clarent. Like an exhausted beast, Clarent grew still while Caliburn emanated a faint but steady light.</p><br/><p>Tae Ho let out a long sigh. He dropped Caliburn and looked at his surroundings.</p><br/><p>The area was growing dim, and the knights’ souls appeared like white smoke on a black canvas.</p><br/><p>As they faded, their clear voice rang out like when they’d taught him to purify Clarent.</p><br/><p>“We will always accompany the true King of Camelot.”</p><br/><p>Their pledge was one that transcended even death itself.</p><br/><p>They would remember the day they’d stood next to their king once again.</p><br/><p>The souls of the Knights of the Round Table scattered. They fell into a deep slumber while hoping their king would call them again someday.</p><br/><p>Tae Ho breathed out once more. Instead of sheathing Caliburn, he raised his head to stare at the figure before him. He’d almost forgotten that there was still someone he had to meet, and unlike the Knights of the Round Table, this old man was still very much alive.</p><br/><p>The great magician, Merlin.</p><br/><p>The one that had established Camelot with King Arthur. A living legend.</p><br/><p>He laughed soundlessly with his wrinkled face and recalled the moment when a small kid had pulled out a sword from a stone. It was a beautiful and precious memory.</p><br/><p>‘Merlin. My magician. My friend.’</p><br/><p>Merlin thought of King Arthur’s last moments and cried once again. It had been a very emotional day for him; however, his tears weren’t filled with just sadness.</p><br/><p>He bowed slightly.</p><br/><p>He remembered the final order and request of King Arthur and expressed his manners. He spoke the words he’d once believed he wouldn’t ever able to speak again.</p><br/><p>“The magician, Merlin, greets the king in his return.”</p><br/><p>—</p><br/><p>The night deepened.</p><br/><p>Ingrid, who lay on a bed within the flying ship, spoke in a weak voice uncharacteristic of her usual, business-like demeanor.</p><br/><p>“I’m sorry. I ended up showing you a weak side of mine.”</p><br/><p>She hadn’t been able to withstand even a single blow from Mordred. She had ended up injured as the curse had weakened her body.</p><br/><p>She felt a lot of self reproach, but perhaps it was an unavoidable thing. Mordred and Clarent had been that strong. If Tae Ho wasn’t aided by Idun and Caliburn, he wouldn’t have been a proper opponent either.</p><br/><p>In addition, it hadn’t been long since Ingrid joined the ranks of the Valkyries. Compared to Rasgrid or Reginleif, she was just a newcomer.</p><br/><p>Tae Ho felt at a loss of words. Should he commend her bravery or simply tell her that next time she’ll do better? Was it akin to comforting the juniors of his own team?</p><br/><p>He’d blatantly ignored Cuchulainn’s advice because it seemed like the words of a playboy wanting to seduce a weak girl by taking advantage of her.</p><br/><p>In the end, Tae Ho let out some sloppy words of comfort, and Ingrid smiled in a way that wasn’t like her before gesturing towards Tae Ho.</p><br/><p>“Tae Ho, will you come a bit closer?”</p><br/><p>As Tae Ho approached her, Ingrid grabbed ahold of his clothes to lower his head and pull him closer. She then placed her lips on his forehead.</p><br/><p>“Let Njord’s blessing accompany you.”</p><br/><p>He hadn’t received her blessing in a long while.</p><br/><p>As Tae Ho opened his eyes in surprise, Ingrid smiled and said.</p><br/><p>“For your saga. What did you say you needed for it to be strengthened?”</p><br/><p>For the moment, this was limit of her capabilities.</p><br/><p>Ingrid’s mouth grew neutral, but her eyes continued to smile. Tae Ho smiled at her.</p><br/><p>“You should rest.”</p><br/><p>Ingrid nodded and soon thereafter fell into a deep sleep. The curse of Clarent was quite dangerous, but as the sword had already been purified before Camelot’s glory, she would hopefully recover after a night’s rest.</p><br/><p>‘Ingrid is also a Valkyrie.’</p><br/><p>A valkyrie wasn’t someone that did mere errands for their Gods. They were existences one could mistake as being Goddesses even if their stature was low just like how Adenmaha was a Goddess of Tuatha De Danann.</p><br/><p>Tae Ho went outside after he’d closed the doors and approached the warriors of Valhalla that were speaking among themselves by the fire.</p><br/><p>Bracky was in the middle of a long explanation.</p><br/><p>“So that guy was wracked by guilt and tried to rationalize his actions to protect his sanity. It’s something pretty commonly seen amongst traitors. No. Honestly speaking, you can see it almost anywhere. ‘I didn’t do anything wrong’, ‘I’m not a bad person’, ‘I just wanted to do the right thing’, or whatever. If they try hard enough, they end up believing their own lies and delusions as the truth. One could say it’s a kind of coping mechanism the mind uses.”</p><br/><p>Bracky clicked his tongue as he concluded. He then put on a displeased face and inquired at his audience.</p><br/><p>“Why are you looking at me with those eyes?”</p><br/><p>“Well…contents aside, it’s honestly amazing that you can speak like this.”</p><br/><p>They didn’t even know what he was talking about.</p><br/><p>As Harabal scratched his chin, Bracky’s face grew dark and Siri laughed like usual.</p><br/><p>“Tae Ho.”</p><br/><p>Naturally, the first one to notice him was Siri. He slowly sat next to the warriors of Valhalla and asked.</p><br/><p>“Where are the people from Kataron?”</p><br/><p>“Most of them are asleep. It seemed like today’s events were quite traumatic for most of them. This lady here said that she was going to endure it, but…she eventually passed out too.”</p><br/><p>Bracky gave Tae Ho a cup of hot water as he said this. The lady in question was Helga who lay covered by blankets next to Siri.</p><br/><p>Siri gently stroked Helga’s hair while speaking to Tae Ho.</p><br/><p>“Tae Ho, you should also get some rest. You’ve probably overworked yourself, right?”</p><br/><p>“Yeah. Let’s talk more tomorrow instead.”</p><br/><p>Harabal butted in. As there were many people performing nightly guard duty, there was no need for Tae Ho to continue exerting himself.</p><br/><p>It seemed like Merlin was also exhausted after such an eventful day, not to mention the rest of his long journey, that he was also currently asleep.</p><br/><p>“Right! If that guy shows up again, this Bracky-nim will defeat him, so please relax and go to sleep.”</p><br/><p>Bracky, reliable as always, spoke up while hitting his chest.</p><br/><p>“Then, I will entrust the night to you.”</p><br/><p>“Right. Sleep well.”</p><br/><p>King of Camelot or whatever aside, Tae Ho was still a comrade of Valhalla in Bracky’s eyes.</p><br/><p>Tae Ho finished speaking with Bracky’s group and returned to the flying pirate ship to sleep. After all, one of the ship’s few cabins belonged to him.</p><br/><p>King Arthur, Caliburn, Merlin…</p><br/><p>The Knights of the Round Table…and Mordred.</p><br/><p>Many things had happened in one day.</p><br/><p>Tae Ho grabbed the Unknown sword piece-no, he grabbed Caliburn which had fused to the sword piece’s hilt, and mused over his newest saga.</p><br/><p>The legend-ranked saga, King of Camelot.</p><br/><p>It was a very special saga, especially in comparison to the ones he’d owned previously. It was similar to the ‘Immortal Warrior’ saga that could be said to be the root of Tae Ho’s legend, for it had several smaller sagas inside of it.</p><br/><p>‘Stop thinking about secondary things and go to sleep.’</p><br/><p>Cuchulainn growled in a low voice. Tae Ho perceived his words as valid and decided to follow his advice from outside of battle.</p><br/><p>‘Heda.’</p><br/><p>As he closed his eyes from within the small cabin, he realized he wanted to see Heda again. He suppressed his urge to use the summoning ticket and opened his eyes to call her doppelganger to use it for practice.</p><br/><p>But it was then-</p><br/><p>“Hello again.”</p><br/><p>Heda’s voice was inexplicably heard from above his head.</p><br/><p>&lt; Episode 27 – The sword of selection (2) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}