{"title": "Chapter 94", "id": 94, "volume": 1, "url": "http://boxnovel.org/valhalla-saga-chapter-94", "volume_title": "Volume 1", "body": "<h1>Chapter 94</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 26/Chapter 4: The land of fierce battles (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>The day of Erin’s destruction also marked the demise of Camelot.</p><br/><p>On that day, all of the countries within to Erin, the Land of Darkness included, had been destroyed under the firestorms of Surtr.</p><br/><p>Where the king could not protect his country and citizens, the knights had also failed to protect their king.</p><br/><p>They had all vanished into smoke and ashes.</p><br/><p>Or had they?</p><br/><p>There had, in fact, been survivors amidst the dust.</p><br/><p>One survivor, to be precise.</p><br/><p>—</p><br/><p>Tae Ho blinked.</p><br/><p>Adenmaha and Siri did as well, and it was no exception for Ingrid, Bracky and Harabal either.</p><br/><p>“He….da?”</p><br/><p>Tae Ho’s voice was faint. It was precisely due to the woman that had materialized before them after he’d activated his saga.</p><br/><p>The helmet and armor decorated in wings.</p><br/><p>The pristine, ruby-shaded hair.</p><br/><p>In the eyes of everyone present, it was unmistakably Heda; however, Tae Ho was quick to realize that the Heda in front of him wasn’t the one he knew. Although her smile was unusual for one having been summoned so unexpectedly, Tae Ho was sure for a different reason.</p><br/><p>[Valkyrie One]</p><br/><p>[Idun’s Valkyrie – Heda]</p><br/><p>Through his vision, these green-glowing words calmly floated above the head of the fake Heda.</p><br/><p>Cuchulainn had also realized that this Heda was a fake through a different method. It was easy to miss with all the similarities, but the aura she emanated was assuredly weaker than Heda’s. Calling it a sloppy doppelganger wouldn’t be an understatement.</p><br/><p>‘So it’s a summon… No, shouldn’t it be called a guardian angel?’</p><br/><p>The Heda in front of them was a recreation, one formed by the saga.</p><br/><p>Ingrid realized the truth after Cuchulainn.</p><br/><p>From a different perspective, it wasn’t uncommon for one to form weapons by using a saga. Ingrid recalled the story of a top-ranked warrior that had once summoned an army using the power of his saga during the Great War.</p><br/><p>Still, it was hard to accept the present situation with one’s head.</p><br/><p>Ingrid smacked her lips and then explained her understanding to the other warriors.</p><br/><p>This was a saga that could summon a Valkyrie.</p><br/><p>Ingrid further convinced herself upon explaining it to the rest.</p><br/><p>A saga’s origin was derived from the story behind it.</p><br/><p>However, it seemed the significance of Tae Ho’s saga lay with him meeting a Valkyrie, not the actual identity of the Valkyrie herself.</p><br/><p>The very reason that he’d summoned a guardian angel instead of a real Valkyrie was testament to this notion.</p><br/><p>On the other hand, Tae Ho peered at the green words atop the fake Heda with a doubtful expression.</p><br/><p>‘Why is she called Valkyrie One?’</p><br/><p>If there was a ‘one’, wouldn’t there also be a ‘two’?</p><br/><p>Tae Ho concentrated his mind upon the newly formed saga. His understanding of his own story, one that had begun transcending into legendary status, soon unleashed itself thereafter.</p><br/><p>[Valkyrie Two]</p><br/><p>[Njord’s Valkyrie – Ingrid]</p><br/><p>Without warning, a new Valkyrie appeared alongside the fake Heda. Ingrid, who had been in the middle of an explanation, suddenly looked as though her eyes would pop out of their sockets. Harabal and the rest also revealed shocked expressions.</p><br/><p>‘My God! Are you making a <i>squad</i> of Valkyries?’</p><br/><p>Cuchulainn shouted in disbelief as the fake Valkyrie’s dazzling smile held a stark contrast to the real Ingrid’s face.</p><br/><p>The warrior that had a Valkyrie meet him.</p><br/><p>Supposedly, the number of Valkyries he could register were nine.</p><br/><p>At the same time, he hypothesized that the number of summonable Valkyries would increase as he grew stronger. Still…</p><br/><p>‘She definitely doesn’t resemble Heda.’</p><br/><p>The copies of Heda and Ingrid were half transparent like ghosts, and their auras were far too weak.</p><br/><p>‘The number of meetings and blessings…. or affection…. Anyway, are those variables in all this?’</p><br/><p>He suddenly understood why he wasn’t able to summon Rasgrid or Gandur. Neither of them had ever arose to meet him.</p><br/><p>“Warrior Tae Ho, what is this?”</p><br/><p>Ingrid’s eyes were glued to her doppelganger, and she spoke in a disorientated voice. Based on the glint in her eyes, she had already comprehended her question, but she seemed unwilling to accept her conclusion.</p><br/><p>It wasn’t just her. Bracky and Harabal were also pleading for an explanation with earnest eyes, so Tae Ho decided to elaborate.</p><br/><p>It was a saga that could create lesser copies of the Valkyries whom he had a connection with.</p><br/><p>He could summon a maximum of nine Valkyries, and it was even possible to summon several at once.</p><br/><p>“Good Lord.”</p><br/><p>Harabal looked at the fake Heda and Ingrid with an absent-minded face. Beside him, Bracky’s spirit had been clearly moved.</p><br/><p>“Valkyrie Master!”</p><br/><p>It was a funny title that Bracky abruptly blurted out from nowhere, but it really kind of suited Tae Ho. Bracky was clearly growing ecstatic from his own idea, and he swung his fist and exclaimed.</p><br/><p>“Right! Tae Ho, from now on, you are the Valkyrie Master! You shall embark on a journey to gather all the Valkyries of Valhalla…<i>kuk</i>!</p><br/><p>“I- I’m sorry! It happened on reflex.”</p><br/><p>Ingrid had tripped Bracky by grabbing his ankles and promptly apologized in a bewildered voice. Gauging from her attitude, she seemed to have acted purely out of habit.</p><br/><p>“It…is amazing on several levels.”</p><br/><p>Siri remarked, her eyes lukewarm. Adenmaha then asked a question while pinching the cheeks of the fake Heda.</p><br/><p>“Can’t you summon me as well?”</p><br/><p>“You said you weren’t a Valkyrie.”</p><br/><p>“That’s right, but…….”</p><br/><p>Adenmaha paused, and her face inexplicably bristled as she stepped back.</p><br/><p>Siri smirked at Adenmaha before turning toward Tae Ho.</p><br/><p>“Do they have battle capabilities?”</p><br/><p>“Yes, probably.”</p><br/><p>Heda’s copy had the fastest rate of recreation. He wanted to test her battle prowess and examine her capacity for self control.</p><br/><p>“I’m jealous.”</p><br/><p>“I also want to make them….”</p><br/><p>Harabal and Bracky couldn’t help but moan and reveal their honest opinions. The remaining warriors of the mortal world also held visages of utmost respect.</p><br/><p>But it at that moment-</p><br/><p>“Master?!”</p><br/><p>Adenmaha’s sourness vanished, and she cried out in alarm. Without warning, a strong light had erupted from Unnir which hung at Tae Ho’s waist.</p><br/><p>There was more. Inexplicably, Tae Ho felt the Unknown sword piece begin vibrating violently in its holster. It was the same sensation he’d felt upon first discovering Gae Bolg.</p><br/><p>Tae Ho hurriedly unsheathed the mouth of Unnir and realized that the Liberatuses within were, quite shockingly, bursting with energy.</p><br/><p>Ingrid grabbed her sword reflexively, but Adenmaha quickly stopped her.</p><br/><p>“Stop! It’s the power of Erin. It’s not an enemy!”</p><br/><p>The aura was incredibly bright. It was an energy that seemed capable of eradicating all the darkness throughout the world. A strange feeling overcame the group.</p><br/><p>It didn’t last long, though. After a moment, the light faded away and the Liberatuses reverted to their previous states.</p><br/><p>‘Merlin.’</p><br/><p>Cuchulainn remarked. Adenmaha feverishly nodded as if she’d somehow heard him and spoke out.</p><br/><p>“I’m sure it’s Merlin, since he was the one that made those Liberatuses. Master…..nim, he must have realized that someone had retrieved the Liberatus from Kataron. Right! I’m sure that must be it. Merlin- He’s coming to find you, master!”</p><br/><p>Her words were a mess from excitement, but everyone understood her meaning well enough.</p><br/><p>Cuchulainn also agreed.</p><br/><p>‘It’s just as Adenmaha said. Merlin is undoubtedly searching for you.’</p><br/><p>Ingrid tilted her head in confusion, and Siri took her aside to briefly explain what had transpired in Nidavellir. Appreciation soon became apparent on the former’s face.</p><br/><p>Tae Ho took a deep breath and unsummoned the two Valkyrie doppelgangers. He grabbed his Liberatus and calmed his excitement, although it wasn’t an easy thing to accomplish.</p><br/><p>It was Merlin! None other than Camelot’s Merlin! Of all people, he was someone currently rushing towards them to meet him.</p><br/><p>Tae Ho peered into the Liberatus, and his eyes gleamed with anticipation.</p><br/><p>—</p><br/><p>The knights of Camelot had failed to protect their king.</p><br/><p>The Knights of the Round Table, the guardian protectors of Camelot, were not exempt from this statement.</p><br/><p>On the day of Erin’s destruction, the majority of the Knights of the Round Table were utterly defeated, struck down alongside their king.</p><br/><p>As for the few that barely managed to escape, their continued efforts to protect Asgard were short lived.</p><br/><p>They, who had been deprived of their king, their people, and even the kingdom they’d sworn to defend, continued fighting as the Red Branch Knights did without regard for their own lives. In their grief, they soon fell one after another during the final battles of the long war.</p><br/><p>Thus, the remaining souls of the Knights of the Round Table were extinguished.</p><br/><p>Following their demise, the last vestiges of knights eventually all but vanished from the world.</p><br/><p>But the truth was different, for one yet remained.</p><br/><p>There was a single, lone knight who had survived, and the spirit of Camelot prevailed, burning fiercely from within his soul.</p><br/><p>—</p><br/><p>Tae Ho’s group had decided to postpone the continuation of their journey.</p><br/><p>This was because they had realized how close Merlin was, as the Liberatus’s light had grown very bright and intense.</p><br/><p>Bracky, who was knowledgeable on the geography of Midgard, proposed that there was a great possibility of Merlin having traveled through a water canal connecting to Kataron.</p><br/><p>As the direction Adenmaha had sensed was of the same, approximate direction as Kataron, Bracky’s guess had a high reliability.</p><br/><p>Realizing this, Ingrid did not delay in sending crows to notify Rasgrid and Kaldea of their postponement. She then sent another crow towards Kataron to analyze the situation.</p><br/><p>By the third day, Ingrid became certain of Merlin’s imminent arrival; although, it wasn’t due to any response from the crow.</p><br/><p>Over the past few days, Liberatus had become akin to a compass, shining brilliantly in a specific direction and almost seeming to pulse with an increasing luminosity.</p><br/><p>There was no beating around the bush. Merlin’s arrival was nigh.</p><br/><p>There was a high probability for their paths to overlap, so Tae Ho’s group didn’t make any rash movements. They remained close to the river and waited patiently for Merlin.</p><br/><p>Finally, on their fifth day of awaiting Merlin’s arrival-</p><br/><p>Ingrid’s crow reported the appearance of an old man on a ship.</p><br/><p>—</p><br/><p>The lone knight’s feelings for Camelot had been stronger than all others’.</p><br/><p>Because of his love, each day following Erin’s destruction had been brutally carved into his soul.</p><br/><p>Because of his misery, he did not neglect to notice the light which seemed capable of burning away all the darkness of the world. He couldn’t.</p><br/><p>Because of his passion, the knight advanced day and night to reclaim the glory of Camelot once more.</p><br/><p>—</p><br/><p>Far above them, a dark crow pierced silently through the air. Normally, it would’ve been quite hard to spot a soaring crow in the black of night, but that wasn’t the case for Merlin. For him, the darkness was as clear as any day.</p><br/><p>Merlin’s smile was bright as he lightly shook his staff. The wind that hadn’t ceased for five days grew severalfold to increase the speed of their vessel even more.</p><br/><p>“I can see a ship!”</p><br/><p>Bultan shouted. Helga clung to the mast and peered into the distance. A bright smile rivaling Merlin’s appeared on her face, for she strongly remembered the flying pirate ship that had once sailed through Kataron.</p><br/><p>“Idun’s warrior-nim!”</p><br/><p>Helga waved her hand and laughed. Bultan shook his head as if her actions interfered with his pride as a warrior, and Merlin also chuckled before toking his pipe. While he’d long lost the ability to express joy as Helga did, he was truly very excited.</p><br/><p>Erin’s successor.</p><br/><p>Who could he be? Where did he receive such a title?</p><br/><p>Judging by both Helga’s words and those of the warriors of Kataron, it seemed he wasn’t a bad fellow. No, Merlin rather liked the man in fact.</p><br/><p>Meanwhile, the flying pirate ship had also spotted them.</p><br/><p>Merlin’s mouth soon dropped open in surprise. It was because there was a Goddess of Tuatha De Danann beside the man presumed to be Idun’s warrior.</p><br/><p>She wasn’t a strong Goddess capable of rivaling the chief Gods, but she was a proper Goddess of Tuatha De Danann nevertheless.</p><br/><p>Merlin felt his face flush. His heart beat in such a way that it hadn’t since Erin’s annihilation.</p><br/><p>It was precisely due to these emotions that he couldn’t feel <i>it</i> properly.</p><br/><p>By the time he’d noticed, it was already too late. Even the warriors of Valhalla had sensed it sooner.</p><br/><p>“Helga!!”</p><br/><p>Tae Ho’s bellow shattered the mood like a clap of thunder. He kicked hard into the air and charged as Adenmaha roared and became a ferocious sea serpent. Bracky and Harabal exploded into movement, and Siri rammed bolts into her crossbow.</p><br/><p>Helga whipped her head around far too late as, out of nowhere, a monstrous strike suddenly overwhelmed those onboard. To the consternation of everyone, the vicious attack cleanly bisected both the ship and river beneath it in a single, fluid motion. The assailant, whomever he was, contained a horrifying level of power.</p><br/><p>The doomed ship began its death throes as Helga swallowed a scream, staggering heavily from being caught off guard.</p><br/><p>Their aggressor; he was one who’d long since melded into the darkness.</p><br/><p>One who now appeared to channel the very night itself.</p><br/><p>He was adorned in jet-black armor with a helmet that obscured his entire face; however, Merlin knew immediately his identity.</p><br/><p>How could he not, for the sword he brandished was proof enough by itself.</p><br/><p>The knight easily deflected Siri’s oncoming missile and landed on the ground, promptly swinging his sword a second time.</p><br/><p>Merlin, whose eyes brimmed with tears, tore open his mouth and swore in anguish.</p><br/><p>He cried out the knight’s name in a voice of savagery. A voice consumed by rage and grief amidst a myriad of other emotions.</p><br/><p>—</p><br/><p>The lone knight’s deeds had been forgotten by most.</p><br/><p>He’d sided with the giants on the day of Erin’s destruction. He’d raised the treasure sword, Clarent and struck down King Arthur.</p><br/><p>Perhaps most infamously, he had been the first and final Knight of the Round Table to betray Camelot.</p><br/><p>The knight’s name…was Mordred.</p><br/><p>&lt; Episode 26 – The land of fierce battles (4) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}