{"title": "Chapter 103", "id": 103, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-103", "volume_title": "Volume 2", "body": "<h1>Chapter 103</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 28/Chapter 5: Great Attack (5)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>Gae Bolg became stuck in the ground. The white spear had triumphed over Balor’s evil eye, and it seemed to almost be resting within the dirt after accomplishing such a strenuous task.</p><br/><p>The red dragon soared upwards.</p><br/><p>Upon it, Tae Ho had closed his eyes after taking a deep breath. He welcomed the cold, refreshing wind with a smile.</p><br/><p>The dragon’s name was Shooting Star, the master of flames.</p><br/><p>He was flying with a real dragon.</p><br/><p>There was more. As Bress’ life force faded, an incredible amount of runes was released into the air, and the sensation of victory overwhelmed his body.</p><br/><p>Bress the Tyrant. In his time, he’d been both King of the Fomoires and King of the Tuatha De Danann. He was Erin’s enemy of many years and had been one of the ne’er-do-wells that brought destruction upon Erin.</p><br/><p>The sensation Tae Ho felt from Bress’ defeat was unlike his victory over the giants. Perhaps it was because of the new responsibilities he’d undertaken as successor to Erin.</p><br/><p>The sentence of the Milesians and Erin became clearer in his mind as if rejoicing in Tae Ho’s destiny. Tae Ho could feel joy in Cuchulainn’s words.</p><br/><p>However, Cuchulainn was also a veteran warrior, and he was the first to reemerge from his drunken victory into the battle which still raged around them.</p><br/><p>‘Not yet. There are still many fomoires left inside the rainbow barrier.’</p><br/><p>It was a big accomplishment to be sure, but strictly speaking, he had only defeated a single fomoire. King or not, just as Cuchulainn had said, there were thousands of fomoires still fighting.</p><br/><p>The warriors of Valhalla were fighting desperately against the fomoires. It had become a battle of attrition between the fomoires that sought to escape through destroying the steel structures and the warriors of Valhalla that dyed the land red as they protected the barrier.</p><br/><p>Tae Ho opened his eyes slowly. Honestly speaking, his strength was all but spent. Even ‘Idun’s Warrior’ and ‘King of Camelot’ had faded.</p><br/><p>But there were still things he could do.</p><br/><p>[Saga: The One that Controls Dragons]</p><br/><p>He placed his hand on the scales of the red dragon and several emotions and thoughts were transmitted instantaneously</p><br/><p>The master of flames, Shooting Star.</p><br/><p>A strong existence with a mighty name even among the numerous red dragons during the Dark Age.</p><br/><p>The real Shooting Star was a true monster that was hundreds of meters long.</p><br/><p>In comparison, the dragon which Tae Ho rode upon was somewhat lacking. About ten meters in length, but a suitable size for a dragon knight to handle.</p><br/><p>The soul also belonged to Rolo. It wasn’t actually Shooting Star, the one hailed as King of the Lava Zone.</p><br/><p>But it was indeed a real dragon.</p><br/><p>It was because Rolo had transformed into Shooting Star through the power of the dragon knight and his pact. Although he was rather small, but could still harness the might of the real, legendary dragon.</p><br/><p>So long as he could maintain the transformation, Tae Ho felt it was necessary to educate the fomoires on why the master of flames came to be called Shooting Star.</p><br/><p>Rolo twisted and rolled after receiving Tae Ho’s order. He had made clear that he would only serve Adenmaha as his noonim, but it seemed he was in a good mood after having transformed into a dragon.</p><br/><p>Rolo flipped in the air and then flew towards the direction where the fomoires were gathered. He snarled a meteor of fiery energy and released his draconic fire.</p><br/><p>It wasn’t a mere stream of fire. The blazing sphere was like a miniature supernova as it exploded upon reaching the ground. The nearby fomoires were defenseless to resist.</p><br/><p>Flames billowed into the sky. Rolo flaunted like a majestic beast as he flew through the debris caused by the explosion, and many warriors cheered at the dragon and rider duo while others just stared in awe.</p><br/><p>“He’s really energetic.”</p><br/><p>“Yeah.”</p><br/><p>Reginleif spoke after dropping her magic sword, and Gandur had to agree. Before, he’d often appeared like a tamed horse, but now his visage was that of a wild beast overflowing with energy.</p><br/><p>Bracky looked at Tae Ho and sighed from exhaustion. The effects of the legend-ranked saga, ‘Son of a God’, had disappeared, but the blood of a God still remained in his body. And the overwhelming amount of runes that had poured out of Bress had also helped Bracky recover to a degree.</p><br/><p>He could still fight.</p><br/><p>Bracky acted immediately after he came to that conclusion.</p><br/><p>He dropped his mangled weapon that had been damaged while battling Bress and then extended his hand towards the Valkyries. Among the Valkyries, only Reginleif understood Bracky’s request clearly. She laughed magnanimously and then handed over the sword she was holding.</p><br/><p>“May Tir’s blessing accompany you.”</p><br/><p>Bracky’s forehead was too high up for her to bless him there, so she gave him a blessing on his chest instead. Bracky smirked and knelt down, and Reginleif gave him another, proper blessing as well.</p><br/><p>“I’m going.”</p><br/><p>He spoke briefly and then ran towards Siri without hesitation. The knight bastard he had seen before was going all out against Siri. The place that needed Bracky most was probably over there.</p><br/><p>“Thoor!”</p><br/><p>Bracky roared and drew attention to his presence with a mighty battle cry.</p><br/><p>—</p><br/><p>“Impressive.”</p><br/><p>Loki spoke craftily. He put on a smile mixed with admiration as he moved his hands busily. For mere intermediate-ranked warriors to be able to defeat Bress the Tyrant…. It was entirely possible had he been completely sealed, but the seal had failed because of his own intervention. The efforts of the forces of Valhalla must have been limited with only the seals of the Valkyries.</p><br/><p>‘I suppose…. Is it Idun’s warrior this time too?’</p><br/><p>Loki smiled bitterly and frowned. He was almost at his limit anyways.</p><br/><p>“See you around, brother.”</p><br/><p>Loki activated the several magics he had prepared beforehand and melted into the void. Thor’s thunder tore into Loki’s position a second too late, and in the second it took to eradicate the traces of Loki’s magic, the tricky God had already completely vanished from Thor’s sensory perception.</p><br/><p>“Loki!”</p><br/><p>Thor let out an enraged howl. However no reply came back and another furious rumble of thunder subsequently shook the sky.</p><br/><p>—</p><br/><p>The Magician King, Utgard Loki, frowned upon his throne in Jotunheim.</p><br/><p>He’d evidently sensed the death of Bress the Tyrant.</p><br/><p>‘It’s unfortunate.’</p><br/><p>He thought he would be able to use him a bit longer.</p><br/><p>But it was unavoidable. Valhalla’s attack this time had been really unexpected. Having deployed Loki as a desperate counter to Thor wasn’t something he’d originally planned on doing.</p><br/><p>The Magician King rolled his fingers. He ordered the Giant of Erath, Balgad, who was currently marching toward Kalliv Castle, to retreat.</p><br/><p>‘Valhalla….’</p><br/><p>Valhalla and Midgard.</p><br/><p>The Magician King had ran many calculations. Although Bress the Tyrant was now dead, his absence was merely a single strand removed from a massive web of scheming. The big picture wasn’t damaged. He could still proceed with his plans.</p><br/><p>‘About Garmr’s soul fragment….’</p><br/><p>The Magician King opened his eyes slowly to stare off towards a distant place within Midgard.</p><br/><p>—</p><br/><p>The battle of Kalliv Castle came to an end at dusk.</p><br/><p>In the end, the fomoires hadn’t been able to cross the barrier, and however many thousands they’d numbered were all slain by the warriors of Valhalla.</p><br/><p>The warriors of Valhalla let out whoops of victory. Many Gods of Asgard were praised, and they enjoyed the victory to their heart’s content.</p><br/><p>Unfortunately, the losses the warriors of Valhalla had suffered wasn’t negligible. Almost a fourth of the inferior-ranked warriors had returned to Valhalla to become steel warriors. There were also still quite a hefty number of injured among the surviving warriors.</p><br/><p>But even so, it didn’t mean that the light of victory in this battle was lost.</p><br/><p>The execution of Bress the Tyrant and his fomoires at Kalliv Castle was akin to having partially avenged the tragedy that had befallen Erin.</p><br/><p>Perhaps more importantly, Midgard had become safer. As the warriors of Valhalla existed to protect Asgard and the Nine Realms, none of them could ignore the joy of victory.</p><br/><p>The Valkyrie Reginleif retrieved the corpses of the dead warriors and explained the situation to the bewildered humans that had been trapped inside the barrier and had hidden during the battle.</p><br/><p>Gandur gathered the bodies of the intermediate-ranked warriors and the Valkyries that lost their lives in the battle against Bress.</p><br/><p>Rasgrid, Ingrid, and Kaldea proceeded to make a ceremony so that the ones that lost their lives wouldn’t lose sight of the path beyond. They lit a grand bonfire like they had done in the battlefield of Asgard which shone like a beacon across the darkened landscape.</p><br/><p>“You should just rest since you’re really hurt this time. Don’t go drinking or anything because you won. Go to sleep directly. Understood?”</p><br/><p>Adenmaha was Tae Ho’s buzzkill. It seemed like Rolo really enjoyed having transformed into a dragon earlier, and his face beamed with self-satisfaction, although McLaren had eyes as if he wanted to return as soon as possible.</p><br/><p>“Right, thanks to you too. You should also go to rest.”</p><br/><p>Tae Ho stroked Adenmaha’s head and dodged her nagging. Adenmaha inflated her cheeks but didn’t push away Tae Ho’s hand. She just waited until Tae Ho removed his hand and then snorted.</p><br/><p>“You really…”</p><br/><p>Really what? Adenmaha pouted and then unveiled an anonymous smile before returning to Idun’s residence with Rolo and McLaren.</p><br/><p>Tae Ho waved his hand in farewell and then turned towards his surroundings. Some of the humans who’d survived the battle were helping the warriors of Valhalla to clean the gory residue off the battlefield.</p><br/><p>‘Take Gae Bolg first.’</p><br/><p>Cuchulainn suddenly spoke with an anxious voice. They hadn’t been able to retrieve it after they’d defeated Bress.</p><br/><p>“You really think someone took it?”</p><br/><p>Gae Bolg was a weapon that couldn’t be pulled out if you weren’t a successor of Erin like Tae Ho, just like it was for Caliburn.</p><br/><p>Tae Ho retrieved Gae Bolg from the remains of Bress. He felt like the spear of the God of Light, Lugh, would probably also be near.</p><br/><p>‘Fortunately, the magic pocket is also intact. Well, wasn’t it obvious as we were in the middle of the fight?’</p><br/><p>Be it warriors of Valhalla or Valkyries, they weren’t ones to grow greedy for material items. They had retrieved the magic sword of the Tuatha De Danann which Bress had dropped and his battle hammer, but the magic pocket was still half buried in the ashes.</p><br/><p>Tae Ho picked up the magic pocket. It seemed like it was an item belonging to the Tuatha De Danann that the sentence of the successor of Erin showed a reaction.</p><br/><p>‘Let’s examine it later.’</p><br/><p>It wasn’t Cuchulainn’s words, but Tae Ho’s thoughts. Tae Ho stored the magic pocket in Unnir before turning his head. He then saw Bracky and Siri that sat back-to-back with wide grins rivaling each other’s size.</p><br/><p>“We took care of the traitor.”</p><br/><p>Bracky’s words were spoken slowly, and Siri nodded with an exhausted face. Mordred’s corpse was collapsed behind the two of them.</p><br/><p>“…and Merlin?”</p><br/><p>“He went to assist the Valkyries. It seems like he wants to help on organizing the battlefield.”</p><br/><p>Bracky pointed at Rasgrid, who was proceeding with the ceremony, with his chin.</p><br/><p>Merlin’s face was casual as he recited magical chants, but Tae Ho could sense a deep, solemn aura from his back.</p><br/><p>“He stood at the corpse’s feet for a very long time, and….”</p><br/><p>Bracky closed his mouth, and Siri closed her eyes.</p><br/><p>He had merely heard about Merlin’s and Mordred’s relationship through brief stories, but it wasn’t like he’d been completely oblivious to their connection. He could somewhat understand Merlin’s feelings.</p><br/><p>“You have done well. It was really absurd today too.”</p><br/><p>“You too Bracky.”</p><br/><p>“Siri was also outstanding. Did you see how she fought?”</p><br/><p>“A little bit. She also had a tail, right?”</p><br/><p>Tae Ho looked at Siri for clarification, but she merely blushed and frowned. She didn’t say anything, but looking at how she covered her face with her hands, it seemed like she was quite embarrassed.</p><br/><p>Tae Ho forced himself to not remark at her beauty for her sake, but Bracky had other thoughts. He laughed and spoke brazenly.</p><br/><p>“You were really beautiful and strong. I will see it at a later time.”</p><br/><p>Siri didn’t even react at Bracky’s thoughtless words, and Tae Ho, who knew well enough how her brain operated, prepared to escape while stepping back.</p><br/><p>And a few hours later, when the night was deep.</p><br/><p>When the ceremony and the retrieving of the fallen had ended, the warriors then wanted to begin their traditional feast, but there were still stray fomoires lurking about. More importantly, there was a possibility for the fomoires outside the castle and the city to come seeking revenge, so they just drank a cup and then concentrated on resting and guarding.</p><br/><p>Tae Ho slept in a big room alongside Bracky, Harabal and Siri. As all of them were really exhausted, they fell in a deep sleep as soon as they laid down.</p><br/><p>After an indeterminate amount of time-</p><br/><p>Tae Ho opened his eyes naturally. A green plains was spread in front of him instead of the wall of the castle. As expected, a massive apple tree had also appeared before him.</p><br/><p>Idun’s divine message.</p><br/><p>Tae Ho put on a smirk and waited for Idun to appear.</p><br/><p>She always appeared abruptly to offer greetings.</p><br/><p>But something was off. Idun didn’t speak to Tae Ho. She didn’t even approach him.</p><br/><p>Idun had her back against Tae Ho and was transfixed upon the apple tree. It seemed as if she was entirely unaware of his presence.</p><br/><p>‘Maybe.’</p><br/><p>If that were the case, him being there didn’t make any sense at all.</p><br/><p>Tae Ho approached Idun slowly and made loud footsteps on purpose. Idun turned to look at him.</p><br/><p>She tilted her head a few times instead of revealing the smile Tae Ho had grown to expect and then spoke with an exaggerated voice as if she hadn’t even recognized him.</p><br/><p>“Oh, wow. Aren’t you Tae Ho, the warrior of Heda? I am called Idun, the Goddess of Youth. Ah, but where is my warrior that doesn’t only call for me when he needs it but also when it’s really important? Do you know?”</p><br/><p>Idun smiled inquisitively as cold sweat dripped down Tae Ho’s neck.</p><br/><p>&lt; Episode 28 – Great Attack (5) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}