{"title": "Chapter 101", "id": 101, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-101", "volume_title": "Volume 2", "body": "<h1>Chapter 101</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 28/Chapter 3: Great Attack (3)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>The battlefield smelled as one would think.</p><br/><p>It was nasty and repugnant, and the air was thick with the scent of copper and fish.</p><br/><p>It was the smell of blood, smoke, and death.</p><br/><p>The battle was proceeding fiercely. The fomoires that had hidden beneath Kalliv Castle poured out from cracks and crevices like an army of ants.</p><br/><p>The ones that could fly flew, and the ones that couldn’t charged on foot. Many sprinted towards the rainbow barrier rather than towards the warriors of Valhalla.</p><br/><p>Bress the Tyrant’s senses were keen. He chose to flee rather than lead the fomoires to face the warriors of Valhalla.</p><br/><p>As the fomoires fled to the surface, he decided to go underground. Of course, the fomoires actions were also caused by Bress’ skillful manipulation. He needed scapegoats to buy some time as he ran away.</p><br/><p>Bress mentally reviewed the recent events as he dashed from his throne towards the subterranean network of tunnels.</p><br/><p>This battle wasn’t by coincidence.</p><br/><p>Valhalla had made all the necessary preparations. They were just like a patient hunter who calmly watched their prey flee after releasing an arrow. The patient hunter always caught their victims.</p><br/><p>The rain of steel had fallen down upon Midgard. Such an event hadn’t occurred since the Great Barrier was raised. There hadn’t been only one or two volleys either. The number was enough to completely surround Kalliv Castle.</p><br/><p>Valhalla was undoubtedly aiming for a swift victory, and that was why he had chosen to flee. As always, staying alive was Bress’ top priority.</p><br/><p>If he died, everything would end. He had to stay alive so that he could plan for the next opportunity.</p><br/><p>However, Bress came to a bitter realization as he continued running.</p><br/><p>He probably wasn’t going to be able to escape through the ground.</p><br/><p>Valhalla had had plenty of time for plenty of preparations. From the look of those war machines, there was a really low probability for their operation to have left a path for Bress to escape.</p><br/><p>And his guess was spot on.</p><br/><p>The rainbow barrier didn’t only spread to the ground but also far below it. Every passage of the maze-like tunnel network was blocked. In addition, many of the tunnels’ ceilings had collapsed under the shock generated when the barrier had penetrated through them.</p><br/><p>He couldn’t escape underground. If the barrier was the only problem, he would have pierced through it, but he couldn’t do anything as the passages themselves had been sealed off after crumbling apart.</p><br/><p>Cold sweat streamed down his back, but Bress still let out an unconscious laugh.</p><br/><p>It was because he’d felt Odin’s strong desire to catch Bress.</p><br/><p>His disadvantage grew the more time he wasted, for Odin would then also have more time to act against him.</p><br/><p>What he needed to do was to escape quickly, and he could only think of one method.</p><br/><p>He had to destroy the steel structures that were sustaining the barrier and then break the barrier itself.</p><br/><p>Without a second thought, Bress promptly crashed through the ground toward the surface.</p><br/><p>The fomoire commanders were positioned outside of Kalliv Castle, for the most part. If they could attack the steel structures from outside the barrier, his plan would definitely succeed, but it was a pointless decision. Even if they’d returned to the castle upon realizing the danger, they lacked enough much-needed time.</p><br/><p>Bress thought of Korga and Mordred. They were the forces he could use, but the two of them were already in the middle of battle.</p><br/><p>He knew he’d almost reached the surface, for the putrid scent of battle had started filling his nostrils.</p><br/><p>Bress wasn’t thinking of creating any sort of heroic battle. He ran toward the direction opposite of where Korga and Mordred were fighting. He was planning to charge as a normal fomoire without releasing his power as King. He would only release his might for a moment, but it would be enough to destroy the steel structures after passing through the warriors of Valhalla.</p><br/><p>He didn’t need to disguise himself further, as he’d already thrown his crown aside upon vacating his throne. He, someone once called the most beautiful king of the Tuatha De Danann, was hiding his stunning looks with a straw mat.</p><br/><p>He didn’t even consider of using the humans in Kalliv Castle as meat shields or hostages. It wasn’t because he thought lightly of them.</p><br/><p>He was faced against the warriors of Valhalla. It was absurd to think that Odin’s battle-mad war machines of warriors would grow weak hearted because of such a strategy. They would slash him through any hostage without a second thought.</p><br/><p>Bress finally left the castle. Around him, screams, cries, roars, and cheers had all mixed together to form the cataclysmic orchestra of battle.</p><br/><p>Korga was doing battle to the North, and Mordred slew with his sword anyone foolish enough to attack him. If one had to choose a direction, he was also towards the North.</p><br/><p>Because of that, Bress chose to head directly South.</p><br/><p>The warriors of Valhalla and the fomoires slaughtered each other in waves as Bress charged towards them. He heaved his axe into the warriors of Valhalla that dared to swing their swords at him.</p><br/><p>A sword was easily deflected away by Bress before he slung his axe at the chest of the weapon’s owner. Bress kicked away the surprised, dying warrior and then narrowed his eyes sharply. He rechecked the location of the steel structure once again.</p><br/><p>It wasn’t time yet. He needed to approach a bit more to release his power.</p><br/><p>There was no way the preparations of the warriors of Valhalla would be simple. The moment they discovered Bress, they would surely activate something.</p><br/><p>That was why he had to get closer. He would release his full power when he became certain he could destroy the structure in an instant.</p><br/><p>But right then, as he was about to take one more step.</p><br/><p>Bress could feel it. He hurriedly looked up at the sky.</p><br/><p>A ribbon of bolts were screaming towards him.</p><br/><p>[Saga: The Arrow of the Witch Never Misses its Target]</p><br/><p>The attack came from above at an extreme distance; however, Bress could still see them.</p><br/><p>Idun’s warrior was watching him atop a red dragon as a golden-haired witch pulled on the trigger.</p><br/><p>The ribbon exploded. It exploded even before Bress could properly react. It wasn’t that they were attacking him with the explosion itself. It was a signal.</p><br/><p>The atmosphere all across the battlefield changed the following second. The eyes of the surrounding warriors of Valhalla turned to focus on Bress. Not only that, but the Valkyries that were scattered around started to gather with alarming speed.</p><br/><p>Idun’s warrior….</p><br/><p>Bress didn’t howl and instead donned a face colder than ice. Bress was that kind of person. Impatient and immature kings could only dream of his level of control.</p><br/><p>He no longer looked toward the sky. He even erased the lingering doubt regarding how Idun’s warrior had found him for now. Bress glanced at the steel structure and then released his aura in the form of a massive explosion.</p><br/><p>The unlucky warriors that had been closest to him were incinerated without mercy.</p><br/><p>Blood, flesh, and dust obscured his vision. However, his surrounding had already been memorized by Bress’s eyes. This obviously included the steel structure.</p><br/><p>Bress the Tyrant took a step and his body grew bigger. It was the result of obtaining the body of Cichol, the preceding King of the Fomoires. He, that had been crossbred with a Tuatha De Danann, had a previous height no different from a human’s, but it was different now. His body that had swelled up so suddenly now stood more than three meters tall.</p><br/><p>He took another step. Treasure that had rested inside the magic pocket of the Tuatha De Danann were unleashed into his hands. They were treasures of Erin, a gruesome sword and twisted axe.</p><br/><p>He swung them without pause and the number of deaths on the battlefield soared.</p><br/><p>The sharp whistle of cut wind followed in his wake. The warriors nearest to Bress were bisected in an instant and fell without so much as a scream. The ground was swept up by the aftershock and also became a mess.</p><br/><p>Bress charged across the battlefield toward the other steel structures, but Reginleif blocked his way.</p><br/><p>“Mighty Odin!”</p><br/><p>Reginleif cried out as she hefted her sword. It was a sword she’d used for the ceremony and was not her normal weapon. Runes bursting with the power of Odin covered the exquisite blade and hilt.</p><br/><p>The sword absorbed Reginleif’s magic. The runes emanated a blue light, and Bress couldn’t help but pause momentarily. He’d realized what Odin had prepared against him.</p><br/><p>It was hard to send superior-ranked warriors or above to Midgard due to the presence of the Great Barrier. As a result, Odin had planned to weaken Bress’s strength with warriors below the superior rank.</p><br/><p>It was to the extent that even intermediate and inferior-ranked warriors could face him. This was in order to reduce the number of casualties while fighting him.</p><br/><p>Valkyrie Gandur appeared alongside Reginleif. She was also wielding a sword that had runes carved with Odin’s power.</p><br/><p>The number of Valkyries increased to seven in the next instant.</p><br/><p>Each bore Odin’s magic power in order to weaken Bress substantially.</p><br/><p>But it wasn’t enough. Bress was King of the Fomoires. The reason he’d chosen to escape wasn’t one of weakness. A sword etched with rune magic was a rare sight in Valhalla, but it was naught but wishful thinking to defeat Bress with only that.</p><br/><p>Knowing this, the Valkyries had also prepared something else.</p><br/><p>Reginleif dripped cold sweat and glanced upwards. Even speaking was difficult under the strain of the magic sword, but she still called out in earnest.</p><br/><p>Beyond the sky, and outside the barrier-</p><br/><p>There was someone who responded to Reginleif’s call. An earth-shaking thunderclap was heard far off in the distance.</p><br/><p>Thor, the God of Thunder.</p><br/><p>The strongest God of battle in Asgard.</p><br/><p>He also couldn’t cross the Great Barrier easily. No, it wasn’t only that. The moment Thor descended, a big hole would be torn into the Great Barrier. The entire barrier could lose balance and face destruction.</p><br/><p>As a workaround, Thor had chosen to send his strength to a spot prepared in advance. His objective was to add his own power to the magic made by the magical swords and thus weaken Bress even more.</p><br/><p>Thor took a deep breath and raised Mjolnir. The pure power of a God was concentrated on top of the hammer made using an Unt.</p><br/><p>Thor’s eyes scanned the landscape below him. Now that the magic circle was established, he would be able to transmit his strength without destroying the Great Barrier.</p><br/><p>Thor swung Mjolnir. An overwhelming thunder fell towards the magic circle drawn by the Valkyries on top of the Great Barrier.</p><br/><p>At that moment-</p><br/><p>The thunder changed direction without warning. This was done by Thor himself, for he’d seen that the magic circle above the Great Barrier had suddenly started falling apart.</p><br/><p>It wasn’t that a change had occurred on the ground. The Valkyries were still suppressing Bress. It wasn’t Bress…someone aside from him. At that moment Thor could only think of one being.</p><br/><p>“Loki.”</p><br/><p>“…Thor…”</p><br/><p>A reply was uttered. Loki revealed himself above the Great Barrier as the magic circle was completely erased.</p><br/><p>—</p><br/><p>Reginleif could feel her mouth dry up. She sent an earnest look, but no answer came from the heavens above. Thor’s divine power wasn’t being transmitted.</p><br/><p>How? Why? Why was he delaying it?</p><br/><p>There was certainly no time to think as the situation grew more dire at every passing second. Bress the Tyrant was becoming more accustomed to the magic power which suppressed him.</p><br/><p>They didn’t have the leisure to wait anymore. They had to complete the magic circle now.</p><br/><p>Reginleif’s mouth moved silently and a new rune formed on the magic sword. It was one of the goddess Freya’s.</p><br/><p>As a backup, they could weaken Bress with Odin’s runes and then reinforce the magic with Freya’s runes.</p><br/><p>The seven swords shone more fiercely, but at that moment, Bress also swung his sword.</p><br/><p>The magic circle was completed. Runes were engraved over Bress’s body, but the blood of the Valkyries still dyed the air red.</p><br/><p>Reginleif, who’d had her power sucked out by the magic sword, slumped to the ground and watched on in horror. The body of Erendia, a Valkyrie of Thor’s legion, was crudely sliced in half. The neck of Valkyrie Arund, of Heimdal’s legion, was also cleaved into paste.</p><br/><p>Two Valkyries had died, but that was merely the start. Bress was weakened, but he was still overwhelmingly strong.They couldn’t weaken his power as planned using just the power of the Valkyries.</p><br/><p>“Arund!”</p><br/><p>“Rescue the Valkyries!”</p><br/><p>“Mighty Odin!”</p><br/><p>The surrounding warriors of Valhalla bellowed and charged towards Bress, bloodlust in their eyes. Reginleif wanted to stop them, but no voice came from her mouth. She was too weak.</p><br/><p>Her eyes stung as fresh blood splashed over them once again. Bress massacred the charging warriors of Valhalla mercilessly. In his current state, they couldn’t defeat Bress with inferior-ranked warriors.</p><br/><p>Some inferior-ranked warriors grabbed Reginleif along with the other remaining Valkyries and ran. Gandur muttered something with the little voice she had.</p><br/><p>They had to protect the steel structures. They couldn’t let the barrier break down.</p><br/><p>Bress didn’t get drunk from his massacre. He slashed through the warriors of Valhalla with his sword and axe and then looked at the steel structure. He finished up the warriors assaulting him with fluid motions to then begin reciting a chant.</p><br/><p>It was the magic of the fomoires. As he finished the short chant, the middle of Bress’s forehead split open and a third eye emerged from the gap. It was the eye of none other than the grand King of fomoires, Valor.</p><br/><p>It had an overwhelming power to kill those who entered its vision. The ones capable of carrying a God’s power could resist it, but there were only inferior-ranked warriors surrounding him.</p><br/><p>Valor’s red eye blazed with evil magic, and dozens of inferior-ranked warriors screamed and collapsed. The ungodly eye spent an overwhelming amount of magic power, so much so that Bress himself was only able to unleash it a couple times a day, but he was satisfied with the effects. Bress began approaching the steel structure once more.</p><br/><p>“Halt!”</p><br/><p>“Stop him!”</p><br/><p>Even though dozens of warriors had died helplessly before their eyes, the warriors of Valhalla didn’t hesitate. They advanced toward Bress but with more than just inferior-ranked warriors. The scattered intermediate-ranked warriors had started to gather.</p><br/><p>Bress took a breath calmly and pondered.</p><br/><p>There was a setback in Odin’s plans.</p><br/><p>He saw as much through the reactions made by the Valkyries. Perhaps, the Magician King may have mysteriously intervened as he often did.</p><br/><p>Bress threw the axe he gripped in his right hand towards the warriors of Valhalla and took out another weapon from his magic pocket.</p><br/><p>The spear of the God of light, Lugh.</p><br/><p>The trophy of the Tuatha De Danann when they defeated Valor, the King of the Evil Eye.</p><br/><p>Bress looked at the sky and saw Idun’s annoying warrior as expected. He was in the midst of charging towards him on the red dragon.</p><br/><p>“Tae Ho!”</p><br/><p>Reginleif summoned her strength to shout out as Bress appropriately threw Lugh’s spear with all his strength. The God’s spear that emanated an overwhelming light sailed towards Tae Ho like a harbinger of death.</p><br/><p>Light filled the sky completely and a scream could be heard from Siri. The red dragon that carried them disappeared without a trace and they tumbled forward as Rolo dove to save them.</p><br/><p>Bress waited for Lugh’s spear to return and took out another trophy.</p><br/><p>Unexpectedly, Bracky had charged towards Bress as the latter dealt with Tae Ho.</p><br/><p>[Saga: The Son of a God]</p><br/><p>[Saga: Thunder Enters His Hammer]</p><br/><p>“For Thooor!”</p><br/><p>Bracky let loose a valiant roar as swung his hammer. Coincidentally enough, the new weapon Bress had retrieved was also a hammer. Bress swung his hammer towards Bracky’s without hesitation.</p><br/><p>Both hammers collided with a tremendous boom. A normal person’s bones would have shattered from the vibration alone. The thunder generated by Bracky clashed against Bress’s magic power, but it soon dissipated.</p><br/><p>Bracky’s hammer cracked, but Bress’s was unmarked.</p><br/><p>“Bracky!”</p><br/><p>As Harabal screamed out, Bress swung his hammer once more.</p><br/><p>The mallet crushed down towards Bracky’s head.</p><br/><p>&lt; Episode 28 – Great Attack (3) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}