{"title": "Chapter 118", "id": 118, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-118", "volume_title": "Volume 2", "body": "<h1>Chapter 118</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 32/Chapter 3: The land of darkness (3)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>Generally speaking, there were three types of Valkyries in Valhalla.</p><br/><p>The first was a pure-blooded Valkyrie whose parents were Gods.</p><br/><p>Another was a half Valkyrie who only had one parent as a God.</p><br/><p>The last type was a human warrior that entered Valhalla and became a Valkyrie.</p><br/><p>Tae Ho knew all three of these types well enough as the ‘Valkyrie Master’.</p><br/><p>Valkyrie Reginleif was a pure-blooded Valkyrie. Based on Ingrid’s words, when looking at the pureness of the blood, Reginleif was the best.</p><br/><p>In addition, she was born from the King of Gods, Odin, and a Goddess of Asgard.</p><br/><p>This meant that she was a half sister to the God of Thunder, Thor. Because of that, she possessed a special bloodline even among the other pure-blooded Valkyries.</p><br/><p>Valkyrie Rasgrid and Kaldea were Valkyries who only had one of their parents as a God.</p><br/><p>God and human, God and fairie, God and giant, and more. There were many mixed breeds, and more than half of the Valkyries belonged to this category.</p><br/><p>Rasgrid was a mix breed born from Odin and a light fairy, and she was thus a half sister of Reginleif.</p><br/><p>She boasted of her outstanding abilities suitable for someone that received the blood of Odin, but just by looking at the bloodline, she wasn’t that special. It was because these types of Valkyries could only possess a fourth of Odin’s blood.</p><br/><p>For the third type, Ingrid and Gandur were prime examples.</p><br/><p>Ingrid grabbed the attention of the Valkyries after entering Valhalla as a shieldmaiden and so became one.</p><br/><p>Valkyries that were humans got chosen similarly to Ingrid.</p><br/><p>Gandur had also gotten picked by the Valkyries, but there was a difference with Ingrid. She wasn’t a shieldmaiden but a hunter.</p><br/><p>There were really few cases that a female warrior that wasn’t a shieldmaiden entered Valhalla, so she belonged to the real minority when she was a warrior and also a Valkyrie.</p><br/><p>“Gandur doesn’t treasure Siri for nothing.”</p><br/><p>Ingrid had said while explaining about the Valkyries.</p><br/><p>Looking at it with a modern point of view, Siri was someone that came from the same village of Gandur and got to work in the same place. They were like a junior and a senior from a school.</p><br/><p>The purebloods had the lowest numbers, and the human Valkyries were a seventh or eighth part from the mix breeds.</p><br/><p>There were really scarce Valkyries that didn’t belong to any of these categories, the ones you could call irregulars.</p><br/><p>“Cases like me?”</p><br/><p>“Yes, cases like you.”</p><br/><p>Adenmaha was a Valkyrie that didn’t even belong to Asgard.</p><br/><p>There were few cases after the Great War, that they received refugees from Erin, but there were really a minority.</p><br/><p>In addition, Adenmaha didn’t receive education from the Valkyrie training center that Freya ran. If you also took this into account, then she was an unprecedented case.</p><br/><p>“Mm, I feel good as I became somewhat special.”</p><br/><p>‘But it just means that you are a parachute.’</p><br/><p>Tae Ho just mumbled inwardly as Adenmaha was boasting with a satisfied face.</p><br/><p>“But anyways, it should also be a really special case this time.”</p><br/><p>“Probably, right? Although I doubt they will even allow it.”</p><br/><p>Tae Ho smiled and answered bitterly and stopped walking. He looked at the place he would enter.</p><br/><p>It was the dwelling place of Scathach that was located at the deepest part of Idun’s residence.</p><br/><p>A pure human that belonged to Erin and didn’t even have a little bit of blood from a God flowing in her.</p><br/><p>However, she was Queen of the Land of Darkness. She was an outstanding teacher that had raised peerless heroes like Cuchulainn and was also a great magician that ruled the turbid lands where life and death crossed.</p><br/><p>In addition, Erin was a place that the boundary between humans and Gods was vague. She was a human but was stronger than normal Gods and was a mystical existence.</p><br/><p>Because of that, Tae Ho doubted that Scathach would be able to get recruited as a Valkyrie.</p><br/><p>The case of Adenmaha was closer to being a movement. You could say that she moved from being a normal Goddess A of the Tuatha De Danann to a normal Goddess B of Asgard.</p><br/><p>On the other hand, if Scathach did become a Valkyrie, it wouldn’t be a zero sum game.</p><br/><p>Of course, it became different if she became a high-ranked Valkyrie like a representative of a legion or a Valkyrie lord, but neither such seats were given out easily.</p><br/><p>As it were, the representative Valkyrie of Idun’s legion was Heda. In addition, even if Scathach’s abilities and qualificiations were enough, she still wouldn’t have received any education to become a Valkyrie.</p><br/><p>A representative Valkyrie was someone that represented a legion and at the same time, led all the Valkyries in a legion. They couldn’t put Scathach, that was a foreigner, on that seat.</p><br/><p>“You said that the position of Valkyrie lord was given by Freya-nim who’s the Valkyrie master, right?”</p><br/><p>“Yes, I heard so.”</p><br/><p>The naming of a Valkyrie lord was something that could only be done by the Valkyrie master, Freya, and the owner of Valhalla, Odin.</p><br/><p>With this knowledge, it was impossible to promise Scathach the seat of a Valkyrie lord.</p><br/><p>“Well, it will somehow turn out well.”</p><br/><p>Adenmaha spoke moderately and then took a deep breath. She spoke like this but she was still learning magic of the Tuatha De Danann from Scathach even after she became a Valkyrie. For Adenmaha, she just wanted to dodge the notion that her harsh and strict master could become a coworker of hers.</p><br/><p>Unexpectedly, Scathach nodded too easily when she faced Tae Ho and Adenmaha.</p><br/><p>“Fine. But I have two conditions.”</p><br/><p>Scathach spoke naturally as if she already knew that Tae Ho would come find her.</p><br/><p>“The first is a temporary work. I’m always grateful towards Idun, who took me in after I lost my country and my citizens and had nowhere to go, but I can’t become her Valkyrie forever.”</p><br/><p>Scathach was Queen of the Land of Darkness. Although it was something that would happen in the future, she would have to leave the residence of Idun to rebuild her kingdom.</p><br/><p>Tae Ho nodded. It was because he had already heard from Idun that it was fine to accept her condition.</p><br/><p>Idun also didn’t think that Scathach would remain as her Valkyrie forever.</p><br/><p>“The second condition is an assignment. If you can accomplish it, I will become a Valkyrie.”</p><br/><p>“Me?”</p><br/><p>“Yes, you.”</p><br/><p>Compared to the first condition, the second one was difficult to understand.</p><br/><p>For a condition to become a Valkyrie to be an assignment.</p><br/><p>He couldn’t understand how it would benefit Scathach.</p><br/><p>But it was different for Cuchulainn. He, who had already come to Scathach’s residence before them and was roaming in a spiritual state, laughed and said,</p><br/><p>“Well, the time hasn’t only come, but he has already passed it.”</p><br/><p>“Cuchulainn?”</p><br/><p>Tae Ho looked at Cuchulainn as if asking what he was talking about.</p><br/><p>Although it was only limited to Scathach’s residence, he touched the incomplete Gae Bolg in a spiritual state and said in a low voice,</p><br/><p>“Tae Ho, do you remember when we first met? Back then, I told you that I would become your teacher.”</p><br/><p>He had certainly done so and Cuchulainn had already accomplished quite a lot of that.</p><br/><p>“You did teach me a lot.”</p><br/><p>“Yes, I did teach you various things. I even advised you every time you fought and even transmitted the geass and the sentence of the Milesians.”</p><br/><p>Looking at it like this, Cuchulainn had provided more tutoring than Ragnar, the formal teacher of Tae Ho.</p><br/><p>“But they aren’t proper teachings. I have yet to transmit a single technique of Scathach to you.”</p><br/><p>Frankly, the situation between Tae Ho and Cuchulainn and Tae Ho and Ragnar was really rather vague.</p><br/><p>Normally, if one were master and disciple, the disciple would learn the techniques of the master.</p><br/><p>However, Tae Ho had never learned from Ragnar’s swordsmanship nor Cuchulainn spear techniques.</p><br/><p>“Part of it is because you already have some techniques of your own, but there is another big reason. Do you know what it is?”</p><br/><p>Tae Ho tilted his head. It was because he couldn’t guess easily.</p><br/><p>Ragnar was a warrior that had once climbed to the top rank, but his swordsmanship wasn’t as outstanding as the Knights of the Round Table.</p><br/><p>Knowing this, he didn’t transmit any knowledge of swordsmanship to Tae Ho as he already had Kalsted’s sword techniques. What Ragnar taught Tae Ho was how to use his saga, using the power of a God, or reading the mind of the opponent. Merely basic fighting methods.</p><br/><p>Cuchulainn was different from Ragnar. If Ragnar was a great king, then Cuchulainn was a great warrior.</p><br/><p>In addition, he had his outstanding spear techniques that he took self confidence in as being the best in Erin.</p><br/><p>But even then, Cuchulainn hadn’t transferred his spear techniques to Tae Ho, and it wasn’t because he already had Kalsted’s techniques.</p><br/><p>“You were lacking in skill.”</p><br/><p>Pushing a beast off from a cliff to tell it to fly wasn’t education. It would only lead to an early grave.</p><br/><p>The transmission of a technique was similar. It was impossible to transmit an excessive technique to the ones that didn’t have the ability, and rather, there was a possibility it may destroy the original techniques one had.</p><br/><p>“But it’s enough now. You have remaining skills to learn all of Scathach’s techniques.”</p><br/><p>Tae Ho was now a superior-ranked warrior, and just like Cuchulainn had said, it wasn’t the time, but he had already passed the threshold of requirements.</p><br/><p>Scathach leaned her body on the chair and then said softly,</p><br/><p>“Tae Ho, the assignment I will be giving you is simple. Learn the spear techniques from Scathach’s techniques. If you get to a certain level, I will become your Valkyrie.”</p><br/><p>Just like she had said, it was an assignment.</p><br/><p>Still, he couldn’t understand that at all. It wasn’t something that benefitted Scathach directly.</p><br/><p>Scathach faced Tae Ho’s doubtful face and smiled. She put on the face of a wise master instead of a cat and continued.</p><br/><p>“Didn’t I tell you already? I’m grateful towards Idun for having taken me in. In addition, if I become your Valkyrie, your force will increase as you are a successor of Erin. It’s not a bad thing. You had said that it was the ‘Warrior that had a Valkyrie Meet Him’, right?”</p><br/><p>Only words stated a condition, but she was already planning on becoming a Valkyrie of Idun. And all of that was for Tae Ho, the successor of Erin.</p><br/><p>“Thank you.”</p><br/><p>He couldn’t say anything else besides that as it was really unexpected and he was really grateful. Scathach laughed arrogantly like the Queen of the Land of Darkness which everyone feared.</p><br/><p>“I am a teacher by nature. Raising up a disciple is one of the joys in my life so there’s no need to be that moved.”</p><br/><p>The reason Schathach managed to raise great heroes wasn’t only because she possessed outstanding teaching skills.</p><br/><p>Scathach loved the young ones that had talent, courage, and passion. She sincerely enjoyed teaching those people.</p><br/><p>She would polish gemstones and turn them to jewels.</p><br/><p>She would bloom the talent of the young ones and turn them into heroes.</p><br/><p>Scathach felt joy in all that process. She really was a born teacher.</p><br/><p>“Um, but is it something that can be learnt easily? Isn’t it impossible to do so in a short time?”</p><br/><p>Adenmaha, who’d been just listening silently, raised her hand and asked.</p><br/><p>It was because Idun’s legion needed Valkyries immediately. If they had time to wait for Tae Ho to master all the spear techniques, then they would have just recruited Valkyries from the training center.</p><br/><p>Scathach and Cuchulainn looked at themselves and laughed.</p><br/><p>“Of course it is. That’s why you must use the vision of the Scathach’s techniques. This isn’t something that can be done just by training hard.”</p><br/><p>“A…….vision?”</p><br/><p>Tae Ho asked with a nervous voice.</p><br/><p>For it to be impossible just through hard work alone, what then did he have to do?</p><br/><p>Scathach opened her eyes sharply and smiled. It was the most bewitching and beautiful smile Tae Ho had seen from her until now, and because of that, he grew even more nervous.</p><br/><p>Cuchulainn spoke with a fresh face as if prodding his nerves.</p><br/><p>“You will know if you do it. You already know the style of master, right?”</p><br/><p>Scathach style.</p><br/><p>Tae Ho stiffened up unconsciously the moment he remembered the past.</p><br/><p>Adenmaha, an actual student of Scathach, seemed to have some unwanted memories surface, and she grabbed Tae Ho’s hands tightly and put on a teary face.</p><br/><p>“You have to survive.”</p><br/><p>“Huh?”</p><br/><p>Just what had happened to Adenmaha in the past months?</p><br/><p>But there was no time to ask. Cuchulainn put on a devilish face as if telling Tae Ho to suffer too before grabbing his arm. Scathach spoke with a face filled with joy.</p><br/><p>“Let’s start immediately.”</p><br/><p>“Ri- right now?!”</p><br/><p>“Yes, right now.”</p><br/><p>So that’s why they said that you could enter as you pleased but not go out.</p><br/><p>Scathach smiled sweetly and then rolled her fingers. She activated some magic.</p><br/><p>&lt; Episode 32 – The land of darkness (3) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}