{"title": "Chapter 128", "id": 128, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-128", "volume_title": "Volume 2", "body": "<h1>Chapter 128</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 37/Chapter 1: The one that conquers (1)</p><br/><p>TL: Tsubak</p><br/><p>ED: Julsmul</p><hr/><br/><p>The World Tree, Yggdrasil, started with the beginning of the world.</p><br/><p>Because of that, one could say that the root of Yggdrasil was the beginning and end of the world.</p><br/><p>It was the beginning because the world had started in that place and was the end because it was located in the depths of the world.</p><br/><p>Tae Ho remembered the classes he’d had with Heda every night.</p><br/><p>He had certainly heard about the World Tree when she was explaining about the world.</p><br/><p>The materialized Yggdrasil was merely a part of the real World Tree, but the size of it was so massive that it pierced through the underworld, Niflheim, the mortal world, Midgard, and the world of Gods, Asgard.</p><br/><p>The lower one went in Yggdrasil, the bigger and thicker it became, but the part that was below even Niflheim was really an unknown world.</p><br/><p>One couldn’t find a path in that place that was always covered by a thick fog. Even if they said that it was huge, one might think that they could just climb it, but that wasn’t the case. Normal humans or fairies went down when they believed that they were going up, so they couldn’t grasp their sense of direction.</p><br/><p>It wasn’t an exaggeration to say that the lake of Mimir, Odin’s secret place, was in the middle of that fog. Because of that, no one could get close to it if they weren’t invited.</p><br/><p>‘It’s fine up to the lake of Mimir. If they are Gods with a strong divine power, they may be able to find the right path.’</p><br/><p>But the story changed the lower one got. The really dense fog severed the root from all the other worlds.</p><br/><p>Tae Ho couldn’t understand well what that meant when he was listening to the class. That’s why he just took it as being a severed bridge.</p><br/><p>It wasn’t a completely wrong comparison. It was rather closer to the answer. When Tae Ho climbed down the root by himself, he got to know what severing really meant.</p><br/><p>He couldn’t feel Idun. His connection to her had gotten cut off. Perhaps, she may think that Tae Ho had died.</p><br/><p>Tae Ho tried hard to stay calm.</p><br/><p>Whatever the case, Tae Ho was alive right now and Odin was in front of him, even if he was in an awful state. He would be able to overcome this situation somehow.</p><br/><p>“How much time has passed?”</p><br/><p>“I don’t know exactly. About three or four days may have passed.”</p><br/><p>Odin answered directly Tae Ho’s question. It wasn’t good news. Three or four days was a really long time. He felt a horrible feeling even by imagining what could have happened in their absence.</p><br/><p>The first thing he thought of was the well being of Adenmaha, Merlin, and Ragnar. What had happened to the three of them? Were they able to escape from the World Wolf?</p><br/><p>Tae Ho took out a summoning rock reflexively and inserted magic power into it, but it was pointless. Adenmaha did not appear.</p><br/><p>‘It’s not because she is dead.’</p><br/><p>Because his connection with Idun had also been severed. Even if it was a summoning rock, he wouldn’t have been able to call Adenmaha.</p><br/><p>That’s why it was fine. It didn’t mean anything had happened to her.</p><br/><p>Tae Ho spoke to himself a few times as if trying to calm down himself and looked at Odin. Several things popped in his head, but unfortunately, he couldn’t say it out loud.</p><br/><p>It wasn’t only because he was worried about him.</p><br/><p>He had heard the plan that Odin had come up with from Loki.</p><br/><p>That’s why there was no need to ask it by now. Disrespect aside, asking why his plan had failed was more of a detriment to their situation than anything else.</p><br/><p>“Are there no methods to ascend?”</p><br/><p>Because of that, Tae Ho asked the most important question right now. Odin opened and closed his eyes once and then said with an exhausted voice,</p><br/><p>“It’s not that there are none. It’s only really hard.”</p><br/><p>Tae Ho felt uneasy just by hearing him, but the answer satisfied him for the time being. Because it meant that there was a way to return to Asgard. It wasn’t impossible.</p><br/><p>But of course, returning didn’t mean that it was proper because Asgard would be battling head on against the giants of Jotunheim.</p><br/><p>In addition, the situation was bad.</p><br/><p>There was a high probability for the Gods of Asgard to think that Odin was dead.</p><br/><p>Using the army as an example, the supreme commander had died as soon as the war broke out.</p><br/><p>On top of that, the World Wolf, Fenrir, was added, so one could say that the situation was one akin to a sense of impending doom.</p><br/><p>‘Calm down. Calm down, Lee Tae Ho.’</p><br/><p>Tae Ho took some breaths. If he grew impatient here, escaping would become much more difficult. Just like there was the saying that one had to return the more urgent a situation was, this was now the time to calm himself down.</p><br/><p>“You are calm.”</p><br/><p>Odin smiled bitterly and said in a low voice.</p><br/><p>“Idun’s warrior, before telling you the method to escape this place, I want to express my gratitude to you.”</p><br/><p>Odin rose himself up in a mess and placed his fist upon his chest. He then hit his chest twice and faced Tae Ho.</p><br/><p>“I have been able to stay alive thanks to your aid. I succeeded in changing the despairing fate. I express my thanks as the King of Gods.”</p><br/><p>He was a mess, but Odin was still the King of Gods. It wasn’t easy for him to express his thanks sincerely towards a warrior of Valhalla.</p><br/><p>“I just did what I had to as Idun’s warrior.”</p><br/><p>Tae Ho answered reflexively. When he saw movies or novels he always criticized the characters because they only said sweet words, but now that he was in a similar situation, he didn’t have anything to say aside of those words.</p><br/><p>Odin smiled, and Tae Ho quickly realized something previously unknown to him.</p><br/><p>Odin was a warrior of Valhalla before becoming the King of Gods. Although he was wearing countless masks, his nature wouldn’t be much different to a warrior of Valhalla’s.</p><br/><p>“If we return, and if we do manage to win, I will give you a big reward. I will grant you anything you wish.”</p><br/><p>Odin said with serious eyes as if he wasn’t just saying it as a thanks. His eyes were rather similar to Ragnar’s.</p><br/><p>“Thank you.”</p><br/><p>Tae Ho answered with the most ideal answer this time but then someone clicked his tongue.</p><br/><p>‘You don’t refuse. Right, you have to receive when you are given. Just tell him to marry you to Freya.’</p><br/><p>“Cuchulainn!”</p><br/><p>Tae Ho answered out loud at the voice that rang in his head. It was because it was that nice to see him back.</p><br/><p>Cuchulainn continued speaking when Tae Ho hurriedly took out Gae Bolg.</p><br/><p>‘Why, is it that nice to see me? Do you feel reassured just by listening to my name?’</p><br/><p>Tae Ho nodded. It was because that was indeed the case.</p><br/><p>He was acting rather calm to this situation, but honestly speaking, it was hard on him. He was at the level where he was barely able to stay calm.</p><br/><p>But he felt more relaxed when he heard Cuchulainn’s voice. He felt like he would be able to overcome this just like he had done in previous tight spots.</p><br/><p>Because of that, Tae Ho answered to the first thing Cuchulainn said.</p><br/><p>‘But why does it have to be Freya? Heda is much prettier. Idun-nim could be better than her too.’</p><br/><p>‘I don’t know what expression I should put on at situations like this.’</p><br/><p>Cuchulainn answered as if he was tired of Tae Ho’s opinions.</p><br/><p>But of course, the two of them were joking right now.</p><br/><p>Their joking marked the thankful return of a more composed atmosphere.</p><br/><p>“Is it the Prince of Light?”</p><br/><p>Odin looked at Tae Ho, precisely speaking at Gae Bolg, and asked. Cuchulainn materialized and appeared next to Tae Ho just like he’d done in Scathach’s residence. It was Odin’s magic.</p><br/><p>“It’s been a really long while, King of Gods, Odin.”</p><br/><p>Cuchulainn bowed lightly and expressed etiquette, and Odin nodded.</p><br/><p>“I did hear some stories, but it’s been a while seeing you directly like this. Is it impolite if I say that you look much better now than in the Great War?”</p><br/><p>“No. Your words are right. I also feel that the current me is much better.”</p><br/><p>Because the Cuchulainn in the Great War had gone mad for seeking revenge.</p><br/><p>But it was different now. He had recovered his mental state just like when he’d been renowned as the Prince of Light.</p><br/><p>‘In addition, Master is also here.’</p><br/><p>Scathach, whose location during the Great War had been a mystery to all, was now in Idun’s residence. Cuchulainn was satisfied just by that fact alone.</p><br/><p>Odin still gazed thoughtfully at Cuchulainn before he turned to Tae Ho and said,</p><br/><p>“Let’s proceed with what I was saying. Just like I told you before, there’s a method to get out of here, although that method is really difficult.”</p><br/><p>Odin paused for a moment and then closed his eyes and leaned his ear towards the surroundings. Not long after that, a roar shaking the skies was heard from far away.</p><br/><p>“Do you know who is the owner of that roar?”</p><br/><p>“Isn’t it the wicked dragon, Nidhogg?”</p><br/><p>As Tae Ho answered after he’d remembered the classes with Heda, Odin nodded.</p><br/><p>“Right, that’s true. The black, venomous dragon, Nidhogg, that lives in the roots of Yggdrasil…..You could say that this place is its nest.”</p><br/><p>Several roars were heard after that as if adding further weight to Odin’s words. Odin opened his only eye sharply and said,</p><br/><p>“It has been looking for us since before. It’s obvious for it, the owner of this land, to want to chase away the uninvited guests, but we can’t only evade it. It’s because it is the only method for us to escape this place.”</p><br/><p>“Are you saying….that we will ride on Nidhogg and climb up?”</p><br/><p>As Cuchulainn asked with a doubtful face, Odin shook his head.</p><br/><p>“It’s similar but different. Nidhogg has been entrapped in the roots since the beginning of the world. It isn’t able to leave this place with its own strength.”</p><br/><p>Actually, the problem lay closer to an approval of sorts, but the important thing was that Nidhogg wasn’t able to leave the roots.</p><br/><p>“But there is an existence that can. It’s the only one that can freely go from the roots to the branches of Yggdrasil.”</p><br/><p>“The beast, Ratatoskr……”</p><br/><p>Tae Ho said reflexively.</p><br/><p>He had also learned about this from Heda’s classes.</p><br/><p>The three beasts living in the World Tree.</p><br/><p>The venomous dragon, Nidhogg, that lives by chewing the roots of the world tree.</p><br/><p>The huge, white eagle, Hraesvelgr, that sits in the highest branch and is the origin of all strong winds.</p><br/><p>The squirrel, Ratatoskr, that can freely travel to both sides and made Nidhogg and Hraesvelgr into enemies when they couldn’t even see each other.</p><br/><p>“Right, that’s the only one, and to catch it, we need the help of Nidhogg, the owner of a part of this land.”</p><br/><p>Odin spoke of the method to get away from this place in a terse manner. They could plentily talk about the other things at a later time.</p><br/><p>Cuchulainn, who’d listened to all the explanations of Odin, put on a thinking face and then asked,</p><br/><p>“Odin, is Nidhogg certainly a dragon?”</p><br/><p>“That’s right. It’s an ancient dragon that ranks supreme even among its own kin.”</p><br/><p>Cuchulainn turned to look at Tae Ho at Odin’s answer. Tae Ho also nodded as he knew why Cuchulainn had asked if it was a dragon or not.</p><br/><p>Tae Ho’s saga, ‘The One that Controls Dragons’.</p><br/><p>But of course, his adversary was the ancient beast, Nidhogg. They couldn’t know how much Tae Ho’s saga would work.</p><br/><p>But there was still a probability as it was a dragon. One could say that it was a ray of hope.</p><br/><p>Cuchulainn checked Tae Ho’s smile and then asked with a more serious expression,</p><br/><p>“Then, Odin, I will ask you one more thing. It’s something really important.”</p><br/><p>“What is it, Prince of Light?”</p><br/><p>Odin also answered with a serious expression. In addition, Tae Ho gulped dry saliva at the serious atmosphere.</p><br/><p>And Cuchulainn finally opened his mouth and asked,</p><br/><p>“Is Nidhogg a male or a female?”</p><br/><p>“Uh….what?”</p><br/><p>Odin blinked his eyes and asked back, and Tae Ho put on a dumbfounded expression.</p><br/><p>—</p><br/><p>“What, did I say something wrong? It is important.”</p><br/><p>&lt; Episode 37 – The one that conquers (1) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}