{"title": "Chapter 160", "id": 160, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-160", "volume_title": "Volume 2", "body": "<h1>Chapter 160</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 48/Chapter 1: The fastest one #2 (1)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>The residence of Idun was peaceful.</p><br/><p>That was because the members of the legion had received an order to stay behind in Valhalla to defend it while waiting in the residence. Their commander Tae Ho had also received the order to be on standby.</p><br/><p>The hundred newly entered lowest ranked warriors were doing basic training under Scathach’s lead in the training grounds that McLaren grounded down.</p><br/><p>Scathach didn’t differentiate from men and women. It wasn’t because she ignored the qualities of each warrior or the differences in their physique.</p><br/><p>It was because when you started to accumulate runes, the physical abilities became meaningless except for really special cases like Bracky.</p><br/><p>The princess of Kataron Helga, who was in the front line, concentrated on her training while sweating like rain. Her swordsmanship using a sword and a shield was as simple as her personality but it was also solid with few flaws.</p><br/><p>The scene of a hundred warriors doing basic training in a single place was a really grand sight.</p><br/><p>And on top of that, the skills of each warrior were all outstanding as they had managed to enter Valhalla.</p><br/><p>If it was a gathering only of people that sweated you would have felt hot just by looking at them but as it was a joint training between the ones that were called for having superior skills, you felt something rising in your chest on its own.</p><br/><p>Because of that Nidhogg looked at the training of the warriors with shining eyes.</p><br/><p>At first she tried to imitate them but she fell alone even when walking on a flat ground. As she kept repeating the process of falling and pawing in the air she just decided to watch in the end.</p><br/><p>It was really cute to see Nidhogg looking at them under the shade while placing her chin on her hands but Scathach just glanced at her.</p><br/><p>Actually, Nidhogg should be training on the origin mystical magic instead of watching.</p><br/><p>The reason she obtained freedom was because of Tae Ho.</p><br/><p>The dispatchment of an investigation team with Tae Ho as the captain.</p><br/><p>You couldn’t know when Tae Ho would use a summoning rock to call Adenmaha or Nidhogg. Actually, the probabilities for him calling Nidhogg were really low now that she had lost her magical body but the ‘just in case’ always existed.</p><br/><p>If he called her when she had spent her magic power completely she would really become luggage for Tae Ho.</p><br/><p>Nidhogg seemed happy to have been excluded from the harsh training but it was different for Adenmaha who was sitting next to her.</p><br/><p>She was acting calm for Nidhogg, but the anxiety in her eyes couldn’t be hidden.</p><br/><p>She was worried about Tae Ho.</p><br/><p>Only ten days had passed since he defeated the Magician King and the World Wolf.</p><br/><p>It was too short. He lacked rest to completely recover.</p><br/><p>Something else bothered her on top of that.</p><br/><p>The Valkyries that didn’t return from Olympus. Rasgrid had got her signal cut off in the path leading to Olympus.</p><br/><p>She was uneasy. She felt like something big was about to happen.</p><br/><p>She didn’t feel like resting even though she was as she thought that Tae Ho may be in danger.</p><br/><p>If Adenmaha could choose between receiving a harsher training and Tae Ho’s safety she would choose to train without hesitation.</p><br/><p>“Adenmaha, are you hurt somewhere?”</p><br/><p>Nidhogg tilted her head and asked. Nidhogg got really bright while staying with Tae Ho’s group but there were times that she still showed uneasiness and fright.</p><br/><p>Because of that Adenmaha forced a bright smile.</p><br/><p>“No, I’m not. Something just bothers me.”</p><br/><p>She couldn’t not lie completely as Nidhogg wasn’t a fool. She was unexpectedlyquick witted perhaps because of the time she spent with Ratatoskr.</p><br/><p>Nidhogg pouted her lips slightly at Adenmaha’s words and was depressed but then put on a smile. She pointed at the direction of the wooden dock and asked.</p><br/><p>“Do you know if Tae Ho master will be late today?”</p><br/><p>Adenmaha always brightened when they talked about Tae Ho and Nidhogg herself also wanted to see him.</p><br/><p>But contrary to Nidhogg’s expectation, Adenmaha spoke with a rather dark expression.</p><br/><p>“He may not come today.”</p><br/><p>It was quite far between Asgard and Olympus. In addition there was no way the search for Rasgrid would go smoothly. There was also the possibility he would stay outside for more than a month.</p><br/><p>Nidhogg was depressed once again at Adenmaha’s answer and then turned to look at the restaurant.</p><br/><p>“I can’t see Heda.”</p><br/><p>“She’s a bit busy today.”</p><br/><p>Heda was also in stanby just like Adenmaha and Nidhogg were, waiting for Tae Ho’s call.</p><br/><p>Now that she had awoken Idun’s personality she didn’t stay in the restaurant or the lodging like usual but was in the shrine.</p><br/><p>She didn’t speak with her but Heda would be feeling the same way as her.</p><br/><p>‘How many people are you going to make feel bad really.’</p><br/><p>Adenmaha blamed him inwardly but it was only for a moment.</p><br/><p>‘He will be fine. Master is strong. He even defeated the Magician king and the World Wolf.’</p><br/><p>Tae Ho that said he would protect Adenmaha on the boat heading to Vanaheim. He, who didn’t fall back even by one step in front of the ferocious attacks of the Magician king and protected her.</p><br/><p>Her resentment could only melt like snow. She felt her heart beat just by thinking of what happened on that day.</p><br/><p>‘I’m also in a serious state.’</p><br/><p>The self criticism that started with worry continued for so long. Nidhogg, who was looking at Adenmaha from a side, opened her arms and played affectionately.</p><br/><p>Nidhogg played really affectionately with Tae Ho and Adenmaha. Scathach rebuked them saying that it would become a habit for her, but Adenmaha still thought of receiving Nidhogg’s affection.</p><br/><p>Since the affection she couldn’t receive would be overwhelming, Adenmaha thought that at least she would receive her.</p><br/><p>But it was when she hugged her.</p><br/><p>She felt like she was the one getting hugged rather than being the one that gave it because of the height difference but it seemed like it wasn’t her misunderstanding.</p><br/><p>“Are you fine now? I feel more relaxed after I do this.”</p><br/><p>Nidhogg, who embraced Adenmaha, whispered in a low voice.</p><br/><p>Only then did Adenmaha realize why Nidhogg had told her to hug her. Nidhogg didn’t want to get embraced but she was the one that wanted to hug her.</p><br/><p>Nidhogg was called the black dragon but her embrace was really warm. Adenmaha smirked and then answered while burying her head on Nidhogg’s chest.</p><br/><p>“I’m fine. Thank you Nidhogg.”</p><br/><p>“Ehehe.”</p><br/><p>Nidhogg carefully stroke Adenmaha’s back and head just like Tae Ho usually did to her. She got courage and said in a low voice.</p><br/><p>“You know, Nidhogg really likes Adenmaha.”</p><br/><p>The words she couldn’t say to Ratatoskr because she was afraid. The words that only had sharp words returned at her.</p><br/><p>But Adenmaha was different. No, in the first place Nidhogg was also different because she liked Adenmaha for real compared to Ratatoskr who she had to force herself to like it.</p><br/><p>“I also like you.”</p><br/><p>Adenmaha answered gently. She had already heard this answer a few times but Nidhogg still felt her chest tear down. She was planning to console Adenmaha but felt like she was the one being consoled.</p><br/><p>Nidhogg put on an almost teary face but then smiled brightly once again. She leaned on Adenmaha’s body and her eyes started to close by its own.</p><br/><p>“Adenmaha’s embrace is really warm and soft…..slee…….py……”</p><br/><p>Nidhogg still slept a lot even after getting out of the roots as she spent most of the day sleeping when she was down the roots.</p><br/><p>Adenmaha laughed unconsciously and patted her back.</p><br/><p>“Wake…..me up…..when Tae Ho master comes.”</p><br/><p>She was at her limit. Nidhogg entrusted her body to Adenmaha and her consciousness to the sleepiness.</p><br/><p>Adenmaha looked at a distant place while still holding Nidhogg. Scathach was looking at them as if it was absurd and the warriors that were resting from their training put on good faces like they had seen something really nice.</p><br/><p>Adenmaha flushed unconsciously and pouted but she couldn’t throw away Nidhogg because of that. She looked at the direction where the dock was at.</p><br/><p>‘Master.’</p><br/><p>She called for Tae Ho.</p><br/><p>&amp;</p><br/><p>‘He’s coming!’</p><br/><p>Cuchulainn yelled the moment Achilles showed himself.</p><br/><p>Actually, he looked at the group for a moment and then charged forward even before Cuchulainn could finish his sentence.</p><br/><p>Achilles.</p><br/><p>Tae Ho also knew this name.</p><br/><p>The great hero of Troy that had the blood of the Goddess Thetis.</p><br/><p>The man whose fame was right below Heracles’s.</p><br/><p>He was a warrior of Olympus. Just like Asgard took in the souls of the warriors of Midgard and rebirthed them as a warrior of Valhalla, Olympus returned to life the great warriors of the mortal world and placed them as the protectors of Olympus.</p><br/><p>Achilles was a warrior of Zeus. Then, why had he massacred the warriors of Valhalla? Why was he attacking them?</p><br/><p>Tae Ho didn’t think about it. This wasn’t the time to think.</p><br/><p>Tae Ho moved the moment Achilles charged forward. He gripped Gae Bolg instead of pulling out a new sword. He grasped the target Achilles had with the insight of Scathach’s techniques.</p><br/><p>The one Achilles was aiming for was Ingrid.</p><br/><p>Tae Ho was the strongest in the group. Bracky and Siri came next and Rasgrid was the strongest among the Valkyries.</p><br/><p>In addition, Rasgrid gathered everyone’s attention with her loud yelling, that’s why she was eye catching. She wasn’t a good target.</p><br/><p>The weakest one.</p><br/><p>And someone that wasn’t receiving attention from their surroundings.</p><br/><p>The one that was moving unnaturally as if she had received an injury.</p><br/><p>All of these conditions pointed at Ingrid. He grasped that truth just by looking at the group for a moment and then charged towards her without hesitation.</p><br/><p>It was a really fast charge. Bracky reacted but he couldn’t see that Ingrid was his target so he couldn’t do anything. Siri had also lost the timing.</p><br/><p>Ingrid moved her hands hurriedly while watching Achilles charge towards her but it was too late. In addition, her hands were slower than usual because of the injury she had.</p><br/><p>She would be stabbed.</p><br/><p>It was when she thought that.</p><br/><p>Paching!</p><br/><p>Gae Bolg parried away Achilles’ spear with a sharp sound. The moment Achilles’ spear was parried it changed its trajectory. It slipped away from Tae Ho and Ingrid like thunder and appeared far away.</p><br/><p>Achilles glared at Tae Ho. Tae Ho covered Ingrid and glared back at Achilles.</p><br/><p>He could feel some presences behind him, the aura of the strong beings that he sensed when he first sensed Achilles.</p><br/><p>“They are Myrmidons! And there are 7 of them!”</p><br/><p>Rasgrid yelled quickly.</p><br/><p>The Myrmidons, who were Achilles’ elite forces, boasted of their individual strength but were experts in collective movement.</p><br/><p>But Tae Ho didn’t turn to look at them. He cut off all his interest towards them.</p><br/><p>He would leave them to Bracky and Siri. The two of them were more than enough to face them as they could be said to already be superior ranked warriors that only haven’t gone through the ceremony. In addition Rasgrid and Gandur weren’t luggage. They were also outstanding warriors.</p><br/><p>[Saga: The eyes of the dragon sees through everything]</p><br/><p>He looked at Achilles and more things than he expected entered his eyes.</p><br/><p>[Commander of the Myrmidons]</p><br/><p>[Prototype of Patroclus]</p><br/><p>[Fake Achilles]</p><br/><p>‘Indeed.’</p><br/><p>A fake instead of the real one.</p><br/><p>Patroclus was Achilles’ best friend who had worn his armor and helmet and pretended to be him in the war against Troy.</p><br/><p>He didn’t know much about Olympus but he felt like they would be able to recreate a fake Achilles if they had a strength similar to the saga.</p><br/><p>‘He’s not an easy foe. Just by looking at his movement speed, he’s faster than you.’</p><br/><p>Cuchulainn said in a low voice and Tae Ho agreed with him.</p><br/><p>Achilles was the one that had the fastest feet among the heroes of Olympus.</p><br/><p>Even if he was a fake, it was really obvious that he was still fast.</p><br/><p>Then what could he do?</p><br/><p>Would he use techniques or strength in front of an opponent using using speed?</p><br/><p>Tae Ho thought of another thing.</p><br/><p>He changed his stance holding Gae Bolg and activated his saga.</p><br/><p>[Saga: Equipment of the dragon knight]</p><br/><p>The Warrior’s equipment changed once again when the synchro rate passed 80%. The only things that weren’t strengthened were the sagas related to Valkyries.</p><br/><p>[Boots of speed]</p><br/><p>[Ghost dancer]</p><br/><p>[Zephyr headband]</p><br/><p>[Frost dragon armor]</p><br/><p>[Necklace of gale]</p><br/><p>Five kinds of equipment appeared over Tae Ho’s body. They were all used by Kalsted in Dark Age and they shared another similarity besides that.</p><br/><p>The movement speed and attack speed option.</p><br/><p>The setting that makes you quicker while ignoring all the other aspects. The extreme movement setting.</p><br/><p>The fake Achilles charged forward but at that moment Tae Ho also charged at him.</p><br/><p>‘What?!’</p><br/><p>Cuchulainn was bewildered. He cursed once again saying that it wasn’t a saga but a cheat and laughed.</p><br/><p>The fake Achilles became a gale. He moved at an overwhelming speed.</p><br/><p>But Tae Ho didn’t fall behind to him even by a little.</p><br/><p>Faster than a gale.</p><br/><p>Tae Ho’s movements started to overwhelm Achilles’.</p><br/><p>&lt; Episode 48 – The fastest one #2 &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}