{"title": "Chapter 163", "id": 163, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-163", "volume_title": "Volume 2", "body": "<h1>Chapter 163</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 49/Chapter 2: The Goddess of warfare Athena (2)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>“This story should be too sudden and bewildering. I understand. I would have shown the same reaction if I had heard the same thing from another person. That’s why if you have any doubts, you can just ask me. I will do my best to answer.”</p><br/><p>Patroclus spoke with a serious tone. It didn’t look like he was intending to do it but his actions and peculiar way of talking made him look like a scene from a movie.</p><br/><p>The Valkyries exchanged glances quickly. Gandur and Ingrid nodded and Rasgrid turned to look at Tae Ho. He nodded at her gaze that seemed like she was asking for permission.</p><br/><p>“Patroclus, first of all we apologize that we were late on our introductions. I’m Valkyrie Rasgrid of Odin’s legion. I’m really grateful you came to rescue me.”</p><br/><p>Rasgrid stood up and lightly hit her chest with her right hand. The two of them hadn’t even exchanged names because the situation flowed too hurriedly.</p><br/><p>Patroclus politely responded to her etiquette and Rasgrid introduced Tae Ho immediately after that.</p><br/><p>“This is the commander of Idun’s legion, Lee Tae Ho-nim.”</p><br/><p>“I’m Idun’s warrior Lee Tae Ho.”</p><br/><p>Tae Ho also expressed good etiquette. Gandur stood up after him and said.</p><br/><p>“I’m Gandur a Valkyrie of Ullr’s legion. And this is Ingrid of Njord’s Valkyrie.”</p><br/><p>Ingrid was sweating struggling compared to the relatively fine Gandur. Her injuries hadn’t healed completely but Zeus’ divine power outside of the cave was giving her a bad influence.</p><br/><p>Adenmaha stood up while Gandur protected Ingrid.</p><br/><p>“I’m Adenmaha a Valkyrie of Idun’s legion. This is Nidhogg of my same legion and this is Rolo.”</p><br/><p>Nidhogg bowed down. Rolo just glanced at Patroclus like he didn’t care and then dropped his body once again.</p><br/><p>Rasgrid opened her mouth once again when the simple self introductions ended.</p><br/><p>“Patroclus, I will ask something taking into account that what you have said is all true. What is the reason Zeus-nim and the other Gods turned to the side of the ones wanting to destroy the world?”</p><br/><p>The fact itself was really shocking but they had to look over it.</p><br/><p>Patroclus frowned at Rasgrid’s question and answered while dropping his shoulders.</p><br/><p>“I don’t know either.”</p><br/><p>“What?”</p><br/><p>Gandur raised her voice. Patroclus let out a sigh at her eyes asking if he was kidding.</p><br/><p>“I understand how you feel but I don’t know the reason. Only, Athena-nim said this, that Zeus may still be fighting.”</p><br/><p>He spoke of something without much sense but that wasn’t the case for Adenmaha. The clever valkyrie tilted her head slightly and asked.</p><br/><p>“Fight? With himself to prevent himself from turning into someone wanting to destroy the world?”</p><br/><p>Nidhogg blinked and imagined Heda and Idun fighting but it was a wrong example.</p><br/><p>Patroclus nodded and said.</p><br/><p>“I’m not sure of it but Athena has taken that possibility into account.”</p><br/><p>Zeus who was someone that wanted to maintain the world but turned into wanting to destroy it.</p><br/><p>But he hadn’t changed completely. There was a process in which he changed and Zeus was still resisting the change.</p><br/><p>You could interpret several things with this. If what was mentioned was true, then Zeus wasn’t changing by his own will.</p><br/><p>“Can’t you tell us in more detail? Like the reason why Hera-nim and Athena-nim are certainly Gods that haven’t turned their backs?”</p><br/><p>Gandur calmed down her excitement and asked in a low voice.</p><br/><p>She had the most rushed temperament among the Valkyries gathered in this place but it didn’t mean that she was foolish. She was also an experienced and capable Valkyrie.</p><br/><p>“I don’t exactly know when the change started but the noticeable changes occurred about two months ago.”</p><br/><p>‘It’s a similar time to when Asgard started to get shaken off. It’s too coincidental to call it one….but we have no reason to say that it wasn’t coincidence.’</p><br/><p>Cuchulainn said in a low voice. Just like he had said, there was no way to know if it was simple coincidence or if there really was a connection.</p><br/><p>Patroclus continued speaking.</p><br/><p>“There was a big change in the sky of Olympus. A loud sound and explosions occurred in the palace where the Gods resided at…..and it’s a bit disrespectful to say this but Zeus started to run wild.”</p><br/><p>Patroclus closed his eyes tightly as if he was afraid just with imagining what had happened.</p><br/><p>“The lightning of wrath covered the entire mountain of Olympus and many people residing in Olympus lost their lives.”</p><br/><p>The fairies and lesser Gods.</p><br/><p>The ones that got permission to live in the mountain of Olympus by the Gods.</p><br/><p>“I was outside Olympus that day so I could evade the wrath. Precisely speaking, I was out and was returning and I saw it on that day. That the queen of Gods Hera used her strength desperately to try to stop Zeus-nim. The clash made by the strongest God and his wife created an explosion and it shook the entire mountain of Olympus.”</p><br/><p>He couldn’t see until the end. It was because he got swept in one of the explosions and lost consciousness.</p><br/><p>“Everything ended when I regained consciousness. The mountain of Olympus that was filled with fresh verdure was filled with death and despair and the usually bright sky got dyed in ash gray.”</p><br/><p>Bracky and Siri thought of Erin at the word ash gray. The sky and ground of the destroyed Erin was completely ash gray.</p><br/><p>“Athena barely managed to escape the mountain of Olympus with a serious injury. I also followed her at that time and left the mountain.”</p><br/><p>That was the reason Patroclus mentioned Hera and Athena as Gods that hadn’t changed.</p><br/><p>“The mountain of Olympus isn’t the only thing that changed. First, the sea started to change and then the ground did. Almost half of the world turned that way in only two months.”</p><br/><p>Patroclus finished his story with a voice filled with sorrow and then looked at the Valkyries once again. Rasgrid spoke with a face as if she had eaten something sour.</p><br/><p>“The proof that Zeus has become someone wanting to destroy the world is the testimony of Athena-nim.”</p><br/><p>What Patroclus had seen was the crazy Zeus, not Zeus that claimed that he had changed sides.</p><br/><p>In the end, the only thing that could be called to be a proof was Athena’s claim.</p><br/><p>Patroclus smiled bitterly.</p><br/><p>“She is a Goddess of another world. It’s obvious to be doubtful about her even though it’s disrespectful for us. But you will realize it when you get out of the path and enter Olympus. Some kind of aura filled up the changed land. That land resembles Tartarus, the land of the titans.”</p><br/><p>It was a place like Jotunheim if it was compared to Asgard.</p><br/><p>“Just like you have felt it earlier, the divine power that cut off the path belongs to Zeus-nim. Athena-nim had already predicted this outcome and this also means that its proof that Zeus-nim is still fighting.”</p><br/><p>Patroclus pointed at the direction of the entrance of the cave. It was a merciless and cruel divine power that didn’t even have a hint of gentleness.</p><br/><p>Adenmaha returned to the point once again.</p><br/><p>“Because he wouldn’t be wasting time like this if he had completely switched sides?”</p><br/><p>“That’s exactly the case. Olympus hasn’t changed completely even though it is changing quickly. I wonder if the reason he cut off the path to Asgard was also to buy time.”</p><br/><p>Gandur also nodded. She licked her lower lip as if organizing her thoughts and said.</p><br/><p>“So it’s something like this? Zeus turned to become someone that wanted to destroy the world because of an unknown reason but he hasn’t changed completely. He’s holding himself back from completely turning. But the change is still taking place and at some point Zeus and all of Olympus will become beings that want to destroy the world. And when that happens, the war between Asgard and Olympus will take place.”</p><br/><p>“That’s right. Athena-nim also said that.”</p><br/><p>It was a clean summary.</p><br/><p>Tae Ho thought over the story.</p><br/><p>‘So Olympus will become Jotunheim.’</p><br/><p>The giants of Jotunheim were certainly beings that wanted to destroy the world but they didn’t want to ruin it by themselves.</p><br/><p>If Olympus turned to become like Jotunheim, it wouldn’t be weird for them to attack Asgard.</p><br/><p>Even if they prioritized the destruction of Olympus, there was a high probability that the forces would go to war with the ones wanting to maintain the world of another world just like it was the case for the fomoires after the destruction of Erin.</p><br/><p>‘The Kingdom of Fire.’</p><br/><p>The existence of the association he heard from Ragnar gave persuasiveness to the story.</p><br/><p>Tae Ho could understand why the Magician King didn’t cut the path leading to Olympus.</p><br/><p>“If all of this is true….who is the one behind it?”</p><br/><p>Gandur said in a low voice. She spoke as if asking it to herself.</p><br/><p>“Not even the Magician King could do something like this and that was the same for the king of fomoires.”</p><br/><p>‘The Kingdom of Fire.’</p><br/><p>Tae Ho thought of them once again.</p><br/><p>But they were mere probabilities. He couldn’t be certain of it yet.</p><br/><p>‘But if it’s really their doing…..’</p><br/><p>This could also happen in Asgard.</p><br/><p>‘I know what you are thinking about but don’t rush it. Asgard and Olympus are different just like Erin and Asgard are different. There are two big groups divided in beings wanting to destroy the world and maintain it but the roots of the Gods of Olympus and Asgard is different. That also goes for the Titans of Jotunheim with the giants.’</p><br/><p>Cuchulainn spoke quickly. He didn’t lose his sharp insight suitable of a master of Scathach’s style techniques.</p><br/><p>Tae Ho also nodded. There were still many things he didn’t know about the current situation. He needed more information.</p><br/><p>“If your doubts have been cleared to a certain extent….I think that we should leave this place first.”</p><br/><p>Patroclus looked at Ingrid. It wasn’t as much as Adenmaha or Nidhogg but she hadn’t been a Valkyrie for long like Rasgrid or Gandur.</p><br/><p>In addition, she was a Valkyrie that was originally a Shield maiden. Her capacity to resist her own divine power or from others could only be weak compared to Rasgrid, who was Odin’s direct daughter.</p><br/><p>Gandur carefully caressed Ingrid’s pale cheek.</p><br/><p>And it wasn’t only because of Ingrid. If they didn’t hurry, the path would completely close and they wouldn’t be able to return to Olympus.</p><br/><p>“Do you know somewhere we can hide?”</p><br/><p>Patroclus smiled bitterly at Adenmaha’s question.</p><br/><p>“There’s a place I hid for a moment before heading to Asgard. And for now……i’m planning to return to Athena-nim.”</p><br/><p>He had failed his job of notifying Asgard of the danger. Now that it turned out like this, he just hoped that some other person succeeded in his job.</p><br/><p>Tae Ho thought of Idun once again. If it was Idun and Heda, they would have determined the general situation to some extent even if it wasn’t to the point of the story they heard from Patroclus.</p><br/><p>‘It seems like the best we can do now is to help Athena.’</p><br/><p>Cuchulainn’s words were right. Tae Ho stood up from his place and said that he would help Patroclus.</p><br/><p>“I understand. Follow me then. The path is harsh so be careful.”</p><br/><p>Patroclus forced a smile and then moved deeper into the cave rather than the entrance.</p><br/><p>Gandur grabbed Ingrid with both of her arms and approached Rolo. Rolo put an expression as if he couldn’t do anything about it and carried Ingrid in his back calmly.</p><br/><p>It was when the group was about to depart. At that moment Adenmaha hesitated for a bit but then asked Patroclus in a low voice.</p><br/><p>“Um, I’m asking because I don’t know much. But is that person called Athena-nim a Goddess?”</p><br/><p>Patroclus was bewildered at the absurd question but then nodded and answered.</p><br/><p>Gandur, Rasgrid and Ingrid smiled bitterly at the same time and Bracky started to laugh. Siri shook her head and only Adenmaha opened her eyes sharply.</p><br/><p>“Why are you asking that?”</p><br/><p>Adenmaha glanced at Tae Ho as he asked her about the question and snorted.</p><br/><p>“Are you really asking that?”</p><br/><p>What answer did he have for times like these?</p><br/><p>‘It’s your retribution. Karma.’</p><br/><p>Cuchulainn clicked his tongue and Tae Ho just stayed silent.</p><br/><p>And after walking some more steps.</p><br/><p>Tae Ho looked at Adenmaha taking care of Nidhogg and moved his fingers in the air. He checked the list of sagas he possessed.</p><br/><p>[Saga: The warrior that had a Goddess meet him]</p><br/><p>[Idun]</p><br/><p>[Freya]</p><br/><p>[Heda]</p><br/><p>[Adenmaha]</p><br/><p>[Nidhogg]</p><br/><p>…</p><br/><p>Idun wasn’t a Valkyrie compared to Freya as she could be considered to be one because she was a commander of the Valkyries. Because of that Idun wasn’t registered until now.</p><br/><p>But that wasn’t the case anymore.</p><br/><p>Her name was added to the list as the name of the saga changed.</p><br/><p>Then, what would happen with a God of another world?</p><br/><p>‘Hey, what are you thinking about? It feels like you are plotting something.’</p><br/><p>Tae Ho didn’t answer at Cuchulainn’s sharp question. It was because he would have to meet her first no matter the case.</p><br/><p>Olympus.</p><br/><p>The neighboring world of Asgard.</p><br/><p>Tae Ho’s steps quickened.</p><br/><p>&lt; Episode 49 – The Goddess of warfare Athena (2) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}