{"title": "Chapter 170", "id": 170, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-170", "volume_title": "Volume 2", "body": "<h1>Chapter 170</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 50/Chapter 5: God of Sun (5)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>[I’m really grateful. I have been able to recover part of my strength thanks to you.]</p><br/><p>[We will be able to speak longer in this place.]</p><br/><p>A really nice to hear the sweet voice come out from Sybilla who was sitting on the altar in front of the sanctum of Apollo.</p><br/><p>It was the real voice of Apollo the God of light and also the God of music and poetry.</p><br/><p>‘There’s certainly more strength in his voice than when he was in the small shrine. It seems like it was worth having recovered the shrine of Delfos.’</p><br/><p>In the small shrine, only Sybilla’s way of speaking had changed and the voice remained hers.</p><br/><p>But that wasn’t all.</p><br/><p>Tae Ho could sense a change besides what Cuchulainn mentioned.</p><br/><p>‘Something’s different.’</p><br/><p>He had met several strong Gods even in Asgard and felt the dignity of a God that had a strong presence.</p><br/><p>But it was too lacking compared to now. Tae Ho sensed a strength from Apollo’s divinity.</p><br/><p>And he soon realized the reason for it.</p><br/><p>It wasn’t because Apollo’s divinity was actually stronger than the Gods of Asgard such as Idun and Freya or even Thor and Odin.</p><br/><p>It was because Tae Ho’s own divinity had woken up.</p><br/><p>There was a saying that you could only see what you knew. There was something he could see because he was in the same ship as him, even though the difference in their divinities was clear.</p><br/><p>There was a big difference in what the human Lee Tae Ho and the God Lee Tae Ho could feel even when facing the same divinity.</p><br/><p>If the former was facing the other with layers in between them, then the latter would be facing the other without any kind of obstacles.</p><br/><p>What will happen if he met Idun in his condition? How would Idun be felt?</p><br/><p>And what about Heda?</p><br/><p>Tae Ho thought of the faces of the two people that popped up naturally. He looked at Apollo that had manifested in Sybilla’s face.</p><br/><p>Apollo was in an incomplete state but even his broken divinity was strong as expected of one of the 12 Olympians.</p><br/><p>[Idun’s hero. I want to give you a reward for having completed my quest.]</p><br/><p>[It’s the weapon the past sun of the God Helios used. I received it long ago when I inherited his seat.]</p><br/><p>Apollo moved Sybilla’s body. When he raised his hand lightly, a secret door that was hidden below the altar opened up and shiny particles of light started to come out of that.</p><br/><p>Sybilla moved her hand once again. An equipment emitting bright light surged up by its own and stopped in front of Tae Ho. it was a golden crown that could be worn and it had several sharp and pointy thorns that represented sunlight.</p><br/><p>[Crown of Helios]</p><br/><p>It was a rainbow colored word which he saw in a long time.</p><br/><p>‘The design is a bit excessive but it’s performance seems to be sure.’</p><br/><p>It did give an excessively flashy feeling just like Cuchulainn said but it was still an equipment that you could feel a strong power from.</p><br/><p>[Wear it. It seems like it will suit you.]</p><br/><p>Tae Ho was urged by Apollo and wore the crown as if equipping an item. At that moment, energy started to circulate in his body as if he had drank an energizer.</p><br/><p>[The power of the sun will enter you and greatly strengthen your vitality. Idun is also the Goddess of life so it will harmonize with the crown of Helios.]</p><br/><p>It was like Apollo had said. He felt like the blessing of Idun that saved him several times from the brink of death grow stronger by its own.</p><br/><p>‘The synergy with Gallatin will also be good.’</p><br/><p>Because the Crown of Helios had the power of the sun in it. So it could only have good synergy with Gallatin that also had the power of the sun in it.</p><br/><p>‘So you are able to do that specialized setting or whatever?’</p><br/><p>Tae Ho nodded slightly at Cuchulainn’s question. An item set with Gallatin and Helios as the core appeared in his mind by its own.</p><br/><p>‘Let’s leave it for later for now.’</p><br/><p>Thinking about the item setting was one of his hobbies from when he was a gamer and one of his specialties but the conversation with Apollo mattered more right now.</p><br/><p>Tae Ho stored the Crown of Helios with his saga and then expressed Asgard’s etiquette and said.</p><br/><p>“Apollo, I want to know about the changes that are occurring in Olympus.”</p><br/><p>He didn’t say any unnecessary words.</p><br/><p>Apollo stayed silent with the body of Sybilla he borrowed and then opened his mouth heavily.</p><br/><p>[You are the hero of another world. That’s why telling you what I am going to is like exposing the secrets of Olympus to the outside.]</p><br/><p>[But as the God of rationality, I can’t allow shaking away the strongest supporters I have right now.]</p><br/><p>Apollo was emotional suitable of being the God of poetry and music but he was also the God of rationality at the same time. He was able to make a decision with a cooler head than even Athena.</p><br/><p>[Idun’s hero, do you know about the ones wishing to destroy the world and the ones trying to destroy it?]</p><br/><p>“I know the general outline.”</p><br/><p>Tae Ho started to speak of what he heard from Ragnar and Odin briefly.</p><br/><p>Apollo nodded and said.</p><br/><p>[You really do know the general outline just like you said. I will skip my explanation a bit then. Ask me if there’s something you don’t understand.]</p><br/><p>“I will do so.”</p><br/><p>Apollo let out a sigh as Tae Ho expressed etiquette and started his explanation.</p><br/><p>[Beings that wish to destroy the world and the ones trying to destroy it also exist in Olympus. The former are the Gods of Olympus and the latter are the titans of Tartarus.]</p><br/><p>[You can say that the basic structure is the same as Asgard up to this point.]</p><br/><p>The Gods that wanted to maintain the world and the giants that wished to destroy it.</p><br/><p>[But there’s a decisive difference in Olympus and Asgard.]</p><br/><p>Apollo’s voice became lower.</p><br/><p>[In the first place the Gods of Olympus share the same roots as the Titans compared to Asgard where the Gods and the giants of Jotunheim are different existences.]</p><br/><p>[We split up in two factions from a single root.]</p><br/><p>The Gods of Olympus and especially the 12 Olympians were Titans if you were to speak strictly.</p><br/><p>It meant that they belonged to the same race as the Titans of Tartarus.</p><br/><p>[My father, the king of Gods Zeus, is a Titan before being a God of Olympus. It’s the same for his brother Poseidon and his wife, the queen of Gods Hera.]</p><br/><p>[And the same goes for me as I have the blood of father. Because of that, the Gods of Olympus have two personalities. It means that we haven’t been able to completely lean to one side.]</p><br/><p>It was the same case as Loki that was born as someone wanting to maintain the world even though he was a giant of Jotunheim.</p><br/><p>[But of course, the Gods of Olympus including my father Zeus, are more inclined to maintain the world. In the first place the reason Titanomachy took place was because a certain generation of Titans having my father as the lead got born as beings wanting to maintain the world.]</p><br/><p>The war that occurred in the time the concept of God of Olympus didn’t exist was Titanomachy.</p><br/><p>The concept of God of Olympus didn’t exist so the battle that occured in the war was closer to being an internal affair between Titans.</p><br/><p>[But there was a change almost two months ago. The Gods that had a strong tendency to maintain the world had turned to become beings wanting to destroy it.]</p><br/><p>[The Gods of Olympus have two personalities in the first place but the change is too drastic. In addition, it isn’t that the Gods changed by themselves. There was a voice that increased their tendency of wanting to destroy the world while pressing down their tendency to maintain the world.]</p><br/><p>There was grief in Apollo’s voice. Tae Ho gulped dry saliva and concentrated. He pressed down his thoughts that the Kingdom of fire was the one behind it and waited for Apollo’s next words.</p><br/><p>[Unfortunately, not even I know the exact identity of the voice. It’s because I haven’t even been able to hear it.]</p><br/><p>“Are you saying that each God heard a different amount?”</p><br/><p>Tae Ho asked reflexively. It was a sharp question as expected of someone that had learnt Scathach’s style techniques.</p><br/><p>Apollo’s face darkened.</p><br/><p>[That is right. I almost didn’t hear the voice at all but thanks to that, my beloved sister Artemis heard a lot of that voice. She turned into someone wanting to destroy the world and attacked me.]</p><br/><p>Apollo put on a teary expression with Sybilla’s face. Dense sorrow showed up in his beautiful voice.</p><br/><p>[I didn’t turn into someone wanting to destroy the world as I almost didn’t hear the voice but I also haven’t been able to find out anything about that voice. Such as the owner of the voice and how it awoke our side of wanting to destroy the world that is deep inside of us.]</p><br/><p>‘There’s a high probability it’s the Titans of Tartarus with the rule of elimination…….’</p><br/><p>Cuchulainn paused.</p><br/><p>It was because the probabilities for that were low.</p><br/><p>Apollo heard Cuchulainn’s voice just like Odin did. That’s why he shook his head.</p><br/><p>[I’m doubtful if they have a power like that. That’s why I’m thinking of another existence besides them.]</p><br/><p>Someone that could give a strong influence to the Gods of Olympus that had the blood of Titans flowing in their veins.</p><br/><p>Someone that could even force his will to the king of Gods Zeus.</p><br/><p>Tae Ho thought of a phrase of a greek mythology.</p><br/><p>Apollo continued to speak in a low voice.</p><br/><p>[The one that led the Titans in the Titanomachy. The king of Gods that ruled the world before the Gods of Olympus. The one that attacked my father and took away the seat as the king of Gods and got his seat taken once again by the youngest son.]</p><br/><p>Zeus’ father.</p><br/><p>The usurper of the past that had faced his son in the Titanomachy.</p><br/><p>[Titan Kronos.]</p><br/><p>[The first Titan that started the genealogy of the Gods of Olympus.]</p><br/><p>&amp;</p><br/><p>Night passed and morning came.</p><br/><p>The owner of Delfos had changed but the patrolling at day and night remained the same.</p><br/><p>Three mornings and three nights.</p><br/><p>There was a group that marched the fourth day the owner of Delfos changed and when the sun was its peak.</p><br/><p>It was the army of Artemis.</p><br/><p>They weren’t only monsters but there were also human hunters and nymphs that had pledged their allegiance. The monsters that had fled four days ago had also regrouped with them.</p><br/><p>The one leading the army was Atalante.</p><br/><p>She, who had the title of the fastest hero along with Achilles, looked at a far place while holding the bow she received directly from Artemis. The destroyed walls of Delfos entered her beautiful red eyes.</p><br/><p>“The blessing of Apollo isn’t working.”</p><br/><p>Hipomenes, that was next to her, said. He was also Atalante’s lover just like Meleager was.</p><br/><p>The reason the walls of Delfos were called impregnable wasn’t simply because they were high and thick. It was because the walls themselves had the blessing of Apollo so it was hard to even make a dent on them.</p><br/><p>But the blessing of Apollo wasn’t felt even though it wasn’t like the time the monsters of Artemis took over Delfos and inflicted a big injury to Apollo so he wasn’t able to use his powers.</p><br/><p>Was it a trap to make them lower their guards?</p><br/><p>Atalante thought about it for a moment but then shook her head. In the first place, the other side didn’t even have a proper force. There was no one to protect the walls even if they blessed the walls so there was a high probability Apollo was saving his strength.</p><br/><p>Atalante rode on a monster hog of Kalidon and ordered the army to increased the marching speed.</p><br/><p>The monsters amounting to twenty thousand weren’t clustered but spread away. It was one of the countermeasures they had taken against the rolling attack.</p><br/><p>Artemis didn’t drop her guard as she had already lost Orion and Meleager to Tae Ho. She gathered all of the heroes under Artemis and made a hero hunter troop.</p><br/><p>Actually, the main force of this army wasn’t the twenty thousand monsters but the hero hunter troop that had Atalante at the lead.</p><br/><p>Atalante raised her senses to prepare for unexpected surprise attacks but she didn’t feel a presence until she reached Delfos. There wasn’t even an attack that obstructed from entering.</p><br/><p>An empty castle.</p><br/><p>Delfos was empty. Only the traces of the last battle that hadn’t been cleaned up greeted Atalante and her army.</p><br/><p>Atalante was really bewildered. It was because this place was none other than Delfos. It was the most important city for Apollo’s sacred force.</p><br/><p>They just abandoned Delfos which they had just taken back?</p><br/><p>It was hard to understand. If they were going to do that, then why did they recapture Delfos?</p><br/><p>Atalante loosened her forces and ordered them to search Delfos. She was already sensing instinctively that there was no one left in this city but she couldn’t stay still.</p><br/><p>“It’s a letter that was discovered in the entrance of the shrine.”</p><br/><p>Hipomenes approached hurriedly and gave her the letter. The contents in the sheep leather scroll was as following.</p><br/><p>[I will give you Delfos but I’m the one that decides which city to attack.]</p><br/><p>[PD: It won’t take that long. Perhaps, right now?]</p><br/><p>Atalante opened her eyes widely and looked at her surroundings hurriedly.</p><br/><p>There was still no presence and it didn’t seem like anyone would attack.</p><br/><p>But Atalante realized one fact and that fact made her feel troubled.</p><br/><p>The one that had tricked them saying that he was a hero of Freya by himself- and the one that was estimated to be Idun’s warrior had left Delfos. The army of Artemis could place their hands on Delfos once again.</p><br/><p>But that wasn’t the end.</p><br/><p>The hero of Idun had taken over Delfos with only ten members. It was close to impossible to grasp his movements as it wasn’t an army but a small group.</p><br/><p>That guy didn’t stay in Delfos. He rather gave it away and got the attacking right.</p><br/><p>She couldn’t attack as she didn’t know where he was. It was also impossible to gather the forces in a certain polis as they didn’t know where he would attack from.</p><br/><p>It meant that it was impossible to track his location before he attacked one place.</p><br/><p>And what that meant.</p><br/><p>Atalante bit her lips. All of the polises of Apollo that were taken over and also the polises of Artemis were placed at the tip of her spear.</p><br/><p>It wasn’t something that would be solved by conquering all the remaining polises of Apollo because he could take over a polis even without an army. He wasn’t Apollo’s hero but Idun’s hero.</p><br/><p>The only thing they could do was to make the most preparations possible.</p><br/><p>“Set a post station hurriedly! We have to prepare for the attack of Idun’s hero!”</p><br/><p>The hunters that had quick feet left Delfos and scattered at Atalante’s order. She cursed out and looked at the broken walls.</p><br/><p>Idun’s hero.</p><br/><p>Where will you come from? Could she stay behind in Delfos? What would happen if the other polises get attacked while she was here? What if Delfos gets attacked once again when she leaves?</p><br/><p>Atalante’s head filled with thoughts but she couldn’t come up with a clear answer. Raising the defenses as best she could was the best possible option.</p><br/><p>And when Atalante’s worry was deepening.</p><br/><p>Four days ago Tae Ho left Delfos as soon as his conversation with Apollo ended and headed to the west, that was the opposite of the direction where the polises of Artemis were at.</p><br/><p>He had recovered part of Apollo’s divine power with the retrieval of Delfos’ hallow. He would get weaker once again when Delfos got taken over but it would still be better than having the hallow and Delfos taken.</p><br/><p>They had put off the urgent fire for now.</p><br/><p>It would be better to recover Apollo’s divine power with other methods and regroup with Athena.</p><br/><p>He didn’t even want to attack the polises of Artemis. In her position, it would be normal for Tae Ho to attack to weaken her divine power or recover Apollo’s divine power but that was only in the point of view of Artemis.</p><br/><p>Tae Ho didn’t have a slightest reason to reach a conclusion with Artemis.</p><br/><p>They would scare them and buy time.</p><br/><p>They would look as if they were about to attack but turn around and walk their own paths.</p><br/><p>The group’s trip would be safer the later they realized that they had been tricked.</p><br/><p>‘Evil bastard. You really can only be the God of cheating. God of trickery.’</p><br/><p>Cuchulainn said in a good mood and Tae Ho didn’t refute it. He headed towards the west with Patroclus’ lead.</p><br/><p>The land where the core of the Goddess of warfare’s sacred force was at.</p><br/><p>It was towards the polis of Athens.</p><br/><p>&lt; Episode 50 – God of Sun (5) &gt; End</p><br/>\n</div>"}