{"title": "Chapter 179", "id": 179, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-179", "volume_title": "Volume 2", "body": "<h1>Chapter 179</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 52/Chapter 5: The pursuers (5)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>Ares breathed roughly.</p><br/><p>Tears flowed down endlessly from his handsome face that could be picked at the top in all of Olympus.</p><br/><p>Enyalius had died.</p><br/><p>Not only him but all of the twenty children of his that had followed him also died.</p><br/><p>The Drakon Ismenios was alive but he had betrayed him.</p><br/><p>Ares looked at the world with red bloodshot eyes. He stood up slowly and walked through the military camp.</p><br/><p>The camp that was set up on a polis of Athena was really big and grand. The warriors of Sparta sensed the grief of the God of war so they didn’t move rashly. It was impossible to ease his grief with clumsy words.</p><br/><p>The warriors of Sparta fell silent and that was the same for the believers of Athena that had fallen in fear and despair. Heavy silence pressed down on the entire camp.</p><br/><p>Ares walked forward and moved his hands. He opened his mouth to transmit his thoughts to his remaining children and muttered in the language of Gods.</p><br/><p>The children laid by Aphrodite listened to Ares’ words.</p><br/><p>The daughters of the queen amazoness paid attention.</p><br/><p>He couldn’t transmit a long thought. If it was Apollo, whose specialty was the divine message, he would have been able to transmit long words with only one maiden but that was impossible for the God of war Ares.</p><br/><p>Enyalius and the brothers that followed him died.</p><br/><p>The Drakon Ismenios betrayed him.</p><br/><p>The villain was escaping. Chase him. It wasn’t the time to compete between factions.</p><br/><p>The story ended. He could feel that the remaining seventy or so children of his had started to move.</p><br/><p>Ares continued walking. It was towards a special prison he made deep in the camp.</p><br/><p>The warriors of Sparta that were taking guard kneeled down and bowed towards their guardian God. Ares didn’t vent out his anger in those loyal warriors. He ordered them to fall back for a moment and then entered inside the big curtain that was made with hundreds of leathers of beasts.</p><br/><p>He took one step and then the atmosphere inside the curtains changed. The God of war exploded the grief he had suppressed the cross the camp in an instant and a rough and violent divine power filled the place. That intent was really like fire.</p><br/><p>There were two big pillars inside the curtain.</p><br/><p>And there were chains stuck in each of them. They were chains that were made long ago by Hephaestus and himself to offend Aphrodite.</p><br/><p>It was an object that made you curse when you saw it but Ares well knew of its usefulness. You would be able to use it on many things if it was a chain that not even the God of war could break easily. The scene in front of him was proof of it.</p><br/><p>There was a naked woman kneeling down in between the pillars. She looked like she would collapse at any moment but her arms were tied down by the chains so she couldn’t lie down or sit.</p><br/><p>Ares’ rage woke her up. No, she hadn’t fallen asleep in the first place. The divine power that was tied in the chains were mostly sealed but it wasn’t that her authority had disappeared completely.</p><br/><p>Demeter.</p><br/><p>The Goddess of grain lowered her head and endured the pain. Her beautiful and abundant golden hair that resembled a golden field of grains flowed down like a waterfall and covered her face.</p><br/><p>Ares approached her and every time he took a step Demeter made a resolution. She didn’t want to scream in fear.</p><br/><p>Ares finally arrived. The God of war grabbed the head of the Goddess of grain and raised it up. He then stabbed a dagger in the chest of the Goddess.</p><br/><p>Demeter grit her teeth. Ares twisted his dagger and Demeter’s face contorted. The groan she was holding back flowed from her mouth. The tears she couldn’t endure wet her cheeks.</p><br/><p>Ares let go of her head and lowered his posture. He brought his face close to Demeter who was letting out a breathtaking sound.</p><br/><p>Demeter’s green eyes looked at Ares. Ares faced her with his red eyes and then moved his hand once again and stabbed another dagger in her stomach. He twisted it again and inserted divine power in it.</p><br/><p>“Drakon Ismenios betrayed me.”</p><br/><p>Demeter trembled. Blood flowed from her slightly open lips.</p><br/><p>But she didn’t only struggle at the pain. She smiled forcefully.</p><br/><p>“That’s……good……”</p><br/><p>Ares smiled too. He twisted a dagger once again and made her scream.</p><br/><p>Ares was certain of it.</p><br/><p>Demeter had played a big role in the betrayal of Drakon Ismenios.</p><br/><p>But it wasn’t a decisive role. It was because there was surprise in the pure green eyes of Demeter which she couldn’t hide.</p><br/><p>There was a probability the villain had a special ability.</p><br/><p>‘But it’s impossible to do more than that. He can’t turn the hearts of everyone alone.’</p><br/><p>Having killed everyone except for Drakon Ismenios was proof of that.</p><br/><p>The only ones that had relationships with Ares among the 12 Olympians and had children were Aphrodite and Demeter.</p><br/><p>Aphrodite wasn’t a problem as she had also turned into someone wanting to destroy the world like him but Demeter only had one child and that was Drakon Ismenios.</p><br/><p>Ares learned everything that he wanted and then let out a long sigh and focused on his next task. That was to release all of his indignation.</p><br/><p>Screams and cries filled the place and the surrounding ground let cried along her.</p><br/><p>Ares breathed roughly and looked down at Demeter who had become a mess. He grabbed her hair that had become a mess with blood, tears and sweat and raised her head.</p><br/><p>There was still light in Demeter’s green eyes. She didn’t become twisted even after the countless pains he inflicted her.</p><br/><p>Ares didn’t become enraged at that truth. Rather, he felt satisfaction that Demeter was enduring well.</p><br/><p>There was a vulgar light of ambition in the face of Ares. Demeter glared at him and thought.</p><br/><p>Ares changed.</p><br/><p>It wasn’t about having turned into someone wanting to destroy the world.</p><br/><p>Ares was a really rough and savage being even since he was someone that wanted to maintain the world. He was a barbarian that used violence to get what he wanted.</p><br/><p>But he wasn’t a savage monster that enjoyed harassing someone that couldn’t resist like now.</p><br/><p>His character had changed as he switched sides. The love, violence and rough temperament became more extreme than usual.</p><br/><p>And this wasn’t only speaking about Ares.</p><br/><p>Artemis had also changed. She now had a much more self-complacent and arrogant temperament than before.</p><br/><p>“Persephone.”</p><br/><p>Ares said and Demeter reacted immediately. Eagerness and fear she couldn’t hide appeared in her face, Ares laughed out loud.</p><br/><p>“I will violate her in front of you. No. What about torturing her? Will that be more fun than raping her in front of you?”</p><br/><p>Those were really vulgar words but Demeter could only fall at his taunt.</p><br/><p>“Hades won’t allow that.”</p><br/><p>Ares smiled when she spoke with the little voice she had. He closed up his face as if digging in the fear inside her green eyes and said.</p><br/><p>“Poseidon has changed sides.”</p><br/><p>Demeter flinched. It was the reaction Ares wanted.</p><br/><p>“Hades wasn’t in the mount of Olympus. Perhaps he hasn’t heard any voice. Right, there’s a higher possibility he has remained as a being wanting to maintain the world.”</p><br/><p>That’s why it was fine. If Hades had turned, he would never hand away Persephone to his hands.</p><br/><p>It was much more easy to take her from his hands when he was still a being wanting to maintain the world.</p><br/><p>Hades was strong of course. Ares didn’t want to admit it but he was stronger than him.</p><br/><p>But there was Poseidon, that had an equivalent strength with Hades. In addition, Hades already had the titans of Tartarus as his enemies.</p><br/><p>It’s been two months since the king of Gods and the father of Ares Zeus had started to change.</p><br/><p>In the first place the reason the titans, that were born as beings wanting to destroy the world, were rising but couldn’t act in concert was because of the owner of the underworld Hades.</p><br/><p>He was stopping the titans of Tartarus.</p><br/><p>The reason Hades didn’t help Athena or Apollo or try to rescue Demeter was because of the same reason.</p><br/><p>Hades was stuck in the underworld. He didn’t have the strength to mind about what happened above ground.</p><br/><p>It would be the end if they subdued above ground and attacked the inside and outside along were the titans of Tartarus. Even Hades wouldn’t be able to endure it.</p><br/><p>But it was at that moment.</p><br/><p>Ares thought of one fact.</p><br/><p>The place Athena could escape to. Where she could rely on.</p><br/><p>There were three such cases.</p><br/><p>The first was to escape to the ends of the world and hide, the other one was to try to escape to Asgard and the last one was to head to the underworld where Hades was at.</p><br/><p>The probabilities of the first option were low. It was obvious Athena would find a way to resist until the end. Escaping and hiding without any hopes about the future was only possible for Apollo.</p><br/><p>There was no need to intervene for the second option. The army of his father Zeus was moving to the connecting path to seal it down. There was also the army of Artemis nearby so he didn’t have to do anything.</p><br/><p>Then, the third option.</p><br/><p>All the pieces fell into place. The place Athena was heading to was certainly the entrance to the underworld.</p><br/><p>The smile in Ares’ face became deeper. He patted Demeter a few more times as she was trembling like a weak beast that had lost her composure the moment Persephone’s name came out and then left the place. He spoke in the language of the Gods once again and sent a faction immediately.</p><br/><p>Athena and Apollo are heading to Hades. We have to take over the entrance to the underworld first.</p><br/><p>They also didn’t forget about the information regarding the ones guarding Athena.</p><br/><p>“Break down the camp. We will depart as soon as the preparations are done.”</p><br/><p>The warriors of Sparta started to move busily after they received his order. Ares sent a new order to his children.</p><br/><p>Drive the prey.</p><br/><p>Don’t run too hurriedly and make the rabbits hide in the cave.</p><br/><p>As he would be waiting in front of it.</p><br/><p>A dense smile was drawn in his face.</p><br/><p>&amp;</p><br/><p>Tae Ho’s group concentrated on leaving the place after they defeated Enyalius and the other children of Ares.</p><br/><p>They had fought with three huge dragons breathing out breaths so they could attract attention easily even from a far place.</p><br/><p>The group covered themselves with layers of the stealth blessing as Gandur suggested and then moved in land and got out of the forest. But they didn’t stop at that and hid themselves on a gorge that was in between many high cliffs.</p><br/><p>It was when the night was deep. The group made a shelter inside the cliffs and only then could they make introductions with their new comrade.</p><br/><p>“I am the son of Demeter, Drakon Ismenios. It’s an honor being able to serve master. Obeying you is my happiness so I won’t differentiate from the labor of a cow or a horse. Use me at night and morning however you want.”</p><br/><p>Drakon Ismenios transformed into a youth with flashy golden hair and said with a passionate voice. His green eyes that resembled the eyes of his mother shone like stars.</p><br/><p>‘Why is he like that? His eyes are scary.’</p><br/><p>Cuchulainn trembled as if he got goosebumps and said.</p><br/><p>Tae Ho also was surprised at the unexpected reaction of Drakon Ismenios.</p><br/><p>‘Uh….could it be the result of ‘the one that conquers dragons’ having been strengthened?’</p><br/><p>There was a high probability it was the influence of the saga looking that it said ‘conquers’. Tae Ho’s saga had become much stronger from when he conquered Nidhogg.</p><br/><p>Tae Ho placed his hands on Rolo’s shoulders, who had a displeased expression, as a test.</p><br/><p>[Saga: The one that conquers dragons]</p><br/><p>But there were no changes. Rolo just looked at him wondering what he was doing.</p><br/><p>“Why don’t you have any changes?”</p><br/><p>Even if it wasn’t happiness for obeying him like Drakon Ismenios, it would be good if he still showed respect for his master.</p><br/><p>But an attacking voice was heard from an unexpected place at Tae Ho’s rebuke.</p><br/><p>“Master, you like that? Should I react like that?”</p><br/><p>“Tae Ho master likes that?”</p><br/><p>Adenmaha spoke with sharp eyes and a cold voice and Nidhogg asked purely while tilting her head.</p><br/><p>“No, I will pass. Let’s stay like we were. I like it as it is now.”</p><br/><p>“Hmph.”</p><br/><p>Adenmaha snorted for real in a long time and Nidhogg blinked as she didn’t understand well.</p><br/><p>In the other hand, Bracky explained Tae Ho’s saga to the ones that didn’t know about it.</p><br/><p>Actually even Bracky didn’t know much about it so he only said that his saga enabled him to conquer dragons.</p><br/><p>“To be able to conquer dragons. It’s a really impressive ability.”</p><br/><p>Patroclus admired sincerely. He was wondering why there were so many dragons around Tae Ho but it seemed like that doubt had been cleared.</p><br/><p>Athena was also greatly satisfied. It seemed like she had been greatly inspired by the battle the group showed them today.</p><br/><p>“I already knew that the warriors of Valhalla were strong but I could have never thought that even your allies are strong. I was really struck with admiration. Thank you for giving me hope.”</p><br/><p>She felt like the battle prowess of the group that just seemed to have been three warriors and three Valkyries increased a few times from what she first expected.</p><br/><p>Athena was greatly satisfied that Tae Ho was much stronger than her imagination. She hadn’t even been able to see his battle against Deimos properly as her injuries were really serious.</p><br/><p>“Thank you.”</p><br/><p>Tae Ho replied to Athena’s compliment and then added the information he acquired in the process he conquered Ismenios.</p><br/><p>“So that is the case? If what you are saying is true Demeter is a being wanting to maintain the world…”</p><br/><p>As Athena spoke with a voice of relief and regret, Drakon Ismenios gulped once and then said.</p><br/><p>“Mother is caught in the camp of the God of war. I didn’t think much of that after seeing it before master opened up my eyes. Master, i’m really grateful for having regained my light once again.”</p><br/><p>At first, it was clearly rage towards Ares but it ended up becoming in a compliment for Tae Ho.</p><br/><p>“Uh, yes. Right.”</p><br/><p>Tae Ho answered suitably and turned his head trying to avoid his gaze. It was quite a different feeling from when Adenmaha’s and Nidhogg’s eyes shone.</p><br/><p>‘Well, that’s obvious. How could they be the same?’</p><br/><p>Cuchulainn was right like usual.</p><br/><p>In the other hand, Apollo appeared once again through Sybilla and said while opening his eyes sharply.</p><br/><p>[So there are already two Gods among the 12 Olympians that are caught by Ares.]</p><br/><p>[It’s regretful but it’s impossible to rescue them immediately.]</p><br/><p>[We have to hurry in joining with Hades.]</p><br/><p>It was like he had said. It was impossible to rescue Demeter from the camp of Ares with their current force.</p><br/><p>Drakon Ismenios also knew that fact so he didn’t speak back but even so he couldn’t hide his regret completely.</p><br/><p>The atmosphere turned dark so Adenmaha checked her surroundings and spoke brightly.</p><br/><p>“Um, Drakon Ismenios?”</p><br/><p>“You can just call me Drakon oh beautiful and exalted one.”</p><br/><p>Drakon Ismenios smiled brightly and said. Adenmaha was put in a good mood because of the direct compliment she hadn’t heard in a long while and tried to speak while trying to lower her lips that kept curling up.</p><br/><p>“Hm hm, anyways Drakon. You will be together with us from now on so can you tell us what you can do? It’s a bit stiff but don’t feel burdened and tell us.”</p><br/><p>“Well, grasping the fighting prowess of an ally is an important thing.”</p><br/><p>Bracky also agreed and the others reacted as it was also necessary.</p><br/><p>“Aside from turning into a golden dragon and fighting….ah, I have a special talent.”</p><br/><p>Drakon opened his mouth widely and then pointed at his white teeth.</p><br/><p>“If I pull a tooth and sow it in the ground, powerful warriors called Spartoi are born. My teeth will grow again after some time so you don’t have to worry.”</p><br/><p>“It’s one warrior for one tooth?”</p><br/><p>Drakon nodded at Bracky’s question.</p><br/><p>“That’s right.”</p><br/><p>“Hm, this ability seems like it will be really useful when we have a base.”</p><br/><p>Ingrid also agreed at Gandur’s words. It seemed like Athena also welcomed it.</p><br/><p>‘The farther we go, it feels like we are becoming more of a moving army. It’s not bad.’</p><br/><p>Because they had three dragons and more than ten Valkyries Tae Ho could summon.</p><br/><p>If the Spartoi were added on top to it, it really wouldn’t be an exaggeration to say that they were a moving army.</p><br/><p>But it was then. Tae Ho thought of something he had postponed and looked at Athena.</p><br/><p>“Um, Athena-nim?”</p><br/><p>“What’s wrong Idun’s warrior?”</p><br/><p>Athena asked back with a nice face. Tae Ho took a breath and then faced her eyes.</p><br/><p>“The reward you told me about, can I ask you something now?”</p><br/><p>“I also want to give you a reward but unfortunately I don’t have anything I can give you.”</p><br/><p>Athena’s face paled. It wasn’t because she was disappointed at Tae Ho because he asked for a reward but because she felt really sorry at her situation that she couldn’t do anything.</p><br/><p>Tae Ho shook his head for her.</p><br/><p>“I don’t want an object.”</p><br/><p>“Then what do you want?”</p><br/><p>Athena blinked and asked.</p><br/><p>“Is Tae Ho’s black evil hands finally extending to Olympus……”</p><br/><p>“Gandur, Idun’s commander-nim isn’t a devil. Be careful with your words.”</p><br/><p>“I knew that a day like this would come.”</p><br/><p>“I’m glad you aren’t a Valkyrie.”</p><br/><p>They were Gandur, Ingrid, Rasgrid and Bracky respectively and Siri smiled bitterly at Bracky’s words.</p><br/><p>And one person.</p><br/><p>Adenmaha pouted her lips slightly and grumbled.</p><br/><p>But even so it was something necessary.</p><br/><p>“Uh….Are you really fine with just that?”</p><br/><p>“Yes, it’s enough.”</p><br/><p>Athena put on a doubtful face when he heard Tae Ho’s explanation but looked at the Valkyries at her surroundings and then nodded. She said with an awkward face.</p><br/><p>“It’s a meeting.”</p><br/><p>&lt; Episode 52 – The pursuers (5) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/><p>Episode 52/Chapter 6: The pursuers (6)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>The second night since Athena’s meeting started.</p><br/><p>Tae Ho’s day started with a blessing from Adenmaha and ended with the blessing of Athena.</p><br/><p>Looking at the Goddess bless Tae Ho in turn was a really bewildering scene but the group had already become quite accustomed to it.</p><br/><p>But of course, there was someone that still hadn’t gotten accustomed to it.</p><br/><p>It was Drakon Ismenios that had just joined the group and it was the first time he saw the blessing relay.</p><br/><p>But he expressed deep regret instead of being bewildered.</p><br/><p>“You don’t need me to do it? I’m also considered a God.”</p><br/><p>Drakon Ismenios looked at Tae Ho with burning eyes and said. His voice was one that sadness a sincere lamentation could be heard from.</p><br/><p>“Uh, yes. I will just receive your feelings.”</p><br/><p>It was really beautiful to see the youth that seemed like he came out of a picture acting in excellence but he still refused it.</p><br/><p>As Tae Ho declined while dripping cold sweat Ismenios let out a sigh once again and Bracky ate a chicken leg and laughed refreshingly.</p><br/><p>“Tae Ho’s saga is only meant for Goddesses.”</p><br/><p>Even the name was ‘the warrior that had a Goddess meet him’.</p><br/><p>Bracky had said that he was jealous of Tae Ho’s saga since long ago but his attitude had changed nowadays. The reason was simple like him.</p><br/><p>Because he had the wolf Goddess along him.</p><br/><p>He had started to get more tolerant and relaxed since Siri started to give him blessings outside the eyes of the others.</p><br/><p>Whatever the case, Drakon Ismenios shed tears once again and felt regret.</p><br/><p>“Kuhuk, why was I born as a man? This is the first time I resent my mother since I was born. It would have been good if I was born as a Goddess.”</p><br/><p>He had a really beautiful and sad appearance that could move the hearts of those that saw him but Cuchulainn’s reaction was different.</p><br/><p>‘Hey, he really is weird. Stay as far away from him as possible.’</p><br/><p>‘I will take it into account.’</p><br/><p>Everything Cuchulainn said aside from battles was absurd but at least this time his words became a good advice.</p><br/><p>“Hehe, I’m a Goddess. Adenmaha said that I was a dragon Goddess.”</p><br/><p>Ismenios spoke sincerely once again as Nidhogg said like boasting.</p><br/><p>“Kuhuk, I’m jealous noonim.”</p><br/><p>“Thank you dongsaeng.”</p><br/><p>It seemed like she liked the word noonim more than he was jealous of her.</p><br/><p>[Apollo is satisfied.]</p><br/><p>[But contrary to that, he is worried about the pursuers.]</p><br/><p>The voices of the Gods was heard. Athena, who was drinking hot water at the innermost side of the shelter spoke to everyone.</p><br/><p>“You don’t have to worry too much. Glaucus is patrolling nearby.”</p><br/><p>It was different from before when she had lost consciousness and couldn’t make a surveillance range. She had also recovered a bit of her divine power so she could place Glaucus’ wide range under her senses.</p><br/><p>“Athena-nim, can you tell us about the children of Ares?”</p><br/><p>Rasgrid asked carefully and Athena let out a low exclamation.</p><br/><p>“Ah, that’s right. Knowing about your enemy is a really important thing. I was missing an important thing as I was busy on healing my injuries. Thank you for telling me.”</p><br/><p>“It’s nothing.”</p><br/><p>Rasgrid expressed etiquette once again. Their way of speaking and expressions were stiff but the two of them were respectful.</p><br/><p>Tae Ho looked at that Rasgrid and Athena and nodded.</p><br/><p>‘The two of them really resemble each other, right?’</p><br/><p>‘They do.’</p><br/><p>The Goddess of warfare Athena and Odin’s Valkyrie Rasgrid.</p><br/><p>The color of their hair was black and silver so you could say that they were opposites but aside of that their way of speaking and personalities resembled quite a lot.</p><br/><p>Athena drank hot water once again and started to speak.</p><br/><p>“Ares has almost a hundred children and they are divided in three big factions. One of them is a force with the children of Aphrodite as the core, the other one are the children of the Gods excluding the first ones and the last one are the amazoness.”</p><br/><p>“The amazoness…..are you talking about the female warriors?”</p><br/><p>Athena nodded at Tae Ho’s question.</p><br/><p>“So you already know about them. Right, the amazoness are a group of strong female warriors. I think that they will work well with the Valkyries of Asgard.”</p><br/><p>Because the two of them were associations only composed by females.</p><br/><p>Athena continued to speak.</p><br/><p>“Enyalius, the one you defeated last time, was the one leading the faction composed by the children of several Gods. Deimos and Phobos were in the faction of Aphrodite’s children so actually two of the three factions have been weakened.”</p><br/><p>You could say that the children of Aphrodite were rather in a better situation even though they lost their commander figures.</p><br/><p>It was because the faction Enyalius lead had been exterminated.</p><br/><p>“But he still has close to seventy children. In addition, Ares must have felt something from the last battle so he won’t charge at you recklessly.”</p><br/><p>Ares was really vicious and violent but he wasn’t a fool.</p><br/><p>His eyes for reading the flow of the battle was outstanding as expected of a God of war.</p><br/><p>“Rasgrid, what’s wrong?”</p><br/><p>Athena tilted her head a bit and asked. It was because Rasgrid was putting a dumbfounded expression with her eyes round after hearing her explanation.</p><br/><p>Rasgrid got a hold of herself at Athena’s voice and then answered at the end of her perplexion.</p><br/><p>“Um….it’s a bit impolite to say this but I was surprised at how many children Ares had.”</p><br/><p>She had heard that the Gods of Olympus had many children but for Ares to still have more than seventy of them.</p><br/><p>In the first place, he had more than a hundred?</p><br/><p>Rasgrid’s bewilderment also spread to Ingrid and Gandur.</p><br/><p>But Athena just spoke with a calm face.</p><br/><p>“Well, it’s not a small number but it’s not that he has a lot. Zeus-nim….and even Poseidon has many more children. I know that Apollo doesn’t have that few either. Wasn’t it about thirty?”</p><br/><p>As Athena looked up at the sky and asked the voices of the Gods was heard.</p><br/><p>[Apollo is offended.]</p><br/><p>[He’s asking how she looked at him to say that.]</p><br/><p>‘Well, he’s not a breeding horse either.’</p><br/><p>Cuchulainn was a named playboy but even he only had about ten children.</p><br/><p>But to have thirty. It was obvious for Apollo to be offended at the number that treated him like a breeding horse.</p><br/><p>Not only Cuchulainn but the others of the group thought of the same thing.</p><br/><p>But they were thinking of this because they didn’t know Olympus.</p><br/><p>“I’m sorry. There are a bit more?”</p><br/><p>[Apollo says.]</p><br/><p>[They are easily fifty.]</p><br/><p>To barely give him thirty. How was she seeing this Apollo?</p><br/><p>Athena laughed while being sincerely sorry and Sybilla nodded with a satisfied expression.</p><br/><p>‘Ma, master? Didn’t you say that Apollo-nim didn’t have many children?’</p><br/><p>Adenmaha transmitted her perplexion through her mystical powers.</p><br/><p>To only have fifty children when he didn’t have many. Then how many did you have to have to be able to call them a lot?</p><br/><p>‘Um…..is it that he doesn’t have many heroes among his children?’</p><br/><p>Because Patroclus’ expression was serious when he said that Apollo didn’t have many children.</p><br/><p>While Tae Ho and Adenmaha were speaking through mystical powers, the eyes of the others of the group also started to show bewilderment.</p><br/><p>Athena blinked as if that scene was marvelous.</p><br/><p>“Hm, it seems like the Gods of Asgard are a bit different to us.”</p><br/><p>“Uh…yes, a bit.”</p><br/><p>Even the always stiff and hard Rasgrid could give out an awkward answer now.</p><br/><p>Even Odin, that was the one with the most children in Asgard, was considered to have few children in Olympus.</p><br/><p>“What an interesting story. I thought that you would be quite similar to us as it was a neighboring world of Gods but you have more differences than I expected.”</p><br/><p>Athena’s, the Goddess of wisdom’s, eyes shone with interest.</p><br/><p>Sybilla and Patroclus nodded when Athena nodded again. It seemed like there was something discovered between the people of Olympus.</p><br/><p>“Uh….what kind of person is Hades-nim?”</p><br/><p>Adenmaha asked carefully. It wasn’t because of what they were speaking before. It was better to have more information as they would have to go and look for him.</p><br/><p>Athena closed her eyes and organized her thoughts at Adenmaha’s question and then put on a smile and answered.</p><br/><p>“He’s strong and wise. He’s usually calm on all kind of things and has few emotional things.”</p><br/><p>“He’s the ideal supporter.”</p><br/><p>Athena nodded when Bracky spoke to himself.</p><br/><p>“That’s right. But what Apollo said doesn’t talk about such sides of Hades. It’s because of his different love relationship from the other Gods of Olympus.”</p><br/><p>‘I think I know.’</p><br/><p>Cuchulainn expressed the feelings of everyone.</p><br/><p>Tae Ho felt like he knew.</p><br/><p>“Hades only loved one woman. I’m talking about Persephone the daughter of Zeus-nim and the Goddess of grain Demeter.”</p><br/><p>Zeus was Hades’ brother so actually Persephone was Hades’ nephew.</p><br/><p>But the group had already become accustomed to this much. They just tilted their ears at Athena’s words instead of becoming bewildered.</p><br/><p>“Hades from back then showed really unexpected sides of him. He didn’t know how to act when he fell in love at first sight and was really careful.”</p><br/><p>[Apollo smiles bitterly.]</p><br/><p>It seemed like the two Gods were reminiscing about the happy time.</p><br/><p>The expressions of Adenmaha, Siri and the Valkyries because of the story that wasn’t like Olympus.</p><br/><p>“Hades went to find Zeus-nim at the end of his thoughts and acted only after he received advice from him. He made a beautiful flower bloom in the cliff that connects to the underworld to seduce Persephone and then abducted her.”</p><br/><p>“W, wait. Wait a moment. He kidnapped her?”</p><br/><p>Adenmaha asked back as she was listening to the story in a good way.</p><br/><p>Why did he kidnap her when he was doing well?</p><br/><p>But Athena continued speaking with a calm face.</p><br/><p>“Right, he kidnapped her. But even so Hades was different to the other Gods. He expressed devotion only for Persephone and asked her for marriage and in the end Persephone accepted his feelings. Right now, she is living as the queen of the underworld. She even stepped on the nymph called Mente, that had an unrequited love, because she loved him that much and then turned her into grass.”</p><br/><p>Athena spoke with a warm expression as it wasn’t a really heart warming story.</p><br/><p>But Adenmaha still found it hard to express something. The story had turned to normal when Hades finally gained her heart when he proposed her marriage but what did she mean with Persephone having transformed a nymph that loved Hades one sidedly into grass?</p><br/><p>‘I don’t know where I should tackle this from. In addition, Zeus was the one that advised him to kidnap her? Wasn’t Zeus Persephone’s father?’</p><br/><p>‘Uh…..isn’t it something like the father allowing their marriage?’</p><br/><p>Tae Ho forced himself to come with an answer at Cuchulainn’s bewilderment but Drakon Ismenios interrupted.</p><br/><p>“In addition, my mother Demeter was in a deep sadness at that time because she really treasured Persephone. She has found it really hard on her as the underworld wasn’t a place even one of the 12 Olympians could come and go easily. At first, she roamed the world without knowing that she had gone to the underworld.”</p><br/><p>‘So her mother didn’t give her permission.’</p><br/><p>Tae Ho had nothing to say now. In the first place, he wasn’t in a situation he could speak.</p><br/><p>“In that moment, Poseidon attacked my sad mother and had some children with her. They all entered Poseidon’s ranks.”</p><br/><p>“I’m really glad Hades-nim is at our side.”</p><br/><p>Adenmaha said with a dumbfounded voice and everyone except for the people of Olympus nodded.</p><br/><p>But it seemed that Athena misunderstood Adenmaha’s words that she nodded and continued speaking.</p><br/><p>“Right, I’m really glad. At the lowest floor of Hades’ underworld is Tartarus, where the titans are locked. Now that even Zeus-nim has changed sides, the reason the titans are not able to rise should be because of Hades.”</p><br/><p>Because he was blocking Tartarus.</p><br/><p>And this was the strongest proof that Hades still remained as someone wanting to maintain the world.</p><br/><p>“Uh….are you saying that the God called Hades is facing the enemy of Olympus alone… the ones wanting to destroy the world?”</p><br/><p>Bracky asked with a surprised face.</p><br/><p>It was because if it was just like he had said, it meant that Hades was overwhelmingly strong.</p><br/><p>But unfortunately Athena shook her head.</p><br/><p>“The situation in Asgard is different to Olympus. The titans of Tartarus Hades is suppressing could be considered as remnant forces. We have the Gigas as our enemies, that could be considered to be the giants of Jotunheim.</p><br/><p>When Athena moved her hands, illusions of atrocious and vicious monsters that didn’t have the shape of humans appeared in the air.</p><br/><p>“They, as beings wanting to destroy the world, are sending their army intermittently from the ends of the world. Thanks to that, Olympus placed a huge fortress at the end of the world and are stopping their advance.”</p><br/><p>[Apollo lets out a long sigh.]</p><br/><p>[Apollo thinks of the one protecting the ends of the world and trembles.]</p><br/><p>“The one protecting the ends of the world.”</p><br/><p>Athena also said that and worry spread in her face.</p><br/><p>Because the fortress protecting the ends of the world was inside the world that had changed.</p><br/><p>There was a high probability the one that protected the fortress also changed.</p><br/><p>“You should also know his name. He is the strongest and greatest hero in Olympus.”</p><br/><p>The greatest hero in Erin was Cuchulainn.</p><br/><p>And Sigurd was the strongest warrior in Asgard.</p><br/><p>But this person was different to those two.</p><br/><p>He was a more special being than the two of them.</p><br/><p>If you had to compare, it was more correct to compare him to the greatest battle God of Asgard, Thor.</p><br/><p>The strongest hero of Olympus.</p><br/><p>The one that has started as a demigod hero and climbed to the seat of a God and the one that the title God hero suits the most.</p><br/><p>Cuchulainn knew his name.</p><br/><p>And the Valkyries also knew the name well.</p><br/><p>“Heracles.”</p><br/><p>Tae Ho said and Athena nodded slowly.</p><br/><p>She closed her eyes for a moment as if trying to hide her feelings.</p><br/><p>&lt; Episode 52 – The pursuers (6) &gt; End</p><br/>\n</div>"}