{"title": "Chapter 185", "id": 185, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-185", "volume_title": "Volume 2", "body": "<h1>Chapter 185</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 53/Chapter 4: The pursuers (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: SlowAsLightning</p><hr/><br/><p>Ares glared below him. He looked at the deep darkness beyond the fragments of the violet colored divine power.</p><br/><p>There was only one entrance to the underworld. So now that Hades was asleep Athena’s group was like a cornered rat.</p><br/><p>“Let’s go my children.”</p><br/><p>Ares said and his children obeyed him. They threw themselves into the darkness.</p><br/><p>&amp;</p><br/><p>Tae Ho took out a golden apple of Idun from the air. He ate the apple completely but the recovery wasn’t easy. Part of it was because of Achilles’ attack but it was also because he spent a great amount of power in the process of awakening.</p><br/><p>But he had to hurry. Ares was going to arrive soon.</p><br/><p>But it was at that moment.</p><br/><p>The one that was observing his fight with Achilles approached Tae Ho. He just transmitted his thoughts instead of saying something.</p><br/><p>Follow me. There’s no more time to delay.</p><br/><p>The boatman of the underworld Charon.</p><br/><p>Tae Ho followed his back.</p><br/><p>&amp;</p><br/><p>When Ares arrived in the underworld he lit up his red divine power like flames. The seventy or so children of his also released their divine powers so the darkness of the underworld was erased partly.</p><br/><p>Ares tilted his ear. He couldn’t hear Achilles battling anymore.</p><br/><p>What could have happened?</p><br/><p>Ares took a step.</p><br/><p>&amp;</p><br/><p>Charon took Tae Ho to the river Styx.</p><br/><p>He heard the children of Ares coming down but he didn’t rush.</p><br/><p>[Get deep inside of it. The power of the river Styx will heal you.]</p><br/><p>A low and gloomy voice rang in Tae Ho’s head.</p><br/><p>Tae Ho looked at the small red divinity litting up in the darkness and ate up the remaining pieces of golden apples he had. He then threw himself into the river like Charon had said.</p><br/><p>It was cold.</p><br/><p>It was so cold he felt like it would freeze his soul.</p><br/><p>Tea Ho endured the shock that could stop his heart. Idun’s blessing protected Tae Ho once again.</p><br/><p>[Raise your divinity and accept the power of the Styx.]</p><br/><p>Tae Ho released his dark blue divinity and entered to the river until it covered his head.</p><br/><p>He closed his eyes unconsciously. He could breathe naturally even though he was underwater and fell asleep like that.</p><br/><p>Charon looked at Tae Ho for a moment and turned around. The red aura that was seen far away got a bit bigger. It was starting to close the distance.</p><br/><p>Charon closed his eyes and then walked towards Ares.</p><br/><p>&amp;</p><br/><p>Ares crossed the river Acheron and saw the corpse of Achilles.</p><br/><p>He was putting on a satisfied smile even though he had his chest pierced and had his heart and divinity destroyed.</p><br/><p>Pentesilea, who had grudges against him since the war of Troy, let out a suppressed voice. Ares fulfilled the wish of his daughter who wanted to at least destroy Achilles’ corpse.</p><br/><p>“I can’t feel Athena’s divinity.”</p><br/><p>Where did she escape to?</p><br/><p>Ares opened his eyes sharply. He sensed the faint reverberations of Hermes that remained.</p><br/><p>Rat bastard.</p><br/><p>Ares dislike Hermes even before he turned to become someone wanting to destroy the world. It was obvious as he had impersonated him and grew up by feeding on the breast of his mother Hera.</p><br/><p>‘He used a transference magic circle.’</p><br/><p>But some time had passed since they used it. It was hard to see that they used it right after they defeated Achilles.</p><br/><p>Then, there was a high probability the one that defeated Achilles was still here somewhere. No, there was the probability everyone of Athena’s group pretended to use the magic circle hoping that Ares left.</p><br/><p>And that was also right. If everyone of the group hadn’t fought by joining strength, they wouldn’t have been able to defeat Achilles this quickly.</p><br/><p>“Charon.”</p><br/><p>Ares said. The boatman was standing at the edge of his sight.</p><br/><p>&amp;</p><br/><p>Tae Ho fell in a deep sleep.</p><br/><p>The clear and dark water of the river Styx healed each one of his injuries. It also granted him a body like steel just like it did with Achilles.</p><br/><p>While his body was healing and undergoing transformation, his consciousness went to a deep place. His dark blue divinity accepted a new change that occurred deep in his soul.</p><br/><p>Tae Ho opened his eyes.</p><br/><p>He wasn’t inside the river. He could see the residence of Idun which he really wanted to see even though it hadn’t even passed a month.</p><br/><p>“Hello once again?”</p><br/><p>“Heda.”</p><br/><p>A smile spread on Tae Ho’s face.</p><br/><p>&amp;</p><br/><p>Charon didn’t say clumsy words. He knew what Ares was thinking the moment he called his name.</p><br/><p>He would kill him.</p><br/><p>He wouldn’t even torture him. It was a closed place anyways. He would rather kill him first instead of listening to whatever he had to say</p><br/><p>[Ares, God of war.]</p><br/><p>Charon said gloomily. Ares inserted his red divine power in his sword and at that moment the river of Acheron surged up and charged towards the God of war and his children.</p><br/><p>&amp;</p><br/><p>Heda was a fake.</p><br/><p>It was like the Valkyries Tae Ho called, but not the real one.</p><br/><p>But even so Tae Ho couldn’t erase his smile from his face. Heda transformed into Idun and she grabbed Tae Ho’s hands. She then took his hand and advanced forward.</p><br/><p>The surrounding scenery changed. Idun’s residence changed into a plains and a golden apple tree was seen far away.</p><br/><p>You can’t.</p><br/><p>He remembered the words Adenmaha wanted to say at the last moment. Idun transformed into Adenmaha. She smiled while assuming a prim air and then snorted and stopped in place. She raised her hand and pointed at the one standing below the golden apple tree.</p><br/><p>“Go.”</p><br/><p>“I will be waiting.”</p><br/><p>Adenmaha had transformed into Nidhogg. She smiled brightly and waved her hand towards Tae Ho.</p><br/><p>Tae Ho advanced towards the golden apple tree. The surroundings changed completely once again.</p><br/><p>The small lake touching the roots.</p><br/><p>Tae Ho knew this place. The head of Mimir looked at Tae Ho with casual eyes and the one who was looking at the lake turned towards Tae Ho.</p><br/><p>“It’s a bit sudden but it seems like the time has come.”</p><br/><p>The king of Gods Odin.</p><br/><p>He extended his hand to Tae Ho.</p><br/><p>&amp;</p><br/><p>The lake of Acheron that surged up with the intent to devour everything couldn’t sweep down anything at all. It scattered into nothingness.</p><br/><p>Ares’ sword split the river. His red divinity killed the power of Charon that was controlling the river of Acheron.</p><br/><p>Charon tried to make the river raise once again but it was impossible. The arrow Pentesilea shot pierced his chest.</p><br/><p>Ares opened his eyes sharply.</p><br/><p>It was because he had doubts on why Charon stood to himself to stop him.</p><br/><p>Charon was someone that wouldn’t stand up in a battle he had no chances to win. Why had he stood up when Hades was asleep and had no probabilities to win at all?</p><br/><p>Ares’ thoughts wasn’t wrong at all.</p><br/><p>Charon wasn’t someone that stood up in a battle he couldn’t win.</p><br/><p>Hades was asleep and the group of Athena had no strength left. That’s why Charon didn’t interfere with Achilles.</p><br/><p>But at this moment he stood up to Ares to buy a little bit of time.</p><br/><p>The reason was simple.</p><br/><p>Prospects to win had appeared.</p><br/><p>Achilles told Charon what he had found out before he died.</p><br/><p>What he needed was a little bit of time.</p><br/><p>Time to overturn not only the situation in front of their eyes but also the entire danger that has fallen in Olympus.</p><br/><p>The children of Ares tore the corpse of Charon. Charon resisted desperately but he could only buy a little bit of time.</p><br/><p>But it was enough with that.</p><br/><p>A change occurred in that little time.</p><br/><p>Ares turned his head. He looked at the river Styx.</p><br/><p>&amp;</p><br/><p>“I don’t know about your current situation.”</p><br/><p>Odin said. He also wasn’t the real one. He was a fake like Heda.</p><br/><p>“The only thing I know is that you obtained a deity and that you aren’t able to face the real me. You should probably be in great danger.”</p><br/><p>But he wasn’t a fake made by Tae Ho. It was a fake made by the power of the rune that was engraved in Tae Ho, that Odin engraved in him when they were trapped in the roots.</p><br/><p>Odin looked at Tae Ho. He raised his hand and drew a shining rune.</p><br/><p>“Idun’s warrior.”</p><br/><p>Odin pushed the rune. The rune shining in white touched Tae Ho’s chest and permeated in him.</p><br/><p>“Asgard’s savior.”</p><br/><p>Tae Ho realized that all of this was Odin’s arrangement. He understood what he had prepared since they were caught in the roots.</p><br/><p>That’s why Tae Ho let out a bewildered expression unconsciously.</p><br/><p>“Loki would have liked this.”</p><br/><p>Odin put on a comical smile as if Tae Ho’s reaction was funny and then hit his chest naturally.</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>Tae Ho answered. The pure white light became Tae Ho’s by its entirety and his dark blue divinity devoured everything in his surrounding.</p><br/><p>&amp;</p><br/><p>Ares was the God of war and that’s why he could feel it.</p><br/><p>“Bring out your power and protect yourselves. Gather up behind me, I will sweep away the entrance of the underworld.”</p><br/><p>He spoke as calmly as possible but his words became faster the more he spoke. The children of Ares gathered behind him hurriedly and he concentrated a huge power that couldn’t be compared at all to when he split the river of Acheron.</p><br/><p>The children of Ares gulped dry saliva. It was because the strength Ares had gathered was that great.</p><br/><p>It wasn’t only Ares’ own divine power. It was the result of having brought up the power from his sacred force and even from mount Olympus.</p><br/><p>Ares raised up his sword that got dyed in his crimson power and looked at the river Styx. There was someone coming up from the river.</p><br/><p>It was someone that was covering himself with his dark blue divine power.</p><br/><p>The children of Ares didn’t know who he was.</p><br/><p>But Ares did. The moment he faced him he realized something even though they were still far away.</p><br/><p>“Odin! You crazy old bastard!”</p><br/><p>He was shocked and cursed out. He couldn’t even think about bursting out the power in his strength because he was really surprised.</p><br/><p>But the opponent wasn’t like that.</p><br/><p>Tae Ho looked at Ares and activated the power of his new strength as naturally as breathing.</p><br/><p>&amp;</p><br/><p>Adenmaha, who was grabbing on Hermes’ collar and threatening him that they had to return immediately put on a dumbfounded expression. New shock spread in her face that was covered in tears.</p><br/><p>“Tae Ho master.”</p><br/><p>Nidhogg, that was crying while grabbing Adenmaha’s sleeves, said.</p><br/><p>The Valkyries breathed roughly. They looked at each other. Gandur laughed. Ingrid put on a silent smile.</p><br/><p>It was a really long distance but they knew. They could only feel it.</p><br/><p>Rasgrid looked at Athena. She nodded and Athena gulped dry saliva in the middle of her bewilderment.</p><br/><p>&amp;</p><br/><p>The connecting path was still closed.</p><br/><p>It couldn’t connect to the outside.</p><br/><p>But Odin realized what was happening outside the connecting path. It was because something he could only feel was happening beyond the world boundary.</p><br/><p>Odin grasped it in a moment. Zeus had become an enemy and the same went for Ares. That Olympus was in a great danger it had never faced before.</p><br/><p>Odin! You crazy old bastard!</p><br/><p>He heard Ares’ curse and that’s why Odin laughed out loud.</p><br/><p>“How shabby Ares. How can you be called as a God of war like that?”</p><br/><p>He knew the reason Ares was feeling shocked.</p><br/><p>Because even Freya, who was next to him, was looking at him with a dumbfounded face while dropping her mouth and opening her eyes wide.</p><br/><p>The words ‘are you crazy?’ clearly appeared in her beautiful eyes.</p><br/><p>But that’s why Odin could criticize Ares.</p><br/><p>“I will do whatever it takes to win.”</p><br/><p>That was war.</p><br/><p>War was something you had to do whatever it took to win.</p><br/><p>“That’s why I’m the God of war.”</p><br/><p>&amp;</p><br/><p>“My warrior Tae Ho.”</p><br/><p>Idun said. Heda extended her hand to the direction of Olympus.</p><br/><p>&amp;</p><br/><p>“Idun, Heda.”</p><br/><p>Tae Ho said playfully.</p><br/><p>He glared at Ares and activated his new strength.</p><br/><p>Odin’s arrangements.</p><br/><p>What he planted in Tae Ho.</p><br/><p>[Odin’s successor]</p><br/><p>[The master of Asgard]</p><br/><p>Tae Ho stepped on the ground roughly. He employed the power of the master of Asgard and the God of conquest although it was still small.</p><br/><p>[Myth ranked saga]</p><br/><p>[Hall of Valhalla]</p><br/><p>What was spread due to that.</p><br/><p>What was conquered.</p><br/><p>This land would become Asgard from now on.</p><br/><p>The dark blue divinity grasped the surroundings.</p><br/><p>Ares was surprised and turned to look at himself. And he realized.</p><br/><p>The connection with mount Olympus and his sacred force.</p><br/><p>Everything was severed.</p><br/><p>&lt; Episode 53 – Legend of a Hero (4) &gt; End</p><hr/><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}