{"title": "Chapter 191", "id": 191, "volume": 2, "url": "http://boxnovel.org/valhalla-saga-chapter-191", "volume_title": "Volume 2", "body": "<h1>Chapter 191</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>VS Episode 57 Chapter 1</p><br/><p>Episode 51/Chapter 1: The mother of all monsters (1)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><br/><p>The place had a high ceiling and was also wide but the group felt their sight get tight as dozens of monsters that were tens of meters big appeared at the same time.</p><br/><p>But that wasn’t only for Tae Ho’s group. The monsters also had to feel the same thing.</p><br/><p>[Saga: The warrior that had a Goddess meet him]</p><br/><p>[Saga: The master of flames]</p><br/><p>[Saga: The master of frost]</p><br/><p>[Saga: The king of violence]</p><br/><p>Several sagas got activated at the same time. Nidhogg became one with the fake Nidhogg and stood in the center and Adenmaha, Rolo and Drakon Ismenios stood at the sides.</p><br/><p>When Nidhogg transformed into a hundred meter big dragon, Hydra hurriedly rolled to dodge the place and then looked at her surroundings and let out a groaning sound.</p><br/><p>Why was she acting like that? Tae Ho could know the reason even without using ‘the one that conquers dragons’. Tae Ho drew a rune in the air and recited a chant.</p><br/><p>“Transform.”</p><br/><p>Hydra also needed Tae Ho’s help to transform back as in the first place she hadn’t transformed with her own strength.</p><br/><p>The rune magic activated at the same time of Tae Ho’s claim and Hydra transformed to her original appearance, a nine headed monster.</p><br/><p>One super huge dragon, three huge dragons and one hydra. It was a really grand appearance.</p><br/><p>“It is a battle between monsters.”</p><br/><p>“Rasgrid. What do we have to do?”</p><br/><p>“Can’t we just watch?”</p><br/><p>They were Rasgrid, Ingrid and Gandur respectively.</p><br/><p>While the three Valkyries were making jokes that weren’t jokes between themselves, the monsters that had hesitated a moment roared and charged again. It was because the mother of all monsters Echidna had ordered all her children that were subordinate to her to charge at them.</p><br/><p>“Leave it to me!”</p><br/><p>Nidhogg yelled at that time. Adenmaha sensed what she was planning to do so she tried to stop her but it was already late.</p><br/><p>[Saga: Rolling disaster]</p><br/><p>The black dragon started to curl down and then rolled once. The overwhelming shock shook the entire cave.</p><br/><p>“You stupid! Are you planning on burying us alive?!”</p><br/><p>Drakon Ismenios lowered his posture and cursed out. The amount of falling rocks was certainly overwhelming. It was an obvious result as she had created an earthquake under the ground.</p><br/><p>Nidhogg got surprised and flinched and Adenmaha hesitated whether to agree to his words or yell at him telling him why he was making a kid dispirited.</p><br/><p>‘But the effects are certain.’</p><br/><p>It was like Cuchulainn had said. Almost all the monsters that were running towards them had fallen down with only one roll.</p><br/><p>Looking at dozens of monsters fall down was a really grand spectacle. In addition, there were some that fainted even before fighting because they got hit by the falling rocks.</p><br/><p>“I, I can’t roll? Th, then what do I do?”</p><br/><p>Nidhogg mumbled as she didn’t know how to fight aside of rolling. It was really strange to see a huge dragon curling down and getting depressed but everyone in the group was already accustomed to it.</p><br/><p>“Don’t use your saga and just roll!”</p><br/><p>Nidhogg got enlightened by Adenmaha’s advice and then lied down horizontally and rolled forward. The monsters were now facing a wave charging against them.</p><br/><p>‘Jump over it! Dodge! Uagh!’</p><br/><p>While Cuchulainn was interpreting the roars of the monsters, the other dragons also started to move.</p><br/><p>The first one that moved was Rolo, that was observing the situation with an uninterested face. He fluttered his wings widely and fly and then fired a flame breath towards the rear of the monsters.</p><br/><p>Thanks to that, the monsters started to run in confusion as they were trapped between Nidhogg and the wall of flames behind them. Some of them tried to attack Rolo but he didn’t even mind them. It was because the noonim he always relied on and believed and the newcomer that knew how to use his strength had moved.</p><br/><p>Drakon Ismenios jumped over Nidhogg and attacked the monsters by swinging his tail fiercely.</p><br/><p>Adenmaha was about to move to Nidhogg’s tail but she spat her ice breath close to the ground and caught the feet of the monsters.</p><br/><p>Hydra flinched at the great performance of the monsters as she didn’t know what she had to do. She knew more diverse methods than Nidhogg but she couldn’t even guess how she had to enter that mess.</p><br/><p>But it was different for the warriors of Valhalla that only knew how to eat and fight. Bracky charged first while wielding lightning in his hammer and Siri followed him back to support him. Tae Ho also grabbed the giant hammer instead of his sword and jumped over Nidhogg.</p><br/><p>“Don’t kill them if possible!”</p><br/><p>Tae Ho yelled. If he gained control over Echidna all the monsters in front of him would become his force so they had to avoid killing them while injuries were unavoidable.</p><br/><p>“After seeing the situation!”</p><br/><p>Bracky laughed and hit the chin of a monster that looked like a lion and sent it flying away.</p><br/><p>Siri also agreed to his words. If they relaxed with the monsters charging at them with the intent to kill them, they could be the ones to get done by them. There was nothing absolute in a battle.</p><br/><p>But it seemed like Siri agreed to Tae Ho’s words that she started to aim the joints instead of the eyes or mouth.</p><br/><p>The three Valkyries also joined the battle. They showed quite a proficient battle against big monsters as they already had a lot of experience facing giants.</p><br/><p>In the end, everyone fought against the monsters except for Hydra and they started to overwhelm the monsters not after that.</p><br/><p>Tae Ho defeated three monsters in an instant with electricity and then swung his hammer to accumulate lightning and burst it out inside the cave. He had amplified the power of his rune to the maximum as he was inside the region of ‘Hall of Valhalla’ so the power was really amazing.</p><br/><p>“Hey! You said that I was the God of thunder!”</p><br/><p>Bracky protested and also fired some lightning but he could only be a step below Tae Ho.</p><br/><p>No one but Siri, that was next to him, could hear his protest because of the sound of lightning.</p><br/><p>About ten minutes since the battle started.</p><br/><p>Almost most of the small monsters got at the brink of death. There were still about fifteen monsters that belonged to the dragon race but the situation had already leaned over to them.</p><br/><p>Tae Ho took a breath and looked at a distant place. Even though her children had collapsed Echidna still didn’t lose her leisure.</p><br/><p>[I remember the time Heracles came looking for me.]</p><br/><p>It seemed like Echidna reacted to Tae Ho’s gaze that she spoke in a low voice. Her voice was calm and rather had some excitement in it.</p><br/><p>[Go, my children. Bring out more power from them.]</p><br/><p>Echidna spoke while laughing and at that moment the eyes of the dragons changed. There were some that had new horns grow or changed appearances.</p><br/><p>“Be careful! It’s a bit different to before!”</p><br/><p>Hydra yelled hurriedly from before. It was because she realized Echidna’s authority to strengthen the dragon race.</p><br/><p>But Bracky didn’t mind her and surged up. He swung his lightning hammer towards a green dragon that was opening its mouth to fire a breath towards him.</p><br/><p>An explosion got created with a loud sound. The blue lightning got dispersed with the breath and Siri grabbed Bracky that was sent flying away. At that moment Tae Ho charged towards an earth dragon that was the closest to him and ordered quickly.</p><br/><p>[Adenmaha! Fall back! Drakon Ismenios! Get in!]</p><br/><p>He ordered in a really fast way as he spoke through the ‘dragon monarch’.</p><br/><p>He made Adenmaha fall back as she wasn’t proficient in battles and fired a breath and Drakon Ismenios started to make a contest of strength with the one charging from the front.</p><br/><p>Tae Ho hit the head of the dragon with his hammer to press him down and continued giving orders to his dragons. It was the most simple capturing strategy in which Drakon Ismenios induced a dog fight to create chaos, Rolo and Adenmaha isolated the dragons with their flame and ice breath and Tae Ho was the one that defeated them individually.</p><br/><p>[Saga: The one that conquers dragons]</p><br/><p>It was impossible to shake away Echidna’s control in an instant but he was able to make them stop momentarily.</p><br/><p>The dragons froze everytime Tae Ho’s hand reached them and Tae Ho attacked their vitals precisely.</p><br/><p>As Bracky and Siri joined him the time they defeated them became much faster.</p><br/><p>In the end, the remaining dragons couldn’t endure more than ten minutes.</p><br/><p>But they also suffered some damages. Drakon Ismenios wasn’t in a state he could fight anymore because of the continued fights with the dragons and Rolo and Adenmaha were quite exhausted as they had overused their breath. It seemed like it was even hard to maintain their appearance as dragons that they returned into a gryphon and a Goddess.</p><br/><p>‘If she was thinking of making us spend strength, she succeeded.’</p><br/><p>Cuchulainn smiled bitterly and said. The dozens of monsters in Echidna’s state became unable to fight but they couldn’t know how many more children she had while Echidna herself remained.</p><br/><p>Tae Ho looked in front of him with ‘the eyes of the dragon’.</p><br/><p>Several red words appeared next to Echidna. Three of them possessed a stronger aura than the others that had appeared until now but that wasn’t the same for the others. It seemed like they were so weak or young she didn’t send them to fight.</p><br/><p>The strong three children were about to move as if it was now their turn. But Echidna raised her hand and stopped them. She stood up in the darkness and appeared before the group.</p><br/><p>It was a red woman.</p><br/><p>Her upper body was that of a beauty and her lower body was a big snake with red snakes.</p><br/><p>Her face covered in a crimson hair that resembled flames was similar to the face Hydra had when she transformed into a girl but that was only the appearance of her face. Her eyes and the atmosphere covering her body was too different.</p><br/><p>Bewitching, no, uncanny.</p><br/><p>Not even Freya was like that when she tried to seduce him playfully.</p><br/><p>Bracky could ignore normal seductions while laughing as he has already stepped on the rank of Gods but his eyes still dimmed. Even Siri, that was a girl, flushed unconsciously.</p><br/><p>Echidna, that was wearing a thin and cloth that reflected her body and barely covered her chest, smiled in a good mood. She looked at Tae Ho fixedly.</p><br/><p>“Idun’s warrior. Now that I see you aren’t merely a hero. You are an existence that’s much higher than that.”</p><br/><p>Echidna opened her eyes sharply as if seducing him. It was a soft voice that suited her appearance as a woman but it spread in the entire cave like a lie.</p><br/><p>Tae Ho opened his eyes sharply at the words ‘Idun’s warrior’.</p><br/><p>“Do you know about me?”</p><br/><p>“I do, of course. I can see the world through the eyes of my children. I am the mother of all monsters and my children are all around the world.”</p><br/><p>Tae Ho thought of Hraesvelgr in that moment. The arrogant yet majestic king of birds had a point in common with the mother of all monsters.</p><br/><p>“Olympus is in danger.”</p><br/><p>“I know.”</p><br/><p>“It won’t only end with an internal conflict between the Gods.”</p><br/><p>“I also know that.”</p><br/><p>But she won’t move. She won’t stand up to fight. She would just protect her nest.</p><br/><p>It was meaningless to speak anymore than that.</p><br/><p>“Let’s just battle.”</p><br/><p>“How hot. You are charming.”</p><br/><p>Echidna giggled and then moved her lower body of a snake to close the distance with Tae Ho. She let out her soft voice while crawling slowly.</p><br/><p>“Hero of another world, no, God of another world. Is what you wish my cooperation? To fight against Zeus?”</p><br/><p>“That’s right.”</p><br/><p>“I have a proposal th…..”</p><br/><p>“No! Not children! Don’t even think about it!”</p><br/><p>Adenmaha yelled loudly.</p><br/><p>Echidna opened her eyes roundly at that scary yell and then asked with a heart broken voice as if pleading.</p><br/><p>“I really can’t? I think that ten will be perfect. Won’t it be better to listen to my words instead of her?”</p><br/><p>“No. Adenmaha is prettier than you.”</p><br/><p>Echidna frowned at Tae Ho’s words and Adenmaha covered her red face with her two hands hurriedly.</p><br/><p>The reason Tae Ho denied Echidna’s proposal wasn’t only because of Adenmaha, Heda and Idun.</p><br/><p>What Tae Ho needed was Echidna’s complete cooperation, not a limited cooperation. There was a probability to fall in Echidna’s pace with the current flow if they got allied with a limited cooperation.</p><br/><p>Even if they did get allied, it couldn’t stay like now. They had to stand at the upper side even if they had to use extreme methods.</p><br/><p>Echidna opened her eyes sharply. She smirked as if she had read Tae Ho’s thoughts and shrugged her shoulders.</p><br/><p>“There won’t be any methods then. I don’t listen to the words of others that are weaker than me.”</p><br/><p>“Won’t we know that after we go for it?”</p><br/><p>“So you were looking down on me.”</p><br/><p>Echidna said. At that moment, a change happened in the ‘Hall of Valhalla’ that was spread in the entire cave.</p><br/><p>The red aura pushed away the dark blue aura. It pushed it away roughly as if declaring who was the real owner of this land.</p><br/><p>A change also occurred in Echidna. She wasn’t a frail woman anymore.</p><br/><p>The mother of all monsters.</p><br/><p>The starting point of all the monsters of Olympus, the ancient dragon.</p><br/><p>Echidna was like a huge snake that had golden feathers in her body and crimson scales.</p><br/><p>A crimson dragon. No, the God of dragons.</p><br/><p>She looked down at Tae Ho with her golden eyes. The red aura that was pushing away the dark blue aura finally regained its domination right over the cave.</p><br/><p>“Speak again foolish God of a foreign world. Tell me to go at it again.”</p><br/><p>There was no grief at Echidna’s voice. It was rather filled with playfulness. It was the look of someone that didn’t doubt because of her absolute superiority.</p><br/><p>And her belief was rational.</p><br/><p>Drakon Ismenios couldn’t remain as a dragon anymore. He dripped cold sweat and ended up kneeling down in front of the God of dragons unconsciously.</p><br/><p>Rolo let out a groaning sound and stepped back. Adenmaha clenched her chest and suffered and Hydra collapsed entirely and couldn’t even move.</p><br/><p>The black dragon also disappeared like a lie. Nidhogg looked at Echidna with a pale face. If Nidhogg was an ancient dragon that didn’t know how to use her powers, then Echidna was an ancient dragon that knew who she was and what kind of powers she had clearly.</p><br/><p>Bracky gulped dry saliva and Siri got certain of it while dripping cold sweat.</p><br/><p>It was impossible for Tae Ho even if he conquered several kinds of dragons until now. Even if the being in front of him was a dragon, he wouldn’t be able to conquer it.</p><br/><p>Cuchulainn also thought similarly. The situation was different from Nidhogg, that had took in his control by herself. Conquering the dragon in front of him would be some times harder than just winning against her in a battle.</p><br/><p>Those were all correct and Tae Ho also agreed to it.</p><br/><p>But Tae Ho didn’t step back. He looked up at Echidna and smiled like a lie.</p><br/><p>“Can you wait for a bit?”</p><br/><p>[What?]</p><br/><p>“I think it’s almost done. I can get the feeling.”</p><br/><p>Everyone got bewildered at those weird words. Rolo thought that his crazy master had completely turned crazy.</p><br/><p>And Tae Ho threw his hammer. It wasn’t to Echidna but a dragon that looked like a Komodo Dragon that was collapsed nearby.</p><br/><p>The dragon that was confused passed out completely.</p><br/><p>‘You have finally gone crazy.’</p><br/><p>Cuchulainn thought and everyone looking at him thought of the same thing.</p><br/><p>But that wasn’t the case. And the one that realized that was unexpectedly Echidna.</p><br/><p>What had changed after defeating a dragon.</p><br/><p>What Tae Ho obtained due to that.</p><br/><p>[Synchro rate: 90%]</p><br/><p>Cuchulainn also noticed it. he blinked in his bewilderment.</p><br/><p>Because it wasn’t an extreme situation and he hadn’t even defeated a strong enemy.</p><br/><p>But that didn’t matter.</p><br/><p>Obtaining 100 exp points after defeating an ogre and obtaining 100 exp points by obtaining 100 goblins, it was still 100 exp points.</p><br/><p>In addition, the dragon knight Kalsted was a dragon killer that had defeated countless dragons. Dragons were the best opponent for his synchro rate to increase.</p><br/><p>Tae Ho looked up at Echidna. He put on a nice smile because the new strength was like he had expected.</p><br/><p>If the opponent was a God of dragons then he would also increase his rank.</p><br/><p>He would transform into a being that could even conquer the God of dragons.</p><br/><p>Tae Ho’s eyes transformed into those of a dragon. The blood of a dragon started to flow in all his body and the wings of a dragon formed with light spread in his back.</p><br/><p>Only one person in Dark Age.</p><br/><p>The God dragon knight that had executed the powerlessness of the world dragon Yggdrasil.</p><br/><p>[Myth ranked saga]</p><br/><p>[Incarnation of the world dragon]</p><br/><p>The dragon God of Dark Age.</p><br/><p>The executor of dragons that had massacred countless dragons.</p><br/><p>The dark blue divinity started to take control everything in the cave again.</p><br/><p>&lt; Episode 57 – The mother of all monsters (1) &gt; End</p><br/>\n</div>"}