{"title": "Chapter 214 - Episode 61/Chapter 4: Great Hero (4)", "id": 215, "volume": 3, "url": "http://boxnovel.org/valhalla-saga-chapter-214-episode-61-chapter-4-great-hero-4", "volume_title": "Volume 3", "body": "<h1>Chapter 214 - Episode 61/Chapter 4: Great Hero (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 61/Chapter 4: Great Hero (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: StellarRain</p><br/><p>Rescuing Demeter was easier than they thought.</p><br/><p>It was because after Poseidon’s army was liberated, the monsters reverted to beings who wanted to maintain the world.</p><br/><p>In addition, Tae Ho was accompanied by Demeter’s blood child, Drakon Ismenios.</p><br/><p>“She’s over there. I’m sure of it. I can feel the aura of mother.”</p><br/><p>Drakon Ismenios, who was riding on Sleipnir along with Tae Ho, pointed to a distant place. They could see an island in a vast expanse of water.</p><br/><p>“Kugh….I’m excited because I haven’t seen mother in a long time, but at the same time a little depressed. For the harmonious ride with master to end here…….”</p><br/><p>Drakon Ismenios let out a teary voice and embraced Tae Ho’s waist from behind.</p><br/><p>Tae Ho’s skin burst out with goosebumps because of the hug, but if he threw a tantrum here they would only be thrown into the water. He forced himself to calm down by reciting the buddhist scriptures and continued to ride Sleipnir to the island.</p><br/><p>Based on the words of Poseidon’s former army, Poseidon treasured Demeter so much he hid her deep in the sea where not even his closest allies could reach her.</p><br/><p>Even from this far the powerful aura of Poseidon could be felt from the island. The sea released an aura this strong even when Poseidon was already dead, so it seemed like he had set up several layers of barriers.</p><br/><p>‘They said that Demeter was hidden deep in the sea but looking now there’s an island……could it be Demeter’s work?’</p><br/><p>‘Probably. No matter what she’s still the current Goddess of grain in Olympus. She wasn’t able to share Olympus with Zeus, Poseidon and Hades, but her sacred force should still be transcendent.’</p><br/><p>Sleipnir flew diligently forward while Tae Ho conversed with Cuchulainn. Sleipnir was a horse who boasted the speed of light when he released his special power just like Talaria, but he was still fast even if he didn’t release his power.</p><br/><p>The island that was only a small dot on the horizon gre into the size of a watermelon as Tae Ho and Cuchulainn chatted.</p><br/><p>Up close the island was a boulder about 10 meters big with a golden haired woman wearing green clothes standing on the middle of it.</p><br/><p>At first, she took a cautious stance but then smiled brightly and waved her hand when she recognized them.</p><br/><p>“Drakon Ismenios!”</p><br/><p>“Mother!”</p><br/><p>Drakon Ismenios answered Demeter’s call. Tae Ho quickly landed down on the boulder island. Drakon Ismenios jumped down from Sleipnir and ran towards Demeter.Demeter spread her arms and welcomed her son.</p><br/><p>‘It’s an emotional moment.’</p><br/><p>‘Right.’</p><br/><p>They had heard of what Demeter had suffered through from Poseidon’s army before coming to this place, so they the tips of their noses tingle.</p><br/><p>Among the 12 Olympians, Demeter must be the one who had lived a life with the most ups and downs.</p><br/><p>Demeter tightly embracing Drakon Ismenios was really beautiful. Tae Ho and Cuchulainn felt like they could understand why Poseidon had desired her that much.</p><br/><p>Demeter displayed abundant and beautiful golden hair resembling a wheat field. She didn’t have a sexy face like Aphrodite but exuded a purity that stimulated your desire to protect her. Speaking honestly, Tae Ho felt that she was more beautiful than Aphrodite.</p><br/><p>‘Well, your love is really solid.’</p><br/><p>If they were to say, Demeter really resembled Idun.</p><br/><p>She also looked really young, as expected of a Goddess, and she even looked younger than Drakon Ismenios.</p><br/><p>Whatever the case, Tae Ho and Cuchulainn were satisfied by the warm scene.</p><br/><p>“Mother! This person is the master of Asgard and my own master Lee Tae Ho-nim. Please greet him.”</p><br/><p>“Master?”</p><br/><p>“Yes, that’s right! He’s a cool person that likes meetings!”</p><br/><p>Drakon Ismenios spoke cheerfully and Demeter tilted her head because she thought that she had heard wrong.</p><br/><p>It was obvious that Tae Ho’s satisfaction was broken.</p><br/><p>‘Kya, how honest. Being honest is really the best.’</p><br/><p>While Cuchulainn laughed, Demeter tilted her head in confusion a few more times and carefully approached Tae Ho. She then bowed down before him.</p><br/><p>“I’m the mother of Drakon Ismenios, Demeter. Drakon Ismenios has been a burden for you.”</p><br/><p>“Ah, no. I always received help from him. I’m the master of Asgard, Lee Tae Ho.”</p><br/><p>Tae Ho greeted back awkwardly at Demeter’s strange introduction. He was reminded of the parental consultation when he used to go to school.</p><br/><p>While the both of them were being awkward, smenios butted in once again.</p><br/><p>“Mother, master likes receiving meetings from Goddesses a lot. It’s the best thing- no, bribe- no, gift to give him saying to take good care of me.”</p><br/><p>Drakon Ismenios said and raised his thumb.</p><br/><p>But Demeter just glanced at Tae Ho with a face full of confusion and chaos. You could tell what she was thinking of just by looking at her shrinking shoulders.</p><br/><p>[Hey!]</p><br/><p>Tae Ho hurriedly sent a mystical message with a red face. Cuchulainn couldn’t endure it anymore and bursted out with laughter.</p><br/><p>‘He’s not wrong. Yep yep, not wrong at all.’</p><br/><p>It was true that Tae Ho liked meetings and that it was also the best thing for him to receive.</p><br/><p>Drakon Ismenios flinched at Tae Ho’s yell but then winked and started to urge Demeter.</p><br/><p>“Mother! Quickly, the meeting!”</p><br/><p>It seemed like he had misunderstood Tae Ho’s anger with pressuring.</p><br/><p>“No, even if you say that……”</p><br/><p>“You just have to face him and say that you have come to meet him. Hurry!”</p><br/><p>Tae Ho grew distracted at Drakon Ismenios’ continued attacks and thought of how he should control this situation. However, he was just standing still in a shock and couldn’t do anything.</p><br/><p>“I, it’s a meeting.”</p><br/><p>“Uh..yes. Tha, thank you.”</p><br/><p>They exchanged awkward greetings once again.</p><br/><p>But Drakon Ismenios wasn’t satisfied with that.</p><br/><p>“Now, mother! Next comes the blessing!”</p><br/><p>“Blessing?”</p><br/><p>“W, wait. Drakon Ismenios.”</p><br/><p>Tae Ho barely regained his wits and tried to stop Drakon Ismenios. Tae Ho’s face flushed and his voice trembled as he was really uncomfortable.</p><br/><p>Because of this Drakon Ismenios ended up misunderstanding once again.</p><br/><p>He turned to look at Tae Ho and Demeter with a surprised face and then spoke while covering his mouth with two hands.</p><br/><p>“Huk, is it that you don’t want the blessing of mother…..I’m sorry. I’m really slow to catch on things……”</p><br/><p>“N, no. It’s not that. I really want to receive it.”</p><br/><p>‘You real thoughts are starting to come out.’</p><br/><p>Cuchulainn clicked his tongue and Tae Ho bit his lips.</p><br/><p>‘It’s a misunderstanding!’</p><br/><p>Tae Ho hurriedly turned to look at Demeter while trying to act like a parent dealing with a student but it was too late. Her green eyes were really warm.</p><br/><p>‘It’s all your retribution, retribution.’</p><br/><p>Cuchulainn spoke about retributions even when he wasn’t from the Temple.</p><br/><p>And meanwhile, Drakon Ismenios who became excited, clapped in joy.</p><br/><p>“Certainly! Now, mother! Quickly! You just have to place your lips on master’s forehead!”</p><br/><p>Drakon Ismenios pulled on Demeter’s arm and urged her. Demeter let out a sigh at the actions of her son and turned to face Tae Ho. Her eyes lost its warmth.</p><br/><p>“I, I will grant you a blessing.”</p><br/><p>“Th, thank you.”</p><br/><p>The lips of Demeter was really soft but Tae Ho felt really pitiful. He now understood what the saying of wanting to hide in a rat hole meant.</p><br/><p>[Saga: The warrior that had a Goddess meet him]</p><br/><p>[Classification: Olympus]</p><br/><p>[Goddess of earth Demeter]</p><br/><p>She was added to his Saga.</p><br/><p>Right, it should be done with this.</p><br/><p>It was a good thing, right?</p><br/><p>Tae Ho tried to comfort himself but it hadn’t yet. The attack of Drakon Ismenios hadn’t ended yet.</p><br/><p>“Whew, mother. Now you just have to have meetings with master every time you can. Kugh, if I was also a Goddess I would do it everyday…..”</p><br/><p>Drakon Ismenios’ eyes reddened in regret from his imagination.</p><br/><p>The only thing Tae Ho could do now was to apologize.</p><br/><p>“I, I’m sorry Demeter-nim.”</p><br/><p>“No, he was originally like that…….I’m the one that should be sorry.”</p><br/><p>The two people- no, Gods were deeply bowing to each other.</p><br/><p>“Ah, anyways. Uh, um. I will go to the main topic.”</p><br/><p>‘What, wasn’t receiving the blessing the main point?’</p><br/><p>‘Cuchulainn!’</p><br/><p>‘Right, I will stop here. I already got cursed at a lot.’</p><br/><p>Cuchulainn shutting his mouth in consideration was truly hateful.</p><br/><p>Anyways, they should really start discussing more important topics. Tae Ho checked his surroundings and said.</p><br/><p>“Demeter-nim. We should move places for now.”</p><br/><p>Continuing to speak in the middle of an island in the middle of the sea was not possible. The sunlight was hot and there were no shadows to hide under.</p><br/><p>Tae Ho called down Sleipnir and extended his hand to Demeter.</p><br/><p>“It’s the fine horse of Asgard, Sleipnir. Just for a moment will you ride on him together with me?”</p><br/><p>Demeter examined Sleipnir. It seemed like she was interested in the eight legged horse of Asgard.</p><br/><p>“I will. But won’t it be too small for three people to ride on it?”</p><br/><p>“I will summon Drakon Ismenios when we arrive.”</p><br/><p>This would make speaking more comfortable.</p><br/><p>It looked like he was neglecting someone, but it seemed like Demeter didn’t mind. Demeter laughed and embraced her son.</p><br/><p>“I will see you later.”</p><br/><p>“Yes, mother.”</p><br/><p>Drakon Ismenios smiled brightly and waved his hand as Tae Ho flew up to the sky with Demeter sitting in front of him.</p><br/><p>“Demeter-nim, I will first tell you about the situation.”</p><br/><p>While they flew across the sea, Tae Ho started speaking. He didn’t know how much Demeter knew, so he recounted his entire experience since arriving on Olympus.</p><br/><p>By the time they arrived on land, the story came to a conclusion. Demeter carefully turned around to look up at Tae Ho and nodded.</p><br/><p>“Indeed, that’s why you need a way to contact with Gaia-nim?”</p><br/><p>“Yes, reinforcements from Asgard have arrived but this is still war between Olympus and Asgard. We certainly need Gaia-nim’s help to know why the Protogenoi joined the enemy and how many old gods have turned.”</p><br/><p>‘You also want to receive receive her blessing.’</p><br/><p>‘Ugh really, Cuchulainn!’</p><br/><p>‘Why, you aren’t going to receive it when you meet her? Huh? She’s a primeval God!.’</p><br/><p>‘No….it’s not that.’</p><br/><p>‘Child, throw away your mask and be honest with yourself. Look at me, how good is it if you are honest like me?’</p><br/><p>“Master?”</p><br/><p>Demeter invertened. She resembled Idun when she tilted her head and looked at him with worried eyes.</p><br/><p>Tae Ho hurriedly regained hold of himself and shook his head.</p><br/><p>“Ah, I’m sorry. Someone from Asgard contacted me.”</p><br/><p>Bragi’s rune worked diligently today as usual. Demeter opened her eyes widely and asked.</p><br/><p>“Is something urgent?”</p><br/><p>“No. Anyways….the current situation is like this. I know that it’s impolite to ask you this when I have just rescued you but I hope you can help us.”</p><br/><p>When Sleipnir reached the shore Tae Ho jumped down first and helped Demeter dismount from Sleipnir. He then silently looked at her.</p><br/><p>Demeter glanced atTae Ho for a moment and smiled.</p><br/><p>“It’s a matter of Olympus so the Gods of Olympus should take the lead. I’m just grateful for the help of Asgard.”</p><br/><p>She stopped speaking and then stood on her toes and kissed Tae Ho on his cheek.</p><br/><p>“Let the blessing of the earth accompany you.”</p><br/><p>This wasn’t a simple blessing. Tae Ho felt a part of Demeter’s divine power enter him. There was also knowledge contained in that divine power.</p><br/><p>The location of Gaia.</p><br/><p>The only one roaming the world freely among the Protogenoi.</p><br/><p>“It’s a secret only you should know.”</p><br/><p>Demeter whispered in Tae Ho’s ear and Tae Ho nodded.</p><br/><p>And he also understood why Demeter hadn’t been able to ask Gaia for help before.</p><br/><p>The ancient God of earth, Gaia.</p><br/><p>Her territory was the furthest away from the sky, the territory of Zeus who she disliked the most It was located in the deepest part of the sea.</p><br/><p>However, there was only five days until the promised day with Odin.</p><br/><p>&lt; Episode 61 – Great Hero (4) &gt; End</p><br/>\n</div>"}