{"title": "Chapter 230 - Episode 65/Chapter 4: The ten realms (4)", "id": 231, "volume": 3, "url": "http://boxnovel.org/valhalla-saga-chapter-230-episode-65-chapter-4-the-ten-realms-4", "volume_title": "Volume 3", "body": "<h1>Chapter 230 - Episode 65/Chapter 4: The ten realms (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 65/Chapter 4: The ten realms (4)</p><br/><p>TL: Tsubak</p><br/><p>ED: StellarRain</p><hr/><br/><p>Asgard’s new front lines were much more further up north than before. This time it was at the boundary of Asgard and Jotunheim.</p><br/><p>Ragnar, who was preparing to travel south by riding on the Black Flash, turned to look in the direction the fragment of Erin and asked.</p><br/><p>“Where is Tae Ho- no, the master right now?”</p><br/><p>He had heard days before that Asgard would soon proceed with a ceremony to reconstruct Erin. Reports said that the ceremony required to be completed as soon as possible as it was extremely important.</p><br/><p>‘Did Tae Ho say that time stops inside the region where the ceremony takes place?’</p><br/><p>Anyways, the important issue was that he had no way to communicate with Tae Ho since the ceremony started.</p><br/><p>The Valkyrie who served as a secretary flinched at Ragnar’s question. She then pressed something in the air and inspected it.</p><br/><p>The woman with charming blonde hair bit her lips after that.</p><br/><p>“The ceremony was planned to take place this afternoon…..so it should already be underway.”</p><br/><p>Perhaps it hadn’t been long since they started with the ceremony or the distance was too far, but they couldn’t see any signs in the fragment of Erin.</p><br/><p>Regardless, Ragnar couldn’t go directly to Erin as there was a high probability he would be going for nothing.</p><br/><p>“We don’t know what will happen so send someone over there. I will head to Valhalla immediately.”</p><br/><p>“Understood.”</p><br/><p>Ragnar hit his chest as the Valkyrie saluted and then rode on the Black Flash.</p><br/><p>‘I can’t get accustomed to this no matter how much I ride on it.’</p><br/><p>Ragnar closed his eyes and for a moment cleared his mind of the matters relating to the Temple, Olympus and Tae Ho.</p><br/><p>It didn’t take long for him to arrive at Valhalla.</p><br/><p>“Father!”</p><br/><p>Ragnar heard a call as soon as he got down from the Black Flash so he raised his head while teetering a bit. Bjorn came running from far away as expected.</p><br/><p>“Bjorn.”</p><br/><p>“I have put the messenger of the Temple on hold. Let’s hurry.”</p><br/><p>Bjorn supported Ragnar who stumbled and spoke quickly. Ragnar leaned on Bjorn for a moment, looked his surroundings and asked with an urgent tone.</p><br/><p>“What about the Gods? Did they announce that we were at war?”</p><br/><p>The atmosphere in their surroundings wasn’t normal. There were also other Black Flashes flying to Valhalla even in this moment.</p><br/><p>“Heimdall has already done so. It’s still at stage 1 but….each legion is already preparing to take part in the war.”</p><br/><p>A declaration of war in Asgard composed of 3 stages. As expected of the combative Asgard, they were already preparing for battle beginning in the 1st stage.</p><br/><p>“Heimdall says that he wants to meet the messenger.”</p><br/><p>“Yes, he made the announcement right after the attack, so I think that the situation is more serious than I thought.”</p><br/><p>Ragnar gulped. He unconsciously turned in the direction of the Temple and Olympus and asked Bjorn.</p><br/><p>“What about the messenger who came from Olympus?”</p><br/><p>“Both messengers are resting in the same place.”</p><br/><p>“They should also need to exchange information.”</p><br/><p>The two sides must be really surprised right now. A situation where Olympus and the Temple were attacked by another world was special already, but two worlds even were attacked at the same time.</p><br/><p>“Over here. Let’s hurry.”</p><br/><p>After Ragnar entered the inner parts of Valhalla, he quickly moved to where the messengers were resting.</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>“Let the light of the Temple be eternal.”</p><br/><p>“May the glory of Olympus accompany you.”</p><br/><p>The messenger of the Temple was a female and the messenger of Olympus was a tall and thin human hero.</p><br/><p>They were beings clearly below Ragnar in both rank and level, but they had still come to this place to represent their world. They couldn’t be neglectful in their etiquette.</p><br/><p>Ragnar finished the simple introductions and then followed with a question hurriedly.</p><br/><p>“I will ask you directly. Are Dilmun and Memphis hostile against the Temple and Olympus? It’s not an independent military act?”</p><br/><p>It was really special when one world opposed another.</p><br/><p>Excluding the last deployment to Olympus, it was something that had only occurred two times in the long history of Asgard, and those were small skirmishes as neither world knew anything about each other.</p><br/><p>The messenger of the Temple frowned at the Ragnar’s question, as he asked whether or not there would be an all out world.</p><br/><p>“The vanguard of Dilmun that attacked the Temple is lead by the hero king Gilgamesh. There was no one else particularly outstanding among them but it’s hard to see it as a spontaneous decision as you have to pass through the connecting path to attack another world. Only… it seems like most of the forces Gilgamesh is leading are destructive beings.”</p><br/><p>Ragnar opened his eyes sharply at the woman’s words. He took particular notice of this information and then looked at the messenger of Olympus.</p><br/><p>“What about Olympus?”</p><br/><p>“The situation is similar. However, the ones who have appeared so far were already calamitous beings in the first place, so there’s a guess believing that the the monsters that previously attacked Erin moved on to Olympus.”</p><br/><p>It was much better than having all of Memphis turned but this was still a dark future. Ragnar closed his eyes and then asked the two people.</p><br/><p>“The time frame you were attacked is similar?”</p><br/><p>“It was almost at the same time.”</p><br/><p>The two messengers turned to look at each other and then answered in one voice. Ragnar asked again.</p><br/><p>“How large is the scale of the enemy?”</p><br/><p>“We don’t know yet. I departed right after the opening path was activated and the invasion of the enemy was confirmed, so I think I will know once I return.”</p><br/><p>“It’s the same with Olympus.”</p><br/><p>The ones that arrived were only messengers to notify Asgard of the invasion. That’s why there was the possibility the situation may worsen.</p><br/><p>“Can’t you forcefully close the connecting path?”</p><br/><p>“It’s impossible as the other side is supporting it.”</p><br/><p>The situation was different from when Olympus closed the connecting path with Asgard by force.</p><br/><p>In that case, Odin and the Gods of Asgard had no interest at all in the connecting path with Olympus. If Odin was committed to opening the connecting path, not even Zeus would be able to close the connecting path as he pleased.</p><br/><p>Ragnar let out a short sigh and then asked some more questions. These were things related to Memphis and Dilmun as Asgard didn’t know about much about these worlds.</p><br/><p>After ten minutes passed like that and Ragnar resolved some doubts, he stood up and said.</p><br/><p>“I understand. Thank you for your time. Asgard will soon send you more news.”</p><br/><p>Ragnar nodded politely and then headed to the thrones of the Gods. Heimdall was standing guard like he expected.</p><br/><p>“Ragnar.”</p><br/><p>The only one who could command the defenses of Asgard and Valhalla now that Tae Ho, Odin and even Freya were absent, was Heimdall.</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>Both of them exchanged greetings and then Ragnar approached Heimdall and asked.</p><br/><p>“I heard the announcement. What are you planning to do?”</p><br/><p>“Do you know that the master has already started the ceremony to rebirth Erin?”</p><br/><p>“I do.”</p><br/><p>When Ragnar smiled bitterly, Heimdal also put a similar face.</p><br/><p>“It’s a troublesome situation. Odin-nim and even his acting proxy, Freya, are in Olympus, but on top of that it’s impossible to contact master.”</p><br/><p>“But we still have Heimdall-nim.”</p><br/><p>In the first place, the reason Tae Ho could proceed with the ceremony was because of Heimdall.</p><br/><p>It was a really obvious that Heimdall was better at politics and management than Tae Ho, who had just become the master, as Heimdall had been protecting Asgard for a long time.</p><br/><p>Heimdall closed his eyes and let out a long sigh.</p><br/><p>“I’m planning to research the situation a bit more for now. But the issue is that the two worlds need assistance and we would have to dispatch some forces. There’s a reason we have to send them to the two worlds.”</p><br/><p>“Odin-nim, Freya-nim and Thor-nim are in Olympus.”</p><br/><p>The most important beings of Asgard were in Olympus so they had to at least send reinforcements to protect them.</p><br/><p>“Right, and we have a debt with the Temple. If we just leave them out to dry it won’t only be unjust, but we won’t be able to get their help ever again.”</p><br/><p>The assistance of the Temple in the last war was short but fierce. There would be none in Valhalla that would forget about this debt.</p><br/><p>“But Heimdall-nim. It’s a bit excessive to send reinforcements to both sides.”</p><br/><p>“Probably but we still have to send reinforcements. And if it’s not possible to dispatch forces at an equal level…..I’m planning to put more emphasis in Olympus for now.”</p><br/><p>It wasn’t because Heimdall liked Olympus more.</p><br/><p>“We don’t know if the forces of Dilmun and Memphis are similar or if there’s a difference. But the clear thing is that the Temple is still at full power but Olympus isn’t in a situation to go at war yet.”</p><br/><p>Olympus was not only partially destroyed in the last internal war, but also lost countless heros and forces . It wasn’t an exaggeration to say that Olympus had lost more than half its previous strength.</p><br/><p>“Ragnar. I will entrust the defenses of Jotunheim to you and Sigurd. It will become troublesome if the giants rise up again if they take advantage of the messy situation.”</p><br/><p>“I understand. Will Tyr-nim and Thor-nim lead the reinforcements?”</p><br/><p>“There’s a high probability they will. We are currently debating about who will go to Olympus and the Temple.”</p><br/><p>Heimdall spoke up to that point, inhaled some air and then spoke with a bit of leisure.</p><br/><p>“You should also know this but the war has just started. There’s still one week until the master returns from Erin….and nothing much will happen until then.”</p><br/><p>Everything needed some time. It would be difficult for the Temple and Olympus to fall in only one week.</p><br/><p>The 12 Olympians that turned spent almost two months taking over half of Olympus.</p><br/><p>“I hope so.”</p><br/><p>Ragnar spoke sincerely.</p><br/><p>But compared to their wishes, the situation quickly started to worsen.</p><br/><p>&amp;</p><br/><p>Four days since war erupted.</p><br/><p>The first restriction line of Olympus was destroyed.</p><br/><p>Apollo looked at the battlefield through the eyes of a believer who was at the brink of death and gulped.</p><br/><p>He had only just woke up from his sleep with Artemis a few days ago. However, he had no leisure to rest or recover.</p><br/><p>The ones who destroyed the first line weren’t just the forces of Memphis. There was a devastating cavalry troop that destroyed anything in their path.</p><br/><p>Apollo didn’t know well about them, but as the God of the Sun he could sense their power.</p><br/><p>The God of sun not from Memphis but from another world.</p><br/><p>And the forces he was leading.</p><br/><p>The life of the believer was coming to an end. Because of that Apollo opened his eyes widely and then looked at the God of sun of the foreign world and engraved his figure into his eyes.</p><br/><p>A huge snake with feathers.</p><br/><p>A shining man that had a snake around him, the man that became one with the snake.</p><br/><p>He noticed Apollo’s gaze. He turned to look at the believer and at that moment when their eyes met the body of the believer became light and disappeared.</p><br/><p>Apollo breathed roughly. He then searched in the library of the Gods and searched the name of the man he had seen.</p><br/><p>Not Memphis, but Maya.</p><br/><p>The one born with the fate to destroy the world, even though he was the God of sun and the master of his world, Quetzalcoatl.</p><br/><p>Apollo closed his eyes. As the God of Reason he judged logically and then accepted one truth.</p><br/><p>It was a combination of beings that wanted to destroy the world. Memphis and Maya had joined hands.</p><br/><p>The two worlds invaded Olympus together.</p><br/><p>&amp;</p><br/><p>Virudhaka, who guarded the south, was collapsed on the ground. He had covered his body with a red and thick armor, but his entire body was pierced by arrows as if that armor was paper.</p><br/><p>He didn’t even have strength to lift a finger. Because of that he just rolled his eyes and looked at a distant place. He could see Witacheon, who was the fastest one, hurriedly escaping.</p><br/><p>Flee. Stay alive and report the situation.</p><br/><p>Virudhaka transmitted his earnest wish and then looked at the front line again. He could see people standing still on the ground that dyed in red from the blood of tens of thousands of soldiers.</p><br/><p>The hero king Gilgamesh was standing with a grimace and had hung down his sword in silence.</p><br/><p>He was certainly strong. But the reason Virudhaka was defeated so one sidedly wasn’t only because of Gilgamesh’ own power.</p><br/><p>The ones that came with him.</p><br/><p>The old hometown of Virudhaka and part of the Temple- not Temple or Dilmun but another world.</p><br/><p>Xindu.</p><br/><p>They had allied with Dilmun. And the one leading them was the strongest among those that wanted to destroy the Xindu.</p><br/><p>The rival of the greatest hero of Xindu Arjuna, the son of the God of sun Karna.</p><br/><p>Virudhaka closed his eyes.</p><br/><p>The destructive beings from Xindu and Dilmun were together. Even if that wasn’t the case, it was impossible for them to stop the enemy alone as they were already at war with Kum Oh Do.</p><br/><p>‘Witacheon. Notify them of the danger. Ask for reinforcements from Asgard.’</p><br/><p>Virudhaka stopped breathing with that last wish. The forces of Dilmun and Xindu passed his corpse and marched.</p><br/><p>The fifth day since war started.</p><br/><p>The southern defenses of the Temple were annihilated.</p><br/><p>&amp;</p><br/><p>There was ten worlds.</p><br/><p>And there were beings lighting up fire at the south and north.</p><br/><p>Muspelheim.</p><br/><p>The land was covered entirely in flames. The Northern path of fire would stand at the vanguard of destruction and notify the end of the world.</p><br/><p>The giant of fire Surt stood up from that place. He, the king of Muspelheim, looked toward the south.</p><br/><p>And there was someone standing up from the south as if answering his gaze.</p><br/><p>The last of the ten worlds.</p><br/><p>Avesta, that was located between Maya and Xindu.</p><br/><p>The devastating monsters revelled in victory and raised flames that would purge the world.</p><br/><p>The Southern path of fire joined the kingdom of fire with the Northern path of fire.</p><br/><p>When Erin was destroyed and Asgard groaned due to the Great War, the rear worlds weren’t at peace.</p><br/><p>The ruinous beings from Maya and Xindu conquered their world with the assistance of Avesta, and then stretched their hands to Memphis and Dilmun.</p><br/><p>The evil dragon Azi Dahaka turned to look at its master.</p><br/><p>Angra Mainyu, who was the crystallization of evil answered the gaze of Azi Dahaka. As the World God who had suppressed Spenta Mainyu and Hermazd, e ordered</p><br/><p>Go forward. Burn down the ten realms.</p><br/><p>Avesta.</p><br/><p>The flames of the tenth worlds headed to the north.</p><br/><p>&amp;</p><br/><p>Urd, Verdandi, Skuld.</p><br/><p>The three sisters spun the spinning wheel and created the thread of fate. They looked at the fate of Asgard.</p><br/><p>Urd trembled in fear. Tears flowed from Verdandi’s eyes as the destined destruction that was even worse than the time with the Great War.</p><br/><p>Skuld clicked through the threads of fate. She discovered only one thread of hope that was mixed with the threads of despair.</p><br/><p>The God who was fated with the Goddess of Hell, Hela.</p><br/><p>The one that would decide the fate of Asgard once again after the Great War.</p><br/><p>“Tae Ho.”</p><br/><p>Skuld closed her eyes.</p><br/><p>And at that moment. She heard a voice.</p><br/><p>&lt; Episode 65 – The ten realms (4) &gt; End</p><br/>\n</div>"}