{"title": "Chapter 241 - Episode 69/Chapter 2: Absolutely Invincible (2)", "id": 242, "volume": 3, "url": "http://boxnovel.org/valhalla-saga-chapter-241-episode-69-chapter-2-absolutely-invincible-2", "volume_title": "Volume 3", "body": "<h1>Chapter 241 - Episode 69/Chapter 2: Absolutely Invincible (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 69/Chapter 2: Absolutely Invincible (2)</p><br/><p>TL: Tsubak</p><br/><p>ED:</p><br/><p>After killing the dragons of Asgard.</p><br/><p>And suppressing the dragons of the nine realms.</p><br/><p>“You will become the mortal enemy of dragons. You will get stronger every time you kill a dragon and you will annihilate other dragons with that strength.”</p><br/><p>Those were the last words of the evil dragon Fafnir, which he said to Sigurd that had cut his neck and got covered with his blood.</p><br/><p>That was a premonition and at the same time, a childish curse to all the dragons that would live in the world even after he died.</p><br/><p>And right at this moment.</p><br/><p>There was another dragon in front of Sigurd that was treated as the natural enemy of dragons. A strong being that couldn’t even be compared with the evil dragon Fafnir.</p><br/><p>But it was meaningless.</p><br/><p>That was still a dragon and couldn’t be free from the natural enemy of dragons.</p><br/><p>Hraesvelgr’s original body flew up with an angry intent. Sigurd rose his dragon killing force while raising Gram as if he would execute a stab at any moment and then covered the huge body of Hraesvelgr with all of that strength.</p><br/><p>The space snake Jormungand turned to look at Sigurd. It shuddered at the dragon killing force that was rushing at it.</p><br/><p>A moment.</p><br/><p>Sigurd and Jormungand didn’t clash but intersected. It was the result of the intentions of the two beings having coincided.</p><br/><p>Hraesvelgr’s body became a dragon killing sword and slashed past Jormungand. Jormungand, that had flinched and wanted to dodge Sigurd, avoided a direct hit by barely twisting its body but instead it could only give up attacking Nidhogg. Jormungand, that was falling down the sky like a thunder, crashed down in the end of a messy flight and then started to roll in the ground.</p><br/><p>Vedrfolnir turned Hraesvelgr’s body from a high place in the sky. Jormungand raised its head hurriedly from the ground.</p><br/><p>Sigurd didn’t stop.</p><br/><p>He charged towards Jormungand.</p><br/><p>&amp;</p><br/><p>[“I’m-Rolling!”]</p><br/><p>Nidhogg’s tail sweep hit Tiamat once again. Tiamat suffered big damage to the point she felt like her waist was getting bent and then released the power of destruction randomly after having vomited blood.</p><br/><p>It really was random. It wasn’t a controlled attack.</p><br/><p>But it was a strength that couldn’t be ignored. Nidhogg gritted her teeth and released the power of protection and then a huge wall of divinity covered the surroundings of Tiamat and prevented the power of destruction from flowing out. If it reached at least one person, then countless beings in the Golden palace would lose their lives.</p><br/><p>“We will press her down like this!”</p><br/><p>“Yes!”</p><br/><p>Nidhogg released strength once again at the order of Hraesvelgr. The black holy dragon pressed down Tiamat and prevented her from moving.</p><br/><p>Tiamat screamed and continued to release her power of destruction randomly as she couldn’t do anything after getting sat on by Nidhogg. Her struggle that could be described as being desperate wasn’t worthless at all.</p><br/><p>She was the first child born from the chaos and an ancient God of Dilmun. In addition, the current Tiamat had killed her old enemy Marduk and taken his strength. Suppressing her was even difficult for Nidhogg that was reborn as the guardian of Asgard.</p><br/><p>And it didn’t end there. Tiamat wasn’t alone. The 11 beasts at the Golden palace were amplifying the power of Tiamat.</p><br/><p>Tae Ho placed his hand on the shoulder of Nidhogg, that was struggling while doing her best, and then closed his eyes for a moment. Tae Ho had conquered various kinds of dragons until now but it was impossible with Jormungand and Tiamat. The two weren’t existences that could be subordinated.</p><br/><p>Jormungand inflicted damage to Thor only with its existence as it was born as the natural born enemy of Thor. Because of that it was impossible to coexist with it in the first place. They had to defeat it just like what they did with the World wolf to liberate the real power of Thor.</p><br/><p>Tiamat was a being that wanted to destroy the world. On top of that it was a being that was born from the ancient chaos and was the beginning of the beings that wanted to destroy the world. Although Tae Ho’s power of conquering dragons had gotten stronger after climbing to the seat of master it was impossible for him to suppress an ancient being and turn her into one that wanted to maintain the world.</p><br/><p>Sigurd was currently facing Jormungand. He was making a good fight but it was impossible to defeat it completely.</p><br/><p>Nidhogg’s and Tiamat’s divinity continued to clash at an overwhelming rate. If this situation continued Nidhogg wouldn’t end up safe even if they succeeded on suppressing her.</p><br/><p>That’s why Tae Ho had to move.</p><br/><p>“I will be back.”</p><br/><p>Tae Ho whispered in a low voice at Nidhogg’s ear and turned around. Adenmaha followed Tae Ho’s back hurriedly.</p><br/><p>[“I’m-Rolling!”]</p><br/><p>The fist of the black holy dragon hit the head of Tiamat. The divinities exploded at the same time and the power of destruction that Tiamat had been releasing like crazy dissipated for a bit.</p><br/><p>And at that moment a white dragon flew from the back of the black dragon. The White frost dragon. The Goddess of love and beauty Adenmaha.</p><br/><p>Tae Ho was riding on top of her. Tae Ho didn’t look at Tiamat or Jormungand but at the Golden palace. His role was to suppress the battle that had started again on that place and exterminating the 11 beasts to weaken Tiamat.</p><br/><p>Tae Ho lowered his posture and then placed his hand on Adenmaha’s back and activated his saga.</p><br/><p>[Myth ranked saga]</p><br/><p>[The warrior that rides on Goddesses]</p><br/><p>[Myth ranked saga]</p><br/><p>[The one that conquers dragons]</p><br/><p>[Myth ranked saga]</p><br/><p>The charge of a warrior is like a storm]</p><br/><p>Three sagas activated at the same time and at that moment the power of Adenmaha got amplified greatly. Blue thunder accompanied the white dragon so the sound of thunder was heard wherever she passed by.</p><br/><p>Adenmaha charged. She rushed towards the Golden palace and the ones fighting in the Golden palace turned to look at her charge.</p><br/><p>“Valhalla!”</p><br/><p>“For Asgard and the nine realms!”</p><br/><p>The warriors of Valhalla yelled with all their strength and welcomed their master.</p><br/><p>The Garuda that were fighting against the dragons in the sky shrunk down. They got caught in an instinctive fear and flew up trying to get farther away from Tae Ho.</p><br/><p>The 11 beasts that were fighting in different places glared at Tae Ho and Adenmaha. The biggest beast, Pazuzu, threw itself as if it was going to block his path.</p><br/><p>Pazuzu was a God of wind and at the same time a God of plagues that had the head and arms of a lion, wings and legs of an eagle, the tail of a scorpion and organs of a snake. The black aura of plague that surged up from the flutter of Pazuzu’s wings covered the body of someone looking like a giant.</p><br/><p>At least dozens of meters tall.</p><br/><p>He roared. Tae Ho glared at him fixedly and awoke his sentence of Erin. He inserted the golden lighted power of Erin into Adenmaha.</p><br/><p>“No.”</p><br/><p>Gilgamesh said suddenly. Karna also opened his eyes widely because he could predict what was going to happen after that.</p><br/><p>Adenmaha flew up and then changed her direction hurriedly in the air. She charged towards the ground, towards Pazuzu standing fearlessly.</p><br/><p>[Myth ranked saga]</p><br/><p>Tae Ho moved his fingers as if he was controlling a keyboard. He formed a magic circle composed by rune magic in front of Adenmaha’s path charging towards the ground from high in the sky.</p><br/><p>Adenmaha passed that and at that moment blue power got contained in her. Adenmaha’s appearance looked like a spear as a huge dragon flew while being surrounded by that.</p><br/><p>Pazuzu looked at Adenmaha. It realized that he wasn’t enough to beat her late but it was too late.</p><br/><p>[Dragon cannon]</p><br/><p>Draconic Ballista!</p><br/><p>Adenmaha struck the chest of Pazuzu. At the same time, the blue dragon of the aura that was covering her made a big flutter of its wings. The wings of the blue dragon increased by several layers and released an overwhelming power and then Adenmaha roared.</p><br/><p>Kwagang!</p><br/><p>A loud explosion burst out. Adenmaha pierced the chest of Pazuzu like that. But she didn’t lose the intent after that and continued to fly. The aura of the blue dragon still accompanied her and Tae Ho continued to give her the power of Erin. Adenmaha charged towards the second beast after having transformed into a holy spear.</p><br/><p>Mushufushu, that had the head of a horse, wings of a bird, the tail of a scorpion and two horns, moved its feet hurriedly but it couldn’t dodge the charge of Adenmaha. They clashed and the neck of Mushufushu and part of its upper body exploded with the blue aura.</p><br/><p>Pazuzu collapsed without being able to scream after a big hole got created in its chest. Mushufushu fell down after its head got cut off and that head rolled on the ground.</p><br/><p>The blue aura covering Adenmaha disappeared but she still tried to fly up with strong flutters of her wing.</p><br/><p>Tae Ho yelled on top of her back. He clenched the summoning rocks with his left hand and ordered.</p><br/><p>“Rolo! Dracon Ismenios!”</p><br/><p>[Myth ranked saga]</p><br/><p>[Master of flames]</p><br/><p>[Myth ranked saga]</p><br/><p>[King of violence]</p><br/><p>A red dragon and a golden dragon appeared at the sides of Adenmaha. They knew fully well who they had to face even without Tae Ho having to order them. They charged towards the 11 beasts that were driving back the commanders and the Gods of death.</p><br/><p>“Echidna!”</p><br/><p>Tae Ho called one more being. A huge winged snake appeared below Adenmaha that was soaring up. The ancient God of Olympus claimed her descent with a high and strong roar. She hadn’t recovered fully from the injury of Olympus but she still looked confident and exalted as ever.</p><br/><p>Two of the 11 beasts got defeated in an instant and then three dragons got added in the battlefield. Each one of them could be considered to be dragon Gods.</p><br/><p>Gilgamesh, that was riding on the lion headed beast Ugalu, gulped dry saliva. He then realized why the Kingdom of fire had set up a plan like the current one.</p><br/><p>The master of Asgard and at the same time the one that became the master of Erin.</p><br/><p>The savior that didn’t only rescue Asgard but also rescued Olympus.</p><br/><p>He had to stop him. If he left him as he was, the scale of the battlefield would tilt so much it won’t be able to be overturned.</p><br/><p>“Karna.”</p><br/><p>Gilgamesh looked at his side and said. The great hero of Xindu and at the same time the half hero gritted his teeth and looked at Tae Ho and Adenmaha. He gripped the weapons of Arjuna and Krishna and said in a low voice.</p><br/><p>“Buy some time for me.”</p><br/><p>Gilgamesh understood what was the request of Karna. He was a being that could release a much stronger force than Gilgamesh if some conditions were met and Gilgamesh had already confirmed that fact in the battle against Dilmun.</p><br/><p>That’s why Gilgamesh glared at Tae Ho instead of opening his mouth. He ordered Ugalu to charge in the air.</p><br/><p>Karna looked at the back of Gilgamesh. He looked at a more distant place to see Tae Ho and Adenmaha and then breathed in slowly.</p><br/><p>Karna and Gilgamesh had many common points. The two of them were human great heroes and were beings that obtained the blood of Gods.</p><br/><p>But there was a severe difference between the two of them that couldn’t be overcome at all.</p><br/><p>Gilgamesh was a being that wanted to maintain the world. Although he had become a being that wanted to destroy the world he was originally a strong king that protected Uruk. A lot of people loved him and his life was like the shining sun.</p><br/><p>But Karna was completely different. He had a precious bloodline for having been born between the God of sun of Xindu Surya and the human princess Kunti but his birth couldn’t get blessed. Karna’s mother, Kunti, was an unmarried virgin and in the first place she didn’t even love Surya.</p><br/><p>Kunti learned a mantra to call a God from one Brahman and then used it to test it without thinking much of it and the result of that was that she ended up calling the God of sun Surya.</p><br/><p>Kunti apologized for her foolishness and tried to send back Surya but he didn’t listen to her. He said that calling him and sending him back as if nothing happened was something that couldn’t be forgiven and scolded her away and in the end forced her to have a child with him.</p><br/><p>Kunti somehow managed to hide the fact that she was pregnant thanks to the help of the loyal lady attendants but it was impossible for her to give birth to Karna when she wasn’t even married and raise him.</p><br/><p>At the end of her ponder, Kunti held the recently born Karna in a basket and threw him in a river and then got discovered by a carriage driver couple and grew up as their child.</p><br/><p>He was more exalted than anyone but he got to live a lowly life.</p><br/><p>But his true tragedy was that he was born as a being that wanted to destroy the world.</p><br/><p>&lt; Episode 69 – Absolutely Invincible (2) &gt; End</p><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}