{"title": "Chapter 251 - Episode 70/Chapter 7", "id": 252, "volume": 3, "url": "http://boxnovel.org/valhalla-saga-chapter-251-episode-70-chapter-7", "volume_title": "Volume 3", "body": "<h1>Chapter 251 - Episode 70/Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Episode 70/Chapter 7: Sword of the World Dragon (7)</p><br/><p>TL: Tsubak</p><br/><p>ED: StellarRain</p><br/><p>Nidhogg was in a place not too far from Kum Oh Do. It was a flat leveled land, but the region was quite high that allowed for a complete view of the destroyed Kum Oh Do.</p><br/><p>‘We didn’t mean to, but it was solved in one go.’</p><br/><p>‘Right.’</p><br/><p>Not even Tae Ho could have imagined that Kum Oh Do would be destroyed that way. It was a misfortune that Kum Oh Do never expected.</p><br/><p>Tae Ho glanced at Kum Oh Do, that had become a land of death covered by remains created by the earthquakes, and then left the Heart Room.</p><br/><p>The body of Nuwa that the black holy dragon placed down on the ground was a huge snake about 50 meters long. 50 meters wasn’t small at all and was a bit bigger than Rolo after he transformed, but she looked comparatively small and cute as he had seen many huge things already.</p><br/><p>‘A bastard that’s not even 2 meters tall says that.’</p><br/><p>As Cuchulainn snorted Tae Ho approached the head of the snake and called out the name of Nuwa once again. The snake shut its mouth, lowered its head and then a beautiful woman appeared from its head.</p><br/><p>It was a woman with white skin and long black hair. She had the appearance of a human, but her yellow eyes certainly belonged to a snake.</p><br/><p>She was in a naked state without even a strand of thread on her. However, she gave off a natural and beautiful feeling rather than a sexual one.</p><br/><p>Nuwa looked at Tae Ho. Tae Ho hit his chest twice and saluted.</p><br/><p>“For Asgard and the nine realms.”</p><br/><p>“Let the light of the Temple be eternal.”</p><br/><p>Nuwa replied in the way of the Temple. Tae Ho opened his mouth again.</p><br/><p>“I’m the master of Asgard and Erin, Lee Tae Ho.”</p><br/><p>“You should already know this but I’m the ancient God of the Temple, Nuwa. Master of Asgard and the new Erin.”</p><br/><p>She grew a faint smile while softly speaking. She was in a really weakened state just like Astelone said, but she still had the peculiar dignity of an ancient God that had existed since the world began.</p><br/><p>“I heard the voice of the world when I woke up and sensed it. That I would meet with you. That I needed to do a few things to be able to meet you.”</p><br/><p>Nuwa spoke in a low voice and extended her hand to Tae Ho. It seemed like she wanted him to come closer.</p><br/><p>Tae Ho took a breath. It was because he sensed everyone looking at him through the eyes of the black dragon. Specifically he could feel Adenmaha watching him. It felt like she was a bit anxious.</p><br/><p>‘Let’s go.’</p><br/><p>Cuchulainn urged. Tae Ho approached Nuwa and she looked at his eyes once again. The eyes of a dragon got reflected in the eyes of the snake.</p><br/><p>“The end is nearing.”</p><br/><p>Nuwa prophesized like Nyx and at that moment Tae Ho realized one thing. The end Nuwa and Nyx spoke about didn’t refer to the Kingdom of Fire like Odin had guessed.</p><br/><p>“Asgard and the nine realms…the end of the ten realms. The end that exists because there was a beginning.”</p><br/><p>That was the natural flow. Even the Gods who could live thousands or hundreds of thousands of years would one day pass away.</p><br/><p>Nuwa continued to speak.</p><br/><p>“The proof is that the place Asgard call Muspelheim, the land where the flames of the north will start, has appeared.”</p><br/><p>Muspelheim was different from Asgard or the Temple. It didn’t belong to the ten realms.</p><br/><p>“That place only exists for the end. All the real ancient Gods that have existed since the beginning of the world and haven’t been contaminated would feel this.”</p><br/><p>Nyx, who had maintained the appearance of a pure ancient God before she descended on Zeus, had felt it. But Gaia hadn’t been able to feel it, as she created a body to descend on the mortal world and had cut off her strength.</p><br/><p>It was also obvious that Nidhogg wasn’t able to feel it. She was the successor of the ancient God Audhumla and not a true ancience God.</p><br/><p>“I heard the voice of the world after I woke up but I don’t know everything. I just sensed it.”</p><br/><p>Nuwa extended her hand. Tae Ho approached a bit closer and Nuwa, who was seated on the head of the snake, stood up and placed her forehead on Tae Ho’s.</p><br/><p>A part of Nuwa’s aura entered Tae Ho. Tae Ho didn’t reject it and didn’t stop Nuwa from taking some of his own aura. Information was exchanged naturally.</p><br/><p>“Dilmun, Xindu, Memphis and Maya… even Avesta, the only world where the destructive beings won completely, accelerated the end of the world. I think that their defeat is related to the end of the worlds. I think that there is a flow where the destructive beings get stronger and the beings of balance get weaker.”</p><br/><p>What Nuwa spoke about wasn’t a direct change in strength that was noticeable by their eyes. She was talking about a flow instead.</p><br/><p>And those words were kind of correct.</p><br/><p>Erin was destroyed.</p><br/><p>The birth of the World Wolf and the Space Snake had weakened Thor and Odin and drove Asgard into danger.</p><br/><p>The destruction of Olympus that Nyx, the Goddess of Night Nyx, had spearheaded also proceeded well.</p><br/><p>“If you haven’t been there, there’s a high possibility Asgard and Olympus would have already been swept away by the flames.”</p><br/><p>Tae Ho had stopped that flow. He saved Odin, rescued Nidhogg from the roots and changed the domain of the Great War. He had defeated the Magician King Utgard Loki and the World Wolf to save Asgard.</p><br/><p>It was the same for Asgard. Tae Ho had also saved the Temple. He stopped the Kingdom of Fire that was trampling on the southern regions, and now devastated Kum Oh Do that was threatening the Temple in the northern territory.</p><br/><p>If Tae Ho hadn’t existed Asgard, Olympus and the Temple would have fallen to the flow.</p><br/><p>Tae Ho gulped. He looked at Nuwa who was so close to him to that his breath reached her. He asked with a trembling voice.</p><br/><p>“But Nuwa-nim. If there really is something like a flow.”</p><br/><p>If the ten realms were heading to their end.</p><br/><p>What would he do? What was he to do about that natural flow?</p><br/><p>Nuwa smiled. He stroke Tae Ho’s cheek softly.</p><br/><p>“There exists a flow. But master of Asgard, the one who has already saved three worlds from the flow of the world. We are beings of balance. If the destructive beings are calling for destruction and are riding on that flow, then we have to face against them to maintain the world. We have to work harder to maintain the balance, even just for one more second.”</p><br/><p>And that wasn’t an impossible task. Asgard, Olympus and the Temple still existed in this moment. It was the result of having beaten the flow.</p><br/><p>Nuwa looked into Tae Ho’s eyes. She gazed into his eyes with her snake eyes and thought.</p><br/><p>She had now finished one of the several things she wanted to do for Tae Ho. Now, she had to finish the remaining things.</p><br/><p>But the moment she stroked Tae Ho’s cheek and was about to do the thing Tae Ho liked the most, she stopped. Tae Ho also froze. The ancient God and the new God who had just climbed to the boundary of ancient God looked back at the same time.</p><br/><p>To the west. In the direction of Asgard and Olympus.</p><br/><p>Nuwa’s eyes sharpened. Tae Ho spoke out loud.</p><br/><p>“Olympus.”</p><br/><p>The place Odin and Thor were fighting at. The world opposite from the Temple.</p><br/><p>Tae Ho and Nuwa sensed.</p><br/><p>The flow accelerated.</p><br/><p>&amp;</p><br/><p>The north and south of Olympus were burning.</p><br/><p>What burnt down the north was the flames of giants.</p><br/><p>They were the fire giants that came down from Muspelheim.</p><br/><p>Surtr held a burning sword and led the Path of Flames. The one who was completely covered in flames burnt the world just by walking.</p><br/><p>What burnt down the south was the flames of evil.</p><br/><p>The destructive beings arrived in Olympus with the evil dragon Azidahaka and Avesta aftering jumping over Maya and Memphis.</p><br/><p>The power of Anjra Mainiuu weakened as it left Avesta. It was because the World God could only release all of its power in its home world.</p><br/><p>But despite being weaker, his strength transcended imagination. That was the strength of a World God.</p><br/><p>Heracles, who was protecting the northern regions of Olympus, retreated to the mount of Olympus with his forces. It was because he wasn’t able to deal with Surtr just with his own power. If he wanted to stop Sutr then he needed the assistance of Olympus. Heracles was invincible when guarding the path to the mount of Olympus.</p><br/><p>Odin and Thor, who were guarding the south, also retreated. The attacks of Azidahaka and Anjra Mainiuu were really overwhelming. As Quetzalcohuatl and Set, who had avoided a battle with Thor, joined the battle, the two were unable to withstand the assault of all these monsters.</p><br/><p>Odin knew.</p><br/><p>Their attack this time was planned. When Tae Ho moved to rescue the Temple, Surtr and Anjra Mainiuu invaded Olympus at the same time.</p><br/><p>Actually, Anjra Mainiuu didn’t know much about Tae Ho. But Surtr did.</p><br/><p>He didn’t make light of the master of Asgard who had rescued Asgard and defeated Nyx.</p><br/><p>That’s why he had sent the Space snake Jormungand to the Temple. It was to hold Tae Ho’s attention in the Temple for just a bit longer.</p><br/><p>The Space snake Jormungand was defeated much faster than Surtr had imagined. It was due to the result of having the power of Nidhogg having transformed into the black holy dragon added.</p><br/><p>But that was enough with. Tae Ho attacked Kum Oh Do, the old enemy of the Temple while Surtr and Anjra Mainiuu invaded Olympus. The wall between each world wasn’t that low, so when Tae Ho received the news, the invasion should already be complete.</p><br/><p>Surtr continued to advance to the south.</p><br/><p>And Anjra Mainiuu headed to the north.</p><br/><p>Zeus decided to have a decisive battle at the peak of Olympus. Heracles also thought the same way.</p><br/><p>All the forces of the Kingdom of Fire gathered at the mount of Olympus. They would defend this place and wait for reinforcements from Olympus and the Temple.</p><br/><p>It wasn’t bad. It was a solid idea.</p><br/><p>But Odin felt that something wasn’t right.</p><br/><p>He looked at a map of light formed with runes for a long time and then realized one fact.</p><br/><p>Surtr and Anjra Mainiuu weren’t headed to the peak of Olympus. If you looked at their movement route you could see that the two were prioritizing joining with the other forces rather than invading the peak of Olympus.</p><br/><p>This wasn’t that weird. Although it may be less efficient than surrounding them from the south and north, joining forces into one big army was also another available option.</p><br/><p>But that wasn’t what the enemy was thinking. What they were hoping for wasn’t something like joining armies.</p><br/><p>Odin still didn’t have any evidence. It was just a feeling. But he could still be certain of it.</p><br/><p>The Paths of Flames of the north and south.</p><br/><p>Not the beings of balance, but the destructive ones.</p><br/><p>Odin raised his head. Not just him but all the Gods with power at the peak of Olympus could feel it.</p><br/><p>From the west of Olympus, where the Paths of flames of the north and south met.</p><br/><p>An existence that transcended the imagination of the Gods was being born.</p><br/><p>&amp;</p><br/><p>Surtr and Anjra Mainiuu faced each other.</p><br/><p>The Paths of the north and south were composed by destructive beings. Their wish was the destruction of the world and they would do anything to accomplish that.</p><br/><p>Surtr was the king of Muspelheim. He was a special existence that was elected to bring an end to the world.</p><br/><p>Anjra Mainiuu was the World God of Avesta. He was an exalted being that who managed to climb to the boundary of World God completely when even the Goddess of Night Nyx had only been able to in an incomplete state.</p><br/><p>But this was the first time they met. And both of them knew that this meeting wouldn’t’ continue for long.</p><br/><p>Sutr, the giant of fire extended his hand. Anjra Mainiuu, who had the appearance of a huge path of flames, was the one to approach Surtr this time.</p><br/><p>Surtr and Anjra Mainiuu released their bodies and chose to become one and be reborn.</p><br/><p>They couldn’t know who would be the one to be in control. Perhaps, a completely new ego could be born.</p><br/><p>But Surtr and Anjra Mainiuu didn’t mind. Because they were destructive beings. They chose the most certain method to bring destruction to the world.</p><br/><p>The Paths of flames of the north and the south became a single Path. Their power that could easily burn down a world multiplied several times.</p><br/><p>The final flames.</p><br/><p>The flames that would bring the end to the world and would burn down all the ten worlds.</p><br/><p>That thing arose. It was born in the west of Olympus.</p><br/><p>Odin folded the map of light. While everyone trembled in fear he came to a conclusion.</p><br/><p>They would give up Olympus.</p><br/><p>They would seal the connecting path and contain the flame in Olympus.</p><br/><p>It wasn’t a selfish idea but he didn’t care what happened to Olympus as he was a God of Asgard.</p><br/><p>This wasn’t a problem of a single world. It was a problem of Asgard and all other nine realms.</p><br/><p>He would give up Olympus and tie the monster down for a moment. He would lead all the forces of Olympus to Asgard and also gather the forces of the Temple.</p><br/><p>“Asgard.”</p><br/><p>The place where the final battle would take place.</p><br/><p>Odin didn’t hesitate anymore.</p><br/><p>&lt; Episode 70 – Sword of the World Dragon (7) &gt; End</p><br/><p>TL note: Thanks for reading~</p><br/>\n</div>"}