{"title": "Chapter 3", "id": 3, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-3", "volume_title": "Volume 1", "body": "<h1>Chapter 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The HR manager came back with the leaders’ comments, and Lin Qian was surprised at what they said.</p><br/><p>Well, surprised and moved a little. The wording was sincere and nice: “Miss Lin, since we, Aida, offered you this position, we won’t break our commitment because of the temporary difficulties in our operations. If you decide to stay, your pay scale will remain unchanged. As for your position, it won’t be set until the new CEO takes office. If you decide to leave, we wish you good luck on finding a better job in the near future.”</p><br/><p>While waiting for the HR manager, Lin Qian had Googled all the news about Aida Group on her cell phone. She thought about it, and answered sincerely, “Thank you. I’ll think it over and give you a reply tomorrow.”</p><br/><p>When Lin Qian left Aida Group, it was still early, barely 12 o’clock at noon. She walked home slowly. She ordered two dishes at the small restaurant near the entrance of her development and ate them in low spirits. She then went upstairs to her own apartment. After opening the window and turning on some music, she walked out to the balcony and gave Lin Mochen a call.</p><br/><p>It was around dusk there in the USA. The deep voice from Lin Mochen seemed to carry a kind of indolence and arrogance typical of Manhattan. “Your call came later than I expected.”</p><br/><p>She was suddenly frustrated. “Of course you knew about it.”</p><br/><p>The whole world knew about Aida’s recent dilemmas. How could this man, her brother, who worked specifically in financial investment on Wall Street, not know about it?</p><br/><p>Dressed in an iron-gray tailored suit, Lin Mochen stood in front of the floor-to-ceiling window on the top floor of a skyscraper. Behind him were staff members who were occupied with data analyses and investment reports.</p><br/><p>Through the window were starry lights sparkling all over the city and the Hudson River winding its way through the skyscrapers.</p><br/><p>He chuckled and asked, “What’s your plan?”</p><br/><p>“I’m still not going to work for you.” Lin Qian sounded sullen.</p><br/><p>Lin Mochen frowned a little but said in a flat tone, “Oh really? So where are you going to work?”</p><br/><p>Lin Qian replied, “I was thinking that I should stay at Aida.”</p><br/><p>In all fairness, despite the plight Aida was facing, “a lean camel is bigger than a horse,” as the old saying went. There was still the possibility that they would be able to strike back and return to their previous success. Besides, they had impressed her with the brief interaction they had today.</p><br/><p>“I feel a bit bad to give it up,” she said.</p><br/><p>Gazing at the starlight above the skyscrapers, Lin Mochen tapped the tabletop at his side with his fingers. “Lin Qian,” he said, “feelings are the most useless thing. As my sister, you should think more reasonably and objectively.” He came off cold and somewhat bossy.</p><br/><p>Lin Qian didn’t become annoyed. Instead, she went along with him and said softly, “All right then, brother, then could you help me with an objective analysis? Is it worth staying?”</p><br/><p>Lin Mochen kept silent for a moment, which made Lin Qian a little nervous.</p><br/><p>“You may give it a try,” he answered steadily.</p><br/><p>Lin Qian burst into laughter. She didn’t ask for a reason because the terminologies from him, like net asset value, yield rate, etc, would give her a headache.</p><br/><p>“Thank you, brother!”</p><br/><p>On the other end of the line, Lin Mochen’s lips also revealed a barely noticeable smile. “Xu Yong, the Chairman of Aida, is getting old and weak,” he said flatly. “He is no longer in charge of daily operations. His eldest son, Xu Yiyang, died in a car accident three years ago. Based on Xu Yong’s personality, I bet he won’t choose anyone outside of his family. So, there are only three candidates. First, Gu Yanzhi. Second, Xu Chengyan, his illegitimate son, still studying in the USA. And third, the son of Xu Yong and his ex-wife, details still unverified. I’ll check.”</p><br/><p>Hanging up the phone, Lin Qian buried her head in her arms and stared into the distance.</p><br/><p>After a while, something caught her attention.</p><br/><p>There was an army-green truck. It ran through the city along the highway and stopped outside the gates of Aida Group.</p><br/><p>Soldiers in camouflage uniforms jumped off the truck, each carrying a backpack. The truck drove away, leaving them standing there. Soon, someone came out of Aida and brought them in.</p><br/><p>Demobilized soldiers? Well, meeting those soldiers is the only good thing I’ve done the past few days. Are some of them coming to work for Aida?</p><br/><p>That’s when she made up her mind to stay.</p><br/><p>The next morning, after the induction, Lin Qian was taken to meet the legendary Gu Yanzhi.</p><br/><p>The whole building was surrounded by an indescribable air of depression, so it was refreshing for Lin Qian to walk into the office of this court-like room, which was stylish and spacious.</p><br/><p>Gu Yanzhi was sitting behind his executive desk and looking at Lin Qian, his new employee.</p><br/><p>As a candidate for Li Zhicheng’s assistant, she shouldn’t have been interviewed by him. But Li Zhicheng had rushed to the nursing home to see his father overnight, leaving the interview up to Gu Yanzhi. The boss had also discreetly given him an order to temporarily keep quiet. The secret, of course, referred to his identity and arrival.</p><br/><p>Gu Yanzhi had asked, “Why though?” Since Li Zhicheng had taken over the Group, he would have to meet all the staff sooner or later. Did it make any difference when he revealed his identity?</p><br/><p>“I need to know the situation first, ” Li Zhicheng stood by the window with his hands in his pockets and continued indifferently, “in an undercover way.”</p><br/><p>Dumbfounded for a second, Gu Yanzhi had suddenly understood.</p><br/><p>He had spoken in an emotionless way, but actually…</p><br/><p>He was treating it like a battle and planned to conduct secret strategical observations of his enemies before revealing his identity.</p><br/><p>Gu Yanzhi couldn’t help smiling with this in mind. He glanced at Lin Qian, who stood in front of him, and said steadily, “You must know the current situation of our company. The more difficult our situation is, the more we need talented minds to help. If you are skilled enough, you will naturally be put into an important position. But if you are mediocre, we won’t keep you as a burden. Everything is up to your performance.”</p><br/><p>It was an expected sentiment, tempering justice with mercy, so Lin Qian nodded calmly and said, “I will do my best.” Looking at the smile on his face, she thought, He doesn’t seem as sinister and difficult as the rumors describe him to be.</p><br/><p>Gu Yanzhi wasn’t in the mood to talk much, so after a short conversation he made a decision. She would work in the CEO office first, taking on the daily work of that department.</p><br/><p>So, Lin Qian’s career at Aida started without much of a formal introduction, and she immediately noticed that everyone’s work was nerve-wracking and chaotic.</p><br/><p>The CEO office sounded appealing, but there were only three people in total, including Lin Qian. The other two were new university graduates. The HR employee explained, “This department didn’t even exist until the former CEO came and established it. There were sixteen or seventeen people in its prime, but they all eventually left, one after another.”</p><br/><p>Lin Qian accepted things as they came. Advised by Gu Yanzhi’s secretary, she searched and collected industry information and news every morning, and then compiled a report for the leaders to reference. A duplicate copy of weekly work plans and summaries from every department in the company were sent to her, which she would make an independent report out of. Of course when any big incidents took place in or out of the company, she also needed to gather and summarize relevant news references.</p><br/><p>In short, she had to keep writing endless report after report.</p><br/><p>The job was tedious and boring, far away from actual business operations. Lin Qian didn’t like it. But she later thought that since she was new to the company and since she had come directly from the company’s competitor, it would be weird for them to put her in an important department in an important position at the very beginning. Thinking this made her feel relieved and she focused her attention solely on reports. After a few days, she was familiar with the basic information of Aida.</p><br/><p>But she wasn’t sure if Gu Yanzhi even read her reports as she sent every one to his secretary. Later, Gu told his secretary to secretly request that Lin Qian send a copy through email to an appointed email address every time she filed a paper report. Lin Qian looked at the email address: “[email protected]”</p><br/><p>Is “Apache” the English name of Gu Yanzhi? It doesn’t look like a personal name. Maybe it’s a word or an acronym. Urged by a whim, Lin Qian tried to figure it out, to no avail.</p><br/><p>On the weekend, Lin Qian got up early and took the bus to the nursing home on the other side of the city.</p><br/><p>Built after 2010, the Luyuan Nursing Home was the best and most comfortable nursing home in the city in terms of both facilities and space. Guided by a personal support worker, Lin Qian walked along the leaf-covered river wall with a bag of fresh fruit in her hand, and saw He Qingling sitting alone under a large tree.</p><br/><p>She walked up to her with light steps. “Mom…”</p><br/><p>In her fifties, He Qingling had wrinkles all over her lean face. She looked at her calmly. “Well, I see that you’re back.”</p><br/><p>Mother and daughter talked for a while. Lin Qian did the talking while He Qingling listened. Soon, He Qingling said that she felt tired and needed to rest.</p><br/><p>“I know you’re busy with work, so I won’t keep you,” she said.</p><br/><p>Sitting in a wheelchair, she was pushed away by the personal support worker. Lin Qian stood still for a while and took out her cell phone to call Lin Mochen.</p><br/><p>“I’m in the nursing home. Mom looks well.” She paused for a moment. “Would you like to talk to her?”</p><br/><p>It was probably late at night over on Lin Mochen’s side. She couldn’t hear anything but his calm breath.</p><br/><p>“Lin Qian,” he said, “I don’t need to know how that woman is.”</p><br/><p>Lin Qian didn’t respond.</p><br/><p>Since the year He Qingling had insisted on divorcing her husband, and each parent had started taking care of one child, Lin Mochen had refused to call her “Mother.”</p><br/><p>That afternoon, Lin Qian took a tour of the small town near the nursing home and then visited a former classmate living nearby. When she left the classmate’s house, it was past nine o’clock.</p><br/><p>She declined the offer of a ride from her former classmate. She didn’t want to take a taxi either. Instead, she strolled to the bus station alone. The night around the suburban area was dark and quiet. The platform was empty with only a street lamp glowing dimly.</p><br/><p>Soon, the last bus came.</p><br/><p>Lin Qian took a window seat in the back of the bus.</p><br/><p>It was a departure station. Most likely because it wasn’t the departure time yet, the driver spoke to her loudly. “Miss, keep on waiting. We’ll leave in another five minutes.” He then took a nap on the steering wheel.</p><br/><p>Lin Qian wrapped up her coat and looked out the window into the dark sky, her mind quiet.</p><br/><p>At that moment, she heard footsteps outside coming towards the bus. A tall man got on.</p><br/><p>Lin Qian took a casual glance at him and turned to look outside the window.</p><br/><p>A few seconds later, she suddenly turned to him again.</p><br/><p>Under the dim light of the bus, the man was dressed in a dark gray windbreaker, black sports pants, and outdoor shoes. At first glance, Lin Qian knew that they were basic articles of high-end brands. He wore a cap as well, the brim pulled so low that only his straight nose and clean-cut chin were exposed. Even without seeing his entire face, you could tell that he was handsome and neat.</p><br/><p>Lin Qian felt a skip in her heart.</p><br/><p>A feeling of deja vu came over her. His build and height were exactly like that man from before, and he had the same strong and unique sense of—how to describe it? Strength, defiance, and aloofness. Even if he did nothing, it was impossible for others to ignore his existence.</p><br/><p>He was striding towards her with his long legs. Lin Qian quickly turned to look out the window.</p><br/><p>His pace was steady yet brisk, passing her quickly. From the fuzzy reflection in the window, Lin Qian saw him sit down in the last row.</p><br/><p>The bus left.</p><br/><p>The night was as chilly as ice with a bright moon and sparse stars visible in the sky. The bus rattled along the quiet road.</p><br/><p>Sitting for a while, Lin Qian couldn’t hold back her curiosity. She simply turned around and looked at him directly.</p><br/><p>Well…</p><br/><p>He was sleeping again.</p><br/><p>He had positioned his tall body squarely in the seat. One arm was resting on the back of the seat in front of him, in which he had buried his face, and the other hand rested casually on his lap. The cap on his head covered his entire face. Not far from him, Lin Qian could hear his even breathing.</p><br/><p>Hi, Big Cat.</p><br/><p>Lin Qian held back her laughter.</p><br/><p>She leaned forward and lowered her head, trying to look at his face from underneath to see if he was the same man. But it was dim and shadowy on the bus and she could only see vague details of his profile.</p><br/><p>“What are you looking at?” A clear and deep voice burst out of the silence.</p><br/><p>Startled, Lin Qian swiftly straightened herself up and blushed. Lifting his head slowly from his arm, he stared at her patiently with his bright, black eyes.</p>\n</div>"}