{"title": "Chapter 8", "id": 8, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-8", "volume_title": "Volume 1", "body": "<h1>Chapter 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was a sunny morning. The sun shined on the vast and clean marble flooring in the Aida building, making its surface sparkle like bits of scattered gold. The plants in the indoor flower beds were neatly trimmed, and their flowers and green leaves were glistening in the sunlight after being watered.</p><br/><p>A group of staff representatives, led by the manager of the administration department, stood in front of the building’s doorway. Dressed in suits and holding flowers in their hands, they all waited expectantly.</p><br/><p>Upstairs, through every window, even through the shades, people were looking outside occasionally.</p><br/><p>The two younger girls in the CEO office, of course, couldn’t wait either. All morning, they kept glancing out the window while discussing in low voices what the second son of Aida’s chairman, who had never appeared in public before, would look like.</p><br/><p>Influenced by their conversations, Lin Qian felt a little restless too. She also kept looking outside without thinking.</p><br/><p>Finally, it was eleven o’clock, the scheduled time.</p><br/><p>Led by Gu Yanzhi’s Cadillac, several black cars drove in a line from the highway exit. The cheapest brand among them was Audi. They drove all the way up to the front of the company and pulled up to the building one by one.</p><br/><p>The two girls were amazed by the scene. With her chin in her hands, Lin Qian watched what was happening outside as well.</p><br/><p>It wasn’t long before everyone started getting out of their vehicles. Most of them were head managers from all the departments. Gu Yanzhi got out of the Cadillac from the front passenger seat, dressed in a well-ironed suit.</p><br/><p>One of the managers walked forward and respectfully opened the back door of the Cadillac.</p><br/><p>A young man got out.</p><br/><p>Dressed in a black suit, a white shirt and a pair of dark, shiny leather shoes, the young man had short black hair and stood out from the crowd with his height.</p><br/><p>Surrounded by the department managers being led by Gu Yanzhi, he walked up to the entrance. After some brief commotion, the front area grew quiet as all the higher-ups were in the elevator, heading directly to the top floor.</p><br/><p>Lin Qian still had a lot to do that day.</p><br/><p>Since the press conference, she’d had to keep a close eye on the competitors’ movements.</p><br/><p>Worthy of the nickname “Flagship” within the industry, New Bori had reacted more quickly than she had anticipated. They announced early that morning that they were going to hold a press conference that same evening. While SMQ was still remaining silent, it was said that Chen Zheng would make his position public in no time as well.</p><br/><p>The news about the “Aida Press Conference” had become the most popular topic overnight amongst industry news. There were also negative responses that accused Aida of simply staging a publicity stunt. However, they were minor and most likely from the competitors themselves. The mainstream media and the Internet had only praise for Aida. Lin Qian predicted that the positive responses would improve Aida’s low sales.</p><br/><p>But just by a little and that’s it. There’s no such thing as a business miracle that would allow one PR action to completely turn around a company.</p><br/><p>“Miss Lin Qian,” said the woman named Song Xianxian. Sitting on her seat, she turned to look at her and said, “I heard that the new boss is going to speak to every department head.”</p><br/><p>Another girl, Yang Xiru, also said, “Yeah, Miss Lin Qian, you might be called on sometime soon.”</p><br/><p>The pen in her hand stopped moving. Lin Qian looked up at them and said with a smile, “Mmm, we’ll see. I’m waiting for the call anytime now.”</p><br/><p>Song Xianxian and Yang Xiru both nodded and agreed with a smile.</p><br/><p>Since the day Lin Qian had started this job, the two girls seemed to follow her lead on almost everything. Looking at their expectant eyes, Lin Qian understood their intentions well. As newly-graduated business newbies, they were confused about most things and were eager for guidance. She had been the same way at their age.</p><br/><p>And ever since she had been dismissed from the task force, the two girls had basically taken her on as their leader, reporting everything back to her and accepting her assignments. Their respect for her was both heartwarming and flattering. She took things as they came and tried her best to give them good advice. Although she had only three years of work experience herself, she believed she could lead the two new graduates well.</p><br/><p>Their discussion about the new boss was distracting Lin Qian from the work she had been concentrating on.</p><br/><p>It reminded her of the night before.</p><br/><p>Ah, last night.</p><br/><p>After getting off the phone with Lin Mochen the night before, Lin Qian, on Li Zhicheng’s back, hadn’t been able to feel anything but her quickening heartbeat: ba-dum, ba-dum, ba-dum…</p><br/><p>“Let me down,” she said.</p><br/><p>Her new boss, the topic of all the gossip, stopped and loosened his hold, letting her slowly slide off his back. He straightened himself up after she was off.</p><br/><p>She quickly stepped aside, keeping a polite distance from him.</p><br/><p>Under the dim streetlight, he looked down at her. He looked even taller and more slender in the neat black coat, with his broad shoulders and narrow waist. He had a cool look on his sophisticated face, his eyes dark and focused.</p><br/><p>Lin Qian didn’t know what to say.</p><br/><p>He spoke up instead, still with a cool voice. “What?” he said steadily. “You don’t need me to carry you anymore?”</p><br/><p>What? Lin Qian exclaimed in her head. He asked why! Why would he ask me why I didn’t want to be carried anymore?</p><br/><p>Is he so used to helping others as a veteran that he doesn’t understand why an ordinary person like me would deny his help, or did he just overhear Li Mochen on the phone and is trying to figure me out, as my boss, and what else I know?</p><br/><p>Looking into his dark eyes, Lin Qian found that she couldn’t see through him.</p><br/><p>“Because… I just remembered that I have something else I need to do, and my ankle doesn’t hurt that much now. I won’t bother you anymore.” Lin Qian used a simple excuse and gave him a sweet smile. “Why don’t you go back and get some rest?”</p><br/><p>Hm, it was smart to say that. It won’t cause problems—whether he thinks I know him as a security guard or as a CEO.</p><br/><p>He stared at her flatly.</p><br/><p>“Mmm.” He put his hands in his coat pockets. “See you tomorrow.”</p><br/><p>Lin Qian kept her smile and replied, “Yeah, see you tomorrow.”</p><br/><p>He turned around and strode away in a cool and poised manner—as usual.</p><br/><p>Watching his back with the smile still on her face, Lin Qian suddenly realized something.</p><br/><p>Did he just say ‘see you tomorrow?’</p><br/><p>We don’t see each other every day. Did he speak without thinking or purposely with an implication?</p><br/><p>Lin Qian stayed where she was, confused again.</p><br/><p>She then figured that she must have been overthinking it. She was nervous at the fact that this quiet, solitary, veteran security guard was actually going to be the new CEO, and was the son of the previous CEO. He must not have meant to imply anything.</p><br/><p>Then, the next morning, as soon as she had arrived at the office, she and the other staff members were notified that the new CEO was coming in and that they should be prepared to greet him.</p><br/><p>See you tomorrow, indeed. Her new boss had simply spoken honestly by saying that to her.</p><br/><p>“What a great entrance our new CEO had!” Song Xianxian was still impressed by the great display from earlier.</p><br/><p>Yang Xiru echoed, “Yeah, it was really impressive!”</p><br/><p>Hearing their amazement, Lin Qian thought, Of course he came in with such a dramatic entrance. If I were him, I would have made the same decision. The company is now on the verge of collapsing. During this critical time period, the more powerful and superior the leader seems to be, the more confidence the staff will have in their new leader.</p><br/><p>Lin Qian couldn’t help but remember the night Li Zhicheng sat in front of her eating sweet potatoes. She remembered his tall figure, his hat, his quiet demeanor, and his cleanly-cut chin moving as he chewed.</p><br/><p>Obviously, he isn’t arrogant. He just comes off as cold.</p><br/><p>But now, no matter what kind of person he is, he’s been placed at the top position, to be looked up to by all of the employees in Aida. I have to look up to him as well.</p><br/><p>That evening, Lin Qian heard that every department head had been called in by the new CEO. Finally, the phone on her desk rang.</p><br/><p>It was Gu Yanzhi’s secretary. Li Zhicheng didn’t have a secretary of his own yet.</p><br/><p>“Assistant Lin, CEO Li would like to meet with you.”</p><br/><p>Stepping again onto the top floor where the senior management office was located, Lin Qian was a little excited. Her heart beating fast: ba-dum, ba-dum, ba-dum.</p><br/><p>She was pretty confident that Li Zhicheng would still offer her the position as CEO assistant.</p><br/><p>She knocked softly on the light-brown wooden door and heard a familiar cool voice from the inside. “Come in.”</p><br/><p>Lin Qian opened the door, with a smile as perfect as any anchorwoman’s.</p><br/><p>She took one step in when she abruptly stopped.</p><br/><p>He was standing in front of the tall window. The sunset outside was setting on the horizon, creating a magical and soft background light. He looked extremely slender and stood upright with his hands in his pants pockets. Hearing her footsteps, he turned around, and Lin Qian saw him from the front.</p><br/><p>There was no hat brim covering his eyes. His black hair was styled short and neat. His expensive, tailored black suit and ironed white shirt set off his clear dark eyes. When he stared at Lin Qian with a cool expression, she heard nothing but her heartbeat again.</p><br/><p>It’s a totally different look from when he is dressed in a military coat or a windbreaker. He looks poised and elite.</p><br/><p>Pulling herself together, Lin Qian spoke up with a bright smile on her face. “Hello, Mr. Li.”</p><br/><p>She had practiced this smile in her mirror the night before. It looked open-hearted, sincere, and genuinely cheerful. The smile was supposed to say, “So you’re the new CEO! What a lucky coincidence for us.”</p><br/><p>Of course, she was actually far more embarrassed than cheerful.</p><br/><p>Unexpectedly, Li Zhicheng continued to stare at her with his dark eyes as if he hadn’t heard her.</p><br/><p>In silence, they looked at each other, separated by the spacious room.</p><br/><p>She became a little uneasy.</p><br/><p>“I mixed up your position and I’m so sorry about that,” she gracefully said with the same sweet smile.</p><br/><p>This time, her boss finally spoke up, still in a calm and clear voice. Lin Qian, however, didn’t expect what he said.</p><br/><p>“Lin Qian, you don’t have to act… insincere.”</p><br/><p>Lin Qian started to feel her nerves twitching in her temples again.</p><br/><p>What did he say? Don’t act insincere? Does that mean he got the impression I’m acting fake or deceitful?</p><br/><p>Damn it!</p><br/><p>His eyes were still dark and calm, and Lin Qian couldn’t tell whether he was unhappy with her or was just joking.</p><br/><p>Or, is he telling me not to pretend and to be myself?</p><br/><p>Though her thoughts were a mess, Lin Qian still kept a calm smile on her face and replied quickly, “Mr. Li, this side of me is actually who I really am.” As soon as she finished speaking, she felt surprised by her own words.</p><br/><p>She thought that she could see a flicker of amusement flash in his eyes, but Lin Qian couldn’t be sure of it.</p><br/><p>He walked towards her and sat down on the sofa. His hands, with his long fingers and defined knuckles, rested on his knees.</p><br/><p>“Have a seat.”</p><br/><p>Lin Qian sat down obediently.</p><br/><p>Silent again for a while, he looked up at her and asked, “What should be my top priority right now?”</p><br/><p>Confused for a second, Lin Qian quickly understood what he was asking, which made her feel better about herself.</p><br/><p>She knew how it was supposed to go. Although there were job descriptions, it was actually someone’s individual performance that determined how much a person, as CEO assistant or secretary, could achieve and what status he or she could reach within the company.</p><br/><p>If you didn’t have skilled abilities and put yourself in a lower position, you would be treated as such, then quickly replaced, as you were of no special value to the leader. If you had the skills to both offer bright ideas and handle the lower jobs well, and if the ideas happened to coincide appropriately with the leader’s concerns, you would become invaluable. Everyone, from the CEO to the ordinary staff members, would look up to you.</p><br/><p>How could she not be happy hearing Li Zhicheng ask her this question?</p><br/><p>She paused for a moment and then spoke, following a script she had prepared earlier in her mind. “Mr. Li, I thought about this earlier. New Bori, Aida, and SMQ used to be the three best in the industry. Aida relied on having the best quality to maintain their status. We’re facing temporary difficulties now, but we still have a solid foundation, and we also have the chance to turn things around. But how I think we should turn things around are just my own opinions.</p><br/><p>“Market shares are usually based on a first come first served basis, so your market share will keep increasing once you finally land a big one, and vice versa. We can’t keep chasing New Bori and SMQ at a slow and steady pace. In no time, the market share they took from us will become fixed, and it will be impossible for us to catch up.</p><br/><p>“So, in my opinion, we need to launch a full recovery plan as soon as possible. The success from our recent PR actions gives us a good opportunity to do so right now. What we should do is find the right angle from this opportunity and turn things around.”</p><br/><p>After finishing her speech, she observed Li Zhicheng’s reaction. He still looked calm and emotionless.</p><br/><p>What are employees most afraid of? They fear that they won’t be able to read their leader’s thoughts and intentions.</p><br/><p>Lin Qian thought that right now she was, without a doubt, one of the most terrified employees ever, because her boss looked completely unreadable.</p><br/><p>She decided to be bold and try to display her loyalty while catering to his personality at the same time. She added, “Mr. Li, if we think of this in war terms, I’d like to be your adjutant, charging forward with a strong spirit and eagerly throwing myself into the fight.”</p><br/><p>Catering to one’s interests worked on everybody, including him; the use of the military metaphor finally triggered a reaction from him.</p><br/><p>He raised his eyebrows slightly, his eyes seeming clearer and sharper than before.</p><br/><p>A flicker of a rare smile flashed on his lips.</p><br/><p>“Mmm. Thanks so much for today,” he said, “and I’ll consider your suggestions, Adjutant Lin.”</p><br/><p>…</p><br/><p>Later that same day, when it was nearing midnight, Chen Zheng was just getting back home.</p><br/><p>He didn’t go straight to bed, but instead went to the study upstairs. As expected, he saw his father, Chen Yanmin, sitting alone and reviewing a company financial statement.</p><br/><p>In his teenage years, Chen Yanmin had started from scratch as a hard labor worker. After years of struggling, he had finally founded SMQ. As wealthy as he was now, he had an entirely different temperament from his son. Now in his fifties, he had never cared for sex, luxury cars, or anything else unnecessary.</p><br/><p>The one thing he loved was money. The thing he enjoyed doing the most was checking his inventory and properties every day. He was generous to nobody except for his son. And no one else could manage to get even a tiny piece of his private property from him. The industry had given him the nickname, “Stingy Chen.”</p><br/><p>Chen Zheng sat down in front of his father, took off his tie, and threw it on the desk, looking agitated.</p><br/><p>Chen Yanmin looked up at him from the account book. “Is everything finished?”</p><br/><p>Of course, he was referring to the Carcinogen Scandal. Chen Zheng nodded and cursed in a low voice, “Aida doesn’t know how bad they’re going down this time!”</p><br/><p>“What’s your plan?” asked Chen Yanmin.</p><br/><p>Chen Zheng chuckled. “They’ve made such a huge publicity stunt that it’s obvious they want to use this opportunity to make a comeback. We’ll see. I’ve instructed the vice president, who’s in charge of marketing, to cut down any of Aida’s attempts to do so at all costs. They’re going to try and make a breakthrough with their products to get more of a market share.”</p><br/><p>Unexpectedly, Chen Yanmin looked at him and said flatly, “Son, you’re focusing in the wrong direction.”</p><br/><p>Chen Zheng was surprised.</p><br/><p>Chen Yanmin gave him a faint smile and said, “It seems like you don’t even know what’s going on in your fight with Aida. The man, Li Zhicheng, had the guts to confront the whole industry. Obviously, he is a man who thinks big and acts bravely. Of course, he is also a man of excessive confidence and of little sophistication.”</p><br/><p>Chen Zheng listened attentively.</p><br/><p>Chen Yanmin went on. “A man of such character won’t take his time to wear you down in the consumer market. What he plans to do is probably more than you think. You can’t take him lightly. And right now, what business can he get within the industry that can offer him an opportunity to turn things around?”</p><br/><p>Chen Zheng’s face slowly dropped. “Are you talking about… the 40-million-dollar order from Ming Sheng Group?”</p><br/><p>Chen Yanmin nodded.</p><br/><p>Remaining quiet for a moment, Chen Zheng smiled. “The way things are now, Aida’s assets are not even close to being one fifth of ours. They won’t be able to compete with us on this order. If they do, we know that strength is everything.</p><br/><p>“I’ll offer our top products to Ming Sheng at our lowest prices. So low that Aida won’t be able to compete with us. Even if we lose money, we need to do this so they’ll lose any opportunity to get back on their feet. When they’re officially screwed and lose their market completely, we can start making money again.”</p><br/><p>Finally satisfied, Chen Yanmin nodded and said, “Very good.”</p>\n</div>"}