{"title": "Chapter 4", "id": 4, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-4", "volume_title": "Volume 1", "body": "<h1>Chapter 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“What are you looking at?” he said in a cool and deep voice.</p><br/><p>Lin Qian, caught in the act, blushed for only a second, and then quickly composed herself. Why should she feel ashamed?</p><br/><p>She stared straight at him.</p><br/><p>The rattling sounds of the bus continued, with the soft orange lights still on overhead. He sat upright, straightened his cap and looked up at her.</p><br/><p>There was no doubt that he had an attractive face. His eyes were dark and clean, like deep water with a dark reflection. His cheekbones were high, making his face appear clean cut. His thin lips were closed as if he were reluctant to speak, as usual.</p><br/><p>Overall, he looked handsome and put together.</p><br/><p>Lin Qian gave him a friendly smile. “I’m looking at you.”</p><br/><p>Without showing any other emotions, his eyes were clear and calm.</p><br/><p>She continued and said, “You look like a soldier I’ve met before.”</p><br/><p>Having finished her explanation, Lin Qian waited for his reply. To her surprise, he raised his hand and pulled his cap back down. Apparently losing his last bit of interest, he leaned back in his seat and began to sleep again.</p><br/><p>Lin Qian watched him silently.</p><br/><p>The bus then entered a more urban area. The city lights flashed through the windows. There were more passengers getting on and it was becoming crowded.</p><br/><p>Putting in her headphones, Lin Qian also leaned back in her seat and looked out of the window at the brightly-lit streets. But she couldn’t ignore the presence of the man behind her, even if he was resting. He finally straightened back up in his seat, appearing taller with his long legs stretched out. The cap brim blocked his eyes, which made Lin Qian unsure if he was asleep or looking at the outside view like she was.</p><br/><p>She was, of course, too shy to immediately turn around again and look at him.</p><br/><p>After a while, she couldn’t help but take off her headphones and turn around. “Hey, are you the same man or not?”</p><br/><p>He sat still, not even looking up.</p><br/><p>“Mmm.” His voice was low.</p><br/><p>Lin Qian grinned. “Okay, thank you.”</p><br/><p>She turned around. Determined not to harass him again, she pulled her coat hood over her head, curled up in her seat, closed her eyes, and began to sleep.</p><br/><p>Nothing major happened on the way.</p><br/><p>“This is the last stop! Everyone has to get off. You two in the back, wake up!” The rough voice woke Lin Qian up. Opening her eyes, she saw that the bus was parked at a platform, and the familiar gate of Aida Group was not far away across the road.</p><br/><p>“Oh,” she exhaled, but abruptly paused. At the bus door, a few steps away from her, was his slim figure striding through the exit.</p><br/><p>Lin Qian was surprised. She had thought he would get off back in the downtown area.</p><br/><p>It was already past ten o’clock. The road was quiet and dimly lit. He walked straight, two hands in his pants pockets. Lin Qian was walking behind him, a dozen steps away. There were only the sounds of their footsteps echoing off the long road.</p><br/><p>Wouldn’t he think she was stalking him? She was amused by this thought.</p><br/><p>Halting his walk, he stopped at the company gate. Lin Qian stopped too without thinking.</p><br/><p>He turned to look inside.</p><br/><p>He was standing right under the light, the cap brim casting a shadow over his clean-cut profile. Under his straight nose, the corner of his mouth was slightly raised.</p><br/><p>Huh, is he smiling?</p><br/><p>At that moment, a clamor of footsteps and voices drew close. Several security guards came out of the Group gate excitedly.</p><br/><p>“Commander!”</p><br/><p>“Major!”</p><br/><p>“You’re finally here!”</p><br/><p>Though confused for a moment, Lin Qian soon smiled too.</p><br/><p>She kept walking but casually stole a few glances at them from the corner of her eye. She saw him surrounded by the soldiers who used to be under his command; they were all chatting energetically. She had no idea what they were talking about. The security guards burst into laughter at hearing his responses. He stood upright and kept a slight smile on his face.</p><br/><p>One guard turned around and saw Lin Qian. He looked surprised.</p><br/><p>Lin Qian recognized him too: the soldier from her hometown that she had met on the train.</p><br/><p>“Hey isn’t that… Miss Lin!” he exclaimed loudly. “Commander, it’s Miss Lin! We met the other day on the train. She’s right over there!”</p><br/><p>Lin Qian stopped at hearing his exclamation.</p><br/><p>Sir, you really don’t need to let him know I’m here. He’s sharper than all of you guys.</p><br/><p>Hearing this, everyone turned around and looked at Lin Qian. So did the commander, with no expression but his dark, relaxed eyes under the hat brim.</p><br/><p>Lin Qian walked over, calmly composed. “Hi, everyone!” She looked directly at him on purpose. “Hello to you too, Major.”</p><br/><p>It was always nice to meet old friends; whether it be for the recently-unlucky Lin Qian, or for the newly-arrived security guards. They had a friendly discussion (of course not including the Major, who stood quietly to the side for the entire conversation). Lin Qian learned that they had all been assigned to work for Aida.</p><br/><p>As for his position, no one brought it up, and Lin Qian didn’t ask either.</p><br/><p>It was getting late. The group of security guards all crowded around him, saying they were going out for drinks. The apartment Lin Qian was renting was in the other direction, so she said goodbye to them with a smile.</p><br/><p>She hadn’t walked two steps when she heard footsteps chasing behind her.</p><br/><p>It was the neighbor-soldier with a kind smile on his face. “Miss Lin, I can walk you home.”</p><br/><p>Lin Qian said, “Oh, it’s not necessary. I live really close. I’m right over there, in that building.”</p><br/><p>He didn’t listen, just continued to walk by her side. “Yeah, it’s our battalion commander’s—Actually, I should call him ‘Boss’ now. He gave me the order. I have to walk you home. And it’s dark out here and not safe for a girl. Let’s go.”</p><br/><p>Lin Qian was surprised.</p><br/><p>The commander? Sending someone to walk her home?</p><br/><p>She turned around quickly, only to see the group of people disappearing back through the Group gates.</p><br/><p>Lin Qian smiled at him. “He’s the manager now?”</p><br/><p>The guard answered quickly, “Mmm! Don’t you know about it? Our battalion commander also came to work for Aida. But he has a high ranking, so I’m guessing he will be a manager or a middle-level leader. We’re all predicting that he’ll be the security manager.”</p><br/><p>Before falling asleep that night, Lin Qian laid down in her bed in a good mood.</p><br/><p>My brother is right. Women are emotional creatures. Just thinking about how a nice group of people like them would be working alongside her in the difficult environment of Aida Group warmed her heart.</p><br/><p>And then there is the strange major.</p><br/><p>The friendly guard had just told her information on the major. His name was Li Zhicheng. He was 25 years old and the youngest major in the greater southwest military area. Reserved as he was, he was quite famous in the army.</p><br/><p>Such a handsome and cool security manager! It’s hard to believe.</p><br/><p>The next day, Lin Qian arrived at the office and quickly discovered some bad news.</p><br/><p>Earlier in the morning, a shocking news headline had quickly put the entire media in a frenzy: “High-end handbags contain carcinogens. Top three in the industry are involved!”</p><br/><p>Murphy’s law stated that things always tended to get worse. Lin Qian thought that Aida had already fallen to the bottom of the valley. Who knew that there was still such a dangerous swamp underneath the valley waiting to swallow it up?</p><br/><p>A few days later, the sun was setting and the dusk light was beginning to fade. Carrying a stack of reports, Lin Qian walked out of the elevator and onto the top floor.</p><br/><p>Before reaching Gu Yanzhi’s office doors, she heard him shouting angrily.</p><br/><p>“Who the hell wrote this kind of foolish news!?”</p><br/><p>Lin Qian’s heart sank.</p><br/><p>The Carcinogen Scandal had been going on for two days. The situation was especially bad and had only gotten worse.</p><br/><p>The carcinogens did exist, but the quality inspection agency had verified it was the fabric that was the problem, and this batch of high-grade fabric was supplied by European manufacturers.</p><br/><p>However, the domestic consumers wouldn’t buy it. Recently, convinced by the massive criticism in the media, the public outrage was getting high. Several big companies, including Aida, were experiencing an extensive return of goods, and some customers even claimed that they were going to file lawsuits.</p><br/><p>The pressure from government authority was even worse. This scandal seemed to put the entirety of Aida Group into a difficult haze.</p><br/><p>The secretary near the doorway gave Lin Qian a helpless smile.</p><br/><p>Lin Qian laid down the reports. “Here are this week’s reports and then a report solely on the crisis.”</p><br/><p>As she walked back to the elevator, she heard the two front desk ladies muttering, “Hey, who was that handsome guy just now?”</p><br/><p>“A friend of President Gu, I think. They say he’s a demobilized soldier.”</p><br/><p>Lin Qian’s reports, together with a pile of other documents, were put on Gu Yanzhi’s office desk. They were untouched until later, after dark, when a large hand picked her reports out of the pile and looked through them carefully, one page after the other.</p><br/><p>Gu Yanzhi had lost his temper for the last few days, up until a couple hours ago. Still, he wasn’t relieved at all.</p><br/><p>So far, their competitors, including New Bori and SMQ, had all kept silent. They were suffering from the same consequences. It was still a controversial topic within Aida’s management as to how to handle the crisis.</p><br/><p>Some were suggesting that they take the initiative to apologize and accept the blame.</p><br/><p>But even more people thought that they should stay silent because, “The nail that sticks out the most gets hammered down.” After all, this was what the other enterprises, those that were better off than Aida, were doing.</p><br/><p>As the interim leader before the new guy took office, Gu Yanzhi would be under great pressure no matter what decision he intended to make.</p><br/><p>He turned around and saw Li Zhicheng sitting on the sofa with his eyes fixed on the papers in his hands. He took off his tie, left it on the table, and walked over. “What are you reading?”</p><br/><p>Li Zhicheng didn’t even bother to raise his head.</p><br/><p>Compared to a few days ago when he had first come to the office, with his silent and cold behavior, he now seemed to have adapted much more to his surroundings. He leaned his long body back into the sofa, looking relaxed. He even had his legs slightly crossed, appearing casual and relaxed.</p><br/><p>“You didn’t read it?” he asked slowly.</p><br/><p>Gu Yanzhi sat down beside him and shook his head. “You know I don’t like reading this stuff. For me, important information comes from discussion, not from reading. A piece of information revealed accidentally by an important or even an unimportant person is sometimes more useful than a 100-page report.”</p><br/><p>Li Zhicheng didn’t offer any comments and just kept reading. Seeing him highlight a paragraph, Gu Yanzhi became interested and bent over.</p><br/><p>After reading it over, he paused for a bit and then laughed.</p><br/><p>The report from Lin Qian included a suggestion on how to deal with the current crisis. Her opinion was that Aida should be the first to stand out by apologizing and taking the blame.</p><br/><p>In the first part of her report, she used a large portion to cite many successful cases of PR crises as examples. She also had an analysis of consumer mindsets. Overall, it was detailed, clear, and quite impressive.</p><br/><p>The paragraph highlighted by Li Zhecheng read:</p><br/><p>“As the first to apologize, Aida will also put the competitors in a more difficult position. If they don’t follow our lead, they will be put under public criticism and outrage, and the pressure on them will intensify. They’ll have to apologize as well. But even if they do, in the eyes of consumers, only the first one who stands out and apologizes has real sincerity, while the others are just followers, doing so without having another option. Their reputation will be tarnished. All the companies have suffered the same financial loss but will each rebuild their reputations differently. Aida could take advantage of this incident to effectively attack the competitors as well.”</p><br/><p>Gu Yanzhi straightened up. With his arms crossed and one hand on his chin, he said, “Not to say whether her point of view is correct or not, but how could such a sweet-looking girl come up with such a ruthless idea? She’s determined to somehow harm the competitors.” He smiled at his own words.</p><br/><p>Lin Zhicheng smiled slightly too. He put down the report and left it on the coffee table beside him.</p><br/><p>Gu Yanzhi asked, “When do you intend to step up into the position?”</p><br/><p>“I’ll take over when this crisis has been handled.”</p><br/><p>Early next morning, an announcement was dispatched to all the departments in Aida.</p><br/><p>The company had decided to set up a task force to deal with the crisis. The task force consisted of ten people, the strongest of each key department. It was required that they move into the Group dorm for closed supervision. And Lin Qian, a name unfamiliar to them all, was strikingly listed at the end.</p><br/><p>After receiving the notification, Lin Qian went home and packed up. She also took the time to call Lin Mochen.</p><br/><p>Lin Mochen’s response was nonchalant. “They’re testing you.”</p><br/><p>He was wondering on what grounds a new employee coming from a rival company would be put on such an important task force—even if she was talented. It was likely that they were testing her to see if she could be trusted and to find out if she was a spy from SMQ.</p><br/><p>Lin Qian didn’t take his warning seriously. “It must be my reports that have impressed the leaders,” she said. “They could think that I don’t need to be tested at all. I’ll take things as they come. They can bring it on.”</p><br/><p>Lin Mochen smiled at her arrogant comments. “Such a large company has collapsed very quickly. Maybe there really are spies in Aida. What nasty things are too far for some enterprises in China? I’m warning you, be careful.”</p>\n</div>"}