{"title": "Chapter 12", "id": 12, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-12", "volume_title": "Volume 1", "body": "<h1>Chapter 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was nearly two o’clock in the afternoon. Lin Qian had documents for the meeting prepared and carried them into Li Zhicheng’s office. When she opened the door, she saw him standing in front of the window, lost in thought.</p><br/><p>Lin Qian put the documents on his desk and was about to leave, when she heard his clear and cool voice. “You join me in the meeting.”</p><br/><p>Surprised at first, she soon became inwardly delighted. She remained calm and said, “Alright.”</p><br/><p>He was allowing her to participate in such an important and confidential strategic meeting. Lin Qian thought it meant that he trusted her. Well, young and inexperienced as he is, the boss knows how to judge people and use them.</p><br/><p>In the well-lit meeting room, eight people sat around a long, auburn-colored meeting table made of oak. These were Li Zhicheng, Gu Yanzhi, the vice CEO in charge of production and technology, the vice CEO in charge of functional divisions, the marketing director, the production director, the finance director, and the purchasing director.</p><br/><p>Currently, they constituted the core management team of Aida.</p><br/><p>Li Zhicheng sat in the middle. And Lin Qian had, of course, no place at the table but sat behind him on a seat by the wall.</p><br/><p>The meeting was hosted by Gu Yanzhi. His attitude was still free and easy despite the critical topic they were going to discuss. He looked around and said steadily, “Okay, let’s begin. I’ll say a few words first.</p><br/><p>“The meeting today is for discussing the future development of Aida. I believe you all know our current situation better than Mr. Li and I. Mr. Li just took over our company a short time ago. So the objectives and rules for today’s meeting are: practical and realistic attitudes, full and thorough discussions, a consensus on the direction of future development, and strict implementation of future development. Okay, Finance Director, you go first.”</p><br/><p>The meeting room was then silent. Lin Qian was impressed by Gu Yanzhi’s speech. What bureaucratese he’s speaking! But on second thought, he really did use every word purposefully!</p><br/><p>She glanced at Li Zhicheng and found him appearing calm and focused. Amongst the group of middle-aged people, he appeared extraordinarily young and handsome.</p><br/><p>At that moment, the finance director turned on the projector. After a brief overview, he went straight to the point and dropped a bombshell: “We’ve checked and found that after we have paid off the Carcinogen Incident, with both accounts receivable and accounts payable included in the calculation, the capital that the entire group can mobilize in the short-term is roughly…” He paused for a second and then continued, “Two to five million dollars.”</p><br/><p>Silence fell on the meeting room again. People looked at each other, speechless. Lin Qian felt her heart skip a beat. On her lap was a notebook, on the top left of which she had written “10 million.” She then crossed it out and instead inserted “2 million.”</p><br/><p>It turned out that the situation was even worse than what her brother had estimated.</p><br/><p>Two million dollars! What can a company do with two million dollars nowadays, especially a company of thousands of employees like Aida?</p><br/><p>She couldn’t help but glance at Li Zhicheng again, only to see him sitting straight and looking up calmly at the finance director, one hand resting on the table.</p><br/><p>The grand scene of when he had been escorted into the office by a fleet of expensive vehicles two days earlier came to Lin Qian’s mind. It was a great contrast to the current situation. Lin Qian started to take pity on him.</p><br/><p>After a moment of awkward, depressing silence in the room, it was the marketing director’s turn to speak.</p><br/><p>His name was Xue Mingtao. A capable man in his forties, he looked composed and refined. Lin Qian knew something about him: When the former CEO had been pushing to open foreign markets, Xue Mingtao had been treated lightly and given little power. Now that there was a new CEO, he had regained control of marketing. He had been an underdog for so long that he was ready to launch a marketing campaign to turn things around.</p><br/><p>As expected, he put forward a complete and systematic marketing plan.</p><br/><p>He started with the four categories of products in Aida: high-end leather bags, casual bags, bags with special functions, and luggage. He then broke them down into dozens of small categories. In each small category, he made an analysis of current markets, pointed out Aida’s advantages and disadvantages compared to the competitors, suggested ways of improvement, and proposed marketing strategies and plans.</p><br/><p>For example, the quality of Aida’s men’s mountaineering bags wasn’t so good, so he suggested changing product materials and strengthening quality control. In regards to trolley cases, in which the end-user marketing wasn’t adequate, he proposed a larger investment in advertising and more sales teams.</p><br/><p>It was a profound, detailed plan. Someone without years of marketing experience or a deep understanding of the sales of the company wouldn’t be able to make such a plan. It was like a map, not only with an overall objective, but also with detailed outlines for improvement on every single item. It was reassuring for the others to hear such a plan.</p><br/><p>Marketing and sales were the core of Aida’s business and also the focal point of the meeting. So, upon hearing his speech, the other managers whispered to each other with excitement. The atmosphere in the meeting room became lively.</p><br/><p>A light smile on his face, Gu Yanzhi nodded repeatedly at Xue Mingtao. Li Zhicheng took the printed presentation material and looked through it one page after another while listening to Xue Mingtao. Lin Qian even saw him take some notes on it.</p><br/><p>Lin Qian found the speech instructive as well; she felt as though she were taking a lesson. She just hoped that Xue Mingtao would mention the Ming Sheng project so that her idea could be reinforced.</p><br/><p>But he didn’t. Xue Mingtao’s concluding remarks at the end of his speech were: “We will rebuild the Aida marketing empire in the next five years!”</p><br/><p>Everyone else nodded. But Lin Qian was a little disappointed.</p><br/><p>The room became quiet again. Everyone looked thoughtful, and some stole glances at Li Zhicheng, trying to deduce how the new boss would react to the development plan, which seemed to be the most reliable one up until now.</p><br/><p>Li Zhicheng put the documents down on the table and looked up.</p><br/><p>So, all eyes fell on him.</p><br/><p>“Good plan,” he said slowly. “I’ll study it.”</p><br/><p>Xue Mingtao’s face gleamed in delight. Lin Qian gave Li Zhicheng a thumbs up in her mind: Boss, how cool you are to stay so calm and collected!</p><br/><p>But Li Zhicheng went on to say, “Someone suggested to me that we get the Ming Sheng Group project and that it could save Aida. What do all of you think?”</p><br/><p>He said it with a calm stare, sitting upright.</p><br/><p>Sitting behind him, Lin Qian felt her heart beating faster.</p><br/><p>Someone? Does he mean me?</p><br/><p>After a moment of silence, Xue Mingtao took a report out of his folder on the table and handed it to Li Zhicheng. “Mr. Li, concerning the Ming Sheng project, we have also done a SWOT analysis. The project is, of course, very good. If we can get it, we can quickly change Aida’s position in the industry and open a new market as well.</p><br/><p>“But, frankly speaking, we face two strong competitors: New Bori and SMQ. We haven’t had any involvement yet, while they have been following up with Ming Sheng for months, establishing a network of contacts. We’ve never had any state-owned enterprise as a client before. If we join the competition, our chances of success will be slim. Besides, they have been keeping a vigilant eye on our movements. So even if we win the project, I think it would be a Pyrrhic victory, with little or no profit. I don’t think it’s worthwhile.”</p><br/><p>Li Zhicheng remained silent.</p><br/><p>Although Lin Qian was present at the meeting as an observer and minute taker, she still felt great pressure hearing Xue Mingtao’s words. It was true that she had been too optimistic about the project, only considering the benefits that the project could bring and its ability to save Aida. The realistic difficulties brought up by Xue Mingtao, to which she hadn’t given any serious consideration, were actually vulnerable points in marketing: a late start, no network, and no money. On what grounds could Aida compete against the others?</p><br/><p>At that moment, the vice CEO in charge of production and technology, who had been quiet, suddenly spoke up.</p><br/><p>His name was Liu Tong. About 50 years old, he was a long-term employee and had been the number one aid to Aida’s Chairman Xu Yong in the inception of Aida. Sitting in front of Li Zhicheng, he didn’t appear cautious or tentative like the others. Instead, he looked open, candid, and even a little paternalistic.</p><br/><p>“Zhicheng,” he said, “I don’t agree with getting involved in the Ming Sheng project and opening a new market. Was Aida not ruined by this type of idea? Are we going to repeat the same mistake? As a company dealing in luggage and bags, our biggest market should be with millions of domestic end-users. Since the market has been taken by others, we need to get it back. The government or enterprise procurement is utterly inadequate to solve our problem, as it usually requires high standards and low prices in their orders. I don’t agree with accepting that kind of order. I side with Mingtao. We should make a solid effort to re-establish the end-user market!”</p><br/><p>A straightforward man, he spoke with dignity and determination. Most people nodded as his words resonated with them.</p><br/><p>But Lin Qian frowned.</p><br/><p>And Li Zhicheng still remained silent even though it was obvious that he had been targeted by Liu Tong. He had a strong, authoritative presence even when he was quiet, and no one knew what he was thinking. The meeting seemed to be in deadlock.</p><br/><p>Gu Yanzhi looked around and exchanged a glance with the vice CEO in charge of the functional divisions. The latter then broke the silence, trying to smooth things over. “Well, I think Mr. Li has heard our opinions. Maybe we should allow some time for Mr. Li to think them over, and we can discuss our priorities and future development next time?”</p><br/><p>Others nodded. Lin Qian thought, That might be the best way.</p><br/><p>Everyone looked at Li Zhicheng again. Trying to make it clear that it was nothing personal, Liu Tong added, “Zhicheng, I’m straightforward. I hope you don’t mind it and take my words into consideration.”</p><br/><p>Unexpectedly, Li Zhicheng nodded at Liu Tong; he looked around and said in his low, calm voice, “I don’t need any time for further consideration.”</p><br/><p>Everyone, including Lin Qian, was surprised.</p><br/><p>He continued to say, “I made my decision at noon: Get the Ming Sheng project at all costs.”</p><br/><p>…</p><br/><p>Later that afternoon, Lin Qian sat in her cubicle, sorting through the minutes of the meeting that had just ended, feeling a bit unsettled.</p><br/><p>That was probably because of what Li Zhicheng had said: “I made my decision at noon.”</p><br/><p>For Lin Qian, the key phrase was “at noon.” At that time, they had been eating a hot-pot when she had suggested he get the Ming Sheng project.</p><br/><p>Does it mean that my words had a great influence on him?</p><br/><p>Excited as she was, Lin Qian was under unprecedented pressure.</p><br/><p>He had spoken so firmly in the meeting that the atmosphere in the room had become awkward. Liu Tong’s gaze had changed instantly; Xue Mingtao had remained silent; the administration vice CEO had looked surprised. But before anyone could speak up, he had added, “Our company is in turmoil and we must work together. As the representative of the absolute shareholder, I have veto power. So, from now on, there may be numerous voices before I make a decision, but there can be only one after I make a decision. The meeting is over.”</p><br/><p>At this moment, his office door was closed. Gu Yanzhi and Liu Tong were inside with him. Lin Qian had no idea what the three bosses were talking about. At first she could hear Liu Tong speaking fiercely, but then nothing could be heard at all.</p><br/><p>After a while, the door finally opened. Lin Qian stood up at once and saw Liu Tong walking out with a sullen look, followed by Gu Yanzhi, who looked calm. It was hard for Lin Qian to tell how they felt. They didn’t pay attention to her but went directly back to their own offices.</p><br/><p>Lin Qian waited for a while before entering Li Zhicheng’s office to show him the minutes of the meeting she had just sorted out.</p><br/><p>She thought, There is no doubt that his behavior at the meeting today will cause quite a stir in the company. What will the managers and employees think of him? Authoritarian, paternalistic, and impersonal? Or will they think of him as determined, independent, and confident?</p><br/><p>For Lin Qian, she hadn’t quite expected that he, who usually appeared cool and quiet, could be so assertive and decisive.</p><br/><p>When she entered the office, the sun was setting, giving a touch of gold to the room.</p><br/><p>Li Zhicheng was sitting on the sofa in the middle of the room. A little different from his cool, upright posture as usual, he rested his hands on his lap and seemed to be lost in thought. On the coffee table in front of him were two steaming-hot teacups that had been left by Liu Tong and Gu Yanzhi.</p><br/><p>She walked briskly towards him and said, “Boss, these are the minutes of the meeting.”</p><br/><p>He looked up at her, his gaze calm and steady, took the minutes, and started reading.</p><br/><p>It was quiet in the room. Only the sound of his page-turning and the gurgling of the water in the goldfish tank could be heard. Unsettled as she was, Lin Qian spoke up.</p><br/><p>“I think the opinions of Mr. Xue and Mr. Liu today were profound and well-grounded.”</p><br/><p>Li Zhicheng looked up at her again. He was so close to her that she could see his sharp facial features more clearly. He said with a cool look in his eyes, “Are you wavering?”</p><br/><p>Lin Qian realized that while the boss talked to people in a succinct and concise way, he always directly got to the point—so directly that you had to wait a moment before you could react.</p><br/><p>She had wanted to speak tactfully, but now that he had asked so, she shook her head. “No,” she answered, “I’m not wavering. What I meant to say is that their analyses are complete and well-grounded, but they focus too much on the inside, such as how to solve our inner problems and how to improve ourselves. Nowadays, the outside competitions are so severe that unlike years ago, we might not win the market even if our products and staff members are high-quality. That’s because the competitors can do just as well as we can.</p><br/><p>“I have been insisting on the Ming Sheng project not because I believe we can definitely succeed in the project, but rather because I don’t think the traditional way can work any longer. I’ll make an analogy, which might not be appropriate: If New Bori and SMQ are like elephants, Aida is like a lamb. Can a lamb defeat an elephant by improving itself? I don’t think so. The only chance for it to win is to carry out a surprise attack.”</p><br/><p>She spoke freely and openly. When finishing, she looked up at Li Zhicheng. His eyes were bright and fixed on her, but he still looked calm and cool.</p><br/><p>Then he replied to her long speech with only three words: “I trust you.”</p>\n</div>"}