{"title": "Chapter 13", "id": 13, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-13", "volume_title": "Volume 1", "body": "<h1>Chapter 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The cold moonlight gleamed through the window; there were few stars in the night sky.</p><br/><p>Lin Qian was in her pajamas. She sat on the bed with her legs crossed, chin held in one hand, staring blankly ahead of herself.</p><br/><p>“I trust you.” Li Zhicheng’s voice, low and clear, was still lingering in her ears and swirling around her head.</p><br/><p>There was no denying that Lin Qian was starting to feel a little off.</p><br/><p>The feeling had actually started when he’d said, “Someone suggested to me that we get the Ming Sheng Group project.”</p><br/><p>Her uneasiness had amplified when he’d said, “I made my decision at noon.”</p><br/><p>When he had lightly said “I trust you,” the somehow-overwhelming feeling had finally made her realize that the uneasiness and excitement inside her was flattery.</p><br/><p>Her entire career she had been valued no matter where she was. Her university professor used to depend heavily upon her, and she had been the backbone of several student organizations. While at SMQ, she had been such an excellent employee for three years in a row that the boss, Chen Zheng, had valued her a little bit too much…</p><br/><p>It seemed a completely different story being valued by Li Zhicheng.</p><br/><p>Li Zhicheng didn’t have any experience from the business industry; he was a soldier, a man of action.</p><br/><p>Lin Qian hadn’t once heard him acknowledge his employees except for this instance of him telling her “I trust you.” It made her feel more valued than hearing it from someone else would have.</p><br/><p>Lin Qian felt like she had become a crafty, misleading worker. But wasn’t this the truth? The young boss, dazed and confused, relied heavily on her, and had a misleading representation of her in his mind. She had forced her flawed idea onto the company by sweet-talking him, in a way. This was the result of him traveling around the company incognito and knowing her beforehand; the result of him appreciating her character as well as her talent. Another thought popped into her head, ludicrous and ambitious, but she ignored it.</p><br/><p>Whatever it was called, all these opportunities had placed her in the perfect position to become important to Aida.</p><br/><p>The thought made her pick up her phone and dial Lin Mochen’s number.</p><br/><p>Hearing her request, Lin Mochen smiled slightly. “Why? You came across so much trouble during the three years you worked at SMQ and you never once asked me for help. You’ve been the assistant of Aida’s president for just three days and you’re already asking me to help your boss?”</p><br/><p>Lin Qian laughed, “I’ve got everything under control. Don’t you trust my judgment?”</p><br/><p>…</p><br/><p>The next morning, Lin Qian sat at her desk, holding a working plan for the Ming Sheng Project. It had been finished over a few nights by the marketing department.</p><br/><p>Following what Xue Mingtao had said the other day, it was mentioned in the working plan that the biggest challenge at the moment was building a relationship with the clients. And the most important part of that relationship was obviously their senior managers.</p><br/><p>Ming Sheng played a decisive role in the country, and their senior leaders were important figures in the national business industry. A private enterprise like Aida didn’t even come close to their standard.</p><br/><p>Considering they had just started, the best case scenario would be connecting with the same level as the office manager and procurement director. To reach the senior level, it would definitely take some time and a few key opportunities. The worst case scenario was that they wouldn’t be able to contact them and meet with their senior managers before Ming Sheng officially started the bidding. That would be a failure for the project.</p><br/><p>Xue Mingtao walked out of Li Zhicheng’s office with a few marketing directors. They all looked serious and in a hurry as they rushed out. Lin Qian took the advantage. She went into the office after knocking on the door.</p><br/><p>Instead of sitting behind the big desk, Li Zhicheng sat in the middle of the couch. He was deep in thought, with his arms resting on the knees, and fingers crossed, holding the chin.</p><br/><p>Considering it was quite rare to see him so focused, Lin Qian slowed down. She first put away the paper cups, then added some hot water into his large canteen before bringing it to him.</p><br/><p>He then finally looked up and stared at her, quietly waiting for her to say something. Li Qian smiled, “President Li, regarding the Ming Sheng Project, maybe I can—” Before she could finish, the door was pushed open. Gu Yanzhi walked in. Seeing them in the office together, his facial expression remained the same. He walked straight to the couch next to Li Zhicheng, “Let’s have another discussion about it.”</p><br/><p>Li Zhicheng remained silent; he turned to Lin Qian, “You can continue.” Gu Yanzhi also raised his eyebrows, staring at her.</p><br/><p>Lin Qian paused a little before cutting to the chase. “My older brother is working for an investment company in America. His previous employer, DP Investment Group, was the foreign shareholder that held part of Ming Sheng’s tradable shares. He is on good terms with them. I’m thinking, if it’s convenient, we could have him help us connect. Maybe that way we could arrange President Li to meet up with the senior managers from Ming Sheng.”</p><br/><p>Lin Qian noticed Gu Yanzhi’s eyes clearly brighten even before she finished talking. She knew that she’d done exactly the right thing, and was secretly feeling delighted.</p><br/><p>They both turned to Li Zhicheng.</p><br/><p>Leaning against the couch, he had already straightened his posture, looking peaceful. Without any obvious signs of relief on his face, he seemed to be considering her suggestion.</p><br/><p>However, after the brief silence, in a low voice, “I don’t need your connections.” There was almost a hint of stubbornness in his calmness.</p><br/><p>Lin Qian was speechless.</p><br/><p>It also took Gu Yanzhi by surprise. After sharing brief eye contact with Lin Qian, he smiled slyly. “Lin Qian, your dear President Li is too used to the military,” he bantered. “He hasn’t left it behind yet. His least favorite thing would be taking advantage of… um, nepotism, to reach his goal. ”</p><br/><p>Lin Qian was still speechless.</p><br/><p>Nepotism?</p><br/><p>Gu Yanzhi sounded half-joking, leaving Lin Qian confused for a second. But, Boss wouldn’t be this stubborn, would he?</p><br/><p>She turned to Li Zhicheng. He was staring right at her.</p><br/><p>Lin Qian said, “I’m offering this because it’s quick and convenient. Plus…” Li Zhicheng’s jet-black eyes were like bottomless pits. Staring at him, Lin Qian suddenly thought of what he had said to her the other day. “I trust you.” The memory made everything around her heart feel warm.</p><br/><p>“Plus what?” Li Zhicheng suddenly asked, breaking from his normal silence.</p><br/><p>Lin Qian glared at him, responding in a low voice, “Plus, throughout the ages, nepotism has always been useful and practical.”</p><br/><p>Stunned, Gu Yanzhi, standing next to them, immediately burst into laughter.</p><br/><p>Even Li Zhicheng’s eyes widened, which was followed by the rare upturn of the corners of his lips. His stern face appeared much softer.</p><br/><p>Lin Qian felt a hint of warmth on her face.</p><br/><p>Gu Yanzhi then stood up. “Alright, since Lin Qian had to use such wise words, as leaders, we have to be grateful. I’ll be in charge this time. Zhicheng, you can stay out of it. The decision has already been made. Lin Qian, you can start on that now.”</p><br/><p>Li Zhicheng remained silent. Without looking at him, Lin Qian quickly responded, “Sure.” She turned around and left.</p><br/><p>…</p><br/><p>Considering his one and only younger sister had reached out to him, Lin Mochen didn’t wait for her to get permission from her managers first. As soon as Lin Qian walked out of Li Zhicheng’s office, her brother was already calling. “The appointment has been booked. Four o’clock tomorrow afternoon.”</p><br/><p>Amazed, Lin Qian immediately started to praise him, “You’re truly amazing.” But secretly she thought to herself, You’re still that freaking bossy! What if Li Zhicheng turns it down?</p><br/><p>Lin Mochen was pretty clear on this. Regarding her kind offer, the president of Aida would have to accept it whether he liked it or not.</p><br/><p>According to Lin Mochen, the president of Ming Sheng, Kang Mingcong, would be back from his business trip from Beijing tomorrow at noon. Lin Qian thought about this; she believed that the timing of her brother’s plan was perfect. Since Ming Sheng closed at 5:30 pm, there couldn’t be many arrangements scheduled in between his landing and closing time, allowing them to communicate for 60 to 90 minutes. It would be a rare opportunity with plenty of time for them.</p><br/><p>Taking her time at her desk, Lin Qian then returned to Li Zhicheng’s office to give them the information. Cheerful, Gu Yanzhi immediately called in the staff from the marketing department. Li Zhicheng remained quiet, glancing at her.</p><br/><p>He isn’t upset, is he? Lin Qian worried. He should be… content, right? After all, the situation is looking better after using a connection.</p><br/><p>In the evening, Xue Mingtao left the office with his trusted staff just like earlier. Only this time, everyone was clearly in a good mood. Lin Qian looked up with a polite smile. Surprisingly, Xue Mingtao walked towards her, reaching out his hand.</p><br/><p>“Assistant Lin, I heard the story from President Li. Thank you so much. You solved a huge problem for our marketing department.”</p><br/><p>Lin Qian quickly stood up, grinning.</p><br/><p>Huh? Boss gave me a compliment?</p><br/><p>She waited until after they left, then walked across the room. Lin Qian was peeking through the latched door into the office. Still not planning on leaving? Are you even pleased?</p><br/><p>In the middle of her thoughts, a cold and clear voice came through the office. “Come in.” It almost felt like he had been watching her as well.</p><br/><p>She pushed the door open to see Li Zhicheng’s eyes were fixed on her as he stood by the desk.</p><br/><p>“Can I help you with anything?” she asked, smiling.</p><br/><p>There was silence as though he were deep in thought. He then turned, walking towards her.</p><br/><p>The late afternoon sun fell slanted and gloomy through the window. But the rays of bright sunshine looked like ripples shimmering above his head, leaving his facial features gentle and glowing.</p><br/><p>He stopped a step away from her; he just stood there, glaring at her.</p><br/><p>The jet-black eyes of his were deep without any expression. Lin Qian began to worry a little. Why’s he standing so close to me? I thought he never approached strangers.</p><br/><p>She composed herself under his penetrating gaze.</p><br/><p>In a low, calm voice, he asked, “Why are you helping me like this?”</p><br/><p>Slightly stunned, Lin Qian responded honestly, “Because you deserve it.”</p><br/><p>He stared down at her, eyes appearing to become more peaceful.</p><br/><p>“Thank you, Lin Qian.”</p><br/><p>Blinking, Lin Qian knew he was honestly expressing his gratefulness.</p><br/><p>She looked down at the small distance between them, then looked up at his stern, handsome face.</p><br/><p>Boss, considering how close you’re standing, are you trying to show me your sincerity and formality? You are just… too humble.</p><br/><p>Lin Qian paused, returning his clear gaze.</p><br/><p>It was a skill to appropriately accept compliments from the boss. You could neither act too proud nor too humble. So she gave him a little smile, adjusted her posture, and casually waved her hand. “My pleasure, sir.” She then saluted him like a proper soldier.</p><br/><p>As expected, this was received well by him.</p><br/><p>Li Zhicheng’s dark eyes appeared to be smiling. So did Lin Qian’s.</p><br/><p>People always said that employees should be able to manage their superiors, so she was doing a great job, wasn’t she?</p><br/><p>Such an emotionless person, but he had smiled at her twice.</p><br/><p>Just as she was becoming excited, he said, “I’ll return the favor. From now on.”</p><br/><p>…</p><br/><p>The afternoon of the next day quickly came.</p><br/><p>A Cadillac slowly cruised through the city. Lin Qian was sitting in the passenger’s seat, and Xue Mingtao was behind the wheel. In the back sat Gu Yanzhi and Li Zhicheng.</p><br/><p>The car was heading towards the west CBD district. The skyscraper for Ming Sheng’s headquarters could be seen amongst other skyscrapers from afar, appearing dark and mysterious.</p><br/><p>Greeting them was Ming Sheng’s associate director, a lean man in his forties. He appeared to be moderate and well-mannered. After a short conversation, they were led to a small meeting room located on the top floor in the general manager’s office area.</p><br/><p>“It won’t be long,” he said. “There is a visitor with President Kang. I’ll take you in once the meeting is over.”</p><br/><p>The associate director then headed out after seeing that Aida was okay with waiting.</p><br/><p>It was 3:45 pm. They were a little early, and spent the time quietly looking around at each other and the room. Gu Yanzhi broke the silence.</p><br/><p>“Later, it would be great if President Li could do a little more talking,” he joked with Li Zhicheng. “I’ve heard that President Kang graduated as an engineer, and is also very quiet. Just make sure it’s not completely silent in there.”</p><br/><p>Both Lin Qian and Xue Mingtao burst into laughter. Li Zhicheng raised his eyebrows, deadpanning, “Very well. We are like-minded and know silence is golden.”</p><br/><p>Li Zhicheng’s lack of facial expression astounded Li Qian and Xue Mingtao. They didn’t figure it out until seeing Gu Yanzhi cackle. Unless… Boss is being funny? It brought everyone to laughter once they realized.</p><br/><p>Even though it was a joke, what Gu Yanzhi had just mentioned was really consuming Lin Qian. Should Li Zhicheng meet up with someone of his equivalent level? It was unlikely to expect the Boss to be socially active. She truly had no idea how this would turn out. The clock was ticking.</p><br/><p>At four o’clock sharp, the same assistant manager walked in. Everyone including Lin Qian stood up. With a smile on Xue Mingtao’s face, he asked, “Can we?”</p><br/><p>Surprisingly, his smile seemed apologetic. “President Li, and Manager Gu, I’m sorry but President Kang’s last visitor is still there. They are in the thick of it. I’m afraid I can’t interrupt.”</p><br/><p>Immediately Gu Yanzhi answered, “No worries. We’ll just be sitting here for a little longer. Thank you.”</p><br/><p>Smiling, the assistant manager nodded and left.</p><br/><p>But 4:40 pm eventually came. Impatient, Gu Yanzhi sent Xue Mingtao to double check, only to discover that was a wild goose chase. In contrast, Li Zhicheng appeared calm and patient. The waiting also slowly took a toll on Lin Qian.</p><br/><p>Min Sheng would close at 5:30 pm and, according to the assistant manager, President Kang was also scheduled for dinner in the evening, right after work.</p><br/><p>There were less than 40 minutes left for them.</p><br/><p>This was a terrible start already. Knowing the importance of meeting their senior managers, if they failed to leave a great impression on them, it would be unlikely for them to schedule another meeting after this. Let alone expect President Kang to favor them for this project.</p><br/><p>Why were they having such bad luck? It was already incredibly hard to schedule an appointment. Who could possibly cut the queue and talk with the president for so long?</p><br/><p>It was almost 5 pm. “I’m going to the bathroom,” said Lin Qian. Just when she pushed the door open, she saw a group of people leaving the other side of the office lounge, all decently dressed. President Kang’s office was in that direction. The group was led by someone who was tall, handsome, and smiling… who else could it be besides Chen Zheng?</p><br/><p>Followed by a group of employees, he shook hands with the assistant manager. “Thank you so much, Mr. Liao. You can stop right here. The meeting with President Kang was such a pleasure, hopefully it didn’t take too long. We’ll meet up for tea sometime.”</p><br/><p>“You’re welcome. I’ll walk you out,” said the assistant manager with a broad smile on his face.</p><br/><p>Suddenly Chen Zheng seemed to notice something. He looked up towards the door. With Lin Qian standing outside, it was too late to hide. She could merely stand there and stare at him from a distance.</p><br/><p>It didn’t catch Chen Zheng by surprise that Lin Qian was there. The corner of his lips slightly raised, he left surrounded by his staff.</p><br/><p>…</p><br/><p>At the moment, the president of Ming Sheng, Kang Mingcong, was sitting on the big comfy couch in his office, rubbing the space between his brows.</p><br/><p>As an entrepreneur in his fifties, he looked stern and severe. Usually he was reserved, but for the people who had known him for a while, coming from an engineering background, he had a lot of plans and excellent ideas for the management and development of the business.</p><br/><p>The procurement project this time was to acquire the same briefcase for tens of thousands of staff members working at the branches of the company from over 30 provinces. He believed that when it came to their image as a whole and the way they treated their staff, despite the size of the project, quality was always what was most important.</p><br/><p>Dealing with New Bori and SMQ made him realize that regarding the former, despite their great quality and top rank in the industry, their prices were rather high. Considering New Bori supplied multiple state-owned businesses, the listed price could only be higher. Therefore, it had already been eliminated by him.</p><br/><p>Even though SMQ wasn’t as competitive as New Bori, they were willing to provide them high-quality products at the lowest prices on the market. When he had first met Chen Zheng, he hadn’t been the biggest fan of the superficial young man. But they got along, and as they spoke, Kang Mingcong had slowly gotten used to him. In addition, SMQ and Chen Zheng had both received positive reviews from his managers from other departments; so, Kang Mingcong didn’t have much problem leaving the project with him.</p><br/><p>He had scheduled a meeting with Chen Zheng after being told it was a serious matter they needed to discuss. The first thing Chen Zheng had done was give an introduction on the new core product from SMQ. He had also gifted an antique GO manual to Kang Mingcong.</p><br/><p>Kang Mingcong was hooked after flipping through just a few pages. There was no denying that this gift was right up his alley.</p><br/><p>As to Aida, introduced by the foreign shareholders? He had heard that they were on the edge of bankruptcy—god knew how they had connections with the foreign shareholders. He might as well meet up with them so he could put an end to it.</p><br/><p>…</p><br/><p>It was a few minutes past five when Gu Yanzhi and Li Zhicheng entered President Kang’s office.</p><br/><p>Lin Qian sat the small meeting room. Divided by a wall, she stared at the shut door of President Kang’s office, praying that they come out as late as they could.</p><br/><p>She worried that they would be told to leave only ten minutes or so into the meeting. She was also simultaneously blaming Chen Zheng for their late start. It was such a simple, clever thing that he had done, making the meeting with President Kang so long right after his flight. He must’ve been exhausted. Plus, he had dinner scheduled at 5:30 pm, so their meeting couldn’t last any longer than 25 minutes.</p><br/><p>Soon it was 5:30 pm. Lin Qian’s eyes were fixed on the door.</p><br/><p>The assistant manager also noticed the time. He walked up, knocked on the door, and poked his head in the office. She couldn’t be sure what he was saying, but soon enough he retreated, gently pushing the door shut.</p><br/><p>Umm?</p><br/><p>Lin Qian made eye contact with Xue Mingtao; both were quiet.</p><br/><p>At 5:45 pm, they were still inside.</p><br/><p>At 6:00 pm, they were still inside.</p><br/><p>The assistant manager knocked on the door, stuck his head in just like last time, and once again left quietly. Lin Qian supposed that his dinner was canceled when she saw him calling someone in another office.</p><br/><p>Lin Qian and Xue Mingtao both couldn’t help getting excited. It looked like the meeting was going well? It must have been. Even though Li Zhicheng wasn’t the best at conversation, with of Gu Yanzhi’s sophistication and knowledge in the business industry, maybe they were winning Kang Mingcong over.</p><br/><p>The clock read 6:30, and they were still inside.</p><br/><p>When it was 7:00 pm, the doorknob clicked, and the door was pushed open. Gu Yanzhi walked out of the office first, smiling. He was followed by Li Zhicheng, who had a slight grin wrinkling his soft brows; he appeared to look up in her direction. Lastly, Kang Mingcong walked out of his office, looking cheerful.</p>\n</div>"}