{"title": "Chapter 20", "id": 20, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-20", "volume_title": "Volume 1", "body": "<h1>Chapter 20</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At that point in time, Li Zhicheng was staring at the screen and asked, “Where are you planning to post these? Specifically, how should they be arranged?”</p><br/><p>Lin Qian hastily replied, “I have the detailed documents with me…”</p><br/><p>…</p><br/><p>Li Zhicheng meticulously went through the documents and questioned them one by one, with Lin Qian thoroughly clarifying his doubts. Without them realizing, 30 minutes flew by.</p><br/><p>These files were the work Li Zhicheng had allocated to Lin Qian. Although they appeared pompous, they were an accumulation of her hard work. Needless to say, these technicians walked a fine line in grey areas, lived on the edge, and acted smart and pretentious. When she was in command of them, she felt like she was in her comfort zone, working in a job suitable for her.</p><br/><p>Therefore, by the end of her presentation to Li Zhicheng, Lin Qian had shed her awkwardness and was speaking with passion and flair. Seeing Li Zhicheng nodding from time to time, with the occasional hint of a smile on his face, she knew for sure that her boss was satisfied with her work. Hahaha.</p><br/><p>With that, she gained the confidence to show him the last posting, the particular post that had left her very undecided and conflicted. “Mr. Li, look at this. It does not reveal your face clearly and fully. But I think if we post it, it will definitely garner a very good response.”</p><br/><p>Featured largely on the screen was a title in red, cute, and rounded font: “Come and take a look: New Successor of the Aida Organization, the Enigmatic President.” This was followed by a picture and a few sentences after scrolling down with the mouse.</p><br/><p>Li Zhicheng looked at the picture and frowned slightly.</p><br/><p>The picture had been sneakily taken from a smartphone while he had been working. He was wearing a suit and sitting at his desk, his head lowered while looking at some documents. It was blurred due to the backlighting, revealing only the silhouette of his sharp nose and his overall facial contours. From a glance, he looked like an upright yet quiet young man.</p><br/><p>Li Zhicheng raised his head and looked at her. “Delete it.”</p><br/><p>This idea had actually been from another woman in the IT department. Lin Qian was just doing her job, believing that it was feasible and making the necessary preparations. She had been told by Li Zhicheng to make the decisions by herself, and that reporting to him about everything was unnecessary. Thus, she had left everything to be clarified by him all at once at the end.</p><br/><p>Lin Qian was not surprised by his outright rejection and nodded her head. With quick movements of the mouse, she deleted the picture and all traces of it from the computer immediately.</p><br/><p>By this time Li Zhicheng had already straightened up and put some distance between them. He asked, “Are there more in your phone?”</p><br/><p>“…Yes.”</p><br/><p>Gosh, there was no doubt her boss hated people secretly taking pictures of him. Back when she had taken the photo, she’d had limited time in close proximity with him, so she’d just conveniently snapped a picture.</p><br/><p>Just as she was about to promise to delete the pictures, his calm voice drifted over, “Do not send it to others.”</p><br/><p>Lin Qian immediately replied, “Alright.”</p><br/><p>Oh, does that mean I don’t have to delete it?</p><br/><p>By the time she looked over, Li Zhicheng had already turned around to leave.</p><br/><p>Three days later, at 9:50 am, it was just ten minutes before the start of Aida’s flagship store’s spring season online sale.</p><br/><p>Lin Qian was seated in the IT department’s little office. Just outside, there were a few technicians ready to respond to any call of duties. Meanwhile, Gu Yanzhi and Xue Mingtao kept watch at the customer service center.</p><br/><p>As for Li Zhicheng, he was idling in his office and was not personally present at the frontlines of such a crucial day.</p><br/><p>Lin Qian felt that this was good. She believed that the more crucial the matter, the more the leader should remain calm and unmoving.</p><br/><p>Finally, the clock read 10 am sharp.</p><br/><p>Lin Qian squinted in anticipation.</p><br/><p>The screen in front of her was the flagship store’s online homepage, which was made open to the public.</p><br/><p>The webpage design was the result of the careful discussions and talents from the marketing department. Apart from the title on the homepage, there were not that many colorful, eye-catching promotions.</p><br/><p>The webpage boasted a refreshing, modest, and vintage style. Right at the top was a brief introduction of Aida’s luxury sub-brand, “Vinda,” including the quality of leather imported from Italy, the American designers’ signatures, a feature of the intricate production process, and so on.</p><br/><p>Below that was a steady stream of pictures of every bag. They each came with three price descriptions: overseas pricing, physical store pricing, and promotional pricing.</p><br/><p>…</p><br/><p>At 10:02 am, the first order form was submitted.</p><br/><p>Lin Qian watched as the background data started to change; she got a bit excited and at the same time secretly finding it amusing.</p><br/><p>They only earned 500 dollars from a bag made of such high-quality materials. Now, they could only hope that the number of orders would start to climb.</p><br/><p>At 10:10 am, the number of orders hit 20.</p><br/><p>By 11:00 am sharp, the number of orders hit 155.</p><br/><p>…</p><br/><p>As time passed, the number of orders continuously increased. Of all the orders, 80 percent was contributed by repeat customers and 20 percent was contributed by new customers. And by word of mouth of the repeat customers, coupled with the easy flow of information online, she saw the stable increase of the online traffic on the webpage.</p><br/><p>Lin Qian spent the entire morning feeling calm yet mildly nervous.</p><br/><p>She had also fantasized about the possibility of today’s sales increasing explosively, with the online store becoming an instant hit. However, it was proven that a miraculous online sales gig was not all that easy to pull off. Although the day’s sales were considerably substantial, it was still increasing at a rather constant rate, and there were indeed no miracles that simply fell from the sky.</p><br/><p>By 7:00 pm that evening, the total sales had hit over 800 pieces, with a turnover of more than two million, and a gross profit of more than 400,000. To a company that rolled in billions per year, such a sales result would not count as much. However, to the Aida of today, it was already viewed upon as the light at the end of the tunnel.</p><br/><p>The employees in the IT department were all rejoicing and busy taking turns eating their packed dinners. Meanwhile, Lin Qian was still unable to fully relax and unwind.</p><br/><p>She was very clear that Aida’s products were high-quality. However, it was still crucial that they observe whether or not consumers would accept this sub-brand. Whether or not this side-battle had successfully provided a means of survival for the company was still dependent on the next day.</p><br/><p>After the repeat customers spent to their limits, would there be any new customers coming in? Would they be able to maintain their sales? It all depended upon the next day’s performance.</p><br/><p>8:00 pm sharp.</p><br/><p>It was the day’s second obstacle.</p><br/><p>Based on the rules of the activity that had been announced, the first 2,000 buyers could participate in the 8:00 pm lucky draw, which was based upon the “lucky draw eggs” method commonly seen on the web. It was a 100 percent sure-win draw. Twenty lucky people would receive the top prize of 10,000 yuan each, followed by the other prizes, where the prize money would decrease to 5,000 yuan, 2,000 yuan, 500 yuan… all the way down to 10 yuan. The entire lump sum of the prize money amounted to a million yuan. When looking at this number alone, the prize money was extremely attractive.</p><br/><p>Nobody would miss out on a free red packet. In this segment, Lin Qian could take on a relatively relaxed attitude and watch from the sidelines.</p><br/><p>Indeed, the moment after 8:00 pm hit, there were already a number of IDs logging in to the lucky draw eggs portal at the same time. And according to plan, the results of the draw would pop up on both the activity homepage and the background randomizer simultaneously.</p><br/><p>Lin Qian kept her eyes glued on the screen.</p><br/><p>Lucky lady—the first egg she chose to crack is the top prize.</p><br/><p>“Congratulations to our customer from Shandong, ‘Linda,’ who hit the top prize. Please bring an identification document with you to any Aida storefront to redeem your 10,000 yuan red packet.”</p><br/><p>Lin Qian smiled. Could this be a good sign?</p><br/><p>The second notification appeared closely after, and it was another top prize.</p><br/><p>Lin Qian was slightly shocked but she smiled. What a coincidence.</p><br/><p>At that moment, a technician in charge of monitoring the operations of the website outside the room stood up suddenly. “Some… something went wrong!” The person beside him also had a drastic change in expression. He looked at the screen and exclaimed. “They are all top prizes! We’ve been set up! We’ve been set up!”</p><br/><p>Lin Qian felt her heart jolt. She lowered her head to look, only to find that the entire page was flowing with notification after notification:</p><br/><p>“Congratulations to our customer from Henan, ‘Rotating Apple,’ who hit the top prize…”</p><br/><p>“Congratulations to our customer from Hunan, ‘Yaya,’ who hit the top prize…”</p><br/><p>“Top prize.”</p><br/><p>“Top prize.”</p><br/><p>…</p><br/><p>Within a short period of time, there were 20 winners, far exceeding the initial allocation of 10 top-prize winners, and the number was continuously increasing. She immediately stood up and ran outside. Meanwhile, the technicians had all noticed the abnormality, and were all covered in cold sweat while looking towards the branch manager and Lin Qian.</p><br/><p>The branch manager also had cold sweat all over his head. He shared a glance with Lin Qian and asked solemnly, “How long will it take to repair this?”</p><br/><p>Someone replied, “We have to temporarily close the website if we want to repair it. Currently, we are unable to gauge the degree of the setup, and hence we are unable to guarantee the time we will require…”</p><br/><p>The branch manager’s face had turned blue by now, but he had no other choice. With much effort, he turned to look at Lin Qian. “Assistant Lin, please report this situation to President Li. It was negligence on our part. We have to close down the website immediately. If not…”</p><br/><p>He did not finish his words, but it was already enough to cause Lin Qian’s hands to sweat uncontrollably. Because of this little trick, there were already over a hundred “top prizes.” Lin Qian could almost imagine the whole swarm of customers that would come to snatch their effortless 10,000 yuan.</p><br/><p>“I will give him a call immediately.” She turned around and entered her little office before closing the door tightly behind her.</p><br/><p>As she dialed his number, her fingers trembled slightly.</p><br/><p>So many days of hard work and effort—this was their last hope. Li Zhicheng had to sell his house and land to cash out 30 million before he could even embark on this battle—how could it just fail now?</p><br/><p>Upset, she was terribly upset. Indignant, she was terribly indignant.</p><br/><p>Was is SMQ or New Bori?</p><br/><p>When the line connected, her voice naturally stabilized as usual. “President Li, something went wrong. Our online flagship store has been set up, and every egg that is being hit is a top prize. The IT department needs to suspend the website immediately to repair it. Really… sorry.”</p><br/><p>On the end of the line, Li Zhicheng remained silent for a while.</p><br/><p>Grasping her phone in her hand, Lin Qian was on the verge of bursting into tears.</p><br/><p>However, she hadn’t expected Li Zhicheng to reply to her in such a way.</p><br/><p>“Lin Qian, what do you think? Right now, should we suspend the website or not?” His clear voice was slow, but at the same time powerful.</p><br/><p>Lin Qian’s heart jolted and she paused in shock for a moment.</p><br/><p>He asked me whether or not to suspend the website?</p><br/><p>If they suspended it… they would lose the trust of the customers, which was equivalent to giving up on their past efforts. Their establishment of a good start—which had taken so much effort—would be affected by this serious setback. Tomorrow’s sales would definitely be dismal.</p><br/><p>Don’t suspend? Simply lose 20 million?</p><br/><p>She shut her eyes, and she could only see darkness.</p><br/><p>“…Don’t suspend the website!”</p>\n</div>"}