{"title": "Chapter 36", "id": 36, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-36", "volume_title": "Volume 1", "body": "<h1>Chapter 36</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>When they heard the news of Lin Qian organizing some market research, Li Zhicheng, Gu Yanzhi and Jiang Yuan were dragging their suitcases and just stepping out of the Milan Malpensa International Airport.</p><br/><p>Further on the horizon was the rising and falling view of a forest and mountains. The beautiful city was situated not too far ahead. Whether or not they would find the materials suitable for the new product was still a big question mark.</p><br/><p>Hopping in the taxi, staring at the message from Lin Qian, Gu Yanzhi laughed; he said to Li Zhicheng, “She’s even thought of doing marketing research. I didn’t expect that from her—she’s more patient than I thought.”</p><br/><p>Li Zhicheng responded, “She always has her own ideas. If we give her a direction and leave her with enough space, that’ll be enough. She’ll amaze us with the results.”</p><br/><p>Gu Yanzhi chuckled. “Did you learn this manipulation method from the military? Like when they usually talk about disciplining an eagle, and training a wolf?”</p><br/><p>He was joking. Jiang Yuan, who sat in the front, also burst into laughter. Li Zhicheng couldn’t be bothered to answer. Staring at the clouds in the sky, he suddenly broke into a slight smile.</p><br/><p>Discipling an eagle?</p><br/><p>It appeared that he was the eagle. A wild world was waiting for him, but he had been tied up by her softness and sweetness, and was most willing to surrender.</p><br/><p>He received a message from Lin Qian. ‘I’m going on a business trip. Doing market research in all the places. Will be back in about ten days.’</p><br/><p>His slender fingers lightly tapped the screen; he responded, ‘Good, see you in ten days.’</p><br/><p>…</p><br/><p>Around two weeks later spring arrived. Although there was still some chilliness left in the breeze, the sunshine had become warm and dazzling.</p><br/><p>At noon, standing in front of a stylish apartment block in Chang Sha, under the bright sun, Lin Qian squinted at a towering coffee-colored building.</p><br/><p>Soon, the young members of the group—about a dozen of them—scattered to the elevators with surveys. She also took out a few surveys from her backpack, as well as a delicate little present (a small desk calendar). She took the elevator straight to the top floor and knocked on the door of each household.</p><br/><p>Household surveys that were so formal had only been carried out by the National Water Supply General Company, State Grid, and the National Census. So every time the residents opened the door for her, they were surprised. “Household survey? Where are you from?”</p><br/><p>Lin Qian usually responded with a smile. “We’re from a company. We just want to get some information on our consumers.” She then handed over the little present. “I’m not selling anything, just want to ask you a few simple questions.”</p><br/><p>Most people still didn’t like the sound of it. “Not necessary,” they would say, pushing her out and shutting the door.</p><br/><p>However, there were a few willing to cooperate. Perhaps because of Lin Qian’s friendly manner and the good impression she made—and the fact that she didn’t look like someone from a pyramid scheme—some residents actually ended up filling in the surveys for her. When she happened to meet people who were really into the outdoors or outdoor gear, they would even have a nice chat with her.</p><br/><p>Even for such a tall building getting five or six surveys done by the end of the afternoon could be considered lucky.</p><br/><p>At the beginning of the task, under Lin Qian’s encouragement, everyone had been full of motivation. But as time went on, they began to complain. After all, none of them had done such a menial task like sending out surveys since college. It was also hard to deal with the constant rejection—they felt dejected and depressed.</p><br/><p>Lin Qian consoled them. “The tougher experiences are, the more valuable they become.” And because we’re the first in the industry to do this, once the new products become a success, we’ll be the role model of the entire industry.” She also used her own experience as an example. Regardless of the apartments in whichever city they were in, she was always thick-skinned and jumped to action first by knocking on their doors.</p><br/><p>The members slowly calmed down, and they also started to ignore rejections. They focused on the idea of “fully understanding the consumers’ needs” itself. Over a period of about three weeks, after traveling between five cities, they gathered 1,500 useful surveys. Although not much, with the accumulation of the data, and the gradual in-depth communication with the urban residents, everyone was able to brainstorm and contribute excellent ideas regarding the “longbow.”</p><br/><p>As a result, guided by Lin Qian, these ideas were later integrated into super effective marketing plans after the launch of their new brand, Aito. These plans largely contributed to the booming success of Aito and its ability to distinguish itself right off the bat. This will be discussed in detail later in the story.</p><br/><p>It suddenly hit Lin Qian that about three weeks had already passed.</p><br/><p>Every time she returned to the hotel—in the dead of night, exhausted, all by herself—she would lie heavily on the cool, fresh-smelling bed. She felt as though somewhere beneath the shell of an indomitable female boss, the proud and energetic Lin Qian was finally coming to life.</p><br/><p>Staring past the dark yellow curtain at the clear moon outside the window, a lot of things flashed through her mind.</p><br/><p>She thought of her perfected speaking skills. “The tougher experiences are, the more valuable they become.” Hehe, how did I come up with that?So wise—everyone was speechless. Haha!</p><br/><p>She then thought of the ideas and plans they had worked on together as a team—they were bright like gems. She couldn’t help but get excited every time she thought of them.</p><br/><p>Not sure how Li Zhicheng is doing with his business. I’ll sure surprise him—does he know about the progress?</p><br/><p>Tomorrow, she and her team were finally heading back to Aida.</p><br/><p>Lying on the bed, her mind drifted for a while. She looked up; seeing the hat on the nightstand, her heart felt like it was being pinched by someone.</p><br/><p>‘We’ll be back tomorrow,’ she typed on her phone.</p><br/><p>The message was sent, but after a while there was still no reply.</p><br/><p>Holding her phone, Lin Qian flipped around on her bed.</p><br/><p>He must be busy, that’s why he hasn’t responded.</p><br/><p>But he must have no idea how badly she’s been missing him lately—he wouldn’t expect it.</p><br/><p>Love is a bizarre feeling that you have absolutely no control over.</p><br/><p>A month ago, she had still been following the rules, taking it slow, trying to get to know him before starting their relationship. She had also believed herself smart and selfish. Since he’d fallen for her first, and with such subtlety, she’d only feel secure knowing he fancied her more than she fancied him. She’d even had a theory that was rather mean. Although, her brother’s theory was a little extreme: that perhaps men like him pursued women who were hard to get.</p><br/><p>But, after the impulsive passionate kiss they shared the other day, her heavy heart had become… lighter.</p><br/><p>She no longer wanted to control it; she no longer could control it.</p><br/><p>Every morning when she opened her eyes, her first thought was of him. Before going to bed at night, her blurry mind was on him.</p><br/><p>Whenever colleagues mentioned “President Li,” her ears perked up. Words that had nothing to do with her, as long as they were related to him—even when he had raised his temper at the meeting that day—her heart palpitated. She seemed to gradually miss him more and more.</p><br/><p>When she was questioned by her team the first time, her passionate speech had managed to stabilize the situation but only just temporarily—and barely. But once she left the meeting room, standing under the light all by herself, she felt lonely. Then she thought of him, of his cold, focused look, and the smile in his eyes. She took out her phone, wanting to send him a message, but worried that he could be a hundred times busier than her. So she put the phone back in her pocket and looked out at the strange city through the window. Into the dazed darkness of night, she stared blankly.</p><br/><p>When the exceptional idea of celebrating had come up for the first time, she had smiled and waved everyone out the door. “We have to celebrate. Dinner is on me tonight!” Everyone was excited and cheered loudly. Even as she headed out, surrounded by the group high in spirits, it had still been him floating around her head.</p><br/><p>Even though everything was going so well, he wasn’t by her side. She just wanted to hold his waist and bury her head in his chest—though she had never done that before.</p><br/><p>His distance made her restless. This greedy lust had come from nowhere—was he even aware of it?</p><br/><p>Her melodious ringtone suddenly started ringing in the empty room.</p><br/><p>Lin Qian immediately got off the bed. She stared at the familiar name on the screen: Li Zhicheng.</p><br/><p>“Hello.” She became quiet after saying only one word.</p><br/><p>There seemed to be some background noise on his end of the line. Li Zhicheng’s voice was also very soft: “I was in a meeting just now.”</p><br/><p>“Erm, me too.”</p><br/><p>He also became quiet. Lin Qian could hear his light, shallow breathing.</p><br/><p>“What time do you arrive tomorrow?” he asked.</p><br/><p>Immediately she replied, “The flight is at ten, so maybe around noon.”</p><br/><p>“Good,” he whispered. “I’ll be waiting for you.”</p><br/><p>Hanging up the phone, Lin Qian’s face became hot, and so did her heart. She was tormented by the response, “waiting for you.” She buried her head in a cool pillow for a little while, and she couldn’t help smiling.</p><br/><p>After what felt like a long time, Lin Qian finally returned to the company.</p><br/><p>…</p><br/><p>It was 1:00 pm, and the breakfast on the plane had not been filling. Starved, some colleagues said to Lin Qian, “Let’s go grab a bite together!”</p><br/><p>Lin Qian was also a little hungry, but she said “I’m good,” as if she weren’t. “I’m heading over to report to the executives. After lunch, you could come back to the company and inspect the data again. I’ll be back in the afternoon.”</p><br/><p>Stepping in the long-awaited office area on the top floor, Lin’s feelings were flying out of control.</p><br/><p>They would soon be together.</p><br/><p>This awareness stayed on the surface of the most obvious spot of her heart. But how should she phrase it? Like, “I want to see your second trick.” Or she could put it in his way, “If this distance can be tolerated, what can’t be tolerated?” That way, he would understand.</p><br/><p>Or… she could just skip the talk, and give him a kiss?</p><br/><p>What about that mysterious deal with her brother? Something about taking baby steps?</p><br/><p>Who cares!</p><br/><p>Feeling sweet and excited like never before, Lin Qian walked toward his office.</p><br/><p>The cubicle outside was empty. Jiang Yuan wasn’t around either. She cleared her throat and knocked on the door.</p><br/><p>No response.</p><br/><p>Huh? No one here?</p><br/><p>She took out her phone, and after thinking for a moment called Jiang Yuan.</p><br/><p>“Manager Lin.” It sounded very noisy on Jiang Yuan’s end. “President Li and I just came to Workshop Five. He’s busy right now, but he said you could come straight over.”</p><br/><p>Lin Qian knew how busy Li Zhicheng had been lately. Based on his character, even though he’d said he would wait for her, it wasn’t surprising he had ended up at the workshop all of the sudden—even during lunch time. Clearly he was swamped and didn’t have a choice.</p><br/><p>Workshop Five was at the very end of the industrial park, and it was also the biggest factory. It was being used as the “secret headquarters” for the experiment and production of the new product.</p><br/><p>Lin Qian walked into a noisy environment. Some production lines were in operation, the machines were making low pitched noises, and the lights were very bright. A lot of technicians in green, and workers in blue, walked around. People all over spoke loudly—it was a busy and stressful place.</p><br/><p>Lin Qian was observant. She soon spotted about a dozen people gathering around a machine not far from her; they seemed to be holding some fabric and making comparisons. And the guy in the middle of the crowd—wasn’t that Li Zhicheng?</p><br/><p>Lin Qian took a few steps forward, staring quietly about 20 feet away.</p><br/><p>They were in the middle of a performance test. A dozen types of fabrics had been placed on the square table in front of them. It looked like they had been either soaked in water, burned by fire, or damaged by friction. A foreman next to Li Zhicheng was picking up a piece of fabric and telling him, “This is the result from the test of fabric A7. This is A8. This is A9… Compared to the previous batch of fabric, the performance has already made some great progress.”</p><br/><p>As soon as the remark was made, the workers, technicians, and staff members from the office all nodded in agreement. Lin Qian was also delighted. Unexpectedly, Li Zhicheng, after carefully reading the test report in his hands, calmly commented, “No, it still hasn’t met my standards. Thank you everyone for working hard. This batch of fabric is eliminated—keep the trials going.”</p><br/><p>Lin Qian thought it a shame, but the people around him seemed accustomed to this answer. They nodded their heads, then they scattered and continued working. Li Zhicheng looked up and saw her.</p><br/><p>He still looked the same but in a shirt today without the tie. In order to test the fabric, his sleeves were rolled up. One of his hands was stuck in his pocket and the other one was pressed onto the table. He stared at her quietly.</p><br/><p>Instantly, a faint smile flashed in his shining black eyes. With him staring at her like this, Lin Qian felt that her entire heart was full. She had missed him for over a month. That simple gaze of his made her so satisfied and so comforted that she immediately lost her self-control.</p><br/><p>Someone approached Li Zhicheng and handed him a document. Lin Qian quickly walked over to him and they smiled at one another. She said, “President Li, we’ve returned from our research and would like to report the results to you.”</p><br/><p>“Hmm, give me a second,” he responded without looking up.</p><br/><p>Pff, he’s even more pretentious than I am.</p><br/><p>Lin Qian somehow felt warmth in her heart again.</p><br/><p>After the worker left with his signature, he turned to her. “It’s noisy here—let’s go to the office.”</p><br/><p>The office he referred to was the cubicle next to the production lines. At the moment, there were a lot of people around. Not far away, Jiang Yuan, standing with a few other managers, smiled at her and nodded. Lin Qian also smiled, and then followed Li Zhicheng into the office.</p><br/><p>Two technicians in the office sat at a table. Looking down at the work, they quickly typed away on their keyboards. Seeing them walk in, they both stood up. “President Li, can we help you with anything?”</p><br/><p>Li Zhicheng sat down on the plain couch nearby. “It’s all good, you could keep working. We’re just having a conversation.”</p><br/><p>With or without anyone around—Lin Qian couldn’t care less anymore. She was okay with anything as she could watch him and stay with him. Moreover, she really wanted to report the results to him as soon as possible.</p><br/><p>Sitting in the chair across from him, with a small coffee table in between. They gazed at each other.</p><br/><p>A technician walked over holding two cups of tea. Lin Qian quickly thanked him. Li Zhicheng asked at the same time, “How was it?”</p><br/><p>Lin Qian took out a long-prepared, thick stack of research reports from her bag. “We visited five cities: Beijing, Shanghai, Chengdu, Changsha, and Harbin, and collected 1,500 valid surveys. Here is the original Statistics Report.” She handed the report to him.</p><br/><p>Knock! Knock! Someone was at the door. A technician poked his head in. “Let’s go get some food.” Seeing Li Zhicheng was there, he immediately lowered his voice. “Ehh, President Li. I’m asking everyone if they want some food. Have you eaten yet?”</p><br/><p>The two technicians stood up. Li Zhicheng said, “We’re good. Close the door when you head out. It’s too noisy outside.”</p><br/><p>Lin Qian focused on the report in his hand. Every character seemed to jump off the paper, but none of them could jump into her heart. Li Zhicheng also lowered his head, focused on the report she just gave.</p><br/><p>The technicians soon left. The room was quiet again. Once the door shut it became warm and quiet in there, a huge contrast to the noisy area outside, almost like an entirely different world.</p><br/><p>He glanced up and looked straight at her. His penetrating stare almost stopped her heart. But with so many people outside, anyone could come in at any time. She also couldn’t rush over and just immediately kiss him.</p><br/><p>Even with so much to tell him, she didn’t know how to begin.</p><br/><p>“Let’s finish the important work first.” She picked up another report and handed it to him. “We have also made recommendations for marketing, please—Oh!” she couldn’t help but exclaim.</p><br/><p>Her wrist was firmly grabbed by him. Those dark, heavy eyes stared at her from a close distance.</p><br/><p>The small coffee table sat between the two of them. With his strength, Lin Qian was pulled over it toward him.</p><br/><p>The two stared at each other. Lin Qian could almost make out each eyelash of his, and saw the thin layer of light reflected on his nose.</p><br/><p>Lin Qian had no doubt that in the next second he would pull her into his arms and kiss her.</p><br/><p>Even if this was his company, he was still… very brave.</p><br/><p>Lin Qian almost giggled. She looked at him and softly said, “Li Zhicheng, I—”</p><br/><p>Knock! Knock! The sound of knocking at the door could be heard. “President, it’s me, Jiang Yan.”</p><br/><p>Li Zhicheng let her go. Lin Qian kept the rest of her thought to herself, immediately sitting back down in her seat.</p><br/><p>“Come in,” he said quietly.</p><br/><p>Lin Qian bowed her head, pretending to look at the files. The wrist that he’d held was hot. The lingering strength of those five fingers remained on her skin, and broke into her bones.</p><br/><p>Jiang Yuan glanced into the office and said, “President Li, it’s almost time. The car is here. Shall we head to the airport?”</p><br/><p>Lin Qian looked up at Li Zhicheng.</p><br/><p>He nodded toward Jiang Yan and then turned to Lin Qian. “I have to go to Taiwan at the last minute for a business meeting with a fabric manufacturer. If it all goes well, I’ll be back in two or three days.”</p><br/><p>A few more people came to the door. Lin Qian immediately put on a smile and stood up. “Okay, President Li. I’ll fill you in with the details when you come back.”</p><br/><p>Li Zhicheng glanced her way again before standing up. “Good.” He turned around and walked toward the door, followed by Jiang Yuan and the others, and soon enough they disappeared.</p><br/><p>Alone, Lin Qian walked out of the workshop. Gazing at the clouds in the sky, she sighed.</p><br/><p>Despite being exhausted, and without even making time to get some food, she had rushed in just to see him.</p><br/><p>He was so busy that he had to leave again after seeing each other so briefly. They hadn’t even had the time to talk.</p><br/><p>It felt like… she had been given a sweet date and it was taken away from her before she had time to enjoy it.</p><br/><p>Damn. Love can be so cruel sometimes.</p><br/><p>Kicking the gravel on the side of the road, she looked nothing like the professional, skilled person who usually appeared in front of her colleagues. Only after her high-heeled shoes were covered in layers of dust did she realize how annoying the situation was and become upset.</p><br/><p>Her phone rang. It was Jiang Yuan.</p><br/><p>Love me, love my dog. Lin Qian even saw Jiang Yuan’s calls differently now. She picked up. “Jiang Yuan, what do you need?”</p><br/><p>Jiang Yan’s voice sounded very friendly. “Manager Lin, are you still at work?”</p><br/><p>“I am.”</p><br/><p>“President Li forgot to grab your report. He wants to read it during the flight. We are right in front of the building—would you minding bringing it over?”</p><br/><p>Cheered up, Lin Qian quickly headed toward the company’s front gate. It wasn’t too far away.</p><br/><p>Gao Lang was on guard today, and he greeted her with a smile. Without time to chat, she quickly nodded to him before walking out the door. A black car was parked on the curb. Jiang Yuan leaned out of the window next to the driver’s seat, waving at her.</p><br/><p>By the time Lin Qian ran over, the rear door was already opening from the inside. She could see from the shadows that Li Zhicheng sat rigidly in his suit, his legs crossed and hands on his knees.</p><br/><p>Lin Qian put a hand on the door and bent over. Seeing his face, she broke into a sweet smile and passed him the files. “President Li, the report.”</p><br/><p>But deep down, she thought, Bold. No wonder he didn’t bring the files earlier—he deliberately left them behind. Now we have to meet up again.</p><br/><p>Instead of taking the files, Li Zhicheng stared at her. He had the eyes of a man looking at a woman, not those of a boss looking at his subordinate. Lin Qian felt delighted, smiling. She stared at him, revealing a slight reluctance as seeing him leave. “President Li, have a safe—”</p><br/><p>She didn’t get to finish.</p><br/><p>Because Li Zhicheng immediately grabbed her hand and pulled her into the car. He lowered his head and kissed her.</p><br/><p>The kiss was so sudden that Lin Qian’s heart nearly exploded. With her hand and waist tightly held by him, she could only cling to his arm, enabling him to do whatever he wanted to her. But his kiss was slow and steady, cool and deep. He ignored the people around them and appreciated, through the lips of a woman, that long-awaited sweetness and beauty.</p><br/><p>He was undoubtedly a natural master at kissing, with his strong and powerful entanglement, and an alluring masculine vibe, he could easily make a woman head-over-heels. However, today, Lin Qian was not in the mood to appreciate or enjoy the kiss whatsoever. She was firmly held to his chest, all the hairs on her body seemed to stand on end. She even forgot to shut her eyes and looked around.</p><br/><p>Sitting in the front were Jiang Ye and the chauffeur, both looking straight, and sitting quietly, as if they didn’t exist. But this made Lin Qian’s face turn even redder. She then shifted her eyes to the back of the car. Vaguely seeing some people walk along the road, she wondered if they were from the same company.</p><br/><p>Just when Lin Qian could feel all her blood rushing to the top of her head, Li Zhicheng released her. That handsome face of his looked indifferent, as if nothing had happened.</p><br/><p>“Wait for me to be back,” he whispered, one hand still holding her waist.</p><br/><p>Lin Qian blushed so hard she felt as though blood were about to drip down her face. Even stronger, though, was a sweetness inside her that she couldn’t describe.</p><br/><p>“Okay.”</p><br/><p>About 30 feet away, in the security booth at the entrance, the three security guards, including Gao Lang, stared at the blurred image in the rearview window of the president’s car. Their eyes almost fell out of their heads.</p><br/><p>One of the young security guards hesitantly asked, “Monitor Gao… did the president just pull Manager Lin into the car and kiss her?”</p><br/><p>Gao Lang was also stunned, and came to the full realization just now. After a quick thought, he harshly replied “Neither of you should tell anyone. Do you understand the rules of the workplace? You’ll get sacked once you tell anyone, understood?”</p>\n</div>"}