{"title": "Chapter 51 - Coming Events Cast Their Shadows Before", "id": 51, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-51-coming-events-cast-their-shadows-before", "volume_title": "Volume 1", "body": "<h1>Chapter 51 - Coming Events Cast Their Shadows Before</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Lin Qian sat in the car for a while, thinking about what happened just now; his gaze, his ardent moving hands, and his lingering whispers beside her ear. She couldn’t help but blush and giggle.</p><br/><p>It was time to leave work. Many passers-by were coming and going in the parking lot. She waited for quite a while for a chance to sneak into his car. Fortunately his car was parked in a remote spot. She hid in the front passenger seat and no one noticed her.</p><br/><p>After sitting for a few more minutes, she saw a shadow approaching from outside the window. The driver’s door opened; Li Zhicheng stepped into the car.</p><br/><p>A wholesome and ticklish sweetness permeated Lin Qian’s heart upon his arrival. She didn’t say anything, merely lowering her head and playing with her fingers.</p><br/><p>Li Zhicheng said nothing either. He glanced at her thoughtfully, then he started the car.</p><br/><p>When the car left through the main gate of the Group, Lin Qian, as usual, was agile like a bunny, lowering her body to avoid from the gazes of others. Li Zhicheng said before she went on the business trip that he wanted to make their relationship be known to the public, but at times like these, she still subconsciously wanted to hide.</p><br/><p>While she was hiding, she did not forget to warn him, “Don’t you dare to laugh at me!”</p><br/><p>“Hmm.” he replied flatly.</p><br/><p>Then she felt a hand gently on her back, a very casual move, as though he was caressing his dearest belonging. Lin Qian could feel goosebumps on her back and neck upon his touch. Not long after the car left the main gate, she straightened in her seat, blushing.</p><br/><p>She felt like she must have overreacted. It was just a simple touch, why did… why did… she sense desire from it?</p><br/><p>Is it because it has been so long since I’ve had intimate contact with him, so that’s why my thoughts wander? After all, a few months ago, I got greedy too and needed to be satisfied…</p><br/><p>Lin Qian was silently embarrassed by her thoughts. Meanwhile Li Zhicheng was staring at the sunset and the blue sky; the car moved steadily and swiftly.</p><br/><p>The car continued moving for a while more, suddenly Lin Qian came to her senses.</p><br/><p>This was not the way to her home. Her home was only opposite the office, a few hundred meters away. He had been driving for so long without her noticing.</p><br/><p>“Where are we going?” she asked. She thought that he would send her home first, drop off the luggage and then go for dinner.</p><br/><p>“My place.” his reply was succinct, “We’ll drop off the luggage then go for dinner.”</p><br/><p>Lin Qian was stunned.</p><br/><p>What… how could he bring her home so naturally? Since when did she agree to stay at his place tonight?</p><br/><p>Even though she was judging him silently, in the end Lin Qian said nothing. She pretended to enjoy the scenery and listen to the podcast, allowing Li Zhicheng to drive the car straight back to his place.</p><br/><p>His place was located in a development that was freshly built only two years ago, not far away from Aida Group. Because it was in the suburbs, the area was very big. She took a glance and was surprised to see that there were around twenty to thirty blocks standing under the sun.</p><br/><p>He stayed at a townhouse by the lake, located deep inside the neighborhood.</p><br/><p>Lin Qian immediately took a liking to his house the moment she saw it. She didn’t like enormous mansions; it didn’t feel like home. His house was a small two-storey home with a front yard and a backyard. The backyard was used as a parking lot; the front yard was filled with plants. There was even a wooden rack in the front garden, but it was empty.</p><br/><p>Lin Qian touched the tall wooden rack, “What do you plan to plant?”</p><br/><p>“Whatever you like.”</p><br/><p>Lin Qian felt a surge of sweetness, then she continued to be a character with mettle and complained silently: Tsk, this isn’t even my home.</p><br/><p>There was a vestibule immediately after they entered the door. Beyond the vestibule was a spacious living room. The home decor and furniture were all American country style; grand yet homey. Lin Qian scanned the room, then she asked, “You didn’t design this, did you?”</p><br/><p>Li Zhicheng threw her carry-on luggage on the sofa, nodding, “It’s my dad’s house. I am staying here for the time being.”</p><br/><p>Lin Qian understood. She put her hands behind her back, touring with great interest. Li Zhicheng followed after her, hands in his pants’ pockets.</p><br/><p>Living room, dining room, kitchen, guest room… obviously other than the living room, the rest of the first floor was not used often. Walking up a spiral staircase, she first reached a small living room on the second floor. It was quiet and well-ventilated.</p><br/><p>Then it was the study. This room was larger and it looked spectacular with a few book racks filled with books.</p><br/><p>There was a gym as well. A treadmill and two other pieces of gym equipment filled the space.</p><br/><p>Lin Qian stood by the doorside, “Do you still work out every day?”</p><br/><p>Li Zhicheng, “I’m used to it.”</p><br/><p>Indeed, when he was in the military, he must have done large amounts of exercise every day. Lin Qian turned around and pinched his arm. It didn’t seem brawny, but all she touched were tough muscles. Of course, the most beautiful part of him was his fit and well-developed abs; before she left last time, she even lay on top and rubbed herself against them… Lin Qian flushed, trying to look casual when she left the gym.</p><br/><p>Last came the master bedroom. It took up a lot of space, with a brilliant chandelier, thick golden-brown drapes, an arc-shaped king-size bed, and a wardrobe. But the decoration was simple as well. There was nothing except for the bed and the wardrobe. There was only a pillow on the bed.</p><br/><p>Seemingly sensing her thoughts, Li Zhicheng’s bass voice rang beside her ear, “Go and get another pillow from the cabinet.”</p><br/><p>Lin Qian’s face heated up; she turned around and glared at him, “Get it yourself.”</p><br/><p>His eyes were all smiles, he reached for her hand and led her to the cabinet. He opened the door, pulled out a pillow, lowered his head to give her a glance, and threw the pillow to her. Lin Qian caught it out of reflex, then she turned around with a reddened face, and placed the pillow on the bed.</p><br/><p>Being playful, she pushed his pillow to a far corner, then she placed her new pillow in the center, occupying the ruling position. After she was done, just when she gleefully wanted to turn her head and show it off to him, she suddenly felt the warmth of his body covering her back and his arms closing around her waist.</p><br/><p>Lin Qian was pressed against the wardrobe from behind; one of his hands leaned against the wardrobe, the other held her waist. His lips moved down from her face and her neck nibbling; his hand was fondling her silently. He only let Lin Qian turn around and face him when she had melted into a puddle after being incited by him. But he was still pressing her against the wardrobe, encircling her in his embrace.</p><br/><p>“Why did you suddenly kiss me, I merely took your spot…” Why was he suddenly aroused and kissing her aggressively?</p><br/><p>When faced with her coquettish protest, he had no smile on his face; his gaze was frighteningly dark and deep.</p><br/><p>“Lin Qian, today is the 23rd.”</p><br/><p>Lin Qian was confused. He had let go of her and said, “Let’s go have dinner first.”</p><br/><p>The dinner took place at an exquisite restaurant outside of the neighborhood. The food was delicious. Following Lin Qian’s temperament, after the past few hours, she had totally forgotten about the sorrow and melancholy she had for the past two months. She had forgotten about the sense of distance with him too. She returned to her usual self, telling Li Zhicheng the interesting encounters she had for the past two months while savouring the food on the table.</p><br/><p>Even though he didn’t speak much, he was obviously in a good mood too; one could see smiles in the corner of his eyes. But his dark and deep gaze was always set on her. This made Lin Qian feel slightly anxious.</p><br/><p>When they walked out of the eatery, the night was perfect. The sky was clear with a bright moon hanging. The neighborhood was tranquil. Thinking about what would happen later tonight, Lin Qian’s heart did a flip.</p><br/><p>After panicking, she subconsciously wanted to delay it.</p><br/><p>“A hundred steps after a meal makes living to ninety-nine a reality,” she said with a straight face, “Let’s go for a walk.”</p><br/><p>Li Zhicheng glanced at her, saying, “We will make a trip to the supermarket.”</p><br/><p>“Why are we going to the supermarket?”</p><br/><p>Li Zhicheng wrapped his arm around her waist, “To buy something.”</p><br/><p>Initially, Lin Qian didn’t realize what he wanted to buy. The supermarket was crowded and lively on the weekend. She saw the fruits section and happily walked towards it, picking up a few oranges and apples. After she had weighed them, Li Zhicheng took the bag from her, wrapped her shoulder with his arm and led her forward. The two made a round and Lin Qian didn’t have anything else to buy. When they were close to the checkout counter, only did she remember, asking, “What do you want to buy?”</p><br/><p>Li Zhicheng didn’t say anything.</p><br/><p>He led her in hand, walking past aisle after aisle of shelves, and finally stopped in front of rows of colourful boxes.</p><br/><p>Lin Qian saw it now; her face reddened instantaneously. She wanted to let go of his hand, but he reacted faster, holding her hand tighter, making it obvious that he wanted her to accompany him.</p><br/><p>Li Zhicheng was a man with deep thoughts. Even though he was unfamiliar with this kind of product, he didn’t say much, nor did he ask for help from the sales person. He stood in front of the shelves, reading carefully, then he picked a box and tossed it into the shopping basket.</p><br/><p>Then he lowered his head to glance at her, “Is it okay?”</p><br/><p>Lin Qian’s heart was in turmoil. Why does he ask me whether it is okay or not? As though I’m using it?</p><br/><p>But…alright, it will be used on me i guess…no wonder he needed to ask me…</p><br/><p>These messy thoughts flashed past and filled in the gaps, Lin Qian’s face was heated up even more. She said nothing, taking a glance at that box of Okamoto 003 condoms.</p><br/><p>Humph… not a bad choice.</p><br/><p>After they came out from the supermarket, every step towards his house was slow torture for Lin Qian.</p><br/><p>The two walked side by side. His words were few, his steps were steady. As Lin Qian stared at his composed profile and his tall and well-proportioned body, she thought back to that box of condoms being slipped into his pocket, and she started feeling restless.</p><br/><p>She even recalled the few days after their visit to Mount Emei. At night he would press her against the bed and kiss her whole body repeatedly. His hard and scorching desire was held in her hand, lightly pressed against her lower abdomen and nudged her, once, twice, hinting silently. During that time, he would raise his fervent, predatory gaze and stare at her, like a real, unmasked wolf…</p><br/><p>Lin Qian continued to silently follow him as they kept walking.</p><br/><p>But her every step was filled with thrill and uncontrollable desire.</p><br/><p>They quickly arrived at his home.</p><br/><p>The neighborhood was exceptionally quiet; there was only the two of them in the house, so the air was absolutely silent. The only sound Lin Qian could hear was her own panting.</p><br/><p>But Li Zhicheng seemed calm as usual. He turned his head and glanced at her, “I am going to take a shower downstairs. If you want to shower, you can use the bathroom in the master bedroom.”</p><br/><p>Lin Qian, “Oh…”</p><br/><p>He lowered his head to kiss her again, “Wait for me upstairs.”</p><br/><p>Lin Qian’s heart did a flip again. She couldn’t say anything, so she could only… obey him and went upstairs.</p><br/><p>As the hot water slowly flowed down her body, Lin Qian stared at the water streaming through her fingers dumbfoundedly.</p><br/><p>She was about to become one with him. He would finally fulfill his wish.</p><br/><p>Thinking of this, her heart softened for him, but at the same time, she was also a bit amused. She buried her face in her hands. Li Zhicheng, will we be in love forever? Right now, as I am about to walk towards you, I wish this moment would last forever. Only then will your waiting and desire be worth it, and my decision too.</p><br/><p>She also remembered why Li Zhicheng said today is the 23rd.</p><br/><p>It was because the last time her period came, it was the 14th.</p><br/><p>Today was very safe for sure, with no chance of being interrupted again.</p><br/><p>He sure did remember.</p><br/><p>Turning off the faucet, she put on her nightgown. It was made of silk, running down to her knees. It had a V-shape collar, revealing a small patch of snow white skin around her chest. Her arms and legs were laid bare.</p><br/><p>Lin Qian looked awhile at herself in the mirror, then she pushed open the bathroom door.</p><br/><p>As she walked out, she was stunned.</p><br/><p>The drapes had been drawn closed, covering the windows securely. The lights on the ceiling were turned off, leaving only a dim floor lamp on; the soft lightning rippled through the room.</p><br/><p>Li Zhicheng stood next to the lamp, turning his head as he heard the bathroom door.</p><br/><p>He was in a long, black bathrobe, with his hands in the pockets, revealing his calves. The bathrobe was made of silk, pure black and soft; he looked fair and cold in it. His temperament seemed to be more poised and lazy than usual, but equally handsome and charming.</p><br/><p>Who knows how long he had been waiting for her.</p><br/><p>Lin Qian forgot to breathe, staring at him in a daze.</p><br/><p>When he saw her, he took his hands out from his pockets, walking towards her slowly.</p><br/><p>Lin Qian’s heart felt like it was about to jump out of her throat.</p><br/><p>He stood before her and lowered his head to look at her. Lin Qian’s palms started sweating.</p><br/><p>Suddenly he bent over and swept her off her feet. “Ah!” Lin Qian let out a soft cry in alarm; he held her firmly in his embrace.</p><br/><p>Their surroundings were still. Her face was pressed against his chest; she could hear his racing heartbeat. He looked down at her; his dark gaze was like the endless night, staring at her.</p><br/><p>“Lin Qian.” He slowly asked, “How long have I waited?”</p><br/><p>Lin Qian felt her throat dry up, and with a quivering voice she answered, “…seventy-nine days?”</p><br/><p>He embraced her, and then turned and led her to the bed behind them.</p>\n</div>"}