{"title": "Chapter 64 - Hello, Brother", "id": 64, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-64-hello-brother", "volume_title": "Volume 1", "body": "<h1>Chapter 64 - Hello, Brother</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Why would a multi-national corporation acquire a Chinese company? Because the Chinese market was too tempting. Lots of foreign corporations couldn’t adapt to the environment in China, or compete with local companies. At times, acquisition became the most effective means to expansion.</p><br/><p>For one thing, it could obtain the mature sales channel, market network, talent and client resources of the local company; for another, acquiring rivals helped annihilate them once and for all. Brands such as “Little Nurse”, “Robust” and “Lekai Film” were prevalent several years ago, but now, they were nowhere to be found. What’s more, buyout of the top firms in the industry led directly to monopoly.</p><br/><p>Were there well-known instances? Of course. Hygiene products, cement, snacks, soybean and mechanical manufacturing were all gradually being dominated by foreign companies. If they couldn’t compete with local companies, then they would buyout the competition, which was a trick used repeatedly by foreign corporations.</p><br/><p>And now, they stepped into bag industry.</p><br/><p>From Lin Mochen’s perspective, it was just the result of globalization. He would never have the struggle that he, as a Chinese citizen, should be patriotic and protect national brands. He only knew that Chinese companies had to go through these ordeals if they wanted to participate at international levels. It would be excellent of someone if they could protect their own company, but they would be the only one to blame if they were eventually conquered.</p><br/><p>Cruelty and ambition manifested by western corporations resembled what they demonstrated when they invaded China centuries ago. Even if DG didn’t acquire China’s bag corporations today, there would be other multi-national corporations in the future doing the same thing.</p><br/><p>Aida would face the same trial sooner or later, no matter what. Lin Mochen wouldn’t change her fate, nor could he change that of Aida. However, he was trusted by his clients, and he couldn’t reveal any information to her. It was ethical of him to observe confidentiality, and the apathetic way he talked to her was not problematic at all.</p><br/><p>It was ten o’clock in the morning.</p><br/><p>SMQ, MK Investment Management Corporation and DG Corporation were sitting at the round table. After half a month of negotiation, there was finally a consensus between the three, with DG Corporation buying fifty-one percent of SMQ’s shares and becoming the controlling shareholder. This would inject a large sum of funds into SMQ and make SMQ the first-tier company in Asia-Pacific Area through mutual efforts.</p><br/><p>To Chen Zheng, although he acquiesced in this buyout, it might also be a new start for him. According to the contract, DG Corporation would send off a few of the personnel to the executive and management board, but he was still the general manager and in control of the company. Not only could he receive a large sum, but also could he introduce advanced foreign technologies and patents to his firm. Even though there were many harsh conditions in the agreement, this cooperation was indeed a win-win like what the media said.</p><br/><p>But for Lin Mochen, only one thing would happen to SMQ. DG acquired SMQ not to help it, but to enter Chinese market under its shield. After a short while, he would use methods like stock splits to gain more control of SMQ, per his client’s desires. In the end, Chen Zheng’s managing power would be removed and SMQ would exit the market gradually.</p><br/><p>The process was so smooth that Lin Mochen found it dull. Lin Mochen’s team resided in the most luxurious hotel in the center of the city. But this night, instead of going back to his hotel, he went to another apartment in the downtown area. That was an apartment he purchased a few years ago when he went back to Lin City. He purchased it to have a private place to stay in, and to make sure Lin Qian would have a house no matter what happened.</p><br/><p>His apartment was a penthouse. As he opened the door, he saw the blazing light inside and a pair of heels by the door.</p><br/><p>He wasn’t hurried, rather, he walked inside slowly. He looked around and found the floor and furniture cleansed. It seemed that Lin Qian had asked someone to clean up. However, the two pots of orchids on the balcony had withered, resembling two slender bones. He frowned seeing this.</p><br/><p>Apparently, Lin Qian didn’t take care of this apartment regularly and only did it knowing he would come.</p><br/><p>There was no one in the living room while the lamps were on in the bedroom. Lin Qian’s silhouette was swinging, but she didn’t come out after hearing his footsteps.</p><br/><p>Lin Mochen sensed something strange and walked there hurriedly.</p><br/><p>She was rummaging through his things.</p><br/><p>The drawers and closets were all opened. The sister he hadn’t seen for a long while obviously came here directly after work. Her coat was taken off, and she was searching through the closets wearing her white shirt and skirt with her sleeves rolled up.</p><br/><p>She barely threw him a flance when she heard him approach the door. That glimpse was clearly mixed with pique. She kept searching without looking at him. Lin Mochen was agitated, “So you’re welcoming me by going through my stuff without permission right in front of me?” This had never happened before. Even when she was visiting him in America, she never entered his room and touched his private articles.</p><br/><p>Lin Qian buzzed and answered, “We don’t have shame when it comes to imperialist invasion!”</p><br/><p>Only then did Lin Mochen realize that she was looking for the buyout documents.</p><br/><p>He stayed silent for a while, walked to her, dragged her to the living room and pushed her to the sofa. “You have no idea what you’re doing,” he scowled.</p><br/><p>As a matter of fact, when she first realized that her own brother came to acquire Aida as a representative of foreign corporation, Lin Qian found it hard to accept.</p><br/><p>Was he really so ruthless that he didn’t even care about her well-being? What if he was the one in charge of the buyout? Could Li Zhicheng handle it? Where would that lead her and Li Zhicheng if they were in opposition against each other? Would their relationship be jeopardized, and would they break up because of her inhuman brother?</p><br/><p>How was it possible?</p><br/><p>She even thought that Lin Mochen took this case to fulfill his promise by making Li Zhicheng go through turmoil. However, that was ridiculous even to think about. Lin Mochen always drew a distinct line between public and private affairs. Even if he was mighty, he would go against her to teach Li Zhicheng a lesson.</p><br/><p>There was a bigger issue behind this.</p><br/><p>She always held a belief that even though her brother was merciless to others, he wouldn’t imperil her happiness for money alone. She came here today to figure out his intentions and to collect some information.</p><br/><p>“Why’re you doing this, brother?” she asked straightforward with a glint in her eyes. Lin Mochen didn’t care for the aggressive way she talked, but he didn’t want any misunderstandings between them either. He sat across from her, poured himself a cup of tea and chose not to respond for a long while.</p><br/><p>Only when there was a blaze in her eyes did he open his mouth, “I’m not the only partner in my firm. Do you really think it’s possible for them to forgo an acquisition that’s worth multi-million dollars just because my sister’s in one of the companies? Grow up, Lin Qian.”</p><br/><p>She knew that this was one of the reasons. She was relieved but still blamed him, “You should’ve told me earlier so that we can be more well-prepared.” Lin Mochen ignored that unreasonable requirement. “But, are you really thinking about acquiring Aida?” she asked, “even if we shouldn’t bring public affairs into our private life. What’s going to happen to me and him? Have you ever considered it?”</p><br/><p>Lin Mochen gave her a sophisticated glance. “Lin Qian,” he didn’t address her question, instead, he suddenly changed the subject, “you need to understand that this buyout will happen no matter what. Even if we don’t do it this time, some other corporation will.” Lin Qian was dazed. This sounded brutal but, did he mean it was better him than others to do this? Is he signaling mercy?</p><br/><p>In other times, Lin Qian wouldn’t keep asking when she thought she knew the implications because Lin Mochen had strong work ethics. It was inappropriate for him to tell her everything explicitly, and she was sensible enough to understand that.</p><br/><p>However, this was about Li Zhicheng and Aida, and when you cared about something too much, you couldn’t think straight. Lin Mochen’s ambiguous answer didn’t satisfy her.</p><br/><p>What if I understood it wrong? What if he was being literal? What if he was actually saying it’s better him than others to make the profit? It’s entirely possible given his record.</p><br/><p>As she was contemplating this thought, Lin Mochen opened his mouth, “Anything else? Please go back if there isn’t.” Lin Qian didn’t care about that “expulsion order” and decided to drop a bomb. She pulled her right hand out of her pocket and showed it to him. The ring was shining on her ring finger.</p><br/><p>Lin Mochen became morose.</p><br/><p>“I’m engaged to Li Zhicheng already,” she said, “so tell me openly whether you’re going to help us or not? If you’re not, then you’ve put me between you two, and you cannot blame me if I choose him over you. I’m a person of my word.”</p><br/><p>Although Lin Qian wasn’t expressive, she felt apprehensive when looking at his dark eyes. As for Lin Mochen, he was upset the moment he saw that ring. His only sister became someone else’s fiancé without telling him. And now, she was threatening him like this and claiming to choose Li Zhicheng over him?</p><br/><p>Huh…</p><br/><p>“OK,” Lin Mochen stood up impassively, “then wait for him to be crushed.” Then he walked into his bedroom.</p><br/><p>Lin Qian had spewed those word to make Lin Mochen realize the seriousness of this issue. After all, everyone had a soft spot and even if what she said would infuriate him, he was a shrewd person and would take her advice. Even if he needed to deal with Li Zhicheng in the future, he would at least hold back a little thinking about her.</p><br/><p>In all honesty, she favored Li Zhicheng more. But on the other hand, she did this to know whether Lin Mochen would help them or not, and if so, how would he help them. Unfortunately, all she accomplished was enrage her brother and made him say threatening things like “wait for him to be crushed”.</p><br/><p>Lin Qian wandered in the living room for a while and realized how hurtful what she had said was. She entered the bedroom silently. Lin Mochen was sitting on a chair looking at America’s stock index. He ignored her “Brother,” Lin Qian sat at the edge of the bed and murmured. He kept ignoring her.</p><br/><p>Lin Qian hooked his arms, “I admit I was wrong, OK? I knew that you wanted to look after us when you take the case. I just wasn’t sure.” Lin Mochen glanced at her, “Too late, please leave. I’ve changed my mind and will request to execute the acquisition by myself in a couple of days. If he accepts it, that’s good; but if he doesn’t, I’ll collaborate with DG Corporation and use SMQ against you. If you don’t see Aida in the market next year at this time, don’t be surprised, Ms.Lin.”</p><br/><p>Lin Qian didn’t know whether to laugh or to cry, when he said “request to do it by myself”. “Brother. I admit I was wrong, totally wrong! I don’t want to be in a war against you!” she held his arms tightly, “my fiancé is important but not as important as my brother. If you really treat me this way, will father be happy? After all these years apart and you didn’t find me until you were sixteen. Can you really bear losing me again?”</p><br/><p>She had completely caved in and what she said was extra sensational. Lin Qian originally meant to comfort him, but she did reveal some true feelings talking about the past. Her words and expressions obviously touch him. He gave her a brief look and hummed, but he stopped saying relentless things. Lin Qian knew him perfectly well, so she followed up and comforted him before seeing his smile.</p><br/><p>“I won’t be involved in Aida’s acquisition given our relationship, instead, my colleagues will be, and this was the deal with other partners from the beginning,” he finally fulfilled her will by giving her more information, “I’m only in charge of New Bori and SMQ.”</p><br/><p>Lin Qian was relieved knowing her brother wouldn’t be involved so there wouldn’t be any frictions between her and Li Zhicheng. And on second thought, things wouldn’t end well for New Bori and SMQ in her brother’s hands.</p><br/><p>At ease, she looked up at him and said, “Things are so much easier now that your colleagues are involved. Li Zhicheng’s really good, and if there is going to be a fight and they’re nailed, don’t pity your colleagues.”</p><br/><p>Lin Mochen smiled mildly and said, “He was like a clay idol crossing a river now, and I’m the one should worry? Go figure out whether he wants to sell Aida or not. The terms for acquisition of Aida were the best out of all three and he is a businessman much crueler and more pragmatic than you. Are you sure he doesn’t want it?”</p><br/><p>Lin Qian was transfixed.</p><br/><p>She never talked about selling of Aida with Li Zhicheng.</p><br/><p>When she extrapolated something from what Lin Mochen said, she volunteered, “I’ll go to my brother’s and figure it out.”</p><br/><p>“Don’t push yourself too hard if it’s not convenient for you,” Li Zhicheng nodded his head.</p><br/><p>Lin Qian’s instinct told her that he was not going sell because it was a family corporation. She’d never thought about the cost and benefit in it but now that her brother brought it up, she wasn’t so sure anymore. After all, he gave up Aito without any regrets. “Lost benefits were for great benefits,” Li Zhicheng had said.</p><br/><p>Lin Qian felt confused. Disappointed? Not necessarily so, but she was just a bit confused. She brought out her phone and called him. “I just got out of my brother’s home. Where’re you now?” Li Zhicheng’s voice was calm and low as usual, “I just left the office. Where’re you? I’ll drive you home.”</p><br/><p>Li Zhicheng was quite tranquil after learning Lin Qian’s brother was planning on a buyout. Lin Qian was a relieved to hear his voice. “No need,” she said, “I’ll drive home myself and it won’t take much time.”</p><br/><p>“Sure,” he murmured, “I’ll talk to you at home.”</p><br/><p>Lin Qian felt warm somehow. After hanging up the phone, Lin Qian saw a familiar silhouette coming right at her in the parking lot. Darn it! Lin Qian swore in her heart. Enemies cross each other on the path.</p><br/><p>Chen Zheng wasn’t surprised when he saw Lin Qian. When he had learned Lin Mochen had a sister named Lin Qian who lived in Lin City from other people in MK corporation, he was astounded and had mixed feelings.</p><br/><p>He recalled the slap on Lin Qian’s face he ordered.</p><br/><p>He also recalled when he fought with Li Zhicheng for the Mingsheng Project, he had heard someone mention how Lin Qian set Li Zhicheng up with someone. He was surprised back then that Lin Qian had some connections. And now, it was her brother who would acquire SMQ.</p><br/><p>If he and Lin Qian were together, what would happen now? Perhaps SMQ could turn things around without losing so many shares. “Lin Qian,” he called her name calmly, “are you here to look for your brother?” He knew this address from Lin Mochen’s colleague.</p><br/><p>He only wanted to bond with this influential investor.</p><br/><p>Lin Qian could guess what he was doing here. She glanced at him with blatant contempt and turned away. Chen Zheng reach out his hands and stopped her, “Why’re you hiding? I know Mr.Lin already and we’re going to be partners from now on. Can we just let bygones be bygones?”</p><br/><p>“You’re sick,” Lin Qian said.</p><br/><p>“Lin Qian!” Chen Zheng looked helpless, “I didn’t intend to slap you! I was pursuing you for a long time and you went straight to Li Zhicheng’s arms. What man can take something like that so easily? I just wanted them to scare you. I didn’t think they would actually hit you.”</p><br/><p>Lin Qian couldn’t be tricked that easily. She glared at him without saying a word.</p><br/><p>Chen Zheng had little self-respect. He lowered his head and drifted closer to her, “Slap me and then we’ll call off the feud, shall we? Do you think I’m willing to sell SMQ to your brother? If it weren’t for the war between Aida and New Bori, which messed up the whole market, SMQ would be in much better shape. You stayed in SMQ for three years, and I treated you well. If that still means something to you, slap me and forget about the past. We’re both Chinese brands, and from now on, please help me in front your brother. I will owe you forever,” he said sonorously and looked at her sincerely. He acted like he never had before.</p><br/><p>Lin Qian was biting her lip. She disdained this person emotionally but thinking about his words “Do you think I’m willing to sell SMQ” and what could happen to Aida in the future, she did empathize with him. “No need for me to slap you. I’m not into that,” she said faintly. “As for my brother, I’m sorry but I can’t bring private issues into professional affairs. I can’t help you with that.” She turned and left without caring about him.</p><br/><p>Chen Zheng stood there still and saw her drive away. He gradually became sullen.</p><br/><p>He didn’t know that Lin Qian had never mentioned the private vendetta between them two, including the slap. At that moment, he recalled all the harsh terms Lin Mochen required during the acquisition and all the pressure he put on SMQ. He was infuriated.</p><br/><p>It must be because of that slap. That’s why Lin Mochen treated SMQ so harshly!</p><br/><p>Darn it! Lin Qian, Lin Mochen, if you give me any chance in the future, I’ll definitely have my revenge! I swear to almighty God!</p><br/><p>He buzzed and went upstairs. When he arrived at Lin Mochen’s door, he was already carrying courteous smile.</p>\n</div>"}