{"title": "Chapter 69 - Fish in Troubled Waters", "id": 69, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-69-fish-in-troubled-waters", "volume_title": "Volume 1", "body": "<h1>Chapter 69 - Fish in Troubled Waters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The hotel faced the street, with rainy lanes on one side and a wet square on the other. The square was surrounded by gray churches and bell towers. In the distance, was the muddy Arno River and an ancient bridge on the top, in the rain shower.</p><br/><p>Lin Qian had never been to Florence before, but she had heard of it for years. Now that the battle was on the way, the two of them fled to the small town at the end of the world, as if they were isolated from the rest of the world, feeling calm and peaceful.</p><br/><p>She sat on the bed in the hotel room and sorted the clothes in the suitcase. Li Zhicheng sat on the edge, watching.</p><br/><p>Everything was packed by him, in Lin City. She soon discovered something wrong.</p><br/><p>She picked up a stack of skirts from the box and showed them to him, “Why did you only pack the skirts?”</p><br/><p>Li Zhicheng glanced at the stack of skirts and lifted his eyes to look at her. He faintly answered, “Because your legs are beautiful.”</p><br/><p>Lin Qian sneared, she couldn’t help but laugh. It wasn’t convenient to only bring skirts on a trip. But she had to accept the fact.</p><br/><p>While putting the skirts into the drawer, she thought, He’s never packed clothes for me. Now I’ve finally found out that his preferences are so obvious and monotonous.</p><br/><p>But she soon found out that she had come to the wrong conclusion. Because she then discovered a stack of colorful bras and panties. And his underwear, were all black, neatly stacked on the edge.</p><br/><p>Lin Qian started counting, red, black, purple, blue, green, white, brown… She turned and looked at him, thinking, among my entire drawer of underwear, it’s not that easy to find so many colors.</p><br/><p>“What is this?” She pointed at the stack of fancy lingerie. “Seven colors, are you collecting Dragon Balls?”</p><br/><p>Li Zhicheng rested his hands on the back of his head and leaned on the edge of the bed, answering, “They were all random.”</p><br/><p>Huh!? I don’t believe he just randomly grabbed all these seven colors.</p><br/><p>In a well fitted shirt, shiny shoes, and his fateful look, Lin Qian was looking at the man right in front of her, as an industry giant, she had a very different picture emerging in her mind. Yesterday, when he was alone at home, he was carefully selecting his fiance’s panties and bras, then patiently folding them one by one, into the suitcase.</p><br/><p>Fine, she admitted that she suddenly felt it was very pleasant.</p><br/><p>When he went downstairs, Lin Qian was looking at his tall straight figure, then something suddenly hit her, although he looks subtle, sophisticated and quiet, in fact, when it comes to sex he’s actually pretty romantic, and full of ideas …Having thought of it, her cheeks grew slightly hot.</p><br/><p>From now on, I should also try to spice it up!</p><br/><p>Li Zhicheng was standing on the porch and was on the phone. With his ink black hair, sharp jawline, thin coat, and standing in a drizzle, he was handsome like a quiet and still sculpture in the town.</p><br/><p>Lin Qian stared at him, with her mind drifting.</p><br/><p>“OK, see you later.” He hung up and turned to look at Lin Qian. “The car is coming to pick us up very soon.” She nodded.</p><br/><p>She suddenly came to realization, eyes widened, staring at him, “Your English!?”</p><br/><p>Did she hear anything wrong? It was fluent, no different from hers at all.</p><br/><p>Li Zhicheng put both hands in his pockets and answered indifferently, “It takes practice.”</p><br/><p>Come on! Last time in the U.S., he said that he couldn’t even order in English? In the past two years, I’ve never seen him read an English book, not even close. He’s pretending to be weak again! In order to chase me at the beginning, he was really wracking his brain!</p><br/><p>Lin Qian put on a rough stare at him, but he just smiled lightly and wrapped his arms around her to get in the car.</p><br/><p>In fact, Li Zhicheng’s English was more than just fluent. In the next two days, he even talked to two companies that made leather goods and casual bags. He didn’t need an interpreter to be present, nor help from Lin Qian. He obtained the rights of sales and distribution in Asia from those two companies.</p><br/><p>Both of them were local companies and small in scale. One of the companies’ products were not yet sold outside of Italy, and the other was only making their business in central and southern Italy. When approached for cooperation by Chinese industry giants like Li Zhicheng, they were ecstatic. The cost obtain the distribution rights was quite decent, and Li Zhicheng therefore signed the contracts for five years at once, and placed two orders that were considered quite substantial for both of the small firms.</p><br/><p>When they stepped out of the office building, it was the evening. The town was flooded with lights, and the shops on both sides of the long street were full of world-renowned luxury brands, just like the Avenue of Stars leading to the unknown.</p><br/><p>Lin Qian held Li Zhicheng’s arm and took a look at the black backpack he used for documents, looking proud, “Well, I feel like I am a nouveau riche today, came to Europe to ‘shop’ and place orders.”</p><br/><p>Li Zhicheng gave a faint smile, looking ahead, “One day, Aida’s flagship store will also be opened here.”</p><br/><p>He rarely spoke so straight from the heart, leaving Lin Qian’s heart beating faster, “Ah,” ambitiously, she pointed at the luxury shops in the front , “my brand in the future, will also reside here! Right next to yours.”</p><br/><p>Li Zhicheng paused suddenly, retrieving his arms, grabbing her to his chest and bowed his head to kiss her.</p><br/><p>On the streets of an exotic country, there were strangers of different skin colors everywhere. He embraced her, standing in the middle of the rainy street, quietly kissing without any disturbance.</p><br/><p>Their dinner was served in a small shop on the street. Red wine and steak, such a simple combination, yet unexpectedly good. Lin Qian was a little tipsy, taking out the documents from his bag and looked while asking, “How many contracts have we got?”</p><br/><p>“Including the resale franchising agreement from the domestic companies from back home, five, in total,” Li Zhicheng responded.</p><br/><p>Lin Qian carefully looked through the information on the five companies. From German companies with a turnover of more than 100 million euros, to some local companies in Florence, like the those visited earlier in the day; including both leather goods and leisure bags. Most of them were moderately priced, some were supplied to Li Zhicheng at a very low price. The quality also varied. Some of them were second and third tier products, but just as good as DG, some were in the Italian style, but the workmanship was very rough.</p><br/><p>However, they all shared something in common, a long history of at least 50 years or hundreds of years.</p><br/><p>This was similar to DG. Lin Qian thought in a playful way.</p><br/><p>After the dinner, Li Zhicheng held her hand, “Let’s go get the last contract.”</p><br/><p>Lin Qian was a bit surprised, “This late?”</p><br/><p>The nightlife in the town had already begun. The music in the alleys was roaring, and the buskers were in wide-brimmed hats, leaning against the walls to sway their saxophones gracefully.</p><br/><p>Li Zhicheng took Lin Qian, turning a few corners before finding a small door in the alley where the local residents lived. The grayish-brown stone wall contained a square door, adorned with Chinese lanterns, red and hazy.</p><br/><p>A tall, young, blond man stood in the doorway and saw Li Zhicheng, greeting him with enthusiasm, “Hey! Li!”</p><br/><p>Li Zhicheng also laughed, “Hey, David.”</p><br/><p>Lin Qian stood aside, watching the two hug. Very surprising and interesting.</p><br/><p>She had no idea, since when did Li Zhicheng have foreign friends?</p><br/><p>The two men greeted each other in a whisper, and at the same time, they turned to Lin Qian.</p><br/><p>“My fiancee, Lin.” Li Zhicheng said.</p><br/><p>David’s blue eyes glowed with passion, “What a beautiful girl! Lin, I’m David. Nice to meet you.”</p><br/><p>After the three walked into the shop and had a brief conversation, Lin Qian then found out that when Li Zhicheng was searching around the world for fabrics suitable for the “Longbow,” he met David. He became a friend by coincidence.</p><br/><p>This time Li Zhicheng was here to buy the Chinese contract of his family’s ancestral handmade leather goods.</p><br/><p>After walking in the store, she discovered that it was actually very large, narrow and long. Even though the outside looked ordinary, the inside was very delicately decorated. Both sides were full of glass cabinets, with beautiful leather bags inside. Lin Qian was also an expert, she could tell that the workmanship was very delicate and was a rare premium product, from a glance.</p><br/><p>“Such a big store, all by yourself?” Lin Qian asked.</p><br/><p>“No,” David giggled. “There are five girls as waitresses and eighteen workers. I’m only responsible the for the design.”</p><br/><p>Lin Qian nodded in admiration, “Excellent. These are the best products I have seen in Florence during our visit.”</p><br/><p>David was very pleased, and he took out a nice handbag directly from the cabinet and handed it to her, “For you! For your compliment.”</p><br/><p>Lin Qian quickly waved, “Too much!”</p><br/><p>David looked at Li Zhicheng, saying even though he looked simple and straightforward, he could tell the difference.”</p><br/><p>Li Zhicheng laughed and looked at her. “That’s ok, just take it.”</p><br/><p>Lin Qian accepted it. She adored the design and feel of the bag.</p><br/><p>It turned out that since David took over this ancient shop from his father, he had been enjoying his freedom. It all depended on his mood, if he wanted to go travelling, he would close the shop, letting the workers go on holiday, and he would end up somewhere else overseas. However, his craftsmanship, workmanship, and design were among the best known in Florence. Even though he only worked perhaps one month a year, it was enough to support himself.</p><br/><p>There also had been international luxury brands attempting to buy him and his brand. As to the result? They were severely rejected by him, because he didn’t want his life to be too exhausting.</p><br/><p>As to Li Zhicheng’s current visit, on the one had he was planning to receive the contract in Asia and set up a joint venture to build a factory. On the other hand, he also wanted to invite David to visit China and supervise the management of the factory’s production.</p><br/><p>With such great conditions, David was certainly happy.</p><br/><p>The three sat at the bar, further behind the store, with bright lights shining down on top of their heads. Li Zhicheng took the agreement out of the backpack and sent it towards him, “Take a look, if you have any ideas, you could keep adding to them.”</p><br/><p>Surprisingly, David pushed the agreement back to him, “Not necessary, you have covered my travel expenses and accommodation to and from China, that’s enough for the contract. Our family will always make sure it’s a fair deal.”</p><br/><p>Lin Qian “…”</p><br/><p>Li Zhicheng “…”</p><br/><p>In the end, Li Zhicheng made the decision for the young man, the two both signed their names according to his agreement.</p><br/><p>Even the next day on the flight back to China, Lin Qian remained tickled by it.</p><br/><p>She leaned back in her wide chair and looked over to her man next to her, “You’re kicking ass. We almost traded a contract with a trip.’</p><br/><p>Li Zhicheng faintly smiled, “It’s also fate.”</p><br/><p>Lin Qian nodded.</p><br/><p>Meanwhile, David, who was sitting on the other side of Li Zhicheng, probed, “Li, may I ask you something?</p><br/><p>“Of course.”</p><br/><p>Lin Qian also looked at him with interest.</p><br/><p>“Why did you want to buy my contract?” asked David. “Don’t tell me to it’s for the money. Although my shop is excellent, nobody outside of Florence knows about it.”</p><br/><p>Li Zhicheng was silent for a moment and replied, “For the competition.”</p><br/><p>He looked up at the vast blue sky and floating clouds outside the window, slowly, “There’s an internationally-renowned brand that wants to get into my country, acquire my company, and my market.”</p><br/><p>David shrugged, “That’s why I always say that expansion is the dullest thing. It turns the craft into a business, boring and ruthless. Such awful invaders, I support you.”</p><br/><p>Li Zhicheng and Lin Qian both smiled slightly, then Li Zhicheng continued, “In China, many people have this idea that foreign products are better than ours, that they show their personal tastes…”</p><br/><p>David exclaimed, “That’s ridiculous!”</p><br/><p>Li Zhicheng continued, “… Once a foreign brand enters the Chinese environment, it’ll stand out, and have great advantages over our domestic brands. As soon as it’s learned and accepted by the consumers, our national brands are bound to face some difficult situations. I can’t let it happen.”</p><br/><p>Lin Qian arranged several cups on the tray table, one by one, and then said, “What are we going to do then? For example, in the past few years, China has a particularly famous snack called ‘Drop-Dregs Cakes’. Because the taste was particularly good, it swept many cities for a while, but then there were many similar chain stores with different quality, and consumers had no idea how to tell which were authentic. They’ve tried a few places and none of them were as good. In the end, they simply stopped eating Drop-Dregs Cakes. The product kept getting worse and worse, eventually being eliminated by the market. Now it’s rarely seen.”</p><br/><p>David started to understand, mouth wide open “So… you buy a lot of contracts, that way the consumers can’t tell which Drop-Dregs Cakes are authentic?”</p><br/><p>Lin Qian smiled and nodded. “Yes. But I’m not saying that your product is of poor quality. Yours is excellent and we will sell it as a high-end good. This trick in the old Chinese saying is …” she turned to look at Li Zhicheng.</p><br/><p>“Fish in troubled waters”, he said slowly.</p><br/><p>In April of that year, it was a very memorable occasion for DG Asia Pacific president, Charles, because DG’s four main sub-brands officially entered the Chinese market.</p><br/><p>That April, for Charles, was also very dark, because he encountered a massive lull in sales. How bad was it? The market performance was so bad that he could not believe his eyes. He even suspected that the statistics were wrong. They must have left out two zeros!</p><br/><p>How did it get to this point?</p><br/><p>In early April, DG China started a large-scale promotional campaign on the Internet, on television, in print ads, and in retail stores. Its main advertising, on prime-time television, was also heavily launched.</p><br/><p>The ad began on the elegant Apennine Peninsula, where a blonde woman was drinking coffee on the grass outside an estate. Suddenly, a man with short brown hair and black eyes dressed in a knight’s armor came towards her, on horseback. The two looked at each other in astonishment, and the man pulled her up onto the horse. The woman looked slightly panicked but was still taken away.</p><br/><p>In a flash, the picture showed a ball, with old crystal lamps, in an ancient castle, recreating the exact image of the last century. In the room, many servants helped the woman change into an evening gown, jewelry, and finally a lady’s handbag. She took it and slowly stepped out of the door.</p><br/><p>In front of a debaucherous dance floor, the man stood a few steps away and reached out to her. The lady gave him her hand.</p><br/><p>The two danced in front of a lit window, and the mood was fantastic and blurred.</p><br/><p>Finally, the lady ended up in pajamas, spreading her hair out, looking sleepy, just like a girl next door, awoke from the bed of a manor, sitting up.</p><br/><p>She seemed to recall a dream from the previous night, and when she picked up her handbag sadly, she went by the window and stared. The glass reflected her beautiful face. For a moment, it seemedlike an eternity.</p><br/><p>Text and voiceover both appeared at the same time, “DG, My dream.”</p><br/><p>Not only after Charles and his staff, and even Chen Zheng saw the advertisement, they had to admit that it was very artistic. In today’s popular words, it was very classic and elegant, with some elements of traversing back to the ancient times. It suit the Chinese tastes perfectly.</p><br/><p>They believed that DG would surely successfully enter China.</p><br/><p>As was said before, the launch of a new brand would not have an explosive reaction in the market. Bags, such daily necessities, were a reflection of personal tastes. It would take a while for consumers to recognize and accept this brand.</p><br/><p>Hence Charlie, Chen Zheng and others confidently awaited for the market to burst!</p><br/><p>But the outbreak didn’t happen, only a pile of fakes.</p><br/><p>More than ten days later, when sales in DG’s market started to improve, something terrible happened.</p><br/><p>Six! A total of six foreign brands came from nowhere and suddenly appeared in the market.</p><br/><p>Moreover, their advertisements had deliberately imitated DG, to a point of irritation.</p><br/><p>The first brand, “Rain”, featured a young girl who was fishing on the Apennine Peninsula. Suddenly, a man driving a boat came from the sea. When the young girl saw him, she became infatuated and gave him her hand, stepping onto to his ship. With the twinkling of an eye, it was already under the surface of the sea. The two were able to freely walk and breathe like fish in the water. Their eyes stared with silent affection.</p><br/><p>In a flash of the image again. The girl was lying on a wet shore. It was raining and dark, she was surrounded by only her handbag. Holding the tears in her eyes, she looked at the calm sea. Her appearance was not beautiful, but there was a clear and moving cleanness.</p><br/><p>The text and voiceover both appeared at the same time:</p><br/><p>“Rain, that’s my heart.”</p><br/><p>Of course, many viewers saw this ad as better and more attractive than DG’s. And it turned out that the same was true, as of the end of June, Rain’s total sales in China, were even with DG. Of course, this was under the assumption that both sales were not high.</p><br/><p>This kind of advertising emerged in an endless stream. Some brand’s advertisements were not necessarily similar to DG, but their advertisements were very malicious.</p><br/><p>For example, a brand called “David” was advertised as starting in 1890, 10 years earlier than DG. Charles was very angry when he found out about it, and sent someone to check. The answer was that the company was indeed founded in 1890, and was an ancestral shop in the small town of Florence. Somehow, it also had come to China to interfere.</p><br/><p>What did the customers think?</p><br/><p>For a while, all they saw was the streets and lanes filled with advertisements for various foreign luggage brands. The advertisements were indeed dazzling. Some were for DG and some were for David; some stated that they had been existing for 109 years (that was, the DG Group), others claimed that they have been founded for 150 years; and some said that they were the most authentic in Italy, some said that they were the oldest in the Apennine Peninsula.</p><br/><p>The price and quality were even more varied. Some of them apparently were very ordinary, but they were sold for 3,000 Chinese Yuan; some were of average quality, but the designs were decent and they were quite cost-effective, so they were sold for 300.</p><br/><p>As Li Zhicheng and Lin Qian expected, a huge amount of information had hit consumers at the same time, so they became confused and uncertain.</p><br/><p>Originally there was only one ‘Drop-Dregs Cakes’ shop in front of them, but suddenly there were ten shops, making it impossible for everyone to remember which was the original.</p><br/><p>Of course, after all, DG enjoyed an impressive reputation in foreign countries, there were still many fixed consumer groups that could distinguish them. However, it was the second and third tier sub-brands that entered China first, not the top brand in the world, and consumers who barely knew about them still accounted for the vast majority.</p><br/><p>So in the end, even if a customer arrived at a DG’s store, smiled and asked, “You’re the sub-brand of the David Group, right? It’s my favorite brand. Oh…it’s not? Never mind, I’m not taking it.”</p><br/><p>Someone also spent a thousand dollars to buy a new DG bag, happy to take it to work. As a result, their colleague looked and laughed, “I also bought a bag from Italy. At the sales in the supermarket yesterday, there were only 200 RMB. Not bad, yeah?”</p><br/><p>At the quarterly sales meeting at the end of June, Charles, who had always been very even-tempered, stood up and shouted outrageously, in front of all the Asian Pacific staff, “The Chinese are shameless!”</p><br/><p>At the same time, Lin Qian and Li Zhicheng still lived in a hotel on the Xiang River bank. She leaned back in his arms and admired the advertisement she had planned. She sighed to herself, I’m so shameless.</p><br/><p>She took a glance at him, all learnt from him!</p>\n</div>"}