{"title": "Chapter 63 - The Unawareness of The Danger Behind", "id": 63, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-63-the-unawareness-of-the-danger-behind", "volume_title": "Volume 1", "body": "<h1>Chapter 63 - The Unawareness of The Danger Behind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In front of Lin Qian was a plan for an organizational restructuring of Aida.</p><br/><p>Since Li Zhicheng took over Aida, its internal equity distribution and organizational structure seemed to be confusing to outsiders. But Lin Qian knew to herself that this man was making bold moves; he had already revived Aida. The current Aida was nothing like what it used to be.</p><br/><p>However, until now, she had never seen Li Zhicheng’s clear layout for the future.</p><br/><p>In a few months, the company he mastered would be renamed “New Aida” with four sub-organizations under it; Vinda, Aito, Mind, and Aida (for now we’re calling it “Old Aida”). The first three covered the majority of his shareholdings; Old Aida only accounted for a small percentage. However, according to Lin Qian’s estimates, before the structural adjustment, he would gradually buy more shares to achieve complete ownership.</p><br/><p>Last night, when he proposed to her at the hotel, he revealed to her his top-secret plan.</p><br/><p>“Would you like to be its queen?” he asked.</p><br/><p>Lin Qian put down the plan, raised her hand and looked at the diamond ring on her ring finger.</p><br/><p>Gee, when a man showed his own business empire to a woman in order to propose marriage, it totally hit her in the sweet spot. For the first half of her life, she had waited for a powerful man who could impress her.</p><br/><p>Suddenly she thought of a poem — Gather your rosebuds while you may.</p><br/><p>In the past, she had never felt such beautiful emotions. Feelings of deep affection, which also stirred her soul.</p><br/><p>While Lin Qian’s endless thoughts filled her mind, someone knocked on the door. Lin Qian put the plan into the drawer and adjusted her posture, “Come in.”</p><br/><p>In walked one of her trusted staff members. He had great market planning experience. He sat down with a heavy look on his face, seeming to think for some time before opening his mouth, “Manager Lin, I have something to tell you.”</p><br/><p>His tone foreshadowed something bad, and Lin Qian could feel her heart sink a little. She creaked a smiled and said, “Sure, go ahead.”</p><br/><p>The young man was here to resign. He said it was because another opportunity had arisen, and he wanted to leave. Lin Qian instantly felt let down, the loss of outstanding talent was the last thing a manager wanted. However, she knew that since the employee was a very mature, career-oriented person, it must have been a carefully considered decision.</p><br/><p>She didn’t give him a hard time, but still tried her best to keep him. She asked him why he wasn’t happy with the company, trying to find the problem, and retain him. After all, Aida had been doing very well and their turnover rate had been rather low.</p><br/><p>The young man showed Lin Qian his admiration towards her, and he said frankly, “Manager Lin, don’t get me wrong, Aida is great, so is President Li, and you, always treat us well. My decision to resign was really based on career development considerations. I’d like to go to a company that suits me better. As to where, it’s really not convenient for me to disclose. I hope you can understand.”</p><br/><p>Lin Qian nodded, the young man had already secured a position before resigning.</p><br/><p>Destruction pursues the great. The rise of an excellent company would inevitably attract other companies to covet its staff. Having a outflow of talented people was also reasonable.</p><br/><p>She could only comfort herself, it probably had something to do with the recent and frequent spotlight on Aida. The victors also had the displeasure of being the winner! Now that the business was running smoothly, would she have to deal with with more management problems like this?</p><br/><p>Since the resigning employee’s mind was already determined, Lin Qian nodded. “Sure, I understand what you mean. Before leaving the company, please have a smooth transition during the job handover, and feel free to let me know if you still need anything. Of course, if any time you want to come back, you’re always welcome here. Keep in touch with your colleagues, maybe hang out together sometime.” She paused and looked at him straight in the eyes, softly, “I wish you well in your new position, and hope everything goes smoothly.”</p><br/><p>He was getting a little emotional, thanked her again and strongly nodding his head, finally he looked at her and said, “Manager Lin… I hope you and President Li are also doing great, and stay together forever.” He looked at her engagement ring on her finger.</p><br/><p>Lin Qian, “…Cheers.”</p><br/><p>After her employee left, Lin Qian turned the chair and looked at the tall buildings outside the window, feeling slightly awkward.</p><br/><p>The old saying was right. Walls have ears. In fact, she was also faintly aware that although Li Zhicheng hadn’t made it public, there must’ve been quite a lot of people in the company that had already known. After all, when it is between a male superior and a female subordinate, there could be all sorts of rumors.</p><br/><p>In that case, when Li Zhicheng put a ring on her, it was indeed the easiest and simplest way to protect her dignity as a woman. Women sometimes lose dignity because a man couldn’t step up and declare himself.</p><br/><p>She raised her hand again and looked at the ring in the sun.</p><br/><p>Haha … Lately he and she had been sailing smoothly, with great achievements in both their business and relationship, leaving others jealous.</p><br/><p>After work, Lin Qian drove to a tea house in the city.</p><br/><p>Li Zhicheng had arranged to meet with Ning Weikai there.</p><br/><p>During the peak of the rush-hour traffic, since Lin Qian was not a woman who stuck to conventions, she circumnavigated the path to the destination. It was a small world, and when she was passing through a remote intersection, she saw Ning Weikai’s car was stopped in front of a shopping center.</p><br/><p>A young girl she didn’t recognize came out of the passenger’s seat and headed towards the shopping center.</p><br/><p>Ning Weikai also got out of the car, still with his handsome and unobtrusive appearance, like a momentary frustration couldn’t impact him. He leaned against the door and looked at the girl with laughter. The girl took two steps ahead and turned back to look at him again, with endearment and familiarity.</p><br/><p>Then Ning Weikai said something again. The girl suddenly pretended to raise her bag and hit him, only there was a smile in her eyes.</p><br/><p>Ning Weikai was also smiling, faintly.</p><br/><p>Lin Qian immediately slowed down, and hid in an alley, to avoid facing him directly. After waiting for him to say goodbye to the girl and drive off, she started the car again and followed him at some distance.</p><br/><p>Li Zhicheng certainly wouldn’t bring Lin Qian to meet with Ning Weikai. She only followed him purely out of curiosity.</p><br/><p>After seeing her enter the teahouse, Jiang Yuan instantly came up to her.</p><br/><p>“They’ve already started,” he said with a smile. “Shall I take you to the private room to take some rest?”</p><br/><p>Lin Qian nodded. With her openly following all the way here, Li Zhicheng was also aware of it. But it was impossible to directly participate in their conversation, and she also felt it was unnecessary. So she just stayed back and waited for him.</p><br/><p>The environment on the second floor of the tea house was more elegant. The door to a private room was closely shut, only leaving the scent of tea and sound of music to be heard from the outside. Jiang Yuan took Lin Qian to one of the rooms and left, returning to the two bosses. Lin Qian looked at Li Zhicheng’s suit jacket on a tatami, and she lightly smiled. While sipping tea, she looked out at the grandeur of the teahouse courtyard and suddenly thought of what she had just seen earlier.</p><br/><p>Her mood was suddenly getting a little… complicated.</p><br/><p>Until today, perhaps Li Zhicheng and Ning Weikai were the men who had known the most about each other in this industry.</p><br/><p>But today, it was their first time sitting together and observing an opponent on their level.</p><br/><p>Li Zhicheng was acting as the host, so after asking Jiang Yuan to add some more tea, he faintly laughed and made a toast, “President Ning, after hearing so much about you, I finally get to meet you. I don’t drink, so I will salute you with tea.” After that, he tipped his head back, and finished the cup of tea.</p><br/><p>To be honest, when Ning Weikai was looking at the man in front of him, he felt Li Zhicheng was his type of man; broad-minded and subtle, neither arrogant nor deliberated.</p><br/><p>This kind of man was truly unfathomable.</p><br/><p>Ning Weikai also toasted and drank to it, cutting to the chase, “In fact, I have quite a few of Sha Ying’s shares, but the majority is still controlled by the Zhu family. I don’t understand why you wanted to see me. If it’s to facilitate cooperation between Sha Ying and Mind, I really wouldn’t be necessary.”</p><br/><p>Li Zhicheng nodded his head and asked, “What do you think about the future of this industry?”</p><br/><p>Ning Weikai was slightly stunned, smiling, “Traditional industries have been developing steadily, and they can’t cause too much of a stir. But…” he took a look at him, “with your involvement, confusing the old structure, everyone has been disturbed. It’s hard to predict the future.”</p><br/><p>His words were ironic and sentimental. Li Zhicheng was not angry to hear his opinion. He rested his hands on the armrests of the chair, slowly, asking, “What do you think about luggage companies entering into upstream fabric production? Is it a wise move?”</p><br/><p>Ning Weikai became quiet.</p><br/><p>Lin Qian had expected the men would be opposed to one another, and the conversation would become unpredictable, and possibly aggressive. As evening dimmed, the men shared a pot of tea, and a few plates of pastries. Their talk lasted more than an hour.</p><br/><p>Instead of bringing up the previous grudges, they only talked about the ups and downs of this industry.</p><br/><p>In the end, when they pushed the door open, they hadn’t even mentioned whether they would cooperate with each other in the future or whether to keep their previous hostility. In fact, communication between intelligent people sometimes didn’t need to be explained. Ning Weikai had already understood Li Zhicheng’s intention in calling for the meeting.</p><br/><p>He didn’t come for concrete cooperation, only to show his friendly attitude and initiative.</p><br/><p>Even though you are strong, I’m not weak. You are the only opponent I value in the industry. If we continue fighting to the finish, we’ll both be suffering, no good for anyone.</p><br/><p>If we have the opportunity to become allies, in the long run, it must be the best for each other and the development of the entire industry.</p><br/><p>Having reached this conclusion, our meeting was already very valuable. As for the specifics of cooperation, it depends on the fate of the future.</p><br/><p>He had to admit that Li Zhicheng was smarter than he had thought.</p><br/><p>Also more ambitious.</p><br/><p>Li Zhicheng walked Ning Weikai out of the private room, and when he saw he was away, he pushed open the door of the room nextdoor.</p><br/><p>Lin Qian was sitting by the window, holding her his chin with one hand, wondering about something. Seeing him come in, her eyes flashed, she smiled and asked, “How did it go?”</p><br/><p>Li Zhicheng sat down opposite to her and glanced over the ring between her fingers.</p><br/><p>“Not bad,” he smiled.</p><br/><p>Lin was slightly surprised, but also not that surprised.</p><br/><p>Li Zhicheng thought of the people “could have a great conversation with”, including President Kang from Ming Sheng, Wang Taishi, Lin Mochen. The list now included his great opponent, Ning Weikai.</p><br/><p>Lin Qian understood that he may join forces with Ning Weikai in the future to achieve a win-win situation, but she still couldn’t help but talk bad behind his back, “Ning Weikai could be a pickle.”</p><br/><p>Li Zhicheng looked at her and answered very plainly, “Am I an easy one then?”</p><br/><p>Lin Qian giggled, staring at his handsome eyes, and thinking of the same excellent Ning Weikai, she suddenly became a little sentimental.</p><br/><p>“Hey, others could be unloyal, but you can’t.” She reached out and held his face. “If you ever become unloyal to me, I’ll…”</p><br/><p>Li Zhicheng grabbed her hand and held it in his palm, intrigued, he asked, “You’ll what?”</p><br/><p>Lin Qian rolled her eyes, replying, “I’ll sell my share of Mind’s stock for only 1 dollar, so you can only watch and can’t do anything with it. I can piss you off, and whoever posts anything on the Internet to blame you for abandoning your wife, and calls you the name of the homewrecker, will get a free share of the stock from me.”</p><br/><p>Having said it so meanly, bossily and firmly, Li Zhicheng looked at her quietly.</p><br/><p>“This assumption can’t be established,” he said.</p><br/><p>Lin Qian felt it was sweet, but she soon heard him continue, “But you did remind me that if you’re with someone else in the future, I will definitely let that man go bankrupt, and never will he be able to turn it around. I’ll deal with it imperatively, and never show mercy.”</p><br/><p>Lin Qian, “…I’ll never change my heart!”</p><br/><p>Ning Weikai went to the corner of the second floor of the tea house. Instead of heading downstairs directly, he went to the bathroom.</p><br/><p>When he pushed through the door, having had walked a few steps, he suddenly heard a familiar voice behind him.</p><br/><p>He paused and turned his back to take a look. From afar, he could see Lin Qian was holding Li Zhicheng’s hand and as they walked from the end of the corridor. After two steps, Lin Qian suddenly stopped and said something. Then she looked up and kissed Li Zhicheng. Later Li Zhicheng simply pulled her into his arms, buckling her waist and stood silently under the lights, kissing.</p><br/><p>There was no one in the silent long hallway, only two people passionately kissing, and he was never spotted in the distance.</p><br/><p>Ning Weikai smiled, retrieving his gaze and stepped out of the building slowly.</p><br/><p>When he got in the car, he took out his cell phone habitually and looked at it; several missed calls, from his assistant Yuan Jun and others from Zhu Hanyu and Lydia.</p><br/><p>There were also two unread messages:</p><br/><p>One was from Zhu Hanyu. “Husband, are you coming home for dinner tonight? I’ve made rice-wine smoked salmon and seafood soup. Miss you.”</p><br/><p>The other was form Lydia, “Hey handsome, I just finished shopping. Are you still around, pr in a meeting? Are you free to be my driver and take me home? PS: I’m not telling you, but I also got something for you, have a guess.”</p><br/><p>Ning Weikai dropped his phone on the passenger seat, started the car, and drove expressionlessly.</p><br/><p>When he reached the fork in the road, he slowly turned the steering wheel, in the direction of his house, and called Lydia at the same time. Even before he started talking, a sense of happiness was found clear in his voice, “Miss, I’m busy tonight, please suit yourself.”</p><br/><p>Lydia grunted, with a snappy response, “I’m getting a cab by myself.” She paused, and said proudly, “I’m making my own super spicy fried bean paste noodles tonight. You can’t enjoy it.”</p><br/><p>Ning Weikai paused a little, he smiled and hung up.</p><br/><p>The changes were always happening at the most peaceful time.</p><br/><p>The gathering and separation were always inadvertently coming.</p><br/><p>When Lin Qian came home that evening, while Li Zhicheng was in the shower, she entered the study.</p><br/><p>Looking down at the ring on her hand, what was hers would always be hers. She had to let her brother know that his sister was engaged.</p><br/><p>He he… So excited just thinking about it.</p><br/><p>She called him up, it rang at least seven or eight times before he picked up, “Hello.”</p><br/><p>Lin Qian smiled and said, “Brother, are you up yet?” It should be morning in America.”</p><br/><p>Then, contrary to her expectations, he smiled indifferently and then said, “Do you mean nine at night? Sorry, I don’t get up at this time.”</p><br/><p>Shocked, Lin Qian looked at the clock on the wall. It was exactly nine.</p><br/><p>Huh?!</p><br/><p>“I’m also in Lin City,” he dropped the bombshell lightly.</p><br/><p>Lin Qian’s eyes widened instantly.</p><br/><p>At the same time, slowly he said, “Lin Qian, given that we are siblings, our identities and interests are very sensitive right now. In the short term, please do not contact me again. Bye.”</p><br/><p>With a light beep, the phone was hung up.</p><br/><p>Lin Qian was astounded, staring at the phone in her hand.</p><br/><p>However, no one knew her brother better than she did. Lin Qian quickly calmed down.</p><br/><p>Lin Mochen’s time was precious. There must’ve been a reason for him coming to Lin City at the moment.</p><br/><p>Couldn’t talk to her? Also said that the two parties’ identities are sensitive?</p><br/><p>Lin Qian pondered his words.</p><br/><p>His investment company didn’t only invest in equity fund bonds, but were also angel investors, injecting assets to entrepreneurs. In addition, mergers and acquisitions were made involving multinational companies.</p><br/><p>Aida wasn’t listed yet, and it wasn’t a start-up company. There is only one possibility.</p><br/><p>Lin Qian’s heart sank immediately.</p><br/><p>She was reluctant to believe, but the truth was right in front of her eyes. Her brother was actually… How could he…?</p><br/><p>Then the door of the study was pushed open. Li Zhicheng walked in after his shower and saw her clenched lower lip. He was slightly stunned, walked over and sat down, holding her directly in his lap, kissed her head and then stared at her with his dark eyes, quietly, he asked, “What are you thinking about?”</p><br/><p>Lin Qian was still a little distant, she looked up at him, “My brother came to Lin City.”</p><br/><p>Li Zhicheng was also a bit surprised.</p><br/><p>Lin Qian told him what he had just said over the phone.</p><br/><p>His eyes became deep and hard to see through.</p><br/><p>Lin Qian looked at his eyes and slowly said, “His call suggested to me that a multinational company has commissioned his company to launch a hostile takeover against us.”</p><br/><p>She paused and said, “Not just us. According to the scale of their previous cross-border acquisitions, it’s likely to be the top few companies in the Chinese industry are to be part of… this acquisition.”</p>\n</div>"}