{"title": "Chapter 74 - A Father-Son Talk", "id": 74, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-74-a-father-son-talk", "volume_title": "Volume 1", "body": "<h1>Chapter 74 - A Father-Son Talk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The hospital room was located at the farthest end of the floor, secluded and open.</p><br/><p>Lin Qian, standing outside the door, unintentionally overheard the conversation between father and son; most of it at least.</p><br/><p>As their voices stopped, she saw the door open. Her heart was full of gentleness when Li Zhicheng looked up as he walked out. But at the same time, it was as though there was a pebble rolling amongst the gentleness of her heart, making her feel uncomfortable.</p><br/><p>It was because of the two things Xu Yong had said.</p><br/><p>“Must you marry Lin Qian?” and “From my point of view, I think that you two are not suitable.”</p><br/><p>Li Zhicheng calmly looked at her.</p><br/><p>He had rushed over right after he landed. Perhaps because of the long journey, his suit and shirt were a little rumpled, and the tiredness still lingered on his brow. But the gaze he gave her, was both clear and calm. As though he had instantaneously read her emotions, he extended his hand, grabbing and caressing one of hers.</p><br/><p>“When did you arrive?”</p><br/><p>Lin Qian honestly answered, “I’ve been here for a while.”</p><br/><p>Li Zhicheng nodded his head.</p><br/><p>“Can I go in to see him?” she asked.</p><br/><p>Li Zhicheng’s hand had not let hers go when he turned to look at the small glass window on the door of the patient’s room. He saw Xu Yong with his eyes closed, the bedlight dimmed, seemingly sound asleep. He said, “He just took his medication, and we talked for a while so he’s probably tired now. We will come again first thing in the morning.”</p><br/><p>“Okay.”</p><br/><p>Compared to their usual reunion excitement and chattiness, Lin Qian was comparatively quieter. Li Zhicheng looked at her fine lips and black eyes. He said no more and held her hand as they walked off.</p><br/><p>The sky was pitch black by then; the bright lights shining on the white pavement contrasted the darkness of the night.</p><br/><p>The two of them were in the intensive care ward. Very few people were there, only the lamps above their heads lit their way, casting fleeting shadows.</p><br/><p>Lin Qian looked at his tall cool silhouette and suddenly felt a little dimwitted.</p><br/><p>How she wished that the two of them could keep holding hands like this.</p><br/><p>“Do you feel wronged?” he asked.</p><br/><p>He suddenly stopped in his tracks, turning to look at her.</p><br/><p>Under the light, his face was handsome and mesmerising as usual. His dark eyebrows had a bit of luster, his high cheekbones gave his facial contour a bit of a wild look. One of his hands was still in his pocket, when another wrapped around her waist as he quietly lowered his head and gazed at her.</p><br/><p>Silent, dominant, but gentle.</p><br/><p>Lin Qian wrapped her arms around his neck.</p><br/><p>“Hmm…” she whispered, “A little. However, compared to someone who went through hell with my brother, this is nothing.”</p><br/><p>Their eyes met, and in his eyes you could slowly see a smile.</p><br/><p>Lin Qian looked at him but felt something off.</p><br/><p>Actually her being wronged wasn’t because of Xu Yong. On the contrary, if she was standing on Xu Yong’s side, she could clearly understand that as a father and a businessman, there were these deliberations and concerns. Also, when Li Zhicheng indicated his stance, Xu Yong immediately accepted.</p><br/><p>But she still felt a little wronged. Because her true self, her brother’s true self, the honest, trustworthy versions of themselves, were not seen by others. And in the current situation, she had no way of proving her innocence, no way to prove she was “a woman worthy of Li Zhicheng.” This was objectively so, because her brother’s and her identity and status were thus unchangeable.</p><br/><p>“What kind of woman would be suitable for you?” She suddenly asked.</p><br/><p>She was just being difficult.</p><br/><p>Li Zhicheng gave her a look.</p><br/><p>He lowered his head and took her lips passionately, tasting them. Lin Qian’s view was consumed by his entire figure, her body too was encircled by him at a corner of the corridor. Amidst the steaminess, she heard him whisper in her ear saying, ” Do you want me to give you my heart?”</p><br/><p>Lin Qian giggled.</p><br/><p>Truly, just now seeing him being in front of his father, his rigid mannerisms were enough for her.</p><br/><p>“There is no need for weigh the pros and cons. I must marry her.”</p><br/><p>“If I get DG out of the China market, who dares speak a word against me?”</p><br/><p>Lin Qian looked up at him.</p><br/><p>Love was a religion. She submitted to the man in front of her.</p><br/><p>And he, using his own unique, decisive methods, was protecting their love.</p><br/><p>“I love you.” she whispered.</p><br/><p>Li Zhicheng bent down to kiss her again.</p><br/><p>Maybe it was because they had been apart for a few days, plus the longing they had for each other before, it was hard for this kiss to end. In the silent hospital hallway, he held her in his embrace, kissing her mouth, eyes, nose, ears…time was forgotten and they were not satisfied enough to stop.</p><br/><p>Gao Lang and Jiang Yuan had just walked up to the fourth floor, when they saw the familiar silhouette of the president, pushing a woman against the wall, silently but passionately kissing her.</p><br/><p>That woman without a doubt was Lin Qian.</p><br/><p>This President Li was so different from the one they knew. And it was only in front of Lin Qian, that President Li would reveal such a willful side of himself.</p><br/><p>Gao Lang and Jiang Yuan were both struck speechless. Jiang Yuan was still fine, nothing seemed particularly unusual. Gao Lang however acted like a young boy, actually turning his head shyly away.</p><br/><p>“Ahem…” Jiang Yuan faked a cough.</p><br/><p>Li Zhicheng had his back towards them. Upon hearing the cough he lifted his head, and at the same time let go of Lin Qian slightly. He was still holding her in his arms. Perhaps because he had been kissing too long and was out of breath, his cheeks were slightly red, but his mannerisms were still silent and stern as he turned to face them. Lin Qian on the other hand was embarrassed for being caught in the act by others. She lowered her head, acting indifferent.</p><br/><p>“President.” Jiang Yuan started speaking as he normally did, “There are reporters at the front door, as well as a few unfamiliar people, who seem to be looking to stir up trouble.” Pausing for a while, he continued, “They are riling up a group of people, raising up banners and slogans, saying that we Aida were scheming with foreign investors and betrayed the local brands.””</p><br/><p>Li Zhicheng remain unfazed, however, Lin Qian was shocked.</p><br/><p>They had come too quickly.</p>\n</div>"}