{"title": "Chapter 78 - Western Style", "id": 78, "volume": 1, "url": "http://boxnovel.org/our-glamorous-time-chapter-78-western-style", "volume_title": "Volume 1", "body": "<h1>Chapter 78 - Western Style</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Sunshine sprayed through the meeting room. Lin Qian turned off her laptop and stood up, tired but pleased.</p><br/><p>She wasn’t the only one that was tired; the young people all had red eyes, together with messy shirts and hair. However, their eyes were all sparkling like the shiniest stars. Tthe brand “Glamorous” was the brightest star in the bag industry.</p><br/><p>It had been five days since the first series of advertisements were released. Sales were surging like that of Vinda and Aito, and naturally, there was excessive work behind this glorious moment. Lin Qian wasn’t even sure whether she had slept more than ten hours in the past few days, combined. She felt faint, but she was also filled with thrill and exhilaration, which helped her sit through the sales meeting in the morning.</p><br/><p>She could finally pause and rest for a while.</p><br/><p>These people were all from Aida, lots of whom were her close colleagues and subordinates, so there was no need for her to grandstand. She breathed deeply and said, “Success is within reach and we’ve made history. The sales numbers will continue to surge even if we relax slightly. I’m giving you all a day off today and we’ll start preparing for the second-phase of promotion tomorrow!”</p><br/><p>Everyone grinned and said, “Sure!”</p><br/><p>Her secretary stood up and said with concern in her voice, “Ms. Lin, go to sleep soon.” Before Lin Qian could answer, people around her echoed, “Go to sleep soon!””You can’t continue working!””We won’t be happy if you continue working.”</p><br/><p>Lin Qian felt warmth in her heart because she knew that she had reached her limit. She told herself secretly that this would be the last time. She raised her head and smiled, “I’ll go soon. You’ve all put in such hard work. See you tomorrow!”</p><br/><p>Lin Qian had put a single bed in the inner room of her office and made it her temporary home, as she was working day and night for the past few weeks. After seeing everyone leave for home, she went directly into her inner room and laid on the bed.</p><br/><p>People experienced at working all-night knew that they wouldn’t be able to sleep soundly when they first touched the pillow. Instead, they would toss and turn for a time. Naturally, Lin Qian thought of Li Zhicheng. She took out her phone and wanted to text him, but realized that she didn’t know what to say.</p><br/><p>All she wanted to say was in that ad. He must be able to understand it.</p><br/><p>Glamorous, glamorous just for you! She adored him, and her yearning for him was beyond words.</p><br/><p>She gradually fell into sleep in a gentle but complex mood. She was so deeply asleep that she didn’t notice anything that was happening around her, not the door opening and closing, nor change of light.</p><br/><p>Though Lin Qian’s new company used an aggressive and international ad that said “Lin City, Taiwan, Florence”, she knew that it was only a small company. Aida was temporarily fully responsible for manufacturing and cost thereof. There were only dozens of people in this new company.</p><br/><p>As for Taiwan and Florence?. There was only one person each. She borrowed two part-timer employees from Wang Taishi and David, and the products were sold in their stores.</p><br/><p>She had her own version of thirty-six stratagems.</p><br/><p>And this was…</p><br/><p>Opening a dyehouse with some colors.</p><br/><p>Lin Qian was sleeping in the inner room, but there were still nearly a dozen staff in the open office. There were still many aspects of the business to keep an eye on. The office was quiet and only the sound of typing and occasional whispers could be heard.</p><br/><p>That was, until Li Zhicheng arrived.</p><br/><p>He walked into the office dressed casually, followed by Jiang Yuan with a smile on his face. Everyone, from the person sitting at the counter, to an experienced manager, stood up with a thrill. They were so amazed that they almost dropped their jaws. It was well beyond their expectations, and they were extremely flattered.</p><br/><p>“Mr. Li!””Mr. Li!””Mr. Li!” Everyone greeted him courteously and was secretly excited.</p><br/><p>Li Zhicheng nodded at them, put his hand on a partition and looked around. It was neatly and elegantly designed but different from his taste. There were lots of red line patterns on the ceiling and the glass door, making it look like a war room.</p><br/><p>This is her ideal office.</p><br/><p>Li Zhicheng smiled and said to everyone, “You’ve done a great job.”</p><br/><p>“Thank you, Mr. Li,” everyone responded.</p><br/><p>Li Zhicheng nodded and asked, “Where’s Lin Qian?”</p><br/><p>The secretary was a bit embarrassed, but answered honestly, “Ms. Lin is sleeping in her office.” She pointed at her office and went on, “She hasn’t slept in days.”</p><br/><p>Li Zhicheng followed her finger with his eyes. He gazed at the closed beige door, which had her name tag on it: General Manager Lin Qian.</p><br/><p>“Give me the keys,” said Li Zhicheng.</p><br/><p>Her secretary was dazed. Jiang Yuan stood quietly without looking sideways and pretended that he didn’t hear anything. All the other people in the office were hushed.</p><br/><p>Although “Glamorous” Company was still connected to Aida in lots of way, it was completely independent in terms of equity. It was really awkward that Li Zhicheng entered the general manager’s office without invitation, even though he was the CEO of Aida Corporation. Besides, some of the people in the office knew the rumor of Li Zhicheng and Lin Qian. Though it was just hearsay and never confirmed, and neither of them had said a word about it. Now, Mr. Li wanted to enter a room where a woman was sleeping, right in front of everyone.</p><br/><p>Only Jiang Yuan knew Li Zhicheng’s desire to see the woman inside. Only because of his deep desire to see her would he squeeze a day out of his tight schedule and fly to Wuhan for her just before launching the counter-attack. Jiang Yuan hinted at the experienced manager beside the secretary with a look. That manager had worked for Aida long enough to know what he meant. He grabbed the keys from the hesitant secretary and gave them to Li Zhicheng, “Mr. Li, Ms. Lin will be thrilled to know you’ve come here for inspection.”</p><br/><p>These were tactful words. Everyone, except the secretary who was still blushing and fighting, realized what he meant. They echoed calmly, “Yes! We’re exhilarated that Mr. Li is here!” Li Zhicheng took the keys and nodded his head, “Go back to work.”</p><br/><p>He walked straight to Lin Qian’s office, put the key in the lock and opened the door. The door closed after hearing a “clack” sound.</p><br/><p>People in the office stood gazing at each other. Jiang Yuan found an empty seat and sit down. He tapped the secretary’s desk and asked, “Could you get me a glass of water, if there is any? Thanks.”</p><br/><p>“OK.” The secretary answered and left to get the water. With the sound of her receding footsteps, peace and business were restored in the office. The difference was, there were traces of smiles on everyone’s face, either obvious or obscure. They were touched even though they had nothing to do with it. It wasn’t the CEO of a corporation coming to visit his previous subordinate. It was a man coming to see a woman. Simple but captivating. It was love.</p><br/><p>Li Zhicheng saw the room spilled with soft light when he opened the door.</p><br/><p>The curtain wasn’t drawn. Clear and neat sun rays were cast upon the woman’s body through the glass window.</p><br/><p>She was wearing her shirt and suit pants without a quilt covering her. Her long hair spread on the pillow like a waterfall. Her oval face was still smooth and milky like a piece of white jade, only now her eyes were enclosed with two dark circles. She looked peaceful and didn’t realize when he approached her bed.</p><br/><p>Li Zhicheng gazed at her silently for a while and smiled. He turned, walked to the windows and drew the curtains. The room became dark, and he walked back to her.</p><br/><p>It was a tiny bed at the corner of the room and there was no space to sit on. He resorted to grabbing a chair.</p><br/><p>Minute after another, time went by while the room remained silent. Li Zhicheng took one of her hands and gave it a kiss.</p><br/><p>Lin Qian had an erotic and romantic dream. She dreamed of Li Zhicheng coming to Wuhan and her office, which was apparently impossible because in the dream, her office became a hotel room and that small bed became a king-sized bed, where Li Zhicheng was pressing her down and made love to her over and over again.</p><br/><p>It was at dusk and the room was dark and quiet. He lowered his head and brushed her forehead, her cheeks, her neck and her lips. Those kisses were like a dragonfly skimming the surface of the water, and were completely out of character. That was why she knew that was a dream because it was impossible for him to kiss her so reservedly. In the past, he wouldn’t stop until he took her breath away. They continued to her breasts, her waist and her ankles. The dream was so real that she actually felt itchy in these places, as if she could actually feel his cool, soft lips and the calluses on his fingers.</p><br/><p>Lin Qian curved up the corner of her lips and smiled in her dream. “I’m sorry,” she murmured.</p><br/><p>Why would she say she’s sorry? Tears dropped when she said that. She really missed him. How could she miss him so much?</p><br/><p>For the past few days, they had barely contacted each other, and hadn’t met each other for three months. Why were they so distant with each other? It was inexplicable for Lin Qian. Maybe after saying words like “I’ll stand in front of everyone”, she felt pressured. She was afraid that she wouldn’t be good enough. It wasn’t easy to build a brand. She was afraid to lose, to lose in front of Li Zhicheng. That’s why subconsciously, she avoided being in touch with him.</p><br/><p>Or maybe, she was in a fit of pique. How could they misunderstand her like that? She had to make a career of her own and amaze all of them. With that in mind, the brand was the only thing she cared about, and even Li Zhicheng couldn’t rival that.</p><br/><p>She was even afraid of contacting him because she feared that it might distract him. She feared that once she went back to him, she would be trapped in that sweet and tender romance and get attached, which would strip her of her resoluteness.</p><br/><p>Sorry. I actually really miss you.</p><br/><p>After saying that, she felt relieved. Li Zhicheng in her dream went back to his usual and started to kiss her more enthusiastically. Lin Qian was elated, after which she fell into a deeper sleep, and the dream was gone.</p><br/><p>She awoke and saw darkness overflow her office. It was the evening already? She’d slept for such a long time? She took her cell phone and turned it on. It was about six o’clock in the evening already.</p><br/><p>She rubbed her head and sat up when she realized that there was a black and large male coat covering most of her body. Lin Qian was stupefied. She jumped off her bed and turned on the light instantly. Nobody but her was inside, and that coat was still lying on the bed.</p><br/><p>Lin Qian opened the door and rushed out. She stood still and looked around. It was also very dark outside, where there were still a few staff working overtime. They all looked up at her hearing the sound. Their look was a mixture, kind of like a twinkle but also a bit like embarrassment.</p><br/><p>Lin Qian’s face blushed, but she still needed to be refined in front of her subordinates. She said to her secretary at the door calmly, “Come in.”</p><br/><p>The secretary was on tenterhooks seeing her awake. She immediately followed her inside, closed the door and gave her a look, which was more eccentric than others’.</p><br/><p>“Anyone here just now?” asked Lin Qian.</p><br/><p>“Don’t you know it? Have you been asleep the whole time?” The secretary was a bit surprised.</p><br/><p>Lin Qian dismayed hearing that, because she felt like she’d missed a lot. She shook her head. The secretary flushed and said, “Mr. Li from Aida was here this morning. You were sleeping then so he grabbed the keys and opened your door and didn’t leave until the afternoon. He urged me not to wake you up before leaving.”</p><br/><p>Lin Qian’s heart skipped a beat. Emotions flooded her mind; sweetness, gloom, nostalgia, empathy and lingering. Eventually, there was only one thought left; that she wanted to see him and so much.</p><br/><p>“When did he leave?” she asked hurriedly and started to put on the coat on the chair. The secretary also became tense seeing her frantic. She answered swiftly, “Five twenty. It’s been more than an hour.”</p><br/><p>“Did he say where he’d go?”</p><br/><p>“I didn’t dare to ask…”</p><br/><p>Lin Qian nodded her head and said, “I’ll go out first. Just go home if there aren’t more issues.” Just when she was about to leave, the secretary pulled her back and told her awkwardly, “Ms. Lin, look there.” She pointed her fingers at her neck.</p><br/><p>Lin Qian was dazed.</p><br/><p>It couldn’t be…</p><br/><p>She gave a brief look to the secretary while remaining calm. She picked up her mirror on the desk next to her. Her neck was slender and white, where there were hickeys everywhere, red and fresh. Both Lin Qian and her secretary were rendered speechless. If other people in the building saw her rushing out like this, she wouldn’t be able to stay there ever again.</p><br/><p>Why would Li Zhicheng kiss her at such obvious spots? Her jaw, her neck and her clavicle. Not only did he kiss her, he left hickeys there deliberately. Lin Qian was lost for words. Now she was obviously tagged by a man.</p><br/><p>Was it a punishment for her not returning home for a long time?</p><br/><p>Lin Qian turned crimson and dry coughed, “Any scarves?” The secretary said, “Yes.” She rushed out and gave her one that she found in her drawer. They arranged the scarf to make sure that it covered all the marks, after which the secretary said, “Ms. Lin. You can go chase him now.”</p><br/><p>It was completely dark outside when Lin Qian stepped out of the building. There was hustle and bustle on the street, where Lin Zhicheng was nowhere to be found.</p><br/><p>The line was connected then, after hearing “beep”, she heard Li Zhicheng’s melodious baritone, “Awake now?” That voice was like a mild wind placating her heart.</p><br/><p>She stood at the clamorous street and couldn’t resist laughing, “Why didn’t you wake me up?” As a strong career woman who’d been separated from him for so long, she could adapt to her feminine side. She sounded soft and clingy. Apparently, she was being affectionate.</p><br/><p>Li Zhicheng stayed silent for a few seconds.</p><br/><p>On the other side of the call, there was a clear voice in the airport, “The CAXXX flight to Lin City you’re taking is about to take off…”</p><br/><p>“How could I?” he said slowly.</p><br/><p>Lin Qian’s heart was racing. She breathed deeply.</p><br/><p>He, as a CEO who dealt with a whole host of problems every day, came to Wuhan to visit her from afar, only to discover all he could do was to sit beside the bed for the entire day?</p><br/><p>Her nose twitched. “Darn you…” She murmured.</p><br/><p>“OK,” there was amusement in his voice, “now that your brand has become public, come home whenever you want to.” Lin Qian bit her lower lip while the corner of her lip couldn’t resist curving up.</p><br/><p>Even though this man wants me back so dearly, he is still talking so calmly. Letting the enemies off to catch him later was the worst in the world.</p><br/><p>“Um. There are still a few issues I need to take care of. I’ll come back once I finish them.”</p><br/><p>“Sure,” he answered, “you’ve made a good start, and now it’s my turn.”</p><br/><p>Chen Zheng and Charles had come across some thorny problems recently. A website specializing in procurement services came into being, and its fame was surging. It should not have been a big deal. Overseas procurement of famous brands had always existed. There was a plethora of individual businesses on Taobao and Jingdong.</p><br/><p>What was the specific process?</p><br/><p>Lots of international brands were cheaper in western countries than in China and some people were taking advantage of it by buying products overseas and reselling them to customers in China. The price would still be significantly lower than that of domestic shops, even after taking international mailing fees into account. However, the scale of this business was always confined, and the wouldn’t have any substantive effects on corporations like DG.</p><br/><p>Why not?</p><br/><p>First of all, corporations were not allowed to be involved in such businesses. It was concerned with the issue of tariff and agency. How could a corporation without agency rights import multitudinous products from abroad and disturb the market? For that reason, it was always individual business owners who led in this business. Several or dozens of famous-brand bags were nothing.</p><br/><p>Also, customers were capable of distinguishing between genuine products and the counterfeits. Knock-offs made by Chinese looked less genuine than the official ones, so credibility was also a big issue faced by the individual businesses.</p><br/><p>But now, everything had changed. The procurement store named “Western Style” had caught a great amount of attention ever since it was launched. It was still an online shopping platform like Taobao and those selling foreign brands were still individual business owners. However, on the most visible place of the website, one could see a line of promise, “We will refund ten times your purchase price if you discover a counterfeit.”</p><br/><p>All customers would be attracted by such promise, because their biggest fear was relieved. And if you scrolled down, you would notice that most of the products the website sold were ZAMON!</p><br/><p>On an afternoon that weekend, Charles held an emergency meeting with all the executives of DG China, including Chen Zheng. It was a languid afternoon with warm sunshine, but inside the meeting room only tenseness was seen. The marketing department provided the latest statistics; in the past two weeks, sales in each ZAMON flagship store had plummeted by ten percent, which was something that never happened for DG. Those stores had been booming in the past six months. What was worse, lots of customers returned to the stores and asked for either returns or a price difference payback. On the website of DG China, there were abundant posts and comments lodging customers’ protests.</p><br/><p>It wasn’t a good trend. Charles acutely sensed the greater crisis behind this, and that was why he summoned all his most senior advisors to come up with countermeasures. In the spacious meeting room, everyone was holding their breath and looking to the marketing manager, who opened the “Western Style” website.</p><br/><p>Pictures of ZAMON bags were first in their sights, and at the bottom of each picture, there was a discounted price beside the crossed-off original price. Each product had sufficient inventory.</p><br/><p>The original prices that were crossed off were exactly the retail prices of ZAMON China. Discounted prices were generally ten-to-thirty percent lower, and some were even seventy-to-eighty percent lower. This wasn’t something unheard of, because in foreign ZAMON stores, there were sometimes large-scale sales promotion of all the luxurious brands.</p><br/><p>Charles kept sweating while scrolling down the website. He suddenly recalled that when he saw ZAMON America experience a moderate increase in sales, he thought it was what Chinese described as “good sign”. Shoot!</p><br/><p>He was also confused and furious, and yelled at the manager, “Is it legal to run a website like this? Overseas procurement dodges Chinese tariffs! It is unfair competition!” Everyone there had the same question. However, the manager shook his head and said, “No, Charles. This website was delicately designed. It only offered a platform just like Jingdong and Taobao and there’re only individual businesses selling ZAMON products, which makes it individual reselling only. That means it has nothing to do with the website. No laws will prohibit it.”</p><br/><p>“Conspiracy! It’s a total conspiracy!” Charles stood up spitefully, and started to wander in the meeting room.</p><br/><p>Everyone can see that it is a conspiracy, Chen Zheng thought to himself sitting beside Charles’ seat.</p><br/><p>Individual stores could never have enough funds to store such large volumes of products. The so-called shopping platform was nothing more than a hoax, and the person behind this broke up the whole into parts and evaded the policy restraints successfully.</p><br/><p>This was directly against ZAMON.</p><br/><p>Who else could it be other than Li Zhicheng who had been temporarily in torpor.</p><br/><p>The scariest thing about this website wasn’t how many ZAMON products were sold. That wouldn’t account for a single-digit percent of DG sales. What mattered was that it told customers that a luxurious bag sold for five thousand yuan domestically only cost 2000 yuan in America. How could the customers not be irritated? Wasn’t this deceiving? With such thoughts in mind, they would wonder whether ZAMON was indeed a top-tier brand, or not.</p><br/><p>When the price system of a luxurious brand was questioned, so was the entire brand. If this couldn’t be stopped, the image ZAMON had fought so hard to build in China would collapse completely.</p><br/><p>But now, Chen Zheng, sitting among a group of foreigners and seeing Charles losing his temper continuously while others discussing in English of different accents, a perplexing feeling struck him.</p><br/><p>First off, unlike the last couple of times when he was devastated by SMQ’s defeat, he couldn’t empathize witnessing ZAMON’s great crisis. On the other hand, he did feel great pressure. He had a feeling of déjà vu as how ZAMON was being defeated was exactly how he was defeated by Li Zhicheng, twice. It was impossible to guard yourself and you would never know what his next step was. You could only know one thing for sure; when he started to fight back, you would only see yourself falling, step by step. No matter how bitter you were, you could never escape the circle of horror.</p><br/><p>Chen Zheng didn’t give away such feelings. After hearing the discussion, he said with the same fury as others, “Charles, what should we do?”</p><br/><p>Charles said sternly, “Go check who the owner of this website is! Li Zhicheng and Ning Weikai must be behind all of this! I’ll sue them!”</p><br/><p>It was a rather easy job to do. Every company had its legal department, including the online shopping platform. A few day later, Charles and Chen Zheng knew the owner — Gu Yanzhi.</p><br/><p>It was as they had expected.</p><br/><p>“Boss, we won’t stand a chance,” personnel from the legal apartment said awkwardly. “Even though Gu Yanzhi was a shareholder and a senior of Aida, he sold all his Aida shares to us several months ago, thus he has nothing to do with Aida now, which makes his action completely personal. We can’t sue Aida for unfair competition without evidence and we can’t sue Gu Yanzhi, because based on the agreement on the website, he’s only providing an open platform for online shopping.”</p>\n</div>"}