{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2</p><br/><p>Useless spirit with innate full spirit power</p><br/><p>Part 1</p><br/><p>Old Jack obviously answered Tang San with great patience. In his heart, the village’s most intelligent child was none other than this Tang San. It was truly difficult to imagine that such a father could have as clever a son as this.</p><br/><p>\"Spirit Grandmaster is a Spirit Master rank. Spirit Master is the noblest vocation on our Douluo continent: they can be formidable champions, they can possess remarkable assisting ability. But no matter which kind of spirit master, all are sorted and accorded titles.\"</p><br/><p>\"Spirit Masters all possess their own spirit power. Based on spirit power intensity, these are subdivided into ten general titles. Each title is further subdivided into ten ranks. At first after only crossing the threshold, one is called Spirit Scholar. As soon as a spirit awakens, everyone is a spirit scholar. In the event that the spirit is capable of cultivation, when the spirit power reaches the eleventh rank, one can enter the next title, which in that case is Spirit Master. And Spirit Grandmaster, it is the third in this sequence of titles. Having reached the Spirit Grandmaster realm, one already is a fairly famed Spirit Master. There are a total of ten like this.”</p><br/><p>\"Spirit Scholar, Spirit Master, Spirit Grandmaster, Spirit Elder, Spirit Ancestor, Spirit King, Spirit Emperor, Spirit Sage, Spirit Douluo and Title Douluo[1]. This is precisely where our Douluo Continent’s name comes from. It is said that when attaining the power of a ninetieth ranked Title Douluo, one can take a title for oneself. They are simply unparallelled existences, ah!\"</p><br/><p>His eyes shone with proud radiance,</p><br/><p>\"A hundred years ago our Holy Spirit village produced an eighth ranked Spirit Sage, ah. In all of Nuoding city, even in the whole Fasinuo region, this is extremely rare.\"</p><br/><p>To the side Tang Hao curled his lip,</p><br/><p>\"Old Jack, that’s just a legend, nothing more.\"</p><br/><p>Intentionally rubbed the wrong way, Old Jack became indignant,</p><br/><p>“What are you calling a legend? This legend comes from fact. Tang Hao, it’s already been six years since you came to the village, you ought to realize that the Spirit Sage is part of our history. If you let me hear you insult the lord Spirit Sage again, I will banish you from the village. Were it not for little San, you think I would want to come to your doghouse, huh?”</p><br/><p>Tang Hao wasn’t angry, still pounding on the farming tool in his hand, still looking as if he hadn’t heard Jack’s words.</p><br/><p>Jack resolutely glared at him, and facing Tang San, said:</p><br/><p>“You mustn’t take after such a dispirited father in the future. Alright, I’ll leave first, and in three days, I will come get you.”</p><br/><p>Having finished talking, Old Jack left the smithy in spitting anger.</p><br/><p>“Dad.”</p><br/><p>Tang San called out.</p><br/><p>“Ng?”</p><br/><p>Tang Hao coldly shot a glance at him. Catching sight of the chill in his father’s eyes, Tang San could only swallow back his words. He returned to his room with a drooping head to continue striving for ten thousand swings.</p><br/><p>At nightfall, after eating dinner, Tang Hao wiped his mouth and was about to leave as usual; that is to say, this was routine; going out to drink and drinking the cheapest ale.</p><br/><p>“Dad. Wait a moment.”</p><br/><p>Tang San, without time to clear away dishes, first called out to stop Tang Hao.</p><br/><p>“What?”</p><br/><p>Tang Hao impatiently glared at him. Even though Tang Hao had never hit Tang San, for some reason, Tang San innately held some fear towards this father. For this person of two lifetimes, he was unable to change this feeling.</p><br/><p>“Those ten thousand blows, I have completed forging them.”</p><br/><p>Tang San said.</p><br/><p>“Oh?”</p><br/><p>The look in Tang Hao’s eyes was brilliant, as if it had some lustre.</p><br/><p>“Fetch it for me to have a look.”</p><br/><p>“Alright.”</p><br/><p>Tang San sprinted back to his room. Very quickly, he came running out holding a chunk of iron in his hands.</p><br/><p>The entire iron chunk was pitch black, and though irregular in shape, each facet appeared extremely brilliant, a black light dimly visible within. The entire iron chunk was approximately one fourth the size of the original, and when Tang San used Mysterious Heaven skill to hold it he didn’t feel strained by any means.</p><br/><p>Tang Hao took the pitch black iron chunk into his hands, raising it before his eyes to carefully study it,</p><br/><p>“Do you now understand what I said?”</p><br/><p>Tang San nodded,</p><br/><p>“When tempered into steel, metal of once insufficient quality is refined through continuous forging, it changes into high grade. Dad, did you want to tell me this principle?”</p><br/><p>Tang Hao realized that these days, his son caused him quite a bit of astonishment. Returning the iron chunk to him, he said:</p><br/><p>“Then continue. When you have completed forging it to the size of a fist, bring it to me again.”</p><br/><p>Done speaking, he turned around and walked out of the house.</p><br/><p>According to what he originally said, after forging that iron lump ten thousand times he would teach Tang San forging, but now he seemed to have gone back on his promise. But Tang San didn’t take this to heart, he only thought of Tang Hao’s words.</p><br/><p>“Fist size?”</p><br/><p>This big iron lump, could it really be forged to the size of a fist? Despite only being a quarter of the original volume, Tang San was still very clear that along with continuous forging, as the iron lump was becoming more and more concentrated, reducing volume also become even more difficult. Thinking about forging it to only fist size, it absolutely couldn’t be accomplished with another ten thousand blows.</p><br/><p>After being tempered into steel, what would it become after another ten thousand blows? Glittering radiance flashed through Tang San’s eyes, and he staggered slightly as he dexterously entered his room. Very soon, ting ting dong dong hammering noises, once more rose from the smithy.</p><br/><p>Three days passed very quickly, Tang San still went to the hilltop in the early morning to do his routine exercise every day, and returned home afterward. In addition to cooking, he was also forging, testing his strength against that piece of pig iron. Every day the tempo of the beats increased. Mysterious Heaven Skill helped him recover physical strength quickly, so that he could especially maintain this continuous forging process.</p><br/><p>“Little San, grandpa has come to get you.”</p><br/><p>Old Jack punctually came to the smithy, this time he didn’t even go inside, only calling Tang San from the outside.</p><br/><p>Tang San glanced at his father by his side who just now had eaten. Tang Hao indifferently said:</p><br/><p>“Go. Don’t delay midday cooking.”</p><br/><p>Part 2</p><br/><p>Tang San promised to be back soon, then left the smithy.</p><br/><p>With old Jack leading, Tang San followed him to the Spirit Hall in the middle of the village. Naturally, this so-called Spirit Hall was merely a large log cabin, nothing more.</p><br/><p>Because everyone had spirits, every year would have children undergoing spirit awakening. Therefore, Spirit Halls could be found everywhere on the Continent. Naturally, these were all only subsidiary halls, there was a distinct hierarchy.</p><br/><p>The village children didn’t have a very good opinion of Tang San. To favor the rich and disdain the poor is an ability not only among nobles, among common people the circumstances are instead even more distinct. With Tang San originally being a reincarnated person and his real age having long ago exceeded 30, naturally he was also unwilling to come into contact with these children. To him, spare time was better spent on cultivation, consequently, he of course never had a childhood playmate.</p><br/><p>In addition to village elder Jack and eight children present, there was also one youth in the Spirit Hall. This person appeared to be just over 20 years old, dashing eyebrows slanting above starry eyes, his facial features extremely bright and handsome. He was dressed completely in brilliant white clothes, a black cloak on his back, and right on the center of his chest, above his heart, was a palm sized ‘spirit’ character. This was standard attire for staff directly subordinate to Spirit Hall.</p><br/><p>On the left side of the chest was a carved badge with three crossed long swords. It seemed like Jack knew this kind of Spirit Master well; three in quantity represented a Spirit Master of third degree, titled Spirit Grandmaster, and the long swords represented this Spirit Hall attendant was a Battle Spirit Master.</p><br/><p>“Greetings, esteemed Battle Spirit Grandmaster, this time we will inconvenience you.”</p><br/><p>Old Jack respectfully bowed to the youngster.</p><br/><p>The centre of the youngsters forehead betrayed an indifferent arrogance. Indifferently bowing slightly, he at last returned the greeting,</p><br/><p>“My time is scarce, let’s begin.”</p><br/><p>Old Jack said:</p><br/><p>“Very well. Children, this is a Battle Spirit Grandmaster from Nuoding City. Next, he will guide you to open yourselves to your spirit. You must cooperate well with the great teacher to conduct your spirit awakening; grandpa is looking forward to seeing who among you has the capability to become Spirit Masters.”</p><br/><p>The youngster somewhat impatiently said:</p><br/><p>“Very well, you said the same thing last year. Do you think becoming a Spirit Master is really that easy? I already passed six villages, and not one of them had a person with spirit power. They also didn’t have suitable spirits.”</p><br/><p>Old Jack’s eyes showed a trace of dejection, sighing, he said:</p><br/><p>“Yes, ah! Only one in very many inherit the aptitude to actually become a Spirit Master. Among us ordinary people, it is indeed most difficult.”</p><br/><p>Shaking his head, he moved away from the Spirit Hall.</p><br/><p>The youngster’s gaze fell on the eight children before him. As a Spirit Hall inspecting attendant, helping ordinary people undergo spirit awakening was his compulsory assignment, and he was long since used to it.</p><br/><p>“Children, line up.”</p><br/><p>Towards these children, his manner was quite lukewarm.</p><br/><p>The eight children stood in order before the youngster, Tang San stood at the leftmost side. He was a little thinner and smaller than other children his age.</p><br/><p>The youngster smiled and said:</p><br/><p>“I am called Su Yuntao, a twenty sixth ranked Spirit Grandmaster, and will be your guide. Now, I will have you undergo spirit awakening one by one. Remember, regardless of what happens, do not be afraid.”</p><br/><p>While speaking, Su Yuntao unfolded a bundle on a desk to one side, taking out two things from inside: six round pitch-black stones and one sparkling blue crystal ball.</p><br/><p>Su Yuntao placed the six black stones on the ground in the form of a hexagon, then motioned the first child on the right to stand inside.</p><br/><p>“Don’t be afraid, close your eyes and feel carefully.”</p><br/><p>While speaking, Su Yuntao’s eyes suddenly lit up, and before the children’s appalled eyes, he shouted in a deep voice,</p><br/><p>“Lone Wolf Body Enhancement.”</p><br/><p>A wisp of thin blue-green light rose from between his eyebrows, following straight up, entering into the hair knot.</p><br/><p>Su Yuntao’s hair was originally black, but just after that blue-green light poured in, it had turned grey in a flash. Furthermore it quickly grew longer, and similarly colored fur appeared on both his uncovered hands. At the same time, his body also seemed to expand a great deal compared to before, his whole body swelling with muscle.</p><br/><p>The Spirit Hall attire had very good elasticity; it actually didn’t rip when filling to the point of bursting because of his body growing large. Su Yuntao’s eyes had already changed to a faint green color. Sharp claws stretched out from the ten fingers on both hands, glimmering coolly with a dazzling gleam. Two concentric halos of light shone brightly up from underfoot, constantly moving from underfoot to the crown of his head. Among them one was white, the other one was yellow. Exceedingly strange.</p><br/><p>The boy he told to stand among the black stones, with eyes staring at Su Yuntao’s body transforming, suddenly shouted,</p><br/><p>“Aaaaah~~~~~~”, about to run away from fear.</p><br/><p>The fresh green radiance in Su Yuntao’s eyes was truly frightening. Catching hold of that child, he said:</p><br/><p>“Don’t move. I said not to be afraid. This is my spirit, Lone Wolf. If one of you is capable of becoming a spirit master in the future, they will also be able to employ similar abilities.”</p><br/><p>The only one not immediately at the height of terror was Tang San, immediate results appeared all over Su Yuntao’s body as he transformed.</p><br/><p>Instead of astonishment, Tang San’s heart was full of curiosity, ‘Grey fur appeared all over him, green eyes, these really are wolf characteristics, could it be that after spirit possession people transform into wolves? No, not right, it should be that he possesses a wolf ability, right. Then, within spirit master vocation, there should be a better use of spirit abilities.’</p><br/><p>For the first time, Tang San realized, he became interested in the spirit master vocation. He now already somewhat impatiently wanted to know what his own spirit was.</p><br/><p>As Su Yuntao clapped both hands together, at lightning speed, six faint green lights poured into the black stones on the ground. At once, a layer of golden misty light released from the stones and rose.</p><br/><p>Part 3</p><br/><p>For some reason, as the previously noisily crying child was enveloped in the faint golden light, he immediately became quiet, just somewhat dully standing there.</p><br/><p>Every speck of the golden light came fluttering up from the black stones, further entering the body of the boy.</p><br/><p>The boy's body began to lightly tremble, not knowing whether to shout or remain quiet.</p><br/><p>\"Extend your right hand.\"</p><br/><p>Su Yuntao's two moss green eyes stared fixedly at the boy, majestically commanding.</p><br/><p>The boy extended his right hand with a start, then paused. All the light specks surged out, instantly a sickle appeared in his hand.</p><br/><p>It would appear, that sickle wasn’t any trick of the light, and rather it truly existed.</p><br/><p>Su Yuntao creased his brow,</p><br/><p>\"It's a Tool Spirit. Can a sickle be regarded as a weapon? It ought to with effort.\"</p><br/><p>The golden light gradually disappeared. The boy, somewhat amazed, looked at the not particularly small sickle in his hand, rather at a loss.</p><br/><p>Su Yuntao said:</p><br/><p>\"Your spirit is Sickle, a Tool Spirit. Come, let me test if you have spirit power. If you possess spirit power, even a tool spirit can undergo Battle Spirit Cultivation. After all, a sickle certainly has potential for attack.\"</p><br/><p>\"Great-, great teacher, what should I do?\"</p><br/><p>The boy timidly asked.</p><br/><p>Su Yuntao coolly said:</p><br/><p>\"Intentionally recall your spirit. From now try to remember the time you employed it and use that thought to call it out.”</p><br/><p>The boy tried a long time, just to recall the sickle. Su Yuntao’s hands held the blue crystal ball in front of him, motioning him to place his right hand on it.</p><br/><p>The boy’s immature little hand and Su Yuntao’s wolf claws above and below the crystal ball respectively, there was a clear contrast.</p><br/><p>A moment later, Su Yuntao somewhat dejectedly said:</p><br/><p>“No spirit power. You can’t become a Spirit Master. For now, step aside.</p><br/><p>Similar scenes continued to play out, and one after another five children had their spirits awakened. Their spirits were all a few pickaxes, sickles and such farm tools. In succession no Beast Spirit appeared, and as for spirit power, all were judged by Su Yuntao to be ‘nil’.</p><br/><p>When the seventh child’s turn came, this was also the last one ahead of Tang San.</p><br/><p>After sustained use of spirit power, Su Yuntao seemed to already be rather exhausted, but he still intended to help all eight children complete the awakening process.</p><br/><p>Golden flecks of light gathered, and this once, finally it was no longer a farm tool, and something different appeared. A small stem of light blue grass appeared in this girl’s palm, softly fluttering to and fro.</p><br/><p>Tang San vaguely felt that he had himself seen this blue little grass before. Very quickly, the thought came to him; this grass was known as blue silver grass. It showed up everywhere in the village. Resembling his original world’s green grass, it was just as widespread, except its vitality was comparatively even more tenacious. It didn’t really have any other function. Only because the girl was covered in a layer of pale golden light, he did not recognize it at first.</p><br/><p>Even though it wasn’t a farm tool, the disappointment in Su Yuntao’s eyes was even more evident,</p><br/><p>“It’s a useless spirit. It doesn’t have potential for attack, doesn’t have defensive power, and doesn’t have assisting ability. Blue silver grass is also considered as the standard of useless spirits.”</p><br/><p>While speaking, he held out the blue crystal ball to the girl in accordance with procedure, and just like he predicted, like before no spirit power appeared.</p><br/><p>At long last it was Tang San’s turn, Su Yuntao didn’t have to speak, he already stepped ahead to stand in the centre of the six pitch black stones.</p><br/><p>In pace with Su Yuntao’s six streams of spirit power pouring into them, the pale golden light once more shone up brightly. Warmth, this was Tang San’s first sensation, as if his whole body was wrapped up inside a nice and warm world, unspeakably comfortable. No wonder those children before could smooth their emotions when wrapped up in the light.</p><br/><p>Warm breath permeated into the body, and Tang San distinctly became aware that his own Mysterious Heaven Skill internal power seemingly fluctuated. Immediately afterwards, in that warm energy’s traction, within the body just as if something had broken, in a split second warm breath surged towards the palm of his hand.</p><br/><p>Su Yuntao’s eyes abruptly shone, because within that golden light, there appeared so many golden flecks that it was even more than what all the previous children possessed together. He faintly sensed, as if a correspondingly powerful spirit would appear. Excitement showed in his manner.</p><br/><p>Speaking of those Spirit Hall attendants responsible for ordinary people’s spirit awakening, if they could awaken a potentially outstanding child, then bring him to Spirit Hall, they could acquire many first class benefits. With regard to getting promoted it was enormously advantageous.</p><br/><p>But very quickly Su Yuntao lost heart.</p><br/><p>Tang San subconsciously lifted his right hand, he saw something blue. This type of blue had already appeared twice at the village’s Spirit Hall that day.</p><br/><p>Blue silver grass, exactly identical to the previous girl’s blue silver grass. The standard for useless spirits.</p><br/><p>Su Yuntao had no choice but to say:</p><br/><p>“Again a useless spirit, it seems. Holy Spirit village this time was again a waste of time. Ok, children, you can leave.”</p><br/><p>The previously great quantity of golden flecks of light that appeared, at first gave him a great deal of expectations, but when finally unexpectedly it was merely blue silver grass, the sense of disparity caused Su Yuntao to feel somewhat in a bad mood.</p><br/><p>“Uncle, you still have not let me undergo spirit power test, right.”</p><br/><p>Tang San saw Su Yuntao already wanted to pack up that blue crystal ball, and hurriedly reminded him.</p><br/><p>Su Yuntao said without looking back:</p><br/><p>“No need to test. Blue silver grass, for this useless spirit I still have never seen one instance where spirit power appeared.”</p><br/><p>“Let me give it a try, uncle.”</p><br/><p>Tang San persistently said. When the golden light brought the warm feeling inside him, it produced a strange sensation, as if a great door opened and caused a subtle change in his Mysterious Heaven skill. At the same time, he also very much wanted to know, what the actual difference was between his inner strength and this world’s spirit.</p><br/><p>Su Yuntao was dumbfounded all of a sudden, turning around, to Tang San’s calm and rather steadfast gaze. In his heart musing, this child was seemingly out of the ordinary.</p><br/><p>Part 4</p><br/><p>“Very well.”</p><br/><p>Trying once could not waste much time. While speaking, he handed over the blue crystal ball to Tang San.</p><br/><p>As before, Su Yuntao instructed to withdraw blue silver grass from within the body. He realized, this really was not difficult; with respect to Mysterious Heaven Skill control it was similar to what the skill to withdraw could accomplish. Simultaneously, he additionally discovered, the moment blue silver grass appeared, seemingly it also was his Mysterious Heaven skill pouring out, and like that blue little grass became condensed through Mysterious Heaven skill.</p><br/><p>With his palm just about to touch the blue crystal ball, Tang San’s body fiercely trembled all of a sudden. He was shocked to discover, that seemingly very beautiful blue crystal ball unexpectedly possessed tremendous attraction, his inner strength surging out as if finding an outlet. He wanted to struggle free, but no matter how he tried he was unable to escape out that strong attraction.</p><br/><p>Su Yuntao was similarly amazed. To think that this situation would arise while the last spirit power test of this Holy Spirit village’s was taken. Suddenly, the blue crystal ball in his hand began to shine, dazzling blue light starting from a point spread in a flash. In an eye blink, this crystal ball looked just like it was a resplendent gem giving off sparkling luminescence. A cool blue flare showed, unspeakably moving.</p><br/><p>In accordance with the traditional test, as long as the crystal ball gave some response, even a single trace of radiance, it would prove by test that spirit power existed, and at present the blue crystal ball radiated such dazzling radiance that there was only one explanation.</p><br/><p>“Heavens, it actually is innate full spirit power.”</p><br/><p>Blue green light released again from Su Yuntao’s body, and the crystal ball shot out from Tang San’s palm. At this moment, he saw before his eyes this boy’s gaze had already become completely different. It seemingly resembled the appearance of a monster.</p><br/><p>Tang San naturally also noticed that his situation was different from the other children’s test. Feeling uncertain, he asked:</p><br/><p>“Uncle, what is innate full spirit power?”</p><br/><p>Su Yuntao dully looked at him, and subconsciously explained:</p><br/><p>“For everyone at the time of spirit awakening, apart from a spirit’s form, while deciding whether it is big and powerful, the amount of spirit power is also extremely important. Vast amount of people at the time of spirit awakening do not have spirit power, like the several children before this. They are destined to be unable to become spirit masters in their lifetime. But provided spirit power appears, even if only a little, anyone can undergo meditation cultivation. And at the time of spirit awakening the spirit power amount is crucial for setting spirit master cultivation starting level. With higher spirit power level, acquired cultivation rate is greater. Moreover, because of starting level, the fundamentals will naturally also be practiced earlier than others. What is known as innate full spirit power is that at the time of spirit awakening, one is innately capable of attaining the highest spirit power.”</p><br/><p>“Highest spirit power?”</p><br/><p>Tang San looked at Su Yuntao, his heart swirling. He did not know what his spirit power was, but it could certainly be, that the testing blue crystal ball absorbed his internal strength from Mysterious Heaven skill. Could it be said that, his internal strength in this world transformed into spirit power?</p><br/><p>Perhaps it was because Tang San’s innate full spirit power caused no small shock to Su Yuntao, but he did not mind taking the trouble to explain:</p><br/><p>“Our spirit is graded like this: every ten ranks is a title. After spirit awakening, one can automatically be known as spirit scholar. Of course, only a first level spirit scholar. In accordance with spirit strength intensity it is subdivided into ranks. What is meant by innate full spirit strength is that exactly after awakening, spirit strength level is innately the highest tenth rank. I still have never come across a person with innate full spirit strength; originally when I awakened, I also was only second rank spirit power, nothing more.”</p><br/><p>Tang San had already collected himself by now. It was very difficult to find a true spirit master, so he naturally was unable to give up, and hurriedly asked his inner heart’s doubt,</p><br/><p>“Innate spirit strength can only be tenth rank? It cannot be higher?”</p><br/><p>The blue green light around Su Yuntao’s whole body disappeared, withdrawing his spirit body possession,</p><br/><p>“Of course not. A spirit master’s strength cannot be promoted that easily. During each advancement of title, not only must spirit power first reach the summit of the title, furthermore one must obtain a spirit ring. Without a spirit ring, even if you further make great efforts with cultivation, it is still impossible to enter the next title. Just for instance like you right now, because you have already attained innate full spirit power. Therefore, if you want to continue promoting your spirit power, instead of meditation, you must first obtain a spirit ring. After entering into the lower levels of the second title, you will be able to continue meditation cultivation.”</p><br/><p>Tang San suddenly said:</p><br/><p>“Spirit ring, like the halo around your body just now? You are 26th rank, therefore have two spirit rings.”</p><br/><p>Su Yuntao nodded, said:</p><br/><p>“Exactly like that. Your circumstances are very exceptional, innate full spirit power is a rare once in a hundred year gift. It’s a pity, truly is a pity. Unexpectedly it is a useless spirit. Even if your spirit were only a farm tool, it would be stronger compared to blue silver grass. In that case, I could…..”</p><br/><p>He did not say more, but Tang San also faintly understood his meaning, only in his heart, a covering veil was lifted.</p><br/><p>Tang San had always been a person good at contemplation. In his previous life he was like that, in this life he was still like that. According to what Su Yuntao said, in his case spirit strength truly was linked with internal strength. That is, after arriving in this world, cultivation of internal strength became spirit strength, and the reason why his Mysterious Heaven skill was unable to enter the secondary tier, was exactly because of this so called spirit ring. To be precise, if he wanted to further improve, he must become like a spirit master to obtain spirit ring. But what is a spirit ring?</p><br/><p>Tang San properly thought it through before continuing asking. But Su Yuntao had already picked up the bundle and headed to leave.</p><br/><p>“Old Jack.”</p><br/><p>Door open, old Jack with a tense face went to meet Su Yuntao.</p><br/><p>“Grandmaster, what do you think. Do this year’s village children possibly have capability of becoming spirit masters?”</p><br/><p>Su Yuntao looked at him, made a sighing sound, and said:</p><br/><p>“There is one who does, only it’s a pity.”</p><br/><p>In Jack’s eyes revealed a bewildered indeterminate expression. Enquiring further, he asked:</p><br/><p>“Grandmaster, that outcome is……”</p><br/><p>Su Yuntao said:</p><br/><p>“This year among these eight children, only one possess spirit power, and even innate full spirit power, it’s too bad, his spirit is blue silver grass. You understand?”</p><br/><p>“Blue silver grass? Innate full spirit power? Heavens.”</p><br/><p>On Jack’s face was a downcast expression which was much more grave compared to Su Yuntao. He who had been village chief for so many years, naturally understood what significance innate full spirit power represented. But this innate full spirit power appeared with blue silver grass spirit; that truly was……</p><br/><p>“Grandmaster, blue silver grass truly has no way of cultivation?”</p><br/><p>Jack asked with a frown.</p><br/><p>Su Yuntao could understand old Jack’s state of mind. Instead of his earlier arrogant manner, patting old Jack’s shoulder, he said:</p><br/><p>“It is not entirely unable to cultivate. Only, you consider blue silver grass in rate of spirit promotion; what can evolution accomplish? Useless spirits are in the end useless spirits. Even while becoming a spirit master, he probably will be a useless spirit master. This innate full spirit power truly is a pity. Well then, I will leave first, I must still go to another village.”</p><br/><p>Su Yuntao in the end did not wait for Tang San to continue asking questions, departing from the village. With no Su Yuntao, Tang San could only run to Jack outside, asking his most urgent question,</p><br/><p>“Jack grandpa, what is a spirit ring? How can one obtain a spirit ring?”</p><br/><p>Old Jack, as if still thinking over Su Yuntao’s words, subconsciously answered:</p><br/><p>“I also do not know what spirit ring is. In order to obtain spirit ring, one seemingly must hunt spirit beasts. This is very a very dangerous task that only spirit masters are capable of.”</p><br/><p>[1] (，，，，，，，，，)</p><br/>\n</div>"}