{"title": "Chapter 5", "id": 5, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-5", "volume_title": "Volume 1", "body": "<h1>Chapter 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 5</p><br/><p>Grandmaster? Teacher?</p><br/><p>When a spirit master level personage apologized towards him, old Jack’s vanity received an enormous boost, and he hastily shook both hands, saying:</p><br/><p>“Don’t apologize, don’t apologize. We are also in the wrong. Grandmaster, I will trouble you with this child. Tang San, you follow Grandmaster inside ok, but you must be obedient.”</p><br/><p>Tang San nodded, but did not open his mouth.</p><br/><p>Earlier, when this Grandmaster before him stopped the gatekeeper from charging at him, his left hand was already lifted, and for insurance, a sleeve dart was already readied. If this Grandmaster before him had spoken a step later, perhaps that gatekeeper’s throat could have received a short arrow.</p><br/><p>【Tang Sect Mysterious Heaven Treasure Records, general principles, third item: Determine whether the opponent is an enemy. If they are, then aim to kill. If not then show mercy, otherwise you shall only increase your worries.】</p><br/><p>To Tang San it seemed that the gatekeeper moving towards Jack was trying to strike an old man. In addition to his unkindness, this in itself was already enough to aim to kill. At the same time, he was also absolutely certain that including old Jack there was nobody who could detect him using that sleeve dart. Without evidence, who could say that he killed? Tang sect’s silent sleeve dart shot so extremely fast, it would only leave a shadow, and how could the doorkeeper have dodged with those trash capabilities?.</p><br/><p>Not until after old Jack warned Tang San several more times did he leave.</p><br/><p>Grandmaster coldly glanced at that gatekeeper,</p><br/><p>“This is the first time, and also is the last time. If there is a repeat offense, you need not remain here.”</p><br/><p>His hoarse voice was calm, but gave a feeling that made it impossible to refute.</p><br/><p>The gatekeeper’s back broke out in cold sweat, and he hurriedly repeatedly echoed agreement and got out of the way to the side.</p><br/><p>Grandmaster lowered his head to look at Tang San, on his face emerged a slight smile. As if his facial muscles were stiff, the smile had an appearance that most people would not dare compliment. Dragging Tang San’s hand, he said:</p><br/><p>“We’re entering.”</p><br/><p>Grandmaster’s hand was soft and dry, its grip very comfortable, imperceptibly bringing Tang San a kind of sense of trust. Following him, Tang San finally entered this academy.</p><br/><p>“Teacher, thank you.”</p><br/><p>Tang San said to Grandmaster.</p><br/><p>“Teacher? I am not an academy teacher.”</p><br/><p>Grandmaster turned his head to glance at Tang San, speaking coolly.</p><br/><p>“Not a teacher? Just now did you not speak on behalf of the academy?”</p><br/><p>Grandmaster shook his head, all along today he had been nothing but exceptionally patient, and again squeezed out a trace of that unsightly smiling expression,</p><br/><p>“Who said one must be an academy teacher to represent the academy?”</p><br/><p>Tang San said with sudden realization:</p><br/><p>“I understand. You are an academy principal, or a leader, right?.”</p><br/><p>Grandmaster could not help laughing, and said:</p><br/><p>“For a six year old child, you are very clever. However, you still guessed wrong.”</p><br/><p>Tang San uncertainly said:</p><br/><p>“Then you are?”</p><br/><p>Grandmaster said:</p><br/><p>“I am only a freeloading tenant at this place, that’s all. You and the others alike called me Grandmaster, right. Everyone address me like this. Even to the extent that I have already forgotten my name. On the spirit hall certificate was written that you are called Tang San, right. Tang San, you must understand, the meanings of grandmaster and teacher are entirely different, and hereafter must not address me incorrectly. Unless……”</p><br/><p>Saying this, his words slowed, in his eyes glimmered a burning light,</p><br/><p>“Unless you are genuinely willing to make me your teacher.”</p><br/><p>“You want to teach me spirit cultivation?”</p><br/><p>Tang San asked.</p><br/><p>Grandmaster halted his steps, standing calmly ,facing Tang San.</p><br/><p>“Are you willing to do that?”</p><br/><p>Tang San naturally also stopped, raising his head to look at Grandmaster before him, now observing at close range. Again looking him over from down to up, he discovered Grandmaster’s mouth was a little large, and his lips also very thick. He didn’t open his mouth, both unable to answer, and also unable to not answer.</p><br/><p>Grandmaster saw Tang San’s both eyes staring at him blankly, and that stiff smiling expression once again emerged,</p><br/><p>“Good, you really are a clever child.”</p><br/><p>Not speaking had a second meaning. First not being impatient to refuse, so as not to offend Grandmaster. Second to use this action to inquire from Grandmaster, ‘why must I acknowledge you as master?’</p><br/><p>Grandmaster, resembling old Jack, raised his hand to tousle Tang San’s head.</p><br/><p>“Naturally gifted, and also this clever. It seems even I must persistently try again. How should I say this? You also have the third twin spirit in these last hundred years.”</p><br/><p>Hearing grandmaster’s words, Tang San was greatly startled. His gaze looking at Grandmaster suddenly changed. He already quietly lifted his left wrist, a surprised unpredictable look appearing in his eyes.</p><br/><p>Grandmaster calmly and in an easygoing way looked at him. Smiling, he said:</p><br/><p>“Don’t you want to know how I could know so quickly that you have twin spirits?”</p><br/><p>Speaking, he flicked open the certificate in his hand that old Jack gave him,</p><br/><p>“It is precisely because of this certificate. Perhaps another person looking could not find the flaw, but if I also could not see it, then I could not be called Grandmaster.”</p><br/><p>“I have investigated six hundred forty seven people with blue silver grass spirits. Among them were sixteen with spirit power, so the odds are less than three in a hundred. And even these sixteen people possessing spirit power did not have spirit power ability exceeding the first rank, and yet your innate full spirit power is of the tenth rank. According to my research in the first of the ten great core spirit competencies, innate spirit power size is in direct ratio with the quality of the spirit. Blue silver grass is obviously unable to measure up, therefore I can conclude that you should still have another spirit, and also that it is an extraordinarily powerful spirit.”</p><br/><p>The expression in Tang San’s eyes gradually calmed down, and he argued:</p><br/><p>“Everything has exceptions, why couldn’t I be a special case?”</p><br/><p>Grandmaster nodded seriously, and said:</p><br/><p>“That’s right, everything has exceptions, but your spirit is blue silver grass, therefore you clearly are not that exception. In the last hundred years in Heaven Dou Empire and Star Luo Empire, although twin spirits have only appeared twice, innate full spirit power has appeared nineteen times. I have carefully studied each of those spirits, and not one wasn’t formidable. The youngest one has now already reached the spirit grandmaster level. Other than fourteen who inherited formidable spirits from clan blood lineage, there were five exceptions.”</p><br/><p>Part 2</p><br/><p>“They did not come from a privileged background, but also possessed innate full spirit power. And this kind of unexpected existence is exactly what is called variant spirits. On the basis of my many years of research in variant spirits, never has any kind of spirit with blue silver grass spirit produced a variation. And your blue silver grass spirit is also an ordinary blue silver grass, therefore, I can be completely confident that my judgment is correct.”</p><br/><p>“Variant spirits, what is that?”</p><br/><p>Tang San asked.</p><br/><p>Grandmaster patiently explained:</p><br/><p>“I earlier mentioned the issues of how spirits are inherited. A person’s spirit has a direct relationship with their parents’ spirits, and under normal circumstances the spirit is inherited from either the father or mother’s side. This is family pattern spirit inheritance. Among them are a few exceptions and these are what are called variation spirits. Same as the source parent’s spirit, but because there is a certain variation between the father and mother’s spirits, inheritance of one or the other spirits can produce a variation, bringing about a new kind of spirit. Variant spirits can have formidable variations, and even appear with innate full spirit power. But the overwhelming majority of variant spirits only become small and weak. Variant spirits are like the result of inbreeding: the possibility of retardation is very big, but there is also the possibility of producing an exceptional sage.”</p><br/><p>Tang San nodded, and suddenly moved back a step, opening up the distance between him and Grandmaster. Immediately after, he fell to his knees, and respectfully kowtowed three times towards Grandmaster.</p><br/><p>This time, it was Grandmaster’s turn to be dumbfounded,</p><br/><p>“What are you doing?”</p><br/><p>“Teacher.”</p><br/><p>Tang San respectfully called,</p><br/><p>“Please accept me as a student.”</p><br/><p>Grandmaster smiled a very satisfied smile, stooping to pull Tang San back up,</p><br/><p>“Muddleheaded boy, why kowtow to formally become a pupil, don’t you know this is only courtesy when acknowledging the emperor and parents? You need only to bow for this.”</p><br/><p>Douluo Continent customs are of course not the same as circumstances in Tang San’s first life, but Tang San certainly did not think his courtesy was too much, and solemnly said:</p><br/><p>“A teacher for a day is a father for life. You should receive my kowtow.”</p><br/><p>Tang sect’s teachings regarding courtesy were extremely severe. Having received that kind of education when he originally grew up, it had been branded deeply into the core of Tang San’s heart a long time ago.</p><br/><p>Grandmaster was moved and looked at Tang San,</p><br/><p>“Teacher for a day, father for life, good, good, it appears that as expected, I have not chosen incorrectly.”</p><br/><p>What is called ‘one tiny clue reveals the general trend’ is that the details determine success or failure. Even though this pair of master and apprentice had not met for long, but Grandmaster already had no small understanding of this child before his eyes.</p><br/><p>“Let’s go, I will bring you to report to the dean’s office.”</p><br/><p>Grandmaster again dragged Tang San’s hand. His originally dry big hands were faintly perspiring because of excitement.</p><br/><p>Nuoding primary spirit master academy was not as big as it appeared outside, and was mainly divided into a few areas: the main school building, a sports ground and a dormitory to the east of the sports ground.</p><br/><p>Even though it was only an elementary spirit master academy, this place’s requirements towards students were extremely strict; even if the home was near the academy, students must still live in the academy under a unified regime.</p><br/><p>At the dean’s office on the main school building’s first floor was a sixty year old teacher who was in charge of dealing with new students and two additional teachers in their thirties who assisted him.</p><br/><p>Grandmaster placed the certificate he held on the desk, and said towards that elderly teacher:</p><br/><p>“Director Su, this is this year’s working student delivered by Holy Spirit village, I will trouble you to help him register at once.”</p><br/><p>Director Su, his face covered by a smile, said:</p><br/><p>“Why Grandmaster, you have come, a rare visitor, ah! Please have a seat.”</p><br/><p>Grandmaster shook his head, and said towards Tang San:</p><br/><p>“You enroll here on your own, these several teachers can tell you what to do. I’ll leave first, I will go find you later.”</p><br/><p>Tang San nodded, and respectfully said:</p><br/><p>“Goodbye teacher.”</p><br/><p>Grandmaster revealed a smile, stroked his head, then turned and left.</p><br/><p>Hearing how Tang San addressed Grandmaster, director Su appeared very interested,</p><br/><p>“Lad, you called Grandmaster teacher? He is not our academy’s teacher.”</p><br/><p>Tang San said:</p><br/><p>“But he is my teacher.”</p><br/><p>Director Su stared blankly,</p><br/><p>“You acknowledged Grandmaster as your teacher?”</p><br/><p>His expression was somewhat queer, a kind of expression as if holding back laughter.</p><br/><p>Tang San Said:</p><br/><p>“Is something wrong, teacher?.”</p><br/><p>Director Su repeatedly shook his head and said smilingly:</p><br/><p>“Not at all, not at all. I did not think Grandmaster also could accept disciples. Only, you are still originally an academy student, and hereafter must comply equally with the academy’s system of regulations, you understand?”</p><br/><p>Tang San nodded.</p><br/><p>The two teachers to the side of director Su did not have as much self-restraint as him. One of them grabbed the spirit hall certificate for a look. Smiling, he said,</p><br/><p>“Tang San, right. As an academy teacher, I must instruct you at once. A master cannot be acknowledged casually. Any spirit master, not to mention denying academy graduation, also can only acknowledge a spirit master, otherwise one cannot be accepted by the common people. Do you really believe Grandmaster is quite suitable? Oh, you have innate full spirit power. What a pity, the spirit is blue silver grass.”</p><br/><p>Looking at the words innate full spirit power on the certificate, the faces of all the teachers present displayed astonishment, but blue silver grass caused their awe to turn into pity.</p><br/><p>Tang San looked somewhat baffled at the three teachers facing him,</p><br/><p>“Is there something inappropriate?”</p><br/><p>Director Su glared at the younger teachers beside him, and said:</p><br/><p>“Even if Grandmaster has a somewhat eccentric disposition, but from a certain point of view, with respect to spirits he is nevertheless an ‘unequalled’ existence. Even if your spirit is blue silver grass, acknowledging him as master is of no concern. Well, that’s how it is. These are your things, provided for free by the academy. You live at the dormitory, room seven. The teacher responsible there can arrange your work as a working student. Go.”</p><br/><p>“Thank you, sir.”</p><br/><p>Taking the things director Su handed over, Tang San after making his courtesies turned and left the administration office.</p><br/><p>What Director Su gave him was a standard Nuoding primary spirit master academy uniform, white ,texture looking very neat. Just now when leaving the administration office, Tang San vaguely heard from inside the office the words spoken by those younger teachers.</p><br/><p>Part 3</p><br/><p>“Grandmaster really is ‘unequalled’, only, unequalled in theory. Of course, he still must put those theories to actual work. Director, I still remember Grandmaster had some ten great core spirit competences theory, right. That was simply too ridiculous.”</p><br/><p>“Enough, Grandmaster is the dean’s friend. You must not make such presumptuous evaluations. Although there is no proof his theory is correct, but no one has proved his theory wrong. In the spirit world, Grandmaster is indeed a brilliant and famous person.”</p><br/><p>“Incorrect, director, a brilliant and famous clown should be correct. Everyone just acts if he is a joke, nothing more.”</p><br/><p>Hearing the sound of the conversation inside, Tang San’s footsteps only halted for a moment, then he proceeded to leave. The corners of his mouth exuded a trace of disdain; of course it was not directed at his just acknowledged master, rather at the three teachers in the administration office.</p><br/><p>From barely a simple certificate he could see that he had twin spirits, and further conclude that his other spirit was a formidable one, could that only be a joke?</p><br/><p>Theory unequalled? Right now his biggest necessity was theory. A master’s physical strength could not be passed on to the disciple - what was passed down was knowledge. Those people did not understand even this much, even though they were academy teachers.</p><br/><p>There was only one dormitory building, easily found, where academy students and teachers all lived. Just like what old Jack said, those who could become spirit masters were very few, and it was especially so in a remote city like Nuoding. The amount of students and teachers were certainly not many, and a single dormitory building could already bear the burden.</p><br/><p>The student dormitory altogether only had seven rooms. Because the elementary spirit master academy students were all comparatively young, in order to better supervise them together every year’s students lived together in a big dormitory room. Each year’s Nuoding primary spirit master academy students were only approximately forty people.</p><br/><p>The dormitory building’s lower three floors held seven big student dorm rooms, and every dorm room had a teacher in charge.</p><br/><p>Room seven among these seven student dorm rooms was a comparatively unusual place. The circumstances were also the most different: it was a place especially for working students. After all, the academy was not a charity and even though the tuition for working students was lowered, the treatment could not be as good as that of ordinary students.</p><br/><p>Room seven was also the only mixed age dormitory, so no matter what grade, all working students lived here.</p><br/><p>Just when Tang San reached the door of room seven he could hear loud noises from inside. The door was open, so he walked up and looked inside.</p><br/><p>This was an expansive room, in excess of three hundred square metres. Inside altogether fifty beds were lined up, but only the beds: only eleven had bedding. Right now, inside there were seven or eight to twelve year old students making a ruckus.</p><br/><p>Tang San knocked on the door, and the children arguing inside immediately turned their gazes in that direction. Among them an older comparatively large kid looked at Tang San in clothing covered with patches, then walked towards him.</p><br/><p>This kid compared to Tang San was nearly two heads taller, and this kid’s body could be regarded as comparatively tall and sturdy for his age. Walking up in front of Tang San, he somewhat towered above him and said:</p><br/><p>“A newly arrived working student?”</p><br/><p>On Tang San’s face was a slight good intentioned smile,</p><br/><p>“Hello, I am a working student from Holy Spirit village.”</p><br/><p>“I am called Wang Sheng, my spirit is a future war tiger battle spirit. Also the head of this place. Boy, what’s your name? What’s your spirit?”</p><br/><p>“I’m Tang San, spirit is blue silver grass.”</p><br/><p>“Blue silver grass spirit? Since when could a blue silver grass spirit cultivate?”</p><br/><p>Wang Sheng appeared absolutely startled, the kids in the dormitory all broke out in raucous laughter , looking at Tang San as if he was an idiot.</p><br/><p>Tang San was still smiling,</p><br/><p>“Please let me by, ok?”</p><br/><p>Wang Sheng did not comprehend Tang San’s words,</p><br/><p>“Little Third, I’m the boss here, hereafter you listen to me, got it?”</p><br/><p>The smile on Tang San’s face gradually disappeared,</p><br/><p>“My name is Tang San, not little Third.”</p><br/><p>If the seniors called him little San he would not take it to heart, or if it was a good intentioned form of address it was also no matter, but the so called boss before his eyes obviously meant it to be a show of strength towards him.</p><br/><p>Wang Sheng raised his hands to push at Tang San’s shoulders, pushing him back several steps,</p><br/><p>“I’m calling you little Third, so what? Not satisfied?”</p><br/><p>Tang San smiled, lightly shaking his head, placing the school uniform in his hands on a bed to the side, while Wang Sheng was somewhat bewildered at whyever for. Suddenly, Tang San vanished from in front of him.</p><br/><p>The other students clearly saw Tang San take an extremely fast step, and unexpectedly already arrived at Wang Sheng’s back. Without turning his head, his right arm curved up, a single elbow strike at Wang Sheng’s waist, meanwhile, his right foot also happened to be by Wang Sheng’s right foot.</p><br/><p>Wang Sheng could not even react. He had already completely tumbled out, bouncing through the open dormitory door. Fortunately the strength of his footwork was not bad, and unexpectedly he had not fallen down, otherwise he would have fallen flat on his face.</p><br/><p>“Stinking brat, you dare strike me?”</p><br/><p>Wang Sheng, indignant, pounced at Tang San in a wink like a fierce tiger.</p><br/><p>Tang San had hoped that on coming to live at the academy he would not encounter too many troubles, or at least live normally without disturbances. However, he certainly thought he should give this ‘boss’ before him a little lesson. What is called ‘killing the chicken to warn the monkey’.</p><br/><p>Looking on passively as Wang Sheng pounced, aiming one punch at the pit of his stomach, Tang San did not retreat and conversely advanced, taking a step to meet Wang Sheng. His step was just enough to put him in front of Wang Sheng, at the same time stretching out his left hand, the right hand following along. Completing a simple yet effective motion.</p><br/><p>Wang Sheng only felt as if his waving right fist was pulled by an exceptional force, and the circumstances unexpectedly changed. Meanwhile a great force came from Tang San’s right hand, the foot below again just enough to trip him, a body immediately flying out a second time. This time the balance could not be grasped so well. Tang San’s both hands simple motions already made use of Tang sect secret lore Controlling Crane Catching Dragon skill, taking advantage of Wang Sheng’s own physical strength, in addition to his own physical strength. Wang Sheng immediately fell to the ground with a thump.</p><br/><p>Part 4</p><br/><p>If the first time could be called fortunate, then the second time Wang Sheng fell out was clearly not that easy. The expression in the eyes of the other children looking at Tang San suddenly changed a bit.</p><br/><p>A sound that distinctly should not appear in a child’s mouth rose from Wang Sheng’s throat as a muffled roar, and it could faintly be seen that his body a emitted a layer of pale yellow light. The body on the ground pounced and shot up in a flash; whether speed or strength, they clearly could not be compared to before.</p><br/><p>Spirit. He employed the spirit’s strength. This thought flashed through Tang San’s mind like a lightning bolt.</p><br/><p>However, what spirit was that again?</p><br/><p>Seeing that Wang Sheng grabbed at his shoulders with both hands, Tang San similarly raised both his hands, equally taking the shape of a claw and receiving Wang Sheng’s hands. Both feet with toes simultaneously facing in, knees slightly bent, taking a clamping goat standard horse stance.</p><br/><p>Four hands connected. If a moment ago could be called using skill, then that completely transformed into a contest of physical strength in front of their eyes. Two pairs of hands not alike in size already grabbed together.</p><br/><p>Wang Sheng was clearly already infuriated by Tang San, his face revealing a trace of savagery. Right now he employed his spirit war tiger’s strength, and although he knew he could not really injure Tang San, he at least wanted to rely on his physical strength to push this little devil to the ground for making him lose face.</p><br/><p>Tiger claw emitting force, Wang Sheng believed he was completely justified. Relying on the power from his previous five years as a student, overwhelming this brat before him should be an easy matter.</p><br/><p>But, was it truly like that?</p><br/><p>Though Tang San was thin and small, he could continuously swing the forging hammer every day nearly a thousand times. How could his physical strength be ordinary?</p><br/><p>At the same time as Wang Sheng was emitting force, he could distinctly feel that both those hands, clearly smaller than his, were unexpectedly as solid as steel. Almost in a split second, physical strength obtained an overwhelming victory. Both Tang San’s thumbs simultaneously used their strength. Wang Sheng only felt a peal of numbness between the thumb and index finger as his spirit strength was completely neutralized by the other side. Immediately afterward Tang San pulled his hands in a backward leap.</p><br/><p>Wang Sheng pounced from overhead to begin with. Tang San’s leap backwards immediately caused him to lose his balance. He watched helplessly as Tang San’s knee emerged in front of his face, in his heart immediately loudly crying in alarm.</p><br/><p>Tang San’s knee was approaching his nose. Wang Sheng knew, even if discounting Tang San’s physical strength, just his own body weight smashing down like this probably couldn’t protect his nasal bone. In this split second, in his heart he couldn’t help but feel somewhat regretful.</p><br/><p>But when he was about to maul his opponent, Tang San’s both hands abruptly slackened, and the physical strength with which he held Wang Sheng naturally disappeared. Furthermore, the bent right knee completely opened up, turning into a kick with the right foot's instep at the pit of Wang Sheng’s stomach.</p><br/><p>This snap kick, though the motion is not long, the instantaneous burst of power is certainly not weak; even if Tang San put more strength into the kick, this would still be the case.</p><br/><p>The dormitory students could only stare as Wang Sheng’s body uncontrollably performed an extremely difficult backflip in the air, and with a peng sound, landed on the ground with his whole body already prostrate on his stomach.</p><br/><p>Although Tang sect was famous for its hidden weapons, in truth, Tang sect’s grappling was also extremely fierce; only, it was concealed by the excessively dazzling halo of the hidden weapons, that’s all. Controlling Crane Capturing Dragon was not only a carrying strength method, but at the same time a kind of extraordinarily potent grappling technique. Among them were some extremely diabolical muscle splitting, bone displacing techniques. Of course, Tang San could not use those under these kinds of circumstances.</p><br/><p>This time, Wang Sheng did not fall so lightly, and he struggled for a long time to clamber off the ground. Looking at Tang San the expression in his eyes already became fearful and angry simultaneously. No matter what he said, he was only a twelve year old boy; when facing a person even more powerful than him, fear still was much stronger than impulse.</p><br/><p>Tang San picked up his school uniform,</p><br/><p>“Now can you step aside?”</p><br/><p>Staring at Tang San walking towards him, Wang Sheng subconsciously got out of his way. Tang San found a bed not far from the doorway and put his school uniform on it.</p><br/><p>“Little-, oh, no, Tang San, was what you used just now a spirit ability?”</p><br/><p>Wang Sheng asked a probing question.</p><br/><p>“Spirit ability?”</p><br/><p>This was not the first time Tang San had heard this term,</p><br/><p>“What is a spirit ability?”</p><br/><p>Wang Sheng scratched his head, saying:</p><br/><p>“Precisely relying on a technique used with the spirit. Only, is your spirit really blue silver grass?”</p><br/><p>Raising his right hand, cold blue light gushing out from the palm, Tang San showed the dormitory students he certainly didn’t lie.</p><br/><p>Hearing the two words spirit ability, the other students although awed by Tang San’s ferocity, still began to gather around,</p><br/><p>“Was that really a spirit ability? So ferocious, even Wang Sheng dage was no match.”</p><br/><p>Tang San shook his head,</p><br/><p>“That was no spirit ability, only a kind of fighting technique, that’s all. Don’t we have bedding here?”</p><br/><p>A student at worst a few years older than Tang San had a gloomy expression in his eyes,</p><br/><p>“We’re just working students, originally exempt from tuition fee, where would bedding come from ah! We all brought these from home. Otherwise, you could use mine for now, right.”</p><br/><p>Tang San shook his hand and said:</p><br/><p>“No need, thanks. I can do on my own.”</p><br/><p>Wang Sheng walked up in front of Tang San,</p><br/><p>“Why did you show mercy just now?</p><br/><p>He had studied at Nuoding primary spirit master academy for five years. If Tang San stopped his knee and changed to a kick to avoid serious injury then he could not understand why.</p><br/><p>Tang San indifferently said:</p><br/><p>“We are fellow students, not personal enemies.”</p><br/><p>A complex light flashed through Wang Sheng’s eyes,</p><br/><p>“I’m sorry for just now. Every working student arriving here must face this. Us working students are looked down on by the other students to begin with, so we have to unite. We only hope you, this newcomer can join with us……”</p><br/><p>Tang San smiled, and said:</p><br/><p>“Therefore, you wanted to give me a show of strength?”</p><br/><p>Wang Sheng’s face blushed, showing a rather simple and honest smiling expression,</p><br/><p>“It was you who gave us a show of strength in return. However, you truly are ferocious. You should only just be six years old, right.”</p><br/><p>Tang San nodded.</p><br/>\n</div>"}