{"title": "Chapter 19", "id": 19, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-19", "volume_title": "Volume 1", "body": "<h1>Chapter 19</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 19</p><br/><p>Tang San’s Hidden Weapons</p><br/><p>Part 1</p><br/><p>Zhao Wuji’s pair of hands became especially massive, just like big palm leaves.</p><br/><p>Just as Tang San said, previously Zhao Wuji had not used any of his spirit power, before when Zhu Zhuqing was attacking his weak points, even he all had not thought he must use spirit body enhancement.</p><br/><p>Speaking of him as a seventy sixth ranked spirit sage, several twenty something spirit grandmasters truly were too puny. He was only toying with these children, loosening up his body, that’s all.</p><br/><p>But, generally one often must pay the price, precisely because he underestimated them, again adding Tang San’s three people to Ning Rongrong’s seven treasures glazed tile pagoda amplification their actual strength already exceeded thirtieth ranked level, though they still did not have that corresponding perfection from practicing, immediately let this Motionless Bright King eat his fault.</p><br/><p>Zhao Wuji patted the dirt from his head, unhappily saying:</p><br/><p>“Truly fuck his eighty year old mother to be tripped by children, apparently, at odds with you at several serious points were on the point of death. Little Bai, what are you laughing at, tomorrow come find me for a real combat lesson.”</p><br/><p>“Eh……”</p><br/><p>Watching from the sides apparently Dai Mubai had been laughing in his sleeve at Zhao Wuji’s appearance with head and shoulders covered with dirt, right now hearing Zhao Wuji’s words, the smile did not appear again.</p><br/><p>“Children, come. We’ll continue.”</p><br/><p>Zhao Wuji advanced with large strides, walking straight in Tang San and Xiao Wu’s direction. The two’s previous implicit recognition matching had given him a remaining profound “impression”.</p><br/><p>“Xiao Wu, meteor person hammer.”</p><br/><p>Tang San called out.</p><br/><p>Xiao Wu’s toes on Tang San’s shoulders, once again pounced, merely this time she no longer was going hands first, but became feet first, kicking straight for Zhao Wuji’s head.</p><br/><p>At the same time, ten blue silver grass simultaneously surged out from around Tang San’s body, from different directions tangling around Zhao Wuji.</p><br/><p>Zhao Wuji raised his hands to smack towards Xiao Wu, but who could have imagined, Xiao Wu’s body still had not reached before him, but suddenly changed direction, this palm of his naturally only clapped the air. Xiao Wu swept across from the side, one leg kicking at Zhao Wuji’s shoulders.</p><br/><p>Originally, the so called meteor person hammer, was hidden weapon Meteor Hammer’s clone, reying on blue silver grass binding, Tang San controlled Xiao Wu’s body moving nimbly in midair, launching an attack. Unfortunately, the defense power of Zhao Wuji they faced was truly too unreasonable, even if his dodging ability didn’t matter, wanting to touch his body could not be so easy.</p><br/><p>Common hidden weapons were divided into four main categories, hand thrown, mechanism launched, wire system, drug spray. Like a Meteor Hammer, Red Holding Lasso, Flying Claw, these were all classified as wire systems. Although less secret than other types of hidden weapons, other hidden weapons were unable to have the same extraordinary attacking power.</p><br/><p>Zhao Wuji also looked distracted by this kick, in the light brown eyes finally revealed a somewhat serious expression. These several children could all become his students, if again letting them make this kind of display, he would lose too much face, how could he still later instruct them?</p><br/><p>Zhu Zhuqing would not stay idle, in a moment of Zhao Wuji advancing on Tang San’s pair, on her body the two yellow spirit rings also simultaneously shone up, one blue one green both eyes pupils abruptly stood up, quietly accelerating forward, body in a flash soaring, entire person under spirit power was wrapped midair into a ball, rapidly rotating dashing towards Zhao Wuji.</p><br/><p>Within her that round silhouette, only saw claw images one after another, exactly her second spirit ring ability, Hell Hundred Claws[1]. Relying on the body’s rapid rotation and cat claw’s penetrating attack power, in an extremely short time inflicting a hundred attacks on the enemy, furthermore attacking the same location, its formidable power extremely astonishing.</p><br/><p>When Zhao Wuji was hit by Xiao Wu’s kick, also exactly the moment Zhu Zhuqing’s Hell Hundred Claw struck his back. Hell Hundred Claw was like a rapidly rotating saw toothed gear, lightning fast cutting Zhao Wuji’s back.</p><br/><p>“Hou——”</p><br/><p>A bellow abruptly resounded, in Zhao Wuji’s eyes a cold light released, both fists abruptly gripping tight. Among the seven spirit rings on his body, the first yellow spirit ring in a flash shone up.</p><br/><p>Intense golden light exploded out in practically a split second, fully engaged in Hell Hundred Claw Zhu Zhuqing was immediately sent flying, in midair issuing a wretched groan.</p><br/><p>Dai Mubai strangely quickly appeared where she was about to drop, catching her in his arms. Discovering Zhu Zhuqing had already passed out from the jolt, and both arms also already dislocated.</p><br/><p>Simultaneously suffering calamity still was Xiao Wu, her kick at Zhao Wuji, body only just brought up by Tang San’s blue silver grass, as Zhao Wuji’s attack unleashed, on Tang San’s body blue silver grass also flew out just in time to bind Zhao Wuji’s body.</p><br/><p>In that intense golden light, this all became useless effort. Although Xiao Wu was not in as close contact as Zhu Zhuqing, still flew up from the jolt, Tang San’s blue silver grass whether it was close to the body or still not close to the body, each within three metres around Zhao Wuji’s body completely rebounded back, and near the body even more was smashed to pieces.</p><br/><p>Three muffled sounds practically simultaneously resounded. Receiving the biggest wound was Zhu Zhuqing, next was Xiao Wu.</p><br/><p>Violent shaking force caused Xiao Wu in midair to spout out a mouthful of blood, whole body tingling, directly blue silver grass brought her to drop in Tang San’s arms.</p><br/><p>Although Tang San received the lightest wound, only was under blue silver grass pull by the shock suffering burning agony, but Xiao Wu’s injuries caused him again to be unable to maintain his calm.</p><br/><p>Zhao Wuji’s display, was precisely his first spirit ring ability, Motionless Bright King Body[2]. Despite that only being a hundred year spirit ring, the same spirit ability, used with different spirit power, the effect also was different. Relying on seventy sixth ranked spirit power, this hundred year spirit ring’s bestowed ability reached ample effect. Attack and defense integrated, immediately breaking Tang San’s trio’s joint attack.</p><br/><p>This was power, a spirit sage’s true strength</p><br/><p>Ning Rongrong was also greatly anxious, right now that stick of incense had just burned down half, but while her seven treasures glazed tile pagoda included every kind of auxiliary attribute, it did not incorporate any treatment. She only had two spirit rings, additional effects also only were that many, again feeling anxious and useless.</p><br/><p>Part 2</p><br/><p>Zhao Wuji’s speed suddenly became faster, in seemingly only one step reaching before Tang San, immense palm lifting, the second spirit ring on his body simultaneously shining, bursting into loud laughter, the palm under spirit ring’s infusion in a flash became golden, its bulk magnifying to twice its size, directly swatting at Tang San.</p><br/><p>Xiao Wu was currently still at Tang San’s chest, Tang San naturally could not let her take his place to obstruct this palm, and he hastily pulled her away, but it was not a simple action, making him lose his own opportunity to evade.</p><br/><p>But at this time, on Xiao Wu’s body the second spirit ring shone, both her eyes suddenly turning blood red, with fixed eyes gazing towards Zhao Wuji.</p><br/><p>Zhao Wuji only felt a spell of dizziness in his brain, startled, this descending palm naturally also became slow moving, spirit power also weakening more than half, golden light releasing in his eyes,</p><br/><p>“Good, unexpectedly has a confusion type spirit ability.”</p><br/><p>The red light in Xiao Wu’s eyes contrasted with the golden light in Zhao Wuji’s eyes, suddenly groaning loudly, she directly fainted at Tang San’s chest. Mouth and nose simultaneously overflowing with blood.</p><br/><p>Tang San was practically subconsciously drawing support from this opportunity, using Ghost Shadow Perplexing Track, breaking away from Zhao Wuji’s attack range.</p><br/><p>Zhao Wuji’s palm also did not truly clap down, he furthermore had unexpectedly harmed these children.</p><br/><p>“Xiao Wu, Xiao Wu.”</p><br/><p>Tang San anxiously called out several times, hurriedly imparting Mysterious Heaven skill within Xiao Wu. But Xiao Wu did not react at all.</p><br/><p>Zhao Wuji did not pursue and attack again, standing there, saying</p><br/><p>“She will be fine, although the confusion type spirit ability has good effect, the gap between her spirit power and mine is too big, suffering her own spirit power backlash, naturally also can only have this result. Same as your that blue silver grass incidentally being ineffective on me. Let her sleep one night, tomorrow she’ll wake up recovered.</p><br/><p>Gaze shifting to Ning Rongrong, Zhao Wuji slightly smiling said:</p><br/><p>“I need not have another shot. Seven treasures glaze tile school little girl. You lose. You several still are too lacking. Even unable to resist for my one stick of incense of time. This is the disparity of actual strength.</p><br/><p>Hugging the soft like silk Xiao Wu, Tang San slowly raised his head, his black pupils without any emotion, completely abstruse.</p><br/><p>Holding Xiao Wu he slowly turned, walking in front of Ning Rongrong,</p><br/><p>“Could I trouble you, first help me take care of Xiao Wu a moment.”</p><br/><p>Ning Rongrong stared blankly a moment, removing her seven treasures glazed tile pagoda spirit, receiving Xiao Wu into her arms. Although her spirit was auxiliary nature, spirit masters all had spirit power, their bodies were naturally much stronger than ordinary people, holding Xiao Wu one girl counted as nothing.</p><br/><p>Having delivered Xiao Wu to Ning Rongrong, Tang San turned and walked towards Zhao Wuji.</p><br/><p>Zhao Wuji was stunned a moment,</p><br/><p>“What, you still want to continue? I’m afraid that you could not receive my attack even once. My second spirit ring ability Vigorous Vajra Palm can’t be so easy to withstand.”</p><br/><p>Zhao Wuji of course could not because that stick of incense had not completely burned out refuse these four children before him to enter Shrek Academy, in fact actually the opposite. The strength which these children displayed made him greatly pleasantly surprised. Not only did each one’s actual strength all have characteristics, but also under the prerequisite of not previously exercising together unexpectedly were able to coordinate with this implicit understanding. The limits of their future prospects could not be measured. With the Academy only were three students to compare, only strong or not.</p><br/><p>The reason his last words were a bit unkind, was hoping these children because of their talent would not come to be haughty, previously Shrek Academy was not at all without cases where because of pride lead to later strength progress being slow-moving. Zhao Wuji could not hope for these several good saplings before him to walk a crooked road. Only he didn’t expect, Tang San unexpectedly would walk back, alone being this courageous already made Zhao Wuji greatly admire him.</p><br/><p>Tang San shook his head, saying:</p><br/><p>“I am not at all asking to continue with your present exam.”</p><br/><p>Zhao Wuji somewhat disappointed said:</p><br/><p>“Then you are saying, you will concede?”</p><br/><p>Tang San again shook his head,</p><br/><p>“No, I hope I can with you fight earnestly one bout. Everything starting afresh. Please again ignite a stick of incense. If I persevere for one stick of incense of time, then, please permit us four to simultaneously enter Shrek Academy.”</p><br/><p>Zhao Wuji like smiling yet not smiling looked at Tang San, saying:</p><br/><p>“Then if you cannot persevere? Do not forget, just now you four people together, ultimately still lost.”</p><br/><p>Tang San could on his behalf make the decision, even could on behalf of Xiao Wu at present make the decision, but he could not substitute for the additional two. Turning his head to look at Ning Rongrong and Zhu Zhuqing.</p><br/><p>Currently, Zhu Zhuqing’s dislocated arms were already taken care of by Dai Mubai, herself also coming awake, only was breathing weakly, although unexpectedly remained at Dai Mubai’s chest, she at present was already without strength to stand up.</p><br/><p>Ning Rongrong slightly smiled towards Tang San,</p><br/><p>“Tang San, we are comrades in arms. From childhood my father instructed me, one cannot abandon comrades in arms. Worst comes to worst we will leave together, in any case we already failed the test. The imperial capital’s academy certainly will not reject us.”</p><br/><p>Tang San again looked towards Zhu Zhuqing, Zhu Zhuqing seemingly without strength to speak, but strongly bracing her body, nodded to Tang San.</p><br/><p>Even though today just was the first meeting, his comrades’ trust, as if bestowing Tang San incomparable strength. Turning around, once again facing Zhao Wuji,</p><br/><p>“If I lose, then we together will leave.”</p><br/><p>Zhao Wuji looked at the several children before him, the more he saw the more he liked, bursting into loud laughter saying:</p><br/><p>“Good, good, then let me have a look, what power you still possess to ward off my attack. As you wish.”</p><br/><p>Zhao Wuji once again ignited a stick of incense, sticking it in the ground.</p><br/><p>Tang San’s both feet stood in a not  not  stance, over the whole body power slowly condensing. Finally this time, he already did not plan to conceal his actual strength. Xiao Wu being wounded to unconsciousness to his mind brought about enormous provocation, deep in his heart he was even more brimming with self incrimination. As a big brother without protecting well his younger sister, if he could not on behalf of his little sister retrieve justice, then for what reason could he still be called big brother?</p><br/><p>Part 3</p><br/><p>Although it was the first time meeting Ning Rongrong and Zhu Zhuqing, their trust made Tang San resolve to let them see his true power. As for Dai Mubai, for some reason, regarding that compared to his own spirit power more formidable youth, Tang San from the beginning had a kind of trustworthy feeling.</p><br/><p>Tang San still deeply remembered Mysterious Heaven Treasure Record’s overall key lines, one forever must not try to disguise as a hog eating tiger, otherwise one very easily will really become the hog.</p><br/><p>Currently he only just completely understood the meaning of these words. If just now they faced not Shrek Academy’s teacher, but an enemy. Then, perhaps Xiao Wu would have found it very difficult to escape. And if his genuine unique skill still had not been used, wouldn’t it have become a lifelong regret? Therefore, Tang San resolved to no longer hide, he also realized this Motionless Bright King Zhao Wuji before him came to see what degree his actual strength actually reached.</p><br/><p>Without Seven Treasures Glazed Tile Pagoda amplifying strength and speed, Tang San clearly felt his body was a bit heavy, both arms slightly trembling, letting his body as soon as possible adapt to the current state of affairs. Simultaneously, both his hands already gradually became white, a white lustre like jade. Between the ten fingers, faint streams of qi seemingly moved. Head lowered, making the opponent unable to see his already completely turned purple pair of eyes.</p><br/><p>Zhao Wuji clearly felt Tang San’s body atmosphere have some slight transformation, clearly spirit power did not at all consequently strengthen, but he did not know why, at his Spirit Sage level actual strength he felt some danger.</p><br/><p>One twenty ninth ranked child unexpectedly would let him have a feeling of danger? Zhao Wuji somewhat disbelieving, pressed to use his first spirit ring ability Motionless Bright King Body, walking towards Tang San with large strides. His speed was not at all fast, but his pace was extremely steady, under each step, the ground would faintly tremble.</p><br/><p>“Teacher Zhao, take care.”</p><br/><p>Tang San suddenly ferociously raised his head, in his eyes a purple light abruptly rich and powerful, seeing his those purple eyes, Zhao Wuji was immediately startled, underfoot pace also slowing. After all, relying on eyesight confusion attacks, was among spirit abilities the most difficult kind to resist. Previously when clashing with Xiao Wu he nearly got the worst of it.</p><br/><p>But very quickly Zhao Wuji realized, in Tang San’s eyes the purple light did not at all have any attack effect. And at his this slowing. Tang San’s hands hanging on either side of his waist swiftly rose.</p><br/><p>Chichichichichichichichichichi……, Ten cold lights at Tang San’s both hands’ ten fingers lightly twirling burst forth, separately shooting towards Zhao Wuji’s eyes, shoulders, throat, heart, knees, genitals and abdomen. The ten cold lights’ attacking locations unexpectedly were not the same, furthermore aiming for all the vitals.</p><br/><p>The ear piercing air splitting sounds startled Zhao Wuji, in all his ability, nimbleness was his least expert kind, after spirit body enhancement, although his speed increased somewhat, because of the huge build, added to its astonishing defensive power, when facing enemies he would choose to the way of meeting force with force.</p><br/><p>To suddenly be confronted by the extremely accurate ten cold lights, Zhao Wuji reacted very quickly, a pair of bear paws one up one down, above obstructing his eyes, below obstructing his lower body. With a deep roar, on his whole body spirit power burst forth, Motionless Bright King Body’s full power pressed into use.</p><br/><p>Tang San after emitting the ten cold lights, body had not paused the slightest amount, using Ghost Shadow Perplexing Track, lightning quick retreating backwards.</p><br/><p>Ten cracking sounds echoed practically simultaneously, the ten cold lights pierced Zhao Wuji’s body, but in the tyrannical golden light, they all bounced back, and furthermore did not cause Zhao Wuji any harm.</p><br/><p>Tang San in his heart was secretly shocked, one must know, what he shot was ten Penetrating Bone Nails[3], among small scale hidden weapons, Penetrating Bone Nails weight was considered a heavy kind, again adding his internal strength’s urging to the Penetrating Bone Nail’s penetrating properties, unexpectedly still could not give Zhao Wuji a trace of an injury, one could clearly see how tyrannical Zhao Wuji’s defense was. Dai Mubai saying he completely lacked weak points, certainly had not been without justification.</p><br/><p>Figure turning, again throwing out an additional ten cold lights.</p><br/><p>Completely lacking weak points? In Tang San’s eyes flashed a trace of cold, possessing complete lack of weak points, in fact the whole body was a weak point. Only breaking one point, only was his opportunity location.</p><br/><p>In retreating, between Tang San’s hands like butterflies passing flowers generally throwing in front or shooting, together continuously shooting out cold lights from his hands, starting to specially search Zhao Wuji’s body for a vital spot.</p><br/><p>In Zhao Wuji’s heart the shock compared to Tang San was still bigger, it was still his first time encountering an opponent like this. If both sides’ actual strength had been equal, he knew he would already have lost. Tang San was shooting hidden weapons not only accurately, but also simultaneously attacking many different locations, dodging was extremely difficult.</p><br/><p>Willow Leaf Knife, Flying Locust Rock, Gold Coin Dart, Penetrating Bone Nail[4], a variety of hidden weapons blooming in Tang San’s Sky Filling Flower Rain[5] technique, flying straight, flying slanted, spiralling behind, but the final target was only one, that was Zhao Wuji’s body.</p><br/><p>Zhao Wuji clearly felt these hidden weapons extreme penetrating strength, if not at full strength operating Motionless Bright King Body, even he might very possibly be injured therein.</p><br/><p>However, undergoing high speed contact, Zhao Wuji also resigned himself to clearly feel out Tang San’s this hidden weapon attack power, whole body glittering with Motionless Bright King Body’s golden light, with large strides rushing over to Tang San.</p><br/><p>In a moment Zhao Wuji rushed at him, that enormous Vigorous Vajra Palm again lifted, he without the slightest trace of hurry. Underfoot becoming lightning quick withdrawal, Blue Silver Grass already spreading floating in the air, obstructing Zhao Wuji’s road forward.</p><br/><p>The tough Blue Silver Grass was completely insufficient to stop Zhao Wuji, but it was still able to delay him for a moment, omnipresent bindings, each time only a Blue Silver Grass hindered Zhao Wuji’s foot, already slowing down his speed, also as far as possible saving his internal strength.</p><br/><p>Relying on Blue Silver Grass and Ghost Shadow Perplexing Track, although Tang San’s absolute speed was not equal to Zhao Wuji’s, Zhao Wuji still was chasing after not on him, Vigorous Vajra Palm several times swatting empty air.</p><br/><p>Part 4</p><br/><p>But after Tang San fired the first round of hidden weapons, he also did not again continue with the hidden weapon attack, moving around the space, dodging Zhao Wuji’s attacks.</p><br/><p>The reason why Tang San asked for his one on one battle with Zhao Wuji, first was because fearing hidden weapons accidentally injuring the other people, second, also was because one person’s dodging space was even larger, also without any concerns.</p><br/><p>Right now, the surrounding several people spectating all looked somewhat straight, especially the period of time when on Tang San’s body hidden weapons were unceasingly flying out, in their hearts all full of astonishment. Whether it was Zhu Zhuqing and Ning Rongrong, or Dai Mubai. In their hearts all could not help but secretly feel a chill, they realized, if exchanging themselves for Zhao Wuji, perhaps, long ago already run away.</p><br/><p>Tang San’s hidden weapons were fantastic oddities of every description, flying routes also extremely weird, wanting to dodge, was really too difficult.</p><br/><p>Even if born from the Seven Treasures Glazed Tile School, experienced and knowledgeable Ning Rongrong still did not know his hidden weapons were classified as what clan’s attack method. But completely able to feel these hidden weapons’ power.</p><br/><p>Incense unwittingly burning, this moment, already burned down by one third of its length.</p><br/><p>Zhao Wuji chasing Tang San suddenly stopped his feet, smiling scolding:</p><br/><p>“Fine you little monkey, still truly slippery. Want to delay like this? Can’t be that easy. Third spirit ring ability, Gravity Increase.”</p><br/><p>The third spirit ring on Zhao Wuji’s body, a purple thousand year spirit ring abruptly magnified, but it was not an ability infused within his body, but was floating downward, directly merging into the ground.</p><br/><p>Suddenly, Tang San only felt his legs seem to sink into a swamp, body abruptly becoming heavy, as if his body weight had increased to twofold. But Zhao Wuji clearly did not suffer a shadow, with big strides dashing towards Tang San, in his eyes bringing a faint smiling expression, seeming to say, ‘I would see where you still will run now’.</p><br/><p>A truly powerful spirit ability. Under the effect of gravity, Tang San’s speed clearly dropped, even though Ghost Shadow Perplexing Track steps were exquisite, under the influence of gravity again dodging Zhao Wuji’s attack already was somewhat pulling the lapels exposing the elbows[6]. Several times dangerously avoiding Zhao Wuji’s Vigorous Vajra Palm.</p><br/><p>Zhao Wuji glanced at the burning incense, the incense had already quickly burned halfway. In his heart also could not help but be somewhat anxious.</p><br/><p>His majestic Motionless Bright King, handling one just twelve years old child unexpectedly was this strenuous, if this spread to the other teachers’ ears, how couldn’t he become a laughing stock? If this child was stopped. However, this exam also should be finished then.</p><br/><p>Thinking of this, on Zhao Wuji’s body the fourth spirit ring also lit up.</p><br/><p>Purple light glittering, making people wonder was, on Zhao Wuji’s body the fourth spirit ring unexpectedly flew out, like it was a long loop, overtaking Tang San’s body, directly covering him.</p><br/><p>What was the meaning of this? Tang San’s heart was cold. But after this purple thousand year light ring covered his body, it did not give him any unwell feeling.</p><br/><p>Zhao Wuji laughed loudly,</p><br/><p>“Should be time to finish, able to force me to use my fourth spirit ring, you are qualified to enroll.”</p><br/><p>Speaking, he that sturdy pair of legs abruptly used strength, entire person jumping off the ground.</p><br/><p>Tang San hurriedly shifted his location, but he shocked discovered, that jumping in midair Zhao Wuji unexpectedly followed his movement and direction, still coming in his direction.</p><br/><p>He did not know that this was Zhao Wuji’s fourth spirit ring ability, Position Trace. In a short time of his fourth spirit ring locking on, then, within a hundred metres, he all could rely on jumping strength to in a flash pull into close range.</p><br/><p>This ability to others cultivation patterns Spirit Masters point of view might not be of any use, but to physical strength type Zhao Wuji it was not merely useful. Relying on Position Trace to pull close to his opponent, his physical strength and attack had the biggest room to develop. To as quickly as possible end the battle, he just simply used this ability of his.</p><br/><p>In Tang San’s eyes released a cold light, apparently, his plan could only advance.</p><br/><p>Soon unable to hide from Zhao Wuji’s falling body, he simply no longer dodged. In a moment Zhao Wuji dropped towards him, he immediately launched his second spirit ring ability, Parasite.</p><br/><p>When previously Blue Silver Grass obstructed Zhao Wuji’s advancement, parasitic seeds already stealthily nestled on Zhao Wuji’s body, by now abruptly unleashed, suddenly appeared Blue Silver Grass immediately in midair sturdily binding Zhao Wuji.</p><br/><p>The timing Tang San chose for unleashing Parasite was perfect, just the moment Zhao Wuji was about to fall to the ground, like this, Zhao Wuji was unable to after hitting the ground to first launch an attack.</p><br/><p>Tang San’s both hands simultaneously rose, only hearing clanging sounds simultaneously rising, six cold lights spit out from within his sleeves, powerful crossbow bolts created ear piercing air splitting sounds, shooting straight for Zhao Wuji’s face.</p><br/><p>Athough Zhao Wuji’s defensive strength was powerful, these suddenly appearing crossbow bolts still startled him, Motionless Bright King Body in a flash unleashing. Loud peng sounds. Within the spreading golden light, not only struggling free of Blue Silver Grass bindings, also repelling the six crossbow bolts shot towards him.</p><br/><p>What was Tang San’s most expert skill? At least until now, it absolutely was not hand thrown type hidden weapons, just what he studied all his previous life was mechanism type hidden weapons.</p><br/><p>The sudden start from the crossbow bolts made Zhao Wuji’s body break out in cold sweat, although his Motionless Bright King Body could repel the crossbow bolts, the crossbow bolts force of impact was extremely painful on his face, it could clearly be seen how powerful the force of the bolts was.</p><br/><p>Simultaneously using Controlling Crane Catching Dragon, drawing support from the impulse released by Zhao Wuji’s Motionless Bright King Body, Tang San’s body once again leapt back, staying out of range of Zhao Wuji’s empty slap.</p><br/><p>Restraining within both arms, chest muscles flexing, a buzzing sound immediately echoed from Tang San’s stomach. Glittering like frost and snow a steel needle brought a thick fog puffing out from Tang San’s stomach, just right to meet the charging Zhao Wuji.</p><br/><p>Tang San could also be considered the great master of a generation in mechanism type hidden weapons, the mechanism type hidden weapons he made could not need any power switch, relying on muscle contraction to start. Impossible to defend against.</p><br/><p>Part 5</p><br/><p>The tea fragrant mist made Zhao Wuji’s brain dizzy, Motionless Bright King Body’s defense naturally also dropped a bit. At this moment, Zhao Wuji clearly felt his chest ache. Lowering his head to look, horrified discovered, that steel needle fired from Tang San’s chest unexpectedly penetrated his Motionless Bright King Body’s defense, fully piercing his chest.</p><br/><p>A paralysingly painful feeling in a flash transmitted via the nerves to Zhao Wuji’s brain.</p><br/><p>“Poisoned.”</p><br/><p>Zhao Wuji in his heart was shocked. Hurriedly once again pressing his Motionless Bright King Body, forcing the steel needle to jolt outside his body. But, the poison already transmitted within his body by the double effect of breath and blood.</p><br/><p>Tang Sect could not only be about hidden weapons, Tang Sect’s poison was equally absolute. Even though Tang San these several years had not any chance to gather poisonous substances, he could not waste that original Datura Snake from the Datura Snake venomous fangs for use on that hidden weapon on his stomach, at the crucial moment, displaying its biggest effect. On his stomach this hidden weapon, also was on his body one of very few kinds of hidden weapons capable of breaking Body Protecting Big Dipper Tail Qi. Called Powder Shooting Shadow[7].</p><br/><p>Of course, Zhao Wuji’s Motionless Bright King Body defensive power was too strong, Powder Shooting Shadow’s sixty four steel needles also only could with difficulty puncture his skin, nothing more.</p><br/><p>But like this was already sufficient. Datura Snake’s speed although not sufficient to make Zhao Wuji lose capability to resist, forced him to divide spirit power to block the poison from spreading. This gave Tang San even more time to catch his breath.</p><br/><p>However, Zhao Wuji’s pause did not at all let Tang San continue running, he on the contrary met Zhao Wuji’s charge face to face. Ten fingers simultaneously ejecting, ten minute golden rays flashed through the air. If not watching attentively, one would even be unable to discover their existence.</p><br/><p>As a hidden weapons master, with certainty shooting hidden weapons timing naturally was extremely important, Tang San undoubtedly accomplished this bit, the time he chose was just while Zhao Wuji urged Motionless Bright King Body to jolt out the steel needle, for a moment defensive power was weak.</p><br/><p>Relying on Purple Demon Eye to see clearly, Tang San was not only able to see clearly the opponent’s every move, he was even able to see around Zhao Wuji’s body spirit power’s fluctuating intensity. Otherwise how could he also in this way just perfectly look for the opponent’s weak points? This was Purple Demon Eye’s biggest effect.</p><br/><p>Ten golden hair rays force had penetrated Motionless Bright King Body’s defense and quietly engraved on Zhao Wuji’s body, boring within.</p><br/><p>Zhao Wuji only felt numerous simultaneous stinging pain reach his body, to his strong mental state, still could not help but draw in a breath, sore whole body spasming.</p><br/><p>“You……”</p><br/><p>Zhao Wuji somewhat angrily, on his lips emitting a low howl, the fifth spirit ring, that glittering deep black spirit ring abruptly shone. An intense bellow made the entire Shrek Academy shudder.</p><br/><p>Tang San only felt all around simultaneously an immense sound pressure, his body uncontrolledly rising towards Zhao Wuji, from his body’s surroundings the sound pressure seemingly must force his body to break into pieces, this power already was not something he was capable of contending with.</p><br/><p>Zhao Wuji’s Vigorous Vajra Bear spirit’s fifth spirit ability, Gravity Crush[8].</p><br/><p>Did Tang San surrender like this? Of course not.</p><br/><p>He sharply lowered his head, following a crisp crackling bursting sound, an extending seven cun[9] crossbow bolt from his back abruptly shot out, shooting straight for Zhao Wuji’s bellowing mouth. Under circumstances where he himself was already controlled by the other side, still able to maintain such accuracy, making people gasp in amazement.</p><br/><p>Tense Back Flower Adornment Crossbow[10], a medium sized crossbow bolt. Shot with back muscle control. Only had one shot. But because the crossbow bolt was big, mechanism’s elastic force excessive, the destructive force among mechanism type hidden weapons belonged to the extremely powerful. By far could not be compared to Sleeve Darts.</p><br/><p>Simultaneously, Tang San’s both feet knocked together, on the tip of each foot stretched out a three cun long sharp blade, one flying kick towards Zhao Wuji’s throat, another only following noiselessly to kick at his lower vitals, under these disadvantaged circumstances, he still could respond by putting out such attacks, absolutely regarded as terrible.</p><br/><p>Tense Back Flower Adornment Crossbow’s launch speed was incomparably fast, Zhao Wuji did not even have time to raise his hands, Motionless Bright King Body’s defense forcefully passed through by the crossbow bolt, shooting straight for his mouth.</p><br/><p>In a desperate situation, Zhao Wuji displayed the formidable combat experience of a Spirit Sage, not at all frantic, his teeth closed, just in time to bite Tense Back Flower Adornment Crossbow’s bolt in his mouth.</p><br/><p>Tense Back Flower Adornment Crossbow’s force of impact was extremely tyrannical, although Zhao Wuji bit it to a stop, his teeth by the shock loosened. Simultaneously, a sweet fragrance transmitted in his mouth from the crossbow bolt, managing to immediately make his brain go dizzy a spell.</p><br/><p>Tense Back Flower Adornment Crossbow only had one bolt, how could Tang San possibly not do the above? The crossbow bolts hollow interior, inside contained a little bit of Datura Snake venom, once the bolt entered the enemy’s body, venom would immediately inject. Although currently the crossbow bolt had not pierced Zhao Wuji’s body, Zhao Wuji’s teeth also gave it sufficient pressure effect, this mouthful of venom, also naturally unrestrained delivered to him.</p><br/><p>“Pah!”</p><br/><p>Zhao Wuji spat out the mouthful of crossbow bolt, simultaneously both hands warding above and swatting down, resolving Tang San’s two legged attack, currently, Tang San already squeezed before him.</p><br/><p>“Are you a hedgehog?”</p><br/><p>Zhao Wuji snarled. However, because of eating the mouthful of Datura Snake venom, his tongue was a little numb, speech somewhat inarticulate.</p><br/><p>Let alone after entering Shrek Academy, even if previously when mixing in the Spirit Master realm, he also had not eaten such a loss. An ominous glint momentarily flickered in his eyes, about to flare up.</p><br/><p>However, Tang San’s attack still had not completely concluded, at some time, in his left hand suddenly appeared a hammer, a pitch black small hammer. After Zhao Wuji blocked his legs, the left hand’s hammer smashed towards Zhao Wuji’s face.</p><br/><p>[1] ()</p><br/><p>[2] ()</p><br/><p>[3] ()</p><br/><p>[4] 、、、</p><br/><p>[5] </p><br/><p>[6] Idiom: Unable to make ends meet.</p><br/><p>[7] () “Containing Powder Shooting Shadow”, but it’s also an idiom for attacking someone by innuendo.</p><br/><p>[8] () “Gravity Squeeze” is less impressive.</p><br/><p>[9] 7 = 23.3 cm</p><br/><p>[10] ()</p><br/>\n</div>"}