{"title": "Chapter 18", "id": 18, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-18", "volume_title": "Volume 1", "body": "<h1>Chapter 18</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 18</p><br/><p>Motionless Bright King Zhao Wuji</p><br/><p>Part 1</p><br/><p>Hearing Dai Mubai’s words, the four people following him were silent for a time, it was still Xiao Wu who couldn’t help but first open her mouth,</p><br/><p>“You are picking students like picking a wife. This also is too strict. It’s no wonder that teacher at the entrance said only monsters are accepted here. People able to pass these four exams, maybe also only are monsters. I very much want to ask once, how many students does Shrek Academy currently have? Every year recruits how many students?”</p><br/><p>This time it was Dai Mubai’s turn to show a wry smiled.</p><br/><p>“Our Shrek Academy from founding until now, in twenty years, has altogether enrolled forty two students. An average year has a little more than two students. This year all four of you might be recruited, which must be considered setting a record. Before this, the Academy already had two years without accepting any students. Currently, in the academy in the process of studying students counting me altogether are still three.”</p><br/><p>“Three?”</p><br/><p>Apart from the ice cold young lady, Tang San, Xiao Wu and that beautiful young lady practically cried out simultaneously.</p><br/><p>Dai Mubai laughed mockingly at himself,</p><br/><p>“In the entire Douluo Continent, we can be considered as the only Academy where there are more teachers than students. Even after enrolling you, our Academy’s students numbers will in no way surpass the teachers.</p><br/><p>Tang San said:</p><br/><p>“Like this, how can the Academy continue existing? Without a supply of students, it should be without income.”</p><br/><p>Dai Mubai said:</p><br/><p>“Why else do you think the Academy would be such a small village? It’s because of the lack of funds. If not for my home still sponsoring some, the Academy might have closed down last year. If this year again was without recruits, then, us three people studying, would be Shrek Academy’s last students.”</p><br/><p>“Then why did the Academy not relax some when people tested to apply? The applicant people I saw also could not be regarded as few.”</p><br/><p>The gentle and beautiful young lady said doubtfully.</p><br/><p>Dai Mubai exposed a reverent expression,</p><br/><p>“The Dean said, better to have nothing, no matter when, even if it meant closing Shrek Academy, than to accept rubbish. Only monsters. You know what the Academy’s graduation requirements are? This is already not an intermediate spirit master academy, nor an advanced spirit master academy. Because our requirements are different from theirs. We only want students thirteen years old or under, who also must be true genius. But the Academy’s graduation requirements, are to exceed fortieth rank, and moreover before being twenty years old exceeding fortieth rank, attaining spirit ancestor level just to permit graduation.”</p><br/><p>“The Academy in total has enrolled forty two students, but truly graduating, only has fourteen people. After these fourteen people left the academy, not one was a person unable to receive worldwide attention. Among them are the most remarkable, right now already Spirit Hall’s youngest elder, authority and prestige second only to the pope. The rest who did not graduate, were unable to before twenty years of age attain fortieth ranked cultivation or were killed while hunting spirit beasts. The Dean said, insufficient to reach forty first rank, must not go out and make him lose face.”</p><br/><p>Saying this last part, Dai Mubai’s mood clearly became excited, concerning that Shrek Academy’s dean, he clearly was extremely reverent.</p><br/><p>Tang San smiled, saying to Dai Mubai:</p><br/><p>“I’m very glad, to be able to come here.”</p><br/><p>Dai Mubai sighed, saying:</p><br/><p>“Balak Kingdoms royal family originally planned to sponsor the Academy, but demanded the Academy’s graduates must swear fealty to the royal family, and were immediately refused by the Dean. Our Shrek Academy is also incompatible with other academies, in no small measure pushed aside, therefore just becoming this current appearance.”</p><br/><p>Tang San suddenly found, he very much longed for being able to meet that dean Dai Mubai spoke of, he very much wanted to see, after all what kind of person, was able to for twenty years continuously persist in establishing this kind of academy.</p><br/><p>“We’ve arrived.”</p><br/><p>Dai Mubai halted his steps. By now, they had reached another open space. This compared to that previous second exam location was much smaller, only two hundred square metres or so. One looking like he was over fifty years old middle aged man sat napping on a chair.</p><br/><p>“Teacher Zhao, I’m bringing people to take the fourth exam.”</p><br/><p>“En? This year there is a fourth exam? Unexpectedly it’s still four people.”</p><br/><p>The middle aged man opened hazy sleepy eyes, somewhat surprised looking at the four male and female youths before him, as if coming across some manner of inconceivable affair.</p><br/><p>Dai Mubai said:</p><br/><p>“Not only are there four people for the fourth exam, but they still also were all excused from the second and third tests.”</p><br/><p>Teacher Zhao’s eyes shone, standing up from the chair, his stature was not tall, and appearance very ordinary. But looking extremely rugged. Compared to twelve years old Tang San he still was somewhat shorter in height but unexpectedly gave people a majestic feeling.</p><br/><p>Wide shoulders resembling city walls, jacket basically unable to cover his whole body that was like cast from steel full of powerful muscles, although the expression on his face was amiable, the sturdy stature virtually gave people a kind of intense pressure.</p><br/><p>“Four surpassing twenty fifth rank, not bad, not bad, apparently this year there are not few little monsters. Mine is the last hurdle, passing my trial, you will be able to formally become members of Shrek Academy. However, my trial cannot be so simple to pass. Real combat experience is necessary for every spirit master to possess. What I examine, is your capability in this respect.”</p><br/><p>Smiling his gaze swept from Tang San across the others, mildly looking at them,</p><br/><p>“I’m called Zhao Wuji[1], since you four are all excused from the second and third exams, I will personally accompany you to play. Right now I give you one stick of incense of time to come to a mutual understanding and discuss. After one stick of incense, the test begins. The test contents, are for the four of you together to withstand my attack for one stick of incense of time. With only one person able to persevere to the end, it counts as you all passing. I hope you understand, don’t try cheap tricks, there are no people able to use speed to escape this range. At the same time, I can also advise you, relying on one person’s power to obstruct my attack is also impossible. Mutually coordinating together is your only chance of success.”</p><br/><p>Part 2</p><br/><p>“Teacher Zhao, this is not so good.”</p><br/><p>Dai Mubai hesitatingly said.</p><br/><p>Zhao Wuji started at him, saying:</p><br/><p>“What isn’t good. The dean’s not here, in the Academy I’m the greatest, what I say is good is good. Good, I will light the incense. Your time is not much, make your preparations. Little Bai, you also can also tell them about my strength’s properties, let them have a little preparation.”</p><br/><p>Having spoken these lines, from somewhere he pulled out a stick of incense, fingers pinching over the tip of the incense, unexpectedly directly igniting the incense, in an instant, the incense was already stuck in the ground, and moreover did not have the slightest tremble.</p><br/><p>Having finished this, Zhao Wuji again sat back down on his chair closing his eyes to continue sleeping.</p><br/><p>Tang San’s four had not had any particular feeling because of this teacher Zhao’s suggested testing method, on the contrary Dai Mubai’s face was solemn, towards the four saying:</p><br/><p>“You come over here a bit.”</p><br/><p>The four crowded at his side.</p><br/><p>Dai Mubai said with a grave expression:</p><br/><p>“This time I also am unable to help you. Didn’t expect teacher Zhao to suddenly personally do this.”</p><br/><p>Xiao Wu smiling said:</p><br/><p>“This teacher Zhao could not also be like that old man by the gate, a spirit emperor level strength.”</p><br/><p>Dai Mubai shook his head, saying:</p><br/><p>“No.”</p><br/><p>Xiao Wu smiling said:</p><br/><p>“Then don’t worry. How to say, we four also all have close to thirtieth ranked strength, with four to one, as long as strength gap is not too wide, don’t tell me one stick of incense of time won’t do?”</p><br/><p>Dai Mubai looked at her, expression a bit like he was looking at an idiot,</p><br/><p>“If you think teacher Zhao is that good at holding back his attack, then then you’re gravely mistaken. Correct, teacher Zhao certainly isn’t a sixtieth ranked layer spirit emperor grade spirit master, he is a seventy sixth ranked spirit sage. Beast spirit, battle spirit sage. He is the academy’s deputy chairman, composite strength second only to the Dean.”</p><br/><p>Tang San’s four people’s pupils practically contracted simultaneously, seventy sixth ranked? In their impression, let alone the less than thirtieth ranked them, even if it was confronting a ten thousand man army, a spirit sage level spirit master was still able to move unhindered with ease.</p><br/><p>Xiao Wu not daring to believe said:</p><br/><p>“He is seventy sixth ranked? But compared to that gate old man he looks much younger.”</p><br/><p>Dai Mubai calmly said:</p><br/><p>“Age can never completely represent the issue. There’s not much time, I simply tell you teacher Zhao’s expert abilities, afterwards you must immediately design a strategy to counter him, otherwise, let alone one stick of incense, being able to withstand his first attack counts as not bad.”</p><br/><p>Tang San’s four peoples’ expressions became solemn, facing a seventy sixth ranked spirit sage level, that could not be a joking amusement.</p><br/><p>Tang San who was from Holy Spirit village had the legends of a spirit sage, that only was legends, nothing more, but before his eyes this spirit sage was near now, and also still became their test advancement examiner.</p><br/><p>Dai Mubai said with a wry smile:</p><br/><p>“Originally teacher Zhao only was the proctor responsible for the fourth test, nothing more, your adversary should be me. Only must be able to endure my attacks for one stick of incense of time, considered passing. But who knew today he would be that abnormally strung, unexpectedly would personally put his hand to it.”</p><br/><p>“Teacher Zhao’s spirit is a Vigorous Vajra Bear[2], it’s a kind of powerful beast spirit. The whole body does not have any weakness, defensive power is extremely terrifying, even if it was a spirit master of the same level, would still be very difficult to cut open his defense to cause him harm. Even though speed is not what teacher Zhao is expert in, between you and him the spirit power gap really is too big, in this respect also cannot compare to his even higher speed. Teacher Zhao’s most is powerful in physical attack power and defense power. In the Academy he’s nicknamed Motionless Bright King. Let alone you four, even if adding me, still might not be able to obstruct his attack for one stick of incense, right now I only hope teacher Zhao when attacking you will not take it so seriously.”</p><br/><p>Has no weak point. Four simple words already declared Zhao Wuji’s formidable area.</p><br/><p>The short haired beautiful young lady suddenly cried out,</p><br/><p>“He unexpectedly is Motionless Bright King Zhao Wuji. On the Continent missing for ten years, didn’t expect him to be a teacher at Shrek Academy. Originally, Motionless Bright King Zhao Wuji with Spirit Hall had a disagreement, Spirit Hall wanted to punish him, but he simply rushed through from within sixteen bishops’ siege. Afterwards that matter also was left unsettled. Spirit Hall’s bishops, are all at least sixtieth ranked or more spirit emperor level, that time Zhao Wuji should also only have been sixty something ranked. Right shouldn’t he be more difficult to deal with.”</p><br/><p>Dai Mubai silently nodded, saying:</p><br/><p>“At least, I never saw teacher Zhao’s appearance at all his strength. Therefore, you hope for the best. Among teacher Zhao’s seven spirit rings, the first two are hundred year spirit rings, the third spirit ring and the fourth spirit ring are thousand year, the later three spirit rings are entirely ten thousand year. And also, the seven spirit rings are adding both attack and defense. You should be able to imagine his frightfulness. Right now, you first get familiar with each other, announcing your names and abilities, having a look how you should best match abilities to withstand Zhao Wuji’s exam.”</p><br/><p>Tang San first opened his mouth,</p><br/><p>“I’m Tang San, tool spirit blue silver grass, twenty ninth ranked control system battle spirit master.”</p><br/><p>Xiao Wu looking at Tang San speaking, second said:</p><br/><p>“Xiao Wu, beast spirit rabbit, twenty ninth ranked assault system spirit master.”</p><br/><p>The level with her ears short hair young lady hesitated a moment, then spoke:</p><br/><p>“Ning Rongrong[3], tool spirit seven treasure glazed tile pagoda, twenty sixth ranked auxiliary system spirit master.”</p><br/><p>Finally the ice cold young lady as before cold and detached, indifferently said:</p><br/><p>“Zhu Zhuqing[4], beast spirit hell civet[5], twenty seventh ranked agility attack system spirit master.”</p><br/><p>Just as the four people left their introductions, including Dai Mubai, among the four people’s gazes focused on one person. This person attracting the other’s attention, was that short hair young lady Ning Rongrong.</p><br/><p>Tang San shocked said:</p><br/><p>“Your spirit is seven treasure glazed tile pagoda. That means, you come from the Seven Treasure Glazed Tile School?”</p><br/><p>Seven treasure glazed tile pagoda this kind of spirit according to legend, on the entire Douluo Continent, could only be possessed by children directly related to the Seven Treasure Glazed Tile School.</p><br/><p>Part 3</p><br/><p>Master of that seven treasure glazed tile pagoda this tool spirit could be evaluated with only simply one line: In all the Continent, the most formidable auxiliary tool spirit. The best companion for all fighting system spirit masters.</p><br/><p>Among Spirit Hall’s six signs, not among the three signs on Grandmaster’s token tile, among them was the seven treasure glazed tile pagoda.</p><br/><p>Ning Rongrong stuck out a cute little tongue, saying:</p><br/><p>“Don’t stare, I’m no different from ordinary people. I’ve stealthily run away from home. Let’s first speak of our present test again. My spirit is seven treasure glazed tile pagoda, two spirit rings. Able to variously increase everyone’s speed and strength attributes. Amplification about thirty percent. Sustaining until one stick of incense goes out is no problem.”</p><br/><p>Thirty percent amplification, this already was a considerably good number, but Tang San knew, the reason Grandmaster named this seven treasure glazed tile pagoda the most powerful auxiliary system spirit existence, was because of for every spirit ring upgrade, not only able to evolve the upgrade of a kind of attribute, simultaneously, still would allow each preceding spirit ring’s attribute upgrade to increase ten percent again.</p><br/><p>Also to say, if Ning Rongrong’s spirit power attained thirtieth rank or above, not only could she increase one more type of attribute, but also the possessed attribute amplification effects would become forty percent. And so on. At seventieth rank able to in a moment increase seven types of attributes by eighty percent. It was this kind of terrifying effect.</p><br/><p>If having this kind of seven treasure glazed tile pagoda spirit master auxiliary, practically could by itself in a moment double their actual strength. Regarding surpassing strong spirit masters, seven treasure glazed tile pagoda’s amplification effect was in that case even higher.</p><br/><p>In either of the two heavenly imperial regions, only having Seven Treasure Glazed Tile School’s spirit masters appear, immediately all would become a spirit master organization fighting for the goal. Receiving ten thousand peoples’ attention.</p><br/><p>Fortunately, seven treasure glazed tile pagoda’s amplification effect did not stack, in other words, if having two seven treasures glazed tile pagoda spirit masters, the amplification would only be according to the effect of the highest spirit power.</p><br/><p>Seven treasures glazed tile pagoda’s biggest weak point was having no firepower, requiring gathering battle spirit masters to defend. But volunteers to become seven treasure glazed tile pagoda’s protector was definitely not few. Among them including at least two among spirit masters top level existences, title Douluo. On the entire Continent, seven treasure glazed tile school was absolutely ranked in the top three schools.</p><br/><p>As for what kind of amplification effect would emerge on seven treasure glazed tile pagoda finally reaching eightieth rank and ninetieth rank, only their school’s inner core members were able to know. All along it was Seven Treasure Glazed Tile School’s biggest secret.</p><br/><p>Dai Mubai drew a deep breath, saying:</p><br/><p>“You four’s matching is contrary to what one might expect pretty good, without duplicate system spirits. How to resist teacher Zhao’s attack, you decide on your own.”</p><br/><p>Tang San considered, saying:</p><br/><p>“Ning Rongrong is in charge of supporting us three, then, Xiao Wu is in charge of the main assault, I’m in charge of controlling teacher Zhang’s attack, restricting him as far as possible, simultaneously supporting Xiao Wu’s frontal charge. Zhu Zhuqing, I’ll trouble you with the flank, relying on your speed to pin him down.”</p><br/><p>Xiao Wu and Ning Rongrong nodded, Zhu Zhuqing looked at Tang San, and finally also nodded slightly, having agreed with his proposal.</p><br/><p>Within this short time, they could only use this kind of simple tactics. As for the result, they could only use actual combat to test it. No matter how to put it, they all had never run into such a formidable opponent, the opponent’s strength reaching what degree they still could only fight to find out.</p><br/><p>“Discussion is over.”</p><br/><p>Zhao Wuji’s resonant voice resounded, the four people turned to look, that stick of incense on the ground had already burnt to the end.</p><br/><p>“Teacher, we can begin.”</p><br/><p>Dai Mubai nodded towards Zhao Wuji, quickly stepping back to spectate on the side. Even though this was an abnormal fight, to see Zhao Wuji put out his skill, as a strength domination type of spirit master, he naturally would not let slip this learning opportunity.</p><br/><p>Zhao Wuji once again stood up, both hands grasping each other, loosening his wrists, creating repeated sounds of cracking bones making peoples’ teeth ache, the intangible pressure suddenly increasing even more.</p><br/><p>Zhao Wuji in his hand once again held out a stick of incense, without waiting he ignited it, Ning Rongrong already taking the lead for action.</p><br/><p>“Seven treasures glazed tile pagoda.”</p><br/><p>Body floating in the air spinning all the way around, dazzlingly beautiful seven colored light immediately released from inside her body, only seeing that seven colored light condensing, within Ning Rongrong’s right palm already sat a one cun[6] tall seven colored pagoda.</p><br/><p>The treasure’s light flickering, noble air pressing, Ning Rongrong wore a slight smile, entire person looking to float in the air like an immortal. Two yellow spirit rings rose up from underneath, quietly hovering around her body.</p><br/><p>“Seven treasure words, first spoken: Strength.”</p><br/><p>The first spirit ring rose up, enveloping the seven colored pagoda, at Ning Rong Rong’s left hand’s directions, three streams of bright light simultaneously shot out, separately enveloping the bodies of Tang San’s three people.</p><br/><p>Immediately, a warm energy bubbled up from the four limbs hundred bones, three people suddenly felt like their whole bodies were brimming with strength, spirit power continuously rushing up within like it was boiling.</p><br/><p>Zhao Wuji somewhat shocked looked at Ning Rongrong,</p><br/><p>“Man, among this year’s examinees there’s unexpectedly one of the seven treasures glazed tile clan. Pretty good, pretty good, that old ghost Flender[7] must be excited this time.”</p><br/><p>While speaking, he effortlessly threw the already ignited incense in his hand, sticking in the ground.</p><br/><p>“Seven treasure words, second spoken: Speed.”</p><br/><p>Again three streams of bright light floated out, Ning Rongrong’s second spirit ring also displayed its effect.</p><br/><p>The body’s lightness made Tang San feel like he had lost his weight, in his heart secretly gasping in admiration, seven treasures glazed tile pagoda sure enough was not named in vain, worthy of being called the first spirit in auxiliary system. Speed and strength simultaneously increasing thirty percent, immediately made him feel like his power had greatly increased.</p><br/><p>Right at this time, Zhao Wuji moved, not at all rushing over towards Tang San’s four people, instead both legs half crouching, both fists simultaneously pounding the ground.</p><br/><p>Part 4</p><br/><p>“Not good.”</p><br/><p>Tang San cried out, the moment Zhao Wuji started his attack, he already understood what the opponent would do.</p><br/><p>Grandmaster once said, if one day encountering an opponent from Seven Treasures Glazed Tile School, then, within the first moment, must first dispose of the Seven Treasures Glazed Tile School spirit master.</p><br/><p>Zhao Wuji’s attack clearly was not directed at Ning Rongrong alone, but this area attack of his clearly was for the purpose of first interrupting Ning Rongrong’s seven treasures glazed tile pagoda auxiliary effect.</p><br/><p>One blue and black long vine abruptly flew out, on the vine were not sharp thorns, because it only had the effect of Tang San’s first spirit ring, the long vine twisting like lightning around Ning Rongrong’s waist, Tang San simultaneously leaping up himself, also bringing Ning Rongrong’s body into the air.</p><br/><p>With a dull rumbling sound, the earth shook violently, a wave of yellow earth abruptly released along the ground towards Tang San’s four people.</p><br/><p>Xiao Wu and Zhu Zhuqing responded very quickly, Xiao Wu jumping ahead, Zhu Zhuqing leaping to the side, simultaneously sweeping past the quake, Tang San jumped at practically the same time as Xiao Wu, including jumping</p><br/>\n</div>"}