{"title": "Chapter 17", "id": 17, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-17", "volume_title": "Volume 1", "body": "<h1>Chapter 17</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 17</p><br/><p>Academy Only For Monsters</p><br/><p>Part 1</p><br/><p>Between spirit masters, spirit rings were eternally the best word of authority, seeing that one thousand year spirit ring among three spirit rings on Dai Mubai’s body, the youngster’s father’s complexion changed greatly, and leaving behind a sentence regarding ‘our bad luck’, pulled his son and quickly left.</p><br/><p>Dai Mubai returned to his seat, evil eyes sweeping over the youngsters and parents there for signing up, threatening meaning abundantly clear. The oppressive force produced by the three spirit rings could not be endured by ordinary people. The current him was no longer like a wealthy spendthrift, but on the contrary like a hired thug.</p><br/><p>After this scene, the lined up waiting people immediately reduced by a third, who still wanted to spend money in vain, let alone, when this Shrek Academy exterior before them made people not dare compliment.</p><br/><p>Again an applicant youngster came before the old man, he was followed by both parents, his mother full with confidence placing ten gold coins in the wooden chest, the youngster smartly extending a hand.</p><br/><p>The old man kneaded his hand, faintly yellow gaze looking at the youngster, saying:</p><br/><p>“Exactly twelve years old. Release your spirit, let me have a look.”</p><br/><p>The youngster nodded, faint green spirit power releasing from within his body, a hundred year spirit ring rhythmically hovering up and down his body.</p><br/><p>The hundred year spirit ring’s atmosphere was not weak, spirit appearing, a crude long vine spiralling around his body.</p><br/><p>This spirit somewhat resembled Tang San’s blue silver grass, only, his spirit was not a grass, but directly was a vine, similar to Tang San’s second spirit ring’s ghost vine, merely lacking the ghost vine’s poison.</p><br/><p>The old man shook his head, saying:</p><br/><p>“Not qualified, you can leave.”</p><br/><p>The youngster’s parents’ originally filled with confidence expressions, hearing the old man say their child was not qualified, the expressions on their faces immediately froze, his mother couldn’t help but ask:</p><br/><p>“Why? My son in primary spirit academy was a student of great ability. Did you not see his spirit ring is a hundred year? Spirit masters possessing a hundred year spirit ring can not be many.”</p><br/><p>The old man indifferently said:</p><br/><p>“The first spirit ring being a hundred year spirit ring is naturally pretty good, only, he is only an ordinary person.”</p><br/><p>The youngster’s father frowning said:</p><br/><p>“I do not get your meaning.”</p><br/><p>The old man somewhat impatiently got up from behind the desk, not only facing the youngster’s parents before him, but simultaneously also towards the applicants lining up behind them saying:</p><br/><p>“Coming to our Shrek Academy, you should first be clear on the regulations. Without being clear and coming here, you are only delivering the registration fee in vain, nothing more. Right now there is still time to regret. Do you not know the meaning of ‘Shrek’ in our Shrek Academy?”</p><br/><p>The majority of the applicants on hearing the old man’s words had blank expressions.</p><br/><p>The old man coldly said:</p><br/><p>“Shrek is a kind of monster, even among spirit beasts it is still an odd existence. Our Shrek Academy’s meaning, is an academy only for monsters. One could also say, we only accept monsters, do not accept ordinary people. If age surpasses thirteen years of age, or spirit power does not reach over the twentieth rank, need not waste time here.”</p><br/><p>Tang San originally was of the same mind as Xiao Wu, regarding the Shrek Academy somewhat disappointed, but hearing this old man’s words, the interest in his heart ticked up, an academy only for monsters? The other meaning of this word ‘monster’, wasn’t that genius?</p><br/><p>While speaking, the old man’s body suddenly released an incomparably tyrannical atmosphere, with Tang San and Xiao Wu’s strength both could not help but shiver all over, intense red light abruptly released from the old man’s body, a longstaff possessing countless fine patterns appeared in his right hand, most terrifying was, altogether six spirit rings rose up from under his feet, their dazzling beautiful light immediately became the focus of the everyone present.</p><br/><p>The six spirit rings’ colors were respectively one white, one yellow, three purple, one black. Also meant one ten year spirit ring, one hundred year spirit ring, three thousand year spirit rings and one ten thousand year spirit ring. This looking like a common farmer old man, unexpectedly was a sixtieth rank or more spirit emperor level super strength.</p><br/><p>Sixtieth rank, that indeed was sixtieth rank, ah, even in the entire Balak Kingdom, spirit masters ranked like this also absolutely could be counted on one’s fingers.</p><br/><p>The longstaff in the old man’s hand, rung with a deep muffled sound out in all directions, practically making all the people stagger once.</p><br/><p>Facing the dumbstruck three before him and waving his hand,</p><br/><p>“Next.”</p><br/><p>The light of the spirit rings vanished, all the spirit power also disappeared in a flash, the old man again resumed his previous lazy appearance, as if he had not at all just released that previous spirit emperor atmosphere.</p><br/><p>If there were still some parents unsatisfied because of the old man’s words, then right now they appeared to all be keeping quiet out of fear, who dared offend a spirit emperor level force? Also a spirit emperor who possessed a ten thousand year spirit ring.</p><br/><p>One must know, in battle, a spirit emperor’s strength, would be at least equal to a thousand elite soldiers.</p><br/><p>In the eyes of the parents and applicant students the disdain and contempt in an instant vanished completely, a responsible for applications teacher was an at least sixtieth ranked strength, then, the strength of the faculty at this Shrek Academy must be to what degree?</p><br/><p>But, very quickly the majority of parents’ faces all revealed regretful sighing expressions, silently bringing their children to leave.</p><br/><p>Twelve years old attaining twentieth ranked spirit power or more, like what the old man said, that perhaps also was talent truly reaching a monstrous level.</p><br/><p>Of the originally hundred long queue in an eyeblink only remained ten-something applicants.</p><br/><p>The old man did not seem to mind the number of students, and started back with his application work.</p><br/><p>The people able to stay behind, clearly were confident to pass this old man, and following were several applicant youngsters whose spirit power surpassed twentieth rank, possessing two spirit rings. After handing over the ten gold coin application fee, the old man told them their first entrance exam was passed, and could enter the Academy’s second entrance exam. The parents could not follow the examinees inside the Academy.</p><br/><p>Part 2</p><br/><p>While looking at the applicant before them, Xiao Wu’s mood already became excited, in a low voice next to Tang San’s ear saying:</p><br/><p>“This Academy looks very amusing, especially what that teacher said about only accepting monsters not ordinary people, truly was most smart.”</p><br/><p>Tang San smiled slightly saying:</p><br/><p>“Right now you can’t doubt Grandmaster’s urging, right. This Shrek Academy is in no way ordinary.”</p><br/><p>As a result of already lining up in front, they naturally also were able to closely see Dai Mubai seated behind the old man. Dai Mubai not only was in charge of settling arguments, he was equally responsible for bringing eligible exam students into the Academy.</p><br/><p>Dai Mubai currently also finally saw Tang San’s pair, grim face exposing a slight smile, nodding towards them, again pointing at the teacher, spreading both hands, making a helpless expression. Clearly was telling them, ‘this application must rely on your own effort, I am unable to help’.</p><br/><p>While using expressions to mutually communicate, suddenly, a light yi exclamation pulled back Tang San’s gaze.</p><br/><p>The old man responsible for receiving applications face revealed a bewildered indefinite expression, right now, in front of him stood a young lady, just withdrawing the hand held out.</p><br/><p>This young lady had no parents for company, only was alone. Wearing a simple white long skirt giving people a very neat feeling. Short ordered hair cut evenly with her ears, height compared to Xiao Wu must be about half a head shorter, because of having her back to Tang San and Xiao Wu, they did not see her appearance, but from the skin at her neck were able to discover, that young lady’s was extraordinarily fine, extremely delicate.</p><br/><p>“May I ask, can I pass the preliminary exam?”</p><br/><p>The young lady’s voice was gentle and pleasant to listen to, somewhat lacking in spirit, but sounding like velvet, making people have a kind of soft feeling.</p><br/><p>Tang San from Dai Mubai’s gaze looking towards that young lady was able to determine this girl was certainly very beautiful, because Dai Mubai in those evil eyes no longer revealed ice cold, but a wolfish light. Of course, it was that kind of wolf color.</p><br/><p>The astonishment on the old man’s face gradually vanished, saying with a frown:</p><br/><p>“You coming here, do the people at your home know?”</p><br/><p>The young lady without directly answering his question, only slightly smiled and said:</p><br/><p>“All say teaching has no category[1], as long as I meet the Academy’s demands, you have no reason not to accept me, right.”</p><br/><p>The old man seemingly hesitated a moment, only then waving his hand to Dai Mubai, saying:</p><br/><p>“Bring her inside.”</p><br/><p>The wolf light in Dai Mubai’s eyes rapidly faded, recovering his cold expression, bringing the young lady walking into the Academy.</p><br/><p>The remaining students very quickly passed through the old man’s first test, finally reaching Tang San and Xiao Wu’s turn. By now, after Dai Mubai sent through several examination students, also already returned to the old man’s side.</p><br/><p>Tang San suddenly realized, Dai Mubai’s expression transformed, with fixed eyes staring in the direction behind his back, as if seeing some unimaginable thing.</p><br/><p>Tang San subconsciously turned around to look, although not forgetting his manners like Dai Mubai, his heart still was secretly shaken.</p><br/><p>Behind him and Xiao Wu, the remaining exam students were down to one, and also seemed to have just arrived not long ago, that also was a girl, looking like compared to him and Xiao Wu seemingly still must be a little younger, black long hair scattered over her shoulders, face slightly lowered, height not much different from the previous white skirt young lady, skin also similarly fair. But, this young lady gave people a kind of standing out from the masses feeling.</p><br/><p>An extremely well developed figure that was actually somewhat inconsistent with her age, if not seeing her face, very likely one would believe she was an adult young lady, especially that imposing bosom, even more could attract all men’s attention. A standard for baby-faced boobs.</p><br/><p>In contrast with her fiery figure, the young lady’s facial expression was very indifferent, that was a kind of chill rising from the heart, pure cold, a pair of black eyes that did not hold even a trace of vitality. Somewhat clashing with her originally extremely beautiful face.</p><br/><p>All four limbs well proportioned and slender, Both hands hanging naturally to either side, body releasing that kind of deathly still ice chill making people very uncomfortable.</p><br/><p>“Are you applying or not? If not applying you must not obstruct here.”</p><br/><p>The old man’s voice pulled Tang San back from his train of thoughts. Tang San’s hand stung, when turning his head to look, he discovered Xiao Wu fiercely glaring at him.</p><br/><p>“We’re applying together.”</p><br/><p>Tang San with effort resisted the pain in his hand, having long since prepared twenty gold spirit coins he dropped them in the wooden box. Together with Xiao Wu holding out their hands.</p><br/><p>The old man first kneaded Xiao Wu’s hand, with a nod, saying:</p><br/><p>“Your age is suitable.”</p><br/><p>As his hands shifted to Tang San’s hand, the previous light yi sound could not help but again reappear.</p><br/><p>The old man as if in disbelief seemed to knead Tang San’s hand again, the expression on his face immediately becoming odd. Raising his head to look at Tang San, saying:</p><br/><p>“Is your hand practiced in some spirit ability?”</p><br/><p>The reason he must knead the applicant’s hand, is to recognize the applicant’s true age by the bones in the palm, as this could not be faked. Kneading Tang San’s hand was extremely tough, so his sense of the state of the bones was still unclear.</p><br/><p>Tang San trembled in his heart, nodding, said:</p><br/><p>“Yes.”</p><br/><p>The old man wrinkled his brow,</p><br/><p>“Hold up your calf.”</p><br/><p>Tang San as instructed lifted his calf. Leaving the table, the old man raised the trouser on his calf and kneaded a few times, Tang San immediately felt a tingling.</p><br/><p>The old man nodded at Tang San, saying:</p><br/><p>“Muscle development is not bad. Bone age suitable. Good, release your two spirits.”</p><br/><p>Tang San and Xiao Wu looked at each other, simultaneously urging the spirit power within their bodies.</p><br/><p>Blue and red light simultaneously leapt out, hundred year spirit rings simultaneously spiraling up.</p><br/><p>Rabbit ears standing up, white fluffy fur growing on the backs of Xiao Wu’s hands, body subsequently also becoming even more slender. Spirit jade rabbit body enhancement.</p><br/><p>In Tang San’s palm grew a most ordinary blue silver grass, along with spirit ring effect infusion lightning quick transforming into that grass vine like that day he fought Dai Mubai.</p><br/><p>The old man only gave Xiao Wu a casual glance, gaze falling on Tang San’s body,</p><br/><p>“Unexpectedly it’s blue silver grass. Blue silver grass can also cultivate this quickly?”</p><br/><p>Tang San faintly smiled, saying:</p><br/><p>“Teacher, aren’t you only accepting monsters here? Don’t I count as a monster[2]?”</p><br/><p>Part 3</p><br/><p>The old man’s face revealed a rare smile,</p><br/><p>“It indeed is a small monster. Mubai, bring them inside.”</p><br/><p>“Yes.”</p><br/><p>Dai Mubai came to meet them, revealing a smile towards Tang San, but his gaze seemed to still be fixed behind Tang San’s back.</p><br/><p>Led by Dai Mubai, Tang San and Xiao Wu followed him together to enter Shrek Academy, which also was that village.</p><br/><p>Dai Mubai said:</p><br/><p>“I knew you would be able to pass smoothly. The later tests should also not be any problem.”</p><br/><p>While speaking, he still could not help turning his head to look at the Academy gate opening.</p><br/><p>Xiao Wu unhappily said:</p><br/><p>“Looking at what? Still thinking of that disaster girl?”</p><br/><p>Dai Mubai’s brows wrinkled, saying:</p><br/><p>“What do you understand. I feel the atmosphere on that girl’s body is very like mine, not only is it similar, but also still has a kind of complementing effect feeling. Among spirits, thinking to encounter a complementing spirit is extremely difficult. But if meeting, if joining hands, one’s spirit strength would increase twofold. This is the so-called Spirit Harmonization ability.</p><br/><p>Xiao Wu involuntarily laughed saying:</p><br/><p>“Then that means, that girl’s spirit should be a tigress[3]?”</p><br/><p>Dai Mubai’s face revealed some embarrassment, saying:</p><br/><p>“It’s possible.”</p><br/><p>Entering the village, they were able to see, it was all wooden buildings, using the words ‘simple’ and ‘unadorned’ to describe the buildings here was only appropriate.</p><br/><p>Not walking far, Dai Mubai brought them to an open space. Around were wooden buildings, this vacant land appeared to be about five hundred square metres or so, Just at the centre of Shrek Academy.</p><br/><p>The previously passed preliminary exam students were before them, distinct spirit power fluctuations making the air shiver irregularly.</p><br/><p>Dai Mubai pointed at the lined up exam students ahead, saying:</p><br/><p>“You take the second exam here, the teacher will tell you how to do it. I still must go out to take a look, if that girl’s spirit truly agrees with mine, in which case I also must capture her.”</p><br/><p>Finished speaking these lines, Dai Mubai hurriedly left, Tang San and Xiao Wu according to what he said like that reaching the end of the exam student line ahead.</p><br/><p>Meanwhile, a soft voice resounded.</p><br/><p>“Selling sausage, selling sausage. Have a gander, have a look, passing by or passing through you must not miss it. Oscar brand sausage, tastes beautifully fragrant and sweet. Price convenient, quantity yet ample. Only five copper coins for one. Eat Oscar brand sausage, guarantee you will even easier pass the entrance exam.”</p><br/><p>Tang San and Xiao Wu inclined their heads to see, only saw alongside not far away, a man pushing a wagon where he peddled. A burst of meat scent disseminating from the wagon, already already some of the lined up students had bought.</p><br/><p>The man standing behind the cart wore simple grey clothes, neat short hair, across his entire face a full beard, but having a pair of peach blossom eyes, gaze roaming between, especially towards the girls in the exam student ranks. Xiao Wu naturally also difficult to escape his scanning gaze. Very difficult to believe, that such a soft feminine voice would issue from a like this straightforward adult.</p><br/><p>Tang San said to Xiao Wu:</p><br/><p>“There are still several people ahead of us, you also did not eat much for breakfast, do you want to eat a sausage?”</p><br/><p>Xiao Wu inclined her head saying:</p><br/><p>“It smells pretty good. Let’s try that.”</p><br/><p>Tang San nodded, letting Xiao Wu stand in line, he walked in the direction of the cart on his own.</p><br/><p>Coming close, he was able to see that sausage salesman’s height was not much different from his own, on the cart was also nailed a board, on which was carved two words, ‘Sausage Monopoly’.</p><br/><p>The salesman seeing a person approach, immediately enthusiastically said:</p><br/><p>“Come for sausage? Oscar brand sausage, offering sincere treatment to all. Flavour guaranteed.”</p><br/><p>Tag San with a slight smile said:</p><br/><p>“Uncle, I’ll trouble you to give me two.”</p><br/><p>That salesman’s expression suddenly became rigid,</p><br/><p>“You-, what did you call me?”</p><br/><p>Tang San was also stunned,</p><br/><p>“I called you uncle, ah, is there a problem?”</p><br/><p>The salesman said with a bitter laugh:</p><br/><p>“Of course there’s a problem, and still a huge problem. Little brother, this year I am just fourteen years old, yet you unexpectedly call me uncle?”</p><br/><p>“Eh……, you are just fourteen?”</p><br/><p>Tang San shocked looked at this person before him.</p><br/><p>The salesman confirming said:</p><br/><p>“That’s right, I’m Oscar[4], this year I’m fourteen years old, a Shrek Academy junior student, you can’t call me uncle just because my hair is a bit lush.”</p><br/><p>Tang San was speechless, looking at Oscar’s that large thick beard on his face, in his heart secretly saying, ‘someone this hairy could not be described as just a bit lush’.</p><br/><p>“You really are only fourteen years old?”</p><br/><p>Tang San could not help but ask.</p><br/><p>Oscar nodded confirmation, saying:</p><br/><p>“Of course, I am an Academy student, anyone you ask all know I’m fourteen.”</p><br/><p>Tang San in his heart secretly said, ‘worthy of being a Monster Academy, a fourteen years old youth whose beard could unexpectedly reach this kind of length, also absolutely counts as out of the ordinary’.</p><br/><p>Oscar picked up two bamboo skewers from his cart, piercing two ten centimetre sausages and handing them to Tang San, the two sausages were previously roasting together on a charcoal brazier on the cart, emitting a rich aroma.</p><br/><p>Tang San took out a silver coin and handed it to him,</p><br/><p>“Senior, truly am embarrassed, just now was my lack of manners.”</p><br/><p>Oscar softly said:</p><br/><p>“It doesn’t matter, afterwards many many times visit my sausage cart is fine.”</p><br/><p>Tang San straightforward said:</p><br/><p>“No problem.”</p><br/><p>“Tang San, what are you doing?”</p><br/><p>Dai Mubai was bringing the last exam student, who also was that ice cold young lady he previously stared at for a long time.</p><br/><p>Oscar gave Dai Mubai a look, immediately revealing a painful expression,</p><br/><p>“Dai Mubai, have you come to eat sausage?”</p><br/><p>“Drop dead.”</p><br/><p>Dai Mubai gave him an unhappy glare,</p><br/><p>“You really cause the Academy to lose face, I seem to have warned you many times, do not sell sausage in the academy. It couldn’t be you want to let people vomit? Tang San, you can’t eat this sausage.”</p><br/><p>Tang San puzzled asked:</p><br/><p>“Why?”</p><br/><p>Dai Mubai’s facial expression became somewhat odd,</p><br/><p>“Little Ao[5], you take out the source of new sausage.”</p><br/><p>Oscar’s expression immediately became awkward,</p><br/><p>“Boss Dai[6], there’s no need, right. We even have been fellow students for several years, like this you will let newly arrived little juniors to have complaints of me.”</p><br/><p>Part 3</p><br/><p>Dai Mubai coldly snorted, saying:</p><br/><p>“I am only giving Tang San a warning, that’s all, Tang San is my younger brother, and cannot be your equal. Hurry up, don’t make me hit you.”</p><br/><p>Oscar clearly dared not provoke Dai Mubai, helplessly extending his right hand, somewhat wretchedly using his that soft voice to call out.</p><br/><p>“I your father[7] has a big sausage.”</p><br/><p>Yellow light suddenly condensed in his hand, two yellow rings of light rose up from under Oscar’s feet, immediately following, an exact copy of the sausages Tang San held appeared in his palm.</p><br/><p>“Eh…..”</p><br/><p>As Tang San heard Oscar’s line “I your father has a big sausage’, his entire person somewhat froze. This line indeed had too many possible meanings. Before speaking of the quality of these sausage, or whether edible. Only Oscar having spoken that line he still dared not eat. Especially, as this sausage was bought for Xiao Wu.</p><br/><p>Sensing Tang San’s gaze starting to become angry, Oscar hurriedly explained:</p><br/><p>“There is nothing I can do about this. When using food system spirits, wanting to let food change, one must join with different spirit incantations, these incantation words, are not something I want to shout out. And also, the quality of my sausage is by no means an issue.”</p><br/><p>Tang San lightning quick returned the sausages in his hand to the stove,</p><br/><p>“Your sausage, still is leaving you to your eating. Dai Dage, thank you for the warning.”</p><br/><p>Monster, indeed a monster. Tang San somewhat did not know whether to laugh or cry, fortunately he had not eaten that sausage, otherwise this face would certainly lose greatly.</p><br/><p>The ice-cold young lady Dai Mubai brought in was only coldly looking at Oscar, walking towards the queue. Oscar innocently shrugged at Tang San,</p><br/><p>“Have pity on my delicious sausage, unexpectedly nobody eats. Ai.”</p><br/><p>Dai Mubai glared at him,</p><br/><p>“You be a bit careful, go selling sausage outside the Academy. Tang San, I bring you to pass the exam.”</p><br/><p>The two returned to within the queue, Xiao Wu looked at Tang San’s empty hands,</p><br/><p>“My sausage?”</p><br/><p>Tang San shared a look with Dai Mubai, both unable to help it, the two immediately burst into laughter.</p><br/><p>The ice-cold young lady stood behind Xiao Wu, in her eyes flashed a trace of a smiling expression, coolly saying in a low voice:</p><br/><p>“Silly.”</p><br/><p>Xiao Wu was unable to make heads or tails of their laughter,</p><br/><p>“In the end what’s the matter? Don’t tell me that sausage wasn’t tasty?”</p><br/><p>Tang San covered Xiao Wu’s mouth, pulling her to his side, in a low voice recounting the previous affair next to her ear.</p><br/><p>Hearing Tang San’s words, Xiao Wu’s beautiful face immediately turned a deep red,</p><br/><p>“You boys, really is mortifying. How could there be this odd spirit.”</p><br/><p>Dai Mubai smiling said:</p><br/><p>“This is Monster Academy, spirits naturally have fantastic oddities of every description. However, Oscar this fellow in the academy is also considered out of the ordinary. His that spirit is without any potential for attack, but among food system spirits, it’s classified as top quality. After all, he can supply meat. Only when this fellow uses his spirit, those incantations really are too disgusting. People familiar with him, absolutely will not eat those sausages he produces. I do not know whether it is because of the food system spirit, but his hair is much more lush compared to ordinary people, beard in one day of not shaving will become like right now, therefore, in the academy he also has a Big Sausage Uncle nickname. He himself runs what he calls the Sausage Monopoly.”</p><br/><p>This time, even Xiao Wu could not help but laughing,</p><br/><p>“Big Sausage Uncle, it truly is an interesting spirit.”</p><br/><p>Dai Mubai clapped Tang San’s shoulder, saying:</p><br/><p>“Walk, I bring you to pass the test. No need to line up.”</p><br/><p>Tang San said:</p><br/><p>“That is no good.”</p><br/><p>Dai Mubai said:</p><br/><p>“Be at ease, I am not favoring, this is your deserved treatment.”</p><br/><p>While speaking, he brought the two towards the front of the line.</p><br/><p>Responsible for the second exam also was a senior teacher, because of previously buying sausage, Tang San still had not had time to see what the contents of this exam were.</p><br/><p>Dai Mubai walked up to that teacher’s side, muttering several lines next to his ear, also indicating Tang San and Xiao Wu.</p><br/><p>The teacher nodded, saying:</p><br/><p>“All right, you bring them directly to the fourth hurdle. Passing enrollment.”</p><br/><p>Dai Mubai returned to Tang San and Xiao Wu’s side, about to bring the pair to go inside the Academy. But the lined up examinees were not satisfied.</p><br/><p>One male exam candidate said:</p><br/><p>“Teacher, what’s going on? Why can those avoid the test to enter the fourth exam. Yet we must pass through?”</p><br/><p>The senior teacher calmly said:</p><br/><p>“If your spirit power is also over twenty fifth rank, then, you can also directly enter the fourth exam, need not waste time here with me. But if you right now when testing spirit power only have twenty first rank, then, you have to test one by one.</p><br/><p>The male student unconvinced said:</p><br/><p>“Their spirit power is over twenty fifth rank? That’s impossible. We all are just twelve years old, how can such high spirit power appear.”</p><br/><p>Able to stand here, all had spirit power over twenty first rank, and also age not higher than thirteen year’s old youngsters. Originally at junior academy, existences like them, undoubtedly all had roles in the academy like stars around the moon[8]. But reaching this Shrek Academy and repeatedly hitting a wall, their frame of mind could not help but have some changes.</p><br/><p>Dai Mubai snorted coldly,</p><br/><p>“You won’t do, but don’t think other people also won’t do. When I entered the Academy, my spirit power was twenty fifth rank. Tang San, give them a look at your spirit power.”</p><br/><p>While speaking, he picked up a white crystal from the desk and tossed it to Tang San.</p><br/><p>The testing crystal was different based on level, its color also different, this kind of white crystal tested only the thirtieth rank or lower, if spirit power exceeded thirtieth rank, then the crystal would immediately burst.</p><br/><p>Tang San at this understood why Dai Mubai persuaded him that this test was blow their status, of course, this test was to measure the candidate’s precise spirit power.</p><br/><p>At that moment, he also did not speak, holding the white crystal and directly infusing it with his Mysterious Heaven skill internal strength.</p><br/><p>Part 5</p><br/><p>In a split second, only saw a brilliant white light released in Tang San’s hand, white crystal became as resplendent as a diamond, the intense brilliance filling every corner of the crystal, this clearly was evidence of spirit power on the verge of reaching thirtieth rank.</p><br/><p>The teacher in charge of the test showed a pondering smile,</p><br/><p>“See, our Shrek Academy this year again will receive a pretty good little monster.”</p><br/><p>Tang San wore a slight smile, handing the crystal in his hands to Xiao Wu, he could not wish for other people to complain about Xiao Wu, regarding Xiao Wu, he had absolute confidence.</p><br/><p>Equal white light once again shone, thoroughly blocking the other exam candidates’ mouths, looking at Tang San and Xiao Wu in their eyes also immediately became monsters.</p><br/><p>Twenty ninth rank, twelve years old attaining twenty ninth rank spirit power, was this a level humans were capable of reaching?</p><br/><p>However, this monster title did not only appear among the two Tang San and Xiao Wu.</p><br/><p>A melodious voice rose,</p><br/><p>“Teacher, I think, I should also be excused from the second and third tests.”</p><br/><p>The speaker was the young lady who before Tang San and Xiao Wu registered to test, also caused the first teacher bewilderment. Right now Tang San and Xiao Wu just truly saw her appearance. Level with the ears short hair, extremely fair delicate skin, although her figure was unlike the ice cold young lady’s heat, yet unusually harmonious, her entire person looked to give people a kind of earthy feeling. Somehow looked like she was a highly educated noble young lady.</p><br/><p>If speaking of that last to enter young lady as an iceberg, then she was a warm spring wind, her gentle and beautiful smiling expression infecting everyone in her surroundings.</p><br/><p>With a slight smile walking up in front of Xiao Wu, nodding towards her. Xiao Wu subconsciously handed her the crystal.</p><br/><p>Bright white light once again appeared, although it did not have the intensity of Tang San and Xiao Wu, it still absolutely surpassed twenty fifth rank spirit power level, appearing to be about twenty sixth rank or so.</p><br/><p>Just when she thought to inquire from the testing teacher whether she also could directly go to the fourth test, she suddenly discovered, the crystal in her hand was missing. Another figure had already quietly appeared at her side, immediately following, shining white light once again radiated. The light compared to when she infused spirit power still must be a bit more powerful, even to the extent of twenty seventh ranked spirit power.</p><br/><p>This sudden appearance, was exactly the ice cold young lady last to follow Dai Mubai here.</p><br/><p>The testing teacher’s face was repeatedly covered by surprise,</p><br/><p>“Monsters one after another, this year especially many. All of a sudden there are four. Good, good, apparently, I have water to ask for a raise. Mubai, you bring these four together to the fourth test.”</p><br/><p>“Yes.”</p><br/><p>Dai Mubai respectfully answered, evil eyes with a complex expression looking at the ice cold young lady, then turning around and walking towards the inside of the academy. This time, no students again raised an issue. Strength was sufficient proof.</p><br/><p>Among the four exam candidates, only Tang San and Dai Mubai had a relationship regarded as pretty good, while following him inside, asked:</p><br/><p>“Dai Dage, the entrance exam altogether only has four tests?”</p><br/><p>Dai Mubai nodded, saying:</p><br/><p>“Altogether four tests. The first you already went through. It was to reject applicants with spirit power short of twenty first rank, or possibly age exceeding thirteen years old. This filters out most people. The second test is conducted to appraise spirit power and spirit. Merely having great spirit power is not sufficient to prove future growth potential, this test mainly tests the spirit, only spirits possessing sufficient growth potential, furthermore previous cultivation developing in a proper direction spirit masters can enter the third test. Of course, if the spirit is extremely extraordinarily freakish, one is also able to be chosen. In this way little Ao originally passed.”</p><br/><p>Regarding Dai Mubai’s words, Tang San very easily understood, after all, Grandmaster in this respect already instilled in him thoroughly. Equal spirits, but picking different development directions, means future results are also different. This second test mainly was filtering out those examinees spirit who also had the first two spirit rings where later conflicts with cultivation could occur.</p><br/><p>“Dai Dage, but my spirit is blue silver grass. It should belong to the least growth potential spirits. Why……”</p><br/><p>Dai Mubai smiled straightforwardly, saying:</p><br/><p>“You also need not be modest, how would I still not know your strength? The Academy provisions, if an applying exam candidates spirit power exceeds twenty fifth rank, then, no matter what the spirit is, can directly pass the second and third trials. Like one strength subduing ten, even if your spirit’s quality is somewhat lacking, but your spirit power is far above, relying on spirit power superiority, still will become a formidable spirit master.”</p><br/><p>Xiao Wu could not help asking:</p><br/><p>“What is the third test?”</p><br/><p>Dai Mubai said:</p><br/><p>“The third is to test the examinee’s own spirit application level. Only having spirit power and growth potential won’t do, simultaneously still need to controle the own spirit’s strength. the higher rank of the spirit the more difficult to control, this very easily becomes an issue. If regarding spirit’s control one cannot attain a certain degree, then, this proves the spirit master is insufficiently diligent. Students like this we also do not accept.”</p><br/><p>Tang San immediately understood his meaning, Dai Mubai said, a spirit somewhat hard to control, like his second spirit, that monstrous hammer, its weight was incomparably oddly great, and also along with his spirit power increasing, that hammer’s weight also unceasingly increased. Tang San thought to himself, even if using Disorder Splitting Wind Hammer Method, under peak conditions, he still only could swing that hammer three times.</p><br/><p>Not waiting for Xiao Wu to ask again, Dai Mubai continued with the fourth test,</p><br/><p>“The fourth is to test the examinee’s actual combat experience. Some students own spirit is not bad, regarding spirit control also not bad. But from childhood living in a noble family, long in a privileged environment. Fundamentally without any understanding of the outside world, let alone fighting. This kind of student, the Academy also won’t accept. The Dean said, ‘pampered and spoiled since childhood absolutely refused’.”</p><br/><p>[1] () Literally “having teaching no category”, idiom: “education for everyone, irrespective of background”. I guess maybe “education is blind”.</p><br/><p>[2] () Can also be translated as “freak” or “eccentric”.</p><br/><p>[3] With much the same euphemisms as in English.</p><br/><p>[4] (Aosika )</p><br/><p>[5] Xiao Ao (), Ao is the first character in Oscar.</p><br/><p>[6] () “Eldest”, or in informally as boss.</p><br/><p>[7] He refers to himself as (), an excessively arrogant way to refer to oneself. Something like “I’m your daddy” baked into a formal personal pronoun.</p><br/><p>[8] Idiomatic expression, the academy revolved around them.</p><br/>\n</div>"}