{"title": "Chapter 54", "id": 54, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-54", "volume_title": "Volume 1", "body": "<h1>Chapter 54</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 54</p><br/><p>Borrowing A Chicken To Lay An Egg?</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Qin Ming forced himself to swallow,</p><br/><p>“Then this means, the majority of them are only twelve or thirteen years old?”</p><br/><p>Flender nodded.</p><br/><p>Qin Ming’s gaze separately swept across the Shrek Seven Devils, with a wry smile saying:</p><br/><p>“Now I know why you wore masks. You truly are too astonishing, I always thought the Emperor Team were already pretty gifted, but in front of you they’re basically nothing. If age was the same, they wouldn’t have any chance of victory.”</p><br/><p>Flender didn’t speak, only smiling looking at these children before him. Shrek Academy’s student’s were possibly the biggest accomplishment of his life, Qin Ming was one, the Shrek Seven Devils in front of him were equally ones.</p><br/><p>Dai Mubai asked:</p><br/><p>“Senior, could I be so presumptuous as to ask, right now what is your spirit power rank?”</p><br/><p>Qin Ming subconsciously replied:</p><br/><p>“Sixty second rank, my luck hasn’t been bad.”</p><br/><p>The Shrek Seven Devils all looked at each other, at the same time all recalling Flender’s words. Shrek Academy only accepted monsters, not ordinary people.</p><br/><p>“All right, don’t flatter each other, all the little monsters can sit. Eat something, today your miserly sir dean will contribute generously, don’t give me face, do as you wish.”</p><br/><p>Zhao Wuji looked at the complacent Flender, calling out to the Shrek Seven Devils in a loud voice.</p><br/><p>Flender’s smile immediately became rigid, but the Shrek Seven Devils simultaneously cheered, promptly calling for a waiter. As expected they didn’t give Zhao Wuji face, directly starting to order dishes.</p><br/><p>Ma Hongjun took the initiative to snatch the menu. Flipping through it, the menu had three pages. Raising his hand to point at the menu several times, indicating to the waiter to remember several dishes.</p><br/><p>Flender sitting next to Ma Hongjun, watching his disciple point at several of the cheapest dishes couldn’t help but feel invigorated, ‘good, worthy of being my disciple, still truly letting me save money, really good.’ But, Ma Hongjun’s next words immediately made him fall from heaven directly into hell.</p><br/><p>“En, those dishes I pointed to just now, apart from them bring everything else on the menu. Big portions. Also bring two kegs of ale. Serve quickly.”</p><br/><p>Ma Hongjun basically didn’t give the others a chance to order, directly taking on this glorious mission on behalf of the Shrek Seven Devils.</p><br/><p>Turning his head to look at Flender, Ma Hongjun said somewhat baffled:</p><br/><p>“Yi, teacher, what’s up with your face, why is it blue? Didn’t you sleep well last night!”</p><br/><p>To the side Qin Ming could still maintain his aloofness, but Zhao Wuji was already completely without image laughing heartily, Flender’s miserliness was famous among all the Academy teachers.</p><br/><p>Qin Ming had right now managed to restore his expression to normal, smiling:</p><br/><p>“How can I let the dean spend so much, after so many years I’ve finally returned, two teachers, give me the opportunity to thank you for the instruction in those days. Without you, there still wouldn’t have been a Qin Ming.”</p><br/><p>Zhao Wuji laughed, saying:</p><br/><p>“Little Ming, you’re still so thoughtful. Originally I wanted to have a look at Flender bleeding money. Right now that doesn’t seem to be.”</p><br/><p>When Flender heard Qin Ming was hosting, his complexion immediately became much better, glaring at Zhao Wuji, saying:</p><br/><p>“Isn’t making a fool of me pleasurable? Fine, old Zhao, it’s been quite a while since we exchanged pointers. Once we’ve returned, I’ll look you up for sparring. It’s also to promote spirit power.”</p><br/><p>“Eh……”</p><br/><p>This time it was Zhao Wuji’s turn to stop smiling, he and Flender had exchanged pointers an indeterminate number of times, naturally he was well aware of Flender’s strength. As a strength type Spirit Master, to Flender belonging to the agility attack system and also a flying Spirit Master, he basically didn’t have any way of dealing with him. Let alone when Flender’s spirit power was two ranks higher than his.</p><br/><p>At the level they’d reached, every single rank of spirit power disparity couldn’t be as indistinct as at the Shrek Seven Devils’ level, each rank was an absolute gap.</p><br/><p>Qin Ming looked at the sitting Shrek Seven Devils, finally his gaze stopped on Tang San, Dai Mubai and Zhu Zhuqing,</p><br/><p>“Truly unfortunate, if you junior brothers and sisters weren’t Shrek’s people, I would use every possible means to bring you back to the Imperial Academy. If you joined, maybe……”</p><br/><p>Just as Qin Ming said this, a familiar voice resounded nearby,</p><br/><p>“Even if they’re Shrek Academy’s people, you can still bring them back to the Imperial Academy all the same.”</p><br/><p>When everyone looked over, they found Grandmaster entering from outside, also impolite, he directly sat down next to Flender.</p><br/><p>Qin Ming probing asked:</p><br/><p>“Grandmaster, what was the intention of what you said just now?”</p><br/><p>Without waiting for Grandmaster to reply, Flender already gave up,</p><br/><p>“Grandmaster, did you specially come to tear apart my support? These children belong to Shrek. Now and hereafter. Don’t tell me that we can’t give them a good education at Shrek?”</p><br/><p>Grandmaster didn’t show any change because of Flender’s anxiety, still that rigid face, calmly saying:</p><br/><p>“I didn’t say to let them enter Heaven Dou Imperial Academy, what I meant was, I hope the two Academies can make a mutual exchange. Teacher Qin, I think this shouldn’t be any big issue. If you can’t decide it, I can look to Spirit Hall.”</p><br/><p>Qin Ming stared blankly at Grandmaster, for a moment not knowing how he should reply.</p><br/><p>Flender was equally looking at Grandmaster while thinking to himself, ‘what is Xiao Gang this fellow actually trying to sell?’ But right now in front of Qin Ming he couldn’t well ask, but he and Grandmaster had been brothers for so many years, naturally he was convinced Grandmaster was a principled person.</p><br/><p>Qin Ming pondered, saying:</p><br/><p>“If I can exchange with the junior brothers and sisters, it would be Heaven Dou Academy’s good fortune, only I’m afraid……”</p><br/><p>Grandmaster said:</p><br/><p>“You’re afraid these children are too outstanding, so in the end your Heaven Dou Imperial Academy wouldn’t return them, yes?”</p><br/><p>The feeling of being seen through by people was unpleasant. Grandmaster would appear ordinary and mediocre, but his words possessed extreme penetrating power, directly speaking Qin Ming’s thoughts out loud.</p><br/><p>Qin Ming still wasn’t affected, nodding, saying:</p><br/><p>“Yes, although Heaven Dou Imperial Academy has the title of the number one academy in Heaven Dou Empire, regarding such young but already so powerful Spirit Masters, their position is steadily deteriorating. The Academy leadership is looking for talents as if thirsting for them, if the juniors go, I can’t guarantee they won’t have some notions. I’m afraid they would exploit every kind of relation to as far as possible convince the juniors to stay. Wouldn’t that be the same as undermining the walls of our Shrek Academy?”</p><br/><p>Flender smiled:</p><br/><p>“Little Ming, you’re pretty good. Worthy of being from my Shrek Academy, you know to give thought to the Academy. Grandmaster, little Ming isn’t a stranger, if you have something to say then just say it.”</p><br/><p>Grandmaster shot a glance at Flender,</p><br/><p>“I’m saying, teacher Qin, if I remember correctly, as an academy established by the Heaven Dou Empire imperial family, for that pageant in one year, Heaven Dou Imperial Academy should have two allocated places to compete. I can let these children temporarily act as exchange students to the Heaven Dou Imperial Academy, until after the pageant in one year has ended. I think, words like these would be favorable to you.”</p><br/><p>Qin Ming was gobsmacked,</p><br/><p>“Grandmaster, you’re saying that you would let the juniors represent Heaven Dou Imperial Academy to go participate in that pageant? But like that, Heaven Dou Academy will certainly declare to the outside that the juniors are Heaven Dou’s people!”</p><br/><p>Grandmaster calmly smiled, saying:</p><br/><p>“Having the fame of graduating an academy isn’t anything bad.”</p><br/><p>“No. I don’t consent to it.”</p><br/><p>Flender angrily slapped the table and stood up, glaring at Grandmaster.</p><br/><p>“The children are Shrek’s, Grandmaster, don’t forget that Shrek Academy is twenty years of my life’s blood.”</p><br/><p>Grandmaster didn’t show any change from Flender’s anger,</p><br/><p>“Flender, I’ll pose you several problems, if you can settle them, then, it doesn’t matter whether the children go to Heaven Dou. First, can you offer the children mimicry cultivation environments? Second, can you provide them with qualifications to enter the Continental Elite Spirit Master Academy Grand Competition in one year? Third, for what reason do you believe that after entering the Heaven Dou Imperial Academy, these children wouldn’t be part of Shrek? Perhaps you can’t comprehend why I’m doing this, but I must still ask you one last question, what was your intention when you established Shrek Academy?”</p><br/><p>“I, I……”</p><br/><p>Flender was dumbstruck and unable to reply from Grandmaster’s rapid fire questions, glaring at Grandmaster, but that anger just now was already gradually fading, gradually becoming disappointment.</p><br/><p>Grandmaster calmly said:</p><br/><p>“Mimicry cultivation environments, able to provide their spirit power cultivation speed with another boost. The All Continent Spirit Master Academy Elite Grand Competition stipulates academies can only participate after passing a preliminary competition, but Shrek Academy isn’t registered with any kingdom or empire. Because we don’t have the corresponding hardware, even though Shrek Academy is famous in the Spirit Master world, that still can’t produce the qualifications for participating. And you should be well aware what the rewards are in the Continental Spirit Master Academy Elite Grand Competition, how significant to the children. The ideal you originally established Shrek Academy with, was to foster geniuses of the Spirit Master world, letting them shock the entire Spirit Master world. But I choose their path, as far as possible letting them walk it smoothly, furthermore, I still haven’t finished talking.”</p><br/><p>Saying this, Grandmaster turned to Qin Ming,</p><br/><p>“To let these children enter Heaven Dou Imperial Academy, I have one condition. The Academy must admit all the present Shrek Academy teachers, furthermore let us personally come to teach these children. Heaven Dou Imperial Academy cannot interfere, in other words, they can substitute for Heaven Dou Academy’s reputation, but their education is still done by us. When we want to leave, Heaven Dou Academy also doesn’t have the qualifications to stop us.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Flender sat back down again, lifting his cup of ale in both hands, pouring it down his throat in great gulps.</p><br/><p>Qin Ming smiled wryly towards Grandmaster:</p><br/><p>“Grandmaster, you’ve really given me a difficult problem. Honestly, standing at Heaven Dou Imperial Academy’s angle, able to let the juniors represent Heaven Dou Imperial Academy to fight would no doubt bring endless credit to the Academy, greatly raising the Academy’s reputation. The conditions you raised also aren’t excessive, all teachers are celebrated Spirit Masters, the Academy wouldn’t refuse, and furthermore would provide the best rewards. Only, Shrek Academy is the crystallization of dean Flender’s heart’s blood, if we truly did this, then hereafter perhaps……”</p><br/><p>“All right, let’s do what Xiao Gang just said.”</p><br/><p>Flender stood up again, his expression having already recovered its calm,</p><br/><p>“What Xiao Gang said is right, I shouldn’t only consider my pride. Everything should be for the good of the children. Heaven Dou Imperial Academy belongs to the Heaven Dou Empire imperial family, a rare pure Spirit Master land without interference from Spirit Hall, the children won’t come to grief there. The Shrek Academy teachers can also have a place to retire. Until now, I’ve only considered my own notions, but everyone still always followed me. Right now we’ve become old, we should find everyone a place to return to. Heaven Dou Imperial Academy. This reputation isn’t bad. Furthermore, the children can also obtain even better growth there. This matter is decided. You talk it over. Xiao Gang and Zhao Wuji will represent me, I’ll return by myself to rest.”</p><br/><p>Finished speaking, Flender turned and left. Zhao Wuji gave Ma Hongjun a meaningful look, and Fatty immediately understood, he didn’t even look at the plates of food being served, hastily chasing after Flender. At this time, this Fatty was even more able to console Flender than Grandmaster and Zhao Wuji.</p><br/><p>Grandmaster sighed,</p><br/><p>“Although Flender is a bit stubborn, he really isn’t an unreasonable person. I believe he will think it through clearly.”</p><br/><p>Zhao Wuji smiled wryly:</p><br/><p>“After all, the Academy has been backed by us for all these years. It’s not that Flender doesn’t understand the merits of your proposal. Even if he has decided to close the Academy after these children graduate, truly at this moment, in his heart he still can’t easily accept it. To us, this really is somewhat abrupt, we’ve already lived here for twenty years.”</p><br/><p>Grandmaster nodded,</p><br/><p>“He can only rely on himself for this.”</p><br/><p>Zhao Wuji said:</p><br/><p>“Perhaps to us this is also the best place to end up at. Grandmaster, thank you, I know that your proposal isn’t just for the children, but also for Flender and us. Heaven Dou Imperial Academy is a place that receives little influence from Spirit Hall. It also has sufficient fame. You’re doing your best to care for Flender’s face. Retiring there seems pretty good.”</p><br/><p>Showing a smile, Zhao Wuji’s expression was uncomplicated. He wasn’t Flender, and didn’t have Flender’s face and stubborn heart. Admittedly being at Shrek Academy for twenty years made him reluctant to leave, but equally, he was tiring somewhat. Changing environment might not be a bad thing.</p><br/><p>For these matters the Shrek Seven Devils didn’t interject anything, besides Ma Hongjun who had chased after Flender, the other six looked at each other. This abrupt change diluted their joy after the victory, even so much that their hearts weren’t in eating.</p><br/><p>Flender stood in the doorway, looking up at the full moon and starlight decorating the night sky, calmly saying:</p><br/><p>“What are you doing following me, go eat.”</p><br/><p>Ma Hongjun at present didn’t have his normal somewhat lascivious smiling expression, deferentially standing next to Flender,</p><br/><p>“Teacher, don’t feel sad.”</p><br/><p>Flender shook his head,</p><br/><p>“I’m not sad, only more or less frustrated, that’s all. This all came somewhat quickly for me. Hongjun, I find that your Evil Fire problem seems to have fallen off a lot in this time following Grandmaster’s training. What’s the matter?”</p><br/><p>Hearing his teacher mention his Evil Fire, Fatty’s smile reappeared, scratching his head, saying:</p><br/><p>“I also don’t know how it came about. Only in this time I’ve really been too tired, apparently all my energy has already been spent. I basically haven’t even thought about that.”</p><br/><p>Flender’s face revealed a faint smile,</p><br/><p>“This is a good phenomenon. Your spirit is in the process of imperceptible influence from variation, perhaps, not long from now you might not suffer the problems it causes. Good, you go back. No need to console me, I’ll just think things over a while.”</p><br/><p>Ma Honjun blinked, rubbing his plump face,</p><br/><p>“Teacher, this is actually just borrowing a chicken to lay an egg. Honestly, I’m not too clear on why you’re depressed.”</p><br/><p>“Borrowing a chicken to lay an egg?”</p><br/><p>Flender turned to look at his direct disciple, somewhat astounded repeating his words.</p><br/><p>Ma Hongjun hastily nodded,</p><br/><p>“Yes, isn’t that borrowing a chicken to lay an egg? Borrowing that imperial family academy’s facilities to train us, and us helping them fight is also equivalent to paying a fee. I don’t know about other people, but I wouldn’t think of us as belonging to that imperial family academy. I’ll always be your disciple, Shrek’s Evil Fire Phoenix.”</p><br/><p>Flender stupidly stared at ma Hongjun, although Fatty comparatively wasn’t up to much, but he made Flender’s mind seem to slam open a door,</p><br/><p>“Borrowing a chicken to lay an egg? Borrowing a chicken to lay an egg, excellently borrowing a chicken to lay an egg. It seems, I really am too stubborn. A bit early, a bit late, what’s the difference? Shrek will after all end, but once left behind everything will forever be unable to change, Xiao Gang, thank you, thank you for helping me draw this end to Shrek.”</p><br/><p>……</p><br/><p>Early the next day, everyone from the Shrek Academy settled their accounts and left the hotel, concluding this one month of second stage training.</p><br/><p>Perhaps, to their bodies, this second stage training wasn’t as extreme as the first stage, but the psychological stress made the Shrek Seven Devils even more exhausted.</p><br/><p>Each day confronting different opponents, each day going all out to obtain victory, facing powerful enemies, not only confronting the opponents, but also coordinating with their comrades, the spirit fights were completely different from exchanging pointers between each other, that was true battle, at the same time as it gave abundant combat experience, it also let the Shrek Seven Devils clearly understand the effects of the first stage demonic training.</p><br/><p>Combat endurance, toughness as well as recovery strength, all had improved amply. Otherwise, how could they have endured participating in high intensity battles every day, especially those participating in three spirit fights each day, even more completely displayed the effects of the first stage demonic training in their spirit fights.</p><br/><p>Besides basic training and real combat experience, what Grandmaster gave them also had a second hidden meaning. That was preserving fighting strength.</p><br/><p>Returning to that familiar little village, although it wasn’t as bustling as Suotuo City, it also had less noise than the markets, homes feeling so familiar, to the Shrek Seven Devils, Shrek Academy, had long since become an existence like home.</p><br/><p>Flender’s mood had already recovered to normal. Even Zhao Wuji who had followed him for twenty years hadn’t expected him to come around this quickly. Flender was already striking the auctioneer’s hammer. Everything moved according to Grandmaster’s plan. As for everything after they entered the Imperial Academy, that was Qin Ming’s problem.</p><br/><p>“You children go rest. This has been exhausting for you. Wuji, you call over everyone.”</p><br/><p>As soon as Flender returned to the Academy he started issuing orders, this Shrek Academy didn’t consist of him alone, there were still three additional teachers, he also equally had to solicit their opinions.</p><br/><p>Oscar returned to the dormitory. He was unable to deal with the dust that had gathered on his bed over one month, directly falling onto the bed,</p><br/><p>“Still is comfortable coming home. Little San, don’t wake me. I want to sleep a lot, sleep until I wake on my own.”</p><br/><p>Tang San looked at Oscar spread eagled on the bed and shook his head, this fellow, if someone didn’t force him to cultivate, his lazy character might have already wasted his outstanding spirit.</p><br/><p>According to Grandmaster’s negotiations with Qin Ming, everyone from Shrek Academy would travel to Heaven Dou Imperial Academy in two months to study as exchange students. Until then, Qin Ming would handle matters over at Heaven Dou Imperial Academy’s end.</p><br/><p>The Shrek Academy’s side still had to deal with some preparations.</p><br/><p>Grandmaster wasn’t at all anxious to start the third stage training. Before leaving Suotuo City today, he gave the Shrek Seven Devils a very simple task. Within these two months, first, dealing with their own problems, second, assimilating the combat experience obtained from the past month of spirit fighting.</p><br/><p>At the same time these two months were also a time for spirit power training, Grandmaster requested that, besides necessary matters, each person would focus their energy on cultivating spirit power.</p><br/><p>Oscar very quickly entered dreamland, but Tang San thought over his affairs.</p><br/><p>There were still two months, he had to handle some necessary matters well, especially his promise to Ning Rongrong, what is called accepting a commitment, working honestly, promises to others naturally must be satisfied.</p><br/><p>Thinking of this, Tang San got up and left the dorm, walking over toward Ning Rongrong and Xiao Wu’s dorm.</p><br/><p>“So tired!”</p><br/><p>Ning Rongrong and Xiao Wu were right now both taking off their outer clothing, each lying down on their beds. They naturally wouldn’t be as slovenly as Oscar, the bed covers and sheets and other bedding had been changed for new ones.</p><br/><p>Xiao Wu said:</p><br/><p>“Yeah, when fighting in Suotuo day after day I wouldn’t have thought that when coming back I would feel so tired. This must be what Grandmaster called the fatigue period. Rongrong, your skin really is nice. Even I can’t help but drool.”</p><br/><p>Ning Rongrong and Xiao Wu right now only wore half length chest cloths and small hot pants, sprawling on the bed with bare arms and legs.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Ning Rongrong indeed had nice skin. Among the three girls of the Shrek Seven Devils, Xiao Wu and Zhu Zhuqing envied her tender lychee-like skin, her fair skin was basically without blemishes, and especially that kind of gem like sleek feeling. It truly was a feeling like sheep fat white jade[1].</p><br/><p>Although they both weren’t completely developed, girls always developed earlier than boys, and the small figures already had come far.</p><br/><p>Of course, in terms of development, Zhu Zhuqing clearly was ahead among the three girls.</p><br/><p>Ning Rongrong giggled, opening her eyes wide and looking suddenly at Xiao Wu,</p><br/><p>“You’re also very pretty. I’m pure white, and you’re pink white, I don’t have your healthy appearance.</p><br/><p>Xiao Wu’s proportions were slightly off from an ordinary person, her legs were especially long.</p><br/><p>Generally speaking, a human body to leg proportion of sixty two percent or so was the perfect golden ratio, but Xiao Wu already surpassed sixty five. She still didn’t give people a feeling of being lanky, instead rather harmonious.</p><br/><p>Those somewhat overly long legs stretched out, skin equally delicate, although not as white as Ning Rongrong, rather somewhat flushed. Especially below her slender waist, since her waist was truly thin, it drew a perfect arc down to her pert buttocks. The long legs revealed below the hotpants made even Ning Rongrong drool.</p><br/><p>Adding her perfect figure to the scorpion braid long enough to reach the ground, she gave people a kind of lovely next door neighbour little sister feeling.</p><br/><p>Of course, of someone truly took her for an impressionable neighbourly little sister, perhaps that scene with the vulgar uncle Bu Le would be staged again.</p><br/><p>Ning Rongrong lowered her voice, saying:</p><br/><p>“Xiao Wu, tell me, why don’t we have Zhuqing’s size here! I really envy her.”</p><br/><p>While speaking, Ning Rongrong lightly rubbed her chest.</p><br/><p>Xiao Wu blushed, lightly spitting out:</p><br/><p>“You should ask her, how would I know. Is it really better to be big there?”</p><br/><p>The subjects in the girl dorms were frequently more heated than in the boys’ dorms. Ning Rongrong cackled:</p><br/><p>“How could it be bad, back when I was at the school, the men liked women who were big there, might be we’re still too young. You see boss Dai chase after Zhuqing every day, perhaps it’s because she’s big there.”</p><br/><p>Xiao Wu giggled, saying:</p><br/><p>“What do you know, isn’t Oscar also chasing after you every day.”</p><br/><p>Ning Rongrong stuck out her tongue, saying:</p><br/><p>“Actually little Ao is a good person, only……”</p><br/><p>Saying this, she couldn’t help sighing. Her expression appeared somewhat strange.</p><br/><p>“What is it?”</p><br/><p>Xiao Wu puzzled asked.</p><br/><p>Ning Rongrong softly shook her head,</p><br/><p>“School regulations. Me and little Ao is impossible. Furthermore, we’re both still this young, it’s still too early to talk about this.”</p><br/><p>Xiao Wu puzzled said:</p><br/><p>“What rules? Don’t tell me it’s because Oscar isn’t from a noble family?”</p><br/><p>Ning Rongrong shook her head:</p><br/><p>“That’s not it. Our Seven Treasures Glazed Tile School never discriminates against Spirit Masters with common backgrounds. Otherwise, how would we have so many Spirit Masters willing to be affiliated to the clan. Only, by clan regulations, members directly related to the clan mustn’t join with auxiliary system Spirit Masters, this is also for security considerations for direct clan members. Generally speaking, our clansmen are united with battle Spirit Masters, after all, protection from a spouse will always be more reliable than other people. But little Ao is also an auxiliary system Spirit Master, that’s why I say it’s impossible between us.”</p><br/><p>Xiao Wu suddenly understood:</p><br/><p>“So it’s like this. Your Seven Treasures Glazed Tile School have such rules. However, you should tell little Ao this earlier, let him have some other considerations.”</p><br/><p>Ning Rongrong’s beautiful eyes were despondent for a moment, then she forcefully roused herself and said:</p><br/><p>“Don’t talk about me, let’s move over to you, I really envy you and Tang San.”</p><br/><p>Saying this, her face suddenly took on a mysterious expression,</p><br/><p>“I heard, if you want to grow a bit bigger here, letting a man massage you has results. Why don’t you let Tang San massage you.”</p><br/><p>“Pah, Rongrong, why are you like this.”</p><br/><p>Xiao Wu’s charming face blushed furiously,</p><br/><p>“Who told you all of this!”</p><br/><p>Ning Rongrong grinned:</p><br/><p>“Clan big sisters, I heard them talking about it. Should be true.”</p><br/><p>Xiao Wu snapped:</p><br/><p>“Don’t talk nonsense, me and little San are siblings, how could……, aiya, you’d embarrass the dead.”</p><br/><p>Ning Rongrong turned over and sat up on her bed,</p><br/><p>“The way I see it, it’s big brother and little sister, but you also aren’t blood related. If you ask other people, nobody would regard you as siblings. You simply belong to little San. You haven’t seen little San’s appearance when his eyes turn red for you. He’d scare the dead, last time in Star Dou Great Forest when you were snatched by the Titan Giant Ape, it was like he went completely insane. If it weren’t for you coming back later, I really don’t know what he would have done. Last time when me and Zhuqing gossipped, even Zhuqing envied you. She told me then that if Dai Mubai was like little San she’d be satisfied.</p><br/><p>Xiao Wu said:</p><br/><p>“Rongrong, did she say what her relationship with Dai Mubai actually is? Why would boss Dai treat her so specially? Like when we just entered the Academy, you’re also very beautiful, but we didn’t see any reaction from boss Dai.”</p><br/><p>Ning Rongrong stuck out her tongue, saying:</p><br/><p>“I also don’t know. I asked, but Zhuqing didn’t want to say, just telling me a line about them being acquainted from before, perhaps it’s childhood sweethearts, but I can’t say for sure.”</p><br/><p>Xiao Wu shook her head, she still clearly remembered the first time Dai Mubai saw Zhu Zhuqing when she and Tang San had just come to the Academy. He seemingly didn’t know her and only said the two might be able to use the spirit fusion ability.</p><br/><p>At this moment, there was a sudden knock on the door.</p><br/><p>Ning Rongrong asked:</p><br/><p>“Who is it?”</p><br/><p>“It’s me, Tang San.”</p><br/><p>“Ah, your little San’s here.”</p><br/><p>Ning Rongrong hurriedly pulled on her clothes. Xiao Wu also jumped with fright, and she didn’t move as fast as Ning Rongrong. Once Ning Rongrong stepped forward to open the door, she’d barely managed to get her clothes on.</p><br/><p>Stepping into the two girls’ dorm, Tang San was also somewhat embarrassed. Making him even more baffled was that Ning Rongrong and Xiao Wu both looked at him with somewhat strange expressions.</p><br/><p>“What? Why are you both looking at me like that?”</p><br/><p>Tang San distrustfully asked.</p><br/><p>“This, ah, it’s because……”</p><br/><p>Ning Rongrong giggling just started to speak, but a furiously blushing Xiao Wu hastily covered her mouth, Xiao Wu glared at her brimming with menace while her heart thumped like a little deer, thinking of what Ning Rongrong said before, her chest couldn’t help but feel a burst of numbness.</p><br/><p>Tang San naturally couldn’t understand the minds of these girls, he could even less know of the little secrets they talked about in their chambers. Momentarily feeling somewhat at a loss what to do, were it not for truly having some business, perhaps he would’ve first left the room.</p><br/><p>Ning Rongrong repeatedly nodded to Xiao Wu, indicating she wouldn’t make any irresponsible remarks, Xiao Wu then removed her hand from her mouth, stepping forward to obstruct Ning Rongrong and asked Tang San:</p><br/><p>“Little San, why did you come?”</p><br/><p>Tang San smiling said:</p><br/><p>“I came for Rongrong, we still have two months before going to the Heaven Dou Imperial Academy. I previously promised Rongrong to help her family by providing mechanical hidden weapons. After we go to Heaven Dou Academy, perhaps I might not have the time, therefore I wanted to confirm this matter with Rongrong.”</p><br/><p>Ning Rongrong then knew Tang San had come to find her,</p><br/><p>“Little San, you gave me the Zhuge Godly Crossbow just a few days ago. This matter is something only my dad can decide, for the moment it’s still enough. It would be better like this, I’ll ask dean Flender for a leave of absence for a trip home. I think dad should agree.”</p><br/><p>In this month participating in spirit fights, the components for altogether ten Godly Zhuge Crossbows had already been manufactured, Tang San would smoothly reassemble them and give one each, by now, Tang San’s mechanical hidden weapon had already been successfully reproduced for everyone.</p><br/><p>Tang San nodded, saying:</p><br/><p>“That’s also fine, only, will you be safe returning alone?”</p><br/><p>Ning Rongrong giggled, saying:</p><br/><p>“I couldn’t not be safe. Actually I know that around our Academy there have always been bodyguards from our family. It would be impossible for dad not to know I’m here. He’s never had people bring me back, so clearly he approves of me studying at the Academy, when I return there I will naturally have protection.”</p><br/><p>Tang San suddenly understood:</p><br/><p>“Then like this would be best. Rongrong, don’t forget how to use those hidden weapons, when using them you have to take all possible care, don’t get injured accidentally. Especially the Godly Zhuge Crossbow, it’s too powerful, furthermore it also requires time to arm, so don’t use it rashly.”</p><br/><p>Ning Rongrong smiled:</p><br/><p>“I know. Well, then I’ll go look for the dean right now. Actually, my family’s Seven Treasure City isn’t far from Heaven Dou Imperial City, later I’ll go directly from home to Heaven Dou Imperial Academy to find you.”</p><br/><p>Tang San said:</p><br/><p>“If it’s like this, then you going back right now doesn’t matter, wait until after we’re at Heaven Dou Imperial Academy. Only that side is comparatively far from Suotuo City, I don’t know whether it will be easy to again find as good a smithy as here.”</p><br/><p>Ning Rongrong smiled:</p><br/><p>“So you were worried about this, that’s no problem, my home has smithies. If you’re not worried about leaking your hidden weapon secrets, letting the smithies at my home make the components is fine, the craftsmanship absolutely won’t be an issue.”</p><br/><p>[1] A classifier for extremely glossy and smooth white jade.</p><br/>\n</div>"}