{"title": "Chapter 52", "id": 52, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-52", "volume_title": "Volume 1", "body": "<h1>Chapter 52</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52</p><br/><p>Eight Spider Lances, Decisive Outcome</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>But, a scene nobody could have imagine occurred. What Tang San did proved that to Spirit Masters on the battlefield, victory didn’t necessarily require relying on strength, but could be accomplished with wisdom and planning.</p><br/><p>In an instant a figure appeared before Tang San like a moth drawn to a flame, directly hiding Tang San’s shape, practically protecting all of Tang San behind him, if the tortoiseshell shields were to hit Tang San, then they first had to pass through this person.</p><br/><p>The one suddenly appearing in front of Tang San wasn’t a stranger, but Emperor Team’s captain, Blue Lightning Tyrant Dragon Spirit Master Yu Tian-Heng.</p><br/><p>How was it possible? This was the first thought that appeared in the minds of all members of the Emperor Team, immediately afterward, they clearly saw Yu Tian-Heng’s current circumstances.</p><br/><p>Yu Tian-Heng naturally wouldn’t help Tang San block his teammates’ attack, and even if he would, with his current condition, it wouldn’t be possible for him to reach Tang San’s side. But all this had already been planned in advance by Tang San, the foreshadowing was buried in the first opening moments of the spirit fight.</p><br/><p>Yu Tian-Heng was completely entangled in Blue Silver Grass, forcefully pulled in front of Tang San to act as his meat shield.</p><br/><p>Earlier when the two sides first clashed, Yu Tian-Heng had fallen into Tang San’s schemes, when he suffered injuries under the Shrek Seven Devils’ siege, at the start of that siege, when Tang San used Blue Silver Grass to bind him. Blue Silver Grass currently had three spirit rings, it also had three spirit abilities. Binding was no doubt the most practical, Spider Web Restraint naturally was the most potent. But, that unassuming second spirit ring ability shouldn’t be neglected. The current scene was a direct result of Tang San’s second spirit ring ability: Parasite.</p><br/><p>Although Yu Tian-Heng had recovered his fighting strength under the assistance of Nine Heart Flowering Apple Xie Lingling’s assistance, Blue Silver Grass’ seeds had quietly been lodged on his body under the use of Binding, when the second spirit ability was launched, the parasitic seeds would follow Tang San’s control.</p><br/><p>When Tang San turned to launch his Spider Web Restraint at the Wind Chime Bird Spirit Master, he simultaneously secretly activated the Parasites on Yu Tian-Heng’s body, using his Blue Silver Grass to forcefully pull him over in front of him.</p><br/><p>Currently Yu Tian-Heng was really too weak, if he was in peak condition, he could struggle free of the Blue Silver Grass restraints without the need for Thunder Fury, but right now it was basically impossible for him to accomplish this.</p><br/><p>Tang San grasped not only the situation on the battlefield, but at the same time the hearts of the opponents. With two lifetimes, he possessed not just the wisdom of thirteen years, rather the experience of almost forty. Even though Xiao Wu’s injuries made him furious, with the disaster he encountered in Star Dou Great Forest he understood that anger basically couldn’t settle the issue, only by maintaining a cool head for the moment would he be able to clearly see every change the narrow target of the battle.</p><br/><p>If the two Black Tortoise Spirit Masters’ tortoiseshell shields could only be thrown and not withdrawn, Tang San wouldn’t have done something like this, when weakened Yu Tian-Heng only had the body of a normal person, basically insufficient to stop the Black Tortoise Spirit Masters’ tortoiseshell shield attack, it would only be adding a life. But in the previous fight Tang San already clearly saw that their tortoiseshell shields could be withdrawn, and thus this scene appeared.</p><br/><p>When the two brothers Shi Mò and Shi Mó were about to defeat Tang San, Yu Tian-Heng suddenly appeared, immediately turning the two pale with fright. Confronted by the body of their captain, they didn’t even think about it. Exerting all their spirit power the forcefully pull the tortoiseshell shields to change direction.</p><br/><p>But, in order to defeat Tang San they had attacked with full strength, the tortoiseshell shields were not only extremely heavy but even more infused with their enormous spirit power, how could they be withdrawn? The Black Tortoise Spirit Masters were admittedly powerful, but this pair of brothers were still far from the level where they could easily withdraw.</p><br/><p>In the end the pair succeeded in breaking off the tortoiseshell shield attack, the four tortoiseshell shields brushing by a hair’s breadth from Yu Tian-Heng, flying to either side. But using such strength made these two brothers’ stomachs cramp, simultaneously spitting blood. And at this moment, a silhouette shot out from behind Yu Tian-Heng like a shooting star, in practically only a moment it was already in front of them. That was precisely the bloody-eyed Tang San.</p><br/><p>Tang San’s movements were extremely fluent, throwing Spider Web Restraint, dragging Yu Tian-Heng, immediately afterward, the Eight Spider Lances on his back simultaneously pierced the ground, supporting his body, the middle joints of the Eight Spider Lances bending simultaneously, again stretching out with full strength, their formidable flexibility sending out Tang San like a bolt of lightning.</p><br/><p>Standing on the Shrek Seven Devils’ side a satisfied expression flashed through Grandmaster’s eyes, muttering to himself:</p><br/><p>“Control the battlefield, control the team, control the enemy, control the heart. Little San, you have finally grasped the full meaning of the control system Spirit Master.”</p><br/><p>The instant Tang San used Eight Spider Lances to leap, he knew that this spirit battle was already finished. Losing the crucial protection of the tortoiseshells, even though the Black Tortoise Spirit Masters were two, how could they block Tang San’s Eight Spider Lances?</p><br/><p>The lustrous purple Eight Spider Lances extended in midair, sharp points like eight cold stars simultaneously thrusting at the Black Tortoise Spirit Masters.</p><br/><p>Out of the tortoiseshells, their own spirit power lashing back, speed not being their expertise. The Black Tortoise Spirit Masters only had one method left to them, blocking.</p><br/><p>The two roared loudly, fists swinging at Tang San in the air, spirit power bursting out, earthen yellow light soaring up.</p><br/><p>The Black Tortoise Spirit Masters’ spirit power was as heavy as their tortoiseshells, unfortunately, they didn’t have the strength to truly concentrate their spirit power. Using spirit abilities, how could they still be in peak condition after consuming their spirit power.</p><br/><p>Eight Spider Lances as an external spirit bone, once used, in itself had a fifty percent amplification effect on Tang San’s attack power, it was also sharp like a spear. If they still had the tortoiseshells the two Black Tortoise Spirit Masters might still have been able to block it, but right now there basically wasn’t enough time to recover their tortoiseshells.</p><br/><p>Bright purple light pierced into the yellow concentrated spirit power and erupting in a chain of explosive sounds, the lustrous purple spider lance points basically didn’t give the opponents a chance. Eight Spider Lances under Tang San’s control, separately passed through the opponents’ spirit power, piercing the Two Black Tortoise Spirit Masters’ shoulders and arms. In the flickering purple light, Tang San didn’t pause, his body flipping in the air, once again using Eight Spider Lances to shoot up, directly pouncing at the Jade phosphor Serpent Spirit Master Dugu Yan.</p><br/><p>With a humming sound, the tortoiseshells each returned to the Black Tortoise Spirit Masters, in a flash becoming yellow light and merging into their bodies, but the two Black Tortoise Spirit Masters were no longer able to stand, purple qi welling out of their arms, the two simultaneously toppled, bodies spasming violently.</p><br/><p>Eight Spider Lances possessed the extreme toxicity of the Man Faced Demon Spider that couldn’t be compared to the supplemental poison on the Blue Silver Grass. Under the toxin of the Eight Spider Lances, even if the two Black Tortoise Spirit Masters’ had even more powerful spirit power it would still be impossible for them to resist it.</p><br/><p>Although they weren’t stabbed in the vitals, right now their injuries were the most critical of the Emperor Team.</p><br/><p>Watching the lustrous purple Eight Spider Lances descend from the air, Dugu Yan’s eyes were filled with a fearful light, before the start of this spirit fight she had never thought her side could lose, but at this moment, facing Tang San, she already didn’t have any desire for fighting.</p><br/><p>Her most powerful third spirit ability had easily been broken by this man before her, she with poison for fighting strength, still had what qualifications to go on fighting Tang San? What she was capable of right now was only spitting out another cloud of poison mist, that’s all.</p><br/><p>The strange purple lustre on the Eight Spider Lances glittered, like all rivers running into the sea[1] the violet poison mist Dugu Yan was doing her utmost to once again spit out unexpectedly frantically rushed towards the Eight Spider Lances, and in an eyeblink it was already swallowed up.</p><br/><p>Four of Tang San’s eight Eight Spider Lances stretched down to the ground, propping up his body, two of the other four easily piercing Dugu Yan’s serpent tail, with an effort unexpectedly raising her into the air.</p><br/><p>By now, all the Emperor Team members that could fight had already lost the capability to continue the battle.</p><br/><p>Nine Heart Flowering Apple Spirit Master Xie Lingling’s eyes equally revealed a panicked expression, although her Nine Heart Flowering Apple once again used its power, healing the injured Spirit Masters on their side, it was unable to recover the Battle Spirit Masters’ expended spirit power, and even more unable to remove the terrifying toxin of the Eight Spider Lances.</p><br/><p>“Put her down, we concede.”</p><br/><p>Yu Tian-Heng watched Dugu Yan raised up by Tang San’s Eight Spider Lances, his heart abruptly contracting.</p><br/><p>He clearly saw that not far from him lay the two Black Tortoise Spirit Masters whose arms had been hit, their arms having swollen up to twice their normal size, their faces covered with purple qi, seemingly on the point of dying.</p><br/><p>The Spider Lances swung easily, throwing Dugu yan to the side. Tang San didn’t pay any attention to Yu Tian-Heng, the four upper Spider Lances pointing in front of him, sharp points closing in on Nine Heart Flowering Apple Spirit Master Xie Lingling,</p><br/><p>“Treat our people.”</p><br/><p>“Little San, first detoxify them.”</p><br/><p>Just at this time, Grandmaster’s timely voice reached the baleful Tang San’s ears, making him slightly distracted.</p><br/><p>Eight Spider Lances would give Tang San strong evil tendencies, making his attacks become even more severe, unable to control his awareness. Hearing Grandmaster’s words, the raging fury in Tang San’s heart gradually calmed. Blue Silver Grass dispersed in all directions, simultaneously pulling the two Black Tortoise Spirit Masters and Dugu Yan towards him.</p><br/><p>The reason Grandmaster reminded him this time was that he well knew the severity of Tang San’s Eight Spider Lances’ toxin, and that in such a tense battle Tang San clearly wasn’t able to hold back.</p><br/><p>If it had been just a little later, perhaps those three would have directly withered away from the poison, just like that tree the time they tested Eight Spider Lances in the grove.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Dugu Yan was a poison Spirit Master herself and still somewhat able to resist the Eight Spider Lances poison, but the two Black Tortoise Spirit Masters’ circumstances were extremely dangerous, if not for Grandmaster’s warning, a moment later even Tang San would have been unable to bring them back to life. When Tang San withdrew the Eight Spider Lances poison, inwardly he was shocked, because the Eight Spider Lances supplemental poison had already closed in on their hearts.</p><br/><p>However, while Tang San treated the opponents he also didn’t forget his original intention, besides the three people pierced by Eight Spider Lances at his side, an additional Blue Silver Grass strand wound around the waist of Xie Lingling, pulling her before him as well. Since Tang San was still propped up by Eight Spider Lances, Xie Lingling was naturally lifted off the floor and brought over.</p><br/><p>Xie Lingling’s mask was black muslin, being very close, Tang San discovered that this mysterious auxiliary system Spirit Master possessed a pair of extremely beautiful big eyes, the expression in her eyes could be clearly seen, without any impurity, slender eyelashes slightly curved, between soft winks like they could speak.</p><br/><p>“Assist my companions, otherwise, they will still die.”</p><br/><p>Tang San’s voice was very serene, without a trace of cold intent or mood within. But it was this kind of serene way of speaking that left an extremely deep mark in Xie Lingling’s heart, how was this still a man? His voice sounded somewhat young and tender, but his actions were so ferocious. Control, attack, poison, in today’s fight, rather than saying Emperor Team was beaten by Shrek Seven Devils, it would be better to say it was done by him alone.</p><br/><p>Xie Lingling didn’t utter a word, shaking in fear barely managing to gather her spirit power, Nine Heart Flowering Apple light flew out, lightly covering Xiao Wu’s body.</p><br/><p>With the poison removed from the bodies of the Black Tortoise Spirit Masters and Dugu Yan, Tang San raised his head to look towards the for a long time mute White Dove female Spirit Master and announcer Doudou,</p><br/><p>“Shouldn’t you be announcing the results of this spirit fight?”</p><br/><p>Doudou at this awoke like from a dream, basically not daring to look Tang San in the eye, hastily announcing:</p><br/><p>“Team spirit fight, Shrek Seven Devils’ victory.”</p><br/><p>Without any cheers, Oscar and Ma Hongjun stepped forward, feeding small sausages to Xiao Wu, Dai Mubai and Zhu Zhuqing. The poison mist on the spirit fight ring gradually cleared, both sides’ Spirit Masters all somewhat silent. Although the battle was over, they still attentively gazed at the opponents.</p><br/><p>Tang San didn’t withdraw Eight Spider Lances, his gaze fixed on Xiao Wu, as he saw her wounds swiftly close under the aid of Nine Heart Flowering Apple, he inwardly breathed out in relief.</p><br/><p>As Ning Rongrong helped Xiao Wu off the ground, she appeared to be a bit pale but otherwise unhindered.</p><br/><p>Tang San at this withdrew his Blue Silver Grass and Spider Web Restraint from the Emperor Team, leaping with Eight Spider Lances he returned to his companions’ side.</p><br/><p>Dai Mubai looked at Tang San with a somewhat complicated expression in his eyes,</p><br/><p>“Little San, apparently it’s really only when Xiao Wu is in danger that you’ll become an Asura incarnate, huh.”</p><br/><p>Tang San’s eyes were already softening, the red light in his eyes quietly dispelling, Xiao Wu softly nodded to him, indicating she was already fine.</p><br/><p>It was only at this moment the Shrek Seven Devils became conscious that they had truly prevailed over the formidable enemy in front of them. The faces hidden under the masks all by chance wore smiling expressions. To them, this spirit fight’s difficulty had been unprecedented, also pressuring them to use their full strength - Tang San’s Eight Spider Lances, Dai Mubai and Zhu Zhuqing’s Spirit Fusion Ability - to reverse the flow of victory and defeat. Of course, Tang San’s control as the team’s soul had also been displayed vividly and thoroughly. Without that clever control, this spirit fight victory still wouldn’t have been theirs.</p><br/><p>But on the other side, the Emperor Team’s members were also supporting each other to gather. Everyones’ complexions were all very unsightly, especially Yu Tian-Heng and the two Black Tortoise Spirit Masters. Their current expressions were so rigid that it seemed water would be squeezed out.</p><br/><p>Yu Tian-Heng stared towards the Shrek Seven Devils, just in time to meet the gaze Dai Mubai gave them. Who knows how many times these two had looked face to face, but this time the circumstances were already very different.</p><br/><p>“You’re very powerful. But, we weren’t completely outdone by you.”</p><br/><p>Yu Tian-Heng said.</p><br/><p>Dai Mubai calmly said:</p><br/><p>“Right. Your own teamwork has flaws, otherwise, it couldn’t be said who would have come out on top in this spirit fight.”</p><br/><p>Yu Tian-Heng’s strength had gained Dai Mubai’s respect, it was still his first time meeting such a tyrannical opponent on the same level as him. As Emperor Team’s captain, Yu Tian-Heng had practically endured the overwhelming majority of the combined firepower of the Shrek Seven Devils, but he still persisted in fighting to the very last moment. Although Emperor Team had lost this spirit fight, Dai Mubai understood that the Blue Lightning Tyrant Dragon hadn’t at all lost to his Evil Eye White Tiger.</p><br/><p>Yu Tian-Heng sighed inwardly, nodding to Dai Mubai,</p><br/><p>“I hope we’ll still have the opportunity to fight again later. Then we won’t have any more flaws.”</p><br/><p>Dai Mubai smiled faintly,</p><br/><p>“The victory will still be ours.”</p><br/><p>The two’s gazes once again collided in a shower of sparks, Yu Tian-Heng drew a deep breath, then to the Black Leopard Spirit Master Osler supporting him and the others saying:</p><br/><p>“We’re leaving.”</p><br/><p>The party of seven slowly walked towards the Spirit Master entrance with somewhat staggering steps. Defeat made their departing figures seem somewhat frail.</p><br/><p>Jade Phosphor Serpent Spirit Master Dugu Yan suddenly paused, turning her head to look at Tang San who was slowly withdrawing his Eight Spider Lances,</p><br/><p>“Your poison is very ferocious, even capable of breaking my serpent venom. I’ll always remember my disgrace today. One day, I’ll let you fall before my serpent venom as well.”</p><br/><p>Tang San serenely looked at the opponent, calmly replying:</p><br/><p>“I’ll look forward to it.”</p><br/><p>Turning her head along with Dugu Yan was still Nine Heart Flowering Apple Spirit Master Xie Lingling, her gaze was different from Dugu Yan’s resentment, rather a shaking in fear kind of lustrous brilliance, looking deeply at Tang San, wanting to say something but in the end without speaking up. Turning around and leaving along with her companions.</p><br/><p>Watching the opponents’ backs, Dai Mubai suddenly smiled,</p><br/><p>“We won.”</p><br/><p>Oscar grinned, handing over a recovery sausage to everyone,</p><br/><p>“Yes, we won.”</p><br/><p>Seven people looked at each other, each extending their right hand. Shrek Seven Devils’ seven hands piled up in the air, chewing Oscar’s big sausage, in this moment the joy of victory and camaraderie bursting out.</p><br/><p>Applause suddenly echoed, amplified by special equipment from within the VIP lounges. Shrek Seven Devils’ display won the hearts of the audience, and even though the quantity of spectators wasn’t as high as on the outside, to a victory like this, this judicious applause was a perfect end to such a powerful collision of a team spirit battle.</p><br/><p>Qin Ming from beginning to end stood at the entrance of the passage, waiting for his disciples to walk over one by one. On his face wasn’t any displeased expression, instead wearing a faint smile. It seemed that to him, this might be a very good result.</p><br/><p>“I’m sorry, teacher Qin, we lost.”</p><br/><p>Yu Tian-Heng stopped before Qin Ming, lowering his always arrogant head.</p><br/><p>Qin Ming didn’t speak, only calmly looked at him, Yu Tian-Heng could be said to be the disciple he was most proud of, but he was also prideful.</p><br/><p>Yu Tian-heng continued:</p><br/><p>“The responsibility for today’s defeat is all mine. I didn’t lead well enough, acting like a lone warrior, falling into the opponents’ trap. If you wish it, punish me.”</p><br/><p>Qin Ming was in no way a gentle person, just the opposite, when he taught his disciples he was extremely strict, readily using severe punishments.</p><br/><p>“No, captain, this can’t be blamed at you. Who could have expected the opponents would be so treacherous.”</p><br/><p>Black Leopard Spirit Master Osler hastily covered for Yu Tian-Heng.</p><br/><p>Yu Tian-Heng sighed lightly, shaking his head:</p><br/><p>“No, Osler, treachery is all the same a strength, losing is losing, in circumstances where we outclassed the opponents in spirit power and spirit rings we still lost, this can only prove we made too many too large mistakes in this fight.”</p><br/><p>“Tian-Heng, even if there were mistakes, the mistakes still weren’t yours. It was me, as control system Spirit Master, the team’s soul, I’m the commander in the field, it was me who didn’t lead everyone well enough.”</p><br/><p>From childhood, Dugu Yan had very rarely wept, in her twenty years of life she had practically always sailed with favorable winds. A rare poison type control capability, a profound background, formidable spirit power among her peers, always placing her at the summit of the pyramid. Today’s defeat was a larger blow than to anyone else, at this moment, humiliated tears subconsciously flowed from her eyes.</p><br/><p>The two Black Tortoise Spirit Masters didn’t speak, Yu Feng wanted to say something but was stopped by Qin Ming’s raised hand.</p><br/><p>“To you, although this is a defeat, it’s still a good thing.”</p><br/><p>Qin Ming spoke with a smile. His tone not the slightest strict to the Emperor Team members.</p><br/><p>Yu Tian-Heng looked blankly at Qin Ming, in his heart immediately understanding something.</p><br/><p>Osler couldn’t help but say:</p><br/><p>“Teacher Qin, we lost this badly, how is it still a good thing?”</p><br/><p>Qin Ming calmly said:</p><br/><p>“Because, until now your experiences have all really been too smooth. Now you have admittedly met with a setback, but this setback after all hasn’t let anyone among you suffer irrevocable harm. If this setback had occurred in the future, then perhaps you would understand all this at the price of your life. Being defeated isn’t frightening, what’s frightening is being unable to learn from defeat. I think you should already have found some of your mistakes. Then, when you meet this kind of opponent next time, you will become even more formidable. Shrek Seven Devils defeated you, but at the same time they woke you up. Each of you have profound talent. I only present you with these words.”</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Here he paused, gaze sweeping across the Emperor Team’s members,</p><br/><p>“Growth in defeat.”</p><br/><p>“Growth in defeat.”</p><br/><p>The Emperor Team members all repeated Qin Ming’s words.</p><br/><p>Qin Ming waved his hand,</p><br/><p>“You all return to rest. Recover as quickly as possible. I still have to go see some people.”</p><br/><p>Finished speaking, Qin Ming turned around and left with large strides.</p><br/><p>Completely opposite to the gloom of the Emperor Team, as Shrek Seven Devils walked through the applause to Grandmaster, Flender and Zhao Wuji, their eyes were filled with excitement that couldn’t be suppressed.</p><br/><p>The two master and disciple Grandmaster and Tang San looked face to face, in Grandmaster’s eyes Tang San saw satisfaction. Obtaining his Teacher’s approval, to Tang San was even more significant than the audience’s applause.</p><br/><p>Grandmaster wasn’t stingy with his very satisfied words,</p><br/><p>“Very good, you won, you not only prevailed over the opponents, at the same time you also defeated yourselves. This team spirit fight today, even if it was the second stage training exam, you all passed my test with exceptional grades.”</p><br/><p>Oscar grinned, saying:</p><br/><p>“Grandmaster, then after we return, shouldn’t we have a vacation?”</p><br/><p>To the side Flender frowned:</p><br/><p>“You brats still can’t be too complacent. Don’t tell me you can’t see how lucky today’s victory was? In a genuine contest of strength you wouldn’t be the match of Emperor Team.”</p><br/><p>Oscar said:</p><br/><p>“But, dean, I remember you once taught us that luck is also a kind of strength. Don’t tell me you’ve already forgotten?”</p><br/><p>“Eh……, you stinking brat. Humph.”</p><br/><p>Although Flender’s mouth was reprimanding Oscar, in fact, inwardly he was even more excited than Grandmaster.</p><br/><p>Shrek Academy could be said to be firmly managed by him until now. But right now, the most outstanding Shrek Academy students in its history had arrived.</p><br/><p>He believed that in less than twenty years these children before him would bring a storm to the entire Douluo Continent’s Spirit Master world. A true storm.</p><br/><p>Zhao Wuji smiling said:</p><br/><p>“Fine, Flender, you don’t have to appear strict when you’re soft inside, this time the children have also worked hard. Grandmaster, you say whether they can rest for a time once we’re back.”</p><br/><p>Grandmaster slowly nodded,</p><br/><p>“We should let them rest a while. When we return, we’ll give them half a month of vacation. They can do whatever they wish. Afterwards I will consider when to begin the third stage training.”</p><br/><p>“Ah? There’s still a third stage?”</p><br/><p>Besides Tang San, the other six couldn’t help but simultaneously cry out in alarm.</p><br/><p>Grandmaster only swept his flat gaze over them, his face also recovering to its traditional rigidity,</p><br/><p>“Why? You have any complaints?”</p><br/><p>“No, no, of course not. Grandmaster, you are the wisest. Let alone the third stage, even if it’s the fourth or fifth, we will certainly be able to persevere.”</p><br/><p>Oscar rushed to reply. The others were all inwardly wiping sweatdrops.</p><br/><p>They all had to admit that Grandmaster’s training methods undoubtedly had superb results, but nobody wanted to think back to the suffering they had experienced. The first and second stages were already so difficult, what could that third stage training be?</p><br/><p>At that moment, a person was strolling over. Before he reached them, his voice preceded him,</p><br/><p>“Dean Flender, vice dean Zhao Wuji, are you well? Disciple Qin Ming pays his respects.”</p><br/><p>The arrival was precisely Emperor Team’s coach teacher Qin Ming, with just a few rapid steps, he kneeled before Flender and Zhao Wuji. Right now, he was already completely without the controlled calm he had before the Emperor Team, his eyes shone with emotion.</p><br/><p>Flender used his hand to prop up the glasses on his nose,</p><br/><p>“I still thought you’d forgotten us long ago, you stinking brat.”</p><br/><p>Zhao Wuji pulled up Qin Ming from the ground, sizing him up, then laughed out loud.</p><br/><p>“Good brat, you’re more and more ferocious. It seems that it won’t be much longer before you catch up to us old codgers.”</p><br/><p>Qin Ming deferentially put his hands down and stood up,</p><br/><p>“Regardless of how long, the two dean’s are always Qin Ming’s teachers, Qin Ming will also forever be a disciple of Shrek Academy.”</p><br/><p>Looking at the scene in front, the Shrek Seven Devils couldn’t help but be dumbstruck. Although they didn’t know what Qin Ming was actually doing, they had clearly seen Qin Ming at the entrance on the other side of the spirit fighting ring.</p><br/><p>This person clearly was very closely related to Emperor Team, but hearing the meaning in his words, wouldn’t he be…...</p><br/><p>Flender raised his hand, clapping hard at Qin Ming’s shoulder,</p><br/><p>“It’s already been so many years since you left the Academy, but you still are as awkward as before. Come, I’ll give you introductions, this is Grandmaster, these other seven little monsters you just now had a look at in the spirit fighting ring.”</p><br/><p>Qin Ming first deferentially saluted Grandmaster, furthermore with the courtesy of a disciple,</p><br/><p>“Hello, Grandmaster.”</p><br/><p>Grandmaster leaned to the side, without accepting his courtesy calmly saying:</p><br/><p>“No need to be polite.”</p><br/><p>Qin Ming looked at Grandmaster not accepting his courtesy and couldn’t help be a bit cold, to the side Flender smiled:</p><br/><p>“You are his nephew’s teacher, in this respect you and he are of the same generation, of course he won’t accept your courtesy.”</p><br/><p>Qin Ming puzzled looked at Flender, in Grandmaster’s eyes was a resentful light, apparently rebuking Flender for revealing his background.</p><br/><p>Flender grinned, saying:</p><br/><p>“Everyone here’s on our side, you don’t have to hide it. Don’t tell me you insist on me not telling everyone that Yu Tian-Heng is your nephew[2]?”</p><br/><p>“What?”</p><br/><p>The Shrek Seven Devils practically simultaneously cried out in shock, how could they have expected that Grandmaster would actually be born from the seven great clans, and even the one possessing the most attack power, Blue Lightning Tyrant Dragon clan.</p><br/><p>Grandmaster’s expression immediately became gloomy,</p><br/><p>“You already told them. Flender, I told you repeatedly that me and the Blue Lightning Tyrant Dragon clan haven’t had any relationship for a long time.”</p><br/><p>Leaving behind these words, Grandmaster turned around and left for the outside.</p><br/><p>Tang San stepped forward wanting to catch up to his Teacher, but Grandmaster raised his hand to stop him,</p><br/><p>“You still have to go calculate the points from this month’s spirit fights, you will later return with Flender. I have some business.”</p><br/><p>Following Grandmaster with his eyes, Tang San somewhat puzzled looked at Flender. In his heart he already gradually came to understand the reason. No wonder when Grandmaster mentioned the Blue Lightning Tyrant Dragon clan that time his expression was a bit peculiar.</p><br/><p>Originally he was from such a formidable Spirit Master clan, in that kind of clan, possessing such a feeble variant spirit as San Pao, if it was him, perhaps he also…...</p><br/><p>Flender somewhat remorsefully said:</p><br/><p>“It’s my shooting my mouth off. Never mind it, Xiao Gang is already long since used to this.”</p><br/><p>Qin Ming drew a long breath,</p><br/><p>“I really didn’t expect that Grandmaster unexpectedly was Tian-Heng’s uncle.”</p><br/><p>Flender’s expression very quickly recovered to normal, saying to the Shrek Seven Devils:</p><br/><p>“You’re certainly very baffled about why Qin Ming would come here. It’s actually very simple, he was also once like you, a person of the Shrek Academy. Furthermore he was still once our most outstanding student. Shrek Academy’s first graduate. Mubai, little San, Xiao Wu, not long ago you reduced the thirtieth rank speed record that was set by just Qin Ming.”</p><br/><p>Qin Ming smiled faintly to the Shrek Seven Devils, saying:</p><br/><p>“Hello all juniors. Teacher Flender, it seems our Shrek Academy’s growth is even better than before.”</p><br/><p>Zhao Wuji to the side somewhat helplessly said:</p><br/><p>“What ‘better’, these children are the Academy’s last batch of students.”</p><br/><p>Qin Ming was inwardly alarmed, subconsciously saying:</p><br/><p>“Don’t tell me the Academy’s financial problems still haven’t been settled?”</p><br/><p>Once the words were out he became conscious of his mistake, looking toward Flender with a somewhat embarrassed expression.</p><br/><p>Flender sighed,</p><br/><p>“It’s a fact, we’re not hiding it. Furthermore, we’re also tired. Along with the advancement of age, we no longer have the impulses of youth. After waiting for these children to graduate, I think, we can also go to something classified as our own lives. Qin Ming, you teach those students well, they can all be regarded as elites.”</p><br/><p>Qin Ming smiled wryly:</p><br/><p>“It’s not that I teach well, rather that those children possess superb talent and background on their own. I also don’t have the attraction capable of teaching them, rather our Academy has enough things to attract them.”</p><br/><p>“Eh? Saying this, you’re an Academy teacher?”</p><br/><p>Flender somewhat astonished looked at him.</p><br/><p>Qin Ming nodded, saying:</p><br/><p>“Teacher Flender, right now I’m teaching at the Heaven Dou Imperial Academy[3]. These seven children of Emperor Team are all the Heaven Dou Imperial Academy’s most outstanding disciples.</p><br/><p>Flender chuckled, saying:</p><br/><p>“With one look at you, I was reassured about this spirit fight. Fine, here is no place to be talking, come with us to a wine shop. So many years without seeing each other, we’ll chat.”</p><br/><p>Qin Ming delightedly nodded agreement, his gaze sweeping over the Shrek Seven Devils one by one, his thoughts secretly moving.</p><br/><p>He had clearly heard what Flender said, he also very clearly knew what kind of record he had held at the Shrek Academy, and unexpectedly three of these seven children had already broken his record, it was obvious their present age shouldn’t be high.</p><br/><p>[1] Idiom: Obtaining the same results by different means.</p><br/><p>[2] () The son of a brother.</p><br/><p>[3] ()</p><br/>\n</div>"}