{"title": "Chapter 64", "id": 64, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-64", "volume_title": "Volume 1", "body": "<h1>Chapter 64</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64</p><br/><p>Ice Fire Alchemical Body</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>The infernal delicate apricot had just the opposite effect of the octagonal mysterious ice grass, and it mustn’t be cut with metal: only by using jade would it not lose its efficacy.</p><br/><p>Although Tang San’s Mysterious Jade Hand wasn’t true jade, there was very little difference. Using Mysterious Jade Hand he could successfully excavate it.</p><br/><p>As he prepared all this, Tang San had already started feeling internal pains.</p><br/><p>He had already stayed next to the Ice and Fire Yin Yang Well for a considerable amount of time, and despite as much as possible staying where the two kinds of hot spring waters met, and also with the aromatic silk beauty immortal treasure to restrain both cold and hot poison, by now his body was still showing a reaction.</p><br/><p>This reaction had become especially clear after picking those two immortal treasures. Cold and heat alternately burst into him, and right now Tang San’s face was part blue and part red, his qi and blood roiling, Mysterious Heaven Skill less and less able to suppress them.</p><br/><p>Poison Douluo Dugu Bo naturally knew how difficult it was to stay by the Ice and Fire Yin Yang Well. That was why he had never brought even Dugu Yan here, afraid the atmosphere here would harm his granddaughter. But to his own toxic body the Ice and Fire Yin Yang Well’s troubles instead became beneficial, and naturally was no problem.</p><br/><p>Bringing Tang San here this time the old freak feigned magnanimity, while at the same time he really wanted to see whether Tang San, who claimed to be able to detoxify him, was able to survive in such a place. If he could even endure the power of the Ice and Fire Yin Yang Well, and still resist his poison, then he might truly believe that Tang San was able to treat him.</p><br/><p>Precious immortal treasures, Tang San sighed inwardly. He knew that if it wasn’t at the side of this Ice and Fire Yin Yang Well, perhaps any one kind of immortal treasure medicinal herb would remove anything poisonous nearby to protect itself.</p><br/><p>But here it was difficult for anything to live, therefore there were still immortal herbs. Ice didn’t protect. However, immortal herbs were better off. Still one had to clearly understand their properties to use them, otherwise, not only wouldn’t it be beneficial, on the contrary it would be deadly. Even those great healing immortal herbs, if they weren’t used in special ways and neutralized with other medicaments, their healing would result in death all the same.</p><br/><p>The two Blue Silver Grass flew out like unrolling bolts of silk, simultaneously falling to those two immortal herbs, the ends instantly wrapping them up like lightning. The two immortal herbs were thrown up simultaneously, falling in his direction.</p><br/><p>At the same time, both his hands simultaneously cut those two Blue Silver Grass strands. Without the support of spirit power Blue Silver Grass had limited durability and separated where Tang San cut them with Mysterious Jade Hand.</p><br/><p>Tang San’s choice was unmistakably correct, practically just a second after he severed the Blue Silver Grass the strand on the left had already frozen solid, the strand on the right had turned into ash. If he had let these immortal treasure herbs’ effects pass into his body, then he might have been out of luck before even using them.</p><br/><p>The two herbs landed in front of Tang San. Bizarrely, despite their extreme heat and cold, once in proximity, both cold and heat disappeared simultaneously.</p><br/><p>The octagonal mysterious ice grass was shrouded in red light, and the infernal precious apricot was covered in a layer of white.</p><br/><p>Tang San knew he couldn’t hesitate now, after these two immortal herbs had met, even though they suppressed each other, after ten breaths their effect would completely vanish.</p><br/><p>But within these ten breaths was the best time to take them.</p><br/><p>Without hesitating, Tang San picked up the two poisonous herbs and swallowed them with big gulps.</p><br/><p>Even though poisonous, after they were restrained by their nemeses, they lacked potency. On entering the mouth, and passing down the throat along with saliva, Tang San only felt himself drool, a sweet fragrance overflowing.</p><br/><p>The flavor really was good, Tang San thought to himself that it was fine as long as they didn’t become too spicy next.</p><br/><p>While pondering this, Tang San swiftly tore off all his clothes, no longer circulating Mysterious Heaven Skill, withdrawing the Eight Spider Lances on his back and the Blue Silver Grass in his surroundings.</p><br/><p>In just three breaths, Tang San’s body trembled fiercely, and immediately afterward a layer of icy blue spread up from his feet, in an eyeblink his whole body had become completely blue. The next moment a layer of red rose, this time Tang San looked like a just boiled shrimp. Blue and red alternated, creating a bizarre sight.</p><br/><p>But in this simple transformation process, Tang San’s mind nearly collapsed. Under two kinds of extreme shock it was even more painful than the time he absorbed the Man Faced Demon Spider spirit ring.</p><br/><p>Right now it was only with an effort he maintained a bit of control over himself, hastily drawing a deep breath, he staggered forward one step.</p><br/><p>Right in front of him was the Ice and Fire Yin Yang Well. With just enough time to close his eyes, Tang San fell into it right where the extreme cold yin side and extreme heat yang side met.</p><br/><p>Tang San entered the spring waters with a splash, turning and sinking below the surface.</p><br/><p>The reason he didn’t enter the spring immediately after eating the two immortal treasure herbs was to wait until the medicinal properties took effect, otherwise, if he fell into the water just a moment too soon he wouldn’t even leave bones behind.</p><br/><p>Now entering the waters right after the medicinal properties took effect he didn’t feel anything at all, since the octagonal mysterious ice grass and infernal precious apricot already completely removed his perception of the outside world.</p><br/><p>Tang San had naturally carefully thought over the reasons for choosing these two herbs. These two immortal treasure poisonous herbs weren’t the highest quality of those surrounding the Ice and Fire Yin Yang Well, they were actually fairly ordinary. If it had only been one kind, let alone eating them, just standing next to them would have put him in critical condition.</p><br/><p>But with fire and ice suppressing each other, as the two kinds of herbs came together and caused just that neutralizing effect, this was the only opportunity to use them.</p><br/><p>Of course, the two herbs hadn’t lost their fire and ice properties. After eating them, Tang San still had to endure a potent ice and fire baptism. If he was unable to endure he would immediately burst and die.</p><br/><p>The most significant reason for using them was the Ice and Fire Yin Yang Well, since according to the accounts in the Mysterious Heaven Treasure Record, the only way to enter the Ice and Fire Yin Yang Well was with the simultaneous effects of the octagonal mysterious ice grass and infernal precious apricot.</p><br/><p>These two plants had grown while absorbing the waters of the Ice and Fire Yin Yang Well, and it was only these that could subdue the terrifying power of the two kinds of spring water.</p><br/><p>Right now Tang San appeared to be in a crisis, but in fact, the effect of the Ice and Fire Yin Yang Well along with the two kinds of poisonous herbs boosted Tang San’s ability to absorb them, their ice and fire energies transforming his body.</p><br/><p>What Dugu Bo said about not touching the Ice and Fire Yin Yang Well really wasn’t empty words. Even as a Title Douluo, if he fell into the spring it would be very difficult for him to escape.</p><br/><p>But within this Ice and Fire Yin Yang Well all poisons were ineffective, there wasn’t any poison that could maintain its potency in this water.</p><br/><p>Tang San didn’t chose these two herbs because they had the greatest effect on him, but because they left him with a way out.</p><br/><p>Just in case Dugu Bo didn’t keep his promises, after absorbing the octagonal mysterious ice grass and infernal precious apricot he could dodge disaster by hiding in this Ice and Fire Yin Yang Well.</p><br/><p>At the same time Tang San had another reason for using these two herbs. Without the toxicity that allowed Dugu Bo to fearlessly stay at the side of the Ice and Fire Yin Yang Well, if he didn’t use these herbs, then perhaps he would have perished from the atmosphere here even before the agreed upon time with Dugu Bo tomorrow.</p><br/><p>Even if he wanted to leave now, the ice and fire energies within his body would cause him incurable devastating injuries. Let alone future cultivation, even saving his life would be a problem.</p><br/><p>However, even with the best writing couldn’t be experienced, even though Mysterious Heaven Treasure Record’s accounts was exhaustive there were still mistakes, Tang San couldn’t know just how immensely painful it would be until he he actually ate those two plants.</p><br/><p>Even if the ice and fire energies had somewhat neutralized each other first, after entering his body they stirred frantically, the medicinal power of immortal treasure herbs was terrifying. As the ice and fire mutual suppression instantly erupted in a shocking energy, Tang San didn’t even have the opportunity to resist with his willpower.</p><br/><p>The moment he fell into that Ice and Fire Yin Yang Well he had already lost consciousness.</p><br/><p>The waters of the Ice and Fire Yin Yang Well churned when Tang San entered, but not long after, Tang San slowly sunk into the surging water. The surface once again recovered its tranquility, the milky white and scarlet red still clearly separated. The steam still filling the air, everything becoming quiet.</p><br/><p>Time flowed like a river, early morning became night by the simple events of the sun rising and falling. Someone once said, ‘the eyes close and then open, and a day has gone by, the eyes close but do not open, and a lifetime has passed.’ Even time that seems to pass slowly can be so brief. Peoples’ lives are like this.</p><br/><p>Night fell once again, darkness enshrouding the earth, the Ice and Fire Yin Yang Well once again entered darkness, and Tang San within still hadn’t surfaced, apparently he had completely disappeared from the spring water.</p><br/><p>……</p><br/><p>The sun set over a forest, a group of three was swiftly passing through the trees, constantly advancing, moving back and forth.</p><br/><p>The trio consisted of two men and one woman, the two men both with anxious expressions. Even though that woman still had a serene face, her brows were tightly knit.</p><br/><p>Of the two men, the one that seemed thinner and weaker was supported by the arm of the other man, borrowing strength to continue forward.</p><br/><p>This trio had once been famous in the Spirit Master world, until they later collapsed and fell apart: the Golden Iron Triangle.</p><br/><p>That day, after Tang San had quietly disappeared, Grandmaster had immediately returned with Flender to where Tang San had been, summoning his spirit Luo San Pao. Even if a creature like San Pao was quite weak, it still had some extraordinary features, namely its sense of smell.</p><br/><p>Furthermore it was integrated with Grandmaster, and could remember everything Grandmaster smelled.</p><br/><p>After a brief search, Grandmaster and San Pao immediately discerned Tang San’s whereabouts. He had unexpectedly been kidnapped by that Title Douluo Dugu Bo they met during the day.</p><br/><p>As he recalled that toxic old freak, Grandmaster couldn’t help but panic, falling into that old poisonous thing’s hands, how could it be beneficial for Tang San? Moreover, they basically didn’t know the old freak’s whereabouts.</p><br/><p>Flender was equally anxious. Even if Tang San wasn’t his direct disciple he was still one of the Shrek Seven Devils, he was still a student at Shrek Academy. Even more, he had never dared forget what that black clad man had explained to him, and that was an existence that terrified him even more than the Poison Douluo.</p><br/><p>But at such a moment, Flender was still more cool headed than Grandmaster.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>After careful consideration, Flender proposed that they return to the Heaven Dou Imperial Academy.</p><br/><p>Before at Heaven Dou Imperial Academy, when those three board members had been ready to confront the Poison Douluo, they were clearly familiar with him. Perhaps they would know Dugu Bo’s whereabouts. And if they didn’t, they could just go look for that prince Xue Xing.</p><br/><p>Of course, confronting an imperial prince was clearly unwise, but under pressure it wasn’t an issue.</p><br/><p>After all, whether it was Grandmaster and Liu Erlong’s Blue Lightning Tyrant Dragon school or Ning Rongrong’s Seven Treasure Glazed Tile School, both were among the seven great schools of the present age. Even if prince Xue Xing’s status was even higher, he still wouldn’t dare offend two of the great schools of the Empire.</p><br/><p>But in the end the trio hadn’t used their plan to corner the prince by force. The three Spirit Douluo board members were ashamed over the previous events, and when they met again at Heaven Dou Imperial Academy, as they heard Tang San had been kidnapped by Dugu Bo, the three were immediately greatly shocked.</p><br/><p>They told the Golden Iron Triangle that Dugu Bo had always been eccentric. Even if he was employed by the imperial family he didn’t live in Heaven Dou City, but in the sunset forest. Reportedly he lived on a mountain, but they didn’t know the concrete location.</p><br/><p>The three Spirit Douluo board members expressed regret over Tang San being missing, but they also expressed their inability to help the Shrek group deal with Dugu Bo. Flender’s trio naturally knew why without explanations.</p><br/><p>Who would want to go confront the terrifying toxins of the Poison Douluo? Even Spirit Douluo level powers would be fearful of facing such persistent poison.</p><br/><p>The Golden Iron Triangle didn’t beg, and the trio left the Academy as swift as lightning, rushing to the Sunset Forest guided by Liu Erlong.</p><br/><p>The Sunset Forest was about a hundred li[1] east of Heaven Dou City. One of Heaven Dou Empire’s several large spirit beast habitats, even if it wasn’t as vast as the Star Luo Great Forest it was still home to numerous high level spirit beasts.</p><br/><p>Since entering the Sunset Forest in the morning, the trio had already spent a whole day searching, only briefly resting before continuing.</p><br/><p>Even if Liu Erlong didn’t know much about Tang San, she still greatly admired the words he had used on Grandmaster, to say nothing of Tang San being the direct disciple of her beloved. What is called ‘love the house and its crow’[2], even if she wasn’t as anxious as Grandmaster and Flender, she was still deeply concerned.</p><br/><p>“Erlong, let’s rest a moment.” </p><br/><p>Flender paused, gasping slightly. Rushing for a day didn’t really count for anything to a seventy plus ranked Spirit Sage like him, but he was somewhat tired mentally.</p><br/><p>Erlong stopped in front of Flender and Grandmaster. Seeing Grandmaster’s lowered face, she consolingly said: </p><br/><p>“Don’t worry, Xiao Gang. I think Dugu Bo might not necessarily want to kill Tang San, otherwise he would have done so immediately at our Academy. Why kidnap him?”</p><br/><p>Grandmaster sighed, a painful light flickering in his eyes,</p><br/><p>“No, you don’t understand. Dugu Bo kidnapping Tang San is definitely because he injured Dugu Yan, and the talent in poisons Tang San showed. If my guess is correct, then Dugu Bo is definitely interested in Tang San’s poison. Looking to see just what his poison is. And I’m certain Dugu Bo wouldn’t let Tang San live. It’s just a question of how long Tang San is of use to him. Someone like Dugu Bo is just plain evil, his reputation in the Spirit Master world is bad, always doing whatever he wants. With little San’s talent, if it was me, I wouldn’t let little San off.”</p><br/><p>Flender laughed bitterly,</p><br/><p>“If something really happened to little San, how could we justify it to that person?”</p><br/><p>“That person? Who are you talking about?”</p><br/><p>Liu Erlong asked somewhat puzzled.</p><br/><p>Flender was just about to speak when, suddenly, a sharp hissing sound rose, surging like thunder, destroying the quiet of the night, causing a commotion among the spirit beasts in the forest.</p><br/><p>The trio looked face to face, standing up practically simultaneously. They had naturally heard the astonishing power contained within that hissing sound, and such power was exclusive to Title Douluo. In this Sunset Forest, would there actually be a second Title Douluo?</p><br/><p>Figures once again flashing, relying on that whistling sound for guidance, the trio leapt up, advancing swiftly.</p><br/><p>Dugu Bo stood at the cave entrance, looking into the night sky with a jade light flickering in his eyes. Both hands at his back, spitting out a murky qi.</p><br/><p>He had just now endured the suffering Tang San had mentioned. If it was just a matter of pain he might be able to endure, but that feeling of his heart itching wasn’t something people could take. With Dugu Bo’s strength, right now his clothes were soaked through. His long whistling sound was an expression of his depression after that pain.</p><br/><p>Wonder if that kid has died. Dugu Bo thought to himself. He was extremely familiar with the Ice and Fire Yin Yang Well, it wasn’t a place where living creatures could survive. There where all kinds of plants there, but while plants could survive, creature’s couldn’t.</p><br/><p>He had once seen a poisonous six headed bright chameleon enter the range of the Ice and Fire Yin Yang Well, and within just a few hours it had burst and died.</p><br/><p>For some reason Dugu Bo was somewhat regretful. He actually had a bit of confidence in Tang San, and if that kid could really cure him and his granddaughter, wouldn’t he be throwing away his best chance?</p><br/><p>Perhaps this test was too challenging for him.</p><br/><p>While thinking of this, Dugu Bo’s mood changed somewhat. Recalling Tang San’s talent, he suddenly thought that might that child not be able to really cure him?</p><br/><p>No good, light flashed in Dugu Bo’s eyes. He’d go have a look at the Ice and Fire Yin Yang Well, and if Tang San was still alive he’d consider it again.</p><br/><p>As Dugu Bo prepared to ascend the hill, suddenly three long whistles echoed simultaneously, two strong and one weak, perhaps muffled, perhaps impassioned, but none lacked intense hostility. The whistling sounds rapidly approached, and judging by their positions, the owners of those whistles were apparently coming to the mountain.</p><br/><p>Dugu Bo squinted his eyes slightly, snorting disdainfully,</p><br/><p>“Someone actually wants to challenge me? Fine, I’ll take a look at who is so brazen.”</p><br/><p>Abandoning his plan to climb the mountain, Dugu Bo took a step, instantly reaching the cliff precipice overhanging the cave. He spotted three silhouettes climbing the mountain towards him, leaping swiftly like shooting stars.</p><br/><p>Looking at these three, Dugu Bo’s eyes were filled with disdain. Just two seventy plus ranked Spirit Sages and actually even a thirtieth ranked Spirit Grandmaster. Were they coming to die?</p><br/><p>It was no wonder Dugu Bo felt this way. With his Title Douluo strength, let alone a Spirit Sage, even a Spirit Douluo would tremble to confront him. To say nothing of his poison not being something people could casually contend with.</p><br/><p>Even equally ranked Title Douluo would be careful, with one mistake against his poison they would inevitably perish.</p><br/><p>The Golden Iron Triangle trio leapt up simultaneously, floating towards Dugu Bo. Even if they had all along wished to be able to find him faster, actually confronting this poison titled Douluo, their hearts couldn’t help falling.</p><br/><p>Dugu Bo stood with his hands behind his back, his eyes brimming with a sinister jade light, watching them with a burning gaze, the formidable pressure making the air feel congealed. Grandmaster didn’t have the spirit power protection Flender and Liu Erlong had, and this pressure alone was enough to be fatal for him.</p><br/><p>“Were you looking for me?”</p><br/><p>Dugu Bo said coldly.</p><br/><p>Grandmaster said angrily:</p><br/><p>“Dugu Bo. Tang San. Where are you keeping him?”</p><br/><p>Dugu Bo disdainfully said:</p><br/><p>“What creature are you? How are you qualified to question me?”</p><br/><p>“You……”</p><br/><p>Grandmaster was about to speak again, but was stopped by Flender.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Flender knew that because of this relationship with Tang San, the otherwise cool Grandmaster’s mind was confused, making him more or less useless. Calmly looking at the Poison Douluo, he said with a slight salute:</p><br/><p>“Senior Dugu, Tang San is of a junior generation, I don’t know how he offended you, but I ask you to be lenient. He’s after all just a thirteen year old child. As a revered Title Douluo, a magnanimous lord might let him off.”</p><br/><p>Flender himself thought his words were exceptionally reserved, and still with a slightly mocking intent. Unfortunately, he faced a Poison Douluo who was unmoved by persuasion.</p><br/><p>Dugu Bo lowered his eyelids,</p><br/><p>“You’re saying I’m a bully? When striking the young, the old will appear. When striking you, I don’t know whether there’s someone even more senior that will appear? There’s nothing left of that kid. Want to avenge him? Fine, come, I wanted to exercise a bit yesterday, but those three old men didn’t dare act. Even if the three of you don’t amount to much, you might still be able to let me stretch my legs.”</p><br/><p>Hearing Dugu Bo say not even bones remained of Tang San, Grandmaster only felt his brain go numb, his vision go black. After so many years, the feeling between him and Tang San was no longer that between master and disciple, but had entered that of father and son.</p><br/><p>Being unmarried, Grandmaster had always regarded Tang San as his own child. Now hearing Dugu Bo say Tang San was gone, his heart wasn’t just in pain.</p><br/><p>It was despair.</p><br/><p>When people’s emotions become too extreme, everyone would change in some way. Some would become dumb, some would become hysterical.</p><br/><p>But Grandmaster wasn’t like others. Right now, all the energy around him seemed to have disappeared, the heat in his surroundings fading away, he seemed to become as cold as a block of ice, looking at Dugu Bo with an equally chilly expression.</p><br/><p>Even a power like Dugu Bo couldn’t help feel a bit apprehensive under such a deathly still gaze.</p><br/><p>Flender’s expression dropped,</p><br/><p>“Dugu Bo. You will definitely regret killing Tang San. Even if we can’t do it, you won’t come to a good ending.”</p><br/><p>Dugu Bo curled his lips,</p><br/><p>“What? You still want revenge? No, you won’t have the chance. Come, let me see just what makes you dare provoke this me. I don’t know what you believe, but I have a thousand ways to make you lose the will to live, but I won’t let you die. It’s been a long time since I’ve seen something so amusing. Coming here is easy. Leaving, not so much. Nobody can just come to Dugu Bo’s abode when they want to.”</p><br/><p>Flender and Liu Erlong simultaneously looked at each other, simultaneously grabbing Grandmaster and pulling him behind them, simultaneously each stepping forward obliquely. At once the trio had created a triangular formation.</p><br/><p>“The sun and moon turns with dazzling gold.”</p><br/><p>Flender shouted loudly. He didn’t release his spirit, but from his body spread a layer of intense golden light. The golden light wasn’t aimed at Dugu Bo, but rather rushed toward the sky, and at the same time spread below him.</p><br/><p>Equally golden light burst from Grandmaster and Liu Erlong. Golden light filled the air, in an instant the three formed the corners of a golden triangle. At the center of the triangle was a golden ring, and surrounding it was all kinds of complex patterns.</p><br/><p>Right now Flender’s trio were all covered with brilliant gold. Grandmaster and Liu Erlong slowly closed their eyes, and the light in Grandmaster’s eyes clearly brightened, staring at Dugu Bo like sharp swords.</p><br/><p>“Yi, what kind of spirit ability is this?”</p><br/><p>Dugu Bo looked astonished at the trio, inwardly somewhat puzzled.</p><br/><p>As a Title Douluo, he was naturally experienced and knowledgeable, but he had never seen something like this before. He didn’t understand why that mere thirtieth ranked Spirit Grandmaster suddenly vaguely felt as if he could rival him.</p><br/><p>Three layers of purple air was emitted under the golden light, dissipating in midair. Seeing this, Dugu Bo’s expression finally changed somewhat.</p><br/><p>He was very familiar with this purple air, it was part of the poison formation Dugu Bo had arranged around this mountain. Everyone who entered would be infected by the poison. This wasn’t particularly ferocious, but extremely insidious. Its effects would take two hours to show, and after those two hours the poison would leach into the whole body, killing by withering the energy channels.</p><br/><p>But the purple air streaming from Flender’s trio was clearly the toxin of his poisonous formation being expelled. The toxin in the poisonous formation wasn’t of any concern to Dugu Bo, but it would be fatal to ordinary spirit masters. Without Spirit Douluo level strength or higher, it should be impossible to expel.</p><br/><p>This was where Dugu Bo was the most puzzled. Clearly the three were just two seventy something ranked and one thirtieth ranked. So why this moment did the three make him feel as though they were Spirit Douluo level powers.</p><br/><p>Dugu Bo had grown strong too long ago, and afterwards hadn’t travelled the Continent much, so naturally he hadn’t heard of the Golden Iron Triangle.</p><br/><p>The name ‘Golden Iron Triangle’ didn’t indicate the trio’s cooperation, but rather Flender, Grandmaster and Liu Erlong’s type of extraordinary spirit fusion ability.</p><br/><p>The spirit fusion ability was very rarely seen in the Spirit Master world. It required the coincidence of both spirits being extremely compatible to succeed.</p><br/><p>And Flender, Grandmaster and Liu Erlong’s spirit fusion ability required three people to use, this was practically unique in the Spirit Master world. In fact, the more Spirit Masters joined in a spirit fusion ability, the more powerful it would be. At the same time, the spirit fusion ability’s power was related to the congeniality of the participating Spirit Masters.</p><br/><p>Like Dai Mubai’s and Zhu Zhuqing’s current congeniality was only sixty percent or so, but when fully used it allowed them to fight two opponents even stronger than them.</p><br/><p>And Grandmaster’s trio’s Golden Iron Triangle wasn’t just a spirit fusion ability from three people, with their mutual congeniality as if one body in the Spirit Master world, they could reach over ninety nine percent.</p><br/><p>Once used, their strength would multiply geometrically. Otherwise they wouldn’t have been so famous.</p><br/><p>Even now, even if it was the unrivalled spirit and spirit variation theorist Grandmaster, he still didn’t understand just how his, Flender’s and Liu Erlong’s spirit compatibility could reach such a terrifying degree. In fact, apart from them, compatibility in excess of seventy percent was already extremely rare.</p><br/><p>With their innate congeniality and their many years together, their spirit fusion ability compatibility approached one hundred percent.</p><br/><p>Even if they had been apart for twenty years, right now using that spirit fusion ability that made them famous, still felt like the ice melting, the three becoming one, entering the rhythm of the Golden Iron Triangle.</p><br/><p>After Dugu Bo’s brief astonishment he still didn’t move, just standing there holding his hands. With his pride, confronting three opponents so far beneath him, he naturally wouldn’t rush.</p><br/><p>He wanted to see just what kind of power could be brought out by a spirit fusion ability from three people.</p><br/><p>The golden light grew more and more intense, and at Grandmaster’s corner an intense triangular light beam shot up.</p><br/><p>Grandmaster’s deathly still gaze suddenly became brilliant. Slowly raising his right hand toward the center of the trio’s golden triangle.</p><br/><p>“Luo San Pao.”</p><br/><p>Along with Grandmaster’s dragon like howl, the chubby Luo San Pao appeared in the air, just inside those decorative designs in the golden triangle. In an instant, around each of the trio appeared rings of light.</p><br/><p>Grandmaster had two, Flender and Liu Erlong seven, altogether sixteen rings of light unexpectedly floated around them, flying towards San Pao at the center of the triangle.</p><br/><p>Watching this, Dugu Bo’s complexion couldn’t help changing again. A spirit fusion ability using a remote body must be even more powerful than an ordinary spirit fusion ability, this he understood clearly.</p><br/><p>The pressure from that golden triangle’s center increased sharply. Dugu Bo’s expression changed slightly, ring after ring of light ascending from below him, releasing his frightful nine spirit rings.</p><br/><p>Grandmaster’s trio simultaneously gathered altogether sixteen spirit rings over Luo San Pao, and the previously adorable Luo San Pao seemed to be enduring enormous pain, facing upwards and issuing a strong dragon’s roar. Immediately following, its chubby body began to swell violently under the load of the sixteen spirit rings, and along with it the intensity of the light from the golden triangle increased.</p><br/><p>Luo San Pao grew at an astonishing speed, it’s chubby body began to grow vast rhombic scales, lump after lump of solid muscle bulging, its tremendous body constantly expanding, two twisted horns grew from its head, blueish purple light surged into its surroundings, and washed in the golden triangle, gradually became golden.</p><br/><p>In just the space of a few breaths, Luo San Pao had already grown to twenty meters in length. The scales on its back split open, and two enormous dragon wings unfurled. As the dragon wings extended it was able to hover in the air without the need for support from the golden light. The originally honest and straightforward eyes radiated power, and just like its body had become completely golden.</p><br/><p>The current Luo San Pao wasn’t that pig or dog like creature, rather it had become an awe-inspiring presence, an enormous dazzlingly golden dragon.</p><br/><p>[1] 100 = 50km</p><br/><p>[2] Idiom: If you get involved with one part, you’ll have to get involved with them all. Or: Love me, love my dog.</p><br/>\n</div>"}