{"title": "Chapter 69", "id": 69, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-69", "volume_title": "Volume 1", "body": "<h1>Chapter 69</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 69</p><br/><p>Xiao Wu: Promise Never To Leave Me</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Dugu Bo did some calculations on his fingers,</p><br/><p>“When I consider it carefully, actually, my granddaughter is just seven years older than you. It’s not too much. When you’re eighteen, she will only be twenty five. Convenient for you kid.”</p><br/><p>Tang San said with great alarm,</p><br/><p>“Convenient? Yeah right! I don’t want that granddaughter of yours.”</p><br/><p>Dugu Bo grinned, grabbing Tang San’s shoulder,</p><br/><p>“You think this is up to you? Even if you’re well versed in poisons, can you dissolve aphrodisiacs? Later this old man will have you try some love teas and other such things, once the rice is cooked, I’ll see what you do then.”</p><br/><p>“You……”</p><br/><p>Tang San saw the serious look on Dugu Bo’s face. He, who hadn’t even been afraid when confronting threats to his life, couldn’t help turning pale with fright right now,</p><br/><p>“Old…… Eh, no, senior Dugu. I know I did wrong, please don’t play with me, alright?”</p><br/><p>Dugu Bo grandiosely said:</p><br/><p>“Who’s playing with you? I spoke of facts, nothing more. Don’t tell me my granddaughter doesn’t suit a little devil like you? Even if you’re a cunning little freak, your talent isn’t an issue, and your future prospects are boundless. If my granddaughter could follow you, it would put me at ease.”</p><br/><p>“Isn’t it the same if she follows Yu Tian-Heng? That Yu Tian-Heng still has the support of the Blue Lightning Tyrant Dragon clan’s whole school at his back. According to Teacher, Yu Tian-Heng will very possibly be the next leader of the Blue Lightning Tyrant Dragon clan. How could I compare with that kind of power. Besides, who can say if your granddaughter has already cooked her rice with Yu Tian-Heng, cooked rice can’t be cooked again.”</p><br/><p>Dugu Bo looked distracted a moment, his complexion immediately becoming unsightly once again,</p><br/><p>“This is actually possible. Enough, we’ll talk about it later.”</p><br/><p>Seeing Dugu Bo had apparently dropped the notion, Tang San breathed out in relief. By now the two had already reached the Academy gate.</p><br/><p>The Blue Tyrant Academy signboard had already disappeared, replaced with an enormous horizontal board inscribed with golden letters, the words ‘Shrek Academy’ written in huge, glorious golden characters. It was signed by Flender.</p><br/><p>Without waiting for Dugu Bo to step forward, Tang San hastily ran over. He couldn’t dare let Dugu Bo walk first, if by any chance he came into conflict with the teacher at the gate house, it would be difficult to sort out.</p><br/><p>With Dugu Bo’s temper, who knew when he might flare up?</p><br/><p>Tang San ran forward, exchanging a few words with the guard at the gatehouse. The guard hastily ran into the Academy.</p><br/><p>“Old freak, let’s wait here a moment. Don’t forget what you promised me, you can’t harm anyone from Shrek Academy.”</p><br/><p>Dugu Bo was a Title Douluo. Only Tang San had been at the Ice and Fire Yin Yang Well, and at most he was the only one in danger, but here was different. If Dugu Bo hadn’t promised not to harm anyone, he really wouldn’t have dared bring him here.</p><br/><p>Dugu Bo raised his head, looking down his nose at Tang San without saying a word.</p><br/><p>After a moment, the sound of activity within the Academy attracted Tang San’s attention.</p><br/><p>Flender, Grandmaster, Liu Erlong as well as Zhao Wuji, Lu Ji-Bin, Shao Xin, and Li Yu-Song, altogether seven people quickly walked out from the Academy gate towards them.</p><br/><p>The assembly of these seven could be said to be the strongest lineup of the present Shrek Academy, clearly they weren’t here to receive Tang San. Their target was naturally that one with the Spirit Master World’s highest title, the Poison Douluo that once defeated the Golden Iron Triangle.</p><br/><p>These seven were all at least sixtieth rank Spirit Masters, adding a complete Spirit Master formation, further adding the Golden Iron Triangle’s spirit fusion ability, even if they couldn’t quite stand up to Dugu Bo, they could still block him.</p><br/><p>When the Academy gate guard had reported that Tang San and an old man who seemed to be Dugu Bo had returned to the Academy, Flender, Grandmaster and the others understood that with Dugu Bo here, until they figured out his motive, this was necessary.</p><br/><p>“Teacher.”</p><br/><p>Tang San looked at Grandmaster, hurriedly waving his hand at everyone.</p><br/><p>A moved radiance flickered in Grandmaster’s eyes, but just as he stepped forward he was pulled back by Flender. Just this tiny action showed how cautious everyone were right now.</p><br/><p>Grandmaster was no doubt the weakest of everyone here, but he was an absolutely necessary existence in the Golden Iron Triangle’s spirit fusion ability. If he was attacked by Dugu Bo alone, there wouldn’t be any chance of him returning alive, and the other six naturally also wouldn’t be able to stop Dugu Bo.</p><br/><p>As Dugu Bo saw Flender’s actions, the corners of his mouth twitched, with difficulty keeping himself from showing a disdainful expression, thinking, ‘who do you seven think you are? If this old man wanted to do something, even slaughtering this whole Heaven Dou imperial capital wouldn’t be impossible.’</p><br/><p>Even though Dugu Bo wasn’t considered the most powerful among Title Douluo, there absolutely wasn’t anyone who could compare to his poison in mass murder.</p><br/><p>Tang San naturally didn’t have any misgivings, and quickly stepped forward to meet everyone,</p><br/><p>“Teachers, I’ve returned.”</p><br/><p>Grandmaster looked at Tang San with an inquiring gaze.</p><br/><p>Tang San nodded to Grandmaster, indicating he was fine.</p><br/><p>“Dean Flender. I would like to talk to you about something.”</p><br/><p>Flender constantly kept his gaze on Dugu Bo, only now hearing Tang San speaking to him made him turn his gaze back,</p><br/><p>“Little San, what is it? He hasn’t made things troublesome for you has he?”</p><br/><p>Tang San shook his head,</p><br/><p>“No, senior Dugu has been very good to me. He’s taught me a lot of poison related knowledge. Dean Flender, senior Dugu wants to be an advisor at our Academy, what do you think?”</p><br/><p>“What?”</p><br/><p>Not just Flender, including Grandmaster, everyone present cried out in surprise practically simultaneously, their gazes becoming strange. Everyone looked at each other, for a moment speechless.</p><br/><p>Who was Dugu Bo? A Title Douluo. Let alone this Shrek Academy, even the Heaven Dou Empire’s number one academy Heaven Dou Imperial Academy didn’t have a Title Douluo present.</p><br/><p>Tang San looked at everyone’s astonished expressions, and probingly asked:</p><br/><p>“Is it no good?”</p><br/><p>Flender swallowed,</p><br/><p>“Is what you said true?”</p><br/><p>Tang San nodded,</p><br/><p>“Senior Dugu promised, only he said he wouldn’t always stay at the Academy. And only as an advisor.”</p><br/><p>Flender and Liu Erlong simultaneously looked toward Grandmaster. Among the trio, Grandmaster was always the wise corner with a plan.</p><br/><p>Grandmaster’s rigid face twitched once,</p><br/><p>“This is excellent. Even though Dugu Bo has only ever done as he wished, this person’s reputation is excellent, if he promised something he would surely see it through. Flender.”</p><br/><p>While Grandmaster spoke, he signaled to Flender with his eyes.</p><br/><p>The two had been brothers for so many years, how wouldn’t Flender understand Grandmaster’s meaning. Hastily waving his hand, he brought everyone forward to greet Dugu Bo.</p><br/><p>“Senior Dugu, greetings.”</p><br/><p>Flender, extremely enthusiastic, was the first to step towards Dugu Bo with a smile. Even though the smile seemed a bit sinister on his face, the light in his eyes was sincere.</p><br/><p>Dugu Bo nodded to Flender, something like returning the politeness.</p><br/><p>“I promised the little freak to be your advisor here, I don’t know whether you’re willing?”</p><br/><p>Dugu Bo had never been a person fond of indirectness, and with his position it was also completely unnecessary. He immediately got right to the point with his purpose in coming.</p><br/><p>Promising Tang San to come here was admittedly because it was Tang San’s condition, but at the same time the peculiar friendship he had with Tang San was an important factor.</p><br/><p>Flender said without the slightest hesitation:</p><br/><p>“Of course we are. You coming to this Academy will simply bring light to our humble Shrek Academy. Let alone being an advisor, even if you wanted to be dean it would be no problem.”</p><br/><p>Dugu Bo clearly wasn’t interested in Flender’s cordiality. Waving his hand, he said:</p><br/><p>“Being dean doesn’t suit me, I haven’t the time to be teaching students. Moreover, my method of cultivation is unsuitable for the vast majority of Spirit Masters. Since you agreed, find me a quiet place to stay. I’ve returned with that little freak Tang San. I’m tired, I’ll rest first.”</p><br/><p>Flender immediately agreed. Even if there was nothing prepared in advance, dealing with such ad hoc circumstances wasn’t difficult,</p><br/><p>“Then follow me, senior.”</p><br/><p>While speaking, he led the way ahead, bringing Dugu Bo into the Academy.</p><br/><p>When Dugu Bo passed by Tang San, his lips moved, saying something to Tang San. He then followed Flender away.</p><br/><p>Of course he wasn’t really tired, only he always most disliked inconvenience, and didn’t want to be chatting with everyone here.</p><br/><p>Watching Flender lead Dugu Bo away, Liu Erlong couldn’t help but ask Tang San:</p><br/><p>“Little San, how did you do it? This old freak agreeing to come to our Academy. It’s really too inconceivable.”</p><br/><p>Tang San smiled slightly, saying:</p><br/><p>“Perhaps it’s because we’re something of kindred spirits. I accidentally helped him with a matter. He said it was because of our friendship that he agreed to come.”</p><br/><p>Grandmaster said:</p><br/><p>“No matter how, this is excellent.”</p><br/><p>“Teacher, is everyone well?”</p><br/><p>He naturally meant the other six of the Shrek Seven Devils. Being gone for half a year, Tang San had greatly missed his teachers and companions. Especially Xiao Wu.</p><br/><p>Grandmaster nodded with a smile, saying:”</p><br/><p>“They’re all very well. I haven’t told them what you’ve been doing before, only saying you’ve been cultivating in seclusion. If you had returned a few days later, maybe we wouldn’t have been here.”</p><br/><p>“Why?”</p><br/><p>Grandmaster said:</p><br/><p>“In this past half year they have all made not inconsiderable progress. Ma Hongjun, Ning Rongrong, and Zhu Zhuqing have all broken through the thirtieth rank, and already possess their third spirit rings. Oscar’s spirit power has also advanced two ranks, and Xiao Wu has even advanced three ranks. Dai Mubai is in seclusion, attacking the fortieth rank bottleneck. Attacking the bottleneck is a bit difficult, but he should succeed soon. Once he has broken through to the fortieth rank, we will go hunt spirit beasts together to obtain his fourth spirit ring.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Listening to Grandmaster, Tang San couldn’t help secretly sigh in admiration. Even though he himself had progressed a lot, his companions hadn’t stayed idle either. Each one’s strength had increased a lot, and now they had all finally reached the thirtieth rank. The Shrek Seven Devils’ fighting strength would no doubt increase significantly.</p><br/><p>“Teacher, I’ll go see them.”</p><br/><p>Tang San was already somewhat impatient to see his comrades.</p><br/><p>Grandmaster smiled and rubbed Tang San’s head, saying:</p><br/><p>“You’ve only just returned, won’t you rest a bit first?”</p><br/><p>Tang San shook his head,</p><br/><p>“I’m not tired. And I still have gifts for everyone.”</p><br/><p>Grandmaster said:</p><br/><p>“Then come on, I’ll go with you. Erlong, all of you are busy.”</p><br/><p>Tang San glanced at Grandmaster, then again at Liu Erlong. The two’s expressions were like always, and no change could be seen on the surface. Even though they didn’t seem intimate, he could feel that Grandmaster seemed to be able to calmly accept Liu Erlong’s existence.</p><br/><p>Liu Erlong nodded, her gaze not resting on Grandmaster for long, and brought the teachers in the direction of the Academy’s main building.</p><br/><p>Watching them gradually disappear in the distance, Tang San couldn’t help asking:</p><br/><p>“Teacher, you and aunt Erlong……”</p><br/><p>Grandmaster indifferently said:</p><br/><p>“Children shouldn’t ask about adult matters. Let’s go. Your comrades are all cultivating in mimicry environments.”</p><br/><p>Grandmaster didn’t bring Tang San towards the teaching bloc, but rather directly towards the forest in the back.</p><br/><p>While walking, Grandmaster asked:</p><br/><p>“Little San, what did Dugu Bo teach you? What’s actually going on with you and him?”</p><br/><p>This question had been in Grandmaster’s heart for a very long time, ever since Tang San showed up after the Golden Iron Triangle fought Dugu Bo, Grandmaster knew Dugu Bo wouldn’t so easily take a shine to Tang San’s character. In this past half year he had practically constantly been worrying about Tang San, after all, Tang San was his only disciple, and even more like a son to him.</p><br/><p>Tang San said:</p><br/><p>“Dugu Bo kidnapping me was originally because of Dugu Yan. Dugu Yan should have told her grandpa about the time I defeated her, making Dugu Bo interested in my Eight Spider Lances. So he kidnapped me to research the poison in my Eight Spider Lances.”</p><br/><p>“Then what happened after? From what Dugu Bo said, it seems you helped him?”</p><br/><p>Tang San nodded:</p><br/><p>“Something like that. Dugu Bo’s poison skills had some defects. I happened to discover a way to make up for those defects. So out of gratitude he taught me a lot of things relating to using poison. If it wasn’t for that, perhaps I would’ve been unable to return to see you alive.”</p><br/><p>Tang San didn’t explain it in too much detail, he could never tell Grandmaster about him coming from Tang Sect. This time together with Dugu Bo not only increased his level of poison use, at the same time it also gave him the best excuse for the Tang Sect poison techniques. Dugu Bo would never tell people that Tang San’s poison was his own. With the world’s number one Poison Douluo as cover, nobody would ever doubt the origin of Tang San’s poison techniques.</p><br/><p>“So it’s like that.”</p><br/><p>Grandmaster knew on an even deeper level that, originally, having told Dugu Bo about Tang San’s history, the reason why Dugu Bo didn’t dare kill Tang San and instead taught him poison, was greatly related to Tang San’s past. Recalling this, he also felt more at ease.</p><br/><p>“Little San, in this time you’ve been constantly studying poison with Dugu Bo, but you mustn’t neglect your spirit power cultivation. Your companions all have sky high talent, if you have fallen too far behind, you will perhaps never be able to catch up. How high is your current spirit power rank?”</p><br/><p>Tang San said:</p><br/><p>“Thirty seven.”</p><br/><p>“En.”</p><br/><p>Grandmaster responded automatically, but he reacted very quickly, his footsteps immediately halting, his expression even stiffening a bit more,</p><br/><p>“What did you say? Your spirit power is already at the thirty seventh rank?”</p><br/><p>Tang San earnestly said:</p><br/><p>“Yes! Last time at Heaven Dou Imperial Academy, under that board members pressure my spirit power reached the thirty fourth rank. Later cultivating at senior Dugu’s place, I advanced three ranks. Senior Dugu’s place had a lot of precious plants, perhaps it’s because that kind of environment suits my cultivation. Therefore, my spirit power advanced very quickly, already reaching the thirty seventh rank.”</p><br/><p>Grandmaster showed a smile,</p><br/><p>“It seems that my worries were completely unfounded. Even while learning poison under Dugu Bo, your spirit power growth was the fastest of everyone. I’m relieved. In less than half a year the Continental Advanced Spirit Master Academy Grand Spirit Fighting Competition will begin. If it continues like this, perhaps, at that time you will also have had the chance to rush to the fortieth rank. If it’s truly like that, then, it might be impossible for you Shrek Seven Devils not to leave a mark.”</p><br/><p>Just as he said this, Grandmaster stopped walking. Ahead was a shrubbery, almost as tall as a person, appearing extremely dense. Grandmaster smiled slightly, and yelled towards the shrubbery,</p><br/><p>“Xiao Wu, take a break, come see who’s here.”</p><br/><p>Hearing the words ‘Xiao Wu’, the smile on Tang San’s face immediately froze, his eyes revealing a deep and grateful mind. He knew that Grandmaster had first brought him to see Xiao Wu because he and Xiao Wu were the closest. Xiao Wu was precisely the person he was most urgent to see.</p><br/><p>With a flicker, a white silhouette flashed out of the shrubbery. A pink tender face brimming with childishness, that pair of exceptionally slender taut beautiful legs, further that unbeatably slender yet extremely agile little waist, as well as the scorpion braid hanging to the ground, could it be anyone but Xiao Wu?</p><br/><p>“Grandmaster, you’ve come……”</p><br/><p>Xiao Wu didn’t finish speaking, because in her eyes had already appeared that person she had waited for the most.</p><br/><p>Her pupils contracted practically instantly,</p><br/><p>“Ge——”</p><br/><p>Not caring about Grandmaster’s presence, Xiao Wu threw herself into Tang San’s embrace, her slender thighs as usual twisting around Tang San’s waist, pulling him close. She nestled her pink tender young face deep in Tang San’s shoulder, her own shoulders trembling fiercely.</p><br/><p>Tang San could clearly feel Xiao Wu’s frantic heartbeats. Seeing Xiao Wu again, how couldn’t he be moved?</p><br/><p>Wrapping his arms around Xiao Wu, the rims of his eyes were immediately somewhat red.</p><br/><p>Right now Xiao Wu was still a bit taller than Tang San, and her completely hanging on Tang San gave a somewhat strange impression.</p><br/><p>Grandmaster tactfully didn’t look at them, his gaze instead turning into the distance.</p><br/><p>“Good Xiao Wu, don’t cry. Haven’t I come back?”</p><br/><p>Tang San lightly stroked Xiao Wu’s back, somewhat choked consoling her.</p><br/><p>“Wuuu—— Ge, don’t you want Xiao Wu? Why would you leave for so long……”</p><br/><p>It was no wonder that Xiao Wu was so moved, for the six or seven years since meeting Tang San the two had never been apart for more than a month. This time Tang San had been gone for half a year, and moreover she hadn’t known where, Xiao Wu couldn’t describe how much she had missed him. She had repeatedly asked Grandmaster where Tang San had gone, but Grandmaster naturally couldn’t tell her Tang San was together with Dugu Bo, otherwise, what would be done if by any chance Xiao Wu rushed to the Sunset Forest?</p><br/><p>“How would I, how would I be willing to part with you? It’s all my fault for letting you worry.”</p><br/><p>The front of Tang San’s shoulder was already drenched through by Xiao Wu’s tears. Her long slender legs wrapped tightly about Tang San’s waist, seemingly afraid he would run away again.</p><br/><p>Xiao Wu raised her head, and by now her eyes were already thoroughly red, pouting with her little mouth:</p><br/><p>“Then in the future you can’t leave me again. Even if you have to cultivate, you still have to bring me along.”</p><br/><p>“Fine, fine, I promise.”</p><br/><p>While Tang San wiped Xiao Wu’s tears, he repeatedly consoled her.</p><br/><p>Xiao Wu’s big eyes blinked and more tears flowed out, both hands grabbing Tang San’s neck, she sobbed:</p><br/><p>“Ge, you know I missed you so much, promise, promise never to leave me.”</p><br/><p>Tang San without the slightest hesitation said:</p><br/><p>“I promise, unless I die, I will never leave Xiao Wu.”</p><br/><p>Xiao Wu’s tears then turned to happiness, once again leaning against Tang San’s shoulder,</p><br/><p>“Xiao Wu also promises, she will never leave little San Ge, even if she dies she won’t leave.”</p><br/><p>To the side Grandmaster helplessly shook his head, in his heart thinking, ‘Today’s youth, huh, really unrestrained. These two little fellows aren’t even fourteen yet. Really precocious.’ But he still didn’t want to destroy their present mood, and only waited quietly.</p><br/><p>Tang San was after all more cool headed than Xiao Wu. Lightly swatting Xiao Wu’s butt,</p><br/><p>“Good girl, come down, Teacher is still here.”</p><br/><p>At this Xiao Wu recalled Grandmaster’s existence, and her charming face immediately blushed, letting go of Tang San’s waist and dropping to the ground. But she still held on to Tang San’s arm, and no matter what was said wouldn’t agree to let go.</p><br/><p>“Teacher, let’s go find the others.”</p><br/><p>Grandmaster turned to look at the two. Even though they were still young, they could still be considered ready to be a couple. His eyes revealed a smiling expression, nodded, and continued walking into the depths of the forest.</p><br/><p>Mimicry environment cultivation locations were chosen differently according to each Spirit Master’s spirit.</p><br/><p>Like Xiao Wu’s rabbit spirit naturally was most suited to cultivating in a shrubbery, Dai Mubai was in an animal pen, while Oscar’s was the easiest; as a food system Spirit Master, the kitchen was the place that could best draw out his spirit power. For Ma Hongjun it was a room spread through with stoves.</p><br/><p>Of course, these were all just comparatively common mimicry environments. Under even better conditions, the help in cultivation could still increase further.</p><br/><p>For instance, if Ma Hongjun could have cultivated in a volcanic crater, then the benefits to him would be even greater. Of course, at the same time the danger would increase substantially.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>In a little while, Grandmaster had already brought Tang San to find everyone except Dai Mubai, and the six Shrek Seven Devils gathered in a hall. Everyone were happy to see Tang San again, and Tang San again repeated what he had said to Grandmaster.</p><br/><p>“Little San, what did you say? That Dugu Bo came with you to the Academy?”</p><br/><p>Xiao Wu somewhat shocked looked at Tang San, her expression somewhat pale.</p><br/><p>Tang San thought Xiao Wu was frightened of Dugu Bo’s strength and poison, and hastily comforted her:</p><br/><p>“Don’t worry, senior Dugu isn’t a bad person. He also promised me that he wouldn’t hurt anyone at the Shrek Academy. Nothing will happen. Besides, now he’s also an advisor at our Academy.”</p><br/><p>Oscar grinned, saying:</p><br/><p>“This really is excellent, with a Title Douluo as advisor, how couldn’t our Shrek Academy’s name spread through the world?”</p><br/><p>Grandmaster frowned,</p><br/><p>“An Academy doesn’t rely on its teachers, but rather has to rely on you students.”</p><br/><p>Oscar stuck out his tongue, but he was terrified of Grandmaster and naturally didn’t dare retort.</p><br/><p>Xiao Wu’s expression hadn’t improved from Tang San’s expression, and instead became even paler. Only because she kept her head down, the others didn’t notice anything.</p><br/><p>“Teacher, where is Mubai secluded? I’d like to see him.”</p><br/><p>Tang San said to Grandmaster.</p><br/><p>Grandmaster said:</p><br/><p>“He’s at a critical juncture of his cultivation, he mustn’t be disturbed now.”</p><br/><p>Tang San pondered, and said:</p><br/><p>“Teacher, I think I have a way for Mubai to break through the fortieth rank bottleneck. I’ve brought back some gifts for each of us to use. Best would be for us seven to cultivate together, this would have a significant assistance to our cultivation.”</p><br/><p>“Eh?”</p><br/><p>Grandmaster somewhat astonished looked at Tang San. Breaking through spirit power bottlenecks had always required relying on the Spirit Masters’ own strength to accomplish via unceasing effort. Even someone as familiar with spirits as Grandmaster had never found a shortcut, how couldn’t Tang San’s words excite him?</p><br/><p>Grandmaster was an astute person. Very quickly he became aware of the meaning behind Tang San’s words,</p><br/><p>“What you want to give them, is drugs brought back from Dugu Bo’s place?”</p><br/><p>Tang San nodded.</p><br/><p>After Grandmaster had considered it for a moment, he said:</p><br/><p>“Using drugs to promote strength will inevitably have side effects. In the past there has been some Spirit Masters who cultivated like this, but they always met a bad end. You’re already heaven spanning talents on your own. There’s no need for this kind of shortcut. If by any chance you spoiled things with your enthusiasm, the result wouldn’t be pretty.”</p><br/><p>Tang San prepared in advance said:</p><br/><p>“Teacher, don’t worry. The things I want to give everyone have different properties and uses according to each person. There wouldn’t be any side effects.”</p><br/><p>Oscar, Ma Hongjun, Ning Rongrong, and even Zhu Zhuqing, all of them now had an inquisitive expression in their eyes. They all wanted to know what the things Tang San had brought back for them actually was.</p><br/><p>After Grandmaster pondered it deeply, in the end he reluctantly nodded and said:</p><br/><p>“Fine. However, you have to be careful. You can’t make any mistakes. Ma Hongjun. Go to the animal pen and call over Dai Mubai. Be careful, don’t get injured by the beasts.”</p><br/><p>Ma Hongjun’s spirit was the Evil Fire Phoenix, which had a powerful suppressive effect on any common wild animals. Moreover his strength already surpassed Grandmaster’s, so having him go fetch Dai Mubai was naturally best.</p><br/><p>Grandmaster knew Tang San wasn’t an impetuous person, otherwise he wouldn’t have easily agreed.</p><br/><p>Tang San pondered, then said:</p><br/><p>“Teacher, we need a place where we won’t be disturbed. Otherwise if the outside world interferes, it might affect everyone’s ingestion of the medicinal properties.”</p><br/><p>Grandmaster thought about it and said:</p><br/><p>“Then we’ll go to Erlong’s old place. It’s certainly peaceful there, and nobody would go there lightly.”</p><br/><p>Since Flender took over the running of the Academy, Liu Erlong had already gone to live in the school buildings. Of course she didn’t feel the school buildings suited her better, but rather it was because Grandmaster lived there. The little wooden cottage she had lived in before was naturally empty.</p><br/><p>Before long, Ma Hongjun had brought back Dai Mubai. Before Dai Mubai had even arrived, his voice already echoed in the distance.</p><br/><p>“Little San, you’ve come back. If you hadn’t, Xiao Wu might have worried herself to death.”</p><br/><p>Dai Mubai wasn’t much different from before, he only appeared a bit calmer. Having already passed his sixteenth birthday had somewhat increased his aggressiveness, but his overall imposing manner was a bit more restrained. The pair of evil eyes radiating health and vigor, his casual movements all had a kind of king among beasts elegance.</p><br/><p>Hearing Dai Mubai’s words, Xiao Wu blushed and couldn’t help making a spitting sound, but she didn’t make any attempts to defend herself.</p><br/><p>Except for Xiao Wu, Dai Mubai was the first to meet Tang San among the Shrek Seven Devils, and meeting once again was especially familiar, holding out his hands to embrace Tang San’s shoulders, he said:</p><br/><p>“Fatty said you brought back gifts for us that can even help me break through the bottleneck, get it out quickly.”</p><br/><p>Tang San laughed, raising his hand to punch Dai Mubai in the chest,</p><br/><p>“Don’t worry, we’ll go somewhere quiet first.”</p><br/><p>Led by Grandmaster, everyone stepped into that quiet log cottage. The sunlight brought the shadows of the trees through the windows, the fresh and clean air seeping through the gaps. Listening to the melodious birdsong and the soft wind, it was very difficult to imagine this place was in Heaven Dou Empire’s capital city. Even Grandmaster who was naturally disposed to living a simple life couldn’t help sighing in admiration over Liu Erlong’s excellent choice.</p><br/><p>Grandmaster said to Tang San:</p><br/><p>“Begin. I’ll guard you.”</p><br/><p>Tang San nodded, and under everyone’s inquisitive and attentive stares, his right hand stretched into the Wishful Hundred Treasure Purse to pull out a kind of plant.</p><br/><p>That was a chrysanthemum with an enormous flower in an exceptionally beautiful violet. Bizarrely, each of the chrysanthemum’s petals seemed to be adorably fluffy on the outside, making them blend into each other. It didn’t release any fragrance, and the stamen rising from the center of the petals was more than half a chi[1] tall, the tip of the stamen glittering with a faint golden radiance.</p><br/><p>“What’s this?”</p><br/><p>Dai Mubai was the first to ask, and the others were all also attracted by the plant Tang San pulled out.</p><br/><p>Tang San smiled faintly, saying to Dai Mubai:</p><br/><p>“Boss Dai, I prepared this especially for you. It’s called Singular Velvet Sky Chrysanthemum, a neutral immortal treasure herb, when eaten the energy will spread through the four limbs, blood clearing the eight meridians, and you can practice Vajra Strength Body.”</p><br/><p>Dai Mubai was shocked,</p><br/><p>“So awesome? Vajra strength?”</p><br/><p>Tang San said with a smile:</p><br/><p>“Although ‘Vajra Strength Body’ is a bit exaggerated, this herb is most compatible with your spirit. Your spirit power is neutral, overwhelmingly vast, and just fiercely potent. The efficacy is all in the limbs, so this will make your cultivation twice as fast for half the effort. Since you’ve already reached the fortieth rank bottleneck, I think it will certainly help you break through the crisis. Once you’ve obtained your spirit ring the medicine will continue taking effect, and should have even greater promoting effect.”</p><br/><p>“The gifts I’ve chosen for everyone all attach most importance to strengthening foundations, they won’t spoil things for enthusiasm.”</p><br/><p>Dai Mubai solemnly accepted the Singular Velvet Sky Chrysanthemum Tang San held out, looking deeply at Tang San,</p><br/><p>“We’re brothers, so I won’t say thanks. How is this thing eaten?”</p><br/><p>Tang San said:</p><br/><p>“First eat that stamen, afterwards each of the petals, don’t eat the stalk. After eating it immediately start cultivating, dissolving the medicinal strength to break the bottleneck.</p><br/><p>Dai Mubai didn’t say anything else, and immediately walked over to a corner to take the herb as Tang San instructed.</p><br/><p>For all this time the fortieth rank bottleneck had always bothered him. Now having the chance to break through, his heart was already burning, impatient to begin. Oscar asked in a low voice:</p><br/><p>“Little San, what’s an immortal treasure herb?”</p><br/><p>Tang San said with a smile:</p><br/><p>“This is something from Heaven, that can only rarely be found in the human world.”</p><br/><p>Everyone looked at each other, and including Xiao Wu, everyone’s gazes became burning hot. Ning Rongrong giggled, delicately saying:</p><br/><p>“Third brother, don’t be partial.”</p><br/><p>Tang San said:</p><br/><p>“Don’t worry, everyone has a share. Little Ao, this is yours.”</p><br/><p>His hand stretched into the Wishful Hundred Treasure Purse for a second time, this time pulling out a jade case and handing it to Oscar.</p><br/><p>Oscar sighed in admiration,</p><br/><p>“No need to even look, just the value of this case alone is considerable.”</p><br/><p>Tang San was somewhat speechless:</p><br/><p>“Little Ao, this is just common white jade. Two gold spirit coins will get you one.”</p><br/><p>“Eh……”</p><br/><p>Oscar was part stunned, part embarrassed.</p><br/><p>Tang San laughed, saying:</p><br/><p>“However, the thing inside is indeed of considerable value. Open it and see.”</p><br/><p>Oscar did as asked, and entirely different from Dai Mubai’s Singular Velvet Sky Chrysanthemum, the instant the jade box opened, the whole room was filled with an odd fragrance. A strong orchid fragrance made everyone’s hearts clear and souls brighten, the fragrance penetrating deep into the heart rousing everyone’s spirits, involuntarily inhaling.</p><br/><p>In the jade case quietly lay an eight petaled orchid, the petals trembling minutely, entirely lustrous snow white, giving people a noble and virtuous feeling.</p><br/><p>Tang San said:</p><br/><p>“This is called an Eight Petal Immortal Orchid, it’s also an immortal treasure herb. It must be picked with gold and stored with jade, and as long as it’s regulated in jade ware, it won’t wither for a thousand years, or a hundred lifetimes. Among all the immortal treasure herbs I brought back with me this time, it’s the one with the gentlest nature, one of the most mellow. Absorbing it is easy, but requires a very long time. Its effect is to strengthen foundations and drive out impurities, its effect should complement the slow cultivation speed you have as a food system Spirit Master. The medicinal effect should even continue until you’ve cultivated to the seventieth rank.”</p><br/><p>Oscar opened his eyes wide,</p><br/><p>“So good? Little San, I love you.”</p><br/><p>[1] ½  = ⅙ m</p><br/>\n</div>"}