{"title": "Chapter 67", "id": 67, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-67", "volume_title": "Volume 1", "body": "<h1>Chapter 67</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 67</p><br/><p>Ice Fire Protection, Hundred Poison Relief</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>The expression on Dugu Bo’s face vanished, again returning to the previous chill. Indifferently looking at Tang San, he said:</p><br/><p>“What did you eat here that makes you fearless even before my Jade Phosphor Serpent Emperor poison?”</p><br/><p>Tang San didn’t hide it, saying:</p><br/><p>“After you brought me here yesterday, I thought it over several times and took the Octagonal Mysterious Ice Grass and Infernal Precious Apricot.”</p><br/><p>“Octagonal Mysterious Ice Grass, Infernal Precious Apricot? What are those?”</p><br/><p>Dugu Bo had never even heard these two names.</p><br/><p>Tang San nodded,</p><br/><p>“They’re two kinds of poisonous herbs that grew on precisely opposite sides of the Ice and Fire Yin Yang Well, each absorbing the essence of the extreme yin or extreme yang to grow.”</p><br/><p>Listening to Tang San’s explanation, Dugu Bo seemed to recall something,</p><br/><p>“You’re speaking of those two plants with extreme cold and torrid heat? Those two could be eaten?”</p><br/><p>Because of the Octagonal Mysterious Ice Grass and Infernal Precious Apricot’s somewhat special nature, he clearly remembered these two plants. Those two were just two of many plants around the Ice and Fire Yin Yang Well.</p><br/><p>He had tried it out before, and even with his spirit power he was unable to stay too long next to any kind of poisonous plant. Dugu Bo knew that these two kinds of herbs both contained cold and fire poison.</p><br/><p>Extremely potent.</p><br/><p>As a result of not being clear on their medicinal properties, he had never used them rashly.</p><br/><p>Because there was only one each of the Octagonal Mysterious Ice Grass and Infernal Precious Apricot, Tang San didn’t fear letting Dugu Bo know,</p><br/><p>“That’s right, these two kinds of plants are both poisonous. If an ordinary person got within ten meters of them, they would freeze or turn to ashes in a very short time, let alone eating them. However, just like yin and yang mutually subdues each other, ice and fire mutually controls each other. When these two kinds of herbs were mixed together, they neutralized each other, greatly reducing the toxicity. But that was also the only opportunity to take them. After taking them, the mutual rejection of ice and fire changed into mutually complementing each other, the effect transforming the body. Further using some methods to increase the absorption, the effect was Ice Fire Protection.”</p><br/><p>“Good, good Ice Fire Protection.”</p><br/><p>Dugu Bo looked at Tang San with a moved gaze, inwardly somewhat hesitant.</p><br/><p>Although he wasn’t clear on the method of taking the Octagonal Mysterious Ice Grass and Infernal Precious Apricot, he knew the medicinal properties of these two kinds of plants were extremely potent, and naturally he understood Tang San couldn’t have fully absorbed their properties already. If he drank his blood, perhaps…… Only, he said these two plants had to be absorbed with a special method, and he didn’t know what that was.</p><br/><p>Thinking of this, Dugu Bo probing asked:</p><br/><p>“And you relied on these to restrain my three kinds of poison?”</p><br/><p>Tang San smiled calmly, saying:</p><br/><p>“One could say so. Old freak, after you brought me here I discovered how you could survive the poison side effects. It’s precisely because of this Ice and Fire Yin Yang Well’s effect. The extremely cold yin water and blazing hot yang water have an extremely potent suppressive effect on all poison. The spring waters themselves are even more inimical to poison, and ordinary people would be unable to endure this environment, even a powerful spirit beast couldn’t survive. But to you this place is useful and harmless. It’s precisely the Ice and Fire Yin Yang Well’s atmosphere that has restrained the poison within you. Even if cultivating here isn’t enough to dispel your poison, at least guaranteeing you will live to be a hundred is not problem. Only……”</p><br/><p>Dugu Bo couldn’t help asking:</p><br/><p>“Only what?”</p><br/><p>Tang San sighed, saying:</p><br/><p>“There was still another important reason I ate the Infernal Precious Apricot and Octagonal Mysterious Ice Grass. It was to be able to live in this place. These two kinds of herbs mingled together is actually equivalent to a small scale Ice and Fire Yin Yang Well, only its effect in fighting poison isn’t as terrifying as the Ice and Fire Yin Yang Well itself. I have come up with two ways to remove your poison, the first is to simultaneously take these two kinds of herbs, and afterwards rely on your formidable spirit power to absorb their properties. Like that I have at least an eighty percent chance of being able to cure you.”</p><br/><p>Dugu Bo’s expression gradually became ice cold,</p><br/><p>“However, you’ve eaten them.”</p><br/><p>Tang San smiled calmly:</p><br/><p>“Old freak. Let me finish first.”</p><br/><p>Since he dared confidently tell Dugu Bo about this, he was naturally reasonable,</p><br/><p>“Octagonal Mysterious Ice Grass and Infernal Precious Apricot are classified as immortal treasure precious herbs, even though they’re highly toxic, there’s no need to doubt the evaluation of these immortal treasures. True, they can dissolve the poison in your body, but at the same time it will get rid of your body poison skills, do you want that?”</p><br/><p>“This……”</p><br/><p>Dugu Bo looked distracted. He had originally thought to take the plan, but hearing Tang San’s words he immediately hesitated.</p><br/><p>Tang San saw Dugu Bo vacillating, and said:</p><br/><p>“It’s fine if you don’t believe me. My blood contains the properties of both herbs, I can draw some to let you try it. However, don’t blame me if your cultivation diminishes.”</p><br/><p>“No need to try, you little freak.”</p><br/><p>Dugu Bo said regretfully,</p><br/><p>“How do you know this?”</p><br/><p>Tang San said unruffled:</p><br/><p>“I found a book when I was small, and within was written down a lot of strange things, the book had a golden section, and I learned all these things from the book.”</p><br/><p>“Just now you said there were two methods of detoxifying me, what’s the other one?”</p><br/><p>Dugu Bo asked.</p><br/><p>Tang San said:</p><br/><p>“I only have a sixty percent confidence in this second method, but it wouldn’t impact your strength. Of course, your granddaughter’s poisoning is still shallow, I have a hundred percent confidence in helping her recover. This method also isn’t complex. The reason you’re suffering the side effects is mainly because of your poison skill cultivation method. It would be fine if you possessed a tool spirit, all that would be required would be for you to condense the poison within your spirit, and all the issues would be easily resolved. But right now you have a beast spirit, and as a result the poison fuses with your body. Even though your spirit power is able to transfer and suppress it, it has already long ago become part of your body, thereby causing maximum harm to your body. If you want to retain the toxin in your body, without letting it injure you, you have to find a parasitic body to act as a repository for the poison. I think that with your strength you should have a spirit bone.”</p><br/><p>Dugu Bo was also an old veteran with regards to poison, and immediately understood Tang San’s words, the jade light in his eyes brightening,</p><br/><p>“You’re saying, that if I forced the poison in my body into my spirit bone, it wouldn’t harm me?”</p><br/><p>Tang San nodded, saying:</p><br/><p>“Just like that, and your granddaughter is the same. As long as you find her a suitable spirit bone, and have her force the poison into her spirit bone when cultivating poison skills, then there wouldn’t be any issues. Just like me right now, even though I possess poison in my body, it’s all within Blue Silver Grass and the external spirit bone Eight Spider Lances, so of course where wouldn’t be any issues for me.”</p><br/><p>Dugu Bo frowned,</p><br/><p>“This old man has cultivated the Jade Phosphor Serpent Spirit for seventy years, my body has already long ago fused with the poison. It won’t be easily forced out, it’s no good, perhaps the side effects will only grow worse. Little freak, you aren’t teaching me to commit suicide?”</p><br/><p>Tang San indifferently said:</p><br/><p>“This is the only feasible way. Of course you wouldn’t directly use spirit power to force it out, like you said, that wouldn’t have a good result, and would on the contrary cause even more powerful backlash. You have to do it in conjunction with certain medicines, gradually filtering out the poison in your bones and energy channels bit by bit, focusing it in the spirit bone. This is a very long process, not something that can be done in a day or two. After all, right now your whole body is poisonous. That’s why I say I only have a sixty percent certainty. Only one thing is certain, even if it’s impossible to gather all of your poison within the spirit bone, it will at least substantially alleviate the pain you have to endure right now, are you willing to try it?”</p><br/><p>Dugu Bo looked at Tang San, a reserved light in his eyes,</p><br/><p>“Little freak, I’ve wanted to kill you repeatedly, do you really want to help cure me? Aren’t you worried I will kill you after being detoxified?”</p><br/><p>Hearing Dugu Bo say this, Tang San knew that he already believed him, and calmly said:</p><br/><p>“Regardless of whether you believe me, I will never reject poison. On the contrary, I’m very fond of it. And there is perhaps only one person as poisonous as you on the entire Continent. As far as I’m concerned, the process of treating you is also an experimental process. As for whether you would renege, even though I can’t be sure, I can explicitly tell you that killing me will also mean your granddaughter’s death. I can treat you here, and when I treat your granddaughter I want to invite the teachers to observe. After treating her, there will be no relation between you and me. What do you think?”</p><br/><p>Dugu Bo pondered it, saying:</p><br/><p>“Fine. Little freak, there are very few people I admire, you are one. I believe you. We’ll do everything as you say. I, Dugu Bo, will always keep my word, and as long as you cure me and my granddaughter, there will be no issues with the three things I promised you, and I further won’t kill you. But, right now I’ll first ask you to eat this. My old life might not be of much value, but I still want to live a few more years. If you kill me, then I’ll take you with me.”</p><br/><p>While speaking he opened his mouth, spitting out a green light, precisely a jade green pearl. Under Dugu Bo’s control the jade green pearl slowly floated over to Tang San. Tang San extended his right hand, letting it fall into his palm. He didn’t know precisely what this thing was, but he still clearly remembered that when Dugu Bo had eliminated the True Saint Dragon, this was what he had used.</p><br/><p>Tang San said with a wry smile:</p><br/><p>“Having me eat something you spit out, this seems a bit nauseating.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Dugu Bo’s cold gaze swept across him,</p><br/><p>“I’m not afraid of telling you that this pill was coagulated after my Jade Phosphor Serpent evolved to Serpent Emperor. One might say that it contains half of all my power. If I die it will burst inside your body. Let alone you, even a Title Douluo couldn’t endure such an internal explosion. You little freak is quite cunning, so this old man has no choice but to reserve some tricks.”</p><br/><p>Tang San directly threw the pellet into his mouth and swallowed, suddenly feeling a warm flow down his throat, and a warmth in his dantian[1]. Not only wasn’t there any bad feeling, that hot feeling instead scattered into the bones of his four limbs, indescribably comfortable.</p><br/><p>Dugu Bo indifferently said:</p><br/><p>“You felt it. As long as you don’t play any tricks on me, the pellet will only benefit your cultivation, boosting your spirit power aggregation. Once you’ve cured me, I’ll remove it.”</p><br/><p>“Old freak, I also have a condition.”</p><br/><p>Tang San knew Dugu Bo hadn’t cheated him in this respect. Without investigating too much, at least right now he knew there was no danger to him. Judging by Dugu Bo’s affection for Dugu Yan, as long as he didn’t remove Dugu Yan’s poison, this old freak would hate to kill him.</p><br/><p>Dugu Bo’s brows wrinkled minutely, his face showing a ridiculous expression,</p><br/><p>“Little freak, did you know that in these last few decades you’re the only person who has dared make demands on me. Even that Heaven Dou emperor would be deferential when meeting me.”</p><br/><p>Tang San still smiled, saying:</p><br/><p>“Then wouldn’t what I’m enjoying now be an emperor’s treatment? Old freak, my condition is very simple: While I make the medicines for you, you can’t peek. This will be where I make the drugs. You only need to bring me a bit of food and drinking water every day. Afterwards you can come here every evening in the hours before your attacks to take the medicine. I don’t know how much time it will take to cure you. A conservative estimate is half a year or more.”</p><br/><p>Dugu Bo nodded, naturally he knew Tang San was afraid he would learn the detoxifying method and kill him. To this meticulous youth in front of him, he didn’t know if he felt regret or admiration,</p><br/><p>“Tang San, do you wish to take this old man as teacher?”</p><br/><p>If it had been an ordinary Spirit Master, on hearing Dugu Bo’s words they might have shed tears of gratitude and immediately kneeled to become an apprentice. But Tang San didn’t, he only shot Dugu Bo a glance, saying:</p><br/><p>“Old freak, I think this term of address suits you quite well, I wouldn’t want to change it. Besides, you think you can teach me anything about poison? Perhaps in some things you should be consulting me.”</p><br/><p>“You…… Fine. Fine, little freak, we’ll wait and see who’s right.”</p><br/><p>Dugu Bo resisted his anger, resolutely glaring at Tang San, then leapt up towards the mountain top. In a few leaps his silhouette had already disappeared.</p><br/><p>With Dugu Bo gone, Tang San sat down on the ground as if he had lost all his strength, heaving great mouthfuls of air. He found that his back was ice-cold from sweat. Even if he had grasped Dugu Bo’s personality, deep in his heart he still didn’t have perfect confidence, and if by some chance the old freak went crazy in spite of everything, he’d immediately become a corpse.</p><br/><p>Looking around him at all those rare and precious medicinal herbs, a small smile appeared at the corners of Tang San’s mouth, ‘Dugu Bo, oh, Dugu Bo, it seems I must thank you. There isn’t any place more perfect than this.’</p><br/><p>Searching his chest pocket with a hand, he pulled out that Nine Segment Jade. With a trembling hand he directly threw it at the Ice and Fire Yin Yang Well.</p><br/><p>This Nine Segment Jade had sucked his blood. If it didn’t have the assistance of the Ice and Fire Yin Yang Well, even though it was poisonous itself it would still die. But it could take refuge in the Ice and Fire Yin Yang Well. Tang San naturally wouldn’t show his secret escape route to Dugu Bo.</p><br/><p>Feeling his stomach, Tang San couldn’t help smiling wryly. He knew he didn’t have any way of contending with that pellet. Let alone basically being unable to extract it, even if he could he still wouldn’t do it.</p><br/><p>The pellet was linked to Dugu Bo’s heart’s blood, if he did something to it, Dugu Bo would discover it immediately, and he’d meet a dead end.</p><br/><p>It was a pity, truly a pity. Tang San looked at the surrounding herbs, inwardly sighing in regret. Each immortal treasure here was unique, but as they said, delicacies didn’t have many uses.</p><br/><p>Tang San knew that if he greedily ate any one of the great immortal treasure herbs, not only wouldn’t it be beneficial, he might immediately be out of luck.</p><br/><p>Only after the Octagonal Mysterious Ice Grass and Infernal Precious Apricot had been absorbed as far as possible within his body could he think about it again.</p><br/><p>Among the immortal treasure herbs were at least seven or eight kinds that could greatly boost his internal strength, at least advancing his spirit power by five ranks, or even more.</p><br/><p>‘It doesn’t matter, can’t I still take what I can’t eat?’</p><br/><p>Tang San showed a smiling expression, stretching out his hand to feel at his waist. In a moment, a mess of things was laid out on the ground. These things were largely some small cases and bottles, each one different from the next.</p><br/><p>Gold, silver, copper, iron, jade, various kinds of cases and bottles were arranged on the ground.</p><br/><p>These were all things Tang San had prepared long ago in order to go find herbs suitable for making poison for hidden weapons. The more precious the herbs, the higher the requirements for storing them.</p><br/><p>Some had to be picked with gold and packed with jade, some had to be picked with silver and stored with iron. With just the slightest mistake, their efficacy would diminish greatly, or even immediately wither. Therefore Tang San had made a lot of preparations.</p><br/><p>Of course, it still wasn’t time to be packing herbs. Once Tang San had inspected these tools, he once again withdrew them into the Twenty Four Moonlit Bridges, afterward starting to carefully catalogue each treasure around the Ice and Fire Yin Yang Well.</p><br/><p>There were a lot of medicinal herbs, and some with extremely similar appearance could have effects that were diametrically opposed. Tang San couldn’t allow himself to make any mistake. There were accidents where poison was mistaken for tonic even at Tang Sect.</p><br/><p>The way of poisons was wide-ranging and broad. He couldn’t be the slightest careless, or he would be gambling with his own life.</p><br/><p>That evening, when Dugu Bo came once again to the Ice and Fire Yin Yang Well to bring Tang San food and water, he couldn’t help be angry. Because Tang San basically didn’t have any medicine for him. But Tang San’s reasoning was extremely dignified: There was nothing here, so how could he make drugs?</p><br/><p>Helplessly, Dugu Bo had no choice but to bring him some the medicine making tools he personally used every day. Even more at Tang San’s request, he went to buy him a large cast copper cauldron.</p><br/><p>There was no need for fire in this place, the blazing hot yang side of the spring was more terrifying than any flame, practically like magma. Even if it was just a bit, it could melt gold into iron.</p><br/><p>Just like this, from this day onward, Tang San lived at the Ice and Fire Yin Yang Well. As long as Dugu Bo wasn’t present, he soaked in the Ice and Fire Yin Yang Well to cultivate.</p><br/><p>This didn’t just boost his Mysterious Heaven Skill circulation, at the same time it also accelerated his absorption of the Octagonal Mysterious Ice Grass and Infernal Precious Apricot’s properties.</p><br/><p>In the afternoon he made drugs. He hadn’t worked with these things for very many years, so in order not to make any mistakes he was extremely careful. As time passed he gradually grew more skillful.</p><br/><p>However, Tang San did after all come from Tang Sect, and was an expert in refining poison. That he couldn’t refine tonics was regretful. Tang San used a whole three months to gain a clear grasp on the herbs around the Ice and Fire Yin Yang Well, and tried making practically every kind of poison.</p><br/><p>As for the doses of the antidote he gave Dugu Bo, it wasn’t anything worth mentioning. Just some muscle relaxing and blood circulating medicine, that was all. But with each dose of this medicine Tang San included a drop of his own blood.</p><br/><p>Actually, Dugu Bo was still being swindled by Tang San. The poison in his body, most crucial was the location, as well as the two kinds of extreme properties of the Octagonal Mysterious Ice Grass and Infernal Precious Apricot.</p><br/><p>However Tang San didn’t cheat him completely. If Dugu Bo directly ate the two herbs, it would immediately drive out the poison skills in his body.</p><br/><p>But after being transformed within Tang San, their properties became a lot milder, and with the imperceptible influence of a small dosage, it became a therapeutic effect.</p><br/><p>After Dugu Bo had taken it for a week, the pain of the poison side effects had clearly alleviated. And slowly accumulating the poison in his spirit bone like Tang San said, not only didn’t weaken him, but even showed signs of fracturing the ninety first rank bottleneck he had been unable to break through for years.</p><br/><p>One must know that past the ninetieth rank, each rank was an enormous bottleneck. Dugu Bo had already been stuck at the same level for a decade. How couldn’t these signs of breaking through make him wildly excited?</p><br/><p>The merits of the antidote clearly improved Dugu Bo’s attitude toward Tang San. Not only was he more amiable, but every night when he came to take the medicine and deliver basic articles, he would also talk about some knowledge relating to poison.</p><br/><p>Tang San had inherited the Tang Sect’s poison capability, but there were some things different between his old world and this one. And in this world, there was no one more knowledgeable about every kind of poison than Dugu Bo.</p><br/><p>Tang San naturally learned a lot from him.</p><br/><p>But as Dugu Bo came to know Tang San, he became more and more fearful. This just ten-something kid seemed to have a mind as vast as the boundless ocean, in all kinds of poison lore he sometimes gave him the feeling of producing sudden flashes of insight.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Originally when Tang San refused becoming an apprentice, Dugu Bo had been extremely indignant. But after some time he discovered that Tang San wasn’t being arrogant. With regards to poison, even if he wasn’t as experienced as himself, his theoretical understanding wasn’t unlike his own. With the two mutually researching the use of poison, they both profited a lot. And as time passed their mutual wariness dulled.</p><br/><p>Of course, Dugu Bo’s pearl was still within Tang San’s dantian, but Tang San didn’t protest. One old and one young were like close friends, passing every day similarly.</p><br/><p>Funnily enough, Dugu Bo relying on his own understanding of drugs, after eating the antidote Tang San gave him would return to make it on his own, but even though his antidote used precisely the same ingredients as Tang San’s, it still didn’t have any effect. He had no way of knowing that Tang San’s version contained the most important ingredient.</p><br/><p>In the blink of an eye, half a year had already passed. In the past half year, Grandmaster and Flender had visited twice, but as they saw the harmonious relationship between Tang San and Dugu Bo didn’t seem fake, and further adding Tang San never voicing concerns about his safety, the two were finally relieved. They only repeatedly reminded Tang San that after this learning period finished, he would return directly to join the new Shrek Academy.</p><br/><p>Dugu Bo was after all a Title Douluo, even though Tang San could match him in knowledge of poison, he was far from comparing with Dugu Bo in spirit power and cultivation.</p><br/><p>Dugu Bo fondly remembered Tang San’s work in detoxifying him and occasionally gave him pointers, making Tang San’s understanding of spirits even more profound. Dugu Bo’s theoretical understanding didn’t match Grandmaster’s, but he had after all experienced the whole process of cultivating to the Title Douluo level, and possessed experiences Grandmaster didn’t. As a result, Tang San benefited not a little from him.</p><br/><p>Further adding the Ice and Fire Yin Yang Well continuously helping Tang San absorb the Octagonal Mysterious Ice Grass and Infernal Precious Apricot to transform his body, as well as the effect from Dugu Bo’s pearl, in this half year Tang San’s spirit power could be said to have advanced by leaps and bounds. From his original thirty fourth rank, he had already advanced three ranks to reach the thirty seventh ranked realm, about to catch up to where Dai Mubai had been.</p><br/><p>“Little freak, I’m here.”</p><br/><p>Dugu Bo dropped from the sky with a smirk.</p><br/><p>“Yi.”</p><br/><p>Dugu Bo looked to where Tang San habitually rested. Every night when he came here Tang San would also greet him, but today there wasn’t any sound. Could he have gone out for something?</p><br/><p>Dugu Bo was inwardly alarmed, and in several leaps, as he saw Tang San sitting there he breathed out slightly. Even if he didn’t admit it even to himself, Dugu Bo no longer had the previous ill will towards Tang San, and even regarded him as a friend.</p><br/><p>Dugu Bo was naturally eccentric, and he cultivated a poisonous spirit. Ordinarily there wouldn’t be any Spirit Masters that wanted anything to do with him. Even if there were, they’d mostly be afraid. But even though Tang San always called him ‘old freak’, these days had had imperceptibly given rise to a kind of familiar feeling for Dugu Bo. A bit like a senior to a junior, or the concern between friends. Besides, he still needed Tang San’s antidote.</p><br/><p>Tang San sat upright, lifelessly staring ahead. And in front of him was the drug refining copper cauldron.</p><br/><p>Right now the copper cauldron was supported over the blazing hot yang spring, the bottom slightly touching the spring water, using the yang water’s heat. If an ordinary copper cauldron had come into even the slightest contact with the blazing hot yang waters it would have turned into liquid copper, but Tang San had smeared this cauldron with a kind of herb from the extremely cold side of the well, allowing it to withstand the extreme heat. Further adding his own fearlessness of the blazing heat of the yang spring, it could be controlled.</p><br/><p>Dugu Bo somewhat curious crouched at Tang San’s side,</p><br/><p>“Little freak, what are you doing this time?”</p><br/><p>Tang San brought a finger to his lips, making a silencing gesture, his eyes still fixed with full concentration on the copper cauldron.</p><br/><p>Dugu Bo followed Tang San’s gaze. He only saw faint purple smoke constantly flow out through a small crack in the cauldron’s lid. He had long ago already become used to this kind of situation. Tang San would frequently concoct some kind of poison making him unable to help sighing in admiration. Only Tang San’s refusal to speak of his recipes made Dugu Bo constantly depressed.</p><br/><p>That purple smoke rising from the cauldron didn’t scatter above, swaying slightly. Dugu Bo’s nose twitched slightly. With his internal poison skills, his ability to resist poison was even more powerful, and naturally he wouldn’t be afraid. But he quickly discovered that the purple smoke didn’t have any smell, leaving him without hints as to its composition. For some reason, looking at that purple smoke rising in spirals, he felt a slight chill in his heart.</p><br/><p>As a Spirit Master with poison abilities, Dugu Bo understood very clearly that what he felt was a kind of intuition exclusive to him, only appearing when he encountered something that could threaten his life. This little freak had actually refined a poison that could even make him feel threatened.</p><br/><p>In fact, even though Tang San had refined a lot of poisons and even clever drugs that had made Dugu Bo sigh in admiration in the last half year, he had still never produced something that could threaten even him like today. He didn’t dare disturb him, and just sat next to Tang San, waiting calmly.</p><br/><p>Tang San’s expression was unprecedentedly serious, constantly watching the copper cauldron and the purple smoke rising from its lid. As time passed, the purple smoke became thinner and thinner, and at the same time the color changed from purple to white, then once again from white to black, in a bizarre process.</p><br/><p>Over the course of this process, Tang San used Blue Silver Grass to open the cauldron and insert some medicinal plants three times. Even though by now his Blue Silver Grass had already attained Ice Fire Protection, each time it still withered.</p><br/><p>Thus, Dugu Bo’s curiosity increased even more. After drinking his tonic, he quietly operated his poison skills, trying out the energy within that smoke.</p><br/><p>However, no matter how he tried he was still unable to figure out just what medicaments had gone into that purple smoke. Dugu Bo only felt that it should be a mix of several kinds of poisons, complementing each other to create an extreme toxicity.</p><br/><p>‘Don’t tell me this kid wants to kill me?’ Dugu Bo thought to himself. Otherwise, why would he be refining such an extremely poisonous drug?</p><br/><p>But he quickly dispelled this thought. Let alone their relationship having become friendly, even if Tang San really wanted to poison him, he wouldn’t refine it right in front of him.</p><br/><p>The refining process was endless, and by the morning the next day, the sky already bright, and Dugu Bo felt a bit impatient, that black smoke rising from the copper cauldron finally stilled and withdrew within the cauldron.</p><br/><p>“It’s done.”</p><br/><p>Tang San suddenly leapt up, an uncontainable excitement in his voice. His current excitement actually matched his age.</p><br/><p>“Little freak, what is it you’ve done?”</p><br/><p>Dugu Bo couldn’t help asking.</p><br/><p>Tang San released a long breath, looking at Dugu Bo he mysteriously said:</p><br/><p>“It’s a treasure. The treasure of a lifetime. I can guarantee that even if it hit you, you would still only have time for three breaths. Of course, it’s no threat to you; your skin is too thick and it couldn’t enter your body. I’ll let you see my masterpiece in a bit.”</p><br/><p>A dozen Blue Silver Grass strands whirled out, dragging the copper cauldron back to shore, he waited for the cauldron to slowly cool without urgency.</p><br/><p>Since Tang San had already said this, Dugu Bo could only wait. After no less than an hour, after the cauldron had completely cooled, Tang San stepped forward and cautiously uncovered the lid.</p><br/><p>Dugu Bo used his poison skills to protect himself, stretching forward his head to look inside the cauldron. Inside, in the center was a small metal disc, surrounded by completely dried up remains, probably the remnants of dried out plants. And in the center of that disc were three one cun[2] long, completely unreflective pitch black little needles.</p><br/><p>“You’ve worked for half a day, what is?”</p><br/><p>Dugu Bo snorted unhappily,</p><br/><p>“What use is this toy?”</p><br/><p>Tang San grinned and, using Mysterious Jade Hand, cautiously took out the mold, further taking out a prepared small jade case from Twenty Four Moonlit Bridges and slipping the three needles into three grooves.</p><br/><p>“It’s a poison capable of killing a Title Douluo, and you’re asking what use it is?”</p><br/><p>A burning light flickered in Tang San’s eyes. Back at Tang Sect, this kind of gaze would appear every time he produced a super hidden weapon.</p><br/><p>“This thing can kill a Title Douluo? Don’t joke with me.”</p><br/><p>Dugu Bo’s expression was disbelieving,</p><br/><p>“This little toy wouldn’t even penetrate a Title Douluo’s defense, what use is the poison?”</p><br/><p>Tang San glanced at Dugu Bo,</p><br/><p>“Do you know about what’s called hidden weapons? Hidden weapons are weapons used surreptitiously. Even if it can be blocked from the front doesn’t mean it can never have any use. Besides, in order to use these three needles I have to first break through the fortieth rank of spirit power. They require a special technique to use. They’re called Yama’s Invitation[3].”</p><br/><p>“Yama’s Invitation? Why so?”</p><br/><p>Dugu Bo couldn’t make sense of it.</p><br/><p>Tang San looked at the three small needles in the jade box in his hand, his eyes expressing an infatuated light, as if looking at a rare treasure,</p><br/><p>“‘Yama’ refers to the god of death. When speaking of gods in antiquity, if saying that the god of death had invited you, what did that mean? Naturally it was to have you return to the embrace of the god of death. If Yama called for your death at the third watch, nobody would dare wait until the fifth watch.”</p><br/><p>[1] The dantian is the energy center two fingers below the navel.</p><br/><p>[2] 1 = 10/3 cm.</p><br/><p>[3] () Literally “Yama’s Sticker”, but in the next bit they speak of the invitation () of the god of death with a similar character with identical pronunciation. May be a typo.</p><br/>\n</div>"}