{"title": "Chapter 68", "id": 68, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-68", "volume_title": "Volume 1", "body": "<h1>Chapter 68</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 68</p><br/><p>Wishful Hundred Treasure Purse And Cluster Soul Chasing Ball</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>“Pei, you can return to the arms of death.”</p><br/><p>Dugu Bo snappily rapped Tang San on the head. From his expression, Tang San could see he didn’t believe in the power of the Yama’s Invitation in his hand.</p><br/><p>Actually, even Tang San hadn’t expected he would be able to refine the Yama’s Invitation.</p><br/><p>As the third ranked in the Hundred Weapon Separation of the Mysterious Heaven Treasure Record, how couldn’t he be excited? In his previous world, any one in the martial world would tremble when hearing the name of the soul and life capturing Yama’s Invitation.</p><br/><p>In order to refine Yama’s Invitation, Tang San used forty nine kinds of precious herbs near the Ice and Fire Yin Yang Well, in order to make this Yama’s Invitation’s poison irresistible.</p><br/><p>These black little needles basically weren’t metal, but were completely condensed from poisonous substances. Once it entered the body it would immediately turn back into poison, taking effect immediately.</p><br/><p>Let alone an antidote, even if one existed, there wouldn’t be a chance to use it. There wouldn’t even be enough time for a hero to cut off his wrist.</p><br/><p>Yama’s Invitation, how could it be so easily received?</p><br/><p>However, the technique for launching Yama’s Invitation required enormous internal strength. By Tang San’s calculations, to have enough Mysterious Heaven Skill to use Yama’s Invitation, he would need to reach at least the fortieth rank, and moreover his entire internal strength would only be enough for one attack.</p><br/><p>But this was already sufficient. Even if Tang San hadn’t tried it, he could be certain that even if he was unable to kill powerful opponents, as long as he could get the Yama’s Invitation to pierce the skin, then the opponent would soon have his life and soul captured.</p><br/><p>Cautiously putting the jade box within Twenty Four Moonlit Bridges, Tang San thought to himself that this was fortunately at the side of the Ice and Fire Yin Yang Well, otherwise, where would he find so many precious herbs? Unfortunately, the two higher ranked hidden weapons couldn’t be created just with herbs.</p><br/><p>Sorting out his thoughts, Tang San looked at Dugu Bo. Over this past half year, Dugu Bo’s appearance had changed considerably. The originally wretched green hair had already become an ordinary grizzled color and, besides his eyes, his green tint had gradually vanished.</p><br/><p>Half a year of medication left Dugu Bo practically without the pain from the poison backlash. But he had after all been poisonous for many years. Completely purging himself was practically impossible.</p><br/><p>Dugu Bo was already extremely satisfied with his present condition. Naturally he was aware of his circumstances. At the same time he could be certain that using the same method to eliminate his granddaughter’s poison wouldn’t be a problem.</p><br/><p>“Little freak, return it to me.”</p><br/><p>Dugu Bo noticed Tang San looking at him, and extended his right hand to make a gesture.</p><br/><p>“Return it? Return what?”</p><br/><p>Tang San puzzled asked.</p><br/><p>Dugu Bo said:</p><br/><p>“What? Don’t tell me you still want to keep my pearl your whole life? I’d hate to part with it.”</p><br/><p>Tang San somewhat astonished said:</p><br/><p>“You’re not afraid I’ll poison your medicine?”</p><br/><p>Dugu Bo snorted,</p><br/><p>“By now I’ve internalized the poison skills, gathering them in my spirit bone. Mere poisoning, I suspect there isn’t any kind of poison that can kill me. Even if those little needles of yours could really deal with a Title Douluo, they would be useless against me. Quickly give it back, haven’t you had enough benefit from it alread? In this half year your spirit power has already reached the thirty seventh rank. I’m afraid you’ll absorb all the energy of the pearl.”</p><br/><p>Tang San smiled. He knew that even if Dugu Bo didn’t want to admit it, he already didn’t have any wariness towards him. In this half year he had also gradually come to understand Dugu Bo. This seemingly extremely ferocious Poison Douluo actually wasn’t much different from common elders. Even if the words that came out of his mouth were frightening, his basic character wasn’t bad. As long as he wasn’t threatened or offended, he wouldn’t casually go looking for trouble.</p><br/><p>“Take it. Frankly, I’m also a bit reluctant to part with it.”</p><br/><p>Tang San looked at Dugu Bo with a smile, spreading his arms.</p><br/><p>Dugu Bo stepped in front of Tang San, raising his hand to push at Tang San’s stomach. A scorching hot energy immediately provoked a contraction in Tang San’s dantian, and immediately afterward, along with Dugu Bo drawing his hand up, the hot flow followed up to the throat. Tang San opened his mouth, and with a green light the pearl flew out, falling into Dugu Bo’s hand.</p><br/><p>Even though it seemed like such a small thing, Tang San still relaxed his whole body. The threat to his life that had troubled him for half a year was finally dealt with. In fact, he hadn’t had any way to deal with Dugu Bo’s pearl.</p><br/><p>“Little freak, my poison is also practically under control, and recently I’ve felt your antidot have less and less of an effect on me. There’s a lot of poison accumulated within me, I know that myself, it’s impossible to completely store it in the spirit bone. Besides, my body has already adapted to a certain degree of poison, if I didn’t have any at all, it might actually be harmful. I’ll consider it treated here. Later I’ll bring your teachers as well as my granddaughter, and once you’ve cured Yan-yan, you can leave.”</p><br/><p>“You’re letting me leave?”</p><br/><p>Tang San looked at Dugu Bo. He didn’t know why, but deep down he was somewhat reluctant to go. Was it a reluctance to part with these precious herbs around the Ice and Fire Yin Yang Well? Perhaps, but that wasn’t everything.</p><br/><p>Dugu Bo’s expression seemed somewhat lonely,</p><br/><p>“You’re still young, I can’t keep you here for a lifetime. It’s a pity, if you were a few years older, I’d marry my beautiful granddaughter to you, then you could call me grandpa.”</p><br/><p>Tang San helplessly shook his head, saying:</p><br/><p>“Forget about it, it’s enough for that granddaughter of yours to inherit your traditions. Besides, she’s already got a lover. The Blue Lightning Tyrant Dragon clan’s direct heir, wouldn’t he be more outstanding than me?”</p><br/><p>“Kid, are you provoking me? Even if the Blue Lightning Tyrant Dragon clan is powerful, compared to your background it doesn’t count for anything. Besides, that kid Yu Tian-Heng still lacks a lot compared to you.”</p><br/><p>“My background?”</p><br/><p>Tang San stared blankly, unconsciously recalling his, for several years unseen, even without a letter, father, he couldn’t help sighing,</p><br/><p>“What background, I’m just a blacksmith’s son.”</p><br/><p>Dugu Bo also stared blankly. Over this half year he had also gained a considerable understanding of Tang San. From his expression he could clearly see that Tang San wasn’t deliberately putting on an act.</p><br/><p>“Kid, tell me about your past.”</p><br/><p>Dugu Bo pulled Tang San to sit by the Ice and Fire Yin Yang Well.</p><br/><p>Tang San nodded, and besides his greatest secret of passing into this world, he didn’t hide anything about his life since coming to this world.</p><br/><p>At once, he spoke of everything from his childhood, spoke of his innate full spirit power, twin spirits, even further spoke about taking Grandmaster as his master, as well as entering Shrek Academy and everything that happened afterward, he recounted everything in detail.</p><br/><p>Carefully listening to Tang San’s story, Dugu Bo was inwardly astounded. Even if he was still certain that Tang San was that person’s son, he hadn’t expected he would be left like that in his childhood.</p><br/><p>“Then where did you learn about poison? Picking up a book to reach this level? This old man doesn’t believe it.”</p><br/><p>Tang San grinned,</p><br/><p>“Doesn’t matter if you believe it. It’s a secret, I’m not telling.”</p><br/><p>Dugu Bo snorted,</p><br/><p>“Then I’ll leave it at that. Take this.”</p><br/><p>While speaking, Dugu Bo pulled out a blue leather purse from somewhere and tossed it to Tang San.</p><br/><p>The leather purse was only the size of two adult palms, the kind that was hung from the belt. Even if it was much larger than a spice bag, it could comfortably fit in one hand.</p><br/><p>“What’s this? Are you bribing me?”</p><br/><p>Tang San suspiciously untied the leather purse, without asking he knew this was a spirit tool,</p><br/><p>“I already have Teacher’s Twenty Four Moonlit Bridges. You keep this, or give it to your granddaughter.”</p><br/><p>Dugu Bo shook his head,</p><br/><p>“No, this is different from the one you have. My granddaughter doesn’t like playing with these drugs, giving it to her is a waste. It’s called Wishful Hundred Treasure Purse[1]. Even though that spirit tool of yours is pretty good, it’s still a bit lacking compared to this. Because, yours can hold dead things, mine can hold living things.</p><br/><p>Tang San was intelligent, and immediately understood what Dugu Bo was saying. His lips moved slightly, whistling quietly.</p><br/><p>A thread of jade light whooshed out from Tang San’s bosom and into his palm, it was precisely that five cun long, entirely jade green Nine Segment Jade.</p><br/><p>In the past half year the Nine Segment Jade had shown a not inconsiderable change. Its size hadn’t changed, but its little eyes had become even more sparkling, its whole body also close to transparent, jade green as if carved from perfect jade, red and white streams moving within its body, and when it was motionless it appeared like a decoration rather than a living thing.</p><br/><p>“In other words, this little creature can be held inside without suffocating?”</p><br/><p>Tang San’s expression was pleasantly surprised. A spirit tool that could hold living things was vastly different from his Twenty Four Moonlit Bridges. It wasn’t just holding the little Nine Segment Jade in his hand, even herbs could be kept fresh inside. Like this, he wouldn’t need to render herbs into pills to carry them. In fact, a lot of herbs that could be used fresh would have a better effect the fresher they were.</p><br/><p>Dugu Bo looked at Tang San’s surprised face, and grinned,</p><br/><p>“Just now you seemed to say you didn’t want it, yes. Then give it back.”</p><br/><p>While speaking, he extended his hand and gestured at Tang San.</p><br/><p>Perhaps it was because he had been together with Dugu Bo for so long, but Tang San’s character had also been a bit infected. With no trace of politeness he hung the Wishful Hundred Treasure Purse on his Twenty Four Moonlit Bridges,</p><br/><p>“Did I? I can’t remember. Giving me something then still wanting it back, are you still a Title Douluo.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Dugu Bo snorted,</p><br/><p>“Anyway, there’s only you and me here, what’s a Title Douluo? Title Douluo are still people. I promised you that as long as you could cure my poison, I would grant you three things. The first you’ve already said, I can’t injure Shrek Academy’s people. If I give you this Wishful Hundred Treasure Purse, isn’t it a second?”</p><br/><p>Tang San winked at Dugu Bo, somewhat innocently looking at the Poison Douluo,</p><br/><p>“Old freak, just now you were the one who took the initiative yo give it to me. Why should I care what you think?”</p><br/><p>“You……”</p><br/><p>Dugu Bo was immediately angry, but unfortunately he didn’t have a way against Tang San.</p><br/><p>Tang San calmly smiled, touching his waist, he flicked his wrist, holding out his palm to Dugu Bo,</p><br/><p>“Even if the Wishful Hundred Treasure Purse can’t be considered one of the conditions, I can’t take something for nothing. I’ll give you this in return.”</p><br/><p>Dugu Bo looked at Tang San’s palm. In it quietly lay two not very large iron balls, completely pitch black, without any visible features.</p><br/><p>“What’s this? Poison? Or a tonic?”</p><br/><p>Dugu Bo sniffed, but didn’t smell anything, and asked curiously.</p><br/><p>Tang San smiled:</p><br/><p>“Can’t you see? These are two iron balls. Where would there be any drugs, old freak, don’t tell me you can’t even tell the difference between medicine and metal?”</p><br/><p>Dugu Bo glared at him, saying:</p><br/><p>“How can these two things compare to my Wishful Hundred Treasure Purse?”</p><br/><p>Tang San said:</p><br/><p>“Why wouldn’t they. They can save your life.”</p><br/><p>Dugu Bo snorted disdainfully,</p><br/><p>“Little freak, there’s no problem with your brain. This old man is a Title Douluo, there aren’t many people in this world who could prevail over me, just a few people with abnormal strength, what can relying on these two iron balls do?”</p><br/><p>Tang San said:</p><br/><p>“You don’t believe me? Then fine, I would be reluctant to give them to you.”</p><br/><p>While speaking, he was about to withdraw the iron balls.</p><br/><p>With a flash of green light, before Tang San could turn his wrist, those two iron balls were already in Dugu Bo’s hand,</p><br/><p>“Giving things and then taking them back, aren’t you the cheeky one? Tell me. What use are these things.”</p><br/><p>Dugu Bo held the two iron balls in his left and right hand, but didn’t see any result. Using the other hand to pinch one, he was just about to test its strength when Tang San hurriedly stopped him.</p><br/><p>“Do you want to die? Don’t pinch it.”</p><br/><p>Tang San caught Dugu Bo’s wrist. Even though his strength didn’t have any effect on Dugu Bo, Dugu Bo still held a lot of trust in him and quickly relaxed his grip.</p><br/><p>“What are you doing? So mysterious, quickly tell me. What is this thing really.”</p><br/><p>Dugu Bo asked somewhat impatiently. His curiosity wasn’t any different from normal people. Even though he expressed disdain on the surface, in his heart he was still certain that something a little freak like Tang San would give him as a gift wouldn’t be any ordinary goods.</p><br/><p>At this Tang San sternly said:</p><br/><p>“This thing is known as a Cluster Soul Chasing Ball[2], its one of the most potent hidden weapons I can make right now. You must absolutely be careful with it. Once it suffers enough external pressure or a hit, its power will appear immediately. These things are used two together. They have to be used with a swift throwing technique. Perhaps its immediate power isn’t enough to harm a Title Douluo, but its unexpectedness and power is enough to stop any enemy. The greatest feature of these is the user’s internal…… Eh, no, the higher the spirit power, the more powerful it is.”</p><br/><p>“These two little things can be powerful?”</p><br/><p>Dugu Bo was still somewhat unconvinced.</p><br/><p>Tang San said:</p><br/><p>“I’ll try them for you to see.”</p><br/><p>While speaking, grabbing the two iron balls in Dugu Bo’s hands, he weighed them in his hands.,</p><br/><p>“Look closely.”</p><br/><p>While speaking, white light flickered around Tang San, and with a flick of his wrists the two iron balls flew out simultaneously.</p><br/><p>Even though they flew out simultaneously, the two iron balls travelled one after the other. The moment the one in front was about to lose momentum, the rear one suddenly chased after it, directly striking the one in front.</p><br/><p>With a bang, a purple fog filled the air, in a flash covering more than ten square meters.</p><br/><p>With Dugu Bo’s eyesight, he clearly saw what was happening inside the purple fog. Countless small filaments burst out with a delicate hum, in an eyeblink piercing into the not distant mountain wall.</p><br/><p>Tang San said:</p><br/><p>“What is called ‘cluster’, indicates the burst attack after the iron balls have ruptured. This purple fog is extremely poisonous. It has a potent anaesthetic effect, and as long as someone inhales a little bit, ordinary people will sleep for ten days. Even powerful Spirit Masters who thoughtlessly get affected with be forced to slow down. And after the two Cluster Soul Chasing Balls collide, they will immediately emit the filaments within. Those are several hundred Bone Changing Soul Needles[3], specially for breaking big dipper defensive qi, with a matchless poison that, once hit, will spread quickly, ossifying their path like cotton.”</p><br/><p>These Cluster Soul Chasing Balls were what Tang San had made while in seclusion at the Shrek Academy. It was considered a combined product of both mechanical class and throwing class hidden weapons, ranked fifth among mechanical class hidden weapons. When he was at Tang Sect, Tang San had been specially in charge of producing these Cluster Soul Chasing Balls, and it was also by making these that Tang San had been considered the first or second best among Tang Sect outer disciples.</p><br/><p>This time Tang San had made altogether eighteen, or to say nine pairs.</p><br/><p>Originally they had been unpoisoned since he didn’t have the ingredients, but since coming here and spending this time refining, these Cluster Soul Chasing Balls had become truly complete.</p><br/><p>As a result of having all kinds of top quality drug ingredients here, these Cluster Soul Chasing Balls’ Bone Changing Soul Needles were even a bit better than in his previous life.</p><br/><p>Dugu Bo’s figure flickered, and he already appeared by the Bone Changing Soul needles in the mountain wall. As he looked closer at everything before him he couldn’t help but inhale deeply.</p><br/><p>Countless black little holes had appeared on the mountain wall, each one penetrating several chi inside, faintly blue smoke emerging, and just by using his nose he could detect that dreadful poison.</p><br/><p>Turning back to Tang San, Dugu Bo couldn’t help but sigh in admiration:</p><br/><p>“Little freak, I really don’t know if I should call you a genius or a lunatic. You can even make these things. I really don’t know how your head is put together. However, looking at this attack power, it still seems far from enough. Let alone a Title Douluo, even a sixtieth or seventieth ranked Spirit Master would have enough defensive power to withstand it.”</p><br/><p>Tang San snapped:</p><br/><p>“Old freak, tell me, what rank am I?”</p><br/><p>Dugu Bo moved back towards him,</p><br/><p>“Over thirtieth, not more than fortieth anyway.”</p><br/><p>Tang San said:</p><br/><p>“Just now I said that when using these things, the higher the spirit power, the more powerful the attack. In other words, the when the Cluster Soul Chasing Ball is used with even more powerful spirit power, it will be faster, and naturally the Bone Changing Soul Needles’ penetrating power will be even more powerful. Unless you encounter a purely defensive Title Douluo, with your spirit power, don’t tell me you still couldn’t injure the enemy? Even if the opponent blocks with spirit power and doesn’t let them collide, once it’s struck by external force it will still instantly burst. The key point to this thing’s strength is its suddenness, the more unexpected its use, the higher the chance of destroying the enemy.”</p><br/><p>Dugu Bo’s eyes brightened, now he completely understood Tang San’s meaning, and immediately exulted in his heart,</p><br/><p>“Indeed pretty good, little freak, quickly gift me a hundred eighty.”</p><br/><p>Tang San was speechless,</p><br/><p>“Do you think these are sweet peas? A hundred and eighty. I’ve made two, and just now gave them to you to test. Who had you refuse to believe.”</p><br/><p>“What? Two?”</p><br/><p>Dugu Bo’s eyes opened wide,</p><br/><p>“Are you trying to make me angry? You made two and still used them for a test. Tell me you’re joking.”</p><br/><p>Tang San smiled:</p><br/><p>“Seeing is believing, if I didn’t let you see it with your own eyes, would you have believed it? Fine, in fact I made four, and I’ll give you another two. Take care of them this time.”</p><br/><p>While speaking he waved his hand, and two iron balls flew towards Dugu Bo.</p><br/><p>Dugu Bo had just now seen the power of Tang San’s Cluster Soul Chasing Balls, and even though he wasn’t worried with his strength, he still jumped with fright.</p><br/><p>“You little freak, are you trying to kill me?”</p><br/><p>Dugu Bo hastily condensed his spirit power into a defensive screen in front of him.</p><br/><p>But who knew that these two iron balls were thrown with a completely different technique than the last ones, and the moment the nearly reached Dugu Bo they stopped in midair, and fell to the ground.</p><br/><p>Dugu Bo stretched out a hand and seized the two iron balls. Inwardly he sighed in admiration, ‘this little freak’s strength might not be up to my own, but these little tricks are still truly outstanding. Perhaps in the future his achievements will surpass even mine.’</p><br/><p>Even though if one looked only at their value, the two Cluster Soul Chasing Balls clearly weren’t equal to his Wishful Hundred Treasure Purse, looking at the Cluster Soul Chasing Balls’ ability to save his life they were still more useful to Dugu Bo.</p><br/><p>Collecting the two iron balls, Dugu Bo clasped his hands behind his back and faced the Ice and Fire Yin Yang Well,</p><br/><p>“Little freak, when will you be prepared to treat my granddaughter?”</p><br/><p>Tang San looked distracted a moment. Dugu Bo’s words were the same as asking when he would leave.</p><br/><p>All people had feelings, and Tang San had been here even longer than he’d been at Shrek Academy. Even though Dugu Bo had been brimming with menace at the start, over this time the two had developed a relationship of teachers or friends that Tang San was reluctant to part with.</p><br/><p>If not for Dugu Bo, he absolutely wouldn’t have been able to merge his understanding of medicine between these two worlds in so short a time, and it would’ve been even more impossible to make those three Yama’s Invitations.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>“Old freak, are you so eager to get rid of me?”</p><br/><p>Tang San looked at Dugu Bo’s somewhat lonely back.</p><br/><p>Dugu Bo calmly said:</p><br/><p>“Don’t tell me I should keep you here for a lifetime? The outside world is a much vaster place, that is where you should go. Without enough experience, what will you rely on to climb over the Title Douluo position in the future?”</p><br/><p>He didn’t mask his admiration of Tang San. If the age gap hadn’t been to large, perhaps this should have been called the mutual admiration of talent.</p><br/><p>The air seemed to become heavy, neither Tang San nor Dugu Bo spoke, Tang San didn’t reply to Dugu Bo’s question, he only stepped forward to stand at his side, looking out at the Ice and Fire Yin Yang Well, frowning slightly, pondering deeply.</p><br/><p>After a long time, Tang San’s furrowed brows suddenly smoothed, seemingly having figured something out, looking at Dugu Bo with a card up his sleeve,</p><br/><p>“Old freak, you still have to do two things for me, right.”</p><br/><p>Dugu Bo nodded,</p><br/><p>“This old man always keeps his word, as long as it doesn’t violate my principles, I’ll agree.”</p><br/><p>Tang San grinned, saying:</p><br/><p>“Then fine, I’ve already thought of the other two things.”</p><br/><p>“You have?”</p><br/><p>Dugu Bo’s brows wrinkled, thinking, ‘this stinking brat, what does he take my promises for, doesn’t he know how important these three commitments could be for him?’ Relying on his Title Douluo strength, they weren’t something to play around with.</p><br/><p>Tang San nodded, gazing at the Ice and Fire Yin Yang Well’s surroundings,</p><br/><p>“My second condition is to let me take away all the herbs I need from here, you can’t stop me.”</p><br/><p>“This?”</p><br/><p>Dugu Bo unhappily looked at Tang San. Although the medicaments around the Ice and Fire Yin Yang Well were precious, to someone who had already reached the peak of Title Douluo like him, it wasn’t of any significance. When he gave Tang San the Wishful Hundred Treasure Purse, he had already silently agreed to let him take away any plants from here.</p><br/><p>Tang San said:</p><br/><p>“Then do you agree?”</p><br/><p>“I agree, why wouldn’t I agree to such a simple matter?”</p><br/><p>Dugu Bo said indifferently. At the same time he also indicated to Tang San that he shouldn’t lightly speak his conditions now. Even leaving first and using them later was fine.</p><br/><p>Tang San somewhat pondering said:</p><br/><p>“That’s too simple, huh. Then the next condition is a little more difficult. I don’t know whether you will agree.”</p><br/><p>Dugu Bo loftily said:</p><br/><p>“To me, is there anything that’s difficult?”</p><br/><p>Tang San probingly asked:</p><br/><p>“Does that mean you agree?”</p><br/><p>Dugu Ba was no impetuous youngster. How would the old fox lightly promise anything,</p><br/><p>“Let me hear what your condition is first.”</p><br/><p>Tang San smiling said:</p><br/><p>“Actually it’s also very simple. Our Shrek Academy’s teachers are comparatively lacking in strength, and also needs guards. So my third condition, is to invite you as a high ranked advisor at our Shrek Academy……”</p><br/><p>“Out of the question.”</p><br/><p>Dugu Bo didn’t wait for Tang San to finish before rejecting him,</p><br/><p>“This old man has always most feared having restricted freedom, this is already a question of principles. I can’t agree to it. You little freak. You would actually have me be a hired thug? Even the Heaven Dou imperial family wouldn’t have the ability to restrict me.”</p><br/><p>Tang San snapped:</p><br/><p>“Who restricted you. If you want to come, then come. If you want to go, then go. Just use your name, that’s all. At least, this way I could meet with you properly. I wouldn’t have you as an adviser for a lifetime either. Once I’ve graduated you can do as you wish, who would care?”</p><br/><p>Dugu Bo looked distracted a moment, lowering his head to look at Tang San. Tang San was also looking at him, and in his eyes was a kind of expression Dugu Bo had never seen on him before, a mix of thirty percent hopefulness and seventy percent pleading.</p><br/><p>“Just use my name?”</p><br/><p>Dugu Bo said in a questioning tone.</p><br/><p>Tang San hurriedly nodded,</p><br/><p>“Of course. Do you think anyone would still care what a Title Douluo like you does? Of course, if you felt like giving us some pointers, I also wouldn’t object.”</p><br/><p>Dugu Bo snorted unhappily,</p><br/><p>“A little freak like you still wants my directions? Maybe if you couldn’t give me directions.”</p><br/><p>Tang San was exultant,</p><br/><p>“Then, you agree?”</p><br/><p>Dugu Bo showed a smiling expression,</p><br/><p>“As long as your teachers don’t drive me away. Let’s go.”</p><br/><p>“Go? Go where?”</p><br/><p>Tang San puzzled asked.</p><br/><p>Dugu Bo said:</p><br/><p>“This old man never procrastinates. Since I’ve promised to be some advisor, I might as well bring you back, then bring my granddaughter to have you treat her.”</p><br/><p>Since he could continue being with Dugu Bo, Tang San also felt his mood ease, laughing he said:</p><br/><p>“Don’t be anxious, have you forgotten the second thing you promised me? I still want to bring some of the plants here. Categorizing and listing them will still take time. It’s been half a year, why care about a few days? Give me three days. In three days, we’ll return to the Academy.”</p><br/><p>After three days.</p><br/><p>“You little freak, you scoundrel, I’ll beat you up!”</p><br/><p>Dugu Bo, stomping with fury, raised his hand to swat at Tang San. Tang San hastily retreated with Ghost Shadow Perplexing Track, turning around to run,</p><br/><p>“Old freak, didn’t you say I could bring what I wished, you never said anything about any amounts. Besides I still left seeds and such, in a few years they’ll still grow back. But, old freak, your Wishful Hundred Treasure Purse really is excellent, very capable.”</p><br/><p>It was no wonder Dugu Bo would be so furious. These past three days he had cultivated in his cavern, and when it was time he had come to the Ice and Fire Yin Yang Well to bring Tang San away. Only, as he once again came to the side of the Ice and Fire Yin Yang Well and saw his treasured ground had been looted to a miserable state, how couldn’t he be furious.</p><br/><p>As far as the eye could see, the originally verdant garden had already become a complete mess, as if it had been plowed, the soil was turned over everywhere, without the slightest hint of green.</p><br/><p>Seeing such a scene, how couldn’t Dugu Bo be angry.</p><br/><p>Tang San discontentedly said:</p><br/><p>“Old freak, didn’t you promise to let me take what I wanted, you didn’t say anything about how much. I just chose to take it all. Don’t worry. See, I didn’t move the Ice and Fire Yin Yang Well, with its moisture, this place will be flourishing again in less than a few decades.”</p><br/><p>He didn’t mention that those immortal treasures he had dug up, even if it was next to the Ice and Fire Yin Yang Well, would need several centuries to be able to grow back once again.</p><br/><p>“You…… This little freak will really have me dead from anger.”</p><br/><p>Dugu Bo was speechless with fury. He had indeed promised it himself, and those drug ingredients indeed didn’t have any great effect on him, however, those things had been with him for decades, how couldn’t he love them?</p><br/><p>Tang San probing asked:</p><br/><p>“Let’s leave.”</p><br/><p>Dugu Bo resolutely glared at him,</p><br/><p>“Let’s leave.”</p><br/><p>Finished speaking, he no longer paid attention to Tang San, and soared up towards the mountain top.</p><br/><p>Tang San hastily released Eight Spider Lances, bringing him to swiftly chase after Dugu Bo.</p><br/><p>Although there were a lot of powerful spirit beasts in the Sunset Forest, Dugu Bo had been here for many years, and all the spirit beasts had become familiar with his smell. None of them would dare approach this old freak, and as Tang San followed Dugu Bo out of the forest, he also didn’t encounter any spirit beast attack.</p><br/><p>In order to avoid drawing attention, after leaving Sunset Forest Tang San withdrew his Eight Spider Lances, only relying on Ghost Perplexing Shadow Track to follow behind Dugu Bo. He knew he had been a bit excessive, but those first rate medicinal ingredients couldn’t be found just anywhere, and would have maximum effect in the future. Even more when he had a top quality spirit tool like the Wishful Hundred Treasure Purse that could keep them fresh, without being able to restrain himself he had cleaned the place out.</p><br/><p>On the whole journey Tang San didn’t dare provoke Dugu Bo further. Dugu Bo also didn’t acknowledge him, and the two returned to Heaven Dou City in a silent mood.</p><br/><p>Because the majority of the toxin in his body had fused into the spirit bone, Dugu Bo’s present form wasn’t as conspicuous as before, and he also didn’t rouse the attention of pedestrians. After entering Heaven Dou City the old freak stopped, glancing behind him at the panting Tang San,</p><br/><p>“Little freak, lead the way.”</p><br/><p>Tang San caught up to Dugu Bo’s side, in a low voice saying with a smile:</p><br/><p>“Old freak, you’re not angry?”</p><br/><p>Dugu Bo glared at him,</p><br/><p>“Since I promised, I won’t argue. But mark my words, only this once, never again.”</p><br/><p>Tang San hastily nodded agreement, inwardly smiling, even if there was a next time it would still be in at least a few decades. The old freak was clearly giving himself a way out.</p><br/><p>Seeing that Dugu Bo’s anger had faded a bit, Tang San hastily led the way forward, the two heading towards the former Blue Tyrant Academy, the present Shrek Academy.</p><br/><p>While walking, Tang San couldn’t help say to Dugu Bo:</p><br/><p>“Old freak, you coming to our Academy is actually quite fitting. Our Shrek Academy is also known as the Monster Academy, old freaks teaching little monsters, doesn’t that fit beautifully?”</p><br/><p>“Beautiful your head.”</p><br/><p>Dugu Bo raised his hand to knock on Tang San’s head. He was tall, a full two heads taller than the presently one meter seventy or so Tang San.</p><br/><p>Tang San groaned,</p><br/><p>“If you hit my clever head silly, who will treat your granddaughter?”</p><br/><p>Dugu Bo seemed to think of something, and his ice cold expression suddenly softened. Sizing up Tang San, at the corners of his mouth gradually floated a smiling expression.</p><br/><p>From Tang San’s point of view, he would rather see Dugu Bo’s stinky face. Unwillingly looking at his smiling appearance, he couldn’t help shiver all over,</p><br/><p>“Old freak, what are you smiling about?”</p><br/><p>[1] ()</p><br/><p>[2] () “Son Mother Chasing Soul Seizing Life Bladder”. The “son mother” characters are also the ones used in “cluster bomb”.</p><br/><p>[3] ()</p><br/>\n</div>"}