{"title": "Chapter 86", "id": 86, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-86", "volume_title": "Volume 1", "body": "<h1>Chapter 86</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 86</p><br/><p>Thousand Year Unicorn Armored Beast And Ten Thousand Year Demon Spider</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>With their curiosity greatly increased, the trio immediately tried using it within the poison formation, unable to keep from gasping in admiration over the elaborate Flying God Claw. Especially the quality of the material and craftsmanship made them adore it even more.</p><br/><p>Now Flender didn’t need to worry about dealing with the spirit beasts outside, a cunning light flashed in his eyes, with his particular lisping voice saying to Tang San:</p><br/><p>“I say little San, how about we strike a deal?”</p><br/><p>Tang San was astute, his face immediately showing a smiling expression:</p><br/><p>“No problem, besides this Flying God Claw, anything else is fine.”</p><br/><p>“Eh……”</p><br/><p>Flender immediately choked on his next words.</p><br/><p>To the side Liu Erlong looked disdainfully at Flender,</p><br/><p>“And you call yourself a teacher, you actually want the childrens’ things. Little San, how about this, teacher Erlong will trade with you. Later you pick any spirit beast outside and tell me, I’ll catch it for you, and afterward you make me a Flying God Claw.”</p><br/><p>As a result of Liu Erlong’s figure being different from a man’s and being more observant than Flender, she discovered that each Flying God Claw was different, immediately understanding that this thing was made to size.</p><br/><p>Flender didn’t give up, and without waiting for Tang San to speak up he couldn’t keep from saying:</p><br/><p>“What you can catch, don’t tell me I can’t? Little San, I’ll also pre order. I’m also your Teacher’s old brother, so give me this piece.”</p><br/><p>Looking at Flender, then again at Liu Erlong, Tang San laughed inwardly.</p><br/><p>Actually, it was no wonder that Flender and Liu Erlong were so interested in this Flying God Claw. This thing was extremely practical, and what’s more, in a key moment it could be a life saver. The quality was superb, extremely durable, when worn on the arm it didn’t feel cumbersome, no more than a wrist protector. That weight was basically no problem to them.</p><br/><p>Helplessly, Tang San could only say:</p><br/><p>“Fine. However, making this thing takes a lot of time. Once this time’s Advanced Spirit Master Academy Tournament is over I’ll make one for each teacher.”</p><br/><p>Flender laughed out loud,</p><br/><p>“Fine, then teacher will be impolite. Erlong, Wuji, we’ll do it. Little San, just pick any one of these spirit beasts outside. We’ll catch it for you.”</p><br/><p>Grandmaster to the side looked at Flender’s appearance of accomplishing lowly ambitions and helplessly shook his head, but also didn’t say anything.</p><br/><p>Tang San said:</p><br/><p>“Help Rongrong catch one first. I’m in no hurry, I’ll still observe a bit.”</p><br/><p>Flender nodded, saying:</p><br/><p>“That’s also fine. Grandmaster, do you see something relatively good for Rongrong’s fourth spirit ring?”</p><br/><p>Tang San was Grandmaster’s disciple, and Flender could naturally ask him directly for his opinion, but the others still followed Grandmaster’s opinion on the most suitable.</p><br/><p>Grandmaster’s gaze swept across those spirit beasts glaring like tigers outside, and raising his hand he pointed to one among them,</p><br/><p>“Rongrong’s previous three abilities separately increase speed, strength and spirit power. Then, mainly this fourth spirit ability should increase defense. That four thousand year or so Unicorn Armored Beast[1] is comparatively suitable.”</p><br/><p>Everyone turned to look in the direction Grandmaster indicated, seeing a spirit beast shaped like a crocodile. Its bulk wasn’t especially large, five meters long or so, a head with four eyes, four limbs as thick and solid as buckets. Its most outstanding feature was that its whole body was covered in black plate armor. Each armor plate was roughly palm sized, appearing extremely thick and durable.</p><br/><p>Grandmaster lowered his voice:</p><br/><p>“The Unicorn Armored Beast is mainly specialized in close combat, it has enormous strength, and relying on its astonishing defense it can practically ignore most attacks from spirit beasts of similar cultivation age. You three had best work together to secure it.”</p><br/><p>Grandmaster’s words were naturally convincing, and Flender’s trio’s gazes simultaneously locked on that Unicorn Armored Beast. Stepping forward, in the blink the distance had closed to within thirty meters, Flying God Claws simultaneously shooting out, steel claws spreading in the air, in practically an instant that thousand year Unicorn Armored Beast had been accurately grabbed.</p><br/><p>Flender and the others only felt a slight jolt at their wrists as the action completed. The tactile quality of the Flying God Claws was extremely good, just like a real hand spreading open.</p><br/><p>But, as the maker of the Flying God Claws, the pupils of Tang San’s eyes contracted. Because, the three Flying God Claws that landed on the Unicorn Armored Beast unexpectedly couldn’t pierce through its armor. Despite each grabbing an armor plate, they were unable to penetrate the slightest bit. In fact, with the Flying God Claw’s own mechanical strength and sharpness, even metal or rock could be easily pierced. From this could be seen just how abnormal the defense of this thousand year Unicorn Armored Beast was. No wonder it would mix in with ten thousand year spirit beasts, who would have the least bit interest in bones so difficult to gnaw.</p><br/><p>Without waiting for the Unicorn Armored Beast to struggle, Flender’s trio exhaled simultaneously, spirit power condensing in a flash and releasing.</p><br/><p>Even though that Unicorn Armored Beast was astonishingly strong, controlling the Flying God Claws on its body were three Spirit Sage level powers with more than seventieth ranked spirit power. How could their instantly erupting power be resisted by a thousand year spirit beast?</p><br/><p>The five meter long body was thrown directly into the air, flipping in their direction.</p><br/><p>Grandmaster’s voice echoed at this opportune moment,</p><br/><p>“Its weakness is inside its mouth. Only from there can the inside of its body be injured. The armor plates on other parts of its body are half as thick as its body. Its defense is even more abnormal than some ten thousand year spirit beasts. Fortunately it doesn’t have any particular attack abilities.”</p><br/><p>Grandmaster’s reminder was clearly just right, watching the Unicorn Armored Beast tumbling from the sky, Liu Erlong leapt up fiercely. As the slaughtering corner of the Golden Iron Triangle, what she liked the most was this kind of opponent that could take a beating. Only this was sufficient to let her blood reeking side come out.</p><br/><p>Zhao Wuji and Flender simultaneously withdrew their Flying God Claws, Flender shouting loudly:</p><br/><p>“Erlong, there are so many children here, don’t make it too gory.”</p><br/><p>“Got it.”</p><br/><p>Liu Erlong agreed. She had already grabbed the thousand year Unicorn Armored Beast’s tail with one hand, and using strength she unexpectedly whirled the entire five meter long, weighing more than a thousand jin[2] Unicorn Armored Beast into the air.</p><br/><p>Hong——</p><br/><p>Everyone’s eyelids unconsciously twitched simultaneously, and the spirit beasts outside the poison formation also seemed to be still for a moment as the ground shook. That Unicorn Armored Beast with its astonishing defense had actually been completely slammed into the ground by Liu Erlong’s brute strength, only a section if its tail stuck up above the surface, held in Liu Erlong’s hand.</p><br/><p>The Shrek Seven Devils finally saw a smiling expression on Liu Erlong’s face, and by their reckoning, this should be the smile of a demon.</p><br/><p>Even though the Unicorn Armored Beast had high defense, with its enormous body being thrown so heavily, even if it wasn’t injured it would still be confused. Further adding that it had already breathed in the poison Dugu Bo arranged in the poison formation as soon as it entered, its bodily functions were quickly dropping. Right now in Liu Erlong’s hands it was as defenseless as a common animal.</p><br/><p>Liu Erlong basically didn’t give it time to prepare to struggle, blazing red light blossoming from her entire body, with a smile on her face saying to everyone:</p><br/><p>“I’ll bring this little fellow aside to play for a moment, you do the rest. Rongrong, cover your eyes and follow teacher.”</p><br/><p>Ning Rongrong looked stupidly at Liu Erlong, her feet not shifting a single step, her face clearly displaying a dismayed expression.</p><br/><p>Liu Erlong’s expression chilled,</p><br/><p>“What? You don’t believe your teacher has the capability to subdue this Unicorn Armored Beast? That’s fine too, no need to cover your eyes. Teacher will give you a class.”</p><br/><p>“I, I……”</p><br/><p>When Ning Rongrong was panicked and at her wits’ end, her eyes suddenly blackened as a strip of cloth stretched out from behind her, blinding her eyes. Just when she was even more panicked, Oscar’s soft magnetic voice rose next to her ear.</p><br/><p>“Rongrong, don’t be afraid. Teacher Erlong has good intentions. I’ll go with you. With me here, nothing will happen. Teacher Erlong, can I go along?”</p><br/><p>Liu Erlong glanced at Oscar, nodded and said:</p><br/><p>“Then come together. However, you’re a man, no need to cover your eyes. Increasing your experience a bit is also good.”</p><br/><p>While speaking, she once again whirled up the by now regained consciousness Unicorn Armored Beast in her hand as it began to struggle, relying on brute force throwing the Unicorn Armored Beast further into the poison formation, into a piece of forest to the side.</p><br/><p>Oscar pulled Ning Rongrong’s hand and followed. Right now Ning Rongrong unconsciously took full advantage of Oscar’s grip on her hand, clutching his hand like a life saving rice straw.</p><br/><p>Flender helplessly shook his head,</p><br/><p>“Oscar this kid is unexpectedly so brave. Really, that Erlong. After so many years her old defects have gotten even more intense.”</p><br/><p>As he spoke, his gaze floated over to Grandmaster with a rebuking light.</p><br/><p>Grandmaster didn’t meet Flender’s gaze, but lowered his head, what he thought of unknown.</p><br/><p>“Little San, have you thought of what spirit beast you want? Me and your teacher Zhao will settle it for you.”</p><br/><p>Flender loudly asked Tang San.</p><br/><p>Tang San’s eyes revealed a hesitant light. To be precise, among the spirit beasts outside there were a quite a few that suited him, but he chose a different spirit beast. The roads of cultivation actually had a great number of differences. Even though the fourth spirit ring wasn’t as important as the third, it had a bridging effect; once chosen, he would be unable to change his future development direction. Therefore he hesitated, not knowing just what to choose for himself.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>At this moment Grandmaster spoke up,</p><br/><p>“Pick that Man Faced Demon Spider. It’s roughly close to six thousand years cultivation, compared to those other spirit beasts outside, absorbing its spirit ring shouldn’t be a problem. It’s the same kind as the spirit beast you hunted last time, so as long as you absorb its energy you could not only empower your third spirit ring, but at the same time you might also have a fourth spirit ability for self defense. Your external spirit bone would also improve because of absorbing a spirit beast with the same attributes. It should be your best choice at present, with enormous benefits for your strength.”</p><br/><p>While saying this, Grandmaster looked at Tang San with a somewhat puzzled gaze. He had already taught Tang San enough that what he could see, Tang San clearly should also be able to see. Since it was like this, why would he still hesitate? Man Faced Demon Spiders were extremely rare. Because of their tyranny, they would frequently be jointly attacked by other spirit beasts. Able to reach six thousand years of cultivation was already extraordinarily powerful. For Tang San it was bound to have superb effect.</p><br/><p>But against Grandmaster’s expectations, the always unusually obedient Tang San now shook his head,</p><br/><p>“I’m sorry, Teacher, can you let me choose this fourth spirit ring for myself? Dean Flender, teacher Zhao, I choose that Pit Demon Spider[3].”</p><br/><p>“What did you say?”</p><br/><p>Without waiting for Flender and Zhao Wuji to react, Grandmaster already spoke up with alarm and anger, reaching Tang San’s side with big steps, one hand grabbing his shoulder,</p><br/><p>“Are you insane? Don’t you see that’s a ten thousand year spirit beast? Moreover, I’m certain that even though it’s a ten thousand year level, the advantages to you are in no way greater than the Man Faced Demon Spider. Don’t forget, you have a unique External Spirit Bone. Strengthening it is even more important that strengthening your Blue Silver Grass.”</p><br/><p>Hearing Tang San’s choice, how couldn’t Grandmaster be anxious? He clearly understood that even though this disciple of his had twin spirits, without settling the issue of his body collapsing from later excessive attributes of the second spirit, right now he was still only a Blue Silver Grass Spirit Master.</p><br/><p>Along with spirit power increasing and spirit rings adding up, this standard of waste spirits Blue Silver Grass would reveal more and more weaknesses. Both Dai Mubai’s White Tiger Spirit and Ma Hongjun’s Phoenix Spirit were no doubt first rate spirits, and their spirit abilities would also become more and more terrifying because of their foundation. But Tang San wasn’t as fortunate, and even though Blue Silver Grass had a powerful adaptability, it still couldn’t compare to the Fire Phoenix or Evil Eye White Tiger, let alone the number one support spirit Seven Treasure Glazed Tile Pagoda. Among the other six Shrek Seven Devils, any one spirit was stronger than his.</p><br/><p>If Tang San didn’t possess plentiful knowledge, a cool head, as well as obtaining the Man Faced Demon Spider’s external spirit bone at the thirtieth rank, then right now his strength would already be far away from the others’. Of course, Grandmaster never believed Tang San’s hidden weapons and the poisons he studied with the Poison Douluo could have any effect. In his world, as a Spirit Master, one's own strength was most important.</p><br/><p>Right now Grandmaster was so agitated precisely because of these reasons. The most important growth from choosing a second Man Faced Demon Spider for his spirit ring was for his Eight Spider Lances. Even though Grandmaster couldn’t be sure what level the Eight Spider Lances would grow to, the Eight Spider Lances’ was bound to increase, and would also bring up Tang San’s strength. With the evolution capability of this external spirit bone, Tang San’s strength wouldn’t be too far behind the others.</p><br/><p>But right now even though he couldn’t say Tang San’s own first choice of the Pit Demon Spider was no good, to his future development it clearly wasn’t as good as the Man Faced Demon Spider.</p><br/><p>The Pit Demon Spider and the Man Faced Demon Spider were both considered top tier existences among arachnid spirit beasts, they only walked different routes. The Man Faced Demon Spider was widely known for its tyrannical attack power and extreme toxicity, while the Pit Demon Spider hunted its enemy in a different fashion. Even though it wasn’t as famous as the Man Faced Demon Spider, it also wasn’t as addicted to killing, but the Man Face Demon Spider also couldn’t compare to it in hidden danger.</p><br/><p>The Man Faced Demon Spider specialized in terror, speed, and potent attack power, but the Pit Demon Spider was best at taking advantage of the terrain to create all sorts of traps for the opponent, relying on its special ability to ensnare its prey. Its spider thread was completely different from the Man Faced Demon Spider. It wasn’t poisonous, but could take any kind of shape. Unlike the single use of the Man Faced Demon Spider, it was used to bury the opponent alive.</p><br/><p>In strength, the Pit Demon Spider certainly wasn’t a match for the Man Faced Demon Spider in a frontal attack, but if it was given familiar terrain or perhaps allowed to pull open the distance, then the Man Faced Demon Spider would certainly die.</p><br/><p>Outside the poison formation there were just one of each. That Man Faced Demon Spider was alone outside the throng of spirit beasts, ice cold light flickering in its little eyes, attentively watching their side. The Pit Demon Spider clearly had a much better affinity with animals than it, mixed in together with the other spirit beasts, its build one size smaller than the Man Faced Demon Spider, but as long as one observed carefully one could discover that this Pit Demon Spider should have just entered the ten thousand year level. Its body and eight spider legs were slim, but clearly without the Man Faced Demon Spider’s kind of slender vigor, its ash gray body not the slightest bit eye catching among the seemingly very powerful spirit beasts. But in the vicinity of its body were some yellow filaments, that was its spider web.</p><br/><p>The way Grandmaster saw it, the reason Tang San chose the Pit Demon Spider was no doubt because it wasn’t as ruthless as the Man Faced Demon Spider, and its spirit ring would be easier to absorb. Moreover this Pit Demon Spider possessed ten thousand years of cultivation. But such a choice was clearly unwise, far from as good as the result that six thousand years Man Faced Demon Spider could give his external spirit bone.</p><br/><p>But, what Grandmaster didn’t expect was that as Tang San looked at him his eyes were extremely resolute,</p><br/><p>“Teacher, please let me choose the Pit Demon Spider. I believe, right now it should be even more useful to me.”</p><br/><p>“Why? Justify it to me.”</p><br/><p>The pride at the bottom of Grandmaster’s heart was far from comparable to Flender, but right now looking at his always clever disciple unexpectedly disobeying him, his voice clearly grew colder. But he also wasn’t an autocratic senior, therefore he wanted Tang San to tell him a reason.</p><br/><p>Tang San only spoke very simply, at once making clear his reasons for choosing the Pit Demon Spider,</p><br/><p>“Teacher, I choose it because the Advanced Spirit Master Academy Tournament is about to begin.”</p><br/><p>Grandmaster first looked distracted, then immediately reacted, the ice chill at the corners of his eyes melting, looking at the disciple in front of him, he couldn’t keep a regretful light from showing in his eyes, his grip on Tang San’s shoulder unconsciously tightening,</p><br/><p>“But, haven’t you thought of yourself?”</p><br/><p>How couldn’t Tang San know the benefits of the Man Faced Demon Spider spirit ring would be even greater, but, while choosing the Man Faced Demon Spider spirit ring would strengthen his own Eight Spider Lances and Spider Web Restraint, his fourth spirit ability would very possibly only be a support effect for his third spirit ability.</p><br/><p>Without doubt, Spider Web Restraint was extremely powerful in restraint and complemented Tang San’s hidden weapons techniques well, but, it consumed too much spirit power. Even after Tang San’s spirit power rose to the fortieth rank, with full spirit power he could only use it four times. If the fourth spirit ring strengthened the third, then perhaps the restraining capability would grow even stronger, but at the same time the spirit power consumption would be enormous. It would very possible become a one use attack.</p><br/><p>This was of course no problem when facing an opponent one versus one, but Tang San didn’t forget that he was part of the Shrek Seven Devils, and even more the only control system Spirit Master among them. As the soul of the team, with the Advanced Spirit Master Academy Tournament about to begin, he couldn’t think only of himself, but had to consider the entire team as a whole.</p><br/><p>Even though the Pit Demon Spider was unable to strengthen Tang San’s external spirit bone like the Man Faced Demon Spider, Tang San was certain that the Pit Demon Spider spirit ring definitely would improve his control capability. Moreover it could very possibly be a group control type ability. This would possess enormous benefits to a team like the Shrek Seven Devils, in a team fight there was no need to doubt the advantages of crowd control capability.</p><br/><p>In order to balance the gap in assistance to himself between the Pit Demon Spider and Man Faced Demon Spider, as well as as far as possible not let himself fall behind the others, after careful consideration that ten thousand year Pit Demon Spider was clearly his best choice.</p><br/><p>Grandmaster understood all this, and secretly sighed with regret. Even though Tang San’s choice wasn’t the best for himself, it was no doubt the most proper one. His view of the big picture already surpassed his own. Having such a selfless disciple made him feel happy on one hand, but at the same time also somewhat regretful.</p><br/><p>“Teacher, perhaps, this Pit Demon Spider will also give me a spirit bone?”</p><br/><p>Tang San consoled Grandmaster in his own way.</p><br/><p>Grandmaster snorted, saying:</p><br/><p>“Little San, even though your body is already more resilient than Mubai and also have the energy from the level surpassing spirit ring, don’t forget that this time you’re skipping a whole five thousand years of cultivation. Do you believe that you could successfully absorb a ten thousand year spirit beast? For the sake of the team it’s even more important not to endanger yourself, do you understand? Therefore I will persist in my opinion, the man Faced Demon Spider is still the best choice for you.”</p><br/><p>Tang San tightened his fists,</p><br/><p>“Grandmaster, believe in me, I can definitely do it. I once took two immortal treasure herbs at Dugu Bo’s place, these two herbs had a muscle developing and essence exchanging effect on my body, recreating it from the bone, my physique is even more resilient than you imagine. Moreover, right here I still have another advantage. Taking those two immortal treasure herbs lets me absorb the spirit ring in a special place. Thus, I have practically a ninety percent certainty in succeeding.”</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>“Out of the question, unless it’s a hundred percent, I won’t let you take the chance!”</p><br/><p>This time the speaker wasn’t Grandmaster, but rather Xiao Wu quietly listening to their side.</p><br/><p>Even Tang San couldn’t help being startled by Xiao Wu’s sudden agitation,</p><br/><p>“Xiao Wu, don’t be like that, listen, nothing will happen to me.”</p><br/><p>Xiao Wu looked at Tang San, her eyes brimming with obstinacy,</p><br/><p>“Absolutely out of the question. Even if it was a nine thousand year spirit beast I would believe you could try it, but a spirit beast that has broken through ten thousand years is an entirely different concept than a thousand year spirit beast. There’s a qualitative change from hundred year to thousand year, and from thousand year to ten thousand year is an equally qualitative change. Do you think a ten thousand year spirit beast’s spirit ring is so easy to absorb? First let alone the tremendous energy strike, it’ll be difficult for you to withstand just the soul shock that remains after its death when you absorb it.”</p><br/><p>“Soul shock? What’s that?”</p><br/><p>Not only Tang San, even Grandmaster was startled by Xiao Wu’s words. He had never heard of a concept like soul shock.</p><br/><p>Xiao Wu calmly explained:</p><br/><p>“Soul shock is a special capability that arises after a high level spirit beast is dead, but before its soul has dissipated. Only ten thousand year spirit beasts or above can possess it. Generally speaking, to absorb a ten thousand year spirit beast’s spirit ring requires at least fiftieth rank or above spirit power. By that time the Spirit Master already possesses a certain degree of functionality in all aspects, and mental strength has also matured to a certain extent. But in spite of this you would have to be especially careful when absorbing a ten thousand year spirit ring. Besides the energy contained in the spirit ring, there’s also the danger of this soul shock. To an adult, and moreover a fiftieth ranked Spirit Master, when both the body and mind has matured, the effect of such a soul shock would decrease substantially. Generally, Spirit Masters wouldn’t suffer any harm. But little San, right now you’re just fourteen, your body has still far from matured, and your spirit power is only fortieth rank. How can you take the risk? Even if your body can endure the energy attack, if your mindscape is destroyed by the soul shock, you’ll become an idiot. Understand?”</p><br/><p>Listening to Xiao Wu, Grandmaster couldn’t keep from drawing a cool breath,</p><br/><p>“Xiao Wu, how do you know this?”</p><br/><p>Xiao Wu looked distracted a moment, lowering her head:</p><br/><p>“My mom told me.”</p><br/><p>“Soul shock, soul shock……”</p><br/><p>There was a pondering light in Tang San’s eyes.</p><br/><p>Xiao Wu believed she had already moved him,</p><br/><p>“Ge, you said you would always protect me. That’s why you can’t let anything happen to you. I beg of you, listen to Grandmaster, that six thousand year Man Faced Demon Spider is still good, why take the risk on a ten thousand year spirit ring?”</p><br/><p>Tang San naturally wouldn’t explain to Xiao Wu just what made him choose the Pit Demon Spider, but his decision hadn’t weakened because of Xiao Wu’s words.</p><br/><p>“If I can avert the soul shock, does that mean I can make the attempt? Originally I only had a ninety percent certainty, but after listening to you, I have a hundred percent certainty instead.”</p><br/><p>Tang San rubbed Xiao Wu’s head, his face relaxed.</p><br/><p>Xiao Wu doubtfully looked at him,</p><br/><p>“I don’t believe you. Ge, you’re not fooling me.”</p><br/><p>Tang San asked:</p><br/><p>“Did I ever cheat you?”</p><br/><p>Xiao Wu subconsciously shook her head.</p><br/><p>Tang San said:</p><br/><p>“Xiao Wu. You forget I ate the immortal treasure herb ‘Full Moon Wearing Autumn Dew’. With your warning, relying on Purple Demon Eye I have absolute certainty in making that ten thousand year spirit beast unable to cause me soul shock. I can even substantially reduce its resentment. Trust me, I won’t play with my life. You’re right, I still need this life to protect you in the future.”</p><br/><p>Looking at Tang San, Xiao Wu suddenly smiled. Her smile was exceptionally beautiful, especially in Tang San’s eyes it was even more perfect.</p><br/><p>Pulling the scorpion braid in front, Xiao Wu took a step forward, her whole body practically pasted to Tang San, gentle red lips gathering at Tang San’s ear, quietly saying:</p><br/><p>“Fine, then you go. Only, Ge, you have to remember: if you die, then I’ll accompany you.”</p><br/><p>Even though her voice was very quiet, the force of the shock the sound made in Tang San’s ear was comparable to Liu Erlong’s explosive scene a few nights ago. Especially her last words were especially brimming with certainty. Clearly she wasn’t joking.</p><br/><p>Honestly, right now Tang San’s heart began to hesitate. Just like he said before, he only had a ninety percent certainty in absorbing the Pit Demon Spider’s spirit ring. Even if he could avert the soul shock with Xiao Wu’s warning, he still only had a ninety percent certainty. The higher level absorption, if any uncertain element could appear and he couldn’t retreat, how could it go well for Tang San?</p><br/><p>Tang San of course wasn’t willing to die, and he was even more unwilling to play with his and Xiao Wu’s lives. But at this moment he didn’t have a better choice. Truly choosing that Man Faced Demon Spider? No. In an eyeblink he thought clearly again. He wouldn’t go back on decisions he had already made. When doing something, while adequate preparation was important, equally important was confidence in success. What Xiao Wu said was equal to pushing him over the edge. Just like last time when he took the chance on absorbing the Man Faced Demon Spider spirit ring. For Xiao Wu he could definitely endure, and even more, he still had his preparations.</p><br/><p>Thinking of this, Tang San nodded resolutely to Xiao Wu, then turned to Flender,</p><br/><p>“Dean, teacher Zhao, I’ll trouble you. I want that Pit Demon Spider.”</p><br/><p>Flender sternly said:</p><br/><p>“Little San, have you really thought it through? You should understand the consequences of absorbing something like it.”</p><br/><p>Tang San said without the slightest hesitation:</p><br/><p>“Dean, I’ll definitely succeed. Don’t forget, I have two spirits, and I still have the external spirit bone and immortal treasure herbs. What’s a ten thousand year spirit beast?”</p><br/><p>“Well, ambitious. Then I’ll wish you success.”</p><br/><p>Flender saw the conviction to push forward in Tang San’s eyes. He knew that it would be useless to say anything more; even Grandmaster and Xiao Wu couldn’t persuade him.</p><br/><p>Right now, not far away in the forest, boom after boom echoed constantly. Even though nobody saw it with their own eyes, they could still imagine the lamentable fate of that Unicorn Armored Beast. At the same time it made everyone’s resolution not to provoke Liu Erlong even stauncher.</p><br/><p>People needed to vent, and women especially so. Liu Erlong was unable to be together with the person she loved the most, making her original killing intent grow close to a frenzy. She had been born as a woman, but had never had a childhood. In order to become even stronger, in order to provide justice for her mother, she had worked hard practically without rest as a child. But the final result? Before she could win success and recognition, her mother had already gone far away. Since then, slaughter had been her greatest pleasure, only seeing the blood of her enemies blossoming in her hands, seeing her enemies life trickle down her fingers, would she feel relaxed and delighted.</p><br/><p>Afterwards, the extreme pain from the even more tragic affair between her and Grandmaster made her blood purge a spirit beast forest. The massacred place was since irredeemable. Encountering her hands, even if it was only a small evil, it would still be extinguished without chance of life. Until Flender saw her again one day, and after continuously straightening her out, Liu Erlong restrained herself somewhat. After parting with Flender she established the Blue Tyrant Academy, cultivating her character by herself in the Academy forest to restrain her killing instinct.</p><br/><p>Grandmaster appearing was both a good thing and a bad thing in Liu Erlong’s opinion. What was good was that they could finally meet again, reigniting the flame of hope in Liu Erlong’s heart. But at the same time, the heart she had calmed with great difficulty boiled once again, and after being rejected by Grandmaster several times, the bloodlust in her heart burst forth again, even more seriously than before. If it wasn’t for Flender and Grandmaster being here, as well as these several children, perhaps her bloodlust would have expressed itself even more violently.</p><br/><p>Flender understood this, and naturally Grandmaster also understood. But right now which of them could persuade Liu Erlong?</p><br/><p>The Flying God Claw flashed out like lightning, accurately landing on the Pit Demon Spider.</p><br/><p>Perhaps it was because the Unicorn Armored Beast’s previous experience had been seen by these powerful spirit beasts, and perhaps also because they were too intelligent, but the instant it saw the Flying God Claw about to grab the Pit Demon Spider, that ten thousand year Pit Demon Spier suddenly moved swiftly, a layer of yellow spider web shooting out from below its feet, blocking its front like a shield.</p><br/><p>With two pu pu sounds, the Flying God Claws grabbed the spider web. Flender and Zhao Wuji hurriedly controlled the God Claw to fly back, but making them not know whether to laugh or cry, at the same time as the claws flew back, so did a massive yellow spider web. Using one phrase to describe their current circumstances, it would be ‘walking right into the the trap’.</p><br/><p>The ten thousand year Pit Demon Spider was even more devious than everyone had imagined, not only sending back a spider web with the Flying God Claws, but at the same time that Pit Demon Spider retreated extremely quickly, dodging behind a large spirit beast, and moreover running swiftly towards the forest. It moved quickly, not a bit inferior to the Man Faced Demon Spider.</p><br/><p>[1] () The first character is the female half of Qilin ( ), which isn’t quite a unicorn and has a tendency towards antlers more than horns, but unicorn is more expressive than “Lin Armor Beast”.</p><br/><p>[2] 1000 = 500 kg</p><br/><p>[3] () “Ground Hole Demon Spider”</p><br/>\n</div>"}