{"title": "Chapter 81", "id": 81, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-81", "volume_title": "Volume 1", "body": "<h1>Chapter 81</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 81</p><br/><p>Xiao Wu: Ge, Brush My Hair</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Grandmaster meaningfully and heartfelt said to Tang San:</p><br/><p>“Although you now know your identity as part of the Clear Sky School, I hope you will be able to keep a common heart, don’t lightly go looking for your school, also don’t easily let out your thoughts. You can understand your teacher’s painstaking efforts?”</p><br/><p>Tang San nodded without the slightest hesitation:</p><br/><p>“Teacher, I understand. No matter what I do, I must have strength first, before I believe I have sufficient strength I won’t lightly go looking for the Clear Sky School. I might say, I must at least wait until my father appears, before I might return to the school. Moreover, you should also know that I’ve always liked freedom, the life in a school doesn’t seem to suit me. Actually, I’d rather be a blacksmith’s son, to me, what’s the point of status?”</p><br/><p>Grandmaster looked astonished at Tang San, after all, Tang San in his eyes still only a teenaged child, he hadn’t expected this disciple of his to be able to see so deeply. His rigid face couldn’t help revealing a smiling expression, and he once again patted Tang San’s shoulder,</p><br/><p>“Words like these put my heart at ease. In another half year the Advanced Spirit Master Academy Grand Competition will begin, this isn’t only a stage to reveal you, it’s also the ideal opportunity to gain experience. At this Continental Grand Competition, you will meet all the Spirit Master powers of your generation. Fighting them, vanquishing them, will not only promote your battle experience, at the same time it’s also an opportunity to establish confidence. I’ve already talked it over with Flender. Once this time’s Spirit Master Grand Competition is over, you children will graduate from the Academy.”</p><br/><p>“Graduate? Teacher, isn’t it too early for this?”</p><br/><p>Tang San said, shocked.</p><br/><p>Grandmaster shook his head with a smile,</p><br/><p>“No, it’s not early. At ordinary advanced Spirit Master academies you can already graduate when your strength reaches thirty ranks, moreover be considered a first rate student. But right now you’re not just at the thirtieth rank, even from the point of view of the Shrek Academy, I think that after you’ve participated in this Grand Competition, you should have reached the fortieth rank or so. Little San, the Academy isn’t everything. To your lives, cultivating at the Academy is only one stage, even more important is to temper yourselves in the outside world, that is the battlefield of your true test.”</p><br/><p>Whether it his last life or this one, Tang San didn’t have too many experiences with society, but as he saw the certain gaze in Grandmaster’s eyes, he knew Grandmaster’s judgement wasn’t mistaken.</p><br/><p>Perhaps it was because he had never stayed in the outside world, to the possible unknowns, in his heart was still some amount of fear.</p><br/><p>Of course, right now wasn’t the time to reflect on this. Tang San naturally also didn’t expect that when he truly left for the outside world, it would already be six years later.</p><br/><p>Leaving Grandmaster’s office, that kind of flash of insight feeling made Tang San’s heart indescribably free from worry. He had already again found his purpose in life. What about being descended from a school? What about father being a Title Douluo? All of that was after all not him.</p><br/><p>He only had to first make himself become strong. This was meaningful.</p><br/><p>Tang San already thought very clearly, at his current age, without anything more important than cultivation, all his physical and mental efforts should naturally be focused on this, and not on flights of fancy.</p><br/><p>From this point on, whether it was Tang San or the other Shrek Seven Devils, they all entered half a year of arduous cultivation.</p><br/><p>Grandmaster didn’t conduct any more special training with them, only regularly giving them tactics guidance, especially to their mutual teamwork, as well as how to use their own spirit abilities even more effectively.</p><br/><p>It would appear that everyone had their own spirit abilities, they only had to use them fully.</p><br/><p>But in fact, within this was contained enormous knowledge. Fully using any spirit ability at any time, fully using any spirit ability under any spirit power situation. Each circumstance held profound hidden theory. But Grandmaster had expended several decades on researching just this field. Under his guidance, the Shrek Seven Devils could be said to walk countless steps along a winding road.</p><br/><p>Just like Tang San said when he presented everyone with the immortal treasure herbs, the medicinal effect wouldn’t just show at the time they took them. Along with their unceasing cultivation, apart from Xiao Wu who hadn’t used the ‘Yearning Heartbroken Red’, each person felt their bodies changing.</p><br/><p>Not only did their spirit power growth rate become even faster than before, even more significant was the immortal treasure herbs’ transformation of their spirits and bodies. Tang San chose the herbs very carefully, and practically all were the ones that suited each person best.</p><br/><p>Imperceptibly influencing them under their constant cultivation, the heaven and earth power contained within the herbs gradually fused with their bodies, making their comprehensive strength grow.</p><br/><p>Even the Nine Treasure Purple Zoysia that wasn’t considered a real immortal treasure still assisted Grandmaster, in that brief half year his spirit power went from thirtieth rank to the thirty fifth rank. And everyone in the Shrek Seven Devils, making use of this half year, besides Dai Mubai’s spirit power which only rose one rank and a half, reaching the forty fourth and close to the forty fifth rank, of the remaining six only Xiao Wu didn’t reach the fortieth rank bottleneck.</p><br/><p>The first person to break through the fortieth rank bottleneck was someone everyone felt was unexpected, against everyone’s expectations it wasn’t Zhu Zhuqing who had already reached the thirty eighth rank when taking the immortal treasure herb, or the most assiduously cultivating, intrinsically differently talented Tang San.</p><br/><p>Taking everyone aback, the first of the six to break through the fortieth rank was the least adept at cultivating food system Spirit Master Oscar. When he had cultivated for four and a half months he successfully broke through the bottleneck, just stepping on the threshold to the fortieth rank, only requiring a spirit ring to formally go from Spirit Elder to Spirit Ancestor.</p><br/><p>Others might not know about Oscar’s hard work, but Tang San understood clearly. Even though Tang San didn’t know what had happened, since the time Ning Rongrong returned from her clan, Oscar’s cultivation was a lot more diligent than before.</p><br/><p>Previously Oscar was most addicted to sleeping, but in these few months Tang San hadn’t seen him sleeping once, even so that he rarely returned to the dorm, every day painstakingly cultivating his spirit in the dining hall that suited his cultivation best.</p><br/><p>His strength being able to promote this quickly was admittedly related to the Eight Petal Immortal Orchid, but his great efforts and invested energy also finally had a conclusive effect.</p><br/><p>After five months of cultivation, Zhu Zhuqing also broke through the fortieth rank, and after two days Tang San broke through. In another ten days, Ma Hongjun and Ning Rongrong also successively broke through the bottleneck.</p><br/><p>So far, besides Xiao Wu who hadn’t taken the immortal treasure herb, the strength of the other six Shrek Seven Devils had all reached the fortieth rank stage.</p><br/><p>In Grandmaster’s amassed theory, breaking through the bottleneck didn’t necessarily require first going to get a spirit ring. Continued cultivation would still accumulate spirit power that would be released when a spirit ring was obtained.</p><br/><p>As a result of everyone’s spirit power being close, Grandmaster decided that after everyone had reached the fortieth rank they would again go hunt spirit beasts.</p><br/><p>Of course, they couldn’t wait for Xiao Wu, and as everyone reached the fortieth rank, because she hadn’t taken the immortal treasure herb, she was still at the thirty seventh rank and attacking the thirty eighth. To reach the fortieth rank would still require at least another half year.</p><br/><p>Tang San had on a few occasions advised Xiao Wu to take the Yearning Heartbroken Red, but Xiao Wu still wasn’t willing, and would keep the Yearning Heartbroken Red at her side every day, regarding it as indescribably precious.</p><br/><p>But that Yearning Heartbroken Red was also very strange. Without any nutrients or moisture, following at Xiao Wu’s side it could unexpectedly absorb the strength of heaven and earth on its own, not only without any signs of wilting, but on the contrary becoming even more brightly colored and alluring, reflecting dazzlingly on Xiao Wu.</p><br/><p>That seemingly delicate sprig and petals was even more durable than any metal.</p><br/><p>Making people click their tongues in wonder.</p><br/><p>In this half year Tang San also completed his agreement with the Seven Treasure Glazed Tile School. The Seven Treasure Glazed Tile School’s financial resources were indeed formidable, in barely half a year they had manufactured the required components, and following Tang San’s assembly had completely outfitted the directly related disciples of the school, and furthermore kept some remaining ones stored in reserve.</p><br/><p>It was also because he had to spend time on making these things that Tang San’s cultivation was slower than Oscar and Zhu Zhuqing, making him the third person to break through the fortieth rank.</p><br/><p>In this period of time, there was still one small interlude. After Ning Fengzhi brought back the blueprints he ordered his subordinate craftsmen to manufacture and research them, even using the finished goods to compare. But no matter how they tried, they were still unable to make even one hidden weapon. Even if those finished hidden weapons were dismantled to their components, the Seven Treasure Glazed Tile School craftsmen still couldn’t think of a way to fit them together.</p><br/><p>Helplessly, in the end they could only leave the final assembly to Tang San.</p><br/><p>Even though this still couldn’t be considered a loss to the Seven Treasure Glazed Tile School, it was still somewhat embarrassing for Ning Fengzhi.</p><br/><p>How could he know that Tang San used manufacturing skills that had been developed by the Tang Sect over centuries, how couldn’t the Tang Sect fear that others would counterfeit the sect’s hidden weapons? Everything they manufactured would contain some special skill that only Tang Sects disciples knew, just like a passcode existing for each hidden weapon. As long as no code was leaked by mistake, it would be impossible to reveal the secrets of the hidden weapon making.</p><br/><p>This was a major reason why Tang San could completely at ease hand over the blueprints to Ning Fengzhi.</p><br/><p>At nightfall, in a rare moment when Tang San wasn’t cultivating, sitting in front of the log cabin, leaning against the cottage and gazing up at the points of starlight in the night sky.</p><br/><p>As a plant system Spirit Master, his mimicry cultivation naturally had to be made among plants, and the secluded wooden cottage that was originally Liu Erlong’s dwelling was considered Tang San’s.</p><br/><p>Tang San quite liked the environment here. Cultivating here was not only quiet, that fresh and clean air and the fragrance released by the plants was even more what he liked the most.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Xiao Wu sat next to Tang San, her feet swinging slightly, both hands resting on the logs they sat on, raising her face, the light of the moon and stars made her even more conspicuously charming.</p><br/><p>In the past half year, the high intensity cultivation and abundant food made all the Shrek Seven Devils just in their period of development change somewhat. Tang San’s height already surpassed Xiao Wu slightly, reaching close to one meter eighty or so. Xiao Wu was also the tallest of the three girls, reaching an astonishing one meter seventy five. But by now Tang San had only just passed his fourteenth birthday, and Xiao Wu was still some ways off.</p><br/><p>Tang San’s shoulders were somewhat wider than before, overall still appearing ordinary, his expression reserved, if the Shrek Seven Devils walked together he would absolutely attract the least attention.</p><br/><p>Dai Mubai frequently teased him, saying the most unremarkable was the most dangerous.</p><br/><p>Xiao Wu’s growth rate had already slowed down, and in the last two months she had no longer grown in height. Her scorpion braid still hung down to her calves, perhaps she had been influenced by Ning Rongrong, but her skin had become even more exquisite, and some places exclusive to girls had begun to develop.</p><br/><p>What attracted the most attention was still her long legs, perfectly round and perfectly straight, without the slightest flaw to be found. Ning Rongrong and Zhu Zhuqing were both equally beautiful, but they also both envied Xiao Wu’s legs. The three girls each had their own characteristics, if saying Xiao Wu previously was slightly inferior to Zhu Zhuqing and Ning Rongrong in appearance, then in this past half year she had become prettier, not only catching up to the other two, but even slightly overtaking them. But because they were together everyday, no one had a very strong impression of this.</p><br/><p>“Xiao Wu, it’s late, go back and rest. We’ll set out tomorrow.”</p><br/><p>Tang San bumped Xiao Wu at his side with his shoulder.</p><br/><p>Xiao Wu nodded softly, picking up that Yearning Heartbroken Red from her thighs, looking at the brilliantly colored petals, she brought it to her mouth to kiss it gently, smelling that faint fragrance only she could perceive:</p><br/><p>“Ge, I still haven’t reached the fortieth rank. Aren’t you very disappointed?”</p><br/><p>Tang San smiled slightly,</p><br/><p>“Why would I? Your cultivation speed is already faster than I imagined. If everyone didn’t eat immortal treasure herbs, perhaps your cultivation speed would even surpass me. Let alone the others. Xiao Wu, cultivation must be done step by step, shortcuts can’t be taken with undue haste. Otherwise would be no good, if by chance you took a misstep out of impetuousness, that would be greatly troubling. You must remember your big brother’s words. You can’t keep it on your mind by any means. By now our overall strength is already very powerful, you don’t need to think of anything, before long you will also be able to step on the goal line of the fortieth rank. I can guarantee that if you agree to eat this Yearning Heartbroken Red, then your spirit power will definitely be even higher than everyone’s, reaching the highest stage among us.”</p><br/><p>Xiao Wu giggled, jumping up, she said:</p><br/><p>“Don’t worry, I won’t drag everyone down. Ge, what spirit beast are you preparing to hunt this time?”</p><br/><p>Tang San said:</p><br/><p>“Who can say. Even though I have a few choices, the concrete circumstances still depend on our luck. When we meet a spirit beast suitable to someone, that someone will kill it. The few of us all have dissimilar spirits, inevitably there will be something suitable.”</p><br/><p>Xiao Wu nodded, saying:</p><br/><p>“I hope everyone will have good luck. Ge, can’t you help me comb my hair? My hair is a bit messy.”</p><br/><p>Tang San looked distracted,</p><br/><p>“Comb your hair?”</p><br/><p>This was the first time Xiao Wu had made such a request to him,</p><br/><p>“But, you’re going back to sleep, won’t your hair be messy anyway?”</p><br/><p>Xiao Wu stuck out her tongue at Tang San,</p><br/><p>“You blockhead, after I return won’t I cultivate straight till early morning?”</p><br/><p>While speaking, Xiao Wu pulled out a comb from her chest and handed it to Tang San.</p><br/><p>It was a wooden comb, seemingly very simple. But the wood was exceptionally good, the grain on the deep purple wood extremely exquisite, fitting well in the hand and tough and durable. A trace of faint wood fragrance rose from it.</p><br/><p>If it wasn’t for Tang San having Purple Demon Eye to clearly see details in the darkness, he would also have thought this comb was black.</p><br/><p>t was also just because he was unable to find any flaw in the wood even with his Purple Demon Eye at the mustard seed stage that he was astonished.</p><br/><p>“The wood of this comb is amazing!”</p><br/><p>Tang San couldn’t help saying.</p><br/><p>Xiao Wu nodded, there seemed to be something in her eyes,</p><br/><p>“My mom gave it to me, it was made by her personally, carved from first rate red sandalwood. Even though it doesn’t have any decorations, this is still the last thing mom left me.”</p><br/><p>Tang San had never heard Xiao Wu mention her family, and now suddenly hearing her speak of her mother, his heart skipped a beat. When he looked at her, in her beautiful eyes he could clearly see something sparkling and translucent.</p><br/><p>Xiao Wu raised her scorpion braid, untying the lowest pink ribbon, her eyes all along attentively watching Tang San, left hand supporting her braid, right hand little by little combing it out, using five fingers to separate the originally braided black hair, gradually spreading like a black waterfall.</p><br/><p>Enveloped in the light from the moon and the stars, watching that braid come undone over Xiao Wu’s shoulder, Tang San’s gaze couldn’t help being somewhat stupid. Right now Xiao Wu was truly beautiful, the moon and the stars seemed to become a backdrop for her, only she was at the center of this painting.</p><br/><p>Xiao Wu looked deeply at Tang San, and along with her braid dispersing slowly turned around. As the last tangles came undone, with a slight shake of her head, that supple black waterfall shook out, unexpectedly completely sheltering her delicate body.</p><br/><p>The long hair like black satin hung all the way to the ground, at least one chi stroking the logs underfoot. Right now Xiao Wu seemed to blend into the darkness, and from Tang San’s perspective he could only see that moving black.</p><br/><p>Perhaps it was because it had been too long since the hair had been combed, but when the long hair separated it took on a wavy shape, swaying slightly as Xiao Wu moved.</p><br/><p>“Xiao Wu, you really are beautiful.”</p><br/><p>Tang San couldn’t keep himself from blurting out.</p><br/><p>Xiao Wu’s back was to Tang San, but in her eyes teardrops were quietly falling, because, she thought of her mother.</p><br/><p>“Ge, comb my hair.”</p><br/><p>Xiao Wu’s voice was very soft, with a slight tremble, also a trace of fear and expectation. She waited quietly.</p><br/><p>Tang San came to himself, and quietly walked forward, as if afraid to startle the black waterfall under the light of the moon and the stars, noiselessly reaching Xiao Wu’s back.</p><br/><p>Left hand gently and carefully lifting Xiao Wu’s long black hair, right hand stroking the red sandalwood comb, bit by bit combing through her hair.</p><br/><p>A faint fragrance came out, a fragrance Tang San felt was very familiar. It wasn’t the smell of perfume, because Tang San knew that Xiao Wu had never needed such things. It was even less possible for it to be the fragrance of the Yearning Heartbroken Red, because only Xiao Wu could perceive it.</p><br/><p>Right now, what kind of picture was this?</p><br/><p>A stunning young woman standing quietly in front of a log cabin, surrounded by that quiet forest, those bashful moon and stars in the sky, that young woman lightly clasping a flower in her hands, behind her a dim-witted youth, just using a deep purple comb to softly comb and gather her long soft hair.</p><br/><p>Tang San was silly, constantly repeating the motions of his hands. Xiao Wu was also silly, a sad past twinkling in her gaze.</p><br/><p>……</p><br/><p>“Mom, this comb is so pretty! How can there be purple wood?”</p><br/><p>A charming voice echoed in the mountain forest.</p><br/><p>“Silly girl, mom used red sandalwood to make this, since you’ve already chosen, mom will give this comb to you. In the future, if you find a man you truly love, then, let him help you use this comb to comb your hair. A woman’s hair can only be combed by one man in all her life. Mom will bless you, and hope that one day, you will find that man you can trust with your hair.”</p><br/><p>……</p><br/><p>Mom, you know? I already found him.”</p><br/><p>Revealing a smile on her tear stained face, along with the man behind her back combing her hair, her gaze turned to the bright moon, that shining bright moonlight seemed to be her mother’s smile.</p><br/><p>Long hair being combed, soft light roaming, this moment, time seemed to stand still. Whether it was Tang San or Xiao Wu, neither wanted to break the tranquility.</p><br/><p>Early morning, Shrek Academy main gate.</p><br/><p>Flender, Liu Erlong, Zhao Wuji, ang Grandmaster stood outside the Academy gate, looking at the seven children assembled before them with spirits trembling with excitement, hearts all brimming with pride.</p><br/><p>Fortieth rank, this was the boundary a Spirit Master had to reach before thirty years old or so, in order to be a Spirit Master of a certain talent.</p><br/><p>But of these children, the oldest was only seventeen. The youngest still wasn’t fourteen. But they had already reached this stage.</p><br/><p>Admittedly there had been some miracles on the way, but what was important was that these little monsters all had such astonishing talent.</p><br/><p>And as the ones who had unearthed them, how could Flender and the others not feel pride?</p><br/><p>Ning Rongrong bumped into Xiao Wu’s back, saying in a low voice:</p><br/><p>“Xiao Wu, how come your braid is combed a little askew?”</p><br/><p>Xiao Wu’s charming face blushed, and her glance unconsciously floated over to Tang San at her side. Tang San’s hearing wasn’t as good as his eyesight, but it still wasn’t bad. Ning Rongrong stood next to him and Xiao Wu, and Tang San naturally heard her words. At the same moment he also awkwardly looked at Xiao Wu, and as the pair’s eyes met in the air, they both couldn’t help hastily moving apart.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>To the side Oscar spotted a clue, lowering his voice, he said shocked:</p><br/><p>“No way, little San, you wouldn’t……”</p><br/><p>Tang San immediately interrupted him,</p><br/><p>“Less nonsense, it’s not what you think.”</p><br/><p>This morning he had with great difficulty persuaded Tai Long not to follow.</p><br/><p>Tai Long’s cultivation speed was clearly inferior to theirs, by now he had just reached the thirty eighth rank, still not the thirty ninth.</p><br/><p>Moreover, Tai Long was after all not part of the Shrek Seven Devils. Even though he always followed his grandfather’s instructions and considered himself Tang San’s bodyguard, Tang San couldn’t think of him like that. Even though he had cultivated in this half year and his time with Tai Long wasn’t long, he had still given Tai Long some of the cultivation techniques Grandmaster had taught him.</p><br/><p>The relationship of the two changed from the previous rivals in love to become ordinary friends.</p><br/><p>Of course, it was already impossible for Tai Long to pay attention to Xiao Wu, let alone the change in Tang San’s status, even without this he understood that he would perhaps never be able to be Tang San’s match.</p><br/><p>Xiao Wu also even more wouldn’t choose him.</p><br/><p>Let alone he, practically every student at the Shrek Academy knew that the only woman in Tang San’s eyes was Xiao Wu, and Xiao Wu also wouldn’t encourage any other man. There were a lot of female students who had tried to approach Tang San, but been blocked by Xiao Wu.</p><br/><p>Even though Tang San knew about this, he never said anything.</p><br/><p>The two of them hadn’t done anything in front of anyone that would establish a relationship as lovers, but the people at the Academy had long ago already regarded them as such. Only the Shrek Seven Devils knew that Tang San and Xiao Wu’s relationship was pure and honest.</p><br/><p>Oscar immediately displayed an understanding appearance,</p><br/><p>“En, it’s not what I think, you needn’t explain. Everyone understands.”</p><br/><p>By now it wasn’t just Oscar, but Dai Mubai, Ma Hongjun, and even Zhu Zhuqing all looked at them with strange gazes.</p><br/><p>Tang San couldn’t help cursing,</p><br/><p>“You understand farting.”</p><br/><p>As these words came out, everyone couldn’t help smiling. And Xiao Wu’s face became adorably apple red.</p><br/><p>“Hai hai, what are you doing?”</p><br/><p>Flender said unhappily. At this the Shrek Seven Devils hastily restrained their smiles, straightening their backs.</p><br/><p>Flender said:</p><br/><p>“We’ll set out immediately, our goal is the Sunset Forest. Even though this time there are four of us along, I must announce an important point. Even though the fourth spirit ring doesn’t have such an effect of connecting the past and future like the third spirit ring, the fourth spirit ring is still equally important. In order to conduct even better actual combat drills before you join the Spirit Master Grand Competition, me and Grandmaster have decided after discussing it, that for this spirit beast hunting process, you will complete it yourselves. Unless it’s an absolute last resort, we won’t easily act. Under normal circumstances, not only won’t we protect you, we would instead have you carry out the protection. This trip for hunting spirit beasts is also considered the first stage of your graduation exam. And the second stage is the next Advanced Spirit Master Grand Competition. Understood?”</p><br/><p>Ma Hongjun was the least afraid of Flender, and couldn’t keep from asking:</p><br/><p>“Teacher, then how will we pass the test?”</p><br/><p>Flender said:</p><br/><p>“Good question. Passing actually isn’t difficult. For the first test you can rely on your collective power to hunt spirit beasts suitable to you, as long as the four of us haven’t acted in the meantime, you will be considered to have passed. And the second stage, as long as you can casually return with the championship, you can also graduate fairly well.”</p><br/><p>“Ah? This is called ‘not difficult’?”</p><br/><p>Oscar couldn’t help crying out.</p><br/><p>Even though they were all rare talents, given the age limit their strength couldn’t after all reach the degree of opposing heaven, and what they had to confront was nonetheless the elite of Spirit Masters under twenty five. Destroying the opposition from start to finish and obtaining the championship was no easy matter.</p><br/><p>Flender’s eyes glinted,</p><br/><p>“What? You have any objections, Oscar?”</p><br/><p>“No, no objections. Dean is wise.”</p><br/><p>Oscar knew Flender’s character. If he raised any dissent, perhaps this graduation would become even more difficult.</p><br/><p>“If you don’t that’s fine. We’re leaving.”</p><br/><p>Flender issued the order to set out, and a group of eleven people set foot on the avenue heading to Sunset Forest.</p><br/><p>Flender’s quartet walked in front, and the Shrek Seven Devils followed behind.</p><br/><p>Flender also wasn’t worried. With Grandmaster, Liu Erlong, and Zhao Wuji all slowly advancing while talking and laughing, such an appearance was more like an excursion.</p><br/><p>Dai Mubai brought up the Shrek Seven Devils behind, saying in a low voice:</p><br/><p>“I’ve already obtained my fourth spirit ring, have you all thought properly on what kind of spirit ring you need this time? Since dean Flender’s party isn’t prepared to help us hunt spirit beasts, we will have to plan it out. According to Grandmaster’s calculations, this time the best result would be to obtain spirit rings between three and five thousand years. Of course, the closer to five thousand years, the greater the strength growth rate. My fourth spirit ring was from a roughly over four thousand year spirit beast. But, the closer to five thousand years, the more difficult it will be to absorb the spirit ring. I don’t think any of you have forgotten little San’s appearance when he absorbed the Man Faced Demon Spider’s spirit ring last time. Even though he endured that time, he also suffered enormous pain, not something a weak heart can accomplish. Therefore, you must quickly think of a good goal for yourselves. Under the premise of maximizing benefit, you must still consider what degree you can absorb.”</p><br/><p>Everyone nodded one after another. Grandmaster’s theories were naturally established, but each Spirit Master’s own circumstances were different, and the limit of what they could support were actually somewhat disparate. Like Oscar and Ning Rongrong, the limit of spirit rings they could support were clearly a bit lower than the others, they were after all auxiliary system Spirit masters, and their physical conditions were different from Battle Spirit Masters. But for Tang San, who had in succession suffered absorbing the potent amplification of the Man Faced Demon Spider’s spirit ring as well as the Octagonal Mysterious Ice Grass and Infernal Precious Apricot’s transformation, the resilience of his body was terrifyingly higher than that of Spirit Masters of comparable rank, the target spirit ring ages to absorb would naturally be a bit higher.</p><br/><p>Tang San said:</p><br/><p>“It would be better like this. Right now we don’t know concretely what spirit beasts we’ll come across. Once we encounter spirit beasts not reaching the age limit, we’ll beat them down until it can’t resist, and afterwards we’ll carefully determine its age. The one it suits the most will absorb it. If it suits no one, we’ll release it. What do you think?”</p><br/><p>Tang San was Grandmaster’s disciple, and further the soul of the Shrek Seven Devils, these words immediately obtained everyone’s approval.</p><br/><p>Dai Mubai said:</p><br/><p>“Good, we’ll do it like that. How to set about it will still follow little San’s directions.”</p><br/><p>Tang San said:</p><br/><p>“Little Ao, before we enter the Sunset Forest, first make a batch of flying mushroom sausages for everyone, so if we encounter danger we can evade more easily. At the same time, everyone don’t forget the Flying God Claws, those can not only help you navigate difficult terrain, they can also be used to escape and seize spirit beasts. But you must be careful when using them, don’t use it easily if the spirit beast is too strong, otherwise you’ll rush to help the spirit beast. When encountering a suitable spirit beast I will give priority to restraining its movements with control abilities, afterwards you attack collectively, just don’t kill it.”</p><br/><p>“Oscar, you’re not only in charge of supplying everyone, at the same time you must also pay attention to replenishing the spirit beast. If by some chance everyone acts severely, putting the spirit beast on the verge of death, don’t be stingy with your big recovery sausages.”</p><br/><p>“Rongrong, your mission is the simplest, in an encounter directly start assisting everyone with the Nine Treasure Glazed Tile Pagoda. Zhuqing is in charge of scouting, while me, Mubai and Xiao Wu will be mainly in charge of attacking. Everyone clear?”</p><br/><p>“Clear.”</p><br/><p>Although Flender’s quartet walked in front, their ears were all along directed at the activity in the back. Now listening to Tang San’s deployment, this Shrek Academy dean’s face couldn’t help revealing a smiling expression, bumping Grandmaster at his side and saying:</p><br/><p>“Little San really isn’t like a child, his mind is meticulous, and he doesn’t panic in new situations. Even learning of his own background didn’t influence his cultivation. I heard he even made a profit from the Seven Treasure Glazed Tile School, Xiao Gang, how about you give him to me? Or how about having him also take on the role of teacher?”</p><br/><p>Grandmaster glanced across at Flender, saying:</p><br/><p>“Isn’t it enough for you to be his dean? No matter what you say, little San will graduate from the Shrek Academy in the future.”</p><br/><p>Flender nodded,</p><br/><p>“That’s so. Frankly, I really hope time would pass a bit faster. Thirty years, eh, no, in maybe twenty years, perhaps this world will belong to these children.”</p><br/><p>Grandmaster’s face showed a rare smile,</p><br/><p>“If we directly skipped twenty years, wouldn’t you and me already be old?”</p><br/><p>Flender snorted,</p><br/><p>“You know it! So don’t waste time.”</p><br/><p>While speaking, he pursed his lips in Liu Erlong’s direction.</p><br/><p>Grandmaster’s expression went rigid, once again resuming his original appearance, looking at Flender with a burst of heat. But these feelings were a matter for two people, and even though he was very close to the two of them, he after all couldn’t make decisions for others, and there was no way to catch Grandmaster.</p><br/><p>He also knew that if he forced things too urgently, there was a chance Grandmaster would go missing again, and that would be even more unbearable for Liu Erlong.</p><br/><p>Heaven Dou City was very close to Sunset Forest. This Sunset Forest could also be said to be the place where Spirit Masters from the majority of the heart of the Heaven Dou City’s surrounding towns hunted spirit beasts.</p><br/><p>Of course, not many people knew about the places like the Ice and Fire Yin Yang Well in the core areas.</p><br/>\n</div>"}