{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 96</p><br/><p>Limit Team Control And Terrifying Hell White Tiger</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>The Elephant Armored School always relied mainly on defensive countering to attack, now seeing the Shrek Academy about to launch an all out attack, Hu Yan Li was happy more than alarmed. As long as he could deplete their spirit power, how could he fear defeat? ‘Twenty seconds, I want to see just how you’ll restrain these brothers of mine for twenty seconds.’</p><br/><p>Tang San very quickly used action to tell Hu Yan Li just how he would do it. At the same time as he launched Binding, apart from Hu Yan Li, sixteen strands of Blue Silver Grass erupted from below the feet of each of the other Elephant Armored six, instantly condensing into a cage, precisely his fourth spirit ability, Blue Silver Prison. And at the same time, his second spirit ability, Parasite, launched, covering each of them in a thick layer of Blue Silver Grass, including Hu Yan Li.</p><br/><p>That it took four seconds to struggle free of one layer didn’t mean it took eight seconds to break out of two layers. The overlayed restraint ability was much stronger than Hu Yan Li had imagined. Apart from his head, right now his whole body was already covered in Blue Silver Grass.</p><br/><p>Ever since the start of the battle, Tang San had used his keen judgement and detailed planning to grasp control of the whole battlefield. Relying on the flying mushroom sausage, he as far as possible crippled the opponents’ greatest advantage, and relying on his own three potent restraint abilities, he now also restrained the opponents below. Twenty seconds, this was already his lowest estimate for restraining the six people.</p><br/><p>Tang San swiftly swallowed a big recovery sausage, his face pale. He had not only used Controlling Crane Catching Dragon to precisely control the movements of his five team mates, but also released three great spirit abilities at the same time, this had consumed more than half his spirit power in practically an instant. Due to the seven opponents’ massive size, Binding especially consumed a lot of spirit power. If they could throw it off another few times, Tang San would inevitably be exhausted.</p><br/><p>Fortunately, Tang San still had Oscar on his back, and under the unending support of his big recovery sausages, the spirit power Tang San consumed could be recovered to some extent.</p><br/><p>Tiger’s roar, cat’s cry, rattling bones, all sorts of sounds filled the air. Five people simultaneously launched their attacks at Hu Yan Li’s exposed head.</p><br/><p>Tang San’s goal was very simple. Hu Yan Li was the most powerful of the opponents, and also the most important link. As long as they could defeat him first, then this fight would become a lot easier. The opponents didn’t have a control system Spirit Master, so as captain, Hu Yan Li wasn’t only the team’s heart, but also their soul. Defeating Hu Yan Li would be an enormous mental blow at the opponents’ morale. Even though Tang San had also determined that Hu Yan Li’s defense was astonishing, even if it was even more powerful, it would still be impossible to endure the combined assault of five Spirit Masters at almost the same level as him for twenty seconds.</p><br/><p>From the moment both sides had released their spirits, Tang San had been searching for a weakness in the opponents. Just like when they dealt with the Blue Lightning Tyrant Dragon clan’s Yu Tian Heng. But these fatties were really too good at keeping formation, and as a last resort, Tang San was forced to create this opportunity to defeat Hu Yan Li.</p><br/><p>In the VIP seats, Hu Yan Zhen’s furious eyes opened wide, and he suddenly stood up. Watching the grandson he was most proud of about to come under the focused attack of five Spirit Masters, immediately made a powerful light fluctuate at the corners of his eyes. His lips buzzed a few times.</p><br/><p>To the side, Ning Fengzhi calmly said:</p><br/><p>“School master Hu Yan doing this seems to be against the competition rules.”</p><br/><p>He didn’t need to know what Hu Yan Zhen was saying to understand that he used a voice compression technique[1] to give instructions to his grandson.</p><br/><p>Hu Yan Zhen snorted, sitting back down in his seats,</p><br/><p>“I don’t know what school master Ning means, what did I do?”</p><br/><p>Ning Fengzhi smiled calmly, without uttering another word. After all, voice compression wouldn’t leave behind any evidence. He also wanted to see just what directions Hu Yan Zhen could give that would let Hu Yan Li break this certain kill situation Tang San had created.</p><br/><p>However, Ning Fengzhi hadn’t expected that the two words Hu Yan Zhen had passed to Hu Yan Li with voice compression could completely transform the situation Tang San had with great difficulty created.</p><br/><p>Hu Yan Li gave off an explosive roar, his fourth spirit ring suddenly flaring. Not only did it speed up the damage to the Blue Silver Grass around him, at the same time his skin changed once again, adding a protective layer of icicles.</p><br/><p>Hong——. The first chop of the skeleton incarnated Jing Ling’s third spirit ability Mad Battle landed on Hu Yan Li’s head. In a flash, both his arms transformed into bone sabers erupted in several dozen strikes. But terrifyingly, his Bad Battle ability only left clouds of sparks flying over the opponent’s head. Unexpectedly it was unable to cause the slightest bit of harm. Jing Ling even saw Hu Yan Li grin at him.</p><br/><p>Following tightly behind Jing Ling was Zhu Zhuqing. Her most powerful single target attack, Hell Decapitation, instantly erupted. Both hands clasped, further adding the momentum of falling from above, relying on her more than fortieth rank spirit power, this one attack by far exceeded what Jing Ling could compare to.</p><br/><p>At a tremendous explosive sound, even with Hu Yan Li’s defense, both his legs still completely sunk into the ground under this one attack. A white mark was left in the center of his forehead, and the outermost layer of icicles ruptured instantly. Hu Yan Li’s body also swayed once.</p><br/><p>In fact, when only passively taking a beating, not suffering any injuries from the full strength attack of the similarly leveled Zhu Zhuqing, was already extremely amazing.</p><br/><p>Huang Yuan and Dai Mubai’s attacks arrived practically simultaneously. Dai Mubai’s White Tiger Light Wave and Huang Yuan’s Furious Wolf Howl Bullet landed almost the same instant. And this moment was also just when Hu Yan Li’s outer layer of defense was broken, when he was at his weakest. When Dai Mubai launched his White Tiger Light Wave, he had already used White Tiger Vajra Transformation, instantly boosting his attack power.</p><br/><p>If it wasn’t for the rules forbidding killing the opponents, Dai Mubai would have used White Tiger Meteor Shower for this attack.</p><br/><p>However, something the Shrek Academy group had never anticipated occurred. Without any warning, Hu Yan Li’s head suddenly wore a helmet. That’s right, definitely a helmet. An earth yellow helmet that seemed conspicuously not dazzling.</p><br/><p>But it was such a helmet covering the whole head that stiffly resisted the combined attacks of both Dai Mubai and Huang Yuan.</p><br/><p>Hong——</p><br/><p>Hu Yan Li’s both feet and calves had sunk into the ground. In fact, this stage was built from meter thick granite. Light scattered in all directions, and with a roar, the Blue Silver Grass twisted around his body disintegrated into thumb long pieces, as he completely threw off all restraints.</p><br/><p>Dai Mubai and Huang Yuan who were closest, could both clearly feel that this big fatty’s strength had increased once again, and moreover increased to an extremely terrifying degree. Not only did his whole body swell another size, but even all four spirit rings around him shone simultaneously.</p><br/><p>Helmet? The rules of the Continental Advanced Spirit Master Academy Elite Tournament clearly stipulated that contestants couldn’t use any implements. The opponent couldn’t fail to know this. Light instantly flashed through his mind, and in the air, Tang San’s eyes immediately contracted. Two words immediately appeared in his mind, and these two words were precisely what Elephant Armored School master Hu Yan Zhen had just spoken to Hu Yan Li with voice compression: Spirit bone.</p><br/><p>Indeed, that helmet on Hu Yan Li’s head, was a spirit bone.</p><br/><p>Spirit bones had six main slots, the head, the four limbs, and torso. This helmet proved Hu Yan Li had one of those six, a cranial spirit bone.</p><br/><p>This sudden appearance of a spirit bone broke Tang San’s stratagem. But being capable of forcing the counterpart to use a spirit bone, undoubtedly made all the Spirit Masters who understood what happened gobsmacked.</p><br/><p>Everyone knew the value of spirit bones, each one sold for astronomical figures, and they only appeared for sale very rarely. If it was revealed one had a spirit bone, it would no doubt become the target for some peoples’ greed. Even though this Hu Yan Li’s strength was pretty good, he still only had forty something ranked spirit power, preserving his spirit bone in front of some senior experts definitely wouldn’t be easy.</p><br/><p>Were it not for fear that continuous attacks to the head would cause irreversible after effects to his grandson, Hu Yan Zhen absolutely wouldn’t have allowed Hu Yan Li to use this spirit bone. Not even if it cost them the match. But in front of the situation Tang San had created, in order to avoid being beaten into an imbecile or suffer serious head trauma, Hu Yan Zhen had no choice but to make the call. This grandson of his could be said to be the future of the whole Elephant Armored School.</p><br/><p>The ordinary spectators might not identify the helmet, and low level Spirit Masters might not guess it, but how could the crowd in the VIP seats fail to see it?</p><br/><p>Platinum bishop Salas looked at Hu Yan Zhen next to him with astonishment, an envious light flashing through his eyes. But Ning Fengzhi by contrast said with a beaming smile:</p><br/><p>“Congratulations, school master Hu Yan. Your grandson possessing a spirit bone at such an age, is truly worthy of celebration. But, school master Hu Yan, be a somewhat mindful. By all means don’t fall for the plots of ambitious people.”</p><br/><p>Hu Yan Zhen’s face was flat as water. Even though Hu Yan Li had dispelled the crisis, he still wasn’t the least bit happy. Having a spirit bone exposed in such a public place with so many people, absolutely wasn’t a good thing. He snorted coldly,</p><br/><p>“School master Ning doesn’t have to worry about my Elephant Armored School’s disciples.”</p><br/><p>Gu Rong at Ning Fengzhi’s side was somewhat unable to endure watching the school master being contradicted twice in succession, and was about to flare up. But Ning Fengzhi pulled him down, raising a finger to the stage,</p><br/><p>“Watch the competition.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>As Hu Yan Li threw of the restraints, his eyes were practically spouting flames. Even though he had used the spirit bone to resist the attacks, he was still dizzy. Two Spirit Masters over fortieth rank as well as two Spirit Masters over thirty fifth rank all striking the same place, were it not for the spirit bone, he would already have keeled over long ago. Now relying on the additional properties from the spirit bone to break free of the Blue Silver Grass, how could he still hold back? His whole skeleton made a burst of cracking noises, as he raised both massive hands to grab directly at the last person to pounce, Xiao Wu.</p><br/><p>Tang San’s group control had now reached ten seconds, and the other six Elephant Armored School members were still unable to break free.</p><br/><p>If at this moment, Hu Yan Li hadn’t chosen to attack Xiao Wu, and rather rely on his defense to withstand another attack, then helping his comrades break free of the restraints, then the outcome of today’s battle might truly have been hard to tell.</p><br/><p>However, his head dizzy from the successive attacks made him unable to keep as calm as usual, and all he could think of right now was to first deal with the enemy.</p><br/><p>Watching the counterpart grab at her, Xiao Wu was calm and unhurried, both legs shooting out simultaneously, separately landing on Hu Yan Li’s arms. In terms of agility, how could this old fellow compare to Xiao Wu? Drawing on the rebound from both legs, Xiao Wu soared into the air, and under the help of Tang San’s Controlling Crane Catching Dragon, she was instantly whisked into the sky.</p><br/><p>Xiao Wu had disappeared, but the other four already had their feet firmly planted on the ground after the attack. By now Hu Yan Li was already in a kind of half berserk condition, and charged at the four without the slightest hesitation. His third spirit ring suddenly brightened, and his obese body actually leapt into the air. His whole body was covered by a layer of dazzling purple light, and he directly locked down the one who hurt him the most, Zhu Zhuqing, pressuring her from the air.</p><br/><p>The instant she was locked in on, Zhu Zhuqing discovered that she was suddenly unable to move, and faced with the massive opponent, her only choice was to block.</p><br/><p>The Elephant Armored School after all didn’t like the Strength Clan choose all their spirit rings in the same attribute. Along with defense, they also had their attack abilities. The Pressure Kill that Hu Yan Li now used was one of those. If locked down by this spirit ability, the opponent’s legs would temporarily lose the ability to move, able only to block head on. This was also the greatest characteristic of this thousand year spirit ring of his, and it was the most suitable ability found after generations of research by the Elephant Armored School.</p><br/><p>With their enormous bodies falling from the sky, and further adding their spirit power, the effect could well be imagined. As long as the opponent was unable to move and had to block, then let alone agility attack system Spirit Masters, even strength type Spirit Masters might not be able to resist. Of course, this ability still had a condition in order to use, namely that the opponent was within ten meters of the user.</p><br/><p>Unfortunately, the no longer clear headed Hu Yan Li had forgotten one thing. Indeed, Zhu Zhuqing was unable to move right now. But don’t forget that her movements weren’t all under her own control.</p><br/><p>Blue Silver Grass acted just in time, as Tang San easily pulled Zhu Zhuqing away from her original position over towards Dai Mubai, and under his control, Jing Ling and Huang Yuan also directly flew over to the other still restrained Elephant Armored School disciples.</p><br/><p>“Hell White Tiger.”</p><br/><p>Tang San’s calm voice reached Zhu Zhuqing and Dai Mubai’s ears, and the two immediately leapt at each other. By now, Tang San had already temporarily withdrawn the Blue Silver Grass from them.</p><br/><p>This was Tang San’s carefully prepared finishing move. The Shrek Seven Devils possessed two most powerful hidden abilities, one was Tang San’s external spirit bone Eight Spider Lances, the other was Dai Mubai and Zhu Zhuqing’s spirit fusion ability. At this moment Tang San needed to control the entire battlefield, and subsequently it was clearly unsuitable for him to use Eight Spider Lances. And the reason why he had replaced Tai Long with Zhu Zhuqing for this fight, was this Hell White Tiger spirit fusion ability.</p><br/><p>If they could rely on just the midair human meteor hammer to win would be best, but if that didn’t work, they still had Dai Mubai and Zhu Zhuqing’s super attack. Tang San believed that even if the Elephant Armored School had even more powerful defense, alone it was still impossible to resist Zhu Zhuqing and Dai Mubai’s combined attack. In fact, after the two of them had reached the fortieth rank, their spirit fusion ability had also subsequently evolved.</p><br/><p>Hong—— A depression was forcefully smashed into the stage, as Hu Yan Li’s enormous body was practically embedded in the ground. With him as the center, cracks immediately spread to practically every corner of the stage. The terrifying might of this Pressure Kill was evident.</p><br/><p>“Xiao Wu.”</p><br/><p>Tang San shouted, and with a flick of his wrist, a pink ray of light flew accurately in front of Xiao Wu. Xiao Wu opened her mouth and bit down on precisely Oscar’s newest fourth spirit ability, stimulating pink sausage.</p><br/><p>With no need for words, relying only on the pull of Blue Silver Grass, Tang San clearly showed Xiao Wu what to do. Her target was the smallest member of the opposing team.</p><br/><p>At this moment, Tang San’s battlefield control capabilities were vividly exhibited. First by saving Zhu Zhuqing from the danger of Hu Yan Li’s Pressure Kill, and at the same time directing two people to use spirit fusion ability, taking Oscar’s stimulating pink sausage and using his hidden weapons techniques to throw it to Xiao Wu, and furthermore delivering her to the weakest opponent. This whole process was accomplished practically simultaneously. Even Tang San himself didn’t notice that right now he had already used Heart Separation Control’s Three Aperture Governing Heart.</p><br/><p>A tiger’s roar erupted from Dai Mubai’s throat, and along with the roar, his body that was already under the effect of White Tiger Vajra Transformation swelled up once again, white fur mixed with black tiger stripes rushing out all over him.</p><br/><p>Zhu Zhuqing was completely covered with a faint black light, moving swiftly, she unexpectedly seemed transparent, as she quietly floated towards Dai Mubai.</p><br/><p>Dai Mubai revealed a faint smile, twin pupils uniting, both arms spreading, welcoming Zhu Zhuqing’s illusory figure. Their two silhouettes quietly fused into one.</p><br/><p>A three meter wide beam of black light instantly soared up from where they met, a terrifying tiger’s roar filling the whole arena. At this moment, not only did the spectators look on with stunned expressions, but at the roar, even the teams competing on the other four platforms stopped moving for a moment, subconsciously turning to look in the direction of the black pillar of light.</p><br/><p>The burst of black light dissipated, and at the same time the figures of Zhu Zhuqing and Dai Mubai vanished along with it. Where they previously stood, now only remained the graceful figure of an enormous white tiger. The white tiger was transparent, white furred with black stripes, and purple double pupiled eyes that coldly watched the dust covered Hu Yan Li crawling out of the floor.</p><br/><p>Last time the Hell White Tiger had been eight meters long and two meters tall. This time, the Hell White Tiger reached an even more terrifying length of ten meters, and three meters high. Even though the Elephant Armored School’s fatties each had astonishing builds, in front of this enormous white tiger they still seemed insignificant.</p><br/><p>Unlike last time it didn’t use the spirit fusion burst ability Hell White Tiger Break immediately after appearing. Instead that enormous white tiger charged directly at Hu Yan Li. From its wide back a pair of enormous wings unfurled, and its massive body suddenly glided through the air.</p><br/><p>Under the terrifying pressure of the winged tiger, even after using the spirit bone, Hu Yan Li still felt it hard to breathe.</p><br/><p>Last time they used this spirit fusion ability, Zhu Zhuqing still hadn’t reached the thirtieth rank. But now, both she and Dai Mubai had already passed the fortieth. The spirit fusion ability grew along with the strength of the users, and to them right now it was no longer as simple as a single attack. That immense white tiger gracefully and leisurely, pounced at Hu Yan Li.</p><br/><p>By now, Jing Ling and Huang Yuan’s attacks simultaneously poured down on the head of an opponent, as the Blue Silver Prison around him instantly withdrew. And on the other side, Xiao Wu also showed a bizarre change.</p><br/><p>As the Blue Silver Prison there equally withdrew, Xiao Wu was inundated in a layer of dazzling pink, her entire tender body seemed to grow somewhat, causing her sleeves and the trouser legs at her calves to rupture, she landed extremely gracefully on the shoulders of the weakest Elephant Armored School member, her feet pressing at his neck in a  shape. The next moment, Waist Bow launched.</p><br/><p>With Xiao Wu’s original strength, it would be impossible for her to throw the opponent, even with Waist Bow. After all, the opponents were far too heavy, and their strength so astonishing. However, under Tang San’s careful calculations, after eating a stimulating pink sausage to temporarily boost strength, and further adding her superior spirit power compared to the opponent, it was just enough for Xiao Wu to deal with this weakest Elephant Armored School disciple.</p><br/><p>Watching Xiao Wu’s still slender body turning in midair, bringing along that massive flesh mountain, then again heavily slamming him into the ground, the forces this Elephant Armored School disciple’s neck had to endure could well be imagined. Unfortunately, right now everyone’s attention was still fixed on that enormous Hell White Tiger, otherwise, Xiao Wu’s attack would definitely have left a deep impression in the hearts of a great many people.</p><br/><p>Hu Yan Li naturally wouldn’t wait helplessly. Right now, along with Tang San’s spirit power being consumed, his brothers were already starting to break free of the restraints. Relying on his five hundred jin[2] body weight, Hu Yan Li crouched in place, using both arms to block the two immense tiger claws swinging at him.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>As a disciple of Elephant Armored School, one of the seven great schools, he naturally knew about the characteristics of the spirit fusion ability. The power of the spirit fusion ability was enormous, but it also required immense spirit power expenditure. He knew that as long as he could withstand two attacks, even if he was defeated, two of the opponents’ fortieth ranked powers would lose all fighting strength due to spirit power exhaustion, and at that time, once his brothers had recovered they would certainly take the final victory.</p><br/><p>Hu Yan Li’s idea was correct, but unfortunately, he underestimated the might of Dai Mubai and Zhu Zhuqing’s Hell White Tiger.</p><br/><p>With extremely high harmonization, as well as both having strength over the fortieth rank and their complementary spirits, Hell White Tiger didn’t only unite their strength, but moreover amplified it enormously. That was an immense gap that couldn’t be bridged by a single spirit bone. Let alone Hu Yan Li, even if Tang San and Hu Yan Li stood together, and both used their spirit bones, it still might not be enough to withstand this spirit fusion ability.</p><br/><p>Two tiger claws swung down simultaneously, causing an enormous explosive sound. Hu Yan Li only felt an irresistible force, feeling explosive pain all over his body, and immediately afterward, flying through the air, he no longer felt anything.</p><br/><p>The Hell White Tiger used the momentum from this strike to dash forward, Hell White Tiger Break, launching.</p><br/><p>That tremendous silhouette, like lightning, struck the other two fortieth ranked Elephant Armored School disciples who had just freed themselves from the restraints.</p><br/><p>More explosions, and those two Elephant Armored School disciples were thrown away by the strike of the Hell White Tiger, directly striking the stage. And at this moment, the illusory form of the Hell White Tiger also vanished, exposing the two equally pale, bodies already returned to normal, Dai Mubai and Zhu Zhuqing. The pair’s spirit body enhancement had already worn off.</p><br/><p>The Hell White Tiger’s attack didn’t take long, but it left an incomparably profound impression in the minds of all the spectators. One claw had sent Hu Yan Li directly into the stage, penetrating the granite surface. Then the Hell White Tiger had further sent flying two fortieth ranked team members that had fully used their fourth spirit abilities, that icicle like protective layer. In practically a split second, it had disintegrated the strength of the Elephant Armored School’s three strongest members.</p><br/><p>And at this time, under the frantic attacks of Jing Ling and Huang Yuan, one Elephant Armored School disciple had already been struck unconscious before he could even struggle free of the Blue Silver Grass. And Xiao Wu had also used the power boost from the stimulating pink sausage to easily throw the weakest member into unconsciousness, also unable to throw off Tang San’s Blue Silver Grass.</p><br/><p>The human meteor hammer had now been completely rescinded, and Tang San didn’t eat a third flying mushroom sausage, bringing Oscar down from the sky.</p><br/><p>Tang San threw the several big recovery sausages in his hands, tossing them to the Shrek Academy members. The seven formed up in a circle, with the last two opponents in the center.</p><br/><p>The Elephant Armored School disciples had commendable fighting spirit. Despite only remaining two of them, and moreover ones who hadn’t reached fortieth rank of cultivation, they didn’t have the slightest intent of backing down. Clearly, they also saw that the Shrek Seven Devils were equally at the end of their strength. Continuously using large scale control abilities was a huge spirit power drain on Tang San, and after using the spirit fusion ability, their two strongest attackers, Dai Mubai and Zhu Zhuqing, were temporarily unable to use their spirits. And Jing Ling, Huang Yuan and Xiao Wu might not be able to break their defense. Therefore, after the two fatties looked face to face, they launched their attack abilities without the slightest hesitation.</p><br/><p>Just like Hu Yan Li, the third spirit abilities of these two was also Pressure Kill. And the targets the two fatties chose were Tang San and Xiao Wu.</p><br/><p>The audience might not have caught that throw Xiao Wu used just now, but standing on the stage, they had still seen it with incomparable clarity. They didn’t want their enormous bodies to be flung through the air like that, with great weight, the fall would also be heavy! The reason their comrade had fainted wasn’t because he was unable to bear the strike, but rather because the bones in his neck had been displaced by the whiplash caused by his own enormous weight and Xiao Wu’s Waist Bow, thereby causing unconsciousness.</p><br/><p>Therefore, when the two launched their attack, they chose the targets they thought were the greatest threat, Tang San and Xiao Wu. As for Jing Ling and Huang Yuan, they believed that the two didn’t have the attack power to break through their defense. After all, by now the restraints were already gone.</p><br/><p>However, they neglected one person, although this person was the most unremarkable one on the Shrek Academy team. From the start to the end of the fight he hadn’t participated in the battle. He also didn’t have any attacking strength. But his presence enormously strengthened the Shrek Academy team’s battle endurance. That was the forty first ranked food system tool Spirit Master, Big Sausage Uncle Oscar.</p><br/><p>Continuously using recovery sausages let Tang San constantly replenish his spirit power. Even though the consumption was enormous, he still wasn’t without fighting strength.</p><br/><p>Tang San’s estimate of the Elephant Armored School was very accurate. Superb defense, superb strength, but low agility, few means of attack, without auxiliary support, without control capability. When dealing with such an opponent, as long as they crushed the most powerful members, they would inevitably lose the ability to turn the tables. Being without Support Spirit Master reduced the likelihood of suddenly recovering their strength. After all, it was impossible for each one to possess such an unlikely treasure as spirit bones.</p><br/><p>Tang San and Xiao Wu were instantly locked down by the two enormous fatties, and even though Jing Ling and Huang Yuan immediately attacked them, now that the Elephant Armored School disciples were free of their restraints, they could show their full defensive power and didn’t pay the two attackers any attention, leaping high up with all their might, pressuring Tang San and Xiao Wu.</p><br/><p>Having their feet locked down didn’t mean their hands couldn’t move. Tang San didn’t panic, and with a wave of his right hand, a strand of Blue Silver Grass flew out, accurately twisting around Xiao Wu’s waist, pulling her over. And at the same time, Tang San half crouched in a horse stance, drawing a deep breath, as white light rushed out from his body, Mysterious Heaven Skill already gathering in his palms.</p><br/><p>Xiao Wu and Tang San hadn’t been cooperating for just one or two days, and being pulled to Tang San’s side, she immediately astonishingly flipped into a handstand, both legs pointing up. Right now, the lock on her had already been removed due to Tang San’s pull.</p><br/><p>Xiao Wu had both legs towards the sky, and Tang San held both hands up high. Watching that fatty tumbling towards them, the two exerted strength simultaneously.</p><br/><p>Waist Bow launching, Xiao Wu accurately planted both feet in the fatty’s belly, instantly retarding his downward momentum, and when her legs even under the effect of Waist Bow was unable to bear that enormous weight, Tang San’s hands already supported that fatty’s abdomen, launching Controlling Crane Catching Dragon. It was the martial skill Two Liang Pushing Ten Thousand Jin[3].</p><br/><p>Of the two, one was forty first ranked and one thirty eighth ranked, even though the fatty’s weight and this ability were both overbearing, against the cooperation of the two, and moreover Xiao Wu’s Waist Bow amplifying effect, it lost all threat.</p><br/><p>The downwards momentum instantly became a horizontal movement, and under the precise control of Tang San’s Controlling Crane Catching Dragon, that enormous body flew sideways, just striking the other fatty as he was about to hit the ground.</p><br/><p>A loud bang echoed, and just at this moment, a yellow green ball of light quietly spread, wrapping up the two inside the instant they collided. Their enormous bodies immediately became like a giant bottle gourd, crashing heavily to the ground.</p><br/><p>By now, the entire Elephant Armored Academy team’s seven members had already completely lost the ability to continue the fight, that one hundred percent toughness boost of the Spider Web Restraint wasn’t something that could be thrown off in a short time. Even with their astonishing strength it was impossible. After all, both of them only had thirty something ranked spirit power.</p><br/><p>As the Shrek Academy’s seven members once again encircled the two, the referee had no choice but to declare the winner of this match.</p><br/><p>“Second round, first qualifiers match, Shrek Academy defeats Elephant Armored Academy.”</p><br/><p>Bang. A bursting sound in the VIP seats, as the Elephant Armored School master Hu Yan Zhen crushed the handrails on his seat, bell like big eyes looking like they were about to shoot flames.</p><br/><p>He was unresigned, he was really unresigned. He obviously felt it was impossible for Shrek Academy to break the Elephant Armored Academy defensive formation led by his grandson. But they had still done it. The erupting strength of the spirit fusion ability Hell White Tiger was admittedly tremendous, but under ordinary circumstances, Hu Yan Zhen believed that three fortieth ranked Elephant Armored School children headed by his grandson, still wouldn’t be unable to resist it. As long as they had dispelled that spirit fusion ability, the outcome of this fight wouldn’t have been in doubt.</p><br/><p>But in such a fight that he had thought couldn’t be lost, the Elephant Armored School was still defeated. How? How could they lose?</p><br/><p>Let alone Hu Yan Zhen being unable to understand, even platinum bishop Salas next to him stared blankly.</p><br/><p>Even if four of Shrek Academy’s seven members had strength over the fortieth rank, the Elephant Armored School still had three people on this level, and Hu Yan Li had used a spirit bone. By all reason, that was enough to make up the difference with the spirit fusion ability. Further adding that the seven Elephant Armored School members all had the first rate spirit Diamond Mammoth, their overall strength clearly surpassed the opponents. But how had they still lost?</p><br/><p>Ning Fengzhi’s face was already covered with a smile, looking at the Shrek Academy seven cheering their victory, inwardly he couldn’t help sighing in praise. The eyes of the Bone Douluo at his side were also currently big and bright, muttering to himself:</p><br/><p>“Using a point to break the surface, fostering strength and avoiding weakness. The effect of a control system Spirit Master in a team fight really is formidable.”</p><br/><p>[1] The literal meaning is () “Forcing sound to become a string ability”, and is also what Gu Rong and Ning Fengzhi used to talk to each other last chapter. I’ll use “voice compression” for short.</p><br/><p>[2] 500 = 250 kg</p><br/><p>[3] 100 g pushing 5 ton. The principle of a small force diverting a large force.</p><br/>\n</div>"}