{"title": "Chapter 91", "id": 91, "volume": 1, "url": "http://boxnovel.org/douluo-dalu-chapter-91", "volume_title": "Volume 1", "body": "<h1>Chapter 91</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 91</p><br/><p>Preselection First Match, Begins</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>The officiant on the side of the VIP platform said in a clear voice:</p><br/><p>“Next, please welcome his majesty, Heaven Dou Empire’s emperor, to declare this tournament open.”</p><br/><p>Just like Tang San guessed, the person seated in the center of the VIP section’s first row, his majesty the Heaven Dou Empire’s emperor wearing gold and red robes, slowly stood amidst thunderous applause.</p><br/><p>Raising his right hand to wave at the spectator seats as well as the competing Spirit Masters below, the applause quickly stopped, and the vast space became quiet.</p><br/><p>A grave and clear voice transmitted to the entire audience via sound amplifying spirit tools,</p><br/><p>“I, emperor of Heaven Dou Empire, Xue Ye[1], represents Heaven Dou Empire, and also this time’s tournament host to declare, the Continental Advanced Spirit Master Academy Elite Tournament now open.”</p><br/><p>Applause thundered once again, cheers rising and falling. But in the center of the arena, Tang San suddenly discovered that this emperor’s smiling expression was a bit forced, as if he himself wasn’t particularly excited for this tournament.</p><br/><p>After waiting for this round of applause to die down once again, the emperor continued:</p><br/><p>“Here, I hope, the Spirit Masters participating in this tournament, can amply display their strength, and obtain good records. You are all the pride of Heaven Dou Empire. For the sake of the Empire’s glory, display your brilliance.”</p><br/><p>Applause rose for a third time, and this time the eyes of the Spirit Masters in the center revealed a scorching brightness. To them, this tournament was the best stage to reveal themselves.</p><br/><p>The emperor sat back in his seat, and the officiant’s voice rose once again,</p><br/><p>“Next, please welcome the Seven Treasure Glazed Tile School’s school master, mister Ning Fengzhi, to address this time’s tournament.”</p><br/><p>Along with Ning Fengzhi getting up, applause rose once again, and there were even more attentive gazes. Who didn’t want to take a look at the grace of the Spirit Master world’s number one Support Spirit Master.</p><br/><p>Ning Fengzhi smiled slightly, holding both hands together,</p><br/><p>“I’m very happy to be invited as an honored guest to this tournament opening. As school master of the Seven Treasure Glazed Tile School, I have already seen very many Spirit Masters grow. As the Continent’s noblest vocation, each Spirit Master must experience many things to grow. In my experience, a sword’s point comes from sharpening, and plum blossom fragrance follows bitter cold. The Spirit Masters joining this tournament are undoubtedly the elite of the young generation. Just as his majesty just said, I hope you can win honor for the Empire, and also for your own academies. The Empire needs your talent. Thank you.”</p><br/><p>Listening to Ning Fengzhi’s address, the Heaven Dou emperor finally revealed a sincere smile.</p><br/><p>The officiant said:</p><br/><p>“School master Ning, you are the most formidable support system Spirit Master, so I represent the spectators of the battles this time to ask, among the twenty eight teams joining the Heaven Dou City district’s preselection competition, which one do you support?”</p><br/><p>Ning Fengzhi still wore a slight smile,</p><br/><p>“Besides Heaven Dou Imperial Academy’s first team entering the finals as seeds, among these twenty eight teams, I still think highly of one other. I think that they possess not only the capability to pass the preselection tournament, but at the same time may very possibly obtain the final victory of this Continental Advanced Spirit Master Academy Elite Tournament.”</p><br/><p>“Eh?”</p><br/><p>The officiant said, astonished:</p><br/><p>“May we know which team could gain school master Ning’s favor?”</p><br/><p>Ning Fengzhi smiled mysteriously, saying:</p><br/><p>“As for which academy this team belongs to, forgive me for holding back the climax. For the moment I can’t reveal it. But I believe, that the final champions of this tournament, will certainly belong to the Empire.”</p><br/><p>Sitting next to emperor Xue Ye, the platinum bishop at this moment opened the eyes he had so far kept almost closed. His eyes appeared very turbid, without any luster, and his gaze fell on the twenty eight competing teams in the center of the arena, as if searching for the team Ning Fengzhi spoke of.</p><br/><p>By now the spectators had already begun discussing, everyone speculating on which academy Ning Fengzhi supported. With a bit of thought it was clear that Ning Fengzhi wouldn’t be indicating Heaven Dou Imperial Academy’s second team. Since their strength couldn’t compare to the first team, how could they be the final champions? But there were twenty eight teams in the preselection tournament, and in the end only five teams could remain, how would it be so easy to guess.</p><br/><p>Ning Fengzhi sat back down, and the officiant smiling said:</p><br/><p>“I regret that school master Ning won’t reveal the team he supports. Next, Heaven Dou City’s Spirit Temple hall master, Spirit Hall platinum bishop, lord Salas[2], will conduct the preselection competition’s first round draw. Afterwards, Heaven Dou Imperial Academy’s secondary team will fight their first drawn matchup. This is also the only match today.”</p><br/><p>Platinum bishop Salas slowly stood, and was led by a maid to the side of the officiant, starting to draw the lots. He was apparently very unwilling to speak, and each pair of opponents he drew was announced by the officiant.</p><br/><p>“Preselection competition first round, Blue Sunshine Academy versus Purple Star Academy.”</p><br/><p>“Preselection competition first round, Auckland Academy versus Blazing Radiance Academy.”</p><br/><p>“Preselection competition first round, Heaven Dou Imperial Academy versus Shrek Academy.”</p><br/><p>The Shrek Academy group didn’t pay much attention to the rest of the matchups. When they heard their first opponent would actually be Heaven Dou Imperial Academy’s second team, everyone couldn’t help their expressions becoming grotesque.</p><br/><p>Oscar muttered:</p><br/><p>“Such an unlikely coincidence.”</p><br/><p>Ma Hongjun squeezed his fingers, issuing bone popping noises,</p><br/><p>“Excellent. They aren’t rushing us off. This time we’ll let them have a look at what’s called strength.”</p><br/><p>Tang San and Dai Mubai smiled wryly. They were naturally looking forward to fighting Heaven Dou Imperial Academy, but becoming the focus of the tournament’s first day in their present attire, was really somewhat……</p><br/><p>Not just the Shrek Academy people were astonished, the audience was too. The other academies might not have paid attention, but the Shrek Academy was really too gaudy, how couldn’t they attract notice?</p><br/><p>For a moment, jeers flowed continuously. Very many spectators were all shouting the word ‘fraud’, Heaven Dou Imperial Academy’s second team was clearly looking for pushovers, and Shrek Academy didn’t seem like a Spirit Master team as much as a pack of clowns.</p><br/><p>The lottery done, that platinum bishop Salas swept his gaze across everyone, indifferently saying:</p><br/><p>“I[3] drew the lots, and sensed no falsehood. I swear on the honor of Spirit Hall. At the same time, I hereby declare, of the participating Spirit Master academy students, Spirit Hall will make an exception for anyone capable of reaching the finals, letting them directly enter Spirit Temple.”</p><br/><p>These words weren’t anything to the spectators, but the Spirit Masters were already in an uproar.</p><br/><p>What kind of place was Spirit Temple? It was the highest place in Spirit Hall apart from Supreme Pontiff Palace and Douluo Palace, in the entire Continent only the two great imperial capitals had one each. Supreme Pontiff Palace was for the Supreme Pontiff’s use, and Douluo Palace was a symbolic existence. Therefore, the Spirit Temples’ position were in fact the highest ranked institutions in Spirit Hall. To a Spirit Master, being able to directly enter Spirit Temple could be a shortcut to improving his strength. Not only would he have the best treatment, but all kinds of cultivation aids as well as Spirit Temple’s prestige, no part lacked extreme attraction to ordinary Spirit Masters.</p><br/><p>Hearing the platinum bishop’s words, emperor Xue Ye’s expression clearly dropped. Ning Fengzhi on his side softly shook his head at the emperor, and emperor Xue Ye’s complexion eased somewhat.</p><br/><p>The people nearby were behind them and naturally didn’t catch this little exchange, and the Spirit Masters below were very far away. But, this didn’t escape Tang San’s Purple Demon Eye. He clearly saw the subtleties within, and combined with what Grandmaster had once told him about some matters, Tang San understood that the conflict between Spirit Hall and the Empire was already growing deeper and deeper, almost to the degree where it couldn’t be reconciled. Otherwise, that platinum bishop wouldn’t dare recruit outstanding Spirit Masters right in front of this emperor.</p><br/><p>“Good, then next we will conduct the first match of the first round of the preselection competition, Heaven Dou Imperial Academy facing Shrek Academy. All competing academies leave the field. The two academies taking part in the match later please prepare. In one hour, the match will formally begin.”</p><br/><p>“Third brother, let me go up.”</p><br/><p>Fatty didn’t pay the slightest attention to those contemptuous expressions in their surroundings, and spoke to Tang San while rubbing his fists and wiping his palms[4].</p><br/><p>Tang San glared at him,</p><br/><p>“We’ll follow the original plan. No need to argue.”</p><br/><p>Tai Long laughed out loud and clapped Fatty’s shoulder,</p><br/><p>“Junior, don’t worry. Later big brother will help you properly teach those Heaven Dou Imperial Academy fellows a lesson.”</p><br/><p>Fatty deflated like a ball. If one described his current expression with two words, it would be ‘secret grudges’.</p><br/><p>As a result of the other academies not competing today, after stepping off the field they directly left the rest area, guided by functionaries to specially prepared viewing platforms for competitors to watch the fights. Because the Heaven Dou Imperial Academy was the symbol of the Heaven Dou imperial family, they were naturally treated different from normal academies and didn’t rest here. Inside the vast rest area, very quickly remained only the Shrek Academy team.</p><br/><p>Flender, Grandmaster, and Liu Erlong weren’t here. Clearly, this match was left in their control.</p><br/><p>Dai Mubai lowered his voice:</p><br/><p>“Little San, you plan it.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Tang San didn’t need to be urged, nodding:</p><br/><p>“When we go up we’ll have Dai Mubai, Me, Xiao Wu, Jing Ling, Huang Yuan, Jian Zhu, Tai Long. We’ll attack according to the first plan. At that time we suffered that kind of humiliation at Heaven Dou Imperial Academy, even though it was caused by prince Xue Xing, the Heaven Dou Imperial Academy symbolizes the imperial family. Dean Flender and the other teachers aren’t here, but we understand what they think. If we want to have a good future, then today we must thoroughly smash our opponent. I think, to us, one minute should be enough.”</p><br/><p>Tai Mubai’s tiger palms slapped together, the four pupils of his evil eyes glinting ominously,</p><br/><p>“That’s right, we only need one minute.”</p><br/><p>An incorporeal harsh atmosphere spread in Tang San and Dai Mubai’s hearts. The scene of that time they powerlessly withdrew from Heaven Dou Imperial Academy in front of Dugu Bo would never be erased from their minds. Even though Tang San didn’t say it clearly, everyone understood that they not only had to prevail over this Heaven Dou Imperial Academy second team, they still had to keep them from passing this time’s qualifying competition.</p><br/><p>Not long after, a special functionary arrived and hurried everyone to the stage. The organizers clearly weren’t optimistic about their chances, and they were even brought by just one functionary. Just as they were leaving the mouth of passage, the Shrek Academy group could already hear the officiant outside declaring the names and spirits of each member of the Heaven Dou Imperial Academy team. Golden beams of light shot down on the high stage from the side of the Great Spirit Arena, accompanying each member of the Heaven Dou Imperial Academy second team as they appeared.</p><br/><p>Before speaking of strength, the Heaven Dou Imperial Academy members were excellent in terms of appearance, the faintly golden uniforms had the words ‘Heaven Dou’ embroidered on the left side of the chest, and on the back was a design of seven silver stars, the symbol of Heaven Dou Imperial Academy. Each one was valiant and formidable-looking, all appearing over twenty years old. Under the illumination of those spirit tools, even though it was daytime, they still seemed to release a dazzling radiance, just like little golden suns, attracting the audiences attention.</p><br/><p>“Fuck, they’re clearly taking us as extras, setting off this kind of fireworks.”</p><br/><p>Huang Yuan said angrily. Even though this Lone Wolf Spirit Master’s stature wasn’t as doughty as Tai Long, he was still fairly robust. Like Dai Mubai he was also a power attack system Spirit Master. Because of his straightforward nature, he was very quickly accepted by the Shrek Seven Devils.</p><br/><p>To the side, Jing Ling uneasily said:</p><br/><p>“Wrong. We’re not extras, but considered cow dung. Fresh flowers stuck on top of manure, isn’t that even more dazzling?”</p><br/><p>Contrary to Lone Wolf, his appearance was somewhat wretched. The slender agility attack system Spirit Master gave a somewhat feminine impression. Together with him, most people would feel uneasy. His cold gaze at people was like a poisonous snake, and even when everyone were exchanging pointers, he would never let himself be in a disadvantageous position. He would frequently team up to attack, but when defending there would rarely be a trace of him. He was called a coward by the ferocious male students Dai Mubai, Huang Yuan, and Tai Long, but fortunately, this fellow only had a somewhat strange character, and his strength was still fairly outstanding.</p><br/><p>“We’ll let them know who is manure.”</p><br/><p>Tai Long resolutely waved his fist.</p><br/><p>Dai Mubai coldly said:</p><br/><p>“Let’s go. It’s our turn to go up.”</p><br/><p>The lights in the arena faded, and the Shrek Academy competing students slowly went on stage amidst loud hissing voices.</p><br/><p>In the arena there had already occurred a change. In just that brief half hour, a long ago prepared stage had been constructed. The stage was ten meters tall and circular, with a diameter of thirty meters, a fairly large area. Of course, this was still only one stage. Once the preselection competition truly started tomorrow, there would be five stages here simultaneously. The twenty eight teams would conduct twenty seven rounds of the preselection competition, each team confronting twenty seven opponents. The victors would obtain one point, the defeated none. After twenty seven rounds, the five teams with the most points would advance to the promotion competition. And entering the promotion competition was equal to entering the finals. This month long qualifying competition was equal to a trial for each of the academy teams. Twenty seven days of continuous matches was enough for teams that lacked endurance to collapse.</p><br/><p>In the entire Continental Advanced Spirit Master Academy Elite Tournament, this preselection competition would occupy the first half of the time. The finals after the promotion competition would take place on the common border of the Heaven Dou Empire and Star Luo Empire, in the public plaza in front of the Supreme Pontiff Palace. The final champions would be issued the award by the Supreme Pontiff personally, an immense honor.</p><br/><p>It truly was a difference in treatment. Tang San squinted slightly, the expression on his face still serene. Together with Dai Mubai, they brought the Shrek Academy’s altogether eleven members into a line in the center of the stage, standing opposite to the Heaven Dou Imperial Academy second team’s members.</p><br/><p>This Heaven Dou Imperial Academy second team had altogether sixteen members. At that time the Shrek Academy only stayed at the Heaven Dou Imperial Academy for a very short time, and these people naturally didn’t recognize Tang San and the others. These aristocratic children naturally looked even more at the Shrek Academy members’ attire. If this hadn’t been on stage, some of them might have already burst out laughing.</p><br/><p>“Truly a group of toads. This type also participates in the Spirit Master Tournament?”</p><br/><p>Standing furthest ahead in the Heaven Dou Imperial Academy second team was a petite male student. His skin was fair, and his long hair also very beautiful, seemingly like a girl. Even his voice was soft and feminine.</p><br/><p>“Captain, why would we draw an opponent like this. Toads on your foot really won’t bite people, but are still disgusting[5]. Look at those uniforms, I’ll die laughing.”</p><br/><p>A gorgeously dressed female student with ample chest next to the petite man covered her mouth as she spoke. That gesture was apparently for fear of smelling the Shrek Academy students.</p><br/><p>That captain nodded consideringly, his gaze somewhat lecherously floating over to Xiao Wu,</p><br/><p>“It’s only a pity on such a little beauty.”</p><br/><p>Xiao Wu snorted coldly,</p><br/><p>“A hermaphrodite and a prostitute, how did we draw an opponent like this.”</p><br/><p>“Little slut, who are you calling a prostitute?”</p><br/><p>That hot bodied female student immediately flipped out. That male student addressed as a hermaphrodite also immediately went ashen.</p><br/><p>Dai Mubai laughed out loud,</p><br/><p>“Xiao Wu, you’re too talented. Why didn’t I think of such a good description? Hermaphrodite and prostitute. Really a perfect match!”</p><br/><p>The Heaven Dou Imperial Academy second team’s petite captain coldly said:</p><br/><p>“Fine, you’re very good. Even if the competition prohibits killing opponents, injuries really are hard to avoid. Since you’re courting death, don’t blame us.”</p><br/><p>The competition still hadn’t started, but both sides already stood with swords drawn and bows bent, the taste of gunpowder thick and clear.</p><br/><p>Dai Mubai clearly didn’t like having his own lines snatched by the other side, but now the referee had already walked over.</p><br/><p>“Both sides salute, non competitors withdraw from the stage.”</p><br/><p>Whether it was Heaven Dou Imperial Academy of Shrek Academy, both sides unwillingly forced themselves to bow in salute to their counterparts. The superfluous withdrew from the stage, only leaving seven people each to participate in this first match.</p><br/><p>On the Shrek Academy’s side, Dai Mubai, Tai Long, and Huang Yuan stood furthest in front. Tang San was in the center, with Xiao Wu and Jung Ling on either side. Jiang Zhu stood furthest back.</p><br/><p>On the Heaven Dou Imperial Academy side, besides the man and woman who spoke up before, the remaining five were all robust people, standing in a line in front, obstructing the two behind them like a wall. That petite captain stood in the center, doubtlessly this side’s control system Spirit Master. And that fiery bodied young woman stood in the rear.</p><br/><p>In the VIP section.</p><br/><p>Emperor Xue Ye looked at the stage with a smile, asking Ning Fengzhi at his side:</p><br/><p>“School master Ning, It seems this first match doesn’t hold any suspense!”</p><br/><p>Ning Fengzhi smiled slightly, nodding, expressing agreement.</p><br/><p>The platinum bishop Salas on the other side suddenly said:</p><br/><p>“School master Ning, could you tell me which of the twenty eight teams you before said could be championship contestants?”</p><br/><p>Ning Fengzhi smiled:</p><br/><p>“Your grace, is a bit of mystery no good? I think you also certainly have teams to support.”</p><br/><p>Salas tightlipped said:</p><br/><p>“Since you say this, school master Ning, are you unwilling to reveal it?”</p><br/><p>Ning Fengzhi smiled calmly, saying:</p><br/><p>“This is a school secret, it appears unrelated to your grace.”</p><br/><p>“You……”</p><br/><p>Salas’ complexion clearly dropped. His gaze colliding with Ning Fengzhi’s in front of emperor Xue Ye, neither yielding the slightest bit.</p><br/><p>Emperor Xue Ye sitting in the middle frowned minutely, mediating:</p><br/><p>“No need to be impatient, after this tournament ends, we will naturally have the results. Bishop Salas, what school master Ning said wasn’t wrong, who he favors is his own matter. You see, I also didn’t ask about it. Even though I’m also very curious.”</p><br/><p>Platinum bishop Salas glanced at emperor Xue Ye, indifferently saying:</p><br/><p>“As your majesty says. Then let us look at the match.”</p><br/><p>Prince Xue Xing in the second row proudly said to everyone next to him:</p><br/><p>“Look, his majesty and school master Ning have both already noticed that this match is without any suspense. Our Heaven Dou Imperial Academy’s students truly are elite. This is still only the second team. This time our main team only has one goal: final champions.”</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>He was the person in charge of Heaven Dou Imperial Academy, and if they could obtain a good record, his reputation would naturally shine. He had already forgotten the words ‘Shrek Academy’. As an imperial prince, what happened that time at Heaven Dou Imperial Academy was to him only a tiny interlude.</p><br/><p>“I think maybe not. School master Ning only agreed with his majesty that the match didn’t hold any suspense. He didn’t say who would win.”</p><br/><p>Hearing this dissenting voice, prince Xue Xing immediately turned in its direction with annoyance. The speaker was no stranger, but rather the head of the Heaven Dou Imperial Academy board of education, Spirit Douluo Meng Shen Ji.</p><br/><p>Prince Xue Xing coldly said:</p><br/><p>“Board member Meng Shen Ji, don’t enhance the power of others when you’re directly in charge of the Academy.”</p><br/><p>He and Meng Shen Ji had never gotten along, only both sides were unable to sway the other’s position. Because of the matter with Shrek Academy last time, Meng Shen Ji had once gone to find emperor Xue Ye to lodge a complaint, but the emperor was busy with official business, and his health wasn’t too well. He also didn’t particularly pay attention. Prince Xue Xing was his only little brother, and he still had faith in his brother.</p><br/><p>Prince Xue Xing didn’t see who the competing Shrek Academy members were, but how could Meng Shen Ji fail to notice? At a glance he recognized the one who had originally left him with a profound impression, Tang San. When he saw that Shrek Academy largely hadn’t brought out the Shrek Seven Devils, inwardly he couldn’t help feeling sorrowful. The magnificent Heaven Dou Imperial Academy, unexpectedly couldn’t make the opponent go all out. But what could he do? Practically each student at the Heaven Dou Imperial Academy had some background, and he couldn’t reorganize even if he wanted to.</p><br/><p>With formidable teachers and material conditions, yet rarely produced outstanding disciples. Were it not for receiving the grace of the imperial family, he would have long ago already left this board member position.</p><br/><p>“The qualifying competition’s first round, first match, formally starts.”</p><br/><p>The referee’s announcement declared the official start of the first round of the qualifying competition of the current Continental Advanced Spirit Master Academy Elite Tournament.</p><br/><p>Similar to the spirit arena, the tournament gave one minute for both sides to deploy their spirits.</p><br/><p>While coldly gazing at the other side, Dai Mubai raised his hands to his chest, shouting,</p><br/><p>“Brothers, release spirits! White Tiger Body Enhancement.”</p><br/><p>As both sides released their spirits, all the spirit rings that appeared made surprised voices immediately spread through the spectator seats.</p><br/><p>Two yellow and two purple, four dazzlingly beautiful spirit rings flashed around Dai Mubai. Tai Long and Huang Yuan at his side both released two yellow and one purple spirit ring. The valiant aura released by the three power attack system Spirit Masters unexpectedly wasn’t inferior in any respect when facing off against the five opposing people.</p><br/><p>Xiao Wu, Jing Ling as well as Jiang Zhu behind, also each released two yellow and one purple spirit ring. None of these six lacked an optimal spirit ring configuration.</p><br/><p>But what startled the audience the most, and even caused shock, was the person in the central position of the Shrek Academy’s formation, Tang San. Two yellow, one purple and one black, four spirit rings simultaneously appeared around him.</p><br/><p>Black, originally the most inconspicuous of colors, but, people with the slightest bit of knowledge about Spirit Masters all understood what that signified.</p><br/><p>Not just the spectator seats, even the VIP section now cried out in alarmed surprise. Who could have imagined that in the first round of the preselection competition, they would actually see a ten thousand year spirit ring appear on stage.</p><br/><p>Prince Xue Xing, unable to control his emotions, shouted:</p><br/><p>“No. This is impossible. How can it be a ten thousand year spirit ring?”</p><br/><p>Meng Shen Ji painfully closed his eyes,</p><br/><p>“This should originally have been the Heaven Dou Imperial Academy’s glory. No wonder. No wonder they didn’t even field their full strength.”</p><br/><p>Even Seven Treasure Glazed Tile school master Ning Fengzhi who had already had a very favorable opinion about Shrek Academy was gobsmacked when he saw the black spirit ring around Tang San. The fourth spirit ring already reached ten thousand years? As school master of one of the seven great schools’ three upper sects, how couldn’t he understand the problem within? That was a spirit beast with a five thousand year cultivation gap!</p><br/><p>Platinum bishop Salas’ previously squinting eyes now abruptly shone, staring fixedly at Tang San. Even if he didn’t forget his manners like prince Xue Xing behind him, the hands resting on his knees unconsciously tightened.</p><br/><p>“Ten thousand year fourth ring?”</p><br/><p>Light flashed in emperor Xue Ye’s eyes, a dazzling luster flitting past the corners of his eyes,</p><br/><p>“School master Ning, it seems, this should be the team you were optimistic about?”</p><br/><p>Ning Fengzhi’s expression had already recovered to normal after the brief shock. Despite the raging storm Tang San’s ten thousand year fourth ring raised in his heart, at this moment he could still maintain a calm attitude. Calmly smiling, he said:</p><br/><p>“Your majesty, my daughter is also a student at this Shrek Academy, she just didn’t appear in this match.”</p><br/><p>“Eh? In other words, this Shrek Academy is fostered by your honorable school?”</p><br/><p>Emperor Xue Ye said with a smile. His eyes clearly displayed a cheerful look, without any worry about the Heaven Dou Imperial Academy second team running into such a formidable opponent. But the expression of platinum bishop Salas on the other side clearly grew more unsightly. Ning Fengzhi declaring that his daughter was part of this team, was clearly to tell him that Spirit Hall mustn’t have the notion of striking at this team. And the Seven Treasure Glazed Tile School had also always had a good relationship with the Heaven Dou imperial family.</p><br/><p>Ning Fengzhi smiled slightly, saying:</p><br/><p>“I also can’t say it’s raised by our Seven Treasure Glazed Tile School, it’s just that the child with the ten thousand year fourth spirit ring is also a disciple of our upper three sects, that’s all. Originally, they were going to join Heaven Dou Imperial Academy, but unfortunately they were turned back by his highness prince Xue Xing. Afterwards they joined another academy in Heaven Dou City, the forerunner of the present Shrek Academy, Blue Tyrant Academy.</p><br/><p>“What?”</p><br/><p>Emperor Xue Ye was inwardly alarmed, only with difficulty restraining himself from turning around and questioning prince Xue Xing. But in his mind he still immediately recalled the complaint Meng Shen Ji had lodged with him, and his brows drew down.</p><br/><p>After hearing Ning Fengzhi say this, Salas’ expression recovered somewhat, and there was even a light of taking joy in calamity in his eyes.</p><br/><p>Compared to the Shrek Academy side, the Heaven Dou Imperial Academy second team’s spirit rings were inferior, they didn’t lack in quality; being able to represent Heaven Dou Imperial Academy in battle, these students also all had optimal spirit rings. After all, relying on the strength of Heaven Dou Imperial Academy’s formidable teachers, as well as the power of nobility, getting hold of optimal spirit rings wasn’t too strenuous. Unfortunately, right now the seven people on stage didn’t have one Spirit Master at the fortieth rank, and all had three spirit rings. As they saw Tang San, and his muted black ten thousand year spirit ring, they couldn’t keep their pupils from contracting, dully.</p><br/><p>But this was a match, equivalent to a battlefield, and daydreaming on the battlefield was a major taboo. The opponents might stare blankly, but the Shrek group wouldn’t. In combat experience, this Heaven Dou Imperial Academy second team in front of them couldn’t even compare to Tai Long and the other Shrek latecomers, let alone the Shrek Seven Devils.</p><br/><p>“Blitz——”</p><br/><p>Tang San shouted loudly. While the opponents were still lifeless, the Shrek seven already initiated their attack.</p><br/><p>Dai Mubai took the lead, his muscles swelling suddenly as he lead Tai Long and Huang Yuan in a forward charge. Xiao Wu and Jing Ling also simultaneously went out on the flanks. Jiang Zhu behind Tang San now held a fantastic scepter in her hand, the scepter tapered on the lower end, growing thick and heavy at the top, carved with exotic inscriptions. Right now the third spirit ring around her flashed, and with a wave of her hand, the scepter stuck into the surface of the floor, a ring of saffron light quietly spreading out. Only once Dai Mubai’s trio charged did the Heaven Dou Imperial Academy second team members react, that petite male control system Spirit Master angrily shouting:</p><br/><p>“What are you staring at, fight!”</p><br/><p>The five people in front of the Heaven Dou Imperial Academy second team were without exception power attack system Spirit Masters, their spirits were each: Lion, Bear, Tiger, Leopard, Wolf. The impact force of this assembly was clearly unusually powerful. Even if they reacted a beat slow, on hearing the petite man’s shout they acted immediately, fiercely going to meet Dai Mubai’s trio. It seemed to them that even though Dai Mubai’s spirit was over the fortieth rank, they still held the numerical advantage. Their five spirits had all reached the thirty fifth rank or higher, and coming into contact with the opposing three they weren’t at a disadvantage. As long as they first defeated the opponents’ three main attackers, victory wasn’t far away.</p><br/><p>The Heaven Dou Imperial Academy second team’s five front power attack system Spirit Master clearly had the right idea. Their goal was to take the first take the initiative in the early stage as both sides just came into contact.</p><br/><p>Unfortunately, they came into contact with Dai Mubai. Dai Mubai whose spirit power had already reached the forty fourth rank. And still the pressure behind him, the Thousand Hands Asura with the ten thousand year spirit ring.</p><br/><p>The Evil White Tiger faced upwards and roared, and the instant both sides were about to engage, without holding back he immediately opened with his third spirit ring ability, White Tiger Vajra Transformation.</p><br/><p>Tai Long was even simpler, his three spirit rings launching simultaneously, immediately changing into a ruthless orangutan with his pure strength amplification.</p><br/><p>Huang Yuan’s third spirit ring ability was somewhat similar to Dai Mubai’s, the boost was just a bit inferior. Called Sky Wolf Transformation, it instantly gave him a fifty percent attack power and speed boost.</p><br/><p>The Shrek Academy’s three power attack system Spirit Master actually all opened with their thousand year spirit abilities, this was something nobody had expected. After all, when opening with spirit abilities that had such a large consumption, if the opponent blocked them, they wouldn’t be able to follow up.</p><br/><p>But, did Shrek’s team members need to follow up?</p><br/><p>Black light floated around Tang San, he didn’t even give the opponents’ control system Spirit Master the chance to act, before his ten thousand year spirit ring ability Blue Silver Prison had already launched.</p><br/><p>Without any warning, more than a hundred strands of black Blue Silver Grass suddenly rushed out of the ground, becoming seven solid cages, completely trapping Heaven Dou Imperial Academy’s seven within.</p><br/><p>Cries of alarm resounded in the whole arena, some spectating Spirit Masters shouting the words ‘crowd control’. Crowd control, a control system Spirit Master’s most menacing tool in battle, appeared in this first round of the qualifying competition.</p><br/><p>[1] () “Snow Night”</p><br/><p>[2] (salasi )</p><br/><p>[3] He refers to himself as (), an uncommon personal pronoun that in fantasy fiction might be used by someone of great magical power, or perhaps someone with a very senior position in an organisation.</p><br/><p>[4] Idiom: Preparing to fight. Probably also used literally here.</p><br/><p>[5] Idiomatic expression. Toads won’t bite, but they’ll still be intimidating when they crawl over your feet.</p><br/>\n</div>"}