{"title": "Chapter 119", "id": 119, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-119", "volume_title": "Volume 2", "body": "<h1>Chapter 119</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 119</p><br/><p>A Flower Loving Title Douluo</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Fifteen hundred men besieged fifteen academies, one hundred enemies or so for each academy. The battle had only just started when Tang San discovered a problem. Those black clothed men were clearly intrinsically a lot more powerful than ordinary people.</p><br/><p>They were at least specially trained soldiers. Speed and strength were both fairly good. Otherwise they wouldn’t have had this few casualties.</p><br/><p>In fact, even though they had a numerical advantage, they were still dealing with Spirit Master teams.</p><br/><p>There were two Spirit Masters facing Shrek Academy, both with five spirit rings, and moreover both with optimal spirit ring configurations. One approached and dealt with one of Ma Hongjun’s attacks. Flender and Liu Erlong simultaneously went up, unleashing their firepower.</p><br/><p>Crowd battle? Tang San smiled. As a control system Spirit Master, what he feared the least was crowd battles.</p><br/><p>Blue Silver Grass dispersed along the ground, swiftly pouncing at the enemies. Each enemy that approached would immediately be hit with Blue Silver Binding. It was admittedly important to conserve spirit power, but it was even more important to end it all quickly.</p><br/><p>Confronting this many opponents for the first time, Tang San had a kind of blood boiling feeling. His originally already astonishing strength was displayed completely. The Binding ability would only bind the opponents’ legs, at the same time, he also began to assign tasks to the Shrek Academy side.</p><br/><p>“Form up.”</p><br/><p>He shouted in a low voice. After the opponents had been delayed, Tang San didn’t rush to attack.</p><br/><p>Black green little boxes appeared in the hands of the Shrek Seven Devils, and the seven people aimed in different directions with tacit understanding, swiftly completing the winding action.</p><br/><p>Those black clothed people in Tang San’s Binding were apparently somewhat anxious. Suddenly, one black clothed man among them shouted loudly, unexpectedly giving rise to spirit power fluctuations, three spirit rings rising from below him, unexpectedly forcefully throwing off the Binding Blue Silver Grass on his legs.</p><br/><p>Watching this, Tang San inwardly suddenly drew a disconcerting conclusion, but right now he didn’t have time to deal with it. The mechanisms wound, Tang San shouted loudly,</p><br/><p>“Loose!”</p><br/><p>With sonorous metallic cracks, seven Godly Zhuge Crossbows spit out the death god’s breath. Each person had sixteen, altogether more than a hundred bolts sprayed out, interweaving in a large web brimming with the aura of death.</p><br/><p>Blood curdling screams lingered unendingly. In front of the Godly Zhuge Crossbows tyrannical piercing power, the black clothed finally began to have large scale casualties.</p><br/><p>The Godly Zhuge Crossbow’s piercing power was really too powerful, enough to shoot through several overlapping bodies simultaneously. In just one volley, the number of enemies in their surroundings decreased by half.</p><br/><p>Tang San laughed coldly,</p><br/><p>“Everyone don’t move, defend properly.”</p><br/><p>As he finished speaking, he was already dashing out.</p><br/><p>At this moment the other academies were all under siege, and nobody would pay attention to him. With a swing of Tang San’s arms with a kind of illusory rhythm, countless sparkling and translucent rays of light sprinkled out from his fingertips. In that instant, it seemed as if he had eight arms.</p><br/><p>It had already been very long since he used hidden weapons, but that didn’t mean Tang San would be out of practice. He was like a Thousand Hand Asura specifically emerged to meet the destiny of hidden weapons, unceasingly granting his enemies the breath of death.</p><br/><p>If he was certain the opponent was an enemy, he would never hold back. This was one of Tang Sect’s principal rules, how would Tang San forget it? Whoever these masked men were, they clearly didn’t have good intentions.</p><br/><p>The hidden weapons Tang San used were mainly flying needles. Because the flying needles were small, they were even more difficult to defend against, and also more convenient to carry.</p><br/><p>From the most common Refined Iron Needles, to Bone Piercing Needles, Armor Breaking Needles, Overlord Needles, all kinds of differently sized but all astonishingly powerful flying needles sprinkled constantly from his hands.</p><br/><p>Purple golden rays of light shot out from his eyes, grasping everything in his surroundings with his six senses. Practically each time he moved, someone would immediately collapse. What Tang San shot wasn’t all at the opponents’ vitals, but don’t forget, Tang Sect didn’t only have hidden weapons. They still had poison.</p><br/><p>In Tang San’s Twenty Four Moonlit Bridges there was paralysing poison, and also Meeting Blood Throat Sealing poison. When confronting enemies, would he be lenient? No, of course not.</p><br/><p>This was also the first time the Shrek Seven Devils saw Tang San use his comprehensive strength, and even though they were familiar with him, they also could only watch as rays like moonlight constantly sprinkled from Tang San, and the enemies within thirty meters of Tang San falling like wheat. Each that collapsed wouldn’t rise again.</p><br/><p>In only a short while, not only had all the bandits on the Shrek Academy side been purged, but even some black clothed bandits in the surroundings had met calamity.</p><br/><p>Tang San’s hidden weapons really were too frightening. Penetrating any gap, noiselessly, once the opponent reacted, they were frequently already poisoned. The potency of his hidden weapons could compare to any spirit ability.</p><br/><p>Using hidden weapons, Tang San became especially confident. Right now the spirit abilities of his Blue Silver Grass had completely turned into support. Those black clothed bandits basically didn’t have any way to get close.</p><br/><p>Just when Tang San prepared to expand the scope of the battle, the black clothed bandits had apparently already become aware that something was amiss here. The higher level Spirit Masters of each academy were also entangled with the higher level black clothed bandits, and even though the students had also begun to bring out their killing power, Tang San was alone in having destroyed a hundred people in just a short time.</p><br/><p>Altogether three shadows simultaneously pounced in Tang San’s direction. On the appearance of these three, Tang San immediately felt his ease like moving clouds and flowing water disappear. Even though none of these three people pouncing at them didn’t release their spirit, they still gave Tang San quite a lot of pressure.</p><br/><p>Confronting a crisis, Tang San’s sixth sense was especially sharp. Without stinting, six Cluster Soul Chasing Life Taking Balls flew out of his hands.</p><br/><p>Bright crystal iron balls flew through the air in six beautiful intersecting arcs, separating Tang San from the three suddenly appearing opponents.</p><br/><p>Tang San himself used the fastest possible speed to swiftly retreat, dashing back among his companions.</p><br/><p>A bright ray of light promptly fell on Tang San, precisely Ning Rongrong’s support, speed boost, forty percent. Tang San’s retreating speed instantly increased.</p><br/><p>The six Cluster Soul Chasing Life Taking Balls quietly collided in midair. Instantly, a large cloud of poison gas pervaded the air, and hidden inside the gas were countless hair fine needles, the refined iron hair needles creating a frightening toxic screen, enveloping the path in front of the three black clothed people.</p><br/><p>When Tang San threw the six Cluster Soul Chasing Life Taking Balls, he basically did it without looking, but right now the front of his clothes were already soaked through with sweat. Because he clearly felt that the pressure exuded by the three was almost enough to make him collapse. In other words, the strength of these three together would in no way lose to an eightieth rank Spirit Douluo.</p><br/><p>That wasn’t something fiftieth ranked Spirit Kings could attain.</p><br/><p>Why would there be such powerful Spirit Masters among the enemies?</p><br/><p>The three black clothed people used the number of their spirit rings to ascertain Tang San’s conjecture. Eight, seven, seven. One Spirit Douluo, two Spirit Sages released their spirits.</p><br/><p>Incomparably tyrannical spirit power fluctuations erupted, engulfing the great cloud of poison needles. Tang San’s spirit power was still too weak. If the six Cluster Soul Chasing Life Taking Balls were launched by Dugu Bo, then even if the three people didn’t die, they’d at least have lost a layer of skin.</p><br/><p>But Tang San’s spirit power was a lot lower.</p><br/><p>However, even like this, it still held back the opponents a moment, giving him the chance to retreat to his cormades.</p><br/><p>Suddenly seeing three powers appear, Flender and Liu Erlong’s hearts chilled. Their two fifty something ranked Spirit Master opponents had proved to be extremely slippery in their fight, both agility attack system, and until now they hadn’t been able to destroy them. Now seeing the three powers appear, the two Spirit Kings turned and ran.</p><br/><p>The silhouettes swiftly approached, and the Shrek Academy group’s expressions quickly turned serious. One Spirit Douluo, two Spirit Sages, two Spirit Kings. They were only too clear on how much strength they had assembled.</p><br/><p>If Grandmaster was here to reveal the Golden Iron Triangle triple spirit fusion ability with Flender and Liu Erlong, perhaps there would still have been a chance. But the contrast in strength right now was clearly something that couldn’t be resisted.</p><br/><p>But who would shrink back at this moment? Hoping others would come to help them was impossible. The other Spirit Master academies were all trapped. The imperial household knights were also blocked by a group of black clothed bandits. At least they wouldn’t be able to come help them for a while.</p><br/><p>What’s more, the academies next to them were rivals. Even if they could get their hands free, they still might not help.</p><br/><p>That black masked Spirit Douluo snorted coldly, raising a hand and waving it. Five people simultaneously forged ahead, the two Spirit Saints directly leaping at Flender and Liu Erlong, and the two Spirit Kings under their lead turned to the eleven people of the Shrek Seven Devils.</p><br/><p>Tang San and Dai Mubai looked face to face. From each others’ eyes, they could see a resolute light. Eightieth ranked Spirit Douluo. That was already close to the peak of the Spirit Master world. Were opponents like these really something they were capable of resisting? So what if they couldn’t resist? They still wouldn’t give up.</p><br/><p>The battle on Flender and Liu Erlong’s side had already begun. Even though Flender was also a Spirit Saint, his spirit power already approached the seventy ninth rank, absolutely a powerful existence among Spirit Sages. His opponent was a Winged Tiger Spirit Sage, and the battle between the two directly unfolded in midair.</p><br/><p>Liu Erlong’s opponent was an Armor Plated Tortoise Spirit Master.</p><br/><p>One attack and one defense, their battle wouldn’t conclude soon. Liu Erlong’s attacks were admittedly tyrannical, but her opponent’s defense was also impenetrable.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Both fights sunk into a stalemate. These two masked Spirit Sages were apparently aiming at Liu Erlong and Flender. Even if their spirits didn’t counter the two great powers of Shrek Academy, delaying them wasn’t a problem.</p><br/><p>In a battle on the level of Spirit Saints, both sides could use a large quantity of spirit abilities. Defeating an opponent at a similar level wasn’t so easy.</p><br/><p>The masked Spirit Douluo’s gaze fell directly on Tang San, the gaze in his eyes like a vulture. His mouth issued a long cry, soaring into the air, he directly pounced at the altogether eleven Shrek Academy people.</p><br/><p>The two Spirit Kings basically didn’t move, leaving the attacking entirely to him.</p><br/><p>Golden light erupted from the black clothed masked Spirit Douluo, his arms shaking in the air, transforming into golden wings. Even more tremendous golden light formed light and shadows behind him, his black clothes being replaced by golden feathers, the true face of his spirit was revealed.</p><br/><p>It was unexpectedly a golden giant eagle.</p><br/><p>At the same time as the wings formed, both his arms separated from the wings, becoming two sharp eagle talons. At the same time his body began to contract and change, becoming closer and closer to the golden eagle illusion behind him.</p><br/><p>The Shrek Seven Devils’ faces changed. Even though the formidable pressure in the air wasn’t enough to make them collapse, this Spirit Douluo was using his seventh spirit ability, Spirit Avatar, from the start. He was clearly aiming to finish it quickly.</p><br/><p>Run? Confronting a flying Spirit Master, running was easier said than done. It would be impossible even with Oscar’s flying mushroom sausage.</p><br/><p>Eight spirit rings shone brilliantly, three yellow, two purple, and three black. A fairly good spirit ring configuration.</p><br/><p>Even though it wasn’t ideal, it was still enough to amaze.</p><br/><p>The black light of the seventh spirit ring curled over the golden body, appearing frightful, powerful. At this moment, the Shrek Seven Devils lost all hope in luck. What they thought to do, could do, was only fight with their full strength.</p><br/><p>Nobody could save them, except for they themselves.</p><br/><p>The light of spirit rings flared from the Shrek Seven Devils simultaneously.</p><br/><p>Tang San waved his hand at Tai Long’s quartet, hinting they should leave at once. These people were after all not part of the Shrek Seven Devils. Confronting a Spirit Douluo, their presence wasn’t significant. Rather than losing their lives here in vain, it would be better to escape.</p><br/><p>Strangely, those two Spirit Kings didn’t block the four from retreating. However the four didn’t go far, all condensing their spirit power.</p><br/><p>“What skill is there in bullying children? Long time no see, brother eagle.”</p><br/><p>An aged voice echoed, a gentle aura covering the Shrek Seven Devils. The pressure from the Spirit Avatar immediately vanished. The seven people looked in the direction of the voice with relief.</p><br/><p>A slim old man had at some point already appeared, standing some distance away, a more than four meter long stick held casually in his hands. Right now raising his head to look at the Spirit Avatar Golden Eagle in midair, his face was serious.</p><br/><p>Eight spirit rings glittered equally around him.</p><br/><p>The Shrek Seven Devils unexpectedly all knew this elder. It was precisely the one they encountered while hunting for third spirit rings, Dragon Duke Meng Shu.</p><br/><p>At that time, Dragon Duke and Serpent Grandmother had given them considerable inconvenience. If they hadn’t responded appropriately, the trouble would have been greater. Tang San used his own strength to vanquish the opponent. But they hadn’t expected to actually encounter him here.</p><br/><p>Now Tang San recalled that Meng Yiran was also competing in the tournament, with the Cryptid Academy team. At the time of Shrek Academy’s fight with Cryptid Academy, Tang San hadn’t participated because of his injuries, and had already forgotten about the matter with Meng Yiran. But now he met Dragon Duke again.</p><br/><p>The pupils of the golden eagle in the air contracted,</p><br/><p>“Meng Shu. You’d best not get involved in this matter.”</p><br/><p>Dragon Duke smiled calmly,</p><br/><p>“You’re the one looking for trouble, not me. My granddaughter is also a competing student, do you think I wouldn’t look after her safety? I didn’t expect that brother eagle would actually also become a bandit. Truly worthy of congratulations!”</p><br/><p>His words brimmed with satire.</p><br/><p>By now everyone could see that these black clothed people absolutely weren’t bandits. If bandits could have Spirit Douluo overseers, then wouldn’t the world be in upheaval?</p><br/><p>The golden eagle snorted coldly,</p><br/><p>“Meng Shu, you really want to go against us? Consider the consequences. This isn’t something you can get involved with.”</p><br/><p>A severe light flashed in Dragon Duke’s eyes,</p><br/><p>“You think to scare me? Roldiarra[1], others fear you, but I don’t. If you have the skill then deal with this old man first. Otherwise, don’t think about leaving here today.”</p><br/><p>The golden eagle’s gaze roamed, its eagle’s vision undoubtedly extremely sharp. He immediately found another person wielding a staff on the battlefield. Serpent Grandmother Chao Tianxiang.</p><br/><p>Having already reached the Spirit Sage realm, Serpent Grandmother was right now holding off the attacks of two fiftieth ranked Spirit Kings by her own strength. Sensing the gaze in midair, she also coldly returned it.</p><br/><p>Roldiarra inwardly thought that if it was only one of Dragon Duke or Serpent Grandmother, he could absolutely fight as their attributes restrained each other. His spirit had a restraining effect on both these elders.</p><br/><p>However, when Dragon Duke and Serpent Grandmother were together, they weren’t something he could confront. Their spirit fusion ability, Serpent Dragon Joint Assault, had long since reached perfection, able to contend even against Title Douluo, let alone him.</p><br/><p>Roldiarra issued a sharp bird call, the ear piercing sound breaking the air.</p><br/><p>Dragon Duke Meng Shu’s complexion changed slightly,</p><br/><p>“You still had companions?”</p><br/><p>Roldiarra laughed coldly,</p><br/><p>“Meng Shu, I advise you to quickly bring Serpent Grandmother away. We won’t harm your granddaughter. If you don’t leave, once you want to, you won’t be able. I’m just the messenger.”</p><br/><p>Dragon Duke’s complexion recovered to normal, but his heart was filled with raging waves. Of course he knew where this Roldiarra came from, but he had never mentioned his counterpart’s identity precisely to leave a life line. Otherwise if he made it clear, he would inevitably not be allowed to die even if he wanted.</p><br/><p>Looking at Roldiarra’s unruffled appearance, the thought of retreat was already growing in his heart.</p><br/><p>The only reason he had appeared was that he couldn’t bear watching a Spirit Douluo bully a group of Spirit Ancestor children. But there wasn’t any relationship between him and Shrek Academy, and naturally there was no reason for him to risk his life.</p><br/><p>“Roldiarra, the longer you live the more you regress. Can you really not settle such a simple task?”</p><br/><p>A feminine voice came from the distance. When he spoke Roldiarra’s name he was still in the distance, but when he spoke the final word, his silhouette had already quietly appeared in front of everyone.</p><br/><p>It was still a masked man, his age couldn’t be seen, nor heard from his voice. However his clothes weren’t black, but rather all white.</p><br/><p>Tang San and the others didn’t feel anything at the appearance of this person, but Meng Shu on the contrary gave a muffled groan, quickly retreating a step, his facial expression changing enormously.</p><br/><p>“Old man.”</p><br/><p>Serpent Grandmother Chao Tianxing swiftly caught up, one hand still dragging her granddaughter. The imposing manner of husband and wife fused together, then able to ward off that incorporeal pressure.</p><br/><p>The white clothed person gave a monstrous laugh,</p><br/><p>“So it’s old friends, no wonder Roldiarra couldn’t handle it. Long time no see, Unrivalled Dragon Serpent couple. You have some guts to force this one[2] to make an appearance.”</p><br/><p>Dragon Duke’s face grew extremely heavy,</p><br/><p>“You actually came as well.”</p><br/><p>The white clothed man spoke with that feminine voice:</p><br/><p>“Seeing as I’ve also appeared, why don’t you quickly get lost. You should understand the importance we attach to this matter.”</p><br/><p>“Fine.”</p><br/><p>Dragon Duke agreed with extraordinarily quickly, turning and leaving with Serpent Grandmother, unexpectedly without even pausing.</p><br/><p>Meng Yiran looked at her grandfather with astonishment, and was just about to say something when she was stopped by a strict look from Meng Shu. When she looked at Tang San again, her eyes were brimming with regret. The Unrivalled Dragon Serpent brought Meng Yiran along, and in a few leaps they were already out of sight.</p><br/><p>The white clothed man’s gaze turned to the Golden Eagle in the air, somewhat impatiently saying:</p><br/><p>“Deal with them immediately, or could it be you want me to do it?”</p><br/><p>“Yes, lord.”</p><br/><p>The enormous pressure once again pervaded the Shrek Seven Devils.</p><br/><p>Making the Shrek Seven Devils shocked and heartbroken was an aura with a special fragrance filling the air from that white clothed man. The instant it spread over them, the seven were unexpectedly unable to move, and even unable to use their spirit power.</p><br/><p>Scaring off the Unrivalled Dragon Serpent, what did that prove? Shouting at a Spirit Douluo, what did that mean? All kinds of signs explained the strength of this white clothed person.</p><br/><p>Just when that golden eagle was about to pounce, reaping the lives of the Shrek Seven Devils, a golden red ray of light suddenly shot out from Xiao Wu. The seven people were once again relieved, recovering the ability to move.</p><br/><p>Dai Mubai and Ma Hongjun roared practically simultaneously, third spirit abilities launching simultaneously. White Tiger Vajra Transformation, Phoenix Ascension.</p><br/><p>Tang San’s Spider Web Restraint flew out, going straight for the golden eagle, Oscar swiftly manufactured his sausages, the Nine Treasure Glazed Tile Pagoda in Ning Rongrong’s hand simultaneously emitted rays of light, Three Aperture Managing Heart unleashing, separately boosting Dai Mubai and Ma Hongjun’s attack, and Tang San’s spirit power.</p><br/><p>The tacit understanding and teamwork of the Shrek Seven Devils made even the white clothed man stare blankly a moment.</p><br/><p>“Hold on.”</p><br/><p>The white clothed man lightly waved his right hand, a surge of violent energy fluctuations making the air distort, nine spirit rings glinting dully over him. Under the effect of that enormous spirit power, the swooping golden eagle was unexpectedly blasted flying.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>The white clothed man’s gaze focused on Xiao Wu,</p><br/><p>“You could actually break my Aura Binding Realm.”</p><br/><p>His nose twitched. His face couldn’t be seen, but the expression in his eyes was somewhat stunned,</p><br/><p>“Yearning Heartbroken Red. It’s actually the smell of Yearning Heartbroken Red. You obtained the acknowledgement of the Yearning Heartbroken Red?”</p><br/><p>The white clothed man clearly became extremely excited, appearing in front of Xiao Wu in practically just a flash, raising a hand to directly grab Xiao Wu’s chest.</p><br/><p>Sonorous metallic cracks exploded like rain hitting palm leaves from the Shrek Seven Devils, countless old lights interweaving and simultaneously covering that white silhouette.</p><br/><p>The hidden weapons they used when two Spirit Sages and a Spirit Douluo appeared were already ready. Seeing the opponent about to harm Xiao Wu, they immediately used them.</p><br/><p>The white clothed man sneered, half turning in midair, a faint yellow light forming into a disc. Each hidden weapon that entered the range of that yellow light turned into pieces and disappeared. The next instant, his hand already stopped one cun in front of Xiao Wu’s neck, but he didn’t grab.</p><br/><p>Xiao Wu was the closest to him, and could clearly feel the white clothed man tremble. That should be the mood of extreme agitation.</p><br/><p>Title Douluo. This white clothed man appearing in front of them was undoubtedly one of the peak existences of the Spirit Master world, a Title Douluo.</p><br/><p>But right now he was unexpectedly this excited.</p><br/><p>The Shrek Seven Devils didn’t move. They all knew that Xiao Wu’s life was already completely in the hands of this white clothed man. As long as this white clothed man twitched a finger, Xiao Wu, completely locked down by him, would immediately die like a fading fragrance.</p><br/><p>Tang San’s clothes were practically instantly soaked with sweat. It was difficult to express the panic spreading in his heart. He would prefer the threat of death be aimed at him before any harm came to Xiao Wu.</p><br/><p>Eight Spider Lances broke through his back under the effect of his panic, a Yama’s Invitation already snugly fitted into Tang San’s palm.</p><br/><p>Tang San knew that he would only have one chance to act. Moreover, the opponent was still a Title Douluo. With his present spirit power, there was practically no chance of success for Yama’s Invitation against a Title Douluo. But, how could he just blankly watch Xiao Wu’s death at the hands of the enemy?</p><br/><p>Drawing a deep breath, the white clothed man’s hand never struck. Muttering to himself,</p><br/><p>“Why, why wasn’t I the one to obtain the Yearning Heartbroken Red? If I had the Yearning Heartbroken Red, I could also, I could also reach that realm. Little miss, give me the Yearning Heartbroken Red to look, may I?”</p><br/><p>His voice trembled, and appeared even more feminine. Even his expression completely lacked hostility.</p><br/><p>How could Xiao Wu refuse? Stretching a hand into her chest, she cautiously and solemnly drew out her Yearning Heartbroken Red.</p><br/><p>The brightly colored glistening big flower revealed that golden red luster, and the white clothed man’s expression immediately turned stupid. This was the immortal treasured he had yearned for even in his dreams. The most useful immortal treasure to him. If he could obtain this Yearning Heartbroken Red, he would have the chance to ascend another stage.</p><br/><p>But he knew that it was impossible for him. The Yearning Heartbroken Red’s property was determination, in its life it could have only one owner. Since it had approved of Xiao Wu, it would never change. To other people, it was an incomparably indestructible object, even with Title Douluo level spirit power one couldn’t hope to break it.</p><br/><p>The Shrek Seven Devils were also very shocked, they hadn’t expected this one Yearning Heartbroken Red to temporarily give their lives reprieve.</p><br/><p>However, the crisis still hadn’t been resolved. In front of one Title Douluo and one Spirit Douluo, what could they do?</p><br/><p>The white clothed man’s hands wanted to caress the Yearning Heartbroken Red, but when his hand was only half a chi to the Yearning Heartbroken Red, the golden red light on the Yearning Heartbroken Red abruptly brightened, scaring him to swiftly withdraw his hand.</p><br/><p>“Worthy of being an immortal treasure among immortal treasures. Yes, I shouldn’t offend your nobility.”</p><br/><p>The white clothed man unexpectedly bowed to the big flower in Xiao Wu’s hands. The infatuation in his eyes basically couldn’t be described in words.</p><br/><p>For some reason, from this person, Dai Mubai unexpectedly felt a somewhat cordial aura. He also didn’t know why he would have this kind of feeling, but he could be certain that he absolutely didn’t know this Title Douluo.</p><br/><p>The white clothed man sighed, turning and stepping to the side. He said,</p><br/><p>“Roldiarra, the rest don’t matter, but you’re not allowed to do anything to this girl. After so many years, the legendary flower king of immortal treasures has finally appeared, and moreover recognized its master. I hope to guard her forever.”</p><br/><p>Roldiarra cried harshly once again. He was actually also rather depressed, first stopped by Dragon Duke, then again by this lord Title Douluo. Now that he could finally act, how would he hesitate further? Golden light filling the air, he swooped down in an instant.</p><br/><p>“Go die.”</p><br/><p>As captain, Dai Mubai was the first to leap up, the golden light over his body suddenly intensifying and completely fusing together with his body.</p><br/><p>The third spirit ability, White Tiger Vajra Transformation, had already been launched before, and now he even further directly launched his fourth spirit ability, White Tiger Meteor Shower.</p><br/><p>Since being injured last time, Dai Mubai was shocked to discover that has he healed, it seemed that his whole body had become even more durable than before.</p><br/><p>He didn’t know that after being injured, suffering the influence of external forces, the effectiveness of the Singular Velvet Sky Chrysanthemum within him had fused even further with his body, imperceptibly altering every part of him.</p><br/><p>Right now, as Dai Mubai’s unleashed his all out attack, his own spirit power unconsciously merged with the Singular Velvet Sky Chrysanthemum, unleashing his vajra body, making his attack and defense reach an unprecedented level.</p><br/><p>“Yi?”</p><br/><p>The white clothed man already prepared to wait to the side for the results suddenly turned back, his gaze at Dai Mubai brimming with astonishment.</p><br/><p>“Hold on again.”</p><br/><p>Nine rings reappeared, another slap. The filled with power Spirit Douluo Roldiarra once again slapped into the air.</p><br/><p>“Lord, you……”</p><br/><p>Roldiarra was already depressed to death. If it wasn’t for this being a Title Douluo obstructing him, perhaps he would already have thrown himself all out at the counterpart. No matter what was said, he was still a Spirit Douluo level power. Moreover right now he had constantly maintained Spirit Avatar, something that required enormous amounts of spirit power.</p><br/><p>Restrained people would be angry. Being blocked three times in a row, he was also on the verge of collapse.</p><br/><p>However, that white clothed man didn’t seem to even hear his voice. Flashing, one palm swatting Dai Mubai’s unleashed White Tiger Meteor Shower. He was really too fast, Dai Mubai and the Shrek Seven Devils basically didn’t have enough time to react before at least seven palms had landed on Dai Mubai.</p><br/><p>They separately struck his neck, both arms, both legs, chest and back.</p><br/><p>Dai Mubai basically didn’t have any margin to resist, only feeling a burst of feverishness, and the golden light issuing from his body immediately became even richer, moreover distributing a bizarre scent.</p><br/><p>Infused with those seven streams of heat, Dai Mubai clearly felt his body apparently change somehow. The spirit power within his body surged wildly, his spirit power apparently increasing comprehensively. Not only didn’t he feel unwell, but his whole body still felt extremely comfortable.</p><br/><p>What was he doing? Dai Mubai was brimming with mistrust.</p><br/><p>The white clothed Title Douluo’s mood once again became excited,</p><br/><p>“Singular Velvet Sky Chrysanthemum, unexpectedly it’s really the Singular Velvet Sky Chrysanthemum. Did you eat this immortal treasure?”</p><br/><p>Not only Dai Mubai was startled, Tang San also couldn’t keep his pupils from contracting. He hadn’t expected that this world would still have someone who could recognize an immortal treasure like the Singular Velvet Sky Chrysanthemum.</p><br/><p>The white clothed Title Douluo spread his right palm, a faint yellow stream of air appearing in the center of his palm, the yellow light gradually changing, turning purple, and in the center of that purple was still a speck of gold.</p><br/><p>The purple light pervaded the air, growing a massive chrysanthemum. The chrysanthemum was a magnificent purple, and bizarrely, each petal of the chrysanthemum appeared to be fuzzy and cute, blending into each other, without any fragrance spilling out. The stamen at the center of the petals was more than half a chi high, glittering with a faint golden light.</p><br/><p>Dai Mubai’s gaze was sluggish. He discovered that the plant appearing in the palm of this Title Douluo, wasn’t it precisely the Singular Velvet Sky Chrysanthemum Tang San gave him to take?</p><br/><p>“What you took, wasn’t it like this?”</p><br/><p>The Title Douluo asked practically impatiently.</p><br/><p>Dai Mubai nodded without the slightest hesitation. Seeing this immortal treasure that substantially improved his strength again, he was already unable to deal with the opponent’s hostility.</p><br/><p>The white clothed Title Douluo loosed a long breath,</p><br/><p>“Then it’s right. No wonder your body would have that kind of radiance. Roldiarra, you can’t harm this young man either, fate brought him together with me. Kid, are you willing to take me as master? With your talent, and further adding taking the Singular Velvet Sky Chrysanthemum, your future accomplishments won’t be below mine.”</p><br/><p>Right now Roldiarra didn’t know whether to laugh or cry. He’d always known this lord was strange, but accepting a disciple in this kind of situation, that was something he had never expected in a million years.</p><br/><p>A Title Douluo wanted to take Dai Mubai as disciple, and moreover told him he could become a person on the level of a superpower in the future. To common Spirit Masters, this was something they yearned for even in their dreams.</p><br/><p>With a teacher like this, not only would there be a layer of protection, the benefits to cultivation also couldn’t be doubted. The directions of a Title Douluo were an immense lure to any Spirit Master.</p><br/><p>But, would Dai Mubai agree?</p><br/><p>[1] ()</p><br/><p>[2] He refers to himself as (), a personal pronoun used by characters with great mystical power in myths and fantasy fiction.</p><br/>\n</div>"}