{"title": "Chapter 111", "id": 111, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-111", "volume_title": "Volume 2", "body": "<h1>Chapter 111</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 111</p><br/><p>Fusion of Spirit Ability and Tang Sect Secret Techniques</p><br/><p>Part 1 (TL by Marcuz)</p><br/><p>The concentrated yellow specks of lights instantaneously rushed into the golden red light radiating from Xiao Wu, what surprised both parties was that once the yellow lights entered the light protecting Xiao Wu, they disappeared like moths flying into a flame.</p><br/><p>Not only did it not have the slightest effect, instead it even strengthened the light surrounding Xiao Wu, increasing its thickness from the original three cun[1] to slightly more than one chi[2], instantly wiping out the lights that were attacking her.</p><br/><p>At the same moment, an extremely unusual aura was suddenly released from Xiao Wu’s body, suddenly expanding the golden red light. Although the light got dimmer the further the distance, it still easily covered the opponent.</p><br/><p>The referee was also encompassed within the light and he did not feel anything weird. however, it was a different story for Xiao Wu’s opponent. Within the golden red light, he felt as though he was fighting against a Title Doulou.</p><br/><p>All his spirit power instantly lost its effect, and the sunflower in his hand quietly withered in the light.</p><br/><p>Xiao Wu was also shocked as the situation became one where she no longer needed to do anything. Along with the withering of the opponent’s sunflower, the warm flow within her body also gradually disappeared. In a short moment, it completely disappeared and the dazzling bright golden red radiance faded away.</p><br/><p>The match started normal but ended weirdly. Compared to the explosive first match, this one gave people an even more unbelievable feeling. Xiao Wu who was only a Spirit Elder managed to defeat two Spirit Ancestors. This result shocked everyone present. Just as Xiao Wu was dazed, Tang San’s soft voice rang in her ears, </p><br/><p>“No matter who asks, just reply that you do not know why the golden red glow appeared. Keep silent and maintain a sense of mystery. Leave the rest to me.”</p><br/><p>At the same time, there was also a discussion going on in the VIP seats. Emperor Xue Ye looked towards Ning Fengzhi with astonishment, but Ning Fengzhi shook his head, indicating that he didn’t know what the golden red glow was.</p><br/><p>Platinum Bishop Salas however, spoke, </p><br/><p>“I didn’t expect Shrek Academy to actually still have someone who owns a spirit bone. This should be their hidden strength.”</p><br/><p>Spirit bone?</p><br/><p>Emperor Xue Ye and Ning Fengzhi both revealed looks of agreement. From their perspective, that was the best explanation. Xiao Wu didn’t take out any spirit tool, and that golden red glow was obviously not an ability that a spirit tool should have. It would be most reasonable to think that that was a spirit bone ability.</p><br/><p>Emperor Xue Ye took a deep breath. </p><br/><p>“However, that spirit bone ability seems rather too strong. It made the opponent’s spirit wither instantly. If looking purely at spirit power, this student from Balak Academy seems to be more seriously injured than the previous one.”</p><br/><p>Ning Fengzhi smiled faintly. </p><br/><p>“Your majesty might not be aware, but if I guess correctly, this ability of Xiao Wu’s has a specific target, it does not work on every spirit. Maybe, only plant type spirits will be countered by it, perhaps the range might be even narrower.” </p><br/><p>As the Seven Glazed Tile School master and the world’s number one support type Spirit Master, Ning Fengzhi’s knowledge was obviously bountiful. If the golden red glow Xiao Wu released worked on any spirit, wouldn’t that be unequalled under Heaven?</p><br/><p>In this rare moment, Salas did not argue with Ning Fengzhi and said: </p><br/><p>“I agree with School Master Ning. This should be an extremely normal spirit bone that only happened to coincide with the situation and was used to great effect. That doesn’t mean anything.”</p><br/><p>The referee was naturally suspicious about the golden red glow that radiated from Xiao Wu and asked her about it. But Xiao Wu wouldn’t say anything. Having no other solutions, the referee could only pass the judgment to the judging committee.</p><br/><p>By now, Emperor Xue Ye and the other two had already made their decision. From their perspective, it was perfectly normal for Xiao Wu to not say anything. After all, who would want to admit that they own a spirit bone? The victory for this match was unquestionably awarded to Shrek Academy. Xiao Wu scored two consecutive victories.</p><br/><p>The competition continued and making Shrek Academy not know whether to laugh or cry was that the later students sent out by Balak Academy were obviously unable to be compared to the first two. Xiao Wu successively defeated another three people before leaving the stage due to exhaustion of spirit power.</p><br/><p>The few Balak Academy students who later competed did not include any Spirit Ancestor above the fortieth rank.</p><br/><p>Xiao Wu’s perfect performance undoubtedly overshadowed every person who appeared in the previous two matches. Her five consecutive wins also made her rank the highest in terms of individual performance.</p><br/><p>Xiao Wu left the stage and was replaced by Tang San. Just as Balak Academy was about to feel relieved by Xiao Wu leaving the stage, they were once again frozen as Tang San released his spirit.</p><br/><p>Yellow, yellow, purple and black. Four spirit rings appeared at the same time. Despite being not conspicuous, the black spirit ring’s deep glow made the last two members of Balak Academy completely lose their fighting spirit.</p><br/><p>Tang San did not even have to take any action and Balak Academy automatically admitted defeat. After all, the competition has only begun and the earlier conflict raised the tension between the two academies. The teacher from Balak Academy did not wish to have insufficient members in the matches tomorrow.</p><br/><p>Shrek Academy also settled their match by sending only two members but from the way the matches played out, their performance was a cut better than Blazing Academy. Because of the that, Huo Wu sharpened her gaze at Tang San.</p><br/><p>After eating two recovery sausages, Xiao Wu’s spirit power gradually recovered, she practically could not stop herself from pulling Tang San who returned to one side and asked: </p><br/><p>“Ge, what was with that glow from my body earlier? Did you know about it?” </p><br/><p>If Tang San did not know, why would he warn her?</p><br/><p>Tang San faintly smiled and nodded while whispering in her ears what he concluded earlier. Xiao Wu, upon realization, reach out her hands and touched the Yearning Heartbroken Red that was always placed at her chest, indeed, the warm flow earlier had flowed into her body from this position.</p><br/><p>The first round of promotional matches ended perfectly for Shrek Academy, only Xiao Wu revealed her true strength while completely settling the match.</p><br/><p>Excluding the Four Element Academies, the other academies would at the most only know that Shrek Academy had a monster with a ten-thousand year spirit ring.</p><br/><p>In the later matches, the other three academies from Heaven Dou City also achieved victory. The result of five academies from Heaven Dou City being victorious made Emperor Xue Ye very satisfied. He immediately announced that all academies that were victorious would be awarded with one thousand gold spirit coins while academies that lost were still awarded with five hundred golden spirit coins.</p><br/><p>When the first day of matches were over, the dean from each academy went up on stage to draw lots, Shrek Academy’s luck was not very good. For their match on the second day, the opponent they drew was Blazing Academy which performed very well in the first match.</p><br/><p>Although it was a round robin system where every academy would eventually fight each other, the fact that they would face Blazing Academy this early created ripples in the minds of members from both academies.</p><br/><p>Returning to their camp, Xiao Wu herself returned to her room to rest as there was still a match tomorrow. She had expended quite a lot of spirit power today and had to recover as quickly as possible. Jiang Zhu accompanied her as her spirit could increase Xiao Wu’s recovery rate.</p><br/><p>Grandmaster gathered the members of Shrek Academy and asked straight to the point: </p><br/><p>“Your opponent tomorrow is Blazing Academy, in your opinion, what kind of line up should you be battling them with?”</p><br/><p>As the captain, Dai Mubai was the first to reply: </p><br/><p>“Grandmaster, although Blazing Academy’s strength is abnormal, they are actually one of the weakest among the Four Elemental Academies. Only the Huo Wushuang and Huo Wu siblings are stronger, the other members will find it difficult to threaten us. Given the situation in today’s matches, at least one of the Huo Wu Shuang and Huo Wu siblings would go first to get as many victories as possible. The rest of the members will then aim to deplete our spirit power. Why not let me go first tomorrow and little San cover the rear. This will ensure our victory.”</p><br/><p>Grandmaster said: </p><br/><p>“Mubai isn’t wrong. However, there is something I should remind you all. The qualifiers were the qualifiers after all, even now in the promotion matches, each team might still not be using their full strength. It’s not only us who are hiding our true strength, others will also use the same plan. The Shrek Seven Devils contain two support spirit masters, the others’ strength are relatively balanced. Tang San and Mubai are slightly ahead. In this competition, you are not only here to win, the more important thing is to train. Train your strength and mentality. What you can think of, your opponents will naturally also be able to. Today, what I want to teach you all is to surprise your opponents. Revealing a hand that defies common sense will make it easier to break your opponent’s tempo. Therefore, for tomorrow’s battle, little San will go first, followed by Ma Hong Jun, Zhu Zhuqing, Xiao Wu and Mubai.”</p><br/><p>Similar to today’s match against Balak Academy when Grandmaster announced three names, he had only announced five names. Evidently, this was the line up that he believed was sufficient to achieve victory.</p><br/><p>Among the five, only Ma Hong Jun has not appeared on stage before, Grandmaster had his purpose for sending him out now this time. Ma Hong Jun hadn’t been sent out before since the mission he was given by Grandmaster was to train.</p><br/><p>Letting him take part in real battles now was in order to let him fight against opponents from other academies and find the tempo of the competition now rather than during the finals.</p><br/><p>As for Oscar and Ning Rongrong, both were support type spirit masters, they would be fine as long as they were compatible with their teammates. They would stay hidden. Promotion matches were still not for them to participate in.</p><br/><p>……</p><br/><p>A quiet night.</p><br/><p>The tempo of the promotion matches was faster than the qualifiers, without common spectators, only the competition results were desired. Having removed the complicated processes and the noisy audience, it allowed spirit Masters to bring out their true strength more easily.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Shrek Academy versus Blazing Academy was the fifth match, but before the match had even started, Tang San could already feel the burning hot gaze aimed directly at him from not far away.</p><br/><p>Tang San didn’t look at Huo Wu, as he didn’t want to display any aggression. He only quietly watched the matches in the ring, especially Godwind Academy and Thunderclap Academy. They hadn’t encountered these academies before, and being about to fight them in the ranking competition, he had to observe them carefully.</p><br/><p>Through observation, Tang San discovered that, apart from the four elemental academies, there were still another two academies who were also powerful. One was called Syras Academy, and one was called Botanic Academy.</p><br/><p>Syras Academy was still well, with strength apparently not much different from the four elemental academies, with three students over fortieth rank. But Tang San was unable to make sense of that Botanic Academy. All the competing members of this academy had plant spirits, and moreover they were all somewhat strange plants. From the start of the competition until now, only three of their members had appeared in the ring.</p><br/><p>Of course, this was also because they hadn’t encountered any strong opponents. Even though the students that had appeared were all thirty something ranked, Tang San still saw that this Botanic Academy’s members were all unexpectedly control system Spirit Masters. Under such circumstances, they wouldn’t be at a disadvantage even against fortieth ranked opponents. Relying on three thirty something ranked Spirit Elders, this academy had already obtained a record of two successive victories.</p><br/><p>Botanic Academy’s display was very low key and they didn’t use any dazzling spirit abilities, but the more so they did, the more complex Tang San felt they were.</p><br/><p>At last it was time for Shrek Academy and Blazing Academy to go up.</p><br/><p>When Tang San was the first to walk into the ring from Shrek Academy, the students on Blazing Academy’s side all immediately revealed stunned expressions.</p><br/><p>The first to go up from Blazing Academy was Huo Wushuang, and just like Dai Mubai had estimated, the last to go up was Huo Wu.</p><br/><p>Seeing Tang San was the first to walk into the competition grounds, Huo Wu shot up from her seat, her ample chest heaving constantly, light flashing in her eyes. If the competition rules didn’t prohibit changing the order once submitted, she would definitely be the first to go on up.</p><br/><p>‘Why? Why are you first?’ Huo Wu screamed in her heart.</p><br/><p>In the month since the end of the qualifiers, she had cultivated as if torturing herself. And she had also made some breakthrough, not only did her spirit power go up one rank, but her spirit ability application and all round capabilities had also improved. And all this, was to take revenge on Tang San.</p><br/><p>But right now Tang San was the first Shrek Academy member to walk out. Even if he was even stronger, Huo Wu still wouldn’t believe he could last until the fight with her. Could it be her opportunity for revenge would disappear? She was unwilling.</p><br/><p>But with the competition rules in place, she was left helpless. She couldn’t have her big brother and all the others give up on the match.</p><br/><p>After all, she also had to consider the whole team.</p><br/><p>Huo Wushuang stood confronting Tang San, his facial expression very heavy. Originally he had thought that after the five successive victories yesterday, Xiao Wu would still be the first to go up, and he had prepared accordingly.</p><br/><p>But the one to appear in front of him was the one who had given him the deepest impression, Tang San. This already formed a small crack in Huo Wushuang’s resolve.</p><br/><p>He knew that with Tang San’s spirit control capability and fire immunity, it would be very difficult for him to obtain the desired outcome. Fire immunity was really a far too great restriction on his strength.</p><br/><p>Tang San’s expression was still calm, that was true no matter what opponent he confronted. Along with the referee announcing the start of the match, he made an inviting gesture to Huo Wushuang.</p><br/><p>The two completed their spirit release in practically the same moment. Tang San raised his right hand in front of him, and five cun[3] of Blue Silver Grass grew in his palm, flickering softly. If it wasn’t for those four dazzling spirit rings being a clear manifestation of his strength, nobody would have believed that this no more than five cun Blue Silver Grass would actually have such astonishing strength.</p><br/><p>Not only Blazing Academy, but those students from the kingdom and duchy academies, as long as they weren’t going to participate in a match, practically all their gazes fell on this fight between Huo Wushuang and Tang San.</p><br/><p>One was from a traditionally powerful team, one had a ten thousand year fourth spirit ring, this fight was destined to be marvellous. At the same time, these academies all wanted to see just how powerful Tang San actually was.</p><br/><p>Scales appearing on his skin, blazing flame shot up instantly, then was extinguished in another eyeblink. Huo Wushuang was covered in a layer of deep red, a short horn protruding from his forehead, about three cun[4] long. That was his spirit, Single Horned Fire Tyrant Dragon.</p><br/><p>Watching the process of Huo Wushuang releasing his spirit, Tang San’s expression couldn’t help turning serious. The release of flame was normal, but its later restraint was clearly different from the team battles last time. By Huo Wushuang’s calm and composed appearance, he had clearly thought of a way to deal with him.</p><br/><p>Different from ordinary confrontations between power attack system Spirit Masters and control system Spirit Masters. this time it was Tang San who charged first.</p><br/><p>Tang San’s feet shifted, and he seemed to float out. His movements didn’t seem fast at all, but with that illusory pace, he approached Huo Wushuang in only a few eyeblinks.</p><br/><p>A control system Spirit Master focusing on assault? Nobody could imagine it.</p><br/><p>Huo Wushuang’s first spirit ring already brightened in a flash, that layer of deep red scales covering his body instantly turning sparkling and translucent, covering him like a layer of armor. But his body didn’t move, only his eyes rigidly watched Tang San’s rapid approach.</p><br/><p>What Huo Wushuang hadn’t expected was that the Blue Silver Grass Binding he had prepared for didn’t hit him, but Tang San still rushed closer, without using any spirit abilities.</p><br/><p>Huo Wushuang was unable to hold back, both hands fiercely meeting in front of his chest. Deep red light rushed out between his palms, instantly condensing into a palm-sized sphere.</p><br/><p>There still wasn’t any sign of flame, so much that there wasn’t even a trace of heat, but just as his gaze locked on Tang San, the deep red ball of light shot out, flying straight for Tang San.</p><br/><p>Just as the two sides were about to clash, Tang San’s foot suddenly slid, dodging the strike of the red sphere of light at the edge of danger. By now, he was already less than five meters from Huo Wushuang.</p><br/><p>Clearly, Huo Wushuang’s attack wouldn’t be that easy to dodge. Even though he had avoided the first attack, that ball of light immediately changed direction, directly chasing after Tang San.</p><br/><p>A faint smile at the corners of his mouth, the Blue Silver Grass in the palm of Tang San’s right hand abruptly surged out. Only one strand, thick as a baby’s arm, grew to three meters long in the blink of an eye. It didn’t bind, but rather directly whipped out at Huo Wushuang. At the same time, a cluster of Blue Silver Grass rose behind Tang San’s back, weaving together into a great net in the air, rigidly blocking the ball of light.</p><br/><p>The next moment, astonished expressions appeared on both sides’ faces.</p><br/><p>The deep red ball of light vanished with a violently explosive sound, and the net covering it was also subsequently torn to pieces. But the Blue Silver Grass Tang San swung also closed in on Huo Wushuang.</p><br/><p>Huo Wushuang finally moved. He didn’t pay any attention to the Blue Silver Grass striking at his body, but rather went out to meet Tang San.</p><br/><p>The Blue Silver Grass accurately lashed Huo Wushuang’s shoulder, but with an explosive blast, that strand of Blue Silver Grass was unexpectedly directly destroyed. At the same time, Huo Wushuang and Tang San were already within reach of each other.</p><br/><p>With Tang San’s plentiful combat experience, he was aware of where the problem lay in a split second.</p><br/><p>Indeed, his Blue Silver Grass was really immune to ice and fire, but it wasn’t immune to energy attacks. Blazing Academy’s method to deal with him was very simple. Restraining their fire attribute attacks, and replacing them with another kind of attack method.</p><br/><p>Huo Wushuang didn’t just have blazing heat, but also explosions.</p><br/><p>Huo Wushuang compressed his fire attribute spirit power as far as possible, afterwards releasing it the moment both sides came into contact, creating an explosive force.</p><br/><p>Like this, even though the fire attribute didn’t have any effect, that explosive force was still dreadful.</p><br/><p>Blazing Academy really deserved their reputation as one of the five great elemental academies. Whether it was the teachers or the outstanding students, finding a way to deal with him in such a short period of time really wasn’t average.</p><br/><p>‘But, can this defeat me?’ The smile at the corners of Tang San’s mouth still hadn’t disappeared. ‘You’ve improved, then can’t I also?’</p><br/><p>Confronted with Huo Wushuang’s strike, Tang San knew that as long as he came into contact with the opponent’s body, the successive explosions from that deep red scale armor would injure him seriously. Spirit power condensed to this degree wasn’t something his Blue Silver Grass could withstand right now.</p><br/><p>After all, they were both forty second ranked Spirit Masters, but from the start of the battle until now Huo Wushuang had invested far more spirit power than Tang San. In coordination with that brimming with masculine aura Single Horned Tyrant Dragon Spirit, it really gave a feeling of sweeping everything before it.</p><br/><p>Using explosions to counter him was no doubt the most proper choice, but unfortunately, Tang San’s control had already reached a whole new level in this short month.</p><br/><p>Confronted with Huo Wushuang’s frontal attack, Tang San didn’t retreat, but rather still charged ahead. The moment the two were about to collide, Huo Wushuang raised both fists simultaneously, blasting the empty air on either side of Tang San, as much as possible leaving him without anywhere to dodge.</p><br/><p>He believed that as long as he and Tang San got close enough, he would immediately regain the advantage. How could Blue Silver Grass compare to the Single Horned Tyrant Dragon?</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>But at this instant, Tang San’s dash suddenly came to a rigid halt. Equally raising both his hands, and moreover without releasing any Blue Silver Grass, both his palms met Huo Wushuang’s fists. With a slight shake of his wrists, both his arms moved in a splendid arc.</p><br/><p>Huo Wushuang immediately felt something amiss, as if his strength met a soft and flexible screen, the blasting power his fists were brimming with lacked any sensation of collision. Even more shockingly, after his scaled met with Tang San’s force they didn’t cause any explosions, but were rather pulled aside as if someone used their hands to pull him. Following the momentum of his fists, Huo Wushuang immediately stumbled.</p><br/><p>Tang San had disappeared just the instant Huo Wushuang lost his balance.</p><br/><p>The next moment, Huo Wushuang only felt a great force rush out behind him, and before he had time to react, his whole body had already been sent flying. His body issued a series of explosive sounds in midair, the result of him exploding the fire element contained in his scale armor.</p><br/><p>Unfortunately, his reaction was a beat too slow. Even though the explosive force was powerful, in midair it was basically unable to affect Tang San.</p><br/><p>This was the effect born of combining Ghost Shadow Perplexing Step with Controlling Crane Catching Dragon.</p><br/><p>In the days since, Tang San had thought of a great many things. He suddenly found that ever since gaining spirit abilities, he seemed to have forgotten a lot of extremely powerful capabilities. Indeed, spirit abilities were really useful, and moreover straightforward and simple. But in fact, how could his Tang Sect secret lore come out short in a comparison?</p><br/><p>As this world understood things, the Tang Sect lore he had cultivated from Mysterious Heaven Treasure Record were also each a kind of ability! Purple Demon Eye was one. Ghost Shadow Perplexing Step, Controlling Crane Catching Dragon, Mysterious Jade Hand, weren’t they all? Even if the hidden weapons Tang Sect knew best couldn’t be used, couldn’t he still use these?</p><br/><p>If the entire previous process could be slowed down, the whole course of Tang San’s actions could be seen clearly. Using Controlling Crane Catching Dragon to divert the opponent’s attack, Ghost Shadow Perplexing Step to dodge behind Huo Wushuang, Mysterious Jade Hand pushing with Controlling Crane Catching Dragon.</p><br/><p>Even though he had been hit by the explosive force, with the durability of Mysterious Jade Hand, this basically wouldn’t cause any injury, and Huo Wushuang’s body had already been swiftly pushed away.</p><br/><p>Seven strands of Blue Silver Grass, glittering with mauve light in the sunshine, fell from the sky like seven long rainbows.</p><br/><p>Right now Huo Wushuang had his back completely exposed to Tang San. He only felt a pressure in the sky, but couldn’t see just what attack it was. And the moment Tang San’s Blue Silver Grass chose to attack was just when the energy in his scales had just burst out, and his spirit power was still condensing, the awkward moment when he couldn’t use his next spirit ability.</p><br/><p>Control, this was still control, only that what was controlled were the details and precision. The details decided the outcome, and at this moment, Tang San used this instant to maximize his advantage.</p><br/><p>Blue Silver Grass struck Huo Wushuang’s open back without the least suspense, seven strands of Blue Silver Grass all whipped the same place. The first one already knocked Huo Wushuang from the air to the ground. From the second and onward, they caused intolerable pain to instantly spread through Huo Wushuang’s whole body. Bringing a paralysing and twitching sensation, all he could do was to swiftly roll over and leap up. But his back was already badly mangled.</p><br/><p>Don’t forget that Blue Silver Grass was seriously toxic, with the poison of the Man Faced Demon Spider as well as the thorns of the Ghost Vine. Having lost his protective scales, right now Huo Wushuang wasn’t only infected by the poison, but the violent pain moreover affected his spirit power aggregation and mental focus.</p><br/><p>Tang San’s expression was still serene, but he wouldn’t give his opponent any chance to recover his strength. Just as Huo Wushuang shot up and prepared to confront Tang San, something tightened about his feet. Without any warning, a strand of the most common Blue Silver Grass twisted around his ankles, tripping him over once again.</p><br/><p>In order to defend and counterattack, Huo Wushuang had just now condensed practically all his spirit power in his upper body. Once again on the ground, he needed time in order to use explosive force to free his bound feet.</p><br/><p>But, his body was already sent tumbling by the impetus of that Blue Silver Grass.</p><br/><p>This time, Huo Wushuang was thrown into the distance, and Tang San on the ground followed like an illusion. Twelve strands of Blue Silver Grass shot out with a swing of his right arm, still attacking the same spot.</p><br/><p>Blasting sounds rang out practically uninterrupted, blast after blast bursting out in the air. This time, Huo Wushuang already had a defense, but within explosion after explosion, the twelve strands of Blue Silver Grass successively smashed it. The pain of those bone piercing lashes as well as the shock of his own fire element explosions, left Huo Wushuang in such pain he wished he was dead, directly resisting a mouthful of blood reflux from spraying out in the air.</p><br/><p>Finally blocking the last strand of Blue Silver Grass, Huo Wushuang staked all his strength on controlling his feet to land, preventing being humiliated once again. At the same time he also impatiently erupted a series of attacks in midair, for fear that he would once again be bound by that ghost serpent like Blue Silver Grass.</p><br/><p>“You’ve lost.”</p><br/><p>Tang San’s attack didn’t reappear, what reached him was only that calm voice.</p><br/><p>Huo Wushuang now returned to his senses, staring, he couldn’t keep his face from going deathly pale. He now discovered that he was already outside of the ring, having fallen just one meter out of bounds.</p><br/><p>Now he understood the reason why Tang San lashed out with twelve strands of Blue Silver Grass after he had been thrown. It wasn’t to attack him, but rather to exploit the attacks of the Blue Silver Grass as well as the impulses of his own explosions to increase the distance he flew.</p><br/><p>Out of bounds, no matter the circumstances, meant defeat.</p><br/><p>Huo Wushuang looked at Tang San in a daze. He couldn’t accept it, and on the contrary he discovered that the feeling of defeat in his heart was so powerful.</p><br/><p>Confronting Tang San he hadn’t faced control, but rather his rigid offense. A control system Spirit Master’s precision, combined with the speed and strength of the agility attack system and power attack system.</p><br/><p>From the first moment of contact until the end, he hadn’t even been been able to stall for enough energy to launch his more powerful spirit abilities. But what Tang San used was at most only his first spirit ability, to the extent that it wasn’t even the whole first spirit ability.</p><br/><p>How much spirit power could he have consumed just by waving a few strands of Blue Silver Grass?</p><br/><p>Hidden weapons didn’t only include throwing types, but also mechanical types and the rare rope types. Tang San had just fully used the rope type methods on his own Blue Silver Grass.</p><br/><p>He had used it as early as the human meteor hammer before, but he had only truly recognized the importance of fusing his Tang Sect lore with his spirit abilities in his days of painful cultivation and while truly combining the two together.</p><br/><p>A forty second ranker versus a forty second ranker, and the winner’s spirit power consumption could practically be neglected. This was the result Tang San had obtained after bitter cultivation. He had proved his strength in real combat, making the Huo Wushuang who had originally thought he could make a fight of it lose before he could even use his full strength. So much that he couldn’t even use up some of Tang San’s spirit power.</p><br/><p>“You didn’t have any confidence when you faced me. If a Spirit Master doesn’t have confidence, how can he win?”</p><br/><p>Tang San’s words reached Huo Wushuang’s ears. When he looked at Tang San’s serene eyes, Huo Wushuang suddenly found that this clearly younger than him youth seemed to have become his teacher.</p><br/><p>By now Huo Wu had run over, grabbing Huo Wushuang’s arm, asking with a deeply concerned face:</p><br/><p>“Ge, are you alright?”</p><br/><p>Huo Wushuang shook his head,</p><br/><p>“I’m alright. I lost, lost by heart and word.”</p><br/><p>Huo Wu sharply raised her head, both her eyes seeming to shoot flames, fiercely burning at Tang San.</p><br/><p>Tang San’s gaze was still undisturbed. He looked at Huo Wu without any particular mood.</p><br/><p>The first fight ended like this. Even though the scene wasn’t as chaotic as the qualifiers, and wasn’t any applause or cheers, what Tang San revealed captured everyone present. Even Seven Treasure Glazed Tile School master Ning Fengzhi discovered that this child became more and more impenetrable. At such a young age, he already had some of the demeanor of a great family.</p><br/><p>Glancing at platinum bishop Salas next to him out of the corner if his eye, Ning Fengzhi was somewhat astonished to discover that Salas’ face was still calm, without any fluctuation to his mood because of Tang San’s display, as if he was only looking at the most common competition.</p><br/><p>The next matches seemed even easier for Tang San. He continuously calm and unhurried successively fought five Blazing Academy team members. Among them the twin brothers Huo Wun and Huo Yu had broken through from thirty ninth rank to fortieth rank.</p><br/><p>But nobody could make Tang San release his third spirit ability.</p><br/><p>Blazing Academy already possessed four spirit masters over fortieth rank, but six of them still couldn’t stop Tang San’s advance. His spirit power was still plentiful, and there wasn’t even a trace of exhaustion on his face.</p><br/><p>It was under such circumstances that Blazing Academy’s final team member, vice captain Huo Wu, walked gravely into the ring.</p><br/><p>One defeating six. Since the start of the ranking competition, this was the most outstanding score to appear. Moreover the six defeated people were still from the traditionally powerful and well known Blazing Academy, these were circumstances nobody could have imagined before the start of the match, but this was what really had happened.</p><br/><p>[1] 3 = 10 cm</p><br/><p>[2] 1 = ⅓ m</p><br/><p>[3] 5 = 17 cm</p><br/><p>[4] 3 = 10 cm</p><br/>\n</div>"}