{"title": "Chapter 113", "id": 113, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-113", "volume_title": "Volume 2", "body": "<h1>Chapter 113</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 113</p><br/><p>Phoenix Rampage</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>To the majority of the academies participating in the ranking competition, Tang San’s injuries were a good thing. Especially those teams that still hadn’t met Shrek Academy now had hope of a better record. However, starting from the second day, these academies discovered a changed Shrek Academy.</p><br/><p>When the person on stage changed, apparently their strength also changed.</p><br/><p>In the next three matches, Evil Eye White Tiger Dai Mubai relied on his violent burst attack method to settle at least four opponents each time. The second to appear was Zhu Zhuqing who ended the match. Even without Tang San, Shrek Academy still only brought out two people.</p><br/><p>As the days passed, Tang San’s recovery speed was even faster than the doctor had anticipated. His injuries had already knitted and scabbed in just three days, and he could also casually move about. He completely recovered like a lively dragon or animated tiger. But when Tang San expressed his desire to participate in the rest of the ranking competition, he suffered the unanimous opposition of the whole Shrek Academy group.</p><br/><p>Helplessly, Tang San could only turn from main force to observer. Today was already the sixth match. Shrek Academy had a complete victory record in the previous five fights.</p><br/><p>Shrek Academy’s opponent today was Botanic Academy, also that academy that Tang San couldn’t see through. Facing this academy, the formation Grandmaster arranged was entirely different from the before. The first three to go up were unexpectedly Huang Yuan, Jing Ling, and Tai Long.</p><br/><p>Not long after the start of this match, the people paying attention were gobsmacked. Because, in the previous three fights, Shrek Academy unexpectedly lost three times to one member of Botanic Academy. Botanic Academy only sent one team member who successively defeated Huang Yuan, Jing Ling and Tai Long.</p><br/><p>And this Botanic Academy student’s spirit was a kind of vine. Its effect was somewhat similar to Tang San’s Blue Silver Grass, only much thicker. Reaching the forty first rank in spirit power, with control system capability, he completely restrained Tai Long’s trio. Even though he consumed a lot of spirit power, he still defeated three people consecutively. This could still be called the greatest defeat of Shrek Academy since the start of the tournament.</p><br/><p>After the third person in succession, Tai Long, was firmly suppressed, the opponent said something that made the entire Shrek Academy team’s aura change.</p><br/><p>Having successively defeated three people, that Botanic Academy team member apparently forgot himself out of pride. After defeating Tai Long he said: Shrek Academy isn’t worth much.</p><br/><p>“Fuck, I can’t stand it. Watch me put them in their place.”</p><br/><p>Shrek Academy’s fourth person to go up, was precisely Ma Hongjun. Right now his chubby face was already swollen red, indignantly watching that rival Spirit Master in the center of the ring.</p><br/><p>Just at this moment, a broad hand landed on Fatty’s shoulder,</p><br/><p>“Have you clearly seen the opponent’s attack method? Your goal is their complete obliteration. Save some spirit power if you can.”</p><br/><p>Ma Hongjun turned his head to look, to discover that the speaker was Grandmaster. Spectating from the side, Tang San naturally understood. Grandmaster’s goal in letting Tai Long’s trio go out first was in order to clearly see the opponent’s fighting style. And his goal in letting Ma Hongjun go fourth was only one, attribute counter. Just like Blazing Academy originally wanted to counter Tang San’s Blue Silver Grass.</p><br/><p>When Ma Hongjun stepped up, that student who successively beat three Shrek Academy members almost laughed out loud.</p><br/><p>Even though Ma Hongjun wasn’t as fat as he was two years ago, he was still spherical, and his fleshy face was especially swollen, looking quite cute. Even though he wasn’t the youngest Shrek Academy student by age, he was clearly the youngest by appearance. Even more, in the previous competitions, Ma Hongjun had never appeared.</p><br/><p>Even the attention of the four elemental academies had never turned to Ma Hongjun. They would pay attention to Tang San, pay attention to Dai Mubai, Zhu Zhuqing, Xiao Wu, but never to a little Fatty.</p><br/><p>Having won three times in succession, even though the Botanic Academy team member on stage had consumed a lot of spirit power, his confidence had already reached its peak, and he basically didn’t attach any importance to Ma Hongjun.</p><br/><p>“Little fatso, you’d better step down. It wouldn’t be good if big brother injured you by some chance.”</p><br/><p>Even though his face was smiling, this Botanic Academy team member’s eyes clearly revealed contempt.</p><br/><p>The Shrek Academy group had been together for a long time, and their characters had also been influenced by their comrades, Fatty being no exception. Blinking, he raised an innocent appearance,</p><br/><p>“But, teacher let me go up, if I go down like this, I’ll be punished when I return. It would be better if big brother beat me down. Just go a bit easy on me.”</p><br/><p>“Fine, no problem. I won’t bully a child.”</p><br/><p>His words still hadn’t fallen before this three successive victory Botanic Academy elite had already opened his eyes wide. Because, over Ma Hongjun, he clearly saw four rising spirit rings, two yellow and two purple, an optimal set.</p><br/><p>He wasn’t the only one shocked. The four element academies outside the ring were equally gobsmacked. They really hadn’t expected that Shrek Academy still hid a team member like this. Strength over the fortieth rank, and the distortions in the air around him as and the changes in his hair and body undoubtedly also declared the power of his spirit.</p><br/><p>Along with his spirit power increasing, after Ma Hongjun used his spirit now, the mohican hairstyle already turned completely red, and after eating the immortal treasure herb ‘Cockscomb Phoenix Sunflower’ that Tang San gave him, not only didn’t he have the threat of backlash from the Evil Fire, but his Phoenix power had also been purified. Even Grandmaster had said that among the Shrek Seven Devils, in burst power, Ma Hongjun was number one.</p><br/><p>Basically without paying attention to his opponent’s shock, the instant his spirit released, Ma Hongjun acted. With an explosion and the flare of his second spirit ring, surging red purple flames soared up, immediately followed by a jet of Firewire, going straight for the opponent.</p><br/><p>Even if the vines were compressed into a shield, with their attributes countered, let alone when Ma Hongjun’s opponent had already spent considerable spirit power on the previous three fights, even if he hadn’t, he still couldn’t have taken the Phoenix flame attack. Just like when they met Blazing Academy before, it ended without any suspense.</p><br/><p>The red purple flames easily pierced the opponent’s defense, adhering to his body.</p><br/><p>In shock, the Botanic Academy’s three successive victories student threw himself to the ground without the slightest hesitation, quickly starting to roll on the ground in order to put out the flames all over him. At the same time countless vines rushed out of his body, dashing at Ma Hongjun in attempt to block him from attacking further.</p><br/><p>However, Ma Hongjun didn’t continue attacking like he had imagined, he only watched his opponent with a sneer, the red purple flames on his body becoming increasingly dense.</p><br/><p>Ma Hongjun didn’t even seem to see the green vines dashing at him from the front, letting them attack. Unfortunately, these green vines were basically unable to pass the obstacle of his Bathing Fire Phoenix. The red purple flames were like a celestial city moat, and each green vine that approached would instantly turn to ash.</p><br/><p>If this fortieth ranked plant type Spirit Master had had a total victory in spirit power, perhaps he could still have done something to threaten Ma Hongjun. But unfortunately, he had already consumed a lot of spirit power in the previous three fights. Confronting Ma Hongjun whose level wasn’t much different from his, who had full spirit power, and whose attributes countered his, how could he contend?</p><br/><p>Not only couldn’t he stop Ma Hongjun, but that red purple flame on his body wasn’t extinguished by his rolling. The tyrannical adhering capability, corrosiveness, and blazing heat, brought this opponent pain that essentially couldn’t be described in words. By now this team member had already lost even the strength to speak up, the botanical spirit power within his body fighting the Phoenix flame’s corrosion with his life at stake, but how could that terrifying Phoenix flame be so easily resisted?</p><br/><p>“We concede this fight.”</p><br/><p>The Botanic Academy’s coaching teacher yelled at the referee without hesitation.</p><br/><p>Ma Hongjun raised his right hand towards the opponent, absorbing the red purple flame and dissolving the opponent’s crisis. To him, this was only an easy victory. Of course, these easy victories had only just begun.</p><br/><p>The Botanic Academy had altogether three Spirit Master over fortieth rank, and besides this first student to go up, the remaining two were both last. Consequently, Ma Hongjun’s next four opponents were all thirty something ranked plant type Spirit Masters.</p><br/><p>Despite all these plant spirit Spirit Masters being control system, unfortunately, Ma Hongjun’s restraint on their spirits was far too difficult to overcome, and there was basically no need for either side to fight hand to hand. As long as Ma Hongjun released his Bathing Fire Phoenix, he could basically guarantee that their spirit abilities would be completely ineffective against him.</p><br/><p>No matter how powerful your spirit, when it was completely ineffective against the opponent, there was no meaning no matter how powerful the spirit ability.</p><br/><p>From the first fight to the fifth, Ma Hongjun didn’t even move from where he stood. Protected by Bathing Fire Phoenix, with its simultaneous amplification to Phoenix Fire Wire, a flame jet would shoot out, sweep across, and if the opponent was hit, the fight would immediately end. To him, these battles were as easy as that.</p><br/><p>One defeating three was originally already an enormous advantage. But in the blink of an eye, Botanic Academy had lost five times in reverse, and it was moreover a counter without the least suspense.</p><br/><p>At last another fortieth ranked Spirit Master walked up. The colors of his spirit rings were separately yellow, yellow, yellow, purple. Their properties were clearly not equal to Ma Hongjun.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>His spirit was Scarlet Flame Thistle, and he was also the only Spirit Master among Botanic Academy’s seven participating member with a fire attribute. Right now he was naturally also Botanic Academy’s last hope. If he also lost to Ma Hongjun, then there would be no need for the last fight.</p><br/><p>When Botanic Academy’s coaching teacher saw the tyrannical strength of Ma Hongjun’s flame, he only gave the previous several students orders to use up as much of Ma Hongjun’s spirit power as possible. After all, among all the Shrek Academy students that had appeared before, there were no other Spirit Masters with the same kind of flame capability as Ma Hongjun. As long as this sixth Spirit Master could beat Ma Hongjun, they still had a chance to prevail over Shrek Academy. Tang San had been seriously injured against Blazing Academy, unable to take the stage. Even though the other several Shrek Academy people were also very powerful, Botanic Academy’s plant system Spirit Master control also wasn’t weak.</p><br/><p>Just as the fight started, Ma Hongjun’s opponent simultaneously brandished both hands, his third spirit ring lighting up in a flash, an ability launching.</p><br/><p>Scarlet rays of light scattered all around him, and a wide expanse of two meter tall red thistles rose sharply from the ground, forming a forest of brambles and thorns that separated both sides. Like this, Ma Hongjun was unable to see his movements, and at the same time his Scarlet Flame Thistle also swiftly surrounded Ma Hongjun within, and still rapidly pressed in on Ma Hongjun. His target was to restrain Ma Hongjun within his thistles. As long as he succeeded, he could easily slaughter him later. He had a great deal of confidence in Scarlet Flame Thistle’s fire resistance. After all, this was a fire element plant spirit.</p><br/><p>Would Ma Honjun truly let himself be controlled like that? He gave his answer very quickly.</p><br/><p>Confronted with the swiftly approaching forest of thorns, Fatty was hardly even flustered. His third spirit ring lit up in a moment, and with a resounding phoenix cry, an enormous red purple shadow appeared behind him.</p><br/><p>Watching this scene, not only did the faces of Botanic Academy’s spectating teachers and students change greatly, but even the referees in the stands were shocked. In the previous several fights, besides a small number of people, nobody had seen just what Ma Hongjun’s spirit actually was. Now that they saw the play of light and shadow behind him, everyone realized that this seemingly unremarkable little fatso actually possessed one of the highest grade spirits, Phoenix.</p><br/><p>The moment the enormous red purple flame wings unfolded from Ma Hongjun’s back, not even that greatly fire resistant Scarlet Flame Thistle could escape its infernal fate. Even if they both had fire attributes, they were still separated by relative levels. If Ma Hongjun’s flame was unable to restrain even this tiny fire element plant, then his Evil Fire Phoenix Spirit would also be unworthy of being called first rate.</p><br/><p>Hong—— The Flame brought Ma Hongjun to dash into the air, the enormous purple flame wings unfurling behind him. In midair, he could naturally find his opponent’s silhouette as easy as anything, and he threw himself at the opponent without the slightest hesitation, using Phoenix Ascension.</p><br/><p>Ground versus midair, how could he dodge? Whether in speed or flexibility, they just weren’t on the same level.</p><br/><p>In the forest of brambles, the Scarlet Flame Thistle Spirit Master could only sense Ma Hongjun’s actions, but was unable to see. Until this moment. With Ma Hongjun already risen into the sky, he knew just how formidable his opponent was. Watching his opponent pounce, he could also only use his last resort.</p><br/><p>His fourth spirit ring flared, purple light glittering, and the scarlet brambles covering the ground was enveloped in a faint purple light, appearing on the thorns of the thistles. The next moment, countless purple specks of light dashed towards the sky, gathering towards Ma Hongjun in midair.</p><br/><p>Thistle Rain, fourth spirit ability. The sharp thorns infused with powerful fire element could attack a wide area, but could also be focused into one attack. If it hit, the fire toxin it contained would spread through the opponent’s body, causing enormous destruction.</p><br/><p>Ma Hongjun truly endured this spirit ability attack. In midair, the opponent could no longer hide from him, but it was also very difficult for him to dodge. To say nothing of those sharp thorns coming from all directions.</p><br/><p>Bathing Fire Phoenix and Phoenix Ascension immediately reached their highest peak, and when the thorns entered Ma Hongjun’s vicinity, they immediately turned to ash.</p><br/><p>But. This was after all a thousand year spirit ring ability, and still the opponent’s fourth spirit ability. Even though Ma Hongjun suppressed his opponent in attributes, it wasn’t as serious as the previous several opponents. Consequently, even though he filtered out the sharp thorns and the fire toxin they carried, the impact force still hit him to some extent.</p><br/><p>If it was only a few hits, or a few dozen hits, perhaps Fatty wouldn’t even feel it. But those were thorns numbering in the thousands and tens of thousands. It wasn’t actually painful, but it still caused a constant itch that was even harder to bear.</p><br/><p>Ma Hongjun was already thoroughly enraged. Without holding back any more spirit power, unleashing the speed of Phoenix Ascension, he swooped down directly.</p><br/><p>Hong, Ma Hongjun heavily struck the ground in front of the opponent, his fourth spirit ability launching.</p><br/><p>Ma Hongjun’s fourth spirit ability, Phoenix Cry Heaven Strike, was originally a follow-up ability. Its greatest weakness was that it could be dodged, unable to lock in on the opponent. But ironically, this Botanic Academy Scarlet Flame Thistle Spirit Master had arranged a forest of brambles from the very start of the fight. His goal had of course been to restrain Ma Hongjun, but the one to be fettered right now was still him.</p><br/><p>With a loud explosion, the shock of Phoenix Cry Heaven Strike burst out the instant Ma Hongjun hit the ground, distorting the air nearby and completely wrecking the bramble forest around him. Within that distortion, the Scarlet Flame Thistle Spirit Master sunk into a daze without any suspense.</p><br/><p>“Fatty, go easy.”</p><br/><p>Outside the ring, Tang San, Dai Mubai and the others saw Ma Hongjun attack with Phoenix Cry Heaven Strike, and shouted hastily. Phoenix Cry Heaven Strike was split into two parts, the first part was the follow-up restraint, the second part was the terrifying Phoenix Magma Burst. If this second part was completed, the already completely deadlocked Scarlet Flame Thistle Spirit Master would undoubtedly die. As the spirit ability with the most formidable burst attack among the Shrek Seven Devils, Phoenix Cry Heaven Strike would cause serious injuries against even a fiftieth or sixtieth ranked Spirit Master. Let alone a mere fortieth ranked opponent.</p><br/><p>The Shrek Academy team’s anxiety was wasted. Even though Ma Hongjun’s entire body itched with the desire to vent his anger, having been together with his comrades for so long, he had still learned to control his temper. The instant the opponent was stunned, the Phoenix Ascension fire attribute attack power invaded his opponent’s body. At the same time, Fatty turned nimbly, driving a roundhouse kick into the opponent’s stomach.</p><br/><p>The Scarlet Flame Thistle Spirit Master’s body flew in a graceful parabola through the air, falling directly outside the ring, caught by one of the teachers from Botanic Academy. Right now, even though he was still stunned, he hadn’t suffered any true injuries.</p><br/><p>After the Botanic Academy teacher had swiftly inspected the Scarlet Flame Thistle Spirit Master’s physical condition, he immediately understood that the opponent had already started off leniently. With a deep inward sigh, he indicated to the referee that they renounced the last fight, conceding.</p><br/><p>The Shrek Academy team cheered, rushing out into the ring as if greeting the return of a triumphant hero, tossing Fatty’s spherical body into the air.</p><br/><p>Since the start of the ranking competition, it was the first time someone singlehandedly defeated seven. And it was moreover still done by a never before seen on stage member of Shrek Academy. This fact shocked all the participating Heaven Dou Empire academies.</p><br/><p>With a faint flickering brilliance, Fatty’s expression was completely radiant. He hadn’t fought any outsiders for a very long time. Being able to beat all the opponents was admittedly related to his spirit countering the opponents, but it was also a result of Fatty’s arduous cultivation over these days. Even Fatty himself felt that his spirit power had advanced by leaps and bounds ever since eating the Cockscomb Phoenix Sunflower. In the whole team, his attack output had already become a necessity.</p><br/><p>In overall strength, Fatty was already second only to Tang San and Dai Mubai among the Shrek Seven Devils, roughly a cut above Xiao Wu and Zhu Zhuqing.</p><br/><p>“Fatty, well done!”</p><br/><p>Dai Mubai clapped Ma Hongjun’s shoulder.</p><br/><p>Ma Hongjun smiled with immense pride:</p><br/><p>“But of course, how could the effort we brothers have expended over these days be a waste? Watch me in the later ranking competition. But to tell the truth, boss Dai, defeating seven people singlehandedly really is a pleasurable feeling, hahahaha!”</p><br/><p>Grandmaster wore a smile on his face as he looked at Ma Hongjun, saying:</p><br/><p>“Don’t be too proud of yourself. Today’s victory was only because you restrained your opponents’ spirits too harshly, letting you beat seven in succession. Under any other circumstances it wouldn’t have been so simple. For instance, would you still have any faith in your chances against Skywater Academy’s Shui Bing-Er? Her Ice Phoenix and your Fire Phoenix mutually counter each other, you don’t have any advantage in attributes, but she’s clearly above you in spirit ability and spirit power control. Perhaps it wouldn’t even require mutual restraint, as long as you encountered a rather agile agility attack system Spirit Master, it would also be difficult to win. And even if you could win, you would also have consumed a tremendous amount of spirit power.”</p><br/><p>“Eh……”</p><br/><p>Ma Hongjun scratched his head, the feeling of excitement immediately dropping a lot, he looked at Grandmaster without speaking.</p><br/><p>Grandmaster smiled:</p><br/><p>“As the most powerful attacker in the team, there’s no need to doubt your efficacy. But you must also understand that precisely because you possess such terrifying attack power, you will also be the easiest for the opponents to notice and the first to be destroyed. In a team, power attack system Spirit Masters and control system Spirit Masters are doubtless the most important, but they’re the first the opponents pay attention to. Consequently, not only must you display your attack power even better, but at the same time you must also protect yourself as far as possible. There will inevitably be comrades accompanying you at your side. For the sake of your future, you’re the one who most of all has to learn single combat fighting, this is something power attack system Spirit Masters must possess. No arrogance in victory, no despair in defeat, keep a level heart.”</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Combining fighting and teaching, this was no doubt the best method. Grandmaster’s words weren’t just for Ma Hongjun, but at the same time also for Dai Mubai and the other power attack system Spirit Masters to the side.</p><br/><p>“Alright, we can leave.”</p><br/><p>Grandmaster waved his hand, bringing everyone towards the rest area.</p><br/><p>Just at this moment, a fiery red figure suddenly appeared in everyone’s line of sight, blocking their path. This person appeared very abruptly, practically blocking in front of the Shrek Academy team in a split second.</p><br/><p>Seeing this person, Grandmaster couldn’t help revealing a faint smile, his gaze turning to the basically already recovered Tang San next to him.</p><br/><p>This fiery red silhouette was hardly unfamiliar, but precisely that just like a dazzling flame Blazing Academy vice captain, possessing the Fire Shadow Spirit, Huo Wu.</p><br/><p>Staring fixedly at the having just now obtained six successive victories Shrek Academy team in front of her, Huo Wu clenched her teeth, hardly concealing her target, her burning hot gaze was focused on Tang San. But that gaze no longer seemed the have that kind of unaccepting anger and wildness as it did before. Her gaze seemed a lot more complex.</p><br/><p>“Miss Huo Wu, what’s the matter?”</p><br/><p>The first to speak up was captain Dai Mubai.</p><br/><p>Huo Wu’s gaze swept past Dai Mubai, nodded, and said to Tang San:</p><br/><p>“Tang San, I want to talk to you.”</p><br/><p>The other six Shrek Seven Devils and the four substitute members’ gazes all immediately focused on Tang San. But Tang San himself was somewhat startled, frowning,</p><br/><p>“Is there something that can’t be said here?”</p><br/><p>Huo Wu shook her head,</p><br/><p>“I want to talk to you alone.”</p><br/><p>Tang San felt a sudden pain at his waist, and when he turned his head to look, Xiao Wu was looking at him very resentfully, something indiscernible in her gaze. But Dai Mubai was still somewhat helpless. Among the Shrek Seven Devils, in appearance, Tang San could only rank a bit above Ma Hongjun. Whether it was Oscar’s practically inhuman handsomeness or Dai Mubai’s evil eyed charisma, clearly they were more attractive to girls than him.</p><br/><p>Huo Wu was undoubtedly an extremely outstanding young woman, at nineteen she had long since blossomed into a slender and elegant woman, and her figure was even more extremely perfect from the unceasing training. Even if Dai Mubai who had innumerable women couldn’t help somewhat having some thoughts about her. If it wasn’t for Zhu Zhuqing, perhaps he would have launched his own wooing offensive.</p><br/><p>But what Dai Mubai couldn’t understand was how from seemingly only having met in two battles, Huo Wu’s attention was always focused on the not externally particularly outstanding Tang San. Even though Tang San was very strong, he still made Dai Mubai somewhat doubt his own charisma. Later everyone learned that the reason why Huo Wu was so fixated on Tang San was most importantly because of the blow he dealt her that time. Huo Wu was an aggressively competitive minded extremely powerful girl. The more people followed her, the less attention she would pay to them, and the enormous blow Tang San had struck her the first time the two academies battled had produced a situation where Tang San was the only person on her mind.</p><br/><p>Grandmaster glanced at Tang San, then again at Huo Wu:</p><br/><p>“Go, return directly afterward.”</p><br/><p>Tang San walked towards Huo Wu, and Xiao Wu’s face revealed an anxious and peculiar expression. She was about to say something, but was stopped by a glance from Grandmaster.</p><br/><p>“Let’s go back.”</p><br/><p>Under Grandmaster’s lead, the rest of the Shrek Academy people returned to their camp.</p><br/><p>Not having gone far, Xiao Wu couldn’t help asking:</p><br/><p>“Grandmaster, why did you let little San meet alone with that Huo Wu? Hasn’t she caused enough harm to little San?”</p><br/><p>Grandmaster looked at Xiao Wu with some meaning deep in his eyes, and said:</p><br/><p>“She’s no threat to little San, that’s the first point. Second, child, remember, a man’s heart can’t be forced. Once yours, it’s yours forever. Trust, is the foundation for mutual feelings. Tang San is an extremely affectionate person, having been together for seven or eight years, haven’t you seen it? In his heart, nobody could take your place.”</p><br/><p>Changing the direction of the topic, Grandmaster’s gaze floated over to Ning Rongrong and Zhu Zhuqing,</p><br/><p>“Of course, people and people are different. Regarding men of different nature, you must use methods of different nature. The key is to first grasp their nature. You’re growing up day by day, and feelings will be in a state of confusion. I hope that you won’t let questions of emotions affect your future. I hope that all of you can reveal your talent to the greatest degree.”</p><br/><p>……</p><br/><p>Huo Wu looked at the calm faced, snot green uniformed Tang San, and the expression in her eyes changed somewhat,</p><br/><p>“Come with me.”</p><br/><p>Finished speaking, she turned and walked towards the rest area.</p><br/><p>Even though Huo Wu coming to find him was somewhat baffling to Tang San, he still followed Huo Wu into the rest area.</p><br/><p>Huo Wu walked directly for a secluded corner in the rest area and stopped. Right now, the ranking competition was still continuing outside, and the students were all looking at the fight. This so-called rest area was actually a specially allocated camp, used to get in order before the competition. Right now there was nobody here.</p><br/><p>Halting, Huo Wu turned her head to look at Tang San, the expression on her face clearly becoming a lot gentler,</p><br/><p>“How are your injuries?”</p><br/><p>Tang San nodded silently,</p><br/><p>“Basically already recovered.”</p><br/><p>Even he himself was astonished by his body’s recovery ability. Let alone his skin and muscle, even some minute cracks that had formed in Eight Spider Lances due to the explosion had already completely healed. Were it not for Grandmaster repeatedly stressing that he wasn’t allowed to fight again, there would have been no problem for Tang San to participate in the ranking competition.</p><br/><p>Huo Wu seemed to loose a breath,</p><br/><p>“That’s good.”</p><br/><p>Tang San was somewhat unable to make any sense of her,</p><br/><p>“You calling me here, was it in order to ask this?”</p><br/><p>Huo Wu glanced at Tang San, and couldn’t help feeling a bit discouraged. From childhood, even though she’s always pursued formidable strength, always trained arduously, she had still equally had confidence in her own appearance. She had still never met a boy who would seem impatient in front of her, but unexpectedly Tang San was doing just that right now.</p><br/><p>“Are you really unwilling to talk to me?”</p><br/><p>Huo Wu’s familiar fiery temper seemed to start to ignite again.</p><br/><p>Tang San shook his head,</p><br/><p>“That’s not it. I just don’t understand what there is to talk about between us, after all, we’re rivals in the competition.”</p><br/><p>“How are you so slow-witted? Are you a normal human?”</p><br/><p>Huo Wu had never paid attention to anything called subtlety, and directly spoke her thoughts.</p><br/><p>Tang San frowned,</p><br/><p>“If you want to say it like that, then there’s nothing for you to speak of. Capable of participating the ranking competition, it seems there aren’t many normal people. Even more, our Shrek Academy has always been famous for producing freaks.”</p><br/><p>“You……”</p><br/><p>Huo Wu was choked speechless. Rethinking it, what Tang San said wasn’t wrong, he really wasn’t a normal person. How could normal people possess that kind of strength, and even more a ten thousand year level fourth spirit ring.</p><br/><p>Tang San looked at the seemingly about to flip out again Huo Wu and calmly said:</p><br/><p>“If there’s nothing else, I’ll return first.”</p><br/><p>“Wait a moment.”</p><br/><p>Seeing Tang San was about to leave, Huo Wu hurriedly called out for him,</p><br/><p>“Did I ask you to be that impatient? You can leave, but let me ask you a question first.”</p><br/><p>Looking at Huo Wu blocking in front of him, Tang San said:</p><br/><p>“Ask.”</p><br/><p>Burning eyes staring fixedly at Tang San’s eyes, Huo Wu asked in a low voice:</p><br/><p>“That day, why did you save me? Why did you use your own body to block the attack? That was the attack I launched at you.”</p><br/><p>Tang San looked with astonishment at Huo Wu,</p><br/><p>“This is your question? The reason you asked me to come?”</p><br/><p>Huo Wu nodded,</p><br/><p>“More or less.”</p><br/><p>Tang San somewhat helplessly said:</p><br/><p>“You’re indeed my opponent, but you aren’t my enemy. Launching that attack was only so that you could win. There’s no deep hatred or great regret between us, and you’re even more a woman. What use would your death be to me? It would even deepen the conflict between our academies. With me to take that attack, death certainly wouldn’t have been the outcome, saving you was very normal.”</p><br/><p>“Just that?”</p><br/><p>Huo Wu looked stupidly at Tang San. She discovered that Tang San’s reply was a bit different from what she had imagined.</p><br/><p>After Tang San had been hurt saving her that day, Huo Wu had thought of a lot of things. First of all she had thought that Tang San liked her. There were a lot of people who pursued her openly like Feng Xiaotian, but there were even more who were secretly in love with her. Being accustomed to thinking like that, this was the first thing Huo Wu thought of. Her coming to find Tang San today was because she wanted to hear what Tang San had to say. It seemed to her that Tang San wasn’t a person of sweet speech and honeyed words, and would inevitably reveal what he thought of her.</p><br/><p>But who could have thought that Tang San would describe it in terms of beneficial concerns, apparently without a thought to his behaviour that day.</p><br/><p>Seeing Huo Wu’s lifeless appearance, Tang San decided not to stay here. Right now, his mind was filled with Xiao Wu’s peculiar expression as she left. He was even more fearful of what Xiao Wu would think. Therefore, taking advantage of Huo Wu’s moment of lifelessness, he turned to leave.</p><br/><p>“Tang San.”</p><br/><p>Huo Wu suddenly roused herself, and hastily chased after.</p><br/><p>Tang San heard her voice, and subconsciously turned around. But who could have expected that Huo Wu would move so suddenly, and the two almost collided.</p><br/><p>In order to protect herself, Huo Wu subconsciously used her hands to support herself against Tang San’s chest, and Tang San also in order not to be hit grabbed Huo Wu’s shoulders. The distance between them immediately shortened to where they could hear each other breathe.</p><br/>\n</div>"}