{"title": "Chapter 110", "id": 110, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-110", "volume_title": "Volume 2", "body": "<h1>Chapter 110</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 110</p><br/><p>King Among Flowers, Monarch Overlooking All Fragrance</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Group battles were after all chaotic, making it very difficult to see things clearly. And different from the qualifiers, each student would be revealing their own strength under the gazes of all the spectators. This was also the best opportunity to evaluate the strength of the Spirit Masters.</p><br/><p>The edges of the great drill grounds were completely surrounded by ten thousand imperial household knights, forming a watertight encirclement, helmets bright and armor shining. The front row of knights stood, while the back rows were mounted.</p><br/><p>This kind of strict defense could be called watertight. Of course, just like Tang San suspected, emperor Xue Ye’s goal was to let his most elite subordinate knights take a look at the strength of the new generation of Spirit Masters, using this to ignite their fighting spirit.</p><br/><p>Between the great circle of knights and the competition ground, fifteen competing teams were finally arranged. Even the team that could rest today was no exception. Even if they didn’t compete, they still had to gauge the strength of the opponents.</p><br/><p>The rules were very simple. Both sides would each participate with seven team members. Each team that went up would fight until defeated, continuing to fight the next opponent if they won, until the seven people on one side were completely defeated.</p><br/><p>The lots had already been drawn last evening, and Shrek Academy didn’t pull an empty lot for their first round. Their opponent was an advanced Spirit Master academy from Balak Kingdom. Their turn was the third in the seven matches for today.</p><br/><p>The different areas were sorted so teams were grouped by their qualifiers. Tang San naturally saw the familiar rivals of the four elemental academies, and as they looked towards Shrek Academy, several people’s gazes fell on Tang San.</p><br/><p>Those included Godwind Academy team captain Feng Xiaotian, Blazing Academy siblings Huo Wushuang and Huo Wu, Skywater Academy team captain Shui Bing-Er, as well as the Thunderclap Academy team captain Tang San had never seen before, a youth with ordinary build and unremarkable appearance.</p><br/><p>Grandmaster gathered everyone around him, his gaze sweeping across all the eleven Shrek Academy team members,</p><br/><p>“Next I’ll announce the order in which you’ll go up. Xiao Wu, you go up first, after is Tang San, and Dai Mubai.”</p><br/><p>Everyone were still listening, but Grandmaster had already finished.</p><br/><p>Dai Mubai couldn’t help asking:</p><br/><p>“Grandmaster, aren’t we going to send seven people?”</p><br/><p>Grandmaster smiled calmly, saying:</p><br/><p>“Don’t tell me the three of you don’t have the confidence to end the match? Even though the opponents of the ranking competition are a bit powerful, they still won’t be stronger than the four elemental academies. One on one doesn’t need any teamwork, only strength.”</p><br/><p>That simple sentence immediately roused the fighting spirit of the Shrek Academy team. Tang San, Dai Mubai and Xiao Wu all looked at each other, and in each other’s eyes they could all see conviction of certain victory.</p><br/><p>Emperor Xue Ye stood from the VIP seats, speaking through a spirit tool:</p><br/><p>“The ranking competition formally begins today. I hope all the academy teams will be able to amply display their strength in the next fourteen days, displaying the proper elegance of Spirit Masters. Begin.”</p><br/><p>As his words fell, shouts just like a landslide or tsunami resounded,</p><br/><p>“Long live, long live, long live!”</p><br/><p>The imperial household knights raised the lances in their hands, the sounds of their armor resonating with their voices, immediately startling the competing Spirit Masters. Undoubtedly the manifestation of a great nation’s bearing.</p><br/><p>The first match began. Awesomely, first to appear was Blazing Academy. Their opponents was a team known as Fabia Academy.</p><br/><p>The first to represent Blazing Academy was the team captain, Huo Wushuang. Clearly, Blazing Academy’s teacher thought much like Grandmaster. Not only would they win this first match, but also strike a large score.</p><br/><p>In the final ranking of the ranking competition, besides the match points, individual fight victories were also important. If there was a tie in matches, the ranking would be arranged according to fights.</p><br/><p>Tang San didn’t pay any attention the the match, but stood next to Xiao Wu, saying to her in a low voice:</p><br/><p>“You’ll go first in our match later. If you find yourself restrained by the opponent, don’t force yourself. You can’t be injured, understand?”</p><br/><p>Tang San had originally thought he would go up first, but hadn’t expected Grandmaster would send Xiao Wu. Unable to oppose it, he could only give Xiao Wu a few cautioning words.</p><br/><p>Xiao Wu smiled calmly, pinching Tang San’s hand, saying:</p><br/><p>“Don’t worry. Are you still uneasy about my one on one capability? If I can’t win, I’ll concede.”</p><br/><p>Tang San stroked her head,</p><br/><p>“Caution sails a ship for ten thousand years. Our opponents will get stronger and stronger, we can’t be careless.”</p><br/><p>The matches proceeded very quickly. Between Spirit Masters, if there was a gap in strength, the result would often be settled in an instant. The one with more powerful spirit abilities, with higher spirit power, would easily defeat their opponent. People with spirit bones were, after all, very few.</p><br/><p>In one on one matches it was also impossible for something like spirit fusion ability to appear. Everything had to rely on one’s own strength.</p><br/><p>In the first match, Huo Wushuang successively defeated three people, then lost the next match after substantially consuming his spirit power.</p><br/><p>The continuous battles didn’t give time to rest. This was another area where the ranking competition was more interesting than the qualifiers, it didn’t just test the strength of each member of the team, at the same time tactics and planning were extremely important. Even the most powerful Spirit Masters would find it difficult to consecutively defeat opponents by themselves.</p><br/><p>After all, the more powerful the spirit ability, the more it limited spirit power.</p><br/><p>The second to represent Blazing Academy was Huo Wu. It seemed that her expression was somewhat calmer than in the qualifiers, moving with the force of fifteen tons of thunder. Even though she was a girl, she gave the opponents enormous pressure in each fight. Judging by her appearance, this didn’t seem to be a match, but more like life and death.</p><br/><p>Relying on the advantages of a control system Spirit Master, Huo Wu unexpectedly successively defeated four people, the two siblings directly smashing the Fabia team.</p><br/><p>When Huo Wu returned from the competition area, her physical strength was already somewhat overdrawn due to consuming a large amount of spirit power, but her pale charming face was still brimming with pride, her gaze fixed on Tang San without flinching, and she moreover extended a forefinger, pointing at him.</p><br/><p>Confronted with Huo Wu’s provocation, Tang San only wrinkled his eyebrows and didn’t express anything.</p><br/><p>Because of Huo Wu’s gesture, a lot of Spirit Masters from other kingdoms and duchies now paid attention to him.</p><br/><p>Huo Wu had indeed become strong. Even though only one month had passed, that oppressive strength of hers had clearly grown a lot stronger, and her burst power was even more astonishing. It seemed that she really had worked hard in the past month.</p><br/><p>Among all the fifteen competing teams, Fabia Academy was one of the weakest, but having easily defeated them by sending only two people, Blazing Academy had still put themselves in the spotlight among the competing academies.</p><br/><p>The second match featured two teams Tang San wasn’t particularly familiar with, however, among these strangers, he still saw one acquaintance.</p><br/><p>A simple uniform drawing the outline of a perfect figure, a solid and slender serpent staff held crosswise. It was the Unrivalled Dragon Serpent’s granddaughter, who originally fought Tang San over his third spirit ring, Meng Yiran.</p><br/><p>Meng Yiran appeared on the competition ground as the vice captain of Cryptid Academy’s team, in high spirits.</p><br/><p>As the first tool Spirit Master to appear, she completely displayed the superiority of a tool Spirit Master.</p><br/><p>Even though tool Spirit Masters didn’t have the burst power of a beast Spirit Master, tool Spirit Masters won out in battle endurance. Relying on the extremely toxic serpent staff and her changeable severe attack methods, she unexpectedly also successively defeated three people.</p><br/><p>Making Tang San not know whether to laugh or cry, as Meng Yiran walked off the competition ground, her gaze unexpectedly also fell on him, and she simultaneously imitated Huo Wu’s gesture to hold out a hand and point at him.</p><br/><p>Meng Yiran had originally noticed him when Huo Wu pointed him out. This wasn’t only a demonstration towards him, but also a challenge.</p><br/><p>Sensing the gazes of numerous Spirit Master students fix on him, Tang San could only stand there helplessly. Even Oscar couldn’t keep from snickering to the side:</p><br/><p>“Little San, it seems you’ve really offended a lot of beautiful women. If you also add that Skywater Academy’s Shui Bing-Er, you’re going to have a lot of people as your enemies. You tell me, won’t the students of other academies think you’ve discarded the two of them after playing around, turning love into hate?”</p><br/><p>Tang San unhappily glared at Oscar,</p><br/><p>“Little Ao, I feel it would be relatively suitable to let you go up for a match, how about I propose it to Teacher?”</p><br/><p>“Eh…...”</p><br/><p>Oscar hastily smiled:</p><br/><p>“Little San, we’re good brothers! Big brother is an auxiliary system Spirit Master, it’s still better to leave a difficult challenge like the ranking competition to you. You also don’t want our Shrek Academ to lose face because of me.”</p><br/><p>While they chatted, the situation in the match had already started to change somewhat. Even though Cryptid Academy had Meng Yiran’s three victories, the other students of their academy clearly weren’t as powerful as her, and the opponents wore through four people. In the end the match finished with a close victory for Cryptid Academy after ten fights.</p><br/><p>From the previous two matches, Tang San could already see that the kingdom and duchy academies still had a certain gap in strength to the five elemental academies.</p><br/><p>There was at most only one fortieth ranked Spirit Master among the three academies that had already appeared, while the majority were thirty something ranked. Like Meng Yiran, whose spirit power was presently only at the thirty seventh rank or so.</p><br/><p>This suggested that the fight over the final ranking of the competition should be between the five teams from Heaven Dou City.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Finally it was Shrek Academy’s turn,</p><br/><p>“Come.”</p><br/><p>Dai Mubai was first to extend his right hand, followed by Tang San, Xiao Wu, Oscar, Ma Hongjun, Zhu Zhuqing…… Eleven people put their hands together, cheering with loud voices.</p><br/><p>Boosted by everyone’s expressions filled with confidence, Xiao Wu unhurriedly walked into the competition area.</p><br/><p>Shrek Academy’s first opponents were from Balak Kingdom, their Royal academy. Just like Heaven Dou Imperial Academy’s position in Heaven Dou Empire, their name was also the same as the kingdom’s, Balak Academy.</p><br/><p>First to appear from Balak Academy was a large youth, looking twenty something years old, wearing a black and gold uniform. When he saw Xiao Wu he couldn’t help staring blankly.</p><br/><p>There were two things that made him stare in a daze, one was Xiao Wu’s appearance, and the other was naturally Shrek Academy’s abnormal uniform.</p><br/><p>The Shrek Academy uniform long since didn’t have any room for advertisements, advertising logos could be found on practically each corner of the uniform. Shrek Academy was enormously famous in Heaven Dou City.</p><br/><p>However, Balak Academy from Balak Kingdom naturally wouldn’t know anything about this.</p><br/><p>Seeing Xiao Wu’s snot green and logo covered uniform, that big youth immediately laughed. If Xiao Wu hadn’t been a beautiful girl, he would definitely have mocked her.</p><br/><p>“Little sister, how old are you? Your Shrek Academy wouldn’t be without people, and sending you to make up the numbers? It would be no good if big brother is a bit serious and you get hurt. I think you had better go down. Find someone stronger to come over. This isn’t a place you should be.”</p><br/><p>The big youth said earnestly.</p><br/><p>Even though Xiao Wu’s body was already close to that of an adult, she was still growing in some important areas. Moreover, her childish face clearly wasn’t something someone in their twenties would have. Nobody would notice when fighting as a team where numerous people were mixed together, but in the current one on one format, both sides appearance were naturally conspicuous.</p><br/><p>Xiao Wu frowned. That tall youth’s voice was very loud, practically all the students around the competition area had heard him.</p><br/><p>Oscar somewhat puzzled said to Ma Hongjun next to him:</p><br/><p>“Fatty, what are you covering your eyes for?”</p><br/><p>Ma Hongjun said with feeling:</p><br/><p>“Because I can’t bear to see it. Being so disdainful to Xiao Wu, I’m afraid this Balak Academy brother is out of luck. Did you forget that terrifying continuous throwing technique Xiao Wu has? I think it was called Eight Stage Drop. Eh, that’s right, you weren’t there. It’s a pity, you didn’t see the circumstances at that time. I really can’t bear to see it.”</p><br/><p>While Ma Hongjun and Oscar were talking, the referee on the competition grounds had already declared the match started.</p><br/><p>Xiao Wu was in no rush to act, and blinked at the big youth in front of her,</p><br/><p>“Big brother, I think you’re right, this really isn’t a place I should be.”</p><br/><p>Even if her mouth said this, her body had already begun to change, her spirit quietly releasing. Two yellow and one purple, three spirit rings spiralled up.</p><br/><p>The tall Balak Academy youth should originally have paid attention to Xiao Wu’s spirit rings and gone on alert, but just like Ma Hongjun said, he really was too contemptuous of Xiao Wu. Even more, he had complete confidence in his own strength. In the whole Balak Academy team, he was not only the captain, but also the strongest person, his spirit power surpassing fortieth rank. Unfortunately, his opponent was Xiao Wu.</p><br/><p>The split second Xiao Wu’s spirit released, a spirit ability also launched simultaneously. Second spirit ring ability, Demon Confusion, launched.</p><br/><p>A yellow ring of light flared, and Xiao Wu’s eyes became an alluring pink color. The tall youth immediately turned stupid, completely in a daze. And at this moment, Xiao Wu moved.</p><br/><p>According to the competition rules, both sides started the match at a distance of twenty meters. Xiao Wu’s long legs shot out forcefully, and in practically a split second, the distance between the two had closed to ten meters.</p><br/><p>This tall youth still had higher spirit power than Xiao Wu, and his mind didn’t stay stunned for too long. Subconsciously becoming aware he was in a bad situation, he hastily opened up his own spirit while still only fuzzily aware of the situation in front of him. At the same time he slapped his own face hard, clearing his head somewhat.</p><br/><p>His reactions really weren’t slow, and when Xiao Wu still was five meters away he had already completely sobered. With those growing three spirit rings in front of him, as well as Xiao Wu’s rapid approach, how couldn’t he be alarmed?</p><br/><p>Raising both hands practically subconsciously, he launched his first spirit ability at Xiao Wu.</p><br/><p>However, the instant he launched his spirit ability, he was once again staring blankly. Because, that opponent who had originally been in front of him, had disappeared.</p><br/><p>Xiao Wu appeared behind the tall youth with her back to him, scorpion braid whipping out, while that big youth was still shocked, he only felt his neck tighten.</p><br/><p>Xiao Wu didn’t even turn around. At the same time as the braid whipped around her opponent’s neck, her left foot supporting on the ground, she raised her right foot behind her, planting it directly on the tall youth’s waist. Her first spirit ability, Waist Bow, launched.</p><br/><p>Pulled back by the braid, waist pushed up, the instantly erupting force immediately choked the big youth. The next moment, he was already completely thrown into the air by Xiao Wu.</p><br/><p>Only a few moments had actually passed from the start of the competition until now. Launching Demon Confusion, Xiao Wu dashing forward, launching Teleport, applying Soft Skill, throwing the opponent. The entire process was as natural as flowing water and moving clouds, without the slightest pause.</p><br/><p>It was also because of this that her opponent wasn’t given any opportunity to react.</p><br/><p>Leaning forward, Xiao Wu’s braid quietly separated from her opponent. Now, she leapt high into the air to meet her uncontrollably spinning opponent.</p><br/><p>At this point, this fight no longer held any suspense.</p><br/><p>All spirit abilities required a bit of time to store up strength, but if the Spirit Master lost their balance, and were simultaneously locked down by a spirit power burst of their opponent, it was basically impossible to use any spirit abilities.</p><br/><p>Whether it was Xiao Wu’s Demon Confusion ability, or the spirit power she used after her scorpion braid wrapped around her opponent’s neck, both had this kind of effect.</p><br/><p>“Goodbye.”</p><br/><p>Xiao Wu’s one hand grabbed the back of the tall youth’s neck, her left knee shooting up and, with a profound spirit power, heavily striking her opponent’s waist. At the same time, Waist Bow launched. With a twist of her body and a simple throw, the big youth heavily struck the ground.</p><br/><p>Hong——</p><br/><p>When the big youth heavily impacted the ground, a lot of people had already closed their eyes. Xiao Wu fell from the sky, both her feet directly stomping on the tall youth’s chest.</p><br/><p>Under the enormous impulse, originally already confused by the throw, the tall youth’s body immediately spasmed, violent pain making him unable to hold back a blood-curdling scream.</p><br/><p>Raising a foot and kicking out, Xiao Wu’s toes directly nudged her opponent’s jaw. Turning at the same time, executing a beautiful pirouette on top of her opponent’s chest, her other foot lightly nudged her opponent’s temple. The tall youth sank into complete darkness, completely unconscious.</p><br/><p>Three rings against four rings, a complete victory.</p><br/><p>After the air froze for a brief moment, it immediately turned blazing. Voices of admiration, voices of alarm, all rose and fell in succession. Even those Spirit Master academies outside who had once fought Shrek Academy, the four element academy students were also unable to conceal their shock.</p><br/><p>From start to finish, the fight had only taken a few moments.</p><br/><p>Relying on her own strength, Xiao Wu basically didn’t give the opponent any opportunity to resist. A forty something ranked Spirit Ancestor was perfectly smashed by her and could only release his first spirit ability. From start to finish, Xiao Wu had been in control of the battle.</p><br/><p>Right now, his unconscious body was still constantly twitching on the ground.</p><br/><p>As a result of injuries from having his chest stomped heavily, things constantly bubbled out of his mouth even in unconsciousness, foul matter mixed with the blood. Even though his injuries might not be very serious, it would still be very difficult for him to participate in tomorrow’s match.</p><br/><p>Xiao Wu’s face revealed a smile harmless to both men and beasts, her gaze floating over to the other Balak Academy team members, softly saying:</p><br/><p>“Next.”</p><br/><p>One simple word, but it seemed to ignite a barrel of gunpowder. Seven or eight people from the Balak Academy side immediately leapt up, aggressively dashing at Xiao Wu.</p><br/><p>“What are you doing?”</p><br/><p>The referee appeared promptly, but he only used words to block the opponents.</p><br/><p>“Want a group battle?”</p><br/><p>The other six Shrek Seven Devils set foot on the competition grounds in practically the first moment. Xiao Wu even more took a step forward, only quietly looking at the approaching opposing side.</p><br/><p>Actually, she really hadn’t wanted to beat her opponent so miserably, but after she discovered her opponent’s strength surpassed the fortieth rank, she had no choice but to go all out. Further adding that after launching Waist Bow, her strength wasn’t completely under her control, this was her only choice in order to completely remove the opponent’s ability to resist. After all, she was a close combat Spirit Master, she couldn’t just release spirit abilities.</p><br/><p>“Looking to die?”</p><br/><p>Before the two sides could get close, a clear and cold voice shook everyone present. Her voice didn’t sound very loud, but when it issued, it was clearly heard by the more than ten thousand people present.</p><br/><p>Nobody on either side clearly saw when a person appeared in the middle, but with her appearance, a tyrannical matchless imposing manner swept towards the Balak Academy side as if hiding the sky and covering the earth.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>That overbearingly tyrannical aura made even the pupils of Ning Fengzhi and platinum bishop Salas in the VIP seats contract.</p><br/><p>This person suddenly appearing in the center of the arena was no stranger, but Slaughtering Corner Liu Erlong. What kind of temper did Liu Erlong have? Once ignited only Grandmaster could suppress her.</p><br/><p>Right now Xiao Wu was her adopted daughter, and seeing the opponents attack en masse, how could she stay calm? Regardless of the occasion, she finally had a target to protect, how could she hold back?</p><br/><p>Under the effect of Liu Erlong’s formidably oppressive strength, the Balak Academy students all screeched to a halt practically in the same instant, looking at Liu Erlong with shock.</p><br/><p>Liu Erlong’s tyrannical aura didn’t originate just from her spirit power, but at the same time also from her spirit and her own temper. Even though she was a Spirit Sage, that instantly erupting aura would shock even higher level Spirit Masters.</p><br/><p>“This is a competition, what are you all doing?”</p><br/><p>An ice cold voice resounded. If saying Liu Erlong’s voice reached people’s heart and soul, then this voice made people shiver.</p><br/><p>Platinum bishop Salas had already stood up from his seat at some unknown time, his ice cold gaze watching both sides in the arena.</p><br/><p>By now, Balak Academy’s team coach had also entered the competition grounds.</p><br/><p>His spirit power wasn’t lower than Liu Erlong’s, but looking at her overbearing appearance, for some reason he lacked confidence.</p><br/><p>He turned and saluted the distant VIP seats,</p><br/><p>“Please calm your anger, lord platinum bishop. We only wanted to carry away our team mate. We had no other intentions.”</p><br/><p>Salas indifferently said:</p><br/><p>“Both sides please remember your positions. Entering the grounds without the permission of the tournament staff will lead to immediate expulsion from the tournament.”</p><br/><p>The originally volcanic scene was suppressed like this, but the smell of gunpowder between Shrek Academy and Balak Academy no doubt became even denser.</p><br/><p>Xiao Wu still remained in the ring, and Tang San stepped off after giving her a few words of warning as he passed her.</p><br/><p>Balak Academy was clearly infuriated, and astonishing the Shrek Academy party was the the second opponent to go up was unexpectedly also a Spirit Ancestor over fortieth rank. In the ring, he released his spirit without waiting for the referee to announce the start of the match. His spirit was very peculiar, a flower, with red center and yellow petals.</p><br/><p>“Sunflower.”</p><br/><p>Tang San frowned. Xiao Wu’s second opponent was a Spirit Master with a plant spirit. Sunflower was clearly of a quality Blue Silver Grass couldn’t compare to, possessing formidable restraining capability.</p><br/><p>Wild sunflowers were capable of releasing an extraordinary scent, making people lose fighting capability, a kind of peculiar mental poison. And Sunflowers were furthermore hard as iron. With this as spirit, it could be treated as a weapon on its own, poison and attack equally serious.</p><br/><p>Clearly, Xiao Wu’s opponent wasn’t easy to deal with.</p><br/><p>Watching the opponent’s white, yellow, purple, and purple spirit rings, Xiao Wu’s expression also became serious. Her abilities had already been revealed once, and the opponent would inevitably be on their guard against them. She naturally also knew about the Sunflower. Dealing with an opponent possessing poison attribute attacks was very difficult, especially when the opponent’s spirit power was above hers.</p><br/><p>“You’ll pay for what you just did.”</p><br/><p>Even though this second Balak Kingdom team member to appear wasn’t tall, he was extremely sturdy, with swelling muscles clearly visible over his wide shoulders. The sight of someone with this appearance cradling a delicate flower was also somewhat strange.</p><br/><p>The referee reminded them:</p><br/><p>“Don’t forget the rules of the competition, if anyone violates them, they will lose the qualifications to compete.”</p><br/><p>Xiao Wu nodded along with her opponent, but the atmosphere between the two of them didn’t show the slightest sign of weakening.</p><br/><p>Xiao Wu knew that the difference between her and her opponent lay mainly in the fourth spirit ring, their actual level didn’t differ much. Judging by the opponent’s spirit power fluctuations, he should also have only just broken through the fortieth rank not long ago.</p><br/><p>“Match start.”</p><br/><p>At the referee’s announcement, the Balak Kingdom student’s first spirit ring brightened instantly, and the Sunflower in his hands faced the wind and grew. In the blink of an eye, it had already grown into one meter in diameter, and the long stalk in his grasp had also reached more than three meters, instantly becoming a bizarre weapon.</p><br/><p>With a wave of his hands, a dense yellow mist released from the Sunflower, directly enveloping Xiao Wu within.</p><br/><p>At this moment Xiao Wu couldn’t advance, therefore she could only retreat, backing away with big leaps. But despite this, she still caught a faint fragrance. The fragrance was very rich, and even though it was only a hint, Xiao Wu immediately felt her mind go dizzy.</p><br/><p>In circumstances with equal level, especially when both sides didn’t have very high spirit power, Poison Spirit Masters held a greatly advantageous position. As long as they used it appropriately, they could restrain their opponent to an enormous degree. Like this Balak Academy student, in terms of restraining attributes, besides spirits that specifically restrained poison, only ice and fire type spirits like what Huo Wu and Shui Bing-Er had might control him.</p><br/><p>As the pit of her stomach tightened, Xiao Wu knew that the poison had already begun to take effect, and she hastily urged her spirit power to suppress it. But her opponent still didn’t chase after, only continuously waving the Sunflower in his hands with a malicious smile, sending out that great yellow mist.</p><br/><p>The area it covered began to grow bigger and bigger. By now, two spirit rings were already shining simultaneously.</p><br/><p>Clearly, the first of these two spirit rings was to enlarge the Sunflower, and the other was this fog.</p><br/><p>What should be done? Hesitation appeared briefly in Xiao Wu’s heart. She knew that to defeat the opponent, she would have to break into the opponent’s poison formation with the force of fifteen tons of thunder and settle him quickly. But wouldn’t he be prepared for that?</p><br/><p>He still hadn’t used his third and fourth spirit abilities. In a situation where she couldn’t get into close range, even though Xiao Wu still had enough spirit power to use abilities, it clearly wasn’t enough to get close to the opponent.</p><br/><p>Just at this moment, suddenly, a bizarre heat flowed into Xiao Wu’s body through her chest, and her originally tight stomach immediately relaxed. Not just this, a layer of golden red light began to appear from within Xiao Wu’s body, and in the blink of an eye, she was surrounded by a barrier of golden red light.</p><br/><p>By now, the poison fog had just enveloped Xiao Wu’s position, and a bizarre scene occurred. No matter how tremendous that poison fog, it was still unable to penetrate that golden red light.</p><br/><p>Making Xiao Wu’s opponent even more inconsolably shocked was that when the poison he had already released came into contact with the golden red light around Xiao Wu, it immediately melted away like ice and snow. In a moment, the poison fog had already been completely obliterated within ten square meters of Xiao Wu.</p><br/><p>Let alone the opponent, right now even Xiao Wu herself didn’t know what just happened, but with her combat experience she naturally wouldn’t give up this opportunity, dashing at her opponent without the slightest hesitation.</p><br/><p>“What’s going on? What’s that golden red colored light?”</p><br/><p>Liu Erlong couldn’t help questioning Grandmaster.</p><br/><p>Grandmaster also had a baffled expression. Even though his research into spirits was incisive, the situation before his eyes still left him puzzled. Originally he hadn’t had much belief in winning this fight, but that golden red light had rekindled his hope.</p><br/><p>“I know.”</p><br/><p>Tang San suddenly said in a low voice, his face revealing a hint of a smile.</p><br/><p>The Shrek Academy group’s gazes all instantly focused on Tang San, who smiled and said:</p><br/><p>“Do you still remember Xiao Wu’s Yearning Heartbroken Red? As an immortal treasure among immortal treasures, the Yearning Heartbroken Red is undoubtedly a king among flowers, even the Aromatic Silk Beauty Immortal Treasure is far from being able to compare to it. The Sunflower is also a flower, even though the Yearning Heartbroken Red isn’t particularly good at resisting poison, and Xiao Wu didn’t eat it, the Yearning Heartbroken Red’s position among flowers really is too high, after fusing with Xiao Wu’s blood, it has already formed a certain connection with her. When the Sunflower launched an attack against Xiao Wu, the Yearning Heartbroken Red would naturally believe it was being provoked. Would the king of flowers suffer the provocation of flowers? How could it endure silently? This golden red colored light should be the Yearning Heartbroken Red’s Monarch Overlooking All Fragrance[1] splendor.”</p><br/><p>Oscar couldn’t keep from saying:</p><br/><p>“Then how couldn’t we be violating the tournament rules?”</p><br/><p>Tang San smiled indifferently, saying:</p><br/><p>“Even Teacher didn’t notice, do you believe the panel of judges could see what’s going on? That light is emitted from Xiao Wu’s body, after all. It’s not that she’s using something. Keep watching.”</p><br/><p>Sure enough, just like Tang San said, the golden red light emitted by Xiao Wu’s body came from the Yearning Heartbroken Red. Sensing the provoking aura of the Sunflower, the Yearning Heartbroken Red automatically protected itself.</p><br/><p>Of course, it was only possible for this reaction to appear when it faced flowers. If it was some other poison, it would naturally be ineffective. This was also considered the bad luck of Xiao Wu’s opponent.</p><br/><p>Seeing his poison fog become ineffective and moreover his spirit power being substantially consumed as it melted away under the effect of that golden red light, that Balak Academy team member, with great alarm, had no choice but to use his third spirit ability.</p><br/><p>Half turning, that Sunflower swung out. In an instant, countless specks of yellow light sprinkled out from the enormous flower, enveloping a large area with a powerful aura; dodging was clearly impossible.</p><br/><p>Originally, Xiao Wu could have used Teleport to dodge, but for some reason there seemed to be a voice in her heart telling her there was no need. And Xiao Wu followed it subconsciously.</p><br/><p>Once she came to herself and thought of using her spirit ability again, it was already too late.</p><br/><p>[1] () “All Fragrance” can also be interpreted as “all flowers”, where flowers can also be interpreted as talents or beauties.</p><br/>\n</div>"}