{"title": "Chapter 126", "id": 126, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-126", "volume_title": "Volume 2", "body": "<h1>Chapter 126</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 126</p><br/><p>Tool Spirit Avatar, Deep Gold Clear Sky Hammer</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>The Clear Sky Hammer in his hand began to change. The originally black hammer turned to glittering dark gold, the hammer also swiftly shrinking, the handle growing to one meter fifty, and the hammer head the size of a bucket before it stopped shrinking.</p><br/><p>At this moment Tang San himself was also covered by a layer of dark golden light, the aura released by him and the Clear Sky Hammer no longer separate from each other.</p><br/><p>Tang San raised the hammer to point, and a ball of dark gold light and shadow grew in front of Tang San. That was the seemingly unlimitedly growing shadow of the Clear Sky Hammer.</p><br/><p>With a loud rumble, Wushuang’s charging trio was practically flung back, directly flying more than a hundred meters and falling below the hill.</p><br/><p>In front of that terrifying hammer shadow, even Huo Wu and the two support type Spirit Masters were battered away like tumbling bottle gourds. Let alone using another spirit ability, they didn’t even have the chance to act, entirely without the ability to resist.</p><br/><p>Clear Sky Hammer, the first tool spirit under heaven, how would it have an undeserved reputation? At this moment, even the Title Douluo present had eyes brimming with crystal luster. Even to the extent that in the main hall of the Supreme Pontiff Palace, several old men slowly raised their heads.</p><br/><p>This was the Tool Spirit Avatar of the seventieth ranked Clear Sky Hammer. The oppressive might of the spirit world’s number one sect’s spirit.</p><br/><p>Tang San’s originally one handed grip had changed to two hands. For some reason, even though he had already beaten the opponents, an intense craving appeared in his heart.</p><br/><p>A craving to fully use the Clear Sky Hammer. A craving to fully use the Disorder Splitting Wind Hammer Method.</p><br/><p>Half turning, Tang San was about the swing the deep golden Clear Sky Hammer in his hands. But at this moment, a low voice suddenly reached his ears, a voice brimming with force,</p><br/><p>“Stop. Restrain your strength, withdraw your spirit.”</p><br/><p>The voice held a bizarre charisma, drawing Tang San to return the Clear Sky Hammer in front of him. The deep golden lustre rushed out of the hammer, and swiftly returned into Tang San.</p><br/><p>And the Clear Sky Hammer also quietly returned to its original size.</p><br/><p>If not for the might of that one swing just now, perhaps nobody would have thought that such a small black hammer would actually be able to produce such terrifying force.</p><br/><p>The expression on Tang San’s face had clearly changed, turning from brief bewilderment to pain. He clearly felt as if his own soul was peeling away, and afterwards again quietly pouring into his body. At this moment, he suddenly had a flash of understanding.</p><br/><p>Using the Clear Sky Hammer’s Tool Spirit Avatar didn’t only consume spirit power and strength, but still his own soul. That moment had been his soul fusing into the Clear Sky Hammer to become a true Tool Spirit Avatar.</p><br/><p>“Stop.”</p><br/><p>Tang San managed to squeeze out one word.</p><br/><p>The other six Shrek Seven Devils withdrew their strength one after another, the nine colored halo slowly retiring.</p><br/><p>When that light completely returned to the Nine Treasure Glazed Tile Pagoda, Oscar reluctantly released his soft embrace, and the seven practically simultaneously loosed a long breath. At the end of what had seemed like an easy match, each of their chests soaked with sweat.</p><br/><p>Tang San staggered, and Dai Mubai behind him hastily grabbed his shoulder, stabilizing him.</p><br/><p>Right now, Tang San was as if pulled from a lake, completely soaked through with sweat.</p><br/><p>But his heart was still joyful.</p><br/><p>Without using that kind of strength, it would be impossible to understand its terror. But right now Tang San knew that he had for the first time sensed the true terror of the Clear Sky Hammer.</p><br/><p>His heart was fervent, because he couldn’t help but anticipate, if he used Disorder Splitting Wind Hammer Method while using Tool Spirit Avatar, just what kind of force would that be?</p><br/><p>This was the world’s number one school, the true might of Clear Sky!</p><br/><p>The competition ended so much faster than expected that even now a lot of people still hadn’t returned to their senses.</p><br/><p>Each of them eating one of the big recovery sausages Oscar prepared before the match, and the Shrek Seven Devils left the stage. The cardinal in the ring had no choice but to declare that tomorrow’s finals would be Shrek Academy versus Spirit Hall Academy.</p><br/><p>Drawing a deep breath, under the effect of the big recovery sausage, Tang San’s exhaustion felt a lot better. Forged by the Octagonal Mysterious Ice Grass and Infernal Precious Apricot, his body was originally already more durable than common people by far, and the Mysterious Heaven Skill possessed much faster recovery traits than ordinary Spirit Masters. He believed that before tomorrow’s match he, who was the most exhausted from today, would definitely recover to peak condition.</p><br/><p>In front of Grandmaster, Tang San’s eyes held a particular luster,</p><br/><p>“Teacher, thank you.”</p><br/><p>Tang San knew that if it wasn’t for that voice suddenly sounding by his ear, halting his full use of the Disorder Splitting Wind Hammer Method, right now he might have already had his soul pulled out from being unable to control it.</p><br/><p>That might not necessarily be fatal, but he would definitely have become an idiot. At that time he had been unable to differentiate the source of the voice, but he believed that only his Teacher could have raised the point at the key moment.</p><br/><p>Grandmaster wasn’t excited in any way because of the Shrek Seven Devils’ victory. On the contrary, his brows were tight,</p><br/><p>“I hadn’t expected that, as long as you had enough spirit power, you could actually use Clear Sky Hammer’s Tool Spirit Avatar. Truly worthy of being the number one tool spirit of the present age, it was my mistake.”</p><br/><p>Before the start of the match, Grandmaster had only been able to teach the Shrek Seven Devils the seven fusion ability. This was something he had long since researched, even if as his disciple, Tang San was also able to exhibit this kind of research, he after all hadn’t had the time Grandmaster had.</p><br/><p>After teaching the Shrek Seven Devils the seven fusion ability, Grandmaster had only told Tang San to conduct it to defeat the opponents in the fastest possible manner to conserve spirit power. He believed that his disciple would definitely accomplish this task with the most effective method available.</p><br/><p>But even Grandmaster hadn’t expected that the aggregate spirit power of the seven fusion ability would actually let Tang San use Clear Sky Hammer’s Tool Spirit Avatar.</p><br/><p>Raising his head, Grandmaster looked in the direction of Supreme Pontiff Bibi Dong in front of Supreme Pontiff Palace. The pair’s gazes collided in the air, and the Supreme Pontiff frowned slightly, but in her eyes was still a difficult to conceal admiration, and even a bit of pride.</p><br/><p>‘It seems you are worthy of being the man I like.’</p><br/><p>Compared to the reserved Supreme Pontiff, Seven Treasure Glazed Tile School master Ning Fengzhi’s gaze was a lot more blunt.</p><br/><p>Looking at Grandmaster with admiration, at this moment, he truly considered Grandmaster as one of several friends on the same level as him.</p><br/><p>Returning to the residence, Grandmaster didn’t give the Shrek Seven Devils time to recover, and immediately called them to his room.</p><br/><p>First having everyone sit and continue to eat Oscar’s recovery sausages, at the same time he called Jiang Zhu to the room to release her healing halo, helping everyone recover their spirit power.</p><br/><p>In what had seemed like an easy victory, even if the Shrek Seven Devils hadn’t suffered any injuries, their spirit power output hadn’t been small, especially Tang San had practically drawn out all his spirit power by using the Tool Spirit Avatar.</p><br/><p>Looking at everyone, Grandmaster’s expression seemed somewhat grave, speaking to Tang San:</p><br/><p>“Can your spirit power recover to its peak for tomorrow’s finals?”</p><br/><p>Tang San nodded without hesitation,</p><br/><p>“No problem. I have foundation strengthening medicines here, recovering spirit power isn’t a problem.”</p><br/><p>Grandmaster’s face relaxed somewhat. Sighing, he said:</p><br/><p>“Plan’s won’t keep up with changes, I still miscalculated.”</p><br/><p>Everyone somewhat shocked looked at him. To them, prevailing over Godwind Academy in this fight had been entirely without suspense.</p><br/><p>They didn’t understand why Grandmaster would still be talking like this.</p><br/><p>Grandmaster lowered his voice:</p><br/><p>“If I had known earlier that little San could use the Tool Spirit Avatar with Clear Sky Hammer under the effect of the seven fusion ability, even if today had been a bit more exhausting, I still wouldn’t have let you use this ability. With the Clear Sky Hammer’s Tool Spirit Avatar, I would have a seventy percent certainty against the Spirit Hall Academy team. But now it’s been revealed prematurely, it won’t work.”</p><br/><p>Dai Mubai said:</p><br/><p>“Grandmaster, why won’t it work? Don’t tell me that Spirit Hall team can figure out a tactics to break the seven fusion ability in one night?”</p><br/><p>Grandmaster shook his head,</p><br/><p>“It’s not only that. Don’t forget that the opponents you’re facing tomorrow have the backing of the Spirit Hall with the most powerful Spirit Masters. Spirit Hall has countless powers, I don’t know how many Title Douluo they will have directing their energy at finding a method. Even more, it’s impossible for little San tu use the Tool Spirit Avatar again for the duration. Otherwise, it would cause unpredictable damage to his body, and very possibly influence his future.”</p><br/><p>“Tool Spirit Avatar and Spirit Avatar are different tunes played with equal skill, even to the extent that it’s even more powerful. But where Tool Spirit Avatar is most terrifying is that the user merges his own soul with the tool spirit, and that requires consuming the strength of the soul. When little San used it he could draw the spirit power from all of you, but the strength of the soul still had to come from him alone. With his present strength, his soul is still far from stable enough. If this kind of ability was used two days in a row, a hundred times out of a hundred it would damage his soul, reducing his memory, making him stupid, directly turning him into a retard. Therefore, you absolutely can’t use the Tool Spirit Avatar again tomorrow. The same goes for the seven fusion ability. You must remember that when your abilities are already completely grasped by your opponents, you must look to change. Only by changing can you break the opponent’s rhythm, taking the initiative into your own hands.”</p><br/><p>Oscar somewhat anxiously said:</p><br/><p>“Grandmaster, then what should we do tomorrow? Even if we can maintain our peak condition to meet the enemy head on, their spirit power is still too high compared to ours, and they also have the spirit fusion ability. Defeating them really is too difficult.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Grandmaster looked towards Tang San,</p><br/><p>“The difficulty isn’t absolute. You begin cultivating now. I will carefully figure out the tactics here. Little San, come with me, I want to talk to you alone.”</p><br/><p>“Yes, Teacher.”</p><br/><p>Tang San’s spirit power was already somewhat recovered, and he followed Grandmaster from the room.</p><br/><p>The others didn’t know what Tang San and Grandmaster were going to talk about, but they all knew that in tomorrow’s match, Tang San would undoubtedly be the key.</p><br/><p>But they also knew that as the strongest of the Shrek Seven Devils, having changed the most, he had long ago become the opponents’ target. Could he display his true strength when facing three Spirit Kings?</p><br/><p>Grandmaster brought Tang San to another room.</p><br/><p>“Little San, you can’t use the seven fusion ability in the match tomorrow. Tell me your thoughts.”</p><br/><p>Grandmaster calmly said.</p><br/><p>Tang San nodded,</p><br/><p>“I understand what you mean. The seven fusion ability was already revealed today, it will definitely be their target tomorrow. With that spirit fusion ability of Xie Yue and Hu Liena’s, they can definitely block the force of our fusion ability for a while, then as long as the other five break our formation, we will undoubtedly lose. But this can also be used against them, the victory rate is fifty percent or so. The other part is breaking that pair’s spirit fusion ability, making them lose fighting strength, and afterwards focusing the strength of seven on the remaining five.”</p><br/><p>“Eh?”</p><br/><p>Grandmaster somewhat shocked looked at Tang San,</p><br/><p>“You have a way to break that spirit fusion ability? You must know that a spirit fusion ability isn’t a fusion ability. If it’s completed, it will have practically no gaps, and will moreover have enormous strength. As you say, when the spirit fusion ability is completed, the combined fighting strength of those two will reach the seventieth rank or so.”</p><br/><p>Tang San’s eyes revealed a resolute light, both fists tightening,</p><br/><p>“Them, leave them to me. As long as Mubai and the others give me enough time, I believe I can do it.”</p><br/><p>Tang San and Grandmaster stayed in the room discussing for a full four hours. Only they knew what they talked about.</p><br/><p>……</p><br/><p>Supreme Pontiff Palace, official business hall.</p><br/><p>Supreme Pontiff Bibi Dong sat in the main seat, Chrysanthemum Douluo and Ghost Douluo on either side of her. In front of them stood those seven competing team members representing Spirit Hall Academy.</p><br/><p>Xie Yue, Yan, and Hu Liena stood furthest in front.</p><br/><p>“Did you understand what I said just now?”</p><br/><p>Bibi Dong said calmly.</p><br/><p>“Understood, Your Holiness Supreme Pontiff.”</p><br/><p>Despite being Spirit Hall’s Golden Generation, Xie Yue’s trio still answered very respectfully.</p><br/><p>Bibi Dong said coldly:</p><br/><p>“It will inevitably be impossible for Tang San to use the Tool Spirit Avatar from today again tomorrow. He has twin spirits. If he’s forced to use it again, even if he doesn’t die, he will still never become a threat to us again. Therefore, you don’t need to worry about this aspect. You only need to pay attention to their seven fusion ability. Destroy it using the method I described just now. In a fight of true strength, it’s basically impossible for them to be your opponents.”</p><br/><p>“Yes.”</p><br/><p>Ghost Douluo Gui Mei’s somewhat gloomy voice echoed from the Supreme Pontiff’s side,</p><br/><p>“You should know what this tournament signifies. Not only is it your chance to make a name for yourselves, it also decides where three spirit bones belong. With Spirit Hall being the organizers, if you lose, it will be impossible to regain these three spirit bones under the eye of Seven Treasure Glazed Tile School’s people and those high level Spirit Masters. This is your reward, and at the same time it’s your pressure. If you lose, I will take you all to experience three years in the Disorienting Grand Canyon.”</p><br/><p>Hearing the words ‘Disorienting Grand Canyon’, Xue Yue and the others shivered practically simultaneously. Their gazes instantly turned even more resolute. Perhaps only ghosts could survive in that sinister place. In three years, perhaps they would really become ghosts.</p><br/><p>“Fine, you go rest.”</p><br/><p>Bibi Dong waved a hand, and Xie Yue and the others hastily left the hall from a side door.</p><br/><p>Raising a hand to rhythmically tap the desk in front of her, Bibi Dong’s eyes revealed a pondering light.</p><br/><p>Chrysanthemum Douluo Yue Guan said:</p><br/><p>“Your Holiness, what’s there to worry about? Even if they held the advantage today, the scales of victory are still leaning towards our side.”</p><br/><p>Sighing lightly, the Supreme Pontiff said:</p><br/><p>“I’m not worried about the Shrek Seven Devils. Even though those seven little children are monstrously talented, they are after all still young. Their potential still hasn’t completely emerged. Apart from Tang San, the others won’t be any trouble in the future. The variable that worries me is Grandmaster. When I knew him many years ago, I have never seen the like of his intelligence and wisdom again. Even though his spirit is unable to cultivate to a higher level because of variation, this person’s intelligence is frightening. What I can think of, he can definitely think of as well. You saw that seven fusion ability of differently attributed Spirit Masters today. I at least am unable to propose that kind of formation. What worries me is that he will raise some other kind of formation tomorrow, increasing the variables.”</p><br/><p>A cold light flashed in Ghost Douluo’s mirage,</p><br/><p>“It would be better to let me go kill him. Even if the Poison Douluo is with the Shrek Academy, I still have an eighty percent chance of successfully killing him in one strike.”</p><br/><p>The Supreme Pontiff snorted coldly,</p><br/><p>“If you had that kind of certainty, Tang San wouldn’t have arrived here alive. Gui Mei, have you forgotten of teacher instructed you in those days? Even the lion must use its full strength when fighting the rabbit. Underestimating the enemy is the greatest fear of the strategist.”</p><br/><p>“Yes, Your Holiness.”</p><br/><p>The Supreme Pontiff continued:</p><br/><p>“Grandmaster holds the warrant of a Spirit Hall elder, we can’t act against him. Even more, this is Spirit City. Casually killing people in Spirit City, and one of our Spirit Hall elders at that, how couldn’t the status of Spirit Hall greatly drop in the eyes of all Spirit Masters? To say nothing of Grandmaster still having a Blue Lightning Tyrant Dragon Clan behind him. Even if he’s already left the clan, he is after all still a directly related member. Remember, without my express order, nobody is allowed to act against him hereafter.”</p><br/><p>“It’s late, you go rest. I want to consider it properly.”</p><br/><p>The light in her eyes dimming somewhat, Bibi Dong waved her hand.</p><br/><p>Chrysanthemum Douluo and Ghost Douluo left quietly, leaving Supreme Pontiff Bibi Dong alone in the official business hall.</p><br/><p>Sitting there expressionlessly, the light in Bibi Dong’s eyes began to turn complicated, muttering to herself,</p><br/><p>“Oh, Xiao Gang, you still astonish me. Could it be that it really was teacher that broke us up back them? In our lives, perhaps we truly are destined to meet but fated to never be together. All I can do is protect your safety. As for the others, I can’t spare any attention……”</p><br/><p>……</p><br/><p>An eventless night.</p><br/><p>Very early the next day, the Shrek Seven Devils already appeared at the gate of their residence, trembling with excitement.</p><br/><p>After breakfast, seven people stood in front of Grandmaster with lively spirits and excessive energy.</p><br/><p>Tang San specially ate two Dragon Zoysia leaves before cultivating last night, and by now his Mysterious Heaven Skill internal energy was already completely recovered.</p><br/><p>Grandmaster’s gaze swept across the seven,</p><br/><p>“Follow the plan in the match. Try your utmost, and if you can’t do it, put your own safety first.”</p><br/><p>“Yes.”</p><br/><p>“Then good, depart.”</p><br/><p>Grandmaster swung his hand to everyone.</p><br/><p>At this moment, a voice suddenly blocked them,</p><br/><p>“Wait a moment.”</p><br/><p>Grandmaster looked distracted, gazing in the direction of that voice,</p><br/><p>“Flender, you still have something to add?”</p><br/><p>Today, Flender’s expression was extraordinarily grave.</p><br/><p>Ever since the Shrek Seven Devils had let him earn enough profit to fill both pots and jars in this tournament, he’d always had a smile on his face. But right now his smile was gone.</p><br/><p>Walking in front of the devils, he first arranged the lapels of Dai Mubai who stood in front, afterwards turning to all seven:</p><br/><p>“Children. For you, this the final fight of your graduation. Honestly, to have fostered talents like you, I feel very fortunate. And also extremely proud. There is no lack of banquets under Heaven, Shrek Academy is unable to always help you grow. Your future path, is all up to you to walk by yourselves.”</p><br/><p>“I said before that I won’t let you graduate unless you were the final champions. That’s just a joke, no need to take it seriously. What I want to tell you right now is that, no matter the outcome, you are all my pride, and also all my children. I won’t let any one of you become casualties in the last moment of the tournament. The championship isn’t important. What’s important, is you yourselves. I don’t want a victorious result, but rather your safe return. Well, I’ve said enough.”</p><br/><p>Ma Hongjun said:</p><br/><p>“Teacher, how come your eyes are red?”</p><br/><p>“Ah? It’s dust.”</p><br/><p>Flender immediately turned around. Grandmaster was the director of the Shrek Academy team, but as dean, he had clearly seen the effort these children had made each day. Of course he knew that the great effort of the Shrek Seven Devils in this tournament wasn’t all to temper themselves, but even more to bring this great glory to Shrek Academy before graduating.</p><br/><p>Just like he said, each of the Shrek Seven Devils was like his own child. Before these ultimate finals, on the verge of confronting that kind of power, Flender couldn’t keep from expressing his true feelings.</p><br/><p>In his heart, money was admittedly important, but no amount of gold could be exchanged for these seven little monsters in front of him.</p><br/><p>Tang San smiled faintly,</p><br/><p>“Dean Flender, others would hold a pep talk for the competing students, but aren’t you making us feel discouraged? Don’t worry. We’d all hate to die. Even more, there’s still those three spirit bones to make us drool with desire.”</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>Grandmaster patted Flender’s shoulder, his ordinarily languid gaze abruptly becoming severe,</p><br/><p>“Let’s go.”</p><br/><p>Striding forward with heads high, the Shrek Seven Devils left the residence. On the street, a lot of Spirit Masters silently watched them from the sides of the road. Even though the spirit power of these children perhaps wasn’t much, with their age, challenging the Spirit Hall Academy team, all of it made these Spirit Masters waiting for the battle secretly admire them.</p><br/><p>In front of Supreme Pontiff Palace, Tang San suddenly discovered that with each step he climbed, his feet become incomparably firm. He had never thirsted for victory like now. He knew that, if they lost the match today, he would definitely regret it for a lifetime.</p><br/><p>The sunlight brought a golden radiance to Supreme Pontiff Palace. Everyone’s gazes became serious, watching the Shrek Seven Devils walk step by step over the stones, the atmosphere seemingly thickening.</p><br/><p>The Supreme Pontiff, Ning Fengzhi, and the three Title Douluo spectating yesterday were already seated, the three spirit bone prizes laying in a red brocade tray to the side, releasing a faint halo of light.</p><br/><p>The Spirit Hall Academy team stood there silently, an intense murderous spirit pressing towards the Shrek Seven Devils just like knives. Under the effect of this enormous pressure, the Shrek Seven Devils’ pace up the hill clearly slowed a bit. The match still hadn’t started, but both sides were already crossing swords.</p><br/><p>“The Continental Advanced Spirit Master Academy Elite Tournament finals are about to begin, both sides prepare. The match will start in a quarter of an hour.”</p><br/><p>Both sides returned to their positions, the Shrek Seven Devils circling around Grandmaster. Tang San stretched his hand into the Wishful Hundred Treasure Purse, taking out seven rolled up dark green leaves. He ate one, and handed over one to each of the others.</p><br/><p>Foundation building Dragon Zoysia leaf, taking it would not only increase healing speed, provoking rapid spirit power recover, but at the same time could also make people’s mind even more focused. Eating it right now before the match was in order to maintain peak condition even longer in the fight.</p><br/><p>“Little San.”</p><br/><p>Dai Mubai looked at Tang San.</p><br/><p>Tang San gave him a firm nod,</p><br/><p>“Don’t worry. No issues on my side. For the rest, I’ll leave it to you.”</p><br/><p>Grandmaster took the lead to raise his right fist, and the each of the Shrek Seven Devils equally raised their hands. Eight hands piled together, at the same time as a gargantuan shout,</p><br/><p>“Certain victory!”</p><br/><p>Yes, certain victory. This was their only belief.</p><br/><p>On the other side, the Spirit Hall Academy team suddenly heard the shout on the Shrek Academ side, and team captain Xie Yue couldn’t help curling his lips, sneering,</p><br/><p>“Certain victory? We’ll let them have a look at true strength today. The gap in spirit power is an impassable gulf. Even the lowest ranked Spirit Master among us is on the same level as their captain. I want to see their basis for certain victory.”</p><br/><p>Sweeping an ice cold gaze across his companions, Xie Yue said coldly:</p><br/><p>“The Lord Supreme Pontiff is watching, the elders are also watching. We must not only gain victory in this match, but still a complete victory. Don’t give them any chances. I’ll deal with that Tang San. Who are we?”</p><br/><p>“Cham——pions——”</p><br/><p>An even more intense bellow echoed from the Spirit Hall Academy team.</p><br/><p>Both sides’ refusal to yield made the Spirit Masters watching below the hill feel like their blood was boiling, who hadn’t been young? Who hadn’t been hot-blooded? To them, the outcome of this match wasn’t important, what was important was to be able to see a brilliant fight.</p><br/><p>A quarter of an hour wasn’t long, and very soon the members of both sides walked into the plaza at the prompting of the referee. Perhaps it was in order to oppose needle with needle and spear with spear against Shrek Academy, but today the Spirit Hall Academy team had changed to fiery red uniforms embroidered with golden thread, clearly of excellent quality.</p><br/><p>Compared to them, Shrek Academy’s snot green, and moreover covered with countless advertising logos, uniforms were ridiculous.</p><br/><p>However, nobody would laugh at them. Capable of taking this step forward, capable of entering the finals of the Continental Advanced Spirit Master Academy Elite Tournament, nobody would sneer at their strength.</p><br/><p>“Prepare for the match, both sides can release spirits.”</p><br/><p>The cardinal referee announced as soon as both sides were in position.</p><br/><p>The fourteen members of both sides looked face to face. Nobody said a word, but the collision of auras made the smell of gunpowder in the air rise to the limit in an instant. At this moment, even respected powers like Supreme Pontiff Bibi Dong had their gazes completely focused on this match.</p><br/><p>The seven Spirit Hall Academy members moved practically simultaneously, surging spirit power erupting from their bodies in a flash.</p><br/><p>Of Xie Yue’s trio standing furthest ahead, each had a glittering two yellow, two purple, and one black ideal spirit ring configuration. The other four behind them also had two yellow and two purple optimal allocations. The expression in each person’s eyes became extremely persistent. One of the male students standing furthest in the rear swiftly retreated a step, a glorious golden scepter in his hands. Most certainly, he possessed a support model tool spirit.</p><br/><p>At the same time as they released their spirits, the Shrek Seven Devils’ side simultaneously started to release theirs. The seven stood in order, Tang San and Dai Mubai furthest in front, and behind them separately stood Zhu Zhuqing, Ma Hongjun and Xiao Wu, with Ning Rongrong and Oscar in the last line, assuming a two-three-two formation.</p><br/><p>Entirely different from the last match, this time Shrek Academy didn’t use the seven fusion ability, but rather extremely normally released their spirits simultaneously.</p><br/><p>Seven people, all with four spirit rings. Of course, drawing the most attention was still Tang San with the ten thousand year spirit ring.</p><br/><p>Supreme Pontiff Bibi Dong’s brows wrinkled slightly, unconsciously turning to look in Grandmaster’s direction, thinking in her heart, ‘Xiao Gang, you really changed formation again.’</p><br/><p>Grandmaster didn’t look at her, only concentrating his attention to watch the circumstances in the ring. His expression was no longer calm. Regarding this match, he also didn’t hold absolute certainty.</p><br/><p>“Match start.”</p><br/><p>As he declared the start of this Continental Advanced Spirit Master Academy Elite Tournament’s final finals, the cardinal speedily withdrew, vacating the ring.</p><br/><p>The first of the Spirit Hall team to move wasn’t the team captain Xie Yue furthest in front, but rather his little sister Hu Liena.</p><br/><p>Stepping lightly and gracefully, Hu Liena only seemed to turn her body, but had already reached furthest in front. A faint smile floated onto her face, and along with the release of her spirit, she seemed to become beautiful, and a great fuzzy tail still sprouted behind her.</p><br/><p>Faint red light appeared from her body, light flashing in the pupils of her eyes. Looking at Tang San, her movements were exactly the same as the time she dealt with Heaven Dou Imperial Academy team’s Yu Tian-Heng. That unique charm made people unable to think of pulling their eyes away from her.</p><br/><p>But somewhat startling to Hu Liena was that, confronted with the release of her spirit, the Shrek Seven Devils remained unmoved. Apart from Tang San and Xiao Wu, the other five swiftly closed their eyes and used their fingers to stop up their ears, completely isolating themselves from sight and hearing.</p><br/><p>Even the best charm ability needed a trigger; hearing, sight, taste, smell, touch, sensation. They were released through one of the six, and right now, the venues Hu Liena could influence the Shrek Seven Devils lacked sight and hearing. The smooth movements of the Shrek Seven Devils undoubtedly made her charm lose effect.</p><br/><p>Xiao Wu suddenly stepped forward, giving Hu Liena a smile, her second spirit ring flashing with pink light. Her eyes were already completely pink. Soft Bones Demon Rabbit’s second spirit ability, Charm, launched.</p><br/><p>Using charm against charm, the one with the greatest spirit power would hold the advantage.</p><br/><p>Xiao Wu and Hu Liena groaned practically simultaneously. Hu Liena only swayed once, but Xiao Wu too three steps back, her face deathly pale, two streaks of blood flowing down like little snakes from her nose, clearly it was her loss. In spirit power and mental strength, there was still a large gap between her and Hu Liena.</p><br/><p>Even though Xiao Wu was injured, she had undoubtedly broken Hu Liena’s initiative. Face changing slightly, Hu Liena immediately moved.</p><br/><p>And at this moment, standing furthest ahead in the team, Tang San also put his hand behind his back to catch the pink ray of light Oscar flung at him, stepping forward with large strides, heading straight for the seven on the other side. At the same time, six strands of Blue Silver Grass rushed out of his right hand, each twisting around the waists of his seven companions. Blue Silver Grass control, was already in full swing.</p><br/><p>Hu Liena looked coldly at the advancing Tang San, her five spirit ring flickering extremely rhythmically once. First that black fifth spirit ring, then the fourth, third, second, all the way to the final yellow first spirit ring. As each spirit ring pulsed, the pink light around her would become even more intense. Behind her, Xie Yue also moved at this moment.</p><br/><p>Xie Yue’s Moon Blade wasn’t one, but rather two. Two entirely blood red, half moon shaped crescents, his hands each holding a moon blade. Along with his body moving now, he extended both hands, and unexpectedly full body tackled his little sister from behind.</p><br/><p>At this moment, two yellow lights simultaneously shot out from the scepter in the hands of the Spirit Hall Academy team’s support type Spirit Master, the golden light glittering, and swiftly merging with Xie Yue and Hu Liena.</p><br/><p>A curtain of red light suddenly appeared, spread. The instant Xie Yue and Hu Liena collided, that red light wrapped the two of them within.</p><br/><p>And at the same time, that red light also erupted in a flash, spreading like a red sphere, covering close to half the stage.</p><br/>\n</div>"}