{"title": "Chapter 136", "id": 136, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-136", "volume_title": "Volume 2", "body": "<h1>Chapter 136</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 136</p><br/><p>Hell Slaughter Arena</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Tang San had already learned what Bloody Mary was before coming here. Human blood. According to what he saw, that person just now should have had to contribute who knew how much blood in order to become like that. Perhaps he wouldn’t be able to endure much longer.</p><br/><p>“When contributing so much Bloody Mary, wouldn’t they get taken advantage of?”</p><br/><p>Tang San frowned.</p><br/><p>The black masked young woman said:</p><br/><p>“No, right now you’re on the outskirts of Slaughter City, it’s not the true Slaughter City. Only the inner city is the truly lawless place. Contributing Bloody Mary and struggling on at death’s door can only be done in the outer city, and casual murder isn’t allowed here. Only those warriors who have survived the Hell Slaughter Arena have the qualifications to live in the inner city. Of course, the pleasures that can be obtained there are greater than outside, but it’s also where you can face the test of death at any time.”</p><br/><p>“In other words, Slaughter City is a completely different world. Then what is Slaughter City’s food source? There shouldn’t be anything that grows in a place like this, and nobody to plant.”</p><br/><p>As Tang San spoke, his gaze was on that black masked young woman the whole time. His Purple Demon Eye wasn’t a spirit ability, and naturally it wouldn’t be restricted. In this brief time, he had simply experimented. The additional abilities of spirit bones wouldn’t be influenced by the peculiar domain here.</p><br/><p>The black masked young woman’s face changed slightly,</p><br/><p>“I’m sorry, I don’t know. I’m unable to answer.”</p><br/><p>Tang San indifferently said:</p><br/><p>“Then doesn’t Spirit Hall know about this place? If they knew, as they’re always posing as righteous, why wouldn’t they come to eliminate you?”</p><br/><p>His questions could even be said to lack any politeness, but there was a lot of learning within. Even though Slaughter City was an underground world cut off from the outside, since his father knew about it, and since there were so many people in the tavern outside when he arrived, it showed that there was no lack of guides to this place outside.</p><br/><p>The black masked woman laughed coldly,</p><br/><p>“So what if they know? Spirit hall wouldn’t move against us to any extent. First let alone the benefits they can gain from this place, there’s not a single advantage to them in destroying Slaughter City. Mister 9528, don’t forget that it’s practically impossible for people who can enter Slaughter City to leave. And to be able to come here, all are humans brimming with depravity and sin. This place doesn’t have any relation to the outside world. Slaughter City is like a special prison, a place helping Spirit Hall to detain convicts whose sins are great. You asked why Spirit Hall doesn’t destroy this place? They’re probably eager to have even more vile people come here.”</p><br/><p>Tang San’s face revealed a cold smile. It really was as he thought. The existence of this Slaughter City was established with the indulgence of Spirit Hall. No matter what was said, even if spirit abilities couldn’t be used here, its strength still couldn’t compare to the Spirit Hall that covered the Continent.</p><br/><p>As they walked along the street, there were gradually more people to the sides. Practically every face displayed an unhealthy pallor, and even more were emaciated.</p><br/><p>No need to ask, these were all people that didn’t dare enter Hell Slaughter Arena, and relied on giving two cups of Bloody Mary each month to struggle on at death’s door.</p><br/><p>Tang San’s own experience with drinking that cup of Bloody Mary was still fresh on his memory. He clearly remembered that the cup contained nearly half a jin, making it one jin of blood each month.</p><br/><p>One or two months might not be an issue, but continuing like this in this sunless place, how would the body be able to endure?</p><br/><p>Tang San thought in his heart that, perhaps, this Slaughter City was originally secretly backed by Spirit hall, otherwise, where would a city like this get food from? Where would they get all kinds of goods?</p><br/><p>On either side of the streets in the outer city were simple black stone houses, and on even intervals along the road, there would be places to eat. A lot of people stood there in rows, waiting to receive food. The impression they gave was also little more than beggars. As for what was called the paradise of crime, what was called pleasure, there was basically none.</p><br/><p>The black masked young woman gave a simple explanation for all of this. Sinners were separated into three, six, nine and so on, and only the truly formidable sinners could find pleasure in paradise. As for useless rubbish, they had no right to enjoy themselves.</p><br/><p>The city was even bigger than Tang San had imagined. After walking for more than an hour, Tang San had some familiarity with the outer city, and the black masked young woman had brought him to a city wall.</p><br/><p>Compared to the outer walls, this wall wasn’t so high, only ten meters or so at its tallest. Very clearly, behind this wall lay Slaughter City’s inner city.</p><br/><p>The gates were wide open, and there were no guards. The black masked young woman indifferently gave Tang San an introduction:</p><br/><p>“The inner city doesn’t need guards. The people of the outer city only need to have the courage to enter to walk inside at any time. Of course, once inside, they must endure the unknown of the world inside. You’ve just arrived in Slaughter City, so I suggest you best live in the outer city for a time. Once you’ve adapted to everything here, it’s fine to enter the inner city. After we enter the inner city in a moment, please don’t stray more than five meters from my side, otherwise I won’t be able to guarantee your safety.”</p><br/><p>“Is it safe with you?”</p><br/><p>Tang San somewhat laughing asked.</p><br/><p>The black masked young woman gave him a glance, revealing a not particularly beautiful arrogant light flashing through her eyes underneath the black muslin,</p><br/><p>“I’m an envoy of the Slaughter King. In Slaughter City, there is nobody who dares offend the dignity of the Slaughter King. The twelve hours after you enter this world is the rookie protection period, having me at your side is the best protection of your life. After this period, your life and death can only be decided by Heaven.”</p><br/><p>There was still a rookie protection period. It seemed that this Slaughter City really had its own system.</p><br/><p>Without the slightest hesitation, Tang San entered the inner city together with the black masked young woman.</p><br/><p>Only one step into the inner city, Tang San immediately felt an entirely different atmosphere from the outer city.</p><br/><p>If the outer city was described as a cold and deathly still world, then the inner city was a luxurious and frantic world. Lights of all colors could be seen everywhere, and there were a lot more people than in the outer city, as different as black and white from the atmosphere outside.</p><br/><p>The inner city was extremely chaotic. Everywhere were excited laughter and agonized wails, as well as numerous absolutely horrifying sounds.</p><br/><p>As far as the eye could see, in a corner on the left side an extremely tall and sturdy man pulled an ample woman by the hair, his lower body pounding forcefully, unburdening his desire in public under numerous gazes. A crowd stood in a circle around them, cheering him on.</p><br/><p>On the other side, three or four people were wildly beating up a young man. Tang San saw one of that man’s arms being torn off, the person who tore it off still holding it and chewing on it with big bites.</p><br/><p>“Rather than calling this a paradise of crime, it’s more like a world of beasts.”</p><br/><p>Tang San said indifferently.</p><br/><p>Light flashed in the eyes of the black masked young woman next to him, speaking in a low voice:</p><br/><p>“Do you have the authority to dispute the Slaughter King? If it’s like that, the great Slaughter King will inevitably erase you from this place. Since you’ve come here, you can only comply with the rules.</p><br/><p>Tang San looked at her, declining to comment,</p><br/><p>“Bring me to Hell Slaughter Arena.”</p><br/><p>The black masked young woman was clearly somewhat resentful towards him, and this time didn’t say anything else, rather stepping out into the inner city with large strides.</p><br/><p>The inner city could indeed be called an extravagant place, or perhaps rotten. Like the black masked young woman said, at her side, even though a lot of ill intentioned gazes fell on Tang San, nobody stepped forward to harass him.</p><br/><p>In this place, Tang San’s heart constantly contracted. In his eyes were reflected too many things he had never seen.</p><br/><p>Men and women could be fucking in the streets at any time, there were even some who killed in the middle of the act. Tang San clearly saw a man at the moment of orgasm get his throat cut by a blade the woman below him spit out of her mouth.</p><br/><p>And that gaudy woman sucked the scarlet liquid flowing from the man’s throat with spastic jerks.</p><br/><p>Despite having no food in his stomach, Tang San still almost threw up several times. His loathing of this world multiplied exponentially.</p><br/><p>He suddenly discovered that, in this city, there was basically no need for his meticulous control, killing intent still unceasingly gushed out. It seemed as if only by slaughter could he discharge the violent currents stored within his heart.</p><br/><p>As they walked, there was suddenly a disturbance up ahead. Several dozen people stood in a circle, and there was moreover blood curdling screams constantly echoing from their midst.</p><br/><p>A whiff of blood was violently emitted from within, and the circle of spectators got out of the way to open up a path, a figure slowly moving away from the middle.</p><br/><p>Seeing this person, Tang San unconsciously stopped walking, his eyes displaying an unconcealable astonishment. He had never expected that in this city of sin, Slaughter City, he would actually see someone he recognized.</p><br/><p>Walking out from the middle of the crowd was a young woman. Dressed entirely in black, long hair combed neatly behind her and tied with a piece of rope. She held a more than one chi long dagger, glittering with cold light.</p><br/><p>A pair of beautiful eyes glittered, brimming with bewitching charm. Compared to those women he’d seen on the streets before, she was like a blue lotus untainted by mud.</p><br/><p>A close to perfect figure, and the previous different ice cold temper, none failed to draw people’s attention.</p><br/><p>A drop of blood quietly rolled off that glossy like a mirror dagger in her hand. The eyes of the people standing in a circle and watching her held a fearful expression.</p><br/><p>That’s right, Tang San knew this person. Two years ago, before he had followed his father far and wide, this woman had fallen before him.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>One of the pillars of the Spirit Hall Academy team back then, the only woman of Spirit Hall’s Golden Generation, Bewitching Fox Hu Liena.</p><br/><p>Why would she be here? This was the first thought in Tang San’s mind. His gaze unconsciously fell on Hu Liena.</p><br/><p>Perhaps it was because Tang San’s gaze was too sharp, or possibly because he didn’t fit into this world, but the dagger wielding Hu Liena finally glanced at him.</p><br/><p>Four eyes met. Hu Liena first looked blank a moment, and Tang San was equally somewhat astonished.</p><br/><p>Hu Liena naturally didn’t recognize Tang San with his appearance substantially changed, the thought in her heart was ‘could it be that there was still an ordinary person in this vile place?’</p><br/><p>But Tang San’s astonishment lay in the cold killing intent coming from Hu Liena right now. Like him, Hu Liena’s aura had clearly also changed from the depravity of Slaughter City, her killing intent was one that would repel people a thousand li away.</p><br/><p>Even to the extent that the once bewitching charm in her eyes had disappeared.</p><br/><p>At just this moment, Tang San suddenly felt a cold wind thrusting obliquely at him, and Hu Liena in front of him also suddenly moved, holding the dagger, she swiftly pounced towards him.</p><br/><p>Heart shivering, Tang San knew that Hu Liena’s spirit power should still be above his own. Under the careful nurturing of Spirit Hall, even if her physical attributes weren’t on the same level as his, it still wasn’t far away.</p><br/><p>And the intensity of the obliquely thrusting cold wind wasn’t weak either.</p><br/><p>The attack on two sides revealed Tang San’s adaptability. Swiftly taking one step back, half turning, a completely noiseless black light had already quietly shot out to the side.</p><br/><p>A ding sound echoed. Astonishing Tang San was that Hu Liena’s dagger wasn’t aimed at him, but rather blocked what previously was his side, just obstructing a large curved saber glittering with cold light.</p><br/><p>The one mounting a sneak attack on Tang San’s side was a small built, black clothed man. Right now, his entire body was already completely motionless. Right between his eyebrows, a drop of blood slowly rolled out.</p><br/><p>It gave the impression that this Tang San and Hu Liena had joined hands to kill this man. As an observer, that black masked young woman had seen the entire process.</p><br/><p>Hu Liena’s killing intent had locked down that man with the curved blade, one strike making him sway, and the black light issued from Tang San’s hand had ended his life.</p><br/><p>Originally, because Tang San had stopped walking when he saw Hu Liena, his distance to the black masked young woman already exceeded ten meters.</p><br/><p>The assassin collapsed loudly to the ground, and Hu Liena turned to look at Tang San, her eyes revealing a trace of unusual light. Tang San had already come to himself now. Because of the change in his appearance, Hu Liena clearly didn’t recognize him.</p><br/><p>Hu Liena hadn’t changed much in the last two years. Two years ago, she was already twenty, and at the time Tang San was still only fourteen. After two years, Tang San had changed not only appearance because of Blue Silver Grass, but his temperament had also undergone a heaven and earth revolving change.</p><br/><p>If Tang San two years ago was described as completely sharp, the elite of the new Spirit Master generation, then, after two years his aura had become completely reserved. If he didn’t say it himself, nobody would believe he had just only turned seventeen now.</p><br/><p>At the same time, Tang San had also grown taller. Further adding the changes in his temperament, let alone Hu Liena, even Xiao Wu might not recognize him if she suddenly saw him.</p><br/><p>“Thanks.”</p><br/><p>Tang San nodded to Hu Liena. Even though he was brimming with enmity for Spirit Hall, right now he was more concerned with hiding himself, and since he hadn’t been recognized, he naturally wouldn’t foolishly reveal any holes for Hu Liena to see through.</p><br/><p>Hu Liena looked at the black masked young woman walking next to Tang San, her face revealing a smile. It had to be said that her appearance was very beautiful, not a bit inferior to Zhu Zhuqing, Ning Rongrong and Xiao Wu. They didn’t have her maturity and charm either.</p><br/><p>“You’re new?”</p><br/><p>Tang San nodded.</p><br/><p>The expression in Hu Liena’s eyes shifted slightly,</p><br/><p>“There are dangers with every step here. It’s best to be a bit careful. By your appearance, you don’t seem like you’re a degenerate.”</p><br/><p>Finished saying this, she looked deeply at Tang San again, then walked into the darkness on the other side of the street.</p><br/><p>“If you want to survive, it’s best to stay away from that woman.”</p><br/><p>The black masked young woman’s voice rose by Tang San’s ear. Her words clearly contained a bit of enmity towards Hu Liena.</p><br/><p>“Why so?”</p><br/><p>Tang San also really wanted to know why Hu Liena would appear here, as well as the circumstances here. To him, the biggest opponents among his peers were no doubt Spirit Hall’s Golden Generation trio.</p><br/><p>The black masked young woman said:</p><br/><p>“That woman has already been in Slaughter City for almost a year. Within one year, she’s fought sixteen fights in the Hell Slaughter Arena for sixteen wins. Her opponents were all tortured to death by her. In Slaughter City, her present achievements already puts her in the top one hundred.”</p><br/><p>“Sixteen wins is enough to enter the top one hundred?”</p><br/><p>Tang San somewhat astonished said.</p><br/><p>The black masked young woman glanced at Tang San, as if he was an idiot,</p><br/><p>“Mister 9828, judging by your appearance, you’re not stupid. Do you believe that the battles in the Hell Slaughter Arena are the same as the ones in the Great Spirit Arenas outside? Here, each match is the difference between life and death, even the victors will very possibly still be assassinated after the end of the match. To maintain a record of sixteen wins is already quite terrifying. To be precise, nobody will be your friend here. Each person will take the chance to kill you if they can. Even the woman moaning under you.”</p><br/><p>“Thank you for the advice.”</p><br/><p>Tang San smiled calmly. He had already faintly guessed Hu Liena’s goal in coming here. It was likely the same as his. It seemed that this woman really had courage.</p><br/><p>“Let’s go, Hell Slaughter Arena is up ahead. The heart of Slaughter City.”</p><br/><p>Led by the black masked young woman, Tang San saw a peculiar building. The structure seemed round, but to be more precise it was an irregular cone. The base had the largest area, and then got subsequently smaller with height until it was almost thirty meters tall, after which it continued with the same diameter until fifty meters.</p><br/><p>This Hell Slaughter Arena’s area really wasn’t small, not much different from the Suotuo Great Spirit Arena Tang San saw before, and just a bit smaller than Heaven Dou City’s Great Spirit Arena.</p><br/><p>The black building made people feel even more oppressed. The black masked young woman gave Tang San an introduction, the location of this Hell Slaughter Arena was the center of the entire Slaughter City. This clearly showed how important it was to Slaughter City.</p><br/><p>“Are there no rules to the fights here?”</p><br/><p>Tang San asked.</p><br/><p>The black masked young woman said:</p><br/><p>“Very simple, after entering, use your own ID badge to sign up. Afterwards wait for the match to start. During the waiting time, you’re not allowed to attack. Ten people enter each slaughter match. You can use any methods, as long as you can walk away from it in the end. Only one person can leave alive from each bout.”</p><br/><p>One out of ten, truly worthy of being called Slaughter City. Tang San continued asking:</p><br/><p>“Then how do I become the so-called champion?”</p><br/><p>The black masked young woman looked somewhat astonished at Tang San,</p><br/><p>“As long as you can participate in one hundred matches, you’ll be the champion. Only, the present first ranked in Slaughter City has only participated in sixty seven matches. With each match you participate in, your ID badge will gain one victory, and you can live here for one year, seeking pleasure as you like in the inner city. Of course, you have to ensure yourself that you can stay alive after the pleasure.”</p><br/><p>“I want to go in for a look.”</p><br/><p>The black masked young woman said:</p><br/><p>“The qualifications to observe the battles is one cup of Bloody Mary. It can be your own, or it can be someone else's. As long as you don’t feel tired, you can watch for as long as you like after entering. The matches go on constantly. As long as people sign up, and ten are gathered, the fight can start.”</p><br/><p>Tang san’s brows wrinkled slightly. He was unable to get over why this Slaughter City would attach such importance to blood.</p><br/><p>Right now, several people just entered the Slaughter Arena. It really was like the black masked woman said, each person held a cup of scarlet blood in their hands.</p><br/><p>Heart twitching, Tang San already had a plan. He walked over towards that last man about to enter the arena with large strides.</p><br/><p>That was a big man with a shaven head and bare torso, a naked woman tattooed on his chest. Only, because his chest was crisscrossed with terrifying scars, that image of the naked woman not only didn’t seem beautiful, but was on the contrary brimming with a kind of fierce-looking resentment.</p><br/><p>“I’ll trouble you to give me your Bloody Mary.”</p><br/><p>Blocking the shaven headed man’s path, Tang San held out his right hand.</p><br/><p>The baldy looked distracted a moment, glancing at the black masked young woman next to Tang San, and an ominous glint flashed in his eyes.</p><br/><p>The black masked young woman’s somewhat impatient voice rose,</p><br/><p>“Mister 9528, if you take the initiative to provoke, the rookie protection won’t have any effect.”</p><br/><p>These words were not only a reminder for Tang San, but also equally a reminder for that baldy. With a malicious laugh, the baldy pulled out a saw toothed big blade from somewhere, chopping head-on at Tang San.</p><br/><p>His motions didn’t seem very fast, but they had a feeling of mountainous pressure. That was spirit power fluctuations.</p><br/><p>At least fiftieth rank. This was Tang San’s estimation of the opponent.</p><br/><p>But he didn’t withdraw his extended hand. Right palm flipping, he issued a power that could support the sky. In the hollow of his palm, an intense attractive force diverting the force of the opponent’s chopper to the side. At the same time his left foot swiftly took a step forward, pulling close the distance between him and the baldy.</p><br/><p>Where spirit abilities couldn’t be used was the best place to use the secret lore of Tang Sect, Controlling Crane Catching Dragon combined with Mysterious Jade Hand.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>The bald man only felt the sawtoothed big chopper in his hand uncontrollably slip sideways, and was just grabbed by Tang San’s raised right hand. Tang San forcefully pulled forward, dropping his shoulder, and directly smashing the chest of his opponent.</p><br/><p>Using Ghost Shadow Perplexing Track, Tang San’s speed could be described as lightning fast, and further adding that him grabbing the opponent’s weapon with his bare hands revealed a brief weakness, his movements, as natural as moving clouds and flowing water, immediately held the advantage.</p><br/><p>But that bald big man’s reactions were surprisingly fast. Instantly letting go of the chopper in his hand, his other hand smashed the cup directly at Tang San’s face at the same time as he retreated, both hands guarding his chest.</p><br/><p>Half turning, Tang San forcibly diverted his own forward momentum. With a shake of his left hand, that cup entered his hand, and with a bizarre few shakes of his wrist, he unexpectedly didn’t spill a single drop.</p><br/><p>“Thanks.”</p><br/><p>Having obtained the Bloody mary, Tang San didn’t say more, and turned to walk inside.</p><br/><p>Even though the bald big man hadn’t been struck, Tang San’s instantly erupting force had still managed to startle him. His face brimmed with malevolence, but strangely, he didn’t show any intention of getting back that Bloody Mary. Turning to leave, he didn’t pause.</p><br/><p>“Kindness to the enemy, is cruelty to oneself.”</p><br/><p>As Tang San walked, he muttered to himself. Flipping the sawtoothed big chopper in his hand, his fingertips swayed ingeniously a few times, and that big chopper flew out quietly. That enormous weapon unexpectedly didn’t make a sound. By now, the baldy had already turned a corner on the other side of the street, disappearing from Tang San’s view.</p><br/><p>However, that sawtoothed big chopper seemed to have grown eyes, slashing in a beautiful arc. A blood curdling scream was heard in the darkness. Afterwards, there were no more sounds.</p><br/><p>“We’re entering.”</p><br/><p>Tang San calmly said to the somewhat lifeless black masked young woman.</p><br/><p>“You……”</p><br/><p>This was already the second time the black masked young woman had seen Tang San act. Compared to the first time, this time shocked her even more. She recognized that baldy, in Hell Slaughter Arena, that baldy had already endured seven matches. In other words, he was the only survivor out of seventy people killing each other.</p><br/><p>She sensed that this youth in front of her hadn’t been much stronger than his opponent, but the way he killed was as simple as squashing an ant.</p><br/><p>The interior of Hell Slaughter Arena seemed even simpler than the outside. Without any partitions, row after row of stands extended upwards in circles. Below these was a more than one hundred meter diameter immense empty arena. At this moment, there weren’t very many spectators, filling less than twenty percent of the enormous space. In the arena, miserable shrieks rose constantly. Of altogether ten people, there were already seven corpses, the final three struggling for their lives.</p><br/><p>When he entered, Tang San poured the cup of Bloody Mary he held in an enormous receptacle.</p><br/><p>“I’ll trouble you to sign me up. I want to participate in the next match.”</p><br/><p>Tang San said to the black masked young woman.</p><br/><p>By now, the black masked young woman no longer thought the youngster in front of her was an idiot. Tang San’s strength had caused her heart to birth a trace of terror. Nodding without the slightest hesitation, she took the ID badge Tang San held out.</p><br/><p>Tang San only felt disgust towards Slaughter City. Therefore, he didn’t want to delay here for even a day. Becoming the champion after a hundred victories, then challenging the Hell Road, and he could leave this place. He had already decided to start fighting from today, from right now. Distantly, he sensed a gaze focused on him. Turning his head to look, he saw the person looking at him was Hu Liena.</p><br/><p>Slaughter City, from this day on, on this dark world, this world brimming with blood and depravity, he not only had to obtain victory in match after match, but also return alive.</p><br/><p>Three days after entering Slaughter City, the number of people Tang San had killed already surpassed three digits. But the number of matches he had joined, was only two. In these three days time, Tang San understood that the true terror in this place wasn’t the enemies in the Hell Slaughter Arena, but rather the constant ambushes after the end of the matches when he was at his weakest.</p><br/><p>It was no wonder that Hu Liena could only pass sixteen matches in one year. From here, Tang San learned caution, prudence, and even more patience.</p><br/><p>One month had passed, and Tang San’s victories in the Hell Slaughter Arena had grown to nine. By now there were fewer and fewer with the courage to ambush him, but they were also more and more powerful. Along with the number of his victories rising, he learned another rule. With each new match, the opponents he confronted couldn’t have more than five fights than him in the Hell Slaughter Arena behind them. Unless everyone had more than that many fewer matches than him.</p><br/><p>After a year.</p><br/><p>The ice cold aura made people choke, in the Hell Slaughter Arena, altogether ten people slowly entered. Tang San walked third among these ten, but he was the focus of attention for all the other nine.</p><br/><p>Sixty seven competitions, and naturally also sixty seven wins. This was Tang San’s present record. In all of Slaughter City, only two people had a better achievement than him. One of those was Hu Liena with seventy two victories.</p><br/><p>Each person coming to participate, besides the authority to continue existing in Slaughter City, most looked forward to a hundred victories. With the title of champion of a hundred bouts, one could live in Slaughter City forever. Besides not being able to leave, one would possess the highest authority. Even to the extent of becoming guests of the Slaughter King.</p><br/><p>Sixty seven matches. The number of people who had lost their lives by Tang San’s hands had long since surpassed a thousand. Only, in the last two months, even after the match ended, nobody had dared ambush him.</p><br/><p>It wasn’t that Tang San didn’t want to finish a hundred matches as soon as possible, but rather because after his number of victories grew, the number of people who had the courage to participate in slaughter matches with him grew fewer and fewer. It frequently took several days to collect ten people, and that was moreover under conditions where the news of him participating in the Hell Slaughter Arena didn’t leak in advance.</p><br/><p>In one year, Tang San and Hu Liena had become characters like celebrities in Hell Slaughter Arena. Especially Tang San who, having used only a year to obtain such a record, could already rank in the top ten since Slaughter City’s founding.</p><br/><p>Compared to when he first arrived, the expression in Tang San’s eyes was a level colder, to the extent that his body even released a faintly blood reeking aura. Ice cold, bloodthirsty, ruthless, those had already long since become synonyms with him.</p><br/><p>It wasn’t that he could overpower the opponents with spirit power. Even a few opponents whose spirit power surpassed the eightieth rank had died in Tang San’s hands. Spirit Masters without their signature were like tigers who had lost claws and teeth. Let alone when Tang San himself was like a terrifying killing machine.</p><br/><p>His most dangerous time was when he left the Hell Slaughter Arena just after destroying two opponents with eightieth ranked spirit power, and was immediately besieged by more than a hundred people. One couldn’t tell how many blades cut him, but the final conclusion was that all those hundred people died, and moreover not leaving whole corpses behind. And Tang San had crawled like that from the piles of pieces of dead men, his whole body emitting a black energy.</p><br/><p>After three days, his injuries were gone as if he had never been wounded, and he had entered Hell Slaughter Arena once again. That day, nobody dared fight. For twenty four hours, there was not a single bout in Hell Slaughter Arena.</p><br/><p>He had the Tang Sect secret lore that common Spirit Masters didn’t, hidden weapons, poison, Controlling Crane Catching Dragon, Mysterious Jade Hand, Ghost Shadow Perplexing Step. And he still had the solid Clear Sky Hammer as a weapon. Tang San didn’t use Blue Silver Grass, nor did he use Eight Spider Lances. Purple God Light had also only been used in that most dangerous moment. It wasn’t that he wanted to hide anything in front of Hu Liena, but rather that those were techniques he had set aside as life saving trumps.</p><br/><p>That time, Tang San had made his name, his current name in Slaughter City: Asura King.</p><br/><p>It was of course impossible for the nine people entering the arena with Tang San now to have a victory count only five lower than his, because Tang San’s was already far, far too far ahead by now. And he didn’t know if Hu Liena was intentionally avoiding fighting him or if it was planned by Hell Slaughter Arena, but from the start, Tang San had never encountered her. Therefore, the two of them were both still alive. Hu Liena also had a name here, her nickname was Hell Envoy.</p><br/><p>Among the nine people entering the Hell Slaughter Arena with Tang San right now, there were three who were already trembling all over, and the remaining six were trying to put up a strong front. After the nine entered the arena, they surrounded Tang San in practically the first instant. Because they knew, if they didn’t kill Tang San, they wouldn’t leave alive.</p><br/><p>Within his deep blue pupils was a smear of blood red, an ice cold killing intent extended from Tang San in practically an instant. Closing his eyes, he seemed to enjoy the feeling of the trembling degenerates around him.</p><br/><p>Tang San’s spirit power had progressed very little in this year, only rising one rank. But he believed that the him right now could completely prevail over three of him from a year ago. He also understood the meaning of his father’s words more and more clearly. Only by constantly struggling on the edge of life and death could the true meaning of battle be understood.</p><br/><p>Snarling, hissing, nine voices rose practically simultaneously in nine directions around Tang San. Those nine opponents simultaneously threw themselves at Tang San.</p><br/><p>Sharply opening his eyes, what Tang San looked at wasn’t the opponents in front of him, but rather, in a dark corner of Hell Slaughter Arena’s stands, Hu Liena.</p><br/><p>In one year, Hu Liena had watched practically each and every one of Tang San’s matches.</p><br/><p>But she discovered that she couldn’t see through this man. For this man, she even felt an unprecedented dread.</p><br/><p>That wasn’t because of Tang San’s innumerable killing techniques, but rather because of this man’s unswerving will.</p><br/>\n</div>"}