{"title": "Chapter 131", "id": 131, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-131", "volume_title": "Volume 2", "body": "<h1>Chapter 131</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131</p><br/><p>Wisdom Skull Bone’s Ability, Purple God Light</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Tang San following behind his father stopped his steps, following Tang Hao’s gaze forward.</p><br/><p>Appearing in front of them, was a rolling mountain range stretching into the distance. They were unable to see all of the mountain range from where they stood, but even the outmost mountains were high enough to pierce the clouds.</p><br/><p>“Have your Eight Spider Lances recovered?”</p><br/><p>Tang Hao asked indifferently.</p><br/><p>Tang San nodded,</p><br/><p>“Already recovered.”</p><br/><p>Tang Hao gave Tang San a glance,</p><br/><p>“Use it. Keep up with me.”</p><br/><p>Leaving only six words, Tang Hao already soared up, climbing straight up the mountain wall in front.</p><br/><p>The mountain wall in front was extremely precipitous, close to ninety degrees, but Tang Hao still walked as if stepping on level ground. Each time the tips of his toes touched the mountain wall, his body would ascend more than ten meters, swiftly rising towards the top.</p><br/><p>Tang San drew a deep breath, condensing his spirit power. The Eight Spider Lances burst through the clothing on his back, abruptly extending.</p><br/><p>Passing half a month of recovery, the Eight Spider Lances had already regrown. Different from the icy mist of before, it seemed that they had become even more durable.</p><br/><p>Leaning forward, Eight Spider Lances bending, it made Tang San look like a giant spider leaning over, his chest close to the ground. The spider legs abruptly exerted themselves, sending Tang San shooting up like a bolt of lightning, directly ascending close to twenty meters.</p><br/><p>Cengcengcengcengcengcengcengceng—— The Eight Spider Lances pierced the mountain wall as if skewering tofu, Tang San hanging directly from them.</p><br/><p>As an external spirit bone, Eight Spider Lances had an extremely wide range of uses. Apart from not being able to fly, they could practically ignore the vast majority of terrain restrictions.</p><br/><p>After using Eight Spider Lances to stick to the wall, under Tang San’s control, the Eight Spider Lances moved rhythmically, bringing him to climb directly up the mountain wall just like a giant spider.</p><br/><p>Even though Tang Hao was very fast, when using the Eight Spider Lances, Tang San absolutely wasn’t slow. Relying on the four meter long enormous spider legs, he moved even faster than on level ground.</p><br/><p>With the rhythmic movement of the Eight Spider Lances, Tang San felt the blood within his body gradually warm up, his whole body indescribably comfortable. He understood that this was the process of the Eight Spider Lances’ complete fusion with his body after regrowing.</p><br/><p>Tang Hao was like an untiring machine, bringing Tang San across one mountain peak after another, using close to half a day to penetrate deep within the mountain range.</p><br/><p>Using Eight Spider Lances also consumed spirit power, and half a day of travel made Tang San dizzy with blurred vision.</p><br/><p>Just at this moment, a faint rumbling sound reached his ears, and the air also gradually grew moist.</p><br/><p>What was that?</p><br/><p>Tang San raised his head to look at Tang Hao in front. He discovered that his father seemed to be advancing in this direction.</p><br/><p>As they constantly came closer, that rumbling became more and more deafening. The air also became even more moist, the temperature was even a bit lower here than in the outside world.</p><br/><p>At last, Tang Hao halted once again. This was a mountain valley, to be precise, it was a pool.</p><br/><p>The deep water was so clear the bottom could be seen, tranquil and serene, like a giant blue gem.</p><br/><p>On one side of the valley was a twenty meter wide waterfall, covering the two hundred meter high mountain wall like a jade ribbon. That rumble was the sound of it striking the pool.</p><br/><p>The waterfall poured down in torrents, smashing into the pool, striking up countless splashes. In the sunlight, a seven colored rainbow spanned the pool, unspeakably dazzling.</p><br/><p>Tang San had just arrived when clear and cool water vapor hit his face, the moist atmosphere penetrating deep into his heart, exceptionally comfortable.</p><br/><p>Surrounded by mountains, ten thousand folds of blue and green, a rippling blue gem in front, and still that vast waterfall connecting heaven and earth. All this beauty made Tang San somewhat dumb.</p><br/><p>Tang Hao sat there quietly, his gaze all along falling on the waterfall pouring down like a silver river. For some reason, his always cold expression had changed, and that aged face revealed an unconcealable tenderness.</p><br/><p>Father and son stood there like that for a long time. It was still Tang San who first sobered from the beautiful scenery, subconsciously turning his head to look at his father.</p><br/><p>Perhaps it was because Tang Hao sensed his gaze, but his expression mended and he slowly turned to look at Tang San.</p><br/><p>“For the next two years, this is where you’ll live and cultivate. When thirsty, you have water in front of you. When hungry, you have all sorts of fruits in the mountains. You were together with Dugu Bo for so long, I expect you are able to separate which are poisonous.”</p><br/><p>Hearing his father speak, Tang San’s chest warmed. His gaze at his father also became even more burning with familial affection. His father knowing that he had once been with Dugu Bo, told him that his father had never been far from him.</p><br/><p>Tang San being so astute, he immediately inferred the reason his father had never appeared next to him. That was because he was afraid to influence his cultivation.</p><br/><p>Indeed, everything his Teacher had instructed him in, he could already to do the best degree. Even his father as a Title Douluo, even that Supreme Pontiff, might not compare to Grandmaster in teaching.</p><br/><p>“Turn around, your back to me.”</p><br/><p>Tang Hao said to Tang San.</p><br/><p>Tang San hurriedly did as asked.</p><br/><p>The instant he had turned, a pair of powerful large hands were placed on his shoulders. The next moment, Tang San only felt two warm streams pour into his body from those rough big hands.</p><br/><p>With two slamming sounds, Tang Hao’s hands rose and fell, striking Tang San’s back. Immediately afterwards, his hands swiftly moved across Tang San’s back like living creatures, and besides his head, he practically didn’t let any part of Tang San’s body escape.</p><br/><p>Where Tang Hao’s hands moved, Tang San only felt a warm surge enter his body. The fatigue from these days of quick marching was immediately obliterated.</p><br/><p>Where that warmth passed, it was half scalding, unspeakably comfortable. Tang San’s body gradually began to emit heat, and sweat that very rarely flowed since he ate the Octagonal Mysterious Ice Grass and Infernal Precious Apricot covered his forehead.</p><br/><p>Tang San didn’t know how much time passed, he only felt himself gradually growing drowsy, his whole body like it was being smelted in a furnace. He was completely relaxed from his father’s strikes. In this world, there were a few people Tang San wouldn’t be on his guard against, and Tang Hao was certainly at the top of the list. He was currently Tang San’s only blood kin.</p><br/><p>Suddenly, coolness flowed from the top of his head, just like being anointed with purest cream, it immediately roused Tang San from his drowsiness.</p><br/><p>The coolness still didn’t change, the sound of the waterfall hitting the pool once again became clear. Tang San lowered his head to look at himself, and discovered his clothes were long since soaked through.</p><br/><p>Tang Hao stood next to him. There seemed to be a fraction of exhaustion in the corners of his eyes, but his back was still perfectly straight. This might be the only part of Tang Hao that didn’t look old.</p><br/><p>“Your body is better than I imagined. But it’s hard to avoid internal damage in these days of competition. Remember, being injured isn’t bad, but you absolutely have to recover properly afterwards. Otherwise, the internal damage left behind will cause no end of trouble. I’ve helped you heal all your internal damage now. Your muscles and bones are a lot stronger than that of ordinary people, it should be related to the herbs you ate at Dugu Bo’s place. This is exceptionally good. It can save a great deal of trouble.”</p><br/><p>Tang San caught a rare trace of satisfaction on Tang Hao’s face. Of course his body was a lot better than that of ordinary people, being forged in the Ice and Fire Yin Yang Well and sharpened by the two great immortal herbs.</p><br/><p>If not for this, Tang San didn’t know how many times he would have died. It would also have been impossible to resist Xie Yue’s spirit fusion ability Full Moon ability that day.</p><br/><p>“Little San, do you know what your greatest problem is right now?”</p><br/><p>Tang Hao asked.</p><br/><p>Tang San’s heart twitched. Was this his father’s consideration for him? Pondering, he said:</p><br/><p>“It’s burst strength in battle. My spirit relies mainly on control, but lacks burst power. When encountering opponents like Xie Yue, dealing with them is comparatively difficult.”</p><br/><p>Tang Hao nodded, saying:</p><br/><p>“You’re right. In terms of control, Grandmaster’s instruction for you was absolutely flawless. Your control strength is already fairly outstanding, even if there are flaws, those are the flaws of the Blue Silver Grass. But there’s no need to worry, after you’ve obtained your sixth spirit ring, there will be a change in the fundamental nature of these circumstances.”</p><br/><p>“Ah?”</p><br/><p>Tang San looked shocked at his father. To be honest, even Grandmaster didn’t know how the Blue Silver Grass’ sixth spirit ring would change anything. Tang San didn’t dare believe that his father would actually know.</p><br/><p>Could it be that there was still someone in this world who had cultivated Blue Silver Grass to the level of the sixth spirit ring?</p><br/><p>From when his father talked about lore regarding hundred thousand year spirit beasts, until the possible routes of Blue Silver Grass now, to Tang San, it made his father seem even more mysterious.</p><br/><p>Tang Hao calmly said:</p><br/><p>“No need to ask me why. You will understand naturally later. My special training for you starts now. First take that spirit bone you got from Spirit Hall into your body. It’s quite useful to you.”</p><br/><p>After the end of the tournament that day, Tang San had held on to the mind condensing wisdom skull bone without immediately fusing with it. How could he have fused it in front of Supreme Pontiff Palace! Therefore he had directly stored the wisdom skull bone in his Twenty Four Moonlit Bridges.</p><br/><p>Now reminded by his father, he then took it out once again.</p><br/><p>Faint blue light pervaded the air with intoxicating energy fluctuations. Looking at the skull bone in front of him, Tang San couldn’t keep his heart from flickering.</p><br/><p>Spirit bone, would he finally obtain the first of the six spirit bones he could hold?</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Tang Hao calmly said:</p><br/><p>“The quality of this spirit bone is pretty good. Spirit Hall really doesn’t talk nonsense, it came from a spirit beast with at least fifty thousand years of cultivation. If not for Bibi Dong not needing, they wouldn’t have taken it out as a reward. This spirit bone should be prepared for that female Spirit Master of Spirit Hall’s three young Spirit Masters. Among those three, she’s the most outstanding.”</p><br/><p>“You’re talking about Hu Liena? But isn’t Xie Yue the leader of the Golden Generation?”</p><br/><p>Tang San somewhat shocked looked at his father. Xie Yue’s created spirit ability, Full Moon, gave him a too profound impression. That was a pain carved into his bones and engraved in his heart. Even breaking the Eight Spider Lances had barely blocked it.</p><br/><p>Tang Hao smiled coldly,</p><br/><p>“Of course not. What does Xie Yue’s created spirit ability count for? You don’t even need more strength, if your Clear Sky Hammer had reached the fortieth rank, it would take just one swing to to easily break it. That Hu Liena is the one you should watch out for. Her charm ability is extremely powerful. It might seem that the controller of the spirit fusion ability is Xue Yue, but in fact, the entire spirit fusion ability effect relies mainly on her. If they hadn’t used the spirit fusion ability, and her spirit abilities had come into play, it would have brought you a great deal of trouble. I don’t know how refined your eye skill is, but right now you can counter her perfectly. It’s also because of this that you don’t see how truly terrifying she is. Among the Shrek Seven Devils, if you weren’t there to counter her, she alone could send the rest of you packing. Bibi Dong is fostering her to be the next Supreme Pontiff.”</p><br/><p>In Tang San’s previous life, he had never come into contact with anything from the outside world. He had wholeheartedly thrown himself into hidden weapons research, and so gained enormous accomplishments in the field of hidden weapons.</p><br/><p>But it had also left him like a blank paper in terms of knowledge of the outside world.</p><br/><p>In this life, he had only just lived for fourteen years. How could his experience in society compare to Tang Hao? Now being reminded by Tang Hao, he suddenly had a feeling of a wide panorama opening up, and he nodded repeatedly.</p><br/><p>“Begin. Fuse with it first. With its help, your later cultivation will be twice the result for half the work. Your own intelligence surpasses your peers, adding everything Grandmaster has developed, as well as your eye skill, all of these can be boosted by this skull bone. In the absorption process, sense its energy with your whole heart. Don’t allow any distracting thoughts. I’ll protect you.”</p><br/><p>With Clear Sky Douluo’s protection, was there anything in the outside world that could be of concern?</p><br/><p>Tang San directly sat on the big rock he stood on. Both hands clasping that skull bone flickering with blue light, he slowly closed his eyes.</p><br/><p>Somewhat shocking to Tang Hao was that Tang San’s body unexpectedly gave rise to a spiritual[1] fluctuation.</p><br/><p>Even though the spiritual fluctuation wasn’t strong, it was extremely distinct. In fact, Tang Hao himself could only cause such a clear spiritual fluctuation after he was twenty five.</p><br/><p>And at that time, he was already regarded as the number one genius of the Clear Sky School. The Clear Sky School was also the number one sect under Heaven. But this son in front of him, had achieved it ten years earlier than he did.</p><br/><p>Without Tang San’s attentive gaze, Tang Hao no longer hid his inner world. The lines of his face became a lot gentler, and he even had a slight smile as he watched that raging waterfall like before.</p><br/><p>Along with that spiritual fluctuation pouring into the wisdom skull bone, the blue light of the skull bone suddenly grew intense. In practically an instant it had enveloped Tang San’s body, distributing blue sprouts of radiance.</p><br/><p>The reason why spirit bones were even more precious than spirit rings was that, besides being more difficult to obtain, the more important reason was that there were no spirit power restrictions on absorbing spirit bones. In other words, if you were lucky enough to obtain it when you only had one rank of spirit power, you could still absorb even a hundred thousand year level spirit bone.</p><br/><p>Therefore, even though Tang San was now absorbing the spirit bone from a more than fifty thousand year spirit beast, there still wouldn’t be any danger. It would even be a lot safer than when he originally absorbed the Man Faced Demon Spider’s spirit ring.</p><br/><p>Within that blue light, the first thing Tang San felt was an ice cold spirit power fluctuation pouring into his brain. That was a kind of energy fluctuation that made him feel comfortable and snug.</p><br/><p>A cool aura drilled straight into the space between his eyebrows, gradually stimulating his brain. Where it passed, it was as if his brain began to open up.</p><br/><p>That bizarre piercing made Tang San feel more comfortable than he ever had.</p><br/><p>This moment, he discovered that a lot of things he had never clearly understood before were wide open and connected.</p><br/><p>Even more astonishing to Tang San, under the effect of those cool streams, his whole brain seemed to be stripped away from his body. That spiritual power of his had come into existence after he took that Penetrating Gaze Begonia. But this spiritual power wasn’t something Tang San would use.</p><br/><p>Right now, under the influence of this cold stream, not only did that originally intangible spiritual force grow with astonishing speed, but furthermore the relationship between Tang San and it became inseparably close. He could easily direct it with just a thought.</p><br/><p>Truly worthy of being called a mind condensing wisdom skull bone. The unprecedented spiritual force condensation made Tang San’s brain seem to open up. Without using his eyes to see, he could already clearly sense everything in the world around him.</p><br/><p>Where the spiritual force passed, within a hundred meter range, there was nothing that could hide. He even saw that gentle expression on his father’s face. And the range the spiritual force could scan increased with astonishing speed.</p><br/><p>Suddenly sensing his son’s spiritual force abruptly expanding, and moreover sweeping in all directions, Tang hao’s facial expression immediately tightened, coldly shouting:</p><br/><p>“Condense your mind, don’t release it externally. Avoid losing control.”</p><br/><p>Tang Hao’s voice wasn’t loud, but it brought a tyrannical spiritual shock. The spiritual force Tang San released was unexpectedly forcefully returned to his body.</p><br/><p>Hearing his father’s voice, Tang San’s heart immediately shivered. Hastily restraining the spiritual force, he condensed it within his mind.</p><br/><p>The split second before he withdrew the spiritual force, he vaguely sensed something seem to echo it from behind the waterfall.</p><br/><p>Before Tang San had time to carefully reflect on it, that ice cold stream abruptly became a lot more powerful. In practically an instant it drowned his spiritual world.</p><br/><p>Tang San uncontrollably suddenly opened his eyes. That pale blue spirit bone had at some point already grown to the same size as his head. The moment Tang San opened his eyes, in the eye sockets of that pale blue skull bone, two blue flames suddenly ignited.</p><br/><p>In practically a split second, those two balls of flame shot out, straight into Tang San’s eyes.</p><br/><p>A fierce stabbing pain came from his eyes. Tang San couldn’t see it, but right now the pupils of his eyes had become completely blue, and immediately afterward they turned purple. The blue and purple colors replaced each other to glitter alternately nine times, and finally settled into a crystal clear deep blue.</p><br/><p>The enlarged wisdom skull bone grew once again, enveloping Tang San’s head like a great helmet, then slowly contracted again.</p><br/><p>As it approached Tang San’s head, the entire skull bone had already become illusory, and quietly merged into Tang San’s head.</p><br/><p>Right now, Tang San was submerged in a clear cold ocean, no longer feeling anything in his surroundings, as if his body and soul were stripped apart, to the extent that he couldn’t even feel the stabbing pain in his eyes any more.</p><br/><p>Blue light spiralled overhead, continuing for a full three days. To Tang San, these three days passed in only the blink of an eye.</p><br/><p>And Tang Hao stood calmly at his side the whole time for three days. Besides keeping his senses on his son, his gaze was always focused on the waterfall on the other side of the pool, day as night.</p><br/><p>Opening his eyes, Tang San’s first sensation was that everything around him had changed.</p><br/><p>All colors had become a level more vibrant, and he could even see each and every minute speck of energy floating in the air, everything around him seemed to be formed from all kinds of grains. Tang San was shocked to discover that his Purple Demon Eye seemed to have advanced to the peak of the third, Mustard Seed, level.</p><br/><p>The distance to breaking through to the final stage, Boundless, was only a single step.</p><br/><p>With the cool eye of a bystander, Tang Hao clearly saw how that deep blue light at the corners of his son’s eyes abruptly grew stronger after he opened his eyes. Along with his attentive gaze, suddenly, two rays of deep blue light shot out of Tang San’s eyes.</p><br/><p>It no longer had the previous purple gold light of the Purple Demon Eye, however, those two deep blue rays of light didn’t only shoot out a chi or so like before, but rather continued perfectly straight, stretching across several dozen meters, directly entering the surface of the pool.</p><br/><p>Tang Hao saw it, but Tang San felt it. He suddenly discovered that his eyes directly saw everything below the water surface, he could even instantly count the number of scales on the fish swimming around.</p><br/><p>His mind was unprecedentedly incisive. Tang San raised his head, his gaze moving to the side. In that instant, the deep blue light in his eyes abruptly grew richer. The light from his eyes fell on an enormous boulder at his side, and a loud explosion resounded.</p><br/><p>That boulder was unexpectedly turned into fine powder in an instant by the blue light in his eyes.</p><br/><p>Watching this scene, even Tang Hao couldn’t help his pupils contracting violently.</p><br/><p>This was the ability the spirit bone contained.</p><br/><p>The ability that would arise after a spirit bone affected a Spirit Master would admittedly be related to the capabilities of the spirit beast the spirit bone came from, but at the same time it would also be related to the Spirit Master’s own capabilities.</p><br/><p>Tang San’s Purple Demon Eye was undoubtedly exceptionally formidable, and this mind condensing spirit skull bone’s ability automatically affected it.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>The meeting of two powers immediately made this ability even more unprecedentedly terrifying.</p><br/><p>Tang San’s later description of this ability was: Seeing through all living things in the world, extinguishing all injustice. Its name: Purple God Light[2].</p><br/><p>Issuing a Purple God Light, Tang San’s first action wasn’t to be excited, but rather to calculate just how big the destructive power of this Purple God Light actually was. This was something he wouldn’t have noticed before, but right now his brain promptly calculated it automatically, everything happening so naturally and casually.</p><br/><p>The thought of calculating it had only just flashed through his mind, when Tang San immediately had an assessment based on the situation of the boulder’s destruction and the marks left on the ground. He judged that the Purple God Light shooting from his eyes was a kind of point piercing attack. As a result of its attack power being focused, the resulting singular destructive force was especially frightening. Moreover, he discovered that the strength of the Purple God Light was related to his spiritual force output.</p><br/><p>When he watched the pool just now, he hadn’t launched the attack effect, and his spiritual force consumption was exceptionally slow. But the instant he shifted the light in his eyes to attack that boulder, his spiritual force had immediately seemed to gush out. But his spirit power consumption was on the contrary very small. In other words, this ability should rely mainly on spiritual force output, the larger the spiritual force output, the more powerful the effect of its attack.</p><br/><p>While understanding this, Tang San noticed that compared to before, his spiritual force was more than a hundred times greater. The originally intangible and formless spiritual power had now condensed into a river within his mind, flickering faintly silvery as it flowed. Where it passed, it illuminated everything within his mind, allowing Tang San to see even more.</p><br/><p>Since Purple God Light’s attack power was related to his spiritual force, then it seemed he should start to cultivate his spiritual force.</p><br/><p>Grandmaster previously taught Tang San the method to cultivate spiritual force, only at that time Tang San had mainly relied on Mysterious Heaven Skill’s cultivation. It seemed to him that spiritual force was just something illusory, and not necessarily particularly useful. But now he suddenly realized that the function of spiritual force was in no way small, and in some sense, even no smaller than that of his spirit power.</p><br/><p>The more formidable the Spirit Master, the greater the pressure he gave people, but where did this pressure come from? There was admittedly release of spirit power, but at the same time there was a mental pressure. This was the effect of spiritual force. Even more, right now his Purple God Light required the backing of spiritual force. With this ability that didn’t particularly consume spirit power, but still had tremendous firepower, to Tang San, it was like a tiger that had grown wings.</p><br/><p>Suddenly, Tang San was shocked. He discovered that after shooting only one Purple Divine Light, he had unexpectedly thought of so much. And moreover, everything was very reasonable, as if all he thought of were facts. ‘Wisdom skull bone, is this the wisdom it accords me?’</p><br/><p>No wonder, no wonder each Spirit Master would thirst for spirit bones like that. Tang San inwardly sighed in praise, At that time he obtained the external spirit bone Eight Spider Lances when absorbing a spirit ring, and afterwards, the Eight Spider Lances had also been enormously useful. But despite this, obtaining the Eight Spider Lances were far from the great attack the wisdom skull bone had given Tang San now.</p><br/><p>This wisdom skull bone practically opened another door for Tang San as Spirit Master. The benefits it gave him were in no way as simple as only the Purple God Light.</p><br/><p>Tang Hao stood to the side without speaking. By Tang San’s pondering expression he could see that his son was currently experiencing the new things he had received. To him, this moment was extremely important. Tang Hao could also faintly guess what the wisdom skull bone had given Tang San. Therefore, this moment of reflection seemed especially valuable.</p><br/><p>After a long time, Tang San gradually returned from his thoughts. His gaze turning to his father next to him, he discovered that when he didn’t use his eyes to see, the intangible spiritual force distributed from his mind had already locked onto his father’s position. Even more shocking to Tang San was that the spiritual force in his mind didn’t require meticulous control to move, it slowly recovered automatically.</p><br/><p>But this spiritual force was unrelated to the outside world, it was completely condensed by himself. Grandmaster once said that peoples’ mental world was the most miraculous place. Nobody understood where spiritual force came from. On the surface it seemed to be illusory, but it really did exist. The more formidable spiritual power a Spirit Master had, the more formidable he was.</p><br/><p>What Tang San didn’t know was that Tang Hao was also inwardly shocked right now. Shocked because of the intensity of his spiritual force. Tang Hao discovered that the spiritual force Tang San possessed right now, was unexpectedly close to the level of ordinary Spirit Douluo. He understood that this wasn’t something that could be caused by the effect of a mind condensing wisdom bone.</p><br/><p>That spirit bone could admittedly increase Tang San’s spiritual force, and moreover let him understand the subtleties of his mental world, but its effect should in no way be so powerful.</p><br/><p>In fact, the wisdom skull bone was more like a key to Tang San, it was this key that opened the gates to his spiritual world.</p><br/><p>Ever since childhood, Tang San had every day faced the morning sun to cultivate Purple Demon Eye, but what he didn’t know was that he wasn’t only cultivating his vision, but simultaneously also forging his spiritual force. Only, that kind of cultivation was always hidden within his mind without emerging. Right now, under the effect of the wisdom skull bone, Tang San’s years of cultivation connected in a flash of understanding, the gates of his spiritual world opening wide, advancing by leaps and bounds.</p><br/><p>Of course, only Tang San’s spiritual level had promoted to the Spirit Douluo boundary. That didn’t mean that his Purple God Light could reach the Spirit Douluo level. All this depended on the circumstances of his future spiritual force promotion, as well as the amount of spiritual force he could output when using the Purple God Light.</p><br/><p>Tang San slowly withdrew his mind, watching his father.</p><br/><p>Tang Hao stepped in front of him,</p><br/><p>“You’ve been absorbing for three days. Judging by the circumstances of your body and the time spent, the originator of this spirit bone should have been a spirit beast over sixty thousand years. Your luck is quite good. I think, if not for my appearance, perhaps Spirit Hall would have moved against you in secret. This spirit bone should also be top ranked even in Spirit Hall.”</p><br/><p>“Three days?”</p><br/><p>Tang San was shocked,</p><br/><p>“Dad, then you haven’t rested for three days.”</p><br/><p>Tang Hao waved his hand at Tang San,</p><br/><p>“That’s not important. Your special training will begin now.”</p><br/><p>As his words fell, Tang Hao raised his hands and slapped Tang San’s shoulders and chest once each. Three streams of heat flowed down, and Tang San only felt his whole body go limp. In practically an instant, his dantian[3] was wrapped up by a scalding heat. With his present spiritual force, he unexpectedly didn’t sense a trace of his spirit power.</p><br/><p>“Dad, this is……”</p><br/><p>Tang Hao indifferently said:</p><br/><p>“From now on, you won’t need spirit power. I’ve temporarily sealed it to help you advance your special training. Remember, you’re also not allowed to use the strength of the spirit bone. I’m not sealing your spirit power because I don’t trust you, but rather because in the special training I’ll give you, it’s very easy to unintentionally draw out spirit power.”</p><br/><p>Flicking his wrist, a forging hammer immediately appeared in Tang Hao’s hand. Its surface was covered in pits and traces of rust, exactly the same as the one Tang San used at home.</p><br/><p>“Take it.”</p><br/><p>Tang San took the forging hammer, looking somewhat nonplussed at his father.</p><br/><p>Tang Hao pointed to the waterfall on the other side of the pool,</p><br/><p>“Go there. Under the waterfall is a bulging round rock, stand on it, and practice the hammer method I taught you.”</p><br/><p>“Disorder Splitting Wind Hammer Method?”</p><br/><p>Tang San couldn’t keep his gaze from turning to the waterfall.</p><br/><p>Tang Hao nodded.</p><br/><p>“When you can complete nine times nine, eighty one swings, and moreover without the slightest disorder, the first stage of the special training will be over. Go.”</p><br/><p>While speaking, Tang Hao walked over in front of the rock without taking his leave. Without taking any posture, his fist blasted out, a loud explosion followed, and in the mountain wall immediately formed a three meter deep cave. Tang Hao swung his sleeve, blowing away the dust, then walked in to sit cross legged inside, without saying anything else to Tang San.</p><br/><p>Looking at his father, then again at that familiar forging hammer in his hand, Tang San’s eyes immediately displayed an unwavering determination. With a splash, he leapt into the pool and swam towards the waterfall with the forging hammer.</p><br/><p>The Clear Sky School’s traditional cultivation method would officially start from today.</p><br/><p>……</p><br/><p>Seven Treasure Glazed Tile School.</p><br/><p>In the three days since her return to the school, Ning Rongrong always had a worried frown. She didn’t know how she should explain the school rules to Oscar.</p><br/><p>Ning Fengzhi valued Oscar extremely highly. A food system Spirit Master who had already reached the fortieth rank at only sixteen, how couldn’t he be valued? On the way back, Ning Fengzhi had already expressed to Oscar that the school would cultivate him with all its strength. If he needed anything he should say so.</p><br/><p>Oscar also didn’t say much. To him, as long as he could be together with Ning Rongrong, that was enough.</p><br/><p>Nightfall, the Seven Treasure Glazed Tile School gradually grew still.</p><br/><p>Ning Rongrong was just pondering her burden, when suddenly, a light knock sounded from the window frame.</p><br/><p>“Who?”</p><br/><p>Ning Rongrong vigilantly stood up.</p><br/><p>“It’s me.”</p><br/><p>Oscar’s voice came from outside.</p><br/><p>Ning Rongrong drew a deep breath, a resolute light displayed in her eyes. She had resolved that, no matter what, she would tell Oscar today. Brief pain was better than prolonged ache, if she delayed further, it would only hurt Oscar more.</p><br/><p>Thinking so, she opened her bedroom door and let Oscar inside.</p><br/><p>Ning Rongrong’s room was entirely pink, a very comforting room for a somewhat immature girl.</p><br/><p>This wasn’t Oscar’s first time here, but whenever he came to Ning Rongrong’s room, he couldn’t hold back a somewhat blood boiling feeling.</p><br/><p>[1] Not related to spirits, but in the vein of the mental attacks Tang San uses with Purple Demon Eye. Near-synonyms are “mind”, “mental”, “psyche”, which may end up being used interchangeably.</p><br/><p>[2] () “Purple Extreme Divine Light”, compare to Purple Demon Eye’s “Purple Extreme Demon Pupil”</p><br/><p>[3] The place where the qi resides, located a couple of fingers below the navel.</p><br/>\n</div>"}