{"title": "Chapter 149", "id": 149, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-149", "volume_title": "Volume 2", "body": "<h1>Chapter 149</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 149</p><br/><p>Fifth Spirit Ability, Blue Silver Overlord Spear</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>His body freezing in midair, the more than double strength Blue Silver Emperor Spiderweb Restraint tied Tang Hu up like a dumpling, simultaneously forcefully breaking up the sixth spirit ability he was preparing. The toxins on the spiderweb were already instantly invading Tang Hu through his wounds.</p><br/><p>This time it wasn’t only neurotoxin, but at the same time even more powerful stimulants. The pain instantly paralysed Tang Hu’s brain for a short moment. Even more terrifying, cold and hot poisons simultaneously invaded his body, starting to swiftly break down his energy channels.</p><br/><p>Being tied up by Spiderweb Restraint while wounded was undoubtedly Tang Hu’s greatest sorrow. He thought to use force, but discovered the amount of strength he could gather was constantly weakening, and the Blue Silver Emperor spiderweb twisted around him grew tighter and tighter.</p><br/><p>With a thump, Tang Hu fell to the ground. Even though he could still barely manage to make himself stand, his ability to resist was already becoming weaker and weaker along with the poison spreading.</p><br/><p>Tang San’s right hand flickering with golden light was aimed at Tang Hu, moving along with him changing position. Right now, the golden light on his arm had already extended to three meters, just like a brilliant lance of golden light. Without a doubt, this fifth spirit ability of his could completely impact Tang Hu.</p><br/><p>“Don’t hurt my dad!”</p><br/><p>Just at this moment, a young and tender panicked voice echoed, a petite figure fiercely penetrating the crowd and swiftly running over in front of Tang Hu.</p><br/><p>Tang San was inwardly alarmed. Right now his fifth spirit ability was just carrying out sustained pressure to Tang Hu. Others didn’t feel it, but just the scattering pressure from the golden lance on his arm was enough to skewer an ordinary person.</p><br/><p>The person running out of the crowd was the young girl Tiantian who delivered food for Tang San last night. Seeing her about to run into the range of the golden lance, Tang San swiftly moved sideways, the lance on his hand pointing into the distance. The spirit power accumulated so far also fired now.</p><br/><p>A golden flash, instantly turning into a golden ray of light disappearing into the distance. The entire golden pike condensed from Blue Silver Emperor disappeared from sight with a distorted wave of light.</p><br/><p>While the opponent was restrained, Tang San also wasn’t planning on using his fifth spirit ability to ruin him. Otherwise he could have already released it when Tang Hu was trapped in the Spiderweb Restraint. That golden spear, brimming with a terrifying aura, was called Blue Silver Overlord Spear[1].</p><br/><p>As a spirit ability condensed voluntarily by blue silver grass, the Blue Silver King gave consideration to the deficiencies in Tang San’s abilities, and so assigned him this pure attack ability.</p><br/><p>The Blue Silver Overlord Spear’s attack power was extremely terrifying under the effect of the Blue Silver Domain, even to the extent that it was even above the full bombardment of the present spiritual force of Tang San’s Purple Demon Eye.</p><br/><p>Quiet. The Clear Sky School’s front courtyard fell into complete silence.</p><br/><p>Tang San and Tang Hu didn’t fight for long. From start to finish, it was actually only the release of a few spirit abilities. However, this time was enough to shock everyone present.</p><br/><p>Tang San, as a Spirit King, simply by relying on his five spirit abilities had made even Spirit Emperor Tang Hu unable to use his sixth spirit ability, thoroughly defeating him. Right now anyone could see that he didn’t have any ability to resist.</p><br/><p>Tang San was admittedly a control type Spirit Master, and in a one versus one situation, control type Spirit Masters held the advantage against power attack type Spirit Masters. But don’t forget that Tang Hu’s spirit was the Clear Sky Hammer. The sect spirit of the once number one sect under Heaven.</p><br/><p>And what Tang San used was only a spirit they had never heard of.</p><br/><p>The standard of defeating the strong from a position of weakness, and moreover doing it in a way that suppressed the opponent to the point of leaving them unable to even retaliate. Tang San had not only displayed his strength, but at the same time also his plentiful combat experience and extremely accurate calculation abilities.</p><br/><p>Tang San slowly walked forward, stepping in front of the young lady Tang Tiantian. Right now Tang Tiantian’s face was already covered with anger.</p><br/><p>“Uncle’s bad. Uncle hurt my dad.”</p><br/><p>Tang Tiantian’s eyes were brimming with hostility.</p><br/><p>Tang San secretly sighed. This child who had grown up in the sect really was different from how he was.</p><br/><p>Back when he met the other Shrek Seven Devils, besides Ning Rongrong who was somewhat juvenile, practically everyone had very mature ways of thinking at twelve or thirteen.</p><br/><p>“Tiantian, it’s your uncle’s fault. Will you step aside so uncle can treat your dad? If he’s treated to late, your dad will suffer.”</p><br/><p>“I don’t believe you.”</p><br/><p>Tang Tiantian spread her arms, still blocking in front of her father.</p><br/><p>“Tiantian, step aside.”</p><br/><p>Resisting the pain, Tang Hu gave a low shout. Even though he had lost the contest, what he could stand the least was being protected by his daughter. A magnificent power among the third generation disciples relying on his daughter for protection, with his extreme pride, how could he endure it?</p><br/><p>Tang Tiantian turned her head to look at her dad. Seeing her dad’s strict gaze, she then unwillingly stepped aside.</p><br/><p>Tang San waved his right hand, withdrawing his spiderweb. His gaze didn’t pause on Tang Hu for long. While withdrawing the Spiderweb Restraint, he relied on his unreasonable control capabilities to already absorb the toxin affecting Tang Hu.</p><br/><p>Turning to look at where the five elders stood, his gaze finally settled on the seventh elder.</p><br/><p>“I don’t know whether I can now issue a challenge to the seventh elder?”</p><br/><p>Just these words, but it was like a heavy palm slapping the seventh elder’s face. As an outsider, Tang San’s display was undoubtedly very powerful. Especially as his current strength left people unable to pick out any faults. His message was very clear, ‘I respect the sect elders, but you insulted my mother, which I cannot tolerate.’</p><br/><p>Since Tang San reached the front courtyard, up through his later contest with Tang Hu, he had displayed too many things. And each thing he displayed was something that the Clear Sky School elders couldn’t keep from changing expressions over.</p><br/><p>Deathgod Domain, Blue Silver Domain, twin spirits, ten thousand year level fourth spirit ability. With these things all concentrated on him, he seemed extraordinary.</p><br/><p>Twenty years old, fifty ninth ranked Spirit king, and still possessing all kinds of formidable abilities. Describing Tang San as a genius was clearly a bit miserly.</p><br/><p>Even though this couldn’t change the Clear Sky School elders’ opinion of Tang Hao, they had to admit that this youngster absolutely had the capital for arrogance.</p><br/><p>Of course, Tang San didn’t feel that his display was anything to be arrogant about, but in fact, as a genius of the young generation, the soul of the Shrek Seven Devils, having once lead them to the Continental Advanced Spirit Master Academy Elite Tournament championship, he had long ago already accumulated the aura of a leader. That was an imperceptible influence from all kinds of experiences.</p><br/><p>The seventh elder slowly walked forward. Each of his steps was very firm. Even though the expression on his face was calm, one could clearly see that with each step, his feet would sink three cun into the ground[2].</p><br/><p>In fact, he stepped on solid rock. But each step left behind the same mark, even to the extent that the pattern on his soles was left behind.</p><br/><p>In purity of force, depth of spirit power, he proved he was a formidable Tang family elder.</p><br/><p>Tang San drew a deep breath, the Mysterious Heaven Skill inner strength circulating swiftly within him like a great river.</p><br/><p>He might have seemed to win the previous battle very easily, but in fact, whether it was the precise calculations or each spirit ability used, they both consumed a substantial amount of energy and inner strength. Tang Hu wasn’t easily dealt with. If he truly had let him employ his sixth spirit ability, Tang San would have had to display even more things. Tang Hu’s defeat was partly because he underestimated Tang San.</p><br/><p>Slowly walking up in front of Tang San, the seventh elder wasn’t arrogant any longer, indifferently saying:</p><br/><p>“I won’t take advantage of you. Regardless of what spirit abilities are used, I will only use thirty percent of my spirit power.”</p><br/><p>Tang San knew that even though this seventh elder was outwardly calm, he was extremely serious about this competition. Saying he would only use thirty percent spirit power was clearly a calculation that also included his previous consumption.</p><br/><p>“Use forty percent spirit power. My consumption might be less than you imagine, I will moreover use spirit bone abilities, I can’t take advantage of you.”</p><br/><p>He still had spirit bones? The eyes of the third generation were already wide. Was he really human?</p><br/><p>As directly related Clear Sky School disciples, they had seen a lot of powers, but it was still the first time seeing someone as special as Tang San.</p><br/><p>The seventh elder’s eyebrows twitched slightly,</p><br/><p>“No need, thirty percent is enough.”</p><br/><p>Tang San shook his head,</p><br/><p>“It would be better with forty percent. If you feel I’m taking advantage of you, then let me pick the location of the battle, how about it?”</p><br/><p>The seventh elder’s brows wrinkled slightly,</p><br/><p>“Fine, you choose.”</p><br/><p>Being two generations his senior, even though he previously cursed Tang San, he really wanted to fight Tang San. Even if Tang San raised some excessive demands, he would still agree.</p><br/><p>Tang San had long ago already thought of the most suitable place his fight with this seventh elder.</p><br/><p>If it wasn’t on a mountain, he would definitely choose a forest. But the Clear Sky School’s location didn’t have many plants.</p><br/><p>Therefore, he could only make another choice.</p><br/><p>Raising his hand to point outside the sect, Tang San said:</p><br/><p>“On the iron cable bridge.”</p><br/><p>With these words, the first thing the Clear Sky School disciples felt was that he displayed strong confidence.</p><br/><p>They understood that the iron cable bridge Tang San pointed to should be the iron cable bridge connecting to the sect’s final peak, also the one that had broken just before.</p><br/><p>This iron cable bridge was not only suspended at high altitude, but moreover covered with a layer of cold frost due to the temperature and humidity. It was not only hard to use force on it, but very difficult to even stand firm.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>The first thing to consider when using spirit abilities in a place like this wasn’t injuring the enemy, but rather one’s own safety. That Tang San chose this kind of battleground to challenge the seventh elder who was familiar with the iron cable bridge was clearly due to complete confidence in himself.</p><br/><p>If not for how he previously oppressively prevailed over Tang Hu, perhaps each person would feel he was arrogant. But now the seventh elder had already declared he would only use forty percent of his spirit power to fight him.</p><br/><p>In that case, nobody could tell for sure if he really had a chance.</p><br/><p>“Seventh elder, if this contest is my loss, I will immediately leave the Clear Sky School and never return. If you lose, I hope you can withdraw your previous slander of my mother, and simultaneously approve my recognizing my ancestors and clan, how about it?”</p><br/><p>Tang San squarely faced the seventh elder, the expression in his eyes clear and sincere.</p><br/><p>The seventh elder snorted coldly,</p><br/><p>“If you lose, not only will you never return to the sect, you must also return the spirit you inherited from the sect.”</p><br/><p>Tang San’s complexion changed slightly. Just when he was about to reply, sect master Tang Xiao spoke up for the first time:</p><br/><p>“Seventh elder, he’s only a third generation disciple. Withdrawing his spirit isn’t something you and he can decide on.”</p><br/><p>The seventh elder looked coldly at Tang Xiao,</p><br/><p>“Then what do you propose, sect master?”</p><br/><p>Tang Xiao spoke in a deep voice:</p><br/><p>“It would be better like this. If this contest is won by Tang San, all the elders please don’t further obstruct him recognizing his ancestors and clan. I think everyone has already seen Tang San’s talent. He’s twenty this year, his future prospects could be limitless. Him working wholeheartedly for the sake of the sect would inevitably have an energizing effect on the sect’s future development. If he loses he will leave the sect. He may never use the Clear Sky Hammer through his life. As for removing the spirit, there’s no need for that. After all, an outstanding genius like him is difficult to find in a hundred years. If his talent was broken due to his strength weakening from losing a spirit, don’t tell me that’s something you elders want to see? No matter what is said, the blood of our Clear Sky School flows in his veins. This is something you elders can’t deny.”</p><br/><p>Tang Xiao hadn’t spoken up before, but did now. And it was just right. Even though the elders could prevent him from letting Tang San recognize his ancestors and clan, as the master of the sect, there was no need to doubt Tang Xiao’s authority in the sect. The five elders also had to give him some face.</p><br/><p>The seventh elder torned his head to look at the second elder, who calmly said:</p><br/><p>“We’ll comply with the sect master’s words. However, if Tang San truly can defeat old seven, I will still add three extra requirements. Please don’t worry, sect master. My three demands can be raised after he recognizes his ancestors and clan. It won’t be excessive. Everything is for the sect.”</p><br/><p>With Tang Xiao’s character, seeing the calm gaze in the second elder’s eyes, he understood that even if the elders opinions differed from his, they would all still consider the sect. He nodded immediately,</p><br/><p>“Fine, like that then. Before the contest, I still have something to declare.”</p><br/><p>As he spoke, Tang Xiao pulled out the black long case Tang San had delivered from his spirit tool, his face flat as water:</p><br/><p>“Tang Hao originally separated himself from the sect, and moreover carried away the sect’s two great spirit bones. This time he ordered Tang San return to recognize his ancestors and clan, and also had Tang San bring back these two spirit bones. I think that this is enough to prove his contrition. Otherwise he could completely have kept the two spirit bones, or accorded them to Tang San.”</p><br/><p>As he spoke, Tang Xiao slowly opened the long black box in front of him. Rich spirit power fluctuations welled out, and within the wild and overbearing aura, two spirit bones appeared before the eyes of the elders and the sect disciples.</p><br/><p>Seeing these two spirit bones, the elders were all somewhat stunned, the fury originally contained in their eyes gradually fading.</p><br/><p>The second elder sighed,</p><br/><p>“Even if he separated himself from the sect, he is after all the son of the old sect master. It seems he didn’t forget the sect.”</p><br/><p>Returning the spirit bones could prove a great many things. Under ordinary circumstances, spirit bones leaving the body meant death.</p><br/><p>Even with Tang Hao’s cultivation, the elders understood that the appearance of these two spirit bones meant that Tang Hao had at least become a cripple, his strength substantially reduced.</p><br/><p>Even though the elders were all extremely angry about the trouble Tang Hao originally brought to the sect, Tang Hao striking down and killing the Supreme Pontiff back then still let everyone know about the power of the Clear Sky Sect. There were even a lot of disciples of the young generation that held Tang Hao as their idol. One of the Clear Sky School’s twin sect Douluo, he was without a doubt a towering figure of the present age. But now Tang Hao had sacrificed his formidable strength for the sake of the sect. It was just as the slightly red-eyed sect master Tang Xiao said, what Tang Hao did was enough to prove his sincerity.</p><br/><p>Tang Xiao stepped forward with large strides, handing over the long case to the second elder with both hands,</p><br/><p>“These two spirit bones are the sect’s most valuable assets, I’ll leave them to the elders’ care. Once the successor to next sect master has been decided, or perhaps when a disciple has rendered outstanding contributions for the sect, use these two spirit bones as rewards.”</p><br/><p>The second elder nodded slowly. He understood that this was Tang Xiao giving the elders face.</p><br/><p>Otherwise, with his seniority as sect master, he could have taken these two spirit bones without question, even to the extent that he could have immediately fused them into his own body to increase his strength.</p><br/><p>Two peoples’ gazes met, the second elder sighed inwardly, then slowly nodded to Tang Xiao.</p><br/><p>On the surface it seemed that Tang Xiao was accepting an almost impossible mission on behalf of Tang San, challenging the seventh elder using forty percent of his spirit power. But immediately after he did so, he used Tang Hao returning these two spirit bones to build influence for Tang San. That was in order to have the several elders approve of Tang San recognizing his ancestors and clan.</p><br/><p>He had given the elders face, and the elders would naturally return a plum in exchange for a peach.</p><br/><p>Handing the two spirit bones to the second elder, was also equivalent to giving them the authority to decide on who they would belong to, imperceptibly raising the elders’ status within the sect.</p><br/><p>Even more, the shocking strength Tang San displayed in his previous fight with Tang Hu was also enough to win over these elders.</p><br/><p>At least among the present third generation sect disciples, there was absolutely nobody more outstanding than Tang San.</p><br/><p>Tang San had inwardly already swiftly analyzed the results of everything that happened in front of him.</p><br/><p>But he of course wouldn’t believe that the seventh elder would start of leniently in the later fight against him. He was after all a sect elder. He absolutely wasn’t willing to lose to a little junior like him.</p><br/><p>Therefore he would still make an all out effort in the later battle. If he let the elders feel that his strength was only so-so, there might still be changes.</p><br/><p>The second elder’s lips buzzed in front of Tang Xiao, using a technique to compress sound into a string to say something to the seventh elder. The seventh elder frowned, but he still nodded stealthily.</p><br/><p>“Elders, please.”</p><br/><p>Tang Xiao made an inviting gesture, then took the lead to walk out of the sect. The master of the sect always had the highest position in the sect.</p><br/><p>A hundred or more sect disciples were led out of the sect by Tang Xiao and his sister with the five elders, reaching the side of the precipice.</p><br/><p>Looking at the sect elders around him, then again looking at the abyss between mountains filled with clouds and mist in front of him, Tang San couldn’t help being somewhat stupid. In his last life, his final memories were of just this kind of scene.</p><br/><p>It was equally a precipice, equally coerced by Tang clan elders. The difference was that in his last life he could only die to clear his name, and in this life he could rely on his strength to win everything. At least, in this world he wouldn’t already die again.</p><br/><p>Raising his head to look at the seventh elder, Tang San drew a deep breath, circulating the Mysterious Heaven Skill within his body at high speed. The eight extraordinary meridians being unclogged made his inner strength recovery speed several times faster than before. Even though his previous consumption wasn’t small, he had already recovered a lot in this short time.</p><br/><p>The seventh elder also just looked at him, also without speaking. Raising his hand to swing a wide sleeve, a powerful wind spread out, immediately scattering the clouds and mist in front of him. The seventh elder kicked off with one foot, and he seemed to float out moving close to fifty meters before landing on the iron cable bridge.</p><br/><p>The iron cable bridge still swayed in the wind as he landed, the seventh elder quietly standing there as if weightless.</p><br/><p>Both hands behind his back, the clouds and mist swirling beneath his feet, he looked just like an immortal.</p><br/><p>Watching the seventh elder’s movements, Tang San couldn’t keep his heart from trembling. He understood that this seventh elder’s strength might be more dreadful than he had imagined.</p><br/><p>Without procrastinating, Tang San equally leapt up. Without showing off, he calmly landed on the iron cable bridge. Feet sliding, he pulled closer to the seventh elder, stopping once the distance between them was thirty meters. The cold ice on the iron cable bridge beneath his feet seemed to have become a helping hand for him.</p><br/><p>“Seventh elder, leaving the space between the mountains is a loss, how about it?”</p><br/><p>Tang San said.</p><br/><p>The seventh elder gave a nod, also without speaking further. With a wave of his right hand a Clear Sky Hammer practically the same size as the one Tang Hu summoned appeared out of nothing in his right hand. The difference was that his Clear Sky Hammer didn’t have any pattern.</p><br/><p>The pupils of Tang San’s eyes contracted almost instantly. The appearance of the spirit was accompanied by the appearance of spirit rings. Unless one only used the spirit body itself like in his time in Slaughter City, without using any abilities, the spirit rings would certainly appear.</p><br/><p>The seventh elder clearly didn’t intend not to use spirit abilities, therefore, at the same time as the Clear Sky Hammer appeared, his spirit rings also simultaneously appeared.</p><br/><p>Yellow, yellow, purple, purple, black, black, black, black, black.</p><br/><p>Nine spirit rings quietly stood still over his Clear Sky Hammer.</p><br/><p>Strangely, the spirit rings didn’t have any interest in moving rhythmically, only quietly standing still on the Clear Sky Hammer. The faint radiance they released even washed the surrounding clouds and mist in a different color.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>“Ranked seventh eldest, title Fierce Yang.”</p><br/><p>The seventh elder’s deep voice reached Tang San’s ears.</p><br/><p>Tang San smiled wryly within. Wasn’t it said that Clear Sky School only had his father and uncle for Title Douluo? How come this seventh elder unexpectedly also was……</p><br/><p>However, he very soon became aware of his error. Clear Sky School being one sect with two douluo was said twenty years ago. Twenty years was enough for a great many things to happen, naturally also including Spirit Douluo cultivating to Title Douluo.</p><br/><p>Actually, how could Tang San have known that the Clear Sky School voluntarily sealing itself, living in seclusion on this mountaintop, even though they had no choice, it was still an enormous disgrace for the sect. From that moment on, under Tang Xiao’s advocacy with the elders’ support, the Clear Sky School disciples began to cultivate assiduously.</p><br/><p>Once twenty years had passed, and the Clear Sky School’s third generation disciples still hadn’t taken over from the previous generations, but everyone over the age of thirty still had strength exceeding the fiftieth rank. And the disciples of the second generation like sect master Tang Xiao had comprehensively broken through the seventieth rank. The five remaining first generation elders had also all become Title Douluo.</p><br/><p>Even though the Clear Sky School didn’t have a lot of people, the strength they hid on this mountain was still extremely terrifying. How could the title of the number one sect under Heaven from those days be respresented by one sect with twin Douluo?</p><br/><p>If the opponent was a Spirit Douluo, Tang San could be almost absolutely certain to defeat him if the opponent only used forty percent spirit power, even if the opponent’s spirit was the formidable Clear Sky Hammer it wouldn’t make any difference. However, the opponent was a Title Douluo. Even if he only used forty percent spirit power, his spirit power would still be close to a seventieth ranked Spirit Master. Even more when the seventh elder had more spirit abilities than Tang Hu. Perhaps he couldn’t use his eighth or ninth spirit abilities, but briefly using the seventh spirit ability Clear Sky Avatar shouldn’t be a problem. Even if this iron cable bridge was the result of his careful choice, when facing a Title Douluo with extremely plentiful combat experience, Tang San knew that defeating him absolutely wouldn’t be easy.</p><br/><p>“Afraid?”</p><br/><p>The seventh elder looked somewhat disdainfully at Tang San.</p><br/><p>“No. I’m very happy to challenge you, Fierce Yang Douluo. Tang San, fifty ninth ranked control type Battle Spirit King.”</p><br/><p>Standing on the iron cable bridge, Tang San faintly saluted the seventh elder.</p><br/><p>At the same time as he saluted, rich white light already flashed from his body, the clouds and mist in front of him scattering to either side as if cut by a sharp knife. That white light had already reached the seventh elder in practically an instant. It was Deathgod Domain.</p><br/><p>The seventh elder smiled unhurriedly and raised the Clear Sky Hammer in his hand upright. An intense black light enveloped his body, and Tang San’s almost material unreasoning killing intent was blocked outside the black light. Even though his strength increased under the movements of his rushing killing intent, it didn’t influence the seventh elder.</p><br/><p>Of course, that wasn’t to say that Tang San’s Deathgod Domain was ineffective on the seventh elder, but rather that his Deathgod Domain was still far from able to influence someone of the seventh elder’s level due to the massive gap in strength between them. As his strength increased, the Deathgod Domain added to the Clear Sky Hammer would also automatically strengthen. Once his Mysterious Heaven Skill was cultivated to a certain level, he could naturally have restrained the seventh elder.</p><br/><p>At the same time as the Deathgod Domain released, blue light also simultaneously spread out. Next, Tang San unleashed his two great domains without the slightest reservation. Confronting a Title Douluo, if he still held anything back, wouldn’t that be following the path to his own doom?</p><br/><p>Everyone to the side of the precipice watched with astounded gazes as Tang San bent forward slightly, the white clothes on his back instantly torn to pieces, and the external spirit bone Eight Spider Lances appearing. Four meter long enormous Eight Spider Lances extended from Tang San’s back. Under the dual effect of the Blue Silver Domain and Deathgod Domain, the entire Eight Spider Lances glinted with deep blue light, and at the same time, within the Eight Spider Lances, was a golden core with red and blue colors spiralling rhythmically around it, as if alive.</p><br/><p>With the appearance of the Eight Spider Lances, Tang San’s imposing manner instantly reached its peak. Under the effect of this external spirit bone, all the functions of his body had adjusted to their peak condition. The lines of his muscles grew apparent, the bones in his entire body bracing. Standing on the iron cable bridge, his entire body gave people an impression of radiating power all around.</p><br/><p>Seeing Tang San’s Eight Spider Lances, the seventh elder also looked distracted a moment. He of course saw that was a spirit bone, but he couldn’t make it out as a matured external spirit bone at just a glance.</p><br/><p>To the side, Tang Xiao and the other four elders saw it clearly. They were behind Tang San and saw the whole process of the Eight Spider Lances’ appearing, as well as the spirit power fluctuations. The second elder couldn’t help looking towards the calm Tang Xiao,</p><br/><p>“Did sect master already know Tang San possessed an external spirit bone?”</p><br/><p>Tang Xiao slowly nodded,</p><br/><p>“This is one of his three spirit bones.”</p><br/><p>“Three?”</p><br/><p>The second elder’s face revealed a wry smile,</p><br/><p>“Since when did spirit bones become so abundant. No wonder he didn’t use the sect’s spirit bones.”</p><br/><p>Tang Yue-Hua couldn’t keep from saying:</p><br/><p>“Of the three spirit bones Tang San possesses, apart from one his mother left for him, he obtained both the other two with his own strength. The external spirit bone you’re looking at, he captured when killing a thousand year Man Faced Demon Spider when he was twenty something ranked. At that time he skipped a level to obtain a spirit ring. The other spirit bone was the award he received when he led his comrades to force their way to victory in the Continental Advanced Spirit Master Academy Elite Tournament against the Spirit Hall team. This child is a genius, and not just in terms of strength. He even more has a mind that ordinary people can’t measure up to. He has long ago already surpassed second brother at the same age in all respects. Whether the Heaven Dou Empire or the Seven Treasure Glazed Tile School, they’ve both already extended olive branches to him, but this child has never accepted.”</p><br/><p>Tang Xiao spoke a lot shorter than his little sister,</p><br/><p>“In ten years, the hero of a generation.”</p><br/><p>The second elder didn’t speak up, but whether him or the other three elders by his side, right now looked at Tang San with somewhat softer eyes.</p><br/><p>On the iron cable bridge, the seventh elder didn’t feel anxious watching Tang San release the external spirit bone. He waited for Tang San to take the initiative. With such a wide gap in strength, if he still took the lead to attack first, it would be somewhat difficult to speak of. When the second elder spoke to him previously, he also told him to start off leniently. The seventh elder had also already decided to first suppress Tang San in every way, then finally concede it as a tie.</p><br/><p>Even if he bitterly detested Tang Hao due to the old pain of mourning a son, he also understood that the enemy that caused his son’s death was Spirit Hall. Even more, the strength Tang San had already used had proved the value he could be to the sect. As a sect elder, he would naturally consider the sect.</p><br/><p>“Take care.”</p><br/><p>Tang San shouted, then finally moved.</p><br/><p>What appeared in his hand wasn’t his five spirit ring Blue Silver Emperor, but rather that Clear Sky Hammer without any spirit rings.</p><br/><p>Even if the chi long Clear Sky Hammer was a bit lacking even when compared to the fourth generation children that had just started cultivating, as the seventh elder saw Tang San’s actions, he couldn’t keep his complexion from changing slightly.</p><br/><p>The Clear Sky Hammer swung high up into the sky, but its target wasn’t the seventh elder, but rather the iron cable bridge below Tang San’s feet.</p><br/><p>Even if the seventh elder was even more powerful, he still wouldn’t have enough time to stop Tang San’s movements under circumstances like these.</p><br/><p>The seventh elder reacted extremely quickly, both feet kicking off the iron cable bridge, he soared out, the Clear Sky Hammer in his hand striking straight at Tang San’s head. Attacking what the enemy had to save.</p><br/><p>But how could the seventh elder have known that the Clear Sky Hammer Tang San swung down was only a feint, in order to force the seventh elder to act first.</p><br/><p>The Clear Sky Hammer striking downwards disappeared into nothing. Tang San used Ghost Perplexing Shadow Track, his figure dashing forward in a flash, his whole body becoming illusory in a split second. Even though the Deathgod Domain was unable to influence the seventh elder, it still cut open the the enormous pressure of the seventh elder dropping from the sky like a sharp knife. Tang San’s mirage-like figure couldn’t be captured by the seventh elder’s eyes, flitting past in front of the seventh elder with baffling speed. His attack immediately fell in empty air. Since getting the Blue Silver Emperor right leg bone, it had amply made up for the lack of speed in Tang San’s Ghost Shadow Perplexing Track.</p><br/><p>If it was on level ground, perhaps the seventh elder could have used his full strength, giving him a great many options. But this iron cable bridge was a fairly large restraint on him.</p><br/><p>Steppin on the iron cable bridge, the seventh elder snorted coldly, his third spirit ring abruptly flashing, a layer of black light pervading his whole body, making him seem as if he’d grown taller. The muscles of his originally tall and thin body swiftly swelled, and even the Clear Sky Hammer in his hand grew enormous. Turning in an instant, the Clear Sky Hammer already floated out in a swing, the hammer sticking close to the iron cable bridge and sliding forward in a flash, chasing straight for Tang San.</p><br/><p>The seventh elder’s combat experience was extremely plentiful. Here on the iron cable bridge, if Tang San was forced to leave the iron cable, he would have no way of using his movement technique. As long as he was in midair, relying on the seventh elder’s formidable spirit abilities, how couldn’t he win in one strike?</p><br/><p>Tang San twisted on the iron cable, turning around. Seeing that enormous Clear Sky Hammer whistling towards him, he knew that this next move wasn’t something he could meet stiffly. Even if it was only when using forty percent spirit power, the seventh elder was still a lot more powerful than he who had just exhausted himself considerably.</p><br/><p>Right now, his mind couldn’t help playing a scene from his time in the Hell Road. When in the Hell Road, didn’t he also use a similar method to attack that Ten-Headed Fierce Yang Serpent? The method the Ten-Headed Ardent Yang Serpent immediately appeared in Tang San’s mind.</p><br/><p>On the cliff, the Clear Sky School spectators saw a shocking scene. Wearing a graceful smile, Tang San unexpectedly leapt into that abyss between the two mountains.</p><br/><p>[1] Blue Silver Overlord Spear - () Could also be “gun”, or more generally “gun-like thing”.</p><br/><p>[2] 3 = 10 cm</p><br/>\n</div>"}