{"title": "Chapter 141", "id": 141, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-141", "volume_title": "Volume 2", "body": "<h1>Chapter 141</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 141</p><br/><p>Blue Silver Domain And Deathgod Domain</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>However, he couldn’t keep his mind from replaying the scene where Hu Liena without the slightest hesitation pulled him back to the narrow road when he killed the dark golden three-headed bat king. Even though he didn’t understand why Hu Liena didn’t have any evil intent towards him, even to the extent that she was extremely sincere, it was just because of this that he couldn’t act now. Even if he did, he knew he might not be able to truly injure the opponent.</p><br/><p>Just at this moment, suddenly, Hu Liena raised her head, turned her palm, and struck her own chest.</p><br/><p>Blood spurted out with a vomiting sound. But her red eyes became awake for a while,</p><br/><p>“Tang Yin. I can’t do it. If it goes on like this, I’m afraid we won’t walk out of this Hell Road. I’ll put my life in your hands. Even though I don’t understand why I trust you, I know that you will definitely bring me out of here. While my mind is clear, knock me unconscious.”</p><br/><p>This was just the moment when man and Heaven were waging war in Tang San’s heart. Suddenly seeing Hu Liena do this, he couldn’t help being a bit ashamed. It seemed that this girl in front of him wasn’t like he thought!</p><br/><p>Hu Liena trembled violently, wavering in front of Tang San, she shouted almost mournfully,</p><br/><p>“Hurry, do it. I won’t hold out.”</p><br/><p>He didn’t hesitate further, this was undoubtedly the best way to settle the situation. Tang San abruptly stepped forward, one palm cutting at Hu Liena’s neck. Hu Liena’s body softened, slipping into his arms.</p><br/><p>Holding Hu Liena’s delicate body, seeing the fox tail on her butt gradually withdraw and the snow white skin exposed under the broken small pants, Tang San didn’t have any distracting thoughts.</p><br/><p>He suddenly had a measure of respect towards this woman in his arms. Respect for her courage.</p><br/><p>At this moment, Tang San could easily throw Hu Liena into the abyss next to him, that would not only make the next part of the Hell Road easier, but could furthermore strangle a future great enemy in the cradle.</p><br/><p>However, Tang San didn’t do it. Sighing, he pulled Hu Liena against him, arranging her against his chest. Blue light rushed out. With Hu Liena already unconscious, he no longer had to hide anything, and strand after strand of sapphire like Blue Silver Emperor quietly appeared, tying Hu Liena tightly to him.</p><br/><p>In order to not let her influence his movements, Tang San twisted her arms around his neck, and raised her legs to tie them around his waist.</p><br/><p>Without a doubt, the two were currently in extremely close contact, and Hu Liena’s bits of cloths were practically no different from being naked, but the current Tang San was perfectly calm.</p><br/><p>Everything before him, was part of his training.</p><br/><p>He could of course abandon Hu Liena, but he knew that if he really did so, then that would be the same as being destroyed by the demon in his heart. To say nothing of whether he was able to walk away from this place under that influence, even if he did, he might carry this crack in his heart for a lifetime. Pursuing the summit of Spirit Masters would then be impossible.</p><br/><p>Therefore, he had to carry her out. Even if later she turned out to be his greatest enemy, he still had to display strength and discipline and confront her fairly in the future. This was a choice that a martial artist, a Spirit Master, a man couldn’t escape.</p><br/><p>Just as Tang San used Blue Silver Grass to tie Hu Liena into a posture that would least affect his movements, he suddenly understood what the final challenge of the Hell Road was.</p><br/><p>It was still a powerful enemy, but not an external one, but rather oneself. The demon in one’s heart.</p><br/><p>In the tremendous sinister atmosphere, under the influence of the red-hot nefarious blood plasma as well as his own enormous slaughter intent, in order to persevere and leave this place, what kind of unswerving determination and willpower would that require?</p><br/><p>Even a top quality genius like Hu Liena was unable to endure till the end. This final trial to leave the Hell Road was the most difficult.</p><br/><p>Thinking of this, Tang San couldn’t help inwardly sighing over his luck.</p><br/><p>He had all kinds of abilities that could stabilize his willpower, among them was the most fundamental Mysterious Heaven Skill, and the mind condensing wisdom skull bone, as well as that miraculous blue domain.</p><br/><p>Just as Hu Liena guessed, Tang San’s blue domain was an innate domain of his spirit. The second awakening of his Blue Silver Grass had exposed its true identity.</p><br/><p>As the only Blue Silver Emperor on the Continent, its second awakening had simultaneously assigned Tang San the imperial prestige it possessed, that was the Blue Silver Emperor’s innate domain, Blue Silver Domain.</p><br/><p>Right here, the Blue Silver Domain was of course unable to display its greatest might. Or one might say that the Blue Silver Domain’s own effect was already suppressed to its lowest level in here. But relying on the endlessly growing atmosphere of the domain, it could still be of some help to Tang San.</p><br/><p>As for the surrounding scorching heat, to Tang San it was more like a joke.</p><br/><p>Even the Ice and Fire Yin Yang Well’s infernal heat was unable to influence him who had eaten the Infernal Precious Apricot and Octagonal Mysterious Ice Grass, let alone this place.</p><br/><p>Perhaps the extreme toxin in the blood broth could influence Tang San, but he would never give it the chance to reach him.</p><br/><p>In two years in Slaughter City, how could Tang San not have researched the Bloody Mary? The blood soup here should be the sinister blood of countless degenerates over a thousand years, mixed with extreme toxin and concentrated. It could also be described as the basis of Slaughter City.</p><br/><p>Stretching his hand into the Wishful Hundred Treasure Purse, a snow white immortal herb appeared in Tang San’s hand.</p><br/><p>The immortal herb was a sparkling and translucent snow white, each leaf seemingly dripping with water, slender curving, it seemed like the neck of a swan.</p><br/><p>If one only saw it, who could guess that the property this immortal herb possessed was actually stimulation?</p><br/><p>Let alone eating it, just coming touching it would cause any virus at the point of contact to multiply a hundred thousandfold. Under a great many circumstances, this so called ‘Snow Swan Kiss’ would be even more dreadful than any poison. Even when holding it with Mysterious Jade Hand, Tang San seemed to be trembling with fear.</p><br/><p>The might of this immortal herb really was too terrifying, to the extent that not even Tang San dared use it to refine poison. Because if Tang San was infected with just a drop of its breath in the refining process, he would also certainly die. Who dared guarantee that their body didn’t have a single virus?</p><br/><p>With a light wave of his hand, the snow white Snow Swan Kiss floated into the air and fell, plummeting towards the dark red blood plasma below, instantly swallowed by the blood, disappearing without a trace.</p><br/><p>The blood plasma didn’t seem to suffer any influence, but Tang San knew that this immortal herb still brought Slaughter City a devastating stimulation. With its medicinal effect, the toxin within the nefarious blood plasma would multiply without limit.</p><br/><p>And Slaughter City treating this as its foundation, how could it still exist?</p><br/><p>Slaughter City, this dark, evil, terrifying world, shouldn’t exist.</p><br/><p>No matter who was there, it would still be better if this darkest face of the world disappeared.</p><br/><p>Setting off once again, Tang San swiftly rushed forward. His body and Hu Liena in front of him rubbed against each other as he moved, constantly causing bursts of pleasurable sensations. But at this moment, Tang San rigidly put his thoughts in order, constantly replaying bloody scene after scene from Slaughter City in his mind. Only like this could he resist the lure of this feeling on his chest that was more bewitching than his murderous mind.</p><br/><p>The air became hotter and hotter, and tied in front of Tang San, Hu Liena’s skin had already become rosy red. Fortunately, this was within Tang San’s Blue Silver Domain, and further adding her own valiant strength, her body was far more unyielding than ordinary people.</p><br/><p>Otherwise, just this current scorching heat would be enough to roast her alive.</p><br/><p>Watching the blood plasma in the abyss on either side grow closer and closer, the corners of Tang San’s mouth displayed an ice cold smile. ‘Slaughter City, Slaughter King, I hope you like the gift I left behind’</p><br/><p>Just as Tang San anticipated, along with the temperature rising, the blood plasma rose on either side. He knew that he wasn’t far from the exit.</p><br/><p>After an hour, his mind constantly provoked by irritable killing intent, Tang San finally saw the exit.</p><br/><p>By now, his sweat had also already soaked his jacket. It wasn’t because of the surrounding heat, but rather because of the double influence of the slaughter intent and this dreadful extraordinary beauty in front of him.</p><br/><p>No matter how resolute Tang San’s will was, under such circumstances, even he was almost unable to endure. And at this time, he finally saw the distant exit.</p><br/><p>The exit clearly led outside, white light forming an oval screen of light. There was the end of Tang San’s journey.</p><br/><p>However, the exit was still a kilometer away. Tang San halted, his brows furrowing.</p><br/><p>Even though the exit had appeared, it really was an exit on another shore. Right now in front of Tang San was no longer any road, it was all a blood red sea. The blood plasma finally reached here, unexpectedly forming a small lake, blocking his path forward, bubbles rising in the blood. A kilometer away, just like on the other side of an eternally uncrossable chasm.</p><br/><p>There were no more creatures attacking, but here was the most powerful sinister energy as well as this thousand meter wide enormous gulf in front of him, became a practically uncrossable moat.</p><br/><p>Holding Hu Liena in front of him, it was hard for his right hand not to come into contact with her astonishingly flexible pert butt.</p><br/><p>As a result of Hu Liena previously exposing her fox tail, and further adding the jolting on the way, the area her little hotpants could currently conceal was really pitifully small.</p><br/><p>Tang San’s lower body had long since unconsciously become high spirited due to the two touching.</p><br/><p>Under the dual stimulation, even his eyes had become blood red.</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Slowly closing his eyes, Tang San drew a deep breath, pacifying his mind as far as possible. Mysterious Heaven Skill swiftly circulated within his body. Through these two years of cultivation, even if his spirit power hadn’t advanced much, the Conception Vessel among his eight extraordinary meridians had already been connected, and now only the final Governing Vessel remained.</p><br/><p>Having opened seven meridians, the speed with which Tang San’s inner strength operated had already reached an extremely astonishing degree. This also made his battle endurance much more powerful than that of Spirit Masters from this world.</p><br/><p>Faint light flickering, the light displayed on Tang San’s face gradually grew fainter. Both hands crossing over his chest, a faint spiritual fluctuation spread from the space between his eyebrows.</p><br/><p>Finally at this moment, he could no longer hold anything back.</p><br/><p>Therefore, he urged his spiritual force with all his strength, as far as possible forcing his killing intent to display outside his body, forming a protective screen around him, simultaneously also allowing his brain to recover its sobriety for a while.</p><br/><p>The effect of using the mind condensing wisdom skull bone finally reached its peak.</p><br/><p>Mind recovering its clarity, the first thing Tang San did was to observe his surroundings. He didn’t let any detail or clue slip by. Right now, on either side of the narrow road was a void so expansive the end couldn’t be seen, more than a kilometer in front was the exit, and above, the black cave ceiling could only be vaguely seen two hundred meters up or so.</p><br/><p>Tang San couldn’t help sighing inwardly. This would have been a lot easier if little Ao was here to settle this situation with a flying mushroom sausage. Of course, this was only in his dreams. Even if Oscar truly was here he would still have been unable to implement it. After all, no spirit abilities could be used here.</p><br/><p>Raising his right hand, a strand of Blue Silver Grass appeared, and Tang San threw it sharply towards the sky. Even if he couldn’t use spirit abilities, the spirit itself could still be used.</p><br/><p>After the second awakening, his Blue Silver Grass clearly wasn’t as before. Its changes were of course not only as simple as color and external appearance.</p><br/><p>Tang San’s previous Blue Silver Grass could only be thrown a distance of fifty meters at most. But now, the sparkling and translucent Blue Silver Grass flew more than a hundred meters.</p><br/><p>Through his interaction with his spirit, Tang San very quickly discovered that a hundred twenty meters was already the limit of what his Blue Silver Grass could reach. This distance was still some ways from the two hundred meter tall cave ceiling. Blue Silver Grass only reached a hundred twenty meters, he still lacked close to one hundred meters more.</p><br/><p>Glancing at Hu Liena at his chest, Tang San considered whether he should wake her so the two could think of a way together. But he very quickly disregarded this thought. By now Hu Liena’s tender skin was the color of boiled shrimp, incomparably red.</p><br/><p>If by some chance she lost consciousness and launched an attack after she woke up, what then? Then there wouldn’t even be a chance.</p><br/><p>Thinking of this, Tang San thoroughly dispelled his previous line of thinking. Suddenly, as if a bright light was lit, Tang San had a plan. Perhaps it would even work.</p><br/><p>He swiftly removed the Flying God Claw from his left wrist.</p><br/><p>He released two strands of Blue Silver Grass from within himself, connecting one to the Flying God Claw, and the other to the Flying God Claw’s controls.</p><br/><p>The Flying God Claw’s limit was thirty meters. If he could release it in midair, that would be equivalent to extending the Blue Silver Grass by thirty meters, its length reaching a hundred fifty meters. As for the remaining seventy meters distance, he would have to rely on his own ability.</p><br/><p>Thinking of this, Tang San drew a slow breath, then exhaled again. He knew that he would only have one chance. The majority of his Mysterious Heaven Skill was used to suppress the slaughter intent, and right now he only had one chance to climb to the top of the cave ceiling. If this one chance failed, then launching again it while still restraining the slaughter intent would be practically impossible.</p><br/><p>Harmonizing the breath within his body, Tang San’s complexion grew serious. Drawing a deep breath once again, a faint blue light filled the air, the comprehensive release of the Blue Silver Domain. Only within the area of the Blue Silver Domain did the environment’s influence fall to its lowest point.</p><br/><p>The next moment, the long legs of the Eight Spider Lances broke out of his back. Reaching four meters in length, the crystalline Eight Spider Lances were dazzlingly beautiful, without the previous vicious barbs and purple black color. However, its attributes had still been strengthened exponentially.</p><br/><p>The reason was very simple. After Tang San became the Blue Silver Emperor after the second awakening of Blue Silver Grass, it was not only his innate attributes that were raised, but still the essence of Blue Silver Grass.</p><br/><p>The fundamental essence of the spirit changing was equivalent to each of Tang San’s original Blue Silver Grass spirit abilities changing, to say nothing of gaining a fifth spirit ability, breaking through the Spirit King level.</p><br/><p>All these things mixed together, making Tang San’s strength substantially improve overall, and Eight Spider Lances, as an external spirit bone capable of evolution, naturally also obtained even greater benefits and thereby evolving to their present appearance.</p><br/><p>The reason Tang San tied Hu Liena to his chest instead of his back before, was in order to leave room for Eight Spider Lances. Even the places where the Blue Silver Grass was bunched together didn’t influence the positions of the Eight Spider Lances on his back.</p><br/><p>This external spirit bone had saved his life on more than one occasion, it was his final trump card.</p><br/><p>Slowly laying down, the Eight Spider Lances stuck into the ground, supporting Tang San holding Hu Liena.</p><br/><p>Faint white light surged, and the red and blue hazy light accumulated within the Eight Spider Lances undulated slightly. Tang San’s eyes suddenly turned sharp, body abruptly leaning forward, on the verge of touching the narrow road. Right now, the slender Eight Spider Lances were all inserted in that narrow road, even though it seemed strange, they were completely in a state of storing power.</p><br/><p>People could jump with two legs, but right now Tang San possessed eight. Mysterious Heaven Skill operating with full strength, the Eight Spider Lances’ terrifying strength erupted in practically an instant.</p><br/><p>Sou——</p><br/><p>The powerful Eight Spider Lances brought Tang San shooting through the air, the astonishing leap making Tang San clearly feel the surrounding scenery swiftly sweep past him.</p><br/><p>Watching that narrow road below become smaller and smaller, and his upward speed gradually falling, he knew that he was about to reach the apex of the Eight Spider Lances leap.</p><br/><p>Right now, while forcefully operating Mysterious Heaven Skill, Tang San’s back was to the ceiling of the cave, and he also didn’t know how high this leap was, but he had to act to be able to make his leap reach even higher, to get as close as possible to the top as possible.</p><br/><p>Two deep blue lights shot out of Tang San’s eyes, and with a flash of light, a heavy explosion struck the ground beneath him. This one attack was made with Tang San’s full spiritual force, without holding anything back.</p><br/><p>Even if the force of the Purple God Light couldn’t reach its greatest degree because of his consumption from before, that attack power was still frightening.</p><br/><p>Amidst the loud explosion, the narrow road below disappeared almost completely. The terrifying Purple God Light actually struck that blood plasma and formed a blood red whirlpool. And Tang San took advantage of the counterforce of this attack to gain another twenty meters or so of altitude.</p><br/><p>It was time. Turning in the air, Tang San threw out the Blue Silver Grass twisted around the Flying God Claw</p><br/><p>The moment he turned around, Tang San’s nervous mood relaxed. Because he clearly saw that his distance from the roof of the cave was less than a hundred meters. In other words, Eight Spider Lances previous leap had unexpectedly pushed him a hundred meters high.</p><br/><p>Without any suspense, the Blue Silver Grass already approached the roof of the cave in the blink of an eye. With a sonorous sound, Tang San used the other twisting Blue Silver Grass to operate the Flying God Claw’s mechanism. The sharp and piercing Flying God Claw penetrated the rock at the top of the cave, suspending Tang San and Hu Liena in the air.</p><br/><p>Basically without need to use strength, Tang San swiftly controlled the Blue Silver Grass to withdraw, pulling him closer to the ceiling.</p><br/><p>After he gripped the Flying God Claw, and again withdrew its mechanism, he was pulled up to the pitch black rock of the ceiling.</p><br/><p>The Eight Spider Lances took over responsibility, the spear sharp lance points thrusting into the rock like tofu, suspending Tang San and Hu Liena. Once the Eight Spider Lances thrust into the rock, Tang San’s heart finally relaxed. With the control of the Eight Spider Lances, he knew he was finally safe.</p><br/><p>Delaying in this place was no doubt inviting trouble. Transferring the Mysterious Heaven Skill inner strength within him, resisting the pain from substantially overusing his spiritual force, Tang San controlled the Eight Spider Lances to swiftly crawl towards the exit, hanging upside down from the ceiling.</p><br/><p>The roof of the cave was pitted and uneven, but that was no threat to the Eight Spider Lances. Hanging upside down from the ceiling, Tang San easily crossed the thousand meter distance as if walking on level ground, finally reaching the end.</p><br/><p>Climbing down, the exit was before him.</p><br/><p>Tang San suddenly discovered that the killing intent around him seemed to be pulled by a particular force.</p><br/><p>Turning around and giving a final glance to the Hell Road he had just walked, Tang San knew that these two years of sharpening in Slaughter City was an experience he would never forget in a lifetime. But he even more didn’t want anyone else to come experience this terrifying world in the future.</p><br/><p>Perish, this was the wish he left for Slaughter City.</p><br/><p>With a sou sound, Tang San finally fled into that white curtain of light.</p><br/><p>Everything around him seemed to change. The instant Tang San entered that white light, he immediately felt as if he had entered a special world.</p><br/><p>Around him was a snow white nothingness, and the Blue Silver Grass he released was restrained by an unknown force, forcibly pressed back into his body. Hu Liena in front of him consequently also separated from his embrace.</p><br/><p>In this world of boundless white, he couldn’t use a bit of strength. All he felt, was ice cold.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>It was as if immeasurable cold aggregated towards him, and also like immeasurable cold exuded from his body. In this white nothingness, Tang San endured that frightful pain alone.</p><br/><p>A cold he should feel still appeared. That wasn’t a true change in temperature, but rather the chill produced by killing intent. The purest slaughter intent swiftly invaded Tang San, and with each part entering, Tang San would tremble.</p><br/><p>As that cold gradually made his heart stiffen, his consciousness and senses also gradually began to grow distant. But at this moment, Tang San was certain of Slaughter City’s legend. Indeed, this was a domain, a domain condensed from killing intent. Of course, this domain was far, far too formidable compared to his Blue Silver Domain. Within the domain, he was like a rootless duckweed.</p><br/><p>After an indeterminate length of time, as Tang San awoke from the pain, he felt as if he had been dreaming.</p><br/><p>He lay within blue silver grass, and this blue silver grass was sending him trace after trace of warmth and nourishment. All his pain was already gone, the only feeling he had was of relaxation and the familiar fluctuations of spirit power, as well as the feeling of spirit abilities once again filling his body.</p><br/><p>When he wanted to turn over and sit up, Tang San discovered that his left arm was somewhat heavy. As he turned his head to look, he unexpectedly saw the Clear Sky Hammer in his hand.</p><br/><p>When he glanced at the Clear Sky Hammer, he was certain that it was impossible for that to have been a dream. On that Clear Sky Hammer, on top of the hammer head, there was a layer of white veins.</p><br/><p>Those veins looked like the blood pattern on the ground of the Hell Slaughter Arena when the Hell Road opened, only much smaller. And moreover white.</p><br/><p>As Tang San tried to sense that white veined pattern, instantly, a surging white light quietly filled the air. The white light discharged from the Clear Sky Hammer, but very soon, that white light became colorless, and Tang San’s perception of the surrounding world immediately became different. Even the blue silver grass that was closest to him were trembling in this incorporeal current.</p><br/><p>Deathgod Domain. This was Deathgod Domain? Tang San knew he should be excited, but having just left a place like Slaughter City, he couldn’t be. Two years of hellish sharpening had had an enormous influence on his mindset.</p><br/><p>Despite always trying hard to resist it, right now Tang San was not only pale, but even the space between his eyebrows revealed an unconcealable evil spirit.</p><br/><p>At this moment, suddenly, an incorporeal killing intent approached in a flash. Like an invisible object, it heavily struck the Deathgod Domain Tang San released.</p><br/><p>Tang San shook, swiftly turning to look in that direction.</p><br/><p>A few dozen meters away stood a charming silhouette. At some point she had already dressed neatly, covering that beautiful delicate body. And her eyes were also watching him, an indescribable mood flickering within.</p><br/><p>‘She woke up before me?’ This was Tang San’s first thought, unable to keep his back from breaking out in cold sweat. Of course he knew what it meant that Hu Liena woke up first. It meant that she had ample time to kill him.</p><br/><p>‘This woman really is cunning.’ Tang San thought with some annoyance. Her spirit power was stronger than his, but on that final stretch of the road, it was he who brought her out. Her exhaustion was naturally less than his. If she wanted to kill him, perhaps he would never have woken up.</p><br/><p>Hu Liena walked towards Tang San step by step, with a faint smile on her charming face.</p><br/><p>“Do you feel it? We possess the same innate domain.”</p><br/><p>The heavenly voice resounded in Tang San’s ears.</p><br/><p>Tang San didn’t open his mouth, only watched her quietly.</p><br/><p>He was astonished to discover that with the ability to use spirit abilities returned, Hu Liena’s eyes had now unexpectedly become incomparably clear, without a speck of bewitching element.</p><br/><p>If she could be described as a rose brimming with attraction before, then right now she seemed like a fresh and clean lily.</p><br/><p>“I put my life in your hands once, you also put your life in my hands once. Shouldn’t we be even?”</p><br/><p>Hu Liena finally reached Tang San, only stopping when she was just a meter from Tang San. Looking at him, her gaze became incomparably soft.</p><br/><p>Tang San still didn’t open his mouth, only watching her silently. He still didn’t know what this woman was thinking, but for some reason, he felt that she didn’t have any menace towards him.</p><br/><p>A trace of distress emerged on Hu Liena’s charming countenance. Attentively watching Tang San, her touching face unexpectedly displayed helplessness,</p><br/><p>“Why am I from Spirit Hall, and you from Clear Sky School?”</p><br/><p>Raising both hands, very naturally placing them on Tang San’s shoulders, Hu Liena pulled close the distance between her and Tang San by one more step, her mournful eyes undoubtedly brimming with even more intense attraction, her whole body collapsing into Tang San’s embrace.</p><br/><p>However, her movement didn’t finish, because Tang San supported her shoulder with one hand.</p><br/><p>Deathgod Domain and Clear Sky Hammer withdrew simultaneously, and Tang San looked indifferently at Hu Liena.</p><br/><p>Hu Liena gave a sad smile,</p><br/><p>“You really have a heart of stone?”</p><br/><p>Tang San’s gaze became a bit gentler. He couldn’t deny that this woman was perfect, but his heart had long since no room for one more person. To say nothing of the two of them being people of two worlds.</p><br/><p>Patting her shoulder, he pulled away her hands from his shoulders,</p><br/><p>“Next time we meet, perhaps we will be enemies.”</p><br/><p>Leaving behind these simple words, turning, no longer looking at her, Tang San stiffened his heart and left in large strides.</p><br/><p>Silent tears rolled quietly down a perfect delicate face. This was the first time in her life that Hu Liena cried for a man. And the image of this man, could no longer be separated from her heart.</p><br/><p>Tang San seemed to feel his mood lighten somewhat with each step forward. He naturally wouldn’t have any feelings for Hu Liena. But he also had a somewhat favorable impression of this girl. Leaving through the Hell Road was the result of the two of them working together. When Hu Liena let him knock her unconscious, Tang San could no longer raise any enmity towards her.</p><br/><p>“Little San.”</p><br/><p>A deep voice echoed by Tang San’s ears. Tang Hao had at some point already quietly appeared, standing on the road in front of him.</p><br/><p>In the two years they hadn’t seen each other, he seemed to have aged even a bit more. Tang San’s extremely acutely sensed the same characteristic as he had himself from his father’s body.</p><br/><p>“Dad.”</p><br/><p>Quickly stepping forward, reaching his father, Tang San’s gaze was still ice cold. That was the residual effect of two years in Slaughter City,</p><br/><p>“Don’t you also possess the Deathgod Domain?”</p><br/><p>Tang Hao nodded, his face revealing a trace of a smile,</p><br/><p>“You’ve done well in these two years. You haven’t let me down. Let’s go.”</p><br/><p>Finished talking, he took the lead to walk forward.</p><br/><p>Tang San swiftly caught up without saying anything else. His father’s appearance had made a small crack appear in his ice cold heart, warm affection undoubtedly the best treasure to dissolve the vicious currents within.</p><br/><p>“Do you know what the effects of the Deathgod Domain is?”</p><br/><p>Tang Hao suddenly asked.</p><br/><p>A light flashed in Tang San’s eyes,</p><br/><p>“Imposing manner.”</p><br/><p>Tang Hao nodded slowly,</p><br/><p>“That’s right. It’s imposing manner. Imposing manner and pressure formed from killing intent can frequently leave your opponents unable to display their full strength, but you yourself can exhibit one hundred twenty percent. The effect of the Deathgod Domain is the same. You possess the most basic Deathgod Domain. In the future, within this Domain, your opponents’ strength will automatically weaken by ten percent, and you yourself display one hundred ten percent of your power. As your spirit grows, this proportion will also increase. Remember, spirits’ innate domains won’t suffer the restrictions of twin spirits, unable to be used simultaneously.”</p><br/><p>Tang San stared blankly a moment,</p><br/><p>“How do you know?”</p><br/><p>Even he who possessed twin spirits couldn’t be certain of this.</p><br/><p>Tang Hao halted, turning to look at him,</p><br/><p>“Because, the same circumstances appeared for another person.”</p><br/><p>The expression in Tang San’s eyes fluctuated violently once. He suddenly understood his father’s meaning. That person Hu Liena spoke of, was Supreme Pontiff Bibi Dong. In this world, besides his father, Bibi Dong should also possess the Deathgod Domain.</p><br/><p>Tang Hao said calmly:</p><br/><p>“Right now the number of people with this domain has increased to four. You will gradually get to know the effect of the Deathgod Domain in the future. Its uses are just as marvellous as your Blue Silver Domain, in different circumstances, it can have enormous effect.”</p><br/><p>“Dad, shouldn’t you tell me about what happened in the past now?”</p><br/><p>After four years of sharpening himself on the grindstone, Tang San had already gone from a not yet fifteen years old juvenile to an almost nineteen years old youth. His strength had grown, his temperament had changed, the second awakening of Blue Silver Grass had caused all sorts of influences, all making him seem to mature a lot. Compared to four years ago, the present Tang San was in no way as simple as just having raised his spirit power ten something ranks. He had already truly begun to step into the world of those known as powers.</p><br/><p>Tang Hao said:</p><br/><p>“It still isn’t the time. You still haven’t met my requirements.”</p><br/><p>Tang San stared blankly a moment,</p><br/><p>“Then how will I be considered to have met them?”</p><br/><p>Having gained two great Domains, Tang San believed he should have been able to gain his father’s approval.</p><br/>\n</div>"}