{"title": "Chapter 154", "id": 154, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-154", "volume_title": "Volume 2", "body": "<h1>Chapter 154</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 154</p><br/><p>Blue Silver Domain’s True Power</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>Oscar pointed to the Mirror Image Beast’s corpse,</p><br/><p>“Big brother, extract the spirit bone quickly. I’ll gather some of their blood.”</p><br/><p>While speaking, Oscar pulled out some different kinds of vessels from his spirit tool. Before possessing the sixth spirit ability, he still didn’t know whether he could succeed, and naturally wouldn’t prepare much. But always being in such danger, carrying all kinds of items was very natural, and clearing out some to collect blood was still possible.</p><br/><p>After all, no Spirit Master would lightly give him their blood, but his sixth spirit ability still required blood as basis. Oscar had already thought it over, and using the blood of these Spirit Masters whose strength wasn’t much different from his to make some mirror image large sausages to carry with him should still be enough for self protection.</p><br/><p>Hao Te understood from Oscar’s actions before that his sixth spirit ability was related to blood, and right now his eyes revealed a faint gentleness. He understood that oscar wasn’t preparing to take for that spirit bone, and therefore let him collect it.</p><br/><p>Relying on his formidable strength, the Mirror Image Beast’s head was easily split open by Hao Te, immediately revealing the true form of the spirit bone. Oscar naturally wouldn’t see wrong, and within the Mirror Image Beast’s head was condensed a sparkling crystalline skull capable of reflecting light. The entire skull seemed made out of mirrors, the light from the outside world causing a flickering faint brilliance.</p><br/><p>It was heavy in his hand, special spirit power fluctuations making Hao Te’s fingertips tingle, making his eyes unconsciously display a somewhat intoxicated light. Spirit bone, who didn’t desire them? Even more when this was a skull bone, second only to a torso bone. To any Spirit Masters, these were rare and precious treasures.</p><br/><p>In a moment of work, Oscar had already collected the blood he needed. Returning to Hao Te’s side, his gaze also automatically fell on that mirror image skull. But in his eyes was no greed. Having obtained such a most suitable sixth spirit ability, he was already perfectly content, without any greedy thoughts. The reason he fought was that he didn’t want his life to end here.</p><br/><p>The intoxication in Hao Te’s eyes gradually disappeared, and clasping the spirit bone in both hands, he held it in front of Oscar,</p><br/><p>“Absorb it. It should be very useful to you.”</p><br/><p>Oscar stared blankly a moment,</p><br/><p>“Big brother, what are you doing? You’ve already helped me too much, I’m already very satisfied with the spirit ring, this spirit bone is what you deserve. You coming out to hunt spirit beasts, wasn’t that for the sake of this treasure?”</p><br/><p>Hao Te sighed,</p><br/><p>“Brother, don’t argue with me. Take it. It’s even more important to you than to me. The same person absorbing the spirit ring and spirit bone from the same spirit beast will have the highest effect. It’s not like you don’t understand that. Even more, this life of mine was saved by you. In these two years, even though I’ve helped you a bit, if it wasn’t for your kindness in saving me back then, how would I have the chance to help you? I owe you a life, this is just a spirit bone.”</p><br/><p>Oscar and Hao Te had met very randomly. That time, Hao Te had just been ambushed and severely injured by his comrades in a hunting team. Unconscious in the wilderness, he had fortunately encountered Oscar. He used the small detoxifying sausage to help cure Hao Te’s poison, and further his big recovery sausage to help him recover. When they were pursued by the enemies, they had even more relied on the flying mushroom sausage to flee into the distance, thoroughly dissolving Hao Te’s crisis at that time.</p><br/><p>Hao Te was a straightforward person, even though he didn’t say it out loud, in his heart he was brimming with gratitude towards the benefactor that saved his life. This was also why they two were so close, and an important reason why Oscar could completely trust him.</p><br/><p>“But…..”</p><br/><p>Oscar still wanted to say something, but Hao Te interrupted.</p><br/><p>“Brother, don’t say anything. Actually, I still have selfish motives in giving you this spirit bone. I’m already in my fifties. After a Spirit Master enters his sixties, increasing his strength further will be very difficult. At the end of my life, I expect my best outcome is to reach the Spirit Douluo level. But you’re different. You’re just twenty two! I’ve never seen a more outstanding food system Spirit Master than you; your future prospects are boundless. You might even reach the legendary food system Title Douluo level. You call me big brother, so in the future I’ll rely on you. If you’re more powerful, won’t my patron be even more generous?”</p><br/><p>Oscar of course understood that the reason Hao Te said this was in order to make him accept this spirit bone. Looking at the mirror reflective light in front of him, he couldn’t say anything further. Yes, to him, to possess a spirit bone that suited him really was far too important. This treasure that could be discovered but not sought was enough to make his strength rise another step.</p><br/><p>Taking the precious and heavy mirror image skull bone into both hands, Oscar no longer hesitated, and the gratified light in Hao Te’s gaze grew more concentrated. Faint silvery light released from within the mirror image skull bone, and with a peng sound, the entire spirit bone turned into a cloud of silvery currents, swiftly rushing into the seven apertures of Oscar’s head, making his entire body turn dull.</p><br/><p>Hao Te took a step back, spirit power condensing, cautiously and solemnly keeping watch in all directions. The corpse on the ground gradually grew cold, and amidst the reek of blood and austere atmosphere, an unprecedented food system Spirit Master matured with astonishing speed.</p><br/><p>……</p><br/><p>Shrek Academy.</p><br/><p>The entire Academy was in a state of sensation since yesterday afternoon, just because of that astonishing news pasted everywhere.</p><br/><p>Five Shrek Seven Devils returned, carrying out an exhibition match against the two deans. In the world of Spirit Masters, the strong were always respected, and the glory brought about by the Shrek Seven Devils in those days practically couldn’t be reproduced. They not only forced their way to the Continental Advanced Spirit Master Academy Elite Tournament championship, but their ages at the time also formed an everlasting record.</p><br/><p>Five years later, five of the Seven Devils returned, and the one most students looked forward to seeing, Tang San, was also among them. Almost all the Shrek Academy students had heard the teachers’ account of Tang San’s display in the tournament back then, especially the final match, when he pulled hard against the tide in the finals versus the Spirit Hall Academy team, prevailing over the opponent, gaining the ultimate prize.</p><br/><p>At least on the surface, even Spirit Hall had no way to deal with him, because he didn’t offend any of Spirit Hall’s laws.</p><br/><p>Each of the Shrek Seven Devils was a legendary character to these common students. They had returned, and would moreover still carry out an exhibition match with two deans, what kind of inspiring and exciting major event was this!?</p><br/><p>In fact, the two deans were now Spirit Douluo over the eightieth rank. At such a competition one could naturally view extremely dazzling super spirit abilities. This was a great event low level Spirit Masters yearned for even in their dreams.</p><br/><p>The students excitedly guessed the results of the match, recalling their teachers talking about the past deeds of the Shrek Seven Devils. And on the Academy’s side, the preparations underway built the tension. The location for the exhibition match was the heart of the great forest behind the Academy. This place was requested by Tang San and the others.</p><br/><p>“Erlong, you’ve really killed me. Don’t you know just how abnormal those little monsters are? What’s more, I’m a grand and magnificent lord dean, how can I go out easily?”</p><br/><p>Flender glared resentfully at Liu Erlong in front of him.</p><br/><p>Liu Erlong snorted,</p><br/><p>“Then how about this, I’ll leave all future Academy affairs to you, and I’ll do the exhibition match today, how about it?”</p><br/><p>“Eh, this…..”</p><br/><p>Flender was immediately somewhat at a loss for words.</p><br/><p>Liu Erlong snapped:</p><br/><p>“Day after day you seem like a great idler these days, not doing any work at all. You should also make some effort for the Academy. Give the students a performance, show them your strength, let their students properly recognize their lord dean.”</p><br/><p>Flender said with a bitter face:</p><br/><p>“But, you’re not unaware of those five little monsters’ strength. If it was five common sixtieth rank Spirit Masters, fighting a bit would be nothing. I’d have some certainty. But these five little monsters aren’t ordinary. Four of the five have spirit bones. Mubai and Zhuqing’s spirit fusion ability alone is enough to cause trouble alone. Let alone when there are another three little monsters circling the rear. It’s no good, I’ll definitely be humiliated.”</p><br/><p>Liu Erlong grinned, saying:</p><br/><p>“Didn’t I arrange for you and Zhao Wuji both? I’m not leaving it on you alone.”</p><br/><p>Flender stared blankly,</p><br/><p>“Don’t tell me your setup isn’t for us to go up alternately?”</p><br/><p>Liu Erlong said grandiosely:</p><br/><p>“Of course not, I’ve planned for you two to go up together. Don’t tell me I still don’t know how tremendous Tang San and the others are? You’re still my boss, I couldn’t let you lose face.”</p><br/><p>Hearing this, Flender immediately relaxed a lot, laughing loudly:</p><br/><p>“You really are worthy of being my good little sister. En, two people is good, two people is good! No matter how astonishing those five little monsters are, they still won’t escape this old man’s palm.”</p><br/><p>Liu Erlong looked at him with a disdainful expression:</p><br/><p>“I don’t know who it was that was shivering in fear just now. Boss, don’t relax because it’s two against five. These little monsters can’t be gauged using common sense. When I talked to them yesterday, they actually readily agreed, only choosing the location for the match.”</p><br/><p>Flender didn’t think it over:</p><br/><p>“Even if they’re all geniuses among geniuses, you still can’t underestimate your big brother! Me and Wuji are after all Spirit Douluo. Having reached this level, it’s impossible to cross the twenty rank gap. If it were ordinary circumstances, any one of us could easily suppress more than ten sixtieth ranked Spirit Emperors, let alone these five. And this is still with both for insurance. If the two of us are unable to defeat those five, we should retire.”</p><br/><p>Liu Erlong grinned, saying:</p><br/><p>“In other words, this exhibition match is originally unfair. Therefore, I’ve added a line to the declaration. As long as they five can withstand you and Wuji’s attacks for the time of three sticks of incense, it’ll count as their win.”</p><br/><p>Flender nodded, saying:</p><br/><p>“That’s fine too, they’re still the geniuses produced by our education. It wouldn’t be pretty if they were defeated too miserably. With the time restriction, it’ll finally be equal, also to everyone’s satisfaction. Oh, right, Erlong, have you collected ticket fees from the students? This could be a not insignificant source of income!”</p><br/><p>Liu Erlong rolled her eyes,</p><br/><p>“Boss, are you very short of money? I remember the Empire allocated funds just now.”</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>Flender grinned, saying:</p><br/><p>“Isn’t it customary? Alright, let it be. There’s no lack of money right now. Alright, we’ll do it your way.”</p><br/><p>Liu Erlong looked at the color of the sky outside and said:</p><br/><p>“It’s about time, you prepare.”</p><br/><p>The Shrek Academy forest had undergone several years of transformation, and no longer had the appearance it did before. Not only was it split into several mimicry cultivation areas, but were moreover re-regulated. In the middle of the forest was built an enormous drill ground. Surrounded by trees, the drill ground was covered in a lawn of blue silver grass. Compared to the Academy back then, the current Academy had a lot more students, and moreover also shouldered the cooperative mission with the imperial household, giving the field diverse uses.</p><br/><p>The surroundings of this sheet of green was long since filled with a large number of waiting students. The entire Shrek Academy currently had around a thousand people, of course this didn’t include the mission from the imperial household, that section under Grandmaster’s integrated training.</p><br/><p>The surroundings of the large field were long since packed with people. Even though these students couldn’t compare to the talents of the Shrek Seven Devils back then, they were still carefully selected by the Academy, with at least higher aptitude.</p><br/><p>Tang San’s five entered the forest with Grandmaster. When they were about to arrive at the field, Grandmaster halted, saying to Tang San:</p><br/><p>“Little San, find something to hide your face with.”</p><br/><p>Tang San stared blankly a moment,</p><br/><p>“Teacher, why?”</p><br/><p>Grandmaster said:</p><br/><p>“The impression you left on Spirit Hall back then was too profound. Now your appearance and temperament have completely changed, a great advantage to your safety. Therefore, it’s better you expose yourself as little as possible. Like that, even if Spirit Hall’s people want to find you, it won’t be easy.”</p><br/><p>Tang San suddenly came to a realization. What he feld towards Grandmaster wasn’t gratitude, but completely like a family member. Swiftly nodding, he pulled out from the Twenty Four Moonlit Bridges the green mask the Shrek Seven Devils originally used and wore it over his face.</p><br/><p>Grandmaster pondered, then said to the others:</p><br/><p>“You all wear them as well. It’s better to maintain a bit of a mysterious feeling.”</p><br/><p>Dai Mubai and Zhu Zhuqing understood that this was also Grandmaster protecting them. The masks the Shrek Seven Devils used were precious mementos to all of them, and everyone had kept theirs. At once complying and wearing them, they immediately hid their original appearance.</p><br/><p>When they reached the drill ground, Liu Erlong was already standing in the middle of the field, just loudly admonishing.</p><br/><p>“..... each teacher in charge supervise your class, cheering is allowed, but there must be no disorder. Even less must anyone enter the field, or they will suffer the effects of spirit abilities. You are responsible for the consequences.”</p><br/><p>As vice dean, Liu Erlong was always known for her strictness. Let alone the students, even the teachers were afraid of her. Under her directions, each class was neatly arranged by the drill ground, quietly waiting, even the noisy comments gradually grew less.</p><br/><p>Just at this moment, Grandmaster brought Tang San’s five into the field. The masks they wore as well as Grandmaster leading, undoubtedly declared their identities. Instantly, the just quieted field immediately turned into a boiling sea, cheers echoing just like a volcanic eruption.</p><br/><p>Husband and wife, Grandmaster and Liu Erlong, smiled at each other. Very quickly, Tang San and the others arrived at the middle of the field.</p><br/><p>“Go—— se——ni——ors——”</p><br/><p>Without anyone organising it, the field still erupted in a tremendous welcoming cheer. The voices were extremely orderly, as if arranged long beforehand. The enormous clamor surged on. This was the Shrek Academy students’ display of respect for the glory the Shrek Seven Devils had won in the past.</p><br/><p>Tang San, Dai Mubai and the others were also alarmed by such a sight. The five hastily bowed slightly, returning the courtesy towards these junior schoolmates. Immediately, the atmosphere in the field once again reached another climax.</p><br/><p>The cheering continued the whole time until Flender and Zhao Wuji entered the field, and Flender’s deep voice echoed,</p><br/><p>“Alright, quiet down.”</p><br/><p>Even though it was only his voice alone, under the effect of tremendous spirit power, all the surrounding students’ cheers were unexpectedly drowned out.</p><br/><p>Flender also saw the masks the Shrek Five Devils wore. He immediately understood the purpose, and didn’t ask anything. Standing furthest in front, he began to lecture.</p><br/><p>To the students, among the Academy leadership, the ones they were most familiar with were undoubtedly Grandmaster and Liu Erlong. One was in charge of teaching, one was in charge of all affairs. But this dean Flender was only very rarely seen. Right now, Flender’s one shout gave them an ample feeling for the power of this lord dean. Flender, satisfied, swept his eyes over everyone. The fanatic light he saw in the eyes of the students was the thing he wanted to see the most.</p><br/><p>“Five years ago, the glory produced by the Shrek Academy, the Shrek Seven Devils and others representing the Academy fought off each advanced Spirit Master academy, obtaining the glory of the Continental Advanced Spirit Master Academy Elite Tournament championship for us. Today, five years later, the most significant five members of the team back then have return to the Academy. They have all already grown up, and also become even more formidable. This exhibition match today isn’t for you to enjoy the spectacle, but to let you learn what kind of peak can be reached by those of your age.”</p><br/><p>At this point he paused. The entire field was quiet as crows and peacocks, everyone quietly listening to his words.</p><br/><p>“To Spirit Masters, talent is extremely important. However, I believe you also know that, among the Shrek Seven Devils, the spirit of the one known as the soul of the Seven Devils, Tang San, is only an insignificant Blue Silver Grass. But relying on this Blue Silver Grass, he again and again led the team to prevail over powerful enemies. Why is this? Do you know?”</p><br/><p>“Because of his great effort, his struggle. To the growth of Spirit Masters, talent and luck hold no small importance, but let me tell you, what is most important is the effort made. That Tang San can have the achievements he does today, is completely the result of his own effort. Each of you possess your own spirits, I only ask you one thing, are your spirits more lacking than Blue Silver Grass?”</p><br/><p>“No——”</p><br/><p>The reply was orderly and resonant.</p><br/><p>Flender nodded with satisfaction,</p><br/><p>“Since it’s like this, what Tang San can achieve, you can equally achieve, right?”</p><br/><p>“Yes——”</p><br/><p>Listening to Flender’s rousing speech, not only those students below, even the Shrek Five Devils all felt their blood boil somewhat when listening. Even if everything Tang San possessed now couldn’t be explained by ‘effort’, he of course wouldn’t tear down Flender’s stage.</p><br/><p>Turning to the Shrek Five Devils, Flender said loudly:</p><br/><p>“Little monsters, announce your age and level.”</p><br/><p>Dai Mubai was the first to move, stepping forward, he yelled in a deep voice:</p><br/><p>“Dai Mubai, twenty three, spirit: White Tiger, sixty third ranked power attack type Battle Spirit Emperor.”</p><br/><p>Each syllable was said extremely distinctly, and his deep voice could be heard by everyone present. His power originally stemmed from the Academy, and of course he wouldn’t stint on his words.</p><br/><p>As the three words ‘Battle Spirit Emperor’ left his mouth, that formidable mind-blowing force immediately infected everyone present, and the cheers once again reached a boiling peak. Countless people loudly shouted the words ‘Evil Eye White Tiger’. Regarding the names of the Shrek Seven Devils, they had long ago already heard so often they could repeat them in detail.</p><br/><p>Twenty three years old Battle Spirit Emperor, this was something these students could scarcely imagine. This moment, the Shrek Seven Devils that had long ago turned into their idols, were raised to an unprecedented heights within their hearts.</p><br/><p>The second to step out was Tang San, standing next to Dai Mubai,</p><br/><p>“Tang San, twenty, spirit: Blue Silver Grass, fifty ninth ranked control type Battle Spirit King.”</p><br/><p>“Thousand Hands Asura, Thousand Hands Asura……”</p><br/><p>The cheers rose once again, and moreover to a boiling peak.</p><br/><p>The reason why Flender used Tang San as an example wasn’t because he was the most powerful of the Shrek Seven Devils, but rather because his spirit was innately the weakest, and could resonate with the students even easier. Moreover, the achievements Tang San led the Shrek Seven Devils to win back then, inadvertently made him the biggest idol of all the students.</p><br/><p>The plump Ma Hongjun, the perfectly built Zhu Zhuqing, and the delicate Ning Rongrong came forward one after another, announcing their age and rank.</p><br/><p>Five people, one twenty three, four twenty years old, but they were all around the sixtieth rank. In fact, looking at age alone, the majority of students were about the same as them. But among these students, only a small number were over the fortieth rank.</p><br/><p>Flender saw he had already attained his purpose, and said with a smile:</p><br/><p>“Next, me and Zhao Wuji will conduct a contest with the Shrek Five Devils. Of course, this is only an exhibition match. I know you all want to see just what the strength of these seniors that once attained the glorious record is. Actually, I also very much want to know how they have progressed in these five years. In this contest, as long as they can persevere under my and Zhao Wuji’s joint attacks for the time of three sticks of incense, it will be their win. Dean Liu, prepare the incense.”</p><br/><p>Liu Erlong nodded. She and Grandmaster walked to the edge of the field, leaving the center. This match that affected the hearts of all the Academy students would finally begin. Right now, not only the students, even the Academy’s teachers were completely focused. After all, even these teachers were for the most part only around the sixtieth rank in strength.</p><br/><p>Tang San made a gesture to Dai Mubai, expressing that everything proceeded according to plan. Even though their faces were covered with masks, judging by the relaxed expressions in their eyes, they weren’t the slightest bit nervous about this exhibition match.</p><br/><p>Zhao Wuji and Flender looked face to face, and Zhao Wuji said in a low voice:</p><br/><p>“Boss, will we start off leniently?”</p><br/><p>Flender snapped:</p><br/><p>“Have you forgotten how miserable you looked back when Tang San just came to the Academy? Just pay attention to fighting properly. You’re the main force on the ground, I’ll harass them from the air.”</p><br/><p>Zhao Wuji stared blankly a moment, then at once reacted:</p><br/><p>“Fuck me, you’re using me as meat shield. Boss, don’t you have any humanity?”</p><br/><p>Flender leisurely and contentedly said:</p><br/><p>“I’m an agility attack type Spirit Master, you’re power attack, don’t tell me you’re unsuited to be a meat shield while I am? Don’t worry, I’ll give you enough firepower support from the air. Your hands are free to attack.”</p><br/><p>Looking at Flender’s vulgar appearance, Zhao Wuji was at a loss for words. Helplessly shaking his head, he suddenly roared loudly, head high and chest out, he released his spirit.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>His body could be seen swelling against the wind, all his clothes suddenly tearing, light brown fur sprouting, in the blink of an eye, his height had grown to three meters, dense aura abruptly dispersing in all directions, muscles exaggeratedly prominent, altogether eight spirit rings appearing practically simultaneously.</p><br/><p>Two yellow, three purple, three black, this represented the strength of a Spirit Douluo.</p><br/><p>Ordinarily, Zhao Wuji very rarely revealed his strength in front of students, the majority of the students didn’t know what level this dean was. Now seeing those eight spirit rings appear, everyone present couldn’t help turning as silent as crows and peacocks, the tremendous pressure almost leaving them unable to breathe.</p><br/><p>Facing the sky and roaring, dense energy burst open, making the blue silver grass on the ground tremble in waves with Zhao Wuji as the center.</p><br/><p>Now the spectating students understood why dean Flender just said it would be the Shrek Five Devils win if they endured for the time of three sticks of incense even with their roughly sixtieth rank strength. They would face Spirit Douluo level powers! The vice dean was a Spirit Douluo, then the dean?</p><br/><p>Flender gave them the answer at once. Different from Zhao Wuji’s roar, he issued a sharp cry, a pair of enormous wings abruptly unfurling from his back, his pupils erecting, both hands forming claws, eight equally colored spirit rings soaring up. Both wings spread, spiraling above Zhao Wuji.</p><br/><p>If there was only the two cooperating, then Flender and Zhao Wuji’s teamwork was undoubtedly close to perfect. One forcefully attacking on the ground, one flying in the air, the pressure of the two great Spirit Douluo almost enveloping the entire space.</p><br/><p>The Shrek Five Devils smiled at each other, and Dai Mubai shouted:</p><br/><p>“Our turn. Brothers, we haven’t fought shoulder to shoulder for a long time. Come.”</p><br/><p>Amidst violent bone cracking sounds, the White Tiger emerged. Dai Mubai’s body grew equally sharply, a valiant king among beasts aura instantly spreading, evil eye prestige radiating all around. The lines of all his muscles rose, the sharp blades of tiger claws ejecting, six peak configuration spirit rings revolving and rising. With a tiger roar towards the sky, powerful shocks radiated in all directions, without the slightest influence from the pressure of facing the two deans.</p><br/><p>Close behind Dai Mubai, Tang San and the others also released their spirits. Undoubtedly, Tang San’s spirit release was the least eye catching. Just a few strands of gold within blue Blue Silver Grass growing in his palm. But if someone could now carefully observe, they would definitely discover that as the Blue Silver Emperor appeared in his hand, all the blue silver grass on the ground seemed to sway regularly, as if officials greeting the Emperor.</p><br/><p>Even though the Shrek Five Devils hadn’t been together for several years, the mutual understanding from back then hadn’t disappeared. They had already simply talked it over before the competition. Right now, Dai Mubai charged forward, Tang San was positioned in the middle, Zhu Zhuqing and Ma Hongjun on either side, and Ning Rongrong furthest back. The five maintained a completely  shaped formation against the two deans.</p><br/><p>In imposing manner, the Shrek Five Devils were undoubtedly at a complete disadvantage. After all, the difference in strength to the two deans was too large. The pressure two Spirit Douluo could bring to bear wasn’t something they could compare to right now.</p><br/><p>However, even if they weren’t equal to the two deans in imposing manner, within the imposing manner the two deans released, they didn’t shrink back in the slightest. Just like a giant iron plated ship setting sail against the wind, not shifting the slightest from the stormwind and rain of the outside world.</p><br/><p>On the other side, Liu Erlong used her finger to ignite the first stick of incense, shouting,</p><br/><p>“Begin.”</p><br/><p>As her words fell, the first to move was Zhao Wuji. With heavy steps, he went straight to meet Dai Mubai from the front. The Vigorous Vajra Bear’s first spirit ability, Bright King Body, already released. His entire body had a layer of golden luster. Terrifying spirit power fluctuations made him seem like a war chariot loudly pressing forwards.</p><br/><p>Facing Zhao Wuji’s frontal charge, Dai Mubai didn’t show a trace of intent to retreat. Equally releasing White Tiger Barrier, he was ready and waiting for action like a drawn bowstring.</p><br/><p>Flender in midair suddenly pulled up, shooting into the sky, in the blink of an eye already a hundred meters up. Raptor eyes scanning the ground, his eight spirit rings flickered alternately, unknown what spirit abilities he used.</p><br/><p>“Retreat.”</p><br/><p>Tang San’s calm voice echoed by Dai Mubai’s ear. Basically without thinking it over, Dai Mubai burst into retreat. With the opposition’s vigor disappearing now, Zhao Wuji’s imposing manner flourished, accelerating, pouncing straight at the five.</p><br/><p>“Begin.”</p><br/><p>Tang San shouted loudly, a circle of clear blue light abruptly spreading from him. Immediately afterward, Zhao Wuji felt his whole body tighten, just as he with large strides forward knocked against a solid barrier.</p><br/><p>Tang San’s fourth spirit ability, Blue Silver Prison, launched.</p><br/><p>A cage directly trapped Zhao Wuji within, the simultaneously released Blue Silver Domain immediately making this Blue Silver Prison extremely solid. Making Zhao Wuji even more indescribably startled was that the blue silver grass on the ground began to grow frantically, rushing towards him in wave after wave.</p><br/><p>Heart tightening, Zhao Wuji had eaten losses from Tang San before. At this moment, he didn’t have the slightest hesitation, instantly releasing his seventh spirit ability, Spirit Avatar.</p><br/><p>His originally tall body abruptly grew sharply, the full strength of his spirit power releasing. In the blink of an eye, Zhao Wuji’s body had already expanded to seven meters tall, and that Blue Silver Prison trapping him was immediately split open by that enormous body. However, shocking Zhao Wuji was that Blue Silver Prisons constantly shot up around him one after another, no matter how he grew, the Blue Silver Prisons around him also grew along with him. As he completed his Spirit Avatar, he could no longer see the outside world, unaware how many layers of Blue Silver Prisons were trapping him within.</p><br/><p>The spectating students were currently dumbstruck. They hadn’t expected a scene like this to appear. As far as their eyes could see, the blue silver grass on the ground all grew frantically with a wild vitality, constantly adding layer after layer of depth to the blockade around Zhao Wuji, already completely covering this vice dean.</p><br/><p>Shocking them even more was still Tang San. Right now Tang San’s entire body had already turned into a sparkling blue color, and with him as the center, countless specks of blue light constantly rushed towards him from the surrounding blue silver grass.</p><br/><p>This was the true secret of the Blue Silver Domain. Its effects could truly appear in areas with large amounts of blue silver grass.</p><br/><p>Watching this scene, let alone those spectating students being shocked, even Flender preparing to attack from the air as well as the other four Shrek Five Devils were gobsmacked. No matter how they thought they couldn’t understand how Tang San’s fourth spirit ability could contain such great power, even Zhao Wuji using Spirit Avatar was unable to immediately break free.</p><br/><p>Right now, under Tang San’s control was not only the blue silver grass in this field, but moreover all the blue silver grass in the range of the entire Shrek Academy. Within this great forest, all the blue silver grass had already completely become his eyes. Those specks of blue light was the condensed vital force and information of the blue silver grass, converging on Tang San.</p><br/><p>Relying on Blue Silver Domain’s effect, these blue silver grass not only grew quickly, but also instantly united with Tang San. Under such circumstances, Blue Silver Domain was constantly nourished, and its range and power both grew exponentially. This was also why Tang San’s fourth spirit ability, Blue Silver Prison, could trap Zhao Wuji.</p><br/>\n</div>"}