{"title": "Chapter 150", "id": 150, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-150", "volume_title": "Volume 2", "body": "<h1>Chapter 150</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 150</p><br/><p>Void Ghost Shadow Perplexing Track</p><br/><p>Part 1 (TL by Bagelson)</p><br/><p>However, their shock very soon turned to sighs of praise. At the same time as Tang San leapt off, a strand of Blue Silver Emperor had already twisted around the iron cable bridge, at the same time he raised his right hand, another strand of Blue Silver Emperor shooting out to twist around a place where the seventh elder’s Clear Sky Hammer had already swept past. Moving, he released the first strand of Blue Silver Grass, dashing straight at where the seventh elder stood from below.</p><br/><p>The seventh elders preparations were mostly directed at Tang San leaping up into the air, and Tang San’s method to avoid his Clear Sky Hammer attack was completely unexpected, and his reaction was naturally half a beat slow.</p><br/><p>Eight Spider Lances extended, simultaneously stabbing at different locations on the seventh elder’s body, at the same time as a Spiderweb Restraint also opened up from below.</p><br/><p>Tang San might be short of his opponent in strength, but in terms of ability to grasp timing, he wasn’t below the seventh elder in the slightest. This moment was just in the gap when the seventh elder had attacked with his Clear Sky Hammer, and still hadn’t recovered. It was also the gap where new strength still hadn’t taken the place of old.</p><br/><p>The azure Blue Silver Domain launched, Spiderweb Restraint spreading out against the wind, the range it covered increasing once again. Even with strength like the seventh elder’s, if he was trapped by this Spiderweb Restraint while using only forty percent spirit power, he would still need some time to break free.</p><br/><p>Suddenly finding his opponent appearing below him, the seventh elder made the most proper choice. Once again kicking off from the iron cable bridge, he shot up. He simultaneously raised a hand to recall his Clear Sky Hammer. With the iron cable bridge in the way, as long as he wasn’t on the iron cable, the Spiderweb Restraint would be unable to affect him.</p><br/><p>However, astounding the seventh elder was that another strand of Blue Silver Grass shot out from Tang San’s right hand. It wasn’t aimed at the seventh alder, but rather directly tangled on the edge of the spiderweb. With a dextrous swing, the spiderweb spun and flew off at an angle. With that strand of Blue Silver Grass on the inner edge, the spiderweb flew sideways, still moving to envelop the seventh elder.</p><br/><p>This wasn’t as simple as only spirit abilities, but still contained Tang San’s ingenious hidden weapons techniques. Relying on Controlling Crane Catching Dragon’s inner strength control, that enormous, more than ten meter in diameter, spiderweb moved like a living creature.</p><br/><p>And now Tang San had also reached the iron cable bridge. His left hand struck out at the bridge, forcefully throwing his own body up, chasing after the seventh elder in midair in a straight line.</p><br/><p>“Good kid.”</p><br/><p>The seventh elder shouted, unable to keep his eyes from revealing an admiring luster. To be able to perfectly exploit his own spirit’s advantages wasn’t something every Spirit Master could do. And in this, Tang San had undoubtedly done very well.</p><br/><p>The seventh elder’s right hand swung in empty air, no longer recovering the Clear Sky Hammer like he had just prepared to do, but rather directly throwing it out. Under his control in midair, it smashed directly towards the soaring Tang San. And just at this moment, his fifth spirit ring suddenly flashed. The atmosphere suddenly grew heavy, a feeling like that of a mountain abruptly releasing from him.</p><br/><p>Tang San in midair only felt as if his body had grown heavy, and his chase towards the seventh elder unexpectedly changed from rising to falling. The Spiderweb Restraint also stalled a moment in midair, its speed falling greatly.</p><br/><p>Gravity Control. Tang San’s brain immediately produced the name of this spirit ability. He had also met a similar spirit ability back when he originally faced off against the Motionless Bright King Zhao Wuji. But compared to Zhao Wuji, the seventh elder’s Gravity Control was clearly a lot more powerful. It seemed as if something was pulling him down from below.</p><br/><p>Immediately afterward, the seventh elder’s sixth spirit ring also brightened, and the Clear Sky Hammer chasing after Tang San in midair abruptly turned from one into two, one of them splitting off to swiftly sink downwards, striking at Tang San’s feet. Judging by the formidable strength the Clear Sky Hammers released, neither had weakened.</p><br/><p>Spirit Doppelgänger?</p><br/><p>Faced with this ability that was almost top quality for tool spirits, Tang San’s face couldn’t help growing serious.</p><br/><p>Spirit Doppelgänger would generally only appear for tool Spirit Masters. When such an ability was used, it could release an attack with a tool spirit perfectly identical to one’s own tool spirit. Most terrifying was that after this ability was used, it could superimpose with other abilities.</p><br/><p>In other words, for a short time, the above mentioned tool Spirit Master’s attack power would double.</p><br/><p>Spirit Doppelgängers that appeared in in ten year spirit rings could only possess thirty percent of the original spirit’s attack power, hundred year spirit rings had fifty percent, thousand year spirit rings seventy percent, and only when it appeared in a ten thousand year spirit ring would it possess one hundred percent.</p><br/><p>If it was a hundred thousand year spirit ring, when Spirit Doppelgänger was used, the two identical spirits could both possess two hundred percent strength.</p><br/><p>This was why hundred thousand year spirit rings were said to be the most valuable, most treasured things in the Spirit Master world.</p><br/><p>Seeing the seventh elder use a ten thousand year spirit ring Spirit Doppelgänger, even though it was only his second ten thousand year spirit ring, the result it produced was still a Clear Sky Hammer with hundred percent effect.</p><br/><p>As long as he used any other spirit ability on the hammers, both would display dual effects.</p><br/><p>The Clear Sky Hammer was originally tyrannical in itself, and when Tang San this time confronted two hammers, the degree of frightfulness could be imagined. As one of the Clear Sky School’s five elders, right now the seventh elder’s strength truly emerged.</p><br/><p>Did the seventh elder also want to attack the iron cable below? That would undoubtedly put the gravity controlled Tang San in an extremely bitter position. But the seventh elder wouldn’t have anywhere to stand either. What would he choose?</p><br/><p>The seventh elder very quickly gave the answer. His second spirit ring flashing, his second spirit ability ‘Hammer Spirit Control’ launched. Simultaneously pulling with both hands, the Clear Sky Hammer flying at Tang San accelerated, and the other one striking below his feet swept back up.</p><br/><p>One above and one below, a pincer attack at Tang San in midair.</p><br/><p>And confronting Tang San’s Spiderweb Restraint that still flew towards him, the light from the seventh elder’s fifth spirit ring grew somewhat stronger, forcibly relying on Gravity Control to suppress it, making Tang San unable to throw that spiderweb at him.</p><br/><p>There was no need to doubt Tang San’s control ability, but the seventh elder’s response was even more incomparably marvellous. Relying on his own reasoning abilities and the Clear Sky Hammer’s potency, he simply reversed Heaven and earth in midair. The scales of victory started leaning in the other direction in practically an instant.</p><br/><p>Two enormous Clear Sky Hammers with terrifying auras attacking from two different directions, and still the pressure caused by the Gravity Control.</p><br/><p>Right now Tang San could already be said to be in an extremely dangerous position. Even if he released his two great domains, the gap in strength between him and the seventh elder was so large that they couldn’t cause any degree of threat for the seventh elder.</p><br/><p>Tang San could of course rely on that Blue Silver Emperor right leg bone’s flying ability to get out of danger, but he didn’t want to do so. Even if that was also part of his strength, he wanted to rely on his own original strength to properly contest this seventh elder. Such an opponent wasn’t easy to find! Tyrannical spirit, plentiful combat experience.</p><br/><p>Squaring up against the seventh elder, eliminating the previous insult to his mother, this battle also had a very large benefit to Tang San.</p><br/><p>Moving in midair, the Eight Spider Lances behind Tang San’s back suddenly gathered together, the four Eight Spider Lances on either side gathering like wings, forcefully beating once.</p><br/><p>The Eight Spider Lances of course weren’t wings, and were unable to let Tang San fly, but relying on this brief beat, it could still let him pause a moment in the air.</p><br/><p>Taking advantage of this momentary effort, Tang San turned like lightning, several dozen strands of Blue Silver Emperor flying out simultaneously.</p><br/><p>He knew that those Clear Sky Hammers were both under the seventh elder’s control. As long as he didn’t directly fly, escaping the attack of these two hammers was impossible. Even more so when he was in midair, how could he dodge?</p><br/><p>Powerful cracks of sound rung out in succession, as Tang San commanded the Blue Silver Grass to successively strike at the Clear Sky Hammers attacking him.</p><br/><p>The Clear Sky Hammer’s own powerful shocking force instantly blasted away the Blue Silver Emperor. Fortunately the Blue Silver Emperor was flexible, if it was a solid spirit in their stead, even the Eight Spider Lances might have been smashed by that terrifying Clear Sky Hammer.</p><br/><p>The Clear Sky Hammer was after all the Clear Sky Hammer. Under the assault by dozens of Blue Silver Emperor, it unexpectedly didn’t change its direction forward even the slightest, and their imposing manner instead increased even more.</p><br/><p>By now, the seventh elder was already falling towards the iron cable bridge, his mind completely focused on controlling those two Clear Sky Hammers.</p><br/><p>Tang San suddenly moved, relying on that instant Blue Silver Grass whip lash. His body that was originally like a rootless duckweed swiftly flickered, both feets successively kicking off the several dozen strands of Blue Silver Emperor drifting in the air, seemingly dancing illusorily in the air, Ghost Shadow Perplexing Track reaching its limit in this moment.</p><br/><p>Because of being sent flying by the Clear Sky Hammer, those several dozen strands of Blue Silver Emperor all surged up high, unlikely to fall for the moment. And Tang San moved on these strands of Blue Silver Emperor.</p><br/><p>Even with the seventh elders strength, he was unexpectedly also unable to see his current movements.</p><br/><p>Any Spirit Master’s attack had to first lock in on the opponent, and the feeling Tang San gave the seventh elder right now unexpectedly couldn’t be locked on to.</p><br/><p>The ice cold Deathgod Domain spread to its greatest degree, forcefully breaking the seventh elder’s qi lock, and Tang San had already transformed into countless shadows drifting in the air.</p><br/><p>The two Clear Sky Hammers attempted to catch up to him and find their proper target, but the end result was that they criss crossed, striking empty air.</p><br/><p>Even the seventh elder couldn’t help being stunned right now. Who could have imagined that Tang San actually could use such an ingenious way to dodge his attack?</p><br/><p>Part 2 (TL by Bagelson)</p><br/><p>In midair, Tang San’s right arm flashed with golden light, his fifth spirit ring once again blossoming black, starting to store power.</p><br/><p>From the start of his battle with the seventh elder, the two virtually hadn’t touched, but both had amply proven their combat experience through the abilities they used. The seventh elder even more let Tang San see his true strength.</p><br/><p>Raising his hand to recall his Clear Sky Hammer, the seventh elder didn’t chase after and attack Tang San on the distant Iron Cable Bridge, but his seventh spirit ring gradually brightened.</p><br/><p>On the side of the cliff, the long-eyebrowed second elder couldn’t help frowning as he saw the seventh elder’s bright seventh spirit ring. The seventh spirit ability was the most powerful spirit ability he could use while below forty percent spirit power, and moreover combined with the sixth spirit ability, Spirit Doppelgänger, looking at the overall spirit power utilized, it should already surpass forty percent.</p><br/><p>The second elder knew that Tang San’s repeated ingenious responses should have raised the seventh elder’s competitive spirit by now, and hoped he could control his strength well. After all, Tang San had already given these Clear Sky School elders too many pleasant surprises.</p><br/><p>Dextrously flipping and landing on the iron cable bridge, Tang San’s right arm was already completely covered in golden Blue Silver Grass. With each breath, the golden color on his arm grew a bit stronger.</p><br/><p>Right now, the benefits of the connected eight extraordinary meridians gradually appeared. Tang San’s spirit power of course couldn’t be compared to the seventh elders, but his recovery speed was more formidable than anyone. Once again displaying his fifth spirit ability, his face didn’t reveal a trace of exhaustion, still with abundant vigor, without the slightest weariness. Of course, this was also to a large degree related to the growth of his spiritual force.</p><br/><p>Everyone in the Clear Sky School attentively watched Tang San. Could it be that he wanted to rely on his fifth spirit ability to withstand the seventh elder using his sixth and seventh great spirit abilities?</p><br/><p>The seventh spirit ability was always regarded as a qualitatively different spirit ability. The Clear Sky Hammer’s tool spirit avatar had even more terrifyingly formidable might. Moreover, under the effects of Spirit Dopplegänger, Tang San would have to face two tool spirit avatars.</p><br/><p>Nobody believed that he could endure the seventh elder’s attack under such circumstances.</p><br/><p>The seventh elder’s expression was somewhat serious. On this iron cable bridge, even though Tang San was unable to fully use his fourth spirit ability, Blue Silver Prison, it was even more restrictive to the seventh elder. Each time he used force he had to be especially careful, for fear that the iron cable couldn’t hold up. The pressure Tang San gave him was also more than he had imagined. Especially those eight seemingly crystalline piercing lances on his back. The seventh elder could clearly sense that if he was stabbed, he might be immediately defeated.</p><br/><p>Tremendous spirit power started to condense on the hammer in his hand. If he could use all his strength, this tool spirit avatar could be revealed in an instant, but right now he was restricted to forty percent spirit power, so using this spirit ability required storing power. This was also why the seventh elder didn’t block Tang San from using his fifth spirit ability. Both sides were simultaneously storing strength, he had complete confidence in his victory over Tang San in such circumstances.</p><br/><p>A heavy atmosphere rising in front, Tang San’s pupils gradually contracted. He knew that the outcome of this battle hinged on one move. The tool spirit avatar wasn’t something he could risk dodging like those abilities from before, and the opponent moreover still had two tool spirit avatars, making him even more unable to dodge lightly. The Clear Sky Hammer’s formidable oppressive strength already made the iron cable below his feet tremble violently, as if it might collapse at any moment.</p><br/><p>Sighing deeply inside, Tang San understood that he would perhaps still have to use the spirit ability he originally didn’t want to use. Even if he only used forty percent spirit power, the seventh elder’s spirit abilities still held too great an advantage. Even more, those forty percent spirit power of his, was forty percent spirit power in a steady stream, basically with no fear of exhaustion. But he was different.</p><br/><p>Understanding this clearly, Tang San’s expression already grew more serious.</p><br/><p>Suddenly, Tang San shouted,</p><br/><p>“Seventh elder.”</p><br/><p>The seventh elder practically subconsciously focused his gaze on him. In the seventh elder’s mind, this was clearly the ideal moment for Tang San to concede. As long as Tang San conceded, he would indicate he himself had already exhausted a lot of spirit power, and conclude this contest as a tie. Like this, he would have displayed his own strength, and also satisfied the second elder’s intent.</p><br/><p>However, what met him really wasn’t Tang San’s words of concession, but rather two rays of clear blue light.</p><br/><p>Everyone on the side of the cliff clearly saw two lines of rich blue light shoot out from Tang San’s eyes, reaching the seventh elder in practically an instant.</p><br/><p>‘Not good.’ The seventh elder cried in his heart. Right now his tool spirit avatar still hadn’t completely formed.</p><br/><p>The instant he saw the blue light erupting from Tang San’s eyes, he knew that wasn’t something he could reduce with the spirit power surrounding him, and even less something he could stiffly resist.</p><br/><p>In the moment of crisis, the seventh elder was already unable to change his precious plans. His spirit power instantly erupting, his tool spirit avatar reached its peak in an instant. The left hand hammer moving sideways, blocking in front of him, the right hand hammer already subconsciously shot out.</p><br/><p>Anyone would subconsciously protect themselves when in danger, and moreover remove the threat. As the seventh elder became aware that he had swung a hammer with his full strength, it was already too late.</p><br/><p>An explosion first of all rumbled in front of the seventh elder. Amidst the violent explosion, the iron cable he stood on shredded cun by cun, black ripple after ripple spreading from the immense Clear Sky Hammer already assigned the tool spirit avatar. And the seventh elder also plummeted downwards uncontrollably.</p><br/><p>And on his other Clear Sky Hammer, a terrifying black light instantly spread, blasting straight for Tang San.</p><br/><p>At this moment, the spirit ability on Tang San’s right arm finally finished storing power.</p><br/><p>The golden Blue Silver Overlord Spear instantly blossomed with a close to transparent golden light. A flash passed, and it struck together with the Clear Sky Hammer tool spirit avatar dashing in front.</p><br/><p>A scene shocking everyone appeared. The incomparably enormous hammer illusion formed by the Clear Sky Hammer tool spirit avatar was pierced through, it still smashed towards Tang San, but its color had overall dulled a lot, and that golden light unexpectedly penetrated the hammer illusion, chasing after the falling seventh elder in an arc.</p><br/><p>His fifth spirit ability could unexpectedly actually pierce the tool spirit avatar used by a Title Douluo? Even if the seventh elder didn’t have time to use his full strength all of a sudden, that was still a certifiably genuine Title Douluo!</p><br/><p>At the moment, nobody had time to think of a reason. Even Tang San himself hadn’t thought of an outcome like this. In fact, not even he knew that the power of this fifth spirit ability of his, under the effect of the Blue Silver Domain, was enough to compare to a spirit ability produced by a fifty thousand year level spirit ring.</p><br/><p>The time to put this fifth spirit ability, Blue Silver Overlord Spear, to use didn’t require only Tang San’s own spirit power, but at the same time also relied on merging the stored Blue Silver Emperor aura of his Blue Silver Domain.</p><br/><p>Even though there weren’t a lot of Blue Silver Grass on the summit of this mountain, under that amplification, the penetrating power of this spirit ability was still extremely terrifying. Of course, this was also related to that tool spirit avatar not really being under the seventh elder’s direct control. If it was the Clear Sky Hammer tool spirit avatar under his full control, with such a large difference in spirit power between the two sides, it would be impossible for Tang San’s Blue Silver Overlord Spear to pierce the black illusion in front of him.</p><br/><p>However, that black illusion formed by the Clear Sky Hammer didn’t disappear, the enormous shadow constantly growing larger before Tang San’s eyes. The first impression Tang San had was that he was unable to dodge. Right now the iron cable bridge below his feet had also already ruptured, and he was completely falling towards the abyss below, but that enormous Clear Sky Hammer illusion chased after him as if it had grown eyes, and was already in front of him.</p><br/><p>The Eight Spider Lances gathered like bones in front of Tang San, the crystalline Blue Silver Emperor instantly twisting around with these bones as a framework, wrapping up Tang San like a giant cocoon.</p><br/><p>As the black light crashed into the giant blue cocoon, Tang San was sent flying like a cannonball, in an instant heavily striking the opposite mountain wall, completely sinking into it.</p><br/><p>On the other side, the seventh elder wasn’t at ease either. In midair, the Clear Sky Hammers in both his hands took turns blasting downwards, using his terrifying spirit power to forcefully push down on the air below, forcefully keeping himself from falling, while at the same time once again unleashing his fifth spirit ability, Gravity Control. This time he used it to make his own body as light as possible, like this he could rely on constantly swinging the Clear Sky Hammers to bring himself back to the mountaintop.</p><br/><p>However, at this moment, Tang San’s Blue Silver Overlord Spear arrived.</p><br/><p>The Blue Silver Overlord Spear was incomparably fast. As the seventh elder became aware of it piercing his Clear Sky Hammer tool spirit avatar, the Blue Silver Overlord Spear had already reached him.</p><br/><p>Just like the tool spirit avatar couldn’t be dodged, being locked in on by the Blue Silver Overlord Spear, the seventh elder was also equally unable to completely dodge. He could only join the Clear Sky Hammers in both his hands in front of his chest in the middle of his swinging motions, to block the Overlord Spear bombardment.</p><br/><p>With a loud explosion, countless golden specks of light erupted into the air. The seventh elder discovered to his horror that even though he had smashed that Overlord Spear, his body had also temporarily lost the ability to move under the effect of a peculiar energy. All the spirit abilities he used were completely cut off.</p><br/><p>This was where the Blue Silver Overlord Spear was the most tyrannical. Besides the frightful attack power, when it erupted, it would form a brief Blue Silver Domain area, forcefully interrupting the spirit abilities the opponent used, and moreover stun the opponent for a certain time. As for how long this stun lasted, it would depend on the victim’s strength.</p><br/><p>As a Title Douluo, there was no need to doubt the seventh elder’s strength. His Fierce Yang title mainly described his ruthless attack methods and his final two great spirit abilities. Therefore, under the attack of the Blue Silver Overlord Spear, he was only stunned for a brief two seconds.</p><br/><p>Part 3 (TL by Bagelson)</p><br/><p>If it was on level ground, these two seconds of course wouldn’t count for anything, but right now he was nevertheless in midair over an abyss.</p><br/><p>The two Clear Sky Hammers instantly turned into one, and moreover still one that had lost the effect of the tool spirit avatar. With the enormous weight of the full Clear Sky Hammer, he fell from the sky just like a meteor.</p><br/><p>In fact, with his ninetieth ranked spirit power, the weight of the Clear Sky Hammer he held already surpassed three thousand jin[1], when in real combat with the tool spirit avatar it could even reach more than ten thousand jin. How far would a three thousand jin weight fall in two seconds?[2] The people on the side of the cliff could only watch the seventh elder’s body disappear unseen into the clouds and mist in the blink of an eye.</p><br/><p>A silhouette swiftly threw itself from the mountain, that was Clear Sky School master Tang Xiao. He of course wasn’t going to save the seventh elder, how would a Title Douluo have to worry over a light fall? He was worried about Tang San who had been struck by the seventh elder’s tool spirit avatar.</p><br/><p>A deep hollow had been knocked into the mountain wall, and Tang San had been sunk ten meters inside.</p><br/><p>However, as Tang Xiao reached the mountain wall, preparing to go inside the hollow to rescue Tang San, he just saw Tang San walking out from inside.</p><br/><p>The Eight Spider Lances behind his back withdrew, just now merging into his body, the Blue Silver Grass also melting back inside strand by strand. Tang Xiao could see some fine cracks on the Eight Spider Lances. Apart from this, only a bloodstain at the corner of Tang San’s mouth proved that he had just been hit by the Clear Sky Hammer’s tool spirit avatar.</p><br/><p>“Little San, you……”</p><br/><p>Tang Xiao grabbed the rock wall with one hand, shocked and concerned looking at Tang San walking out.</p><br/><p>Tang San wiped the bloodstain from the corner of his mouth with a wry smile,</p><br/><p>“Uncle. I’m alright. Don’t worry.”</p><br/><p>With Blue Silver Grass evolving into Blue Silver Emperor, Tang San’s originally already extremely durable body had gained even more immeasurable vitality. Tang Hao once said that it would perhaps be difficult to find anyone on the Continent with a stronger body than his. Under the protection of Blue Silver Grass and Eight Spider Lances, Tang San had amply displayed his own toughness. Further adding that the tool spirit avatar had been weakened somewhat by his Blue Silver Overlord Spear, even though he himself was embedded in the rock wall, the brunt of the force was taken up by the evolved external spirit bone Eight Spider Lances. He had suffered a bit of mental shock. The only thing making Tang San a bit depressed was that he couldn’t fully use the Eight Spider Lances for a month. It would need time to recover.</p><br/><p>Tang Xiao watched dumbstruck as Tang San leapt up next to him, right leg sprouting a stream of air that brought him to the top of the mountain, and couldn’t help being speechless. ‘Hao, you’ve really raised a little monster!’</p><br/><p>That Tang San didn’t wait for Tang Xiao to come up first was because his spirit power consumption really was too large, and he needed to rest immediately. Otherwise he trouly would be injured.</p><br/><p>Watching Tang San climb up, the Clear Sky School elders as well as the second and third generation disciples were each and everyone already speechless.</p><br/><p>Everyone had seen the seventh elder being forced to use his full strength in the final moment by Tang San’s Purple Demon Eye. There was no longer any need to doubt the outcome of this contest. Watching Tang San crawl up, then sitting down crosslegged and starting to cultivate as if nobody else was there, the elders gazes all seemed very monstrous. One kind browed and pleasant eyed elder was even laughing out loud.</p><br/><p>“Old seven’s taken a bit large loss this time! Second brother, hold him back a bit later, don’t let him be impulsive.”</p><br/><p>Before his words had ended, the seventh elder’s silhouette had already appeared in everyone’s line of sight. Even though he fell quickly, his strength was after all formidable. After regaining control of his body, he immediately used spirit abilities, using his spirit power impact to throw himself to the mountain wall, swiftly climbing back up like that.</p><br/><p>But seeing his panting, red faced appearance, the second and third generation disciples were quiet as cicadas in winter. At this moment, nobody dared provoke this ill-tempered seventh elder.</p><br/><p>The seventh elder shouted just as he climbed up,</p><br/><p>“That kid? He wouldn’t be blasted to pieces by me, how come there’s no trace?”</p><br/><p>On his way up, he had already gone to look in on that hollow smashed open by Tang San, but didn’t find anyone. Only a sport of blood. Then he hastily climbed up.</p><br/><p>Before he finished speaking, he finally saw that cross legged silhouette, and rubbed his eyes hard,</p><br/><p>“How did this kid come up? Sect master, did you save him?”</p><br/><p>Tang Xiao shook his head,</p><br/><p>“He came up on his own.”</p><br/><p>The seventh elder blinked, resolutely saying:</p><br/><p>“Impossible. Struck by my full force tool spirit avatar, even if he didn’t die he’d still have lost a layer of skin, how could he still climb up on his own. That’s impossible.”</p><br/><p>“Cough cough.”</p><br/><p>The second elder coughed twice. Walking over to the seventh elder’s side, he clapped his shoulder,</p><br/><p>“Accept the facts, We all saw this child come flying up from below. If my guess isn’t wrong, he should still have a flying ability that he didn’t use against you.”</p><br/><p>“But……”</p><br/><p>The seventh elder still wanted to say something.</p><br/><p>“Shut up.”</p><br/><p>The second elder’s expression immediately grew solemn,</p><br/><p>“This child’s injuries shouldn’t be serious. You violated the established rules in your contest with him. This match is already your loss.”</p><br/><p>The seventh elder stood there somewhat dully,</p><br/><p>“I don’t believe it, I don’t believe I would lose to a twenty year old child.”</p><br/><p>“Old five, bring him back to rest.”</p><br/><p>The second elder signaled another elder to the side with his eyes.</p><br/><p>The other elder stepped forward, raising his hand to grap the seventh elder’s shoulder,</p><br/><p>“Let’s go, old seven. Actually, if it was any of us, we still might not have done better. This child is too outstanding.”</p><br/><p>“No, I can’t leave.”</p><br/><p>The seventh elder shook his head, his expression so gloomy it seemed it might drip water.</p><br/><p>“Old seven, remember you position.”</p><br/><p>The second elder shot him a glare.</p><br/><p>The seventh elder said in a low voice:</p><br/><p>“Second brother, if you agree to a bet you must accept to lose. Since I lost, I will do what I agreed to. I’ll wait for him to wake up here.”</p><br/><p>The second elder nodded, his face revealing a somewhat praising look. He turned to look at Tang Xiao and Tang Yue-Hua to the side,</p><br/><p>“Yue-Hua, you can go prepare the ceremony for recognizing ancestors and clan. Everyone scatter. Go cultivate.”</p><br/><p>The ceremony only required a few elders and the sect master. Moreover, he still wanted to talk to Tang San.</p><br/><p>Tang Yue-Hua exulted, hastily saying:</p><br/><p>“Many thanks, elders.”</p><br/><p>The second elder looked at the sect master Tang Xiao with a deep meaning in his eyes,</p><br/><p>“It’s not anything we did, he did it on his own. I’ve never seen a youngster as outstanding as him. I only hope he won’t take a wrong road in the future, that he won’t waste his gifts like his father.”</p><br/><p>Tang Xiao lowered his voice:</p><br/><p>“Elders, the Clear Sky School has been sealed for many years. Isn’t it time to lift the prohibition?”</p><br/><p>The second elder shook,</p><br/><p>“Sect master, what do you mean?”</p><br/><p>Tang Xiao turned, looking to the distant south,</p><br/><p>“Twenty years have passed, it should be time for Clear Sky to again appear in the Spirit Master world. Haven’t you elders several many times raised the idea of lifting the ban to me? I think, right now the time is ripe.”</p><br/><p>Whenever an elder rose to the Title Douluo level after trials and hardship, Tang Xiao would receive their proposal to unseal the Clear Sky School. But he had never agreed. As sect master, he first of all had to think of the sect’s future generations, he couldn’t forfeit the sect over impulse.</p><br/><p>Even now, though the Clear Sky School had lost Tang Hao, they had gained five elders, already possessing six Title Douluo. And the second generation disciples from back then had also matured. After twenty years of patient cultivation, it seemed to Tang Xiao that their accumulated strength was already sufficient.</p><br/><p>“No, I disagree.”</p><br/><p>The second elder shook his head, speaking in a low voice.</p><br/><p>“Disagree? Isn’t this what you’ve always wanted to see? Second uncle.”</p><br/><p>Tang Xiao somewhat puzzled looked at the second elder.</p><br/><p>The second elder calmly said:</p><br/><p>“That was before, we old fellows hoped to still have an opportunity to do something to release some splendor for the sect. But now it seems we should continue waiting for a time. Old boneheads like us can still stay healthy a while longer. Twenty years have passed, why can’t we wait another few?”</p><br/><p>As he spoke, the second elder’s gaze turned to Tang San, a great many things in his gaze.</p><br/><p>“Because of little San?”</p><br/><p>Tang Xiao puzzled asked.</p><br/><p>The second elder nodded,</p><br/><p>“Sect master, even though your Clear Sky Hammer is already accomplished, after twenty years of waiting, you no longer have the drive you did in those days. What the Clear Sky School needs is a dauntless pathfinder that can lead the sect to break new ground and forge ahead. We’re old, you’re also gradually aging. But this child is different. So young, but already close to the sixtieth rank, neither servile nor overbearing, twin spirits, twin innate domains, carrying several spirit bones. Such a profoundly gifted genius, we can’t neglect him because of shifting the opening of the sect forward. What he needs is experience and nurturing, the sect remaining hidden can cultivate him even more effectively. I don’t want to see what happened to Tang Hao back then again.”</p><br/><p>Tang Xiao went silent. After a long time, he said:</p><br/><p>“Second uncle, could it be you no longer hold any grudges for what happened with Hao back then?”</p><br/><p>The second elder shook his head, saying:</p><br/><p>“No. Still remember my previous three conditions? Those are also tests for this child. If he can accomplish these three things, it will prove he is qualified to be your successor. We old things will also support him, honor does not allow one to glance back. Therefore, I hope sect master can agree to my proposal.”</p><br/><p>At this point, the second elder’s lips buzzed, exchanging a few words with Tang Xiao. Tang Xiao slowly nodded in agreement to the second elder’s proposal.</p><br/><p>Tang San woke up from his meditation faster than the Clear Sky School elders had imagined, opening his eyes after an hour. Of course, he wasn’t completely recovered, but his injuries wouldn’t hinder him, and this was no place to cultivate.</p><br/><p>[1] 3000 = 1500 kg</p><br/><p>[2] Roughly 20 m, and he’s reached a velocity of around 20 m/s</p><br/>\n</div>"}