{"title": "Chapter 158", "id": 158, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-158", "volume_title": "Volume 2", "body": "<h1>Chapter 158</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 158</p><br/><p>Hiding Successfully</p><br/><p>(TL by Bagelson)</p><br/><p>Tang San could see from behind that Hu Liena’s fists were closed tightly, apparently as if restraining herself. She didn’t say anything, only had a quiet expression.</p><br/><p>To the side, Xie Yue always watched him, but making something out from Tang San’s face was harder than scaling to Heaven.</p><br/><p>How could Yan have expected Hu Liena would actually say something like this to him? Feeling wronged, unreconciled, angry, pained, all kinds of emotions constantly dashed in his heart. But confronting Hu Liena, he was still unable to flare up.</p><br/><p>Gazing past Hu Liena, glare firmly fixed on Tang San, snorting angrily, he turned and walked in the direction of the camp.</p><br/><p>“Now can I leave? Miss Hu Liena.”</p><br/><p>Tang San said indifferently.</p><br/><p>Hu Liena turned around. Looking at the first man to move her heart, for some reason, she panicked somewhat.</p><br/><p>Quickly stepping forward, reaching Tang San, Hu Liena apologetically said:</p><br/><p>“I’m sorry, just now Yan was too impetuous. Don’t mind it. Are you in such a hurry to leave? It would be better to stay in our camp. We haven’t met for more than a year either, we can just chat about what we’ve learned with the Deathgod Domain.”</p><br/><p>Tang San waved his hand,</p><br/><p>“No need. Still not being part of your Spirit Hall’s camp everyone will see me as an enemy. When I leave, wouldn’t that be seen as stealing information? I can’t bear that.”</p><br/><p>“You……”</p><br/><p>Hu Liena looked at his thousand miles distant manner, and recalling that vanished grace from before, for a moment someone as intelligent as her was unexpectedly left somewhat speechless.</p><br/><p>“Nana, just now you said that he also has the Deathgod Domain? Won’t you give us an introduction?”</p><br/><p>Xie Yue walked up next to his little sister. He and Yan were different. Once the number one of the Golden Generation, his attitude was a lot steadier than Yan’s. He was even more interested in Tang San. To be able to make his little sister change, this youth wasn’t simple.</p><br/><p>Hu Liena looked at her brother,</p><br/><p>“Tang Yin, this is my big brother. Ge, he’s called Tang Yin. Back when I was in Slaughter City, I walked the final Hell Road with him. Without his assistance, I’m afraid you wouldn’t have seen me again.”</p><br/><p>Xie Yue had already guessed somewhat, and he also wasn’t very surprised when he heard what she said, but his eyes displayed some gratitude,</p><br/><p>“Then I must thank you. You are Nana’s saviour.”</p><br/><p>Tang San shook his head,</p><br/><p>“Don’t mention it, at that time we helped each other. We had the same goal It’s very late, I still need to find a place to rest, I won’t disturb you.”</p><br/><p>In order to capture, one must let loose, Tang San used this to the limit. He was betting, betting that Hu Liena would ask him to stay.</p><br/><p>“You still can’t leave.”</p><br/><p>Just at this moment, a cold voice resounded. Tang San only felt everything flash before his eyes, the next moment, there was already a shadow in front of him. He of course recognized it, it was Ghost Douluo.</p><br/><p>“Grandpa Gui. Why did you come?”</p><br/><p>Hu Liena cried out in surprise. In seniority, Chrysanthemum Douluo and Ghost Douluo were even one generation above Supreme Pontiff Bibi Dong. Therefore the Golden Generation called them ‘grandpa’ in private, and addressed them as ‘elder’ on formal occasions.</p><br/><p>Ghost Douluo’s face still couldn’t be seen clearly, but his voice was very steady, and also very concise,</p><br/><p>“I heard your conversation just now. There’s one thing Yan said that wasn’t wrong. If he alerts our target, leading to all our effort being wasted, even me and Chrysanthemum Guan couldn’t swallow the sin. Nana, you should know how important our target is to Her Holiness this time.”</p><br/><p>A cold light flashed in Tang San’s eyes,</p><br/><p>“Then in other words, you’re demanding I stay?”</p><br/><p>He slowly raised the Clear Sky Hammer in his hand.</p><br/><p>Hearing Ghost Douluo’s words, Hu Liena couldn’t keep her heart from worrying,</p><br/><p>“Grandpa Gui. He wouldn’t. He’s my friend. How about, we advise him to leave the Star Dou Great Forest first?”</p><br/><p>Ghost Douluo smiled calmly, saying:</p><br/><p>“Concern causes confusion, concern causes confusion! Nana, this isn’t like the clever you. Don’t tell me our goal wouldn’t appear on the outskirts of the forest? Any direction he leaves in, there’s a chance he’ll disturb the target. Even if the possibility is only one in ten thousand, we still have to avert it as much as possible.”</p><br/><p>Hu Liena’s charming face reddened, but she still hadn’t caught any intent to kill in Ghost Douluo’s words.</p><br/><p>“That you can’t leave doesn’t mean we must be harmful to you. Youngster, we only want you to temporarily cooperate with us, come with us on the way. Once we’ve succeeded in our purpose, we’ll naturally give you your liberty. Didn’t you come to kill your sixth spirit beast? I can promise to help you choose a most suitable one. Consider it reciprocation, how about it? Our Spirit Hall isn’t a dictatorship. Just a Spirit Master organization.”</p><br/><p>Tang San was amazed as he listened to Ghost Douluo, and even Hu Liena and Xie Yue were somewhat shocked. Ghost Douluo was always known as gloomy and cold, when did he become so well spoken?</p><br/><p>“Fine, I agree.”</p><br/><p>Tang San’s reply equally startled Xie Yue and his sister.</p><br/><p>Hu Liena somewhat shocked asked:</p><br/><p>“You agree?”</p><br/><p>Tang San calmly said:</p><br/><p>“Without the ability to resist, but still able to profit, why wouldn’t I agree? Only, even if I travel together with you, I won’t help you.”</p><br/><p>Ghost Douluo loftily said:</p><br/><p>“Spirit Hall has still never needed help from others. Xie Yue, first take him to find a place in the camp, he stays together with you and Yan. Nana, you stay, I have something to talk to you about.”</p><br/><p>Xie Yue deferentially said:</p><br/><p>“Yes.”</p><br/><p>Afterwards making an inviting gesture to Tang San, he took the lead to walk away.</p><br/><p>Now, Tang San’s always nervous heart finally calmed, the goal of the first stepped had been reached. This was practically the best result he hoped for.</p><br/><p>Looking at the two entering the forest darkness, Ghost Douluo said to Hu Liena:</p><br/><p>“Know why I want him to stay?”</p><br/><p>Hu Liena shook her head,</p><br/><p>“It wouldn’t be because there’s a risk he’ll alert the target anyway. Only Yan would reach a conclusion like that. With Star Dou Great Forest’s size, let alone the possibility of him coming across that spirit beast, even if he did, that spirit beast still wouldn’t be on guard because of him.”</p><br/><p>Ghost Douluo smiled:</p><br/><p>“That’s our clever Sacred Maiden. I had him stay because he might help us settle a large problem.”</p><br/><p>Hu Liena’s heart twitched,</p><br/><p>“You mean, Clear Sky School?”</p><br/><p>Ghost Douluo nodded slowly,</p><br/><p>“That’s right. It seems that he should be very dissatisfied. He said two times that he’s a free person. Perhaps that was an unconscious emphasis, but at least it could prove that his relationship with the Clear Sky School isn’t harmonious, even to the extent that he might have already separated from the Clear Sky School. If it’s like that, then it’s undoubtedly a great benefit to us. If we can learn some of Clear Sky School’s internal circumstances from his mouth, it would be a very great advantage to Her Holiness’ Spirit Hunting Operation follow up.”</p><br/><p>Even though Hu Liena knew intellectually that she should support Ghost Douluo, but when she thought about dealing with Tang Yin’s sect, she couldn’t help feeling somewhat apprehensive,</p><br/><p>“Grandpa Gui, we already roughly know the location of the Clear Sky School by now, we just haven’t moved because we haven’t completely investigated them. Why should we need to involve someone like him? With his age, at most he’s only a third generation disciple, it’s impossible for him to know much about the Clear Sky School’s internal secrets.”</p><br/><p>Gui Mei smiled,</p><br/><p>“Silly girl, concern really causes confusion! The Clear Sky School matter is only one reason to have him stay. The other is for you. It seems you already like that kid. I have to admit that he’s indeed very outstanding, in no way inferior to Xie Yue and Yan. Considered a good match for you. Even more when he possesses the same Deathgod Domain as you. Undoubtedly an outstanding talent.”</p><br/><p>“But, if you want to be together with him, his identity is a major problem. If he can join Spirit Hall, and moreover establish some contributions, obtain promotions, then, Her Holiness should also more easily accept him.”</p><br/><p>“That’s impossible.”</p><br/><p>Even though she blushed a bit, Hu Liena still immediately denied Ghost Douluo’s words,</p><br/><p>“Grandpa Gui, how could I persuade him to go against his own sect? Actually, the Clear Sky School is already in seclusion, must we insist on exterminating them to the last?”</p><br/><p>Gui Mei lowered his voice:</p><br/><p>“Nana, don’t say something like that in front of Her Holiness. Her Holiness’ hatred for the Clear Sky School is extremely deep. If she had to choose only one of three, then of the three upper sects she would definitely exterminate the Clear Sky School. Back then Tang Hao killed the late Pontiff, putting Her Holiness in such pain as to not want to live. Us and the Clear Sky School are as incompatible as fire and water. Furthermore, leaving behind this once number one under Heaven sect, is a bomb that might explode at any time. Thus, the Clear Sky School must be destroyed.”</p><br/><p>Hu Liena still wanted to say something, but was stopped by Ghost Douluo’s raised hand,</p><br/><p>“If you want his best, then convince him to join Spirit Hall. There will inevitably be a way to settle things. At least our Spirit Hunting Operation will always be kept confidential. As for the final decision, that’s not for you and me to make, everything still follows Her Holiness’ will. But, you and him standing together, it really is a very good match. This youngster’s temperament is also quite good. Back then when you left Slaughter City, he still didn’t take advantage of you under such circumstances, remarkable.”</p><br/><p>Hu Liena walked back to the camp with her restless heart. Because she discovered that she didn’t know how she should face Tang San. Spirit Hall’s matters weren’t for her to decide, and no matter how you looked at it, even if Tang San had already broken away from the Clear Sky School, she and him still stood on opposite sides.</p><br/><p>Hu Liena wanted for not the first time erase Tang San’s shadow from her mind, but, it was impossible. The happiness in that split second when they met again just now was greater than everything her heart had felt in this past year.</p><br/><p>Tang San followed Xie Yue into the camp. He had already relied on his spiritual force to scan this place before, his gaze roamed, simply observing the circumstances all around. Right now, besides the patrolling members, the others had already returned to their tents to rest. But that Yan still stood in the opening of a tent.</p><br/><p>Seeing Xie Yan bringing back Tang San, he couldn’t help looking distracted, shooting Xie Yue an inquiring look.</p><br/><p>Xie Yue slightly shook his head at him, bringing Tang San over, he simply explained Ghost Douluo’s words from before.</p><br/><p>“What? He’ll always be together with us until the operation ends?”</p><br/><p>Yan regretted, regretted that he had been so impetuous before. If he had let this Tang Yin fellow leave at that time, that would have been a lot better than having him follow the group now. At least when he left he couldn’t see Hu Liena.</p><br/><p>Xie Yue’s tone grew a bit more serious,</p><br/><p>“This is elder Gui’s orders. Yan, don’t think too much.”</p><br/><p>Yan glared resolutely at Tang San,</p><br/><p>“Kid, mark my words. If you dare get close to Nana, I’ll kill you immediately.”</p><br/><p>Tang San gave a slight smile, his flat tone mostly containing a flavor of provocation,</p><br/><p>“Do you have the skill?”</p><br/><p>“You……”</p><br/><p>Yan’s suppressed fury surged almost instantly, but just as he was about to piece life and death against Tang San, a feminine voice drifted over.</p><br/><p>“It’s late, everyone rest early.”</p><br/><p>Hearing this voice, Yan shivered. He of course knew who the source of the voice was. Enduring the rage, he turned and stepped into the tent.</p><br/><p>Now, Hu Liena and Ghost Douluo returned simultaneously. Hu Liena’s gazed at Tang San, and Tang San also just turned his head and looked at her. The pair’s gazes met in the air. The expression in Hu Liena’s eyes was brimming with apology, but Tang San only gave a slight smile, letting her once again see that perfect grace.</p><br/><p>Entering the tent, Tang San didn’t further provoke Yan sitting in a corner with his eyes closed, and also found a corner to sit cross legged and start to cultivate. Of course, he constantly kept himself alert. Not only towards Yan, but also Xie Yue.</p><br/><p>A night without comment. Early the next day, as Tang San finished cultivating, there was already nobody else in the tent. Xie Yue and Yan had both left one after another not long ago.</p><br/><p>Tang San sorted out his plans and thoughts for a moment, then left the tent.</p><br/><p>“Eat something.”</p><br/><p>A fair little hand stretched in front of him, handing over a chunk of dried meat and one of rations. It was Hu Liena.</p><br/><p>Taking the food, Tang San nodded to Hu Liena.</p><br/><p>Hu Liena lowered her voice:</p><br/><p>“I’m truly sorry about yesterday. I didn’t know it would bring you so much trouble. But grandpa Gui doesn’t have any bad intentions towards you. We’ve basically already found the position of our target this time. Once the mission is completed, you can leave at any time.”</p><br/><p>Tang San said calmly:</p><br/><p>“I believe you want to persuade me to join Spirit Hall.”</p><br/><p>Hu Liena smiled widely, and immediately the surrounding flowers and plants seemed to lose their color,</p><br/><p>“I don’t want to court a rebuff. I won’t say something like that to you.”</p><br/><p>Tang San looked at her,</p><br/><p>“You’re a clever girl.”</p><br/><p>Hu Liena sighed,</p><br/><p>“I’m a person of Spirit Hall, very often I don’t have the freedom to act independently. Given the opportunity, I’ll compensate you after this.”</p><br/><p>Tang San shook his head,</p><br/><p>“Didn’t you say we’re friends? Then don’t talk about compensation. A Title Douluo agreed to help me catch my sixth spirit beast, there’s benefit for me. Only, I’m curious, just what target can have Spirit Hall send so many experts?”</p><br/><p>While he said this, he was already making himself as calm and collected as possible, but there was still some nervousness in his heart. Whether Hu Liena answered his question straight could let Tang San decide his attitude to her.</p><br/><p>Hu Liena raised her head and looked around, then lowered her voice:</p><br/><p>“We’re here to catch a formidable spirit beast. It’s possible we’ll run into trouble. We’ve come this many to ensure our purpose. When the time comes that we meet the target, make sure to pay attention to defend yourself. As for what we want to catch, with your intelligence, you can guess with no need to ask me.”</p><br/><p>Dispatching Title Douluo and so many experts, that would only be a hundred thousand year spirit beast. Hu Liena’s reply made Tang San very satisfied, his face revealing shock, but he also very quickly recovered to normal, the expression in his eyes not revealing any gaps.</p><br/><p>Hu Liena changed the subject,</p><br/><p>“When we parted one year ago, you were very different from now. Even though last night you were still as cold as when we met, your temperament has changed a lot. You seem even steadier, and without that blood reek from before.”</p><br/><p>Tang San smiled:</p><br/><p>“Aren’t you the same? Don’t forget that we both left that place.”</p><br/><p>Hu Liena sighed,</p><br/><p>“In order to eliminate my blood reek aura, my teacher spent a great deal of energy. Having passed through rehabilitation on all sides, I could then be considered having recovered my normal appearance. But, I feel you seem to have recovered better than me. I won’t ask about your matters at home, but, if you really don’t have anywhere to go, return to Spirit Hall with me. Teacher will definitely appreciate you.”</p><br/><p>The corner of Tang San’s mouth revealed a cold intent,</p><br/><p>“Let it be. Your Spirit Hall and my Clear Sky School are like fire and water. Agree to shelter a person from Clear Sky School like me?”</p><br/><p>Hu Liena smiled widely,</p><br/><p>“That depends on whether you can move my teacher. We have to be on our way, prepare properly, I’ll walk with you later. We’re about to enter the deepest parts of the Star Dou Great Forest, we might face the attack of formidable spirit beasts at any time.”</p><br/><p>Tang San’s heart twitched,</p><br/><p>“Your target is in the depths of Star Dou Great Forest?”</p><br/><p>Hu Liena nodded,</p><br/><p>“We’ve spent a not short time here, judging by all kinds of signs, the target should be in the heart of the Star Dou Great Forest.”</p><br/><p>The reason why she said so, besides her trust in Tang San, was also because she didn’t have a reason to doubt him. The formidable strength Spirit Hall had dispatched this time, let alone Tang San, even several of him would still be unable to influence them. To her, she was just bringing Tang San on a stroll. She also even more wished to be together with Tang San right now, unconsciously wishing to approach his world.</p><br/><p>In the simple exchange, Tang San had already obtained a great deal of useful information. Xiao Wu was in the heart of Star Dou Great Forest. This was also his estimation.</p><br/><p>A this time, Ghost Douluo’s voice echoed,</p><br/><p>“Start out.”</p><br/><p>In the short time Tang San and Hu Liena were chatting, including the tent he stayed before, the camp had already been completely struck.</p><br/><p>Hu Liena pulled on one of Tang San’s sleeves, then stepped quickly to catch up. Tang San followed at her side, and the ill tempered Yan as well as the expressionless Xie Yue also caught up. The two Title Douluo were still one in front and one behind, only now the three people in the center of the formation had changed to four.</p><br/><p>Yan walked behind Tang San. His overbearing gaze gave Tang San a feeling of bramble and thorns on his back, but he still didn’t mind excessively, this Yan still wasn’t enough to threaten him.</p><br/><p>Passing one night of contemplation, right now Yan had already recovered his clarity. He knew he was unable to move on Tang San in front of Hu Liena, otherwise he would rupture the relationship between him and Hu Liena. Even though there didn’t seem to be anything between Tang San and Hu Liena on the surface, but he was really too familiar with Hu Liena’s expressions, and this was still the first time he had seen Hu Liena use such gentle eyes to look at a man.</p><br/><p>Everyone said women were sensitive, but men were actually equally sensitive. Especially Yan whose heart had always been set on Hu Liena had especially sharp senses. Yan had already thought it over. Danger lurked in every corner of this Star Dou Great Forest, if he couldn’t act directly, couldn’t he still use everything around them?</p><br/><p>Walking forward alongside Hu Liena, as Tang San simultaneously silently observed the advancing troops and everything in the surroundings, he was somewhat shocked to discover that Ghost Douluo and Chrysanthemum Douluo furthest ahead and behind were mutually echoing each other. Walking in this oval formation, it seemed as if the outside world was isolated by the aura of the two Title Douluo.</p><br/><p>Tang San didn’t dare use the Blue Silver Domain. Right now among them, if the domain caused energy fluctuations that came into contact with the similar aura set up by the two Title Douluo, they would immediately be on their guard against him.</p><br/><p>Walking furthest ahead, Ghost Douluo began to accelerate. The entire formation pierced into the forest at the speed of wind and lightning. What Tang San didn’t expect was that even if they met formidable spirit beasts along this journey, these spirit beasts still didn’t launch attacks, only watched the team move past them in the distance.</p><br/><p>Very soon he understood why something like this would happen, it was because of the might and aura of the two Title Douluo. That energy surrounding the team like a solid barrier deterred the spirit beasts in the outside world. How many spirit beasts had the courage to offend two Title Douluo travelling together? Therefore, this Spirit Hall team also saved a lot of time.</p><br/><p>However, along with their unceasing advance, Tang San’s heart began to gradually grow anxious. Because right now he was basically unable to leave behind any notes for Xiao Wu. Even if he did, if Xiao Wu really was in the heart of the forest, she still wouldn’t see them.</p><br/><p>Nobody could have everything go as they wished, after the initial success of joining, Tang San also encountered difficulties.</p><br/><p>“Rest here.”</p><br/><p>Rushing for a full four hours, Ghost Douluo furthest ahead stopped, indicating rest.</p><br/><p>The Spirit Hall experts immediately gathered around, separating a few people responsible for patrol, the others immediately entering a resting state, the entire process without anyone opening their mouth.</p><br/><p>Hu Liena glanced at Tang San, indicating her side, hinting he should come sid. Before Tang San could sit, Xie Yue and Yan had already sat to her left and right.</p><br/><p>Hu Liena’s brows creased slightly, about to flare up, but saw Tang San very naturally walk over and sitting in front of her, closing his eyes, his expression quiet and graceful, clouds mild and wind weak, as if everything around him was unrelated to him.</p><br/><p>Hu Liena discovered that she was less and less able to see through this man.</p><br/><p>When Ghost Douluo announced the rest, Tang San had already discovered that the surrounding barrier had disappeared. As they penetrated deep into Star Dou Great Forest, he had seen a lot of extremely formidable spirit beasts, and naturally understood that the heart of the forest was growing closer and closer, and this moment right now was a rare opportunity. His heart had long since flown to Xiao Wu’s side, and he didn’t have a mind to care about Yan’s provocations.</p><br/><p>The Blue Silver Domain quietly emitted from his body. Tang San did it extremely furtively, relying on his surpassing spiritual force and the screen of the surrounding blue silver grass, his mind combining with the blue silver grass and quickly spreading outwards.</p><br/><p>This time he wasn’t trying to see anything clearly, his mind stretching as far as possible in one direction, sensing every aura he could detect in the surroundings.</p><br/><p>If someone observed carefully right now, they would discover that the blue silver grass on the ground was softly swaying rhythmically, all kinds of information gathering like snowflakes in Tang San’s mind. Even though each piece of information was fuzzy, relying on these, his mental capacity worked to the limit, quickly searching for the thing he wanted to find.</p><br/><p>A formidable aura appeared within the scanning range of the Blue Silver Domain. That was clearly one formidable spirit beast after another in the middle of Star Dou Great Forest. Having reached their current location, there were no spirit beasts under thirty thousand years in cultivation. It was also just because of this that the two Title Douluo had no choice but to focus their minds, carefully sensing the surrounding changes. If it was in the outskirts of the forest, they still wouldn’t rest even after rushing for eight hours. But here they had to maintain their peak condition.</p><br/><p>One formidable aura after another flitted through Tang San’s mind. Even though the auras of these ten thousand year cultivation spirit beasts weren’t weak, they still weren’t what he wanted to find. He searched for the aura belonging to Xiao Wu. A familiar aura not much different from his spirit power.</p><br/><p>His mind spreading, suddenly, when Tang San’s spiritual force was about to reach the limit, two extremely violent auras appeared in the scanning range of his Blue Silver Domain.</p><br/><p>The instant these two auras appeared, Tang San only felt as if his brain was smashed by a heavy hammer, his entire body shuddering violently, eyes opening. Spitting out a mouthful of blood with a retching sound, his expression turned deathly pale, listlessly collapsing on the ground.</p><br/><p>“What’s the matter?”</p><br/><p>Hu liena was the first to reach, quickly catching him just as Tang San was about to hit the ground.</p><br/><p>Previously he was still lively as a dragon and animated as a tiger, why would he suddenly suffer serious injuries in a split second? With great alarm, Hu Liena hurriedly infused her spirit power into Tang San’s body in as gentle a manner as possible.</p><br/><p>But she discovered that the spirit power within Tang San’s body was perfectly abundant, without any consumption. But his breath was extremely weak, like gossamer in Hu Liena’s soft embrace.</p><br/><p>Silhouettes flashing, Ghost Douluo and Chrysanthemum Douluo reached Hu Liena’s side at practically the same time. Xie Yue was also equally shocked, only Yan revealed a somewhat joyous expression at his misfortune.</p><br/><p>Ghost Douluo placed a dark finger on the space between Tang San’s eyebrows. An ice cold stream immediately rushed into Tang San’s brain, making him shiver, his breath then recovering somewhat, but still seemed extremely rough, like a drowning person who just climbed onto the short, greedily gasping for large mouthfuls of air.</p><br/><p>Hu Liena puzzled looked at the two Title Douluo. Even though Ghost Douluo’s appearance couldn’t be seen, Chrysanthemum Douluo to the side had a stupefied expression across his whole face.</p><br/><p>“This kid is quite good! He should have used an ability similar to a spiritual probe to examine the unknown around us. And after his spiritual force was released, even me and Gui Mei actually didn’t discover it.”</p><br/><p>Hu Liena anxiously said:</p><br/><p>“Then why did he become like this?”</p><br/><p>Ghost Douluo lowered his voice:</p><br/><p>“Should be that he ran into some power he was by far unable to resist while scouting with his spiritual force, that moreover sensed his spiritual force, forcefully repelling him, thus injuring him. He will wake up at once, let’s hear what he says.”</p><br/><p>Tang San gradually returned to consciousness, a splitting headache almost making him groan. Since Blue Silver Emperor’s second awakening, this was still the first time he suffered such a great loss, and moreover in the spiritual domain where he was most skilled. In fact, the greatest characteristic of the Blue Silver Domain was stealth, noiselessly permeating matters, but those two suddenly appearing formidable auras had clearly detected his existence and released their spiritual force to counter him, causing backlash.</p><br/><p>Even though he was seriously injured, in that split second of backlash, Tang San’s spiritual force senses were particularly bright. Besides those two terrifyingly powerful auras, there was still one faint aura. Judging by its strength, this aura should be about the same has him.</p><br/><p>Unfortunately, Tang San couldn’t sense it longer, but he could be almost certain that he had found the target he was looking for. Even though he endured tremendous pain right now, he was still enormously relieved. Because those two auras that caused him the spiritual force backlash were really too formidable, on a level that was even above the two Title Douluo next to him.</p><br/><p>The nervousness within his heart gradually settled, Tang San’s awareness gradually recovering. Sensing everything in the outside world, he of course knew what the soft and faintly fragrant pillow against the back of his head was. However, even though Hu Liena’s body could be enticing to him, it would never be able to entice his heart.</p><br/><p>Struggling a moment, with Hu Liena’s assistance, Tang San sat up straight. Right now the light in his eyes was dull, his coarse and heavy breathing making him seem somewhat wretched.</p><br/><p>“Tang Yin, what happened?”</p><br/><p>Hu Liena saw Tang San recovering, and her heart also relaxed.</p><br/><p>Tang San with difficulty looked at the two Title Douluo in front of him, smiling wryly:</p><br/><p>“I originally thought to look over the circumstances in the surroundings, take a look at whether there were any spirit beasts that suited me. But who knew I would also encounter an especially formidable existence. It could unexpectedly capture my spiritual force, and moreover even issue a spiritual collision against me. If I didn’t react fast enough, I would’ve lost my life just now.”</p><br/><p>Chrysanthemum Douluo’s eyes brightened, asking in his particular feminine voice:</p><br/><p>“Especially formidable existence? How powerful? Which direction?”</p><br/><p>Tang San said with certainty:</p><br/><p>“At least Spirit Douluo level. My spiritual force is considered pretty good among Spirit Masters on the same level, to injure me at long distance requires the work of at least a Spirit Douluo. Over there.”</p><br/><p>Speaking, he indicated the direction his Blue Silver Domain probed. He didn’t hide this bit at all.</p><br/><p>Hearing the words Spirit Douluo, Chrysanthemum Douluo couldn’t help frowning,</p><br/><p>“Only Spirit Douluo level? That doesn’t seem like the target we’re looking for. You wouldn’t be mistaken?”</p><br/><p>Tang San was of course lying, speaking of two as one, strong as weak. Hearing what was said he smiled wryly:</p><br/><p>“I don’t know the concrete details either, because at that instant I was already in spiritual force backlash.”</p><br/><p>Even though his mouth said so, in his heart he was still sneering, ‘you really go find it, perhaps you won’t have an easy time.’</p><br/><p>If Tang San really were to describe the power of those two auras, then among the people he knew, there was only the pressure brought to him by his still not yet crippled father. And this was clearly impossible for the two Title Douluo in front of him. Even more importantly, Tang San’s previous spiritual probe was equivalent to warning those two formidable existences, wouldn’t they prepare even a bit?</p><br/><p>Chrysanthemum Douluo and Ghost Douluo looked face to face. Ghost Douluo said:</p><br/><p>“No matter what, we have to go take a look. The target should be nearby. I would prefer to kill by mistake than to let it escape. Let’s go.”</p><br/><p>Twenty Spirit Hall experts shot up. Hu Liena just prepared to help Tang San up by his arm, when Xie Yue to the side had already pulled him up, placing his arm over his shoulder. At the same time he used his expression to stop Yan from doing the same. With Yan’s hostility towards Tang San, Hu Liena absolutely wouldn’t permit him to protect Tang San. Xie Yue was different, he was after all her big brother.</p><br/><p>Xie Yue nodded to Hu Liena, indicating she not worry, but Hu Liena still worriedly followed next to her brother, looking at the deathly pale Tang San with his eyes closed, his whole body weight seemingly hanging off Xie Yue’s shoulders.</p><br/><p>A cold light flashed in Hu Liena’s eyes. She felt an extreme grudge for Tang San’s condition, killing intent already rising in her heart.</p><br/><p>Even Tang San himself hadn’t expected that his intent to snoop around would actually fall into the eyes of Spirit Hall’s people. Whether the two Title Douluo or Xie Yue, they were all a lot less on their guard against him. Of course, Yan’s attitude towards him still wouldn’t change.</p><br/><p>The Spirit Hall group swiftly advanced in the direction Tang San indicated. What Ghost Douluo and Chrysanthemum Douluo didn’t expect was that as they went deeper, the spirit beasts in the surroundings actually grew fewer. Some formidable spirit beasts that had originally followed to spy on them unexpectedly completely disappeared as they continued inside the forest. There was only the calls of some insects and birds, the excessive calm making these two formidable powers increasingly alert. They were both people who had endured winds and waves, they naturally wouldn’t relax because of the peaceful surroundings.</p><br/>\n</div>"}