{"title": "Chapter 168", "id": 168, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-168", "volume_title": "Volume 2", "body": "<h1>Chapter 168</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 168</p><br/><p>Tang Sect, Strength Clan</p><br/><p>(TL by Bagelson)</p><br/><p>Oscar didn’t hide it either, in his heart, Ning Fengzhi was his future father in law.</p><br/><p>“My sixth spirit ability comes from a twenty thousand year Mirror Image Beast, the effect is duplication. As long as I have a drop of blood from a Spirit Master, I can create a clone mirror sausage through my spirit ability. After anyone uses it, they will possess the spirit abilities of the blood donor Spirit Master at seventy percent strength for three minutes. If the user’s spirit power level isn’t equal to the donor’s, then, they can only duplicate the spirit abilities up to that level. In other words, if little San was seventieth rank, and I sixtieth rank, then I could only duplicate the spirit abilities within the first sixty ranks, and not use the seventieth spirit ability, Spirit Avatar. You’re right, I already have a spirit bone, my luck was good, this spirit bone is also from that Mirror Image Beast, the ability is Mirror Doppelgänger, the Doppelgänger will possess eighty percent of my strength when I use it. At the same time, this spirit bone will increase the effect of the clone mirror sausage for me by ten percent, raising the strength of the cloned abilities from seventy to eighty percent.”</p><br/><p>Whether Ning Fengzhi, Gu Rong, or Tang San, Ma Hongjun and Ning Rongrong, everyone listened very earnestly. Hearing Oscar’s explanation, Ning Fengzhi exhaled slowly,</p><br/><p>“Luck will always befall those prepared, this isn’t as simple as a matter of luck. In these five years, you’ve actually invested more than I could imagine. Oscar, now I’ll give you a choice. Little San told me that he’s preparing to establish a sect called Tang Sect. But I don’t want you to enter this sect, but return with me to the Seven Treasure Glazed Tile School. The Seven Treasure Glazed Tile School needs your talent. As long as you return with me, I’ll agree to you and Rongrong.”</p><br/><p>“Dad——”</p><br/><p>Ning Rongrong protested resentfully.</p><br/><p>Ning Fengzhi’s expression immediately turned solemn,</p><br/><p>“Girl, this relates to the prosperity of the sect. Before, Oscar didn’t have the strength to protect you, but since he does now, I’ll cultivate him even better. Have him enter the sect, work for the sect, this will reduce the resistance to the two of you by a lot.”</p><br/><p>Hearing Ning Fengzhi’s words, Oscar couldn’t help looking distracted. He was also an intelligent person. He understood clearly that Ning Fengzhi was having him choose between his feelings for his brother Tang San and for Ning Rongrong.</p><br/><p>Just at this moment, Tang San’s tiny voice echoed by Oscar’s ear,</p><br/><p>“Hurry up and agree with uncle ning, this is your best chance. You’ve been out learning from experience for five years, what was all these years of effort for? Even if you’re at the Seven Treasure Glazed Tile School, we’ll still be brothers.”</p><br/><p>Oscar looked in Tang San’s direction, saw the meaningful look Tang San gave him. He knew that Tang San had just now compressed his voice to a string to remind him, the reason he didn’t speak openly, was because he hoped he could easier obtain Ning Fengzhi’s approval.</p><br/><p>Turning his head, his gaze fell on Ning Rongrong’s face. Ning Rongrong’s expression was clearly somewhat complex, also somewhat perplexed. She of course hoped to be together with Oscar, but she also didn’t want the feelings between the two of them to affect the relationship of the Shrek Seven Devils.</p><br/><p>Oscar’s gaze finally returned to Ning Fengzhi, gently shaking his head,</p><br/><p>“I’m sorry, sect master Ning, I can’t agree to your request.”</p><br/><p>“Little Ao——”</p><br/><p>Tang San anxiously called out.</p><br/><p>Oscar raised his hand at Tang San, blocking him from speaking further, saying to Ning Fengzhi:</p><br/><p>“Uncle ning, I love Rongrong, I want to love her with my all. But, Tang San is my brother. Even if he’s a heaven warping genius, I admit I’m not his equal, right now is when he needs my assistance the most, when he needs brothers the most. Whether for vengeance against Spirit Hall, or to resurrect Xiao Wu, none are easy matters. If I chose to leave him for Rongrong now, I’m afraid I couldn’t forgive myself in all my life. But at the same time I don’t want to give up on Rongrong, I will definitely use my own way to move you, there will definitely be a day when you agree to let me and Rongrong be together.”</p><br/><p>Ning Fengzhi watched Oscar with a strict gaze. Oscar’s calmly returned his gaze. Having said his peace, his heart was entirely free from worry. Brothers and lovers were equally important, he absolutely wouldn’t give up on any one of them.</p><br/><p>Gradually, Ning Fengzhi’s gaze softened, smiling faintly,</p><br/><p>“Oscar, even though your answer is very cunning, I have no choice but to admit that this is the most perfect answer I could hope for. A man who gave up his comrades for women, wouldn’t be worthy of trust. You’ve already moved me. Properly help little San. I hope to see the glory of you Shrek Seven Devils again.”</p><br/><p>Oscar looked dumbstruck at Ning Fengzhi, then understood. What he said just now was only a test for him.</p><br/><p>“Sect master Ning, then you agree to me and Rongrong?”</p><br/><p>Ning Fengzhi’s brows wrinkled slightly,</p><br/><p>“You’re still calling me sect master Ning?”</p><br/><p>It might be from excitement, but Oscar’s response was also a bit quick, blurting out,</p><br/><p>“Father in law.”</p><br/><p>Seeing Oscar’s excited appearance, Ning Fengzhi laughed in spite of himself,</p><br/><p>“That’s also a bit too early. Call me like little San does.”</p><br/><p>Oscar somewhat awkwardly scratched his head, then called him uncle Ning. When he called him father in law, Ning Rongrong had already turned around and run away from embarrassment. She and Oscar had already obtained her father’s approval, there wasn’t anything else to worry about.</p><br/><p>Ning Fengzhi didn’t let Tang San and the others see him off, and directly disappeared from the forest with Gu Rong, Oscar still with a foolishly giggling appearance.</p><br/><p>“Fine, if you smile more your mouth will reach your ears.”</p><br/><p>Ma Hongjun said, not without jealousy.</p><br/><p>Oscar returned to his senses. Five years had passed, and he hadn’t felt so relaxed in a very long time. Grinning, he said:</p><br/><p>“You’re jealous. Ge can finally be together with Rongrong openly. Tonight I’m buying, we’re not coming back before we’re drunk. Oh, right, call dean Flender, Grandmaster, teacher Erlong, teacher Zhao Wuji and the others. I haven’t seen them for five years, I’ve really missed them.”</p><br/><p>At nightfall, Tang San quietly lay on his bed, his face expressing a slight smile.</p><br/><p>He was reluctant to disperse his tipsiness with inner strength. This night, five of the Shrek Seven Devils had met again, and everyone had a lot of wine. Oscar also told a lot of his stories. Since he had returned safely, everyone were extremely excited.</p><br/><p>However, after the excitement, carrying Xiao Wu back to the room, Tang San still couldn’t help being despondent. He wished Oscar and Ning Rongrong all the best, but the more he saw those lovers finding a way to be together, the more he would think of Xiao Wu’s appearance when she sacrificed herself for him.</p><br/><p>Sticking his face to Xiao Wu’s soft fur, smelling her faint fragrance, Tang San’s heart shuddered violently.</p><br/><p>Rabbit form Xiao Wu rubbed against his head. Enjoying the feeling of pressing close to Tang San. This night, extraordinarily didn’t cultivate, in his dreams he only combed the hair of that long scorpion braided young woman.</p><br/><p>The next morning, Tang San left the Shrek Academy. Today he would complete what he put off with Oscar’s return yesterday. Since he’d resolved to do it, he’d grasp time and go get it done.</p><br/><p>Outside of the Shrek Academy, Tang San always walked towards the south part of Heaven Dou City. He didn’t worry about being recognized. After all, even if it was Spirit Hall, there were only a handful of people who had seen his new appearance. Even drawings wouldn’t have passed to Heaven Dou City so quickly.</p><br/><p>South district. Tang San halted in front of a mansion.</p><br/><p>Judging by the exterior, this mansion occupied an enormous area, with thick and solid walls more than four meters high. In fact, even nobles wouldn’t be allowed to raise such tall walls.</p><br/><p>The mansion gate house was even more than six meters tall. Somewhat hilariously, in front of this mansion gate towered two stone statues, and these two stone statues were in the shape of orangutans, just like small versions of the Titan Giant Ape Er Ming.</p><br/><p>In front of the large gate stood two tall and robust men. They were both more than two meters tall, and the black skin tight clothing they wore didn’t hide their sturdy muscles in the least. They stood there just like two door gods[1], valiantly and spiritedly overlooking the pedestrians coming and going on the street.</p><br/><p>Above this mansion gate hung an inscribed board, with only one word, Strength.</p><br/><p>This was also the first time Tang San came here. Stepping forward with large strides, he stopped in front of the mansion gate.</p><br/><p>“I’ll trouble the two of you to inform senior Tai Tan, that an old friend is visiting.”</p><br/><p>The two big men looked expressionlessly at Tang San, sizing him up a few times, one of them spoke in a deep voice:</p><br/><p>“Wait a moment.”</p><br/><p>Finished speaking, he turned around and entered the gate.</p><br/><p>When he pushed open the gate, Tang San saw that the gate was at least two chi thick, extremely massive. He couldn’t help being secretly speechless. Truly worthy of being the Strength Clan, without enough strength, perhaps even opening the gate would be impossible.</p><br/><p>Right, the place Tang San had found was just the Strength Clan with the Great Strength Orangutan spirit. Once one of the four great subsidiary clans of the Clear Sky School, also the clan directly subordinate to Tang Hao back then.</p><br/><p>Before the start of the Continental Advanced Spirit Master Academy Elite Tournament, the Great Strength God Tai Tan had once invited Tang San to visit the Strength Clan, but at that time Tang San was busy cultivating, and never had time to visit. He was preparing to establish the Tang Sect, he had to possess power of his own. The Strength Clan was undoubtedly one of the choices best deserving of his trust.</p><br/><p>The Strength Clan clansmen had simple characters, best at using force, if used appropriately, they would inevitably be an enormous help. In the plans Tang San had drawn up for himself, at present he first had to do two things. One was to obtain the support of the Strength Clan, the other, was to find a place to establish his Tang Sect.</p><br/><p>Even though the Shrek Academy’s area wasn’t small, that was after all the Academy, and there were moreover numerous informers for the Heaven Dou imperial family. Tang San couldn’t occupy the Academy to develop his Tang Sect. Therefore, he had to find a place that suited developing the Tang Sect.</p><br/><p>In these past years, Tang San had also put aside some savings, and for the moment he wouldn’t face any economic crisis. Moreover, yesterday he had also obtained the Seven Treasure Glazed Tile School master Ning Fengzi’s support. Even though the Seven Treasure Glazed Tile School grounds were destroyed, because they repelled the enemies at that time, the wealth they had stored for many years wasn’t shaken, and with their backing, Tang San didn’t have any concern about resources.</p><br/><p>In a moment, the Strength Clan mansion door once again swung open, a middle aged man walking out from inside.</p><br/><p>The greatest characteristic of the Strength Clan was a large build, and this middle aged man was no exception. Tang San hadn’t seen him before. When this person came out and saw Tang San, his expression immediately revealed some doubt.</p><br/><p>“Little fellow, for what are you looking for our clan chief?”</p><br/><p>Tang San had long ago anticipated this. Seeing the clan’s chief of course wouldn’t be so easy, and he had naturally prepared. Flipping his left hand, black light gathered. The Clear Sky Hammer appeared in his grasp out of nowhere.</p><br/><p>This time, Tang San didn’t suppress the aura of the Clear Sky Hammer in the slightest. Immediately, an overbearing energy filled the air, massive energy fluctuations under his control filling the area within several meters of the door.</p><br/><p>“Does uncle recognize my spirit?”</p><br/><p>“Clear Sky Hammer?”</p><br/><p>The middle aged man was gobsmacked. Even though Tang San’s Clear Sky Hammer didn’t reveal any spirit rings, that was still the Clear Sky hammer! The expression on his face immediately turned nervous,</p><br/><p>“Little brother. Please enter.”</p><br/><p>Even though they had separated from the Clear Sky School due to Tang Hao’s matters, the Strength Clan was after all once a vassal of the Clear Sky School. On seeing the Clear Sky Hammer, this middle aged man didn’t dare be neglectful, hastily inviting Tang San inside.</p><br/><p>“Little brother, did you come from the Clear Sky School?”</p><br/><p>While the middle aged man drew Tang San inside, he probingly asked.</p><br/><p>“Tang San said:</p><br/><p>“More or less. Is senior Tai Tan in the clan?”</p><br/><p>The middle aged man hastily said:</p><br/><p>“The chief is here. I’ll trouble you to wait in the business hall. I’ll ask the clan chief to come over.”</p><br/><p>Entering the mansion, Tang San immediately had a feeling of a wide panorama opening up. This mansion was even bigger than he imagined. Even though it wasn’t as vast as the Shrek Academy with a forest in the city, it was still at least half the size of the Shrek Academy. It gave people a feeling of a vast atmosphere. All areas seemed lofty and straightforward.</p><br/><p>Tang San sat down in the business hall, waiting quietly. He hadn’t left Xiao Wu at the Academy, but rather carried her along in the Wishful Hundred Treasure Purse. He came early in the morning, and rabbit form Xiao Wu was still asleep.</p><br/><p>Before he had waited long, Tang San’s keen spiritual force already caught the sound of urgent footsteps hurrying over. That middle aged man brought three people inside.</p><br/><p>Seeing these three, Tang San couldn’t help being cheerful. The Strength Clan’s main line grandfather to grandson were all present. Spirit hale and hearty Great Strength God Tai Tan, also his son Tai Nuo and Tang San’s classmate Tai Long, all followed the middle aged man into the official business hall.</p><br/><p>Entering the door, Tai Tan’s trio’s gazes immediately focused on Tang San. Tai Tan immediately asked the middle aged man next to him:</p><br/><p>“Tai Xing. This is the person you said was from the sect?”</p><br/><p>Tai Xing hurriedly nodded, saying:</p><br/><p>“Chief, just now this little brother already showed his Clear Sky Hammer, even though there were no spirit rings, the Clear Sky Hammer’s aura can’t be faked.”</p><br/><p>Tai Tan’s trio naturally didn’t recognize Tang San either, sizing him up and down a few times, Tai Tan said in a deep voice:</p><br/><p>“Wasn’t the sect sealed long ago? Kid, where did you come from?”</p><br/><p>Tang San smiled slightly, saying:</p><br/><p>“Senior Tai Tan, you’re still so healthy. I’m Tang San.”</p><br/><p>He didn’t plan to tangle much on the topic of identity. Both hands simultaneously rising, Blue Silver Emperor and the Clear Sky Hammer separately appearing in his palms.</p><br/><p>“You’re Tang San?”</p><br/><p>Seeing the two simultaneously appearing spirits, the trio were all in a daze.</p><br/><p>Tang San smiled wryly:</p><br/><p>“Changing appearance really is no good. So many old friends don’t recognize me. But spirits can’t be faked. How many people on the Continent with twin spirits, let alone when the twin spirits include the Clear Sky Hammer. To make a long story short, because my Blue Silver Grass awakened a second time, it led to my appearance changing. Senior Tai Tan, senior Tai Nuo, Tai Long, long time no see.”</p><br/><p>What Tang San said was true, other things might be faked, but not twin spirits. Tai Tan immediately grew excited,</p><br/><p>“Young master, it’s actually really you. You’ve really changed a lot, I didn’t recognize you.”</p><br/><p>Tai Long rubbed his eyes, staring at Tang San,</p><br/><p>“Young master, it’s really you?”</p><br/><p>Tang San smiled:</p><br/><p>“If you wish, you can still follow me in the future.”</p><br/><p>Tai Tan stepped in front of Tang San with large strides, impatiently saying:</p><br/><p>“Young master, last time I heard Tai Long say after the end of the Continental Advanced Spirit Master Academy Elite Tournament, that the master brought you away. Master? Is he still well?”</p><br/><p>Mentioning his father, the expression in Tang San’s eyes couldn’t help dulling somewhat,</p><br/><p>“Father has already decided to retire.”</p><br/><p>“Retire? Master is still in the prime of his life, why would he retire? I heard this kid Tai Long talk about the master showing his power before the Supreme Pontiff Palace, unfortunately I wasn’t there to see it. Don’t tell me, was it Spirit Hall forcing master to hide? Or the sect?”</p><br/><p>Tang San shook his head, saying:</p><br/><p>“Neither, it’s father’s own decision.”</p><br/><p>Immediately, he simply explained the five years of training his father had put him through, as well as his father making good towards the sect.</p><br/><p>When Tai Tan heard Tang San say Tang Hao had crippled two of his own limbs to return the spirit bones, he couldn’t hold back his old tears, extremely moved.</p><br/><p>“Master, oh, master, why would there be a need for this? So what even if they weren’t returned? The one at fault back then wasn’t you, if someone is to blame, it’s only that Spirit Hall! For so many years, this old servant has always waited for you to return, but you stil……”</p><br/><p>Tang San could very clearly comprehend the mood of this old man,</p><br/><p>“Senior Tai Tan. Don’t feel sad. To father, perhaps this is also a kind of relief. Right now he’s guarding at mother’s side. He’s no longer disturbed by the outside world, he can live in peace, it’s all well. Coming to find you this time is because I have something to consult with you.”</p><br/><p>Tai Tan with difficulty restrained his emotions,</p><br/><p>“Young master speak if something is on your mind, as long as this old man can do it, I won’t decline.”</p><br/><p>Tai Tan could be said to have watched Tang Hao grow up. When Tang Hao became an adult, he had lead the Strength Clan to vow loyalty to Tang hao. Now Tang Hao had gone into seclusion, but Tang San was still here. From Tang San in front of him, he saw something of Tang Hao’s shadow from those days.</p><br/><p>Tang San sternly said:</p><br/><p>“I’m preparing to establish a sect, called the Tang Sect. I hope I could obtain the backing of you and the Strength Clan.”</p><br/><p>hearing this, Tai Tan couldn’t help staring blankly a moment,</p><br/><p>“Young master, you want to establish a sect? Then the Clear Sky School, is it completely……”</p><br/><p>“No.”</p><br/><p>Tang San of course knew the meaning in Tai Tan’s words,</p><br/><p>“I’ve already returned to the Clear Sky School, I’ve also formally recognized my ancestors and clan. I’ve agreed to three things with the sect elders, as long as they are completed, the sect hopes to open again. At the same time, they will also allow me and my father to pay our respects to grandfather.”</p><br/><p>Hearing this, Tai Tan immediately grew excited,</p><br/><p>“Young master, you’re saying, those stubborn irresolute old men allowed you to return to the sect? The Clear Sky School will break the seal?”</p><br/><p>Tang San nodded slightly,</p><br/><p>“The elders gave me ten years. Within ten years, as long as I can possess a hundred thousand year spirit ring, spirit power above the eightieth rank, as well as personally kill a Spirit Hall Title Douluo, they will break the sect’s seal, again have the Clear Sky School face the world.”</p><br/><p>Furious light flashed in Tai Tan’s eyes,</p><br/><p>“I knew those old bastards wouldn’t speak so softly. Are these conditions something humans can accomplish? If we hadn’t already separated from the sect, this old man would definitely return for a chat.”</p><br/><p>Coughing sounds came from behind him, and Tai Tan annoyed turned his head. He found the offender was his grandson Tai Long,</p><br/><p>“Little bastard, what are you coughing about?”</p><br/><p>Tai Long lowered his voice:</p><br/><p>“Grandpa, these conditions might be impossible for others, but young master is a heaven warping genius, it might not be impossible for him.”</p><br/><p>Tai Tan stared blankly a moment, then again turned to look at Tang San, then recalled that five years ago Tang San had led the Shrek Seven Devils to defeat outstanding powers, obtaining the Continental Advanced Spirit Master Academy Elite Tournament championship at the age of fifteen.</p><br/><p>“Young master, may I ask, what level is your present spirit power?”</p><br/><p>Tai Tan was always a very straightforward person, when he thought of something he’d say it.</p><br/><p>Tang San didn’t hide it,</p><br/><p>“After my Blue Silver Grass’ second awakening, right now I’m at the sixty sixth rank.”</p><br/><p>“Oh, sixty sixth rank. Still quite fast!”</p><br/><p>Tai Tan muttered, behind him the father and son Tai Nuo and Tai Long were already staring wide eyed.</p><br/><p>“Hold on, wait a minute, young master, what did you say? What level?”</p><br/><p>Even though Tai Tan was aging, his mind was hale and hearty, now that he also reacted, he looked at Tang San with disbelief.</p><br/><p>Tang San repeated:</p><br/><p>“Right now I’m already at the sixty sixth rank spirit power.”</p><br/><p>Tai Tan drew a cold breath,</p><br/><p>“Heavens! Even master, when he was at your age, he absolutely didn’t have your strength! Young master, it seems our branch finally has the chance to rise to power. This is truly excellent.”</p><br/><p>In fact, his grandson Tai Long was already considered talented within the clan, back when he followed Tang San to fight in the Continental Advanced Spirit Master Academy Elite Tournament, he had obtained a large amount of combat experience. In these years his progress had also been very fast, but his spirit power had still only just reached the forty eighth rank, still a certain distance from fifty. But Tang San’s spirit power had already reached a shocking sixty six ranks. Even in Spirit Hall’s Golden Generation, none could compare to him right now.</p><br/><p>“Young master, just now you mentioned establishing a Tang Sect? Since the Clear Sky Sect elders have already allowed you to return, why do you still want to establish your own sect?”</p><br/><p>Tang San said:</p><br/><p>“Ten years time isn’t short, if I only cultivate on my own, in ten years, at most I’ll only be an outstanding Spirit Master. When the Clear Sky School returns again, it will still be a rootless duckweed, how could it contend with the enormously powerful Spirit Hall? Therefore, I plan to establish a foundation once again. Using the Tang Sect to establish the foundation of my own power in these years. Like this, whether the Clear Sky School returns, or we deal with Spirit Hall, at least we have our own strength. Everything will be a lot easier.”</p><br/><p>“So it’s like this, young master really stands tall and sees far. There’s no problem on my end. Since our Strength Clan swore loyalty to master, master’s will has always been our mission. After so many years in hibernation, it should be time to get out and exercise a bit. Whatever requests young master has, speak without reserve. This old man will definitely support it with all my might.”</p><br/><p>Looking at the expression of grand ambition on Tai Tan’s face, Tang San couldn’t help showing a smile. Even though he’d already anticipated he would have some gain on this trip, Tai Tan’s support was even more direct than he had imagined. This Strength Clan was different from the Seven Treasure Glazed Tile School. The Seven Treasure Glazed Tile School’s support for him was largely due to mutual benefit, but Tai Tan’s present declaration was to tell him about the Strength Clan’s unconditional support.</p><br/><p>Tang San smiled slightly, saying:</p><br/><p>“Senior Tai Tan, then I’ll be blunt. From today on, you are the chief elder of my Tang Sect. At present, I have two issues that urgently need settling. First, is choosing a location for our Tang Sect, finding a suitable place to strike a foundation. Everything must be done low key. My present way of thinking is inside Heaven Dou City, this is after all the capital of the Heaven Dou Empire, even if Spirit Hall wants to harm us in the future, if they want to attack inside the city, they still have to first think it over carefully.”</p><br/><p>Tai Tan laughed out loud, saying:</p><br/><p>“What choosing location, I am the young master’s, just my mansion is good, turn around and I’ll have people change the sign, afterwards our Strength Clan’s two hundred lives will belong to young master. If you want to remodel something, I’ll support it with all my strength. In these years, we’ve also put aside some savings.”</p><br/><p>Tang San’s eyes revealed a pleasant surprise. The Strength Clan’s location was in the south of Heaven Dou City, even though the area it covered was large, it still wasn’t conspicuous, and most important, Spirit Hall’s Heaven Dou City temple was in the north of the city, naturally they wouldn’t pay too much attention here. The Strength Clan had run their business in this mansion for many years, the area it covered was extremely wide. As the foundation for the Tang Sect, it was naturally only too suitable.</p><br/><p>“Senior Tai Tan, then for me to refuse would be impolite.”</p><br/><p>Tang San wasn’t polite with Tai Tan. He believed that as long as he could establish the Tang Sect, develop the Tang Sect’s secret lore, he would definitely repay the Strength Clan with interest.</p><br/><p>“Young master, you’re still calling me senior Tai Tan? Call me elder from now, I’m presently a Tang Sect elder. Oh, right, I should also address you as sect master. Haha.”</p><br/><p>Seeing Tang San again, even though Tai Tan was forthright, he really wasn’t as boorish as he seemed on the surface. If Tang San was only a Tang Hao’s son and a junior without experience or skill, he absolutely wouldn’t support him like this. From Tang San’s eyes, he saw the drive of Tang Hao in those days, but even more intense, and still his deep hatred for Spirit Hall. Let alone when Tang San was still such a profoundly gifted genius. Tai Tan believed that backing the young master would be bound to carry the Strength Clan forward. Even if the Clear Sky School returned in the future, their position would still be entirely different from before.</p><br/><p>Hearing Tai Tan’s words, Tang San also smiled, saying:</p><br/><p>“Second, I want a group of blacksmiths, they have to be worthy of trust, moreover blacksmiths with top rate forging skill. The more the better.”</p><br/><p>Hearing Tang San’s second issue, the expression in the eyes of Tai Tan’s trio all turned strange. Tai Tain said with a wry smile:</p><br/><p>“Young master, don’t tell me you don’t know what our Strength Clan does?”</p><br/><p>Tang San was distracted, he really didn’t know what the Strength Clan’s business was, and for a moment he was immediately somewhat embarrassed.</p><br/><p>Tai Tan of course wouldn’t let Tang San stay embarrassed, hurriedly saying:</p><br/><p>“Our Strength Clan relies on ironworking to make our living. Originally, master still learned his craftmanship from me. Of course, we aren’t blacksmiths in the traditional sense, only creating some top quality weapons and ornaments to sell to the nobility. The wealth I spoke of was also saved up like this. Originally, before we separated from the Clear Sky School, one third of the Clear Sky School’s income came from the work of our clan. The reason I chose to vow loyalty to master was that the master was the only one in the Clear Sky School who didn’t look down on forging techniques. As for forging skill, if this old man resigned himself to being number two in the world, then nobody would dare call themselves number one. Even your father also lacks a bit in heat control. Just that he has the Clear Sky Hammer, and his spirit power also surpasses mine, therefore he might be above me in terms of finished goods.”</p><br/><p>Hearing Tai Tan say this, Tang San was immediately dumbfounded, with a feeling of travelling far in a search only to find it easily. The Strength Clan was unexpectedly famous for forging. Excellent blacksmiths was what he needed the most, he didn’t expect to find them so easily.</p><br/><p>“Elder, this is the best news I’ve heard since my return. I’m truly ashamed, I didn’t even know the Strength Clan was a forging clan.”</p><br/><p>Tang San’s excitement showed in his words.</p><br/><p>Tai Tan somewhat puzzled said:</p><br/><p>“Sect master, what do you want outstanding blacksmiths for? Don’t tell me it’s to create protective gear? However, at your level, the effect of external things is already very small. After all, us blacksmiths researching forging techniques have always been the the pettiest and lowest on the Continent.”</p><br/><p>Tang San smiled slightly, saying:</p><br/><p>“Maybe before, but that absolutely won’t be the case in the future. Elder, look at this.”</p><br/><p>While speaking, Tang San drew out his Godly Zhuge Crossbow from his chest, handing it to Tai Tan.</p><br/><p>Tai Tan took the Godly Zhuge Crossbow, and behind him Tai Nuo couldn’t help saying:</p><br/><p>“Young master, I seem to have seen you use this thing. Back then you used it to defeat me.”</p><br/><p>Tang San nodded, saying:</p><br/><p>“This thing is called Godly Zhuge Crossbow, inside it hides forty eight crossbow bolts, it has to be tightened before use, it releases sixteen crossbow bolts each time, its attack power can break the defenses of Spirit Masters under the fortieth rank, it shoots extremely quickly.”</p><br/><p>Tai Tan turned it over and looked it over carefully, muttering:</p><br/><p>“This is made from refined iron, by the texture of this refined iron, it should be forged with the Clear Sky School’s Disorder Splitting Wind Hammer Method, the quality is homogenous, extremely tough, truly quite good.”</p><br/><p>While speaking, his rough fingers suddenly rubbed the Godly Zhuge Crossbow. Suddenly, Tang San sensed a flash in Tai Tan’s eyes, and immediately afterwards, a series of mechanical chafing noises echoed rhythmically. He watched dumbstruck as Tai Tan unexpectedly already disassembled the Godly Zhuge Crossbow, completely turning it into its composite components.</p><br/><p>In fact, making the Godly Zhuge Crossbow wasn’t easy, its artistry was extremely excellent, containing at least three secret latches. If someone vainly tried to disassemble it, the crossbow mechanism would self destruct, the method to making it wouldn’t easily be found by others. But those three secret latches seemed completely useless before Tai Tan, the whole crossbow was disassembled, without causing any damage to the components.</p><br/><p>“Careful elder, the crossbow bolts are poisoned.”</p><br/><p>Tang San warned,</p><br/><p>Tai Tan grinned, waving his hand in front of Tang San. Tang San then discovered that Tai Tan’s palm had completely turned iron gray, with a faint metallic sheen.</p><br/><p>“Our Strength Clan has a kind of special palm technique, called Wrought Iron Hand. After practicing it, using heavy forging hammers, the palm won’t be so easily worn, at the same time it can insulate the majority of poisons.”</p><br/><p>Tang San was stunned, wasn’t this Wrought Iron hand different tunes with equal skill as his own Mysterious Jade Hand? Only, he very quickly discovered the differences between them.</p><br/><p>The Strength Clan’s Wrought Iron Hand was defensive layer on the palm, unlike the all round defense of his Mysterious Jade Hand. From this bit, the Wrought Iron Palm was still one chip inferior. As for the true difference between the two sides, he would still have to study carefully to know.</p><br/><p>“The design of this thing really is intricate, how come I didn’t think to forge a weapon like this?”</p><br/><p>Tai Tan looked at each of the Godly Zhuge Crossbow’s components with a gasp of admiration,</p><br/><p>“In a limited space, installing so many exquisite components, the material is also refined iron, no wonder it can display such power. Young master, are you preparing to mass produce such weapons?”</p><br/><p>Tang San nodded, saying:</p><br/><p>“This is only one of them. Ordinarily, it would be impossible for us to contend with Spirit Hall. But, if the Heaven Dou and Star Luo Empire armies could have a unit armed with things similar to this, or even weapons even more powerful, the advantage of Spirit Masters wouldn’t be so clear. Further adding their sudden nature, it’s bound to make Spirit Hall eat a great loss.”</p><br/><p>[1] Door gods - https://en.wikipedia.org/wiki/Door_god</p><br/>\n</div>"}