{"title": "Chapter 178", "id": 178, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-178", "volume_title": "Volume 2", "body": "<h1>Chapter 178</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178</p><br/><p>Tang San VS Yang Wudi</p><br/><p>(TL by owl404)</p><br/><p>Hearing that Tang San was going to have a bet with Yang Wudi, every faces around turned somewhat weird.</p><br/><p>However, although Tang San’s trick was trite, it was obviously useful, especially to assumptive and headstrong people like Yang Wudi, to whom his trick would make an extraordinary difference.</p><br/><p>Yang Wudi humphed coldly, “Are you qualified to bet with me?”</p><br/><p>Tang San smiled calmly, “Senior, don’t you dare?”</p><br/><p>Yang Wudi said contemptuously, “Bet how many rounds you can persist in my hand?”</p><br/><p>Tang San shaked his head, “No, I want to bet a battle. If I won, I want nothing but a promise of one thing, if I lose, you can do whatever you want.”</p><br/><p>Yang Wudi thought his ears must have some problem because such a boy that looked no more than 20 years old wanted to have a battle with him, a level eighty two Spirit Douluo. That was really an unendurable scorn.</p><br/><p>“Well, well, what a reckless cub. I’m wondering, what gives you the courage. Once you won, let alone one thing, ten things, one hundred things, my old life will be yours.”</p><br/><p>Tang San smiled slightly. His trick worked, and the only thing left was a real battle. Stepping back swiftly for five paces and distancing Yang Wudi, he saluted Yang with a junior etiquette:</p><br/><p>“Junior Tang San, Control System, level sixty six Spirit Emperor, please.”</p><br/><p>Sixty six? A question mark crossed Yang’s mind but he said coldly at once, “Yang Wudi, Power Attack System, level eighty two Spirit Douluo.”</p><br/><p>Spirits, were released simultaneously from their body.</p><br/><p>Although Yang was called old goat, that did not necessarily mean his spirit was goat, but just a joke of four patriarchs many years ago. Now, his spirit appeared, which was a four meter long lance.</p><br/><p>The long lance was thoroughly black, glistening freezing luster. The arm-like width pole was eight chi while the spearhead should be four Chi in length. Two yellow, two purple, four black, eight optimal spirit rings appeared simultaneously on the lance, moving up and down with the long lance and shining, blossomed incredibly gorgeous splendor suddenly.</p><br/><p>Sure, the spirit of Breaking Clan was lance, Soulbreaking Spear.</p><br/><p>With lance in hands, Yang did not attack instantly. As a senior and a Spirit Douluo, he was naturally waiting for Tang San to thoroughly release his spirit.</p><br/><p>Tang San knew this, of course, so he released his spirit calmly.</p><br/><p>With blue gold light glinting, a blue silver grass sprouted from his right hand and then six spirit rings which can totally symbolize his identity emerged, pulsed around his body up and down.</p><br/><p>There had been nobody that would be unsurprised seeing Tang San’s hundred-thousand-year spirit ring, Yang Wudi was naturally not an exception. Seeing that cardinal splendor, his originally disdainful eyes became grave. Although the opponent was just a Spirit Emperor, the red spirit ring presented on his body, which seemed impossible, the contempt in his mind diminished correspondingly.</p><br/><p>“Isn't your spirit Clear Sky Hammer?” Seeing Tang San’s spirit rings, Yang’s voice was obviously not that rigid and superior as before. Facing a strong and outstanding spirit master like Tang San, change of his emotion stemmed from respect.</p><br/><p>Tang San smiled calmly, “Senior will see my Clear Sky Hammer.”</p><br/><p>Saying that, Tang San leaned forward slightly and hunched his back, with a cracking sound, eight sanguineous spider lances appeared.</p><br/><p>Confronting opponent as strong as Yang Wudi, Tang San didn't have full confidence to win in fact. The feature of Breaking Clan was to attack, overwhelmingly attack, destructively attack. Only by sparing no effort might Tang San win this battle. Therefore, Tang San used his eight spider lances at the beginning.</p><br/><p>“This is...” Even Niu Gao and Bai He stared at Tang San, both of them were the first time to see Tang San’s ture strength.</p><br/><p>Tang San didn’t hide, he had already regarded these people as Tang Sect’s staffs in the future. It doesn't make any sense to hide from them, or he wouldn’t casually expose his red spirit ring.</p><br/><p>“This is my external spirit bone, eight spider lances.”</p><br/><p>“External spirit bone” was such a shocking word to them. If say hundred-thousand-year-old spirit rings was accessible to some degree, seeking for hundred-thousand-year-old spirit beasts, external spirit bone was absolutely treasure that can be only found by accident. Without extraordinary luck, accessing an external spirit bone was all but impossible.</p><br/><p>But Tang San found, the moment Yang Wudi gripped his black iron lance, the entire being became different. All the emotional perturbation seemed disappeared thoroughly and all his essence, qi, and soul were infused into the lance. Neither Tang San’s red spirit ring or the eight spider lances would affect his emotion.</p><br/><p>Having found this, Tang San’s face turned extremely serious. One can devote himself with a single mind to the spirit, seeing nothing but only a lance in his sight, such a state spelled much: the battle, was bound to be tough. </p><br/><p>Yang Wudi looked at Tang San stolidly, “Are you ready?” For him, no matter who’s the opponent, his mind would not be affected, only with perpetual faith to win would he achieve a predominant momentum in the battle and use his most powerful “break”. If he want to be invulnerable and invincible, he must hypnotize himself at first.</p><br/><p>“Please.”Tang San snapped deeply, moved his body, with countless blue silver emperors deluged around him.</p><br/><p>The reason why he dare challenge Yang was that he knew Yang’s weakness. All the ability of Breaking Clan was to attack, therefore as a Control System spirit master, relying on his Control Abilities, he would get the upper hand; the key to win this battle was whether he could limit the opponent effectively, whether he could make full use of his Control Abilities and dispel Yang’s momentum.</p><br/><p>“Hei.” Yang snapped abruptly, waved his lance forward, when the spearhead was pointed to Tang San, he had already blended into the lance. The strong momentum risen suddenly could be even more formidable than Tang San’s Slaughter Assault which had evolved from Deathgod Domain. A burst of incomparably sharp force thrusted into Tang San’s chest, and the body moved with his lance, without any unnecessary action, bumped into Tang San.</p><br/><p>Blue silver emperors moved, and Tang San’s first spirit ring shone, blue silver emperor Binding launched. Blue silver emperor swarmed and twisted to Yang’s body.</p><br/><p>Yang Wudi seemed didn’t see those blue silver emperor branches which were shining three colors of blue, red and gold light, didn’t change his action at all. And his eyes were also locked onto Tang San all the time, with an increasingly growing momentum.</p><br/><p>Just in a minute, Tang San had fully recognized Yang Wudi’s monstrousness. Spirit ring shone on his body was also the first one, a burst of explosive force spurted from his body abruptly, shocked those blue silver emperors around away, which even could not accomplish their ability effect. Whereas the momentum of himself had reached the peak in the explosive shock and made Tang San feel clearly that, in the presence of the dread momentum, his body had became even slower, as if he had already been pierced by that formidable long lance in his conscious.</p><br/><p>Pong—</p><br/><p>Yang’s body heavily ran into blue silver emperors that had suddenly risen and become blue silver Prison, shocking force hit blue silver emperors, making a series of teeth-edging sounds. In order to hold him back, Tang San had to use his fourth spirit ability. At the same time, his third spirit ability was released, a huge spider web, covered to Yang Wudi, who was trapped in the silver blue prison.</p><br/><p>However, Tang San still underestimated the word “breaking” of Breaking Clan. Once Yang Wudi thrusted the lance, it was impossible to stop. Even if his body stopped, he still accomplished the attack. Slapping fiercely on the lance tail with his left hand, his body was still trapped in the blue silver prison, nevertheless the long lance accelerated abruptly and continued to run into Tang San’s chest. That unstoppable feeling, made everyone perceive a brumal smell.</p><br/><p>What a ferocious lance.</p><br/><p>Strong force brought horrific long lance, directly jacked up the spiderweb launched later, then pierced it, whose pearhead had already pointed to Tang San’s face.</p><br/><p>At that moment, Tang San’s body had become extremely slow under the covering of that horrific momentum and even could not take a step, let alone a shunning.</p><br/><p>The third spirit ring on the lance shone, bursted with a layer of black light, which was Yang Wudi’s third spirit ability, “explosion”.</p><br/><p>His first spirit ability “shocking” could shock away restrictions that were not strong enough, while “explosion” could escalate the attack power to a more formidable level. Once stabbed the target, the spirit power would yield formidable explosive force, giving the lance stronger destructivity.</p><br/><p>However, Yang Wudi’s attack didn’t go smoothly because Tang San’s body disappeared.</p><br/><p>Hundred-thousand-year spirit bone ability, teleporting,launched.</p><br/><p>At the next moment, Tang San had already appeared behind Yang Wudi, eight spider lances moved at the same time, thrust to Yang’s body in the blue silver prison. Bewitching red light penetrated into gaps upon the blue silver prison. Now, because of the unstoppable momentum before and the long lance hurled, Yang was in an all-out state where his defence was at the most weak point.</p><br/><p>The opportunity Tang San grasped was undoubtedly very well. Whereas the weakness of Breaking Clan was such conspicuous that how couldn’t they find a method to make it up?</p><br/><p>Yang Wudi didn’t even turn around, the Soulbreaking Spear reappeared in his hands, turning over the hands, backstabbed. The black spearhead thrust backward directly.</p><br/><p>Although eight spider lances were long, they were on Tang San’s back, no matter how close the distances were in eight directions, they could not be closer than straight line distance between Tang San and Yang Wudi. If Tang San still wanted to use eight spider lances to thrust him, then, the one that would be trusted, was him. Considering the destructivity attached to Yang Wudi’s Soulbreaking Spear, assuming that situation happened, this battle would be over, while whether Tang San’s eight spider lances would touch him was an unknown.</p><br/><p>Just using two lances, Yang Wudi had make Tang San’s evaluation to him escalate a level, a stab forward, a stab backward, two ferocious lances revealed the horrific desire to attack perfectly. The same horrific smell of attck, Tang San had just felt exclusively on Sword Douluo Chen Xin. But don’t forget, Chen Xin was hailed as the title douluo who had the strongest attack damage.</p><br/><p>Helplessly, Tang San had to change his action, leaned backward abruptly and kicked to the Soulbreaking Spear with right foot, simultaneously, with the action of leaning backward, four of his eight spider lances continued to move forward, thrust to Yang Wudi’s body. For bloodsucking and high poison of eight spider lances, as long as one of them stabbed, Tang San’s purpose would be achieve.</p><br/><p>However, Yang Wudi’s next action made Tang San have to use teleportation again.</p><br/><p>Hacked the lance, following the momentum of backstab, Yang Wudi slapped the pikestaff with his left hand, didn’t turn around, huge spearhead suddenly chopped to Tang San’s chest like a heavy sword. The situation was incredibly similar to the one before, which seemed internecine, but Yang Wudi’s attack would still be faster than Tang San’s. Nevertheless now for Tang San, there existed no chance to dodge and thus the second teleportation was yielded.</p><br/><p>This time Tang San appeared above Yang Wudi. Now, Yang didn’t eliminate blue silver prison around his body yet which hindered him. Tang San appeared above his body, scattering the Deathgod Domain from sky, pressed down with both hands, and eight spider lances thrust again. But this time, they aimed at Yang Wudi’s head. Eight spider lances aimed at the same point, whether attack speed or threatening force, had been much stronger than before.</p><br/><p>However, Yang Wudi’s movement was still simple: turned around, dragged back Soulbreaking Spear, and abruptly kicked his right foot upon the spearhead, then the huge Soulbreaking Spear span suddenly. This time, the fourth spirit ring on the Soulbreaking Spear also shone. The whole Soulbreaking Spear had already been rendered with black color entirely.</p><br/><p>Blue silver prison didn’t make any difference in obstructing Yang, but cut into two pieces by spinning Soulbreaking Spear, while that long lance full of destructivity slashed directly to Tang San’s body.</p><br/><p>What’s different from the situations before, was that Tang San’s movement was a little faster than Yang’s, his eight spider lances could certainly stab Yang first. However, it was just a little faster, in that moment, he couldn’t even use his teleportation. That is, surely he would stab the opponent or even kill him, nevertheless his body would be undoubtedly cut into two pieces by Yang Wudi’s formidable long lance.</p><br/><p>What a nice substitute of defence with attack, Tang San didn’t shun this time, he wanted to have a try and know, how strong was Yang Wudi’s attack at earth.</p><br/><p>Turning half of his body in the air, eight spider lances were thrown fiercely and bumped into Yang Wudi’s spinning Soulbreaking Spear.</p><br/><p>Ding—</p><br/><p>A strident blare made the entire parlour tremble for a while, and Tang San’s deflected body was hit away like a cannonball.</p><br/><p>Eight spider lances weren’t injured, but they even didn’t swing Soulbreaking Spear away. Had not Tang San used the force-borrowing skill, the lance had already been woven on his body.</p><br/><p>“Heh--”, Yang Wudi snapped loudly, with his fifth spirit ring shone, in a minute, a loop of black fire rose around his body, the lance didn’t change, but slashed on the ground. The next moment, his entire body had already soared to the midair and catched up Tang San.</p><br/><p>Hadn’t really touched the Soulbreaking Spear, one could never know how terrible the spirit was.</p><br/><p>Just now in a simple touch, the conjunction of Tang San’s back and eight spider lances had already been numb. Surging blood made his corner of the mouth spill a silk of blood. What was his body like? Should he be injured in the first hit. Although Yang Wudi was a spirit douluo while he was just a spirit emperor, he had a body with four spirit bones that was to an extent far stronger than Yang Wudi’s. But even it was, facing the categorical attack damage, his was still injured.</p><br/><p>Freezingly slaughterous smell of Deathgod Domain had been released, but facing the unstoppable Yang Wudi, Deathgod Domain even could not affect his momentum at all. Blue Silver Domain let injury in Tang San’s body recover well, but still could not hinder Yang Wudi who was approached rapidly.</p><br/><p>Teleportation? No, no more escape. Because Tang San found, every time he shunned Yang Wudi’s attack, the momentum on Yang’s body would increase a little. As a pure attack spirit master originally, if let his momentum continue to upgrade, Tang San would have no opportunity to win. In terms of spirit power, Yang was much higher than him. More consumption would just lead to a more adverse situation.</p><br/><p>So this time Tang San didn’t dodge, his whole body paused in the air, breathed deeply and turned around abruptly, eight spider lances behind his back was lifted. At the same time, the second spirit ability, Parasite, was released.</p><br/><p>Having been covered by blue silver prison, there had already been seeds on Yang’s body, which also paused in the midair while rushing into Tang San. But to Tang San’s shock, blue silver emperors that twisted his body just made him a little slower, black fire around Yang’s body unexpectedly destroyed his blue silver emperors at once. The black fire ramped and melt into the long lance, which got a three Chi spearhead made of fire instantly.</p><br/><p>Turning around in the midair, two iron galls had already been thrown from his hand, which were rightly Cluster Life Taking Soul Chasing Ball, simultaneously, he imbued his body with Qi, put his body down abruptly and landed to the ground.</p><br/><p>With a Pong sound, iron galls collided together, countless needles and poisonous fog ran into Yang Wudi.</p><br/><p>Yang Wudi’s movement was still not fast, but still proficient, Soulbreaking Spear in hands trembled abruptly, swept an arch in midair. Fog survived, but all the needles were wrung into powder immediately.</p><br/><p>Taking advantage of these two attack time, Tang San eventually landed. On his right arm, blue gold light concentrated abruptly, the fifth spirit ring on his body shone. When the gold light ramped to three meters long, it seemed like a bright golden spear.</p><br/><p>He had to bet, unless he had a perfect tactics, he knew, it was impossible for him to defeat Yang. Now wonder Bai He said Yang Wudi was the one in them four who was the strongest. He had been in a state where all could be substituted with attack. Let alone Spirit Douluo, even Title Douluo wouldn’t necessarily get the upper hand with him.</p><br/><p>In this kind of situation, what was needed was not headlong risk, but wisdom.</p><br/><p>Yang Wudi landed too after two blocks, but his attack seemed didn’t stop at all. Stamped his left foot, his body flew up appressed to the ground, the long lance was still pointed forward and assaulted to Tang San directly. While Tang San’s right arm had already been lifted now.</p><br/><p>The concentration of Blue Silver Overlord Spear had already finished, since he had got the sixth spirit ring, using his fifth spirit ring didn’t need too much time. With twinkle in his eyes, spirit power shaped up suddenly.</p><br/><p>Golden light flashed from his arm evanescently, the fifth spirit ability, Blue Silver Overlord Spear, was released.</p><br/><p>Yang Wudi was still simple, stabbed his long lance. Now matter what means the enemy in front of him took, for him, what met him would only be the lance.</p><br/><p>But in this moment, suddenly, the earth shook. Yang Wudi could feel clearly that Tang San’s fourth spirit ring flashed furtively. Then, countless awls made of blue silver emperors surged out from the earth.</p><br/><p>The first, fifth spirit ring on Yang Wudi’s body shone again, black fire with shocking effect appeared simultaneously, blue silver emperors were distrusted as easily as destroyed withered and rotten wood under the formidable attack damage. But Yang Wudi’s body was also retarded in the midair, keeping his long lance stretched forward, in a transient vertigo state of his whole being.</p><br/><p>Blue silver emperor variation of the fourth spirit ability, Blue Silver Thrust Array, was launched.</p><br/><p>Although blue silver thrust array wasn’t likely to bring any injury to Yang Wudi, the vertigo attached to it yielded sufficient effect.</p><br/><p>The moment Yang Wudi was in vertigo, Blue Silver Overlord Spear had already come to his face.</p><br/><p>Lance with lance, the difference was that Tang San was with all his strength while Yang Wudi was in a vertigo state now.</p><br/><p>Two different lances, hit in the midair together.</p><br/><p>Not because Tang San didn’t want to dodge Yang Yang Wudi’s Soulbreaking Spear and attack his body directly, but because there was a formidable force on Yang Wudi’s lance and all the front attack would be drawn to it. Therefore only by colliding with his lance first would he have the opportunity to injure him.</p><br/><p>What kind of effect would be yielded in the colliding with such two extremely powerful strength?</p><br/><p>The answer was to be announced. The black broke through the gold light in the end, but Yang Wudi’s body stopped and swayed back for a step. The destructive power caused by the hit of two huge forces rose to the sky and a huge hole of five meters in diameter appeared in the roof of the parlour. What was uncanny was that there weren’t any sound or dust that could be perceived during the destruction of the roof.</p><br/><p>From the beginning of the battle to now, it was the first time for Yang Wudi to stop, seeing Tang San meters away, there was something added to his eyes.</p><br/><p>Tang San watched him all the time attentively, consumption of two mainly spirit abilities really wasn’t little, he also needed time to restore. Something in Yang Wudi’s eyes was recognized by him, which was excitement, because of the colliding with the Blue Silver Overlord Spear.</p><br/><p>Via the detection of blue silver domain, Tang San could clearly know that, the colliding just now, because Yang Wudi was in vertigo and his Blue Silver Overlord Spear had such a formidable attack that even though Yang Wudi defended it, injured Yang Wudi. The injury was not really severe, but more than his injury before, and was hard to perceive at a glance.</p><br/><p>The black color was rendered, and ramped from Soulbreaking Spear to Yang Wudi’s body, covered a man and a lance immediately with the seventh spirit ring shone its black light.</p><br/><p>Tang San stared at him concretely, the seventh spirit ring finally was to come? For a spirit master over Spirit Sage, only using their seventh spirit ring demonstrates that they have used all their strength. What kind of effect would be yielded when Yang Wudi, the patriarch of the Breaking Clan, used his seventh spirit ring?</p><br/><p>Compared with beast spirits, tool spirits were relatively hard to improve. Therefore, in the late period, the force tool spirits were often more powerful than beast spirit. Avatar of tools was such situation. Powerful as beast avatar was, the effect of intensification were relatively inferior to tools.</p><br/><p>Tang San had tried the tool avatar of Clear Sky Hammer in person, surely he knew how dread the power of tool avatar was. He knew, his Blue Silver Overlord Spear eventually compelled Yang Wudi to use his full strength, the decisive moment was to come.</p><br/><p>Soulbreaking Spear didn’t change in shape largely like Clear Sky Hammer did when releasing tool avatar, it looked the same size as before. But the total Soulbreaking Spear was in a form of black fire entirely, and the body of Yang Wudi became black, the same color as Soulbreaking Spear, there wasn’t black fire on his body though.</p><br/><p>He had combined his body with the lance, when Yang Wudi lifted the Soulbreaking Spear slowly, this was the only feeling of Tang San.</p><br/><p>People who were watching the battle held their breath, and Niu Gao murmured, “Old goat really got angry, he’s going to take apart my house! Old orangutan, Can Tang San hold this?”</p><br/><p>Tai Tan was also concentrated on the battle between them two now, “I don’t know, what’s the real strength of Tang San. I’m afraid only himself know this. Haven’t you see his hundred-thousand-year spirit ability was remained? ”</p><br/><p>Separating his feet evenly, waving his right hand, blue silver emperor was restrained and all of his spirit rings disappeared. Raising his left hand aloft, Clear Sky Hammer appeared in his grasp out of air. The moment to confront Yang Wudi with all his strength, he should choose the second spirit which had no spirit ring.</p><br/><p>Yang Wudi’s pupils shrank slightly, but this couldn’t affect his state now. Grand momentum made space around his body seemed to become black. Restrained spirit rings, he was in a state where he didn’t plan to use spirit abilities at all.</p><br/><p>Suddenly, a bundle of arm-like black fire was gushed from the lance and dashed to Tang San.</p><br/><p>Tang San’s eyes twinkled, with rightly gorgeous purple gold splendor. Two profound godly lights bursted out abruptly, gathered in one point, unexpectedly bombed to black fire released from Yang Wudi’s Soulbreaking Spear frontally.</p><br/><p>In a huge sound, two dread spirit power hit together, and the lights didn’t disappear. Purple gold and black, two colors of light were hitting ,as they were, frontally. But the black fire advanced step by step to Tang San’s direction.</p><br/><p>Tang San’s attempt failed, he originally planned to directly attack Yang’s body despite the gravitation yielded by the opponent’s lance. But the moment Purple God Light exploded, he found it impossible.</p><br/><p>Named as Soulbreaking Spear, unexpectedly had an effect to deter the mind power. Not only can it draw physical attack but also mind attack. Therefore Purple Demon Eyes hit the tool avatar.</p><br/><p>As far as Tang San’s mind power was concerned, it was absolutely not lower than Yang’s. But facing the pure attack spirit as Yang Wudi’s, purple demon eyes failed to withstand. Seeing the purple gold light recoiled back to his body with a palpable speed.</p><br/><p>The last moment came, since, in this moment, Tang San’s purple demon eyes were drawn by Yang Wudi’s attack, in a freezing state of his mind power, it couldn’t be easy at all for him to use teleportation. Additionally, Yang Wudis momentum had reached the peak, how many times could he dodge? Escape all the time he was bound to lose. Moreover, Yang Wudi’s attack was so fast that using a teleportation to surprise attack him was undoubtedly a joke.</p><br/><p>Tai Tan, Niu Gao and Bai He, three patriarchs had already stood up, seeing the Tang San in a absolutely adverse state, their heart were strained. The battle wasn’t that important to them in fact, even if Tang San lose, there would be leeway to turn. Especially for Bai He, who had gave his Crystal Blood Dragon Ginseng to Tang San, thinking that once Tang San fully showed his strength to Yang Wudi, then giving him the Crystal Blood Dragon Ginseng as bait, there still existed some possibility to make Yang Wudi compromise.</p><br/><p>However, how could Bai He know, his treasure, Crystal Blood Dragon Ginseng, was eaten by Xiao Wu just after it was given to Tang San. While Tang San’s plan was totally based on this battle, at least not lose, otherwise, the opportunity to subjugate the Breaking Clan would be very remote.</p><br/><p>Flame in Yang Wudi’s eyes had reached the acme, entirely black long lance, releasing black color, showed the meaning “sharp” of the word “breaking” to the utmost. For the peculiarity of pure attack, he would not care who was the opponent in front of him in the battle at all, the only thought in his mind was to defeat the opponent. But with the inhibition of Purple God Light, Tang San’s mind power was suffering incessant oppression and diminishment, the gap between he and win was only one pace.</p><br/><p>But at this minute, an unexpected situation happened.</p><br/><p>The purple gold light that had been contradicting against the black fire disappeared suddenly without any sign. Yes, disappeared without any sign. No one could have anticipated such situation. Tang San should recalled the attack of Purple God Light.</p><br/><p>All of these happened in a moment, the sudden outburst made Yang Wudi’s Soulbreaking Spear teemed with black fire, bombed into Tang San’s chest, simultaneously, himself was drawn with the Qi and blended into the lance, thrust directly into Tang San’s chest.</p><br/><p>“No--” Tai Tan roared, dashed with a fierce stride, however, at this moment, even the fastest Bai He, could not stop what was going to happened.</p><br/><p>The moment black fire approached his body, or more accurately, the moment Tang San recalled his Purple God Light, his body twisted weirdly, relying on the Slaughter Assualt that evolved from Deathgod Domain, he made a drift of his body by sheer force under Yang Wudi’s lock for half Chi, meanwhile, a layer of strange golden light covered his entire body.</p><br/><p>The second ability of his left arm spirit bone of Jade Rabbit, Paragon Golden Body, was released.</p><br/><p>Black fire bombed into the golden light in front of Tang San’s chest heavily, but in a absolutely invincible state, it didn’t bring any harm to Tang San, then, Yang Wudi’s Soulbreaking Spear thrusted into Tang San’s chest with formidable destructivity. Whereas, due to the defelction made by Tang San, the lance thrusted into Tang San’s right chest but not his heart.</p><br/><p>There were three seconds of Paragon Golden Body, and now, one second passed.</p><br/><p>Tang San’s face was very calm, facing the Soulbreaking Spear with formidable destructivity, he didn’t quail at all, seemed to never see the tool avatar that were trying to penetrate the Paragon Golden Body with powerful attack in front of his chest. At the second second of Paragon Golden Body, the Clear Sky Hammer in his hand had been woven to Yang Wudi’s shoulder.</p><br/><p>Yang Wudi supported the spikestaff fiercely with his both hands, withstanding the smash of Clear Sky Hammer by sheer force. The Clear Sky Hammer rebounded, but the strong weight and attack still smashed Soulbreaking Spear to subside instantly, and eight spider lances in Tang San’s back thrust to Yang Wudi’s body simultaneously, the Clear Sky Hammer rebounded was also woven again at the third second. This time, Tang San infused all of his spirit power into the hammer and smashed, as a gamble.</p><br/><p>This was the only and also the last opportunity for Tang San. Yang Wudi was undoubtedly strong in attack while weak in defense, Tang San used his own body as bait and support his most formidable attack, and then, used his strongest Clear Sky Hammer to bomb the opponent with all his strength.</p><br/>\n</div>"}