{"title": "Chapter 172", "id": 172, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-172", "volume_title": "Volume 2", "body": "<h1>Chapter 172</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 172</p><br/><p>Poised For Battle, Comparing Defense With The Armor Plated Giant Rhinoceros</p><br/><p>(TL by Bagelson)</p><br/><p>Niu Gao’s expression was still very unsightly, glaring at Tai Tan:</p><br/><p>“Old orangutan, if someone else had brought him, I would’ve kicked him out long ago. Have him hurry up and leave, I don’t want to see anyone related to the Clear Sky School. Otherwise, don’t blame me for not sparing your feelings.”</p><br/><p>Tai Tan was also somewhat angry, he regarded Tang San extremely highly, even to the extent that he had entrusted the Strength Clan’s future to him. Shooting to his feet, he said angrily:</p><br/><p>“Then fine, we’ll go together. Our Strength Clan doesn’t need to take part in the gathering this time. Young master, we’re leaving.”</p><br/><p>Finished speaking, he headed towards the exit in big strides.</p><br/><p>Niu Gao hadn’t thought Tai Tan’s reaction would actually be so fierce, and his face immediately changed. He and Tai Tan had been brothers for many years, so he naturally knew this old fellow wasn’t one to make decisions lightly. However, his words were already spoken, and as a clan chief, if he were to take it back now he wouldn’t be left with any face.</p><br/><p>“Senior Tai Tan, wait a moment.”</p><br/><p>Tang San pulled Tai Tan’s arm. If they truly left, perhaps there wouldn’t be any leeway to change the situation. He of course wouldn’t call Tai Tan ‘elder’ in front of outsiders.</p><br/><p>Tai Tan looked at Tang San, and Tang San nodded at him, afterwards turned to face Niu Gao, giving him a deep bow,</p><br/><p>“Senior Niu Gao, I apologize to you for the Clear Sky School and my father causing the four single category clans trouble back then. I know that such an apology can’t mean anything. Following senior Tai Tan this time was in the hopes of finding a way to make it up to the four clans.”</p><br/><p>Niu Gao glared at Tang San,</p><br/><p>“Your Clear Sky School has lifted the seal?”</p><br/><p>Tang San shook his head,</p><br/><p>“I only represent myself and my father. Not the Clear Sky School. The sect is still sealed.”</p><br/><p>Niu Gao snorted coldly,</p><br/><p>“No matter whether the Clear Sky School has lifted the seal or not, there’s not a copper spirit coin of responsibility towards our Defense Clan. We’ve done very well, we have no use for any of your compensation. Nor is it something a kid still smelling of his mother’s milk can repay.”</p><br/><p>Hearing Niu Gao’s words, Tang San instead of getting angry, smiled. He had already heard some margins for redemption in the meaning behind the counterparts words. Of course, this margin wasn’t something Niu Gao had set aside for him, but rather for Tai Tan’s sake.</p><br/><p>Right now, Tai Tan had also turned around, standing next to Tang San.</p><br/><p>Confronted with Niu Gao’s angry glare, Tang San seemed very leisurely. Embracing Xiao Wu, his graceful character not the slightest flustered. In fact, Niu Gao was also a Spirit Douluo level power, and even if he didn’t purposefully release his strength to pressure Tang San, his own aura as well as the aggression saved up over decades as clan chief wasn’t something an ordinary person could endure.</p><br/><p>“Senior Niu Gao, of course I can’t swear that I can do anything for the four clans. You won’t believe empty promises, and even I feel that’s unconvincing. However, I hope you can give me one chance. Let me stay here to participate in the gathering. I don’t want the Defense Clan to regard me as an enemy.”</p><br/><p>Niu Gao suddenly smiled, but his smile was even more frightening than his chill just now. A tyrannical pressure suddenly burst from him, oppressing Tang San just like a raging wave.</p><br/><p>“Give you a chance? Back when the Clear Sky School declared themselves sealed, did they give us four clans any chances? Back when your father fought Spirit Hall, did he think of our interests? Why would I give you a chance? Fuck off, get out of here, otherwise don’t blame an old man for being blunt.”</p><br/><p>An angry light flashed in Tai Tan’s eyes, about to erupt, but was forcefully stopped by Tang San,</p><br/><p>“Senior Tai Tan, let me deal with it on my own.”</p><br/><p>Tang San’s goal was to establish the Tang Sect in another world, to let the Tang Sect grow and develop on this Douluo Continent. If he couldn’t even deal with this, how could he run a sect?</p><br/><p>Confronting the immense pressure released by Niu Gao, Tang San advanced rather than retreat, taking a step forward. A faint white light appeared from his body, but the white light wasn’t extroverted, but rather gathered close around him. When the formidable pressure Niu Gao released fell on him, a bizarre scene appeared. That immense pressure was unexpectedly cut in two by Tang San’s body, slipping past on either side of him, unable to affect him in any way.</p><br/><p>Who was Tang San? As early as when his strength was still low and confronted the three board members of the Heaven Dou Imperial Academy, he had forcefully overcome their pressure, let alone the current him. That white light was undoubtedly the Deathgod Domain inscribed on his Clear Sky Hammer, and the effect that appeared now was the evolved effect of the Deathgod Domain —— Deathgod Assault.</p><br/><p>Just like the group binding after the Blue Silver Domain evolved, Deathgod Assault was also the result of the domain evolving along with Tang San’s strength. The evolved Blue Silver Domain’s ability Blue Silver Ranged Binding was a large scale control ability, superior in large areas. And the Deathgod Domain’s evolved ability Deathgod Assault was completely used on a single target. Right now Tang San had focused the Deathgod Domain within himself, and that Deathgod Assault turned his body into a sharp blade, immediately causing a tyrannical cutting effect on that incorporeal pressure.</p><br/><p>In the Spirit Master world, strength could always be said to solve a great many things. When Niu Gao felt the pressure he released unexpectedly cut apart like that, he also couldn’t help being shocked, his gaze at Tang San immediately changing.</p><br/><p>Somewhat stunned looking at Tang San, Niu Gao said:</p><br/><p>“Worthy of being Tang Hao’s son, you can actually block my pressure. How old are you?”</p><br/><p>Tang San smiled calmly,</p><br/><p>“Almost twenty one.”</p><br/><p>Niu Gao’s expression changed again, clearly amazed by Tang San’s age. His gaze turned towards Tai Long to the side, and discovered that Tai Long was just now looking at him, the expression in his eyes still with something of looking at a good show. Somewhat in a rage from humiliation he said:</p><br/><p>“Fine, if you want to stay it’s possible. Right here, as long as nothing is damaged, if you can persevere against me for the time of one stick of incense, I’ll let you stay to participate in the gathering. I’ll explain it to the two other sides.”</p><br/><p>“Are you serious?”</p><br/><p>The one to speak up wasn’t Tang San, but rather Tai Tan. Right now, his face was already covered with a smile.</p><br/><p>When Niu Gao saw Tai Tan’s smile, he suddenly had a feeling of the hairs all over his body standing up, somewhat resentfully saying to him:</p><br/><p>“I, old Niu, am still a clan chief, don’t tell me I’d speak without thinking?”</p><br/><p>Tai Tan grinned, saying:</p><br/><p>“Good, very good. It seems there’s no need to leave today. We can still finish off this old fellow’s wine tonight.”</p><br/><p>Niu Gao snorted angrily,</p><br/><p>“Old orangutan, are you so confident in this little fellow? My spirit power has advanced in these two years, even if I still can’t compare to you, I’m still at the eighty fourth rank. How old is he? I say it’s one stick of incense.”</p><br/><p>Tai Tan smiled mysteriously, saying:</p><br/><p>“You try it and you’ll know. I guarantee you won’t know if you don’t try. One try will frighten you out of your skin. Old rhino, don’t blame your big brother for not warning you. There’s none in the young generation of the Clear Sky School that can stand next to Tang San, his talent isn’t inferior in any way to his father. He’s a leading figure of the present Clear Sky School third generation. A strong contender for the next Clear Sky School master.”</p><br/><p>Hearing Tai Tan’s words, Niu Gao’s expression immediately grew serious. Other things didn’t matter, but Tai Tan saying he was more talented than Tang Hao, that made his spirit droop. He and Tai Tan were close as brothers, and Tai Tan himself wouldn’t lie to him. Moreover, within Tai Tan’s words, there was unexpectedly still a faintly warning feeling. It seemed to warn him not to keel over.</p><br/><p>Just at this moment, Tang San spoke,</p><br/><p>“Senior Niu Gao, you are the close brother of senior Tai Tan, naturally you’re also my senior. How about this. We’ll make our competition a bit simpler. Neither of us will use spirit abilities, but we can gather spirit force. We’ll each strike the opponent three times. The other side can’t dodge, only block. If, after three strikes, junior can still keep standing here, the senior please let junior stay here to participate in the gathering, how about it?”</p><br/><p>Hearing Tang San say this, let alone Niu Gao being stunned, even Tai Tan widened his eyes in shock. Naturally not because Tang San gave himself an easy way to win, but rather because the conditions he raised were too favorable to Defense Clan chief Niu Gao.</p><br/><p>The Defense Clan, like the Strength Clan, as a single attribute clan, they wholeheartedly spent all their efforts on defense. Their defensive power was tyrannical, something no Spirit Masters on the same level could compare to. Even the famed Elephant Clan School didn’t dare say they surpassed the Defense Clan in defense.</p><br/><p>Without using spirit abilities, not allowed to dodge, enduring three of the opponent’s attacks. This was clearly a method that allowed the Defense Clan’s defensive power to be displayed to its greatest degree. Not to mention level ground, it already let Niu Gao hold an invincible position. And as a Spirit Douluo level power, even if Niu Gao didn’t use spirit abilities, his pure spirit power bombardment was already quite powerful.</p><br/><p>Tai Tan somewhat anxiously gave Tang San a meaningful look, but Tang San didn’t seem to see it. Still attentively watching Niu Gao with a graceful expression, waiting for his reply.</p><br/><p>Niu Gao glared at Tang San, not recovering for a long time as he couldn’t think why Tang San would propose terms so favorable to him. Clearly, this youth in front of him wasn’t planning on leaving, then that could only prove that he had complete confidence in himself.</p><br/><p>“Kid, you’re very brassy?”</p><br/><p>Niu Gao said coldly.</p><br/><p>Tang San shook his head with a smile, saying:</p><br/><p>“I wouldn’t dare. How could junior dare be arrogant in front of two seniors? I just don’t want to harm the friendliness. Senior, please begin.”</p><br/><p>Finished speaking, he returned Xiao Wu from his arms to the Wishful Hundred Treasure Purse.</p><br/><p>Niu Gao walked in front of Tang San with large strides, halting,</p><br/><p>“The method you’ve proposed already leaves me at a very large advantage, how could I go first. Kid, you begin.”</p><br/><p>Tang San wasn’t polite about it,</p><br/><p>“Then fine, senior be careful.”</p><br/><p>As he spoke, he took a very simple step forward, one fist striking at Niu Gao’s chest. His movements were extremely direct, but astonishing Niu Gao was that he unexpectedly didn’t feel a trace of spirit power from Tang San’s punch.</p><br/><p>After a thump sound, Tang San’s fist withdrew. Niu Gao stared blankly since he basically didn’t feel any attack power, and couldn’t help getting angry,</p><br/><p>“Kid, are you playing with me?”</p><br/><p>Tang San shook his head with a smile,</p><br/><p>“I wouldn’t dare. It’s just that honorable senior’s defensive power is number one on the Continent. What need is there for me to make a fool of myself? Junior’s attack won’t affect senior anyway, so it would be better if I put all my effort into defending against senior’s attack. Like this there’s an even greater chance I will stay behind.”</p><br/><p>Tang San’s neither light nor heavy flattery immediately eased Niu Gao’s expression,</p><br/><p>“Then you take my first punch.”</p><br/><p>Niu Gao wouldn’t be polite, if he couldn’t beat down a barely twenty years old junior in three punches, he would absolutely lose face. But he would still give something in return for Tang San’s kind intentions, therefore, this first punch only used thirty percent force.</p><br/><p>Absolutely don’t look down on thirty percent of the strength of a Spirit Douluo. Even if Niu Gao’s strength wasn’t as tyrannical as Tai Tan, as a defense type Spirit Master, his strength absolutely wasn’t weak. Further adding his spirit power, this thirty percent strength attack was still equivalent to a common sixtieth ranked Spirit Master’s full strength attack.</p><br/><p>Tang San really didn’t dodge, nor did he use his spirit, directly accepting this punch on his chest without flinching.</p><br/><p>With a thump, Tang San fell backwards in response.</p><br/><p>Just then Niu Gao secretly thought this youngster really was arrogant, unable to take one of his thirty percent strength punches. Only, he shouldn’t be able to either. At his age, to be able to be a fortieth rank Spirit Master was pretty good. This method he had chosen really was disadvantageous to him.</p><br/><p>However, before the thought had faded from Niu Gao’s mind, his eyes widened once again.</p><br/><p>After Tang San’s upper body leaned back forty five degrees, he swung back up. Immediately afterward, his body swayed violently with his waist as axis, constantly moving up and down just like waves billowing. But he didn’t fall, he didn’t even retreat half a step.</p><br/><p>This scene went on for the space of several breaths, before Tang San’s body stabilized, his face not even red, his breath not hurried, looking towards Niu Gao, he smiled:</p><br/><p>“Many thanks for senior being lenient.”</p><br/><p>“Lenient?”</p><br/><p>Thirty percent strength really was considered being lenient, but Niu Gao still hadn’t expected Tang San to be able to keep standing. The reason he didn’t fully use spirit power to attack was out of fear he’d beat Tang San to death, provoking the Strength Clan and, more importantly, he didn’t want to embarass his old brother Tai Tan.</p><br/><p>However, he absolutely hadn’t expected that, after enduring his thirty percent strength punch, without using spirit power, this youth before him would actually look as if nothing had happened, as if his punch just now hadn’t even hit him.</p><br/><p>Of course Niu Gao’s punch hit the target. However, Tang San ingeniously dispersed the majority of it. Tang San’s swaying really wasn’t completely caused by the opponent’s force, but rather him using his Controlling Crane Catching Dragon skill on himself. Each time he swayed, some of the force of the opponent’s attack at his chest dispersed. In the end, he didn’t actually have to endure any violent attack. His skill in using four liang to push a thousand jin really could be called brilliant. But for the people of this world it was very difficult to understand that he had displayed this consummate skill.</p><br/><p>Tang San spread a smile towards Niu Gao,</p><br/><p>“Senior, junior’s second punch will come. Be careful. This time junior will use strength.”</p><br/><p>While speaking, Tang San punched again.</p><br/><p>Niu Gao basically didn’t plan on blocking, he didn’t believe Tang San’s attack could have any effect on him. In his eyes, Tang San’s fist was even more showy this time, striking light as a feather towards his chest. Right now, all the thoughts in his mind were on how much strength to use for the next punch in order to knock down Tang San, but not cause him too much harm.</p><br/><p>Just when Tang San’s fist was several cun from Niu Gao’s chest, suddenly, a rich white light burst from his body. That wasn’t the release of a spirit, even less a spirit ability, but rather the blessed domain inscribed on his Clear Sky Hammer.</p><br/><p>The white light instantly rushed from all over Tang San’s body to gather on his right hand, the Deathgod Domain’s evolved ability Deathgod Assault condensing on his fist in an instant. Just relying on these few cun of distance, Tang San’s fist abruptly accelerated, bombarding Niu Gao’s chest with speed difficult to discern with the naked eye. Strangely, as this punch struck Niu Gao’s chest, it didn’t make any sound.</p><br/><p>The excessive modesty was only to make the opponent underestimate him. When he returned from the Clear Sky School, Tang San had already understood that this was a world where you had to speak with strength. The one with the strongest fist was the one with the loudest voice. If he didn’t reveal his strength, others would only have a low opinion of him here.</p><br/><p>His not using any force in his first punch was naturally not for the reason he said, but rather to make Niu Gao despise him. But this second punch used his real skill. Deathgod Domain’s evolved ability Deathgod Assault, and further adding the instantly erupting short range power, already used his full strength. If anyone could see it, they would discover that after his right hand was wrapped up in the Deathgod Domain, it had completely turned a jade color. The extroverted force of the Controlling Crane Catching Dragon erupted completely. He had already warned Niu Gao when he punched the second time, as for whether Niu Gao would really listen, that wasn’t his problem.</p><br/><p>Tang San moved very quickly, from the Deathgod Domain condensing to the short range force erupting, only an instant passed. With the single attribute of defense, Niu Gao wasn’t specialized in reaction. Suddenly feeling a chill approaching his chest, Tang San’s fist was already planted in his stomach.</p><br/><p>When Tang San’s fist made contact, Tang San’s face flushed red, but very quickly recovered to normal.</p><br/><p>But Niu Gao’s expression gradually changed from lifeless to groteseque. Suddenly, his face changed greatly, and immediately afterward, step, step, step, retreated three paces. Standing firm, opening his mouth, a white mist flowed out.</p><br/><p>“Good kid.”</p><br/><p>Niu Gao was now both alarmed and furious. He had secretly sneered at that lightning bolt like attack of Tang San’s even when it hit his chest, ‘want to use a method like that? Can you imagine this old man’s defense?’ Without even using his spirit, the durability of Niu Gao’s skin wasn’t any less than a real rhinoceros’.</p><br/><p>However, as the fist reached him, he discovered it wasn’t that simple. First, Tang San’s punch just struck a great acupuncture point on his chest, and moreover the spirit power erupting over the short range completely condensed together. But most dreadful was still that concentrated Deathgod Assault. The instantly erupting killing intent wasn’t something that could be blocked with physical defense.</p><br/><p>Niu Gao only felt a great force reach him, he actually blocked that force, but the chill brought within the force pierced his chest like a steel needle, immediately numbing his whole body. That cold air unexpectedly forced him to gasp for breath, and even his heart seemed agitated to the point of bursting. Fortunately his strength was tyrannical, and his defense powerful beyond powerful, with a heart far stronger than an ordinary person’s. He then straightened with difficulty, opening his mouth to spit out white mist. That was the killing intent produced by Tang San’s Deathgod Domain.</p><br/><p>Watching Niu Gao successively retreat three steps, Tai Tan was also unable to conceal his shock. He was very clear on how powerful Niu Gao’s defense was, he himself might not be able to injure that old man at all in a frontal confrontation even going all out. But he had retreated under Tang San’s one punch. Just how had Tang San done it?</p><br/><p>His heart still cold, a meaning from the depths of his heart made Niu Gao shiver. That ice cold and cruel killing intent had baptised him. Even though the attack power was great, he could still withstand it, but that frightful killing intent made him completely believe in Tai Tan’s previous words. Tang San really was even more outstanding than Tang Hao. He was sure that Tang Hao, at Tang San’s age, didn’t have such strength. But that icy cold overbearing killing intent was exactly the same.</p><br/><p>After Tai Tan’s initial shock, he burst into laughter. Looking at Niu Gao’s shriveled appearance after Tang San’s attack made him indescribably happy. He hadn’t seen his brother so embarrassed in a long time.</p><br/><p>Actually, right now Tang San was also greatly startled. He had already been mentally prepared for Niu Gao’s defense, but as this punch directly bombarded Niu Gao’s chest, he still discovered that Niu Gao’s defensive power wasn’t as simple as he imagined.</p><br/><p>First of all, his fist striking Niu Gao’s chest hadn’t felt the acupuncture point in his attack. Niu Gao’s thick skin and muscles were just as tough as bullhide, and besides being extremely tough, there was also a kind of extraordinary elasticity. Just from this one punch, the rebound force made his wrist ache. Besides the Deathgod Assault, the short range produced spirit power was completely blocked by the skin.</p><br/><p>Even if it was only a single attribute, just how frightening this pure attribute was could only be truly understood through experience.</p><br/><p>Niu Gao glared resolutely at Tai Tan, his face already turned red as pork liver,</p><br/><p>“Good kid, I won’t be polite with the second punch either.”</p><br/><p>Suddenly shouting loudly, the entire hall trembled, left foot taking one step forward, right fist directly striking at Tang San. And his original plan to use fifty percent spirit power had already turned to seventy percent. Niu Gao meant to win with this punch. Being forced to retreat three steps by a youngster several decades his junior, to a grandmaster of defense like him, this was simply an extraordinary humiliation.</p><br/><p>Hong—— A violent blast rose at Tang San’s chest, and Tai Tan’s smiling expression immediately vanished.</p><br/><p>Tang San’s upper body was blown back so he faced upward, his feet also staggering backward. But the instant Niu Gao’s fist struck his body, one blue and one white, two colored lights instantly erupted.</p><br/><p>Niu Gao felt his whole body turn cold, his heart contracting once, the force of this fist immediately weakening somewhat, and the feeling of his fist striking Tang San also startled him. As a grandmaster of defense, he clearly felt Tang San’s body brimming with an elastic feeling, with a peculiar resilience contained within the elasticity. As his fist struck, even though Tang San seemed blown back and swiftly retreating, Niu Gao discovered that, in fact, his power basically didn’t completely affect this youth’s body.</p><br/><p>His body still swaying violently, at the same time, a burst of cracking sounds could be heard from Tang San’s bones, the white light he released vanished, but the blue light held a faint golden red color.</p><br/><p>After directly retreating more than ten steps, Tang San managed to stand firm. But he wasn’t as easy going as before, his complexion seeming somewhat pale, his chest also heaving slightly. However, he still didn’t fall. Under the seventy percent strike of a Spirit Douluo, he could still stand. This already proved a great many things.</p><br/><p>While striking Tang San, Niu Gao regretted it a little. If Tang San really had an accident, there would be a great deal of trouble. Even if he didn’t use spirit abilities, he still had complete faith in his strength and spirit power. However, Tang San still stood after retreating more than ten steps.</p><br/><p>Simply moving his body, that blue and gold light slowly fading, Tang San’s pale face unexpectedly turned healthy again, spreading a smile at Niu Gao,</p><br/><p>“Senior, such powerful spirit power.”</p><br/><p>Niu Gao stupidly looked at him,</p><br/><p>“Kid, isn’t your spirit a cockroach? Even among my Defense Clan’s disciple, there’s none under the age of forty that can block my punch to this degree.”</p><br/><p>Tang San’s smile didn’t change. In terms of defensive strength, how could he be lacking? He knew clearly from experience what kind of painful upgrades his defensive strength had undergone.</p><br/><p>First of all were his six spirit rings, skipping levels to absorb already from his third spirit ring. Enduring the tremendous pain at that time was a feat of heroism. With the circumstances of skipping a level to absorb it, at the same time as his strength rose, the attributes transformed by his spirit rings were far more powerful than those of Spirit Masters of equal level.</p><br/><p>Next, taking the two great Octagonal Mysterious Ice Grass and Infernal Precious Apricot immortal herbs, forging his body in the Ice and Fire Yin Yang Well, further adding the transformation of the Blue Silver Emperor’s second awakening, Xiao Wu’s sacrificed hundred thousand year spirit ring transforming his body, as well as the amplified attributes of those four heavenly blessed spirit bones. All these elements superimposed over each other, producing the terrifying defensive power Tang San now possessed. Among equally leveled Spirit Masters, his defense could absolutely be regarded as the strongest. Perhaps one might say that, of Spirit Masters under the seventieth rank, three wasn’t anyone who could compete with him in defensive power, not even the Defense Clan.</p><br/><p>When he still didn’t possess Xiao Wu’s spirit ring and spirit bone, he could already endure the attacks of Spirit Sages without dying, finally when his right leg broke it was due to him taking the initiative to reduce his defense, deliberately sacrificing himself to save Xiao Wu.</p><br/><p>Tang San shook his head to Niu Gao with a smile,</p><br/><p>“Junior comes from the Clear Sky School. How could I possess a cockroach spirit?”</p><br/><p>When Tai Tan saw Tang San was alright, he also loosed a long breath, laughing out loud:</p><br/><p>“I think like this. Two punches each, if it goes on like this, friendliness will be injured. I don’t want either of you to suffer any injuries. Old rhino, you’re already so old, can’t you calm down a bit? It’s better than being that competitive.”</p><br/><p>Niu Gao snapped:</p><br/><p>“Bullshit. Can he injure me? I admit that this kid really is pretty good, your evaluation of him isn’t any exaggeration. However, with his present strength it’s still impossible for him to injure me.”</p><br/><p>Tai Tan pursed his lips,</p><br/><p>“Impossible? Before his second attack just now, could you imagine he’d push you back three steps? Didn’t you still retreat? How do you know he doesn’t have some unique skill for the third blow? To let you old brat suffer a major loss.”</p><br/><p>Niu Gao grew angrier,</p><br/><p>“No matter what’s said this old man is still a Spirit Douluo, if that happens, there’s no need for me to go out in public any more. Old orangutan, you still underestimate me too much. Fine, Tang San, as long as your third punch can make me retreat further than you just did, not only can you stay, but hereafter my Defense Clan won’t be your enemy any longer, the matters from those days struck.”</p><br/><p>Tang San exulted, he had finally found a way to resolve this hatred. Hastily he said:</p><br/><p>“Then it’s settled.”</p><br/><p>Niu Gao spread his feet, both hands behind his back, proudly saying:</p><br/><p>“Come.”</p><br/><p>To the side, Tai Tan snickered inwardly,</p><br/><p>“Niu Gao, ah, Niu Gao. For so many years, you’re still so easy to rile up. Not as steady as me. Perhaps this time you really will suffer a loss. You’ve separated from the Clear Sky School for too long, you’ve even forgotten about the Clear Sky School’s formidable ability. Tang San could make you retreat three steps just now, then, now he can just have you retreat further than he did.”</p><br/><p>Tang San was an intelligent person, and absolutely wouldn’t let Tai Tan down. Taking a stance five steps away from Niu Gao, he drew a deep breath, spirit power swelling all over his body. Mysterious Heaven Skill accelerating made him seem to immediately flourish with imposing manner.</p><br/><p>Niu Gao was closest to him, and naturally felt it the deepest. The spirit power Tang San released shocked him, that was spirit power over the sixtieth rank! Could it be that this youth in front of him actually already possessed strength exceeding the sixtieth rank? No, that was impossible. Absolutely impossible.</p><br/><p>However, even if he didn’t believe it, the facts were already before his eyes.</p><br/><p>Tang San slowly raised his right arm. This time, he didn’t use Deathgod Domain, his right fist slowly turning a lustrous jade color under the effect of Mysterious Heaven Skill. In order not to injure himself from the countershock of striking the opponent, he was already using Mysterious Jade Hand to the limit.</p><br/><p>“Kid, what are you stalling for? Come.”</p><br/><p>Niu Gao shouted. This time, he wasn’t the slightest bit careless. His face concerned, spirit power covered his whole body, his defensive strength reaching a peak. This was already the most powerful defense he could muster without using his spirit and spirit abilities.</p><br/><p>Tang San moved, toes pointing to the ground, using his calfs to generate force, he suddenly half turned, his right arm swinging out. Only, this punch of his didn’t strike Niu Gao, but rather hit empty air.</p><br/><p>Tang San’s movements were very fast, a second punch immediately following behind the first, the imposing manner instantly superimposing over each other. Amidst the compressed spirit power, white light could already be glimpsed.</p><br/><p>Seeing this second punch, Niu Gao’s expression had changed. In his mind he also finally thought of that name. Yes, this kid came from the Clear Sky SChool, how couldn’t he know this ability? Only, right now he didn’t use the hammer, but rather his hand, how much of its power could he display?</p><br/><p>That’s right, what Tang San was using was the Disorder Splitting Wind Hammer Method. Using his fist as hammer was originally seen very rarely. Since the Clear Sky Hammer was a spirit, it could be used at any time. But even though he lost the amplification of the Clear Sky Hammer when using his fist, the efficacy of the Disorder Splitting Wind Hammer Method didn’t decrease.</p><br/><p>Tang San’s hard training under the waterfall wasn’t in vain. How many years did a person have in their lives? That was at least one percent of his lifetime he had spent completely immersed in uncomplicated hammer method. Using it again now was like driving a cart on a familiar road, without the least delay.</p><br/><p>Tang San quickly rotated with his left foot as axis. Nobody had stated you couldn’t store strength before the attack, just that the method Tang San used to store strength made Niu Gao’s complete confidence start to show cracks.</p><br/><p>The Disorder Splitting Wind Hammer Method was split into several levels, the simplest was nine swings, followed by eighteen swings, thirty six swings, sixty four swings and, most powerful, eighty one swings.</p><br/><p>In a fight against ordinary Spirit Masters, it would be very difficult for this hammer method to show its effect, only when meeting abilities like Feng Xiaotian’s Stormwind Demon Wolf Thirty Six Successive Chops last time could it collide.</p><br/><p>But now he had ample time to store strength. Niu Gao only prayed to himself, hoping Tang San’s Disorder Splitting Wind Hammer Method wasn’t trained higher than the sixty fourth swing level. Even if his defensive power was strong, if he truly faced the superimposed blast of those eighty one swings, he wouldn’t have any certainty either. Let alone when Tang San’s spirit power was so much stronger than he had anticipated.</p><br/><p>Spinning like a top, each of Tang San’s punches blasted out very rhythmically. In the center of his fast rotation, his left foot never left that spot. Making Niu Gao most nervous was that the spirit power Tang San released didn’t give him any pressure, but was rather completely contained within that circle of rotation.</p><br/><p>The white light gradually grew richer, wrapping up Tang San’s swiftly spinning body, making people unable to see his figure. As Spirit Douluo, whether Tai Tan or Niu Gao, both could feel the constantly rising terrifying force within that white ball of light.</p><br/>\n</div>"}