{"title": "Chapter 174", "id": 174, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-174", "volume_title": "Volume 2", "body": "<h1>Chapter 174</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 174</p><br/><p>Defense Clan Enters Tang Sect</p><br/><p>(TL by Bagelson)</p><br/><p>Niu Gao looked unhappily at Tai Tan,</p><br/><p>“Fine, don’t tempt me. I still have to think it over carefully. As for that, even though this thing of yours is attractive, it’s still not that powerful. After all, we rely on defensive power to protect ourselves. However, to the Speed Clan, this thing is quite useful!”</p><br/><p>“Eh?”</p><br/><p>Niu Gao’s words were like a meticulous jab at Tang San. Tang San was intelligent, and immediately understood his meaning. The Speed Clan’s main ability was speed, there was no need to doubt their superiority in speed. But at the same time, because of the single attribute, even if they had speed, they really were rather weak in other areas. With speed, they could dodge instead of block, but what about attacking? Even though speed and force were directly related, the boost to attack power was still limited.</p><br/><p>If the Speed Clan’s speed was matched with the attack power of hidden weapons, it would undoubtedly substantially increase their overall strength. Moreover, among all the four single attribute clans, it was the Speed Clan whose fortunes were worst. Niu Gao’s meaning seemed to be, rather than roping in their Defense Clan, it would be better to make plans for the Speed Clan.</p><br/><p>Just when Tang San was pondering the deep meaning within Niu Gao’s words, a Defense Clan clansman hastily entered from outside, quickly stepping over to Niu Gao, leaning over to whisper a few words by his ear.</p><br/><p>Hearing his words, Niu Gao couldn’t keep his expression fro changing,</p><br/><p>“What did they come to do? Old orangutan, the Elephant Armored School’s people came.”</p><br/><p>Tai Tan frowned,</p><br/><p>“Who?”</p><br/><p>Niu Gao stood, saying:</p><br/><p>“Heavenly Elephant Huyan Zhen came personally. I have to give him some face.”</p><br/><p>Tai Tan said:</p><br/><p>“Then fine. I’ll go with you to take a look.”</p><br/><p>With the two both getting up, the younger generation naturally followed. Tang San wasn’t conceited about his own position, following the two clan chiefs alongside Tai Long and Ma Hongjun.”</p><br/><p>Just at the courtyard, everyone’s gazes were immediately drawn to those five enormous bodies. The leader was past his seventh decade, and at a visual estimate, he was at least two and a half meters tall. He stood there like a mountain of meat. Dark skin, a pair of large eyes like copper bells. His dark skin seemed to have a particular luster. This was the Elephant Armored School master, Heavenly Elephant Huyan Zhen.</p><br/><p>The four people following behind Huyan Zhen also seemed past sixty, their builds only slightly inferior to Huyan Zhen. Each and every one were reserved, and the five people standing there were like five large mountains, their might impressive.</p><br/><p>Huyan Zhen was clearly familiar with Niu Gao from before, and seeing Niu Gao lead everyone out, he immediately laughed loudly, stepping forward to meet them with large strides,</p><br/><p>“Brother Niu, we haven’t met for some time. How is it, have you been well?”</p><br/><p>Niu Gao returned the politeness with a somewhat skin deep smile,</p><br/><p>“Thanks to luck, my body is still healthy. I don’t know for what errand the noble Heavenly Elephant graces us with his presence?”</p><br/><p>Huyan Zhen laughed loudly, saying:</p><br/><p>“Brother Niu, this definitely isn’t right, don’t tell me you won’t invite a brother to sit and chat? Oh, this old brother’s stature is so robust, I don’t know who he is?”</p><br/><p>His gaze fell on Tai Tan.</p><br/><p>Niu Gao said calmly:</p><br/><p>“This is my big brother Tai Tan. We’ll go speak in the drawing room.”</p><br/><p>Huyan Zhen’s eyes displayed a trace of astonishment,</p><br/><p>“So it’s the Strength Clan’s boss, old brother Tai Tan. Just in time, this saves me another trip to Heaven Dou City.”</p><br/><p>Tang San coolly watched from the side, inwardly he had some speculations as to the reasons for Huyan Zhen’s visit.</p><br/><p>Entering the drawing room, everyone separately sat as hosts and guests. Tang San very naturally stood behind Tai Tan, without sitting down. In front of the Elephant Armored School, he still didn’t want to reveal his identity. Consequently, only the two clan chiefs and that Heavenly Elephant were qualified to sit in the drawing room.</p><br/><p>Niu Gao ordered people to serve tea. With difficulty squeezing out a smile, he asked Heavenly Elephant Huyan Zhen:</p><br/><p>“Brother Huyan, say it straight. Everyone are aching to get on with it. You wouldn’t visit the temple without cause!”</p><br/><p>“Fine, let’s get on with it.”</p><br/><p>Huyan Zhen wasn’t particularly polite either. Even though Tai Tan’s appearance ruined his plans to some extent, that still couldn’t block him from reaching his purpose.</p><br/><p>“You old brothers should have heard it. The Blue Lightning Tyrant Dragon Clan was destroyed, the Seven Treasure Glazed Tile School seriously injured. The three upper sects of the seven great sects only exist in name. And the current Spirit Hall Supreme Pontiff has already issued a decree, to hold an assembly to select a new seven great sects in one year.”</p><br/><p>Niu Gao said:</p><br/><p>“How is that related to us? My tiny Defense Clan naturally doesn’t have the strength to go fight over this.”</p><br/><p>Huyan Zhen laughed loudly, saying:</p><br/><p>“Don’t hide it old brother, little brother has some plans for this reselection assembly. What I’m talking about this time, is to seize a position among the three upper sects. That’s the reason for this visit, I hope to obtain big brother’s support! If our Elephant Armored School joined hands with your Defense Clan, in the Spirit Master world, who could contend with us? At least it would be an invincible position. At that time, at Spirit Hall, our position would naturally also rise like the boat with the tide, becoming the overlords of a faction wouldn’t be a problem. As long as brother agrees, the position of Elephant Armored School’s vice school master is yours. Little brother would be on an equal footing with you, how about it?”</p><br/><p>The more he heard Huyan Zhen say, the gloomier Niu Gao’s expression became. What he said might sound grand, but the implication was that he would annex the Defense Clan. This was already offending Niu Gao’s bottom line.</p><br/><p>“Old brother Huyan, don’t tell me you’ve forgotten who originally forced us to become like stray dogs? Almost didn’t leave us with room to stand?”</p><br/><p>Huyan Zhen said:</p><br/><p>“Brother Niu, that’s already so many years in the past, as they say, there are no eternal enemies, only eternal interests. Don’t tell me you can’t clearly see Spirit Hall’s strength? In the present world, who can contend with Spirit Hall? With your strength as well as the Defense Clan’s features, as long as we walk the same road, the Defense Clan’s prospects are boundless! You can raise any conditions, as long as little brother can satisfy them, I definitely won’t decline, and even if I can’t satisfy them, there’s still Spirit Hall.”</p><br/><p>Niu Gao’s temper finally couldn’t be suppressed, fiercely slapping the table, standing up, angrily saying:</p><br/><p>“Huyan Zhen, when did you become such a loyal dog to Spirit Hall? If you want to lick Spirit Hall’s ass, that’s your matter, don’t bring me into it. Our Defense Clan doesn’t have the slightest interest.”</p><br/><p>Niu Gao’s fury first made Huyan Zhen stare blankly, then his face immediately changed. No matter what was said, he was still one of the seven great sect masters, being cursed at by Niu Gao like this, where did he still have any face left? While standing up, forceful light flashed in his eyes,</p><br/><p>“Niu Gao, I called you big brother out of respect, that’s giving you face. Don’t tell me you didn’t see the fall of the Seven Treasure Glazed Tile School and the Blue Lightning Tyrant Dragon Clan? Do you believe your Defense Clan is stronger than them?”</p><br/><p>Niu Gao’s voice was called:</p><br/><p>“Better a broken jade than an intact roof tile. Even if the Clear Sky School let our four single attribute clans down back then, no matter what is said, we still relied on the Clear Sky School to grow. We separated from them, but it’s still impossible to cooperate with Spirit Hall. I, Niu Gao, won’t be the dog of Spirit Hall. If you have the skill, you come destroy us, but don’t mouthfart in front of me.”</p><br/><p>Huyan Zhen’s face fell like water, a pair of big eyes glinting ominously,</p><br/><p>“Saying so, you won’t give me face?”</p><br/><p>Niu Gao snorted coldly, imposing manner flourishing all over his body. Equally Spirit Douluo, even if his strength was inferior to Huyan Zhen, in terms of defense, he was even above Diamond Mammoth Spirit Huyan Zhen, only his attack fell far short.</p><br/><p>Tai Tan also slowly stood up to the side, equally overbearing imposing manner erupting from him. In spirit power, he wasn’t inferior to Huyan Zhen. Just that his spirit’s innate talents were lacking.</p><br/><p>In front of the simultaneous pressure of two great Spirit Douluo, even Huyan Zhen’s imposing body couldn’t help swaying a moment. Those four old men who came with him quickly stood behind him, instantly, heavy imposing manner immediately counterattacked. Those four elders were unexpectedly all Spirit Sage level experts, each with strength surpassing the seventieth rank.</p><br/><p>Niu Gao disdainfully curled his lip,</p><br/><p>“Huyan Zhen. If you want to deal with me, I advise you to first bring along the Elephant Armored School’s army, relying on the few of you, still seems insufficient.”</p><br/><p>Huyan Zhen was inwardly gloomy. Before coming, he by far hadn’t expected Great Strength God Tai Tan to be here, otherwise he and the subordinates he brought would have been enough to suppress the Defense Clan. Even though their imposing manner wasn’t weaker than Niu Gao’s side, this was still the Defense Clan’s territory, and it would be very difficult to get the outcome he desired.</p><br/><p>Malicious light flashing in his eyes, Huyan Zhen coldly said:</p><br/><p>“Fine. Niu Gao, our blue mountains don’t change. As green water flows, I’m sure we’ll meet again. I hope you’ll still be able to speak to me with such confidence when we meet next.”</p><br/><p>Finished speaking, Huyan Zhen turned and brought his four clansmen away.</p><br/><p>Along with the departure of the Elephant Armored School’s five people, Niu Gao and Tai Tan’s chilling demeanors gradually faded. Niu Gao’s face had already turned extremely unsightly. Fiercely swinging a hand, with a loud explosion, the wooden table next to him turned to splinters.</p><br/><p>“I’ve always hidden in such a remote place as Rising Dragon City, but they still won’t let us off. Those Spirit Hall bastards, what are they all up to?”</p><br/><p>Tang San spoke up,</p><br/><p>“It’s deterrence. Every person with eyes knows who was behind what happened to the Seven Treasure Glazed Tile School and the Blue Lightning Tyrant Dragon Clan. But, who can do anything about them? Spirit Hall also paid an enormous price to attack these two great sects, and from their point of view, there actually aren’t that many advantages. But what’s important is the deterring effect. The Clear Sky School is sealed, the other two of the upper three sects destroyed. Spirit Hall’s intention is to tell everyone that there is none who can oppose them. Even if doing so raises the vigilance of the two great empires. However, Spirit Hall’s own strength has also already matured. With so many kingdoms and duchies as their puppets, they wouldn’t even fear an actual war. Under the effect of such deterrence, some small sects that originally intended to keep watch and wait basically don’t have any choice, and can only attach themselves to Spirit Hall to exist. Like this, as long as Spirit Hall’s seven great sects reselection assembly ends smoothly in one year, the seven great sects will all be under their control. Then, the Continent will perhaps really be the world of Spirit Hall in the future.”</p><br/><p>Tang San’s current mood was very calm, clearly analysing the situation,</p><br/><p>“How many are like senior Niu, fearless of force? Very, very few. When the seven great sect struggle ends, Spirit Hall will no longer be low key, they’re bound to stand in front to challenge the two great empires. Even to the extent that they will take the initiative to invade. With the number of powers held by Spirit Hall, if there’s war, the two great empires will inevitably be at a disadvantage.”</p><br/><p>Saying so, Tang San changed the subject,</p><br/><p>“I want to establish the Tang Sect, besides my own selfish motives, is in the hopes of as far as possible stopping such a situation from appearing. Even though there are a lot of high level Spirit Masters in the world, the absolute majority are still low level Spirit Masters. Spirit Hall controls tens of thousands of low level Spirit Masters, so the greatest threat to the two great empires is as a mob. That’s an almost unparallelled army. You’ve seen our Tang Sect’s hidden weapons. If we mass produced them, providing enough to the two imperial governments, at least the two great empires would still have the strength to fight on the true battlefield. Spirit Hall is after all a religious organisation, and the two great empires haven’t existed for just a day or two. Who will win and who will lose is still very difficult to tell. Even though I know senior can’t forget about the Clear Sky School abandoning you back then, you can’t deny the Clear Sky School’s reputation as first under heaven. If there’s a deadlock between Spirit Hall and the two great empires, do you believe the Clear Sky School wouldn’t use such an opportunity?”</p><br/><p>“I can tell you a secret. The Clear Sky School’s twenty year seal hasn’t been wasted. Even if there aren’t a lot of people, they’re all experts. There are more than six powers of the Title Douluo level. You should understand the meaning of Title Douluo with the Clear Sky Hammer spirit. As for who can obtain the final victory with the Continent in chaos, I believe the Clear Sky School’s existence will be an enormous influence. If our plan can succeed, then our Tang Sect’s influence absolutely won’t be less than the Clear Sky School. I can guarantee senior in advance, the Tang Sect will never be incorporated into the Clear Sky School. Tang Sect is Tang Sect. Independent of any Spirit Master groups. We only gather together, produce hidden weapons. A group defending our autonomy. So much that we won’t even be a Spirit Master sect. Senior Niu Gao, junior sincerely invites you to join the Tang Sect. The Tang Sect absolutely won’t restrict the Defense Clan, all the Defense Clan clansmen will still be under your control. If the time comes that you believe the Tang Sect doesn’t suit you, then you can lead the Defense Clan to depart at any time.”</p><br/><p>“I won’t hide it from you, right now only the Strength Clan has joined the Tang Sect, as well as me, Fatty as well as two other comrades. Even if you can’t trust me, don’t tell me you can’t trust senior Tai Tan?”</p><br/><p>Just when Tang San started to speak, his words had drawn Niu Gao’s interest. Thoroughly analysing, using true words as invitation, without many promises, but each of his words sounded very true to Niu Gao’s ears.</p><br/><p>This was all the capability Tang San had learned from his aunt in the Moon Pavilion. That year might have seemed a waste, but in fact, Tang San had learned a lot of principles for dealing with people from there. Tang Yue-Hua always said that strength wasn’t everything in the current world. Wielding existing strength, and further adding the ability to handle people, that was a true power.</p><br/><p>Tai Tan also listened carefully to Tang San’s words, the smile on his face gradually growing stronger. He was of course very familiar with Niu Gao’s character, and Tang San’s choice of timing to speak was just perfect. Even though Niu Gao had shown a strong front to Huyan Zhen, that was only because Hyan Zhen had offended his bottom line. As a clan chief, would he really not care about the survival of the clan? The answer was inevitably negative.</p><br/><p>Niu Gao’s expression was somewhat uncertain, studying Tang San for a long time without speaking. Right now not just they were in the great hall. Ma Hongjun, Tai long, Niu Ben were also here. Niu Ben now understood Tang San’s true purpose in coming here. Hearing him speak, he also simultaneously sank into contemplation, clearly weighing the pros and cons.</p><br/><p>Tai Tan patted Niu Gao’s shoulder,</p><br/><p>“Before coming here, I already had Tai Nuo start buying up some surrounding properties. Preparing to expand the mansion. I remember in those days I still had your help when building the mansion, this time I will perhaps still have to trouble you. Us brothers have always been separated in two different empires these years, I truly cherish the memories of those days when we every day drank wine and ate meat. I’m not urging you to join the Tang Sect because of that, only, old rhino, do you want to make this gamble along with me? If our gamble fails, big brother can absolutely tell you, my Strength Clan will definitely be ruined before your Defense Clan.”</p><br/><p>Niu Gao looked at Tai Tan, their eyes meeting, and he sharply waved his hand,</p><br/><p>“Spirit Hall’s bullying is intolerable, fine, old orangutan, I’ll follow you for this bet. Tang San, remember your words today, no matter what happens in the future, us and the Clear Sky School will never have any relation again. This is our bottom line. As long as what you do is to everyone’s benefit, my Defense Clan will support you unconditionally.”</p><br/><p>Tang San wore a smile, watching Niu Gao with a steadfast gaze, without saying anything, only forcefully nodding to him.</p><br/><p>Tai Tan laughed out loud, spreading both arms to Niu Gao,</p><br/><p>“My good brother, welcome to the Tang Sect.”</p><br/><p>Niu Gao also smiled simultaneously, forcefully hugging Tai Tan,</p><br/><p>“Let’s go, we’ll continue drinking. Just now we let that old brat Huyan Zhen bother us, we can’t let that ruin our mood.”</p><br/><p>Once again seated at the table, the atmosphere had clearly changed. The slight hostility hidden in Niu Gao’s gaze as he looked at Tang San had vanished completely. He was always an optimistic person. Since it was already decided, he wouldn’t regret it.</p><br/><p>The wine made three rounds, and Tai Tan slightly intoxicated said:</p><br/><p>“Old rhino, do you know why I promised young master to establish this Tang Sect with him?”</p><br/><p>“Why?”</p><br/><p>Niu Gao’s capacity for wine was about the same as Tai Tan’s. Tai Tan was somewhat drunk, naturally he wasn’t much better of.</p><br/><p>Tai Tan said:</p><br/><p>“Besides those hidden weapons making my heart beat, even more important is the young master. Young master’s twenty, how can he possess his present accomplishments? Now I can tell you too. Five years ago. Do you know about the Continental Advanced Spirit Master Academy Elite Tournament?”</p><br/><p>Niu Gao said:</p><br/><p>“I seem to have heard of it. Our clan also have some children that followed some academy to participate, their achievement wasn’t up to much.”</p><br/><p>Tai Tan laughed out loud, saying:</p><br/><p>“In this you aren’t my equal. Tai Long, this brat, was a member of the final champion team.”</p><br/><p>“What did you say?”</p><br/><p>Niu Gao was inwardly alarmed, even his tipsy feeling retreating a bit, looking at Tai Tan;</p><br/><p>“This brat was so outstanding?”</p><br/><p>The status of the Continental Advanced Spirit Master Academy Elite Tournament was fairly high in the Spirit Master world. It was the best stage for the young generation of Spirit Masters to reveal themselves. Each academy member that could obtain an outstanding achievement were all targets that great sects tripped over each other to recruit.</p><br/><p>Niu Ben forcefully clapped Tai Long’s shoulder,</p><br/><p>“All right, kid! Uncle didn’t see you were so tremendous. I heard that the Continental Advanced Spirit Master Academy Elite Tournament that time was the most epic in the last several decades. The level of the competing Spirit Masters were all considerably high. Especially Spirit Hall, who sent that trio of youths called the Golden Generation to lead their team. But in the end they were defeated by a dark horse. I didn’t expect you would be a member of that team. let me think, ah, right, it was called something like Shrek Academy, yes?”</p><br/><p>Tai Long somewhat embarrassed said:</p><br/><p>“Uncle Niu Ben, don’t exaggerate. Even if I counted as a member of the team, I was only a substitute. In the last key competition, I didn’t take the field. The reason our team could defeat Spirit Hall’s Golden Generation, is all young master’s contribution. Young master was not only the vice captain, but also the soul of the team. In the final battle, it was he who single handedly blocked the spirit fusion ability of the Golden Generation siblings, creating the conditions for victory. Finally pulling strongly against the tide, making us the champions. At that time young master’s spirit power was forty something ranked, Spirit Hall’s Golden Generation all over fiftieth ranked.”</p><br/><p>Speaking of that battle back then, Tai Long couldn’t help revealing an intense worship in his eyes. He had personally seen the entire fight, and even now he couldn’t forget Tang San’s heroism on the field.</p><br/><p>Ma Hongjun wasn’t as calm as Tang San. Grinning, he said:</p><br/><p>“I was also in the main force! Tai Long, why don’t you praise me.”</p><br/><p>Tai Long laughed out loud, saying:</p><br/><p>“Yes, Fatty was also in the main force. He was also stronger than me. Your spirit is the phoenix.”</p><br/><p>When father and son Niu Gao and Niu Ben heard Tai Long’s words, they couldn’t keep their expressions from changing somewhat. Tai Tan smiled:</p><br/><p>“Now you understand my meaning. Young master’s excellence even makes Spirit Hall jealous. His future prospects are boundless.”</p><br/><p>Niu Gao frowned, saying:</p><br/><p>“The win will definitely break the tallest tree, don’t tell me Spirit Hall wouldn’t have such thoughts?”</p><br/><p>Tai Tan grinned:</p><br/><p>“No need to worry about that. First not speaking about whether Spirit Hall could find young master, along with young master’s strength rising, he had one spirit awaken a second time, leading to huge changes in his appearance and demeanor. People who knew him before don’t recognize him when face to face. Moreover, in Heaven Dou City, even if someone wished young master harm, that still wouldn’t be so easy. Our Tang Sect is established in secret, and also won’t go join the struggles between Spirit Master sects, we’re only secretly building our strength.”</p><br/><p>Niu Gao said:</p><br/><p>“No matter what is said, afterwards we’re also a grasshopper on a string. After this gathering is over, I’ll go eat your food and drink your wine. Humph humph.”</p><br/><p>Tai Tan smiled:</p><br/><p>“As you wish, there’s enough. Anyway, hereafter the Seven Treasure Glazed Tile School will support the Tang Sect financially. With the skill you eat until they’re poor. Their sect is broken, but their wealth hasn’t waned. That is indeed the richest sect under heaven.”</p><br/><p>Niu Gao stared blankly a moment,</p><br/><p>“I feel more and more like this Tang Sect of ours has some prospects. Since it’s like this, it would be better if we also pulled the Speed Clan along. Their days have been very sad. Always receiving our material assistance. Since the finances aren’t a problem, and Tang San can even talk me into it, I think the old whitebird wouldn’t be much of a problem.”</p><br/><p>Tai Tan smiled:</p><br/><p>“That fellow most dislikes other people calling him old bird, be careful about his temper! Only, we can consider how to lure him. The two of us are both in the Tang Sect, with him it’ll be even more lively.”</p><br/><p>The two wicked old men immediately began to excitedly talk in low voices. Tang San could naturally hear what they said, and for a moment he couldn’t help feeling a chill down his back. So when people got old, they wouldn’t be disturbed by sinister thoughts. Of course, their purpose was still benevolent.</p><br/><p>Judging by how it had gone so far, everything was better than anticipated. Only one area made somewhat worried, the Breaking Clan. Judging by how Tai Tan and Niu Gao hadn’t mentioned them at all, clearly that wasn’t an easily convinced clansman. Due to losing more than half the clan from Spirit Hall’s attack, their hatred for the Clear Sky Clan was naturally the strongest. Moreover, they were also the one clan of the four single attribute clans that made the best living. What ways could move them in the end?</p><br/><p>……</p><br/><p>Next evening, still one day from the time of the four single attribute clan gathering, the Speed Clan arrived.</p><br/><p>The Speed Clan fully brought more than ten people. Niu Gai and Tai Tan went out to meet them together, and Tang San, Ma Hongjun and Tai Long also followed behind.</p><br/><p>Counting carefully, Tang San discovered that the Speed Clan had brought altogether twelve people, the old man leading them was slim, but seemed extremely well proportioned. His long hair hung across his back, but it was already snow white. If not for his face being as rosy as an infant’s, he would seem even older than Tai Tan and Niu Gao. But Tang San knew that he was really a year younger than Niu Gao. His spirit power was also around the eighty first or eight second rank. That was also the Speed Clan’s clan chief, Bai He[1].</p><br/><p>Actually, the Speed Clan’s spirit wasn’t a crane, crane’s didn’t fly fast. The reason why they walked the road of speed was also greatly related to their spirit. Because the Speed Clan’s spirit was a bird with the fastest flight speed, called the Needle-Tailed Swift[2]. It was possessing such a spirit that led the Speed Clan down their cultivation route.</p><br/><p>Following next to Bai He was a young woman about the same age as Tang San and Ma Hongjun. The young woman was tall and well proportioned, extremely beautiful. Even if she was a bit thin, her appearance was only slightly inferior to Xiao Wu, Zhu Zhuqing and the others. The expression in her eyes seemed somewhat proud, holding Bai He’s arm, her beautiful eyes looked around hopefully, seemingly very interested in everything around her.</p><br/><p>Ma Hongjun took one look at this young woman, and his eyes immediately straightened. He never had any resistance to beautiful women. Secretly swallowing, he stared fixedly at her without blinking, as if about to eat her.</p><br/><p>The young woman very soon sensed Ma Hongjun’s gaze, shooting him a look. Turning her head, her beautiful eyes just fell on Tang San. However, what she looked at wasn’t Tang San’s handsome appearance, but rather Xiao Wu in his arms. Xiao Wu’s fur shone like silver, even starting to turn gold at the roots, further with the power she spread, her chubby body seeming extremely cute, she was a fatal killing blow at least to young women.</p><br/><p>“Haha, old orangutan, I knew you’d definitely be here long ago. It really is so.”</p><br/><p>Bai He laughed loudly and went to greet them, the three elders forcefully hugging.</p><br/><p>However, Bai He clearly felt that Tai Tan and Niu Gao’s expressions were somewhat awkward. It seemed as if they meticulously kept their distance, and when hugging he didn’t get the feeling they were honestly happy.</p><br/><p>Niu Gao looked at the young woman next to Bai He,</p><br/><p>“Xiangxiang came too. Let’s go, we’ll speak inside.”</p><br/><p>Bai He’s subordinates naturally had the Defense Clan’s people’s arrangements, and he brought the charming young woman to follow Tai Tan and Niu Gao into the drawing room with doubts in his heart.</p><br/><p>“Tea.”</p><br/><p>Niu Gao shouted, his expression appearing a bit more unsightly. To the side, Tai Tan also hung his head without speaking.</p><br/><p>Bai He frowned,</p><br/><p>“What’s up with you two old fellows? Such anxious expressions.”</p><br/><p>Niu Gao smiled bitterly:</p><br/><p>“You only just arrived, we shouldn’t speak to you about it. But you also know I can’t keep words to myself. Old whitebird, in the future we might not be able to help you again.”</p><br/><p>Bai He’s heart shivered, him bringing so many people this time wasn’t just for prestige. The Speed Clan’s days really weren’t easy. The entire clan, from clan chief Bai He and down, everyone were proud, they always believed their Swift Spirit was extremely noble. That’s why they never agreed to join any sect. Coming this time, he originally planned to accept some assistance of the other three clans, supporting his clan. This had also become a tradition among the four clans.</p><br/><p>“What’s happened?”</p><br/><p>Bai He’s heart steadied a bit, and asked.</p><br/><p>Niu Gao sighed, saying:</p><br/><p>“You know the Elephant Armored School. Yesterday Huyan Zhen that fellow came. He came to enlist my clan.”</p><br/><p>Bai He said:</p><br/><p>“On behalf of Spirit hall?”</p><br/><p>Right now he couldn’t even pay attention to Niu Gao calling him that name he disliked.</p><br/><p>Noi Gao nodded wordlessly.</p><br/><p>Bai He’s brows wrinkled,</p><br/><p>“Old rhino, you wouldn’t have agreed?”</p><br/><p>Niu Gao snorted coldly,</p><br/><p>“How would that be possible? Even if my Defense Clan was destroyed, I still wouldn’t be Spirit Hall’s dog. Only, I refused them, I’m afraid the Elephant Armored School will retaliate. As for when, nobody can say. Therefore, I’ve decided to migrate the clan. Leave for Heaven Dou City, mixing with old orangutan. You also know, going to the old orangutan’s place, reopening business there, raising income, it’ll take time. Even the Strength Clan’s support is like a cup of water on a burning cart of firewood for our two clans. Not enough. Therefore, this time, I’m afraid we won’t be able to support you.”</p><br/><p>Bai He’s expression clearly seemed a bit artificial. Shaking his head, he said:</p><br/><p>“It doesn’t matter. Over these years, without your support, I’m afraid our Speed Clan would long since have ceased to exist. Now that your Defense Clan is in difficulties, I’m already very sorry I can’t help. How can I still ask for resources. I’ll think of a way myself.”</p><br/><p>The atmosphere in the drawing room became somewhat depressed, the three clan chiefs didn’t speak up again. Niu Gao and Tai Tan glanced at each other and both saw the smile at the corners of each others’ eyes, and hastily rearranged their own facial expressions.</p><br/><p>After a long silence, Tai Tan said to Bai He:</p><br/><p>“Old whitebird, I’ll introduce you.”</p><br/><p>It was Tang San’s turn.</p><br/><p>Bai He looked somewhat blankly at Tai Tan. Tai Tan indicated Tang San to the side, saying:</p><br/><p>“This little brother is a swiftly rising genius of a generation in the world of forging. He’s made some hidden weapons, I’ve taken a look, and they seem very suitable for your Speed Clan. I let him follow me so you could take a look. Little San.”</p><br/><p>Tang San petted the already fast asleep Xiao Wu, first putting her inside the Wishful Hundred Treasure Purse, then once again pulled out the heroic workhorse Godly Zhuge Crossbow from his chest, walking over and handing it to Bai He with both hands.</p><br/><p>Bai He took it with several questions, and the eyes of the young woman at his side were immediately filled with curiosity as she looked at the unassuming black box.</p><br/><p>Tang San didn’t wait for him to ask, taking the initiative to say:</p><br/><p>“This thing is called Godly Zhuge Crossbow, forty eight crossbow bolts are hidden inside, including the crossbow bolts, all of it is made from refined iron. Each time the mechanism on top is wound, it can instantly shoot sixteen crossbow bolts from the holes in front, tyrannically powerful. It can break defensive spirit abilities of the fortieth rank and below, and the crossbow bolts are furthermore poisoned. If used to sneak attack before the opponent raises his defense, even fiftieth and sixtieth level Spirit Masters will find it very difficult to escape. If matched with your noble clan’s speed, it’s might can inevitably increase enormously.”</p><br/><p>Bai He was shocked,</p><br/><p>“You’re saying this thing can break defensive spirit abilities of the fortieth rank and below? You’re certain?”</p><br/><p>Sitting at the head, Niu Gao said:</p><br/><p>“I already tried it last night. What he says isn’t a bit exaggerated. I heard that this thing is still only the basic version Godly Zhuge Crossbow, and it can still be provided with even stronger crossbow bolts. What do you think of that?”</p><br/><p>[1] Bai He - () “White Crane”, thus all the references to white birds.</p><br/><p>[2] Needle-Tailed Swift - () literally “needle tailed rain swallow” or white-throated needle tail, while other raptors might beat them in diving speed, the needle-tailed swift holds the record in vertical flight.</p><br/>\n</div>"}