{"title": "Chapter 184", "id": 184, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-184", "volume_title": "Volume 2", "body": "<h1>Chapter 184</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184</p><br/><p>Divine Craftsman Lou Gao</p><br/><p>(TL by PiggyBottle)</p><br/><p>Under the help of this master blacksmith Ren Yuan, all the problems instantly vanished, the soldier captain had also left in disgrace. While the crowd had dispersed, the people were still unwilling to go too far away, instead they respectfully observed Tai Tan from a distance, the fiery light in their eyes seemingly wanting to consume Tai Tan.</p><br/><p>Tai Tan embarrassed walked back to Tang San’s side saying: “Young Master, I have been too reckless.”</p><br/><p>When Ren Yuan who was beside them heard this, his legs went limp and almost fell flat on the ground. Yo-young master…? This lord divine craftsman actually went and called this young man who barely looked 20 years old young master. Heavens! What on earth was going on here? Seeing Tang San holding onto the stunning Xiao Wu, with a expression clear as sky, Ren Yuan could not help but feel ashamed. He had never seen such a handsome youth and such an extremely beautiful young woman.</p><br/><p>Acting as if not noticing Ren Yuan watching him with a monstrous gaze, Tang San looked towards Tai Tan and said: “Since we are going to see the Divine Craftsman Lou Gao anyway, doing it slightly earlier is of no harm.”</p><br/><p>Tai Tan naturally knew that everybody in the area were looking at them and thus told Tang San: “Young Master, it would be better if we board the carriage for now. After we meet with Lou Gao, let me accompany you and take you around Geng Xin.”</p><br/><p>The group once again got back on their carriages, Ren Yuan also had the fortune of riding in the same carriage as Tai Tan as they headed towards the central district of Gengxin City.</p><br/><p>Even though Ren Yuan really wanted to ask Tai Tan about Tang San’s identity, because he knew he had a humble identity he decided that not asking was for the best. While directing the carriages forward, he could not help but constantly look back at Tang San who only held Xiao Wu’s hand while resting with his eyes closed.</p><br/><p>Gen Xin city itself was not very big, and before long they had already reached the heart of the city where the carriages stopped.</p><br/><p>Ren Yuan glanced out the carriage window before announcing: “Everybody, we have arrived, let's get off here.” then jumping off the carriage, furthermore taking the initiative to hold open the carriage curtains.</p><br/><p>Tai Tan, Tang San and Xiao Wu got off in order, while Oscar, Ning Rongrong and Ma Hongjun also got off the rear carriage.</p><br/><p>As everyone got off their carriage, they could not help but look up.</p><br/><p>The carriages had stopped in front of a tall building, if you raised your head to look, you could see that this building would be at least 30 meters high and spanned a wide area. For a building to occupy such a large space in the heart of the city district, you could tell it was of great importance to the city. The overall look of the building was similar to the large fighting arena in Suo Tuo city, and on the upper region of the building hung a dark iron plaque with no words on it, only the convex pattern of a hammer and a chisel.</p><br/><p>Without even having to ask, Tang San and gang already knew where they were without a doubt. This was the blacksmith association’s headquarters.</p><br/><p>This large building looked a little crude, with practically no decor on it, there was not even a single guard standing at the gates. But the amount of people going in and out was an endless stream, with three huge doors open, and you could easily see the bustling crowd inside.</p><br/><p>Tai Tan introduced the placed to them: “This place is divided into five different levels, the first is where they do their general trading. Smiths proud of their work or people who found or are seeking some metal would come here, and of course there are specialised traders trafficking various metals as well. The second floor is for the trade of more precious goods or rare goods. The third floor is the blacksmith registration district, its is where they carry out the blacksmith rating assessment. The fourth floor is the VIP area and also the auction area, periodically some particularly rare and valuable items will be put up there for auction. Lastly the fifth floor is the blacksmith association’s work area. Ren Yuan, there has not been much change to what I just said right? I have not been back here in a long time afterall.”</p><br/><p>Ren Yuan smiled and quickly said: “No change, no change, this has been the ground rules of the blacksmith association for many years already. Would you all be heading directly to the fifth floor to see the president?”</p><br/><p>Tai Tan chuckled while saying: “Since we are already here, how can we not go see an old friend first. Young master, let us be off.”</p><br/><p>The group walked into the blacksmith association, the first floor was a wide noisy hall which was completely open to everybody, excluding the supporting pillars, it was all a large open space, only furthest out by the walls was there a sales counter, behind which was stocked with a large variety of blacksmithing goods.</p><br/><p>Without needing Tai Tan to first speak, Ren Yuan introduced: “This first level is divided into two different sections, the left is for blacksmiths to sell their creations and the right is for the trading of metal. The association will charge a five percent fee here. Thus all the blacksmiths who come here have some identity to them and they can come from all over the county. Why not go have a look and see if anything catches your eye.”</p><br/><p>Tang San nodded his head and carefully observed the place for the moment. If it was as Ren Yuan said, although there were many people in the hall there were only a few blacksmiths, most of the people looked like customers. Some were busy looking around, others were discussing prices of items, it was a really lively sight to see.</p><br/><p>Ren Yuan continued saying: “Comparatively, things in the federation will be priced slightly higher than the goods outside but here, there is a guarantee on the quality of all the items, only after they have been properly evaluated will they be put out for sale. Outside, you can also get a lot of goods but if you do not know your stuff you might be deceived like what happened just now.”</p><br/><p>While speaking, Ren Yuan brought the group to the stairs at the side of the hall. By the stairs there were two guards standing by, but the clansman Tai Tan brought with the group just waved something in front of the guards and they stood down.</p><br/><p>When they entered the second floor, the atmosphere abruptly changed, it was not as high as the first nor was it as open. The first impression it gave off was peaceful, none of the noise found on the first floor could be heard here. This area was divided to look like a local shopping district with 2 rows of shops divided by a five meter wide sidewalk, in this large area there must be at least a few hundred shops.</p><br/><p>Ren Yuan said: “This is the expensive trading area. To be able to set up shop here, one must have some kind of a background, here is also divided into two areas, the produce area and the metal area. There are generally a lot of good things here but the prices are also relatively higher. If you are interested you can try to sell here too.” His detailed introductions to these areas were not for Tai Tan but rather for Tang San, who seemed very interested about the area.</p><br/><p>Tang San who only took cursory glances at the goods on sale could also see that they were all of better quality than those on the counter downstairs.</p><br/><p>After bringing the group to the stairs leading to the third floor Ren Yuan stopped and humbly said: “I can only send you all until here.”</p><br/><p>Tai Tan nodded to him before saying: “You have been helpful, thanks.”</p><br/><p>In between the second and third floor, similarly there were two guards, but compared to the guards downstairs there was a clear difference. Due to Tang San’s amazing spiritual perception he could tell the guards below had only about rank 30 or so spirit power but these two had to at least have rank fifty of spirit power. Seeing the party approach them, they didn't speak a word but only just raised their hands and calmly looked at them.</p><br/><p>The two clan members that Tai Tan brought along hurriedly walked forward, and this time Tang San finally saw clearly that they took out a golden token. Waving it in front of those guards.</p><br/><p>The two guards’ expressions immediately changed and they hurriedly stepped aside, their manners extremely respectful.</p><br/><p>Tai Tan also deliberately took half a step back behind Tang San and Xiao Wu before saying: “Young master, please.”</p><br/><p>The areas within the third and fourth floors were concealed behind large doors making it impossible to see without going in the respective areas. Between these floors there were also two guards standing by the stairs. Tang San was shocked by the guards between these floors they themselves were enough to be a threat to the group, although they had not released any of their spirit force, Tang San could feel that they easily exceeded the 70 rank, spirit saints. Truly worthy of being the blacksmith association headquarters, that they could use spirit saint level powers as guards showed how much they valued the fourth floor.</p><br/><p>Upon seeing Tai Tan, the guards were momentarily stunned before the on on the left said: “Long time no see! Vice-Chairman Tai Tan, what brings you here today?”</p><br/><p>Tai Tan laughingly replied: “Haha, indeed it has been a long time, I see you two are still here guarding Lou Gao’s stairs! Young master, let me introduce them to you, these two are spirit saints and also elders in the blacksmith association. They have been voluntarily staying here for many years already. Speaking of, their own skills are only second to divine craftsman, both scholar level blacksmiths. The only reason they are willing to stand guard here is because they are Lou Gao’s disciples, in total Lou Gao has 4 disciples who take turns to stand guard here. The one on the left is called Si Long[1], while the one on the right is called Si Yu[2]. The kid who tried to find trouble with us earlier was the child of one of the other two disciples, Si Di.”</p><br/><p>Tang San nodded to the two guards Si Long and Si Yu, what surprised them was the fact that Tai Tan called Tang San young master. Si Long hurriedly said: “Uncle Tai Tan, let me bring you all upstairs first, teacher is currently in the smithy. Recently he seemed to have picked up something from god knows where and has been spending most of his time researching it. If it was anybody else, he probably would not be willing to even meet with them.”</p><br/><p>Tai Tan laughed, “Fine, I want to see just what he’s researching.”</p><br/><p>Between the fourth and fifth floors there were no guards, only a large door which Tang San could not recognise what it was made of, only guessing that it was probably an alloy door comprised of many different metals.</p><br/><p>Si Long walked up to the metal door and started lightly tapping on the door rhythmically. Watching his movements, Tang San cannot help but narrow his eyes, with the assistance of spirit power he could see that each time Si Long tapped the door it was in a different place with slightly different force used each time, the door would also produce a slightly different mechanical noise each time.</p><br/><p>After the thirty-sixth tap, the metal door slid open with a scratching sound, revealing a passage upstairs.</p><br/><p>Tai Tan looked at the two clansman he brought and said: “You two just wait here first.” Saying so, he and Tang San went up together along with Si Long to the highest floor in the association headquarters, the fifth floor.</p><br/><p>Upon reaching the fifth floor, they could hear the high pitched ringing of metal striking metal. Tai Tan told Tang San softly: “Actually, this fifth floor is the blacksmith association’s own private smithy, every blacksmith of the scholar level or above have their own private area here. Back in the days i also had one, but as i do not stay here anymore, nor do i come back here to smith, I returned my area to the association.”</p><br/><p>Outside the door of each room there was a simple number starting from the outermost side to the innermost area, there were a total of thirty six chambers, but there were only four or five which had any sound coming from them. Clearly, over these years where people did not respect blacksmiths as much, the number of sholar level blacksmiths had become pitifully few.</p><br/><p>Si Long brought them to the innermost door before respectfully raising his hand and knocking on the door.</p><br/><p>From within the chamber, an agitated hoarse voice could be heard: “Didn't I already say, no one is allowed to bother me.”</p><br/><p>Si Long hurriedly said: “ Teacher, it is me. Sorry to disturb you but, vice-president Tai Tan has come, I had no choice but to inform you. Please forgive me for this.”</p><br/><p>After Si Long’s statement, that agitated voice disappeared and not long after a series of mechanical sounds could be heard followed by the door sliding open exposing the bright room inside. The strange thing was that there were no windows in the smithing chamber yet it was so bright. It seemed that on the roof inside hung a magic lamp, it was quite the luxury.</p><br/><p>The person who opened the door was a fat old man about 1.6 meters in height. From the looks of it his waistline was probably also reaching 1.6 meters… protruding ears, small eyes and an unkempt beard, one could only guess how many days it had been since he last washed up. His clothes were baggy and his face was covered in some metal powder like things.</p><br/><p>“Tai Tan, you old thing is still alive?” were the first words this fat old man said when the doors opened.</p><br/><p>Tai Tan replied: “Haha, Lou Gao, if a fatty like you who is older than me is still alive, how can i possibly die?”</p><br/><p>Sure enough, this fat old man must be the blacksmith association’s president. Divine Craftsman Lou Gao. In all honesty, from his looks he did not look anything like a divine craftsman, but rather more like an agreeable fat old man.</p><br/><p>“Well it’s good that you are here today! Quickly come in, I have something good to show you. I have been trying to figure this out for many days already, the person who came up with this must have been a genius.” While speaking, he did not even notice the people behind Tai Tan, and immediately dragged him in with his sleeves.</p><br/><p>Tai Tan was slightly taken aback, and hastily followed him in. He was a family patriarch, standing over two meters tall with an extremely robust body yet was so easily pulled in by this just 1.6 meter old man, with an incomparably large waistline, to see something strange.</p><br/><p>The Shrek five devils who came followed Tai Tan into the large chamber. Si Long didn’t enter, quietly retreating. He still had his own post to keep.</p><br/><p>The inside of the chamber was really messy although it was over five hundred square meters big, with all sorts of metals all over the place. In the corner, a black lustrous furnace which gave him chills caught the attention of Tang San.</p><br/><p>Using his purple demon eye to look at it, Tang San suddenly gasped. It would appear that the furnace was made out of profound iron, furthermore it was not just profound iron, but a few other metals forming a special alloy.</p><br/><p>In the front of the whole room was a circular platform, this platform looked like a large metal pilar. Only a meter tall yet looking very solid, the Shrek five devils present, other than Xiao Wu, were all secretly thinking that that thing could not possibly be solid.</p><br/><p>Lou Gao brought Tai Tan to the circular platform, their bodies blocking the Shrek five’s line of sight only letting them hear Lou Gao triumphantly saying to Tai Tan: “Let me show this to you! Never seen it before right? This is something i spent a lot of money to get! With this, perhaps our blacksmiths’ status can make a comeback! But while I was trying to take it apart, i accidentally broke a part and so now it cannot be properly used again. I was just thinking of how I can fix this thing, such a pain it is... the person who made this is really a genius. If I was not wrong, the reason i broke it was because it had a protective device within it, when i tried to dismantle it it broke by itself. Eh, Tai Tan this thing is so amazing you are at a loss of words?”</p><br/><p>While listening to Lou Gao’s words, the Shrek five devils also circled around to see what Lou Gao was showing off, looking at each other they realised why Tai Tan did not speak and only had a strange expression on his face.</p><br/><p>In Lou Gao’s hands was a 1 chi long black box with a simple looking design. Other people may not know what this things was, but how could the Shrek seven devils not know. Tang San was, after all, its maker! Thats right, the thing in Lou Gao’s hands was the Godly Zhuge Crossbow.</p><br/><p>Tang San could not help but ask: “Senior Lou Gao, where did you get this Godly Zhuge Crossbow from?” He clearly remembered not giving this crossbow to any outsiders, so how on earth did it end up in Lou Gao’s hands? In this world there should only be one person able to manufacture this item.</p><br/><p>Lou Gao glanced at Tang San and said: “Who the hell is this brat, don’t you know that kids should not interrupt when adults are speaking? Eh wait, what did you say? You know what is this thing?”</p><br/><p>Tang San smiled and said: “The genius make you spoke about, I am afraid that that would be me. So of course i recognise that thing.”</p><br/><p>Lou Gao lifted his head to look at Tai Tan, who had a faint smile on his head and nodded at Lou Gao.</p><br/><p>“That’s great!” Lou Gao loudly shouted shocking everybody, especially Xiao Wu who immediately leapt into Tang San’s embrace. This fat divine craftsman also rushed towards Tang San.</p><br/><p>Tang San quickly used his Ghost Shadow Perplexing Track to bring himself and Xiao Wu a few steps back. “Senior Lou Gao, what are you trying to do?”</p><br/><p>Lou Gao failing to pounce onto Tang San also froze a moment. “Brat why are you trying to hide? Quick, hurry up and tell me how you made this thing, and how to restore it. Also how you developed it. If you help me answer these questions, I will directly promote you to a scholar class blacksmith.”</p><br/><p>Tang San gently petted Xiao Wu’s back to comfort the frightened her, Ning Rongrong also timely came and took Xiao Wu from Tang San.</p><br/><p>Tang San walked up to the cylindrical stage and had a look at the Godly Zhuge Crossbow before he wrinkled his brow suddenly. “Rongrong, this is a Godly Zhuge Crossbow I sold to the Seven Treasures Glazed Tile School, how did it end up out of the clan?”</p><br/><p>Lou Gao was taken aback and said: “What Seven Treasures Glazed Tile School, I bought this from Spirit Hall, there are still a few more over there. If not for my fame, they would not have even sold it to me. If i am not mistaken they are also studying this thing.”</p><br/><p>Hearing what Lou Gao said, Tand San understood. It was certain that the crossbow in front of him was made for the Seven Treasures Glazed Tile School, but after Spirit Hall’s raid on the clan, they used the crossbow on the Spirit Hall members to great effectiveness, so after they killed many Seven Treasures Glazed Tile School members, it was natural that they would have obtained a few of these crossbows. After all, amongst all the weapons made for the Seven Treasures Glazed Tile School only the Godly Zhuge Crossbow was not equipped on their body and was the most easily obtained by the enemy. Thus this was no wonder.</p><br/><p>As for the reason Lou Gao damaged the crossbow when trying to dismantle it was not because his skill was inferior to Tai Tan, but rather it was due to all the Godly Zhuge Crossbows he made for others to have an additional hidden mechanism to self destruct to avoid others being able to produce them as well. When somebody tried to open these crossbows, the mechanism would come into contact with the inside machinery and damage the key components preventing any others from learning how it worked. The crossbow that he originally showed Tai Tan did not have these mechanism to prevent tampering as it was for his own personal use and making it without the device was much easier and cheaper. Seeing Tang San not say a word but rather just looking at the Godly Zhuge Crossbow in his hands, he could not help but feel anxious. Afterall, regarding matters on smithing, he was even more passionate than Tai Tan, thus he could not help but ask: “How on earth did you make this? You better tell me!”</p><br/><p>Tang San returned from his thoughts and said: “This thing is for certain made by me, it was originally made for the Seven Treasures Glazed Tile School. As to why it ended up in the hands of Spirit Hall, it would have to be related to the attack by Spirit Hall.”</p><br/><p>Lou Gao impatiently urged: “I don’t care who is related to who or what. I only want to know why this thing is broken. Boy did you do something to tamper with it?”</p><br/><p>Tang San spoke with an indifferent smile: “This Godly Zhuge Crossbow is of my design, in order to prevent others from imitating it, i have installed something within it such that once it is open it would be damaged and quite a few new parts would be required to fix it.”</p><br/><p>Lou Gao’s eyes lit up: “No problem, no problem. I have all sorts of metals here, whatever you need you just name it and i can give it to you. If you want to make it yourself it is also fine, this place of mine is pretty well equipped.”</p><br/><p>Tang San shook his head and said: “Senior, this time I would have to disappoint you. This time I cannot help you reassemble this Godly Zhuge Crossbow.”</p><br/><p>Lou Gao’s eyes suddenly flared up: “Why!? You little brat, you must be Tai Tan’s disciple right? Don't you know who I am? I am the Blacksmith Association president. Didn’t i already tell you? If you just help me fix this, I will confer the title of scholar class smith to you without any other tests.”</p><br/><p>Tang San smilingly said: “Senior, what use is the title of smith scholar to me? You are a divine craftsman, if i were to repair this in front of you then wouldn’t you be able to see the secret mechanisms within this object? This is a secret for my Tang Sect, someone not from the Tang Sect cannot be allowed to know about it. Even amongst the Tang Sect disciples, only the core few members are allowed to know the specific production process. If it were to be let out, in the future us Tang Sect members would have lost our secrets and become obsolete.”</p><br/><p>“Tang Sect? What is the Tang Sect? You are a very arrogant little brat! Tai Tan, shouldn’t you discipline your guys better?” Lou Gao was anxious to find out how the crossbow worked and could not help but take a glance at Tai Tan.</p><br/><p>Tai Tan helplessly spread his hands and said: “I also have no idea. The person in front of you is not my disciple, rather he is the sect leader of our Tang Sect. I am already part of Tang Sect, and one of the elders at that. You who are trying to steal our Tang Sect secrets, if the sect leader does not want to find trouble with you you should already be happy, how can you expect us to tell you how this Godly Zhuge Crossbow is made?”</p><br/><p>Lou Gao blinked and said: “Tai Tan why did you join some random Tang Sect! Even if your family has declined and you no longer are a patriarch, you can always come back here to the blacksmith association! Tai Tan why don’t you tell us how well big brother here treated you in the past?”</p><br/><p>Tai Tan chuckled and said: “Back then you really were quite good to me when i first came to the association, eventually you became the president and me the vice.”</p><br/><p>Lou Gao Slapped his thighs and exclaimed: “That’s right! We have been such good brothers for so long. Now that big brother has some problems, how can you not help out? Hurry up and tell me how this is made already. You are also a blacksmith, you should be able to tell how important this is. If we can build it, then the Spirit Hall will also come bringing us business as well.”</p><br/><p>Tai Tan sighed and said: “Big brother, of course i know how important this is! But because of that, all the more i cannot tell you. I cannot go against these clan regulations. Actually if it was you instead of me, you would also certainly join the Tang Sect. This Godly Zhuge Crossbow is good but, in our Tang Sect, it is just an ordinary hidden weapon. Yes these things are what we called hidden weapons. I too was attracted to it which is why i joined the Tang Sect, to non-disciples, we cannot disclose its secrets.”</p><br/><p>Hearing Tai Tan’s words, Lou Gao said something that shocked everyone: “Then this is simple! Just let me join this Tang Sect. Given my skill in smithing, joining the core disciples should be no problem! So just hurry up and tell me already.”</p><br/><p>Tai Tan had a cunning smile on his lip while Tang San quickly said: “Senior!? You really want to join Tang Sect? But you are the president of the Blacksmith Association!”</p><br/><p>Lou Gao absently-mindedly said: “Ah this position as the president, I am already bored of it. After seeing this wonderful Godly Zhuge Crossbow, I felt something i have not felt in many years. This youthful impulsive feeling washed over me just like when i was first learning how to smith. Now you can tell me how is thing is made already right?”</p><br/><p>Oscar who was standing by the side said: “After joining the Tang Sect, you will be a disciple of Tang Sect, from then on will be in the service of the Tang Sect. You can never spread the Tang Sect secrets outside of the clan. Naturally this also means you can not tell them to blacksmiths outside of the Tang Sect.”</p><br/><p>Lou Gao somewhat taken aback said: “You guys are all so troublesome. Restricting this and that. Don’t you know how bad the blacksmiths have it right now? Outside of Gengxin City we are all considered the lowest, everyone tries to bully us! And do you know why? It's all because we have no status at all! Boy, since you can come up with all these things aren’t you also a blacksmith? Don’t you want to seek more benefits to us blacksmiths in the industry?”</p><br/><p>Looking at the sincere and eager Lou Gao, Tang San’s brain was also furiously working. He knew that this was definitely a great opportunity for him, and if he grasped it well, it would have an immeasurable impact on the future of the Tang Sect. He quickly glanced at Tai Tan who was also looking at him with an ardent look.</p><br/><p>Taking a deep breath to calm himself down, Tang San told Lou Gao: “Senior, you are the president of your blacksmith association, I feel that it would be better if you did not join us. I cannot possibly accept a figure such as yourself. But you are right, I can also be considered a blacksmith, even more so I am the son of a blacksmith. For the benefit of the blacksmithing industry i would have to refuse. When I established the Tang Sect, I have considered the impact it can have on the blacksmithing industry. However, also for my sake, if i were to teach all the blacksmiths my art, how can the Tang Sect still survive? I know that the life of a blacksmith is not easy. How about this? Why not let the Tang Sect and the Blacksmith Association work together? Let the Tang Sect officially hire some skilled blacksmiths to help smith the parts for these hidden weapons. This way as the Tang Sect hidden weapons prosper, the blacksmith’s status will also rise. In the future I can also give some methods to make relatively simpler hidden weapons which the blacksmith association can use and make. Of course this will not include the Godly Zhuge Crossbow you have right now. Such large and powerful hidden weapons needs to be carefully controlled by our Tang clansmen.”</p><br/><p>Listening to Tang San’s words, Lou Gao frowned and eyes gradually calmed down as well. “Boy, are you the leader or are you actually a businessman? So no matter what, you are unwilling to hand over the manufacturing process of this Godly Zhuge Crossbow to me? How about if I get something to trade for it?”</p><br/><p>Tang San smiled and replied: “I will not trade it away.”</p><br/><p>Lou Gao complained: “You don’t even know what I am going to offer yet you already say no?”</p><br/><p>Tang San nodded and said:” No matter what it is, i will not agree to the trade.” The Godly Zhuge Crossbow was going to be one of the core Tang Sect hidden weapons in the future, if the production methods were to be leaked, what's more to the blacksmith institute, then the Tang Sect will not be the only Tang Sect.</p><br/><p>Lou Gao furiously banged the table with his hands, the loud sound could be heard throughout every corner of the blacksmith institute. “Boy, today you have come together with Tai Tan, I believe that you have come to buy things, do you believe that if i wanted to I could let you become unable to buy anything here? I could stop everyone here from selling you anything.”</p><br/><p>Tang San seriously nodded and said: “I believe senior is definitely able to do so, but this is not enough to threaten me. It is not as if only Gengxin City has the various metals that I need. We have come from Heaven Dou Empire and already come a long way and we will still be heading onwards even further, it's also not as if we are going to be procure all our resources from Gengxin City exclusively in the future anyway.”</p><br/><p>Seeing this twenty or sold year old youth unwilling to yield at all, Lou Gao also had no other way. He strode to the door, opened the gates and shouted: “Si Long, get over here!”</p><br/><p>In a few breaths, Si Long had quickly rushed over to Lou Gao respectfully asking: “Teacher, did you call for me?”</p><br/><p>Lou Gao grunted and said: “From today on, you are the new president of the Blacksmith Association. I am tired already, I will be going travelling from now on. If anything happens in the future don’t come and find me anymore, of course, you should not try and come after me as well.”</p><br/><p>“Ah, teacher you must be joking right?” Si Long said, stunned by Lou Gao’s sudden words.</p><br/><p>“Does it look like I am joking? I shall leave my works here for the four of you brothers. Next time when I am no longer at the blacksmith association, you all have to work together to run this association. I am already old anyway, it is about time i retire as well. If in case something really large should ever happen that you cannot handle, then send someone to go find Tai Tan in the Heaven Dou Empire, he is the vice-president and a divine craftsman as well anyway.”</p><br/><p>[1] Si Long - () “Thinking Dragon”</p><br/><p>[2] Si Yu - () “Thinking Rain”</p><br/>\n</div>"}