{"title": "Chapter 189", "id": 189, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-189", "volume_title": "Volume 2", "body": "<h1>Chapter 189</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 189</p><br/><p>Tang Sect’s Five Halls</p><br/><p>(TL by Bagelson)</p><br/><p>In fact, even though Tang San’s spirit power was at the sixty sixth rank, he was after all a battle Spirit Master, and battle Spirit Masters advanced a bit easier than tool Spirit Masters. Among tool Spirit Masters, the most difficult to cultivate was food system tool Spirit Masters. With Oscar apparently twenty something years old still advancing past the sixtieth rank, to the Spirit Emperor level, it was obvious how talented he was. Consequently, the four clan chiefs returned the courtesy in turn.</p><br/><p>Tang San’s second introduction was Ning Rongrong,</p><br/><p>“Ning Rongrong, sixty first rank auxiliary system tool Spirit Master. I think I only need to introduce her spirit for all clan chiefs to understand her somewhat. Rongrong is from the Seven Treasure Glazed Tile School, the present Seven Treasure Glazed Tile School master senior Ning Fengzhi’s only daughter, and also the future successor of the Seven Treasure Glazed Tile School. Entering our Tang Sect, besides being in charge of future sect financial affairs, she also has the important responsibility of communicating with the Seven Treasure Glazed Tile School. Everyone are on the same side here, so I won’t hide it, the Tang Sect’s establishment is vigorously backed by the Seven Treasure Glazed Tile School. That’s how we possess sufficient funds.”</p><br/><p>The Seven Treasure Glazed Tile School, once second of the three upper sects, second only to the Clear Sky School, the four single attribute clan chiefs were of course very familiar with it. Just Ning Rongrong’s position as the Seven Treasure Glazed Tile School heir was enough to make them not dare look down on her, and even more so when learning that ning Rongrong was even a bit younger than Tang San, but had still already broken through the sixtieth rank. The Seven Treasure Glazed Tile School had never had anyone break through the eightieth rank, but even the seventy something ranked Ning Fengzhi was already the most formidable tool Spirit Master on the entire Continent. There was no need to doubt the ability the sixty one ranked Ning Rongrong represented.</p><br/><p>Ning Rongrong equally got up to respectfully salute the four clan chiefs in greeting. As early as when she was beaten after entering Shrek Academy, her haughty manner had already disappeared. In these years she had concentrated even more on cultivation, and even if she was just turned twenty, she already had some of her father’s elegance.</p><br/><p>Tang San’s gaze finally turned to Ma Hongjun, sitting closest to him on the right,</p><br/><p>“Ma Hongjun, fifty eighth ranked power attack type battle Spirit Master, spirit Fire Phoenix. He is also a bit younger than me, and fourth oldest among us Shrek Seven Devils. His spirit is certainly best in battle properties. For the moment I’ve decided to put him in charge of the Tang Sect’s later battle operations, specially choosing the disciples from the sect that are best at fighting to form the Martial Hall. In the future, the sect’s external operations will be handled by the Martial Hall.”</p><br/><p>Tang San’s gaze finally fell on Xiao Wu,</p><br/><p>“I think I should also let all elders know about her. Xiao Wu was once a member of us Shrek Seven Devils, the fifth oldest. She was also my lover. But because of Spirit Hall’s persecution, her soul left her body. Even though she’s alive, she’s already lost her awareness. She only has a bit of instinct. I won’t hide it from you elders, Xiao Wu is the same as my mother, originally she wasn’t human, but a hundred thousand year spirit beast.”</p><br/><p>At these words, the four clan chiefs as well as divine craftsman Lou Gao were simultaneously greatly alarmed, their gazes at Xiao Wu immediately turning monstrous.</p><br/><p>Tang San didn’t seem to notice the change in their expressions, continuing:</p><br/><p>“All you elders have seen my sixth spirit ring. The reason I can possess a hundred thousand year level spirit ring as my sixth, really isn’t due to my own ability, nor is it that I can break through the limits of the Spirit Master world. It’s because of Xiao Wu. In order to save me, Xiao Wu chose to sacrifice herself, sacrificing her spirit ring for me. It’s also because of this that she changed into her current state. If it wasn’t because I had an immortal herb called the Yearning Heartbroken Red at the time, she would long ago have truly died.”</p><br/><p>“Yearning Heartbroken Red?”</p><br/><p>Yang Wudi cried out.</p><br/><p>Tang San nodded,</p><br/><p>“The Blood Crystal Dragon Ginseng gave me was eaten by Xiao Wu, before that she was the little rabbit I carried. It was with the aid of these two great immortal treasures that Xiao Wu separated from the beast form, becoming human. But she still has no consciousness or soul. Her soul has already fused together with my sixth spirit ring along with her sacrifice.”</p><br/><p>Even though Tang San related it very calmly, the atmosphere in the Tang Sect sect master meeting hall still grew a bit somber. Looking at Xiao Wu, including Lou Gao, the eyes of the five elders all revealed some respect. Choosing to sacrifice herself for her lover. So what if she was a spirit beast? How many humans could do it? In their thoughts were only four words, humans inferior to beasts.</p><br/><p>Drawing a deep breath, Tang San calmed his mood, turning to the five elders,</p><br/><p>“I plan to set up the four single attribute clans like this. Because we are in ourselves a sect, it’s not too appropriate to continue calling it as clans. I want to simply change the naming of the four single attribute clans. The Strength Clan will hereafter be called the Strength Hall, mainly in charge of the sect’s hidden weapons production. This is also the future main source of income. Elder Tai Tan will hold the concurrent post as hall master. The Defense Clan will hereafter change name to Defense Hall, in charge of the sect’s defense and all manner of construction obligations. Elder Niu Gao will hold concurrent post as hall master. The Speed Clan will change to Speed Hall, in charge of information gathering, investigation, and news. Elder Bai He holds concurrent post as hall master. The Breaking Clan will change name to Medicine Hall, in charge of sect defense along with the Defense Clan, but mainly refining medicine. Among these, the drugs will be split into healing and poison. I will talk over the concrete details with elder Yang Wudi. Elder Yang Wudi holds concurrent post as Medicine Hall master.”</p><br/><p>“This is all I can think of for the moment. At the same time, all elders present as well as I, Oscar, Ning Rongrong, and elder Lou Gao, altogether nine people will form Procedure Hall. We will commonly discuss all major sect events, and decide by vote. Each person has one vote. What do you elders think?”</p><br/><p>The Shrek Seven Devils naturally wouldn’t object to Tang San’s proposal. Tang San had for the moment thought of these for the Tang Sect’s structure, the remainder was a matter for discussion.</p><br/><p>As the head of the five elders, Tai Tan was first to speak up. His expression when looking at Tang San was clearly filled with praise,</p><br/><p>“I have no objections, sect master’s plans are very systematic. If I were to raise one opinion, I feel that, as sect master, your authority really is a bit too little. I propose that the sect master has two votes. Even if it’s adding one vote for miss Xiao Wu. At the same time, sect master possesses a veto power.”</p><br/><p>Not only Tai Tan, the other elders also nodded simultaneously. Even if Tang San’s plans changed the names of the four single attribute clans, he divided the authority evenly, without monopolizing power. This bit made the elders exceedingly appreciative. But they were intelligent people, and also saw that the future accomplishments of the few Shrek Seven Devils in front of them was immeasurable. If they only coveted a bit of strength at present, then some day the future of the four single attribute clans might be affected. This was something they didn’t wish to see. Even more, as the sect master, Tang San should originally possess even more authority.</p><br/><p>Lou Gao spoke up,</p><br/><p>“Sect master, now they all have duties, then what about me?”</p><br/><p>Tang San said:</p><br/><p>“Senior Lou Gao, you should basically also be part of Strength Hall. However, I don’t want to give you a post there. Tai Tan is in charge of Tang Sect’s overall hidden weapon production, so I want you to be in charge of producing the Tang Sect’s most advanced hidden weapons. Once the blacksmith scholars Si Di and Si Kai arrive, it will be up to you and them to complete this responsibility. I will make blueprints for all the Tang Sect’s most advanced hidden weapons and materials and give them to you. I believe that, among the future hidden weapons the Tang Sect produces, each and every one with the characters Lou Gao will be on the divine tool level.”</p><br/><p>Hearing that Tang San would offer him blueprints and materials, Lou Gao’s eyes immediately brightened, hurriedly saying:</p><br/><p>“Alright. Then it’s decided, I have no objections.”</p><br/><p>The Tang Sect’s first high level conference ended smoothly, without any dissenting voices. The Tang Sect’s overall structure and labor division was already clarified, and this recently established sect immediately got to work.</p><br/><p>The five elders left, leaving only the Shrek Five Devils in the meeting hall.</p><br/><p>Oscar said:</p><br/><p>“Little San, isn’t it careless to leave me in charge of logistics? I don’t have any experience in that area.”</p><br/><p>Tang San smiled slightly, saying:</p><br/><p>“This is originally a joint responsibility for you and Rongrong. Anyway, Rongrong is our god of wealth, so your logistics work will need her support. With your relationship, I don’t think there’s anyone more suited to hold this post. Don't tell me you don’t believe you have the ability? You might have a lot of work. Later you and Rongrong go to the warehouse together and take stock of the metals we got on our trip this time, then supply Strength Hall. Our development has to be accelerated. The distance to the day of the seven sect reselection assembly is getting closer and closer.”</p><br/><p>Oscar laughed helplessly,</p><br/><p>“Fine. You’re pushing me beyond my ability. Oh, right, shouldn’t we go back the the Academy first? I don’t know how the thing with the four element academies turned out.”</p><br/><p>Tang San nodded, saying:</p><br/><p>“We should make a trip back, Rongrong has been gone for so long and should go back to see uncle Ning. How about this, Little Ao, you and Rongrong go back to the Seven Treasure Glazed Tile School, me and Fatty will visit the Academy. Teacher and the others should also have returned. After you’ve been to the Seven Treasure Glazed Tile School, return and meet up with us at the Academy.”</p><br/><p>Even though the Tang Sect had just been established, they currently possessed the advantage of abundant resources. First of all was their location. Within Heaven Dou City, even if Spirit Hall discovered their existence, they would still be unable to easily move against them, at the same time the Tang Sect also had the backing of the Shrek Academy and the Seven Treasure Glazed Tile School, so much that even the Heaven Dou imperial family supported them. As long as they didn’t step on the wrong path, Tang San believed that he definitely could develop and advance the Tang Sect on the Douluo Continent.</p><br/><p>The four left the Tang Sect almost simultaneously, hurrying in different directions. Tang San pulled Xiao Wu and went towards the Shrek Academy together with Ma Hongjun.</p><br/><p>They had just left when, suddenly, they met a troop of around a hundred cavalry straight ahead, unexpectedly galloping down the street at high speed, just like last time when Tang San met fourth prince Xue Beng’s troop. Because he had Xiao Wu along, Tang San didn’t want to frighten her, and stepped out of the way to the side of the street with Fatty.</p><br/><p>Even though that troop of cavalry was very fast, their horsemanship was exquisite, and they even had a somewhat severe aura.</p><br/><p>Tang San’s heart twitched, vaguely sensing something wrong, but he was still unable to say why. Having left Heaven Dou City for a time, just now there also hadn’t been time to exchange information with elder Bai He. But his intuition was always very sharp. Reaching out to hold Xiao Wu’s slender waist, he said to Ma Hongjun:</p><br/><p>“Fatty, we’ll move a bit faster, something might be happening in Heaven Dou City.”</p><br/><p>Ma Hongjun stared blankly,</p><br/><p>“It wouldn’t. Everything seems very normal to me! Besides, if something ha happened, why didn’t elder Bai He tell us just now?”</p><br/><p>Tang San shook his head, saying:</p><br/><p>“I don’t know either, only, just now that troop of cavalry was a bit strange. There was no one among them dressed as a noble, still daring to rush down the street like that only has one other explanation, that they were carrying out a mission. But what urgent missions could there be in Heaven Dou City? Let’s first go take a look at the Academy. Any situation should be clear there.”</p><br/><p>Very quickly, the three returned to the Shrek Academy. Entering the Academy, Tang San’s uneasy feeling from those soldiers before faded a lot. At least on the surface, it didn’t seem like anything had changed at the Academy. Everything seemed very ordinary. Right now it was already after class, and students came and went in a steady stream.</p><br/><p>These students naturally knew Ma Hongjun and Tang San, and they could be seen stepping aside one by one, standing there and worshipfully watching them enter the Academy. Even if Tang San and Ma Hongjun were no longer considered members, their status in the Shrek Academy wasn’t any lower than that of the teachers, to the extent that they were even seen as the spiritual emblem of Shrek Academy.</p><br/><p>At the school building, the three went directly to Flender’s office, and Ma Hongjun went up and knocked.</p><br/><p>Flender’s familiar voice came from inside,</p><br/><p>“Enter.”</p><br/><p>Fatty smiled at Tang San, making a gesture of everything as always and pushed open the door.</p><br/><p>Flender leisurely leaned back in his office chair, and immediately smiled on seeing Ma Hongjun,</p><br/><p>“Hongjun, you’ve returned……”</p><br/><p>He had only reached so far when he screeched to a stop, shooting out of his chair, his eyes filled with a startled light. Because he could now see Tang San and Xiao Wu following Ma Hongjun in.</p><br/><p>Just as Tang San and Xiao Wu entered, there was already another familiar voice echoing from outside.</p><br/><p>“Flender, you really don’t care about anything. Erlong said you’re refusing to work again?”</p><br/><p>With a rigid face, a familiar figure entered the not yet closed door. Tang San had already respectfully turned around,</p><br/><p>“Teacher.”</p><br/><p>The new arrival was Grandmaster, only, right now it was as if he hadn’t heard Tang San’s words, his expression hardly any different from Flender, staring fixedly at Xiao Wu next to Tang San, white dressed, scorpion braid hanging over her chest.</p><br/><p>Ma Hongjun chuckled,</p><br/><p>“Very astonishing. Xiao Wu resurrected.”</p><br/><p>“This, little San, what’s going on here?”</p><br/><p>Xiao Wu’s appearance already exceeded the limits of Grandmaster’s imagination. With his research into spirits and spirit beasts, he couldn’t understand how Xiao Wu could recover her human shape in such a short time.</p><br/><p>Tang San glanced at Xiao Wu with a look full of tenderness, tightly pulling her waist close, simply explaining the matter of Xiao Wu’s resurrection.</p><br/><p>Listening to Tang San’s account, whether it was Flender or Grandmaster, they both displayed knowing smiles.</p><br/><p>“Excellent, her body has recovered, we can always think of a way for the rest.”</p><br/><p>Flender sighed.</p><br/><p>Ma Hongjun said:</p><br/><p>“Teacher, has something major happened in Heaven Dou City in the time we’ve been gone?”</p><br/><p>Flender looked distracted,</p><br/><p>“Nothing’s happened! Everything is normal. Eh. Oh, right, last time you dealt with the matter of the four element academies very well. Now they’ve already formally merged into our Shrek Academy. If it’s only in terms of the strength of the Academy, our Shrek Academy can absolutely count as number one on the Continent.”</p><br/><p>“What?”</p><br/><p>This time, even Tang San was shocked,</p><br/><p>“The four element academies have merged into Shrek Academy?”</p><br/><p>Flender chuckled, saying:</p><br/><p>“The four element academies are just stray dogs, don’t tell me they can hope to share our cup of soup in Heaven Dou City?”</p><br/><p>Grandmaster snapped:</p><br/><p>“That’s also because they encountered an unscrupulous profiteer like you. With a shark like you going to set terms for the academies, how could we lose out?”</p><br/><p>Flender proudly said:</p><br/><p>“That’s all thanks to Tang San and the others’ arrangements before leaving. The four element academies were finally scared by Bone Douluo and the Seven Treasure Glazed Tile School. Besides, the second time they came, not only was Bone Douluo was here, but even Poison Douluo came. With two Title Douluo supervising, would they dare not compromise?”</p><br/><p>Listening to Flender, Tang San’s heart twitched,</p><br/><p>“Senior Dugu came?”</p><br/><p>He naturally wouldn’t address Dugu Bo as old freak to outsiders.</p><br/><p>Flender said:</p><br/><p>“He was looking for you, seemed quite urgent. At that time I gave the four element academies an introduction to that honorary dean of ours. Speaking of, Poison Douluo might not be equal to Bone Douluo in terms of strength, but for deterrence, he’s far superior. His poison is a tyrannical ability that can silently annihilate countless opponents.”</p><br/><p>The previously diluted sense of crisis once again appeared in Tang San’s heart. He didn’t get deeper into the immensely self satisfied Flender’s dealings with the four element academies, and questioned closer:</p><br/><p>“Dean Flender, senior Dugu didn’t say why he was looking for me?”</p><br/><p>Flender shook his head:</p><br/><p>“He didn’t say, after I introduced him to the four element academies, he left in a hurry. His expression seemed a bit abnormal. As if he was troubled by something. It’s possible it was something about Spirit Hall.”</p><br/><p>No, wrong. Tang San’s mind moved like lightning, immediately recalling the contents of his last discussion with Dugu Bo. At that time Dugu Bo had just treated emperor Xue Ye’s poison, and according to him, it was almost done. What matter could have him anxiously come looking for him?</p><br/><p>With Dugu Bo’s strength, it was naturally impossible to be something related to power. Then, there was only one possibility.</p><br/><p>After a simple analysis, Tang San’s estimation of Dugu Bo’s reason for finding him was more or less correct, and he also couldn’t help feeling somewhat anxious. For Tang Sect’s future development, it naturally wouldn’t do to only rely on the Seven Treasure Glazed Tile School. Only by relying on the great tree of the Heaven Dou Empire could they develop to their fullest potential.</p><br/><p>Grandmaster and Flender noticed Tang San’s silence, and didn’t disturb him. Along with the rise of the Shrek Seven Devils’ strength, their influence in the Spirit Master world also imperceptibly rose to a higher and higher degree. Especially now that Tang San had decided to establish the Tang Sect. Even if it was impossible to gain the approval of Spirit Hall, Flender and Grandmaster both understood that this exceptionally talented disciple had already stepped onto the Spirit Master world stage in a true sense. As long as everything went smoothly, Tang San and the Shrek Seven Devils would shine brightly in the Spirit Master world.</p><br/><p>Tang San returned to himself, somewhat apologetically looking at Grandmaster and Flender,</p><br/><p>“I’m sorry, I spaced out.”</p><br/><p>Grandmaster shook his head, saying:</p><br/><p>“Little San, how far has that Tang Sect of yours come?”</p><br/><p>Tang San said:</p><br/><p>“Everything is already in order, we can start regular operations at once. We had a rich harvest on our trips to Rising Dragon City and Gengxin City. The four single attribute clans have now already joined the Tang Sect, giving the sect its embryonic form. Next is to operate the sect at full strength, manufacturing the first batch of hidden weapons. Once we have hidden weapons to a certain extent and in stock, the sect can be considered to stand firmly.”</p><br/><p>Listening to Tang San, Flender and Grandmaster couldn’t help simultaneously being excited. They of course knew about the four single attribute clans. The previous Clear Sky School was a colossus in the Spirit Master world. As the Continent’s number one sect, the subordinates of the Clear Sky School, besides the directly related Spirit Masters, supported a total sum of more than four thousand Spirit Masters. The most famous among these were the four single attribute clans. In their most flourishing stage, they each had close to one thousand five hundred Spirit Masters. That was already a considerable number in the Spirit Master world. Moreover, even though each of the four single attribute clans had very large drawbacks, at the same time they also possessed extremely large accomplishments in their own spheres of influence. To use an appropriate term, their power was extremely frightening.</p><br/><p>When the Clear Sky School’s old sect master chose not to confront Spirit Hall head on and retreat, even if it prevented calamity for the Clear Sky School, it still might not have been proper. Even though Spirit Hall’s power was enormous, the Clear Sky School’s overall strength wasn’t weak. Now that Tang San had taken in the four single attribute clans, as long as they were deployed appropriately, the Tang Sect would have future accomplishments.</p><br/><p>Grandmaster said:</p><br/><p>“Even though the four single attribute clans haven’t existed in the Spirit Master world for very long, each of their strengths and skills will be extremely useful to the Tang Sect’s future. Little San, you have to treat them well.”</p><br/><p>Tang San nodded,</p><br/><p>“Teacher, don’t worry. Today I’ve already made some simple arrangements for the Tang Sect’s structure…..”</p><br/><p>Next, he went through the five Halls he had established in the Tang Sect today, as well a each of their roles.</p><br/><p>“...... so at present the Tang Sect’s main strength is all used on building the sect, as well as producing hidden weapons. Even though the four single attribute clans are outstanding, they’re still not suited to becoming true warriors. Later the Martial Hall Fatty is responsible for will expand, absorbing some Spirit Masters with strength. At the same time, I also plan to later establish a Punishment Hall, to deal with the Tang Sect’s internal matters.”</p><br/><p>Flender smiled:</p><br/><p>“Little San, these five Halls of yours are all very characteristic. Then won’t Oscar and ning Rongrong establish a Hall?”</p><br/><p>Tang San said:</p><br/><p>“For the moment there is no need. Little Ao, Rongrong, and Fatty, will all later be the Tang Sect’s vice sect masters. Finances and logistics are both fairly important. I’ve talked it over with Rongrong, and we’re planning to first transfer some personnel from the Seven Treasure Glazed Tile School. Once everything is on track, we’ll replace them with our own people. Right now there’s no capital to establish a Hall.”</p><br/><p>Flender said:</p><br/><p>“In the future, if there’s anything the Academy can help you with, just say it. Because of Spirit Hall, now there has also begun to appear problems with recruiting students. Spirit Hall has recently integrated a lot of advanced Spirit Master academies, leading to the majority of young spirit masters joining them. If not for our Shrek Academy still having some reputation, I’m afraid circumstances would’ve been even worse. After Spirit Masters graduate, they always need to find a way forward. I hope that your Tang Sect will be able to become this way in the future.”</p><br/><p>Tang San nodded, but didn’t make any promises. The Tang Sect had only just set out, and while he of course hoped the Tang Sect could later absorb some outstanding Spirit Masters, at the same time he didn’t want both good and bad people to mix in with the Tang Sect. The concrete circumstances still depended on the later development of the Tang Sect, as well as the circumstances on the Shrek Academy’s side.</p><br/><p>Grandmaster seemed to know what Tang San was thinking, and calmly said:</p><br/><p>“Little San, this time we led the students to hunt spirit beasts in the spirit beast forest, and there also emerged a batch of quite promising students. I will do some screening among them, and pick out some outstanding students to join the Tang Sect.</p><br/><p>Tang San smiled wryly:</p><br/><p>“I’m afraid they won’t be willing when the time comes. After all, right now the Tang Sect has only just started out.”</p><br/><p>Grandmaster’s face revealed a rare smile,</p><br/><p>“No, you’re wrong about that. You might not know the influence you have on the hearts of the students right now. After the few times you’ve displayed your strength, right now you’re practically an idol to the students in the Academy. When they hear they have a chance to become part of a sect established by you, practically every student in the Academy will sign up. The graduation exam is in half a month. At the same time there will be a test for them. When the time comes I will pick out a group of students with good strength and morals and send them to you. Young Spirit Masters are impulsive and hot-blooded. I believe you won’t let them down.”</p><br/><p>Seeing the faint smile on Grandmaster’s face, Tang San’s heart warmed. His Teacher had already prepared to help him.</p><br/><p>“Teacher, thank you……”</p><br/><p>Grandmaster smiled slightly, saying:</p><br/><p>“What thanks. You are my only disciple, I only wish for you to be even more outstanding. Reach Title Douluo soon, and let me see the true might of twin spirits, that is the best gratitude you can show me. I’m carefully researching your present circumstances. Among all Spirit Masters, you can be considered the most special case. Possessing a hundred thousand year spirit ring and four spirit bones at sixtieth rank. Also twin spirits. For your future development direction and your own circumstances, I’ve made some simple assessments regarding spirit power development and all kinds of attributes.</p><br/><p>Speaking of spirits, Grandmaster’s mind clearly grew stimulated,</p><br/><p>“The greatest drawback of twin spirits is that the attribute upgrade from a quantity of spirit rings surpassing that of ordinary Spirit Masters will be too much for the body to handle. I once spoke to you about this issue for the Spirit Master world. Spirit Masters are human, and each person have their own endurance limits. The higher this limit is, the more attribute advancement they can endure. Of course, this also has an important relationship with the spirit rings and spirit bones obtained.”</p><br/><p>“Spirit Hall’s current Supreme Pontiff Bibi Dong also possesses twin spirits. Even if I don’t know how strong she is now, I’m certain she will inevitably already be cultivating both spirits simultaneously. With her position in Spirit Hall, the added attributes from each of her spirit rings naturally won’t be lacking. But she still hasn’t reached her limit. I’ve always reflected on this problem over these years, why hasn’t Bibi Dong’s added attributes reached the limit? Her own attributes evolving is unrelated to any outside assistance. That goes even more for the body’s ability to withstand it. In other words, she definitely uses some method to share her the burden of her excessively advanced attributes. Thinking on it from this point of view, I found some small clues. But I’ve never dared be certain. Only last time when I heard you speak of your spirit bones forming an armor could I be more or less confident in my estimate. If I’m not mistaken, if you could possess a perfect configuration of spirit bones, you would immediately form that special spirit bone armor. And such an armor in itself will cause a certain variation. Not only can it protect the body, it will also cause the Spirit Master’s own endurance to rise dramatically.”</p><br/><p>“At the same time, I’ve also carefully researched your present condition. You’re different from Bibi Dong. Your body can be said to have passed a thousand hammer blows, and a hundred refinements. Especially those immortal treasure herbs you took caused enormous changes to your body. For the present you, your physical endurance far surpasses that of ordinary people. Consequently, I believe that after your Blue Silver Emperor is cultivated to the Title Douluo level, even if you continue absorbing with the Clear Sky Hammer spirit, there shouldn’t be any problems at least within four spirit rings. And at that time, I hope you can already possess a full set of spirit bones. Then we can examine my hypothesis. If my conjecture is correct, then, you will very possibly become a twin spirit dual Douluo.”</p><br/><p>Tang San listened carefully to Grandmaster, only speaking up once Grandmaster finished his account:</p><br/><p>“Teacher, then isn’t the Supreme Pontiff already a twin spirit dual Douluo now?”</p><br/><p>Grandmaster shook his head, saying:</p><br/><p>“No, that shouldn’t be the case. Even if Bibi Dong is a genius, at the same time she is also a perfectionist. If I’m not mistaken, right now she should only be a single Title Douluo. Even I don’t know what her second spirit is, but from her actions against Xiao Wu, she clearly hasn’t gathered all spirit rings for her second spirit yet. She is inevitably hoping to have even more powerful spirit rings to absorb. Of course, I can also be sure that, right now, she is absolutely the most powerful Supreme Pontiff in the history of Spirit Hall.”</p><br/><p>Tang San’s impression of Bibi Dong had always been that appearance when the Shrek Seven Devils participated in the Continental Advanced Spirit Master Academy Elite Tournament. When his father appeared that time, Bibi Dong didn’t display much power. It felt as if her strength wasn’t very different from Chrysanthemum Douluo and Ghost Douluo.</p><br/><p>Seeing the expression of deep thought in Tang San’s eyes, Grandmaster lowered his voice:</p><br/><p>“Little San, you must remember what I say. You cannot for any reason underestimate Bibi Dong. Not even if you become a twin spirit dual Douluo in the future. I’m relatively familiar with Bibi Dong’s character. She’s not only someone who will do anything to achieve her goals, she’s also an extremely patient power. Otherwise she wouldn’t be the Supreme Pontiff right now. Even I didn’t know she actually had twin spirits before she succeeded as Supreme Pontiff.”</p><br/><p>Just as the master and disciple pair were discussing twin spirits, suddenly, an impatient voice came from outside,</p><br/><p>“Has the little freak returned?”</p><br/><p>“Is Tang San back? I don’t know! If he is, he should be with Flender.”</p><br/><p>The replying voice belonged to Liu Erlong.</p><br/><p>The office door opened, but before Liu Erlong could come inside, the Shrek Academy honorary dean, poison title Dugu Bo had already charged in like a whirlwind. With one look at Tang San, he immediately exulted.</p><br/><p>“Little freak, I heard that Ning family girl say you were back. I came to find you immediately. Quickly come with me, there’s big trouble.”</p><br/><p>While speaking, he directly pulled Tang San from the sofa, alarming Xiao Wu next to him who immediately tightly grabbed onto Tang San’s arm and hiding behind him.</p><br/><p>Dugu Bo also looked distracted on noticing Xiao Wu, but he clearly had even more important things on his mind,</p><br/><p>“Quickly, quickly. You brat, you’ve been gone for so long. If you were even a bit later, I’m afraid there would’ve been major trouble. I can only count on you now.”</p><br/><p>With Xiao Wu alarmed, Tang San couldn’t help frowning a bit,</p><br/><p>“Old freak, don’t be anxious, no matter how urgent it is it can still wait a while. Is it that emperor Xue Ye’s poison has resurged?”</p><br/><p>Dugu Bo stared blankly,</p><br/><p>“How did you know?”</p><br/><p>Tang San smiled wryly:</p><br/><p>“Besides poison, what else would you need my help for? Dean Flender mentioned you were looking for me, so I guessed.”</p><br/><p>Dugu Bo looked at Grandmaster and Flender, revealing an extremely serious expression,</p><br/><p>“Little San, this time really is troublesome. Emperor Xue Ye is on the verge of death.”</p><br/><p>“What?”</p><br/><p>Besides the soulless Xiao Wu, everyone in Flender’s office cried out simultaneously. Everyone were shocked by this sudden news.</p><br/>\n</div>"}