{"title": "Chapter 186", "id": 186, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-186", "volume_title": "Volume 2", "body": "<h1>Chapter 186</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 186</p><br/><p>Heart Chilling Iron and Deep Sea Sunken Silver</p><br/><p>(TL by PiggyBottle)</p><br/><p>Other than Xiao Wu, the people present who heard this, for some unknown reason felt a chill run down their spine. Tang San’s flat demeanor suddenly became scary.</p><br/><p>And so the day quickly passed. Tang San accompanied Xiao Wu in his room, taking the time while Xiao Wu slept to cultivate. While the other three, Oscar, Ning Rongrong and Ma Hongjun went to walk around Gengxin City</p><br/><p>On the evening of the second day, Si Long came.</p><br/><p>At this time, Oscar and company had yet to return, only Tang San, Xiao Wu, Tai Tan and the two clansmen the brought were present at the hostel.</p><br/><p>Tang San brought Xiao Wu to meet Si Long in Tai Tan’s room.</p><br/><p>Si Long said: “The various metals that you need have been mostly prepared. Because some of the metals you wanted are so rare, I spent most of these two days searching all the association stores before I could finally get the amount you needed together. All that is lacking is the last bit of profound iron which will be delivered to us tomorrow morning.”</p><br/><p>Tang San smilingly said: “President, you have worked hard.”</p><br/><p>Si Long said with a laugh: “It was nothing, rather, I am hoping that you will come back several more times in the future.”</p><br/><p>Tai Tan asked: “What about Lou Gao that old guy? What has he been doing these two days?”</p><br/><p>On mention of Lou Gao, a wry smile appeared on Si Longs face. “Vice president Tai Tan. My uncle Tai Tan. What on earth did you give him! These two days, teacher was sleeplessly trying to figure out was was on the paper you gave him that he did not even eat his meals. Sometimes trying to make it by himself. He is crazily obsessed with that thing.”</p><br/><p>Tang San and Tai Tan exchanged looks at each other, before uncontrollably bursting out into laughter. Originally when Tai Tan first saw the diagrams for the Torrential Pear Blossom Needle he was also like this. Except, when Tang San showed Tai Tan the diagram it was the complete one which could still be visualised. However, when Lou Gao saw the diagram which was only a third of the full thing, there were many sections that were mysterious yet more difficult to fully understand.</p><br/><p>Tai Tan said: “No worries. You just let him look at it all he wants. Tomorrow we will be leaving Gengxin city. At that time, we will bring him away directly. Don’t worry, I will go and remind him tonight, since he still has to publicly announce your succession as the association president.”</p><br/><p>As before Si Long was still slightly worried. “Uncle Tai Tan, it would still be better to address you as such.[1] Truthfully speaking, teacher leaving alone,Iam still a little worried about him” He was going to succeed as president soon, that’s why he did not want to use the title ‘Vice-President’ to address Tai Tan.</p><br/><p>Tai Tan smiled in spite of himself: “Why? Are you scared that we will harm him? But, right now even if we decide not to allow him to come with us, I fear that he would just cry and wail with us all the way to Heaven Dou Empire. I know how attractive that thing is. Just be at ease, Lou Gao will be fine if he comes with us. Perhaps even, in just a few years, this blacksmithing association would grow more prosperous. When that time comes you too will find out the reason why Lou Gao so desperately wants to come with us.”</p><br/><p>Si Long’s eyes let out pensive look, and after thinking for a bit said: “A few fellow disciples of Lou Gao and myself have discussed about this matter. Since there are four of us disciples of Lou Gao, we have decided that it would be good if two of us went along with him. Among the four of us, other than Si Di who is still a grandmaster smith, the rest of us are smiths scholars. So we have decided on the two smith scholars Si Yu and Si Kai to travel with you all to Heaven Dou Empire. Incidentally, they can help take care of teacher, teacher is after all getting late on years.”</p><br/><p>On hearing these words, Tang San and Tai Tan couldn’t help but feel delighted. Smith scholars were not that easy to come by. Tang San had previously heard from Tai Tan, those who are at the smith scholar level, were only a sliver apart from divine smiths in terms of skill. To Tang San, the value of having two smith scholars was something that couldn’t be measured by money. To add a Lou Gao on top of that, to Tang San the importance of these three people was even greater than all the metal they come here to purchase combined.</p><br/><p>Tang San spoke without any hesitation: “Then it is decided. President Si Long, please be at ease, we will certainly take good care of senior Lou Gao and your two juniors. It is just as elder Tai Tan said, perhaps before too long, the smithing profession would once again thrive on the continent.”</p><br/><p>While they were having their conversation, Ning Rongrong’s lively voice came from outside, “We are back.” Without knocking, Ning Rongrong happily opened the door, only after seeing that Si Long was also around did her jovial expression die down a bit. Oscar and Ma Hongjun followed behind her into the room as well.</p><br/><p>Tang San smilingly said: “How was the harvest for you three?”</p><br/><p>Ning Rongrong giggled: “Hehe, not bad, not bad, the trip can still be considered to be fruitful.” while saying that, with a flick of her wrist and a glimmer of light from her bracelet spirit tool, a piece of ore the size of a human head appeared on the table.</p><br/><p>Upon seeing the piece of ore, Tang San, Tai Tan and Si Long’s pupils simultaneously shrank.</p><br/><p>That was a somewhat murky piece of crystal, if it was only seen as a crystal, it would seem to be of a very low grade. It was not very transparent, slightly yellowish, with a very impure coloration.</p><br/><p>However, within this piece of crystal was a large piece of something shimmering golden.</p><br/><p>“Plate Crystal Gold.” Tang San, Tai Tan and Si Long uttered simultaneously.</p><br/><p>The three of their eyes met, their gazes equally full of surprise.</p><br/><p>Ning Rongrong giggled: “Hehe, this thing cost me quite a large sum. Third Brother, I heard you say something about this before, I did not mistakenly buy this right?”</p><br/><p>Tang San remained silent for a while, when compared to the rutilated crystal he originally bought from Flender, this one was even purer and had much more gold within it. Although the expenditure of his Dragon Beard Needles was low, in order for the future production of the Peacock Plume and various other hidden weapons, the value of this rutilated crystal was just too high. “That is right, this is indeed Plate Crystal Gold. Rongrong, how much did you buy it for? Will you resell it to me?”</p><br/><p>Ning Rongrong burst out laughing, Ma Hongjun who was standing by the side couldn’t hold back anymore and said: “What resell it to you! Rongrong only spent one gold coin on it, the shop owner even stared at us like we were idiots for a long time.”</p><br/><p>“One gold coin?” Si Long exclaimed, with a bitter smile: “Why don’t I ever run into such good things. I will pay you a thousand gold coins. Will you sell it to me?”</p><br/><p>Ning Rongrong said: “Hehe, such good profits! Just a single resale and I get back a thousand times in value. But, if you want it you better ask third brother. This thing is already his.”</p><br/><p>With a searing gaze Si Long looked at Tang San, but all he saw was Tang San’s blue eyes which felt as deep as the oceans. Tang San apologetically said: “I must apologise, President Si Long, this piece of Plate Crystal Gold is equally important to me.”</p><br/><p>Si Long thoughtfully asked: “Are you going to use it to make accessories?”</p><br/><p>With a flick of Tang San’s wrist, all of a sudden there was a small gold bean the size of a grain of rice on his hand. “In my hands, it is not an accessory, but a weapon to kill.”</p><br/><p>As his words fell, he flicked his finger, Tang San’s actions could be clearly seen by everyone but these same people could feel an unparalleled strength stemming out from those actions. </p><br/><p>Without a single sound, all the audience could see was a flash of gold, and within the crystal appeared an extra golden line.</p><br/><p>Since the time he met Tang San, this was the first time Tang San showed off his skills in front of Si Long, and Si Long could only feel a chill grow within his heart, without knowing why, this young man in his eyes gave him a very dangerous feeling, which even exceeded the pressure Tai Tan gives him.</p><br/><p>“Third brother, how did you do that? can you teach it to me?” Ning Rongrong said as she widened her eyes and excitedly looked at Tang San.</p><br/><p>Tang San impatiently said: “If you want to learn this skill. You will have to give up your spirit. Furthermore you will have to train this for over ten years. Does this really look that fun to play with? Can you just imagine what it would feel if this was shot into a human body?”</p><br/><p>Tai Tan’s eyes brightened, “This must be the Dragon Beard Needles right?”</p><br/><p>Tang San smilingly replied. “With this piece of Plate Crystal Gold, I can make over a thousand Dragon Beard Needles.”</p><br/><p>After seeing Tang San’s performance, Si Long cannot bring himself to even speak about wanting to buy this piece of Plate Crystal Gold, this piece of Plate Crystal Gold would be so much more useful in Tang San’s hands than in his own.</p><br/><p>Tang San spoke to Ning Rongrong: “Rongrong, what other nice things did you bring back? It would really seem that you have pretty good luck!”</p><br/><p>Ning Rongrong said: “I also managed to get a few other things, but I myself am not too sure as to what they are.”</p><br/><p>While saying that, she shook her bracelet and a chain of objects appeared before them.</p><br/><p>The first thing Tang San noticed was a jet black piece of ore, on the surface of the ore was a hint of cold air, it otherwise looked just like a jet black piece of iron ore. Of the things that Ning Rongrong took out, this was the largest, about a meter in diameter, but what was most shocking was its weight, upon landing on the floor, the whole building shook a little.</p><br/><p>The trio who knew their stuff Tang San, Tai Tan and Si Long were once again surprised. Tai Tan was the first to take a step forward. Upon arriving in front of this large black ore, he took his hand and touched the surface of the rock, “The temperature is not right, this cannot be normal iron ore.”</p><br/><p>Si Long eyes flashed with a unique luster, with a slight pleading look and looked towards Ning Rongrong: “Miss Ning, can you let me try and identify what kind of ore this is?”</p><br/><p>Ning Rongrong said: “Hehe, of course. This ore was chosen by me from a place where they sold iron ore at the price of refined iron. Priced according to volume, which roughly amounted to also about one gold coin.”</p><br/><p>Oscar continued by saying: “It was actually less than one gold coin, so they also threw in that thing over there which was also very heavy.” while he was saying this, he pointed at something beside the jet black ore which was only about a third the size of the jet black ore. What he pointed at was a piece of ore which was completely grey with a slight metallic sheen looking like a rather ordinary piece of stone.</p><br/><p>Si Long slowly raised his right hand, a small golden spot appearing in the center of his palm, followed by a golden flash and the appearance of a small golden chisel out of thin air. One white, two yellow, three purple, one black, seven rings quietly appeared on this small chisel, looking much smaller than the spirit rings Tang San and company had seen on other spirit masters so far.</p><br/><p>From the viewpoint of spirit ring configuration, Si Long’s was apparently not very optimal. As a spirit sage, he only had one ten-thousand year spirit ring. However, his strange spirit tool had attracted everyone’s attention.</p><br/><p>Tai Tan spoke in a low voice: “Si Long’s spirit tool is a diamond chisel, it is best used for the prospecting of various kinds of ores and the creation of delicate objects. With at least mastering eighty percent of Lou Gao’s teachings, he has a high status in the smithing industry.”</p><br/><p>As a spirit sage, although he had no talent in fighting and even people ranked lower than him could bully him, but the moment his diamond chisel appeared in his hands, his entire temperament drastically changed.</p><br/><p>At this moment, Tang San could feel that the Si Long in front of him was as focused as Yang Wudi while holding his Soul Breaking Spear.</p><br/><p>With a golden flash, the group did not even see the first few spirit rings on the Diamond Chisel light up, the Diamond Chisel tip was already resting on the jet black ore.</p><br/><p>With a clear ring, the jet black ore suddenly erupted with a crisp crackling noise, in an instant a golden light had spread throughout the ore from the point of contact with the chisel. It was as if a golden mesh was wrapped around the entire ore before it seeping into the ore. Yes, that was a seeping feeling.</p><br/><p>The crisp cracking continued to resound, smoke slowly burst out of the surface of the ore. Under Si Long’s chisel’s constant tapping, the outer surface of the ore slowly crumbled away. Following that, a heavy cold air spread outwards, dropping the temperature of the room instantly.</p><br/><p>With a wave of Tai Tan’s hand, he used his spirit force to sweep open the outer layer of the broken ore, exposing equally jet black coloured metal ore inside.</p><br/><p>Although it was also black, it was without a hint of impurities inside. Using his Purple Demon Eyes, the density of the metal could be determined, even though his Purple Demon Eyes was already at the detail level, it was very hard for him to even find a flaw within it. The blackness was deep as if it was the void, even if a normal person without any understanding of metal were to look at it they would be able to tell that this was not some simple iron.</p><br/><p>The golden light receded as Si Long already banished his spirit tool. His gazed dazedly while speaking in a hard to understand tone: “Refined Heart Chilling Iron, it really is refined Heart Chilling Iron… and such a large chunk at that.”</p><br/><p>Ning Rongrong blinked her large innocent beautiful eyes. “President Si Long, this seems like something pretty good, do you plan to buy this from me?</p><br/><p>Si Long watched Ning Rongrong expression suddenly become strange, “Miss Ning, Heart Chilling Iron is the hardest metal on the Continent. It is not that I do not want to buy this from you, rather I am unable to afford it. Its price is 10 times that of Profound iron. Even if you let me go and try, I probably cannot even find five kilograms in Gengxin City. This piece of yours is easily over a hundred kilograms, its value is simple astronomical.”</p><br/><p>At this point he suddenly stopped and muttered instead: “Miss Ning, can you please tell me, where did you manage to find these things?”</p><br/><p>Ning Rongrong smiled without saying anything, Oscar who could stand it no further, smilingly said: “Seven Treasure Glazed Tile School is not just the world’s best auxiliary support clan. At the same time, spirit masters with the seven treasure glazed pagoda spirit have a strong ability to evaluate treasures. Ning Rongrong’s treasure evaluation abilities are even greater than that of Schoolmaster Ning.”</p><br/><p>If it was the finding of only one top grade ore, it could perhaps be attributed to luck, in Ning Rongrong’s case, it could obviously be seen that this was not something so simple. She didn’t even know what it was that she was buying, but could generally feel the value of the things that she bought.</p><br/><p>Tang San was deeply shocked, he too knew about this Heart Chilling Iron Si Long mentioned, in the previous world it was known as Frost Iron ore. Moreover, towards this metal, Tang San had many feelings remaining towards it. After all, he had previously personally used it to create the one and only peerless hidden weapon, the Buddha Fury Tang Lotus. Heart Chilling Iron was one of the most important materials required as it was one of the three great core materials to create the Buddha Fury Tang Lotus .</p><br/><p>Ning Rongrong’s gaze shifted to the next piece of unassuming grey rock, before uttering the line that caught everyone’s attention.</p><br/><p>“I feel that, this rock’s value is even higher than the other things here.”</p><br/><p>“What?” Si Long unhesitatingly practically jumped towards the rock. At least the previous Heart Chilling Iron had some semblance of being special, but this piece of metal had nothing that could make him feel was any special.</p><br/><p>Tang San and Tai Tan both also rushed forward, all of a sudden, Tang San’s body jolted upright, “It can’t be such a huge coincidence right?”</p><br/><p>He raised his hands slowly stroking the ore that was only a third the size of the Heart Chilling Iron. His eyes suddenly blazed, his spirit force surging, and within a black flash appeared the Clear Sky Hammer in his hands.</p><br/><p>Standing straight, Tang San asked the rest to step back, Si Long’s gaze firmly fixed on his Clear Sky Hammer, at this moment he suddenly understood the significance behind Tai Tan’s attitude towards Tang San.</p><br/><p>With his left foot pointing forwards, his Mysterious Heaven Skill surging within himself, with a woosh, the piece of ore was lifted up, using his left toe as an axis, Tang San spun around once. While spinning, he wound up like a bow being pulled into the shape of a moon. When the grey ore rose to its highest point,Tang San’s body also momentarily paused, and in the next moment, the arrow was let loose.</p><br/><p>Boom!</p><br/><p>The Clear Sky Hammer flew outwards in a black flash which collided with the grey ore, in the next few moments, all they could hear was a ringing in their ears. That grey ore was not even cracked by the blow from the Clear Sky Hammer, instead it flew out over the walls and disappeared along with Tang San’s body.</p><br/><p>Before the ringing stopped, Tang San had already appeared back in the room with the grey ore in his embrace.</p><br/><p>After being hit by that blow from Tang San, this piece of grey ore did not even suffer from a single crack or even a dent on its surface. It had appeared as if nothing had happened to it at all.</p><br/><p>Tai Tan and Si Long simultaneously rushed over, Si Longs Diamond Chisel once again appeared, with permission from Tang San, the Diamond Chisel once again tapped onto the grey stone. With a clear ring a silver luster appeared where Si Long tapped it with the chisel, but it had disappeared once Si Long lifted the chisel.</p><br/><p>“What kind of metal is this? I have never seen it before. It is extremely resilient. If the Heart Chilling Iron was the hardest metal, then this is definitely going to be the toughest metal. For it to be more valuable than the Heart Chilling Iron. How-, how can that be possible? I have been smithing my whole life, and I have never even seen a metal like this!”</p><br/><p>Tang San looked towards Ning Rongrong and said: “This time you really picked up some great treasures. This piece of metal, even I have never seen it before. But, if I guess correctly, it should be the ore of the Deep Sea Sunken Silver.</p><br/><p>Si Long still did not know what the Deep Sea Sunken Silver was for, but Tai Tan understood, a great joy after a great shock, “This means that the Torrential Pear Blossom Needles can be…”</p><br/><p>Tang San Bitterly smiled: “Thats hard to say, at the very least, if it was either you or me, or even Master Lou Gao cannot successfully forge this Deep Sea Sunken Silver ore. It is simply just too resilient. As far as I know Deep Sea Sunken Silver cannot be melted down by any flame. If we wanted to forge with it, the only way is to hammer it into shape. Unfortunately none of us here has this capability.</p><br/><p>After thinking for a while Tai Tan said: “I am afraid that probably only the Master could do something like this.”</p><br/><p>Hearing Tai Tan speak of his father, Tang San’s eyes flashed with a hint of light, “That’s it, perhaps I really would have a way. But, this matter will have to wait.”</p><br/><p>Saying that, his body flashed once and all the things that Ning Rongrong bought back had disappeared. All of which had been kept into his Twenty Four Moonlit Bridges.</p><br/><p>Tang San's heart inadvertently started to race. Because, he finally had the chance to once again create the ultimate hidden weapons he spent the whole of his previous lifetime making. The Peacock Plume, Torrential Pear Blossom Needle, Buddha Fury Tang Lotus. Will we finally meet again in this world? If these three kinds of hidden weapons can be produced. Then even if we face off with the real fighters from Spirit Hall, what is there to be afraid of?</p><br/><p>Si Long constantly took deep breaths, not allowing his heart to give rise to evil. The impact of seeing all these things just now was just too great. Heart Chilling iron, Deep Sea Immersed Silver, these treasure were all things that you could only dream of having. They were as precious as hundred-thousand year old spirit rings. Never even seeing such treasures after being in Gengxin City for so many years, when compared to these people who have just been here for a few days. A pain that cannot be described by words emerged in his heart. Si Long suddenly felt envious of his teacher, at least his teacher could walk away and leave everything behind as he wished. As a top-class blacksmith, a divine craftsman, being able to use the best materials in the world to forge. Ah what a wonderful feeling it must be.</p><br/><p>Although Tang Hao had once said. To forge divine artifacts out of scrap iron is what makes a real divine craftsman, but if a divine craftsman were to forge with divine materials, what miracles would happen then?</p><br/><p>After calming himself down with much difficulty, Si Long asked the rest of them: “I have come to invite you all to join in tonight’s auction. I have already prepared everything. Would all of you please follow me along? As far as I know, there should be quite a few rare goods up for auction. There will be completed goods and also metal.”</p><br/><p>Tang San had been silently watching Si Long since earlier, from Si Longs eyes he could see a huge amount of longing and even a little greed, but not any evil. And at this point the president’s eyes had once again cleared up. As a top-grade blacksmith, to be able to do something like this was testament to his good character. No wonder Lou Gao choose to hand over the Blacksmith Association to him.</p><br/><p>…...</p><br/><p>Once again they returned to the Blacksmith Association, the hall on the first floor was much emptier compared to the other day. Perhaps because it is already very late.</p><br/><p>WIthout directly entering the auction hall on the fourth floor, they first went to the third floor, where the area was used for the testing of blacksmiths. Si Long brought everybody to a room and gave each of them a large black cloak which even covered their faces, exposing only the nose, mouth and eyes in order to protect their identities. After all the auction was a very private affair where many buyers and sellers did not wish to disclose their identities.</p><br/><p>Once again heading to the fourth floor, Tang San saw many people wearing similar outfits as them as they slowly walked into the auction halls. No one spoke a word, everything was very peaceful. This seemed to be the part of the rules of the association.</p><br/><p>“Hold on.” Just as he was about to enter the auction, a huge black ball-like person suddenly appeared beside him.</p><br/><p>Tang San’s heart moved and he instantly knew who this completely wrapped in black man was. It was none other than the Blacksmith Association President, Divine craftsman Lou Gao.</p><br/><p>Lou Gao’s figure was just too amazing, with only one look, it would look just like a round ball. At this time, he looked up towards Tang San with his bloodshot eyes. It was just as Si Long said, for the past two days, he clearly did not have much rest and was wholly obsessed with the diagram of the Torrential Pear Blossom Needles. </p><br/><p>“I will go in with you all.” Lou Gao deliberately spoke in a low voice, before walking into the auction before them.</p><br/><p>The group followed behind him, entering into a world of blackness.</p><br/><p>The whole auction hall was very dark, with only dim lights on the floor to guide the way. With the guidance of Lou Gao and Si Long, they quickly reached the seats in the front row. It felt as like the layout of the place was similar to that of a large theater.</p><br/><p>Tang San’s vision was naturally unaffected by the darkness. The semicircle shaped auction room had about 200 seats, in the front was a large rectangular stage, naturally that was where the goods for auction would be showcased. At the moment, about half the seats in the auction hall were already filled, with a constant stream of bidders still walking in. However, the auction hall was extremely quiet, even the occasional chatter was done softly.</p><br/><p>Lou Gao brought everyone to the front most row to sit, where he sat beside Tang San who was sitting beside Xiao Wu.</p><br/><p>Immediately after sitting down, he whispered into Tang San’s ears: “Brat, I want the complete diagram.”</p><br/><p>Tang San lightly smiled saying: “That is no problem, after we return back to the Tang Sect, senior will naturally see it. In the future, there will be many more waiting for senior to make.”</p><br/><p>Lou Gao thought for awhile and said: “That’s enough, you don't have to act dumb with me. I can already tell, the thing you shown me on the diagram cannot possibly be made in large quantities. But if even one can be produced, then it would already be a frightening divine item. I am prepared to use some Heart Chilling Iron to smith it, what do you think? About two kilograms of it should be enough right?</p><br/><p>Hearing Lou Gao’s words, Tang San cannot help but feel impressed, nothing less from a Divine Smith, only after looking at the Torrential Pear Blossom Needle diagram which was incomplete for two days, he could already see the importance of the materials needed for making it.</p><br/><p>Tang San shook his head saying: “Heart Chilling Iron is not good enough, although it may be hard, it is not resilient enough, during production it will not be able to take the stress and collapse. Don’t worry, we have already prepared the right metals. It’s just that that metal requires a certain person to work on it. Once we return to the Tang Sect, I will tell you about it one by one.”</p><br/><p>Lou Gao turned stiffed for a long while before finally saying to Tang San: “Brat, for me to join your Tang Sect, I do not want any reward, but I do have a request.”</p><br/><p>“Do say.”</p><br/><p>Lou Gao deeply said: “I request, as long as it is made by me, I want my name to be engraved on it.”</p><br/><p>Tang San nodded his head saying: “Of course. But similarly, the Tang Sect name will be engraved on it. After all, the diagram was supplied by me, don’t you agree?”</p><br/><p>Lou Gao too nodded, his bloodshot eyes filled with a strong luster, “Perhaps, this is another way to change the status of blacksmiths. I shall make several heirloom treasure and show those Spirit Hall bastards, we blacksmiths can also reach the same heights as them.”</p><br/><p>Tang San earnestly replied: “I believe that you will definitely do so.”</p><br/><p>With regard to the old man beside him, a shred of respect rose in his heart, Lou Gao’s obsessiveness with smithing, his willingness to go all out just to raise the status of blacksmiths, all was worthy of respect. His joining will certainly allow the Tang Sect hidden weapons reach a new height.</p><br/><p>At this time Tang San did not know that, it was precisely because of this simple conversation with Lou Gao, thousands of years later, Tang Sect hidden weapons bearing Lou Gaos emblem would be the only ones that could match those with Tang San’s emblem as priceless treasures.</p><br/><p>The place in front of them suddenly lit up, causing many of the audience to be unadapted to it. On the stage was a beam of light, in that beam stood an old man of about 50 years old, wearing a formal outfit.</p><br/><p>“Welcome all the honorable guests gathered here today. I am Si Di. Today’s auction will be starting soon, so please all be seated. Although everyone who is entering today’s auction should be old faces, I must still repeat these basic rules. During the bidding process, please raise the sign beside you, at the same time calling out your bid. Although I know this is not possible, but I do hope that everyone here be satisfied by the bidding outcome.” </p><br/><p>A calm and peaceful introduction it was, the fifty odd year old on stage was Lou Gao’s youngest disciple Si Di, and also the only one amongst the four who was not yet a smith scholar. Of course, he was also the father of the soldier captain from that day.</p><br/><p>The blacksmith association members pushed an object covered with a large red cloth up stage. From the looks of it, the object on stage was rather heavy since even four people pushing it required some effort.</p><br/><p>“Now we will start our first auction of the day, this is a piece of special metal. Its purity is above ninety percent. It weighs two hundred and thirty one kilograms. Without saying much more, let me present you with this piece of profound iron. in so many years, this is the first time I am seeing such a large piece of profound iron. I am sure all of you here know, by just adding small amounts of profound iron into other common metals would produce a large increase in quality of the final product. For such a large piece of profound which is also so high grade, it can no longer be sold at the normal unit price, as such it is the first thing being auctioned today. The starting price is twenty thousand gold coins, with a minimum increment of a hundred gold coins. Let the bidding begin.”</p><br/><p>While saying that, Si Di took off the red cloth revealing the profound iron inside.</p><br/><p>Two hundred and thirty one kilograms of profound iron, even Tang San could feel affected, it was as Si Di mentioned, such a large piece of profound iron was rare, and what’s more it was of such good quality. Using such profound iron to create alloys could allow a large improvements in the strength of other metals. It was definitely something you could never have too much of.</p><br/><p>When Si Di officially announced the auction, Tang San could immediately feel Ning Rongrong glancing over at him.</p><br/><p>Tang San slightly moved, nodded his head.</p><br/><p>Bidding had already started, and all that could be heard was bids being called out non stop. </p><br/><p>“Twenty three thousand gold coins.” A loud voice suddenly pushing the prices far ahead, suppressing all the previous bids.</p><br/><p>Si Di smilingly said: “Number 132 bids twenty three thousand gold coins, is there any other bidders? Good, number 164 bids twenty three thousand five hundred gold coins……”</p><br/><p>Prices continued to rise, yet Ning Rongrong’s hands did not move, Tang San also laid back in his seat, something as good as profound iron, who would ever have too much? Hoarding it now would allow more production in the future. If a little profound iron could be added into the Godly Zhuge Crossbows, not only would the mechanisms be able to bear more load, the penetrating power would also greatly increase. If they had enough profound iron, then the larger Godly Zhuge Crossbow Tai Tan spoke of making would become a possibility.</p><br/><p>Very quickly, the price of this piece of profound iron had already risen to twenty five thousand gold coins.</p><br/><p>[1] (TLN: This is as he still regards Tai Tan as above himself in superiority, so if he continues using the title Vice-President technically it would put himself above Tai Tan)</p><br/>\n</div>"}