{"title": "Chapter 199", "id": 199, "volume": 2, "url": "http://boxnovel.org/douluo-dalu-chapter-199", "volume_title": "Volume 2", "body": "<h1>Chapter 199</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199</p><br/><p>Tang San And Xiao Wu’s Happiness, Engagement</p><br/><p>(TL by Bagelson)</p><br/><p>Tang Xiao looked deeply at Tang San for a long time, then slowly said:</p><br/><p>“Good, good, good, you youngsters really have your own ways. This is something me and your father never thought of back then. You’re right, if you really can return from Sea God Island, you will have truly aroused your potential. Go, I’ll support you.”</p><br/><p>Tang San cautiously said: </p><br/><p>“Uncle, what do we need to pay attention to at Sea God Island?”</p><br/><p>Tang Xiao lowered his voice:</p><br/><p>“Only one thing, don’t kill people at Sea God Island. In fact, the Sea Spirit Masters for the most part have a gentle temperament, even if they reject outsiders, it’s only to the point of driving them out. They won’t kill. But if you kill someone there first, that’s a different situation. The reprisal of the Sea Spirit Masters isn’t something you’re able to endure. Apart from this, be careful with sea spirit beasts. Even though sea spirit beasts are also predisposed towards moderation, there’s absolutely no shortage of vicious ones. Moreover, because it’s very difficult to estimate their level, you have to be prudent. Little San, follow me. Since the elders have already formally recognized your identity, it should also be time to impart some sect secret skills to you. This set of created spirit abilities is something begun by your great grandfather. Even if your Clear Sky Hammer still doesn’t have any spirit rings, with this you’ll still have another ability for protecting yourself.”</p><br/><p>Ten days later. Sunset Forest.</p><br/><p>Xiao Wu calmly leaned within Tang San’s embrace, letting the scenery fly past like lightning. She was unexpectedly sleeping very soundly, both hands holding onto Tang San’s neck, her charming face stuck close to his chest. She seemed completely carried by Tang San, one of his hands supporting her shoulders, the other under her slender jade legs, her neatly combed scorpion braid wrapped around Xiao Wu herself.</p><br/><p>The Eight Spider Lances spurred Tang San swiftly through this dense forest. Tang San’s memories of the surroundings here were really too profound. He could clearly make out the direction he was heading in without even using his eyes.</p><br/><p>Having arrived in a place as full of Blue Silver Grass as this forest, Tang San was like a bird in the sky, a fish in the sea. If the great ocean could be called the paradise of Sea Spirit Masters, then the forest was absolutely Tang San’s domain. If he encountered Qian Renxue within the forest, Tang San was absolutely sure he could defeat her. Because this was his world.</p><br/><p>Relying on the mental connection between the Blue Silver Domain and the surrounding Blue Silver Grass, Tang San could clearly differentiate the formidable spirit beasts around him, and could easily move past them, advancing smoothly, basically without encountering any trouble. Even if he did encounter some spirit beast on the road, Tang San relied on the effect of the Blue Silver Domain to make his aura identical to Blue Silver Grass, wrapping himself up in it without drawing the attention of any of those spirit beasts.</p><br/><p>One leap of Eight Spider Lances would bring the two at least ten meters away. Tang San bowed his head to look at Xiao Wu in his arms, and he couldn’t keep from revealing a faint smile,</p><br/><p>“Silly girl, we’re going to see your parents in law. You might be the least nervous person in the world to face their in laws for the first time.”</p><br/><p>His smile was filled with pampering love, his heart long since swollen full of tenderness. Even though he hadn’t left for long, Tang San increasingly missed his parents. He had already planned it out, once Spirit Hall was destroyed in the future, and he’d taken revenge for his parents and Xiao Wu, he’d bring Xiao Wu to settle down here, and accompany his parents.</p><br/><p>Under the effect of the Ice and Fire Yin Yang Well, the time for his mother’s recovery would be substantially reduced, but even so, whether his father could see her alive in his lifetime was unknown. But no matter what, he would accompany his father to wait. He believed his mother would definitely come back to life one day. At that time, finally, their family could truly reunite.</p><br/><p>Eventually, that mountain came into view, and Tang San accelerated like an arrow returning home. The Eight Spider Lances abruptly bent, and when they shot out they he was pushed several dozen meters in the air. The Blue Silver Emperor Right Leg Bone Flying ability launched, and the moment the momentum from the Eight Spider Lances leap vanished, the flying ability began, bringing him shooting towards the peak like an arrow. Protected by Tang San’s Blue Silver Domain, whether the poison Dugu Bo once arranged or the atmosphere of the Ice and Fire Yin Yang Well, neither could harm Xiao Wu.</p><br/><p>In fact, even Xiao Wu’s own body was now also capable of completely blocking the Ice and Fire Yin Yang Well. The two great immortal herbs didn’t just help her recover her human form.</p><br/><p>The peculiar atmosphere caused by the Ice and Fire Yin Yang Well shook Tang San’s mind. As far as the eye could see, the plants growing next to that extraordinary pond were even more lush.</p><br/><p>A one-armed one-legged man just stood there, gentle eyes just gazing in their direction.</p><br/><p>“Dad.”</p><br/><p>Tang San shouted, somewhat forgetting his appearance, rousing Xiao Wu in his embrace. The Eight Spider Lances on his back withdrew, and relying on the Blue Silver Emperor Right Leg Bone’s flying ability, Tang San turned into a meteor, dropping from the sky holding Xiao Wu, landing just in front of his father.</p><br/><p>Tang Hao seemed no different from before, still with disheveled hair and beard, one arm and single leg. But the light in his eyes seemed a lot more gentle than when Tang San left.</p><br/><p>Tang San’s gaze flitted past his father’s face, falling on his mother behind him. In the less than a year that he’d been gone, the Blue Silver Emperor had already grown strong and healthy. The giant blades of grass were already close to a chi wide, and more than five meters long. The one golden vein on top had turned into three. At the same time as Tang San landed, practically all the blades waved, swiftly extending to him and Xiao Wu, gently winding around and wrapping them up.</p><br/><p>Gentle and kindly maternal love filled Tang San and Xiao Wu for a moment. Tang San turned completely dumbfounded, tears flowing uncontrollably. But these were no longer tears of sorrow, but rather tears of joy.</p><br/><p>Xiao Wu was also a bit stunned, blinking her big eyes, watching those wide blades of grass winding around her as well, her soulless eyes unexpectedly reddening gradually.</p><br/><p>Tang San could clearly sense that his mother’s recovery speed was even faster than he had imagined, in just less than a year, he could feel that his mother’s current aura wasn’t much different from a plant type spirit beast of the several thousand years level. What made him most astonished was the intelligence the Blue Silver Emperor showed. Very clearly, his mother was conscious. Her soul still existed. These circumstances were completely opposite from Xiao Wu.</p><br/><p>Judging by his mother’s current circumstances, Tang San immediately judged that his mother absolutely couldn’t recover this fast just from the effect of the Ice and Fire Yin Yang Well. Her body itself being a plant type hundred thousand year spirit beast, the seemingly rousing effect of the Ice and Fire Yin Yang Well, as well as the his own blood as fertilizer back then. His mother grew with astonishing speed. If it continued at this rate, then there would be a year in his father’s life when the family could be reunited.</p><br/><p>Tang Hao smiled, very gently, without a bit of the aggressiveness of the previous Clear Sky Douluo, as if washed clean,</p><br/><p>“Your mom is very happy you’ve returned. She’s welcoming you.”</p><br/><p>“I know, I know.”</p><br/><p>Tang San’s said, his voice choked with emotion.</p><br/><p>Tang Hao raised his remaining hand, wiping away the tears on Tang San’s cheek,</p><br/><p>“What are you crying for, you should be happy.”</p><br/><p>Tang San hurriedly wiped his tears, nodding forcefully,</p><br/><p>“Yes, I should be happy. Dad, mom is recovering much faster than I imagined. I believe she will definitely return to her previous form.”</p><br/><p>Tang Hao’s eyes shone,</p><br/><p>“I firmly believe so too. Little San, do you know? The time you’ve been gone has been the happiest time of my last twenty years. Seeing your mom constantly grow each day is what makes me the most satisfied. After so many years have passed, we can finally be together. Even though there should be no words of thanks between father and son, the place you found for your mom……”</p><br/><p>At this point, he clapped Tang San’s shoulder hard. Father and son looked eye to eye, and there were no words.</p><br/><p>The Blue Silver Emperor withdrew from Tang San and Xiao Wu, only leaving one strand behind, softly caressing Xiao Wu’s head, the leaf softly swaying. Tears kept falling from Xiao Wu’s eyes, and a sorrowful mood began to exude from the Blue Silver Emperor.</p><br/><p>Tang San knew that his mom had already realized Xiao Wu’s situation.</p><br/><p>Tang Hao and his wife had a close relationship, and his gaze immediately fell on Xiao Wu, sighing,</p><br/><p>“Not long ago, me and your mom both felt you were in danger. Xiao Wu……”</p><br/><p>On mention of Xiao Wu, the tears Tang San had just stopped threatened to fall again. Pulling that tender body close, Tang San recounted what had happened since he left.</p><br/><p>When Tang Hao heard that Xiao Wu had used Sacrifice for Tang San’s sake, his originally missing ruthlessness and aggressiveness appeared once again, clenching his fists tightly. And each leaf of Blue Silver Emperor shuddered fiercely, as if weeping soundlessly.</p><br/><p>Tang San again spoke in detail of his later encounters, founding the Tang Sect, as well as everything that happened afterwards.</p><br/><p>Having listened to Tang San, Tang Hao’s expression gradually relaxed. Looking at Tang San, then again looking at Xiao Wu in his arms,</p><br/><p>“In dealing with these events, you are stronger than I was. Treat the four single attribute clans well, back then it was I who implicated them. Little San, I’ll let you bear all the sins I’ve committed…...”</p><br/><p>He didn’t continue speaking, but the guilt in his eyes made Tang San’s heart ache. Had his father really done something wrong? No, if it was him back then, he would definitely make the same choice.</p><br/><p>“Dad, I’m your son, and you haven’t done anything wrong.”</p><br/><p>He spoke resolutely and decisively, without comforting. Just this sentence made Tang Hao’s expression relax a lot. His son could understand him, what was more important than that?</p><br/><p>Tang San’s gaze turned to his mother,</p><br/><p>“Dad, mom, don’t worry, I’ll definitely resurrect Xiao Wu. However, I’m afraid I won’t be able to see you for a long time. Coming back this time, is also because I wanted to ask you to agree to something.”</p><br/><p>Tang Hao stared blankly a moment,</p><br/><p>“What thing?”</p><br/><p>Tang San looked at Xiao Wu next to him, his eyes soft,</p><br/><p>“Mine and Xiao Wu’s marriage. I want you to witness my engagement to Xiao Wu. Once she has recovered completely, we’ll immediately marry. I ask for your approval.”</p><br/><p>While speaking, he pulled Xiao Wu along to kneel in front of his parents.</p><br/><p>Tang Hao looked somewhat astonished at his son, but his aged face very quickly filled with a smile,</p><br/><p>“Good, good, good. Xiao Wu is a good child. To marry a wife like this is your blessing. We approve, we approve.”</p><br/><p>Seeing at Xiao Wu’s vacant expression, Tang Hao couldn’t keep his eyes from moistening. Even though Tang San hadn’t described what happened to him and Xiao Wu in the Star Dou Great Forest very closely, how couldn’t he imagine the bitterness that had befallen these two children? He had also gone through such experiences, and could now even more relate to the feelings between his son and Xiao Wu.</p><br/><p>Two strands of Blue Silver Emperor quietly swept up, each pulling on Tang San and Xiao Wu’s hands, then folding their hands together, wrapping them up firmly. Gentle and kindly feelings once again filled Xiao Wu and Tang San’s vicinity, surrounding them.</p><br/><p>Just at this moment, blue golden light flashed around Tang San, six spirit rings silently filling his surroundings. That dazzling red sixth spirit ring quietly flashed, a ling of red light sweeping out, disappearing into Xiao Wu, and her vacant eyes immediately regained their expression.</p><br/><p>This time, Tang San didn’t suppress Xiao Wu’s soul from coming out. The two looked eye to eye, simultaneously saluting Tang Hao and Ah Yin.</p><br/><p>Tang Hao laughed out loud, his single hand folding over Tang San and Xiao Wu’s joined palms, pulling them up,</p><br/><p>“With such a daughter in law, what else could I ask for? Little San, in the future you must properly look after Xiao Wu. From now on she is your fiancée.”</p><br/><p>Big teardrops rolled down Xiao Wu’s face. The soul temporarily returned to her body throbbed violently, softly calling out two words,</p><br/><p>“Dad——, mom——”</p><br/><p>A strand of Blue Silver Emperor rose, trembling softly landing in front of them. With just the soft trembling of that wide Blue Silver Emperor leaf, a golden thread slowly fell off the leaf, twisting around Tang San and Xiao Wu’s fingers as if alive. Tang San’s was on his left middle finger, Xiao Wu’s on her right.</p><br/><p>Golden light flashed, and with intense light and brimming with gentleness, the golden threads turned into golden rings, each covering their fingers.</p><br/><p>Tang San and Xiao Wu looked shocked at those golden lights constantly giving them a wondrous feeling. Just at this instant, they suddenly had a feeling of their minds connecting. It seemed as if their souls had been linked together by this fantastic golden thread, never to separate.</p><br/><p>Tang Hao looked smiling at his son and daughter in law,</p><br/><p>“This is your mom’s wedding present for you. Dad doesn’t have anything to give you, but I will always wish you well here together with your mom. Xiao Wu, get well soon. We will both wait for the day you truly can become our daughter in law.”</p><br/><p>Xiao Wu fiercely threw herself into Tang San’s embrace, holding him tightly, sobbing voicelessly.</p><br/><p>Even though it still wasn’t perfect, he and she could finally be together properly. Those golden rings symbolized their feelings. At this moment, all the plants around the Ice and Fire Yin Yang Well seemed to dance cheerfully, blessing these lovers.</p><br/><p>……</p><br/><p>Seven Treasure Glazed Tile School.</p><br/><p>“School master, are you really going to agree to Rongrong going with Tang San and the others?”</p><br/><p>Bone Douluo frowned tightly.</p><br/><p>Ning Fengzhi nodded,</p><br/><p>“Grandmaster is right. For us right now, it’s practically impossible to fight Spirit Hall, and it’s impossible for us to become the core of the opposition against Spirit Hall. But the Shrek Seven Devils are different. These seven children, including Rongrong, all have blessed talent. Only if they truly mature will we have the chance to oppose Spirit Hall’s power. If they always grow beneath our wings, they will be unable to soar to the ninth heaven. The Shrek Seven Devils complement each other, and their feelings surpass even siblings.”</p><br/><p>Sword Douluo Chen Xin nodded, saying:</p><br/><p>“School master’s decision is correct. Rongrong is already at the sixtieth rank. Within the Seven Treasure Glazed Tile School, she also counts as a power. Even though her spirit has advanced to the Nine Treasure Glazed Tile Pagoda, whether it can truly possess the strength of the Nine Treasure Glazed Tile Pagoda is still up to her. She already proved the school master’s decision was correct back when she cultivated at the Shrek Academy. These seven youths together, might very possibly become seven future miracles.”</p><br/><p>Bone Douluo smiled wryly:</p><br/><p>“I don’t want to part with Rongrong! In our Seven Treasure Glazed Tile School, only this one scion is entitled to inherit the future post as school master.”</p><br/><p>Ning Fengzhi resolutely said:</p><br/><p>“Uncut jade won’t make a tool. I don’t want to part with my daughter either, but by keeping her here, won’t the Seven Treasure Glazed Tile School fall? Even if I don’t want to admit it, we’re already declining. Heaven Dou Empire is already a bit wary of our existence. Whether the sect can be restored doesn’t lie with us, but rather with Rongrong. When the nine lights of the Nine Treasure Glazed Tile Pagoda blooms, that is the moment when our Seven Treasure Glazed Tile School evolves, and steps back into the Spirit Master world.”</p><br/><p>……</p><br/><p>One man and one woman, two youths stood silently in front of Shrek Academy’s great gates. The two looked at each other, a difficult to conceal excitement revealed in their eyes.</p><br/><p>“Mubai, I’ve always wanted to ask. How did you persuade your imperial father to let you bring me with you?”</p><br/><p>The young woman with angelic face and devilish figure spoke softly.</p><br/><p>The youth smiled slightly,</p><br/><p>“I told my imperial father, that if I can’t return alive, the throne will be succeeded by my big brother. If I can return alive, then that will be the moment we can officially move against Spirit Hall. There are even deeper benefits to our Star Luo Empire and the imperial family. If not for my big brother, father wouldn’t let me leave. But now it’s different. Rather than say that he let me leave, it’s more accurate to say that he hopes I can return. Return after becoming strong.”</p><br/><p>This young man and woman, if they weren’t Shrek Seven Devils boss Evil Eye White Tiger Dai Mubai and youngest Hell Civet Zhu Zhuqing, then who?</p><br/><p>After receiving Grandmaster’s letter, Dai Mubai had persuaded his father, Star Luo Empire’s current emperor, and brought Zhu Zhuqing to rush here day and night.</p><br/><p>Listening to Dai Mubai, Zhu Zhuqing couldn’t help giggling,</p><br/><p>“You’re actually talking so pompously. Don’t I know you?”</p><br/><p>Dai Mubai winked, his double pupiled evil eyes glinting, looking at Zhu Zhuqing’s expression like a smile yet not a smile, and helplessly said:</p><br/><p>“I knew I couldn’t hide it from you. Fine, I surrender. I admit that coming this time is even more for selfish motives. Don’t tell me you don’t want to meet everyone again? Us Shrek Seven Devils can travel together again. Fight together, grow together, how perfect is that! In those years together with everyone at Shrek Academy, even though we constantly fought, that time was still the happiest time of my life. Honestly, if it wasn’t for my own safety, I really wouldn’t care about fighting for the throne. The vicious intrigues of the imperial family doesn’t suit me. I’m more interested in laughing defying mountains and forests with my brothers. Grandmaster’s letter mentioned that fellow little Ao returned as well. Haha, I don’t know what level that fellow has cultivated his great sausage to. Only Xiao Wu……”</p><br/><p>Grandmaster’s letter had simply recounted what had happened in this time, and so even though they weren’t there, they still had some understanding of everything that happened in the Heaven Dou Empire.</p><br/><p>Zhu Zhuqing sighed,</p><br/><p>“It’s hard on third brother. However, I believe Xiao Wu will definitely resurrect. Even Heaven itself shouldn’t have the heart to break them apart.”</p><br/><p>Dai Mubai rubbed Zhu ZHuqing’s head,</p><br/><p>“Come on, we’ll go inside. I don’t know if everyone’s here.”</p><br/><p>Speaking of the devil, at this time Ma Hongjun, Ning Rongrong, and Oscar really were at the Shrek Academy. On the verge of leaving for Sea God Island, Grandmaster was just giving them pointers for cultivation. In these past years, each of the Shrek Seven Devils had grown, and the one that had changed the most was Oscar. After Oscar gained the Mirror Image Skull Bone and the Great Mirror Image Sausage, the team’s overall strength had improved enormously. At the same time he could also become the link of the Shrek Seven Devils. As long as he prepared a bit in advance, everyone of the Shrek Seven Devils could use each other’s strength through the mirror image sausages. Even if it was impossible to use it to the same extent as Oscar, just one part was enough to change many things.</p><br/><p>Sea God Island was an unknown world to the Shrek Seven Devils, and Grandmaster exploited this final time mainly to toughen Ning Rongrong and Oscar’s cooperation with the others. And Ma Hongjun was mainly improving his already extremely frightening burst attack power.</p><br/><p>Besides the three of them Grandmaster this time also taught one more person.</p><br/><p>“Damn Fatty, get away a bit. Are you deliberately getting in my way?”</p><br/><p>Bai Chenxiang kicked Ma Hongjun’s butt, in a spitting rage.</p><br/><p>Ning Rongrong and Oscar snickered to the side. Very clearly, they didn’t have any intent of speaking up. Seeing Bai Chenxiang purely oppress Ma Hongjun every day was easily very pleasurable. And the unfortunate Ma Hongjun didn’t dare offend them, for fear that they would mention his past indiscretions.</p><br/><p>Ma Hongjun said wronged:</p><br/><p>“How would I suddenly block you? This is walking normally for me! Xiangxiang, you can’t accuse me wrongly. Say, why are you always kicking my butt, what if it breaks?”</p><br/><p>Bai Chenxiang snapped:</p><br/><p>“Your butt is so fat, how could it break from some kicking? Thick skin and deep meat. Humph, you’re doing it on purpose. You’re fully aware how fast I am, but just now you were still in my way, how isn’t that deliberate?”</p><br/><p>Ma Hongjun said wronged:</p><br/><p>“Isn’t this because I was worried you’re be injured? You don’t know, that fellow little Ao is terribly cunning. Just now he used the mirror image sausage made from third brother’s blood again, and with Rongrong’s support. You were bravely charging past, and would very possibly be trapped.”</p><br/><p>Bai Chenxiang looked very doubtfully at Ning Rongrong and Oscar,</p><br/><p>“Sister Rongrong[1], is that true?”</p><br/><p>Ning Rongrong bent over giggling, saying:</p><br/><p>“Xiangxiang, Fatty really wasn’t blocking you deliberately. Third brother’s spirit mainly relies on control power. Even though you’re fast, if you ran into third brother’s spirit ability great web, you shouldn’t think about escaping.”</p><br/><p>The effects of the mirror image sausage Oscar just used still hadn’t disappeared. With a flick of his right hand, a ball of yellow green light flew out, abruptly spreading out in the air, flying straight at Ma Hongjun.</p><br/><p>Fatty’s eyes shone, a line of golden red flame abruptly jetting from his mouth, immediately blocking the spread open spider web. Immediately afterwards, with a shake of his body, two giant phoenix wings abruptly unfolded from his back, he swept past, and that spider web instantly turned to ash, his whole body leaving behind a dazzling image of flame in the air. The Blue Silver Emperor Oscar used wasn’t after all the one Tang San used. Even though it was flame resistant, Oscar didn’t have that power in his blood, and his mirror image sausage used just a drop of Tang San’s blood. But meanwhile Fatty’s phoenix flame had already reached an extremely abnormal level, breaking the spiderweb restraint in one move.</p><br/><p>Bai Chenxiang stuck out her tongue at the immensely self satisfied Ma Hongjun, disdainfully saying:</p><br/><p>“Since you like showing off, go make up a sideshow.”</p><br/><p>Ma Hongjun couldn’t help himself,</p><br/><p>“Xiangxiang, don’t always needle me, alright? We’re training here, raising our strength, if you’re dissatisfied with me, why not wait until after getting back home?”</p><br/><p>Bai Chenxiang’s eyes opened wide,</p><br/><p>“Damn Fatty, you’ve even learned to argue? I’ve told you so many times, don’t call me Xiangxiang. Also. what are you talking about back home? Are we family?”</p><br/><p>Ning Rongrong whispered by Oscar’s ear:</p><br/><p>“Fatty’s really met his nemesis this time. This girl Xiangxiang’s little mouth really is sharp!”</p><br/><p>Oscar lowered his voice:</p><br/><p>“What do you think about Xiangxiang? Does Fatty have a chance?”</p><br/><p>Ning Rongrong said:</p><br/><p>“I don’t know if he does, it depends on Fatty’s own ability. Back when we just met, how could we know we would be together? However, I can be sure that Xiangxiang is very kind hearted. Even if she’s a bit wilful, she’s a lot better than I was.”</p><br/><p>Oscar grinned,</p><br/><p>“Yeah! How can she compare to you? Back then you were the little she-devil of the Seven Treasure Glazed Tile School, even Title Douluo like grandpa Gu and grandpa Sword were a bit afraid of you.”</p><br/><p>Ning Rongrong gave him a rebuking glare, lightly pinching the soft meat at his waist,</p><br/><p>“You villain, keep teasing me and I’ll……”</p><br/><p>Oscar lightly raised a hand to touch Ning Rongrong’s tender face,</p><br/><p>“You’ll what?”</p><br/><p>Ning Rongrong blushed, and in her shyness didn’t think it through, blurting out:</p><br/><p>“I won’t let you touch.”</p><br/><p>Once she said it, she became aware that she’d misspoken, and her charming face instantly grew crimson. Oscar, joyfully satisfied, laughed loudly,</p><br/><p>“I’m so afraid.”</p><br/><p>“You……”</p><br/><p>Ning Rongrong raised her foot to kick Oscar’s butt just like Bai Chenxiang did to Ma Hongjun, but that vulgar fellow Oscar deliberately stuck his butt out, his beak spouting,</p><br/><p>“So pleasurable, so pleasurable.”</p><br/><p>Even if Ning Rongrong was angry, she still couldn’t help laughing.</p><br/><p>Bai Chenxiang stood off to the side glaring wide eyed at them. Ma Hongjun had at some point already snuck over next to her, saying in a low voice:</p><br/><p>“Have you ever seen such a vulgar, lowly fellow?”</p><br/><p>Bai Chenxiang subconsciously nodded, and Ma Hongjun hastily said:</p><br/><p>“Among us Shrek Seven Devils, in terms of moral quality, my third brother is undoubtedly number one. However, I’m not far behind third brother either. We’re both good men with single-minded devotion. Even if little Ao is a bit lowly, his moral standing is still very good. You don’t know all that happened between him and Rongrong. The stories within can be considered winding and strange. Later, I’ll tell you the stories about us Shrek Seven Devils back then.”</p><br/><p>“Fine!”</p><br/><p>Bai Chenxiang subconsciously agreed. She had also heard a lot of stories about the Shrek Seven Devils from the side, especially since coming to Shrek Academy. When the students here looked at Oscar, Ma Hongjun, Ning Rongrong and the others, the respect in their eyes couldn’t be concealed. Even the teachers here were polite to them. Bai Chenxiang had also heard about the Shrek Seven Devils defeating all the great academies back then, finally becoming the undisputed Continental Advanced Spirit Master Academy Elite Tournament champions. But her knowledge was only superficial.</p><br/><p>When Ma Hongjun saw Bai Chenxiang agree, he couldn’t help getting beside himself with joy,</p><br/><p>“Then tonight I’ll come to your room, and tell you some old stories.”</p><br/><p>“To my room?”</p><br/><p>Bai Chenxiang reacted now, slowly turning her head, looking at the very close to her, already showing signs of drooling, Ma Hongjun.</p><br/><p>She smiled a beautiful smile, immediately as if a hundred flowers bloomed, and Ma Hongjun couldn’t help being somewhat stunned.</p><br/><p>“Stinking rogue, damn lecher. In your dreams.”</p><br/><p>Abruptly exploding, Bai Chenxiang suddenly pinched Ma Hongjun’s ear, forcefully twisting it one hundred eighty degrees. The aching Ma Hongjun screamed, the beautiful thoughts in his heart dashed to pieces.</p><br/><p>Oscar pulled Ning Rongrong close, sighing softly,</p><br/><p>“It seems Grandmaster’s proposal was correct. The pressure we currently face is too little. With everyone together we can all be happy each day, but without pressure, our cultivation momentum is also substantially less than before. Ever since returning to see you, honestly speaking, my mind hasn’t been on cultivating, only thinking about accompanying you, being by your side, nothing more important.”</p><br/><p>Ning Rongrong nodded, saying:</p><br/><p>“Me too. I hope that in our trip to Sea God Island this time, we can accelerate our growth under the pressure.”</p><br/><p>Oscar smiled slightly, saying:</p><br/><p>“Actually, I know you wish even more for our current life. But, you’re the future Seven Treasure Glazed Tile School successor. I will do my utmost to help share your burdens. Moreover, this time us Shrek Seven Devils can also finally meet again. With everyone together, our cultivation will be happy no matter what pressure we face. We can all trust our backs to our comrades. That’s a lot happier than my time in the north.”</p><br/><p>Ning Rongrong giggled, saying:</p><br/><p>“Yeah, we can be together again. Such a feeling really is good. Having gone through so much wind and rain, we’ve all grown up.”</p><br/><p>“Oh! Rongrong’s grown up, haha. Little Ao, you lowly person, even you’re ready to come back! Do you know how many tears Rongrong’s shed for you?”</p><br/><p>Oscar had just turned around when he was embraced by a majestic person. Of course, it was just an enthusiastic hug, but that force alone was enough to make his bones creak.</p><br/><p>“Boss Dai, can’t you be a bit gentler?”</p><br/><p>Oscar looked with a wry smile at Dai Mubai who had already let go.</p><br/><p>Four eyes met, and the two couldn’t help smiling. Among the Shrek Seven Devils, the first to meet were these two and Ma Hongjun. When they had gone flirting and chasing girls in those days, these two fellows had cooperated a lot. They just had different styles.</p><br/><p>Dai Mubai forcefully clapped Oscar’s shoulder,</p><br/><p>“It’s good that you came back alive. Haha, you’re disfigured. Very good, I’m finally more handsome than you.”</p><br/><p>Oscar snorted,</p><br/><p>“Even then you’re still not the most handsome, don’t forget about little San.”</p><br/><p>Dai Mubai grinned:</p><br/><p>“Who would compete with someone inhuman? I’m satisfied being more handsome than you.”</p><br/><p>Zhu Zhuqing said a few sentences in a low voice next to Ning Rongrong’s ear, and Ning Rongrong’s face immediately turned crimson again, furtively glancing at Oscar, than softly nodding to Zhu Zhuqing.</p><br/><p>Bai Chenxiang looked somewhat curiously at them. Even an outsider like her could feel the strong brotherly bonds in the simple exchange between Dai Mubai and Oscar.</p><br/><p>Ma Hongjun said:</p><br/><p>“This fellow in need of glasses is the boss of our Shrek Seven Devils, Evil Eye White Tiger Dai Mubai. That beauty is the youngest among us, Hell Civet Zhu Zhuqing. Among us seven, boss Dai’s strength is second only to third brother. Only, if it’s him and Zhuqing together, even third brother would be a bit inferior.”</p><br/><p>“Damn Fatty, who did you say has eye problems?”</p><br/><p>[1] Sister Rongrong - Chenxiang adresses Rongrong as () an older sister.</p><br/>\n</div>"}