{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204</p><br/><p>Tang Sect’s Number Four, Thousand and One Nights</p><br/><p>Once the Cyan Wolftaken appeared, those normal grey Wolftaken not only did not stop their attack, rather they became even more ferocious, which helped Tang San take notice of them. In this chaotic environment, if not for his Blue Silver Domain, it would really have been hard to notice their existence.</p><br/><p>Dai Mubai suddenly turned his body, releasing a burst of his White Tiger Light Wave which happened to meet with one of those Cyan Wolftaken’ surprise attack.</p><br/><p>Those Cyan Wolftaken were much bigger than the normal Wolftaken, yet were still very agile. When facing Dai Mubai’s attack one very quickly lowered his body, releasing an illusory light: it was as if it was sliding along the ground as it evaded Dai Mubai’s attack.</p><br/><p>When its body once again rose, it was already in front of Dai Mubai. Its two front claws swung at him in an upward movement, releasing a green crescent-shaped blade of light as if trying to disembowel Dai Mubai.</p><br/><p>Ma Hongjun and Tang San also faced the simultaneous attack: the Cyan Wolftaken attacking Ma Hongjun charged directly at him as he picked up speed, practically transforming itself into a green after-image. The timing of the attack was brilliant, just as Ma Hongjun unleashed the phoenix flames in his wings to attack two of the ordinary Wolftaken he revealed several weaknesses. Desperately, Ma Hongjun could only withdraw his wings with his hands, thrusting them in front of him as he received this blow.</p><br/><p>Strangely, as the Cyan Wolftaken was about to collide with the Phoenix Wings, it seemed to defy all law as it stopped mid air, and the giant Wolftaken suddenly arched backwards. As if transforming into a bow pulled taut like a full moon, its two front paws crossed above its head causing an explosion of green light which transformed into a two meter long blade of light furiously charging towards Ma Hongjun.</p><br/><p>The Cyan Wolftaken attacking Tang San was the biggest of them, and was significantly larger than the other two, with its eyes completely green. Silently pouncing towards Tang San’s back, it was the first amongst the three to attack, which was why Tang San only had time to alert Dai Mubai and not Ma Hongjun.</p><br/><p>Under its sprint, the cold green forest glow coming from it seemed to render its whole body transparent. Its method of attack was also different from the other two, rather than slashing out with blades of light from its claws, it opened its mouth about three meters away from Tang San and spat out a ball of green light which instantly enveloped Tang San’s body.</p><br/><p>The moment it started moving, Tang San had already realised. However, the pressure from the full frontal assault from the other wolves was too large, as they were all manically lunging at him without fear of death.</p><br/><p>A glint of coldness flashed on Tang San’s face. With both hands folded in front of him, just as the attack from the back was about to reach him, he had already disappeared into thin air. The green ball of light passed through where he was before and collided with two other Wolftaken instead. On those wolves there was all of a sudden another layer of green as they violently convulsed and coughed out blood, and not just blood but rather their innards: from the looks of it they would live no more. Their sturdy bodies were actually instantly destroyed by that green ball.</p><br/><p>When Tang San reappeared, it was just above the head of this huge Cyan Wolftaken. Like the saying goes, friendship cannot stand always on one side, Tang San’s body quietly descended and his Eight Spider Lances stabbed towards the Cyan Wolftaken, thirsting for its blood.</p><br/><p>However, that Cyan Wolftaken reacted extremely quickly, and when Tang San pierced it with its Eight Spider Lances he realised he had only managed to catch the afterimage left behind by the Cyan Wolftaken. Suddenly, a large force collided with him from the side, forcing him to withdraw his Eight Spider Lances and sending him tumbling away in the air. That impact made the blood in in his chest rumble.</p><br/><p>And this was only because his body was already extra sturdy, and was somewhat protected by his Eight Spider Lances: if it was any other normal spiritmaster, taking a blow like that would have sent him half to death.</p><br/><p>Tang San inwardly cursed himself for being careless: as he was tumbling in the air, he once again activated his teleport ability, dodging the dozens of green Wind Blades sent his way by the Cyan Wolftaken, and fell to one side. These Wind Blades released by the Cyan Wolftaken was not as simple as that of the other normal Wolftaken.</p><br/><p>The Wind Blades released by the other Wolftaken were no more than a foot long with a width not exceeding three inches. However, in the case of this Cyan Wolftaken, the Wind Blades released were in terms of thickness already over a foot thick, their length over a meter, and the accompanying power was also on a completely different level, whistling through the air as it cut into shreds all the the plants and vegetation it flew across.</p><br/><p>The situation at Tang San’s side was not good, but the same could be said for Dai Mubai and Ma Hongjun. Dai Mubai, after releasing his White Tiger Flash, never expected that the enemy he had already locked onto would evade his attack from below, and at this point in time he had already shifted his focus back onto another normal Wolftaken, tearing open its chest with a palm strike.</p><br/><p>Facing the upwards slicing blade of light from his opponent, he could only choose to try and block it head on, his two tiger palms striking out against the attack of the Cyan Wolftaken.</p><br/><p>In a bang, the Cyan Wolftaken was sent flying back, but Dai Mubai also did not come off scot-free. He was in a bad shape as his skin was ripped apart by the green Wind Blade. Even with his White Tiger Barrier and White Tiger Vajra Shelter, his internal organs were still injured by the invasion of that sharp energy, the pain giving him no choice but to fully release his Spirit Power.</p><br/><p>He could clearly tell that although this Cyan Wolftaken’s spirit power was inferior to his, it was close to his when he was at the fifties rank. However, the main problem was that he did not understand its abilities at all, and what’s more he was being surrounded by so many normal Wolftaken, forcing him to participate in this bitter struggle.</p><br/><p>On the other side, Ma Hongjun’s situation was equally dire. The Cyan Wolftaken that had attacked him released even more power: with a ear-piercing screech, Fatty’s phoenix wings were sliced half-way through, although some of his phoenix flames stuck onto his opponent’s front legs, he still took some internal damage from the attack in addition to the pain coming from his arms which felt as if they were broken.</p><br/><p>The three Cyan Wolftaken sneak attack was undoubtedly successful, even Tang San and Dai Mubai who knew about it took some injuries, while Ma Hongjun had it even worse off.</p><br/><p>The Cyan Wolftaken which was tagged by the phoenix flame reacted very quickly, as its paws flashed with a sharp glint. Immediately, it had cut off the fur caught ablaze by the flame: astonishingly, its blood was also green.</p><br/><p>The three Cyan Wolftaken naturally had no intention of letting the Tang San trio off. Currently they had formed an encirclement around them along with the other normal Wolftaken, that were not crazily attacking them like before: rather they were feinting and only occasionally sneaking in an attack, while the three Cyan Wolftaken focused fully on attacking the Tang San trio.</p><br/><p>Dai Mubai’s character usually made him stronger as he fought with stronger people. After being successfully hit by the opponent’s sneak attack, he angrily cursed: “Fuck, when I am not showing my power as a tiger, you take me for a sick cat!”</p><br/><p>In his rage, his whole body emitted a golden glow as he charged directly towards the Cyan Wolftaken, his two tiger claws shining with a golden light, releasing a foot long golden blade from each claw.</p><br/><p>Those Cyan Wolftaken seemed to be without a shred of fear. With speed far outmatching Dai Mubai’s they entangled him. In terms of strength, Dai Mubai was by far above these Cyan Wolftaken. But after the exertion from earlier, his Spirit Power had waned: with so many normal Wolftaken encircling them, he also had no choice but to keep some strength in reserve for them. As a result the gap between them had been significantly closed.</p><br/><p>Even so, Dai Mubai’s strength was not something that those Cyan Wolftaken could match. In a few exchanges, they had already been forced back by his Tiger Claws, which left many deep scratches on them.</p><br/><p>But what depressed Dai Mubai the most was how tricky these Cyan Wolftaken were: on many occasions, just as he thought he would be able to disembowel them, their green bodies would glow slightly. This would then nullify most of his attack or even allow them to completely avoid it.</p><br/><p>Ma Hongjun was not as active in attacking, as he was injured from the previous strike, and not lightly. Not only were his internal organs damaged, but his arms had also been deeply cut and badly mutilated. Although he tried to used his phoenix wing attacks again, he was forced back by the opponents nimble strikes.</p><br/><p>Ma Hongjun’s explosive power was undoubtedly very strong but, currently, he was being completely suppressed by his opponents speed, and looked to be in a precarious situation.</p><br/><p>The Cyan Wolftaken attacking Tang San was the most tyrannical amongst them, and was also the largest; its spirit power was also no less than Tang San’s. However, it was fast beyond measure, and its ability to appear illusory was much better than that of the other two Cyan Wolftaken. Although it still could not be compared to Tang San’s Nothingness skill, it still allowed it to be able to evade most of the attacks it faced.</p><br/><p>Noticing that things were not going so well on Ma Hongjun’s side, Tang San knew that they could delay no more and had to swiftly end this fight. These Cyan Wolftaken were by no means weak, but they still were not something he thought much of. Compared to all the powerful people from Spirit Hall he had faced, how could these crude lifeforms even be compared to them?</p><br/><p>His body flashed once more in the air as he activated his teleportation ability, but this time Tang San used it to open up a distance between them. This was the moment to show off the power of the core of the Shrek Seven Devil. The place he had appeared at was near the middle of where Ma Hongjun and Dai Mubai were fighting, equally distanced from both of them.</p><br/><p>His fourth spirit ring shone as black light burst forth, activating his ten-thousand year Spirit Ability, Blue Silver Prison.</p><br/><p>Under the effects of the Blue Silver Domain, each of the abilities of the Blue Silver Emperor gained an immeasurable boost. Between the flashes of light, the opponents Ma Hongjun and Dai Mubai were facing became trapped in a huge Blue Silver Prison. Although they had the ability to appear illusory, it was not enough for them to breakthrough these restraints. What’s more, to play it safe, Tang San had also used his upgraded Death God Domain ability, Death God Assault, together with the Blue Silver Prison.</p><br/><p>A cold frightening gaze shot forth from his spirit into these two Cyan Wolftaken, making them slightly more sluggish and making it even more impossible to escape his Blue Silver Prison.</p><br/><p>Dai Mubai and Ma Hongjun had worked together with Tang San for so long: when Tang San appeared between them, they had already started to gather their powers, and once they had seen their opponents get trapped in that sturdy Blue Silver Prison, they both simultaneously released their strongest attacks.</p><br/><p>White Tiger Meteor Shower descended from the skies, piercing through the gaps left in the Blue Silver Emperor, flying towards the Cyan Wolftaken inside, while Ma Hongjun released the pent up frustration. Earlier, while he was retreating, he had actually been gathering his power waiting for the chance to land a single killing blow on his opponent, but his opponent had been too fast, which gave him no chance to hit. That is why he had been constantly retreating.</p><br/><p>At this time the Cyan Wolftaken had been successfully trapped in Tang San’s Blue Silver Prison, what reason was there to hold back anymore? Releasing his attack even before Dai Mubai, his bloodied right arm shot straight towards the ground below the Blue Silver Emperor.</p><br/><p>Because of the presence of a Spirit Bone, his right arm was much sturdier than the left, and so it was less seriously damaged. His fourth Spirit Ability, Phoenix Cry Sky Strike, activated. When the distorted light along with the earth shaking force appeared under the Cyan Wolftaken’s feet, its fate was already sealed.</p><br/><p>At this time, the surrounding normal Wolftaken could also sense the situation going downhill: immediately they crazily charged towards Dai Mubai, Ma Hongjun and Tang San in an attempt to interrupt Ma Hongjun and Dai Mubai’s attack.</p><br/><p>But, since Tang San had already started to move, how could he give them that chance?</p><br/><p>Woosh---</p><br/><p>The Blue Silver Domain’s power was beautifully displayed, and the Blue Silver Prison variant ability Blue Silver Thrust activated.</p><br/><p>Countless strands of Blue Silver Grass thrusted out, stabbing into the skies. Although the Wolftaken had a sturdy body, under the effects of this Ten-Thousand Year Spirit Ability, especially since it covered a huge area of effect, they had no chance to evade.</p><br/><p>Although Blue Silver Thrust was not enough to really kill them, many had their legs and bodies pierced through, thoroughly injuring all the normal Wolftaken and also stunning them all. Of course there were also about seven or eight of the Wolftaken which had bad luck and had multiple weak spots pierced such as the … … in their lower regions, and so were instantly killed. Although some lived, the suffering they were going through was much worse than being dead.</p><br/><p>Tang San had attacked without warning, and everything just happened so fast that, when the strongest Cyan Wolftaken noticed something was wrong, the other two Cyan Wolftaken had already taken Dai Mubai and Ma Hongjun’s attacks.</p><br/><p>“Aooo” The strongest Cyan Wolftaken let out a howl towards the skies. Rather than trying to save its comrades, it dashed straight towards Tang San, its whole body exuding a dreamlike glow, leaving a long trail of light behind it.</p><br/><p>Although Tang San was fully displaying his powers, he didn’t forget about his own opponent: from the start till now, he had already decided that he had to defeat these three Cyan Wolftaken. Only after they were defeated, would today’s fight here be over.</p><br/><p>As a result, after consecutively using his fourth Spirit Ability twice, his gaze had landed on that strongest Cyan Wolftaken. Seeing it rushing over, Tang San’s eyes instantly turned clear blue.</p><br/><p>Activating his Purple God Light, a violet light shot out.</p><br/><p>The Cyan Wolftaken’s illusory ability was able to negate a large portion of physical attacks: however, Tang San’s Purple God Light was a completely mental attack. How could it be able to evade this? Even if it was even faster, it couldn’t be faster than light. In its rage, this Cyan Wolftaken charged in in a straight line, and so its sturdy body collided head on with the Purple God Light.</p><br/><p>Following a loud bang, the Cyan Wolftaken let out a shrill scream. However it was not actually killed by the Purple God Light, due to its body’s frightening durability and also its unusually strong mental power. After being hit by the Purple God Light, blood spurted out from its nose and mouth and it became temporarily stunned: however, its muscles were still wildly pulsing, just like a spirit ability Tang San had previously seen - Bloodlust.</p><br/><p>No longer holding back, Tang San’s eyes shone with a fierce glare. This Cyan Wolftaken was already so ferocious normally, if it were to be under the Bloodlust effect, then it would be difficult for the three of them to retreat. Although they had the upper hand at the moment, the three of them had exchanged a large portion of their Spirit Power for this situation. If they were not able to destroy the enemy in one fell swoop they would have to bear the consequences of using up such a large portion of their Spirit Power.</p><br/><p>Tang San’s hands moved, as he spread out his arms. At the same time a jade colour appeared between his hands as he pulled out an object shining with a crystalline brilliance from his waist. At this point in time, no one was able to clearly see how his hands were moving anymore. It was as if he grew a thousand arms, and all that could be seen by his side was an afterimage of arms.</p><br/><p>Sparkling lights flew out from Tang San’s body: sharp ones, prickly ones, ribbed ones, curved ones, hooked ones, needle-like ones. Countless hidden weapons exploded forth in all directions from him.</p><br/><p>Flying straight, diagonally, curved or even into each other, it looked as if in an instant a dazzling flower appeared in front of Tang San, those countless hidden weapons rattling as they activated in the air.</p><br/><p>Each one of those hidden weapons seemed to have a pair of eyes, casually flying past all the plants on the forest, each one carrying a white plume behind them as their brilliant luster seemed to light up the whole forest.</p><br/><p>Although the Purple God Light hit the Cyan Wolftaken, it was not enough to hold him for long: just before the Purple God Light hit, it had felt something was amiss, and being the smart Cyan Wolftaken Leader it was, it had activated its Bloodlust ability.</p><br/><p>After the Bloodlust ability was activated, it moved to kill only according to instincts, with no need for much considerations. That is why although it was injured by the Purple God light, it believed that it would be able to crush Tang San’s trio under the Bloodlust effect.</p><br/><p>But just as it restarted moving and the illusory glow covered its body, countless hidden weapons had already covered the skied like a large ball, trapping it completely within with no room to dodge whatsoever. The white plume on each hidden weapon originated from Tang San’s Mysterious Heaven Skill’s internal strength.</p><br/><p>After releasing these hidden weapons, rather than looking exhausted, his face shone with excitement, softly saying to himself: “To die from the fourth ranked Tang Sect Hidden Weapon Technique, One Thousand And One Nights, you can already count yourself lucky. This is no longer hidden weapons, this is loneliness, the loneliness of death.”</p><br/><p>The hidden weapons reached their destination just as Tang San uttered his final word.</p><br/><p>All of them brilliantly landed on target, with each and everyone of them showing a different effect: the piercing weapons ruthlessly penetrating his enemies, the explosive ones loudly exploding, the poisonous ones poisoning them, while those with edges sliced them cleanly. Regardless of which kind of hidden weapon they were, don’t forget they all originated from the Tang Sect.</p><br/><p>One Thousand And One Nights, the ranked fourth technique amongst the delivery of hidden weapons. Surpassing it was only the legendary three. The reason it was number four was not because it lacked power: in terms of skill required, the Thousand and One Nights was the hardest to execute.</p><br/><p>The number of hidden weapons Tang San had launched was precisely one thousand and one, each one also carrying some of his Mysterious Heaven Skill internal energy. Once launched, unless one had the ability to teleport, none would be able to dodge this attack.</p><br/><p>When executing this One Thousand And One Nights hidden weapon technique, the user must first use the Mysterious Heaven Technique to jolt his innards and raise his Spirit Power by threefold. Also the Mysterious Heaven Technique has to be above the sixth level in order to use this technique. What’s more, after using this technique, the user will be weakened for three days before he recovers.</p><br/><p>It had not been long since Tang San had mastered the One Thousand And One Nights. This technique was a combination of various other hidden weapon throwing techniques, which only when mastered could be used in this way. When one first started, he would have to practice throwing with three hidden weapons, individually controlling them to fly straight, diagonally and in an arc, before moving on to work with six objects… twelve objects… all the way till one thousand and one, and only then it could be said that the technique had been mastered.</p><br/><p>Once used, this technique was sufficient to destroy anybody up to thirty percent stronger than the user. The all-round attack combined with the specialised Tang Sect hidden weapons was impossible to block. In the history of the Tang Sect, there had yet to be anyone who lived after facing this technique.</p><br/><p>Of course, the One Thousand And One Nights was not without its flaws, the first being the sheer quantity of hidden weapons required, the second the difficulty in mastering and practicing the technique, and third and last was the excessive drain on the user. This technique was specially used to deal with targets who were extremely fast and could not be normally targeted. Afterall, if you were to shoot in all directions, how could your attack be dodged?</p><br/><p>It was precisely because of these weaknesses that it was ranked fourth, behind Yama’s invitation. But it is without doubt that in Tang San’s previous world the people able to use the One Thousand And One Nights were also inevitably able to use the other few pinnacle hidden weapons.</p><br/><p>Tang San’s Purple God Light was not only used to attack the Cyan Wolftaken, at the same time it was used to buy time for him to prepare his hidden weapons. After already consecutively using twice his ten thousand year spirit ability, if he wanted to display more abilities, in this situation the best choice would be his hidden weapons.</p><br/><p>Of course, he had not originally wanted to showcase his newly mastered One Thousand And One Nights ability: it was only after seeing the Cyan Wolftaken go into the Bloodlust state that he decided to use it.</p><br/><p>After mastering this technique, this was the first time Tang San actually used it. The internal energy generated from his Mysterious Heaven Skill jolting himself had to be quickly released in a few seconds or else it would lose its effect. Tang San had experienced using these secret techniques to synchronise with his spirit abilities, but it had always turned out poorly. Although the extra spirit energy there was when using spirit abilities was good, the sudden, explosive increase in spirit energy made Tang San lose control of the spirit ability, resulting in it being worse than normal. What's more, that secret technique was specially made for the One Thousand And One Nights technique. So when using this technique, all went smoothly. This was Tang San’s first time using the ranked four technique of the Tang Sect. Now, amongst the hundreds of Tang Sect techniques and hidden weapons, he had only not used the first two before.</p><br/><p>Bloodlust caused the blood in Cyan Wolftaken to surge; yet at this point in time, he could only spurt a rain of blood from the innumerable number of wounds on its body. In the face of the One Thousand And One Nights, all that awaited it was death. Practically its entire body was covered by the lonely death brought to it by the One Thousand And One Nights.</p><br/><p>A fierce roar also came from his two sides as Dai Mubai and Ma Hongjun finished their attacks. As the Blue Silver Prison opened, the Wolftaken Dai Mubai faced had been bombarded into a bloody pulp, while Ma Hongjun’s opponent had been thoroughly roasted into charcoal.</p><br/><p>In so many years, Ma Hongjun had never been injured to this degree: the pain coming from his body made him really mad. That’s why, after the Phoenix Cry Sky Strike was over, he immediately followed up with his fifth spirit ability as well.</p><br/><p>Phoenix Meteor Shower.</p><br/><p>Ma Hongjun’s Phoenix Meteor Shower was vastly different from Dai Mubai’s White Tiger Meteor Shower. Firstly, as one was a Ten-thousand Year Spirit Ability and the other was only a Thousand Year Spirit Ability, naturally there was a difference in attack power.</p><br/><p>Fatty’s Phoenix Meteor Shower also had a very big area of effect, and what’s more each of the meteors carried his Phoenix Flame’s offensive power, naturally making it even more horrifying.</p><br/><p>Hearing a loud cry, these Wolftaken tangled by the Blue Silver Thrust became bathed by the Phoenix Meteor Shower. What good outcome could one still expect for them?</p><br/><p>After this round of attacks, the living Wolftaken were less than a third of the original, all of which were already quite heavily injured.</p><br/><p>Tang San would not give them the chance to escape, although he was already starting to show signs of going into a weakened state. He still once again used the Blue Silver Domain’s evolved Binding ability, trapping these remaining injured wolves. The following events transformed into a one sided massacre.</p><br/><p>The one doing the massacre was not Tang San nor was it Dai Mubai, rather it was Fatty, whose eyes were red with flames of anger, crazily charging out, fighting with those Wolftaken for their lives.</p><br/><p>Only after the fight was over did Tang San and Dai Mubai see that the wound on Fatty’s left arm was bone deep. Standing there, panting, he ate two of of Oscar’s recovery sausages, with his whole upper body covered in blood after he incinerated the last Wolftaken.</p><br/><p>In fact, all three of them could be considered to be covered in blood: of course most of it belonged to the enemy. At this point, Tang San’s weakness could already be seen as he fell onto the ground panting. Amongst the three of them, the person in the best state was Dai Mubai, although he looked just as exhausted as his comrades.</p><br/><p>Dai Mubai did not rest and went to check the corpses of the remaining wolves, making sure that they would not be ambushed by those playing dead as they left.</p><br/><p>However, there were definitely no Wolftaken who survived: with attacks as fierce as theirs, these Wolftaken naturally had no chance to survive. Especially that Cyan Wolftaken which attacked Tang San. If they were to be classified according to spirit ranks, that one had to have at least twenty thousand years of cultivation, its level of cunning was not something a ten thousand year old beast could match.</p><br/><p>After checking, Dai Mubai Finally returned to sit at Tang San’s side: other than those confirmed to be dead, he made sure to trample on all the other bodies making sure of their demise.</p><br/><p>Ma Hongjun had also walked back to Tang San’s side. The three of them sat there with their backs to each other, slowly eating Oscar’s Recover Sausages to recover strength.</p><br/><p>Dai Mubai bitterly smiled: “Who knew that this fight would be so difficult.”</p><br/><p>Tang San replied: “I had underestimated them, I didn’t expect that amongst the Wolftaken such powerful green ones existed. If I guess correctly, they should be variants amongst the Wolftaken, much stronger than the normal Wolftaken in all attributes.”</p><br/><p>Dai Mubai nodded, speaking with a tinge of fearfulness: “Thankfully you reacted quickly and did not allow them to reveal their full power, or else we would really have been in trouble. Little San, the hidden weapons you used really left me speechless, can I learn those things?”</p><br/><p>Tang San nodded with certainty towards Dai Mubai, smilingly he said: “Learning is not impossible, but you would have to start learning as a child. If you want to start now, you would have to give up your current spirit and start again from scratch, and after practicing for dozens of years it should do the trick.”</p><br/><p>Dai Mubai said: “Haha, then forget it. Fatty, how are you feeling now?”</p><br/><p>Ma Hongjun had already calmed down, and bitterly said: “I’m okay. Little Ao’s Recovery Sausages certainly have improved. My injuries are mostly recovering, but i am still unable to lift up my left arm. It will probably be a while until it heals.”</p><br/><p>Dai Mubai said: “You guys just rest here first, I’ll go take a look at the village and at the same time see if there are any other Wolftaken around.”</p><br/><p>Tang San nodded towards Dai Mubai. Although he was currently in a weakened state, together with Ma Hongjun they should have no trouble keeping themselves alive. After all, even for someone practicing the Mysterious Heaven Skill in the other world, who else had Oscar’s Recovery Sausages to recover with? After eating a few of them, Tang San already felt his weakened condition improving a lot. Probably he would not need three days before he recovered fully.</p><br/><p>Not long after, Dai Mubai returned with an ashed face.</p><br/><p>“F***, these Wolftaken are so inhumane, even the women and children were killed.”</p><br/><p>“What?” Tang San and Ma Hongjun replied equally shocked.</p><br/><p>Dai Mubai said: “It should be the wolves we killed earlier that killed those people. Who would have thought that because of us…” </p><br/><p>As he said this, his tiger eyes let out a painful glow: it was because he had wanted to fight head on with them, along with the pressure brought by Tang San, that these wolves had first finished off the women and children. In this forest, other than the three of them, there were no other living people left.</p><br/><p>Although they had exterminated the Wolftaken, they had not managed to save the villagers. This left a heavy feeling on his heart.</p><br/><p>Tang San stood up and patted Dai Mubai on his shoulder: “Boss, don’t think about it too much, at least we already avenged their deaths.”</p><br/><p>Dai Mubai stood there silently, as Tang San went ahead to the side of the Cyan Wolftaken Leader, one by one retrieving the hidden weapons from its body. Although there were a few single-use hidden weapons, most of them were reusable. Since they were heading to Sea God Island, these hidden weapons were extremely precious to Tang San, once used they would be gone.</p><br/><p>Just as he was removing a Willow Knife from the corpse, he suddenly noticed the place the knife had pierced gave off a cyan lustre, and no blood flowed out from that area.</p><br/><p>“Oh, what is this?” The Willow Knife in Tang San’s hand moved, cutting open the thigh of the Cyan Wolftaken, revealing a bright cyan glow within.</p><br/><p>The cyan glow also got Dai Mubai and Ma Hongjun’s attention, as the two of them came over. The three of them looked at each other for sometime, with mixed emotions.</p><br/><p>That green object was actually a Spirit Bone, a Right-Leg Spirit Bone. It was giving off a cyan glow and a fairly strong feeling.</p><br/><p>Dai Mubai spoke towards Tang San: “Little San, do you think this is its own Spirit Bone or do you think it got it from hunting Spirit Beasts?”</p><br/>\n</div>"}