{"title": "Chapter 201", "id": 201, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-201", "volume_title": "Volume 3", "body": "<h1>Chapter 201</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201</p><br/><p>Gifting Tang San A National Treasure, Vast Sea Cosmic Shroud</p><br/><p>(TL by PiggyBottle)</p><br/><p>In essence, it could be considered to be a domain ability. Even if it could not grow like other domain abilities, its effect was still rather terrifying especially in group fights where communication was even more important.</p><br/><p>From the start of the fight till now, honestly speaking, the Shrek Six Devils very slightly uncoordinated, as after all they had not worked together for so many years and were still lacking Xiao Wu and were unfamiliar which each other’s new abilities. Also, even if they still had good mutual understanding, it was not as perfect as it was five years ago.</p><br/><p>After forming this mental network, the situation started to improve, all of them without restraint transmitted all their abilities to Tang San’s mind, where he quickly could make the best decisions on how each of them should act and use their spirit abilities.</p><br/><p>This method of thought transfer was so much faster than words that once Ning Rongrong used this ability, the Shrek Six Devil truly combined into one entity. </p><br/><p>The word ‘kill’() which was capable of tearing apart space quietly faded away, as the Sword Doulou’s words quietly resounded from all directions: “In the face of absolute strength, all abilities are but illusions. Watch closely.”</p><br/><p>In everyone’s perception, after that huge blade in the air swept by horizontally, appeared a huge five meter projection which looked just like the Sword Douluo Chen Xin. Wielding his sword with one hand, simply moving as if following the will of the world, in this moment the Seven Kill Sword seemed to have taken control of all the power in its surroundings, regardless of whether it was Tang San’s Deathgod Domain, Blue Silver Domain or Ning Rongrong Fantasy Space were all torn apart, as the surrounding once again became clear. </p><br/><p>The huge sword in Chen Xin’s hands was not directed at them, but rather the sky. With a flick of his wrist, the six swords quickly moved together to create a word ‘kill’ () which was ten-times larger than the previous one in mid-air. The pressure from that dense black character was enough to send all the Shrek Six Devils to the ground, even their combined strength was not enough to stand up to this oppressive force.</p><br/><p>Chen Xin’s voice sounded by their ears, “Once your spirit power pasts rank ninety-five, you will experience a qualitative change, each time it rises the spirit will evolve once. Once you reach this realm, you will no longer rely on spirit abilities but rather start to merge with your spirit.</p><br/><p>Back then that person from Spirit Hall managed to block all nine consecutive ‘Kill’() characters from my father by virtue of his complete fusion with his spirit and then using the Angelic spirit force to heavily injure my father’s innards ultimately resulting in his death. Although abilities are important, raising your spirit power is more fundamental, without a large power to back it, even the best spirit abilities and spirit bones will not be to do anything.</p><br/><p>The lights converged back together as the image of the Sword Douluo and the character ‘kill” both faded away, however the words he said were left deeply imprinted in the minds of these Shrek Six Devils.</p><br/><p>The most severely affected was Tang San, the murderous intent in that huge ‘kill’ character left him with a bizarre feeling as the killing intent was completely different than that in his Deathgod Domain. The killing intent from his Deathgod Domain was filled with violence, bloodlust and was cold while the killing intent from the Sword Douluo gave off a majestic feeling. As he thought he somewhat managed to get an understanding of it but even so it was just barely.</p><br/><p>The six of them knelt on the ground with one leg, none of them speaking a word, their spirits withdrawn, in deep thought.</p><br/><p>Without doubt, each and every one of the Shrek Seven Devils were talented geniuses. The Sword Douluo did not say much but to them, in the face of tremendous pressure while facing death evoked various feelings which were very important to them and what they needed most right now was this.</p><br/><p>Grandmaster softly told the stunned Bai Chenxiang beside him: “Let’s go, they won’t be up till at least evening.” Grandmaster was very satisfied by today’s results. Ever since they had won the Continental Advanced Spirit Master Academy Elite Tournament five years ago, he had been wanting to find a chance to knock them down a notch. It’s just that they all went their separate ways and he had no chance to get them together.</p><br/><p>The Continental Advanced Spirit Master Academy Elite Tournament without a doubt made the Shrek Seven Devils famous. But at the sametime it made them overconfident, especially Tang San. Although on the surface Tang San seemed the same as before, but as his strength continually rose, and as he obtained various powerful abilities, his confidence too had become slightly overinflated. Other people may not notice but Grandmaster certainly would. Before they headed off somewhere as dangerous as Sea God Island, Grandmaster thought it would be necessary to jolt these kids a little, let them grow in the face of pressure and at the same time recognise the true gap they had between them and those who were truly powerful.</p><br/><p>Outside Shrek Academy.</p><br/><p>Sword Douluo gracefully landed, his originally calm expression now had a bitter smile. In his heart he secretly wished that hopefully those kids were not too badly traumatised. This was Grandmaster’s request, which he had fulfilled. But, at the same time, he had come to experience the true level which the Shrek Seven Devils had currently reached.</p><br/><p>On the surface, it seemed like an easy victory for him, but in reality, only he knew the truth.</p><br/><p>Why did he transform into a sword? Seeing his clothes would be enough to explain. The offensive power of Ma Hongjun who was boosted by Ning Rongrong was just too frightening, especially the temperature of the phoenix flame, far exceeded what Chen Xin had imagined. Although it was still not enough to harm him, but the hem of his clothes had already been completely charred, half his robe had been reduced to ashes, making him look quite embarrassing. This was also why he did not stay after the exchange and the reason behind his immediate departure.</p><br/><p>When he transformed into a sword and used the phantom blade, it was actually the ability he awakened after reaching rank ninety-seven and the effect of his ninth spirit ring. People who were not of equal level could not see which spirit ring he had used anyway.</p><br/><p>As a result, that one sword had completely shocked the Shrek Six Devils. The attack power he used in that instant, could be considered at the peak of the present age.</p><br/><p>Seeing himself left with only half his robe, Chen Xin could not help but smile, “When I was as old as them, I certainly did not have their strength. I hope that everything goes well during their trip in Sea God Island.”</p><br/><p>Three days quickly passed, the exchange with the Sword Douluo had left a greater impact on them than Grandmaster imagined, for these three days none of the six of them left their rooms, they did not go through any combat training or interaction, they just quietly sat in their wooden cabin cultivating. Only when Ning Fengzhi sent someone to find Tang San, did this silent cultivation phase end.</p><br/><p>Grandmaster brought the disciple from the Seven Treasure Glazed Tile School to the wooden cabin. “Tang San, you come out for a while.”</p><br/><p>His voice not only startled Tang San awake, but also the other Shrek Seven members who were cultivating. Suddenly there was a loud clear phoenix cry, even Grandmaster who was outside could suddenly feel the air become hot. Following shortly, a scarlet red figure burst through the roof into the sky, razing the wooden cabin into the ground in an instant.</p><br/><p>A huge pair of flame wings fanned out, sending him straight up a hundred meters before stopping when all of a sudden a huge ring of fire blossomed in the sky spreading a hundred meters in diameter before fading away.</p><br/><p>“Damn fatty, you are responsible for building the next house.”</p><br/><p>Dai Mubai, Oscar, Tang San, Xiao Wu, Ning Rongrong and Zhu Zhuqing almost simultaneously walked out of the house. Tang San held onto Xiao Wu’s hand, although she was just as lost as before, somehow ever since she and Tang San were engaged, she just did not feel as empty anymore.</p><br/><p>The one who spoke was Dai Mubai and although it sounded like he was scolding Fatty, everyone’s faces were filled with laughter, obviously Ma Hongjun had broken through.</p><br/><p>Perhaps it was because amongst them, other than the soulless Xiao Wu, only Ma Hongjun had not reached the Spirit Emperor level yet, or perhaps the Sword Douluo’s impact on him was too huge which stimulated his Phoenix Spirit’s strength.</p><br/><p>“Too kind, too kind. How good would it be if I could break through a level every time I break a hut.” Fatty excitedly descended from the skies laughing out loud, not hiding his self-satisfaction in the least.</p><br/><p>“Damn Fatty, don’t get too full of yourself, don’t forget you are still the weakest.” muttered Bai Chenxiang who was beside Grandmaster.</p><br/><p>These few days the Shrek Six Devils have been very zombie-like, and she had been the one to take care of their meals, making her feel extremely worried, if not for Grandmaster comforting her and telling her that this was normal, she probably would have ran off to Grandpa for help. Seeing everyone become lively again, and Ma Hongjun even breaking through, for some unknown reason she felt really happy. Was she feeling happy because Ma Hongjun got stronger? Perhaps even she herself didn’t know.</p><br/><p>Hearing Bai Chenxiang’s words. Ma Hongjun’s joy was instantly deflated, “Xiangxiang, can’t you praise me a little? I am already at the fifty-ninth rank, soon I will be able to break through the sixtieth rank, in the future I will definitely not be the weakest.”</p><br/><p>While saying that, he glanced mischievously at Oscar. As an auxiliary food systems spiritmaster, even if he was a greater genius, he would not be able to cultivate faster than a battle-type spiritmaster like him. In the past five years, for him to be able to breakthrough the sixties he had given up just too much while fatty had been lazing about a bit too much.</p><br/><p>“What are you looking at? Damn Fatty, why don’t we have a little contest, lets see whose rank increases more during our trip at Sea God Island,” Oscar would not admit defeat this easily, after obtaining his sixth spirit ring and that Mirror-image spirit bone, his confidence had greatly risen.</p><br/><p>Ma Hongjun without backing down said: “Come on if you dare, since you think you are so good then let’s make a bet. If I win then you let me give Rongrong a kiss, and if you win then i’ll let you kiss me once, how about it?”</p><br/><p>“Ptui——” With a swing of his leg Oscar gave Fatty a kick on his butt. Ning Rongrong gritted her teeth and glared at him, if she was a battle-type spirit master, she would have herself came and taught this loose-mouthed person a lesson.</p><br/><p>Bai Chenxiang not giving up an opportunity to poke fun at Fatty said, “See, your true nature is out. I knew you are a no good person afterall.”</p><br/><p>“I……” Fatty had no trouble talking back to other people, but once he saw Bai Chenxiang he become at a loss of words.</p><br/><p>Grandmaster smiled calmly: “These few days you all should have some good results. No need to tell me, just go and carefully examine these sensations. I suggested for you all go to Sea God Island in hopes that you can experience more of such things. To constantly grow under pressure, let the pressure become motivation, but at the same time you must wield it carefully and not let it be too excessive. From the Sword Douluo, you all should have realised the gap between yourselves and those who are truly strong. I hope that after you all come back from Sea God Island, this gap would have become smaller.”</p><br/><p>“Yes——” The Shrek Six Devils replied in unison.</p><br/><p>Only now did Grandmaster turn to face Tang San, saying: “Little San, School master Ning has sent someone to bring you to the palace. Hurry up now, I have already prepared some necessities for you all so, you all can leave tomorrow morning.”</p><br/><p>“Yes Teacher.” Tang San spoke his consent and went along with the Seven Treasure Glazed Tile School member to the palace, handing Xiao Wu over for Zhu Zhuqing and Ning Rongrong to take care of.</p><br/><p>Within these three days, although only Ma Hongjun managed to breakthrough to the next rank, Tang San too had benefitted from it. He was a smart person, he knew clearly that after facing such a huge pressure, it would be very difficult to look over at all his flaws and try to get some understanding from it. As such, he wholeheartedly went to study the huge “Kill” character he faced previously. During these few days, he managed to get some understanding on it and he also realised that his own Death God Domain still had a lot of room for improvement.</p><br/><p>In terms of power and utility, Tang San’s current Blue Silver Domain vastly outclassed his Death God Domain. Not only did it improve his mental surveillance, it also greatly boosted the abilities involving his blue silver emperor. He also understood that although the Blue Silver Domain was good, it was also limited. The difference in effect in a place where there was Blue Silver Grass and one without was just too big. This lack of certainty would be a problem when he faced a strong opponent.</p><br/><p>Just like when he faced Qian Renxue in the skies, the Blue Silver Domain was greatly restricted. If the fight was in the forest, Tang San would not have had so much trouble, and even if his victory was not certain, at least he would still have had the chance to win without using the spirit ring endowed onto him by Xiao Wu.</p><br/><p>In terms of being restricted, the Death God Domain would come out ahead of the Blue Silver Domain. It’s boost and it’s effect was certain and could be controlled. Only by strengthening his Death God Domain, could he fight without having to go all out in any situation.</p><br/><p>As such, Tang San already set his mind to finding ways to improve the potency of his Death God Domain. One was by increasing his Spirit Power and quickly reaching the level to release his true spirit, allowing a domain’s full effect to be shown. The other was to improve his innate understanding of the Death God Domain.</p><br/><p>The Death God domain was not without its own side-effects. Tang San had always realised that after using it he would be disrupted by the bloodthirst, and his violent tendencies would rise. But after facing the pressure from the Sword Douluo, Tang San realised that there was another way to use the Death God domain. If he could successfully change it, then from then on, after he used his domain he would no longer have to waste more energy trying to control his emotions. Thus not needing to waste any of his mental energy on it making the domain more effective.</p><br/><p>Heaven Dou Empire Palace had already returned back to normal, on the surface it did not even seem like any crisis involving the royal family had happened.</p><br/><p>Upon reaching the Seven Treasure Glazed Tile School Tang San saw Ning Fengzhi.</p><br/><p>“Uncle Ning.” Tang San respectfully greeted Ning Fengzhi, although he was now a sect leader as well, he never spared any courtesy towards Ning Fengzhi. Disregarding matters involving Ning Rongrong, over these few years, Ning Fengzhi help towards the Shrek Seven Devils will always be remembered. What’s more, without his and his clan’s help, the establishment of the Tang Sect would also not be this successful.</p><br/><p>Ning Fengzhi smilingly criticised: “There are no outsiders here, why are you still so formal? Didn’t I already tell you many times before, right now you are the Tang Sect leader, you need to take note of your own status.”</p><br/><p>Tang San too replied with a smile: “Regardless of background, you are still my Uncle Ning.”</p><br/><p>With a laugh Ning Fengzhi replied: “Little San, this time I came to bring you to see His Majesty.”</p><br/><p>“Oh?” On the way here, Tang San had still been contemplating on the problem regarding his Death God Domain, and did not think about the reason Ning Fengzhi was seeking him. “Visit His Majesty? Is it about us going to Sea God Island?”</p><br/><p>Ning Fengzhi nodded his head: “You all will be gone for who knows how long. Perhaps, His Majesty may not last even until you all return. Since the Tang Sect in the future also needs the support of the Heaven Dou Empire it would be better for you to settle some things with His Majesty first.”</p><br/><p>Tang San emotions stirred, instantly he realised Ning Fengzhi’s purpose. He could not help but scold himself inwardly, these days there were just too many things that he needed to do, but to forget something this important was no good.</p><br/><p>“I understand. Thank you Uncle Ning.” Tang San sincerely replied.</p><br/><p>As Ning Fengzhi took the lead he patted Tang San’s shoulder saying: “When you all go to Sea God Island, help take good care of my Rongrong and Oscar, that is the greatest way to repay your gratitude. When you all come back, you all will have truly become major players in our fight against Spirit Hall. But, you need to remember, life is more important than strength. If it comes to it, even if you have to give up your objectives you have to at least come back alive.”</p><br/><p>Tang San knew that Ning Fengzhi truly did care about them so he hurriedly nodded his head in consent.</p><br/><p>The security in the Heaven Dou Empire Palace was even tighter than before. The two thousand spirit masters loyal to the royal family resided in the palace, staying in close proximity to Emperor Xue Ye was at least two hundred patrolling spirit masters.</p><br/><p>Ning Fengzhi brought Tang San to seek an audience with Emperor Xue Ye, very quickly they were let through to enter the grounds.</p><br/><p>In the chambers was not only the Emperor Xue Ye, but also two other people Tang San recognised. Firstly was prince Xue Xing and the new Crown Prince, the Fourth Prince Xue Beng.</p><br/><p>Prince Xue Xing had a proud look, his original arrogant and domineering attitude was long gone, only now did Tang San feel that he rather resembled Emperor Xue Ye.</p><br/><p>Prince Xue Beng had changed even more, respectfully standing by Emperor Xue Ye’s side, his foppishness nowhere to be found.</p><br/><p>Seeing this sight, Tang San inwardly sighed, Qian Renxue really disguised herself as Xue Qinghe well, but didn’t this Fourth Prince Xue Beng and prince Xue Xing hide it even better? Regardless of the process, they were the final victors. Without question, Xue Beng was Emperor Xue Ye’s sole successor. After Emperor Xue Ye passed away, he would become this Heaven Dou Empire’s new master.</p><br/><p>Emperor Xue Ye still looked energetic with his rosy and healthy complexion, without knowing prior, one would easily assume he was healthy. In actuality he was constantly fighting for his life.</p><br/><p>“Paying our respects to His Majesty.” Ning Fengzhi and Tang San both paid their respects to Emperor Xue Ye.</p><br/><p>Emperor Xue Ye smilingly said: “You two Clan leaders both dispense with the courtesies, take a seat.”</p><br/><p>Tang San carefully observed this Emperor, using his spiritual force to investigate, he could clearly see tell that Emperor Xue Ye was lacking both vital energy and blood, and had erratic short breathing.</p><br/><p>“Sect Leader Tang, I heard from School Leader Ning that you will be heading on a long journey?” Emperor Xue Ye asked Tang San with a smile.</p><br/><p>Tang San nodded his head. Saying: “I was just planning to report this matter to you. The Tang Sect has just officially went on the right track, in the short term Spirit Hall should not move again. I intend to use this time to travel a little and find an opportunity to increase my strength.”</p><br/><p>Emperor Xue Ye said: “This is good, but does Sect Leader Tang know how long you will be gone?”</p><br/><p>Tang San inwardly smiled wryly, but on the surface he indifferently said: “Perhaps about three to five years, I am also unable to give a more specific prediction.”</p><br/><p>Emperor Xue Ye nodded, looking at the Prince standing beside him, “Xue Beng, didn’t you say you have something to tell Sect Leader Tang?”</p><br/><p>Xue Beng hurriedly acknowledged and walked from Emperor Xue Ye’s side till he reached a few steps before Tang San. Just as Tang San was confused as to what he was going to do, this newly crowned prince suddenly fell to his knees with a bang, and paid his respects to Tang San.</p><br/><p>Tang San jumped from shock, his suddenly reaction lifted his chair up a meter away along with him as he hurried to the Prince’s side to help him up.</p><br/><p>“Your highness, why do you do this?”</p><br/><p>Xue Beng was unwilling to get up regardless of what was said, devotedly said: “Sect Leader Tang, please accept this kowtow of mine. If not, I Xue Beng cannot be at ease for this life of mine. At the start in order to protect myself, I had aggravated Sect Leader Tang multiple times. However, Sect Leader Tang still saved my father’s life during times of crisis. Regardless of being a son or a servant, I have to kowtow to you for my father and myself.”</p><br/><p>Tang San naturally could not accept such a kowtow, as he moved to the side, pushed his arm against Xue Beng’s shoulder to prevent him from kowtowing to him. Looking to Emperor Xue Ye, he difficulty said: “Your Majesty, His Highness The Royal Prince he… …”</p><br/><p>Emperor Xue Ye spoke with a sigh: “This is something that he should do. These years have been hard on him, it is also my fault that I did not realise that Qinghe was an imposter. I had four sons, yet three of them have already been murdered by Spirit Hall. All that is left is this Xue Beng. Sect Leader Tang, I hope that you allow Xue Beng to pay his respects to you as his teacher. In the future, I will be relying on you. So, by reason and by feelings, this kowtow should be accepted by you.”</p><br/><p>Take me as his teacher? Tang San inwardly thought, Xue Beng is even older than me, what does this kowtow even amount to? Emperor Xue Ye is indeed planning matters for after his passing. But, how should he deal with this right now?</p><br/><p>At this moment, the Seven Treasure Glazed Tile School School Leader Ning Fengzhi beside him spoke: “Sect Leader Tang, just accept the Prince’s sincerity.”</p><br/><p>Hearing even Ning Fengzhi say this, Tang San had no choice but to let go of Xue Beng’s shoulder, allowing him to kowtow three times before quickly helping him up. Not sure if it was Xue Beng being a good actor or if it was his actual personality, Tang San could see only sincerity in his eyes.</p><br/><p>Actually, Xue Beng sincerely thanked Tang San, if not for him saving His Majesty, getting rid of Qian Renxue and coming with Ning Fengzhi and the Shrek Academy to help. After Qian Renxue ascended the throne, the first person she would kill was prince Xue Xing then next would definitely be him, such was the idea behind getting rid of the weeds at the roots. At that point, the Heaven Dou Empire would truly no longer have even one true inheritor of the royal bloodline in its descendants anymore. Only with Tang San’s help did the tides turn and allow him to take up the position of Crown Prince, cementing his position as the next Emperor. What did their previous feud amount to? Xue Beng could only wholeheartedly thank Tang San.</p><br/><p>Looking at it from another angle, the Tang Sect was currently rapidly developing, because of the situation in the Heaven Dou Empire had stabilised, and the Tang Sect hidden weapons had been shown to the empire. Emperor Xue Ye and Xue Beng both know the future importance of the Tang Sect to Heaven Dou Empire. The opportunity in front of them could be said to be of utmost value to the empire.</p><br/><p>If it was only to give thanks, Tang San would definitely never accept this kowtow, Xue Beng was after all the future emperor, this kowtow could be draw disgrace in the future. However things were different if it was to take him as a teacher, a disciple kowtowing to the teacher would always be acceptable.</p><br/><p>“Teacher.” Xue Beng respectfully said to Tang San.</p><br/><p>Without waiting for Tang San to speak, Emperor Xue Ye already spoke: “Sect Leader Tang is to receive the royal decree.”</p><br/><p>“Tang San present.” Just as Tang San was going to kneel down, Xue Beng held him up, as he was surprised by the act, he could already hear Emperor Xue Ye saying: “I decree that Tang San, as the crown prince’s Imperial Tutor[1], from today onwards, there is no need to pay homage. You shall be crowned prince[2]. Royal name: Lan Hao[3]. Within the Empire, you shall be considered as an official of three ranks higher[4].”</p><br/><p>Emperor Xue Ye really went all out! Was Tang San’s first reaction, he who was of common birth, even if he had obtained a title when won the Continental Advanced Spirit Master Academy Elite Tournament previously it would at most be a count. But now, he had jumped so many ranks and had become a prince, which was not something that could be obtained just for saving Emperor Xue Ye’s life. King Lan Hao, this was clearly a title derived from his twin spirit spirits.</p><br/><p>A servant carried a tray before him: the tray was covered with a red cloth, covering something underneath it.</p><br/><p>Emperor Xue Ye smilingly said: “King Lan Hao, why don’t you have a look at what’s beneath. From now on it will represent your status.”</p><br/><p>With some doubt Tang San removed the red cloth. In an instant, the royal chambers were shrouded with a brilliant lustre.</p><br/><p>Under the cloth was a palm-sized bizarre object: it had a triangular body crystal blue in colour, seemingly carved whole from sapphire. A constant sapphire lustre burst out along with the strange energy fluctuations coming from it. On this blue triangle were many ripple like lines which did not seemed carved on, rather it felt as if it was alive, pulsing with blue slight, it covered the entire chamber with its lustre.</p><br/><p>“Your Majesty, this is… …” Tang San looked towards Emperor Xue Ye, his gaze sweeping past Ning Fengzhi, clearly seeing the envious look coming from his face. Just what on earth was this thing that even the richest Seven Treasure Glazed Tile School School Leader would envy?</p><br/><p>Emperor Xue Ye lightly smiled, his heart bitter: if not for the empire already reaching such dire straits, why on earth would he give away a national treasure like this. Tang San was still young; his saving of him, or even his strength, were not what the emperor saw in him. Even if he was even stronger, he was but one person. The thing that truly made Emperor Xue Ye make this decision was none other than the Tang Sect Hidden Weapons.</p><br/><p>If to say, in the future Tang San became an undisputed absolute power among Spirit Masters, then the Tang Sect Hidden Weapons could also be called unrivaled. With such special weapons, the Heaven Dou Empire would then truly become able to face Spirit Hall head-on. After witnessing the strength of these hidden weapons, Emperor Xue Ye had already decided to give his full support to the Tang Sect’s production of them. As Tang San was the leader of the Tang Sect, and he had even saved his life, along with the huge potential support he could bring. Recruiting Tang San was a necessity: in Emperor Xue Ye’s heart, Tang San right now was already more important than Ning Fengzhi.</p><br/><p>“This object is called the Vast Sea Cosmic Shroud. In a certain sense, it can be considered a spirit tool. In the future it will represent King Lan Hao. In itself it has many uses: if you inject it with some of your spirit power after you go back you will understand. I hope it will be useful to King Lan Hao when you are on your trip.”</p><br/><p>Tang San’s observation skills were superb, so even if Emperor Xue Ye revealed his heartache in parting with this Vast Sea Cosmic Shroud for just a moment, he clearly saw it.</p><br/><p>“Many thanks to His Majesty.” It was not that he wanted this gift, rather he had no choice but to accept it. Although he had not fully understood the emperor’s intention he knew that, if he did not accept this, it would be akin to rejecting Emperor Xue Ye’s token of friendship. This was the idea of forcing his hand which the emperor probably was trying to do.</p><br/><p>When he was leaving, Xue Beng personally brought Tang San and Ning Fengzhi out; even after Ning Fengzhi returned to the Seven Treasure Glazed Tile School, Xue Beng still accompanied him to the palace entrance.</p><br/><p>“Teacher, have a safe trip.” Xue Beng sincerely said. These words spoken by him were extremely natural, and although he was older than Tang San by many years, he still held Tang San in high regard. When Tang San was fifteen years old, he had managed to lead the Shrek Seven Devils to win the Continental Advanced Spirit Master Academy Elite Tournament. And now when he was barely twenty, he already established the Tang Sect.</p><br/><p>Tang San nodded his head towards Xue Beng: at least the negative feelings towards him no longer existed. He was just somewhat not used to his current attitude towards him. He could not help but be happy by today’s outcome, since the father-son duo had invested so heavily on him.</p><br/><p>“Your Highness, while I am gone for this period, the Tang Sect will be in your care.”</p><br/><p>Xue Beng’s eyes revealed a trace of joy, as only now did he truly feel that Tang San had recognized him, so he hurriedly replied: “Teacher, don’t worry. I am your disciple, Tang Sect matters are my matters, in the future don’t address me as Your Highness anymore: even after I ascend the throne, just call my by my name. I will always be your disciple.”</p><br/><p>Tang San had nothing to say: comparing respectfulness, Xue Beng was much more respectful to him than Xue Qinghe was to Ning Fengzhi. But then again, he was not the emperor yet, and so this was not the right time to make judgement yet.</p><br/><p>After parting with Xue Beng, Tang San directly headed back to Shrek Academy. They were already going to head off the next day. Sea God Island, just what kind of a place are you?</p><br/><p>After returning to the Shrek Academy courtyard, he noticed that the wooden huts were silent. Using his mental power to survey the place, he noticed that everyone was cultivating, while Xiao Wu was in Ning Rongrong’s room, using Ning Rongrong thighs as a pillow to sleep on. Xiao Wu right now could truly be considered the Sleeping Beauty. Everyday, she would spend two thirds of the time sleeping.</p><br/><p>It was also fortunate that Ning Rongrong and Zhu Zhuqing were around. Tang San no longer had to face that torment at night. Although he was already engaged with Xiao Wu, he had long ago already decided that unless Xiao Wu truly reincarnated he would not be too affectionate towards her. This was his love for Xiao Wu and also his respect towards Xiao Wu.</p><br/><p>Without disrupting anyone, Tang San returned to his own room. To him, these titles, the Prince’s Tutor, King Lan Hao all had no meaning. However the one thing that piqued his interest was the blue coloured triangle which even he could not figure out. Once he returned to his room, he took out this Vast Sea Cosmic Shroud and prepared to investigate it further.</p><br/><p>[1] Imperial Tutor - () A very high position in the court, but without real authority.</p><br/><p>[2] Prince - () This word is often used to translate what in English isn’t a prince in the sense of “son of a king”, but rather more similar to the hereditary title sometimes used among European nobility. In terms of status, it’s higher than a duke, but lower than a grand duke which in turn is lower than an archduke. (Honestly, I just used the titles in the same position of CH and EN Wikipedia’s nobility ranking.) To make it even more confusing, while the title is (), the pronoun-suffix when he is addressed is just (), meaning “king”. It might be noted here that the other princes have other appellations. Xue Xing’s title () is literally “related king”, or perhaps “prince of the blood”, whereas Xue Beng was previously referred to as () “Fourth imperial son”, and now as () “Highest son”.</p><br/><p>[3] Lan Hao - () “Blue Vast” or “Clear Blue”, the same blue as in Blue Silver Grass, and the Hao of the Clear Sky Hammer.</p><br/><p>[4] Three ranks higher - When an official’s actual authority didn’t match his official position, he might be treated above his official rank. An official from the capital might be treated much higher than his nominal position in other cities.</p><br/>\n</div>"}