{"title": "Chapter 202", "id": 202, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-202", "volume_title": "Volume 3", "body": "<h1>Chapter 202</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 202</p><br/><p>Vast Sea Cosmic Shroud</p><br/><p>(TL by Bagelson)</p><br/><p>The azure triangular object had just appeared when it completely rendered Tang San’s room ocean blue. The soft blue light undulations were so beautiful, even with his willpower Tang San still couldn't help being dazzled.</p><br/><p>Both hands clasping this Vast Sea Cosmic Shroud, Tang San couldn't help feeling doubtful, thinking to himself: “Just what use does this thing have?”. He was in no rush to infuse it with spirit power, but rather he carefully looked at this peculiar thing shifting between light and shadow. Moreover, he cautiously released his spiritual force, exploring within.</p><br/><p>However, as soon as a trace of Tang San’s spiritual force was infused within the Vast Sea Cosmic Shroud, he abruptly felt an indescribable, enormous force suddenly repel it. His whole body immediately fell backward holding the Vast Sea Cosmic Shroud. His mind was a blank space. In his final moments of awareness he felt something smash against his head.</p><br/><p>If Tang san’s spiritual force could be called formidable, then the spiritual attributed energy his spiritual force encountered within the Vast Sea Cosmic Shroud was boundless. That basically wasn't a quantity that could be resisted. Fortunately he had only infused spiritual force for a very short time. Further adding to that was his own extremely stable spiritual force and the help of the mind condensing skull bone: otherwise the counter attack from the Vast Sea Cosmic Shroud just now would have been enough to injure his soul.</p><br/><p>The thing that smashed against Tang San’s head was precisely the Vast Sea Cosmic Shroud. The sharp corner struck a small hole on Tang San’s forehead. That it could strike open the degree of durability of Tang San’s skin showed just how sharp that corner was. Of course, when it smashed against Tang San it irradiated peculiar blue light making Tang San’s defense lose effect. This way it could successfully split his skin.</p><br/><p>Blood flowing, that Vast Sea Cosmic Shroud spun once, sticking flat to the wound on Tang San’s forehead, as if alive. And as Tang San’s blood constantly flowed into it, the originally blue undulations of light gradually turned red.</p><br/><p>Right now Tang San’s Blue Silver Emperor right leg bone’s healing ability was unable to show even the slightest result under the effect of the Vast Sea Cosmic Shroud. The wound didn’t show the slightest intent of knitting together, only constantly pouring out blood into it.</p><br/><p>Before long, a trace of faint blue light drifted out from the Vast Sea Cosmic Shroud, condensing into an exceptionally faint image. A flat, aged voice echoed:</p><br/><p>“I don’t know how long it’s been before I could finally find someone with tasty blood. At last I’ve found a physique that can endure the vast sea force.”</p><br/><p>With a flash, the blue light once again infused into the triangular Vast Sea Cosmic Shroud, and the light on the triangular thing also suddenly vanished, separating from the wound on Tang San’s forehead. Spinning once, it first bounced on Tang San’s shoulder, then tumbled down along his arm to land in his palm. The triangle had now once again returned to blue, and only in the center flashed a trace of red light.</p><br/><p>Without the restraint of the Vast Sea Cosmic Shroud, the wound on Tang San’s forehead quickly closed, but he still remained unconscious.</p><br/><p>While he was unconscious, Tang San’s world of consciousness seemed to feel something pulling at his body and soul; the enormous pulling force left him basically unable to move his body.</p><br/><p>Gradually, that pull grew weaker and weaker, as if everything around grew fainter. It was also at this moment that a kind of peculiar force infused within his heart, then again slowly poured into his brain, becoming a clear and cool stream fusing with his mind. Even though the faint feeling was still there, his mind grew especially refreshed, sensing nothing of the outside world, but capable of clearly sensing the blood flowing through his veins, and even capable of sensing the minute changes within his internal organs.</p><br/><p>Gradually, Tang San’s consciousness remained hazy, not knowing how much time had passed, but as he returned to his senses, the color of the sky outside was unexpectedly already black. And he wasn’t alone in the room. The Shrek Six Devils were all gathered next to him and, besides Xiao Wu, who was vacantly sitting down holding his hand, the other five all had anxious expressions.</p><br/><p>“Eh? Everyone’s here.”</p><br/><p>Tang San rubbed his temple, and slowly sat up.</p><br/><p>Seeing him conscious, everyone heaved a sigh of relief, and Dai Mubai spoke in a low voice:</p><br/><p>“Little San, how are you? If you hadn’t woken up, we would have gone to get Grandmaster, Dean Flender and the others.”</p><br/><p>Oscar said:</p><br/><p>“We examined your body and found that you were a bit anemic: what happened?”</p><br/><p>Hearing him say this, Tang San also felt a bit weak. Such a feeling was the same he felt after an injury had been healed by his Blue Silver Emperor right leg bone.</p><br/><p>Tang San’s gaze fell on his right hand. He discovered that the Vast Sea Cosmic Shroud was quietly laying on his palm but, strangely, the original bright luster had disappeared. Even though it was still clear blue, it was just like a common gem.</p><br/><p>“It made me unconscious. Thinking about it, such a tiny thing can unexpectedly contain such enormous power.”</p><br/><p>Tang San held up the Vast Sea Cosmic Shroud in front of everyone, simply telling them about everything that happened since he left for the imperial palace.</p><br/><p>Listening to him, Ning Rongrong said:</p><br/><p>“With that said, this should be a good thing. Everyone told you to infuse it with spirit power, but you used spiritual force. Only, wouldn’t this be the imperial family……”</p><br/><p>Even though she didn’t continue, everyone still understood what she was implying.</p><br/><p>Dai Mubai snatched the Vast Sea Cosmic Shroud from Tang San’s hand:</p><br/><p>“We won’t know till we try.”</p><br/><p>As he spoke, he poured his spirit power into it without the slightest hesitation.</p><br/><p>“Mubai——”</p><br/><p>Tang San somewhat anxiously called out. When he wanted to take back the Vast Sea Cosmic Shroud, Dai Mubai’s spirit power was already infused within it. He knew that Dai Mubai was rushing to try it from fear it was dangerous.</p><br/><p>Nothing dangerous happened, or rather, nothing happened at all.</p><br/><p>The spirit power Dai Mubai infused within the Vast Sea Cosmic Shroud disappeared unseen like a clay ox in the sea, and the Vast Sea Cosmic Shroud itself showed no change, only flickering with a trace of blue light and then returning to normal, without any fierce changes.</p><br/><p>“Boss Dai, what did you find?”</p><br/><p>Ma Hongjun asked.</p><br/><p>Dai Mubai scratched his head,</p><br/><p>“There was really nothing to find. Just that the spirit power I infused it with is gone.”</p><br/><p>Hand flicking, the Vast Sea Cosmic Shroud returned to Tang San’s hand.</p><br/><p>Tang San’s eyes flashed, speaking in a low voice:</p><br/><p>“Mubai, don’t do that again.”</p><br/><p>Mubai smiled calmly, saying:</p><br/><p>“We’re brothers, don’t talk nonsense.”</p><br/><p>Seeing the smile on his face, Tang San couldn’t keep his expression from softening, helplessly shaking his head.</p><br/><p>His gaze turned to the Vast Sea Cosmic Shroud: “I’ll try.”</p><br/><p>While speaking, he cautiously infused it with a trace of spirit power. With his previous lesson, this time he was even more careful, infusing only a tiny amount.</p><br/><p>Strangely the Vast Sea Cosmic Shroud, that was completely inert when Dai Mubai tried, finally changed appearance in Tang San’s hand. After he infused it with that trace of spirit power, blue light abruptly blossomed, and that blue triangular object seemed to come alive, with an intense gem-like light play, returning once more to the dazzling appearance it had when Tang San just got it. Blue light rippled and undulated within the room like waves, line after line of strange patterns appearing on its surface. Tang San could clearly sense the Vast Sea Cosmic Shroud’s thirst for his spirit power, and subconsciously increased his output.</p><br/><p>Ning Rongrong’s expression changed, subconsciously retreating a step, her beautiful eyes revealing overwhelming shock; because she discovered that this tiny triangular thing unexpectedly gave her an urge to prostrate herself.</p><br/><p>That was her spirit trembling. With her first rate Nine Treasure Glazed Tile Pagoda, to actually have such an urge to kneel, just what was this thing?</p><br/><p>Ning Rongrong’s Nine Treasure Glazed Tile Pagoda wasn’t just a support type spirit. If it was classified, it would also be top tier among treasure class spirits. This was also an important reason why she could find such top tier ores in Gengxin City.</p><br/><p>But the feeling this Vast Sea Cosmic Shroud gave her now was extremely astonishing. If the Nine Treasure Glazed Tile Pagoda could be described as a pagoda within the world of treasures, then this Vast Sea Cosmic Shroud before her was like an immense mountain.</p><br/><p>Right now everyone was drawn in by the dazzling light of the Vast Sea Cosmic Shroud, and nobody noticed Ning Rongrong’s reaction.</p><br/><p>Along with Tang San’s spirit power continuously pouring inside, the blue light grew richer and richer. Within the radiating light, that azure triangular object slowly floated up from his palm. It stopped when it hovered in front of him, and slowly rotated uncontrollably.</p><br/><p>Just as Tang San wondered why, suddenly, he saw a smear of red light within the Vast Sea Cosmic Shroud. Immediately afterward, a stream of blue light shot into the space between his eyebrows. Tang San only felt his whole body tremble, as an enormous amount of information rushed into his brain through the spiritual link.</p><br/><p>The scene before his eyes changed, and Tang San’s soul and consciousness were both submerged in a fantastic world: an endless jade ocean and a blue sky. Below his feet was the surging sea, and above his head was a cloudless blue sky. That kind of feeling penetrating his body and mind produced in him an endless thirst. The previous weak feeling was completely obliterated in this instant.</p><br/><p>Trace after trace of distinct information was transmitted into his brain, each piece exceptionally clear. The triangular Vast Sea Cosmic Shroud constantly transformed amidst this information, revealing all kinds of clever uses. The methods to use it were also effortlessly imprinted in Tang San’s mind, existing eternally along with his spirit without need to memorize.</p><br/><p>The other Shrek Seven Devils all nervously watched Tang San. Along with a line of blue light streaming into the point between Tang San’s eyebrows from the Vast Sea Cosmic Shroud, Tang San’s body trembled slightly before returning to normal. But immediately afterward, his whole body was enveloped in a layer of dazzling blue light, and also slowly floated off the floor, just like the Vast Sea Cosmic Shroud itself.</p><br/><p>Left hand rising naturally and gracefully, that Vast Sea Cosmic Shroud lightly fell into Tang San’s palm, spinning and rotating. With each turn, the blue light around Tang San would become a bit more intense. Most flourishing with light was his head, back, right leg and right arm. These four locations were precisely where he possessed spirit bones.</p><br/><p>Among the Six Shrek Devils, besides Xiao Wu who blankly looked at Tang San, the other five subconsciously formed a circle with Tang San in the middle. They could sense that Tang San was just undergoing a bizarre change, and even though they didn’t know what, they could sense that it really wasn’t harmful, but rather a kind of beneficial change.</p><br/><p>Circle after circle of blue light constantly congealed around Tang San, rendering his whole body blue. Blue light pulsed within Tang San’s eyes, but differently from the light usually shot by Purple Demon Eye this light seemed sparkling and crystalline, immediately spreading across his whole body.</p><br/><p>Time passed second by second. As Tang San awoke from that mysterious world, it felt like only a short time had passed, but the light shooting through the windows from outside told him it was already daytime. Unconsciously, a night had actually passed.</p><br/><p>Softly floating to the ground, he looked at the deeply concerned gazes of his companions. Tang San couldn’t help sighing:</p><br/><p>“This time, the gift the Heaven Dou Empire gave me is even too heavy.”</p><br/><p>Ma Hongjun couldn’t help asking:</p><br/><p>“Third brother, just what is this thing?”</p><br/><p>Tang San hugged Xiao Wu who was sleeping not far from him, saying:</p><br/><p>“Let’s go, I’ll give you a demonstration outside.”</p><br/><p>Xiao Wu opened her sleep-drunk eyes. When she saw that she was held by Tang San, she nestled her head against his chest and went back to sleep.</p><br/><p>Leaving the log cabin for the courtyard outside, Tang San’s eyes flashed with blue light. That Vast Sea Cosmic Shroud flew up unsupported, floating in front of him and moving forward as he did. Unexpectedly there was no need to hold it with his hand.</p><br/><p>Standing still, Tang San said:</p><br/><p>“Even though I don’t know why Mubai’s spirit power didn’t work, by now I should have grasped how to use it. Calling it a divine tool absolutely isn’t any exaggeration. If the Eight Treasure Wishful Soft Armor senior Lou Gao forged can be called a divine tool, then this thing should be a divine tool of divine tools. Watch.”</p><br/><p>While speaking, the blue light in Tang San’s eyes abruptly intensified. In the spot between his eyebrows, a gentle blue triangular pattern appeared. The Vast Sea Cosmic Shroud flew up, rising to a height of five meters in the blink of an eye. Under everyone’s astonished gaze it swiftly expanded, growing a hundredfold in a flash. It dropped from the sky with a flash of blue light, enveloping all the Shrek Seven Devils within.</p><br/><p>The surroundings became a blue world, but they could still clearly see everything outside, just like everyone was enveloped in a triangular barrier.</p><br/><p>Tang San said:</p><br/><p>“This is its first function, and also the most useful one. After forming this barrier, it’s like a room that can protect us inside. At the same time, after shrouding us, it’s invisible, to the extent it isn’t even tangible. Not only can it hide our bodies, it can completely hide our auras. With this, we can release it to protect ourselves in any danger zones.”</p><br/><p>While speaking, Tang San waved his left hand. The blue light disappeared, the Vast Sea Cosmic Shroud again returning to his palm. Tang San’s left hand rose once again, and it spun out once again, flying towards Dai Mubai.</p><br/><p>Dai Mubai suddenly felt an indescribable danger, subconsciously swiftly retreating. But, only sensing a flash of blue before his eyes, that Vast Sea Cosmic Shroud expanded, enveloping his body within. However, this time it wasn’t as large as before, the space within only large enough to hold him. Making Dai Mubai even more shocked was that he was completely unable to move.</p><br/><p>Blue light flickering, the Vast Sea Cosmic Shroud returned once again. This time it directly turned into a ray of blue light and vanished between Tang San’s eyebrows, merging into his head.</p><br/><p>“This is its second use. The first ability is called Vast Sea Protective Barrier, the second is called Cosmic Stasis Barrier. There’s also a third ability called Vast Sea Wild Wave, and a fourth ability called Cosmic Magic Breaker. They’re both used for attack. I can feel that this thing is quite powerful, and its might is directly proportional to my spirit power. Among them, the one that consumes the least spirit power is the Vast Sea Protective Barrier. As long as I spend a tenth of my spirit power, it can be activated for twenty hours. Only if the enemy can find it, and break through its defenses, can they harm us. The Cosmic Stasis Barrier can be calculated with the opponent’s spiritual force. I can stop any enemy with spiritual force less than three times my own. It can’t harm the opponent, but we can still take the chance to leave. The Vast Sea Cosmic Shroud will return to me even from a thousand li. As for how powerful those two attack abilities are, I don’t know either. But they shouldn’t be weak. Because any one attack requires me to expend all my spirit power. Strangely, it can attack no matter how much spirit power I have, but it will still absorb all the spirit power, and the attack power will increase accordingly. The Vast Sea Wild Wave is a group attack ability, while the Cosmic Magic Breaker is a single target attack.”</p><br/><p>Listening to Tang San’s detailed explanation, Dai Mubai couldn’t help saying: “Fuck, Heaven Dou Empire actually has such a good thing. If this counts as a spirit tool, then it really is on the divine tool level. With this, wouldn’t we have the power to protect ourselves anywhere?”</p><br/><p>Tang San said:</p><br/><p>“Even the best things have their limits. However, with it we at least don’t have to worry about keeping watch when resting in the wilderness. However, since everyone hasn’t slept for a night, I think we shouldn’t leave today. It’d be better to set out tomorrow.”</p><br/><p>Dai Mubai said:</p><br/><p>“Not a problem, we’ll leave today. Don’t delay. Grandmaster found us a large carriage, everyone can rest there. We’re all Spirit Masters, what’s a little lack of sleep?”</p><br/><p>Everyone nodded slightly. It seemed they were all a bit impatient.</p><br/><p>Tang San could completely understand everyone’s present mood. With that single fight against Sword Douluo, the understanding the pressure gave them made them all deeply aware of the importance of battle and pressure to the improvement of strength. Now they also had the Vast Sea Cosmic Shroud, so the level of danger of the Sea God Island had greatly decreased.</p><br/><p>“Fine. Then we’ll set off at once.”</p><br/><p>Grandmaster had long ago prepared the carriage for them. It wasn’t just the Shrek Academy teachers who came to see them off, Ning Fengzhi, Sword Douluo, Bone Douluo, and the Tang Sect elders were all invited by Grandmaster, personally loading the Shrek Seven Devils and Bai Chenxiang onto the carriage. Everything they needed was already stored away in everyone’s spirit tools.</p><br/><p>When the time to leave finally came, it was difficult to avoid some reluctance to part. Even Grandmaster warned Tang San again and again. And practically everything everyone told them was about paying the most attention to their own safety.</p><br/><p>Parting was always sad, and on this trip they didn’t even know how long they would be gone. Bai Chenxiang cried in her grandfather’s arms for a long time, but Bai He brought her over to Ma Hongjun, repeatedly warning him to properly protect her. Ma Hongjun agreed seriously, and right now Bai Chenxiang had no way of arguing with her grandfather. Ever since childhood, this was still her first time leaving home. Even though she was always very excited before, when it really came time to leave, the reluctance in her heart still turned to sadness.</p><br/><p>Equally teary was Ning Rongrong, looking at her father’s already graying hair, she managed only with difficulty to get on the carriage under Ning Fengzhi’s consolation.</p><br/><p>The carriage was pulled by four strong horses, and Ning Fengzhi had supplied a sect disciple as coachman, driving them out from Heaven Dou City.</p><br/><p>Following the departing carriage with his eyes, Ning Fengzhi couldn’t help the light in his eyes dimming a bit. Everyone’s heart seemed to be leaving along with the Shrek Seven Devils.</p><br/><p>Very soon, the carriage left Heaven Dou City’s western gate, following the official road straight to the west. Grandmaster had drawn a detailed map for Tang San: they had to ride the carriage to the western edge of the continent, to the sea within the borders of Heaven Dou Empire, then embark a ship in order to travel to their destination. According to Grandmaster’s calculations, it would take them around two months to arrive.</p><br/><p>The carriage was very spacious, even seating a dozen people wouldn’t be a problem. Last night, besides Xiao Wu and Bai Chenxiang, the others hadn’t slept. Along with the melancholy of departure gradually fading, tiredness rose.</p><br/><p>Dai Mubai leaned against the side of the carriage, sleeping, Zhu Zhuqing nestled against his chest. Tang San held Xiao Wu, letting her head lean on his shoulder, also asleep.</p><br/><p>Ning Rongrong held Oscar’s arm, using his shoulder as pillow. Among the three couples here, they were actually the least intimate. Oscar sat there looking very well behaved, leaning half conscious on Ning Rongrong’s head.</p><br/><p>Within the carriage, the only one that couldn’t sleep was Bai Chenxiang. A great many things constantly spun through her mind. Being the first time leaving home, she was worried about it, missing her family, and also a bit nervous and considerably excited. She had also slept very well last night, so how could she sleep now? She sat alone thinking about all the things on her mind.</p><br/><p>However, even if she didn’t sleep, the one next to her didn’t have to stay awake.</p><br/><p>The others all slept very sweetly, but when this giant fellow fell asleep, he unconsciously started snoring. At the start Bai Chenxiang could still endure it, but this guy was snoring louder and louder. His chubby body swayed slightly with the motion of the carriage, and from time to time leaned against her.</p><br/><p>Bai Chenxiang pushed Fatty, pushing away the head that was about to lean on her shoulder. But in a moment, snoring thunderously, he came leaning back again.</p><br/><p>It wasn’t that Bai Chenxiang didn’t think about changing places, but even though the carriage was large, there still wasn’t any room to spare. There were two couches, one on either side of the carriage. Dai Mubai, Zhu Zhuqing, Ning Rongrong and Oscar were on one. Ning Rongrong and Zhu Zhuqing were both half leaning over, occupying all the space there. And on their side, Xiao Wu’s long legs spread out over the couch, occupying a lot of space. Fatty sat improperly and crooked, and if Bai Chenxiang wanted to change place, she had to move to his other side.</p><br/><p>Bai Chenxiang couldn’t help feeling a bit regretful. Was it a mistake going adventuring together with the Shrek Seven Devils this time? Everyone else were in couples, the only ones still single were her and that vulgar Fatty. It’s not that she hadn’t thought about cultivating feelings between her and Fatty either, after all, her grandfather had already agreed to marriage, and the one Bai Chenxiang listened to the most in the clan was Bai He.</p><br/><p>However, each time she looked at Fatty’s flabby body, there was no favorable impression. Hearing him snore now was even more loathsome.</p><br/><p>Just at this moment, with a thump, the carriage seemed to strike a small rock, the whole carriage bouncing up. The others were all leaning against each other and were unaffected, but the already sleeping Ma Hongjun sat with nowhere to lean on left or right. With this jolt, his large body immediately pressed in Bai Chenxiang’s direction.</p><br/><p>“You……”</p><br/><p>Bai Chenxiang forcefully pushed up Fatty. She didn’t dare be loud for fear she’d wake the others, and could only brace against him and call him to quickly wake up.</p><br/><p>Bai Chenxiang was a pure speed Spirit Master, and as such, besides her speed and flight, she was no different from ordinary girls in other areas. And Ma Hongjun’s weight had long since surpassed a hundred kg[1], and with the shaking carriage she soon couldn’t hold out. She couldn’t just get out of the way either, if she dodged, Ma Hongjun would press on Xiao Wu’s legs.</p><br/><p>What could be done? Bai Chenxiang was a bit anxious. Just at this moment, she saw Ma Hongjun’s flabby arm dangling in front of her. Her heart twitched, and she bit down on him through his clothes.</p><br/><p>Ma Hongjun immediately came to and shivered from the pain, coming awake from his sleep. Seeing Bai Chenxiang push against him he immediately understood, and hurriedly say up, in a low voice saying: “Sorry, sorry.”</p><br/><p>Bai Chenxiang’s eyebrows straightened, using all her strength to pinch the flesh at Fatty’s waist. Of course, she didn’t grab that much, using her fingernails to pinch a bit of flesh and twisting three hundred sixty degrees.</p><br/><p>Fatty abruptly ached, opening his mouth to cry out. Bai Chenxiang leapt up, hastily covering his mouth with her hands, not letting him make noise.</p><br/><p>Once Fatty’s expression gradually returned to normal, she let go, patting her high mountain peaks chest, glaring rebukingly at Fatty.</p><br/><p>Bai Chenxiang was without a doubt very beautiful, and her rebuking appearance was even more adorable. There still remained a bit of the warmth of her hands on Fatty’s face and lips, and he almost subconsciously made a somewhat lewd gesture, sticking out his tongue and licking his lips.</p><br/><p>Bai Chenxiang stared dumbfounded. She suddenly felt that she was like a lamb before a big lecherous wolf. She was extremely clear on Fatty’s strength, could it be this Fatty would…...</p><br/><p>Thinking of this, she hurriedly stuck to Xiao Wu’s side, somewhat alarmed looking at Ma Hongjun.</p><br/><p>Ma Hongjun couldn’t help staring distractedly when he saw her expression, touching his round face, he thought, am I that dreadful? In his heart he couldn’t help feeling a stab of pain, Bai Chenxiang’s alarmed expression had hurt his self esteem, a faint cold intent flashed past the corners of his eyes. He no longer looked at Bai Chenxiang, but shifted to sit against the other corner of the carriage, leaning against the corner and once again closing his eyes. In his heart he thought, what’s so extraordinary, I’m a bit plump, a bit ugly. If you don’t want me that’s fine, Fatty won’t pursue you hereafter. Third brother was right, a twisted melon doesn’t grow sweet. I don’t believe I can’t find a pretty girl later.</p><br/><p>Seeing Fatty sleeping on the other side, leaving behind an enormous space for her, Bai Chenxiang couldn’t help breathing a sigh of relief. However, just what expression did he have just now? She’d never seen him show such an expression in front of her before! Seeing Fatty leaning there, Bai Chenxiang couldn’t help being a bit disgusted.</p><br/><p>In order to reach their destination as fast as possible, they didn’t rest in any of the towns they passed, only when the horses were tired would they rest a while, their living quarters were out in the fields.</p><br/><p>As night descended, the Shrek Seven Devils awakened one after another. They didn’t plan to travel in the evening. After all, with the carriage shaking, cultivation was twice the effort for half the result. They couldn’t skimp on their routine nightly cultivation, and the horses also needed enough time to rest.</p><br/><p>Tang San took out drinking water and food from Twenty Four Moonlit Bridges. It was autumn now, and the air already had a bit of chill. Dai Mubai used his tiger claws to cut up a large pile of firewood in short order, and Ma Hongjun’s phoenix flame swept past, creating a bonfire.</p><br/><p>The girls took out water kettles, boiling water on the flames and roasting some rations. Everyone sat in a circle around the bonfire.</p><br/><p>Tang San very quickly discovered something amiss with Ma Hongjun. If it was before, he would definitely sit next to Bai Chenxiang without the slightest hesitation, but now he sat on the other side, staring into the bonfire without so much as a glance at Bai Chenxiang.</p><br/><p>Lightly holding Fatty’s shoulders, Tang San asked in a low voice:</p><br/><p>“What’s up? Why let Xiangxiang sit alone? Not going to keep her company?”</p><br/><p>Ma Hongjun curled his lips, lowering his head and saying indifferently:</p><br/><p>“She thinks of me as a scourge, should I be going to provoke her dislike? Afterwards she is she, I am me. Fatty’s face may be thick, but it’s not limitless. I won’t harass her again.”</p><br/><p>Tang San looked distracted, this was clearly Fatty and Bai Chenxiang falling out at some time. Fatty’s words clearly held resentment.</p><br/><p>Even if Ma Hongjun’s voice was soft, everyone present except for Bai Chenxiang and the soulless Xiao Wu were Spirit Emperor level experts, and naturally heard it clearly.</p><br/><p>Ning Rongring stifled a giggle, Oscar looked somewhat sympathetically at Ma Hongjun. Wasn’t he now much like he once was?</p><br/><p>Dai Mubai frowned, raising his head to look at Bai Chenxiang, about to say something but hastily stopped by Zhu Zhuqing. Zhu Zhuqing didn’t need to ask to know what Dai Mubai was going to say. As the eldest of the Shrek Seven Devils, he was very protective of his brothers. Don’t judge by how he usually joked with Fatty, if Fatty really had something going on, this big brother absolutely wouldn’t be ambiguous. Right now Fatty’s mood was bad, and if he was allowed to speak up, maybe he would tell Bai Chenxiang: “What do you take yourself for, our Fatty doesn’t have any bad points”, and so on. And so Zhu Zhuqing hastily stopped him.</p><br/><p>Just what is called one object being beaten by another, even though Dai Mubai was powerful, Zhu Zhuqing perfectly restrained him. She said a few sentences next to his ear, and Dai Mubai’s expression eased.</p><br/><p>Tang San naturally wouldn’t be as impetious as Dai Mubai, patting Fatty’s shoulder, he said: </p><br/><p>“Discouraged so soon? That’s not your style!”</p><br/><p>Now Oscar also walked over, sitting on Fatty’s other side, handing over one of his recovery sausages:</p><br/><p>“Fatty, this is a journey, how can you cause disagreements right at the start.”</p><br/><p>Fatty seemed to vent by fiercely biting Oscar’s sausage in half, Oscar watching couldn’t keep his back from shivering,</p><br/><p>“Fuck me, what grievances does my sausage have with you!”</p><br/><p>Ma Hongjun smiled wryly:</p><br/><p>“Alright, no need to mention it. I’ll think of something myself. Anyway, I’m a fucking brothel phoenix. Once we reach a town, I’ll go vent. Little Ao, are you saying I’m foolish? Don’t play some upright gentleman!”</p><br/><p>“Eh……”</p><br/><p>Oscar was speechless. Ordinarily he would already have shot Fatty a some derisive words, seeing that depressed expression again, but right now he couldn’t. Raising his head to look at Tang San, Tang San shook his head to him with a smile. Even though Tang San had some understanding of feelings, his insight still wasn’t any better than an ordinary person. From Ma Hongjun’s behaviour, he could clearly feel that Fatty truly liked Bai Chenxiang. He was no longer the kind of person driven to women by lust. His current appearance should be caused by worry.</p><br/><p>When talking about things like feelings, what others said was useless, you had to depend on yourself to sort them out.</p><br/><p>[1] As usually in the original Jin have been used for weight measurement, I’ll add a reminder for the conversion: 1 kg=2 Jin, so Fatty’s weight in Jin is two hundred.</p><br/>\n</div>"}