{"title": "Chapter 206", "id": 206, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-206", "volume_title": "Volume 3", "body": "<h1>Chapter 206</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 206</p><br/><p>Vast Sea City Great Spirit Arena</p><br/><p>(TL by Bagelson)</p><br/><p>Bai Chenxiang nodded softly,</p><br/><p>“As long as you dare come, why wouldn’t I?”</p><br/><p>While speaking, she unexpectedly took the initiative to stick close to Fatty.</p><br/><p>If it was as usual, Ma Hongjun would definitely by disastrously excited. But when Bai Chenxiang came close, he immediately sensed something wrong. He tried to retreat, but discovered Bai Chenxiang followed closely, like a shadow. Bai Chenxiang of course wasn’t his opponent in strength but, when comparing speed, there was none present who could surpass her.</p><br/><p>Ma Hongjun was already completely rigid: he already felt an extremely sharp dagger thrust into his jacket, sticking close to the inside of his thigh. The ice cold blade triggered a burst of spasms in his leg, but he didn’t dare flail around.</p><br/><p>Bai Chenxiang looked up smiling at Fatty. Only Ma Hongjun could sense her movements: using her body to hide her hand, the other Shrek Seven Devils couldn’t see anything. Lowering her voice, her left hand fiercely pinched Fatty’s waist,</p><br/><p>“Dare play the rogue again, and I’ll castrate you.”</p><br/><p>Ma Hongjun had never expected Bai Chenxiang to actually be so violent. Besides jerking his legs, what else could he do now?</p><br/><p>If it was an enemy, he had all kinds of means to escape, but that would undoubtedly mean using the phoenix flame. Bai Chenxiang wasn’t an enemy, if he used phoenix flame he’d directly injure her. Moreover, he couldn’t guarantee that the sharp blade at his crotch wouldn’t take something off in the process.</p><br/><p>“Xiangxiang, my bad, I won’t dare to do that again.”</p><br/><p>Ma Hongjun was already crying. What was this! The person originally taking the chance to take some liberties, was confronted with bare faced threats.</p><br/><p>The ice cold sensation disappeared. Bai Chenxiang knew to quit while she was ahead; no longer sticking close to Ma Hongjun, she raised her hand to slap Fatty’s protruding belly twice, saying sweetly:</p><br/><p>“Fatty, you’re unwilling to fight me, right? Even more unwilling to use phoenix flames on me?”</p><br/><p>Ma Hongjun subconsciously nodded.</p><br/><p>Bai Chenxiang was still smiling sweetly,</p><br/><p>“Then, with my speed, cutting you once shouldn’t be too difficult. If you feel you’re faster than me, then come to my room.”</p><br/><p>Her voice was very low, only Fatty could hear it. With this said, she called out to the others to return to the house.</p><br/><p>Watching her departing back, Ma Hongjun’s face turned red, then white, his teeth itching with regret. But unfortunately he had no way to seize the young lady.</p><br/><p>“Providence, providence!”</p><br/><p>Fatty faced upwards and sighed.</p><br/><p>Oscar smiled vulgarly:</p><br/><p>“Why don’t you catch up?”</p><br/><p>Ma Hongjun’s legs were still trembling. He snapped:</p><br/><p>“Catch up to farts! I don’t want to grow old childless.”</p><br/><p>The final result was they had to rent another room. Having rested briefly at noon, Tang San called Oscar away, returning only in the evening.</p><br/><p>After dinner, everyone gathered together.</p><br/><p>Dai Mubai somewhat embarrassed scratched his head,</p><br/><p>“I slept a bit too much at noon.”</p><br/><p>Oscar looked evilly at Zhu Zhuqing, and grinned:</p><br/><p>“Having endured so many days, we’re both men, I understand, I understand.”</p><br/><p>Zhu Zhuqing snapped:</p><br/><p>“Damn little Ao. Your mouth is leaking. Just wait, when you marry Rongrong, I’ll pull her away to chat all night. See what you can do about that.”</p><br/><p>Oscar smiled vulgarly, saying:</p><br/><p>“No problem! As long as boss doesn’t oppose it, I’m happy to fly together.”</p><br/><p>Four tender fists swung simultaneously, Ning Rongrong and Zhu Zhuqing saying in different voices:</p><br/><p>“Fly together with your face.”</p><br/><p>Bai Chenxiang softly asked Fatty:</p><br/><p>“I’ve never understood, what’s the meaning of this face you mention?”</p><br/><p>After the events in the afternoon, Fatty was a lot more fearful of Bai Chenxiang, sincerely answering:</p><br/><p>“It’s equivalent to slapping your face. Anyway, it’s no words of praise.”</p><br/><p>Oscar meanwhile blocked the attacks of the two women, but still didn’t forget to tell Bai Chenxiang: “You don’t understand. We’re all faceists. This is a necessary habitual expression.”[1]</p><br/><p>Bai Chenxiang blinked with her big eyes, saying:</p><br/><p>“Then right now shouldn’t I tell you, your face is habitual?”</p><br/><p>“Eh……”</p><br/><p>Oscar went lifeless, failing to block and was beaten off by Ning Rongrong and Zhu Zhuqing. He said with a wry smile:</p><br/><p>“Finished, finished, Xiangxiang is also led astray.”</p><br/><p>Ning Rongrong snapped:</p><br/><p>“This isn’t something taught by you villains. Our Xiangxiang is just defending herself.”</p><br/><p>Tang San smiled:</p><br/><p>“Fine. Don’t be noisy. Let’s talk business.”</p><br/><p>Everyone stopped being noisy, calming down. Tang San said:</p><br/><p>“Me and Little Ao went out a while. Bought some things for a sea voyage. We hired a ship in passing. We’ve already told the captain to prepare to go to sea. The captain said we’ll need a day of preparation. The morning after tomorrow, we go to sea. There’s something I want to ask everyone, who here can swim?”</p><br/><p>Hearing Tang San’s question, everyone couldn’t help staring blankly, one by one looking at each other, but none spoke up.</p><br/><p>Tang San also looked distracted, smiling wryly:</p><br/><p>“None?”</p><br/><p>Dai Mubai coughed once, saying:</p><br/><p>“I’m afraid not. We’re all non-swimmers. Only, with little Ao’s flying mushroom sausage, this shouldn’t be any problem.”</p><br/><p>Tang San shook his head, saying:</p><br/><p>“No, it’s definitely a problem. Little Ao’s flying mushroom sausage can let us fly a short distance. The ocean is boundless, how could we casually fly out of it. Moreover, Grandmaster said that there are also spirit beasts in the sea. Even if we can fly, with nowhere to land, how do we deal with the attacks of spirit beasts at sea? It seems that before entering Sea God Island, we’ll first have to deal with the swimming issue.”</p><br/><p>Ning Rongrong said:</p><br/><p>“Even if we start now there isn’t enough time!”</p><br/><p>Tang San pondered, then said:</p><br/><p>“It seems to me that it’s necessary to buy a spirit tool suited for the sea. Like one that can turn into a boat. Adding Oscar’s flying mushroom sausage, we should be able to defend ourselves.”</p><br/><p>Dai Mubai said:</p><br/><p>“We can only do so. This Vast Sea City isn’t small, there should be an auction house. We’ll go take a look.”</p><br/><p>Tang San said.</p><br/><p>“Then let’s go. Preparing early is always better than late.”</p><br/><p>Discussion over, everyone got moving. Asking at the hotel, sure enough, Vast Sea City also had an auction house. This was still a location the Shrek Seven Devils were extremely familiar with, the Great Spirit Arena. After learning this news, everyone talked it over, changing some plans for the night.</p><br/><p>Grandmaster once said that sea spirit masters’ fighting style was very different from that of ordinary spirit masters. If they could meet some sea spirit masters at this Vast Sea City Great Spirit Arena, it would clearly be a great advantage to their landing on Sea God Island. Consequently, they decided to first go take a look at the Vast Sea Great Spirit Arena.</p><br/><p>Of course, they couldn’t all fight, that would very easily draw attention and alert Spirit Hall. After all, Tang San’s spirit ring configuration was unique in the present Spirit Master world. Even if it was fighting in the Great Spirit Arena, they still had to hide somewhat. And that auction house was the same building as the great spirit arena, so they could observe sea spirit masters at the same time as they bought the things they needed.</p><br/><p>The Vast Sea Great Spirit Arena’s scale could only be considered average in the eyes of the Shrek Seven Devils, but the degree of activity wasn’t inferior to any spirit arena they’d seen. There was still some time before the competitions started, but there was already a sea of people entering. The seating rates were extremely high, but Tang San and the others still spent a large sum on a VIP compartment that could seat everyone.</p><br/><p>Once everyone were seated, their attention was immediately drawn to the scene inside the Vast Sea Great Spirit Arena.</p><br/><p>“It really does stand out from the masses!”</p><br/><p>Tang San looked out at the spirit combat stage outside the one transparent glass wall in the booth, and couldn’t help being a bit startled.</p><br/><p>They’d chosen a VIP booth in the two versus two battle area. The reason why they picked this place was because when they bought the ticket only this place still had tickets left. But inside this group of spirit battle arenas wasn’t like the enormous elevated stage in the Great Spirit Arenas they’d seen before, but rather a giant pool.</p><br/><p>The pool was more than a hundred meters in diameter, the clear blue pool like a sapphire without a ripple. There were already spectators seated in the arena, and even though the VIP booth’s soundproofing was quite good, just watching the bustling crowd in the arena they could tell how passionate the atmosphere was.</p><br/><p>Zhu Zhuqing picked up the prompt bade in the VIP booth, reading:</p><br/><p>“The spirit battle pool is circular, one hundred eight meters in diameter, ten meters deep. Participating spirit masters that separate from the range of the pool will be judged defeated. Conceding or losing the capability to fight is also defeat.”</p><br/><p>Tang San said to Ma Hongjun next to him:</p><br/><p>“Fatty, you and Xiangxiang go down to sign up. Remember to wear masks. Participate in the two versus two competition.”</p><br/><p>“No problem.”</p><br/><p>Fatty was excited, making a thumbs up to Tang San, his face exhilarated. He wouldn’t let a chance to show off in front of Bai Chenxiang pass.</p><br/><p>Bai Chenxiang somewhat doubtfully looked at Tang San. Seeing Tang San nod to her, she also didn’t say anything, following Ma Hongjun away.</p><br/><p>Ning Rongrong couldn’t help asking:</p><br/><p>“Third brother, why did you let Fatty go? This fellow seems like he’ll show off……”</p><br/><p>Tang San smiled slightly, planning in advance saying:</p><br/><p>“It’s exactly to let him show off. Fatty is rank fifty nine, Xiangxiang is past forty. They will naturally participate in the fiftieth ranked two versus two competition. WIth Fatty’s strength, he’s absolutely outstanding among fiftieth ranked spirit masters. Even though Chenxiang can only do harassment, Fatty alone should still be able to deal with it. Even more importantly, they can both fly, they won’t be too hindered because the battlefield is water. Let’s have him show us the strength of sea spirit masters through real combat, that will give us a rather preferable result. At the same time, only one of us Shrek Seven Devils appearing shouldn’t draw attention, matched with Xiangxiang who isn’t a member of us seven, Spirit Hall won’t think we’ve come to Vast Sea City.”</p><br/><p>Hearing Tang San’s explanation, Ning Rongrong burst into giggles,</p><br/><p>“Third brother, your brain is still so meticulous.”</p><br/><p>Tang San smiled:</p><br/><p>“Rongrong, can I take it you’re boasting about me?”</p><br/><p>Ning Rongrong giggled, saying:</p><br/><p>“Of course, my third brother is the smartest.”</p><br/><p>To the side Oscar somewhat discontentedly said:</p><br/><p>“Little San, don’t be like this, you’re not allowed to seduce my Rongrong.”</p><br/><p>Tang San laughed out loud,</p><br/><p>“Seduce your face, you don’t trust Rongrong this far!”</p><br/><p>Oscar indignantly said:</p><br/><p>“Repulsive faceist!”</p><br/><p>The signup time passed quickly, followed by the drawing of lots. Unless there was an especially outstanding competitor that would directly have a fight arranged, ordinary competitors would chose their opponents by lottery. Beyond expectations, Ma Hongjun and Bai Chenxiang drew the first team.</p><br/><p>The announcer’s voice passed into the VIP booth via a special channel,</p><br/><p>“Two versus two spirit fight, first round, Phoenix Fragrance Combination[2] versus Ocean Soul Brothers. Next, let us simply introduce both sides. As everyone knows, the Ocean Soul Brothers have already obtained four successive victories, only one more win, and they can the additional points for five successive wins. As Spirit King level powers, they will at once advance to gold spirit fighters. The importance of successive victory points is obviously important to them. Consequently, I can certainly conclude that the fifty eight ranked Ocean Soul Brothers will definitely give it their all.”</p><br/><p>“Next let us take a look at their opponents. Phoenix Fragrance Combination. A combination of two people, once called Phoenix, one called Fragrance. It’s the first time they participate in our Vast Sea Great Spirit Arena’s competitions. Phoenix is a fifty ninth ranked Spirit Master, Fragrance is forty fifth ranked. Honestly, I’m not very optimistic about this new combination. If they want to win against the formidable Ocean Soul Brothers, they will have to try hard. Alright, enough nonsense, two versus two spirit fights, first round, both sides please enter the arena.”</p><br/><p>With the presenter stirring up the excitement, the audience’s mood was already sufficiently mobilized. In spirit arena competitions, one versus one and teams both drew more people than two versus two. But today every seat was packed, the majority here to see those Ocean Soul Brothers.</p><br/><p>The organizational committee clearly intended for the Ocean Soul Brothers to appear as the first fight, as for the Phoenix Fragrance Combination, that really was decided by lots. Of course, altogether only these two pairs would participate in two versus two for fiftieth ranked Spirit Masters. High level spirit masters very rarely appeared in the Great Spirit Arena, even more so in such a remote Vast Sea City.</p><br/><p>On the left side from the VIP booth, one large and one small, two silhouettes simultaneously appeared at the passage. Both wore spirit arena standard masks. Seeing them appear, everyone in the VIP room couldn’t help laughing. They could tell these two were Ma Hongjun and Bai Chenxiang just from their body shape.</p><br/><p>“Still Phoenix Fragrance Combination. Fatty really wants to glue gold to his face! That phoenix would be a brothel phoenix.”</p><br/><p>Oscar laughed.</p><br/><p>Ning Rongrong punched his arm,</p><br/><p>“Watch your words, especially in front of Xiangxiang. Don’t leak Fatty’s old stories. Otherwise, Fatty will go against you with his life.”</p><br/><p>Oscar smiled:</p><br/><p>“Don’t worry, as long as he doesn’t blurt it out, we won’t expose him. Even if I tease him every day, he’s my brother.”</p><br/><p>The simple ‘he’s my brother’ was enough to show the affection between the Shrek Seven Devils.</p><br/><p>In the arena, Ma Hongjun walked forward with large strides, stretching both hands, waving vigorously towards the spectators all around. As a member of the Shrek Seven Devils, he had seen enough spectacle. What did any number of spectators count for. Fatty seemed calm, full of confidence.</p><br/><p>Bai Chenxiang wasn’t as calm as him. The little girl was clearly a bit nervous, following close behind Ma Hongjun. The audience’s ear splitting roar left her mind blank, the hollow of her palms already covered with sweat. She clearly remembered, in the waiting room, the pitying expressions on the faces on those spirit masters preparing to fight when they heard their opponent was the Ocean Soul Brothers. Clearly, their opponents were completely formidable. This was her first time in a spirit fight, so how couldn’t she be nervous when facing formidable opponents?</p><br/><p>Ma Hongjun confidently walked up to the edge of the pool. Because Bai Chenxiang was nervous, she almost walked into him. Ma Hongjun turned around, very naturally holding Bai Chenxiang’s hand and pulling her up next to him, saying in a low voice:</p><br/><p>“Don’t be afraid, I’ll deal with everything.”</p><br/><p>If it was normally, Bai Chenxiang would definitely have broken free of his hand, but under the circumstances before her, the panic and nervousness eased a lot as Ma Hongjun held her hand, and she subconsciously let him hold on.</p><br/><p>Just at this moment, even louder cheers suddenly erupted. After a burst of clamor, on the other side of the pool from Ma Hongjun and Bai Chenxiang, two people walked out.</p><br/><p>Those two seemed like forty something middle aged men. They didn’t wear masks like Ma Hongjun and Bai Chenxiang, and the two looked exactly the same. Built tall and sturdy, and on the right side of their necks, they had tattoos like fish gills.</p><br/><p>Seeing these two appear, Tang San couldn’t help frowning in the VIP lounge,</p><br/><p>“Fatty might have met his match. These two spirit masters might not be too easy to deal with!”</p><br/><p>Dai Mubai leaned back in the VIP lounge’s soft sofa, eating fruit Zhu Zhuqing held to his mouth:</p><br/><p>“No way. With Fatty’s strength and spirit, he still can’t beat spirit masters at the same level one versus two? Don’t forget that he still has the boost of the spirit bone. The power of the Phoenix spirit is also considerable.”</p><br/><p>Tang San said:</p><br/><p>“Under normal circumstances, dealing with two spirit masters of the same level wouldn’t be a problem for Fatty, but the fighting environment here is different. When fighting in the pool, and the opponents being sea spirit masters, they have a natural advantage. Moreover, these Ocean Soul Brothers are twins. They’re bound to have extremely good cooperation. Grandmaster once said that twins are most likely to possess the kind of ability you and Zhuqing have.”</p><br/><p>Hearing Tang San say this, Dai Mubai couldn’t help sitting up straight, his eyes also serious,</p><br/><p>“You’re saying……”</p><br/><p>Tang San nodded, saying:</p><br/><p>“I hope Fatty won’t lose too badly.”</p><br/><p>Ma Hongjun naturally couldn’t hear Tang San’s analysis, right now he was full of confidence, wholeheartedly looking forward to showing off in front of his sweetheart. Originally he didn’t put the two opponents in his eyes, raising his right hand and pointing at the counterpart, hooking his forefinger at them, making an extremely provoking gesture.</p><br/><p>This action immediately made the audience explode. For a moment, the curses became white noise, naturally they were all cursing Fatty for overestimating his abilities.</p><br/><p>The Ocean Soul Brothers didn’t react to Ma Hongjun’s provocation, only their originally calm and collected gazes turning ice cold. The older brother was called Hai Bai, the younger Hai Gui, the characters for their names just making up the character for soul[3].</p><br/><p>The announcer’s voice was shocked:</p><br/><p>“Ah, we saw it, Phoenix Fragrance Combination actually provoked the Ocean Soul Brothers. It seems we’ll have to pray for them. Both sides can release your spirits. Countdown from five. Five, four, three, two, one, begin.”</p><br/><p>At the same time as the announcer counted down, both sides released their spirits. Ma Hongjun kneaded Bai Chenxiang’s little hand. Bai Chenxiang knowingly released her Needle Tailed Swift spirit, two yellow and two purple spirit rings alternately soaring up. In practically just the blink of an eye, she was already flying in the air above the pool. A pair of wings flapping behind her back, extremely fast, making the opposing brothers’ expression cold.</p><br/><p>But just at this moment, Ma Hongjun also released his Phoenix spirit. Red hot phoenix flame soared towards the sky, reddish golden light washing the air around him, burning hot aura, dazzling light, immediately made the crowd silent.</p><br/><p>However, the spectators were only silent for a moment. The next instant, the crowd turned into a sea of roaring laughter. The Vast Sea Great Spirit Arena actually had a fire type spirit master participating? Was it deliberate suicide?</p><br/><p>The opposing Ocean Soul Brothers also simultaneously released their spirits. They naturally weren’t as ignorant as the crowd, Ma Hongjun had two yellow, two purple, one black, five ideal spirit rings. They instantly knew that their opponent today absolutely wasn’t ordinary.</p><br/><p>These two brothers’ spirit rings were of the same color, both two yellow and three purple, still considered a quite good spirit ring configuration. Their spirits were also identical. The instant they were released, both of them had a layer of wave like blue light ripples, immediately afterwards, their neck tattoos actually came alive, truly transforming into giant gills. Their bodies swelled up, both legs gathering together, transforming into a giant tail fin, their skin turning black. The two brothers leapt up simultaneously, with a putong sound from the ground, and only from the ground, they dove into the giant pool, not making the slightest sound as they entered the water.</p><br/><p>Most bizarre, after they entered the water, the entire spirit arena pool surface remained calm.</p><br/><p>Ma Hongjun also leapt into the air at the same time as those two dove into the water. In this spirit arena they had to enter the range of the spirit arena pool. At the same time as he soared up, his third spirit aring abruptly shone, enormous phoenix wings suddenly unfolding from his back, supporting him to float in the air above the pool.</p><br/><p>In fact, along with his spirit power rising, Fatty’s phoenix wings also became even more gorgeous than before. Each wing was three meters long, and even though it was condensed from flame, the wings had not only flames, but still deep red feathers. The flame turned tangible.</p><br/><p>No matter how Fatty showed off before, at the spirit he displayed now was extremely magnificent. Spectators familiar with spirit fighting immediately grew interested. Two flying spirit masters against two sea spirit masters. When all was said and done, who would win? No, it should be a question of how much trouble could these flying spirit masters bring the Ocean Soul Brothers? Even now, these common spectators didn’t believe Ma Hongjun and Bai Chenxiang could win this fight.</p><br/><p>Ma Hongjun had just flown up above the pool when he attacked, apparently somewhat anxious to get started. Under the effect of Phoenix Ascension, he drew a deep breath floating in midair. Immediately afterward, an intense reddish gold flame jetted out from his mouth, targeting the pool below him.</p><br/><p>A shocking scene appeared. With just a popping sound, the originally calm surface could no longer stay calm. Large clouds of steam rose, that phoenix flame unexpectedly sinking straight into the water.</p><br/><p>Everyone watched dumbstruck. The flame didn’t stop burning when immersed in water, and in that clear water appeared a pillar of flame. The water around the flame pillar constantly churned, sending large amounts of steam into the air.</p><br/><p>In the VIP lounge, Dai Mubai was already standing, shocked saying:</p><br/><p>“What’s that damn Fatty doing?”</p><br/><p>Tang San frowned, but very soon his brow smoothed. The corners of his mouth revealed a faint smile,</p><br/><p>“Clever.”</p><br/><p>Large amounts of steam billowed up, but as long as it came near Ma Hongjun, it immediately disappeared. Fatty’s phoenix flame was only maintained in the water, it didn’t grow stronger, but neither did it weaken.</p><br/><p>The announcer’s cry of alarm appeared once again,</p><br/><p>“Wah, what’s this flame type spirit master doing? Heavens, how come his flame doesn’t feat water? Don’t tell me he’s going to evaporate the entire spirit arena pool?”</p><br/><p>Fatty’s freakish actions naturally drew the attention of the Ocean Soul Brothers. Being in the water, they sensed it most clearly. Ma Hongjun’s phoenix flame entered the water, but they clearly understood, relying on just this spirit ability to evaporate all the water, that was impossible. In fact, this pool was more than a hundred meters in diameter, and ten meters deep, how much water was that! In order to maintain such a spirit arena pool, the Vast Sea Spirit Arena had spent vast manpower and resources.</p><br/><p>However, at the same time they also discovered that, since Ma Hongjun’s phoenix flame entered the water, the originally cool water had begun to change. The water temperature unexpectedly began to slowly rise. Even though it rose very slowly, as sea spirit masters, their sensitivity still picked up on the changes.</p><br/><p>The two brothers couldn’t help being shocked, just what kind of flame was this? To be able to make such a large body of water slowly heat up, what kind of terrifying level of heat did the flame itself reach? This couldn’t go on.</p><br/><p>Hai Bai and Hai Gui launched attacks at Ma Hongjun practically simultaneously. Two clearly visible streams of water rose on either side of Ma Hongjun, turning into two giant water dragons, simultaneously striking at him.</p><br/><p>Ma Hongjun gave a cold snort,</p><br/><p>“Minor tricks.”</p><br/><p>He was waiting for them to attack.</p><br/><p>The Phoenix Fire Wire amplified by Phoenix Ascension heating the water was deliberate. Actually, doing this was considerably exhausting for his spirit power, and it was also basically impossible for him to heat this pool to any extreme degree. This much water wasn’t that easy to boil. He wanted to draw out the two sea spirit masters to attack him. Phoenix Ascension consumed a considerable amount of spirit power, especially when maintaining flight. If he couldn’t finish it quickly, this fight would definitely be a loss. And since the opponents attacked him in a panic, then, the chance for victory had come.</p><br/><p>The giant phoenix wings suddenly retracted to his sides, then again flapped out, meeting those two charging water dragons. Instantly, the air exploded into two enormous clouds of steam, the two water dragons instantly vaporizing in the phoenix flame. The Phoenix Fire Wire Fatty had always been blasting into the pool simultaneously swung out, sweeping like a whip from the water towards the elder Ocean Soul Brother Hai Bai.</p><br/><p>The phoenix flame attribute really was too terrifying, wherever it passed, the water boiled. Even though this was only a small part of the spirit arena pool, that white steam soared in an extremely imposing manner.</p><br/><p>Before the Phoenix Fire Wire had even arrived, Hai Bai already felt the surrounding water temperature soar. With a flip of his tail fin, he immediately gained some distance. His speed under water was no less than an arrow, and left Ma Hongjun shocked. This Phoenix Fire Wire immediately lost its target.</p><br/><p>Hai Gui quickly moved to his elder brother’s side. These twins’ minds were linked, and their third spirit rings brightened simultaneously.</p><br/><p>Brilliant purple light colored the water around them. In that instant, the entire spirit arena’s water surface immediately fluctuated.</p><br/><p>The Ocean Soul Brothers’ spirit was Seal, and these third spirit abilities was Raging Waves And Stormy Seas. As sea spirit masters, their fighting ability on land was very low, but in water, it was quite frightening.</p><br/><p>Under the effect of their spirit ability, the entire spirit arena pool constantly surged up, wave after wave gradually rising. In a moment’s work, they were unexpectedly rising close to ten meters high, rushing straight towards Ma Hongjun. Even more frightening was that each wave was taller than the last. The waves were also faintly purple.</p><br/><p>Ma Hongjun could actually completely rely on his flying ability to rise higher, avoiding these waves. He also saw that, with these two brothers infusing their spirit abilities, this wasn’t any ordinary water. But Fatty intended to show off in front of Bai Chenxiang, and naturally couldn’t just dodge.</p><br/><p>The phoenix wings spread out, a loud and resonant phoenix cry emerging from Fatty’s mouth, and his figure could be seen, just keeping close to those waves, charging to meet them. At the same time as he flew, Fatty’s second spirit ring, Bathing Fire Phoenix, also launched.</p><br/><p>Phoenix wings plus Ma Hongjun’s body, reached a frightening width of seven meters. Both sides directly launched a head-on confrontation.</p><br/><p>Chi—— An ear piercing sound spread to everyone present. The crowd immediately held their breaths, their eyes wide, attentively watching the scene. In the end, would Ma Hongjun’s phoenix flame be eradicated by that wave after wave of Raging Waves And Stormy Seas, or could he rely on that intense phoenix flame to break the siege? With Fatty’s previous display, the head-on collision in front of them already drew a large question mark in the hearts of the spectators.</p><br/><p>In the VIP booth, Tang San, Dai Mubai, Oscar and the others spoke one word in practically the same voice:</p><br/><p>“Idiot.”</p><br/><p>Finally, the conclusion appeared. Surging reddish golden flame shot towards the sky, the wave was ultimately unable to quench the flames of the phoenix. Even though Ma Hongjun was stout, set off by the phoenix flames, right now he had the imposing manner of a monarch overlooking his domain.</p><br/><p>Raging Waves And Stormy Seas quieted down. The Ocean Soul Brothers trembled in the water. Ma Hongjun overcame the waves, making the water temperature around them swiftly soar. Moreover, under the pull of the energies, a part of the flame strength had infected their bodies, unspeakably difficult to bear.</p><br/><p>Two against one, the other side’s other Spirit Master still hadn’t attacked from high in the air. Taking such a great loss while confronting a Spirit Master of the same level, the Ocean Soul Brothers had never encountered such circumstances.</p><br/><p>The two brothers looked face to face, both finally saw the anger in the other’s heart. Then their fifth spirit rings brightened.</p><br/><p>And in midair, with the dazzlingly beautiful flame tail soaring up, Fatty was inwardly whining. Even though he’d won in the previous confrontation, it hadn’t been easy.</p><br/><p>The formidable impact of Raging Waves And Stormy Seas made the qi and blood within his body roil. That was still the spirit ability launched by two spirit masters of the same level as him. Even though his Phoenix Spirit’s quality was higher than the opponents, simultaneously enduring the impact of two people was still hard to take. Even if the phoenix flames weren’t extinguished in water, that water and fire mutually suppressed each other still wouldn’t change. Fatty had again deliberately acted strong, both wings unfolding completely, enduring the attack of the waves to the greatest degree, so the spirit power consumption could be imagined. This was also why the three people in the VIP lounge had cursed him for an idiot.</p><br/><p>Fatty’s current strength still couldn’t be completely adapted to fighting in the air. Phoenix Ascension’s spirit power consumption was large in itself, and he still exhausted himself one step further. On the surface he might seem to hold the advantage, but right now he was actually at a disadvantage. If his spirit power consumption reached a certain degree, then there would be no need to fall into the water. As long as his spirit power couldn’t maintain the phoenix wings, then this spirit fight would also be over.</p><br/><p>The Ocean Soul Brothers clearly didn’t intend to let Ma Hongjun catch his breath. Even though they were internally affected by fire energy, by now it seemed to have already scattered on its own. Their strongest fifth spirit rings were already completely lit, and the water in the spirit arena pool undulated fiercely. Along with being colored by a purple ring of light, one purple water arrow after another shot up.</p><br/><p>[1] This whole “your face” (or more accurately “a face”, but that doesn’t read well in English) thing is slang that actually originated with Douluo Dalu, eventually spreading to the Chinese online community. The expression has its own Baidu (Chinese wiki) article: http://baike.baidu.com/view/2714537.htm </p><br/><p>(Though the article refers to this chapter for a definition)</p><br/><p>[2] Phoenix Fragrance Combination - () Uses the “fragrant” from Bai Chenxiang’s name.</p><br/><p>[3] Hai Bai () is “Ocean White”, and Hai Gui () is “Ocean Ghost”, white and ghost are the components of po () “soul”.</p><br/>\n</div>"}