{"title": "Chapter 214", "id": 214, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-214", "volume_title": "Volume 3", "body": "<h1>Chapter 214</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 214</p><br/><p>Master, Don’t Want Sexual Services?</p><br/><p>(TL by Bagelson)</p><br/><p>Ji Xiang was currently shouldering an important mission. He took the initiative to ask to help Tang San feed all the Shrek Seven Devils. Tang San held them up, he fed them, letting everyone eat a bowl of gruel. Just like when he brought back Tang San before, everyone still weren’t suited to eating too much.</p><br/><p>After everyone finished eating, Tang San also ate a bit. Xiao Wu slept in the only bed in the room. Tang San walked over to Purple Pearl.</p><br/><p>“Want to eat something? I’ll release you temporarily, but please keep your mouth in order. I’m Tang San, you can call me by my name. If you agree, blink once.”</p><br/><p>Hearing Tang San’s words, Purple Pearl blinked once as expected.</p><br/><p>Tang San didn’t touch Purple Pearl, she was after all a woman. Blue Silver Emperor stretched out, opening Purple Pearl’s numbing and muting acupoints.</p><br/><p>Acupoints unblocked, Purple Pearl’s body softened, almost falling to the ground. Pushing herself up, she glared hatefully at Tang San,</p><br/><p>“Do you know sorcery?”</p><br/><p>Tang San smiled faintly, saying:</p><br/><p>“You should understand that this is a kind of skill.”</p><br/><p>Purple Pearl snorted coldly, and didn’t keep speaking, instead walking over to the remaining food with large steps. Heedless of the food already being cold, she ate with large gulps. Her table manners were unsightly, comparable to Ma Hongjun before. She didn’t even seem like a woman. Tang San frowned as he watched.</p><br/><p>In just a short while, Purple Pearl finished the food like wind scattering clouds. Without even glancing at Tang San, she stalked back to sit in her corner, closing her eyes and falling asleep.</p><br/><p>The corners of Tang San’s mouth revealed a trace of a smile. He could tell that this captain really was very depressed. He didn’t say anything either, his gaze slightly sweeping outside, and a few pirates sticking their heads out quickly hid. He seemed like he didn’t see anything, sitting cross legged in the center of the room with his eyes closed to cultivate.</p><br/><p>The seabreeze brushed the trees on the island, generating rustling sounds. Winter was already approaching, and there were few leaves in the forest. Only, the temperature at sea was a bit higher than inland, and the ocean climate meant it wasn’t too cold here.</p><br/><p>The night gradually deepened. Tang San quietly cultivated, and the Shrek Six Devils were all deep asleep. This room lacking a wall on one side seemed very quiet.</p><br/><p>Just at this moment, leaning in the corner, Purple Pearl quietly opened her eyes. Looking at Tang San, her eyes expressed ferocity, and she pulled a grimace in his direction. Looking all around, she quietly shifted her body. She didn’t move far, only one meter or so, where there was a table. Purple Pearl directly crawled under the table, stretching her hand to softly push under the table. The floor beneath the table immediately flipped over, and she instantly disappeared. The whole process unexpectedly didn’t cause any noise.</p><br/><p>“No need to watch. Keep cultivating.”</p><br/><p>A few seconds after Purple Pearl disappeared, Tang San’s faint voice echoed.</p><br/><p>Ji Xiang opened his eyes, looking puzzled at Tang San,</p><br/><p>“Master, you let her leave on purpose?”</p><br/><p>Tang San smiled calmly, saying:</p><br/><p>“Do you believe she could leave otherwise? Very soon she will be able to feel her strength recover. In half an hour, she will definitely bring a large number of pirates to storm this place. Do you believe it?”</p><br/><p>Ji Xiang looked at Tang San, his eyes filled with doubt.</p><br/><p>Tang San smiled:</p><br/><p>“I only want to tell her that, no matter what she does, there’s basically no way for her to constitute a threat to me. I let her go for this reason. It will take at least five days for my comrades to heal. I don’t want to be on guard against these pirates all day long, so it would be better to convince them once.”</p><br/><p>Ji Xiang seemed to understand somewhat, blinking, he asked Tang San:</p><br/><p>“Master, your sixth spirit ring really is of the hundred thousand year level?”</p><br/><p>Tang San’s brows wrinkled, but he still nodded softly,</p><br/><p>“Later master will let you see another type of our sect’s secret skills. Your spirit is a Needle, it’s quite suited to this kind of skill.”</p><br/><p>Just as Tang San said, in less than half an hour, the outside was already growing noisy. Purple Pearl’s arrogant voice resounded,</p><br/><p>“Surround it, don’t let even a housefly get out. Fucker, that bastard, if I don’t make him drink two basins of foot bath water, he won’t know how fearsome Purple Pearl is!”</p><br/><p>Hearing Purple Pearl’s voice, Tang San couldn’t help smiling, but he remained as motionless as a mountain. Ji Xiang always sat to the side watching Tang San. Tang San’s calm gave people a sense of relief, as if he didn’t need to have the slightest concern about whatever was happening outside. Tang San seemed like a solid rampart that could protect them all.</p><br/><p>“Tang San, you son of a bitch, get out her. Fuck, in all my years I’ve never been so humiliated. I want to see how you alone will face thousands of us. I won’t push you, just drink two basins of my foot washing water and I’ll let you go. Of course, that little girl has to stay to be my wife.”</p><br/><p>By now, Purple Pearl’s house was already surrounded by densely packed pirates, torches held high for illumination, leaving the village brightly lit. Practically all the spirit masters were concentrated in the inner circle, each and every one cautiously watching the wooden house.</p><br/><p>That old pirate who talked to Tang San in daytime now stood next to Purple Pearl, talking to her in a low voice:</p><br/><p>“Captain, that person isn’t easy to deal with. I think we should let it be. Anyway, they’ll just rest here and then leave. Since you’ve already escaped, as long as they don’t do anything to jeopardize us Purple Pearl pirates, it’s best not to antagonize them.”</p><br/><p>“Bullshit.” </p><br/><p>Because of Purple Pearl’s anger, her extremely ample chest heaved forcefully,</p><br/><p>“When have I ever been this angry, I said I’d have him drink two basins of foot washing water, so I’ll definitely have him drink it. Tang San, you son of a bitch, get the fuck out here.”</p><br/><p>Just at this moment, a graceful voice disseminated from the house,</p><br/><p>“Purple Pearl, have you heard that expression? The sins of Heaven can be forgiven, the sins of oneself, cannot.”</p><br/><p>Purple Pearl stared blankly a moment,</p><br/><p>“At a fucking time like this, and you’re still playing with words. Kid, you listen to me. I won’t bother your companions, but I’ll have you account for what you did today. There’s thousands of us here, if each of us spits once, we could drown you.”</p><br/><p>Distantly, she could see the circumstances in the room through the broken wall. Tang San all along sat in the same place, without a bit of alarm over her presence outside, to the extent that he even sat there with his eyes closed. Even though she wouldn’t admit it herself, Tang San’s manner secretly made even her enchanted.</p><br/><p>The pirates closed in step by step, pushing in towards the wooden house. But Tang San’s display during the day still had a tremendous awing effect, and even though they constantly pushed forward, they didn’t dare rush. The stronger the spirit master, the better they understood the strength Tang San displayed when he contained Purple Pearl. Especially that hundred thousand year spirit ring had an enormous force of impact to these pirate spirit masters. Who knew how frightful the abilities of that sixth spirit ability was?</p><br/><p>Slowly getting up, Tang San patted Ji Xiang’s shoulder,</p><br/><p>“Do your best to experience my skills. No need to try to see it clearly, for this consummate skill you first of all need to view the general situation. As for everything else, it can all be cultivated after hand.”</p><br/><p>Faint light flickered, and Tang San’s face displayed a faint smile. His comrades were all well, and moreover gathered together again, so by now his mood had already completely recovered to normal, he naturally didn’t have any killing intent towards the pirates outside.</p><br/><p>The moment Tang San appeared in the doorway, all the pirates subconsciously halted, each and everyone nervously watching at Tang San. The spirit master pirates all released their spirits without a moment of hesitation, but they were still showing signs of trembling with fear.</p><br/><p>As captain, Purple Pearl immediately discovered the issue with her subordinates, and angrily said:</p><br/><p>“You cowards, we have more than two hundred spirit masters, he’s alone. If we each throw out one spirit ability, we can still dismember that kid’s corpse in ten thousand pieces. What are you afraid of?”</p><br/><p>Tang San smiled calmly, saying:</p><br/><p>“Captain Purple Pearl. How about we make a bet?”</p><br/><p>Purple Pearl looked distracted a moment,</p><br/><p>“Bet? Kid, you like betting too?”</p><br/><p>Hearing this word, Purple Pearl’s eyes were radiant. Ordinarily, gambling could be called the greatest pleasure of pirates. Even though both sides were currently hostile, Tang San’s mention of betting was still attractive enough.</p><br/><p>Tang San hadn’t thought Purple Pearl would react like this, but this was even better for his plans,</p><br/><p>“Presumably you aren’t quite convinced of my capturing you today.”</p><br/><p>Purple Pearl furiously said:</p><br/><p>“What dogfart capturing? That was a sneak attack, if not for that, could you have caught me?”</p><br/><p>Tang San didn’t pay any attention to her fury,</p><br/><p>“Since it’s like that, if we fight one on one, are you sure of beating me?”</p><br/><p>Purple Pearl was immediately at a loss, but argued strenuously:</p><br/><p>“Why would I fight you one on one? This is my domain. As long as I give the order, you will be torn to pieces alive.”</p><br/><p>Tang San said:</p><br/><p>“Then we’ll bet. For the time of one stick of incense, I won’t use any spirit abilities, and you can have any comrades help you. In this time, I will capture you again, and moreover return to the house. If I succeed, it’s my win. If I can’t catch you, it’s my loss.”</p><br/><p>Purple Pearl stared blankly a moment, then entered a state of anger close to berserk,</p><br/><p>“Son of a bitch, are you dreaming? You want to catch me without using spirit abilities? Come on, I’ll bet with you. What are we betting?”</p><br/><p>Tang San said:</p><br/><p>“If I win, you will recognize me as your master, and listen to any of my orders. If I lose, you assign the punishment.”</p><br/><p>Purple Pearl sized up Tang San a few times. Being capable of becoming the ruler of a gang, she absolutely wasn’t an impulsive person. Even if her temper was a bit violent, at her core she was meticulous. But she wouldn’t believe that Tang San could catch her among an army of ten thousand without really using spirit abilities.</p><br/><p>“Fine, we’ll bet on it. If you lose, I won’t bother you. Drink two basins of my foot washing water, and crawl under my legs. Then I’ll let you go.”</p><br/><p>While speaking, she gracelessly raised her left leg, pointing underneath.</p><br/><p>Tang San’s expression didn’t change,</p><br/><p>“Wait until you defeat me.”</p><br/><p>Tang san flicked his wrist while speaking, already holding a stock of incense. Fingers twirling, the stick flew out, passing through a pirate’s torch, then travelling in an arc and lightly pinning onto the wall of a wooden house.</p><br/><p>This trick immediately awed the heartily laughing pirates. Letting a stick of incense ignite by passing through a fire wasn’t difficult, the difficult part lay in making it fly in an arc, and moreover making it stick on the wall with its weak body. What kind of clever soft force could achieve this?</p><br/><p>When Ji Xiang inside the house saw this move his eyes immediately brightened, vaguely already understanding what secret skill Tang San wanted to teach him.</p><br/><p>“The incense is already burning. Purple Pearl, I will begin.”</p><br/><p>Tang San wasn’t anxious to start, instead first warning Purple Pearl. This time he would convince her in heart and by word.</p><br/><p>Purple Pearl saw that calm gaze in Tang San’s eyes, without any emotion, and secretly shivered in her heart. At the same time as she released her spirit, she slid, slipping into the crowd. I can’t defeat you, but don’t tell me I can’t hide? Besides, you’re not using your spirit. If all I have to do is dodge and not get caught, then how will you make me recognize you as master? With such thoughts, the bet between Purple Pearl and Tang San officially began.</p><br/><p>Purple Pearl’s subordinates were all quite clever. Seeing the captain swiftly retreat, the pirates immediately formed a human wall. Tang San never said they couldn’t attack, so these pirates naturally didn’t hesitate to launch their own spirit abilities. Not looking for achievements, just avoiding mistakes. Each and every one naturally started their defensive abilities, hoping to block Tang San. Not attacking was the intelligent choice, because they didn’t want to infuriate Tang San. Even the captain couldn’t defeat this kid, let alone these universally twenty or thirty ranked spirit masters.</p><br/><p>Unfortunately, Tang San basically had no intention of relying on movement to catch Purple Pearl. Both his hands brushed the Twenty Four Moonlit Bridges at his waist, a sparkling radiance already floating in the air. In the firelight, those crystalline lights immediately flew up, rushing into the pirate group with sharp whistling sounds.</p><br/><p>This was the Tang Sect hidden weapons technique Goddess Scattering Flowers.</p><br/><p>Goddess Scattering Flowers was in itself a fairly common technique among Tang Sect hidden weapons, but it was a foundation for a large number of hidden weapons techniques, like Tang Sect’s fourth ranked Thousand And One Nights, which was based on Goddess Scattering Flowers. Having been immersed in hidden weapons for so many years, Tang San was naturally so familiar with this Goddess Scattering Flowers technique that he couldn’t be more familiar. All the hidden weapons he threw were needle types, and each needle scattered as if it had grown eyes. In one move Tang San used no less than fifty silver needles.</p><br/><p>In practically the blink of an eye, the pirates in front of him collapsed like cut wheat. The collapsed pirates, without exception, were all Spirit Masters.</p><br/><p>Watching their comrades fall, the next line of pirates immediately looked distracted. They basically hadn’t even seen how Tang San did it. Immediately afterward, Tang San’s second wave of silver needles appeared.</p><br/><p>The forte of Tang Sect disciples was chaotic group fights, especially after reaching grandmaster level, as long as they had enough hidden weapons, they basically didn’t fear enemy numbers.</p><br/><p>These pirates had no mortal enmity, and even more wouldn’t go threaten everyone in the house, so Tang San would naturally hold back. At the same time as the second wave of silver needles shot out, he himself also floated forward, rushing among the pirates alone.</p><br/><p>Due to silver needles, large numbers of pirates fell to the ground. None of these collapsed Spirit Masters were above fortieth rank. For fortieth rank and below Spirit Masters, Tang San’s silver needles were enough to break their defensive spirit abilities.</p><br/><p>Purple Pearl had now already dodged into the pirate group, and still hadn’t discovered what happened outside, but she still heard the cries of alarm. Just as she wondered what had happened, suddenly, a warm feeling rushed into her body. At the same time she vaguely saw a faint blue light from the ground.</p><br/><p>Purple Pearl Island also possessed blue silver grass, just not all that much. Relying on the guidance of the Blue Silver Domain, let alone a few thousand, even among tens of thousands, Tang San would still easily be able to locate Purple Pearl.</p><br/><p>Ghost Shadow Perplexing Step launched. The pirates had already begun to attack Tang San, but he seemed to have grown a thousand arms, each time he raised his hands pirates would collapse. Those nearby with sealed acupoints, some more distant greeted by hidden weapons.</p><br/><p>Among these pirates, there were also dozens of fortieth rank or above Spirit Masters, who started encircling Tang San. Unfortunately, faced with the marvellous Ghost Shadow Perplexing Step, even the pure speed Bai Chenxiang had no way to deal with it, let alone these sea Spirit Masters who could only reveal their full strength in the ocean.</p><br/><p>With the strength of one person, moving unhindered among thousands of pirates, yet nobody could bar Tang San’s path, his white shadow could be seen weaving unhindered back and forth through the pirates, large numbers of pirates constantly collapsing. The hidden weapons gradually did not only stick to silver needles, Tang San after all had a limited amount. Various kinds of hidden weapons started to appear, but these hidden weapons didn’t reveal any killing power, guided by Tang San’s ten dextrous fingers, they found the pirates’ acupoints.</p><br/><p>Purple Pearl finally discovered what was going on, and she also saw Tang San only a few dozen meters away. Seeing numerous group members collapsing, her mind had already turned blank.</p><br/><p>Was, was he still human? She clearly saw that Tang San complied with his promise, and didn’t use any spirit abilities, so much that he hadn’t even released that blue golden spirit. But even like this, nobody could block his path forward.</p><br/><p>The incense had already burned by half. But there were already several hundred pirates on the ground. In the eyes of the pirates, Tang San’s completely emotionless gaze was half like the descent of a death god.</p><br/><p>Suddenly, Tang San’s gaze met Purple Pearl’s. Purple Pearl saw the faint smile on his face, it didn’t hold any contempt, but was full of confidence, absolute confidence.</p><br/><p>Completely suppressed by such imposing manner, Purple Pearl couldn’t even display seventy percent of her strength. All she wanted to do now was run, run to the ocean as fast as possible. She believed that, as a landlubber Spirit Master, Tang San wouldn’t have any way of catching her in the sea.</p><br/><p>At this moment, Purple Pearl couldn’t help somewhat hate that she had placed this village at the center of the island. If it was at the seaside, maybe she could already have rushed into the sea.</p><br/><p>The only thing she was still grateful for, was that she could see that Tang San’ hadn’t killed anyone, those collapsed pirates had just temporarily lost the ability to move.</p><br/><p>“Block him, block him for me!”</p><br/><p>Purple Pearl shouted loudly, her fourth spirit ring abruptly brightening, suddenly crawling on the ground, the dark grey scales all over her body became even darker, she swiftly moved in the direction of the sea, leaving behind a faint afterimage.</p><br/><p>Tang San’s heart shivered. Through the Blue Silver Domain, he clearly felt Purple Pearl now moving forward with extreme speed. When passing through her subordinates, her speed wasn’t influenced at all. This spirit ability should be mainly for dodging attacks. According to her present speed, even though the pirates blocking him were insignificant, they were still numerous, and by the time he caught up to Purple Pearl, time would have run out, or she would have escaped into the ocean.</p><br/><p>Just as Purple Pearl surmised, if she really entered the ocean, Tang San would have no way of dealing with her.</p><br/><p>A loud resonant cry issued from Tang San’s mouth. No longer hiding his strength, an instant movement, and Tang San appeared fifty meters away. He started using teleportation. Each time Tang San flashed through the pirate crowd, there would inevitably be a batch of pirates collapsing to the ground. The distance to Purple Pearl grew closer and closer.</p><br/><p>Purple Pearl did her utmost to escape, and soon, the shore was already in sight. However, at the same time she also felt an aura quickly approaching behind her.</p><br/><p>A flash of light, and Tang San appeared in front of Purple Pearl out of nowhere, watching her with a smile.</p><br/><p>Purple Pearl suddenly stopped,</p><br/><p>“You’re shameless.”</p><br/><p>Tang San calmly said:</p><br/><p>“Not at all, I only said I wouldn’t use spirit abilities, I never said anything about spirit bone abilities. You should have seen very clearly that I didn’t even release my spirit. No need to stall for time, it’s useless. Concede.”</p><br/><p>“Drop dead.”</p><br/><p>Purple Pearl’s dark gray scales brightened, an immense coiling image appearing behind her back. That illusion gradually took shape, and moreover quickly split, unexpectedly separating into nine more than ten meter long giant serpents, pouncing at Tang San.</p><br/><p>Sixth spirit ability? Tang San’s gaze still didn’t change, he could sense that Purple Pearl was now just making a show of strength. She basically didn’t have the determination to bet her life. At the same time as she released the spirit ability, this lord captain used the cover of the illusion to quietly crawl sideways, heading directly for the sea. Her sixth spirit ability was more to confuse Tang San, to block him.</p><br/><p>Of course, the might of this sixth spirit ability was still quite fearsome. Tang San believed that if this spirit ability was used at sea, its strength would definitely be even greater.</p><br/><p>The nine giant serpents simultaneously rammed Tang San. Tang San opened his arms, his eyes closed, receiving the attack of the nine giant serpents as if enjoying it.</p><br/><p>All the pirates that could still move saw this scene clearly, Tang San’s body brightened with a golden light, and the nine giant serpents that abruptly struck his body were smashed to fragments, basically not causing Tang San any harm. And at this moment, a blue light shot out from between Tang San’s eyebrows, catching up to Purple Pearl in the blink of an eye. The blue light flashed and stilled, and Purple Pearl was no longer able to move a single step. It was the Vast Sea Cosmic Shroud’s additional ability, Cosmic Stasis Barrier. Tang San firmly believed that Purple Pearl, with spirit power level roughly equal to his own, absolutely wouldn’t be able to break through the Cosmic Stasis Barrier. And at this moment, Purple Pearl was only one step away from the sea.</p><br/><p>Quiet, several thousand assembled pirates were quiet. Tang San waved his left hand, and that Cosmic Stasis Barrier enveloping Purple Pearl flew back. A bizarre scene played out. That pyramidal light barrier shrunk in midair, and by the time it reached Tang San’s left hand, it was only thirty centimeters high, resting in Tang San’s palm. And inside, Purple Pearl had also shrunken, sitting there with a disappointed expression.</p><br/><p>Turning around, Tang San walked step by step in the direction of the pirate village, and the at least two thousand pirates still able to move quietly opened up a passage. Blankly staring at Tang San walking past in front of them, not one dared to block him. Each time Tang San’s toes touched the ground, he would slide forward several dozen meters, floating in the air like an immortal.</p><br/><p>In front of absolute strength, they could only keep quiet. Resolute people nodded slightly, shocked to discover that in less time than it took a stick of incense to burn, there were actually more than five hundred pirates on the ground unable to move, and they included a hundred relatively weaker Spirit Masters.</p><br/><p>What kind of strength was this!</p><br/><p>In the daytime, Tang San had once threateningly told Purple Pearl with killing everything down to the chickens and dogs here. At that time the pirates had only treated it as bluster, but at this moment, the strength Tang San had displayed made them tremble from their souls. If this man wanted to kill people, who could stop him? Maybe he couldn’t kill everyone in an instant, but if given enough time, this could absolutely be accomplished.</p><br/><p>As Tang San returned to the wooden house, that stick of incense was just burning to an end, still not extinguished.</p><br/><p>When Ji Xiang saw Purple Pearl inside that blue pyramid in Tang San’s hand, his pupils contracted. Even though he hadn’t seen how Tang San accomplished it in the end, he was already completely convinced by Tang San’s strength.</p><br/><p>At the same level, without using his spirit, catching someone and coming back from among thousands of pirates as easy as reaching into his pocket, and still leaving hundreds of pirates without the strength to move. What kind of strength was this? If this teacher of his truly began a slaughter, then how many people here could survive?</p><br/><p>With a flick of his wrist, Tang San withdrew his Vast Sea Cosmic Shroud. Purple Pearl’s body spun once in midair, growing larger, and by the time she hit the ground she was already restored to her original size.</p><br/><p>“You lose.”</p><br/><p>Tang San’s voice was still calm, as if this victory was inevitable.</p><br/><p>Slowly standing up, Purple Pearl’s eyes revealed a difficult to express mood. This time, she no longer cursed, only looking at Tang San, her expression somewhat strange. After a long time she still didn’t speak a word. And behind her, all the pirates watching Tang San had nothing but fear in their eyes.</p><br/><p>Tang San called over Ji Xiang, telling him:</p><br/><p>“I sealed the acupoints of the people on the ground, you go remove it for each of them, use the Mysterious Heaven Skill you just learned, concentrating it in your palm, then smack this place on their chest. Control your strength properly, use about a tenth of your current spirit power. Take back the silver needles or other hidden weapons piercing them, they will all be at their shoulders. Go.”</p><br/><p>Tang San softly poked a position on Ji Xiang’s chest, telling him the location of the acupoint.</p><br/><p>“Yes, teacher.”</p><br/><p>Ji Xiang knew that this was a training his master had for him, and quickly left.</p><br/><p>Ji Xiang hurriedly walked away, and Tang San’s gaze turned back to Purple Pearl. He didn’t rush her, only looked at her calmly.</p><br/><p>Purple Pearl fiercely clenched her teeth,</p><br/><p>“A loss is a loss, I admit it.”</p><br/><p>Speaking, she kneeled in front of Tang San with a thump, loudly calling out:</p><br/><p>“Master, hereafter I am yours.”</p><br/><p>Tang San’s originally calm expression showed a fraction of shock, helplessly shaking his head.</p><br/><p>Purple Pearl then turned around,</p><br/><p>“Fuck, what are you still standing around for, I’m kneeling, and you’re still standing? He’s my master, hereafter he’s also the master of our Purple Pearl pirates.”</p><br/><p>The pirates now returned to themselves. Immediately, the crowd grew shorter,</p><br/><p>“Master——”</p><br/><p>Their shouting wasn’t force, on the contrary it had a feeling of cheerfully submitting. Tang San had relied on his own strength to convince these pirates. Even though they might not be loyal to him, they absolutely admired Tang San’s strength.</p><br/><p>“All rise. It’s late, go home and rest.”</p><br/><p>Tang San waved his hand, turning and walking into the wooden house.</p><br/><p>Purple Pearl looked distracted a moment. First to stand, she called out:</p><br/><p>“Master, is this it? You’re not planning on having me do something?”</p><br/><p>Tang San halted, turning his head to her,</p><br/><p>“What do you want to do? We have no past hatred. Go rest.</p><br/><p>“Finished speaking, he walked into the house once again.</p><br/><p>Purple Pearl unexpectedly revealed a shy expression;</p><br/><p>“Master, I suddenly find myself starting to like men. You don’t want sexual services?”</p><br/><p>Just stepping into the room, Tang San staggered, his rear view also seeming a bit rigid at this words. Seeing this appearance, Purple Pearl couldn’t help laughing heartily without any misgivings. Being suppressed by Tang San for a day and a night, she finally had her revenge. At least in her opinion.</p><br/><p>Ji Xiang was busy opening pirate acupoints for a whole night. Due to having to operate his Mysterious Heaven Skill each time he did, even though he ran out of spirit power several times and had to rest and recover, his control of the Mysterious Heaven Skill also increased a lot.</p><br/><p>The more pirate acupoints he unsealed, the deeper Ji Xiang’s veneration of Tang San became. So many pirates collapsed in just the time of one stick of incense, and every single pirate had been attacked in the same place. Even though Ji Xiang didn’t look at those who had their acupoints pressed, he believed that those pirates had definitely been struck in the shoulder.</p><br/><p>As Ji Xiang dragged his weary body back to the wooden house with an excited mind, the Shrek Six Devils and Bai Chenxiang were already awake.</p><br/><p>With a new lease of life after calamity, everyone couldn’t help sighing as they saw Tang San once again, recounting what had happened once again.</p><br/><p>After Ji Xiang entered, he sat honestly to the side. Tang San glanced at him saying:</p><br/><p>“Don’t sleep, cultivate according to the method I taught you. It will be beneficial to use this method in place of sleep in the future.</p><br/><p>“Yes, master.”</p><br/><p>Ji Xiang took everything Tang San said at his word. Hastily sitting cross legged, he began to cultivate according to the Mysterious Heaven Skill circulation route he remembered. According to Grandmaster’s Ten Great Core Competences, even without obtaining a spirit ring, spirit power would still constantly grow through cultivation. He just had to wait until after getting a spirit ring before it showed.</p><br/><p>“Little San, you took a disciple?”</p><br/><p>Dai Mubai was just sitting, somewhat astonished looking at Tang San.</p><br/><p>Everyone of the Shrek Seven Devils had quite resilient bodies, having eaten the immortal grade herbs Tang San gave them back then. After a night of rest, even though they still hadn’t recovered, they still wouldn’t be that weak. Only Bai Chenxiang’s circumstances were a bit worse, her body wasn’t at the level of the Shrek Seven Devils, and still needed some time to recover.</p><br/><p>Tang San said:</p><br/><p>“Fortunately Ji Xiang saved me. Otherwise, you might not have seen me again. To tell the truth, I don’t know how I escaped the Deep Sea Demon Whale. When I fell unconscious, I already felt my body being crushed by the falling seawater. That I could survive this time can only be described as luck. At least on the surface I’ve captured the Purple Pearl pirates here. Once you’re well, we’ll leave for Seagod island. I trust Purple Pearl should know the way.”</p><br/><p>“Master, you’re going to Seagod Island?”</p><br/><p>Ji Xiang, just entering cultivation state, suddenly opened his eyes, looking at Tang San with astonishment.</p><br/><p>Tang San nodded,</p><br/><p>“You know the circumstances of Seagod Island?”</p><br/><p>Ji Xiang’s expression revealed a trace of sadness, softly saying:</p><br/><p>“Actually, I come from there.”</p><br/>\n</div>"}