{"title": "Chapter 222", "id": 222, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-222", "volume_title": "Volume 3", "body": "<h1>Chapter 222</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 222</p><br/><p>God Bestowed Spirit Ring</p><br/><p>(TL by Bagelson)</p><br/><p>Seagod Douluo Bo Saixi looked at Tang San, filled with admiration,</p><br/><p>“Very good, worthy of being the examinee for the Seagod nine tests. Figuring out the true secret of the Seagod’s Light so early, you’re not a waste of the lord Seagod bestowing you the higher trials.”</p><br/><p>Hearing the praise of the highest authority on Seagod Island, everyone immediately understood that Tang San’s theory was completely correct.</p><br/><p>“I don’t dare accept senior’s praise. But I believe that we can definitely pass the lord Seagod’s trials.”</p><br/><p>Tang San neither servile nor overbearing tone was brimming with resolve.</p><br/><p>Bo Saixi nodded to him, saying:</p><br/><p>“Only you yourselves can help you, this is the only time I will give you hints. Of course, if you hadn’t already figured it out, I wouldn’t have confirmed anything. Each of the later trials will be more difficult than the last. You need to invest even more.”</p><br/><p>“Mant thanks, senior. Only, could I trouble senior for something?”</p><br/><p>Tang San asked Bo Saixi.</p><br/><p>“Speak. As long as it isn’t related to the tests you need to take, I will satisfy you as far as possible.”</p><br/><p>Bo Saixi’s gaze swept, and the Shrek Seven Devils discovered for the first time that a noble aura could also bring people pressure. To them, the Seagod Douluo in front of them was no different from the ocean, both were impenetrably deep.</p><br/><p>Tang San said:</p><br/><p>“I hope you can have people bring us some food and drinking water. Best quite a lot of water, as you see.”</p><br/><p>While he spoke, he pointed to himself, then to each of the others in turn. Everyone’s clothes could only be described as a miserable sight. The Seagod Island’s four seasons were like spring, substantially different from outside. When they climbed the steps through the Seagod’s Light, each one of their clothes was soaked through with sweat. Even though they all had spare clothes, if they didn’t have enough water to bathe and wash, they well might start smelling before long.”</p><br/><p>“If we just have enough food and fresh water, we can always stay here to cultivate, to avoid wasting any of our year’s time.”</p><br/><p>Bo Saixi looked somewhat astounded at Tang San, and said:</p><br/><p>“You’re preparing to stay here constantly?”</p><br/><p>Tang San directly decided for everyone,</p><br/><p>“Each part of this year, each second, is extremely important to us. Senior, please help us accomplish it.”</p><br/><p>Bo Saixi smiled slightly, and said:</p><br/><p>“Fine. I will instruct people to prepare it for you. Oh, right, the salinity of this ring sea is very low, and moreover completely clean. It can certainly be used for washing.”</p><br/><p>Tang San exulted. Without need for him to say anything, everyone saluted Bo Saixi simultaneously.</p><br/><p>Bo Saixi’s gaze swept past Tang San to fall on Ma Hongjun,</p><br/><p>“Coming here was actually for him.”</p><br/><p>Ma Hongjun looked distracted a moment, pointing to his nose:</p><br/><p>“For me? This……”</p><br/><p>Nobody knew what this Fatty was thinking, but he blurted out:</p><br/><p>“Senior, you really are very beautiful only, I already have someone in mind.”</p><br/><p>Even a power like the Seagod Douluo stared blankly at his words. Immediately afterward, a slight blush floated onto Bo Saixi’s noble face,</p><br/><p>“Fat child, what nonsense are you talking about, I’m far older than your great grandmother, you’re looking for a beating.”</p><br/><p>While speaking, with just a wave of her sleeve, Ma Hongjun flew off like a rubber ball, directly splashing into the ring sea.</p><br/><p>Before the Shrek Seven Devils reacted, Bo Saixi waved her right hand again, and Fatty’s body flew out of the ring sea, again falling in front of her, unexpectedly without a fraction of a mistake.</p><br/><p>“Mind filled with fancy, let you soak in seawater to wake up.”</p><br/><p>This was still the first time everyone saw Bo Saixi use her full strength. What shocked them was that from Fatty being thrown off up until he was back, they actually hadn’t sensed a trace of spirit power. Was this the strength of a ninety ninth ranked power?</p><br/><p>Ma Hongjun had just carelessly swallowed a large mouthful of water. He spoke with a bitter face:</p><br/><p>“Senior grandma, my mistake. Treat what I just said as nonsense.”</p><br/><p>Fatty might seem simple and honest on the outside, but he was actually really intelligent. Confronting an opponent he couldn’t defeat, he wouldn’t force it.</p><br/><p>Bo Saixi naturally wouldn’t keep arguing with him, smiling slightly she said:</p><br/><p>“There’s never been anyone who dared talk like that to me on Seagod Island, it’s a fresh experience. Little Fatty, I’ll give you an opportunity. Sit.”</p><br/><p>Ma Hongjun looked distracted a moment, then glanced questioningly at Tang San. Tang San hastily nodded to him, indicating he do as she said. Ridiculous, if Bo Saixi wanted to deal with them, a casual wave of her hand could turn them to ash. Why would she deceive them?</p><br/><p>Ma Hongjun then sat down, but his secretive look was still caught by Bo Saixi. Gazing deeply at Tang San, she raised her right hand, and with a flick of her wrist, a golden pearl appeared in her palm.</p><br/><p>That golden pearl looked as if sculpted from the most precious golden crystal, translucent without the slightest flaw, and most peculiar was that, within this pearl, there was a faint golden mist constantly pulsing. Just like the golden mist that appeared around Tang San and the others under the pressure of the Seagod’s Light.</p><br/><p>With a golden flash, that golden pearl had flown out, slowly reaching the top of Ma Hongjun’s head. Bo Saixi flicked her fingers, and with a rippling sound, that pearl shattered on top of Fatty’s head. Instantly, a rich golden mist poured out and enveloped his body.</p><br/><p>Bo Saixi’s voice echoed in everyone’s ears,</p><br/><p>“Each examinee bestowed with a black or higher level Seagod’s Trial can have one chance for a god bestowed spirit ring the first time they reach a bottleneck. Without need to kill spirit beasts, the god bestowed spirit ring will assign a spirit ring with the ability you most need and of the highest level you can bear. Each person only get one chance. Little Fatty, sense it carefully, use your greatest willpower to endure the baptism of the god bestowed spirit ring, then you can obtain the greatest benefits.”</p><br/><p>God bestowed spirit ring?</p><br/><p>It was four simple words, but it made the Shrek Seven Devils’ gazes completely lifeless, even Tang San was no exception.</p><br/><p>In Tang San’s mind, he’d always thought a god was a powerful person, or you might say a powerful Spirit Master. In this world, how could there be something like a god? However, when Bo Saixi took out that god bestowed spirit ring for ma Hongjun, he was a bit at a loss. Was this a level humans could reach? The most suitable spirit ring. Then didn’t that mean that, when receiving this god bestowed spirit ring, the greater the strength the greater the benefits? How did Bo Saixi know Fatty had already reached the sixtieth rank? She should have sensed it when Fatty attacked the Seagod’s Light. But no matter how it was put, this god bestowed spirit ring was a huge advantage for them. They were after all dry land Spirit Masters, and this was the ocean, there might not be sea spirit beasts that suited each of them. Only unfortunately, everyone only had one chance.</p><br/><p>The blurry tint of the golden light mist gradually enveloped Ma Hongjun. Circles of light began to appear around him, and Tang San could only just manage to see through that golden misty splendor. It seemed like Ma Hongjun had a painful expression.</p><br/><p>If this golden light could give him a spirit ring, then his current expression was completely normal. Back then when Tang San first skipped a level to obtain a spirit ring, his expression was even more painful than this. Thinking of this, Tang San thought of that time Xiao Wu went missing, it was precisely because of Xiao Wu that his heart could become so resolute, that he could endure the pain of skipping a level to absorb the Man Faced Demon Spider spirit ring. It was also from then on that he truly became powerful.</p><br/><p>Fatty gradually began to tremble, the extent of his shaking growing larger and larger, an unhealthy flush appeared on the surface of his skin, one could imagine just how terrible the pain he currently endured was.</p><br/><p>With a pu sound, a golden red raging flame soared up behind him, instantly turning into a giant phoenix shape, swaying behind Ma Hongjun.</p><br/><p>Seagod Douluo Bo Saixi was constantly paying attention to Ma Hongjun’s expression. When Tang San occasionally cast a sidelong glance at her, he could see some praise in her eyes. Clearly, the pain Fatty was currently enduring should already be the limit. Tang San inwardly cheered Fatty on. With the experience of a level skipping spirit ring absorption, he knew that every second Fatty held out, the effects of the spirit ring he acquired would be boosted by a fraction.</p><br/><p>Ma Hongjun really did endure tremendous pain. His willpower was originally the worst of everyone, but ever since the Shrek Seven Devils reunited, he was the only one who hadn’t reached sixtieth ranked Spirit Emperor. Even though he didn’t say it, but Fatty was also inwardly competitive. Even Oscar with the most disadvantaged spirit had broken sixty ranks, reaching the Spirit Emperor level, so how could he lag behind with the first rate Fire Phoenix spirit?</p><br/><p>If he was just cultivating by himself, reaching his current level at his age could already be described as a genius. But that was no match when each person next to him was a genius among geniuses. Or maybe monsters among monsters. Together with Tang San and the others, it was impossible not to be under pressure. Fatty didn’t want to fall behind either.</p><br/><p>Even more so with the factor of Bai Chenxiang. Even though Bai Chenxiang kissed him to complete her trial, Fatty’s heart had grown even more determined to pursue her. That kiss had let him deeply understand the fact that innocence was king. In front of Bai Chenxiang, how could he easily compromise with pain? Who knew when she would suddenly wake up from cultivation?</p><br/><p>Right now, Ma Hongjun truly experienced why Tang San would say the Seagod’s Light was an opportunity for them. The key part of the Seagod’s trials. Even though he had only endured the pressure of the Seagod’s Light once, when confronting this pain, even Fatty himself was astounded at his endurance. It seemed to be because of undergoing the pressure of the Seagod’s Light yesterday that his endurance had elevated.</p><br/><p>Just because of a multitude of such causes, Fatty was dithering on the edge of collapse. Stimulated by the violent pain, a layer of bloody grease even appeared on his skin.</p><br/><p>Just at this moment, Tang San waved his hand to the others, drawing everyone’s attention, and then again pointing to the stairs leading to the Seagod’s Hall. There was no telling how long it would take Fatty to absorb the spirit ring, but with Seagod Douluo Bo Saixi here, this could be said to be the safest place. Rather than staying here to watch, it would be better grasp every moment to cultivate.</p><br/><p>Tang San’s proposal immediately drew everyone’s response, walking towards the stairs together. Bo Saixi didn’t glance at them, but the corner of her mouth revealed a slight smile.</p><br/><p>Tang San said:</p><br/><p>“We’ll test our own limits. Before climbing, use all support abilities, then endure the pressure of the Seagod’s Light. Like this we can climb as many steps as possible. Don’t help each other, only climb with your own abilities. See what our current limits are. When we feel we can’t hold out, immediately back down. Don’t withdraw too fast, feel your body relaxing as the pressure drops. This is a triangular training method (should actually be pyramid training[1], only Tang San doesn’t know about Pyramids in the book…)[2], from lowest to highest, then again from highest to lowest. This should give the best results. After coming down, don’t rush to start cultivating. I still have another thought, we can try it once.”</p><br/><p>The wisdom Tang San displayed had long since gained the approval of the others, and they instantly released their spirits. Since he had already climbed with Xiao Wu once previous, Tang San let her cultivate in the Wishful Hundred Treasure Purse. Even though he had consumed a lot of spirit power before, through the rest he had just now, he had still recovered a bit. Adding to what he had left before, his strength should also be around seventy percent.</p><br/><p>After Dai Mubai directly released his White Tiger Barrier, White Tiger Vajra Transformation, and White Tiger Devilgod Form, he fearlessly stepped into the Seagod’s Light in front of him.</p><br/><p>Oscar at a mirror clone sausage with a drop of Dai Mubai’s blood, and equally released the same three abilities. Even though he could only use them at around eighty percent of Dai Mubai’s strength, that was still a lot more than climbing on his own. Oscar also had his own advantages, he could constantly eat big recovery sausages to restore his stamina and spirit power as he climbed, and boost himself with the stimulating pink sausage. However, even this wasn’t his limit. He still had another even more useful boost ability, his fifth spirit ability. It was also his first ten thousand year spirit ring ability, and even the other Shrek Seven Devils hadn’t seen it.</p><br/><p>Oscar was also very intelligent, and like Tang San and Ning Rongrong, he possessed a skull spirit bone, increasing the speed of his thoughts beyond that of an ordinary person. The reason why he didn’t suggest using it now was in the hopes he could give his comrades even more momentum to cultivate. Just like Tang San said, they’d attack the trial at the final moment. At that time, if he revealed the power of his fifth spirit ability, it would undoubtedly give everyone double insurance.</p><br/><p>Tang San formed the first line to start climbing together with Dai Mubai and Oscar, and he also didn’t hesitate to release his twin domains once again, simultaneously releasing the Eight Spider Lances, reaching his peak condition.</p><br/><p>Ning Rongrong and Zhu Zhuqing followed behind them. Black light surged over Zhu Zhuqing, her sixth spirit ring quietly appearing. Even under direct sunshine, right now her whole body seemed like hidden in darkness. This was Zhu Zhuqing’s sixth spirit ability, Hell Body.</p><br/><p>Hell Body. Ability esoterics: Increase dodge chance by fifty percent, increase resistance by twenty percent. Increase attack piercing effect by thirty percent.</p><br/><p>This was the only support ability among Zhu Zhuqing’s six spirit abilities. She was an agility attack type Spirit Master, widely known for speed and offense, unlike power attack type Spirit Masters like Dai Mubai and Ma Hongjun who prioritized unreasonably powerful bodies. To be able to have a support ability like this was already quite good. This Hell Body might not be useful for others, but to Zhu Zhuqing, fifty percent dodge chance and twenty percent resistance gave her even more survivability in battle. And the thirty percent piercing effect made her attacks even more frightening.</p><br/><p>Currently, she used that twenty percent resistance boost of this ability. As for whether the dodge chance boost could ward off the pressure of the Seagod’s Light, she didn’t even consider it.</p><br/><p>But Ning Rongrong seemed extremely extravagant. Force boost, agility boost, spirit power boost, defense boost, she directly released the four boost abilities most useful for resisting the Seagod’s Light on herself. Then she walked forward with Zhu Zhuqing.</p><br/><p>Just as Tang San expected, after using all sorts of support effects beforehand, everyone’s resistance of the Seagod’s Light rose considerably. Further adding his own previous experience, Tang San, Dai Mubai and Oscar walking furthest ahead climbed the first twenty steps like ordinary people climbing mountains, keeping a pretty good pace.</p><br/><p>Past twenty steps, the gap in strength began to show. Tang San and Dai Mubai climbed with constant speed, but Oscar fell behind. Even if using Dai Mubai’s three great support abilities undoubtedly made his physical condition reach an unprecedented level, he could in the end only use eighty percent of their strength, and the condition of his body also couldn’t compare to Dai Mubai.</p><br/><p>However, even so, Zhu Zhuqing following behind couldn’t catch up to Oscar either. This clearly showed how dreadful the White Tiger spirit’s three great support abilities were. At the same time, Oscar’s circumstances also revealed his important effect among the Shrek Seven Devils. As long as they had his clone mirror sausage, any one of the seven could possess Dai Mubai’s three great support abilities at any time. This was also an important reason why Tang San was sure everyone could smoothly pass the trial of the Seagod’s Light.</p><br/><p>As Ning Rongrong reached the twentieth step that was her limit last time, she had already clearly slowed down. Even though she boosted herself from the start, there was still a large gap between her and the others in terms of physical strength. If she hadn’t eaten an immortal grade herb back then, it would be impossible for her to climb this mountain with the physique of a support system Spirit Master.</p><br/><p>Ultimately, Ning Rongrong reached the twenty sixth step, then started to descend. Even though it was only six more steps, this still showed that Tang San’s proposal was correct.</p><br/><p>And right now, Tang San and Dai Mubai had already passed forty steps, Oscar had also climbed thirty three. At this time, Zhu Zhuqing had caught up and kept pace with him.</p><br/><p>Very soon, the two of them also reached their limit. Oscar, relying on Dai Mubai’s Evil Eye White Tiger spirit’s three great support abilities finally only fell behind Zhu Zhuqing by one step, stopping at thirty eight. And Zhu Zhuqing using Hell Body also climbed thirty nine. Due to the considerable spirit power exhaustion, they didn’t dare delay either, and slowly backed down.</p><br/><p>But Dai Mubai and Tang San were still constantly continuing forward. Golden light pulsed in Dai Mubai’s evil eyes. Among the Shrek Seven Devils, his body could be said to be second only to Tang San. Under the effect of the three great support abilities, he was like a devil god among tigers, his powerful body forcefully splitting open the heavy obstructions in front of him, continuing forward.</p><br/><p>Peng—— One foot landing on the forty fifth step, Dai Mubai’s movements clearly halted. His limit was just about reached, and his breathing was clearly coarse. Tang San next to him subsequently stopped, without continuing forward, but rather maintaining even breathing, adjusting the Mysterious Heaven Skill within his body.</p><br/><p>Under the effect of the enormous outside pressure, Tang San discovered that his Mysterious Heaven Skill’s movement speed was clearly faster than when he cultivated on his own. This wasn’t just because he was urging it to move faster, but also because his body instinctively drew on the Mysterious Heaven Skill to recover under the tremendous pressure. His bones, muscles and meridians needed enough nourishment to do everything they could to resist the pressure, and his inner strength was clearly the key to driving the nutrients to where they were needed.</p><br/><p>If they stripped naked right now, one would be able to clearly see Dai Mubai’s muscles knotted like steel cords, forcefully resisting the pressure. But Tang San’s muscles, tendons and veins would be constantly pulsing, contracting under the pressure, then swiftly rebounding, constantly repeating force diverting motions. Just like Tang San once used the Blue Silver Emperor to unload the pressure of Spirit Douluo powers.</p><br/><p>Peng—— Another muffled thump, and Dai Mubai barely managed to set foot on the forty sixth step. This time, he could clearly feel the kind of difficult to continue feeling he had the first time he climbed. He managed to give Tang San a look, then started to withdraw from the step he set foot on, slowly walking down.</p><br/><p>Astounding Dai Mubai somewhat was that Tang San didn’t keep charging forward again, but rather retreated down with him. Dai Mubai had used practically his full force in this dash, and even though the pressure constantly fell as he retreated, he still felt his body close to exhaustion. Just when he felt he might be thrown out again, a cool aura spread from underfoot to his whole body, a stream filled with vitality undulating through him. At the same time, a strong hand caught his shoulder, stabilizing him with a gentle force.</p><br/><p>Dai Mubai turned his head to look at Tang San, the two brothers smiled at each other, then kept retreating.</p><br/><p>Reaching the foot of the mountain, five people were once again soaked with sweat, in a worse than sorry state, but that kind of feeling of going from extreme suffering to extreme relaxation was refreshing to the bottom of the heart.</p><br/><p>Just when Tang San was about to say something to his comrades, a burst of violent energy fluctuations came from Ma Hongjun’s side, drawing the attention of the unbearably exhausted people.</p><br/><p>The golden splendor around Ma Hongjun had already transformed, turning into circles of black light revolving around him. Even though Tang San and the others were several dozen meters away, they could still feel how powerful the unrestrained spirit power fluctuations around him were. Each infusion of spirit power transformed Ma Hongjun minutely. The painful expression had already disappeared, his calm eyes forming a clear contrast to the sweat pouring down his cheeks.</p><br/><p>Finally, those circles of black light condensed together, becoming an enormous black ring of light being slowly pulled into his body. His original five spirit rings now also blossomed with brilliant light. The final moment approached.</p><br/><p>A loud and resonant phoenix cry suddenly resounded, the enormous fire phoenix silhouette behind Ma Hongjun seemed to condense, becoming a true phoenix, it was just that phoenix cry resounding at the nine heavens and soaring to the sky, golden red flame almost enveloping Ma Hongjun’s whole body. That phoenix flame image in the sky constantly shrank, finally reducing into a fire phoenix with a wingspan around three meters, flying a circle in the air.</p><br/><p>Where the fire phoenix passed, ripples of distortion were left behind in the air. It suddenly dove from the air, landing more than thirty meters behind Ma Hongjun, then again abruptly charging forward, entering Ma Hongjun’s body from behind. In that instant, Ma Hongjun’s clothes suddenly turned to ash, his whole back covered by that charging fire phoenix. The flames shrank, slowly sinking into his back like a tattoo.</p><br/><p>Fatty opened his eyes in the same instant that fire phoenix pattern disappeared into his back. That instant, his eyes turned completely golden red, violent phoenix flame bursting out from his whole body and soaring high into the air around him, reaching ten meters high before slowly fading.</p><br/><p>Ma Hongjun gave a long whistle, all his fat bizarrely contracting somewhat, his whole body shrinking a size. Even though he was still fat, everyone could feel the explosive might of the energy contained within Fatty.</p><br/><p>It was done. Two yellow, two purple, two black, six spirit rings were neatly arrayed around Ma Hongjun, and along with the flame gradually disappearing, he had finally obtained his sixth spirit ring.</p><br/><p>The golden red light cascading from his eyes gradually faded, replaced by a difficult to inhibit excitement. Fatty turned to Seagod Douluo Bo Saixi and hastily saluted,</p><br/><p>“Many thanks for senior’s assistance.”</p><br/><p>Bo Saixi didn’t answer him, already turning to leave once the flame disappeared, step by step walking towards the Seagod’s Hall. As if she stepped on clouds, her body ascended, and her voice also seemed to echo from all directions,</p><br/><p>“The next time someone reaches a bottleneck, I will appear again.”</p><br/><p>Light flashed, and Bo Saixi’s silhouette was gone without a trace.</p><br/><p>Fatty raised his head, somewhat mystified looking in the direction Bo Saixi disappeared, mumbling:</p><br/><p>“Why would this senior ignore me?”</p><br/><p>Dai Mubai fought his weak body, laughing out loud:</p><br/><p>“Fatty, pretty good capital!”</p><br/><p>Ma Hongjun went expressionless for a moment. He discovered that Ning Rongrong and Zhu Zhuqing for some reason had already turned their heads. Tang San, Oscar and Dai Mubai were looking at him as if smiling yet not smiling. Subconsciously looking himself over, he immediately yelped, discovering that he was completely naked, and hastily covered his vitals with both hands, dashing over behind a large tree. In his heart he was thanking his luck that Bai Chenxiang was still cultivating and didn’t see him embarrassed.</p><br/><p>Oscar laughed out loud, saying:</p><br/><p>“What are you running for? Don’t worry, we’re not interested in your shining white big butt.”</p><br/><p>Dai Mubai supported himself on Tang San’s shoulder, saying:</p><br/><p>“Little San, I can’t go on, I’m so weak. I’ll start cultivating.”</p><br/><p>Tagn San said:</p><br/><p>“Don’t rush, I have an idea. What would the effect be if we cultivated within the Seagod’s Light? Have you thought about it?”</p><br/><p>Zhu Zhuqing and Ning Rongrong turned around. Even though they were also weak, it wasn’t as clear as the side effects from Dai Mubai’s three great abilities. They looked at Tang San with eyes full of astonishment.</p><br/><p>Oscar smiled wryly:</p><br/><p>“Little San, you really have more and more ideas! This time we’ll be tortured again.”</p><br/><p>Tang San said:</p><br/><p>“Cultivating within the Seagod’s Light, we can endure outside pressure at all times. Moreover, I discovered that within the pressure of the Seagod’s Light, our spirit power movement speed will be a lot faster than ordinarily. Just like using spirit abilities. Like this, if everything goes smoothly, we will cultivate spirit power a lot faster.”</p><br/><p>Dai Mubai said:</p><br/><p>“Alright, we’ll try. Cultivating on which step would be best?”</p><br/><p>Tang San muttered to himself and said:</p><br/><p>“Start from the first step. Test if there really is an effect, then we’ll go higher. We’ll get fat if we eat everything in one gulp.”</p><br/><p>“Third brother, you can’t be like that! Even if I’m a bit fat, you can’t put me up as a bad example.”</p><br/><p>Ma Hongjun leapt out, having already changed clothes, just in time to hear what Tang San said last.</p><br/><p>Tang San laughed out loud, saying:</p><br/><p>“Fatty, what’s your sixth spirit ring ability?”</p><br/><p>At Tang San’s question, Fatty immediately grew proud,</p><br/><p>“It’s a pure long range attack ability, called Phoenix Cloud Piercing Strike. Even though I don’t know how strong it is, I can feel that the god bestowed spirit ring is equivalent to at least a forty thousand year or more spirit beast formed spirit ring. This power, heh heh.”</p><br/><p>Tang San said:</p><br/><p>“You just spent a lot of effort, cultivate in the Seagod’s Light with us. We’ll see if it’s effective. Stop immediately if there are any adverse effects.”</p><br/><p>Before starting, Tang San infused the remainder of his spirit power into Oscar, letting him manufacture a few big recovery sausages, making everyone’s spirit power recover somewhat. Then they once again entered the Seagod’s Light.</p><br/><p>The stairs leading to the Seagod’s Hall were more than ten meters wide, plenty for six people to sit. Tang San at the same time also took out Xiao Wu from the Wishful Hundred Treasure Purse, placing her next to him. Just like Xiao Wu said herself, her current body basically wouldn’t be harmed under this pressure.</p><br/><p>Even though it was only the first step, the omnipresent pressure of the Seagod’s Light still squeezed everyone’s bodies. Slowly sitting down, everyone started to gather spirit power according to their cultivation methods.</p><br/><p>As soon as they started cultivating, they discovered what Tang San spoke of. Under the outside pressure of the Seagod’s Light, their spirit power circulation speed clearly improved, so much so that it was faster than their ordinary cultivation speed even without a need to consciously control it. It seemed the same as spirit power automatically circulating with outside stimulation.</p><br/><p>Very soon, everyone excitedly discoverd that, cultivating on this first step, their spirit power recovery speed was higher than cultivating outside. Gradually, they entered a cultivation state, simultaneously becoming aware that this first trial, Overcome, Seagod’s Light, might be a rare opportunity of their whole lives.</p><br/><p>……</p><br/><p>Spirit Hall, Douluo Palace.</p><br/><p>Douluo Palace was located at the peak of Spirit Hall’s sacred mountain. It had near absolute authority. Compared to Supreme Pontiff Palace, Douluo Palace was a bit smaller, but all the priests here had Douluo titles.</p><br/><p>Within Douluo Palace were no gorgeous furnishings, it was all built from simple and unadorned rock. But if you looked carefully, you would find a very faint golden luster on the simple rock. Touching it with your hand, you would feel a strange energy fluctuating in your palm.</p><br/><p>Apart from the direction of the entrance, on the other three walls of Douluo Palace were enshrined one glorious golden board after another. Each board was half a meter high, one chi wide, on each was inscribed three or four characters. There were boards attached to the walls as far as the eye could see, altogether more than several hundred. Each of these boards represented a Title Douluo that had received their title here since the founding of Douluo Palace.</p><br/><p>[1] Pyramid training - starting your training at highest intensity, then decreasing stepwise to induce maximum fatigue.</p><br/><p>[2] In the West, pyramid has referred both to the Egyptian tombs and anything in their shape ever since ancient Greece. In China, the introduction is much more recent, and their word literally translates as “Gold lettered pagoda”. In this case the training method is also a direct translation from English.</p><br/>\n</div>"}