{"title": "Chapter 227", "id": 227, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-227", "volume_title": "Volume 3", "body": "<h1>Chapter 227</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 227</p><br/><p>Tang San’s Trump Card, Evolved Deathgod Domain Ability</p><br/><p>(TL by Bagelson)</p><br/><p>When Tang San reached the last ten steps he had to climb in the Seagod’s Light, spent as a dried up lamp, Xiao Wu on his back recovered her vigor.</p><br/><p>Even if Tang San wanted to suppress Xiao Wu’s soul, it was basically impossible right now. Just maintaining his Mysterious Heaven Skill was already a problem, he had no strength left to consider Xiao Wu. Moreover, Xiao Wu’s soul returned to her body with speed like a thunderbolt, refusing to listen.</p><br/><p>Vigor reappearing in her eyes, Xiao Wu’s expression still seemed quite calm. Her body slid quietly, actually slipping free of the Blue Silver Emperor binding her body like a fish swimming. In fact, even if Tang San was currently completely deficient of spirit power, accomplishing this bit was still extremely difficult. But Xiao Wu separated from it and stuck close to Tang San as if she wasn’t obstructed at all.</p><br/><p>She was now still within the range of the Blue Silver Domain. Under the immense pressure from the outside world, the Blue Silver Domain was no longer able to completely block the pressure on Xiao Wu’s behalf. A rich rosy red flush appearing on her skin, Xiao Wu’s both palms twisted around Tang San’s neck from behind.</p><br/><p>Invincible Golden Body launched, Xiao Wu’s fourth spirit ability. As her soul returned to her body, her original spirit abilities could be used temporarily, to the extent that she could even use Tang San’s spirit ring’s hundred thousand year abilities. Golden light covered not only her, but at the same time also washed over Tang San, making it questionable whether it was Xiao Wu or Tang San who launched this spirit ability.</p><br/><p>At the same time as the Invincible Golden Body launched, Xiao Wu’s body abruptly grew illusory, once again using spirit abilities. Moreover, this time she directly used two. Nothingness, Instant Kill Eigth Stage Drop.</p><br/><p>Both hands twisted around Tang San’s neck, Xiao Wu bent her right knee, sticking it to Tang San’s waist, then directly flipped him up. Even though the influence of the Invincible Golden Body couldn’t ignore the pressure, it was at least enough to survive unharmed within the pressure for three seconds.</p><br/><p>Hong—— Under the others’ dumbstruck gazes, Xiao Wu forcibly smashed Tang San’s body down between the three hundred twenty fourth and three hundred twenty fifth steps. And Xiao Wu herself also exploited this instant Waist Bow force to abruptly shoot forward, still staying within the range of Tang San’s Blue Silver Domain.</p><br/><p>The tips of her toes hooked. Intense red light spread across both of them, and the Instant Kill Eight Stage Drop attack unfolded.</p><br/><p>Hong, hong, hong, hong, hong, hong——</p><br/><p>In less than three seconds of work, Tang San had been thrown to the ground by Xiao Wu several times in succession, and with each throw, the two of them would be carried forward at least one step by that frightful shock force. As the seventh attack finished, Xiao Wu and Tang San had already reached the three hundred thirty first step.</p><br/><p>If the other Shrek Seven Devils didn’t understand what Xiao Wu wanted to do at the start, then now they saw it in absolute clarity. Under the effect of Invincible Golden Body, Tang San naturally wouldn’t be harmed. And Xiao Wu always launched the attacks within the range of the Blue Silver Domain, and while she herself was in a Nothingness state the influence of the outside pressure on her would be a lot smaller than Tang San’s. This let her complete this spirit ability.</p><br/><p>By the rules of the Seagod’s Light, any attack spirit abilities would be reflected. But Xiao Wu’s attacks weren’t aimed at the Seagod’s Light, and was moreover a throwing ability. Acting on Tang San, they naturally wouldn’t suffer that frightening Seagod’s Light rebound. It was relying on such a peculiar method that Xiao Wu delivered Tang San and herself to the three hundred thirty first step. The distance to the final goal was only two steps.</p><br/><p>But it was also at this time that Tang San’s Blue Silver Domain effect disappeared…...</p><br/><p>The frightful pressure seeming to hide the sky and cover the earth squeezed the two of them simultaneously. Let alone Xiao Wu, when confronted with such pressure, without the protection of the domain, even Tang San would be shot out into the ring sea by the Seagod’s Light.</p><br/><p>But the instant the Blue Silver Domain appeared, the last stage of Xiao Wu’s Instant Kill Eight Stage Drop was already launching. It was as if she basically hadn’t even noticed that Tang San’s Blue Silver Domain had disappeared. Her whole body erupted with red light, her imposing manner promoting to the peak, grabbing Tang San with both her hands at his chest and waist, then forcefully throwing him towards the three hundred thirty third step.</p><br/><p>At such a moment, Xiao Wu didn’t have even a trace of hesitation. Of course she knew she would only have one chance at this instant. Either she used the momentum of throwing Tang San to push herself to the three hundred thirty third step, or she threw Tang San there. There was no third option. And she practically instinctively reacted to choose the latter. She clearly understood that the moment she three Tang San to the three hundred thirty third step, was also the moment she was rejected by the Seagod’s Light. Without passing the Overcome, Twofold, Seagod’s Light together with Tang San, her first trial would be considered a failure. The only consequence would be death.</p><br/><p>Confronting the moment of life and death, Xiao Wu once again chose to sacrifice herself to defend Tang San.</p><br/><p>As this happened, Tang San, being thrown to the three hundred thirty third step by Xiao Wu, would complete his first Seagod trial. It was also at this moment that Tang San, always being heavily thrown around in Xiao Wu’s hands, suddenly changed.</p><br/><p>Crystalline bright white light abruptly rolled out from Tang San’s body. Indeed, it was like it rolled out to fill the air. In that instant it enveloped him, and also simultaneously enveloped Xiao Wu.</p><br/><p>Xiao Wu only felt her surroundings suddenly chill, her whole body instantly bound by a difficult to describe frightening feeling. All the scenery around her instantly changed. It was no longer green hills and clear water, but rather a sinister Asura world. Desolate chill wind, terrifying and overbearing slaughter flavor, as well as countless howls and shrieks of lamentation instantly engulfed her mind. Her soul had temporarily returned to her original body, and really wasn’t stable. Further adding the enormous pressure of the Seagod’s Light, in front of such suddenly appearing energy, she couldn’t even accomplish any resistance. Her hands grabbing Tang San went rigid, and Tang San about to be thrown to the three hundred thirty third step fell on the three hundred thirty second.</p><br/><p>And the next instant, the terrifying Seagod’s Light energy instantly erupted. Xiao Wu was once again unable to control her body, and was about to be shot off like an artillery shell.</p><br/><p>But just at this moment, that terrifying white light suddenly spread out, two sparkling and translucent golden blue rays of light twisting around her waist.</p><br/><p>Those golden blue rays of light suddenly tightened, issuing a series of cracking sounds, and Xiao Wu saw it had reached its limit.</p><br/><p>Different from the golden blue color when using the Blue Silver Domain, right now Tang San’s whole body was covered in white, a white without the slightest vitality. There was only endless killing intent and desire for murder. It was like this white world, filled with a terrifying ice cold.</p><br/><p>The surrounding white suddenly shifted, spinning with incomparable speed. And all that white light also instantly merged into this rotation like a sharp blade. An ear piercing whistle as frightening as if it came from Hell. The boundless killing intent merged together with the white light within that frightening whirl, as if cutting everything in the surroundings.</p><br/><p>That originally so frightening pressure from the Seagod’s Light suddenly disappeared. The golden blue light beams pulled, throwing Xiao Wu into an ice cold embrace. An ice cold voice echoed by her ear,</p><br/><p>“If you died, would there be any meaning even if I passed all the Seagod nine trials?”</p><br/><p>The pressure of the Seagod’s Light seemed to be completely cut apart in this instant, and as it happened, what was severed only turned into a part of that white light. Most peculiar was that the frighteningly rotating white light actually didn’t trigger the Seagod’s Light’s rebound attack. Or perhaps, the Seagod’s Light couldn’t react.</p><br/><p>A shattering sound came from behind Tang San’s back. Held tightly in Tang San’s arms, Xiao Wu could barely manage to see through the corners of her eyes, behind Tang San were countless golden fragments. And the two of them spun among these fragments, stepping across the final step.</p><br/><p>That white light was doubtlessly Tang San’s Deathgod Domain. Always bearing patiently until the final moment, Tang San used its true power.</p><br/><p>It wasn’t that he didn’t want to use it before, but rather that this evolved Deathgod Domain consumed a horrifying amount of spirit power. Having already been severely exhausted, using it, Tang San could only persist for a very short moment. If he used it ahead of time, it would be no more use than quenching thirst with poison.</p><br/><p>The white world Xiao Wu felt was precisely the Deathgod Domain’s evolved ability, Asura Hell[1]. Just like the Blue Silver Domain’s evolved ability Boundless Nature, under the effect of Spirit Avatar, Tang San’s Asura Hell wasn’t as simple as the original Deathgod Domain.</p><br/><p>Even though Asura Hell and Boundless Nature were equally domains, their focus differed enormously. Possessing the draining golden threads ability, Boundless Nature focused more on amplification, confusing and weakening the opponent. But the Deathgod Domain’s Asura Hell only focused on one kind of ability, destruction. Destruction of everything within the domain. Killing intent would turn truly substantial within Asura Hell, transforming into a frightening attack. Even the Seagod’s Light’s enormous power would be cut to pieces within the suddenly unfolding Asura Hell.</p><br/><p>That rapidly rotating terrifying white light filled with sharp whistles was the ability that arose after Asura Hell evolved —— Asura Revolving Circular Killing Formation. The pinnacle of the art of slaughter.</p><br/><p>In order to fully use his final trump card, in order to ensure Xiao Wu completed the trial at the same time as him, the instant Tang San was about to be thrown to the three hundred thirty third step, he released the Deathgod Domain’s Asura Hell, and simultaneously also released his Eight Spider Lances. That final push was not only the Asura Revolving Circular Killing Formation, but also came at the cost of shattering the Eight Spider Lances. It was also the power of the Eight Spider Lances that allowed Tang San to fully use the Asura Revolving Circle Killing Formation.</p><br/><p>After all, the Deathgod Domain was the innate domain of the Clear Sky Hammer, and its power would be decreased substantially when uses with the Blue Silver Emperor’s Spirit Avatar. But just like the effect of fusing with the Blue Silver Domain, the Eight Spider Lances also evolved to completely fuse with the Deathgod Domain. Under the influence of Asura Hell, the Eight Spider Lances transformed into Asura Lances, becoming Tang San’s most powerful weapons. Tang San sacrificed the eight Asura Lances and exploited the energy of their destruction to guide his last spirit power to arouse the Asura Revolving Circle Killing Formation, simultaneously pushing him and Xiao Wu to the three hundred thirty third step. And right now his back, where Xiao Wu couldn’t see, was already completely mangled and mutilated, the shattered fragments of the Asura Lances exposing the white bones.</p><br/><p>All pressure melted away like ice and snow the instant they set foot on the three hundred thirty third step. And Tang San’s body also fell limp in Xiao Wu’s embrace, warm blood almost instantly dying the stairs red beneath him.</p><br/><p>“Ge, ge, don’t scare me…….”</p><br/><p>Xiao Wu’s voice trembled. At the same time as the pressure disappeared, Tang San’s arms wrapped tightly around her also went limp. The eyes originally filled with deathly stillness and killing intent instantly turned grey, his whole body seeming to instantly lose all vitality and soul. Completely hanging on Xiao Wu.</p><br/><p>Even so, a faint mild smile still hung on Tang San’s face, his rough voice brimming with affection echoing by Xiao Wu’s ear,</p><br/><p>“The….. sacrifice….. that time…… gave me……. a lifetime of regret…… I said…… I would….. protect you. As long as…… I’m…… still…… not dead. This…… time……. I did it……. How could I……. let…….. you……. sacrifice for…… me……. again….. eh? ……. Silly, don’t……. cry…….”</p><br/><p>The instant Tang San lost the ability to support himself and collapsed in Xiao Wu’s arms, a ray of red light shot out from Xiao Wu’s brow, flashing and disappearing. At the same instant, seven lines of clearly visible golden light converged in the air, completely illuminating the night sky like daylight. They gathered above everyone, then suddenly, converged into one abundant stream and fell, enveloping Tang San and Xiao Wu.</p><br/><p>Enveloped in that golden light, Tang San’s limp body hanging in Xiao Wu’s arms slowly stood straight. His eyes closed tightly, and the golden trident on his forehead blossomed with resplendent light. That golden light spread down from Tang San’s forehead like threads and strands, flowing into his whole body. Where it passed, Tang San’s skin seemed to tremble, and the horrifying wounds on his back healed with speed visible to the naked eye. A golden light screen shattered in front of Tang San, turning into specks of golden light that flowed into Tang San’s body at the same time as the light flowing from the golden trident.</p><br/><p>A deep dignified voice echoed in his mind:</p><br/><p>“Overcome, Twofold, Seagod’s Light, trial passed. Refusing to abandon comrades in the face of danger, self sacrifice in the face of desperate straits. Unwavering, unswerving without losing farsightedness. First trial complete, Seagod affinity raised five percent, presently at five percent overall.”</p><br/><p>Nobody noticed that, at this moment, a trace of strange blue light flashed between Tang San’s eyebrows.</p><br/><p>An itchy feeling throughout his whole body almost made Tang San moan. To him, this feeling wasn’t great, but the golden light merging into his body seemed to rouse all the abilities in his body. All damage quickly recovered, the sensation of imminent collapse quickly retreating, and everything around seemed to grow clearer.</p><br/><p>Xiao Wu’s body was shot away by the golden light. The red dot of light on her forehead flashed continuously. There was no scene of a screen of light shattering like for the others, but a dignified voice also echoed in the depths of her soul.</p><br/><p>“Never leaving, never abandoning. Able to sacrifice oneself for one's lover. Perfect accompaniment. Peak level one trial one ninth complete, superimposing reward.”</p><br/><p>The golden light over Tang San continued for a full hour. When the sky darkened once again, his wounds were already completely healed, and even his spirit power had recovered to its peak. That golden trident on his forehead subsequently dulled, returning to its brand shape.</p><br/><p>“Xiao Wu.”</p><br/><p>After Tang San’s gaze recovered its spirit, his first action was to pull Xiao Wu into his arms. Holding her tightly, refusing to relax no matter what was said. When Xiao Wu fully used Nothingness and Instant Kill Eight Stage Drop, Tang San had once again deeply felt that he would lose her. Even though he could reverse the crisis this time, that kind of feeling had still shaken even the heart that hadn’t swayed during the limit ordeal of the God Bestowed Spirit Ring.</p><br/><p>Xiao Wu didn’t speak, only closely hung on Tang San’s neck. The feelings between her and Tang San no longer needed to be conveyed with words. They would both pay everything for the other, truly everything.</p><br/><p>Only once Xiao Wu’s soul had again returned within Tang San, her body softly sleeping in Tang San’s embrace, did he gradually return to his senses. Turning his head, he looked at his smiling companions.</p><br/><p>Seagod Douluo Bo Saixi had already arrived next to them at some point. Seeing Tang San awaken from his deep emotions, she said with a smile:</p><br/><p>“Congratulations on passing the first trial. However, even more difficult trials still await you. No matter black or peak level trials, you must never forget the importance of the team. Another two people will accept the God Bestowed Spirit Ring. When you have finished absorbing the spirit ring, it will be time to begin the second trial. It’s still a one year time limit.”</p><br/><p>Two specks of golden light flew out from Bo Saixi’s hand, and Ning Rongrong and Zhu Zhuqing who had both reached the seventieth rank sat down. Golden light mist filled their bodies, the spirit ring trial beginning.</p><br/><p>Pulling the sleeping Xiao Wu close, Tang San said:</p><br/><p>“Senior, may I ask a question?”</p><br/><p>Bo Saixi nodded to Tang San,</p><br/><p>“Ask.”</p><br/><p>Tang San said:</p><br/><p>“This God Bestowed Spirit Ring, is it your power, or the power of the Seagod?”</p><br/><p>Bo Saixi calmly said:</p><br/><p>“Of course it’s the lord Seagod’s power. This is a miracle. Whenever a black level examinee appears, the lord Seagod will grant one chance for a god bestowed spirit ring. Besides an act of god, who could bestow spirit rings? I’m human, not a god.”</p><br/><p>Looking deeply at Bo Saixi, Tang San nodded, saying:</p><br/><p>“Many thanks senior, I understand.”</p><br/><p>Having clarified his doubt, Tang San very unceremoniously sat down on the ground, using his thighs as Xiao Wu’s pillow. Even though his body had already recovered, his taut mind relaxed with the completion of the first trial. One year of seemingly unceasing cultivation, even though his strength swiftly advanced, at the same time it also kept his mind under constant strain. If he didn’t relax now, his heart might truly collapse.</p><br/><p>Dai Mubai said:</p><br/><p>“Senior, can we take a look in the Seagod’s Hall?”</p><br/><p>Bo Saixi shot him a glance,</p><br/><p>“It still isn’t time. There will be a chance for you to worship the lord Seagod. If you insist on entering the Seagod’s Hall right now, it’s not like there isn’t a chance. As long as you can defeat me. En, I’ll tell you now. If you can defeat me, besides Tang San’s Seagod nine trials where only the first six can be completed, the rest of all your other trials can be considered completed. I don’t mind if you try. I will face you with all my strength. However, I won’t start off leniently.”</p><br/><p>For some reason, hearing the lure in her voice, the Shrek Seven Devils all shivered in their souls.</p><br/><p>Defeating Seagod Douluo Bo Saixi? Even though everyone’s strength had progressed rapidly in the last year, they still wouldn’t be so arrogant as to think they could defeat this peak existence among Title Douluo. That was a ninety ninth ranked super power!</p><br/><p>His butt dropping to the ground, only a wry smile remained on Dai Mubai’s face. Oscar, Ma Hongjun and Bai Chenxiang also sat down one after another. Their experiences in this year had really been too exhausting. Cultivating without any buffer time had stretched their bodies and minds to the limit.</p><br/><p>Six hours later, as the sky gradually brightened and a marble white smear rose on the eastern horizon, Ning Rongrong and Zhu Zhuqing finally absorbed to the limit of what they could bear, finishing the god bestowed spirit ring trial.</p><br/><p>Just as the two absorbed their spirit rings and entered cultivation to recover, the just brightening sky abruptly darkened. Besides Bai Chenxiang, the brands on each of the Shrek Seven Devils brightened simultaneously.</p><br/><p>Black clouds gathered densely in the sky. Above Seagod Mountain was abundant momentum for mountain rain. On the once again darkening sacred mountain, that Seagod’s Light became especially clear. But the ring shaped sea outside the mountain began to boil violently.</p><br/><p>Waves rose, one bizarre energy fluctuation after another moving in the ring sea. On the horizon, seven lines of golden light once again cut open the sky and converged. This time the position they converged was the peak of the Seagod’s Hall. The golden light gathered for a very short time, flashing and disappearing. But as that golden light scattered, to the eyes of the Shrek Seven Devils, the ring sea was covered in a golden barrier of light.</p><br/><p>This barrier was only ten meters or so from the surface of the ring sea, just like when they arrived at the Seahorse Sacred Pillar. It seemed to block the rage of the waves. This golden light spread the whole way to the shores of the ring shaped sea.</p><br/><p>At the same moment, a brand new screen appeared in the minds of all the Shrek Seven Devils. Their second trial was starting.</p><br/><p>When the ring shaped sea roiled, Seagod Douluo Bo Saixi’s figure had already disappeared. None of the Shrek Seven Devils had noticed her leave.</p><br/><p>Dai Mubai said in a low voice:</p><br/><p>“Second trial, Break Through, Ring Blockade. Conditions to pass, pass through the ring sea blockade and reach the other shore, without killing any sea spirit beast.”</p><br/><p>Oscar and Ma Hongjun looked face to face, both nodding. Clearly they had received the same trial. Without need to ask, Zhu Zhuqing and Ning Rongrong’s trials weren’t much different, only because of Ning Rongrong’s peak level trial, her difficulty was a bit higher.</p><br/><p>Tang San’s face carried a slightly wry smile. Seeing his comrades’ attentive gazes at him, he said:</p><br/><p>“My trial is the same as yours, with the caveat that I can’t use any spirit ring abilities.”</p><br/><p>“That……”</p><br/><p>Dai Mubai and Oscar frowned practically simultaneously. If Tang San couldn’t use spirit abilities, that meant his strength was enormously restricted. Most crucial was that his two great domains couldn’t be amplified by Spirit Avatar. Spirit Avatar was equivalent to Tang San’s seventh spirit ability, so it would naturally be restricted. Even though the domains could still be used, it was without the Spirit Avatar amplification. The domains wouldn’t be able to display their true power. They of course wouldn’t think that passing through this ring sea would be as simple as when they landed on the Seahorse Sacred Pillar. No need to ask, waiting for them in that ring sea, besides violent waves, would be unknown amounts of powerful spirit beasts. And nobody knew how to swim. That golden light barrier also restricted flight. Just how difficult this trial was could only be known after going deep into the ring sea.</p><br/><p>“This trial really is simple!”</p><br/><p>Ma Hongjun leaned smiling on the stone steps, without any nervousness.</p><br/><p>“Simple?”</p><br/><p>Tang San, Dai Mubai and Oscar couldn’t help looking towards him.</p><br/><p>Fatty grinned, saying:</p><br/><p>“Of course it’s simple, did you forget how we landed on Seagod Island? Third brother still has that Vast Sea Cosmic Shroud! That’s not a spirit ability. We’ll stealthily run the blockade again. No difficulty.”</p><br/><p>Hearing Fatty speak, Dai Mubai and Oscar couldn’t keep their eyes from brightening. Right! How could they have forgotten a treasure like the Vast Sea Cosmic Shroud.</p><br/><p>Only, they very soon grew disappointed, because Tang San’s expression didn’t relax because of what Ma Hongjun said.</p><br/><p>Sure enough, Tang San immediately broke everyone’s expectations, helplessly saying:</p><br/><p>“I just tried it, the Vast Sea Cosmic Shroud seems to be restricted by some strange force, I can’t summon it. It seems that we can only rely on our own strength for this trial. It would be nice if the spirit beasts in this ring sea aren’t too powerful.”</p><br/><p>Oscar said:</p><br/><p>“Maybe not. Our mission is to break through the ring sea’s blockade, reaching the other side counts as passing. This trial isn’t that difficult. The distance across the water is just a few hundred meters, with our strength, crossing without killing spirit beasts has a very high probability of success. And there are only two powers that can stop us in this ring sea. One is the sea itself. And the other is naturally the spirit beasts. No need to kill, it’s fine as long as we dodge. Like this, it won’t matter how strong the spirit beasts blocking us are.”</p><br/><p>Tang San said:</p><br/><p>“We still have to face another problem, the ring sea has now already sealed our way out, and at the same time it naturally seals the way in. Starting from today, we won’t have any food resupply. Moreover, we can’t kill the creatures in the ring sea to make up for it.”</p><br/><p>Dai Mubai was eager to give it a try:</p><br/><p>“It would be better to let me give it a try first, take a look at just how powerful the spirit beasts in this ring sea really are.”</p><br/><p>Tang San hastily blocked him:</p><br/><p>“No. The circumstances are still unclear, we can’t move rashly. Rongrong and Zhuqing are still cultivating too. There’s still a year’s time, the we don’t have to worry about food either, we just won’t have any delicacies. Right now little Ao and Fatty’s spirit power is also at the sixty ninth rank. Within one year they can also break through to the seventieth rank. Even though Fatty has already had his got bestowed spirit ring quota, little Ao still hasn’t. A food system Spirit Master will be a terrifying existence at the Spirit Sage level. I believe that little Ao’s Spirit Avatar will definitely surprise us. It won’t be too late to try the second trial once we have this guarantee. I don’t know what surprises Rongrong’s seventh spirit ability Spirit Avatar can give us either.”</p><br/><p>Ning Rongrong and Zhu Zhuqing spent another two hours before waking up from cultivation. Certainly, the two both had another black spirit ring.</p><br/><p>Because the two women had endured the trial of the god bestowed spirit ring, they were still a bit weak after waking up, even after two hours of recuperation, but their minds still seemed extremely excited. The seventh spirit ring, to any Spirit Master, was extremely important. It could also be called a watershed for Spirit Masters. Past the seventieth rank you could be considered having stepped into the ranks of powers.</p><br/><p>Dai Mubai and Oscar stepped forward to support them. Before anyone could ask, Ning Rongrong already took the lead to speak up:</p><br/><p>“My god bestowed spirit ring is equivalent to a spirit beast between forty and fifty thousand years, the seventh spirit ability is Nine Treasure Avatar. Besides making all my spirit ability amplification levels reach eighty percent, in the Nine Treasure Avatar State, the spirit power consumed by all boost abilities is reduced by half. Moreover, I believe that the Nine Treasure Avatar condition will let me multitask a lot more smoothly.”</p><br/><p>Oscar looked distracted while supporting her,</p><br/><p>“Worthy of being a first rate spirit, the Spirit Avatar effect really is abnormal! Reducing spirit power consumption by half, doesn’t that mean you can boost us for twice as long?”</p><br/><p>Ning Rongrong nodded:</p><br/><p>“Exactly. Only, for now I can’t use Nine Treasure Avatar.”</p><br/><p>Oscar looked distracted,</p><br/><p>“Why?”</p><br/><p>Ning Rongrong smiled wryly:</p><br/><p>“The peak level second trial, Break Through, Ring Blockade. The seventh spirit ability is sealed. Look.”</p><br/><p>While speaking, she released her Nine Treasure Glazed Tile Pagoda. As that sparkling and translucent resplendent pagoda appeared in her palm, everyone immediately saw the difference. Among the seven spirit rings circling the pagoda, the last black one that should be a black ten thousand year spirit ring was now grey.</p><br/><p>Everyone couldn’t help frowning, and Tang San sighed:</p><br/><p>“My circumstances are the same as Rongrong, only all my spirit rings are sealed.”</p><br/><p>He also released his Blue Silver Emperor. Hilariously, only ten odd strands of Blue Silver Emperor shot out, and the originally dazzling seven spirit rings were now already completely grey. They were clearly unusable.</p><br/><p>“Yi, Rongrong, how did your second spirit ring turn purple?”</p><br/><p>Zhu Zhuqing originally wanted to explain the circumstances of her seventh spirit ability, but Ning Rongrong’s spirit ring colors made her seem to discover a new world. Actually, this was already the case when Ning Rongrong helped Tang San pass his trial, only at that time everyone’s attention was focused on Tang San, basically without any thought to this. Nobody had never imagined Ning Rongrong’s second spirit ring would change color either. That’s why it was like this.</p><br/><p>Ning Rongrong giggled, saying:</p><br/><p>“Passing the first trial, besides spirit power rising one rank, my six spirit rings also all received five hundred years of cultivation. The second spirit ring was originally from a five hundred year or so spirit beast, with another five hundred it turned into a thousand year spirit ring. That’s why.”</p><br/><p>Fatty couldn’t help saying:</p><br/><p>“As expected, the greater the difficulty of the trial, the greater the rewards! Third brother, what about you? You have Seagod nine trials, the first trial was also so difficult, you should have two ranks of spirit power. Go on and say it.”</p><br/><p>Tang San then thought of the dignified voice that appeared in the back of his head when he passed the trial, and shook his head:</p><br/><p>“There’s no spirit power reward, it seems it only rewarded something called Seagod Affinity, five percent. Altogether only these five percent, I don’t know what use it is.”</p><br/><p>“Seagod affinity?”</p><br/><p>Hearing these words, everyone were a bit puzzled.</p><br/><p>Tang San casually said:</p><br/><p>“Doesn’t matter what the rewards are, since coming here, our strength has made a qualitative leap. This is already the best reward.”</p><br/><p>Dai Mubai said:</p><br/><p>“Agreed, we also face the danger of losing our lives at all times. But we will definitely crash our way through the challenges, completing all the trials here. Zhuqing, what’s your seventh spirit ring?”</p><br/><p>Zhu Zhuqing said:</p><br/><p>“My seventh spirit ring can be used, my second trial is only Break Through, Ring Blockade. The seventh spirit ability, Civet Avatar, can incarnate as the Hell Civet, speed increases fifty percent. In the Civet Avatar state, all spirit abilities are boosted by fifty percent, mainly in terms of attack power.”</p><br/><p>This was clearly the proper results of a normal Spirit Avatar. Even though it wasn’t extraordinary, it was still a substantial leap in strength.</p><br/><p>[1] Asura Hell - ()</p><br/>\n</div>"}