{"title": "Chapter 239", "id": 239, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-239", "volume_title": "Volume 3", "body": "<h1>Chapter 239</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hundred Thousand Year Evil Spirit Left Leg Bone</p><br/><p>(TL by Armored Raven)</p><br/><p>The Evil Spirit Orca King’s dark red spirit bone was translucent. Seemingly made of amber, it seemed to have a dark red liquid churning within. It wasn’t radiating light, but rather it seemed to be instead engulfing the light from its surroundings. When the bone reached the position of the ankle, it had looks that were closer to that of an orca’s tailfin, rather than that of a human foot.</p><br/><p>The golden trident brand on Tang San’s forehead suddenly unleashed a golden flash, which shone upon the Evil Spirit Orca King’s spirit bone.</p><br/><p>The spirit bone, which seemed capable of engulfing the light of its surroundings, failed to drown out the light that symbolized the dignity of the seagod.</p><br/><p>It struggled as it shuddered. It seemed as if it wanted to break free. However, basked within the seagod’s light, how could it have a chance to do so? It could only move closer to Tang San at a snail’s pace, guided by the golden light.</p><br/><p>With a faint ‘DING’, Tang San’s spirit power erupted. Yellow, yellow, purple, black, black, red, red, red, eight spirit rings appeared simultaneously, and within the eight rings, there were three that could be classified as Hundred Thousand Year spirit rings in rank.</p><br/><p>Hundred Thousand Year spirit rings were regarded as priceless treasures in the eyes of spirit masters, yet right now, Tang San possessed three by himself. This was a terrifying spirit ring configuration! Even a Title Douluo would tremble before such a configuration.</p><br/><p>At this moment, it was as if Tang San had become the center of the ocean, and as he released the light of the seagod, the indescribable magnificence once again made the Devil Spirit Great White Sharks lower their heads—even the Devil Spirit Great White Shark King Xiao Bai below Tang San was no exception.</p><br/><p>This was a hundred thousand year old spirit bone. The spirit bone struggled futilely, but the light of the seagod didn’t give it any chance to escape. Tang San’s eyes slowly opened, and at that moment, everyone could see an enchanting golden light in his eyes.</p><br/><p>He rose from Xiao Bai’s back, and his right foot stepped out abruptly. With a single step, he walked out upon the void above the surface of the sea just like that. The light of the seagod wrapped around him once more. He hadn’t used the silver blue spirit bone’s ability of flight, yet he’d still levitated—this was the performance of one whose spirit power had reached a certain stage.</p><br/><p>As his right leg stepped forward, his left leg kicked out like lightning, straight towards the spirit bone. Even the Shrek Seven Devils could only see a blurring motion from Tang San’s leg. At the same time as he kicked out, Tang San’s newly obtained spirit ring released a bloody red right. The light focused on the left leg spirit bone. It was only a flash of movement. When Tang San retracted his left leg, the spirit bone that had been floating in mid-air was already gone.</p><br/><p>BOOM——, the seagod’s light vanished. A vast amount of bloody red light lit up the skies, and a howl erupted from Tang San’s mouth, straight towards the clouds. The sea water under him rippled violently, which in turn spread out. Peculiarly, wherever the ripples reached, the originally heaving waves of the sea would calm down temporarily. It was like the calm surface of a lake.</p><br/><p>With this, although the pressure from the spirit power still had a ways to go compared to the raging torrents of Seagod Douluo Bo Saixi’s spirit power, Tang San’s strength had undoubtedly changed once again, and had reached an all new state.</p><br/><p>His scream lasted for seemingly forever, before slowly stopping. Tang San’s body slowly released miasma. At the same time, his body’s vitality, vigor, and spirit were one with the scream.</p><br/><p>Dai Mubai couldn’t help but feel sentimental as he watched Tang San. He’d thought that, by getting recommendations from his black level six exams, his spirit power would catch up to Tang San’s. But from the looks of things, he feared that he’d never have the chance to catch up to Tang San again, as whether it was spirit power, spirit rings, or spirit bones, Tang San had already surpassed them in every way. Strangely, Dai Mubai didn’t harbor any jealousy towards Tang San; he only had envy, for he knew that Tang San’s power had come from efforts several times stronger than theirs.</p><br/><p>Tang San’s glow faded along with his long howl, and he floated back down to Xiao Bai’s back again. Now he looked like he’d become energized, both of his eyes returning to their dark blue color, the magnificent golden radiance dissipating. Only the golden trident brand on his forehead left an indistinguishable impression.</p><br/><p>“I’ve kept you waiting, everyone.” Taking in a deep breath, the first thing that entered Tang San’s eyes was Xiao Wu, who was leaning on Ning Rongrong’s shoulder. Feeling excited, he felt like he was getting closer to Xiao Wu’s resurrection. ‘Xiao Wu, you’re about to return to my side for real’, he thought.</p><br/><p>Ning Rongrong spoke, “Ge, you’re not even 24 years old. Compared to you, Spirit Hall’s golden generation or whatever are just trash.”</p><br/><p>Tang San smiled and said, “They’re not our opponents. It’s the entirety of Spirit Hall that are.”</p><br/><p>Dai Mubai said, “Little San, what level has your spirit power reached? A Hundred Thousand Year spirit ring should’ve let you raise it.”</p><br/><p>Tang San nodded. “I’ve already reached level 83, and am nearing level 84.”</p><br/><p>Dai Mubai, Oscar, and Ma Hongjun all looked each other in the eyes without speaking a word. Level 83... this number that had once been regarded by everyone as untouchable, had actually appeared in Tang San right now. How could they not be agitated? </p><br/><p>Tang San continued, “Boss, you should also have reached level 79 with the fourth trial’s reward, right? Keep it up, and you’ll reach level 80 soon.”</p><br/><p>Dai Mubai said, “Well, we’ll have to pass our fifth trial first. You should check out what yours is. You haven’t seen it yet, right? I’m afraid that this time, our on-the-spot trials are a bit different.”</p><br/><p>When Tang San heard the reminder, he immediately focused his spirit power into the golden trident brand. The contents of the fifth trial instantly appeared in his mind. Even though his power had improved by leaps and bounds, he couldn’t help but stare at everyone speechlessly, a dumbstruck expression on his face, as the contents of his trial were presented.</p><br/><p>When Oscar saw the dumbstruck Tang San, he asked, “Little San, what does your trial exam consist of?”</p><br/><p>Tang San looked at his friends with a wry smile, and told them the contents of his exam clearly, “Seagod’s Nine Trials, Fifth Trial. Challenge: Sacred Pillar Protector. Countdown starts upon challenging the first protector. Must finish all challenges within 72 hours. Cleared upon defeating all seven sacred pillar protectors.”</p><br/><p>72 hours, which meant three days. Everyone spoke unanimously, “Defeat seven Title Douluos within three days?”</p><br/><p>Tang San had been speechless for a moment when he got his exam as well. “Perhaps it’s like this, if we consider the fact that the fourth trial was related to group strength, then the fifth trial should be about individual strength. What are the contents of your trials?”</p><br/><p>Dai Mubai let out a sigh. “I thought that our fifth trials were twisted enough, but compared to your fifth trial, it’s nothing. The fifth trial, with an intent towards testing individual strength, has Zhuqing, Little Ao, Fatty, and I. Each of us have to defeat a Title Douluo, while Rongrong has to participate in all four of our battles separately, in order to give us buffs. Therefore, all four of us must pass our trials’, so that she can pass as well.”</p><br/><p>Tang San muttered, “Is there a limit to the amount of times you can try?”</p><br/><p>Dai Mubai shook his head, “No, it should be the same as our previous exams. If we succeed at our trials within one year, we’ll pass. Although, the difference in our spirit ranks and a Title Douluo’s is extreme. But, with the best spirit ring configuration, and Rongrong’s buffs, I think that with enough preparation, even Little Ao can pass with a few more tries.”</p><br/><p>Tang San shook his head and said, “I’m afraid it’s not as simple as you think. You’ve probably forgotten, but we won’t be challenging just any Title Douluos. They’re Sea Douluos as well.”</p><br/><p>When they heard what Tang San said, everyone’s face changed color. Indeed, when they’d thought about the fifth trial’s Title Douluos before, they’d forgotten an extremely important point. As they thought of the locations that the seven sacred pillars occupied, they realized that they’d undoubtedly be the most strategically advantageous locations for the Sea Douluos. To battle them where they had the most benefit—it’d be incredibly difficult.</p><br/><p>Tang San said, Don’t get too worried everyone. We still have time, so let’s plan carefully after we get back. Great work, Xiao Bai. Let’s head back.”</p><br/><p>Waves of spirit energy spread out from Xiao Bai to the surrounding Great White Spirit Sharks swiftly. Under Xiao Bai’s guidance, they returned to where they’d come from as fast as the wind.</p><br/><p>Meanwhile, the Shrek Seven Devils hadn’t just passed the fourth trial. They’d also obtained the Great White Spirit Sharks’ friendship, in the truest sense of the word, and with their help, they quickly wiped out the Orcas. No matter if they were Xiao Bai, or were her clanspeople, they were all excited, and got more intimate with the Shrek Seven Devils.</p><br/><p>Seawater flowed under him as Tang San closed his eyes. He felt his strength change again as his spirit energy coursed through his body. His spirit level had gone past 80 levels, and had entered the realm of Spirit Douluos. He had three large Hundred Thousand Year spirit rings, and five spirit bones. Tang San felt confident about his upcoming fifth exam. Even though his opponents would be Sea Douluos, he was sure that he had enough prowess to overcome this challenge. This fifth trial was no doubt the most fitting test for his newfound powers.</p><br/><p>“Tang San, do you need my help?” Xiao Bai’s voice came from underneath him. At Xiao Bai’s insistence, she became Tang San and Xiao Wu’s seat on the way back, which didn’t affect the quick travel in any way.</p><br/><p>“Help?” Tang San looked confusedly at Xiao Bai underneath him, “You’re saying that you’ll help us undergo actual combat training like in the second trial?”</p><br/><p>Xiao Bai spoke, “Back then, when you were in the second trial, I received the trial’s regulations, so I couldn’t attack you. But now, I can control the amount of power I release. Don’t forget that I’m a sea spirit beast, and I have a good deal of understanding towards the Sea Douluos of the seven sacred pillars. Theoretically, I can emulate their different levels of strength so that you can train. This way, when you battle them for real, you’ll have it easier.”</p><br/><p>Tang San replied happily, “That’s great. Thanks a lot, Xiao Bai.”</p><br/><p>Xiao Bai said, “Don’t thank me in a hurry. I have to make something clear. You can’t use that mystical bottle against me.”</p><br/><p>“Mystical bottle?” Tang San stared blankly, not quite aware what Xiao Bai was referring to.</p><br/><p>Xiao Bai replied hurriedly, “It’s that bottle you killed evil orcas with. It’s too terrifying. I don’t want to become a sacrifice to it.”</p><br/><p>Once he’d heard what she had to say, Tang San understood what Xiao Bai was worrying about. He chuckled, “Relax. How could I use that against you? You’re our friend. Besides, that thing might look mystical, but it’s just a matter of me using it correctly. If prepared, even a normal Ten Thousand Year sea spirit beast wouldn’t necessarily fall victim to it, let alone a strong one like you.”</p><br/><p>Soon, escorted by the Great White Spirit Sharks, everyone returned to Seagod Island. The fourth exam could be said to have used the least amount of everyone’s time, and it was one that everyone had had the easiest time with. Everyone had had various amounts of gains, and the thing with the greatest cause for celebration was everyone’s rising spirit power levels. Tang San had even gotten his eighth spirit ring.</p><br/><p>Things gone on for a while at sea. It felt wonderful when they stepped onto solid land once more. The promise between Xiao Bai and everyone was that, three days later, after she lead her own clan into the sea to deal with the aftermath, she’d train with everyone. After all, they’d also received casualties from this battle.</p><br/><p>A blue sea and silver sands. Gazing at the beautiful scenery where the sky and the water meet, the seven devils sat upon the soft beach and meditated for three months. They’d taken just a few days to complete the fourth trial, therefore everyone’s mood was great. Even if the fifth trial would be more difficult, they’d already built up enough confidence after going through so much.</p><br/><p>Tang San should’ve been the one most excited, but when he looked at Xiao Wu on his shoulder, he couldn’t make himself. The day that Xiao Wu would be resurrected was approaching, but the closer that got, the greater that his heart’s anxiety grew. With every day that Xiao Wu hadn’t resurrected, he wouldn’t be at ease.</p><br/><p> ……</p><br/><p>BOOM——. Golden explosions turned into countless rays of light that peppered the skies, and six massive golden wings spread outwards from her back, with a burst gold from her body. The rays of light flowed through the wings on her back instantaneously, like rivers flowing into a sea, as they turned into solid energy.</p><br/><p>Floating in mid-air, Qian Renxue closed her eyes and put both palms together in front of her chest. A sacred aura enveloped her already noble presence, giving her a lofty impression.</p><br/><p>Qian Daoliu stood quietly at a distance, watching his granddaughter who was substituting the sunlight, with eyes full of satisfaction.</p><br/><p>Qian Renxue opened her eyes. Her pupils had turned completely golden. On her forehead, there was a mystical golden flame brand that was pulsing.</p><br/><p>“Grandpa, I passed the fifth exam. My angelic affinity has risen to 40 percent.”</p><br/><p>Qian Daoliu smiled, “Your foundations run deep. That’s why you’ve been able to pass five exams in just a few years. The sixth exam will still be easy, but the last three will be harder than ‘hard’ can express. You should be mentally prepared.”</p><br/><p>Qian Renxue’s eyes glimmered with determination, “No matter how hard it might be, I’ll make it. Now I just want to know what my sixth exam consists of. When I pass this exam, I’ll worry about the final three.”</p><br/><p>Qian Daoliu’s eyes shone, “Very good. No arrogance or impatience. The appearance of these nine exams wasn’t only due to luck. It not only means that you have frightening talent and mentality, but also that the seraphim senses mortal danger. Only when you reach 100 percent affinity with the seraphim will you have the power to destroy your enemies and uphold angelic glory. Your sixth exam is to last the time it takes for a stick of incense to burn under my attacks. The time limit, one year.”</p><br/><p>Regardless of how resolute Qian Renxue’s eyes were, when she heard what Qian Daoliu said, even her radiant face changed color.</p><br/><p>Qian Daoliu didn’t give her any further explanation. Golden flames instantly rose from beneath his feet. Nine dazzling rings followed the large golden wings that spread from his back. With his right hand raised, the center of his palm seemed to have a golden eye. An incandescent light burst forth. The next moment, Qian Renxue’s body was blown a hundred meters away by a strong pillar of light, and had blood pouring out profusely.</p><br/><p>“Remember. I will show no mercy. If you can’t withstand this, recover and try again.”</p><br/><p> ……</p><br/><p>At Supreme Pontiff Hall, Bibi Dong stood atop a large balcony. From here, she could overlook the 270 degree scenery under the mountain. The only thing that she couldn’t see was Douluo Hall, which stood higher behind.</p><br/><p>As if sensing something, her eyes suddenly turned a purplish-black color. What originally had been a noble and holy air was seemingly destroyed by this purplish-black light. Her eyes swept in all directions, before her head was raised slowly. A magic brand slowly appeared on her forehead. Her originally peerless face instantly turned vicious.</p><br/><p>Turning quickly, the door behind her opened without even being touched by the wind. Before she entered the door, one could vaguely see her body expand to a terrifying height of five meters, and her lower body get even more massive. Unleashing an utterly terrifying purplish-black aura, she released spirit rings which were different than the nine she’d show before others. Currently she was showing six black and one red. Seven abstruse spirit rings.</p><br/><p> ……</p><br/><p>Fifteen meters above the aquamarine seawater, a slender figure tumbled through the air. Under him, a large white figure soundlessly changed shape. A massive shark tail over two meters wide swung up, as if launched from a great bow. At that instant, a greyish-blue light with the same form as the shark tail shot out and expanded in the sky, straight towards the tumbling figure.</p><br/><p>When the figure that was tumbling in midair was about to get caught by the light of the shark tail, a strong red light suddenly burst forth from the figure’s left leg as he curled up his whole body. Immediately after that, his left leg shot out like a whip.</p><br/><p>WOO——, a low pitched yet fierce roar actually came from his leg, and, like a razor, a dark red light shot out like a giant battle axe falling from the skies. It crashed into the greyish-blue light of the shark tail, like the sky falling.</p><br/><p>BOOM——.</p><br/><p>An unparalleled loud explosion took place in mid-air…… The two massive energies burst into a force that could create giant waves, which rose up more than thirty meters high. When the waves receded, the sea already had a new giant whirlpool, whose diameter was up to twenty meters.</p><br/><p>The white figure was pulled from the sea by the great force, and flipped around in the air, before crashing into the seas again. Judging by its shape, it should be none other than the Devil Spirit Great White Shark King Xiao Bai.</p><br/><p>Yet the tiny figure in mid-air kept raising its altitude, its left leg consecutively sending out waves of red light, like sharp daggers meant to cut apart the massive shockwave. His body then squeezed through a small crack in the shockwave like a swimming fish.</p><br/><p>Slamming out from the opposite direction.</p><br/><p>It was clear now that the figure in the air was actually completely blue and gold colored, and in the counterattack, countless blue and gold beams burst out with his body’s two yellow, one purple, two black, and three red spirit rings, which were enough prove his identity as Tang San.</p><br/><p>Tang San’s bright eighth spirit ring shone suddenly, causing his body and the beams of blue and gold to turn red. With the rotations of his body, every beam carried a red tint, and as the curtain of beams spread out, they swiftly covered the range of seawater within a hundred meters.</p><br/><p>A strange sight appeared. The seawater actually froze when enveloped in the red beam curtain, separating it from the seawater outside, down to a depth of more than a hundred meters, surrounding Xiao Bai who’d crashed into the water inside. And in this instant, the red tinted seawater froze up. It turned jewel-like with extreme clarity, and colorful reflections like that of a mirror. Tang San’s surrounding beams then rotated around him, forming a blood colored wheel in the air, contrasting him.</p><br/><p>Faintly smiling, Tang San looked at the giant frozen red crystal, and took no further action. He just waited silently, like he could see the Devil Spirit Great White Shark King Xiao Bai locked within the frozen water, like it was something weird.</p><br/><p>Time passed for almost half a stick of incense to burn. A series of explosions happened within the red crystal, cracks spreading from within. Within the time of three deep breaths, a ‘PENG’ rang out, and the giant red crystal shattered into a diamond-like dust. Xiao Bai also managed to struggle free, flipping into the seawater. Instantly accelerating, she leapt several hundred meters, then looked up at Tang San in mid-air.</p><br/><p>“Enough, I’m not gonna fight with you, you freak, anymore.” Xiao Bai’s voice of discontent came from far away.</p><br/><p>Tang San turned to where she’d moved, withdrew the blood red light wheel surrounding him and the blue and silver, and then smiled, “How come?”</p><br/><p>Xiao Bai fumed, “I really don’t know whether letting you take the Orca King’s spirit ring and spirit bone was a good thing or a bad thing. Its abilities counter me exactly. Although your spirit energy still can’t compare to mine, these techniques are just too annoying. Can’t you use something else?”</p><br/><p>Tang San let out a laugh, “Xiao Bai, during battles, of course we have to use the most effective techniques!”</p><br/><p>Xiao Bai murmured, “I admit it, you’re a real freak. Fine. Three Hundred Thousand Year spirit rings, and three out five of your spirit bones are also Hundred Thousand Year ones. Adding the might of the Seagod’s light, even with the great sea, I’d have a hard time winning against you. I’m afraid I’m already out of your league on land, so I seriously think that you can complete your mission now. Three days is a short time, but at your level of freakishness, it’s not impossible to win against those seven fellows. I’m not gonna train with you, because if you weren’t holding back, I wouldn’t be able to come back in one piece.”</p><br/><p>Tang San looked at Xiao Bai’s defeated face and consoled her, “Alright, then I won’t look for you to train with. But you shouldn’t feel bad. After all, you didn’t lose to me, but rather your natural predator!”</p><br/><p>“Ptooie, ptooie, ptooie. Just scram, I’m not gonna play with you.” After saying that, Xiao Bai left downheartedly, and went deep into the sea in a few strokes.</p><br/><p>Watching her terrifying speed, Tang San sighed in his mind. Xiao Bai was indeed the overlord of the sea. He noted that he could now suppress her in terms of powers. But in actuality, if it were a matter of life and death, she just had to rely on speed in the sea, and fight a moving battle until his spirit power ran out. At that point, how would he be able to win against her? The sea was her best battlefield!</p><br/><p>Flying to the shore, Tang San saw his companions gazing at him helplessly. He scratched his head somewhat embarrassed, “I didn’t mean to anger Xiao Bai, but she said that we should be able to complete the mission now.”</p><br/><p>Dai Mubai, Oscar, Ma Hongjun, Ning Rongrong, and Zhu Zhuqing looked at Tang San’s awkward state, and all unanimously said, “Freak.”</p><br/><p>“Urk…..” Tang San was stunned for a bit, but quickly replaced his expression with a slightly evil smile.</p><br/><p>“I think it’s like this. My strength shouldn’t be worse than a normal Title Douluo’s. Since your fifth trial is to face them as opponents, and Xiao Bai doesn’t want to train with us anymore, let me help cover up for your losses.”</p><br/><p>While he was saying this, Tang San’s shoulders moved slightly. His bones made a series of cracking sounds. It wasn’t without rhythm, instead they were like the collisions of stones, like the pleasant sounds of a traditional dulcimer.</p><br/><p>Along with Tang San constantly training his body, he’d gradually spread Mysterious Jade Hand’s skills throughout his body. Right now, he was displaying the fact that he’d trained his body to the point of his bones being like jade. This stage was what he’d achieved upon obtaining the eighth spirit ring, after getting past the 80th spirit rank. Although his bones couldn’t achieve the same durability as his Mysterious Jade Hand, he was already getting close, and he had a terrifying resistance towards impacts.</p><br/><p>When he looked at Tang San’s evil smile, Dai Mubai also smiled and nodded, “That isn’t a bad idea. But, I have a question Little San.”</p><br/><p>“What?” Tang San asked.</p><br/><p>Dai Mubai pointed at himself, Oscar, and the others, “Do you intend to duel the five of us? Or are you letting us team up against you?”</p><br/><p>Tang San was expressionless, “Boss Dai, is there any difference?”</p><br/><p>Dai Mubai tilted his head, and purple light shot from his evil eyes, “It doesn’t seem like there’s any difference... so are we starting now?”</p><br/><p>Tang San smiled a little and said, “That’s fine. Let’s do it.”</p><br/><p>From this, it was Dai Mubai’s turn to be stunned, “Little San, you’re really going to fight all of us together?”</p><br/><p>Tang San replied, “Is there a problem? Let’s begin.” As soon as he finished speaking, he didn’t give them a chance to speak again. Blueish-gold rays had already sprung forth.</p><br/><p>Blue-Silver Domain’s Boundless Nature. Once activated, the surroundings would instantly turn into a blue and gold color. One should note that, although it was near the seaside, Seagod Island’s plants were still numerous. The Five Devils were almost surrounded by the shadows of the trees in an instant, as everything became like a mirage. Meanwhile, they could feel a sudden robbing of their life force from the nearby plants. The strength of Tang San’s domains had become even more freakish since he’d passed spirit level 80.</p><br/><p>Dai Mubai shouted, “Assemble.”</p><br/><p>But before his words had ended, a muffled moan came from beside him, surprising him. He turned his head to look.</p><br/><p>The one who’d moaned was Oscar. No one knew when, but a blueish golden figure had appeared behind him. A powerful large blueish golden hand was clasping his cheeks, while another hand grasped Oscar’s hands. The clone mirror sausage that was near his mouth couldn’t be eaten.</p><br/><p>“Sleep for a while.” Tang San’s voice rang next to Oscar’s ear. He wanted to resist, but even with more than 70 levels of spirit energy, if he couldn’t eat the clone mirror sausage, he was just a food spirit master with a somewhat buff body. No matter how well built his body was, who could match up to Tang San?</p><br/><p>A gentle spirit stabbed into Oscar’s mind. His body fell limp in Tang San’s embrace.</p><br/><p>Dai Mubai’s large fist landed at this moment. He didn’t take Oscar back, choosing to save him by slugging Tang San’s head, and attacking when the enemy was stuck defending. This was the best way to save Oscar.</p><br/><p>Zhu Zhuqing turned into a phantom and jumped in from the side as well. Dark rays headed towards Tang San’s waist. One should know that Tang San’s five spirit bones were a skull, external spirit bone, right arm bone, and both leg bones. These five spots naturally had the highest defense, while a waist is a person’s center. Once the impact to the waist took place, it would achieve an effect of disorientation, after which Tang San’s strength would greatly decrease. The Blue Silver Domain’s weakening effect would increase as time dragged on. If their full strength wasn’t used now, then they’d have an even harder time later.</p><br/><p>Zhu Zhuqing and Dai Mubai’s attacks all landed on Tang San. They thought that Tang San would definitely be able to dodge, but this way, Oscar, who he’d just taken control of, would definitely be rescued. Thus, Tang San took the two’s attacks head on. However, whilst taking on the attacks, his body had an extra layer of golden light. It was Xiao Wu’s spirit bone ability, Invincible Golden Body taking effect.</p><br/><p>Eardrum-piercing grinding sounds and low-pitched colliding sounds echoed. Tang San just shook his upper body, but at the same time, the unconscious Oscar was taken into his storage belt. Poor Oscar couldn’t even release his clone, before he was taken out of the battlefield completely.</p><br/><p>In the next moment, Tang San’s body disappeared again, teleportating</p><br/><p>“Fatty, protect Rongrong!” Dai Mubai shouted while shaking his body. His seventh spirit ring shone, releasing his spirit avatar, turning him into a giant white tiger. Together with Zhu Zhuqing, they lept straight towards Ma Hongjun and Ning Rongrong.</p><br/><p>Meanwhile, Ning Rongrong had already completed her spirit avatar, and Ma Hongjun didn’t need Dai Mubai’s reminder to realize her importance. Ning Rongrong’s buffing ability was no doubt everyone’s trump card to defeating Tang San, as Oscar had lost to Tang San’s sneak attack. Ning Rongrong couldn’t be lost, while both Dai Mubai and Zhu Zhuqing couldn’t be easily taken out by Tang San in a short time.</p><br/><p>Ma Hongjun waited as Dai Mubai and Zhu Zhuqing hurried to substitute him in protecting Ning Rongrong. This way he could also display his own spirit avatar, and thereby use his Phoenix Domain. His domain was different from Tang San’s. Tang San’s two great domains were innate domains, while Ma Hongjun’s Phoenix Territory actually came from the Ten-headed Ardent Yang Serpent’s neidan. Hence, he could only use it when in his spirit avatar state.</p><br/><p>Fire is the bane of wood. Although Tang San’s Blue Silver Domain had fire immunity, Ma Hongjun was aware that if he could put up his Phoenix Territory, then he could at least guarantee that the Blue Silver Domain’s effects would be kept to a minimum for the four of them. Fighting against Tang San would be much easier as a result.</p><br/><p>However, wishes are wishes, yet often can’t be realized. Indeed, the Shrek Five Devils’ strength were just as powerful. Dai Mubai was already close to level 80, but not only had Tang San’s spirit power gone up in just these few months from training with Xiao Bai, from past level 83 after obtaining his eighth spirit ring to breaking through into the eighty fourth rank, more importantly, as the soul of the team, his understanding of the others was far too deep.</p><br/><p>The illusionary blueish-gold figure appeared once again, but didn’t attack Ning Rongrong, as Dai Mubai had predicted. He soundlessly appeared next to Zhu Zhuqing’s side.</p><br/>\n</div>"}