{"title": "Chapter 230", "id": 230, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-230", "volume_title": "Volume 3", "body": "<h1>Chapter 230</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 230</p><br/><p>Rash Devil Spirit Great White Shark King</p><br/><p>(TL by Bagelson)</p><br/><p>Seeing Tang San and Dai Mubai’s miserable appearances, Oscar and Ma Hongjun were already laughing. The Shrek Seven Devils were absolutely elite among the elite of the young generation, and Tang San and Dai Mubai were again the strongest two. Seeing them turned into such sorry figures absolutely wasn’t easy. Unfortunately, there was no way out from the situation they faced. This was an absolute gap in strength.</p><br/><p>In fact, a hundred thousand year spirit beast was far stronger than a common Title Douluo. Even the most common hundred thousand year spirit beast would be about the same as a ninety fifth rank Title Douluo, and this Devil Spirit Great White Shark absolutely didn’t seem like a common spirit beast. The ocean and forest also had differences. The forest had all kinds of plants as cover, and some small and weak spirit beasts could still stay out of the way of formidable ones. But there was no cover in the ocean, and only some spirit beasts specializing in hiding on the seabed had a chance to avoid attack. Therefore, the law of the jungle was even more true in the sea than the forest. To be able to cultivate to the hundred thousand year level in the ocean was naturally also several levels more difficult than cultivating in the forest. This was also the reason the Deep Sea Devil Whale Tang San and the others encountered before was so frightening.</p><br/><p>The second time he entered the sea, Tang San clearly felt it more strongly than last time. He discovered that, as he entered the water, as he saw that enormous white shadow, all the surrounding seawater seemed to become a part of that Devil Spirit Great White Shark King. Him and Dai Mubai entering the seawater was equivalent to entering its domain, and were ejected from the ring sea basically without the chance to resist. But the Devil Spirit Great White Shark King merely swung its tail in the water. Moreover, when it blasted them out of the ring sea, it seemed to be grinning in their direction, as if mocking them.</p><br/><p>Just as Tang San and Dai Mubai smiled wryly at each other, in their hearts completely unable to imagine a way to break through in front of the Devil Spirit Great White Shark, suddenly, in the swelling seawater, the enormous white shadow swiftly moved in their direction. With its speed, it had reached the shore in basically just a few eyeblinks.</p><br/><p>A feeling of danger instantly struck Tang San’s heart, and he shouted:</p><br/><p>“Careful.”</p><br/><p>The Shrek Seven Devils had cooperated for so many years, and their movements were naturally well coordinated. In practically the first instant, each person had released their spirits, and Tang San even more swiftly teleported to Xiao Wu, pulling her into his embrace, prepared to put her into his Wishful Hundred Treasure Purse at any time. Dai Mubai, Ma Hongjun, Oscar, and Zhu Zhuqing were in front, guarding Ning Rongrong behind them, while Bai Chenxiang had soared up, flying in the air. She didn’t have much attack power, but she absolutely wouldn’t hold back the Shrek Seven Devils.</p><br/><p>The white silhouette grew before everyone’s eyes, and before their astonished eyes, that giant Devil Spirit Great White Shark King actually leapt out of the water, soaring in midair, glaring grey blue light blossoming from its perfectly streamlined body. Bizarrely, its body actually swiftly shrank in the air. As everyone watched stunned, it very quickly transformed into a tall young woman before them.</p><br/><p>Her height astonishingly seemed about the same as Tang San’s. An ordinary girl might very easily appear uncoordinated with such a height, but she appeared perfect. A white leather style attire drew the outline of a perfect body, each and every perfect curve making her seem brimming with allure. Grey blue long hair was draped across her back, unexpectedly as long as Xiao Wu’s and hanging to the ground. Her eyes were also grey blue, and a faint grey blue luster appeared on her fair skin. Her nose was tall and straight, her features a bit angular, but appearing extremely characteristic rather than abrupt. She had a kind of moving alien grace.</p><br/><p>Seeing her, the four men present, besides Tang San, the eyes of Dai Mubai, Oscar and Ma Hongjun practically all brightened. The killing power of such a characteristic foreign woman’s appearance was quite severe to men.</p><br/><p>However, currently this Devil Spirit Great White Shark King turned woman wasn’t here to cheer them on. She landed on the ground after transforming, fixedly watching Xiao Wu, bizarre grey blue light constantly flashing in her eyes. Tang San could clearly feel a bizarre energy fluctuation from Xiao Wu’s body, and the appearance of this energy fluctuation clearly had a direct relationship with the Devil Spirit Great White Shark King.</p><br/><p>“No soul? The aura is here.”</p><br/><p>The Devil Spirit Great White Shark King’s gaze shifted from Xiao Wu to Tang San, grey blue eyes suddenly emanating intense killing intent, the ice cold gaze piercing towards Tang San’s eyes like sharp blades.</p><br/><p>Tang San’s Purple Demon Eye reacted purely instinctively with purple golden light, but even so he couldn’t help a muffled grunt, drawing Xiao Wu close and repeatedly retreating three steps to catch his balance. In his heart was overwhelming shock. In fact, his current spiritual force was already quite formidable, but this Devil Spirit Great White Shark King’s spiritual force gave him a feeling like the depth of the ocean, and her spiritual force was moreover the same as her main form, filled with unreasoning offensive power.</p><br/><p>“Contemptible human. I will kill you.”</p><br/><p>The Devil Spirit Great White Shark King’s voice was somewhat stiff, but when her words fell, her body had already flashed, reaching Tang San in practically an instant, leaving a series of illusory grey blue afterimages.</p><br/><p>Even though Tang San had already guessed the Devil Spirit Great White Shark King’s killing intent was aimed at him because of Xiao Wu, at this moment he basically had no chance to explain. He made two simple actions, first putting Xiao Wu into his Wishful Hundred Treasure Purse, secondly to teleport away. When he reappeared he was already standing together with his companions.</p><br/><p>Dai Mubai roared, basically without hesitation, directly using his seventh spirit ability, White Tiger Avatar. Confronting a hundred thousand year spirit beast turned human, he didn’t dare hold back in the slightest. As a power attack type Spirit Master, he had to stand furthest in front.</p><br/><p>The formidable White Tiger’s three great boost abilities acting simultaneously, Dai Mubai brazenly met the pursuing Devil Spirit Great White Shark King’s charge.</p><br/><p>At the same moment, red hot phoenix flames had soared up around Ma Hongjun. Both hands folded at his chest, an immense phoenix silhouette materialized behind him, and at the same time his sixth spirit ring also brightened.</p><br/><p>Zhu Zhuqing incarnated as a black cat at the same time as Dai Mubai turned into the white tiger, equally employing her Spirit Avatar. Quietly leaping out from the side, her whole body was just like smoke, surreptitious yet brimming with a gloomy feeling.</p><br/><p>Oscar directly ate a clone mirror sausage made from Dai Mubai’s blood. But he had only just received his seventh spirit ability, and this clone mirror sausage wasn’t made after using the seventh spirit ability, Erect Golden Fly, and consequently only had eighty percent efficiency. He still hadn’t broken through the seventieth rank when he made it, and therefore was unable to clone Dai Mubai’s spirit avatar, and could only release the three great support abilities and charge closely behind Dai Mubai.</p><br/><p>Ning Rongrong blossomed with the most resplendant light. Besides the last spirit ring of the dazzling Nine Treasure Glazed Tile Pagoda being grey, the other six rings were all glittering. After breaking through rank seventy, even though she currently was unable to use her seventh spirit ability, her spirit power and boost spirit ability control capability had equally risen. Different rays of light flew in different directions, all sorts of boost abilities criss crossing and releasing, amply revealing her heart separation control ability, boosting her comrades to the greatest degree, with the greatest spirit power efficiency.</p><br/><p>All this happened after Tang San dodged the Devil Spirit Great White Shark King’s first attack, as he returned to his comrades. When the Devil Spirit Great White Shark King pursued, she was just met by the White Tiger Avatar Dai Mubai.</p><br/><p>Giving a cold disdainful snort, the Devil Spirit Great White Shark King’s whole body flourished with grey blue light, body swinging, her right leg lashed out like a whip. In that instant, seven water-like ripples of grey blue light blades erupted, crisscrossing and flashing in midair, simultaneously cutting towards seven points on Dai Mubai’s body, with exquisite energy control that was simply astonishing to see.</p><br/><p>However, Dai Mubai was no vegetarian either. Dazzling light flashed in his double tiger pupiled eyes. Not retreating a fraction when confronting the Devil Spirit Great White Shark King’s attack, his body suddenly rising up, two tiger palms swinging out alternately, ejected tiger claws equally cutting out seven golden light blades, and the positions also met the Devil Spirit Great White Shark King’s seven attacks.</p><br/><p>Concentrated colliding sounds exploded in midair. Dai Mubai gave a muffled groan, his forward charge screeching to a halt, and the golden light he emanated also dulled a moment. But after just a split second it again erupted with even more dazzling brilliance. He unexpectedly forcefully withstood the Devil Spirit Great White Shark King’s attack.</p><br/><p>With Dai Mubai’s spirit power, even while using Spirit Avatar, there was no small gap to the Devil Spirit Great White Shark King. But don’t forget that he also had Ning Rongrong’s support. This was on dry land, and Ning Rongrong’s unweakened eighty percent boost affected him completely, equivalent to giving him one hundred eighty percent attack power, defensive power, and spirit power. Even though it still wasn’t more than a Title Douluo, adding Dai Mubai’s own four great boost abilities, even ordinary Title Douluo would find it difficult to compare in such a frontal confrontation.</p><br/><p>The attacks blocked by Dai Mubai, the Devil Spirit Great White Shark King couldn’t help pausing, grey blue eyes flashing with a trace of surprise. But her attack still didn’t stop, body swaying like whirlwind, kicking out once again. But this time she didn’t issue energy attacks, but rather physically kicked towards Dai Mubai’s body.</p><br/><p>Dai Mubai roared, his enormous body leaping up, a pair of tiger palms crossing in front of his chest, still stiffly blocking. A power attack type Spirit Master’s style of most directly blocking the enemy.</p><br/><p>Amidst a loud bang, Dai Mubai’s body was directly thrown out, rolling in midair and tumbling aside.</p><br/><p>But at this moment, the Devil Spirit Great White Shark King’s body halted, both hands forming palms, one after another slapping out, a whirlpool-like grey blue light abruptly bursting out.</p><br/><p>Her pause of course wasn’t to let Tang San off, but rather because she had no choice. Because in front of her a one meter wingspan red golden phoenix condensed from energy into substance charged straight at her.</p><br/><p>Ma Hongjun’s sixth spirit ability, Phoenix Cloud Piercing Strike, was released at just the same moment Dai Mubai was blasted away. This attack could be said to condense all of Fatty’s strength. Moreover, apart from defensive power, it also underwent the other five boosts of the Nine Treasure Glazed Tile Pagoda, including attribute boost.</p><br/><p>Confronting the immense pressure brought by the Devil Spirit Great White Shark King, Fatty’s attack could even be said to surpass his level. That red gold phoenix, seemingly solid, contained terrifying might. Even a power as formidable as the Devil Spirit Great White Shark King had no choice but to treat it cautiously.</p><br/><p>Grey blue and fiery red, the two colors suddenly collided in midair. The grey blue color cut the golden red phoenix like a meat grinder, and the two colored lights erupted with frightening energy fluctuations, ear piercing explosive sounds and dense mist constantly erupting.</p><br/><p>Fire and water mutually restrained each other, so Fatty with the phoenix flame undoubtedly possessed the greatest killing power towards a sea spirit beast like the Devil Spirit Great White Shark King.</p><br/><p>Seeing that swiftly shrinking golden red fire phoenix actually blocking the whirlpool, the Devil Spirit Great White Shark King cried out, both hands flickering like illusions, that grey blue whirlpool instantly growing yet stronger. Amidst another explosion, terrifying energy fluctuations dispersed all around. The Phoenix Cloud Piercing Strike also finally dispersed.</p><br/><p>But at this moment, a black illusory figure appeared behind the Devil Spirit Great White Shark King, altogether seven of them, each issuing a crescent moon like black chop, noiselessly, even without any energy fluctuations, simultaneously cutting towards the Devil Spirit Great White Shark King’s waist. Precisely Zhu Zhuqing’s attack.</p><br/><p>Rich with actual combat ability, the timing she chose could even be called marvellous. Precisely after the Devil Spirit Great White Shark King had blocked Ma Hongjun’s attack, the moment her protective spirit energy relaxed a bit. The strongest capability of agility attack Spirit Masters was sneak attacks. This was an all out attack in a spirit avatar state, with piercing strength, Zhu Zhuqing revealed destructive power that was even greater than Ma Hongjun’s.</p><br/><p>The fifth spirit ability, Hell Shadow, linked into the third spirit ability, Hell Chop, with seven chops united as one, the might was extremely terrifying.</p><br/><p>At the exact same moment, Dai Mubai also returned, each golden strand of fur all over his body bursting with gaudy golden light. His enormous form transformed several times in midair, golden light intersecting and erupting, transforming into a giant ‘kill’ character in the air, sealing towards the Devil Spirit Great White Shark King’s body.</p><br/><p>This was Dai Mubai’s sixth spirit ability, White Tiger Annihilation Kill. It was also the spirit ability with the most unreasoning attack power he possessed thus far.</p><br/><p>It was also Dai Mubai and Zhu Zhuqing who possessed the spirit fusion ability. With extremely tacit cooperation, as well as previously joining Ma Hongjun, they basically didn’t give the Devil Spirit Great White Shark King any chance for respite. And to the side, Oscar was also in position, equally using a White Tiger Annihilation Kill. Even though he lacked Dai Mubai’s Spirit Avatar boost, and could only bring out eighty percent spirit power, Oscar’s attack wasn’t just one, but two, his clone skull bone equally erupted with an attack from another side, sealing the Devil Spirit Great White Shark King’s leeway to dodge to either side. In a moment, they made her confront simultaneous attacks from four directions.</p><br/><p>The dark Clear Sky Hammer fell from the sky. Tang San had at some point already moved into the air, and the Clear Sky Hammer fell with the weighty force of the full urging of his spirit power. At the same instant, white light erupted from behind Tang San, enveloping him, and also enveloping his three comrades and the Devil Spirit Great White Shark King. It was the Deathgod Domain.</p><br/><p>Even without the third evolved ability, Asura Hell Prison, the Deathgod Domain was still after all a domain type ability, weakening the enemy and reinforcing his side, in an instant it made the four peoples’ attack power rise yet another level.</p><br/><p>Four people, attacks from five directions, Ning Rongrong’s all out support from behind, this combined assault was equal to the Shrek Seven Devils’ certain kill strike. If not for Tang San’s Blue Silver Emperor spirit abilities being restricted, the might of this attack would be even more frithegning. However, even so, perhaps even a Title Douluo might find it difficult to resist.</p><br/><p>“Humph——”</p><br/><p>A furious snort burst from the Devil Spirit Great White Shark King’s mouth. Tang San and the four others simultaneously felt their pulse sway along with the Devil Spirit Great White Shark King’s snort. The Devil Spirit Great White Shark King made a very peculiar action, the tops of the left foot’s toes pointing to the ground, right foot rising, sticking to to left leg’s calf, while simultaneously encircling her chest with both hands, her whole body swiftly rotating. Her hair, like a waterfall reaching the ground, was thrown up, lashing towards everyone like whips. The whirlpool that previously blocked Ma Hongjun’s attack was now released from her whole body. Moreover, the Devil Spirit Great White Shark King’s body also emitted a layer of grey blue light, and everyone nearby sank into a world of grey blue.</p><br/><p>A choking feeling assailed everyone. Each of them felt unbalanced, rather swaying slightly, and their previous all out attack grew somewhat deformed by this unbalance. Then they collided with the Devil Spirit Great White Shark King.</p><br/><p>Explosive sounds like rain hitting palm leaves suddenly erupted, a clear cry resounding from the midst of the battle. The Devil Spirit Great White Shark King’s body abruptly expanded, actually transforming in an instant, forcefully expanding the Tang San and the others’ circle of densely crowded attacks. Tyrannical energy collided with Tang San, making Tang San even more fly directly high in the sky.</p><br/><p>In her original form, the Devil Spirit Great White Shark King’s strength magnified. The giant fish tail lashed out, whipping Dai Mubai and Oscar, with force as terrifying as a landslide. And Zhu Zhuqing attacking from the back met the Devil Spirit Great White Shark King’s sharp teeth. Under frightening attack power, she was forced to swiftly retreat.</p><br/><p>At the crucial moment, Oscar made the best choice, his clone body directly meeting the Devil Spirit Great White Shark King’s tail, while he and Dai Mubai swiftly pulled back.</p><br/><p>With a puffing sound, Oscar’s clone body turned into smoke and disappeared without a trace, but he and Dai Mubai were also sent tumbling by the full force of the shark tail, only regaining their balance after several dozen meters, traces of blood flowing from the corners of their mouths.</p><br/><p>The Devil Spirit Great White Shark King didn’t pursue them. Shark tail lashing out once again, but this time the target was the ground. With a loud explosion, a deep hole was opened in the beach. And using the momentum from this, she directly pursued Tang San in the air. At the same time, a peculiar energy fluctuation erupted from her head, transforming into rings of grey blue light that covered the horizon.</p><br/><p>In that instant, Tang San only felt like his spiritual force was restrained within his head by an enormous force, unexpectedly unable to move outwards in the slightest. And without spiritual force to position himself, his teleportation was naturally also unusable. This Devil Spirit Great White Shark King’s intelligence absolutely wasn’t inferior to that of humans, she wanted to force Tang San to confront her head on.</p><br/><p>Tang San didn’t panic even when facing the Devil Spirit Great White Shark King’s giant body, faint golden light appearing on the surface of his body. When he collided with the Devil Spirit Great White Shark King, he clearly saw amazement reflected in its eyes, and immediately afterwards, she seemed to grow even more furious.</p><br/><p>The grey blue light contracted, and in midair, after the Devil Spirit Great White Shark King blasted Tang San with Invincible Golden Body flying, she returned to human form. If it was her original form, her tremendous weight would have already pulled her to the ground, but back in human form, her weight wasn’t an issue. Even though she couldn’t fly, she still had her own means. Both hands pushing down at nothing, the air issued explosive noises like rolling thunder, unexpectedly pushing her to once again soar through the sky. At the same moment, line after line of grey blue light formed around her, the several dozen grey blue lights shaped like teeth were like Fatty’s attack before, even though they were formed from energy, they still had substance, and directly shot towards Tang San.</p><br/><p>Shark’s Teeth, one of the Devil Spirit Great White Shark King’s strongest abilities. After the Devil Spirit Great White Shark King erupted with this attack, her body fell uncontrollably towards the ground. It could be seen from her heaving chest that the consumption from the previous series of collisions was also quite considerable for her. After all, enduring the simultaneous siege of six devils wasn’t that easy. This was on dry land, and not in the ocean, so there was a certain restraint to the Devil Spirit Great White Shark King’s body. She had already used her full strength to break the siege and attack Tang San.</p><br/><p>Tang San discovered that his surroundings seemed frozen, the air as if boiling, delaying him. Even the Deathgod Domain and the Blue Silver Domain were unable to cut open this blockade, and those Shark’s Teeth weren’t a one off attack, it had layers of pursuit and attack, completely under the Devil Spirit Great White Shark King’s control. Clearly, she had already guessed that Tang San’s Invincible Golden Body had limited use frequency, and would use this method to exhaust his remaining uses, finally still killing him with her Shark’s Teeth.</p><br/><p>The terrifying attack of full Title Douluo strength had forced Tang San into a corner.</p><br/><p>If Tang San still had the seven great Blue Silver Emperor spirit abilities, even when facing such an attack he would still have absolute confidence in defending himself. His two great domains’ third evolved abilities could also sever the Devil Spirit Great White Shark King’s restraint towards him as well. At most he would just be a bit injured. But while restrained he didn’t have this ability. Could it be that he would die in the hands of that hundred thousand year spirit beast like this?</p><br/><p>In the depths of his mind, Xiao Wu’s soul throbbed restlessly, wanting to break out to fight alongside him. Even though Xiao Wu had warned him once, at this moment, how could Tang San release Xiao Wu? He absolutely didn’t want to see her suffer any harm.</p><br/><p>Just at this moment of danger, something that surprised everyone occurred. The golden trident on Tang San’s forehead suddenly blossomed with dazzling light. An extremely immense golden trident image carved with intricate dazzling patterns appeared behind him, rippling with golden light, transforming into a dazzling ring of light that spread out. As the Shark’s Teeth filled with frightening attack power were enveloped in this golden light, they unexpectedly melted away as if ice and snow.</p><br/><p>In that instant, everyone present felt a difficult to describe dignity. And Tang San was the center of this aura. Dai Mubai and Zhu Zhuqing who had started spirit fusion when they saw Tang San in dire straits were interrupted, and Ma Hongjun who was flying to the rescue was also pushed back to the ground by that dignified aura.</p><br/><p>And the previously furious Devil Spirit Great White Shark King suddenly grew lifeless, the instant her feet were firmly planted on the ground, she actually knelt with a putong sound, the fury in her eyes completely replaced by pious radiance.</p><br/><p>The scene before their eyes was so shocking that everyone seemed to stop breathing, but as the person involved, Tang San’s expression was blank, he really didn’t feel that dignified aura. Only the pressure around him suddenly disappeared, the distorted air also returning to normal.</p><br/><p>The golden light vanished, and the trident image behind Tang San quietly disappeared, as if it had never been there, and the trident brand on his forehead also returned to its original shape. At this moment, even the ring sea was quiet. Not only the Devil Spirit Great White Shark King knelt on the ground. On the top of Seagod Mountain, Seagod Douluo Bo Saixi also equally knelt in the temple, two tears rolling down her cheeks, her mouth murmuring something.</p><br/><p>Tang San fell to the ground, and the six devils gathered together. The other five looked at Tang San with gazes as if seeing a monster, but Tang San was still at a loss, not understanding what had happened just now.</p><br/><p>At this moment, the Devil Spirit Great White Shark King spoke up. The expression in her eyes was extremely moved, bowing in salute towards Tang San,</p><br/><p>“My mistake, revered lord Seagod, I shouldn’t have violated your decrees. Please pardon my blasphemy, I won’t dare do it again.”</p><br/><p>Tang San’s mind now brightened, he clearly felt that the Devil Spirit Great White Shark King wasn’t bowing to him, but rather to the golden trident brand on his forehead. In his heart he seemed to have caught on to something, but right now he didn’t dare be certain. However, the crisis could also be said to have passed. It seemed the Devil Spirit Great White Shark King didn’t dare attack him again.</p><br/><p>Having spoken, the Devil Spirit Great White Shark King looked around her, then looked up at the sky. Discovering nothing abnormal, she then heaved a sigh of relief. The way she looked all around was unexpectedly like she’d done a mischief, and the Shrek Seven Devils couldn’t help feeling like wanting to laugh when they saw it. Was this still the hundred thousand year spirit beast that had almost killed Tang San just now? How come she looked more like a little girl that had just made a mistake?</p><br/><p>Patting her chest and heaving a long sigh, the Devil Spirit Great White Shark King stood, looking at Tang San with a cold snort, the killing intent that had just disappeared reappearing,</p><br/><p>“Don’t think I have no means to deal with you with the lord Seagod’s shelter. To dare take us hundred thousand year spirit beasts for spirit rings and spirit bones, and even enslave her body. Once you’ve finished all the trials, I’ll still find you to settle accounts.”</p><br/><p>Tang San frowned,</p><br/><p>“I think, you might have misunderstood.”</p><br/><p>While speaking, he again released Xiao Wu from the Wishful Hundred Treasure Purse. Faint red light flashed past. Even though he couldn’t use his spirit abilities, that didn’t stop Xiao Wu’s soul from appearing. Red light flashed, and the blankness in Xiao Wu’s eyes disappeared, her soul returning.</p><br/><p>The Devil Spirit Great White Shark King clearly sensed the changed in Xiao Wu, and couldn’t help staring blankly, stupidly saying:</p><br/><p>“You, you’re still alive?”</p><br/><p>Xiao Wu looked unimpressed at her,</p><br/><p>“You carelessly attacked without making clear the circumstances? THat’s right, he has my spirit ring and spirit bone, but I’m the one who sacrificed them for him. You’re a hundred thousand year spirit beast, you should understand just what that means.”</p><br/><p>“You, what did you say? Sacrifice?”</p><br/><p>The Devil Spirit Great White Shark King’s eyes opened wide. With her understanding, she couldn’t imagine a hundred thousand year spirit beast actually sacrificing herself for a human.</p><br/><p>Xiao Wu lowered her voice:</p><br/><p>“That’s right, sacrifice. Because my body took a special medicine it afterwards it stayed alive. Imagine you’re even a hundred thousand year spirit beast, but actually still so rash. If I hadn’t already chosen to reincarnate as a human, I’d definitely fight you.”</p><br/><p>The Devil Spirit Great White Shark King blinked, her slender hands gathering her somewhat disorderly hair, muttering:</p><br/><p>“This…… don’t tell me I made a mistake? Really. Hey, why didn’t you say it earlier?”</p><br/><p>The last words were clearly to Tang San.</p><br/><p>Seeing the Devil Spirit Great White Shark King’s reproachful expression, Tang San couldn’t help being a bit angry,</p><br/><p>“When did you give me the chance?”</p><br/><p>The Devil Spirit Great White Shark King looked distracted,</p><br/><p>“Yeah. Seems I didn’t. I was rash. True, you are the lord Seagod’s chosen person, how would…..”</p><br/><p>Speaking up to here, she clearly saw the golden trident brand on Tang San’s forehead flash once, and hastily shut up in fright. Patting her towering chest,</p><br/><p>“I’m sorry, I’m sorry, lord Seagod, I didn’t intentionally divulge it. My mistake.”</p><br/><p>Her not explaining was still fine, this explanation undoubtedly gave Tang San a lot of useful information. Tang San’s eyes also couldn’t help glinting. His thoughts moved like lightning, and some incomprehensible matters seemed to link together in his mind.</p><br/><p>Seeing the trident brand clearly show a tendency to grow in intensity, the Devil Spirit Great White Shark King hastily said:</p><br/><p>“My mistake, I apologize to you all. Treat what I just said as if you didn’t hear it. You absolutely didn’t hear it. Damn, damn, how could I make such a low level mistake. But, I won’t relax your second trial. In order to make it up for you, I can tell you that I will only stop you from passing the ring sea, but not directly attack you. My power is a lot greater in the sea than on dry land. Work hard. I’m leaving.”</p><br/><p>Speaking, she turned her head and left towards the ring sea.</p><br/><p>“Wait a moment.”</p><br/><p>Tang San quickly called out.</p><br/><p>The Devil Spirit Great White Shark King looked distracted a moment,</p><br/><p>“What?”</p><br/><p>Tang San said:</p><br/><p>“I have a question. You’re clearly in a hundred thousand year spirit beast form, but how can you transform into a human?”</p><br/><p>“That?”</p><br/><p>The Devil Spriti Great White Shark King pointed to herself,</p><br/><p>“Very simple. Haven’t you heard of mermaids? After we sea spirit beasts have cultivated for a hundred thousand years, if we go onto land we will be weakened thirty percent, but we can also subsequently take human form. Of course, there’s a time restriction. If we don’t return to the water for two hours, our bodies will gradually weaken, until we die. Among hundred thousand year spirit beasts, we’re also a special case. I didn’t have the courage to cultivate human form. Moreover, I’m still guarding the Seagod Island. I’m leaving. Oh, right, I can tell you my name, I’m called Xiao Bai[1], previously the lord Seagod called me Xiao Baibai.”</p><br/><p>Finished speaking, under everyone’s dumbstruck gazes, the Devil Spirit Great White Shark King Xiao Bai leapt up, entering the ring sea with a whooshing sound and transforming into her original form, reaching the depths of the sea in the blink of an eye.</p><br/><p>[1] Xiao Bai - () “Little White”</p><br/>\n</div>"}