{"title": "Chapter 248", "id": 248, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-248", "volume_title": "Volume 3", "body": "<h1>Chapter 248</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 248</p><br/><p>Controlling Crane Catching Dragon, Clear Sky Flying Hammer</p><br/><p>(TL by Armored Raven)</p><br/><p>The intense shock made Tang San’s organs feel like they were burning, but his consciousness was still very clear right then. He understood that he still had it better from the collision earlier. His father once said to him, ‘Clear Sky Hammer is the bane of all attack type battle spirits. No matter how powerful the attack type spirit is, the destructive power of Clear Sky Hammer itself will deal a heavy blow to the opponent.’ Moreover, when he swinged the Clear Sky Hammer to create a maelstrom, he also used Clear Sky Nine Finals’ ‘Shock’ character art, and in head-on conditions, would no doubt create the greatest effect. Without the Clear Sky Hammer, why else would Tang San give up his various wonderful spirit skills?</p><br/><p>Sea Dragon Douluo’s sacrificial skill was incomparably powerful, but when his body and the Clear Sky Hammer met, and when the attack power of both parties had very little difference, Tang San definitely had it easier. Sea Dragon Douluo’s damages would definitely be greater than his own. More importantly, Tang San’s restorative power was immense. Even without using Oscar’s restoration sausage, it would definitely be faster than Sea Dragon Douluo’s own.</p><br/><p>But Tang San wasn’t excited about it. The reason was simple. Because, he was in the sea and not the sacred pillar platform. Indeed, he got the upper hand from the strike just now, but his current position was several tens of metres away from the sacred pillar platform. What he could think of, Sea Dragon Douluo could also think of as well. In the sea was the opponent’s best time to attack. Only by returning to the platform could he overturn the flow of battle.</p><br/><p>This challenge was different from the previous ones. The course of battle was simplified, but much more perilous than others before. Even a slight mistake would lead to downfall. After all, without being able to use spirit rings and spirit bone skills, whether it was Tang San or Sea Dragon Douluo, their bodies would be more fragile compared to usual fighting conditions. Otherwise, they wouldn’t be spraying blood from their mouths due to the collision earlier.</p><br/><p>Therefore, Tang San immediately retracted his Clear Sky Hammer when his body was starting to sink rapidly, and simultaneously released Blue Silver Emperor. Using only the base battle spirit, he didn’t break the rules.</p><br/><p>In contrast to Clear Sky Hammer, the release of several tens of Blue Silver Emperor increased Tang San’s buoyancy as both his hands moved like they were pushing downwards. Although he couldn’t use Blue Silver Emperor right leg bone’s flying technique, he could still rise to the surface of the sea very quickly.</p><br/><p>But just then, Tang San’s expanding spirit power clearly captured a dark blue figure coming after him in frightening speeds. It went past Sea Dragon Sacred Pillar and closed in with such speed.</p><br/><p>So fast. Tang San’s expression became serious. He knew from simple calculation that Sea Dragon Douluo would be in front of him when he couldn’t get to the surface. In this great sea, his speed was greatly limited, while Sea Dragon Douluo would have some buffs as a sea Douluo. The latter’s attack power would even be increased under the effects of the sea.</p><br/><p>Sea Dragon Douluo was also unhappy now. He could feel that his arms almost broke from that earlier strike while the scales of his arms were all shattered. Although they were restored through battle spirit, his arms still shuddered intensely. The oppressive force coming from Clear Sky Hammer had seeped into his body entirely. While Tang San’s organs was on fire, his own were worse off. Falling into the sea and spraying out two mouthfuls of blood was the only way of getting rid of Clear Sky Hammer’s power from his body. Right here and now, he deeply understood the fearsomeness of his Clear Sky Hammer battle spirit, and greatly regretted promising Tang San not to brawl with spirit skills. Being in the sea, he feared that it was his last chance. ‘I can’t let that kid get on shore, or else I can’t last after a few more strikes.’</p><br/><p>Thus, while Tang San felt danger, Sea Dragon Douluo ignored his own injuries and immediately sped up in the water. Seawater would only become his thrust and not his drag. Very soon, he could see Tang San’s figure when using Blue Silver Emperor to get to the surface.</p><br/><p>‘What a great opportunity.’ Sea Dragon Douluo feared Clear Sky Hammer to an extent, but not afraid of Blue SIlver Emperor. Furthermore, being in the water while unable to use spirit skills, what strength could Tang San muster?</p><br/><p>In such a time, the one year training which Tang San underwent with Xiao Bai to polish maritime battle abilities during the second trial took crucial effect. Feeling Sea Dragon Douluo’s approach, he immediately gave his response. He immediately retracted his Blue Silver Emperor while his distance between him and the surface were just two metres away. At the same time, he took up Clear Sky Hammer in his hand again. Without stopping for a single second, Tang San’s left arm swinged and Clear Sky Hammer launched from his hand, straight towards the charging Sea Dragon Douluo.</p><br/><p>In just an instant after taking up the Clear Sky Hammer, the frightening weight dragged Tang San down by three meters. After throwing it away, Tang San turned upwards without hesitation and swam to the surface quickly.</p><br/><p>Sea Dragon Douluo couldn’t help but snicker at Tang San’s action. ‘You think you can stop me from attacking you that way? I’m not going to collide with you. Unable to use spirit skills, that hammer of yours can’t track me, can it.’</p><br/><p>Thinking till here, Sea Dragon Douluo swayed his body slightly and his scales opened and closed again, diving down rapidly to let the Clear Sky Hammer slip past. Next, with just a little force, he would be able to catch up to the surfacing Tang San. By then, the two of them would be like fish knife and fish meat.</p><br/><p>But something outside of Sea Dragon Douluo’s calculations happened. Tang San didn’t even turn his head, yet his left hand formed a claw and swiped back. With what seemed like just a slight swaying, Sea Dragon Douluo felt a tremendous pressure from the top of his head right when he was charging. When he raised his head, he could only see that the flashing dark golden lined black hammer had already arrived in front of him.</p><br/><p>‘This can happen too?!’ The range was too close, Clear Sky Hammer’s descent was also too quick, which made Sea Dragon Douluo give up chasing after Tang San without a choice. Both claws raised, he faced the hammer.</p><br/><p>A lasting ‘BANG’ was heard. Clear Sky Hammer was heavy and it carried Tang San’s spirit power, but it couldn’t compare with the level 95 Sea Dragon Douluo. The more than 2000 kg Clear Sky Hammer was actually blasted upwards like it was going to fly out of the water surface.</p><br/><p>But, Clear Sky Hammer’s weight wasn’t completely ineffective. Although it couldn’t harm Sea Dragon Douluo in this situation, its weight and the burst of force generated from mutual collision also sunk him, delaying him for at least a second.</p><br/><p>Right now, Tang San had already surfaced. With a wave of his left hand, the Clear Sky Hammer which Sea Dragon Douluo blasted away disappeared in mid-air and once again appeared in his left hand. He threw it again without stopping for a bit, and at the same time, he pushed on the surface of the seawater heavily and soared from the sea.</p><br/><p>Sea Dragon Douluo didn’t dodge this time. The scene of the Clear Sky Hammer going after him was too amazing. He faced it head on and thought he could strike it skyward again, but it suddenly disappeared. The seawater formed a sinkhole from the sudden powerful strike of his spirit power. Now Sea Dragon Douluo was under Tang San. The sinkhole turned into rising waves, which happened to push Tang San up into the air right when he was starting to fall.</p><br/><p>Sea Dragon Douluo was unhappy. He couldn’t imagine that Tang San would actually use such a battle spirit switching method to avoid his pursuit, no matter what. But now he was at the seawater’s surface. He could still make it. Likewise he pushed on the seawater and chased after Tang San’s figure.</p><br/><p>When Clear Sky Hammer disappeared in the water, Tang San already switched to his Blue Silver Emperor. A single grass was thrown and turned into a blue and golden streak of light that went for several tens of metres in distance, which wrapped around the Sea Dragon sacred pillar.</p><br/><p>When Tang San finished doing this, Sea Dragon Douluo was already chasing him from the water. Under the control of his spirit power, a wave pushed him towards Tang San as both dragon claws flickered with light. Tang San clearly felt that even if his Mysterious Jade Hands were to meet with the shining blue dragon claws, it wouldn’t do him any good.</p><br/><p>With the Blue Silver Emperor wrapped around the sacred pillar, Tang San yanked with great strength, causing his sinking self to be propelled horizontally towards the sacred pillar. But Sea Dragon Douluo’s speed was faster than him. With the sea under the control of Sea Dragon Douluo’s spirit power, another wave rose up to push him in his charge towards Tang San, which actually made him faster than the speed of Tang San using Blue Silver Emperor to pull himself. He could see those sharp dragon claws getting closer and closer. It seemed that Tang San couldn’t escape from Sea Dragon Douluo’s pursuit no matter what.</p><br/><p>If it were just Sea Dragon Douluo himself chasing after him, Tang San would still have chances. After all, he could face his opponent in the air head on and use his powers to return to the sacred pillar platform. But what came with Sea Dragon Douluo at the same time was a huge wave. Once brought into the sea again by this wave, Sea Dragon Douluo would definitely not give Tang San any chances. Sea Dragon Douluo understood this point, and so did Tang San.</p><br/><p>In such times, Tang San displayed his shocking judgement and fighting wisdom. He faced the pursuit without a hint of panic. His left hand flashed black, the Blue Silver Emperor connecting him and Sea Dragon sacred pillar had vanished, and turned into Clear Sky Hammer.</p><br/><p>Clear Sky Hammer’s weight was not felt by Tang San, but it still existed. With its appearance, Tang San himself dropped towards the surface of the sea, as senselessly as going to quench his thirst with poison.</p><br/><p>But Tang San didn’t actually use the hammer in his hand to face the opponent, but threw it once again towards Sea Dragon Douluo. Because he himself was brought down by the hammer towards the surface of the water, the sufficient momentum needed to bring him towards the sacred pillar platform was lost. But Tang San seemed as if he didn’t mind it and let himself fall in an arc while he adjusted himself to face Sea Dragon Douluo.</p><br/><p>Sea Dragon Douluo let out a cold smile, “Again?” he bared his dragon claws to block against Clear Sky Hammer.</p><br/><p>An amazing scene played out again. The Clear Sky Hammer which was about to collide against Sea Dragon Douluo’s claws suddenly dropped downwards and avoided them, then it was swinged upwards abruptly, slamming towards Sea Dragon Douluo’s chest. The change of the situation was one third faster than in the seawater.</p><br/><p>This surprised Sea Dragon Douluo greatly. He might be boasting a powerful battle spirit, but Clear Sky Hammer left an impression that was too deep and he didn’t dare letting his fearsome hammer fall on him. The dragon claws were moved downward in a hurry, but Clear Sky Hammer went down again, and this time it made a large arc upwards and struck down, changing the target to Sea Dragon Douluo’s head.</p><br/><p>Now, Tang San who was falling into the sea, was moving both his hands ceaselessly, like grabbing and letting go, seemingly like controlling Clear Sky Hammer with a single thread, making it perform amazing changes.</p><br/><p>Indeed, it was Controlling Crane Catching Dragon, one of Tang Sect’s Ultimate Teachings.</p><br/><p>In the seawater, Tang San used Controlling Crane Catching Dragon to alter Clear Sky Hammer’s directions in order to give himself time to come out of the water. The second strike he made before he got out of the water was actually using Sea Dragon Douluo’s train of thoughts. His Controlling Crane Catching Dragon was powerful, but he was already in the air while Clear Sky Hammer was in the seawater. He couldn’t control it while the mediums were different. Only Sea Dragon Douluo’s awareness to the first strike made him resort to this.</p><br/><p>And now, in the air, Tang San’s Controlling Crane Catching Dragon was like fish in the water. Clear Sky Hammer under his precise control with Mysterious Heaven Power’s support, turned into Clear Sky Flying Hammer. Constantly changing harassments, but not fighting the opponent head on, it was just for the sake of buying time.</p><br/><p>Tang San knew clearly that once Clear Sky Hammer and the opponent’s powerful dragon claws met, it would immediately be sent flying and Sea Dragon Douluo would surely catch up to him. But Clear Sky Hammer’s attack power was fearsome. If it were to land on Sea Dragon Douluo’s other locations, he wouldn’t be able to withstand it. Therefore, he had to avoid Sea Dragon Douluo’s dragon claws and constantly change the attack directions. With such, Sea Dragon Douluo’s speed of pursuit might look as fast as before but was actually slower due to Clear Sky Hammer’s restriction.</p><br/><p>Using this short work, Tang San controlled the hammer with his left hand while his right hand moved behind him and shot out a golden light for more than 20 metres long, latching onto Sea Dragon sacred pillar’s giant dragon sculpture scales accurately. Tang San let out his strength again, pulling his falling self towards the platform in renewed velocity.</p><br/><p>Indeed, it was Tang San’s Flying Divine Claw. When he fell into the seawater and put away Clear Sky Hammer to release Blue Silver Emperor, he took out his 24 Moonlit Bridges and placed it around his right arm. The yanking of the Blue Silver Emperor was to close his distance to the sacred pillar and get into Flying Divine Claw’s capture range. He needed Clear Sky Hammer to hold Sea Dragon Douluo back, so he couldn’t switch to Blue Silver Emperor. Flying Divine Claw, which Tang San never used for a lot as a Tang Sect Hidden Weapon, played a large role at this moment.</p><br/><p>Flying Divine Claw, after several improvements by Tang San, had its effective range increased to 30 metres. By controlling it through the mechanisms locked on his arm and shot using a machine, it was a cord type hidden weapon in Tang Sect’s mechanical hidden weapons. It could be used to attack as well as difficult terrain traversal, especially in climbing. In Tang San’s previous life, Tang Sect’s Flying Divine Claw was the best weapon used for scaling fortress walls.</p><br/><p>Now, Tang San was using Flying Divine Claw to turn the situation around. Although Flying Divine Claw’s grabbing strength couldn’t puncture the sacred pillar, latching onto the scales of the dragon sculpture posed no problems. How could it go wrong in Tang San’s eyes?</p><br/><p>Seeing Tang San getting closer and closer to the sacred pillar, Sea Dragon Douluo felt very impatient. He knew that once Tang San landed on the platform, Tang San would never give him any chances to force him into the water, and this battle would be over. The injuries that the collisions gave him were already paining him, and the chances became slimmer by the second. Tang San’s Clear Sky Hammer was being controlled by a seemingly marvellous technique, leaving him no other option than to break his focus. Trying to catch up to Tang San again in speed was harder than before.</p><br/><p>Just then, Sea Dragon Douluo displayed his strong side. When Clear Sky Hammer changed directions again and aimed towards the belly, he didn’t dodge it. He let the hammer slam against his belly while his dragon claws clapped backwards, hitting hard on the huge wave he brought up like his whole self was shot out like a cannon ball towards Tang San. This would be the decisive move.</p><br/><p>BANG-------, Sea Dragon Douluo was launched into the air for several metres by the impact of Clear Sky Hammer, but he also achieved his goal as the waters he pushed made him gain terrifying speeds in a short time. The hammer that fell behind him wasn’t chasing him anymore. Because he was constantly chasing, the distance from Tang San was just ten metres, while Tang San was still 10 metres away from the coastside. This was the deciding range, and Sea Dragon Douluo calculated accurately that even if Tang San were to retract his Clear Sky Hammer and throw it again, it would definitely not be faster than his own speed. He could surely pull Tang San back into seawater before the latter could reach the coastside.</p><br/><p>Tang San’s spiritual force was stronger than Sea Dragon Douluo’s. How could he not discern what the opponent could? If he couldn’t make it in time with Clear Sky Hammer, then don’t use it.</p><br/><p>No longer controlling Clear Sky Hammer, his left hand swiped across his waist and countless metal flickers like blooming flowers were appearing before Tang San. He even had the time to greet Sea Dragon Douluo, “Bone Piercing Needles, armor breaking and poisonous.”</p><br/><p>Under the power of level 84 spirit power, several tens of hidden weapons sealed Sea Dragon Douluo’s advance. Every hidden weapon had an ear-piercing howl. Tang San didn’t deceive Sea Dragon Douluo, for every single one of these hidden weapons of his was capable of breaking through constitutions, and there were even a couple of Cluster Soul Stealer Projectiles. Back then, Poison Douluo used this this to retreat from opponents much stronger than him.</p><br/><p>Tang San’s current spirit power and strength were even greater than Poison Douluo’s. When these hidden weapons were displayed like a peacock opening its tail, the outcome of this battle was decided.</p><br/><p>Feeling the maniac thrusting force, Sea Dragon Douluo’s irises’ glow finally dimmed. His fifth spirit ring swiftly formed a shield in front of him as a clattering of smashing sounds took place with the mystical changes of his scales.</p><br/><p>Sparks flew as focused collision sounds erupted between Tang San and Sea Dragon Douluo. Using the fifth spirit skill ‘Divine Dragon Mail’, Sea Dragon Douluo blocked Tang San’s hidden weapons completely, but just then, Tang San also managed to land on the Sea Dragon sacred pillar platform.</p><br/><p>With feet on solid ground, Tang San couldn’t hold back another mouthful of blood which he spat out. Panting heavily with a few steps back, he arrived next to Xiao Wu. His right hand shivering and Flying Divine Claw was retracted, returning to the arm’s mechanism quickly.</p><br/><p>Dragon scales returned to the body as Sea Dragon Douluo also landed on the platform with the push of the waves, both eyes having lost their focus. The dragon scales slowly faded from him, showing his usual hardy but currently paled face.</p><br/><p>Straightening his waist, Tang San’s chest was heaving but his eyes were still as they met with Sea Dragon Douluo’s own without retreat. The process of returning to the platform from the sea was but a few breaths’ time, but in such a short time, one could say Tang San did everything he could. Without using spirit skills, he exerted all of his latent strengths. It looked simple, but in fact it taxed him much greater than any of the previous battles, especially the heart. Otherwise, he wouldn’t have to use Cluster Soul Stealer Projectiles as consumables.</p><br/><p>“You won.” Sea Dragon Douluo’s expression calmed down gradually as he spoke to Tang San. In order to defend against Tang San’s hidden weapons, he used spirit skills, so the outcome of the fight was decided. If it he was still unwilling earlier, then looking at Tang San retract his Flying Divine Claw and the Clear Sky Hammer that appeared in his left hand again, Sea Dragon Douluo understood that he lost without unfairness.</p><br/><p>Tang San said, “Thanks to senior’s allowance. If spirit skills were used, the odds of victory would be unclear.”</p><br/><p>Sea Dragon Douluo shook his head, “Even if we used spirit skills, the battle between you and me would split for 60 to 40. Though you haven’t reached Title Douluo stage, your four hundred thousand year spirit rings and five spirit bones would pose a huge threat to me. Hundred thousand year spirit rings and spirit bones have two skills each. With many skills at your disposal, it wouldn’t be a simple matter of winning against you. What’s more important is your brain, which can calculate the control of powers and battle. No doubt this would let you use various skills at their best conditions, completely closing the gap between our spirit powers. A loss is a loss, nothing to be displeased about. Your numerous self-developed skills have opened my eyes. But can you tell me the method you used to control that battle spirit? What self-styled spirit skill was it?</p><br/><p>Tang San spoke, “It’s called Controlling Crane Catching Dragon. It’s a method of using spirit power. Trained to the extreme will let you control objects in a certain range like what I just did. It can be applied widely in practical battles. The last attack I made against you was hidden weapons, like a form of weapons. I still took a shortcut in this battle, because I wasn’t confident I could withstand your ninth spirit skill. The difference between our spirit powers is great. Using skills and other means to make up is not an easy thing.”</p><br/><p>Sea Dragon Douluo nodded and said nothing. He raised his head and looked at the golden light in the sky, patting his hand on the sacred pillar. In an instant, the dragon sculpture of the sacred pillar seemed to come alive, with golden dragon shaped energy spinning out with a dragon’s roar, crashing towards Tang San through his chest. At the same time, the dragon shaped energy let out a ray of golden light which landed on Xiao Wu’s forehead. </p><br/><p>The red light on Xiao Wu’s forehead glowed. It shot out a red veil of light and entered her body after shattering. The familiar and dull voice rang out again, </p><br/><p>It was soon followed by Tang San’s trident brand flashing eye-catching colors after being infused with the golden dragon shaped energy. He only felt that he was filled with power. The injuries he sustained from the battle against Sea Dragon Douluo were healed instantly and his spirit power also recovered to the best state. The dignified and deep voice sounded.</p><br/><p>“Fifth trial, challenge, Title Douluo, all tests were passed. Due to opportunism in the process of the challenge, not all seven sacred pillars Guardian Douluos approved. Hence, the rewards were lowered. Can only offer basic reward, affinity with Seagod increase by five percent. Time used in finishing the trial was 22 hours. Not even one third of the total time. Rewards multiplied by three. Seagod affinity increase by 15 percent, total affinity, 50 percent. Due to receiving high rewards because of opportunism, sixth trial has changed, difficulty increased.”</p><br/><p>In the air, the golden light which lost the support of the the lights of seven sacred pillars turned into a pillar of golden light and beamed down on Tang San. Warm and hot sensation surged from all directions like silk strands seeping into his body, like it was a subtle transformation.</p><br/><p>Tang San himself didn’t think that after taking shortcuts through the fifth trial, he could still get 15 percent Seagod affinity as a reward, which made him incredibly happy. He clearly sensed that the seagod trident brand became boiling hot on his forehead right now, and an incredible energy wave was spreading in his body. The fifth spirit ring evolveing earlier caused five of his spirit bones to heat up again so Tang San tried to use his spirit power to feel the changes to them but couldn’t sense anything special. It seemed as if the affinity with Seagod was subtly changing something.</p><br/><p>In Sea Dragon Douluo and Xiao Wu’s eyes, the seagod trident brand on Tang San’s forehead showed some small changes, from the original bright gold to dark gold, while the brand itself had an additional intricate branding. Because the brand was small to begin with, if not inspected clearly, the brandings would be hard to notice. It became smoother than before. The seagod trident brand right now seemed to protrude from Tang San’s forehead a little more.</p><br/><p>The golden light faded and everything returned to normal. The fully replenished Tang San felt like he could challenge the seven sacred pillar Douluos all over again without a problem. He unconsciously balled up his fists, feeling his spirit power move inside him and rise in secret.</p><br/><p>In just 22 hours of work, after experiencing seven battles, they weren’t battles which had all of his efforts put in, but the pressure from facing the seven Title Douluos still made him experience growth. He was one step closer towards level 85 spirit power.</p><br/><p>Sea Dragon Douluo saluted to Tang San slightly, “Congratulations, my lord, in passing the fifth trial and having more than 50 percent affinity with Seagod.”</p><br/><p>Tang San was surprised, “Senior, you know of the percentage of my affinity with Seagod?”</p><br/><p>Sea Dragon Douluo replied, “Because of the changes to your brand. It could only be like this when it’s more than 50 percent. I can’t say much about it, but I can tell my lord, that if you wish to truly sense its wonders, then work hard at the last four trials and raise it to 100 percent. Only then, you can truly understand its meaning.”</p><br/><p>“Thank you for your reminder.”</p><br/><p>Just then, everyone at the coastline leapt up simultaneously, and after using the seawater for a few jumps, they landed the platform. Their faces were all lifeless, like they had encountered something terrible.</p><br/><p>“What’s wrong with you?” Tang San asked in confusion.</p><br/><p>Dai Mubai spoke bitterly, “Little San, you just hurry and look at the contents of the sixth trial. Before you cleared your trial, our sixth trial’s contents didn’t show up as well. But just now we all got our notifications at the same time. The difficulty got bumped up.”</p><br/><p>“No need. Let me tell you myself.” A gentle and noble voice came from behind. Tang San turned around and only saw the red clad Seagod Douluo Bo Saixi who arrived behind him since who knew when. Sea Dragon Douluo retreated to the side with formality.</p><br/><p>“Good day, senior.” Tang San greeted formally in a hurry.</p><br/><p>Bo Saixi’s face let out a trace of faint smile, “I also didn’t think that you could actually get to this point so fast. But what’s come should come. You surely got the notice, that the sixth trial’s contents had its difficulty increased because of your shortcuts in the fifth trial.”</p><br/><p>Tang San’s chest tightened, “Senior, the only one who took it easy in the fifth trial was me. It has nothing to do with my partners. Increasing the difficulty should only be just about me alone.”</p><br/><p>Bo Saixi shook her head, “Lord Seagod was absolutely fair. During Oscar’s exam, can you say he took the test in fair terms? Even Dai Mubai and two others, if not for your spirit power search and secret reminders and strategies, how could they pass so easily? And, besides Oscar, the three others got their respective rewards.”</p><br/><p>Tang San was speechless for a moment. Looking at it this way, it was true that everyone took shortcuts in the fifth trial. He already understood that the reason why the previous trials didn’t show indications that they were using workarounds in the trials was because those trials themselves were like group tests. Everyone helping each other and using skills were displays of wisdom, and also part of the tests. But the fifth trial’s tests were individual strength. Working around in them and mixing with the strengths of others would let them be judged as being opportunistic.</p><br/><p>“Then senior, what are our sixth trial’s contents?” Tang San didn’t check as Bo Saixi was in front of him, and he already said that he would inquire directly out of respect for this Pinnacle Douluo.</p><br/><p>Bo Saixi let out a small sigh, “Originally, your sixth trial is to withstand the combined attacks of Seagod seven sacred pillar’s Douluos for a joss stick’s time. But now, because the difficulty was increased, it’s changed.”</p><br/><p>After hearing what Bo Saixi said, Tang San’s expression changed greatly. Lasting for a joss stick’s time under the attacks of seven sacred pillar Guardian Douluos was already insane enough for a trial. One should know that Tang San might be able to face a single of them, but when all seven of them teamed up and support each other, it would be like when Shrek Seven were together. Their strength would be multiplied by several times. Forget about a single joss stick’s time. Whether they could stand up to a single wave of attacks was hard to guess. More importantly, of the Shrek Seven, Zhu Zhuqing only passed Black Class’ Five Trials and completed all of her tests so she couldn’t participate in the sixth trial.</p><br/><p>Lacking one member, Shrek Seven’s strength would decrease greatly as they couldn’t even use the current most powerful spirit fusion technique ‘Phantom Nether White Tiger’. Under this condition, six people holding up for a single joss stick would be harder than before. Sea Dragon Douluo’s Demon Buster Domain was not a slouch. Without Tang San’s two domains as guarantee, a single joss stick would be like a nightmare for them.</p><br/><p>But hearing what Bo Saixi meant, the difficulty rise after the sixth trial wouldn’t stop there. What would it be when it would be harder than facing Seagod’s seven sacred pillars’ Guardian Douluos? Would there really be any chance of passing the sixth trial?</p><br/><p>“Then senior, our sixth trial’s contents….?” Tang San was visibly strained when asking the question. He finally understood why his companions’ faces were unpleasant.</p><br/><p>Bo Saixi smiled slightly and said, “Your sixth trial is still about withstanding up to a single joss stick’s time. But, the one attacking you isn’t Sea Dragon and the others. It’s me.”</p><br/>\n</div>"}