{"title": "Chapter 242", "id": 242, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-242", "volume_title": "Volume 3", "body": "<h1>Chapter 242</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 242</p><br/><p>Control! Evil Eye White Tiger VS Sea’s Lance</p><br/><p>(TL by Bagelson)</p><br/><p>This battle was destined to be a contest of force from the start.</p><br/><p>As Sealance Douluo saw Dai Mubai and Ning Rongrong’s age, he originally felt a bit contemptuous, even when Dai Mubai released the White Tiger Avatar, revealing his seventh ring, his thoughts didn’t change. After all, the gap between a Title Douluo and a Spirit Sage was really too wide.</p><br/><p>But as they truly collided, he learned that these two youngsters weren’t as easy to deal with as he imagined.</p><br/><p>Dai Mubai’s attack went smoothly, and he also equally sensed Sealance Douluo’s contempt for him, but he grew happy rather than angry. Just as he landed, his foreclaws violently struck the Sea’s Lance Sacred Pillar platform once, propelling his enormous body once again into the air, tackling towards Sealance Douluo like a bolt of lightning.</p><br/><p>This time his tiger claws were gathered at his chest, his whole body radiating golden light, and along with his charge, several dozen meters above him, countless white meteors fell from the sky, focused on Sealance Douluo. It was White Tiger Meteor Shower.</p><br/><p>His goal was very simple, not giving Sealance Douluo time to catch his breath, he would exploit the bit of initiative he had at the start to forcefully suppress the opponent until he won. This was undoubtedly his best choice at present.</p><br/><p>Dai Mubai’s White Tiger Avatar’s strongest capability was undoubtedly the melee, but his small number of attack abilities also possessed considerable might. Especially with Ning Rongrong’s support, his power could be displayed to its greatest degree.</p><br/><p>At the same time as the White Tiger Meteor Shower emerged, another line of boost light reached him, Ning Rongrong’s third spirit ability, spirit power boost. Although this was just the third spirit ability, each of Ning Rongrong’s spirit abilities boosted eighty percent. As the world’s number one support spirit, the Nine Treasure Glazed Tile Pagoda was an extremely abnormal existence in itself.</p><br/><p>“Good——”</p><br/><p>Sealance Douluo shouted, his back was against the Sea’s Lance Sacred Pillar, unable to retreat. Seeing Dai Mubai transformed into the white tiger attacking him from all directions with the meteor shower in midair, he gripped the lance in both hands, suddenly sticking it into the ground in front of him. Immediately after, his seventh spirit ring flared with light. In just a split second, his whole body actually transformed into a golden liquid that merged into that spear.</p><br/><p>These were circumstances Dai Mubai had never seen, even Tang San hadn’t seen it. The spirit master’s body blending into the tool spirit, this was a true union between man and spear.</p><br/><p>Due to the advantage from the first attack, just before Sealance Douluo’s body merged into the lance, Dai Mubai had already lunged. Tiger claws striking from his chest, an ear piercing sonorous sound erupted, continuously striking countless spark from that Sea’s Lance. The White Tiger Meteor shower in midair also unerringly struck the lance.</p><br/><p>However, bizarrely, no matter how violently Dai Mubai attacked, all his attacks seemed to fall on indestructible metal. Apart from those flying sparks, it basically didn’t seem like any of the attacks hit Sealance Douluo. The White Tiger Meteor Shower also only seemed to splash out white light on the lance, without any sense of a proper result appearing.</p><br/><p>What was going on here?</p><br/><p>“Mubai, careful.”</p><br/><p>From the side came a loud shout. By the voice, it was Tang San. When Sealance Douluo transformed into that bizarre spirit avatar, Tang San had opened his eyes. Even though he was cultivating, his spiritual force had scanned the entire sea within the sea, and he’d naturally sensed the special circumstances of Dai Mubai’s battle with Sealance Douluo. Assisting in the battle was impossible, but speaking warnings didn’t break the rules. Discovering something amiss, Tang San immediately gave voice.</p><br/><p>Dai Mubai and the others had an almost blind trust in Tang San. The giant white tiger’s body swiftly retreated almost without hesitation. Practically the instant he withdrew, that golden lance stuck in the platform abruptly shot up, countless golden lights exploding out like fine rain, like a sunburst, distributing countless golden lights.</p><br/><p>Each golden trace caused a series of explosions in the air, almost instantly filling the entire Sea’s Lance Sacred Pillar platform with golden light. Vaguely, one could see a black ring of light spreading out.</p><br/><p>Dai Mubai’s huge body swiftly retreated in front of Ning Rongrong. He couldn’t retreat any further, because Ning Rongrong was behind him. If they entered the water, they would only be in even more danger. Fighting on this platform they still had some odds of success.</p><br/><p>The giant tiger gaped wide, a surging white light jetting out, not dispersing, but rather condensing into a white shield of light in front of Dai Mubai, blocking the full power erupting from that golden lance. Having used the spirit abilities for so many years, how could they not change a bit? This shield of light was a clever use of the White Tiger Light Wave while in White Tiger Avatar state.</p><br/><p>The golden light stabbed at the white light shield, instantly causing countless ripples, like rain falling on a calm lake. By constantly spitting out the White Tiger Light Wave, and with Ning Rongrong’s further all out boost behind him, this just helped him block that explosion of golden light.</p><br/><p>On the shore, Tang San’s expression had become serious. Through his spiritual force probe as well as his own judgement, he could see that the attack just now was Sealance Douluo’s eighth spirit ability. His seventh spirit ability made his body blend into the lance like water, and the eighth spirit ability seemed to be able to use the lance to temporarily block the enemy’s attack, and possibly even reflect the energy of the opponent’s attack. If Dai Mubai hadn’t retreated fast enough and been hit head on by that exploding lance, the outcome might have already been settled. In order to regain the initiative, Sealance Douluo had revealed his power in their second exchange.</p><br/><p>Such a powerful tool spirit avatar. As Grandmaster’s disciple, Tang San had never heard from Grandmaster that tool spirit masters could use their spirit avatar to merge into their tool spirit. In the spirit master world, tool Spirit Sages and higher level tool spirit masters were basically a lot fewer than beast Spirit Sages and higher beast spirit masters. Could this special case be specific to sea spirit masters?</p><br/><p>Tang San didn’t dare be certain, but he could be sure that after the union of body and tool, this Sealance Douluo’s strength was absolutely even more formidable than ordinary tool spirit avatars. Without the body, Dai Mubai had lost his point of attack, and could only treat the opponent’s golden lance as his target. But judging by the circumstances just now, the golden lance not only had frightful defensive strength, but moreover endless might in this kind of tool spirit avatar form.</p><br/><p>The sputtering ripples very soon disappeared. By dodging the golden lance’s frontal attack, as well as with Ning Rongrong’s support, Dai Mubai had relied on White Tiger Light Wave to block that slender as fine rain golden light.</p><br/><p>The golden lance had now shot into the air, sweeping past the Sea’s Lance Sacred Pillar Platform, falling towards the sea within the sea as if out of control.</p><br/><p>Hesitating over the unclear circumstances, Dai Mubai didn’t pursue immediately. Ning Rongrong threw out a big recovery sausage into his white tiger maw, then also ate one herself. The two simultaneously adjusted their spirit power condition.</p><br/><p>Just at this moment, the golden lance hit the surface of the sea. To be precise, it should be called lashed the surface of the sea. Amidst an explosive crack, a crystalline screen of water was thrown up by the golden lance. The lance whipped sideways, and countless droplets turned into specks of light, cutting through the air straight at Dai Mubai and Ning Rongrong with ear piercing sounds. At the same time, the golden lance spun once in midair, pointing downward, then thrust towards the sea within the sea.</p><br/><p>“Block it, don’t let it into the water.”</p><br/><p>Tang San’s voice echoed once again. This time it was no longer a hasty shout. Through observation, the had already discovered some clues. Forcing his voice into a line, the sound entered Dai Mubai’s ear.</p><br/><p>Hearing Tang San’s warning, Dai Mubai immediately understood. That attack from Sealance Douluo merged with the spear before had to have exhausted him a great deal, but as a Sea Douluo, he could undoubtedly display his greatest strength within the ocean. Whipping out these droplets was more in order to stall them. He didn’t have enough time to consider why Sealance Douluo didn’t directly enter the water, and instead first launched an attack to stop them, missing the opportunity. His enormous body was already lunging.</p><br/><p>This moment clearly revealed Dai Mubai’s power. He didn’t dodge the droplet attack, using his forepaws to shield his eyes, his huge body forcefully pounced, straight for that golden lance.</p><br/><p>The facts once again proved Tang San’s conjecture, as the lance tip was about to enter the water, the lance suddenly paused. The lance tip trembled, turning into countless lance shadows, stirring up the water below, instantly rendering it golden. It was like a whale inhaling, pulling up the seawater to merge into the lance. And that golden lance quickly expanded in the process.</p><br/><p>“This is an internally accumulating domain, he’s swallowing the seawater and absorbing its energy to strengthen himself. Attack quickly, don’t give him the chance.”</p><br/><p>Tang San’s warning echoed once again, but Dai Mubai had already crashed into the water screen. Originally, he only needed to revert to his original form, and thus the attack he needed to endure would reduce a lot. But like that, the fine droplets would very possibly sweep past him to attack Ning Rongrong. Therefore, Dai Mubai would rather endure more, and would also just endure the full attack.</p><br/><p>In this moment, Dai Mubai revealed his characteristics as an attack type spirit master. Under the buffs of White Tiger Barrier, White Tiger Vajra Transformation, White Tiger Devilgod Form, and White Tiger Avatar, his defensive power had already reached a frightening degree. Further adding Ning Rongrong’s eighty percent defense buff, Dai Mubai’s huge body was as solid as a fortress.</p><br/><p>The Nine Treasure Glazed Tile Pagoda’s boosts were proportional. The stronger the subject, the more enormous the overall energy would be. Dai Mubai’s defensive strength was naturally scary.</p><br/><p>The striking water droplets immediately caused a burst of pain, but Dai Mubai clearly felt that it just struck his fur. He of course wouldn’t take such a hit without retaliating. One White Tiger Light Wave spat out, transforming into a white pillar of light that struck the side of the golden lance.</p><br/><p>Sealance Douluo hadn’t expected Dai Mubai to actually be this valiant, charging up to meet his attack head on instead of following common sense to stay on the ground and defend with abilities. In the White Tiger Light Wave explosion, the lance’s absorption was immediately interrupted, the somewhat larger lance flying off in the air, tumbling towards the distance.</p><br/><p>Dai Mubai snorted coldly, his whole body releasing golden light, shedding a layer of fur. That was the injuries he’d received from the water droplets before, but it was just fur.</p><br/><p>“Retreat, defend and counterattack from the sacred pillar platform. As long as the lance doesn’t absorb water, don’t be in a hurry to attack.”</p><br/><p>Tang San said calmly.</p><br/><p>The golden lance was now flying parallel to the surface of the sea, the tip pointing towards Dai Mubai. Just as he was expecting Dai Mubai to pursue and attack and preparing to pull him to the surface of the sea, then attacking with his full strength, he was shocked to discover that Dai Mubai didn’t pounce. Even though that giant body reached the water, forepaws struck the surface, and that giant body unexpectedly flipped back, landing firmly on the Sea’s Lance Sacred Pillar platform. And at the same time, the the illusory bright mist spread out, completely enveloping the sacred pillar. Dai Mubai and Ning Rongrong immediately disappeared from Sealance Douluo’s line of sight.</p><br/><p>Even with Sealance Douluo’s formidable strength, he couldn’t help feeling gloomy over the present circumstances. It was as if this challenger saw through everything he thought, and basically wasn’t taken in. Not only did they stop his powerful charging ability, but moreover guarded extremely tightly, without exposing the slightest gap. Making him even more helpless was that he couldn’t use the strength of the Sea’s Lance Sacred Pillar in the challenge. The sacred pillar platform was actually turned into the opponent's nest. Really depressing.</p><br/><p>How could he know that, even if it was impossible for Dai Mubai to understand him, the cool-eyed bystander Tang San was equivalent to Dai Mubai’s brain. His analysis and battlefield control abilities were originally powerful, and now as a detached bystander, not just analysing the situation, with his spiritual force even higher than Sealance Douluo, how could Dai Mubai make a mistake? What Sealance Douluo now faces could be said to be Tang San’s brain plus Dai Mubai and Ning Rongrong’s united strength.</p><br/><p>The golden lance flew into the distance, and once again absorbed water. From the Sea’s Lance Sacred Pillar platform a ray of white light instantly shot out.</p><br/><p>With Dai Mubai’s spirit power, plus the Spirit Avatar state as well as Ning Rongrong’s boost, even a hundred meters counted for nothing. He just needed to compress the White Tiger Light Wave to strike as small an area as possible, and the attack range would naturally rise as a result. Even though its power wasn’t enough to harm Sealance Douluo, influencing his water absorbing ability wasn’t a problem.</p><br/><p>Dense mist drifted around the sacred pillar platform. It seemed as if the scales of victory had already started to tilt in Dai Mubai and Ning Rongrong’s direction. The two did after all have their feet firmly planted on the platform, and even if Tang San didn’t know what the spirit power consumption of Sealance Douluo’s spirit avatar form was, since it was a spirit avatar form, it wouldn’t be small, at least no lower than that of Dai Mubai and Ning Rongrong. The higher the level of the spirit master, the greater the power of the spirit avatar. The spirit consumption would also rise accordingly. Under such circumstances, Sealance Douluo’s spirit power recovery rate would be at a disadvantage while he floated above the sea within the sea. Dai Mubai and Ning Rongrong would have a lot better recover with their feet firmly on the ground.</p><br/><p>Furthermore, while shrouded by Ning Rongrong’s Fantasy Space, even if the two of them now removed their spirit avatar states, Sealance Douluo wouldn’t be able to discover it. The Fantasy Space could not only confuse the enemy when they were enveloped, but at the same time also had the effect of isolating the outside world. This was an ability the majority of domains possessed. Specializing in hallucinatory effects, the Fantasy Space was even more powerful in this respect.</p><br/><p>Sealance Douluo had clearly also discovered this point. The golden lance no longer hung in the air, light flashing, it directly thrust into the sea within the sea.</p><br/><p>Tang San’s heart shivered. His spiritual force intensity increased once again, closely targeting that golden lance’s movements within the sea. Sealance Douluo definitely wouldn't do something for no reason. Falling into the sea, he either wanted to use the ocean as a screen to restore his original form and recover spirit power, or he was using some attack that combined with the sea. Even though he certainly couldn’t use that seawater absorption like on the surface, Sealance Douluo’s strength would undoubtedly rise considerably if he joined with the sea.</p><br/><p>“Careful, remove the avatar, dive into the water along the right edge of the sacred pillar platform.”</p><br/><p>Tang San’s urgent voice suddenly echoed in Dai Mubai and Ning Rongrong’s ears. Even if the Fantasy Space could isolate spiritual force, it wasn’t effective enough to stop Tang San. Partly because he was exceedingly familiar with Ning Rongrong’s strenght, and partly because his spiritual force had reached a truly frightening level, at a level no lower than that of Seagod Douluo Bo Saixi, and was further the holder of twin domains. Ning Rongrong’s Fantasy Space was also a spirit bone induced domain rather than an innate domain, and it was naturally difficult to stop him.</p><br/><p>At the same time as Tang San’s voice reached them, suddenly, on the left side of the sea within the sea, a wide are a of the sea turned golden. Immediately after, the golden spear brought a five meter in diameter giant pillar of water to shoot towards the sky. The water pillar was completely rendered golden, and the golden lance spurring it on even more shone like the sun. On it appeared a black spirit ring, and through his spiritual force, Tang San clearly discovered that this spirit ring was Sealance Douluo’s ninth spirit ring.</p><br/><p>On seeing this, Tang San was even more certain of his judgement, and urgently sent a “hurry” to Dai Mubai and Ning Rongrong.</p><br/><p>Hong—— The golden pillar of water exploded in the air, falling over a wide area as golden rain. That golden rain seemed to drift, not particularly fast, as if it had no offensive strength. However, it still covered every corner of the Sea’s Lance Sacred Pillar platform.</p><br/><p>The Fantasy space was an illusion type domain, and was naturally unable to stop this rain of light from falling. At the same time as the golden rain fell on the platform, the golden lance rapidly expanded, countless magic lines appearing on the glossy lance, unexpectedly identical to the pattern on the Sea’s Lance Sacred Pillar. An enormous energy wave made the sea below the lance split open where it pointed. The terrifying energy wave even caused several dozen distorted black flashes of lightning appear around the lance.</p><br/><p>Without a doubt, the golden lance’s attack was definitely earth shattering. This was the most terrifying ninth spirit ability, and the reason was very simple. Because this ninth spirit ability was a single target attack. When the enormous energy wave condensed into one point and erupted, among the Shrek Seven Devils, even the most formidable Hell White Tiger would inevitably be injured if it took it on, let alone the present Dai Mubai and Ning Rongrong.</p><br/><p>However, having instantly condensed all its energy like this, the golden lance still didn’t thrust out, just hanging there in midair as if waiting for something. But, the signal it waited for never arrived.</p><br/><p>Originally, when Sealance Douluo had just started to attack, Tang San had seen through his goal. The stream of water Sealance Douluo caused really didn’t have any attack power, the reason why the pillar of water turned gold was because the water was infused the Sealance Douluo’s spiritual force. After turning into rain, each drop held his spiritual force. He really couldn’t prove the Fantasy Space, so he thought of using this kind of method. As long as this golden rain fell on Dai Mubai and Ning Rongrong, Sealance Douluo would immediately discover their position through his spiritual force. His ninth spirit ability attack speed was fast enough to match teleportation, dodging it was simply impossible. Otherwise this wouldn’t have been a single target attack ninth spirit ability.</p><br/><p>However, Sealance Douluo had that rain filled with spiritual force fall on the sacred pillar platform, but he still didn’t get the result he wanted. The information his spiritual force gave him was that the Sea’s Lance Sacred Pillar platform was completely empty, without finding the slightest trace of Dai Mubai and Ning Rongrong.</p><br/><p>Tang San relied on his Boundless spiritual force probe and Purple Demon Eye’s sharp observation as well as formidable judgement to completely grasp Sealance Douluo’s thinking. Right now Dai Mubai and Ning Rongrong were in the water on the other side of the sacred pillar platform. As that fine rain fell into the sea, the drops would immediately assimilate with the seawater, and even stronger Title Douluo couldn’t sense anything under such circumstances. There really wasn’t anyone on the sacred pillar platform, so where could Sealance Douluo aim his attack?</p><br/><p>The feeling of having power but nowhere to release it made Sealance Douluo feel like spitting blood. In fact, the spirit power required to condense the ninth spirit ability was an astronomical figure. If he didn’t release it, more than half the stored up energy would be consumed. He had spent a lot of spirit power before, and moreover incarnated as the golden lance. When he fully used that spirit avatar before, on the surface it might seem like Dai Mubai’s torrential attacks didn’t cause any damage, but in fact, how could he not have been affected by Dai Mubai’s violent attacks in that state? Even though he had relied on his condition at that time to reverse the situation and take the initiative, he couldn’t damage Dai Mubai like imagined.</p><br/><p>Being injured, consumption always greater than the opponent, if it went on, he would only be at a disadvantage. This was also why Sealance Douluo was anxious for a decisive battle with Dai Mubai. If he didn’t quickly defeat the opponent, he wouldn’t be able to hold up under the exhaustion.</p><br/><p>Tang San’s judgement was correct. Sealance Douluo’s strength really was in the top three of the seven Seagod sacred pillar protectors. But Tang San had missed one point. Among all the seven sacred pillar Douluo, Sealance Douluo’s Sea’s Lance Spirit was the one closest to land spirit master tool spirits. It didn’t completely rely on the strength of the sea. In this respect, he actually wasn’t better off than the weaker Seahorse Douluo.</p><br/><p>Sealance Douluo’s abilities were widely known for their attack power, an offensive pushing forward, powerful breakthrough strength was his signature. If he was to display his might, let alone Dai Mubai and Ning Rongrong, even if Oscar was added they wouldn’t be his opponents. If someone on Seagod Island was to be able to block his formidable attack spirit abilities head on, maybe only Seagod Douluo Bo Saixi could do it.</p><br/><p>However, he had underestimated the enemy somewhat. Seeing Dai Mubai’s only seven rings, just at the start he still hadn’t minded, but very soon had to rely on his spirit avatar to suppress Dai Mubai’s torrential offensive. Once he had released his spirit avatar and wanted to trade damage with the opponent, he again didn’t get his way. The flaws behind his high attack power were gradually exposed. That was helplessness against illusion type domains, as well as the high consumption of high attack power.</p><br/><p>Under Tang San’s guidance, right now Sealance Douluo’s spirit power exhaustion had already reached a quite frightening level. The condensed but unable to be released ninth spirit ability faded, the ocean sighed, no matter what it couldn’t show off. A single target attack required locking on the target, if it couldn’t, he had no way of displaying its might.</p><br/><p>The Fantasy Space still covered the sacred pillar platform without scattering. Even though the platform wasn’t very large, neither did it count as small. Sealance Douluo understood that if he had nowhere to launch his attack, he would only exhaust himself faster. He also didn’t consider that the two opponents could have entered the sea. The lance circled around the sacred pillar platform.</p><br/><p>But Ning Rongrong had expanded the Fantasy Space to the surface of the sea, and when the golden lance searched the sea, the two quickly vaulted onto the platform. When the golden lance relied on its spiritual force combined with seawater to probe with rain, they entered the sea. Relying on Tang San’s advance directions, the two dodged Sealance Douluo’s threat to them with more fright than harm. And Sealance Douluo’s spirit power was also constantly consumed like this.</p><br/><p>Finally, Sealance Douluo helplessly removed his ninth spirit ability, he could only let the spirit power be exhausted.</p><br/><p>“Come out, fight with strength if you dare.”</p><br/><p>Sealance Douluo’s angry voice covered the sea within the sea.</p><br/><p>Dai Mubai was always extremely valiant, but just as he was about to respond, Tang San’s simple but forceful voice reached him,</p><br/><p>“Mind games. Pay no attention.”</p><br/><p>Light flashed as the golden lance thrust towards the Sea’s Lance Sacred Pillar platform. In order to have a direct battle, helplessly, Sealance Douluo could only enter the Fantasy Space. Even though fighting in the other side’s domain was extremely disadvantageous, if he didn’t, then this grand Title Douluo, one of the seven sacred pillar protectors, would be defeated by spirit power exhaustion. His plentiful battle experience let him make the most correct decision. Right now he was completely suppressed by Dai Mubai and Ning Rongrong with Tang San’s spiritual force support, he had to enter a direct contact battle as fast as possible.</p><br/><p>The instant the lance thrust into the Fantasy Space, even from outside, countless golden lights could instantly be seen issued from inside. This was also something Sealance Douluo couldn’t help, entering a space he couldn’t clearly probe, if he didn’t do this, it was possible he would immediately be injured. It was necessary to issue this attack in order to protect himself, and at the same time also estimate Dai Mubai and Ning Rongrong’s position.</p><br/><p>Sealance Douluo possessed plenty of battle experience. Through all kinds of previous circumstances, he had already discovered the situation wasn’t reassuring. He had been completely led by the nose through the entire battle, unable to show his dominance, and also had his weaknesses completely exploited by the opponents. Most hateful was that each time he issued an attack it was as if they had predicted it in advance, choosing the most correct way to respond, sufficiently exploiting their advantages. He faintly felt that this level of response wasn’t something that could be explained with experience, there was definitely some reason. Only, he could never have expected that his present circumstances was actually because the enemy’s comrades had a person whose spiritual force had already reached a level far above his own.</p><br/><p>All the golden light swept out of the mist, still without giving Sealance Douluo any response. All the painful feelings from the start of the battle until now suddenly erupted, a difficult to inhibit anger spreading through his mind. The lance pulled up, swiftly arriving at the side of the Sea’s Lance Sacred Pillar. With a flash of golden light, an illusory figure left the lance. But just at this moment, Sealance Douluo’s heart had an unprecedented fearful feeling. Enormous pressure, that made it difficult for even a power on his level to continue.</p><br/><p>A giant silhouette showed its true form in the fog, frightful golden light brimming with a tyrannical aura erupted before his eyes, six golden lights converged in the air to form a giant “kill” character[1], but strangely, at the same time as this attack appeared, it didn’t actually target Sealance Douluo’s body. In other words, Sealance Douluo could completely deal with it by dodging. However, would he dodge? The answer was of course negative.</p><br/><p>Behind Sealance Douluo was the Sea’s Lance Sacred Pillar. As the sacred pillar’s protector, maybe even instinctually, for fear of the sacred pillar being harmed and the Seagod’s dignity being impinged, he absolutely couldn’t dodge. The only way was to block. And the opponent didn’t target him, using all the targeting energy for attack power. The all stakes energy attack instantly erupted.</p><br/><p>Originally, this was Sealance Douluo’s plan to lure out the enemy. You can predict what I will do? Fine, then I’ll let you predict it. When the golden lance returned to the Sea’s Lance Sacred Pillar, his body would leave the lance, as if he no longer had the spirit power to keep supporting the spirit avatar. This separation was also completely real. He knew that if he didn’t truly separate, he wouldn’t be able to deceive the opponent. However, even if the opponent had even more powerful battle prediction, they still couldn’t predict his special ability. That was an ability from Sealance Douluo’s single spirit bone. It was also because of this spirit bone that he had the ability to incarnate as the spear in spirit avatar. It was something he got back when he obtained his seventh spirit ring. The spirit bone gave mixing, and restoration. In other words, no matter the circumstances, he could overdraw his spirit bone energy to swiftly return to his special spirit avatar form.</p><br/><p>With a sway of the spear, leaving the spirit avatar, when the opponent’s attack descended, restore it again. If the opponent didn’t attack, then he might as well rest on the sacred pillar platform. After all, his spirit power far surpassed the opponents, as long as he had time to breathe, he wouldn’t lose out. It might even be two birds with one stone.</p><br/><p>However, Sealance Douluo hadn’t expected that, while the opponent really did launch an attack, the attack was different from what he had imagined on one point. To be precise, it was far, far more powerful than he had imagined.</p><br/><p>A trace of doubt swiftly spread through Sealance Douluo’s mind. That spirit master with the White Tiger Spirit only had seven spirit rings, so right now his highest attack ability should be his sixth spirit ability, because his seventh spirit ability was his spirit avatar. But, why did this one attack not seem any weaker than when he himself launched his eighth spirit ability with full strength? Moreover, that kind of unremitting forward momentum, all its energy completely erupting, also didn’t target him, but somewhere he absolutely didn’t dare dodge. Wasn’t all this too weird?</p><br/><p>Only, he didn’t have time to think about why. Confronting that frightening attack he could still only block. The restoration ability instantly launched, and the just separated body was forcefully pulled back in by this spirit bone ability, as the lance briefly transformed into countless images to meet Dai Mubai’s attack.</p><br/><p>Sealance Douluo believed that even if the opponent’s attack was powerful, it would at most injure him, but it absolutely couldn’t defeat him. This was a special spirit avatar that possessed incomparably impact resistance. And since the opponent staked it all on one throw like this, they would definitely expose an enormous gap. That moment was when he would counterattack. As for the other support type spirit master, they basically had no attack power. As long as this power attack type spirit master was dealt with, the other could be dealt with casually, the domain couldn’t stop him.</p><br/><p>[1] Kill - ()</p><br/>\n</div>"}