{"title": "Chapter 256", "id": 256, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-256", "volume_title": "Volume 3", "body": "<h1>Chapter 256</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 256</p><br/><p>Spirit Empire</p><br/><p>(TL by Bagelson &amp; Armored Raven)</p><br/><p>Red light flashed, and Xiao Wu’s soul merged into her body, her beautiful eyes regaining their clarity. It was Tang San who woke her.</p><br/><p>“Ge, where’s this?”</p><br/><p>Xiao Wu couldn’t help looking around.</p><br/><p>Tang San lowered his voice:</p><br/><p>“We’ve already returned to the continent, and I decided to bring you to Star Dou Great Forest a while, give the Clear Sky Hammer spirit rings. This is Häagen-Dazs Kingdom’s West Lu City. When I was outside of the city just now I felt something was wrong, the soldiers by the gate all wore the letters “spirit”, I don’t know what it means. Let’s go look around.”</p><br/><p>Entering the city, he couldn’t always be hugging Xiao Wu, or people would easily get suspicious. After Xiao Wu’s soul returned to her body, he only needed to hold her hand.</p><br/><p>Xiao Wu raised the veil of the bamboo hat, looking deeply at Tang San. Even though he didn’t say it, how could she not understand the reason he would bring her to Star Dou Great Forest alone? She understood that it was impossible for her to change Tang San’s mind. Holding his left hand, she said:</p><br/><p>“We’ll go investigate. With the “spirit” characters, it should likely be related to Spirit Hall.”</p><br/><p>Tang San nodded:</p><br/><p>“We’re of the same mind. The kingdoms and duchies that are part of the two great empires have always had an ambiguous relationship with Spirit Hall, as Spirit Hall’s loyal supporters. It’s also just because of Spirit Hall that the two empires have never dared do anything against the kingdoms and duchies without thinking about it first. It seems like, in the four years we were gone, a lot has happened on the continent!”</p><br/><p>As the two spoke, they had left the corner and reached the streets. The city streets seemed about the same as always, densely lined with shops on both sides. Overall, this West Lu City seemed prosperous. The pedestrians walked quite fast, clearly influenced by the pace of life.</p><br/><p>Xiao Wu lowered her voice:</p><br/><p>“Ge, where do we go to ask around?”</p><br/><p>Cold light flashed in Tang San’s eyes,</p><br/><p>“Naturally we’ll go to the Main Spirit Hall here. West Lu City is Häagen-Dazs Kingdom’s capital, it should have a Main Spirit Hall. Who would know what’s happened more clearly than those Spirit Hall spirit masters?”</p><br/><p>Tang San decided to go to Spirit Hall to investigate the changes on the Continent, and Xiao Wu naturally wouldn’t object. Tang San’s gaze swept, just finding a man in his forties walking past in front of them. The man’s clothes were average, unable to tell if he was rich or poor. Tang San took the initiative to go up to meet him, barring his way.</p><br/><p>“Big brother, could I trouble you with some questions?”</p><br/><p>Tang San raised the veil of his bamboo hat, and asked politely.</p><br/><p>The middle aged man was startled by being blocked, and looked somewhat alertly at him, especially as he saw that more than three meter long package in Tang San’s hand,</p><br/><p>“What do you want to ask?”</p><br/><p>Tang San said:</p><br/><p>“We’re from the countryside. Myself and my wife are spirit masters, we heard we can get money after examining at Spirit Hall. Could you tell me where West Lu City’s Main Spirit Hall is?”</p><br/><p>Listening to Tang San, the middle aged man’s expression instantly grew a bit strange, but on account of Tang San’s spirit master status, he was still respectful:</p><br/><p>“So it’s lord spirit master. Only, you might not be too familiar with the circumstances here. Has it been a very long time since you came outside? There hasn’t been a Spirit Hall for a long time.”</p><br/><p>“What?”</p><br/><p>Tang San was shocked.</p><br/><p>“No Spirit Hall? Don’t tell me Spiri Hall has been destroyed?”</p><br/><p>The middle aged man’s expression changed, making a hushing gesture, speaking urgently:</p><br/><p>“Lord spirit master, you can’t say that! It’s my fault, I didn’t say it clearly. On the Continent there is now no longer a Spirit Hall, only the Spirit Empire.”</p><br/><p>Listening to him, Tang San instantly understood. In the four years he had been gone, the Continent had definitely undergone great upheaval. He hurriedly said:</p><br/><p>“Big brother, can’t you tell us just what’s happened? Consider this small token your reward.”</p><br/><p>While speaking, he pulled out two silver spirit coins and handed them over. It wasn’t that he was stingy, but more money would instead easily cause trouble.</p><br/><p>Seeing the mone Tang San passed him, the middle aged man’s eyebrows immediately rose in delight, and he walked together with Tang San and Xiao Wu, smiling:</p><br/><p>“Even though the nations have changed, fortunately this money still hasn’t. Then I won’t stand on ceremony. You asked the right person. As for Spirit Hall’s Changes, that’s a great event of the spirit master world that began more than three years ago, with the reselection assembly of the seven great sects.”</p><br/><p>Originally, not long after Tang San and the others left back then, Spirit Hall had taken charge of convening a seven great sects reselection assembly, producing a new seven great sects. Without exception, these seven great sects were all the most fanatic followers of Spirit Hall. Basically no contenders could be found within the two great empires. Even if the Seven Treasure Glazed Tile School still had the strength to compete, out of safety considerations, it still didn’t participate in the assembly.</p><br/><p>Thus, after the seven great sects were chosen, Spirit Hall’s popularity instantly reached its peak. Next, the seven great sects simultaneously wrote a petition, suggesting for all the world’s spirit masters to commonly honor Spirit Hall, asking Spirit Hall to even better control spirit masters.</p><br/><p>Three months later, Spirit Hall declared the foundation of a country, naming it Spirit Empire, closing all the Spirit Hall’s originally within the two great empires, recalling the spirit masters. And the Spirit Empire’s territory was all the kingdoms and duchies originally part of the two great empires, completely severing the contact between the two great empires with its sudden appearance. With the ten combined kingdoms and duchies, the Spirit Empire’s total area wasn’t inferior to any one of the two great empires after the split.</p><br/><p>Judging by their location, the Spirit Empire was clearly at a disadvantage, with Heaven Dou Empire in the north, and Star Luo Empire in the south, However, ever since the creation of the Spirit Empire, it had instead expanded in both directions. Over a few years, it already held the area of each of the two original great empires. Moreover, this was when the three armies still hadn’t met.</p><br/><p>From the look of overall strength, Spirit Empire was put together with more than a dozen smaller countries. The total military headcount could not compare with the two large empires and the command would not be totally unified, but the spirit masters under Spirit Empire’s control was too powerful. In a war, spirit masters would cause more destruction than any military could. A troop of a thousand spirit masters was enough to contend with tens of thousands of soldiers.</p><br/><p>At the same time, Spirit Empire gave orders to enlist the entire continent’s spirit masters. Anyone who didn’t enlist would be seen as heretics. Adding the influence of the new seven great sects, Spirit Hall practically controlled the power more than 70% of the continents’ spirit masters. With powerhouses like clouds, Titled Douluos exceeded ten in number. This forced the two large empires to save their strength, and no clash was dared. Otherwise, if their armies collapsed, there would be no chance whatsoever.</p><br/><p>Spirit Hall Supreme Pontiff Bibi Dong, became the first empress of Spirit Empire, ruling it as a woman. After expanding outward temporarily, she began to form the empire and eliminated the opposition while training troops. Many years of Spirit Hall’s saved up resources became the solid backbone of the empire’s development. In just a few years’ time, Spirit Empire became Heaven Dou and Star Luo empires’ powerful rival empire, and in terms of strength it surpassed any one empire. The border troops stationed within exceeded twenty thousand spirit masters, led by Elder Hall’s Title Douluos themselves.</p><br/><p>Just because it temporarily stopped expanding didn’t mean Spirit Empire was satisfied. Once Bibi Dong took complete control of the lesser kingdoms and duchies’ powers and reorganized, a great war would be inevitable.</p><br/><p>From the beginning, Spirit Empire had the upper hand after its foundation, mainly because of the original headcount of Spirit Hall of up to tens of thousands of spirit masters. The former top three sects would originally be able to barely fight against Spirit Hall, but Clear Sky School went into seclusion, the Blue Lightning Tyrant Dragon clan was completely destroyed, and Seven Treasure Glazed Tile School also lost a great deal of strength, so they could not be able to form enough strength to fight directly.</p><br/><p>The more powerful the spirit master, the more terrifying one could be in war. A Title Douluo class powerhouse would match against thousands of soldiers and horses. Of course, it wasn’t that the two large empires didn’t have a fighting chance. They had been around for many years, so they had a larger number of well trained troops. If it were to be a desperate struggle, even Spirit Empire would sustain crippling losses. This was also why Bibi Dong didn’t hurry and expand. She wanted to solidify the internal workings first and then wage war under absolutely favorable conditions.</p><br/><p>After parting with the middle aged man, Tang San entered a state of deep thought. Although he had guessed that the continent would surely have huge changes after these years, he didn’t expect that the situation had deteriorated this much. Bibi Dong chose to found a nation with brute force, which seemed rash, but it also let Spirit Hall have an actual army and enormous territory. For so many years, Spirit Hall had always been a sanctuary in the eyes of spirit masters. Spirit masters who could truly refuse the enlistment of Spirit Hall and stay in the two large empires would definitely be few in number. With so many powerful members in Spirit Empire, simply an assassination of the two empires’ higher ups would be something unbearable.</p><br/><p>If not for reviving Xiao Wu, Tang San really wanted to hurry and return to Heaven Dou City and check out the situation there. The most important thing was Tang Sect’s state of development. With the vast gap between the number of spirit masters, Tang Sect’s hidden weapons would have an indisputable effect in war. Only in using large quantities of highly destructive hidden weapons could there be a chance to fight against Spirit Hall’s spirit master troops.</p><br/><p>There was also something else Tang San had to do. He had already almost completed the conditions the elders raised back when he left the Clear Sky School. His strength had reached the eightieth rank, he possessed at least one hundred thousand year spirit ring, now he just had to kill a Spirit Hall Title Douluo to be qualified to return to the Clear Sky School, and pay his respects to his grandfather. The Clear Sky School didn’t have enough spirit masters to change the balance between the two great empires and Spirit Hall, but the meaning of their name as the number one spirit master sect back then couldn’t be doubted. The Clear Sky School moreover had altogether six Title Douluo. If they left the mountain, they could definitely have a huge effect.</p><br/><p>“Ge, why don’t we also return to Heaven Dou City.”</p><br/><p>With Xiao Wu’s intelligence, as well as having followed Tang San for so long, she naturally understood everything he was thinking. The present circumstances were bad, and the Tang Sect needed Tang San to return to take charge.</p><br/><p>“No.”</p><br/><p>Tang San forcefully shook his head,</p><br/><p>“Only if we first resurrect you can we return. Even if the circumstances are bad, Mubai and the others have already returned to Heaven Dou City. With them there, there won’t be a problem with the Tang Sect. Before you are truly resurrected, how can I put all my energy into opposing Spirit Hall? Don’t worry, Spirit Hall won’t take any major actions for a while. The two great empires are closely dependant on each other right now, if Spirit Hall attacks one of them, the other absolutely won’t stand aside. Thus, Spirit Hall’s mercenaries have no choice but to move cautiously. For now it’s enough that Mubai and the others bring back the news that we’re safe. I think our Tang Sect will definitely have developed quite far in more than four years. Heaven Dou Empire is also bound to have secretly saved up a number of hidden weapons. Even if the war truly comes, it won’t be that easy for Spirit Hall to take the empire.”</p><br/><p>Xiao Wu leaned against Tang San’s chest, whispering:</p><br/><p>“Ge, I know you want my best, but, if something happens to you because of me, I……”</p><br/><p>Tang San put his forefinger on her lips, not letting her continue.</p><br/><p>“Xiao Wu, I’ve never been an ambitious person, nor have I ever wanted to go change anything about the Continent. I oppose Spirit Hall because of hatred. My parents’ hatred, as well as your hatred. As far as I’m concerned, resurrecting you is the only major task right now, not dealing with Spirit Hall. Since you’re worried, then we’ll cause this so called Spirit Empire a bit of chaos. Didn’t that uncle just now say that, besides West Lu City’s original city guard, there was also a spirit master regiment sent by Spirit Hall, and its commander, along with the city guard, holds the authority within the city? No question about it, this is Spirit Hall’s method to monitor the kingdoms and duchies. West Lu City is the strategic city of Häagen-Dazs Kingdom, so Spirit Hall absolutely wouldn’t have sent less than fifty spirit masters, and the leader should also be at least a Spirit Sage level power. Tell me, if I had these spirit masters disappear, what would Spirit Hall think of West Lu City, and even of Häagen-Dazs Kingdom? Perhaps one city won’t count as anything, but next we’re crossing the entire kingdom, if the same thing happened in ten cities at the same time, how would Spirit Hall treat Häagen-Dazs?”</p><br/><p>Xiao Wu stared blankly,</p><br/><p>“Ge, your meaning?”</p><br/><p>A baleful look flashed in Tang San’s eyes,</p><br/><p>“All Spirit Hall accomplices, kill without pardon.”</p><br/><p>At nightfall, a black silhouette slowly appeared outside the West Lu City spirit master regimental residence. A large deep blue cloak hid his figure, all that could be seen was that this person held a four meter long giant weapon, dark green, without any luster.</p><br/><p>It was precisely Tang San. He and Xiao Wu had settled down and rested for a few hours in the city, waiting for the depth of night, then quietly left the inn. Tang San knew Xiao Wu didn’t like massacres, and so he’d placed her body into the Wishful Hundred Treasures Purse. The cloth covering the Seagod Trident was already removed, and he’d specially bought a large mantle to hide himself, then came here.</p><br/><p>Tang San himself wasn’t someone who liked killing, but regarding Spirit Hall, he would never be merciful. The enemies of his parents, even more with Xiao Wu’s grudge. He would never forget the deep bitterness in his father’s eyes, and even less the despair in Xiao Wu’s eyes when she sacrificed herself for him. No matter how powerful Spirit Hall was, they were all the enemies of his lifetime.</p><br/><p>His left hand pressed on the golden trident brand on his forehead, keeping its light from shining when he released his spiritual force, his boundless mental power rushing out like the vast ocean. After coming outside, it again spread out like a tiny trickle, forming an enormous mental web in just the time of a breath. Not only did it envelop the spirit master regimental compound in front of him, it covered everything within several thousand square meters surrounding it.</p><br/><p>Countless pieces of information quickly rushed back into Tang San’s brain via his spiritual force. If Tang San wanted to scout in such detail before leaving for Seagod Island, he would not only have to use the Blue Silver Domain and the strength of the plants, but would also have to take care not to be discovered. But now he basically didn’t need to worry about that, unless there was a power here whose spiritual force reached the level of Seagod Douluo Bo Saixi, and was a cut above his own, this wouldn’t draw anyone’s attention. Just like an eagle looking down from high above, easily grasping the slightest movement.</p><br/><p>Now it was deep at night, and roughly thirty soldiers patrolled around the spirit master compound, and inside the station were roughly fifty soldiers, and thirty of forty servants. The number of spirit masters was close to what Tang San expected, more than eighty.</p><br/><p>Distinguishing these people wasn’t a problem. The soldiers’ auras were rather calm, the servants walked a bit heavily, and the spirit masters’ released some lingering spirit power fluctuations with every breath and motion.</p><br/><p>Tang San naturally didn’t plan to kill everyone here. His targets were only the spirit masters. He naturally wouldn’t massacre those soldiers and servants.</p><br/><p>Without being anxious to enter the station, Tang San quietly circled the outside. Very soon his spiritual force guided him to the soldiers patrolling and guarding the place. Blue Silver Emperor quietly shot out from the ground, and before the soldiers could react, each and every one was already tightly bound. The Blue Silver Emperor suddenly shook, infusing spirit power, and the thirty soldiers noiselessly went limp under the spirit power fluctuations the Blue Silver Emperor released. Dealing with these common guards really was too simple to Tang San. They basically wouldn’t know how they ended up unconscious.</p><br/><p>Pulled by the Blue Silver Emperor, Tang San very quickly dragged them over to a quiet alley. They wouldn’t wake up for a few hours.</p><br/><p>Having dealt with the issues outside, Tang San quietly climbed into the station. The fifty soldiers inside were split into five squads, each patrolling in five different directions. Each squad was led by a spirit master around rank forty. It was a quite tight defense.</p><br/><p>If Tang San wanted to deal with all the spirit masters here, he only needed to find a suitable place to release his eighth spirit ability, Blue Silver Evil Spirit Mirror’s Annihilation, and it would be settled in an instant. Through his previous scouting, he discovered that among all the spirit masters stationed here, only one had strength at the Spirit Sage level, the remainder were all spirit masters at rank sixty or below, basically unable to threaten him at all.</p><br/><p>However, Tang San really wouldn’t do that. If he relied on his formidable spirit power to deal with all the spirit masters here, then the servants and soldiers wouldn’t have any chance to survive either. He didn’t want to kill indiscriminately, this was one reason. THe other reason was that if he only used one spirit ability, then the Spirit Empire could later very easily discover that only one formidable spirit master had come here. For Tang San to produce chaos, he naturally didn’t want their investigation to reach a result like that.</p><br/><p>Just at this moment, a squad of soldiers turned to head in Tang San’s direction. Tang San bent low, immediately concealing himself among some plants next to him. His Blue Silver Emperor was a plant type spirit, so his ability to hide among plants could now be called flawless. Even if a Title Douluo used spiritual force or maybe aura to search for him, they still absolutely wouldn’t find a trace.</p><br/><p>Walking furthest ahead was a spirit master, with both hands behind his back. He had an arrogant expression, as if he didn’t notice the soldiers behind him. The soldiers in turn followed cautiously behind, not daring to be the slightest bit careless. Spirit masters really did act powerful in front of ordinary people.</p><br/><p>A branch quietly appeared in the squad, and one soldier immediately stumbled over it, knocking against the soldier in front of him.</p><br/><p>“Ouch, what are you doing?”</p><br/><p>The soldier who had been knocked against couldn’t help crying out.</p><br/><p>“Bastard, what’s the noise?”</p><br/><p>The spirit master walking in front turned his head sharply and rebuked them angrily.</p><br/><p>“Lo-, lord. He knocked against me……”</p><br/><p>The soldier who cried out hastily explained. However, the next moment the pupils of his eyes suddenly grew large, startled looking behind that spirit master along with the other soldiers.</p><br/><p>Rank forty already awarded the title of Spirit Ancestor, and corresponded to quite considerable strength. Seeing the alarm in the soldiers’ eyes, that Spirit Empire Spirit Sage immediately reacted. He didn’t turn his head as well, but dashed forward at the same time as he released his spirit, preparing to dodge any attack coming from behind and then launch a counter attack.</p><br/><p>It couldn’t be said he reacted slowly, but unfortunately, he’d met an opponent he basically couldn’t fight.</p><br/><p>One Blue Silver Emperor twisted tightly around his neck, ice cold spiritual force stabbing straight into his brain, severing his connection with his spirit, forcefully interrupting the half completed spirit release. His throat was sealed, unable to even breathe, and he naturally couldn’t cry the alarm. At the same time, an intense shocking force came from below the feet of the soldiers, making them all go limp, falling unconscious to the ground.</p><br/><p>To Spirit Empire spirit masters, Tang San absolutely wouldn’t be lenient. These were all his enemies. One less meant the Spirit Empire would lose a portion of their strength. Sharp thorns ejected from the Blue Silver Emperor twisting around that spirit master, stabbing deeply into his throat. Potent poison rushed straight into his brain from the Blue Silver Emperor’s thorns, quietly taking away his life.</p><br/><p>Those ten soldiers hadn’t collapsed from Tang San’s spirit ability, but rather the Seagod Trident. Tang San only tapped the Trident on the ground, sending shocking force out in a straight line controlled by his spirit power in a ten meter range, knocking them unconscious as it passed.</p><br/><p>Blue Silver Emperor flickered, and altogether eleven people were quietly pulled into the plants. One of the five patrolling squads was settled in an instant.</p><br/><p>Very quickly, Tang San found the other four patrolling squads, and used different methods to deal with them all; using Blue Silver Emperor to directly paralyse them, using spirit power to directly knock them unconscious, or using the Clear Sky Hammer to crush the leading spirit master. He gave the patrolling soldiers the feeling they all encountered different opponents, and basically didn’t give them the chance to see him clearly.</p><br/><p>Tang San used less than half the time of a stick of incense to deal with these problems without alarming the spirit masters in the station.</p><br/><p>Ice cold killing intent began to glitter in his eyes, the true assassination started from here. Colding the trident, Tang San quietly slipped into the station.</p><br/><p>He didn’t release his Blue Silver Emperor again. Seagod Trident in his right hand, he released the Clear Sky Hammer in his left. Hammer in left and polearm in right, he pulled on a long since prepared mask. At the same time as he stepped inside, the spiritual force he originally used for scouting suddenly spread out, an intense mental shock instantly appearing within the walls of this spirit master regimental station.</p><br/><p>Muffled grunts and cries of alarm rose and fell. The mental shock Tang San sent out wasn’t at full intensity, but it was already enough for ordinary people. The servants fell unconscious without exception. In the entire station, only those suddenly awakened spirit masters still remained, and some Spirit Empire spirit masters who had been cultivating even had their spirit power interrupted, and fell over in pain inside their rooms.</p><br/><p>“Who?”</p><br/><p>An angry voice called.</p><br/><p>Tang San no longer hid himself, and two spirit masters directly ahead had already discovered him, quickly releasing their spirits and charging towards Tang San. Since there was no light of spirit rings coming from Tang San, the two spirit masters didn’t even pay attention to the two weapons he was holding.</p><br/><p>With a cold snort, Tang San’s full killing intent radiated in all directions. His left hand threw out the Clear Sky Hammer, directly attacking the two in front. He basically didn’t even need to consider what abilities these two spirit masters had, because their spirit power wasn’t even at rank fifty. In front of absolute strength, no matter how wonderful their spirit abilities, they were completely useless. They couldn’t even stand up to just Tang San’s physical strength, let alone with that world dominating Clear Sky Hammer. Even the leader of the Seagod Seven Sacred Pillar guardian Douluo, Seadragon Douluo, had taken a loss against Tang San’s Clear Sky Hammer, let alone these people.</p><br/><p>The outcome was without the slightest suspense. With a light pull of Controlling Crane Catching Dragon, the several thousand jin heavy Clear Sky Hammer struck the chests of the two spirit masters in succession. It wasn’t that they didn’t think to stop it, but rather that the spirit abilities they released did nothing to stop it.</p><br/><p>At this moment, even more spirit masters also rushed out from all directions. Spirit masters after all had formidable strength, and even though the fight here was brief, the two spirit masters’ shouts had already exposed Tang San’s position.</p><br/><p>Quietly teleporting, Tang San appeared somewhere else. Behind him, at least seven or eight single target spirit abilities struck. Amidst the loud sound, one house turned into ruins. Tang San only used the simplest methods to attack the opponents. The Clear Sky Hammer flew out, against its terrifying force plus the control of Controlling Crane Catching Dragon, these universally rank forty or fifty spirit masters were like a flock of sheep. They couldn’t even catch Tang San’s shadow. They only saw the large hammer spiral out in attack. With each touch, it was sure to take away the life of one Spirit Empire spirit master. All kinds of abilities sparkled, but against the incomparably heavy Clear Sky Hammer, these abilities were only as useful as fireworks, flashing and then fading.</p><br/><p>Strangely, each time the Clear Sky Hammer killed one person, the Deathgod Domain pattern inscribed on its surface would flash with blood red light, and the fiendish energy it carried would increase somewhat. Red and black light flickered, seemingly able to easily split open the defenses of the opponents trying to use energy type spirit abilities to stop it.</p><br/><p>Even Tang San himself hadn’t thought all this would be so easy. In his expectations, with close to a hundred spirit masters here, he would at least have to spend some effort to kill them all without letting any escape. But not one of these spirit masters could take an attack from the Clear Sky Hammer. Before Tang San switched attack methods, more than half were already dead.</p><br/><p>This of course wasn’t because the enemies were too weak, but rather because Tang San was too strong.</p><br/><p>Last time he fought Spirit Hall was more than four years ago, and at that time he had only had rank sixty something spirit power. If he had confronted this many spirit masters, it would of course have been impossible to win easily. But now, not only had his spirit power reached a frightening rank eighty five, he also possessed one more hundred thousand year spirit bone, and three major hundred thousand year spirit rings. Just the spirit bone and rings alone had already strengthened his physical strength to an extremely frightening degree. Tang San’s body already surpassed that rank ninety five Seadragon Douluo. His overall strength had even more reached the level of a ninety fifth rank Title Douluo, and that was without considering the Seagod Trident in his hand.</p><br/><p>In front of such strength, these low level spirit masters were like bugs to him. Killing them really was as easy as picking something out of his pocket. This was the absolute suppression of high level spirit masters to low level spirit masters.</p><br/><p>Just as Tang San was considering changing his attack method, suddenly, with a loud sonorous sound, his constantly killing Clear Sky Hammer was washed up in a great force, spiralling once in the air.</p><br/><p>The corner of Tang San’s mouth showed a trace of a grim smile, finally a bit interesting.</p><br/><p>An extremely large spirit master stood in the courtyard, and shouted loudly,</p><br/><p>“Everyone form up on me.”</p><br/><p>Only thirty something spirit masters remained now. The Clear Sky Hammer had only left behind corpses, not even one opponent was injured. These spirit masters gathered in a rush, standing behind that tall spirit master in his sixties, their minds now stabilizing a bit. The Clear Sky Flying Hammer killing them just now had chilled their courage.</p><br/><p>The large spirit master shouted deeply:</p><br/><p>“Which Clear Sky School friend is it, please show yourself.”</p><br/><p>Tang San withdrew the Clear Sky Hammer, slowly walking out from behind the ruins. Due to the size of the cloak, not only was his body hidden, while his head was bent, there was no way for them to see his face.</p><br/><p>“When did the Clear Sky School become this sneaky?”</p><br/><p>The large spirit master looked somewhat bewildered at Tang San. He held a battle axe in his right hand, his spirit, the Blood Devil Axe, he was that only Spirit Sage level power Tang San had sensed in the compound. Only Tang San hadn’t thought this opponent was actually a Tool Spirit Sage. His strength was quite something.</p><br/><p>However, the Blood Devil Axe Spirit Sage’s heart was currently even more shocked. Even though he had just blocked the Clear Sky Hammer once, the right hand holding the Blood Devil Axe was still convulsing, the skin between thumb and forefinger split. Clearly, the opponent before him absolutely didn’t have spirit power below his own. Even if he recognized that his Blood Devil Axe was quite a good tool spirit, and his strength was top notch on the Spirit Sage level, confronting an enemy with spirit power not lower than his own, and holding the world’s number one sect’s trump spirit Clear Sky Hammer, he didn’t have much confidence.</p><br/><p>“It’s not being sneaky, it’s because you don’t have any need to know who I am. Because, you will very soon be dead.”</p><br/><p>Tang San’s voice was very calm, a trace of mental waves mixed into it, making the opponents unable to tell his age from his voice.</p><br/><p>The Blood Devil Axe Spirit Sage gave a cold snort,</p><br/><p>“I didn’t expect the Clear Sky Sect would actually reemerge. However, do you think your Clear Sky School can compete with our empire? Keep acting like a turtle pulling its head in and you might be able to struggle on, but dare return to the spirit master world, and you’ll end up the same as the Blue Lightning Tyrant Dragon Clan.”</p><br/><p>The Spirit Empire was already established and formally become hostile with the two great empires, so Spirit Hall naturally didn’t need need to act in secret like before. Of course, by their justifications, the Blue Lightning Tyrant Dragon Clan was undoubtedly an extremely evil existence, and had been justly eliminated by the Spirit Empire. History would forever be written by the winners, and even if the Spirit Empire still hadn’t become the final victor, they had already begun to distort the past with all their efforts.</p><br/>\n</div>"}