{"title": "Chapter 251", "id": 251, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-251", "volume_title": "Volume 3", "body": "<h1>Chapter 251</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 251</p><br/><p>Seizing Opportunity, Break Through, The Sixth Trial</p><br/><p>(TL: Armored Raven)</p><br/><p>Upon watching how the plants on Seagod Mountain grew at an insane pace and swarmed after Seagod Hall, as Guardian Douluos who tasked themselves in protecting Seagod Island, there was no way they could just watch.</p><br/><p>In mid-air, Seagod Douluo Bo Saixi was finally able to halt the advance of the Blue Silver Dominant Emperor Spear before it fell on Seagod Hall. With the blast of a punch, a powerful collision was made. A massive wave of sound threatened to deafen everyone as a ring of red colored wave spread out from where the Blue Silver Dominant Emperor Spear exploded.</p><br/><p>Even with Seagod Douluo Bo Saixi’s power, she also stopped in mid-air as she let out a fistful of faint blue waves and blocked the shockwaves caused by the spear’s explosion. Before Blue Silver Tyrant Emperor Spear was about to be hit by Bo Saixi’s attack, Tang San already cut off the link between him and it, while Bo Saixi discovered that this spear of his appeared to be fearsome and second to none, but in reality, the spear body had some spirit power. Right when she was going to face it head on, it was already decelerating, plus the severing of the link with Tang San, it caused the fearsome focal penetrating power to fail in being brought out completely. Even so, its attack power made Bo Saixi shiver in her heart.</p><br/><p>“Don’t block those plants!” Bo Saixi seemed to have realized something. She stopped in mid-air for a bit, and blocked the dispersed shockwaves from Blue Silver Dominant Emperor Spear, which needed an instant of soul power to some degree. And it was this slight duration of time which heralded the time of the plants’ arrival at the front of Seagod Hall.</p><br/><p>Bo Saixi’s caution was still late by a step. Protecting Seagod Island and Seagod himself had long become a directive that was deeply rooted in the minds of Seagod seven sacred pillars’ Guardian Douluos. Facing the intensity of the plants, how could they just do nothing? The seven of them almost moved at the same time and strong spirit powers burst out in order to stop the plants that were coming from all direction. They even used their own spirit avatar states in order to halt the creeping.</p><br/><p>Tang San’s forehead flashed as the golden trident brand was flickering. The thing he wanted to have had come.</p><br/><p>“Due to the Seagod seven sacred pillars’ Guardian Douluos taking part of the sixth trial, the difficulty of the trial has been increased, and the limitations were broken. Special permission to grant the trial participants to leave the testing grounds is in effect. Leaving the Seagod Island perimeter will count as passing the trial.”</p><br/><p>It wasn’t just Tang San who received the notification. Seagod Douluo Bo Saixi and the seven Guardian Douluos also received the same notification. They were stunned, yet Bo Saixi’s brows moved tighter. A red figure flew down to the bottom of Seagod Mountain in unprecedented speeds.</p><br/><p>Indeed, all of this was in Tang San’s calculations. When he saw the seven sacred pillars Guardian Douluos stood in front of Seagod Hall, the plan was already being executed. Blue Silver Dominant Emperor Spear truly was an attack which had all of his strength. Without doing so, it wouldn’t be able to restrain Seagod Douluo Bo Saixi. When it came to attacking head on, this strongest spirit skill of Tang San would have no effect whatsoever. But if the target became Seagod Hall instead, then Bo Saixi could do nothing but to protect it. No matter how powerful her strength, Tang San believed that it wouldn’t be possible for her to use a large area spirit skill to block his Blue Silver Dominant Emperor Spear. Since she would never let Seagod Hall be damaged in the slightest, she would surely protect it by herself.</p><br/><p>And it was at this time that Seagod Mountain’s plants were urged by Tang San to attack the Seagod Hall. Tang San thought about this as soon as three days ago, when he requested Bo Saixi to hold the challenge at the bottom of Seagod Mountain. The reason he wanted to fight here was not because he wished to use blue silver domain to tussle with Bo Saixi. When he reached the same stage as Bo Saixi, Tang San’s current domain power would not have any effect on her. The reason he chose here was not because there were trees, but because of Seagod Hall.</p><br/><p>Attacking Seagod Hall would result in Bo Saixi’s rescue, and the appearance of the seven sacred pillars Guardian Douluos gave Tang San a pleasant surprise. He had already calculated that when he attacked Seagod Hall, the Guardian Douluos would never stay still. With Bo Saixi restrained, they would surely give it their all to halt the plants’ attacks.</p><br/><p>In reality, whether it was Blue Silver Dominant Emperor Spear or the plants, Tang San wouldn’t actually attack Seagod Hall seriously. He was too smart for that. He knew it clearly that if he really attacked Seagod Hall, then the Guardian Douluos and Bo Saixi would then receive orders to attack him. What good would come from encroaching upon Seagod’s pride? Hence all of his attacks had reservations. Whether the spear or the array of plants brought forth with blue silver domain, they would only reach before Seagod Hall instead of actually leading to destruction.</p><br/><p>The seven sacred pillar Guardian Douluos had fallen for it, and at the same time, the result was also exactly as Tang San predicted. Now that Tang San was in a bitter resistance under Bo Saixi’s attacks, the blocking of his attacks from the Guardian Douluos meant that they had taken part of the trial. Considering the strength of the Shrek Six, if they took the trial while under Bo Saixi and the seven sacred pillars Guardian Douluos’ attacks, they wouldn’t have even 1/10000th chance of succeeding. Seagod was fair, and so, the trial would naturally change again. If the sixth trial could have its difficulty bumped up because of shortcutting in the fifth trial, then surely Seagod would have something to say if the sixth trial were to have its difficulty increased by a large margin.</p><br/><p>It was exactly because of this that the current situation happened. When Tang San had to avoid Bo Saixi’s soul power and spirit power fused search earlier, he had already retreated to the bottom of Seagod Mountain. By ‘leaving Seagod Island perimeter’, it meant that once he entered the ring shaped sea, this incredibly difficult sixth trial would be passed and he didn’t have to care about the burning joss stick.</p><br/><p>However, looking at the ring shaped sea that was about a home stretch away, Tang San didn’t retreat but charged ahead instead. Just when he charged ahead, a red glow had zipped past his previous location and slammed the beach at the bottom of Seagod Mountain heavily.</p><br/><p>In that terrifying boom, the beach surfaced a hundred metres diameter, ten metres deep crater. The seawater from the ring shaped sea even started filling it. Bo Saixi had already appeared in that location. If Tang San retreated earlier, then he would’ve been hit directly by that one punch from Bo Saixi.</p><br/><p>Right now, Tang San suddenly vaulted from Seagod Mountain. Instead of avoiding, he lunged directly at Bo Saixi with the glow of his eighth spirit ring. Rings of red waves spread out one after another towards Bo Saixi. This was his eighth spirit skill, Blue Silver Orca Slash. A forced three second dizziness.</p><br/><p>And at the same time, Tang San spinned in mid-air for a single rotation and his left leg swung down instantly. It carried a crescent-like halo that fell from the skies, straight towards Bo Saixi’s head.</p><br/><p>This time, even Bo Saixi herself felt astonished. ‘Tang San used all his effort and wisdom to create this extremely advantageous chance, so logically speaking, no matter if he were cloaked or teleported, he would surely escape from my attack range. But why did he choose to attack head on instead? Could it be that he thought his attacks could fight me off to enable him his entry to the ring shaped sea? How can that be?’ Bo Saixi didn’t think any further. Facing Tang San’s double hard hitters, her left foot stepped on the ground lightly, and a huge wave rose from beneath. It wasn’t a real wave, but one that was simply formed from energy. Tang San’s powerful crowd suppressing eighth spirit skill was actually shattered by this energy wave, and didn’t even land on Bo Saixi.</p><br/><p>Bo Saixi’s wave was a complete fusion of her spirit power, and this time she completed the fusing process at the same time as when she released her soul power. This was the Seagod Douluo’s true strength.</p><br/><p>At the same time, Tang San’s left leg brought down his Orca Evil Axe from the sky to Bo Saixi’s head. Hundred thousand year spirit bone skill was not a slouch. The huge wave that shattered the Blue Silver Orca Slash was cut open by it. The incandescent red glowing axe was striking down like a bolt of lightning.</p><br/><p>Facing Tang San’s attack, Bo Saixi didn’t even move. She just made a simple movement. Her right hand turned around and the palm became like a blade, straight towards Tang San’s left leg. That palm seemed so light, but for Tang San who had once been slapped straight into the bottom of the sea would surely know how powerful this was. But he still persisted in kicking down.</p><br/><p>BOOM——</p><br/><p>No matter how good the hundred thousand year spirit bone skill was, it was an ironclad fact that the difference between the soul power of both sides was so far away. Bo Saixi didn’t even flinch, but Tang San tumbled away diagonally like a bombshell. So fast, that it was faster than the speed of Bai Chenxiang’s power from the mirror image sausage he used.</p><br/><p>With the slap that sent Tang San flying, Bo Saixi suddenly realized something and murmured ‘Oh crap’. When she slapped on Tang San’s Orca Evil Axe, she clearly felt Tang San deploying Golden Invincibility again. And now, he had already flew out for very far.</p><br/><p>“Thank you for the lift, senior~~~!” Tang San’s voice came from the air. Just when Bo Saixi wanted to give chase, two golden beams fell from the skies, forcing her to face them. A collision on the spirit level took place once more, and the result wasn’t that different from before. Tang San was now even bleeding from his eyes, nostrils, ears and mouth, but he couldn’t hold back his laughter.</p><br/><p>Bo saixi didn’t chase anymore, and dispelled the shockwaves of spirit power. She let out a small sigh and murmured to herself, “It seems like the heavens willed this outcome. This kid is indeed a talent blessed by the above. Such an ordeal has been overcome by his own power. How can I ever refuse Lord Seagod’s will?”</p><br/><p>In mid-air, the trident brand on Tang San’s forehead let out a golden light for the sixth time. The light then shattered and its fragments entered his own body. Then a notification came, “With wisdom and strength, you survived Seagod Douluo and the seven sacred pillars’ Guardian Douluos’ attacks, completing the sixth trial with additional credit. Affinity with Seagod increased by 20 percent, to a total of 70 percent.”</p><br/><p>Escaping Seagod Island’s perimeter didn’t mean one had to enter the ring shaped sea. The perimeter meant the range of the island’s projected range. The reason Tang San attacked Bo Saixi was of course not for having the attack to land, but for Bo Saixi’s fearsome counterattack. Using his Golden Invincibility to protect himself, and his calculation of angles, that powerful shockwave managed to send him away diagonally. By the time Bo Saixi thought about reacting, Tang San had already left Seagod Island’s projected range. The Purple Magic Eyes were the icing on the cake, crushing the last chance Bo Saixi had in stopping him.</p><br/><p>Seagod Island’s plants returned to normal without blue silver domain’s support, and they gradually retreated. The seven Guardian Douluos who knew they committed a wrong had flown to Bo Saixi and knelt down on one knee.</p><br/><p>“Your Highness, we have erred. Please punish us.”</p><br/><p>Bo Saixi shook her head and spoke calmly, “It was the will of the heavens. You can’t be blamed. He’s just too smart. Get up.”</p><br/><p>Tang San was falling from the sky in almost complete vertical straightness, and crashed into the ring shaped sea with a splash. From the extremely intense battle to the relaxing state right now, he only felt that his limbs and bones had become scattered. Especially the shock to his brain caused by two spirit power collisions, which gave him a head-splitting pain as his aura was fluctuating unstably.</p><br/><p>The buoyancy of the seawater lifted him to the surface, and as he laid still on the seawater, Tang San greedily breathed in the salty fresh air.</p><br/><p>The trial was finally cleared. Even though Seagod Douluo’s strength had been far more terrifying than his imagination, he still passed the sixth trial and obtained up to 20 percent of affinity with Seagod as a reward. Although he depended on his own wisdom to succeed, in the entire process, his soul power, spirit power and mental strength had all been exhausted to the highest extent. With his strength as Spirit Douluo, he felt his entire body going sore and soft, unable to work up even a bit of effort as fatigue and injury had spread throughout his body. But his mind was amazingly relaxed.</p><br/><p>How Tang San could pass this trial could definitely not be described with a word ‘lucky’. From the beginning when he let his companions escape, to battling against Bo Saixi with wits, and until the final moment when desperately searched for a way to clear the trial, all of them could be said to be the perfect combination of his strength and wisdom.</p><br/><p>A dense power came from under the seawater, which Tang San did not resist and let it push him towards the bottom of Seagod Mountain. He only crawled up when his body made contact with the beach, and he walked up the shore with difficulty.</p><br/><p>Seagod Douluo Bo Saixi and the Seagod seven sacred pillars’ Guardian Douluos were all standing there, staring at him silently.</p><br/><p>Undoubtedly, this was Tang San being very discomposed right now, but in the eyes of the eight powerful people of Seagod Island, he seemed to have become someone else. In Seagod Nine Trials, the sixth trial was the most important, and also one of life and death. Passing this trial meant that Tang San’s standing on Seagod Island had been raised to another level directly. It was at least to the same standing as the seven sacred pillars’ Guardian Douluos.</p><br/><p>“Thank you for showing mercy, senior.” Tang San bowed down slightly towards Bo Saixi.</p><br/><p>Bo Saixi waved her right hand slightly and a gentle force seized Tang San’s body, making him unable to bow, “I didn’t show you any mercy, so you didn’t have to be like this. You should’ve guessed that I was going to kill you, right.”</p><br/><p>Tang San smiled bitterly, “To be more precise, it’s killing me justifiably, huh.”</p><br/><p>Bo Saixi’s eyes flickered, and the sharp aura made Tang San blew hot air from his nostrils. He took a couple of steps back and stood upright, but he didn’t mind the situation and even smiled at Bo Saixi, “Now you don’t want to kill me anymore. Does that make you fierce outside gentle inside?”</p><br/><p>Bo saixi looked at Tang San and spoke serenely, “Many years ago, I thought that your great grandfather and Qian Daoliu are my greatest rivals in life. Whether it’s them or me, we were all gifted. Otherwise, we wouldn’t be able to train until Pinnacle Douluo stage. When I first met you, I was somewhat surprised, but I saw that you had good talents, even though at most you would just reached the same level as us. While you have two innate battle spirits, when you reach our point, having two battle spirits wouldn’t bring you many benefits. If they’re poorly managed, they would even be a huge danger. I didn’t understand why Lord Seagod chose you. From how I saw it, you getting the Top Class Eight Trials would be the greatest honor. But you received Seagod Nine Trials instead. I don’t know how many years it has been since I felt jealousy in my head. But now that I look at it, Lord Seagod wasn’t wrong in choosing you. You may be on the same level as us in terms of training talent, but you have many traits which we don’t possess. Perhaps this is why Lord Seagod chose you.”</p><br/><p>Tang San saw how Bo Saixi’s eyes were letting out traces of sadness, and said, “Do you know, senior? What I felt when I received Seagod Nine Trials wasn’t excitement, but crisis. It wasn’t coming from the trials themselves. Because I know that since they’re trials, then they would surely be completed within our capacities. It was only a matter of whether or not we would be able to make use of our abilities. From the actual situations of the trials, especially in the previous three trials, I can say they’re meant to temper and improve us. Seizing every opportunity without letting one go is our greatest treasure. And the facts proved that my judgement was correct. My sense of crisis came from Seagod Island. It’s easy to imagine that Seagod Nine Trials which even you never got, would bring me tremendous benefits. But at the same time, behind the tremendous benefits, there would lie huge risks. If my estimation is correct, when I really complete Seagod Nine Trials, then there will be a certain loss for you. You will find it very hard to accept such a loss.”</p><br/><p>“Humans are selfish, and even you who are infinitely close to gods, are just as selfish. But you are Seagod Island’s hierophant, and I took Seagod Nine Trials, so you can’t kill me. You can even say that no one on this island can do it. You want to wipe me out, who’s a threat to you? Then you can only do it in the trials, as justifiably as expected.”</p><br/><p>“There’s also another thing I guessed as well. Sea Horse Douluo once said that if Black Class Trials cannot be passed, then the outcome can only be death. But I can tell you’re a kind person. If I die here today, and my partners cannot complete their Sixth Trial because of your attacks, you wouldn’t let them die. Although I don’t know what you would do, with your authority as the hierophant, you should be able to pardon them from death. When the sixth trial began, me letting them leave first was more about being afraid of having them caught in the crossfire. They’re my siblings, and if I were to face a life threatening d anger, they would never hesitate to rescue me. Your strength was just too powerful, so I chose to face your trial alone. I think this should be my one and only crisis on Seagod Island. After clearing this trial, you should have no other chances to justify killing me, and naturally you would’ve given up on killing me.”</p><br/><p>The seven sacred pillars’ Guardian Douluos who stood behind Bo Saixi went wide-eyed and open-mouthed after hearing what Tang San said. His analysis could be said as mostly baseless, but they could feel that Seagod Douluo, hierophant Bo Saixi, who trained to the stage of becoming an embodiment of heaven, was actually releasing unstable soul power waves. It was apparent how much Tang San’s words affected her.</p><br/><p>A deep sigh came out of Bo Saixi’s mouth, “I didn’t expect you to be this smart with such a sharp judgement. While your guess isn’t completely correct, it’s not that far off the mark. Regardless, I must congratulate you on succeeding in passing the sixth trial. You’re right in that after passing the sixth trial, I already have no chances in killing you. But I must remind you. Your crisis isn’t over just yet. Because unless you complete all nine of the trials, you run the risk of being taken over. As long as you have even one trial that’s not passed, you will die for sure.”</p><br/><p>Tang San nodded, “Thank you very much for your reminder. I think my partners should also receive their notifications right now. I still have to trouble you for this, senior; Please don’t tell them what was spoken, and don’t tell them about my trial’s exact conditions.”</p><br/><p>Bo Saixi looked at Tang San deeply, and the seven sacred pillars’ Guardian Douluos had newer respects towards him in their eyes. “You are an almost perfect group leader. Not only can you lead your partners to the most proper path, you can also shoulder the burden when facing dangers. Very well. I’ll promise you that. You only have seven days at most to recompose yourself. When you feel like your body has fully recovered, bring Ning Rongrong and Xiao Wu up the mountain and find me in Seagod Hall for your seventh trial.”</p><br/><p>After saying this, Bo Saixi slowly turned around to Seagod Hall’s direction. In this moment, she appeared to be somewhat older. After stopping for a moment, she took the stairs to Seagod Mountain instead of flying. Step by step she walked up. The seven sacred pillars’ Guardian Douluos were close behind.</p><br/><p>Seeing them walk further and further away, Tang San let out a long sigh of relief and sat immediately on the ground. Now he was truly relaxing and muttered to himself, “My gamble really got it right. So close, so close….”</p><br/><p>Actually, Tang San himself wasn’t sure if Bo Saixi wouldn’t kill him. Before the sixth trial started, everything was only his speculation, and when the fighting started, Bo Saixi’s determined killing intent released through her spirit power almost made Tang San lose all of his wits, but it was also because of that, his potential was stimulated beyond the limits, and he was able to perform so well. But even after passing the sixth trial, he didn’t feel like he would survive at all. Only heaven knew whether Bo Saixi would oppose Seagod’s will to kill Tang San. He knew his own ability very clearly, and he also understood that he would have the chance to surpass her in the future. Now would be the best time to kill him. Seagod was an illusionary and intangible existence, and if Bo Saixi were to oppose his will as the hierophant, the outcome would be uncertain. What’s certain was that he would die. The reality proved that Bo Saixi was just as he guessed, kind in nature, and had a deeper respect towards Seagod than he imagined. Until they left, Tang San’s crisis coming from the sixth trial would be truly over.</p><br/><p>Feeling discomfort, Tang San chose to just lay down on the beach. The softness of the sands was as comfortable as a cushion. Ever since arriving at Seagod Island, this was the first time he felt this relaxed. He was the true brains of Shrek Seven. In the usual days, even in between trainings, the companions could rest with relaxation, but he couldn’t, for he had to worry about lots of things about the trials that they had to face. Now, everything was getting better. Except for him, Xiao Wu and Ning Rongrong, the other four companions had passed their trials. At the same time, their strength could also be raised to more than level 80 and have eighth spirit rings, making the overall strength of Shrek Seven step into Spirit Douluo stage. Tang San believed that as long as they didn’t run into a powerful Pinnacle Douluo like Bo Saixi, then under his control, they would be able to face a great number of possible dangers, and also have a strength to fight with Spirit Hall.</p><br/><p>“Brother San, are you alright?” Zhu Zhuqing and Bai Chenxiang ran over. In the view in their eyes earlier, they only saw Tang San talking with Seagod Douluo Bo Saixi while he lowered his own voice on purpose so that they wouldn’t be able to hear it. Looking at how Tang San laid down on the beach, the two girls quickly ran up to him.</p><br/><p>Tang San wouldn’t get up as he was very fatigued, “Don’t worry, I’m fine. Everyone passed the sixth trial, so I just want to sleep for a while. Zhuqing, when Mubai and others come back, just let them absorb all of their bestowed spirit rings, and let Rongrong hurry up and rest. Senior Bo Saixi said that our seventh trial will take place in seven days.”</p><br/><p>After talking, Tang San couldn’t hold back his fatigue, and just slept groggily.</p><br/><p>He only felt that he slept exceptionally well. No one disturbed him from start to finish. Although sleeping wasn’t the best way to restore spirit power, it was definitely a good way to restore spiritual force.</p><br/><p>Tang San felt that he slept for two days and two nights, and he woke up once it was the noon of the third day.</p><br/><p>He opened his eyes in a blur. Maybe it was because he slept for too long. Tang San felt that his head was somewhat heavy, but the head-splitting pain before he slept was now gone. His spirit power had also been completely restored.</p><br/><p>There seemed to be something cushioning his head. Soft and full of bounciness. When he was trying to raise his head, he bumped into a pair of even softer peaks.</p><br/><p>“Ge, you’re awake.” There’s only one person in Shrek Seven who used ‘Ge’ to call Tang San. He would know wtihout even looking. Connecting what he touched and the voice together, it wasn’t hard for him to know just what he bumped into. Tang San was a bona fide virgin, but being with Dai Mubai, Oscar and Ma Hongjun for this long, he would know some of the matters between men and women.</p><br/><p>“Xiao Wu, how are you outside?” He was naturally referring to Xiao Wu’s soul.</p><br/><p>Xiao Wu was bending over to look at Tang San with a lowered head. Now she had the embarrassment of Tang San bumping into ‘a certain spot’ of hers, and straightened herself before helping Tang San up.</p><br/><p>“You slept so long so I came out and get some air. There are no beds and pillows here. I’m being here with you so you can sleep a little better.” No questions asked, the cushioning that Tang San felt which were so comfortable would be Xiao Wu’s toned thighs.</p><br/><p>“Little San has woken up!” It wasn’t clear who shouted it. In just a rush, everyone circled him without a single member short. However, the way they looked at Tang San felt a little strange to him. In those eyes, they were filled with rage and dissatisfaction.</p><br/><p>“What’s up with all of you?” Tang San asked in confusion.</p><br/><p>The usually candid Oscar was actually being fierce, “Little San, since you’re awake, it’s time for us to settle our scores.”</p><br/><p>“Scores? What scores?” Tang San asked with curled brows.</p><br/><p>Oscar spoke, “The score of not trusting your partners.”</p><br/><p>Tang San smiled bitterly, “Little Ao, do you have a fever or something? How can you say such a nonsense? What’s the start of your claim?”</p><br/><p>Oscar spoke with displeasure, “Alright, Little San, don’t fool around with us. We’re not as smart as you, but we’re not stupid either. Hearing what Zhuqing and Xiang Xiang described of your fight with Bo Saixi, we’re still not clear. Are we still your siblings? Admit it, were you going to face Bo Saixi alone since the very start of the plan?”</p><br/><p>Tang San was speechless for a moment. Bo Saixi promised him to keep it a secret, but his partners had seen through it all, which made him feel helpless. At this point he could only play dumb.</p><br/><p>“Little Ao, what are you saying? Who do you take me for? Although I think my talents are good enough, I’m not self important to the point of thinking I could fight against a Pinnacle Douluo. You think I wanted to face Bo Saixi alone, don’t you! Don’t you forget, my trials are Seagod Nine Trials. When we were all running, Bo Saixi was locked onto me like she was making me her target. I wanted to get the hell away if only I even could! Once being locked on by that strength of hers, if not for my Golden Invincibility, you would be able to see me.”</p><br/><p>Zhu Zhuqing spoke as if being completely in the know about things, “Seagod Douluo’s strength was too scary.” She saw with her own eyes how Bo Saixi’s slap sent Tang San into the ring shaped sea and bevelled it. That was simply a power of the skies and lands.</p><br/><p>“Really, Little San? You’re not covering things up, are you?” Dai Mubai also opened his mouth.</p><br/><p>Tang San spoke matter of factly, “Boss Dai, you still don’t know me? When did I tell lies before? For the sixth trial that couldn’t surely be passed with all of us working together, had turned into something that was heaped onto me alone. If I chose to face her alone, it would be like quenching thirst with poisoned wine. Speaking of which, luck played a very large factor this time. If the seven sacred pillars’ Guardian Douluos weren’t there to get used by me, then we might’ve really failed. I can almost be sure that Bo Saixi would’ve easily caught you if she took care of me.”</p><br/><p>Dai Mubai nodded, and said, “Very well. We’ll believe in you for now. But you must remember, LIttle San. We siblings are one. If there’s any danger, it’s not your own affair. If you really intend sacrifice your safety to bring us ours, then we’re not going to be siblings any longer. Do you understand?”</p><br/><p>Tang San replied earnestly, “We’re all siblings who can leave our backs to each other. I understand what you mean, Oh, that’s right. Rongrong, Xiao Wu, what are the contents of our seventh trial? Senior Bo Saixi said she would let take the trial in seven days.” He finally managed to blur his way across and switched topics. He didn’t want to keep talking about it, because if a hole in his argument popped up, his partners wouldn’t let him go.</p><br/><p>Xiao Wu spoke calmly, “Don’t ask me. My trial is just to follow you. I don’t have notifications.”</p><br/><p>Ning Rongrong spoke curiously, “Brother San, I also want to ask you about that. My seventh trial’s contents notification is to assist Tang San in completing the seventh trial. Take a look.”</p><br/><p>Upon hearing what they said, Tang San himself also got curious. He used spirit focus on his trident brand. As everyone watched, Tang San raised his head and spoke in a deep voice, “Seagod Seventh Trial, Divine Tool, Unsheathe, Seagod’s Trident”</p><br/>\n</div>"}