{"title": "Chapter 261", "id": 261, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-261", "volume_title": "Volume 3", "body": "<h1>Chapter 261</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 261</p><br/><p>Tang San and Bibi Dong’s First Fight</p><br/><p>(TL by Bagelson)</p><br/><p>“No——”</p><br/><p>Chrysanthemum Douluo watched the wide golden light polearm thrust out from Ghost Douluo’s back, intense golden light instantly spreading to each part of Ghost Douluo’s body, and he couldn’t help roaring furiously. His speed reached the limit, and from his hand his Odd Velvet Sky Chrysanthemum flew out, straight towards Tang San.</p><br/><p>But he understood that, at this moment, everything was already too late. Title Douluo Gui Mei no longer had any chance to return alive. The death energy his body radiated had instantly been evaporated by the giant polearm. Ghost Douluo’s body was already completely frozen, unable to move a step.</p><br/><p>The Seagod Trident, one hundred eight thousand jin heavy, let alone when Ghost Douluo was already corroded by the Seagod’s Light, all his death energy substantially routed, even if his body still maintained ideal condition, how would it be possible to blood the Seagod Trident with a physical palm. Tang San’s spirit power wasn’t much lower than his, and his strength was even above his, plus the Seagod Trident’s complete power unleashed, even the Continent’s once number one power Tang Chen needed to use a divine tool of similar quality to block.</p><br/><p>Pu—— Ghost Douluo’s body was madly purified by the Seagod’s Light, turning into a wisp of black smoke rising into the air, a black spirit bone falling from his body. Pulling back the Seagod Trident, the left prong just pulled on that spirit bone, and at the same time, teleportation launched. The next moment, Tang San was already a hundred meters away. He didn’t approach the two forest kings, but rather quickly retreated. Because, if he charged forward, his purpose would be revealed, and would moreover expose himself to the attacks of five Title Douluo including Bibi Dong. But by withdrawing, not only could he pull open the distance by a step, he could simultaneously make the opponents hesitant. From the fact that Bibi Dong still hadn’t acted, one could see that she was afraid something would happen on Da Ming and Er Ming’s side.</p><br/><p>Several loud sounds erupted from Tang San’s previous location, especially that full force Odd Velvet Sky Chrysanthemum created a hundred meter diameter hole in the surroundings.</p><br/><p>“Old ghost!”</p><br/><p>Chrysanthemum Douluo cried out, throwing himself to where Ghost Douluo just died, shuddering with tears falling from his eyes.</p><br/><p>He and Ghost Douluo had been together for more than sixty years, a lifetime. Their feelings were quite deep, even surpassing blood related brothers. Now seeing Ghost Douluo suddenly die in front of him, not even leaving a corpse behind, Chrysanthemum Douluo was in pain worse than death.</p><br/><p>Whether to Chrysanthemum Douluo or to the others, all this happened too fast, almost so they now still hadn’t reacted. From the appearance of that cloaked figure to the death of Ghost Douluo, it had all passed in a flash. Instantly killing a Title Douluo was inconceivable. Even if it was a sneak attack, it was still unheard of. Even though Bibi Dong was confident that her strength was unreasonable, she would still need to use her strongest spirit abilities to have a chance of instantly killing a power on the Title Douluo level.</p><br/><p>That Tang San could do it naturally wasn’t because his strength surpassed Bibi Dong’s, but to a very great degree due to luck, and the Seagod Trident’s restraint to Ghost Douluo being too severe, plus attacking from ambush, had all established this move. Of course, that Ghost Douluo knew nothing of the Seagod Trident, also became an important factor.</p><br/><p>THe moment after teleporting, Tang San again vanished in the forest. The Blue Silver Domain spread out, easily hiding his aura, and at the same time restarting the Vast Sea Barrier let him hide once again.</p><br/><p>Without looking at the spirit bone Ghost Douluo dropped, he just quickly stuffed it into his Hundred Treasure Purse, grabbing the Seagod Trident, Tang San quietly circled around to another direction. In order not to be discovered by Bibi Dong, he completely stored his own mental power within the Vast Sea Barrier’s protection. Like this, even if Seagod Douluo Bo Saixi was here, it would be very difficult for her to discover him as long as he didn’t attack.</p><br/><p>Ghost Douluo’s sudden death equally shocked Bibi Dong. She had just thought it was impossible for someone to stop her from taking those two forest kings. But the instant death of an elder, and the Ghost Douluo with the spirit fusion ability at that, immediately made her furious heart alert. The mental strength frozen on the two forest kings immediately spread out, searching vigilantly, and at the same time she ordered the four Title Douluo to stay close to her.</p><br/><p>They had already lost two Title Douluo in this operation, and even though Bibi Dong didn’t care about their lives, they were the core strength of the Spirit Empire. Of course she would feel her heart ache.</p><br/><p>“Your Majesty, old ghost…… you must avenge him!”</p><br/><p>Chrysanthemum Douluo who had always treated Bibi Dong’s orders as his life was now almost unable to contain himself, the other three Title Douluo also silently watched Bibi Dong, inwardly feeling a bit like sympathetic.</p><br/><p>“Elder Yue Gang, calm down. Ghost Douluo’s death grieves me, but this person is very strong, it’s possible they aren’t weaker than me. Stay within ten meters from me, and be careful. We’ll kill the two forest kings first, to avert more accidents.”</p><br/><p>Bibi Dong’s voice contained her mental strength, and with the sound wave strike, the four Spirit Empire elders’ minds shook. Chrysanthemum Douluo’s expression calmed a bit, but rancor in his eyes grew even deeper, sharply watching all around, wishing he could tear Ghost Douluo’s killer into ten thousand pieces.</p><br/><p>After Tang San retreated a distance, he didn’t have any contact with Da Ming and Er Ming, and also didn’t try launching any more attacks. The four Title Douluo Bibi Dong brough were cautiously observing the two great divine spirit beasts, and he stayed motionless, quietly watching.</p><br/><p>Da Ming and Er Ming personally saw Ghost Douluo being killed. They were spirit beasts, especially sensitive to scent, and even though Tang San held the Seagod Trident, wrapping himself up in the cloak, they still immediately identified Tang San’s smell. The two great divine beasts’ eyes instantly brightened.</p><br/><p>As they say, adding flowers to brocade is easy, sending charcoal in a snowstorm is difficult. When besieged by this many Spirit Hall experts, that Tang San could come in time, warmed the hearts of the close to despair two great divine beasts. They felt even more that Xiao Wu didn’t pick the wrong person. And the strength Tang San showed shocked them. Even they couldn’t help shivering from the Seagod Trident’s light.</p><br/><p>Hope reignited, Da Ming and Er Ming looked at each other, then turned from sitting to crawling. Faint energy fluctuations began to condense around them. They say a centipede dies but never falls, even more so for formidable hundred thousand year spirit beasts. Even though they were deeply wounded, their potential overdrawn, their auras again went from chaotic to serious. Tang San’s appearance, besides giving them hope, also gave confidence. Not confidence of surviving, but confidence of not becoming Bibi Dong’s spirit rings.</p><br/><p>Bibi Dong’s expression hidden under the purple carapace was a bit ugly. The originally perfect plan was wrecked by the sudden enemy appearance. Now waiting until the two great divine beasts died on their own from the poison wasn’t realistic. Since that hidden enemy could escape her mental detection, his strength was obvious. Just in case he finally attacked and killed the two spirit beasts, even if it was just one, it would still be an enormous loss to her. THat person was very fast, and could hide as well, his attack strength was also so powerful. It was very possibly an agility attack Title Douluo. But, in Bibi Dong’s impression, agility attack types weren’t that powerful.</p><br/><p>The Seagod Trident also equally shocked her. She was someone who approached that boundary, and equally fully rejected that sacred aura, that trident was a divine instrument, there was no doubt about it.</p><br/><p>While moving forward, Bibi Dong’s mental power simultaneously reached the ears of the four Title Douluo around her,</p><br/><p>“I will soon attack the two forest kings. You four guard in all directions, now matter in which direction that person appears, you must block him. Until I’ve killed them both. Understood? Ghost Douluo’s death was because of the sneak attack and attribute restraint, you don’t have to fear. When you’re prepared, it won’t be so easy for that person to kill you. Don’t dishonor your status as Title Douluo.”</p><br/><p>The stronger they were, the more accurate their judgement of the opponent. Bibi Dong saw very accurately, even though Tang San was strong, it wasn’t really possible for him to ambush four ready Title Douluo. Instantly killing Title Douluo wasn’t something that could be done just any time.</p><br/><p>Da Ming and Er Ming fixedly watched the approaching Spirit Empire people, constantly giving low roars. Er Ming was surrounded by a rising yellow light, cyan light flickering around Da Ming, especially the horns on the bull head even more caused angry ripples.</p><br/><p>Bibi Dong’s eyes were completely serious. Facing two hundred thousand year spirit beasts counterattack at death’s door, even she wasn’t fully confident, even more so when there was a hidden enemy nearby.</p><br/><p>In a flash, Bibi Dong leaned forward close to the ground, her purple carapace instantly spreading, her whole body becoming an enormous spider, the green hairs on her eight spider legs simultaneously turning purple, she emanated a faint purple light, and where it passed, everything withered.</p><br/><p>The other four Title Douluo simultaneously moved a couple steps sideways, getting away from her purple light. This was Bibi Dong’s spirit avatar, Death Spider Emperor.</p><br/><p>The purple light instantly grew more intense, and the eighth black spirit ring around Bibi Dong suddenly flashed, dazzling purple light congealed on the left side of her body, light and shadow playing, suddenly another identical Death Spider Emperor.</p><br/><p>This was the eighth spirit ability of Bibi Dong’s first spirit, Spider Emperor Clone. Effect: the spirit ability creates a clone with one hundred percent of the main body’s strength, without intelligence, must be controlled.</p><br/><p>This one hundred percent strength wasn’t just the physical body, but also included spirit abilities. Of course, only the previous seven spirit abilities, not the eighth and ninth.</p><br/><p>The spider emperor clone leapt under Bibi Dong’s control, stepping in front of her, and accelerating forward along with the main body, charging towards Da Ming and Er Ming like two purple phantoms.</p><br/><p>The third spirit ability flashed, and two purple spider webs shot out simultaneously, shrouding Da Ming and Er Ming in a dense purple energy. Those spider webs quickly expanded in midair, and even though Da Ming and Er Ming were enormous, when the spider webs reached them they were already large enough to wrap around.</p><br/><p>At the same moment, Bibi Dong’s main body and the Spider Emperor Clone’s fourth spirit ring brightened, and one more than one meter long dark purple spike after another covered every piece of the two bodies, the purple carapace also becoming especially thick. This was her fourth spirit ability, Thistle Spider Armor. This was a purely defensive ability, but at the same time the purple spikes were poisonous.</p><br/><p>Under these circumstances Bibi Dong also used her full strength, attacking without neglecting defense.</p><br/><p>Just at this moment, Bibi Dong’s charge suddenly slowed, because her mental power suddenly sensed two mental fluctuations appear within range, and the two fluctuations connected with Da Ming and Er Ming. This sudden mental wave was extremely high level, even the other four Title Douluo couldn’t sense it, let alone interrupt it.</p><br/><p>What was he doing? This was the thought that Bibi Dong couldn’t suppress, and her original charge also instantly halted. The next moment, she clearly saw the two great divine beasts’ eyes brighten.</p><br/><p>Two spheres of yellow green light suddenly appeared behind them, immediately spreading out in the air, just in time to block the two spider webs she launched. Using spider webs against spider webs, it was Tang San’s Spiderweb Restraint.</p><br/><p>Launching the attack, Tang San also appeared at the same time. But the next moment, Tang San, Da Ming, and Er Ming disappeared simultaneously.</p><br/><p>This time, Tang San directly appeared golden blue, golden blue light spreading out, covering the sky and the earth, instantly transforming the surroundings into a golden blue sea. It was the Blue Silver Domain’s Boundless Nature.</p><br/><p>Da Ming and Er Ming roared at the same time, the Slowing and Gravity Domains also simultaneously launching. Cyan and yellow light halos extended along with the Blue Silver Domain. Whether Bibi Dong or the four Title Douluo, immediately felt like their bodies had frozen. Under Da Ming and Er Ming’s full strength, their movements slowed completely.</p><br/><p>“Attack!”</p><br/><p>Bibi Dong roared. Even though she had brought six Title Douluo, none of them had a domain. Only she herself possessed that ability. Intense purple light spread out from her, intent on using domain against domain. But, in the end Bibi Dong couldn’t get her way. The purple light she released was blocked by a thriving vitality, and simply couldn’t spread to Da Ming and Er Ming.</p><br/><p>Indeed, Bibi Dong’s domain was very strong, absolutely surpassing Tang San or the two spirit beasts. But, in one against three, and moreover confronting three different kinds of domains, it was instantly difficult for her to avoid being suppressed. Even more when this was the Star Dou Great Forest, the ideal environment for the Blue Silver Domain. Her domain was completely blocked. At the same time the golden blue world lost the figures of Tang San, Da Ming and Er Ming.</p><br/><p>Bibi Dong’s domain was called Death Domain, the innate domain of the Death Spider Emperor, with extremely powerful effects, altogether three once she had reached her current cultivation. All her own attributes were amplified by ten percent, all the enemy’s attributes reduced by twenty percent, and were unable to use any stealth or teleportation abilities within its range, and at the same time caused mental deterrence, her own mental strength boosted by twenty percent, the enemy’s mental strength reduced by twenty percent. But the most terrifying effect was the extremely toxic environment.</p><br/><p>Wherever the domain reached was filled with the Death Spider Emperor’s poison. Extreme corrosion and diffusion, and could also lower the enemy’s speed by ten percent. If they were poisoned, their bodies would constantly weaken, until death. If it was used in battle, it was a catastrophic existence to common soldiers.</p><br/><p>Da Ming and Er Ming had also previously lost out because of this domain, and adding in Bibi Dong’s own formidable attack abilities, they had ended up like this.</p><br/><p>But no matter what was said, a formidable domain would still have effect within the enemy’s domain. The Blue Silver Domain drew support from the Star Dou Great Forest’s countless plants to form a barrier of life, using the formidable vitality to keep away the death domain’s death energy. Influenced by the Slowing and Gravity Domains, Bibi Dong’s was enormously restricted, Da Ming and Er Ming’s domains were equally powerful, and could not only influence living bodies, but also energy forms. The three great domains released simultaneously not only made those four Title Douluo unable to display their actual level, but simultaneously also resisted Bibi Dong’s domain.</p><br/><p>Bibi Dong didn’t advance recklessly, the scene of Tang San killing Ghost Douluo had left too deep of an impression on her. Even though her domain couldn’t restrain the opponent, Tang San’s Blue Silver Domain was also restrained by her, unable to envelop her. But, her heart was already in chaos. Her mental lock on Da Ming and Er Ming’s mental signatures had been forcefully broken when they were enveloped by the Blue Silver Domain. In other words, she had already lost the two great divine beasts’ position.</p><br/><p>These circumstances were of course caused by Tang San. Actually, Tang San wasn’t any less shocked than Bibi Dong. When he saw Bibi Dong before he had only felt that this Spirit Hall Supreme Pontiff was powerful, but he had no idea to what degree. But it may be assumed it was still Title Douluo level strength, she was after all the same age as Grandmaster.</p><br/><p>But, when they met again this time, Tang San’s mental strength had already reached the boundless level, and he immediately saw some clues. Even though Bibi Dong meticulously concealed her presence, that wasn’t effective on Tang San who had mental strength of equal level. Tang San clearly sensed that Bibi Dong’s spirit power had at least reached rank ninety eight. Even if it wasn’t higher than Seagod Douluo Bo Saixi, it still wouldn’t be much different. Reaching this level at her age, Tang San was clearly shocked.</p><br/><p>If Bibi Dong didn’t possess such powerful strength, Da Ming and Er Ming facing just six Title Douluo, it wouldn’t be easy to defeat them in the Star Dou Great Forest, and running away wouldn’t be a problem.</p><br/><p>Only, even though Bibi Dong was powerful, the feeling she gave Tang San was that she relied mainly on control, her attack strength was by far not equal to Seagod Douluo Bo Saixi. Most importantly, Tang San quietly noticed that Bibi Dong even more hated the Seagod Trident he held. Tang San used his Blue Silver Domain’s Boundless Nature at the ideal moment, thus breaking Bibi Dong’s lock on the two spirit beasts.</p><br/><p>“Running won’t be that easy.”</p><br/><p>Bibi Dong laughed in anger, slightly swaying, withdrawing her spirit avatar, but she was still protected by that Death Spider Emperor.</p><br/><p>The dark purple carapace quickly withdrew, and in the blink of an eye, she had again recovered to her original elegant appearance. On her forehead, a spider shaped purple black pattern brightened, and immediately, her surrounding domain expanded once again, enveloping the four Title Douluo, driving off the influence of the Blue Silver Domain. At the same time, Bibi Dong’s body changed again, the spider brand on her forehead instantly turning dark green, a crystalline deep green light emanating from her. This time, both her legs didn’t change, but on her back appeared three pairs of deep green spider legs, both her arms transforming into dark green lances, her lower body completely covered by a layer of dark green light.</p><br/><p>Black, black, black, black, black, red, red, seven spirit rings neatly appeared around her. The third spirit ring shone at the same time it was released.</p><br/><p>That’s right, this was Bibi Dong’s second spirit. Her twin spirits were very different from Tang San’s. Tang San’s Blue Silver Domain and Clear Sky Hammer had no mutual connection. One was a plant type spirit, one was a powerful tool spirit. But Bibi Dong’s was different. Her two spirits were both spider types. Even stronger than the Man Faced Demon Spiders had seen. It was a true spider emperor, in some sense, it was the regent of bug type spirit beasts.</p><br/><p>Her first spirit was the Death Spider Emperor, and her second spirit was the Soul Eating Spider Emperor, and as her current spirit rings showed, this second spiri was clearly cultivated only after the first reached nine rings.</p><br/><p>Alongwith the third spirit ring shining, Bibi Dong’s second spirit, Soul Eating Spider Emperor’s third spirit ability launched. Ring after ring of deep green light spread out from under her feet. Absolutely don’t think that this was just a third spirit ability, in fact, after first having a nine ring spirit and then adding spirit rings to a second spirit, each spirit ring with at least fifty thousand year cultivation, the strength wouldn’t be a bit inferior to the first spirit’s eighth spirit ability. Consequently, even though Bibi Dong now only had seven spirit rings, the strength of this second spirit was stronger than the nine rings of her first spirit. After all, even though the spirit had changed, her spirit power was still no different.</p><br/><p>A strange scene happened. Even Tang San’s Blue Silver Domain couldn’t stop that dark purple light from spreading. As it spread, the ground began to shudder violently, and one after another, half meter diameter dark green poisonous spiders began to crawl out. These dark green poison spiders seemed a bit illusory, but they still weren’t formed from energy, but rather death energy gathered together and influenced by Bibi Dong’s spirit ability.</p><br/><p>Star Dou Great Forest was a place where the strong were prey to the weak, and each day countless spirit beasts killed each other and died. Bibi Dong’s spirit ability drew out this death energy and transformed it into these deadly poisonous spiders.</p><br/><p>The devil spiders really were too many, they were everywhere, and began to swiftly crawl out, madly rushing through the forest, looking for tracks of Tang San and the two great divine beasts under Bibi Dong’s careful mental control. This was Bibi Dong’s second spirit’s third spirit ability, Devil Spider Summoning.</p><br/><p>Perhaps these devil spiders wouldn’t be able to find Tang San, but it would be very easy for them to pick up the scent of Bibi Dong’s poison on the Titan Giant Ape and Sky Blue Bull Serpent. Bibi Dong couldn’t see through the Blue Silver Domain, but relying on these spiders she could once again target the two great divine beasts, and then, she absolutely wouldn’t give Tang San a second chance to confuse her.</p><br/><p>Bibi Dong couldn’t see Tang San, but Tang San saw very clearly inside the domain. Even though Bibi Dong used huer domain to protect her people from the Blue Silver Domain’s influence, but through the Blue Silver Domain, Tang San’s mental strength was displayed to its greatest degree, comprehensively observing these people.</p><br/><p>A frontal confrontation wasn’t realistic, Tang San originally only planned to bring away Da Ming and Er Ming. Seeing the devil spiders starting to spread in all directions, Tang San gave a cold snort. Want to draw out my attack? The Seagod’s Light is the nemesis of these death energy devil spiders. But if I attack, wouldn’t I give you the chance to target me? You have devil spiders, don’t tell me I don’t have help? Don’t forget, this is the Star Dou Great Forest.</p><br/><p>On the ground, blue silver grass began to frantically grow, turning into long vines, engulfing those devil spiders like ocean waves. A couple of transformed blue silver grass of course wasn’t enough to catch these savage creatures, but if there were ten, a hundred? Stimulated by the Blue Silver Emperor’s imperial aura, the blue silver grass, possessing the most powerful vitality in the Star Dou Great Forest, began to counterattack.</p><br/><p>Even though the devil spiders Bibi Dong summoned were numerous, how could it compare to the blue silver grass in the giant forest? The surging breath of vitality from the blue silver grass became the nemesis of these devil spiders, and one draining golden thread after another swiftly fell on them, extracting their energy and again replenishing the two great divine beasts. Aided by the Blue Silver Emperor’s Binding, Da Ming and Er Ming quickly reached Tang San. They had launched their final attacks, and no didn’t have much strength left, and could only leave it to Tang San.</p><br/><p>Tang San understood. Da Ming and Er Ming’s gravity control and slowing domain couldn’t be maintained for too long. If these two domains lost their effect, it was impossible for just his Blue Silver Domain to resist Bibi Dong. They had to leave as soon as possible. But, the Blue Silver Domain required his full control to block Bibi Dong’s line of sight. If he brought Da Ming and Er Ming away at this time, then Bibi Dong would definitely sense the domain weakening, and naturally wouldn’t hesitate to attack.</p><br/><p>Making a prompt decision, Tang San immediately drew out Xiao Wu from the Hundred Treasure Purse. Light flashed, and Xiao Wu’s soul returned to her body.</p><br/><p>“Da Ming, Er Ming, how did you end up like this?”</p><br/><p>Xiao Wu saw the two comrades she had grown up with so miserable, and her eyes immediately reddened.</p><br/><p>And Da Ming and Er Ming couldn’t help being shocked on seeing a living Xiao Wu, stupidly speechless.</p><br/><p>Tang San spoke in a low voice:</p><br/><p>“This isn’t the place to talk. Xiao Wu, you’re also familiar with the terrain. Quickly get them away. I’ll watch your backs and stop Bibi Dong for a while. As long as you can get five li away, I’m sure I can use the Blue SIlver Domain to block her mental power from locating you. Hurry.”</p><br/><p>Xiao Wu anxiously said:</p><br/><p>“Then what about you?”</p><br/><p>Tang San gave a soft smile, pointing to his eight spirit rings,</p><br/><p>“Don’t you believe I have the strength? I’m not the Tang San from before, perhaps I still won’t be able to beat Bibi Dong, but I can run away from her. The Star Dou Great Forest is the place that suits me the most. Don’t forget that I have ways to keep her from finding me.”</p><br/><p>Xiao Wu saw the confidence in Tang San’s eyes, and knew that at this moment there was no room for her to hesitate. Tang San had three great life saving trumps in the Invincible Golden Body, Teleportation, as well as the Vast Sea Barrier. It really was impossible for Bibi Dong to keep him from leaving. Even more when he had the protection of the Seagod Trident.</p><br/><p>“Ge, remember, we are one.”</p><br/><p>Saying this, Xiao Wu brought the strongly encouraged Da Ming and Er Ming to quickly move away. Da Ming and Er Ming were big, but Xiao Wu’s physical toughness was also a very different thing now. One hand supporting each of them, lending them strength, greatly lowering the two spirit beasts’ burden and making them move quickly.</p><br/><p>Tang San of course understood what Xiao Wu said before she left. She was telling him that if he died, she wouldn’t survive either. They of Course didn’t need to worry about being unable to contact each other. Even though Xiao Wu’s soul had become a lot stronger, even after returning to her body, she still couldn’t move more than ten li from Tang San, and Tang San could also at any time rely on the connection between their souls to find her.</p><br/><p>Da Ming and Er Ming left, and Tang San immediately focused, thinking to himself, Bibi Dong, I’ll play with you properly, and also take a look at just how strong you are.</p><br/><p>Isolated by the Blue Silver Domain’s screen as well as Tang San’s mental strength, Bibi Dong of course didn’t know what was happening over there. Tang San exploiting the Blue Silver Emperor in the forest to stop her summoned devil spiders made her furious. She roared,</p><br/><p>“Prepare to attack! After I cut open his domain, you attack with your full strength.”</p><br/><p>“Yes!”</p><br/><p>The four Title Douluo weren’t any less angry than Bibi Dong. They were the powers of the Spirit Empire, more than rank ninety Title Douluo, spirit masters everyone looked up to. Being toyed with by one enemy, so much that Ghost Douluo had been instantly killed, this grievance might not be settled even by tearing the opponent into ten thousand pieces. The four rubbed their fists and wiped their palms, at the same time fully using their spirit avatars, preparing to attack at any time.</p><br/><p>All this was seen by Tang San through the weakening Blue Silver Domain. Want to kill me by force? Fine! I’ll let you see my true strength.</p><br/><p>Drawing a deep breath, Tang San’s sensed the Slowing and Gravity Domains gradually disappear, and raised the Seagod Trident. He had already used the power of the trident once today, but at that time he hadn’t met any resistance, and it wasn’t very tiring to him.</p><br/><p>Along with the Seagod’s Light spraying out, the trident brand on Tang San’s forehead and the Seagod Trident in his hand shone simultaneously. His eyes were now completely golden, the Eight Spider Lances on his back supported him, the Seagod Trident pointing forward, and the largest central prong erupted with intense golden light, turning into an alarming rainbow, stabbing straight at Bibi Dong outside the Blue Silver Domain.</p><br/><p>Tang San noticed that Bibi Dong’s spirit was also of the evil type, the Seagod’s Light should have a restraining effect on her. Drawing support on the Seagod Trident, the divine light released was truly considered divine.</p><br/><p>The violently furious Bibi Dong’s expression changed, and the six spider lances behind her as well as her similarly transformed arms simultaneously gathered in front of her. Eight lance tips on the ground, intense deep green light suddenly rising along with her first spirit ring flashing. The eight lances rose simultaneously, and instantly, a half moon shaped dark green light cut straight forward. Just in time to collide with the golden light released from Tang San’s Seagod Trident.</p><br/><p>With a loud explosion, the violent collision instantly put their two domains in disorder. Tang San’s Blue Silver Domain degree of chaos was a bit more obvious. Within the domain, he heavily retreated three steps before standing firm, his face deathly pale, and couldn’t help whispering:</p><br/><p>“Such evil energy.”</p><br/><p>If what Ghost Douluo had could be said to only be ghost energy shaped as a spirit, then, what Bibi Dong possessed was the energy of evil, such an extremely pure wickedness Tang San had only felt when confronting the Slaughter King, when the Slaughter King still wasn’t Tang San’s great grandfather Tang Chen, and still hadn’t woken up.</p><br/><p>The evil aura Bibi Dong emanated was even more pure than the Slaughter King’s at that time, even more enormous. Just as Tang San judged, her spirit power really was too formidable, and even with the Seagod Trident’s helping to dissolve the majority of the impact, he was still forced back three steps, his body already injured.</p><br/>\n</div>"}