{"title": "Chapter 264", "id": 264, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-264", "volume_title": "Volume 3", "body": "<h1>Chapter 264</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264</p><br/><p>Resurrection Ground, Sunset Forest</p><br/><p>(TL by Bagelson)</p><br/><p>Even though Tang San had just added his first spirit ring to the Clear Sky Hammer, if his circumstances were those of an ordinary spirit master, he would just now discover the reason why the body couldn’t endure the strengthening.</p><br/><p>Ordinary Title Douluo, even with an ideal spirit ring configuration, had nine rings of: yellow, yellow, purple, purple, black, black, black, black, black. It was practically impossible for hundred thousand year spirit bones to appear. They might have two spirit bones, and that alone would be quite astonishing.</p><br/><p>But Tang San? Tang San now had a full spirit ring configuration on his first spirit Blue Silver Emperor of: yellow, yellow, purple, black, red, red, red, red, red. The first three spirit rings were normal, but from the fourth ring onwards, he was a completely level surpassing existence. Moreover, there were even five hundred thousand year spirit rings.</p><br/><p>According to the total spirit ring cultivation age limits, one Title Douluo with an ideal configuration absolutely wouldn’t have a total spirit ring cultivation age past two hundred thousand years, even surpassing a hundred fifty thousand years was rare.</p><br/><p>But Tang San? His nine spirit rings total cultivation age was absolutely past five hundred thousand years, more than two point five times that of an ordinary spirit master. Even more, his second spirit’s first spirit ring was a hundred thousand year level, adding another hundred thousand years of cultivation. His total spirit ring cultivation age was triple that of common Title Douluo, higher than six hundred thousand years!</p><br/><p>This still wasn’t enough, don’t forget that Tang San already possessed as many as six spirit bones. The external spirit bone Eight Spider Lances was just in the process of evolving along with Tang San’s cultivation breaking through the Title Douluo level. After it finished, it could also reach the level of a hundred thousand year spirit bone.</p><br/><p>Besides this extra spirit bone, Tang San still possessed the hundred thousand year level Sky Blue Bull Python right arm bone, the Titan Giant Ape left arm bone, the Evil Spirit Orca left leg bone, and the Blue Silver Emperor right leg bone. A total of four hundred thousand year spirit bones. The only one that wasn’t at that level was the mind condensing wisdom skull bone that in itself was produced by a more than fifty thousand year spirit beast, plus, after fusing with the Vast Sea Cosmic Shroud, who dared say its effect was any less than the four hundred thousand year spirit bones? In combat, its effect would on the contrary be ranked first.</p><br/><p>Under such circumstances, Tang San’s physical attribute growth surpassed ordinary Title Douluo by more than twice as much, and that his body could support this already proved his formidable power.</p><br/><p>To others, these circumstances might be fatal, but before leaving Seagod Island, Tang San had already found a way to resolve it.</p><br/><p>After having accepted the two forest kings’ sacrifice, his mental strength and spirit power had recovered to their peak condition, affecting the Seagod’s Light to scatter, directly infusing in the Seagod Trident’s Seagod’s Heart next to him. Immediately, brilliant light blossomed, completely enveloping Tang San.</p><br/><p>Bo Saixi was right, humans had limits to physical strengthening, the body had an upper bound in what it could endure. But having drawn the Seagod Trident, after experiencing the first seven of the Seagod Nine Trials, Tang San could be said to already have set one foot into the realm of divinity. Even though his current cultivation was far from enough, the god’s breath he possessed was the most orthodox Seagod’s energy. There was absolutely no need to doubt this bit.</p><br/><p>Under the illumination of the Seagod’s Light, Tang San immediately felt as if he had entered a giant smelting furnace. The red light from the two great divine beasts’ sacrifice had disappeared, but his body emitted an even more intense golden flame.</p><br/><p>The hottest parts of his body were where the six spirit bones were. Vaguely, he could see the blood vessels, muscles, and even bones squirming quickly at these positions.</p><br/><p>Violent pain constantly assaulted Tang San’s brain. Even though the Seagod’s Light was scorching hot, it was a lot more comfortable than the previous swelling pain, making Tang San feel as if he was soaking in a high temperature hot spring. The temperature might be high, but it could be endured.</p><br/><p>Tang San’s bones constantly issued toothache-inducing snapping sounds, his tendons and muscles releasing even more cracking. Soon the surface of his body bulged with muscles, becoming a terrifying muscle man. But very soon, illuminated by the golden light of the Seagod Trident, those swelling muscles again gradually calmed down, returning to Tang San’s original appearance, robust but not exaggerated.</p><br/><p>His bronze skin was washed with a faint golden color, not a metallic luster, but rather a sacred color.</p><br/><p>Tang San suddenly had an epiphany. He discovered that, after he had reached the limits of what he could endure, illuminated by the Seagod’s Light, he seemed to have completely transformed. Without need to ask, he could feel how his body had become immensely resilient.</p><br/><p>The two spirits completely withdrew into Tang San’s body, and he again returned to his original appearance, only his clothes were long since completely obliterated by the berserk energies, and all that remained was faintly golden skin.</p><br/><p>The Seagod Trident automatically fell into Tang San’s right hand, and a blending feeling spread through his whole body. He deeply felt how his affinity with the trident had increased another step.</p><br/><p>All this should have been perfect, but, after it was all over, Tang San’s deep eyes only held sorrow. Again stabbing the now dark Seagod Trident into the ground, taking Xiao Wu’s spirit bone that had been replaced in his left arm, and embracing Xiao Wu who was lying on the ground, he knelt with both knees, and bowed to the Sky Blue Bull Python and Titan Giant Ape that had already returned to their original forms.</p><br/><p>He knelt thrice and knocked his head against the ground nine times.</p><br/><p>Tang San’s eyes flashed with a resplendent ice cold light,</p><br/><p>“Brothers, you won’t have died in vain. I will first resurrect Xiao Wu, and then avenge you. The spirits of heroes do not leave, once I’ve formally inherited the place of the Seagod, I will definitely bring you out to meet with Xiao Wu again.”</p><br/><p>Finished paying his respects, Tang San placed Xiao Wu on the ground, and then gingerly picked up Da Ming and Er Ming’s bodies and placed them in his Wishful Hundred Treasures Purse, resisting the threatening tears. He had not yet completed Da Ming and Er Ming’s last wish, so Tang San felt he still wasn’t qualified to cry.</p><br/><p>Even though the process of absorbing spirit rings through Sacrifice was very fast, from start to finish it had still taken almost an hour. Elsewhere, Bibi Dong might come looking at any time. This wasn’t a place that matched Xiao Wu’s dreams, so therefore he had to leave, and find an undisturbed location to resurrect Xiao Wu.</p><br/><p>Placing the sleeping Xiao Wu into the Wishful Hundred Treasures Purse, raising the Seagod Trident, Tang San faced Bibi Dong’s direction and looked deeply,</p><br/><p>“Bibi Dong. We will meet again.”</p><br/><p>He instantly soared upwards. Breaking through nine rings, now rank ninety one formidable spirit power poured out, and as Tang San leapt up his mental strength spread out, isolating all mental probes from the outside world, and left into the distance.</p><br/><p>He had to leave this place, leave the Star Dou Great Forest. In Tang San’s heart, Xiao Wu’s life was far more precious than his. He finally had the opportunity to resurrect her, and he absolutely wouldn’t let anything go wrong. A portion of the Star Dou Great Forest was within the Spirit Empire. As empress, Bibi Dong might at any moment dispatch an army of spirit masters to search for him. This undoubtedly wasn’t a safe place to resurrect Xiao Wu. Therefore, he thought of another place. There, he had practically absolute confidence in helping Xiao Wu resurrect without being disturbed.</p><br/><p>Almost at the same time as Tang San left, elsewhere, Bibi Dong also ended her cultivation, opening her eyes.</p><br/><p>Compared to her fury in the battle with Tang San before, she was now a lot calmer, gazing in one direction, speaking in a low voice:</p><br/><p>“Did you all feel that?”</p><br/><p>The four Title Douluo looked at each other, all nodding silently.</p><br/><p>Bibi Dong stood, her expression so grave it looked like her face might drip water,</p><br/><p>“Good, very good, stealing the spirit beasts necessary for my ambition, and even absorbing their spirit rings right in front of me. Tang San, you haven’t disappointed me. The speed of your growth far surpasses my expectations.”</p><br/><p>To the side, Chrysanthemum Douluo Yue Guan couldn’t help crying out,</p><br/><p>“Your Majesty, you’re saying, that person is Tang San?”</p><br/><p>Bibi Dong gave cold laugh,</p><br/><p>“Who else? He might not have expected that his identity would be revealed just because he absorbed the two spirit beasts’ spirit rings here. Only, I find it very strange, why wouldn’t those two forest kings even resist? How could he absorb two hundred thousand year spirit rings so quickly? His presence is already gone. He should have really run away.”</p><br/><p>Yue Guan blurted out:</p><br/><p>“Your Majesty, I don’t quite understand your meaning.”</p><br/><p>Bibi Dong swept him with a cold gaze. Ghost Douluo was dead, so without a doubt, Chrysanthemum Douluo’s value had dropped considerably, and right now she was also furious. If the Spirit Empire hadn’t just needed people, she really would have torn this idiot to shreds.</p><br/><p>“Do I even need to explain it? To be able to have the strength to contend with so many of us is admittedly related with the special effects of that trident, but how could he toy with you and block me without the strength of a Title Douluo? To be able to absorb two hundred thousand year spirit rings even as a Title Douluo, besides having twin spirits, can you think of any other explanation? On the entire Continent, besides me, the only other person with twin spirits is Tang San.”</p><br/><p>Yue Guan couldn’t help saying:</p><br/><p>“Coulnd’t others have helped him, and they absorbed the two spirit beasts’ rings? How old is Tang San now, not even thirty! How could he be a Title Douluo?”</p><br/><p>Having met Tang San not just once, he really couldn’t believe Tang San actually had Title Douluo level strength.</p><br/><p>Bibi Dong couldn’t stand it, with a sharp wave of her hand, Yue Gian’s body was instantly blasted away,</p><br/><p>“Idiot, back then, how many of you believed he could lead the Shrek Academy’s team to defeat our Spirit Hall’s Golden Generation? How many of you could have imagined that hundred thousand year spirit beast girlfriend sacrificing herself for him? Geniuses are those who do what others can’t. This person will inevitably become our most difficult opponent. More so than anyone. I didn’t expect him to be even harder to deal with than his father Tang Hao.”</p><br/><p>The other three Title Douluo looked at Bibi Dong on the verge of erupting, and kept quiet out of fear.</p><br/><p>All kinds of thoughts constantly echoed in Bibi Dong’s ming. Just go back like this? No, she couldn’t leave like this. The purpose of this trip still wasn’t reached. If a dreadful threat like Tang San hadn’t appeared, maybe she could still have looked for another chance to search for a hundred thousand year spirit beast, but now she clearly didn’t have the time. She had to reach the peak, and even more take that final step. Turning, Bibi Dong gazed towards the depths of the Star Dou Great Forest, her eyes flickering with cold light.</p><br/><p>Tang San of course wouldn’t give Bibi Dong another chance to find him. Leaving Star Dou Great Forest, he immediately flew into the sky, rushing in one direction.</p><br/><p>He had finally reached the Title Douluo realm all spirit masters dreamed of, but Tang San’s face always remained frosty. Even though spirit power was endlessly generated within him, more than twice as much as with eight spirit rings, pushing him to fly like a phantom through the air, and the spirit power moreover recovered faster than flying consumed, all this still didn’t make him feel excited. In his mind always echoed Da Ming and Er Ming’s words, and the scene of their blood red figures slowly fading.</p><br/><p>Xiao Wu was still unconscious, and Tang San had also suppressed her soul without letting it awaken. But reality nevertheless had to be confronted, Da Ming and Er Ming’s deaths would undoubtedly be a huge blow to her.</p><br/><p>But no matter what, he first had to resurrect Xiao Wu. Hatred had to be avenged, but not now. Even though Tang San believed that now that he had reached Title Douluo level strength, plus the Seagod Trident, he already had the power to fight Bibi Dong, but there was still a clear gap, and he moreover had to return Xiao Wu’s spirit ring. Without a full complement of rings, and with large numbers of powers next to Bibi Dong, vengeance was still far away.</p><br/><p>Flying without rest, supported by his formidable spirit power, Tang San flew for a full two days before finally reaching his goal. This was a place Bibi Dong wouldn’t find, because this was not only within the borders of the Heaven Dou Empire, but also extremely hidden.</p><br/><p>Still a large forest, on the surface it might not be much different from the Star Dou Great Forest, but if you looked carefully, the Star Dou Great Forest counted as a tropical rainforest, while here were more northern trees and plants. The only part that was the same was that this forest was covered with blue silver grass.</p><br/><p>Without pause, Tang San entered the forest, following a familiar path. He was even more familiar with this place than Star Dou Great Forest. If that forest was his tragedy, then here was his paradise.</p><br/><p>Here he had obtained large amounts of immortal grade medicinal herbs, helping the Shrek Seven Devils gain the strength to fight the Spirit Hall Golden Generation. Here, he had been able to lay a firm foundation to his cultivation after ice and fire refined his body like metal. This was also the place his mother was swiftly recovering, nourished by the Ice and Fire Yin Yang Well. Perhaps his parents could be reunited within his father’s lifetime. Indeed, this place was the Sunset Forest, once Dugu Bo’s cultivation ground, and also where Tang San’s parents lived in seclusion.</p><br/><p>The Sunset Forest was the place Tang San had chosen to resurrect Xiao Wu. There was no need to worry about spirit beasts bothering him near the Ice and Fire Yin Yang Well, and it was practically cut off from the rest of the world. And this was where Tang San’s parents were. Having been gone for almost five years, and finally returned to the Continent, how could he not first come see his parents? This was undoubtedly the best choice for resurrecting Xiao Wu.</p><br/><p>Tang San very soon arrived at that familiar mountain. Looking at it, nothing seemed to have changed. Tang San had used the Vast Sea Barrier the whole way, and hadn’t been blocked by any spirit beasts, smoothly reaching the foot of the mountain. Basically without need for the Eight Spider Lances, Tang San directly relied on the ability from his mother’s spirit bone to instantly reach the mountaintop.</p><br/><p>Looking down from the peak, he could clearly see how all kinds of plants already densely covered the basin surrounding the Ice and Fire Yin Yang Well, and even though it still couldn’t compare to the place Tang San once “looted”, without any immortal treasures, large amounts of high level medicinal plants still grew densely, and becoming a precious treasure of heaven and earth was just a matter of time.</p><br/><p>Tang San’s gaze didn’t linger on these herbs, directly looking at the edge of the Ice and Fire Yin Yang Well. With just a glance, he found what he was looking for.</p><br/><p>An enormous blue silver emperor, occupying several dozen square meters, each leaf two chi wide, with a clearly golden pattern twinkling in the sunlight. Even though the Ice and Fire Yin Yang Well was the host here, without a doubt, in terms of visual appearance, that immense blue silver emperor was the center of this valley.</p><br/><p>At the same time as Tang San saw her, the blue silver emperor’s leaves also moved, rising in the wind as if sensing something. Next to the blue silver emperor, a tall aged figure shot up. Even though he only had one arm and one leg, the power of his presence was still choking.</p><br/><p>“Who?”</p><br/><p>The shout shook the valley, and two ice cold eyes directly gazed at where Tang San was.</p><br/><p>In two days of flight, Tang San’s heart had amassed a deep mass of anger. Finally seeing his parents again, he couldn’t help feeling excited. Howling towards the sky and throwing himself down, as if he wanted to express the depression from Da Ming and Er Ming’s deaths.</p><br/><p>Hearing this howl, Tang Hao’s expression instantly changed. That howl like the cry of a heavenly dragon needed terrifying strength. Even in his flourishing stage he could have done no better. But, his ugly expression quickly changed yet again, first to surprise, then to ecstasy. And the giant blue silver emperor next to him was already dancing in the wind, fluttering with excitement.</p><br/><p>“Little San, it’s little San.”</p><br/><p>Tang San’s mother Ah Yin’s voice drifted out from the center of that blue silver emperor, and blue golden light blossomed from every leaf, condensing into a faint figure in the air, maybe around thirty, stunningly beautiful, gazing dazedly at the figure falling from the sky. Her voice was choked with emotion, only this energy form couldn’t shed tears.</p><br/><p>“Little San, it really is little San.”</p><br/><p>Tang Hao had already clearly seen Tang San, and Tang San had naturally also seen his father.</p><br/><p>In five years apart, Tang San discovered to his astonishment that his father not only hadn’t aged, but on the contrary seemed much younger. The once messy grizzled hair was now neatly combed, and most of it had turned back to black, the wrinkles on his face were also far fewer, and his muddy eyes had become bright and cheerful. Even in his excitement, every motion showed a grave presence.</p><br/><p>“Dad——, mom——”</p><br/><p>Tang San landed five meters away from Tang Hao and Ah Yin. Falling from the air, he landed directly on his knees, tearfully bowing to his parents.</p><br/><p>When together with his companions, Tang San was always the most intelligent one, the one who controlled the situation, the strongest. But, his heart still had a weak side, he was after all human! He could only hide his longing for his parents deep in his heart, but now that he finally saw them again, how could he not be excited? Plus Da Ming and Er Ming’s deaths influencing his mood, this moment he wept bitterly as if letting it all out. Like a hurt child seeing his parents.</p><br/><p>“Don’t cry, child. Don’t cry.”</p><br/><p>The faint Ah Yin made an embracing motion, but her illusory form couldn’t leave the range of the blue silver emperor. She could only urge those wide grass leaves to encircle Tang San, holding him tightly, giving him the warmth of her soul.</p><br/><p>Raising his head with eyes hazy from tears, this was the first time Tang San saw his mother’s appearance. Even though she was just an image, he still watched carefully. In his last life, he had once imagined many kinds of appearances for his mother, and in this world he had still never seen his mother. Now, he finally saw her face. Tang San couldn’t be more excited, and his tears uncontrollably moistened the leaves of blue silver emperor.</p><br/><p>Tang Hao equally excited quickly hopped forward, reaching Tang San, his lips trembling,</p><br/><p>“Good, good child, it’s good that you’re back. You’ve been gone for five years this time, do you know how much we’ve missed you?”</p><br/><p>“Child is unfilial.”</p><br/><p>Tang San’s voice was already hoarse from crying, the pent up frustrations he kept in his heart had been completely let out.</p><br/><p>Ah Yin’s leaves encircling Tang San helped him up, only she didn’t dare touch the Seagod Trident he held. A tiny leaf softly wiped the tears on Tang San’s face,</p><br/><p>“Child, go ahead and cry, let it all out. You’re back with your mom and dad, our whole family is reunited, no matter what has happened, it’s all in the past.”</p><br/><p>While speaking, Ah Yin released her leaves, and Tang San immediately opened his arms and gave his father a big hug. Tang Hao’s patted Tang San’s back with his single arm, equally tearful.</p><br/><p>To be able to spend peaceful days with his wife had always been Tang Hao’s dearest wish, but after Tang San left, Tang Hao had discovered that his son held an equally dear place in his heart.</p><br/><p>Ever since he was a child, he could never have said he took care of Tang San, instead it was the very sensible Tang San who always looked after him. After calming down and being together with his wife, Tang Hao would frequently recall Tang San’s childhood, and besides guilt, he also felt intense paternal love. Even though husband and wife were reunited, father and son were separated. After paying with two limbs, even though Tang Hao resigned himself to not owing the Clear Sky School anything, he had also lost the power to move unhindered in the world, and could no longer protect his son. Ah Yin had missed Tang San even more. Pity the hearts of the world’s parents, the parents’ feelings for their children is the most selfless, and also the grandest. Finally seeing their now even more heroic son, whether Tang Hao or Ah Yin, both were deeply moved.</p><br/><p>In this atmosphere the family of three said nothing else for a full hour, but their hearts were tightly linked together.</p><br/><p>Tang San gradually calmed down. He was after all not an ordinary person. Stabbing the Seagod Trident in the ground next to him, he turned to his parents:</p><br/><p>”Dad, mom, I still have something important to do. Once I’ve finished, I’ll tell you about the journey.”</p><br/><p>Tang Hao wiped the tears from his face, looking somewhat doubtfully at Tang San,</p><br/><p>“You still have to go do something?”</p><br/><p>Tang San hurriedly said:</p><br/><p>“Dad, I’m not leaving, I can do it here. I want, to resurrect Xiao Wu.”</p><br/><p>As he said the last four words, Tang San’s voice resounded with unhesitating resolve. Hearing it, Tang Hao and Ah Yin were shocked.</p><br/><p>“Little San, you……”</p><br/><p>Tang Hao looked at his son with disbelief. Before Tang San left for Seagod Island, he had already heard Tang San explain the conditions for resurrecting Xiao Wu. Even though Tang San’s previous howl had told him some things, he still found it very difficult to believe. In fact, back then he was already the youngest Title Douluo, but now his son had done it at more than ten years younger than him.</p><br/><p>Tang San extended his right hand. Blue light flashed, and immediately, the surroundings were awash in a misty blue splendor. His mother Ah Yin’s blue silver emperor immediately responded, the same blood causing an intense resonance. Equally golden blue light spread from his mother, and the light Tang San released grew even more intense, provoking the surrounding blue silver grass in the valley to grow violently, and even Ah Yin’s body was excitedly moving rhythmically from this vast Blue Silver Emperor aura, the golden light blossoming from each leaf becoming especially intense. The grass itself also became crystalline blue.</p><br/><p>Under Tang Hao and Ah Yin’s dumbstruck gazes, nine spirit rings in succession rose around Tang San. When Tang Hao saw that the last five of the rings were all red, he couldn’t help feeling being lifeless.</p><br/><p>“Little San, your spirit rings, this is……”</p><br/><p>It was Ah Yin who spoke up. Once a hundred thousand year spirit beast, she already possessed an implacable hatred for those spirit masters who hunted the already highly intelligent hundred thousand year spirit beasts. She didn’t dare believe that her son could possess so many hundred thousand year spirit rings. With the way Xiao Wu was hurt, how could her son still go hunt them?</p><br/><p>With Tang San’s intelligence, he understood her meaning with one look at his mother’s expression. He hastily explained:</p><br/><p>“Mom, don’t misunderstand. Of my hundred thousand year spirit rings, one his from killing a wicked hundred thousand year Evil Spirit Orca King in the ocean, the others don’t come from hunting spirit beasts.”</p><br/><p>Resurrecting Xiao Wu was an important factor, but Tang San also absolutely didn’t want his mother to misunderstand, and simply related how he got his spirit rings. Regarding his experiences on Seagod Island, he only lightly described it as gaining experience in a few sentences, he didn’t want his parents to worry for him.</p><br/><p>Hearing Tang San’s explanation, even Tang Hao couldn’t help feeling admiration,</p><br/><p>“Little San, you truly are blessed by the heavens. You’ve already thought it through, you want to resurrect Xiao Wu? Have you prepared everything?”</p><br/><p>Tang San nodded resolutely,</p><br/><p>“Dad, I’ve already thought it through very clearly. Even when resurrecting Xiao Wu won’t give me too much damage, even if I lost all my strength, I still wouldn’t hesitate. Just like you and mom, I also equally love Xiao Wu. Until death.”</p><br/><p>Tang Hao sighed, then smiled wryly:</p><br/><p>“You really are my son, even as infatuated as your old man.”</p><br/><p>Ah Yin burst into giggles:</p><br/><p>“Are you boasting?”</p><br/><p>Only, her face very quickly grew serious, gazing at her son:</p><br/><p>“Little San, are you sure of the outcome?”</p><br/><p>Tang San nodded,</p><br/><p>“Everything is ready. I brought Xiao Wu here to have the largest chance of success. Dad, mom, don’t worry. I absolutely won’t let Xiao Wu continue to suffer.”</p><br/><p>Ah Yin and Tang Hao glanced at each other. From their hearts, they of course didn’t want their son to take risks, but they also knew that he was determined to resurrect Xiao Wu, and having equally experienced countless hardships, they could naturally understand Tang San’s thinking. In such circumstances they couldn’t hold back their son, they could only encourage him, and pray that everything would go smoothly.</p><br/><p>Tang Hao patted Tang San’s shoulder:</p><br/><p>“With major concerns, don’t be overhasty. First settle your mood, then reach your best condition with cultivation. Me and your mom will watch over you, don’t worry about anything outside.”</p><br/><p>Seeing the encouragement and support in his father’s eyes, Tang San nodded forcefully, once again hugging his father hard, then sat down cross legged, starting to operate his Mysterious Heaven Skill.</p><br/><p>When Tang San broke through to nine rings, his Mysterious Heaven Skill inner strength had also reached completion, the ninth tier realm. In the Tang Sect in his previous life, even the strongest elders hadn’t cultivated to this stage. Right now Tang San’s inner strength had already become what Daoists called True Gang Divine Force. As he exercised it, his spirit withdrew, and a faint white mist slowly began to seep from every one of Tang San’s pores, wrapping him up inside. In a while, all that could be seen was white mist, not even Tang San’s shape was visible.</p><br/><p>Tang Hao and Ah Yin watched intensely from the side. Tang Hao had also step by step cultivated to the Title Douluo level back then, but it was the first time he had seen anyone with Tang San’s circumstances. Nothing like this had happened to him. That white mist seemed weak, but Tang Hao could sense that it contained an intense resilience, protecting Tang San.</p><br/><p>After reaching nine rings, this was still Tang San’s first time cultivating. The Mysterious Heaven Skill, like water forming its own canal, accompanied Tang San’s urging of his inner strength to formally enter the ninth tier. Gradually, the white mist surrounding Tang San slowly rose into the air, condensing into three enormous lotuses. It was the level of Three Flowers Gathering Above, Five Energies Governing The Elements.</p><br/><p>Breathing in and out evenly, it was like clouds drawn down from the sky, the spiritual influence of heaven and earth, and even the energies of the Ice and Fire Yin Yang Well imperceptibly merged with that white mist, and then rushed into Tang San’s body as he inhaled and exhaled.</p><br/><p>Tang San himself sensed another scene. He clearly felt that both Mysterious Jade Hand and Controlling Crane Catching Dragon had already entered completion at the ninth stage along with his Mysterious Heaven Skill. He understood that he could also finally freely use the two top ranked ultimate Tang Sect hidden weapons techniques.</p><br/><p>He had already cultivated the Tang Sect martial arts to great heights. If he was placed in his old world, it was enough to dazzle the jianghu.</p><br/><p>Only, in this world, Tang San’s cultivation clearly still hadn’t reached the limit. He now had rank ninety one spirit power, there were still even more difficult roads waiting for him. Only, even so, after the Mysterious Heaven Skill reached completion, it assisted his body to automatically absorb the essence of heaven and earth. Not only did his recovery in battle strengthen one step further, at the same time it also substantially increased his cultivation speed. It was an enormous advantage compared to common Title Douluo.</p><br/><p>Gradually, the white mist covered a larger and larger area, that was because it absorbed more and more of the essence of the world. Finally, as that white mist was absorbed by Tang San like a whale breathing in water, his cultivation finished. The originally barely consumed spirit power was again restored to its peak, even so much that he made considerable progress. His mental strength had also already condensed, stabilizing his raging mind.</p><br/><p>The time to resurrect Xiao Wu, had finally come.</p><br/>\n</div>"}