{"title": "Chapter 271", "id": 271, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-271", "volume_title": "Volume 3", "body": "<h1>Chapter 271</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271</p><br/><p>Sect Chief, Clear Sky Warrant</p><br/><p>(TL by Bagelson)</p><br/><p>Due to the harsh conditions for hitting with the Sky Blue Slowing God Claw of four seconds to charge up, if it hit, this state would continue for a terrifying ten seconds. In other words, within ten seconds, these five elders would endure the suffering of slow motion. With tenfold slowing, it was basically impossible for them to block any attacks or launch any of their own.</p><br/><p>Only, this time would vary according to the mental strength of the user and those hit. Even though these five elders were powerful, mentally there was still far too large a gap to Tang San. They would naturally fully suffer slowing for ten seconds.</p><br/><p>Without a doubt, if the Sky Blue Slowing God Claw was matched with the Golden Thirteen Halberds’ Unfixed Storm, then the sustained restrain capability would reach a frightening level. The five Clear Sky School elders were just the first to taste Tang San’s terrifying control capability.</p><br/><p>This succession of spirit abilities was originally something Tang San had prepared for Bibi Dong. The battlefield held myriad changes, and even with Bibi Dong’s Undying Body ability, Tang San was still sure he could have her eat dirt.</p><br/><p>Five lines of golden light rose simultaneously from the ground, instantly turning into five sturdy cages trapping each of the five elders. In the Sky Blue Slowing God Claw state, they were basically unable to resist or break the cages.</p><br/><p>This was still the fourth spirit ability from back then, Blue Silver Prison, but the color of the cages was now completely golden. This wasn’t the effect of the Seagod’s Light. The spirit ring rising to the fifty thousand year level had directly omitted the process of the Blue Silver Emperor turning into cages, and the prison was now instantaneous, and it’s solidity had also risen geometrically. Even the Clear Sky Hammer in avatar state would require at least three hits to break these cages. Let alone now that the five elders were unable to launch even one strike.</p><br/><p>Stepping off hard, Tang San shot off like a cannonball to intrude between the five elders. The Seagod Trident thrust out with illusory golden light through the cages to softly poke their chests, the sharp main blade leaving a tiny mark on each of their chests.</p><br/><p>Having completed this simple action, the golden light turned into cages instantly withdrew, and at the same time Tang San heavily thumped the ground with the trident. Amidst a loud sound, five rays of golden light simultaneously exploded from the tip, each exploding under the feet of the five elders. This wasn’t an ability as much as a blast from Tang San combining the terrifying weight of the Seagod Trident with his own spirit power control. The five elders’ figures were thrown out at the same time, rolling several dozen meters until they could finally catch their balance.</p><br/><p>The ten seconds of slowing ended in silence. The five elders crawled up from the ground one after another, the second elder who was hit by Tang San’s Purple God Light last, his face pale. He still hadn’t recovered from that mental strike. Of course, what had just happened was an even more enormous strike to his heart.</p><br/><p>Indeed, Tang San’s strength alone couldn’t possibly compare to the five Clear Sky School elders. If they had the chance to launch a combined assault on him, then he wouldn’t be able to hold out even with the Seagod Trident. But, Tang San basically didn’t give them the chance, perfectly displaying his control type spirit master skills. From start to finish, the entire battle had been completely in his control.</p><br/><p>Tang San’s gaze had calmed down, but it was that calm gaze that filled the five elders’ hearts with despair. In their eyes, that gaze seemed to tell them “if I didn’t hold back, you would already be dead.”</p><br/><p>And those were the facts. How could the sharpness of the Seagod Trident’s main blade be blocked with physical strength? If Tang San wanted them dead, that time was enough to leave them dead ten times over.</p><br/><p>The second elder’s face was deathly gray. As everyone cried out in alarm, he fiercely swung the Clear Sky Hammer in his hand to smash the top of his head. As the Clear Sky School’s chief elder, he no longer had the courage to live on after losing to a third generation disciple in front of the entire sect.</p><br/><p>“Stop.”</p><br/><p>Golden blue light abruptly flashed, and the second elder felt his whole body tighten. He was already completely tied up by a layer of sparkling Blue Silver Emperor. It was Tang San’s second spirit ability, Parasite.</p><br/><p>“Bastard, don’t tell me I’m not even allowed to die?”</p><br/><p>The second elder roared furiously. The Clear Sky Hammer flared with black light, a dark golden color rising over his whole body, actually forcing that fifty thousand year level parasite Blue Silver Emperor to withdraw. But because of the degree of strength he used, he couldn’t help vomit a mouthful of blood.</p><br/><p>“As a sect elder, you would die here without taking responsibility? If I say you can’t die, then you can’t die.”</p><br/><p>Tang San said coldly,</p><br/><p>“Look at this.”</p><br/><p>Golden light flashed, and the second elder subconsciously raised his hand to catch what Tang San threw over. As he saw that object, he just felt dizzy. Not only did the desire to die disappear, he couldn’t help trembling all over.</p><br/><p>“This, this is uncle’s Clear Sky Warrant?”</p><br/><p>The second elders voice fluctuated uncontrollably. At his words, the other four elders also couldn’t help losing their resentment for Tang San, quickly gathering.</p><br/><p>Tang San drawled,</p><br/><p>“Five elders, you are all of my grandfather’s generation. If not for great grandfather’s command, how could I dare offend you? This Clear Sky Warrant was bestowed by great grandfather. Great grandfather had me pass on his words, the Clear Sky School, is the Clear Sky School that disdains the world.”</p><br/><p>Tang Chen of course didn’t say this, it was all Tang San’s own invention. But if Tang Chen was here right now, he would definitely approve.</p><br/><p>The five elders looked at each other. The second elder stepped forward to return the Clear Sky Warrant to Tang San, his expression solemn:</p><br/><p>“Please stand in front.”</p><br/><p>Tang San wasn’t stand on ceremony, walking furthest ahead with large strides, looking towards the five elders with the precipice at his back.</p><br/><p>The second elder spoke in a deep voice:</p><br/><p>“All sect disciples hear my command, follow me to bow to the Clear Sky Warrant.”</p><br/><p>While speaking, he stepped furthest ahead, and bowed respectfully to the black crystal little golden hammer Tang San held aloft.</p><br/><p>Along with his bow, the five elders simultaneously fell to one knee in obeisance. Tang Xiao on the side also shocked fell to one knee. That the sect master himself would bow showed the frightening authority of the Clear Sky Warrant Tang San wielded.</p><br/><p>Several hundred Clear Sky School disciples knelt in a rustle. They didn’t just fall to one knee, but bowed deeply to the Clear Sky Warrant with both knees on the ground.</p><br/><p>The cold on Tang San’s face disappeared, his expression growing gentle. Stepping forward he helped up the five elders and his uncle.</p><br/><p>Tang Xiao couldn’t help asking:</p><br/><p>“Little San, your strength, was it bestowed by grandfather?”</p><br/><p>Tang San nodded:</p><br/><p>“If not for great grandfather’s instruction, how could I have reached this kind of strength in a short five years. What I said before, as well as challenging the five elders, was great grandfather’s instructions. Elders please don’t blame me.”</p><br/><p>Behaving with integrity, coupling strength and gentleness, this was what Tang Yuehua taught Tang San in the Moon Pavilion. All this was also what he had planned well in advance of returning to the Clear Sky School. Intimidating strength, plus the might of his great grandfather’s Clear Sky Warrant, switching from arrogance to deference, this was exactly according to Tang Yuehua’s teachings. It also let him truly display the authority of this Clear Sky Warrant.</p><br/><p>If he didn’t do it this way, even he had taken out the Clear Sky Warrant at once, he still wouldn’t have really become the holder of the Clear Sky Warrant in the eyes of the five elders, and everything would be a lot more complex. Even if he could reach his goal eventually, it would take a lot more effort. Now that he struck with the weight of thunder, first smashing their proudest strength, and then taking out this Clear Sky Warrant, absolutely nobody would doubt Tang San’s words. Because they really couldn’t imagine any other reason Tang San could become this strong. He was twenty five!</p><br/><p>Taking out this Clear Sky Warrant after the five elders lost to Tang San alone, was equivalent to finding a reason for their defeat. Asking themselves, what was embarrassing about losing to the person directly taught by history’s strongest Clear Sky Douluo Tang Chen, who had led the sect to climbing to the number one ranked position of the upper sects?</p><br/><p>Sure enough, when they heard this the five elders looked bewildered at Tang San, but their expressions were a lot more relieved.</p><br/><p>The second elder respectfully watched the Clear Sky Warrant Tang San held,</p><br/><p>“I wonder what instructions uncle would have.”</p><br/><p>Tang San’s expression immediately grew solemn, his voice low:</p><br/><p>“Great grandfather already knows what has happened to the sect. He said that grandfather’s decision was the greatest mistake since the founding of the sect. Even though it temporarily saved the foundation of the Clear Sky School, it also made the sect lose something most precious. Faith in certain victory. Spirit Hall really was formidable, but not undefeatable. If the sect had been able to confront Spirit Hall’s aggression back then, uniting with the other two of the three upper sects and appealing to the spirit master world, Spirit Hall wouldn’t have dared act blindly. But the sect chose to retreat, not only abandoning all the clans that had always followed the sect, but also abandoning our allies, shifting the balance of the seven great sects as a rival to Spirit Hall. This led to Spirit Hall’s expansion, until they today have founded the Spirit Empire, the state of the Continent unstable.”</p><br/><p>The five elders looked at each other at Tang San’s words, and Tang Xiao’s expression grew a bit ugly. After all, that decision was made by Tang San’s grandfather, the Clear Sky School’s first generation sect master. And what Tang San said was equivalent to overthrowing everything his grandfather had done.</p><br/><p>“My father was the cause of what happened back then, but was my father really wrong? Great grandfather gave me this Clear Sky Warrant to find justice for my father. Indeed, Spirit Hall’s oppression really started with my father, but even had it not been for him, don’t tell me Spirit Hall would leave the three upper sects alone? Ask yourselves, if someone would kill your wife, how would you react? My father only injured the Spirit Hall Supreme Pontiff to protect my mother, using his strength alone to repel numerous Spirit Hall enemies. I’m proud of my father. He didn’t dishonor the name of the Clear Sky School. Moreover, my mother also died in that battle, choosing to sacrifice herself to save my father. But how did the sect respond to those events? Not only was there no intent to protect my father, on the contrary the sect expelled him, causing my father to suffer to this day. In order to return the favor of the sect for raising him, he even voluntarily severed two limbs to return the spirit bones the sect granted him. I dare ask everyone, if the Clear Sky Sect master back then was great grandfather rather than grandfather, how would it have ended? I’m now twenty five years old, and my father has also suffered for twenty five years due to what happened back then, ending up as a cripple. Even if grandfather was reborn, I would still certainly demand justice for my father.”</p><br/><p>Speaking as straightforwardly as slicing iron and chopping nails, Tang San’s manner completely erupted, completely sinking into intense excitement.</p><br/><p>Listening to Tang San, the third and fourth generation disciples looked at each other with differing expressions. But the majority were contemplative. The Clear Sky School really was backed into a corner when they chose to retreat, but would these spirit masters with the Clear Sky Hammer really be willing to stay silent?</p><br/><p>Tang Xiao couldn’t help saying:</p><br/><p>“Back then my father chose to retreat due to the Spirit Hall’s influence. Actually father also suffered a lot, and also thought of brother Hao. He was still repeating his name until he died. Even if father’s choice was a bit conservative, using retreat as advance, it might not be the wrong move. As long as there’s a chance, the sect would definitely re enter the spirit master world.”</p><br/><p>Tang San shook his head, sighing,</p><br/><p>“Uncle, I understand what you mean, but the Clear Sky Sect’s retreat back then still harmed too many people. Also, do you believe the circumstances would be as good as back then if the sect declared it would reappear?”</p><br/><p>“Spirit Hall has now already established an empire, joined by the subsidiary kingdoms and duchies of Heaven Dou and Star Luo Empires. Adding in their own tens of thousands of spirit masters, they have formed a great power contending with the two great empires, even swallowing a lot of the two empires’ territories. The Clear Sky School went into hiding, the Blue Lightning Tyrant Dragon Clan was massacred, the Seven Treasure Glazed Tile School seriously injured. Who can the spirit masters of the world choose to follow other than Spirit Hall? If the Spirit Hall back then could control at least fifty percent of the world’s spirit masters, then by now they already control more than eighty percent. In such circumstances, can the Clear Sky School reverse the tide by reemerging now? We no longer have any allies. Would the remnants of the Seven Treasure Glazed Tile School trust a cowering Clear Sky School?”</p><br/><p>Looking around at the pensive clansmen, Tang San’s voice grew severe:</p><br/><p>“I don’t know if everyone still remember the four single attribute clans spent immeasurable effort for the Clear Sky School. You might know that their hatred for the sect is even greater than for Spirit Hall. Just because the sect threw them away, they suffered devastating attacks, and have lived in misery. And this is just a portion of the spirit masters that followed our Clear Sky School back then. The Clear Sky School has been silent for more than twenty years. If it appears again, who would still listen to us? Who would still trust us? We are already branded with the reputation of oath breakers and cowards.”</p><br/><p>The second elder said somewhat absentmindedly:</p><br/><p>“What will happen, has already happen. Perhaps you are right. Tang San, where is uncle? If he could return to take charge, the Clear Sky School won’t collapse. His fame is still enough to awe the spirit master world.”</p><br/><p>Tang San slowly raised the Clear Sky Warrant, his voice clear:</p><br/><p>“When great grandfather handed me the Clear Sky Warrant, he had already decided not to return to the sect. A sect that hides in its shell will only gradually wither away. If the sect pays, there is at least a chance to rise. If we want to establish the reputation the Clear Sky School had back then, we must use our own actions to prove it to the spirit master world, and not to keep waiting here. Waiting will lead to nothing.”</p><br/><p>The second elder looked at Tang San, then again at Tang Xiao to the side, his voice grave:</p><br/><p>“Tang San, did uncle give you the Clear Sky Warrant to make you sect master?”</p><br/><p>Hearing the second elder say so, Tang San couldn’t help being frightened. Even if he had already guessed that the Clear Sky Warrant held enormous power in the sect, only when the second elder spoke did he understand it had an even deeper meaning. With the glory Tang Chen established when he founded the sect, a single word for him was enough to change anything in the sect. This Clear Sky Warrant was equivalent to he himself, and even deposing the sect master wasn’t a problem. And the strength Tang San showed when he defeated the five elders before was also enough to assume the position. After all, he was still young. That the five elders could endure the humiliation of defeat, and even gradually approve of him, was admittedly directly related to Tang Chen’s Clear Sky Warrant, but at the same time also closely linked with Tang San’s strength! In their eyes, Tang San was like Tang Chen who led the sect to glory back then, and even more outstanding than Tang Chen was. Even though Tang Chen was the genius of a hundred years in the Clear Sky School, even he couldn’t compare to the current Tang San when he was his age.</p><br/><p>Tang San looked at his uncle. In Tang Xiao’s eyes he saw calm. Tang Xiao seemed to have already figured out a lot of things, and his eyes held frustration, held regret, but even more pain. Pain for the state of the Clear Sky School.</p><br/><p>Slowly and firmly shaking his head, Tang San looked at the elders:</p><br/><p>“Great grandfather didn’t urge me to take the sect master position, he just told me the Clear Sky Warrant could let me become the sect’s chief elder and obtain the support of the elders and the authority to interfere in sect business.”</p><br/><p>Tang Xiao suddenly spoke up,</p><br/><p>“Little San, you don’t have to force yourself to give up on the sect master position, and you don’t have to give me face either. You’re young, you have vitality, strength, and even more grandfather’s inheritance. This sect master position should be passed to you. Only under your lead can the Clear Sky School return to the peak as number one in the world like under grandfather back then.”</p><br/><p>“No, uncle, listen.”</p><br/><p>Tang San hurriedly interrupted Tang Xiao,</p><br/><p>“Uncle, I really can’t become sect master. First of all, I have already created the Tang Sect. I’ve also accepted the Heaven Dou Empire’s title. In terms of my personal status, if I become the Clear Sky School sect master, it would harm the sect’s independence. Also, I’m still too young, I don’t have enough prestige. But uncle and elders please don’t worry, Tang San is always a member of the Clear Sky School. As long as Tang San still lives, I will definitely help the sect return to the peak.”</p><br/><p>Before Tang Xiao had thought of what to say, Tang San had already turned to the five elders,</p><br/><p>“I don’t know if the elders could accept me as chief?”</p><br/><p>The five elders glanced at each other, then simultaneously bowed to the Clear Sky Warrant in Tang San’s hand,</p><br/><p>“We comply with the Clear Sky Warrant, greetings chief elder.”</p><br/><p>“Greetings chief elder.”</p><br/><p>In a rustle, the Clear Sky School disciples knelt on the ground. Among these sect disciples, only a very few had seen Tang Chen. Most had only heard of him. Rather than saying they were convinced by the Clear Sky Warrant, it would be better to say they were conquered by Tang San’s formidable strength and his previous speech. What youth wasn’t hot blooded? Who didn’t wish for the Clear Sky School to again be number one in the world? Even though this place was quiet, it was also lonely. Even though the Clear Sky School had cultivated a group of powerful young spirit masters over more than twenty years, they had suppressed their hot blood. Tang San’s appearance was the ideal choice to change the situation.</p><br/><p>“Please rise, elders. I hope we can work with a common purpose, to recreate the Clear Sky School’s glory.”</p><br/><p>Tang San finally heaved a sigh of relief. After returning to the sect, with this step his goal was basically already accomplished.</p><br/><p>“I currently have two items that must be dealt with first. One, to offer rites to my grandfather together with my father, and fulfill my filial duty. Second, to invite my father Tang Hao back to the sect, and in the name of the sect, return those two spirit bones.”</p><br/><p>The five elders secretly sighed. They of course also vaguely understood that what Tang San said before was partly from selfish motives, but they still regarded Tang San’s strength as even more important. When they now heard Tang San state his goals, they nodded simultaneously without raising any objections.</p><br/><p>Tang San said:</p><br/><p>“Then uncle and elders please return to the sect. I’ll go welcome father and mother.”</p><br/><p>While speaking, he was about to go down the mountain.</p><br/><p>“Hang on.”</p><br/><p>Tang Xiao’s voice trembled somewhat, grabbing Tang San’s shoulder,</p><br/><p>“Chief elder, what did you just say? Your…… mother?”</p><br/><p>Tang San smiled calmly:</p><br/><p>“This should count as my surprise for uncle. You will see her in a while.”</p><br/><p>Tang Xiao’s eyes grew even brighter, complex light glinting like the moon and stars,</p><br/><p>“I’ll go down the mountain and welcome brother Hao with you.”</p><br/><p>Before Tang San could say anything, this Clear Sky School master had already leapt up, dashing down the iron chains like an arrow, disappearing in the blink of an eye.</p><br/><p>Tang San stared blankly, then turned to look at the elders. The five elders drew deep breaths, then said in chorus:</p><br/><p>“We’ll wait back at the sect.”</p><br/><p>As Tang San landed back in the village below the mountain, it was just in time to see the brothers Tang Hao and Tang Xiao stand opposite each other. Tang Xiao’s lips trembled, looking over Tang Hao, then looking over Ah Yin next to him, the rims of his eyes quickly reddening.</p><br/><p>“Big brother…...”</p><br/><p>Tang Hao spoke with some difficulty.</p><br/><p>Tang Xiao lunged fiercely, gathering his crippled little brother in his embrace. Even if he still had some resentment back on the top of the mountain because Tang San accused his father’s decision as being wrong, now that he saw his one armed, one legged little brother, his heart was again free of all grudges.</p><br/><p>Not long ago, Tang Hao was talent even he had to admire, the genius of a generation of the Clear Sky School. When their grandfather still hadn’t left, he’d once praised Tang Hao as his best successor. But the former genius was now already crippled, and the bleakness and misery in Tang Xiao’s heart made him feel as if he would cry tears of blood.</p><br/><p>Why, why didn’t he have the courage to doubt his father’s decision? He’d let his little brother suffer until now. Oh father, you really were wrong! Do you see? Your most beloved son actually ended up like this. These past two decades was because of your decision, the Clear Sky School falling, and little brother…...</p><br/><p>“Brother Hao, you’ve suffered.”</p><br/><p>Tears fell uncontrollably from Tang Xiao’s eyes.</p><br/><p>“Big brother……”</p><br/><p>Tang Hao had never thought his elder brother, as the sect master, would come to welcome him. Right now he was shocked, and twenty five years of always suppressed feelings for the sect instantly erupted. The brothers embraced again after so many years of separation, this feeling made him unable to calm his heart, as if he again saw the scenes where he and his brother moved unhindered through the world back then.</p><br/><p>“Big brother.”</p><br/><p>Ah Yin’s face was already covered with tears. She stepped forward next to Tang Hao and looked at Tang Xiao.</p><br/><p>The brothers let go, and Tang Xiao somewhat foolishly looked at Ah Yin,</p><br/><p>“Ah Yin, you, you……”</p><br/><p>Ah Yin smiled sadly,</p><br/><p>“Ah’Hao guarded me for twenty five years, and finally little San helped me resurrect. I didn’t think there would be a day I could see brother again.”</p><br/><p>Tang Xiao looked foolishly at Ah Yin, muttering to himself:</p><br/><p>“Your choice was right. I’m just a cowed. I didn’t have the courage to love you. Brother Hao is much, much stronger than me.”</p><br/><p>Tang San stepped up to the three of them:</p><br/><p>“Dad, mom, uncle, let’s go up the mountain and offer rites for grandfather.”</p><br/><p>He was anxious to help his father restore his arm and leg, and so couldn’t help reminding them.</p><br/><p>Tang Xiao sobered from his complicated mood, watching Tang Hao deeply,</p><br/><p>“Brother Hao, don’t blame father. Ok? He also had his difficulties. With the situation back then, and grandfather away from the sect, father worried the Clear Sky School would end under his watch. So……”</p><br/><p>Tang Hao shook his head,</p><br/><p>“Big brother, don’t talk like that. I only want to kowtow to father’s spirit a few times, I’m the one who was unfilial and failed to live up to his expectations.”</p><br/><p>Tang Xiao’s eyes reddened, tightly gripping Tang Hao’s shoulders,</p><br/><p>“Little San is right, it’s the sect that let you down, not the other way around. Let’s go home.”</p><br/><p>The whole group soared up. Tang Xiao originally wanted to help Tang Hao, but Tang Hao refused. More than twenty years had passed, but Tang Hao’s pride had never changed.</p><br/><p>The Clear Sky School, the back mountain.</p><br/><p>Tang Xiao, Tang Hao, and Tang San stood furthest ahead. The five elders, Ah Yin and Xiao Wu stood behind.</p><br/><p>In front of them was a lonely stone brick tomb. Even if Tang San had previously been resentful of his grandfather, when he now saw this lonely tomb he couldn’t help feeling sad. He seemed to sense his grandfather’s helplessness and sadness before he died.</p><br/><p>Tang Hao knelt on his one knee, his lips tightly pursed. Placing his one hand on the ground, he ‘bang bang bang’ knocked his head on the ground nine times. When he raised his head again, there was a red mark on his forehead.</p><br/><p>Tang San followed his father to pay his respects, and Ah Yin and Xiao Wu knelt behind them. Nobody spoke, but that intensely sad mood infected everyone.</p><br/><p>Tang Hao stayed kneeling like this for a full three days without rest. For three days without rest, Tang San also always stayed by his father’s side. Father and son didn’t utter a word in these three days.</p><br/><p>Ah Yin and Xiao Wu silently kept the father and son company from the side.</p><br/><p>Three days had just passed when Tang Hao finally raised his head. After three days without eating or sleeping, his eyes were already hazy red.</p><br/><p>“Father, depart without worries. Unfilial son Tang Hao has brought Tang San, we will definitely help big brother to again raise the Clear Sky School.”</p><br/><p>After kowtowing another nine times, Tang Hao stood, turning and leaving with Tang San’s support.</p><br/><p>In the Clear Sky School’s official business hall, sect master Tang Xiao and the five elders quietly waited for them. They had already been waiting here for the whole three days. As Tang Hao, Tang San arrived at the hall accompanied by their wives, they all stood.</p><br/><p>Seeing Tang Hao’s red eyes, Tang Xiao couldn’t help saying:</p><br/><p>“Brother Hao, little San is right, the sect has let you down these years.”</p><br/><p>Tang Hao shook his head, speaking calmly:</p><br/><p>“The past is the past.”</p><br/><p>Just this flat sentence intimidated the five elders. Seeing Tang Hao’s broken body, they could completely imagine the suffering he had gone through. But the breadth of mind necessary to dismiss it like this made them secretly blush with shame.</p><br/><p>Tang Xiao personally stepped forward to help Tang Hao sit down, and Tang San sat in the seat of honor among the five elders, next to Tang Xiao. With the Clear Sky Warrant, his position as chief grand elder was exceedingly high in the Clear Sky School.</p><br/><p>Ah Yin softly pulled along Xiao Wu, bringing her outside. This was the place for men to discuss business, and she knew well propriety. Only before Xiao Wu left, she still couldn’t help shooting Tang San a loving glance, and Ah Yin felt a burst of comfort when she saw this.</p><br/><p>On the table next to Tang Xiao lay two boxes. One of them Tang San could see was the one he once delivered to the Clear Sky School, with his father’s two spirit bones.</p><br/><p>Tang Xiao first picked up this box and stood, walking over to Tang Hao. Tang Xiao sighed, and handed over the box,</p><br/><p>“Brother Hao, the sect has let you down. These spirit bones are yours.”</p><br/><p>Tang Hao smiled faintly,</p><br/><p>“The sect gave me life, gave me strength, all I am belongs to the sect, there’s no favor or letdown. I only hope this broken life can do something for the sect.”</p><br/><p>Hearing his little brother’s words, waves surged in Tang Xiao’s heart, and he couldn’t help speaking:</p><br/><p>“Brother Hao, the position as sect master should originally have……”</p><br/><p>Tang Hao interrupted his brother,</p><br/><p>“Don’t speak. Big brother, I only want to support you.”</p><br/><p>Tang Xiao sighed deeply, with difficulty holding the tears back from his eyes. When he returned to the head of the table, he picked up the other much larger box. This time, he stepped over to Tang San and handed the wooden box to him.</p><br/><p>Tang San stared blankly,</p><br/><p>“Uncle, this is?”</p><br/><p>Tang Xiao spoke in a low voice:</p><br/><p>“These are the remnants left by divine craftsman Lou Gao.”</p><br/><p>“Remnants?”</p><br/><p>Tang San stood sharply, a formidable pressure suddenly erupting from him. Even the first generation powers present couldn’t help feeling their pulse rise.</p><br/><p>Taking the wooden box, Tang San gazed at Tang Xiao with disbelief,</p><br/><p>“Uncle, senior Lou Gao, he, he……”</p><br/><p>Tang Xiao said sadly:</p><br/><p>“He was the most dedicated person I’ve ever seen, describing him as a forging lunatic wouldn’t be wrong. Ever since you brought him here, he was forging every day without food or rest. Even I was exhausted after assisting him every day. Three months ago, when he conducted the last forging, he told me to treat his works as remnants left for you. Then he started forging. He didn’t even let me participate. In the end, he threw himself into the furnace flame, completing the last step. These things are the end results of his five years here, and also his last work.”</p><br/><p>“That means, even senior Lou Gao’s bones…..”</p><br/><p>Tang San looked at the wooden box he held, his eyes already misty.</p><br/><p>Tang Xiao nodded,</p><br/><p>“These items could be called his ultimate work. After that happened, divine craftsman Lou Gao’s two disciples brought the furnace flame he used, and said they’d return to your Tang Sect. Strangely, they weren’t sad, but rather left smiling. In Lou Gao’s final moments he laughed loudly three times, and his two disciples also yelled to him, congratulating their teacher for completing an incomparable divine work.”</p><br/><p>Listening to Tang Xiao, Tang San opened this giant wooden box with somewhat trembling hands.</p><br/><p>As soon as the box opened, an incredibly sharp energy instantly spread through the whole hall.</p><br/><p>On the bottom of the box was a layer of numerous already unbearably filthy, but still complete blueprints. On top of the blueprints a few things were arranged.</p><br/><p>One was a one chi long cylinder with a deep peacock pattern. Three were glittering lotus flowers with what seemed like rubies inlaid as cores. There were also forty nine half chi long dull silvery strange needles, as well as more than ten dull silvery components of all kinds.</p><br/>\n</div>"}