{"title": "Chapter 277", "id": 277, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-277", "volume_title": "Volume 3", "body": "<h1>Chapter 277</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 277</p><br/><p>Sky Blue Fading Thunderclap</p><br/><p>(TL by Bagelson)</p><br/><p>Early morning, without clouds as far as the eye could see, a warm breeze, a deep breath filling one’s lungs with fresh air.</p><br/><p>The Heaven Dou Empire’s almost hundred li long camp sprawled like a mythical beast fifty li away from Jialing Pass. At dawn, just after an early breakfast, the army assembled with thundering battle drums.</p><br/><p>One square formation after another appeared outside of the camp, each enormous square holding ten thousand people. Along with orders passed from the central army, a hundred thousand Heaven Dou Empire soldiers slowly marched forward. That was a full ten heavy armored cavalry legions, and also all the heavy cavalry the Heaven Dou Empire had brought this time. These were true steel heroes. They didn’t advance quickly, but that enormous force made the ground tremble.</p><br/><p>Following closely behind the heavy cavalry were the Heaven Dou Empire’s four thousand spirit masters, escorted onto the battlefield by the twelve thousand strong Tang Army.</p><br/><p>By appearance, the Tang Army just looked like light cavalry guarding them, and on an ordinary battlefield, it would also be all light cavalry fighting alongside the spirit masters, enough to show the advantages of speed.</p><br/><p>Behind them came another ten light cavalry legions, rushing out on the two wings. For the first battle with the Spirit Empire, the Heaven Dou Empire’s side had actually sent all cavalry. Even those spirit masters were mounted. Relying mainly on heavy cavalry, they could charge at will and guard the retreat.</p><br/><p>Up on Jialing Pass, Bibi Dong sneered,</p><br/><p>“The Heaven Dou Empire is afraid. All cavalry can indeed easily attack or retreat, but that’s on a conventional battlefield. Don’t tell me they can somehow show the advantage of the cavalry when they clash with my spirit master legions? Pass down my command. The eight heavy cavalry and heavy infantry legions form up in the front, Sacred Dragon Legion, sortie.”</p><br/><p>The four gates of Jialing Pass opened almost simultaneously, four great drawbridges lowering with the clattering of chains to bridge the fifty meter moat. With clanking armor, large numbers of heavy armored soldiers swiftly rushed out of Jialing Pass.</p><br/><p>Only, Looking at their formations, while they were all heavy armored legions, these Jialing Pass heavy troops wasn’t arrayed as neatly as the Heaven Dou Empire’s heavy cavalry.</p><br/><p>First of all, since they came from different kingdoms and duchies, their armors were all of different standards. Compared to the Heaven Dou Empire’s black armor, the Spirit Empire’s heavy troops had at least ten differently colored armors. The speed with which they formed formations was also much slower. Clearly their training within the Spirit Empire wasn’t completed.</p><br/><p>Altogether four heavy cavalry legions and four heavy infantry legions, this was already the majority of the entire Spirit Empire’s heavy legions. Because the other pass facing the Star Luo Empire’s attack was mainly focused on defense, they weren’t assigned any heavy units.</p><br/><p>The Heaven Dou Empire’s two hundred thousand strong army came to a halt when it was still twenty li away from Jialing Pass. Ten heavy cavalry legions formed up in a straight line, opening a passage in the middle. Guarded by the Tang Army, in actuality more than six thousand spirit masters advanced, only the more than two thousand spirit masters of the Tang Sect were all dressed exactly the same as the Tang Army. The light cavalry spread out on the wings on either side, taking down longbows from their backs. They were actually all cavalry archers.</p><br/><p>On the other side, the Spirit Empire’s eight legions were directly arranged in front of the pass, and immediately after, a ten thousand man strong army rushed out from the pass. They weren’t mounted, all advancing on foot. But they didn’t move any slower than speeding horses. These ten thousand men actually formed up in a line in front of Jialing Pass, all wearing light fighting gear. Their clothes were decorated with patterns of golden thread, and on banners waving behind them were two large golden words, Sacred Dragon.</p><br/><p>Grandmaster and Tang San stood side by side, and together with them was also that marshal Ge Long.</p><br/><p>Marshal Ge Long waved his hand,</p><br/><p>“Army advance. Cavalry archers ready, after entering the ten li range, launch crossfire.”</p><br/><p>Tang San simultaneously also passed down orders to the Tang Army,</p><br/><p>“Check crossbows. Wind mechanisms.”</p><br/><p>With sonorous clangs, the Tang Army quietly took down the Godly Zhuge Crossbows on their backs. Placing them level on their saddles, they quickly inspected the weapons, especially the condition of the loaded arrows and the mechanism. After completing the inspection, they immediately readied them.</p><br/><p>Banners fluttered in the wind. Behind them, Heaven Dou emperor Xue Beng personally commanded two hundred thousand men to bring up the rear.</p><br/><p>The distance between both sides constantly shrank. When ten li still remained, the light cavalry legions on the Heaven Dou Empire’s side reacted. Ten light cavalry legions set off simultaneously, tens of thousands of hooves pounding the ground, charging straight at Jialing Pass.</p><br/><p>On the Spirit Empire’s side, the two heavy infantry legions closest to the Sacred Dragon Legion quickly closed, blocking in front of the Sacred Dragon Legion, wielding giant shields.</p><br/><p>Up on Jialing Pass, Bibi Dong couldn’t help frowning when she saw a hundred thousand light cavalry charging,</p><br/><p>“Do these Heaven Dou Empire fellows want to commit suicide?”</p><br/><p>Even though she didn’t know much of the art of war, she still knew that there could only be one result of light cavalry charging heavy cavalry and heavy infantry, especially when there wasn’t much of a numerical difference between both sides. It was simply no different from suicide. Even if these light cavalry was attacking with bow and arrow, what faced them was still all heavy cavalry and infantry. Bow and arrow was practically useless. There wasn’t even a need for her Sacred Dragon Legion to move.</p><br/><p>While Bibi Dong was puzzled, the Heaven Dou Empire’s light cavalry legions had already arrived. When they were still one li away from the Spirit Empire side they instantly changed directions, nocking arrows, and with whooshing sounds, countless arrows flew towards the Spirit Empire legions.</p><br/><p>The majority loosed volleys. At this distance, and when their target was ninety thousand enemy troops, there was basically no need to aim. As intended by the light cavalry, the majority of the arrows were shot towards the Sacred Dragon Legion. The heavy infantry blocked in front of them, but they could do nothing against arrows falling from above.</p><br/><p>One volley complete, the light cavalry didn’t pause. One curve of rising dust after another, they relied on swift horses to directly slip past the flanks and returned to their original positions.</p><br/><p>It was one volley, but that was a hundred thousand arrows! The ten Heaven Dou Empire light cavalry legions suitably revealed their high quality before the Spirit Empire. As the hundred thousand strong army shot one wave of arrows, their formation barely shifted. As they circled around, returning to their own side, the Heaven Dou Empire army had already pushed forward five li. Under cover of the rising dust, they seemed like ghosts, teleporting into their new positions.</p><br/><p>Bibi Dong sighed to herself, calmly asking:</p><br/><p>“Can our light cavalry perform at this level?”</p><br/><p>The light cavalry generals standing behind her each and everyone kept quiet out of fear. Not one dared utter a word.</p><br/><p>“Didn’t you tell me that the Heaven Dou Empire is as unreliable as a sheet of sand. The troops lazy, mostly names filling out the payroll? This is a carried army? Then what are you?”</p><br/><p>Watching those ten light cavalry legions show off their strength in neat formations, even if they couldn’t seriously harm the Sacred Dragon Legion’s spirit masters or their heavy troops, it was undoubtedly an enormous blow to the Spirit Empire’s morale. Bibi Dong understood that she wasn’t the only one who had been patient these years, the Heaven Dou Empire had equally endured. According to previous estimations, the Heaven Dou Imperial Army would be less than six hundred thousand, and the majority without real combat strength. But this? Arranged before her was an excellently trained and suitably supplied army of millions. Even if the Heaven Dou Empire’s military strength was compared to the Star Luo Empire, there wouldn’t be much difference.</p><br/><p>“Pass down orders. Sacred Dragon Legion, release spirit rings, attack.”</p><br/><p>This was the first confrontation between both sides, morale had to be retrieved. Bibi Dong knew that those kingdom and duchy troops weren’t much to count on. What she really could rely on was just her own subordinate spirit masters. As long as they could rout the Heaven Dou Empire’s spirit master legion, those incorporated troops wouldn’t be a problem.</p><br/><p>Brilliant light instantly brightened on the Spirit Empire’s side. Ten thousand spirit masters simultaneously releasing their spirits was absolutely a dazzling scene. Countless spirit rings flickered with white, yellow, purple and black colors. Even though their army was equally unevenly matched, that instantly rising terrifying presence made the Heaven Dou Empire’s two hundred thousand soldiers breathing grow urgent.</p><br/><p>The soldiers of course knew what it meant to face spirit masters. Just one of a high level spirit master’s large area attack type spirit abilities could kill them by the hundreds. Only spirit masters could face spirit masters.</p><br/><p>Marshal Ge Long looked towards Grandmaster and Tang San next to him, slightly cupping his hands,</p><br/><p>“Next is up to your highnesses.”</p><br/><p>Grandmaster nodded, raising his right hand,</p><br/><p>“Release spirits.”</p><br/><p>The more than four thousand spirit masters escorted by the Tang Army released their spirits simultaneously. Even though they were a lot fewer than the opponents, their actions were adjusted to uniformity, and there was no disorder in their spirit ring colors. Standing furthest in front were unexpectedly all seven and eight ring spirit masters. Even though they weren’t many, their spirit rings made up for their lacking numbers. Behind them was a formation formed by six, five, four, and three ring spirit masters. The majority had between three and five rings.</p><br/><p>What drew most attention, were the one hundred simultaneously brightening Seven Treasure Glazed Tile Pagoda. Dazzlingly beautiful treasure light shot towards the sky. They were located at the heart of the spirit master legion, and amidst sparkling light, Seven Treasure Glazed Tile School master Ning Fengzhi gazed forward. Next to him, Sword Douluo and Bone Douluo were on guard.</p><br/><p>These one hundred Seven Treasure Glazed Tile School directly related disciples were all survivors from that time, and behind them were another one hundred Seven Treasure Glazed Tile School disciples who hadn’t released their spirits yet. Attentively watching the Spirit Empire army on the other side, their eyes held only the light of hatred.</p><br/><p>On Jialing Pass, Bibi Dong sharply swung her hand. The ten thousand Sacred Dragon Legion spirit masters leapt up as one. Only Spirit Hall could train spirit masters as a legion, and therefore, even if their army wouldn’t do, this spirit master legion was definitely elite.</p><br/><p>Agility attack type spirit masters immediately circled around on the sides, while power attack type spirit masters and defense type spirit masters took the lead forward, support spirit masters applying all kinds of support effects from behind, control type spirit masters followed the power attack type spirit masters closely, each and every one already preparing spirit abilities. These spirit masters were divided into several groups according to their cultivation direction. Front and center in the Sacred Dragon Legion, several hundred spirit masters were from the the Sacred Dragon School of the new seven great sects.</p><br/><p>Each Sacred Dragon School disciple was covered by a layer of white scales, and they were all built sturdy and bulky. This was their spirit, White Armored Dragon. The White Armored Dragon couldn’t be considered a true dragon, just a close relative. There was still a major gap when compared to the original Blue Lightning Tyrant Dragon. But they were still dragons, and this Sacred Dragon School moreover had numerous experts thanks to Spirit Hall’s careful nurturing. They were a sect that was formed directly by separating from spirit hall, one of the three upper sects of the new seven great sects, and this Sacred Dragon Legion was also named after them.</p><br/><p>A group of spirit masters right next to the Sacred Dragon School, the Shrek Seven Devils were very familiar with. They’d once fought spirit masters of this line in the Continental Advanced Spirit Master Academy Elite Tournament. With balanced defense and force, they were the Elephant Armor School. Those giant Elephant Armor School guys had all released their spirits, and led by the sect master Heavenly Elephant Huyan Zhen, they charged alongside the Sacred Dragon School with giant strides. Without a doubt, they were the cornerstone of this Sacred Dragon Legion. Even though the two great sects together didn’t have seven hundred people, their fighting strength was undoubtedly the strongest. Whether the White Armored Dragon or the Giant Mammoth Elephant spirit, both were best suited for the battlefield. No heavy cavalry could halt their advance.</p><br/><p>“Separate the formation. Elder Tai Tan, elder Niu Gao, take one thousand Tang Army troops each to support the wings. The remaining soldiers, single line formation.”</p><br/><p>Tang San ordered.</p><br/><p>Tai Tan and Niu Gao each brought a thousand Tang Army soldiers and quickly left. The remaining eight thousand Tang Army troops quickly formed a line, blocking in front of the central army spirit masters. Half dismounted, half on horse, they simultaneously raised the large edition Godly Zhuge Crossbows they held.</p><br/><p>Tang San coldly said:</p><br/><p>“Do not shoot without my command. When I’m not here, follow the State Preceptor’s orders.”</p><br/><p>The more than two thousand Tang Sect disciples guarded in front of Tang San, Grandmaster and marshal Ge Long. Furthest ahead was a front formed by lines of Defense Hall and Medicine Hall disciples. The remaining two thousand spirit masters as well as Grandmaster’s four thousand subordinate spirit masters all waited quietly.</p><br/><p>“Old freak, do you dare charge with me?”</p><br/><p>Tang San yelled loudly.</p><br/><p>With a strange laugh, Dugu Bo’s voice came from among the spirit masters,</p><br/><p>“There’s nothing I don’t dare. I’m not good at fighting Title Douluo alone, but for this group battle, who dares say they are stronger than me? Let’s go!”</p><br/><p>Tang San turned his head to Grandmaster:</p><br/><p>“Teacher, I’ll leave this side to you and marshal Ge Long. The enemy spirit masters furthest in the front have too powerful of a defense, it will influence the effectiveness of the Godly Zhuge Crossbows. Better let us go break their defense head on. We’re going.”</p><br/><p>“King Lan Hao, you……”</p><br/><p>Marshal Ge Long wanted to object, but Tang San had already grabbed the Seagod Trident and leapt up. Behind him, the other six Shrek Seven Devils didn’t need any reminder, leaping up at the same time as Tang San. Zhu Zhuqing brought Ning Rongrong, Dai Mubai brought Oscar, and the seven plus one Medicine Hall master Yang Wudi directly broke out of the square formation.</p><br/><p>Up on Jialing Pass, Bibi Dong saw that the Heaven Dou Empire side unexpectedly only sent eight people. She first stared blankly, but immediately afterward, as she saw the person furthest in the lead was Tang San wielding the Seagod Trident, she immediately called out,</p><br/><p>“Not good. Elders, follow me.”</p><br/><p>While speaking, she disregarded her position as empress, and abruptly soared up from Jialing Pass. Purple wings spread out behind her, and she glided directly downward.</p><br/><p>The Blue Silver Emperor right leg bone’s acceleration ability rose to the limit. With Tang San’s speed, and moreover with them clearly being much closer to the charging Sacred Dragon Legion, while still in the sky, Tang San stretched his entire body. Exerting himself with his right arm, he threw the Seagod Trident like a javelin, his target in the front line, having already incarnated as a giant mammoth, the Elephant Armored School master Huyan Zhen.</p><br/><p>At the very same moment, a ring of scarlet and white light spread out from below Tang San’s feet. The eight people who rushed out of the square as well as Poison Douluo approaching from another direction were all enveloped. This was the Deathgod Domain starting.</p><br/><p>Huyan Zhen faced Tang San’s enormous, but completely without spirit power fluctuations Seagod Trident. Laughing loudly, he not only showed no intention of retreating, but on the contrary suddenly charged to meet it, his whole body emanating a dust yellow light, colliding with it head on. In terms of defensive strength, the Elephant Armored School’s Mammoth spirit might be second only to the pure defense Defense Hall’s Armor Plated Giant Rhinoceros spirit. Even though he still hadn’t reached the Title Douluo level, the majority of Title Douluo couldn’t match him in pure defense. This polearm seemingly without even a trace of spirit power wasn’t worthy of Huyan Zhen’s attention.</p><br/><p>“Don’t block it!”</p><br/><p>Bibi Dong’s voice came from behind. But, her warning still arrived a bit too late.</p><br/><p>From between Tang San’s eyebrows, a ray of deep golden light suddenly caught up to the Seagod Trident in midair, directly stabbing into that Seagod’s Heart. In just a split second, the Seagod Trident instantly turned golden, the dazzling light immediately becoming the focal point of everyone there.</p><br/><p>Boom——</p><br/><p>The Seagod Trident’s main blade thrust directly into the mammoth’s head. That instantly erupting intense golden light shocked the Elephant Armored School disciples around Huyan Zhen to slow down for a moment.</p><br/><p>The mammoth’s defense really was astonishing, even a divine tool like the Seagod Trident couldn’t pierce through Huyan Zhen’s body. But even so, fully half of the polearm had stabbed into his spirit avatar form. The pressure of the terrifying one hundred eight thousand jin weight instantly tore Huyan Zhen’s four limbs apart. He collapsed to the ground with a thump, without signs of life.</p><br/><p>With spirit power at rank eighty nine, about to attack the Title Douluo Level, one of the spirit world’s new seven great sect masters, widely known for his defense, Huyan Zhen was instantly killed by Tang San’s single attack.</p><br/><p>Not only did the Sacred Dragon Legion’s energy slow, even on the Heaven Dou Empire’s side, marshal Ge Long couldn’t keep from drawing a cold breath when he saw this. He of course knew of Heavenly Elephant Huyan Zhen, he himself possessed a defensive type spirit. Seeing Huyan Zhen brutally killed by Tang San’s single strike without using his spirit, he now finally understood why Tang San could be seated above the grand marshal of the army, and even be respected by His Majesty as Imperial Tutor. This apparently only twenty something youth, was actually formidable to such a level.</p><br/><p>Landing on the Sacred Dragon Legion along with the Seagod Trident, was also that raging killing intent. After his spirit power reached rank ninety, Tang San’s Deathgod Domain had certainly also risen to its highest level. That terrifying bloodlust engulfed all the Elephant Armored School and Sacred Dragon School spirit masters all at once.</p><br/><p>“Charge into the formation to avoid group attack spirit abilities.”</p><br/><p>Tang San shouted. Turning into a blur, he dashed over to Huyan Zhen’s corpse. Brandishing his right hand, he drew the Seagod Trident. In this moment, he simultaneously also released his spirit.</p><br/><p>Without hiding anything, illuminated by the golden light of the Seagod Trident, Tang San’s five black and four red terrifying spirit rings suddenly appeared before all the spirit masters. The visual impact of this moment made the Sacred Dragon Legion see an invisible enemy, and it gave the Heaven Dou empire Side both extreme shock and ecstasy. Even the the always steady Grandmaster now couldn’t help crying out in shock.</p><br/><p>Boom—— Tang San swept the Seagod Trident horizontally, and an Elephant Armored School disciple also in spirit avatar was blown flying. His giant body crashed into the spirit master formation behind, instantly causing chaos. Simultaneously using the counterforce to flip back, his left leg released red light that turned into a giant axe, instantly cutting apart two Elephant Armored School Disciples.</p><br/><p>Bibi Dong’s mental pressure descended. Tang San knew he didn’t have much time, he had to release his killing power as far as possible before she arrived, killing the enemies.</p><br/><p>Right now there were constantly furious Elephant Armored School disciples surrounding Tang San. Some Sacred Dragon School experts were also charging at him, headed by a spirit master transformed into a white giant dragon who directly spit a white breath attack at Tang San. This spirit master shockingly had nine spirit rings.</p><br/><p>Tang San didn’t use his group attack abilities. Facing so many power attack spirit masters known for their defense, even with his Title Douluo level strength, even with hundred thousand year spirit rings, his large scale attacks could at best injure these spirit masters, and likely not even harm them seriously. Scratching an area was inferior to destroying a part. Bibi Dong’s presence was already descending, and Tang San knew there was only room for one last attack left.</p><br/><p>With a pop, a giant azure dragon illusion appeared behind Tang San. His right arm instantly turned completely azure, and even the dazzling golden Seagod Trident also turned azure. Ever since he first obtained the Seagod Trident, this divine weapon had only had two colors, black and gold. But at this moment, it produced yet another, how could people not be shocked?</p><br/><p>It was also at this moment that three rays of bright light simultaneously shone from Tang San’s back, each being spirit power boost, attack boost, as well as attribute boost. Ning Rongrong’s assistance had arrived.</p><br/><p>Along with a dragon’s cry shaking the sky and snapping peals of thunder, a dragon shaped azure thunderbolt exploded from the Seagod Trident’s main blade.</p><br/><p>Boom, the White Armored Dragon’s breath attack was also an eighth spirit ability, but within this azure dragon shaped thunderclap, it didn’t have even a bit of blocking effect. As that dragon cry reverberated, the scales of all the Sacred Dragon School disciples stood erect. This was the effect of meeting a higher ranked of the same race. Even this Title Douluo level power was equally pressured.</p><br/><p>With a pop, that azure dragon shaped lightning bolt disappeared noiselessly, just on top of that white armored dragon. In just an instant, that white armored dragon’s body was completely dyed azure, and with the next strong gust of wind, turned into scattering azure ash. Not even the bones were left behind.</p><br/><p>Seeing this attack be so unexpectedly powerful, even Tang San couldn’t help being shocked. Turning his head to look at Ning Rongrong behind him, he knew that even though this attack was strong, without Ning Rongrong’s ninety percent boost effect, he absolutely couldn’t have instantly killed this Title Douluo. After all, even hundred thousand year spirit abilities wouldn’t be so terrifying as to instantly kill equally leveled spirit masters.</p><br/><p>The azure dragon shaped thunderbolt Tang San used was the second ability of his Sky Blue Bull Python right arm spirit bone, Sky Blue Fading Thunderclap. Single target attack spirit ability. Issuing this attack through the Seagod Trident would not only doubly condense the might of the Sky Blue Fading Thunderclap, at the same time it would also save Tang San thirty percent spirit power.</p><br/><p>How could a true divine instrument be simple? Tang San had in recent days been digesting the information the Seagod Trident had branded in his brain, and had also each day made great effort to cultivate his own trident. Even though the Seagod Trident was formidable, as long as the opponent was familiar with its attributes, the strength it could display in a real battle was undoubtedly greatly reduced. Only by having it completely fuse with his own spirit abilities could this divine tool be fully effective.</p><br/><p>Only ten breaths of time had passed since Tang San went to battle, but he had already instantly killed both Elephant Armored School master Heavenly Elephant Huyan Zhen, as well as just now with the Sky Blue Fading Thunderclap, the only Title Douluo of the Sacred Dragon School, the Sacred Dragon School sect master, Sacred Dragon Tuoba Xi. At the same time, these two were also the main and vice commanders of the Sacred Dragon Legion. Even Tang San himself hadn’t expected to have beheaded the enemy so soon with his all out attack.</p><br/><p>This was also why Bibi Dong had previously been disturbed enough to immediately throw herself into the battlefield when she saw Tang San attack before. The effect of a single true power on the battlefield could scarcely be imagined.</p><br/><p>Only, it was also at this moment that Tang San’s crisis descended. The ground beneath him suddenly shook. Tang San only felt his body be instantly restrained by an incorporeal force. Immediately after, countless black and purple thorns burst out from the ground, seeking to pierce his body. The Spirit Empire’s empress, Bibi Dong, had finally arrived.</p><br/><p>While Tang San entered the battle, the Shrek Seven Devils hadn’t been idle either. With his powerful disposition, Dai Mubai had directly charged the enemy formation, simultaneously producing his support abilities and transforming into a white tiger, he had already dealt with two Elephant Armored School rank sixty experts. Ma Hongjun had first unleashed his Phoenix Meteor Shower on the rear of the Sacred Dragon Legion, and then immediately immolated a spirit avatar white armored dragon with a Phoenix Cloud Piercing Strike, simultaneously entering battle mode.</p><br/><p>Oscar ate a mirror sausage made from a drop of Dai Mubai’s blood, producing his clone at the same time. Xiao Wu was just nimbly breaking the neck of a white armored dragon spirit master.</p><br/><p>Their strength might not reach this degree individually, but don’t forget that behind them stood the world’s number one support spirit master Ning Rongrong. With har various ninety percent boosts, every one of the Shrek Seven Devils undoubtedly possessed Title Douluo level strength right now.</p><br/><p>Yang Wudi’s Soulbreaking Spear was equally tyrannical. Whether mammoths or white armored dragons, their defense basically couldn’t slow Yang Wudi’s Soulbreaking Spear. In terms of numbers of enemy killed, he actually had the most. The strongest attack plus the strongest support, the terror of the destructive power left people gasping.</p><br/><p>Dugu Bo had sneakily appeared in their rear. Now in his Jade Phosphor Serpent Emperor form, the supreme poison he spit out was spreading, and even the ground had turned faintly jade colored.</p><br/><p>Boom—— The Seagod Trident’s shaft heavily smacked the ground, pulverising all those protruding thorns. Tang San also used this moment to leap into the air. The Blue Silver Emperor instantly disappeared, and the Clear Sky Hammer with red, black, black spirit rings suddenly appeared in his hand. Without any pause whatsoever, the Clear Sky Hammer rose, and a line of mixed yellow and black light blasted out in a giant shockwave, straight at Bibi Dong, now already incarnated as a Death Spider Emperor in midair.</p><br/><p>Bibi Dong was truly angry now. The carapace on her chest congealed, and both taloned hands sliced out simultaneously. Countless purple black blades formed a bizarre shield in front of her, rigidly blocking Tang San’s attack. Only, Bibi Dong also felt herself sink, falling straight towards the ground.</p><br/><p>Tang San grunted, his body blurring in midair as he flipped over, the point of the Seagod Trident breaking the neck of a mammoth, and he retreated more than ten steps before catching his balance.</p><br/><p>Even though he was already rank ninety three, even though he used the Clear Sky Hammer to release the Titan Giant Ape left arm bone ability Titan Firmament Breaker, the absolute gap in spirit power still left him at a disadvantage. Just like he completely suppressed these Sacred Dragon Legion spirit masters before, Bibi Dong’s spirit power had a completely suppressive effect on him.</p><br/><p>Spirit Hall’s spirit master legions were worthy of being called elite. After a brief battle, now that they saw Bibi Dong leading a group of Title Douluo over, they quickly split into two groups to circle around either side, simultaneously leaving space for the Title Douluo to fight in between.</p><br/><p>Bibi Dong had brought altogether eight Title Douluo, and even though Tang San’s side also had eight people, Ning Rongrong was a support type spirit master. With her support, his comrades could display the strength of Title Douluo, but without a doubt, the Spirit Hall powers overall suppressed the Heaven Dou Empire’s side. This was also without even considering that, besides Tang San, the other Shrek Seven Devils’ Title Douluo level strength couldn’t last.</p><br/><p>Seven of the Spirit Empire Title Douluo each found Dai Mubai, Oscar, Ma Hongjun, Xiao Wu, Zhu Zhuqing, Yang Wudi as well as Dugu Bo. The remaining one chose Ning Rongrong. They could naturally tell that Ning Rongrong was crucial to the battle. As long as they killed her, the Heaven Dou Empire side would instantly collapse.</p><br/><p>“Don’t mind me!”</p><br/><p>Ning Rongrong shouted, her support light not fading in the slightest. With her spirit power at rank eighty three, even supporting eight people at the same time, besides Xiao Wu, the other seven could stand up to their opponents.</p><br/><p>Even Xiao Wu wouldn’t have any problems for a while. Even though she couldn’t possibly defeat a Title Douluo level opponent, with Ning Rongrong’s support plus her Teleportation and Invincible Golden Body, transforming into a swift little rabbit, there was no concern for her defense for now.</p><br/><p>Yang Wudi and Dugu Bo both met old enemies. Yang Wudi faced Snakelance Douluo, while Dugu Bo was restrained by that toxic Blowfish Douluo.</p><br/><p>It is said that enemies meeting their personal foes are especially furious. After Blowfish Douluo was seriously injured last time, he had so spend a full year to recover his former strength. Now that he met Dugu Bo again, he wasted no words and directly launched his attack, quickly swallowing the poison Dugu Bo released.</p><br/><p>Meeting this opponent, Dugu Bo was also helpless. His poison had only just spread to ten something Elephant Armored School and Sacred Dragon School disciples, and still hadn’t fully shown its effect before he yet again ran into this fellow whose spirit restrained his. The Jade Phosphorous Serpent Emperor flared with light, and directly tackled the enemy.</p><br/><p>The one attacking Ning Rongrong was an agility attack type Title Douluo, expert in both speed and attack. His spirit was a Black Lined Ghost Panther. He instantly accelerated after transforming into spirit avatar form, only leaving behind a faint black afterimage in the air, before he was already in front of Ning Rongrong.</p><br/><p>But at this moment, Ning Rongrong’s Nine Treasure Glazed Tile Pagoda’s eighth spirit ring quietly brightened, black light surging out. In an instant, the originally dazzling Nine Treasure Glazed Tile Pagoda instantly flashed with light, countless bright lights condensing as it suddenly expanded. With just a flash, that Ghost Panther Douluo felt like he had run into an iron wall, and he was flung rolling back.</p><br/>\n</div>"}