{"title": "Chapter 288", "id": 288, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-288", "volume_title": "Volume 3", "body": "<h1>Chapter 288</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 288</p><br/><p>Devilgod Possessed Dark Devilgod Tiger</p><br/><p>(TL by Bagelson)</p><br/><p>“Tang San, why is it you……”</p><br/><p>All the images that appeared in the depths of Qian Renxue’s soul were the things she recalled the deepest. But she had never thought that this third obsession would actually be caused by Tang San. The youth lightly caressing the harp in front of her, wasn’t that exactly the scene of Tang San’s show at the Moon Pavilion’s graduation ceremony?</p><br/><p>Qian Renxue only now understood that Tang San of that time was already on her mind. At that time she had accompanied Xue Qinghe’s little sister to that graduation ceremony, and even teased the princess for falling for Tang San. But she didn’t expect that time would stick in her heart as well. At this moment she finally understood why, even though she clearly had a chance to win in the battle back then, she still repeatedly hoped Tang San would submit to her. In the depths of her heart she longed to conquer him this much. This was the only man that stepped into her heart.</p><br/><p>Hearing Qian Renxue call his name, the Tang San shadow deep in her soul slowly stood, facing her with a smile, opening his arms wide. The harp was gone, only that gentle embrace remained in Qian Renxue’s eyes.</p><br/><p>She unhesitatingly threw herself into that hug, warmth permeated her mind and instantly spread through her entire body, all the pain seeming to disappear. She tightly pulled herself close to this graceful man, practically as if merging herself into him.</p><br/><p>Unconsciously, the man’s clothes also disappeared. The two naked bodies embraced each other tightly, and unprecedented pleasure flooded Qian Renxue’s heart like a tidal wave. She even forgot that she was undertaking the inheritance of the god of angels right now, her entire soul was filled by that man’s figure. Answering frantically, then from passive to initiative, even though she was already in her thirties, this was still the first time she had been together with a man.</p><br/><p>Her heart trembled, her soul trembled, her body even spasmed as that tidal climax progressed. Her pain and suffering, all her longing, erupted fully in this moment.</p><br/><p>Ever since she was born, Xien Renxue had always had a dark side deep in her heart, and in the process of accepting the inheritance of the radiant god of angels, all dark sides became obstacles to her becoming god. But at this moment, as she could express all the pain her heart held, her road to divinity had become unobstructed.</p><br/><p>In the Angel Shrine, Qian Renxue’s body was already floating in midair. The six wings behind her constantly beat softly, and her body jerked and contorted, golden light constantly moving across her. One could vaguely see that her skin had already become completely pink, liquid flowing down her thighs. The golden liquid the previously flowed across her had left her skin and gradually formed about one centimeter away.</p><br/><p>Ah—— Qian Renxue suddenly shouted loudly, her body contorting quickly. The liquid suddenly erupted, and the next moment, with a series of resounding sounds, her whole body began to show fantastic changes.</p><br/><p>That golden line liquid instantly formed, dazzling golden armor forged perfectly according to her body. Bulging chest armor, slender waist armor, perfectly round shoulder armor, as well as other perfectly proportioned armor pieces, enveloping her entire body. That little angel brand on her forehead equally burst with light, turning into a circlet across her forehead. In the middle of the circlet, a small angel shaped gem glinted. Waves appeared on the edges of the circlet, forming altogether seven crests, making it look like a princess diadem.</p><br/><p>The feather design spread to every corner of the armor, and the six wings on her back had already turned sparkling gold. With slow vibrations, golden ripples constantly spread out in circles around Qian Renxue. The guard of that now completely golden Angel’s Sword in her hand unfolded, looking like a pair of angel wings. An enormous golden wave rose from underfoot, instantly permeating every part of Qian Renxue’s body. Behind her, an extremely enormous angel shadow appeared, overlapping, slowly shrinking, until it completely blended into her.</p><br/><p>The light of the angel shaped gem on her forehead glittered, turning into an ice cold surge that abruptly invaded the depths of Qian Renxue’s soul, then instantly erupted.</p><br/><p>All illusions instantly disappeared. The man who was just leading her to climb to the peak was shattered in the golden light, and Qian Renxue’s soul almost instantly came awake. An incomparably powerful feeling replaced the previous ecstatic bliss, making her whole body shiver.</p><br/><p>As she slowly opened her eyes, everything around her became clear, power as if she could control heaven and earth, and point out the paths of the stars, almost made her moan.</p><br/><p>Illusion, everything just now was an illusion. Qian Renxue floated there despondently. She suddenly discovered that, after she truly inherited the angel divinity, she wasn’t as excited as she had expected, and on the contrary disappointed as if she lost something. Deep in her soul, she longed even more to soak in that warm embrace and incomparable pleasure.</p><br/><p>Her lower body still felt a bit slippery. Even if her strength had already become incomparably powerful, the feeling of going from girl to woman still lingered.</p><br/><p>“I, I actually wanted to……”</p><br/><p>Even Qian Renxue herself didn’t know what to think. But she deeply understood that those three shadows that appeared, those three obsessions, where the people that could influence her after she became god.</p><br/><p>Her grandfather had already sacrificed himself for her, Bibi Dong was in the end still her mother, but, Tang San who appeared last, the deepest obsession that helped her complete this path to divinity, how would she face him again? He was an enemy. There were only two ways to break this obsession, either conquer him, or destroy him.</p><br/><p>Ah—— Qian Renxue shouted once again, intense golden lines of light abruptly spreading out from her. On her body, the Angelic Raiment had already turned into a true Angelic Raiment. One feather-shaped pattern of light after another drifted out, spinning violently around her.</p><br/><p>Spirit City, Elder Palace</p><br/><p>In the heart of the palace, the giant angel statue shuddered without warning, fine lines of golden light starting to emerge on the surface, radiating intense golden light patterns.</p><br/><p>Boom—— The entire statue shattered, turning into countless golden motes of light surging in the air. At the heart of the explosion, fully dressed in golden armor, six wings softly beating, Qian Renxue had returned. To be precise, it should be, God of Angels Qian Renxue, had returned.</p><br/><p>Raising the Angel’s Sword high above her head, surging golden flame turned into a golden pillar that shot towards the sky, instantly breaking through the peak of the hall. Enormous energy fluctuations erupted in succession, making the sun lose its color.</p><br/><p>……</p><br/><p>Bibi Dong sat upright cultivating in the carriage. Her body really was too weak, to the point that they couldn’t rush. The magnificent Spirit Empire empress, now only guarded by a hundred imperial spirit masters and Hu Liena.</p><br/><p>Close to three days had passed since leaving Jialing Pass, but the road to Spirit City was still long. Bibi Dong’s condition had only recovered slightly, and full recovery was still very far away.</p><br/><p>Just as they advanced, suddenly, the spiderweb pattern on Bibi Dong’s forehead brightened, and she opened her eyes from her previous weak cultivation, her eyes brimming with difficult to conceal shock. She rushed out of the carriage in a blur, staring towards Spirit City.</p><br/><p>All she saw was the vast horizon, but she seemed to really see something. Her body trembled uncontrollably, her fists clenching, not even noticing how her fingernails stabbed into her palms.</p><br/><p>“No, this is impossible. He’s just the Angel God’s guardian, how could he become god? How could there be this kind of aura, how?”</p><br/><p>“Teacher, what is it?”</p><br/><p>Hu Liena jumped with fright at Bibi Dong’s sudden movements, hastily coming over to support her.</p><br/><p>Bibi Dong, powerless, fell limply into Hu Liena’s arms, only repeating that phrase. Impossible……</p><br/><p>Someone else felt it at the same time.</p><br/><p>Flying quickly for three days, Tang San had already reached the Star Dou Great Forest. The moment he just landed in the forest, a red hot feeling on his forehead suddenly pulled his gaze in one direction.</p><br/><p>Tang San vaguely seemed to see a giant angel figure appear on the horizon. That giant angel figure seemed like it covered everything, hiding the sky and covering the earth. Enormous pressure made the Seagod Trident brand on his forehead grow hotter and hotter, all his blood seeming to boil.</p><br/><p>This was…...</p><br/><p>Tang San halted, seriously looking in the direction the presence came from. Judging by its position, it should be straight towards Spirit City! Could something have changed in Spirit City? This energy was extremely similar to that Seraphim spirit Qian Renxue had when they fought, but way more powerful. Could it be Qian Daoliu? But, was this really energy a human could emit?</p><br/><p>Tang San really hadn’t cultivated for long, and his understanding of the Seraphim spirit was far from as incisive as Bibi Dong. Therefore he didn’t feel it as deeply as Bibi Dong, but he equally felt like an enormous rock was weighing on his chest, unspeakably uncomfortable. This kind of feeling recovered as that angel figure on the horizon gradually vanished.</p><br/><p>Indeterminate light sparkling his his eyes, Tang San only calmed down after a long time. No matter, whatever it was, right now his first order of business was to inherit the Seagod. Only by becoming Seagod could he truly have the strength to reverse the situation.</p><br/><p>Thinking so, Tang San gripped the Seagod Trident, walking into the Star Dou Great Forest in big strides.</p><br/><p>Tang San’s Clear Sky Hammer already had three spirit rings, and the requirements for his Seagod Eighth Trial was to fill up his spirit rings, then complete the spirit bones, defeating the Deep Sea Demon Whale King. Consequently, this time he came to the Star Dou Great Forest to catch another five spirit rings, raising the Clear Sky Hammer’s spirit rings to eight. The last spirit ring and spirit bone would wait until he had killed the Deep Sea Demon Whale King.</p><br/><p>The Star Dou Great Forest had numerous spirit beasts, and even though hundred thousand year cultivation spirit beasts were limited, there was quite a lot with more than fifty thousand year cultivation. Relying on the Blue Silver Domain’s advantage in the forest, as Tang San advanced this time, he was prepared to catch five spirit rings as fast as possible, then converge with his companions and go hunt the Deep Sea Demon Whale King, and then return to Seagod Island for his final trial.</p><br/><p>Last time when Tang San met Tang Chen, Tang Chen had also said he would go to Seagod Island. Tang San was also preparing to ask his great grandfather to come back when he went there this time. His great grandfather was now at least at the half divinity level, plus if he could inherit the Seagod’s position, the events on the Continent wouldn’t be any problem. The day when Spirit Hall was thoroughly eliminated wasn’t far.</p><br/><p>Therefore, even though the presence from Spirit City weighed on his heart, he was still full of confidence. With his great grandfather here, or if he completed the Seagod’s inheritance, would he still need to fear Qian Daoliu?</p><br/><p>Stepping into the Star Dou Great Forest, the fresh and clean air mixed with the scent of plants washed over his face and penetrated deep into his heart. Tang San couldn’t help feeling moved. He still deeply remembered the nervousness and excitement the first time he came to the Star Dou Great Forest. The events that time could be said to have had an extremely important effect on maturing him. He had a special affection for this great forest.</p><br/><p>The first time he came here he had obtained the thousand year Man Faced Demon Spider spirit, and it was also at that time he deeply experienced the pain of not being strong enough. Of course, that was also his first meeting with Titan Giant Ape Er Ming.</p><br/><p>To save Xiao Wu, Da Ming and Er Ming had sacrificed themselves. If they watched on from Heaven, they would definitely be very happy to see Xiao Wu resurrected. The Star Dou Great Forest made Tang San most grateful, it was the place that had born Xiao Wu. Xiao Wu had lived here for a hundred thousand years! Xiao Wu, I will definitely protect you, I definitely won’t let you be harmed again. Once the Spirit Empire is destroyed, I will definitely give you the grandest wedding, to make you my wife.</p><br/><p>Thinking of Xiao Wu, Tang San couldn’t help the tender feelings in his heart. Even though they had just separated a few days ago, his heart was already filled with her shadow, one day of separation was like three autumns apart. Tang San especially treasured being together with Xiao Wu after so many events. If not for the current urgency, he absolutely wouldn’t have left her.</p><br/><p>With a whoosh, a spirit beast leapt out not far ahead of Tang San. Tang San woke up from dreaming about Xiao Wu, and couldn’t help laughing at himself. His current attitude really was too different from the past. If it was before, maybe he would already be nervously on guard. But now he basically didn’t need to worry. Even if he was attacked by any spirit beast here, thou couldn’t possibly do him any harm. Even the fifty thousand year spirit beasts he was targeting now weren’t enough to be any threat.</p><br/><p>Faint blue filled Tang San’s eyes. In order to save time, he directly used his Blue Silver Domain.</p><br/><p>Gentle blue light rippled out like waves. The moment the Blue Silver Grass on the ground came into contact with the light, they immediately swayed softly as if alive. The blades of grass all pointed towards Tang San, drifting and waving cheerfully. Tang San could deeply feel their joy.</p><br/><p>Releasing a gentle soothing through his mental strength, feeling more and more blue silver grass join in his domain, Tang San’s mental strength also expanded. The blue silver grass were his eyes. At his level, releasing the Blue Silver Domain didn’t exhaust anything. His spirit power recovery rate was higher than the Blue Silver Domain’s consumption rate. Twin spirits as well as the Seagod’s Light gave him enormous benefits. Even if he now fully used his spirit avatar, it’d just exhaust a little bit.</p><br/><p>Perhaps due to sensing the Blue Silver Domain’s energy fluctuations, the Star Dou Great Forest immediately quieted down. Within Tang San’s boundless mental strength, large numbers of low level spirit beasts grew quiet, not even thinking of running away, only quietly crouching to the ground, not daring to even budge. And Tang San basically wouldn’t let higher level spirit beasts even sense him. The Blue Silver Domain made him into one with the Star Dou Great Forest.</p><br/><p>Soaring up, guided by the Blue Silver Domain, Tang San took flight once again, flying straight towards the middle of the forest. With the help of the Blue Silver Domain, he basically didn’t need to see with his eyes to easily avoid all obstacles, flying forward towards the depths of the Star Dou Great Forest like a wisp of blue smoke. High level spirit beasts only lived in the center.</p><br/><p>Very soon, Tang San found his first target. Guided by the Blue Silver Domain, he targeted a spirit beast.</p><br/><p>Rather fortunately, Tang San sensed this spirit beast before he even approached the depths of the forest. After the Blue Silver Domain evolved one again, it’s sensory capabilities grew one step stronger. Sensing through the domain, Tang San could even accurately judge the spirit beast’s cultivation age. This spirit beast he found had a cultivation of roughly sixty five thousand to sixty eight thousand years. It was a pretty good choice. Moreover, it also had the attributes he needed.</p><br/><p>Tang San flew closer. With his speed plus the Blue Silver Domain’s perception, even agility attack type Title Douluo might not be able to keep up with him in this forest. He found his target in just a moment.</p><br/><p>Just as the distance shrunk to a hundred meters, suddenly, Tang San felt the light around him dim. The sky was clear for ten thousand li, the sun was shining, but inside the forest it was still gloomy.</p><br/><p>Yi, what’s this? With Tang San’s Blue Silver Domain perception he had discovered that this spirit beast should be a tiger type, which relied mainly on strength. Due to cultivating the Great Sumeru Hammer, what he needed was strength types, what spirit beast it was was inconsequential. But the light suddenly dimming could only prove one thing, this tiger type spirit beast really wasn’t an ordinary spirit beast. And it was a spirit beast with a domain.</p><br/><p>In fact, in the spirit beast world, only hundred thousand year spirit beasts would certainly possess domains. In other words, after spirit beasts reached a hundred thousand year cultivation they would naturally develop their own domain. On this point, peak spirit beasts were even superior to Title Douluo level spirit masters. But this sixty something thousand year spirit beast already had a domain. This proved that its quality was definitely astonishing. It was very possibly a creature not inferior to the Titan Giant Ape and Sky Blue Bull Python, just missing the cultivation.</p><br/><p>This discovery was a pleasant surprise to Tang San. The stronger the spirit beast, the stronger the attributes and spirit power increase from the spirit ring. With his strength, killing ordinary hundred thousand year spirit beasts wasn’t too difficult, and he naturally didn’t need to worry that this sixty thousand year spirit beast would be much trouble. Immediately, Tang San flew straight towards his target as led by the Blue Silver Domain. At the same time, he also raised the Seagod Trident.</p><br/><p>He didn’t have the time to waste here, he had to leave for the Seagod Hall as soon as possible. The light dimming and the changes in the surroundings let the experienced Tang San immediately judge that this spirit beast’s domain should be a darkness type. And his own Seagod Trident was dual water and light attributed, and its additional divine aura had a powerful restraining effect on this kind of darkness domain.</p><br/><p>Of course, darkness also opposed light. Only, even a hundred thousand year level darkness attributed spirit beast couldn’t suppress the Seagod Trident. That was a true divine instrument. In terms of attributes, Tang San already had full control.</p><br/><p>A ray of Seagod’s Light abruptly shot like lightning from Tang San’s forehead, sinking into the Seagod Trident. Immediately, gaudy golden light erupted from the Seagod’s Heart, and the Seagod Trident also instantly began to emanate golden light. It dispersed the surrounding darkness, lighting up the way.</p><br/><p>Roar—— A long roar echoed at the same time as the Seagod’s Light appeared. Tang San immediately saw a giant spirit beast sharply get up from the ground not far ahead, its vicious eyes turning in his direction.</p><br/><p>That was a black giant tiger, pure black all over, without a speck of other color. Red eyes brimmed with viciousness. It was no less than eight meters long, bulging with muscle, maybe weighing more than three thousand jin. The ‘king’ mark on his forehead was also black, but a different black from its fur, a black as gloomy as mist. Most peculiar was its tail. It was much longer compared to ordinary tiger type spirit beasts, and standing up, formed from countless bone joints, with a giant barb at the top, glinting with cold light.</p><br/><p>As he saw it, Tang San immediately thought of a special type of spirit beast Grandmaster once told him about. It was a spirit beast even more rare than the Man Faced Demon Spider, and almost eradicated. Grandmaster had also consulted an ancient text, and because this kind of beast was very peculiar as well as extremely rare, Grandmaster hadn’t described it in detail at the time, but still told Tang San that this was a first rate spirit beast. It was also just because it was too outstanding that it was difficult for it to survive in the spirit beast world, that’s why it would be so rare.</p><br/><p>According to the ancient accounts, the name of such a spirit beast was Dark Devilgod Tiger. In legends, it was a mutation that occurred as an evil god descended on a white tiger, turning the white tiger’s originally light attributes into darkness, producing black wings of corruption, as well as that scorpion tail-like Devilgod Hook.</p><br/><p>The Dark Devilgod Tiger was extremely powerful. Generally speaking, spirit beasts all had a chance of being human spirits, but this Dark Devilgod Tiger was an exception, there had never been any humans with it as spirit. In itself it really didn’t have the darkness attribute, but rather the evil attribute left by the Devilgod. That basically wasn’t something humans could endure. If it was evaluated according to spirit levels, then it would absolutely be a peak spirit comparable to the Seraphim.</p><br/><p>The Dark Devilgod Tiger possessed an extremely overbearing talent. It didn’t mature through cultivation. Its own cultivation was extremely difficult, and it could only quickly rise in strength through devouring spirit beasts or human spirit masters’ spirit power. Consequently, no matter what environment it appeared in, such a spirit beast would immediately draw down the universal hatred of other spirit beasts, who would destroy it before it had a chance to grow strong. Even thousand year level Dark Devilgod Tigers were very rare, let alone the one in front of Tang San with a full sixty thousand years. According to what Grandmaster said, such a first rate spirit beast was enough to challenge enemies that surpassed it. In other words, the ten thousand year level Dark Devilgod Tiger could even challenge hundred thousand year level spirit beasts.</p><br/><p>Roar——</p><br/><p>Getting up as it saw Tang San, the giant Dark Devilgod Tiger’s blood red eyes instantly flashed. Even facing the Seagod Trident, it actually didn’t have even the slightest thought of escaping. That roar was instead filled with excitement. Slowly raising its paws, it walked step by step towards Tang San.</p><br/><p>Just the fact that it faced the divine light radiating from the Seagod Trident without flinching was enough to prove the strength of the Dark Devilgod Tiger. At the same time, Tang San felt his left and right arms heat up simultaneously, excited energy pulsing rhythmically.</p><br/><p>Those weren’t fluctuations from the Mysterious Heaven Skill, but rather the spirit bones in his left and right arm. Very clearly, the Titan Giant Ape’s soul in the Titan Giant Ape left arm bone and the Sky Blue Bull Python’s soul in the Sky Blue Bull Python right arm bone recognized this Dark Devilgod Tiger, and the excitement it caused really wasn’t friendly, but rather filled with hostility. But it was also excitement without any thought of cowering.</p><br/><p>One clue reveals the general trend. With Tang San’s intelligence, this simple detail immediately proved that this Dark Devilgod Tiger definitely had history with Da Ming and Er Ming. To become the enemy of the forest kings Da Ming and Er Ming, and moreover still appear living in front of him, proved one step further this Dark Devilgod Tiger’s terrifying strength.</p><br/><p>Tang San’s judgement was correct. Even Da Ming and Er Ming who were practically the strongest in the Star Dou Great Forest still didn’t have absolute strength. Even though this Dark Devilgod Tiger’s cultivation was just sixty thousand years, its frightening abilities and strength made even Da Ming and Er Ming cautious. Both sides had fought several times, and even if Da Ming and Er Ming successfully drove the Dark Devilgod Tiger out of the Star Dou Great Forest, that was all they managed. They couldn’t directly kill it.</p><br/><p>After Da Ming and Er Ming sacrificed themselves to Tang San and the vast forest lost the presence of the two forest kings, this Dark Devilgod Tiger, coveting the numerous spirit beasts within the forest where it could grow quickly, had quietly returned.</p><br/><p>Just at the start it was completely cautious, always probing for Da Ming and Er Ming’s presence. After all, before it reached a hundred thousand year cultivation, it still couldn’t defeat the two forest kings together in a frontal confrontation.</p><br/><p>Very soon it discovered that there were no longer any signs of Da Ming and Er Ming in the center of the Star Dou Great Forest, and then openly made its return. But, it also knew that its cultivation style would anger all spirit beasts, and thus it didn’t immediately enter the heart of the forest, only roaming the outside, killing some relatively weak spirit beast to strengthen itself, preparing to kill its way into the Star Dou Great Forest once it was strong enough and taking revenge on those tens of thousands of years old spirit beasts. If the Dark Devilgod Tiger cultivated to the peak, it would extremely possibly become a Devilgod. Its intelligence was no less inferior to humans. This Dark Devilgod Tiger in particular was especially bright. Otherwise it couldn’t possibly have survived this long, cultivating to this stage.</p><br/><p>Sensing the divine presence from the Seagod Trident Tang San held, it also wasn’t suppressed, the Devilgod blood it had inherited only made it loathe the Seago Trident.But at the same time it also felt Tang San’s spirit power fluctuations. Tang San’s pure spirit power aura made it extremely excited. It clearly understood that swallowing Tang San might be even better than swallowing a hundred thousand year spirit beast’s cultivation. Even though that Seagod Trident made it slightly restless, it had still never been defeated by humans. Plus its cultivation already reaching the sixty thousand year level, it was naturally full of confidence. But even so, its movements were still extremely careful, it also sensed danger from Tang San.</p><br/><p>Only, the Dark Devilgod Tiger still couldn’t ignore Tang San’s lure. It judged that, if it could devour Tang San’s spirit power, then it could very possibly break through the hundred thousand year realm in a very short time. Its strength didn’t need to be weighed in age. As long as its strength could progress, then even if Da Ming and Er Ming came back to life they couldn’t do anything to it.</p><br/><p>Data flashed through the Dark Devilgod Tiger’s mind, adding its own judgement. Tang San’s divinity also grew heavier. If he faced a spirit beast that even Da ming and Er Ming couldn’t destroy, then this battle wouldn’t be that simple. Of course, the spirit ring from killing this Dark Devilgod Tiger would definitely be much stronger than an ordinary fifty thousand year spirit beast. He had to obtain altogether five spirit rings in the Star Dou Great Forest, and this Dark Devilgod Tiger was the perfect start.</p><br/><p>Black and red, spirit rings of two different colors began to rise from below Tang San, circling around him. Blades of crystalline Blue Silver Emperor began to appear around him. The Blue Silver Domain abruptly contracted, only remaining within a hundred meter range with Tang San as center. He didn’t want to lightly draw on the strength of the blue silver grass in the forest, because he couldn’t possibly fight every battle where there was blue silver grass. With the Blue Silver Domain this small, it was just where the effect of his Blue Silver Emperor spirit amplification was best. Confronting this uncommon spirit beast, Tang San was already completely serious, without any carelessness.</p><br/><p>The giant Devilgod Hook on the Dark Devilgod Tiger’s back slowly rose, slowly waving behind it. Each time it moved, it would cause a series of bizarre distorted light halos in the air. Its body was black, but the energy fluctuations it emanated were really gray, a gray filled with evil influence. With each step forward, the surrounding plants would automatically part to open a path, and even the blue silver grass within the Blue Silver Domain’s range was no exception. The temperature in the forest seemed to suddenly drop. That was the cold of wickedness. Tang San had only felt this kind of cold from when Bibi Dong used her second spirit, Soul Eating Spider Emperor.</p><br/><p>Revealing a faint smile, Tang San slowly raised his right hand, holding the Seagod Trident horizontally next to him. Black, black, black, black, red, black, red, red, red, nine spirit rings appeared in neat order, undulating slightly. But he still didn’t release the powerful energies, all the spirit power fluctuations were fully introverted.</p><br/><p>It also wasn’t the first time the Dark Devilgod Tiger had faced human spirit masters. Seeing the relatively neatly colored spirit rings Tang San had, its blood red eyes also turned a bit cautious. Its pace slowed a step, but its aura became increasingly tyrannical. The battle could begin at any moment.</p><br/>\n</div>"}