{"title": "Chapter 292", "id": 292, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-292", "volume_title": "Volume 3", "body": "<h1>Chapter 292</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 292</p><br/><p>Ninety Thousand Years! Three Fifteen Ton Ant Emperor Brothers</p><br/><p>(TL by Bagelson)</p><br/><p>Tang San gently caressed the still somewhat hot Eight Spider Lances, thinking: It seems the Star Dou Great Forest really is my land of opportunities, and that time with Xiao Wu was just an accident. In less than twenty four hours, one spirit beast’s spirit ring plus another spirit beast’s blood had advanced his spirit power by two ranks. In fact, right now he was a Title Douluo. Ordinary Title Douluo might not manage to raise their spirit power from rank ninety three to ninety five in a decade, but he finished it this quickly. All this felt a bit unimaginable. But it really did happen. Tang San of course understood that, even though this was inextricably linked with his effort, it was also the effect of the Seagod’s divine power hiding within him and constantly fusing with him. Otherwise, no matter how much effort he put into cultivation, it would be impossible to make such progress in such short time.</p><br/><p>Unconsciously showing a smile, the Eight Spider Lances softly pushed Tang San to the side. He directly sat down cross legged. Looking at that already completely wizened Man Faced Spider Emperor corpse, he thought to himself that this was the law of the weak being prey to the strong! If he had lost, he might be even more miserable and eaten on the spot.</p><br/><p>Closing his eyes, focusing, Mysterious Heaven Skill circulated, and the black Clear Sky Hammer reappeared in Tang San’s palm. The Seagod Trident lay on the ground next to him. Induced by that black light, the Man Faced Spider Emperor corpse also produced a ray of black light that condensed in the air, flying towards Tang San’s Clear Sky Hammer.</p><br/><p>Seeing that spirit ring flying towards him, Tang San remembered the pain the first time he had surpassed his level to absorb a Man Faced Demon Spider’s spirit ring. But now this fifty thousand year spirit ring wasn’t enough for him to look at.</p><br/><p>The black light entered his body, and the Man Faced Spider Emperor’s wicked cold feeling was practically swallowed in one go by the Mysterious Heaven Skill, like entering a large river. The enormous spirit power basically didn’t give it the chance to cause any mischief, directly suppressing its energy.</p><br/><p>And this Man Faced Spider Emperor had lost in absolute strength. Even if it was unwilling, there was no way to struggle in the face of Tang San’s strength towering like a mountain. It began to be absorbed.</p><br/><p>Compare to when he absorbed the Dark Devilgod Tiger spirit ring, this went a lot easier. Tang San just used a quarter of an hour to completely add it to as his Clear Sky Hammer’s fifth spirit ring. Adding all his spirit rings together he already had fourteen. He still needed three spirit rings in the Star Dou Great Forest, then his goal would be complete.</p><br/><p>Standing back up, as Tang San raised his head to look up, the color of the sky was already brightening, the light of dawn starting to appear on the horizon. A new day was arriving. After fishing out food from the Twenty Four Moonlit Bridges for a light meal, he set out again. His spent spirit power had completely recovered while he absorbed the spirit ring. Moreover, he had now grown even stronger. Even when the Eight Spider Lances were put away, that shield-like solid feeling on his back still remained. It gave him a kind of completely solid feeling. Tang San vaguely felt that, even if he ran into the Dark Devilgod Tiger again and brought into that strange space, the Eight Spider Lances could even disregard the limits of that space and come with him inside.</p><br/><p>Only, he would probably never have another chance for that. Recalling the Dark Devilgod Tiger’s calm and power, Tang San still felt a lingering fear. When he entered the Star Dou Great Forest, had he ever imagined he would encounter such a life or death situation? Before returning, he had even believed that even if he met powers like Da Ming and Er Ming, he would still have more than enough fighting strength. Even if he didn’t win, he could at least leave safely. But now he understood that he couldn’t underestimate any opponent, nor could he give the enemy any chances. There were way too many powerful abilities he didn’t know about, and just in case he made some mistake and died, what would his parents do? What would Xiao Wu do?</p><br/><p>The Blue Silver Domain spread out once again. Tang San discovered that he was already very close to the center of the Star Dou Great Forest. Just as his mental power gradually approached the little lake in the heart of the forest, suddenly, Tang San discovered three powerful presences in one go.</p><br/><p>Yi, three targets at once? Tang San looked suspiciously in the direction of the forest center. At the same time the Blue Silver Domain also tightened, scanning only in that direction.</p><br/><p>Along with his careful search, Tang San gradually revealed an angry expression, his fists also gradually tightening. He muttered angrily to himself:</p><br/><p>“Turtledoves stealing the magpie’s nest. With Da Ming and Er Ming gone, even their place has been invaded.”</p><br/><p>This time Tang San had planned to go offer his respects to Da Ming and Er Ming. Even though the two great divine beasts’ corpses weren’t there, this was after all where they had lived for a hundred thousand years. Coming to Star Dou Great Forest, how could he not go there? Before heading this way, Xiao Wu had also repeatedly told him the he had to go take a look at the clear little lake. Ordinarily there wouldn’t be any spirit beasts with the guts to go there, but if there were, he had to drive them off. Xiao Wu never wanted to believe that Da Ming and Er Ming were already dead, and the place where they once lived had to be preserved for them. Tang San understood that Xiao Wu was waiting for the day Da Ming and Er Ming also could miraculously revive like her, and return to the world of the living.</p><br/><p>Even if this was practically impossible, it was still Xiao Wu’s hopes. Whether for Da Ming and Er Ming, or for Xiao Wu, Tang San would never allow any spirit beasts to come blaspheme the place the two great spirit beasts lived.</p><br/><p>Leaping up, his flying speed instantly increasing, Tang San directly raised his flying speed to the extreme, spreading out his Blue Silver Domain completely. He flew straight for the center of the Star Dou Great Forest without concealing his presence.</p><br/><p>After an hour, Tang San’s silhouette arrived at the deepest part of the Star Dou Great Forest like a wisp of smoke, shooting towards the center of the forest like a meteor chasing the moon. Those three spirit beasts had already discovered him, but these three fellows were like the Dark Devilgod Tiger Tang San encountered before, and had no intention of running away. Even more, they had instead gathered together and were waiting for Tang San to arrive.</p><br/><p>With a whoosh, Tang Sand dropped from the sky. In front of him was that clear little lake. The environment here was still so beautiful. A layer of faint mist rippled over the surface of the lake. It was early morning now, and the air was fresh and clear, and the humidity level here gave a refreshing feeling. But Tang San wasn’t of a mind to appreciate the scenery, his gaze directly fell on the targets here.</p><br/><p>Those were three exactly identical spirit beasts, just coldly crawling by the side of the lake looking at him. Even though he had somewhat examined them with the Blue Silver Domain before, Tang San still couldn’t help being a bit stunned when he saw them.</p><br/><p>This time he hadn’t encountered any spirit beast as exotic as the Dark Devilgod Tiger, but rather three spirit beasts that were easily found in any spirit beast forest. Fifteen Ton Ants.</p><br/><p>The three Fifteen Ton Ants were of the same size, around three meters. Just in terms of size, even adding them together they would be way short of the Dark Devilgod Tiger. Even so much that they weren’t equal to the giant eight legged fifty thousand year Man Faced Spider Emperor.</p><br/><p>Each of the three Fifteen Ton Ants’ three meter long bodies was covered with a dull golden carapace, with six solid and powerful segmented legs. Now they were already standing facing Tang San. On their heads were six eyes, two large and four small, that released a dark green light. These were all characteristics of Fifteen Ton Ants. Tang San had seen a lot of spirit beasts like these before, and also heard Grandmaster discuss such universal spirit beasts in detail before. But, he had never seen such large Fifteen Ton Ants.</p><br/><p>By Grandmaster’s accounts, Fifteen Ton Ants were a kind of spirit beast with extremely tenacious vitality. Their defensive capabilities were outstanding, capable of resisting attacks. Moreover, their strength was extremely outstanding, far disproportionate to their size.</p><br/><p>These were all the properties of Fifteen Ton Ants. As a kind of spirit beast, they had no spirit abilities of their own. In any spirit beast forest, they would often end up as food for other spirit beasts. Even though their defenses were pretty good, in the end it had limits. When they also lacked attack skills, it was difficult for them to show their strength.</p><br/><p>Of course, there were also a lot of spirit beasts that disdained the Fifteen Ton Ants as beneath them. After all, breaking their defense to eat them really was a bit tiring. Just because of their tenacious vitality, these spirit beasts would exist in large numbers in any spirit beast forest.</p><br/><p>When Grandmaster described the Fifteen Ton Ants to Tang San before, Tang San still joked that such attributes were a bit similar to his own Blue Silver Grass. Large in quantity, insufficient in strength. Just like a trash spirit beast.</p><br/><p>But, these three Fifteen Ton Ants didn’t give Tang San andy sense of trash. The places Tang San noted before were all areas where they were similar to ordinary Fifteen Ton Ants. The differences was what made Tang San pay attention.</p><br/><p>Generally speaking, ten year cultivation Fifteen Ton Ants would be around ten centimeters long, with just one pair of teeth that could break solid things. Hundred year cultivation Fifteen Ton Ants wouldn’t be more than twenty centimeters. Finally at thousand year cultivation, they had the chance to grow to one chi. Such Fifteen Ton Ants were already quite rare. Because they they had no powerful life saving techniques, and would moreover frequently end up killing each other. In any case, Tang San had entered a lot of spirit beast forests, this Star Dou Great Forest in particular, and each time he had seen a lot of Fifteen Ton Ants, but never any that could draw his attention, nor any that could grow past one chi.</p><br/><p>According to Grandmaster’s estimation, if Fifteen Ton Ants cultivated past ten thousand years, they might grow to be around two chi. At thirty thousand years they might reach one meter. In his research, Grandmaster had carefully studied spirit beasts with great strength but lacking in other abilities like these. Among the Fifteen Ton Ants he knew of, the largest was only around one meter, with cultivation past thirty thousand years. This was also the source of his estimate. Moreover, due to its characteristic strength, that thirty thousand year Fifteen Ton Ant had become the Strength Clan chief Tai Tan’s eighth spirit ring. Grandmaster once inadvertently learned about it from him. By Tai Tan’s account, he had killed a Fifteen Ton Ant King, and this spirit ring had substantially increased his strength.</p><br/><p>At thirty thousand year cultivation they could reach one meter, but facing Tang San now were three Fifteen Ton Ants there were all past three meters. Tang San could be certain that these three were all at the Fifteen Ton Ant King level, no, it should be Fifteen Ton Ant Emperor. Their cultivation might have reached ninety thousand years, not far from breaking through the final boundary and entering the hundred thousand year level.</p><br/><p>If it was very difficult for the Dark Devilgod Tiger to mature due to being too dangerous, and would easily be ganged up on by other spirit beasts, then the Fifteen Ton Ants difficulty in growing was because they were too weak. Tang San understood that for Fifteen Ton Ants to cultivate to this level, it would absolutely be even more difficult than for a Dark Devilgod Tiger to cultivate to ninety thousand years. After all, after cultivating to a certain level, the Dark Devilgod Tiger had the strength to protect itself, but the Fifteen Ton Ants didn’t! Why would he run into three such strange spirit beasts here? Previously his Blue Silver Domain couldn’t accurately probe their cultivation, just that it should be more than fifty thousand years.</p><br/><p>At the same time as Tang San was unconcerned about facing three ninety thousand year spirit beasts, he was still shocked about their type. Moreover, these three Fifteen Ton Ant Emperor’s were all variants. Each had a pair of huge transparent wings on their backs, clearly able to fly. There were also two protruding sword-like teeth, and at the same time two solid forelimbs, a bit like the giant claws of scorpions, but not completely, even more like three needles tied together. Swinging them left and right, besides the dull golden color, they also had a particular green layer.</p><br/><p>“Who allowed you to invade the Sky Blue Bull Python and Titan Giant Ape’s place?”</p><br/><p>Tang San held the Seagod Trident as he asked.</p><br/><p>No matter how low level Fifteen Ton Ants were, once at the ant emperor level, their intelligence would also rise a level.</p><br/><p>Tang San guessed correctly. These three Fifteen Ton Ant Emperors didn’t have an easy time cultivating to their present stage. They were originally three brothers. They were all powerful soldiers of the Fifteen Ton Ant colony. When fighting another Fifteen Ton Ant colony at one time, the three brothers had done excellently and received the favor of the ant queen, becoming soldier ant generals. Afterwards they had fought wars on all sides, criss crossing the Star Dou Great Forest, surviving untold deadly dangers, gradually growing.</p><br/><p>As their strength grew, the ant queen gradually grew fearful, and decided to eliminate them. This was also an important reason it was so difficult for Fifteen Ton Ants to grow strong. In the colony, the ant queen bossed everyone around and was also in charge of carrying on the ancestral line. But the ant queen herself had no fighting strength, and could only produce offspring. If soldier ants she couldn’t control appeared, it would very likely lead to problems. Consequently, the ant queen never allowed soldiers ants to grow powerful. If a soldier ant’s cultivation reached a thousand year, the ant queen would immediately send other soldier ants to attack and eliminate it.</p><br/><p>But, these three soldier ant brothers were lucky. Because of their heroism in battle and great strength, they were supported by the soldier ants, and when the ant queen ordered the attack, the other soldier ants notified them in advance, and the three brothers made their escape.</p><br/><p>They were originally loyal and devoted to the ant queen, so when actually treated like this and with a certain degree of intelligence after cultivating to a thousand years, they were naturally furious. Therefore they didn’t run far. Exploiting their familiarity with the colony, they took advantage of a battle between their colony and another Fifteen Ton Ant group to quietly sneak into the ant queen’s lair, killing her. The three brothers even consumed the queen’s corpse, then escaped without a trace.</p><br/><p>Once they had escaped the territory of their original colony, they were suddenly shocked to discover that their bodies had undergone great chances. Their strength had also grown even greater. Consuming the ant queen’s corpse had substantially increased their cultivation. This discovery immediately gave the three soldier ant brothers a plan. From then on, they looked everywhere for other Fifteen Ton Ant nests, looking for an opportunity to sneak inside and kill and eat the queen, using the ant queen’s nutrition to nourish their bodies and quickly mature.</p><br/><p>At the beginning they were frequently in danger, a few times almost dying by the counter attacks of the soldier ants. But as their strength rose, and with the first variation after breaking through ten thousand years cultivation, they suddenly grew even more unscrupulous. Sometimes they would break into ant nests head on and kill the queen. Gradually, these three brothers became the public enemy of all Fifteen Ton Ants in the entire Star Dou Great Forest. But as they grew stronger and stronger, and craftier and craftier, what could common Fifteen Ton Ants do against them? They could only hide their queens even deeper.</p><br/><p>As their strength grew, the three Fifteen Ton Ant Emperor brothers grew more and more ambitious. They saw that this little lake wasn’t just the center of the Star Dou Great Forest, but at the same time also where the natural energy was the most abundant and most suitable for spirit beasts to cultivate. They had outstanding strength, and coveted this place. Unfortunately, they thought too highly of themselves, and in an ambush, they faced the simultaneous counter attack of the Titan Giant Ape and Sky Blue Bull Python, who beat the three brothers in a miserable retreat. Relying on their powerful defense and flight ability they escaped to live another day, but they were also driven the whole way out of the Star Dou Great Forest, and no longer dared set a foot inside.</p><br/><p>Just like the Dark Devilgod Tiger, after Da Ming and Er Ming sacrificed themselves for Tang San, they never dared enter the Star Dou Great Forest, yet hated to leave this geomantic treasury for them. Sensing that the two forest kings presences quietly disappeared, it was just that they were a bit more gutsy than the Dark Devilgod Tiger, and directly arrived at Da Ming and Er Ming’s cultivation ground. Discovering that there really were no traces of the two great divine beasts, and believing there were no other enemies that could equal them in the forest, they even named themselves the new forest kings. This was also why they had no intention of leaving when they sensed Tang San’s presence. They were confident in themselves, and at the same time also wanted to defend their just established positions as forest kings.</p><br/><p>Before Tang San arrived, these three Fifteen Ton Ant Emperors had relied on a special method to send orders to all the Fifteen Ton Ant colonies in the Star Dou Great Forest, ordering them to deliver thirty ant queens as food every day, or they would eradicate the colonies. Even though the Fifteen Ton Ant colonies were furious, they had no way out, and could only listen to their orders.</p><br/><p>Unfortunately, today they had run into Tang San. How could Tang San allow them to continue occupying the place where Da Ming and Er Ming stayed? Slowly raising the Seagod Trident horizontally, Tang San’s gaze grew ice cold.</p><br/><p>Facing Tang San’s question, the three Fifteen Ton Ant Emperors only shook their heads, the ones on the left and right moving up on the sides, the three half surrounding Tang San, gradually pressing close. Their dull golden color also gradually grew more intense, but their energies remained completely reserved, without any intent of revealing them outwards.</p><br/><p>So what if there were three? Golden blue light flashed, and the Blue Silver Emperor released. Having just understood the marvels of combinations, Tang San wouldn’t shrink back in the slightest even against three ninety thousand year cultivation enemies. He wanted to see just to what level his strength could reach.</p><br/><p>Buzzzzzzzz, the wings on the Fifteen Ton Ant Emperor’s backs flapped, slowly flying up. These three brothers had proven themselves in surviving so long, their movements were completely synchronized, just like mirror images. Whether the rate their wings beat at or how far above the ground they rose, everything was unanimous.</p><br/><p>Blue light instantly spread out. Due to facing three opponents, Tang San of course wouldn’t give them the chance to attack. The Blue Silver Domain directly spread out, and having reached the level of Boundless Nature, everything within the range of the domain turned golden blue. Silhouettes of trees rose in layers upon layers, and Tang San’s Blue Silver Emperor grew even more translucent under the influence of the domain. The three Fifteen Ton Emperor’s simultaneously sensed an enormous pressure squeezing them from all directions, violently pressuring them and limiting their strength.</p><br/><p>Only, these three Fifteen Ton Ant Emperors didn’t panic, still hovering there as if quietly waiting for something.</p><br/><p>Tang San wouldn’t keep waiting. The Blue Silver Emperor wildly grew out from him, like countless living snakes, tangling around the three ant emperors, starting a probing attack.</p><br/><p>The Fifteen Ton Ant Emperors didn’t see Tang San, but Tang San could still see them, and the split second the Blue Silver Emperor tangled around them, Tang San suddenly saw their six eyes flash with strange light. It felt like sudden excitement, and also like they saw what they had been waiting for.</p><br/><p>Heart twitching, Tang San thought: Don’t tell me they were waiting for me to attack?</p><br/><p>His Blue Silver Emperor had now already completed the Binding, completely bundling up the three Fifteen Ton Ant Emperors. They contracted powerfully, and also released corrosive poison.</p><br/><p>But at this moment, something strange happened. The three Fifteen Ton Ant Emperors simultaneously flipped outwards, and a powerful pulling force instantly came from three directions, stretching the Blue Silver Emperor binding them tight. Tang San was suddenly pulled more than a dozen meters forward in the air.</p><br/><p>Whether Tang San or the three Fifteen Ton Ant Emperors, right now their minds were filled with the same four words: How was it possible?</p><br/><p>Tang San’s shock was understandable. His own weight wasn’t much, just a hundred something jin, but don’t forget that he was holding the Seagod Trident! To him, the Seagod Trident was only a hundred jin, but to any creature besides him, this Seagod Trident weighed one hundred eight thousand jin. With this sudden tug, the three Fifteen Ton Ant Emperors had actually managed to pull him along. In other words, their cooperative strength already surpassed one hundred eight thousand jin. Even more so when considering the strength Tang San could produce from his spirit power.</p><br/><p>But the three Fifteen Ton Ant Emperors were also shocked. Their time tested strength actually ended up deflating. Even if their strength was restricted a bit inside the Blue Silver Domain, with their primal strength, as well as three brothers cooperating, their plan failing to show its intended effect was unforeseen.</p><br/><p>These three Fifteen Ton Ant Emperors absolutely weren’t as stupid as ordinary low level Fifteen Ton Ants. Their minds were connected, and they had thought of the plan when they saw Tang San release the Blue Silver Emperor. The Blue Silver Emperor was connected to Tang San’s body, so they waited for Tang San’s attack, letting the Blue Silver Emperor tangle around them. The three Fifteen Ton Ant Emperors’ thinking was to use their strength together and, relying on the instant burst of strength, directly tearing Tang San apart through the Blue Silver Emperor connected to him, not even giving him the chance to cut the Blue Silver Emperor. But when they exerted themselves to pull, it was like they were pulling a mountain. Even though it shifted, it was next to nothing, nevermind tearing that human to shreds.</p><br/><p>This change immediately produced a stubborn refusal in the three Fifteen Ton Ant Emperors. They simultaneously erupted with an intense dull golden light, the strength accumulated within sharply increasing. In an instant, their strength suddenly more than doubled. This time the powerful tension really pulled along Tang San with the Seagod Trident, and at the same time the pulling force made even Tang San feel pain.</p><br/><p>Such strength. Tang San was shocked, he could no longer keep his balance and was pulled in three directions towards the Fifteen Ton Ant Emperors. In danger, he could only quickly use the Seagod Trident tangle up his Blue Silver Emperor, in order to avoid the powerful tension to affect him directly.</p><br/><p>The Fifteen Ton Ant Emperors’ strength stunned him, and it was also due to this that he wanted to take a look at just how much force these three could produce. Therefore, he didn’t cut his Blue Silver Emperor.</p><br/><p>At this moment, Tang San couldn’t keep what Grandmaster once told him from his mind: No matter how strong the ant, it still can’t lift a half jin heavy apple. But humans can casually carry the weight of an apple, for a two hundred jin human, that’s just one four hundredth of their weight. Converting this to the scale of an ant, it’s only an ant’s hair. Ants can carry weights fifty times their own weight, if you consider only proportions, this is equivalent to a two hundred jin person lifting ten thousand jin.</p><br/><p>And as a spirit beast, the Fifteen Ton Ant was the strongest of all ants. Its strength to weight proportion reached a hundredfold. These three meter long Fifteen Ton Ant Emperors weren’t too large, each weighing around a thousand jin or so, basically nothing in the spirit beast world and even more common compared to truly powerful spirit beasts. But, if their strength could reach a hundred times their weight, then the limits could reach a hundred thousand jin. The limit of three Fifteen Ton Ant Emperors would then be three hundred thousand jin!</p><br/><p>Thinking of this, Tang San immediately understood how he could be pulled along. The Fifteen Ton Ants weren’t powerful spirit beasts, but that their strength could reach such a frightening level was because of their single mindedness, strength was their absolute attribute. The strength exerted by these three Fifteen Ton Ant Emperors reached at least two hundred thousand jin, that’s why he felt pain and got pulled along. Changing his spirit power into strength, plus his physical strength as well as the Seagod Trident’s weight, should also be able to reach one hundred fifty thousand jin or so. No wonder, no wonder. They still hadn’t used their full strength yet!</p><br/><p>Thinking of this, Tang San also had a plan. Right now his face still showed a smile.</p><br/><p>Want to pull me with two hundred thousand jin force? You’re still too naive. Fine, I’ll let you see just how far my absolute strength can reach.</p><br/><p>Tang San swiftly gripped the Seagod Trident’s haft with his left hand as well, earth yellow light instantly spreading along the Seagod Trident. It was also the instant this earth yellow light spread that he immediately stabilized himself in the air with the Seagod Trident. The Blue Silver Emperor twisting around the three Fifteen Ton Ant Emperor brothers also instantly stretched taught. The enormous pulling force made Tang San clearly sense the fibers within the Blue Silver Emperor quickly break down.</p><br/><p>Tang San plus the Seagod Trident’s force wasn’t enough to compete with three Fifteen Ton Emperors. The method Tang San used to stabilize himself in midair was very simple: applying the Titan Giant Ape left arm spirit bone’s Gravity Control ability on the Seagod Trident. To Tang San, that was just a hundred jin becoming a thousand jin, that weight was basically nothing to him. But to the three Fifteen Ton Ant Emperors, it was one hundred eight thousand jin instantly becoming one million eighty thousand jin. They couldn’t possible move Tang San further even with their peak strength!</p><br/><p>Their three meter long bodies also came to a sudden stop as the Blue Silver Emperor stretched, and bounced back. It was also the instant of this rebound force that those Blue Silver Emperor broke down with ear piercing cracking sounds. That the Blue Silver Emperor could endure this long was impressive.</p><br/><p>Sensing those three Fifteen Ton Ant Emperors flying in shock, inspiration flashed in Tang San’s heart. Yes! How come I never thought of this before? If he in previous battles had used this Gravity Control on the Seagod Trident, turning one hundred eight thousand jin into one million eighty thousand, even gods might feel they had no way out when faced with its absolute force. This discovery made Tang San even more excited than if he had instantly killed these three Fifteen Ton Ant Emperors and gotten their spirit rings. How terrifying was a million jin of weight? If he added the Golden Thirteen Halberds on top of that, destroying the walls of Jialing Pass would be a cinch.</p><br/><p>In his excitement, Tang San didn’t even immediately pursue and attack those three Fifteen Ton Ant Emperors. Spirit power circulating within, he softly swung the Seagod Trident he held.</p><br/><p>The thousand jin weight basically wasn’t enough to influence Tang San swinging it, but a problem still appeared like this. Tang San had to hold the Seagod Trident with his left hand to influence it with Gravity Control, changing it into one million eighty thousand jin. If he held it with his right hand and then added the ability with his left, it would influence Tang San himself. His body suffering tenfold gravity was a completely different idea than raising the weapon to one thousand jin. That wasn’t something Tang San wanted.</p><br/><p>Only, now clearly wasn’t the moment to research Gravity Control plus the Seagod Trident. Those three Fifteen Ton Ant Emperors thrown into the air acted again, only this time they didn’t keep flying, but rather quickly folded their wings and landed directly on the ground.</p><br/><p>Tang San smiled faintly. For them to find him in the Blue SIlver Domain’s Boundless Nature was very difficult. He wanted to see what techniques they still had. Ninety thousand year spirit beasts inevitably had some special abilities.</p><br/><p>Unlike killing the Man Faced Demon Spider, because the Fifteen Ton Ant Emperors led to Tang San discovering his abilities, he was a lot more interested in these brothers and wanted to see if they could give him any other inspiration. Holding the Seagod Trident in his left hand, the Gravity Control ability didn’t have to stop. He was going to see the main ability or strength of the three Fifteen Ton Ant Emperor brothers. He had a million jin heavy weapon in his hand, that was already an invincible position.</p><br/>\n</div>"}