{"title": "Chapter 300", "id": 300, "volume": 3, "url": "http://boxnovel.org/douluo-dalu-chapter-300", "volume_title": "Volume 3", "body": "<h1>Chapter 300</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 300</p><br/><p>Sacred Sun Sword</p><br/><p>(TL by Bagelson)</p><br/><p>To ordinary people, ruptured energy channels was a fatal injury. But to Tang San it was basically nothing. Even if all his energy channels burst, as long as he had one breath left, he absolutely wouldn’t die. Among all Tang San’s spirit rings and spirit bones, the Blue Silver Emperor right leg bone was the only one without attack power. But it was still a hundred thousand year level.</p><br/><p>The flight ability really was amazing to lower ranked spirit masters, but with Tang San’s present cultivation, he could fly even without using spirit bone abilities by coordinating his spirit power. Just like what he saw Seagod Douluo Bo Saixi do.</p><br/><p>Therefore, flying wasn’t the most valuable ability of the Blue Silver Emperor right leg bone. Its strength was practically all on Wildfire Burns Unending, Spring Wind Blows Life Again.</p><br/><p>If there was any doubt, then the fact that even shattered limbs could be restored showed how powerful it was. As long as Tang San still drew breath, he practically couldn’t die. Only the recovery speed would be different based on the severity of the injuries.</p><br/><p>Just like now, when Tang San’s energy channels ruptured in battle, the Blue Silver Emperor right leg bone’s energy instantly intervened, controlling the damaged channels and directly sealing the damaged cross sections, keeping him from bleeding all over. The blood Tang San spit out was all from the moment the violent shock just damaged his energy channels. Otherwise, with the degree of damage caused by using Great Sumeru Hammer, he would already be done for.</p><br/><p>And after he left the battle, the Blue Silver Emperor right leg bone’s energy would first condense the shape of the energy channels within his body, connecting each fractured channel to form the normal connections, making his blood circulate once again. Then through this power, it would pull the fractured veins and gradually heal them. This was also an important reason why Tang San’s spirit power could recover so quickly.</p><br/><p>Right now, Tang San was completely quiet. The instant he was soaked into the beauty of cultivating, his entire body entered a perfect cultivation state. Profoundly sensing the recovery process of each damaged vein. As a power, the first one had to do was familiarize oneself with one’s body. If one couldn’t promptly grasp one’s state after each time one’s attributes changed, it was impossible to use one’s condition well in battle. Especially someone who possessed a tyrannical yet dangerous ability like Tang San’s Great Sumeru Hammer. He had to grasp the limits of his body even better so he wouldn’t break them in the middle of combat, so preserving his life.</p><br/><p>Completely soaked in cultivation, his body was recovering at its fastest. In this battle with Qian Renxue, Tang San could be said to have exhausted his ingenuity. He’d never been as exhausted as now. Even though he had faced a lot of powers stronger than him in the past, the gap had never been as wide as this time. Don’t be fooled by the apparent five rank gap with Qian Renxue. Just like Qian Renxue said, their difference was that between man and god. If not for Tang San exploiting all kinds of circumstances to force Qian Renxue not to use her divine weapon, even if she didn’t start with her full strength, he wouldn’t stand a chance of survival.</p><br/><p>That he could finally win the bet with Qian Renxue was even more due to his Seagod Trident. The mental efforts far exceeded that of his physical strength. Especially that last strike, using Guanyin’s Tear for the first time, practically drew out all the hidden potential he had. It seriously hurt Qian Renxue, but he himself was also a lamp at the end of its wick. Fortunately he had the support of Oscar’s big recovery sausage, and could so leave the Star Dou Great Forest.</p><br/><p>The reason Tang San insisted on leaving the range of Qian Renxue’s divine senses before string to cultivate wasn’t because he wanted to hide the direction he left in, but rather in order not to let Qian Renxue see the state of his body. If he cultivated inside the Star Dou Great Forest, he’d be caught by Qian Renxue’s divine senses. Then she could roughly assess Tang San’s injuries through his cultivation and recovery time, as well as how far he could escape after recovering.</p><br/><p>In order to win the bet with Qian Renxue, Tang San had already exhausted the cards in his hand. Qian Renxue already understood his strength extremely well. The only thing worth being happy over was that his spirit power level rose, making his spirit power superior to before, giving him an advantage in Qian Renxue’s pursuit. Three days wasn’t a short time to powers, but three days was far too short for Tang San right now. He could be certain that, no matter how he left, Qian Renxue had a chance of catching up to him. Only the time it took was in question. Therefore, the game had already begun the moment Tang San left Qian Renxue’s divine sense range and started to cultivate.</p><br/><p>Using a full sixteen hours, Tang San’s veins were completely recovered. Just as he expected, he really had advanced in rank. After his channels were completely restored, rank ninety six spirit power immediately showed its effect. With each cycle of Mysterious Heaven Skill, the spirit power recovery speed was at least thirty percent higher than before. In a few cycles, his spirit power was already sixty percent recovered. Sixty percent spirit power was enough to let Tang San fly at full speed. As for the remaining spirit power, he could recover it while flying.</p><br/><p>It was a few hours faster than he had expected. Tang San knew that his chance of surviving Qian Renxue’s pursuit was a bit bigger. This was inextricably linked to his ability to calm down and wholeheartedly cultivate before.</p><br/><p>Taking to the air once again and clearly identifying the direction, Tang San advanced with full strength, leaving behind a line of afterimages as he flew straight for the seashore. With his spirit power increasing, even his flight speed had increased somewhat.</p><br/><p>Tang San maintained his highest flight speed practically the whole time. In order to be able to be able to use his full speed, he flew at almost a kilometers distance from the ground. At this height there were very few birds, and nothing to disturb him. Moreover, at a kilometers altitude, he was difficult to spot from the ground, let alone when he flew so incredibly fast.</p><br/><p>Tang San stopped to rest a while every twelve hours. In full flight speed mode, not only was his spirit power consumed, but also his mental state. Of course, if Tang San wished, he was perfectly capable of maintaining such flight speed for three days. However, he also knew that if he did, it would be impossible to maintain his peak condition. If Qian Renxue caught up, he would instead be in even more danger. But by resting every twelve hours, he could maintain peak condition the whole time, ready to react at all times.</p><br/><p>After flying for more than two days, the agreed upon time with Qian Renxue was almost up, but with his all full flight speed, he was coming closer and closer to the ocean, he could already smell the refreshing scent in the air.</p><br/><p>He had released the Vast Sea Barrier around him twelve hours ago, placing him in a stealth mode. This was of course to isolate him from Qian Renxue’s divine sense search. Tang San knew that if Qian Renxue’s divine sense really caught up to him, he would have nowhere to hide, unless there was a woodland the size of the Star Dou Great Forest, which would give him a fifty percent chance. But very clearly, on the entire Douluo Continent, there were very few areas that could compare. Even more, he wouldn’t be safe even so. When Qian Renxue searched for him before, she hadn’t used any divine tool. Who knew how far she could reach after she did? Therefore, Tang San only used the Vast Sea Barrier to simply hide his body, while still flying quickly. What Tang San hoped for the most right now was that Qian Renxue searched in as wrong a direction as possible, or that her god level strength speed was limited to some extent, unable to catch up to him quickly. By the present circumstances, in at most six hours, he could reach the seashore. As long as he was there, entering the range of the ocean, it wouldn’t matter how powerful Qian Renxue’s divine senses were.</p><br/><p>As the Seagod’s successor, if he could still be targeted by the enemy in the ocean, there was no point to Tang San muddling along. The ocean was like blue silver grass, only much, much larger than the Star Dou Great Forest. The Seagod’s power was enough to become Tang San’s best concealment.</p><br/><p>Time passed second by second. Tang San was fully immersed in the tense situation. His right hand tightly gripped the Seagod Trident, letting him maintain top flight speed.</p><br/><p>The weather was especially sunny and cloudless today, and the visibility high in the air was especially clear, especially with Tang San’s Purple Demon Eye ability. Four hours passed, and he could already see the rough shape of the ocean in the distance, even better sensing the humidity reaching the sky.</p><br/><p>A bit faster, and a bit faster, even with his calm, at this moment he couldn’t help his heart beating faster. He was going to make it, in less than two hours, he could absolutely reach the shore.</p><br/><p>It was already four hours past the agreed upon time, and Qian Renxue still hadn’t caught up. Very clearly, even as a god, her speed was still limited, and couldn’t instantly teleport anywhere in the continent. It seemed he really would escape her pursuit. Qian Renxue, once I become Seagod, I will definitely repay you for my humiliation this time.</p><br/><p>Only, Tang San was clearly happy a bit too early. A quarter of an hour later, when he was one step closer to the ocean, suddenly he felt the hairs all over his body tighten, and especially his soul had a shivering feeling. Inwardly cursing, he turned his head to look back without slowing his flight. His heart instantly sank to the ground.</p><br/><p>He couldn’t tell how far away, but a very small golden speck of light was just quickly approaching. In just moments that golden speck of light had doubled in size, clearly showing how terrifyingly fast she moved. Besides Qian Renxue, who else could reach such speed?</p><br/><p>Tang San secretly sighed. What he feared the most had occurred. He understood that even if Qian Renxue was a god, she couldn’t possibly guess which direction he was heading in, but she still caught up. That only proved one thing, she had definitely left some kind of mark on him. Relying on her divine senses, she could then accurately determine the direction he left in. And this mark was something he couldn’t discover.</p><br/><p>At the same time, Tang San could also sense just what kind of determination the constantly approaching speck of light possessed. This time, Qian Renxue was determined to completely annihilate him. It was already impossible to exploit that contradictory attitude she had towards him. Moreover, this time she was also clearly much stronger than before. It seemed he was going to face the God of Angels wearing the Anglic Raiment!</p><br/><p>Only an hour remaining, with the destination before him, and he was caught by a life and death crisis. That definitely didn’t feel good.</p><br/><p>Qian Renxue’s figure was already within his line of sight. Within less than a few minutes, she would catch up. What to do?</p><br/><p>Cold light flashed in Tang San’s eyes. Clapping the flat of the Seagod Trident’s main blade against his forehead, he used the ice cold sensation to calm down a bit. Clenching his teeth, looking down, he flew straight for the ground.</p><br/><p>The God of Angels could be called the ruler of the skies. Back when Tang San’s great grandfather Tang Chen was equally famous to Qian Daoliu, Tang Chen was peerless on the ground, and Qian Douliu peerless in the sky, with Bo Saixi peerless in the ocean. Very clearly, contending with Qian Renxue in the air was practically impossible.</p><br/><p>Therefore, Tang San picked fighting on the ground as most suitable to him, charging towards the ground at top speed. Right now, below him was a wide expanse of hills, and past this were two mountains, and then you could reach the sea.</p><br/><p>While flying downwards, Tang San simultaneously raised the Seagod Trident in his hand. Like a greeting to Qian Renxue, a line of Seagod’s Light shot into the Seagod’s Heart, the trident instantly exploding with intense golden light that shot towards the sky. At the same time, he flew into the hills, the Eight Spider Lances shoot out from his back, leaping like a shooting star and quickly advancing.</p><br/><p>Qian Renxue naturally saw the Seagod Trident’s light, a cold smile rising at the corners of her lips. She sped up once again, the six wings on her back spreading out simultaneously, then instantly beat back. The God of Angels’ golden light seemed to cut through space, and in practically just a few breaths, Qian Renxue had already arrived above Tang San.</p><br/><p>Surging golden light fell from the sky, like the sun shining on the earth. No matter how fast Tang San was, it was still impossible to outrun the light. That intense golden light instantly enveloped the entire space. Golden light heaved, the Angelic Domain.</p><br/><p>Qian Renxue’s Angelic Domain was at least twice as strong as before, that terrifying glue-like golden light seemed tangible. Being directly enveloped by it, this time Tang San didn’t stand any chance. Even ring explosion plus the final strike of Disorder Splitting Wind Hammer Method couldn’t cut open this god level domain.</p><br/><p>Qian Renxue was completely different from her last time facing Tang San. She didn’t have that graceful and noble palace dress, and in its place was the Angelic Raiment formed from six evolved spirit bones, Sacred Angelic Armor.</p><br/><p>The dazzlingly beautiful golden armor seemed perfectly tailor made for her, swelling chest armor, and narrow at the waist, a golden battle skirt, perfectly round shoulder armor, as well as other perfectly proportioned armor pieces enveloped her completely. That small angel brand on her forehead was behind a circle on her forehead, and within that circle was a small glittering angel shaped gem. Altogether seven crested circles were on top, forming a head ornament like a princess crown.</p><br/><p>Feather shaped decorative designs extended to every part of the armor, and the six wings on her back had turned completely glittering and transparent gold. With a soft wave, circular golden ripples constantly spread out with Qian Renxue as center. The guard of the completely golden Sword of Angels in her hand unfolded like a pair of angel’s wings. Enormous golden flames covered every part of her.</p><br/><p>Without question, this Qian Renxue was the true God of Angels. That enormous golden light descending from the sky was released by that small angel shaped golden gem at the center of the circle on her forehead.</p><br/><p>In practically just a flash of gold, Tang San had become frozen, his speed forward coming to a sudden halt. With the Eight Spider Lances released he was like a spider trapped in an enormous web, even taking a single step was a struggle.</p><br/><p>Qian Renxue laughed coldly. Even floating there, her voice spread out in all directions, just like the Sanskrit i once heard in his precious life, awing heart and soul.</p><br/><p>“Tang San, how does it feel to be caught on the verge of escape? Isn’t it very hopeless?”</p><br/><p>Qian Renxue’s eyes had already lost that thirst to subdue Tang San, they only held ice cold killing intent. If she wasn’t already a god, she would have died to Tang San’s Guanyin’s Tear. She had never thought that her god level form was unable to respond to that attack. Rebuilding the heart definitely wasn’t a simple task even for a god. The suffering involved wasn’t any less than accepting the angel’s inheritance. After all, angels weren’t widely known for their recovery ability. She could only rely on her enormous divine power to reconstruct the heart. She suffered through this process for a full three days, and she had also used the pain she experienced to raise her killing intent to an unprecedented level. Go all out, kill Tang San.</p><br/><p>Just like Tang San anticipated, when Qian Renxue fought him in Star Dou Great Forest, she had left a divine sense imprint on him. This was the divine sense of the God of Angels, even though it wouldn’t cause any harm to Tang San, as long as he was still on this planet, on this continent, no matter where he was, Qian Renxue could rely on her divine sense to find him.</p><br/><p>Gods were gods. Rank ninety six Tang San ran as hard as he could for two and a half days, but Qian Renxue only used four hours to catch up. This also included the time to restore her spent divine power after restoring her heart. The time spent on actual pursuit was only two hours. It really was a thousand li in an instant.</p><br/><p>“Truly unpleasant. Qian Renxue, you’re even more valiant and formidable-looking in that armor, it must be your divine tool as the God of Angels.”</p><br/><p>Tang San raised his head to look to the sky. Even though it was still golden light covering him, this time it was transparent, allowing him to see Qian Renxue in the sky. But that powerful Angelic Domain had already started to devour his spirit power.</p><br/><p>Qian Renxue said coldly:</p><br/><p>“That’s right, this is the armor of the God of Angels. With your strength you should be able to tell just how enormous the gap is between us right now. Even if your strength has increased again, it’s still impossible to fight me. You’re already very close to your goal, but unfortunately, you won’t have another chance. Since you are the Seagod’s successor, how could I let you into the sea? Die.”</p><br/><p>She had no plans to speak further to Tang San, because Qian Renxue feared her killing intent would waver. The Sword of Angels in her hand slowly rose, the winged guard releasing multicolored light everywhere. Instantly, countless motes of golden light could be seen condensing on the sword.</p><br/><p>A strange scene appeared. Besides where Qian Renxue was, the surrounding rays of light dimmed, the light of the sun actually being controlled, shining only on that angelic sword. The terrifying power of the sun instantly rose, giving Qian Renxue’s entire body a dizzying golden brilliance. Once could imagine just how terrifying the thunderclap strike of this God of Angels was when drawing on the divine power of the sun to attack.</p><br/><p>Tang San naturally wouldn’t tie his hands and wait for death. He of course understood that this attack absolutely wasn’t something he could endure. Black light rushed out, and the Clear Sky Hammer appeared in his left hand. The eight spirit rings had already completely recovered, and the first spirit ring brightened in practically the same moment Qian Renxue raised the Sword of Angels. At the same moment, a circle of gaudy golden light also spilled out from the Seagod Trident he held.</p><br/><p>Qian Renxue was different from three days ago, but Tang San was also different. Even if it was impossible for him to bring out true god level strength like Qian Renxue did with the Angelic Raiment, don’t forget that he also had the Seagod’s weapon united with his mind, the Seagod Trident.</p><br/><p>The ripples of the Seagod Trident spread out in an instant, and while briefly, it clearly pushed away the Angelic Domain a little. And Tang San’s Clear Sky Hammer swung at this moment. Not towards Qian Renxue in the sky, but rather towards the ground beneath his feet.</p><br/><p>When the first spirit ring’s spirit ability was released, that pitch black Clear Sky Hammer quietly entered the ground. The next moment, Tang San’s body suddenly disappeared. Disappeared the instant the Sacred Angelic Sword chopped down with the condensed divine power of the sun.</p><br/><p>The pure golden blade seemed about to plow open the earth. The split second that pure golden light collided with the ground, there was no sound, but an enormous hole was still cut open in the ground. The air twisted, immeasurable silt and rocks melting under the divine power of the sun. This attack was a true god’s strike, called Sacred Sun Sword. It was an ability specific to the God of Angels. It was powerful, with surpassing explosive force.</p><br/><p>The six winged God of Angels relied mainly on the divine attribute, with flame as support. Under the effect of Qian Renxue’s Sacred Angelic Sword right now, the two great attributes erupted fully through the divine power of the sun. This slash cut fully into the ground, in a five hundred meter range. An incomparably enormous pit appeared in the ground after the pure golden light passed. Moreover, that pit was still constantly expanding, because it was completely rendered pure gold, constantly melting further.</p><br/><p>The instant the Sacred Sun Sword fell on the ground, Qian Renxue revealed a somewhat sorrowful expression. It seemed impossible to her for Tang San to escape this attack again. After all, this was the only man she had ever liked! The result was that he still died by her hand. That bitterness constantly gnawed on her heart. She knew that her decision was correct, Tang San had long since become the greatest weakness in her heart. Now that she had killed him with her own hands, this weakness had grown immense. Absolutely nobody could be allowed to learn about this.</p><br/><p>Only, the pain and sadness on her face didn’t stay for long. Looking at the incomparably enormous pit in the ground melting wider, her expression suddenly froze.</p><br/><p>The moment the Sacred Sun Sword hit, even her divine senses were curbed in order to avoid being affected by that terrifying true sun fire. But now that the Sacred Sun Sword’s power was spreading, after her divine senses automatically spilled out, she discovered that presence of the divine sense lock hadn’t disappeared along with the attack, but was just now moving towards the ocean with remarkable speed.</p><br/><p>How was it possible? This was Qian Renxue’s first thought. The next moment she flew out. Attentively watching a remote patch of land, the corners of her mouth revealed a relieved smile. This moment she actually had a somewhat refreshing feeling, even forgetting the pain of her shattered heart.</p><br/><p>Tang San didn’t die, his presence didn’t disappear, still running, he wasn’t dead. Only, Qian Renxue also very quickly grew alert, the smile on her face disappearing somewhat awkwardly. She’d obviously come here to kill him, so why was she so happy he didn’t die? Through dithering on the border of life and death this time, it seemed like his place in her heart had come one step closer. Qian Renxue frowned, she knew that if it went on like this, if Tang San didn’t die, her heart might fall first.</p><br/><p>She suddenly accelerated, dashing forward. Tang San, you really are capable, you could even think of a method like this. You’re the one who could do it.</p><br/><p>How did Tang San escape the Sacred Sun Sword strike? It seemed impossible, but it was really quite simple. He only used one spirit ability to bring him out of range.</p><br/><p>Tang San was never one to waste time. In these two days of flight, his thoughts had never stopped. He definitely wouldn’t just hope that Qian Renxue wouldn’t catch up to him by luck, binding the bamboo before it rains was what a wise man did. Therefore, he was always thinking about how he could respond to Qian Renxue’s pursuit after she was restored to her full state. Among this, he thought of one method.</p><br/><p>It was clearly impossible to escape Qian Renxue by flying. She was the God of Angels. Since flying wouldn’t do, then he’d go to ground.</p><br/><p>Among Tang San’s two spirits and seventeen spirit rings, only one spirit ring was related to the earth, but this one spirit ring was already enough for him. That was the Clear Sky Hammer’s first spirit ring from the Titan Giant Ape Er Ming. As a hundred thousand year spirit ring, this first spirit ring assigned Tang San two hundred thousand year spirit abilities. Tang San had never used it himself, he’d always used the Titan Giant Ape left arm bone’s two spirit abilities.</p><br/><p>The two spirit abilities the spirit ring gave were Titan Hammer and Force of Earth. They weren’t two attack abilities, but rather one power attack, and one support. Tang San had once tested the might of Titan’s Hammer, and the attack power of this hundred thousand year spirit ability wasn’t a bit inferior to when he used Great Sumeru Hammer after detonating the same first spirit ring, or even surpassed it. Only after using it there was still a brief charge up time, and it couldn’t used for consecutive attacks like the Great Sumeru Hammer’s Ring Detonation. And the other ability Force of Earth was completely a support ability.</p><br/><p>Controlling the power of the earth for his own use, if combined with Titan Hammer plus all manner of Tang San’s attributes plus the power of the Clear Sky Hammer itself, it was enough to become the most powerful frontal attack weapon among all of Tang San’s spirit abilities.</p><br/><p>But right now Tang San wasn’t using the destructive power these two spirit abilities produced, but the Force of Earth’s ability to control the earth.</p><br/><p>The name Titan, in the Douluo Continent’s ancient era, represented the God of Earth. The Titan Giant Ape, by another name, was the Child of Earth. This was also an important reason why the Titan Giant Ape could become the forest king, become a peak level spirit beast. So then, Tang San’s Blue Silver Emperor most controlled all blue silver grass, and as long as it was on the ground, the Titan Giant Ape could control the strongest force. The difference between them wasn’t easy to see.</p><br/><p>Therefore, after Tang San released the Clear Sky Hammer’s first spirit ring, it instantly drew him into the ground. At the same time the Blue Silver Emperor right leg bone flight ability started, exploiting Force of Earth to shift the mud and rocks, quickly travelling underground. At the same time, in order to raise the movement speed to the limit, he also used the left arm bone ability Gravity Control. This time it wasn’t to increase gravity, but rather decrease it, cooperating with the control from Force of Earth, Tang San could instantly travel underground at flight speed, quickly leaving the battlefield like a swimming fish.</p><br/><p>The God of Angels was the god that controlled the skies. Therefore, even Qian Renxue’s divine power couldn’t use her Angelic Domain underground, so Tang San left the domain’s restriction and drilled away. But even so, he was still grazed by the Sacred Sun Sword’s might. The scorching feeling almost melted him directly. Fortunately the god level Eight Spider Lances dissolved the power of the true sun fire.</p><br/><p>Having escaped Qian Renxue’s attack, Tang San wouldn’t dither longer. Using his full speed, he quickly moved towards the ocean.</p><br/><p>Once Qian Renxue discovered it, he had already run almost ten kilometers.</p><br/><p>Qian Renxue had always admired Tang San. In her eyes, Tang San was like a bottomless pit, as long as you squeezed hard or he faced a life and death crisis, he could always create miracles, always shocking everyone. Without a doubt, what astonished Qian Renxue the most was the Quanyin’s Tear that could even pierce her heart, but Tang San’s ability to fly away underground also surprised her a lot. She of course clearly understood Tang San’s thoughts. Underground, her fighting power would be enormously weakened.</p><br/><p>Tang San also equally sensed Qian Renxue’s presence. She was straight above him in midair, but he had no idea when the next attack would come. His mental strength was already completely suppressed by Qian Renxue’s divine senses, basically unable to discover any information useful to him.</p><br/><p>Helplessly, Tang San’s instant choice was to suddenly turn down, infusing the Clear Sky Hammer with spirit power and quickly hiding deeper underground. As long as he reached a certain depth, he could rely on the earth to shield him from Qian Renxue. Even though the continuous control of Force of Earth was exhausting, it was the only choice he had.</p><br/><p>Tang San’s ability to resist pressure was extremely high, and even though the pressure of the earth was much heavier than the ocean, he could still endure it a while. Just as Qian Renxue’s attack was ready, he had already quickly sunk more than five hundred meters underground. At this distance, even if Qian Renxue launched god level attacks, the strength of Tang San’s body and drawing on the buffer of earth, Qian Renxue was still unable to directly cause him any harm.</p><br/><p>Qian Renxue clenched her silver teeth. Fine then, Tang San, you really are too cunning. But even if you go underground, can you escape my pursuit? She clearly understood that, as long as Tang San entered the ocean, she might truly be unable to kill him. Even though the earth was a very large restraint on her power, it was after all better than the ocean. The sea was the Seagod’s domain, and there Tang San could display even greater abilities. Whether her divine senses were enough to keep up pursuit was a question. Therefore, Qian Renxue firmly decided that she had to catch up to Tang San before he reached the shore.</p><br/>\n</div>"}