{"title": "Chapter 315", "id": 315, "volume": 4, "url": "http://boxnovel.org/douluo-dalu-chapter-315", "volume_title": "Volume 4", "body": "<h1>Chapter 315</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 315</p><br/><p>Tang San: My Virginity Is Only For Xiao Wu, Seagod Raiment</p><br/><p>(TL by Bagelson)</p><br/><p>His brain working quickly, combined with the first illusion, Tang San gradually understood. What he was seeing should be everything that happened when Qian Renxue inherited the divinity of the god of angels. And this should be happening in the depths of Qian Renxue’s consciousness. But, why did he appear here? It shouldn’t be her trial?</p><br/><p>Before Tang San could think further, he saw Qian Renxue walk towards the other him.</p><br/><p>Qian Renxue practically without hesitation, threw herself into “Tang San’s” arms…...</p><br/><p>……</p><br/><p>Seagod Island, Seagod Mountain, Seagod Palace.</p><br/><p>Completely enveloped by golden light, the Shrek Six Devils were dumbstruck watching the scene transmitted from the other world. Dai Mubai, Oscar and Ma Hongjun said as one: “Finished.”</p><br/><p>They were men too, and had experience with women as well. They of course understood how stimulating what Tang San saw was, and asked them self if even they could hold back if they were in the same circumstances, let alone Tang San who was still an inexperienced virgin.</p><br/><p>Ning Rongrong and Zhu Zhuqing were already blushing red, closing their eyes without daring to watch. Right now they couldn’t even manage to pray for Tang San.</p><br/><p>Xiao Wu’s gaze had turned dull, tears slowly rolling down her face. Even though she didn’t say anything, she was breathless from heartache. Seeing Tang San tangled up with another woman’s naked body, even if it was just an illusion, was something she couldn’t accept. Ge, don’t tell me you really…...</p><br/><p>At this moment, Xiao Wu only felt powerless. She would use her life to save Tang San when she saw his life in danger, but facing a scene like this, as a girl, she was unable to do anything.</p><br/><p>But in the next moment, Dai Mubai, Oscar and Ma Hongjun all stared wide-eyed, incredulously watching the scene.</p><br/><p>Tang San still stood there calmly, without moving. But his originally fiery gaze had suddenly turned ice cold. He coldly spat out one sentence.</p><br/><p>“Get lost.”</p><br/><p>The naked Qian Renxue tankled up with Tang San’s body trembled, her movements stopping, and looked up towards Tang San with teary eyes, asking distressed:</p><br/><p>“Why?”</p><br/><p>Tang San said indifferently:</p><br/><p>“Because you’re not her. My body belongs only to Xiao Wu.”</p><br/><p>Boom—— Qian Renxue instantly erupted into roaring golden flame that consumed every part of the illusion in front of Tang San.</p><br/><p>Indeed, sexual desire was a difficult trial for a man, but when the illusion appeared and Tang San saw that erotic scene, he silently read out a few words in his heart. Even if the scene made his animal blood boil when he first saw it, these words always filled him. In the end, it was also these words that pulled his heart back.</p><br/><p>The words Tang Sa recited was the words Xiao Wu sent him through their connection before: That’s not me.</p><br/><p>Yes, Qian Renxue wasn’t Xiao Wu, that wasn’t his love. No matter how strong the desire, it still couldn’t compare to Tang San’s love for Xiao Wu. In the last moment he was suddenly alerted and pulled back from lust. Besides Xiao Wu, no woman could get anything from Tang San other than those words, his heart like steel.</p><br/><p>In the Seagod Palace, Xiao Wu cried. Her heart trembled, her soul trembled. She only repeatedly muttered one word,</p><br/><p>“Ge…… Ge……”</p><br/><p>The scene returned to normal, and the left arm bone floated above the seventh little platform. Nourished by those golden waves, it turned into the shape of a Titan Giant Ape. Even if it was small, it had now turned completely golden. Gazing at Tang San, his eyes only held gentleness.</p><br/><p>With an inward sigh, Tang San finally understood why Qian Renxue was so tolerant at first when she chased him. If he didn’t guess wrong, the scene he just saw should have been real. When Qian Renxue underwent her inheritance, the scene of intercourse with him suddenly appeared in her mind. Moreover, since she had already become god, that scene should have been helpful to reach divinity. No wonder she was so tolerant.</p><br/><p>Seven of eight trials had passed. Tang San directly wiped his right hand on the Wishful Hundred Treasures Purse, and that soft yet flexible whale pearl appeared in his hand. He hadn’t forgotten what the Seagod said to him. To pass this eighth trial, the whale pearl would have surprising effects. At this step, Tang San couldn’t help showing a faint smile.</p><br/><p>Happiness, anger, sadness, fear, love, hate, desire, each of the seven emotions had passed. If the Seagod’s Heart wasn’t damaged, he would already have completed the inheritance. But one last step still lay before him, the step he most wanted to take, to reawaken the divine power of the Seagod Trident.</p><br/><p>The eighth stage hovered in front of Tang San, and at the same time that dark Seagod Trident also floated up.</p><br/><p>The Seagod Trident still seemed filled with an abstruse presence, but that cavity it made Tang San’s heart ache.</p><br/><p>Cautiously pressing in that soft whale bead, Tang San took off his Twenty Four Moonlit Bridges and unreservedly poured out more than a cubic meter of whale brain. He first of all grabbed one lump and squeezed it onto the already somewhat deformed whale pearl in the rhombic cavity on the Seagod Trident. Then he slowly stuck the Seagod Trident into the pile of whale brain.</p><br/><p>Deep blue light shot like lightning from the Seagod Trident brand on Tang San’s forehead, intensely shining on the Seagod Trident, and unhesitatingly released mental power. There was no skill involved, Tang San only gazed gently at the Seagod Trident, and constantly released his Seagod’s light. Inwardly he sincerely called out.</p><br/><p>“Come back, my partner. Even if I spend all my power, I still want you back.”</p><br/><p>The Seagod’s light grew increasingly intense, already wrapping up that dark Seagod Trident in blue. As if influenced by the Seagod’s light, the Deep Sea Demon Whale King’s brain also gradually turned blue and slowly, bit by bit, merged into the Seagod Trident.</p><br/><p>That whale pearl also merged with the blueing whale brain. Truly inlayed into that cavity, it slowly absorbed the Seagod’s divine light Tang San released.</p><br/><p>This process took a very long time. The golden sea around the platform also calmed, without any waves, like it had become an endless golden ocean.</p><br/><p>No matter how strong the mental power, in the end it would be limited, and even more so when Tang San was already exhausted from the previous seven trials. His mental strength gradually dried up, and was even somewhat overdrawn. But Tang San still produced the Seagod’s light, and only his expression changed from calm to resolved.</p><br/><p>What he just said to the Seagod Trident was a man’s promise. After so much trouble, Tang San wouldn’t give up at the last moment no matter what.</p><br/><p>Time passed second by second. Tang San was already trembling, his face white as snow. The Seagod Trident brand on his forehead also grew fainter and fainter. But he still clenched his teeth and endured, refusing to stop producing Seagod’s light. He had a kind of feeling that if he stopped now, there might never be another chance to restore the Seagod Trident.</p><br/><p>Just then, the platform Tang San stood on gradually lit up, and the other platforms originally circling arrived in front of the eighth. The seven platforms representing the seven emotions slowly revolved around him. The golden mist on each one began to turn into intense golden light, making everything around him even brighter.</p><br/><p>The first to move was the Eight Spider Lances that had already reached the god level and that Tang San had spent so much effort to turn into the Seagod Eight Wings. The wings soared up, and that golden pillar of light once again increased somewhat, the wave and cloud patterns glittered with faint blue light, and the entire Seagod Eight Wings were dyed glorious golden blue.</p><br/><p>The platform carrying it instantly flew out and arrived at Tang San’s forehead. A scorching hot golden light fell from above, enveloping him, and those golden golden blue Seagod Eight Wings also flew out, falling from the sky, landing on Tang San’s back.</p><br/><p>Feeling a scorching heat, Tang San with his close to dried up energy channels felt something like an adrenaline rush. He shook once again, but this time it was with a pleasure as if reborn. That scorching energy invaded all his dry channels, and his mental strength rose again. The originally flagging Seagod’s light also grew stronger. Tang San felt an enormous energy pour into him from his back like a hundred rivers emptying into the sea, frantically rushing through his body. Such pleasure was incomparable, and he no longer felt exhausted and weak.</p><br/><p>Tang San also immediately sensed the source of the change. On his back, the eight enormous wings each connected with eight of his ribs, just where the Eight Spider Lances used to be connected. The golden blue wings spread out, and that enormous energy was absorbed from the sea through these wings.</p><br/><p>Along with the Seagod’s light growing stronger again, the Seagod Trident it illuminated also began to show minute changes. The pattern on the trident began to turn faintly golden, and the whale pearl also began to turn transparent. At least a third of the whale brain’s energy had been absorbed into the Seagod’s Trident.</p><br/><p>With the enormous energy blending into him, filling his whole body with strength, Tang San’s firm gaze also sharpened. Starting from the pupils, his eyes gradually turned golden blue, soon filling his whole eyes.</p><br/><p>With the golden blue light blending with the Seagod Eight Wings, the little platform also vanished from above Tang San after releasing them. The second platform, the one bearing Tang San’s Sky Blue Bull Python right arm bone, flew up above him at the same time.</p><br/><p>A resonant dragon cry soared at the sky, echoing. In that clear and powerful sound, the cyan dragon circled and climbed, leaving the range of the platform and shooting into the sky, flying straight up. As that azure body swept past, it left behind large lumps of seawater, and it gradually turned from azure into a golden blue giant dragon.</p><br/><p>Boom—— As that giant dragon had climbed to a height where it was difficult to see with the naked eye, it suddenly turned around. The entire golden ocean once again roared with waves, the dragon cry sounding without end. In a flash of light, that giant dragon shrank.</p><br/><p>An intense suction force pulled up Tang San’s right arm. That shrunken golden blue dragon circled, twisting around his arm. A scorching feeling once again comforted Tang San’s heart, unprecedented energy suddenly blending in. It felt like Tang San’s right arm was in a furnace, feeling unprecedented delight from every piece of his skin, from the tips of his fingers all the way to his shoulder. Resounding cracks echoed in that surging energy, golden blue armor quietly emerging underneath the intense light.</p><br/><p>A dragon head appeared on his shoulder, elegant rather than ostentatious, and armor with neat dragon scale patterns spread down his entire right arm, ridges and corners distinct, even over his palm and fingers. It fit perfectly to the muscles on his arm, but without any feeling of hardness, and seemed like it wouldn’t influence his movements. There was also a golden blue gem in his palm that erupted with intense suction power, drawing in the golden seawater. Instantly, even more enormous energy flowed into Tang San, and he absorbed it like a bottomless pit.</p><br/><p>Golden seawater was constantly pulled into him through the armor on his right arm, the gloriously golden water forming an arc in the air, extremely dazzling.</p><br/><p>Supported by the Seagod Eight Wings and this solid Seagod right arm armor, Tang San felt his recovery already able to balance with the output of Seagod’s light.</p><br/><p>But this was just the beginning. As if influenced by Tang San’s firm will, those platforms flew over one after another. Closely behind the second Sky Blue Bull Python right arm bone platform came Tang San’s Blue Silver Emperor right leg bone.</p><br/><p>Sparkling crystalline blue silver grass floated down, each blade turning into a stream of flowing light, winding up from below Tang San’s feet, all the way to the base of his thigh. With resounding cracks, Tang San felt his right leg tighten, enormous force suddenly spreading through his whole body. Gentle energy instantly pulsed. Golden blue armor radiated light along with the gorgeous light brought by the blue silver grass, completely fitting with Tang San’s right leg.</p><br/><p>The right leg armor was covered with wave and cloud patterns like the Seagod Eight Wings, and also protected every part of Tang San’s skin. On the sides of his calves protruded three spikes like thorns, each one with a wing-like curve on the back.</p><br/><p>The third platform disappeared along with the Seagod right leg armor being fitted. The fourth platform followed. The Evil Spirit Orca King’s shadow flashed and struck Tang San’s left leg hard. Tang San instantly felt an ice cold feeling from his left leg, completely at odds with the warm comfort from his Blue Silver Emperor right leg bone. But this cold feeling also roused Tang San’s mind. Left leg armor identical to the right leg appeared, the only difference being a faint hazy light in front, like a sharp blade. That was clearly related to the Evil Orca right leg bone’s original Orca Evil Spirit Hatchet ability.</p><br/><p>With each piece of armor that equipped itself, Tang San’s power would multiply, and the Seagod’s light radiated by the Seagod Trident brand on his forehead would intensify. This armor became Tang San’s strongest support, and also the most important divine instrument to amply release the Seagod’s divinity.</p><br/><p>After the fourth platofrm’s Evil Spirit Orca left leg bone turned into armor and was equipped on Tang San, the next to appear wasn’t the fifth platform with the skull spirit bone as Tang San expected, but rather skipped straight to the seventh platform, the Titan Giant Ape left arm bone to ascend. With a reverberating crack, his left arm was covered by thick and solid angular armor. Different from the right arm spirit bone, the left pauldron was perfectly smooth, without any dragon shape, and the armor seemed a bit bulkier compared to the right arm. But the overall form was still exactly the same as the wave and cloud pattern, and the differences in the arms didn’t feel uncoordinated. On the contrary it seemed filled with power and beauty.</p><br/><p>All four limbs were complete, plus the Seagod Eight Wings on his back. The golden ocean around the platform boiled, seawater spinning around it and shooting at the sky, turning into a giant maelstrom, spinning violently around. Enormous Seagod energy blew into Tang San’s body, as if reconstructing him, remaking every part of him.</p><br/><p>The sixth platform flew out next, and the Deep Sea Demon Whale torso bone with its soul completely crushed soared up, falling from above. The originally purple spirit bone had already turned into golden blue armor while still in midair, and an extremely dazzling breastplate descended along with a hundred leaved armored skirt.</p><br/><p>With a sonorous crack, a rich feeling filled every part of Tang San’s body. His hair quickly grew all the way to his back, not golden for once, only a deep blue like the endless ocean. The blue hair fluttered in the wind, all armor covering his whole body.</p><br/><p>The chest armor formed from the Deep Sea Demon Whale torso bone was extremely impressive. Solid chest armor, waist armor like fish scales, as well as the hundred leaved battle skirt glittering with light. Together with the armor on the four limbs, it all looked dazzling. In the middle of the chest, a more than fist sized ocean blue rhombic gem was inlaid between the chest and waist armor. If you looked carefully, inside that blue gem glimmered whirlpool-shaped light like an abyss. The gem was reminiscent of the gem in the Deep Sea Demon Whale King’s human form battle armor, but this gem contained pure Seagod power.</p><br/><p>Four lights sparkled from Tang San’s shoulders and the base of his thighs, right where the torso armor and the limb armor where connected. At the same time the ribs where the Seagod Eight Wings were connected shone. The connecting sounds were so touching, and with surging Seagod energy, the chest armor merged with the four limb armor and the Seagod Eight Wings, truly forming one whole. The instant it was all completed, the never moving fifth platform flew up. It no longer flew up above his head, but rather flew over in front of the eighth platform where the Seagod Trident was.</p><br/><p>The skull bone quietly rose. Around it there seemed to be a small whirlpool matching the giant one, and the bone began to change. The golden blue luster shone dazzlingly, and small trident blades appeared, connected by a circle, forming a golden blue trident headband.</p><br/><p>In the center of the circle was a small trident-shaped cutout. As it flew over and landed on Tang San’s head, tying down the long blue hair, that open shape perfectly fit the Seagod Trident brand on his forehead. Instantly, intense golden blue light exploded, and the Seagod Trident always illuminated by Seagod’s Light in front of Tang San changed.</p><br/><p>The shaft was no longer dark, that magic pattern that once gave Tang San enormous divine power was completely lit up, intense gold mixed with the blue of the Seagod’s light, turning into brilliant golden blue that spread to each part of the trident. And the whale bead reformed into the Seagod’s Heart also finally turned into a resplendent rhombic gem with the light.</p><br/><p>At the same time the trident pattern on Tang San’s headband and the brand on his forehead changed, the trident brand changing into another small scaled rhombic gem representation, making this golden blue headband seem even more perfect.</p><br/><p>Flawlessly clear Seagod’s light shot from the headband, shining on the newly reformed Seagod’s Heart on the trident. At this moment, Tang San felt himself become the absolute center of this place, and the Seagod Trident’s familiar and even more amiable presence filled his whole body.</p><br/><p>The Seagod Eight Wings on Tang San’s back suddenly extended, intense golden blue light rising around him. As this misty light grew more and more intense, it finally turned into a golden blue pillar of light that shot toward the sky. Surging energy merged with the brand in the deepest parts of Tang San’s soul to become an unprecedentedly enormous energy.</p><br/><p>Tang San saw his soul clearly. His soul already existed in reality, having transformed into a golden blue rhombic gem now on the center of his forehead, fitting into the Seagod headband. Tang San didn’t know that the soul becoming substantial was the mark of becoming a god. From today on, his mental power had already evolved into divine sense, the divine sense of the Seagod.</p><br/><p>Looking emotionally at the Seagod Trident in front of him, the golden blue light in Tang San’s eyes gradually retreated. At this moment he fully understood the changes to his body after he obtained the Vast Sea Cosmic Barrier back then. The scorching heat that he would occasionally feel in his spirit bones in the past should have been the Seagod’s light imperceptibly influencing and transforming his spirit bones, saturating them with the Seagod’s power, triggering evolution. Until the start of this final inheritance ceremony, when this evolution was finally completed. The spirit bones were stripped from his body, and transformed one by one by the Seagod’s divine power as Tang San underwent each of the trials of seven emotions. They had evolved into a Seagod Raiment not inferior to the Angelic Raiment.</p><br/><p>No, it should be said that Tang San’s Seagod Raiment even surpassed Qian Renxue’s Angelic Raiment. The Angelic Raiment was admittedly a divine instrument left in the mortal world by the god of angels, and each spirit bone that constituted it was close to the hundred thousand year level. But Tang San? Which of his spirit bones wasn’t also at the hundred thousand year level? Even the only the skull spirit bone that wasn’t had merged with the Seagod’s Heart and Tang San’s Purple God Light ability, its power was even beyond that of ordinary hundred thousand year spirit bones.</p><br/><p>Even though Tang San’s spirit bones came from different spirit beasts, their quality really was superlative. With the million year Deep Sea Demon Whale King’s torso spirit bone as the center, this Seagod Raiment was even stronger than the original Seagod’s raiment. In particular, the Seagod shouldn’t have wings, he was the god of the ocean. But Tang San produced the external spirit bone Eight Spider Lances that completed its final evolution into the Seagod Eight Wings. Without a doubt, this Seagod Raiment was like a tiger that had grown wings, its power increasing substantially once again.</p><br/><p>Each piece of armor was formed from Tang San’s spirit bones, which also meant they were perfectly suited to Tang San. Even if they had turned into armor, they were still part of him. This would never change.</p><br/><p>Boom—— The giant maelstrom around the platform suddenly exploded, incredibly berserk energy sweeping over like a hurricane, engulfing both Tang San and the Seagod Trident in front of him.</p><br/><p>Tang San didn’t seem to feel it. His gaze was now only on that destined partner. His right hand slowly rose. Right now there was nothing that could stop him from moving. The solid right hand, the right hand covered with Seagod Raiment, firmly gripped the Seagod Trident once again burning with golden blue light.</p><br/><p>The instant Tang San gripped the Seagod Trident, violent golden blue flame suddenly soared from his body. All the chaos in the sky seemed to freeze in this instant. The next moment, that dazzling golden blue Seagod Trident, the reborn Seagod Trident, was pointed straight up, directly at the vault of heaven.</p><br/><p>Boom—— Enormous suction force erupted from every part of Tang San, the wave and cloud pattern of the Seagod Eight Wings on his back gleaming with even more unprecedented glaring light. The golden seawater streamed in from all directions with the speed of lightning, madly rushing into Tang San, and also into the Seagod Trident. Golden blue flame circled Tang San, and from below him, one ring of light after another slowly rose.</p><br/><p>An ancient voice, filled with respect, boomed from all around:</p><br/><p>“Seagod ninth trial complete, Seagod divinity perfectly assumed, the Seagod reborn. All spirit ring cultivation raised fifty thousand years.”</p><br/><p>The spirit rings rising around Tang San were magnificent, shockingly so. Tang San had seen nine spirit rings with both black and red from Qian Renxue in the past, each spirit ring rendered with golden light. But what he saw now was a completely different scene.</p><br/><p>The first spirit ring that appeared was red, wrapped up in dazzling golden blue on the outside. The second was the same, and so on, not changing all the way until the ninth spirit ring, all red on the background, surrounded by golden blue light. Only that last rising spirit ring was different. The tenth spirit ring representing the power of a god, was completely bright golden blue.</p><br/><p>One hundred thousand years, every one a hundred thousand years. As a spirit master, even if Tang San wasn’t a god, a full set of hundred thousand years was still too shocking. Even he himself didn’t quite dare believe it.</p><br/><p>The last reward of the Seagod trials was actually to raise all spirit rings’ cultivation by fifty thousand years, and the Blue Silver Emperor spirit that had its spirit rings re-added once had spirit rings that were fifty thousand years at the lowest. Fifty thousand plus fifty thousand ,this led to even Tang San’s first spirit ring turning red. Nine red and one golden blue, that was a truly terrifying divine power!</p><br/><p>Right now Tang San no longer had the power to be aware, in his heart was the word control. Yes, control everything.</p><br/><p>Raising the Seagod Trident, it would no longer turn black due to lack of energy. It was already branded onto Tang San’s soul, becoming a part of him. Just like the Seagod Raiment from spirit bones was inseparable from Tang San. That kind of feeling was beautiful.</p><br/><p>Right now on Seagod Mountain, in the Seagod Palace, Xiao Wu also changed. The red dot on her forehead quietly shattered, and a pure voice echoed in her mind,</p><br/><p>“First rate trial complete, accompany the Seagod in completing the inheritance, superpositioned rewards released, rewarding……”</p><br/>\n</div>"}