{"title": "Chapter 326", "id": 326, "volume": 4, "url": "http://boxnovel.org/douluo-dalu-chapter-326", "volume_title": "Volume 4", "body": "<h1>Chapter 326</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 326</p><br/><p>Nine Treasure Invincible Divine Light</p><br/><p>(TL by Bagelson)</p><br/><p>The Heaven Dou Empire’s million man army suddenly erupted with immense fighting power, especially the way they cooperated as entire divisions were dispatched, moving a million troops without any disorder, everything neat and tidy.</p><br/><p>This was the atmosphere of a great nation, something a temporarily assembled nation like the Spirit Empire couldn’t compare to. The Spirit Empire was established entirely by relying on Spirit Hall’s formidable strength and influence, as well as controlling more than sixty percent of all the spirit masters on the continent, through coercion and enticement. And then those kingdoms and duchies that felt danger from the two great empires and had no choice but to adhere to the Spirit Empire. Without a doubt, in terms of spirit masters, if the Heaven Dou Empire didn’t produce a Tang San, they basically wouldn’t even stand a speck of a chance. Even if the Clear Sky Clan came out it would in no way be enough to make up the difference.</p><br/><p>Tang San’s greatest influence on the Heaven Dou Empire wasn’t his personal strength, but rather his Tang Sect hidden weapons, using Tang Sect hidden weapon equipment to truly turn the Tang Army into a deadly threat to the Spirit Empire. If the difference in spirit masters was described as enormous, then the ratio of soldiers between both sides was even larger, but this time completely in reverse. The Heaven Dou Army’s mood was strict, appropriately dispatched, and had even higher morale. As orders came, it moved as freely as the arm moves the finger. As long as the Spirit Empire’s spirit master legions couldn’t start them off at a major advantage, then it was impossible for their ordinary armies to compete with the Heaven Dou Empire. It was difficult to defend even with this Jialing Pass in the way.</p><br/><p>Whether Qian Renxue or second priest Golden Crocodile Douluo, they were after all no army commanders. Their personal strength was as high as could be, but when it came to unifying the army, they had no special talent. To them it seemed that Jialing Pass’ defenses were so tight, even if the Heaven Dou Empire wanted to break through, they would still be bound to a siege battle, first passing the walls, and even if they wanted to attack the gates, their spirit masters could attack from atop the walls.</p><br/><p>When the battle just started this really was the case, the Heaven Dou Empire’s powers directly chose to attack the top of the walls. But, the actions of the Tang Sect Strength and Defense Hall disciples, immediately made the spirit masters on the walls panic. Everyone knew that if the gates were breached, then the defenders inside Jialing Pass would be directly faced with the unrelenting, unhesitating all out assault of a million troops. Spirit masters had limited spirit power, even if they killed with all their strength, how many could they kill? Killing ordinary soldiers was still easy, but to killing those heavily armored troops still had to be done through rather strong spirit abilities.</p><br/><p>Originally the Spirit Empire’s spirit masters and soldiers were very confident in their reforged solid gates. These were up to five meters thick solid iron gates, weighing at least a hundred thousand jin. But, as they saw the battering rams carried by the Tang Sect disciples, their confidence was completely swept away. It was the first time they saw such enormous battering rams, and nobody could be sure how many strikes these gates could suffer.</p><br/><p>The joint attack of the Tang Sect and Heaven Dou Empire spirit master legion was even more intense. The effect of the Heaven Dou Empire spirit master legion was mainly to defend the Tang Army, positioned just far enough from the top of the walls that none of the numerous enemy spirit masters’ attacks could reach. Only a small number of spirit masters specializing in long range attacks could pour strikes down in torrents. The Heaven Dou Empire spirit masters might be much fewer, but defending from attacks at such a distance still wasn’t a problem. After all, the Spirit Empire’s strongest spirit masters were all busy fighting the Shrek Six Devils and the Heaven Dou Empire spirit master powers headed by the Tang brothers.</p><br/><p>Spirit masters couldn’t attack extremely far, but the Tang Army soldiers’ specially made Godly Zhuge Crossbows had no such restriction. In order to maximize the power and minimize the material requirements, under Tai Tan’s charge, these Godly Zhuge Crossbows’ mechanisms were made way larger than the original. While the materials were a bit lacking, the attack power had instead increased. After all, the size of the encasing let the mechanism be made even larger, and the same for the crossbow bolts. Their attack range wasn’t as far as bow and arrow, but within four hundred meters the Godly Zhuge Crossbow maintained its terrifying killing power.</p><br/><p>Ten thousand Tang Army soldiers only launched one volley, but the ten thousand Spirit Empire spirit masters atop the walls had to cower down, and even instantly suffered large casualties. Even though the effect couldn’t be as large as last time with the flying mushroom sausage, suppressing the spirit masters on the walls was no problem.</p><br/><p>On the battlefield, sometimes the outcome wasn’t decided entirely by strength. Morale and attitude were also extremely important. The Tang Army once left an extremely “profound” impression on the Spirit Empire’s spirit masters, and even though the spirit masters on the walls hadn’t all experienced those circumstances, the story had already spread from one to ten and from ten to a hundred in the spirit master legions. Now that they faced the Tang Army for real, their hearts were already filled with fear, and nobody wanted to bear the brunt of the attack. One after another they retreated from the top of the walls. Who could then stop the assault of the Tang Sect disciples?</p><br/><p>The attacks of a handful of spirit masters was basically no threat to the Defense Hall disciples. With the tower shields they wielded plus their exceptionally sturdy physique, they easily escorted the Strength Hall disciples with the battering rams up to the walls of Jialing Pass.</p><br/><p>Violent explosive sounds reverberated practically as one. The Strength Hall disciples started their charge when they were still twenty meters from the gates, their strength fully focused on their four limbs, sprinting full tilt, releasing the strongest possible impact force with the battering rams on their shoulders.</p><br/><p>The conical ram heavily impacted those iron gates. With this attack, even the Strength Hall disciples with their terrifying strength staggered back from the shock, and a few rather weaker disciples had the skin between their fingers split. But, their attack wasn’t for nothing, the gates already showed giant dents, and the surrounding rock revealed massive cracks.</p><br/><p>Five hundred thousand jin really was too terrifying. Even just one of these was breathtaking.</p><br/><p>“Hold the gates! Spirit master legions, attack! Soldiers below the walls, support the gates!”</p><br/><p>Golden Crocodile Douluo had just managed to crawl out of the wall, but the shaking from four heavy battering ram strikes knocked him to the ground again. The Hell White Tiger’s attack power was truly terrifying, under the effect of Erect Gold Fly, they made this hundred year old Douluo’s body suffer unprecedentedly heavy injuries. With difficulty gathering his breath to crawl up, his loud roar made him vomit another few mouthfuls of blood.</p><br/><p>A dozen Spirit Empire support type spirit masters exerted their abilities on Golden Crocodile Douluo, easing his expression somewhat, but the light of his spirit rings was still extremely dull. Golden Crocodile Douluo couldn’t help sighing, the years were unkind! As his bodily functions deteriorated, so did the rate at which he healed injuries decrease. But, he knew he couldn’t retreat now. The Heaven Dou Empire’s first wave of attacks was the fiercest, if they could defend this attack, they could safely endure until Qian Renxue and that Seagod’s battle was over. Until the young miss returned, he had to persist in the battle here.</p><br/><p>Golden Crocodile Douluo looked down over the battlefield. At his command, the Spirit Empire’s spirit masters had quickly regrouped, and were launching fierce attacks down on the Tang Sect disciples. And this was also just in the empty period after the Tang Army’s first volley. Under the numerous spirit ability attacks, even the Strength and Defense Hall disciples couldn’t bear it, and quickly retreated under the cover of the tower shields, back across the moat.</p><br/><p>However, the Heaven Dou Empire’s archers never stopped, sixty thousand arrows to a wave, and the incautious spirit master legions suffered casualties.</p><br/><p>Golden Crocodile Douluo now realized his mistake, and quickly gave orders to dispatch the Spirit Empire archer legions to the top of the walls, and at the same time to man the ballistae. When both sides had yet to enter close combat, archers were even more effective than spirit masters.</p><br/><p>After handing down a string of orders, with the help of the support spirit masters, Golden Crocodile Douluo had caught his breath. He wasn’t planning on joining the fight again, right now commanding the army was most important.</p><br/><p>The fight on top of Jialing Pass was already at a white hot intensity. After suffering the attack of the Peacock Plume and then Xiao Wu’s close quarters attack, the third priest became the first of the Spirit Empire’s six great priests to die in battle. When Golden Crocodile Douluo saw him, his body was already twisted into an inhuman shape, and Xiao Wu had already killed her way among those Spirit Douluo, launching an all out offensive. Her Teleportation now showed its greatest use. Backed by rank ninety six spirit power, those rank eighty something Spirit Douluo single target attacks couldn’t hit her, and they didn’t dare use area attacks for fear of hurting their allies. In an instant, another four Spirit Douluo had died to Xiao Wu’s Soft Skill.</p><br/><p>However, the battlefield wasn’t all bad news to the Spirit Empire. As the battle prolonged, Dai Mubai and Zhu Zhuqing’s Hell White Tiger could no longer endure. The giant form scattered into specks of light, revealing Dai Mubai and Zhu Zhuqing themselves.</p><br/><p>The enormous exhaustion from the Hell White Tiger made their faces seem a bit pale. After all, when they attacked Golden Crocodile Douluo earlier they had also suffered a lot of attacks.</p><br/><p>They had previously been blocked by the fourth and fifth priest. These two grand priests were quite formidable, even if the Hell White Tiger had astonishing strength, they still managed to withstand its attacks, retreating step by step to save themselves. Now that the pressure suddenly disappeared, as one side declined the other rose, the two grand priests instantly erupted, violently charging at Dai Mubai and Zhu Zhuqing.</p><br/><p>Golden Crocodile Douluo saw this scene and immediately showed a happy expression, his hazy eyes filled with resentment. It was this pair that had heavily injured him with their spirit fusion ability, now he wanted to see what chance they stood, the situation would also definitely change because of their lacking stamina. After killing them, as the two priest level powers joined the fight, they could definitely reverse the direction of the battle.</p><br/><p>Just while Golden Crocodile Douluo was calculating the contrast in strength between both sides, he suddenly discovered that Dai Mubai and Zhu Zhuqing showed no trace of alarm, so much that they even looked a bit happy. An ominous feeling instantly rose in Golden Crocodile Douluo’s heart, and he roared without hesitation: “Careful!”</p><br/><p>The fourth and fifth priest were attacking with all their strength, and seeing their attacks already hitting Zhu Zhuqing and Dai Mubai, even though they heard Golden Crocodile Douluo’s shout, they didn’t realize it was aimed at them. In fact, right now their mental power was already completely locked on Dai Mubai and Zhu Zhuqing. As priests of the Spirit Empire, they had spent their entire lives researching all kinds of spirits, and naturally knew how weak spirit masters would become after ending a spirit fusion bility. Moreover, at this moment they still had several Spirit Douluo level support spirit masters backing them. With their attack power at its peak, nevermind resisting, Zhu Zhuqing and Dai Mubai didn’t even seem to have a chance to escape.</p><br/><p>However, they didn’t notice, outside the walls, by the moat, at the same time as Dai Mubai and Zhu Zhuqing’s spirit fusion ability ended, the support light of that Nine Treasure Glazed Tile Pagoda containing Ning Rongrong suddenly halted, Oscar, Xiao Wu and Ma Hongjun temporarily losing Ning Rongrong’s buffs. And at the same time, that red ninth spirit ring revolving around the pagoda also shone on the battlefield for the first time. Two red dazzling lights shot out, quietly cresting Jialing Pass, practically simultaneously hitting Dai Mubai and Zhu Zhuqing.</p><br/><p>In that instant, Dai Mubai and Zhu ZHuqing were both enveloped in dazzling golden red light, and in just the same second, the two great priests’ attacks also each hit them.</p><br/><p>The fourth and fifth priests were instantly filled with joy, but they very quickly sensed something amiss. They attacked with the power of rank ninety six Title Douluo, but while they hit the two enemies in front of them, the torrential force still drained away into nothing like a clay ox in the sea.</p><br/><p>The golden red light disappeared the instant their attacks ended, and at the same time, six boosting lights from Ning Rongrong simultaneously hit Dai Mubai and Zhu Zhuqing.</p><br/><p>One white and one black ball of light shot out almost simultaneously, using the moment just after the fourth and fifth priests’ attack, catching this crucial timing.</p><br/><p>In order to maximize attack speed, Dai Mubai and Zhu Zhuqing didn’t bring out their strongest spirit abilities. Zhu Zhuqing turned into a vague black light, quietly nestling up to the fifth priest, Hell Enhanced Hell Hundred Claws, the fastest attack she could produce. As an agiity attack type Title Douluo, in practically an instant, she completed the boost from Hell Enhancement, countless claw shadows suddenly exploding at the opponent’s chest.</p><br/><p>Dai Mubai’s attack was much simpler, a giant ‘kill’ character appeared above both his golden tiger claws, the sixth spirit ability, White Tiger Annihilating Kill.</p><br/><p>The fourth and fifth priests had never thought that they could be defeated by Dai Mubai and Zhu Zhuqing not in their Spirit Fusion Ability Hell White Tiger, and so now stumbled in the ditch.</p><br/><p>With miserable screams, the two great priests flipped backwards simultaneously, blood spraying in the air like fountains. Even though they used their spirit power to guard themselves as far as possible at the last moment, don’t forget that the enemies they faced were powers of the same Title Douluo level, and moreover they now didn’t face two Title Douluo, but also the world’s number one support spirit master, Nine Color Douluo Ning Rongrong. It was also those two bizarre rays of light from the Nine Treasure Glazed Tile Pagoda that reversed the entire battle. The difference was that Dai Mubai and Zhu Zhuqing knew in advance that Ning Rongrong’s support would arrive in time, while these two priests did not. Therefore, not only were their defensive spirit power broken, they also suffered extreme injuries.</p><br/><p>The most direct effect was that at the same time as the two priests were blasted back, they were already unable to maintain their spirit avatars. As blood splattered, White Tiger Douluo and Hell Douluo’s frightening spirit power had already stabbed into their veins. Even though it wasn’t fatal, the two priests were still severely injured, torn and mangled at their chests.</p><br/><p>The first time Ning Rongrong used her ninth spirit ability in battle she reversed the outcome of a fight between four powers, again proving her strength as the world’s number one support tool spirit master. The ability she used was called Nine Treasure Invincible Divine Light, its effect similar to Xiao Wu’s Invincible Golden Body. The difference was that Xiao Wu’s Invincible Golden Body could only be used on herself, with three second invincibility. And Ning Rongrong’s Nine Treasure Invincible Divine Light could be used on any target. It could be used ten times per day, and moreover and moreover didn’t consume any of her spirit power. This was the frightening effect of a hundred thousand year spirit ability. Of course it was also inextricably linked with the Nine Treasure Glazed Tile Pagoda’s quality as well.</p><br/><p>It seemed like the Nine Treasure Invincible Divine Light could only last as long as Invincible Golden Body, but in a battle between true powers, one second invincibility could be equal to another life! Just like the earlier attack, if not for Ning Rongrong’s Nine Treasure Invincible Divine Light, the injured ones would be Dai Mubai and Zhu Zhuqing. The Shrek Six Devils once again relied on their cooperation to win from behind, injuring two powerful enemies, and also finally breaking the balance of powers between both sides in the battle.</p><br/><p>Dai Mubai and Zhu Zhuqing didn’t pursue, they weren’t just acting exhausted, in forcing the previous attack after using Spirit Fusion Ability, their spirit power was already at rock bottom. From the start of the battle, without a doubt, they as the Hell White Tiger had suffered the most, and were naturally also the most exhausted. Ning Rongrong’s ability was only to buff, she couldn’t help them recover their spirit power. However, if Ning Rongrong couldn’t help them recover, that didn’t meant they couldn’t recover at all.</p><br/><p>Dai Mubai and Zhu Zhuqing each produced a kind of thing, resplendent, a cylinder with countless facets. If they said nothing, nobody would believe this was actually a sausage, but rather more like a precious gem. The two smiled at each other, somewhat helplessly swallowing the peculiar sausages. If anyone planned on chewing to eat a sausage like this, their teeth would definitely collapse. In fact, this sausage was hard like a real diamond. Only by directly swallowing it could it take effect. This was Food God Douluo Oscar’s ninth spirit ability, Half Again Diamond Sausage.</p><br/><p>Why was it the Half Again Diamond Sausage? On the battlefield, this Half Again Diamond Sausage made all your abilities half again that of your opponent, that simple meaning. But the effect it had was absolutely terrifying.</p><br/><p>If Oscar’s eighth spirit ability Crystal Caterpillar Sausage was described as the best healing food, then this Half Again Diamond Sausage was the ideal recovery food. Its effect wasn’t comparable to Oscar’s first spirit ability, Big Recovery Sausage. After eating a Half Again Diamond Sausage, within three seconds, physical strength, spirit power and mental strength would all recover by half. Consider, when you were exhausted from fighting an opponent of nearly the same strength as you, and ate this sausage, what would the result be? Especially since Oscar made each Half Again Diamond Sausage after first eating Erect Gold Fly, thereby adding ten ranks of effect to this Half Again Diamond Sausage making it better called Double Diamond Sausage, fully recovering spirit power and physical strength.</p><br/><p>Three seconds, in just two breaths, Dai Mubai and Zhu Zhuqing didn’t pursue and attack, but in these two brief breaths, the paleness of their faces disappeared completely, recovering their full strength.</p><br/><p>If Ning Rongrong’s Nine Treasure Glazed Tile Pagoda was the Shrek Six Devils’ solid support, then Oscar’s sausage was their secret weapon. The manufacture of this Half Again Sausage was rather challenging, enormously exhausting to Oscar. To be able to produce six in the short time it took them to return, giving the six devils one each, that wasn’t possible with Oscar’s strength alone. But he could complete this arduous task with Tang San’s Seagod divine power support. This was also an important factor for why the Shrek Six Devils were confident in facing the six great priests. Relying on Oscar’s sausage, they practically each had double the strength of the opponents! The change in the situation also started from this moment.</p><br/><p>The fourth and fifth priest resisted the pain, crawling up after rolling across the ground. Their expressions were already extremely unsightly, and they were just in time to see Dai Mubai and Zhu Zhuqing’s changes. The two priests’ eyes filled with incredulity, practically roaring in one voice: </p><br/><p>“This is impossible!”</p><br/><p>Dai Mubai laughed out loud,</p><br/><p>“If your Spirit Empire had a food type Title Douluo as well, you would know this really isn’t impossible. Especially when this food type Title Douluo even has a hundred thousand year spirit ability. We’re not playing around.”</p><br/><p>While speaking, Dai mubai and Zhu Zhuqing shot forward simultaneously, but not to continue attacking those two priests, rather turning and charging straight at the Spirit Empire spirit master legion on top of the wall. There, even the strongest spirit masters were just Spirit Sages.</p><br/><p>“Not good!”</p><br/><p>Golden Crocodile Douluo’s expression changed, roaring:</p><br/><p>“Quick, Spirit Douluo level bishops, stop them!”</p><br/><p>But, his cry was still a bit too late. Zhu Zhuqing as an agility attack type Title Douluo was so fast that she flashed past in an instant, and even easily used her sharp claws to cut the throat of a Spirit Douluo. Dai Mubai wasn’t as fast as Zhu Zhuqing, but his spirit power had reached rank ninety five, and also started his Hurricane right leg effect. With massively increased speed, for a moment he wasn’t much slower than Zhu Zhuqing. Especially when they were each hit by two support lights, agility buff and spirit power buff. As a result, the two charged through in moments, leaving only a trail of carnage.</p><br/><p>The fourth and fifth priests roused themselves, chasing after Dai Mubai and Zhu Zhuqing. But at this moment, a scream resounded, and a large pile of mincemeat blocked their way.</p><br/><p>“Your opponent is me.”</p><br/><p>Tang Hao’s loud and infinitely aggressive voice exploded. That pile of meat was one of the three Title Douluo that had faced him. Tang Hao started very simply, ring detonation. He detonated his first spirit ring, instantly erupting with attack power that wasn’t anything that just promoted and still only rank ninety one power attack type Title Douluo could withstand, and was instantly blasted into a pile of ground meat by the Clear Sky Hammer’s terrifying strength.</p><br/><p>The fourth and fifth priest felt a massive force come through, and as that Clear SKy Hammer swung around, the two were already drawn into battle with Tang Hao.</p><br/><p>Facing four Title Douluo with his strength alone, after even killing one Title Douluo, such aggressiveness was something only Tang Hao could accomplish on the present battlefield.</p><br/><p>Years of pent up frustrations seemed to explode in an instant. Tang Hao’s Clear Sky Hammer churned up and down in the air like a black dragon. In a one against four situation, he was still the attacking side. Such boldness and terrifying strength!</p><br/><p>Dai Mubai and Zhu Zhuqing’s display had completely roused the fighting spirit of this Clear Sky Douluo, and he perfectly displayed the Great Sumeru Hammer. In fact, Tang Hao had studied the Great Sumeru Hammer for decades, while Tang San had only learned it recently, but still relied on it to block the god level Qian Renxue. Tang Hao fully employed this secret skill, and even against four powers, he still wasn’t inferior in any respect. Especially when the fourth and fifth priest had suffered considerable injuries.</p><br/><p>WIth nothing to trouble them in the rear, Dai Mubai and Zhu Zhuqing fused once again in the air, that terrifying Hell White Tiger reappearing on top of the walls. The difference was that this time they didn’t face the second priest Golden Crocodile Douluo, but rather those universally rank seventy or less Spirit Empire spirit master legions.</p><br/><p>What would you call a tiger in a flock of sheep? At the same time as the Hell White Tiger charged into the group of people, the Spirit Empire’s spirit masters fully understood meaning the saying.</p><br/><p>Meet them head on? Even the second priest was smacked straight into the wall, what could they do? Fear instantly spread, and the moment the Hell White Tiger charged into the crowd, it reaped the lives of several dozen Spirit Empire spirit masters. Even more terrifying, some low level spirit masters with less than rank forty spirit power were actually directly scared unconscious from the pressure of the beast. Fainting on the ground here was no different from dying, their allies’ feet was enough to end their lives.</p><br/><p>In fact, on this wall, there were close to twenty thousand Spirit Empire spirit masters. To block the Heaven Dou imperial army’s siege, Golden Crocodile Douluo had concentrated practically their entire spirit master strength here. However, against a power that could briefly reach the god level, what could these ordinary spirit masters do?</p><br/><p>The Hell White Tiger’s wings suddenly flapped, and at the same time as that enormous body was pushed into the air, a terrifying white light suddenly pressed down. Within a hundred meter diameter, the entire wall issued cracking sounds. The spirit masters within this range were blown to pieces, not one could live to see the next sunrise.</p><br/><p>Now, even the spirit masters far away from the Hell White Tiger panicked. Who could still mind pouring down attacks? There was a mad scramble to escape, all kinds of spirit ability lights constantly flickering on the walls.</p><br/><p>How could the Heaven Dou Empire let such a chance slip? The Strength and Defense hall teams mobilized against the walls a second time, renewing their attack on the gates.</p><br/><p>It was also at this moment, unnoticed by the Spirit Empire spirit masters, what seemed like a giant green serpent had quietly slithered up to crest the wall, dark moss green, clinging to the walls and extending its head above Jialing Pass. And this giant serpent just crawling up, seemed innocent and naive.</p><br/><p>No need to ask, this dark green giant serpent was precisely Poison Douluo with the Jade Phosphorous Serpent Emperor spirit, Dugu Bo.</p><br/><p>Dugu Bo wouldn’t fight head on. Among Title Douluo level powers, he could be said to be the weakest, even a Spirit Douluo level power attack type spirit master might be stronger than him in a straight up fight. However, in terms of destructive power on the battlefield, none on the Heaven Dou Empire’s side dared compare themselves to him, except perhaps Tang San.</p><br/><p>Abilities like poison really weren’t just and honorable, and its effect was also limited when facing a true power. After all, stronger spirit masters had a very strong resistance to poison. However, if poison was cultivated to Dugu Bo’s level, reaching Title Douluo, then that was another matter entirely. Even clearly stronger Title Douluo wouldn’t easily want to fight him. In the previous battle, the Spirit Empire had specially dispatched Blowfish Douluo to counter him, but he was currently one of the four Title Douluo trapped in battle against Tang Hao. With no opponent that could restrain him, Dugu Bo’s cold expression flickered with vicious light. The Jade Phosphorous Serpent Emperor spirit avatar lay quietly on the ground, layer upon layer of dark green light slowly spreading, just in the direction of the Spirit Empire spirit masters.</p><br/><p>From the beginning, Dugu Bo not joining the entire battle was Grandmaster’s plan, he was waiting for just this kind of chaotic situation. Right now nobody had noticed him, and he had ample time to release his Jade Phosphor poison. Title Douluo level poison, without exaggeration, had the power to massacre cities. Back when Bibi Dong led the army to Jialing Pass, her first target was Dugu Bo, and was only unsuccessful because of Tang San’s awe inspiring display. Now, the Spirit Empire would pay a heavy price for their mistake.</p><br/><p>In order to produce the full effect of his poison, Dugu Bo deviously made his spirit avatar as small as possible, and the poison he released wouldn’t take effect immediately, only imperceptibly transmitting his Jade Phosphorous Serpent Emperor poison into the ground atop Jialing Pass, only gradually turning it dark green, and quickly spreading out. Even the spirit masters standing on the ground didn’t feel anything at the moment, because the poison was completely accumulated inside the rock. With the battle so intense, and the Hell White Tiger rampaging, who would notice the rock changing color at this moment? Even more when the ground was granite, which was dark gray to begin with, the dark green color change wasn’t completely obvious.</p><br/><p>This old poisonous creature was extremely cunning when deploying his poison. He didn’t spread it towards those Spirit Douluo. The stronger the spirit master, the easier they would notice. His target was only those quantitatively enormous but mostly below rank seventy mid- and low level spirit masters. A wicked smile was already gradually appearing on Dugu Bo’s face.</p><br/>\n</div>"}