{"title": "Chapter 327", "id": 327, "volume": 4, "url": "http://boxnovel.org/douluo-dalu-chapter-327", "volume_title": "Volume 4", "body": "<h1>Chapter 327</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 327</p><br/><p>Faint Green Fills The Walls</p><br/><p>(TL by Bagelson)</p><br/><p>Boom boom boom boom—— Another four explosions that shook all of Jialing Pass reverberated again. Following the opportunity from the chaos created as the Hell White Tiger suddenly charged into the Spirit Empire spirit master legion, the small Tang Sect wall breaking teams sortied once again. This time they were even better prepared, with an even longer run-up. Because of the chaos on top of the walls, the Defense Hall disciples also shared some men to help the Strength Hall disciples carry the giant battering rams towards the gates, and those five hundred thousand jin weights turned even more terrifying.</p><br/><p>Giant depressions appeared in the gates, and with this overbearing strike, the million Heaven Dou troops also roared, their voices becoming the motivation for the Strength and Defense Hall disciples. Quickly retreating, the third strike followed.</p><br/><p>One giant crack after another began to appear in the walls holding the gates. Even though the iron gates were thick and strong enough, that didn’t mean the walls were as strong. The giant iron gates were already starting to deform under the assault, and the surrounding walls were less and less able to withstand it.</p><br/><p>On top of the walls, Golden Crocodile Douluo’s eyes were already red. Of course he knew what the result of the gates being battered would be,</p><br/><p>“Bastards, attack, stop them! Block them even if you die!”</p><br/><p>His roar was doubtlessly aimed at the spirit master legion. After a series of disturbances, the spirit mater legion’s more than ten thousand spirit masters now also settled down.</p><br/><p>Even though the Hell White Tiger was formidable, in the end it faced a several tens of thousands strong spirit master army. The physical strength of spirit masters far surpassed that of ordinary people, and at the same time as it had killed several hundred enemies, the Hell White Tiger had also spent an enormous amount of strength. In panic, the Spirit Empire spirit masters unleashed a constant barrage of spirit abilities towards it, and the attacks were just too many. The Hell White Tiger’s remaining energy fell even faster than when it faced the fourth and fifth priests.</p><br/><p>Besieged by numerous spirit masters, even if each of the Hell White Tiger’s attacks could take the lives of several dozen spirit masters, by the light it radiated, its attacks wouldn’t be able to keep up for too long. The Spirit Empire spirit masters also managed to sober up, still pouring the majority of their attacks towards the Hell White Tiger, while a small number had their hands free and once again started attacking the Tang Sect teams below the wall. They also knew that breaking Jialing Pass definitely wouldn’t be so easy.</p><br/><p>“Boss Dai, retreat.”</p><br/><p>Ma Hongjun who was just keeping the six priest busy constantly launched dive attacks from the air. Because he was in midair, he saw the situation on the field the most clearly. Nobody on the Spirit Empire side spotted that slithering Jade Phosphorous Serpent Emperor, but he saw clearly. In particular the Spirit Empire spirit masters by Dai Mubai had already regrouped, the majority focusing their attacks on the Hell White Tiger. If this went on, no matter how strong Dai Mubai and Zhu Zhuqing were, they would still die from exhaustion. After all, they’d already eaten the Half Again Diamond Sausage, and there was no way to completely recover their spirit power again. Like ants can bite an elephant to death, those were after all legion scale spirit masters.</p><br/><p>Dai Mubai also knew they couldn’t continue. When he heard Ma Hongjun’s warning, the Hell White Tiger once again exhibited fearsome explosive strength, a massive white energy sweeping out in an instant. This time, more than a hundred spirit masters were blasted away by the explosion, halting the numerous spirit abilities targeting the Hell White Tiger. The Hell White Tiger also used this chance to leap out. Not into the battlefield of powers, but rather straight down from the walls. Their mission was already complete, and without much spirit power remaining, they had to retreat to safety to recover. While still in the air, the Hell White Tiger dispersed, again transforming into Dai Mubai and Zhu Zhuqing. Even though they looked exhausted, the excitement on their faces was still clear and easy to see. From the start of the battle until now, without a doubt, they had produced the most glorious accomplishments.</p><br/><p>Right now, on top of Jialing Pass, in the battle of powers the Heaven Dou Empire side had gained the advantage, relying on the support of Ning Fengzhi and his daughter Ning Rongrong below the walls to heavily injure another portion of the enemies. The Spirit Empire side now needed those rank eighty something spirit masters to fight at all costs to barely manage to block the attacks with the few priests and Title Douluo. But these Spirit Douluo were quickly losing numbers. Xiao Wu teleported among them like a ghost, using her formidable Soft Skill to grasp and take away their lives. With each less enemy, the resistance they faced naturally also reduced. It could be expected that the Heaven Dou Empire side’s powers at least wouldn’t lose this battle. After all, Xiao Wu, Ma Hongjun and Oscar still hadn’t used their Half Again Diamond Sausages. They could still at any time join the battle with their peak strength. Ning Rongrong who also possessed a Half Again Diamond Sausage shouldn’t have any trouble keeping up with the situation either.</p><br/><p>As the Hell White Tiger left the walls, the commander in charge Golden Crocodile Douluo also temporarily heaved a sigh of relief. Even though the Hell White Tiger had killed nearly a thousand spirit master legion spirit masters in this short time, the spirit masters on the walls were after all numerous. As long as they defended stably, even if the Heaven Dou Empire held the advantage in the battle between powers, they could still use the quantity of spirit masters to fortify Jialing Pass for a very long time yet. Now, under his orders, the archers inside the walls were already climbing to the top of the walls under cover of shield soldiers, taking positions and starting to rain down arrows below the walls. The ballistae were also manned, starting to shoot. The heavy infantry’s tower shields were completely unable to block the potent defensive weapons.</p><br/><p>But before Golden Crocodile Douluo had caught his breath, he suddenly saw a pale old man slowly stand up from the walls. The dark green robe, as well as that characteristic dark green hair, suddenly made Golden Crocodile Douluo’s heart sink.</p><br/><p>Of course he recognized this person, back when he’d travelled to Spirit Hall’s Douluo Palace to be conferred a Title, it was Golden Crocodile Douluo who officiated for him. If it was anywhere else, Golden Crocodile Douluo might not spare him a second glance, but this person, if it was on the battlefield, became the most terrifying existence. Dugu Bo.</p><br/><p>Dugu Bo seemed to sense Golden Crocodile Douluo looking at him, turning his head in that direction and grinning, revealing pale white teeth. Right now his complexion was sickly, pale as a sheet of paper, clearly looking spent. But Golden Crocodile Douluo understood well the reason this Poison Douluo hadn’t been seen in the battle until now, an ice cold chill instantly running down his arms and legs, his whole body trembling uncontrollably. His mind was blank.</p><br/><p>As if confirming his thoughts, Dugu Bo’s eyes suddenly turned green, his face filling with vicious pleasure, both hands simultaneously making a raising gesture.</p><br/><p>There was no rumbling or awe inspiring explosions. With Dugu Bo’s gesture, thick green gas began to rise from the walls. Besides where the powers of both sides were fighting, that green gas spread practically to every corner of the walls. It seemed rather strange.</p><br/><p>Just at the start, that gas was still extremely faint, and didn’t draw the attention of anyone on the Spirit Empire side. However, when the first scream began, an even more intense disturbance started than when the Hell White Tiger leapt into their midst.</p><br/><p>The first scream came from an archer. When he nocked an arrow, he suddenly discovered that his hand had at some point turned green, and an ice cold feeling instantly came from his heart. His scream erupted with extreme fear. The next moment, his whole body had become dark green, vomiting bloody fluid, then silently collapsing.</p><br/><p>It had to be said, while Dugu Bo’s Jade Phosphorous Serpent Emperor poison was terrifying, it didn’t cause all that much pain. When that ice cold feeling reached the brain, the poison was already attacking the heart, and would be fatal in less than three breaths.</p><br/><p>Of course, this was for ordinary people. Spirit masters had much stronger resistance than ordinary people, so they of course lasted a bit longer. But the difference was still counted in seconds. For spirit masters at rank seventy and below, each rank of spirit power could give them one second. As that dark green light invaded their whole bodies, they could only feel even more fear.</p><br/><p>Practically eighty percent of all the Spirit Empire spirit masters in Jialing Pass were on top of the walls. When that thick green fog covered the top of the walls, they discovered that their bodies had already started turning green. Some who had been injured in the earlier fighting died instantly from the poison, and even those with relatively high spirit power could clearly feel that ice cold breath spreading through their bodies.</p><br/><p>That basically wasn’t something that could be resisted with spirit power. The more they used their spirit power, the faster their blood flowed, and the sooner they died. The entire top of the Jialing Pass walls were filled with a verdant green luster.</p><br/><p>Don’t mention the Spirit Empire spirit masters who were inside, even the Heaven DOu Empire troops below the walls were shocked, their shouts quieting down.</p><br/><p>Xue Beng and marshal Ge Long shared a glance, both equally feeling deep fear. Xue Beng and his uncle prince Xue Xing were originally very close to Poison Douluo. However, after Xue Beng took the throne and came into contact with more and more powers, especially peak powers like Tang San and his father, he had somewhat come to neglect Poison Douluo’s existence. After all, Dugu Bo’s direct fighting power really wasn’t anything among Title Douluo, even now the Golden Iron Triangle’s Golden Saint Dragon could reliably defeat him.</p><br/><p>However, on a true battlefield, they now suddenly realized that, among all spirit masters, the ones that could truly be regarded as weapons of mass destruction really weren’t those rank ninety five and above Title Douluo powers, maybe not even king Lan Hao who was fighting the enemy god level power high in the sky, but rather the one that didn’t show a trace of himself in the last few battles, quietly hiding in the chaos, Poison Douluo.</p><br/><p>Finally at this critical juncture, Poison Douluo himself revealed his true strength, instilling absolutely nightmare level fear on the Spirit Empire.</p><br/><p>Actually, it wasn’t that Dugu Bo didn’t want to show his abilities in the earlier battles, it was really because the Spirit Empire was carefully targeting him, making his abilities unusable. In the Spirit Empire there were altogether two that could reliably counter him. One was Blowfish Douluo who he once fought and who completely suppressed him, and the other was even stronger, the Spirit Empire’s reigning empress, Bibi Dong. Bibi Dong’s twin spirits also had poison abilities, and Dugu Bo’s Jade Phosphor Serpent Emperor basically wasn’t the match of her two kinds of spider poison, especially Bibi Dong’s domain could suppress Dugu Bo to death.</p><br/><p>But on the current battlefield, Blowfish Douluo basically couldn’t step away to face him, and Bibi Dong had never even appeared, so Dugu Bo knew his chance had come, and he also acted carefully. The serpent form was the epitome of assassination, waiting motionless, then striking with full force in one movement. It was one of the most outstanding killers. At this moment, as the Jade Phosphor Serpent Emperor poison spread over the entire top of Jialing Pass, this battle had already shifted.</p><br/><p>Screams covered the top of Jialing Pass like a tidal wave. Those archers had just reached the top and still hadn’t loosed three volleys, but lost their lives without any suspense from this poison. The firepower pouring down below immediately came to a stop. Those ballistae suffered the same ending. The Spirit Empire spirit master legion was also already in chaos. As long as they were infected by a tiny bit of that poison, their bodies would be corroded from the toxin, basically without any chance of survival. Using their spirit power in panic would make the poison spread even faster. Amidst the screams, more and more spirit masters fell within the green mist.</p><br/><p>Some spirit masters immediately leapt off the walls after discovering what was going on. Want to run? Where to? No matter how fast they were, there was no way to be faster than the toxin that suddenly emerged after being hidden in the rock. As long as they were infected at all, they would immediately become poison carriers. When they ran down the walls, more often than not the poison had already struck their hearts, and their bodies became a poison source, mist spreading from them to cover the inside of the walls even faster.</p><br/><p>Confronted with this scene, even Dugu Bo himself couldn’t help feeling shocked. Even though he had the ability, this was still the first time he used it in such a large scale confrontation. Watching one previously vibrant life after another be lost to his poison, he also shivered somewhat. If this poison kept spreading, Jialing Pass might become a land of the dead even without the Heaven Dou Empire’s army attacking. The most frightening aspect of this Jade Phosphor Serpent Emperor poison was how it bred in blood, each corpse would be a new vector, creating more and more poison.</p><br/><p>When Dugu Bo acted, he only wanted to kill as many enemies as possible, and so put all his effort in spreading his poison over as large an area as possible. However, as tens of thousands died to this poison, and more and more people fled from the walls before dying, this poison was already beyond his control. Even he himself had no way of pulling back this much poison within him.</p><br/><p>This was a battlefield, and the war still continued. Nobody had yet noticed these problems. Without the threat of attacks from above, the four gates of Jialing Pass were struck time and time again. Soon, those five meter thick giant gates were already being hammered backwards, each attack making it shift a little further. Breaking the gates was only a matter of time.</p><br/><p>Golden Crocodile Douluo retched, vomiting out another mouthful of blood. Over, everything was over. When he saw Poison Douluo shoot him a smile, he knew this battle was already finished. Even if Qian Renxue could return now, it was still impossible to make up for such enormous losses. The Spirit Empire spirit master casualties caused by all the other Heaven Dou Empire powers combined wasn’t even a tenth of Dugu Bo’s. Even though those relatively higher level powers still struggled within the poison, their deaths were only a matter of time. As the number of corpses increased, the poison atop the walls was already growing thicker and thicker, this was a dead land! Even the powers of both sides were already starting to be influenced by the poison, having no choice but to project spirit power to block the toxic onslaught.</p><br/><p>Seeing that lush green area, Tang Hao also couldn’t help frowning, but Dugu Bo was doing it for victory, and he couldn’t easily say anything. But a faint feeling of unease still rose in his heart. Even if the Spirit Empire was the enemy, there was a massive military force amassed within the pass, at least half a million troops. To all die from poison like this really was unjust. However, Who could stop it from happening?</p><br/><p>Boom—— The four gates of Jialing Pass were finally forced open, but Xue Beng didn’t give the order to advance. At this moment, he basically had no way of giving the order. After the gates were opened, he could already see that green mist filling the inside of the fortress, he couldn’t let his soldiers charge into poison.</p><br/><p>Marshal Ge Long was worthy of a famed general, immediately taking action and passing down orders,</p><br/><p>“Order the archer legions, spirit master legion and the Tang Army to focus their attack on the gates. If any enemies sortie, immediately kill them at range, let none escape!”</p><br/><p>All he could do now was stop Dugu Bo’s poison from spreading towards the Heaven Dou army. Otherwise, this battle would have no winner. It would also become the deadliest battle in history.</p><br/><p>Just while the fighting sank into a strange atmosphere due to the poison, ten kilometers in the air, Tang San and Qian Renxue’s battle had reached a white hot intensity.</p><br/><p>Boom—— Scorching flame suddenly erupted like magma, uncountable flame arrows shooting towards that blue silhouette in the air. Qian Renxue had already become completely scarlet. In order to oppose Tang San, she faced the danger of at any time being erased by the True Sunfire overload to absorb the energy of the sun.</p><br/><p>Compared to Qian Renxue’s near crazed expression, Tang San was still calm, wielding the Seagod Trident to produce blue rings of light, constantly blocking Qian Renxue’s waves of attacks.</p><br/><p>Tang San was in no rush, he clearly knew that Qian Renxue was like someone quenching their thirst with poison, her offensive might seem incredibly severe, even forcing Tang San back in retreat, but in fact, her severe attacks might end at any moment from being unable to bear the True Sunfire, and even her survival couldn’t be guaranteed.</p><br/><p>As this went on, all Tang San did was defend, relying on the power he absorbed from the ocean to create an unbreakable guard. If Qian Renxue planned to pull him into death, Tang San would immediately rely on his divine sense being stronger than hers to escape a step in advance, not clashing with her head on, not giving her the chance to burn either jade nor common stone. He only gradually exhausted her divine power.</p><br/><p>Qian Renxue had already begun to feel powerless. Watching Tang San in divine raiment confront her, her thoughts grew even more brittle. In front of this man, she never truly held the advantage. He really was too clever and too sly. He didn’t even give her the chance to die together. Of course Qian Renxue understood what Tang San planned, he was going to keep exhausting her, never confronting her until she didn’t even have the chance to pull him into death.</p><br/><p>Even though the two fought ten kilometers up, with their divine senses they still clearly understood the situation on the battlefield below. Qian Renxue originally thought that as long as she stalled Tang San, by relying on their superior numbers of spirit masters, the Spirit Empire repelling the Heaven Dou army wouldn’t be any problem. However, she clearly perceived that it was her side that retreated step by step, and soon the Spirit Empire would be unable to resist.</p><br/><p>The more this was the case, the more anxious Qian Renxue felt, and the steadier Tang San was.</p><br/><p>The red light dwindled, and Qian Renxue’s attacks suddenly came to a stop. Coldly watching Tang San, she gasped for breath. It seemed she couldn’t endure it any longer. She’d always been the attacking side, and her divine abilities weren’t as good as Tang San’s either. She’d lost comprehensively. Tang San had relied on his stronger divine sense to always predict the next move, making her attacks unable to reach their greatest effect. Unfixed Storm could always appear at the right moment, dissolving her attacks.</p><br/><p>Moreover, Tang San’s recovery rate made his battle endurance even stronger than hers, and even his defensive power was higher. Qian Renxue basically could do nothing.</p><br/><p>Watching Qian Renxue panting from a distance, Tang San showed no intention of taking advantage and attacking, instead calmly floating in the air, breathing rhythmically, the Seagod Eight Wings on his back beating slowly, absorbing the energy of the ocean to restore him.</p><br/><p>“Qian Renxue, there’s no need for this. You should understand showing weakness to the enemy will never work on me. I wouldn’t be tricked. You still have enough strength to attack, no?”</p><br/><p>Tang San spoke softly, his all-knowing appearance nearly making Qian Renxue grind her silvery teeth down to nubs.</p><br/><p>“Tang San, don’t tell me you didn’t sense Poison Douluo’s attack? There’s more than five hundred thousand people within Jialing Pass, before long it will be a graveyard. As the root of it, don’t you fear the wrath of Heaven?”</p><br/><p>Tang San gave a gold laugh,</p><br/><p>“You don’t need to mention that to me, back when your Spirit Hall raided the Blue Lightning Tyrant Dragon Clan and exterminated the whole sect, did you consider the wrath of Heaven? When your Spirit Hall attacked my parents, did you consider the wrath of Heaven? The dying are the Spirit Empire’s people, how are they related to me? You should be the one to worry.”</p><br/><p>Qian Renxue snarled:</p><br/><p>“Tang San, I really misjudged you. Come! Come here, if you have the skill, kill me now.”</p><br/><p>Tang San frowned:</p><br/><p>“You’re trying to anger me even now? Fine, I will give you the chance, did you think I really was a fraid of your ‘dying together’ card?”</p><br/><p>While speaking, every piece of Tang San’s armor brightened, the blue light in the surroundings instantly pouring inside. The Seagod Raiment became completely transparent, including the Seagod Trident in his hand. Blurring, leaving a string of afterimages, Tang San pounced towards Qian Renxue.</p><br/><p>Even though he talked about not caring about the hundreds of thousands of lives in Jialing Pass, could he really ignore them? He didn’t fear the wrath of Heaven, but Tang San’s nature was kind hearted. Even though this was war, hundreds of thousands of people dying from poison, and it might even spread, this definitely wasn’t something he wanted to see. The outcome of this battle was actually already decided, he had no wish to see it become a graveyard.</p><br/><p>Qian Renxue’s expression chilled. By Tang San’s appearance she understood that he had condensed all the Seagod divine power onto himself. Even without using any ability, god level powers were the most terrifying in this state. His body was absolutely a deadly weapon, not something she could harm with ranged attacks.</p><br/><p>Red light equally condensed on Qian Renxue, her Angelic Raiment turning the color of ruby, holding the Sacred Angelic Sword at her side, light and shadow flashing, six wings beating, she charged straight at Tang San. The next fight was her last chance.</p><br/><p>Faint light flickered, Tang San’s face radiating ice cold divine light, the Seagod Trident in his hand chopping straight for Qian Renxue like it was separating heaven and earth. The next fight wasn’t flashy, all they could fight with was the most primal divine power.</p><br/><p>The Sacred Angelic Sword in Qian Renxue’s hand rose, slashing horizontally like lightning, the sword tip exploding with power the instant it touched the Seagod Trident, her whole body spinning in a circle, her left shoulder smashing into Tang San’s chest. At the same time, Tang San’s Seagod Trident was also deflected slightly, unable to hit her body.</p><br/><p>The Seagod Trident was a polearm, and her Sacred Angelic Sword a short weapon. Of course she would get as close to Tang San as possible, attacking inside his range.</p><br/><p>Confronted with Qian Renxue’s shoulder strike, Tang San didn’t dodge. He suddenly let the Seagod Trident slip in his hand, sliding his hand to hold the trident in the middle, using it like a sword to cut towards Qian Renxue’s neck with the main blade.</p><br/><p>Qian Renxue’s earlier attack was of course a bit faster, her left shoulder directly smashing Tang San’s stomach. Even though she didn’t think her attack would hit, as the God of Angels, her reflexes were incredibly fast, instantly raising her force to the limit. As long as her tackle hit, Tang San’s Seagod Trident basically wasn’t a threat. He would be knocked away, and what could that trident do then?</p><br/><p>However, the instant Qian Renxue’s shoulder struck Tang San, she suddenly felt something was wrong. Tang San was clearly hit, but the armor on his chest suddenly pulled back, like he was sucking in his belly, reducing the effect of her strike by at least half. The next moment, the rhombic gem on his chest plate suddenly flared, and his whole body bent like a bow and then snapped back, his chest striking in reverse, smashing into Qian Renxue’s shoulder.</p><br/><p>Tang San’s two lives’ worth of experience really was richer than Qian Renxue. She was after all a girl, she’d never thought about using her chest muscles as a weapon. With an explosive sound, a red halo appearing around Tang San, and a blue maelstrom around Qian Renxue. Both their divine power simultaneously invaded the enemy, none coming off easy.</p><br/><p>If it was just the collision, then this strike would be a tie. Even though Qian Renxue’s shoulder tackle had charged force, ingeniously dissolved by Tang San it couldn’t show its full effect, and the force Tang San could exert with his chest was also limited, the attacker and defender naturally weren’t much different. However, don’t forget that Tang San was still swinging the trident.</p><br/><p>Tang San’s chest counter was naturally within his own plans, but even though Qian Renxue cut with the Sacred Angelic Sword, it was just in order to make her attack knock Tang San away. With her plan deficient, Qian Renxue now looked to be eating a major loss.</p><br/><p>Qian Renxue reacted very quickly. Discovering the situation, she immediately spun, three of the feathered wings on her back extending like sharp blades towards Tang San’s Seagod Trident, trying to use the power of the Angelic Wings to give her a chance to catch her breath. However, even though the Angelic Wings could be used for defense, they were more for condensing divine power. Moreover, Tang San came from the Tang Sect, his wrist strength application really was too powerful.</p><br/><p>With a few dextrous motions from Tang San’s fingers, the Seagod Trident flashed, the main blade sweeping past Qian Renxue’s wings, stabbing from below at the root of the Angelic Wings. Despite Qian Renxue’s quick movements, at this time, a stream of pure Seagod’s power also stabbed into her body. And at the same time, the Seagod Trident pulled back, the barbs on the side blades raking across Qian Renxue’s waist. Where they passed, red sparks flew, instantly cutting a large hole in the Angelic Raiment’s waist armor.</p><br/><p>Whether the Angelic Raiment or the Seagod Raiment, their defensive strength was insurmountable for ordinary spirit masters. But for Tang San and Qian Renxue, their attacks could forcefully overcome it. If each divine weapon really hit the opponent directly, their divine raiment could only give a measure of protection, and not truly block the attack.</p><br/><p>With a cruel sound, Qian Renxue quickly spun, tumbling away, golden red blood spraying from the base of her wings, turning to mist in the air.</p><br/><p>The lower pair of Qian Renxue’s six wings were clearly slower, and the Seagod’s power she endured both from within and outside was clearly more intense than the True Sunfire Tang San endured. Pain spread through her whole body, making her spasm violently.</p><br/><p>Since Tang San had decided to act, he would go all out. He had to finish Qian Renxue as soon as possible to control the situation before the Jade Phosphorous Serpent Emperor poison completely erupted.</p><br/><p>Humph—— Tang San issued a cold snort, his whole body shook once, the Seagod’s power within him completely erupting, forcibly dissolving the True Sunfire. Even though Qian Renxue did the same, she was one beat slower than Tang San.</p><br/><p>The Seagod trident swung, a massive blue wheel of light appearing around Tang San. THat wasn’t a Seagod power attack, but rather the Seagod Trident itself, as the main blade shone with light as Tang San swung it. This move was the tenth of the Golden Thirteen Halberds, named: Ocean’s Sun.</p><br/><p>Qian Renxue roared, biting down on the tip of her tongue, spitting out a mouthful of blood on her Sacred Angelic Sword. Her whole body seemed to subsequently expand somewhat. With an explosive sound, in just this instant, her Angelic Raiment unexpectedly completely shattered, sweeping out as a giant flame. The power of True Sunfire unleashed by the Angelic Raiment shattering condensed into a giant angel silhouette in the air, the terrifying energy even turning the surrounding space black, the scene of space being cut open!</p><br/><p>This was an attack Qian Renxue had charged up strength for for a long time, and also her utmost attack. All her Angelic divine power was completely condensed into that shattered Angelic Raiment.</p><br/>\n</div>"}