{"title": "Chapter 8", "id": 8, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-8", "volume_title": "Volume 1", "body": "<h1>Chapter 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Although still in tenth grade, the school had already begun their nighttime self-revision session for the students. No wonder they managed to produce so many top scholars in the provincial college entrance examinations. Evidently, the school maintained a tight grasp over every aspect of the students’ lives.</p><br/><p>Parents also felt more at ease to have sent their children to this senior high school. Zhao Youyue’s father, Zhao Jiayi was one of these parents. He did not believe in the myth that elite private high schools are better off than regular schools, whereas he had thought the ethos in those private schools was undesirable. In comparison, this kind of provincial key high school which emphasized strongly on learning culture and exercised strict school rules seemed more preferable.</p><br/><p>Normally, the homework is to be collected ten minutes before the end of class during night-revisions. The subject representatives will hand in the collected homework to the respective teachers of each subject during the following morning reading session.</p><br/><p>Zhao Youyue did not attend the nighttime self-revision sessions. This was one of her privileges as a commuting student. It would have already been close to ten o’clock at night after the three night-revision lessons ended. As such, it would be unsafe for commuting students to go home at this hour. Based on this matter, the school merely encouraged voluntary participation upon commuting students. Hmm, most of them had no choice but to volunteer anyway…</p><br/><p>In truth, however, Zhao Youyue will not have any safety concerns of such nature. Though she did not go as far as to have bodyguards around, she did enjoy the benefits of being chauffeur-driven. How could there possibly be any safety threat?</p><br/><p>Zhao Youyue still chose not to attend the night classes. She felt that completing her homework at home was basically the same thing… Okay, truth is she merely wanted to slack off. Completing her homework at home meant she can play with her cellphone at the same time. If she heard her mother’s footstep approaching from outside the door, she will immediately hide her cellphone away and pretend to be intensely focused on her homework. Furthermore, when she encountered questions that she was unable to solve, she would not even bother to come up with the solutions. Instead, she will just give in to the temptation and look for the answers on the internet straight away.</p><br/><p>Yes, this is Zhao Youyue in real life. Obviously she was satisfied to muddle along when it comes to learning. There were a few other commuting students in the class, yet she was the only one to use safety concern as a reason for not attending night-revision classes… Ironically this gave her a fair amount of sense of presence. Everyone had an additional recognition of her character – slick.</p><br/><p>As a result, representatives of each subject can only collect her homework during the morning reading session. After all she was not present during the nighttime self-revision classes.</p><br/><p>The representative who came to collect Zhao Youyue’s homework at this moment was the representative for the subject of Mathematics named Chen Haoran. It would appear that he had scored full marks in Mathematics during the entrance examination for senior high and for the latest round of pre-test as well. He also managed to get first prize for Mathematics competition when he was still in junior high. He was then rightfully selected as the subject representative by the Mathematics teacher, Gu Yaoyan. He was the teacher’s pet. If the other students were unable to answer questions in the Q&amp;A session during Mathematics lesson, Gu Yaoyan will have Chen Haoran step up to finalize the session because he will never let the teacher down.</p><br/><p>Zhao Youyue handed in her Mathematics lesson materials to the slightly chubby Chen Haoran who was wearing a pair of black-framed spectacles. He felt impressed when he looked through her materials with graceful handwriting and neat pages. He cannot help but commented, “You are actually pretty good. The last question here has in fact stumped the students in class for a long time. It was only solved after much discussion. I did not expect you to be able to solve it on your own.”</p><br/><p>Surrounding classmates overheard the conversation as Chen Haoran spoke rather loudly. Somebody then whispered, “Good my ass. If I had a cellphone with me, I could’ve easily solved the question as well.”</p><br/><p>In fact, most students already owned cellphones nowadays. However, most of them only dared to keep their phones within the dormitories. None of them dared to bring their cellphone to class, fearing that their phones might ring midway during lessons. Even if it only vibrates, there was still a risk of being caught. It would be such a shame if it was confiscated by the teacher. One would expect that the parents will be summoned to school in such cases. The sadistic thing about this school was that the wall sockets in the dormitories were only decorations and there was no electricity supplied. Thus, most boarding students could only charge their phones once a week or have the commuting students bring their phones back home to charge.</p><br/><p>After hearing the others’ comments, Chen Haoran had a sudden realization. He scratched his head and awkwardly muttered, “Sorry.”</p><br/><p>He genuinely did not think of cellphones as being able to help with homework. He also had his own cellphone but his parents barred him from bringing it to school. They feared that it might lead to early romance and his studies might be affected negatively. He had to use the public phones to call home each time.</p><br/><p>Chen Haoran actually intended to ingratiate himself with Zhao Youyue just now. One might find it hard to believe, but he thought the prettiest girl in this class was Zhao Youyue. She had a very nice complexion, her skin was fair and tender and there was not a sign of acne. As she spoke, her voice was especially gentle and soothing. Her bobbed hair was also very adorable. For some seemingly unknown reasons, she was always being neglected and was not accorded any sense of presence.</p><br/><p>Chen Haoran was a boarding student. His home was located in a farming village to the south of the provincial city. Since young, he had learnt to be assiduous. He was especially weak in arts subjects, but still, his level of mastery was more than sufficient to enter this school. Well, for Zhao Yaoyue to be granted entry on the other hand, tens of thousands had to be donated to the school for school construction. Not to mention, the higher-ups in the school had to be treated meals.</p><br/><p>After lights-out at the male dormitory, there will always be all sorts of empty chatter. School has just reopened and the teacher in charge of the class rarely conducted dorm room spot checks. This was the reason why everyone was unusually happily chatting the night away. Because of this, the following morning reading session will usually be used to catch up on sleep.</p><br/><p>The subject of the boys’ chatter will inevitably shift towards the female classmates. Terms that appear a lot in novels like “prettiest girl in the class” or “prettiest girl in the school” were in fact seldom mentioned in real life. It was as if these terms were indescribably associated with being pretentious or delusional [1]. However if a girl’s name came up a lot in boys’ discussions, she could already be considered the de facto prettiest girl in the class.</p><br/><p>Obviously, Zhao Youyue was never mentioned. As members of Chen Haoran’s dormitory discussed about the pretty girls in class, Jiang Qing, the arts and literature committee member was mentioned the most. She had a cheerful and easy-going personality and a face that always carried a smile. Once during military training, she even performed solo in a song that was the most popular hit at that time. That left a very strong impression among the boys. But of course, the most important factor may have been that she had really big breasts… Nevertheless, Chen Haoran felt that Jiang Qing was not as beautiful as Zhao Youyue.</p><br/><p>The military training was held a week before the school started. It was also on a “voluntary” basis. Zhao Youyue did not participate as she was on vacation abroad. In truth, even if she had not gone on a vacation, she would not participate. She could not handle the agony of having to perform military training on such a hot day.</p><br/><p>“It’s alright.” Zhao Youyue said nonchalantly while smiling.</p><br/><p>Carrying Zhao Youyue’s homework, Chen Haoran returned to his seat. He felt that Zhao Youyue was very attractive when she smiled earlier on.</p><br/><p>After passing up her homework, Zhao Youyue was overcome with boredom. Classmates around her had mostly started their morning reading. Her desk mate Zhou Fang, for example, was already deeply engrossed in reading even though Qiu Yingchun, the class teacher cum language teacher has yet to arrive.</p><br/><p>Since the teacher was not yet here, why start morning reading already? Isn’t that such a waste?</p><br/><p>That is right, Zhao Youyue is the kind of student that will only put up an appearance of being hardworking in front of the teacher. It had to be said, this was very much in line with the majority. As in the schooling days, there will be quite a number of students who has exactly the same characteristics as her.</p><br/><p>Zhao Youyue took out her cellphone sneakily, ready to surf Qidian manga website to enjoy the web-based manga “Pure Romance”. While she was at it, she planned to tip the mangaka another Sect Master so that she can establish a relationship with the mangaka. Well, she had plenty of money anyway.</p><br/><p>However, after only a little while of browsing the manga website, the class teacher Qiu Yingchun unexpectedly entered the classroom from the back door stealthily. The sound of the students’ reading also concealed his footsteps. He caught Zhao Youyue who was reading manga on her cellphone red-handed. Her cellphone was then confiscated on the spot.</p><br/><p>For once, Zhao Youyue received the one thing that she had yearned desperately – the entire class’ attention. Her sense of presence surged, but she felt extremely embarrassed… Meanwhile, she remembered that the Fruit Phone seemed to have launched its eighth generation. This will be the perfect time for her to change to a new phone. Yes, this is exactly the characteristic of a stereotypical fair, rich and beautiful girl.</p><br/><p>Translation note:</p><br/><p>[1] Original text “”. Literally translated to “eighth grader shame”. This is a popular internet slang/insult originating from Japan (the abbreviated form “” is more widely used). It is used to describe the delusional, childish, pretentious and know-it-all attitude of teenagers in their adolescent age.</p>\n</div>"}