{"title": "Chapter 17", "id": 17, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-17", "volume_title": "Volume 1", "body": "<h1>Chapter 17</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At least, Zhao Youyue had taken a load off her mind. The question now is whether Han Leng’s works could meet her expectations.</p><br/><p>Anyway in Zhao Youyue’s impression, Han Leng was pretty much gifted in writing, and was also not the type who will load his writings with fancy phrases. Perhaps he had done a lot of readings, therefore, his thoughts had developed a certain depth, and was far beyond the other senior high students.</p><br/><p>On second thought however, does it require some sort of writing talent to write something like a remorse letter? Essentially, its purpose was none other than conveying one’s sincere apology. She was then afraid Han Leng will swank about his genius and come up with a baffling remorse letter that will darken the face of class teacher, Mr Qiu.</p><br/><p>In any case, Zhao Youyue still find Han Leng more trustworthy, as this guy was famous for his writings since junior high. Han Leng had even composed a full-length novel, comprised of 10,000 words based on some online games he played. At that time, quite a number of his readers were his classmates, including his deskmate, and these people would often urge him to update the novel. Thus, she was deeply impressed by Han Leng in such a way.</p><br/><p>This fellow was indeed smart, despite spending so much time on literary writings, his results were not bad at all, albeit inconsistent. Sometimes, he could make it to the top three in his class; but sometimes, he was not even amongst the top thirty, and that made him worse than Zhao Youyue who had always remained steadily in the middle ranks.</p><br/><p>It had never come to Zhao Youyue’s mind that, a guy as arrogant as Han Leng, who was extremely unfriendly would turn out to be a miser. It was told that he had a webnovel under serialization at the Qidian novel website, which gave him a royalty of 50 RMB per 1000 words. Well, if that was true, he will definitely be considered as quite a man.</p><br/><p>The guy who sat in front of Zhao Youyue, Wang Yang, was a veteran webnovels reader, as well as a fans group member of a Platinum-rank author in historical writing, “Unripe Apple”. In the Qidian history section, if Unripe Apple was not the big brother [1], he was somewhat one of the best authors out there. At least, he owns a prominent fans group with the stated name “Green Alliance”, yet his nickname was daringly a member of the “Vegetables and Fruits”. Of course, one could easily tell that he was not a small potato. Zhao Youyue was the kind of person who hardly ever reads webnovels, but she still recognised these expert web novelists, such as “Silkworm Potato”, “I Eat Tomatoes”, and “Angry Banana”.</p><br/><p>To think there is something called “Silkworm Potato” in this world… Hmm, it seems that he had not started writing “Fight Break Spheres”, his novel that is supposed to bring him fame and intimidate the entire world, or else, Zhao Youyue might have a chance for some troublemaking in the novel “Fight Break Spheres”.</p><br/><p>Meanwhile, all the “Green Alliance” fans group members had unanimously set their QQ avatar to a plain green picture. Well, they seemed pretty much disciplined. Whenever Green Alliance appeared in the book comments section, a sea of greens would come into sight.</p><br/><p>As a member of the “Green Alliance” fans group, Wang Yang definitely knew about all the tittle-tattles within the webnovel circle, unlike the rest who knew nothing about the concept of an “average subscription[3]”.</p><br/><p>By earning royalty as much as 50 bucks per thousand words, and of writing in the webnovel field, Han Leng is considered an iconic author on Qidian, who is supposed to have an average subscription of 3,000. That is slightly more than that of I’m the Best, the author of “King of Superpower”. But his total income was no match for I’m the Best, as Han Leng was still in senior high and did not have sufficient time for updates. As such, he was one of the most despicable author in the eyes of readers, so-called the”One update gang[4]”, of which each update has only 2,000 words and produces a royalty of 100 RMB, but now, writing a remorse letter of 3,000 words for Zhao Youyue had earned him 500 RMB instead. Indeed, this is a great deal, and had thus promised Zhao Youyue with no hesitation.</p><br/><p>At this moment, Zhao Youyue was pretty much intrigued by Han Leng’s novel. Perhaps… could there be a chance for her to stir up some troubles in this novel written by her old classmate? After all, the Two Dimensional Gate was pretty random and unpredictable.</p><br/><p>That sounds amusing!</p><br/><p>Before the end of the activity class, Zhao Youyue had decided to “leave early” [2]. As to her, some of her classmates were back in their dorms to take a bath or to play mobile games, it is thus quite palatable for her to go home, isn’t it? Well, knowing in a sense that her own house is her dorm anyway. She then phoned up Mr. Liu and requested him to pick her up.</p><br/><p>For sure the school gate security, Grandpa Qin, who had always hindered students from leaving early, would not let her pass through that easily. Nevertheless, Zhao Youyue’s very own driver, Liu Zhongcheng had stuffed some money in Grandpa Qin’s pocket. Whenever Uncle Qin saw the limousine outside the school gate, he then turned a blind eye and let her go off.</p><br/><p>“Thank you, Grandpa Qin.” Zhao Youyue thanked him politely, with a sweet smile and a mild tone. As for now, Grandpa Qin was looking upon this missy with a pair of new eyes. Having been the gate security for so many years, he, without doubt, had come across many students from richer families. Most of them were rather high and mighty and did not bother to look upon the eyes of others, unlike this missy, who does not carry a shred of haughtiness, and is fairly amiable.</p><br/><p>Zhao Youyue succeeded in leaving early. Soon after entering the car, she started drinking her favorite red bean milk tea. Mmm, so delicious! Meanwhile, she did not forget to express her gratitude to her driver Uncle Liu.</p><br/><p>She had been carrying out these manners in a rather instinctive way, not deliberately without any doubts. Besides, not a slight bit of unpretentiousness was seen in her at all. Well, who does not love to be respected? Not to mention, to be respected by a missy with a decent family background like Zhao Youyue, that is indeed hard to come by.</p><br/><p>…</p><br/><p>After Zhao Youyue left the school, Han Leng was also back to his dorm. As he was too used to typing on the phone, his typing speed was much faster than writing on paper.</p><br/><p>He had always been abided by a perspective that the value of written words, not only depend on whether they could enlighten the readers, but more importantly, they must be able to earn him some income. Should they generate more money for him, he would eventually put more effort in his writings!</p><br/><p>Nevertheless, his most devout words would still appear in his private diary, or in some his proses and poetry. To him, besides bustling around from day to day, one should not forget about the pursuance of literature and one’s future in life.</p><br/><p>During his rebellion period, he once dreamed of becoming a wandering poet, who is to seek the true meaning of life and will never betray his writings for money. After leaving home and starving for a day, he came to a realization, that money is such a wonderful thing in life!</p><br/><p>Whoever gives him money, he will write anything that person wants!</p><br/><p>Oh, so… webnovels are popular now?</p><br/><p>Then I’ll write that!</p><br/><p>Damn it, I’m so talented in writing, to think that the Qidian editors didn’t sign me up, are they all rubbish or what?</p><br/><p>The mighty I was even once the champion of a creative writing competition!</p><br/><p>What? The opening has to follow the rules of the “three golden chapters” on Qidian? The main character cannot be beaten in the plot? No cuckold story is allowed as that is too malignant? Any story involving phase shifting has to specify the gender clearly else it is considered a failure?</p><br/><p>Well well, as long as the readers like it!</p><br/><p>Step by step like this, Han Leng gained a little fame on the Qidian novel website, and gathered a group of loyal fans, and yet, he felt that his principles and integrities had been buried. As for now, all he could do was to hang a sullen face; frowning, acting as if he seemed to be a cool scholar. Anyway, he suddenly regretted for spilling the beans that he had been writing webnovels, and hoped that Zhao Youyue would not put that in mind.</p><br/><p>In the meantime, he felt that even his impressions was shattered in front of Zhao Youyue… it’s not a total loss this time! During their defeat in the team battles of “League of Legends”, he always comforted his teammates in such a way, “Don’t fret guys. It is not a total loss this time!”. But still, their base would be destroyed in an explosion right after that, and thus…</p><br/><p>Teammate 1, “Not loss? Should I call you son of the b*tch?”</p><br/><p>Teammate 2, “I really want to see you suffer a big loss before I die!”</p><br/><p>Teammate 3, “?”</p><br/><p>Teammate 4, ” …”</p><br/><p>Translation Note:</p><br/><p>[1] Chinese calls the leader in a team, or most skillful and prominent person in a particular field as “Big brother” – “”, which literally means No.1 person.</p><br/><p>[2] In Chinese, “Leave early” – “” means that one leaves earlier a place or event than the time that he/she is supposed to.</p><br/><p>[3] “Average subscription” – “” is a contemporary word used on novel websites such as Qidian to describe the average number of subscriptions obtained by a novel per month. The higher the average subscription, the higher the royalty (calculated in RMB per 1000 words) for a novel.</p><br/><p>[4] “One update gang” – “” literally means the gang of people who only update once, at here, it refers to the authors who only update their novel once in a long while.</p>\n</div>"}