{"title": "Chapter 12", "id": 12, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-12", "volume_title": "Volume 1", "body": "<h1>Chapter 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After Su Li regained focus, she said, “I’ll admit, the things you said make sense. This side character is indeed different from other female characters. But she is, after all, a side character. I will not mix up the main and side characters. Besides, you almost tricked me into buying your ideas. My manga “Pure Romance” is inherently a school harem manga – what the readers want to see are the interactions between male and female characters and the scenes where the female characters flaunt their flesh. It’s not about they’re learning or anything like that! Speaking of which, these days men seem to prefer aggressive and self-initiating “foxy ladies”, don’t they?”</p><br/><p>Upon hearing such a feedback, Zhang Ziqiang appeared slightly disappointed. He felt that the interactions between male and female characters and the flesh flaunting scenes seemed rather pointless. He hoped that “Xu Jing” could be promoted and then, more interesting plot developments will come into sight. Too bad Su Li insisted upon her own opinions.</p><br/><p>Feeling disappointed, he was also impressed at the same time because this is the kind of attitude that a career mangaka is supposed to have. Currently the most popular female character in “Pure Romance” is still the hero’s sister Yang Xixi. Everyone had gotten used to the style of this manga, to abruptly make changes would be akin to messing about.</p><br/><p>This is comparable to a web novel where the authors have always followed a fixed pattern when carrying out their writings and the feedbacks obtained were pretty much decent. But then one day he decided to break away from this routine and try something new, in order to write something that is beyond the readers’ expectations. As a result, he went overboard and ended up achieving the opposite…</p><br/><p>There was once a saying “Since ancient time, true love has never kept anyone around; only tried and tested routines could win hearts” means exactly this. Sometimes the author might self-perceive themselves to have written a very sincere plot. However, if the readers do not fancy the plot, it will be a waste of efforts.</p><br/><p>“In that case shall we cut down the number of appearances for ‘Xu Jing’ so that she will be slowly fade away?” Zhang Ziqiang asked.</p><br/><p>Unexpectedly, Su Li smiled gently and said, “Not necessary. On the contrary I will gradually increase her parts, turning her from a side-character to a supporting character first.”</p><br/><p>“Why?” Zhang Ziqiang is pleasantly surprised.</p><br/><p>“Well, I was persuaded by you and realized that this character is rather interesting now. Let’s give her a higher visibility and then gauge the readers’ reaction. The fact that we find her interesting doesn’t necessarily mean that the readers will feel the same. Our emphasis should always be placed on the female characters most favored by the readers.” Su Li answered with great confidence.</p><br/><p>“You are truly Master Su Li. I’ve really learnt something from you this time as your apprentice. It is no wonder your first serial manga is already able to accomplish such a strong following.” Zhang Ziqiang exclaimed.</p><br/><p>Su Li did not continue with her humblebrag. She smiled briefly and then resumed focus on her creative works. It is uncertain whether this is purely her misperception, but she felt that when she was drawing the character of “Xu Jing”, she was able to “draw with godly power”. It was as if this character has her own soul and will, that Su Li was completely unable to dictate the character’s actions.</p><br/><p>However, she did not feel surprised. In fact, this reminded her of many authors when they were discussing the fate of one of the characters in their works, especially the tragical ones. The readers strongly requested to change the endings so that the characters can be less tragic in a way. Nevertheless, those authors will pretentiously tell the readers that changes cannot possibly be done, as this character in my work has gone out of my control, she has her own will and soul and is fated to be a tragedy!</p><br/><p>Su Li had always felt that this is merely the act of shifting, blamed by some authors who inclined to induce depression among readers. In a sense, an author is the creator of a certain world in which every character is his marionette. So, how could it be possible that the endings are unchangeable?</p><br/><p>Anyway, in the process of her own creative works, Su Li suddenly understood that she does not wish to bend the original wills of a certain character. Instead she intended to let the character self-animate, perhaps like in those manga-s where the characters are drawn exceptionally well. Well, those are the typical examples of how the author includes characters to drive the plot forward, aren’t they?</p><br/><p>Unfortunately, Su Li only felt this sensation when drawing the character of “Xu Jing”. It still felt pretty dry and dull when drawing other characters. Comparing between the two, she thought that spending more ink and effort on “Xu Jing” was actually the right thing to do. However in the end she still suppressed this desire, for she did not know whether the readers will like it or not.</p><br/><p>…</p><br/><p>As a person who messed about stealthily, Zhao Youyue was unaware that she has received the author’s admiration. Err.. well.. This is not much of a good news as for now Zhao Youyue felt that it is still pretty cool to be able to learn peacefully within the Dimensional Gate. This could compensate her laziness in real life. If she was really favored by the author, she will surely have to cross path and interact frequently with the other main characters in the story. Isn’t this a waste of her precious learning hours?</p><br/><p>At the same time, Zhao Youyue was also seeking for more information about the Dimensional Gate. She learnt that it was not a coincidence that her cell phone was being confiscated and that she was called out during class – it was all part of the negative consequences that she carelessly misdemeanor earlier on. Well, this is a mystical way of saying that she had actually exhausted her lucks… This lesson has made her more cautious when using the Dimensional Gate. She would never ruin an author’s painstaking labor in a reckless way again.</p><br/><p>Anyhow, Zhao Youyue also figured out a way to exit the world of a manga-s, games or novels.</p><br/><p>Obviously, the first method is to perform what she did in the past, which is to recklessly define a side-character and morph into a terrifying super villain. Then, wipe out the main characters and completely spoil the balance of the entire work, crashing it in the process. However, this will result in a reduction of her luck in real life as she will be plagued by unfortunate events. The higher the popularity of the work she wrecked, the higher the criticality of the consequences she would get.</p><br/><p>The second way to exit, had meant that the character she shifted into has to die. It is still fine if a side character died privately as this will not bring about any negative effects to the overall work. Correspondingly, she will not suffer any bad luck in real life. Well, of course, apart from wasting another precious opportunity to enter the Dimensional Gate.</p><br/><p>On the other hand, if she shifted into a main female character and then die by implying some inexplicable ways, the effect will take place like method one. Thus, even for a female main character to die like this, it definitely has to be a “death by plot”, and not some nonsensical ways like tripping over and falling into water to drown, or choked on water to death while drinking. If this “death by plot” had garnered the readers’ unwillingness and exclaimed impressions, it will definitely be a plus point.</p><br/><p>The third method, is when the character that Zhao Youyue shifted into already possessed superb popularity —— she will then have the option to leave the world of the character she played. Well, this is the ability that she will gain after receiving the willpower of her fellow readers.</p><br/><p>In other words, once she has become an iconic character in the eyes of the readers, she will be able to bow out. However, the author might eliminate this iconic character when subsequent renditions occur in this character. One example is Wu Di, the female main character of “Shift! The Female Elite Scholar”. During the earlier periods, she enjoyed great popularity and was regarded an icon. However, the character was completely wrecked by the author later on and then, the abilities that Wu Di retained were correspondingly lost.</p><br/><p>Nevertheless, the most perfect method is to allow a character to die during her most glorious moment and of course at the pinnacle of her popularity! At the same time this will guarantee that the author will not suddenly revive the character in real life and mess up the character’s image…</p><br/><p>The fourth method is for the work to end normally (For effects of a bizarre ending, do refer to method one). Yeah, she will now be able to bow out. With this condition, a character could avert the tragedy that falls upon themselves. Well, ending the storyline at her tip-top popularity moments means that she does not need to meticulously plan for her own death.</p>\n</div>"}