{"title": "Chapter 10", "id": 10, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-10", "volume_title": "Volume 1", "body": "<h1>Chapter 10</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>All the students in class had pictured a scene, that this adorkable girl, who was caught by the teacher on spot for being in a gaze, was standing dumbfounded in front of the class… But even so, they would not snigger at her, instead, they would only sympathize this lovely girl with bobbed hair. Well, her phone had been confiscated during the morning class, and now in Mathematics class, she was picked on by Mr. Gu. If others were inflicted with such misfortunes, perhaps they would have blown to pieces!</p><br/><p>Ah, it was undeniable that bad luck always comes after one another.</p><br/><p>Never had anyone thought that, this girl was able to breeze through this question, which was rather tough. Moreover, her explanations was spectacularly clear and understandable for everyone.</p><br/><p>Sure enough, many classmates were impressed by Zhao Youyue. They inexplicably felt that she was indeed a steady girl. Well, she seemed pretty calm and reliable in everything she did. Meanwhile, her voice and her smile were quite endearing too.</p><br/><p>Gu Yaoyan was also startled for a while. It had never came to mind that Zhao Youyue could easily solve this question, despite being absent-minded in class. Not to mention, she had not done any corrections for her mistakes in the pre-test paper. Hmm, there is only one truth to think of, either this girl had put a lot of effort in her studies at home, or she must be equipped with a dashing wit.</p><br/><p>Anyway, Zhao Youyue had solved the question, so she deserved a compliment. Gu Yaoyan praised her, “Very well explained, Zhao Youyue. But in future, please pay full attention in class.”</p><br/><p>Nodding her head vigorously, Zhao Youyue looked very sincere, and thus, Gu Yaoyan was satisfied, and allowed her to return to her seat.</p><br/><p>…</p><br/><p>Just when Zhao Youyue was undergoing her regular schooling days, within a manga studio situated in Jiangnan Province, there were two painters working hard at their own desks.</p><br/><p>They were Su Li, the mangaka of school harem manga “Pure Romance”, and her assistant, Zhang Ziqiang.</p><br/><p>Little did the readers of “Pure Romance” know that, this school harem manga which gained its fame via its erotic scenes, was actually the artwork of a female mangaka.</p><br/><p>Su Li had an average appearance. But, if she dressed herself up, she was actually a beautiful mangaka. Back in her university days with no manga writings, she had gained a number of admirers. Perhaps it was entirely unbelievable to many that, during those days, Su Li had started indulging herself in drawing Ero Doujinshi books. Her pen name, “Wang Li” was well known in the Doujinshi circle. By drawing those books, she had made quite a lot of money.</p><br/><p>Human are always in pursuance of self improvement. Upon graduating from varsity, Su Li had made up her mind to be a true mangaka. That being said, she did not forgo her passion in drawing Doujinshi. Of course, she would still participate in “Sacred War”, a world class manga exhibitions held annually in summer and winter, as she could continue selling her Doujinshi mangas there to earn more income.</p><br/><p>Her reputation in the Doujinshi circle, had prompted her to gain the invitation of “Wind Manga”, a manga magazine. She first released several short mangas as trials, which had received quite a good feedback from the readers. As a consequence, she had earned the opportunity to collaborate with Qidian, while attaining full rights to the serialization. She would have the freedom to serialize her mangas on both the internet and in magazines. In this way, not only she was able to earn royalties from the magazine, but she could instantly obtain subscriptions and tips from the readers, albeit only a quarter of the whole amount.</p><br/><p>Anyway, Su Li was always glad to interact with her readers on internet, and had built a fans groups of her own. At times, she noticed some readers in the group pointing out that her drawing style was close to the ones of “Master Wang Li”. At that moment, her heart would be infused with apprehension, fearing that her carefully-concealed identity in Doujinshi circle would be unfolded. She might have been acting as a new and innocent mangaka, but the mellowed erotic scenes in “Pure Romance” had always aroused ridicules from the readers — How could Master Su Li be so expert in this!</p><br/><p>The online readers were able to give immediate feedbacks on mangaka’s work, and then, the mangaka could figure out the upcoming plot based on their opinions. As for her school harem manga, she would first observe which female characters were more popular among the readers. Then, Zhao Youyue would present them with more plots, as well as some preferential treatments.</p><br/><p>Su Li had a personal editor, who instead of giving her opinions on plots, preferred to contribute ideas of various erotic scenes…</p><br/><p>In fact, Su Li was not really satisfied with her “Pure Romance”. To her, there was little difference between this manga and her past Doujinshi works, except that Doujinshi contains more erotic scenes. Well.. that even included the scenes of making love. In comparison, this manga did not feature any erotic scenes, not to mention any scenes showing the women’s nipples. Besides, all the “critical” moments were censored. That being said, the underlying sexual hints were still obvious enough, that the male readers could have a sustained erection while reading them!</p><br/><p>Su Li was weak in her plot description and character molding. The characters that she had created were lack of distinctive facial features. Earlier on, she aimed to overcome her weaknesses by writing an ordinary manga, but obviously, “Pure Romance” did not help her to accomplish such a goal.</p><br/><p>However, Su Li had no choice but to keep on writing. This manga was quite popular, especially among the male readers. Additionally her royalties were also pretty good, at least for now, she could confidently address herself as a “mangaka”.</p><br/><p>At the same time, she was aware that the popularity of a school harem manga like this, would not go any further, let alone being elevated to an anime. Perhaps, it was already a miracle if it could be rearranged into a broadcasting play. Such a manga would usually be forgotten after it was finished. Well, it was lacking of its own uniqueness, and of course, it could easily be replaced by the other works.</p><br/><p>Unless, a female character made her appearance in the manga, who could mesmerize all the male readers and top the chart of the most adorable manga characters. But, how could this be possible?</p><br/><p>Su Li had prepared to conquer the world with her very first manga, but all of a sudden, her assistant Zhang Ziqiang who was editing the background images spoke out, “Master Su Li, the main character’s sister who happens to also be his bestie, this character is simply interesting. Will she become another member of the harem?”</p><br/><p>“The sister’s bestie?” Su Li responded subconsciously, “That character was nothing more than a side character, what’s so special about her?”</p><br/><p>Zhang Ziqiang was a 30-year-old uncle who is bald and fat. He was still single and dreamed to become a mangaka. Due to his lack of talent, he could solely be an assistant of a young and talented mangaka like Su Li for now.</p><br/><p>Despite her weakness in writing plots and molding characters, she had become one prominent mangaka of the Harem genre, owing to her “fresh and juicy” drawing style, coupled with her superior techniques in giving fan services.</p><br/><p>Zhang Ziqiang hesitated for a moment. He then shared his personal views about this side character, “Xu Jing”.</p>\n</div>"}