{"title": "Chapter 13", "id": 13, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-13", "volume_title": "Volume 1", "body": "<h1>Chapter 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Once Zhao Youyue gained a clear understanding of the ways to bow out from the manga, she felt more at ease in the world of the Dimensional Gate. If worse comes to the worst that she might have gotten bored of staying in the literary world, she can simply bow out by silently committing suicide. Alternatively she could spend money in the real world and have the author abruptly end the work. Some unscrupulous authors will surely be willing to do so.</p><br/><p>Come to think of it, Zhao Youyue felt that her current life in the “Pure Romance” world seemed rather satisfying, allowing her to live the life of an elite scholar to her heart’s content. While she was busy learning, she was still able to watch the drama unfold. Using a “caring for the retarded” [1] kind of gaze to observe the interactions between the hero and the girls. This seemed kind of awkward and hilarious in both ways.</p><br/><p>As everyone knows, the characters within the manga world tend to perform in an awfully exaggerated style. Occasionally the characters will be shrunk into Chibi versions of themselves. Of course, one will find it very entertaining when they read mangas from the real world. However, immersing one’s self into the manga world, could lead to awkwardness through the exaggerated behaviours and the tone of the characters speech content. This situation could usually be seen among the interactions between various characters. Strangely, every side character did not seem to find it out of place. Instead, they fit into the theme perfectly… Well, it seems like Zhao Youyue was “the only sober person around where everybody else is drunk”.</p><br/><p>Nevertheless, it did not matter. She was quite happy being the background board anyway. Her pressure of studying in the real world was remedied. It was her hard work in the world of Dimensional Gate that helped her in solving the junior high mathematics question during the previous pre-test when school reopened. Otherwise, she would have been embarrassed for sure.</p><br/><p>Due to the fact that Zhao Youyue’s cell phone was confiscated, she did not manage to tip this manga. Although later on the same day she spent 8,000 RMB to purchase the newly launched eighth-generation Fruit Phone, she started feeling heartache afterwards. There are still more than twenty days to go for this month. If she kept on wasting money like this, she might end up screwing up and becoming a dirt poor young lady. This is not good.</p><br/><p>Zhao Youyue initially thought she was very loaded. But as she spent her money, she discovered that there is never such a thing as having too much money. It would be nice if she could have the ability to earn money on her own. Otherwise she felt somehow uneasy spending her parents’ money like that.</p><br/><p>So she only went to the manga bookstore and purchased four issues of “Pure Romance” standalone books. This can be considered a form of support to the manga’s creator.</p><br/><p>Patiently, she finished reading the series page by page. It felt rather fascinating when she saw the character which she played, “Xu Jing” appeared in the manga, silently acting as the background board.</p><br/><p>She sometimes cannot help but wonder, if indeed she became the main character in the manga, how will it appear in the actual manga in real life?</p><br/><p>Truth be told, if it was not because she has entered the world of this manga, she would not bother to read this manga at all even though she admired its artistic style very much. It is just how she is – someone who has appearance complex.</p><br/><p>As for the plot and characters, she found it all rather dull. Firstly, it was because she did not really like harem manga-s, instead she preferred those with single character-pair or even those without character-pairing. Secondly, the useless hero characters in harem manga-s are sickening. Well, how could anyone be sure that this kind of hero, who had “softness” as his biggest strength gain the likings of so many beautiful young girls? Could they act in a promiscuous manner and flirt around without scruple? The last reason was the hero’s indecisiveness. Even towards the very end of the manga, he will still be unable to decide on who his true love really is, let alone having sex. He simply is an utterly impotent and herbivorous [2] boy.</p><br/><p>Zhao Youyue would rather spend her time reading harem mangas with typical scumbag heroes just like Itou Makoto, who slept with everyone and eventually getting caught cheated, chopped up and murdered. The violent and gory conclusion at the end was really gratifying…</p><br/><p>She conceived a sudden daring idea – could she initiate herself to make trouble, and turn the hero of “Pure Romance”, ‘Yang Ming’ into a scumbag hero who slept with everyone else? Causing him to be murdered by one of the harem members at the end, wouldn’t that be great?</p><br/><p>As the thought of this daring idea arisen, her heart that yearned to mess about became eager for action.</p><br/><p>Oh no, she lost the mood to complete her homework and put down her black gel pen right at that moment. She then took out her newly bought eighth-generation Fruit Phone and searched over the internet whether a manga called “School Days” existed online. In other words, she was checking if there has already been an appearance of such an iconic plot in this world where the hero of the harem was chopped up and murdered. If there was already one, then she felt that there is no need to cause anymore disturbance since the readers have already been shocked once by the plot. There is not much point in creating another similar storyline.</p><br/><p>Although this was a parallel universe, of course, certain creations still existed. For example, familiar old songs were being heard as well. By chance, she even saw a mangaka from the vassal state of Japan named ‘Masashi Kishimoto’ while browsing Qidian manga website in the recent days. He appeared in Qidian manga website’s Sanjiang [3] Interview to announce that his new work will be based on a ninja theme. It will be premiered on Qidian manga website and “Shonen Jump” magazine. This manga magazine is extraordinary as it was said to be the best-selling manga magazine in the entire East Asia. Regardless of whether it is from China, or vassal states like Japan and Korea, mangkas will beam with pride when they are able to serialize their manga on a certain magazine. Upon publishing every new issue, the magazine will be translated into different languages and sold all over the world.</p><br/><p>If Zhao Youyue was to live as a main character whose primary task was to copy, she might run into troubles. Who knows whether the work that she has conceived to copy will suddenly appear…</p><br/><p>However, Zhao Youyue did not have to worry about these things. On the contrary, she was full of anticipation for Masashi Kishimoto’s “Naruto”. Perhaps when the manga started serializing, she can enter the manga world through the Dimensional Gate and start messing around. Will she play the role of Hinata Hyuga, or Naruto’s mother Kushina Uzumaki? Or she could pay off Masashi Kishimoto in real life straight away and have him create a female side character with only a name. She will then shift into that side character and place the settings for an overpowered bloodline limit or something like The Mystic Eyes of Death Perception. Hmm, how about messing around after that?</p><br/><p>Unfortunately, “Naruto” happens to be a higher energy level work. For her to enter and mess around, she needed to amass more willpower.</p><br/><p>This is way too off-topic. What she wanted to figure out right now was whether any literary work with the plot of “scumbag hero sleeping around and getting chopped” ever appeared. After she learnt that the plot has indeed never appeared, her face lit up with a joyful grin. Perhaps, she can turn the regular school harem manga “Pure Romance” into iconic manga unforgettable by many readers.</p><br/><p>She was in no hurry, however. She is more concerned that her abnormal behaviors in the manga would be discovered by the mangaka. As such, everything has to happen in a natural way. Even if she did not succeed in causing “Pure Romance” to turn into “School days”, she will not suffer any loss, for her original intention was only to be a side-character that is obsessed with learning anyway. If one day the mangaka suddenly has any strange ideas to assigned the hero to go after her and affect her learning progress, then she will have no choice but to have a big go at it… Urgh, that will definitely turn out to be a tragedy caused by learning!</p><br/><p>Translation note:</p><br/><p>[1]”Caring for the retarded” is a popular messenger sticker among Chinese netizens.</p><br/><p>[2]Herbivorous – original text “”. [Insult] In Chinese language context, to describe a man/boy as herbivorous is to denote that he is soft and shy and does not have the guts to go after the opposite sex.</p><br/><p>[3]Sanjiang – original text “” – The name of an editor group in Qidian. They are in charge of discovering and recommending new books that exhibit smooth writing flow, creativity and promising future. Sanjiang Interview is a program that features elite authors as guests and is also a platform for these authors to interact with their readers.</p>\n</div>"}