{"title": "Chapter 19", "id": 19, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-19", "volume_title": "Volume 1", "body": "<h1>Chapter 19</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Most of Zhao Youyue’s attention was placed solely on the “Dimensional Gate”. Well, this Dimensional Gate of hers is quite distinct from the other mission-based or endless survival type of dimension-traveling novels. As long as the author continues working on the literature, she will be able to slip into the Dimensional Gate every night while she is asleep.</p><br/><p>Zhao Youyue’s Dimensional Gate currently directs her into the world of “Pure Romance”. When her physical body rests during her sleep, her spirit will naturally be able to enter the body of “Xu Jing”. She could use Xu Jing’s studybug attribute to learn vigorously and gain knowledge. Once she awakens in real life, her spirit will again automatically exit the world of manga.</p><br/><p>Her actions in the manga world tend to mysteriously affect the mangaka, placing the mangaka in a state of an “inspiration outburst”. The mangaka will then express the plots relating to her character through different writings and drawings.</p><br/><p>If the plot made perfect sense, the author will naturally feel that it is their inspiration that came up with such a powerful storyline and was able to draw the characters in a rather vivid way…</p><br/><p>Conversely, if the plot is exceptionally ridiculous, the author will merely think she has completely lost her senses and was in the midst of confusion. That must be how she haphazardly created such an absurd storyline.</p><br/><p>In the past, the contents related to “Pure Romance” and “Xu Jing” were basically just her acting as the side and background character at the same time throughout the storyline. She will always be buried in her studies, therefore there was no urgency to narrate her character in detail. Now however, as “Xu Jing” gained the favor of the mangaka Su Li, her appearances have substantially increased. There was also an increase of interactions among her and the other main characters. Not to mention, she was effectively promoted to a supporting character role. As such, there is now a need to narrate Xu Jing’s recent encounters in “Pure Romance”.</p><br/><p>Xu Jing’s initial character settings were very straightforward – apart from being obsessed with studying, she showed little interest towards everything else. In between her studies, she might occasionally lift up her head and gaze at the interactions between the hero and the girls with the “caring-for-the-retarded” expression.</p><br/><p>There were several close-ups of her in the manga previously, but it was rather unnoticed among the readers. Instead, it was the mangaka’s assistant Zhang Ziqiang who noticed her and subsequently mentioned that “Xu Jing’s character was rather interesting”. Besides, he also managed to persuade Su Li to create more positive appearances for Xu Jing.</p><br/><p>Ever since Su Li has made Xu Jing a supporting character, she naturally began to explore this character in a more in-depth way. First off, why is she extremely passionate about her studies?</p><br/><p>Well, all because Xu Jing came from a poor family and she hopes to change her destiny through her passion in learning.</p><br/><p>Why is her family poor?</p><br/><p>It turned out that her father got terribly sick. He no longer could work and was bedbound with illness. Her mother was an undeployed employee. She could only set up stalls outside the school compound to sell novelty items. To make matters worse, she would be chased away by local government officers from time to time.</p><br/><p>One thing worth mentioning that it is best not to deliberate on the sensibility of illnesses in any novels or manga-s – like that “Ukyo – One foot in the grave for three hundred years and still undefeated – Tachibana” [1] for example. Some of these so-called incurable diseases are purely the author’s plot device. As long as the author does not allow the character to die, that particular character will still cling on to life even after an incurable disease befell him. He could even be in the state of cheat mode [2], as if the incurable disease was actually some kind of strengthening buff. On the other hand, when the author felt that the character has outlived his usefulness and can finally die, the character will be eliminated immediately.</p><br/><p>The illness that Xu Jing’s father had in “Pure Romance” was the kind that is very cost-intensive. Frankly speaking, even the mangaka has no idea what illness it was. What was certain is that he did not die from the illness, but at the same time he could probably be dead the very next moment. As such, the mangaka made sure Xu Jing’s family remained poor and debt-ridden in such a way. Thus, Xu Jing had to make up her mind to be super diligent in her studies. As for now, her ambition is to become a doctor in order to cure her father’s sickness on her own.</p><br/><p>As Zhao Youyue entered Xu Jing’s body this time around, she discovered that she did not possess the usual tendency to study. Instead, she was back in her “nothing-but-her-bare-walls” home. A strong scent of medicine permeated the surroundings of the house.</p><br/><p>She quickly came to the realization that the mangaka has added additional settings to her character. Anyway, she was not fascinated about this setting. After all she only wanted to secretly stay as a studybug side character. But all of a sudden, she had become a girl from a poor family. What the hell is this?</p><br/><p>Truth be told, Zhao Youyue was pretty much used to enjoying a luxurious life as the little missy in reality. She felt rather let down to be abruptly thrust into such a life in the manga world. Meanwhile, she instantly realized that she may have lesser opportunities to learn in peace from this point on. There will surely be many inconveniences and obstacles ahead!</p><br/><p>As for this, she could not help but had a grudge against the mangaka. Well, she did learn a valuable lesson, which is the need to communicate with the mangaka the next time she enters the world of other works through the Dimensional Gate. Otherwise, it would be such a shame if situations like this happens again where a side character is turned into a supporting role.</p><br/><p>Fortunately, the mangaka can only alter her character’s background settings but not Xu Jing’s personality. She has no control over Xu Jing’s behavior at all, as all of these powers definitely belonged to Zhao Youyue.</p><br/><p>As of now, Xu Jing who was at home, saw her bedridden father coughing painfully.</p><br/><p>“Xu Jing” could ignore her father in total coldness. Deep inside, she held grudges towards him – as the entire family was dragged down because of his illness. Alternately, she could take care of her father meticulously as she has a kind heart and is filially pious to her parents. Anyway, all of these are up to Zhao Youyue to decide.</p><br/><p>Something made Zhao Youyue sensed that the upcoming actions she makes will fully appear in the manga. She had a similar hunch when she showed the “caring-for-the-retarded” facial expression previously.</p><br/><p>“Xu Jing” who remained expressionless, walked to her father’s side and adeptly took care of him and fed him medicines. It felt as if she has been doing these for countless years and is already well-accustomed to the routine.</p><br/><p>Immediately after that, she began doing house chores hastily. She helped to prepare meals for her mother who sold novelty items in an outdoor stall. Not to mention, she could even study classical Chinese texts while preparing meals simultaneously…</p><br/><p>There was a slight fluctuation in Zhao Youyue’s mental state. As the mangaka altered her character’s background, she could also fine tune her abilities accordingly based on the background settings. Since she was already the girl from a poor family, it is reasonable that she has to manage her household affairs at an earlier age. Doesn’t this make sense for her to be taking care of her critically ill father and be proficient at house chores?</p><br/><p>Zhao Youyue could not help but to marvel at this. In reality, she was a missy who does not need to fend for herself and never had to do house chores. But now, she was somewhat able to carry out house chores efficiently and even cook dishes beyond her expectations, all without affecting her studies. She was taking the opportunity to memorize the ancient Chinese text “An Exhortation to Learning” [3] which needs to be recited during tomorrow’s morning reading session. If Mr. Qiu is absent during the reading session, she will be able to scroll her phone again. Isn’t that just perfect?</p><br/><p>“Xu Jing” was having her dinner with her mother. At that moment, her mother glanced at “Xu Jing’s” hands which seemed sophisticated and full of calluses, she failed to hold back her tears, “Xiao Jing [4], I’m terribly sorry for making you go through all these pains since young…”</p><br/><p>“Xu Jing” held her mother’s hand instead. Her constant expressionless face finally showing a faint glimpse of a smile. Though she did not speak a single word, it all goes without saying – she never feared hardships and was very contented just having her mother around.</p><br/><p>This was the first time in which “Xu Jing” smiled in this manga. Without hesitating, the mangaka Su Li gave a close-up.</p><br/><p>Drawing the manga up to this point, Su Li felt sorry for Xu Jing. She believed that she had depicted quite an emotionally-contagious scene.</p><br/><p>However, while feeling sorry, Su Li was contemplating to kill off Xu Jing’s mother to see if she was still able to smile…</p><br/><p>Translation note:</p><br/><p>[1] Ukyo Tachibana () is a swordsman in Samurai Shodown who had tuberculosis and always said he won’t live long but lived very long anyway until he found a cure for his disease. “,” literally translates as “One foot in the grave for three hundred years, the undefeated Ukyo Tachibana”.</p><br/><p>[2] Cheat mode (gaming reference). Raw “” means to cheat or hack in a game so as to gain an unfair edge.</p><br/><p>[3] “An Exhortation to Learning” (“”) is an essay by a prominent Chinese Confusion philosopher, Xun Zi (). It was written in classical Chinese and is often the required reading in many Chinese educational institutes.</p><br/><p>[4] Xiao Jing () is an affectionate way to address Xu Jing. “” means “little”.</p>\n</div>"}