{"title": "Chapter 29", "id": 29, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-29", "volume_title": "Volume 1", "body": "<h1>Chapter 29</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Meanwhile, Zhao Youyue sneaked into the QQ fangroup, this time, she did not tip a Sect Master. After joining the group, she posted a photo of her manga booklet’s receipt to prove herself as a genuine reader. This could prevent her from being expelled from the group. Pirated readers should hide themselves in a secretive way as they would never have the chance to interact with the author.</p><br/><p>However, with only the status of a normal genuine reader, it was as if she was invisible in the group. If she had joined the fan group with a Sect Master status, it would totally be a different story. There would be comments such as “I want to hug the tycoon’s thigh” or “please let me become the tycoon’s pendant”, although most of these will merely be jokes.</p><br/><p>Zhao Youyue was in luck, just when she joined the group, she found the mangaka Su Li trash talking with the others. Wait, it should be referred as collecting opinions from the readers in an extensive way…</p><br/><p>She went through the QQ info of Su Li, and as expected the gender was male, aged 28. Then, she went through the Qzone of Su Li and took a glance at the log and found that most of them were written in a male style of speaking. Furthermore, his photo album was filled with Moe anime photos. Thus, all of these pointed Su Li to the direction as a male mangaka, the type that she thought of as a filthy Otaku mangaka.</p><br/><p>One thing that Zhao Youyue did not know was that Su Li was a very tricky person. The QQ account she was using was actually an abandoned account of her elder brother which she conveniently took over. The ID she used in signing contract for the magazines actually belonged to her brother too. Besides, her actual age was not even 28, and she was merely 23. After all, it had only been a few months since she graduated from varsity.</p><br/><p>Why would she do that?</p><br/><p>Of course, for such a harem manga, she felt easier to blend into the male readers by using the identity of a male mangaka. This also enabled them to raise their comments more daringly. After all, there would be erotic scenes in a harem manga and it needed to be a little naughty. Hence, nothing good would come if the male readers were to scruple the fact of her being a female mangaka and were too constrained to let out more constructive suggestions.</p><br/><p>Sometimes the QQ personal information or even Qzone information can be pretty deceiving. Well, at least Zhao Youyue took the bait and came up with a decision to make news out of it. She hated anyone who treated women as goods.</p><br/><p>The fans in the group were discussing about the contents of the latest chapter –</p><br/><p>“Master Su’s drawing techniques had improved a lot, “Xu Jing” was totally brought to life now!”</p><br/><p>“After this chapter, “Xu Jing” is gonna heat up! More readers will pay attention on her along with “Pure Romance”. As a loyal fan of “Pure Romance”, I am really proud of it!”</p><br/><p>“I think Master Su abused “Xu Jing” too heavily. After reading the last few pages, my heart felt really sore. How I wished to enter the world of manga and save her from that.”</p><br/><p>“Is it only me who doesn’t want “Xu Jing” to be taken by the male protagonist? It somehow feels like he does not deserve the goddess Xu Jing at all…”</p><br/><p>“You are not alone!”</p><br/><p>“I too admit that the male protagonist does not deserve Xu Jing, but I still can’t imagine her falling into other guy’s hands. If so, I will surely give up this manga.”</p><br/><p>“Duh, when did this group started discussing the storyline so seriously? I was just looking for information, aren’t there any doujin manga on “Xu Jing” online?”</p><br/><p>“No, Scram.jpg”</p><br/><p>…</p><br/><p>There was a group member who even sent all the “Debating War Post” links into the group, allowing everyone to have a look. At the same time, they could show their stand, whether to support the adding of Xu Jing into the male protagonist’s harem or not.</p><br/><p>As a conclusion, for now no matter on the net or in the QQ group, everyone was discussing on “Pure Romance” with high enthusiasm. This caused Su Li who was originally reading the posts in secret to be pleased. Finally, she appeared into the group and had quite a bit of chat with the fans and successfully walked away with a bunch of tips.</p><br/><p>Noticing the appearance of Su Li, Zhao Youyue took the courage to question Su Li directly on the following plot development. However, Su Li totally ignored her, who was just a cute newbie. Perhaps, after the appearance of Su Li in the group, more high valued fans appeared followingly. Without doubt, she focused entirely on the readers who tipped her more. If Zhao Youyue was a Sect Master, Su Li would have paid very close attention to the questions she asked.</p><br/><p>The manga Su Li produced was always going for the results and money. She would listen to anyone’s advice if they tipped her more. If there were any million-point Sect-masters who needed a side character, she would gladly add it to her work, and would even upgrade it to become a supporting character automatically.</p><br/><p>However, Zhao Youyue was not even a Sect Master, so Su Li ignored her naturally.</p><br/><p>This made Zhao Youyue more sickening. It was not that she did not have enough money but she did not like this type of manga from the beginning. Furthermore, she did not mess up “Pure Romance” as what she did in “King of Superpower”, so she did not owe Su Li anything. Instead, she thought that it was thanks to her shifting onto Xu Jing which brought up the heat on “Pure Romance”, but unexpectedly the mangaka Su Li ignored her.</p><br/><p>At that moment, Zhao Youyue saw an eye-catching comment of Su Li in the group saying –</p><br/><p>” I don’t think there is any point for everyone to debate on whether Xu Jing should be added into the harem of the male protagonist. Please continue to read at ease. I will not disappoint everyone. Since I created this character “Xu Jing” whom everyone loved, I will respect this character and will not twist her wills!”</p><br/><p>When Su Li posted this comment in the group, Zhao Youyue somehow felt a message was sent from the Dimensional Gate – From now onwards, her every act and every move in the world of “Pure Romance” shall not be removed by the mangaka.</p><br/><p>Clearly, if the mangaka received such huge benefits from Zhao Youyue shifting onto Xu Jing, she would also need to pay the price. This is as if Zhao Youyue had to pay a price when she caused a collapse in a work, it was all very fair.</p><br/><p>Immediately Zhao Youyue smiled as her final hesitation wore off. Her next step would be taking over the plot development of “Pure Romance”. As for Su Li, she would purely be a recorder but no more of a creator.</p><br/><p>The fans in the group had certainly praised the comments of Su Li. They too hoped that Xu Jing could follow her will, if only she really had her own will, then…</p><br/><p>A Sect Master fan “2701630399” questioned Su Li on the following, “Su Li, what will the ending of this manga be like? It wouldn’t be a tragedy, will it?”</p><br/><p>After Su Li saw this question, she smiled confidently and replied determinedly, “Dear Sect Master, don’t you worry, do I look like the type of mangaka who will fiddle with the readers and give them crappy stories? If I do that, I will eat crap myself! For the developing plot, I will keep you guessing, but for the ending of this title, I can guarantee all of you now that it will definitely be a happy ending. After all, nothing is as promising as an old veteran writer like me!”</p>\n</div>"}