{"title": "Chapter 21", "id": 21, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-21", "volume_title": "Volume 1", "body": "<h1>Chapter 21</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In the later phase of “Pure Romance”, a new force had emerged. They were the fans of this “Xu Jing”, simply because she was yet to show any nudity or eye candy. That pretty much defied the convention of Harem manga, and was a brand new experience for all the readers. Not to mention, she was the most unfortunate and impecunious female character in the manga. The whoopees and jubilations of the main character and the other beauties, had further brought home her misfortune to the readers. As such, would there be anyone who was not attracted by her character?</p><br/><p>Never had any pain or sorrow been perceivable from the face of this character, instead, she was always wallowing in her studies. Yet Yang Xixi’s bestie, sometimes Xu Jing had to open her ears to her grumbles, then cooked up all sorts of tardy comforting lines to calm her.</p><br/><p>“Xu Jing” had been a rather inarticulate character, as Zhao Youyue wished to become a side-character elite scholar. Being talkative does not conform to the settings of a side character, and also, shouldn’t that be a hindrance to one’s studies?</p><br/><p>In fact, Zhao Youyue considered herself as one who enjoys talking and getting along with others, and thought that her social skills were not too bad. Hadn’t she just talked Han Leng into writing a remorse letter for her? To her, proactiveness and sociability are the essentials which could prevent misunderstandings.</p><br/><p>Anyway, she preferred not to do so much talkings in the body of “Xu Jing”. The characters in the manga are all virtual characters! What’s the point of communicating with them? She just wanted to continue her studies, quietly.</p><br/><p>Due to her dead-pan expression and inarticulate character, she might already be classified as an adorable Moe[1] character. Besides, a number of readers had even shouted out her name in all of the big forums, exclaiming that she was the new generation of “Tri-no Goddess”[2] !</p><br/><p>In the manga comments section of “Pure Romance” on the internet, the love block [3] had been created for the new Tri-no Goddess, Xu Jing as well. Her love block was visited by more and more readers day in and day out. Hmm, it is hard to believe that Xu Jing had been retained as a mere side character for the entire novel before this….</p><br/><p>Still, that was yet to create a great sensation. After all, the original plot of “Pure Romance” was already at its ‘soft patch’, as the novelty of the heroines had almost wear off in the eyes of readers. Besides, the novel itself had not been animated, and so, its popularity had been gradually decreasing. In fact, Su Li was almost drawn towards ending this novel.</p><br/><p>But now, she discovered the character of “Xu Jing” had given her an opportunity to bring her works back to life. She had abandoned the subtle feelings upon drawing Xu Jing and started introducing a lot of her plots. Even the amount of her plots was already close to that of the three heroines that she opted for. Imperceptibly, Xu Jing had evolved from a female side character to a heroine…</p><br/><p>Prior to this, Su Li has thought of drawing Xu Jing’s mother dead. That was not a random thought, instead, she was pondering over this plot. At first, she wanted to banish this “Xu Jing” into hell, and appointed the male protagonist to rescue her out of it. Such a plot would definitely bring a lot of pleasures to the reader, and also give the hero a reason to go after Xu Jing.</p><br/><p>She reckoned that the life of Xu Jing could be more miserable, and her character should be granted with more details. Thus, she buried herself in her works, and started drawing with the miraculous feeling that flowed within her. Hmm, it is as if she had dived into the world of her works and witnessed the sufferings of Xu Jing. She could then translate what she had perceived into manga drawings.</p><br/><p>…</p><br/><p>In the world of “Pure Romance”, Xu Jing had just stepped out from school. She still held a notebook in her hand, and was reading it while walking.</p><br/><p>At this moment, “Xu Jing”, or you may say “Zhao Youyue”, was having a premonition of imminent disaster. In this journey of hers across the Two Dimensional Gate, not only she was granted additional character setting and interactions with her parents, plots involving her were gradually increasing! Yet, all of them were terrible bullied scenes. She could not help but to bear a bitter grudge against the mangaka. She was desperate to become just a side character who had her studies focused!</p><br/><p>A sudden thought came to Zhao Youyue’s mind, that if she was Xu Jing herself, should she have a chance to break this two dimensional barrier and appear in the real world, she would get her revenge against the mangaka, “Did I dig your ancestral grave? Why did you do this to an honest person like me?”</p><br/><p>In any case, during the process of possessing the body of Xu Jing, Zhao Youyue had derived numerous benefits. Essentially, she had strengthened her foundation knowledge, and if she was given a chance to retake her senior high school entrance examination, scoring first place might be possible! Thus, it was not a big deal for her to be admitted to the key senior high school in her current province.</p><br/><p>Zhao Youyue had always felt that there was a special bond between the mangaka and her. Both of them had to assist each other for their own interests. Unfortunately, she never had a chance to talk to the mangaka of “Pure Romance”.</p><br/><p>Anyway, the next thing encountered by Xu Jing, had blown her mind!</p><br/><p>In “Xu Jing” ‘s sight, her mother was selling goods in front of the school gate. In her shabby attire, she was still selling hard. To think that some of Xu Jing’s classmates were staring at her with contempt now, and also bad-mouthing her. An outrageous and dramatic scene as such could only be seen in novels and mangas. Would anyone disdain a hawker under a broad daylight?</p><br/><p>At this moment, again, Zhao Youyue had to make a choice. Should she run away from her mom to prevent humiliation? Or should she greet her mom and help her out?</p><br/><p>Obviously, she would go for the latter. She knew she was in the world of manga, and thus, everything was fake, what’s the matter to be despised by a virtual character anyway?</p><br/><p>“Xu Jing” still carried a poker face. Very soon, she stepped forward and worked together with her mom, without putting the contempts of her classmates in mind. A plot like this, was utterly a plus to the attitude of Xu Jing.</p><br/><p>In a split second, a local government officer who carried a big club as his weapon, charged down from the sky, as if he had transcended from the Void. Zhao Youyue would no longer be astonished by these people anyway. It was quite common for them to make their appearance out of nowhere, solely as plot devices. But soon she would realize, that she was in a deep sh*t!</p><br/><p>The city governor kicked over her mother’s stall. All sort of goods had fallen all over the place. Without a single shred of mercy, the city enforcer stepped over those goods. He then wielded his big club, literally slamming on the thin, frail body of her mother!</p><br/><p>Bang!</p><br/><p>The sound of big club hitting on the body was so solid!</p><br/><p>Her mother did a double take, screaming in pain!</p><br/><p>Her body was known to be frail, how could she possibly endure such a heavy slam?</p><br/><p>What the heck!</p><br/><p>Zhao Youyue was dumbfounded. Was the mangaka insane or what? Could she not do this to her?</p><br/><p>Bastard, do you really want to ruin your own works?</p><br/><p>Having no time for more thoughts, Zhao Youyue controlled the body of “Xu Jing” to rush forward and protect her mother. In the end, the club that was supposed to fall on the body of her mother, smashed heavily on her body instead!</p><br/><p>“Xu Jing” was beaten up until she got bruises all over body, not to mention, her shirt was inexplicably torn apart. This, is the first fan service that she gave to her readers. She was completely blacked out, until the main character, Yang Ming appeared along with his sister, Yang Xixi…</p><br/><p>In reality, Zhao Youyue had woken up from her sleep with a sudden. Her body was not afflicted with any scars. She felt that was a mere nightmare, and looked at the time. Hmm, it was just 4:20 AM, but she had casted away all her drowsiness…</p><br/><p>Translation Note:</p><br/><p>[1] “Moe () is a Japanese slang loanword that refers to feelings of affection, adoration, devotion, and excitement towards characters in manga, anime, or video games. Generally used for female characters, though it can refer to effeminate males in some instances. There are several kinds of Moe personalities, which include cold but lovely personality – Tsundere (), matured and capable personality – Queen (), innocent and energetic personality – Genki (), etc</p><br/><p>[2] “Tri-no ()” is a kind of Moe personality. It refers to the characters with no feelings (), no words (), and no expressions (). However, it does not mean the characters literally have no feelings, instead, they are not good at / do not see the need for expressing the feelings. Chinese likes to refer to a beautiful girl as goddess (), thus a beautiful girl of Tri-no personality is called Tri-no goddess ().</p><br/><p>[3] Love block () is created in Chinese forums for popular characters in mangas or novels. The readers would visit their love blocks to discuss about them or share any files related to the characters, such as their pictures.</p>\n</div>"}