{"title": "Chapter 39", "id": 39, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-39", "volume_title": "Volume 1", "body": "<h1>Chapter 39</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The end of semester one was around the corner, yet Zhao Youyue was still playing with her phone.</p><br/><p>Wait, who is Zhao Youyue? Had this character appeared in this book before?</p><br/><p>She really had the traits of a side character, after all; even the lolita author had almost forgotten this character who had no sense of presence…</p><br/><p>Recently, Zhao Youyue’s state of mind was quite unpleasant. She had known that “Pure Romance” was just a fictional Two Dimensional World, in which the characters were unreal, especially their ridiculous personalities and exaggerated actions. Still, she devoted all her feelings and emotions, if not, she would not be able to make “Xu Jing” leave such a lasting impression on the readers.</p><br/><p>However, there was a difference in nature between the time Zhao Youyue possessed “Xu Jing” versus the time an actor performed in real life. Once she had set the abilities and personality for that character, she was capable to act freely according to the character setting. She was not acting at all, but eventually became “Xu Jing” as a whole. It was just that her character would respond in a more logical, realistic way. Among works with normal character settings, the character she possessed would turn out to be just like a firefly, glowing in the dark while captivating the others.</p><br/><p>Zhao Youyue, using her own power, was able to nourish life upon the other characters in “Pure Romance”. Not only did “Xu Jing” stand out in the crowd, but had also degraded “Yang Ming’s” fame, where people would definitely remember him forever along with that unforgettable “nice boat” ending.</p><br/><p>On top of that, there were also Liu Sha who could handle hatchet like it was nothing, and Li Xiaotong who always had kitchen knives hidden in her pocket. They were both equally memorable, mainly because they had been too excited playing with knives towards the ending of the story, and were responsible for almost all the violent and bloody scenes in the manga…</p><br/><p>Without any doubt, the mastermind behind the curtain was the elite scholar Xu Jing, who had planned and calculated everything.</p><br/><p>The next character would naturally be Yang Xixi, who was always deeply in love with her own brother no matter what. This character was destined to be loathed by the readers, especially those readers who were having high expectations on the Yang Xixi and Xu Jing yuri couple. At the end of the story, Yang Xixi chose her brother’s head over Xu Jing who was willing to do anything for her, which then led to the irreversible, sad ending for Xu Jing.</p><br/><p>This was because Xu Jing did not have any reasons to live in this world anymore. Her parents passed away, her best friend and the girl she loved had left her as well. How could she possibly still be addicted to study? She had no purpose to continue studying, even though she still admitted that she had strong passion for studies in the end…</p><br/><p>The darkened Xu Jing, Liu Sha, and Li Xiaotong did not enjoy a good ending at the end of the story.</p><br/><p>In short, the main characters that were created later in the manga “Pure Romance” definitely left a strong impression to the readers.</p><br/><p>In another world, there was “Itou Makoto” this memorable character to be an exemplary model on how to become a scum. Meanwhile, there was “Yang Ming” in this world who could now be compared to “Itou Makoto”, and this was all thanks to the Zhao Youyue.</p><br/><p>However, our precious daughter from the Zhao family had been lying low, even though she just made a huge ruckus in the world of “Pure Romance”. She did not go overboard and caused the work to crumble, in fact, she might have just transformed it into an icon. But of course she would not go around making a scene to claim that she was the one behind the source of evil and the mastermind, as she had already left everything behind while keeping her fame and reputation under the radar.</p><br/><p>Looking at the screenshots inside the photo album of her hand phone, Zhao Youyue smiled cheerfully, her melancholy and depressed feeling was finally relieved by a little. Now, all she had to do was to wait for the ending of “Pure Romance” to be uploaded, she would then send the screenshots to Su Li’s fan group…</p><br/><p>What could she do? The society was indeed very cruel and sinister after all!</p><br/><p>To be honest, “Pure Romance” was at the stage where it still attracted a lot of fans, as it really did stood out from the rest. Since it was the first harem manga to ever degrade the male protagonist, it allowed the readers to feel surprised, not to mention the superb drawing skills from Su Li. Since she was a professional drawer back then, even if she drew scenes that did not show any sensitive body parts, her readers would still find them irresistible, and would tried to mimic them by using other materials after finished reading the story.</p><br/><p>Of course, this had brought a lot of accusation from many moral critics. They claimed that Su Li had messed up the style for a proper harem manga, where she corrupted the trend and popularised the scum male protagonist from this kind of manga. All business related work was aimed ultimately for popularity, and people tend to follow trends that were more popular.</p><br/><p>Actually the concern from these moral critics were absolutely unnecessary, because in another world, Itoko Makoto also used to be famous for a certain a period. However, this type of harem male protagonist was extremely rare, after Itoko Makoto, there was no other character that could even come close to him. All hail Itoko Makoto!</p><br/><p>As a matter of fact, the “early death of Itoko Makoto” did not actually come from a single book, but was derived from the work called “School Days”, where Itoko Makoto cheated and was given a nice boat, thus he was even beheaded by Ma Mei. However, several romantic Harem novels were published after that. The male protagonists had more than one lover as well, but nothing happened to them, yet their lovers got along with each other peacefully. Hence, the readers started to yell things like “You died too early”, “Itoko Makoto you died with injustice”, ” Xiao Ge in heaven please voice out for Itoko Makoto”, ” Why does this guy live with with so many women comfortably and yet Itoko Makoto has to be given a nice boat”, ” Why isn’t that guy being me instead”, ” you son of a b*tch should be given a nice boat”, actually these were the jealousy cried from the single men who had no girlfriend or unable to carry out their dream of living together with multiple women.</p><br/><p>There was a saying,</p><br/><p>Itoko Makoto laughs at your cowardice? You laugh at his early demise.</p><br/><p>You laugh at Itoko Mokoto’s early demise? He mocks you for being f*ck less.</p><br/><p>Itoko Makoto mocks your for being f*ck less? You jeer at him that he could f*ck no more.</p><br/><p>How should I put it, the story development of “Pure Romance” is indeed sinister. It is similar to a lost magic in dark arts called “The Dissection of the Great Sky Demon”, thus able to attract the eyeballs of countless people and gain immense popularity in this short period. After all, it is the world’s first manga to darken the male protagonist. If any other mangas want to follow the trend by doing likewise, those readers who had already experienced disappointments and depressions, may not choose the works of this genre anymore. Because majority of them are unable to accept the ending where almost everyone are dead! Who would like to torture themselves…</p><br/><p>How should I put it, the story development in “Pure Romance” was actually very sinister. It was pretty much similar to a lost magic in the dark arts called “The Dissection of the Great Sky Demon”, which allows the manga to attract the eyeballs of countless people and thus gaining popularity in the process. Simply because it is the world’s first manga to darken the male protagonist. If any other manga wants to follow the trend by doing the same, those readers who have already experienced the disappointment and the depression, may not choose works from this kind of genre anymore, just because majority of the readers were unable to accept the ending where practically everyone was about to die! Who would want to torture themselves like this …</p><br/><p>Therefore, Zhao Youyue was sure that the mangaka “Su Li” would become very famous because of “Pure Romance”. However, after the ending was published, when the readers were checking out her new works in future, they would definitely feel a surge of anxiety. Because they were afraid of any darkened characters which would twist the plots to the level where everyone was terrified, not to mention the ending that was always shrouded in mystery.</p><br/><p>As for the promise that Su Li made, nobody would believe it, not even the punctuation mark!</p>\n</div>"}