{"title": "Chapter 44", "id": 44, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-44", "volume_title": "Volume 1", "body": "<h1>Chapter 44</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At last, “Wind Manga” decided to publish the final ending of “Pure Romance”, simply because if they did not publish it, the adamant Su Li would be posting it on the Internet. They would rather use the final ending of “Pure Romance” to boost up the magazine’s sales once again. Besides, when facing a genius and pretty mangaka like Su Li, who got famous with only her first publication, a compromise should be made anyway. As long as her next manga continued to receive high popularity, “Wind Manga” had nothing to lose.</p><br/><p>About the matter of whether Su Li’s manga would be a success, it had nothing to be worried about. She had gained so many fans now!</p><br/><p>After discussion with the other editors, the chief editor Yin Lang believed that the final ending might trigger a vigorous response from the readers, but for sure it was able to leave an everlasting impression upon them. Also, “Pure Romance” had turned out to be the most unique manga among all Harem mangas. Once the readers mentioned about Harem manga, “Pure Romance” would not be left out. This was a good thing, wasn’t it? Better than those Harem mangas which fade into oblivion as time ticks away.</p><br/><p>What’s more, the final ending was depicted with innate artistry. The miserable ending where almost everyone were dead was like a tribute to Urobuchi Gen. It was a gimmick that might lead the eccentric readers to praise the “nice boat” ending, making it an eternal punchline in the world of otaku. This manga would eventually be recognized as one legendary manga.</p><br/><p>In short, this ending of “Pure Romance” was certain be published in the next volume of “Wind Manga” magazine. Knowing that the next chapter would already be the final one, many readers of “Pure Romance” expressed their incredulous feelings on the internet –</p><br/><p>“Why does ‘Pure Romance’ end so soon? It is gaining so much popularity now, supposedly it should continue its works… I hope Master Su Li could continue publishing for another ten years at least!”</p><br/><p>“‘Pure Romance’ should at least wait until the anime version has ended its’ screening and then only release its ending, or else wouldn’t the probability of elevated sales after the release of anime be wasted?”</p><br/><p>“I wanted to say that I would still want to see the scumbag guy Yang Ming to own more pretty girls, I’m terribly reluctant to see its’ ending!”</p><br/><p>“The greatest relationship between Xu Jing and Yang Xixi has not been illustrated enough, it should not be ending like this. I am waiting for Yang Xixi’s body and true heart to be tackled by the goddess Xu Jing!”</p><br/><p>“In any case, the final ending of ‘Pure Romance’ should be a perfect one, since the big boss Su Li had a modest personality and high moral principles, she wouldn’t bare to screw us up, right?”</p><br/><p>“Not bad, though the ending seemed kinda out of the blue, but I still believe she will bring us a satisfying ending. If she opens a new serial publication, I will definitely continue supporting her!”</p><br/><p>“Master Su Li had said that if she’d give us a bad ending, she will eat sh*t in return. Do you think anyone on earth loves eating sh*t?”</p><br/><p>…</p><br/><p>It was a Saturday. After the end of night revision class, Jiang Chao who had returned to the dorm was reading the fans’ comments of “Pure Romance” on the Internet. Of course, he shared the same feeling with them. Although he was incredulous that the last chapter of “Pure Romance” would be released next week, but due to his full confidence in the great mangaka Su Li, he felt that Su Li would not bring about disappointment in any case. The big boss Su Li was that beautiful and kind-hearted lady, for sure she would not screw her readers up, showing the loyal readers a bad ending.</p><br/><p>At the same time, Jiang Chao decided that he would continue to support Su Li if she were to start up a new series of publication. Besides, he would join Su Li’s fans club as well. How nice would it be if he could grab a close interaction with Su Li!</p><br/><p>“Brother Chao, what are you looking at? Laughing in such an agitated way.” One of his roommates named Xu Haitao walked to him and placed his hands upon his shoulders while speaking.</p><br/><p>Jiang Chao answered in an honest manner, ” ‘Pure Romance’ will be ending soon, and I’m reading the comments regarding this news on the internet.”</p><br/><p>“What? ‘Pure Romance’ is ending soon? Thanks to your recommendation, I’ve been chasing after every chapter with full enjoyment. I really wanna be like the main character Yang Ming. It was so fun for him to be having affairs with multiple girls! Why is there such a huge gap between him and me? I mean… we are both high school kids! But I’m still a virgin, dude!” Xu Haitao’s face was filled with hatred, jealousy and admiration upon mentioning Yang Ming.</p><br/><p>Xu Haitao genuinely felt that it was nothing wrong to become a scumbag like Yang Ming. To him, if any girl would ingratiate herself with him, letting him do anything as he pleased, how could he possibly withstand this?</p><br/><p>After following “Pure Romance”, he felt as if nothing was left inside his body due to a severe loss of semen.</p><br/><p>Jiang Chao looked at Xu Haitao in disdain and scoffed, “Fatty Xu, why are you acting like a male dog? The best part of ‘Pure Romance’ is definitely the perfect match between my goddess Xu Jing and Yang Xixi. Do you even know why this manga is entitled ‘Pure Romance’? It is exactly to depict the purest love in homosexuality, while the heterosexuality parts were nothing more than all the dirty works of sex plays!”</p><br/><p>Not concerned with Jiang Chao’s sarcastic words, Xu Haitao bent his arms around Jiang Chao’s shoulder. He laughed, “No matter what, I still wanted to thank you for your recommendation. I’ve never thought this manga could be such an interesting piece of artwork. The rest to whom you had recommended this manga have also acknowledged your good taste for discovering this legendary manga!”</p><br/><p>Jiang Chao’s eyes were brimming with satisfaction and arrogance. He murmured to himself, “This manga was the one which prompted her beloved mangaka Su Li to be graced as a ‘goddess’, how can it be not good? Haha…”</p><br/><p>The next day came and it was a Sunday, Jiang Chao was not all ears during the morning revision class. His brain was occupied with the ending of “Pure Romance”. He was anticipating how Su Li would bring him a surprising ending, and would he really feel happy about it?</p><br/><p>As usual, when evening fell, Jiang Chao immediately rushed to buy the “Wind Manga” magazine, without having lunch in the canteen. He would rather return to his dorm and cook himself an instant noodle just to read “Pure Romance” the soonest he could. He admitted that he was nothing different from those die-hard fangirls of male celebrities, except that he admired Su Li and her manga “Pure Romance”. He even went all lengths saving his pocket money to tip Su Li…</p><br/><p>Jiang Chao looked at the full-colored cover page of “Wind Manga”. It was his goddess Xu Jing in a lily white dress, with beautiful eyebrows. He instantly felt that his maiden heart was going to explode. He desperately wanted to enter the two dimensional world, solely to gaze at her elegance from a close distance. In the three dimensional world, a goddess like Xu Jing would not exist, absolutely not!</p><br/><p>Holding a strong anticipation, he opened the magazine and naturally flipped to Su Li’s special column like what he usually did</p>\n</div>"}