{"title": "Chapter 42", "id": 42, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-42", "volume_title": "Volume 1", "body": "<h1>Chapter 42</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Previously, the editor Wei Suo had given Su Li total freedom to work based on her own feelings, as the contents of her creation were interesting and picturesque. Even the chief editor of the magazine was chasing after “Pure Romance”. He wanted Su Li to keep up the momentum and continue working with a peaceful mind, while assuring her that the editing department would always be her strongest shield.</p><br/><p>At the same time, the main point would turn out to be the excellency of “Pure Romance”. With the increasing popularity gained, it granted Su Li a bigger autonomy to work. As long as Su Li could maintain her outstanding results, she could draw anything as she pleased!</p><br/><p>A manga at first needs an interesting storyline, followed by its popularity.</p><br/><p>Frankly speaking, though the readers would despise this scumbag hero, but he truly had a perfect sense to be the main character. Once having an argument with a girl, he would just make out with her. Kissing would be the appetizer, while the real bullet would be the alluring entrees. He was nothing like the main characters in other Harem novels, who could even turn down the girls who were hitting on him.</p><br/><p>Some “indigenous” readers had dreamed of being the scumbag hero who was always f*cking around. Well, everyone would end up in a stable relationship, but at least they could first revel in having multiple sex partners through the manga episodes.</p><br/><p>Regardless of the world of manga or webnovels, as long as the manga or novel was popular enough, the creator would definitely want their creation to be published continuously, until its popularity diminished, only then they will end the storyline. In fact, the creation which had a longer publishing period would become more popular, unless the creation became lousy and caused a tremendous decrease in its’ popularity.</p><br/><p>Not only in manga-s or novels, even if the television drama gained its popularity, there would always be a second season, third season and so on. Even for movies, there would also be a sequel to it, and these were the similarities of commercialized products.</p><br/><p>Therefore, when Wei Suo heard that Su Li wanted to end “Pure Romance”, he was totally dumbfounded. How could such a hot creation end just like that? The scumbag hero Yang Ming had yet to push down Xu Jing and Xixi this lovely couple!</p><br/><p>When Wei Suo thought about it, even if the male protagonist was allowed to choose one female heroine at the end, in order to amend his image and change back for the good, that female heroine would be no one else but Xu Jing who had the highest fame. Indeed, a lot of people could already foresee that the person who secretly made the male protagonist pleasurable was none other than Xu Jing herself, or else the male protagonist could still be a soft and gentle guy without any sense of enjoyment.</p><br/><p>Readers even felt that Yang Ming and Xu Jing could form a good couple together, simply because an outstanding person like Xu Jing could actually counter the male protagonist until a single chance was not given for him to find another girl.</p><br/><p>Anyway, Wei Suo felt that “Pure Romance” could still last for another ten years, to continue drawing for two to three years would not be a problem. The appearance of a character like Xu Jing had miraculously saved the day. From what Wei Suo knew about Su Li, she would be more than happy to prolong it, even if she had to extend the storyline of the manga. Sometimes flashback of the crucial memories could be illustrated between chapters as well, as it would generate more revenues…</p><br/><p>But what happened out of the blues was that Su Li wanted him to take the original draft of the final episode from her. What’s wrong with Su Li?</p><br/><p>Wei Suo kind of regretted that he did not set any boundaries for Su Li. According to the rules in the real manga business, before Su Li began drawing her original draft, he really should discuss with Su Li on the storyboard drafting. When both of them achieved a mutual agreement, Su Li would draw the original draft based on the storyboard drafting. But then, simply because the recent performance of Su Li was extremely good, besides from becoming a super popular mangaka who authored “Pure Romance”. Know that “Pure Romance” was her virgin manga, and she was still very young. Giving privilege for such a talented mangaka should not be any problem, even the chief editor of “Wind Manga” implied that they should allow Su Li to draw freely.</p><br/><p>At the same time, the higher committee of the “Wing Manga” magazine was discussing the new contract. They really hoped to bind with this genius mangaka who appeared out of a sudden. The natural talent shown by Su Li in the later part of “Pure Romance” allowed the beholders that were involved in this field to capture their attention on Su Li, thus they concluded that she could become the finest among the best all because of this manga alone!</p><br/><p>When Wei Suo received the original draft, he did not immediately read it, instead he did his best to convince Su Li, “Master Su Li, ‘Pure Romance’ recently became so popular now, if it ends like this in the near future, won’t you feel wasted?”</p><br/><p>Su Li shook her head, “To have me continue drawing this is meaningless, as I knew I won’t be able to retrieve the same feeling anymore. For me, I think that this ending would be the greatest essence of this creation. That’s it.”</p><br/><p>Wei Suo could feel the determination of Su Li, he knew that based on what Su Li had achieved, if she was trying to be capricious, the magazine would not do anything to her either. Simply because the other magazines were willing to talk to her and ask for her authoring. She could even directly enter “Qidian” webcomic website to continue publishing, as there were lots of fans supporting Su Li on the Internet.</p><br/><p>Without any choice, Wei Suo could only flip through the pages and read the original draft for the final ending. He did not understand why Su Li’s personal assistant, Zhang Ziqiang diffidently lowered his head after giving him a weird look.</p><br/><p>When he finished reading the ending of “Pure Romance”, he realized what was happening.</p><br/><p>If Wei Suo was not editor but an ordinary reader, he would have been cursing with words!</p><br/><p>The hell was this ending about!</p><br/><p>It was totally out of sense!</p><br/><p>From a normal story of a school-based harem manga, it has now turned into a bloody, thrilling manga!</p><br/><p>Remember how the darkened Li Xiaotong and Liu Sha cut people? Their downright creepy and scary facial expressions. But compared to the very last girl wearing a lily white dress while crying with a bright smile, Xu Jing, they were absolutely nothing other than emphasis on the unparalleled beauty of Xu Jing…</p><br/><p>Anyhow, the main point was, regardless of the male protagonist Yang Ming or other main female characters, they were all ruined. It did not matter if it was Yang Xixi as well. Despite that she may seem to be alive, but if you thought about it, you would understand that someone who got to hug her brother’s skull, and took a “nice boat” sailing towards the sunset, Yang Xixi would never return again.</p><br/><p>This devastating ending was causing a complete depression!</p><br/><p>Wei Suo even thought that Su Li might have been possessed by the Japanese Gen Urobuchi spiritually, after all she tried to come out with an epic ending that would etch in the readers’ mind badly!</p><br/><p>” ‘Wind Manga’ will never publish this kind of ending, Master Su Li, you are just simply messing around!”. For the first time ever Wei Suo stood firmly as an editor. He put the original draft into his bag and smashed it against Su Li’s work desk with a horrendous huge force.</p><br/><p>“I must have all the readers to witness this ending, if ‘Wind Manga’ insists on not publishing it, I shall make it public on my Wechat profile! Moreover, I will choose to terminate my contract with ‘Wind Manga’!” Su Li crossed her hands on her chest and spoke with conviction.</p><br/><p>“You… Have you lost your mind? This is insane! ‘Wind Manga’ will not publish it for your good sake. Have you ever thought about what will happen next if this ending is read by the readers?” Wei Suo yelled loudly.</p><br/><p>“Of course I know. But one thing was sure that I am creating a legend, and no one can ever stop me from that!” Su Li was under an influence which was rather mysterious and fateful, to the extent that she was fully intent on her actions.</p>\n</div>"}