{"title": "Chapter 49", "id": 49, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-49", "volume_title": "Volume 1", "body": "<h1>Chapter 49</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Upon visualization of these three uses, Zhao Youyue very soon came to a realization. The first option was within her expectation, which allowed her to wield the abilities of “Xu Jing” in reality. This way of use could actually be perpetual, because Xu Jing was already an iconic character. As long as the readers remembered Xu Jing, they would grant her unlimited willpower which could then be absorbed by Zhao Youyue.</p><br/><p>Now, the second option, was to allow “Xu Jing” to trade the abilities of this iconic character for the abilities of another iconic character. Having sacrificed “Xu Jing’s” character card, she could then select to enter another literary world. Not to forget, her previous literary world was but another slice-of-life world of the lowest energy level. Thus the next literary world she was going would also be a slice-of-life world without any superpower.</p><br/><p>If one was allowed to select a literary world, any reasonably intelligent person would certainly opt to enter the world of iconic works, as well as shifting into an iconic female character who was destined to be popular. With that, one could even achieve a sleeping victory [1], and probably obtain the character card in the end, unlike Zhao Youyue who had spent tremendous efforts and thoughts. In a sense, the second option was considered by Zhao Youyue as a “fair trade”, as the character card of “Xu Jing” was basically traded for the character card of another slice-of-life iconic female character.</p><br/><p>Here came the problem. The real world in which Zhao Youyue had existed was a parallel world. Though she had remembered a couple of prominent authors and iconic works like Silkworm Potato, Urobuchi Gen, but there were more literary works unknown to her, such as “King of Superpower” and “Pure Romance”. She had never heard their names in her life, and sometimes she could not even distinguish if they were truly iconic, as a popular work is not necessarily an iconic work. Some works were not well known during their serialization, but someday after the end of their serialization, they were discovered, yet emerging as iconic works. There were actually quite a number of such works…</p><br/><p>Hence, if she rashly sacrificed “Xu Jing’s” character card and accidentally jumped into a slice-of-life world of a non-iconic novel, that would be a big loss! Not only would that squander the “Xu Jing’s” character card, yet she was unable to assure a “sleeping victory”.</p><br/><p>Every literary work takes time to compose. Zhao Youyue had spent a semester long to obtain “Xu Jing’s” character card. Not until the end of “Pure Romance”, her efforts were proven fruitful. She had pretty much developed feelings towards this character card, which was all crafted with her sole effort.</p><br/><p>Therefore, this second option was seemingly attractive but it actually required deliberate consideration before use. Unless she had obtained a lot of character cards, otherwise it was not recommended to simply sacrifice one, as it would disappear forever after use.</p><br/><p>As for the third option, never would Zhao Youyue cast her lot with such an approach. Her luck was not that terrible to consume her life inexplicably, but she was neither someone under Lady Luck’s wing. Thus her possibility of achieving “sleeping victory” in a higher-energy-level literary world was still next to none. If she again shifted into a second-class literary world like “King of Superpower”, she would be at loss for how to mold an iconic female character.</p><br/><p>Once sacrificing “Xu Jing’s” character card, Zhao Youyue could no longer make use of “Xu Jing’s” abilities. This was absolutely unacceptable for Zhao Youyue who was desperate to improve her exam results.</p><br/><p>It was not that Zhao Youyue did not desire superpower, but she was able to suppress her recklessness and weight the pros and cons carefully. Her utmost priority was the ability to be “engrossed in studies” for now. A regular superpower like telekinesis might grant her invincibility in this world, but wouldn’t that make her too conspicuous to be hunted down by the great forces? Hmm… perhaps Zhao Youyue had been afflicted with paranoia due to reading too many webnovels and mangas. She was afraid that the government would capture her for research purpose. She was even worried that the possession of superpower would cause her scientific world to become unscientific…</p><br/><p>To her, that kind of world was frightening. At the same time, she believed that “Two Dimensional Gate” would place restrictions on the usage of superpower. Imagine someone in reality could obtain the power to bring destruction upon the whole world. Had the real world been destroyed, the novel itself would also vanish for sure. Wasn’t that ridiculous? Not to mention that all human was exterminated, who would be around to contribute willpower to her character card?</p><br/><p>Zhao Youyue was lazy to think further. Anyway, she preferred to explore this Two Dimensional Gate step by step. For now, she could not wait to try out the effects after activating the character card of “Xu Jing”.</p><br/><p>She instinctively activated “Xu Jing’s” character card and then, the familiar feeling came back to her. In the past, this feeling would only appear in the world of “Pure Romance”, but now, it had taken come about in the reality. Wow!</p><br/><p>Overwhelmed with excitement, Zhao Youyue felt like jumping up in the air. This must be the fruits of her endeavour!</p><br/><p>“Two Dimension Gate is awesome!”</p><br/><p>That being said, no matter how happy she was for now, her face would remain expressionless. In a sense, she had been possessed by “Xu Jing”. She could smile only if Yang Xixi showed up before her, but that was impossible. Thinking of this, she actually had a tingle of heartache, unbelievable…</p><br/><p>Ultimately, Zhao Youyue was not “Xu Jing”, thus she quickly casted aside this negative emotion, and buried herself in studies. Ahh, she began feeling intoxicated with studies!</p><br/><p>Fun!</p><br/><p>Hurray!</p><br/><p>Fantastic!</p><br/><p>How could studying be such a happy thing?</p><br/><p>How could she never realize that studying was so attractive?</p><br/><p>Zhao You had even considered studying in reality was way more fun and comfortable than studying in the world of “Pure Romance”!</p><br/><p>Ultimately, she was in reality and using her own body, while in the world of “Pure Romance”, it was but an abstract body. Separated by a wall of dimension, it felt merely like dreaming as all human five senses were undermined. This was a good thing indeed. Zhao Youyue would have died out of pain when Su Li was being abused, yet in unpredictable ways at all times…</p><br/><p>When indulging in her studies, Zhao Youyue had forgotten a task she wanted to do.</p><br/><p>Translate Note:</p><br/><p>[1] Sleeping victory “” is victory achieved by one without paying much effort.</p>\n</div>"}