{"title": "Chapter 56", "id": 56, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-56", "volume_title": "Volume 1", "body": "<h1>Chapter 56</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Youyue spoke in a monotone. There were neither ups and downs nor any gentleness in her voice, akin to the typical voice of a supporting character. It was somewhat special to hear such a voice in reality as no one would speak in such a monotone.</p><br/><p>Han Leng was relaxing his spirit by closing his eyes until he heard a familiar voice. Opening his eyes instinctively, he saw an emotionless Zhao Youyue, who was emitting a peculiar aura. He was astounded… was this person really Zhao Youyue? In his memories, she was a gentle and elegant missy who kept smiling.</p><br/><p>Of course, sometimes this missy would still reveal her playful and capricious disposition by accident. For instance, she loved to play with her phone secretly in the morning classes. Even during general cleaning, she was always slacking, which displayed her lack of responsibility as well as team spirit. Not to mention, she was not the kind of person who likes to brag or show off, and had always worn that same old blue and white coloured sportswear. Hence, she was definitely not an eye-catching person in the class.</p><br/><p>Had Han Leng not involved in a pleasant trade with her, he would not have noticed Zhao Youyue. Even though both of them were junior high classmates, but little did he have any of impression of hers.</p><br/><p>Since what moment he started noticing Zhao Youyue and feeling this little missy was so adorable?</p><br/><p>Perhaps since the dawn he started writing his teenage problem in his secret diary, which was about some boring yet sweet moments. Perhaps since the time he pretended to be sleeping and was caught by Mr Qiu. He stood up willingly, feeling that it was a sacred and solemn moment, akin to a knight protecting a princess. It did not matter if she knew the things he had done for her in silence. Anyhow, he would be moved by his own actions.</p><br/><p>Scholars are like this. Regardless of writings or relationship, once they have entered a self-satisfaction mode, there would be no end to it. They would pay no heed to how others look upon them, and would not care whether others know about him.</p><br/><p>I love you, but it does not concern you.</p><br/><p>It does not matter if you do not know, as long as I am happy.</p><br/><p>Hope is kind of half awake and crazily burning at the same time. It allows your anxious soul to hallucinate about you life in future.</p><br/><p>This was Han Leng.</p><br/><p>He was a gifted teenage boy but had a deviant way of thinking.</p><br/><p>He was destined to be alone.</p><br/><p>He even had Zhao Youyue’s WeChat ID after the trade; but had never sent any messages to her. Of course, he did type out the words at first, but he deleted all of them without clicking the send button. After some time, he never did this kind of thing anymore. He still loved to stalk Zhao Youyue’s moments, following her colourful lifestyle during the holidays. Unlike her, all he did was to stay at home playing “League of Legends”, or typing and submitting his chapters.</p><br/><p>In the classroom, Han Leng also solicitous of Zhao Youyue, stealthily. Whenever he saw her front desk mate Wang Yang was talking to her, he felt extremely annoyed. He felt even worse while overhearing their conversation about a webnovel. After all, he was a signed novelist who had a contract with Qidian. He wrote novels and his average subscription was over 3,000. As such, whenever he appeared in the group of contracted authors, people would address him as Big Brother. Han Leng was also very up to date with the gossip and he did talk and joke about it with a few legendary authors.</p><br/><p>As for Wang Yang, he was nothing but a green member of that Platinum level “Immature Apple”. He was also not a tycoon reader, yet he liked to boast in the dorm all the time, letting those who were not familiar with webnovels thought of him as a cool person. Besides that, he even had the nerve to comment and criticize in front of Zhao Youyue in class?</p><br/><p>In any case, Han Leng had already looked down upon him countless times in his own heart, still he did not take any significant action. He only hated himself for not sitting in front of Zhao Youyue.</p><br/><p>Of course, even if he sat in front of Zhao Youyue, he would be embarrassed to even talk to her. He would only drown himself in his own world of self-satisfaction.</p><br/><p>Hence, even if he felt that Zhao Youyue was acting strange, he did not show it out and nodded his head coldly instead. He was a little happy that missy Zhao actually greeted him on her own, and that felt incredibly great!</p><br/><p>After thinking for a while, he replied, “Life can be puzzling at all times, so I chose to train myself to be an immortal. Instead of sleeping so much while you’re alive, why not sleeping eternally only in afterlife?”</p><br/><p>Han Leng thought his words might bring a smile to Zhao Youyue’s cute face, and she would respond him gently. However, Zhao Youyue remained emotionless with a cold face. She kept looking at her text book from time to time, as though he could not stop her desire to study…</p><br/><p>“Oh.” Zhao Youyue replied briefly, as if she was keeping golds in her mouth.</p><br/><p>Han Leng felt depressed instantly but he still had his cold expression on his face. He felt that there was a huge gap between Zhao Youyue and himself. Obviously, this was all just his own imagination as both of them were never close, so how could there be a gap between them in the first place?</p><br/><p>The two of them stood quietly outside classroom 7, waiting for the students inside to leave for their respective examination venue.</p><br/><p>When both of them stood side by side, Han Leng had a new thought. He had decided to write down a sentence in the following exam —</p><br/><p>Grass produces the seeds. Wind blows the leaves. We stand together without speaking. This is already a true bliss.</p><br/><p>Then, Han Leng felt that the gap between them was gone all of a sudden. After all, they were in sync by standing together without speaking a word, how could there possibly be a gap between them?</p><br/><p>All of this must be his hallucination just now.</p><br/><p>Just when Han Leng was self-satisfied in his own heart while putting on a cold face, Zhao Youyue had entered the exam hall on her own. She quickly found her own seat, sat down and continued her revision. She would wait until the invigilator entered the exam hall before handing over her revision materials on the table. She could not miss any minute for her revision.</p><br/><p>Later, Han Leng discovered that Youyue who was standing beside him had entered the exam hall. He scratched his head in embarrassment and walked into the exam hall as well. Language test was just a piece of cake for him, but sometimes, he still felt some of the comprehensive questions were really stupid.</p><br/><p>As a novelist, he certainly knew that one does not think that much while writing. Yet, the teacher who set the papers would ask the students to analyze a sentence to figure out the emotional message that the novelist was trying to convey. Even if the novelists were to answer this kind of questions, they would be in bewilderment — How am I supposed to know what emotional message I was trying to convey? I have never thought of it…</p>\n</div>"}