{"title": "Chapter 59", "id": 59, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-59", "volume_title": "Volume 1", "body": "<h1>Chapter 59</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Each time Zhao Youyue gazed upon the mysterious Two Dimensional Gate, she could not help feeling that she was somehow related to it. Obviously, this Dimensional Gate was part of her possession, planted itself deep into her soul. Inside the Dimensional Gate, was the one and only character card Xu Jing, her emotionless expression with her undivided attention while reading a book, made Zhao Youyue felt at ease. After all Xu Jing was her strongest back-up.</p><br/><p>After going through several days, Zhao Youyue opened the Two Dimensional Gate once again. Fully aware that she was in a soul-state, she could possess any fictional female character at will.</p><br/><p>Accidents happen.</p><br/><p>She realized that this novel named “The Strongest King”, had no female characters at all!</p><br/><p>Those female characters who appeared on scene, were all nameless females, of the cheering squad!</p><br/><p>Could it be that she entered a realm where all the male characters engaged in a romantic relationship?</p><br/><p>If that was the case, it would be troublesome for her. In a Boys Love romantic novel, a female character can be replaced with a male character completely. While the audience is made up from Fujoshis, there was no way that Zhao Youyue can ever create an iconic female character card.</p><br/><p>Zhao Youyue could not possess any male characters, she had a genuine female soul. If only she could have a mixture of a male characteristic in a female soul, that would be perfect.</p><br/><p>She should felt lucky because she did not end up in a realm where humans had never existed, only mutant creatures to make it even worse. She recalled reading a novel that described a man who travels back in time to the Cretaceous Period and got into a crocodile’s body, it was not bad in her opinion and she even tipped the author. What made her frustrated was the author gave up on it halfway.</p><br/><p>If she happened to enter such realm one day, it would be ridiculous! Where to find a female character in Cretaceous Period, or she could possess it as long as the creature was female? Can she even create a card of it let alone obtain the ability of that female creature?</p><br/><p>Well, she would find out if she ever entered such a realm.</p><br/><p>The randomness of this Two Dimensional Gate was getting on Zhao Youyue’s nerves, she could not pick a realm that she wanted to enter at will. She wished she could have entered the world of entertainment with superstars, where she could cosplay as Hatsune Miku or Inori Yuzuriha. In reality, she entered the realm of “The Strongest King” without any female characters at all!</p><br/><p>Zhao Youyue came to her senses after awhile, she took her time to understand “The Strongest King” a little more, since she could not search the internet with Baidu in her soul-state. She would have to get back to reality to fully understand about this particular work.</p><br/><p>Zhao Youyue felt relieved when she found out this novel was not about romance, but E-sports. The plot was about a professional gamer named Lin Feng, who experienced the problem of could not keep up with the latest gaming trend due to aging, which made him unable to perform like how he used to be during his prime. He had no choice but to retire from professional and became a live-broadcast player in “Eternal War”, but he still had not given up hope on becoming “The Strongest King” ever.</p><br/><p>In order to obtain the “Strongest” title, it required the players to went through a series of tournament while being the MVP of the team and a champion in solo matches. Of course he was able to become a champion in solo competition, but his team had only achieved first runner-up, thus he was yet to obtain the “Strongest” title. After a faithful incident, he was granted with a golden finger which enhanced his ability as a gamer to a whole new level. His body conditions were reverted back to his prime, allowing him to compete once more, and finally became the “Strongest”.</p><br/><p>After Zhao Youyue had a rough summary of this novel, she could not help complaining a little about it. What the heck is “Eternal War”? The author should have written about “LoL” instead of a game that had never reached her ears.</p><br/><p>She reckoned that the author wanted to create an original game in his novel. Perhaps after it got famous, he would be able to gain profit through the copyright and thus attain the peak moment in his life?</p><br/><p>What’s more at stake, why was there no female character in this novel at all? Was it because that Esports players need no girlfriend?</p><br/><p>Since Zhao Youyue could not do anything in this dimension, she decided to return to reality for a rest. Although her physical body would be able to rest like normal, but not her mind and soul. She would not abuse this ability unless she had a valid reason like when she caused a scene in “Pure Romance”. Zhao Youyue treated her body and mind were equally important to have sufficient rest.</p><br/><p>The first thing in Zhao Youyue’s mind was to search for the “The Strongest King” novel after she woke up. The author’s pen name “Rosemary”, was one of the few best authors who wrote in the E-sports genre. The author had three novels, included this title that was on-going. These three novels had pretty good reviews based on its fan base, the only flaw was, whenever the author started to add in female characters, the fans would go crazy and started to complain about it, “Please stop writing about any girls or romantic stories, then we can still be good friends…”</p><br/><p>So, the latest book “The Strongest King” did not have any female characters in it. The author made the characters in this book looked alive, as if they have their own will and emotions, even side characters had their own traits as well. Every competition was intense, their opponents would appear to be stronger every time as the protagonist progress through the story. The reason why this novel was not a big hit because the author created an original game instead of using the one that were popular such as “LoL”. If not for the current fan base, this novel would have definitely sunk halfway.</p><br/><p>Zhao Youyue had never read an E-sports genre novel before, she thought that it would be better if she could play the game itself instead. Despite that she had no interest in E-sports, she decided to give it a try, “The Strongest King”.</p>\n</div>"}