{"title": "Chapter 64", "id": 64, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-64", "volume_title": "Volume 1", "body": "<h1>Chapter 64</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Ye Hai’s confidence in his works and absence of money worries made Zhao Youyue ran out of ideas. There was a high chance that the world she had entered would become an iconic novel, yet there were only nameless female characters. Zhao Youyue could do nothing but staring at it with frustration.</p><br/><p>Would there be this kind of problems whenever she entered the literary work of a greater author?</p><br/><p>She let go of her worries after giving it a good thought. She was lucky enough to enter a low configuration version of “The King’s Avatar”, “The Strongest King”. At the same time, she also felt unlucky as not only that Rosemary was unapproachable, but he had written a novel without any female character names!</p><br/><p>It was almost time for Zhao Youyue to meet up with the mangaka of “Pure Romance”. Miraculously, she had a great impression of Su Li whom she had never met. Comparing her with Rosemary, Su Li who had been conferred a God title with just a single manga, was simply an angel to Zhao Youyue.</p><br/><p>Zhao Youyue was almost guilty of overly teasing Su Li in the fans group, after all she was the culprit who posted all those unpleasant histories in the group. She could have sent them to Su Li as private messages, then it would not end up being a public humiliation for her. Anyway, Su Li was always generous to the tycoon readers, especially one like Zhao Youyue who carried a little fame. She would treat her with exquisite care and chat with Zhao Youyue once she had free time to improve their relationship.</p><br/><p>Zhao Youyue remembered that although she was the first Sect Master of the novelist “I’m the Best”, he did not take the initiative to talk to Zhao Youyue, not to mention asking her opinions of the novel. Quite the contrary, Su Li had been humoring Zhao Youyue up the point of losing her pride as a mangaka. No wonder that the earlier chapters of “Pure Romance” would be of such a mess, no novelty at all!</p><br/><p>Every author has their standards and temper. Even though the way of marketing were similar, they would always add in their own stuffs to spice things up. However, besides her drawing style and technique, she had nothing else unique to her. Instead of a mangaka, she might just be called a painter.</p><br/><p>Of course, Zhao Youyue did not know that Su Li was originally an ero mangaka. While doujinshi ero mangas barely require any plots, could they stimulate the readers’ lust, inducing them to masturbate, they had been considered as good works. Anyway, this had caused Su Li to subconsciously neglect the plot and follow her usual style even while drawing a regular manga.</p><br/><p>Recently, a group of people had started a “Su Li fashion” on the internet. They claimed that Su Li deliberately messed up the earlier chapters of “Pure Romance” in order to set up for the grand finale. The hero “Yang Ming” represented not only himself, but all the typical Harem heroes, but his was presented with such a miserable ending. It was Su Li’s rebellion against the convention of Harem manga. She was the first and ever to write an anti-Harem manga.</p><br/><p>After Zhao Youyue saw this statement, she grinned. As the culprit behind the grand finale of “Pure Romance”, she perfectly knew how it turned from a Harem manga into an anti-Harem manga. If she allowed Su Li to continue drawing with her own will, hmm.. definitely a typical harem ending whereby the hero is together will all the girls happily, that would not be much of an impact to the readers. Also, Su Li would not have her popularity right now, as Su Li fashion would not even exist in the first place.</p><br/><p>After the end of “Pure Romance”, Su Li got criticized by a lot of her fans, some even straight out called her a liar, or a low standard mangaka. But as time passed by, the people would always remember her as the mangaka of “Pure Romance”. Thus, she would have no trouble going anywhere after this incident.</p><br/><p>Su Li was smart enough to take advantage from the readers’ ridicule mentalities since most of them were “looking for something to read” or “expected characters to die when they cheated in their relationship”. She went along with those “Su Li fashion” statement, saying that she decided to hide the true ending as she was afraid that a lot of readers would not be able to accept it if they knew beforehand.</p><br/><p>As a result, Su Li’s statement got her a lot of attention, proving that she was able to deal with these kind of situations. Compared to that low profile Rosemary, it was totally different styles.</p><br/><p>…</p><br/><p>Finally it was the day for Zhao Youyue to meet up with Su Li.</p><br/><p>Zhao Youyue was certainly not wearing her uniform during winter holidays. Instead, she was wearing a blue button-up coat with black rivets adorned with laces around her neck, along with one dark-grey slim fit jeans showing her shape of leg perfectly.</p><br/><p>Of course, these clothes were not some mash-up brands, but fancy brands. Normally those lady-like temperaments were hidden under her blue white uniform. After some attire makeover, these temperaments flowed out of her naturally. If she ever goes to school with these outfits, she would definitely not be treated as a side character and would eventually draw lots of attention towards her.</p><br/><p>Zhao Youyue had been keeping a shoulder-length hair for a whole semester. After contemplating her face in the mirror, she decided to make herself look like Xu Jing. She thus referred to a manga with her image, and started tying her hair into a ponytail like the other ordinary girls. She kept a tiny, curly bang before her forehead, with her eyebrows slightly visible through it.</p><br/><p>Right after wearing a ponytail, her vibe was totally different. If she activated Xu Jing’s card, she would definitely be mistaken as the goddess Xu Jing who emerged from the manga. Unfortunately, her outfit did not match Xu Jing’s appearance, after all Xu Jing was just a normal person.</p><br/><p>Zhao Youyue brought a branded bag that perfectly fitted with her attire after she was done preparing, while her driver Uncle Liu was already waiting for her.</p>\n</div>"}