{"title": "Chapter 78", "id": 78, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-78", "volume_title": "Volume 1", "body": "<h1>Chapter 78</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>There are a lot of network writers that started off writing simply because they loved to read network novels as well, but the original author wrote something they disliked, so they wrote another version of that novel according to the way they liked it, and it became a doujin instead.</p><br/><p>Han Leng was not this type of network writers, he liked literature more than anybody. He hoped that he could be a poet, or even an essayist, but he realized that poem or prose were already dead in today’s entertainment scene. Poetry had become something useless, unable to get a proper job with it. It only could be used to show off one’s talent or teasing literary young women…</p><br/><p>Han Leng discovered network literature, and he dived into the circle of commercialize network literature. He hoped he could earn some draft money to realize his dream to become a poet.</p><br/><p>He planned to write something for him to earn infinite amount of money through web texts, so he continued to pursue his dream of becoming a poet or essayist. Every web text he wrote, was just to test his skill as a writer. His goal in life was probably to write something big enough for people to remember it forever.</p><br/><p>Since he dived into the network of web writing, he would read other web novels as well. There were a minority of writers actually refer to another novel to produce more quality novels. Those who shut themselves in, they were destined to fail forever.</p><br/><p>Most readers would know from “Fight Break Spheres” the iconic breaking off an engagement at the prologue, and the golden finger of grandpa’s ring. But these scenes first appeared at “Sacred Grave” and “Coiling Dragon”, a very good example of finding inspiration from another novel and make it more interesting yourself.</p><br/><p>Han Leng’s own web novel, “Dominating the World with Online Game”, the novel title itself already giving a “Long Aotian[1]” vibe. He wrote all that himself, with an average subscription of 3,000, not bad for a high schooler. He was different than those authors who get 3,000 average subscriptions after failing for 7, 8 years…</p><br/><p>He was able to write his novel because he loved to play online games too, the way he wrote made readers felt like as if they were sucked into the gaming world. His sentences were great, his female characters were lifelike, and all of them were dependant on the main protagonist, leaving lots of space for imagination, that was how he got all his subscriptions from.</p><br/><p>Online games and Esports were in the same genre, Han Leng would spend his free time to read these popular novels in the same genre. He did not expect that he would get addicted to reading someone’s Esports novel. This author was none other than Rosemary, the leading author in this genre.</p><br/><p>Han Leng was reading the “The Strongest King” as well, he was one of the loyal fans of Rosemary, because he liked “LoL” very much. Rosemary’s novel that described “LoL” was actually fascinating, except for a fact that he was bad at writing about female characters.</p><br/><p>Han Leng thought that his ability to describe a female character, or a romantic scene could easily overtake Rosemary, not because he was full of self-confidence.</p><br/><p>After he finished the latest update of “The Strongest King”, he felt like that as if his eyes were being rubbed with poison, what the heck was this “Yu Shengfan”?</p><br/><p>Is she the heroine of this novel?</p><br/><p>He would abandon this book immediately if this turns out to be true!</p><br/><p>Even Han Leng did not know how to describe a rich lady, but ever since he befriended Zhao Youyue, he had a rough idea about it.</p><br/><p>There were a lot of women who liked to show off their wealth, whether it was from another man or sugar daddy. Once they were rich, they would not hesitate to let the whole world know about their wealth. While the real rich ladies were not that low standards, they did not have to show off their wealth purposely. Even though small minor details, it could show that they really simply did not bother about money. To describe a perfect image of a rich lady, it should start from details, not her appearance with all the branded items!</p><br/><p>Han Leng could not take it anymore, he logged into his account as a reader, and complain at the comment section of “The Strongest King”.</p><br/><p>Usually network writers would not log into their own account to complain about another author, it would make them look like as if they were picking a fight, especially those who wrote in the same genre.</p><br/><p>“I strongly recommend that Mr.Rosemary should not add in female character! Honestly, I was offended by this character ‘Yu Shengfan’! I knew a rich lady in real life, and she’s nothing like her. Which rich lady would go a dirty cyber cafe full of smokers with an extended version of a limo? I will definitely stop supporting this book if this continues, even though I never tip before, but I’m still a full-time subscriber with a lot of fan points!”</p><br/><p>Han Leng emphasized his fan points because he was afraid that the author would ignore his suggestion, because he ignored all those pirated readers too. Pirated readers were not worthy of his attention, they should keep their suggestion to themselves.</p><br/><p>After he posted his complaints on the comment section, he felt a little bit better. He hoped that Yu Shengfan did not appear anymore, he only wanted to see how the main protagonist would play his game, what were his newly gained abilities through the golden finger, and how he would go to the top.</p><br/><p>At this point in the novel, Lin Feng was still a live-broadcast gamer, together with his best pal, Tang Yongkai, who was nicknamed “Hoodlum Tang”, due to his frequent usage of “Hoodlum” in game. He looked kind and gentle, but in game, he would be very serious and able to execute Lin Feng’s command perfectly.</p><br/><p>Even though Lin Feng had retired, but he had not given up on creating his old team, he recognized Tang Yongkai as one of his teammates. He had the reputation and funds, the owner of this cyber cafe.</p><br/><p>Why did Lin Feng fail to get the title as the “The Strongest King”? That was because his old team boss was not willing to invest more in their team, so they hired a so-called “genius” from the “Korea vessel state” into their team. This “genius” was usually seen flirting with girls, and would be useless at crucial moments.</p><br/><p>Lin Feng’s only chance to get the “Strongest” title was ruined by this “genius” from Korea. What made it interesting was, the title of the “Strongest” was taken by the player named “Demon King”, obviously he was a fake in reality.</p><br/><p>No matter in reality or novel, in ancient China or in “LoL”, “Demon King” from Korea was in his peak form, suppressing Lin Feng in every other way.</p><br/><p>Rosemary obviously wanted to write about Lin Feng to create his own team, to pursue his dream of being on the top, with the game changed into “Eternal War”.</p><br/><p>Han Leng realized that the comment section of “The Strongest King” was already full of heated and hatred comments…</p><br/><p>Yu Shengfan, get out of “The Strongest King”!</p><br/><p>We don’t need a female gamer for Esports!</p><br/><p>Translation Note:</p><br/><p>[1]Long Aotian – usually used to refer an overpowered main protagonist.</p>\n</div>"}