{"title": "Chapter 72", "id": 72, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-72", "volume_title": "Volume 1", "body": "<h1>Chapter 72</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After bring out her big gun, it was no doubt that she had conquered her mother. Finally Wang Hua joined her husband, as they both agreed to let Zhao Youyue continue her violin lessons.</p><br/><p>Wang Hua rubbed her eyes while saying this, “If you cannot persist this time, there will never be another chance for you. I will contact the best violin teacher in this district. Luckily, your mum still has quite the influence since I am a famous writer… Hey, little sloth, why are you looking at my eyes. Don’t misunderstand, it’s only sand in my eyes.”</p><br/><p>“There’s no sand in the house.” Zhao Youyue could not help but to say it out.</p><br/><p>“You’re so noisy! Aren’t you annoying! When I say there is, there is. Come come! Get over here!”</p><br/><p>“Ah?”</p><br/><p>Zhao Youyue walked towards her mum like an idiot. As a result, she was hugged by her mother. Het mum was pinching her face and touching all over her body…</p><br/><p>“Old mama, you…”</p><br/><p>“I tell you not to call me old mama! Tonight I’m sleeping with you!”</p><br/><p>“What? What about dad?”</p><br/><p>“I don’t care about that man with the surname ‘Zhao’. After all, he has so many beautiful nurses in his hospital, he can just sleep with anyone.”</p><br/><p>Zhao Jiayi who was smiling bitterly at the side, could not sit still anymore. He quickly explained to his own daughter, “Youyou, don’t you listen to your mum’s crap. You know your mum has a missy’s temper. If I ever do anything that will bring shame to our family, do you think I can still sleep on her bed?”</p><br/><p>Zhao Youyue had absolute trust over this her parents’ relationship. Whenever there was a rest day, they would definitely enjoy their own lovers’ world. Zhao Youyue would become the extra person in the house. Nevertheless, she was used to it because she felt it was more comfortable and happy to live freely.</p><br/><p>“Mr Zhao, what missy’s temper? I have such a good temper! I even tolerate you for finding those little nurses. Do you really want your beautiful teacher wife and those little nurses to serve you together…”</p><br/><p>“Stop, stop, stop, Youyou is still here, don’t teach the child bad things!” Zhao Jiayi was so embarrassed while coughing awkwardly. He was impressed with his wife’s ability of blathering.</p><br/><p>Zhao Youyue pretended to hear nothing. However, she put a remark in her heart about her mother. Her mother must be a naughty girl when she was alone with her father, the type that would drive people to bed every time there was an argument.</p><br/><p>Thinking of which, her father must be a very happy man.</p><br/><p>Zhao Youyue went to sleep with Wang Hua that night. Weirdly though, Wang Hua was the one who acted like a child and cuddled on her chest. Before she slept, she even taught Zhao Youyue a few ways to tie a ponytail, including her own specialty which was the cute twin ponytail style.</p><br/><p>“Little sloth, do you know how many ways are there to tie a ponytail? Hahaha, I feel like Kong Yiji, like how many ways are there to write fennels in fennel beans? Do you know that this sentence from Kong Yiji actually represents an extreme form of loneliness?” I bet you do not know at all…”</p><br/><p>“Little sloth, you have to remember to loosen your ponytail at home. This is because there will be some negative effect if you tie it too long…”</p><br/><p>“Little sloth, you should have keep your hair long. You finally open up your mind. Even I envy your hair texture. Unfortunately your hair is only reaching down to your shoulder. It will look horrible with the twin ponytail style…”</p><br/><p>“Little sloth, when your hair gets longer, follows me for hair treatment. I know a salon that is very good on treatment…”</p><br/><p>“Little sloth, is there any boys in school are chasing you? Definitely nobody since you have zero sense of presence at all. It is very difficult to let boys notice you. Your mum was not like that back in the days…”</p><br/><p>Wang Hua kept talking and talking…</p><br/><p>Zhao Youyue kept holding back until she was not able to. She laughed and said, “Old mama, with your kind of personality, you must be a blonde loser[1] who always let others snatch away her own lover. The twin ponytailed blonde tsundere is this type of person in the anime!”</p><br/><p>Wang Hua was jumping on her feet. She was an elite scholar, excelled in piano, drawing, philosophy. She was even a winner in the relationship, how could she be a blonde loser!</p><br/><p>This little girl was really trying to fight against the God!</p><br/><p>“I told you not to call me old mama!”</p><br/><p>The mother and daughter were fooling around happily. Zhao Jiayi could finally have some peace. He was sitting alone in front of the computer, playing a game called “All-stars” to his content. He loved to play “Civilisation”, “All-stars” these kinds of strategy-based games. These games were very playable as he could play for a few days for just one round.</p><br/><p>If an author was addicted to this kind of game, he must never be given a chance to play at. That would mean the break of chapters. At that moment, the author would definitely quibble. He would say that he was looking for a job, working overtime, blackout at home, had a fever, wife was giving birth etc. Actually he had no job, no wife and no sickness; he was playing the game too much. For a majority of men, if they had to choose between computer and girls, computer definitely would be their first choice!</p><br/><p>On the second day, Zhao Youyue and her parents started their journey back to their hometown.</p><br/><p>Meanwhile, Su Li had spent one day finished reading Rosemary’s novel “The strongest King” in one shot. She was losing her mind for it.</p><br/><p>She thought she would not be able to finish an E-game genre of novel since she had never read one. Moreover, she was not really good at playing games. However, this did not affect her reading. Since Zhao Youyue suggested her to turn “The strongest King” into manga, she had a lot of inspirations and ideas while reading. Not to mention that Rosemary’s words allowed one to imagine the scene vividly. This let her felt that it was possible to change this work into a manga. It could become very popular!</p><br/><p>At this moment, Su Li opened the group chat named “Lone Elderly Club” where a majority of the Godly writers were in it. Rosemary who had no Godly contract was considered bad in the group, even Su Li had a better reputation than him. After all her “Pure Romance” made her become famous with only one manga. Qidian manga website was getting along with her and signed her to a Godly contract. Apparently they want to make Su Li as a signature artist for Qidian manga website. Since webcomic was on the rise, Qidian manga website was also trying to keep up with the flow. For Su Li who had stirred up such a fuss with only one manga, the result was even on par to those genius mangakas titled “King of Novice”, of course they would sign her.</p><br/><p>Coincidently, Su Li saw Rosemary who was talking nonsense in the group. This group had a special trait, where those failed authors would talk a lot of nonsense in the group. As for those influential writers, they were always diving in the group.</p><br/><p>Of course, Rosemary could not be counted as a failed author. With his income and position in webnovel, he had already surpassed at least eighty percent of other authors. However, he was nothing in this group which were full of Godly writers. During that time, the Godly writers were discussing issues regarding copyrights. Actually there was a supernatural fiction Godly writer with the pen name “Five hundred Zhong Yuan” had just sold out the gaming rights for six million. This had caused the other writers to admire him, and thought that his work would become another legend! Not to mention that his contract could be upgraded to a platinum contract!</p><br/><p>Rosemary then reflected, “Actually I just wanted my new book to be converted into manga. I will give it away for free, the copyright to change into manga…”</p><br/><p>Just then, Su Li started to talk in the group.</p><br/><p>Translation Note:</p><br/><p>[1] Blonde loser () is normally used to describe a blonde character that loses to others in a love competition for the main protagonist but never learn to give up.</p>\n</div>"}