{"title": "Chapter 71", "id": 71, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-71", "volume_title": "Volume 1", "body": "<h1>Chapter 71</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>For once in her life, Wang Hua had two bowls of rice. Normally she would opt for one bowl of rice, but tonight she asked for extra. Only when she had finished her meal, she stopped teasing her daughter, altogether lost in her own thoughts.</p><br/><p>Staring at the empty plates on the table, Zhao Jiayi became silent. At first, he wanted to light up a cigarette, but his wife and daughter were there, he held back that gesture.</p><br/><p>The scrumptious meal ended with Zhao Jiayi and his wife pondering over the same question. When did their daughter master such amazing culinary skills? They truly did not expect this coming from Zhao Youyue. At the same time, they also felt a slight pang of guilty conscience. One of which was if they had not spend enough time with their daughter, by simply giving her pocket money but not attention nor affectionate care.</p><br/><p>Nowadays, there are cases where some rich kids are broken inside due to the lack of care. Some have even suffered mental disease and caused problems for the society, bringing trouble to their families. For Zhao Jiayi, his daughter was not one that would bring shame and worry to the family. Zhao Youyoue was just an ordinary girl who had never done anything extremely rebellious or out of the box. To him, describing his daughter with the word “fine and gentle” was just right.</p><br/><p>Others might not believe that Zhao Jiayi trusted his daughter more than his wife.</p><br/><p>But now, Zhao Jiayi seemed to be a little worried when Zhao Youyue showed off her seemingly well-polished culinary skills.</p><br/><p>“Let me tidy up and wash the plates.” Zhao Youyue stood up and offered voluntarily.</p><br/><p>At that moment, Zhao Youyue did not activate “Xu Jing’s possession” mode. Because she was a girl who is aware of the present atmosphere and also has a very high EQ. She fathomed the unusual behaviour of her parents after giving some thoughts.</p><br/><p>This time she had really caught their attention, greatly boosting her sense of presence. Her culinary skills was indeed amazing, which astounded everyone. When Youyue was flaunting her talent, the whole family was so happy that their intelligence had dropped off. But after the dinner, they started to think like usual and the largest suspicion came to sight.</p><br/><p>“Youyou, take a sit, there is no need to rush. Leave the dishwashing to daddy and mommy. You should’ve been exhausted from all the cookings, better take some rest.” Explained Zhao Jiayi while stretched out his hand pressing down the dishes.</p><br/><p>Zhao Youyue had no choice but to sit down. Now, she must not induce any suspicion but act normally.</p><br/><p>At this moment, Wang Hua did not interrupt and just waited for her answer.</p><br/><p>Zhao Jiayi continued with a very gentle tone, “Youyou, when did your culinary skills become this good? I’ve never seemed you practicing them at home before.”</p><br/><p>Zhao Youyue naturally replied in a calm tone, “I’m just tired of eating the foods outside. That’s why I try to make some food for myself and found that cooking is actually quite interesting. When you two are not at home at noon, I will start practicing. Then, I will clean the kitchen until no cooking signs can be found. I only decided to give you a surprise after I mastered the culinary skills.”</p><br/><p>This explanation was truly flawless, as Zhao Jiayi and Wang Hua were basically not at home on afternoons. Nobody would notice if Zhao Youyue actually did that. After all, they did not hire any maids. This was because Wang Hua was quite exclusive. As for the house works, they would hire hourly waged cleaners for the cleanings, while the clothes were basically dry cleaned and delivered directly.</p><br/><p>In fact, Zhao Youyue actually cooked her own food during the recent holidays. She hand-picked various types of seasonings and even the kitchen tools. She even self studied and created a few interesting dishes.</p><br/><p>Zhao Jiayi sighed and told her in relieve, “Youyou, I never thought that you finally found some specialty in yourself. From now on, you are the best cook in our house!”</p><br/><p>Originally, Wang Hua wanted to retort subconsciously, but she only managed to hiccup in the end, considered as admitting the fact.</p><br/><p>In Zhao Youyue’s heart, she was thinking “Sorry for being so invisible all along!”</p><br/><p>At that moment, she remembered something and said, “Daddy, I’ve decided to pick up the violin lessons again. Please help me to find a good teacher, the stricter the better. I am sure that I can persist this time.”</p><br/><p>Zhao Jiayi discerned his daughter’s determination and certainly agreed with her. Picking up an artistic skill was great. In the future, by getting some violin tests, it would be an additional merit when seeking for relations during university applications. However, could his daughter really persist? Was it too late to pick up violin again? It might also end up affecting her results which just improved recently. After all, the semester final exam of his daughter was the seventh in the class. This made him overjoyed. Which parent in the world does not hope their children get good results? Those who say that only the non-obedient ones can succeed when they grew up were because anybody can run a tick down that do not belong to them.</p><br/><p>Before Zhao Jiayi spoke, Wang Hua could not hold herself back anymore. This time, she did not use a cynical tone, but explained calmly, “It is too late for you to learn now. Previously, if you have persisted, you would have made some achievements, as you had a good fundamental. I was hoping that someday you can play your violin together with my piano. But you chose to quit, and now, even if you want to learn, you surely can’t keep up with my piano skills. So it’s now pointless for you to pick up violin, it will be but a waste of time and money. Probably you can’t last even more than three months.”</p><br/><p>Towards the end, Wang Hua started to show her disappointment on Zhao Youyue. At least she really did recognise her daughter at the aspects of musical talents, just a weeny bit less than her. Alright, maybe it was actually a bit better than her. However, to speak of determination, she wouldn’t even comment on it. Little sloth is always a little sloth! She is hopeless!</p><br/><p>“Old mama, I want to learn violin.” Again, Zhao Youyue said persistently.</p><br/><p>Then, Zhao Youyue stood up and went into her room, bringing out the newly bought violin. After all, the previously used violin was not standard issued, as she was still very young by then.</p><br/><p>Without any doubt, she activated “Xu Jing’s possession” mode and prepared her stance. Her left hand pressed onto the chord, balanced the violin against the horizon, and her right hand drew the bow. Setting the tip of violin at eye level, she played the song she prepared for a long time, “Mother is The Best in the World”. Based on Zhao Youyue’s understanding of her mother, when she mentioned about re-picking up violin towards her father, her mother would surely retort. Well, she did disappoint her mother too many times since young. It was more likely that her credibility was negative.</p><br/><p>That was why she needed to bring out the big gun, then she could subdue Wang Hua.</p><br/><p>“Told you not to call me old…” Wang Hua’s sound stopped there when the familiar melody rhymed.</p><br/><p>Wang Hua’s proud and cold expression finally started to change. With her musical attainment, she could surely know how poorly skilled her daughter was. She was only playing the melody of the song following the book. Yet, just as how she felt the love from the dishes, she also received her daughter’s profound love towards her from this familiar melody!</p><br/><p>She was immersed in it, overpowered. In her eyes, sparkling crystals of tears could be seen.</p><br/><p>…</p><br/><p>Mother is the best in the world, children with a mother are like a treasure, fall into the arms of mother, endless happiness could be found…</p><br/><p>Mother is the best in the world, children without a mother is like a weed, leaving the arms of mother, where could happiness be found?</p>\n</div>"}