{"title": "Chapter 81", "id": 81, "volume": 1, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-81", "volume_title": "Volume 1", "body": "<h1>Chapter 81</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In reality, it was not easy to be proficient in multiple languages, unless one is born with language talents. To be able to master two languages was already a good accomplishment, such as English and Chinese.</p><br/><p>Both English and Chinese are extremely important in this world, since these two are the most communicated languages worldwide. As a matter of fact, English is a compulsory subject in China and Chinese subject for European countries.</p><br/><p>Of course there are many other languages other than English and Chinese, such as French, German, Russian, Arabic Korean, Japanese and many more. Even though they are not widely used in Chinese or English, but those languages are indeed some tools for showing off, especially when only a minority of people knows how them.</p><br/><p>Anyway, it would be quite impressive if one could spend tremendous effort to master a couple of languages solely to show off.</p><br/><p>In order to be proficient in multiple languages in the novel, it only required a setting. Even foreigners could speak fluent Mandarin in a Chinese novel. In fact, foreigners were actually speaking in their mother tongue, but readers would literally interpret it as Chinese.</p><br/><p>Zhao Youyue gave “Yu Shengfan” the ability to be proficient in multiple languages with a purpose. It mainly allowed her to mock her opponents elegantly without any means of vulgar words and also to crush her opponent’s morale in competition. “Eternal War ” was a worldwide game in “The Strongest King” setting, so how could “Yu Shengfan” cause a scene during the world championship if she only knew Chinese?</p><br/><p>Granted with a wealthy family background by Rosemary, it was not awkward if Yu Shengfan she had learned multiple languages since young. Yu Shengfan was an internet addict too, and of course she wanted to test out every game regardless of its country. Some games were not translated into Chinese, so she had to pick up that particular language so that she could enjoy the game more. Know that she was a genius in both games and languages.</p><br/><p>The exaggerated description of “Yu Shengfan” had given Zhao Youyue more options to modify her character settings, she could even give her a golden finger. Thus, she never urged Rosemary to change her description, as this granted her more freedom to mess around in the novel world.</p><br/><p>Henceforth, having allowed Rosemary to exercise his new way of depicting a girl via the character of “Yu Shengfan”, Zhao Youyue had indirectly hinted him to — add more, add more, add more scenes of Yu Shengfen!</p><br/><p>Other than proficient in multiple languages, her other character settings were based on the template of “Huang Shaotian”. But instead of spitting out vulgar words, she was set to be a little different.</p><br/><p>In “The King’s Avatar”, Huang Shaotian loved to talk c*ck. He could always be seen talking, of course, with vulgar words. He could even talk to himself when there was no one to talk to. While playing games, not only that his hands were moving the controls, his lips would be moving non-stop as well.</p><br/><p>The competition ended up setting a special rule just for him, that the players are banned from talking while their heroes are dead. Huang Shaotian looked like as if he was naive, but he was actually a very fine and careful person. He was also the kind of person who had very accurate judgements and would seize any opportunity in reaching distance.</p><br/><p>Some people thought that the trash words spitted by Huang Shaotian were rather Moe than vulgar, as it was not harsh nor venomous enough. It was just enough to make him turn from swordsman to a filthy man[2].</p><br/><p>What happens if both talkative and venomous tongues were put together as a single trait, would it generate a huge impact on it?</p><br/><p>To mock someone without any usage of vulgar words is not easy at all, unless one has a talent for languages. Words like “f*** ur m**”, “ur m**’s c***”, “f*** ur m**’s c***” are too common, everybody knows it.</p><br/><p>To be able to scold someone without any vulgar words in a short time is rarely seen too, as if their mouths are moving turret gun, breaking opponent’s morale just with words alone.</p><br/><p>These two traits were added into “Yu Shengfan” language talent, just to give the readers a very deep impression on her.</p><br/><p>When “Yu Shengfan” appeared in the novel with this “foul mouth” state, it was interesting enough to imagine the expressions on the readers’ faces. Her character seemed to be more amusing right now.</p><br/><p>In order for “Yu Shengfan” to become more Moe and popular, she even set her voice to be Rie Kugimiya’s lolita voice. This would cause some masochist fans to go uneasy whenever “Yu Shengfan’s” scoldings were unheard ——</p><br/><p>“There’s no meaning in life without the voice of Fanfan[1]!”</p><br/><p>“I can hear Fanfan’s voice in my head.”</p><br/><p>“I wished to get scolded by Fanfan…”</p><br/><p>Finally, this is what we called the “Fanfan’s disease”, full name “Yu’s virus allergic brain fever”.</p><br/><p>If Huang Shaotian was annoying, his female version “Yu Shengfan” would be adorable. Rosemary had given her the beauty and wealth, and she would definitely become one of the players with the most poisonous mouth in the professional arena. Could “The Strongest King” be adapted into an animation, there would be more “Yu Shengfan’s” fans being tainted by this “Fanfan’s disease”!</p><br/><p>Since she had the lolita voice of Rie Kugimiya, might as well add in the tsundere trait. Even though she had a foul mouth, but she would be honest towards the main protagonist Lin Feng, becoming his most trusted pal and teammate. Her wealth would guarantee his team’s performance, plus, her role will become more important, and her popularity will rise.</p><br/><p>In the novel of “The King’s Avatar”, Huang Shaotian was the opponent of the protagonist Ye Xiu. He only appeared to help the protagonist Ye Xiu with dungeon stages during the prologue, and disappeared throughout the series. However, he did appear once again during the epilogue, only to lose in the tournaments during the final. “No comment.” That was the final words of Huang Shaotian on stage. That was the words that rendered everyone remembered him. Who could imagine or understand his feelings at that time? For a talkative person like him to become speechless at once.</p><br/><p>At last, Zhao Youyue was done setting up everything for “Yu Shengfan”. She had her main abilities maxed out, and they were obviously gaming skills and language talent. As for characteristics, it was tsundere and foul mouth with the voice of Rie Kugimiya. In conclusion, this was almost the female version of Huang Shaotian, a gaming expert plus tsundere rich lady with Nagi Sanzenin’s personality.</p><br/><p>After finalizing the abilities and characteristics of “Yu Shengfan”, Zhao Youyue suddenly felt a strong urge to talk, as if she would fall sick if she did not speak. Luckily she could type it out to sooth her desire.</p><br/><p>As for now, Zhao Youyue had to solve a problem for Rosemary. Why would a filthy rich lady like “Yu Shengfan” visited the cyber cafe for… internet?</p><br/><p>Translation Note :</p><br/><p>[1] Fanfan – Nickname of Yu Shengfan.</p><br/><p>[2] From swordman to filthy man () – sword and filthy have the same pronunciation in Chinese.</p>\n</div>"}