{"title": "Chapter 102", "id": 102, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-102", "volume_title": "Volume 2", "body": "<h1>Chapter 102</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Hao finished all the latest chapters in one go.</p><br/><p>Tang Yongkai who treated “Unpleasant Rain” as a fat otaku all along had the funniest expression. Never would he have thought that “Unpleasant Rain” was not a fat otaku but a real lolita, the type that people would die for!</p><br/><p>Now, Hoodlum Tang who was unrestrained and did not bother about the minor stuff felt totally awkward. In the games, he frequently retorted, and even called this lolita “Fat Otaku”. Little did he know that he had accidentally offended this super adorable lolita, who was actually his type!</p><br/><p>Lin Feng’s expression was unexpectedly calm. He did not care who “Unpleasant Rain” actually was in the real world. What he eyed on are only her skills. Nevertheless, their relationship had deepened while he was getting along with Yu Shengfan.</p><br/><p>Offering his hand to Yu Shengfan, Lin Feng greeted her with a slight smile. What amused him was that Yu Shengfan wanted to shake his hand at first, but ended up not doing it for an unknown reason. Haha, it seemed that she was shy, truly like an adorable child…</p><br/><p>Lin Feng could not stop teasing her a little. Yu Shengfan explained that she was ill and coming in contact with her would bring misfortune!</p><br/><p>Rosemary aka Ye Hai did not think too much as he was writing this part. Because “Yu Shengfan” was still under Zhao Youyue’s possession state. Zhao Youyue only wanted to reflect the Tsundere personality of “Yu Shengfan” and purposely made her that way.</p><br/><p>Obviously, the effect was pretty good. In this chapter, numerous readers commented that “Little Fish[1]” (A pet name of Yu Shengfan) was adorable to the max. They really wished that they could enter the novel world and cuddle with this adorable lolita.</p><br/><p>None of the readers found anything inappropriate. How could Yu Shengfan possibly be diagnosed with a fatal illness? Even if Yu Shengfan was ill, it would be something like the talkative illness, venomous tongue illness, or the incurable Tsundere illness. How could she be sick for being able to do all the jumping about and troublemaking in the games?</p><br/><p>Unfortunately, a character who exists in the novel would encounter an accident anytime, should the author changes his mind…</p><br/><p>Besides loving to PK, she loved to collect beautiful masterpiece equipment. She was very interested in Lin Feng’s upgradable dagger artefact. Ever since she noticed that there was something called self-forged weapon in “Eternal War”. She too wanted to be like Lin Feng and forge a legendary blade. For this, she spent countless money and triumphantly declared that she would be invincible in “Eternal War” when the sword was completed!</p><br/><p>Plenty of readers were happy to see this. They could see that “Little Fish” had already become one of “Old Lin’s” bro. There was no need to be afraid that she would leave Lin Feng. The stronger she was, the better it would be!</p><br/><p>Despite some readers suggesting a different point of view, commenting that this character Yu Shengfan might be a little too strong. She had almost stolen the protagonist’s halo and the title of “The Strongest King”. Do not forget how strong she was in solo play!</p><br/><p>If the plot actually developed this way, it would surely be amusing. After all of this, Lin Feng was actually a fake protagonist while Yu Shengfan was the true protagonist?</p><br/><p>This must be unacceptable to plenty of readers. That was why they requested Rosemary to balance out Yu Shengfan and not making her a bug[2] in game. If this continued, she would soon ascend from female support character to the protagonist!</p><br/><p>However, it was impossible for Rosemary who was in an “intoxicated” state to take in any of the readers’ suggestions. He wanted to enjoy the”inspiration outburst” and the “writings turn alive” feeling while writing the stories of “Yu Shengfan”…</p><br/><p>This was all Zhao Youyue’s fault. From the moment she went into “The Strongest King” through the “Dimensional Gate”, the popularity of “The Strongest King” continued to rise. Thereinto, the manga version of “The Strongest King” was considered to be started by her. In future, various doujinshi of “The Strongest King” would emerge, and the popularity of this novel was destined to be ever growing!</p><br/><p>After amplifying the reputation of this novel, her freedom in the world of novel would naturally increase as well. At the same time, Rosemary would be so “intoxicated” until he could not control himself. As long as he started writing “Yu Shengfan’s” stories, he would be carried away!</p><br/><p>Actually, Zhao Youyue did follow the comments section of “The Strongest King” all the time. Upon noticing that the character she played was about to steal the role of the hero Lin Feng, she already felt that something was off. Just at that moment, the “Dimensional Gate” was yet to remind her that she could receive “Yu Shengfan’s” high popularity character card if she bowed out. That was why she waited slightly, until today</p><br/><p>The decision of her bowing out was considered rather determined. Else, she did not even know to which extent would she lead the plot of “The Strongest King” to. Therefore, she would rather leave earlier and return everything to Rosemary’s control, allowing him to “sober up” and in turn balance the storyline of the novel. It was still better if Yu Shengfan continued as a support character.</p><br/><p>At this moment, as the author of “The Strongest King”, Ye Hai had received news of his book being tipped a Golden Sect Master and a Silver Sect Master. In fact, plenty of writers were staggered, feeling that Rosemary’s work was turning into a legend for sure. Its average subscription exceeded 10,000 compared to the former 4,000. Adding on the heat of the manga version, Rosemary’s current novel was meant to be a great copyrighted intellectual property. Especially the game copyright of “Eternal War”, rumor had it that numerous gaming companies were highly interested in it. It was possible that by selling only this novel would bring a few millions worth of copyright royalty!</p><br/><p>Within the “Lone Elderly Club”, plenty of High God authors who had previously teased Rosemary now bowed to him. Currently, Rosemary was the boss who topped the Monthly Tickets Ranking. Some who were well informed already heard that Rosemary had changed to a “High God Contract”. Now that a Golden Sect Master had appeared, thus the results soared once again. When Rosemary finished writing this book, there was a high possibility that he would directly acquire a “Platinum Contract”!</p><br/><p>That would be another living example of becoming the legend with a single book, which truly made people envious, jealous and hateful! With only this book, Rosemary would already be capable of supporting his entire life!</p><br/><p>Seeing the front page of his novel, of course, he was very excited too. On the spur of moment, he uploaded a solo chapter[3], showing his sincere gratitude towards “ImYouyueHerBrother”. He also announced to all readers that tomorrow he would be uploading six chapters, a total of 18,000 words to express his gratitude to this Golden Sect Master!</p><br/><p>He had this miraculous confidence that he would definitely come out with this. Because his mind would be exceptionally clear every time while he was writing “Yu Shengfan’s” stories…</p><br/><p>Translation note:</p><br/><p>1. In Chinese, the surname of Yu Shengfan() – Yu() is pronounced the same as Fish (), thus some called her “Little Fish” in the story.</p><br/><p>2. Bug – Normally mean a glitch game or software, but in China, this word is used as an adjective to describe a too powerful feature, AI or gameplay character.</p><br/><p>3. Solo chapter () – a special chapter uploaded by the author which contains no plot but only to interact with the readers, as in reply their questions or express the author’s gratitude to them.</p>\n</div>"}