{"title": "Chapter 115", "id": 115, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-115", "volume_title": "Volume 2", "body": "<h1>Chapter 115</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Han Leng really felt like giving himself a tight slap.</p><br/><p>He loved “The Strongest King” as well, but why did words become so much different upon leaving his mouth…</p><br/><p>Perhaps he was a little jealous as Zhao Youyue rarely promoted a book so passionately?</p><br/><p>Or.. probably because he was writing the works of the same genre as Rosemary, who had however gained so much fame with only this “The Strongest King”, while he was still struggling with his hollow literature which made him feel like throwing up…</p><br/><p>In fact, Han Leng had been engrossed in “The Strongest King”. He quickly corrected himself, “No, I like this literary work too! Especially that character Yu Shengfan whose nickname was ‘Xiao Yu’! But can’t you see? This character outshines everyone, slowly becoming the star of this novel. This way quite an impact on the novel! You gotta be careful about jumping to conclusion that this story would have a happy ending.”</p><br/><p>As a fellow author himself, Han Leng had very keen senses. He noticed something was off when looking at the way Rosemary described Yu Shengfan in the recent chapters. Now, he felt uneasy at the sight of Zhao Youyue promoting this literary work without worries, he felt uneasy.</p><br/><p>Zhao Youyue was speechless after hearing Han Leng’s words. She kept quiet for a while, and replied, “But Rosemary promised me that he wouldn’t do anything unreasonable… I’m his Sect Master, and Xiao Yu was the cameo I requested…”</p><br/><p>Gazing at the anxious Zhao Youyue, he sighed, “An author’s promise can’t be trusted sometimes… No one can stop them while their inspirations are pouring in. Remember Miss Su Li whom you’re close to, she did likewise right? In the end, what kind of finale came about?”</p><br/><p>Zhao Youyue was responsible for the finale created by Su Li, but she had retired from Rosemary’s literary work, would he actually become reckless?</p><br/><p>What worried Zhao Youyue the most was that Rosemary would destroy the character “Yu Shengfan”, which means her character card would turn out to be useless. In fact, she was wondering whether she should sacrifice this card after all the troubles Rosemary had caused</p><br/><p>“How did you know that I was close with Su Li?” Zhao Youyue asked casually.</p><br/><p>Han Leng did not attempt to conceal the truth from Zhao Youyue, so he told her that some author had revealed her photos in a group.</p><br/><p>Zhao Youyue nodded her head without batting an eye, she was only worried about Rosemary getting lost in his own inspiration. Why couldn’t these authors be more reliable?</p><br/><p>Luckily Han Leng reminded her that if she kept promoting “The Strongest King” without any restrictions, she would end up with… remember what happened to Jiang Chao earlier? Tragedy.</p><br/><p>“Han Leng, what are you actually writing in Qidian? Give me your book name so I can tip you a Silver Sect Master.” Zhao Youyue smiled gently.</p><br/><p>Han Leng turned around and walked away as he uttered, “No thanks, I’m waiting for the day you tip my book of your own accord.”</p><br/><p>Zhao Youyue thought to herself, she was doing it of her own accord now. Hen Leng had helped her once, she was just returning his favor. In her mind, Han Leng was quite a money lover, who could be satisfied by cash compensation.</p><br/><p>However, Zhao Youyue never understood, that Han Leng wanted to win her over with his literary works, so that she would promote his novel with sincerity. For creations that deserved such effort of Zhao Youyue, would she be ungenerous to tip them?</p><br/><p>There were actually some others whose senses were as keen as Han Leng’s, the mangaka collaborating with Rosemary for instance Su Li.</p><br/><p>As the original mangaka of “The Strongest King”, she must be very familiar with the novel. In fact, she had to picture every scene clearly so that she could start drawing. Of course, her reputation had risen due to this manga’s drawings, especially the high-popularity blonde twintail lolita, Yu Shengfan! She was already crowned as the most moe character in the manga.</p><br/><p>Whenever Su Li drew the appearance of this moe character, the comment section would be hyped up! All sorts of tips and rewards would pretty much delight her. As such, she began treating Yu Shengfan as her money tree…</p><br/><p>Recently, the abnormal behavior of Rosemary rather agitated Su Li, until she had personally questioned Ye Hai, and of course, she was given a perfunctory answer. Anyway, she was not the type of gullible person since she was a literary creator herself. She could even penetrate the thought of any author who wanted to cause trouble!</p><br/><p>Su Li realized that if the original creator had made up a decision, no one could stop the author from creating an iconic character or plot no matter what…</p><br/><p>She remembered the times being in the “intoxicated state” herself, and perhaps Rosemary was “intoxicated” now too?</p><br/><p>The “intoxicated state” could either be a gift or a curse to an author. It could make a literary work or character become a memorable iconic, or even cause the whole thing to crumble if it was not handled with care!</p><br/><p>What worried Su Li the most was that her money tree would get destroyed, and most importantly she was a “former convict” too. Rosemary had tons of fans and a good reputation, and eventually everyone would put the blame on her when Rosemary had crossed the line! Su Li felt like using the “Are you f*cking kidding me” meme…</p><br/><p>Not only Han Leng and Su Li, but the other readers who had keen senses became restless as well, making their remarks in the comment section. Most of them realized something was wrong with Rosemary in the recent chapters. That intense feeling of hiding something… The atmosphere was supposed to be joyous because Old Lin and Xiao Yu were already that strong. Reading any of their gaming contents would cheer up everyone as they could see how they tortured the opponents with style…</p><br/><p>However, there were still tons of fans defending Rosemary —</p><br/><p>Master Rosemary would not disappoint everyone because he had three successful novels in the past! All his plots had never upset the readers, and now, he had even improved his skills in portraying female character! Has he not proven himself with this highly popular Xiao Yu? Master Rosemary is already flawless!</p><br/><p>He is nothing like Su Li, who killed the most popular female character in her work, right? Well, it may be common nowadays to give bento to a character in the grand finale, but who will do it in the middle of the show, not to mention the most exciting part? So, everyone please trust Rosemary and help him out of the author’s gloomy phase of composing…</p><br/><p>In fact, Rosemary’s ignorant fans were quite plentiful. These protective posts had made it to the top of the page, and inside them, there was numerous Sect Masters supporting Rosemary.</p><br/><p>The next day, Rosemary uploaded 20 chapters at once, with a total of 60,000 words. After carefully editing his writings, he genuinely thought that this new “Yu Shengfan” could hold a candle to that depicted by him in “intoxicated state”!</p><br/><p>Of course, that included the long-awaited battle between Yu Shengfan and Lin Feng. Unfortunately, before the winner of battle was determined, Yu Shengfan was…</p>\n</div>"}