{"title": "Chapter 118", "id": 118, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-118", "volume_title": "Volume 2", "body": "<h1>Chapter 118</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Of course, the journal was not the only content. There were also various color printed photos. The photos were made of high-grade paper, perfectly preserved in a photo album. Surprisingly, on it was countless in-game screenshots containing sceneries from “Eternal War”. Within it, there was the sky castle, the unfathomable abyss, the vast dunes, the southern Alps, the northern isles…</p><br/><p>The online gaming world of “Eternal War” was widely known for its magnificent beauty. It had almost achieved the pinnacle of online gaming graphics. Even the main storyline and the side stories were remarkable.</p><br/><p>Initially, plenty of players had started playing this game purely as a stand-alone game. It was absolutely capable of providing the atmosphere of a huge 3D console game. The truth was that, the games that Yu Shengfan played mostly were the stand-alone games. To her, playing alone quietly was good enough, and there was no need for her to interact with others. After all, everyone hated her.</p><br/><p>There were also some players who treated their in-game roles as casual passerbys, simply traveling and sightseeing “Eternal War”, not getting involved in any conflicts. This game was actually also a game catered for couples. Plenty of couples had played this game together, exploring places of wonder for couple selfies. It was exceptionally romantic.</p><br/><p>Within this compilation of sceneries by Yu Shengfan, that beautiful swordmistress would often be featured. Her appearance embodied the beauty of a heroine made perfect. She clearly prioritized beauty above the attributes of her equipment. The one who stood beside her had to be an assassin character, emanating a dark and mysterious aura all over him.</p><br/><p>Although they did not look like a couple, together they stood on the highest peak of the sky castle, overlooking all beings through the spreaded sea of clouds. Together, they stood, side-by- side, facing the deepest pit of the unfathomable abyss. Together, they stood among the vast dunes that merely served as a hunting ground. Together, they were silhouetted, enjoying sunrise and sunset at the highest peak of the southern Alps. Finally, on a mysterious isle in the northern seas, a tombstone was built by Yu Shengfan herself.</p><br/><p>She had laughed and said that she would want to be buried here if she dies… Of course, Lin Feng had thought that his Little Fish was joking, how would a character in the game die? Even if they accidentally die, at most, they would lose some money and experience points.</p><br/><p>He did not know that Little Fish never died before, even once in the game. She told Lin Feng that if she is ever killed in the game, then she might actually be dead. Simply because The world she lived in was the gaming world.</p><br/><p>Lin Feng felt that this “Internet Addicted Girl” was even addicted than he was, but to him, it was not a bad thing at all. That was because the gaming world had unlimited wonders and possibilities, while the real world was just a continuous loop. There is not much difference between spending a lifetime compared to spending a day. This was because most people are repetitively doing the same old boring job like robots for every single day of their lives.</p><br/><p>Reality was just a crappy game!</p><br/><p>The only time Little Fish ‘s character died was in the final duel facing Lin Feng. It was as if it was an inevitable destiny for her.</p><br/><p>At that moment, Lin Feng had never even thought of this. The free arena they were in had no death penalties.</p><br/><p>In a mysterious isle further far north of the northern seas, Little Fish used her ethereal voice of a little girl and sang to Lin Feng-</p><br/><p>If there’s still a time before darkness comes</p><br/><p>I want to forget your eyes</p><br/><p>Spending my pathetic life</p><br/><p>With dreams left unattained</p><br/><p>Waking up to this ridiculous life</p><br/><p>Drifting southwards over the southern mountains, falling off the north with sorrow</p><br/><p>The southern mountains covered by grain stacks</p><br/><p>Blown by the southern winds over to the northern seas</p><br/><p>To a sea-full of tombstones</p><br/><p>Lin Feng had never heard of this song, but it cried out to his heart. He never thought that a noisy little missy like Little Fish would sing something this melancholic and abstract.</p><br/><p>Such a song did not match Little Fish’s style. For someone belligerent like her who welcomed a life of rowdiness and stirring up trouble, she should be singing something bright and lively.</p><br/><p>Lin Feng was actually quite envious towards Little Fish. To him, Little Fish had a good family background, and she never had to worry about any financial problems. Her parents seemed to completely let her do as she pleased. She could recharge without any hold back in her games. This kind of life was simply just perfect for Lin Feng. His parents had forced him to study since young, forever preventing him from playing games. They did not understand his dreams and desires at all. How could these old fossils be his parents!</p><br/><p>At that moment, Tang Yongkai noticed Lin Feng flipping through the photo album. He then came over his shoulder and teased the boss. “Did that troublesome Little Fish, that golden twin ponytailed Lolita actually fall in love with a big, fat, middle-aged otaku like you? She even took those scenes together with you, pfft, that is just so sweet!”</p><br/><p>Lin Feng only flashed back a slight smile. The moment he chose the game and gave up on love and family, he would not be moved anymore. It was just that this girl Little Fish still made him feel warm inside. Actually, he had only treated her as a sister or perhaps as a daughter, especially after meeting up with Little Fish for the first time in the real world.</p><br/><p>After looking through the photo album, he read the diary. Lin Feng’s smile vanished, and never returned again.</p><br/><p>“Today, I met a player with the IGN ‘Shadow Rogue’, he was very strong But of course, I am the strongest!”</p><br/><p>“What a sorry soul. Like me, he did not have anything else except the game.”</p><br/><p>“It seems that he has a good bro, a hopelessly noob, dumb rogue.”</p><br/><p>“… Never thought that I would end up becoming his companion, and it doesn’t feel so bad”</p><br/><p>“Why do I love to go one-on-one? That’s because I wouldn’t let anyone down. How much time do I actually have left with this game?”</p><br/><p>“When you are sad, don’t tell anyone, smile more, talk more.</p><br/><p>When you are sad, put on the earphones, start playing games, enjoy it.</p><br/><p>When you are sad, eat your favorite food, pills that come in various flavors are the best.</p><br/><p>When you are sad, squat down and hug yourself, but don’t cry, there is nothing to cry about.</p><br/><p>When you are sad, pretend to be happy, you can forget about yourself when you are playing games with him.</p><br/><p>That way, you will never be sad anymore.”</p><br/><p>“Old Lin, initially I wanted to leave the game silently but it seems that I am very selfish. At least there will be someone who still remembers that I, Yu Shengfan, came into this world.”</p><br/><p>“I want to live in your glory forever.”</p><br/><p>“Lastly, please listen to my wayward request. I hope that you can get your family’s approval in place of me. I hoped that daddy and mommy could scold me, but there is always only me scolding others, it’s truly something regrettable.”</p><br/><p>Lin Feng did not know how he could describe his current mood. He even thought that Little Fish was only fooling about. After all, Little Fish was very playful.</p><br/><p>Before, he thought that he would never be moved by anything in the real world, but with Little Fish leaving suddenly, it jolted him up. In this world, dreams and desires were indeed important, but perhaps there was something else as important, such as family, friends, and lovers.</p><br/><p>From then onwards, Lin Feng no longer acted like an NPC of a game. He decided to make an effort towards understanding his parents, and to at least use a normal person’s attitude to face this crappy game called reality…</p><br/><p>This brought the personal charisma of Lin Feng out to the next level. He suddenly understood why he could not achieve the title of “The Strongest King”. The reason was simply that he actually despised his teammates, initially. His conceited presumed that his teammates did not deserve him at all.</p><br/><p>Little Fish’s departure would turn Lin Feng into a perfect gaming God who truly cared about others, a total 180 twist from an old adolescent male, haunted by delusions and insecurities.</p><br/><p>This was what Rosemary had tried to achieve with Little Fish’s death…</p><br/><p>At that moment, all of “The Strongest King” readers celebrated Rosemary’s sudden wave of 20 chapters. Some of the tycoon readers did not even read the latest chapters, but tipped a Sect Master right away!</p>\n</div>"}