{"title": "Chapter 131", "id": 131, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-131", "volume_title": "Volume 2", "body": "<h1>Chapter 131</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Youyue had tried her best to initiate the downfall of “War Heroes”, intending to make a quick exit, as she wanted to experiment and therefore determine the cooldown time of the “Two Dimensional Gate”.</p><br/><p>That’s right, the “Two Dimensional Gate” has a cooldown timer. Perhaps it was somehow related to the willpower of the character that Zhao Youyue possessed, or perhaps it was related to Zhao Youyue’s psychological state, or it even depended on how much she has affected the literary world itself.</p><br/><p>At this moment, the “Two Dimensional Gate” was in its cooldown state.</p><br/><p>All Zhao Youyue wanted to do was to end this war film arc quickly, so that she can move on to the next realm and craft up a new character.</p><br/><p>Of course, rushing all this would not make her feel any better.</p><br/><p>Zhao Youyue did not worry about it, as the “Two Dimensional Gate” will eventually open up.</p><br/><p>As a result, “Tan Xiaoya”, the character card from this realm cannot be obtained.</p><br/><p>That would be the irrefutable fact.</p><br/><p>The “Two Dimensional Gate” had a hidden equivalent exchange rule. In order to acquire an iconic or a highly popular character card, one must put in the necessary effort for that particular literary world, not deviating too much from its original background. Any character that stands out like a sore thumb would be regarded as a prank and those unusual characters could not possibly turn out to be iconic, as people would quickly forget about them after laughing it off.</p><br/><p>A literary world that contains physics similar to the real world will never produce a character that possesses a superpower. Consequently, that character’s ability can never be brought into reality. Obviously, the realms that Zhao Youyue had entered were more or less as realistic as reality, even this war film is also heavily anchored down by realism.</p><br/><p>She would get the chance to obtain such a mysterious power whenever she enters a realm less bound by the conventional laws of physics.</p><br/><p>As for now, she has deliberately turned a realistic war film into a fantastical film, just to let loose for a bit.</p><br/><p>Even though Zhao Youyue did not acquire any abilities from her antics, she was still in a good mood at that moment. She had a pleasant dream that felt so real. She had a dream of resisting the Russian army by her lonesome, and it was truly a euphoric sensation.</p><br/><p>Zhao Youyue went to school like she normally did, her daily life still as ordinary as ever. But now, she has conjured up more ideas ever since entering a television series realm, and wanted to know more people who worked in the entertainment industry. Besides, she could even become a sponsor so that she could intervene things more directly, and of course, she certainly did not wish to mess things up whenever she enters the realm of a television series.</p><br/><p>For the same old reason, in order to create an iconic character, she must first cooperate with the creator. Before all else, a character must fit into the background of her literary world.</p><br/><p>Some creators fancied the thought of inserting some hidden settings into their works, using the magical world hidden in plain sight trope. If Zhao Youyue creates a something that completely did not belong, it would mean that she has ruined that literary work, even if it was just a little bit. This would also make that character useless, as that character she possesses is not supposed to have that kind of ability in the first place…</p><br/><p>On the other hand, not taking advantage of a fantastical world of magic and superpowers would also be a waste.</p><br/><p>By being realistic in a realistic literary world, Zhao Youyue will then have a better chance of obtaining that character’s ability. Meddling with the traits and abilities of a character without a care would only tear up the world. Then, it would simply end up as a dream, as too many inconsistencies will start popping up. Also, Zhao Youyue has discovered the various levels of realism of the worlds she has explored thus far.</p><br/><p>She now saw that the literary worlds would distort on varying degrees, depending on the extent of her tampering.</p><br/><p>Long story short, even though it seemed like she was just messing around, Zhao Youyue has gained much insight with regards to her abilities. This would all be a great help if she ever wants to create an iconic character in future.</p><br/><p>By not being able to leave this realm yet, Zhao Youyue has been given an opportunity to settle down and meditate on all this new information. Initially, as she wanted to leave this war movie realm as soon as possible, she went on a rampage for a day, intending to leave it on that very same day. Unlike “Pure Romance” and “The Strongest King”, where she would gradually get herself on the same channel with the plot. This was actually the correct way and attitude to obtaining an iconic character.</p><br/><p>…</p><br/><p>The director of “War Heroes”, Lin Jianzhong jolted from his intoxicated state with a start. He looked at the script that he had worked on for two days in a row and leaned back contentedly…</p><br/><p>As a creator, an artist, he had been through that “hyper-inspiration” state before, so he knew that he has created a masterpiece!</p><br/><p>Of course, that was just Lin Jianzhong’s own imagination as he had not fully snapped out of his “intoxicated state”. He certainly did not view his work as something ridiculous, he even wanted to get to filming it right now…</p><br/><p>Just before he handed over the script to the actors, he went over the script once again.</p><br/><p>Lin Jianzhong shuddered, and instantly felt as if he had just woken up from a possessed state.</p><br/><p>By the time he read through it, his whole face was bright red!</p><br/><p>He was completely buried in his own shame!</p><br/><p>Was he really that drunk for the past two days?</p><br/><p>How could he have created such a ridiculous script, this is definitely not what his ‘hyper-inspired’ state would come up with, this was some scrambled up ramblings of a child’s mind! Yup, that child was Tan Xiaoya. Her family was brutally killed, so she would usually fantasize about possessing miraculous powers, and would utilize that power without any restraint so that the whole world would tremble before her!</p><br/><p>Lin Jianzhong let out a wry smile when he knew that the past two days have gone to waste, how could he have written something so ludicrous? They had to go. All of it is to be scrapped, what the heck was he doing!?</p><br/><p>Tearing up the Russians with bare hands, explosive dumplings, flinging stones to strike down airplanes, sniping from 800 miles away, curving bullets… Lin Jianzhong suddenly realized that it would take an unusual imaginative mind to come up with so many unnatural abilities to “Tan Xiaoya”. He could probably make use of these gimmicks for future projects.</p><br/><p>Just as Lin Jianzhong made to head back to the drawing board, he received a phone call</p><br/><p>“Xiao Lin, I’m sorry to tell you this, but the studio has decided to let you go. The viewer ratings of your “War Heroes” film are seriously awful, wrap it up with eight episodes, that would be all.”</p><br/><p>“What? Didn’t they promise me ten episodes? This is just season one…” Lin Jianzhong responded disgruntledly.</p><br/><p>“Hoho, season one? Are you seriously think that there’s gonna be a season two? Giving you two more episodes is the maximum limit, don’t forget that some sponsors have pulled out of the project, there’s no way you can make it with ten episodes! My hands are tied, I’m just giving you the news, goodbye!”</p><br/><p>Lin Jianzhong was dumbfounded. He put down his phone haltingly, caressing the script in his hands. His eyes were burning with rage. Two more episodes left, huh…</p><br/><p>A cornered beast is at its most dangerous state!</p><br/><p>All at once, Lin Jianzhong heard Tan Xiaoya’s undeveloped lisp ringing away in his mind.</p>\n</div>"}