{"title": "Chapter 146", "id": 146, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-146", "volume_title": "Volume 2", "body": "<h1>Chapter 146</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>One week before the monthly exam, Zhao Youyue had changed from her lazy, sluggish attitude, to a model student by using the “Xu Jing card” every day. As if the elite scholar, Xu Jing in “Pure Romance” had possessed her, she was totally absorbed in studying, not being interested in anything else.</p><br/><p>The teacher and her classmates saw the sudden change of her attitude. Mr. Qiu thought that this simple girl, Zhao Youyue has grown even more mature. Zhao Youyue had the potential in studying, and he believed that Zhao Youyue would have great results in this upcoming monthly test.</p><br/><p>He also hoped that Zhao Youyue could become a representative in this class, because the whole class was in an unstable state. While everyone was trying their best to get the first place, none of them could hold the top position in the class. The mathematics representative Chen Haoran was only strong in science subjects, his ranking in the class would drop if the science subjects are too easy.</p><br/><p>The class rep, Zhu Ran was a boy with an unassuming appearance, wearing black-framed spectacles. He too, was a forerunner the mathematics competition, but he obviously could not keep up with the pace at the very top. He does not have any particularly strong or weak subjects, while he gets pretty decent results in his language test. Although he was not a good writer like Han Leng, he was better than the average student. He was one of the top five students in class because of his above-average grades. He was a star among pupils.</p><br/><p>Comparing Zhu Ran’s results with the whole school made him an average student, and he was nowhere close to the super genius, Huang Zongchao.</p><br/><p>The homeroom teacher, Mr. Qiu thinks that this is as far as Zhu Ran can go. Zhao Youyue, who had improved the most during the last semester had much more potential now, because she had started to get serious and was putting in more effort.</p><br/><p>Those students who did not know Zhao Youyue personally would feel the aura of an elite scholar from her, her presence these days was only growing even more. This was obviously one of the reasons Zhao Youyue wanted to improve her grades, to get more attention.</p><br/><p>Zhao Youyue realized that studying could improve her presence, without her even trying it consciously. This was probably the best way for a side character to improve herself.</p><br/><p>Everyone knows that studying can enhance one’s self-improvement, but few would actually have the determination to commit to learning.</p><br/><p>Now, Zhao Youyue has become one of the few who can commit to self-learning, because Xu Jing was Zhao Youyue.</p><br/><p>At this moment, Chen Haoran could not help himself but whisper to his best friend Han Leng, “Han Leng, I don’t know if I’m hallucinating, but I feel that our classmate Zhao Youyue is getting even prettier.”</p><br/><p>Han Leng was slightly startled when he heard Chen Haoran complimenting Zhao Youyue, because he had distanced himself from her again. It was his own baffling ego that drove him to avoid Zhao Youyue, for now. Whenever he contacted Zhao Youyue via Wechat, she would always reply Han Leng seriously. She never replied him with casual, half-hearted replies like, “Hehe”, “I’m gonna eat” or “I’m going to take a bath”, while she never gave off any ‘arrogant goddess’ vibe either.</p><br/><p>Zhao Youyue was clear-minded, and she was still grateful to Han Leng for all the troubles that he had gone through to help her. She was impressed with the writing skills of him as well, but unfortunately, Han Leng had never revealed the title of his web novel to her.</p><br/><p>Zhao Youyue had a very high EQ, and she would have noticed if Han Leng treated her more than just a fellow classmate, but he never did that. Han Leng had always put up a cool and cold expression, as if it was an honor granted to Zhao Youyue, to be able to speak to him.</p><br/><p>Other girls would have hated Han Leng long ago, thanks to that off-putting attitude, but Zhao Youyue always treated everyone equally, because she was Saint Yue.</p><br/><p>Zhao Youyue had gotten used to being treated like a side character, so naturally, she would not even consider the idea of any male classmate having a fancy for her. If someone still remembers her after graduating from middle school, it was already good enough.</p><br/><p>Zhao Youyue has never dreamed of being liked by someone else, it was something she has never experienced before. In a way, she did experience falling in love with someone else in the realm of “Pure Romance”, because “Xu Jing” loved Yang Xixi.</p><br/><p>A one-sided love experience such as this was definitely not enjoyable, so she decided to block everyone out, to prevent herself from falling in love by accident. Her two self-crafted, beautiful character cards, which were “Xu Jing ” and “Yu Shengfan”, would be put to use whenever she is unable to use her smartphone. They would server as the perfect emotional blankets.</p><br/><p>Han Leng was just a teenage boy who lived in his own world. In his mind, he had already taken the initiative to talk to someone, and yet the person his attention was directed to has made no effort to carry the conversation. For someone like him, his ego and pride would definitely be wounded.</p><br/><p>In fact, Han Leng’s difficult attitude was destined to give him more trouble with girls, it was certainly a bizzare way of thinking.</p><br/><p>“Zhao Youyue? Pretty? Hoho, I think she’s just normal.” Han Leng lied.</p><br/><p>“I think that she is actually rather pretty, with her fair skin and gentle personality. Now that she has become serious in studying, I really think that she has become prettier. Too bad I did something wrong to her earlier, now she hates me.” Chen Haoran finished awkwardly.</p><br/><p>Han Leng was furious when he was reminded that Chen Haoran had nearly made Zhao Youyue cry previously.</p><br/><p>“Well, I have to disagree with you. I think Zhao Youyue is just pretty normal, I’m not interested in a short-haired girl.” Han Leng criticized arrogantly.</p><br/><p>“I know you’re the same with the other guys in class who like Jiang Qing, but I can’t help it, I like Zhao Youyue.” Chen Haoran said it without much consideration.</p><br/><p>“What? You… liked Zhao Youyue?” Han Leng nearly ended his sentence with the word “too”.</p><br/><p>Chen Haoran felt embarrassed, because his family would not allow him to be involved in a romantic relationship at a young age, but such feelings cannot be controlled. After collecting her mathematics homework countless of times, every morning, since last semester, he soon realized that he liked her.</p><br/><p>“Han Leng, you’re my best buddy, please keep this a secret. I won’t bother her even though I like her, it will just have a bad influence to our studies, if I confess to her. If I still like her during our third year, I will definitely take action. I won’t regret it, no matter how it turns out.” Chen Haoran muttered.</p><br/><p>Han Leng felt uneasy, but he cared for his buddy, and he would do anything for his best pal, so he said proudly, “Just go after her if you like her, I can write you a love letter for her!”</p><br/><p>“Forget it, I don’t wanna be in a relationship this early.”</p><br/><p>“It will be too late when you finally regret it.”</p><br/><p>“Haha, you talk funny as always, Han Leng. I’m gonna go study now.”</p><br/><p>“Tch.. I don’t get you.”</p><br/><p>ED Note:</p><br/><p>EQ Emotional Intelligence the capability of individuals to recognize their own emotions and those of others, discern between different feelings and label them appropriately, use emotional information to guide thinking and behavior, and manage and/or adjust emotions to adapt to environments or achieve one’s goal(s) Coleman, Andrew (2008). A dictionary of Psychology (3 ed). Oxford University Press</p>\n</div>"}