{"title": "Chapter 154", "id": 154, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-154", "volume_title": "Volume 2", "body": "<h1>Chapter 154</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The next day, Zhao Youyue Baidu’d for “Beautiful April” on her cell phone, on her way to school. After discovering that it was serialized on “Meng Ya”, she felt relieved. That was a good start. According to Jiang Qing Little Angel’s Encyclopedia, “Meng Ya” consisted mostly of experienced authors. Thus, quality was guaranteed.</p><br/><p>“Leng Zi” was the author’s pen name. It gave her the impression of a hipster and gave her no clues about the author’s gender.</p><br/><p>Not even for a single moment, did she relate this pen name to”Han Leng”. She had lost touch with him for more than a month, now. They were barely even acquaintances. Before this, she had sent him WeChat asking about his next novel out of curiosity. Regardless its quality, for the sake of friendship, she would still buy it.</p><br/><p>However, Han Leng always slighted her by replying with an “Oh”. It didn’t take long before she decided not to disturb him anymore. Women’s hearts could detect a needle beneath the ocean, yet, she hardly understood he was thinking. This left her puzzled.</p><br/><p>Zhao Youeyue would never even consider the possibility of Han Leng liking her. His actions have never expressed any of that. He, being misanthropic, had always teased her in messages by saying that she was too average and not as talented as him, and yet, he still looked up to her for her depth.</p><br/><p>Thanks to her good temperament, she never rebuked him. She always agreed with him. However, whenever she tries to probe the title of his novel, he would start avoiding her.</p><br/><p>Even a woman who knew how men’s minds worked might not understand him, let alone Zhao Youyue. It was obvious that he liked her, but, in a weird way.</p><br/><p>Han Leng’s did not use “Leng Zi” as his pen name for his juvenile literature novel. Being superstitious, he had used “Sour Oranges,” after noticing that most great web novelist’s pen name have been named after vegetables and fruits. It did give him the effect. What a waste, after deciding to change his direction.</p><br/><p>Nowadays, authors of juvenile literature novel must be good at writing stories that emphasized either on male protagonists or heroines. It is always more pleasurable to torture the heroine. For example, a well-known male author named Guo Xiaosi, was skillful at writing stories that emphasized on heroines. For this, he was given a nickname as Guo Siniang (Empress).</p><br/><p>In this world, authors like Guo Xiaosi are extinct. “Zui Novel” was established by a female author. Unlike Guo Xiaosi, she was not talented at business. This made “Zui Novel” rather mediocre, and was not even a competitor for “Meng Ya”.</p><br/><p>At the beginning, Zhao Youyue was a little depressed, regarding her relationship with Han Leng. She had done no wrong as far as she could remember. Why was there now a wedge between them?</p><br/><p>As time went by, Zhao Youyue gradually forgot about it, as she did not write reviews anymore. If she falls too far behind, she would activate the “Xu Jing’s card”, and write the reviews wholeheartedly. That should not be a problem, as “Xu Jing” had great respect for the teachers.</p><br/><p>A short introduction of “Beautiful April” was available online. Pirated versions did not exist, yet. This might due to it just being serialized. By the time it becomes popular, internet pirates would take action for sure, even if it hasn’t become widespread. Jiang Nan’s “Dragon Raja” for example, was free to read online. China pirated websites were badasses.</p><br/><p>Readers like Zhao Youyue was a huge anchor of support for the authors.</p><br/><p>To read through “Beautiful April” which had been serialized for 5 weeks, consisting of about 4 million words in total, she would purchase five “Meng Ya” at once. She would even tip the author if it is good.</p><br/><p>Wait a minute, one could not tip the author of physical books. However, she could still express her appreciation by sending them red packets after following their Weibo and fan pages.</p><br/><p>Of course, she had to actually like the work first.</p><br/><p>With the magazine in her hand, she bumped into Jiang Qing the Little Angel on the way to class. “Since when did you start reading juvenile magazines? You’ve made your disgust at their cheap sentimentality clearly enough! By the way, I have many of them. You can borrow from me if you want,” she said in surprise.</p><br/><p>“I overheard one of our classmates who is good in writing saying, to improve our own essay writing, we must read and take notes from all sources available. So, I decided to buy “Meng Ya”. The writing style of its authors is excellent.” Zhao Youyue replied firmly, trying to conceal her real intentions.</p><br/><p>Although astonished, she understood why Zhao Youyue wanted to improve her essay badly. Recently, Zhao Youyue has become the top student in the class.</p><br/><p>This wouldn’t go unnoticed by the entire class. It was already early May and the midterm exams were coming soon. Would she be able to maintain her amazing performance?</p><br/><p>Everyone in the class witnessed this exchange, including Han Leng.</p><br/><p>He was startled after spotting those five magazines. His new literary work had just been serialized for five weeks. Maybe he was overthinking.</p><br/><p>Being allowed to read the magazines during the morning reading period, Zhao Youyue found herself enjoying the latest “Meng Ya” issues. Many a time, she had proven to Teacher Qiu that she would memorize the contents of their lessons at home. She was unafraid of being tested again.</p><br/><p>On top of that, Teacher Qiu was rather lenient on her, due to her previous results. Well, this were the special rights of the top student.</p><br/><p>Before entering the main story itself, a foreword where “Leng Zi’s” harshly criticized the chaos created by typical juvenile literary works nowadays caught her eyes. This resonated with her thoughts. She, too disliked “abortion” as the common expression of pain.</p><br/><p>“Leng Zi” even firmly expressed that</p><br/><p>This would be a high school comedy, complete with a happy ending catered for lovers!</p><br/><p>Translation Note:</p><br/><p>1. Women’s hearts are like needles beneath the ocean (,) – Proverb which refers to the inexplicability of women’s hearts</p>\n</div>"}