{"title": "Chapter 168", "id": 168, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-168", "volume_title": "Volume 2", "body": "<h1>Chapter 168</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Well, Zhao Youyue did not have to predict the general response. The response of her friend, Jang Qing Little Angel, who was a loyal reader of “Meng Ya,” was enough to tell Zhao Youyue that she really liked “Chu Luoxun”!</p><br/><p>Unlike Zhao Youyue, who was lazy to read other serialized articles and short web novels, she would not buy the magazine just to read the “Beautiful April.” However, Zhao Youyue cannot be blamed as she was busy, juggling between schoolwork and her streamer job as “Yu Shengfan.”</p><br/><p>So far, the number of audience remained consistent at two to three thousand, and her total amount of views was only between twenty to thirty thousand. The data should be reliable. Basically, they liked her strong personal style, having such a venomous tongue. They considered this as a God-level roleplay.</p><br/><p>Previously, “Yu Shengfan” astonished those manipulators on her live stream by singing “South Mountain.” Then, it had attracted more of them to watch her, hoping to hear it again. But, Zhao Youyue managed to restrain her desire to sing.</p><br/><p>Well, after being “Chu Luoxun,” she had become critical about this song which she had sung when she was Little Fish. She hoped that she could someday perform the song perfectly to all the manipulators, showing them what real music was!</p><br/><p>This perhaps was the aftermath of her indulgence in “Chu Luoxun.” While it was a given that the audiences would resonate with the music, “Chu Luoxun” pursued the almost divine state in her music that could bring them into a new world, stealing their souls away with its goodness.</p><br/><p>Words can barely describe this sensation. But, to those who had wholeheartedly listened to her music were intimate with it, it is such pleasurable feast on the ears</p><br/><p>As a loyal reader of “Meng Ya,” Jiang Qing Little Angel would eagerly share a good article with Zhao Youyue whenever she reads it. Most of all, she would comment on short novels, where they can finish reading it at once and start chattering about it. Attaining mutual understanding pleased them both.</p><br/><p>Yup, it is certainly a delightful thing if a good article is validated by the one who has been recommended to it.</p><br/><p>Considering Zhao Youyue’s fussy personality, reading a tedious article is impossible. Moreover, as a juvenile novel magazine, there were many sarcastic, affectionate and hipster articles inside “Meng Ya” too. Their writing style was exaggerated, making the plots interesting, unlike a full-mark essay. This was what Zhao Youeyue wanted.</p><br/><p>Although there were many elegant writing styles in “Beautiful April,” Zhao ] Youyue did not hate it because they had just the right amount of detail. Those styles did help create the right atmosphere at the right time.</p><br/><p>For instance, without it, “Chu Luoxun” would not have been poshed up, due to her partial appearance before.</p><br/><p>This is why the antagonists in most hollow literature would be incapable idiots, due to the author’ s inability to do otherwise.</p><br/><p>However, too much of this writing style in some overwhelming plots would make it look insightful, reducing it to merely a scam in the form of meaningless words. Zhao Youyue despised such articles.</p><br/><p>She certainly will give these creators a lesson if she comes across such convoluted articles again. They should not exist.</p><br/><p>“Miss, finally, she has appeared!” Jiang Qing told Zhao Youyue excitedly when she read the first appearance of “Chu Luoxun.”</p><br/><p>“Who?” Zhao Youyue asked back, pretending as if she did not know, although she was up to speed on the latest issue.</p><br/><p>“Chu Luo Xun! Didn’t you say that this character is the one you were anticipating the most after you finished reading last month’s “Beautiful April”? Chu Luoxun has made her full appearance now!” Jiang Qing Little Angel quickly replied. She was so nave, totally believing in ZhaoYouyue.</p><br/><p>As calm as usual, Zhao Youyue smiled and asked “How is it? Did Leng Zi write well?”</p><br/><p>“It is awesome! The way she appeared is totally unexpected. I thought that she would be surrounded by light and all of the audience would be blown away by her music, admiring herBut, she was happily feeding a cat with a cake, alone!”</p><br/><p>Jiang Qing Little Angel said in a very exclamatory tone, still unable to get over this unpredictable scene. But, she deliberately warmed the heart of every reader with her happiness in that scene. Everyone seemed to become that cat</p><br/><p>Obviously, the author had slapped those readers who predicted “Chu Luoxun” to be the antagonist. How could a positive girl, whose personality surpassed the heroine, be the bad guy?</p><br/><p>Jiang Qing Little Angel continued her reading in full of surprise, exclaiming each plot that had Chu Luoxun, then excitedly said “Leng Zi totally made Chu Luoxun livelier than the main characters. If I can travel into that world, I will definitely not miss her concert and get her signature!”</p><br/><p>After seeing that Jiang Qing was more excited than her, Zhao Youyue recalled that Jiang Qing loved music too. She was an arts and literature committee member, and a good singer too at that!</p><br/><p>In addition to Jiang Qing’s optimistic personality, this probably made her resonate deeply with Chu Luoxun, this goddess character, easily placing her in that character’s position!</p><br/><p>Zhao Youyue began to worry that, along with the revealing of the foreshadowed ending of Chu Luoxun, would Jiang Qing Little Angel become a malefic person</p><br/><p>“What a miracle! The sound of the violin played by Chu Luoxun is revolving around my ears! Have I gone crazy? I could hear the music just by reading the article!” Jiang Qing was awed.</p><br/><p>“You are not crazy; the article was really written well! This is the charm of words, just like how you will salivate when you are reading a well-written gourmet novel “Zhao Youyue explained.</p><br/><p>“Oh, I See!Leng Zi is truly awesome, and so is the musical goddess, Chu Luoxun!” said Jiang Qing Little Angel, who had totally joined the “Chu Luoxun” fangirl club.</p><br/><p>She did not know that the real “Chu Luoxun” was sitting right beside her</p><br/><p>Meanwhile, “Beautiful April” had stirred up a youthful storm on the internet!</p>\n</div>"}