{"title": "Chapter 187", "id": 187, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-187", "volume_title": "Volume 2", "body": "<h1>Chapter 187</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After such a revelation, Han Leng’s writing would carry a bias that leaned towards “Chu Luoxun.” In the previous serialized six issues, she was still a junior high school student and the high popularity character of the book that many would talk about. As popular as she was, she had remained a side-character, as she never fully appeared. This all changed since the last issue. She started popping up everywhere.</p><br/><p>After Han Leng began to have a bias towards her, dog food feeding between Gu Yuan and Lin Meiyue became another question.</p><br/><p>This was no speculation that has been carried out without any basis, as a creator’s favoritism had its limits too. When a character becomes his favorite, other characters are bound to be restricted.</p><br/><p>One would notice it by reading the previous issue of “The Strongest King.” Many characters started living under the shadow of Xiao Yu, as she was too charming and spectacular. This caused the readers’ eyes to be filled with nothing but Xiao Yu, thinking that, well, it is just another main character being added. As for the other NPCs [1], why should they care?</p><br/><p>The experienced Ye Hai chose to let Xiao Yu send out the bento and make it seem like she had been trapped in her own “duel to the death, of a chess game.” Then, she committed suicide to seek a way out</p><br/><p>Ye Hai succeeded. After the death of Xiao Yu, “The Strongest King” slowly became an ensemble cast which remained as interesting as usual, without her dimming the light of the other characters anymore. Its Doujinshi products and merchandise started selling great too, and it soon became a common sight at anime conventions.</p><br/><p>Besides that, the most successful thing about it was there were people who still felt sorry for her and had debates about her, long after her death. They even started carrying out hypothetical battles of her against other opponents she had never met before, coming up with a consensus on how she achieves victory there.</p><br/><p>These kinds of “Xiao Yu power level discussion threads” had started flooding up many forums, Tieba and QQ group. Ocassionally, someone would bring up a new topic, saying that Xiao Yu was the strongest player in “The Strongest King” and that she would be unbeatable if she had a healthy body!</p><br/><p>Since there were so many people who flattered her, more will attempt to rebuke her skills, claiming it was obviously indicated in the article, that Xiao Yu’s skills improved immediately after she got on medications. Even though she took those pills for the sake of lengthening her life, they had contained analeptics. By this, her true capacity was incomparable with Lin Feng, the main character. She would be a pretty skilled player, but she couldn’t possibly be number one.</p><br/><p>Thus, both of the parties began with their war of words. Those who flattered Xiao Yu definitely thought that “Unpleasant Night Rain Rhythm, the Sword set the world alight” made Lin Feng slightly inferior. If she was given 5 more seconds, Lin Feng would have lost!</p><br/><p>On the other hand, the gang of rationalists thought that they were a bunch of unreasonable, carefree fans. It was obvious that the judgment was made by the early death of Xiao Yu and this had increased the relevance of subjective emotion too. They acknowledged the talents of Xiao Yu, but they did not admit that she, who has never fought a professional player before would be able defeat them upon entering the circle of professionals. Her victories had simply come because those players were careless</p><br/><p>Such is the fate of an iconic character. Readers would not forget about them and would feel sorry for them whenever they are mentioned, becoming emotional for them, debating over them. The more their merchandise is sold, the more it showed how much people were in favor of them.</p><br/><p>Although she was dead in her canon, she would live forever in their hearts.</p><br/><p>Actually, Zhao Youyue should not have carried out her live streaming at the “Douyu Streaming Platform.” Perhaps, she should have gone to the B studio as it hosted many subscribers of “Yu Shengfan.” The B studio had almost been slaughtered by the varieties of MAD [2] concerning “The Strongest King.” As a miserable two dimensional character, the chances for “Yu Shengfan” appearing in a MAD was high!</p><br/><p>Unfortunately, Zhao Youyue had already signed the contract with Douyu. She definitely would be streaming by using the “Yu Shengfan Card,” yet, she would restrict herself from firing away on the bullet curtain. It would be sufficient just to satisfy her sarcastic mouth, and she would not have to type to get it out.</p><br/><p>Frankly, the audiences loved pretentious live-streamers. It was perfectly justifiable for a skillful live streamer to taunt his opponents. As for the teammates, one would throw the pan once he loses. He could do so, as long as he achieves a good score.</p><br/><p>Anyway, neither the teammates nor the opponents would be able to refute his skills. It all depended on the live streamer</p><br/><p>Zhao Youyue, who had been playing “League of Legends” for so long, knew she could taunt people in this game by pressing the Ctrl + number that made her character dance playfully, or show the dog tag, without having to type the words at all.</p><br/><p>Of course, if someone dares to scold her, she would return fire under the influence of the “Yu Shengfan Card.” She only restricted Xiao Yu from berating in the first place, but it did not mean that she would remain silent if someone challenges her.</p><br/><p>She would definitely beat that person up and then taunt him. Such satisfaction!</p><br/><p>Zhao Youyue believed that the subscribers of “Yu Shengfan” would increase, as she had granted “Yu Shengfan” much popularity by her own power. If her own strength gets her this far, the “Yu Shengfan Card” would surely be far more effective!</p><br/><p>Otherwise, it would be like what had happened before. Many of the passer-by Douyu browsers only recognized her as a female live streamer who liked to scold people, without knowing who “Yu Shengfan” really was. Not everyone would have read or watched the anime in the first place.</p><br/><p>Speaking of anime, Yu Jing’s first work, the “Pure Romance,” must be mentioned. It was in the middle of May now, and it would be introduced on TV in April. However, it was already available online, while the TV station would only play it late at night, because it was obscene. Children might not be able to handle it!</p><br/><p>It was initially planned for 12 episodes to be released per season. Under such circumstances, several changes were made. Xu Jing no longer started off as a side character, but a hypocritical and Tri-no elite scholar, with an overloaded sense of presence. She was the only innocent one in the animation. As the other female characters got shoved down by all kind of scumbags, she just stayed silently on the sidelines</p><br/><p>The manga readers eagerly awaited. They waited for the mind-blowing finale.</p><br/><p>However, the innocent audiences who have never read the manga waved it off as another form of typical fanservice riddled fluff. There were probably more of them than the manga readers. They did not even watch the preview or run through the original work; they were just watching it by chance. They would only discover at the end that this “Pure Romance” is insane!</p><br/><p>The only thing that came under fire was the voice actress of “Xu Jing.” She did not give off the feeling of a hypocritical and Tri-no elite scholar. This iteration of”Xu Jing” was lacking in that inexplicable, imposing manner</p><br/><p>Su Li, the original mangaka, also criticized it herself. She even complained about it to Ye Hai, whom she had a good relationship with now.</p><br/><p>When Ye Hai recalled this, he frowned. He must not let a voice actor ruin Xiao Yu!</p><br/><p>One must know that the production of “The Strongest King” animation was in full swing, and the voice actor selection was about to begin. It would start screening in October, and it would be a long-running animation like One Piece!</p><br/><p>Ye Hai wanted to take charge in deciding the voice actor candidate of “Yu Shengfan”</p><br/><p>Translation note:</p><br/><p>[1] NPC is the abbreviation of the non-player character.</p><br/><p>[2] MAD can be understood as a “secondary creation image,” which is a “movie” made by using existing material, modifying, editing and other “secondary creation” and music. The difference is that the focus of the MAD film is on the film, paying tribute to the animation or video game. The focus of the relative MV is on the music.</p>\n</div>"}