{"title": "Chapter 194", "id": 194, "volume": 2, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-194", "volume_title": "Volume 2", "body": "<h1>Chapter 194</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“She is here?” Su Li quickly looked around, “Where is she?”</p><br/><p>Ye Hai and his wife looked around too, especially Li Mengyao. She was keen on meeting this “Ah Yu,” the female live streamer, feeling that she was an unpredictable person. How did she pull off a perfect “Yu Shengfan” roleplay? Were there any hidden agendas?</p><br/><p>“I can’t see her! I only see an aunty walking by. I don’t think she is “Ah Yu’. Although she may not be a beauty, it is impossible for her to be an aunty, right!” Su Li went on to say.</p><br/><p>“Oh? You just said that I am getting more beautiful, so why do you change your mind now?” The smile on Zhao Youyue’s face grew wider. She still loved to tease Su Li as usual.</p><br/><p>While Su Li still could not get it, Ye Hai’ eyes had bulged out, looking at Zhao Youyue in wonder. What she had said just now was indirectly admitting that she was “Ah Yu,” the female live streamer, right?</p><br/><p>“You are “Douyu Yue Shengfan”? That is impossible, Lady Zhao! You are doing the live streaming, at your status?” Ye Hai could not hold back, and blurted out.</p><br/><p>“I am me, what’s wrong with me doing live streaming? I cannot let “Xiao Yu” be forgotten. Although she has died in the novel, she is now back to life in reality. Now, the popularity of my live streaming is increasing! Someday, everyone will know that a two dimensional character has come to the three dimensional world!” Zhao Youyue replied.</p><br/><p>Ye Hai was completely dumbfounded. He could not refute her at all. She is a missy, so what? Why couldn’t she do live streaming? She did so not for the money, but love!</p><br/><p>Passion and love would bring out the most convincing role plays ever!</p><br/><p>That’s right! If it was not for love, it would be impossible for her to imitate “Yu Shengfan” to such uncanny levels. She had even composed the full version “South Mountain”! Did this mean that she was good in music too?</p><br/><p>Of course, she was! She had shown her consummate violin skills on her live streaming before! Therefore, it was not unusual for her to be able to compose “South Mountain” all by herself, even completing the lyrics</p><br/><p>After discovering that Zhao Youyue was “Ah Yu’, he really could not describe his mixed feelings at that moment. It left him a little upset.</p><br/><p>Before this, he was thinking that she must be his fan, as Ah Yu was so good at cosplaying “Yu Shengfan” and did not even hesitate to meet himwell, he was no narcissist, as this surely would cause a normal man to have improper fantasies. However, he had sternly took a stand against it, by bringing his wife along. After all, he was a good man!</p><br/><p>Before this, he had assumed that Ah Yu would not be such a looker, as she has refused to turn on the camera, no matter what. The person behind the voice could be a big, fat otaku, for all you know. It was impossible for him to forego his beautiful wife for a big fat otaku, right?</p><br/><p>Nonetheless, the fact has shown that it was all his misconception. Perhaps this was similar to the misconception of “I can kill it” while playing the game!</p><br/><p>It turned out that “Ah Yu” was Lady Zhao, a beautiful young girl whose face score was the highest among the three ladies here. She is definitely uninterested in a married uncle like him. This was evident, be it from their online conversations, or her calm when she met them.</p><br/><p>Finally, Su Li realized it. She quickly hugged Zhao Youyue and buried her face in her boobs. Then, Su Li snapped “Missy; you have already known about it during our previous dates, didn’t cha? You played us for fools!”</p><br/><p>Zhao Youyue was in her arms. The mixture of the perfume and Su Li’s body fragrance was quite pleasant to smell. After all, she was a Godly Mangaka, and the perfume she used were of a high standard brand recommended by Zhao Youyue.</p><br/><p>Moreover, The Great Mangaka Su was a virgin. She seemed to be falling into the evil path of Yuriness, especially since her works contained so many Yuri scenes!</p><br/><p>“Don’t be like this, Sister Li. I wanted to give y’all a surprise. Come, let’s head in. I have booked a private room, ensuring a peaceful environment where we can talk about business while sipping tea!”</p><br/><p>Zhao Youyue freed herself from Su Li’s arms and brought them into the business club. A waiter attended to them once they entered.</p><br/><p>After knowing that “Ah Yu” was Zhao Youyue, Li Mengyao’s ill feelings toward “Ah Yu” were resolved. Most women had very strong intuitions, and she was very familiar with Zhao Youyue through the internet. After all, the four of them had been in the same discussion group before, and she had added her as a friend too.</p><br/><p>Li Mengyao did not believe that a blessed girl like Zhao Youyue would be interested in her husband and, likewise, his husband would not be interested in her too. After all, she had not even reached sixteen years old</p><br/><p>At that moment, Ye Hai suddenly realized that the reason “Ah Yu” had not hesitated to meet him and did not see him as a liar was because the suggestion he made was realistic. However, Zhao Youyue had done a nasty job of hiding it and dropping the bomb during this meeting!</p><br/><p>Although Ye Hai was quite sure that Zhao Youyue was “Ah Yu,” and her voice sounded familiar too when he thinks about it, after settling down himself in the private room, he could not resist but to ask “Missy, why don’t you imitate “Yu Shengfan” nowYou know my intention of coming here. I really want you to dub for Xiao Yu. I strongly believe that this will not degrade this character, as long as you unleash that godly imitation that you do during your live streams.”</p><br/><p>Once Ye Hai said this, both Su Li and Li Mengyao showed great interest. This made Su Li recall the incident where Zhao Youyue had roleplayed “Xu Jing” in front of her, previously. It had terrified her. The point was Zhao Youyue even had her hair done up in a ponytail</p><br/><p>Zhao Youyue took a sip of the tea, and without further nonsense, she initiated the state of “being possessed by Yu Shengfan.” If she were playing a game now, she definitely would not be able to resist her desire to talk and let out her venomous tongue, but, she was not.</p><br/><p>Actually, Yu Shengfan was a rather quiet girl by nature, surrounded by a deep abyss of loneliness. It seemed that nothing would trigger her interest, except games.</p><br/><p>When not in front of a screen, she would be as silent and docile as any other. This setting had been set by Ye Hai, but whether he remembers it, was a different story.</p><br/><p>“I am “Yu Shengfan.” Are you the despicable creator who caught me unawares in the novel world? You would not have thought that we would meet again, right?”</p><br/><p>The Lolita voice of “Yu Shengfan” which Ye Hai could not ever forget appeared again!</p><br/><p>It was you!</p><br/><p>It was you for sure!</p><br/><p>Looking at Zhao Youyue, Ye Hai’s eyes glinted</p>\n</div>"}