{"title": "Chapter 202", "id": 202, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-202", "volume_title": "Volume 3", "body": "<h1>Chapter 202</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After reading Han Leng’s message, Zhao Youyue did feel that anything was off. She was not like Han Leng who could imagine a plot with millions of words.</p><br/><p>Well, this was the greatness of a creator, to be able to turn anything into an article.</p><br/><p>Zhao Youyue simply replied “Are you sure, The Great Scholar Han? Don’t we see each other in school every day, and you seem to smile more often recently. Anything good happened?”</p><br/><p>Her tone was as cold as usual, even the same in replying messages. However, she would sometimes add emoticons to act cutely, even if her heart was dead inside.</p><br/><p>This had to be the attitude of a saint person. One word was enough to describe her—calm.</p><br/><p>She had replied instantly, as she happened to be playing her phone on her bed after taking a shower. As planned, today was another session of her troublemaking. “Beautiful April” was already half-way through the plot. Although the reaction of the readers was different from what she expected, it still fulfilled her plans.</p><br/><p>Indeed, she never thought that many readers would ship ‘Chu Luoxun’ and Gu Yuan, the male protagonist. They seldom interacted with each other in reality, and they did not even have each other’s WeChat. ‘Chu Luoxun’ would find Lin Meiyue whenever she wants to contact Gu Yuan.</p><br/><p>This was the reason why Lin Meiyue was not worried about ‘Chu Luoxun’. This perfect Goddess ‘Chu Luoxun’ was such an honest person.</p><br/><p>From any aspect, she seemed to be selfless. She wanted to save Gu Yuan from the chasm, while unreservedly teaching Lin Meiyue how to play the violin. This had improved Lin Meiyue’s skills tremendously.</p><br/><p>For Lin Meiyue, Chu Luoxun was her most respected grandmaster, her role model. She wished to become outstanding like her someday, getting others’ attention whenever she goes. She also hoped to catch up to Gu Yuan in terms of music.</p><br/><p>‘Chu Luoxun’ would not be like this, if it was a love triangle. She would have been described as a very jealous person.</p><br/><p>However, she had been described as a benign and openhearted person, without any trace of jealousy at all. She was very happy to see Gu Yuan and Lin Meiyue being together.</p><br/><p>Could someone tell if a girl likes a guy, when she has no jealousy?</p><br/><p>This was the reason why Lin Meiyue’s fan club did not hate “Chu Luoxun,” there was no reason for them to accuse her of anything.</p><br/><p>It would be strange for a “mistress” to behave like this, right?</p><br/><p>Plus, the fan club of “Chu Luoxun,” which was especially fond of imagination, believed that everything had already been expressed through music, and even perceived that ‘Chu Luoxun’ had confessed, with the phrase “the moonlight is so beautiful” was obvious. Then, Gu Yuan had responded to her too, by using a song that told the tale of April</p><br/><p>Their souls had truly interlinked, and in a sense that transcends their dimension, they were a couple!</p><br/><p>However, everything was merely their imagination and fantasy. They had to admit that Lin Meiyue’s status as the girlfriend was unshakable. They could not call her “bitch” either, as she had no agendas of her own, and she did not even know how to keep a firm grasp on the male protagonist. Luckily ‘Chu Luoxun’ assisted her through every step, or else, her bestie would have ruined everything.</p><br/><p>If Lin Meiyue were a calculative person, she would have disagreed to letting ‘Chu Luoxun’ and Gu Yuan perform together. She trusted both of them; they were merely partners in music.</p><br/><p>Even the fan club of ‘Chu Luoxun’ could not bear to hurt such a nave and sentimental, cute girl!</p><br/><p>Lin Meiyue represented the most beautiful form of romantic first love, and who would not want a fruitful ending with his first love?</p><br/><p>In conclusion, the “Beautiful April” was already half-way through the plotline, a work which goes against the typical juvenile novel where the male protagonist and the heroine are persistently hesitant in confirming their relationship. Even those dog blood love triangle plotlines in other novels would appear to be tragic when compared to this piece of work. However, some readers were saying that they could not see through “Chu Luoxun,” unsure if she was telling lies.</p><br/><p>Well, perhaps the secret of ‘Chu Luoxun’ would be revealed at the end of the story?</p><br/><p>Anyway, this atypical juvenile novel found unexpected success!</p><br/><p>A certain teen film director expressed in his Weibo that this work was very suitable to be adapted into a film, and he would love to do it</p><br/><p>He was badly criticized as his previous teen films had consisted heavily of dog blood love triangle and abortion plots. He would have ruined the original work, right?</p><br/><p>Furthermore, the fan club of ‘Chu Luoxun’ had affirmed that no one would be able to play this girl’s role in reality. Do not let the Goddess Chu be humiliated by those actresses.</p><br/><p>Zhao Youeyue also participated enthusiastically in the debate of these two gangs, and of course, she belonged to the fan club of Lin Meiyue. The perfect first love was the best, and the dog food it served was very delicious. As for “Chu Luoxun,” she could just become the bgm [1].</p><br/><p>As the story has now come to this state, ‘Chu Luoxun’ had undoubtedly become the most popular character.Zhao Youyue could already gain the character card if she stopped now. Nonetheless, she refused to do so, having gone through the painful lesson of “Yu Shengfan.” What would she do if Chu Luoxun does not die and Leng Zi continues to write about her?</p><br/><p>She even worried that Leng Zi would lose his mind and join the fan club of “Chu Luoxun,” becoming biased, himself. That would be interesting!</p><br/><p>Therefore, she would only be at ease by using death to withdraw from the scenes. Everything would be set in stone, by then.</p><br/><p>At that moment, Han Leng instantly received Zhao Youyue’s reply. Usually, he would be fantasizing something between the two of them, but his mind was now occupied by his Goddess Chu, so he did not feel anything for the girl who was merely a side character</p><br/><p>“Indeed, something good happened!”</p><br/><p>“Oh, what is it?”</p><br/><p>“I have someone that I like.”</p><br/><p>“That’s great! Very interesting. Who is the girl who is able to cause a flutter in The Great Scholar Han’s heart?” Zhao Youyue began to be interested and asked in curiosity.</p><br/><p>She did not have any unusual reaction after knowing that Han Leng had someone he liked.</p><br/><p>Han Leng noticed Zhao Youyues simply wanted to gossip. He sighed. What he had thought previously was merely his imagination.</p><br/><p>Nevertheless, his spirits were raised after thinking of the Goddess Chu and said, “She is not from our school, but what I want to say is that she is perfect, even better and prettier than you!”</p><br/><p>Now, Han Leng no longer cared about Zhao Youyue’s feelings. He blurted told the truth.</p><br/><p>Zhao Youyue smiled kindly after reading the message. She was genuinely praying for the happiness of Han Leng and that he could be together with the goddess soon.</p><br/><p>Han Leng was ashamed to tell that the person he liked was the character in his book</p><br/><p>“So, what is your purpose of finding me this time? Not just to tell me this, right?” Zhao Youyue faintly asked.</p><br/><p>Translation Note:</p><br/><p>[1] Bgm is the initials of background music.</p>\n</div>"}