{"title": "Chapter 205", "id": 205, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-205", "volume_title": "Volume 3", "body": "<h1>Chapter 205</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The ensemble of Gu Yuan and Lin Meiyue was indeed very successful. However, Gu Yuan’s piano was the main character while her violin was merely an accompaniment</p><br/><p>Gu Yuan had never thought of trying to improvise with Lin Meiyue; he played according to his tempo. In the beginning, it seemed like he was venting his anger out. Then, he thought of his mother, who loved him the most, again and not his inner demons.</p><br/><p>The reason his mother had treated him so strictly was due to the fact that she was running out of time. She felt that desperate urgency. She hoped that he could perform according to the taste of the judges. The more prizes he won, the more popular he would become. At least, he could make a living by playing the piano.</p><br/><p>As they performed, Lin Meiyue felt for the first time, the stark difference between her and “Chu Luoxun.” She simply could not attain that synchronicity that Chu Luoxun had with Gu Yuan in music. She was just a makeweight.</p><br/><p>Nonetheless, she deeply remembered the ensemble of ‘Chu Luoxun’ and Gu Yuan. Their postures looked like they were going to battle, and they were competing to take the lead role. As a result, they managed to perform an amazing song.</p><br/><p>It seemed that Lin Meiyue’s innate nature as a side character had been fully displayed in this ensemble. The audiences were attracted by Gu Yuan as his “Liebesleid” delivered the warmth of a mother’s love.</p><br/><p>He was gently stroking the piano, just like his mother had used to stroke his head</p><br/><p>He recalled an afternoon where he asked his mother why she chose “Liebesleid” over “Le plaisir d’amour.” She told him that he should get used to sorrow first.</p><br/><p>Gu Yuan had completely said goodbye to his mother after he finished playing the “Lielesbeid.” The soul of his mother which kept haunting him had disappeared, not in the way you think, it had entered his heart and gave him power!</p><br/><p>At that moment, he suddenly came to realize that the one who made him choose this song was ‘Chu Luoxun’!</p><br/><p>She was the one who made him face his past again, genuinely understanding the most profound love of his mother for him and coming out entirely of his psychological trauma!</p><br/><p>But, now, she was not the one who was performing together with him</p><br/><p>Strangely, he felt slightly lonely, for she did not hear this performance which made him feel as if he had been reborn.</p><br/><p>This “Lieslesbeid” had conquered not only the audiences, but also the violinist version of Gu Yuan. He too thought of the love of his mother. He was completely affected and, now, he looked at Gu Yuan with respect.</p><br/><p>Thus, this violinist had walked up the stage as a new person, and performed a piece that could not be said to be a precise reproduction of the score!</p><br/><p>Unfortunately, his scene was skimmed over, as he was not the main character.</p><br/><p>‘Chu Luoxun’s’ absence in this scene, was to dissect Gu Yuan’s inner world, allowing him to come out from the shadows of his mother altogether. Previously, many readers had complained that they hated this cold-hearted mother who caused him the loss of his musical soul, but, they were about to get a slap on their faces, as the deep love of his mother was the real tearjerker!</p><br/><p>This plot was exceptionally emotional!</p><br/><p>Of course, the image of Gu Yuan as a handsome pianist was building up in the heart of the readers.</p><br/><p>For Gu Yuan, perhaps the death of his mother was a regretful matter, but it would push him to take a great leap in his musical journey, as long as he manages to come out from the trauma</p><br/><p>Regrettably, he could not make it by himself, until he met her.</p><br/><p>Then, the question arose. Where was the absent ‘Chu Luoxun’?</p><br/><p>He was still concerned over the absence of ‘Chu Luoxun’ as Lin Meiyue couldn’t be compared to her skills. She needed more time for progression.</p><br/><p>He thought that perhaps, he could find her in the music studio of their school. Well, he did not have her contact, not knowing her phone number and Wechat</p><br/><p>Now, he realized that he did not understand her at all because there was only music between them.</p><br/><p>Alone, he played “The Nocturne” by Chopin in the music studio. The melody of this song was gentle, expressing the serenity in the loneliness, which gave the feeling of one who was silently cogitating under the moonlight. He closed his eyes, and his nose smelled the light, delicate scent of her body, as if she was sitting beside him, playing the piano together.</p><br/><p>It must be her whom he had his first ensemble with</p><br/><p>Unfortunately, it was too late for him to realize that.</p><br/><p>Gu Yuan and Lin Meiyue were a couple now, and he really liked her. However, he knew that he had chosen Chu Luoxun in music, not because of love but more like a friend with the same ideals.</p><br/><p>He seemed to be indulging in the beautiful moonlight, reminiscing their musical moment.</p><br/><p>Then, Lin Meiyue came to the music studio and said in worried “Sister Chu sheshe has been admitted to the hospital!”</p><br/><p>After hearing this, Gu Yuan ran to the hospital without saying anything. Looking at his retreating back, Lin Meiyue was slightly dumbfounded.</p><br/><p>If this was an animation, the bullet curtains would have turned green.</p><br/><p>However, Lin Meiyue was as nave as usual, totally believing in them. Thus, she did not overthink it and ran to catch up to Gu Yuan.</p><br/><p>The foreshadowings were slowly being revealed. It was the same hospital where ‘Chu Luoxun’ did her body check-up, using anemia as an excuse.</p><br/><p>Gu Yuan opened the door of the ward. ‘Chu Luoxun’ was not the person that he saw, but it was his late mother. His pupils contracted</p><br/><p>But, his mother’s face disappeared, the next moment. It was replaced by the face of ‘Chu Luoxun’ which was always smiling.</p><br/><p>Her speech sounded optimistic and confident as usual “How was the musical concert? I wanted to call you yesterday to tell you that I was coming, but, my body did not allow me to do sorenunciation is the only choice. I am very sorry that I did not make it.”</p><br/><p>Gu Yuan was gasping for air. Looking at her, he discovered that her body was very skinny. She looked elegant that time on stage in the long dress, but, now, her head was wrapped in bandages, and she was on an IV drip. He face was as pale as a piece of paper, and her lips had vanished into that mist of sickly white.</p><br/><p>Zhao Youyue, who was possessing “Chu Luoxun,” felt the pain too. The former ‘Chu Luoxun’ who burned her body and soul for the final, powerful outbursts of her performance, was now suffering from the lash back. Now, Zhao Youyue realized for the first time that she was most fortunate to have a healthy body. Since then, possessing ‘Chu Luoxun’ had gave her great pain, but she was sticking to it!</p><br/><p>The illness of ‘Chu Luoxun’ was different from “Yu Shengfan.” Even though that loli was moments from dying, she was still able to play one last game at full strength. On the other hand, ‘Chu Luoxun’ had succumbed to a chronic disease where she could only witness her body wasting away and losing the strength to produce the music that was a life.</p><br/><p>This would be the most painful form of torment, worse than “Yu Shengfan,” as “Yu Shengfan” was able to play the game before her death. As for “Chu Luoxun,” her talents, her skills, were all going to be taken away from her!</p><br/><p>Meanwhile, ‘Chu Luoxun’ had to smile while looking at the affection between Gu Yuan and Lin Meiyue</p>\n</div>"}