{"title": "Chapter 203", "id": 203, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-203", "volume_title": "Volume 3", "body": "<h1>Chapter 203</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Han Leng nearly forgot his true purpose. He was a little carried away, which made it seem like he was trying to tease Zhao Youyue. However, he had failed to do so.</p><br/><p>Zhao Youyue was The Saintly Yue. She could not catch on to the implication of his words.</p><br/><p>She did not know that Han Leng had gone through a great romance with her in his imagination. Now, he was dumping her, and she was now his ex-girlfriend</p><br/><p>Sometimes, humans would behave in such a childish way. For instance, they would show off to their exes when they have found a better partner. This was what Han Leng did, just then.</p><br/><p>Unfortunately, Zhao Youyue took it as a show. She perceived the teasing as a way of saying that beauty is in the eyes of the beholder. She understood that the youngsters in the pubescent stage loved to beautify their partners.</p><br/><p>Zhao Youyue’s reaction can be concluded to be calm and mildly curious. Nonetheless, she would not get to the bottom of it, if Han Leng does not intend to tell who he liked.</p><br/><p>It was none of her business, right?</p><br/><p>The former Han Leng would have been depressed as he could not make her jealous, even slightly. That would mean that he had been lost in his own delusions</p><br/><p>Now, whenever he thinks of “Chu Luoxun,” his whole body would be filled with energy!</p><br/><p>It was as if the Goddess Chu had saved not only the male protagonist in the novel but also his dark youth. He had found a new spiritual sustenance.</p><br/><p>In addition, Han Leng did not have to worry about being unable to express his love, as he was expressing his passionate love to ‘Chu Luoxun’ whenever he writes about her. He must place her on the altar! Turn her into the goddess of the nation!</p><br/><p>However, she would forever belong to him, the creator. Even the male protagonist would have to stand aside!</p><br/><p>Firstly, he deleted all of their previous conversations and then naturally replied, “It’s like this, you know, Chen Haoran who sits beside me believes the rumors about you, and he has even thought of calling on the whole class to make a donation for in your favor.”</p><br/><p>In retrospect, Zhao Youyue recalled that Chen Haoran was the elite scholar in science subjects, the representative maths in the class, but now he looked like an idiot.</p><br/><p>“Rumors? What rumors?” Zhao Youyue asked.</p><br/><p>“With you are studying like that “Xu Jing” recently and your soaring results, a certain somebody thinks that your family is poor, that your dad is in the hospital, and your mother was chased away by the city inspectors while street vending”</p><br/><p>“What?” Zhao Youyue was dumbfounded. His father a hospital director, and her mother was a beautiful professor of Jiangnan University, an author of pure literature. How could it turn out like this</p><br/><p>“Oh oh. Perhaps you do not know who “Xu Jing” is. She is the elite female scholar in the recently popular anime, “Pure Romance.” Her family is poor, but she is strongly self-reliant.” Han Leng explained it all to Zhao Youyue calmly. The former him would have been too embarrassed to mention “Pure Romance.” as it was a manga with sex elements.</p><br/><p>“I know who “Xu Jing” is. I am a good friend of Su Li, the mangaka of “Pure Romance.” But, many female students in the class like to study, why me?”</p><br/><p>Obviously, Zhao Youyue had not yet recovered from the setting of the “Side Character.” She was not a side character anymore, but a top ten big boss in the school in three major examinations!</p><br/><p>Now, Han Leng recalled that Zhao Youyue was [Youyue] tycoon, a well-known Qidian reader, the kind that interacted with many High God Authors. He saw a photo of her and Su Li before, but he just did not remember it at that moment.</p><br/><p>At that point, Han Leng felt that something was wrong. Why would she get mixed up with a deceiving mangaka like Su Li, and even seem to be one of her loyal readers</p><br/><p>After thinking it through, he realized that Zhao Youyue did not seem to be a pretentious person as he had once thought.</p><br/><p>Then, he had a sudden revelation, the Zhao Youyue that he once liked was merely his imagination, his twisted fantasy. This was similar to the “Lin Meiyue” in the novel; jealousy was one of her defining traits. However, the cold and aloof Zhao Youyue would never, ever be that sort.</p><br/><p>Perhaps, the real Zhao Youyue greatly differed from what he had imagined.</p><br/><p>Han Leng instantly felt that he had greatly matured. He would like to thank, of course, his Goddess Chu first, for finally giving him the strength to face all the women in this world with the utmost superior attitude, and scornfully telling them off—</p><br/><p>Humph, women.</p><br/><p>“Maybe you are too low-profile in the classwhy don’t you do something to prove that you are not a poor elite scholar, but a missy tycoon.” Han Leng replied.</p><br/><p>“Well, your suggestion is great, I’ll prove it tomorrow. Thank you The Great Scholar Han for bringing this matter to me. If there is nothing else, I am going to sleep now”</p><br/><p>“Oh yea, didn’t you keep asking me what my pen name is on Qidian? It is “Sour Oranges,” and the title of the book is “Conquering the World in Online Games.” That’s all, there’s nothing else, I am going to write now.”</p><br/><p>“Alright. Good night, The Great Scholar Han.”</p><br/><p>“Sleep tight.”</p><br/><p>After ending the conversation, Zhao Youyue only came to realize that Han Leng had changed. Previously, he had been reluctant to reveal what his books were, no matter what, and no longer spoke like an awkward, angry young man anymore. He showed much more restraint now.</p><br/><p>He had matured a lot.</p><br/><p>Zhao Youyue was naturally happy about it. Who would not like a person who could communicate well? Before this, he had always choked on his words, not knowing what to reply as he would never once utter an appropriate line, always aiming for “the best, dramatic effect” in a conversation</p><br/><p>Formerly, Han Leng would always alter his messages before sending them to Zhao Youyue. Now, he could say whatever he wanted; nothing could restrain him anymore.</p><br/><p>Thank you, Goddess Chu!</p><br/><p>He was free.</p><br/><p>Soon, Zhao Youyue discovered how to prove that she was not poor. There would be a sports class tomorrow, and everyone would surely be thirsty after exercising. Let’s buy them a box of Gatorade.</p><br/><p>Besides that, she did not forget to Amway Leng Zi’s “Beautiful April” to the whole class. She decided to buy each and every one of them, ten issues of “Meng Ya” in the name of improving their essay writing level.</p><br/><p>Well, there was another nickname for “Beautiful April” now, which was—April is your full marks essay.</p><br/><p>Inside it, the psychological state of the male protagonist would be described in rather bombastic, hipster-like terms, while the heroine or the Goddess Chu that would be described with a variety of elegant phrases which were suitable for writing essays.</p><br/><p>An idea suddenly dawned on her. Could Leng Zi be a female high school student?</p><br/><p>She shut her eyes while thinking about it. Again, she entered the literary world, and resumed her journey of trouble-making.</p>\n</div>"}