{"title": "Chapter 215", "id": 215, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-215", "volume_title": "Volume 3", "body": "<h1>Chapter 215</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>As Su Li was speaking, she used her phone to surf through her Weibo, and only realized that the notification center had exploded with various types of private messages, comments, and shares, at least a few times more than usual!</p><br/><p>Su Li personally loved being in the thick of things, rubbing hot spots and appearing in headlines on the internet. Her Weibo followers had enthusiastically trailed after her, making her movement almost considered No.1 within the manga world.</p><br/><p>This certainly did not mean that Su Li’s manga has become invincible. It just meant that she was better at hyping her fans up, like those outspoken interactive celebrities. By doing so, her fame had thrived.</p><br/><p>Such was Su Li’s secular mind, with a very strong heart towards her career. She loved to secure her personal gain, while being engrossed in her fame and fortune.</p><br/><p>This new, mysterious fire gave her a panic attack. The work that was her main priority at the moment was “The Strongest King” by Rosemary, as this was her primary source of income, so she had to understand all of the plot fully. She had even consulted Rosemary for more details.</p><br/><p>No other plot is more disastrous, compared to Xiao Yu’s. This upcoming outline certainly does not involve her. Among all of my recent updates, there have been no bad signs either…</p><br/><p>As a creator, Su Li had a keen sense of smell. If the author wants to make something happen, she would have known. In this case, none of her red lights had lit up. If this is a surprise death flag, readers wouldn’t exactly be approving of it.</p><br/><p>To be honest, Xiao Yu’s death was rather unexpected, as her death had not been foreshadowed from the start. On the contrary, it was Rosemary who had suddenly decided to give her a bento, during the process.</p><br/><p>However, most readers are easy to deceive. Xiao Yu’s death had successfully earned a wave of tears, at the same time making “The Strongest King” viral, eventually solidifying its spot as an iconic series.</p><br/><p>When Su Li realized that there were no words like ‘Rosemary,”The Strongest King’, etc. among the comments on Weibo, she felt relieved. Then only did she notice that many readers were actually blaming her for a development concerning ‘Chu Luoxun.’</p><br/><p>What is h*ll is going on?</p><br/><p>She voluntarily painted an illustration for goddess Chu, why am I being scolded instead? Did I fail to portray the essence of the goddess Chu, Chu Luoxun?</p><br/><p>Su Li admired her exquisite illustration once more; still thinking that it was undoubtedly perfect, even finding herself almost enthralled by the charm of the goddess Chu. She could not help but felt the urge to draw an entire artbook of goddess Chu…</p><br/><p>Su Li had always thought that if a female character wants to become famous within the manga world, she must first become the model worker [1] within the realm of Doujinshi ero mangas or become a ‘public transport’ [2] within anime fanfictions. Without those, would you still dare say that female characters are famous?</p><br/><p>Su Li had not have time to look through the latest issue of ‘Mengya,’ and that was why she was confused, unable to understand the comments under her Weibo.</p><br/><p>“I’ve already seen it through! Everything is the cheater, Su Li’s fault. If she had not drawn an illustration of goddess Chu, goddess Chu would have to suffer such a terrible fate!”</p><br/><p>“Su Li really is the grim reaper of the manga world. Whoever who gets drawn by her gets their world turned upsidedown, as long as it’s a widely known female character. For example, the Tri-No elite scholar, Xu Jing who is obsessed with learning, and the tsundere, poison-tongued Lolita with blonde twintails, Yu Shengfan the gaming genius. Now, it’s finally the Genki [3] music goddess, Chu Luoxun’s turn. I have a feeling that Chu Luoxun would probably be damned.”</p><br/><p>“Old sly Su Li, please keep your all-mighty capabilities away! Goddess Chu was all fine, and once you drew her, she became ill. This is supposed to be old sly Su Li’s fault no matter which perspective you take, right…?”</p><br/><p>“At first, I thought that it was the Master Leng Zi who was cheating the readers on purpose. Now only did I realize, it was actually you behind the scene, Su Li!”</p><br/><p>“Seeing that everyone has managed to find the real criminal, I feel relieved right away. This cheater, Su Li already has numerous convictions in the past, she is certainly involved this time! She is the source of all evil!”</p><br/><p>“To be honest, Master Su Li shouldn’t be blamed for this, right? She has carried the pan again no matter from which perspective you take…Huh? This word ‘again,’ suddenly appeared by itself!”</p><br/><p>“Congratulations to Master Su Li for receiving the title —— ‘The Pan of This Generation’!”</p><br/><p>“It’s not ‘The Pan of This Generation,’ it is clearly ‘The Killer of Goddesses.’ I doubt that there really is a source of mysterious power from the East.”</p><br/><p>…</p><br/><p>Although Su Li did not read the newest issue of “Beautiful April,” she was able to figure something out from these comments. It looks like the one causing trouble was not Rosemary. It was Leng Zi!</p><br/><p>Su Li had felt no need to keep up with such a youthful novel on an issue-by-issue basis. She had intended to wait till it is finished, before binge-reading it in one breath. Current circumstances had forced her to start reading it. If not, she would not even know how to defend herself.</p><br/><p>She sent her own assistant to purchase the latest issue of “Mengya.” Then, warily, she finished the content in one breath.</p><br/><p>Her face went slightly white; her eyes turned slightly red. She knew, if she had not kept her guard up, she might have cried uncontrollably by now!</p><br/><p>It was really too heart aching, especially at the last scene of the latest issue…</p><br/><p>Know this, Su Li is also among the Chu Luoxun fanbase. If not, why did she not draw illustrations of the others?</p><br/><p>At that moment, Su Li had been heavily cheated by Master Leng Zi. No, it should be sly old Leng Zi. This is why there are so many authors with hipster-itis in this world!</p><br/><p>Why can’t they just write books properly? I suppose that you abused Chu Luoxun to such an extent, just because you have problem with money?</p><br/><p>For a while, Su Li felt that ethical authors like herself were a dying race. Those people, every single one of them wanted to become the readers’ dads. She is the only one who truly considered the feelings of the readers!</p><br/><p>Thus, Su Li immediately contacted Zhao Youyue via direct message on Wechat and asked her comfortingly, “My lady, have you read the latest issue of “Beautiful April”?</p><br/><p>Zhao Youyue replied, “Yup, it’s well-written! It will be so good if I can see the moment where Chu Luoxun crying in despair in picture form. That will be such a profound moment!”</p><br/><p>Su Li spoke within her heart, “So scary, is your heart made of iron, Lady Zhao? How could you face the matter of goddess Chu being abused so calmly?</p><br/><p>She replied her bluntly, “My lady; if you want to see such a thing, I’ll draw another illustration of that scene. I also think that this is quite memorable. After all, it’s the very first time ever for goddess Chu to be seen in such a state…”</p><br/><p>Wechat money transfer —— 5,000 RMB.</p><br/><p>“Keep it up, Sis. Li! This is some encouragement for you, I believe that you will do a great job” Zhao Youyue replied after she transferred the money. She was grabbing every opportunity, trying her best to deepen the readers’ impression towards “Chu Luoxun,” – the deeper, the better! Having a soulful artist like Su Li at my beck and call, isn’t it such pity to not use her?</p><br/><p>As Su Li replied her shamelessly, she accepted the money transfer. Soon after, she assured her patron that 3 days was enough for her, because this scene had certainly stimulated her inspiration!</p><br/><p>But on Weibo, she screamed once again——</p><br/><p>To all the “Beautiful April” fans, I want to tell you the truth!</p><br/><p>I am just an innocent, passing fan of goddess Chu, and I was merely drawing an illustration of her, without asking for anything in return, increasing her fame at no cost whatsoever. So, she suffered from such a disaster, but what does this have to do with me?</p><br/><p>All of you should go and find that Leng Zi who is hiding her head, exposing nothing but her tail!</p><br/><p>If you guys still think I’m the culprit, then don’t blame me!</p><br/><p>I, Su Li, have no need to explain myself to anyone!</p><br/><p>It’s not my fault!</p><br/><p>Translation Note:</p><br/><p>[1] Model worker It refers to characters that have high appearance rates within a doujinshi ero manga or those who maintain high production amount of doujinshi ero mangas, yearly. Therefore, characters with such selfless dedication, rushing to ‘attend different plots’, are given the title ‘model worker’.</p><br/><p>[2] Public transport – When this is applied to a female, it means that everyone can have sex with her.</p><br/><p>[3] Genki an innocent and energetic personality.</p>\n</div>"}