{"title": "Chapter 219", "id": 219, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-219", "volume_title": "Volume 3", "body": "<h1>Chapter 219</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Youyue did not expect Han Leng to be in the ‘Chu Luoxun’ gang as well. It looks like her possessed ‘Chu Luoxun’ has now gained enough existence within “Beautiful April.” Its influence has even exceeded the hero and heroine.</p><br/><p>Zhao Youyue felt conflicted over this, because she very much liked the dog food sweetness of the hero and heroine. Now, this dog food plot seemed to be getting outdated…The bigger the influence that Chu Luoxun had, the more benefits she had in shaping this character.</p><br/><p>Even the fans of Lin Meiyue were hanging on to every word that could possibly determine ‘Chu Luoxun”s fate.</p><br/><p>The sweet dog food of the hero and heroine, and ‘Chu Luoxun’s tragedy. The juxtaposition only served to enhance the impact of the latter’s predicament further.</p><br/><p>Time flowed by, and Zhao Youyue successfully requested for leave on that Saturday to participate in the provincial violin competition finals.</p><br/><p>When Mr. Qiu knew that Zhao Youyue was an expert in the violin, he was obviously surprised. Even after her recent academic achievements, he still deemed her as a passerby. He did not expect her to become the best student in class now, to even be able to play the violin at that.</p><br/><p>“Go, participate in the competition. The next time when there’s an evening party in school, you must go on stage and show your specialty! Student Zhao Youyue, you’re just too low-key. If you had let it be known that you could play the violin, you could have gone on stage and performed during the New Year evening party of the first semester!” said Qiu Yingchun, the class teacher.</p><br/><p>Now, Qiu Yingchun’s attitude towards Zhao Youyue was most favorable, and it was not because she was rich. To old-school teachers like him, students who were rich but did not study thoroughly were the most annoying ones. Honest, earnest students like Zhao Youyue earned his favor the most.</p><br/><p>Even when Zhao Youyue’s results were not this good, Mr. Qiu already had a good impression on her. Her unassuming appearance often escaped his gaze, that was all.</p><br/><p>This was no fault of his. Zhao Youyue never caused trouble. She never had any outbursts or tantrums. She was always there, calm and unassuming.</p><br/><p>Whatever urges she might have, the Two Dimensional Gate was her outlet.</p><br/><p>“No problem. For the class, if you ask me to perform, I will perform!” Zhao Youyue replied.</p><br/><p>Mr. Qiu immediately smiled. Look at her; this is the perfect student. Not only is she good in her studies, she even has a sense of patriotism for this class. Such students are really too rare!</p><br/><p>However, those were merely words. If Han Leng heard about this, he would have exposed her countless layers of masks. If she really felt anything for the class, he would eat sh*t!</p><br/><p>He could never forget about her various methods of escaping from group cleanups. She never gave two hoots about them being together in this.</p><br/><p>The only reason she would be willing to perform on stage was just because she had the desire to show herself off, a passion that lay within her bones.</p><br/><p>Zhao Youyue treated all students almost the same, always smiling courteously. If you are assuming that she likes to makes friends, then you are wrong!</p><br/><p>She is actually the easiest person to get close to, yet the hardest person to get to know. Everyone would think that it is easy to get to know her. But becoming friends… that is just your imagination.</p><br/><p>You will never become anything more than just another of her acquaintances.</p><br/><p>Yet, Zhao Youyue’s had connections that stretched across the globe. This was because she did not refuse to know more people, especially authors.</p><br/><p>Han Leng had slowly come to realize this as time passed by. Luckily, he seemed to have been recognized by her as a friend.</p><br/><p>Obviously, it was all thanks to him helping her to write reports and reminded her in advance, concerning the problems related to Yu Shengfan. Besides, they were old classmates; and have accumulated years of communication.</p><br/><p>This was enough for Han Leng. As for lovers, Han Leng had expressed that he already had Chu Luoxun within his heart, so he should just forget about an unfathomable Lady like Zhao Youyue.</p><br/><p>Han Leng had entirely given up on trying to figure her thoughts out, because she seemed to be as stoic as a tree. Nothing, and no one would ever catch her off-guard.</p><br/><p>Her icy demeanor would shatter the moment she finds another piece of excellent work that glues her eyes to the end, or a touching plotline. She would AMWAY the work with great fanfare. She would be a creature of passion.</p><br/><p>Such contrasting behavior was the part that threw him off. Was she really AMWAYing and producing various mediums of recommendation, just because she simply liked it?</p><br/><p>He did not believe her to be such a passionate person. She could treat anything calmly and coolly, as if nothing mattered to her, and that she was too lazy to care. What was it that drove her into such a frenzy?</p><br/><p>Han Leng observed and thought for a very long time, still unable to see through it…</p><br/><p>“What? You also want to request for leave on Saturday?” Mr. Qiu looked at Han Leng suspiciously.</p><br/><p>“Well, it’s like this. The editor of “Mengya” Magazine Agency told me that some media wants to have an interview with me. Teacher Qiu, you also know how famous my “Beautiful April” is now…you mentioned ‘also’ just now, is there anyone who had requested for leave?” Han Leng pretended to be puzzled and asked.</p><br/><p>“Haha, I almost forgot, you’re now the great author Leng Zi, I’m so proud to have a student like you! I’m now waiting for you to reveal your identity, then I can show off everywhere that you’re my favorite student! Since it’s a matter regarding the media interview, then you have to go. Oh right, I just want to ask, will this Chu Luoxun character die? Tell me the truth!” Qiu Yingchun narrowed his eyes at the last bit.</p><br/><p>Han Leng felt a shudder, and he answered, “She won’t be dead! How could I write her towards death? Currently, I only put her in a bit of a tragic situation in order to display her fortitude. Chu Luoxun will eventually be able to overcome the disease!”</p><br/><p>“Not bad!” Qiu Yingchun patted Han Leng’s shoulder and said, “You’re indeed my favorite student! Will you choose to become a professional author in the future? Your academics are suffering a little”</p><br/><p>“Erm…I will pay attention to that; I still want to take the college entrance examination. After I finish writing this book, I will transfer my energy to my studies.”</p><br/><p>“Your story is pretty good, after all, being a professional author has its own risks as well. Your current book may be famous, but your next may not be so. It’s better to have something to fall back on. How about this? I will change the seating arrangements for you and have the others guide you.”</p><br/><p>“Teacher Qiu, there’s no need for that. Bro. Chen…I mean Student Chen Haoran’s science result is so good, it’s best to let him counsel me. I only have to sit with him.” Han Leng immediately replied. He disliked the other elite students.</p><br/><p>“Whoa, you two are already calling each other brothers, can he still counsel your study? Obviously, he is definitely working hand in glove with you! Don’t you ever think that I don’t know that he looks out for you when you’re sleeping!”</p><br/><p>“Teacher Qiu, you really have…” Han Leng did not spill out the phrase ‘bright eyes.’</p><br/><p>“You will become deskmates with Zhao Youyue from now on, that’s it. Only such an earnest, hardworking and simple good girl like her can counsel your study! Her results are way better compared to Chen Haoran’s, especially in English. You already know how bad your English is, I suppose?”</p><br/><p>“This…” Han Leng was shocked. He had given an excuse to request for leave, so that he could attend Zhao Youyue’s violin music competition, in order to draw some inspiration. He never expected such a situation to happen, due to his leave application!</p>\n</div>"}