{"title": "Chapter 217", "id": 217, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-217", "volume_title": "Volume 3", "body": "<h1>Chapter 217</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>As the perpetrator of all these incidents, Han Leng was also paying close attention towards the movements on the internet from the shadows. Of course, there were letters from fans. To conclude, the contents basically begged him to spare Chu Luoxun. Even if he wants to abuse her, please be easy on her…</p><br/><p>Some begged humbly, some threatened rudely, some questioned him instead, “I thought we had a deal that this is a joyful work? Why did you not keep the promise made before the start of the book?”</p><br/><p>Of course, there were also some carefree fans who worshiped him, saying that no matter what he writes, they will keep supporting him.</p><br/><p>When Han Leng saw those questions, he felt sorry as well. After all, he was indeed at fault, he was shy, and he too, hated those authors who purposely cheated their readers! He hated them the most!</p><br/><p>He could only comfort himself and say that all of this was not his fault. This was because when he wrote about the character ‘Chu Luoxun’, she came to life under his pen. He had no way of controlling her actions</p><br/><p>With the work becoming more and more popular because of this character – ‘Chu Luoxun’, the sensation of being dominated by her only grew, as if his pen did not belong to him anymore.</p><br/><p>He could only look helplessly at her in the quiet hospital corridor, crying desperately and helplessly.</p><br/><p>He then used his pen to record the scene down and showed it to all the readers.</p><br/><p>He did not even bear to delete the depiction of this scene, because he could not guarantee at all that he would be able to write something as good as this one if he were to write a different path.</p><br/><p>Whether she lives till the end, he would never know.</p><br/><p>This was not him shirking responsibility, it was the truth. A truth that even the readers would hardly believe…</p><br/><p>Authors were basically the Gods of their own universes, so why could they not decide a character’s life and death within their literary world?</p><br/><p>This is because that character was not simply a character within the literary world anymore, it had appeared to have manifested in reality. Words no longer held sway over her actions.</p><br/><p>Han Leng also paid attention to great artist Su, Su Li who had been inexplicably criticized for no reason.</p><br/><p>To be honest, Han Leng had a good impression on her, for she was obviously a loyal reader. She had even drawn an illustration of his goddess Chu without being commissioned to, giving him great, free advertisement. This undoubtedly increased Han Leng’s favorability towards her drastically.</p><br/><p>He had almost laughed at the fact that this enthusiastic artist, Su Li had even carried the pan for him. Many readers did not go after him, who was the perpetrator of all crimes, but went for Su Li. They had to be drunk.</p><br/><p>Su Li’s anti-criticism measure raised his eyebrows as well, mainly because that illustration of goddess Chu crying was too tearjerking. If you look at it together with that scene in the novel, your heart would shatter into smithereens!</p><br/><p>Many fans instantly cried after looking at the second illustration. Some fans who were in high-spirits previously had bowed towards boss Su Li, asking her to let them go…</p><br/><p>Han Leng felt that the effects of the illustration was so good, that he even wanted to ask Su Li to help him draw the illustrations for the offprint of his work after it is completed. Although illustrations mostly appeared in light novels, youth novels like his could also have illustrations to increase the offprint sales. The combination of graphics and text could attract readers even more.</p><br/><p>Finding a good illustrator was not easy; one would have to at least read through the book. However, some illustrators often ignored the details of the novel and flippantly draw something out of the novel, not pursuing the details to completion whatsoever.</p><br/><p>However, Su Li’s illustrations were not like those. She often managed to illustrate the scenes perfectly, in accordance with the original. Moreover, with the good reputation of ‘respect the original author’ that she had accumulated from “The Strongest King” work, Han Leng could totally trust Su Li. She was actually ‘the’ mangaka that numerous original authors wanted to cooperate with. This was because she was serious, responsible, and was loyal to the original content, and the original authors’ desires.</p><br/><p>Han Leng gave it careful thought, and soon thought of the relationship between Su Li and Zhao Youyue. He could not help but sigh within his heart. The person that he should be most grateful to, should perhaps be Zhao Youyue.</p><br/><p>If not because of Zhao Youyue, would Su Li even pay attention towards “Beautiful April”?</p><br/><p>He did not think so.</p><br/><p>Han Leng walked out of his adolescent turmoil and perceived Zhao Youyue objectively. Only then did he realize that this girl was more interesting than he had concluded some time ago. It was an understatement to characterize her as ‘Lin Meiyue.’</p><br/><p>Zhao Youyue was like a book, riddled with profound connotations. From the cover alone, she might not seem like much, she would not even be a particularly thick book. But when you really calm yourself down and read it, you would sense that her ideologies far exceeded her peers.</p><br/><p>Han Leng remembered his many silly and awkward antics in front of her. He wanted suddenly dig a burrow and jump in. It was too embarrassing! If his current self was to face himself in the past, he would have wanted to beat him up, for sure. His past self really deserves to be beaten!</p><br/><p>How could Zhao Youyue’s personality be so good? To have remained calm in the face of all that</p><br/><p>Han Leng felt a newfound wave of respect for Zhou Youyue, feeling that she hid her complexities well.</p><br/><p>Before this, Han Leng felt that Zhao Youyue was utterly incomparable to his goddess Chu.</p><br/><p>We could only say that Han Leng is flexible enough to change his opinion of a person. He could not understand Zhao Youyue, therefore he could only fill her gaps with different sorts of brain supplement. Sometimes, he felt that she was just a passerby without any sense of existence. Sometimes, he felt that she was so incredible, like an undercover agent who was convincingly playing the role of a passerby!</p><br/><p>However, Han Leng was sure about one thing. He finally would not feel uneasy when communicating with Zhao Youyue. He would only need to chant his goddess Chu’s name under his breath, and he would be fine. If not, he would still feel himself lacking to be in her presence</p><br/><p>Thinking of Zhao Youyue, Han Leng unconsciously sent a message to Zhao Youyue using Leng Zi’s QQ ID. Getting along with Zhao Youyue using this ‘Leng Zi’ identity was way better, compared to using his real identity. Their relationship could be said to be unusually congenial, which gave him more reason to continue keeping the secret of this ‘Leng Zi’ identity.</p><br/><p>The moment the true identity of ‘Leng Zi’ is exposed would be the end!</p><br/><p>“Lady Youyue, I wrote this heart-aching plot by chance, I was going with the flow. I am not sure if it was for better or for worse, I would like to hear your thoughts on that,” Han Leng sent the message like so.</p><br/><p>Zhao Youyue saw the message, with a smile, she replied, “Master Leng Zi, you wrote it very well! It will be better to follow your feelings in future…Moreover, the male lead and heroine must enjoy a big, happy ending. That was your absolute promise.”</p><br/><p>Han Leng sighed. This Zhao Youyue truly did not care about goddess Chu at all. Even at this stage, you are still paying attention to the male lead and heroine. Chu Luoxun had already caught most of his attention, even as the author. He really wanted to determine his next move now.</p><br/><p>The fear of the unknown would scare other authors to death. Was there truly such an author who did not even have a clue on what he would write next? Was he this unreliable?</p><br/><p>Han Leng had no idea that all the pain of ‘Chu Luoxun’ was actually Zhao Youyue abusing herself, literally. There was no other choice, she had to take things to such an extent, in order to get the iconic character card!</p><br/><p>She was also using her life to get the power!</p><br/><p>Even Zhao Youyue herself was afraid of entering the ‘Two Dimensional Gate.’ This was because that she would experience Chu Luoxun’s pain once she enters. Of course, she could choose to disable her senses and withdraw temporarily.</p><br/><p>But if she does so, she does not believe that she would be able to let Master Leng Zi experience goddess Chu’s pain, or how else would she perfectly depict the scenes that are to follow?</p><br/><p>In her mind, by doing so, she would show goddess Chu all the respect that she deserves. She can’t just expect to earn goddess Chu’s power, if she does not have the courage to bear her pain.</p><br/><p>The more painful it is, the greater the fortitude needed.</p><br/><p>This would also hone Zhao Youyue’s willpower!</p>\n</div>"}