{"title": "Chapter 213", "id": 213, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-213", "volume_title": "Volume 3", "body": "<h1>Chapter 213</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Prior to this, “Chu Luoxun’s” fans were all dancing happily along with their idol.</p><br/><p>For instance, the representative figure, Su Li, The Great Mangaka, whose exquisite illustration of “Chu Luoxun” had increased the momentum of the gang of Chu Luoxun.</p><br/><p>Many of the gang members had perceived it as the true expression of the Goddess Chu’s sense of presence. As for Lin Meiyue, she was just a side character.</p><br/><p>Moreover, what they liked to do most on the internet was to dig into details and analyze the hidden messages in the contents that contained “Chu Luoxun.”</p><br/><p>Those who have done the “reading comprehension” before will know how terrifying the “gang of analyzers” were. They could even forcibly interpret a phrase in the article into a content of a thousand words.</p><br/><p>The conclusion they got was that Goddess Chu was the best, having the typical plotline of a heroine and the male protagonist was simply blind. In reality, the fans of Lin Meiyue were too blind to even see that the Goddess Chu already succeeded in substituting the heroine!</p><br/><p>Which character will come to the mind first when “Beautiful April” is mentioned?</p><br/><p>“Chu Luoxun,” of course! The most beautiful, talented, optimistic and confident girl who has brought a lot of laughter to others. She was almost perfect, just a little lacking in the gentleness department.</p><br/><p>However, for a goddess, she should be aggressively gentle, unlike those obsequious and unreasonable little girls.</p><br/><p>The Goddess Chu was a girl who had the aura of a queen.</p><br/><p>That’s right! The fans of “Chu Luoxun” showed that they looked down on such a girl like Lin Yuemei, who was not bighearted at all. On the other hand, the fans of Lin Meiyue thought that “Chu Luoxun” would never to win over a man’s heart, even though she was very charming. She had no clue on how to walk into the heart of a man, as she was neither attentive nor thoughtful.</p><br/><p>The gang of “Chu Luoxun” coldly chuckled and said that “If the Goddess Chu was not attentive, would she have chosen “Liebesleid” for the male protagonist?”</p><br/><p>She had her personal style. She never procrastinated, and she was very capable!</p><br/><p>Those who never looked up to the Goddess Chu were merely feeling envious. They were those Cancerous straight guys, male chauvinists, who hated talented girls who far surpassed most men, fearing that they would not control her!</p><br/><p>The fans of “Chu Luoxun” had even analyzed, that perhaps “Chu Luoxun” was hiding something. There were too many mysteries about her. Perhaps they would slowly be uncovered someday. Her lingering enigma was the reason why she was so attractive.</p><br/><p>In summary, she had become the most important character in this juvenile novel. She may not be the heroine, but her spotlight had surpassed the heroine’s!</p><br/><p>Anyway, the “Chu Luoxun’s” fanclub’s movement was booming on the internet. Perhaps this character had a lot of things to be dug into and analyzed. As for Lin Meiyue, except for her selling point as the perfect first love, her image only shrunk under the shadow of “Chu Luoxun.”</p><br/><p>Leng Zi, the creator, was still the key player.originally, he had visualized Lin Meiyue as the perfect first love that he never had.She even felt that “jealousy” was a special trait that reflected a person’s desire to monopolize someone she likes (Despite the fact that Zhao Youyue was never jealous in the first place). Nonetheless, Lin Meiyue was merely her creation, but “Chu Luoxun” was the only character with a soul!</p><br/><p>Of course, nobody knew that this “soul” actually belonged to a certain trouble-making young girl</p><br/><p>Moreover, “Chu Luoxun” could even buff up the “intoxicated state” of the creator, while Lin Meiyue’s presence depended solely on Han Leng. Now, Han Leng had “turned his back on her.” That was why the “Chu Luoxun” fanclub movement was booming.</p><br/><p>The standard of depiction when it came to these two female characters were not on the same level anymore.</p><br/><p>However, the fans of “Chu Luoxun” would have never thought that the latest issue would be so torturous!</p><br/><p>Many of them wailed on the internet—</p><br/><p>“Leng Zi, this is torturous, and it completely caught me off-guard! Where is the promised all-the-way happiness? Why are the creators nowadays so deceiving!”</p><br/><p>“I knew that there would be that torturous element in such a juvenile novel. Why did it have to be the Goddess Chu?”</p><br/><p>“I cried while reading the latest issue. I felt like a knife was piercing my heart when the Goddess Chu cried! I am feeling so sorry for her!”</p><br/><p>“There are laughter and tears in this world. Someone will be responsible for laughter while another is responsible for shedding tears. So, the capable Goddess Chu was responsible for both?”</p><br/><p>“Suddenly, I dislike the male protagonist and the heroine who are feeding on dog food. Why should they be able to enjoy that sweet happiness while Chu Luoxun suffers alone?”</p><br/><p>“What exactly is this disease? Is it severe? Chu Luoxun would not be written to death, right? Is Leng Zi preparing to open a blade factory? Deceiving us by buying the blade and sending to her. Wouldn’t it be nice with this infinite loop of money making?”</p><br/><p>“Actually, I saw this coming after reading all those foreshadowing flags. It had left me uneasy for a long time. Now, after knowing that her illness has worsened, there is the feeling of impending doom.My demands are not high; I am just hoping that she will not be written to death. If so, he he he he”</p><br/><p>“I am a fan of Lin Meiyue, and a firm one at that too. I always believed that the sentimental first love of Gu Yuan and Lin Meiyue was the biggest highlight of this work. It really triggers a young girl’s dream. However, I suddenly feel that the dog food is tasteless and I just want to know Chu Luoxun’s fate after reading this issue. She is such a pitiful girl!”</p><br/><p>“Even the fans of Lin Meiyue can like Chu Luoxun at the same time. I do not believe that the two parties should be clashing. What I hate most are those guys who stubbornly say that Chu Luoxun likes the male protagonist and that they want them to be together. That’s so unreasonable!”</p><br/><p>“That earth-shattering kneeling and crying of Chu Luoxun made this character, who seemed to be only full of laughter turn even more relatable, all of a sudden. I must absolutely salute Leng Zi’s skill at molding the character, totally bringing her to alive!”</p><br/><p>“Wait a minute. Am I the only one who noticed that Su Li, the cheater, has illustrated Chu Luoxun before her drastic change? Don’t forget her illustration of Xu Jing, Yu ShengfanNow, Chu Luoxun! Everyone, I think I have discovered a pattern!”</p><br/><p>The comment on Su Li seemed to be a wakeup call!</p><br/><p>As Leng Zi did not have a Weibo, many of the readers who had been struck on their heads could not find a place to vent their anger. Soon, they found one!</p><br/><p>The latest post of Su Li was the Weibo that contained the illustration of Chu Luoxun that she shared. The commentary section blew up!</p><br/><p>Indeed, it was all Su Li’s fault!</p>\n</div>"}