{"title": "Chapter 248", "id": 248, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-248", "volume_title": "Volume 3", "body": "<h1>Chapter 248</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Iconic character card has been successfully obtained!</strong></p><br/><p>This time, Su Li had unknowingly fallen into the trap of deceit together with many others, as she was also a normal reader of “Beautiful April,” who would never see what comes next. She was not prepared for all the blame that would be pushed onto her by the no-lifers, but considering the fact that she had willingly made an announcement about her new illustrator’s job, who is to be blamed but herself?</p><br/><p>Well, if it makes things any better, at least many other readers would feel exactly the same right now and can relate to Su Li on an emotional level. A good example was Jiang Qing, as she had always been overwhelmingly passionate about “Beautiful April” since its release, and was also a proud die-hard Chu Luoxun fan. Considering how brutally Leng Zi concluded Chu Luoxun’s death right before the story ended, how could anyone not be mentally scarred by it?</p><br/><p>Jiang Qing had been alone at home, crying all day long. Whenever she thinks about how she would not be able to be in the same class as her best friend, Zhao Youyue, in the following school year, she began to cry even more…</p><br/><p>Frankly speaking, when you are not mentally prepared enough to cope with a tragedy of this sort, it could leave a huge destructive impact on you the moment you put the book down. If even someone as mentally strong as Su Li can be affected by it, what would happen to Jiang Qing?</p><br/><p>On the internet, the big ending of “Beautiful April” had sparked an uproar of responses from the readers!</p><br/><p>“Mister Leng Zi, you better stop hiding and show yourself, didn’t you promise not to let Chu Luoxun die? How do you plan to explain yourself now?”</p><br/><p>“I genuinely liked the story, and was actually enjoying it very much, because I thought the surgery would be a success. I even went on to imagine their future on my own and was in the midst of guessing how the three of them would get along after this, but Goddess Chu just died like that. My feelings have been toyed with! Now I might just kill the author!”</p><br/><p>“Don’t mind me, I’m just here to ask if anyone knows where Mister Leng Zi lives. I’ve already placed an order on Taobao[1], and once I get his address, the knife will reach his doorstep in no time!”</p><br/><p>“Nowadays, you just can’t trust authors anymore, it has come to the point where you even have to be skeptical about the punctuations they use. Every single thing you read must be thoroughly scrutinized, and you have to always expect the worst. I used to be so naive, so extremely naive. Once again, I have learned a valuable lesson, thanks to Mister Leng Zi.”</p><br/><p>“Right after I finished reading the ending, I tore the whole magazine apart. I just don’t feel like talking to anyone right now. My heart aches for Goddess Chu…”</p><br/><p>“Hey Mister Leng Zi, haven’t you already admitted that you are a male in front of the whole world? You’d better show yourself and cross-dress as an apology, as you promised. Stop fooling around and trying to hide. If you’re daring enough to do something, but not be daring enough to face the consequences, are you even a man?”</p><br/><p>“What an insidious plot! Even though the ending sort of amounted to a big reunion, the fact is that Goddess Chu still died. My life suddenly has no meaning! Goddess Chu had always remained cheerful and strong even when things got tougher and tougher for her, but she still ended up being the one with a twisted fate. Without a doubt, someone this ill-fated can only exist in novels.”</p><br/><p>…</p><br/><p>Currently, the internet was filled with angry comments from the angry fans of “Beautiful April” who have permanently lost their trust in Mister Leng Zi. He is just too evil, way too evil to be an author, and most of the comments were focused on bashing him, because a lot of fans are dissatisfied. The reason was obvious. Up until the very last moment, they still could not tell for sure if Chu Luoxun will live or die.</p><br/><p>Furthermore, most of the readers were light-heartedly anticipating a happy ending, but when everything fell apart in the big ending, the intense dissatisfaction that dawned upon them was sure to become sudden outbursts of emotion!</p><br/><p>Also, as Mister Leng Zi had not logged onto his Weibo account for quite some time, nobody has been able to reach him. Thus, all the dissatisfaction had been piling up, but there was nowhere to let it all out!</p><br/><p>Some fans even claimed to have completely seen through everything right from the start. They claimed that Mister Leng Zi had already planned to make Chu Luoxun die from the very beginning, even before he started writing the story. He only made her die at the very end because he was so afraid that he would get bashed by the fans, therefore he had tried to drag it on, as long as he could…</p><br/><p>Leng Zi’s fan club had been in a state of hustle and bustle for a few days already, ever since the release of the big ending. It had unknowingly become a place for people to gather in order condemn Leng Zi together to their hearts’ content. There was a lot of spam, which resulted from fans continuously mentioning[2] Leng Zi, and also from “password red packets”[3], which were mostly taunts in order to make Leng Zi come out and cross-dress as an apology, if he was really a male author, that is.</p><br/><p>If Leng Zi is indeed a female author instead, then, of course, the fans would want to see some of her photos, and hear her voice! Anyhow, there is no way that the fans will continue to let her retain a low-profile and be mysterious. An author like this that strikes when you are totally unprepared is too dangerous for a normal human being to handle!</p><br/><p>Nobody could have possibly predicted that it would be a tragedy. The story had progressed seamlessly in a positive manner, and there was no single hint that Chu Luoxun’s life would end like that. Even though the disease which had affected Chu Luoxun was not revealed throughout the story, it was very much curable. It was not similar to Yu Shengfan’s case, where she was the only one who had contracted that weird and mysterious terminal disease, which inevitably caused her death.</p><br/><p>Additionally, Yu Shengfan only died because Rosemary decided to give her a bento. Chu Luoxun, on the other hand, was destined to die the moment she appeared in the story. Due to this, Chu Luoxun’s death is clearly more associated with wickedness, carrying the aim of toying with the feelings of the readers, and is on a totally different level from Yu Shengfan.</p><br/><p>Therefore, as the readers were all caught off guard, they were incapable of thinking rationally before they spoke their minds, which was why Leng Zi got bashed mercilessly, and is currently even getting bashed for creating Chu Luoxun in the first place.</p><br/><p>At this point, Chu Luoxun’s fame and popularity had reached its peak!</p><br/><p>The one who benefited the most out of all of this, of course, is none other than the perpetrator who had been hiding behind the curtains all this while – Zhao Youyue.</p><br/><p>This time, her trip into the Two Dimensional Gate was a tough one. Not only did she have to put in a lot of extra effort, it had also taken up a lot of her time!</p><br/><p>However, when a girl that Zhao Youyue was waiting for finally appeared at the mysterious Two Dimensional Gate, she knew that all her effort was worth it! The girl had waist-length hair, was in a long, flowy dress, and held a violin. Various musical notes and instruments were hovering all around her, and she was just a beauty.</p><br/><p>Zhao Youyue has successfully obtained Chu Luoxun’s iconic character card!</p><br/><p>Now, even in music, Zhao Youyue can finally say with confidence, that she is unbeatable!</p><br/><p>Even though Chu Luoxun was just a Mary Sue in the novel, now that she has been brought into the real world, how amazingly will she do?</p><br/><p>Once again, as Zhao Youyue has successfully obtained another iconic character card, her knowledge as to how the Two Dimensional Gate determines whether someone is an iconic character has naturally expanded. Although popularity is the most important determining factor, Zhao Youyue now realized that the impression the character leaves on the public was also important.</p><br/><p>Currently, a large number of readers were still greatly affected by the death of Chu Luoxun. When they start to cool down a little, and begin to think more rationally, Chu Luoxun will still remain as a catalyst for discussion, which will continue to stir various analyses and predictions about her. Thus, in the midst of debates and open discussions, she will inevitably leave a mark in the minds of everyone involved, and be remembered, as long as they live.</p><br/><p>Frankly speaking, anyone who has read “Beautiful April” would definitely agree that Chu Luoxun ha left the most unforgettable impression on them. Even things like the perfect love between the male and female protagonist, and all their lovey-dovey ‘dog food’ scenes, are now functioning as multipliers which made Chu Luoxun’s miserable ill-fated life appear much worse than it is!</p><br/><p>Undoubtedly, tragedies are the type of stories that affect the readers the most. Thus, an easy way to get an iconic character card is to plan a really, really tragic death for the character way beforehand, and execute it right when the character’s popularity is soaring at its peak, and there you have it, a super easily obtained iconic character card!</p><br/><p>It was not as if Zhao Youyue cannot survive without iconic character cards, though. She did not really need them that much. If she has to make a character die every single time, she would probably cave in under the blood and tears. Zhao Youyue had only been trying extra hard for the Xu Jing and Chu Luoxun iconic character cards. The Yu Shengfan character card, on the other hand, was just an unexpected surprise.</p><br/><p>Now, Zhao Youyue can proudly tell the world that she has three wives!</p><br/><p>Since she had her hands on Chu Luoxun’s iconic character card, Zhao Youyue finally decided that she wanted to fully enjoy being a musical genius and utilize it to her heart’s content, for now. She was a healthy Chu Luoxun, after all!</p><br/><p>Translation note :</p><br/><p>[1] “Taobao” is a Chinese online shopping website, headquartered in Hangzhou, China, and is a subsidiary of Alibaba Group. It is one of the world’s biggest e-commerce websites, as well as one of the world’s top ten most visited websites according to Alexa.</p><br/><p>[2] “Mentioning” here refers to the act of tagging someone else, here, it is on the China chatting platform QQ, but it is also commonly used on any other social media platform. (e.g – @LengZi)</p><br/><p>[3] “Password red packets” is a function available to users of QQ, where they are able to attach ‘passwords’ onto red packets and send it out to their friends (usually in a group chat). If anyone in the group chat manages to guess the password, they will automatically ‘open’ the red packet receive the amount of money placed in the red packet by the original user.</p><br/>\n</div>"}