{"title": "Chapter 251", "id": 251, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-251", "volume_title": "Volume 3", "body": "<h1>Chapter 251</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Fresh Campus</strong></p><br/><p>The school uniform would become an unnecessity when students visit the campus over the summy break to be informed of their new assigned classes. One would crazy to wear it</p><br/><p>Before Zhao Youyue could explain that she was not a top student from a poor family, the school holidays have already started, as it was already the end of the semester. Therefore, whenever people thought of her, the image of “Xu Jing” would still come to their minds.</p><br/><p>Those who spend that little bit of time thinking about it would soon realize that things did not add up, after all. Zhao Youyue won the gold prize of the Provincial Violin Competition. A poor student could not possibly afford music lessons, right?</p><br/><p>Nonetheless, great minds would come up with great stories to great lengths and create some convoluted stories about how her family was rich when she was little, and her skills are a result of her dark history. That once well-off family could no longer even afford to buy extra clothing now</p><br/><p>Well, it is impossible to derail delusions so easily.</p><br/><p>After Zhao Youyue realized this, she no longer cared about how people thought of her. She just had to live her life as usual, and she did not have to prove herself to anyone. Before this, people had thought that she was merely pretending to be rich, when she bought the drinks and magazines for all her classmates. This had left her speechless.</p><br/><p>It didn’t matter much, as her true motive was to hard-sell “Beautiful April.” It was up to her classmates to decide on whether she was rich, or not.</p><br/><p>Still, Zhao Youyue believed that majority of her classmates were able to make a clear judgment about her family’s financial situation.</p><br/><p>However, Chu Luoxun was now written to death by Leng Zi after she had been hard-selling the “Beautiful April” to her classmates. A cold shiver ran down her spine when she remembered Jiang Chao being renounced by his friends, as a result of his brainless recommendation.</p><br/><p>She was not going to face the rage of the whole class, right? She knew that the effects of her hard-selling had been good. Other than those top students who emphasized on studying, others would be keen to read it, and most of them would be easily cheated by it, based on the quality of this work</p><br/><p>But Chu Luoxun was now dead!</p><br/><p>Suddenly, Zhao Youyue thought of how Chu Luoxun dressed in the novel. She would wear the custom-made, elegant, long, flowing dress when she goes on stage. This was her definition of formal attire, just like those female celebrities who walked down the red carpet when they attend a movie premiere screening and award ceremonies.</p><br/><p>Anyhow, she was not going to dress like this tomorrow even though her dressed were high-class than Chu Luoxun’s dresses. After all, Goddess Chu was not a missy who was as rich as her. Her family’s background was just at the well-to-do level.</p><br/><p>Chu Luoxun’s favorite style was a plain white shirt matched with a blazer, and a short pleated skirt. As for her shoes, she favored female campus-style oxford leather shoes or canvas shoes. This was her refreshing campus style that was repeatedly depicted in the novel.</p><br/><p>Zhao Youyue has never dressed like this before, as the typical male author created this, based on their mental imagery of the Campus Goddess, who was an extremely innocent high school student.</p><br/><p>When Zhao Youyue does not have to wear the school uniform, she would wear luxurious brand female clothing which gave her a matured and extravagant look. This was why she seemed more like an undergraduate to Su Li, Ye Hai, and the others</p><br/><p>In fact, she was far more matured than most of her peers. Let’s not forget that she had been experiencing other lives in the “Two Dimensional Gate” besides living her own life. Her actual experience would not match her chronological age.</p><br/><p>This time, she chose to wear the refreshing campus style as she had decided to play the role of the Goddess Chu perfectly. Her hair was long now, and she would not tie it up into a ponytail tomorrow. Instead, she would just put it down and pin on a hair clip. This matched the appearance of Chu Luoxun.</p><br/><p>Undeniably, Chu Luoxun was already dead in the novel. But, I will bring her to life in reality this was what Zhao Youyue thought.</p><br/><p>The second-day cometh. Zhao Youyue dressed herself up as aforementioned and was looking at herself in the mirror. It mildly embarrassed her, as she was trying to act young. However, this was actually how a sixteen years old female high school student like her should look like.</p><br/><p>Then, she noticed that her handbag did not match the clothing. Well, it is not possible for a high school student to own a designer handbag which would cost over ten thousand RMB. So, she replaced it with a small backpack and picked up her violin. She smiled at the mirror and said “Alright! The three dimensional Chu Luoxun is here!”</p><br/><p>Her driver, Liu Zhongcheng, was dumbfounded when he saw the sudden change of her style, thinking that Lady Zhao finally looked like a high school student today. Nevertheless, he did not speak his mind, but conscientiously opened the car’s door for Zhao Youyue as usual.</p><br/><p>Today, instead of asking the driver to stop her luxury car which cost about three million RMB a certain distance from school, she asked him to stop right in front of the school’s main gate. The weather was hot, going past thirty Degree Celsius. It was not as hot July, however.</p><br/><p>After all, her car was not as eye-catching as Zhao Hao’s sports car or as intimidating as a tough-looking SUV. It was just a typical black colored passenger car with a very low-profiled design, just like the other world’s Mercedes Benz S600.</p><br/><p>Therefore, not many people paid attention to it. Everyone was rushing into the air-conditioned classroom, due to the hot weather.</p><br/><p>Zhao Youyue came out from the car and opened her parasol. After she thanked Uncle Liu, she walked towards her classroom.</p><br/><p>The short pleated skirt that she wore today was shorter than the one she wore previously. This one was above the knees, revealing her flawless thighs. The shape of her legs were perfect too, and no one could stop themselves from looking at them.</p><br/><p>Instead of wearing the over-the-knee socks which were uncommon in the Three Dimensional World, she wore the black colored knee-high socks. This too, perfectly matched the description of the novel.</p><br/><p>As she walked into the classroom, she bumped into Zhu Ran, the class monitor, who was distributing some sort of document.</p><br/><p>He was stunned when he saw Zhao Youyue, who had let her hair down. Then, he said to her: “Excuse me. Are you entering the wrong class?”</p><br/><p>Then, he realized that he was wrong, as he could still recognize Zhao Youyue’ face. However, the short-haired Zhao Youyue would not be as striking as this long-haired one. The visual effect was vastly different!</p><br/><p>Also, her style today induced the feeling of love at first sight in all the male students, she simply looked too approachable</p><br/><p>Zhao Youyue smiled, and with her gentle and soothing voice, she said, “Class monitor, I am Zhao Youyue. I am not in the wrong class.”</p><br/><p>After that, she walked towards her seat.</p><br/><p>A pleasant scent breezed past Zhu Ran. He caught a whiff of it, and he could not resist from looking over his shoulder, at her back. He could not help but gaze at her fair, beautiful legs</p><br/><p>Silence fell, as soon as Zhao Youyue walked in.</p><br/>\n</div>"}