{"title": "Chapter 272", "id": 272, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-272", "volume_title": "Volume 3", "body": "<h1>Chapter 272</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Old Grievances</strong></p><br/><p>Everything was unfamiliar to Zhao Youyue. The class was unfamiliar; the faces were mostly unfamiliar. Well, this was understandable. Most of the student in her old class were your run-of-the-mill-trying-to-get-by-day-by-day folk. Lao Qiu would always proclaim in post examination class meetings, that this was the most terrible class that he had ever been forced to teach!</p><br/><p>Actually, he would say the same thing each one of his classes. It was impossible for him to remember each class distinctively.</p><br/><p>Of course, he remembered Zhao Youyue and Han Leng. Zhao Youyue’s results were comparable to Huang Zhongchao’s and she brought glory to her class. It was something worth being proud of.</p><br/><p>On the other hand, Han Leng’s talent also deserved note. It amazed him to see Han Leng’s first work being published. Han Leng, a freshman produced something that took the nation by storm. There would be no problem for him to make a living now, even if he withdraws from school now. Most of all, he made women’s clothing complete!</p><br/><p>Zhao Youyue sat down by herself. She had no idea that she had inadvertently attracted the attention of many students in that class.</p><br/><p>She did not know them, but it did not mean that they would not know her either. After all, she was an elite student who had been in the top five positions of the school, and she had once given speech during a flag raising ceremony. Moreover, the long hair version of her was on a whole new level of beauty. Therefore, it was hard for people not to notice her.</p><br/><p>This was the sense of visibility that she had been yearning for!</p><br/><p>However, this sense of visibility caused her problems that she would otherwise never even dream of encountering. For instance, envy stares from the same sex.</p><br/><p>Before this, she was just a side character. Nobody would be jealous of her or conversely, bully her. Everyone would just leave her to her devices. Nonetheless, everything has changed, now.</p><br/><p>Shen Menglian, who had a grudge against Zhao Youyue, would have never expected her to be in the same class. Well, this was to be expected, as they were evenly matched in History and Politics, and had opted for the same stream.</p><br/><p>Her friend, Xu Na, who she got along rather amicably, had chosen the science stream. If not for that, they would have been in the same class.</p><br/><p>Shen Menglian and Xu Na had once underestimated Lady Zhao who came to the top students’ gathering in her uniform. However, the truth brought shame upon them, serving not to their benefit, but only to expose them as frogs in a well.</p><br/><p>The Lady Zhao had not been bothered to show off her status as a Lady of “the Zhaos.”</p><br/><p>Shen Menglian was afraid of openly offending Lady Zhao, but she intended to cause her humiliation, one way or another. Working behind the shadows would be a good start!</p><br/><p>Of course, Lady Zhao would never know that she is the one behind the scenes</p><br/><p>She was a girl with extreme jealousy and a narrow-mind, but her results were excellent and she put up a good show of being the portrait of obedience and subordination before her teachers. To them, she was the ideal student.</p><br/><p>Perhaps she should get someone else’s hands dirty on her behalf. She caught sight of a girl who seemed like she could literally beat Zhao Youyue up.</p><br/><p>Shen Menglian focused her gaze on the girl who sat at her 1 o’clock. She was reading a reference book while the other students were busy talking. She had neat short hair, hair that is even shorter than Zhao Youyue’s old bob cut. There was no visible fringe which made it rather masculine. She sat with her back straight, looking purposeful and attentive.</p><br/><p>She was not particularly beautiful. Instead, she had the face of a Heroic Spirit, which somehow worked for her. Such a tomboy had the potential of becoming the “Man Boss [1]”.</p><br/><p>Her name was Bai Yunshan which sounded surprisingly feminine.</p><br/><p>Shen Menglian knew that her background was extraordinary, as they were also classmates prior to this. Her father was a Senior Colonel, if she was not mistaken. This was awesome. An actual second generation “soldier!”</p><br/><p>The teacher had appointed this Bai Yunshan as the class monitor. She seemed to have settled into the role, one that she had carried throughout her entire school life. She treated her classmates with no-nonsense strictness, and on herself, even more so!</p><br/><p>She rarely communicated with anyone else, and couldn’t even be bothered to join co-curricular societies like other students. She had been reluctant when it came to joining the Top Student Society too which was organized by Guo Peisheng, even though she was a member of the Student Union.</p><br/><p>Her attitude could be aptly summed up with two words, “coldly arrogant.”</p><br/><p>Shen Menglian started to plan on how to make Zhao Youyue, the rich man’s daughter, and Bai Yunshan, the second generation of a militaristic family who was equal in stature to the former butt heads. Based on her instinct, they were completely incompatible existences.</p><br/><p>She would never forget Zhao Youyue’s infuriating eating habits, where she would order a wide variety of dishes just to have a taste, not to fill her gut. On the other hand, Bai Yunshan who was born into a different variation of what you call an outstanding family, was a utilitarianist. Whenever she has lunch in the canteen, she would clean her plate, leaving not a single grain behind!</p><br/><p>It was not an act, it was her way of life. She had been brought up this way.</p><br/><p>Besides that, Bai Yunshan was a girl who would also wear the school uniform to school during weekends. It was not for convenience, but as an obligation. She obeyed the school’s rules to the letter, and if she would have things her way, she would rather have others obey those fundamentals as well.</p><br/><p>Not many found her likable. If Zhao Youyue was a voice of reason and moderation, who easily appeals to the social side of people, Bai Yunshan was the complete opposite, straight-laced and no-nonsense. In her world, everything is either white or black; there were no grey zones.</p><br/><p>Finally, their new class teacher entered the class. He was broad around the middle and stern. He taught mathematics, and his name was Yang Liqun.</p><br/><p>As usual, Zhao Youyue leisurely played her cell phone. She started to miss the handsome mathematics teacher, Gu Yaoyan, the moment she learned that this fatty Yang would be their mathematics teacher. She always wanted to gang up on him to have a round of LoL, but she never remembered to make it happen.</p><br/><p>Although Gu Yaoyan was a capable mathematics teacher, he was not qualified to teach the intensive class. He could only teach the standard classes.</p><br/><p>Yang Liqun appeared to be much more dignified, compared to her former class teacher, Lao Qiu. Lao Qiu was a calculative person, while this fatty Yang is rather forthcoming</p><br/><p>Firstly, Yang Liqun gave the class an admonitory speech, telling them not to take it easy by thinking that everything would be fine after entering the intensive class. The eleventh grade would be the most crucial stage of their entire high school life!</p><br/><p>The sharp-eyed Shen Menglian noticed Zhao Youyue still playing her cell phone. She quickly nudged Bai Yunshan who was sitting at her 1 o’clock. When the “soldier” turned her head slightly, she whispered to her, “Class monitor, there is a student over there playing her cell phone.”</p><br/><p>She pointed towards Zhao Youyue, and watched in anticipation.</p><br/><p>This was the first time Bai Yunshan had ever gazed upon the long-haired version of Zhao Youyue, who she found remarkably gorgeous. She stood up without any hesitation and said, “Teacher Yang, Shen Menglian is not listening to your speech, rather, she is trying to talk to me.”</p><br/><p>She sat back down.</p><br/><p>Shen Menglian was left stupefied.</p><br/><p>Translation note:</p><br/><p>[1] Man Boss is referring to a female who dresses up as a male, and does a good job of it, often appearing as dashing young men.</p><br/>\n</div>"}