{"title": "Chapter 270", "id": 270, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-270", "volume_title": "Volume 3", "body": "<h1>Chapter 270</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>: Second Year of High School Begins</strong></p><br/><p>The whole of Zhao Youyue’s latest live stream had been recorded by a loyal fan who was subsequently uploaded to Bilibili[1], which of course, went viral!</p><br/><p>This was mainly because Bilibili was filled with fans of “The Strongest King” and was somewhat a platform for the die-hard fans to share information about the novel with each other. Now, since a live streamer had popped up from nowhere, who could not only perfectly imitate the gaming skills and playstyle of Yu Shengfan, the main character in “The Strongest King”, but also sing the song – “Parallel Galaxies” in the real world, even though it was a song that only existed in the novel, who wouldn’t be surprised?</p><br/><p>Some crazy fans were constantly uploading and sharing their fan artworks and renditions of Yu Shengfan, but the only thing that they could not get a hold of was “Parallel Galaxies,” originally sung by Ah Yu herself. Now that there is finally someone able to recreate the song in the real world, and so flawlessly at that too, can there possibly be any other fanmade material that can top this?</p><br/><p>Today is the day the live streamer Ah Yu becomes known to the group of fans of 2D characters. However, this time, Zhao Youyue did not advertise herself as Douyu’s Yu Shengfan in order to gain more attention. Due to her increasing popularity, the 2D fans became inclined into thinking that she was the 3D version of Ah Yu…</p><br/><p>Previously, no matter how many times she claims to be the 3D Yu Shengfan, her follower count would not really increase, and nobody would go so far as to deliberately record her entire live stream.</p><br/><p>Evidently, her popularity and influence on the general public were both experiencing a gradual increase.</p><br/><p>However, the ‘aesthetic researchers’ of “Beautiful April” were not smitten by this live streamer who became a hot topic, all of a sudden. Even though Bilibili was not the main platform for the fans of “Beautiful April,” as they tend to gather on other platforms like Weibo, Douban[2] and Zhihu[3] instead, they were still up to date and aware of what was trending.</p><br/><p>The news had spread like wildfire across various platforms. Therefore the “Beautiful April” fans obviously got to know about the live streamer called “Ah Yu” who sang songs from the novel which were written by Chu Luoxun, like “Sweet” and “I Left the Sadness to Myself.”</p><br/><p>Initially, when the ‘aesthetic researchers’ heard of such news, they immediately gave a snort of contempt, as they only harbored one school of thought —- —-</p><br/><p>It would be very much appreciated if no one attempts to tarnish the reputation of the perfect, musically talented Goddess Chu, how could anyone in the real world possibly recreate the work of Goddess Chu?</p><br/><p>However, the moment they finished listening to Ah Yu’s version of “Sweet” and “I Left the Sadness to Myself,” they were speechless!</p><br/><p>Which planet is this magical being Ah Yu from?</p><br/><p>Could it be, that she is a professional composer? Or is she an expert singer-songwriter that specializes in making original pieces?</p><br/><p>Considering how difficult it is to be able to create original pieces that sound this pleasant, and are even very capable of becoming hit songs, why would she proceed to randomly sing them during a live stream like it means nothing to her…</p><br/><p>If she is not the one that made the songs, why would the original maker allow her to simply use the songs as she liked. Wouldn’t this be a total waste of the true potential of the songs?</p><br/><p>Wouldn’t she want to profit from these songs?</p><br/><p>Is she just like Chu Luoxun, one who finds the most joy in sharing her music?</p><br/><p>This is simply inconceivable!</p><br/><p>Consequently, a lot of “Beautiful April” fans soon developed a new interest in this particular female live streamer. When they heard that she was also good at playing the violin, they grew even more surprised!</p><br/><p>Could it be that Chu Luoxun, who died on the operating table in the novel, had been revived in the real world?</p><br/><p>If so, what did this female live streamer Ah Yu look like, is she flawlessly beautiful like Goddess Chu?</p><br/><p>It was a pity that Ah Yu had never turned her camera on, ever. Nobody had any idea on how she looked like at all. All that is known is that she was exceptionally talented, and had a beautiful voice with an extensive vocal range which allows her to easily switch between various types of voices, mature, lolita, you name it.</p><br/><p>However, there were still some Chu Luoxun extremists who were unwilling to admit that Ah Yu’s version of “Sweet” and “I Left the Sadness to Myself” were pure perfection. Although deep in their hearts they knew it was the truth, they did not want to accept it. To them, there will never be anyone in the real world who can have the musical talent of Goddess Chu!</p><br/><p>Someone as perfect as Goddess Chu can only exist in novels…</p><br/><p>Howsoever, there is no doubt that the female live streamer Ah Yu’s popularity had recently risen at a shocking pace, on Douyu. When the Douyu officials saw that she had great potential, they went on to advertise her everywhere, causing her followers and subscription count to increase rapidly to the point where it reached more than a million people.</p><br/><p>It was obvious that the Douyu officials were aware of how much power Ah Yu had over the viewers. She could captivate such a large number of viewers through the mere use of her own talents, even without turning her camera on. The day her camera flickers on, to what level would her popularity possibly rise to?</p><br/><p>Within a few days, Zhao Youyue had already settled everything in relation to her new Weibo account, as well as her new NetEase Music account. Even though she did not purposely share any information with the viewers at all, her follower count on the newly created accounts still managed to reach thousands in the blink of an eye. This was evident of the huge influence that Ah Yu had on the general public.</p><br/><p>The author of “Beautiful April,” Han Leng, had also heard about the female live streamer Ah Yu. Fortunately, he did not know that Ah Yu was, in fact, Zhao Youyue, or else he would definitely harbor great suspicion towards her!</p><br/><p>The moment he heard the songs of “Sweet” and “I Left the Sadness to Myself,” Han Leng was startled. It was just like how Ye Hai felt when he first heard “Parallel Galaxies.” If Han Leng were to have an in-depth discussion with Ye Hai about this, they would definitely realize that there was a serious problem!</p><br/><p>However, Ye Hai, on the other hand, did not give much thought to it. He thought that it was purely coincidental, and was in awe of Lady Zhao’s musical talents…</p><br/><p>Even so, Han Leng decided to subscribe to the female live streamer Ah Yu, and planned to wait to see what happens next.</p><br/><p>Only one thing has really bothered Han Leng recently. The thing is, he had assured his class teacher Old Qiu that he would not make Chu Luoxun die in his book, but he had not kept to his words.</p><br/><p>Old Qiu was of course very unhappy with this, and said things like Han Leng being naughty. Just because he was not going to be teaching Han Leng anymore in the next school year, Han Leng decided that he could toy with his feelings?</p><br/><p>Han Leng obviously did not know what to say to that, thus he once again brought up the old excuse of how he did not want to make Chu Luoxun die, it was not deliberate, and it was only because he had unknowingly lost all control of his mind…</p><br/><p>Old Qiu, being a nice, good-tempered person, was quick to move on from the frustrating topic, and went on to ask Han Leng about what was with his impressive cross-dressing pictures. Han Leng could only say that he did it to apologize to his readers, it was the only way.</p><br/><p>Old Qiu was in awe of how fast the world is changing; it was completely out of human expectations. Nowadays, male authors would be so willing to cross-dress without reservations, and end up looking better than real girls. The world is truly ever-changing, therefore Old Qiu had requested for Han Leng to give him a copy of all his cross-dressing pictures.</p><br/><p>Han Leng, without hesitation, had happily handed his pictures over. Old Qiu can slowly admire the pictures as much as he wants to.</p><br/><p>In the end, Han Leng had successfully kept the promise which he had made to Zhao Youyue. In high spirits, he had tried on various types of girl costumes, and took a lot of pictures. Although he insists that he is definitely not into cross-dressing, his body language spoke otherwise…</p><br/><p>Zhao Youyue did not upload any of Han Leng’s cross-dressing pictures on the internet. However, Han Leng, on his own accord, had logged into the Weibo account of “Leng Zi,” and shared all his eye-catching cross-dressing pictures there. Due to his amazingly beautiful appearance, his subscription count had immediately increased by a whole lot. Thus he got a little overexcited, and went on to tell everyone that he would crush the hopes and dreams of all his fans in the near future, because he was actually a guy!</p><br/><p>Someday, he will definitely be beaten to death!</p><br/><p>…</p><br/><p>Time flew, and it was almost time for Zhao Youyue to start her second year of high school.</p><br/><p>Now that Zhao Youyue had the “Xu Jing card” with her, she was not afraid of the challenges that she might face in school anymore. In fact, she was jubilant about the new school year, as she would be able to experience a new environment and meet new classmates.</p><br/><p>The Two Dimensional Gate was still in cooldown, and there is no clue as to when it would activate itself again, or what kind of world it would take her to next…</p><br/><p>Zhao Youyue really intended to possess the cooking skills so that she could make light-emitting cuisines, or to have the leadership skills of an iron-willed empress, so she could enjoy the lazy life and do nothing all day long. However, she had a feeling that the Two Dimensional Gate would definitely trick her once again and throw her into a world full of difficult obstacles, the kind of obstacles that were almost impossible to get through, just like last time.</p><br/><p>If she could sacrifice an iconic character card to be able to choose the kind of world she transmigrates into, Zhao Youyue would definitely do it.</p><br/><p>Translation note :</p><br/><p>[1] “Bilibili” is a video sharing website themed around anime, manga, and game fandom based in China, where users can submit, view, and add commentary subtitles on videos.</p><br/><p>[2] “Douban” is a Chinese social networking service website allowing registered users to record information and create content related to film, books, music, recent events and activities in Chinese cities.</p><br/><p>[3] “Zhihu” is a Chinese question-and-answer website where questions are created, answered, edited and organized by the community of its users.</p><br/>\n</div>"}