{"title": "Chapter 278", "id": 278, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-278", "volume_title": "Volume 3", "body": "<h1>Chapter 278</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Acceptance of such a Setting…</strong></p><br/><p>Zhao Youyue did not know that the song existed within another world as well. It was the Mandarin version of the OP of “Bakus Kydai Let’s &amp; Go!!”. Parallel universes were interesting.</p><br/><p>She had not watched “Bakus Kydai Let’s &amp; Go!!”. However, this did not stop her from enjoying “The 4WD God”.</p><br/><p>“Bakus Kydai Let’s &amp; Go!!” was led by a pair of deuteragonists, while “The 4WD God” was led by a protagonist Zhang Haolie. He was the combination of the deuteragonists in “Bakus Kydai Let’s &amp; Go!!.” This would be a Pseudo-Invincible styled[1] anime.</p><br/><p>Apparently, Zhang Haolie would never start a race smoothly. He would always fall behind at the start. However, just as Ultraman would only show his strength when his red light beeps, Zhang Haolie would only speed up during the later stages. This would be textbook shonen. The main character would always blow up with passion and claim victory with a bang.</p><br/><p>In reality, it sounded ridiculous, being able to egg a mini 4WD on by shouting, or to release the ultimate skill ‘Victory Charge Tornado’ by hollering out the skill name. Yet, it worked, every single time.</p><br/><p>Whenever Zhao Youyue saw the male protagonist’s mini 4WD releasing its ultimate skill, her mind would freeze—— how did this even work?</p><br/><p>This was the bane of all human intelligence!</p><br/><p>Yet, she had to admit that such a setting was very sensational. The male protagonist’s cries would reach her and boil her blood, and she would sincerely hope for him – who would be brimming with positive energy – to win the competition.</p><br/><p>No wonder so many kids dug this anime. In fact, some works would not require any rationality at all. Once you look past the lack of logic, it did have its appeal. Such genre is similar to those ‘killer sports’ works. They took different approaches, but reaped equal results.</p><br/><p>Zhao Youyue remembered once watching an anime that was related to spinning tops. Those spinning tops would be able to summon divine beasts and carry on battling on another level. Wasn’t that ridiculous? Not to the kids. They took it all in stride</p><br/><p>How boring would it be, if mini 4WDs, tops, and yo-yos in anime obediently followed the rules of reality.</p><br/><p>These anime have all been produced to sell the toys. They were all large-scale, feature-length advertisements.</p><br/><p>Now that “The 4WD God” anime is being broadcasted to great effect, all mini 4WD models within the series are being highly demanded. Many kids believed that they would be just like the characters within the anime, releasing ‘ultimate skills’ and winning competitions.</p><br/><p>Zhao Youyue’s purpose of creating a female character this time was not to obtain any sort of ability, but to obtain a ‘high popularity character card’ as a consumable.</p><br/><p>Therefore, she did not need to apply a hack on herself, she was not here to create another Mary Sue character, such as the perfect goddess, ‘Chu Luoxun.’</p><br/><p>It would be best to stick to the storyline and obtain a high popularity character card.</p><br/><p>She chose to toss aside the idea of working for another iconic character. Disasters don’t happen in tales for kids.</p><br/><p>Actually, something could be made out of it. “Eva” was a good example. After the heroine died, her spirit possessed the male protagonist’s racing car, becoming one with the machine. Even when the car runs out of battery, it would stir to live at the crucial moment, turning the tables upon the enemy, terrifying all who witness it!</p><br/><p>Wouldn’t that be fantastic?</p><br/><p>She could always work something out.</p><br/><p>However, Zhao Youyue did not want to die anymore. This piece of work was meant for kids. Let’s spare them the grief and harshness of reality.</p><br/><p>She did not dare to cause random mess onto such an extremely popular work. If not, her destiny might be reversed, and that was not something funny.</p><br/><p>The male protagonist Zhang Haolie was extremely popular. The popularity of the work only served to boost his own popularity. He was just one step away from becoming an iconic character. Unfortunately, he was not a female. Or else, Zhao Youyue would be able to her first ever ‘easy win.’</p><br/><p>However, due to the explosive popularity of “The 4WD God”, it wouldn’t be very difficult to create a highly popular female character. She had to be unique in her own way. She had to be formidable.</p><br/><p>This would depend on Zhao Youyue’s own imagination. The more the better, without ruining the work.</p><br/><p>She only needed to possess a female character and conquer the invincible male protagonist once. That would be more than enough for the audience to remember her.</p><br/><p>However, she sensed that the scriptwriters of the original anime would never approve of such a plot. Ultraman would never be defeated by any monster. Even if he were to be defeated by one, that monster should probably be the ultimate monster which had been lurking about and built up with layer after layer of foreshadowing, not by a little monster that suddenly pops out of nowhere.</p><br/><p>If there are any flaws in this anime, it would be the fact that none of the female mini 4WD players had left a deep impression on the kids yet. The female players were mostly passerbys. Having a passerby defeat the male protagonist all of a sudden would make no sense.</p><br/><p>The scriptwriter would immediately notice the oddity, and dismiss the results of that ‘intoxicated’ state.</p><br/><p>Zhao Youyue had even done some research on the anime’s scriptwriter. His name was Tian Jun. This anime was his third mini 4WD-based work. His first two animes had obviously paved the way for this third one. It was also the best in all aspects, among all three animes.</p><br/><p>The third anime had even adopted a newer, updated art style. The anime would not have been as popular without it.</p><br/><p>Zhao Youyue is always well-prepared when she resolves herself to take something seriously. She had not yet thought of any breakthrough ideas. Therefore, she chose to finish all the previous content first.</p><br/><p>She even entertained the thought of not even being a player, but as a competition commentator or a mini 4WD developer. However, the named female characters were all primary school students. They were the same age as the male protagonist Zhang Haolie. It made no sense for a primary female student to be a commentator or a researcher.</p><br/><p>Moreover, Zhao Youyue did not know the anime’s scriptwriter. It would be very troublesome to get him to create an elder female side character. After all, this was a long-running anime. It was not so easy to add a new character out of the blue.</p><br/><p>Besides, the viewers have grown familiar with these primary female students with names. They had accumulated a degree popularity. She would just need to put in some effort and the female character would amaze the audiences!</p><br/><p>She zeroed in on a particular character. It would be a female mini 4WD player. Now, she had to find a way to make her stand out among the kids and receive her next high popularity card!</p><br/><p>Zhao Youyue was currently out of ideas. Therefore, she bought a mini 4WD ‘The Last Saber’ model used by Zhang Haolie on her way to school that day. It was the second generation saber, similar to ‘Victory Charge.’ She started to assemble the mini 4WD excitedly during recess…</p><br/><p>The class rep Bai Yunshan gazed over her shoulder angrily. “This Zhao Youyue is messing about again. Is she a primary student?”</p><br/><p>It was already the middle of September. One of the more recent concerns in school was the coming Autumn Sports event. This was not good news for the Arts intensive class. They did not want to participate in the sports event. None of them were athletic. The last thing they would want is to take part in the scariest sports event —— the 3,000-meter long run!</p><br/><p>That event would murder them!</p><br/><p>Translation Note:</p><br/><p>[1] Pseudo-Invincible style – It refers to anime that imitates the main character’s style of being invincible.</p><br/>\n</div>"}