{"title": "Chapter 283", "id": 283, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-283", "volume_title": "Volume 3", "body": "<h1>Chapter 283</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Obtained a High Popularity Character Card</strong></p><br/><p>As long as a special move is silly and illogical, it would definitely become a trend on the internet, no matter what it was or what it does. Even more so when the name of the special move sounds dumb as well, like “Angry Crow Takes Flight.”</p><br/><p>Xiao Chun’s retarded mini 4WD car would turn out to be the ultimate countermeasure against the “The Destruction Corps,” – the villains of the anime. These “The Destruction Corps” were the type who never once raced accordingly to see who had the fastest mini 4WD car. Instead, they specialized in destroying the mini 4WD cars of others during races, and took great pleasure in doing so. However, if you think about it, this is a strategic way of winning a race —- —- if all the opponents’ mini 4WD cars are destroyed, wouldn’t they be the only racers left and win by default?</p><br/><p>“The Destruction Corps” usually had the most high-tech mini 4WD cars. It was normal for their cars to have offensive weapons like air knives and air bombs. Some of their cars were so high-tech that they had needles attached to their front bumpers. These needles would be controlled via infrared rays. With a simple command, some members of “The Destruction Corps”could even activate special moves and special suspensions would raise their cars up enough to smash the other mini 4WD cars in the race, permanently destroying them…</p><br/><p>Xiao Chun’s retarded mini 4WD car was the “The Destruction Corps'” antithesis, for its specialized shell was sturdy enough to finish any race, no matter what. Moreover, as Xiao Chun had expressed that she still had some deadly moves up her sleeve, she could easily tie “The Destruction Corps” down and keep them in check, as the male protagonist Zhang Haolie goes on unhindered!</p><br/><p>Zhang Haolie was persistent in ensuring that he would only stick to the principles of racing to see who had the fastest mini 4WD. He would never do something like what “The Destruction Corps” did, just to win a race. If he competed in such a disgraceful manner, wouldn’t he be considered a worthless vandal as well? Zhang Haolie was resolutely righteous and firm with his beliefs.</p><br/><p>Xiao Chun, on the other hand, was not as righteous as Zhang Haolie. Since she had various types of mini 4WD cars, wouldn’t it be fun, if she specially designs a few mini 4WD cars to destroy other cars?</p><br/><p>After all, Xiao Chun was the experienced idiot. She would drag others down to her level and beat them with that experience. She was the guardian of all past victims of “The Destruction Corps.” Naturally, the children watching the anime would find Xiao Chun intriguing and hilarious.</p><br/><p>This time, Zhao Youyue’s plan was to make the lively, dorky Xiao Chun, who owned a glorious mini 4WD, turn to a funny and sarcastic character, as well as a strong and respected heroine who would constantly keep “The Destruction Corps” in check, yet be plagued by the husky running gag.</p><br/><p>As Zhao Youyue carried out her plan, the scriptwriter – Tian Jun grew intoxicated. Feeling a sudden burst of inspiration, he ended up developing more of the plot and even went on to draw “The World’s Soaring Crow,” which looked as dazzling as the Batmobile!</p><br/><p>Tian Jun was not only the scriptwriter for the anime of “The 4WD God”. He was also a designer of mini 4WD cars, and had shares in a company which produced them. If not for this, he would not have made 3 animes about mini 4WD cars.</p><br/><p>When Tian Jun saw how cool Xiao Chun’s mini 4WD car looked, he decided that he would not remove it from the anime. It did not matter if it was slow. If it looked this good, it would sell like hotcakes in the real world!</p><br/><p>Then, he proceeded to review his newly written episode. He did not find it funny at all, but he felt that Xiao Chun’s character was progressing rather meaningfully…</p><br/><p>At the end of it, he considered it an acceptable progression. It did not divert from the plot heavily, nor did it affect the main character in any way. Furthermore, he could utilize Xiao Chun’s character to slowly and deliberately lighten up the nerve-wracking and tense atmosphere of the story. A character like Xiao Chun could serve as a good outlet.</p><br/><p>After Tian Jun handed the new episode over to the anime supervisor and the animation department, they started to work on it. As the team was working on the character of “Zhou Chun,” it was as if they had magically received a “buff.” Even the voice actress became fully engrossed in her work. It was just like “War Heroes,” where the entire scriptwriting team got intoxicated. This time, however, it was the whole production team who got intoxicated!</p><br/><p>This was the power of the “Two Dimensional Gate,” an existence that was far beyond human comprehension, but nonetheless still existed. It was something like causuality[1], whatever Zhao Youyue did would inevitably influence the creator’s mind.</p><br/><p>Zhao Youyue now kept herself updated with anything related to “The 4WD God.” The newest episode was released fairly quickly, so she had the opportunity to watch the reformed “Xiao Chun,” who now had a higher sense of presence and a completely different personality. Of course, the general public would not be able to tell that Xiao Chun’s personality has changed drastically, because she had always been a vivacious girl. Now, she was not only vivacious, but retarded as well…</p><br/><p>Zhao Youyue felt embarrassed watching herself. If she was not “Xiao Chun” herself, she might have found the new episode interesting and funny. Now, the only thing she felt was a deep embarrassment. In order to obtain a high popularity character card out of this, acting like a total clown should be good enough.</p><br/><p>Some people enjoyed the new episode very much, like the sports commissioner Lu Rui from Zhao Youyue’s class. The fact that he could watch a childish anime about mini 4WD cars with relish proved that he was a true fan of mini 4WD cars.</p><br/><p>Lu Rui was very satisfied with the amount of screen time that Xiao Chun had in this episode. The anime production crew certainly knew how to seize an opportunity. Although this episode clearly drew reference from those archetypical silly characters found in bishoujo anime[2], it fitted into the story nicely. Xiao Chun was an elementary school student after all, should it matter if she was a little silly and foolish?</p><br/><p>Moreover, the voice actress of Xiao Chun was also really proficient. Thus, Xiao Chun became a lot cuter and way more appealing. Since her humor was cynical and snarky, she had grown to be the ultimate comic relief!</p><br/><p>Many children also watched the latest episode. Initially, they were all captivated by Xiao Chun’s cool mini 4WD car. However, when they realized that her mini 4WD car only looked good, and was utterly useless in other aspects, they were amused. Xiao Chun’s special “Angry Crow Takes Flight” also made them laugh uncontrollably. This girl was just too cute!</p><br/><p>As more episodes were released, Xiao Chun’s personality finally underwent some gradual form of development. She was now a lot funnier. Also, people were amused by how her silly pet husky, which was her “worst enemy,” would always snatch her mini 4WD cars away from her!</p><br/><p>Additionally, it was clear that Xiao Chun was foolish and stupid, but she somehow still manages to give “The Destruction Corps” a hard time and mess up their plans. All the children found the fact that she was unintentionally protecting the interests of the main character highly entertaining!</p><br/><p>They also liked Xiao Chun, because she had a wide variety of mini 4WD cars that seemed to come out of nowhere. It was as if she was trying to gain victory by having the most cars or the best-looking cars. Furthermore, she was the perfect assistant who ensures that the male protagonist wins all his races. She wholly deserved to be the real female protagonist of this anime!</p><br/><p>Some people even took pity Xiao Chun, as she had never won a single race before. She would always be the last one crossing the finishing line. They sure hoped that the production team of the anime would let her win at least once in her lifetime…</p><br/><p>Since this anime was already close to being a highly popular anime, it was only natural that Xiao Chun would become a highly popular character as well. As long as Xiao Chun is molded with care, she would find her spot among other popular characters.</p><br/><p>Some nosy people had even compiled Xiao Chun’s various facial expressions into a sticker pack. When an anime character has their own sticker pack, this can only mean that they have already become extremely popular!</p><br/><p>Even though it was an anime about mini 4WD cars, a fair bit of adults watched it. These are mostly adults who were still young at heart, and are also the most likely purchasers of such sticker packs.</p><br/><p>It was now the beginning of October, and Zhao Youyue had just finished her first monthly examination of her second year of high school. The opening ceremony of the Autumn sports competition would be held very soon. At this time, Zhao Youyue received a reminder from the “Two Dimensional Gate.” The elementary school student “Zhou Chun” was now a highly popular character!</p><br/><p>Without hesitation, Zhao Youyue decided to take her leave. Upon her exit, she successfully obtained a “highly popular character card”!</p><br/><p>Translation note :</p><br/><p>[1] “Causuality” is the doctrine or theory that every event is the result of a prior and adequate cause.</p><br/><p>[2] “Bishoujo” literally means “pretty girl” or “beautiful girl” in Japanese. Bishoujo animes are animes that are full of pretty girls. ED: Or rather, targeted for young female viewers.</p><br/>\n</div>"}