{"title": "Chapter 289", "id": 289, "volume": 3, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-289", "volume_title": "Volume 3", "body": "<h1>Chapter 289</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>This Makes no Sense!</strong></p><br/><p>Without hesitation, Zhao Youyue activated the highly popular character card, the Zhou Chun Card, transforming herself into Zhou Chun, a primary student who is able to run forever. The only downside of Xiao Chun was that her Mini 4wd was immensely slow, otherwise, she would have been like a gazelle!</p><br/><p>Once again, Zhao Youyue who ran ahead of the pack became the center of attention. However, this was what everyone had to say about it —</p><br/><p>“It seems like that beautiful girl really has no idea what the 800-meter race is all about. She has to run two laps around the field. Well, she’ll drop out soon enough. Only an idiot would go all-out from the beginning!”</p><br/><p>“You’re right! Look at that sports class student. She may be second last now, but she knows what she’s doing. She should pace herself, and then sprint at the last moment.”</p><br/><p>“Oh man! She is the most beautiful one among all the other participants, but, why is she wrapped up in so many layers? I can’t see her boobs!”</p><br/><p>“Hey! Don’t be such a perv, okay! Don’t you know that she is the campus belle of our school’s eleventh grade? She has a name, and it’s Zhao Youyue! Her long hair is so beautiful! She is my goddess, and I never thought that the running style of a goddess would be so graceful! Her starting position with her arms akimbo is a statement! She rocks!”</p><br/><p>Meanwhile, Huang Zhongchao, the president of the student union was astonished to see Zhao Youyue running at full speed. At first, he had thought that the lazy Lady Zhao walks around the track, but, she was actually sprinting from the beginning.</p><br/><p>This changed how he perceived her. After that unhappy gathering, he had been presuming Zhao Youyue to be an extremely demanding rich man’s daughter. She was indeed beautiful, but, it would be torturous to deal with her! She would want everything in her way, or there will be hell to pay!</p><br/><p>At the same time, Zhao Youyue was receiving a variety of encouraging words from her classmates. Everyone started to write the encouraging words enthusiastically. Besides that, many of her classmates were encouraging her from the sidelines too</p><br/><p>They shouted loudly. Even the students of other classes were fascinated by her beauty, including her juniors from the tenth grade. Basically, the sports competition had nothing to do with the twelfth-graders, as studying was their main focus. Well, their school was extremely strict on the twelfth-graders!</p><br/><p>They would not even be seen in the student union.</p><br/><p>Han Leng, who was not even Zhao Youyue’s classmate anymore, wrote encouraging words for her too. Instead of being showy, he wrote plainly—</p><br/><p>Stepping on the track is a choice. Leaving the starting point is an act of courage. Running on the track is the beginning of a victory. Zhao Youyue, use your strength and your willpower to reshape the world of the long-distance run into yours!</p><br/><p>That’s right. Zhao Youyue participating in the sports competition was a precious event for him.</p><br/><p>One should know that Zhao Youyue was still a side character that everyone had ignored at this time of last year. But, all eyes were on her!</p><br/><p>Her spirit deserved praise!</p><br/><p>She won’t stay in front for long, and would soon be left in the dust when her strength wanes, but at least, she fought a good fight!</p><br/><p>As everyone had those thoughts, Zhao Youyue ran with no signs of slowing. She murmured all sorts of gibberish such as “Angry Crow Takes Flight.” Nonetheless, she kept an eye on her stamina bar at the same time.</p><br/><p>Noticing that she was about to lose her stamina after she had run for more than a hundred meters, she beckoned Bai Yunshan who was standing at the side of the track. She ran towards her to take the sports drink and glugged it. Then she continued to run with the same speed as it was in the beginning. After her stamina was restored, the fatigue was completely alleviated. She sustained her high speed in this way.</p><br/><p>This would only be allowed in the informal school sports competition. It was not a marathon after all</p><br/><p>Zhao Youyue was applying the rules of a marathon run on the 800 meters race. However, this matched the scene in the animated “Mini 4WD.” The primary school students were marathon runners who rewrote the rules of cross-country, they were like immortals!</p><br/><p>The difference was that they would not need to replenish themselves with water as they become one with the cars. As long as their cars still work, so would they!</p><br/><p>After seeing Zhao Youyue sprinting to the front off the line, Yu Jia, the sports class student laughed in her heart, thinking that a layman like her really had no idea on the concept of pacing. Unlike short-distance races, long-distance races would require endurance. If she is able to run 200 meters at such speed, Yu Jia thought to herself that she should just drop out of school, go home, and get married!</p><br/><p>Then, she saw Zhao Youyue chugging down the sports drink. A cynical smile formed on her face. She’s giving up after a hundred meters? Does she think that she’s running a marathon?</p><br/><p>Never would she know that Zhao Youyue was unhappy with herself too. This was what she thought, “Damn it! I would not have to replenish myself with this soft drink if my beloved car, “The World’s Soaring Crow,” was with me. I could run until its battery dies!”</p><br/><p>Even so, she could continue her race by changing the battery of the beloved car until the Mini 4WD race is over!</p><br/><p>Speaking of her beloved car, she thought of her “eternal enemy,” her husky pet. It would have been great, if it was here. Following it as it runs off with her beloved in its mouth, would give her even more power!</p><br/><p>Zhao Youyue noticed that the sports drink did not enter her stomach. Instead, its energy was being extracted and injected into the “character card.” The character card was the fuel tank represented by the “stamina bar.”</p><br/><p>Zhao Youyue would definitely suffer if the drink really gets into her stomach, as the liquid would slosh in her stomach as she ran.</p><br/><p>Actually, any other form of junk food would help her restore her stamina, but she would look weird. Wouldn’t it be weird, eating junk food after every 100 meters?</p><br/><p>It looks like Zhao Youyue has forgotten about the energy bars that one bites into as they run. After all, food can be transformed into energy.</p><br/><p>The smile on Yu Jia’s face gradually disappeared. It did not take her long to notice that the beautiful young girl whose stamina seemed to have depleted, start running at full speed again!</p><br/><p>How could this be?</p><br/><p>Am I living in a nonsensical game world? Could stamina be instantly restored by drinking alone?</p><br/><p>This made no sense!</p><br/><p>Yu Jia was confused now. Betting on the dignity of Sports Students, she increased her speed to keep up with Zhao Youyue</p><br/><p>She would be able to surpass Zhao Youyue when she slows down to drink, but Zhao Youyue would retake the lead, immediately after that. After going back and forth like this for 500 meters, she was completely exhausted!</p><br/><p>Zhao Youyue, with all her cheats, had brought a trained sports students down!</p><br/><p>In the last 100 meters, Zhao Youyue noticed no one beside her. This was why they say that “The greatest is always the loneliest.”</p><br/><p>She decided to deactivate the character card and complete the last 100 meters under her own power. As expected, she ran leisurely, as sweating just a little was her goal</p><br/><p>However, the cheers for her tore through the sky!</p><br/>\n</div>"}