{"title": "Chapter 304", "id": 304, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-304", "volume_title": "Volume 4", "body": "<h1>Chapter 304</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Matters Related to Doujin Work</strong></p><br/><p>Zhao Youyue opened the game. The first thing that greeted her was some vivacious and gleeful 8-bit music which caused her to bob her head up and down. She found it most interesting.</p><br/><p>She knew that “Dreamside Maroon” had been created by “Lady ZUN” alone, and this person was a boss of the Doujin Circle. She was also a wealthy missy, just like a certain someone. Only a person with so much free time in her hands and produce such work, which would require all of her love and passion.</p><br/><p>She named her Doujin Association “Team Fantasy Shanghai Alice.” However, she was the only one in the association, so others called it, “Team Solo.”</p><br/><p>Lady ZUN was very famous in the Doujin circle, and as a result, several investors wanted to commercialize her “Dreamside Maroon.” Of course, she would not accept such offers, as they would only serve to hinder the addition of new Two Dimensional creations, due to copyright matters. Her love for Doujin ran far and wide.</p><br/><p>Due to her actions, she became the spiritual leader of the Doujin World. Her influential power was something that Su Li could not compare with.</p><br/><p>After all, the game created by Lady ZUN was suitable for all ages, and every form of content within the game came from her hands alone. How cool was that? Her work served as the golden standard of all other aspiring Doujin authors.</p><br/><p>On the other hand, the Doujin created by Su Li were all 18+. She would draw only the popular ones, as she cared only for her potential profit and the marketability, with no regards as to how interesting she found them</p><br/><p>However, Su Li did not create the Doujins of this year’s popular novels, such as “Pure Romance” and “The Strongest King,” as she was the illustrator of these two original novels. If she starts drawing Doujins of them, they would be considered canon, right? People would definitely recognize her work as her drawing style was highly distinguishable!</p><br/><p>That would be embarrassing. As this would be detrimental to her credibility, she refrained from doing so</p><br/><p>In fact, Su Li no longer needed to depend on drawing Doujins to earn money. Her greed was that which prevented her from turning a blind eye to such a lucrative avenue.</p><br/><p>Lady ZUN and Su Li were complete opposites, in terms of their ideology when it comes to creation. Lady ZUN was a hedonist who did it because it was her hobby and, her own happiness as the only concern there, she did not lack money, so its popularity would be of no consequence. On the other hand, making money was the main priority for Su Li, naturally. The only person who could make Su Li draw for free was Zhao Youyue.</p><br/><p>Zhao Youyue decided to approach Su Li and ask her more about Lady ZUN, after playing the game. She found this genius creator who had no regards for money to be quite interesting, especially after learning more about her eccentricity.</p><br/><p>Along with the 8-bit music, was the distinctive logo of Lady ZUN’s team, which was a cute “Lady lo [1]”. According to legends, Lady ZUN was a fan of Lolita outfits, and she would wear it on a daily basis</p><br/><p>Zhao Youyue found it somehow inconceivable. Lady ZUN should not be young anymore, would not it be embarrassing to wear such outfits?</p><br/><p>Nonetheless, this made Zhao Youyue more curious than ever. So far, she only had a minimal level of exposure towards Doujin. The latest randomness of the “Two Dimensional Gate” had served as a reminder for her to start including Doujin works into her reading list.</p><br/><p>Doujin works were rather interesting, actually. The 18+ ones aside, most of the creators created Doujins to realize some dreams that never went to pass in the official canon, or smooth out their apparent flaws.</p><br/><p>Of course, there were commercialized Doujin works which were all about time-traveling main characters pretentiously hooking up with all sorts of girls. Such work became highly popular among the shallow-minded readers, as it portrayed their fantasies.</p><br/><p>Combining the creative techniques of a commercialized carefully planned literary work with Doujin, was not a bad idea, after all.</p><br/><p>Unlike the other mobile games which would offer a tutorial that introduced the basics, players of “Dreamside Maroon” would have to figure things out by themselves. It was definitely not a relaxing game.</p><br/><p>Zhao Youyue had the patience for it. She played it not for relaxation, but as preparation for her stint in “White Clover” by “Setsuna”.</p><br/><p>Identifying the authentic author was essential, as there were many Doujin creators within “Dreamside Maroon,” such as illustrators, novelists, composers and so on. Sometimes, they would collaborate and produce fanmade videos. Even though the effect would incomparable to the animes from animation companies, they would truly enjoy themselves.</p><br/><p>Regrettably, in the other world, “Touhou Project” had not produced any animes of its own, not even a complete season of twelve episodes, each having a duration of around twenty minutes. They only had fan-productions, at most.</p><br/><p>This prevented Touhou from ever expanding its fanbase exponentially. After all, anime often served as an introduction to the game, and expand its influence.</p><br/><p>Before reading any Doujin work, it would be necessary to have a grasp of the background setting and learn more about the main characters of the original works, or else, the whole message of the Doujin would most likely fly over your head. Some Doujin creators would presume that readers were up to speed with the original work, and would not bother repeating plot details or reintroduce key characters. Laymen would be completely clueless about the premise.</p><br/><p>Zhao Youyue had been just been as clueless when she was reading the brief introduction of “White Clover” in the “Two Dimensional Gate.”</p><br/><p>Actually, many readers do read Doujin without reading the original work first, and would soon get the hang of things. Zhao Youyue remembered herself enjoying the Doujin version of “Twin of Brothers” even though she had never read its original work before, written by Huang Yi. To some extent, the plot of the original work would be slowly uncovered to laymen, after long-term exposure to multiple Doujins.</p><br/><p>Once again, Zhao Youyue spent all of her recess figuring out how this “Dreamside Maroon” worked. She had even canceled her live streaming on that night and continued on with her experiment</p><br/><p>She noticed that it was a game designated for the creators, most especially Doujin creators, who tended to look for a space where they could fully express themselves, for their own revelry. Ordinary folk would find such a game hard to appreciate, although there would always be exceptions.</p><br/><p>As an ordinary person, Zhao Youyue found the female characters who had been nurtured by those high ranking players highly interesting. Each of their stories could be made into highly popular anime series of their own.</p><br/><p>“Dreamside Maroon” should be called a miracle world, instead of a game. The most interesting thing about it was its setting, its characters, as well as the stories of the characters.</p><br/><p>Finally, Zhao Youyue managed to find the unpopular “White Clover” under the Doujin novel thread, on the official forum of “Dreamside Maroon.” Then, she noticed that it had a subheading —</p><br/><p>“Altair: Divina Commedia[2]”.</p><br/><p>Translation note:</p><br/><p>[1] Lady lo (lo) is referring to a girl who wears the Lolita outfits on a daily basis.</p><br/><p>[2] The Divine Comedy (Italian: Divina Commedia [divina kommdja]) is a long narrative poem by Dante Alighieri, begun c. 1308 and completed in 1320, a year before his death in 1321. It is widely considered to be the preeminent work in Italian literature and one of the greatest works of world literature.</p><br/>\n</div>"}