{"title": "Chapter 305", "id": 305, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-305", "volume_title": "Volume 4", "body": "<h1>Chapter 305</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Possessing The Heroine For The First Time</strong></p><br/><p>This Doujin novel was only made up of fifty thousand words, and was only available on the official forum of “Dreamside Maroon.” Perhaps only players of the game would bother clicking into it. Still, based on the number of replies, “Setsuna” was the only participant of the thread, and all she did was to reply to her opening post for the purpose of uploading more parts of her story. It was a self-indulgent, single-player game.</p><br/><p>There was a helpless expression on Zhao Youyue’s face. The randomness of the “Two Dimensional Gate” had brought her to the “4WD God’s” world which had given her a free victory. This time, it brought her to a Doujin novel’s world which was a niche among the niche. It was not even remotely popular. It looked like the gate had randomly picked an extreme outcome</p><br/><p>Zhao Youyue began to read the Doujin novel with patience. Soon, she understood why it had been completely unattended.</p><br/><p>Because it was too obscure to understand!</p><br/><p>Normally, Doujin work would be created, to make up for any imperfections of the original work, or the creator merely wanted to realize his or her fantasy of a hypothetical path that the original work could have taken, letting his or her favorite character smash everything up. However, “Setsuna’s” story was a cross between a lyrical prose and a travel journal</p><br/><p>The heroine in this work was the two-dimensional creation of “Setsuna” based on a female character in the game called, Shirotsumekusa. Here, she had a new name; Altair. In Chinese, that would be “Ah Er Tai Er.”</p><br/><p>Inside the Doujin novel, Altair wore her hair in the form of twintails. Each tail ended at her heels. No such hair would exist in reality, but, nothing is impossible in the Two Dimensional world.</p><br/><p>The pupils of her eyes were blue, rimmed with red, or rather, she had blue irises that were surrounded by red pupils.</p><br/><p>She was dressed in an old-fashioned military, high-collared outfit. She had a navy blue colored cavalry cap on her head and wore a Spanish style double-layered coat.</p><br/><p>The words did not provide sufficient information for Zhao Youyue to form an image in her head. Perhaps everything would be made clear when she enters the “Two Dimensional Gate” again.</p><br/><p>After she finished reading the content that consisted only of fifty thousand words patiently, she was completely drained. She recognized every word, but, they formed sentences that she could not compute!</p><br/><p>She could not even understand the ability of the heroine, Altair, because she had such a trait — Enigma. Even the creator itself was unsure of her abilities which caused her to be unable to explain it. As a result, she looked like a Little Sister in a baggy military outfit, and wandered around as a traveler.</p><br/><p>This would be like the Doujin version of a travel journal. Altair wandered around aimlessly and curiously, observing every world that she entered, without interrupting anything she came across. Her experiences in her travels would be turned into those obscure sentences in the Doujin novel.</p><br/><p>After Zhao Youyue forced herself to the end, she came to know its gist, which depicted Altair walking about constantly, before slowly surveying anything that catches her eyes, before moving on again… It seemed like she would store those memories somewhere…</p><br/><p>According to all that had been released thus far, it looked just like the Doujin version of a daily-life travel journal. The only heroine, Altair, had no any special abilities, and she was wrapped up by a mysterious force which was unknown to the creator herself.</p><br/><p>This setting was nonsensical and full of an adolescent’s delusion. Perhaps “Setsuna” wanted her Two Dimensional characters to be different from the creation of others. If the settings are too generic, her creation would be the same as others. Hence, her main character would be a mysterious character. So mysterious, that even the creator did not know anything about her. Wasn’t this interesting?</p><br/><p>B**l s**t!</p><br/><p>Zhao Youyue was at the edge of psychasthenia, due to this mysterious Doujin travel journal. Why can’t the creator just write it like an ordinary person?</p><br/><p>This creator was too far gone!</p><br/><p>Also, Zhao Youyue could not identify what kind of energy level this world had. On the surface, it looked exactly like a daily-life travel journal.</p><br/><p>However, there was something that caught her attention, which was the worlds that Altair traveled to. The imagination of the creator was well-expressed here, but, everything was kind of vague, due to her writing style.</p><br/><p>Regardless, Zhao Youyue would be able to view those worlds by herself, once she possesses “Altair” in the “Two Dimensional Gate.”</p><br/><p>This may not be a literary world which could help her obtain a character card, but it could definitely help her relax.</p><br/><p>This was because, as a Lady in reality, there were no places that Zhao Youyue had not been before. So, not many forms beautiful scenery would be able to move her heart.</p><br/><p>But, now she could experience new, fantastical worlds through the combination of the “Two Dimensional Gate” and the abilities mystery traveler, Altair. Wasn’t this an extremely rare experience?</p><br/><p>Zhao Youyue had finally calmed down, putting her desire of obtaining a new ability on hold. She now took each passing of the gate as valuable life experience. Ironically, an oddity like “White Clover” would be able to bring her to a different experience.</p><br/><p>Well, since she had yet to find a designated literary world, she might as well possess this mysterious “Altair” and wander about imaginary worlds, observing the people there like a side character.</p><br/><p>Now that she had dismissed the possibility of gaining a character card from this, Zhao Youyue was no longer disappointed. After all, she could just withdraw anytime from this unpopular work by ruining it, or by committing suicide. There would be no consequences</p><br/><p>Zhao Youyue had never possessed a heroine before. This was her chance, and it could possibly allow her to tell the difference between the possession of a heroine and a side character.</p><br/><p>That night, Zhao Youyue entered the “Two Dimensional Gate” once again, no longer hoping to obtain a character card. This work would never possibly gain any semblance of recognition. Thus, she would not ask the creator for any additional characters. She categorized that the quality of this work was similar to the one from “War Heroes,” which was a lost cause.</p><br/><p>Anyway, Zhao Youyue could have her holiday and relax inside that world.</p><br/><p>Finally, she saw “Altair” in the literary world. This heroine simply looked dashing, and had the aura of a queen, but at the same time, she possessed a mysterious form of tenderness. She was quite satisfied with her.</p><br/><p>Without any hesitation, she chose to possess her. Then, she discovered that she could not access the settings where she could customize the ability and personality of the character.</p><br/><p>Altair was the first ever heroine that Zhao Youyue had ever possessed, and all she could do was to ‘lie down,’ or to simply roleplay the character according to her preset traits.</p><br/><p>The problem came when she realized that her personality was unknown, and her ability was a mystery. What could Zhao Youyue do with all this?</p><br/><p>So, Zhao Youyue decided to go with the flow, allowing “Setsuna” to take the wheel. She would comfortably “lie down” within Altair’s body for now, enjoying the views of the imaginary world as a Two Dimensional Traveler.</p><br/><p>Zhao Youyue could not have known that the creator, whose pen name was “Setsuna,” was in the ICU of a hospital. Her hair had fallen off due to chemotherapy. She was a Doujin creator at the 4th stage of cancer and did not have much time left.</p><br/><p>She had been unnoticed for her entire twenty years of life, and it would make no difference as her life would still end in the blink of an eye.</p><br/>\n</div>"}