{"title": "Chapter 306", "id": 306, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-306", "volume_title": "Volume 4", "body": "<h1>Chapter 306</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Eternal Mystery</strong></p><br/><p>When a person is about to die, all sorts of insights and fascinating ideas would come to her mind.</p><br/><p>“Setsuna” had joined the Doujin circle as a Doujin novel creator, three years ago. However, she was not talented in creating such work, or to put in other words; her works were too delusional. Only those who were on the same wavelength as her would understand what she wrote and what she wanted to express.</p><br/><p>Unfortunately, such readers did not exist.</p><br/><p>“Setsuna” was obsessed with a wide variety of settings that she neglected the three important elements of a novel. Character, Plot, and Lore. She had been trying her best at worldbuilding, but, her confusing writing style had left the readers unclear of anything.</p><br/><p>That was the reason why “White Clover,” which she had put her heart and soul into, had been left unattended by people. Her writing was terrible, and her works had little to no plot. All in all, she would insert a lot of plot devices into the mix as Altair, the heroine, travels and visits new worlds. This was all very confusing.</p><br/><p>After that, the forever mysterious Altair carried on with her journey to another world. After that she would write, see and contemplate further</p><br/><p>The image of Altair as a mysterious Two Dimensional traveler had been rooted deeply in the reader’s mind. Everyone would know what she does at a glance now. The only thing was that even the creator could not solve her own character’s mystery.</p><br/><p>“White Clover” was a Doujin ReadNovelFull of delusions and wild imaginations. It may not become popular, but, it had its own charm.</p><br/><p>When “Setsuna” knew that she had stage 4 cancer, her writing grew even weirder, as she practiced the ultimate form of free expression. Even though readers spoke the same language, they did not recognize a single sentence that those otherwise familiar words join up to form!</p><br/><p>It was truly unfortunate to encounter such a talentless creator. Zhao Youyue would not have even spared such a story a second glance, if not for the fact that she needed to research on her latest “Two Dimensional Gate” destination.</p><br/><p>If “Setsuna” had any talent at all, her work could have been salvaged. Obviously, she was paying tribute to the poem, “Divina Commedia,” by the famous poet, Dante. All she did however, was to use the two words, Divina Commedia to complete her title, “Altair: Divina Commedia.”</p><br/><p>Dante applied the distinctive, imaginative vision of medieval literature in writing his “Divina Commedia.” He had imagined himself as a princess, who was still alive, traveling to hell — Kingdom of the dead. The poem was divided into three parts which were “Hell,” “Purgatory” and “Paradise.”</p><br/><p>During his journey from hell to paradise, Dante Alighieri had engaged in conversation with the souls of famous people, which had included the heroes and villains throughout history. He placed the characters he looked up to and the characters he despised into the aforementioned categories, putting some of the Florentines that he and the Pope disliked into hell. Some details, which were of his own creation and not mentioned in the Bible sounded logical. This included his views on Theology, systematically elaborating on the worldviews of Christianity.</p><br/><p>Likewise, this Doujin novel adopted that format. The difference was, Altair was traveling through worlds imagined by “Setsuna,” not hell, purgatory, and paradise.</p><br/><p>As everyone knows, cancer patients suffer a lot. In the midst of suffering, “Setsuna” would come up with many ideas. It seemed like the closer she was to death, the more information she would receive. She would then put everything into words, using words to describe everything.</p><br/><p>She seemed to put herself in the shoes of this mysterious Altair under her pen, happily traveling through her imaginary worlds. She would start to take in every detail of her pain and commit it to memory, and express it on paper to the best of her highly limited abilities.</p><br/><p>She no longer expected to have any readers. Probably the most extraordinary thing about a girl who looked ordinary and had an ordinary background like her, was dying of cancer?</p><br/><p>That’s right! After all, those who were dying of cancer seemed to be most intriguing. Moreover, she would express her hopelessness when she is at the edge of dying every time in her work, adding to it the mystique of Altair, as usual. Perhaps her despair would reach the heart of another person.</p><br/><p>Nonetheless, the mystique of Altair never revealed anything about herself. She was forever wrapped up in mystery, and no one could see through her.</p><br/><p>At that moment, Zhao Youyue was touring a visually geometric world as “Altair.” It resembled abstract oil paintings. In this world, there were all kinds of fascinating shapes, the likes of which could never be conceived by any human!</p><br/><p>An ordinary person who enters this world would be frightened by those distorted and strange things, as the living things here were all made out of numbers.</p><br/><p>Speaking of numbers, Arabic numbers would be the first to pop up in everyone’s minds. However, this was not the case in this geometric world.</p><br/><p>Arabic numbers are nothing but the symbols used in calculating in real life. So, what do real numbers actually look like?</p><br/><p>Zhao Youyue saw it now, through “Altair’s” body, yet, she did not know how to describe them in words</p><br/><p>Finally, she realized why the writing style of “Setsuna” was so weird, which distorted the clarity of her writings. Apparently, her imaginary world was too magical to be accurately described in human language!</p><br/><p>Perhaps she was not talentless. Her world was simply too bizarre and otherworldly, no ordinary person could ever think this up. Only a person who has a “Two Dimensional Gate” like Zhao Youyue could experience it to its fullest.</p><br/><p>Zhao Youyue who was now “Altair,” was not afraid of the strange things of this world. Although she sensed no superpower in “Altair,” she noticed that she had become stronger for no reason, as if nothing could hurt her</p><br/><p>She suddenly felt that she was an existence that stood above all others, due to this mystical strength which had seemingly turned her into the Highest form of Existence which could not be named.</p><br/><p>Of course, there was a possibility that she was a side character, wandering around and enjoying the scenery.</p><br/><p>If she unleashes her power now, the illusion of her mystery would vanish. Therefore, it would be wise for her to remain observing and admiring everything else in peace.</p><br/><p>Zhao Youyue was enjoying herself. Traveling around the magical worlds in this Doujin travel journal was indeed fun. As she passed through the different worlds, she took the chance to play with numerous lifeforms, while listening to the stories of their lives.</p><br/><p>She really wanted to help this work attain the popularity it deserved. Maybe it would just be a waste of her effort, but, at least she tried. Popular works would certainly motivate their creators. Or at least, the possibility of the work being dropped halfway could be reduced</p><br/><p>Thus, Zhao Youyue turned to Su Li for help, thinking that she should first reproduce the exquisite beauty in a military outfit, “Altair” on paper.</p><br/>\n</div>"}