{"title": "Chapter 316", "id": 316, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-316", "volume_title": "Volume 4", "body": "<h1>Chapter 316</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Weak Refutation</strong></p><br/><p>Under such circumstances, Su Li could only cry on Lady Zhao’s shoulder. She did not know what had actually happened. She had only illustrated the military uniform princess “Altair.” Why would the Doujinshi novel’s author, “Setsuna’s” death of natural causes, have anything to do with her?</p><br/><p>Su Li did not blame Zhao Youyue for her current predicament. She knew that Zhao Youyue was utterly unaware that “Setsuna” had been seriously ill as well.</p><br/><p>After all, this fanmade anime video about “Altair” was the brainchild of Zhao Youyue’s and Su Li’s collaboration. Of course, Lady Zhao had taken care of the expenses. Su Li was like a voluntary worker. She only took a small sum as a symbol. She cared more about her relationship with Zhao Youyue.</p><br/><p>Therefore, she had been trying her best to assist Lady Zhao regarding drawing. After all, Su Li had been very hardworking. She had finished the outline of “The Strongest King” in a concise time. She was well ahead of schedule. As a result, she had an abundance of free time.</p><br/><p>But now, Su Li was struck by a different kind of fear. If the rumors about a writer’s death due to her curse truly pick up, would anyone even ‘risk their lives’ to approach her?</p><br/><p>Such a writer might even appear. He could have been planning to write a popular character to death. Yet, he had not dared to do so. Therefore, he had come up with an idea. He would request Su Li to draw an illustration for the character. Then, he would immediately leave that character in its grave. In the end, he would send out a heartfelt plea, claiming that the character had to die in his place, otherwise he would have been the one in its place. Therefore, he would have valid reason to beg for forgiveness!</p><br/><p>All right. All would be well. But, Su Li who had accepted the order, would carry the pan skillfully once again…</p><br/><p>Su Li was deeply anxious that such a thing would happen!</p><br/><p>But if they paid well, how would she possibly decline those offers? It was money, and she earned them through drawing. Those were legal sources of income. She was not only a mangaka, but also an illustrator.</p><br/><p>Therefore, Su Li felt a twang of pessimism about her future.</p><br/><p>Previously, as the fanvideo was still in production stages, Su Li had learned a lot of information about “Setsuna” from Zhao Youyue. But, Zhao Youyue obviously did not know about “Setsuna’s” illness. She had even felt that “Setsuna’s” writing efficiency was quite high. She had considered “Setsuna” to be a writer full of passion and energy.</p><br/><p>How could such a writer die of illness?</p><br/><p>Zhao Youyue heard all of Su Li’s complaints. She could only comfort Su Li, telling Su Li that none of it was her fault. Zhao Youyue had figured out that “Setsuna” had been seriously ill, a long time ago. It was the last stage of cancer. It did not matter if Su Li was involved or not, “Setsuna” would not have lived long anyway.</p><br/><p>It was normal for humans to grow old and die of ailments.</p><br/><p>Besides, “Setsuna” was clearly pleased and honored that the famous illustrator Su Li was willing to draw illustrations for her work. She could finally see the 2D imagery of her written heroine. She had cast such a beautiful, powerful, daunting image.</p><br/><p>Zhao Youyue’s words of comfort were quite effective. Or else, Su Li might have even begun suspecting the validity of her curse. This time, the character did not die, but the author had died instead. This was something too iffy!</p><br/><p>Yet, the game producer of “Dreamside Marron,” Zhu Yinzhu made Su Li’s curse even more impressive. She had gone ahead and shared “Setsuna’s” Weibo page. She even commented, “It’s so terrifying. If she had not suffered such fate, would I be the one dying instead? But even so, I still encourage Su, the Great Deity to continue on with Altair’s story. This recreated character has truly won over my heart!”</p><br/><p>Zhu Yinzhu’s Weibo was rather niche. Ordinary readers were not very familiar with her. But the Doujinshi writers and those who had some understanding for the ACG culture, knew that she was the “Lady Zun” who frowned upon commercialization, and left her content out in the open, as free game for all Doujinshi writers. She was a talented and wealthy Lady.</p><br/><p>Therefore, after she had commented in such a ridiculous, yet low-key encouraging, more people got to know of Su Li. At the same time, “Altair” gained even more recognition.</p><br/><p>Under such circumstances, Su Li was still defending herself innocently, “I hope that people don’t take me as the butt of jokes so casually. “Setsuna’s” cancer was an unfortunate, but a natural occurrence. I truly mourn for her as well. But, this truly does not concern me. Why should I be blamed for this?”</p><br/><p>However, Su Li’s post on Weibo was soon carpet-bombed. Most of the comments demanded that Su Li own up to the venom of her drawing pen. Any popular character who gets the attention of her pen would never fare well</p><br/><p>Zhao Youyue had been paying attention to Su Li’s Weibo. When she noticed that Su Li had been completely submerged in the saliva of the masses, she could not help but dive in as her sockpuppet “Ah Yu,” the popular live streamer, VA, Bilibili uploader. “Ah Yu” then commented, “Teacher Su Li was the one who drew my ‘face.’ It even comes with a variety of emoticons. Yet, I still live. Therefore, everyone, please stop bothering teacher Su Li. She’s so pretty and cute, everyone, please support her!”</p><br/><p>Although “Ah Yu” was not a LoL streamer anymore, she was still rather popular. LoL was not challenging for her anymore; she was already the top 1 player on the national server.</p><br/><p>The contents of her live stream had gradually transitioned from gaming to music. The genre had been changed to 2D as well. It was a change for the better. She was now a super popular VA, just because of “Yu Shengfan” and “Altair.” The latter was not even an official anime, but only a fan made video.</p><br/><p>In a way, “Ah Yu” was currently an extremely popular live streamer, especially among 2D lovers. Her vocal and violin covers often comprised of popular anime songs. She now had a clearer grasp of the direction of her live stream which was initially multifarious.</p><br/><p>That’s right. Zhao Youyue had decisively changed her image. For her, the amount that her “Ah Yu” identity could earn was a secondary concern. More than anything, she intended to promote works that she fancied and characters that she possessed.</p><br/><p>Just like the video she made for “Setsuna’s” Doujinshi novel “White Clover.” If Su Li and Ah Yu’s names had not appeared in the credits, it might not have even grown popular on Bilibili.</p><br/><p>Yet, Zhao Youyue had not expected to receive invitations from so many animation studios, including the world-leading companies and their heads. Various producers had expressed their recognition towards her voice acting capabilities. They also acknowledged her fame. In their opinion, as long as she continues voice acting, animes featuring her work would experience the most feverish debuts, ever.</p><br/><p>However, Zhao Youyue declined all the invitations indirectly. Her perfect voice acting was only applicable to characters that she has possessed.</p><br/><p>Su Li was very touched to see Ah Yu stepping up to defend her. Lady Zhao was the only person in this cold world who truly loved her.</p><br/><p>Ah Yu then canceled her live stream that night, and there was no live stream for a week</p><br/>\n</div>"}