{"title": "Chapter 326", "id": 326, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-326", "volume_title": "Volume 4", "body": "<h1>Chapter 326</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>On Headline!</strong></p><br/><p>Hang Yongming struggled to believe his eyes. Were all female high school students these days, witches?</p><br/><p>Such remarkable talent!</p><br/><p>Through the lens of the camera, Hang Yongming caught sight of a particular pair of hands.</p><br/><p>At that moment, all doubts that lingered in his heart vanished into thin air. Ah Yu was known for her flawless hands, and those hands were enough to prove that she was Ah Yu!</p><br/><p>He wanted those pair of flawless hands, in so many ways. Just by looking at them stirred up strong emotions in his heart. Such beauty was truly irresistible.</p><br/><p>Yet, he was astounded that Xiao Yu was still a female high school student. In his heart, he had always respected Ah Yu as an elder who shared his aspirations. He never expected her to be about his age, or even younger, possibly.</p><br/><p>Xiao Yu was unlikely to be a senior year student; she would not have the time to perform in live broadcasts.</p><br/><p>Hang Yongming was unable to accept this newfound discovery, and grew embarrassed by all those praises he once gave to Ah Yu. Apparently he was in a race with her, however, when he realized that this winner was younger than he was, he felt incredibly awkward.</p><br/><p>He was looking forward to Ah Yu’s piano performance live; now he was lost in thought…Violin was Ah Yu’s specialty, and her guitar ballads were incredible. How good was her piano, then?</p><br/><p>He remained frozen after long finishing the video, till the “Spiritual Music” lost its mysterious effects on him. “B Comme Brise” was almost as beautiful as “A Comme Amour;” Ah Yu was undeniably, a marvelous pianist.</p><br/><p>As bold as it sounded, Ah Yu’s skill as a pianist had to be the best of the best! Such an elegant scene flashed across the screen, as the fingers waltzed across that black and white keys!</p><br/><p>Awful regret flooded Hang Yongming’s mind, the moment he thought of having missed the opportunity of seeing this live. This piece would have had far more power when played live, compared to an online recording.</p><br/><p>Even though the mobile phone was not a professional recording device, it conveyed her powers well enough; Ah Yu’s skill as a pianist had to be exemplary.</p><br/><p>Wait a second, live?</p><br/><p>Feeling a sense of Dj vu out of a sudden, Hang Yongming thought he saw something familiar. If only he could find out what its source was!</p><br/><p>He replayed the video over again and again, and noticed that the background was oddly familiar. All of a sudden, he slapped his thigh and burst out, “Isn’t this school auditorium?”</p><br/><p>Consequentially, he inspected Ah Yu’s uniform. Didn’t this uniform belong to his school?Ah Yu was attending his school!</p><br/><p>Hang Yongming reeled as the world left him behind!</p><br/><p>He had always wondered where Ah Yu came from, but never once did cross his mind that she would be from the same school as he was!</p><br/><p>It was totally mind-blowing!</p><br/><p>Hang Youming did not immediately link the dots between Ah Yu and Zhao Youyue – that rigid violinist. On this coming New Year’s Eve night, it was destined for all to understand; this celebration was not just a musical competition. Music would only gain meaning, once revered by the audience!</p><br/><p>Zhao Youyue’s performance might impress judges, but hardly anyone else would appreciate it.</p><br/><p>He had stayed back a few times just to hear Zhao Youyue’s performance; all of them had ended up with him laughing in his heart. Was she expecting them to applaud for her robotic performance?</p><br/><p>She should know the sole reason the audience would clap for her was because of her good looks. Wasn’t this a musician’s greatest form of insult?</p><br/><p>A musician who impresses people not with her performance, but her looks was nothing more than a vase!</p><br/><p>Every time, Hang Youming left after watching Zhao Youyue’s performance. For this rehearsal, he had departed immediately after his part. Ah Yu’s piano solo should have been after Zhao Youyue</p><br/><p>Hang Youming was vexed over his own actions. Why couldn’t he be patient and stayed a little longer? He would have known who Ah Yu was, and how she would be looked like!</p><br/><p>Ah Yu should be rather plain and ordinary in appearance. If she had Zhao Youyue’s pretty face, why would she conceal her face?</p><br/><p>If she appeared with such beautiful figure and performed with such remarkable talent, it would have started a war among the brat packs.</p><br/><p>Think about how much more popularity she stood to gain!</p><br/><p>Hang Youming leaned back and waited patiently, everything would be revealed on the night of New Year’s Eve Party.</p><br/><p>Comments. Let’s read the comments.</p><br/><p>The numbers of shares and comments rose exponentially, right after this video was posted on Weibo. Such amazing popularity!</p><br/><p>Most of the comments were expressing their relief that Ah Yu did not go out of the ashes and into the fire.</p><br/><p>Nevertheless, some grumbled over her sudden disappearance. If she had notified them ahead of time, they would not have been so worried over nothing.</p><br/><p>Others expressed shock and awe.</p><br/><p>“My jaw formed a crater in the ground when I saw Ah Yu in a high school uniform. I never thought she is still a high school student!”</p><br/><p>“Finally, you have lifted the mysterious veil, Ah Yu! Which school does this uniform belong to? C’mon guys, dig it up!!”</p><br/><p>“You play so well with that piano too, how many instruments have you actually mastered?”</p><br/><p>“Searched “B Comme Brise” through the internet and I’ve got nothing, there’s only “A Comme Amour” which was entirely different. This is another one of her original compositions? Respect!”</p><br/><p>“A high school girl going live after being missing, with billions of dollars of income!”</p><br/><p>“Shocking! A famous VA, singer, two-dimensional live streamer Ah Yu turned out to be a female high school student, and she is resisting The Curse of Master Su! What is the hidden story behind this”</p><br/><p>…</p><br/><p>Ah Yu was on headlines once again, after revealing herself as a high school student in one of her Weibo post.</p><br/><p>Most of the people thought that it was due to her surviving Su Li’s curse, and some of them believed that curse actually worked and had delayed her broadcast. Who knew how much money has Ah Yu lost…</p><br/>\n</div>"}