{"title": "Chapter 327", "id": 327, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-327", "volume_title": "Volume 4", "body": "<h1>Chapter 327</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>New Year’s Eve Party Commences</strong></p><br/><p>Even though Ah Yu did not get affected by Su Li’s curse, but it had been a long time since her last live streaming video. This would definitely have caused her popularity to decline. Although it had nothing to do with Su Lu’s curse, most of the netizens would think otherwise…</p><br/><p>In the end, the most helpless person was Su Li. She finally understood that no matter how hard she tries to argue for herself, even having Lady Zhao prove it to everyone, all of it had been in vain. This was a meaningless struggle, so she simply drew a comic of herself being poor, and posted it on Weibo with a caption that went</p><br/><p>“I’ll admit it, my drawing has a mysterious power, from this day forward, I hereby curse myself that all of the manga I draw are destined to fail! I shall become poor and no future! ()[1]”</p><br/><p>The poorly drawn comic of Su Li was most amusing. It was cute to see herself transforming into a manga character. It only made people find her more interesting, and egged them on to tease her even further.</p><br/><p>The moment she stopped defending herself, she only drew more attention. Naturally, her fame gradually increased as well. More and more companies and authors wanted to collaborate with her, and the sums they offered rose proportionally.</p><br/><p>Without a doubt, her “curse” and the title of “Pan of this generation” had been implanted into the hearts of people, which gave her even more money…</p><br/><p>It looked like Su Li was struggling to get rid of her “cursed” title, but actually, she was making a fortune without anybody knowing of it. This tiny chink in her fame would not matter much, as long as she was making money.</p><br/><p>After Su Li posted it on Weibo, many of the netizens already knew that Su Li was only promoting herself. It was all a gimmick; for the effects were quite the opposite!</p><br/><p>Some netizens would investigate on “the curse of Su Li” to prove its validity, and find them they did, in full detail as well. This demonstrated the popularity of Su Li, and her income only grew…</p><br/><p>But many people were amazed at the great deity, Su Li herself. After discovering her own mysterious power, she had only learned how to promote herself in such a dire situation. It was such an ingenious use of her own infamy!</p><br/><p>But then, the attention Su Li had was no match for a high school girl who had nearly exposed her real identity, “Ah Yu.” After all, Su Li was just an author, no matter how much she got into trouble, or how popular she became, she was far beyond compare to the popular live streamer, Ah Yu.</p><br/><p>Ever since Ah Yu took the first place on the national ranking in “League of Legends,” she became a “Pubstomper[2]”. She gained many subscribers, and several professional teams tried to recruit her. Unfortunately, she had no intention of playing the game as a professional. Many people felt like it was a waste of her talents, or else they could have witnessed her glory in the professional arena.</p><br/><p>At that moment, some medias promoted her in exaggeration, causing her fame to grow exponentially in Douyu. Soon after, everyone realized that not only she had an amazing talent for gaming, her musical talents were astounding too, and finally, she had revealed herself to be a voice actress as well, as the voice of Yu Shengfan in the highly popular novel-adaptation anime, “The Strongest King”!</p><br/><p>So, other than her gaming fans, musical and otaku fans soon came pouring into her live streaming channel, and all this had turned her into one of the top live streamers on this platform, a female live streamer who used her sheer talents to attract her audience!</p><br/><p>Under such circumstances, many more yearned to see her face and learn of her name, but unfortunately, she did not intend to reveal them at all…</p><br/><p>But now, Ah Yu had unintentionally revealed that she was a high school student, throwing a hint among the starving fans, giving them inhuman levels of motivation!</p><br/><p>Which school was she from, and what year was she? It appeared that she would be performing during the New Year’s Eve party, so could they sneak into that high school and find out? Some passionate fans might go overboard and cross certain boundaries, but this would not be all that surprising…</p><br/><p>Luckily, the high school uniform that Zhao Youyue wore was rather universal; it would be quite difficult for others to look for the right school in such a short time, except for the student who attended the same school.</p><br/><p>Except for art students like Hang Yongming who had the time to watch live streams, while other students from the same school focused on their exams and academic results. They even banned the use of mobile phones in school, and there were no charging docks in the dorms…</p><br/><p>This actually delayed the actual uncovering of her identity, but it was inevitable. Zhao Youyue herself was not aware of this problem, she felt that it would be better if her sock puppet identity, “Ah Yu” became even more popular, so that she could promote her future possessee’s literary worlds easily.</p><br/><p>…</p><br/><p>Ah Yu caused a commotion on the internet when she accidentally exposed herself as a high school student, it had caused a wave of rumors and gossips among her fans. While all this circulated on the internet, the high school that Zhao Youyue attended finally commenced with their New Year’s Eve party.</p><br/><p>It was the school’s anniversary as well; and it was the first time the students were actually experiencing a carnival just like any other private noble schools, or, more aptly, those “School Festivals” in Japanese schools.</p><br/><p>Unfortunately, the class rep of Zhao Youyue’s class, Bai Yunshan was too strict, and she did not allow the class to organize a “Maid’s caf.” Every male in the school hated her for rejecting that idea.</p><br/><p>The reason was simple enough; many male students were looking forward to seeing Zhao Youyue in a maid uniform, and enjoy her service, even she only served them a cup of coffee, it would be worth dying for!</p><br/><p>Han Leng, the ex-deskmate who knew the real Zhao Youyue, was looking forward to it as well, for he was always getting bullied by Lady Zhao, and wanted to regain his honor…</p><br/><p>In the end, Zhao Youyue’s class organized a scary house. It had turned out to be rather interesting, without being inferior to a Maid’s cafe. Zhao Youyue had a blast, as she was able to scare a lot of people while pretending to be a ghost. She was fortunate enough to get away from it all without a beating.</p><br/><p>Long story short, the once-in-a-lifetime nature of this school anniversary event had given everyone in this school an outlet to relax and enjoy themselves.</p><br/><p>After all, a strict high school such as this rarely ever organized events to celebrate their school anniversary. It was as if the lid of a chest that had been used to trap all the youthful spirits in the school had been blown off its hinges…</p><br/><p>Of course, besides relaxing events, several VIP alumni had returned to give speeches and even publicly donate to the school. Some entrepreneurs may not have been rich back then, but that was no longer the case, of course they would return to their old school and flaunt it. It would be a waste if no one learns of their net worth.</p><br/><p>Evening finally fell, and the grand New Year’s Eve party officially kicked off. The grand hall was full of people, and those who were placed strategically as to provide them the best views ever, were those popular alumni.</p><br/><p>Translation note:</p><br/><p>[1] () – this flipping emoticon was in the RAW (untranslated copy of the chapter), expressing Su Li’s rage.</p><br/><p>[2] Pubstomper – A name for someone who usually goes in alone or with a group of people to a public server on a game and completely trashes them. As the RAW term is not even close to this term at all, “‘s” lit. translation, Passer-by King.</p><br/>\n</div>"}