{"title": "Chapter 322", "id": 322, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-322", "volume_title": "Volume 4", "body": "<h1>Chapter 322</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> The World of Music in Spring</strong></p><br/><p>Zhao Youyue stabilized her mobile phone, pointing the camera right at her flawless pair of hands.</p><br/><p>Many of her fans envied her hands, not only could they control characters and kill anything in the game, they also played smooth and mesmerizing music.</p><br/><p>If the hands were so delicate and elegant, the appearance of their owner must be beautiful as well.</p><br/><p>They did catch the attention of a few hand lotion companies, prompted them to attempt hiring Ah Yu as their ambassador.</p><br/><p>Perhaps Su Li would not reject this five-figure offer from these small companies, but Zhao Youyue had no interest in them.</p><br/><p>Not many were left in the hall, those who were done rehearsing had the permission to leave, some were too lazy to attend night classes had remained seated, enjoyed the laidback role as audience.</p><br/><p>Wang Shun, the sworn rival of Hang Yongming, was one of the audience. He packed a bunch of snacks, and had planned to stay until the end of the rehearsal. His eyes were on his phone all the time, bored of those same performances on stage during every rehearsal.</p><br/><p>The next piano solo would be done by the president of Student Union, Huang Zongchao, with the track, “Marriage D’Amour.” If he were to judge that performance, at most, it would be “on point,” words like “beautiful” and “soul-touching” were impossible to match with it.</p><br/><p>Despite it, Wang Shun knew that Huang Zongchao always put in his full effort in his studies, the piano was merely his hobby. He should be praised for achieved the “on point” level, but you would never expect to get Richard Clayderman out of him.</p><br/><p>The unfamiliar track diverted Wang Shun’s attention from his phone to the stage. Instead of Huang Zongchao, there was a beautiful young girl with silky long hair, dressed in a school uniform.</p><br/><p>That was clearly the uprising star in school, supposedly the prettiest girl in school, Zhao Youyue!</p><br/><p>Even Wang Shun, a Grade 3 senior heard of this Grade 2 junior’s name, Zhao Youyue. She excelled academically, and she had performed exceptionally well in the previous school sports competition. Her speeches under the national flag in front of all students were solid and inspiring, striking close to heart.</p><br/><p>Someone had finally matched Huang Zongchao as a remarkable individual as a Grade 2 student, while being far more beautiful and elegant, to boot.</p><br/><p>This young girl was supposed to play the violin, wasn’t she, why was she playing the piano, now? Wang Shun could not wrap his mind around it.</p><br/><p>Wang Shun might be an art student, but he was aware of Zhao Youyue’s achievements. She was the champion of Provincial Music Competition, and her skills had managed to get her into the finalist of National Music Competition. He was jealous to learn that she had such attained such an achievement before she was even out of Grade 2, while he had only managed to get bronze in Provincial Music Competition.</p><br/><p>Yet, after a few times of watching her rehearsal, he only had one word for it. Perfunctory. There was no passion, her performance was just like a puppet with strings, but without soul. A glitch-free, bland performance like this would only impress laymen.</p><br/><p>Wang Shun also knew that his sworn rival, Hang Yongming often vigorously defended this young girl Zhao Youyue to great lengths</p><br/><p>It was a pity Hang Yongming wasn’t here, his expression while indulging himself in Zhao Yongyue’s performance would be entertaining.</p><br/><p>Hang Yongming always left right after he rehearsed, he would never be a minute too late.</p><br/><p>Wang Shun did not pay much heed to it at the beginning; he had his doubts about this violinist’s skill on the piano. Furthermore, he could not tell which song she was playing; it was difficult to judge the performance.</p><br/><p>“B comme Brise” was written by Chu Luoxun, a character in a novel, as a tribute to Richard Clayderman’s “A comme Amour,” which portrayed the warm romance of a fairytale in autumn. “B comme Brise” was an expression of Spring by Chu Luoxun. It was soft and soothing, a song you would listen right before going to bed, just like a cradle rocking our minds into neverland.</p><br/><p>Zhao Youyue activated the “Chu Luoxun card” within her, playing the song with so much emotion, that it released the mysterious aura of “spiritual music.” Those who were listening with their hearts were dragged into her “Musical Reality Marble.” [1]</p><br/><p>Wang Shun propped his body up all at once; his ears perked up. He almost could see Zhao Youyue and the piano being surrounded by beds of flowers, as the notes of the music materialized as she pressed each key on the piano. They shimmered briefly in the air before they morphed into pink petals of a flower, and billowed across the hall!</p><br/><p>Wang Shun lifted his arms and embraced the wave, all at once forgetting that it was he who had once mocked the descriptions depicted in Beautiful April. Such a scene was when the lead male character performed on the piano.</p><br/><p>Yet now, that thought was fluffed out of his mind. He almost felt the flowers he lay on them in this world of music, a world where blossoming flower beds stretched over the horizon. Spring had transformed itself into a beautiful young girl who looked like Zhao Youyue, humming nursery rhymes to his ears, persuading him to close his eyes, into a neverending dream.</p><br/><p>Noises clattered around the hall, but as Zhao Youyue’s music dug deeper to its heart, almost everyone was dragged along with it. Some of Grade 1 students immediately broke off from the idle chatter, and were now mesmerized by Zhao Youyue who had cut herself free on the piano.</p><br/><p>Huang Zongchao was acting strangely as well. Before Zhang Youyue went onto the stage, he had pulled out his lecture notes of some competition and continued to study the questions, claiming he was not as free as Zhao Youyue. He should be on schedule for competition practice tonight, but he had to postpone it just for rehearsal. Therefore he had to put in some extra effort to remain ahead of the game.</p><br/><p>That was the plan, at least. Currently, there was nothing related to the questions of that competition in his mind, only blossoming flowers and divine warmth, as he floated to the sky, like a butterfly!</p><br/><p>Translation note :</p><br/><p>[1] Reality Marble, from TYPE-MOON’s Fate series, is the ability to create and maintain a set of worlds based on their characteristics within a bounded field, anyone within the range will be encased and completely cut off from reality, since the real world had been shrunk and kept into the World Egg. For more information, Google it.</p><br/>\n</div>"}