{"title": "Chapter 332", "id": 332, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-332", "volume_title": "Volume 4", "body": "<h1>Chapter 332</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>A Successful End</strong></p><br/><p>If Zhao Youyue’s performance of “Beethoven Virus” had been extremely unrestrained, passionate and rebellious, her performance of “Kreutzer Sonata” had exemplified the classical violin performance. It was also what any passing layman would expect from classical music. Graceful and pretentious.</p><br/><p>Zhao Youyue did not exactly go by its original composition. She played it just as she did in the novel, giving it a twist of her own. The audiences enjoyed her performance just as much as they did in the novel.</p><br/><p>Everyone had their full attention to the music, thanks to the power of her ‘soulful music.’ If not, it would have been impossible to attract the attention of the audience with mere classical music. Too few people listened to such music. Many did not even have such preferences. If it had been a regular classical musician, the music would have a much harder time reaching their hearts.</p><br/><p>Only Hang Yongming and the bunch of Arts students would have listened to such music ecstatically</p><br/><p>Hang Yongming had read “Beautiful April.” He was very familiar with this “Kreutzer Sonata.” He had always been imagining renditions of it through the hands of a music Goddess like Chu Luoxun in reality.</p><br/><p>Now, he was bearing witness to that very image. This was precisely a “Kreutzer Sonata” in Chu Luoxun’s style!</p><br/><p>Hang Yongming was struck hard by a new revelation. He had considered Zhao Youyue a violinist who only cared about winning prizes. This was truly too ridiculous!</p><br/><p>Zhao Youyue was clearly an all-rounder type. Not only was she able to please the judges, but she was even better at pleasing the audiences!</p><br/><p>As the audience went crazy after the first piece – “Beethoven Virus,” he had been shell-shocked like a lifeless statue!</p><br/><p>And now, New Year’s Eve had turned into a large and luxurious classical concert</p><br/><p>No ordinary person could have pulled this off. Zhao Youyue had become a music Goddess within Hang Yongming’s heart!</p><br/><p>As for Han Leng, the author of “Beautiful April,” Zhao Youyue’s previous performance, “Beethoven Virus” did not touch him much. But he was extremely touched by her performance – “Kreutzer Sonata.” It blurred his vision with tears.</p><br/><p>The music had brought back memories of his “Beautiful April.” They even brought back memories of his Chu Luoxun</p><br/><p>He stared at the stage. In his eyes, it was not Zhao Youyue performing, but Chu Luoxun, whom he had never forgiven himself for killing.</p><br/><p>Han Leng was her ‘murderer.’ His novel had received a great attention and sales, at the cost of her life. The ‘Chu Luoxun fan club’ had rampaged throughout the internet in her wake. Now that he was able to listen to her performance once more in reality, how could he possibly not be touched?</p><br/><p>This time, the moment Zhao Youyue finished her performance, the audience fell into a deep, peaceful silence, as if the fires within their hearts had been completely quenched. The cold, silent world was all that greeted them.</p><br/><p>Zhao Youyue bowed to the audience, and finally left the stage. The first person to recover from the shock was Huang Zongchao, as she passed him by.</p><br/><p>Her fragrant sweat stirred him. He smiled wryly, “After your solo violin performance, I have a feeling that the following shows have become meaningless.”</p><br/><p>Zhao Youyue switched off her Chu Luoxun card. She took out some tissue to wipe away her sweat. As she listened to Huang Zongchao’s compliments, she only smiled and thanked him, while feeling extremely smug of herself.</p><br/><p>It was like the time she made up for “Yu Shengfan’s” regret. This time, she had also made up for “Chu Luoxun’s” regret. Unfortunately, Chu Luoxun’s best friends, Lin Meiyue and Gu Yuan were not in this world. Otherwise, they would have definitely been happy for Chu Luoxun as well, if they saw her being able to perform so passionately on stage.</p><br/><p>By then, the audience finally recovered. A burst of great applause emerged. Many students were still in shock!</p><br/><p>“I would never have thought that I would ever listen to classical music so attentively. It was as if I had a new outlook on things. When did my taste improve so much?”</p><br/><p>“Your taste is still as shit as ever. It was Zhao Youyue’s Godly violin skills! She can convey everything she wants to convey through music”</p><br/><p>“I don’t know whether it was my imagination. I have a feeling that Zhao Youyue seemed to be roleplaying Chu Luoxun, the Chu Goddess. She did it perfectly; only Chu Luoxun can perform such touching music!”</p><br/><p>“I still think the first song ‘Beethoven Virus,’ was more powerful. I’ve never heard of such violin music, nor have I seen anyone else perform in such a way. It was truly too contagious!”</p><br/><p>“Indeed. Its name is very appropriate. The virus would infect even Beethoven!”</p><br/><p>“Beethoven would be infected by the virus after listening? More like going on a murderous spree, I think. That was nothing like classical music!”</p><br/><p>“How could you compare those two? The second piece was truly classical!”</p><br/><p>“Classical music only puts people to sleep. The first piece was more passionate and energetic! With Zhao Youyue’s level of skill, whatever she plays will be nice!”</p><br/><p>…</p><br/><p>It was just as Huang Zongchao said. The following shows now paled in comparison to Zhao Youyue’s solo performance which had brought heaven crashing down on earth.</p><br/><p>This included Lin Xuanya’s folk dance. Logically speaking, for a hot beauty like her, any movement she made would cause eyes to bulge. Unfortunately, everyone still seemed to be immersed in Zhao Youyue’s extremely shocking violin solo performance just now. There was no space in their hearts for Lin Xuanya’s performance.</p><br/><p>This included Han Leng, her very own crush. He was galaxies away from reality. His instincts told him that Chu Luoxun and Zhao Youyue were one, or they were at least connected in ways he could not fathom. The remnants of his sanity suggested that this was impossible. Bu then, why was Zhao Youyue able to perform Chu Luoxun’s music perfectly? Nothing made sense!</p><br/><p>Han Leng needed to get to the bottom of the matter. But if possible, he would not like to get anywhere near Zhao Youyue</p><br/><p>The stronger his feelings about someone, the farther he strayed, as he knew that she would not reciprocate his feelings, and he might make a total fool of himself, acting like a totally different person in his awkwardness.</p><br/><p>In the end, Han Leng chose to flee. He felt that accepting more love letter orders for Zhao Youyue would suffice.</p><br/><p>Having a crush has always been sensitive. It also happens to be one of the most egocentric sentiments out there. It had nothing to do with anyone else.</p><br/><p>New Year’s Eve this time finally came to a successful end. Within the hearts of many students and well-known alumni, the most notable thing throughout this New Year’s Eve was the lovely female host and her violin solo performance.</p><br/><p>Zhao Youyue was the unique heroine. The rest served as her accessories. They were all passerby.</p><br/>\n</div>"}