{"title": "Chapter 336", "id": 336, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-336", "volume_title": "Volume 4", "body": "<h1>Chapter 336</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>My Wife, Ah Yu</strong></p><br/><p>Zhao Ritian, no, it should be Zhao Hao, had found out about the true identity of Ah Yu. With how the news flooded the internet, it was hard to miss.</p><br/><p>The moment he got to know that Ah Yu’s real name was Zhao Youyue, he did not react much. Instead, he was pondering on why that name sounded so familiar, and where he had heard it before…</p><br/><p>The female live streamer Ah Yu was an exceptional person, in Zhao Hao’s mind. He could be considered one of the first few viewers who had started paying attention to Ah Yu. Even so, the amount of money he had donated to Ah Yu, when added together, was embarrassingly, lower than a hundred thousand RMB. It could not even compare to how much money he had spent on the book “The Strongest King.” He had obtained the fan rankings of Silver Sect Master and Golden Sect Master, which totaled his spendings up to 110,000 RMB.</p><br/><p>However, even so, he was already number 1 on the fan rankings in Ah Yu’s channel. Not many people were willing to compete with him. It was clear that Ah Yu had not been able to capture the full attention of the Gods of Tycoons. Otherwise, those filthy rich tycoons would have casually fired off “1314” god-class rockets without any hesitation.</p><br/><p>However, Ah Yu was favored by the masses. She had received tons of ‘airplane’ gifts, worth 100 RMB each. Her situation was somewhat similar to that of those really popular male live streamers. They may not have the full support of any particular tycoon, but needless to say, they were still hugely popular, and many people still loved watching their streams.</p><br/><p>As far as Zhao Hao knew, his good friend Ding Yuncong also frequently watched Ah Yu’s live streams, but he had not really gifted her anything. He had explained himself, saying that this female live streamer, Ah Yu had to be the type who couldn’t care less about gifts. Gifts would not please her one bit. Rewarding her with material gifts would be a waste, as she did not really care about money…</p><br/><p>Besides, Ah Yu had no intention of even revealing her face. Judging by his experience of watching live streams for several years, even if Ah Yu was not ugly, she wouldn’t be pretty, either. Only pretty girls dared to reveal their faces. If she was pretty, there was no reason for her to hide her face. Since when would girls be afraid of revealing their faces to the world, just because they are too pretty?</p><br/><p>In short, “the nation’s husband,” Ding Yuncong, who was also the son of the richest man in town, acknowledged Ah Yu’s talents, but did not think highly of her appearance. She was undoubtedly a talented lady who was very worthy of respect, but it was just that.</p><br/><p>To this end, Ding Yuncong had also specifically posted a status on Weibo, making a thorough analysis. It only served to suppress Ah Yu’s popularity. However, this was not something new, as his live stream platform had always been controversial and hard-edged. Suppressing the popularity of a female live streamer like Ah Yu was also in line with his objective.</p><br/><p>If a talented girl did not have a pretty face, then, to men, they would be able to maintain a sensible train of thought and adequately admire her talents. They would not let the bottom half of their body get the better of them, as the lady’s visage was not part of the parcel.</p><br/><p>However, if a girl was pretty, to begin with, while also being very talented, she would be considered ‘premium quality.’ These girls were the rarest. Many pretty girls tended to lose themselves in their beauty unknowingly. If they could already conquer the hearts of others with good looks alone, what was the point of improving themselves and polishing their talents? Wasn’t it pointless? So troublesome and tiring…</p><br/><p>This was also one of the reasons why many pretty girls rarely accomplished anything academically. As these girls had been blessed with the gift of beauty, and they were highly sought after during their school days. Naturally, they would be distracted and unable to concentrate on their studies fully.</p><br/><p>Respectful ladies like Zhao Youyue were in short supply. She did not care about love and relationships, and she looked down on all guys who were trying to chase her. What she really wanted to tell the boys pursuing her was this —- —-Please, get on with your performance! I will just quietly watch your act…</p><br/><p>After Zhao Hao listened to Ding Yuncong’s explanation, he felt that it made perfect sense. This guy was a Casanova, introducing himself as a “confirmed bachelor,” so that he could play with more women. He also embraced his internet fame. Thus he changed girlfriends frequently, all for the sake of popularity.</p><br/><p>Zhao Hao despised Ding Yuncong for his behavior, but he had to admit that this guy was really sharp when it came to women. This was only natural, as he had vast experience in that field.</p><br/><p>As a result of this, Zhao Hao was no longer as anxious as before in trying to figure out how Ah Yu looked like. Instead, he decided that he should just continue to watch her live stream like he normally did. He felt content to be able to enjoy things like her superhuman gaming skills, or the skilled covers she played between her games. From her music, to her singing, to the cold jokes that she randomly cracked at times. All of these were enjoyable to watch, and it was more than enough.</p><br/><p>At the same time, this would allow Zhao Hao to retain his fantasies. If he were to really check on her and found her to be ugly, it would definitely destroy the mood. It would be a pity, as she clearly had a melodious voice…</p><br/><p>However, even if Zhao Hao did not pry into her further, it did not mean that the other fans would not. Some fans were still insistent on the fact that Ah Yu was definitely a beautiful girl, and that she would never let everyone down!</p><br/><p>The university student named Wu Yihao was one such fan who was steadfast in that opinion. Hence, after putting all the loose threads together, he finally inferred that Ah Yu was Zhao Youyue. Upon knowing this, he was so thrilled and elated that he nearly ascended to heaven!</p><br/><p>Too dazzling! So beautiful!</p><br/><p>So, it turned out that Ah Yu was really an extremely beautiful girl. Furthermore, she was the kind of girl that excelled in everything. She was academically brilliant, and her musical talents were even more admirable. She had received many awards that only outstanding students were capable of getting. She was truly perfect!</p><br/><p>When he thought about how the live streams that he watched every single day had been hosted by such a beautiful girl like Ah Yu, he felt that he was too lucky. For that reason, he went directly to Ah Yu’s live stream channel, which was currently offline, and sent two rockets. They were, in fact, all of his allowance for the month. That did not give him pause for even a slight moment. So what, if he was dirt poor and could only afford to read pirated novels.</p><br/><p>When Zhao Hao heard that the mysterious Ah Yu was finally uncovered and that her video was circulating on the internet, he felt very uneasy. He prayed hard that Ah Yu was not too unsightly…</p><br/><p>The moment Ah Yu accidentally exposed herself as a high school student, he knew that things were about to go wrong. Those super resourceful netizens with innumerable connections would definitely be able to work together and find out who she was!</p><br/><p>It felt like he was meeting an online friend for the first time. With an unsettled heart, Zhao Hao opened the New Year’s Eve party video. This video was recorded by the school officials themselves, and it had been reuploaded on Bilibili, thus he watched it there.</p><br/><p>At the very start, he had already noticed people from the audience wearing the school uniform that he had grown very familiar with. He would never tell anyone that he had watched the video of Ah Yu playing the piano about a dozen times, the one she posted on Weibo. Of course, he even started to listen to “B Comme Brise” on repeat</p><br/><p>The words of “be prepared” appeared on the bullet curtain right at the start of the video.</p><br/><p>Then, he saw Zhao Youyue on the stage, in a gorgeous gown. His eyes widened in shock. Subsequently, the video was suddenly spammed uncontrollably with bullet curtains with the words of “My wife, Ah Yu.” This left Zhao Hao with no choice but to temporarily block the bullet curtains out.</p><br/><p>Then, he soon decided to send a bullet curtain saying “My wife Ah Yu,” but before he managed to send it out, he stopped dead in his tracks.</p><br/><p>He suddenly remembered that “Zhao Youyue” was his younger cousin sister’s name!</p><br/><p>What the f*ck, Ah Yu was his sister!</p><br/><p>How could this be?!</p><br/><p>This was not possible, right?!</p><br/><p>Zhao Hao was completely shocked, because he had not met Zhao Youyue for a long time. The impression he had of his little cousin sister was just that of a cute, short-haired girl. How was she now this a talented lady? She was even a silky, long-haired ‘school flower’ goddess!</p><br/>\n</div>"}