{"title": "Chapter 345", "id": 345, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-345", "volume_title": "Volume 4", "body": "<h1>Chapter 345</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Nothing to Worry About</strong></p><br/><p>Zhao Youyue was thoughtful and considerate by nature. Although the recent waves on the internet had no impact on her life, who could be sure of what that was going to happen next?</p><br/><p>Under such circumstances, it was only logical to Zhao Youyue to inform and seek advice from her parents. They were close to Zhao Youyue, and they were the most important people to Zhao Youyue in this world…</p><br/><p>Zhao Jiayi and Wang Hao were completely clueless about Zhao Youyue’s newfound fame. It was not some critical, world affecting news, after all. In Zhao Jiayi’s impression, his daughter’s live broadcast was tepid. He was not fond of mobile games at all. He had watched a few broadcasts of LoL, and they bored him, so he stopped watching soon enough.</p><br/><p>Zhao Jiayi was always lenient to his daughter. He trusted her daughter in doing what she loved, giving no pressure at all. His daughter was ordinary in all aspects. She might not be very smart, but she never did anything extreme or self-harmed herself just for pleasure.</p><br/><p>A lot of young daughters like her were in far worse shape, notoriously known for actions that left their families with no dignity at all.</p><br/><p>Zhao Jiayi would be much stricter if Zhao Youyue showed any sign of following that path. It was not like he expected his daughter to be a great deity. He just hoped that she could grow up happily and healthily. It shouldn’t be hard to find her a good husband, with her clean reputation and good looks.</p><br/><p>Zhao Jiayi’s trust in her daughter grew firmer with the consistent academic excellence achieved by Zhao Youyue. He was proud that she had maintained such a level of excellence for an entire year.</p><br/><p>She did not disappoint him in after-school activities, either. She brought home the gold medal in the provincial music competition with her violin and made it to the finals of the national music competition. Her confidence and poise during her turn in the competition reaffirmed Zhao Jiayi that the gold medal belonged to his daughter!</p><br/><p>There was no more reason for Zhao Jiayi to be worried about her daughter. Wang Hua had always wanted her daughter to extraordinary. She was now satisfied and had left her to her devices.</p><br/><p>The family of three lived harmoniously and gracefully. Such a blissful scene!</p><br/><p>“Dad, just so you know, I’m now a superstar!” Zhao Youyue blurted out the moment she stood in front of him.</p><br/><p>Zhao Jiayi took it as a joke. He smiled and said, “What kinda superstar, is it prettiest girl in school? Of course, you should be! Youyou is the best! I am proud of you!”</p><br/><p>Zhao Youyue’s expression was uneasy, and she continued, “I’m not just famous at school, I’m now a superstar on the Internet! I’m not sure why, but I’ve become an extremely popular female live streamer. I did not show my face, but somehow my fans found out who I really was. So I showed my face in a live broadcast, and I received more than 2,000,000 worth of gifts. Then various entertainment media started to report about me…”</p><br/><p>Zhao Youyue described her current situation in a detailed manner. She showed her dad the reports on a few media, together with some Weibo hot search photos.</p><br/><p>Zhao Jiayi grew more and more confused. His daughter was just fooling around as a broadcaster, how could she become this famous, while earning millions worth of gifts from the local tyrants. How could this happen to his daughter?</p><br/><p>It was illogical to him, yet the reports on all internet media he was reading said otherwise.</p><br/><p>He stopped Zhao Youyue and called his elder brother Zhao Jiaren, the father of Zhao Hao and one of the directors of Douyu.</p><br/><p>Zhao Jiayi learn more from Zhao Jiaren, regarding the live broadcasting of his daughter, only to be bombarded with praise from his brother over the phone. Zhao Jiaren had been closely monitoring Zhao Youyue’s progress, all this while. He told Zhao Jiayi that the senior directors intended to make Zhao Youyue the Douyu embassador, based on her popularity, along with her impressive talents in games and music. Her choice of content was popular and whetted the appetite of the audience. Games were the content for male embassador and music was the content for the female ambassador.</p><br/><p>Zhao Youyue was the most popular broadcaster for both. Perhaps she should put some effort into cosplaying, roleplaying as some iconic characters. With her natural beauty, she would easily draw the support fromMAC audience. Her popularity would be horrifying!</p><br/><p>Zhao Jiayi was left speechless after listening to his elder brother rattle on about his niece. Well, why didn’t his own brother inform him about this sooner?</p><br/><p>Zhao Jiaren presumed that Zhao Jiayi was already aware of it all. Zhao Youyue had a contract with Douyu, and Zhao Jiayi was the guardian in that contract since she was still underaged.</p><br/><p>Without any funded advertisements, Zhao Jiayi had not expected his daughter to go far in broadcasting. There was no way that she would be the most popular broadcaster in Douyu.</p><br/><p>Douyu had the largest audience traffic and was the best platform in the industry. He was happy and proud of his daughter’s achievements, but he was also concerned about the consequences of such popularity.</p><br/><p>Zhao Jiayi was relatively embarrassed since the beginning of this revelation, for he had such low expectations for his family’s younger generation.</p><br/><p>On that same day, Wang Hao also learned of Zhao Youyue’s breakthrough. Unlike Zhao Jiayi, she was not worried at all. She rejoiced deep inside her heart, and hoped that her daughter could become truly irresistible.</p><br/><p>Wang Hao encouraged Zhao Youyue to further invest her time and talent as a voice actress. She was swayed by the idea of hearing her daughter’s voice from an animated character.</p><br/><p>Zhao Jiayi soon decided to allow Zhao Youyue do as she pleased. He told Zhao Youyue not to worry about anything. It was alright for her to be famous, as long as she remained unblinded by fame and fortune. She had to be strong and headfast, especially when under fire from the public. The only thing that mattered was that her conscience remains clear.</p><br/><p>He and Wang Hao would always be there for her. The earnings of the broadcasting were entrusted solely to her discretion.</p><br/><p>And so, the heavy stone in Zhao Youyue heart was lifted with the blessing of her parents.</p><br/><p>Her cousin Zhao Hao came and took her to Shanghai for the New Year’s holidays.</p><br/><p>When Zhao Youyue got on the car, Zhao Xie exclaimed, “Youyou sister, were my thousands of rockets powerful enough? I’m a big fan of yours, Ah Yu! You’ll have to address me as ‘dear fan’!”</p><br/>\n</div>"}