{"title": "Chapter 358", "id": 358, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-358", "volume_title": "Volume 4", "body": "<h1>Chapter 358</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Obtaining a Side-Character Role</strong></p><br/><p>After Zhao Youyue started suspecting that Ya Jing was the evilest author in the web novel community, as that she specialized in writing incomplete books, she was suddenly afraid. What if she abruptly abandoned her new book without a word too?</p><br/><p>Could an iconic character ever emerge out of an incomplete book?</p><br/><p>This would probably be very difficult to accomplish. A possibility may stem from the fact that the incomplete book was simply too good, and was capable of leaving many readers wanting for more…</p><br/><p>No, such works should not be called incomplete. Instead, they could be regarded in a lighter tone, called —- —- suspension of publication.</p><br/><p>Just like in another world, the light novel “The Haruhi Suzumiya Series” always experienced suspensions of publication. However, no one could deny its popularity. Each and every character in it was iconic in their own right.</p><br/><p>There was also Yoshihiro Togashi’s “Hunter x Hunter.” Needless to say, this manga was certainly not incomplete, but it was clearly not fully completed either. It left the readers hanging just like that, although it was actually a good method of maintaining its popularity. When Old Sly Yoshihiro resumed publication of the manga again, it naturally gave the fans a burst of excitement, every single time.</p><br/><p>However, not long after the fans got excited, the Old Sly would head back to his Mahjong game in order to seek inspiration again</p><br/><p>Zhao Youyue had spent the holidays eating, playing around and reading. Whenever she was brought to the car races, she would also use her mobile phone. She even went to a ski resort with Zhang Wanjun, though obviously, she could not use her mobile phone while skiing.</p><br/><p>All in all, Zhao Youyue had a happy and relaxing holiday. Whether it was her cousin brother Zhao Hao or cousin sister Zhang Wanjun, they both fulfilled the role of being warm hosts and took great care of Zhao Youyue.</p><br/><p>Zhao Hao was pretty careful, this time. He knew that Zhao Youyue had been exposed as the true identity of Ah Yu, and she would be recognized everywhere she went. Hence, he was very careful in interacting with Zhao Youyue, as he was afraid that his bad reputation would affect Zhao Youyue.</p><br/><p>Therefore, Zhang Wanjun, who was inseparable from Zhao Youyue, had her pictures taken by the paparazzi. The pictures of the two shopping together were also uploaded onto the internet.</p><br/><p>There was no doubt this time that Zhang Wanjun became more popular because of Zhao Youyue. She was initially only known as “Black &amp; White Z Mold,” and her popularity was limited to the Bilibili platform. Now that many were assuming that she was a close friend of the ultra-popular female streamer Ah Yu, her Weibo fans and subscription count had increased by quite a fair bit. Some fans had even sent her various forms of “congratulations.” All of Zhang Wanjun’s fans wanted her to make a video with Zhao Youyue.</p><br/><p>Zhang Wanjun had actually recorded a video of her playing the horror game “Left 4 Dead” with Zhao Youyue. Not surprisingly, after she had uploaded it on Bilibili, it became wildly popular. The video had more clicks than all the videos that she had produced before. Due to this, Zhang Wanjun could not help but feel surprised. The popularity of sister Youyue was really quite scary.</p><br/><p>Further, because of the tacit cooperation and teamwork between the two while playing “Left 4 Dead”, and the fact that Zhao Youyue acted altruistically towards Zhang Wanjun, someone actually made up some nonsense about the game being “Left 4 Marriage” instead of “Left 4 Dead”…</p><br/><p>Some fans even lamented about how Ah Yu should have been the one getting teased as she appeared softer and cuter. However, the fact was that “Z Mold,” known as a cool girl with a fresh and somewhat pretty appearance, became the one being teased instead. What exactly was the truth behind all of this?</p><br/><p>At that moment, the fans were all divided, having various opinions. Some fans, on the other hand, wanted to know how these two talented girls got to know each other</p><br/><p>Tacitly, both Zhao Youyue and Zhang Wanjun did not mention anything about the blood relationship between them. This was mainly because the both of them did not want to expose anything about their family background. If the fans could just sit back and watch their live streams and videos quietly, wouldn’t it be enough?</p><br/><p>With the help of Zhang Wanjun, Zhao Youyue had also succeeded in becoming friends with Lin Shiya, though merely as a loyal reader of hers. However, Lin Shiya did not seem to be very enthusiastic about the “loyal reader” Zhao Youyue, and was not very warm towards her. Instead, she began to regard her with more wariness.</p><br/><p>This almost allowed Zhao Youyue to confirm that the real creator of “Bakuman” was not Lin Shiya, but her boyfriend, Shi Jingnian.</p><br/><p>Shi Jingnian was undoubtedly a nasty person. However, in recent times, all the genius-like artists always seemed to be somewhat queer. There was nothing much to say about his fondness for pursuing a “real harem,” as he had never really actively pursued any girls. He would only tease those pretty looking girls a little, here and there.</p><br/><p>Unfortunately, Zhao Youyue did not fall for his tricks. Although he was still curious about Zhao Youyue, he had given up trying. This was because he had found another lady to tease. It was as if she had become a substitute for Zhao Youyue…</p><br/><p>Zhao Youyue knew this lady, as she was also pretty good at playing the violin. She was Zhao Youyue’s opponent in the national music competition. It was just that the girl was way more proud and arrogant than Zhao Youyue. Her name was Lu Xue.</p><br/><p>Lu Xue was an extremely arrogant lady. However, she was not worth as much as Zhao Youyue. After all, her father was only a coal boss[1]. Even so, she liked to order people around a lot, and her temper was really unbearable. She even had the audacity to look down on Zhao Youyue…</p><br/><p>Shi Jingnian had a high tolerance for her. He was clearly not trying to pursue Lu Xue. Instead, he was just treating her habitually, and tolerating her bad temper. However, this probably gave Lu Xue the wrong idea —- —- she had found her true love.</p><br/><p>Lu Xue had never been denied anything since young. She wanted the best of everything. She clearly knew that Shi Jingnian had a girlfriend, and that their relationship was going well, yet she felt that she could be better than Lin Shiya. This was because Shi Jingnian was a hidden musical genius. He was obviously more compatible with Lu Xue…</p><br/><p>Hence, Lu Xue forced herself into Shi Jingnian’s group of female friends.</p><br/><p>Once Zhao Youyue found out that the hidden genius writer Shi Jingnian could tolerate the bad attitude of pretty girls, she felt that her previous actions of approaching Lin Shiya under the guise of a “loyal reader” were really unnecessary.</p><br/><p>“Shi Jingnian, add a cameo for me in your new book ‘Bakuman.’ ”</p><br/><p>“No, it’s not mine. It’s Shiya’s.”</p><br/><p>“Stop pretending. Are you going to add it for me or not?”</p><br/><p>“Lady Zhao, can you fix your attitude? Could it be that you are like this because I’m now pretty close to Xue-er[2]? I know that you guys were opponents in the violin competition, but in my eyes, the both of you…”</p><br/><p>“You’re really full of nonsense! I’ve already sent you my cameo idea. If you do not add it, I’ll tell Lin Shiya about how flirtatious you are!”</p><br/><p>“Shiya knows about it. I don’t hide anything from her. Oh, by the way, I actually wrote a song for you. You can have a look at it. If I can hear you sing it, it would be the greatest achievement in my life!”</p><br/><p>“…” Zhao Youyue was utterly speechless. She thought to herself, the greatest strength of Shi Jingnian was probably his thick skin, or rather, his nonexistent skin!</p><br/><p>It was as if he realized how Zhao Youyue felt. Shi Jingnian let out a gentle laugh and said, “Well, for Shiya’s new book, I still have some rights to suggest and sound my opinions. Lady Zhao, looking at how cute you are, how could I bear to reject your request… I would do anything just to see you smile, you know.”</p><br/><p>Zhao Youyue’s felt goosebumps raising all over her skin. At least, in any case, her side-character would definitely appear in “Bakuman.”</p><br/><p>Shi Jingnian always fulfilled the promises that he made to beautiful ladies.</p><br/><p>Translation note :</p><br/><p>[1] “coal boss” () refers to the boss or owner of a coal mine or coal mining company.</p><br/><p>[2] “Xue-er” here refers to Lu Xue, it is something like a nickname that Shi Jingnian has given to her. Usually, an “-er” is added to the back of someone’s name to indicate that they are close to the person.</p><br/>\n</div>"}