{"title": "Chapter 366", "id": 366, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-366", "volume_title": "Volume 4", "body": "<h1>Chapter 366</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Well-Deserved Reputation</strong></p><br/><p>Before people realized it, May came upon them. At the center of “Bakuman,” which featured a scholarly teenage girl who eats books. Wen Qingyu was originally a female side character, but now, she had turned into the main character of this literary work. It was a successful promotion!</p><br/><p>Shi Jingnian had successfully transformed Wen Qingyu from an inexperienced reader into a remarkable author as the plot developed. The process had left a profound impression on the audience, because there was an author in this novel who was very much alive. Wen Qingyu’s masterpieces positively impacted the readers in many ways.</p><br/><p>Finally, Wen Qingyu had combined her writing techniques and special ability to write something extraordinary to maximize her full potential. She was at the peak in the field of literature, when she finally obtained the oriental literature award and the Saint Laurent literature award!</p><br/><p>It was just one final step before Wen Qingyu gained iconic status!</p><br/><p>This was probably the best way to end this literary work and leave it to spread to even more readers. After all, many readers out there disliked chasing after ongoing series.</p><br/><p>For this literary work to become iconic, it had to be completed. As long as something similar to “Altair” does not occur, all would be good. “Altair” was not a lost cause either, as long as her doujin creations increased, she would become another type of iconic character, but unfortunately, she had already lost her proper “home.”</p><br/><p>“Bakuman” had a well-developed story, the scholar Wen Qingyu had not experienced anything remotely unpleasant, and she was gaining more and more attention in her world, as if she had gained blessing of the entire world. This had let down several fans who had been sitting at the edges of their seats, waiting for Su, the great deity to display her powers. Was this the moment when Su Li finally disassociates her name from the curse?</p><br/><p>The creator of “Bakuman,” Master Ya Jing was certainly not going to get into an accident, she had just attended a promotional event because of the popularity of “Bakuman” not long ago. During the event, she had not spoken one word about her novel, but instead, shared stories of her high school life.</p><br/><p>Her fans were pleased with it; it was perfect for Master Ya Jing to become a beautiful and talented author in their hearts!</p><br/><p>Master Ya Jing lived such an artistic life, what accident could possibly happen to her?</p><br/><p>Many fans who loved Wen Qingyu loved the author as well; they thought that Master Ya Jing was a realistic version of Wen Qingyu, only without the ability to eat books. Since she was able to create the iconic character, Wen Qingyu and went on to create so many more original works through her hands, she was definitely more talented than Wen Qingyu.</p><br/><p>That’s right, Master Ya Jing not only just created many original works for Wen Qingyu, she also created many original works for other authors who were modeled after real-life creators, and she could even convincingly mimic their writing style. That was simply outstanding!</p><br/><p>Would Master Ya Jing be the first who to remain unaffected by Su, the great deity? Master Ya Jing had to be protected by some extremely powerful forces!</p><br/><p>This made “Bakuman” even more popular, as both its creator and character had withstood the mysterious power of the Orient!</p><br/><p>Whenever Su Li’s curse threatens to strike again, we could always count on Master Ya Jing to repel it!</p><br/><p>This was the thoughts of the fans who made uncovering Su Li’s curse their life’s goal. At least, this was before the ghostwriting of Master Ya Jing was exposed.</p><br/><p>It was high time they ended this joke and ceased with this tomfoolery.</p><br/><p>Then, the big news struck. These jokers did not start investigating, or questioned Master Ya Jing in person. They headed for Su Li’s Weibo before anything else. It was such an exciting day!</p><br/><p>“Just as expected from Su, the great deity, something bad has really happened!”</p><br/><p>“I don’t care if this ghostwriting thing is a real deal, but this mysterious curse is most certainly real!</p><br/><p>“The death drawing pen has earned its well-deserved reputation, I must say that I’m really impressed!”</p><br/><p>“There’s no escape from the curse of Su, the great deity; you know nothing of its power!”</p><br/><p>“Worship Su, the great deity! Please draw an illustration of ‘Gen Urobuchi’s’ work; I’m already fed up with him. Requesting to use Su Li’s karmic weapon!”</p><br/><p>“Is she taking the blame this time? She can’t be taking the blame every time, right? There are way too many coincidences; this must be the real deal…”</p><br/><p>“Everything is Su Lu’s fault, because she holds the pan of this generation!”</p><br/><p>…</p><br/><p>Without a doubt, the ghostwriting of Lin Shiya was exposed by Lu Xue who could no longer stand for it. She did not throw out all the evidence like recordings and sketches at once, but instead, she hired a “BigV” who was skilled at exposing scandals, and used this individual to pose as a warning to Shi Jingnian.</p><br/><p>This BigV service of exposing scandals was extreme, of course, he offered excellent services to his client. He was a master spin-doctor, capable of twisting truths and turning them to lies, making criminals out of heroes.</p><br/><p>His biggest hobby was probably to argue for the sake of arguing, instead of exposing fake news. If someone told him that religion had a purpose, he would say that it was opium for the masses. If someone told him that Chinese medicine was useless, he would say that the luxury of being a practitioner of Chinese medicine was advantageous.</p><br/><p>First, he read “The way of University” and “Big Big World,” followed by the popular “Bakuman” written by Ya Jing; he roughly got an idea about her writing style. Then, he found the blog of Ya Jing and realized that the articles written in her blog shared no similarities to her novels!</p><br/><p>Even he was taken by surprise, his client never wanted him to frame Ya Jing, after all, Ya Jing actually had someone writing on her behalf!</p><br/><p>Luckily, he also managed to find the comments of Ya Jing on Douban; he discovered the viewpoint of her remarks was entirely different from her famous novel!</p><br/><p>Although Lin Shiya and Shi Jingnian shared a common view on literature, both of them have their own differences. It was a fact that men and women had different ways of thinking.</p><br/><p>Lin Shiya had not yet mastered the ability to write a novel. The writing styles of her short articles were not simple, but neither were they fanciful. If there was a word to describe her style, that would be “pretentious.”</p><br/><p>Many fans thought that her previous popular literary work, “Big Big World” was a casual, leisurely work, filled with divine sentiments, and that it was awesome.</p><br/><p>This was definitely not a work of pretentiousness, as the author had clearly traveled across the glove.</p><br/><p>This BigV then spent three days writing an article in Weibo, and he directed his shots at Ya Jing. Starting things off with such a bang was bound to yield him great fame!</p><br/><p>He was feeling extremely sure of himself, because he was exposing a real scandal for once. Ya Jing was downright fraudulent!</p><br/><p>As expected, the article went viral, and it was shared among the netizens, just like a wildfire spreading across a kerosene covered wheatfield!</p><br/><p>Of course, the cyber navies were working behind the scenes as well.</p><br/>\n</div>"}