{"title": "Chapter 377", "id": 377, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-377", "volume_title": "Volume 4", "body": "<h1>Chapter 377</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Independent Bookstore</strong></p><br/><p>Of course, Zhao Youyue called up Su Li again this time. It was the summer holidays, so she had lots of time to dine together and have lots of fun with Su Li.</p><br/><p>This time, as Su Li was forced to carry the pan once again after she drew “Wen Qingyu,” she was not as calm as she used to be. Her heart was filled with faint hints of guilt —- —- Shi Jingnian and Lin Shiya’s tragic downfalls were not really a result of her poisonous touch, right?</p><br/><p>She had been troubled all day long, wondering if she should do something to make it up to them. However, just as she was thinking about this, Zhao Youyue had told her that she did not need to be bothered about such things, as she had already sorted everything out…</p><br/><p>Su Li immediately felt relieved. She was especially grateful to Zhao Youyue. Her mysterious powers had caused so much trouble that Zhao Youyue had to step in and help her clean things up. She felt really embarrassed. Therefore, she decided that she would draw anything that Zhao Youyue requested from her in the future.</p><br/><p>She would willingly obey every single one of Lady Zhao’s instructions.</p><br/><p>Previously, Su Li did not believe that her illustrations were poisonous. She had believed that everything was just a coincidence. Now, the foundations of those beliefs had been greatly shaken. She feared that her illustrations might actually possess mysterious powers. This power did not only act on the character which had been illustrated, it also acted on the creator of this character. Anyhow, anyone who was in any way related to the illustration, was bound to undergo misfortune…</p><br/><p>On the contrary, she, as an illustrator, was becoming more and more popular. Many netizens did not know that she was a mangaka and had no knowledge about her works at all. Even so, they were familiar with all the drama revolving around her and also knew about all her “great achievements.”</p><br/><p>This popularity had fortified Su Li’s position in the ACG community. The price of her upcoming illustrations would surely be significantly marked up. However, there was also a problem as to whether anyone would dare let her illustrate of their characters</p><br/><p>Of course, some of the “Old Sly” type of authors came forward for that very purpose. According to “Su Li’s Law” that had been summed up by the internet, as long as they cruelly abused the characters who have been illustrated by Su Li, and put the character through some sort of calamity, then the creator would naturally be safe. On the contrary, if nothing was done to the character, and the creator did not proceed to give a bento to the illustrated character, then they had to be extra careful, because Su, the Great Deity was watching them!</p><br/><p>That was probably the death stare!</p><br/><p>In order to avoid the befalling of any form of misfortune, they should probably seek help from the kind-hearted female live streamer Ah Yu. Ah Yu was someone who was capable of altering their fate. She would definitely be able to prevent death, but if they lost an arm or broke a leg, it was entirely out of Ah Yu’s control…</p><br/><p>Shi Jingnian’s current, devastating state was something known to everyone…</p><br/><p>There was also a separate party that viewed Su Li as an object of ridicule. They felt that Su Li had truly stolen the fate of many other creators. How else would she explain why she was getting more and more popular?</p><br/><p>Her influence was no longer limited to the manga industry. She had already achieved a whole new level of popularity on the internet. She was probably the most eye-catching person among all other creators.</p><br/><p>Su Li just happened to be preparing for a discussion with Zhao Youyue about her new original work. She wanted to see if she could get her approval. Thus, when Zhao Youyue asked her to hang out again, she agreed with alacrity.</p><br/><p>After they finished enjoying their food, they proceeded to enter an independent bookstore, which had newly been discovered by Zhao Youyue. It was located in a very remote area, and so, there were not many customers. It was also largely unknown. The owner of this bookstore obviously did not care much about her profits. It was simply set up for the owner to get to know more like-minded friends.</p><br/><p>The owner was a female travel writer[1], but apparently, she could not wholly support herself just by writing books. She usually wrote advertorials, or, after visiting a particular tourist attraction, she would write about her thoughts and share her review of the place. Of course, it was all just focused on promoting the location.</p><br/><p>All the books in the bookhouse[2] were hand-picked by the owner herself. They were of various styles, and were all extremely artistic and literary.</p><br/><p>It could be said that the owner’s writing career was a failure, because her works did not sell at all. However, she still qualified as a book-lover. Zhao Youyue almost wanted to learn from the owner. She could also open an independent bookstore, then dedicate it to her friends. After all, she had a lot of friends who were authors and mangakas.</p><br/><p>Zhao Youyue brought Su Li into this independent bookstore, and removed her sunglasses and mask. She was still a hot topic on the internet. More and more people were beginning to recognize her in reality. In the beginning, she only felt a sense of accomplishment. This was the sense of presence that she had once wanted so much. However, as time went by, she had grown to find it bothersome. Perhaps, once an opportunity appears, she might even feed on the impulse to directly cut away her long hair and revert to the state of a side-character. Only when she had ceased being a hot topic, she would grow out her hair again.</p><br/><p>After she managed to obtain various character cards, Zhao Youyue grew a lot more emboldened. She was not as keen to be in the center of attention as before. This was because she knew that if she wanted to, she could easily do it.</p><br/><p>As expected, the owner of the independent bookstore was not in. There was only one shopkeeper in the entire bookstore. She was probably the owner’s niece. She was already a university student. She came to work, as it was the summer holidays.</p><br/><p>Not many people were in the bookstore. The air-conditioning was working well. Upon entering the bookstore, they were greeted by a nice, chill breeze. If such a lovely bookstore was discovered by elderly women, they would probably just come here daily to enjoy the air-conditioning.</p><br/><p>Fortunately, this independent bookstore was quite well-hidden. Moreover, the owner never really advertised it. Other than those who inadvertently came across her unpopular works, not many knew about it.</p><br/><p>Fortunately, Zhao Youyue was one of those did come across her works. No, it should be said that, Zhao Youyue had accidentally discovered it from Shi Jingnian’s collection of books. It was an entire book that the author had dedicated into writing about the independent bookstore which she opened, and it contained the address of the bookstore.</p><br/><p>Shi Jingnian even personally recommended this bookstore to Zhao Youyue. He also expressed his sympathy for the owner, as she was essentially an unmarried female travel writer who was already in her thirties. She was clearly really talented, but unfortunately, the general public did not acknowledge her talents.</p><br/><p>Zhao Youyue could not help but inquire into about relationship between Shi Jingnian and that female write. As a result, Shi Jingnian candidly stated that all they had was just a pure friendship. This was because her looks were merely average. Considering how Shi Jingnian was such a lustful guy, he was obviously only interested in beautiful girls. To top it off, only gorgeous girls who were of natural beauty and had great temperaments qualified.</p><br/><p>As to why the female writer became a leftover woman, Shi Jingnian had also indicated that it might be due to the fact that after she got to know him, her standards of what she looked for in a partner eventually heightened…</p><br/><p>Zhao Youyue unceremoniously asked him to look in the mirror clearly, to see if he really had the audacity to say such a thing.</p><br/><p>At that time, Shi Jingnian took Zhao Youyue’s instructions seriously. After he looked in the mirror, he still insisted that he was really just too handsome. This was because his inner beauty still existed, and it would not be affected even in the slightest, just because of his outer appearance. Hence, he still had the courage to say such things.</p><br/><p>Zhao Youyue felt that Shi Jingnian was beyond saving. He would forever be filled with his self-righteousness and his utter love for himself.</p><br/><p>Zhao Youyue ordered one cup of freshly squeezed juice for Su Li. She also ordered a cup for herself. Well, independent bookstores were perfect for reading books while having a drink.</p><br/><p>“I’ve already come up with an idea for my new piece of work. It’s called ‘(go j r chng)'[3]…” Su Li started the conversation.</p><br/><p>Translation note :</p><br/><p>[1] A “travel writer” is a person who writes about places they have visited and their experiences while traveling.</p><br/><p>[2] “Bookhouse” is a bookstore that not only sells books but also serves food and drinks. It provides for the customers a place to sit and read the books available in the bookstore, regardless of whether they have bought the books or not. The independent bookstore here is a bookhouse but the author uses the terms ‘bookstore’ and ‘bookhouse’ interchangeably.</p><br/><p>[3] “” pronounced as (Go j r chng) in Chinese, is actually the Chinese name of the anime “Himegoto” (lit. Secret), also known as “Secret Princess.” The Chinese name has to be used here, because the characters were conversing in Chinese. Only by this method would the next chapter of the story make, where Zhao Youyue gets confused about the name and think that it meant something else, as she had misinterpreted it when Su Li said it.</p><br/>\n</div>"}