{"title": "Chapter 376", "id": 376, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-376", "volume_title": "Volume 4", "body": "<h1>Chapter 376</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Spiritual Book Eating?</strong></p><br/><p>After Zhao Youyue found that the “literary girl’s physique” was unsuitable for science-based works, she was not immediately convinced. Thus, she also tried eating some scientific papers. It subdued all her doubts. In fact, she could apply some food-based analogy on this matter.</p><br/><p>For example, some people were allergic to seafood. If it was severe enough, they might even die. Now, whenever Zhao Youyue ate non-literary works with the “Wen Qingyu card” was active, she would experience a similar form of discomfort.</p><br/><p>The more profound the scientific papers were, the stronger the discomfort would be!</p><br/><p>Due to this, she could not even force herself to eat them. There was no doubt that the act of eating these books would not have any adverse effects on her body, but it would surely affect the character card of Wen Qingyu. She might even end up breaking the character card!</p><br/><p>Zhao Youyue treated these iconic character cards like they were precious treasures. All of them were wives which contributed to her harem income. Since she owned such a superb set of cards, she would never do anything to hurt them.</p><br/><p>Originally, Zhao Youyue had wanted to expand her knowledge in the scientific field, through the book-eating abilities of Wen Qingyu. Now that she had experimented with it, she realized that she was only being foolish. A girl with a taste of literature, was not an elite, science scholar. Science was indeed the predator of a literature person…</p><br/><p>Zhao Youyue then began to eat the famous literary works. The first book she ate was Sima Qian’s “Records of the Grand Historian”[1].</p><br/><p>“Records of the Grand Historian” was an extremely famous work that recollected history with prose. It was assessed by Lu Xun[2] as “the peak of poetic perfection, the top of picturesque rhythm.” What would such a great book taste like? Zhao Youyue was very curious.</p><br/><p>All the books that Zhao Youyue had eaten in the world of “Bakuman” were basically planned by Shi Jingnian. Most of them were Western masterpieces. They were considered to be works that he knew relatively well. Only by this manner, could he perfectly describe the taste of the book…</p><br/><p>Of course, as he was in the process of writing, he felt that all these flavors had been savored by “Wen Qingyu” herself; because Wen Qingyu was the one living in the world of his work. Then, of course, it was also possible for him, as the master of this world to experience the feelings of Wen Qingyu while in the “intoxicated” state.</p><br/><p>Now that Wen Qingyu had appeared in the real world, Zhao Youyue could taste the flavors of various literary masterpieces, through the use of this character card.</p><br/><p>“Records of the Grand Historian” clearly did not taste bland. Each part of it had a unique taste. For example, when she ate “First Emperor’s Basic Annals”, “Xiang Yu’s Basic Annals”[3], “Chen She’s Hereditary Houses”[4], “Bai Qi and Wang Jian’s Ranked Biographies”[5] and so on, it tasted like blood mixed with the smokey smell of war. She did not feel any discomfort when she ate them, but she was not happy either. After all, history was inherently bloody. Which emperor did not live by the rule of “one’s success relied on thousands of deaths”[6]?</p><br/><p>When she tasted “Records of the Grand Historian,” it seemed like she had spent a great deal of time researching that rich history, and she could remember all the scenes by heart. If someone wanted to test her on the contents of “Records of the Grand Historian,” she would certainly be able to answer the questions with ease. This was the good thing about the “book-eating” ability, but unfortunately, it was only limited to literature-based works.</p><br/><p>Of course, in addition to the taste of blood and smoke, there was also the taste of fine wine. History has always been like fine wine, long and beautiful. The richer the history was, the more refined the taste of the wine, and the history of China was undoubtedly vibrant. It was possible to earn wisdom by simply reading history Compared to foreign officialdom works, as well as court politics works, China’s works were a lot more artistic. Only smart authors could play around with politics.</p><br/><p>In addition to the taste of blood and wine, there were various other tastes, including those that were sweet, sour, bitter and spicy. After all, there were too many characters in “Records of the Grand Historian.” After spending the whole afternoon, Zhao Youyue only managed to read one-tenth of the book.</p><br/><p>She deactivated the Wen Qingyu card. At that point in time, the Sun was already setting, and the sunlight shone through her study, creating a beautiful twilight. She originally thought that there would be a huge mess in front of her. This was because she had not directly eaten the entire book in one go. Instead, when she was eating books, she had to tear and eat it page by page. Moreover, she did not consume it page by page. One page had to be torn into a few pieces…</p><br/><p>Now, however, she discovered that her “Records of the Grand Historian” was actually still intact. Not only the “Records of the Grand Historian,” even all the scientific papers she had eaten previously had not been affected in any way… Even the apple was still in one piece!</p><br/><p>However, “Records of the Grand Historian” had been flipped to the page where she last “ate” after she had activated the Wen Qingyu card. The other scientific works were also flipped open.</p><br/><p>All at once, it all dawned upon Zhao Youyue. Perhaps, Wen Qingyu’s card only gave her the illusion that she was eating the book in the real world, but in actuality, she was actually reading it with relish?</p><br/><p>Was the apple tasteless, because she did not actually eat the apple?</p><br/><p>She was only eating the concept of an apple. If it was just the noun “apple,” it was understandable to be completely devoid of taste!</p><br/><p>How did she appear to others? Just another girl who was completely immersed in reading?</p><br/><p>She was so focused that she had completely memorized the contents of the book. Was this why she could perfectly recall everything?</p><br/><p>The Wen Qingyu card was really magical. Wen Qingyu was not just a scholarly girl, but also a girl suffering from sophohigh syndrome. So, did she only eat her books in her imagination?</p><br/><p>Or, was this the embodiment of the correcting powers of the real world?</p><br/><p>No, if anyone studied “Bakuman” carefully, they would find that the creators have long pointed out that Wen Qingyu’s book-eating was just a concept. When mirrored in reality, it might turn into a spiritual, internal ability. It was like an illusion in which you would immerse yourself into a spiritual sense reading through eating books, so much so that the book could be read through thoroughly, and digested</p><br/><p>Therefore, Zhao Youyue’s original idea was to finish eating a whole basket of books this afternoon was rendered impossible. She had only managed to read the one-tenth of the “Records of the Grand Historian” for the entire afternoon!</p><br/><p>The Wen Qingyu card seemed to be the kind of card that acted as a support ability for actual reading, but its functions were still limited to literary works.</p><br/><p>Such a discovery allowed Zhao Youyue to attain a deeper understanding of the character cards. If she receives any superpower cards in the near future, she would see things as if she really had superpowers, but others would her suffering the effects of sophohigh syndrome…</p><br/><p>Of course, her superpowers would also be brought about through a different kind of logical way. The real world would intervene and make the necessary adjustments for her to conform and fit in.</p><br/><p>However, all this was just Zhao Youyue’s guesswork. In the future, only when she has acquired a character card with a high level of superpower, could she continue to explore its mysterious intricacies.</p><br/><p>Zhao Youyue was filled with new questions that she was eager to answer. Owing to the corrective powers that will be working their magic on the Wen Qingyu card, she could now safely use it in front of others. She can even go to the library for “book-eating.” This would save her from buying every single book, one after another.</p><br/><p>However, to verify that her book-eating was a spiritual concept, she felt that she should look for someone to test it out. At the same time, from the other person, she could get to know more about the kind of state she really falls into whenever she “book-eats.”</p><br/><p>Translation note :</p><br/><p>[1] Sima Qian was a Chinese historian of the early Han dynasty. He is considered the father of Chinese historiography for his “Records of the Grand Historian”. The “Records of the Grand Historian” (), also known by its Chinese name “Shiji” is a monumental history of ancient China and the world finished around 94 BC by the Han dynasty official Sima Qian after having been started by his father, Sima Tan, Grand Astrologer to the imperial court. The work covers the world as it was then known to the Chinese and a 2500-year period from the age of the legendary Yellow Emperor to the reign of Emperor Wu of Han in the author’s own time. In all, the “Records of the Grand Historian” is about 526,000 Chinese characters long, making it four times longer than Thucydides’ “History of the Peloponnesian War” and longer than the Old Testament.</p><br/><p>[2] “Lu Xun” () was the pen name of Zhou Shuren (25 September 1881 19 October 1936), a leading figure of modern Chinese literature. Writing in Vernacular Chinese and Classical Chinese, he was a short story writer, editor, translator, literary critic, essayist, poet, and designer.</p><br/><p>[3] The “Basic Annals” () make up the first 12 chapters of the “Records of the Grand Historian”. The first five cover either periods, such as the Five Emperors, or individual dynasties, such as the Xia, Shang, and Zhou dynasties. The last seven cover individual rulers, starting with the First Emperor of Qin and progressing through the first emperors of the Han dynasty. In this section, Sima chose to also include de facto rulers of China, such as Xiang Yu and Empress Dowager L, while excluding rulers who never held any real power, such as Emperor Yi of Chu and Emperor Hui of Han.</p><br/><p>[4] The “Hereditary Houses” () is the second largest of the five “Records of the Grand Historian” sections, and comprises chapters 31 to 60. Within this section, the earlier chapters are very different in nature than the later chapters. Many of the earlier chapters are chronicle-like accounts of the leading states of the Zhou dynasty, such as the states of Qin and Lu, and two of the chapters go back as far as the Shang dynasty. The later chapters, which cover the Han dynasty, contain biographies.</p><br/><p>[5] The “Ranked Biographies” () (usually shortened to “Biographies”) is the largest of the five “Records of the Grand Historian” sections, covering chapters 61 to 130, and accounts for 42% of the entire work. The 69 “Biographies” chapters mostly contain biographical profiles of about 130 outstanding ancient Chinese men, ranging from the moral paragon Boyi from the end of the Shang dynasty to some of Sima Qian’s near contemporaries. About 40 of the chapters are dedicated to one particular man, but some are about two related figures, while others cover small groups of figures who shared certain roles, such as assassins, caring officials, or Confucian scholars. Unlike most modern biographies, the accounts in the “Biographies” give profiles using anecdotes to depict morals and character, with “unforgettably lively impressions of people of many different kinds and of the age in which they lived.” The “Biographies” have been popular throughout Chinese history, and have provided a large number of set phrases still used in modern Chinese.</p><br/><p>[6] “One’s success relies on thousands of deaths” () is a famous sentence derived from a poem written during the Tang Dynasty. It means literally that a general achieves goals or benefits (from the wars) while ten thousand of bones rot. It simply means that many soldiers have sacrificed their lives in the wars. This sentence dates back to about 1200 years ago and it has really revealed a cruel and unfair truth that in a group the inferior-hierarchy persons always sacrifice for the superior-hierarchy persons. The inferiors suffer while the superiors gain benefits, honors, and status.</p><br/>\n</div>"}