{"title": "Chapter 371", "id": 371, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-371", "volume_title": "Volume 4", "body": "<h1>Chapter 371</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> As Long As You Are Happy</strong></p><br/><p>This was the second time that Zhao Youyue and Shi Jingnian were meeting. She looked at the miserable, wheelchair-bound Shi Jingnian. She found this version of him marginally likable, compared to the time when he was still feeling good about himself, pleasing pretty girls in all sorts of ways.</p><br/><p>Of course, even she could not deny that these winds of change were brought about by one radically different point. Shi Jingnian’s official self-instatement as the author of “Bakuman” came as a pleasing development. Without him, there would be no Wen Qingyu who was quickly gaining popularity.</p><br/><p>As things were, Shi Jingnian was a “Bakuman” himself. His dream was rather unrealistic, he had this vision of a “True Love Harem.”</p><br/><p>Zhao Youyue first dismissed the employee who had escorted her to the ward. She knew her way around her father’s hospital. She used to play here when she was little. Compared to now, things were very different. After all, technology had taken leaps and bounds forward, like the rest of the world.</p><br/><p>If things happen within expectations, Zhao Youyue would be inheriting this hospital. Of course, according to many drama plotlines, there might be many aspiring young doctors who intended to pursue this hospital dean’s only daughter. If one succeeded, then the hospital dean position would be at his fingertips. After all, Zhao Youyue did not seem to be studying medicine</p><br/><p>However, even if Zhao Youyue did not study medicine, she could easily acquire legendary medical skills from the literary world, even skills such as “Holy Light.” What good would medical studies bring her?</p><br/><p>Traditional Chinese Medicine in the real world may be regarded by many fraudulent, while constantly being slammed by the medical community as faux-science. However, within novels, Traditional Chinese Medicine was regarded as a skillset of the divine. With the combination of internal strength and the application of acupuncture, no illness would be incurable!</p><br/><p>As the daughter of the hospital dean, Zhao Youyue thought that it would be surprising if she would be able to show off some God level medical skills during a crucial moment.</p><br/><p>If Zhao Youyue indeed had such medical skills, her status would quickly rise to the top. After all, everyone was afraid of dying, especially dignitaries.</p><br/><p>But of course, everything depended on fate. Zhao Youyue was not in a hurry to acquire such medical skills. For now, she added it to her list.</p><br/><p>Shi Jingnian was still in a daze. Zhao Youyue approached him, and in her forever inscrutable, gentle voice, she asked, “How do you feel?”</p><br/><p>Such an expression seemed to show that she was deeply concerned for him. It displayed her kindness in its raw form.</p><br/><p>Shi Jingnian stirred from his stupor. He could never imagine that this gentle curative Lady in his eyes right now had once given him such a cold, perfect, distant impression, the first time they met. She had looked into the horizon before her that no one else could see, threading resolutely along her own path, so pure in her passion and pursuit for music… But now, she was approachable, as approachable as his neighbor’s sister.</p><br/><p>Zhao Youyue was the only girl that Shi Jingnian had never been able to fathom. However, at that moment, even if her tenderness was only for courtesy and appearance’s sake, it warmed him to the core.</p><br/><p>“Thanks to you, my Lady. I feel as if I would be able to struggle much longer. It’s just as expected, good people don’t live long, while scourges remain thousands of years. Hahaha,” Shi Jingnian attempted to quip. If it was the him from before, his smile would certainly have been downright charming. Lethal, even. But now, it was a revolting smile that would frighten most off.</p><br/><p>Zhao Youyue had always factored aesthetics into her overall judgment. Even so, she felt that the Shi Jingnian at this moment was quite attractive. Perhaps this was the so-called, legendary inner beauty?</p><br/><p>Not everyone would be able to remain so open-minded after suffering from such a significant change in life.</p><br/><p>“You’re a good guy.” Zhao Youyue remained gentle as she spoke, the perfect smile still gracing her face.</p><br/><p>“Woah! Lady Zhao, those are words that you speak to a dying man! Hurry and kick me out of this hospital! I don’t want to receive a good man’s card. I have never even proposed to you!” In no time at all, Shi Jingnian had reverted to his slick man persona.</p><br/><p>If he was still that very handsome Shi Jingnian, Zhao Youyue might instinctively feel disgusted again. But now, Shi Jingnian threshold was significantly higher. No matter what words he spoke, his body would never be able to live up to them. Why argue with a disabled person?</p><br/><p>Then again, the Shi Jingnian of old had never once succeeded to follow through his words with actions. He only pleased girls with his glib tongue, but never pursued them.</p><br/><p>“You can focus on your writing. Don’t worry about your father or your family debts. I’ve taken care of everything. Your dad will come to visit you soon,” said Zhao Youyue, clearly understating facts.</p><br/><p>She wheeled Shi Jingnian out of the ward. For a moment, the whole world fell into silence.</p><br/><p>Shi Jingnian lowered his head. His glib tongue had failed him. His thoughts took him further away when Zhao Youyue suddenly started singing. It was the very song that he had written for her. Her rendition of it came out as a ballad, calming and ethereal. Zhao Youyue had captured the full essence of the song.</p><br/><p>It was a most touching performance. All soul, with none of the flourishes.</p><br/><p>Shi Jingnian had never cried for as long as he could remember, as there was nothing worthy of his tears. He took everything for granted. But now, he was crying. He did not know why. Perhaps Lady Zhao’s singing was just that good.</p><br/><p>“Hey, my Lady, you’re my entire life’s benefactor. Since I’m now a good-for-nothing, what talents that remain of me are at your full disposal,” Shi Jingnian choked tearfully.</p><br/><p>“Actually, what I’ve done was no different from what Lin Shiya did. She fancied you as who you were. She probably cared more about you than anybody else. Therefore, she could not accept to see you in your current state. I don’t care about you at all, but I do acknowledge your talents. I consider your talents worthy of my notice.”</p><br/><p>Zhao Youyue seemed to have completely removed her gentle mask, and was speaking in a calm, controlled manner.</p><br/><p>“Lady Zhao is still so cute, even as a tsundere. I am really, really happy. This seemed to be the only way for me to receive such treatment. It was somehow worth it.”</p><br/><p>Shi Jingnian did not mind Zhao Youyue’s ice-cold words at all. He only felt that Zhao Youyue’s singing just now was truly wonderful. More than anything, he wanted to continue writing songs for her.</p><br/><p>Zhao Youyue enjoyed his writing. Thus, he would continue writing for her. As long as she is pleased with it, anything would be fine.</p><br/><p>Now, she was the only person who did not care about his disfiguration and disability. He would only trouble the other ladies if he tried to go back to his old ways.</p><br/><p>He was aware of his current standing.</p><br/><p>Finally, this was the raison d’etre he had been looking for.</p><br/><p>“As long as you’re happy,” Zhao Youyue replied calmly.</p><br/><p>“No, it’s as long as YOU’re happy.” Shi Jingnian actually bent down, attempting to bow, albeit with difficulty from where he sat in his wheelchair, and replied very solemnly, as if he had completely submitted to his King.</p><br/><p>With Zhao Youyue’s help, the publication process of Shi Jingnian’s “Bakuman” should not have any problems. At the same time, Zhao Youyue would also help Shi Jingnian to fight for the full copyright of his previous two books, while exposing the truth to the public.</p><br/><p>Never look down on the credibility of her perfect popularity on the internet.</p><br/><p>She was not intending to help Shi Jingnian regain his reputation, nor to make Lin Shiya lose all her standing and reputation. She just wanted to give “Bakuman” greater influence, a higher popularity, and an explosion of sales. If Shi Jingnian was still ‘covered with a stigma,’ that would not be good.</p><br/><p>Besides, as Shi Jingnian’s creditor, she had to collect a debt. If not, the income from her live broadcast would be used to sustain the loss.</p><br/><p>This was her first investment ever, and it was on a person’s life.</p><br/>\n</div>"}