{"title": "Chapter 382", "id": 382, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-382", "volume_title": "Volume 4", "body": "<h1>Chapter 382</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Return to the Life of the Ordinary</strong></p><br/><p>Zhao Youyue did not bat an eyelid at as the internet trembled and warped. The number of Ah Yu’s worshippers remained irrelevant to her.</p><br/><p>On the contrary, she was getting bored with all the attention. Apparently, she had been robbed of her freedom. She was only having fun with her friends, why did the internet have to turn it into a war zone?</p><br/><p>Everybody was digging about for her identity and trying to determine how powerful her background was; nobody paid attention to her talents anymore</p><br/><p>Before this incident, most people thought that Ding Yuncong was one of the finest youths from an established upper-class family. He was a friendly and approachable person. Placing millions of RMB as a reward for a lost dog was a common stuntofhis, no doubt to show off his wealth. People would cynically regret being of less value to a dog.</p><br/><p>Nobody had ever witnessed Ding Yuncong being humble to anyone. This was the first time he had done so to protect Ah Yu’s name. It surprised many.</p><br/><p>Ding Yuncong was an arrogant person. Yet, there he was, admitting to being Ah Yu’s lapdog. His reasons became inconsequential, she was definitely somebody that must be treated courteously. It would be the worst crime ever to assume that Ah Yu was a broadcaster of insignificant beginnings.</p><br/><p>Some worried fans were concerned about Ah Yu getting reprimanded over this incident. She was closely related to a boss from another platform. Was her loyalty wavering?</p><br/><p>Douyu officials had more faith in Ah Yu than the netizens. They divulged a small piece of information, claiming that Ah Yu had the highest level access in Douyu. She even had a say in the board of directors</p><br/><p>With such an influential relationship, Douyu had given her an exceptionally well-conditioned contract that lasted perpetually. Her crown as the most important broadcaster would never be shaken.</p><br/><p>Nevertheless, Zhao Youyue’s background remained incomprehensible for the time being. Some netizen, swayed by the novels that they read, concluded that Zhao Youyue was born in a legendary, hidden family. Rumors had it that Western nations were under the control of some so-called Western Masonic Society, and Eastern Hidden Families controlled Eastern nations.</p><br/><p>It was a ridiculous conjecture, yet some people believed in it. And so, the extent of the collective intelligence of the internet had been vividly exposed. Even so, they could not be blamed, as this had been caused by the highly uncharacteristic humility displayed by Ding Yuncong in the face of Lady Zhao. Everyone had been left puzzled!</p><br/><p>The small group of people who scandalized Ah Yu’s image with evil intentions were left speechless. Ah Yu had turned out to be more affluent than Ding Yuncong. How could she be materialistic?</p><br/><p>Apparently, someone had been clamoring after her wealth!</p><br/><p>It would be most fortunate to become Lady Zhao’s younger brother!</p><br/><p>Even Zhao Hao was ruthlessly mocked by netizens when he mentioned that he was Ah Yu’s cousin!</p><br/><p>Everybody thought that he was a failure, compared to Ding Yuncong. Who did he think he was, relating himself to Lady Yu?</p><br/><p>Stop being a joke!</p><br/><p>Zhao Hao was at a higher rank than Zhao Youyue in Zhao Family, yet to most of the netizens, he showed up merely to seek attention and gratify himself with his family relationship. Did he not notice Lady Ah Yu ignoring him?</p><br/><p>Zhao Hao went through the comments on his Weibo. He was distraught by the teases of netizens. They jeered of the fact that he was related to Ah Yu, especially at the fact that he was loosely related. He was not an immediate relative of Ah Yu, yet he had the guts to announce it. Such a laughable act!</p><br/><p>In the eyes of netizens, Zhao Hao was grabbing the opportunity to be a part of the news. Zhao Hao could take these insults no longer. He sent out a photo of Zhao Youyue and Zhang Wanjun when they were children. He pointed out that the smallest-sized short-hair girl was Zhao Youyue.</p><br/><p>He had to do so. Zhao Youyue was an unseemly ordinary child. Everybody had been focused on that compelling young boy, Zhao Hao. Even Zhang Wanjun had a stronger aura than Zhao Youyue. Zhao Youyue used to be a decorative character before she went to Junior High. She was used to viewing the world from the perspective of an ordinary stranger.</p><br/><p>Zhao Hao happily displayed his photo to the public. He was certain that netizens would have to acknowledge him, seeing how close he was to Zhao Youyue. Unfortunately, comments from the people were like</p><br/><p>“Ah Yu was in the photo? I refuse to believe it!”</p><br/><p>“Ah Yu was supposed to shine like a star since birth, how could that ordinary girl be Ah Yu?”</p><br/><p>“In my heart, Ah Yu is always the long-haired goddess. Who is that short-haired stranger!”</p><br/><p>“It would be more convincing if you showed us a photo of young Ah Yu playing the piano.”</p><br/><p>“Please stop trying to steal the spotlight. If you are so much greater than Ah Yu, why is your identity so much less protected? You dad is only a businessman, but who are Ah Yu’s parents, nobody knows that!”</p><br/><p>…</p><br/><p>Zhao Hao was disappointed after reading all the comments. Why would nobody think that he deserved to be the cousin of Ah Yu? He was only there to help Youyue out!</p><br/><p>However, the comment that mentioned the unknown identity of Ah Yu’s parents was right. Ah Yu’s background was far too mysterious to be revealed. Netizens could only make stories out of it.</p><br/><p>Some understanding netizen believed that the ordinary child was Ah Yu. After all, they both shared similar facial features. They sincerely thought long hair suited Ah Yu more than short hair. She would be easily disregarded with short hair, looking just like any other pedestrian on the road!</p><br/><p>In conclusion, long-haired Ah Yu was the best! Ladylike Ah Yu was the best!</p><br/><p>Zhao Hao relented to his fate. Ah Yu was indeed a perfect character. After proving that her family was an established part of upper-class, it was clear that she did not have to resort to dirty tricks along the way of her ascension.</p><br/><p>Zhao Youyue’s fans increased exponentially. It was most probably due to the fact that Ah Yu had been proven to be authentic and that it was safe to believe in her. She would not be poisoned by some random plebians, and she had no ugly truths to hide. Such dark revelations would only shatter a fan’s heart</p><br/><p>Zhao Youyue was a celebrity with none of the stigma. She was envied by those who had been painted a bad picture by the media.</p><br/><p>In a few days time, Zhao Youyue would spend her first day in her final year as a high school student. She looked into the mirror with her short trimmed hair, and gently smiled at what she saw.</p><br/><p>She had shed her ravishing figure and stepped over the fallen wraps, returning to her ordinary self. Most of all she had regained her freedom.</p><br/><p>It all started when Su Li’s illustration exposed her identity. Her first sighting had featured her long, flowing hair. Her impression as a long, silky haired lady had brand itself into people’s hearts.</p><br/><p>Nobody knew of her past as a short-haired pedestrian, or even suspected it.</p><br/>\n</div>"}