{"title": "Chapter 396", "id": 396, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-396", "volume_title": "Volume 4", "body": "<h1>Chapter 396</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>New World of Web Novel</strong></p><br/><p>To Zhao Youyue, the worlds of works that she could enter through the “Two Dimensional Gate” were a lot more interesting, compared to the real world. Those worlds always allowed her to experience different, unearthly landscapes. For example, during the last time when she transmigrated as “Altair,” she had experienced several different worlds. Unfortunately, the “Altair card” was currently still in a fragmented state. She did not know when she would be able to obtain such a profoundly mysterious character card.</p><br/><p>On other days, the unpredictable randomness of the “Two Dimensional Gate” really rendered Zhao Youyue speechless. It was like a trap.</p><br/><p>Time passed quickly, and night fell. Zhao Youyue took a shower. She did not let her mind wander off to the possibilities of her new world. Every time she developed a desire or preference of her own, the randomness of the “Two Dimensional Gate” would mess with her, and shatter all her dreams</p><br/><p>For example, she had wanted an “empress card” since a lifetime ago. Now that she had somewhat established a small publishing company, and was also the director of the company, strong leadership skills would really come in handy, leading to an accelerated expansion of the company. When this happens, more outstanding creators could be recruited, and she would then be able to enter any kind of world as she wished.</p><br/><p>Other than the empress card, there was also the “godly chef card” that she had wanted for quite a long time. She truly wanted to create “light-emitting cuisines” in the real world. However, there was not even a single, popular cooking-related work on the market right now. If there was no way to get a “sleeping victory,” there was no meaning in transmigrating into a piece of work.</p><br/><p>Additionally, there were also other types of cards like the “carefree card,” which allowed the user to relax and enjoy life. However, all of these were actually a matter of fate. Zhao Youyue did not dare dream of obtaining them. She could not.</p><br/><p>Of course, what Zhao Youyue wanted most was a character card that possessed a higher energy level. She was curious to know if she could use superpowers in reality. If she could, then, of course, she hoped to amass even more power.</p><br/><p>At that moment, Zhao Youyue finally closed her eyes. She skillfully ventured to the “Two Dimensional Gate” with her soul. She looked at the four active character cards in the “Two Dimensional Gate” —- —- Xu Jing, Yu Shengfan, Chu Luoxun, and Wen Qingyu. They bestowed upon her a sense of accomplishment…</p><br/><p>Although these characters were essentially her other selves, she still loved them deeply and regarded them as her own wives, because they would never be separated from her.</p><br/><p>Spiritually, they were one.</p><br/><p>Zhao Youyue walked past them and finally entered the “Two Dimensional Gate.” She had waited for a very long time to do this. Then, she saw a random world appear, and the name of the work was “Dog Days[1]”…</p><br/><p>Just by looking at the name, Zhao Youyue knew that it certainly could not be popular, or she would have already seen it, considering her current reading volume. After all, in the general introduction of the work, the words “web novel” were stated.</p><br/><p>Web novels were Zhao Youyue’s main battlefield. As “Tycoon Youyue,” she was still active in the Qidian novel website, as she frequently tipped her favorite works. At the same time, she had also gotten to know many other well-known web novelists.</p><br/><p>Web novelists were a lot more approachable than traditional writers. Basically, all that had to be done was just to become a Sect Master, look for the author and add them as a friend. Strike up a conversation after that, and you might have already become good friends with the author.</p><br/><p>As Zhao Youyue was a notable tycoon on Qidian and was also a very attractive young lady, such an identity allowed her to get in touch with any male author easily. It was profitable for the authors, anyway. She was basically the perfect reader in the eyes of all creators…</p><br/><p>If Zhao Youyue also started a book on Qidian, maybe those great authors would, out of friendship, reward her and become Sect Masters to show her some support. She could even casually reward herself with a variety of recommendation ticket red packets and monthly ticket red packets to boost the ranking of her book significantly. This was the advantage of being a tycoon creator. As lowly as it seemed, it was a method that fell in line with the rules. Since its dawn, the novel rankings on Qidian were determined not by the readers, but by capital.</p><br/><p>So far, Zhao Youyue had only transmigrated into one web novel, called “The Strongest King.” It was a niche e-Sports novel, but Rosemary and herself had walked hand-in-hand and tore the fabric of its world to bits. Thus, the iconic character “Yu Shengfan” was created. That was understandably, a rare occurrence.</p><br/><p>This time, however, the moment Zhao Youyue saw the name “Dog Days,” she could not help but compare it to “The Strongest King.” It paled in comparison to it, and was dwarfed in all aspects.</p><br/><p>Then, she looked at the creator’s pseudonym. It was called “Stop Gambling.” Did this author have a gambling addiction?</p><br/><p>Zhao Youyue did not have a good feeling about this. If the creator was addicted to gambling, then it would really be a big problem, especially if it was mahjong. Mahjong was the mortal enemy of creators!</p><br/><p>Innumerable creators have said that they were merely seeking a form of inspiration, but ended up falling into the abyss of gambling…</p><br/><p>Zhao Youyue briefly read through the introduction of “Dog Days.” As expected, it really had the undertones of a web novel. It was a relaxing, warm slice of life novel. The style was similar to a novel in another world called “Back in Time When I was a Cat.”</p><br/><p>“Dog Days” contained superpowers, but it was not the kind of destructive superpower. It was probably on the same level as Wen Qingyu’s ability to “eat books.”</p><br/><p>The male protagonist Shu Qing was a cat lover, and he was terrified of dogs. However, he had unexpectedly obtained the ability to swap bodies with a dog. At first, he could not understand why he became a dog. Then, of course, there was a variety of funny scenes which developed the story. After all, when he swapped bodies with a dog, his own body became occupied by the dog’s soul. Thus, when a dog was in the body of a human being, all sorts of mayhem and mischief would occur…</p><br/><p>When he was in possession of the dog’s body, however, he became a dog with a particularly high IQ, in the eyes of ordinary people. Then, he discovered that the dog who swapped bodies with him turned out to be the dog of a company’s female director.</p><br/><p>Needless to say, this brought out the distinct feature of web novels. The setting of a female director like her was almost a standard configuration as a romantic interest in web novels. It was just like the overbearing director who often appeared in web novels which were more catered towards girls. Here, however, it seemed that both male and female readers would find this director’s identity to be attractive.</p><br/><p>Zhao Youyue surfed through the pages at speed. From there, she learned that the story was about an ordinary man who had been able to reach the peak of his life through a variety of weird accomplishments after he obtained the ability to swap bodies with dogs.</p><br/><p>Due to the vulgar settings of the female director, Zhao Youyue did not really have a good first impression of the web novel. She had the feeling that it might be one of those wretched web novels. For example, the male protagonist would use the body of a dog to take advantage of girls and things like that. Male readers would surely take joy in that.</p><br/><p>However, Zhao Youyue was not quick to conclude matters. Instead, she left the gate for now. She was prepared to read through this web novel, first.</p><br/><p>She found the novel on Qidian rather swiftly, and realized that it only had a few hundred thousand words. It was not even on sale, yet. However, the number of recommendation tickets had already reached 100,000. This showed that it was fairly popular, and many fans were gathered here. Why had this novel escaped her notice, prior to this?</p><br/><p>She looked at the latest activity, which turned out to be fifteen days ago!</p><br/><p>Was this novel already abandoned?</p><br/><p>Then, she looked at the update log of this novel, only to discover that the fastest “Stop Gambling” had ever updated his web novel was one chapter every three days…</p><br/><p>It was no wonder that she had not heard of this web novel before. Judging by how slow the updates were, how could it possibly shine? The editors would never recommend such a novel. The most important thing about web novels were the update frequencies!</p><br/><p>Moreover, he was a novice author. This was his only novel ever!</p><br/><p>Whenever a new author casually updates his new web novel at leisure, it meant certain death for him!</p><br/><p>Translation Note:</p><br/><p>[1] This is not the same Dog Days as the Anime about Antromorphized dogs and cats fighting in Dynasty Warrior-esque battle royales (I wasn’t a fan of it, by the way). Just giving readers a heads-up.</p><br/>\n</div>"}