{"title": "Chapter 390", "id": 390, "volume": 4, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-390", "volume_title": "Volume 4", "body": "<h1>Chapter 390</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Writing a Love Letter in Person</strong></p><br/><p>How would Han Leng react if Zhao Youyue actually fell in love with another guy?</p><br/><p>Inaction. He would not stop her, nor would he give her his blessings, even in silence. He would probably just leave in disappointment.</p><br/><p>If Zhao Youyue really had another man in her heart, she would not be the Zhao Youyue that he knew. She would just be another ordinary person carrying her name.</p><br/><p>Zhao Youyue would never fall in love with anyone, period. This gave Han Leng a great deal of security. It was his favorite part of her, even if it meant that she would never fall for him.</p><br/><p>Why had Han Leng been able to discern such traits? He strongly felt that despite Lady Zhao’s approachable surface, she was a highly arrogant being. No one could touch her heart, and she felt no empathy for others.</p><br/><p>This meant that Lady Zhao would be capable of great things. She would not be held back by moral safeguards. As for what great things she would actually achieve, Han Leng had no idea.</p><br/><p>To Han Leng, love could not be compared to literature and writing. It only threatened to distract him from his career.</p><br/><p>If he had a lover, he would have to communicate with her every day. He would have to go on dates with her, occasionally, just to maintain their affection levels. He would always have to come up with new methods of surprising her.</p><br/><p>Besides, almost any festival could be turned into Valentine’s Day. If a guy did not produce any presents for his woman, he no longer loved. This was most troublesome!</p><br/><p>The more one thinks about it, the more he feared love, and the more he loathed tradition.</p><br/><p>Ordinary people could withstand all these for the sake of falling in love and prolonging the bloodline. But Han Leng was unable to do this, as he had never considered getting married and having children. His works were his children. He could always have asexual reproduction.</p><br/><p>Han Leng was not an ordinary person, not in the slightest. Something was horribly wrong with him.</p><br/><p>The person he loved could serve as his mental sustenance, and it was definitely Zhao Youyue. But of course, the premise was that Zhao Youyue would not fall in love with anyone, including him.</p><br/><p>This was exactly what Han Leng was certain of, and it was exactly how he enjoyed this secure, safe affair.</p><br/><p>Nobody in their right mind would see that this man was right in the head. He loved her. Why not pursue her? Why be a coward? Wouldn’t he want to be together with his love?</p><br/><p>Han Leng could not answer those questions. But when he gave himself a once-over, it all became clear. He was destined to become a great man. Therefore, he did not need to be in love, like the way ordinary people did.</p><br/><p>This was his definition of love. He had his unique criteria of being in love.</p><br/><p>“My love letters are priceless,” Han Leng replied. “I won’t be lacking fledgling cash at the moment.”</p><br/><p>Zhao Youyue frowned slightly. She could sense that Han Leng had started to stand up against her. A super great sale of his book “Beautiful April” could at least bring him few millions from royalty alone, in addition to the high demand of the book’s publishing rights</p><br/><p>The current Han Leng was no longer the writer that she could offer pocket change to. After all, he was a famous idol in his own right.</p><br/><p>Zhao Youyue could not help remembering how good Su Li was to her. Su Li was no small-time creator either. But as long as she asked, Su Li would definitely help her, no matter what, even to the extent that of becoming “Su, the Great Deity” and the “Pan of This Generation.”</p><br/><p>Han Leng noticed Zhao Youyue frowning. His heart gave out again. He quickly added, “My Lady, if you need my help on writing a love letter, I will definitely help, in any way you want it.”</p><br/><p>“Good. Write a love letter to her. I expect the highest quality. Do not write it perfunctorily,” ordered Zhao Youyue.</p><br/><p>Zhao Youyue had always thought that the number of love letters received was the criterion to measure a student’s charm, especially in this era where love letters had almost disappeared.</p><br/><p>Bai Yunshan had purposely left Zhao Youyue and Han Leng some private space for them to reminisce. She had taken the initiative to walk a distance, and waited for Zhao Youyue.</p><br/><p>She was completely unaware of the words that had just been exchanged. Zhao Youyue had always been full of wicked ideas. She had ordered Han Leng to write a love letter to Bai Yunshan. She wanted to see Bai Yunshan’s response when she received a love letter</p><br/><p>Indeed, Bai Yunshan had never received any love letters before. Everyone had been trying their best to avoid her. No male would fall in love with her.</p><br/><p>Things were very different now.</p><br/><p>Han Leng looked towards Bai Yunshan, and was slightly shocked. When did another beauty appear in their school? Although she was also wearing a school uniform while sporting a simple ponytail hairstyle, but her beautiful face and cold temperament produced a unique, ethereal form of beauty.</p><br/><p>“Uh Who is she? Is she the kind of beautiful transfer student that always appears in novels? Why does it seem like you two are close?” asked Han Leng in surprise.</p><br/><p>Zhao Youyue was obviously very satisfied with her own ‘work.’ She said, “What do you mean a transfer student? She is my Master Class Rep. Of course, we’ll be in good terms. Without me, you wouldn’t see that upgraded version of hers. Oh yeah, the same goes to you. Many girls chase after your tail now, am I right?”</p><br/><p>Han Leng understood immediately. Lady Zhao preferred to raise dogs, no, to raise humans. She seemed to be immensely enjoying the pleasure of controlling the lives of others…</p><br/><p>Han Leng could not deny her words.</p><br/><p>“I can’t. The highest quality of love letters could only be achieved when writing to the person that you truly love. Or else, you would just be playing around words,” Han Leng admitted.</p><br/><p>Zhao Youyue had truly raised another icy beauty. But in his eyes, Bai Yunshan would never be comparable to Zhao Youyue, even if it was the short-haired Zhao Youyue in front of him now.</p><br/><p>“How is that possible? You have been writing love letters to me on other people’s behalf in the past, haven’t you? Those love letters were truly well written. Far better than what others wrote. I didn’t throw them away. I’ve been keeping them. That’s the quality I want. I won’t recognize anything else.” Zhao Youyue thought that Han Leng was just lazy.</p><br/><p>Han Leng froze. His ears turned a deep shade of red. He remembered something. If he was not mistaken, when he and Zhao Youyue were once deskmates, she had kept the small notes that he wrote to her</p><br/><p>Yet, her notes to him had vanished to god knows where.</p><br/><p>At that very moment, he was truly ashamed. From the beginning to the end, his so-called ‘love’ towards Zhao Youyue, had just been his self-satisfaction, self-imagination.</p><br/><p>“If that’s the case, I’ll continue to write for you. I’ll give them to you as presents. As for how you deal with them, that’s totally on you!” Han Leng ran away after he finished talking. He had to nurse his wounds.</p><br/><p>Zhao Youyue finally realized something. Did the Great Scholar Han like her?</p><br/><p>Zhao Youyue remained unabashed. Of course he did. That’s completely normal. Everyone should like her. Shameless Lady.</p><br/><p>But if that was the case, it would really be somehow inappropriate to give Bai Yunshan letters that Han Leng wrote to her. Perhaps she could write it in person? She could use this as an opportunity to take the “Wen Qingyu card” for a spin.</p><br/><p>But Wen Qingyu had never written a love letter before. Why not ask Han Leng to teach her some love letter writing methods. She could also taste Han Leng’s texts at the same time. If they happen to be delicious, she could ask him to keep writing ‘delicious food’…</p><br/><p>Han Leng, you have no clue, do you?</p><br/><p>You’re just a cook for hire.</p><br/>\n</div>"}