{"title": "Chapter 409", "id": 409, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-409", "volume_title": "Volume 5", "body": "<h1>Chapter 409</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> No Shortcomings From this Lady</strong></p><br/><p>When Sun Xian noticed how skillful Lady Zhao was with words, he realized something. She had to be type who often hosted parties and outings, and had friends from all across the globe.</p><br/><p>Since that was the case, Sun Xian decided to release his tether. He submitted himself to her will. Her wish, his hands. It would also save from all the tip-toeing he positioned himself for, to give Zhao Youyue a good impression.</p><br/><p>He was certain of something. As long as he listened to her, showed her respect, he would remain in her good graces.</p><br/><p>From the bottom of his heart, Sun Xian was not a fan of domineering, manipulative women. He preferred traditional, submissive girls. The world today might cry foul over such ideals, but this was how he thought, regardless.</p><br/><p>Zhao Youyue did not come across him as such a person. She was rich, classy, and beautiful. She could do whatever she wanted. Such an attitude was befitting of her. If it had been someone else, Sun Xian might not have been so compliant.</p><br/><p>In fact, the easiest way to Lady Zhao’s good graces was to listen to her, especially when she spoke about ‘food.’</p><br/><p>Sun Xian considered himself to be pretty knowledgeable about food. After all, he had money and time. Whenever he was not bent over the mahjong table, he would go on food hunting trips. Even so, his taste was of a lower standard. On the other hand, Zhao Youyue tried everything edible. She was certain that she had tasted everything the world had to offer. The only cuisine out of her reach would be of the light-emitting variety that only existed within fiction.</p><br/><p>In actuality, Zhao Youyue could not be any more wrong. Whenever she brought Su Li out to eat, she would make careful, selective choices. It would only seem perfunctory for her to pick a high-class restaurant. Only her selections seemed to have any meaning.</p><br/><p>If Zhao Youyue ever wanted to write about something, she could always write about her delectably-laden journey. The problem was that Ladies like herself would never gain the motivation to write, unless her family experienced dramatical changes. As for now, her family was still rich, and far outpaced her ability to enjoy life to its fullest. How would she possibly pick a pen up…?</p><br/><p>Those who sat upon the throne only had others work on their behalf. Zhao Youyue was on her way there, climbing up step-by-step towards the peak.</p><br/><p>Zhao Youyue was bringing Sun Xian to a place that served Eastern cuisine. A typical family would have to spend around 1,000 RMB there, drinks excluded. The food was nothing special. Yet, the guests were aware of the price, and for that, they would sensationalize and sing false praises, even if the food did not deserve it. They would even recommend the venue to their friends. Those friends might entertain the idea once, or twice, out of respect. If they had been fooled into believing that the food was truly delicious, they might even end up as regulars.</p><br/><p>The quality aside, the restaurant itself had been well-embellished. It portrayed the classical East rather accurately. As Zhao Youyue had offered to treat him to the meal, Sun Xian took it as a sign of great respect.</p><br/><p>If Sun Xian had not seen any evidence that Lady Zhao was an actual tycoon, he would not let her foot the bill, no matter what. If she had not been so assertive, he might have attempted to negotiate for the bill. To him, the occasional few thousand RMB for two was within acceptable margins…</p><br/><p>But he had been left without a choice. Lady Zhao had expressed in advance that, whenever she invited a writer out, she would cover all the food and entertainment expenses. It was her duty to do so, as she was the supplicant, and they were the masters. If they did not allow her to do as she wished, it was as good as not saving her any face.</p><br/><p>Zhao Youyue had also determinedly stated that Su Li, Leng Zi, Rosemary, and Shi Jingnian could vouch for her words…</p><br/><p>Sun Xian may be relatively new to the scene, but he had certainly heard of these writers, especially the mangaka, Su Li. Her drawing pen supposedly possessed immense power. She was capable of literally drawing misfortune to others.</p><br/><p>Zhao Youyue and Sun Xian chatted as they walked. Of course, Zhao Youyue had retold the story of her revolutionary friendship with Su Li. She had even claimed to be able to have Su Li illustrate his work at the drop of a needle.</p><br/><p>These claims greatly intimidated Sun Xian. Had he stepped into a new world?</p><br/><p>At the end of the day, Sun Xian had fallen into Zhao Youyue’s palm. Since the other writers had received such support from Lady Zhao, with abundant rewards to boot, he chose to accept such treatment as well.</p><br/><p>Little did Sun Xian know that Zhao Youyue was not actually treating him seriously. She had simply chosen an Eastern restaurant at random, only taking into account its relatively high price tag.</p><br/><p>As they ate, Zhao Youyue once again expressed her good impression of Sun Xian’s “Dog Days.” She hoped that Sun Xian would keep his updates up. It would be even better.</p><br/><p>Lady Zhao’s warm hospitality left Sun Xian rather abashed. He had only gotten into this novel-writing business to kill some time. But now, Lady Zhao had laid her corrosive hands on him. After treating him to such expensive Eastern cuisine, how could he still remain as casual as before?</p><br/><p>Zhao Youyue had just committed bribery. Compared to holding a blade at the writer’s throat, it was a far more effective method. Did you expect the creator to take the blade in his own hand, and slit his own throat?</p><br/><p>No one knew how did such a corrupt practice become so popular. To those shameless, experienced, immoral writers, blades were godsent…</p><br/><p>Sun Xian quickly noticed Lady Zhao’s elegant eating behavior. If you could call that eating, in the first place. She was only there to taste a little of this and a little of that. Very little actually made it to her stomach. Even if she found it to be delicious, she would only taste a little of it. Not once did she gobble anything down with relish.</p><br/><p>Truthfully, Zhao Youyue did not like the food very much. She considered the taste to be borderline acceptable. She had already set her sights on the “light-emitting cuisine” that was only available within the literary world. Her taste had transcended the realm of human reason.</p><br/><p>On the other hand, Sun Xian enjoyed the food greatly. He had not tasted Eastern cuisine before. Naturally, he stayed away from the raw dishes. The ones that he ate were delicious. The foie gras[1], fried prawns, crab pot were all exquisite as well. He considered the money well spent, and if he was offered the chance, he would definitely foot the bill without any reservations.</p><br/><p>This was enough.</p><br/><p>Both of them enjoyed themselves very much.</p><br/><p>When the conversation peaked at a fever high, Sun Xian excited blurted out, “My Lady, do you know how to play mahjong? We are always short of one player…”</p><br/><p>Sun Xian had ingested some plum wine. The buzz had broken through his nerves. He started sharing his love of the game, expressing his passion of it to the fullest.</p><br/><p>The smile remained on Zhao Youyue’s face, but in her heart, she was cursing the man. She finally understood why Uncle Sun Xian was so atrocious at updating. He was a slave to this silly board game!</p><br/><p>Zhao Youyue knew nothing about gambling. One day, when she comes across a gambling story, she might just become the Gambler God, one day. By then, she would turn into a tigress, and wipe the board clean until Sun Xian begins doubting the meaning of his own life. Let’s see if he would still keep at his mahjong or update his novel…</p><br/><p>Zhao Youyue courteously declined the invitation, but she bragged about how she once went to the casino in Las Vegas, and had reeled in gold throughout the entire day with her great fortune. Sun Xian was stunned, he really believed that Zhao Youyue was as good as she said.</p><br/><p>Zhao Youyue had always been inexplicably self-confident. She could not find a flaw in her own personality, as if she was walking on the path to nirvana.</p><br/><p>Translation Note:</p><br/><p>[1] Foie gras – The liver of a specially fattened goose or duck prepared as food. Short for pâté de foie gras.</p><br/>\n</div>"}