{"title": "Chapter 407", "id": 407, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-407", "volume_title": "Volume 5", "body": "<h1>Chapter 407</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Walking Onto The Right Path</strong></p><br/><p>Due to the respect Zhao Youyue bestowed upon him, Sun Xian maintained his daily update for a period of time. The “inspiration” that he never paid any heed to – finally found its use. He realized how easy it was to write while intoxicated. Words flew by without him realizing it. Of course, for the sake of efficiency, he split the content and stretched them across more chapters. That was his secret in maintaining such a high volume…</p><br/><p>Zhao Youyue remained in contact with Sun Xian. In her free time, she periodically chatted with him about “Hua Xiaomao,” who had officially appeared within the chapters. In passing, she had described Mao Mao’s transformation as cute, and how her cuteness was simply irresistible. These subtle words had imperceptibly affected Sun Xian, and drove the poor man to add more scenes to “Hua Xiaomao subconsciously.”</p><br/><p>Sun Xian soon detected the anomaly. Whenever he wrote lines related to “Hua Xiaomao,” his writing became as smooth as butter, as if a ghost had possessed him…</p><br/><p>Sun Xian could turn off his creative desire and urges at will like an electronic switch. If writers like him acted more responsibly and treated their work with a passion, they would be reintroduced to a certain human emotion – remorse. Regret for not having tried harder in the past. If not, why would he wear his thumbs out writing about “Hua Xiaomao.” This girl had started off as yet another passerby character.</p><br/><p>However, Sun Xian was not such a writer. There was also no reason to ask this much from a hobby writer who was only in it as a means of burning time. His intoxication did not serve as a catalyst – it only served as a convenience, a shortcut. Nothing about his writing changed, save for the speed it took him to complete his chapters. He no longer had to worry about his writing stealing time away from his mahjong games…</p><br/><p>Whenever he ran into writer’s block, he would start writing about “Hua Xiaomao.” The readers seemed to prefer watching this cat-transforming cutie playing about. She even dropped off some tips to the male protagonist on how to be a better dog.</p><br/><p>Hu Xiaomao definitely struck a chord in the readers’ hearts, even moreso than the protagonist. Her appearances had been lengthier and more complete, ever since Master “Stop Gambling” started this daily update streak. She seemed to spring to life within their pages. She had a soul!</p><br/><p>Under such circumstances, the relaxing, heart-warming slice-of-life title – “Dog Days”– rose to prominence. Official recommendations and reviews started pointing directions to it. More readers joined in the viewership. Book lists featured it like the next hot topic.</p><br/><p>Youyue’s book list which topped the rankings had included this work as well. She had been quoted as saying so ——</p><br/><p>“A good, niche title that explores the ‘cute pet transfiguration trope.’ The whole book exudes a casual, light tone, and is extremely light on the heart. It is almost therapeutic, and grants us a peace of mind. It wouldn’t be a stretch to say that reading this alleviates many of the worries that plague the daily lives of readers. Keep an eye out for “Hua Xiaomao,” a lovely girl who is able to take the form of a black cat. She’s amazingly cute, and simply unforgettable…”</p><br/><p>Such was the results of Zhao Youyue’s lengthy, careful arrangement. She had single-handed bolstered “Hua Xiaomiao’s” popularity. It was not like the character did not deserve her praise, biasness aside. After all, “Hua Xiaomao” was a character with a maxed out acting cute ability!</p><br/><p>Even so, she did not have what it took to join the ranks of legends and icons. She lacked the substance. Her cuteness sometimes came across as being false. It was akin to those feel-good anime that only focused on acting cute without any actual purpose. Still, the simple, warm fuzziness appealed to many. It was easy on the heart, easy on the eyes, and brought a smile to your face. Wouldn’t that suffice?</p><br/><p>An iconic character would be considerably weighty and profound. Entire research journals could be written about them alone. They were often accurate portrayals that embodied the complexity of humanity. Having some sort of dark and tragic past came as standard. Throw in a death flag for more impact. Bring in a terrific editor for convoluted, mind-blowing levels of descriptions…</p><br/><p>But let’s take a look at Su Li’s “Pure Romance.” On a whole, it was mediocre at best, but among the pile of unpolished gems, the iconic “Xu Jing” arose. Iconic as she was, she was an off-the-wall, depraved icon. Only “Pure Romance” could exercise such discrepancies between levels and still manage to produce an icon.</p><br/><p>“Yu Shengfan” and “Chu Luoxun” represented the other end of the spectrum. They complemented the writing of their respective stories. Their backstories contained wholesome, quintessential tales of their own.</p><br/><p>On the other hand, the scholar “Wen Qingyu” relied on other excellent characters to serve as her foils. She had appeared within a “POV style,” nonlinear narrative novel[1]. Such novels were not meant to hone in on any one protagonist. Every character was equally important, and shared the spotlight. Even so, Wen Qingyu had won the position, step-by-step with her charm. The public soon unanimously crowned her as “Dream Eater’s” unofficial lead. And so, she earned her icon status.</p><br/><p>She claimed her crown over the piles of bones that had been left behind by all the other characters. Zhao Youyue had earned a ‘sleeping victory’ at that time, thanks to Shi Jingnian’s perfect, genius-level writing.</p><br/><p>Han Leng was a genius writer in his own right. His gifts did not end there, his cross-dressing self was way prettier, compared to actual girls. Relatively, he was still immature. He had room for more growth. Perhaps someday, Zhao Youyue could earn another ‘sleeping victory’ via his work.</p><br/><p>Genius writer created unforgettable, iconic characters by the droves.</p><br/><p>Zhao Youyue’s recommendation left a shockwave in its wake. “Dog Days” became terrifying popular within the shortest period of time. It made its way into several more lists and favorites. Reviews, scoring and votes followed suit. Judging by the rate, it would reach 5,000 points in no time. Niche stories did not usually earn such recognition.</p><br/><p>Zhao Youyue had originally intended to vote for and recommend this work. When she noticed such enthusiastic support coming from other readers, she realized that she did not need to artificially mark up its popularity, its popularity was already “there.” It gave her much relief. The day of reaping was just around the corner.</p><br/><p>Compared to Icons, High popularity character cards were relatively easy to create, provided that the creator had some skill. It all went down to the creative juice and personal style. Obviously, “Dog Days” whetted the appetite of a good few number. It almost served like its otherworld counterpart, “Strange Life as a Cat.”</p><br/><p>The end of October heralded the beginning of a month-long holiday, Zhao Youyue took the initiative to meet up with the Sun Xian, who happened to be in Jiangnan Provincial City. She was very willing to make friends with this writer who had so courteously fulfilled her wishes.</p><br/><p>“Dog Days” was Sun Xian’s maiden written novel. Even so, Sun Xian had the potential of attaining Godhood through this one book. He certainly had the potential. Zhao Youyue considered it worthwhile to be friends with capable writers. Her little publishing company had room for many more talents…</p><br/><p>Translation Note:</p><br/><p>[1] Nonlinear narrative novel – It refers to novels that are told from the vantage points of multiple protagonists of equal importance.</p><br/>\n</div>"}