{"title": "Chapter 414", "id": 414, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-414", "volume_title": "Volume 5", "body": "<h1>Chapter 414</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 412: Moe Point</strong></p><br/><p>After Zhao Youyue satisfied the teenage girl in Wang Hua, she resolutely turned the “Hua Xiaomao” card off, which had turned out to be basically useless, as it could only awaken the cat-moe in her. Even so, the card’s influence on the little black cat remained, which made it appear really cute and intelligent. Due to this, it was particularly intimate with Zhao Youyue and Wang Hua. And thus, it quickly established itself as a new member of the family.</p><br/><p>Uncapping the wisdom of the little black cat had brought out great benefits; it was now far easier to care for. All of the cuteness and none of the drawbacks.</p><br/><p>Even if “Hua Xiaomao’s” character card expires, the little black cat would only get cleverer and smarter at acting cute. The cat’s wisdom had been uncapped; the possibilities are endless…</p><br/><p>Of course, Wang Hua had recorded ‘that’ entire incident on camera. Zhao Youyue watched the video of herself in the kitty maid costume, and realized that she was indeed very skilled at acting cute. She was convinced that this was probably the little black cat’s specialty.</p><br/><p>Fortunately, this video would remain in Wang Hua’s private possession. If this were to spread out in public, her majestic disposition would surely be washed out. In the recording, Wang Hua was constantly tutting in wonder [1]. She kept sighing, as her own daughter was just too good at acting cute. She had hidden her talents well.</p><br/><p>Zhao Youyue could only roll her eyes. She had told Wang Hua, everything was good as long as she was happy. She would never do so much as to lower herself to the same level as her mother, who was just like a manga character.</p><br/><p>Wang Hua, who had a great time playing around on that day, had forcibly slept with her daughter Zhao Youyue that night. Her attribute of controlling her daughter around had been fully revealed, even moreso after Zhao Youyue started becoming an all-around achiever.</p><br/><p>Zhao Youyue’s father, Zhao Jiayi, was left all alone by himself. He could not do anything about that. Wang Hua was the best at doing everything in the family. Moreover, he doted on her with all his life. Of course, his daughter Zhao Youyue was also a pearl in his open palm[2]. Since the two of them were spending such quality time, it was better for an outsider like him to go and play “Stellaris”[3]. “Stellaris” was really fun, at least, it was a lot more fun than playing with his wife!</p><br/><p>Zhao Jiayi felt that if he just played “Stellaris” for a bit, he could already become a god. Although he was actually not able to gain victory, the point of playing strategic games such as this was the fast-paced progression up the technology tree[4]…</p><br/><p>Furthermore, to men, conquering the whole galaxy was the purest form of romance. Women? Just push them aside, no one could stop him from indulging in “Stellaris”!</p><br/><p>Gaming addiction was easy to curb. One could use third-party mods or open the game console, and the game would be rendered meaningless…</p><br/><p>Time moved forward unknowingly. Zhao Youyue’s first semester of her third year of high school had ended rather placidly. She had completely restored her status as a side character. Not only did the internet fall silent, her presence in school had also absolutely dissipated, other than the brief mentions when examination results were announced.</p><br/><p>On the other hand, Bai Yunshan, a good friend of Zhao Youyue, was shoved to the front of the stage by the scheming Lady Zhao. In terms of appearance and temperament, Bai Yunshan had transformed radically. Before this, others had often ridiculed her, saying that she was a capricious tomboy who loved to tattle-tale. However, in one semester, she had managed to become the school’s iceberg goddess!</p><br/><p>It could not be helped. After she grew her hair out and received Zhao Youyue’s expert guidance on how to dress up, it was only natural for an average girl like Bai Yunshan to transform into a goddess. We simply have to believe in Zhao Youyue’s ability of nurturing others…</p><br/><p>Look at Han Leng, who started of as an above-average young man, with a lot of acne on his face. He used to have severe cases of dark circles, and he always looked tired. Now, however, he has become a teenage idol writer who was a clueless chick-magnet. With a snap of his fingers, he could easily get a fan to hook up with him. If not for the efforts of Lady Zhao, how could he attain idol level?</p><br/><p>Unfortunately, Han Leng was still as awkward as before, and he still treated others coldly, especially towards the male fans who knew his “Leng Zi” side. Those fans were the scariest, as they zealously lusted after his beauty…”Do you remember the promise?”[5]</p><br/><p>However, Han Leng gradually corrected his awkward personality in front of Zhao Youyue. Also, as a result of him always wanting to write things for Zhao Youyue to eat, his new book remained untouched. This often left him anxious. No matter how he wrote, he could not surpass “Beautiful April,” his previous book.</p><br/><p>For Han Leng, writing for Zhao Youyue was a way to sharpen his skills and calm himself down.</p><br/><p>However, Han Leng’s popularity on the internet had not yet faded. Although he had not yet come up with anything new, he had already successfully built up a public persona as a known intellectual. He had his hands full, spreading all kinds of hate all around Weibo. Whenever he had nothing better to do, he criticized whatever that moved, in whichever direction. He now carried the image of a rebellious teenager. However, his handsome looks prevented many from hating him. Even if one slandered him, his group of brainwashed fans would always rise up to defend him —- —-</p><br/><p>Our Mr. Han is already working so hard. And You guys have the audacity to put him down? Where is your conscience?</p><br/><p>You have facts, but no conscience!</p><br/><p>In actuality, Han Leng did not care about any of this. All he wanted was to write something that transcended his former self. If he were to write for Zhao Youyue and have her evaluate his works, there would be much progress for him. Sometimes, he could even play a prank on her and write something that would amount to a dark cuisine for Zhao Youyue. He found this to be fun.</p><br/><p>Han Leng had already lost hope in Lady Zhao, who was always talking about writing her own book. She was clearly more willing to be a reader. She had no desire to write at all. She always said that she would start writing after she reads “this” book. However, one book after another, she still had not shown any signs of starting.</p><br/><p>What else could Han Leng do? Of course, he could only forgive Lady Zhao. As a reader, Zhao Youyue was almost perfect. Her insight and critiques were top-notch. With her taste test sessions, his writing skills had improved substantially.</p><br/><p>Han Leng had put his “love letter writing” business on hold. Although many people were requesting for him to write love letters, they were all for Bai Yunshan. In that case, what was there to write?</p><br/><p>In Han Leng’s eyes, no matter how Zhao Youyue’s appearance changed, her talents remained absolute. However, as everyone spoke about the school flowers, fewer mentioned Zhao Youyue’s name. Han Leng was most unhappy about this. He felt that everyone in this world were fools. They were blind and could not see the ultimate girl.</p><br/><p>Zhao Youyue, on the other hand, was happy and at peace. She was glad that she had rediscovered her role as a mysterious observer. She was someone who could observe Bai Yunshan to see how her personality changed, and how she handled all the love letters.</p><br/><p>There were absolutely no changes to Bai Yunshan’s personality. She was persistently sticking to her own rules and principles. As a result, some boys found that this ignorance she had towards the feelings of others was somewhat her moe point[6]. The goddess Bai Yunshan was just so cute!</p><br/><p>Bai Yunshan handled the love letters a lot more cruelly, compared to Zhao Youyue. She would report them to the teachers without a second thought. To those who wrote her love letters, the greatest form of misfortune awaited them!</p><br/><p>Even so, it did not matter. No one would blame her, because this was yet another moe point!</p><br/><p>Zhao Youyue realized —- —- A girl was not cute, only because she had moe points. Instead, only a cute girl had moe points! The fact that a girl could be forgiven an indefinite number of times, was solid proof of her attractiveness!</p><br/><p>Translation note :</p><br/><p>[1] To “click one’s tongue in wonder” () means to be so astonished by something to the point where one cannot help but praise its wonders.</p><br/><p>[2] “A pearl in one’s palm” () is a Chinese proverb specifically used to describe one’s beloved daughter.</p><br/><p>[3] “Stellaris” is a 4X grand strategy video game developed and published by Paradox Interactive. Stellaris’s gameplay revolves around space exploration, managing an empire, diplomacy, and space warfare with other spacefaring civilizations.</p><br/><p>[4] “Technology tree” () – In strategy computer games, a technology, tech, or research tree is a hierarchical visual representation of the possible sequences of upgrades a player can take (most often through the act of research). The diagram is tree-shaped in the sense that it branches between each ‘level’, allowing the player to choose one sequence or another. Each level is called a tier and is often used to describe the technological strength of a player. Typically, at the beginning of a session of a strategy game, a player will start at tier 1, and will only have a few options for technologies to research. Each technology that a player researches will open up one or more new options, but may or may not, depending on the computer game, close off the paths to other options. The tech tree is the representation of all possible paths of research a player can take, up to the culmination of said sequence. A player who is engaged in research activities is said to be “teching up,” “going up the tech tree,” or “moving up the tech tree.” Analysis of a tech tree can lead players to memorize and use specific build orders.</p><br/><p>[5] These are translated lyrics from a song called “Thêm Một Lần Đau” by the Vietnamese boy band HKT. With their debut Weibo post, they had attracted a staggering number of followers on Weibo, but their popularity had little to do with their music. Many netizens commented negatively about their appearances. The Weibo account had posted a number of music videos which then quickly became viral hits in spite of, or really because of, how awful they sound. “Thêm Một Lần Đau” was one of the songs that went viral, as it was a little catchy. Although the song was sung in Vietnamese, it somewhat sounded like Chinese, thus many Chinese netizens compiled the lyrics in Chinese. However, the lyrics were made up with random Chinese words that sounded similar to what the singer was singing, so it did not really make any sense at all. It was compiled just so that the Chinese people could sing the song (almost properly) without even knowing how to pronounce Vietnamese. Here, as the author inserted the Chinese version of the lyrics (made up of random words), it makes no sense if it is translated into English, so the lyrics are translated from Vietnamese to English here. The author probably randomly inserted the lyrics to the song here because he found the song catchy as well, and since it was something which was, or maybe, is still trending in China, the Chinese readers would definitely get his humor.</p><br/><p>[6] “Moe point” () here actually means “cute point.” It is usually used to refer to the things cute anime characters do that are attractive. Bai Yunshan’s ignorance towards the affection of others towards her is a “cute point” of hers that others find to be attractive.</p><br/>\n</div>"}