{"title": "Chapter 419", "id": 419, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-419", "volume_title": "Volume 5", "body": "<h1>Chapter 419</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 417: A Familiar Face</strong></p><br/><p>The moment Zhao Youyue saw the attire of the conscientious man, Zhao Song, she felt relieved. She was afraid that she had travelled into an ancient or medieval world. That would be a waste for her, since she had no survival abilities. For the “Two Dimensional Gate” to open a portal of a parallel world, Altair’s card needed donkey’s years to regenerate its energy.</p><br/><p>This was a rare opportunity to access an actual reality that inspired the authors of iconic novels. Zhao Youyue could not tell when this blue moon would shine again. Either way, Altair card’s energy would have to be refilled before pulling the trigger of “Two Dimensional Gate” card!</p><br/><p>At least she was not in a medieval world, and that was good.</p><br/><p>One must never underestimate the complexity of a medieval novel. It was often customized to favor the protagonist in every way, including the language spoken. The best way to travel in was to either begin one’s journey as a child, or modify a soul in a customized body. Traveling with one’s body from reality would be a nightmare.</p><br/><p>Zhao Youyue had undergone an almost complete body transmission to this world. Her body had been fabricated by the “Two Dimensional Gate;” an orphan in this world without any relatives or friends.</p><br/><p>As a modern world, things should be slightly simpler. This man would hopefully carry her back to civilization. Otherwise, she would have to play survival games.</p><br/><p>Zhao Youyue was not afraid of the wild. It would be fun to be Bear Grylls [1] once in a while.</p><br/><p>Even though this was a world with a degree of realism, she was brave enough to risk her body in certain ways. The worst outcome would be death in this world and retirement to reality.</p><br/><p>After all, the reality she came from had the power to reconstruct and redefine almost everything. Ghost? Spirits? These were all interpreted as magnetic fields…</p><br/><p>This world was extremely focused on materialism. Science had an answer for anything. The inadequacy of technology was no excuse.</p><br/><p>Spiritual novels were written, based on made-up fictions. Authors were inspired by the supernatural phenomena which took place in this world.</p><br/><p>Other than authors, people who experienced nightmares might have appeared as random characters in this world. They would be terrified to the point of soiling their pants, dead in this world and awake in reality. This was why the stories they wrote on the internet would seem real.</p><br/><p>They would have thought that this was just an elaborate nightmare. The truth might be more disturbing – everything he experienced had actually taken place, and that he has already died in another spiritual world.</p><br/><p>In dreams, we cannot always control our actions. We would be driven by our subconsciousness, and that was why we tend to play with fire in dreams. Such people would be classified as trouble seekers for natives, such as Zhao Song.</p><br/><p>They provided writing materials for authors from both worlds, including Zhao Youyue and Zhao Song. It was only appropriate for authors to respect these trouble seekers, while expressing nothing but gratitude towards their deeds.</p><br/><p>Death in dreams was insignificant, why be afraid of dying indefinitely?</p><br/><p>Zhao Youyue was very much like the natives, in more ways than one. She had her hands on the wheel, and did not need to depend on her subconscious to move around. She could think like a native, looked like a native, act like a native…</p><br/><p>Her first priority was seemingly, to stay alive. Then, she could unravel the mystery of this world. There had to be a guru somewhere where she could learn of some abilities to use in the real world.</p><br/><p>Of course, it was just her hypothesis. Nevertheless, being able to live as a different person in another world was exciting and mind-blowing. In this world, she was free to cause any trouble she wanted!</p><br/><p>Nobody cared if it was a realistic world. She treated it as just another novella world. This time, she did not have to be mindful about causing trouble to a certain author. This world had created itself. The only worry she had was that her antics would be sent out as inspiration to dozens of authors…</p><br/><p>There was a possibility that the moment she gets sent back to reality, she would be mentioned in a few spiritual novel or supernatural movies. She might even become a protagonist!</p><br/><p>Zhao Song carried the “unconscious” Zhao Youyue back to the camp. It was in the middle of the Feng Men village. The urban legend on the internet description was…</p><br/><p>Feng Men village languished among the dark woods. Hundreds of Qing dynasty houses stretched deep into the ancient forest. In the middle of the village stood a luxurious courthouse. That was the resting place of a mysterious armchair. Rumors claimed that eerie events happened to those people who sat on it.</p><br/><p>Other than Zhao Song and a few wimpy girls, most of the group members were keen to try the comforts of the Qing dynasty armchair…</p><br/><p>Unfortunately, sneaking into this luxurious courthouse was no easy task. Of course, Zhao Song tried his best to persuade everyone not to do so. There must be some reason that such stories were found online, right?</p><br/><p>Reasoning with these donkeys was impossible. They were heavily drugged by their own enthusiasm, lost the very last threads of sanity. While claiming to be atheists, these donkeys insisted that their asses had to make contact with the armchair.</p><br/><p>In fact, from a different perspective, these donkeys might not be natives of this world. At that moment, they might be having nightmares in their world, which explained the way they behaved…</p><br/><p>Zhao Song finally reached the camp. He was terrified by what he overheard…</p><br/><p>“It was just an armchair; I didn’t feel anything special about it. This is pointless!”</p><br/><p>“Tonight we shall perform the spirit summoning ritual. I’ve always wanted to validate the spooky events written on internet…”</p><br/><p>“Actually, there was a far more horrifying legend about this village. Do you guys know about the story of the ancient village zombie?”</p><br/><p>“Whoa, is it related to the death in the village today?”</p><br/><p>“Let’s not talk about this now. There’s no fun talking about this in daylight. I rather save it for tonight, around the campfire!”</p><br/><p>“I concur, I believe in no ghosts!”</p><br/><p>….</p><br/><p>In Zhao Song’s heart, the flag had certainly been placed. Has this crazy inspector, Ou Yang, lost his mind?</p><br/><p>Surprise, surprise. Zhao Youyue knew all too well, that one of these donkeys was someone she knew in reality!</p><br/><p>He was the famous author that wrote “Winter’s Journey”!</p><br/><p>He seemed far more ignorant in this world…</p><br/><p>Translation Note:[1] Bear Grylls is a British adventurer, writer and television presenter. He is widely known for his television series Man vs. Wild (2006–2011), originally titled Born Survivor: Bear Grylls for the United Kingdom release.</p><br/>\n</div>"}