{"title": "Chapter 425", "id": 425, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-425", "volume_title": "Volume 5", "body": "<h1>Chapter 425</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Getting in touch with the Female Ghost</strong></p><br/><p>The spiritual games had begun. Several people had gathered in the courtyard where that throne lay. Everyone had pricked their fingers, and let a drop of blood drop in the water, and took their sips in turns. In excitement and suspense, they joined hands, stirred up the ignited corpse oil incense, and started the “spiritualism.”</p><br/><p>They were actually doing a fine job of being all spiritual. They lit up a bonfire in the middle of the courtyard. They had even prepared a roasted rabbit. The rabbit had been roasted to a rich, golden brown. Grease was dripping off it. The smell was mouthwatering</p><br/><p>As Wang Yan, Liu Kang, and the others participated in their little game, two out of the three outsiders remained watching coldly from the sidelines. The detective Ou Yang stood with the group, but he did not actually take part in the spiritualism game. He had exclaimed that he was afraid of pain, fooling everyone into believing him. He even offered to be in charge of roasting the rabbit, to everyone’s delight.</p><br/><p>Liu Kang did not miss out on the opportunity of mocking Ou Yang once again. He considered him to be as much of a coward as Zhao Song, while proclaiming that ghosts did not exist in this world. The problem was that so many believed in them, that their beliefs had given them the power to manifest themselves in reality. If people stopped believing in them, they would cease to exist!</p><br/><p>Ou Yang expressed his agreement unreservedly. However, he remained non-commital, as if he wanted to observe this group of people like test subjects, to see if he could figure something out</p><br/><p>Thes people were doing this in good fun, and did not take it seriously. Perhaps Liu Kang was right. Since they did not believe, they did not feel any fear.</p><br/><p>After all, ignorance is bliss.</p><br/><p>At that time, Zhao Youyue had chosen to jump into the cat’s body, as her human body could not see ghosts. That would have been extremely dull. At most, she would only see this group going crazy as invisible objects started harrassing them.</p><br/><p>Zhao Youyue’s human body did have one advantage over others. After all, as a passerby, nothing would get past her sight. Could any pesky ghost possibly affect her with their weak mind games?</p><br/><p>She would be more than they could handle!</p><br/><p>Perhaps, when the “Two Dimensional Gate” and the “Altair” card created this body for her, they had endowed powerful, hidden attributes in it. At the same time, she also had access to the abilities of all her character cards</p><br/><p>To be honest, Zhao Youyue liked this body quite much. She was obsessed with that indescribable sense of bottomless power. This world did not seem to limit her powers in an attempt to match it to its level of realism. Such worlds would be her ultimate playground!</p><br/><p>By now, through the black cat’s body, Zhao Youyue saw that some ectoplasmic entity had started blanketing the bodies of those who played the game. Even Ou Yang was not completely unscathed, despite standing by the sidelines</p><br/><p>Zhao Song had also found himself a side character position. He took his phone out and started recording. He had armed himself to the teeth for this. Also, he had his ancestral black cat sitting beside him. He no longer felt any fear! He even hoped to see something that could stimulate his imagination!</p><br/><p>Just as the group of people started telling ghost stories, indulging in the adrenal rush, a singing voice broke through their murmurs. And there it was, seated on the throne, was a woman in a blue robe. Her face had been completely concealed by that long black hair</p><br/><p>Zhao Youyue almost did a jig. She finally got to see the legendary scary ghost!</p><br/><p>It did not frighten her one bit. On the contrary, she felt a sense of familiarity. She could not help herself from directing the black cat’s body towards the throne.</p><br/><p>Black cats were often said to ward off evil spirits, but the scary ghost seemed unafraid of this one. She allowed it to approach her without fuss. Finally, Zhao Youyue ended up in the arms of the ghost. Out of her great curiosity, Zhao Youyue used the cat’s claws to brush aside her long black hair, only to find an extremely beautiful face inside!</p><br/><p>How was this face horrifying? How was it going to scare anybody?!</p><br/><p>Zhao Youyue had run out of the energy to criticize the situation any further. The scary ghost did not mind the black cat’s naughty behavior as well. She only smiled at the black cat affectionately. She even seemed to welcome its company. On the other side of things, the people who had been so enthusiastic and excited one moment ago had turned as pale as statues!</p><br/><p>Liu Kang just happened to look towards the direction of the throne, only to be greeted by a most horrifying face, to an extent he almost peed!</p><br/><p>He blurted out that something extremely dirty had actually answered their calling! It was there, seated on the throne!</p><br/><p>As his words lingered in the air, everyone abruptly fell silent. Some of them claimed that they were not cowards. They still wore smiles on their faces. But within such a gloomy ancient mansion, and with the internet awash with rumors about it, they could not shake off the unease.</p><br/><p>This was the dragon lover effect. Such people would claim that they loved dragons, and would protect them at all costs. The moment they came across the real thing, they would be terrified to the extent that they would behave contrary to what they’ve always maintained. This group was the same. It would still be fine if there were really no ghosts. Let’s see them remain calm and collected as a ghost knocks on their door!</p><br/><p>When everyone finally found the nerves to turn to the chair, they only saw the black cat on the throne. Wang Yan was furious. She admonished the fatty Liu Kang, “What eyes do you have?! That’s just the coward’s black cat! He even said that it could ward off evil spirits. Where’s the ghost?”</p><br/><p>Liu Kang felt wronged. He spoke truthfully, “Ward off evil spirits, my ass. I think that the black cat is getting friendly with that horrifying female ghost. They must be working hand in glove. I think it’s better if we kill the black cat!”</p><br/><p>At this moment, Zhao Youyue only realized that the female ghost was truly capable. She had deliberately permitted a momentary glimpse of herself, and now, she was completely invisible again. She was still caressing the black cat’s body. She had even raised an index finger, making a “Shhhh” gesture. Clearly, she was playing these people like fools</p><br/><p>Even so, this female ghost was really beautiful. Zhao Youyue simply had to ask for her name. All that came out was a soft “meow.”</p><br/><p>“My name is Chu Renmei” Chu Renmei replied, flashing a dazzling smile. This was just from the black cat’s perspective. Others would only see Chu Renmei’s horribly disfigured face, torn up moments before death.</p><br/><p>Thanks to Chu Renmei’s adept hiding, she had manipulated the group into mutual distrust. Some of them believed Liu Kang, while others were not buying it.</p><br/><p>Zhao Youyue understood it by now. When scary ghosts wanted to kill people, they could not do it in one fell swoop. They intended to play with their food first, and extract the biggest fear within their hearts. Then, they would slowly torture them to death, for the greatest possible yield!</p><br/><p>At then, Liu Kang headed to the toilet – alone. Zhao Youyue then saw Chu Renmei place her hands on Liu Kang’s shoulders, stuck close to his back, and followed him to the toilet. He was really “fortunate in love affairs”…</p><br/><p>Liu Kang did not know why, but he was sure that he felt his gut sinking as a chill ran down his entire body!</p><br/>\n</div>"}