{"title": "Chapter 421", "id": 421, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-421", "volume_title": "Volume 5", "body": "<h1>Chapter 421</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 419: Awakening</strong></p><br/><p>Zhao Song traced her way back to the source of the voice, and saw the side profile figure of a noblewoman. Ever since she joined the group, her expression had been icy cold. It would not be a stretch to think that someone in the group actually owed her money. She had claimed to be a reporter from this village. Her sole purpose of being here was to debunk the urban myths of the internet. Her name was – Li Lina.</p><br/><p>Of course, you can’t expect a mythbuster to believe in any myths on her own. In fact, she was just as much of a skeptic as Zhao Song.</p><br/><p>She was the only person that Zhao Song trusted in this donkey gang. She maintained a low profile and separated herself from those trouble-seeking young girls.</p><br/><p>Zhao Song was in complete agreement with her words. It had been too suspicious to find an unconscious young girl in that area. He should have done anything else, save for saving her. Many other kind souls had died saving others, only to end up being tortured by ghosts. He had saved no humans; he had saved something else entirely!</p><br/><p>In an iconic spirit world, ghosts truly existed. It was the birthplace of all iconic spirit novels; it was the bottomless well of inspirations!</p><br/><p>Everybody stopped dead. Li Lina had practically sent ice flowing through everyone’s veins with her words. Another voice pierced through the air, “What’s wrong with those tombstones by the hill? Were you going to leave her there to die? This poor little girl is so emaciated; she must be starving. Her death would have been certain if you had left her behind, have you no conscience?</p><br/><p>Of course, this voice belonged to a female who had dolled herself up with a thick layer of makeup. At a glance, one would have taken her as some smart aristocrat. Surprisingly, this ‘aristocrat’ did have a kind heart.</p><br/><p>Zhao Song was not exactly comfortable with the latest unfolding of events. That’s right, every single horror story starts off with a Lady Mary character. It was a responsibility of this character, to bring calamity upon all out of her misguided kindness…</p><br/><p>Zhao Song had sufficient experience of being an observer who had watched other groups getting slaughtered, down to the last member. The wisest choice now was to move away from these donkeys. Having Lady Mary around him was a comfort, but the idea of helping anything and anyone at leisure was horrifying!</p><br/><p>Her name was Wang Yan; a rebellious young girl who had run away from home. She did not carry a single penny with her. With a young, healthy body, what else did she need?</p><br/><p>Ironically, the makeup was just a veil that Wang Yan wore to cover her face. Her pure, youthful visage would have sent men down to their knees.</p><br/><p>Wang Yan was annoyed by the presence of this Li Lina. The dignity of a reporter and a hooker took up equal places of her heart.</p><br/><p>Li Lina had no intention of arguing with Wang Yan. She stared at Zhao Song, demanding for an explanation.</p><br/><p>Nothing could hold the truth back forever. Zhao Song said, “Actually, my cat Xiao Hei senses etherial bodies. It would not leave unless I took this girl with me, so I…”</p><br/><p>Everyone burst into laughter, as if he had just told them the funniest joke ever. A heavyset guy laughed at him.” Teacher Zhao, I know that you write horror stories for a living, but I would have never taken you as a superstitious one. A black cat that wards off evil spirits? More like a bad omen for bad things to come!”</p><br/><p>Zhao Song chuckled. There was no need to further explain himself. Deep in his heart, he did not expect Liu Kang, the fatty to last one chapter of this novel!</p><br/><p>Li Lina adjusted her glasses with a scholarly finger and resumed gaming on her phone. The internet was always there to protect her, was it not?</p><br/><p>That’s right. Feng Men village had been described as a village that lay deep in the mountains, a home for the “ancient village zombies.” But it had an excellent network signal!</p><br/><p>Half of the group would not have been here if the internet had not been available. In this modern society, a vacation was nothing more than changing real-life gaming locations.</p><br/><p>There was safety in numbers. This ragtag gang consisted of nine people, which ghost would dare approach such a group?</p><br/><p>Everybody was preoccupied with their own agendas. Wang Yan assembled her besties and started discussing on how to awaken “Zhao Youyue.” On the other hand, Zhao Youyue was still busy concocting an identity for herself. Could she play the amnesiac card?</p><br/><p>Memory loss was a painfully common yet acceptable excuse that interdimensional travelers used. However, this group might not buy such an excuse. Why did she have to appear under such eerie circumstances?</p><br/><p>It was a hill that had literally been covered by tombstones!</p><br/><p>A jaded guy broke the ice and said to Ou Yang, “Oh great inspector, could you please share your speculations with us? In your opinion, where did this girl come from?”</p><br/><p>Ou Yang backhanded the proverbial fly aside, and snapped, “Please don’t mix our work up with the work of private investigators in “Detective Conan!” I have never handled any murder cases before. Most of my cases had involved tailing estranged husbands about and taking photos of cheaters…”</p><br/><p>“That’s so disappointing!”</p><br/><p>“It depends on how you see it. Our police are effective as they are when it comes to apprehending criminals. Private investigators still need to procure bowls of rice for themselves. I, for one, do not want to be anywhere close to a murder scene,” Ou Yang always welcomed critics generously.</p><br/><p>Zhao Youyue could not believe in what she heard. Wasn’t Ou Yang supposed to be a great inspector in this world? His expertise lay in marriage affairs!</p><br/><p>“Detective Conan” sounded awfully similar to the first dimension she had ever traveled to. This story did not exist in her reality! Could this iconic – spiritual – realistic world be parallel to her first reality?</p><br/><p>If only she had a phone in this world. With it, she could figure out the truth on the internet!</p><br/><p>Her alibi was almost complete. Zhao Youyue prepared to return to her body…She had been abducted by an evil human trafficking agency, and they had taken her to the village, and she had attempted to escape from this place…</p><br/><p>In spite of all that preparation, nobody asked her a thing when she woke up. Everyone moved away from her, except for the black cat. Somehow, she was now the owner of the cat.</p><br/><p>Zhao Youyue was puzzled by the scene. Little did she know that her body was giving off the scent of decay and death… That smell when you walk into… the ancient village zombie in the mountains!</p><br/><p>Wait, was she in a tomb?</p><br/><p>A nameless tomb?</p><br/><p>Eternal Flame?</p><br/><p>In this spirit world, could she be the ruthless murderer that disguised itself as a zombie?</p><br/>\n</div>"}