{"title": "Chapter 424", "id": 424, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-424", "volume_title": "Volume 5", "body": "<h1>Chapter 424</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>A Considerable Load of Information</strong></p><br/><p>Being a coward was one thing. But the adventurous, curious genes were present in Zhao Song’s bones. He was the kind of person who would tell everyone left and right that he was downright terrified of horror movies, only to watch them in masochistic excitement</p><br/><p>Therefore, he had came prepared. Other than his “ancestral” black cat, he had also brought along many exorcism-based equipment, including Buddha beads, the cross, an amulet, etc. The Buddha beads had been infused with divinity by an eminent monk. The cross had been inundated with holy water. The amulet, had been procured from a highly respected old Taoist.</p><br/><p>In Zhao Youyue’s world that was without ghosts, these were just items of connivery and fraud. But in this world that was awash with supernatural phenomena, they would be extremely useful.</p><br/><p>Zhao Song quickly rummaged about for the cross, Buddha beads, and the amulet close to his person. He had done his homework. Zhao Youyue looked at him in amazement, and spoke within her heart, “This Zhao Song has reached a certain realm.”</p><br/><p>His preparations had served him well. That night, the other outdoor sports enthusiasts commenced on their official hunt for death. They were not here to sightsee. They were here to satisfy their curiosity.</p><br/><p>They were too stubborn for their own good. After all, everyone in this world had grown up indoctrinated by an education that wrapped itself around the belief of materialism. They lived and breathed the belief of ‘seeing is believing,’ concrete evidence, and scientific studies. However, supernatural phenomena made their appearances then and now. Even so, the world remained skeptical and non-believing. The more they refused to believe, the braver they felt. They wanted nothing more than to debunk those so-called “urban legends” that plagued the internet.</p><br/><p>Of the group, the rebellious but kind girl, Wang Yan wanted to debunk them more than anyone else. She was the youngest among the group, but she had grown up playing games like Bunshinsaba, Plate Deity. In the end, nothing had happened. The supernatural was non-existent!</p><br/><p>This Feng Men Village had been a hot topic on the internet. If one were to play spiritual-heavy games in such a supposedly spiritual location, would something actually happen? If she really encounters something, it would be a most exciting discovery!</p><br/><p>Unfortunately, Wang Yan did not believe in ghosts at all. While the private detective Ou Yang also fervently expressed his disbelief in the supernatural, he was always there to rile up the group and kick up a fuss. He drove the other outdoor sports enthusiasts to seek for more creatives manner of death, as he stood at the sidelines, supporting, cheering them on, as if he was specifically there to liven up the atmosphere, and get everyone killed by their own impulses</p><br/><p>The fatty Liu Kang always took the lead in their death marches. He was highly keen on gettting targeted by otherworldly beings. In modern society, everyone lived good lives. Good food and clothing never seemed to run out. He found his life extremely boring. Under such circumstances, only the most obscure and mysterious supernatural phenomena that were mentioned in whispers could grant him a new lease on life.</p><br/><p>It was no surprise that Liu Kang and Wang Yan got along remarkably well. Playing spiritual games together with the other youngsters only brought more life to the atmosphere. There were five to six people in total. Only Zhao Song, Li Lina and Ou Yang sat out of the games, but they did not stop those youngsters either</p><br/><p>After Li Lina saw Zhao Song returning, she had contacted him in private. As a reporter, she and the writer Zhao Song often shared similar thoughts. Zhao Song found Li Lina to be calm and calculative. She did not seem to be one of those retards who stupidly sought death on their own accords. She also did not possess the fear that women generally had. Therefore, he told her the truth ——</p><br/><p>He had been trapped in this village. He had encountered the notorious ghost wall, and had witnessed a very horrifying female ghost that had been clad in blue. When she appeared, she had sung something to him</p><br/><p>As expected by Zhao Song, Li Lina did not express any hint of disbelief. She seemed to have expected this to happen, and took everything in stride. She even took her notebook out and wrote everything down, as if she was here to draw forth inspiration, just like him.</p><br/><p>“Do you still want to refute the rumors?” asked Zhao Song expressively.</p><br/><p>“That’s for sure. There are no ghosts and supernatural phenomena in this world. It’s all just psychosomatic.” Li Lina smiled mysteriously.</p><br/><p>Then, she asked expressively, sarcastically even, “I suppose that you would definitely pen a new novel that was loosely or completely based on this place as the background, and the female ghost as the origin, right?”</p><br/><p>“Of course. I do this to help readers understand more about the hidden secrets in this world and the dangers, while reminding them to be careful,” Zhao Song replied, looking as sincere as one could ever be.</p><br/><p>“Still, from what I’ve seen, you’ve only encouraged your readers, if anything. And then Well, there’s no ‘then'” Li Lina said sardonically.</p><br/><p>“I’m not to be blamed. I put everything into making sure it all adds up that the realism levels are off the charts. For them, I’ve risked my neck, heading into many dangerous, supernatural sites, and have written the endings of those characters in the most disastrous of retellings, all to discourage everyone from being reckless I suffered this much for their sake. One day, the ghosts might just take me,” Zhao Song was no longer able to keep the fear from his voice.</p><br/><p>“But you didn’t. Instead, you became quite successful by relying on circulating all sorts of supernatural stories and terrifying ghosts novels. Why’s that?” asked Li Lina.</p><br/><p>“I’m just more careful than most. Speaking of which, you seem to have refuted many rumors about supernatural phenomena, and have even conducted a series – “Walking into Science.” You definitely know more stuff. But I don’t see you working a way out of this. Why’s that?” asked Zhao Song in reply.</p><br/><p>“Hehe, I’m not in the mood to play riddles with you. Anyway, as long as we don’t get in each others’ ways, we’ll be fine. I came here to refute the rumors. No matter how strange this Feng Men Village is, it seems completely normal to me. No one can stop those who are adventurous at heart from exploring to this place.”</p><br/><p>“That’s right. Therefore, I will write the upcoming scenes in a more horrifying, frightening way, and let everyone know just how dangerous this place is. I hope that my cute readers will not think that I’m fabricating something”</p><br/><p>“You better keep an eye on Ou Yang. That guy claims himself to be a fan of your work, but he is not as simple as he looks. He seems to be harboring some ulterior motives. We still don’t know which side he belongs to.”</p><br/><p>“Is it possible? No matter how I see it, he’s just another nobody who would quickly get done in by the ‘owner’ of this place. Are you implying that such a detective could come to an actual conclusion?</p><br/><p>Li Lina no longer spoke. She had placed a few cameras around the area. She no longer seemed like a reporter, but more like a secret agent.</p><br/><p>When Zhao Song learned that the group of youngsters had started to seek for death, he remained most calm, as if they no longer concerned him. Perhaps he had faith in his own preparations. Besides, he had the black cat ancestor with him</p><br/><p>Wait wasn’t he overlooking something? When he jerked impulsively, only did he spot the passerby girl staring at him with interest.</p><br/><p>Zhao Youyue had overheardno…she had sat in plain sight and listened openly to the conversation that had been laden with a considerable amount of information. It had taken place between a rumor-refuting reporter and a realistic supernatural genre novelist.</p><br/>\n</div>"}