{"title": "Chapter 436", "id": 436, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-436", "volume_title": "Volume 5", "body": "<h1>Chapter 436</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Ou Yangs Reaction</strong></p><br/><p>Ou Yang was a legend among the traditional writers. His suspense and mystery novels were always chartbusters. They either get adapted into movies or won him a lot of literary awards.</p><br/><p>Therefore, Ou Yang’s popularity was rather close to the top. He converted a considerable number of readers into fans. Most of them were readers who were addicted to thriller and supernatural stories.</p><br/><p>Generally, thriller and supernatural genre were rather similar. Without the presence of suspense, they would just be ordinary narrative text. “Chronicles of the Peculiar Black Cat” was a good example. The main reason for its failure was the lack of suspense. It consists of supernatural and horror stories, but there was no climax at all</p><br/><p>The person who asserted that Ou Yang was the detective in “Chronicles of the Peculiar Black Cat,” was a fan of his novels. As a fan, he paid full attention to Ou Yang related news. The detective struck him as oddly familiar. After careful observation, he concluded that Ou Yang was the detective!</p><br/><p>All in all, this man had been too quick to jump to conclusions. Although the appearance of the detective in the movie was similar to Ou Yang, he was not aware that the both of them were polar opposites, in terms of behavior and actions!</p><br/><p>In reality, the great author Ou Yang was a shy and down-to-earth person – just like an Elder Wizard who was bad with women. He was not even interested in improving himself in that aspect. He was not afraid of spending the rest of his life alone.</p><br/><p>Perhaps authors and creators had very atypical thought patterns. People generally craved to fall in love, eager to find their other halves. Many prioritized on getting children after getting married. This did not apply to Ou Yang.</p><br/><p>Ou Yang had set the expectations for a partner to be awkwardly high. Each time he was denied a date, he would turn irritable and cross. Perhaps, deep down in his heart, there was a strong, inner-voice that was determined to denounce every other living being on the planet.</p><br/><p>Wills and inheritances were also another worry and responsibility for many, but this also did not apply to authors, as their masterpieces were their children. As long as their hard work was preeminent, they would be immortalized.</p><br/><p>Nothing was more fascinating than this.</p><br/><p>The moment Ou Yang learned of his apparent debut in a horror movie, he was understandably curious. He had watched countless horror, thriller and suspense movies. After all, he had not been born a prodigy. His success had been slowly built, brick by brick with his dogged persistence.</p><br/><p>Women threatened to distract a wizard from his art. A distracted wizard was a dead one. By keeping them out of his life, he could devote his full commitment in writing, while strengthening every aspect of his inept genetics.</p><br/><p>To keep improving himself, Ou Yang spent a lot of his time reading and watching movies. At the same time, he embraced the internet with open arms. He was a rare jewel among traditional writers who did not actually despise online articles. On the contrary, he took a few online articles as references and materials for his writings.</p><br/><p>Despite the fact that the rumor was untrue, Ou Yang spent some of his free time to watch “Chronicles of the Peculiar Black Cat.” The fact that “he” appeared in the film sawno end to his curiosity..</p><br/><p>Ou Yang did not think the actor looked excatly like him. The similarities were uncanny, but they ended there. After all, his face was rather generic. It was not disgusting nor appealing, and had all the common features of a passerby.</p><br/><p>However, Ou Yang could not deny what he saw: a private investigator who was good with ladies. His face turned chalk-white!</p><br/><p>Those vague dreams of his suddenly became clear pictures in his head!</p><br/><p>Wasn’t this his dreams? He envied himself in his dreams. In reality, he was nothing close to himself in his dreams.</p><br/><p>His dream-self was undoubtedly good with ladies. With a snap of his fingers, he could woo the attention from any beautiful dame. This was also why Ou Yang had been entertaining the urge of shaping up his protagonist character as a playboy investigator in his novels. Other than solving cases deftly, it wouldn’t hurt to illustrate on how this protagonist had ladies wrapping themselves around his finger. In his descriptions, he often managed to describe every female protagonist with definitive details, bringing them to life.</p><br/><p>Such an in-depth, experienced description came across as his fans that he was an experienced playboy in real life. He must have had countless ladies dancing in the palm of his hand. Otherwise, how could one explain the colorful dialogue? How he described each female character with such immaculate, relatable detail?Even the bedtop frolickings seemed to be recollections, rather than fabrications</p><br/><p>In traditional literature, the pleasure of the flesh was considered a form of art. Readers would never complain about having long, convoluted paragraphs in such vein. It was philosophy, it was the quintessence of life. Of course, the internet prevented such scenes from being fleshed out to such an extent. Writers would have to resort to creative alternatives such as “the bare area below the neck,” or “exercises that involved clapping noises.”</p><br/><p>Other than being exceptional in crafting suspense, Ou Yang was good at writing about exercises that resulted in clapping noises as well. Even so, he was a virgin. An archwizard. He relied on various ingredients and sorcery to attain his sagehood.</p><br/><p>These images appeared in Ou Yang’s mind every time he wrote about the exercises. These scenes only came to him in movies and dreams.</p><br/><p>He had always believed these dreams to be dreams. However after encountering this film, he started to wonder if there was more to it</p><br/><p>Did this all happen in a parallel universe? Ghost actually existed in that world!</p><br/><p>Netizens claimed that the film was the work of CGI. Of course, those were just wild assumptions. The truth that was known only to Zhao Youyue, was that everything was real!</p><br/><p>There were no actors at all. Every character was an actual person. Liu Kang had only been so convincing in his role because he had been truly dead!</p><br/><p>Ou Yang was most certainly an anomaly among anomalies. As everyone remained trapped in confusion, wondering how the film was shot, he managed to come upon the truth!</p><br/><p>Ou Yang did not make his conjecture known to all. He simply posted a declaration on his Weibo that he was not the detective in that film, and that actor simply looked like him. Yet, he praised the film for its level of horro and realism, recommending that everyone should watch it</p><br/><p>Why did Ou Yang do that?</p><br/><p>He was curious to know what came next. Would the subsequent films be a repeat of his dreams. In the past, every recollection of his dreams had been fragmented. They flashed across his mind in pieces as he blindly grabbed at them, struggling to put them on paper. Now all he had to do was to watch the films, and all those memories came right back to him!</p><br/><p>He would observe in silence. It was always best to reap fortune in the cover of darkness!</p><br/>\n</div>"}