{"title": "Chapter 431", "id": 431, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-431", "volume_title": "Volume 5", "body": "<h1>Chapter 431</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Everything Was Done to Gather Materials</strong></p><br/><p>The “Pigeon” sickness was contagious, and Zhao Youyue was the “Pigeon Queen.” This “Pigeoness” had spread to those who remained in close contact with her, and one such person was Han Leng. During the winter holidays, which fell just before the last semester of the third year of school, Han Leng had been highly active on Weibo. Every few days, he would post on Weibo saying that he was about to release a new book, and that it would be a masterpiece!</p><br/><p>Well, even if it isn’t one, it would positively be better than “Beautiful April”!</p><br/><p>Of course, this riled the fans up as they waited with baited breaths. His beautiful fan girls were practically screaming their lungs out. Some of the ladies had even boldly asked “older brother” Han Leng – if he wanted to gain more inspiration by getting to know them better…</p><br/><p>Han Leng could not see the appeal. He did not understand that hooking up with the fans would be the greatest gift he could possibly bestow upon them. His standards broke through the roof. If a girl was not up to his standards, he would not lay his hands on her.</p><br/><p>However, it did not matter, because this was in line with Han Leng’s character as a “clueless chick magnet.” In fact, those beautiful young ladies only teased Han Leng so boldly, because they knew that he had such a personality. If he was like one of those good-for-nothing creators in the community who carried titles such as “sex king” or “hook-up fanatic,” the fangirls might not be as daring.</p><br/><p>This was also why fanboys were typically envious of fangirls. If fangirls idolized one of those sleazebag idols and took the initiative to offer their bodies to them, those idols would, of course, be more than happy to accept it. The fans had willingly offered themselves to him; it would be waste not to accept it…</p><br/><p>Naturally, only female idols would have a majority of fanboys. In this era, did female idols hook up with their fans?</p><br/><p>Would the real idol please stand up. You’ll expand your fanbase in no time at all! It would blow up!</p><br/><p>Unfortunately, fanboys can only continue dreaming of such a scenario…</p><br/><p>Han Leng had made released such bold statements, precisely to force a great deal of pressure upon himself. His instincts and practiced acumen told him that there was no way he would ever produce something as amazing as “Beautiful April,” despite how hard he wrote…</p><br/><p>As much pressure as he attempted to impose upon himself, this would end up for naught. Every few days, Lady Zhao would call him out for a gaming session. How is he expected to write anything? It would be a better idea to follow Lady Zhao and forage for some materials!</p><br/><p>Yes, this was precisely how he gathered materials. Hence, he started replacing those sensational announcements on Weibo with repeated excuses and explanations on how and why the release of his new book might be postponed, for he needed to gather materials!</p><br/><p>As for the matter of gathering materials, it was, of course, by eating, drinking and having fun with Lady Zhao!</p><br/><p>In the process, he also got to know Su Li. Unsurprisingly, the two of them had known each other for a long time. After all, Su Li had did some illustrations for “Beautiful April.” Even so, they remained as strictly one-time business-partners.</p><br/><p>Thanks to Zhao Youyue, they had got to know each other better. Better was a subjective term, as Su Li thought that Han Leng was a pervert. He had once met Su Li while donning his “Leng Zi” identity. In the end, Su Li had the shock of her life when his true gender was revealed.</p><br/><p>“The protagonist of Su Li’s manga, “Himegoto” is also a male crossdresser. Is she seriously thinking that I’m a pervert? I’m just trying to gather some materials (serious face).”</p><br/><p>Su Li thought that Han Leng was a pervert, and Han Leng thought that Su Li was unambitious. Her manga had no content and was too commercialized. In addition to that, she was a little too close to Lady Zhao.</p><br/><p>After learning that Su Li had allowed Zhao Youyue’s publishing company to publish her manga booklet, Han Leng felt that he could not afford to be left behind. He too decided to start a web novel off and gave the copyrights to Lady Zhao. He wanted to help Lady Zhao make money!</p><br/><p>After hearing that Zhao Youyue had also started a book platform on the internet, he decided to share his book on that website.</p><br/><p>Zhao Youyue was surprised, so say the least. Has Han Leng lost his mind? Her website was not for web novels. Besides, it was just a preliminary version of her company’s official website. She had not yet even decided a name for it…</p><br/><p>That was not completely true. She did have a name, but she had not yet officiated it. That name would be – Source World.</p><br/><p>She even felt like serializing a “100% realism” horror series like “Chronicles of the Peculiar Black Cat” on the Source World website. She was only unsure if this would increase the web traffic of the website.</p><br/><p>After Han Leng received an invitation from Lady Zhao to watch a movie at her house, he could not help but complain. Could she refrain from using such a tone when she spoke? It made him imagine all kinds of things. And what sort of movie could this be?</p><br/><p>Naturally, Zhao Youyue remained cryptic, because Han Leng was really afraid of watching horror films. If she revealed it in advance, wouldn’t he run off?</p><br/><p>Of course, Han Leng could not turn down Lady Zhao’s invitation. He was willing to do just about anything Lady Zhao wanted. His compliance was why they were on such good terms.</p><br/><p>On the other hand, Su Li gave a shrill, jubilant “yes.” She did not really take Zhao Youyue’s warning about the “100%” horror level to heart. Nothing scared her.</p><br/><p>Su Li had battle-scars to flaunt, and mysterious powers to boot. Why would she be afraid? If anything, she was the scary one. Her pen could end lives and worlds as people knew it.</p><br/><p>Zhao Youyue did not bring Han Leng and Su Li to her permanent residence. Instead, she brought them to a luxurious villa which had been equipped with a private cinema. It came as no surprise to learn that this was yet another of her family’s properties. Her father often brought the big suits here and saw to it that they were thoroughly entertained.</p><br/><p>Zhao Youyue had learned much from her father. She was also entertaining her batch of big suits. One of them was Su Li, the most popular and talked-about mangaka in the manga and illustration communities. The other was Han Leng, the well-known public intellectual who often started wildfires on Weibo. He also carried other labels such as genius writer, clueless chick magnet, and a highly popular idol who had unintentionally but successfully brainwashed countless female fans.</p><br/><p>There was no doubt that these two would become legends in their respective fields.</p><br/><p>Firstly, Zhao Youyue showed the two of them around the villa. As usual, Su Li started taking some selfies at various strategic points. Of course, she would ask for Zhao Youyue’s permission before she posted the photos.</p><br/><p>Han Leng suddenly felt inexplicably upset. Despite his relative success, he realized that even if he wrote books for his entire lifetime, he might not even be able to earn enough to afford one of Zhao Youyue’s family properties. Whenever he thought of this, he felt depressed…</p><br/><p>If he was still the old him, he might have cynically mocked the Zhao family. With the new him however, countless images of Lady Zhao sincerely supporting him flashed through his mind. Hence, he held it back. No matter what, he could not hate on Lady Zhao, just because she was fortunate enough to be born with a gold spoon in her mouth.</p><br/><p>After that, Han Leng also started taking pictures with his mobile phone. When Su Li saw it, she could not help but say, “Tsk tsk, is an arrogant influential person in the literature field like you preparing to post some pictures on your Weibo or Wechat Moments?”</p><br/><p>Han Leng felt his cheeks turning warm. He coldly said, “Don’t think that everyone is as shallow as you! I was just trying to draw some inspiration. The heroine of my next book is a precious daughter of a rich family!”</p><br/><p>“Disgusting! So you can only vent the darkness in your soul through a book?”</p><br/><p>“I have no time for your nonsense…”</p><br/><p>At such a time, of course, Zhao Youyue had to step in and settle the dispute. She actually did not understand why Su Li and Han Leng could not get along at all. They were both outstanding creators, but it seemed like they had no common ground. This was indeed frustrating.</p><br/><p>“Okay, okay, I’m bringing you guys to the blockbuster now. I assure you, that the visuals effect are absolutely amazing!” said Zhao Youyue.</p><br/><p>When Han Leng heard that it was a blockbuster film with great visual effects, names of countless blockbuster films flashed through his mind. His heart grew excited in anticipation. He became absolutely prepared for an upcoming visual feast. This was yet another source of inspiration…</p><br/><p>Of course, those words had also earned Su Li’s full attention!</p><br/>\n</div>"}