{"title": "Chapter 432", "id": 432, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-432", "volume_title": "Volume 5", "body": "<h1>Chapter 432</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>: Tremble</strong></p><br/><p>Speaking of which, this was actually Han Leng’s first time watching a movie in a private cinema. It was the stuff of legends that were scarcely mentioned, even in fiction. Apart from the fact that the seats were a lot more spacious, the rest was not so different from a public cinema. Of course, you could play movies at your absolute discretion, for you owned this cinema.</p><br/><p>Han Leng adjusted his seat a little, and laid back comfortably. As the movie began to play, the lights in the room went dim. He was now surrounded in total darkness.</p><br/><p>Of course, Su Li did not intend to sit beside the perverted Han Leng. She sat a few rows before Han Leng, closer to the screen. She could easily turn back to check out on Han Leng’s expressions.</p><br/><p>Zhao Youyue went ahead and started the movie. She had been smart enough to cup headphones over her ears before returning to the room. Some scenes in the “Chronicles of the Peculiar Black Cat,” when played in a big screen, while paired with godly musical effects courtesy of Goddess Chu could possibly scare people to death!</p><br/><p>Thus, Zhao Youyue took some precautions. She knew this movie, inside and out. Her focus today was to observe the expressions of Su Li and Han Leng</p><br/><p>After the movie began, Han Leng became slightly unnerved. Was this really the so-called visually stunning blockbuster? The opening scene already panned over spectacular masses of tombstones within the deep mountains. The atmosphere was eerie. Was this for real?</p><br/><p>This bus was not headed to kindergarten. He wanted to get off!</p><br/><p>However, when the “heroine” appeared, he temporarily held his feelings back. This side-character heroine had no sense of presence whatsoever. It gave him a feeling of deja vu. He was already starting to like her.</p><br/><p>Furthermore, frankly speaking, he still could not tell where this was going, not yet. However, the image quality was definitely top-notch, and the props were incredibly realistic. There was no way that this was shot at a real location, right?</p><br/><p>Han Leng continued watching. Somewhere along the way, he had already completely and unintentionally ignored the heroine. All of his focus shifted over to a group of backpackers. The strange “Feng Men village” was so convincingly real, that he felt as if he was there in person.</p><br/><p>But it was the soundtrack that froze his blood solid. It was then when the unoccupied neurons in his head came upon the realization —- —- this was actually a goddamned horror film!</p><br/><p>Having known the truth, he prepared to flee the scene. He was a gutless person, and he knew it. He did not have the stomach for horror. If he really had to sit through one of these films, it had to be during the day, and his entire room had to be illuminated. Now, he was lost in total darkness. That darkness seemed to be of that world he saw in the screen.</p><br/><p>Su Li was the total opposite of Han Leng. She loved watching horror films alone, in the middle of the night. In the beginning, she loved watching the type of horror films that had extremely scary images that subliminally flashed through the screen and stimulated the mind. Then, she moved on to those that discussed about analogous psychological placebos, hallucinated transmigrations, and such. She had so many films under her belt that, she was almost numb. She had seen everything the genre could throw at her.</p><br/><p>Of course, Su Li had started off, spooked like everyone else. However, with experience came impassiveness. She knew that this world harbored no ghosts. Horror stories was just another subsidiary of fiction. There were no Gods, there were no spirits, there were no ghosts. Only creators like her and others could create such things.</p><br/><p>Su Li felt that the “Chronicles of the Peculiar Black Cat” was a little boring. She believed that the most important thing about a horror film were the plot twists and the scenes which kept the audience in suspense. Furthermore, all the characters in it had to be pathetically weak, to the point that they were completely unable to defend themselves from the ghosts. If not, how would it impart that sense of absolute vulnerability and mortal peril that came hand in hand with spiritual encounters?</p><br/><p>Fortunately, the inconspicuous heroine who had first appeared was only a fake heroine. She was just there to set the initial mood. She did not even seem to be involved in the plot at all. She fully embodied the role of an onlooker.</p><br/><p>The imagery and videography were indeed top-notch. How much money had been invested in the special effects?</p><br/><p>The extent of the skilled videography was best demonstrated at one scene in particular. It was a full-length aerial panning of the “Feng Men village.” This horror film suddenly became more like a historical film. The ancient architecture of the village gave off an unusual, otherworldly feeling. The crew had really paid special attention to the filming location…</p><br/><p>The soundtrack was on another level. It was flawless, and Su Li felt that she was in the film, standing among the terrified cast. Suddenly, she was no longer watching a movie. She seemed to have been transported into the world.</p><br/><p>Naturally, even Su Li would be spooked out by that level of realism. She started looking intently for some loopholes that would often appear in some horror films. It was one of the skills she had picked up when it came to turning her fears into butterflies. If she could convince herself with hard evidence that this was all fabricated, she would no longer be afraid of the possiblity of it being real!</p><br/><p>However, Su Li quickly discovered that she could not find any loopholes at all. This movie was becoming less and less like a movie, and more like a real documentary!</p><br/><p>Finally, Su Li started panicking. Fear started to take hold of her heart. She started turning around for Zhao Youyue…</p><br/><p>When she saw Zhao Youyue sitting not too far away from her, Su Li left her seat and went to sit right beside Zhao Youyue.</p><br/><p>Zhao Youyue took her headphones off. She smiled and said, “Sister Li, is there anything wrong?”</p><br/><p>Su Li was a bit embarrassed. Before she came here, she had boasted about her prevailing immunity against horror movies. Now, the ghost had yet to even make its appearance, but she had already caved. This was truly embarrassing!</p><br/><p>However, Su Li had never been afraid of being embarrassed in front of Zhao Youyue, so she truthfully replied, “This film is a little evil-ish, it terrifies people. I’m going to have to hold on to you…”</p><br/><p>Zhao Youyue had always pampered Su Li. Although Su Li was already an adult, the two of them got along inexplicably well. This was because they truly understood and tolerated each other.</p><br/><p>Su Li calmly sat next to Zhao Youyue, clinging onto one of Lady Zhao’s arms. All of her fears vanished into thin air. When the really scary scenes get going, she would just bury her head deep in Zhao Youyue’s chest. It was the ultimate asylum!</p><br/><p>Then, Su Li saw that Zhao Youyue had headphones on. She could not help but ask out of curiosity, “My lady, why are you wearing headphones?”</p><br/><p>“Ah, I’m just listening to some music. This film isn’t that scary if you get rid of the soundtrack.” Zhao Youyue replied.</p><br/><p>Su Li thought that Zhao Youyue was really smart, but she would not learn from her. Zhao Youyue was right beside her, anyway. She was even holding on to Zhao Youyue’s arm. She wanted to experience the horror at its fullness, while being able to retreat to her sanctuary when things got too perilous.</p><br/><p>Of course, none of this had gone past Han Leng’s attention. However, he was a big man. He could not possibly go and huddle up beside Zhao Youyue, right?</p><br/><p>So, he decided to clench his teeth and persevere. He began to mutter words like “harmony,” “prosperity,” “democracy” and the like. All of these were probably chants to ward off the evil spirits…</p><br/><p>When the ghost finally appeared onscreen, her evil aura basically spewed out of the screen. It gave off the same feeling prey often felt as an unseen predator stalks them. It paralyzes people with fear. It was surreal and on an entirely different level!</p><br/><p>Su Li wrapped herself around Zhao Youyue’s arm. Her head lay on Lady Zhao, but her eyes remained glued to the screen. In her heart, she could not help but wonder if ghosts were real. If it was fake, that actor had to be unhinged or something, right?</p><br/>\n</div>"}