{"title": "Chapter 433", "id": 433, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-433", "volume_title": "Volume 5", "body": "<h1>Chapter 433</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Power of Realism</strong></p><br/><p>Han Leng wanted to make a run for it. Or, he could immediately turn into Leng Zi and ask Lady Zhao for help. Looking at how beautiful he was when he cross-dressed, Lady Zhao would definitely save him, right?</p><br/><p>There was no other way. This film was simply too horrifying. It was the kind of horror that threatened to devour the soul!</p><br/><p>This was probably because other horror films had glaring weaknesses. No matter how horrifying they were, they always had blatant plotholes, and the dissonance was enough to reassure people of their illegitimacy. This also included the facial expressions of the actors. In fact, horror or thriller movies were good for actors to polish their acting skills, because the actors were essentially different from the audience. From the very beginning, the actors would know that they were making a movie and that they were in no danger whatsoever. The ghosts were all played by actors. As a result, no matter how convincingly they managed to pull the part off, it was all just an act…</p><br/><p>Only gifted actors who took method-acting[1] to its limits could perform their roles at 90% efficiency. Otherwise, any actor who scored 60% on his or her part was already praiseworthy.</p><br/><p>However, gifted actors were extremely scarce. Moreover, horror movies did not usually sell well. Along with such track records, the budget allocation for them was usually similarly low. Of course, there were a few exceptionally well-made horror films that became cult favorites, but none of them had ever been built solely from special effects.</p><br/><p>It was to be expected… People did not simply step into cinemas and pay to get the scare of their lifetimes.</p><br/><p>In this case, “Chronicles of the Peculiar Black Cat” had found the 100% mark. The “actors” who played the ghost and victims were beyond stellar.</p><br/><p>Those people did not even know that they were on camera. More accurately, “Altair” had shown her hand, at long last. It was precisely because they did not know they were “acting” and that they were on camera was why their acting was completely, absolutely ‘real.’</p><br/><p>This had ended up with something even more thorough than a documentary. Even documentaries had a degree of videography and scripting. Despite what people often said, documentaries were not 100% candid shots…</p><br/><p>Neither was “Chronicles of the Peculiar Black Cat” made fully out of candids. A variety of shooting methods and techniques had been involved in its making and it had been thorough in portraying the perspective of each character. Zhao Youyue’s onlooker ability had done a great job. She could not only observe the situation from her own perspective, but also from the perspective of others.</p><br/><p>By the end of it, Han Leng was that close to dying out of fright. He wanted nothing more than complain on how bad the plot of the movie was, because he could summarize it in one sentence —- —-</p><br/><p>A group of backpackers successfully sought death when they arrived in Feng Men village, a ghost village which was famous on the internet.</p><br/><p>How did such a plot even qualify to be filmed?</p><br/><p>It did not even have a single plot twist or backstory!</p><br/><p>Of course, the godly plot twists were happening behind the scenes. Chiefly, the fact that the supernatural genre novelist Zhao Song and the female journalist Li Lina of “Walking into Science” were not who they seemed to be. Sadly, the film never got to reveal this.</p><br/><p>As mentioned previously, Zhao Youyue had already edited this film. It was probably the workings of the “maxed onlooker” ability. It focused on bringing out those images that could not possibly appear in the real world.</p><br/><p>For example, the close-up shot of the ghost which looked 100% real. Another example was the entire death scene of the fatty Liu Kang. Such scenes never appeared in reality. Even filming it out was difficult…</p><br/><p>The scene of Liu Kang turning himself into a roasted pig, only to be eaten by the other backpackers had been extremely grotesque!</p><br/><p>Previously, if someone were to tell Han Leng that the scenes of such a lousy film could scare him so much that he was just about o call Zhao Youyue his mother, he would have snorted in contempt. Now, he really wanted to scream,”Save me, mother! I’m about to pee in my pants!”</p><br/><p>Han Leng could not deny it. The film’s grotesque scenes and the performance of the “actors” were 100% on point, accompanied by god-like soundtracks, allowed this lousy film to be strangely attractive.</p><br/><p>Even though he had entered the ‘help me mummy’ fear level, he still watched it with relish. He wanted to know what happened next. Maybe it was the charm of the realism.</p><br/><p>After all, most movies were filled with theatricality. As the saying goes, “It is coincidence that makes a story.” However, this film did not give him any indicator of the presence of a director, or a screenwriter, even. Moreover, there were no coincidences and plot twists, which was why it had been so interesting!</p><br/><p>The ending did not feel anything like one. In short, because of the death of Liu Kang, the other backpackers were so frightened that they fled from Feng Men village as soon as they were able…</p><br/><p>The final scene was a close-up of the ghost – Chu Renmei’s bloody, badly mutilated face. Her body was in no better shape. She had died a most gruesome death. The village was already her foothold.</p><br/><p>Chu Renmei suddenly broke into an evil smirk. However, in the eyes of black cat, Chu Renmei still retained her human form, in all its glorious beauty.</p><br/><p>There were also close-ups of the strange group of senior citizens in Feng Men village. They all surveyed the scene with apparent indifference. Nobody knew what they were thinking, why were they even living peacefully in the village, or why they even existed at all.</p><br/><p>Nevertheless, their existence had provided the village with a special, strange atmosphere…</p><br/><p>By the end of it, Su Li had buried her head deep in Zhao Youyue’s generous chest. Suddenly, she was no longer afraid. Instead, she started fantasizing about something else entirely —- —- Lady Zhao smelled so good!</p><br/><p>Perhaps girls who were naturally beautiful had their special scent. Lady Zhao was no exception. Also, Zhao Youyue had perfume on. Perfume was also a kind of fashion statement. Although Lady Zhao had activated her side-character card, she was still up to date on women’s clothing, bags, and perfumes.</p><br/><p>This was probably a good example of someone who knew how aesthetics worked. Their existence allowed everyone to understand one thing. Unless they were ugly beyond cure, as long as one knew how to put makeup on and dress well, they could always hold the ugly back at bay!</p><br/><p>It was a pity that the lack of money often prevented people from dressing up. But who are we kidding, even if they had the money, they just lacked the initiative for it.</p><br/><p>So, whoever who meets Lady Zhao was certainly very lucky. With her guidance, they could easily attain godhood!</p><br/><p>The room finally lit up. Han Leng felt as if he had just been reincarnated. Even so, he was a hundred percent sure that he would be plagued by recurring nightmares for a long time!</p><br/><p>He could not stop himself from thinking about the ghost that looked convincingly real. In such circumstances, he could only “fight poison with poison.” If he thought of Lady Zhao’s lovely cute face as he tried to fall asleep, it should not be a problem at all…</p><br/><p>Speaking of which, he seemed to have forgotten one thing. What happened to the heroine that appeared at the beginning?</p><br/><p>He could not remember at all!</p><br/><p>That invisible heroine had left him speechless!</p><br/><p>The fatty deserved an Oscar. He was beyond excellent!</p><br/><p>Speaking of which, who was the male protagonist, exactly? Was it that cowardly supernatural novelist?</p><br/><p>Wait, why was that detective so similar to a particular writer in the literature community?</p><br/><p>Was this a coincidence? Like teacher Bi Fujian[2], teacher Ooki[3] and such. They were very similar in form and appearance, but not in spirit.</p><br/><p>Translation note :</p><br/><p>[1] Method acting originates from the Stanislavski’s system. Stanislavski’s system is a systematic approach to training actors that the Russian theatre practitioner Konstantin Stanislavski developed in the first half of the 20th century. Stanislavski was the first in the West to propose that actor training should involve something more than merely physical and vocal training. His system cultivates what he calls the “art of experiencing.” It mobilizes the actor’s conscious thought and will to activate other, less-controllable psychological processessuch as emotional experience and subconscious behaviorsympathetically and indirectly. In rehearsal, the actor searches for inner motives to justify action and the definition of what the character seeks to achieve at any given moment (a “task”).</p><br/><p>[2] “Bi Fujian,” also known by his nickname Laobi, literally Old Bi, is a Chinese director, television host, and professor.</p><br/><p>[3] “Ooki” (full: Tony Ooki), is a Japanese, male adult video actor and singer.</p><br/>\n</div>"}