{"title": "Chapter 430", "id": 430, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-430", "volume_title": "Volume 5", "body": "<h1>Chapter 430</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Watching the Movie Together</strong></p><br/><p>Zhao Youyue spent almost one month to finish perfecting the background music for the film that she had named “Chronicles of the Peculiar Black Cat”. The Goddess Chu had been extremely helpful. As a super genius who was proficient in a variety of musical instruments, she could easily apply background music according to the varying scenes and atmospheres. When she was finished, the movie had ended up downright terrifying!</p><br/><p>During that month, Zhao Youyue had been alternating between the two worlds. Within the supernatural source world, she had met up with Zhao Song, the coward novelist who had PY trades with various ghosts. He had given her a new identity in that world. She had supposedly ended up as Zhao Song’s adopted daughter. She did not use the name “Zhao Youyue,” but changed it into a shortened form – “Zhao You”.</p><br/><p>Zhao Song truly did not want to adopt Zhao Youyue, as he considered this girl to be even more abnormal compared ghosts. But he had no choice. He had been able to survive in the supernatural source world all thanks to “Xiao Hei”. He was positively certain that this black cat had psychic powers. It would keep him alive during critical moments</p><br/><p>Zhao Youyue had grown extremely close to the black cat. They were almost inseparable. Zhao Song considered having an adopted girl to help him care for the black cat. From to his years of writing, he determined that this passerby character was full of mystery, and was practically invincible. She might even be more powerful than a protagonist.</p><br/><p>After all, a protagonist would experience setbacks and character development. On the other hand, this invincible side character was already at max level since her first appearance. The protagonist was the player, but this side character was the administrator system.</p><br/><p>And so, Zhao Song found himself a new ancestor.</p><br/><p>His novels sold well. His house was rather extensive and luxurious, and it was located in the most prosperous cities in that world. By the way, Zhao Youyue had learned about the history of that supernatural source world through its internet. Its development process was indeed similar to her initial world. While their histories remained largely similar, the historic figures had been very different. The occult in this world also functioned at another level.</p><br/><p>That’s right. This was a supernatural source world where demons and monsters rampaged about. However, science had buried most of the truth. Denizens of that world were mostly convinced that there were no ghosts at all. They believed in all existing “refutations against ghosts.” It was this ignorance that had opened them to spirits as free food.</p><br/><p>Of course, there were also astute individuals like Zhao Song; much good it did him. Perhaps he had started off writing to uncover the truth of the world. God knows how he ended up this way.</p><br/><p>The more realistic his books were, the less convinced people became of their legitimacy. They only praised his terrific writing and powerful imagery. At the same time, he would inadvertently ‘leak’ some forbidden rituals and techniques to the public. This was all under the guise of him being a very dedicated, impeccably good writer!</p><br/><p>Zhao Youyue also learned that her body in the supernatural source world had an “autopilot mode.” Upon flipping the switch on, her body would act as a real observer and meld into the background, much like how she acted much earlier on in the village.</p><br/><p>After switching on this “autopilot mode,” Zhao Youyue could even watch the live broadcast through the “Two Dimensional Gate” in her mind. Unfortunately, there would be no bullet curtains. Besides, most of her time in the spiritual source world was spent on daily activities.</p><br/><p>With the “autopilot mode” function, Zhao Youyue did not have to worry about this unique body from ever suffering trouble. Her first criteria in this world had been fulfilled, which was to survive.</p><br/><p>Second down the list of priorities was her adventures in this world. This was nowhere as urgent as the first. First, Zhao Youyue had to verify something. If she managed to obtain another character card, would she be able to apply the character card’s ability on this body?</p><br/><p>After all, her body was practically superhuman, as all the abilities of all her character cards were pooled within that one body, without any limitations.</p><br/><p>In the real world, she could never use all the abilities at once. She could only switch from one character card at a time. It came as a slight frustration.</p><br/><p>Reality was dull, and tried its best to hold her back. That was why nothing spectacular happened in it. Throughout the entire world, Zhao Youyue was the only unscientific existence.</p><br/><p>Of course, Zhao Youyue preferred the real world which tended to be more normal. She preferred a leisure, comfortable life, even if her powers were severely restricted.</p><br/><p>The second half semester of Zhao Youyue’s twelfth grade life came. Of the three high school years, the twelfth grade was a particularly fulfilling but fast year.</p><br/><p>Some considered the twelfth grade year to be a passage of hardship. In fact, those mechanical, repetitive days would go flying past in the blink of an eye. The college entrance exams would blindside you from the front, before you even sensed its approach.</p><br/><p>Of course, Zhao Youyue would never suffer from this. She went on with her daily, carefree life. She was content with teasing the iceberg goddess Bai Yunshan at school. Of course, she did not go overboard with it. It would not be good to affect the other girl’s studies.</p><br/><p>After all, not everyone could emulate her abilities. Not everyone could maintain stellar results while lazing about</p><br/><p>The only person who could live like Zhao Youyue was most probably Han Leng.</p><br/><p>Han Leng had such abysmal results that he might as well drop out there and then. But he was already well known on Weibo. He had countless female fans. He could write something casually, fans would still line up to purchase it. Studying meant little to him.</p><br/><p>However, the school did offer him a benefit. He could improve his writing. As long as he continued writing stuffs for Lady Zhao to taste, he could always learn from her verdict. It would be really irresponsible to leave school like that and wander off as a professional writer!</p><br/><p>Han Leng had to admit that he enjoyed the feeling of being invited by Lady Zhao to go out and have fun during the weekends. They had even gone to various cybercafes, voice chatted while playing LoL, ate “chicken dinners” together. The college entrace exams did not concern him anyway</p><br/><p>Han Leng felt that Lady Zhao was probably his best playmate in the entire world. To an extent, he had started to treat Zhao Youyue as a blood brother, rather than a lady!</p><br/><p>Zhao Youyue had more than enough time in her hands, yet she had been trying to escape from live broadcast sessions by using the excuse of being a twelfth grade student. This soon earned her the title – “Number One Pigeon King[1] on Douyu”. Obviously, this had adverse effects on her popularity.</p><br/><p>Such was internet fame. People quickly rose to prominence, but disappeared just as swiftly if they neglected to remain consistent. Of course, that brief moment of fame was enough for them to pull in serious bucks.</p><br/><p>Zhao Youyue’s earning had been substantial, to say the last. Her little publishing company was already on the right track. She had also built a self-contained, self-sustaining production house. It was called —— Source World.</p><br/><p>“Great scholar Han, drop by this weekend. I’ve got us a movie,” Zhao Youyue sent an invitation.</p><br/><p>“Sister Li, I have a horror movie for you, and it’s a really horrifying one!”</p><br/><p>They were both great writers; it was only right to invite them!</p><br/><p>Translation Note:</p><br/><p>[1] Pigeon King – When one is said to be “releasing pigeons,” it means that he has not lived up to his promise.</p><br/>\n</div>"}