{"title": "Chapter 446", "id": 446, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-446", "volume_title": "Volume 5", "body": "<h1>Chapter 446</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Come to an end</strong></p><br/><p>Numbers did not lie. The subscription count of “God Level Leader” by “I Love to Eat Pumpkin Pie” had not yet crumbled due to the death of “An Youyou.” On the contrary, the novel actually gained more readers!</p><br/><p>The reason wasn’t so clear-cut. Some nosy folk had “promoted” this novel elsewhere. Or, in plain terms, they were out to blacken the name of such hollow literature. They went on board book-reading forums for the opposite purpose, to vilify this novel —- —-</p><br/><p>“I was reading this hollow novel. It was okay up till now. The author actually followed the footsteps of those hipster writers and stirred up an unnecessary fuss. He directly killed his female character! He’s simply paving his own way to hell!”</p><br/><p>“Has anyone read the book “God Level Leader”? Miss Ah Youyou is just another archetypical female character in it, and he killed her. How terrible!”</p><br/><p>“Another hollow novel falling to the overrated hipster author trend. That’s depressing. I’m abandoning it!”</p><br/><p>“I just can’t understand the idea behind hollow novels that take a heel turn like that. It was supposed to be a leisurely read. What’s the point of killing a female character who was pretty well-created for once?”</p><br/><p>…</p><br/><p>Undoubtedly, the death of An Youyou had been highly controversial. After An Youyou’s true identity was revealed, everyone started to get attracted to her. However, before she even became popular, she died, just like that. Was it necessary to mess around with the readers like this?</p><br/><p>As people got busy denouncing the novel, they had also pointed out that the inspiration behind An Youyou was the “Douyu Top Girl,””Douyu Pigeon Queen” Ah Yu. Unsurprisingly, it piqued the interests of those who knew Ah Yu.</p><br/><p>This included many of Ah Yu’s fans. They were not able to interact more intimately with Ah Yu in reality. At least, through the novel, they could satisfy the fantasies hidden deep in their hearts.</p><br/><p>Hence, many people fell into the pit, even though they had never heard of “God Level Leader” before. Some of them had never even read web novels before.</p><br/><p>Undoubtedly, fresh, inexperienced readers starting digging a special place in their heart for this hollow novel. Come to think of it, was there anyone who did not start off with hollow literature as their first read, ever?</p><br/><p>The wild fantasies within “God Level Leader” vividly portrayed the twisted values of how “officials could do whatever they wanted.” Everyone knew that reality could not be any further away. However, when it came to reading novels, people would get so hooked into it that they would end up only being able to feel that it was “great, cool, awesome”! Why would they care about anything else?</p><br/><p>Those readers who wanted to see how the author fantasized about Miss Ah Yu in the story were not happy. “An Youyou” was finally starting to take solid form. She was livelier and much more attractive, compared to all the other female characters. Why did she have to die, all of a sudden?</p><br/><p>The death scene had been most satisfying, but that was also why it was so heartbreaking</p><br/><p>“An Youyou’s” death propelled “God Level Leader” to modest fame. It was modest, but it was fame, nevertheless. Still, for the author – “I Love to Eat Pumpkin Pie” Xu Liangming, the increased royalties were very real!</p><br/><p>Of course, Xu Liangming was pleasantly surprised. Thus, he decided to continue writing like this. There was no need to add any more characters like a twin sister to the story. The value of her death had to be respected.</p><br/><p>This incident also gave Xu Liangming great cause for self-reflection. He had always thought that writing while brain dead would be easy money. It was easy to write, and the readers also found it easy to read. The readers of hollow literature were always happy to pull money out of their pockets.</p><br/><p>Now, it became clear that there was no way for him to gain more fans if he stuck to writing leisurely, empty stories. He would not have any loyal fans at all. Moreover, nobody would talk about his work, unlike how things were now…</p><br/><p>Regardless of how benumbed he was, as a creator, there was still an eagerness to be acknowledged that lay in the depths of his heart. There was more to writing than the income.</p><br/><p>Sometimes he was envious of his other author friends who received gifts from fans on their birthdays or during various festivals. It had completely impossible for him to receive such treatment. After all, readers of hollow novels often enjoyed the novel and paid the author just as leisurely, they would never acknowledge the author as a person who gave them joy, or as an actual person. It was most customary for authors to move on to a new book the moment they were done with one. However, hollow authors would never have fans who followed through with their writings they would never pursue the new book.</p><br/><p>Hollow books were too bland, too commercialized. They did not have any distinguishing features of their own. If someone could read your hollow literature, they could naturally read someone else’s as well.</p><br/><p>In “God Level Leader,” the main character not only had mind reading and energy sensing abilities, but was also involved in politics. Too many of the same novels wasn’t healthy or good for the industry!</p><br/><p>Therefore, problems like authors delaying titles or not even finishing them would arise, even after the work in progress has reached millions and millions of words. In another world, the almighty author “Fisherman II”[1] could be considered a representative of this category, but he was a God of Tycoons. A lot of people knew who he was. More often than not, when a book was really popular, its author would be able to earn 100,000 to 200,000 RMB in a month. However, when it came to this author, everyone would say that they had never heard of his book…</p><br/><p>Naturally, “the silent toad catches the fly” described some authors.[2] They did not care about the gold that their pseudonyms attracted. On the other hand, some ambitious authors wanted things like fame and the Godhood of Tycoons. Naturally, they would have to get on the Qidian novel website to “preach sermons.”</p><br/><p>As a result, several “new authors” on the Qidian novel website were actually false identities. The so-called “new authors” were just “new sockpuppets.” For real new authors to shine, they had to be unbelievably talented. Otherwise, they would have to polish their skills for some time before succeeding.</p><br/><p>This new insight had taught Xu Liangming quite a bit. Perhaps it was time for him to attempt something more passionate in his next work. As long as he is not that stressed over his real-life matters, he might just produce something with a heart of its own.</p><br/><p>Although “God Level Leader” did not give Zhao Youyue any character cards, she had not walked away empty-handed. Readers now had a significantly favorable impression of Miss Ah Yu, who had been the real-life counterpart of “An Youyou.” Once again, Ah Yu regained meagre amounts of fame within the web novel community, even though her popularity had almost died off. Many readers began to look for other works which were based on the so-called “Lady Ah Yu is mine” fantasy.</p><br/><p>Of course, Zhao Youyue was too lazy to be bothered about that. It was impossible for the creators to openly write about her, anyway. That would be a direct infringement on her rights. However, if it was written indirectly, she couldn’t do much to stop it</p><br/><p>In actuality, most of the novels that involved famous celebrities were basically written using homophones. Even so, there has never been a single celebrity who protested it. Zhao Youyue would have to follow suit. She could not just pop up with a lawsuit, each time someone wrote something that remotely seemed to refer to her.</p><br/><p>Thus, her random trip to this hollow novel had come to an end.</p><br/><p>Zhao Youyue positively detested the randomness of the “Two Dimensional Gate.” Two times in a row, she had been tossed into terrible works. The first one was a doodly manga from a murderer who was suffering from sophohigh syndrome. She had easily torn the world up, so it was fine. The second one was a hollow political novel, and she had to exit with care. Once again “Two Dimensional Gate” was in cooldown.</p><br/><p>At that point in time, it was already mid-May. There were only around 20 days left before the college entrance examinations. Zhao Youyue decided to temporarily put the “Two Dimensional Gate” aside and focus on the college entrance examinations. The “Two Dimensional Gate” had been most ruthless, and it loved picking on unlucky souls like her. Perhaps, after the college entrance examinations, her luck might just change. Who knows?</p><br/><p>Translation note :</p><br/><p>[1] “Fisherman II” is the screen/online/web name of Lin Han, a web novel author in China who managed to get on China’s “Richest web novel author list.”</p><br/><p>[2] “The silent toad catches the fly” () is a saying made popular by the former Chinese chairman Jiang Zemin. He quoted it to educate the journalist who was asking questions that were “too young, too simple, sometimes naive.” As he wears a big pair of glasses and has funny facial expressions, his fans gave him the nickname “toad.” The saying itself literally means that if someone wants to make big money, he or she shouldn’t speak or ask too much. Here, it refers to how a lot of authors are profiting from writing books as they always remain quiet and do not reveal their next moves.</p><br/>\n</div>"}