{"title": "Chapter 451", "id": 451, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-451", "volume_title": "Volume 5", "body": "<h1>Chapter 451</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Ugly Rhymes With Devilry</strong></p><br/><p>This author also happened to be a juvenile-genre novelist.</p><br/><p>This female writer’s pseudonym was “Zi Mu.” Her first novel had been about an alcoholic, tattooed smoker. This apparent delinquent was actually a nice lady who was willing to sacrifice everything for love. Throughout the entire novel, everything that motivated the character had been the idea of being a loyal lover.</p><br/><p>Love transcended all else.</p><br/><p>When it came to love, it was perfectly fine to be a third-wheel!</p><br/><p>Where did such thoughts come from? The author, of course!</p><br/><p>Now, why did this author get so much attention from the public? When she was promoting her first novel, she had confessed that the story was part of her experiences.</p><br/><p>She proved herself as an extremely capable erotica artist, as she described her sex experiences as a “groupie” with a rock band that she deeply fell in love with.</p><br/><p>Women can be really talented at writing erotic stories, while Zi Mu was one of the leading-edge writers in teen romance novels. It probably had something to do with her past experiences.</p><br/><p>“Groupie” was a slang word commonly used when referring to fans of a particular musician, band, or celebrity who follow the group- or individual- as they toured. Most of them would be more than willing to offer sex services to their idols.</p><br/><p>Sex and drugs have always been deeply rooted in rock music. Zi Mu would have to bring her readers to the scene in person if she wanted to get any more detailed. In her story, however, the female protagonist was mistreated by the male protagonist after she sacrificed much for him.</p><br/><p>A particularly brutal scene depicted the female protagonist getting mercilessly gang-banged by male protagonist and his friends. The description had been so bold and graphic that it would have been censored if it ever got on the Internet. But it was in her book, and that was the reality of human nature and art.</p><br/><p>Stories that depicted cuckolding and sexual intercourse were often the best way to describe human nature.</p><br/><p>Writers who lacked talent often attempted to borrow strength from the shock factor of such stories.</p><br/><p>For readers who cared only about the erotic scenes, real-life tragic experiences of the writer would be the least of their concerns.</p><br/><p>Zi Mu made her reputation by claiming that her debut novel was based on her actual life experiences. She became the hottest topic among the paparazzi.</p><br/><p>Clear sky doesn’t last forever, especially when she was not the most gifted writer out there. She never not put much effort into improving her writing skills. As time passed, nobody gave a damn about her books anymore.</p><br/><p>Her writing had bottlenecked, everything, including her reputation. Her boldness in the first novel had bang-started her career, but she never capitalized on that or tried something new. Her second novel was an ordinary story that progressed from abortion, a vacation out of the country and then getting involved in a car accident. Of course, multiple coitus sessions had peppered the entire plot.</p><br/><p>Sadly, this paled in comparison to her debut, like an echo to a gunshot. It was near time for her fourth novel’s first publication. Fearful of being met with cold response, she had lost nights of sleep over it. She had to find a way to expose herself!</p><br/><p>There was no other way. Due to the poor showing of her last two books, her publisher had started to get very stingy with sponsors. It was nothing personal. Youth novels had great potential. If yours is facing trouble, you cannot blame the genre, and you cannot blame the company for turn their backs on you.</p><br/><p>This was clearly demonstrated by Qidian. Any novel might make it on a list, on any particular day. However, if it hits the bottom, it will never see the light of day again.</p><br/><p>Under such circumstances, most authors would usually spend some cash to artificially mark up the ratings. Unfortunately, one cannot bring life out of a dead fish – unless you were a tycoon, or any tycoon is willing to help you on this matter. Constant cash flow would be needed to promote a book from the first day of publication until the end.</p><br/><p>As these big players did their stuff in the shadows, the oblivious readers would get pulled on to a chessboard they did not even know exist. They would spend their time reading highly recommended and popular novels, only to end up with piles of trash.</p><br/><p>Zi Mu was convinced that she had to take her own promotion in her hands. After careful observation, she noticed the Weibo of a young charming author Han Leng. His topics were always hot topics in forums, and were always related to a female livestreamer “Ah Yu.”</p><br/><p>She did not like what she read. “Perfect student” Ah Yu soon became something that she despised deep down her heart. It probably had something to do with the fact that Zi Mu was a highschool dropout. Yes indeed, she had published three books in total. She had ditched high school the moment her debut novel started selling like hot cakes.</p><br/><p>In this day and age, people quit high school before having a stable income. Everyone did it all the time. Zi Mu had been lost in the nearsighted delusion that her future was only getting brighter and brighter.</p><br/><p>Nevertheless, lady luck was never stingy when comes to promoting a person she wanted. Zi Mu was one of those fortunate authors that lady luck took care of. That’s how talentless and undeserving figures rose up to fame and fortune.</p><br/><p>Zi Mu loathed this young author – Han Leng. He possessed the talent and aura that was beyond Zi Mu’s grasp. Zi Mu was not even close to the level of a respected guru.</p><br/><p>She could only join in on the conversation of others when it concerned world news and social issues. She noticed that female livestreamer Ah Yu had gone into hibernation. She never once said a word, not even in response to rumors of Huang Zongchao nor Han Leng’s love letter.</p><br/><p>This was her chance! First, she criticized Ah Yu in public. Then, she announced her devotion to Han Leng. So, how should she please Han Leng who was popular?</p><br/><p>Of course, she started off by praising the talent of Han Leng in his love letter writing. She would have gladly accepted Han Leng if those letters had been for her!</p><br/><p>“I am a believer of Great Scholar Han!” Zi Mu emphasized in her final comments, wrapping things up with sexy photos of her voluptuous body, cutting it off just before her face.</p><br/><p>Even with thick makeup, her face scored a mere five points out of ten. She would not dare to show her face without makeup!</p><br/><p>Her ugly photo had once took the internet by storm. Haters had dug it out and exposed her. Rockers who had spent time with her on the bed were questioned. How could they even work an erection up, when in close proximity of that face?</p><br/>\n</div>"}