{"title": "Chapter 471", "id": 471, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-471", "volume_title": "Volume 5", "body": "<h1>Chapter 471</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Filled With Inspiration!</strong></p><br/><p>As someone who was alpha testing the game in a spiritual sense, the game producer in Zha Feng still took most of the wheel. He has always put himself in his prospective players’ shoes. All the better for him to surprise them.</p><br/><p>It was already a surprise to have clean equipment dropping from the girl he murdered in return for seriously injuring herself while trying to save him. Any player would have thought that they would undoubtedly get a tremendous amount of experience and legendary equipment from killing a peerless master who was on a similar level as Li Xiye. However, the girl only ended up dropping some clean equipment. It could barely even be called equipment – it was an ornamental sword – used for decorative purposes. Imagine the disappointment. It would leave players with a sour yet refreshing taste in their mouths…</p><br/><p>The decorative sword aside, Zha Feng felt that some incentive should be added to push these players into this dark path. He would whisper dark words into their thoughts, only to leave them in absolute darkness and punish them for obeying.</p><br/><p>Who knows, after killing the girl, the player would be destined to encounter a tough obstacle later. Unless the player was a genuine god who was capable of heaven-defying acts, his savefile would be at a dead end</p><br/><p>So, how would he send players down this path while blaming them for everything? Zha Feng was not too sure, yet. He chose to reload the previously saved file again. This time, he spared the girl. On the contrary, he started tending to her wounds, for she was his savior!</p><br/><p>Of course, players could care less about these ‘saviors.’ Even if they nursed the girl back to health, it would only be to dig up her backstory. Not because they were curators or journalists or any of that sort, they only hoped to gain some secret reward from it.</p><br/><p>Naturally, they were also in it for any potential quests, and the ensuing rewards.</p><br/><p>If not one or the other, it had to have something to do with the girl’s favorability’s level. Who knows, you might get some pleasant, exciting CGI cutscene when her favorability reaches a certain extent. Of course, it would not be child-friendly.</p><br/><p>Just like that, Zha Feng became highly inspired. He gradually discovered the girl’s unique personality, her miserable life, her extremely admirable, beautiful swordsmanship which could be mistaken as a graceful dance, if not for the disembodied pieces of monster body parts that followed.</p><br/><p>The girl’s outfit could also be customized. She could get dolled up in a Han Dynasty costume, only to turn into a graceful, westernized elegant aristocratic princess, deserving of the title “Her Majesty” in the blink of an eye. No one would believe that she was “Cinderella” before this!</p><br/><p>However, at that time, the players would have to make a decision. Accept the quest entrusted to them by Su Hu and become enemies with the nameless girl, or stand with the girl?</p><br/><p>Su Hu’s rewards were outstanding. On the other hand, the nameless girl was pretty poor, because all her money was invested in the nameless city. She used her small, fragile shoulders to build up a Peach Blossom Spring[1] amidst the cruel, troubled world</p><br/><p>In such situations, some players might just change their minds. To them, money and equipment were most important. Who cared about the morality of the situation?</p><br/><p>At that point in time, the nameless girl’s life story would not have been exposed yet. However, the game would throw characteristically malicious misdirections, leading players would think that she had rather grand ambitions. She would soon share her intentions of murdering the emperor of the Kingdom of Zhao, Su Hu. For this reason, she would trigger a decisive battle that involved the lives of every living human being!</p><br/><p>The decisive battle at the peak of the Forbidden City!</p><br/><p>The Forbidden City housed the royal palace. The girl intended to use this decisive battle to attract the attention of the guards and give those who followed her a chance to kill Su Hu. If the player was still on her side by then, the player would definitely participate in this shocking, colossal scheme…</p><br/><p>Indeed, the opponent of the nameless girl was the “Sword God” Li Xiye. Like the old saying —- —-</p><br/><p>On the night of the full moon a duel between the Sword from the West and the Fairy from Wonderland!</p><br/><p>For once, the game would truly treat its players to a visual feast of Wuxia swordplay and moonlit sihouttes, complete with blood splatters that gave way to flower petals. This took nothing away from the fact that peerless masters still could not beat some dogs…</p><br/><p>This battle at Forbidden City would end with the girl’s life. It was not because she could not beat Li Xiye, but because things turned out to be more complicated than expected. After all, when up against young girls, Li Xiye could not bear to bring out his sword and take them seriously. Due to this, his Kendo[2] was rusty. However, the girl would give her own life to help him improve his Kendo!</p><br/><p>Players would have the opportunity to inherit the girl’s clothes. At that point in time, they would be surprised to find that the girl’s Flying Rainbow was no longer some random clean equipment, but a truly godly weapon. It would be the type of weapon that could carry a player to the end of the game. What’s more, it was a weapon that was both aesthetically pleasing and highly practical.</p><br/><p>When Zha Feng regained his senses, he was not even sure how many days had passed. In the eyes of his subordinates, their boss had been possessed. He had been in a state of absolute madness, writing non-stop in his notebook.</p><br/><p>Zha Feng looked down and saw his notebook. His first reaction was to frown ever so slightly, as nothing made sense whatsoever. He quickly learned that whatever he had scribbled down in his notebook were bits and pieces of his experiences as a player in his upcoming, conceptual DLC, he was ecstatic!</p><br/><p>The CG trailer that made this DLC would be —- —- the decisive battle of the Forbidden City!</p><br/><p>At that point in time, Jane Doe would no longer be in gray. She would be Jane Doe the White. She would exude loneliness – the loneliness of being a peerless master.</p><br/><p>Zha Feng was actually still in an “intoxicated” state. After all, the game had not yet been completed. He needed to process the contents of his notebook and throw in a dash of his trademark wickedness before he could finally complete the DLC.</p><br/><p>He did not realize that, subconsciously, the nameless girl – the princess of the Kingdom of Zhao had already usurped the righteous deity, a character that he had previously created —- —- Yan Qingmeng.</p><br/><p>Even so, knowing Old Sly Zha Feng, would he possibly discard a character like Yan Qingmeng and wasted away?</p><br/><p>Initially, he wanted to present a truly righteous deity with no fluff, like the previous DLC that featured the witch. This abrupt, unexplicable appearance of the nameless girl had inspired him to consider a different path. Perhaps he could create a not-so-simple righteous deity. She had this single-minded belief that she was protecting the rights of others and serving justice. Little did she know that her actions only left many more commoners suffering in dire straits.</p><br/><p>For example, Yan Qingmeng felt that having a tyrant as an emperor was better than having no emperor at all. Without an emperor, the entire land would descend into irrepressible chaos. When she realized that someone was about to assassinate the tyrannous emperor, she chose to stop it. Thus, she was destined to stand on the opposite side of the nameless girl…</p><br/><p>How would the players proceed?</p><br/><p>You’ll never know!</p><br/><p>Players might initially be happy to side the righteous deity, as she looked so noble and just. She was a pious, righteous lady, and spoke like the purest of ladies. She had various ways of influencing players to die for her. Even a slight smile would bring joy to the players. However, why was it taking so long to increase her favorability?</p><br/><p>In stark contrast to this, the nameless girl was nave and awkward. She was always all action and little talk…</p><br/><p>That juxtaposition was precisely what that gave this DLC great potential. Initially, she was akin to “Cinderella,” another side-character in the story. However, the players would come to realize that she was actually a noble royal princess. When you give her a nice enough outfit, she would put that righteous deity to shame!</p><br/><p>“Tale of Wuxia 3” already had a “dress-up knights” gimmick. Players could totally treat it as if they were playing “Miracle Nikki”[3]…</p><br/><p>The nameless girl was a genuine knight in a harsh, evil game world, because she was always helping the weak, even at the cost of her own life.</p><br/><p>She did not think she was noble. She could not be the Sun, but at least, she could bring some light into this dark and despondent world.</p><br/><p>______________________________________________________________________</p><br/><p>Translation note :</p><br/><p>[1] A Peach Blossom Spring () is an ethereal utopia where the people lead an ideal existence in harmony with nature, unaware of the outside world for centuries. In simpler terms, the Chinese people use the term to mean a paradise, or a happy place/safe haven.</p><br/><p>[2] “Kendo” () is a traditional Japanese martial art, which descended from swordsmanship and uses bamboo swords and protective armour. Today, it is widely practiced in Japan and many other nations across the world.</p><br/><p>[3] “Miracle Nikki” () is a Chinese mobile phone game developed by Tencent, where players play dress-up.</p><br/>\n</div>"}