{"title": "Chapter 470", "id": 470, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-470", "volume_title": "Volume 5", "body": "<h1>Chapter 470</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Peerless Master Can’t Even Beat Curs</strong></p><br/><p>As previously mentioned, the difficulty of “Tale of Wuxia 3” was rather perverted, especially when a person fought against a group of enemies. Whether this group of enemies was made up of humans or monsters, players that chose to fight on would often end up dying miserably. You could only isolate them and kill them off, one at a time. It was like a quote from “Dark Souls III,” which said, “it’s hard for two fists to beat four hands – even a strong man can’t take on a group, even the Soul of Cinder can’t beat a pack of dogs”…</p><br/><p>Soul of Cinder was the boss in Dark Souls III. Battling a boss solo was far more difficult than fighting a group of enemies. From this, anyone would understand why this game was so enjoyable. Moreover, they would be able to understand more about what a low-skilled world was. If it was a high-skilled world, how could a peerless master possibly be afraid of being attacked by a group of enemies?</p><br/><p>Another example was the game “The Witcher 3: Wild Hunt.” It was not really that difficult. The protagonist inside could fight more than a dozen white wolves at a time. In fact, in the novel, the white wolves were also afraid of pitchforks, because a group of villagers had secretly planned a surprise attack. Ultimately, the white wolf was just a low-level monster, if not, the surprise attack would not have been successful.</p><br/><p>In the low-skilled world of “Tale of Wuxia 3”, no matter how strong the Jane Doe Su was, she was only strong in single battles, or strong in PKs against opponents who were humanoid. Just then, she had been forced to fight a group of undead curs because of a troublesome player. Of course, she would be injured. Even if it was Li Xiye who had rushed to the rescue, he would also be injured!</p><br/><p>Indeed, this was the so-called “can’t even beat a dog” phenomenon. A low-skilled world was just so cruel. Numbers ruled in this game. Even the most unbeatable peerless master could not take on a hundred enemies solo. Unless they secretly planned a surprise attack beforehand, they were definitely going to end up being swarmed to death…</p><br/><p>In fact, this was pretty anti-Wuxia. Many players had thought that they would be peerless.They did not expect the small monsters and small bosses in the game to be able to abuse them to this extent. It gave them doubts about the meaning of their lives. Moreover, if they accidentally provoked a group of enemies, it would really be over for them!</p><br/><p>In such a situation, some players might just drop the game, there and then. It was so complicated that it was unsuitable for players who were not good with controls. All the fun would be killed. However, there was another group of players. These players have been abused many times and could not help but scold vulgarities that involved their mothers and the mothers of their enemies, every single time. They would tell everyone that they would not touch the game ever again, but they would fall to the urge. Thus, they end up relaunching the game, where they would try hard to get through once again, killing the monsters one by one. Then, they would feel genuine joy!</p><br/><p>They would also look for reasons to justify playing the game. Perhaps, it was because of the images and music that had found a place in the souls of the players. Perhaps, it was because the worldview, plot and character settings were really good. At the same time, the game gave off a feeling that as long as you were strong enough, you could do anything. This was especially fascinating!</p><br/><p>For games like this, if you activated a trainer or used any cheats, it would be rendered meaningless. It was the feeling of continually challenging yourself, advancing the plot, exploring the world that had so many people hooked!</p><br/><p>Considering the fact that many players called this game perverse and wicked, it was actually selling pretty well. At least, the company was not losing any money. Of course, in terms of reputation, loyal hardcore fans would scream out, saying it was great. Many of them even used various methods to try pulling more people into the game…</p><br/><p>The upper limit of Jane Doe Su’s martial art skills that Zhao Youyue had set was the strongest possible for a human in this game, about par with “Sword God” Li Xiye. Her “Fairy from Wonderland” skill actually shared the name of Cool-Son Yeh from Baiyun City’s skill[1]. In actuality, the effects of the two professions were different.</p><br/><p>Speaking of which, the skill level of the world that Cool-son Yeh lived in was most probably middle-skilled. Their “light body”[2] was present, and they could casually take off whenever they wanted to. In “Tale of Wuxia 3”, if a player wanted to go on the roof, they had to use tools. For example, climbing axe, ladders and such.</p><br/><p>The strongest masters were probably parkour masters. They were stronger and faster than ordinary people. They ran faster and jumped higher, but they could not do anything like the “light body.” This game was just like that, anti-Wuxia</p><br/><p>There was the presence of inner strengths, or perhaps, “qigong[3].” This kind of energy had miraculous effects when players fought against monsters. For example, to deal damage to certain evil spirits, they had to imbue their weapons with qigong. Otherwise, they would not be able to hit the monsters.</p><br/><p>Of course, some demons and ghosts flew in the sky like annoying flies. Some of them even had supernatural, exceptional skills. No matter how strong humans were, there was no way that anyone could directly challenge these monsters. However, human beings were wise. With enough prep time, the masters would be able to use their skills and strategies for dealing with those monsters.</p><br/><p>Players were like that. They could die a hundred times to understand the opponent by that slightest bit. Then, through step-by-step calculations, they would ultimately complete their counter-attack!</p><br/><p>At the moment, Zha Feng was in an “intoxicated” state. It seemed like he was spiritually playing his own game, which had been powered by his “burst of inspiration.” To him, the power of the Jane Doe Su had exceeded his expectations. Even if Li Xiye tried to save another player, he would not get through unscathed.</p><br/><p>Protecting others had always been more difficult than taking people’s lives. To save a player, Jane Doe Su rushed into those undead curs without hesitation and started dancing away with her sword. Only an insane person would do so. Even so, she was unable to clear off all the undead curs in one breath. These curs had retained their hunting memories and instincts before they died. They even knew how to take turns fighting and did not jump on her all at once…</p><br/><p>Hence, in an attempt to save a player, Jane Doe Su was seriously injured!</p><br/><p>For a playerbase who liked to kill others and obtain treasures, fools like her appearing, was like heaven dropping a treasure atop their heads. This was because the players who have reached this stage knew that if this nameless girl could take on a group of curs, she had to be packing some serious gear!</p><br/><p>She was definitely better than Li Xiye. Even Li Xiye would not dare fight a group of curs just like that. He would attempt to isolate and handle them in turn…</p><br/><p>This world was simply too cruel. It was a world where even the masters could not hold himself against a pack of curs!</p><br/><p>Some players even used these curs to determine the levels of peerless masters. At best, the “Sword God” Li Xiye could only take on up to seven dogs at a time. To get on the master ranking board that refreshed every ten days, one would at least have to be able to take on five dogs at the same time…</p><br/><p>The overall top player in the whole area could fight four dogs at his sharpest. A regular human player would at least be able to fight two dogs at the same time, right?</p><br/><p>Fighting a single dog was far easier. As long as the player knew qigong, they could slowly torture the undead dog to death.</p><br/><p>However, when up against two vicious dogs at a time, the dogs knew how to attack back and forth. Even if you targeted one of the dogs and decided to use your skills on it, the other dog would take the opportunity to make a move and attack you while your skills were on cooldown</p><br/><p>How many players had underestimated these dogs only to pay the ultimate price?</p><br/><p>Too many to be counted.</p><br/><p>This was a game world where peerless masters could not even beat some dogs! After all, these dogs were not ordinary dogs, but a breed of monsters that would never appear in reality.</p><br/><p>Translation note :</p><br/><p>[1] “Cool-son Yeh” is a character from the movie “The Duel.” The Duel is a 2000 Hong Kong wuxia comedy film directed by Andrew Lau.</p><br/><p>[2] “Light body” () (Qinggong) is a technique in Chinese martial arts. Traditional Baguazhang training involves the use of qinggong. The practitioner runs up a plank supported against a wall. The gradient of the plank is increased gradually over time as the training progresses. The use of qinggong has been exaggerated in wuxia fiction, in which martial artists can move swiftly and lightly at superhuman speed, and perform gravity-defying moves such as gliding on water surfaces, scaling high walls and mounting trees.</p><br/><p>[3] “Qigong,” qigong, chi kung, or chi gung is a holistic system of coordinated body posture and movement, breathing, and meditation used in the belief that it promotes health, spirituality, and martial arts training.</p><br/>\n</div>"}