{"title": "Chapter 475", "id": 475, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-475", "volume_title": "Volume 5", "body": "<h1>Chapter 475</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Enthusiasm</strong></p><br/><p>Zhao Youyue was never really a believer of Su Li’s “mysterious power.” She had worked so many times behind the scenes and saw firsthand that most of Su Li’s powers occurred to help carry her burdens. Of course, it seemed as if Su Li was carrying the burden of some original author, but no one knew that behind these original authors – stood an even larger boss.</p><br/><p>With so many coincidences happening in a row, whatever Su Li drew seemed to attract those who loved to draw threads, even if those threads were sometimes too far-fetched. Not all who had been Cursed, but they would never be mentioned by the slightest.</p><br/><p>The Curse’s success was main attributed to the fact that most of the characters she drew quickly gained worldwide acclaim. Whenever these characters met their eventual ends, the world would argue about the legitimacy of the curse about as much as they argued about the characters itself.</p><br/><p>Su Li was merely a hardworking, passionate illustrator. She posted a vast amount of illustrations on her page at Pixiv [1], which also included some that had never debuted on Weibo, including some illustrations that were drawn before she became famous. She had even drawn her rendition of main characters from national-level comics, but no misfortune ever befell them</p><br/><p>These facts were never reported. Instead, everyone would continue reminiscing about the more recent headlines she made. Her illustrations would bring tears to viewers with their tragedies. Those who loved riling up the internet would start screaming like doomsayers, saying that Su, the Great Deity’s mystical power was omnipotent and held the keys to the wheels of destiny itself.</p><br/><p>Nobody likes a doomsayer, including their internet counterparts. They did little good, only existing to discuss Ma Qingwang and bringing in the phrase “Screw ideals, bring in home reality.” These doomsayers sometimes brought fun, albeit disgusting, hollow fun that was a waste of space and oxygen.</p><br/><p>Now, anyone who sincerely intended to praise or critique Su Li on ZhiHu would only draw in trolls who repeated the same old talk about worshipping Su, the Great Deity and utterly derail the entire thread.</p><br/><p>Fortunately, there were many deities on ZhiHu. These were professionals in the comic world. They remained serious and rated Su Li as asked, commenting that she wes a well-respected mangaka with a high level of professionalism; but lacked creativity and originality. Even so, there was nothing to take away from her art style. As long as she worked together with original authors, a godly creation would find its place among the stars.</p><br/><p>Another noteworthy trait was Su Li’s hardworking spirit. It was simple, almost elementary, but many others lacked such a trait, and a great deal of difference did it do them. Many could benefit much from picking up such a trait. Su Li’s editor often maintained that Su Li never once had to be rushed, as she always had a month’s worth of manuscripts prepared.</p><br/><p>Even so, Su Li was far from perfect. Other than her bleak history which had been deliberately buried by the community, her discrimination towards piracy readers and vigorous boot-licking of affluent readers had already been spread around like wildfire.</p><br/><p>This earned the ire of certain piracy readers who then proceeded to condemn Su Li, saying that piracy readers were not poor – they only loved being pirates. They would claim that they have recharged to prove themselves, calling Su Li a bootlicking bastard, even going as far as to demand that Su Li quickly lick their boots.</p><br/><p>Of course, Su Li accepted the insult with glee and quickly obliged, running her tongue over their boots like a maniac, even hoping that more piracy readers actually insulted her</p><br/><p>Of course, now that Su Li was one of the deities of the manga world who earned more than enough for herself, her old personality no longer showed itself. It was a word for word rendition of the phrase – “The fullness of the rice cabin affected a person’s personality.”</p><br/><p>Su Li treated Zhao Youyue with as much reverence as ever. She knew how much Lady Zhao appreciated her. Their personalities complemented each other, thus she always included Lady Zhao in any major decision-making. No matter what she drew, she would definitely ask for Zhao Youyue’s thoughts.</p><br/><p>This time around, her commission came from FengHuo gaming company, and they intended to have her draw the characters from , a 3A level work. If Lady Zhao ever started a live stream, she would be one of the first viewers present. Of course she would know that Lady Zhao had already cleared the main storyline of the game.</p><br/><p>Because of this, she felt even more like consulting Lady Zhao on the matter. Su Li also felt that she had been bound to Lady Zhao by a red string of fate. Lady Zhao’s blessing was actually necessary for her work to flourish</p><br/><p>Su Li’s heart skipped a beat. She just realized that things were not that simple. Everytime Lady Zhao caught sight of something, that work would always undergo unforeseen, major changes, and change that was not always for the better!</p><br/><p>Even so, Su Li was far too kind for her own good. She quickly shrugged it off as sheer coincidence. It was her art that possessed mysterious power. Su Li placed her head down beneath the water of pride and self-compliments, and held it down until she no longer moved.</p><br/><p>“A gaming company wants you to illustrate? Well, if it’s good money, and if they don’t seem to have any ulterior motives, take up the offer! Of course, you’d want their theme and genre to suit yours! Now that you are a top illustrator, it’s best to only accept illustration requests that suit your style as a basis.” Zhao Youyue was quoted as saying.</p><br/><p>“As expected of Lady Zhao!” Su Li cheered. No matter the situation, she would quickly release an aura of joy and optimism, due to the non-stop praises of Lady Zhao. This had profoundly changed her, or she would never have thought of declining the offer.</p><br/><p>The only thing that never changed one bit was that she would never give up on her illustration books. Illustration books did not earn as much as her comission-based work, but no one could take this hobby of hers away.</p><br/><p>Su Li was now in a position to take up big offers, and acted aptly, but she would never turn down anything from Zhao Youyue. In her heart, Lady Zhao came before everything else.</p><br/><p>Su Li started sharing more of the minor details of the game company and their commision. She thought that this would really enthuse Zhao Youyue, as it was, afterall, a game. Lady Zhao was so into games recently. If she introduced a new game to her, there was no reason that she would not be obsessed over it.</p><br/><p>Su Li knew exactly how to press the Lady’s buttons. As expected, when Zhao Youyue heard that it was , she bolted upright and started pressing her for more details. She even asked if Su Li had received the complete conceptual character design for the game. This truly mattered to Zhao Youyue, as she wanted to know whether all her effort in the “Two Dimensional Gate” had any effect at all, turning inspiration into actual work.</p><br/><p>“I do not have the character design and story information just yet; but, I do have a few names, such as Lee Xiye, Yan Qingmeng and a nameless girl whose name starts with a Su. It is very likely that this Su girl is the least important within the trio, as she did not have a name anyways. The previous two should be pretty important, especially this Lee Xiye guy. As a viewer of your live streams, I could tell that this God of the Sword is very important,” Su Li blurted based on her analysis of the characters.</p><br/><p>“I’m not sure if that’s the case (Cough cough) Something feels fishy” Zhao Youyue mentions in a fumble.</p><br/><p>“Eh?” Su Li was puzzled.</p><br/><p>“Oh, I just think that this request is really worth taking. may not be the most popular game at the moment, but something tells me that it would get really big. Just accept the job and be the first official art illustrator for the game. When it becomes something huge in the future, your career would thank you!” Zhao Youyue suggested enthusiastically.</p><br/><p>———————————————————————————————————————</p><br/><p>TL Notes:</p><br/><p>[1] Pixiv: A social webpage mainly for sharing illustrations</p><br/>\n</div>"}