{"title": "Chapter 496", "id": 496, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-496", "volume_title": "Volume 5", "body": "<h1>Chapter 496</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> Tide of Prediction</strong></p><br/><p>In this sidequest, the Nameless Swordswoman and her gang were not something to be trifled with. They were a daunting challenge for the ordinary.</p><br/><p>No matter how careful ordinary players were at playing this game, they would never be able to remove themselves from the spotlight. As time went on, they would start getting involved in the affairs of this Nameless Swordswoman. When they got themselves in trouble, she would offer them a helping hand and save them.</p><br/><p>Zhao Youyue’s gameplay stood apart from others in that aspect. She was one of the best players around, and she would never find herself in a pinch. With her health bar that was half of the screen and her mastery of the game, almost nothing could be a threat to her. It would be more convenient for the Nameless Swordswoman and her gang to be in trouble, and there they were, being ambushed by monsters en masse.</p><br/><p>Wu Shun had followed Ah Yu’s broadcast since it first started. She was at a point where he had once experienced. Back then, he had cried out in his broadcast “This is most certainly a kill zone! Other than several crazed dogs, there are three freaking elite mini-boss. Also, we’ve got these long-ranged, disgusting monsters. Let’s not forget that highly intelligent NPC that seems to be possessed by some devilish alien! Nobody can survive this!”</p><br/><p>Acting as a professional observer, he started to grumble about Zha Feng, “Finally I see through this slimy Zha Feng’s intentions. He wanted us to be bonded with this Nameless Swordswoman so that he could place us in a desperate situation!”</p><br/><p>The audience started to express their concern on Zhao Youyue’s bullet screen as well“After watching other guide maker’s broadcasts, I would like to point out that the Nameless Swordswoman is the master of the Anonymous City. She is the final boss. Ah Yu, please stop concerning yourself over her business and kill her already!”</p><br/><p>“After being tortured by the Anonymous boss, the guide maker himself came here for free technical lessons. He could not even touch the cape of the nameless boss”</p><br/><p>“That’s right! She is in trouble now, why not kill her and see what she actually drops!”</p><br/><p>“I hope that Ah Yu shows us how to kill this Anonymous boss. Only she could save the game maker from his misery!”</p><br/><p>Wu Shun anxiously waited for the broadcast. By turning on “iron man” mode, there would be no further saving point. Every death would set the progress back to the latest auto-saved file. All the little monsters killed in the last attempt would be back to life. Hence, every player of this game knew how to parkour their way through the masses and get to the boss.</p><br/><p>Zhao Youyue did not heed the advice on the bullet screen. She spoke firmly, “I am now playing as a saint monk – a righteous defender of humanity. How could I ally myself with the monsters to defeat a human? I see you guys saying that she’s the final boss? Well, that future can wait. From what I saw in the game, she is not one to abandon her gang. Ah Guang sees a kind, loyal soul, so he’s saving this girl!”</p><br/><p>The Saint monk rushed into rescue. It was just like having breakfast in the morning. No big deal</p><br/><p>Crazed dogs were removed from the screen with ease. They were not actual dogs, more like werewolves. They had high attack and defense values. Their very bites were capable of momentarily stunning their targets!</p><br/><p>Even though Zhao Youyue’s saint monk had tonnes of health; he barely survived the pack of crazy mongrels. However, separating these dogs from the main force actually gave room for the Nameless Swordswoman to focus on the rest</p><br/><p>Zhao Youyue showed off her remarkable skills. She used the terrain to her advantage, rounding up the pack of dogs and killing them in a series of combos. Then, she toyed with the highly intelligent NPC before decapitating it. This disgusting NPC was capable of regenerating all of its health in an instant. Well, no matter how fast one regenerates, a rat would remain a rat before a cat.</p><br/><p>The Nameless Swordswoman took care of the other three elite mini-boss. She seemed to equal Saint Monk in skill.Any of these elite mini-bosses would force ordinary players to quit this game, but they were reduced to puppets in the light of her sword dance. Their pieces littered the ground</p><br/><p>“Darn! Apparently, Ah Yu is playing an entire different game. Is she playing some farmer’s game? All I see is a farmer harvesting his field with a sharp sword. It was all over in a breeze, and nobody even suffered a scratch so no quests triggered whatsoever?” Wu Shun was amazed by what he saw, and quickly launched a rocket across Ah Yu’s screen. That would shut the mouth of people who were accusing him of watching free tutorials.</p><br/><p>Ah Yu’s skills did not even seem human. She had calmly strode through every attack, but did not recklessly attack either. These two crucial points made the saint monk invincible, portraying the philosophy of “End lives to save lives, remove the root but not the head” to its extent.</p><br/><p>“You are amazing,” popped up across the bullet screen. Viewers were now left wondering how the story would proceed from here.</p><br/><p>The following missions involved finding herbs and doctors to cure the citizens. The Nameless Swordswoman was never mentioned again.</p><br/><p>Nevertheless, the Nameless Swordswoman had grown fascinated with the saint monk. It was apparent from the increased frequency of her encounters, her dialogue lines, and the rumors that spread among the citizens.</p><br/><p>Wu Shun never got to learn the name of this Nameless Swordswoman – even when he had to fight her. However, after Zhao Youyue had saved her without a sweat, she easily introduced herself by name. She bowed to Saint Monk Ah Guang delicately, as if she was a princess of a royal family</p><br/><p>Zhao Youyue was delighted by this gesture. Of all players, she would know this person’s identity more than anyone. No harm being the first to predict her name.</p><br/><p>She recited to the audience, “The Nameless Swordswoman said that her surname was Su, and she had no name to follow through. The Kingdom of Zhao is known for it’s prejudice against females. Only the daughters of Royal families had names. Since her surname is Su, I’ll throw in a wild guess and say that she’s somewhat related to the Zhao royal family? She might even be Su Hu’s daughter!”</p><br/>\n</div>"}