{"title": "Chapter 500", "id": 500, "volume": 5, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-500", "volume_title": "Volume 5", "body": "<h1>Chapter 500</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Utopias Destruction</strong></p><br/><p>The CG cutscene alone had been more interesting than an entire blockbuster Wuxia. “Produce CG diligently, and the game is complete.” Players could now start a new meme, claiming that Feng Huo Gaming Company was actually a film production company disguised as a gaming company…</p><br/><p>Wu Shun and his viewers were equally shocked and indignant.</p><br/><p>Jane Doe Su’s last actions of donning her blindfold once again had struck them with horrifying grief. No matter what, they wanted to dig into her mystery now, more than ever. Their conscience had been unhinged, a void within that simply had to be filled!</p><br/><p>“Why would Jane Doe Su be defeated, didn’t Yan Qingmeng say that she would win?” Wu Shun blurted out, bewildered.</p><br/><p>A viewer in the live stream pointed out that Jane Doe Su’s route was a dead end. Dying at the hands of LI Xiye might have been the best way to go. What would have happened if she got mobbed to death? A body might not even remain in the end</p><br/><p>Yan Qingmeng heaved a sigh of relief. It was as if the death of Jane Doe Su had solved a menacing situation. She knew very well that if Jane Doe Su had not voluntarily sought for death, the one who would have died would have been Li Xiye.</p><br/><p>The other martial artists’ only saw Li Xiye’s godlike swordsmanship. A shout of “Swords of the Future” had broken the Anonymous City lord’s most magnificent skill “Fairy from the Wonderland”!</p><br/><p>But some well-informed martial artists muttered, “Didn’t they say that Nameless Empyrean Blade had the more potent ‘Man Kim Kwan Chong’ [1], so why didn’t she use it?”</p><br/><p>Other know-it-alls said, “‘Man Kim Kwan Chong’ sounds like something more suited for group combat. It might not have been the best choice in single combat”</p><br/><p>As it was, the martial artists all believed that their lives had been fulfilled by such a battle in the Forbidden City. This battle between the sword god and sword deity could be spoken of for generations to come.</p><br/><p>Wu Shun went on with the plot. His heart was threatening to burst out of his chest. Even if he received a large quest reward, earning the honor of being a high leveled, honored guest in the Kingdom of Zhao, and earned Li Xiye the God of Sword’s maximum likability, the disturbance in his heart would never be quelled.</p><br/><p>Apparently, when Li Xiye wanted to collect the body of Jane Doe Su, the commander of the Forbidden City had stopped him. To them, collecting the body of a criminal, a terrorist, a cultist who had committed the most heinous crimes against the imperial court was just as heavy a crime</p><br/><p>At that moment, the players were prompted by another menu. Should they help Li Xiye, or should they not help him?</p><br/><p>Nonsense, obviously they should help. Wu Shun could finally see that the real main character of the “Tale of Wuxia 3: Swords of the Future” was Li Xiye. The game had exposed everything!</p><br/><p>Wu Shun chose to help, so he could not avoid battling the commander of the Forbidden City army. It served as a good substitute to the final boss fight of this DLC. God knows, why was the ultimate boss killed by Li Xiye?</p><br/><p>Most humiliatingly, Wu Shun died five times while fighting the commander. His opponent’s weapon was almost cartoonishly long. He also had a big shield, knew how to use combo attacks, and was annoyingly durable. He was quite a difficult boss to deal with.</p><br/><p>However, this boss was nothing compared to Jane Doe Su. Dying by his hand a few times was enough of a learning experience for him to learn of his skills and combos</p><br/><p>However, defeating this fairly difficult boss still did not grant Wu Shun the usual euphoria.</p><br/><p>Something was weighing on his mind.</p><br/><p>His viewers urged him to dig into Jane Doe Su’s secrets.</p><br/><p>The main questline may have concluded, but an optional sidequest now awaited the players. It was an option to help King Zhao find the location of the Anonymous City and eliminate the Anonymous City’s forces in one stroke…</p><br/><p>This was the final blow that sent Wu Shun into a dilemma. If he refuses and attempts finding it himself, he might not even succeed. Accepting it was as good as committing further acts of evil.</p><br/><p>However, in the end, he accepted the quest.</p><br/><p>This side quest was not very difficult. Now that he was the high-leveled, honored guest of the Kingdom of Zhao and trusted confidante of King Zhao, he had also gained access to the many spies of the kingdom. The entire quest practically led him to the doorstep of the City.</p><br/><p>Wu Shun strode up to the city, more curious than ever. The main mission had barely told him anything. At most, Yan Qingmeng had let a hint slide here and there</p><br/><p>The Anonymous City was actually a small city in the mountains. It could barely even be called a city. It was a small town, just like the one described in the “The Peach Blossom Spring” [2] – The ground was flat and vast, while there were neatly arranged residences. There was fertile land, beautiful ponds, mulberry trees and bamboo groves, and roads and paths for travel; The crows and barks of the chickens and dogs mingled with each other. People were walking back and forth, immersed in planting crops. Men and women working in the fields all wore clothing that was unlike anything he had ever seen. The elderly and children all seemed to be joyful and enjoying themselves.</p><br/><p>This discovery caused Wu Shun to be completely overwhelmed. Didn’t they say that the Anonymous City’s forces were extremely evil?</p><br/><p>Following the quest’s hints, he picked up Jane Doe Su’s keepsake The Flying Sword of Myriad Colors and went into the Anonymous City town. He could not help but ridicule the Flying Sword of Myriad Colors [3]. Initially, he thought that it was an unrivaled sword, but when he obtained it, he did not expect to discover that the sword was just a ritual sword used for performance. It looked nice, but there was no way it could be used to kill someone!</p><br/><p>Once again, his viewers threatened to overload the chat servers. Who the heck was this Missy Jane Doe Su? She was already crazy strong with a useless toy. How strong would she be if someone gave her a proper weapon?</p><br/><p>The Anonymous small town accepted him warmly, as he carried the Flying Sword of Myriad Colors. Obviously, this small town was as secluded to the outside world as the outside world was to it. If not, why would Wu Shun, the accomplice who indirectly caused the death of Jane Doe Su, be so warmly welcomed?</p><br/><p>He started clearing more missions and gaining more information. The main objective now was to find out if the eunuchs and maids in the Kingdom of Zhao’s palace knew anything about the childhood of Jane Doe Su. Wait no, it should be Princess Jane Doe Su of the Kingdom of Zhao.</p><br/><p>He might not even need to proceed with the quest. His viewers already had a faint idea of who Jane Doe Su was. She was probably the most human character in the entire Tale of WuXia series!</p><br/><p>Martial artists hated her because she wanted to grant the entire world access to it. Teaching martial arts to bumpkins was an act of devilry!</p><br/><p>Wu Shun was only greet by more disappointment. The Kingdom’s army had closely followed him. They now waited outside the gates. Even if everyone in the Anonymous small town learned martial arts, they would not avoid the fate of being destroyed!</p><br/><p>The ensuing CG depicted the most violent and ruthless of pillaging of a town ever. In reality, only the elderly and weak people remained in the Anonymous small town. The CG even provided them some fanservice, which only demanded that Wu Shun and his viewers smash their computers up!</p><br/><p>The last utopia in a dark world, a paradise built by Jane Doe Su in a lifetime of struggle, fell.</p><br/><p>Perhaps, this was the vicissitudes of the law of humane justice.</p><br/><p>“How did Zha Feng the old sly live for so many years? I feel like beating him to death. I just realized that I am the most f*cking disgusting villain. ONLY AT THE END OF THE GAME. Why did I work so hard to play this game?” Wu Shun held his head and went nuts.</p><br/><p>He fell into a deep depression</p><br/><p>Translation note:</p><br/><p>[1] “Man Kim Kwan Chong” () is the pinnacle of the swordsplay in the martial arts world in the Fung Wan novel by Ma Wing Shing. Ma Wing Shing is a Hong Kong mangaka.</p><br/><p>[2] “The Peach Blossom Spring” () was a fable written by Tao Yuanming in 421 CE about a chance discovery of an ethereal utopia where the people lead an ideal existence in harmony with nature, unaware of the outside world for centuries.</p><br/><p>[3] “Flying Sword of Myriad Colors” () is a powerful weapon that was obtained by Xiang Shao Long from the Chinese Novel ‘A Step into the Past’ (), written by Huang Yi.</p><br/>\n</div>"}