{"title": "Chapter 511", "id": 511, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-511", "volume_title": "Volume 6", "body": "<h1>Chapter 511</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 511: Protagonist State Online</strong></p><br/><p>Zhao Youyue felt as if every drop of energy had been bled out of her. She was mentally and physically exhausted. Somehow, she was already regretting using this card. Switching to such a powerful card was nothing short of reckless…</p><br/><p>One could tell – Jane Doe Su was highly powerful. She was almost too potent, in fact. She almost could be considered to be at the pinnacle of power in a low-level martial art world. Zhao Youyue may be in the pink of health, but her body was simply not honed for such extreme levels of mental and physical attunement. This was just like forcing a dirt-cheap low-end computer to run a brand new triple-A game at ultra settings.</p><br/><p>Exhausted, Zhao Youyue dozed off early that night. At first light, she switched on the “Xu Jing card,” which was arguably most suited for this purpose. She accessed Jane Doe Su’s memories and started training her body accordingly. Of course, the results would never be like that of a fictional martial arts world. Still, compared to more conventional training methods, this “sword dance training” from Jane Doe Su was definitely anything but conventional!</p><br/><p>Zhao Youyue had fought tooth and nail to get her body adapted to Jane Doe Su’s high spec requirements. Of course, without “Xu Jing’s card,” she would have given up in no time at all.</p><br/><p>She had always been an early riser, but she would wrap her fingers around her phone and get lost in another world for the following hours. This time, with a very awesome looking gemstone cane that was often used by royal families in hand, donning a pure-white outfit, she was practicing with her sword – in the garden, at the top floor of the high-grade apartment owned by her family. If not her apartment, she could always find another spot. In such a big villa, how could she not able to find a place to train in secret?</p><br/><p>Real life martial artists would raise an eyebrow and ask, are you sure you should be picking up a sword without some basic martial arts foundation?</p><br/><p>That would not be a problem for Zhao Youyue. Jane Doe Su never got involved in those “basics” either. She had honed her body into the single-mindedness of the sword, be it power, agility, flexibility. She was both a female swordsman and a dancer…</p><br/><p>Therefore, Zhao Youyue had also acquired the keen sense of rhythm that a dancer would possess. If she ever took up dancing, she would be prodigious.</p><br/><p>She had inherited everything from Jane Doe Su. Limited as her powers were in this strict, rigid world, those limiters would be quickly discarded when Zhao Youyue steps into a compatible world!</p><br/><p>As it was, Zhao Youyue belonged to reality. A reality that adjusted and balanced</p><br/><p>stats to fall within its boundaries. Zhao Youyue quickly bonked her head against the ceiling after some more sword dancing. It was nothing like what Jane Doe Su was in her Wuxia world. Anyhow, she could easily defend herself from danger now. She might even be able to play the heroine and start saving damsels in distress. Of course, this needed time.</p><br/><p>Strength did not come out of anywhere, especially in this reality. There were laws and rules to obey. After obtaining Xu Jing card, Zhao Youyue had to study hard for a long time before finally assimilating that girl’s nature and becoming one with it. It almost took her three years before she could be an actual elite scholar and break records in the national examinations…</p><br/><p>Zhao Youyue had been highly fortunate to have obtained “Xu Jing’s card” before obtaining “Jane Doe Su’s card.” If not, her laziness would have made it impossible for her to make any progress.</p><br/><p>There was a reason why she had decided to wave a cane about, instead of a sword. It was a calculated decision, on part of Zhao Youyue. Walking about with a sword was odd, to begin with. She would most definitely attract unwanted attention, from the public and the law. Waving a cane about would be less conspicuous.</p><br/><p>Canes would also make you look pretty swag. Take a look at the aristocrats of old and their ornamental canes. The character Tokiomi Tohsaka wielded a Ruby cane, looking as elegant as a noble could be. At least before he was promptly strung up and beaten. That noble visage was quickly reduced to “The Pan of this Generation.” His supposed nobility became accompanied by a lifetime joke, “Everything is the fault of time”…</p><br/><p>If only he could wield his cane like a sword, he might not have suffered such a fate…</p><br/><p>Unfortunately, canes did not simply transform into swords, not in this reality. Otherwise, Zhao Youyue would have turned it into a whip – playing the role of the cane-wielding hunter from “Bloodborne.” That was cool and awesome in equal measure!</p><br/><p>Anyway, Lady Zhao would get herself a gemstone staff, while remaining seated on a mobile throne. Then, let those who were raised by her… no… her friends, such as Han Leng, push her from behind. She would both be superior and cool. Try to look past this passerby if you can!</p><br/><p>Visualizing the scene alone gave Zhao Youyue much pleasure. The prospect of being almost illegally cool made her giddy with excitement. Let them assume that her legs were non-functional. Let them assume that she had a serious case of short-sightedness. Rumors about her being disabled would still be rumors, regardless. Let’s make our university debut a big one…</p><br/><p>Zhao Youyue had started to grow her hair out again. Afterall, she was no longer a high school student. She was going to embrace her university life with open arms and spend her days idling about more than ever. Having remained a passerby for so long, it was time to be at the center of everyone’s universes again. As “Jane Doe Su” – provided that she has her combat power bang on by then – she would be able to handle all forms of trouble without a problem!</p><br/><p>Before her university semester began, Zhao Youyue had one more thing to do. She had promised to go play with Su Li at her house. Apparently, Su Li had two younger, cute sisters. One was just about to start her eleventh grade; the other was just about to enter junior high.</p><br/><p>The former was Su Jue, the latter was Su Lin.</p><br/><p>Zhao Youyue had seen their photos before. They were both very beautiful – as expected of the Goddess mangaka’s kin. Even a vainpot narcissist like Lady Zhao approved of their looks.</p><br/><p>Su Li loved her younger sisters very much as well. She had always bragged to Lady Zhao about how clever they were; how intimate they were…</p><br/><p>As the single daughter, those tales actually struck a sore spot. She often lamented about not having any sisters whatsoever. If only God gave her the opportunity to show them her love…</p><br/><p>Of course, Lady Zhao’s love would be as powerful as always. She would smile gently lulling everyone into hanging on to every single one of her words. It was not okay to not be good girls in front of Lady Zhao.</p><br/><p>At that moment, Zhao Youyue had completed her first set of sword dance moves. She dipped her staff into the ground. The gentle breeze took her long hair up. She took in the sun, her snow-white clothes making her all the more dazzling. She had never felt so good, so strong before. Something told her that she would be able to take on ten grown men at once.</p><br/><p>Suddenly, she heard a fierce bark. An inexplicable form of fear crept up her spine…</p><br/>\n</div>"}