{"title": "Chapter 520 - Delightful Justice", "id": 520, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-520-delightful-justice", "volume_title": "Volume 6", "body": "<h1>Chapter 520 - Delightful Justice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 520: Delightful Justice</h3><br/><p>Ordinary people only got involved in such “fights of justice” in console games. Hu Xiaotian lived in another level. He had fabricated his persona as a “dedicated servant of justice” and forced “villains” to fight him in reality. As a result of his hobby, he was idolized by the street-dwellers!</p><br/><p>Young thugs praised Hu Xiaotian as well. He proved to them with his sweat and blood that even a thug could fight in the name of justice!</p><br/><p>Hu Xiaotian was considered a useable pawn for some gangster boss. With perfect planning, he could be placed at a rival’s area and cause havoc. All they had to do was cause a scene where justice was needed. They had to take some minor losses in order to prevent Hu Xiaotian from finding out the truth…</p><br/><p>Common thugs despised Hu Xiaotian for his deeds. What he did was against the unwritten law of gangsters and brotherhood. How could he be fighting for the name of justice when other gangsters profited from the chaos?</p><br/><p>Was he a spy?</p><br/><p>Definitely not. Hu Xiaotian was the leader of “Justice Gang.” It charged others a higher rate, with better benefits. The people under their protection could ask for their help in claiming a bad debt or collecting sensitive packages. Never once were their requests ever turned down, never once would they fail to deliver.</p><br/><p>Hu Xiaotian treated his gang as a company. It was his vision to bring his gang to a brighter future. His company name was the “League of the Righteous.” Some people were confused with other multinational companies or rival gangs with superpowers. After all, there was something called the “Justice League”…[1]</p><br/><p>People on the street usually stayed away from Hu Xiaotian and his gang. To them, it was a great honor to die in the name of justice. In every fight, they would not bow to any criminals and would fight to their deaths if they had to. Such spirit!</p><br/><p>They were not embarrassed to be street punks or gangsters. They honored themselves with their acts of protecting people in the name of justice, even if it was against the law.</p><br/><p>Little did anybody know that Hu Xiaotian was driven by his personal interests. He loved to fight!</p><br/><p>Profit was never his priority. That was the main reason why his “League of the Righteous” expanded slowly. Even so, he won the hearts of people by fighting for the greater good!</p><br/><p>No matter why he fought, people would still think that it had been a “fight of justice.” He had even been pardoned for involuntary manslaughter. After all, he only fought criminals and bad guys.</p><br/><p>All bad guys deserved to die!</p><br/><p>The fist of Hu Xiaotian shall judge those who cannot be judged by law!</p><br/><p>Hu Xiaotian never fought to kill. His fists were only meant to imprint regret and remorse in the soul of his opponents. He would gladly enlighten them with his punches until they turned over a new leaf…</p><br/><p>What happened had been completely unexpected. Hu Xiaotian had been completely pumped up for a fight, but those three thugs had been scared off by a beautiful young lady. She had merely shouted at them!</p><br/><p>Thugs these days were so weak!</p><br/><p>Zhao Youyue noticed the baseball bat in Hu Xiaotian’s grip. Since the three thugs were too afraid to fight, this man could be a worthy opponent. Only gangsters carried baseball bats about, right?</p><br/><p>Hu Xiaotian was tall and muscular. He always wore a black coat over a white shirt, without a tie nor a buttoned-up top collar. With his jarhead hairstyle, he intimidated many without saying a word. He had the good looks though, falling into the strike zone of certain girls. After all, who would not feel safe beside him?</p><br/><p>Of course, Hu Xiaotian was more interested in fighting than earning a girl’s affection.</p><br/><p>Zhao Youyue walked towards him without a word, staff in hand. Her arrogant expression almost begged for a fight. She was looking for a reason to draw her sword…</p><br/><p>Lady Zhao also loved to fight for the name of justice. She was hoping to use her weak outlook as bait to punish the ill-willed people.</p><br/><p>A fight between these two “defenders of the righteous” would never take place. Hu Xiaotian would never fight a girl.</p><br/><p>Girls, especially the pretty ones, were the best bait, just like the three thugs who almost took the bait. It was a shame that they never bit down.</p><br/><p>Hu Xiaotian was disappointed with the cowardness. But didn’t the little missy seem just as disappointed?</p><br/><p>“Are you not Xiao Tian? Why are you here?”</p><br/><p>Su Li rushed to stop Lady Zhao from causing any trouble. She knew this baseball bat-wielding kid. He was her younger sister’s childhood friend, the little brother she had watched over.</p><br/><p>Hu Xiaotian childhood had been a harsh one. He was a victim of family violence, and was often forced to hide in Su Li’s house. Her mother ran away with another man. His dad was a gangsters who died in a gang fight.</p><br/><p>Nobody knew that Hu Xiaotian had joined the fight and executed his dad in the name of justice. He felt no grief for his old man’s passing. On the contrary, he was almost overcome with intense emotions of relief and joy.</p><br/><p>At that moment, he appreciated all the beatings that his dad gave him. Because of all these injustices that his dad had committed, he had relished beating his dad to death… Somehow he wished there were other despicable family members for him to kill… in the name of justice.</p><br/><p>Vigilantes were not always appreciated, especially as of late. They were as much as criminals as those they claimed to punish.</p><br/><p>“It has been a while, Big Sister!” Hu Xiaotian greeted Su Li enthusiastically.</p><br/><p>Hu Xiaotian would never forget how much Su Li helped him in the past. He always hoped that Su Li would one day request for him to kill someone or burn something down. He could never repay his debt!</p><br/><p>“Oh? You guys know each other?” Zhao Youyue quickly removed her war face, instantly reverting to courteous Lady Zhao.</p><br/><p>“I cared for Xiao Tian when he was young. He was a good boy. I used to read stories to him and my sisters. Stories of morals and life, mostly,” Su Li smiled.</p><br/><p>Hu Xiaotian scratched his head in embarrassment. Su Li was one of the reasons he became “partners with justice.”</p><br/><p>If not influenced by Su Li, he would have ended up like his old man. Su Li had showed him what was worth protecting in the name of justice. Since then, it became raison d’etre.</p><br/><p>Su Li’s family was at the top of Hu Xiaotian’s protection list. He would lay down his life for them.</p><br/><p>Then, Su Li introduced them to each other.</p><br/><p>Translation Note:</p><br/><p>[1] Justice League is a 2017 American superhero film based on the DC Comics superhero team of the same name, distributed by Warner Bros. Pictures. It is the follow-up to 2016’s Batman v Superman: Dawn of Justice and the fifth installment in the DC Extended Universe (DCEU). The film is directed by Zack Snyder, written by Joss Whedon and Chris Terrio, and features an ensemble cast that includes Ben Affleck, Henry Cavill, Gal Gadot, Ezra Miller, Jason Momoa, and Ray Fisher as the titular team, with Amy Adams, Jeremy Irons, Diane Lane, Connie Nielsen, and J. K. Simmons in supporting roles. In the film, Batman and Wonder Woman recruit The Flash, Aquaman, and Cyborg after Superman’s death to save the world from the catastrophic threat of Steppenwolf and his army of Parademons.</p><br/>\n</div>"}