{"title": "Chapter 521 - Rear View", "id": 521, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-521-rear-view", "volume_title": "Volume 6", "body": "<h1>Chapter 521 - Rear View</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 521: Rear View</h3><br/><p>Su Li was still troubled by the fact that Zhao Youyue did not have a single bodyguard sweeping the area. The first thing that came to mind was to drag Lady Zhao back to her home at that very moment. Such a location was far too hostile, too dangerous for a blooming flower like Lady Zhao. When Hu Xiaotian showed up, Su Li recalled him running a security company of his own called The “League of Righteousness.” What good timing! She could hire his services as Lady Zhao did not seem like she would budge anytime soon.</p><br/><p>Hu Xiaotian was delighted. He could never refuse Big Sister Su Li’s request. No payments required!</p><br/><p>The only person upset by this outcome was no other than Su Li’s second sister, Su Yu. She confronted him in a rage. I asked you to scare you-know-who off, how could you end up as you-know-who’s bodyguard instead?</p><br/><p>Hu Xiaotian declared firmly that he would never harm anyone dear to Big Sister. Besides, you-know-who was nothing like the evil force that set off his justice alarm. He had no right to even intimidate her.</p><br/><p>Zhao Youyue even challenged Hu Xiaotian to a friendly spar. Finally, she had her chance to put her cane to the test. Even so, she did not find the satisfaction she yearned for, as Hu Xiaotian was holding back throughout the fight. If anything, she learned that Hu Xiaotian was very strong indeed.</p><br/><p>Not long after, it was time to say goodbye. Zhao Youyue traversed the field all by herself. She came upon and pond and gazed upon its still surface. The view was not exactly beautiful, but the air was refreshing.</p><br/><p>The end of August had set in. The weather took a turn for the colder.</p><br/><p>A roguish character shadowed Zhao Youyue, maintaining a certain distance at all times. He was Hu Xiaotian. Protecting Zhao Youyue was currently his top priority. It was no easy task, as Lady Zhao deliberately provoked villains from the left and right into attacking her. She even made some new enemies with the local gangs. Of course, these events served as more opportunities for Hu Xiaotian to fight. Zhao Youyue also got to stretch her limbs and hone her swordsmanship further…</p><br/><p>Regrettably, these opponents were far too weak. She never even got to activate “Lady Su’s Card.” Hu Xiaotian’s immense strength only made the window of opportunity smaller than ever. He alone was more than enough for most of the fights.</p><br/><p>Zhao Youyue learned much more of Hu Xiaotian’s past. His violent childhood of abuse and mistreatment had set him on this path of brutal vigilantism. He might actually be the real-life version of “Jane Doe Su!”</p><br/><p>“Thanks for helping out these past few days, goatee” Zhao Youyue abruptly stopped mid-stride, turning her head, flashing her smile in the process. Her silky, dark locks served as the ideal frame to her perfect smile. Such beauty!</p><br/><p>Hu Xiaotian was only interested in fighting and conditioning his body. He was entirely immune to such charm, even if they caused other men to drop dead. He modestly replied, “It was no trouble at all, Lady Zhao. If you had not started all those fights, it would have been very boring… and please, do not call me Goatee. I have a chin as bare as a baby’s buttocks.” Zhao Youyue had a practiced eye when it came to judging the characters of others. She had pieced the simple puzzle of Hu Xiaotian together on day one. Eccentric and damaged as he was, she had no qualms about making friends with odder individuals, as long as they could serve a purpose.</p><br/><p>“Grow something out then! Hmmm, make it a mustache, it matches your face well,” Zhao Youyue suggested out of the blue.</p><br/><p>“Really?” Hu Xiaotian scratched his head in doubt. Lady Zhao’s words had to be full of wisdom, even if he could not see it. She had been to so many places and have met so many people. Plus, Big Sister Su Li was more ravishing than ever. Lady Zhao must have had played a significant role in that part.</p><br/><p>Zhao Youyue laughed helplessly when she saw Hu Xiaotian’s adorable, dumbfounded expression. She handed him her name card. With her arrogant war face, she said sternly, “Hey, goatee. Call me if you ever need the cavalry.”</p><br/><p>Hu Xiaotian put away Lady Zhao’s name card carefully, dubious on ever having to use it. Since childhood, he had settled all his problems by himself. He would never call Lady Zhao for help, even if he ever got himself into a major pinch. He had a reputation to uphold.</p><br/><p>He was all too aware of the fact that they were of two entirely different worlds. Being in close proximity to the Lady these past few days had given him new insight. He was no fool and could see that Lady Zhao had made it her hobby to meddle in the affairs of those around her, remolding them to her preferences.</p><br/><p>He held nothing against her for that, for his world was unremarkable and small. Perhaps one day, he would venture out to conquer bigger worlds.</p><br/><p>Zhao Youyue turned away as quickly as she had stopped and said, “Consider this a parting gift! Goodbye!”</p><br/><p>It was at that moment when Hu Xiantian realized – Lady Zhao’s rear view was the most beautiful thing ever. Even her dazzling smile paled in comparison to it. Sadly, his days of tailing her would soon come</p><br/><p>to pass.</p><br/><p>These few days of fighting alongside Lady Zhao had been an exciting adventure for Hu Xiaotian. He would come to miss being commanded to do the most random of things and the odd pet names she bestowed upon him. His deepest wish was only to fight to his heart’s content, and Lady Zhao had actually made it possible.</p><br/><p>Lady Zhao was like a genie in a magic lamp. This was probably why everyone tripped over themselves chasing after Lady Zhao. Pursuing her was no different from pursuing one’s dreams.</p><br/><p>Zhao Youyue left the small town, satisfied with her experience. For her, this was like clearing a stage in a game, so returning here would be moot.</p><br/><p>Some places were only best visited once. Revisiting them might only sully the precious memories. It would be best to leave them untouched.</p><br/><p>This is why photos are taken as mementos.</p><br/><p>After Su Li and Zhao Youyue left town, Su Yu stormed her way to Hu Xiaotian. Not only did this bastard not bully Lady Zhao, on the contrary, he became her pet dog!</p><br/><p>“Hu Xiaotian, don’t you have a spine?”</p><br/><p>“No, I don’t…”</p><br/><p>“What?! Are you still a man?”</p><br/><p>“No, I…. Yes I am.”</p><br/><p>“How could you lick the shoes of that disgusting noblewoman!”</p><br/><p>“Lady Zhao is not disgusting at all. She is prettier than you are. Far more elegant too. She is an angel. An angel who gifted me with so many more fights under her belt…”</p><br/><p>“Do you even realize what you’re saying?! How dare you! This is so frustrating!”</p><br/><p>Su Yu was left more infuriated than before. She suddenly recalled something. “Hey, you never once showed me that new girlfriend of yours! Do you have her photo? Oh, who am I kidding, of course, you would. Show it to me!”</p><br/><p>Hu Xiaotian stretched out his hands, as if signaling to Su Yu that these were his girlfriends – Jill and Lily.</p><br/><p>Su Yu laughed bitterly. So much for girlfriends!</p><br/><p>She snatched his phone from his pocket and scrolled through his albums. Her smile froze solid the moment she saw the only photo ever taken by his camera.</p><br/><p>It was the rear view of a particularly annoying young brat. A dreamy, surreal sight.</p><br/>\n</div>"}