{"title": "Chapter 526 - Roommates", "id": 526, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-526-roommates", "volume_title": "Volume 6", "body": "<h1>Chapter 526 - Roommates</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 526: Roommates</h3><br/><p>The contrast in this scene was somewhat striking. A scholarly bookworm was pouring herself over a book almost leisurely. She looked like a true intellectual. The other was a plainly-dressed girl who had her hair done up in a generic ponytail, cleaning the entire dorm in earnest.</p><br/><p>Zhou Cai was slightly chubby and had average looks, with short hair. Her face was also infested with acne. She might even be downright unpleasant to look at for some. Nothing about her had any hint of feminity. Such a shame.</p><br/><p>But when she saw the scene, she had set her luggage down and hurried up to Zhao Youyue, saying, “Let me help you!”</p><br/><p>“You don’t have to. I am almost done with mopping the floor already. I just wanted to clean up a little. It was no trouble at all.” Zhao Youyue wiped the sweat off her forehead, revealing an affectionate smile.</p><br/><p>It was already September, but Jiangnan was still rather humid. The upcoming military training would probably be very tough, and the freshman would beg for the rain every single day.</p><br/><p>Zhou Cai was wholly healed by her roommate’s tender smile. It took her just a few seconds of peering into Zhao Youyue’s face before realizing that this girl was drop-dead gorgeous, and had flawless skin to boot!</p><br/><p>Fortunately Zhou Cai was not one to fuss over her personal appearance. If not, she would have been extremely jealous of this new roommate who seemed to have snatched all the beauty in the world away and kept it to herself…</p><br/><p>Most importantly, this roommate had an amazing personality that can’t possibly be misjudged.</p><br/><p>Zhou Cai got to know Zhao Youyue’s name instantly. However, she did not spare the scholarly girl a second glance. She got to arranging her bed.</p><br/><p>Zhou Cai obviously came by herself. Despite being a girl, something about her hinted at some strength that belied her motherly nature. Perhaps it had something to do with her ‘sturdy’ build. Let’s avoid using the word ‘fat,’ that’s just mean.</p><br/><p>Not far behind Zhou Cai was a He Weiwei. She was not alone, an elderly woman was escorting her. She called her ‘aunt,’ this ‘aunt’ looked more like a maid than someone related to her.</p><br/><p>“Hey, put the mop down. Let my aunt handle this. She is a professional!”</p><br/><p>He Weiwei snatched the mop out of Zhao Youyue’s hands and handed it to her ‘aunt.’ Then, she flashed a friendly smile at Zhao Youyue and introduced herself enthusiastically.</p><br/><p>She did not even look at the other two roommates. This was because she was part of the ‘good-looks club,’ and club members stuck together!</p><br/><p>Among the four of them, He Weiwei was probably the most distinct. Her hair had been dyed gold, she had exquisite makeup on, and her ears had been pierced more than once, each. Some might find her fashionable, others bizarre…</p><br/><p>She looked wealthy. Each article of clothing on her looked like they cost thousands each, even if they were nothing compared to Lady Zhao’s cheaper section of the wardrobe that was tenfold that amount each. All-in-all, He Weiwei was a ‘Ms. Perfect.’ [1]</p><br/><p>“Zhao Youyue? That is a nice name! My name is He Weiwei, nice to meet you!”</p><br/><p>After He Weiwei introduced herself, she burst into typical girl chatter. She even mentioned that her contact information had been sought after by a few seniors. They were helping her to carry her luggage enthusiastically. Unfortunately, the contact information that she gave had been fake…</p><br/><p>“Ha ha ha, boys from such a prestigious school would settle for an average like me. A small trick like this could already wrap them around my fingers! Ha ha ha!”</p><br/><p>He Weiwei appeared to be the rather domineering narcissist. Unexpectedly, few actually hated her.</p><br/><p>After Zhao Youyue dealt with this quirky ‘Ms. Perfect,’, she enthusiastically helped sturdy Zhou Cai make her bed. In just a day, she had earned the acknowledgment of all three roommates. Zhao Youyue was just too good at farming favor points…</p><br/><p>Zhao Youyue had offered to help He Weiwei, but she was quickly turned down. He Weiwei felt that it was the right choice to leave everything to her ‘aunt’.</p><br/><p>Zhao Youyue was disturbed by that sentiment and felt that it was the right thing to ease the ‘aunt’s’ burden.</p><br/><p>Finally, Yu Xuefei – who had been ‘engrossed’ over her book on the balcony snapped. These two new roommates had disregarded her existence altogether. The humiliation was unbearable.</p><br/><p>Among her three new roommates, Zhao Youyue was the only one who was pleasing to her eyes. The other two roommates, not so much. One was a chubby girl and had so many pimples on her face that she looked like a toad. She was disgusted to be roommates with such a person. The other girl had cheap gold dye on, and she looked like a God damn skank. How did such a girl get accepted into this respectable establishment? She must have let herself in through the back door.</p><br/><p>However, Yu Xuefei had been listening intently to their conversation from the beginning and had learned the names of the other two roommates. This had saved her time from introducing herself.</p><br/><p>Yu Xuefei finally stood up. She purposely hugged her book, its back against her chest, just to let her roommates catch sight of the title, “Mo Ran Hong Chen.” It was time someone took the initiative and asked her about it…</p><br/><p>Unfortunately, her other two roommates were worse off than Zhao Youyue. At least Zhao Youyue had clearly been ‘taken aback.’ The other two acted as if she was an invisible scholar.</p><br/><p>Yu Xuefei took her spot beside Zhao Youyue and continued to rain praises on her, saying, “Zhao Youyue, you are so helpful! The dormitory’s cleanliness is up to you from now on. You would be able to do a good job!”</p><br/><p>Yu Xuefei felt that her praise was on point. Leaving the cleanliness of the dormitory to Zhao Youyue was appropriate. This way, she could study with a peace of mind, in a clean environment to boot…</p><br/><p>Zhou Cai protested almost immediately, “How could you leave the cleanliness of the dorm to just one person? We should take turns cleaning it. You should not take advantage of Zhao Youyue just because she is kind-hearted.”</p><br/><p>Yu Xuefei adjusted her glasses and clicked her tongue while saying ‘toad!’ in her heart. Being rebutted that way had made her lose face. She was used to being a leader of sorts back in high school.</p><br/><p>“I know for sure that Zhao Youyue is a kind person. She’s under my protection from now on, and no one could bully her.”</p><br/><p>He Weiwei narcissistically ran her fingers through her golden hair. Did we forget to mention that it had been permed to resemble golden curly fries?</p><br/><p>He Weiwei was like a lioness protecting her cub. Every single word in that line had been forceful and severe.</p><br/><p>“Don’t misunderstand my words, guys! I really admire Zhao Youyue, how could I bully her? Maybe I just did not know how to phrase it better,” Yu Xuefei said, forcing a laugh.</p><br/><p>Translation note:</p><br/><p>[1] “Ms. Perfect” () is a term for women who are fair-skinned, rich and beautiful.</p><br/>\n</div>"}