{"title": "Chapter 525 - Dormitory", "id": 525, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-525-dormitory", "volume_title": "Volume 6", "body": "<h1>Chapter 525 - Dormitory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 525: Dormitory</h3><br/><p>Zhao Youyue finally arrived at her dormitory and spotted a note taped on the door. There were 4 names on the door. Other than Zhao Youyue, there were Zhou Cai, Yu Xuefei, and He Weiwei.</p><br/><p>These three people were probably Zhao Youyue’s roommates. She walked in to find a lone occupant. The person sat on the balcony, reading a book in silence.</p><br/><p>She had glasses on, which only amplified her scholarly vibe. In terms of looks, she was more than decent. Boys who fancied bookworm-styled girls might gush at the sight of her.</p><br/><p>The girl sensed movement and spotted Zhao Youyue just entering the dorm. Apart from raising her head, she did not seem to know how to follow up. Perhaps she was rather introverted, for she soon lowered her head back down.</p><br/><p>Zhao Youyue was unperturbed, as always. She took the initiative to approach the girl, introducing herself gracefully. Her face had such a dazzling smile that no one could reject her.</p><br/><p>Even if Zhao Youyue was currently dressed up as a side character, her actions were nothing like one. Her entire being brimmed with charm, and she was simply irresistible.</p><br/><p>“My name is Yu Xuefei, nice to meet you.” Yu Xuefei replied cautiously, almost working up a sweat as she forced a smile through.</p><br/><p>Yu Xuefei’s first impression of this Zhao Youyue was an easy-going, no fuss individual. She was so approachable and had such a dazzling smile…</p><br/><p>After an exchange of pleasantries, Zhao Youyue swiftly cleaned and tidied her bed in an organized manner. Even though she was from a wealthy background, she had inherited everything from Xu Jing [1] the poor elite scholar. This was why Lady Zhao was far more capable and independent than one might think.</p><br/><p>A blanket had already been prepared by the university.</p><br/><p>Zhao Youyue took mere minutes to get things done, which further impressed Yu Xuefei. Her parents had accompanied her to the university. She had even came early, hoping that her parents would sort everything out for her before her roommates showed up…</p><br/><p>If not, Yu Xuefei would be very embarrassed. It would be evident that she was awful at taking care of herself. It was true, but it would be better if it was kept under the rug.</p><br/><p>Moreover, she lacked in that department for a good reason. She had used all of her time and energy to focus on her studies. If not, how did she get accepted into this prestigious school of a foreign province?</p><br/><p>After her parents sorted out everything for Yu Xuefei, she had hushly urged them to leave. The fact that her father was a laborer and her mother was a village teacher was just as embarrassing…</p><br/><p>Her parents had even wanted to help clean the entire dormitory up. Anyone could imagine how filthy school facilities were at the beginning of a new semester, even if the previous occupants and users had already been tasked to clean them before departing.</p><br/><p>Of course, prospective graduates would have no interest in lingering for a second longer. We’ll clean it alright, but just enough for appearances. The following two to three months would be enough for dust to blanket the area.</p><br/><p>When Zhao Youyue entered the dorm, she quickly spotted airborne filth as the sunlight beamed through the dorm. Lady Zhao was quick-witted, even when dressed unassumingly.</p><br/><p>Those who thought otherwise had only been deceived…</p><br/><p>Yu Xuefei hastily rejected her parents’ idea. She was not the only one living in the dorm. Why should her parents clean the room? Just because she was here first?</p><br/><p>She did not even stay to have lunch with her parents and got them to leave promptly. Just because she wanted to leave a “legendary” impression on her roommates, she took out a chair and sat on the balcony. She took out a classy title – “Collection of essays by Mo Ran Hong Chen” and left it open in her palms.</p><br/><p>Why was the book said to be full of class? Not many people knew about Mo Ran Hong Chen’s existence, but she did. Mo Ran Hong Chen was Jiangnan University’s famous Professor of Chinese Language and Literature. Her real name was Wang Hua. She had even received a few literary awards, but practically no one bought her books.</p><br/><p>This was why it was full of class; it was such a highbrow book!</p><br/><p>If her roommates ever asked about it, she could put on airs and demonstrate her sophisticated knowledge of China’s contemporary authors. It would help if they spreaded word about that, too. If Professor Wang Hua heard about it, wouldn’t she be impressed?</p><br/><p>Unfortunately, this “Zhao Youyue” did not ask too much about it. The most reaction elicited from her was a double take and a surprised blink. Then, she had hesitantly withdrawn to tidy up her section of the room…</p><br/><p>Her roommate must have been amazed by her sophisticated taste. An objective achieved, nonetheless!</p><br/><p>Yu Xuefei could not actually tell if Wang Hua’s essays were good. Well, since Wang Hua had received so many literary awards and was even a committee of the China Writers Association and the Vice-Chair of Jiangnan Province’s China Writers Association, this meant that she had to be something!</p><br/><p>If Wang Hua had been aware that there was a fangirl of hers in her daughter’s dormitory, she would have been ecstatic! Then, she would ask her lazyegg [2] to learn from the fangirl…</p><br/><p>Naturally, Zhao Youyue was slightly puzzled at the discovery. She decided to dismiss it as a hallucination.</p><br/><p>After Zhao Youyue finished tidying up her bed, she took note of the surrounding filth. She picked a broom up and got busy.</p><br/><p>Her behavior caused Yu Xuefei to nod her head unconsciously. This roommate who had been clad in Taobao clothes from head to toe was most diligent. She suited the working class perfectly. Not bad, not bad.</p><br/><p>Yu Xuefei did not even intend to help out. This was natural order manifested. The world was a complex collection of cogs, and each cog had to do its part. She was a top student from a prestigious school. She was meant for greatness in the future… Even if she had not yet decided on it.</p><br/><p>The only thing Yu Xuefei did was to slightly move the chair for Zhao Youyue to sweep the floor beneath her. Then, she praised Zhao Youyue happily, “Zhao Youyue, you are so good at doing chores! I admire you so much. My dad and mom would never let me do anything at home.”</p><br/><p>Zhao Youyue smiled in understanding. She barely did any chores at home. If she was staying at a resort, there would be housekeepers and maids flocking about. Cleaners came every week to hold the fort down at her luxury apartment.</p><br/><p>However, Zhao Youyue was very highly accustomed to such life in the literary world. After all, “Xu Jing” was highly independent, having lived in poverty her entire life. She had to take care of her bedridden father, and handled just about anything at home.</p><br/><p>After Zhao Youyue swept the floor, she picked up the floor mop to finish up. In the process, her two other roommates arrived.</p><br/><p>Thus, such a scene greeted them.</p><br/><p>Translation note:</p><br/><p>[1] “Xu Jing” () is an iconic character in “Pure Romance”.</p><br/><p>[2] “lazyegg” () refers to Zhao Youyue her. It normally refers to Gudetama. Gudetama is a Sanrio character introduced in 2013 based on an egg lacking in “spunk”. Their name is a play on “gude gude”; used to describe someone with no energy or strength and possibly tama from tamago (egg)</p><br/>\n</div>"}