{"title": "Chapter 534 - You Have Terrible Taste", "id": 534, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-534-you-have-terrible-taste", "volume_title": "Volume 6", "body": "<h1>Chapter 534 - You Have Terrible Taste</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Well… If you want to pursue her, you can actually ask me to write a love letter for you. I’m quite the expert,” Han Leng said, managing a tone that was somewhat half serious and half joke.</p><br/><p>Zhang Xiang immediately waved the offer off, saying that he did not dare cause Master Han Leng any trouble. He found the idea peculiar. Who pursued girls with love letters nowadays? Even Chinese Studies students would not do so.</p><br/><p>Instead of writing a love letter, why not find an opportunity to get hold of a girl’s contact? Start off with some small talk, take it step by step, until you go on an actual date. Never, ever do something stupid like taking a knee and confessing.</p><br/><p>Guys who got things moving through confessions often died disastrously. Confession was a most delicate matter, it would only succeed when all requirements were met. It was an unnecessity. Love could also occur naturally. Still, confessing would be far more romantic than not doing so. Some fakers viewed it as a formality.</p><br/><p>“I think that Zhao Youyue and Du Hang were once classmates. That’s the only explanation,” said another male student, popping up beside Han Leng.</p><br/><p>A slight twitch flickered across Han Leng’s mouth. Lady Zhao’s high school classmate was right here!</p><br/><p>“Hmm.. it appears that this girl was the one who took the initiative to talk to the guy. She looks like one of those sociable ones. I’ve to seize the opportunity…” said another male student.</p><br/><p>Han Leng muttered in his heart, “Lady Zhao is most approachable, she treats everyone similarly, regardless of the gender.”</p><br/><p>Being approachable was one thing, but her heart was as immovable as a rock. Many guys who knew their places had given up after they figured out Lady Zhao’s identity, and how she enjoyed leisurely life as a Lady. Poverty had hindered their imagination.</p><br/><p>Han Leng was puzzled. Why hadn’t his classmates figured out her real identity yet? “Ah Yu” was fairly popular on the internet as a live broadcaster, VA, singer, violinist. She was also closely related to the top 2nd generation stars Zhao Hao and Ding Yuncong. Anyone who was computer-literate would know who she was.</p><br/><p>Miraculously, they actually had really treated Zhao Youyue as a passerby classmate, and had only noticed her natural beauty much later…</p><br/><p>As expected from Lady Zhao, I guess? Being able to conceal her divine aura, mingling among commoners and nobility alike?</p><br/><p>As the male students chattered about, the female students got engaged in their own discussion. Most of the girls seemed to have noticed Zhao Youyue since the beginning. A Zhang Liting had even taken the opportunity to speak to another girl right under He Weiwei’s nose, saying that she considered Zhao Youyue to be the most beautiful girl in class. A natural beauty who actually settled for a simple ponytail was far better than a makeup-laden, attention-seeker.</p><br/><p>If He Weiwei had been narrow-minded, she might have taken offense at that. However, she was far too egotistical to take the words of lesser women to heart. She had already recognized Zhao Youyue as her subordinate. That beauty was already part of the small group that she was going to build. Increasing the average attractiveness level of the group would be great!</p><br/><p>Other girls began to gossip about the relationship between Zhao Youyue and Du Hang. Some of them seemed to breathe a collective sigh of relief. It was as if Zhao Youyue’s behavior clearly showed that she already “belonged to someone.” Unfortunately, in her case, it’s like a beautiful flower inserting itself into soft, mushy cow dung. Thus, they did not have to worry about Zhao Youyue competing against them for the truly rare resources…</p><br/><p>“Such a shame. She’s beautiful, but she’s all wasted on that guy.”</p><br/><p>“What’s that guy’s name? Is it Du Hang? I really can’t spot his charm at all. He’s not good looking. Poor fashion sense too…”</p><br/><p>“Grouchy, surly, unsociable, all on the first day, he’s certainly one of a kind.”</p><br/><p>“He must be an otaku. And then, he’ll evolve into a fatty otaku within the four years of his uni-life and earn another nickname – “Fatty Du.” That is his future. Hee hee hee…”</p><br/><p>“An autistic patient.”</p><br/><p>…</p><br/><p>The girls threw the harshest of insults… in their hearts. Unfortunately, not one of them actually voiced out their thoughts. If they had said that to his face, he might have fallen for them on the spot.</p><br/><p>He Weiwei was also somewhat dissatisfied with Zhao Youyue’s behavior, taking the initiative to talk to a male student. She had no objections about Zhao Youyue’s taking the initiative. She did have objections about Zhao Youyue picking such trash. If she had approached Han Leng instead, all would have been well. She could have even taken the opportunity to include Han Leng in her collection.</p><br/><p>He Weiwei was playing some sort of card collection game. She intended to have a full “SSR” deck. She considered guys like Du Hang to be trash quality, the type you discarded or sacrificed.</p><br/><p>Thus, He Weiwei finally could not resist walking towards them. She came to Zhao Youyue’s side, copmletely looking past Du Hang, and spoke to Zhao Youyue, “Is he your classmate?”</p><br/><p>Zhao Youyue nodded, “Yes.”</p><br/><p>“High school classmate?”</p><br/><p>“No, he’s my university classmate.”</p><br/><p>“As expected… Huh? What do you mean university classmate? You two have never met?” He Weiwei was shocked.</p><br/><p>“Don’t we know each other now?” said Zhao Youyue, smiling faintly.</p><br/><p>He Weiwei looked flabbergasted. She tugged on Zhao Youyue’s hand, leading her away from Du Hang slightly. She softly chastised, “Aren’t you worried of causing a misunderstanding? Male students would always climb upwards along the pole. What if he thinks you’re totally into him? Some men would fall head over heels for you with a simple “Thank you!”</p><br/><p>“Oh, he’s not like that… I just thought he seemed too lonely. Isn’t that pitiful? I wanted to help him get along with the others,” said Zhao Youyue earnestly, as if it meant the world to her.</p><br/><p>He Weiwei was truly getting concerned about this foolish Zhao Youyue. Even if she was cute, innocent, and lovely, a line must be drawn. He Weiwei was like a lioness nursing her cubs. She wanted to protect Zhao Youyue.</p><br/><p>People might not believe this, but He Weiwei was actually serving her friends, protecting them, even though appearances suggested that she was claiming the throne within a small group.</p><br/><p>He Weiwei looked just like the stereotypical sexy bitch.</p><br/><p>“There’s no such group in university. Don’t be such a busybody. You’ll only end up hurting yourself,” He Weiwei said earnestly.</p><br/><p>He Weiwei turned to threaten Du Hang. When she turned her head, the man had already slipped away. He had somehow reached Han Leng’s side…</p><br/><p>Han Leng was most curious. How was this guy related to Lady Zhao?</p><br/><p>That was unlikely. They were beings of opposite worlds.</p><br/><p>Han Leng always found friends with just about anything, regardless of the gender. He was already surrounded by a gang of his own. He was “everyone’s Han Leng.” After all, he was a super famous writer. On the other hand, Du Hang only had himself.</p><br/><p>All the students in the class now had a preliminary understanding of the campus. Night had fallen, it was time for dinner.</p><br/><p>He Weiwei wanted nothing more than to invite Zhao Youyue for dinner. At the same time, she intended to teach Zhao Youyue a nice lesson during dinner. Being too kind was a form of irresponsibility!</p></div>\n</div>"}