{"title": "Chapter 531 - False Hatred", "id": 531, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-531-false-hatred", "volume_title": "Volume 6", "body": "<h1>Chapter 531 - False Hatred</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 531: False Hatred</h3><br/><p>Zhao Youyue was nothing like a tender girl, even if her actions suggested otherwise.</p><br/><p>Her top-tier academic track record only added on to the facade. More would show her far more affection and favorability, giving her the upper ground.</p><br/><p>Few men like Du Hang – hating girls with all their hearts – existed, living in their solidarity worlds. Conversely, most guys fancied tender girls, as they warmed up their souls. But what if that warmth was not genuine?</p><br/><p>Lies had their purposes to fulfill. For instance, white lies were a necessary evil, a blessing in disguise, if you must. If lies did not exist, the entire world would fall into chaos.</p><br/><p>Du Hang was aware of this, but being chuunibyou was the only thing that prevented him from creating mediocre, subpar stories.</p><br/><p>Sadly, chuunibyous could never be saved. It was a sickness that ran deep in their veins.</p><br/><p>Du Hang did not act any differently towards Zhao Youyue, despite the fact that an actual bishoujo had approached him.</p><br/><p>This caused Du Hang to suspect if he was actually good looking. Perhaps he had the “clueless chick magnet” trait of a certain celebrity.</p><br/><p>But, so what if it’s a bishoujo? The world was infested with them, and their suitors outnumbered them. What’s the point of getting his hopes up for the impossible?</p><br/><p>The irony of the matter was that those who yearned for such girls often stared down at them over the tip of their noses, hating the fact that they desired such girls, yet the reality was constantly slapping them in the face. It was the worst of pipe dreams. Preparing for the impossible was a waste of time and effort.</p><br/><p>Girls and guys needed to resonate in real life, their two hearts needed to merge into one. That was the only truth.</p><br/><p>Sadly, such relationships only existed in literature.</p><br/><p>Du Hang had resigned to reality.</p><br/><p>At that moment, Du Hang was treating this bishoujo like just another guy to talk to, roaming aimlessly around the compound.</p><br/><p>A talk between men was the most meaningless, fruitful, time-wasting, fulfilling activity ever. A topic that never fails to catch on would always be about girls.</p><br/><p>“Making the use of every possible form of trickery and phrases to prevent a friend from slipping away must be a form of friendship between girls, I suppose. I would suggest paying attention, as displeasing suggestions tend to be truly helpful. Damn… I feel lucky that I wasn’t born a girl,” Du Hang drawled lazily, complaining about girls to the girl beside him.</p><br/><p>Zhao Youyue did not appear to take offense, or even consider herself as one of those ‘girls’ he was complaining about. Girls who were inferior to her were by no means below average. They may all have the ability to enter a renowned university, but the supreme scholar Youyue alone had been enough to deny them entry.</p><br/><p>Zhao Youyue never intended to have this happen. All she wanted was to bring companions along to have fun watching movies, having meals, shopping. One would most certainly be lonely without company, so why not fix that if you could?</p><br/><p>Those with a degree of self-restraint would be immune to boarding Zhao Youyue’s ship. Those who have already gotten addicted to the experience would have already descended into the abyss, as having fun clearly had far more meaning than studying.</p><br/><p>“Du Sensei, you are truly as transparent as glass, aren’t you! Complaining about girls in front of a girl. Shouldn’t you at least put on a mask?” Zhao Youyue smiled knowingly.</p><br/><p>Lady Zhao enjoyed giving anyone a nickname if she could help it. For instance, Han Leng was “Little Genius Han.” After a short chat with Du Hang, she had already started calling him “Du Sensei,” as he often digressed into long ramblings of logic and reasoning.</p><br/><p>Du Hang retained his usual posture of shambling lifelessly, hunched over and hands in pockets, staring at the world through the lenses of dead fish, beneath heavy eyelids. After hearing Zhao Youyue’s reply, he tilted his head slightly to look at her, only then remembering that there was indeed a girl by his side.</p><br/><p>Well, so what?</p><br/><p>Without dropping a beat, he mused, “Talking badly about girls behind their backs would be uncouth, so the lesser of two evils would be to do it to a girl upright. Not that my opinion matters much if the girl is self-conceited, right?”</p><br/><p>Zhao Youyue’s smile froze, but she could not deny the twisted logic behind Du Sensei’s false reasoning. Still, wasn’t he afraid of making an enemy out of womankind?</p><br/><p>Zhao Youyue simply had to ask.</p><br/><p>“Heh…. womankind huh…” Du Hang mumbled, “So you hate me now? If so, you can stop talking to me. Not everyone needs a companion along their side. Peace is just as welcome.”</p><br/><p>As if Du Hang had found a chance to prove his theory, he continued rambling as if wanting Zhao Youyue to hear it – but it was just borderline audible. “To me, a person is happiest when they hear what they want to hear, even if they are subconsciously aware of its half-truths. They would feel so due to the feeling of acceptance and acknowledgment, knowing that they meant something to the world. In other words, if one is able to accept themselves, then there would be no need for the acknowledgment of others. That is why lone warriors are content being the center of their own universes.”</p><br/><p>Du Hang took out his phone with glee and quickly committed his words to digital storage. He truly loved himself for being such a philosopher. He was amazing, being able to please himself without the pointless support of others. Wait, wasn’t that what Gods did? Not unless you were a Greek God, of course.</p><br/><p>Zhao Youyue studied the self-indulgent Du Sensei who had fallen into a trance-like stupor. If she had to be truthful, she would admit hating such guys. Guys who could not even be bothered pretending to be gentlemen, or at least pity anyone else. As a matter of fact, any normal girl would surely hate such guys.</p><br/><p>This was not a matter of EQ deficit. Du Hang was very much well-versed in the arts of sugarcoating. He could sweep any girl off her feet, only if he wanted to.</p><br/><p>However, that was not the true him, so he would never do such a thing. He had no need for sweet-talks, sugarcoats, no friends, regardless of gender. He would not put a mask on to get friends, even if the true him was too much of a douche to have friends. His mouth produced nothing but harsh truths.</p><br/><p>Zhao Youyue was the polar opposite. She saw through pretenses like it was glass, and could create the most elaborate smokescreens around her own pretenses…</p><br/><p>In this case, she acted accordingly by her wise, accurate judgment. She smiled and chirped, “You are kind of weird, and you love listening to yourself just a little too much, but I don’t think anybody would hate you for that.”</p><br/>\n</div>"}