{"title": "Chapter 541 - Laying Low is No Longer an Option", "id": 541, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-541-laying-low-is-no-longer-an-option", "volume_title": "Volume 6", "body": "<h1>Chapter 541 - Laying Low is No Longer an Option</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The university seemed to attempt verifying the real prettiest girl among the lot, as all the girls were made to wear the camo uniform and completely remove their makeup. Zhao Youyue, originally a side-character – suddenly became the most dazzling existence among her whole class, or rather, among all the other freshmen!</p><br/><p>This was a first, for Zhao Youyue was not deliberately attempting to stand out. However, when everyone had to put on the same clothes and when all the other girls had to abandon all their external factors, the winner was obvious!</p><br/><p>Zhao Youyue and her three roommates arrived at the field and joined their group. Other than the male students who met her yesterday, the other classmates were extremely shocked —- —-</p><br/><p>Who are you, beautiful? Are you really from the Chinese department as well?</p><br/><p>He Weiwei, who relied on her blonde hair and fashion was now almost unnoticeable in the military uniform and cap.</p><br/><p>We can only imagine how much fashion actually affected a girl’s appearance.</p><br/><p>It was also a clear indicator of how of a headstart Zhao Youyue had over the other girls in such circumstances. She had been genetically gifted, that’s all we can say. Indeed, cotton roses from clear waters are naturally beautiful[1].</p><br/><p>The current situation had made it impossible for her to be a side-character – even if she wanted to. She was a firefly in the darkness of night – absolutely eye-catching.</p><br/><p>Zhao Youyue finally realized that all eyes were on her. This genuinely surprised her a little. She had not even donned her armor of Goddess – she had not yet combed her “black, long, straight” hair out. Her goddess aura was stashed away, deep in some closet. What’s going on now?</p><br/><p>People were not blind. Beauty does not lie either. Currently, the fashionable girls had been tied down by the military uniforms, it only made the difference all the more shocking. A “precious, natural jade” like Zhao Youyue would only stand out.</p><br/><p>Her classmates were not the only ones shocked. In a short time, other departments also noticed Zhao Youyue. The Faculty of Science had gathered right beside them. Unsurprisingly, it had far more boys and very few girls. The wolves were starving, and there was little meat to go around. Not only was the meat scarce, the quality was also lacking. How frustrating!</p><br/><p>The boys from the Faculty of Science became highly envious of the boys from the Chinese Department, Foreign Language Department and such. These departments would always be filled with girls. As there was a large number of girls, chances of encountering a beauty also soared.</p><br/><p>Of course, the rare beauty still had a possibility of appearing in a small clump, albeit far lower. Most of the time, such rare beauties would also be elite scholars.</p><br/><p>The boys from the Faculty of Science grew very excited. A boy named Liu Yue had arrived at the field early. He was chatting away with his newly acquainted roommate Kong Fei while looking at girls.</p><br/><p>All boys are experts in the art of “girl gazing.” It was an act they could involve themselves in, regardless of the circumstances. They knew the perfect vantage points, the perfect timings. For example, sitting close to the tray-return station while eating at the cafeteria. Munch their food slowly like goats while waiting for girls to return their trays and tableware, watching their every action.</p><br/><p>Do it for three years in high school, and you would already be a master. Masters never stopped, even after perfection. They would hone their skills and find new heights, so why not train for the next four years in university life? Even so, they never actually went up and initiated conversations. Still, this did not deny them the right to continuing ogling. These wizards could keep honing their art for the rest of their lives, anyway. On the way to work, in the lift, on the streets, right?</p><br/><p>Fortunately, it was not illegal to look at pretty girls, or else 80% of men would already have been arrested.</p><br/><p>Before Zhao Youyue appeared, Liu Yue had been frequently bugging Kong Fei with the same question, “Brother Fei, look, look, how’s that girl? How many points on a scale of one to ten?”</p><br/><p>Kong Fei was stoic, analyticial, and reflective. His squad jaw made him seem prim, proper, and straight-laced. He gave off an “iron straight man”[2] vibe. However, this straight-laced man was currently bored. Whenever Liu Yue asked him to rate a girl, he would make no attempt at raking his eyes over the girl’s body, letting his stare linger, even. Often, he would reply, “She’s alright, not too bad. Six points, six points.”</p><br/><p>In actuality, all the girls that Liu Yue pointed out were of high quality, but they had all been weighed down by the camouflage uniform. Kong Fei’s standards were ridiculously high, so nobody in particular caught his eye. Hence, all he did was say “666”, as he was unwilling to give even 7 points to any girl.</p><br/><p>There were indeed a lot of beautiful women in the world, however, if a girl really wanted to bedazzle someone in a glance, she would have to rely on external aid, unless she had really good genes.</p><br/><p>“Holy shit! Quick! Look! A super beauty has appeared. She can definitely be called the military training goddess. Wow, I did not expect such a beauty among the freshmen! Brother Fei, rate this one!” Liu Yue excitedly patted Kong Fei’s shoulders, pointing at Zhao Youyue, who at that moment, seriously believed her incognito mode was still holding up flawlessly.</p><br/><p>It was not, and the reason was extremely simple. All the other girls were basically in their own incognito modes at that point, whether they wanted it or not. Of course a natural beauty would stand out!</p><br/><p>When Kong Fei caught sight of Zhao Youyue, his voice got caught in his throat. All he saw was an extremely beautiful girl basking in the glorious morning sun, demurely stepping towards the field. Even though she was wearing a rustic military uniform and a military cap, her beauty forced itself out of those wrappings. She did not seem confident in her appearance, so her head was slightly lowered, much to his chagrin…</p><br/><p>Even so, more and more eyes found themselves stuck to her. This may seem unrealistic, but it was really happening!</p><br/><p>Of course, Zhao Youyue did not expect such results. Why was everyone focused on a side-character like her? She was the master of disguises, wasn’t she?</p><br/><p>“Eight points, no, I might even give her nine points! She’s bloody flawless. The rustic military uniform is getting in the way, so I can only give a rough estimate. Also, her temperament is still somewhat lacking. She’s not confident enough. A real goddess would hold her head up high and walk with confidence. A real goddess would meet everyone’s gazes instead of keeping her head down. To boys who like to look at pretty girls, her actions come off as unfriendly.” Kong Fei suppressed the throbbing of his heart and fought to keep his voice level.</p><br/><p>“Brother Fei, I’ve really had enough of you. You wouldn’t give her a ten? I actually think that a beautiful jade who doesn’t even know how beautiful she is – would be perfect. She looks really gentle and considerate. If you have a girl like her as a girlfriend or wife, you’ve already succeeded in life!” Liu Yue said very excitedly.</p><br/><p>Kong Fei rolled his eyes and said, “Brother, I think it’s time for you to wake up. Do you actually believe that you can get a girl like her?”</p><br/><p>Liu Yue felt like firing back something like, “never try never know,” but he ended up sighing instead. He was not handsome, not wealthy, and he had no special talents. In High school, his results stood out among his peers. The problem was that this university made him look mediocre…</p><br/><p>Liu Yue immediately felt the despair. It was impossible for him, afterall.</p><br/><p>Translation note :</p><br/><p>[1] “Cotton roses from clear waters are naturally beautiful” (,) is a Chinese proverb.</p><br/><p>[2] “Iron straight man” () is used to describe direct, insensitive, and headstrong men who do not understand women well.</p></div>\n</div>"}