{"title": "Chapter 555 - True Feelings", "id": 555, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-555-true-feelings", "volume_title": "Volume 6", "body": "<h1>Chapter 555 - True Feelings</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Zhao Youyue had never been one to concern herself with rumors. In fact, any form of attention, negative or otherwise, would have been enough to please the past her. She had to matter to someone else if they bothered to create rumors about her, right?</p><br/><p>It comes as no surprise to us that all she needed was to reveal her identity. All rumors would self-destruct, and her accusers would promptly make themselves scarce, without trace. But Zhao Youyue loved a challenge, and an opportunity had presented itself.</p><br/><p>Zhao Youyue decided to opt for the entrapment route. She was not worried about subjecting others to cruel fates. They had it coming for them. However, there is the saying “One’s true feelings are never that easily found.” It not only applied to one’s relationship, but also their most intimate thoughts, that may not yet be known to themselves.</p><br/><p>Zhao Youyue was worried about Bai Yunshan. She had successfully applied to the student council. On top of that, she had to select the Disciplinary Department. Of course she would. Based on her personality, she would never show mercy, even if she were to draw in the hate of the world upon herself and the department. If her keen senses ever latch on to an offender, they could kiss their peaceful school life goodbye.</p><br/><p>Bai Yunshan was particularly furious with the rumors concerning Zhao Youyue faced. She remembered how she had once boycotted by others when she was younger, and how the rumors had turned her life into a living hell. Despite that, they never once let up, and she was never able to clear up the misunderstandings. All she could do back then was to live her own life and survive. She never got to understand why others had such evil thoughts. She was simply performing her duties, upholding justice. Not a single person attempted to understand her. She only got label after label smacked on her, such as “boring” “strict” “harsh” etc.</p><br/><p>Ironically, Zhao Youyue ended up comforting her friend. She was probably the only person who truly understood Bai Yunshan. She knew all too well that this one waved the flag of justice. It was the very nature of her soul, and she would remain like so for the rest of her life. For God’s sake, that woman still addressed Zhao Youyue by her full name, even though they were basically blood sisters.</p><br/><p>If it had been someone else, they would have protested.</p><br/><p>Zhao Youyue knew her, and was able to accept that wholeheartedly. On the other hand, Zhao Youyue called Bai Yunshan anything she wanted. Even Madam was okay, as she was said to be related to a high ranking military personnel.</p><br/><p>Every time when Zhao Youyue called Bai Yunshan “Madam,” Bai Yunshan would not be able to stop the image of others addressing herself like so from appearing in her mind. The more she thought about it, the more interesting the idea became. It did not seem like much, but it somehow gave her an inexplicable sense of excitement.</p><br/><p>Unlike other girls, Zhao Youyue had an easygoing personality. That, coupled with her “all-seeing eyes” gave her the insight that made it possible to get close to just about anyone. If one did not interest her, she would simply remain well-mannered and courteous. She would never deliberately seek for the destruction of another’s public image, unless it was someone like Cao Chuanguang. That man did not even care about how the world viewed him, he was already beyond saving.</p><br/><p>Stalking may be effective on some girls, but it only disgusted Zhao Youyue. She could not fathom the existence of such a person. Unfortunately, she had no reality-altering powers. Cao Chuanguang would always be the blackmailing, conniving stalker who would stop at nothing to get the girl he wants.</p><br/><p>A gentleman would know how to respect a lady. These gentlemen were now extinct. The internet had made it possible for humans to be awfully blunt with each other while suffering none of the repercussions. The world now treated good-hearted individuals poorly, and the “friendliness” was now a mockery of what it once was.</p><br/><p>This was why girls often used the line, “You are a good person” to decline a confession, making a good person seem like the evil one.</p><br/><p>Bai Yunshan finally calmed down after Zhao Youyue’s incessant comforting. However, she was still unable to accept it in her heart. She felt helpless in the face of a faceless society. They only helped conceal the origin of the rumors.</p><br/><p>So what if you actually found the source? The damage was already done. Also, that person only said that they saw Zhao Youyue entering a luxurious car, and it was nothing but the truth. It was the transitioning that twisted fact into fiction. If you were to actually convey the rumor in its current form to the originator, he would be shocked silly. The reason has made itself known to him, and it matched his witnessing! So that’s why she entered the car, I understand it now.</p><br/><p>Sigh… Girls these days. The military training had just started, but they have already fallen to such a state.</p><br/><p>In the end, Bai Yunshan could only maintain her cool and stern self, warning Zhao Youyue not to lower her guard. Rumors would usually falter in the face of truth, but they were juicier, and more interesting. Many would prefer listening to exciting fiction than boring fact.</p><br/><p>Bai Yunshan concluded that meeting with a bold closing statement. Even if the whole world were to make themselves Zhao Youyue’s enemy, she would still stand by her side.</p><br/><p>It was not long before Zhao Youyue received another series of chastising, but she knew of Bai Yunshan’s motive and her past, and took it with a smile on her face.</p><br/><p>Beneath Bai Yunshan’s cold and stern way of treating others, she was actually a real softy. She might just be too soft for the harsh, cruel world.</p><br/><p>The support from her dear friend gave her warmth in those uncomfortable moments.</p><br/><p>After that came Han Leng. At first, Han Leng had treated it like a joke, thinking that Milady had finally lost her cool and got herself a luxurious car to go back home, only to be spotted by someone else. So much for clandestine.</p><br/><p>However as time went on, he saw the rumors turning into nonsense. The “Milady took her luxurious car back home” turned into “Zhao Youyue declined to return to her dorm as she would rather be fed by a rich old man.”</p><br/><p>The female race had done little to defend itself. News of university girls being cheated on or selling their chastities away were simply too prevalent, and the public had been long convinced that university girls were dumb, gullible whores.</p><br/><p>These were most likely students of “Fake Universities.” Those female students could not even be called university ladies. They only existed to destroy the outlook of universities in the public’s view.</p><br/><p>Terms like “selling one’s virginity” or “prostitution” may be disgusting to some, but these girls still had the guts to return to school by day. How audacious!</p><br/><p>Han Leng did not believe that he would be able to restrain himself for long if this went on. Why was the Milady so calm, acting like she was not even aware of the rumor? Did she have a plan up her sleeves again?</p><br/><p>Although he had never contacted Zhao Youyue under his own accord, hiding far away from her, Han Leng could not bear to watch any longer and went and contact her regarding this issue. He was determined to protect Zhao Youyue from the upcoming onslaught.</p></div>\n</div>"}