{"title": "Chapter 566 - The Origin of", "id": 566, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-566-the-origin-of", "volume_title": "Volume 6", "body": "<h1>Chapter 566 - The Origin of</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The whole campus seemed to have become a new stage for Lady Zhao to showcase her glory. In the end, at the literary and artistic evening party, with violin in hand, she reintroduced the students to music once again!</p><br/><p>Many students who originally thought they would never be able to understand classical music such as that from violins, soon realized that they had been truly wrong about it. In the hands of Lady Zhao, the music seemed to stimulate more than hearing – it seemed to take form in their eyes, it seemed to gain smell. It surrounded them. They now understood what music that transcended language and actions was, they now understood what it was like, to resonate with music!</p><br/><p>Perhaps, initially, the only people who could achieve this would be the world-class connoisseurs of music. Hence, sometimes, classical music was “highbrow,” but Zhao Youyue, or rather Chu Luoxun, was able to make the “highbrow” music understandable to everyone who listened carefully. Thus, these people were moved by the music.</p><br/><p>This was the music of Chu Luoxun. It was not only for a tiny number of people, she had opened it up to the public!</p><br/><p>Therefore, the annual, formal evening party gained critical acclaim from many students. Some people had even bluntly claimed that the previous freshmen’s welcome party only had a “playing house” segment. Unfortunately, Lady Zhao had not been around back then. If not, they could have enjoyed her music.</p><br/><p>Of course, some nosy folk had also recorded a video of her performance at the evening party and had it uploaded onto the internet. Students who were there at her live performance rewatched the performance on video, only to comment —- —-</p><br/><p>“It feels like you’re in two totally different worlds when you’re watching the video and listening to Ah Yu perform on the spot. I used to think that those who said this were merely exaggerating. Having experienced it personally, I have now learned that Ah Yu’s live performance is truly powered by some mysterious, magical force!”</p><br/><p>“As someone in the audience who was fortunate enough to be there in person, I must say that her music is really poisonous. I obviously didn’t know what song she was playing, but I felt like I understood it. It’s like me entering a different world and personally experiencing what the music was saying. Now I know what it means to resonate with music…”</p><br/><p>“You can only look at Ah Yu’s beauty from the video. Of course, you can also lick her pair of beautiful long legs that are covered in black silk stockings. Unfortunately, those who were not at the scene missed the music that actually snuffed out her charm!”</p><br/><p>“All these guys who said they were there in person – they surely sound so iffy. I’m skeptical. By the way, why didn’t Ah Yu dress up formally? It would have made her look like a true noble!”</p><br/><p>“It was meant to be a relatively simple evening party. Unless you wanted to come with a bang, most of the performers would be dressed rather casually. They wore everyday clothes. If you dressed formally, you would probably be the odd one out?”</p><br/><p>“IwillalwayslikeLadyAhYu.jpg”</p><br/><p>“It’s such a pity. No matter high quality the recording is, it still can’t convey the deep connotation contained in my Lady’s music. I have decided. Wherever my Lady performs the next time, I would definitely choose to be there in person. Otherwise, I would have missed a segment of my life.”</p><br/><p>…</p><br/><p>Obviously, Zhao Youyue did not pay much attention to the waves she had caused. If she could not cause any ripples as a main protagonist, did she still qualify as one?</p><br/><p>Her attention began to shift to the “Two Dimensional Gate” once again. Something told her that the cooldown time of the “Two Dimensional Gate” had almost concluded. The cooldown time was so short, only because she had reaped a rather substantial harvest from the spiritual source world.</p><br/><p>The “Jane Doe Su card” was basically useless in the real world, but it would flourish in the spiritual source world. So what if these ghostly entities had no physical forms? Jane Doe Su hailed from a world where devils and monsters were rampant.</p><br/><p>It was actually unclear if the low-skilled Wuxia world or if the spiritual world had a higher energy level. On the surface, some spiritual worlds would seem to be of a low energy level. The realism was precisely why their scare factor would be so convincing. Deadly situations that seemed to offer no escape whatsoever would appear at any moment.</p><br/><p>For example, “Final Destination” could be classified as a spiritual world, but what kind of energy level did it possess? It was almost unquantifiable. The entire series demonstrated the law of nature, causation, and the like. It most definitely possessed a higher energy level than reality. It would not be inferior to the so-called high-skilled Wuxia worlds and fantasy worlds. In such a world, the powers remained on a material level – it would not make any contact with any degree of hidden laws.</p><br/><p>Zhao Youyue actually thought that the division of energy levels was rather general in the “Two Dimensional Gate.” You could never quite put your finger to it, or place them in charts or graphs. As a result, she was sometimes left confused, as she could not identify the energy level of the different worlds.</p><br/><p>In the spiritual source world, Zhao Youyue became a student in a female high school that was full of Kaidan[1]. These kinds of Kaidan were widely spread across the real world. For example, the extremely iconic “Wishing Stairs.” Many rumors of it were circulating from schools in the real world. The rumors would say things like a certain staircase somewhere in the school having only 28 steps. However, if you walked there at midnight and counted each of the steps carefully, it would become 29 steps. As long as you made a wish while standing on that one extra step, the fox spirit would grant your wish…</p><br/><p>Of course, many who did that almost successfully sought death. The spiritual source worlds were always filled with people who persistently sought death. Perhaps they could not be considered humans – but mere mental projections of dreamers from the real world. It was no surprise if people did strange things in their dreams.</p><br/><p>They would never have the guts to seek death in reality. Surely, they could do it in their dreams, right?</p><br/><p>Of course, in the eyes of the spiritual source world natives, such people were out of their minds.</p><br/><p>The female high school Zhao Youyue was attending not only had those who went to the “Wishing Stairs,” there were others who played with the “Bunshinsaba” and the “Ouija Board” every single day. They loved death so much that if denied them for a day, might just kill them from discomfort. Peeling apples in front of the mirror in the middle of the night was also an essential element. They wanted to see if Bloody Mary dared appear.</p><br/><p>Zhao Youyue really admired this gang of death-seeking people. She also wanted to thank them. If they did not like to seek death so much, she might never catch a glimpse of the real ghosts. If that was the case, it would have been impossible for her to replenish the energy of the “Two Dimensional Gate” by farming monsters to hasten the cooldown process.</p><br/><p>Indeed, Zhao Youyue could actually gain energy by cooperating with the monsters to torture the dead in the spiritual source world. Energy could also be obtained by killing monsters directly. The Jane Doe Su card had come at the right time. Otherwise, she would still have her doubts about holding her own in such a hostile world. Back then, she could only survive by transforming into a black cat.</p><br/><p>Just like that, by saving those death-seeking people in “Whispering Corridors” and killing spiritual creatures, she succeeded in replenishing the energy of the “Two Dimensional Gate.” Finally, she could activate the next world of works.</p><br/><p>Perhaps, whatever she did in the spiritual source world was also reflected in the real world. For example, the horror thriller film called “Whispering Corridors” that was released two years ago…</p><br/><p>Translation note :</p><br/><p>[1] “Kaidan” () (sometimes transliterated kwaidan) is a Japanese word consisting of two kanji:  (kai) meaning “strange, mysterious, rare, or bewitching apparition” and  (dan) meaning “talk” or “recited narrative.” In its broadest sense, Kaidan refers to any ghost story or horror story, but it has an old-fashioned ring to it that carries the connotation of Edo period Japanese folktales.</p></div>\n</div>"}