{"title": "Chapter 576 - Setting The Roles", "id": 576, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-576-setting-the-roles", "volume_title": "Volume 6", "body": "<h1>Chapter 576 - Setting The Roles</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Nobody knows why. Was it the unknown cause of death? Was it the fact that her body was never even found? Legendary actress Zhang Guorong had been dead for more than a decade, but some still wondered about her mysterious circumstances. All she left in this world were a few pictures and her past contributions to the big screen. She had been affectionately nicknamed ‘little sister’ too.</p><br/><p>That’s right. Her fans called her ‘little sister.’ She seemed to have been born with an aura of a pitiful little sister. She was also one of the few actresses whose life had remained untainted by any scandals.</p><br/><p>These were the effects of a generational gap. The paparazzi at that time were nowhere as intrusive as the paparazzi now. The print media back then was not as agile as the current digital media. You only need spend a pure and innocent night with your wife, but Weibo would turn it into some crazy porn story the next day. You would have caused a massive wave online…</p><br/><p>Zhang Guorong’s eminence came from the fact that she had used her own acting skills to claim the major film acting awards at home and abroad. She even had the nickname – ‘Thousand Faced Queen of Motion Pictures.’ However, as time passed, those awards have changed as well. The once-popular awards no longer existed. The most prestigious film acting award in China – Huaxia Golden Awards – did not exist at that time. This had denied Zhang Guorong – the ‘little sister’ who died young – the honor of this award.</p><br/><p>Most ‘Golden Awards commentators’ would look down on Zhang Guorong. Several youngsters may not have heard of her before. Unless they were those quirky youngsters who were fond of classical movies, only then would they watch the movies that had Zhang Guorong in the leading role and be awed by her performance!</p><br/><p>If these youngsters were to search for information regarding Zhang Guorong, her past would be so difficult to uncover that it was pitiful. Her biography, hobbies, early life, family life, and other details would all be non-existent. She was just like a character from a fiction novel, but we have clearly seen her face appearing in some movies before…Many fans wished that someone would write a memoir about ‘little sister’ Zhang Guorong. It would be better if they focused on her, and not the characters she played. Others had long researched those characters. Many teaching materials in drama majors included materials regarding the characters she played. Even history majors would have to learn about her characters!</p><br/><p>The mystery lay in the person. How did she live her daily life? The movies have shown that she had a thousand faces. What did her actual face look like, then?</p><br/><p>All of this had remained enshrouded in an air of mystery. This might have even increased her eminence. Someone had made a rather observant comment. Even if the paparazzi at that time were not as crazy, a popular actress in the same period as Zhang Guorong once had her personal information leaked out. Gossips and sx18 pictures regarding her still remained on the internet to date… Why was there absolutely no personal information about ‘little sister’ Zhang Guorong?</p><br/><p>Of course, where there’s a tick, there would always be a tock. They believed that the paparazzi were no less willing to take photos of her – compared to others. Zhang Guorong’s life was just too dull – she was just an ordinary person in her life. Acting was her life. She dedicated so much of her time into it that she had no time to be herself. How else would you explain her being responsible for so many iconic big screen characters in her youth? She was even known as the ‘Thousand Faced Queen of Motion Pictures.’</p><br/><p>She had qualities that female celebrities from that generation did not have. She might be an ideal actress who had the ultimate form of ‘perfect acting.’ She did not act. She transformed into different characters!</p><br/><p>These ‘little sister supporters’ were numerous. However, numbers did not amount to volume – it was a poorly accepted view that had too strong of an opposition. It was like how no one had thought of comparing Guo Jia to Zhuge Liang in the beginning. However, as time passed, many people slowly started to think that Guo Jia, the ‘God of War of the Universe’ could wipe Zhuge Liang off the face of the earth. Zhuge Liang only came out of the mountain after Guo Jia’s death. He probably knew that he was not as good as Guo Jia – You would still find proponents of this theory today.This was just like those people who believed that Nikola Tesla could have destroyed Isaac Newton and Albert Einstein. There were conspiracy theories of how he even held black technology [1] in his hands. However, it was a shame that Albert Einstein overshadowed him. If not, a black technology like a Tesla power station might even get included in the game, ‘Command &amp; Conquer: Red Alert’ [2].</p><br/><p>The Tibetan Mastiff was obviously the coolest, most loyal dog in the world. It was even cooler compared to tigers and lions. Twenty Tibetan Mastiffs could conquer the entire world!</p><br/><p>Such a strategy had greatly inspired Zhao Youyue. ‘Dying young’ would be her savior in this book. Dying created legends. The sky was the limit. Authors and artists these days who did not commit suicide would never be in the same class. Who knows, many people must have used the method of ‘becoming famous by dying!’</p><br/><p>Zhao Youyue felt that she could easily create lifelike myths about ‘little sister’ Zhang Guorong in the ‘Perfect Acting’ self-help book series. She could make up things about how she practiced her acting skills, how she became a low-key side character in her personal life, and how she never actually died, but had instead passed through the ‘Two Dimensional Gate’… If these were written in the self-help book, readers would automatically take it as a joke. It was probably a sign of respect for the legendary actress.</p><br/><p>She may be dead, but who knows, she might be living in a wonderful heaven of her own!</p><br/><p>After Zhao Youyue made adequate preparations, she finally stepped inside the ‘Two Dimensional Gate’ once again. She sent herself into one of the legendary actresses. This was a side character when standing beside the other legends. This was ‘Zhang Guorong,’ the ‘little sister.’</p><br/><p>Zeng Qinqin had not dared to scribble out a list of settings for this mysterious, legendary actress who died young. She did not appear much in the book – ‘Perfect Acting.’ This was why descriptions of Zhang Guorong were limited to the characters she had played in movies…</p><br/><p>This gave Zhao Youyue the room to add much more to her possessee. The first trait she gave Zhang Guorong was, naturally, a maxed out setting of her performance talent. As for her personal life – the more color, the better. She could not help but think about her ‘brother’ Leslie Cheung Kwok-wing [3] from another world. This might be fate. If a legend like Leslie Cheung appeared in this book, it would be a guaranteed icon. Let’s create a ‘Leslie Cheung!’</p><br/><p>The ‘brother’ in the real world was a brother who would have been embarrassed if the hotel service staff saw his portrait photo. This brother loved working out. This brother said he was better in fighting than Daffy Tong [4]. This was a brother who helped others save money. This was a brother who could not hold his liquor. This was a brother who was way too hard on himself. This was a brother who took photographs to tell of his love for his home country and compiled it into a photo album. This was a brother who treated others as if they were his own children…</p><br/><p>This was why the ‘little sister’ from the real world was so simple, sincere and cute. Of course, she had a complicated, conflicted heart and was always in despair. This was because she loved acting too much, and lost herself in her acting. Perhaps she was also Yuri-inclined…</p><br/><p>And so, we have finished setting up the legendary actress, ‘little sister’ Zhang Guorong!</p><br/><p>Translation note:</p><br/><p>[1] “Black technology” ( ) is a phrase which has its roots in the Japanese Anime Full Metal Panic, where “Black Technology” originally referred to scientific accomplishments developed by a species of “whisperers”, stealthily kept from civilians, and so advanced it’s beyond the bounds of human understanding.</p><br/><p>[2] “Command &amp; Conquer: Red Alert” () is a real-time strategy video game of the Command &amp; Conquer franchise, produced by Westwood Studios and released by Virgin Interactive Entertainment in 1996. Command &amp; Conquer: Red Alert takes place in a parallel universe. At the Trinity Site in New Mexico in 1946, Albert Einstein prepares to travel backward in spacetime. He activates his experimental time machine to find himself in Landsberg, Germany, on 20 December 1924, where he meets a young Adolf Hitler just after the latter’s release from Landsberg Prison. Following a brief conversation between the two, Einstein shakes Hitler’s hand, which erases him from the timeline.</p><br/><p>[3] “Leslie Cheung Kwok-wing” () was a Hong Kong singer, actor as well as composer. He is considered “one of the founding fathers of Cantopop” as well as a “gay icon” for achieving colossal success both in film and music career.</p><br/><p>[4] “Daffy Tang” () was the long-time partner of Leslie Chung.</p></div>\n</div>"}