{"title": "Chapter 580 - A Lifetime of Wonderful Youth", "id": 580, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-580-a-lifetime-of-wonderful-youth", "volume_title": "Volume 6", "body": "<h1>Chapter 580 - A Lifetime of Wonderful Youth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Compared to her talent, her looks were not worth mentioning. Compared to her personality, her talents were not worth mentioning.”</p><br/><p>Zhao Youyue was as thick-skinned as they came. Her version of Zhang Guorong seemed solid enough, but there was always the possibility of someone disagreeing with her.</p><br/><p>At least she died a hero—she did not live long enough to see herself become a villain, just like so many other actresses.</p><br/><p>Wang Jingwei from the other timeline had written the phrase “retracting one’s sword would cost one’s life” [2] Before his death, he would definitely have been able to become a leader of a change. Sadly he died before it could happen.</p><br/><p>Zhang Guorong died at the age of 26, with every news about her being positively perfect, and no information about her love history. It was common practice for celebrities to remain single on the surface; just to increase one’s popularity.</p><br/><p>No matter how good one looked, there was no stopping the death penalty of age from catching up. She had left the world in her best. The youngsters of her generation had been left shell-shocked, and the youngsters of this generation would know only be able to identify her as a youthful immortal.</p><br/><p>Zhao Youyue had capitalized on this. She could quietly make her exit from the world now, as Zhang Guorong’s cause of death was never certain. Even her corpse was not found, it was as if she had vanished off the face of Earth. Some thought that she was still alive. The world seemed to have taken the news of her passing as an April’s Fool joke.</p><br/><p>And so, Zhao Youyue chose to end things for Zhang Guorong by departing to another world. Zhang Guorong was already now a character in the book. Departing from that book’s world would cause her to vanish in that world – but she would be now living in another world.</p><br/><p>Readers would never buy such a death for a second. Instead, they would assume that the author was just trying to romanticize Zhang Guorong’s death and bring hope to mankind. Little did they know that on a certain day, the world-famous beauty would one day reappear in the body of another beauty.</p><br/><p>In Zhao Youyue’s world, the fictional version of Zhang Guorong was exactly as how she had been in real life. This was thanks to “Perfect Actor’s” writer, Zhen Qinqin, who got all her inspirations randomly in the midst of writing.</p><br/><p>Zhen Qinqin felt as if she had gone back to the past, overshadowed by the student-aged Zhang Guorong’s fame and beauty. However, this was not Zhang Guorong, but an actor who was known together with Zhang Guorong as the “Golden Duo.” His legs were long and slim like a woman’s. They called him Zhang Guorong’s “imouto.”</p><br/><p>He had acted as Zhang Guorong’s boyfriend in some movies before. They were practically made for each other – and many viewers thought that they had so much potential together. It was a waste that they were simply close friends. Who knows? Zhang Guorong’s friendship circle was so huge; it would be no surprise for her to have tonnes of close friends.</p><br/><p>When news of her death reached every corner, of the Earth, this famous actor was already the respected and well-known boss, Zhou Haiqing. During Zhao Guorong’s memorial service, he had broken down into an inconsolable state. This long-legged brother was truly a siscon. He had been a brother to such a perfect girl, and nothing hurt more than losing your little sister.</p><br/><p>Zhen Qinqin was highly intrigued by the long-legged brother, Zhou Haiqing. After writing, the countless images of Zhang Guorong’s “legendary life experience” had left her in a daze. She never even thought if the images had been true, but they had to be important enough to be worth mentioning. She was writing a life story of Zhang Guorong.</p><br/><p>In her mind, the purpose of writing this story without a second thought was just for Zhou Haiqing, yet unknowingly, she had fallen for Zhang Guorong. She even entered an entertainment circle to yearn for her.</p><br/><p>Of course, this was what Zhen Qinqin saw in her mind. When she finally recovered from her intoxicated state, she would be left wondering what actually got her to start writing like that. She was not even familiar with Zhang Guorong.</p><br/><p>Even so, fans would draw assumptions. Zhang Guorong was from her generation. It would not be surprising for others to believe that Zhen Qinqin had picked up her acting skills from Zhang Guorong.</p><br/><p>And so, Zhen Qinqin’s newest “Perfect Actor” experienced a successful launch. Its author promptly returned to normal. After she read through her own book, she was speechless.</p><br/><p>What the heck did she write? How did this turn into a love story between Zhang Guorong and Tang Tang? In fact, was there actually any love between the two of them?</p><br/><p>Zhen Qinqin dug around for proof while reading her own book. In the end, she gave up trying to think about it. All she could say was how some parts of the story could lead readers down a rabbit hole, like how many trusted what their WeChat friends sent to them without question, taking it as the truth.</p><br/><p>One should never look down on the intelligence of readers. Several novelists have made this mistake, and everyone was fearful of it. Now that Zhen Qinqin was her own reader, she noticed that what she wrote was, in fact, a job well done. This called for a Zhang Guorong documentary film, right?</p><br/><p>It was a pity; no other actor could act as well as Zhang Guorong – or act as Zhang Guorong when she was acting. Such requirements were too much for mere mortals.</p><br/><p>The book told of the love between the two girls. At the same time, it provided a solid insight into Zhang Guorong’s life and the motivations for her training. Although her performance may seem out of this world, nothing was too surprising because she’s a genius. Geniuses did not need conventional wisdom to gain spontaneous mastery.</p><br/><p>Zhen Qinqin sighed. It was a waste. No matter how well written her book was, no one would really buy it. It was already a good enough deal for her to not have to pay the publishing fees.</p><br/><p>Zhen Qinqin’s age group was not really fond of the internet. She could only depend on advertising companies to help. After some consideration, she decided not to go down the path. She did not write the book for personal profit – she just wanted the world to know that Zhang Guorong once walked this glorious earth.</p><br/><p>Her book was meant for those who cared to read – she should not go out of her way to do anything extra.</p><br/><p>Little did she know that free advertising for “Perfect Acting – A Lifetime Of Wonderful Youth” was on its way.</p></div>\n</div>"}