{"title": "Chapter 584 - The Biggest Winner of It All", "id": 584, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-584-the-biggest-winner-of-it-all", "volume_title": "Volume 6", "body": "<h1>Chapter 584 - The Biggest Winner of It All</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After finished reading the book, Zhou Xing felt that he had been thoroughly fascinated by “sis,” both as an actress and a person. He lamented —— Why did such a perfect actress have to die so early? This was the misfortune of misfortunes!</p><br/><p>Zhang Guorong had been written as a “Lily-type” character who was deeply in love with the strong woman, “Lady Tang Tang.” Zhou Xing did not have any qualms about that. It was a beautiful sight. No man deserved such a perfect lady.</p><br/><p>This was the typical possessive nature of a fan. When fans knew that it was impossible to claim their idols for themselves, they would hope that no other man could make that claim either. Girl on girl action? Sure, no problem! After all, true love could only exist between two of the same gender. Opposite genders? They only existed to produce the next generation of talents…</p><br/><p>Zhou Xing already regarded this self-help book as one of those Godly reads of humanity. It did not take long before he got on the internet and started recommending this book to the left and right. He even went ahead and bought the rest of the”Perfect Acting” series. Of course, he was disappointed, as those books were certainly not reading material for everyone. If one was not exposed to performance arts, they would not be able to follow. The “A Lifetime of Wonderful Youth” gave the best of both worlds. Laymen could read through Zhang Guorong’s story like any other novel, subconsciously taking in the stories as actual events; never doubting their authenticity for one moment.</p><br/><p>Many shared Zhou Xing’s sentiments. Then, this book which originally had only tens of thousands of copies started becoming popular at fast speed. Edition after edition, this book had great sales, and became the dark horse of this year. The construction of Zhang Guorong’s image within the book was even considered to have filled the empty spaces of this legendary actress without her movies. An iconic image with tremendous impression towards the readers had been successfully established.</p><br/><p>In book terms, as a character, Zhang Guorong was not interesting enough to be considered iconic, if she was a completely made-up character, that is. However, the legendary actress Zhang Guorong already had a solid fan base on her own. Zhao Youyue only needed to give it a push, and the late Zhang Guorong’s fame easily preceded the book…</p><br/><p>When the book finally came into the spotlight, Zhang Guorong’s high popularity status shot up to iconhood!</p><br/><p>This was precisely the advantage of a fictionalized portrayal. The lines between reality and fiction had been blurred. This was the fictionalized “Zhang Guorong,” but readers had been convinced that these were real-life accounts!</p><br/><p>When Zeng Qinqin saw that her book was smashing records as a bestseller, she was utterly dumbfounded. What just happened? This book that could very well have been accused of libel – had its subject still be alive!</p><br/><p>Did Zhang Guorong’s old fans actually approve of this?</p><br/><p>Zeng Qinqin truly belonged to a generation once-been. She was barely in touch with the internet. Fortunately, she still had quite some friends from the younger generation. They soon answered the questions in her mind.</p><br/><p>Apparently, a trend related to Zhang Guorong had grown viral on the internet. It actually elicited nostalgia related to her time-period. She had been treated like a Goddess, and people all over the internet were going crazy over her.</p><br/><p>In the beginning, many people only wanted to join the bandwagon for fun. Little did they expect this trend to be so substantially profound; it did not take long for an act of pretense to turn into the genuine article. Ask a passing netizen: Who was the best actress ever? – They would not even hesitate to say that it was Zhang Guorong!</p><br/><p>That person might not be able to name any other actress from the top of their head – they were not even interested in such affairs. But one name would always pop up on demand: Zhang Guorong, the name who had been blasted sky-high.</p><br/><p>This was similar to those who answered the question: Who was the most brilliant strategist during the Three Kingdoms? People would blurt out, “It was definitely Guo Jia! If Guo Jia had lived a little longer, Cao Cao might not have even lost the Battle of Red Cliff. He would have been able to unify the three kingdoms. Guo Jia died too soon!”</p><br/><p>Many often harbored a fantasy within their minds. That fantasy spoke of how things could have turned out, if Zhang Guorong had not died early. She could be a true legend; she could have claimed the Huaxia Award many times over. Sadly, before Zhang Guorong’s passing, the prestigious Huaxia award had not yet even been conceived. If not, Zhang Guorong could have been a holder of multiple Huaxia Awards and earned her spot beside legends. What was the value of posthumous awards…</p><br/><p>Anyway, due to Zhang Guorong’s insane rise to posthumous fame, those who joined the trend as a joke became genuine fans. Unsurprisingly, Zeng Qinqin’s book closely followed!</p><br/><p>Some directors won film Awards with biographies and documentaries. These directors had indicated interest in filming an adaptation of this book. Zhang Guorong would be the heroine of a Huaxia Award-capable biopic!</p><br/><p>It was a widely known fact that judges of the film academy loved biopics. Many female celebrities who had sufficient confidence in themselves were gearing up, preparing the inevitable auditions of Zhang Guorong’s role. As long as they get the role, they would undoubtedly receive the Best Actress Award.</p><br/><p>Of course, this was a tall order. It’s a Zhang Guorong-level ‘act’ception. Not only do you have act as Zhang Guorong; you had to act as Zhang Guorong acting in other roles. Her Godly Acting skills had to be given justice!</p><br/><p>Anyone who acts as her would be placing themselves under severe scrutiny. A living person would never live up to legends who had been immortalized by the public…</p><br/><p>Perfectionists and hardcore fans who regarded Zhang Guorong as the perfect actress would consider any attempt to reproduce her performances as an insult!</p><br/><p>Any actress who dared step up to the role was as good as a whore. It was true that there were still many low-key, hardworking actresses out there. Unfortunately, the scandals that plagued the industry had turned the whole thing into a whorehouse. The public had lost faith in the entire industry. They were sure that it was beyond redemption.</p><br/><p>Zeng Qinqin was a famous, experienced and greatly skilled film and drama actress. She had an excellent reputation regarding both morals and artistic values. She would never leave the copyright of this work open for the public to adapt. Although she had unintentionally fictionalized Zhang Guorong, she genuinely liked the woman. The “Zhang Guorong” within the book was like her daughter. How could she possibly leave her daughter like a lamb to the slaughter?</p><br/><p>If someone truly wanted to make a biopic based on Zhang Guorong as the heroine, the star actress must pass her harsh assessment. She would not even spare regular actresses a second glance. Even so, she was genuinely eager to being impressed; hopeful, even.</p><br/><p>With this nostalgic turn of trends, everyone had walked away as winners. Many people had one extra new Goddess that they could worship. They could quote some of her lines for an extra level of pretentiousness. The author Zeng Qinqin gained far more in terms of fame and fortune; the entertainment industry was even speaking about her once again…</p><br/><p>Of course, the biggest winner was Zhao Youyue. She gazed upon the iconic character card, “Zhang Guorong,” smiling with pleasure.</p></div>\n</div>"}