{"title": "Chapter 598 - The Most Important Thing Was That Little Sister Is Happy", "id": 598, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-598-the-most-important-thing-was-that-little-sister-is-happy", "volume_title": "Volume 6", "body": "<h1>Chapter 598 - The Most Important Thing Was That Little Sister Is Happy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>If Zhao Hao could ride out in armor, he would have done so. Ding Yuncong had nothing better to do, so he tagged along. This pair of scoundrels were very close with people within the entertainment circle. Now that their little Youyue had actually encountered a backdoor deal [1], how could they let it be?</p><br/><p>They had taken Zhao Youyue under their wing and even frequently met up with her. They considered themselves to be core components of the Zhao Family. They lived by the saying, ‘an iron-clad relationship with their sister, while girlfriends come and go’…</p><br/><p>That’s right. Zhao Hao and Ding Yuncong went through their girlfriends as rapidly as playboys went, the more, the better. Those web celebrity girlfriends were like a change of clothes. When you get tired of them, change them. The world was vast. There was no danger of running out of girls.</p><br/><p>Perhaps, some girls dreamed of becoming rich and powerful, while others were after fame and their own personal gains. After all, if they dated these boys, even momentarily, they would gain some recognition. Even if they broke up, they would be handsomely compensated. They might even walk away from this with a million-dollar mansion!</p><br/><p>In this era where money was everything, a rich boyfriend would be like a shortcut to success for an average girl. Only silly girls believed in true love and had sex with losers who stayed overnight in cheap motels.</p><br/><p>Therefore, it would even be better to learn from those business-oriented chicks who would auction off their virginity. They might even fetch up prices of up to tens of thousands! The crowd would treat that something like a rare, diamond-studded ring and bid up the price…</p><br/><p>It was their personal choice, there was no right or wrong to it. The pure would walk away with their morals intact, even earning the blessing of true love. On the other hand, some people could obtain the pleasure of material comfort. Everyone would be happy in the end.</p><br/><p>As Zhao Hao and Ding Yuncong were on the way to meet Zhao Youyue, Zhao Hao suddenly turned to Ding Yuncong, saying, “Brother Ding, why do I feel as if we have been played by Sister Youyue. How could she encounter a backdoor deal when she is so clever and quick-witted? She must have something up her sleeves!”</p><br/><p>When Ding Yuncong thought of Zhao Youyue’s sweet smile, he had to admit that his sister was precisely the kind of girl who suited his taste. Unfortunately, he was no chick magnet. Furthermore, because of Zhao Hao, he genuinely looked upon Zhao Youyue as a sister – hitting on her would be like incest.</p><br/><p>As Ding Yuncong could have any women he wanted at any time, he was content with how things were with Zhao Youyue. He was confident that the Lady felt the same.</p><br/><p>There was a particular type of girl in this world. You don’t need to have sex with her to know her better. You just had to talk to her whenever you have something on your mind, and you would be healed.</p><br/><p>Zhao Youyue was such a girl. You could not help but be close to her. You would want nothing more than to be friends with her.</p><br/><p>“Why would she play us out. Lady Zhao is giving us an opportunity to flex! She’s given us the perfect opportunity to be pretentious. We should be thankful towards Lady Zhao!” Ding Yuncong snapped jokingly.</p><br/><p>Ding Yuncong loved calling Zhao Youyue as ‘Lady Zhao’ as a joke, making him look like her chauffeur. Nobody could even imagine Ding Yuncong being in such a position. Ding Yuncong was known for his bad temper and arrogant personality. He had the character of a legendary autocratic CEO, but no one would expect him to prostrate himself in front of Zhao Youyue.</p><br/><p>Zhao Youyue’s personality accommodated his temperament like a glove. Anyways, he would always look at whether he was compatible with someone whenever he wanted to become friends with a person. As long as they were compatible, then they could be friends happily.</p><br/><p>Zhao Youyue had even grown acquainted with several celebrities in the entertainment circle through Ding Yuncong. These were not top-notch bigshot celebrities. However, there were some popular ‘upstarts’ within the group.</p><br/><p>This group of people would rush to please Lady Zhao. They knew that pleasing her meant pleasing Ding Yuncong as well. This transaction would definitely be worth it!</p><br/><p>Zhao Hao and Ding Yuncong finally met up with Zhao Youyue. They got to know about the entire story from Zhao Youyue. Neither of them were upset, as they knew that Zhao Youyue was basically untouchable. Of course, they put on a show of anger and threw tantrums on her behalf. If not, how could they show Lady Zhao that they cared about her?</p><br/><p>Zhao Hao even wanted to call the delegated investor of the movie. He had originally invested in this movie and even owned a significant share in it. Would there be a problem if his sister were to be the leading actress in the movie?</p><br/><p>“Even if the movie is a flop, my sister’s happiness comes first!” This was Zhao Hao’s attitude, much to Ding Yuncong agreement…</p><br/><p>Of course, neither of them expected to see much when it came to Zhao Youyue’s acting skills. Zhao Hao had even shot a few accusatory glances at his friend. Ding Yuncong had too many celebrity friends, which must have influenced his sister to suddenly have this bright idea of starring in a movie. If only acting was so simple…</p><br/><p>Forget it, children of the rich and powerful often mingled with the entertainment circle these days. Well, so what if the movie flops? At least Zhao Youyue would be happy!</p><br/><p>Out there, there was a certain HTC director who spent tons of resources to make so many lousy blockbuster films to hype Da Tiantian up [4]. Zhao Hao could do the same for his sister!</p><br/><p>Therefore, the casting director of the film crew, Ding Wei, got into hot lava. A nobody like him would be slaughtered like a lamb. Not long after, Zhao Youyue finally met the female director, Xue Lu. Xue Lu was not smiling.</p><br/><p>Xue Lu had never imagined Zhao Youyue to be so influential. She thought that Zhao Youyue had looked confident because she had the recommendation of the original author. She did not expect Zhao Youyue to not only have the backing of the original author, she even had investors backing her!</p><br/><p>There was no other choice. The investors ruled over the heavens. If the investor did not care about screwing up the movie because of some poorly selected casting, what could the director do?</p><br/><p>Xue Lu only hoped that Zhao Youyue had a modicum of passion in the role. She could not bring herself to like the woman, despite admitting that she had the style and aura. There was something about her that could bring the movie to life!</p><br/><p>And so, the casting for the actors of the movie ‘Beautiful April’ have been concluded. Chu Luoxun would be played by Zhao Youyue, Lin Meiyue would be played by Nie Zisu, and Gu Yuan would be played by Liu Xingxing.</p><br/><p>Translation note:</p><br/><p>[1] “Backdoor deal” () is a term typically used in the entertainment circle. This meant there are unspoken/unwritten rules that celebrities and actresses will have to abide by in order to get a movie/television role. Rules could range from giving gifts up to offering themselves to have sex with the producer or director.</p><br/><p>[2] “Fresh meat” () means young, fresh, attractive and good-looking guys who are so delicate that (girls) want to take a bite.</p><br/><p>[3] “HTC” () is a Taiwanese consumer electronics company headquartered in Xindian District, New Taipei City, Taiwan. Founded in 1997.</p><br/><p>[4] “Da Tiantian” () is a nickname for Jing Tian (), a Chinese actress who is known for her roles in war epic The Warring States (2011) and the action films Special ID and Police Story 2013 (both in 2013).</p></div>\n</div>"}