{"title": "Chapter 600 - Mysterious Powers Setting", "id": 600, "volume": 6, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-600-mysterious-powers-setting", "volume_title": "Volume 6", "body": "<h1>Chapter 600 - Mysterious Powers Setting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the course of filming ‘Beautiful April,’ Zhao Youyue had the energy to spare for other activities. After all, the fictional version Zhang Guorong was the one meting out the effort. She was the one earning the praise from cast and crew, she was a hyped up, exaggerated version of the legendary actress, ‘Zhang Guorong.’ After all, fantasies always trumped reality.</p><br/><p>As Zhao Youyue used the character card, she felt like a parasite latching onto the legendary actress. Zhao Youyue the drama queen, became more melodramatic than ever. Her previous pretentiousness may have come across as stiff and forced, but her current flashes of teeth could lull the sharpest of minds. She could not manipulate people as much as she wished…</p><br/><p>Among the things that Zhao Youyue did was to gain a firm foothold as the Assistant Department Head of the Arts Department in the Student Council. She had to maintain her excellent reputation and high popularity.</p><br/><p>Speaking of the Student Council Bai Yunshan soon got promoted to an Officer position in the Disciplinary Department. She had most enthusiastically shared the good new with Lady Zhao. Her efforts had finally been rewarded. The Department Head of the Disciplinary Department, Qiao Fei, really knew how to recognize talent!</p><br/><p>As Zhao Youyue was cooking for Bai Yunshan, she unveiled the entire picture. She told Bai Yunshan about everything that happened during the banquet. Of course, it included what Qiao Fei was really like as a person.</p><br/><p>After the innocent Bai Yunshan heard that, she felt as if someone had dunked cold water on her. She had worked so hard for the position, but it was the coattails of Zhao Youyue that finally gave her the position. If not, she might have even been kicked out of the Student Council.</p><br/><p>How did the university become such a dark and evil place!</p><br/><p>Bai Yunshan was even more speechless about the fact that she had joined the Student Council first. However, in a blink of an eye, Zhao Youyue became an Assistant Department Head of the Student Council. God damned hacker!</p><br/><p>Even though Bai Yunshan was naïve and righteous, she quickly saw the path Lady Zhao had set herself upon. Perhaps she would run for the Student Council President elections in the next semester. She would be the unprecedented first-year student climbing the throne of a Student Council President!</p><br/><p>Nobody would even dream of this happening, but Zhao Youyue was the only one who could do it!Well, who allowed Assistant Department Heads in the Student Council to qualify for the Student Council President elections. Well, no Assistant Department Head had been as unique as Zhao Youyue…</p><br/><p>Once Bai Yunshan imagined about how Zhao Youyue, a devil in human form was about to be the Student Council President, she could not help but despair about the future of this university. She felt as if she was a brave novice in an RPG. She would have to train for a year or two, farming monsters to level up before challenging the devil Zhao Youyue. But what do you do, when the final boss herself actually uses hacks and cheats!</p><br/><p>Other than the Student Council, Zhao Youyue continued pouring in her efforts on the popular racing manga, ‘Fast Track: No Limits.’</p><br/><p>With Su Li’s help, Zhao Youyue got a hold of its mangaka, Chen Daxiu who was once a truck driver. Then, she had used her drama-queen acting skills to act as if she was a loyal fan of Chen Daxiu. She had asked for his autograph and pictures. Asking to be a side character in his manga would not be a difficult thing to do.</p><br/><p>After Zhao Youyue’s meticulous analysis, she had discovered that the probability of shaping an iconic character from this work was almost zero, even if it was a highly popular manga.</p><br/><p>The reason was simple. Chen Daxiu was horrendous at creating characters. At least Rosemary [1] had some skill with his male characters! As long as Rosemary became enlightened and surmised the skill of writing female characters, then with his talent, he could easily create a classical character like ‘Yu Shengfan.’</p><br/><p>However, Chen Daxiu’s talent in drawing manga was like entirely focused on drawing cars and racing scenes. Did he need characters to keep the series afloat?</p><br/><p>All his characters were basically villains who wanted more power, more speed. When they saw the main character, they would all look down on his Wuling Hong Guang [2]. After an adrenaline-inducing racing scene, these ‘villains’ would then be totally flabbergasted. They would be totally blown away by the main character and his Wulin Hong Guang…</p><br/><p>That’s how the entire manga went. It completely depended on the artwork and car-on-car action. It was just like the Anime ‘Detective Conan’. It would come as no surprise if Conan solved the crime, but it was the process that intrigued them, not the results.</p><br/><p>In conclusion, if Chen Daxiu was a web novelist, he would be the type of writer who used the same plot in every chapter, but he did it in such a way that it would never get old. The whole novel would forever be refreshing. Why make actual characters? It was fine, as long as the readers found the novel refreshing and nice.</p><br/><p>Such writings would be a best seller. The author would reap massive gains in no time. As long as the author continued uploading chapters, it would be popular in no time. Of course, they would be nowhere as popular as the leading authors on main platforms such as Qidian, but they their novels sold, regardless…</p><br/><p>When Zhao Youyue fully understood the situation, she lost hope in her wishes of creating an iconic character. Iconic characters did not just fall out of the sky. She could bleed and cry over it, but without a competent author, she would never earn an iconic character.</p><br/><p>Zhao Youyue shrugged. She may just be able to earn herself a highly popular character card, who knows.</p><br/><p>Chen Daxiu had promised to cameo Zhao Youyue herself. The character was a Lady, with the name of ‘Zhao Xiaomei.’ This character loved watching the exciting races, and hoped to be a racer herself. She was trying to save up for her own car by carrying out nightly live streams. She hoped to one day live stream from the back of a steering wheel!</p><br/><p>After Zhao Youyue possessed this character, she did not set her racing skills to the maximum. Instead, she tactfully gave her two traits, ‘will never get into a car accident’ and ‘will be safe when street racing.’ The author would not find anything wrong with these settings.</p><br/><p>In works related to car racing, other than those expendable characters, who else would crash their cars? That racing track is on a mountain, crashing may well be fatal…</p><br/><p>Chen Daxiu would never let ‘Zhao Xiaomei’ be killed off in the manga. That would be an insult to his ‘bishoujo fan’ Zhao Youyue. She was a side character, there’s no harm giving her a line or two. No one would mind it.</p><br/><p>Let’s leave ‘Zhao Xiaomei’ as a bystander while cheering for the main character. She could live stream his race, why not? Zhang Tahai to show off. Wasn’t it the trend to livestream just about anything? Street racing would be most lucrative, wouldn’t it?</p><br/><p>In the end, miracles happened. She was supposed to be a cameo character, Zhao Xiaomei quickly usurped Zhan Tahai’s role as the main character…</p><br/><p>Translation note:</p><br/><p>[1] “Rosemary” () is the pen name of Ye Hai, author of “The Strongest King” (4th book)</p><br/><p>[2] “Wuling Hong Guang” () is a compact Multi-Purpose Vehicle (MPV) produced since September 2010 by SAIC-GM-Wuling, the joint venture of Shanghai Automotive Industry Corporation, Liuzhou Wuling Motors Co, and GM China.</p></div>\n</div>"}