{"title": "Chapter 607 - Start Your Engines!", "id": 607, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-607-start-your-engines", "volume_title": "Volume 7", "body": "<h1>Chapter 607 - Start Your Engines!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>When the live reporter Miss Jiazi saw Xia Hai pulling up, she rushed over like a fan, much to the panic of her crew. They hurriedly lugged along their hardware, hoping that Xia Hai would say a few words to the audience.</p><br/><p>…</p><br/><p>Yet, Xia Hai gave her and blank stare and blurted out, “Who are you?” Qian Xiaojia was shocked silly…</p><br/><p>In her heart, Qian Xiaojia said, “I was the beautiful reporter who previously interviewed you! How could you forget about me?!”</p><br/><p>Out of the corner of her eye, she saw her live chatstream. Many had started calling her stupid for even trying to interview Heavenly King Xia Hai. How could you disrupt the Heavenly God’s train of thought? He was ridiculously famous. Car companies actually begged for him to advertise their products. The races on this mountain may not be official, but companies actually sponsored the racers, by backdoor channels, of course. Even the audience members did not seem like ordinary folk. Just by looking at them, you would think that they would be royalty.</p><br/><p>Of course, Zhao Hao and Chen Yilong were not the only “princes” around. Some even bought their way into high-profile races, but none of them had Xia Hai’s skill.</p><br/><p>Qian Xiaojia could only tell Xia Hai that she was a fan of his. Xia Hai only shot back with a single “Oh.” Did that actually stand for, “Actually, I am face-blind, I don’t remember the faces of people I meet.”</p><br/><p>As Xia Hai and Qian Xiaojia remained locked in the awkward conversation, Chen Yilong finally approached Zhao Youyue, who he had always wanted to meet. Zhao Hao begrudgingly stepped aside and allowed the prince to politely introduce himself to Zhao Youyue.</p><br/><p>She was as beautiful as they said, but he was still in shock and awe. Did she actually know how to race?</p><br/><p>“I’m here to challenge Xia Hai. Let’s just say that I’m here to avenge my bro,” Zhao Youyue bluntly said. Driving by herself had not been enough. She desired more. She wanted an actual race against a worthy competitor.</p><br/><p>Chen Yilong was startled; the fighting spirit that bore down on him was genuine. Even so, he did not believe that Zhao Youyue had what it took to beat his boyfriend. The title “Heavenly King of the Race Tracks” was not just for show. Zhao Youyue had no place here, if not for Zhao Hao.</p><br/><p>She may be somebody in terms of music and literature, but she was a nobody on the mountain roads.</p><br/><p>“I’m riding shotgun! My sister can do this!” said Zhao Hao. He was not yet fully convinced, but he had to support his sister. If anything, he wished to be in Chen Yilong’s position – having a wicked driver take him for a full-speed run down the mountain. If he could not go that fast himself, he had no problems settling for a passenger seat view.</p><br/><p>Chen Yilong let out a dazzling smile. “Yes, you need to calm your nerves before handing victory to my Xia Hai once again.”</p><br/><p>“Nope, my sister is definitely the best!” Zhao Hao did not want to back down. His sister created miracles, and he was willing to believe in her once again.</p><br/><p>Not long after, both cars were lined up accordingly. The road was too narrow for two cars, so Xia Hai would be leading the race. All Zhao Yaoyue had to do was to keep up. It all depended on the speeds of her drifts. From her test drive, she knew that she could pull it off.</p><br/><p>Zhao Hao and Chen Yilong sat in their respective passenger seats. They were both trembling from the excitement, Zhao Hao more so. Today, he had been far too rash. The old him would never entrust his life to anyone else, let alone a female racer. Zhao Youyue had won his trust with her driving of his Lamborghini.</p><br/><p>The spectators were shocked to see a fresh female face actually going up against Xia Hai.</p><br/><p>“Who the hell is that beauty? Is she another professional under Boss Hao’s employment?”</p><br/><p>“I thought that she was Prince Zhao’s girlfriend. But she’s in the driver seat now? Are they racing for real? This is bullshit!”</p><br/><p>“What kind of racer is this? She’s not even using her own car?! Even I have my own modified scooter!”</p><br/><p>“Alright, alright, let’s bet!”</p><br/><p>“You gamble addict! This is nothing but a friendly drive! If you want to gamble, make it official!”</p><br/><p>“That’s right! Since this is just a friendly race, let’s put gambling aside! I’d like to see how the girl drives. In the end, Xia Hai is even faster than the Racing God of Mount Qilin! Challenging him is dumb!”</p><br/><p>“Damn… let’s gamble among ourselves, shall we? Well, if I can actually find someone with differing opinions – we all know who the winner is…”</p><br/><p>…</p><br/><p>At that moment, reporter Qian Xiaojia chirped to her camera, “I don’t understand what is the point of this race between the Heavenly King Xia Hai and a female driver… It’s a waste of everyone’s time.”</p><br/><p>Even so, her audience were mighty curious. Someone pointed out that the female driver actually seemed familiar, and had asked if Miss Jiazi could give her an interview.</p><br/><p>Qian Xiaojia could only laugh at herself in her heart. She had not even approached the beauty, but she knew that she was a genuine Goddess. She feared that her radiance might just blind her sight.It may just be a casual drive, but Xia Hai was still one of the drivers behind the wheel, so the cameras were all quickly set up. Drones and helicopters took to the air, and the spectators grew feverish with excitement.</p><br/><p>With the wave of the flag, Xia Hai’s pitch-black modified car and Zhao Youyue’s grey-silver modified car took off. Even so, sharper, experienced eyes flew open wide. This woman was no newbie. She’s batshit insane! That launch had been absolutely spectacular!</p><br/><p>Sadly, Xia Hai’s car was imperceptibly superior to the grey-silver machine. By the first turn, Zhao Youyue had fallen slightly behind. It was inevitable, as Chen Yilong had held nothing back regarding the modifications of the car.</p><br/><p>At that moment, Zhao Hao felt his heart leap out of his body, as the car went past 220 km/h. Alarmed and terrified, he turned to his sister, only see an animalistic, wild face. The night lights reflected off her dilated, predatory pupils. He was beginning to regret this.</p><br/><p>He should not have involved himself with the race!</p><br/><p>Zhao Hao did not dare say a word, lest he distracted her and sent them both plummeting to their deaths. He should have relieved himself before the race – he might end up wetting the seat, at this rate.</p></div>\n</div>"}