{"title": "Chapter 611 - A Still Surface Belies a Troubled Heart", "id": 611, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-611-a-still-surface-belies-a-troubled-heart", "volume_title": "Volume 7", "body": "<h1>Chapter 611 - A Still Surface Belies a Troubled Heart</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Hao’s mother should be thanking Zhao Youyue. The Lady had successfully cured Zhao Hao’s age-old hobby of underground racing. In the future, she would no longer have to worry about him getting into car accidents.</p><br/><p>Zhao Hao had vehemently denied Chen Yilong’s wishes, but he kept it in his heart. He would never sit in his sister’s car again, ever, if she decides to start racing. If there are any volunteer replacements, please, do so!</p><br/><p>Fortunately for Zhao Hao, Chen Yilong was distracted by the massive crowd that had gathered around them. They gazed at Zhao Youyue as if she was the racing messiah.</p><br/><p>Zhao Youyue had grown accustomized to crowds and being the center of attention. Rather, she embraced such attention, as befitting of a main character. What’s the point of putting so much effort into the “Two Dimensional Gate” if it did not garner her any recognition?</p><br/><p>Nevertheless, too much attention could cost her her privacy, so she took out a pair of sunglasses and put it on. The last thing her family needed was to have the internet talking about how their daughter was a supreme underground racer.</p><br/><p>After all, this did not sit well with her image. Many thought that it encouraged a blatant disregard for life. If her activities actually encouraged people into throwing their lives away, that would not be good. Mountain races were not the deadliest sport out there, but they sure as hell were not the safest.</p><br/><p>Zhao Youyue was a cheater. She was a hacker. Lady Zhao had often considered how her actions would shape society. At the end of the day, she hoped that people stayed safe and sound; unless they had cheats of their own. Let them have their adrenaline fixes from their video clips, anime, and movies about drag racing on the internet.</p><br/><p>As people started trying to take a closer look – trying to guess her identity, she had walked straight towards Zhao Hao’s Lamborghini supercar. Running away after an act of badassery was truly exciting…</p><br/><p>Zhao Hao had forced himself to sit in his own car. He was rather apprehensive of how Zhao Youyue might continue drifting in his car. He really should have taken a cab back, right?</p><br/><p>When they saw the girl who had just defeated King Xia Hai getting into a Lamborghini, the respect within their hearts only rose further up. She had to come from an impressive background. The less influential figures from the crowd started backing off.</p><br/><p>Most helpless was the famous live streamer, Qian Xiaojia – who was more perplexed than ever. In the end, she never got to interview the mysterious female racer. Her camera crew only managed to get a shot of her retreating back for a good few seconds. That noble, graceful back slew the chat room!</p><br/><p>The live stream viewers let out a collective sigh ——</p><br/><p>“As expected from a Kingslayer. Look at that imposing back, tsk tsk!”</p><br/><p>“A woman who actually drives a Lamborghini, instead of just showing off. That’s a real Lady!”</p><br/><p>“I want to see her front. I have so many questions!”</p><br/><p>“I don’t get you weirdos. What is all this talk of backs and imposing figures? It’s just the back of another person! If you want to ogle, just ogle! Don’t give me shit like how her back looks like royalty. Yea, I’m typing in royal font, so are you going to bow before me…?!”</p><br/><p>“Well, not her back per se – but that coat she has on has to be at least 58000 RMB. And her shoes. Sigh… That’s a Lady. Poverty has limited my imagination!”</p><br/><p>…</p><br/><p>On that day, Lady Jia Zi’s live stream had been tremendously successful. She had given them quality footage of a real-life “Goddess of Drift.” She had slain the new King of Mount Qilin!</p><br/><p>That’s right. That single race had been enough for the internet to call this mysterious female racer the “Goddess of Drift.” The very next day, footage of her wild drifts went viral!</p><br/><p>Readers of “Fast Track: No Limits” became extremely agitated. Some of them screamed out chants like Lady “Zhao Xiaomei” and so. Only she could be so gutsy and disgustingly fast.</p><br/><p>Nobody without a deathwish would even attempt to pull off such stunts. This woman was mocking death. How does one hit those speeds without rolling over?</p><br/><p>Some enthusiastic readers had even recommended this video to the author of “Fast Track: No Limits,” Chen Daxiu.</p><br/><p>Chen Daxiu was no slouch. He was constantly on the move, at the scene of various races to get firsthand experience of motor racing. Some awesome readers had actually matched the actual races that were the source of inspiration for some of the races in the manga.</p><br/><p>Of course, Chen Daxiu often emphasized on the most exciting part of racing – the overtakes. His renditions of them would be exaggerated, of course. After all, his manga characters were flamboyant and over-the-top. Each main character seemed to possess his or her unique technique…</p><br/><p>As a writer, Chen Daxiu was very much aware of how reality differed from fantasy. Therefore, when the readers recommended the video clip to him, he had not expected much. He had always thought that his readers often fussed over nothing.</p><br/><p>He had clicked the video lazily, not expecting much. One of the first things he noticed was that it was a rather short video, only 8 minutes or so. Even so, the view count and comments had flooded the page!</p><br/><p>He started watching the video, slightly intrigued. The beginning of the video was already flooded with comments and cheers about “worshipping the Goddess of Drift.” Fortunately, they got out of the way during the action. They simply floated at the top border of the window…</p><br/><p>When Chen Daxiu watched the cars ripping up the first bend, his heart stopped. As the author who had created the female character “Zhao Xiaomei” with his own hands, he was suddenly highly convinced that he had just witnessed the real Zhao Xiaomei in real life!</p><br/><p>If not, how else could he explain such a situation? That’s exactly how he had pictured her in his mind! That’s her trademark wild drifting!</p><br/><p>It only took a few minutes for Chen Daxiu to transition from sheer boredom to a state of utter alarm. When he saw someone spamming the name “Zhao Xiaomei” in the bullet curtain, he felt vaguely smug. How great it was to have his character be mentioned alongside such a real-life legend.</p><br/><p>This video clip had appeared at the right time. His character rode the waves and became highly popular. This was always a good thing. Also, he had to know more about this mysterious female racer…</p><br/><p>Little did he know that the biggest winner of all would be his “fan,” Lady Zhao.</p><br/><p>Zhao Youyue may not find much practical use of this card, but it was good enough for her. If she ever discovers a work that would serve her well, she could use it as a sacrifice. Obtaining a highly popular card was always good, but it would never take the place of an icon.</p>\n</div>"}