{"title": "Chapter 616 - Sisters", "id": 616, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-616-sisters", "volume_title": "Volume 7", "body": "<h1>Chapter 616 - Sisters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhao Youyue was a full-time mobile phone addict. In addition to reading novels and watching animes, she also scrolled through Weibo, forums, and various communities. Weibo was mostly filled with celebrity gossips and family affairs of various celebrities. It seemed to be the juice that the current world ran on.</p><br/><p>Zhao Youyue knew better than to ask these gnats. Even if she did, it was unlikely that she would get any serious answers. It was as good as not asking.</p><br/><p>So, she decided to go for a rather small, niche part of the web, where nobody understood what the genius inhabitants were saying. Of course, she reposted her question at Zhihu, a platform where many great talents gathered.</p><br/><p>Unfortunately, even those Zhihu talents could not get her question. Moreover, they were here to stretch their minds and intellect, not get a headache. One particular individual had even said, “Is this question even necessary? If you already have everything laid out ahead of you, be a good boy and go accordingly! As long as you fulfill everything and please everyone, you’ll gain power. Once you’re powerful enough, you can definitely do whatever you want!”</p><br/><p>Zhao Youyue found this answer too vague and straightforward. There were no specific guidelines, and it lacked subjectivity. He just wanted to sound enlightened without saying anything substantial. In ancient times, this would be the scholar who sat beside a noble, barking out a bunch of garbage that made no sense, yet gained approval and respect because people were duped into thinking that he was far too wise for them.</p><br/><p>However, a certain, specialized game strategy forum did not let her down. People on this forum loved discussing about a game called “Crusader Kings.” It was a game set in the Western Middle Ages. This was a game that would get its target players truly addicted – it knew just how to push their buttons. Pillaging and plundering were extremely enjoyable.</p><br/><p>Enter “Puerile Magician[1].” A regular of the forum and self-taught historian. Apparently, he had a Master’s degree in History from a famous university. He intended to expand his skills to the Doctorate level. These were his words. “If R&amp;D into productivity and industrialization isn’t your goal, then according to the set rules of the Western Middle Ages, you need to keep jurisprudence afloat. Everything else can be chaotic, except for jurisprudence. If there is no jurisprudence, there is no excuse for attacking other cities in the name of imperial aggrandizement and world domination.</p><br/><p>Of course, enforcing jurisprudence was a simple matter. Although “I hereby seal you, Glamorgan Count”[2] was practically a meme, it was still relevant to actual situations. First, look for someone who has the documented inheritance of a certain territory. Someone who was bound to become a Glamorgan Count. Then, get the Count to help restore the country. After the restoration of the country, the Count would be arrested, and he would be stripped of his title. Of course, he would rebel soon after. Finally, no matter how peaceful his rebellion was, both his lands and counties would be taken over by the central government…</p><br/><p>In fact, from a Chinese point of view, this so-called “jurisprudence” was called “righteousness.” If a war broke out without righteousness, the government would often be attacked en masse.</p><br/><p>Of course, a Chinese monarchy would not be worried about such a thing. Was an emperor born an emperor? One could only become an emperor with the help of a well-trained army and strong soldiers. As long as you were strong enough, no one cared if you were righteous or otherwise.</p><br/><p>Zhao Youyue felt that “Puerile Magician” had a point, but she was not going to follow him word for word. So, she looked at the methods that he actually bypassed, which was industrialization. No matter what, she had to increase productive forces. Firstly, she had to gain power over a small territory, and slowly expand her territory from there. When people came up with modern chemical weapons to poison her army, she simply had to hang on.</p><br/><p>Of course, considering that it was a world of swords and magic, magic was definitely a fundamental production source. It was best to learn magic. At the same time, she could recruit more mages to her cause.</p><br/><p>Truth be told, mages did not even exist in the “World of the Witcher.” There were sorcerers. They used the energy in their blood to cast spells. They did not learn to do this in a matter of days. This was most probably the counterpart of the “arcanist” in DND[3].</p><br/><p>The “World of the Witcher” was unique. It unlike DND. The sorcerers in the game could not beat entire armies single-handedly. There was also the presence of witch-hunters. If anyone got close to them, you could recruit them as companions. As a whole, magic was pretty common in this world. It had energy levels that were similar to that of the martial arts world, “Demi-Gods and Demi-Devils.”[4]</p><br/><p>Zhao Youyue felt as if a door had been opened up before her, its path clear and bright. First, she had to ensure that she had a solid education foundation. It was best if she got herself a “genius” title. That’s how she would quickly gain favor and benefits. Generally speaking, those of noble lineages were more likely to become “sorcerers.”</p><br/><p>Becoming a genius would be no problem for her. After all, she had the learning ability of “Xu Jing.” At the same time, she also possessed the sword skills of “Su Shi.” Even though she had no magical talent, she could rely on her swordsmanship. She could still become strong. Do not forget, that in the “World of the Witcher,” the witchers mainly relied on their swordsmanship to get through their days. Things like potions, magical symbols and such were all auxiliary.</p><br/><p>Of course, time in the source world went by very quickly, compared to the time in the real world. It was just like how one could sleep for two hours, but experience a six-hour long dream.</p><br/><p>During her infantile stages, Zhao Youyue felt as if she was playing a mobile game through the “Two Dimensional Gate.” She did not need to control Olivia personally. After three years passed, Olivia had to begin her enlightening education formally.</p><br/><p>Zhao Youyue finally got serious with the “World of the Witcher.” There, she found that in addition to the main quests, there were many more secondary quests and treasure hunts, even.</p><br/><p>Most of the main quests were related to learning, such as aristocratic etiquette, writing, history of the mainland and such. As for the treasure hunts, she would have to explore the castle of the Cintra Kingdom, her very own home. There would be much to uncover. Zhao Youyue decided to clear these quests first.</p><br/><p>First of all, her three-year-old self was already far more beautiful than her sister Cirilla. Who knows, when puberty strikes Cirilla, things might change. In that case, she might just be another ugly duckling story.</p><br/><p>Cirilla was also unpleasant to be with. Compared to the quiet, ladylike Olivia, Cirilla was like a mischevious bear cub. One might easily mistake her gender. She even dressed like a boy.</p><br/><p>Olivia was different. Although she had beautiful ashen-gray hair and glistening emerald-green eyes just like her sister, she was far more subdued. She wore nothing but cumbersome and gorgeous dresses. No matter where she stood, she would attract the attention of many, just with her good looks. Now that she had a sister to be compared with, Cirilla only became all the more unappetizing.</p><br/><p>Even so, the sisters got together very well. Ciri was very proud of her beautiful and adorable sister. Her younger sister was always really sensible. Sometimes, she even acted like an older sister who took care of her instead.</p><br/><p>Translation note :</p><br/><p>[1] Reference to a famous Bilibili uploader in China ().</p><br/><p>[2] “I hereby seal you, Glamorgan Count” () is a phrase made famous by “Puerile Magician” in one of his videos on Bilibili. Glamorgan County was famous for its curses in Europe during the Middle Ages. It was also the focus of the Middle Ages. It started off as a saying in Wales, which is used to refer to an unlucky person that has been used by someone else. A Count or Countess is a title in European countries for nobles of varying statuses but historically deemed to convey an approximate rank intermediate between the highest and lowest titles of nobility.</p><br/><p>[3] DND, short for Dungeons &amp; Dragons. Dungeons &amp; Dragons is a fantasy tabletop role-playing game originally designed by Gary Gygax and Dave Arneson. It was first published in 1974 by Tactical Studies Rules, Inc. Wizards of the Coast have been publishing the game since 1997.</p><br/><p>[4] “Demi-Gods and Demi-Devils” is a wuxia novel by Jin Yong. It was first serialized concurrently from 3 September 1963 to 27 May 1966 in the newspapers Ming Pao in Hong Kong and Nanyang Siang Pau in Singapore.</p>\n</div>"}