{"title": "Chapter 613 - Uploading a Doujinshi Novel", "id": 613, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-613-uploading-a-doujinshi-novel", "volume_title": "Volume 7", "body": "<h1>Chapter 613 - Uploading a Doujinshi Novel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In the end, He Weiwei never told Zhao Youyue about this incident. They have already been roommates for a whole semester; this bickering had already turned into He Weiwei and Yu Xuefei’s idea of friendly chatter. Perhaps Zhao Youyue was that good at teaching others. At least she got her dormitory to work in harmony, compared to the time when they all first moved in. Anyhow, it was far better than the neighboring dormitory…</p><br/><p>It was the dormitory that housed Zhong Xiaoli and Liu Dan. Daily battles occurred there. Ma Shuang, the super messy and dirty girl, was the cause of it all. They fought and quarreled over various things.</p><br/><p>Zhong Xiaoli frequently posted on the internet to complain about this. She had already opened many threads under the “My Best Roommate” category. Whenever the netizens chipped in, her mental knots would be untangled. If anything, this was good for her mental health.</p><br/><p>If Zhao Youyue stayed up to gossip with her roommates two or three days a week, it was an honor. She usually spent her nights in the “Two Dimensional Gate.” The world of works was still more exciting, compared to the real world.</p><br/><p>Even as the “Two Dimensional Gate” cooled down, she visited the supernatural source world by using the godly Altair card.</p><br/><p>Zhao Youyue has almost finished exploring the current supernatural source world. She was infuriated by how monsters treated this world like paradise. Human beings were just domesticated animals kept by the monsters. It was very much like the old Planet of the Apes. This was one of those “no solution” type of worlds, right?</p><br/><p>Such works were getting a little too rampant, even if they were not always popular. These stories would end with everyone dying, or with everyone getting trapped in an endless cycle. Audiences would always leave the hall with their hearts in knots…</p><br/><p>Zhao Youyue decided to move on to a new source world. She was almost done with the current one. She hoped that the new source world would bring her more benefits.</p><br/><p>Incidentally, when using the lower-leveled superhuman Wuxia “Su Shi” character card, Zhao Youyue found it impossible to use abilities which transcended reality, not only because of the correcting powers of the real world, but also because these abilities were absorbed by the incomplete Altair card, into her “Holopsicon”…</p><br/><p>This finally answered Zhao Youyue’s question, which was, why could she use all the abilities of her character cards, even without activating the character cards? It turned out that these abilities had been integrated into the godly Altair card!</p><br/><p>This discovery got Zhao Youyue excited all over again. The current source world was boring. Her existence was more to that of a bystander or side-character in non-fiction. She was also spending more time as the black cat than anything else…</p><br/><p>Even then, she was on her own – she could not simply trust any other black cat she encountered. Some black cats expelled evil spirits, whereas some black cats harmed others. Either way, they creeped everyone out.</p><br/><p>However, no stories actually featured a black cat as the main protagonist.</p><br/><p>As the “Holopsicon” absorbed the abilities of the super character cards, its energy levels would also be replenished. Then, the Altair card would once again be able to tap into the “Two Dimensional Gate” and open a stable passage to a new source world. Energy could then be harvested from the new source world and replenish her character cards and the Two Dimensional Gate.</p><br/><p>Additionally, doujinshis related to Altair were still very prevalent. None of them have really picked up, but the trend was still going strong. Who knows, a genius might suddenly have a eureka moment and create “Re:Creators”…</p><br/><p>Moreover, in the supernatural source world, Zhao Youyue managed to get some interesting insight from a monster that she had befriended. There was this “Transcendent Monster” roaming about, capturing “testers” from other worlds and releasing them into this monster world. This was done to give these “testers” another chance. Of course, when it came to this world, they were basically as good as dead.</p><br/><p>When Zhao Youyue heard this, she was shocked. This was definitely how people got themselves trapped in an endless cycle. After all, the supernatural source world was where the scenes of those iconic horror movies came from. Those monsters were clearly working for the “Transcendent Monster,” or rather, their god. If these monsters could get some extra income, why not?</p><br/><p>Even after exploring the supernatural source world for so long, Zhao Youyue had never met a “tester,” or rather, should they be called “endless cycle team members”? It was a pity.</p><br/><p>She could totally work for the “Transcendent Monster” as well. She made a terrific black cat. Her Youyue Meow was neutral in alignment. When she was happy, she would kill some monsters. When she was bored, she would capture some random people… these people weren’t real. They were simply mental projections of real-life dreamers. If they died in this world, they would only wake up from their nightmares.</p><br/><p>Zhao Youyue wrote an “Altair” doujinshi by herself. It was titled “Altair’s Supernatural World Tour,” and she published it on the Qidian Chinese website. Of course, she used a sub account. Her pen name was “Foodie that Loves to Eat Books.”</p><br/><p>The Qidian Chinese website no longer had a doujinshi section. There was the rather derelict 2D category. The only genre that set off there would be doujinshis of extremely popular animes and transmigration isekai works. One of the genre’s leading title would be “Shift! The Female Elite Scholar.” It was newly released, but it had managed to appear on the first page of the new books list, messing up the status quo!</p><br/><p>This book’s author was “Drunk for Her.” Of course, Zhao Youyue knew nothing about this man. Little did she remember that this trash of a man had once gone so far as to recommend his own work to “Tycoon Youyue”…</p><br/><p>Obviously, Lady Zhao would not pay any attention to such a trashy author.</p><br/><p>Zhao Youyue’s doujinshi was not destined to pick up speed. It was by no means badly written. She had written it with the “Wen Qingyu” card, and she had completely reproduced every sensation she experienced from the supernatural source worlds.</p><br/><p>Wen Qingyu’s writing was excellent. It was not convoluted and gorgeous like Han Leng’s, nor as effortlessly philosophical as Du Hang’s. It was concise and realistic. Reading it would throw a person straight into its pages.</p><br/><p>If anyone ever wrote erotica in such a manner, they would be a supreme god. They could start off entire cults on their own.</p><br/><p>Unfortunately, Wen Qingyu had her sights on higher grounds. In Shi Jingnian’s novel “Bakuman,” she only wrote books for hardcopy publication.</p><br/><p>These days, everyone wanted nothing but fast-food reading. The age of physical books was dead.</p>\n</div>"}