{"title": "Chapter 629 - Warmth", "id": 629, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-629-warmth", "volume_title": "Volume 7", "body": "<h1>Chapter 629 - Warmth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>As the saying goes, “you can never predict the future.”</p><br/><p>Geralt had lost count of the times he had pictured his first meeting with the “Destined Child’ Cirilla. In such a vast world, meetings that came and went were as fleeting as the change of wind.</p><br/><p>No matter what it was, being a princess would always be better than following him in the path of a Witcher…</p><br/><p>Geralt did not expect to be at the end of a whip in his first meeting with Cirilla. What kinky turn of events was this?</p><br/><p>The legendary witcher rolled out of the way, evading the lash. Cirilla did not follow up, but instead, swiftly dismounted and took her sister in her arms. Based on the warmth in her face, it was clear that she only wanted to protect her sister.</p><br/><p>At that moment, Geralt really wanted nothing more than to thank Olivia. If it was not for Olivia explaining everything that had just happened, going so far as even to push all the credit to Geralt, Geralt would have been ripped to shreds by Cirillia’s entourage.</p><br/><p>Geralt was a highly competent swordsman, but he would not stand a chance against an entire squadron of knights. Once he was surrounded, it was game over for him.</p><br/><p>This was not a world where single men leveled entire countries.</p><br/><p>Although she now had a clearer understanding of things, Cerilla still remained on guard. She may not have noticed it yet, but her long years with her sister had developed a fierce sense of possession over her sister that could almost be classified as yandere.</p><br/><p>As he saw that Cirilla was living well in Cintra, and had everything laid out neatly for her, he decided not to invoke the Law of Surprise.</p><br/><p>He had an audience with Calanthe and promptly left without bringing Cirilla along with him.</p><br/><p>Geralt was more selfless than one could imagine. He did not wish for Cirilla to go through the tiring and bitter days that he did.</p><br/><p>For a long time, he did not approach Cirilla, but he instead got to know more about her sister, Olivia.</p><br/><p>Was this because of Olivia being a loli sorceress? Geralt could not stop thinking about it. For some reason, throughout his lifetime, he had attracted numerous sorceresses to his side.</p><br/><p>In Olivia’s case, she had gotten him addicted to the role of being a stay-at-home dad. He even wondered if the Law of Surprise had chosen wrongly. If not for that, Cirilla would not be treating him so coldly, and Olivia would not be treating him the other way around, even if she always said “I hate you.”</p><br/><p>As Geralt took his leave, Olivia had brought him for a quick stop at her alchemy lab. It had been left behind by Vilgefortz and Lydia. In a way, we could say that Olivia had inherited the lab from them.</p><br/><p>Under Geralt’s curious gaze, she decided to show him how to prepare the Foglet Dedoction. She showed him each of the steps and even let him synthesis his own samples.</p><br/><p>Geralt worked slowly – his mind was occupied with too many thoughts. He could not stop himself from praising this young genius. Alchemists would have to spend entire lifetimes attaining her level of skill.</p><br/><p>Geralt knew a bit about alchemy, as there were a few essentials that he constantly used in his career such as the night vision-enabling “Cat Water,” and also, the “Killer Whale” which could be used to increase ones’ lung capacity in the water. Even so, he could not be considered a professional alchemist, which was why he preferred consulting actual alchemists to create for more complicated potions for him.</p><br/><p>Being a Witcher was no easy task. All year round, they had to risk their lives killing monsters for a living, yet all their earnings would mostly be used in preparation for their next trip. What’s worse was that some clients would swindle them of their rewards and instead, start a riot to chase the witcher out of town.</p><br/><p>“Decisive” witcher like the members of the infamous cat clan would not hesitate to slaughter entire villages under cover of dark nights. For what reason? They were merely displeased.</p><br/><p>Villagers had the numbers on their side. The most skilled witchers could be brought down by a single stab to the back.</p><br/><p>Geralt had met many professional alchemists. He could tell at a glance that the little princess was no amateur. He had even considered consulting her on a regular basis.</p><br/><p>Actually, Olivia was working on some form of partial autopilot, courtesy of her game system.</p><br/><p>She thought that she looked very cool at that moment, possessing the qualities of a medieval age witch. After some time, the system reminded her that the Foglet Dedoction was complete.</p><br/><p>The system informed her that monster hunters favored this potion. The potion itself was highly potent, and granted the person who drank a 25% boost to their magic power, if it did not kill them first.</p><br/><p>“Uncle White Wolf, by my name Princess Olivia, I shall give you this potion as a parting gift!” Olivia placed both hands on her hip with style as she jerked her head in the direction of the concoction.</p><br/><p>Geralt could only look in awe at the electric-blue liquid. Based on his years of experience, this was an extremely successful sample. Such potions could not even be found in the market. Some greedy alchemists might put them up at ridiculous prices. Rather than profiting from it, they would only earn the envy and ire of many others.</p><br/><p>He was shocked that Princess Olivia would willingly part with such a valuable potion, gifting it to him!</p><br/><p>The hundred-year-old Geralt was touched. The world he lived in was extremely dire and harsh. They were monster-slayers, but they were often treated as monsters themselves. This was their cruel reality. From being scorned at, to having to buy everything at a higher price, they took the short end of every stick in life.</p><br/><p>In this cold world, what could possibly warm him up? Love? Friendship? As of now, it was this caring princess that provided him the warmth he needed.</p><br/><p>Geralt did not throw up a melodramatic fit or anything of that sort. He was a guy who looked cold from the outside, but was a softy on the inside. He silently stowed away the potion as Olivia scoffed, “Uncle White Wolf, don’t misunderstand! I did not give you that potion because I was worried about you or anything! You were too poor and I pitied you! That’s all!”</p><br/><p>Geralt smiled knowingly as he lightly patted the princess’ head and turned around. He might not see her for a while, but he had no choice.</p><br/><p>Casandre had looked on worried as Geralt gave her some bad news. The Nilfgaardian Nation from the South under the leadership of King Emhyr had started to gain strength, and it might not be long before they start moving North, with one of their targets being Cintra.</p></div>\n</div>"}