{"title": "Chapter 623 - Maximum Usefulness", "id": 623, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-623-maximum-usefulness", "volume_title": "Volume 7", "body": "<h1>Chapter 623 - Maximum Usefulness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Time went back to the moment where news of the shipwreck involving the Princess of Cintra and her husband spread like wildfire. Obviously, someone had to bear the blame for such a disaster.</p><br/><p>Cintra’s Queen Calanthe, the grandmother of Olivia and Cirilla, was enraged. She had asked the clan chieftains of the Skellige Isles as to whether they were doing their job. This group of clan chieftains had boasted that they were islanders who could control the storm. As a result, her only daughter had died in a shipwreck?</p><br/><p>She did not care much about Duny’s death. She had always disliked her son-in-law. Originally, she had asked the Witcher, Geralt of Rivia [1], to remove the hedgehog-like monster ‘Duny.’ In the end, Geralt had asked the renowned druid, Ermion [2] to help him remove Duny’s curse. Duny and Pavetta [3] then married soonafter.</p><br/><p>The clan chieftains of the Skellige Isles finally found someone to be the black sheep. Crach an Craite [4], the designated scapegoat, courtesy of Emhyr var Emreis. [5] Either way, King Bran Tuirseach [6] viewed Crach highly, and had placed the Princess of Cintra’s family under his care. Well, too bad, the responsibility of the shipwreck is all on you!</p><br/><p>A barbarian like Crach who spoke with his fists was at a loss of words. He could only offer his life as an expression of regret to Queen Calanthe. This was not just for show. If ‘bearing a birch [7] to offer a humble apology’ existed in this world, then he would definitely go and ask for it from the Kingdom of Cintra. After that, he would beg Queen Calanthe to kill him…</p><br/><p>However, this was impossible. After all, Crach was the nephew of Queen Calanthe’s second husband, Eist Tuirseach. King Bran Tuirseach viewed him highly, and he was even a contender for the throne of Skellige. How could Queen Calanthe kill him in a fit of rage? She had to think about the political consequences of this!</p><br/><p>The friendly relationship between the Kingdom of Cintra and the Skellige Isles was affected by this incident. Talks and inquiries soon ceased.</p><br/><p>The clan chieftains of the Skellige Isles were quite proficient at finding a scapegoat. In the end, Crach’s only ‘punishment’ could not even be considered a punishment.</p><br/><p>However, the righteous and brash Crach could not move past his guilt. He swore to get to the bottom of the matter!</p><br/><p>Crach saw the pair of adorable, now orphaned sisters, Olivia and Cirilla stranded in the Skellige Isles. He gathered all of the clan chieftains of the Skellige Isles. Then, he made a promise in the name of his family, to try his best to help Olivia and Cirilla. If they were willing, he was even ready to take them in as his goddaughters. This meant that they had the right to succeed the throne of the Skellige Isles.</p><br/><p>Of course, as they were the granddaughters of Eist Tuirseach who was the brother of King Bran Tuirseach, they had the right of the throne of the Skellige Isles. Obviously, the line of succession would be longer when Crach became the King of the Skellige Isles. For instance, the children of Crach, Hjalmar, and Ceyrs, would be the first in line to the throne.</p><br/><p>Cirilla was not interested in becoming the goddaughter of Crach. She did not understand why she had to fight for the throne of the Skellige Isles with Hjalmar and Cerys if she came Crach’s daughter. In reality, she was not even keen on such positions.</p><br/><p>On the other hand, Olivia received a mission from the system, which was to obtain the title. If she became the Queen in the future, it would be perfectly justifiable for her to rule over the Skellige Isles.</p><br/><p>Which was why to others, the ‘weak and delicate’ Olivia who cried every single day after her parents died had somehow found an adoptive father that could be taken advantage of…</p><br/><p>Her acting skills proved to be very useful. Of course, Olivia was not really saddened over her parents’ deaths. They barely acted like it. Instead, she was more worried about Lydia, her doting teacher.</p><br/><p>Lydia was under Vilgefortz’s protection [8] as she was his assistant and personal secretary. She did not have to worry about her safety.</p><br/><p>How could Olivia, the drama queen, be indifferent about her parents’ death? This was not in line with her usual appearance!</p><br/><p>What was her usual appearance?</p><br/><p>The appearance of the perfect princess, of course. She was beautiful, delicate and charming, and she triggered the protective instincts of those around her. She was thoughtful, kind and filial. This was why she had wept every single day over her parents’ deaths, constantly asking to see them.</p><br/><p>Most amusingly, she had never been close to them when they were alive. She was closer to her sister, Cirilla…</p><br/><p>If she was older, such acting might be seen through by others. However, she was just four years old now. There was no nominal age in this world, and everyone’s age was based on their actual age.</p><br/><p>A four-year-old becoming heartbroken over her parents’ deaths seemed normal, did it not?</p><br/><p>Cirilla decided to stay strong for her sister’s sake. Both of them would have to rely on each other in the future…</p><br/><p>Cirilla became increasingly protective over her little sister. She even felt that she finally understood what it was like to be the older sister. Prior to this, her little sister had been the one who had cared for her. It was finally time for the roles to take their designated places.</p><br/><p>No one was suspicious about the ‘heartbroken’ Olivia who was ‘in tears’ getting a new adoptive father. Crach treated his newly adopted daughter as his real daughter. It seemed as if he was trying to repay her to the best of his power!</p><br/><p>Even though Cirilla did not want a new adoptive father, her calm and strength in the face of her parents’ deaths and her caring for her sister gained the acknowledgment of many people. Of course, at the same time, some thought that Princess Cirilla was a little too cold-blooded. She had it going for her in life!</p><br/><p>If those brainless side characters were after the position of power, they definitely would not want her to stay. In reality, they simply did not know that Olivia, who had learned a wealth of knowledge from Vilgefortz within the short period of a year was the true threat.</p><br/><p>She had utilized her parents’ deaths to her benefit, which fully lived up to the saying of, ‘the child who cries would get milk.’ This had even deepened the bond between Olivia and Cirilla. Other than Emhyr, Olivia was the biggest winner of this ‘loss!’</p><br/><p>Since she was a long-time disciple of Vilgefortz, she knew that Vilgefortz thought highly of Cirilla. Cirilla was most definitely a main character – her fate had already been laid out before her!</p><br/><p>She should continue sticking closely to this main character!</p><br/><p>Little did she know that while Cirilla cuddled her sister to sleep every night, she had sworn in her heart to protect her sister’s life!</p><br/><p>Translation note:</p><br/><p>[1] “Geralt of Rivia” () is a witcher and the main protagonist of the Witcher series. Like all witchers, Geralt is a monster hunter for hire. He possesses superhuman abilities and is a master swordsman.</p><br/><p>[2] “Ermion” () Ermion is a Character/NPC in The Witcher 3: Wild Hunt.</p><br/><p>[3] “Pavetta” was the granddaughter of Queen Adalia and daughter of Queen Calanthe and King Roegner of Ebbing. She was a Source and the mother of Ciri.</p><br/><p>[4] “Crach an Craite” () also known as Sea Boar (Elder Speech: Tirth ys Muire) and the Wild Boar of the Sea, was a nephew of King Bran Tuirseach of Skellige and was mentored by Eist Tuirseach, his other uncle.</p><br/><p>[5] “Emhyr var Emreis” () was the Imperator of the Nilfgaardian Empire, Lord of Metinna, Ebbing, Gemmera, Sovereign of Nazair, Vicovaro and, after marrying Cirilla, King of Cintra, from 1257 when he overthrew the Usurper who murdered his father, Fergus var Emreis, until his death sometime in the late 13th century.</p><br/><p>[6] “King Bran Tuirseach” () was a monarch of Skellige, the maternal uncle of Crach an Craite and the brother of Eist Tuirseach, with whom he had a friendly relationship and who led his army as Jarl of Skellige.</p><br/><p>[7] “Birch” is a formal punishment in which a person is flogged with a bundle of birch twigs.</p><br/><p>[8] “Vilgefortz” () was a mage and a member of the Chapter of Sorcerers, described by Yennefer as “young” (which, among mages, meant “up to one hundred years”), but “incredibly talented”.</p></div>\n</div>"}