{"title": "Chapter 633 - Marrying Is Never An Option", "id": 633, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-633-marrying-is-never-an-option", "volume_title": "Volume 7", "body": "<h1>Chapter 633 - Marrying Is Never An Option</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>For once, Cirilla or Hjalmar shared a mutual sentiment. Panic and disgust. They may be highly skilled, powerful kids who could beat adults into submission, they were still kids.</p><br/><p>Be it the Ancient China or the Western Middle Ages, the higher up a girl’s position was, the more she would be unable to decide for her own marriage and soulmate. Nobles considered themselves to be the superior, race. Their marriages had to be arranged to perfection.</p><br/><p>The “Lioness of Cintra” Queen Calanthe saw the severity of the situation —— The great army of Nilfgaardian Empire in the South was moving.</p><br/><p>As Queen Calanthe roused the Kingdom of Cintra to arms, she hoped to get the Kingdom of Verden by her side.</p><br/><p>As the current king of the Kingdom of Verden was an absolute coward, he would definitely prostrate himself beneath the iron heel of Nilfgaardian Empire, and turn against her. She had no choice but to bring this Kingdom to her side by marriage. At least that Prince Kistrin was twice the man.</p><br/><p>As Cirilla and Hjalmar ran circles around the room, the youngest child, Olivia remained calm. She certainly would never marry this Prince Kistrin who she had never met before, no matter how he was.</p><br/><p>“Sister, we should be going back. We can’t make granny angry.”</p><br/><p>Olivia’s personality flipped over once again, thanks to her acting skills. She was unwilling to comply, but she was trying to set an example and “look at the big picture.” This suited her perfect princess image, as if she was a helpless girl who had resigned herself to adversity.</p><br/><p>However, contrary to what was expected, her “unwillingness” was almost instantly seen through by Cirilla and Hjalmar…</p><br/><p>Of course, the hacker Olivia was rather calm. She already had the means of surviving on her own. She could even choose to walk away. The only problem was her age – it would be far too unrealistic to lead armies and conquer kingdoms as a little girl.</p><br/><p>She intended to maintain her low profile. If possible, she wanted to go to the aforementioned “Aretuza” that Lydia often spoke about. When she was of sufficient age, she would build up a citadel. Then, she would use her knowledge of the modern world and science, combined with her potent magic to conquer the entire world. As a person who loved online literature, she had once read a book, “Release That Witch.” She knew very well what power a combination of magic and science held…</p><br/><p>Of course, Olivia was not planning to rely on the strength of a man. Even if she learns that Emperor Emhyr was her adopted father, she would never inherit his throne. Not that way. She would conquer his kingdom her way!</p><br/><p>If one was not a hacker or a cheater, it would be a ludicrous prospect. For Lady Olivia Zhao, it would be a fun challenge. Who knows what the Two-Dimensional Gate would gain from this.</p><br/><p>“I won’t let you marry anyone else. I’ll go meet my dad right now and tell him that we truly love each other. We must get engaged!” said Hjalmar. He bolted upright and rushed out.</p><br/><p>Alright. Apparently, Hjalmar had been taking advantage of the situation. His wounds had long recovered; he was only pretending to be wounded.</p><br/><p>But he did not understand the entire picture. Originally, Olivia had intended to give him the friendzone card. Cirila’s entrance had made it unnecessary.</p><br/><p>Well, not like she needed to reject him anyway. Be it Queen Calathe or Crach an Craite, they would never agree to Hjalmar’s marriage with Olivia.</p><br/><p>We need not even speculate the Queen’s reasons. On the other hand, Crach an Craite considered Olivia as his own daughter. Biologically related or otherwise, they were still brother and sister. Besides, it was more practical for Hjalmar to get married to the daughter of other seigniors on the Skellige Isles.</p><br/><p>Free love was a fallacy in this era.</p><br/><p>As Hjalmar ran through the halls, he had practically announced to everyone present that he had fallen in love with the “Northland Pearl.” In the end, he had only turned himself into a joke.</p><br/><p>Of course, this love was one-sided. His natural charm and near-insane confidence had made him thought so —— His heart was already hers – unconditionally. When he was wounded, Olivia had taken care of him in every possible way. She must have loved him deeply as well. Her actions spoke for themselves – he did not need to hear from her!</p><br/><p>But right now, Hjalmar stood at that famous port of the Skellige Isles like a man who had lost his soul. He gazed at the retreating ship, hollow and alone…</p><br/><p>The sun met the ocean. The port was as beautiful as always. The waves caressed the shore. The submerged sun had turned the water into liquid gold The breeze that carried the familiar scent of salt and fish brought him no comfort.</p><br/><p>His first love had sailed away in the wind. Just like that. When he meets Princess Olivia again, she might already be married to someone else as a wife. Oh, how he wanted to commandeer a war vessel and reclaim his love!</p><br/><p>It was as if Hjalmar had grown up within a single night. Perhaps this was how men were. It took a severe blow to their hearts to turn from boys to men.</p><br/><p>He would rather break all the bones in his limbs than experience this excruciating pain!</p><br/><p>As Hjalmar clutched his searing heart, Olivia read through her available quests at leisure. She was simply completing a sidequest : Nurse Hjalmar back to health. At the same time, she was making up for the trouble that Cirilla had caused while increasing Skellige Isles’ favorability.</p><br/><p>She did not expect silly Hjalmar to fall head over heels for her. It had been such an awkward situation.</p><br/><p>Olivia did not want to marry Prince Kistrin, no less than she did not want stupid Hjalmar. He was indeed a good and honest man, and he was rather charming. He was just as noble as his father. She had also felt his sincere affection for her. If she truly married him, she could mold Hjalmar into the best husband in the world…</p><br/><p>Unfortunately, she did not love him. Love and marriage should never be forced. Also, Olivia was far too ambitious. No man could accommodate her ambition. No man would ever understand her.</p><br/><p>Be it the source world, or reality, she was too much for any man.</p><br/><p>She was different, like nuclear-powered, colorful fireworks.</p></div>\n</div>"}