{"title": "Chapter 636 - Let's Elope", "id": 636, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-636-lets-elope", "volume_title": "Volume 7", "body": "<h1>Chapter 636 - Let's Elope</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was no longer the sea where no one could contain them anymore, but the Kingdom of Cintra, under the ruling of the decisive Queen Calathe. If Queen Calathe discovered their unrequited, homosexual love, how would they end up?</p><br/><p>Cirilla did not even dare imagine it. Then, only did she realize how intellectual her sister was…</p><br/><p>Of course, she knew that her sister had been defeated. She had resigned herself to her fate. She had taken the advantage to offer her everything she had to her before this forced marriage. The ship had been the ideal private refuge for the two of them.</p><br/><p>Cirilla could see how unwilling her sister was. She decided to make some plans. She was certain that her sister would agree to it – it was exactly what she wanted.</p><br/><p>It was time to investigate this Prince Kistrin. She wanted to know which part of him had caught her maternal grandmother’s eye.</p><br/><p>Cirilla did not know much about the concept of alliance marriage. She only knew that she despised it. Could marriage actually unite two kingdoms together? Would they go to war after a divorce?</p><br/><p>Alliance marriages were effective, but they were more cosmetic than anything. It only provided rulers with a form of mental comfort. When the interests of the kingdom were placed ahead of everything, alliance marriages would appear pale and weak.</p><br/><p>Olivia bowed before her maternal grandmother, Queen Calathe. Esterad Thyssen was the king. Queen Calathe was the one who truly ruled over the Kingdom of Cintra. Ester was just a puppet.</p><br/><p>In this era, Queen Calathe was undoubtedly an excellent ruler. She governed the Kingdom of Cintra in perfect order. All seigniors within the kingdom obeyed her. After they heard that Queen Calathe intended to stand against Nilfgaardian Empire, they seemed to rally to her cause. They had called up soldiers and marched towards her castle. When Queen Calathe gave the order, they would charge into battle.</p><br/><p>Of course, Queen Calathe would definitely choose to lead the soldiers in person. King Ester would tag along. The two of them were powerhouses. After all, King Ester was a man from Skellige Isles, and Skellige Isles produced no cowards.</p><br/><p>Queen Calathe was an iron of a woman. She had made things official, donning a crown atop her head. When she saw Cirilla and Olivia, she took them both into her embrace. For the sake of appearances, she had to appear unbiased and fair. Obviously, that was not the case.</p><br/><p>During her ten-year-old birthday banquet, Cirilla had been taught more about the so-called “kingcraft.” On the other hand, Olivia was allowed to spend her time freely, as long as she maintained her appearance as a Lady, obeyed aristocratic etiquette, and be the nice vase she was.</p><br/><p>Of course, this freedom was well-accepted by Olivia. She was not interested in this outdated form of “kingcraft.” She would rather study magic and alchemy in private. She would rather draw and paint pictures, than be favored by Queen Calathe.</p><br/><p>In Olivia’s opinion, the Kingdom of Cintra had no future. Its current prosperous state was at the brink of collapse.</p><br/><p>Olivia had studied the geographic location of the Kingdom of Cintra at length. It lay on a flat, open ground that was susceptible to enemy attack. In Three Kingdom terms, it would be like Jing Zhou, a place where all the three kingdoms met in combat. As long as they managed to seize this land, it would be a powerful stronghold, capaable of attacking and defending with its favorable terrain.</p><br/><p>Therefore, in order to ensure the safety of the Kingdom of Cintra, they had to search for a reliable comrade, not develop on its own in silence. Her stubborn, decisive maternal grandmother had chosen the opposite. As a result, not only did their kingdom had a tepid relationship with the many other kingdoms which belonged to the Northern realm as well, it had even stirred the Nilfgaardian Empire into action.</p><br/><p>The great Emperor Emhyr considered making the Kingdom of Cintra the starting point of his Northern realm campaign. He would use brute force to run this debacle to the ground.</p><br/><p>Therefore, a last-minute alliance marriage was meaningless. The Kingdom of Verden paled in comparison to the Kingdom of Cintra. How then, could two dogs defeat a lion?</p><br/><p>If they wanted to actually withstand the attack by Nilfgaardian Empire, they would have to unite the entire Northern realm.</p><br/><p>The only thing that Olivia regretted was the fact that she would have to wander aimlessly for a period of time. Based on her current age and strength, she would be unable to take control of the situation at all.</p><br/><p>If Queen Calathe was not the stubborn decisive ruler that she was, she might have been able to rely on her title as a “Genius” and slowly inject some suggestions to Queen Calathe about reformation, using the Kingdom of Cintra as an experiment.</p><br/><p>Unfortunately, through the “character information bar” of the game’s system, and Queen Calathe’s behavior, she saw the futility of talking to her. She was not going to waste energy on this.</p><br/><p>Olivia was not loyal to any one continent. She was a neutral entity, like she had been in the supernatural genre source world. She was an onlooker once again.</p><br/><p>The only person that Olivia cared about was most probably her elder sister, Cirilla. Of course, within her eyes, Cirilla was just her elder sister by name, but she was actually her younger sister – her daughter…</p><br/><p>With the kingdom marching to certain doom, she could only protect Cirilla.</p><br/><p>While Olivia’s mind raced about, she had most certainly deceived everyone into thinking that she had fully accepted her fate. Even Queen Calathe was treating Olivia somewhat kindly. This was probably her idea of compensation. Olivia was still obedient, reasonable, considerate about the overall situation, and most of all, understood the need to contribute for her motherland. But at that moment, Cirilla made her move.</p><br/><p>Queen Calathe believed that “weak” Olivia would never even dream of going against the marriage. She gave Olivia the luxury of freedom for now. She deserved that much. As a result, Cirilla took advantage of the opportunity.</p><br/><p>Cirilla had done some investigation of her own, if you could put it that way. She had merely snooped around, listening to rumors. She soon learned that the Prince Kistrin was a fat, ugly and stupid guy who reeked of bad breath. He was just some fatty ugly guy!</p><br/><p>After rumors about the engagement between the lucky guy Prince Kistrin and the “Northland Pearl” Olivia had spread out, Prince Kistrin had been under a heavy lashing of words…</p><br/><p>Well, no matter who Prince Kistrin was, he did not stand a chance against Olivia. Olivia had absolute power over her own destiny.</p><br/><p>“Olivia, you already know how disgusting Prince Kistrin is, don’t you? Let’s get out of here!” Cirilla held her sister’s soft little hand and said firmly.</p></div>\n</div>"}