{"title": "Chapter 648 - Finally Became A Father", "id": 648, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-648-finally-became-a-father", "volume_title": "Volume 7", "body": "<h1>Chapter 648 - Finally Became A Father</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What exactly is the Elder Blood [1]?</p><br/><p>According to some, it is a powerful elven curse that had been passed down for generations. Those whose veins where the infamous Hen Ichaer [2] flow are said to carry death and destruction within them, to sow repugnance and disdain in the hearts of people.</p><br/><p>Ithlinne [3] had prophesied that an avenger would be born from this contaminated blood. This avenger would be a destroyer of nations and worlds.</p><br/><p>Others, however, claimed that the Elder blood was an inherited, extremely rare talent. It could grant them control over time and space to a degree which was unattainable even to elven Sages [4].</p><br/><p>Unfortunately, only a few bearers of this gift have been able to control its powers in full. This partial mastery would lead to sudden outbursts that took the form of unpredictable, uncontrollable, deadly explosions.</p><br/><p>The truth of these tragic cases lay behind the dark legends about the Curse of the Elder Blood.</p><br/><p>Obviously, the bearers of the Elder Blood were always the center of attention to the world’s mighty and mages alike.</p><br/><p>The former relied on the truth of Ithlinne’s prophecy: They wanted an avenger who could destroy worlds, one they could use for their own purposes.</p><br/><p>The latter hoped to harness the magic of Hen Ichaer to broaden their own knowledge and magical powers.</p><br/><p>These were multiple views regarding the Elder’s Blood that had been recorded in a book called ‘Elder Blood.’ It was a biased, skewed piece of writing.</p><br/><p>On the other hand, Olivia had just been exposed to the clean, whole truth, courtesy of the system.Avallac’h [5] had created a Gate of the World with the King of the Wild Hunt, Eredin Bréacc Glas [6]. By using this gate, their race could travel to any other world. The Conjunction of the Spheres [7] was actually a phenomenon that happened when these elves opened the Gate of the World. However, as they had accidentally lost the ability to travel between worlds, the Gate of the World was closed forever. Therefore, these elves were forced to stay in the world, never be able to return to their own world. When they lost this ability, Eredin and Avallac’h had planned to nurture a beautiful female elf that had the ability to travel through the Gate of the World. Therefore, they had spent a long, long time ‘nurturing’ Lara Dorren [8], a female elf that carried with her the powers of the Elder’s Blood.</p><br/><p>Lara Dorren was actually an ancestor of Cirilla. Suffice to say, Cirilla had inherited her blood. You could imagine how Cirilla would be the focus of Avallac’h and Eredin.</p><br/><p>To be honest, Olivia was actually quite interested in the ‘Gate of the World.’ She wanted to know whether this Gate was related to the ‘Two Dimensional Gate’ that she had. No wonder she was so close to Cirilla. It turned out that everyone had a gate…</p><br/><p>However, Olivia had not yet felt the powers of Cirilla’s ‘Gate of the World.’ The only thing she felt was the healing ability of this ‘Elder Blood,’ which was comparable to the best ‘Full Moon’ [8] potion out there!</p><br/><p>In reality, Olivia did not need to give any vitality regeneration potion for Cirilla to drink. Cirilla had a passive regeneration ability. If Cirilla ever got wounded in the game, the ‘Elder’s Blood’ that was flowing in her veins would slowly regenerate her health back to normal. Instead, Geralt, who was a witcher, needed to use potions, food, and meditation to restore his vitality…</p><br/><p>However, there was no choice. Olivia did not know about Cirilla’s physical condition. She just felt that even if she died, she would only leave the Source World. Who knows, she might even be able to return in another manner. No matter what, she did not want Cirilla to die.</p><br/><p>Olivia did not even think of how Cirilla would react if she really died. Then, as prophesied, she would destroy the entire world for her sister. Anyone with sister complexes would react like so – it had been that way since the dawn of time.</p><br/><p>Cirilla cried tears of joy when she realized how her blood had slowly improved Olivia’s condition. It was just like a drowning man catching the last strand of straw that saved his life…</p><br/><p>She resolved to feeding her sister with her own Elder Blood every single day. Olivia discovered that the Elder Blood had even replenished her ‘Two Dimensional Gate’ ability rapidly. Was the ‘Gate of the World’ reacting to her gate?</p><br/><p>Olivia obviously could not let her sister bleed every single day. Once she felt that her body was improving she quickly stopped her sister. After seeing the deep scar on Cirilla’s wrist, she was sincerely moved.</p><br/><p>To her, the Source World was a very, very convincing literary world. However, in the end, it was still an illusion. Thanks to Cirilla, she was no longer as sure. Either way, she was a true sister.</p><br/><p>As the saying went, those who survive a catastrophe were bound to have good fortune. As Cirilla and Olivia were in the process of escaping, they were first given shelter by the kindly druids colony. After that, they were adopted by a kind lady. Her name was Chrisididae [9], and she was a merchant’s wife.</p><br/><p>Chrisididae could not give birth to children anymore, but she had always wanted a daughter. After she came Cirilla and Olivia, the cute pair of sisters, she adopted them in an instance.</p><br/><p>She had actually wanted to adopt Olivia only. Who asked her to be the cuter one?</p><br/><p>However, Olivia did not want to be separated from Cirilla. Therefore, Chrisididae had adopted both of them together.</p><br/><p>However, before she had the time to raise her daughters, her husband, Yurga [10], sent both his daughters away to someone else. This person was the legendary witcher – Geralt.</p><br/><p>Yurga’s chariot was stranded at a bridge in the canyons, where both his servants had deserted him. Geralt, who came across Yurga, invoked the ‘Law of Surprise’ as the price for giving him protection in exchange.</p><br/><p>At some point, Yurga had placed the unconscious Geralt on his chariot after Geralt got injured trying to fend off the siege of the monsters. He was then taken to a nearby town to be treated.</p><br/><p>Yurga initially thought that Geralt would not be able to get a reward from the Law of Surprise. This was because his wife, Chrisididae, was no longer fertile. It was impossible for him to have an unexpected child.</p><br/><p>Instead, Yurga proposed to have one of his sons follow Geralt as an apprentice witcher. However, Geralt did not accept his proposition.</p><br/><p>After meeting Dandelion [11], the group returned to Yurga’s home. There, they discovered that Chrisididae had adopted the two Princesses of Cintra. One of them was even the ‘Pearl of the Northern Kingdoms’…</p><br/><p>Rather than call it a coincidence, it was better to say that it was the ‘Law of Surprise.’ This time, even Olivia had become a part of the ‘Law of Surprise.’</p><br/><p>Geralt was ecstatic. He had wanted to be Olivia’s dad so much. It was amazing to have a tsundere Lolita daughter!</p><br/><p>However, when he thought about the misfortune that had befallen upon these two young girls, he quickly became somber again.</p><br/><p>Translation note:[1] “Elder Blood” (), also known as Hen Ichaer or Lara gene, is considered to be the blood/genes in Lara Dorren’s descendants who carry powerful magic.</p><br/><p>[2] “Hen Ichaer” (.) is another name for ‘Elder Blood’</p><br/><p>[3] “Ithlinne” () was a legendary elven healer, astrologist, and oracle. She had a gift for divination and prophecies, the best known of which is Aen Ithlinnespeath.</p><br/><p>[4] “Elven sages” () are one of the humanoid races that inhabit the Continent.</p><br/><p>[5] “Avallac’h” () was an elf and Aen Saevherne who had the ability to travel between the worlds of the Aen Elle and Aen Seidhe. He met Geralt and told the witcher about a prophecy connected with Ciri. He was nicknamed ‘Fox’ by the unicorns.</p><br/><p>[6] “Eredin Bréacc Glas” () was an Aen Elle elf and commander of an elven cavalry known as the Wild Hunt.</p><br/><p>[7] “Conjunction of the Spheres” () is a cataclysm which occurred 1,500 years before the events in the novels, trapping many “unnatural” creatures in this dimension, including ghouls, graveirs, and vampires.</p><br/><p>[8] “Full Moon Potion” () significantly increases maximum Vitality. Specifically, it doubles the maximum total vitality.</p><br/><p>[9] “Chrisididae” () was the wife of Yurga, a merchant who helped Geralt out after the witcher was badly injured defending Yurga’s wagon.</p><br/><p>[10] “Yurga” () was a modest merchant from Lower Sodden. He had a wife called Goldencheeks and together they had two strong sons, Nadbor and Sulik.</p><br/><p>[11] “Dandelion” () was a poet, minstrel, bard, and close friend of Geralt of Rivia.</p></div>\n</div>"}