{"title": "Chapter 646 - A Warm Reunion", "id": 646, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-646-a-warm-reunion", "volume_title": "Volume 7", "body": "<h1>Chapter 646 - A Warm Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Moments ago Cahir was disappointed in the appearance of the unconscious Princess Olivia. Now he believed in the rumors that claimed Princess Olivia to be one of a kind.</p><br/><p>Cintra city was not exactly small in size, plus it was currently embroiled in chaos. How did she know where Cirilla was?</p><br/><p>“Your majesty, please leave finding Princess Cirilla to us. A princess should not travel about in such an environment. Please stay in this carriage.” Cahir was simply being considerate.</p><br/><p>He was worried that Olivia would want to commit suicide if she saw the chaos in her beloved city.</p><br/><p>“I have been with my sister since birth. We are inseparable. I could sense her presence, even if she was on the other side of the ocean. It would be easy for me to locate her,” Olivia spoke plainly.</p><br/><p>Cahir doubted her words. How could a person find another with instinct alone?</p><br/><p>The sorceress ensured Cahir that such bonds existed, especially for those people who were linked with “The Law of Surprise.” It would be safe to believe in Olivia.</p><br/><p>Cahir was not left with much choice. This was the only way he could complete his mission. He could either gamble on this princess’ hunch, or he could keep hoping that he could get lucky.</p><br/><p>After stepping out of the carriage, Olivia witnessed the chaotic scene in Cintra city. It was her first experience being in the middle of a war. The sight was cruel and savage…</p><br/><p>“It’s just a game, just a game…” She tried to drive away the fear in her heart. Nevertheless, this was the reality of natives in this source world.</p><br/><p>Olivia shifted her focus to her mission. Escorted by Cahir and his men, she led the party towards the first yellow circle in the minimap. By activating her Witcher Senses, she behaved like the White Wolf Geralt, analyzing the footprints and tracks. Moments later, she concluded that those footprints belonged to the knight who dragged Cirilla to safety.</p><br/><p>The party followed the track. Of course, only Olivia could see the red footsteps. Once she put on her hood, her eyes turned into cat’s eyes…</p><br/><p>In his escort, Cahir was amazed by Princess Olivia’s ability. Rumors had said that “The Pearl of Northern Kingdoms” was a helpless noble with a pretty face, were they not?</p><br/><p>Rumors cannot be trusted, afterall!</p><br/><p>Cahir was relieved by the fact that Princess Olivia did not suffer from a mental breakdown after she saw the chaos in her city. How strong was this little girl?</p><br/><p>As she took action, he saw a little of his own Emperor Emhyr in this Princess Olivia. How could that be possible?</p><br/><p>The track stopped in an alley. Corpses were everywhere, both of the elite knights of Cintra and the army of Nilfgaardian Empire…</p><br/><p>Cirilla had lain motionless among the corpses, fooling numerous Nilfgaardian soldiers who passed by. Her elite knights had given their lives defending her.</p><br/><p>Fate had its own plans for Cirilla. Apparently, a mysterious force kept her alive during dire moments like these.</p><br/><p>At that moment, Cirilla once again felt a great fear as the footsteps moved closer to her…</p><br/><p>It could not possibly be friendly. All able Cintran men have been slaughtered.</p><br/><p>Cirilla decided to continue playing dead. If anyone ever found her, she would truly be dead.</p><br/><p>Cirilla had inherited the resilient character from Calanthe.</p><br/><p>Even as she was playing dead, she thought of nothing but her sister and grandmother. She was lucky to have been escorted by the knights. Olivia and Calanthe did not have such defenders. Have they been brutally butchered by the Nilfgaardian Empire?</p><br/><p>Those black uniforms sent blood rushing through young Cirilla’s veins. Her hatred towards the Nilfgaardian Empire would not be quelled so easily!</p><br/><p>Even if she learned that the ruler of The Nilfgaardian Empire was her father, but she would never forgive him. She would never inherit such an evil and despicable empire!</p><br/><p>Cahir would never allow Princess Olivia to move the corpses aside on her own. In doubt, he and his men cleared the pile of corpses. In no time at all, they found Princess Cirilla!</p><br/><p>Cahir was extremely relieved. The obedient and cooperative Princess Olivia had gained his undivided trust. When he arrives in the castle of Nilfgaardian, Emperor Emhyr would grant him the highest honor of all!</p><br/><p>Cirilla’s heart was cold, almost dead with disappointment. The moment she was found by a knight in black uniform and a helmet with wings engraved on it, she moved into action…</p><br/><p>The dagger in her hand flashed. First, she would take this knight’s life, then she would take hers.</p><br/><p>With the speed of a leopard, she lunged towards Cahir!</p><br/><p>Cahir might be distracted by the fact he had found Cirilla, but he still dodged her attack with ease. Cirilla was still a child. How could she stand a chance against an elite knight?</p><br/><p>“Sister!” Olivia rushed towards Cirilla and hugged the girl who was covered in the blood of her defenders.</p><br/><p>Cirilla had been prepared to face her final moments. Now, she had found the reason to stay alive in this world once again…</p><br/><p>Praise the goddess of mercy! Her beloved sister was still alive!</p><br/><p>Cirilla had never shed a tear in her life, yet she now a blubbering mess. After all, she was only a child. No matter how strong she was, she had just witnessed the downfall of her kingdom, and had faced the possibility of having los her entire family. How could she not crack under such pressure?</p><br/><p>Olivia did not cry. She tried her best to comfort her sister…</p><br/><p>In the middle of a brutal battlefield, two sisters embraced each other in a reunion. Such a warm scene!</p><br/><p>Cahir stood patiently by the side, guarding both princesses as they expressed themselves. His respect for Princess Olivia only grew.</p><br/><p>Olivia was not just a pretty face – she was the best candidate for monarchy!</p><br/><p>On the other hand, Cirilla was not even close…</p></div>\n</div>"}