{"title": "Chapter 643 - Case Solved", "id": 643, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-643-case-solved", "volume_title": "Volume 7", "body": "<h1>Chapter 643 - Case Solved</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cahir was proud of his elite dark calvary. This elite division had won the trust of Emperor Emhyr enough to put the safety of both Cintra Kingdom’s princesses into Cahir’s hands.</p><br/><p>As the calvaries cleared the road ahead, Cahir strolled down the walkway, not yet looking at Princess Olivia. He looked down to the ground from the top of the tower, sighing in relief.</p><br/><p>Nobody could survive that fall.</p><br/><p>The view was not as pretty as it used to be. It used to flourish with greens and color. After the war, it became a temporary operational base for Emperor Emhyr to do whatever he liked.</p><br/><p>To prevent any accidents, Cahir walked to the edge of the tower, securing a safe distance between Princess Olivia and the thin air. He was worried that Princess Olivia would do something stupid after she saw her home now occupied by the Nilfgaardian Empire black calvaries.</p><br/><p>Cintra Kingdom’s could not prevent its grim fate. It was destined to be a state of the Nilfgaardian Empire.</p><br/><p>However, it was not going to be easy to keep Cintra enslaved. The people of Cintra were as resilient as their royal family. They might even start some underground operation to liberate Cintra.</p><br/><p>The Kingdom of Verden was just a river away. Ironically, they never sent any help to defend Cintra, but offered themselves as a tributary.</p><br/><p>The King of Verden was too cowardly to fight against the Nilfgaardian Empire. Prince Kristen had lost his faith in his own father. Perhaps one day, he would rise against his father for Olivia and his people.</p><br/><p>After all, he was a brave and famous prince who could not accept the behavior of the kingdom that he was going to inherit. He intended to free his own country from cowardice, before invaders.</p><br/><p>Prince Kistrin was out of luck. He had missed his chance of getting married to “The Pearl of the Northern Kingdoms.” The fans of “The Pearl of the Northern Kingdoms” had described him as a fat and hideously incapable peasant who failed to capitalize on an engagement before the fall of Cintra Kingdom…</p><br/><p>When the news of Cintra Kingdom fell into the hands of the Nilfgaardian Empire, the King of Verden denied having made any engagement plans with Cintra. He even said that if he had a daughter, she would be placed on the bed of Emperor Emhyr.</p><br/><p>Cahir realized that the one who had fainted on the floor was Princess Olivia. Her reputation truly preceded her, unlike Cahir’s downplayed imagination.</p><br/><p>She did not have any of those magnificent, distinctive dresses of a princess on. Rumors had it that she had designed all of her dress. Every dress worn by “The Pearl of Northern Kingdoms” quickly became the latest fashion trend for the noble ladies….</p><br/><p>At that moment, she was wearing a simple, yet elegant gown and holding a topee. It was what sorceresses usually opted for, as it was easier for them to cast spells.</p><br/><p>If Olivia had a staff in her hand, Cahir might have even mistaken her for a sorceress, not a princess.</p><br/><p>Anyone could excuse her for such plain clothing. The army of the Nilfgaardian Empire had just stormed right into her palace. Princess Olivia would not be in the mood to stay pretty, no matter how vain she was.</p><br/><p>Cahir was disappointed. She had been rumored to be the fairest across the land. The girl in front of him was barely of age. Were the people of the Northern Kingdoms all lolicons? [1]</p><br/><p>Cahir could not help but doubt if Emporer Emhyr was a lolicon as well.</p><br/><p>There were paintings of “The Pearl of the Northern Kingdoms” all over the market. All of them had been illustrated based on the artists’ imagination. Did they even have professional integrity?</p><br/><p>None of the portraits they sold were real!</p><br/><p>Perhaps they had not even met Princess Olivia in person. Or maybe, they took the liberty to ignore the “erotic adorable” outlook and drew what they believed to be an adult Princess Olivia in the future…</p><br/><p>Cahir could not deny that Olivia’s face was beautiful for a young girl. Such beauty did not provoke the urge to reproduce with her but instead, to protect her from harm.</p><br/><p>Cahir was a self-proclaimed righteous knight. Even as an invader of Cintra Kingdom, his mission was not to kill, but to protect.</p><br/><p>He was glad when he confirmed Princess Olivia was not dead but merely unconscious. The next thing he did was to find out why this princess had been left in such a state.</p><br/><p>There was a sorceress in his elite division. She was an apprentice of the great sorceress of Nilfgaardian Empire, Assire var Anahid.[2] Cahir’s mother, Mawr was the niece of Assire. [3] Indirectly, Assire Var Anahid could be considered his grandmother.</p><br/><p>Assire var Anahid was famous for her capabilities as a palace sorceress of the Nilfgaadrian Empire. She was featured in Gwent. It was not a heroic card, but it had 6 strength points. Her words on that card were written as so — “Nilfgaardian mages do have a choice: servile submission, or the gallows.”</p><br/><p>That sentence was enough to show the expectations Emperor Emhyr had for his mages. If they did not bow, they were as good as dead.</p><br/><p>Cahir’s elite division was small, so his sorceress would not be the most adept. She was much weaker than Princess Olivia, which also meant that she could not open a portal.</p><br/><p>Nevertheless, she felt the essence of a portal lingering in the air and informed Cahir that Queen Calanthe had fled through a portal.</p><br/><p>Never once did it cross his mind that it was Olivia who did it. Cahir discussed the matter with his grandmother’s apprentice and made a conclusion—</p><br/><p>The Cintra Kingdom had fallen. Queen Calanthe had abandoned her people in cowardice. Princess Olivia had sworn to live and die with the Cintra Kingdom. She was knocked out by the closure of the escape portal before she managed to commit suicide by jumping off the tower.</p><br/><p>Case solved!</p><br/><p>When they looked at the unconscious Princess Olivia, there was nothing in their eyes but utmost respect.</p><br/><p>Translation Note:</p><br/><p>[1] Lolicon (ロリコン rorikon), also romanized as lolikon or rorikon, is Japanese discourse or media focusing on the attraction to young or prepubescent girls. The term lolicon is a portmanteau of the phrase “Lolita complex”;[1] it describes an attraction to young or prepubescent girls, an individual with such an attraction, or lolicon manga or lolicon anime, a genre of manga and anime wherein childlike female characters are often depicted in an “erotic-cute” manner (also known as ero kawaii), in an art style reminiscent of the shōjo manga (girls’ comics) style.</p><br/><p>[2] Assire var Anahid was a mage in the Nilfgaardian Empire’s service who hailed originally from Vicovaro. She was a sister of Eviva, aunt of Mawr and Cinead var Anahid as well as grandaunt of Cahir Mawr Dyffryn aep Ceallach.</p><br/><p>Assire was a founding member of the Lodge of Sorceresses and remained a member along with Fringilla Vigo, also in service of the Empire. She took advantage of Carthia van Canten’s relationship with the head of Nilfgaardian Secret Service, Vattier de Rideaux, and used it to spy on him.</p><br/><p>She was also known for helping Imperator Emhyr var Emreis with military operations during the war. Even though Assire was a Nilfgaardian sorceress, she and Eviva had a Nordling blood. She also owned a black cat called Merlin.</p><br/><p>[3] Mawr was the wife of seneschal Ceallach and the mother of Aillil, Cahir, and Dheran. She was also the niece of Assire var Anahid through her mother, Eviva.</p></div>\n</div>"}