{"title": "Chapter 650 - My Teacher Is My Friend", "id": 650, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-650-my-teacher-is-my-friend", "volume_title": "Volume 7", "body": "<h1>Chapter 650 - My Teacher Is My Friend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>With his two new adoptive daughters, Geralt finally arrived at their destination – Kaer Morhen.</p><br/><p>Dandelion did not follow them to Kaer Morhen. He had become good friends with the ‘Pearl of the Northern Kingdoms,’ Her Royal Highness Princess Olivia. His relationship with her went along the lines of, ‘my teacher is my friend.’</p><br/><p>Perhaps from the very beginning, this talented womanizer was going for Princess Olivia for her beautiful looks. He felt that Olivia was meant for him. Her charisma was like a lover that he could not think of. It was his fault that he had too many lovers…</p><br/><p>However, somehow he seemed to have discovered Princess Olivia’s talent in literature (Wen Qingyu). Therefore, along the way, he started to teach her more about literature. As for music (Chu Luoxun), there was nothing for him to teach. Her musical talent was so impressive that Dandelion deeply admired her.</p><br/><p>Since Olivia was Geralt’s daughter, he considered Olivia as a close junior. He hoped that Olivia would become more outstanding and charming in the future.</p><br/><p>As for the elder Princess Cirilla she would probably cut him up if he attempted to probe. Clearly, she preferred speaking with steel. It could be said that her personality was similar to that of Geralt’s. The small little Princess Olivia, however, had more potential.</p><br/><p>Do not assume that Dandelion was your run-of-the-mill flowerboy. He was rather capable in his own right. Some of his exploits could even be made into the stuff of legends.</p><br/><p>Dandelion’s was very good looking. He was often mistaken as an elf or a half-elf. If you put such a handsome but effeminate man in the modern world, then he would definitely be fresh-meat and idol material.</p><br/><p>He studied at the Oxenfurt Academy, which was the most famous academy in the Northern Kingdoms. Its main academic rival is the Imperial Academy in Nilfgaard, which was comparable to it.</p><br/><p>He was famous for his lazy, drunkard, and idiotic behavior when he was a student. His genius revealed itself when he passed the exams of seven liberal arts subjects with outstanding results. He was later hired by the academy to be a professor. However, he left the academy after one year of teaching to travel the world.</p><br/><p>He would later visit Oxenfurt Academy to be a guest lecturer from time to time.</p><br/><p>He even became schoolmates with Shani [1]. He was the one who introduced this cute and short-haired beauty medic to Geralt.</p><br/><p>However, this womanizer was not welcomed by some in the academy. For example, he was forbidden from entering within 100 feet of the vicinity of the Alchemy Institute and within 300 feet of the female dormitory.</p><br/><p>Within a few years of becoming a bard, he gained worldwide fame because of his talents and brilliance. He became known as the most famous poet in the Northern Kingdoms, where even royalty respected him.</p><br/><p>Dandelion even held the title of Viscount. This was an actual superstar of his time. The popularity of Geralt, the White Wolf all came about, only because of Dandelion’s bragging and publicity.</p><br/><p>However, Geralt always had to pull Dandelion out of trouble. This was because he had no control of his lower half body.</p><br/><p>The most recent affair about Dandelion that spread across the region was between him and the Duchess of Toussaint, Anna Henrietta [2].</p><br/><p>A few years ago, Dandelion had been invited to perform in the Palace of Toussaint. As they got along during the entire winter and summer, he became romantically involved with Duchess Anna. The duchess’ husband, Duke Raymund [3] was in Cintra for a meeting. He was not alone there, however, as he found a few lovers there.</p><br/><p>Olivia knew a little about this Duke Raymund. He was the husband to the Duchess of Toussaint. Furthermore, the Duchess was the cousin of King Emhyr. Thus, Olivia had to call Duchess Anna ‘aunt.’ From this, Dandelion’s intuition that Olivia had the charm of one of his lovers was not entirely wrong. Olivia and Duchess Anna were actually related by blood.</p><br/><p>When the duke who was cheated on got back, Dandelion had already left Toussaint. However, the affair between the poet and Duchess Anna had already spread across the region. When one of his servants informed him about everything, the incensed duke had slit the servant’s throat. He then imprisoned Duchess Anna in her chambers to interrogate her about this affair that had caused him much disgrace. After torturing her, Duchess Anna finally revealed the truth. He then ordered the soldiers of Toussaint to apprehend Dandelion. He wanted to tear Dandelion’s heart out, deepfry it in oil, and force Duchess Anna to eat it in front of the entire court. It did not go as he thought, as Dandelion had already escaped the dangerous situation with the help of White Wolf.</p><br/><p>Recently, there was news that the perverted Duke Raymond had died from a stroke while having sex with one of his lovers.</p><br/><p>Therefore, the power to rule the Duchy of Toussaint now belonged to Duchess Anna Henrietta. She did not know if the people would actually love her for her past.</p><br/><p>Duchess Anna Henrietta was extremely beautiful and elegant. It should be said that it was not surprising that she was the aunt of the ‘Pearl of the Northern Kingdoms’, Princess Olivia.</p><br/><p>In reality, the Duchy of Toussaint was actually just a vassal state of the Nilfgaardian Empire. However, King Emhyr would spare his cousin sister some face. In other words, the Duchy of Toussaint only retained its independent status because of her close relationship with the King.</p><br/><p>When the identity of Olivia got revealed, and she became the Royal Princes and second heir of the vast Nilfgaardian Empire, she could then take the Duchy of Toussaint out of Anna’s hands.</p><br/><p>This was actually a time where one would need to rely on their father’s wealth or prestige to get ahead. Therefore, Princess Olivia going everywhere to find a new adoptive father seemed justified. She probably would not be criticised as the ‘girl with three different surnames?'[4]</p><br/><p>Fortunately, Dandelion no longer gazed at Princess Olivia lustfully. If not, then was this guy who had already lain with the aunt now going after the niece? He would really be a lunatic if that happened. Was he the main character in a pornographic novel?</p><br/><p>Of course, it would not be that easy going after Princess Olivia. Cirilla was around her, so no one could even bully Olivia.</p><br/><p>Dandelion became Olivia’s teacher. He taught everything that he knew to her. He hoped that this little princess could be like him: the most famous poet in the entire continent.</p><br/><p>Olivia had the game’s system with her. Everything Dandelion taught was transformed into skills, that updated themselves in the skill bar. She could then distribute her skill points among them…</p><br/><p>To satisfy her teacher, Dandelion, Olivia had to take out some goods. She used the poet ‘When We Two Parted’ by Lord Byron [5]. This made him feel as if he received a treasure. She even expressed that she could become famous in the entire continent just by using this poem.</p><br/><p>In ‘When We Two Parted,’ there was a particularly touching stanza –</p><br/><p>If I should meet thee</p><br/><p>After long years,</p><br/><p>How should I greet thee?–</p><br/><p>With silence and tears.</p><br/><p>Since there was Dandelion, the huge braggart, it would be not surprising to see his student Princess Olivia gaining fame for her poetry…</p><br/><p>Translation note:</p><br/><p>[1] “Shani” () was a medic, having studied at Oxenfurt Academy.</p><br/><p>[2] “Anna Henrietta” (·) was the ruling Duchess of Toussaint, and beloved by all her people.</p><br/><p>[3] “Duke Raymund” () was the husband of Duchess Anna Henrietta, making him Duke of Toussaint, and ruled from 1258 until his death 7 years later.</p><br/><p>[4] Zhang Fei once called Lü Bu “a slave with three surnames” (; the “three surnames” refer to Lü Bu’s original surname and those of his two foster fathers.</p><br/><p>[5] “Lord Byron” () was a British nobleman, poet, peer, politician, and leading figure in the Romantic movement. He is regarded as one of the greatest British poets and remains widely read and influential.</p></div>\n</div>"}