{"title": "Chapter 656 - First Step Towards Remodeling", "id": 656, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-656-first-step-towards-remodeling", "volume_title": "Volume 7", "body": "<h1>Chapter 656 - First Step Towards Remodeling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Eskel had a head of black hair. A massive scar marred his face. Similar to Geralt, he liked to count on the “Law of Surprise.” The “Law of Surprise” was where he had gotten his horse, whose name was Scorpion.</p><br/><p>As for the scar on his face, there was a backstory for it.</p><br/><p>Eskel got it when he was trying to save the life of a prince, 70 years ago. He had invoked the Law of Surprise for his trouble, and at that time, the prince did not know that his wife was about to give birth to a female baby—Deidre Ademeyr. Even so, Eskel had yet to bring back his promised child.</p><br/><p>As if by the hand of retribution, not doing so had brought him many troubles 20 years later, even causing him to make an enemy out of the sorceress Sabrina. This had angered Princess Deidre Ademeyr, who by logic would be his “granddaughter.” She had slashed him across the face, scarring him for life.</p><br/><p>In the end, Eskel’s Surprise Child, Princess Deidre Ademeyr was born from the shadows of fate. She had changed her own fate, thanks to the good book; she was now free of vengeance. Under the united rule of Merwin and Deidre, Caingorn lifted the flag, bringing its brightest moments in history.</p><br/><p>After a few years, a crow bringing mail from the prince of Caingorn arrived at Kaer Morhen. Without looking at the contents, Eskel had discarded it into the flames.</p><br/><p>From that moment on, witchers never brought up the name of Deidre Ademeyr once again.</p><br/><p>So much contradiction and doubt. In reality, many witchers would not want to bring their Surprise Children into the world of witchers.</p><br/><p>Like Geralt, if it wasn’t for that fact that Olivia and Cirilla had nowhere to return, he might have ended up like Eskel – returning to Kael Morhen empty-handed.</p><br/><p>When Olivia first mentioned remodeling Kaer Morhen, no one thought much of it, as they had already gotten used to the life there. There was no choice. Witchers were not only poor, but they had to suffer prejudice too.</p><br/><p>However, the angel Olivia was just too cute, no one would dare let her down. Even Lambert. He may have groaned and nagged about it, but the floor’s new marble tiles were actually his doing.</p><br/><p>Although Kaer Morhen was old, it was also immensely huge and could easily house a few hundred people.</p><br/><p>That was why Olivia had come up with a residential area. Its design was most modern. With alchemy, anything was possible, as long as she had the resources.</p><br/><p>This was the real power of dark technology. Magic may not be as overpowered as one would think, but it had its uses. Combined with the support from the system, Olivia could enforce her will over the atoms, which was basically Alchemy on a microscopic level.</p><br/><p>As long as she applied her modern knowledge where applicable, nothing was impossible.</p><br/><p>Olivia returned to her world to read up on more modern books, returning to make use of it in this world of magic and swords.</p><br/><p>When the marble floor was complete, and the geothermal system had been set up, the interior looked profoundly different. Adding to the mix was a modern day Europe style villa, which was pleasant to the people of this world.</p><br/><p>If not for the time constraints, Olivia might have accomplished even more. Even so, this was sufficient, especially for those who were unfamiliar with the interiors of grand constructs.</p><br/><p>Olivia’s drawings hung off the wall. Regardless of their quality, they complemented the otherwise bare walls.</p><br/><p>The chandeliers would have worked with light bulbs, but as Thomas Edison did not live in this world, magical fire was used as a substitute. In fact, if the caster wished it, they could even change the color at will.</p><br/><p>Even the old geezer, Vesemir took kindly to the revamped residential area. He liked the pub in particular, although it lacked good alcohols. Otherwise, he could enjoy the music while chugging down alcohol, enjoying his winter to its fullest.</p><br/><p>The grape wine here was very developed, especially those of the Toussaint variety, which was well-known all around. However, liquor did not exist just yet. Distillation methods for liquor had yet to be invented. This was a major business opportunity.</p><br/><p>The guys on Skellinge were addicted to alcohol. Sadly, they were only able to drink beer. They would never accept some lady’s drink like grape wine.</p><br/><p>The forever complaining Lambert liked the gigantic pool the most. Clean ponds did not come easy if you wanted a swim. Now, he could swim around the castle to his content!</p><br/><p>Olivia also made something that resembled a sofa…</p><br/><p>Obviously, she sought to turn Kaer Morhen into a warm home, not an abandoned castle in the snow.</p><br/><p>As usual, Olivia shared a room with Cirilla. Nothing could separate them.</p><br/><p>In a short time, Kaer Morhen’s interior had changed drastically. It was far from perfect, but their dreams were starting to take form. Olivia had now earned enough trust to use the witchers’ treasury at her discretion.</p><br/><p>She now had a deeper understanding on their finances. First, she would create a Chamber of Commerce, and then start funding it with money from these witchers.</p><br/><p>In the blink of an eye, time passed. As a blizzard raged on, Triss had arrived at Kaer Morhen. She bitterly smiled at the weathered exterior of the castle, but the thought of being able to meet Geralt in her mind quickly brought her comfort.</p></div>\n</div>"}