{"title": "Chapter 652 - Setting A Small Goal", "id": 652, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-652-setting-a-small-goal", "volume_title": "Volume 7", "body": "<h1>Chapter 652 - Setting A Small Goal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Vesemir soon learned of their identities. He could not help but tease his disciple about how he truly had a way with women. The children that other witchers brought back using the ‘Law of Surprise’ were usually boys. The ‘Trial of the Grasses’ would not be that much of a problem to them.</p><br/><p>Females may have a harder time surviving the trial. Furthermore, Cirilla and Olivia were nobility. They were not nameless, faceless orphans.</p><br/><p>The term ‘Trial of the Grasses’ sounded relatively harmless. In reality, it was an extremely painful process. Apprentices who were unprepared could only die in pain. However, those who could survive it would obtain abnormal strength and agility. There was a survival rate of 3 out of 10.</p><br/><p>Those who knew of the ‘Trial of the Grasses’ would know how close to torture it was –</p><br/><p>“On the third day all the children died save one, a male barely ten. Hitherto agitated by a sudden madness, he fell at once into deep stupor. His eyes took on a glassy gaze, incessantly with his hands did he clutch at clothing, or brandish them in the air as if desirous of catching a quill. His breathing grew loud and hoarse; sweat cold, clammy and malodorous appeared on his skin. Then he was once more given elixir through the vein and the seizure it did return. This time a nose-bleed did ensue, coughing turned to vomiting, after which the male weakened entirely and became inert.For two days more did symptoms not subside. The child’s skin, hitherto drenched in sweat, grew dry and hot, the pulse ceased to be full and firm — albeit remaining of average strength, slow rather than fast. No more did he wake, nor did he scream.</p><br/><p>Finally, came the seventh day. The male awoke and opened his eyes, and his eyes were those of a viper…”</p><br/><p>As the ‘Trial of the Grasses’ was so cruel, witchers from the School of the Wolf at Kaer Morhen were morally inhibited from carrying out such a process if they could help it. Under special circumstances, it may also not be used to create new witchers, but to remove certain curses. After all, the ‘Decoctions of the Grasses’ [1] was a kind of alchemical potion with special effects.</p><br/><p>Vesemir had lots of experience of living with children. He could be said to be the most experienced ‘nanny’ on the continent. Thus, despite the scary scar on his face, his kind personality put the girls at ease.</p><br/><p>To be honest, Olivia had used the game system’s ‘character information bar’ to read up Vesemir’s past. She knew that he was indeed a good person, all the way down to the soul. This was why he was deeply loved by other School of the Wolf witchers. It took her no time to call him ‘grandpa.’</p><br/><p>On the other hand, the manipulative sweetheart, ‘Pearl of the Northern Kingdoms’, Princess Olivia, was unparalleled in getting someone to like her.</p><br/><p>Vesemir had most certainly heard of the ‘Pearl of the Northern Kingdoms.’ However, he had never seen her before. Now that he stood before her, he could see that the title had been well-deserved. Her beauty was undeniable. Her charming personality and talents were probably the other reasons.</p><br/><p>After all, beauty gave many a great headstart in earning favorabilities. You would only have to complete it with some inner beauty…</p><br/><p>After Kaer Morhen received the two princesses as refugees, Olivia’s game system notified her, saying that she had successfully joined the neutral camp of the witchers. Thus, as long as she could expand the influence of the camp and complete all sorts of quests in the camp, she could obtain more skill points rewards.</p><br/><p>This was no longer some side quest. It became one of the main quests.</p><br/><p>In this era, the group of witchers were a relic of the past. Wherever they went, they would be ostracized and discriminated. Ordinary people thought that they were mutated monstrosities and feared them. However, they had to rely on the witchers to solve the problems of real monsters.The witchers from the School of the Wolf held their own well enough. They did not participate in politics and strictly abided by their neutrality. However, the witchers from the School of the Cat [2] had evolved into hired hands. They took part in assassinations. Some of them had been forced to do it for a living, while others had already thrown away their dignity as witchers…</p><br/><p>As a result of the negative perception created by the witchers from the School of the Cat, the witchers from the School of the Wolf bore some weight to the accusations.</p><br/><p>Therefore, to Olivia, this main quest that required her to help expand the influence of witchers from the School of the Wolf in Kaer Morhen would be rather difficult. Much had to be undone, before they could start anew.</p><br/><p>However, the ‘Trial of the Grasses’ was no longer in practice. This meant that, whenever a witcher from the School of the Wolf dies, no one would replace him. They were an even more endangered species, compared to the pandas…</p><br/><p>Just look at Geralt’s scarred face. Anyone would know that hunting monsters was extremely dangerous. How could they kill the monsters unarmed?</p><br/><p>Olivia felt that she had a long way to go. She had to take this, one small step at a time. First, she would have to earn some capital, and then buy some new equipment for her White Wolf dad. He should at least wear armor with engravings. One embedded with various runestones – the workings of a master craftsman. The Kingcraft!</p><br/><p>His longsword and silver sword seemed adequate, but they paled in comparison to the arms of the wealthy!</p><br/><p>Other than the game system, Olivia’s biggest backing force was her knowledge of technology from the modern world. She had seen various isekai novels of heroes using modern technology to rule the world. Who knows, she could even give Geralt a shotgun with silver bullets. He could tear monsters apart at point blank range. A hunter should walk around with a firearm, afterall…</p><br/><p>Olivia was determined to revolutionize to this medieval world of swords and magic!</p><br/><p>However, having just experienced a long journey, she was currently exhausted. Today, she could finally rest peacefully with Cirilla.</p><br/><p>The fortress in Kaer Morhen was rather dilapidated, but she need not worry for her safety. Humans may not want to live here, but Geralt and Vesemir made her feel at home.</p><br/><p>Because of its low population and infertile lands, Kaer Morhen was not suitable for farming. However, it could serve as a secret base for the research of black technology. Its old walls held strong, its occupants powerful. Rumors had it that White Wolf dad was dating several sorceresses at once?</p><br/><p>If she got all the sorceresses to gather in the fortress, she could really get something started. They were most certainly the scientists of this era…</p><br/><p>Unfortunately, it would take more than Geralt’s charm to get them to stay in Kaer Morhen. After all, sorceresses mostly lived a life of luxury, comfort, and elegance. They were more than happy to shag Geralt, but to live in the shabby and worn Kaer Morhen?</p><br/><p>What a joke!</p><br/><p>They were just like modern women who spat on your shabby, self-built house, unless you could actually build a luxurious villa by hand! Well, even when it came to luxurious, countryside villas, they would not spare it a second glance if it did not have the various conveniences of entertainment and services that existed in cities. Such was precisely how Kaer Morhen was. It was not a luxury villa, it was a fortress that looked like a ruin.</p><br/><p>Therefore, Lady Olivia Zhao was right to aim for the small steps. She must first earn 1 billion and renovate Kaer Morhen, turning it into one of the most comfortable places to live in on the entire continent!</p><br/><p>Admittedly, she could not bring herself to like this shabby place. However, she was willing to work hard and transform this fortress for the sake of her sister, dad, and grandpa. She even wanted Geralt’s sorceress friends (sex friends) to stay there and work together, creating new advancements…</p><br/><p>Translation note:</p><br/><p>[1] “Decoctions of the Grasses” () is a quest item in The Witcher 3: Wild Hunt and is used on Uma to break the curse that binds him.</p><br/><p>[2] “School of the Cat” () is one of the witcher schools. They were witchers who developed fighting styles focusing on speed, precision, and agility.</p></div>\n</div>"}