{"title": "Chapter 661 - Movie Invitation", "id": 661, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-661-movie-invitation", "volume_title": "Volume 7", "body": "<h1>Chapter 661 - Movie Invitation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Zhao Youyue had already planned to go to the cinema herself. She was curious to see how the film had turned out. For starters, she had no doubts about her own acting skills. She had also worked with the director and knew that she and her crew had what it took. She would walk into the hall with her expectations at its peak.</p><br/><p>As for those comments that had painted her out to be “an evil force,” “disgrace of the film industry” – they were irrelevant. After becoming “Olivia” within the “source world” for so many years, she had transcended her boundaries yet again. She had even experienced the fall of a kingdom. What damage could online comments do to her?</p><br/><p>Let’s not forget that even some of her fans were frowning upon her. Where did they find the audacity to do so, without her consent?</p><br/><p>They had her permission to end their own lives, that much is certain. When one attacks Lady Zhao, she only needed to remain standing there with her arms folded. Someone else would step out and slapped their faces on her behalf. This was how the Zhao family functioned. She did not need to sully her own hands against someone’s face.</p><br/><p>Unfortunately, Han Leng knew nothing about this. Despite being the original author, he had been taken for granted. The cast and crew treated him not as the esteemed creator of the work, but as a stepping stone. When he had submitted Zhao Youyue’s name as a candidate for the star role, he was utterly dismissed. It had been a massive slap to his face…</p><br/><p>If Han Leng had the protagonist aura, he has found more ingenious methods of getting Zhao Youyue the role. Unfortunately, he was just a talented author, not a protagonist.</p><br/><p>In the end, Zhao Youyue still had to the fight for the position herself. She roused her cousin into action and claimed the role. Even after that, she had earned nothing but cold glares and hisses from her fellow cast members.</p><br/><p>It was when “Zhang Guorong” made her appearance when all assumptions were blown out the water. If not for the fact that the director intended to throw out a publicity stunt and keep the actress of Chu Luoxon under wraps, the public might already be singing praises about Lady Zhao’s acting…</p><br/><p>Even if that had happened, nobody would have been convinced that Lady Zhao would have been able to act, being the untrained outsider that she was. Critics and tongues would start wagging.</p><br/><p>Why bother to defend herself? Let them lower the expectations of the public, before surprising everyone and slapping the naysayers across the faces.</p><br/><p>When Zhao Youyue received Han Leng’s invitation to the movie, she certainly was unaware of how much Han Leng had wrestled with himself to find his courage. He still could not decide if Lady Zhao actually liked him…</p><br/><p>Men. They used their brains so inefficiently. The more beautiful a girl, the more their brains worked the wrong way.</p><br/><p>Still, Han Leng’s situation was understandable. After all, Zhao Youyue “favored” him very much indeed. He was the genius writer who had given Zhao Youyue the iconic character card, “Chu Luoxun.” He had also been a classmate and schoolmate, from grade school to university. Han Leng could may as well be a lieutenant of Lady Zhao. Zhao Youyue was always very generous towards her own subordinates.</p><br/><p>The stars had tales to tell of personalities. Zhao Youyue’s birthday fell on the 8th of August. This year, she would celebrate her 18th birthday. One could only imagine the scale of her coming-of-age ceremony. She was a Lady, and even the likes of Zhao Hao and Ding Yuncong pampered her.</p><br/><p>Of course, no one could suspect her actual age. After all, she had the magical “Two Dimensional Gate.” She had experienced several lives in different literary worlds. Of course, there were also the “source worlds” that resembled reality far more than anything.</p><br/><p>The stars called Zhao Youyue a Leo. It was true, she resembled a Leo in many more ways than one.</p><br/><p>Female Leos tended to be characteristically arrogant. The world seemed to flit past their gaze. Female Leos were also unyielding and stubborn. They would settle for nothing less than perfection.</p><br/><p>These Leos were extremely vain and narcissistic. They would exhaust themselves, putting up a bold, awesome front, only to beat themselves up the most severely when no one was looking. On the other hand, they were kind and passionate, always living their lives to the fullest…</p><br/><p>Lady Zhao’s persistence on trying to stand out was typical of a standard Leo. Of course, she also worked equally hard to stay low-key, when the situation demanded it. What better way than to fool everyone into complacency, before unveiling herself like a dazzling comet.</p><br/><p>Lady Zhao’s lack of patience and stubbornness were also Leo traits. Fortunately, she had those character cards to make up for her shortcomings.</p><br/><p>All in all, one could not trust the stars too much. They were highly ambiguous and over-generalized. For example, they could speak of things like one being highly self-confident, yet self-abased before of the person he loved. Another could very cheerful yet very silent at times… These vague descriptions could match just about any one, and they would all say, —— This horoscope is so me!</p><br/><p>Han Leng often became a victim of his imagination, unlike Zhao Youyue. She felt that Han Leng was a good person, that’s it. He was not only good-looking, but he also stayed out of her hair, unlike her suitors who flew before her face like flies. If anything, Zhao Youyue found her suitors most annoying. Couldn’t they just remain in the shadows and admire her from there like the servants they were?</p><br/><p>She had no doubts about her beauty. But it did not mean that she could tolerate those annoying suitors. Did she really look that lonely?</p><br/><p>Zhao Youyue trusted Han Leng very much, and was at ease when with him. She did not worry about the sensible scholar falling in love with a nasty Lady like her. Therefore, she had replied Han Leng’s message instantly ——</p><br/><p>“Sure. Thank you, elite scholar, for the movie treat. I can save more money, I’m so happy! (*≧▽≦)”</p><br/><p>Han Leng slapped his cheeks lightly, which seemed to be heating up. Still, something was off. Previously, Lady Zhao had always called him “Elite Scholar Han.” Now that she had shortened it to “Elite Scholar,” did that mean something?</p><br/><p>Knowing the arrogant Lady, she would never take the initiative to pursue a boy. In fact, most girls would did not. At most, they would drop a hint or two. Dense boys would never be able to pick up on them. The other group of boys would not even be interested in them, to begin with. Therefore, they would choose to act just as dense.</p><br/><p>But if a top quality, fair, rich and beauty like Lady Zhao was the one dropping hints, how many men would resist?</p><br/><p>Han Leng thought about it at length, but did not dare jump to conclusions. His courage left him once again. Still, he could catch a movie with Lady Zhao. There was happiness in that. As for the “money saving” comment Lady Zhao had mentioned, it only had to be her idea of humor. How could Lady Zhao possibly lack those few dozens of RMB for the movie ticket?</p><br/><p>As Han Leng remained lost in thought, Lady Zhao sent another message to him, “Buy three tickets. I’ve invited Bai Yunshan. Lady Bai is also an old classmate of ours.”</p><br/><p>Han Leng’s smile gradually faded…</p></div>\n</div>"}