{"title": "Chapter 689 - Fishing in Troubled Waters", "id": 689, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-689-fishing-in-troubled-waters", "volume_title": "Volume 7", "body": "<h1>Chapter 689 - Fishing in Troubled Waters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Facts have shown that fate had entwined Yennefer and Cirilla together. They had a rough start but eventually learned more about each other and became like mother and daughter.</p><br/><p>In the process, Yennefer truly started to view Cirilla as her daughter and would do almost anything for her. On the contrary, the word “mother” rolled off Olivia’s tongue with buttery smoothness, but it was just a word.</p><br/><p>Yennefer was also very critical of Olivia’s enthusiasm of introducing more sorceresses to the White Wolf. Moreover, she sensed Olivia’s immense thirst for power. She was almost like a female Emperor Emhyr.</p><br/><p>The difference that separated Olivia and the Emperor was the former having technology – a product of combining science and magic that was ahead of its time.</p><br/><p>Yennefer took her two daughters to the Temple of Melitele in Ellander for further studies. In the temple, there was not only magic, but also the mystery of divinity.</p><br/><p>Olivia was pleased. She had already stockpiled a vast amount of skill points. Maxing these new skills out would not be an issue.</p><br/><p>The Temple of Melitele was located just outside the main city of Ellander. It was quite possibly the most well-known of the goddess’ monuments. A poplar-flanked road stretched from the gate to the buildings near the sanctuary and the main temple block which was built against a mountain wall. There were gardens and outbuildings, and the grotto, and something that functioned like a greenhouse hewn from rock and roofed over with crystal.</p><br/><p>As the news of war began to spread, Yennefer decided to leave the Temple of Melitele with her two daughters and head towards Gors Velen. At the same time, it was for their education. Yennefer was going to attend a conference of mages being held nearby Thanedd Island. She also planned to enroll her two daughters into the Sorceress Academy of Aretuza which was situated on the island after the conference ended.</p><br/><p>However, things did not work out as Yennefer had planned, not by a long shot. On the eve of the convened conference of mages, a premeditated coup d’état occurred in Thanedd Island —- —- various forces like the sorcerers, the Empire, the Northern Kingdoms and the Scoia’tael were involved.</p><br/><p>Both Vilgefortz and Cahir, the Nilfgaardian knight who had once taken Ciri out of Cintra tried to kidnap Cirilla in the process.</p><br/><p>Cahir and Vilgefortz knew Olivia rather well. The former had been unlucky. He had initially thought that he could bring both princesses back, but ended up losing both of them. Thus, he was thrown into prison by the angry Emperor. Now, he was finally being given orders again. The latter used to be Olivia’s teacher, but he was obsessed with Cirilla’s blood. He had always hoped to obtain her “Elder Blood.”</p><br/><p>Originally, when Vilgefortz planned to help Emperor Emhyr reclaim the throne, he had already set his eyes upon Cirilla. However, Pavetta actually saw through their scheme, which rendered all his plans moot…</p><br/><p>This time, during the coup of Thanedd Island, his goal was Cirilla. His actions exposed his true loyalty. Hence, Emperor Emhyr could no longer trust him.</p><br/><p>In actuality, no one knew that there was only one real winner this time — and that was Olivia!</p><br/><p>As a powerful leader, she had long heard of rumors saying that various forces were going to stir up trouble on Thanedd Island. She had come prepared. Moreover, she was glad that she now had complete access to the Sorceress Academy of Aretuza. Why not move all of its knowledge to Kaer Morhen?</p><br/><p>One had to know that Thanedd Island was built by the elves with magic. It was a place that was specifically raised for sorcerers, by sorcerers. There was a sorceress academy on the island. The island was connected to Gors Velen by a bridge.</p><br/><p>From a distance, Thanedd Island looked like the base of a gigantic stone column stuck into the seabed, a huge ziggurat encircled by a spirally twisting road and zigzagging steps and terraces. The terraces were green with groves and gardens, and protruding from the greenery — which clung to the rocks like swallows’ nests — rose soaring white towers and the ornate domes of groups of buildings framed by cloisters. They seemed to have been carved directly from the mountain’s rocky slopes.</p><br/><p>At the peak of the island was The Tower of the Gull, Tor Lara, which had a portal inside of it. The island itself was actually hollow. It could be accessed from the sea via the underground passages, which was a certainly stealthier way compared to land.</p><br/><p>Olivia passively watched the various forces mess up the famous Sorceress Academy. Apart from the main section of the academy, most of the other places like Garstang Palace and Loxia Palace were no longer functioning. Olivia, who had long awaited this day, sent her people to work and together, they moved the precious magical knowledge back to Kaer Morhen.</p><br/><p>However, as she was busy with things, Olivia had neglected Cirilla. Even so, she had enough faith in Cirilla’s personal strength.</p><br/><p>Of course, Geralt was also present when the Thanedd coup happened. To protect Cirilla, Geralt got into a fight with Vilgefortz that ended up with his right leg smashed.</p><br/><p>Vilgefortz excelled at both magic and melee. Geralt stood no chance against him!</p><br/><p>He actually broke Geralt’s leg with a single staff!</p><br/><p>At that moment, Geralt learned that this Vilgefortz was his mortal enemy!</p><br/><p>Before the clash, they had a verbal exchange of philosophy…</p><br/><p>“When you think, you have to look at the sky, then the stars. Don’t mistake the stars reflected in the pond at night for those in the sky,” he had said to Geralt.</p><br/><p>It turned out that he had accompanied Francesca Findabair to the Thanedd ball which was held before the meeting. He looked no more than thirty-five at that time. He was tall and well-built. He wore a short jerkin of a knightly cut – but without a coat of arms. It did not help that he was also fiendishly handsome. Even though the blue-eyed, amazingly beautiful Francesca Findabair was next to him, he still stood out.</p><br/><p>He had invited Geralt to visit the gallery with him where they had a philosophical exchange, hinting that Geralt should hand Cirilla over to him.</p><br/><p>In the subsequent Thanedd coup, Philippa Elhardt believed that he had colluded with Nilfgaard and had accused him of treason. Vilgefortz was then placed in dimeritium shackles. However, because someone used magic to break the shackles, he broke free and had tried to capture Cirilla. On his way, he encountered Geralt. Vilgefortz did not resort to magic. Instead, he had attacked Geralt with a staff. In two moves, Vilgefortz easily defeated the veteran witcher. Following that, he broke Geralt’s leg but left him alive. He then continued to go after Ciri.</p><br/><p>Vilgefortz never accounted for one thing. Another obstacle stood in his way. It was actually Olivia, his former apprentice who had robbed the island of its knowledge as chaos ensued on its surface.</p><br/><p>“Teacher, long time no see,” Olivia said with a smile, bowing courteously. Both her hands were empty, and her smile was beautifully cold.</p></div>\n</div>"}