{"title": "Chapter 709 - Tempting Promises", "id": 709, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-709-tempting-promises", "volume_title": "Volume 8", "body": "<h1>Chapter 709 - Tempting Promises</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Zhao Youyue was most definitely not short of money. Her companies had outstanding content creators from various fields. Although it was not yet yielding tens of millions on a daily basis, those seven figures were still involved. She had other sources of income such as broadcasting, video production and song composition. Even the profit from Weibo’s advertisements went directly into her pocket…</p><br/><p>Recently Lady Zhao just started to get involved with Douyin. In her free time, she would make some cute 15 seconds short clips. She even composed the short snippets of music in those clips for the added effect. It was a platform that gave privileges to beautiful faces and cute voices, and Zhao Youyue fitted right in. It took her no time to amass tens of millions of fans. As her popularity shot up, so did her income.</p><br/><p>This era was superficial — they judged everyone by looks before all else. Popularity was directly proportional to income. Individuals with a broad range of contacts like Lady Zhao stood to gain everything.</p><br/><p>Money was no problem for Lady Zhao.</p><br/><p>Of course, someone had to manage all that money. Her parents were more than willing to take up that role. This left her with nothing to worry about but how to spend so much money. She would have to earn more than she spent.</p><br/><p>In this age of capitalism, a huge capital would only pave the way for more riches. Of course, one must not spend extravagantly. The poor could only depend on the social system to throw a bone or two their way.</p><br/><p>This was why Zhao Youyue could easily sponsor any of the online novels she wanted. She could easily earn the title of golden league sponsor. As long as an extremely wealthy tycoon like Zhao Youyue was willing to support a novel, the author could rest easy and write in peace without having to proactively pitch their stories.</p><br/><p>Under the same circumstances, Zhao Youyue could use her own pocket money to rule over the Student Council. Hence, It did not matter if she could generate more money with the preallocated budget. Only Zhao Youyue would dare to promise a boost for the budget for all societies. Of course, there were certain conditions to fulfill, such as how much each society contributed to the school…</p><br/><p>This promise was a killing blow to Qiao Fei. She could not and did not have the guts to make such a promise!</p><br/><p>Qiao Fei had managed to slash the budgets of smaller societies only to increase the portion for larger societies. Since the larger societies had more members, she would have gained more support. Smaller societies were expendable; hence their benefits could be sacrificed for the good of everyone.</p><br/><p>That was not all for Zhao Youyue’s election manifesto. Drafted by Han Leng himself, it had been tactfully worded to please everyone from all societies. It even took account of those indifferent students who would never get off their chairs to vote.</p><br/><p>There was no doubt about it. Most of these students were gaming addicts. Hence, Zhao Youyue decided to organize an annual gaming festival — a virtual game competition within the university, complete with lucrative prizes for the winners!</p><br/><p>Let’s not even talk about the prize money, she offered something far more important — curriculum points. In other words, no more boring conventions, no more lame activities. You could ‘farm’ for these points by playing games. This was heaven for a certain group of people!</p><br/><p>As for those focused on academics, Zhao Youyue had promised to use her influence to invite prominent speakers to the University of Jiang Nan. She could also throw in some celebrities for the university’s annual festival!</p><br/><p>Celebrity chasers and fanatics were thrilled. Everybody knew that concert tickets were hard to come by. It was even harder to get their autographs! However, Lady Zhao had promised to bring these people into the university, who could say no to that?</p><br/><p>Most importantly, only Lady Zhao could actually make this happen. As for Qiao Fei or Chen Ye, they could take all that experience and know-how, ball it up, and dunk it down the trashcan!</p><br/><p>Which such a detailed manifesto, Cao Chuanguang and Chen Ye’s assault were halted in its tracks. Chen Ye had bluffed about making the University of Jiang Nan great. He was merely a Student Council President — what could he possibly do?</p><br/><p>Lady Zhao had a heck of a lieutenant. Throughout the entire manifesto, Han Leng had never strayed from its theme: everything was for the sake of the students in the University of Jiang Nan. The only president who could serve every student of the university was the wealthy and responsible Lady Zhao, along with her network of great forces. She was a stellar student with amazing results, and she had the charisma and personality. She may just be a Year One student, but of everyone in the Student Council, she was the most capable!</p><br/><p>As long as she was the president of Student Council, she would have a lot more leeway than what she could already bring to the university. Not only was she better than the other candidates, but she was also far better than all the other past presidents!</p><br/><p>Upon its release, Zhao Youyue’s election manifesto instantly spread to every corner of the university. Meanwhile, the voting system no longer used paper ballots; they were done electronically through mobile phones. Each student could only vote once. The voting system had stringent, tight rules to prevent duplicate entries.</p><br/><p>Of course, some wealthy candidates could still dump some money to buy votes over. Truth be told, not many students would sell their votes at a very small price. If they were ever caught, the entire election might even be scrapped.</p><br/><p>When Zhao Youyue’s election platform was made public, the University of Jiang Nan students made these comments,</p><br/><p>“All hail Lady Zhao, long live Lady Zhao, why have I not yet voted, I will vote now!”</p><br/><p>“The promises made are too good to be true, but we’re talking about Lady Zhao here. I’m voting for her!”</p><br/><p>“What’s with Qiao Fei’s and Chen Ye’s manifesto? They are nothing compared to Lady Zhao’s. Even if Lady Zhao is lying, I’m fine with it. She’s more than qualified to talk big!”</p><br/><p>“I’ve never paid any attention to presidential elections, but it feels as though whoever wins would be the same. After all, the Student Council has nothing to do with me, but now, Lady Zhao has even taken us vagrants into the frame, I will vote for her!”</p><br/><p>“It’s good to be rich, all this while I heard that past presidents have used the budget for their own interests. When Lady Zhao becomes the president, we don’t have to worry about her being corrupted or misusing the budget allocations. What interest would she have in that measly sum? I’m voting for the incorruptible!”</p><br/><p>“I am also a year one student, and it is cool that a year one student can be the president. I’d like to see such a fantasy come true, I’m all for Lady Zhao!”</p><br/><p>…</p></div>\n</div>"}