{"title": "Chapter 708 - Let The Games Begin!", "id": 708, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-708-let-the-games-begin", "volume_title": "Volume 8", "body": "<h1>Chapter 708 - Let The Games Begin!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Many were surprised to find Zhao Youyue being one of the candidates, especially the year-one students. They all believed that a high-ranking position such as president of the Student Council would never be taken up by a Year One student…</p><br/><p>They could not help but wonder. How was Zhao Youyue even allowed to run?</p><br/><p>Was it due to her reputation, family background, and ridiculous levels of self-confidence?</p><br/><p>Upon investigation, they were surprised to learn that Lady Zhao had long been a member of the Student’s Council. She was even the Deputy Head of the Literature and Arts department. Her Food Research Society had grown influential and popular, which was a testament to her capabilities. She totally qualified as a candidate!</p><br/><p>We’ve definitely heard cases of Deputies usurping the positions of their heads…</p><br/><p>Of course, those odds were ridiculously low. If one was not capable, it would all be pointless, even if against all odds, they were to obtain the seat by chance. They would be no better than a cut of meat slapping itself against a sizzling grill and turning over. Eventually, they would step down in disgrace. All those weeks of fighting and struggling, only to crash and burn miserably.</p><br/><p>The Student Council’s president was not meant for those who were not cunning or manipulative enough to draw attention with a boom. If one did not have the desire or respect for the position, they should remain where they were. With the wrong stones set in place, it would all be an act of risking one’s “political future.”</p><br/><p>Under such circumstances, deputy ministers would know better than to risk it with a bad hand. Instead, they helped their respective heads. If their contributions were noted, would they not succeed the Head’s position by default?</p><br/><p>Take Cao Chuanguang as an example. He was helping Chen Ye with all his heart. Apart from being very close with Chen Ye, he wanted Chen Ye to be elected as the president of the Student Council. The sooner, the better, so that he could succeed the position. One day in the future, he might follow in Chen Ye’s tracks.</p><br/><p>Cao Chuanguang gave it some thought. He even plotted against Qiao Fei, planning to destroy her “selfless, fair, just” image. He would like to see her retain her image and the trust of her followers after that. With her out of the way, what else could possibly thwart Chen Ye’s dreams?</p><br/><p>One must not mistake Cao Chuanguang as overconfident. In reality, only a handful qualified to be a president — any president. Qian Fei and Chen Ye had both built up such solid images of themselves that everybody would assume them to be untouchable deities. Everyone knew that Qiao Fei had only lost the previous election because she had crossed the wrong person — Lady Zhao. This time, she had not repeated the mistake. Lady Zhao would not step in and intervene again, or she would risk getting herself called Lady Zhao the Unreasonable Person.</p><br/><p>Lady Zhao might have come from an influential family — but it gave her no right to be unreasonable. What was there to stop Qian Fei now? She had the capabilities, the experience, and Lady Zhao had long turned her sights elsewhere. The Chen Ye – Cao Chuanguang pairing might just be the only thing that could trip her over.</p><br/><p>On the other hand, Qian Fei currently possessed unprecedented levels of confidence. She could already taste her victory. Her face glowed with confidence as she strolled across the Student Council’s floor.</p><br/><p>Finally content with his preparations, Cao Chuanguang leaned back in his chair. On the other hand, Qiao Fei had already thought herself untouchable. She started having full nights of sleep again, anticipating a most glorious showing in the upcoming elections. That was when news of Zhao Youyue’s participation swept through the entire university like a tsunami!</p><br/><p>If it was any other Deputy but Zhao Youyue, Chuanguang, and Qian Fei might have just chuckled. They could easily take care of this new surprise without needing to lift a finger. That person challenged the unspoken rules of society… they needed to know their place.</p><br/><p>Zhao Youyue was no ordinary Deputy. Cao Chuanguang and Qiao Fei might have had stellar chances, but things were now different. Both individuals immediately held emergency meetings with their teams to talk about this new threat.</p><br/><p>Cao Chuanguang’s committee members were the more loyal of the two. Most of them had personally been placed by Cao Chuanguang in their current seats and more than owed him. Each of them was a competent spin-doctor in their own right. They soon came up with a “proposal” — a list of plans to attempt smearing the name of Lady Zhao — such as accusing her as a two-faced liar, living a messed up and complicated private life, and her ridiculous spendings. All of them focused on common negative perceptions of wealthy kids.</p><br/><p>The Lady Zhao in public showed no indication of being from the same cut — most did not know her in person. All they knew of her came from hearsay on the social media…</p><br/><p>Cao Chuanguang was ruthless. He may have once been madly in love with Lady Zhao, but that infatuation was long gone. Only hatred stood in its place. Without hesitation, he took the wheel and headed for that direction.</p><br/><p>People started talking. Oh, Zhao Youyue is no different from the others. Empty promises, sweet nothings. Lady Zhao did not have her own campaign committee. She definitely needed capable individuals in various positions of the council. One person could only do so much.</p><br/><p>Qiao Fei’s group continued emphasizing on that angle. Lady Zhao was overselling herself. What can her current fame and popularity do in an actual position? She would never last a single term. As a president, she needed to at least be the part, even if slightly. She had no right to appoint people at random. Not only would it cripple the entire organization, but it might even sink the ship!</p><br/><p>There was a reason why the elections were so frequent. Each department could operate independently without the president. Most of the previous presidents could only temper each department, little by little. They have never been able to initialize a full revamp of the entire body. It would only inflict chaos on an uncontrollable scale.</p><br/><p>Now, people would look down on Lady Zhao and treat her as a laughing stock. She might not even have a proper manifesto for her candidacy…</p><br/><p>Or so they thought. Lady Zhao soon announced her election manifesto: a promise to increase the budget of all societies. How does that happen?</p><br/><p>Brute wealth. Is she even living in the real world?</p><br/><p>Now everything was set. Let the election for president of the Student Council commence!</p></div>\n</div>"}