{"title": "Chapter 700 - : I Came, I Saw, I Conquered", "id": 700, "volume": 7, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-700--i-came-i-saw-i-conquered", "volume_title": "Volume 7", "body": "<h1>Chapter 700 - : I Came, I Saw, I Conquered</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Everyone could not help but admit that Olivia’s timing was impeccable! She had struck while the prey was weak and weary Both the Northern Kingdoms and the Nilfgaardian Empire were barely standing as it was.</p><br/><p>Every single person in the entire continent now knew Olivia’s name. Her monopolized goods were sold almost everywhere in the entire continent.</p><br/><p>The Nordlings had long known Olivia as the ‘Pearl of the Northern Kingdoms.’ It could even be said that Olivia was the only woman in the world with portraits of her own…</p><br/><p>The citizens of the Nilfgaardian Empire only learned of Olivia as Emperor Emhyr started spreading news about her, saying that she was the Emperor’s biological daughter or whatnot. They concluded that she was indeed the Emperor’s daughter by looking at her appearance and hair color. This finally explained why the Emperor favored her so extensively. He had even hinted that Duchess Anna of Toussaint bestowed a Countess title upon Olivia.</p><br/><p>In conclusion, people were highly fond of the most beautiful human princess who was very likely to inherit the vast Nilfgaardian Empire.</p><br/><p>That’s right. Olivia was not aware of all this chatter concerning her name. She was called the most beautiful ‘human princess,’ as it would be less controversial. After all, if she was said to be the most beautiful woman, then there was still the leader of the Scoia’tael, ‘Francesca,’ Queen of the Elves. Well, everyone knew that when beauty reaches a certain level, all that was left for comparison would be talents and abilities. Beauty was subject to every individual’s interpretation.</p><br/><p>Interestingly, at some point, some people felt that Olivia’s guardian knight, the young and powerful witcher, Cirilla, was actually not far off from Olivia!</p><br/><p>That’s right. In the past two years, Cirilla’s appearance had taken a radical change. If Yennefer originally ridiculed her as an ‘ugly duckling,’ then the current her would be a white swan!</p><br/><p>Cirilla had also found a new purpose in life other than being with her sister. That was, being a free-spirited and unrestrained witcher.</p><br/><p>Of course, while being a witcher, she continued gathering intelligence for her sister. She never let her down even once.</p><br/><p>Olivia had even developed magical equivalent to phones. She could assign quests to the witchers wandering in foreign lands whenever she received any new quests.</p><br/><p>When Cirilla witnessed the extent of Olivia’s abilities during the battle against Vilgefortz, she was assured about Olivia’s safety since then. Of course, she still stuck to her sister most of the time, living in a happy world that only contained the two of them. The rest of her time was spent exploring the continent, hunting monsters, and collecting Gwent cards…</p><br/><p>It was amazing. As Olivia’s reputation grew, Cirilla became lucky enough to acquire an Olivia Gwent card!</p><br/><p>This Gwent card was undoubtedly a hero card. A gold border lined it. It was a Neutral card that was available to all factions. Her combat points were 10. It may not be as high as Geralt and Cirilla’s 15 combat points, but she had several unique abilities. It could even directly cripple her opponent’s combat points!</p><br/><p>This way, if her opponent’s deck had a card with the highest combat points of 10, Olivia’s Gwent card could instantly kill off that opponent’s card. At the same time, her very own combat points would take in that 10 points!</p><br/><p>Those who were familiar with the Gwent cards would instantly note that this epic card was a broken game-changer. As long as this Gwent card was present, it was a compulsory for just about any possible deck.</p><br/><p>It had to be an extremely rare card — no more than five of them would be found in the entire continent!</p><br/><p>When Cirilla picked this card up, she treated it like a national treasure. She could not wait to go back to Olivia’s side and use her Northern Kingdoms Gwent deck to destroy Olivia’s Nilfgaardian Empire Gwent deck. At the same time, she would use this Olivia Gwent card to bully her sister.</p><br/><p>Olivia’s appearance in the Gwent card was beautiful and domineering. She was quoted as saying –</p><br/><p>“I came, I saw, I conquered!”</p><br/><p>Gwent was the Easter Egg of the Source World. The records of the character and their descriptions were very similar to the personalities of the characters!</p><br/><p>Olivia’s fangs had been completely revealed with the debut of her secret army. She was just like the autumn wind sweeping away fallen leaves. First, she devoured all of the smaller countries in the Northern Kingdoms. Then, she ignored the warnings issued by the bigger countries. Nobody had the right to deny her from her goal!</p><br/><p>Wherever Olivia’s eyes landed on was her territory!</p><br/><p>Originally, people thought that Olivia proclaiming herself as an Empress Regnant was a big joke. However, as Olivia conquered more and more countries, the nobles who dared to resist, and even the nobles who did not resist were stripped of their feudal fiefdoms. Everyone then suddenly discovered that this was not some joke. This was the truth!</p><br/><p>The Kings who thought Olivia was just some merchant in the past could not accept this twist. After some Kings who refused to yield to Olivia were sent to the guillotine platforms, they begrudgingly accepted that this was now the harsh, ugly reality and not some nightmare…</p><br/><p>In just three months’ time, the Northern Kingdoms fell to Olivia, the Empress Regnant. The previous aristocratic system was completely revolutionized. It was replaced by a monarchy with an extremely centralized power. Nobles would no longer be granted with fiefdoms, but they could still keep their titles.</p><br/><p>After Emperor Emhyr knew about the fact that his appointed heir, Olivia had conquered the Northern Kingdoms, he fell into a state of confusion. This was his dream. In the blink of an eye, half of the continent had already fallen to his daughter. What is going on?</p><br/><p>Little did the Emperor expect that as he was severely bruised and battered in quelling the nobles’ rebellion in his country, his daughter did not give him any face at all! Olivia, along with her protective Knight and fellow Empress, Cirilla personally led her army to conquer the continent. They had even crossed the border of his Empire!</p><br/><p>That’s right. Olivia, the Empress Regnant, had boldly strode on the Yuri path and married her sister, Cirilla. This love in a fallen city between the two unrivaled beauties had even received the blessings of the entire world. They were just too beautiful — no man was worthy of them. Thus, this was the best possible outcome!</p><br/><p>They had even used some Yuri magic technique and gave birth to a baby girl called ‘Artoria.’ Artoria would be their sole heiress…</p><br/><p>Furthermore, the Nilfgaardian Empire was currently embroiled in civil strife. Even if the Empire did not have civil strife, how could an agricultural-based country resist an attack from a dark technology country?</p><br/><p>Therefore, the Nilfgaardian soldiers quickly surrendered at the hands of Olivia. It was the wiser and rational choice. Wasn’t she supposed to be the successor of the Empire?</p><br/><p>Why not just pass the Empire to this Empress Regnant who was more like a fierce tigress, than human?</p></div>\n</div>"}