{"title": "Chapter 717 - Reality and Fantasy", "id": 717, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-717-reality-and-fantasy", "volume_title": "Volume 8", "body": "<h1>Chapter 717 - Reality and Fantasy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was not bad to have conflicts. Instead, it could be seen as part of the run-in process. Anyway, if the ‘Virgin Mary,’ sensitive Zheng Yi became partners with the cool, rational, and self-centered Chu Xuan, they would instead reshape each other’s thoughts, thus complementing their strengths.</p><br/><p>In such a situation, readers would be at ease. Initially, they were worried that the ‘Virgin Mary’-styled protagonist would face loss after loss, and be the scapegoat time again. With Chu Xuan, Zheng Yi would never fall victim again. The only person who would victimize him would be Chu Xuan!</p><br/><p>It would be interesting to watch. A loveless, sparkling relationship. Without either one of them, the squad would be incomplete.</p><br/><p>In a novel such as this that contained the ideal main cast, readers would not just be paying attention to the main character. So what if their opponents are some random cameos? All they needed was some distinct personalities and living brains. To showcase Chu Xuan’s intelligence, then obviously she must be paired with someone of the same intelligence as hers in the battlefield.</p><br/><p>After Zhao Youyue ensured Chu Xuan’s future inclusion to “Endless Apocalypse,” she felt that half the battle had already been won. It was time to pass through the ‘Two-dimensional Gate’ and possess Chu Xuan.</p><br/><p>As Zhao Youyue had full faith in the abilities of the ancient High God, possessing ‘Chu Xuan’ would be as good as claiming her iconic card. She had paid for this premium service with a character card, and not have to crack her head trying to salvage a plot that may well be falling apart.</p><br/><p>This time, Zhao Youyue was content with leaving Professor Chen to her devices. Who knows, Professor Chen could even obtain the nickname, ‘Chen One-man show.’</p><br/><p>As Professor Chen went all out with her pen, the only thing that Zhao Youyue could do to help Professor Chen was to increase the sales of “Endless Apocalypse” by giving it rewards. This would help it gain recognition.</p><br/><p>This could be considered as Zhao Youyue’s form of payment. When ‘Chu Xuan’ gains iconic status, then who knows, Zhao Youyue could become a real life super fanatic researcher or mad scientist. She would start producing some terrifyingly dark technology. Wouldn’t that be interesting?</p><br/><p>Similarly, Chu Xuan’s ability would end up pretty useful in the Source World. Upon activation, her analysis, investigative, and planning abilities would be maxed out. If she used her ‘Eyes of God,’ nothing could elude Chu Xuan’s schemes.</p><br/><p>Chu Xuan’s power level may not be particularly high, but her research and invention abilities were truly incredible. She was not called “Doraemon” for nothing. You could misname a person, but you could never mis-nickname them.</p><br/><p>Zhao Youyue may have laid out sufficient preparations, but she was not able to transmigrate there and then — not yet. After all, ‘Chu Xuan’ had not yet even appeared in “Endless Apocalypse.”</p><br/><p>According to Professor Chen’s plans, Chu Xuan would only appear when the world experiences the second apocalypse. Not long after that, she would join the protagonist, Zheng Yi’s squad. This time, they would not save the world, but instead, they would destroy it. Their enemies would not be humans. It was a world where humans have been all but eradicated by aliens. It was most cruel…</p><br/><p>Of course, the quests given out by the King of Gods would not lead them to a path of absolute destruction. Destroying a world was no easy task. For starters, destroying a small village would suffice. Eventually, we could up the scale and take out entire planets.</p><br/><p>Zhao Youyue was confident about this easy victory. She was about to possess a godlike character with maxed out planning, analysis, research, and strategizing. The world was beautiful. All is well.</p><br/><p>If ‘Chu Xuan’s’ iconic card was obtained, her intelligence levels would surpass new boundaries. Part of her cognitive processes would be driven by something best described as an autopilot brain assisting software. She had never been more eager for a character card.</p><br/><p>Of course, she was also prepared for the possibility of its abilities being watered down in real life. After all, dark technology might just be too much for the real world to take in at the moment…</p><br/><p>Anything that stands out would be hammered down like a stubborn nail. However, if she had the researching abilities of ‘Chu Xuan,’ she could start from scratch in real life. This could support Lady Zhao’s plans of starting a high-tech electronics company.</p><br/><p>Therefore, she might not end up reproducing the effects seen in the novel. Zhao Youyue would have to personally lay out the finishing touches to settle for a compromise in the real world. The character card’s ability could not produce miracles out of thin air, or go beyond the rules of reality.</p><br/><p>That being said, reality did permit the existence of some magic and supernatural phenomenon. Look at the ‘Wen Qingyu’ character card. It had the ability to eat books. However, in the real world, she was not eating books, not literally, at least. To others, she would just appear to be fully absorbed in her books.</p><br/><p>The real world was precise, like clockwork. That rigidity only drove its inhabitants to be particularly imaginative. They would always fantasize about other worlds that contained sorcery, magic, or unusual abilities, etc. If one already had to deal with such elements in the real world, why dream about them?</p><br/><p>Regardless, Zhao Youyue was very satisfied with how things were. She would never have to worry about the real world ending up like the Source World. World-ending levels of chaos, illusion, disenchantment, and sorrow would never happen in the real world…</p><br/><p>If the real world collapsed, those fantastic creators would not be free to work their minds.</p><br/><p>Reality was boring and full of limitations. At the same time, it drove its inhabitants into believing the impossible. But, of course, they were possible! The only problem was that they happened to break the rules of reality…</p><br/><p>From another perspective, if the ability could conform to the rules of reality, it would have no problem manifesting in any Source World. The Source World, in a sense, was reality with an altered level of energy. It was powered by the brains of various creators. As those otherworldly ideas took form, the world would wrap itself around them, trying to be one with them.</p><br/><p>Zhao Youyue’s character cards might just end up as watered down versions of their fictional counterparts. However, the Source World would permit the full release of their powers! The Source World was a world of iconic works that was free of creators’ intervention!</p></div>\n</div>"}