{"title": "Chapter 714 - Professor Chen", "id": 714, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-714-professor-chen", "volume_title": "Volume 8", "body": "<h1>Chapter 714 - Professor Chen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>PhD’s name was called Chen Chen. It sounded like a gender-neutral name. People who have never seen her might assume her as male from the name alone.</p><br/><p>There was no helping it. Professor Chen’s work would always be laden with heavy sci-fi elements. It often left readers baffled but impressed. Of course, such faux-science would never fool the real experts. However, there was more than enough clueless outsiders to go around the world. Some diehard fans would treat the fabricated faux-technology in Professor Chen’s work like the real thing…</p><br/><p>Admittedly, Professor Chen’s writing style took itself way too seriously. Who knows, she might be firmly convinced that her very own dark technology was the real thing as she got absorbed in writing. Having lost herself in those thoughts, she would introduce the technology in a dissertation paper. Readers would no doubt be impressed at the level of detail, even if they knew better than to believe it.</p><br/><p>Master PhD, otherwise known as Professor Chen, was not very difficult to approach. Lady Zhao was basically the God of Tycoons in the web novel circle. Her reach knew no bounds. Even the most badass High God would have to give her face.</p><br/><p>This had nothing to do with how Zhao Youyue randomly gave out Silver Sect or Golden Sect Masters. It was all about her wide range of contacts. If an author intended to market his work, how could he do it without any connections?</p><br/><p>Perhaps the average web novelist would remain unaware about Zhao Youyue’s identity. They would probably assume that she was a regular God of Tycoon or a bot account. High God authors who wanted some exposure would contact this bot account. It was probably the face of a marketing company. Either way, it could increase their reward points or promote their works in the site.</p><br/><p>However, the actual High God level-ranked web novelists all knew that “Tycoon Youyue’s” full name was Zhao Youyue. Everyone would respectfully address her as the ‘Missy.’ As for this Missy’s identity, it’s best you don’t dig into it if you’re the type to get jealous. Zhao Youyue was most probably the only person that the rich tycoon boy Ding Yuncong would joke about being her chauffeur.</p><br/><p>It may just be a flippant joke, but based on his words, one could see how highly he regarded the Lady.</p><br/><p>Additionally, there was also the similarly famous Zhao Hao. He was even more handsome than Ding Yuncong, albeit lacking slightly in height. He definitely did not lose out in terms of wealth. In other aspects, he actually surpassed Ding Yuncong.</p><br/><p>Zhao Hao and Zhao Youyue were related by blood. It was natural for him to pamper her. If anything, he was firmly convinced that everything he said about her was watered down. He had the ultimate say concerning investment projects about his sister. Perhaps due to the groundbreaking success of the “Beautiful April” film adaptation, his words now carried far more weight.</p><br/><p>Zhao Hao had already regarded his sister as a treasure. He did not have the talent to match up to his sister, but he could definitely provide her the stage to showcase hers. Either way, it was a good thing, whether it was his sister, him, or even the entire Zhao family.</p><br/><p>All in all, the High God authors who were in the loop about Lady Zhao’s highly impressive background had also polished their bootlicking skills. Even those who did not practice that would at least show some her some respect. A personal invitation from the divine would never take no for an answer.</p><br/><p>As an ancient High God, Professor Chen still remained in contact with the numerous famous authors who had started with her in the beginning. It was how Zhao Youyue got in touch with this elusive professor. It was time to smoke her out…</p><br/><p>That was when she found that Professor Chen was actually pursuing her Doctorate in Jiangnan University!</p><br/><p>Master PhD might even be Zhao Youyue’s senior!</p><br/><p>Nobody would ever believe where Tycoon Youyue and Master PhD first met in person. It was Jiangnan University’s ‘White House,’ or in other words, the Student Council President’s room.</p><br/><p>Prior to the meeting, Zhao Youyue had attempted to paint a picture to the pen-name, “Master PhD.” How would a Master PhD look like? Would she be sporting a long, white lab coat with high-powered glasses on a cold, poker face? Would she look like a mad scientist?</p><br/><p>When she met Professor Chen, that image had shattered into a million pieces.</p><br/><p>Professor Chen was petite, barely standing over 150cm. She was sweet, cute and did not have any glasses on…</p><br/><p>Chen Chen revealed a slightly embarrassed smile. Her loli voice that matched her body squeaked out, “How are you, Ms. President.”</p><br/><p>Zhao Youyue could not believe that this Professor Chen was already 28 years old. She was already close to graduation.</p><br/><p>Professor Chen started writing web novels when she was 15 years old. That was 13 years ago. At that time, web novels were just emerging. Compared to the current state of affairs, it had only been the tiniest speck at the center of a quark…</p><br/><p>The web novelists who debuted around the same time as Professor Chen would never have expected this fellow pioneer to actually be a cute legal loli who even knew how to play a part.</p><br/><p>Therefore, Professor Chen’s “a guy’s promise” was utter hogwash. So was her typical wager of how “if you’re not able to fulfill the promise, then wear women’s clothing.” She was already in women’s clothing, and not just any women’s clothing, but the super cute, pink fluffy type.</p><br/><p>Zhao Youyue returned Chen Chen’s greetings and addressed her as ‘Master PhD.’ Professor Chen blushed. “Don’t call me Master PhD. It sounds like you’re calling me a child with a big butt [1]. Just call me ‘Professor Chen.’ I prefer the title ‘professor.’”</p><br/><p>Professor Chen was proud of her identity as a female professor. No matter how you look at it, a Sociology certification from the world famous Jiangnan University was highly respectable.</p><br/><p>However, some men in this world would still look down on female professors. Ladies belonged to the third species. It was most probably a defense-mechanism that over-compensated for the male sense of inferiority, when in the presence of an alpha female.</p><br/><p>“Alright. How are you, Professor Chen? I really did not expect to find a High God like you to have hidden in Jiangnan University. You’re actually my senior! This feels so surreal!” Zhao Youyue said rather sincerely.</p><br/><p>Professor Chen was clearly not that type of slow-witted person who knew nothing about socializing. She quickly stepped into the ‘you flatter me — I flatter you’ game. “It’s natural for me to slip past your divine gaze. But I do know you. You ran for the Student Council Elections, and I actually voted for you! I really like Hua Chenyu. Do you think you can get him to sing at Jiangnan University?”</p><br/><p>Zhao Youyue was not the type who idolized celebrities. They weren’t really that special to her. She could even command any single one of them to take her out on a date. However, she kept herself in the loop. This was why when she heard about Professor Chen’s half-joking request, she accepted it without blinking, which left the Professor floored.</p><br/><p>Lady Zhao widened her smile “Professor Chen, let’s talk about your new book “Endless Apocalypse” … That smile only made her more beautiful than ever, but at the same time, she looked like a beast that was just revealing its fangs.</p><br/><p>Translation note:</p><br/><p>[1] “child with a big butt” () This is actually a pun on the author’s name. The Pinyin of the author’s name “Pi Da” (p) has another meaning, which is “big butt”.</p></div>\n</div>"}