{"title": "Chapter 727 -", "id": 727, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-727-", "volume_title": "Volume 8", "body": "<h1>Chapter 727 -</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Of course, after Zhao Youyue completed the source world created by the iconic “Witcher” series, its CG counterpart soon followed. Of course, the otherworldly travelers at the end of the series left the audience in the real world puzzled. On the one hand, some viewers found it rather refreshing. On the other hand, some viewers felt this intrusion had destroyed the image of an authentic sword and magic Western Fantasy world…</p><br/><p>However, considering how Cirilla had the “Elder Blood” and “The Gate of the Worlds,” it seemed like the appearance of a “Lord God” which could casually put people into various worlds was not entirely surprising.</p><br/><p>One had to know that in an alternate reality, the original “The Witcher 3: Wild Hunt” game that had not yet been intruded by Olivia, the protagonist Geralt had also traversed through time and space to look for his adopted daughter Cirilla. He entered various magnificent worlds of fantasy, one after another. Finally, he entered the world of Aen Elle, which was where the Wild Hunt was at. Then, he discovered the truth. Apparently, this world had been enshrouded in White Frost, and the elves had cultivated the “Elder Blood.” The elves hoped to find salvation from traveling to other worlds through “The Gate of the Worlds.” However, the elf that they had nurtured ended up bonding with a human, instead of an elf. These were Cirilla’s ancestors.</p><br/><p>Cirilla inherited the “Elder Blood” in all of its potency, which explained why the members of the Wild Hunt wanted to capture Cirilla in various ways. They intended to reclaim the “Elder Blood.” Only by this way, would they be able to traverse through different worlds on a large scale. Without such blood, the Wild Hunt could only crawl through different worlds at an agonizingly slow pace.</p><br/><p>Although the members of the Wild Hunt were all highly capable in their own right, against the modern magical army which unified the whole continent, things ended tragically for them. The squad which was an ally of the Wild Hunt soon faced the same, tragic fate. Initially, this squad which had to battle Yang Yunfei’s squad had remained confident and bold. Everything was surely going to go in their favor. They did not expect Yang Yunfei’s squad to achieve an actual sleeping victory!</p><br/><p>Who allowed this squad to arrive on the continent first, and then successfully become friends with Geralt through their own actions?</p><br/><p>Of course, Olivia also deeply respected her foster father Geralt. This truly upset her biological father Emhyr. He had been robbed of his daughter. Most depressing was how Olivia was not alone in her affection and respect for Geralt. Even Cirilla regarded Geralt as her father…</p><br/><p>Emhyr, who used to be powerful and dancing on top of graves was left very embarrassed. Even so, he still commanded the same level of respect. In either case, he was the biological father of the only empress in the entire continent, Olivia. His daughter had lived his dream of unifying the continent, with an amazing Empire to boot. Emhyr could only sigh, as he was incomparable to her. He leaned back in his chair, resigned to how he was bound to be outshone by her.</p><br/><p>Perhaps Olivia was still immature and rough around the edges. However, she had money, a modern army, and dark technology. Who could go against her wills?</p><br/><p>In the real world, the large-scaled epic anime, “Road to a Female Emperor” ended. Its fans were distraught. They could not wait to tell the whole world about this Western Fantasy work which was a masterclass. It had thoroughly well-written, and even the characters had been well-designed!</p><br/><p>A work like this, with a solidly constructed Westernized Fantasy world would probably never appear again in the future. It was as if such a world truly existed. This was no fiction. No human created this!</p><br/><p>As for its most popular character, that would of course be the legendary empress —- —- Olivia!</p><br/><p>At first, many viewers had thought that this Olivia was unremarkable. She had started off as a side-character. Nobody had given her much notice. Many thought that the “Elder-Blooded” Cirilla was the actual child of fate. Cirilla had started off ugly, but she was clearly a late bloomer. As the heroine later on, she blossomed most dramatically.</p><br/><p>On the other hand, Olivia was always beautiful since young. She was nothing more than a flower vase. Who would have thought that she had been hiding her true nature since the beginning!</p><br/><p>Many from the audience had thought the same as Olivia’s grandmother, Calanthe. They all thought that she was just a vase. Indeed, she was beautiful, but in this troubled era where many kingdoms were trying to survive, a beautiful girl like her would often encounter misfortune. If she could marry a capable aristocrat, she would be fine; otherwise, things would not look good for her.</p><br/><p>Throughout the ages, vase-like beauties were nothing more than playthings. Everyone’s attention would be placed on their appearances, not their abilities. Such was the sorrow of a beautiful woman. As long as beautiful women achieved something, she would most definitely be highly respected. This was the great thing about having good looks.</p><br/><p>Little did the audience expect to be slammed with such a huge plot twist. In the beginning, they had discussed if Emperor Emhyr of the Nilfgaardian Empire would be able to unify the entire continent. After all, this Emperor was harsh and ungenerous. But those were the strengths he required for great talent. Although he could not escape the limitations of history, there was nothing wrong with saying that he was a capable emperor.</p><br/><p>In addition to Emperor Emhyr, King Foltest, an “orthopedic” who had sex with his own sister also left a good impression on the audience. This King was terrific at military affairs, and he even dared to go onto the battlefield to give commands in person. His soldiers loved him a fair bit. The audience thought that if it was him, perhaps, he would be able to unify the entire Northern Realms, and then take the Nilfgaardian Empire head-on…</p><br/><p>However, after the two sides experienced no less than three major wars, they found themselves in a complete deadlock. This had paved the way for Olivia to claim her world. It was a great opportunity for the state capitalist Olivia’s Kaer Morhen to arise. If Olivia did not have a 100% chance of winning, she would never go through with it. But when she was sure of herself, she would sweep her power across the world like a tsunami!</p><br/><p>Viewers felt that such a development was highly fascinating. It was just like The “Romance of the Three Kingdoms.” Suddenly, a force had acquired the dark technology of aliens and then unified the three kingdoms at once. What happened to all forms of intrigues, conspiracies, and trickeries?</p><br/><p>However, everyone was happy about Empress Olivia being able to unify the entire continent, finally completing the “Road to a Female Emperor and then conquering various worlds through the “The Gate of the Worlds.” After all, watching Olivia grow up, step by step and acquire power, everyone had developed feelings for this legendary empress. Moreover, she did things like a true transmigrator. Naturally, everyone would approve and empathize with her…</p><br/><p>As “Road to a Female Emperor” gained popularity, it became a holy book. Gold would always shine. It would always be passed down through the ages. As an empress, Olivia was just like Wu Zetian[1] from the pages of the Chinese history book. She had transformed into an iconic figure. Whenever the empress was mentioned, Olivia would inevitably be mentioned as well.</p><br/><p>She was a legend. Hence, in the “Two Dimensional Gate,” she was both a legendary character card that was both extremely rare and precious!</p><br/><p>Translation note :</p><br/><p>[1] Wu Zetian, alternatively named Wu Zhao, Wu Hou, during the later Tang dynasty as Tian Hou, in English as Empress Consort Wu or by the deprecated term “Empress Wu”, was a Chinese sovereign who ruled unofficially as empress consort and empress dowager and officially as empress regnant () during the brief Zhou dynasty (, 684–705), which interrupted the Tang dynasty. Wu was the sole officially recognized empress regnant of China in more than two millennia.</p></div>\n</div>"}