{"title": "Chapter 729 - A Clear Goal", "id": 729, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-729-a-clear-goal", "volume_title": "Volume 8", "body": "<h1>Chapter 729 - A Clear Goal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Thought Su Li had not yet decided on which character she wanted to draw in “Road to a Female Emperor,” she had published a Dōjinshi of a certain nature for Olivia and Cirilla. [1] Perhaps this was what Su Li did best and what she desired to draw the most…</p><br/><p>In the past, Su Li had once published a breathtaking Dōjinshi for “Pure Romance.” It was the best days of her career. Her storyline and drawings were so artistically arousing that no man and woman could reproduce the scene. Only two beautiful and innocent girls could pull it off.</p><br/><p>Zhao Youyue’s first “wife,” Xu Jing had been one of Su Li’s earliest icons. She was destined to be called “the cleaver” or “blackened.” [2] Several jerks who played around with a huge number of girlfriends became terrified after reading her story. At the same time, she stirred up a new trend — “the beauty of blackened.” Despite her extreme emotions and tendency of killing people, otakus fell completely in love with her coldness.</p><br/><p>Perhaps those otakus actually wished that they could be blackened. Without truly falling in love with someone, how could a person be blackened and take such extreme measures?</p><br/><p>Of course, it was best if we restricted such behavior to animes alone. We can’t have reality running rampant with boys chopping girls up just because they rejected them. It would be hell on earth!!</p><br/><p>Well, there was one thing that separated fiction from reality. We could fall in love with the depravity and insanity of fictional characters, but we have to be clear of the consequences in reality.</p><br/><p>Zhao Youyue was one such victim. She lived in reality, yet her heart still dwelled in the source world. The happy moments she had with Cirilla had taken a toll on her heart, since they had to be separated. She missed the sister who had treated her so well, the sister who was willing to even die for her, any time and anywhere.</p><br/><p>Cirilla really doted on her only sister. She would turn against anyone who forced her to dress like a lady. Yes, she was a girl, but she thought she was no less than any man who could give a perfect life for a girl. That girl was her only sister, Olivia.</p><br/><p>Therefore, only Olivia could make her dress like a lady. She loved her so much; she did not mind humoring her many antics…</p><br/><p>In reality, nobody would treat Zhao Youyue this way. Nobody could be a sister who was any more selfless and caring.</p><br/><p>No matter how close a best friend was, most girls would only hug and kiss each other. Some even despised skinship, let alone love.</p><br/><p>Lady Zhao was the empress who unified the source world. She could have someone beheaded with a single glance; no one dared challenge her wrath. In the real world, she was a famous, wealthy teenage girl with a flawless image. If she ever did something to tarnish the image, she would be doomed for the rest of her life.</p><br/><p>Since she was a nobody, her actions were constrained by a higher form of power. The highest authority she had was just that of a Student Union’s President. It was just enough to earn the laughter of true dictators.</p><br/><p>The highest power, in reality, was none other than those wealthy capitalists. With money, comes power. They could start up a private security firm and train their own army, or buy a nameless island and be its king. Once the island has earned enough attention to influence the five great powers in the United Nations, he could legitimize his rule.</p><br/><p>The idea was ridiculous, but Zhao Youyue still looking for a sci-fi world to bring its dark technology into reality. With such technology in hand, she could easily become one of the capitalists. At least she could be like Iron Man, right?</p><br/><p>Now, Zhao Youyue had a clear path in mind. If she worked harder now, her desired future might be possible.</p><br/><p>She realized that her family had started to look for a suitable husband on her behalf. Yes, they understood her well, yet the old-fashioned great-grandfather of Zhao Family was still alive and kicking. He only treated his grandchild, Zhao Han, seriously. Zhao Youyue was just a pawn for him to strengthen Zhao Family’s influence in the form of marriage.</p><br/><p>Zhao Youyue had been living a luxurious life as Lady Zhao. Even so, she was not content, for that money was not hers. One day, she might even be forced to marry a guy she did not love.</p><br/><p>Her actions in various worlds had made it clear. She was a lily-walker. And now, she had Cirilla who she would never let go.</p><br/><p>She did not know what was it like to fall in love; she could not determine if her love for Cirilla was familial or romantic. All she knew was the comfort and bliss she experienced with her. There was no need to worry about betrayal, and they had a bright future ahead of them.</p><br/><p>Men could not be trusted. She even doubted ever having a man who loved her with all his heart.</p><br/><p>She truly doubted the existence of such a man. She might need to spend money on “love.” It was not a romantic relationship, but a trade of obedience for money. It was no different from having a pet dog.</p><br/><p>There was a saying that went, once you spend too much time with a dog, you would realize that a dog is way better than a human.</p><br/><p>Zhao Youyue might look young, but she had lived entire lives and carried the experience that would stagger even the oldest people in the Guinness Book of Records. As a result, her aura was dense, immense, and stifling. One could easily be mesmerized just by looking at that mysterious, ageless youth, wondering what she had experienced to carry herself in such a way.</p><br/><p>All these past hardships had told Zhao Youyue one thing. She could not depend on a man. Also, she intended to remain single as long as she remained insignificant.</p><br/><p>One day, she would be the Olivia in reality!</p><br/><p>Her heart was as broken as a mother who had just suffered a miscarriage. It was time to force the heartache aside and carve her own path to a new future!</p><br/><p>She had to do something better in life. The new lease of motivation almost made her feel like a protagonist in a novel. Urban legends had it that protagonists who have just lost the love of their lives would suddenly find a level of strength that he never knew he had, and break through his old limitations!</p><br/><p>Translation Note:</p><br/><p>[1] Dōjinshi (, often transliterated doujinshi) is the Japanese term for self-published works, usually magazines, manga or novels. Dōjinshi are often the work of amateurs, though some professional artists participate as a way to publish material outside the regular industry. Dōjinshi are part of a wider category of dōjin including art collections, anime, and games. Groups of dōjinshi artists refer to themselves as a sākuru (サークル, circle). A number of such groups actually consist of a single artist: they are sometimes called kojin sākuru (サークル, personal circles).</p><br/><p>[2] In TYPE-MOON’s Fate series, “blackening” (, Kokka) is a process by which a being is tainted by an outside force, causing their personality to be reversed toward the orientation of evil. There are several different processes that can blacken a being.</p></div>\n</div>"}