{"title": "Chapter 725 - Meeting the Empress", "id": 725, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-725-meeting-the-empress", "volume_title": "Volume 8", "body": "<h1>Chapter 725 - Meeting the Empress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Yang Yunfei and the others held an audience with the legendary empress Olivia, in the Free City of Novigrad. This place, which was originally the most prosperous commercial city in the game had changed dramatically. Although the original Novigrad was already prosperous, to begin with, it was nothing more than a city built by conventional technology. Its architecture wasn’t anything particularly impressive.</p><br/><p>However, after Empress Olivia took over, she saw the potential that Novigrad had. She turned the plain port city into something far more beautiful. The city already had a route to the Skellige Isles, why not capitalize on that?</p><br/><p>So, by Olivia’s imperial edicts, Novigrad underwent a grand transformation, and its various designs were all built like how a modern city would look like. Even so, she still retained the original style in some areas to permit Novigrad to retain some of its identity.</p><br/><p>As for the crime bosses in Novigrad and the Church of the Eternal Fire, they accepted the “iron fist of dictatorship,” one way or the other. Olivia believed that both crime bosses and churches were all like malicious tumors that hindered the people from building a magical modern city. She did not need such tumors growing amid her grassroots. She wanted her orders to go directly to the grassroots, and that she would be able to control every corner of the entire empire, so that the power of the people could be used to its fullest.</p><br/><p>As long as such a powerful force was unified, no one could threaten Empress Olivia’s rule, because her policies were always the most popular, and they represented the fundamental interests of an overwhelming majority of the people.</p><br/><p>When he saw that Novigrad was far bigger, cleaner and incomparably cooler, Shang Zetao, a “Witcher 3: Wild Hunt” addict stopped functioning, there and then. Words could never describe his shock. Now, he really needed to know more about this Empress Olivia!</p><br/><p>Captain Yang Yunfei and the others have spent a lot of effort trying to meet Empress Olivia. They all believed that a legendary empress would not simply meet anyone casually. They could not even reveal the existence of the main god, or else, they would be obliterated…</p><br/><p>So, they chose a more creative route. They all claimed to be “Gwent Masters,” and began to play Gwent in Novigrad, as they wanted to participate in the “High Stakes”[1] that also appeared in the game. After winning “High Stakes,” you could either choose to receive 5,000 crowns, or 2,500 crowns and have sex with one beautiful Gwent player. As a result, many smart players have saved their game file before completing this quest, and then choose the reward where they could have sex with a beautiful Gwent player. After watching how Geralt totally drills the woman, they would reload the previously saved game file and choose the 5000 crowns. 2,500 crowns were not worth sex. Was that beautiful woman’s “that thing” actually studded with diamonds?</p><br/><p>You must know that the price of prostitutes in the city of Novigrad was only tens of crowns. If you played two rounds of Gwent with the boss of the brothel and won two rounds, the money won was already enough to hire a prostitute…</p><br/><p>Several players may have played “The Witcher 3: Wild Hunt” with pure intentions. That would be to head to Novigrad, as soon as possible. Then, they would spend tens of crowns to see how wild the protagonist witcher Geralt was in bed.</p><br/><p>One could say that Geralt was one of the most successful chick magnet around, out of all the characters in several RPGs. He would never be short of a partner in bed, no matter where or when. Every time a new DLC was released, the first thing players wanted to know was the superb lady Geralt was about to drill.</p><br/><p>Unincidentially, the squad had transformed into Gwent players. They inevitably bumped into the protagonist Geralt, who was going around the world, playing Gwent. As they continued destroying each other’s decks, they became quick friends with Geralt. They claimed to have come from a mysterious kingdom in the East, and that they possessed a mysterious power called “qi.” Was that perhaps a different kind of magic?</p><br/><p>In fact, Captain Yang Yunfei had cultivated himself through the path of martial arts. Geralt knew all too well that his daughter Olivia attached great importance to all mysterious powers that involved magic. She was even working on a more successful method of producing witchers. She hoped to form a special witcher team that specialized in darker tasks, such as decapitation.</p><br/><p>Olivia believed that the mysterious changes in the bodies of witchers could be further studied through the combination of modern science and magic. She hoped to mass-produce the witchers in the future. Of course, safety came first. Also, it had to be on a voluntary basis. After all, becoming a witcher still had its risks. At the same time, it also meant giving up your fertility…</p><br/><p>At least, the public eye viewed witchers in a far brighter light, compared to the days of old. Previously, ordinary people truly despised witchers because of heterogeneous reasons, and they had powers that ordinary people did not have. Even though they helped wipe out the monster menace, they had trouble shaking off the discrimination. Therefore, people usually spat on passing witchers.</p><br/><p>Now, however, Geralt was the face of the Witchers, and the foster father of Empress Olivia. Of course, the Bards were a huge reason on why they were now the subject of fables. Originally, Dandelion was already a handful to deal with. Now, he was the father of an empress. Wherever he went now, people would only look at him with respect, not prejudice.</p><br/><p>At the same time, Olivia also carried out publicity campaigns to sway the public opinion, saying that witchers were just as human as everyone else, plus a few mutations. In fact, as long as anyone dared to be one, it could be done. If you’re a witcher, you’re a true warrior!</p><br/><p>Therefore, every decent witcher was worthy of respect. They fought in the front line against monsters; they ensured the safety of the masses. They were heroes!</p><br/><p>Anyhow, Olivia had already shone a new light upon several witchers and sorcerers. She hoped to recruit the former as special soldiers, and the latter as magical, technology workers…</p><br/><p>Her efforts in changing the public opinion that the ordinary people had of witchers had indeed helped her earn the loyalty of many. Well, Olivia was the only empress around. “No matter how smart or powerful you are, all of your efforts would still go into the development of the kingdom.”</p><br/><p>Since Yang Yunfei and the others have gotten to know Geralt, of course, they hoped to meet Olivia through him. They not only played with Geralt, but also accompanied him on a round of hunting. On top of that, they earned some bonus quest rewards.</p><br/><p>When Shang Zetao saw Empress Olivia, he could only think that everything had been totally worth it!</p><br/><p>Translation note :</p><br/><p>[1] “High Stakes” is a secondary quest in Novigrad. It requires entering a Gwent tournament in Passiflora. A strong deck is needed, as well as an entry fee of 1000.</p></div>\n</div>"}