{"title": "Chapter 751 - Reality Has Nerfed Her Abilities", "id": 751, "volume": 8, "url": "http://boxnovel.org/shift-the-side-character-heroine-chapter-751-reality-has-nerfed-her-abilities", "volume_title": "Volume 8", "body": "<h1>Chapter 751 - Reality Has Nerfed Her Abilities</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 751: Reality Has Nerfed Her Abilities</h2><div class=\"text-right small\"><b>Translator:</b> EndlessFantasy Translation <b>Editor:</b> EndlessFantasy Translation</div><br/><p>In the beginning, Zhao Youyue had thought that the ability to look at her other lives in other world lines to be practically useless. That side character missy was completely mediocre. She had no sense of presence, and there was no meaning to her life. It was so plain and simple. There was also the horrific possibility of her getting married and giving birth someday!</p><br/><p>That’s right. “The other” side character missy with no “Two Dimensional Gate” to help her was very likely to fall victim to the boring plans of her family. Get married, have children.</p><br/><p>Of course, it had not yet been set in stone. The so-called world line was not just a single line. It had an endless amount of alternate lines. Currently, through the “Zhang Yanwei” character card, she could only observe one clear line.</p><br/><p>The current Zhao Youyue, who had the “Two Dimensional Gate” had boundless possibilities. No future could bind her.</p><br/><p>As the saying goes, “character determines your fate,” the current Zhao Youyue was different compared to the side character missy who was content with staying at home, getting married, and finally having children in some other world line.</p><br/><p>That side character missy finally got into a relationship with Xiao Yiren, who once dated her. It was the popular author with the pen name of “Drunk For Her.” The side character missy had not given any pressure to Xiao Yiren, allowing him to boldly step out of line. As a result, the side character missy followed suit and thought that they got along quite well. Thus, they got together… The Side character missy was more of a Buddha who had no regards about her looks. As long as the guy looked okay, all was fine. It would be better if he had a sunny personality.</p><br/><p>Therefore, “Drunk For Her,” as an honest man, successfully conquered the Buddhist-like side character missy. The days that they lived together did not have much love, but at least, they did not reject each other. They just had a comfortable life. Wasn’t that enough?</p><br/><p>When Zhao Youyue saw her disappointing self in this world line, she went green in the face. That side character achieved nothing, not even her beauty. She ended up with a sub-par web-novelist?!</p><br/><p>It was so f*cking embarrassing. Sure enough, such ladies were hopeless. Women should be given some male insight on things. This way, even if the side character Zhao Youyue did not have the “Two Dimensional Gate,” she would not have accepted such a man so easily. This was pathetic!</p><br/><p>The current Zhao Youyue would only mingle around with High God. Master PhD, who found ‘the’ success in life was extremely grateful towards Lady Zhao. Her “Endless Apocalypse” would never have been this popular without the support of Lady Zhao.</p><br/><p>Even though Master PhD was one heck of a stubborn writer, she still knew how to be a proper human being. She took the initiative to invite Lady Zhao and Su Li out to have a good meal. At least the Lady would not remain so disappointed at that one scam.</p><br/><p>Zhao Youyue had almost figured Master PhD out. She wanted to write, and she wanted to write it the way she wanted it. Even if such a decision was made on a whim and could actually ruin the book, so what? She wanted to write according to her own feelings!</p><br/><p>Apart from this, there was nothing much about Master PhD that was unpleasant. It was such a shame that she was not beautiful enough. She was a “legal loli,” and that was a plus. However, she looked far too mediocre. This superficial world was simply too cruel…</p><br/><p>Zhao Youyue regarded Master PhD as a regular senior and a very good friend. However, she would not consider entering her works anymore. By chance, if the female character that she chose and put painstaking thought into was changed to a man, she might just snap.</p><br/><p>After Zhao Youyue sifted through the memories of her alternate self, she was more determined than ever to walk down her path. She also understood why “Zhang Yanwei” could be so keen and observant during her research….</p><br/><p>The reason was very simple. She saw the future in the other world line. Naturally, she knew where the development of science and technology led, and its alternate results. That was why she could skip the trial and error phase!</p><br/><p>Those who worked in the same field as Zhang Yanwei would only think that it was her genius and observant instincts talking to her. Such gifts sent others green with envy. What people took a lifetime to achieve would be achieved with a snap of her fingers… When her ‘inspiration’ kicked in, it was nobody else’s business. That inspiration was the future. It was not just her future, but the alternate futures of alternate worlds.</p><br/><p>Zhao Youyue finally figured how this card worked. Along with that revelation, she found new sources of frustration. Once again, reality had watered down her abnormal abilities. In such a situation, it was necessary for her to continue finding a new Source World. Then, she could use the character card to its fullest.</p><br/><p>She no longer enjoyed making trouble in novels as much as before. It was no longer as fun, it now felt like a chore, leaving her dehydrated and out of breath. If she were to walk into a world now, she would find a random corner to collapse into…</p><br/><p>Therefore, Zhao Youyue could not wait to start a new journey to the Source World. Surprise me, gacha tickets.</p><br/><p>No matter what kind of Source World this one was, Zhao Youyue still hoped to use her new wife. If she was to shift into a magical world like “Witcher,” her new wife Zhang Yanwei would still be able to use her research abilities to come out with terrifying forms of magic. Where the mind of a great scientist thrived, the mind of a great mage would emerge!</p><br/><p>Zhao Youyue activated both the incomplete God Card “Altair” and the “Two Dimensional Gate.” It allowed her to shift into source worlds, where no pesky creators could follow and trip her over. This was a high-quality adventure…</p><br/><p>Of course, the Source Worlds were very random. It was impossible for her to pick one at her discretion. But they all held great potential. That’s why literary worlds were now so mundane to her.</p><br/><p>However, Zhao Youyue never could have seen this coming…</p><br/>\n</div>"}