{"title": "Chapter 8: The Sword Embryo", "id": 8, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-8-the-sword-embryo", "volume_title": "Volume 1", "body": "<h1>Chapter 8: The Sword Embryo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 8: The Sword Embryo</p><br/><p>Translator: Irene Editor: Lis</p><br/><p>Ai Hui lied on his bed adjacent to the wall with a sword nestled within his arms. Slowly, his pitch-black eyes opened to the darkness and a cold ray of light sharply flashed before he returned to his harmless appearance.</p><br/><p>He’d been away from the Wilderness for a few days now, but he still wasn’t used to sleeping on a proper bed.</p><br/><p>He checked the sword embryo within his body which he had been growing for three years now and found no abnormalities.</p><br/><p>He put down his grass sword, the sensation of the sword embryo within his body disappearing. In the past, he was overly-dependent on the sword, always holding on to it and never letting go regardless of the situation. Later on, he realized that doing so caused his body to lose its vigilance, so unless he was in a battle or keeping watch at night, he forced himself not to touch it.</p><br/><p>To survive the Wilderness, Ai Hui had to have something up his sleeves, and that something was the sword embryo.</p><br/><p>On his third day in the Wilderness, he almost lost his life. From that moment onwards, he started his obsessive search for greater strength because only then could he survive that cold place. He had no one to go to for help, the elementalists never gave him face, and he was neither clever nor capable of bargaining for what he wanted.</p><br/><p>Wild beasts wielded extraordinary strength when forced to desperation. People would too, under similar circumstances.</p><br/><p>Like a drowning man, Ai Hui desperately latched onto any chance of hope he could find.</p><br/><p>For example, he filled his mind with knowledge from swordplay manuals.</p><br/><p>The disintegration of spiritual force sent the cultivation world tumbling down, ending the era of cultivators. However, the cultivation system was deep-seated, advancing so greatly in the hundreds of thousands of years of its existence that it far exceeded what people imagined today.</p><br/><p>Body training, spell formation, weapon training, five elements, necromancy and so on… there were all kinds of strange and abundant practices that utilized spiritual force. Coupled with humankind’s rich imagination, the most resplendent and grandest cultivation system was brought into existence.</p><br/><p>Amongst the vast jumble of magnificent cultivation types, Swordsmanship always held the greatest value. Within the cultivation world, regardless of generation, the strongest followed the path of Swordsmanship.</p><br/><p>During that era, swordplay manuals of great origins were created, bringing about reigns of terror every now and then. Today, they were buried between piles of old books and other garbage, not worth a single yuan.</p><br/><p>Swordsmen made up the majority of the cultivation world. It was only natural then that all sorts of strange concepts were born from the community.</p><br/><p>Ai Hui first eliminated the sword manuals that required spiritual force. These types of manuals were frequently used by the big sects and schools to figure out how to utilize spiritual force more effectively back when it was still ample. The manuals that he eliminated next were those he could not understand. Books that were cryptic and abstruse were in excess, comparable to the amount of hair on a cow’s body. He could be considered a semi-expert with his experience flipping through an astonishing number of sword manuals, but he still found many of them too profound—some were archaic while others were deliberately mystifying.</p><br/><p>After he filtered them out, there were some sword manuals left.</p><br/><p>In the Cultivation Era, none of these manuals would be considered orthodox, and an honest and learned man would even deem them as demonic.</p><br/><p>Despite seeing them before, Ai Hui was not completely free from fear. These sword manuals were strange and unpredictable, completely beyond the limits of a normal person’s imagination. For example, one manual taught cultivators to cut all emotions and desires, lust included, in order gain supreme mastery of the sword. Another, the Dream Demon swordplay manual, instructed them to lie inside of a giant coffin, induce a coma, and train within the Dream Demon himself. Upon mastery, the sword skills they accumulated would marvelously become applicable in reality.</p><br/><p>In the past he glanced through these manuals out of interest and nothing more. Now, the thought of training according to these books sent shivers all over his body. Ai Hui finally managed to find a book that seemed less eerie and strange. It had no name and was badly damaged, and the only words on the cover stated at the top, the method to plant the sword embryo.</p><br/><p>After a detailed examination, Ai Hui more or less understood the meaning of sword embryo, and it was actually quite simple. The human body could only grow so much, but there was no limitation to developing the three essential life-sustaining energies within—the essence, the breath, and the spirit. These energies, however, held no form, drifting harmlessly like mist. Therefore, the creator of this sword manual came up with an extremely interesting theory; that is, the human body was like a sword’s sheath and the three energies made up the real sword.</p><br/><p>How then, could the three incorporeal energies come together to form the sword? The manual proposed a unique solution. Since it was difficult to congeal the energies into one entity, they could be treated instead as soil to nurture the sword embryo from within.</p><br/><p>Compared to the other books, this sword manual was obviously one of the more sensible ones.</p><br/><p>So without hesitation, Ai Hui followed the instructions on the sword manual and surprisingly succeeded in planting the embryo.</p><br/><p>Back in the swordsman school, he would never have taken the risk, but in the Wilderness, what was there to worry about? People died every day, and he didn’t know when it would be his turn. Risk meant nothing to him. Instead, he was more concerned about the effectiveness of the so-called sword embryo.</p><br/><p>Survival was his top priority.</p><br/><p>Three years passed, and he entered the Induction Ground after surviving the Wilderness, yet the sword embryo was still a seed with neither movement nor change.</p><br/><p>Ai Hui was rather unperturbed about this matter. It was enough for him to have stepped out of the Wilderness alive. He didn’t hold unrealistic expectations from it either since the book was badly damaged with illegible instructions towards the end.</p><br/><p>The sword manuals from the era of cultivation believed that all routes eventually led to the same destination. No matter how odd or unorthodox the method, all of them ultimately went back to the the words \"spiritual force.\" From this, he gathered that future training would most likely be related to the spiritual force as well.</p><br/><p>Nevertheless, Swordsmanship was outdated, and it was worthless to train according to these manuals. He was not like the boss of the swordsman school who obsessed over these manuals and falsely believed in sword mastery.</p><br/><p>He simply had no intention of growing the sword embryo any further.</p><br/><p>While the manual did mention that meditating while holding on to the sword would help nourish the embryo, Ai Hui did it to improve his alertness at night instead.</p><br/><p>There was something intriguing about the sword embryo. It came to life whenever he held on to his sword and his six senses became sharper as well. He could detect any slight sounds or movements around him. Later on, many elementalists became aware of his keen vigilance and soon the night watch became one of his main tasks.</p><br/><p>This allowed him to loot from the battlefields, albeit only the leftover bits and pieces.</p><br/><p>For three years, Ai Hui carried the sword and meditated without sleep, persevering for what seemed like a day.</p><br/><p>The Ai Hui of the past shivered in the cold mud while the Ai Hui today had a warm and safe room of his own to sleep in until the morning light.</p><br/><p>He felt contented and blissful.</p><br/><p>Today was the first day of lessons, and he looked forward to it. He hadn’t left the house ever since he claimed the fifty thousand yuan prize.</p><br/><p>Outside, the sky was still dark with only a glimmer of light—still some time before sunrise.</p><br/><p>Ai Hui energetically jumped off his bed, landing soundlessly like an agile cat. The carpet under his feet was made from rough woven fibers that was somewhat prickly, but Ai Hui felt nothing. With the glimmer of light shining in from the horizon, the room was illuminated enough for him to not bother turning on the light as he washed himself in the dim room.</p><br/><p>His familiarity with darkness could be seen as a gift from the Wilderness where danger lurked in every corner and any trace of light would draw them to him.</p><br/><p>He skillfully removed the trap he had set behind the door and pushed it open. A rush of fresh air entered his lungs, giving him burst of energy.</p><br/><p>The slightly illuminated sky and the quiet training hall brought back memories of the swordsman school. The familiar sensations washed over him, and even the cool air seemed to have become more fragrant. The sharp and stiff edges of his face softened, a warm smile tugging at his lips.</p><br/><p>He began to mop the floor with quick and light strokes.</p><br/><p>Soon, his body remembered the familiar movement and reflexes quickly took over.</p><br/><p>Even before the sun came up, Ai Hui was finished with his cleaning chores. Without bothering to wipe the sweat off his body, he looked around the well-polished hall feeling genuinely satisfied and happy.</p><br/><p>Gazing at the sparkling ground, however, he was reluctant to step on it.</p><br/><p>During his three year stay in the Wilderness, he fought in the muddy swamps and amongst dried, decaying leaves. He became accustomed to coming across rotting monster corpses with his shirt stained with blood. Over time, the stains dried up and faded into the same brown patches until he could no longer tell his blood from the beasts’.</p><br/><p>The soles of his feet came into contact with the clean wooden floor. A familiar feeling.</p><br/><p>This dirtless, quiet hall was like a dream from deep inside his heart.</p><br/><p>The past two days had been a time of adjustment, but gradually he was starting to enjoy this new lifestyle. He even had the thought that life would be pretty good if he could carry on living like this.</p><br/><p>Feeling childish, Ai Hui laughed before turning around to pack his things. He had a tight schedule after all.</p><br/><p>The sword embryo’s ability to keep him alive was not worth mentioning. His mastery of elemental energy paled in comparison to most people, so he faced much greater pressure as well.</p><br/><p>The Induction Ground had strict rules: failure to activate the natal residence within a year or inability to reach the Initial Completion level within five years would lead to an expulsion. For students who came from the Avalon of Five Elements, their parents would be blamed for their shortcomings whereas students from the Old Territory would lose their chance to qualify as a member of the Avalon of Five Elements and be banished back to where they came from.</p><br/><p>Those who attained the Initial Completion would have to leave the Induction Ground as well since it signified their right to qualify as a registered elementalist.</p><br/><p>Five years was all the Induction Ground could give. In reality, Ai Hui had only four years because there was one more rule—students above the age of twenty had to leave the training grounds.</p><br/><p>He didn’t have much time left. If he wanted to take charge of his own fate, he had to work harder.</p><br/><p>And if he felt inferior? Then he had to snap out of it and work even harder.</p><br/><p>The sun rose from beyond the horizon and shone brightly in the cold, blue sky. After packing, he slung the old cloth bag over his shoulders and exited the hall with a blade of grass in his mouth and the sky behind him.</p><br/><p>The early morning streets were quiet and dark, still asleep. From beyond the mountains and rivers extended the first thread of light, entering homes and illuminating the streets.</p><br/><p>Ai Hui luxuriated in the sunlight.</p><br/><p>In the Wilderness, the hours before dawn were the most dangerous. It was a time ripe with the danger of sneak attacks, when deaths and fresh blood were aplenty.</p><br/><p>But with the arrival of the sunlight shining on the grassfield dews came the massacres’ reveal and the retreat of the dire beasts and barbarians like the tides, returning peace and tranquility to the Wilderness.</p><br/><p>While the school building was not far from the training hall, it was not near either.</p><br/><p>The closer he got to the school, the more concentrated the student crowd became. The streets bustled with activities, and it was an unfamiliar sight for Ai Hui. Upon seeing the young faces full of vitality and eagerness, Ai Hui felt somewhat envious. Their faces showed no traces of blood-soaked battle injuries and lacked vigilance against the outside world since they had never experienced a massacre.</p><br/><p>They were flawlessly pure and led happy lives.</p><br/><p>Ai Hui felt out of place. He bit down hard on the bit of grass, allowing the raw, grassy taste to spread within his mouth.</p><br/><p>To them, the Induction Ground was a school. To him, it was his new battleground.</p><br/><p>Rather than happiness, survival was of a greater importance.</p><br/><p>He took a step forward and entered the school building.</p><br/>\n</div>"}