{"title": "Chapter 9: Introduction", "id": 9, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-9-introduction", "volume_title": "Volume 1", "body": "<h1>Chapter 9: Introduction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9: Introduction</p><br/><p>Translator: Irene Editor: Lis</p><br/><p>Shi Xue Man gazed at her body in the mirror. The fair, flawless body she had once been proud of now had five faint, yet eye-catching, finger marks above her left breast. A few days had passed but the bruises still hadn’t disappeared, causing her to believe her opponent had used substantial force.</p><br/><p>A baleful look appeared in her eyes. She did not want to recall what happened that day,but every time she bathed she could see the finger marks on her body. It made it difficult to restrain the anger.</p><br/><p>Luckily the marks on her neck were gone, since school was reopening today.</p><br/><p>She dressed, the usual confidence returning to her face.</p><br/><p>In the dining hall outside, food had already been prepared. As she entered, her grandfather gazed at her with a gentle smile. “Come, have your breakfast.”</p><br/><p>“Grandfather,” she called out sweetly before sitting down beside him. With her mother’s early passing and her father’s busy work schedule, her grandfather had been the one to raise her. Therefore every morning, she accompanied him during breakfast.</p><br/><p>A servant delivered a bowl of hot soup to the table. She trained regularly and so all her meals were specially prepared to replenish her elemental energy and nourish her body.</p><br/><p>Sip by sip, she drank her soup that had been brewed meticulously with expensive ingredients. Not only did it benefit her training but it also tasted fresh and delicious. Today, however, she was somewhat in a daze.</p><br/><p>The grandfather had raised her since young and so knew her very well. He asked warmly, “Why? Are you still thinking about that incident?”</p><br/><p>WIthin the family clan, his granddaughter possessed unmatched talent. Always sensible and never pretentious, she was in fact more hard-working than others. Since childhood, she displayed excellent skills that surpassed even her father’s and was regarded by the clan as the next generation’s leader. The whole clan was pleased with her and all the seniors adored her greatly.</p><br/><p>The old man was deeply proud of his granddaughter’s achievements. In his eyes, she was perfect, but the only thing that worried him was her pride. Like her father, she had never experienced any setbacks.</p><br/><p>But the old man had plenty of experience. He understood that there were many hidden talents in this world, and there would always be a higher mountain. No matter how outstanding his granddaughter, someone out there would be better.</p><br/><p>And this was exactly what happened.</p><br/><p>When he saw the marks on his granddaughter’s neck that day, he received a shock and a fear that still lingered. If her opponent used just a little more strength, she would have died on the spot. Then, he quickly realized that her expression was somewhat off.</p><br/><p>This setback must have been far greater for her than he had expected.</p><br/><p>To him it was nothing, but he knew Shi Xueman needed more time to process since her life had been smooth-sailing so far.</p><br/><p>If he knew the truth of the matter, he would have ripped Ai Hui into pieces.</p><br/><p>“No.” Shi Xueman lowered her head and continued eating.</p><br/><p>Seeing her like that, the old man could not help but laugh. “Why do you think you lost?”</p><br/><p>He knew from experience that avoiding the problem wouldn’t benefit the youngsters.</p><br/><p>Shi Xueman paused, still holding on to the spoon. She was stumped by his question. Three days had passed yet she was still deeply ashamed and resentful. All she could think of was how to find that damned fellow and dismember his body into a million pieces.</p><br/><p>Although she was no fool, her anger had blinded her. Hearing her grandfather’s reminder, she immediately addressed what she neglected so far.</p><br/><p>“The opponent was very familiar with blind battling.”</p><br/><p>As the details from that battle replayed in her mind, Shi Xueman’s expression became solemn. Since the incident, this was her first time recalling it without falling into a blind rage.</p><br/><p>，：“？”</p><br/><p>The old man laughed silently, guiding her along. “What else?”</p><br/><p>“Rich battle experience, fast reflexes, unfeeling, knew how to utilize his advantage...” Once Shi Xueman regained her cool, she displayed powerful insights. She mumbled to herself, “Come to think of it, he must have sensed my presence and location right from the start unlike me who couldn’t detect his movements. He was an expert in blind battling, able to fight well in the dark. He chose a close quarters combat style which in the darkness was ideal. It forced me into a passive position without space to maneuver at all. By doing so, I couldn’t display my numerous techniques while he could unleash his full powers.”</p><br/><p>The old man listened carefully knowing that he only needed to hear her out.</p><br/><p>“He deliberately allowed me to struggle to expedite my energy consumption. Cunning. His elemental energy doesn’t seem very strong since he didn’t engage it from start to finish, so I had no way of confirming his level.”</p><br/><p>Listening to her, the old man responded, “If he defeated you without engaging his elemental energy, he is definitely skillful.”</p><br/><p>“Very. Also, like me, he must have been wearing a Suppression Bracelet.” Shi Xueman didn’t refute his statement. She thought for a bit before adding, “When he was locking me in, I utilized [Arching Fish Back] but could not break free.”</p><br/><p>For the first time, the old man lost his composure. “He blocked your [Arching Fish Back] without using elemental energy? Was he old?”</p><br/><p>[Arching Fish Back] was an ingenious technique used to struggle free. It emulated a fish’s reaction when startled—full of explosive strength. The old man was quite shocked by the fact that the opponent actually managed to suppress her [Arching Fish Back] without using elemental energy.</p><br/><p>“Mhmm.” Shi Xueman gravely nodded. “He had exceedingly strong murderous intent. Originally I planned on using [Arching Fish Back] to break free to remove the Suppression Bracelet, but it failed. However, he shouldn’t be very old or else he wouldn’t have attacked for fifty thousand yuan.”</p><br/><p>Thinking back, she couldn’t help but respect him. As a girl, immobilization was more disadvantageous. As such, she was taught [Arching Fish Back] at a very young age, and she spent a lot of energy mastering this technique to the point that it was now a part of her.</p><br/><p>But even she could not maintain control over the burst energy of [Arching Fish Back].</p><br/><p>“Suppressing [Arching Fish Back] without elemental energy and not too old… it must be a student then,” the old man exclaimed in admiration. “Looks like there’s an amazing talent among the new batch of students this year. I wonder who he is, and why haven’t I heard of him?”</p><br/><p>“Grandfather, you must investigate carefully for me!” Shi Xueman shook his arm and pleaded, “I will not take this lying down. We must battle once more in the open, no tricks.”</p><br/><p>The old man laughed loudly. “Okay, okay, okay. How could I reject Xueman’s request?”</p><br/><p>Clearly Xueman intended to erase her previous humiliation, but it was acceptable for youngsters to hit a snag due to their zealousness. Moreover, he was very curious about this young man who suddenly appeared and overpowered his granddaughter. Interesting.</p><br/><p>Shi Xueman was overjoyed upon hearing the good news. If Grandfather was willing to help, that damned fellow would definitely be unable to escape!</p><br/><p>Wait and see! I will not let you off!</p><br/><p>A dangerous aura flashed across her eyes.</p><br/><p>The old man noticed her expression. Having gone through the ups and downs of life, he certainly knew what she was thinking. He muttered, “He held you down without engaging his elemental energy. I’m afraid his skill surpasses yours. You have to be careful.”</p><br/><p>Shi Xueman raised her head, burning passion in her eyes. “Xueman will surely strive hard!”</p><br/><p>The old man was somewhat surprised. This was his first time seeing her with such an exuberant fighting spirit.</p><br/><p>Looks like this failure was a major setback for her, the old man thought cheerily.</p><br/><p>At this point, Ai Hui did not realize the trouble that fifty thousand yuan brought upon him as he was attending his introductory lesson.</p><br/><p>The sunlight rays entered through the windows, shining onto his desk and the floor, making even the dust particles visible. They could be seen drifting lazily in the air.</p><br/><p>The school was empty except for six people. Very few were required to attend this introductory class. Whether they hailed from the Old Territory or the Avalon of Five Elements, most young children had already been exposed to the basics.</p><br/><p>Teacher Dong stood on the podium radiating passion and flinging spittle everywhere. He talked about the countless years of planning and preparation as well as manpower that went into the Avalon of Five Elements. With Cultivators from different sects aiming towards the same goal, the Avalon today was stable and beginning to infiltrate the Wilderness. He also mentioned the Avalon’s ability to now proceed from defense to a counter-attacking phase and so on.</p><br/><p>Unlike the other students who were dozing off, Ai Hui was enjoying his lesson. He had previously dabbled in swordplay manuals, but his knowledge about the Avalon’s history came mainly from gossiping master elementalists in the Wilderness.</p><br/><p>Talking about history was Teacher Dong’s favorite pastime. He spent more than half of his class time on it with very little focus on the basics of training.</p><br/><p>For what purpose was this messy history lesson given, and what did it have to do with them? The students privately called this the saliva class. They detested wasting their time on such things, but the teacher in charge of their basic training class was Teacher Dong. Moreover, he was known for his bad temper. If anyone who skipped his classes dared to consult him about training, he wouldn’t even bother acknowledging their presence.</p><br/><p>Who asked them to have zero understanding of the basics?</p><br/><p>Needless to say, students who came from the Avalon of Five Elements knew the basics. Those who were properly homeschooled went straight into the advanced classes while others were placed into the intermediate classes. Even students from the Old Territory received training from a young age. While the different environments contributed to the disparity in skills between them and the students from the Avalon, the former did not have many problems dealing with the theoretical aspects.</p><br/><p>Survival was always the strongest motivation for change. After thousands of years of progress, the five elemental energies had already become widely used.</p><br/><p>Unfortunately, this made the number of students who had to start from the very basics like Ai Hui pathetically few.</p><br/><p>A person had to lower his head when living under someone else’s roof.</p><br/><p>Teacher Dong talked non-stop for a long time. When he finally started on the topic of training, the other students became much more enthusiastic.</p><br/><p>Unfortunately, Teacher Dong’s passion lied only in imparting history. Without any interest in explaining the formation of elemental energy, he ended the class after only half an hour. In fact, by the time Ai Hui finished reflecting on the information gained from class, he was already gone.</p><br/><p>Unlike the students who were aggrieved, Ai Hui felt overjoyed from the enlightening lesson.</p><br/><p>After three years in the Wilderness, he became capable and experienced, never backing down in the face of danger. In this, he stood out amongst the many laborers around him, gaining the trust of master elementalists and even having the few kind-hearted ones impart a skill or two.</p><br/><p>Danger lurked in every corner of the Wilderness, however, and could appear at any time. Under such circumstances, no one was willing to patiently and systematically educate him on training routines.</p><br/><p>Three years later, he had learned many skills, but they were all practical moves, fragmented and incomplete.</p><br/><p>While he fell behind theoretically, he gained much experience from real combat and in this aspect, none of his classmates could compare. In addition, he was good at analytical thinking and reflection, or else he would never have been able to create the sword embryo. Despite the simple and scattered knowledge he had accumulated in the Wilderness, he spent countless hours contemplating each and every piece of information. Yet due to a lacking foundation, his learning produced limited returns, accumulating a number of questions that he had been puzzling over.</p><br/><p>During Teacher Dong’s short lesson, he taught little about the definite methods to train and more on the theories relevant to elemental energy—which was precisely the area Ai Hui fell behind in...</p><br/>\n</div>"}