{"title": "Chapter 13: Wind of the Suspending Golden Pagoda", "id": 13, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-13-wind-of-the-suspending-golden-pagoda", "volume_title": "Volume 1", "body": "<h1>Chapter 13: Wind of the Suspending Golden Pagoda</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 13: Wind of the Suspending Golden Pagoda</p><br/><p>Translator: Cynthia Editor: Pranav</p><br/><p>The world inside the door was entirely different.</p><br/><p>After spitting out the blade of grass he had been chewing, Ai Hui had just stepped into the Suspending Golden Pagoda before he was battered and overwhelmed by intense gales.</p><br/><p>All he could hear were the deafening roars of the wind—a fierce sound that he had never heard before. Beneath him were iron fences, and violent metal winds that spewed from the depths swirled into a turbulent vortex that stormed throughout the pagoda.</p><br/><p>Yet before he could gain his footing, Ai Hui was sent flying into the air by the wind. Like a lone leaf swaying in a storm, all he could sense was the world spinning around him.</p><br/><p>Bang!</p><br/><p>Ai Hui grimaced with severe pain as his back forcefully slammed into a wall. The metal wind was so severe that he could not even open his eyes. Even worse, it felt like innumerable small needles were pricking through his muscles and piercing deep into his bones.</p><br/><p>Ai Hui's face turned pale as the unspeakable pain instantly spread all over his body. He had underestimated the pagoda.</p><br/><p>However, thanks to Ai Hui's extensive experience in life-and-death situations, the second he realized his mistake, his body reacted instinctively. Under such a circumstance—which was completely out of his control—the first thing he had to do was protect himself.</p><br/><p>He huddled himself up with his arms on his head.</p><br/><p>Bang! Bang! Bang!</p><br/><p>He was like a ball bouncing around the pagoda.</p><br/><p>The penetrative metal wind continued to submerge him in a flood of pricking pain. Ai Hui felt powerless—a familiar feeling that seemed to bring him back to his initial days in the Wilderness. As the seconds passed, the pain became increasingly severe, to the point that it almost exceeded what he could bear; he felt as if his bones were being rasped by millions of files.</p><br/><p>When was the last time he was in such a fluster? He could not really remember; even in the Wilderness, he had never been in such a state for long.</p><br/><p>Although he was aware that the Suspending Golden Pagoda was for those who had opened their natal residences, he assumed that he could persist because he was confident in his own endurance.</p><br/><p>The extremely concentrated metal energy in the wind permeated into his flesh and blood without showing any signs of diffusion, which indicated that this metal energy could not be absorbed by his muscles.</p><br/><p>Underestimating your rivals can put yourself in a terrible state, just like Ai Hui's situation at the moment—it could not be more disastrous.</p><br/><p>The first step for elemental energy cultivation was to absorb elemental energy into the muscles. One of the quickest methods was to consume elemental soup because a dire beast’s meat was rich in elemental energy. This was best for beginners to absorb and was how Ai Hui had cultivated his own meager amount of elemental energy.</p><br/><p>This method was excellent but expensive. Evidently, a poor wretch like Ai Hui could hardly afford it.</p><br/><p>Another conventional cultivation method was to absorb elemental energy from outside and was referred to as Elemental Energy Input. In this approach, the type of elemental energy could not be chosen casually, and most people would prefer a mild type for easier absorption.</p><br/><p>The needle-like elemental energy contained in the metal wind of the pagoda, however, was not moderate at all. The prickling pain indicated that it could not be easily absorbed and was hence hurting his muscles.</p><br/><p>Ai Hui tried to assimilate the energy into his own, but soon realized that he was being too naive.</p><br/><p>Although the metal elemental energy appeared to be as thin as a strand of hair, it was much more concentrated than his own.</p><br/><p>It was only at this moment that he finally realized why the Suspending Golden Pagoda was only for those who had opened their natal residences.</p><br/><p>Bang!</p><br/><p>Striking into something violently, Ai Hui was suddenly jerked back into reality, but he soon felt as if all his bones were broken. Although that collision had been unpleasant, he could now discern that the prickling sensation in his back had weakened.</p><br/><p>Ai Hui suddenly realized something. Maybe...</p><br/><p>Bang! Although he had struck himself on the wall yet again, Ai Hui rejoiced excitedly.</p><br/><p>He could still clearly perceive the pain in his muscles, but the prickling sensation had been considerably reduced. Even though he was amidst such chaos and was unarmed, Ai Hui was calm enough to observe the slightest changes of his body.</p><br/><p>Whenever his body was knocked into something, the metal elemental energy scattered and was more easily absorbed than the energy in the wind, hence decreasing the pain.</p><br/><p>Nevertheless, Ai Hui's luck didn't last long before his expression abruptly changed.</p><br/><p>The scattered energy had not even been completely absorbed before additional elemental energy permeated into his body, intensifying the pain while causing him to feel as if he had a severe case of dropsy.</p><br/><p>Although in theory, those who had opened their natal residences could choose to train at the Suspending Golden Pagoda, Ai Hui did not know that there were actually very few students who would decide to do so. This was because the metal wind was too wild and the elemental energy—despite being extremely concentrated—was incredibly difficult to absorb.</p><br/><p>Worse still, there were endless amounts of energy in the pagoda.</p><br/><p>The moment he thought of this, Ai Hui realized the danger of his situation. If he stayed for any longer, the growing pain will dull his mind and consciousness, finally resulting in the explosion of his body.</p><br/><p>He had to leave RIGHT NOW!</p><br/><p>Ai Hui stretched his body as he carefully guided his own little bit of elemental energy to his eyes. He could not possibly escape such a perilous environment with the strong wind preventing his eyes from opening.</p><br/><p>Under his meticulous control, the elemental energy inside his body was infused into his eyes for the first time.</p><br/><p>Perhaps because his body was experiencing an indescribable prickling pain, Ai Hui felt only a slight discomfort in his eyes before immediately overcoming it.</p><br/><p>As his vision returned , Ai Hui was able to view the interiors of the pagoda for the first time.</p><br/><p>Ai Hui swirled along with the wind like a dead leaf. Due to long periods of erosion and metallization by the metal wind, the surrounding cross-grained walls glimmered with a dark metallic luster.</p><br/><p>The inside of the pagoda was empty; everything, including the staircases, was long gone.</p><br/><p>To Ai Hui’s surprise, as the metal wind spiraled higher, its strength did not weaken, but instead, grew stronger.</p><br/><p>Yet he had no time to look up. Time was very tight, and he had to escape before the energy surpassed his body's limit.</p><br/><p>Ai Hui was intensely focused as he prepared himself by carefully adjusting his position. With his entire body tingling with pain, it was exceedingly strenuous to maintain a state of concentration; but this was not a difficult problem to the experienced Ai Hui.</p><br/><p>Seeing the gate of the pagoda rapidly approaching, Ai Hui twisted his waist and stretched his body like a spring, as he slightly touched his toes to the ground.</p><br/><p>Pow!</p><br/><p>Forcefully pushing his toes, Ai Hui folded his body into a strange angle—as if his waist was broken—and placed his hands on the ground, resembling a large cat arching its back.</p><br/><p>Using both his hands and feet, he frantically scrambled out of the Suspending Golden Pagoda.</p><br/><p>The instant he exited, all of his strength dissipated, making him feel pain so severe that he felt like he was dropped onto thousands of needles.</p><br/><p>Ahhh!</p><br/><p>The anguished cry frightened away a mass of birds from the nearby woods.</p><br/><p>Ai Hui screamed for 20 minutes before he recovered from the pain.</p><br/><p>It was really unbearable!</p><br/><p>Even with his face contorted in pain, tears in his eyes, and non-existent strength, Ai Hui struggled and eventually managed to get on his feet.</p><br/><p>There was a significant surplus of metal element in his body—even lying still could not stop the bone-stabbing pain.</p><br/><p>Long-lasting pain is no better than short-term pain!</p><br/><p>Remembering that the bumping had helped ease the pain, Ai Hui quickly made up his mind.</p><br/><p>He hastily rushed to the nearest tree. Pow! The tree snapped.</p><br/><p>Next, he crashed into a large stone in front of him. Bang! The stone shattered.</p><br/><p>Ai Hui anxiously searched around. What else can he crash against?</p><br/><p>Ahhh!</p><br/><p>The birds and beasts of the woods fled in panic. Behind them, a miserable cry lingered along with the sand and dust in the air, while countless trees fell down one after another as if there was a horrible, mad ancient beast running amok.</p><br/>\n</div>"}