{"title": "Chapter 15: Replenishing Elemental Energy with Soup", "id": 15, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-15-replenishing-elemental-energy-with-soup", "volume_title": "Volume 1", "body": "<h1>Chapter 15: Replenishing Elemental Energy with Soup</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: Replenishing Elemental Energy with Soup</p><br/><p>Translator: YH Editor: Pranav</p><br/><p>Ai Hui bewilderedly opened his eyes, while his aching body allowed him to take just one breath of the chilly air.</p><br/><p>\"You’re awake?\"</p><br/><p>Lou Lan pushed the door open and entered the room with a steaming bowl of soup in his hands. Despite being quite a distance away, Ai Hui could smell the alluring scent that wafted towards him, unintentionally causing his stomach to let out an embarrassing, loud growl. Making a conscious effort to swallow his saliva, he weakly asked, \"What time is it?\"</p><br/><p>\"It’s eight in the morning,\" Lou Lan replied, as he carefully handed the soup over to Ai Hui.</p><br/><p>The moment he laid his eager hands on the bowl, Ai Hui momentarily forgot about his aches and immediately wolfed down the heavenly, delicious soup.</p><br/><p>\"What time did last night’s practice end?\" he asked indistinctly.</p><br/><p>Not long into last night's session, his consciousness had started to fade, which rendered him unable to recollect anything about what had subsequently happened.</p><br/><p>\"Five in the morning,\" stated Lou Lan.</p><br/><p>Five…</p><br/><p>Ai Hui's reaction was a bit sluggish, but then his expression suddenly stiffened. He finally realized the reason why his entire body was throbbing with aches and why even moving a single finger had become a painful ordeal. His cheeks twitched in disbelief, as he asked, \"You were beating me up the whole time till five in the morning?\"</p><br/><p>Ai Hui immediately felt uneasy when he thought of his unconscious self being violently beaten up like a punching bag. \"I'm very sorry,\" Lou Lan sincerely apologized. \"Although you didn't ask me to stop, I had to end the practice at five to prepare breakfast for Master Shao. But now I have already completed this morning's tasks and can continue practicing with you. Shall we begin?\"</p><br/><p>Feeling sorry for thrashing him 'only' until five in the morning, though…</p><br/><p>Ai Hui shook his head firmly and hurriedly cried out, \"No thanks!\"</p><br/><p>With last night’s tragic experience still vivid in his mind, Ai Hui could not muster up the courage.</p><br/><p>When Ai Hui noticed that Lou Lan seemed to be a bit down, he coughed, and remarked, \"This soup tastes pretty good.\"</p><br/><p>Ai Hui had no idea what soup it was; he was only cognizant of the fact that the soup was incredibly delicious and that it was undoubtedly the best that he had ever consumed. Furthermore, after drinking the soup, a pleasant feeling of heat had gently washed over his body, flowing through every nook and cranny of his being and leaving him feeling comfortably warm.</p><br/><p>Lou Lan, having just been praised, perked up quite a bit. \"Ai Hui, your training places great strain on the body. To prevent deficiencies that could further develop into internal injuries, you must timely replenish and nourish your body,\" he quipped.</p><br/><p>\"You are really amazing!\" Ai Hui could not help but exclaim. \"No wonder I feel my body heating up, it's just like when I had previously tried some elemental soup. Now, that was a perfect dish, one that even had elemental energy!\"</p><br/><p>Lou Lan’s tone rose slightly. \"This soup also replenishes elemental energy.\"</p><br/><p>\"This soup? Elemental food?\" Ai Hui was momentarily stunned. Elemental food was incomparably more expensive than average meals. The school provided such food as well, but even though it could be considered cheaper than what was available outside, it still carried a hefty price tag.</p><br/><p>An ominous premonition rose up in Ai Hui’s chest. He slowly began, \"The ingredients for this soup...\"</p><br/><p>\"They were found in your bag, Ai Hui,\" Lou Lan replied matter-of-factly. \"Although they were just scraps, the ingredients were of decent quality and were suitable for brewing soup. While a standard recipe wasn’t followed, please rest assured that at least seventy percent of the elemental energy was utilized.\"</p><br/><p>Ai Hui felt as though he was forcefully hit by an iron rod. \"Just…just how much did you use?\" he asked, stupefied.</p><br/><p>\"Don’t worry, I have used up everything. I can guarantee that there was absolutely no wastage,\" Lou Lan wholeheartedly pledged.</p><br/><p>This was totally not the kind of guarantee he was looking for…</p><br/><p>Thump! With his heart filled with despair, Ai Hui stiffly collapsed back onto the bed with a forlorn thud. The ingredients that he had painfully accrued for over three whole years had disappeared just like that! After three years of scrimping and saving he had finally accumulated a few valuables. The mere thought of his precious ingredients being used up after just a night’s rest left him trembling with unbearable heartache.</p><br/><p>If Ai Hui understood what utilizing seventy percent of the elemental energy meant, then…</p><br/><p>\"Ai Hui, you should start cultivating now to properly absorb the elemental energy,\" Lou Lan reminded.</p><br/><p>Ai Hui quivered in realization. His ingredients had already been spent, so there was no point in feeling resentful anymore. He gritted his teeth and crawled out of bed; no amount of sweat or blood could deter him from making full use of this elemental energy.</p><br/><p>Ai Hui sat crossed-legged, and according to Teacher Dong's method, he focused entirely on guiding the silver of elemental energy along the path of the five residences and eight palaces.</p><br/><p>Of the eight palaces, the four that were the easiest to open were those present in the four limbs; the left hand palace, the right hand palace, the left leg palace and the right leg palace. The other four palaces—the sky, gate, sea and earth palaces—were located from the space between the eyebrows down to the tailbone, and were significantly harder to open.</p><br/><p>However, regardless of whether the natal residences were opened or whether the eight palaces were accessed, the flow of elemental power always revolved around the five residences and eight palaces. The only difference between the various schools laid in the sequence of routes that the energy could take in the body. Different paths would result in entirely distinct results, giving rise to the myriad of available cultivation methods. Additionally, the marvels and profound mysteries of each of the eight gates presented many opportunities for deeper research and exploration. Each school would pick out an area for further study, and over time, the knowledge gained from the extended periods of research would gradually accumulate and consolidate into their esoteric, unshared secrets.</p><br/><p>Ai Hui had chosen the safest and simplest route; it started from the four palaces in his limbs and was followed by the space between the brows. From there, he continued downwards, using the elemental energy to thread between the sky and earth palaces.</p><br/><p>Once he started to guide the elemental energy, however, Ai Hui felt different than usual.</p><br/><p>Ai Hui had never perceived anything like it; his elemental energy had been significantly strengthened after flowing through only the left hand palace. Gentle yet lively, the elemental energy lightly coursed through his body, causing him to feel lithe, alive and full of vigor. The movement of elemental energy was practically effortless, a far cry from the heavy sluggishness that he usually experienced.</p><br/><p>It was not long, however, before Ai Hui became agitated, as he discovered that the elemental energy within his body was gradually dissipating outward.</p><br/><p>His body’s affinity for elemental energy was still too low.</p><br/><p>Preventing himself from becoming distracted again, Ai Hui concentrated on the flow of elemental energy, and pressed on, making use of every precious second.</p><br/><p>Do not waste it!</p><br/><p>Just thinking about how this elemental energy had stemmed from his three years of cumulative efforts provided Ai Hui with a burst of adrenaline. His entire attention was centered on the elemental energy within his body, which was now surging with speed akin to that of a crazy, sprinting wild horse.</p><br/><p>On recognizing that Ai Hui was fully engrossed in his cultivation, Lou Lan silently stepped out of the room.</p><br/><p>As time crept by, Ai Hui, who had continued to meditate cross-legged, started to emanate a slight, silvery glow. If one moved closer, they would be able to see that this thin layer of light consisted of numerous needles of converging light rays, which were, in actuality, the manifestations of the dispersing elemental energy.</p><br/><p>However, despite Ai Hui’s strenuous efforts, a large amount of elemental energy had still dispersed into the surrounding atmosphere.</p><br/><p>As he cultivated, Ai Hui gradually began to comprehend some insights; he soon realized that the silver elemental energy was the type of energy that was most abundant in his body. This silver elemental energy was, in fact, a form of the scattered metal elemental energy. However, being finer and with a milder attribute, it appeared to be somewhat like fireflies gently floating within his body.</p><br/><p>It existed in a free-floating state and was also the fastest dispersing type of elemental energy.</p><br/><p>The other type of elemental energy present was much more stable and had a high affinity with his physical body, and every time Ai Hui circulated his elemental energy, he would absorb large amounts of it. More importantly, it could also bind and incorporate large quantities of the free-floating metal elemental energy into Ai Hui's original pool of elemental energy.</p><br/><p>This kind of elemental energy probably existed uniquely in the elemental energy replenishing soup.</p><br/><p>Ai Hui had finally understood why so many people risked their lives and delved into the Wilderness to hunt for dire beasts.</p><br/><p>Even though the metal elemental energy had dispersed until there was practically nothing left, Ai Hui did not cease his practice, and he persistently channeled his elemental energy. His body, as well, was unceasingly emitting a faint aura.</p><br/>\n</div>"}