{"title": "Chapter 41: One Slash", "id": 41, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-41-one-slash", "volume_title": "Volume 1", "body": "<h1>Chapter 41: One Slash</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 41: One Slash</p><br/><p>Translator: YH Editor: Pranav</p><br/><p>Duanmu Huanghun had theorized numerous possible scenarios in his mind, but the scene in front of him was totally out of his expectations.</p><br/><p>He started to laugh.</p><br/><p>This guy who had not attended a single introductory lesson nor opened any of his natal palaces had actually dared to challenge someone of his caliber. Duanmu Huanghun was truly speechless at his audacity.</p><br/><p>As for Ai Hui’s sweetheart, well, someone who was attracted to a wretched fool like Ai Hui could not possibly have any skill.</p><br/><p>Today shall be the day I sort out these two adulterers and decapitate my inner demon!</p><br/><p>Duanmu Huanghun let out an evil cackle; his eyes were practically glowing.</p><br/><p>The next moment, however, his smile froze.</p><br/><p>A blurry figure materialized right in front of him like a watery illusion. Fragments of a face—which certainly did not seem to belong to a beauty—appeared to pool together in front of his eyes.</p><br/><p>So…fast!</p><br/><p>A flawless palm, as white as snow, gently pressed on his shoulder.</p><br/><p>Duanmu Huanghun’s pupils widened into large circles.</p><br/><p>Dong!</p><br/><p>A deep, low boom, like that of a cannon firing, resounded; the sound was truly intimidating.</p><br/><p>The exquisite palm stood out like a full moon in the dark night, as surging streams of air formed a ring around it. The ring, which had yet to dissipate, was similar to the smoke rising from the barrel of a rifle that had just fired.</p><br/><p>Duanmu Huanghun’s body had disappeared.</p><br/><p>He instantly flung through the air like a cannonball, smashing hard into the opposite wall and causing a large piece of the wall to collapse onto the ground.</p><br/><p>Amidst the rubble, Duanmu Huanghun struggled to get back to his feet. A rattan shield weaved out of brambles could be seen on his shoulder. That blow had left him feeling dizzy, and he was currently seeing stars.</p><br/><p>What fearsome strength!</p><br/><p>Was Ai Hui’s sweetheart actually a wild bull?</p><br/><p>This…this was not rational…</p><br/><p>How does Ai Hui have such a ferocious girl?</p><br/><p>Although Duanmu Huanghun’s mind was completely fogged up, he quickly realized the predicament he was in. He could feel that his reactions had become sluggish.</p><br/><p>Dang it!</p><br/><p>His body was extremely worn out, his strength totally drained. Most of his effort was given to try and stay clear-headed and his body could now no longer keep up. That blow was so powerful that his muscles were still trembling, and as a result of his immense fatigue, he was unable to control the elemental energy within his body.</p><br/><p>At that very moment, Ai Hui jumped onto the wall, sword in hand.</p><br/><p>As he was leaping through the air, Ai Hui’s anger intensified. When he noticed a figure struggling to climb out of the rubble, he shot off the wall without any hesitation, pouncing straight towards his target’s silhouette.</p><br/><p>From mid-air, he saw the girl from the noodle shop appear beside his target.</p><br/><p>She noiselessly drove her palm into the target’s rattan shield.</p><br/><p>This made Ai Hui even angrier. Not only did she finish the noodles, she was not even going to leave him any soup!</p><br/><p>He viciously charged in their direction.</p><br/><p>Boom!</p><br/><p>A sonic boom rang out again, and a ring-shaped surge of air exploded outwards.</p><br/><p>Before Duanmu Huanghun could even gather his wits, another terrifying force had hit him, and his vision blurred as he was sent flying once again. This attack was almost fatal, thoroughly eviscerating the last shreds of consciousness that he had left.</p><br/><p>Duanmu Huanghun, who had been completely unprepared for something like this, was utterly defeated. Unable to retaliate even slightly, Duanmu Huanghun was like a lamb walking into its own slaughter. Shi Xueman, who had been thoroughly enraged by the labeling of her as Ai Hui’s “sweetheart,” was relentless in her attacks.</p><br/><p>Dong! Dong! Dong!</p><br/><p>The familiar intimidating low, resounding booms sounded out one after another, reverberating throughout the dark, narrow alley.</p><br/><p>Ai Hui saw his target accelerating through the air like a rocket, leaving him in the dust. Rather than relieving his anger, continuously being unable to catch up with his target had only amplified Ai Hui’s rage by many times.</p><br/><p>This was the most stifled he had felt in a long time; his anger was practically boiling over. He grabbed his sword tenaciously, the veins on the back of his hand bulging. The girl from the noodle stall was as fast as lightning and he could barely even capture her movements with his eyes.</p><br/><p>Ai Hui, who was completely focused on his goal, did not notice that the sword embryo had gradually begun to change. The seed of the sword embryo between his eyebrows was rapidly absorbing the blue mist around it, similar to the scorched earth of the desert fervently absorbing rainwater.</p><br/><p>The seed of the sword embryo was tirelessly absorbing the wisps of blue mist.</p><br/><p>Ai Hui could only feel the grass sword in his hand becoming lighter. With his eyes on the prize, Ai Hui made a mad dash for the mouth of the alley.</p><br/><p>Similar to Shi Xueman, the word “sweetheart,” too, had triggered something within Ai Hui. His anger could only be doused by slashing Duanmu Huanghun with his sword.</p><br/><p>Eighty million yuan!</p><br/><p>Eating a simple bowl of noodles had left him eighty million yuan in debt!</p><br/><p>He was now spending every precious ounce of his elemental energy without hesitation, which resulted in a dramatic increase in speed.</p><br/><p>The blurred outline of the sword embryo on his forehead became increasingly distinct as it absorbed the Calming Indigo Silk. Previously, Ai Hui could only faintly discern the presence of the sword embryo’s seed.</p><br/><p>Although he would warmly nurture his sword embryo, his efforts had never largely paid off—until this time.</p><br/><p>Nobody noticed that a faint blue light had crept over Ai Hui’s eyes. The blue glow illuminated his face, causing him to look all the more grave and stern, like a reef hidden deep in the sea.</p><br/><p>The speed at which the sword embryo’s seed absorbed the blue mist started to accelerate.</p><br/><p>Ai Hui’s movement speed was also steadily increasing.</p><br/><p>Ai Hui’s anger grew and grew as he dashed down the alley. He was moving so fast that his vision was affected; the girl from the noodle shop and his target had become a blur.</p><br/><p>The sound of the wind irrigated his ear canals as he swept past the lights of the houses on both sides of the alley.</p><br/><p>He had never run at such high speeds before, even when chased by dire beasts. The fluids within his body surged like flowing magma, and the deafening roar of the wind in his ears competed with that of his heart pounding.</p><br/><p>But...this speed was still not enough!</p><br/><p>Although the silhouette of his target was right in front of him, it seemed like it would forever be out of his reach.</p><br/><p>What other means are there...</p><br/><p>The grass sword in Ai Hui’s hands bobbed up and down with the movement of his body, swaying like leaves drifting in the wind.</p><br/><p>The unique rhythm seemed to rouse a memory that was dormant within the recesses of his mind, and the grass sword started to resonate with his soul. With a light flick of his wrist, the grass sword swayed like a feather, gently slashing at the air ahead with a crisp, humming sound.</p><br/><p>The oncoming wind was seemingly sliced through the middle by the sword, smoothly sliding past Ai Hui.</p><br/><p>Ai Hui’s body left a streaking, blurry trail as he dashed forward.</p><br/><p>His solemn expression did not budge an inch and his glowing blue pupils showed no signs of emotion. They were firmly locked onto his target.</p><br/><p>The soles of his feet forcefully pushed off the ground, propelling him into the air.</p><br/><p>At that moment, the last strand of Calming Indigo Silk was absorbed by the sword embryo and the blue glow in his eyes vanished. The sounds that had enveloped Ai Hui also abruptly vanished—it was as if he had now entered a soundless void.</p><br/><p>Not a single sound could be heard.</p><br/><p>A familiar yet seemingly foreign sword manual flipped open, as if it had been practiced countless times.</p><br/><p>When the light from the mouth of the alley came into sight, Shi Xueman had finally vented most of her anger. She had used the most violent method she knew, which was continuously blasting Duanmu Huanghun more than ten times, with each blast sending him flying further down the alley.</p><br/><p>Looking at the unconscious Duanmu Huanghun flying out into the alley’s opening like a sandbag, she revealed a look of satisfaction. This fellow deserved to be severely punished for speaking out of turn. He may have escaped death, but at least it was not without enduring a living hell first.</p><br/><p>He would likely be bedridden for half a month before he could even get up again.</p><br/><p>She suddenly sensed something and briskly turned around!</p><br/><p>Beneath the night sky, Ai Hui leaped into the air like a giant bird, the darkness acting as his wings.</p><br/><p>An indescribable flash of light pierced through the sky.</p><br/><p>It was as if time stood still.</p><br/>\n</div>"}