{"title": "Chapter 44: First Generation Message Tree", "id": 44, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-44-first-generation-message-tree", "volume_title": "Volume 1", "body": "<h1>Chapter 44: First Generation Message Tree</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 44: First Generation Message Tree</p><br/><p>Translator: YH Editor: Pranav</p><br/><p>Hearing her cry out in surprise, Ai Hui could not help but ask, \"Is there a problem?\"</p><br/><p>Shi Xueman shook her head and only spoke a moment later. \"It’s nothing. I just didn’t expect the pattern of veins on this message tree to be this ancient.\"</p><br/><p>\"Ancient?\" Ai Hui was muddled.</p><br/><p>Shi Xueman raised her head and looked at him strangely. \"You didn’t learn this in school?\"</p><br/><p>\"I am a new student!\" Ai Hui exclaimed.</p><br/><p>He had a poor foundational knowledge and a low base level, yet his swordplay was strangely brilliant. Shi Xueman glanced at him, wondering who could have groomed such a freak.</p><br/><p>She began to explain. \"Message trees were invented by wood elementalists from the Jadeite Forest. These wood elementalists discovered that trees communicated using a unique language, which allowed them to transmit very fragmented information. Building on the language of the trees, the wood elementalists developed a message tree that possessed a greater informational capacity and an increased transmission range. Message trees differentiate from one another through the patterns on their veins. As the trees became more widely used, the wood elementalists in the Jadeite Forest realized that trees’ venation was not complex enough to handle the increasing demand. As a result, they developed the second generation of message trees which have a more complex pattern of veins. As of today, there are already three generations.\"</p><br/><p>Ai Hui asked thoughtfully, \"So is this a first generation or second generation message tree?\"</p><br/><p>\"First generation,\" Shi Xueman concluded.</p><br/><p>\"What an antique,\" Ai Hui said, as he gazed at the message tree in admiration. Perhaps he was influenced by the noodle shop girl’s words, but he suddenly felt that this sprawling tree had a very simple, yet desolate feel to it.</p><br/><p>\"Looks like this training hall has been here for quite a while,\" Shi Xueman noted as she scanned her surroundings. \"What about the owner of this training hall?\"</p><br/><p>\"He left twenty years ago,\" Ai Hui said flatly. \"It was already abandoned when I arrived. Could it have been of some importance?\"</p><br/><p>\"Definitely,\" Shi Xueman nodded. \"The first generation of message trees were not extensively popularized and were only used by a rather small circle of people. The original owner of this training hall must have been a rather remarkable person.\"</p><br/><p>When it came to life-and-death experience, Ai Hui was miles ahead of Shi Xueman, but with regard to historical and scholarly knowledge, Shi Xueman was naturally much more advanced.</p><br/><p>\"Regardless of its past, can it still be used?\" asked Ai Hui.</p><br/><p>He did not care an ounce about the training hall’s past. So what if it was of historical importance? Would he get some money out of it? Certainly not. Ai Hui felt nothing for its potentially glorious history.</p><br/><p>No one could compete with the swordsmen when it came to talking about history and romanticism.</p><br/><p>Just look at those large swordsmen schools—they were easily around for thousands and thousands of years. Although the swordsmen were masters with realms many times higher than those of the Avalon of Five Elements, they could hardly claim to have ruled over the entire Cultivation World.</p><br/><p>In the end, they were still wiped out, swept away by the tide of history.</p><br/><p>Ai Hui was hence not interested in any of the ‘history stuff’ that the noodle shop girl was talking about. First generation or not, the most important matter was whether it could still be used.</p><br/><p>\"It can be used,\" Shi Xueman answered, a little bit astonished. Someone who found out that he was staying in a training ground of such historical significance should be excited and curious to find out more, and maybe even hope to uncover an absolute art or two.</p><br/><p>The person standing in front of her, however, was completely aloof.</p><br/><p>\"It’s settled then,\" Ai Hui said, nodding.</p><br/><p>Shi Xueman shut her book. Looking at the time, she also nodded. \"Okay, keep a watch on your message tree. If you have any information for me, you can send it to me via the message tree as well. Here is a leaf from my message tree, although I doubt you’d know how to use it.\"</p><br/><p>Shi Xueman placed her own leaf on the branch from which she previously plucked a leaf. A soft, green light appeared between the leaf and the branch, joining the two.</p><br/><p>\"To send me a message, simply write on this leaf, but try to limit your word-count. Messages that I send you will appear here as well. Remember to take note and receive them.\"</p><br/><p>Ai Hui turned his head and called out, \"Lou Lan, I’ll leave this to you! Come find me at the usual place if there’s anything.\"</p><br/><p>\"Alright, Ai Hui,\" Lou Lan replied happily.</p><br/><p>Shi Xueman glared at him and commanded coldly, \"You’d better practice hard. The more powerful you become, the sooner you’ll be able to repay your debt of eighty million yuan.\"</p><br/><p>With that, she swiftly departed.</p><br/><p>Ai Hui let out a huge sigh, as he collapsed into the rattan chair. He whined, \"Lou Lan, why am I so unlucky?\"</p><br/><p>A yellow light flickered in Lou Lan’s eyes as he deeply pondered the question. A few moments later, he returned back to normal and stated truthfully, \"This question is too profound for me, Ai Hui. I don’t have any answer.\"</p><br/><p>\"Eighty million yuan...\"</p><br/><p>Ai Hui felt his eyelids grow heavy, and the regular sound of his sighs lulled him into dreamland.</p><br/><p>Lou Lan had already left when Ai Hui suddenly woke up in the dead of night. The moment he opened his eyes, he was met with a sky full of stars. He lost himself for a moment, deeply awed by the boundless and mysterious night sky.</p><br/><p>It took a good while before he snapped out of it, and he then promptly sat up in his chair.</p><br/><p>During his training in the Suspending Golden Pagoda, his biggest change was that he was able to fall asleep because the intensity of his training would completely exhaust him. Resting against the walls of the pagoda, he would often fall asleep without even realizing it.</p><br/><p>The seed of the sword embryo came to his mind. Although that detestable thing had absorbed the Calming Indigo Silk, which was worth eighty million yuan, it had allowed him to unleash such an amazing sword technique.</p><br/><p>...</p><br/><p>His first thought was to reach for his sword, but he soon let out a bitter laugh.</p><br/><p>His only grass sword was already destroyed.</p><br/><p>He shook his head and couldn’t help but let out another laugh. Since he was not able to sleep, he would train.</p><br/><p>Two days later.</p><br/><p>Ai Hui was carrying travel bags that were bursting with blood-and-bone strengthening cake as he waved farewell to Lou Lan. \"Goodbye, Lou Lan!\" he shouted.</p><br/><p>Lou Lan dissolved into a pile of sand, subsequently transforming into a huge clenched fist of yellow sand. \"Ai Hui, all the best!\" Lou Lan shouted in return.</p><br/><p>The sun’s warmth enveloped everyone on the streets. Ai Hui had gotten rid of the misfortune of the past two days, sweeping the debt to the back of his mind. He was now filled with hope for the future and self-motivation.</p><br/><p>\"Did you know? Two nights ago, an extremely skilled pervert appeared here!\"</p><br/><p>\"Oh yes, I’ve heard of it. A naked man reportedly ran onto the main street.\"</p><br/><p>\"Indeed, it’s so scary! What’s more, the pervert was highly skilled. Seriously! What if he takes a fancy to me? How am I supposed to retaliate? I’m so worried! A pity it’s not our Huanghun, otherwise I would gladly not resist.\"</p><br/><p>\"What nonsense! Our Huanghun is such an upright young man!\"</p><br/><p>\"I haven’t seen our Huanghun for the past few days though.\"</p><br/><p>\"Our idol is injured, I heard he needs to rest for at least ten days. Have you forgotten that he tired himself out too much when he entered the city and fell as a result? He must have been injured since then. I don’t even know how serious it is, how worrying!\"</p><br/><p>\"Yes, he’s so delicate yet he still went to challenge Gu Tianning and the others. It’s so heart-wrenching that he’s so stubborn!\"</p><br/><p>\"That’s what I love about him!\"</p><br/><p>...</p><br/><p>Listening to the bunch of young girls chattering away, Ai Hui sneered in his heart. That childish, delinquent brat! That double-crossing backstabber! He was such a disgrace! He deserved to be spurned!</p><br/><p>Ai Hui raised his head loftily and walked out the city gate, full of disdain.</p><br/><p>When he eventually reached the Suspending Golden Pagoda, Ai Hui felt stirred up quite a bit.</p><br/><p>Such training may be seen by others as dull and arduous, but to Ai Hui, it instead made him excited and gave him a feeling that he was steadily progressing.</p><br/>\n</div>"}