{"title": "Chapter 54: Twinkle Twinkle", "id": 54, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-54-twinkle-twinkle", "volume_title": "Volume 1", "body": "<h1>Chapter 54: Twinkle Twinkle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 54: Twinkle Twinkle</p><br/><p>Translator: Irene Editor: X</p><br/><p>Looking at his teacher surprised expression, Ai Hui stared vacantly at himself as his heart skipped a beat.</p><br/><p>He was like a gambler scratching a lottery ticket. The first numbers matched and only the last one remained. The jackpot was just one number away. He felt his heart in his throat and excruciating pressure.</p><br/><p>Ai Hui had always viewed himself as someone who could maintain his composure well, but at this instant, he could not contain his agitation at all.</p><br/><p>He knew clearly that he was not gifted. Although Teacher had often proclaimed him a genius, this did not improve his inferior aptitude. With great difficulty, he actually managed to possess seven strong palaces. He was only one strong palace away from the legendary existence known as the hegemon of the palaces.</p><br/><p>Sure, it was the first time Ai Hui had heard about the hegemon of the palaces. He did not actually know if it was truly legendary. Looking at his teacher’s fervent expression, however, he was quite convinced that the title referred to a very powerful, natural talent.</p><br/><p>From the start, Ai Hui felt pretty much hopeless when it came to his innate abilities. When someone suddenly informed him that he actually possessed a hidden and potent gift, one could only imagine the turmoil he felt after hearing the news.</p><br/><p>But… Teacher is not moving nor saying anything…</p><br/><p>The radiance in Ai Hui’s eyes dimmed. All right, so he was not a hegemon after all. If the last one was a strong palace, teacher would have mentioned it immediately. Ai Hui recovered from his disappointment quickly and started laughing mentally. He had been too greedy. What more could he possibly ask for when his limbs were balanced and seven out of his eight palaces were strong?</p><br/><p>As someone who had been fumbling in the dark for so long, he yearned for the light, but did not dare to claim the entire sun. He was like a poor and hardworking laborer, daydreaming about winning a small amount of prize money, but never wishing for an excessive windfall.</p><br/><p>“Why is this light twinkling? Is it a strong or weak palace?” the old man muttered, his voice full of doubt. “Perhaps there’s really something wrong with the copper armor? Seems like it, or it wouldn’t flicker like that.”</p><br/><p>Silverish-white light glowed from seven of the palaces. They shined brightly and continuously. The sky palace, however, was sometimes bright and sometimes dim</p><br/><p>For a moment it was a strong palace, but at another it became weak? Could it be that the sky palace was volatile? At this time, the old man had already readjusted his mental state. The old man kicked the armor and even smacked the helmet a few times. Same result.</p><br/><p>“This is really weird, what is going on?” the old man mumbled perplexedly. “Is the helmet defective? I have to find the blueprints. Did something go wrong during the designing process?”</p><br/><p>After much effort, Ai Hui took off the heavy copper armor. He was sweating buckets and was as wet as if he had been fished out of water. His clothes were drenched, his face was pale, his body exhausted, and some of his muscles continued to uncontrollably twitch.</p><br/><p>Breathing in the fresh air, Ai Hui felt he was revived after what seemed like a lifetime ago. The letdown from earlier vanished into thin air and there was only joy after the calamity.</p><br/><p>“Son, no problem!” The old man consoled Ai Hui. “I will redesign the Thousand Prajna. I’ve gotten many new inspirations and have already thought of the possible mistakes that have been made. Don’t worry, the new version will be perfect. I could even include new features. We can do a retest when it’s done!”</p><br/><p>The word “retest” sent Ai Hui’s body into a fit of shivering.</p><br/><p>He could not bear to imagine undergoing such a torturous test for a second time and hurriedly replied, “I think it’s very accurate, Teacher. I think the results are great, so we don’t have to test it again. Having seven strong palaces is good enough. It’s not too late to conduct a retest after I’ve developed my sky palace.”</p><br/><p>The old man thought about it and concurred. Out of the five residences and eight palaces, the sky palace was the hardest to develop. Most students left it for last. Judging from Ai Hui’s progress, the sky palace was still a distant goal.</p><br/><p>“What you said makes a lot of sense.” The old man decided not to bother himself with the hegemon of the palaces. Plus, he could tell that his disciple was in a pitiful state and felt quite apprehensive. He had finally found a disciple. If he experimented too much on Ai Hui… No, if he trained Ai Hui so hard that he broke, where would he find another disciple as good as Ai Hui? Most people could not endure his test. He himself only managed to persevere for three minutes before crying out loud.</p><br/><p>It wasn’t a minor feat for Ai Hui to persevere through and complete the test.</p><br/><p>The old man quickly smiled. “Son, having seven strong palaces is already a great gift. Let’s discuss the concrete training methods. My secret methods.”</p><br/><p>Ai Hui’s body had recuperated after a period of panting. He perked up upon hearing those words. Although his teacher wasn’t very reliable at times, it was a fact that he had substantial knowledge.</p><br/><p>Noticing that Ai Hui had revived by quite a bit, the teacher thought to himself that his disciple had quite a sturdy physique. Ai Hui’s recovery speed was faster than most people’s. Maybe he should test this out someday? This quality was quite rare, and it would be a pity if it wasn’t put to good use. How could this advantage be effectively utilized? He had to think this over properly.</p><br/><p>“Sir?” Ai Hui saw that his teacher was in a daze and quickly called for his attention.</p><br/><p>“Oh, oh, oh.” The old man regained his senses and said lightly, “I will have to analyze your test results for a few days before giving you the report. Meanwhile, you should train according to the usual training methods and attend classes studiously. You should still go to class since I am not all-knowing. It is very necessary and beneficial for you to expand your horizons. Your training in the future will be quite different from the norm. Sculpting, for example.”</p><br/><p>“Sculpting?” Ai Hui was stunned. He had not imagined that training and sculpting would be linked together.</p><br/><p>“That’s right, sculpting.” The old man was obviously enjoying Ai Hui’s surprised expression. “Haha, didn’t expect that, did you? A lot of knowledge is involved in training. What’s the relationship between sculpting and training? You’re attributed in metal elemental energy. The most appropriate training would be sculpting. It can strengthen your ability to control the elemental energy. Think about it. Elemental energy is like the sculpting knife. There are big, small, angled, straight, and uniquely-shaped knives used for different tasks. Furthermore, when you’re sculpting, you should not place all your focus on controlling the elemental energy. Otherwise, you won’t be able to sculpt well. It’s not easy to manipulate your elemental energy as you like, when you like. If you can learn how to sculpt your elemental energy and wield it proficiently, your meticulous energy control would reach an outstanding level. In the future, practicing complex moves would come easy to you.”</p><br/><p>Ai Hui’s eyes glowed as the realization hit him.</p><br/><p>That’s right, if he could carve a complicated sculpture, his control over elemental energy would reach a whole new level!</p><br/><p>“But, training has always been easier at the start. It would be very difficult for you to start sculpting immediately. I have already thought of a simpler training method.” The old man smiled mysteriously.</p><br/><p>Strangely, the grin of his teacher’s face made Ai Hui hesitate. “What method?”</p><br/><p>“You’ll know when the time comes.”</p><br/><p>The unease in Ai Hui’s heart became even stronger.</p><br/>\n</div>"}