{"title": "Chapter 56: Dai Gang", "id": 56, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-56-dai-gang", "volume_title": "Volume 1", "body": "<h1>Chapter 56: Dai Gang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56: Dai Gang</p><br/><p>Translator: Irene Editor: Lis</p><br/><p>Wang Shouchuan grew even more pleased at the sight of Old Tao’s stupefied expression.</p><br/><p>Both were clear on the terror of the Thousand Prajna. In fact, like Old Tao, Wang Shouchuan used to think nobody would be able to endure its effects.</p><br/><p>This had left Old Wang feeling a bit disgruntled. No matter how magnificent or unique the design, without any practical value, it was only an elaborate toy.</p><br/><p>But with the truth revealed that the Thousand Prajna was indeed of use, how could he possibly contain his joy? Even more satisfying was that his disciple was the one to pull through the test.</p><br/><p>After a while, Old Tao regained his senses and sighed. “You hit the jackpot!”</p><br/><p>Able to bear the Thousand Prajna—who wouldn’t want such an admirable disciple with a strong-as-steel willpower? Old Tao’s eyes became slightly red.</p><br/><p>“Isn’t my disciple your disciple?” Old Wang sensed his friend’s disappointment and deliberately pointed out, “I’ve come all the way here. Are you still going to keep this up?”</p><br/><p>Old Tao laughed and pointed at Old Wang. “It’s time to let your disciple take advantage of me!”</p><br/><p>Old Wang chortled together with his friend. “Of course, it would be a waste not to!”</p><br/><p>“No problem,” Old Tao readily promised, “Find me if you have any problems. As long as your disciple is here, I won’t mistreat him.”</p><br/><p>“Then perfect timing—there’s something I need your advice on.” Old Wang’s expression took a serious turn as he handed over the test results to Old Tao. “Take a look at this test results for me.”</p><br/><p>With some curiosity, Old Tao received it and glanced over the contents before he burst out in a shriek, “Now you’re just bragging, aren’t you? Seven strong palaces out of eight—what a big gain!”</p><br/><p>“But he almost never made it into the Induction Ground due to his weak aptitude.” Old Wang feigned modesty, but inside, he was secretly delighted.</p><br/><p>“Aptitude? That’s all those guys care about.” Old Tao smirked disapprovingly. He and Old Wang agreed that the Induction Ground’s testing methods were overly simplistic and lacking.</p><br/><p>Old Wang added, “Look at the test results for his sky palace.”</p><br/><p>“Sky palace?” Old Tao’s gaze swept across the record before questioning softly, “It doesn’t seem quite right. Is there something wrong with your Thousand Prajna? How could there be a sky palace that fluctuates in strength?”</p><br/><p>Vexed, Old Wang replied, “Yeah, I found it strange, too. If only his sky palace was strong—he’d be the hegemon of the palaces.”</p><br/><p>Old Tao understood Wang’s underlying thoughts and attempted to console him. “Don’t let your ambition get the better of you. It’s already rare to see seven, strong palaces after all. If you can’t stop worrying, why not try testing it again? Your Thousand Prajna is spoilt, that’s for sure. Or else, how is that even after teaching training basics for so long, we’ve never heard of a fluctuating sky palace?”</p><br/><p>“Again?” Old Tao asked helplessly. “You should’ve seen that fellow’s expression when I made that suggestion. He was ready to flee!”</p><br/><p>“Hahaha!” Old Tao burst into laughter at the thought. “I would do the same! You yourself started crying like a chrysanthemum after three minutes.”</p><br/><p>Old Wang joined in the laughter. “Don’t even mention it—I’m afraid I’ll destroy him. There’s a lot of time for a retest, but I only have one disciple, so I’ll have to take it easy.”</p><br/><p>“Did you report it to the higher-ups?” Old Tao reminded him.</p><br/><p>“Of course.” Old Wang nodded. “Who’d dare forget?”</p><br/><p>Teacher Xu arrived at the teacher lounge as usual, only to be swamped immediately by the teachers who rushed to greet him. After Duanmu Huanghun’s public declaration, Teacher Xu’s popularity skyrocketed, making him Central Pine City’s famous star. To many, Duanmu Huanghun’s decision to remain in Central Pine City was largely due to Teacher Xu’s personal charms.</p><br/><p>Just like that, Teacher Xu became the number one teacher in Central Pine City. With his magnanimous personality, the people came to love and respect him sincerely.</p><br/><p>For a whole ten minutes from the entrance of the teachers’ lounge to his booth, Teacher Xu returned the endless greetings. Only when he got to his table did he sigh in relief before noticing the two documents lying on top.</p><br/><p>After leisurely pouring a cup of tea, he casually grabbed one and opened it. Glancing over the contents, he immediately sat straight up. That was the signature issued by the Elders Guild!</p><br/><p>Dai Gang took a liking to Duanmu Huanghun and accepted him as his last disciple!</p><br/><p>Dai Gang!</p><br/><p>Teacher Xu couldn’t believe his own eyes; the news came too suddenly. Who was Dai Gang? Only the most senior minister and one of the strongest wood elementalists around today. He created the absolute art [Death Commandment], which became one of the five most powerful skills used by wood elementalists, and innovated upon two schools of thought associated with the lotus and grass tendon plants, the [Lotus Chiropractic Technique] and [Grass Tendon] skills respectively.</p><br/><p>Dai Gang was a man who disregarded the world around him and focused only on his research. Other than the two disciples he accepted in his early years, he had not taken another since then. Who would have thought that today, he would receive yet another? Teacher Xu knew without a doubt that the announcement would trigger a sizeable commotion.</p><br/><p>Teacher Xu wasn’t a naive, bookish type by any means. Duanmu Huanghun was no doubt a talent, but was he enough to catch Dai Gang’s attention? It was certainly questionable.</p><br/><p>He could sense the hidden currents; the alliance between Dai Gang and the Duanmu Family would bring about many change to the Avalon of Five Elements.</p><br/><p>Moments later, he chuckled. The workings of the Avalon of Five Elements was not something a small character like him could grasp. No matter what hidden dealings may be working behind the agreement, it was a benefit for Duanmu Huanghun to study under Dai Gang who was not only a wood grandmaster elementalist but an outstanding educator as well. His first disciple, Lu Chen, was one of the three most prominent doctors of the present age, widely acclaimed for his extraordinary expertise. The second disciple, Yu Mingqiu, broke the record in becoming the youngest vice division leader of Deathgrass, one of the thirteen divisions. He went on to invent an absolute art, [Galactic Streak], that allowed him to walk the world alone with his mastery of archery.</p><br/><p>Knowing that his student had a bright future ahead of him, Teacher Xu was satisfied.</p><br/><p>Only after some time did he finally recover enough from his shock to look over and open the second document—only to receive another small shock.</p><br/><p>Wang Shouchuan had taken Ai Hui as his disciple.</p><br/><p>He’d heard the name Wang Shouchuan before. He was an old teacher with several decades of experience teaching training basics in Central Pine City, with even more qualifications than Teacher Xu. He had little impression of this man except that he was unsociable and kept a low-profile; such an inconspicuous teacher could easily be found anywhere.</p><br/><p>It was astonishing enough that such a quiet figure like Teacher Wang accepted a disciple, but the fact that it was Ai Hui shocked him more.</p><br/><p>Teacher Xu admired Ai Hui and his sensibility, diligence, and polite mannerisms; he even managed to recently activate his natal residence as well.</p><br/><p>Yet he also was aware of his low aptitude and weak foundation. To put it simply, he was the worst student in the class. For Teacher Wang to choose such a disciple—what a strange individual!</p><br/><p>Only in the midst of his considerations did Teacher Xu realize that these two students were in the same class; one at the top—gifted and skillful—and one at the very bottom, with a poor aptitude and shaky basics. Not only that, but both simultaneously gained mentors; one was a well-respected grandmaster and the other an unknown teacher.</p><br/><p>How… interesting!</p><br/><p>After so many years teaching, this was the first time Teacher Xu felt such bemusement.</p><br/>\n</div>"}