{"title": "Chapter 60: The Sword Embryo’s Change", "id": 60, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-60-the-sword-embryo%E2%80%99s-change", "volume_title": "Volume 1", "body": "<h1>Chapter 60: The Sword Embryo’s Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 60: The Sword Embryo’s Change</p><br/><p>Translator: Irene Editor: Pranav</p><br/><p>Mingxiu couldn’t tell what Ai Hui was up to, but she could see that he seemed somewhat self-assured.</p><br/><p>And…</p><br/><p>When he held the sword, she sensed that Ai Hui’s temperament changed for the better. However, she couldn’t exactly describe what kind of change it was, and after taking a closer look, she believed that what she just felt was an illusion.</p><br/><p>Ai Hui stood motionless before her.</p><br/><p>“Then I’ll start now.”</p><br/><p>The elemental needles in front of her started moving, and two rays of light flashed through the air. The lights seemed to interweave as the muslin spindle on the embroidery stand spun swiftly.</p><br/><p>The quick movements of Mingxiu’s elemental needles reflected brilliant rays like that of running water, and the thin, light muslin cloth gradually grew longer. The muslin threads created friction, making a non-stop hissing sound.</p><br/><p>“Senior Mingxiu is so skillful!”</p><br/><p>“So quick! How can the [Twin Weaving Technique] have such speed? Oh my god, I’m not even half as fast as Senior Mingxiu!”</p><br/><p>“Quick, come and look! It’s a double stream; there are ripples both horizontally and vertically. How amazing!</p><br/><p>“As expected from Senior. She’s definitely going to become a master in future!”</p><br/><p>……</p><br/><p>The surrounding ladies repeatedly exclaimed in admiration. They had been learning embroidery every day and had a greater understanding of it than most people—precisely the reason why they were so shocked. They were completely aware of the difficulty of this step.</p><br/><p>The old lady couldn’t help but feel gratified by Mingxiu’s performance. Although there were many embroidery girls in the workshop, only Mingxiu had the capability to continue her legacy.</p><br/><p>Unlike the old lady, the old man was feeling quite nervous.</p><br/><p>Amongst the continuous hissing sound and the ongoing commentary, Ai Hui’s posture was abnormally strange. He was as still as a statue, and his bright eyes were fixed on the magnificent scene happening before Mingxiu.</p><br/><p>The moment Ai Hui had gripped the sword, he had sensed that something was amiss with his sword embryo.</p><br/><p>In the past, his sword embryo was faintly discernible, and although he could sense its presence, it was very difficult to accurately describe it. This time, however, he could really “see” it—it was an infinitesimal wisp of a blue-colored sword gleam.</p><br/><p>It was very, very small, to the point where it was uncertain if it could even be considered a sword gleam, but at that moment, Ai Hui was sucked into it. A blue similar to that of Calming Indigo, it was just lonely and proudly existing amidst the chaos between his brows.</p><br/><p>The sword in his hands seemed like a part of his body. He had experienced a similar feeling in the past, but it wasn’t as intense as now. Ai Hui could even feel the empowering effect the sword had on his state of mind.</p><br/><p>With that, he looked towards Mingxiu.</p><br/><p>The ripple-like light reflected off the needles seemed to slow down in Ai Hui’s eyes till he could clearly discern the trajectory of the elemental needles. He could perceive exactly how they moved alternatively, how the muslin threads interweaved, and even how the airflow, which was caused by movement of the elemental needles, steadied the threads.</p><br/><p>How intriguing!</p><br/><p>Ai Hui watched silently. He knew that the elemental needles did not slow down but that instead, his perception had been enhanced. He admired the splendid scene happening before his eyes—it really was aesthetically pleasing!</p><br/><p>Although it seemed like Mingxiu was only controlling the elemental needles, her body muscles were neither completely relaxed nor tensed, but rather somewhere in between. Her extended arms helped her to stabilize and optimize her center of gravity.</p><br/><p>It was a picture of strength and beauty.</p><br/><p>In this picture, elemental energy was flowing like trickling water streams and was stable like the spinning muslin spindle. Full of well-distributed rhythm, the elemental energy maintained the high operating speed of the elemental needles.</p><br/><p>Ai Hui was learning many things; for example, the elemental energy used to control the elemental needles had to be well-distributed, and only then would it expedite the embroidery process.</p><br/><p>Yet such a change wasn’t enough to surprise Ai Hui. Even though he had become more intuitive and perceptive, he had already discovered that in the past.</p><br/><p>What really shocked him was that this was the first time he had seen something he couldn’t explain.</p><br/><p>He did not know what the faint mist curling up from Mingxiu’s surroundings was. It was constantly changing shape; a soft light at times, yet foggy and indistinct at times. Sometimes, it would come out in sheets, like fluttering fish scales.</p><br/><p>Also, within the ripples created by Senior Mingxiu’s elemental needles, there were faint, twinkling spots of light, like stars scattered over the pond’s surface.</p><br/><p>It was the first time these had appeared.</p><br/><p>Even after racking his brains for a long time, Ai Hui was still clueless.</p><br/><p>The sword embryo had changed after absorbing the Calming Indigo. Why did it absorb the Calming Indigo in the first place? Ai Hui still did not know the reason. He couldn’t find an answer in the sword manuals. Materials of ancient times were completely different from today as their terminologies and characteristics had undergone major changes.</p><br/><p>Calming Indigo was a newly developed item and was absent in the Cultivation Era. There definitely would be something similar in the past, but Ai Hui had no idea what it was called.</p><br/><p>Parts of the sword manuals that explained methods of the sword embryo’s development were severely damaged, so Ai Hui had to fill in most of the missing information himself. He was completely unaware of how things would turn out.</p><br/><p>On the bright side, the sword embryo had strengthened after unexpectedly absorbing the Calming Indigo. Ai Hui presumed that the Calming Indigo must have contained some type of substance that assisted the training process.</p><br/><p>It was a pity that the Calming Indigo was gone. He couldn’t even afford the cheapest kind, or else he could conduct research on the types of substances that were needed for the development of the sword embryo.</p><br/><p>This thought flashed through his mind but was gone within seconds, like a small candle flame in a gale.</p><br/><p>Calming Indigo, eighty million yuan!</p><br/><p>Although Ai Hui was startled by the sword embryo’s change, his shock disappeared at the thought that this change had cost eighty million yuan.</p><br/><p>If it had been elemental energy development, then what kind of change could eighty million yuan bring?</p><br/><p>Ai Hui did not know if the ingredients needed for a lifetime’s training would add up to eighty million yuan, but then he thought about how he could at least become a legitimate elementalist.</p><br/><p>Meticulous with his calculations, Ai Hui knew the sword embryo was something that cost much but yielded little, whereas elemental energy development was the exact opposite.</p><br/><p>The choice was clear.</p><br/><p>Ai Hui would not be tempted by the sword embryo. No matter how special it was, Ai Hui was a practical man whose dream was to only become a registered elementalist.</p><br/><p>His gaze was firmly fixed onto Mingxiu, not wavering in the slightest.</p><br/><p>Her speed was rapidly reducing, and Ai Hui knew that she was doing it on purpose, for his sake.</p><br/><p>Ai Hui was grateful for her kindness, but that picture of strength and beauty had become relaxed and no longer seemed as artistic.</p><br/><p>He sighed to himself.</p><br/>\n</div>"}