{"title": "Chapter 68: Reveal", "id": 68, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-68-reveal", "volume_title": "Volume 1", "body": "<h1>Chapter 68: Reveal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 68: Reveal</p><br/><p>Translator: Cynthia Editor: Pranav</p><br/><p>“By the way, Bangwan, do you know where Ai Hui lives?” Mingxiu asked. “I tried to find him in many places but failed.”</p><br/><p>When Duanmu Huanghun, whose heart was weeping silently, heard this, he almost burst into laughter—so he was not the only one who couldn’t find Ai Hui after all.</p><br/><p>Wait. Okay, this was nothing to be happy for.</p><br/><p>Duanmu Huanghun felt that he was almost being driven insane by himself. What the hell happened to him? Why was he always making mistakes like this?</p><br/><p>After making a series of stupid mistakes for no reason, he really wanted to cry.</p><br/><p>“I don’t know either. He seldom comes to class.” Managing to calm himself down, Duanmu decided to say something bad about Ai Hui first. He then added, “He used to live in Vanguard Training Hall. You can try to find him there.”</p><br/><p>“Great. Then I’ll go to the training hall now.” Mingxiu was happy, but then she frowned when she thought of Ai Hui’s bad habit of skipping classes. She should definitely remind him when she sees him later.</p><br/><p>Duanmu Huanghun was lost in thought as he watched Mingxiu walk away. Her name sounded familiar to him. He felt as if he had heard of her name somewhere before, but now he couldn’t remember clearly.</p><br/><p>As he had met countless ladies, Duanmu was very experienced in this aspect. It was impossible for that girl, who was gentle, respectable, and had such an outstanding temperament, to be a nobody. Suddenly he recalled some details, such as her clothing, which was simple, plain and not resplendent at all. But the texture was clearly of high quality, and it was all made of elemental fabrics. Moreover, the embroidery of the clothing was clearly a masterpiece.</p><br/><p>As a member of an honored family who had lived an extravagant life since childhood, Duanmu Huanghun could tell this from just a glance. Mingxiu’s clothes were not conspicuous, but in terms of price, it was even higher than what he was wearing.</p><br/><p>Ai Hui was poor and weak. How could his senior Mingxiu be so rich?</p><br/><p>Embroidery…</p><br/><p>Duanmu Huanghun finally realized who Mingxiu was—she was the favorite disciple of Master Han Yuqin! Central Pine City was small without many notable big shots, which was why Duanmu was able to quickly remember her. Since he had decided to study in Central Pine Academy, his family had already collected all the information about the city.</p><br/><p>The first person one could not offend here in Central Pine Academy was Master Han Yuqin.</p><br/><p>No matter where she went, the embroidery master would always be an honored guest. Even his teacher, the Grandmaster Dai Gang, would keep a low profile in front of her.</p><br/><p>Duanmu Huanghun knew much more than others. Han Yuqin’s embroidery workshop was remote and very few people knew where it was, and if it wasn’t specially investigated by his family, he wouldn’t have known that this ordinary workshop was owned by such a personality.</p><br/><p>And no one was stupid enough to go and offend an embroidery master.</p><br/><p>Workshops like this had business with the Thirteen Division. Many clients came to purchase high-end elemental fabrics, and these clients were either wealthy or powerful.</p><br/><p>The interpersonal connections behind it formed a huge, invisible network.</p><br/><p>Then Mingxiu should be the disciple of Master Han Yuqin. How could she be Teacher Wang’s disciple? No! It suddenly occurred to him that Han Yuqin’s husband was said to be a teacher in Central Pine Academy. That must be Teacher Wang!</p><br/><p>Duanmu Huanghun was greatly surprised at this conclusion.</p><br/><p>Teacher Wang was a person to whom very few people would pay attention, and Duanmu didn’t have the slightest impression of him. Judging from the class he taught, his level should not be very high.</p><br/><p>Duanmu quickly calmed down—this was not surprising at all.</p><br/><p>All of a sudden, he felt curious; why was Mingxiu searching for Ai Hui?</p><br/><p>Why not go and have a look?</p><br/><p>Once he had such an idea, Duanmu couldn’t sit still. Yes, he should go and have a look! That damned fellow was already very weak, and he skipped school almost every day. What on earth was he doing?</p><br/><p>Duanmu Huanghun told himself that since they were now teammates, if Ai Hui was too weak, the team would lag behind, which would directly influence himself.</p><br/><p>He set out immediately.</p><br/><p>The Vanguard Training Hall was remote and it wouldn’t be easy for Mingxiu to find it, so it wasn’t too late for Duanmu to start now.</p><br/><p>Yet he didn’t go to the training hall directly; instead, he went back to where he lived and wore an elemental mask.</p><br/><p>This was the inconvenience his fame brought him—he would be recognized far too often. He didn’t want to be interrupted by some crazy female students on the way.</p><br/><p>He made up his mind to find out what the hell the bastard was doing.</p><br/><p>The face in the mirror was strange, and the eyes were cold.</p><br/><p>As he had expected, by the time he made it to the alley to Vanguard Training Hall, Mingxiu hadn’t arrived. So he bought a stick of candied fruits, hid himself somewhere covert, and waited like a patient hunter.</p><br/><p>“Be more careful if you come here alone next time.”</p><br/><p>A boy was speaking to the girl beside him as they walked by.</p><br/><p>“Why? It’s not safe here?” The girl was curious.</p><br/><p>The boy said seriously, “You don’t know? This is where the streaking case took place some time ago.”</p><br/><p>“Really?” The girl was greatly surprised. “The insane naked guy?”</p><br/><p>“Yes, I was here that night and saw it myself. The psycho also had strong fighting skills.” The boy continued, “Do take care of yourself.”</p><br/><p>Duanmu was eating the candied haws, and when he heard their conversation, he froze, and his face burned as if he had been slapped harshly. He felt like finding somewhere to hide himself. What happened that day inadvertently reappeared in his mind. Although it had already passed, he still felt humiliated.</p><br/><p>Immersed in the unbearable memory, Duanmu didn’t notice the boy’s unintentional glimpse towards him.</p><br/><p>The boy’s body froze.</p><br/><p>Noticing this abnormality, the girl asked, “What happened?”</p><br/><p>“Nothing,” he answered in a low voice, and he pulled her hand quietly as a hint that they need to leave as soon as possible.</p><br/><p>The girl didn’t understand what he meant, but she still quickly followed him and left.</p><br/><p>Having walked some distance away, the boy, still a bit scared, looked back and sighed with relief when he confirmed that Duanmu was looking down at the ground and hadn’t seen them.</p><br/><p>“What happened to you just now?” the girl asked, concerned.</p><br/><p>The boy was about to answer when he noticed two guards on patrol. He quickly took the girl’s hand and ran to them.</p><br/><p>Duanmu Huanghun on the other side of the street, however, was still thinking about the shameful scene, and therefore didn’t notice the nervousness of the guards after they heard what the boy said.</p><br/><p>The guards took it very seriously, because the reason why they were on patrol there every day was precisely the streaking case that Central Pine Academy was trying to investigate.</p><br/><p>Due to the rise of Duanmu Huanghun, the fame of the academy had been enhanced and was recently in a steady increase. So how could they put up with such a scandal?</p><br/><p>Every guard clearly knew that the naked miscreant had strong fighting skills.</p><br/><p>One of them opened the mini grass cage on his shoulder, from which a gray signal bee flew out and buzzed away.</p><br/><p>They looked at each other and simultaneously drew their own weapons from their waists, and from two separate directions, they started closing in on the male who was eating the candied fruits.</p><br/>\n</div>"}