{"title": "Chapter 76: Discovery and Astonishment", "id": 76, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-76-discovery-and-astonishment", "volume_title": "Volume 1", "body": "<h1>Chapter 76: Discovery and Astonishment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 76: Discovery and Astonishment</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>When the two of them rushed to the Suspending Golden Pagoda, they did not see anyone. Instead, their gazes were immediately attracted to something beneath the pagoda.</p><br/><p>A huge stone was tied by a thick metal chain, and a part of that metal chain was snapped off.</p><br/><p>Li Wei had previously trained at the Suspending Golden Pagoda and could figure out the purpose of the metal chain after some slight thinking. He couldn’t help but feel that it was much more brilliant than his method in the past.</p><br/><p>When he had trained at the Suspending Golden Pagoda, he had sustained countless sufferings; but in exchange, he had managed to achieve a body of copper skin and iron bones. There were very few students who managed to reach the state of achieving a body of copper skin and iron bones in the Induction Ground, and due to the quality of his body, he was chosen to be part of the Infantry Division, one of the Thirteen Divisions, much to the surprise of numerous people.</p><br/><p>He couldn’t believe that there was someone who was walking down the same path as him. His interest tremendously increased.</p><br/><p>The Suspending Golden Pagoda was not only one of the most neglected training grounds to the people of Central Pine City, but also to those from the neighbouring cities. It could be said to be almost deserted due to a single reason—training there was simply too unbearable. It was much tougher than the average training, and furthermore, it took a long time to achieve the desired effect, which also made it a test of determination and willpower. There were very little who could endure it.</p><br/><p>Come to think of it, the Infantry Division was similarly not favorably seen upon.</p><br/><p>The Infantry Division was also known as the laborer division. Despite being an elite division like the Infantry Division, the Sky Edge Division was more glorified and was more popular amongst girls. Li Wei was more than envious. The number of students who turned up for the Thirteen Divisions’ yearly recruitment was lesser than those that turned up at the Sky Edge Division’s by a huge margin. In fact, there was even a year where they did not manage to hit the recruitment target, which became a joke that spread throughout the Thirteen Divisions.</p><br/><p>Li Wei’s heart beat faster after he saw the metal chain.</p><br/><p>It would really be a huge benefit for the Infantry Division if he could find a good seedling.</p><br/><p>The metal chain broke…</p><br/><p>Did an accident occur? Li Wei’s heart jumped in alarm.</p><br/><p>At that moment, he heard Mingxiu’s surprised shout. \"It is Junior Ai Hui!\"</p><br/><p>Li Wei looked up and realized that other things were lying near the steps below the pagoda. He hurried over.</p><br/><p>There was a knapsack filled to the brim with yarn and a few threads of yarn scattered on the floor.</p><br/><p>Mingxiu’s face was filled with alarm. When she saw the knapsack filled with yarn, she had a slight feeling that it was Junior Ai Hui, but it was only after checking all the yarn and identifying the logo of the embroidery workshop that she confirmed that it was indeed Junior Ai Hui.</p><br/><p>She had searched for Junior Ai Hui in countless places but to no avail. Mingxiu had not expected Junior Ai Hui to train at the Suspending Golden Pagoda alone as it was such a deserted area.</p><br/><p>She started to feel nervous.</p><br/><p>Junior Ai Hui was definitely not the suspect. She had exchanged hands with the suspect, and the suspect’s base level was much higher than Junior Ai Hui’s. She was worried that the suspect had harmed Junior Ai Hui, especially after seeing the broken metal chain.</p><br/><p>However, there were no traces of blood or a fight.</p><br/><p>Li Wei was more experienced. He gazed around and noticed a small piece of cloth on the ground. He hurriedly picked it up, and said, \"There’s a piece of muslin here!\"</p><br/><p>Mingxiu, who was initially flustered, had slightly calmed down. But when her gaze fell upon the piece of cloth on Li Wei’s hand, she could not stop her body from trembling—she was in a state of disbelief.</p><br/><p>Li Wei noticed Mingxiu’s expression and passed the small piece of cloth to her.</p><br/><p>It was only a small piece of muslin, which was evidently incomplete as it was still connected to two strings of yarn. The muslin was also creased, of inferior quality, and had many uneven parts. If someone produced such a product at the embroidery workshop, she would definitely return it back.</p><br/><p>However, it caused Mingxiu to be very shocked.</p><br/><p>Despite its inferior quality and ugly appearance, it was a piece of elemental cloth that had been weaved with the [Twin Weaving Technique].</p><br/><p>Junior Ai Hui was a novice who did not have any prior experience in embroidery and had spent half a day to thread a single needle, but he could actually produce an elemental cloth after seeing her demonstration just once. How could she not be astonished?</p><br/><p>She had grown up in the embroidery workshop but had never heard of such a thing before, let alone see it happen. The embroidery experts that she had met, including herself, could definitely not achieve such a feat. She clearly remembered that she weaved her first muslin cloth with the [Twin Weaving Technique] only seven months after entering the embroidery workshop.</p><br/><p>She could still remember the admiring and pleased gaze of her teacher.</p><br/><p>But Junior Ai Hui only saw it once….</p><br/><p>Apart from shock, countless doubts started to rise in her mind involuntarily. Since Junior’s base level was so low, how could he manage to use the [Twin Weaving Technique]? Could it be that he saw the demonstration once and understood the [Twin Weaving Technique]? Were there really people with photographic memory in this world?</p><br/><p>She could see that Junior Ai Hui had a difficult time weaving from the creases on the muslin cloth.</p><br/><p>However, this was not a question of how tough it was, but rather of how it was even possible.</p><br/><p>He was able to weave the cloth with just his natal residence opened. If not for the special logo of the embroidery workshop on the cloth, she would have assumed that it was accomplished with the help of others.</p><br/><p>Mingxiu felt that the knowledge she had accumulated over the years from learning weaving had been completely undermined.</p><br/><p>Li Wei saw that Mingxiu was out of sorts, seemingly deep in thought, so he did not disturb her. Instead, he started to survey the surroundings. When his gaze fell on the pagoda’s wall, which was not far away, his pupils suddenly constricted.</p><br/><p>There was a distinct row of dents in the pagoda’s wall.</p><br/><p>He suddenly thought of his previous trip to the pagoda. He had already seen the dents in the wall, but those previous dents were not distinct and weren’t easily noticed by the naked eye. He had only discovered their existence by accident. At that point in time, he had assumed that the dents were caused by a beast, but now, after looking at the row of distinct dents, he realized that they were actually created by a human.</p><br/><p>Someone had been training and had rammed into the wall of the pagoda.</p><br/><p>Looking at the different shapes and magnitudes of the dents, Li Wei made a sudden decision. He approached a dent and turned around, leaning his back against the pagoda’s wall.</p><br/><p>His back and the dent made a good fit.</p><br/><p>Indeed. It was a dent that was created by someone ramming their back into the wall.</p><br/><p>If Li Wei’s emotions could be said to have been stirred after seeing the mental chain a moment ago, then when he now looked at the row of dents, his eyes could be said to be practically emitting rays of light.</p><br/><p>What a ferocious person!</p><br/><p>Other than Li Wei, nobody had a better understanding of how solid the wall of the Suspending Golden Pagoda was. Creating a dent in the wall required a horrifying amount of strength. The different types of killer moves that used the power of one’s back flashed through his mind. Which move was able to produce such power?</p><br/><p>Such tremendous strength also required at least four palaces.</p><br/><p>Also, it was evident that the person was improving—the dents were getting deeper.</p><br/><p>Given Li Wei’s current strength, it would be easy for him to achieve similar strength; but for someone to be training here, it was definitely a student. It was an incredible feat for a student to attain such a standard.</p><br/><p>However, the primary factor that contributed to the spark in Li Wei’s eyes was the method used. This person was a perfect fit for the Infantry Division!</p><br/><p>This won’t do! No matter what, he had to bring that person into the Infantry Division!</p><br/><p>Li Wei had already made the decision in his mind.</p><br/><p>Suddenly, his thoughts returned to the broken metal chain, and his eyelids twitched. Could it be that that fellow was training inside and had met a mishap after the metal chain snapped?</p><br/><p>He decided to rush in to find them. Given his current power, the Suspending Golden Pagoda was no longer a threat.</p><br/><p>However, just when he turned around, he heard a loud bang from the top of the pagoda.</p><br/><p>The two of them started in unison, before subconsciously raising their heads to look for the source.</p><br/><p>Mingxiu recognized Ai Hui at a glance, but the next moment, she became even more shocked.</p><br/><p>More than half of Ai Hui’s clothes were torn, exposing his well-defined muscles. He was carrying someone, whose clothes were in bits and pieces, and the snow-white skin of that person could be seen stained dark red. They streaked across the air, leaving a splatter of fresh blood in their wake.</p><br/><p>Mingxiu’s first thought was that the person on Ai Hui’s back was a woman, but when she saw the face, she couldn’t help but halt in her tracks.</p><br/><p>Hey, isn't that Student Bangwan?</p><br/>\n</div>"}