{"title": "Chapter 85: Reunion", "id": 85, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-85-reunion", "volume_title": "Volume 1", "body": "<h1>Chapter 85: Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85: Reunion</p><br/><p>Translator: Irene Editor: Pranav</p><br/><p>Within an extremely short period of time, several contestants had been attacked and thrown off the stage consecutively.</p><br/><p>Since he had perceived weak elemental energy ripples on the ground’s surface, Ai Hui did not move. He felt that they were familiar, and suddenly, that fellow whom he had defeated in the previous competition came to mind. Could it be a coincidence?</p><br/><p>Ai Hui was a little taken aback, but soon, he became even more surprised by something else.</p><br/><p>Significant progress!</p><br/><p>His opponent’s skills had improved so greatly that it was as if he had become a different person. Compared to the tenderness and immaturity from the past, he was now much more shrewd and ruthless in his attacks.</p><br/><p>But when Ai Hui thought about his own improvement, he immediately felt relieved. He had progressed tremendously, so why couldn’t his opponent do so too? That fellow had a higher aptitude and only used absolute arts—he was definitely from an influential family clan. There was simply no reason for that fellow to improve any slower than himself.</p><br/><p>Ai Hui, who assumed this to be a coincidence, was utterly unaware that the fellow had been searching high and low for him. He had heard about Zu Yan’s written challenge but had no idea that it had something to do with himself.</p><br/><p>After all, Zu Yan had been searching for an earth elementalist!</p><br/><p>He was even more unaware of the hard work Zu Yan had invested in order to defeat him. Ai Hui treated that previous battle as an ordinary one—other than his injuries, there was nothing worth remembering.</p><br/><p>However, Ai Hui was more than glad that they got to meet again.</p><br/><p>Fighting against the same opponent allowed him to measure his own progress.</p><br/><p>Without any warning or hesitation, Ai Hui suddenly dodged to the side.</p><br/><p>Clap!</p><br/><p>A crisp, whip-like explosion sounded out from where he had just stood a moment ago. Like a solid axe, a heavy leg flitted next to Ai Hui’s body, causing a cutting, sharp stream of air to blow past.</p><br/><p>Zu Yan wasn’t alarmed by his miss, but instead, he seemed to enjoy it. When his leg was about to hit the ground, he made a strange, sudden turn and redirected his kick.</p><br/><p>At the same time, Ai Hui struck with his fist.</p><br/><p>Bang!</p><br/><p>A deep, low boom reverberated throughout the whole hall. It was as if two colossal monsters had just collided head-on. Such a wild and violent force was being compressed into a small, tight space.</p><br/><p>The enormous power caused Ai Hui to take two steps back. Zu Yan was the same; he sprung back by five steps.</p><br/><p>During the split second their fist and leg had crossed, Zu Yan’s eyes had lit up. His previous failure was etched into his memory, every single detail unforgotten.</p><br/><p>“You’re here indeed!” he hissed, evidently agitated.</p><br/><p>Ai Hui could feel his opponent’s progress. Not only had his heavy leg become more powerful and concentrated, but it had also become much more formidable and threatening in battle. Moreover, he had definitely gained a lot more combat experience, or he wouldn’t have been able to execute the previous move so naturally.</p><br/><p>This, however, made Ai Hui so excited that his blood boiled.</p><br/><p>Although his opponent had become much more skilled, he, too, had taken a qualitative leap in strength. Previously, he could only dodge that fellow’s leg until he was all battered and exhausted; but this time, he could actually face the attacks head-on without falling into a disadvantageous position.</p><br/><p>As Ai Hui’s battlelust surged, his eyes turned increasingly cold and unfeeling.</p><br/><p>Ai Hui knew that the opponent had recognized him, but he had no intention of reminiscing. He didn’t even say a word—it was as if a ghost had possessed him. He had previously suffered greatly from his opponent’s [Hellfire Spider Web] and had also thoroughly analyzed the incident.</p><br/><p>This was a habit he had developed in the Wilderness. As he had been very weak at the time, it was quite easy for him to lose his life, and the only thing he could do was spend more time reflecting on his fights. Every time he had met a dire beast, he would consult the master elementalists whenever he could and gain information about the monster in exchange for labor. Also, upon seeing that he was a sensible fellow, the master elementalists were usually willing to provide an opinion or two.</p><br/><p>He had never looked down on any enemy, as he had no right to.</p><br/><p>Being cautious and prudent had long been a part of his nature.</p><br/><p>Zu Qiuni opened her eyes wide as she observed the stage. Sweat started pouring out of her body when she heard Brother Yan’s hiss—that fellow in the mask was the mystery expert who had previously defeated Brother Yan!</p><br/><p>Although the others were not aware of this fact, they nevertheless steadily watched on. The interaction between the two parties was very sudden and fierce!</p><br/><p>Ai Hui’s actions immediately calmed Zu Yan down. Seeing his opponent charge towards him, Zu Yan shut his eyes. He was highly focused; every corner of the elevated stage was enveloped by his [Hellfire Spider Web] and within his control.</p><br/><p>A series of rippling waves simultaneously emerged on the web, rushing straight towards him with shocking speed.</p><br/><p>Meeting force with force?</p><br/><p>His opponent did not hide his intention and charged straight towards him. The previous collision must have given him confidence.</p><br/><p>Zu Yan was actually surprised; Ai Hui’s improvement was far beyond his imagination. Although Ai Hui had previously been reduced to a pathetic state because of Zu Yan’s heavy leg, he had now tried to retaliate head-on.</p><br/><p>What a good rival!</p><br/><p>Zu Yan’s eyes were blazing with fire; Ai Hui’s significant progress further fed his battlelust.</p><br/><p>The stronger his competitor was, the stronger he could prove himself to be after claiming victory!</p><br/><p>His concentration level was incomparably high as the undulating spots on the web were reflected clearly in his mind. Akin to a spider who’d found its prey, he kept silent, waiting for the right moment to strike a fatal blow.</p><br/><p>You’re not the only one who improved.</p><br/><p>His eyelids lowered, Zu Yan became one with the web. He felt the world turn silent, while only weak ripples remained. His calm face carried a dash of confidence, which was derived from the endless hard work and training that he had undergone.</p><br/><p>That trick from the previous match no longer had an effect on him.</p><br/><p>It was as if the web was a part of him. After completing the isolated training that was planned for him by his teacher, he could locate his target immediately even in the midst of twenty chaotic ripples.</p><br/><p>Before, he would misjudge as long as there were more than three ripples.</p><br/><p>The quietness and nothingness of the world gradually spread as he accurately identified and captured every single movement in his vicinity.</p><br/><p>That last movement was more violent than those before. His opponent wanted to mislead him by jumping? Zu Yan smirked as he counted the seconds in his mind.</p><br/><p>Now!</p><br/><p>Zu Yan’s eyes suddenly opened as the light exploded.</p><br/><p>Nobody noticed when his right leg, which had been on standby, had suddenly enveloped itself in flames. He sprung up from the ground, revolved his whole body, and drove his right leg—it was as if a heavy axe had been flung upwards.</p><br/><p>All other sounds seemed to have been muted by this leg; the whole place had become silent.</p><br/><p>All the light upstage was absorbed by the Light Absorption Dome, but everyone in the audience was bedazzled and left speechless by this powerful kick. Although there was no sound at all, it made them feel a sense of burning bitterness.</p><br/><p>They couldn’t help but hold their breaths and open their eyes wide for fear that they would miss something.</p><br/><p>Zu Qiuni was astonished; she couldn’t believe her own eyes. Brother Yan had actually executed such a terrifying kick.</p><br/><p>Wasn’t this….wasn’t this the guy who had complained about tough training, showed off in front of girls, and enjoyed making friends?</p><br/><p>Brother Yan was so powerful…this Brother Yan was so different…</p><br/><p>No one could block this kick directly—no one in Central Pine City at least!</p><br/><p>However, the scene that was about the unfold made Zu Qiuni suddenly stand up. Her expression had completely changed.</p><br/><p>“Look out, Brother Yan!”</p><br/>\n</div>"}