{"title": "Chapter 83: Zu Yan And The Young Girl", "id": 83, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-83-zu-yan-and-the-young-girl", "volume_title": "Volume 1", "body": "<h1>Chapter 83: Zu Yan And The Young Girl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 83: Zu Yan And The Young Girl</p><br/><p>Translator: TYZ Editor: Pranav</p><br/><p>\"Actually, you don’t have to care so much about your previous loss.\"</p><br/><p>The young girl continued to comfort the masked young man beside her. When she saw the banners that advertised \"Blind Battle!\" along the streets, she became very excited. The girl was average-looking, and her eyes were flickering, displaying traces of wittiness.</p><br/><p>\"Master had once said that you must pick yourself up from where you had fallen.\"</p><br/><p>The voice that came from behind the mask contained a hint of chilliness; one could sense that the words were being spoken through clenched teeth.</p><br/><p>\"The other party did not respond to your challenge.\" The young girl continued to persuade him, \"The Induction Ground is so big, and there are so many students. If the other party doesn’t reveal himself, how are you going to find him?\"</p><br/><p>\"Master had said that you must pick yourself up from where you had fallen!\"</p><br/><p>The masked youth continued to repeat these words through his gritted teeth.</p><br/><p>The young girl shook her head. Being stubborn was not a good thing. She spread out her hands and asked, \"So are we now going to the training hall that you went to last time?\"</p><br/><p>\"You’re right!\" The masked youth’s eyes were blazing with vigor. \"Master had said that you must pick yourself up from where you had fallen!\"</p><br/><p>The young girl put a hand on her forehead and gave a helpless look.</p><br/><p>He used to be a high-spirited teenager in the past, but look at him now! This only proved a point—be careful when choosing someone as your master!</p><br/><p>Without even taking a glance at the young girl, Zu Yan entered Central Pine City. However, when he stepped onto the street of Central Pine City, he immediately almost went insane.</p><br/><p>Those painful memories seemed to have occurred just yesterday.</p><br/><p>Seclusion, tough trainings—didn’t he do all of them just to prepare for today?</p><br/><p>He had to defeat that fellow this time around!</p><br/><p>Unable to restrain his emotions, Zu Yan clenched his fists tightly. Master had said that you must pick yourself up from where you had fallen!</p><br/><p>\"Aren’t you worried that he won’t be there?\" the young girl asked casually. However, before Zu Yan could reply, she changed the topic and asked, \"Do you know which class Duanmu Huanghun is in?\"</p><br/><p>Although Zu Yan was brooding over his loss, he was still clear about what was going on in his surroundings.</p><br/><p>He suddenly came to a realization. \"I had been wondering why you wanted to follow me. So you’re following me for the sake of Duanmu Huanghun?\"</p><br/><p>\"Of course!\" the young girl replied, filled with confidence. \"If it wasn’t for Duanmu Huanghun, why would I come to this lousy place? Duanmu Huanghun…my new idol…do you know how handsome he is? He’s ten thousand times more handsome than you!\"</p><br/><p>Zu Yan humphed and yelled, \"Childish!\"</p><br/><p>\"Don’t be jealous of him.\" The young girl appeared to be completely smitten. \"Do you know how popular he is? In school, if I shout out for people to come with me to take a look at Duanmu Huanghun, half the girls in the school would follow me! The most important thing is that he’s not taken yet!\"</p><br/><p>Zu Yan ignored her. \"Love-struck fool!\"</p><br/><p>\"Later on, if you can’t find the person you’re looking for, can you accompany me to look for Duanmu Huanghun?\" The young girl grabbed Zu Yan’s elbow and pleaded coquettishly.</p><br/><p>\"No. I will definitely find him.\" Zu Yan shook his head resolutely.</p><br/><p>\"People might be busy. Who will be so free to come here and take part in the blind battle?\" the young girl retorted. However, when she saw Zu Yan’s murderous eyes, she quickly changed her tone. \"Might be! I’m saying that he might be busy, okay?\"</p><br/><p>\"I will definitely find him.\" Zu Yan had a determined look on his face. \"I have a feeling that he’s waiting for me!\"</p><br/><p>\"It’s over, it’s over. This guy is hopeless!\" A look of despair appeared on the young girl’s face.</p><br/><p>\"You don’t understand!\" Zu Yan gave the young girl a look of disdain.</p><br/><p>Zu Yan stopped at a training hall and looked at the familiar words on the banner beside the door. The memories of that day flooded into his mind—his previous loss was still vivid. He clenched his fists and entered the building with a determined expression.</p><br/><p>\"This is the place?\" The young girl understood and quickly entered.</p><br/><p>The moment they entered the training hall, the young girl was overwhelmed by the unceasing cacophony of clamor, but she soon became excited. It was so lively! This place was far more lively than the training hall in her school. No wonder so many people liked to come here.</p><br/><p>Zu Yan steadily walked into the crowd.</p><br/><p>The young girl secretly stuck out her tongue. The moment Brother Yan had arrived at this place, his attitude had changed completely. Right now, his body was surging with a fervor for battle, blazing like an actual fireball. She had never seen Brother Yan behave like this before.</p><br/><p>It appeared that the loss Brother Yan had suffered last time had had an enormous impact on him. In her eyes, Brother Yan used to be no different from most of the younger generation of those aristocratic families. However, after that loss, he seemed to have become another person.</p><br/><p>The current Brother Yan was no longer the same person that she knew.</p><br/><p>She hoped that Brother Yan could find the opponent that had defeated him. She was rather curious about how that person looked like.</p><br/><p>While the young girl was looking around, Zu Yan directly walked towards the employee and said with a deep voice, \"I want to take part in the next round.\"</p><br/><p>After receiving a number tag, Zu Yan turned towards the young girl. \"Find a place and wait.\"</p><br/><p>Zu Yan promptly walked straight to the resting area to mentally and physically prepare himself while he waited for the next round to start.</p><br/><p>The young girl was left dumbfounded, but after a while, she returned to her senses. She stomped after Zu Yan and yelled angrily at him, \"How can you leave me alone like this! You will definitely lose!\"</p><br/><p>\"No. I will win!\" Zu Yan answered back with a resolute tone. \"Master had said that you must pick yourself up from where you had fallen!\"</p><br/><p>\".....\" The young girl was speechless.</p><br/><p>Meanwhile, on the street, Ai Hui walked out of the last training hall and shook his head. \"There’s nothing again.\"</p><br/><p>Lou Lan assured him, \"Ai Hui, don’t panic.\"</p><br/><p>\"I’m not panicking.\" He shook his head again. He wasn’t disappointed with this result; after all, it took more than just luck to find a needle in a haystack.</p><br/><p>\"Ai Hui, what shall we do next?\" Lou Lan asked.</p><br/><p>Next….</p><br/><p>Ai Hui recalled Lou Lan’s anticipative look and immediately felt guilty. Recently, he had been busy with training and had not bothered about Lou Lan at all, but Lou Lan had still put in so much of effort to help clean the training hall. He was such a nice sand puppet.</p><br/><p>\"Lou Lan, do you still remember that training hall?\" Ai Hui suddenly asked.</p><br/><p>\"The one where we won the fight?\" Lou Lan’s eyes lit up. That was the first time he had taken part in a fight. Even though he was at a loss in the beginning, he had eventually managed to help Ai Hui. To Lou Lan, it constituted a beautiful memory.</p><br/><p>\"Yes, that’s the one. That training hall offers more prize money. That time we won fifty thousand yuan, right?\" Ai Hui’s eyes were blazing as he spoke with extreme confidence. \"Since my powers have increased so much, no matter what I have to earn back the money for the biscuits!\"</p><br/><p>\"Okay! Okay!\" Lou Lan cheered.</p><br/><p>Lou Lan thought to himself, \"During this period of time, Lou Lan has not been slacking off. Later, Lou Lan will certainly shock Ai Hui.\"</p><br/><p>Ai Hui clearly knew that the last victory was due to luck. This time around, he wanted to win with his own capability. True power can only be revealed in a real fight.</p><br/><p>The reason why he chose that training hall was that he could bring Lou Lan along.</p><br/><p>Ever since he had promised the girl from the noodle house to search for that person, Ai Hui had become very familiar with the training halls of Central Pine City. Without spending much effort, he was able to easily find that training hall.</p><br/><p>Before Ai Hui opened the door to enter, he put on a mask, turned around, and asked, \"Lou Lan, are you ready?\"</p><br/><p>\"Lou Lan is ready!\" Lou Lan spoke with an indescribable excitement.</p><br/><p>Ai Hui felt rather excited too. Could it be that he had not fought for a long time?</p><br/><p>When he opened the door and entered, a rowdy din blasted him in the face. Ai Hui felt his body become exuberant and his blood boil.</p><br/><p>\"We will take part in the next round!\" Ai Hui said as he walked towards the employee.</p><br/><p>The employee stared at Lou Lan.</p><br/><p>\"He’s my sand puppet!\" Ai Hui yelled with conviction.</p><br/><p>\"Have you come before?\" The employee returned to his senses and handed over a strand of soul-fogging grass. \"Do you know how to use it?\"</p><br/><p>\"We know!\" Without any hesitation, Lou Lan took the soul-fogging grass and put it on his head with peerless confidence.</p><br/><p>On Lou Lan’s head, there was a strand of grass standing by itself, swaying in the wind.</p><br/>\n</div>"}