{"title": "Chapter 80: Gloves and Blood Bandage", "id": 80, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-80-gloves-and-blood-bandage", "volume_title": "Volume 1", "body": "<h1>Chapter 80: Gloves and Blood Bandage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 80: Gloves and Blood Bandage</p><br/><p>Translator: TYZ Editor: Lis</p><br/><p>\"This is something that can’t be helped.\" The old man coughed softly.</p><br/><p>Hearing these words, Ai Hui suddenly felt at ease.</p><br/><p>\"The elemental energy has been compressed to an extreme degree, and once it collapses, your natal residence will be destroyed—this is why we are trying to prevent it from caving in on itself. Or you can treat it as an iceberg that we are trying to melt bit by bit. Since its base level is extremely high, a small portion of the melted energy can be used for a long time. However, the thawing process will not be easy. We’ll have to use certain specialized equipment such as this one. Oh… I can’t remember the name of it.\" The old man had a strange expression.</p><br/><p>\"The elemental energy in your body contains a powerful attractive force that behaves like a magnet. This will be our greatest hurdle as it’s extremely difficult to overcome this kind of attraction. However, if we only need to influence a small portion, then it’s still possible to do so. Have you noticed these rattans? They are able to generate powerful wood elemental energy, and since metal chops wood, the wood elemental energy will induce a strong attractive effect on the metal elemental energy, thereby controlling a small portion of it from the energy mass. This is the portion of metal elemental energy that you will be able to control.\"</p><br/><p>After listening to the old man, Ai Hui vaguely understood what was going on. \"So, we’re using the wood elemental energy as bait? To pull out a portion of metal elemental energy from the mass?\"</p><br/><p>\"Yes! You got it!\" The old man briskly nodded his head. \"Shall we begin then?\"</p><br/><p>Without any hesitation, Ai Hui nodded. \"Okay!\"</p><br/><p>Though the past few days had been enriching, his inability to train made him feel as though something was missing. His life was dedicated to becoming an elementalist, and training had become an inseparable part of it.</p><br/><p>After equipping the copper armor, he placed the massive copper helmet on his head, narrowing his field of vision as the world around him became hushed.</p><br/><p>He could hear his own heartbeats, which were steady and vigorous.</p><br/><p>The rattans on the copper armor lit up on by one, illuminating the courtyard with its bright, enchanting glow.</p><br/><p>The old man’s gaze sharpened, and from time to time, he glanced at the control panel in his hands.</p><br/><p>The elemental energy mass in Ai Hui’s body started channeling, making him uncomfortable. To him, it was like a huge monster living inside his body that was comparatively far too inferior. When the monster was calm and quiet, he did not feel anything; but when it began to get agitated, Ai Hui felt as though his body was going to be ripped apart at any time.</p><br/><p>Lacerations began to appear in his natal residence.</p><br/><p>It was at this moment that Ai Hui realized the terrifying amount of elemental energy in his body. The slightest movement from the mass was enough to inflict injuries on him.</p><br/><p>It was as if Ai Hui was in a stormy sea, undulating along with the choppy tidal waves.</p><br/><p>His world spinning and his vision turning dark, Ai Hui’s consciousness flickered.</p><br/><p>Outside, the old man became anxious as well. The rattans on the copper armor dimmed one by one, and in the blink of an eye, one-third of them were extinguished. With each extinguished rattan, the old man quickly plucked it off.</p><br/><p>\"Persevere!\" he muttered to himself.</p><br/><p>As time passed, the glow of the rattans diminished one at a time, the old man continuing to remove them in succession.</p><br/><p>Half an hour later, when the last rattan dimmed, the old man opened the armor as quick as possible. Boiling steam surged out from within the armor. Ai Hui had already lost his consciousness and his face was pale-white. When the old man pulled Ai Hui out of the armor, the latter’s body was drenched in sweat, looking as if he was being out of a pool of water.</p><br/><p>The old man observed the elemental energy mass in Ai Hui’s body. When the old man saw the elemental energy mass was stabilizing gradually, he then felt at ease.</p><br/><p>When the old man removed the last extinguished rattan, he looked somewhat surprised.</p><br/><p>The ashen green rattan was nondescript without any particular design except that it was soft and smooth, as though it had been polished by sandpaper.</p><br/><p>It was a sword rattan.</p><br/><p>***</p><br/><p>Three days later.</p><br/><p>Ai Hui was playing with the sword rattan.</p><br/><p>After spending one day in a coma, he woke up only to have the old man immediately throw this at him. Sword rattans had a soft texture, yet they were highly durable and resistant to wear. Once polished, they had a pleasing texture. Sword rattans were called so for their use as the material for top-quality sword hilts with natural grips.</p><br/><p>Master said that this was the rattan that suited him the most.</p><br/><p>Ai Hui felt that his fate was tightly linked with swords. So far in his life, there were swordplay manuals, swordsmanship, and a sword embryo. Now there was the addition of a sword rattan. Could it be that he was born to be a swordsman?</p><br/><p>He was playing idly with the sword rattan when he spotted the sudden entrance of his mistress and Senior Mingxiu. He hastily stood up and greeted them, \"Mistress! Senior Mingxiu!\"</p><br/><p>Han Yuqin did not expect Ai Hui to call her Mistress; as such, she could not help but smile. \"Good boy.\"</p><br/><p>The bit of animosity from their previous tiff disappeared into thin air.</p><br/><p>Mingxiu smiled gently at Ai Hui.</p><br/><p>Seeing the old man enter, Han Yuqin’s smile disappeared, and she harrumphed.</p><br/><p>Long used to his wife’s antics, he merely said, \"Have you finished making it?\"</p><br/><p>\"Take it out,\" Han Yuqin ordered Mingxiu.</p><br/><p>Mingxiu took out a pair of ashen green, fingerless gloves and passed them to Ai Hui. \"Junior, try them on. These are the Sword Rattan Gloves that Mistress made without sleep for three days.\"</p><br/><p>Mingxiu</p><br/><p>Only now did Ai Hui notice the the fatigue in Mistress’ face and her bloodshot eyes. \"Thank you, Mistress!\" he said emotionally.</p><br/><p>\"Such a good boy!\" Han Yuqin praised Ai Hui amicably. Following which, her tone changed and she crooned coldly, \"The disciple is so much better than the master; at least he still cares about his mistress, unlike someone who doesn’t concern himself with me!\"</p><br/><p>Slightly embarrassed, the old man coughed softly. \"I didn’t manage to say it in time. Thank you for your hard work.\"</p><br/><p>Han Yuqin uncaringly turned her face away with a humph.</p><br/><p>Just as Ai Hui was about to put on the gloves, he was stopped by Han Yuqin. \"Wait, put on this bandage first!\"</p><br/><p>\"Bandage?\" Ai Hui was stunned.</p><br/><p>Han Yuqin took out an archaic bronze box and passed it to Ai Hui.</p><br/><p>When the old man saw the bronze box, his eyes widened. \"That piece of blood-refined cloth?\"</p><br/><p>Han Yuqin gave a soft sound of acknowledgement, but her face was covered by an unconcealable smirk.</p><br/><p>Ai Hui opened the bronze box, releasing a bolt of killer intent that slammed into his face. The scent of blood overwhelmed him, but upon a second sniff, it had disappeared, as if the smell from earlier had been a hallucination. The cloth was obviously an antique, but the blood stains appeared to have dried up not too long ago.</p><br/><p>\"I incidentally came across this piece of blood-refined cloth in the past. It should be an artifact from the Cultivation Era. I don’t know which blood sect it belongs to; it is certainly not an orthodox artifact. However, even after thousands of years, it has not rotted, proving it to be a good item. I’m unsure whose blood is on the cloth, but it exudes a strong killer intent. It’s too demonic for me or Mingxiu to use; as such, we have never touched it.</p><br/><p>\"Your master hasn’t given you a single welcome gift since accepting you as a disciple. I have cut this piece of blood-refined cloth into two, making them two pieces of bandaging. While they’re not suitable for treating wounds, they are useful for protection, especially since your body is weak. With these two Blood Bandages, it will be very difficult for any weapon to harm you. They can help you withstand a portion of any attack, preventing your body from giving way or collapsing. Later, Mingxiu will teach you how to wrap the bandage,\" Han Yuqin explained with a gentle voice.</p><br/><p>A wide grin appeared on the old man’s face and he yelled, \"What are you waiting for? Quickly thank your mistress!\"</p><br/><p>Ai Hui was touched and gave a sincere bow. \"Thank you, Mistress!\"</p><br/><p>An unfamiliar feeling of warmth, like sunlight, shined upon him.</p><br/>\n</div>"}