{"title": "Chapter 97: Embroidery Genius", "id": 97, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-97-embroidery-genius", "volume_title": "Volume 1", "body": "<h1>Chapter 97: Embroidery Genius</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 97: Embroidery Genius</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>The workshop was filled with rising mist. Ai Hui, who was wrapped with the Blood Bandage, was fully focused. His actions were extremely slow—slow to the point that it was unable to detect his movements with the naked eye. However, his body had seamless coordination, as if he was a statue of a mummy that exuded strength and beauty.</p><br/><p>The silk was as fine as hair. It was wrapped around the tip of his finger while the other end was immersed in the hot boiler.</p><br/><p>Behind Ai Hui was a chunk of completed silk. However, the mist kept rising, and the old man couldn’t discern it clearly. But judging from the number of bundles, it was definitely of considerable length.</p><br/><p>What the old man’s eye could see was that its length was already more than three meters.</p><br/><p>The old man swallowed hard. With a heart filled with anticipation, he lowered his voice and asked, \"How long is it?\"</p><br/><p>\"No idea.\" Han Yuqin did not spare him a glance. Her gaze was filled with passion as her gaze never left Ai Hui.</p><br/><p>Embroidery genius!</p><br/><p>If anyone were to tell her now that Ai Hui was not an embroidery genius, she would use the word \"Master\" and bash that person’s face till it was filled with blood without a second thought. Even if it were the old man who dared to argue—she would still bash his face!</p><br/><p>How difficult was it to create Twilight Silk? Even Han Yuqin did not wish to torment herself with this problem. It was a time-consuming, arduous, and thankless task. Ai Hui the novice, who had just opened his natal residence, could actually extract such a long strand of silk. If this wasn’t considered a genius, then what was?</p><br/><p>Both comprehending the [Twin Weaving Technique] and extracting Twilight Silk were not things a newcomer who had just opened his natal residence could achieve.</p><br/><p>Han Yuqin’s primary motive for Ai Hui to try his hand in peeling the silk cocoons was to use it as a form of training. From the start, she did not think that Ai Hui would be able to extract Twilight Silk that was of value.</p><br/><p>However, Ai Hui had done it.</p><br/><p>She did not know how Ai Hui had managed to do it, just like how she didn’t know how he had managed to comprehend the [Twin Weaving Technique].</p><br/><p>She spared the old man a glance. Alright, while the old man was so-so in other aspects, his taste in choosing a disciple was good! She should think of ways to pry Ai Hui over from the old man’s hand. This wasn’t the time to talk about the relationship between a husband and wife—they could not waste the young chap’s talent.</p><br/><p>The old man was still relatively easy to appease—she just needed to weep and act coquettishly. With that, she presumed that the old man would find it hard to escape from her clutches. Ai Hui, however, would be more difficult.</p><br/><p>What a headache. Hmph. It was all the old man’s fault! He had taken a disciple, but he was such a difficult chap! This pair of old and young had no good points to them!</p><br/><p>The old man did not notice that his partner was looking at him weirdly. He suddenly thought of Ai Hui’s disappearance over the past few days and reacted with a face of shock. \"He was here for the past few days?\"</p><br/><p>\"If not here, then where else would he be? Do you look down on my workshop so much?\" The old lady narrowed her eyes; she was ready to counter-attack.</p><br/><p>The old man had abundant experience in such debates, and he immediately praised the old woman. \"How could I? Your workshop must be a gem of feng shui, or else how could this chap have such fast improvements? The credit must go to you!\"</p><br/><p>The old woman saw that the old man was not caught in her trap and said unwillingly, \"I saw that Xiao Hui was rather interested in embroidery. Otherwise, he would not stay as well.\"</p><br/><p>The old man gave a silent cheer and continued with a poised expression, \"Everything is dependent on his interests. Embroidery is a respectable profession, and the money flow is very large. Back then, I was supportive of your profession as well.\"</p><br/><p>The old man said these sentences smoothly, and old woman could only glare at him.</p><br/><p>Wang Shouchuan was secretly pleased. Over this period, he had had many in-depth discussions with Ai Hui over training. He had already made out that Ai Hui belonged to actual combat. Ai Hui’s interest towards those theories was not because he liked the theories of elemental energy—it was because understanding these principles would benefit his training. Once he understood the principle, Ai Hui’s next move was always to think of how to use those special traits in battle.</p><br/><p>This chap was simply too shocking.</p><br/><p>Wang Shouchuan had finally become clear of something, and that was that Ai Hui’s learning about elemental energy and training revolved around a common theme: how to achieve success in battle.</p><br/><p>To tell the truth, the idealistic Wang Shouchuan did not really like the fact that his disciple had such a purpose to learning, but he could only sigh when he thought of what Ai Hui had been through.</p><br/><p>As such, he was confident that Ai Hui would not make embroidery his own profession. Ai Hui would learn embroidery for the sake of earning money and to enrich himself. Ai Hui would also learn embroidery to create outstanding equipment, but he would definitely not be like his own partner and view embroidery as his own life.</p><br/><p>Wang Shouchuan was extremely clear on this point. As such, he was not concerned over his partner’s thoughts.</p><br/><p>Suddenly, Wang Shouchuan noticed Ai Hui’s position and became surprised. \"Was he always in this position?\"</p><br/><p>Ai Hui’s position was very unique. His left leg was in front while his right leg was at the back, forming a bow-like stance. His left hand was clenched around his waist, and his right arm was stretched straight, while his forefinger and middle finger were pinched together like a sword.</p><br/><p>Wang Shouchuan was a knowledgeable teacher. At one glance, he could see that Ai Hui was using his hand as an invisible sword.</p><br/><p>Using the hand as an invisible sword was a common technique used by ancient swordsmen. However, there was no swordsman now, and thus, it was seldom seen. While elementalists would also use swords and some form of swordplay, it was completely different to that of ancient swordsmen.</p><br/><p>\"Nope, he hasn’t moved.\" Only then did Han Yuqin realize that Ai Hui was in a unique posture, and she couldn’t help but ask, \"Is there any reasoning behind this posture?\"</p><br/><p>The five residences and eight palaces did not have a history of thousands of years, and the existence of embroidery was even shorter. As for extracting silk, it was even more unknown, and there weren’t any mature and established techniques. Everyone practiced a myriad of techniques.</p><br/><p>But Han Yuqin knew her man well. The old man had definitely observed something, and she had the utmost faith in his scholarly knowledge. It was because of this essential point that led to her falling into his clutches when they were young. She really was young and naive then.</p><br/><p>\"Invisible sword.\" The old man explained, \"Sword training in the past made use of this invisible sword technique when they are expediting their spiritual sword.\"</p><br/><p>Han Yuqin paused for a moment. She would not have thought that it was actually an ancient and unfamiliar technique like the invisible sword.</p><br/><p>\"Could the invisible sword technique still be used now?\"</p><br/><p>\"It would be useless to others, but it might not be totally useless to this chap.\" The old man’s tone was laced with smugness.</p><br/><p>Mingxiu, who was at the side, suddenly said, \"Master and Uncle-Master, Junior has finished!\"</p><br/><p>The two of them hurriedly looked over. Indeed, Ai Hui, who was in the workshop, had stood up and was rotating his shoulder.</p><br/><p>The three of them rushed in.</p><br/><p>The door to the workshop was suddenly slammed open and Ai Hui, who was exercising his limbs, jumped in shock. But he soon recognized the intruders and quickly greeted, \"Teacher, Mistress, Senior Mingxiu.\"</p><br/><p>After maintaining the same posture for a few days, Ai Hui was experiencing an indescribable ache. The profit from the Twilight Silk was indeed hard-earned. He wondered the extent of aches for those who had to extract the silk continuously for over ten days.</p><br/><p>With an appreciative expression, the old man said, \"Not bad, your improvement is drastic.\"</p><br/><p>Han Yuqin picked up the Twilight Silk and gently shook it. Her gaze was accurate as she immediately concluded, \"About ten meters.\"</p><br/><p>Ai Hui’s spirit suddenly rose. He clearly remembered that a ten-meter-long strand of Twilight Silk was worth two hundred thousand yuan.</p><br/><p>There was a flicker of astonishment in Mingxiu’s gaze, \"This isn’t quite right. Junior managed to extract ten meters of Twilight Silk in just three days and three nights.\"</p><br/><p>Han Yuqin caught the reminder and reacted. To extract ten meters in three days and three nights suggested that he would have extracted slightly more than three meters worth of Twilight Silk daily. Han Yuqin had conducted her business with a few elementalists who extracted Twilight Silk, and their fastest speed was only two meters in one whole day.</p><br/><p>If Ai Hui’s statistics were indeed accurate, it implied that there was a fifty percent increase in efficiency. For any business, it would be considered a remarkable feat.</p><br/><p>Embroidery genius!</p><br/><p>It was as if those two words floated in front of Han Yuqin, dazzling and shining in gold.</p><br/><p>Her gaze towards Ai Hui suddenly became very passionate.</p><br/>\n</div>"}