{"title": "Chapter 99: That Expression", "id": 99, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-99-that-expression", "volume_title": "Volume 1", "body": "<h1>Chapter 99: That Expression</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 99: That Expression</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>Hai Qing was standing respectfully outside the grass hut.</p><br/><p>The fence was built with dried branches, and it carried an atmosphere that seemed to ward people away. The shadow cast when the sun shone upon the hut always captured Hai Qing’s attention. The fence had been weaved personally by his master, who, at his cultivation level, had a profound understanding towards elemental energy. Each and every one of his movements contained deep significance.</p><br/><p>The obscure grass hut was built by his master from scratch.</p><br/><p>Hai Qing couldn’t help but feel respectful every time he saw the grass hut.</p><br/><p>Forty years ago, he followed his master to a barren land in the Wilderness after leaving the Avalon of Five Elements. His master had pointed at the barren ground, saying that it would be his new home and that he was going to build a grass hut at that very spot.</p><br/><p>That year, his master, who was still not considered a grandmaster, had picked up the first dried twig, threw out the first seed, and shoveled the first shovel of earth.</p><br/><p>For a solid five years, Master had only done that. Sometimes, he would be lost in thought while sitting on the cliff like a statue, regardless of the weather. At times, he would wander far away to find a suitable dried twig. He would also use his hands as a shovel. His master then was slightly deranged and was as dirty as a beggar.</p><br/><p>Hai Qing would never forget the day the grass hut was completed.</p><br/><p>At that point, Master had hung a piece of grass curtain at the grass hut’s entrance. He had then suddenly turned around and told Hai Qing with a clear gaze, \"Hai Qing, I am a grandmaster now.\"</p><br/><p>While Hai Qing was still caught off guard, the wood elemental energy had erupted like a volcano.</p><br/><p>Countless of sprouts had emerged from the barren, deserted hill. The glaring sun was also replaced by dark clouds and drizzle. Grass started to grow and rapidly fill up the initially bare and tan mountain peak.</p><br/><p>Amidst the drizzle, trees began to grow, and flowers started to bloom as if it were spring. A ray of sunlight penetrated through the dense clouds and enveloped the grass hut. Under the warm glow of the sunlight, the grass hut was not affected by the drizzle in the slightest.</p><br/><p>At that time, Hai Qing could not control his body and had kneeled down in respect.</p><br/><p>The initial barren mountain had become a formidable sea of green.</p><br/><p>The grass curtain was thin, and he could vaguely make out that Master was trimming and watering the plants. His actions were smooth and leisurely, and watching him warmed Hai Qing’s heart.</p><br/><p>\"Huanghun came out of the Grass Hollow so quickly?\"</p><br/><p>A voice that was as warm as jade yet without any trace of liveliness came from the back of the grass curtain.</p><br/><p>\"Yes.\" Hai Qing was also surprised. \"When I had seen Huanghun’s injuries due to the metal wind, I thought he would need a period of time to recover. I didn’t expect him to come out of the Grass Hollow so quickly.\" Hai Qing continued respectfully, \"Throughout my entire life, his innate talent is one of the best—even better than Big Chen and Mingqiu. The only person who can defeat him is probably Master. What is even rarer is that he has a competitive temperament. He is the most competitive amongst the three of them. Big Chen’s character is too mild while Mingqiu is slightly playful.\"</p><br/><p>Dai Gang laughed lightly. \"Looks like the Duanmu family produced a mythical being, to be able to receive such high praise from our Hai Qing.\"</p><br/><p>Hai Qing replied courteously, \"Huanghun insisted on going back to the Induction Ground. Hai Qing will get someone to send him back.\"</p><br/><p>Dai Gang replied gently, \"Indeed, he should go back. At this age, the Induction Ground is the most suitable place for him. It could be a period of wonderful memories for him in the future as well.\"</p><br/><p>\"Yes.\" Hai Qing’s tone remained respectful as he continued, \"The Duanmu Family's belongings have arrived.\"</p><br/><p>\"Put it aside first. The stone is finally going to bloom.\" Dai Gang’s voice was as warm as spring.</p><br/><p>Hai Qing couldn’t help but expose a hint of pleasure on his face. \"Congratulations, Master.\"</p><br/><p>...</p><br/><p>In Central Pine City, Duanmu Huanghun was standing hesitantly at the mouth of the alley, feeling extremely vexed. How did he manage to owe a favor to that scoundrel? Whenever he thought of it, he felt agitated to the point that he felt like killing someone.</p><br/><p>He even made a trip to Instructor Li Wei to clarify the situation.</p><br/><p>At that point, he was still puzzled over Instructor Li Wei’s peculiar gaze towards him. However, after hearing the entire story, he had turned green.</p><br/><p>He was lying on Ai Hui’s back?</p><br/><p>And their clothes were shattered?</p><br/><p>He stared at Li Wei unwaveringly for a full five to six minutes, eventually giving him goosebumps.</p><br/><p>Duanmu Huanghun stood at the mouth of the alley, hesitating for a long period of time. His mind was a mess. His pride prevented him from pretending that nothing had happened. Hai Qing had even told him that the longer he stayed in the Suspending Golden Pagoda, the harder it would have been to rescue him. Although it was not life-threatening, it would have brought about long-term harm to his body.</p><br/><p>He clearly remembered how he had run to the Suspending Golden Pagoda.</p><br/><p>But damn it!</p><br/><p>Why was it the scoundrel who saved him?</p><br/><p>He could accept it if anyone from the Induction Ground had saved him—but not Ai Hui.</p><br/><p>Damn it!</p><br/><p>He had been looking for an opportunity to bash that fellow up, but how could he bear to do that now? That damned fellow! Ai Hui must be very pleased now, thinking that he was a big joke.</p><br/><p>\"Isn’t this Student Bangwan?\"</p><br/><p>A familiar voice that was like a nightmare suddenly rang out from behind him. Duanmu Huanghun was like a cat whose tail had gotten stepped on, and he almost jumped out in shock.</p><br/><p>Duanmu Huanghun, who was still in a panicked state, pretended to be calm as he turned around. Looking at that hateful face, he lifted his chin and asked haughtily, \"Oh it’s you. Why are you looking for me?\"</p><br/><p>\"Looking for you?\" Ai Hui exaggeratedly looked around. \"Hearing you say this, I thought I walked into the wrong alley for a moment. But nope, Student Bangwan is indeed unique. You are here at my house, but you're asking me why I’m looking for you?\"</p><br/><p>It was only then that Duanmu Huang reacted. His face was burning, and he couldn’t wait to dig a hole and hide. How could he make such a basic mistake?</p><br/><p>Ai Hui was not planning on letting him off. He finally managed to get hold of Duanmu Huanghun with much difficulty. How could he let him leave before tormenting him?</p><br/><p>\"Seems like Student Bangwan did not forget that he’s indebted to me. Okay, just say it. How are you planning to repay me?\" Ai Hui did not waste any time and got straight to the point. \"We have to make things clear. The first is when I rescued you from the Suspending Golden Pagoda. And the second would be the compensation for my injuries.\"</p><br/><p>Where did Duanmu Huanghun hear of such a compensation request before?</p><br/><p>That’s right! It was this expression!</p><br/><p>He was even more disgusted now. \"You are indeed not a good person!\"</p><br/><p>\"Not a good person? How can you say this to your savior?\" Ai Hui laughed coldly and displayed some impatience. \"Of course, that isn't important. I want something more practical, Student Bangwan.\"</p><br/><p>Duanmu Huanghun had finally regained his composure, and he said gravely, \"I owe you a favor. No matter what and when, as long as you need me to fulfill it, I will do my best.\"</p><br/><p>Duanmu Huanghun gave an inward sigh of relief after making that serious promise. Although he felt that Ai Hui was loathsome, he was indeed saved by Ai Hui. His pride did not allow him to repay Ai Hui half-heartedly.</p><br/><p>He would only have a clear conscience by making such a promise that was worth millions.</p><br/><p>His expression was proud but dignified. This was a promise to himself.</p><br/><p>\"Just like this?\"</p><br/><p>Ai Hui stared at Duanmu Huanghun dumbly, as if he had seen a ghost.</p><br/><p>Duanmu Huanghun, who was initially calm, became flustered and somewhat guilty under the scrutiny of Ai Hui’s gaze. He unconsciously blurted out, \"Then….then two favors?\"</p><br/>\n</div>"}