{"title": "Chapter 98: Bold And Imaginative", "id": 98, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-98-bold-and-imaginative", "volume_title": "Volume 1", "body": "<h1>Chapter 98: Bold And Imaginative</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 98: Bold And Imaginative</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>Ai Hui’s body was still filled with aches. The last time he was in such a sorry state was when he had been in the Wilderness. At that time, the troops were under attack, and he had gotten separated; however, based on his capability at that time, being alone in the Wilderness was only a road to disaster. His only option was to wait at the exact same spot, as that was also where the troop would get their replenishments.</p><br/><p>In order to reunite with the troops, he had covered himself in mud and had lain in the sludge without moving.</p><br/><p>Well, at that time, too, it had been three days and three nights.</p><br/><p>In the depths of the night after three long days, his body was drenched in perspiration</p><br/><p>Ai Hui silently wiped his beads of perspiration, and soon, his aches also started to quickly subside. A trace of joy flickered in his eyes, reflecting a confirmation of some ideas in his mind.</p><br/><p>\"Disciple, you used the invisible sword technique, right?\" The old man was evidently very curious. \"How did you think of using that? What was the reasoning?\"</p><br/><p>Han Yuqin and Mingxiu’s gaze turned towards him as they were filled with curiosity too.</p><br/><p>\"Yes, Teacher, that was the invisible sword technique.\" Ai Hui was already used to the old man’s questions which were usually asked in rapid succession. The old man has displayed this trait more than once throughout those previous days of discussions.</p><br/><p>Ai Hui organized his flow of thoughts before beginning to elaborate. \"During the discussion with Teacher a few days ago, Disciple suddenly thought of the fact that the Twilight Silk needed the full concentration of the elemental energy. This process is very similar to the thrusting of a sword. It’s just that this sword would be the elemental energy and it would be thrusted out at a slow and uniform speed.\"</p><br/><p>The old man muttered to himself, \"Seems reasonable.\"</p><br/><p>Ai Hui continued, \"Disciple thought whether there were any slow swords during sword training in the past? And how did they control the speed of the sword? Disciple recalled looking through the swordplay manuals and discovering the existence of the slow sword.\"</p><br/><p>\"Slow sword? What use does it have if the sword is slow?\" Han Yuqin blurted with a face of confusion.</p><br/><p>At present, movements and attacks were all about speed, and this was understandable, as one would not be easily defeated if they were fast. Moves or traditions that pursued slow speeds had never been heard of.</p><br/><p>\"To say it precisely, the so-called slow sword is not seeking to be slow, but instead, it is to not be fast. If you want to hasten the process, you would not be able to achieve it. The ancient swordsmen pursued to do it steadily and achieve a better result.\" Ai Hui was like another person when he started to talk about the topic of swordsmanship. He continued composedly and smoothly, \"So, the supposed ‘slow’ is relative but not absolute. For example, during a storm, their sword moves would be the wind. The wind would gather unceasingly which resulted in the storm. No matter how fast the speed of the wind was, its power would not be comparable to a storm. Is it that the faster the wind, the better it is to form a storm? It is not the case. In order to create a storm, you need a particular type of wind, and it is not that the faster the speed, the better it is.\"</p><br/><p>The advantage of discussing with Teacher was that Ai Hui was getting better at explaining his complicated viewpoints in simpler terms.</p><br/><p>Mingxiu’s eyes flashed. \"I understand now. The slow sword that Junior is talking about is very similar to extracting the Twilight Silk. While slow elemental energy is needed to extract the Twilight Silk, in reality, it is not about being as slow as possible but instead the uniformity. The emphasis on being slow for extracting silk was to actually control the even distribution of the elemental energy in a better manner. How did Junior solve the problem of uniform velocity?\"</p><br/><p>Wang Shouchuan and Han Yuqin also nodded.</p><br/><p>\"Senior is so clever!\" Ai Hui praised Mingxiu. Presently, Ai Hui seemed to be emitting a dazzling glow which was blinding to the eyes. His usual reserved gaze was now as bright as the stars at night. \"I referenced many similar swordplay manuals and discovered an unusual phenomenon. Almost all of the styles that were similar to the slow sword made use of a spiral. The styles were enlightened by how storms and whirlpools worked. After that, I discovered that when elemental energy was employed in the form of a spiral, it did not increase the speed, but instead, it caused it to lose a part of its initial speed. However, its stability increased, and the elemental energy became more concentrated and did not disperse.\"</p><br/><p>Everyone in the embroidery workshop was shocked into silence.</p><br/><p>After a moment, Ai Hui started to feel slightly uncomfortable, and he broke the silence by asking, \"Did I say something wrong?\"</p><br/><p>Han Yuqin suddenly asked, \"You thought of all of this by yourself?\"</p><br/><p>\"Yes.\" Ai Hui felt somewhat embarrassed. \"Disciple was just guessing.\"</p><br/><p>Han Yuqin ignored him and immediately turned to the old man and shouted, \"He is an embroidery genius! We should not neglect his talent!\"</p><br/><p>The old man corrected, \"He is a genius in training!\"</p><br/><p>Wang Shouchuan had always felt that it was a pity that his disciple had a slower start. However, now, he was glad that he had started late. If Ai Hui had been exposed to training and had become familiar with the five residences and eight palaces when he was young, would he still have such unorthodox, bold, and imaginative ideas?</p><br/><p>Ai Hui’s diligence and determination had given him a formidable body, while his ideas that were not confined to restrictions gave him an additional pair of wings.</p><br/><p>Wang Shouchuan did not know the extent of Ai Hui’s future success.</p><br/><p>It was as if he saw a towering and formidable figure enveloping the sky of the future.</p><br/><p>\"Exactly, embroidery can be used in training and also in combat!\" exclaimed the old lady.</p><br/><p>\"Embroidery Grandmaster, do you think you have enough fighting capabilities?\"</p><br/><p>\"Wang Shouchuan! What do you mean? Do you want to fight? I will let you make a move first!\"</p><br/><p>\"You are too boring. Look at our juniors; they are watching us make fools of ourselves. You can bash me up after my discussion with Ai Hui. I still have a few doubts to clarify...\"</p><br/><p>Looking at the couple, who were both flushed with anger, Ai Hui was flabbergasted. He asked uncertainly, \"I…..I have a question.\"</p><br/><p>The two of them immediately stopped and turned to face Ai Hui.</p><br/><p>Ai Hui waved the Twilight Silk in his arms and asked weakly, \"Can this be sold for money?\"</p><br/><p>The couple spoke in unison. \"Money?\"</p><br/><p>Ai Hui eyes widened, \"Don’t tell me you were lying when you said this can be sold for two hundred thousand yuan?\"</p><br/><p>\"...\"</p><br/><p>The two of them suddenly stopped quarreling.</p><br/><p>In the end, Ai Hui managed to get one hundred thousand yuan as his wages. After all, the venue and the materials used had belonged to the embroidery workshop. Ai Hui was more than happy. To be able to earn one hundred thousand yuan in just three days and three nights! Although it was hard-earned money, it was still not a small amount. And he was confident that he would be able to extract an even longer strand of silk the next time.</p><br/><p>Most importantly, he had finally obtained a steady source of income.</p><br/><p>He had turned to his mistress and asked if extracting silk was a form of craftsmanship.</p><br/><p>Mistress’s expression had not been very pleasant, and she had reluctantly nodded her head. Mistress had even warned him that in the embroidery workshop, extracting silk was only considered a minor task and it was not something grand.</p><br/><p>As long as it made money, Ai Hui did not care if it was grand or not. Just wait till he could extract fifty meters worth of Twilight Silk. Hmph. He would throw out two strands of silk and hire the little girl from the noodle shop. She could learn to cook noodles from the boss of the noodles shop and then she would be able to serve him over ten bowls of noodles a day.</p><br/><p>He would be able to get Lou Lan to simmer soup for him daily and also prepare lots of elemental energy food for him.</p><br/><p>His mouth started watering. Ai Hui had the sudden urge to splurge. Should he get Lou Lan to boil a pot of soup today?</p><br/><p>With this thought, Ai Hui started to increase his pace.</p><br/><p>At the mouth of the alley, he suddenly stopped in his tracks. He looked at the silhouette of the figure near the mouth of the alley in surprise.</p><br/><p>Hey, wasn’t that Student Bangwan?</p><br/><p>Heh heh! There are escape routes in heaven, but you refused to walk through them! There are no doors in hell, but here you are!</p><br/><p>Ai Hui’s expression turned cold and murderous.</p><br/>\n</div>"}