{"title": "Chapter 92: Experience", "id": 92, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-92-experience", "volume_title": "Volume 1", "body": "<h1>Chapter 92: Experience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 92: Experience</p><br/><p>Translator: Irene Editor: Pranav</p><br/><p>Ai Hui sat on the ground of the workshop, gasping heavily.</p><br/><p>The rising fog carried a herbal medicinal odor as it squirted out from the window from time to time. The workshop was like a monster, spewing poisonous gas at random intervals.</p><br/><p>The embroidery ladies didn’t dare to go close and rather took more steps to walk around it instead. Many of them had come to a sudden realization—no wonder the workshop never produced any Twilight Silk. But there were still bolder ladies who stole glances at Ai Hui from afar.</p><br/><p>It was seriously hot inside the workshop, and Ai Hui was working half-naked, displaying his well-proportioned, robust, and fit body. His skin was emitting a golden glow as if he’d been smeared with a layer of grease. The steam within the workshop carried an unpleasant odor, which prevented the women from approaching—but it did not stop them from admiring from a distance.</p><br/><p>Ai Hui wasn’t aware that people were secretly watching him. All his focus was placed on that damned Twilight Silk.</p><br/><p>So far, the silk that he had extracted had never exceeded one meter in length.</p><br/><p>The elemental energy within his body was abnormally smooth and fast like lightning. It was easy to make it quick; with just a thought, his elemental energy would gain speed. To slow it down, however, was exponentially harder. Moreover, not only did he have to slow it down, he had to ensure that it had a uniform velocity, free from fluctuations.</p><br/><p>Ai Hui had been thinking about a lot of things these past few days.</p><br/><p>What he pondered most about was the fact that although the elemental energy within his body was pure, it was very different from the energy that he developed himself. He could induce elemental energy with help from the Sword Rattan Gloves, but he could only exercise simple control over it.</p><br/><p>The elemental energy he had developed through self-training wasn’t as pure and was little in quantity, but it could easily be controlled and engaged during more complicated operations.</p><br/><p>Ai Hui had gotten out of the excitement from his previous victory and had become much more clear-minded.</p><br/><p>No matter how much strength he had, it was useless if it was untamed. And on the contrary, no matter how little strength he had, it could still be used during crucial moments as long as he had perfect control over it.</p><br/><p>Slow and steady should be the way to go, Ai Hui told himself.</p><br/><p>The nature of a three minute hero was no different from the sword embryo. What he needed was reliable strength. Reliable strength and reliable abilities.</p><br/><p>“How is it, Junior?” Mingxiu walked into the workshop.</p><br/><p>Ai Hui stood up. “Not bad, Senior. It’s actually quite rewarding.”</p><br/><p>Mingxiu was slightly surprised. She expected her junior to be somewhat dispirited, but he actually had a very optimistic attitude. She observed attentively and caught no signs of disappointment in Ai Hui’s expression.</p><br/><p>But then again, her junior had attempted the [Twin Weaving Technique] just after activating his natal residence, so why would he be discouraged by the difficulty of the Twilight Silk?</p><br/><p>“That’s good. Don’t be anxious, Junior, try slowly.” Mingxiu consoled him, “Twilight Silk is so expensive precisely because it is very challenging to extract.”</p><br/><p>On hearing the word “expensive,” light flashed within Ai Hui’s eyes, but the words behind captured his attention even more. “Senior, are you saying that the raw material isn’t expensive?”</p><br/><p>Mingxiu nodded. “It is inexpensive. A silkworm cocoon costs about two hundred thousand yuan now.”</p><br/><p>Ai Hui opened his eyes wide. “Two hundred thousand isn’t considered expensive?”</p><br/><p>Mingxiu laughed briefly. “Indeed, it is considered inexpensive. An elemental cloth costs fifty thousand yuan.”</p><br/><p>“What about Twilight Silk?” Ai Hui asked, unable to believe what he was hearing.</p><br/><p>“Depends on its specifications.” After taking a few moments to remember, she said, “Anything below five meters isn’t worth much. Ten meters or so can be bought at two hundred thousand. The price doubles every five meters.”</p><br/><p>Ai Hui gulped. A Twilight Silk silkworm cocoon looked small but the silk within was extremely fine. Theoretically, it was possible to extract over a hundred meters of silk.</p><br/><p>How much money is that!</p><br/><p>Twenty meters for eight hundred thousand yuan. Thirty meters for three million and two hundred thousand yuan. Forty meters for twelve million and eight hundred thousand yuan! And fifty meters would cost over fifty million yuan!</p><br/><p>Come to think of it, the noodle shop girl’s eighty million yuan…it could be paid off with just two fifty-meter-long strands of Twilight Silk and there would still be a lot to spare!</p><br/><p>He was about to drool.</p><br/><p>Ai Hui felt resentful. Why was it that whenever the topic of embroidery came up, it always involved a lot of money?</p><br/><p>But from his previous experience with the [Twin Weaving Technique], Ai Hui was aware that while money from embroidery seemed to be plenty, it was actually extremely challenging to earn.</p><br/><p>Ai Hui had calculated the Twilight Silk’s best solidifying speed. One day and one night for a length of about two meters. There was no mistake.</p><br/><p>Twilight Silk of fifty meters required twenty-five consecutive days of operating elemental energy non-stop at a consistent speed, without even the slightest error.</p><br/><p>This was not only incredibly challenging, but it was also terrifying. Not to mention the elemental energy, just maintaining focus for twenty-five days straight was almost impossible.</p><br/><p>Anything below five meters wasn’t worth much money, yet Ai Hui already had trouble in producing five meters.</p><br/><p>Wow, money isn’t easy to earn!</p><br/><p>As if she’d noticed Ai Hui’s dejected expression, Mingxiu comforted him. “Don’t be discouraged, Junior. Manufacturing Twilight Silk is bitter work; even those who are able to aren’t willing to do it too. Thirty-meter-long Twilight Silk can’t be easily found in today’s market. Plus, you’re doing this to train. When your skills improve, spinning silk will become second nature to you.”</p><br/><p>Ai Hui regained his spirit; although he had failed to spin silk, it was still a pretty effective training method.</p><br/><p>Silk spinning forced the operation of elemental energy to slow down. Having such pure elemental energy circulating at such a slow speed within his body was intensely stimulating.</p><br/><p>In the past, whenever his elemental energy circulation would reach his hand palace, it would feel no different from any other parts of his body. Now, however, he could feel that a region of his palm was more sensitive to the energy.</p><br/><p>He knew that this region, which felt more sensitive and intense, was his hand palace.</p><br/><p>Elemental energy within Ai Hui’s body had never operated so slowly before. Over the past few days, he had been immersed in many fresh experiences; for example, he had recently found out that operating his elemental energy slowly had a body tempering effect.</p><br/><p>The world was so big—Ai Hui always carried an inquisitive attitude towards many things.</p><br/><p>Seeing the improvement in Ai Hui’s mood, Mingxiu advised him, “Go home and rest for a few days. You need to strike a balance between work and rest; alternating between tension and relaxation is the key to training. You’ve been without rest for a few days, and it’s detrimental to your body. Go back. I’ll tell Teacher.”</p><br/><p>Truth be told, Ai Hui’s non-stop training had scared her. He must have been this hard-working when he was trying to figure out the [Twin Weaving Technique] in the Suspending Golden Pagoda. No wonder he could simulate the technique even though he had just activated his natal residence. How amazingly determined!</p><br/><p>Ai Hui felt that his senior was right—focusing had started to become increasingly difficult. He knew that this was the sign of exhaustion.</p><br/><p>\"Then I'll get going, Senior!\"</p><br/><p>Ai Hui bid Senior Mingxiu goodbye before promptly leaving the embroidery workshop.</p><br/><p>On the street, Ai Hui felt like he was in another world. All the fog and smell of the herbal medicine within the workshop had disappeared, leaving only a faint herbal smell on his body to remind himself how he had passed these last few days.</p><br/><p>Under the sunlight, Ai Hui smiled and had a good stretch. He decided that once he reached back, he would have a good bath and sleep.</p><br/><p>Just then, he heard someone call his name.</p><br/>\n</div>"}