{"title": "Chapter 96: The Discussion Between the Old and the Young", "id": 96, "volume": 1, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-96-the-discussion-between-the-old-and-the-young", "volume_title": "Volume 1", "body": "<h1>Chapter 96: The Discussion Between the Old and the Young</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 96: The Discussion Between the Old and the Young</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>He didn’t know if it was because he had been hanging out with Lou Lan for an extended period of time, but Ai Hui felt that he had become a much more cheerful person.</p><br/><p>Alright. Perhaps these were his true colors?</p><br/><p>Ai Hui pondered over it. At the swordsman school, he was mostly alone and did not have any playmates of the same age. He had usually read through the sword manuals in silence alone. When he was in the Wilderness, everyone was always filled with tension as they lived on the edge, and as a result, he did not have any playmates in the Wilderness as well. However, there was Fatty; but he wasn’t really reliable.</p><br/><p>Luckily, Lou Lan was a good person—no, good sand—wait, that didn’t sound right either...</p><br/><p>Lou Lan had already transformed back. “Ai Hui, Master Shao said for Lou Lan to follow you in the future. Can I?”</p><br/><p>“Of course! We are the best partners!” Ai Hui said without hesitation. He was over the moon—he had made it! He laughed till his eyes couldn’t be seen, and he exclaimed in high-spirits, “Let’s go around the world with our swords and make money! I will dominate the Elemental Era and Lou Lan, you’ll reign the kitchen!”</p><br/><p>Lou Lan simmering soup, Lou Lan cleaning the training hall, Lou Lan, the multi-purpose helper...</p><br/><p>As long as you could think of it, Lou Lan was able to do it.</p><br/><p>Lou Lan also became elated, and with a bang, he transformed into countless instances of the word ‘money,’ in numerous different sizes. These words danced around Ai Hui like a school of fishes.</p><br/><p>After going wild with Lou Lan, Ai Hui had to leave for his training.</p><br/><p>He didn’t know if it was because of his good mood—although he could only extract bits and pieces, Ai Hui was no longer so anxious now. He was in a more stable state.</p><br/><p>It was important to have a peaceful mind while extracting the Twilight Silk. That was why Ai Hui managed to surpass one meter in one fell swoop.</p><br/><p>His life had also started to become more substantial; he did not spend all his time extracting the Twilight Silk. He realized that extracting the Twilight Silk needed a high amount of concentration, and if he was tired, it would reduce the effectiveness of his training. And on the other hand, resting could actually be beneficial for his training.</p><br/><p>He started to adjust his lifestyle. He still attended lessons and would find the old man to discuss about elemental energy afterward. After teaching for decades, the old man had profound theories and knowledge. His discussions with the old man were all eye-openers for Ai Hui.</p><br/><p>He did not know that Wang Shouchuan was even more amazed by his own disciple.</p><br/><p>He had wanted to give a reminder to Ai Hui when he saw him train day and night, but he really couldn’t believe that Ai Hui himself had quickly realized that something was wrong and had adjusted his habits on his own accord.</p><br/><p>Wang Shouchuan wondered if his disciple had lied about his age. He was so seasoned and mature till the point that it could be called formidable. He had seen many different talents in the Induction Ground. While Ai Hui’s aptitude was nothing worth speaking of, his temperament and determination could definitely place him in one of the top three.</p><br/><p>What a formidable chap.</p><br/><p>However, Ai Hui’s capability was never written on his face; underneath his common appearance, there lay an enigmatic ocean.</p><br/><p>At the start, Wang Shouchuan had explained and imparted knowledge of elemental energy to Ai Hui, but as time went by, he was shocked to realize that it had started to become more like a discussion between them.</p><br/><p>His disciple had an unusually sharp intuition towards strength. What was even more unfathomable was that Ai Hui had a profound understanding of ancient swordsmanship. Ai Hui often used swordsmanship as a source of reference and research, often coming up with theories and conjectures that repeatedly shocked Wang Shouchuan.</p><br/><p>Ai Hui was like an insatiable sponge, desperately trying to absorb all sort of knowledge.</p><br/><p>He was a different person while he was training. He could be calmly engaged in some form of training, but once he thought of an idea, he would not hesitate to try it out.</p><br/><p>Wang Shouchuan was not used to this. He was a cautious and conservative man, or else he wouldn’t have stayed in the Induction Ground for so long.</p><br/><p>In that aspect, Ai Hui displayed his courageous spirit and was abnormally brave. Wang Shouchuan always had an illusion—he felt that his own disciple would not hesitate to gamble his life if there was a need to.</p><br/><p>The risks he had taken at the Suspending Golden Pagoda had already illustrated this point.</p><br/><p>Wang Shouchuan hoped that Ai Hui could be more cautious; on the contrary, Han Yuqin was more than appreciative of Ai Hui’s personality. She felt that this displayed his masculinity, and she would take every chance to mock Wang Shouchuan whenever Ai Hui showed any signs of such.</p><br/><p>That woman could really hold a grudge!</p><br/><p>Wang Shouchuan was somewhat helpless, but two sentences from that woman really moved him: “Don’t tell me you want your disciple to be like you? To stay in the Induction Ground for a few decades?”</p><br/><p>That particular sentence led him to become distracted for a long period of time.</p><br/><p>Ai Hui did not know about all this; he was totally immersed in the sea of knowledge. His greatest gain was from his daily discussions with his teacher. Compared to the average classes, such mutual discussions were much more profound.</p><br/><p>Through these intense discussions, Ai Hui’s understanding towards training and elemental energy increased day by day.</p><br/><p>His next gain was that he discovered that there were many things in the sword manual that were of use. Compared to the system of five residences and eight palaces, the system for swordsmanship was many times more tremendous and vast.</p><br/><p>Few people would pour through so many swordplay manuals and spend so much time browsing through a system that was not of use. Furthermore, it was such a vast, complicated system to comprehend. Nowadays, that was why those who were obsessed with swordsmanship held no interest in training their elemental energy.</p><br/><p>After recognizing such a vast and rigorous training system, Ai Hui realized that he now had an entirely different understanding of the five palaces and eight residences upon revisiting it.</p><br/><p>What made him happier was that he realized that some concepts pertaining to swordsmanship may even be applicable elsewhere.</p><br/><p>For example, the Twilight Silk required the concentration of elemental energy; however, from another point of view, wasn’t this just using elemental energy as a thrust from a sword?</p><br/><p>It was just that this sword had to be extremely stable and slow.</p><br/><p>A slow sword?</p><br/><p>Within the vast and tremendous amount of swordplay manuals that all held various odd things, Ai Hui managed to find a similar manual.</p><br/><p>Perhaps he could use this technique or school of thought as a reference?</p><br/><p>Ai Hui’s eyes sparkled.</p><br/><p>Wang Shouchuan also approved of such a theory.</p><br/><p>The present atmosphere was highly practical for discussion since few students were interested in the principles of training of elemental energy. During lessons, teachers would make a half-hearted attempt to explain about elemental energy training, and they would instead emphasize more about describing the moves and potential problems that would occur during elemental energy training.</p><br/><p>The old and the young were immersed in the discussion of the theory.</p><br/><p>Initially, Old Man Wang had the intention to teach, but pretty soon he was immersed in the discussion and couldn’t extricate himself. Ai Hui was very familiar with the swordplay system, and he had many interesting questions pertaining to swordplay.</p><br/><p>The old man was very much inspired, and his gains were plentiful.</p><br/><p>For example, Ai Hui had asked that if both swordplay and spirit energy had a separation between the yin and the yang, then why didn’t elemental energy have such a differentiation?</p><br/><p>This question had stumped the old man. He pondered over it for a few days and finally gained a few vague ideas. He wanted to discuss it with Ai Hui and widen his train of thoughts. However, much to his surprise, a few days had passed, and Ai Hui did not show up.</p><br/><p>The old man felt uneasy. Where did this youngster go?</p><br/><p>He could not stop himself from running straight to the embroidery workshop.</p><br/><p>Upon rushing into the workshop, he was prepared to shout his head off when he suddenly saw something out of the corner of his eyes. His woman and Mingxiu were standing outside the workshop's window in rapt attention.</p><br/><p>The old man forcefully refrained himself from yelling, tiptoed to the side of the old woman, and looked through the window.</p><br/><p>His eyes widened.</p><br/>\n</div>"}