{"title": "Chapter 107: The Usage of Twilight Silk", "id": 107, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-107-the-usage-of-twilight-silk", "volume_title": "Volume 2", "body": "<h1>Chapter 107: The Usage of Twilight Silk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 107: The Usage of Twilight Silk</p><br/><p>Translator: Cynthia Editor: Pranav</p><br/><p>Mingxiu squatted and started to study the piles of Twilight Silk.</p><br/><p>The Twilight Silk that Ai Hui extracted every day was put aside from the others’. At first, there wasn’t much, but days later the amount began to increase sharply—especially in the past two days. Ai Hui could use up two cocoons a day, and the amount of silk extracted from two cocoons was staggering.</p><br/><p>Mingxiu hadn’t noticed anything before, but now, as she looked at the piles of silk, she was greatly surprised.</p><br/><p>Two cocoons per day. How could he be so fast? How on earth did he do it?</p><br/><p>She hadn’t thought about it very carefully before, and it was only now that she realized that this was unbelievable. It meant that Ai Hui’s speed of extracting silk was extremely quick—only in this way could he consume two cocoons a day.</p><br/><p>Maybe he was silkworm-attributed?</p><br/><p>Even the Twilight Silkworm couldn’t produce silk as fast as him.</p><br/><p>Yet Mingxiu soon noticed something amiss. The color of each pile of silk was slightly different—the longer the time gap was, the more evident the difference in color, and vice versa. The strands of silk produced within the past three consecutive days were almost of the same color—the color difference was practically unnoticeable to the naked eyes.</p><br/><p>She was right! Ai Hui was doing some kind of experiment.</p><br/><p>The difference in color of the strands of silk in front of her verified her assumption.</p><br/><p>Mingxiu picked up a strand of silk and carefully inspected it. The shop manager’s return had made her a bit confused. Manager Li was a shrewd person who was always careful and strict with his daily budget and would never buy something unnecessary. This was the first time that Mingxiu had seen him buy up everything without hesitation.</p><br/><p>Unless… unless he believed he was on the advantageous side of the deal.</p><br/><p>Mingxiu’s mind raced. The Twilight Silk was not widely used, and also, since it was very thin, the requirement for its length was high. Therefore, these short strands of silk were hardly of any use.</p><br/><p>Any good embroidery worker had to be very familiar with embroidery materials because the materials used in embroidery were critical. Any difference in materials would change the quality of the fabrics.</p><br/><p>Mingxiu hadn’t paid particular attention to these strands of silk before. Now, after scrutinizing the silk carefully, she soon became surprised by what she found.</p><br/><p>Ai Hui had no idea that Mingxiu was examining the silk he had extracted. He was totally engaged in training. The change he was going through, in regards to his training, had been much more apparent.</p><br/><p>At the very beginning, he had controlled elemental energy with the slowest speed to extract the silk, as instructed by Wang Shouchuan and Han Yuqin.</p><br/><p>But after continuously training, he began to gain experience, and he soon made new discoveries.</p><br/><p>During his discussions with his master, Ai Hui realized that although Master was equipped with enough theoretical knowledge, he hardly had any hands-on experience. When it came to training, especially to the details, his lack of experience would be exposed.</p><br/><p>Moreover, Ai Hui’s case was unique. Wang Shouchuan had never met someone like him before.</p><br/><p>This was a common problem for all teachers; while they could explain their theories clearly, they seldom talked about the details.</p><br/><p>Ai Hui didn’t have much training experience either, but he was used to learning through trial and error. After fully understanding the theories through several rounds of discussion with his master, Ai Hui had obtained a vague idea of his physical condition. One interesting thing he discovered was that the feeling he got—when he passed his elemental energy through his hand palaces—wasn’t necessarily intensified along with the slowing down of his elemental energy control.</p><br/><p>As he trained, he tried to change the speed of elemental energy to compare the different levels of stimulation to his hand palaces.</p><br/><p>That was how he had found the optimal speed to best stimulate his hand palaces.</p><br/><p>And this optimal speed was much faster than his lowest speed.</p><br/><p>Now, Ai Hui had become very familiar with extracting silk. His elemental energy was like a sword, and when it was spirally infused into the silk at optimal speed, the silk would remain unbroken.</p><br/><p>However, when he had just begun to believe that he could extract ten meters of silk per day, reality gave him a severe blow.</p><br/><p>At the optimal speed, Ai Hui could extract silk much faster. But when his elemental energy passed through his hand palaces, the stimulation he would feel was so strong that his hand palaces would quiver and break off the silk. That was why the silk Ai Hui extracted was only one meter long.</p><br/><p>That was… a lot of money!</p><br/><p>Weeping inside his heart, Ai Hui continued his training.</p><br/><p>He consoled himself that it was fine. He could always earn more money in the future.</p><br/><p>Although the loss was huge, he was glad that the efficiency of his training had been largely increased.</p><br/><p>While the optimal speed was much more than before, it was still less than the running speed of elemental energy during fighting. Therefore, it was not yet too heavy a burden for him.</p><br/><p>This meant he could raise the density and duration of his training, and in this way, Ai Hui progressed by leaps and bounds.</p><br/><p>He could clearly feel the existence of his hand palaces. When elemental energy ran through his palms, apart from little tremors, he could also feel a slight heat in his hand palaces.</p><br/><p>Nothing encouraged him more than this.</p><br/><p>Nothing could cheer him more than the tangible feeling of his own progress.</p><br/><p>And today, Ai Hui could feel that something was different about his hand palaces as soon as he started training. When the elemental energy ran through his palms, it was as hot as a soldering iron, and they shivered much more fiercely than usual.</p><br/><p>Therefore, Ai Hui was highly vigilant. He strongly felt that there would be breakthrough today.</p><br/><p>But this did not disturb his state of mind, and he continued to unhurriedly extract the silk as usual.</p><br/><p>The breakthrough would be naturally achieved when all the conditions were ripe.</p><br/><p>Hidden in the fog, his eyes were as calm as water.</p><br/><p>Seeing Mingxiu return, Manager Li cracked a wry smile. He knew he had given himself away. He used to think that Mingxiu was gentle and graceful, but he never knew that she was so smart, too.</p><br/><p>Mingxiu smiled back at him.</p><br/><p>Manager Li cupped his hands and smiled bitterly. “Nothing can escape your eyes.”</p><br/><p>He felt a bit upset. He had intended to gain enormous benefits, but this goal now seemed very difficult to achieve.</p><br/><p>“I’m flattered.” The smile on Mingxiu’s face disappeared, but her voice was still gentle. Her expression became serious as she said, “The Jade Embroidery Workshop only focuses on embroidery and is not interested in other businesses. You are really talented if you can put this material into use. It’s just that this Twilight Silk was made by Ai Hui. I’m his senior, and I cannot just stand by and watch you take advantage of him. I think you would also prefer cooperation rather than a one-time deal. If we can cooperate, you will have a stable supply of materials, and we can both earn more. Don’t you agree?”</p><br/><p>Manager Li was filled with admiration. “You are indeed as generous as I expected, Mingxiu. I really appreciate it. Your junior is skilled enough to produce such Twilight Silk. It is as tough as steel wire and is also very sharp. If infused with elemental energy, it can be used to cut through stones. I soaked a piece of ebony vine as thick as a thumb in oil until it became soft, and I made an arrow together with Twilight Silk and gold wire grass. With this arrow, I can pierce a three-inch-thick plate from five hundred steps away.”</p><br/><p>He told everything about the method and usage of the silk to Mingxiu to show his sincerity. Anyway, since she had already noticed the peculiarity of this Twilight Silk, it wouldn’t be long before she found out the usage herself.</p><br/><p>Mingxiu’s beautiful eyes lit up. She of course knew what this meant. “How much is one arrow?”</p><br/><p>“I made ten arrows with one hundred pieces of Twilight Silk, and I sold them all to a customer I’m familiar with at the price of thirty thousand yuan each,” Manager Li said proudly.</p><br/><p>Mingxiu nodded. “If so, I will decide on behalf of Ai Hui to provide the Twilight Silk to you. In return, you will give him thirty percent of your profits. What do you think?”</p><br/><p>Manager Li was slightly surprised. “Really?”</p><br/><p>Of all the materials, the most important one was the Twilight Silk. He had been prepared for Mingxiu to ask for fifty percent of the profits—thirty percent was something he would never have expected.</p><br/><p>Mingxiu smiled like a spring breeze, and she was about to say something when she suddenly heard a loud, thundering sound.</p><br/><p>The ground trembled.</p><br/><p>Mingxiu’s expression changed. She had no time to finish her words before she hurriedly rushed towards the workshop.</p><br/><p>Junior Ai Hui!</p><br/>\n</div>"}