{"title": "Chapter 103: Hall of Nine Tones", "id": 103, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-103-hall-of-nine-tones", "volume_title": "Volume 2", "body": "<h1>Chapter 103: Hall of Nine Tones</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 103: Hall of Nine Tones</p><br/><p>Translator: YH Editor: Pranav</p><br/><p>After throwing all those nonsensical and distracting thoughts to the back of his mind, Ai Hui’s mind was now at peace. All that stuff about Bangwan or his one hundred fifty million yuan didn’t matter to him anymore. He wasn’t going to waste any more time and effort on that ingrate—it wasn’t as if they were related in any way. Ai Hui was stingy with his time and would much rather spend it on those close to him.</p><br/><p>Was the ingrate within his intimate social circle? Certainly not.</p><br/><p>Only Lou Lan, Fatty, Teacher Wang, Mistress, and Senior Mingxiu were worthy. Everyone else can just go mind their own business!</p><br/><p>As for the one hundred fifty million? Hehe, forget about it.</p><br/><p>Having grown up in the Wilderness, Ai Hui had witnessed the most extreme of contests for resources. People would fight over mere pennies and would sometimes even engage in battles of life and death over a few hundred yuan.</p><br/><p>And some rich kid came along and offered him a hundred million? Other people could afford to be naive, but not Ai Hui.</p><br/><p>Lou Lan was the only reason why he was willing to lend a helping hand.</p><br/><p>Ai Hui knew how different he was from Lou Lan. He also understood that he would never become as kind as Lou Lan, and he didn’t want Lou Lan to become more like him.</p><br/><p>Even though he managed to escape the darkness, it had long permeated his entire being. He knew that he would never be able to break away from the constant fighting and killing of his past.</p><br/><p>Victory and strength were the only things that made him feel safe.</p><br/><p>Lou Lan was different; his passion for this world radiated warmly like the sun.</p><br/><p>And Ai Hui enjoyed the sun; he liked the way Lou Lan was. Everything was fine as long as Lou Lan remained happy.</p><br/><p>As for that ingrate, he’d better not meet Ai Hui in battle.</p><br/><p>By focusing on those that mattered and treating Duanmu Huanghun as an insignificant being, Ai Hui preserved his inner tranquility.</p><br/><p>Duanmu Huanghun was, however, not the least bit at peace.</p><br/><p>How could he be?</p><br/><p>He was resentful that putting down his pride and sincerely apologizing wasn't enough for Ai Hui. Moreover, he had experienced that nightmare again—what a harrowing experience! He had felt so fearful that he didn’t even know how he had managed to flee from the Vanguard Training Hall.</p><br/><p>Duanmu Huanghun only regained his senses the next day.</p><br/><p>Fully aware of his circumstances, he felt even more resentful.</p><br/><p>How could he have fainted in that alley? How could he have allowed himself to be saved by Ai Hui once again? The scene where Ai Hui had contemptuously asked him for one hundred million yuan was etched deeply in his mind.</p><br/><p>Duanmu Huanghun had never been scoffed at to such an extent in his life.</p><br/><p>Not even once!</p><br/><p>Just like how nobody had ever considered him to be someone who made empty promises. Everyone around Duanmu Huanghun, even adults and his childhood friends, had always regarded him as a respectable man of his words!</p><br/><p>Money?</p><br/><p>To him, money was insignificant!</p><br/><p>Money was just a figure to him. Having his promise disregarded was one thing, but to view it as being worth less than fifty million yuan was a total insult to his character. What’s worse was that the other party believed that he couldn’t even afford one hundred million yuan.</p><br/><p>Fine, he was indeed unable to afford that amount at that point in time.</p><br/><p>That scoundrel!</p><br/><p>Duanmu Huanghun clenched his fist tightly, his knuckles turning white. His eyes felt like they were capable of spewing fire.</p><br/><p>He took a deep breath, slowly releasing his fist. Although he was still filled with rage, Duanmu Huanghun could now restrain it.</p><br/><p>He made a decision.</p><br/><p>Counterattack!</p><br/><p>He was going to counterattack!</p><br/><p>He would show that scoundrel just how easy it was for him to make money. He would demonstrate the vast difference between a genius and a piece of trash! He would let him know just how much his promises were worth—that scoundrel could just take his one hundred fifty million yuan and wallow in regret!</p><br/><p>Duanmu Huanghun regained his composure, quickly coming up with a plan.</p><br/><p>……</p><br/><p>Wu Qirong’s birthday was finally here; he was finally coming of age. The Wu family had a 600-year history, and even though it wasn’t particularly large, it wasn’t exactly small either. Although their legacy wasn’t as established as those of the founding houses, the family nevertheless had its own estate and a decent sphere of influence.</p><br/><p>After six hundred years of painstaking efforts, the Wu family was now flourishing.</p><br/><p>Wu Qirong was the eldest son of the Wu family, and his name reflected the great expectations that his elders had of him. [1] He was, however, a mischievous child, and had grown to be a highly sociable person with a vast network of friends. Wu Qirong was bright; he had noticed early on that he couldn’t match his elders when it came to hard work.</p><br/><p>As such, he had focused on expanding his social network. He was a generous person who was well versed in negotiating his way around others, and he had never offended anyone. These qualities led him to have quite a reputation among the dandy community.</p><br/><p>Wu Qirong continued to socialize even when he had come to the Induction Ground. He spared no expense, choosing to host a large banquet to celebrate his birthday.</p><br/><p>One could tell from the venue that the host was a massive spender. The banquet was held at the Hall of Nine Tones, the most luxurious venue in the Induction Ground.</p><br/><p>The Hall of Nine Tones was built by Di Xinyuan, a Music Theory Master. When the Induction Ground’s administration received news that Master Di Xinyuan intended to return to the Induction Ground, they decided to give him a beautiful, scenic place to honor his return.</p><br/><p>The master had been indescribably happy at the gesture and had decided to build the Hall of Nine Tones on this piece of land for his life of solitude. He had once roamed the world, exploring the Avalon of Five Elements, and he had even wandered into the Old Territory. He had picked his nine favorite architectural styles and had built nine entirely different courtyards, and hence the name Hall of Nine Tones.</p><br/><p>Once built, the Hall of Nine Tones instantly became the Induction Ground’s most valued venue.</p><br/><p>Besides being an architectural marvel, the hall played host to musicians that were handpicked and taught by the master himself. The songs they performed were always changing and were all written by Master Di Xinyuan himself.</p><br/><p>Ever since the day of its completion, the Hall of Nine Tones had become the favorite haunt of youngsters from the influential families.</p><br/><p>Getting a reservation for the venue was extremely difficult. Not only was it extremely costly, but the place also had strict requirements regarding the identity of its customers. Wu Qirong had spent a tidy sum to buy someone else’s reservation.</p><br/><p>He had to admit, though, that it was all worth it!</p><br/><p>The hall’s decor and the exquisite elemental food dishes, coupled with the heavenly music, were simply intoxicating. The look on his peers’ faces upon entering the venue gave him immense satisfaction. He was extremely pleased with his purchase!</p><br/><p>Just as Wu Qirong was happily content, an icy voice suddenly rang out from the doorway. “Little Wu, why wasn’t I notified of your birthday party? You’ll have to drink three glasses of wine as punishment.”</p><br/><p>A lithe figure with an air of aloofness appeared at the doorway.</p><br/><p>The guests at the table instantly fell silent.</p><br/><p>One of Wu Qirong’s playboy mates angrily voiced out, “Who is this atrocious piece of trash—”</p><br/><p>Pa!</p><br/><p>A resounding slap in the face!</p><br/><p>The playboy held his cheek and stared blankly at Wu Qirong, stunned that his friend had actually slapped him.</p><br/><p>Wu Qirong, who was behaving all loftily just awhile ago, bent down without hesitation to pour himself three glasses of wine. He downed them all in one breath.</p><br/><p>Without putting down the glass, Wu Qirong hastily ran over to the newly arrived guest. He bowed slightly and said, “Brother, you should have told me earlier that you were coming! I would hardly dare to disturb you without hearing from you first. Someone as important as you must surely be very busy, unlike us idle fools who merely spend our time strolling around and playing to our whims.”</p><br/><p>Everyone was shocked silent.</p><br/>\n</div>"}