{"title": "Chapter 115: The Detached Bystander", "id": 115, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-115-the-detached-bystander", "volume_title": "Volume 2", "body": "<h1>Chapter 115: The Detached Bystander</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 115: The Detached Bystander</p><br/><p>Translator: Irene Editor: Pranav</p><br/><p>Holding his Sawtooth Grass Sword, Ai Hui cooly watched on as his surrounding classmates vomited continuously. During his first ride on the Clover Transport Wagon, he, too, had vomited—even more, in fact, than these students, so he did not sympathize with them at all. It was obvious that the wood elementalist controlling the vehicle was being lenient.</p><br/><p>Compared to the Three Leaves Bamboo Cart within the cities, a ride on the Clover Transport Wagon was much wilder.</p><br/><p>It was wilder in all aspects.</p><br/><p>With a tougher stem and leaves, if the clover of the Three Leaves Bamboo Cart was a delicate and tender beauty, the Clover Transport Wagon would be a muscular, iron giant. Grass stems as thick as calves were not easily damaged by swords, and every leaf was like a blade and half the size of a door. As the wagon moved, they produced a scalp-tingling sound.</p><br/><p>Not only did the Clover Transport Wagon have to be able to transport enough goods, it had to provide sufficient protection and also had to have a certain flexibility. Colorful plants dotted the outside of the vehicle, and there was a different significance for each flower bud, thistle, and thorn. For example, some could spray a steady stream of toxic vapor to chase away flying dire beasts, helping pave a path of escape for the wagon in desperate situations.</p><br/><p>However, the flying dire beasts were resilient, and the effectiveness of the toxins was limited. It was, in fact, the smell of the vapor that would allow the wagon to dodge a bullet—a majority of the flying dire beasts detested the odor.</p><br/><p>Although it was a wagon, going in and out of the Wilderness required it to be more flexible and nimble than the Three Leaves Bamboo Cart in the cities. It was similar to a massive but agile and robust man. The wood elementalist controlling the wagon usually loved to gift rookies a tough flight experience.</p><br/><p>Ai Hui, however, was enjoying the ride.</p><br/><p>The wood elementalist in front had obviously taken care to not overdo it. This level of bumpiness was practically sleep inducing.</p><br/><p>Other students were badly battered. Throughout their lives, they had traveled in stable vehicles like the Fiery Floating Cloud and the Three Leaves Bamboo Cart. Where would they have experienced such a wild ride?</p><br/><p>Ai Hui took a sideward glance at the ingrate.</p><br/><p>The ingrate had been arranged to sit beside him. However, compared to others, Duanmu Huanghun was performing well. He sat motionless on his seat. Although his expression didn’t look too good, he hadn’t vomited.</p><br/><p>Ai Hui suddenly noticed that Duanmu’s whole body was tensed up, so he leaned over and advised him nonchalantly, “Puke if you feel like, don’t hold it back. You’ll feel much better after…”</p><br/><p>Wow!</p><br/><p>Duanmu Huanghun, who had been resisting all along, instantly felt his throat become dry and itchy—he couldn’t keep it in any longer! Duanmu bent over and let it all out, like a flood breaking through a dam.</p><br/><p>“Got vomit on your body? How careless. There’s no place for you to wash up in the countryside. But it’s not a big deal, just smell it for a few days at most.” Ai Hui’s devilish voice sounded from above.</p><br/><p>Duanmu Huanghun saw the filth that covered his pants and shirt. His pupils shrank and his mysophobia finally acted up, causing him to puke wildly again.</p><br/><p>Ai Hui couldn’t bear to keep looking, and he shifted a little away.</p><br/><p>He really didn’t know what Teacher Xu was thinking by teaming this ingrate with him and having them sit together.</p><br/><p>How suffocating.</p><br/><p>Zhou Xiaoxi glanced over at Teacher Xu and couldn’t help but shake his head. Teacher Xu’s face was pale, and it was evident that he was making an extreme effort to endure. Luckily, they were traveling within the Induction Ground; if they were heading for the Wilderness, he would definitely not have agreed to babysit these rookies.</p><br/><p>Among these people, Ai Hui was the most eye-catching. He was also the only one Zhou Xiaoxi did not have to worry much about.</p><br/><p>He could tell from Ai Hui’s posture that he was a veteran. His body was relaxed, and he moved up and down along with the wagon’s movements. His hands were gripped onto his weapon, and he had a steady gaze, both of which would allow him to respond to any possible dangers. His mind was alert, with his eyes constantly paying attention to his surroundings.</p><br/><p>Even an experienced person like Zhou Xiaoxi couldn’t find any fault. He thought about what Li Wei had mentioned before, that Ai Hui had worked in the Wilderness as a laborer for three years. Seemed like he wasn’t talking nonsense.</p><br/><p>It was always better to have at least one reliable person.</p><br/><p>“Haha, we’re about to reach!” The wood elementalist whistled.</p><br/><p>There was a sudden change in the engine’s noise as the wagon started to swiftly pull up.</p><br/><p>Among the shocked gazes, Ai Hui couldn’t help but shake his head. These fellows sure had similar bad habits! Couldn’t they do something new?</p><br/><p>The raised wagon gave a terrible jerk, and in the next instant, it dove down fast.</p><br/><p>The screeching of the wagon drowned the high-pitched screams, but Ai Hui was indifferent to it all. He was only inwardly ridiculing those wood elementalists for not having any creativity.</p><br/><p>The familiar feeling of that drop brought Ai Hui back to the time he spent in the Wilderness.</p><br/><p>He missed Fatty all the more now. If Fatty were here, he would be talking non-stop; he always became long-winded when nervous.</p><br/><p>Ai Hui was the first to jump off as he couldn’t stand the smell inside. But the others’ legs had turned soft; they were practically rolling and crawling out. Some of the timid girls couldn’t even dare to jump, and they had to be thrown out of the wagon by Zhou Xiaoxi.</p><br/><p>The wood elementalist was singing at the top of his voice, either in a satisfied or mocking tone, as the wagon whizzed away.</p><br/><p>The group of students left behind was similar to helpless sheep within the Wilderness.</p><br/><p>Teacher Xu had considered the kids’ lack of experience while planning the itinerary. They were merely first-year students and were weak to begin with, so this long journey was purposefully organized for them to just experience a little.</p><br/><p>“We’ll rest here tonight and continue tomorrow. First, though, you must all learn how to pitch camp! It is an essential skill, and you will discover its importance upon graduating! Instructor Zhou from the Society of Excellence will guide us on how to do it. He is an elite veteran from the North Sea Division!”</p><br/><p>Zhou Xiaoxi didn’t decline; this was one of their missions anyway. It was a tradition in the Avalon of Five Elements for seasoned frontline soldiers to return and impart their knowledge to students as it was extremely beneficial to their growth.</p><br/><p>Zhou Xiaoxi did not start immediately, but he instead instructed, “Ai Hui, you’re in charge of standing guard.”</p><br/><p>“Okay.” Ai Hui nodded as he walked towards the forest, sword in hand.</p><br/><p>Zhou Xiaoxi began, “Let’s start pitching ca—”</p><br/><p>“Why does he get to stand guard?” Duanmu Huanghun interrupted. “Instructor Zhou, shouldn’t the strongest go?”</p><br/><p>He had been made a fool by Ai Hui earlier and was waiting for an opportunity to get back at him.</p><br/><p>“Generally, yes.” Zhou Xiaoxi gave an amiable smile. “You think you’re the strongest?”</p><br/><p>“That’s correct!” Duanmu Huanghun was unwilling to pass his responsibilities. “I’m stronger, and I’ve also learned how to guard. I’m more experienced.”</p><br/><p>“Sure.” Contrary to his expectations, Zhou Xiaoxi was straightforward. “Then you shall stand guard, and Ai Hui will pitch camp.”</p><br/><p>Feeling that his plan was a success, Duanmu sneered and dashed into the forest, looking for Ai Hui.</p><br/><p>Ai Hui did not mind. He had frequently stood guard and knew that it was tougher than ordinary work. He was more than happy to hand it over to Duanmu Huanghun, who was, moreover, willing to handle the job.</p><br/><p>Under Zhou Xiaoxi’s guidance, the students quickly learned how to pitch camp and the discomfort from the wagon ride was soon forgotten. Work was now proceeding in full swing.</p><br/><p>As the sky darkened and the winds grew stronger, a bonfire was lit.</p><br/><p>Ai Hui suddenly raised his head.</p><br/>\n</div>"}