{"title": "Chapter 116: Barrier", "id": 116, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-116-barrier", "volume_title": "Volume 2", "body": "<h1>Chapter 116: Barrier</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 116: Barrier</p><br/><p>Translator: Irene Editor: Pranav</p><br/><p>Ai Hui heard a faint sound.</p><br/><p>He raised his head and looked around, listening attentively.</p><br/><p>The bonfire was burning brightly, and the students were recovering from that wild wagon ride. The freshness of it all significantly improved their moods as they settled down around the fierce flames and chatted. Some of the more lively and outgoing students even started singing and dancing. Teacher Xu was also infected by everyone’s enthusiasm and could be seen full of smiles.</p><br/><p>Ai Hui did not join them, and instead, he quietly sat under a big tree about forty meters away from the bonfire.</p><br/><p>A fire in the countryside at night was the most eye-catching target. It was too easy to attract wild beasts.</p><br/><p>Ai Hui was aware that the Induction Ground was devoid of violent beasts and that there was an expert like Instructor Zhou to protect them—there wouldn’t be much danger in this excursion. However, due to habit, hiding in the dark had already been ingrained as an instinct. He always felt safer that way.</p><br/><p>Upon entering the countryside, it was as if Ai Hui had returned to the Wilderness—to the land of cold slaughter. However, he was shocked to find out that he wasn’t the least bit repelled by this; he was, in fact, faintly excited. The moment he had stepped into the forest, he felt like a fish back in water. Perhaps he had been a jungle beast in his previous life.</p><br/><p>Humans are ignoble!</p><br/><p>Ai Hui mocked himself. It had only been a few good days, and he was already starting to reminisce about the past.</p><br/><p>Leaves rustled as the wind swept by, but the ground remained still. There were no sounds of people trampling on dead leaves, no abnormal noises from the bushes, and no sounds of flapping wings breaking through the air.</p><br/><p>Was it an illusion?</p><br/><p>Ai Hui saw Instructor Zhou standing not far away. He had shown no reaction and was currently bragging about his past military successes, basking in the students’ worshipping gazes.</p><br/><p>Ai Hui’s pursed his lips as they turned upwards to form an arc.</p><br/><p>How great!</p><br/><p>Yes, this was not the Wilderness. There were no dire beasts, only peace, and tranquility.</p><br/><p>Ai Hui shook his head. He was overreacting. He thought back to how he had almost slipped up and killed some people a few times when he had first entered the Induction Ground; adapting had taken a long time. But being in the countryside easily roused memories of the Wilderness.</p><br/><p>This was not the Wilderness.</p><br/><p>Ai Hui reminded himself once more. He hadn’t done so for a long time.</p><br/><p>However, when he thought of the ingrate, Ai Hui felt like gloating. He must be feeling quite satisfied right now!</p><br/><p>Duanmu Huanghun was feeling terrible. Not only was the wind at the treetop much stronger than on the ground, but he was also receiving its full bore. He must have had a mental lapse when he had offered to take over guard duty.</p><br/><p>Instructor Zhou had explained in detail about the necessary requirements of a sentry.</p><br/><p>Duanmu Huanghun had never tolerated half-hearted work, and so he operated according to Instructor Zhou’s orders and warnings. For example, he had to always be on alert and pay attention to every single movement in his surroundings.</p><br/><p>In the beginning, Duanmu Huanghun did not see much difficulty in it, but as time passed, the uneventfulness of it all made his eyelids grow heavy. The sounds of the trees swaying in the wind were hypnotizing.</p><br/><p>Eh? What was that sound?</p><br/><p>He suddenly quivered. He seemed to have heard a faint sound, different from the rustling of the leaves.</p><br/><p>But when he pricked up his ears, all he heard was the familiar rustling.</p><br/><p>Was it an illusion?</p><br/><p>Duanmu Huanghun was uncertain; he had just been in a daze.</p><br/><p>He collected his thoughts. Although he was inexperienced, he knew the importance of standing guard in areas outside the city. This involved the safety of everyone so he couldn’t slack off. Since he was the one who had snatched the job, he had better do it well—better than that bastard Ai Hui at least.</p><br/><p>The raging flames of the bonfire eventually calmed down. A day’s worth of toil and torment had knocked everyone out, and silence quickly pervaded the camp as the students fell into deep sleep.</p><br/><p>Nothing happened throughout the night.</p><br/><p>Ai Hui opened his eyes and caught sight of the curling embers of the bonfire under the light of the morning sky.</p><br/><p>Zhou Xiaoxi was on patrol when he noticed that Ai Hui had woken up. He nodded as a hint of admiration flashed across his eyes before he continued with his rounds. Bringing a bunch of rookies brought him a lot of stress. Bragging was one thing, but when it came to proper business, he was never careless. He was well aware of the severity of the situation.</p><br/><p>An elite indeed!</p><br/><p>Ai Hui was full of respect for Zhou Xiaoxi. He was stronger than many elementalists that Ai Hui had seen. As an elite of the Thirteen Divisions, he was on another level from those elementalists of the hunting teams in the Wilderness.</p><br/><p>The students gradually started to stir from their sleep, and by sunrise, everyone had awoken. After a simple washing and cleaning up, they were ready to be on their way.</p><br/><p>Duanmu Huanghun returned with two clearly visible dark eye circles.</p><br/><p>The white-eyed wolf [1] was now a white-eyed husky…</p><br/><p>Ai Hui was moved. It wasn’t an easy job, after all. He did well!</p><br/><p>The team gathered and started to trek towards their next destination.</p><br/><p>Listening to his classmates’ chit-chat and seeing many of them take out their packed snacks gave Ai Hui the feeling that they were on a picnic.</p><br/><p>Ai Hui and his teammates were somewhat inharmonious, so he stayed at the back of the group.</p><br/><p>As they hiked, Teacher Xu was responsible for explaining.</p><br/><p>“We are heading for the Old Territory. Many of you have come from there, so, that is to say, we are heading towards your hometown. The Old Territory is not only home to some students, but it is the native place for us all. The construction of the Avalon of Five Elements is closely linked to the Old Territory. They have the same origin, and we are all family. Many of our future students will join the Avalon of Five Elements, too. We are fighting so hard today not just for the Avalon or the Old Territory, but for our future.”</p><br/><p>Under the sunlight, the students were engrossed in Teacher Xu’s speech, which was spoken with much dignity.</p><br/><p>Zhou Xiaoxi said nothing. He glanced at Teacher Xu before moving forward with his head down.</p><br/><p>AI Hui noticed that Instructor Zhou was in low spirits, but he did not know why. At the front line, the barrier between the Avalon of Five Elements and the Old Territory was like an invisible wall, unseen but everywhere.</p><br/><p>However, Ai Hui didn’t feel that Teacher Xu’s words were wrong because regardless of whether it was the Old Territory or the Wilderness, the dire beasts were the real, important enemies.</p><br/><p>Plus, he respected Teacher Xu a lot. All the teachers within the Induction Ground had opinions about this issue, but few would openly discuss them. Teacher Xu had courage.</p><br/><p>Of course, Ai Hui could only face it indifferently because he felt that a topic so noble had nothing to do with him.</p><br/><p>His own world was very tiny, to the point where it had no room for such large ambitions.</p><br/><p>Surviving and becoming strong enough to protect the people he cared about were perfectly sufficient.</p><br/><p>Ai Hui’s eyes scanned the surroundings and suddenly landed on a tree stump nearby, causing him to stop in his tracks.</p><br/><p>He walked towards it and squatted down.</p><br/><p>[1] A white-eyed wolf refers to an ungrateful person (an ingrate).</p><br/>\n</div>"}