{"title": "Chapter 114: Practicum Far From Home", "id": 114, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-114-practicum-far-from-home", "volume_title": "Volume 2", "body": "<h1>Chapter 114: Practicum Far From Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 114: Practicum Far From Home</p><br/><p>Translator: JL Editor: Pranav</p><br/><p>Ai Hui very rarely cared about such eccentric people. Even if there really was a major incident, it would definitely not be him who saved the world. So how did this concern him? He was merely an insignificant and weak nobody.</p><br/><p>He continued to immerse himself in his training—only during such practice did he feel that he was fully utilizing his time. He had just activated two palaces, and this base level was nothing much in the Induction Ground, unless he had an absolute art like Zu Yan.</p><br/><p>However, his training was interrupted on the second day.</p><br/><p>\"A practicum far from home?\"</p><br/><p>Everyone had questions in their hearts as they looked at Teacher Xu. All of them had been called by the teacher.</p><br/><p>Teacher Xu explained, \"Yes. Every year, we organize a long journey for the whole class. The main purpose is to allow everyone to expand their horizons. I will be leading the team and the school will send a few capable teachers along with us. Two instructors from the Society of Excellence will also be joining us on this journey. We will be going to the periphery zone of the Induction Ground.\"</p><br/><p>While the majority of the students were eager to give it a try, Duanmu Huanghun frowned. \"Teacher, may I opt out of such a long journey? I recently have a very heavy responsibility in training.\"</p><br/><p>Ingrate! Ingrate! Ingrate!</p><br/><p>Ai Hui silently scolded Bangwan with these three consecutive words before turning to Teacher Xu with an expectant look on his face. If Teacher Xu agreed, then he would be able to use the same excuse to stay behind as well.</p><br/><p>No one objected to Duanmu Huanghun’s words. Based on his capability, it was true that such a long journey would not be as effective as his training.</p><br/><p>However, Teacher Xu shook his head. \"No, Student Duanmu. This is the first time our class is having a collective activity. Everyone has to attend. You are the class monitor and you have to set an example!\"</p><br/><p>Duanmu Huanghun opened his mouth, but he ultimately decided not to speak up.</p><br/><p>After hearing this, Ai Hui had to give up as well.</p><br/><p>If Teacher did not allow a concession for that ingrate, then it really would be an impossible task for him. While Ai hui was disdainful of that ingrate’s personality, he couldn’t help but admit that that ingrate had a higher standing in Teacher’s heart than him.</p><br/><p>What bad luck...</p><br/><p>Since he couldn’t change anything, Ai Hui started planning for the excursion.</p><br/><p>It looked like he was going to end up wasting a few days. He should get Lou Lan to prepare some dried rations to help replenish his energy—he would then be able to train while in the camp.</p><br/><p>Oh, he also had to make a trip to Manager Li’s to choose a suitable sword. Although the Induction Ground was a safe place, it was better to be prepared. Self-defence skills were a top priority.</p><br/><p>Dried rations and a sword. Ai Hui gave a bitter laugh; it was no small expense.</p><br/><p>He was only left with around three hundred thousand yuan, and this was only because Manager Li had given him an advance payment. He seemed to never have enough money, and he still owed his mistress a significant amount, which he definitely had to return. Ai Hui didn’t even have the courage to think about the noodle shop girl’s eighty million yuan.</p><br/><p>Bunny hair, oh, bunny hair, you have to buck up!</p><br/><p>Back at the training hall, Ai Hui passed fifty thousand yuan to Lou Lan to purchase ingredients for the energy-replenishing cake. Thanks to Lou Lan’s elemental soup, Ai Hui was able to quickly recover the night before. The effect of the elemental soup would last for around three days, weakening with each passing day. Although the elemental soup had a much greater efficiency than the energy-replenishing cake, it was also much more expensive.</p><br/><p>Ai Hui then made a trip alone to Manager Li’s store.</p><br/><p>This was actually the first time that Ai Hui had stepped foot into Manager Li’s weapon store. It wasn’t far from the training hall; as a matter of fact, Central Pine City wasn’t that big of a city.</p><br/><p>The dazzling array of weapons displayed on the shelves made Ai Hui starry-eyed.</p><br/><p>Looking at Ai Hui’s passion, and hearing that Ai Hui was planning to purchase a weapon, Manager Li served him with even more enthusiasm. \"Oh, feel free to try. As long as you think it’s suitable, I’ll give you the best discount possible.\"</p><br/><p>Ai Hui’s eyed the various swords on display and started drooling. As someone who had experienced many battles, he had a deeply ingrained love for weapons. To him, a weapon was an important weight in the balance of life and death.</p><br/><p>In the Wilderness, he had used the Sword Reed Grass Sword, which was the most basic type of sword. It cost only two to three thousand yuan, equivalent to ten bowls of noodles.</p><br/><p>There were many variants of grass swords. High-quality grass swords, though, were not cheap.</p><br/><p>At first glance, Ai Hui’s gaze fell on a Sawtooth Grass Sword that was worth one hundred and twenty thousand yuan. In the past, he had tried out a similar Sawtooth Grass Sword, but he couldn’t afford it then. This Sawtooth Grass Sword was heavy to hold; Ai Hui was exceptionally sensitive towards weapons, and he guessed that the weight was 2.5 times that of the previous Sawtooth Grass Sword. If it were in the past, he would have needed to apply some effort to hold it, but now his power had grown and his body had become much stronger. Such a heavy sword would be an additional advantage for him.</p><br/><p>The edge of the sword was dark grey, and the sawtooth was slender, dark red, and exceptionally sharp. Sawtooth grass was a variety bred by wood elementalists, and it required metallic soil to grow. It matured in one year and could be manufactured into swords and blades in the first-stage manufacturing room of the Grass Division. Compared to the Sawtooth Grass Sword, the sawtooth grass blade had a larger variety of uses, and it was also able to exhibit a more abnormal destructive power than the Sawtooth Grass Sword.</p><br/><p>The color and luster of sawtooth grass was related to its age; the more mature it was, the deeper the color. If the sawtooth grass was older than ten years, its color would turn black, and it would consequently be extremely expensive.</p><br/><p>However, what astonished Ai Hui was the value of the Sawtooth Grass Sword. At a price of one hundred and twenty thousand, it was definitely on the lower side. If it was at the replenishment store in the Wilderness, such a sword would definitely cost around three hundred and fifty thousand yuan.</p><br/><p>While Central Pine City was at the rear and not the front line, a price of one hundred and twenty thousand was simply too cheap. Ai Hui bought the sword without hesitation.</p><br/><p>The weight of the sword was much heavier than that of usual grass swords, and without a certain amount of strength, it would be difficult to use it. Although it was normal for few students to be able to use such a sword, the low price was slightly out of the norm.</p><br/><p>After questioning Manger Li for the reason, Ai Hui was at a loss for words. The reason was that the sword’s colour was dull, and hence not popular amongst students, which led to the low price.</p><br/><p>Manager Li proceeded to recommend a variant of the grass sword, called ‘flaming scarlet,’ which he claimed was a best seller. The complete body of the sword was scarlet and it gave off a faint crimson shimmer, like a piece of iron heated in a flame. When waved around, sparks would fly out intermittently. It was like a display of fireworks, extremely beautiful.</p><br/><p>This was the first time that Ai Hui had seen such a dazzling grass sword and he was surprised. Upon taking a closer look, his expression changed, as the crimson shimmer of the sword was not hot to touch; instead, it was cold. And the sparks were, in fact, grass seeds.</p><br/><p>Manager Li said that the wood elementalists who breed the red grass did not manage to sell any of it in the beginning. The quality of the red grass was mediocre, so the swords created from it were also of average quality. However, Manager Li had good foresight and he bought over its selling rights. He then brought the swords over to the Induction Ground where it quickly became a favorite. Those experienced swordsmen, who roamed the Wilderness, were not fond of flashy and impractical swords, but the students, who did not engage in real battles, loved them and felt that the Flame Scarlet Grass Swords were very dashing and stylish.</p><br/><p>Ai Hui gave a thumbs up.</p><br/><p>I like your unscrupulous thinking!</p><br/><p>Bunny Hair, I am depending on you now!</p><br/><p>After returning to the training hall, Ai Hui unfolded the materials that Teacher Xu had given him, but when he discerned the exact location of the practicum, he was slightly startled.</p><br/><p>The Induction Ground used to be the military front, but owing to the expansion of the Avalon Of Five Elements, the Induction Ground ended up as the rear. But its position was closer to the Old Territory, and the expedition’s destination was at its fringes.</p><br/><p>The Old Territory...</p><br/>\n</div>"}