{"title": "Chapter 127: Si Nan’s Journal", "id": 127, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-127-si-nan%E2%80%99s-journal", "volume_title": "Volume 2", "body": "<h1>Chapter 127: Si Nan’s Journal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 127: Si Nan’s Journal</p><br/><p>Translator: TYZ Editor: - -</p><br/><p>It was the fifth day. Ai Hui noticed that the movements outside had decreased, and he guessed that the Induction Ground must have taken action.</p><br/><p>He made sure to tell this to everyone as he knew that they needed a boost in morale right now. If not for the terrifying roars of the wild beasts outside, there would be people here taking action. However, no one had the courage to go out when they heard those furious roars.</p><br/><p>Ai Hui’s conjecture significantly raised the spirits of those downcast students. They already had faith in Ai Hui’s judgments since the beginning of this excursion.</p><br/><p>In such a cramped and dark environment with foul and dirty air, every day was akin to torture.</p><br/><p>On the sixth day, Ai Hui and the rest of the students were finally rescued by Li Wei and his rescue team.</p><br/><p>When everyone finally walked out of the mound, they felt as if it had been a lifetime. The surrounding terrain had undergone massive changes; the initial lush and verdant forest had been reduced to a barren land with billowing smoke and fumes.</p><br/><p>Ai Hui noticed many people pouring red kerosene onto the trees and plants. Behind them was scorched earth; every inch of land had been torched by the burning kerosene. No plants could ever grow on such a land.</p><br/><p>He was in somewhat of a daze.</p><br/><p>A few days ago, he had been thinking about how peaceful the Induction Ground was; however, after now seeing the charred land, he felt that he had been too naive.</p><br/><p>Ai Hui himself reacted like this, let alone the other students. An ordinary excursion had turned into a terrifying experience.</p><br/><p>After coming out of the mound, many students broke down on the spot. Everyone was crying bitterly. At this point, all they wanted was to return to the safety and warmth of their homes.</p><br/><p>Ai Hui noticed Li Wei pull Teacher Xu and Cui Xianzi to one side. Li Wei told them something, causing Cui Xianzi’s face to turn deathly pale, and her body appeared to be on the verge of collapsing.</p><br/><p>Upon seeing this, Ai Hui was stunned. Actually, when he did not catch sight of Instructor Zhou after coming out of the mound, he knew that something was wrong.</p><br/><p>He was used to witnessing death, but at this moment, he still felt despondent.</p><br/><p>Everyone was assigned to a transport wagon and set off homeward. Li Wei did not follow them as he still had a mission to carry out; there were still lots of people who had yet to be found. A total of five classes had gone on this excursion, but only two classes—Ai Hui’s class and Fatty’s class—had been rescued. One class had been confirmed dead, and the remaining two were still missing.</p><br/><p>After going missing for so many days, their chance of surviving was minimal.</p><br/><p>Yet, no one wanted to give up. Li Wei was greatly encouraged after finding Ai Hui’s and Fatty’s classes.</p><br/><p>When Ai Hui heard that there were still two classes missing, he felt even more downcast. Those of the Wilderness were always mentally prepared for death. Surviving was a gift conferred by the gods, and everyone was apathetic to death.</p><br/><p>However, the Induction Ground was like heaven, peaceful and safe. Ai Hui used to think that the Induction Ground was the best place in the world, and he had even thought about how nice it would be if he got to stay in the Induction Ground forever.</p><br/><p>Li Wei patted his shoulder and told him to go back and have a good rest.</p><br/><p>On the transport wagon, no one had the mood to talk. Sobs could be heard everywhere. Cui Xianzi was seated on one side, staring blankly into space as if her soul had left her body. Her face was as pale as paper, and her hands were clenching onto Zhou Xiaoxi’s bag.</p><br/><p>Ai Hui wanted to console her, but he did not know what to say. The death was so sudden, and she did not even have the chance to bid farewell.</p><br/><p>Ai Hui, who had always thought that he was used to death, could not help but look down.</p><br/><p>As he gazed downwards from the sky, he could see that the jade-green sea of trees had disappeared. The charred ground was like an ugly scar that stretched into the smoky horizon. Fire extended towards the distance, devouring everything in its path.</p><br/><p>The poisoned student was put on an emergency transport wagon as he needed urgent medical treatment.</p><br/><p>However, Ai Hui felt that the chance of that student surviving was not high. He had never seen such a strange type of blood poison. That poisoned student’s body had undergone terrifying mutations.</p><br/><p>For some reason, the blood poison seemed somewhat familiar to Ai Hui. He remembered reading about something similar in a journal.</p><br/><p>But when he tried to think about it, he could not remember any details.</p><br/><p>When Ai Hui finally glimpsed Central Pine City, he was suddenly overwhelmed with emotions.</p><br/><p>It was just that…</p><br/><p>Central Pine City was still the same, prosperous and peaceful. It looked as if nothing had happened.</p><br/><p>At this moment, someone noticed that the transport wagon was not flying in the direction of Central Pine City.</p><br/><p>“Where are you taking us?”</p><br/><p>“I want to go home!”</p><br/><p>“Let us down!”</p><br/><p>The students started to become agitated. Their mental states had already been pushed to the brink of collapse, and when they saw that the transport wagon was taking them to another place, they all went frantic.</p><br/><p>Ai Hui observed quietly from one side. When he saw that Central Pine City was not heavily guarded, he roughly understood what was going on.</p><br/><p>The Induction Ground had instituted a lockdown on information.</p><br/><p>“Teacher Xu, please cooperate with us,” an elementalist said solemnly. “To prevent the spread of the poison, all of you will have to be quarantined for a period of time. Everyone, please try to understand. This is for the sake of everyone’s safety and for all of you.”</p><br/><p>Teacher Xu’s face turned ugly. He didn’t expect to be quarantined just after escaping from that hellhole.</p><br/><p>But the dead-serious look on the elementalist’s face told him that it was an order from the goddamn higher-ups.</p><br/><p>He was clear about the Induction Ground and the higher-ups’ ways of handling such situations.</p><br/><p>So he had no choice but to console the students. He knew that if he let the students carry on stirring up trouble, things that he did not want to see might happen.</p><br/><p>“You want to put a lockdown on information?”</p><br/><p>Duanmu Huanghun suddenly asked. That elementalist’s facial expression slightly changed as he glanced at Duanmu Huanghun. However, he did not disagree, and instead replied plainly, “It’s for everyone’s sake. This is such an enormous catastrophe. Who will be responsible if it creates unnecessary mass hysteria?”</p><br/><p>“Why don’t you disperse everyone?” Duanmu Huanghun replied, meeting the elementalist’s gaze head-on. Without any fear, he asked coldly, “Have you not thought about what will happen if you lose control of the situation? How many people will be implicated?”</p><br/><p>“We will not lose control of the situation.” The elementalist was aware of Duanmu Huanghun’s identity and was careful with his tone. “We have already found a way to deal with this poison.”</p><br/><p>“You figured out a way to deal with the poison?” Ai Hui suddenly opened his mouth and asked.</p><br/><p>Initially, the elementalist had not wanted to divulge anything. However, after seeing the agitation of the surrounding students and that Duanmu Huanghun was staring coldly at him, he decided to reveal a bit of information. “Yes, we found records of a similar poison in the journal of a deceased wood elementalist. The Induction Ground gathered the most powerful wood elementalists in the city and discovered a way to counter this type of poison. This whole situation was an accident.”</p><br/><p>“Accident?” Duanmu Huanghun felt that he had heard a huge joke. It was obviously an enormous disaster, where so many people had died, but this fellow was saying that it was just an accident?</p><br/><p>“Yes. There is a clear record of the formula of this type of poison in the wood elementalist’s journal. Right now, we are performing tests, but from the looks of it, things are proceeding very smoothly.”</p><br/><p>The elementalist was brimming with confidence as he replied to Duanmu Huanghun.</p><br/><p>……</p><br/><p>Ai Hui and the rest were brought to a manor that was roughly forty kilometers from Central Pine City. When they just reached, they were immediately questioned by a few elementalists. It was evident that the security was extremely tight.</p><br/><p>“I hope everyone can stay here at ease. If everything goes smoothly, all of you will be back in Central Pine City very soon. Please surrender all the various types of leaves you have with you. There will be severe consequences for anyone who tries to communicate with outside world without permission. If everyone can cooperate with us, the Induction Ground will compensate for the losses you suffered during this period of time.”</p><br/><p>The elementalist then hurriedly took off.</p><br/><p>“Let’s find a place and sleep,” Ai Hui told Fatty.</p><br/><p>In order to be aware of what was happening outside the mound, Ai Hui hadn’t closed his eyes and had stayed in the sword embryo’s state for six days straight. When he finally loosened his grip on the sword hilt, weakness and fatigue flooded him like a tsunami.</p><br/><p>He casually found an empty room that had a bed and fell asleep the moment he laid on it.</p><br/><p>Meanwhile, Fatty stood guard at the door. He had slept day and night when under the mound, and he now felt as if he could go for days without sleep.</p><br/><p>……</p><br/><p>In a heavily-guarded basement in the Induction Ground.</p><br/><p>The powerful wood elementalists of the Induction Ground had all gathered here. At this moment, they were studying an ancient journal, whose rotten pages revealed its unknown age.</p><br/><p>This was a four-hundred-year-old journal that was left behind by a wood-attributed teacher named Si Nan.</p><br/><p>In this journal, he had recorded his lifetime’s research and knowledge in detail.</p><br/><p>In the course of his research, he had discovered a special phenomenon: except for blood-refined artifacts, all artifacts from the Cultivation Era had now become scraps.</p><br/><p>He had collected a few pieces of blood-refined artifacts, and after carrying out experiments on them, he had discovered that they had the ability to self-repair. No one in current times knew how to use these artifacts, but they had not degenerated like the others.</p><br/><p>They were well preserved.</p><br/><p>This unique phenomenon had aroused Si Nan’s interest. He had proceeded to study many blood-refining manuals of the Cultivation Era and had discovered that blood-refining was entirely different from those mainstream training methods of the Cultivation Era.</p><br/><p>Blood-refining was an ancient training method. Reportedly, it originated from the blood sacrifices that humans had made to the Heaven and Earth when they were just created.</p><br/><p>Si Nan had combined the knowledge he had obtained from his research on blood-refining with that of wood elementalist’s plant breeding.</p><br/><p>He hoped to breed plants that possessed the powers of blood-refining, and he put in a great deal of effort to breed a lot of plants. However, he did not succeed, even until his death.</p><br/><p>After he had passed away, his student had discovered a significant amount of premature plants while tidying up his life’s works.</p><br/><p>His student could not bear to destroy his teacher’s life’s work, but he was too busy to take care of them, so he transplanted these plants to the Garden of Life.</p><br/><p>And that student had recorded this incident in his diary.</p><br/><p>After this disaster had broken out in the Garden of Life, someone had remembered Si Nan’s journal during the initial investigation. Most of the teachers would donate their life’s research and findings to the Induction Ground after they died, and other teachers had the right to read and study them.</p><br/><p>There was more than one person who had read Si Nan’s journal. Many wood elementalists that were gathered here today had also thought of this journal after hearing about the blood poison.</p><br/><p>This was what encouraged the Induction Ground the most—they had found the key to the problem.</p><br/>\n</div>"}