{"title": "Chapter 129: As Seen by Duanmu", "id": 129, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-129-as-seen-by-duanmu", "volume_title": "Volume 2", "body": "<h1>Chapter 129: As Seen by Duanmu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 129: As Seen by Duanmu</p><br/><p>Translator: YH Editor: - -</p><br/><p>Duanmu Huanghun was sleeping when he suddenly heard some activity outside. Fatty’s voice pierced his ears like demonic music.</p><br/><p>Talking about debts again!</p><br/><p>In his semi-conscious state, the voices plucked at the delicate strings of his sanity, making the corner of his eye twitch wildly.</p><br/><p>Just what was this Ai Hui up to? Going around collecting debts? Is he a loanshark?</p><br/><p>Duanmu Huanghun pulled the sheets over his head in an attempt to block the noise. He decided to restrain his curiosity and stay inside—he’d only be asking for trouble if he went out now.</p><br/><p>It hadn’t been easy for them to finally get to safety, so why were these people not resting?</p><br/><p>Duanmu Huanghun was determined to continue sleeping in a bid to repair his damaged psyche. The six days that they were trapped in the mound felt like a nightmare. Although he had appeared to be very calm during those six days, he had actually been terrified. The tension only began to subside after they returned to safety, but by then the post-trauma stress had started to kick in.</p><br/><p>Duanmu Huanghun had felt very muddled throughout the next few days. He had slept lightly and was awakened by even the slightest noise. He would have nightmares all through the night, sometimes waking up from one in fear, unable to discern if he was really awake. Consecutive days of poor sleep left Duanmu Huanghun severely dispirited and devoid of energy.</p><br/><p>He wasn’t the only one experiencing this; the others were going through the same as well. Even Teacher Xu went about with a dazed expression on his face.</p><br/><p>However, Duanmu Huanghun was unable to go back to sleep as the noise outside was simply too loud. Having had enough of it, he promptly erupted in anger, jumping off the bed and dashing towards the door.</p><br/><p>What are these two jokers trying to pull? Can’t they just let the rest of us have some peace?</p><br/><p>When he rushed out of the room, he saw two figures drenched in sweat, standing in the middle of an empty training ground.</p><br/><p>“Two hundred sets of Fluttering Butterfly Steps! If you can’t complete it, I’ll thrash you!”</p><br/><p>“No, please. Please spare me, Ai Hui. Duanmu Huanghun owes you one hundred and fifty million yuan, yet he’s allowed to sleep peacefully. I owe you so much less so please stop torturing me…”</p><br/><p>Upon hearing this, Duanmu Huanghun felt the urge to quickly return to his room.</p><br/><p>This is too…humiliating!</p><br/><p>His face turned bright red. That despicable scoundrel had been going around and smearing his reputation! How hateful! Duanmu Huanghun wasn’t sleepy anymore—all he felt was an overwhelming impulse to go out and fervently earn money.</p><br/><p>How was he going to reclaim his reputation if he couldn’t pay up this one hundred fifty million yuan?</p><br/><p>Duanmu Huanghun glared intensely at Ai Hui.</p><br/><p>“It’s three hundred steps now. I don’t want to hear any more nonsense coming out of your mouth!”</p><br/><p>Ai Hui’s words made the Fatty explode with anger. An unyielding and enraged expression was plastered across his face as he leaned forward, ready to confront Ai Hui.</p><br/><p>Duanmu Huanghun looked on in disdain.</p><br/><p>Does he really think that everyone’s going to just listen to him? Humph. Even a teacher wouldn’t say something this fierce. How can he treat his friends with such disrespect? A civil war was bound to erupt at this rate.</p><br/><p>Looks like there’s going to be a show! Duanmu Huanghun was taking delight in the impending disaster.</p><br/><p>Ai Hui remained expressionless and said, “Come at me if you dare.”</p><br/><p>However, Fatty stared at Ai Hui with rage and suddenly barked. “Woof!”</p><br/><p>“Weren’t you all full of gusto earlier? Weren’t you going to play the hero? Come on, say something vicious to my face!”</p><br/><p>“Woof!”</p><br/><p>“Don’t dare to argue anymore? Tsk tsk, where’s your backbone? Are you terrified now? A hero! Weren’t you acting all brave a moment ago? Where has that bravery gone?”</p><br/><p>“Woof! Woof! Woof!”</p><br/><p>“Bark again and you’ll have to do five hundred more steps!”</p><br/><p>Fatty hopped away from Ai Hui like a bouncy ball of meat, glaring angrily at him the whole time.</p><br/><p>“……” Duanmu Huanghun was at a loss for words.</p><br/><p>Out of the corner of his eyes, Ai Hui noticed Duanmu Huanghun standing under the eave. He was suddenly reminded of the “fellow who owes you a hundred and fifty million” that Fatty had spoken of earlier.</p><br/><p>One hundred and fifty million yuan!</p><br/><p>Ai Hui was greatly annoyed by that damned ingrate!</p><br/><p>He turned his head away and started his own training.</p><br/><p>Ai Hui was keeping an eye on Fatty’s training because he didn’t want him to die so easily. It was okay to be weak if he hid well, but Fatty was weak and loved to meddle in others’ affairs. Fatty may be a cheap person, but Ai Hui didn’t want him to die. After all, who was going to return Ai Hui the money if he did?</p><br/><p>He was all too familiar with Fatty’s character. That guy was lazy, timid, and looked really sleazy. In actual fact, however, he was a sentimental person who always tried to be on good terms with everyone.</p><br/><p>Ai Hui never knew that Fatty had done so many things behind his back, but he was aware that Fatty had come to the Induction Ground to look out for him.</p><br/><p>Ai Hui knew that he couldn’t change Fatty’s character; he just didn’t want him to die.</p><br/><p>Being stronger should help him even when he’s running for his life.</p><br/><p>Ai Hui had always felt that he was more selfish than Fatty. He would always look out for himself first and find a path that was suitable for himself before proceeding with something.</p><br/><p>If Fatty was killed by someone, Ai Hui would definitely seek revenge. If the killer was too strong, then perhaps he would train for a few years before seeking revenge. But if the other party was so much more powerful that Ai Hui felt that there was no chance of winning, he would put his utmost effort…to burn incense and pay his respects.</p><br/><p>Ai Hui was supervising Fatty’s training because he wanted to train as well.</p><br/><p>He was killing two birds with one stone.</p><br/><p>After resting, Ai Hui immediately began his training preparations. There was no time to waste. The six days spent in the mound may have been the most terrifying event of the other students’ lives, but to Ai Hui, it had only helped him understand that life in the Induction Ground was no fairy tale either.</p><br/><p>Life in the Induction Ground was amazing, but there was an unrealistic quality to it that always made Ai Hui wonder if he was just dreaming. The recent incident had lifted a veil from his eyes, serving as a timely reminder of the potential dangers that lurked about even in the Induction Ground. This was the reality that had eluded him.</p><br/><p>Not only did the danger not make him panic, but it had also helped him find inner peace.</p><br/><p>No matter how perfect his life in the Induction Ground would appear, it wasn’t a life that Ai Hui was used to. He had always felt a nagging uneasiness. Now that the Induction Ground had become more dangerous in reality, he was back to a familiar way of life. He truly felt comfortable in his new surroundings.</p><br/><p>Ai Hui quickly adapted to the changes since it was an experience he was already familiar with. In the Wilderness, he would always train whenever he had time.</p><br/><p>This manor had once been an army camp, so it had excellent facilities for training. It would be a waste to not practice in such an excellent location, especially since he had so much free time.</p><br/><p>Ai Hui was very mindful of his time and would never tolerate wasting it.</p><br/><p>Furthermore, exchanging blows with Fatty gave Ai Hui a surge of motivation.</p><br/><p>Fatty had only activated his right hand palace but was able to execute recoil and drifting techniques quite beautifully. Ai Hui had specially asked Fatty about this, and he learned that Fatty had grasped the techniques on his own through repeated attempts. Learning how to escape more effectively had always been Fatty’s biggest priority when it came to training.</p><br/><p>Ai Hui approved of Fatty’s thinking.</p><br/><p>His own thirst for more power stemmed out of his desire to survive. Fatty’s focus on escaping was also for survival. The two of them were, in essence, pretty similar.</p><br/><p>Beating Fatty in those last few rounds helped Ai Hui understand Fatty’s thought process. Besides that, he also discovered some changes within himself.</p><br/><p>The sword embryo seed’s transformation.</p><br/><p>During the six days spent in the mound, Ai Hui had never once let go of his sword and was constantly in the sword embryo’s state. At that point in time, his focus was on self-preservation, but he now realized that activating the state for six days had caused the sword embryo to undergo a change.</p><br/><p>His sixth sense had become even sharper than before. Even when he wasn’t in the sword embryo’s state, Ai Hui’s sixth sense was now as keen as it was in his previous sword embryo’s state.</p><br/><p>If he were to wield a sword now...</p><br/><p>Ai Hui lifted his sword and slowly closed his eyes.</p><br/><p>He felt as if the grass sword had become an extension of his body. He was able to feel the ambient temperature and airflow around the sword through the sword itself—this was something that he couldn’t possibly have done before.</p><br/><p>As Ai Hui started to circulate the elemental energy within his body, he was amazed to discover that the grass sword in his hand had an extremely high affinity with his elemental energy. Before Ai Hui could fully grasp what was happening, his elemental energy was already pouring into the grass sword.</p><br/><p>The sawtooth grass sword in Ai Hui’s hand started to faintly glow. The understated shine of this grass sword meant that it wouldn’t reflect much light when brandished, something Ai Hui liked very much as it gave him an advantage when fighting at night. His biggest concern wasn’t how dazzling or brilliant a sword was, but whether it could pierce his enemy.</p><br/><p>This time, however, the faint glow emerging from the grass sword could be seen even under the strong sunlight.</p><br/><p>Ai Hui discovered that he could actually sense that the grass sword had a saturated feeling to it, but he was unsure why.</p><br/><p>It was similar…it was similar to the feeling he had at the noodle shop when he ate ten bowls of noodles in one go.</p><br/><p>Can a sword feel full?</p><br/><p>Ai Hui couldn’t help but laugh, but the feeling was very sharp and distinct. Like a big fellow who needed to take a stroll after eating a lot, Ai Hui subconsciously thrust out the sword in his hand.</p><br/><p>One stroke after another.</p><br/><p>Every stroke was simple and unadorned.</p><br/><p>Ai Hui soon noticed that the sword’s point was experiencing some sort of resistance—it felt as if he was stabbing the sword through water.</p><br/><p>This feeling became more and more intense with each stroke becoming ever more laborious. The sun at noon was ferocious, and Ai Hui’s forehead was now drenched in sweat. Beneath the bandages, his muscles were all trembling.</p><br/><p>Standing under the eave, Duanmu Huanghun blankly watched the two of them dripping with sweat under the scorching sun.</p><br/><p>These two people…</p><br/><p>He initially thought that Ai Hui was only tormenting Fatty on purpose to vent his anger. Duanmu Huanghun didn’t expect Ai Hui to actually start training as well.</p><br/><p>He didn’t anticipate this at all.</p><br/><p>The harrowing experience in the Garden of Life was like a recurring nightmare, draining him of his vitality. Being placed here under quarantine only made his imagination run wild, causing him to become even more uncertain of what was going to happen. Under such circumstances, how could anyone possibly still want to train?</p><br/><p>It wasn’t just him—the other students were the same. Everyone was dispirited and listless, clearly still affected by the traumatic incident.</p><br/><p>Yet these two jokers had already started training...</p><br/><p>The midday sun was so vicious that it was hard to even open one’s eyes. The rest of the students were hiding in their dark, shady rooms while Ai Hui and Fatty were busy with their practice in the otherwise empty training ground.</p><br/><p>Duanmu Huanghun thought of just how much they were sweating.</p><br/><p>Fatty’s entire body was drenched with sweat—it was almost as if he had just gone for a swim. His clothes were completely soaked and were clinging onto his body.</p><br/><p>Ai Hui was experiencing the same thing; the grass sword in his hand felt like it weighed a ton. Every stroke of his sword had substantially slowed down, and even Duanmu Huanghun could see that Ai Hui was using every last ounce of his strength.</p><br/><p>Duanmu Huanghun snapped out of his daze feeling ashamed of himself. He was so frail when compared to them!</p><br/><p>Just as he was about to return to his room to start practicing, he glimpsed Ai Hui’s figure out of the corner of his eyes. Duanmu Huanghun’s body immediately froze as his eyes opened wide.</p><br/>\n</div>"}