{"title": "Chapter 143: Money Losing Deal", "id": 143, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-143-money-losing-deal", "volume_title": "Volume 2", "body": "<h1>Chapter 143: Money Losing Deal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 143: Money Losing Deal</p><br/><p>Translator: Cynthia Editor: - -</p><br/><p>Shi Xueman was surprised to see Ai Hui.</p><br/><p>It seemed as if she came across this guy every time she came to the noodle house.</p><br/><p>Instead of saying anything, however, she just found a seat casually and Sang Zhijun sat beside her.</p><br/><p>Sang Zhijun had never been to such a small restaurant and so was very curious. The boys sitting not far away from them were making a lot of noise and the smell in the air made her very hungry.</p><br/><p>The table in front of them was cluttered with tall stacks of empty bowls. Sang Zhijun felt speechless seeing how much the two boys had eaten. She had never before seen anyone eat like them; all men she knew were restrained, elegant, and gentle while eating.</p><br/><p>This was a new experience for her.</p><br/><p>What surprised her the most, however, was Shi Xueman. In her eyes, a goddess would never come to this kind of restaurant. In fact, not only boys, but a lot of girls also regarded Shi Xueman as a goddess.</p><br/><p>Shi Xueman noticed that Sang Zhijun was looking at her and could roughly guess what she was thinking. She simply smiled and didn’t explain further.</p><br/><p>The two boys who were busy eating didn’t notice the presence of other people at all.</p><br/><p>Fatty finally returned to reality and said, “This is great! This is what life should be! Ai Hui, how did you find this restaurant? It’s amazing! I have made up my mind!”</p><br/><p>Fatty’s sudden, loud voice gave Shi Xueman and Sang Zhijun a good scare.</p><br/><p>Ai Hui didn’t have any expression at all. He continued to eat his noodles and said without raising his head, “Made up your mind to pay your debt?”</p><br/><p>Fatty replied, “No, of course not. I’ve decided to stay with you. I have looked into it, and in the second year in the Induction Ground, I can apply for a branch transfer provided the branch college is willing to accept me. You see, I am working so hard these days and I’m sure your branch college will be more than willing to accept me.”</p><br/><p>“Pay your debt first.” Ai Hui sounded emotionless and focused on his noodles, as if all his passion had been exhausted in his effort to distract Fatty just now.</p><br/><p>Fatty glared at him in fury. “Why are you so realistic now?”</p><br/><p>“So you are saying that you won’t pay your debt?” Ai Hui ignored his question.</p><br/><p>“I am going to pay…” Fatty didn’t dare to admit otherwise and decided to convert the topic of their conversation. “Ai Hui, when do you think the blood catastrophe will come to an end?”</p><br/><p>The first thing that came to Shi Xueman’s mind when she saw Ai Hui was not his debt or whether he had found the person she was looking for, but was the message tree. The tree was so old that she could not even trace its origin.</p><br/><p>It was impossible for such an old message tree to not be registered, and she had seen for herself that the tree was healthy with no diseases or infections.</p><br/><p>After the outbreak of the blood poison, all these thoughts were left behind. She only remembered the message tree after seeing Ai Hui.</p><br/><p>To learn more about the tree, she had even asked her family to help investigate the Vanguard Training Hall. They had searched the entrustment in the Mission Hall of Central Pine City and learned that the owner of the training hall was called Heng Bingfeng; it was a name no one knew anything about.</p><br/><p>This was all the information she could get. Apart from this name, no information could be found, not about the message tree or Vanguard Training Hall.</p><br/><p>She had also asked her grandfather, but he hadn’t known anything about this name either.</p><br/><p>When she saw Ai Hui, she couldn’t help thinking about this investigation.</p><br/><p>Then the boys’ conversation about the blood catastrophe caught her attention. Sang Zhijun showed a look of disapproval; she had seen so many boys who loved to talk big.</p><br/><p>The noodles were served just at that time. Shi Xueman began to eat her noodles, but she also continued paying attention to the boys because she wanted to hear what Ai Hui would say. In her eyes, although Ai Hui was not impressive, he was bold,cautious, and had his own opinions.</p><br/><p>“End?” Ai Hui paused for a while. “It will not end soon.”</p><br/><p>At first, Fatty had just wanted to change the topic; he hadn’t expected to hear such an answer from Ai Hui. He thought for a second, then asked, “Why? It’s only blood poison. I think the Induction Ground is powerful enough to find a solution soon.”</p><br/><p>Fatty had confidence in the Induction Ground, just like almost everyone else. The Induction Ground was an enclosed area without complicated conflicts between factions. It possessed strength and the people here were united as one.</p><br/><p>Its most significant feature was its strength. Since the Induction Ground was cut off from the outside world, the environment here was relatively pure. As a result, many masters and well-known people liked to live in seclusion here.</p><br/><p>Besides, there were researchers who studied weird things, countless schools, various new theories, and learned teachers.</p><br/><p>How could the blood poison get the better of the Induction Ground that had such strength?</p><br/><p>At first, Fatty didn’t quite believe Ai Hui. If it were another person who had said this, Fatty would have given a snort of contempt, but since it was Ai Hui, although Fatty was still muttering something, he began to believe it in his heart.</p><br/><p>“I don’t know.” Ai Hui didn’t raise his head and continued to eat the noodles, then said unclearly, “I just have this kind of feeling. What is coming is not good, and it’s coming with menace.”</p><br/><p>“What is coming is not good. It’s coming with menace,” murmured Fatty, then felt an overwhelming sense of danger.</p><br/><p>What is coming is not good. It’s coming with menace.</p><br/><p>Shi Xueman was also thinking about what Ai Hui had said.</p><br/><p>Since Sang Zhijun had regarded them as two bombastic guys from the very beginning, now that she heard this completely unreasonable reason, she further believed that her initial judgment had been correct.</p><br/><p>As a girl, she had been a bit scared of the blood poison all along.</p><br/><p>She didn’t want to hear them talk about this topic any more, but was too shy to ask them to stop. After thinking for a while, she said, “Thank you, Xueman. If it were not for you, I would have been unable to buy the arrows.”</p><br/><p>Shi Xueman recovered from her contemplation and smiled. “It’s not a big issue. Don’t mention it.”</p><br/><p>“I never thought that I could find such excellent arrows in Central Pine City.” Sang Zhijun seemed excited. “Although the name is a bit weird. Bunny Hair Arrows… Anyway, I have known for a long time that the Induction Ground has many undiscovered talents, even in the small cities. This trip has been so rewarding.”</p><br/><p>“Yes, it’s also because you are lucky.” Shi Xueman was happy for Sang Zhijun too. Not every family was like hers and could spend as much as possible on one child, regardless of costs.</p><br/><p>Every family had strict rules on the spending of their young generation, unless the person in question was almost sure to be the successor of the family. The longer the history the family had, the more strict the rules would be.</p><br/><p>If you want to get more, you will have to stand on your own feet.</p><br/><p>In the families that had many children in one generation, graduation from the Induction Ground meant the start of competition. Under similar investments, the ones who could win the competition were more likely to play an important role in the continued extension of the family.</p><br/><p>Even if some of them were not eager to be the successor, their rights and obligations were always equal and the investments of the family on them was never unconditional. They knew sometimes that they needed to obey the requirements of the family.</p><br/><p>Such as making connections through marriage.</p><br/><p>They were like ropes on which their family had spent a lot of resources and money to polish, then make into a part of the family’s net of interest.</p><br/><p>If they wanted to get rid of their family’s restrictions, there was no other way but to bring more interest to the family.</p><br/><p>So if a girl like Sang Zhijun didn’t want to go through with the marriage arranged by her family, she needed to be extraordinarily hard working in order to prove her value. If she was in a high position as a head of a clan and could bring more benefits to the family than what the marriage would bring, the cunning elders of the family would then know and choose the greater benefit.</p><br/><p>But this was definitely a more difficult way.</p><br/><p>Smart children of the big families never gave up working hard. They would be more and more independent and assiduous, and try their best to show their talent and ability. They were clearly aware that was how they could get freedom.</p><br/><p>As long as you could reach the peak, you could do whatever you liked.</p><br/><p>Even if you could not reach the peak, the more freedom you had, the better.</p><br/><p>Sang Zhijun was going to graduate soon and then she would be faced with such problems. This was why she was so cheerful. If wars were not too frequent, the two hundred Bunny Hair Arrows were enough for her to use for two years on the frontline</p><br/><p>Even if she had to join the hunting team in the Wilderness, the two hundred Bunny Hair Arrows could play an important role.</p><br/><p>Seeing this, Shi Xueman believed Sang Zhijun was a clever girl who knew to start preparing from early on. Compared with the more mature girls, the boys on their team were amazingly simple.</p><br/><p>“It’s just, the total price of thirty million yuan is a bit too high for me.” Sang Zhijun looked upset. Her family would never give her so much money.</p><br/><p>“You won’t need the money in the short run,” Shi Xueman said gently.</p><br/><p>Sang Zhijun smiled and responded, “Don’t worry, I always save money because It makes me happy to have a lot of money on hand. This is the first time that I have to spend so much money, so I’m feeling a bit guilty.”</p><br/><p>Now Shi Xueman began to have a completely new appraisal of her. A girl who loved to save money didn’t hesitate to buy so many Bunny Hair Arrows. With such boldness and courage, she was definitely not an ordinary girl.</p><br/><p>Bunny Hair…</p><br/><p>Hearing these words, Ai Hui paused for a while and became filled with joy. Of course he was happy to hear his arrows being praised, even if he was only responsible for providing the silk.</p><br/><p>Wait!</p><br/><p>Thirty million yuan!</p><br/><p>That girl bought thirty million yuan worth of Bunny Hair Arrows!</p><br/><p>Ai Hui’s eyes were fixed on her. He wished he could rush to Manager Li to tell him what he had heard. Thirty million yuan’s worth of Bunny Hair Arrows. She was really rich.</p><br/><p>Hearing the two girls talking, Fatty looked up and was stunned at once. He murmured, “A…Ai Hui, so pretty…”</p><br/><p>Pretty?</p><br/><p>Ai Hui’s eyes could only see money now. He looked up and said carelessly, “Which one are you talking about?”</p><br/><p>“Both.” Fatty’s eyes lit up.</p><br/><p>Ai Hui slapped him on the back of the head and said, “The one who paid was pretty. Do you understand?”</p><br/><p>Whoever was the one to praise the Bunny Hair arrow was prettier.</p><br/><p>Ah, no, whoever bought thirty million yuan’s worth of Bunny Hair Arrows was prettier.</p><br/><p>Fatty glared at Ai Hui and said, “You are bullying me because I don’t have money.”</p><br/><p>“Yes!” Ai Hui nodded. “Or you pay me back the debt.”</p><br/><p>Fatty did not dare to say anything.</p><br/><p>Ai Hui told him sincerely, “Fatty, remember, money is everything. If you don’t have money, you cannot even buy a bowl of noodles. Last time in this noodle house, I met a girl who didn’t take money with her, and in the end I had to pay for her. You know what? If you see any girl who doesn’t bring money with her, you should run away from her as far as you can go.”</p><br/><p>“Why?” Fatty was confused.</p><br/><p>“Because that’s a skank. If you pay for her, you are dead,” Ai Hui said with bitter hatred. “I paid one hundred and fifty yuan for the noodles, but I ended up owing her eighty million yuan. This is a money-losing deal.”</p><br/><p>“Eighty million yuan…” Fatty was dazed. The number was too large and he could not respond.</p><br/><p>Sang Zhijun noticed Shi Xueman’s weirdness and asked with deep concern, “Xueman, are you alright? You don’t look well. Are you feeling uncomfortable?”</p><br/>\n</div>"}