{"title": "Chapter 146: Unleash The Sword", "id": 146, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-146-unleash-the-sword", "volume_title": "Volume 2", "body": "<h1>Chapter 146: Unleash The Sword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 146: Unleash The Sword</p><br/><p>Translator: TYZ Editor: Pranav</p><br/><p>The deep darkness of the night was its best cover.</p><br/><p>Its wingspan was more than one meter. Its dog-sized black-colored body was striped with blood-red streaks, resembling the color of cooled magma. One would not be able to sense its presence in the dark night.</p><br/><p>Its eyes were tightly shut, and it displayed an incredible calmness. The sound waves that it emitted covered the entire street.</p><br/><p>Its target was that human who gave off a unique aura, a dangerous aura, which it could sense coming from his body. Its underdeveloped intelligence did not allow it to understand what exactly was going on. Its killing instinct and strengthened body, which were several times stronger than before, may be the reasons why it was doing this. Its unique flying techniques resembled a whale swimming in the depths of the ocean, making no noise at all.</p><br/><p>The target wanted to escape. This was something that it commonly encountered.</p><br/><p>Its diving speed was extremely fast; the distance between the two parties began to rapidly decrease. Halfway through its dive, it increased its speed abruptly. Its previously closed eyes started to open, revealing a pair of dark red eyes that looked like pieces of glowing iron. Its expression became sinister, and its sharp, snow-white teeth produced a hissing sound in the wind.</p><br/><p>Suddenly, its target stopped running and turned around.</p><br/><p>Escaping was a stupid thing to do, but putting up a resistance would be even more stupid. It could feel the blood boiling within its body, and its bloodthirsty killing intent stimulated it even more.</p><br/><p>It continued to increase its speed.</p><br/><p>Even though Ai Hui, who had placed all his attention on the blood bat, was mentally prepared, he was still frightened by the blood bat’s speed.</p><br/><p>Too fast!</p><br/><p>The eyes of the blood bat created a blur of demonic-red glow in the air. Its speed was so fast that Ai Hui’s eyes could not keep up with it.</p><br/><p>The scarier part was that the sound of the wind it produced was very soft—it only produced a low, snake-like hissing sound as it dived.</p><br/><p>This defied Ai Hui’s logic. From what he knew, the faster a beast flew, the louder the sound it would make. Arrows behaved similarly as well; the more the power of a flying arrow, the louder it would be.</p><br/><p>However, the diving blood bat barely made any sound.</p><br/><p>And the frightening thing was that it was still increasing its speed!</p><br/><p>It doesn't make sense!</p><br/><p>An urge to flee arose in Ai Hui’s mind. He felt that his idea was too naive. How could those two girls keep up with such terrifying speed?</p><br/><p>He forcibly restrained the fear in his mind. At this point in time, he would have no chance of surviving if he escaped. How could his legs outrun something that could fly?</p><br/><p>Moreover, the speed of this beast had surpassed that of any arrows he had ever seen!</p><br/><p>When Ai Hui realized that there was no way he could escape, he calmed down. Just like before, when he knew he had no other options, all distracting thoughts disappeared immediately.</p><br/><p>He held his sword hilt.</p><br/><p>The grip of the Dragonspine Inferno felt very hard and rough. The rope grip of the sword was made by him; after staying in the embroidery workshop for so long, making a simple rope grip wasn’t too difficult.</p><br/><p>The rope grip was rather fitting for his hands as well.</p><br/><p>For some unknown reason, whenever Ai Hui placed his focus on the sword, his mind would calm down immediately.</p><br/><p>He remembered that a lot of swordplay manuals had discussed how a swordsman should treat his sword. Some manuals even stated that swordsmen should craft their own swords, and the whole crafting process should be done by them alone.</p><br/><p>After the crafting was completed, the swordsmen should start a long process of nurturing their newly-crafted swords.</p><br/><p>Other types of cultivators often changed their weapons, but swordsmen would not do that; most of the swordsmen had at most five swords in their entire lives. It was not rare for those swordsmen, who never changed their swords even once in their lives, to develop an ordinary sword into a legendary one.</p><br/><p>Ai Hui felt that it was incredible that his mind could still be distracted at this point in time.</p><br/><p>He did not have the slightest bit of nervousness or fear—it was as if all the danger had been resolved all of a sudden.</p><br/><p>Holding the sword, he could a perceive a sensation from the sword hilt. His mind was tranquil. The previously restless sword embryo had also become calm and vigorous.</p><br/><p>Ai Hui was emotionless. He slightly crouched, hind leg and elbows bent, as he pressed the sword hilt against his chest; the tip of the sword was pointing towards the sky. The body of the sword was so black that it did not even reflect a bit of light. The seven dazzling pieces of red crystal resembled seven mysterious islands that floated out on the dark sea.</p><br/><p>His movements were relaxed, without any signs of danger or vigor.</p><br/><p>A silver color extended outwards from the roots of his hair. His eyes remained indifferent and as calm as still water.</p><br/><p>His inner mind was extremely tranquil.</p><br/><p>Even the faint hissing sounds had disappeared. The sword, which weighed around one hundred kilograms, was firm and steady in his hand, motionless like an unmovable boulder. He could feel the light drafts brush past the tip of his sword as it sliced through the air—it felt as if a river was flowing through his sword.</p><br/><p>Ai Hui was channeling his elemental energy into the sword embryo, continuously expanding and extending his perception.</p><br/><p>Suddenly, however, the experience became different. He could feel the range of his perception begin to shrink, and it continued until he could only perceive his sword. He could now clearly see and feel every fine crack and impurity on the seven pieces of red crystal.</p><br/><p>This kind of feeling was extremely wonderful.</p><br/><p>Not far away, Shi Xueman and Sang Zhijun were shocked upon witnessing the huge transformation in Ai Hui’s aura with their own eyes.</p><br/><p>Especially Shi Xueman, even though she had seen Ai Hui fight before. She could still not forget that magnificent and dazzling sword move from that day; it was the most breathtaking sword move she had ever seen in her life. And, from then onwards, she had been impressed by Ai Hui’s swordsmanship.</p><br/><p>But that was all.</p><br/><p>In an era where swordsmanship was irrelevant, even if one’s sword skills were impressive, it wouldn’t matter much.</p><br/><p>From the day the Avalon of Five Elements was established, there had not been a single Grandmaster Swordsman. Even most of those so-called Master Swordsmen were frauds who self-conferred their titles themselves.</p><br/><p>However, at this moment, Ai Hui was showing her an entirely different perspective on swordsmanship.</p><br/><p>There was no luster, there was no resplendence. Ai Hui was like a statue, a boulder, a still lake.</p><br/><p>Since young, Shi Xueman had encountered many experts, and she was well versed with their characteristics. She knew that the calmer an expert was, the more destructive the storm brewing in him would be.</p><br/><p>Shi Xueman did not dare to look on anymore. The statue-like Ai Hui was emitting an indescribable attractive force, charming people and captivating souls.</p><br/><p>She did not forget her responsibilities. They had only one chance, and if they made a mistake, Ai Hui would perish on the spot. Shi Xueman’s back was shrouded in a faint surging mist, the result of her channeling her water elemental energy to the limit. She was trying her best to lock onto the swooping blood bat, but no matter how hard she tried, she wasn’t able to do it.</p><br/><p>It was simply too fast!</p><br/><p>The blood bat opened its eyes, and Shi Xueman could see a blur of demonic red glow. However, even when she tried her best, she barely managed to catch its afterimage.</p><br/><p>Sang Zhijun subconsciously bit her lips until they bled, and her forehead was dripping with sweat.</p><br/><p>She could not lock onto the blood bat as well.</p><br/><p>Just when Shi Xueman and Sang Zhijun were at their wits end, Ai Hui suddenly unleashed his sword.</p><br/><p>This strike was very slow and light—it looked as if Ai Hui unleashed this attack with zero effort.</p><br/><p>The lightning-fast streak of demonic red glow and Ai Hui’s sluggish sword strike provided an enormous visual contrast.</p><br/><p>Shi Xueman indescribably uncomfortable upon witnessing it; however, her eyes and attention had been involuntarily captivated by Ai Hui’s strike.</p><br/><p>The moment the tip of the sword made contact with the demonic red blur, the sluggishness and extreme speed converged.</p><br/><p>The dark red claw and the black-colored sword tip seemed to have frozen in time.</p><br/><p>Shi Xueman could not describe the awkwardness of this scene. She felt dizzy and nauseous; her chest felt tight, and she was suffocating. She was so sick that she wanted to vomit, and beside her, Sang Zhijun’s body swayed, and her face also became pale-white.</p><br/><p>Boom!</p><br/><p>The violent explosion sent shivers down everyone’s spine.</p><br/><p>A visible ring-shaped billow of air exploded outwards from the point of contact between the sword’s tip and the bat’s bloody claws.</p><br/><p>Ai Hui’s face suddenly became flushed, and it looked as if he was drunk. He gritted his teeth and appeared to say something, but no sound came out from his mouth as he flew through the air, forming an arc in the sky. He proceeded to crash into a nearby wall, causing the entire structure to collapse with a loud rumble.</p><br/><p>The blood bat appeared before Shi Xueman and Sang Zhijun for the first time. Its body was striped with dark-red streaks. However, at this point in time, its sinister-looking face was in a daze.</p><br/><p>Shi Xueman endured the pain in her chest as she knew the crucial moment had arrived. Without hesitating, she channeled all her elemental energy into the pearl between her fingers and shot it out with a flick of her finger.</p><br/><p>With a flash of luster, the pearl in Shi Xueman’s hand disappeared. She then collapsed as if she was drained of all energy.</p><br/><p>On the other side, Sang Zhijun’s face was pale, but her eyes were filled with an imposing battlelust. The Golden Silk Longbow in her hand looked like a crescent moon with the three Bunny Hair Arrows placed upon it. Even though her fingers were clenching the fletchings of the three arrows separately, the arrow heads were in contact with each other.</p><br/><p>The three Bunny Hair Arrows gave off a faint silver glow with a sharpness so unequaled that Sang Zhijun was pleasantly surprised.</p><br/><p>Clink!</p><br/><p>The three Bunny Hair Arrows merged in mid-air and materialized into a dazzling silvery light.</p><br/><p>Compared to Shi Xueman, Sang Zhijun was worse off. After putting all her energy into that attack, she retreated several steps before her legs gave way, causing her to fall down on her backside.</p><br/><p>Shi Xueman’s pearl struck the dazed blood bat, and as soon as it made contact with the blood bat’s body, it disintegrated into a tiny cloud of mist which seeped into the bat’s body.</p><br/><p>The blood bat froze. Both the water and blood cells in its body were beginning to frantically rush towards the tiny cloud of mist. However, it looked as if its body was trying to devour the cloud of mist, which was filled with concentrated elemental energy.</p><br/><p>At this moment, the blood bat was in the perfect position to be struck.</p><br/><p>The silvery light shot out from Sang Zhijun’s bow effortlessly hit the blood bat’s head.</p><br/><p>The silvery light suddenly blew up, causing the bat’s head to explode into countless fragments.</p><br/><p>Its headless body was bubbling with water vapour—it was as if it was dumped into boiling water. The previously strong metallic skin had lost its luster and had dried-up.</p><br/><p>Its body crashed to the ground with a resounding bang.</p><br/><p>A plump silhouette pulled Ai Hui to one side.</p><br/><p>The instant Ai Hui had been sent flying backward, Fatty had already rushed forwards to catch him.</p><br/><p>Ai Hui had fainted.</p><br/><p>Without saying anything, Fatty carried the dusty Ai Hui on his back and dashed frantically in the direction of the training hall.</p><br/><p>“He doesn't even bother to say goodbye, really…” Sang Zhijun muttered as she sat on the ground, staring blankly at Fatty’s retreating back.</p><br/><p>“He must be anxious to save his friend.” Shi Xueman had regained a little of her strength, and she helped Sang Zhijun up from the ground.</p><br/><p>“What should we do now?” Sang Zhijun was exhausted, and her face was dazed.</p><br/><p>“Request for help.” Shi Xueman said, releasing a distress signal.</p><br/><p>She cast a glance in the direction that Fatty had disappeared into and felt a bit worried. How was Ai Hui’s injury?</p><br/><p>His direct collision with the blood bat had been truly amazing...</p><br/><p>He must be fine!</p><br/>\n</div>"}