{"title": "Chapter 155: Message Tree", "id": 155, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-155-message-tree", "volume_title": "Volume 2", "body": "<h1>Chapter 155: Message Tree</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 155: Message Tree</p><br/><p>Translator: YH Editor: Pranav</p><br/><p>Come quickly and take a look?</p><br/><p>Ai Hui put the shield down and asked, “You’re done with your training?”</p><br/><p>Fatty sluggishly answered, “Is anyone ever done with their training? Come quickly, some of the leaves on your message tree are glowing, someone has sent a message. Wow, this is really advanced, I’m really excited to be able to see something so advanced. Please understand that it’s the first time a country bumpkin like me has seen something like this.”</p><br/><p>Message tree?</p><br/><p>Ai Hui paused for a moment, suddenly recalling the nonsensical words that had previously appeared on one of its leaves.</p><br/><p>“I have no idea who among you are still alive, but I know that no one can stop them. They have already completed the necessary preparations. Everything will change in sixty days. Who will protect the Avalon of Five Elements?”</p><br/><p>Ai Hui remembered the message clearly. He had attempted to understand this seemingly nonsensical message several times but to no avail.</p><br/><p>He had felt that the other party was abnormal and should totally see a doctor. Until now, he had thought that the message was just a prank and had buried it somewhere in the back of his mind. However, hearing Fatty mention the message tree reminded him of that message, which he now saw clearly in his head.</p><br/><p>Everything will change...</p><br/><p>Ai Hui inevitably thought of the blood catastrophe. It was most certainly a catastrophe capable of being called an ‘incredible change.’ Hadn’t Central Pine City and the Induction Ground both already changed drastically?</p><br/><p>Wait a minute! If the blood catastrophe was what the other party was referring to...</p><br/><p>“No one can stop them” seemed to indicate that the blood catastrophe was set in motion by some people. Ai Hui let out an angry hiss. He had also once thought that this might have been the case.</p><br/><p>The blood poison needed a period of incubation before it could complete its metamorphosis. The Garden of Life was undoubtedly a good choice. Nobody would notice anything different in a forgotten area flooded with all sorts of strange vegetation. Besides the students that went there for excursions, the Garden of Life was desolate and uninhabited. Moreover, there were no powerful dire beasts out there, only wild beasts. Perhaps the blood poison was extremely weak in its early stages?</p><br/><p>The Garden of Life could be said to be an excellent breeding ground for the blood poison, and it had allowed the poison to continuously spread and transform the blood beasts.</p><br/><p>It was already too late by the time the blood poison started to break out. What’s worse was that the Induction Ground did not have any stationed troops from the elite Thirteen Divisions at the time, thus causing them to be unable to adapt quickly enough to fend off the sudden outbreak.</p><br/><p>The number of coincidences made Ai Hui think that the blood catastrophe was planned, but he promptly dismissed the thought after feeling that he might be too paranoid. Who would deliberately make such a blood poison? What good would it do for them? Ai Hui could not think of a good reason.</p><br/><p>But what if the other party really was referring to the blood catastrophe?</p><br/><p>Ai Hui hesitated for a moment, juggling the strange message around in his mind.</p><br/><p>“I have no idea who among you is still alive” implied that there was a group of people—maybe his friends? It didn’t seem like it though, perhaps it was a group of sorts? “Is still alive” implied that this group of people was either very old or trapped in dire circumstances. Either way, they were people facing death.</p><br/><p>Does the “them” in the message then refer to the people who initiated the blood catastrophe?</p><br/><p>The thing that didn’t add up was the “60 days” mentioned in the message. Ai Hui had gone on the excursion the next day after receiving the message. The blood poison incident had also come shortly after.</p><br/><p>It had been 32 days since Ai Hui had received the strange message, which meant that the blood catastrophe had started 28 days after the message.</p><br/><p>The sender must have postulated incorrectly.</p><br/><p>Or was he not talking about the blood catastrophe?</p><br/><p>“Everything will change” probably meant that the event would create an impact large enough to alter the Avalon of Five Elements. “Who will protect the Avalon of Five Elements?” insinuated that the change wasn’t going to be a good thing, it was more likely a calamity.</p><br/><p>It was this last sentence that led Ai Hui to think of the blood catastrophe. He couldn’t think of any other event that had the ability to drastically change the Avalon of Five Elements.</p><br/><p>But if it, indeed, referred to the blood catastrophe, the timing was an issue.</p><br/><p>“Ai Hui, why are you daydreaming?” Fatty asked as he walked over, deeply concerned. “Are your injuries still not healed? Lan Lan, quickly give Ai Hui a check up.”</p><br/><p>“No problem!” Lou Lan replied, his eyes flashing. “Ai Hui is very healthy!”</p><br/><p>Ai Hui snapped out of his thoughts, mocking himself for overthinking and being paranoid.</p><br/><p>But wait….</p><br/><p>Ai Hui pointed at Lou Lan and questioned Fatty, “What did you call him?”</p><br/><p>“Lan Lan,” Fatty answered matter-of-factly.</p><br/><p>Ai Hui shivered, clearly grossed out. “Lan Lan? Please don’t give me goosebumps. Lou Lan is my sand puppet, you’d better not mangle his name.”</p><br/><p>Fatty innocently replied, “What about Lou Lou?”</p><br/><p>“Why are you not called Dai Dai, then?” Ai Hui could barely spit out those two words.</p><br/><p>“Oh, you know my childhood nickname!” Fatty exclaimed with his eyes opened wide in surprise. “I’ve never told you this before!”</p><br/><p>Ai Hui couldn’t be bothered to continue talking. He pointed to the ironwood shield on the floor. “This is for you.”</p><br/><p>Fatty looked at the ironwood shield lying on the floor, dazed by its great thickness. “Ai Hui, are you sure about this? I’m supposed to use this? Ai Hui, I haven’t seen you for just a few months, and you’ve already forgotten my light and graceful fighting style?”</p><br/><p>“Light and graceful? I think you mean hit and run?” Ai Hui sneered and pressed on without giving Fatty a chance to rebut. “I need someone to wield a shield, and I think you’re the most suitable person to do it. We can’t waste all that flesh, now can we?”</p><br/><p>Fatty replied anxiously, “This is all fat…”</p><br/><p>Ai Hui swiftly interrupted, “Are you doing it? Return me my money if you aren’t going to do it!”</p><br/><p>Fatty slumped his body and pleaded, “Ai Hui, we’ve been brothers for so many years…”</p><br/><p>“You still need to return the money!” Ai Hui said bluntly. “If you cannot afford to pay up then you’d better be my shieldman. You’ll be well fed with noodles and meat, and you can even play with Lou Lan.”</p><br/><p>Lou Lan morphed into three words—“play with you”—that flitted about.</p><br/><p>“Lou Lan is such a good boy,” Ai Hui said, smiling at Lou Lan with the warmth of spring. But an expression as cold as winter immediately took over his face when he turned to Fatty. “You’ve played with this before, time to pick it up again,” he ordered.</p><br/><p>Fatty’s head hung low as he marched unsteadily towards the ironwood shield. The overly-dramatic Fatty looked as if he was part of a funeral procession.</p><br/><p>Ai Hui ignored him and instructed, “Lou Lan, make sure he completes all three hundred sets of shield raises. No dinner for him if he misses even a single set.”</p><br/><p>“The one with the surname Ai!” Fatty shouted through clenched teeth. Gone was the Fatty who was filled with despair, he was now a raging brown bear.</p><br/><p>“No problem! I will not miss a single count!” Lou Lan said happily, clearly excited to be of help to Ai Hui.</p><br/><p>With a bang, Lou Lan morphed into three ‘zeroes’ and started to count.</p><br/><p>Seeing Lou Lan’s new form, Fatty’s expression changed to one of dread. Using a flattering voice, he promptly whispered, “Lan Lan, think of all the fun we had just now, aren’t we good brothers? Good brothers should help each other out. Come on, help me count a few free sets and I’ll play with you in the future.”</p><br/><p>Fatty immediately noticed the sand figures changing swiftly, making him beam with joy.</p><br/><p>Bang!</p><br/><p>The numbers suddenly returned to zero.</p><br/><p>Fatty was stunned.</p><br/><p>“Add another hundred sets! That’s four hundred sets together! Miss one set and there’ll be no food for you!”</p><br/><p>Ai Hui’s voice boomed from behind. Fatty trembled as Lou Lan displayed “400.” As if he was afraid that Fatty couldn’t see it clearly, Lou Lan doubled the size of the numbers and brought it right in front of his eyes. The sand counter then reset to “000.”</p><br/><p>“They’re all in this together… crooks working hand in glove with one another.”</p><br/><p>Fatty ranted on as he brandished the shield.</p><br/><p>Ai Hui took a glance at Fatty and smiled. Ai Hui knew best just how lazy this fellow could be. He would definitely not stand if he could sit, and he definitely wouldn’t sit if he could lie down. One of these days, he would succumb to his laziness.</p><br/><p>All men must die eventually.</p><br/><p>Nobody would have cared if Fatty had just died quietly somewhere, but it was just his luck to have bumped into Ai Hui.</p><br/><p>Ai Hui had a premonition that the blood catastrophe had only just started. The blood beasts outside of the city were growing stronger, while the situation within Central Pine City was worsening. Without the Thirteen Divisions, the only people they could depend on were the teachers, students, and the guards of the training grounds. Was this really enough to repel the beasts?</p><br/><p>Ai Hui wasn’t sure, but he knew that Central Pine City was no longer the peaceful city he once knew. It was now a battlefield.</p><br/><p>Everyone needed to fight for their own destiny.</p><br/><p>Ai Hui knew that Fatty was a coward who would flee at first sight of danger, so he did not mention much else. However, the blood poison had already spread to the Induction Ground, so where could they flee to?</p><br/><p>There was nowhere to run.</p><br/><p>Ai Hui looked at the message tree and saw one of its leaves glowing as if it was breathing. It was the same leaf as before.</p><br/><p>Ai Hui grabbed a pen from his room before walking towards the tree.</p><br/><p>Somehow, he found himself unusually nervous.</p><br/><p>He felt as if a riddle was about to unravel before his eyes.</p><br/><p>“Are you still alive?”</p><br/><p>Ai Hui read the four words several times. He thought about his experiences over the past few days, which now felt like an eternity ago. To be honest, the battle at the Garden of Life hadn’t had much of an impact on him. He was, after all, not new to this game. He might be weak, but he was experienced in combat.</p><br/><p>Witnessing the drastic changes that befell Central Pine City was what truly affected him.</p><br/><p>A dreamscape was shattered.</p><br/><p>Ai Hui could sense the sender’s urgency, so he lifted his pen and began to write.</p><br/><p>“I’m still alive.”</p><br/><p>He stared at the black ink fading into the leaf, reminding himself to be as patient and calm as he used to be while hunting dire beasts in the Wilderness.</p><br/><p>A short while later, the leaf on his hand lit up again. “Thank the heavens you’re alive! Can you tell me where you are now? How is the Avalon of Five Elements doing?”</p><br/><p>Ai Hui pondered over what to reply before putting his pen to the leaf.</p><br/><p>“Are you referring to the blood catastrophe? The situation has gone out of control, with the Induction Ground being dragged into it. Who are you?”</p><br/><p>Being cautious, he didn’t reveal his location. He had no idea if the other party was well-intentioned or malicious, trustworthy or otherwise. Also, if the “you” that was mentioned in the first message referred to a group, they would very likely be enemies with the people who unleashed the blood poison.</p><br/><p>Ai Hui remembered the noodle shop girl telling him that this message tree was ancient.</p><br/><p>He had a feeling that this message tree had a complicated past. The people and circumstances that were entwined with it were definitely not minor characters like himself.</p><br/><p>He had no interest in becoming a part of such matters.</p><br/><p>All he wanted to do was survive—to make it out of this blood catastrophe alive. He was just like everyone else, desperately grasping at straws to prevent himself from drowning.</p><br/><p>Ai Hui was a little distracted. How would the other party reply? Is the blood catastrophe really man-made? Why? Why would anyone do such a thing?</p><br/><p>He patiently waited for an answer.</p><br/><p>The reply took a bit longer this time.</p><br/><p>Ai Hui came back to his senses as the leaf began to glow again.</p><br/><p>Had fate finally revealed its hand?</p><br/>\n</div>"}