{"title": "Chapter 173: The So-Called Master", "id": 173, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-173-the-so-called-master", "volume_title": "Volume 2", "body": "<h1>Chapter 173: The So-Called Master</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 173: The So-Called Master</p><br/><p>Translator: TYZ Editor: X</p><br/><p>Central Pine City was bound for disappointment. They had waited for a long time, but no master had arrived.</p><br/><p>The dean looked down, revealing an unconcealed disappointment.</p><br/><p>Wang Zhen was disappointed as well. However, his facial expression looked extremely calm. He glanced at the dean and said deeply, “Let’s go. We need to study the movie bean that was brought back and see what the situation is inside.”</p><br/><p>The dean got ahold of himself and forced a smile.</p><br/><p>In order to obtain this movie bean, they had suffered such a huge loss. Its value was immeasurable.</p><br/><p>All the reputable and powerful individuals were gathered for this meeting. Wang Zhen clearly knew that if he could not get their support for the subsequent battles, Central Pine City would have no chance of surviving.</p><br/><p>The enormous meeting room was fully packed, but at the moment, there was dead silence in the room.</p><br/><p>The faces of those who participated in the meeting were pale-white. They were looking at the video on the screen with fear. It was as if a noose was tied around each of their necks, causing them to have breathing difficulties.</p><br/><p>Those hideous and sinister plants looked as if they were from another world. No, they were from hell.</p><br/><p>The thick hanging roots of the trees resembled gigantic blood vessels. One could even see blood pumping and flowing within them.</p><br/><p>A wave of alarmed cries swept across the meeting room. Involuntarily, some people even stood up in trepidation.</p><br/><p>“Oh my god, what’s that?”</p><br/><p>“Is it blood inside them? That’s too scary! Is this even considered a tree?”</p><br/><p>Even the wood elementalists, who were used to seeing various weird plant species, had their faces blanch. Their eyes contained nothing but fear. It was almost like they could smell the strong and nauseous odor of blood just by watching the video. They could not understood why the plants outside of the city had become such monstrosities.</p><br/><p>When everyone saw the densely-packed hanging roots rise up like a bunch of snakes and bind an elementalist, a cold shiver went down their spines.</p><br/><p>A few chairs flipped over. Those who fell to the ground were trembling nonstop with fear.</p><br/><p>No one was laughing at these people because everyone was staring fearfully at the screen with their eyes wide open. Everyone finally understood why they suffered such a huge loss.</p><br/><p>Initially, the elementalist that was bound by the hanging roots was struggling with all his might. However, as the red-colored liquid started to pump into him, his struggling became increasingly weaker. A red flush appeared on his face and his gaze became trance-like, as though he was enjoying the process. Unexpectedly, his mouth broke into a smile, a smile that displayed extreme pleasure and satisfaction.</p><br/><p>The red liquid that flowed through the densely-packed hanging roots that were inserted into the elementalist’s body glowed with a red fluorescence. As the glow reached his face, his smile became indescribably weird and sinister.</p><br/><p>Everyone’s heart stopped beating, as if their hearts were being tightly gripped by an invisible hand.</p><br/><p>Their minds were blank and their hair stood on end. They had even forgotten to breathe.</p><br/><p>Pop!</p><br/><p>The sinister smile suddenly exploded in front of them on the screen. Everyone was dumbstruck. When they returned to their senses, they saw brain matter and blood strewn all over the place.</p><br/><p>Blargh…</p><br/><p>Nearly half of the participants in the meeting covered their mouths and puked without pause. The entire meeting room was filled with the odor of vomit. However, at this moment, no one cared anymore. Those who did not puke stared blankly at the screen with deathly white faces. Their hands and feet were unconsciously trembling.</p><br/><p>A lot of people wanted to escape from the meeting room, but their legs would not listen to them.</p><br/><p>Wang Zhen had a solemn look on his face. He did not mock these people’s reactions at all.</p><br/><p>When he first saw this segment of the video, his reaction was not much better than everyone else’s. He thought that nothing could frighten him since he, himself, had experienced bloodshed and numerous battles.</p><br/><p>He had not realized how wrong and naive he was until today.</p><br/><p>“Let’s switch to a new meeting room,” Wang Zhen told his subordinate.</p><br/><p>.....</p><br/><p>There was absolute silence in the new meeting room.</p><br/><p>These reputable individuals were covered in vomit. Each of them was holding a cup of hot water, as if it would make them feel better. They were in despair and their faces were ashen.</p><br/><p>“From what we observed, this should be the way they transform. Take note of the bulges on the tree branches. Did all of you notice that there are many bulges? When the hanging roots move, these bulges move as well. The wood elementalists who are studying this phenomenon think that these bulges are created when devouring blood fiends or blood insects. To be precise, the smaller and weaker blood insects will act as nutrients for the larger and stronger blood fiends’ transformation. This conjecture can be proven by the fact that our scouts did not discover any blood fiends or blood insects on their trip outside of the city.</p><br/><p>Only the mayor’s voice resounded through the dead silence of the meeting room.</p><br/><p>“Right now, it’s extremely possible that a batch of even more powerful blood fiends or blood insects are being created. That means, from now onward, we will encounter stronger blood fiends. Our situation will be even more challenging. The time that we will be tested is arriving soon,” Wang Zhen looked around the room and announced.</p><br/><p>“Can’t we run away? Travelling on the ground might be hard, but what about escaping through the sky?” someone asked feebly.</p><br/><p>“Where can we run to then?” Wang Zhen questioned back. “How big is the Induction Ground? Can we really fly out of here? Furthermore, we might encounter flying blood fiends. Don’t forget about the blood bat from before. If we lose the city walls, how long do you think we can last?”</p><br/><p>The person who asked that question was dumbstruck. After some commotion, the room returned to its state of absolute silence.</p><br/><p>The meeting was very successful. Wang Zhen’s suggestion garnered everyone’s support. They all knew that their individual powers did not matter at this crucial juncture. They could only unite and work together.</p><br/><p>Upon seeing that everyone left the room in despair, the dean could not help but say to Wang Zhen, “By behaving like this, you will cause panic.”</p><br/><p>Actually, the dean did not support the idea of letting these people watch the scary video. He knew how mentally weak these people were.</p><br/><p>Wang Zhen did not seem to care. “If they panicking, let them. At this point in time, only panic can make them abandon those impractical thoughts. Otherwise, do you think they would put in the effort to fight against the enemy?”</p><br/><p>The dean knew Wang Zhen was right, but he was still worried. “Panic will make them crumble easily.”</p><br/><p>Wang Zhen turned his head abruptly and replied, “Do you know what you should do to survive on a battlefield? Don’t think too much and move forward. Those who crumble easily are fated to die. Who can do anything about that?”</p><br/><p>The dean was silent.</p><br/><p>At this moment, both of them noticed that two people were walking toward them. They were Han Yuqin and Mingxiu from the Jade Embroidery Workshop.</p><br/><p>“Good afternoon, Master Han,” Wang Zhen and the dean greeted at the same time.</p><br/><p>For those who became masters, people would add the title “Master” to their surnames as a form of respect.</p><br/><p>Any master, regardless of their field, enjoyed an extraordinary status. Whether one was a dean or a mayor, he or she had to display a certain level of respect toward a master.</p><br/><p>Even though they wished that Han Yuqin was a combat master and not an embroidery master,, they would not treat her with less respect at the current time.</p><br/><p>Regardless of the field, a master had an extremely deep understanding of elemental energy. Naturally, Han Yuqin’s fighting capabilities would not be comparable to a combat master’s. However, her fighting capabilities would still be superior to an average elementalist’s. An average elementalist’s understanding of elemental energy could not be compared to a master’s.</p><br/><p>Even her disciple, Mingxiu, had rather terrifying fighting capabilities. Mingxiu was from a noble family. Her family had many talents and she had a very powerful elder brother. Previously, during the naked streaker incident, the fighting capabilities that Mingxiu displayed were so powerful that she struck fear in everyone’s heart.</p><br/><p>Han Yuqin and Mingxiu came here as the representatives for the Jade Embroidery Workshop. Wang Shouchuan did not come.</p><br/><p>Wang Zhen admired them in silence. While one was old and the other young, these two women were still much more calm and composed when compared to the others, though they still looked somewhat afraid.</p><br/><p>“Good afternoon dean. Good afternoon mayor,” Han Yuqin greeted them back. She then sighed. “I didn’t expect the situation to worsen to such a critical state. Mayor, you’re right. Everyone needs to unite and work together if we want to possibly survive this ordeal. Mayor, feel free to use anyone from the Jade Embroidery Workshop, including Mingxiu and I. If you need us to do anything, feel free to tell us.”</p><br/><p>“Mayor, feel free to let us know if there’s anything we can help with,” Mingxiu added.</p><br/><p>Wang Zhen was overjoyed at the good news and bowed. “Thank you Master Han and Miss Mingxiu!”</p><br/><p>Previously, he did not dare to request help from the Jade Embroidery Workshop. How could he request for an embroidery master to fight on a battlefield? This would be disrespectful to her and he did not have the balls to do so. It was the same regarding Miss Mingxiu, he did not dare to ask her due to her status.</p><br/><p>Right now, with the approval from both of them, he seemed to have gained two powerful allies.</p><br/><p>“Mayor, you’re too courteous.” Han Yuqin continued to say, “I’m a complete stranger to fighting on a battlefield. However, if it’s about defending a city, I might have some ideas.”</p><br/><p>Wang Zhen was surprised at these words, but he quickly said, “Master Han, please elaborate.”</p><br/><p>Han Yuqin thought for a while before replying, “The first thing I can think of is a spell formation previously mentioned by my husband. The art of spell formation has long since vanished along with the Cultivation Era and I’m not proficient in it. However, the logic applied should be the same. If there’s a workable spell formation now, it would be [Elemental Energy Distribution-Connection Formation]. It’s somewhat similar to embroidery. The only difference is that we would treat the sky, earth, mountains, and rivers as the ‘cloth.’ The sky, earth, mountains, and rivers might be too vast, but if we treat the city as the ‘cloth,’ I might be able to do it.”</p><br/><p>Wang Zhen was stunned. He was looking blankly at the calm-looking Han Yuqin.</p><br/><p>Treating the city as “cloth”… Was this the lofty quality of an embroidery master?</p><br/><p>Currently, Han Yuqin’s petite and aged stature became imposing in his heart.</p><br/><p>“Master Han, please give it a try!” He submitted willingly to her and bowed deeply.</p><br/><p>The dean was also convinced and bowed. “Master Han, please give it a try!”</p><br/><p>.....</p><br/><p>Outside of Central Pine City.</p><br/><p>The red-dressed girl looked at the rattan balls that were hanging on the tree in front of her. She specially found this batch of blood fiends from up to 100 kilometers away. This time around, she did not care about the quality of the blood fiends, but rather the quantity.</p><br/><p>The turn of events in the valley had completely disrupted her plan. Central Pine City was no longer her ideal choice.</p><br/><p>She was not Tian Kuan.</p><br/><p>She did not have much time to waste. Otherwise, she would not be able to catch up and would lag behind everyone else.</p><br/><p>However, she refused to forgive herself for leaving without doing anything.</p><br/><p>As such, before she left, she prepared a huge present for Central Pine City.</p><br/><p>She flew up in the sky and looked at the distant Central Pine City. The image of a young man appeared in her mind, and she bewitchingly smile. “I will be back for you.”</p><br/><p>She turned around and disappeared, like a wisp of ethereal red smoke.</p><br/>\n</div>"}