{"title": "Chapter 191: War Trophy", "id": 191, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-191-war-trophy", "volume_title": "Volume 2", "body": "<h1>Chapter 191: War Trophy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 191: War Trophy</p><br/><p>Translator: TYZ Editor: Lis</p><br/><p>One more thing to be done?</p><br/><p>Everyone was confused as they waited for Ai Hui’s next order.</p><br/><p>\"We have to capture a blood ant alive,\" Ai Hui spoke rapidly as he brandished his Dragonspine Inferno continuously and surged towards a blood ant. \"Listen to my commands.\"</p><br/><p>There was no time to waste on the battlefield. It didn’t take long before the remaining blood ants pressed down on Ai Hui and the others.</p><br/><p>\"Run!\"</p><br/><p>Ai Hui turned around abruptly and started running.</p><br/><p>Upon seeing this, everyone followed suit and ran without hesitation.</p><br/><p>The blood ants pursued behind them tightly. With their low intelligence, they based their actions on instinct, so as soon as they saw Ai Hui and the others running away, they went after them with lightning-like speed!</p><br/><p>Mist drifted from Shi Xueman’s back, and her speed increased sharply. She brushed past Ai Hui, leaving him far behind.</p><br/><p>Sang Zhijun resembled a lithe and agile bird with her clothes fluttering in the wind as she similarly blew past Ai Hui.</p><br/><p>\"Come on.\" She smiled at Ai Hui.</p><br/><p>From under Duanmu Huanghun’s feet, a glowing green flower pattern was spinning. He flew through the air as if running on a level road. At first glance, he didn’t seem fast, but he gradually bypassed Ai Hui. Without looking back, he gave a cold sneer. \"Ahh….\"</p><br/><p>Ai Hui was dumbstruck. He had become the last one.</p><br/><p>Behind him, the blood ants were pursuing him relentlessly, and in his ears sounded the incessant hissing. He trembled in fear and dashed forward frantically.</p><br/><p>It was at this point in time that he realized his weakness. He never learned an escaping technique! He was relatively fast in short distances, and this was why no one had noticed until now that Ai Hui’s running pace was neither nimble nor fast.</p><br/><p>And so when the running distance was pushed to a hundred meters, his weakness revealed itself.</p><br/><p>His base level had risen too quickly, exposing his many shortcomings. Compared to Shi Xueman and the others who had a balanced growth, Ai Hui was clearly unbalanced in his developments. All his time was spent on sword moves; he had to find a chance to learn a few escaping techniques. He placed great importance on anything that would ensure his survival.</p><br/><p>He undoubtedly had to learn how to use azure wings in the future….</p><br/><p>This bunch of fellows… was too much!</p><br/><p>Ai Hui felt the blood ants behind him approaching closer and closer, and so he exerted all of his strength into running as quickly as possible.</p><br/><p>Like a drill, his right leg dug into the rubble-filled ground. Boom! The ground under his feet suddenly exploded, sweeping up a tidal wave of dust that reached a height of three meters.</p><br/><p>Making use of this explosive force, Ai Hui’s speed rose sharply.</p><br/><p>He flitted forward at an extreme speed. His left leg behaved like a drill once more, digging ferociously into the ground.</p><br/><p>Boom! Dust diffused into the air.</p><br/><p>Ai Hui was akin to a heavy beast. He surged forward frantically, and with every step, he stirred up towering waves of rubble.</p><br/><p>The students watching from afar were stunned at the sight. Shi Xueman was fast as lightning while Sang Zhijun was lithe and agile. Duanmu Huanghun flew gracefully through the wind. And as for Ai Hui, there were no techniques involved in his sprinting. His violent and imposing manner while running was driven by his capricious mule-headedness.</p><br/><p>With every step he took, the ground quaked and the mountains shook.</p><br/><p>In a blink of an eye, he covered a distance of one hundred metres.</p><br/><p>\"Lou Lan!\" Ai Hui yelled.</p><br/><p>\"Lou Lan is coming!\" Lou Lan cheered as he shot out the chili concoction in his hands, creating an immense cloud of red mist.</p><br/><p>Like a cannonball, Ai Hui landed headfirst into the topsoil behind Lou Lan. Boom! The soil flew up into the air from the powerful force.</p><br/><p>Ai Hui managed to use this momentum to change his direction before he then roared, \"Get ready!\"</p><br/><p>The blood ants emerging from the curtain of dust and soil were doused in the chili concoction, and chaos descended once more. This time around, however, they continued to instinctively fly towards Ai Hui and the rest.</p><br/><p>Ai Hui flipped his sword and used the side of the blade to strike one of the incoming blood ants.</p><br/><p>It arced towards Shi Xueman.</p><br/><p>\"Stop the ant!\"</p><br/><p>Shi Xueman spun Cirrus in her hand lightly, and a cloud of mist engulfed the blood ant, slowing it down as if in a pit of quicksand.</p><br/><p>\"Use [Viridescent Flower] to tangle it up!\"</p><br/><p>\"Use your arrows to stop the rest of the blood ants from advancing!\"</p><br/><p>By now, Duanmu Huanghun had nearly used up all of the elemental energy in his body, yet he forced himself to channel the last strand still available. A green vine shot out and lightly tangled up the blood ant from within the cloud of mist.</p><br/><p>Meanwhile, Sang Zhijun’s Golden Silk Longbow explosively shot out numerous dazzling streaks of light, stopping the other blood ants from advancing.</p><br/><p>Ai Hui leapt into the sky and surged towards the blood ant that was engulfed in the cloud of mist.</p><br/><p>\"Withdraw your spear!\"</p><br/><p>Upon hearing Ai Hui’s command, Shi Xueman withdrew her spear without any hesitation.</p><br/><p>As soon as Cirrus’ suppression was lifted, the blood ant became agitated. The green flower vine executed with the last of Duanmu Huanghun’s elemental energy also loosened bit by bit.</p><br/><p>Just as the blood ant was about to escape from the vine, a snow-white bandage suddenly shot down from the sky.</p><br/><p>The snow-white bandage rapidly wrapped around the blood ant, and in the blink of an eye, the blood ant was firmly tied up with only its head revealed. With its body unable to move a single inch, the agitated blood ant could only stare ahead blankly. Though its mouth continued to gnash, it wasn’t able to bite into anything. Every joint in its body, except for its neck, was tightly bound.</p><br/><p>Ai Hui looked on with satisfaction at his work, the mummified ant.</p><br/><p>Carrying his war trophy, Ai Hui yelled happily, \"Run faster!\"</p><br/><p>Shi Xueman remained the fastest one, while Sang Zhijun was as graceful as ever. Only Duanmu Huanghun, who had lost all remnants of elemental energy, could no longer fly elegantly like before. He could only frantically run on the ground now.</p><br/><p>\"Despicable!\" Duanmu Huanghun was fuming with rage.</p><br/><p>The beast-like Ai Hui kicked sand all over Duanmu Huanghun’s face as he zoomed past him. The sound of a cold sneer could be heard, \"Ahh….\"</p><br/><p>After chasing them down for several meters, the rest of the blood ants turned and retreated. Even with their low intelligence, when they saw the densely packed humans at the entrance of the street, they knew it was not a good decision to continue forward.</p><br/><p>Several units had gathered at the street entrance, preparing to launch the next wave of attacks.</p><br/><p>They had witnessed the battle carried out by Ai Hui and his unit with their own eyes and were aroused into excitement. When the last person from the A-1 unit arrived safe and sound, they broke into thunderous cheers; every one of their gazes were aimed at the A-1 unit with the utmost respect.</p><br/><p>\"I believe all of you can see that the blood fiends are not victorious. As long as we are courageous and united, we can drive them away from Central Pine City!\"</p><br/><p>The supervising elementalist arrived just in time to encourage everyone.</p><br/><p>The morale of the units rose sharply!</p><br/><p>The blood ants were certainly powerful, but the students knew that they were not undefeatable. Only, they were affected by the combat and the fear of the unknown.</p><br/><p>When the supervising elementalist noticed Fatty with his enormous fire vat, he couldn’t help but do a double-take. His appearance was indeed unique.</p><br/><p>As he approached the large fire vat, he was greeted by the strong scent of chilies. Surprised, he asked, \"Chilies?\"</p><br/><p>\"Yes, sir,\" Ai Hui replied.</p><br/><p>\"The blood ants are scared of chilies? Wow, I never thought of that. How did you come up with that?\" The elementalist was extremely surprised.</p><br/><p>Ai Hui recounted the incident of Fatty and the Dragon Soup. When the elementalist heard that he had finished an entire cauldron of Dragon Soup in one go, he couldn’t help but stare at the fatty as if looking at a ghost.</p><br/><p>Ai Hui’s recounting of the event was clear and concise, drawing a satisfied expression from the elementalist.</p><br/><p>\"I will report this to the mayor. If it’s proved to be effective, all of you will be rewarded for your meritorious service to the city.\"</p><br/><p>Ai Hui expressed his gratitude, \"Thank you, sir.\"</p><br/><p>Duanmu Huanghun and the others were somewhat disapproving of Ai Hui’s attitude towards the supervising elementalist. To them, the elementalist was insignificant in their eyes, but it was different for Ai Hui. Coming from a laborer background, there was nothing wrong with addressing the supervising elementalist as \"sir.\"</p><br/><p>The supervising elementalist was extremely pleased with Ai Hui’s attitude. \"How about this live blood ant? Do you want to hand it over to the higher-ups? You can add it to the meritorious services you’ve accumulated.\"</p><br/><p>\"We have some ideas and would like to experiment with it,\" Ai Hui explained.</p><br/><p>\"That’ll work too.\" The elementalist was not surprised, nor did he try to confiscate the blood ant. He could see that Ai Hui had his own plans for it, and this was a good thing for him. The more meritorious services rendered by Ai Hui and the rest, the more rewards he himself would receive as well.</p><br/><p>\"This is a special period of time, and all of your contributions will be regarded as meritorious services for the Avalon of Five Elements. As for the battle evaluation, I’ll give you all the highest marks possible. If you can survive this catastrophe, they will be of great help to whichever job you apply for. I hope all of you avoid becoming complacent and continue fighting. Now go back and rest. I’ll notify you again for the next wave of attacks.\"</p><br/><p>Finishing his sentence, the supervising elementalist did not pay anymore attention to them and moved on to give orders to the other units.</p><br/><p>\"This time around, our target is east of Soundwave Street. All of you have seen the A-1 unit’s battle tactics—you will now follow that. Don’t walk in the middle of the streets. Now, tear down the buildings!\"</p><br/><p>\"Yes!\"</p><br/><p>Uneven voices resounded through the air.</p><br/><p>\"Let’s go.\"</p><br/><p>Ai Hui led his unit towards the training hall, and the rest silently followed him one by one. After going through the most devastating battle of their lives, they were physically and emotionally exhausted.</p><br/><p>When the unit passed by a location where the supervising elementalist could no longer see them, Ai Hui suddenly asked, \"Lou Lan, are there any spice shops in this area?\"</p><br/><p>\"No.\" Lou Lan shook his head and then asked, \"Ai Hui wants to buy chilies?\"</p><br/><p>\"Buy? Are the shops even open? The entire city has mobilized.\" Ai Hui lowered his volume and said, \"The higher-ups are going to verify the chili method soon. Do you think we’ll still be able to get chilies?\"</p><br/><p>\"Are you saying that we should have a hoard of chilies before the mayor takes action?\" Duanmu Huanghun was the first to react.</p><br/><p>\"That’s right.\" Ai Hui gave a look that said ‘Ingrate, you’re indeed unscrupulous’ before he continued, \"The higher-ups will definitely expropriate all of the chilies. When that day comes, it’ll become very difficult for us to advance in the battles without them.\"</p><br/><p>Everyone nodded in consensus. The chili concoction had played a key role in the battle this time. Without it, they would have suffered many more casualties.</p><br/><p>\"Is this okay?\" Shi Xueman was indecisive. Since young, she’d been a well-behaved girl. How could she do such a cunning thing?</p><br/><p>\"Then we’ll have more deaths the next time,\" Ai Hui replied bluntly. \"What do other people’s deaths have to do with us? We care for our own people first before we care about the others!\"</p><br/><p>When the members of the unit saw Ai Hui’s expression, their attitudes towards him changed immediately. Even the few troublemakers like Huo Yuanlong, who previously refused to accept Ai Hui as his leader, felt his animosity towards the latter reduce significantly. A leader who cared for his members was a good leader.</p><br/><p>\"Fine!\" Shi Xueman clenched her teeth and a shiver went down her spine.</p><br/><p>\"Ai Hui, I know the locations of a few spice shops.\" Lou Lan’s eyes were glistening. \"We can go try our luck.\"</p><br/><p>\"Everybody, hang in there. The sooner we finish this task, the sooner we can rest peacefully.\"</p><br/><p>Ai Hui spoke softly, appearing as if he had several years of experience as a seasoned bandit chief.</p><br/>\n</div>"}