{"title": "Chapter 201: Dragonspine Inferno’s Change", "id": 201, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-201-dragonspine-inferno%E2%80%99s-change", "volume_title": "Volume 3", "body": "<h1>Chapter 201: Dragonspine Inferno’s Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201: Dragonspine Inferno’s Change</p><br/><p>Translator: Irene Editor: X</p><br/><p>\"Lou Lan, any findings?\" Ai Hui asked in anticipation.</p><br/><p>The reason he was so adamant about bringing the blood crystal back was because he had the capable Lou Lan. Perhaps Lou Lan would find something.</p><br/><p>\"Sorry, there’s none, Ai Hui.\" Lou Lan shook his head. \"This type of crystal body is different from all that I have seen to date. It has lost its toxicity and transformed into a very strange type of force, perhaps the blood spiritual force you were talking about, but there are no records of such force in my sand core. Ai Hui, a completely new material requires a lot of time and research before we can understand its use.\"</p><br/><p>Ai Hui was a little disappointed, but thinking about it, this was nothing strange. The mayor’s people would have found something long ago if it was that easy.</p><br/><p>\"Don’t be sorry, Lou Lan. You’re already very capable. Everyone respects and likes you,\" Ai Hui said sincerely.</p><br/><p>\"Really?\" Lou Lan opened his eyes wide, unable to believe Ai Hui’s words.</p><br/><p>\"Of course!\" Ai Hui shouted suddenly, \"Tell me, everyone. Is Lou Lan good? Who likes Lou Lan?\"</p><br/><p>\"Of course he’s good!\"</p><br/><p>\"Lou Lan’s the best sand puppet!\"</p><br/><p>\"I love you, Lou Lan!\"</p><br/><p>\"Lou Lan, I want to bring you home!\"</p><br/><p>...</p><br/><p>Lou Lan fell into a short daze before smiling widely, his eyes forming two crescent moons. He replied cheerily, \"Lou Lan loves everybody too!\"</p><br/><p>Excited, Lou Lan turned into a sand wheel. \"Lou Lan healthcare is here!\"</p><br/><p>Poof! The sand wheel dispersed, landing on and rolling around everyone’s back.</p><br/><p>\"Hahhaha, so ticklish!\"</p><br/><p>\"Hahaha!\"</p><br/><p>...</p><br/><p>Looking at everyone having fun, Ai Hui’s cold gaze softened significantly. Ai Hui had never forgotten Lou Lan’s words: \"Who would remember a sand puppet?\"</p><br/><p>A lot of people will remember you, Lou Lan.</p><br/><p>Ai Hui thought to himself.</p><br/><p>Shi Xueman shook her head rather helplessly. The training plan she had formulated for everyone had been disrupted by Ai Hui, but she could not bear to disrupt the scene of jubilation before her eyes short.</p><br/><p>The cruel nightly battles, witnessing her comrades’ deaths, and constant life-threatening situations were like an icy cold sky enveloped by dark smog. There was no place to run. Everyone gritted their teeth and fought for survival.</p><br/><p>The frolicking students served as a sudden reminder that they were still a bunch of kids.</p><br/><p>She automatically looked toward Ai Hui and saw the coldness and bleakness in his eyes warm up, as if the sky was colored by sunlight.</p><br/><p>She was startled. It was her first time seeing such warmth radiating from Ai Hui’s body.</p><br/><p>Detecting a watching gaze, Ai Hui turned his neck. Seeing that it was Iron Lady, he hesitated for a little while, muttering to himself, \"Should I say it?\"</p><br/><p>\"What do you want to say,\" Shi Xueman blurted out. When she finished her sentence, she felt slightly embarassed.</p><br/><p>\"I’ll say it then.\" Ai Hui walked directly toward Shi Xueman with a stern expression on his face, as if he had just made an important decision.</p><br/><p>Inexplicably, Shi Xueman grew nervous. She tried hard to remain calm and undisturbed, but her heart rate started to increase.</p><br/><p>Ai Hui walked to Shi Xueman’s side before saying softly, \"Uh… Iron… uh, goddess…\"</p><br/><p>In Shi Xueman’s book, \"goddess\" was a most ordinary word. From a young age, she had lost track of the number of people who called her that. Even within the team, everyone called her that. She knew that this compliment was based more on her appearance and was neither disgusted with nor fond of it.</p><br/><p>Yet, somehow, hearing Ai Hui address her as \"goddess\" made her heart beat even faster. Thud thud thud. The sound seemed to echo within her chest.</p><br/><p>\"I’ve saved your life a few times after all,\" Ai Hui said with a reserved look on his face. \"As the saying goes, repay your life-saver with money. I’m not blackmailing you, but we’ve had our fatal encounters. It will be unreasonable for me to ask for much, so you can just…\"</p><br/><p>Shi Xueman’s face was as black as the bottom of a pot. She pointed her Cirrus directly at Ai Hui, frigidly goading him. \"Let’s have a match!\"</p><br/><p>\"Let’s talk things over!\" Ai Hui laughed. \"Where there’s no business, there’s compassion. Hahaha, forget it if it’s not possible. Forget it, hahaha…\"</p><br/><p>Fighting with Iron Lady? Only if his brain was abnormal would he do something so silly, Ai Hui thought.</p><br/><p>Under Shi Xueman’s angry gaze, Ai Hui slipped into a room, dejected.</p><br/><p>Sigh, his money-making dream was about to be shattered.</p><br/><p>It was not easy to earn money!</p><br/><p>Ai Hui’s gaze fell on the crystal on the table. He could not help but lament the hardships of life. He had collected the blood crystal in hopes of making some money ,but it looked like that hope was shattered as well.</p><br/><p>As Ai Hui played around with the blood crystal in his hand, he subconsciously placed his attention onto it.</p><br/><p>A garnet luster had emerged from within the pure, translucent, and sparkling blood crystal. If examined closely, one would see a very fine crimson blood wisp. The blood crystal was solid and heavy. When knocked against the table, it made a sound similar to that of a stone.</p><br/><p>What surprised Ai Hui the most was the fact that the blood crystal had no odor, while the blood poison had a distinct fragrance.</p><br/><p>Lou Lan said the blood crystal was not toxic.</p><br/><p>It was very difficult to imagine that this red gem was actually made from fresh blood. This series of unimaginable changes made Ai Hui fear the Blood of God even more.</p><br/><p>The Blood of God was so subversive, and \"genius\" was no longer sufficient to describe the person who created all of this.</p><br/><p>No wonder the old fellows were beaten so badly.</p><br/><p>Recalling the old man’s words, that the blood crystal contained blood spiritual force, jolted him. Perhaps he could try his Blood Bandage? He tried touching the blood crystal to the Blood Bandage and was disappointed by the Blood Bandage’s lack of reaction.</p><br/><p>Could it be that it was still full from its previous meal?</p><br/><p>After the blood refinement, the blood bandage seemed to have lost interest in the blood poison. Ai Hui knew that there must have been some changes that occurred, but he did not know how to use the Blood Bandage. It merely served as a defensive tool for him at the moment. He had used its natural ability to resist sword injuries, saving himself from quite a few harmful incidents.</p><br/><p>Blood spiritual force… spiritual force?</p><br/><p>What else was associated with spiritual force? The sword embryo? Ai Hui did not dare to absorb the blood crystal because if something went wrong, even angels would not be able to save him.</p><br/><p>What else could he do about it?</p><br/><p>Ai Hui’s eyes lit up. Dragonfire Inferno!</p><br/><p>Seven artifact remnants were embedded in Dragonspine Inferno’s sword body. What are artifact remnants? They were remnants of treasures and artifacts from the Cultivation Era. The remnants could not be corroded by the Silver Mist Sea. Since they were artifacts and treasures from Cultivation Era, they were related to spiritual force</p><br/><p>Everyone either called them artifact remnants or ocean dregs, which reflected the two types of attitudes that people had regarding them. Ai Hui still preferred the name \"artifact remnants\" since they were able to survive thousands of years of corrosion. While they might not have much use, there was no doubt that these artifacts were of superb quality.</p><br/><p>Ai Hui held Dragonspine Inferno up.</p><br/><p>The seven red prismatic crystals were arranged in a row on its body.</p><br/><p>The prismatic crystals on the sword and the blood crystals were all red, but they carried very different color and luster. The prismatic crystals’ shapes were more orderly, whereas the blood crystals’ shapes were not structured at all.</p><br/><p>Due to the fact that the prismatic crystals were fished out from Silver Mist Sea, their origin was unknown and untraceable. Judging from their luster, however, they probably came from the same artifact.</p><br/><p>Ai Hui tried placing the blood crystal near the first prismatic crystal near the sword hilt.</p><br/><p>Bzzt!</p><br/><p>A wisp of electric current zapped through the blood crystal, numbing Ai Hui’s fingertips.</p><br/><p>Ai Hui, however, could not care less about his tingling fingers. He stared at the sword body with his eyes wide open, fearing that he might miss some detail.</p><br/><p>The garnet blood crystal started to melt into a pool of fresh blood before flowing and extending along the sword body. A small, distinct motion captured Ai Hui’s attention.</p><br/><p>Was this spiritual force?</p><br/><p>The entire sword body was dipped in the red blood crystal liquid, which slowly seeped into the prismatic crystal.</p><br/><p>Bzzt bzzt bzzt!</p><br/><p>Tiny electric currents hovered around the sword body.</p><br/><p>The prismatic crystal was like an insatiably hungry and thirsty wild beast, absorbing the blood crystal liquid nonstop.</p><br/><p>When the last wisp of garnet liquid entered the prismatic crystal, a stronger electric current flickered quickly from the first to the last prismatic crystal with a \"bzzt\" sound.</p><br/><p>When the electric current disappeared, Dragonspine Inferno became quiet once more.</p><br/><p>Ai Hui stared blankly before him at Dragonspine Inferno The smile at the corner of his lips grew bigger. He could no longer control himself and laughed heartily with his head tilting up.</p><br/><p>\"Hahaha…\"</p><br/><p>Some time later, after Ai Hui recovered himself, he inspected his sword meticulously.</p><br/><p>The once red prismatic crystal faded into a lighter color. If not for the fact that AI Hui was extremely familiar with his Dragonspine Inferno, this subtle change would not have been easy to detect. Moving closer, Ai Hui found a wisp of electric current. It was very fine and could only be seen after taking a closer look. It was present and frozen within each crystal, coincidentally forming a straight line.</p><br/><p>Only after staring at it carefully for a long time did Ai Hui notice that this wisp of electric current flowed back and forth, through and within the seven prismatic crystals. Since its speed was too fast, it gave the impression that it connected all of the prismatic crystals.</p><br/><p>Surprised, Ai Hui exclaimed inwardly, \"How?\"</p><br/><p>The seven prismatic crystals were not connected from the first to the last, but instead, each crystal had a considerable distance between them and the sword body was between them. Yet, this hair-like wisp of electric current was able to flow back and forth, disregarding the gaps.</p><br/><p>So this was an artifact from the Cultivation Era?</p><br/><p>How magical! Ai Hui could not help but feel fascinated. When compared to the Cultivation Era’s glory, the Avalon of Five Elements today was merely a newborn.</p><br/><p>He jumped up, grabbed his Dragonspine Inferno and waved it around.</p><br/><p>No changes.</p><br/><p>He tried executing the [Oblique Slash] and the sword body lit up. Concurrently, a wisp of electricity flashed once within the sword ray before disappearing.</p><br/><p>It was effective indeed!</p><br/><p>Ai Hui was beyond happy. If the sword move carried electricity, it would be like a tiger that had grown wings. His fingers had been slightly numbed from the previous shock. Although the paralysis was not severe, it still worked. In an intense battle, any small changes could break the equilibrium.</p><br/><p>Possessing rich battle experience, Ai Hui had already thought of a few ways of using the electric current. Plus, from this transformation process, Ai Hui believed that if there were more blood crystals, the electric current could become more powerful.</p><br/><p>He tried another move.</p><br/><p>He wanted to observe how his Dragonspine Inferno would change if he operated his elemental energy to power his sword move.</p><br/><p>Was there anything more suitable than the [Crescent Moon]?</p><br/><p>He held onto Dragonspine Inferno and walked into the garden, where everyone had already resumed training.</p><br/><p>Ai Hui said in a deep voice, \"I’m going to test a move, please move away for a bit.\"</p><br/><p>Fatty reacted the fastest. Seizing the opportunity to slack off, he quickly found himself a spot at the corner while hugging his heavy shield.</p><br/><p>Everyone then stopped practicing and moved to the sides.</p><br/><p>All eyes were focused on Ai Hui and the sword in his hands.</p><br/>\n</div>"}