{"title": "Chapter 200: Painful Truth", "id": 200, "volume": 2, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-200-painful-truth", "volume_title": "Volume 2", "body": "<h1>Chapter 200: Painful Truth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 200: Painful Truth</p><br/><p>Translator: Cynthia Editor: X</p><br/><p>At the Vanguard Training Hall.</p><br/><p>Fatty was vividly telling them what had happened.</p><br/><p>\"… I immediately realized what happened–someone was out there. It must be a thief! I shouted loudly and rushed out. The thief was running to the entrance of the lane, so I just threw away the shield and ran after him. Since he was running extraordinarily fast, and I had no time to take off my armor, I decided to use my [Deadly Fire Dash], the speed of which, you know, is superb… But the thief was very cunning. He bounced himself away with the force of my collision. Then, I was tripped by a stone and fell on the ground. Humph! That guy must be having a hard time too. His bones must have been broken…\"</p><br/><p>\"That means you didn’t catch him?\" Lou Lan winked.</p><br/><p>\"I did,\" Fatty said seriously and shrugged, \"and then he escaped.\"</p><br/><p>...</p><br/><p>Ai Hui did not hear their conversation, but stared at the fescue on the helmet. He knew somethings about plants, but had never seen a fescue like this. He put the grass beneath his nose and smelled slight fragrance.</p><br/><p>He looked grave.</p><br/><p>When he heard Fatty mention a thief, the first thing he thought about was whether the message tree was being targeted. The origins of both the message tree and the old prisoner were mysteries. As mortal enemies, the \"Blood of God\" group was very likely to be covertly looking for them.</p><br/><p>Maybe there were undercover spies from the Blood of God in the city?</p><br/><p>\"Anything unusual?\" Shi Xueman walked to his side.</p><br/><p>The smile on her face indicated her pleasant mood. The fighting today was smoother than she expected. More importantly, no one died or got injured, which made her very delighted.</p><br/><p>\"No.\" Ai Hui shook his head. \"There’s the smell of the blood poison, but it’s not strong.\"</p><br/><p>He passed the fescue to Shi Xueman.</p><br/><p>The spread of blood poison was already hard to resist and had created the large population of blood ants. Splashes of poisonous blood could easily and severely infect nearby plants. The mayor had sent people to eliminate the infected plants, which led to the elimination of all plants at a later stage.</p><br/><p>Thanks to the quick response of the mayor, the spread of the blood poison was now much slower than in the wild. Consequently, this slower propagation led to less severe disasters.</p><br/><p>Shi Xueman took a glance and saw nothing special either.</p><br/><p>Ai Hui was afraid that the fescue carried the blood poison and asked Fatty to incinerate it.</p><br/><p>\"Great progress, huh! Six palaces already?\" Ai Hui looked at Fatty up and down and was a bit surprised.</p><br/><p>\"That’s because I’m talented!\" Fatty tried to pretend to be calm, but the smile on his face and his narrowed eyes exposed the complacency in his heart.</p><br/><p>\"Good!\" Ai Hui said admiringly and turned to Shi Xueman. \"It seems that he hasn’t adapted to his current state. Any idea how to help him?\"</p><br/><p>Ai Hui knew that Shi Xueman was experienced in this aspect. She was better than the others here in terms of training knowledge.</p><br/><p>\"No one can adapt instantly,\" said Shi Xueman before giving a rational suggestion. \"I did see similar cases before. After one spends some time at their new level, he or she can get adapted naturally. For now, I suggest that Fatty undertakes some specially designed training, such as covering the surface of a shield with flames and keeping it steady for as long as possible–at least two minutes.\"</p><br/><p>Ai Hui believed it was a good idea. Fatty’s advantage was his strength. If the shield he used was aflame, it would definitely be a great help to them.</p><br/><p>\"Lou Lan, watch Fatty. 200 sets of [Flaming Shield],\" Ai Hui said.</p><br/><p>\"No problem, Ai Hui!\" Lou Lan replied cheerfully.</p><br/><p>Fatty’s heart shivered and he screamed, \"Ai Hui, why don’t you just kill me? 200! How can I have so much elemental energy?\"</p><br/><p>Lou Lan said happily, \"I have an idea! You can eat more hot peppers. You are sensitive and have a high affinity to fire elemental energy. You can replenish your elemental energy by eating hot peppers. This can improve your physique too. We have enough hot peppers in store.\"</p><br/><p>Fatty glared at Lou Lan like he wanted to kill the sand puppet with his eyes and said woefully, \"Lou Lan! Why do you always set me up! The Fire Enhancing Soup, the Dragon Soup, and the chili fire oil… I, I…\"</p><br/><p>Ai Hui stopped Fatty from howling and said decisively, \"Good. Let’s just do it this way. Lou Lan, 200 sets.\"</p><br/><p>\"No problem, Ai Hui!\" Lou Lan took the mission happily.</p><br/><p>Leaving the howling Fatty behind, Ai Hui walked to the message tree and connected the leaf hanging around his neck back to the tree. He thought for a while, then began to write something down.</p><br/><p>\"I’m grateful to be able to contact you. We just killed a blood-traced ant today. Its blood traces were very vague. What’s special is that its blood can crystallize, and we call the gem-like product blood crystal. For the moment, we don’t know if it’s of any use. The bad news: someone seems to be following us.\"</p><br/><p>He sat under the tree and waited for the other’s reply.</p><br/><p>From time to time, the light of breakthrough appeared among the students who were in training. Nothing could train people or unleash their potential like a real fight.</p><br/><p>Ai Hui, who was sitting under that tree, did not attract their attention. He had done this many times, and they were already used to it.</p><br/><p>\"I’m glad to know that you are still alive. The blood traces of blood fiends is directly related to how strong they are. The clearer the blood traces are, the stronger they are. As to the blood crystal, I think I know. To a blood elementalist, the blood crystal is like elemental food to us or the spirit stone of the Cultivation Era. It contains an abundant amount of blood spiritual force that can greatly improve the training speed of blood elementalists. I suspect that the reason why the blood fiends were created is to provide blood crystals. I have not tested it before, so I cannot tell you if an elementalist can use blood crystals. If someone is watching you secretly, you need to contact me less. Please protect yourself. It is not possible for the blood disaster to end within a short period of time. Only by staying alive can you have the chance to do anything.\"</p><br/><p>Ai Hui read it carefully. Then, he picked up the leaf and again wore it around his neck.</p><br/><p>His movements were at ease and he looked just as calm as usual, but he was actually so shocked that his heart was like a stormy sea.</p><br/><p>The conjectures of the old prisoner stunned him, but his mind told him that maybe this was the real purpose of the Blood of God.</p><br/><p>Producing the blood plants was for the blood training of the blood fiends, which could produce blood crystals. Therefore, whether it was blood fiends or blood plants, they were all materials to make blood crystals.</p><br/><p>Oh, elementalists were also included…</p><br/><p>Blood ants ate elementalists to transform, after which the blood traces appeared and they grew into blood-traced ants which could produce blood crystals.</p><br/><p>Ai Hui felt chilled. He sensed that he had just lifted the veil of the disaster and saw the frightening truth underneath.</p><br/><p>How crazy and cold-blooded were they to have such horrible ideas and to create such disastrous blood poison.</p><br/><p>He sat on the floor, looking absent-minded.</p><br/><p>\"Are you okay?\" Shi Xueman was concerned.</p><br/><p>Ai Hui had been sitting blankly under the tree for about 10 minutes, which attracted her attention. She had never seen such an expression on Ai Hui’s face before. It was a combination of fear, loss, and unease.</p><br/><p>Ai Hui was brought back to reality. \"It’s nothing.\"</p><br/><p>Then he suddenly asked, \"Aren’t you afraid?\"</p><br/><p>\"Afraid?\" Shi Xueman paused for a while. \"Yes, I was at the very beginning. Now, I’m much better. It’s useless to be afraid. It’s a life-or-death fight anyway. I don’t need to think too much.\"</p><br/><p>Ai Hui was suddenly enlightened and discarded his fear.</p><br/><p>Yes, it was a life-or-death fight from the very beginning. Maybe they were regarded as materials, but so what? The enemies were strong and crazy, but so what?</p><br/><p>Give up fighting and surrender? Leave themselves at the mercy of the enemies and wait to be killed?</p><br/><p>There was no difference!</p><br/><p>Ai Hui patted Shi Xueman’s shoulder unconsciously and said, \"Iron Lady has an iron heart.\"</p><br/><p>Shi Xueman’s body froze when Ai Hui put his hand on her shoulder, but after hearing his words, her face turned dark.</p><br/><p>Iron Lady…</p><br/><p>Ai Hui also realized what he said. He laughed embarrassedly and ran away as fast as he could.</p><br/><p>…..</p><br/><p>In the Jade Embroidery Workshop.</p><br/><p>Han Yuqin read through the draft carefully.</p><br/><p>It was completely quiet in the workshop. The mayor and the dean sat in front of her, not daring to make the slightest noise.</p><br/><p>She caressed the paper as if it was her husband’s face. Every letter on the paper was the fruit of his sweat and blood, and they shined brightly in her eyes.</p><br/><p>She was a bit crazy.</p><br/><p>Why was she attracted by him? Why couldn’t she move her eyes away from him? Why did she give herself to him? Why had she never regretted her decision even though he had been ordinary throughout his life?</p><br/><p>The reasons were in each letter of this draft.</p><br/><p>She read every word of it carefully, then passed it to the mayor. \"Just do as it says.\"</p><br/><p>Her voice was calm, but indubitable.</p><br/><p>\"No problem!\"</p><br/><p>Mayor Wang Zhen and the dean agreed at the same time. Master Han was now their last hope.</p><br/><p>Wang Zhen added, \"Please feel free to let us know if you need anything.\"</p><br/><p>\"I’m afraid it will take a long time to make all the things that are required.\" Han Yuqin replied calmly, \"I will also need to isolate from the world to become well prepared. Please notify me after all the key points are arranged.\"</p><br/><p>\"Yes.\" They walked out of the room at once.</p><br/><p>\"Mingxiu, I will now enter isolation. You will watch over for me,\" Han Yuqin said.</p><br/><p>\"Yes, master,\" Mingxiu said softly. She felt a bit uneasy for no reason.</p><br/><p>Wang Zhen and the dean flew back to the mayor’s residence at the fastest speed and could not wait to read the draft. After finishing, their faces lit up.</p><br/><p>\"Wonderful design! This is absolutely wonderful! Unbelievable! Really unbelievable! Shouchuan is a great talent.\" The dean was too excited to talk in complete sentences. There were many details that he did not really understand, but he knew the plan was very likely to succeed.</p><br/><p>Although Han Yuqin had previously promised them, they had just regarded it as another doubtful attempt, which was barely better than nothing. They did not have high hopes for it.</p><br/><p>Only after they saw the draft did they realize that this plan was promising!</p><br/><p>There was nothing more exciting than hope amid despair.</p><br/><p>The dean calmed down from his excitement. He stared at the complicated design on the paper and was a bit concerned. \"I’m not sure whether we can make all these. They are all too complicated. Let’s ask the craftsmen?\"</p><br/><p>\"We have to!\" Wang Zhen said decisively. \"Call all the craftsmen together. We don’t have much time, so we will do it as fast as we can!\"</p><br/><p>All of Central Pine City was embroiled in hard work.</p><br/>\n</div>"}