{"title": "Chapter 207: The Discussion on Blood Crystals", "id": 207, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-207-the-discussion-on-blood-crystals", "volume_title": "Volume 3", "body": "<h1>Chapter 207: The Discussion on Blood Crystals</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 207: The Discussion on Blood Crystals</p><br/><p>Translator: TYZ Editor: X</p><br/><p>Ai Hui and his counterparts were able to defeat the blood worm, but were mentally and physically exhausted at the same time. The previous order that required them to launch another wave of attacks had been cancelled as a result.</p><br/><p>The first thing Ai Hui did when he returned to the training hall was to run to the message tree and write down everything that had happened today. He carefully described the process of attacking the nine blood traces on the blood worm’s body.</p><br/><p>At this critical stage, he no longer cared about the Blood of God as he might be killed by blood fiends at anytime. The threat of the Blood of God might be great, but it was not greater than the threat of being eaten by blood fiends on the spot.</p><br/><p>If he did not even know whether or not he would live to see tomorrow, why would he care about the day after tomorrow?</p><br/><p>The old man simply asked him to be careful and to survive this catastrophe. If necessary, he wanted Ai Hui to destroy the message tree and that piece of leaf. After all, any message tree could be used to contact him.</p><br/><p>Ai Hui was slightly disappointed. He wanted to know specific information about the blood fiends, such as their weaknesses, which would be helpful for his current plight.</p><br/><p>Although Ai Hui was disappointed, the fight against the blood catastrophe carried on, and he still had to depend on himself.</p><br/><p>The amount of blood crystals that the blood worm produced was far more than what the blood ants had yielded. Furthermore, the blood worm’s blood crystals were also of higher quality. There are a total of 10 pieces of blood crystals. Every piece was thumb-sized, sparkling, translucent, and smooth. Even though the body of the blood worm was so huge, it had only produced 10 blood crystals. Ai Hui was cursing the blood worm repeatedly in his heart. What was the point of growing so big when it could only produce 10 pieces of blood crystals?</p><br/><p>The elite unit’s leader, whose surname was Zhang, had given them three additional blood crystals. The quality of his blood crystals was not as good as the blood worm’s. They must have been obtained from the blood ants.</p><br/><p>Shi Xueman, Duanmu Huanghun, Sang Zhijun, Jiang Wei, Fatty, and Wang Xiaoshan were called over by Ai Hui. Perplexed, everyone looked at Ai Hui..</p><br/><p>\"These are blood crystals.\" Ai Hui pointed at the blood crystals on the table.</p><br/><p>Everyone cast a baffled glance at Ai Hui. You don’t say! Everyone knew that these were blood crystals…</p><br/><p>\"I have discovered one of their uses.\"</p><br/><p>Everyone became alert at once with a look of curiosity on their faces. Initially, they thought Ai Hui wanted the blood crystals for monetary reasons like before. They did not expect for him to find a use for the crystals.</p><br/><p>\"What use does it have?\" the straightforward Sang Zhijun blurted out.</p><br/><p>Shi Xueman took a glance at Ai Hui and felt utterly astonished. Was there anything that this fellow did not know? Even the mayor failed to find a use for the blood crystals, yet this fellow actually had.</p><br/><p>\"All of you, take a look.\"</p><br/><p>Ai Hui put his Dragonspine Inferno on the table, picked up a blood crystal, and placed it on one of the prismatic crystals of the sword.</p><br/><p>The blood crystal rapidly melted and was absorbed into the prismatic crystal.</p><br/><p>Buzz. A strand of electricity sparked off between Ai Hui’s fingertip and the Dragonspine Inferno</p><br/><p>Everyone widened their eyes as amazement rose upon their faces..</p><br/><p>A glint flashed across Shi Xueman’s eyes as a pensive look appeared on her face.</p><br/><p>There were many things that Ai Hui could not explain to them, like the Blood of God, the old man, etc. As such, he could only lie to them. \"Last time, I touched a blood crystal to the Dragonspine Inferno and this phenomenon occurred. The prismatic crystal on the sword is an artifact remnant. What is an artifact remnant? It’s a portion of an artifact that’s left behind. This blood crystal is able to stimulate the artifact remnant. I suspect the blood crystals might contain spiritual force.\"</p><br/><p>Simultaneous gasps of shock could be heard. Everyone knew exactly what spiritual force was.</p><br/><p>From the day the Avalon of Five Elements was established, there had been fanatics who were persistently trying to seek the remains of the Cultivation Era. The Avalon of Five Elements had directly progressed from the Cultivation Era. People were not completely ignorant of the Cultivation Era. There were numerous records that contained information on various mystical spells and artifacts. The legacies of the Cultivation Era were very rare and precious, causing countless people to lust over them. The worth of just a miniscule portion of a Cultivation legacy was enough to surpass the value of the entire Avalon of Five Elements.</p><br/><p>However, no one had succeeded until now.</p><br/><p>That was because of spiritual force.</p><br/><p>All artifacts and spells needed spiritual force to function. Without spiritual force, the mountainous heaps of artifacts might as well be thrown into the Silver Mist Sea. Without spiritual force, those apocalyptic supreme spells were just cheap-selling scraps and rubbish.</p><br/><p>Of course, if spiritual force could be found, those mountainous heaps of artifacts and spells would become mountain sized heaps of gold.</p><br/><p>While talking, Ai Hui shamelessly took another blood crystal and pressed it against his Dragonspine Inferno.</p><br/><p>\"Let us see how many blood crystals the Dragonspine Inferno can absorb?\"</p><br/><p>Everyone else’s gazes were immediately captivated by the Dragonspine Inferno, with curiosity surging through their faces.</p><br/><p>After absorbing three blood crystals in a row, the Dragonspine Inferno could not absorb any more blood crystals. There was an astonishing transformation in the Dragonspine Inferno’s appearance. The previously reddish-black body of the sword had become silver-white in color. The sword was surging with silvery lightning sparks. The red prismatic crystals had become transparent and the lightning sparks within them were much more stronger than before.</p><br/><p>The entire sword was glowing with a white luster. One could tell that it was an extraordinary weapon with just a single look.</p><br/><p>The sword had become lighter and thinner as well. Its texture resembled that of metal instead of wood. The edge of the sword became much sharper. Even the previously crimson wave patterns on the blade were replaced by silver ones.</p><br/><p>\"It’s magical!\"</p><br/><p>\"Oh my god!\"</p><br/><p>Cheers broke out. Everyone was flabbergasted and even Ai Hui was shocked. His jaw dropped and a stupefied expression was fixed on his face. Was this his Dragonspine Inferno? If he had not seen the entire process of the transformation with his own eyes, he would never have thought that this gleaming treasure sword was his Dragonspine Inferno.</p><br/><p>Brandishing his new sword, Ai Hui felt something unusual from it.</p><br/><p>Indeed, even though the sword had become much lighter and thinner, Ai Hui did not find it unfamiliar. On the contrary, he was weirdly accustomed to the sword, as if it was part of his body.</p><br/><p>\"Do you want to give it a try?\" Ai Hui looked at Shi Xueman.</p><br/><p>\"All right!\" Shi Xueman replied without any hesitation, looking somewhat eager and excited.</p><br/><p>Such a transformation had exceeded the limits of her imagination. She was extremely interested in Ai Hui’s sword.</p><br/><p>Ai Hui executed the [Oblique Slash] and a streak of lightning flashed across the air.</p><br/><p>Amazement rose in Shi Xueman’s eyes. It was so fast!</p><br/><p>Ai Hui’s [Oblique Slash] was approximately 33% faster than usual. This shocked Shi Xueman and she quickly pulled out her spear to deflect the incoming attack.</p><br/><p>The streak of lightning and the Cirrus collided against each other.</p><br/><p>Ai Hui took two steps back. The weight of the Cirrus was indeed frightening. Furthermore, with the powerful spiralling effect of the spear, Shi Xueman’s attack was violent and mighty.</p><br/><p>On the other side, Shi Xueman did not move a single inch.</p><br/><p>Upon seeing Ai Hui’s gaze, a weird look appeared on Shi Xueman’s face. \"My palm is a bit numb.\"</p><br/><p>So this is the feeling of being hit by a lightning-type attack…</p><br/><p>Shi Xueman felt rather curious. In the Avalon of Five Elements, lightning-type offensive methods were not really developed yet. This was her first time seeing a lightning-type attack. The numbness in her palm piqued her curiosity.</p><br/><p>The rest were curious as well. All of them jump forward, wanting to give it a try.</p><br/><p>\"It’s numb, it’s numb!\" Sang Zhijun yelled excitedly.</p><br/><p>\"Eh, it’s really numb,\" Jiang Wei felt incredulous.</p><br/><p>\"It feels as if I have eaten a lot of peppers! Why does it feel worse than peppers? Even my face feels numb!\" Wang Xiaoshan shouted.</p><br/><p>\"That’s because you never eat chillies before! If you eat enough chillies, not only your face will be numb, haha,\" Fatty spoke from his experience.</p><br/><p>\"Your face will be numb if I stab a sword into it,\" Duanmu Huanghun said suddenly.</p><br/><p>...</p><br/><p>It was as if everyone had found a toy. All of them were extremely excited.</p><br/><p>The direction that the discussion was going to… did not seem right…</p><br/><p>Ai Hui was stunned.</p><br/><p>He coughed softly and interrupted the ongoing nonsensical discussion, \"All right, let us discuss how to make use of this unique characteristic of the blood crystals?\"</p><br/><p>Everyone stopped talking and looked at him pensively.</p><br/><p>\"Our target is to get out of this place alive. Looking at the current situation, this goal is rather difficult to achieve. We are in deep water now. Even though the mayoral office keeps on emphasizing that there will be reinforcements, we still need to prepare for the worst. What if there are no reinforcements? What if the reinforcements are slightly late?\"</p><br/><p>Ai Hui said a lot of things in one go. However, there were a lot of things he left unsaid, like the Blood of God for example.</p><br/><p>He had a hunch that the reinforcements might not reach them smoothly. He did not know how to explain this to the other, and as such, he could only use the phrase \"prepare for the worst.\"</p><br/><p>When he saw a contemplative look on everyone’s face, he continued, \"No one knows how to use the blood crystals yet. Can we use them to strengthen ourselves? How should we do it then? Everyone, let us think about these questions together.\"</p><br/><p>All of them nodded their head. They did not care about anyone else. What mattered the most was that they, themselves, survived.</p><br/><p>\"We need to better understand the nature of the blood crystals first.\" Surprisingly, Duanmu Huanghun was the first to speak out. He then continued coldly, \"It worked for your Dragonspine Inferno, but what about other artifact remnants? Do they work on artifacts? If so, what types of artifacts do they work on?</p><br/><p>\"There are too few blood crystals.\" Fatty’s face was sore. \"With a scarcity of blood crystals, they will be gone in an instant if we try anything with them.\"</p><br/><p>\"That’s right.\" Sang Zhijun was reluctant as well.</p><br/><p>Shi Xueman collected her thoughts and said, \"What Ai Hui said is right. If the reinforcements are able to reach us quickly, the blood crystals are not really that important. If the reinforcements are late or there are no reinforcements, then we will have plenty of blood crystals. Furthermore, we can ask other teams for their blood crystals as well. We can say we are investigating the uses of blood crystals. Huanghun and I will go and find the mayor. He most likely will agree to our proposal.\"</p><br/><p>Everyone nodded their heads.</p><br/><p>\"We can investigate the crystals openly, including their effects on artifacts. I believe the mayor will help us to locate a large amount of artifacts and artifact remnants.\" Shi Xueman might not have a loud voice, but her words contained a convincing power. \"Other than that, we will need blacksmiths as well. We need help to embed the artifact remnants into weapons or to transform the artifact remnants into equipment.\"</p><br/><p>\"Lou Lan can do it!\" Lou Lan raised his hand happily.</p><br/><p>\"Lou Lan is fabulous! You know everything!\"</p><br/><p>\"Almighty Lou Lan!\"</p><br/><p>\"Lou Lan, can you just directly tell us what you don’t know?\"</p><br/><p>\"Lou Lan, come home with me!\"</p><br/><p>Everyone was praising Lou Lan with liveliness.</p><br/><p>Lou Lan was very happy that everyone liked him.</p><br/><p>\"After we finish with our investigation, we will report our findings to the mayor’s office,\" Shi Xueman continued to explain. \"Once Ai Hui’s lightning sword appears, it will catch the attention of the mayor’s office. We can’t hide it. Rather than being forced to give it up, why not take the initiative? Furthermore, without the support of the mayor’s office, our progress will be very slow. Also, if we report our findings to the mayor, we will be rewarded with merit points. If we do it before any of the others, we might be able to get Heaven Merit Points. And if we can survive this catastrophe, these merit points will be very useful to us. As for the gains we obtain before we submit our findings to the mayor, I believe he won’t make things difficult for us.\"</p><br/><p>Shi Xueman’s explanations were clear and precise, displaying authority and convincing everyone.</p><br/><p>\"Let’s do it then!\"</p><br/><p>Ai Hui made the final decision and cast a thoughtful look at Shi Xueman.</p><br/><p>For an iron lady that had big boobs, she was rather smart.</p><br/>\n</div>"}