{"title": "Chapter 203: New Blood Fiends", "id": 203, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-203-new-blood-fiends", "volume_title": "Volume 3", "body": "<h1>Chapter 203: New Blood Fiends</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 203: New Blood Fiends</p><br/><p>Translator: JL Editor: CakeHermit</p><br/><p>\"Yan Hai, you are late.\" Team Leader was displeased.</p><br/><p>\"I encountered a blood ant and sustained some internal injuries.\" Yan Hai explained.</p><br/><p>Although most of the blood ants in the city had been purged out, some blood ants still appeared sporadically and easily hurt people.</p><br/><p>Team Leader’s face softened upon seeing Yan Hai’s ghastly white face. \"It’s fine as long as you did not sustain any external injuries; if you had, I would have had to send you to isolation. Everyone be more cautious. There are always some random blood ants. Our mission today is not very serious. The blood ants have been almost eliminated, we just need to keep guard on the underground tunnels. If any of us encounter any sneak attacks, send out a warning. Understood?\"</p><br/><p>\"Understood.\" The resounding answer was not unified. Everyone’s morale was low.</p><br/><p>Team Leader did not say much as he was not in high spirits either. In the battle just yesterday, half of their troops were killed and only thirty-odd people managed to survive. While they had gotten more manpower, they still could not feel secure.</p><br/><p>It was like they were just sitting there awaiting death. It was depressing.</p><br/><p>Today they were standing guard at a small hill located in the west of the city. There were many tunnels there, courtesy of the blood ants. The mayor residence was helpless regarding all those underground tunnels. Even sealing up the tunnels was ineffective. What else could be used to ward off the blood ants?</p><br/><p>Everyone could only hope that the other blood fiends did not like to dig holes. The only fortunate part was that the blood ants had a small build. Those larger blood fiends were unable to enter the tunnels which were as big as a fist. Nevertheless, there were still many potential threats. Some insects that were not too large were still able to make use of the tunnel created by the blood ants to travel.</p><br/><p>The mayor residence had set up a large number of snares around the tunnels. Nobody knew if they would be able to hold back the blood fiends, so the vicinity of the tunnels was also guarded by people. Even if they were unable to hold back the blood fiends, they could at least warn the others.</p><br/><p>The small hill was positioned against the direction of the wind. Everyone hid in a corner where there was no wind.</p><br/><p>\"Today is the fifth day, right?\" Someone asked suddenly. \"Are we really going to get reinforcements? Will it be another ten more days?\"</p><br/><p>Everyone stayed silent. Nobody could answer this question and nobody dared to try.</p><br/><p>The mayor residence claimed that the support troops would reach them after fifteen days. The higher-ups of the Avalon of Five Elements definitely wouldn’t leave them in the lurch.</p><br/><p>Yan Hai turned his gaze towards the Team Leader.</p><br/><p>The two of them were neighbours and were on good relations. When he’d first arrived at Central Pine City, Team Leader had taken him under his wing. Out of all of Central Pine City, Team Leader was the one who he’d want to survive.</p><br/><p>Yan Hai held Team Leader’s conduct in high regards. Compared to his own timid and cowardly nature, he felt that Team Leader was better than him in many aspects. He did not have any talents and he had a weak temperament. Why else would he have been eliminated so early?</p><br/><p>He had thought more than once, perhaps he could influence Team Leader into becoming a blood elementalist?</p><br/><p>He was slightly hesitant. He did not know if Team Leader would be willing to accept it.</p><br/><p>Yan Hai believed that the Blood of God was the best way to go. Given Team Leader’s capability, he would be able to prove himself within the organization quickly; however, unlike him, Team Leader had a family to go back to.</p><br/><p>Yan Hai had been a member of Blood of God for a long period. He was clear of the boundary between the blood elementalists and the elementalists. Once the boundary comes between one and one’s family, it would be the cruelest thing in the world.</p><br/><p>Some pain was worse than death.</p><br/><p>Unless it was as a last resort, he definitely wouldn’t change Team Leader into a blood elementalist. Team Leader was a loyal and passionate person, aspects which were also his Achilles heel and might cause him more pain.</p><br/><p>He did not want Team Leader to blame him, regardless of the reasons.</p><br/><p>The dead would be struggle-free while the living shoulder the burden. Sometimes, it was hard to determine which was better.</p><br/><p>\"Have a good rest. I will take over,\" said Team Leader to Yan Hai.</p><br/><p>Yan Hai looked at Team Leader. He opened his mouth, but not a sound came out.</p><br/><p>Team Leader pat his shoulder and smiled at him.</p><br/><p>Having said that, he turned and walked to the vicinity of the tunnel entrance and sat down cross-legged.</p><br/><p>Yan Hai fell asleep amidst his thoughts. The little demon being beheaded had brought about a huge, negative impact on his state of mind.</p><br/><p>Suddenly, he was awakened by a mournful siren. He violently sprang up.</p><br/><p>\"Be careful! Something is approaching!\" Team Leader stood up and shouted the reminder.</p><br/><p>A ray of red light flew out from underground and passed through Team Leader’s chest.</p><br/><p>\"No!\" Yan Han shrieked and his features twisted. He stood blankly. He saw the light going out of Team Leader’s eyes. They became empty and his body dropped on the floor with a loud bang, sending dust flying up.</p><br/><p>The air was filled with endless miserable shrieks. Yan Hai could only turn a deaf ear to them. His pale and shrunken in face seemed to have lost its soul. He stared fixedly at Team Leader who was lying motionless on the floor.</p><br/><p>The red ray was like a strange sword ray. It was able to twist around freely in the air and was as fast as lightning.</p><br/><p>In a flash, the underground was filled with corpses.</p><br/><p>The red ray fell on the floor and surprisingly, it was a blood snake that was as thick as an arm. Its scales were red and it was covered with distinctive black blood traces. Its blood red pupils did not have any hint of emotions. It stared at Yan Hai who was frozen in shock. A flicker of suspicion flashed across its eyes. The prey in front it seemed to have the scent of their species.</p><br/><p>The blood snake fixed its attention on Yan Hai before catapulting and disappearing without a trace.</p><br/><p>…..</p><br/><p>The mournful siren was sounded simultaneously at a few places in the city. It triggered everyone’s nerves. They’d just managed to suppress the blood ants and now there was a new surge of blood fiends.</p><br/><p>\"We have no buffer time at all!\" The dean wore a furious expression. \"Five to seven days? Didn’t you say they need five to seven days to transform? Damn it! The blood ants were attacking us from day one!\"</p><br/><p>\"This simply implies that we had misjudged them.\" Wang Zhen replied. \"The current wave might possibly the first wave of the completed transformation.\"</p><br/><p>\"Attention! Six places have issued the alarm. The defending troops… were wiped out.\" The elementalist who came forward to make the report spoke with a trembling voice.</p><br/><p>Wang Zhen was silent for a moment before gravely saying, \"What sort of blood fiend was it?\"</p><br/><p>\"Those that we could confirm right now would be blood snakes, blood rats, and blood butterflies,\" replied the elementalist.</p><br/><p>Wang Zhen muttered to himself, \"The previous wave was all blood ants. It is a different type of fiend for this wave. It seems like every time they complete a cycle of transformation, our pressure and stress increases. What about the blood traces?\"</p><br/><p>\"The blood traces were very distinct.\" The elementalist’s eyes showed signs of fear. \"They were even clearer than the traces on the blood ants.\"</p><br/><p>\"Send the Elite Unit to hunt them down.\" Wang Zhen decided resolutely. Despite the worsening situation, he still held hope. He continued, \"Group the students and the average masses. We need to have lookout posts in all the corners of the city. We need to know where exactly the blood fiends are located.\"</p><br/><p>\"Yes!\" The elementalists hurriedly replied.</p><br/><p>The Elite Unit was the nucleus of Central Pine City. It was the equivalent of the guards in the training hall. Compared to the average troops formed by the students and the masses, their capabilities were much stronger.</p><br/><p>The dean exhaled heavily. He knew Wang Zhen’s original plan. Wang Zhen initially predicted that he would only make use of the Elite Unit after nine days.</p><br/><p>It was four days earlier than they had intended.</p><br/><p>\"Notify A-1 unit and have them prepare to attack.\" Wang Zhen suddenly said.</p><br/><p>\"No!\" The dean opposed. \"They are still kids! Also, do not forget about their status!\"</p><br/><p>Wang Zhen angrily said, \"Status! Whatever status is not important now! Everyone has to participate in the battle! They have to battle, you have to battle, and I too have to battle. Everyone is fighting for themselves!\"</p><br/><p>This was the first time the dean witnessed Wang Zhen flying into a rage. Yet, he replied calmly, \"Do you think they are competent enough?\"</p><br/><p>The dean’s calmness rubbed off on Wang Zhen’s rage. He tried to tone down his temper and responded, \"No idea. But I feel that they have potential. All along I have been paying attention to their progress. They are improving faster than we’d expected and their adaptability is also better than we’d thought. They are the best performing small team and also the team with the most potential. They might be the best hands we could have!\"</p><br/><p>The dean was shocked. \"You are going to bet on them?\"</p><br/><p>\"That’s right.\" Wang Zhen continued gravely, \"I have thought about all the possibilities. We are unable to get through the fifteen days. I only realised yesterday that there are only two variables in this death battle. The first variable is Master Han and Wang Shouchuan; I was surprised that Wang Shouchuan managed to complete the design. The problem now is whether or not Master Han will be able to implement it. Can we hang on until the day Master Han seals up Central Pine City?\"</p><br/><p>The dean replied, \"The other variable is the A-1 unit?\"</p><br/><p>\"Yes! I suddenly realised it when I saw them defeat the blood-traced ants. The A-1 unit is also a variable. Their potential is bigger than we had imagined and their progress is astonishing. Ai Hui has already attained seven palaces. What was his cultivation level before the battle? Shi Xueman is also starting to expose her battle capability. It is the best amongst them. As long as she has adapted to battle, she will be our trump card. As for Duanmu Huanghun, look at his recent performance. He was practically a new person. The rest of the students have improved drastically as well. Why did I allocate so many resources to them? Because I am unsure of their limits. They are a group of talents and perhaps they will be able to create a miracle.\"</p><br/><p>The dean had completely calmed down. \"Perhaps they might die. Would they be able to adapt to such a high intensity battle? That is something unknown to us.\"</p><br/><p>\"But it is worth a gamble.\" Wang Zhen stared deeply at him. \"If they die, then it implies that they were not our variables and none of us will be able to escape. Only through battle, constant success, and getting stronger, would we be able to see the light at the end of the tunnel.\"</p><br/><p>The dean shook his head. \"Nobody could improve so much in such a short period.\"</p><br/><p>\"You have forgotten about the Battle of the Dawn.\" Wang Zhen continued indifferently. \"Look. It was also fifteen days. History always has the tendency to be surprisingly similar.\"</p><br/><p>Blankly, the dean said, \"That was just a legend…\"</p><br/><p>\"It was not a legend.\" Wang Zhen gave him a glance. \"Because I am a lucky survivor.\"</p><br/><p>The dean was dumbstruck.</p><br/><p>At that moment, an elementalist rushed over hurriedly. \"I am here to report that the A-1 unit is suspected to be under attack by the blood fiends and they are in an intense battle right now!\"</p><br/><p>Their expressions changed in unison.</p><br/><p>\"There’s no support team?\" The dean asked anxiously.</p><br/><p>\"The support team is still making its way over. Their station is located further away as compared to the Elite Unit.\" The elementalist cast a glance at them before he continued, \"The nearest elementalist would also need a minimum of five minutes to rush over.\"</p><br/><p>Five minutes…</p><br/><p>The dean’s expression became as white as sheet. In an intense battle, five minutes was enough to end everything. Even if he was to fly over from the mayor residence now, it would still take him ten minutes to get there.</p><br/><p>Wang Zhen smiled. \"Look, you need not make a decision now.\"</p><br/><p>The dean glared at Wang Zhen and soared into the sky. He was unable to let go of the students.</p><br/><p>The smile on Wang Zhen’s face vanished. His gaze became filled with worry.</p><br/>\n</div>"}