{"title": "Chapter 217: One Man Against Countless Numbers", "id": 217, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-217-one-man-against-countless-numbers", "volume_title": "Volume 3", "body": "<h1>Chapter 217: One Man Against Countless Numbers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 217: One Man Against Countless Numbers</p><br/><p>Translator: YH Editor: CakeHermit</p><br/><p>Tian Kuan didn’t follow the horde of blood fiends into the city, instead choosing to observe it from outside. If he remembered correctly, this was a painfully ordinary city within the Induction Ground known as Central Pine City.</p><br/><p>As he neared Central Pine City, he noticed that its defenses remained completely intact. He became more guarded after making this observation since he had seen many other cities which were larger yet, had defenses that were much more dilapidated.</p><br/><p>Surveying the area carefully, Tian Kuan noticed something peculiar. The blood-traced fiends near Central Pine City were all of a lower level.</p><br/><p>He now understood why the city’s defenses were still in such good condition.</p><br/><p>Tian Kuan had hunted many blood-traced fiends on his way to the city and as such, was able to determine the blood-traced fiends’ levels. There were a large number of wild beasts in the Induction Ground. Once they were infected by the blood poison, these beasts would continuously experience transformations and become much stronger as time passed.</p><br/><p>Their large numbers would allow them to eventually overwhelm the elementalists and become the new masters of the Induction Ground.</p><br/><p>The organization had never before attempted a blood fiend breeding operation of this large a scale. Tian Kuan believed that not even the higher ups knew what would result in the end.</p><br/><p>One thing he was sure of, however, was that they were not only racing against the Avalon of Five Elements, but with the blood fiends as well. If the blood elementalists were unable to keep up with the blood fiends’ swift transformations, things will not bode well for them either.</p><br/><p>Once active, the blood poison brings with it a fundamental change. The changes it would cause were irreversible and uncontrollable. Unleashing it was like opening Pandora’s box, nothing could be said after the deed was done.</p><br/><p>While risky, it wasn’t too different from most other big opportunities. Large opportunities were often hidden within huge risks. Besides, those who seek success must inevitably tackle such risks.</p><br/><p>Death? Death was an inevitability.</p><br/><p>Tian Kuan despised those hypocrites who thought otherwise.</p><br/><p>He suddenly remembered that when the crazy lady in red had come to his aid, it had been from this direction. Did she have something to do with the lower leveled blood fiends in this area?</p><br/><p>Tian Kuan couldn’t detect any traces of her presence nearby. She must have left quite a while ago.</p><br/><p>His eyebrows furrowed in thought. Although he wasn’t quite sure what had happened here, he was certain that this phenomenon hadn’t occurred naturally.</p><br/><p>Blood refinement?</p><br/><p>This was the most possible scenario since blood refinement required large amounts of blood spiritual force. The amount of blood spiritual force contained within plants was minuscule and definitely not sufficient for blood refinement. Only a large number of blood fiends could provide the necessary amount of blood spiritual force.</p><br/><p>However, encouraging blood fiend transformation in such a large area was a slow process requiring an enormous amount of effort. Just how much blood spiritual force did that crazy lady need to have done something like this?</p><br/><p>Tian Kuan calculated an approximate figure and quickly concluded that the amount of blood spiritual force here was beyond what she could handle.</p><br/><p>What was the real reason then?</p><br/><p>Tian Kuan couldn’t think of anything else, so he turned his focus to the enigmatic little city in front of him. In order to prudently tease out some of its secrets, he decided to break down the city gate and lure the blood fiends into the city.</p><br/><p>The horde of blood fiends rushing inside would reveal any potentially dangerous individuals that resided within Central Pine City.</p><br/><p>The sudden destruction of the city gate plunged Central Pine City into a state of crisis. Groups of elementalists which had been on the hunt for blood-traced fiends ended up becoming the hunted instead.</p><br/><p>Old Zhang stared at the incoming wave of blood fiends in terror. \"Run, quick!\" he shouted.</p><br/><p>A pair of azure wings spread out from behind Old Zhang and he swiftly took to the skies. The other elementalists rapidly followed suit. Looking down from above, they could see the blood-red torrent gushing down the streets in their direction. The earth rumbled and the mountains shook; it was a fearsome sight to behold.</p><br/><p>At this moment, someone cried out in alarm, \"The A-1 unit! They don’t have azure wings!\"</p><br/><p>Old Zhang unwittingly looked down and saw the stranded A-1 unit shaking before the might of the horde. He could see the look of despair on their young, immature faces.</p><br/><p>\"Damn it!\"</p><br/><p>He couldn’t help but swear.</p><br/><p>The raging horde that swiftly approached the street below appeared to have no end. No one dared to venture down to save the A-1 unit.</p><br/><p>It was too late!</p><br/><p>He shut his eyes in resignation.</p><br/><p>The A1-unit was in disarray, everyone was pale with fright. Although they had become much stronger, their fear stricken bodies still trembled before the destructive force that was headed their way.</p><br/><p>The laid bricks that made up the street were groaning under the immense force of the blood fiends’ hooves. The thundering stampede caused the ground to quake intensely, making it difficult for Shi Xueman and the others to maintain their balance.</p><br/><p>Everything that stood in the way of the blood fiends was reduced to dust. They raged on, crushing every last building and causing ruin in their path; nothing could withstand their might.</p><br/><p>With their armor-like scales, forceful limbs, razor sharp teeth, and deadly gazes, the blood fiends charging towards the A-1 unit appeared to have come straight out of hell, bringing death and destruction with them.</p><br/><p>It was too late to retreat!</p><br/><p>\"Prepare for battle!\"</p><br/><p>Shi Xueman’s voice was drowned out by the thunderous rumbling.</p><br/><p>Duanmu Huanghun looked paler than usual, but the fervor in his eyes burned brighter than ever. He understood that this could be his final battle and was ready to go all out.</p><br/><p>It would be a disgrace if he couldn’t even put up a final struggle!</p><br/><p>The elemental energy within his body erupted as the [Viridescent Flower] began to blossom beneath his feet. The vines burst forth along the ground stealthily, fanning across the street like tripwires.</p><br/><p>Several blood fiends began to fall.</p><br/><p>Blood fiends were constantly being tripped by Duanmu Huanghun’s [Viridescent Flower]. Those that fell were quickly trampled over by the other blood fiends, ground to mincemeat before they could even make a sound.</p><br/><p>Shi Xueman threw every last Verglas Mist Pearl she had in front of her. The pearls transformed into a wall of fog which advanced towards the blood fiends.</p><br/><p>Upon contact, the fog seeped into the first ten blood fiends that were ahead of the horde. Their bodies instantly stiffened.</p><br/><p>Before the Verglas Mist Pearls could exert their full effect, the affected blood fiends were mercilessly crushed to death by those behind.</p><br/><p>The red torrent never once showed any signs of slowing.</p><br/><p>\"Fire!\"</p><br/><p>Jiang Wei and Sang Zhijun, together with the rest of the team, whipped out their bows and began to rain arrows on the blood fiends.</p><br/><p>Blood fiends were dropping like flies, but still the red torrent raged on, unobstructed. Nothing could stand in its way.</p><br/><p>The ground quaked even harder as the distance closed between the two sides. The horde of blood fiends was only fifty meters away from them.</p><br/><p>Shi Xueman and the A-1 unit could see the fiends’ red eyes. Their hearts filled with despair and their minds blanked. Their young eyes opened wide in terror.</p><br/><p>The trembling Fatty suddenly rushed towards the motionless Ai Hui and cried, \"Ai Hui! Let’s go!\"</p><br/><p>A sliver of shock ran through Shi Xueman’s body as she stared at the immobile wooden puppet in the centre of her field of vision. Ai Hui appeared to be completely oblivious to the impending danger.</p><br/><p>No!</p><br/><p>She imagined the frail wooden puppet being shredded like a piece of paper in the wake of the stampeding horde.</p><br/><p>This scoundrel hasn’t even settled his debts yet… You still need to pay off your debt…</p><br/><p>Her eyes were brimming with tears, blurring her vision. Fine, we all have to die anyway…</p><br/><p>Looking down from above, the elementalists witnessed the blood fiend horde drawing closer and closer to the group of youths. Twenty meters… Ten meters… Five meters…</p><br/><p>The puppet-like figure standing up to the almighty horde made for a visually striking scene.</p><br/><p>The formidable and the frail, the frantic and the still, the innumerable fiends against the lone figure.</p><br/><p>Nobody else knew, but the sword embryo had become active in response to the danger that was about to befall Ai Hui.</p><br/><p>Within a short span of time, the sword embryo’s throbbing increased to an alarming rate. It was frantically hammering away at record speed.</p><br/><p>The sword embryo’s intense activity expanded Ai Hui’s awareness away from his sword. Details that he could not perceive before surfaced in his mind’s eye like an island appearing in the middle of the sea.</p><br/><p>His sword wielding arm twitched ever so slightly as he awoke from his deep slumber.</p><br/><p>Three meters… Two meters… One meter!</p><br/><p>The red torrent finally crashed into the frail looking figure. At that moment, it was as though time stood still.</p><br/><p>The sword in Ai Hui’s hand reacted instinctively. An exotic chirping sound rang out from the Dragonspine Inferno’s blade as lightning burst forth from its densely-packed pores. A silver glow spontaneously shrouded the entire blade, completely covering it in dense silver lightning.</p><br/><p>As if he was playing the piano, his fingers grasping the sword hilt gracefully press downed one by one as he tightened his grip. He gently lifted the Dragonspine Inferno horizontally in front of his chest.</p><br/><p>The Dragonspine Inferno in his hand vanished.</p><br/><p>An impeccably brilliant sword ray blossomed in its place. A massive [Crescent Moon] enveloped the coarse lightning as it arced through the air, slicing into the advancing horde.</p><br/><p>Exploding with the force of a thousand suns, a radiant blaze lit up the entire space and momentarily blinded everyone within viewing range.</p><br/><p>The [Crescent Moon] was like death’s scythe, instantly claiming the lives of more than ten of the blood fiends nearest to Ai Hui.</p><br/><p>Electricity snaked through the mass of blood fiends, violently shocking those struck into numbness.</p><br/><p>Upon being blinded and shocked, a large number of the blood fiends subconsciously slowed down. Slowing down amidst this densely packed stampede was no different from seeking death.</p><br/><p>The blood fiends behind trampled those in front, plunging the entire area into chaos.</p><br/><p>Ai Hui was unaffected by the silver light. The only thing he could feel was the earth-shattering throbbing between his eyebrows. His heart was similarly beating at an insanely fast speed, matching the rhythm of the sword embryo’s throbbing. His entire inner world shook along with the frantic pulsing.</p><br/><p>Amidst the activity within his mind, Ai Hui realized that time had slowed down considerably. His inner world appeared to have vastly expanded.</p><br/><p>The huge, lifeless bodies were carried forward by their inertia and continued moving towards Ai Hui.</p><br/><p>He sent them flying with a flick of his sword.</p><br/><p>Ai Hui’s movements were extremely fast. The Dragonspine Inferno in his hand became a blur and could hardly be seen with the naked eye. He was an immovable reef, standing stoically against the incoming wave of blood fiends. The red torrent was split down the middle the moment it rushed against the reef, splitting into two smaller torrents made up of blood, severed limbs and huge corpses that poured down its sides.</p><br/><p>The intense, rapid throbbing.</p><br/><p>The unbelievably fast sword strokes.</p><br/><p>Both were moving to the same tenacious rhythm.</p><br/><p>The blinding light dispersed completely.</p><br/><p>Everyone stared dumbfounded at the sword wielding youth standing in the middle of it all. In that moment, his small silhouette looked much larger than before. All they could see was a majestic, towering figure standing amidst the sea of red.</p><br/><p>One man stood alone against the seemingly endless horde of blood fiends. Retreat was not an option.</p><br/>\n</div>"}