{"title": "Chapter 214: Attack and Kill", "id": 214, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-214-attack-and-kill", "volume_title": "Volume 3", "body": "<h1>Chapter 214: Attack and Kill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 214: Attack and Kill</p><br/><p>Translator: JL Editor: CakeHermit</p><br/><p>Shi Xueman was caught in a tough battle.</p><br/><p>The nine-trace blood cat’s speed was as fast as lightning. Shi Xueman barely managed to keep up by giving it her all. Furthermore, the nine-trace blood cat’s agility also far surpassed hers. If not for the constant changes in [Hydromancy], she would have been in an even worse predicament.</p><br/><p>The nine-trace blood cat was different from the other opponents she’d met before. It was nimbler and smarter. Cirrus was unable to play a big role here.</p><br/><p>She had to increase the speed at which she used her spear.</p><br/><p>Having gone through generations of developments, [Hydromancy] was currently a wide-ranging and profound training system. Each family’s absolute art was not formed in a day, but instead consisted of countless years of hard work by the family members.</p><br/><p>The Shi Family still kept with the ancient tradition of being regulated by the clan elders. The numerous clan elders from each generation were commanded by the oldest clan elder. The clan elders usually pay no attention to the affairs of the world, neither do they participate in family affairs. Instead, their sole mission was to constantly develop the absolute arts. They had different specialities. Using the family’s resources, they made use of their gifts and dedicated their entire lifetimes to nurturing [Hydromancy].</p><br/><p>The accumulation of knowledge throughout the generations caused [Hydromancy] to constantly expand. It was like a deep-rooted tree with many branches. Some branches that might look unremarkable would actually be a clan elder’s lifetime’s creation.</p><br/><p>The spear move that Shi Xueman was using was called [Cloud Whale]. It was created by an clan elder who roamed around the world three hundred years ago. It was not the best amongst all the moved in [Hydromancy], but it was her favorite and she had thrown herself into it. It was also because of this that her father had hunted down a humpback cloud whale to create Cirrus for her.</p><br/><p>[Cloud Whale] was not known for being lithe and graceful. Shi Xueman experienced a strain when she met with the nine-trace blood cat.</p><br/><p>Before today, she would have definitely been at a loss when meeting with such a formidable opponent. Now, she had slowly learned to battle. While she was unable to come up with a counter attack, she did not panic. Instead, she gave her all and tried her best to contend against the nine-trace blood cat.</p><br/><p>At that moment, she heard a loud bang.</p><br/><p>The sudden explosion of air surging and hissing shocked everyone present.</p><br/><p>Not just her, the sudden sound caused even the nine-trace blood cat to jolt in shock. Shi Xueman witnessed a stunning scene. There was a crack that resembled an over fifty-meter diameter circular cobweb. From a bird’s eye view, it looked like a blossoming flower.</p><br/><p>In the centre of the blossoming flower was a youth holding a long sword guarding against the teeth of the nine-trace blood lizard. The diffusion of air waves blew around a huge amount of grey dust, like a retreating grey wave.</p><br/><p>Shi Xueman stood blankly for a moment. Just from that explosion of strength, she could determine how terrifying the nine-trace blood lizard’s attack was; however, Ai Hui had managed to block it off. Ai Hui’s figure was puny and his shirt was tattered and unclean. He looked like a mess, yet, his small figure stood upright. This was a scene that stirred their hearts and brought many to astonishment.</p><br/><p>This chap… Hadn’t he failed finishing the Eight Palaces Completion?</p><br/><p>How had he managed to block that attack?</p><br/><p>This chap…</p><br/><p>Unlike Shi Xueman, Duanmu Huanghun was situated at a better location and witnessed the entire process. After the surge of air had swept away, he saw the upright Ai Hui and the nine-trace blood lizard which was unable to move even an inch. It was as if Duanmu Huanghun had just gulped some strong spirits.</p><br/><p>His handsome face became flushed as if he were drunk.</p><br/><p>A sense of excitement and an intent to battle that was hard to put into words led to an uncontrollable tremble. Every inch of his skin was burning up. The raging inferno lit up the wasteland.</p><br/><p>His blood was raging under that strong inferno. His heart was churning with the strong intent to battle. He wanted to look up into the sky and blow a long whistle.</p><br/><p>His fists were tightly clenched and his nails turned white from the pressure. His trembling was like an electric current spreading throughout his whole body. He strongly restrained himself.</p><br/><p>Because this was a magnificent performance by Ai Hui and not him, Duanmu Huanghun.</p><br/><p>In that moment, his long, narrow eyes glinted with a strange yet frantic ray. Unconsciously, he licked his pale lips. This was a battle that he was looking forward to. This was the glory that he had been waiting for.</p><br/><p>He narrowed his eyes and rushed towards the nine-trace blood fox.</p><br/><p>Fatty’s loud howls were as if a wolf had bitten him on his rear.</p><br/><p>Jiang Wei was the first to react. Releasing an arrow from his bow, he screamed and ran towards the nine-trace blood lizard.</p><br/><p>Only then, did the others start to react.</p><br/><p>Holding on to the Golden Silk Longbow, Sang Zhijun placed four sharp arrows close together. A ray of light flashed past her eyes. The four arrows swiftly blended into one and became a brilliant ray of light.</p><br/><p>The nine-trace blood lizard was in a pathetic state. Its force had been met with force and it had received a tremendous impact. While it was still in a state of bewilderment, it was met with countless of attacks and was placed in a dangerous and difficult situation.</p><br/><p>Furthermore, as the red glow surrounding its body had dispersed, all these attacks landed solidly on its body.</p><br/><p>The rays immediately swallowed up the nine-trace blood lizard. It started to tremble violently and its disintegrated scales spattered around.</p><br/><p>As Ai Hui was in close proximity to the nine-trace blood lizard, everyone withheld their attacks for fear of affecting Ai Hui. Nevertheless, the waves of attacks inflicted serious damage on the nine-trace blood lizard. Its scales were all over the place and its body was badly mangled. Black smoke was rising in spirals. It took the most hits on its abdomen, where there was now a thumb-sized hole out of which blood was flowing out. Sang Zhijun and Jiang Wei’s masterpiece. Jiang Wei’s arrow had cut open the nine-trace blood lizard’s scales and Sang Zhijun’s Arrow Fusion Technique had landed on the exact same spot, piercing through the nine-trace blood lizard’s abdomen.</p><br/><p>The nine-trace blood lizard displayed extraordinary vitality. Even though it looked battered and exhausted, it didn’t look any less threatening. Its initially cold eyes had now become scarlet red. Its eyes contained a fury that caused heart palpitations.</p><br/><p>It gave a loud snarl. Not only did it not retreat, it brazenly tore at Ai Hui. The densely packed teeth sent chills through the people watching. The teeth were like huge metal shears and the thick neck contained a formidable brute force. Even before the nine-trace blood lizard had gone through the blood transformation, it had easily bitten a bison to death. The bison’s huge body had been snapped in half by the lizard’s teeth.</p><br/><p>Now it was even stronger and its teeth was sharper and harder. Even if there was a thick steel bar blocking its way, it could still break it effortlessly.</p><br/><p>It looked like the nine-trace blood lizard was going to bite Ai Hui. Ai Hui moved.</p><br/><p>He was so fast, his movements were a blur. The nine-trace blood lizard’s vision blurred and a violent pain exploded in its mouth. Its tongue was like a blood ball that burst into a bloody mist. Blood started to immediately flow out of its mouth, which had become filled with the taste of fresh blood. It was the taste of its own blood.</p><br/><p>It had never before experienced such intense pain. It retreated. The pain controlled the blood-traced lizard’s movements. It tumbled around on the floor to relief the pain, but to no avail. Fresh blood continued to flow out through the gaps in its remaining teeth. Its head constantly knocked on the floor. The floor quaked and stones shattered and flew.</p><br/><p>Sang Zhijun and the rest reacted much faster this time. Different forms of attacks were thrown towards the nine-trace blood lizard. Many arrows and rays of light enveloped the blood-traced lizard in a split instant.</p><br/><p>Without any restraints, the people threw in all their might and attacked like crazy.</p><br/><p>They did not dare to stop and they did not bother to conserve their elemental energy. If they did not grasp hold of this opportunity, any future attack from the nine-trace blood lizard could very well cause many deaths and casualties.</p><br/><p>Facing such a blood-traced fiend, they were not in a position to conserve their elemental energy. The fact that they could act with their elemental energy was already a good outcome.</p><br/><p>Only after they had expended all their elemental energy and poured it onto the nine-trace blood lizard, did they stop their attacks.</p><br/><p>Everyone was panting for breath.</p><br/><p>The nine-trace blood lizard laid motionless and everyone exhaled in unison.</p><br/><p>This round of attacks was fatal to the nine-trace blood lizard. No matter how strong its will to live was, it could not bear those crazy attacks from all over the place.</p><br/><p>The poor nine-trace blood lizard did not have a single piece of intact flesh on its body.</p><br/><p>\"It should be dead by now?\" Fatty asked apprehensively.</p><br/><p>The yellow ray in Lou Lan’s eyes flickered. \"Yes, it is dead.\"</p><br/><p>Fatty gave a long exhale. After a moment, he asked anxiously, \"Is Ai Hui alright?\"</p><br/><p>Lou Lan tilted his head. \"Ai Hui is in a strange condition. Lou Lan is also unable to differentiate, however, he has no injuries. Let’s not disturb Ai Hui. He needs to break away from that state of mind by himself.\"</p><br/><p>\"As long as he is not injured.\" Fatty’s gaze relaxed. Thinking back to his pathetic state, he pleaded, \"Lou Lan, do not tell Ai Hui I fled.\"</p><br/><p>\"Why not?\" Lou Lan widened his eyes. \"Fatty was very brave.\"</p><br/><p>\"It is no use being brave.\" Fatty’s face was filled with grief and indignance. Could being brave reduce the amount of training? No!</p><br/><p>If Ai Hui found out about this, what would await him would be countless training assignments.</p><br/><p>The current training assignments that Ai Hui designed could cause Fatty to whine for days. Thinking back, life was better in the Wilderness. Ai Hui did not know then what training was. Otherwise, he definitely would not have had a chance to leave the Wilderness.</p><br/><p>Not as a result of being eaten up by the dire beasts; instead, he would have worked to death doing Ai Hui’s training.</p><br/><p>Looking at his fat, Fatty was filled with grief and indignation. He has lost weight from all the training.</p><br/><p>\"Was the blood crystal destroyed by us?\" Sang Zhijun asked worriedly. The blood crystal was even more important than money.</p><br/><p>\"Nope, just hand it over to Lou Lan!\" Lou Lan said happily and confidently. He transformed into a sandstorm and rushed toward the mangled nine-trace blood lizard. The sandstorm wrapped around the blood-traced lizard and the flesh was quickly stripped off to expose the white bones.</p><br/><p>The sandstorm rotated constantly until only shattered bones remain.</p><br/><p>The sandstorm returned to everyone and transformed back into Lou Lan.</p><br/><p>Ding, ding, ding.</p><br/><p>A melodious chime could be heard. Lou Lan was holding a few more blood crystals. After checking, he happily announced, \"These blood crystals’ quality is even better than before!\"</p><br/><p>The students cheered in unison.</p><br/><p>Soon enough, their gazes fell on the remaining two who were still in the midst of battle.</p><br/><p>Fatty stared for a moment before slapping his thigh and shouting, \"Hey! Lure the monster over and let Ai Hui kill it!\"</p><br/><p>Sang Zhijun and the rest of the students’ eyes brightened. Fatty’s idea was good. Given Ai Hui’s puppet-like state, no matter what rushed towards him, he would kill it without a second thought. Shi Xueman and Duanmu Huanghun only needed to guard at the side. They could strike when the opportunity arises and it would be easier for them to gain victory.</p><br/><p>Fatty’s shout immediately triggered the two’s anger.</p><br/><p>Shi Xueman looked on coldly. To get help from that scoundrel? My goodness.</p><br/><p>The craze in Duanmu Huanghun’s eyes became stronger. To be defeated by Ai Hui? Dream on.</p><br/>\n</div>"}