{"title": "Chapter 223: The Rupture Of The Sword Embryo", "id": 223, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-223-the-rupture-of-the-sword-embryo", "volume_title": "Volume 3", "body": "<h1>Chapter 223: The Rupture Of The Sword Embryo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 223: The Rupture Of The Sword Embryo</p><br/><p>Translator: TYZ Editor: X</p><br/><p>The piece of flesh entangled by the sword glow suddenly exploded. Ai Hui’s sword was able to react instantly. The sword glow was like a wall, blocking the flying shrapnel from the exploded piece of flesh.</p><br/><p>The ground within one meter of Ai Hui was sparkling clean. Outside this one meter range, there were fragmentary pieces of flesh and blood all over the ground.</p><br/><p>If Ai Hui was lucid, he would have immediately sensed that there was a conspiracy. However, at this moment, Ai Hui’s mind was completely focused on his sword and he had lost the ability to think clearly.</p><br/><p>In fact, he did not have the luxury of time to think.</p><br/><p>The blood fiends suddenly became berserk, causing everyone’s facial expression to change drastically. Previously, the momentum of the blood fiends’ attacks were already terrifying. Now, the blood fiends had completely lost all their rationality and they looked as if they had been provoked to insanity by some intense stimulus.</p><br/><p>The berserk blood fiends’ attacking power rose sharply, making them more terrifying than usual.</p><br/><p>This unforeseen event happened too suddenly. The rest of the group were unable to react in time. They could only look on blankly at the berserk blood fiends surging toward Ai Hui. The blood fiends completely lost their sanity, trampling over each other as they surged forward. In the blink of an eye, nearly half of the blood fiends were injured. Even so, this did not stop them from rushing toward Ai Hui recklessly.</p><br/><p>Ai Hui…</p><br/><p>The previous joy of victory disappeared in an instant. Everyone’s face turned unsightly, filled with terror.</p><br/><p>The hovering nine-traced blood falcons in the sky let out loud screeches. Spreading their wings, they streaked toward Ai Hui like a bunch of furious red arrows. Their terrifyingly fast speed made their screeches abnormally sharp.</p><br/><p>Ai Hui’s surroundings were flooded with blood fiends.</p><br/><p>Previously, as his elemental energy depleted by a huge amount, the number of blood fiends decreased as well. As such, the threat of the blood fiends was lowered, causing his sword embryo’s pulsation to decrease gradually. When these berserk blood fiends flooded toward him, however, there were a few blood fiends that came within one meter of Ai Hui’s body, causing the sword embryo to feel threatened and pulsate frantically.</p><br/><p>As the sword embryo pulsated faster and faster, Ai Hui’s sword moved faster and faster as well.</p><br/><p>Any blood fiend that traveled within one meter of him was met with a fatal streak of sword light. Like his sword, Ai Hui was emotionless and did not have the slightest bit of fear.</p><br/><p>In the blink of an eye, the surrounding blood fiends became corpses that piled up like mountains.</p><br/><p>Instead of decreasing, the number of blood fiends kept on increasing. The pulsating rate of the sword embryo continued to escalate, getting faster and faster.</p><br/><p>Thump! Thump! Thump!</p><br/><p>Ai Hui was like a machine. The speed at which he executed his sword moves was increasing rapidly. The sword beams he created were like streaks of lightning, zigzagging through the air. The speed at which the sword beams faded could not even keep up with the speed at which Ai Hui executed his sword moves. The sword beams streaking around Ai Hui were becoming concentrated and brighter, materializing into darting lights and shadows.</p><br/><p>Nevertheless, the blood fiends were still able to close in on Ai Hui.</p><br/><p>Within 10 seconds, the Dragonspine Inferno’s range of motion had been compressed to half a meter. Within these 10 seconds, countless blood fiends had fallen. Ai Hui was like a highly efficient harvester, wildly harvesting the lives of the blood fiends.</p><br/><p>His range of motion, or rather the sword’s range of motion, or rather the sword embryo’s range of motion was being compressed bit by bit.</p><br/><p>The surging ice-cold sword beams could not stop these berserk blood fiends. They had completely lost their fear of death.</p><br/><p>The pulsating rate of the sword embryo continued to rise. Like a wild beast that had been pushed to the brink of death, it erupted with astonishing power. The sword beams produced by Ai Hui intensified abruptly, pushing his range of motion back to a meter.</p><br/><p>Almost instantly, however, his range of motion was compressed inward again.</p><br/><p>At a visible rate, his range of motion was compressed bit by bit. Half a meter, 40 centimeters, 30 centimeters...</p><br/><p>When his range of motion was reduced to merely 30 centimeters, the rapidly beating sword embryo suddenly ruptured!</p><br/><p>Boom!</p><br/><p>When the sword embryo suddenly ruptured, an invisible storm gushed through every single part of Ai Hui’s body.</p><br/><p>Ai Hui’s absolute focus on his sword had been withdrawn.</p><br/><p>He felt as if he had woken up from a long and bizarre dream.</p><br/><p>His face was blank…</p><br/><p>The gaping bloody mouth of a blood fiend was merely inches away from his face. He could clearly see the bloodstains on those ghastly white teeth and the disgusting saliva that dripped down from the corner of its mouth. Ai Hui’s face was blasted by a whiff of the stench.</p><br/><p>There was another unknown blood fiend behind him. Its heavy breaths puffed over his neck like mini tornadoes, causing his hair to stand on end.</p><br/><p>The sharp screeches above Ai Hui’s head sent a shiver down his spine. Did someone up there throw a javelin at him?</p><br/><p>Ai Hui quivered in fear as he cursed in his heart. How could a mere dream make things turn out like this?</p><br/><p>However, he had no path of retreat at the moment. He did not even have the time to curse and hesitate. At this critical junction, Ai Hui was unusually calm.</p><br/><p>His body had been emptied of elemental energy. The only thing that put him at ease was the indescribable confidence that he felt from the Dragonspine Inferno in his hand.</p><br/><p>The only thing he could do now…</p><br/><p>Before he could make any moves, an invisible energy wave suddenly flooded through every section of his body.</p><br/><p>Boom!</p><br/><p>Ai Hui’s eyes became abnormally bright all of a sudden. He did not know that his pupils had become the shape of a biting cold blade. The razor-sharp aura enhanced his vision, making it as keen as his sword. His scalp tingled, as if there was a pair of invisible hands that was forcefully pulling his hair. Traces of sword aura exuded from the pores on his skin.</p><br/><p>Numerous pin-sized holes appeared on Ai Hui’s clothes in an instant.</p><br/><p>What was going on?</p><br/><p>An intense burst of aura blasted toward the sky. It looked as if a legendary sword had been unsheathed.</p><br/><p>The blood fiends that were near Ai Hui froze. They felt as if there was a sword being pressed against their throat, head, and eyes.</p><br/><p>Boom! Rolling thunder roared in the sky. Tumultuous, ragged, dark clouds gathered from all directions and loomed over the city. Dazzling lightning danced in the thick and boundless sea of dark clouds. The sky above Central Pine City dimmed immediately, as if it was already night time.</p><br/><p>These unforeseen events all happened in one moment.</p><br/><p>The abnormal weather startled all of Central Pine City. Everyone gazed blankly at the rolling dark clouds that looked as if they were going to crash down on the city at any moment. No one had ever seen an apocalyptic scene like this before. At this point, the rampaging blood fiends in Central Pine City had their limbs soften in terror and sat down blankly on the ground.</p><br/><p>What was happening now?</p><br/><p>Shi Xueman and the rest were looking at the sky in a daze. This grandeur seemed… to be coming from Ai Hui…</p><br/><p>The frenzied look in Duanmu Huanghun’s eyes became even more intense. He muttered to himself incoherently, \"Abnormal natural phenomenon! There must be an evildoer! It turns out you’re so powerful! Hahaha, good, good, good… Only an evildoer like you is fit to be the rival of I, Duanmu Huanghun! Hahahaha…\"</p><br/><p>Everyone disregarded him.</p><br/><p>Shi Xueman and the others were dumbstruck, but everyone had a premonition that something amazing was going to happen.</p><br/><p>Swordsmanship? Was there such a powerful swordsmanship in this world?</p><br/><p>Tian Kuan, who had already escaped from the streets, froze for two seconds before raising his head up slowly. The rolling dark clouds above his head were so low that they looked as if they could be touched with his hand. The thick lightning bolts streaked to and fro through the dark clouds, resembling dancing silver dragons. The destructive aura of the lightning made him shiver in fear.</p><br/><p>The might of the lightning struck fear in all living things.</p><br/><p>Those weaker blood fiends were lying flat on the ground, pissing and sh*tting involuntarily out of fear.</p><br/><p>Why…</p><br/><p>How could this be…</p><br/><p>Similarly, Tian Kuan was trembling. His gaze was filled with fear and disbelief. What level of opponent he was dealing with right now?</p><br/><p>Ai Hui had never experienced this before.</p><br/><p>He felt like he was a sword. Every part of his body corresponded to a part of a sword’s body. He felt that his mind was as pure and concise as a sword, so sharp that nothing could block it. He felt that anything he grabbed—the wind in the air, the light from the sun, or even the lightning bolts in the dark clouds—could become a sword.</p><br/><p>Yet, he was not happy since his sword embryo had exploded.</p><br/><p>The sword embryo was formed using essence-breath-spirit. He had spent so much effort and time, and had even risked his life to nurture the sword embryo to this stage.</p><br/><p>Now, everything was gone.</p><br/><p>The energy wave that flooded his body was made of the essence-breath-spirit that he had been nurturing.</p><br/><p>At this moment, the level of his essence-breath-spirit were at its top form, displaying an unprecedented might. Even though his body was emptied of elemental energy, it did not pose too much of a problem for him. Previously, while he was focused on the sword, the deluge of intricate data he received had propelled his understanding of swordsmanship and elemental energy to a whole new level.</p><br/><p>Ai Hui raised his head and looked at the rolling dark clouds and looming lightning. This abnormal phenomenon only appeared when the sword embryo was destroyed.</p><br/><p>Perhaps this phenomena arose because the sword embryo was having its most dazzling moment right now.</p><br/><p>Ai Hui carefully perceived his surroundings and all the minute details. This was the last blessing that the sword embryo had given him. The ruptured sword embryo had released all of his essence-breath-spirit. Looking at it from a different perspective, the essence-breath-spirit had evolved, which also meant that the sword embryo had ascended into a higher realm.</p><br/><p>Even though the current situation would not last very long, it was long enough for Ai Hui to glimpse the splendor of the sword embryo. Every bit of comprehension would help Ai Hui greatly.</p><br/><p>Ai Hui noticed a huge amount of specific aspects that he had never come across before.</p><br/><p>For example, he noticed that there was a subtle bond between his Dragonspine Inferno and the lightning in the dark clouds.</p><br/><p>Knowing that the time was going to be up soon, Ai Hui sighed in his heart. His feelings were very complicated. He had nurtured the sword embryo for the sake of surviving in the Wilderness. During his three years in the Wilderness, the sword embryo was of utmost importance to him. Without the sword embryo, he would not have survived.</p><br/><p>Was it finally time to say goodbye?</p><br/><p>Ai Hui felt an indescribable sadness in his heart. The Dragonspine Inferno let out a sorrowful lament as if it had sensed the anguish in Ai Hui.</p><br/><p>When Ai Hui heard it, he could not help but laugh. He did not expect himself to be so emotional.</p><br/><p>Since it’s time to bid farewell, I might as well do it in the most majestic way!</p><br/><p>Ai Hui suddenly raised his Dragonspine Inferno and pointed it toward the sky.</p><br/><p>Rumble!</p><br/><p>A dazzling lightning bolt struck down from the sky and hit the Dragonspine Inferno.</p><br/><p>The Dragonspine Inferno could not endure such a powerful lightning bolt and its surface started to melt like a burned candle. The only things that remained imposing and unwavered were the seven prismatic crystals. Numerous streaks of lightning were twisting and winding around them. It appeared as if Ai Hui was holding a sword of lightning.</p><br/><p>He took a huge step forward and flew up in the sky.</p><br/><p>The surging lightning passed through Ai Hui’s sword and into his body. Then, the lightning was directed to the two palaces in his hands and his earth palace. His breathing became clear and smooth. Like a well-maintained machine, every part of his body operated efficiently after being injected with lightning. Master definitely would not expect him to use lightning to channel the third move from the sword pill…</p><br/><p>As he swung his sword down, numerous lightning bolts suddenly struck down from the sky at the same time.</p><br/><p>Dust to dust, earth to earth.</p><br/><p>[Dust Fall]!</p><br/>\n</div>"}