{"title": "Chapter 232: Fatty’s Confidence", "id": 232, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-232-fatty%E2%80%99s-confidence", "volume_title": "Volume 3", "body": "<h1>Chapter 232: Fatty’s Confidence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 232: Fatty’s Confidence</p><br/><p>Translator: Cynthia Editor: X</p><br/><p>Ai Hui had some ideas about his own body.</p><br/><p>Previously, his sky palace always went astray because of the existence of the sword embryo. As a result, although it had absorbed abundant elemental energy, he could not reach Initial Completion. After the sword embryo exploded, although the sky palace was still left with fluctuations, there were no obstacles any more, and Ai Hui naturally achieved the breakthrough.</p><br/><p>As for the elemental energy pills, it was more a problem of habit.</p><br/><p>The rotation of the elemental pills was very smooth, which meant that this procedure was feasible. Ai Hui did not know if anyone had ever derived the essence of how the sword pills functioned, but he knew that it was a common form. For example, the elemental energy bead was also in this form.</p><br/><p>An inheritance named the [Starry Sky] required the practitioner to coagulate his or her elemental energy into the form of a bead.</p><br/><p>After the formation of Ai Hui’s elemental energy pillls, the traces of sword energy contained in the elemental energy were restrained, and its stimulation of the palaces sharply weakened. The pills were more effective than he expected because the elemental energy was milder, or to be more accurate, more stable than spiritual force.</p><br/><p>Previously, he thought that spiritual force was far more powerful than elemental energy, but now he had some new understandings. In some aspects, elemental energy was indeed inferior to spiritual force, but it also had its own advantages that spiritual force could not provide.</p><br/><p>For example, the changes of the five residences and eight palaces were not as flexible and varied as the cultivators’ meridians system, but it was simpler, stabler, and sturdy.</p><br/><p>Compared with spiritual force training, which was dangerous and unpredictable, elemental energy training was much safer. So far, due to the existence of the sword embryo, the elemental energy within Ai Hui’s body had changed many times, but he was still in perfect condition.</p><br/><p>Taking a look at the swordplay manuals and spells from the Cultivation Era, even for the cultivators from big sects that were known for their purity and righteousness, any carelessness in training was likely to lead them astray and cause to go crazy. The training of the sword embryo was even more dangerous. As for blood arts training, it was simply seeking life in the midst of death.</p><br/><p>Everyone in the Avalon of the Five Elements was training. Even though resources were limited, as long as they were persistent, their ability could gradually increase.</p><br/><p>In comparison to spiritual force, elemental energy was simple, safe, and easy to train or use. Everyone could train with a very slim chance of deviating.</p><br/><p>The Avalon of the Five Elements was created in a hopeless situation. Maybe such simple and safe energy was what they needed at that time.</p><br/><p>The reason why the elemental energy system was inferior to the spiritual force system was not because of its outdated ideology, but due to its lack of accumulation. Elemental energy was like fertile soil. After a certain period of time, it could also produce fruitful harvests.</p><br/><p>For no particular reason, Ai Hui thought of the Old Territory. It was a pity that few people in the Old Territory practiced elemental energy.</p><br/><p>\"Fatty, let’s practice fighting.\" Ai Hui waved to Fatty.</p><br/><p>Hearing Ai Hui’s words, Fatty ran to him without hesitation. He had a heavy shield in his hand that was taller than him. The shield was colorful, as if it had been patched up many times. The shield he used to use was destroyed, and this one was scrapped together with a shield he picked up somewhere.</p><br/><p>Lou Lan’s skill was always trustworthy. Although it did not look appealing, it was secure enough.</p><br/><p>Heavy shield, heavy armor, heavy Fatty. When he ran, he was like a mobile mountain and the ground rumbled.</p><br/><p>\"A Hui, no problem,\" Fatty agreed as he rolled his eyeballs, \"but as a saying goes: financial matters should be settled clearly even between brothers. I can’t do this for free. I’ll be your training partner, and the debt between us is cancelled, okay?\"</p><br/><p>Ai Hui looked Fatty up and down in surprise. Then, he smiled and said, \"As long as you can stop me.\"</p><br/><p>\"No problem!\" Fatty laughed. He thumped his chest and said confidently, \"How can I ask you for money if I cannot stop you! You know I always remember the rules!\"</p><br/><p>He was of course confident. The rewards for the blood crystals included inheritances. When Ai Hui was unconscious, everyone else had just reached the Initial Completion stage and went to the mayor’s residence to select inheritances that were suitable for them.</p><br/><p>A heavy shield bearer who had attained elemental internalization was an important role in the team. To accelerate Fatty’s progress, Shi Xueman and Duanmu Huanghun specially chose an inheritance that best suited Fatty and gave it to him.</p><br/><p>Both of them had family inheritances, so these extra inheritances were unnecessary for them, but they could help Fatty progress faster.</p><br/><p>Now Fatty owned three inheritances, the [Eternal Crucible], [Spinning Carapax Shield], and [Red River Belt]. They were all selected by Shi Xueman.</p><br/><p>Shi Xueman was experienced and well-informed in this aspect. No one knew which inheritances suited Fatty better than she did.</p><br/><p>The magistrate court was very generous this time. The inheritances were all refined arts which could be sold for a good price on the market.</p><br/><p>There were various kinds of inheritances on the market which could be roughly classified into four categories. The most powerful one was undoubtedly the absolute art type, while the next level were called the extraordinary arts, which referred to an inheritance that had the potential to become an absolute art. The third level were the refined arts. In this level, the inheritances were unique with a degree of excellence. Lastly, the fourth level were the most common inheritances and named as ordinary arts.</p><br/><p>In each level, the inheritances were further classified into two classes, A or B.</p><br/><p>The classification of each inheritance had to be evaluated by professionals in each and every aspect. The extraordinary and absolute arts would be sent to the specialized ministry of the Elders Guild for further evaluation and authentication.</p><br/><p>To raise the level of one’s inheritances was another important way to gain Heaven Merit Points.</p><br/><p>Whoever was able to develop an extraordinary skill to an absolute art would obtain a lot of Heaven Merit Points from the Elders Guild, even though the new absolute art would not be disclosed to the Elders Guild. The Elders hoped to encourage the continuous development of all kinds of inheritances in this way.</p><br/><p>If the developers were willing to sell such arts, they would receive an amazing fortune. The Elders Guild and each major family were all more than willing to purchase a brand new absolute art.</p><br/><p>Every year, many people became famous and wealthy by augmenting inheritances into absolute arts. From this process, many talented elementalists were attracted to and engaged in arts development.</p><br/><p>Ai Hui’s [Big Dipper], for example, was a B-class extraordinary art. If he could develop it into an absolute art, even if it was still B-class, the money he would earn would be enough for him to spend for the rest of his life.</p><br/><p>The gap between an extraordinary art and an absolute art seemed small, but was in fact similar to an unbridgeable chasm.</p><br/><p>The three inheritances Fatty received were all refined arts.</p><br/><p>The [Eternal Crucible] was a body-tempering inheritance. Once one began to practice it, his or her body became like a crucible, with elemental energy like fire as well as blood and flesh like iron that underwent tempering day and night. Even without special training, the fire elemental energy within would continuously temper the body.</p><br/><p>The [Eternal Crucible] could enhance the physique of a fire elementalist in an all-round way. It was simple, but also riddled with many weaknesses. For example, it would take a very long time to see its effects due to its slow process.</p><br/><p>Just because of this weakness, it was only evaluated as a B-class refined art.</p><br/><p>[Spinning Carapax Shield] was a shield-based inheritance that all elementalists could practice. It enabled one to stand as firm as a rock when attacked by eliminating the force of the attack through spinning power.</p><br/><p>Few elementalists preferred shield-based inheritances. Those who did were usually known for their physical strength, but the [Spinning Carapax Shield] required high technical skill.</p><br/><p>It was also a B-class refined art.</p><br/><p>Among the three inheritances, only the [Red River Belt] was a A-class refined art. With this art, fire elementalists could form a belt of fire like a floating red river that surrounded them, which was how it got its name. As an A-class refined art, it had its unique aspects. Apart from the damage it could inflict on its enemies, the flame could also absorb the scattered elemental energy from the enemies to strengthen itself.</p><br/><p>The [Red River Belt] was a good weapon in protracted wars, especially for shield bearers. Its value was more than the total price of the [Eternal Crucible] and [Spinning Carapax Shield] combined.</p><br/><p>If Fatty was left to his own devices, he would definitely have selected the most expensive arts, but Shi Xueman chose these three inheritances after careful consideration. She believed her selections would instantly improve his fighting skills.</p><br/><p>This was why Fatty was currently so confident.</p><br/><p>The others heard the conversation and crowded around the pair. This was Ai Hui’s first actual-combat training since he woke up, so they were all very curious.</p><br/><p>Fatty grabbed his heavy shield tightly and squared away. A light red belt of fire floated around him. He shouted loudly, \"Come on!\"</p><br/><p>Sang Zhijun’s eyes lit up. Her family was important, although not as well renowned as Shi Xueman’s family, and her horizons were much broader than most.</p><br/><p>It was not easy for Fatty to make so much progress within such a limited period of time.</p><br/><p>Ai hui borrowed a long sword from a student, tested it in his hand, then stood in front of Fatty.</p><br/><p>Although Fatty looked very confident just now and pretended not to care at all, he was in fact treating the situation as if confronted with a formidable enemy and totally hid himself behind the shield.</p><br/><p>Facing the human-shaped target, Ai Hui was not lenient at all. His sword hit the heavy shield hard.</p><br/><p>A spinning force came from the shield that twisted his sword. Ai Hui murmured in surprise, \"Really better than before!\"</p><br/><p>Fatty exclaimed lightly and did not dare to feel proud. Instead, he focused harder.</p><br/><p>With no more nonsense, Ai Hui stabbed out with the long sword again and again.</p><br/><p>They were all the simplest sword moves, such as the [Oblique Slash] and [Misty Strike], but the speed was very swift. Bright sword rays flashed through the air. In Ai Hui’s hand, these simple sword moves sped up as the sword light strengthened..</p><br/><p>The unspeakable familiarity granted Ai Hui a feeling that each stab was within his control. He knew this was because of his deepened understanding of the sword. Still, he could not help being intoxicated with this enjoyable feeling.</p><br/><p>Ai Hui continuously adjusted each strike, and the power kept elevating. While others could hardly detect it, Ai Hui could clearly sense it himself.</p><br/><p>The onlooking students were attracted by his sword moves. They were simple, but natural and smooth.</p><br/><p>Fatty could feel the difference. He felt the force on the shield grow more and more difficult to offset. The force from each stab was not powerful, but was extremely sharp, as if it was about to pierce the shield.</p><br/><p>Suddenly, Ai Hui’a arm tingled. With a weird convulsion, the sword move became slack.</p><br/><p>Ai Hui smiled bitterly. It was the lightning left in his body that stimulated his blood and flesh, which led to his deformed move. Fortunately, it was not a real battle, or he would be in great danger.</p><br/><p>The numbness lasted only a minute, and Ai Hui soon recovered.</p><br/><p>After the warm-up, he had already become excited and decided to try to use his elemental energy.</p><br/><p>Ai Hui stabbed out again as before, but this time he wanted to use the [Big Dipper]. He then concurrently activated his elemental energy pills, and the seven pills set out simultaneously.</p><br/><p>His sword move suddenly slackened.</p><br/><p>It turned out that he miscalculated the speed of the elemental pills, which were much faster than that of the elemental energy before.</p><br/><p>Ai Hui tried again, but it was still slack. Again, the elemental energy pills failed to synchronize.</p><br/><p>Ai Hui stabbed more than 30 times and had consumed a lot of elemental energy, but never once did he succeed. The elemental pills rotated rapidly in his body, so even a small deviation would lead to synchronization failure.</p><br/><p>Fatty remained cautious. He knew he could never be too careful in front of Ai Hui because he was fully aware of Ai Hui’s ability.</p><br/><p>The next instant Ai Hui stabbed out, his eyes lit up.</p><br/><p>This was the first time that the elemental energy pills had synchronized. Like seven shooting stars from seven directions, they merged into the long sword in his hand at precisely the same time.</p><br/>\n</div>"}