{"title": "Chapter 238: A New Sword", "id": 238, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-238-a-new-sword", "volume_title": "Volume 3", "body": "<h1>Chapter 238: A New Sword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 238: A New Sword</p><br/><p>Translator: TYZ Editor: X</p><br/><p>A sword shrouded by an ash-gray cloud levitated silently above the table.</p><br/><p>The ash-gray cloud differed from the white cloud that engulfed the Cirrus in that it was much denser. Tiny streaks of lightning zigzagged through the cloud, resembling a small thunder cloud.</p><br/><p>The strip-like dark cloud looked like a sword sheath, but was actually not.</p><br/><p>Seven silver daggers meandered rapidly in the cloud like swimming fish. Each dagger was six centimetres in length. Their silver surfaces were so smooth that one could see his or her reflection in them. Each dagger was embedded with a lightning-based artifact remnant as well.</p><br/><p>The occasional lightning sparks on the body of the sword were induced by the high-speed flight of the seven daggers.</p><br/><p>\"It’s so beautiful! Is this made of that snake vertebrae?\" Shi Xueman could not believe her eyes and took a closer look. \"Is this a sword? Does it need to be unsheathed?\"</p><br/><p>\"No need, Xueman, that is a honing cloud,\" Lou Lan explained seriously. \"It’s the blade of the sword.\"</p><br/><p>The honing cloud was a special type of cloud. When one imbued it with elemental energy, it would produce a sharpening effect. The honing cloud was a special local product of Palette Cloud Village. Palette Cloud Village produced various kinds of weird clouds, such as heavy and dense lead clouds, colourful and gorgeous rosy clouds, green poison clouds, flame-spouting fire clouds, etc.</p><br/><p>Just like the Jadeite Forest, where there were countless species of plants, Palette Cloud Village had countless types of clouds. Only water elementalists could appreciate the spectacle of these clouds.</p><br/><p>\"Blade? Using the honing cloud to make the blade of the sword? That’s a clever idea!\" Shi Xueman’s eyes lit up and praised, \"Lou Lan is really fabulous!\"</p><br/><p>\"Thank you, Xueman.\" Lou Lan’s eyes were smiling brightly, but soon after, his tone was filled with regret. \"The snake vertebrae is highly functional and was a top-grade material. Looking at it from the five elements’ perspective, it is both metal-attributed and water-attributed. Metal collects water, which is why I used the honing cloud to make the blade of the sword. However, due to differences in the grade level of the materials used, the power of the snake vertebrae are not optimized. The sword tassel is made up of fire prairie stones, which are a low-grade material. Still, it’s better than nothing. As for the seven daggers, they are made up of silver glow wood, which is strengthened by the water elemental energy in the honing cloud. The honing cloud and the silver glow wood are roughly the same grade, therefore, combining them provides a great boost to one’s elemental energy. This sword can only be considered as a Mysterious-grade weapon. However, its unique lightning properties and the outstanding qualities of the snake vertebrae would make this sword a rather powerful Mysterious-grade weapon.</p><br/><p>\"If the honing cloud was replaced by heavenly honing cloud, the silver glow wood was replaced by thousand-traced silvery wood, and the fire prairie stones were replaced by molten core stones, then this sword will be an exceptional Earth-grade weapon. With the lightning properties, it would be considered a rare Earth-grade weapon.\"</p><br/><p>Everyone understood what Lou Lan was talking about. Even though they did not know how to specifically craft weapons, they still knew the fundamentals. The grading system for weapons was not as complicated as the classification of food ingredients. The highest and most powerful grade were the Heaven-grade weapons, followed by the Earth-grade weapons, then the Mysterious-grade weapons, and finally the most common grade, the Grass-grade weapons.</p><br/><p>Other than unique materials, the grade of a weapon was usually dependent on its weight, sturdiness, and other physical attributes. However, the most important factor was still the availability of elemental enhancement in the weapon.</p><br/><p>The elements of metal, wood, water, fire, and earth made up a complete cycle, growing and multiplying without an end. The enhancement between the five elements was one of the most important characteristics of the five elemental energies. Weapons were based on this theory as well. Some types of elemental energy could enhance each other while some could restrain each other.</p><br/><p>If a weapon possessed all five elements and they enhanced each other, that weapon was considered a Heaven-grade weapon. Heaven-grade weapons had very low elemental energy consumption requirements for elementalists. Furthermore, they could produce many wondrous effects during the process of elemental enhancement.</p><br/><p>An Earth-grade weapon had one less element than a Heaven-grade weapon. There were only four elements in an Earth-grade weapon. This was why there was a huge disparity between a Heaven-grade weapon and an Earth-grade weapon. Having one less element, the elemental cycle was broken, disrupting the natural flow of the elements and differing in terms of quality.</p><br/><p>The disparity between an Earth-grade weapon and a Mysterious-grade weapon was not too big. A Mysterious-grade weapon was composed of materials from three different elements. Hence, the power and variability of a Mysterious-grade weapon were inferior to an Earth-grade weapon.</p><br/><p>As for Grass-grade weapons, most of them were roughly-made and crude. They were made up of materials that usually contained only one element or two poorly combined elements on occasion.</p><br/><p>In theory, weapon crafting seemed very easy, but in reality, the process required immense and meticulous attention. For example, materials that were of the same grade were preferred so as to achieve a complete enhancement process. The grades of the honing cloud and silver glow wood were much lower than the blood snake vertebrae, causing the weapon to be unable to fully utilize the metal elemental attribute of the blood snake vertebrae.</p><br/><p>Many wood materials actually contained more than one element. These kinds of material posed an extremely huge challenge to the weaponsmith, himself.</p><br/><p>The suitability and availability of materials, together with outstanding crafting techniques, could produce a good weapon. Some unique materials possessed exceptional qualities and did not need to take elemental enhancement or restrainment into consideration. However, professional weaponsmiths despised such reckless weapon crafting technique as they felt it would be a waste of good materials.</p><br/><p>Lou Lan was extremely unsatisfied with the sword, but Ai Hui’s gaze had not left the sword for a second.</p><br/><p>This sword had many outstanding qualities, displaying Lou Lan’s skillfulness in crafting swords. For example, the use of the honing cloud as the blade of the sword had perfectly resolved the issue of the blood snake vertebrae’s lack of a blade. Ai Hui would not have thought of this even if he racked his brain.</p><br/><p>The honing cloud could bend and twist according to the form of the blood snake vertebrae. It could be firm and rigid or soft and flexible.</p><br/><p>The design of the seven daggers was even more amazing. Their design was inspired by the bronze sword box and extremely marvellous.</p><br/><p>Within a short period of time, Ai Hui had thought of several new sword moves.</p><br/><p>For example, he could hide the daggers within the cloud, and if his opponent was to block his attack, the daggers could launch a surprise attack to catch his opponent off guard. Furthermore, the seven prismatic crystals had a mysterious connection between each other, which meant that they could devise numerous complicated attacking combinations.</p><br/><p>Such a good sword!</p><br/><p>\"Ai Hui, don’t you want to give the sword a try?\" Lou Lan slanted his head and asked. \"This sword doesn’t have a name yet.\"</p><br/><p>Ai Hui held the hilt of the sword excitedly. The moment his hand made contact with the icy and sturdy blood snake vertebrae, his palpitating heart calmed down.</p><br/><p>When Ai Hui picked up the sword, it appeared to everyone that he had become a completely different person. An indescribable aura silently extended outward from Ai Hui’s body.</p><br/><p>He looked very serene, but dangerous at the same time.</p><br/><p>Suddenly, Ai Hui grinned, revealing his white teeth and said, \"I need a sparring partner. Who’s willing to be my sparring partner?\"</p><br/><p>Duanmu Huanghun’s eyes lit up immediately. He had witnessed the whole process of how Shi Xueman utterly defeated Ai Hui and wanted to add insult to Ai Hui’s injury. Ai Hui was not stupid either as he rejected Duanmu Huanghun without hesitation.</p><br/><p>Ai Hui approached everyone except him.</p><br/><p>Duanmu Huanghun had been itching to beat Ai Hui into a pulp. If just by watching Ai Hui get pummeled had already made him so happy, how happy would he be if he got to personally beat Ai Hui up?</p><br/><p>Thinking about it, how much had he suffered in Ai Hui’s hands so far?</p><br/><p>Duanmu Huanghun began to become restless, but he did not have a chance. No matter how many times he volunteered, Ai Hui pretended not to see him. As such, he became increasingly furious.</p><br/><p>When he heard Ai Hui say that he needed a sparring partner, Duanmu Huanghun volunteered himself without any hesitation. \"Me!\"</p><br/><p>When Ai Hui passed Duanmu Huanghun, the latter purposely mocked the former by saying, \"You already have a sword, what excuse do you have this time?\"</p><br/><p>\"Since you insist, come on then,\" Ai Hui replied helplessly.</p><br/><p>Fatty turned his face around, unable to bear watching what was going to happen. However, in the blink of an eye, he whistled and yelled, \"Everyone, come! It’s a rare opportunity! Let us gamble and have some fun! Ai Hui and Bangwan, who are you betting on to win the fight? You are born with nothing and will die with nothing. One has to take a gamble in his or her life. A small amount of gambling is entertaining, but excessive gambling is harmful. I, Fatty, shall be the banker and will treat everyone fairly. It’s okay if you don’t have money now, we can put it on a tab.\"</p><br/><p>\"I am betting on Bangwan! 500 yuan!\"</p><br/><p>\"Ai Hui hasn’t recovered yet, I am betting on Bangwan! 800 yuan!\"</p><br/><p>\"Ai Hui is too anxious, he should rest for another two days first. I am betting on Bangwan too! 1,000 yuan!\"</p><br/><p>\"…\"</p><br/><p>Everyone was stressed out after so many days of continuous fighting. Therefore, they jumped in joy when there was a rare opportunity for recreation.</p><br/><p>\"I am betting on Ai Hui. 10,000 yuan!\"</p><br/><p>Shi Xueman’s cold voice rang across the air, catching everyone’s attention. No one had expected Shi Xueman, who utterly defeated Ai Hui previously, to bet on Ai Hui to win the fight.</p><br/><p>Beads of cold sweat flowed down Fatty’s forehead as he replied, \"The maximum bet is 5,000 yuan.\"</p><br/><p>\"5,000 yuan then.\"</p><br/><p>Shi Xueman’s firmness caused a lot of students to hesitate in making their bets. When Fatty saw this, he intentionally asked Shi Xueman, \"Big Sister must have never played this before, right?\"</p><br/><p>\"Never,\" Shi Xueman shook her head. She had been extremely self-disciplined since young, how could she have gambled before?</p><br/><p>Upon hearing Shi Xueman’s reply, all the students suddenly realized what was going on.</p><br/><p>So she was new to gambling, no wonder she bet on Ai Hui!</p><br/><p>Without any hesitation, they bet on Bangwan.</p><br/><p>Everyone’s gaze was directed toward the two figures in the arena.</p><br/><p>Both Ai Hui and Duanmu had tremendous improvements in their fighting capabilities. From their auras, everyone had an inkling of what was going to happen. Both of them were abnormally calm.</p><br/><p>However, the next moment, both of them surged forward at the same time.</p><br/><p>Two shadows flashed across the arena as the two figures who were previously stationary disappeared.</p><br/><p>Ai Hui’s attack hit nothing but air.</p><br/><p>Duanmu Huanghun was hovering in the air while the lotus patterns slowly swirled under his feet. Ai Hui continuously rejected him in the past, so he could only watch the fights between Ai Hui and other students. As he watched the fights, he kept thinking: how would he deal with Ai Hui if he was the one fighting him?</p><br/><p>Duanmu Huang did not underestimate Ai Hui at aall. Even though Ai Hui had poor fundamentals and was limited in terms of elemental energy, his swordsmanship had improved immensely and reached an extremely formidable level. To last so long against Shi Xueman without using any elemental energy was not an easy feat.Even Duanmu Huanghun had to admit that he could not have done so.</p><br/><p>After watching so many of Ai Hui’s fights, Duanmu Huang made a big discovery.</p><br/><p>Ai Hui had a fatal weakness, which was that he could not fly. On the contrary, Duanmu Huanghun could.</p><br/><p>Duanmu Huanghun’s strategy was very simple. The first thing he would do was to fly up into the sky and then attack Ai Hui from there.</p><br/><p>His [Viridescent Flower] was capable of making long-ranged attacks.</p><br/><p>Upon seeing Ai Hui raise his head and look at him helplessly, Duanmu Huanghun could not help but smile wickedly and feel extremely happy.</p><br/><p>Finally, it’s time for payback!</p><br/><p>Today is the day to pay back Ai Hui for all the humiliating times!</p><br/><p>The more Duanmu Huanghun thought about it, the more excited he got. The smile on his face involuntarily grew wider and wider. It was finally the day to slay his inner demon! Today shall be the day that he surpassed Ai Hui. His smile eventually exploded into a howling laughter. \"Hahaha! Ai Hui, have a taste of my [Viridescent Flower]!\"</p><br/><p>His frenzy-filled eyes began to flicker. Surging elemental energy gushed through Duanmu Huanghun’s body. The slender fingers from both of his hands spread out like a blossoming flower. Numerous elegant shadows appeared momentarily and faded from his fingers.</p><br/><p>Green ripples appeared under Ai Hui’s feet and extended outward. Ai Hui’s body froze as if there was an invisible power confining him. Numerous green branches and tendrils emerged from beneath his feet. They grew at a terrifying speed, as if they were alive.</p><br/><p>The intertwining branches and tendrils eventually formed a cage around Ai Hui. Looking at it from the sky, it resembled a green openwork longevity lock.</p><br/><p>[Viridescent Flower, Perennial Lock]!</p><br/>\n</div>"}