{"title": "Chapter 242: The Transformation Of The Blazing Corals", "id": 242, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-242-the-transformation-of-the-blazing-corals", "volume_title": "Volume 3", "body": "<h1>Chapter 242: The Transformation Of The Blazing Corals</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 242: The Transformation Of The Blazing Corals</p><br/><p>Translator: TYZ Editor: X</p><br/><p>\"Be careful, the terrain has changed a lot,\" Ai Hui reminded Shi Xueman and Lou Lan softly, his voice containing a tinge of doubt. He found it hard to a establish connection between his impressions of this place yesterday and today. Within a day, the depths of the Heaven Pit had changed beyond recognition. The unfamiliarity of this place was not within Ai Hui’s expectations.</p><br/><p>What exactly had happened here in a day’s time?</p><br/><p>A shiver went down Ai Hui’s spine as his face turned grave and stern.</p><br/><p>Shi Xueman was silently trembling with fear. She rarely saw such a facial expression from Ai Hui. A focused Ai Hui always seemed inhuman. Among their generation, Shi Xueman had never met anyone whose psyche was comparable to Ai Hui’s. He was cold and firm like steel. He would have no fear or panic even if a knife was placed against his neck.</p><br/><p>Shi Xueman was not the only who felt this way, and everyone else felt the same about Ai Hui. She discovered this during a private discussion with the others.</p><br/><p>\"Ai Hui, the nature of the surrounding boulders and rocks has changed. Their temperature is slight higher\" Lou Lan’s glowing yellow eyes kept flickering in the dark.</p><br/><p>\"The temperature is higher than before?\" Ai Hui reached out his hand and touched the cavern wall beside him. His hand felt warm. The weird thing was he did not feel that the temperature of the surrounding air was very high.</p><br/><p>\"Is this caused by the explosion from last time?\" Shi Xueman asked curiously as she touched the soil.</p><br/><p>\"No,\" Lou Lan shook her head, \"the amount of fire elemental energy in the rocks and soil exceeds the amount from last time around. The nature of the elemental energy given off by that explosion is very complicated. It was not not purely fire elemental energy.\"</p><br/><p>\"Are you able to find out why?\" Ai Hui asked.</p><br/><p>\"I need some time, Ai Hui,\" Lou Lan’s glowing yellow eyes continuously flickered. He was the most familiar with matters like soil, rocks, and quicksand. The Midnight core was operating at full speed and was quickly able to identify something strange. \"It’s fire elemental energy. The soil has been eroded by an unique type of fire elemental energy. It’s a rarely seen type of fire elemental energy, and its nature is slowly transforming.\"</p><br/><p>\"Its nature is slowly transforming?\" Ai Hui asked.</p><br/><p>\"Yes, Ai Hui,\" Lou Lan’s reply came very fast, \"its nature is a mixture of fire elemental energy and fire spiritual force. Right now, it’s transforming toward fire spiritual force, but the rate at which it’s transforming is very slow.\"</p><br/><p>\"Fire spiritual force?\"</p><br/><p>This conclusion stunned Ai Hui and Shi Xueman.</p><br/><p>Ai Hui shivered and asked urgently, \"How slow is it? How long before the fire elemental energy completely transforms into fire spiritual force?\"</p><br/><p>\"Approximately 200 years, Ai Hui,\" Lou Lan replied.</p><br/><p>Ai Hui and Shi Xueman heaved a sigh of relief upon hearing the huge number. What happened 200 years later had nothing to do with them. They were fine with it as long as the transformation did not take place now. If the transformation was to take place now, the pressure on them would increase and their chances of surviving would decrease.</p><br/><p>\"Why did the fire elemental energy undergo transformation?\" Shi Xueman did not seem to get it. \"Isn’t elemental energy very stable?\"</p><br/><p>Any elementalist that had a bit of common sense would have such doubts. Even though everyone was very unfamiliar with spiritual force, they still knew that the nature of elemental energy was much stabler than spiritual force. That was a fact. Otherwise, the Avalon of Five Elements would exist.</p><br/><p>Right now, the stable elemental energy was trying to convert into unstable spiritual force. This completely defied logic.</p><br/><p>The flickering yellow light in Lou Lan’s eyes calmed down gradually. He had already completed his analysis. \"The larvae, eggs, microorganisms, moss, and underground plants in the soil have been infected with the blood poison. They are devouring elemental energy and converting it into blood spiritual force.\"</p><br/><p>\"Doesn’t that mean the Avalon of Five Elements will completely disappear in 200 years’ time?\" Shi Xueman’s face turned deathly white.</p><br/><p>\"If no preventative measures are taken, then yes, Xueman,\" Lou Lan answered bluntly.</p><br/><p>Ai Hui was speechless. He suddenly thought of the old prisoner. Initially, he frequently communicated with that old man, but as the situation worsened, Ai Hui purposely avoided contacting him. With the increased pressure to survive and the fact that the inside story he obtained from the old man was not helpful for the current situation, he only felt deeper despair.</p><br/><p>The inside story had nothing to do with him. All he wanted was to survive the blood catastrophe.</p><br/><p>From the words of the old man, Ai Hui understood a lot of things. The Blood of God had extremely huge ambitions, and their ultimate goal was to topple the Avalon of Five Elements.</p><br/><p>As such, the Blood of God developed the blood poison... the scary blood poison... the blood poison that could change the world…</p><br/><p>Ai Hui felt that the blood poison was the most terrifying creation in the world. It contained the power to change the world, striking both fear and amazement in one’s heart.</p><br/><p>\"So are we going to revert back to the Cultivation Era in 200 years?\" Ai Hui sighed. If the world was to revert back to the Cultivation Era, there would be a lot of people joining the ranks of the Blood of God. This process would result in the deaths of many people.</p><br/><p>\"No, we won’t, Ai Hui,\" Lou Lan shook his head and answered confidently. \"This is because the world would only be left with blood spiritual force, and blood spiritual force can’t dissipate into the air like elemental energy. Blood spiritual force will have to coexist with all living things. All living things will undergo changes due to the blood spiritual force. Currently, lives are already changing. These changes are permanent. Lou Lan can’t predict what the future will look like yet.\"</p><br/><p>Lou Lan sounded slightly distressed. It was as if he was unhappy with himself that he could not predict anything.</p><br/><p>\"Even God does not know what the future will look like.\" Ai Hui encouraged him, \"Lou Lan, you’re already very impressive!\"</p><br/><p>\"Really?\" Lou Lan’s eyes widened, appearing very happy.</p><br/><p>\"Of course!\" Shi Xueman interjected. She had returned to her senses and decided to leave the vexing global issues to the Elders Guild. She looked at Lou Lan and continued, \"Lou Lan is the best sand puppet! The perfect sand puppet! Everyone loves Lou Lan!\"</p><br/><p>Whenever she saw Lou Lan, she would feel jealous of Ai Hui. Why did she not have such a good sand puppet?</p><br/><p>\"Thank you Xueman!\" Lou Lan replied cheerfully.</p><br/><p>\"Let’s go, we have to be careful,\" Ai Hui said in a low voice. \"Lou Lan, lead the way.\"</p><br/><p>\"No problem Ai Hui!\" Lou Lan replied happily.</p><br/><p>Ai Hui stayed 10 meters behind Lou Lan. If they were to encounter any dangers, he could launch an attack from Lou Lan’s side in the shortest amount of time.</p><br/><p>Even though the ground was filled with fire elemental energy, it had no effect on Lou Lan.</p><br/><p>They ventured deeper into the Heaven Pit. Even the mayor was shocked when he learned that the first golden needle had to be nailed in the Heaven Pit. After consulting with Wang Shouchuan, the latter’s answer was able to set them at ease. The deeper the golden needle was nailed, the better the effects would be. If they could bypass the possible dangers they might encounter in the Heaven Pit and nail the golden needle in the depths of the pit, it would very beneficial for the \"treating the city as a piece of cloth\" plan.</p><br/><p>The depths of the Heaven Pit was far larger than they had expected it to be. The place was like an enormous underground maze.</p><br/><p>Without Lou Lan, the difficulty of locating the node would have been many times harder.</p><br/><p>Suddenly, the path ahead was illuminated by a faint red glow.</p><br/><p>In a dark underground world, even a faint glow would appear extremely bright. Immediately, the walking speed of the trio slowed down. Everyone became unusually careful. It was abnormal for a glow to appear in the depths.</p><br/><p>What was ahead of them?</p><br/><p>Everyone was filled with uncertainty.</p><br/><p>Night vision was the basic ability of any subterranean beasts, just like how they were used to hiding in the dark. For a subterranean beast that dared to emit light, either it was powerful or it was trying to use the light as bait.</p><br/><p>Regardless what species they were, all of them were dangerous.</p><br/><p>The three of them slowed down and tiptoedquietly, afraid to make the slightest bit of noise.</p><br/><p>As they proceeded forward, the glow became brighter and brighter.</p><br/><p>The glow originated from the mouth of a cave. Ai Hui and the rest held their breaths as they got closer to the cave entrance and carefully peeked inside. The sight within the cave startled everyone.</p><br/><p>The red glow was produced by red, spear-like crystals. The ground and cave roof were lined with these densely-packed crystals.</p><br/><p>\"They look like blazing corals!\" Shi Xueman cried out in alarm.</p><br/><p>\"Blazing corals?\" Ai Hui asked.</p><br/><p>Shi Xueman’s face contained an indescribable surprise. She quickly explained, \"Blazing corals are a special local product from the Fire Prairie. The ground beneath the Fire Prairie is filled with intertwining rivers of lava and the blazing corals grow on the riverbeds of these lava rivers. Blazing corals are a very expensive type of fire elemental material.</p><br/><p>\"Fire elemental material?\" Ai Hui muttered to himself. Previously, the Heaven Pit’s entrance contained a strong concentration of fire elemental energy. Now, this place was filled with such a high-level fire elemental material like the blazing corals. What changes was this place going through exactly?</p><br/><p>\"They are blazing corals, Ai Hui.\" A red crystal appeared in Lou Lan’s hand as the yellow light in his eyes began to flicker. \"To be precise, these are blood poison-infected blazing corals. Ai Hui, take a look, there are blood traces in these crystals.\"</p><br/><p>Ai Hui took a closer look. Indeed, there was a trace of blood in the transparent red crystal. It was rather obvious.</p><br/><p>\"The usually slow-growing blazing coral worms are growing at a very fast speed after being infected with the blood poison.\"</p><br/><p>Before Lou Lan could finish his sentence, several red crystals broke out of the ground, emerging in rapid succession. They were quickly growing at a visible speed</p><br/><p>The growing process of the blazing corals sent a shiver down everyone’s spine, defying their logic.</p><br/><p>\"During the initial stages, living things that are infected with blood poison will grow at a terrifying speed. When they start to form blood traces, their growing speed will reduce. This characteristic is unique to the blood spiritual force,\" Lou Lan explained. He had a deep understanding toward blood spiritual force.</p><br/><p>\"So are you saying that the blazing coral worms can form blood traces too?\" Shi Xueman was shocked.</p><br/><p>\"In theory, they can, but the smaller and simpler an organism is, the harder it will be for it to form blood traces,\" Lou Lan explained.</p><br/><p>\"I wonder what the blazing coral worms will look like if they develop blood traces?\" Shi Xueman’s voice quivered.</p><br/><p>\"I don’t know,\" Lou Lan shook his head.</p><br/><p>Suddenly, Shi Xueman thought of another issue and her face turned pale. \"Then wouldn’t the Fire Prairie be…\"</p><br/><p>Given the horrifying speed that these blazing corals were growing, what would the blazing corals at the Fire Prairie be like?</p><br/><p>\"As long as the first strain of blood poison appears, the blazing corals will grow in huge bulks,\" Lou Lan explained. \"Xueman, don’t worry, so far there isn’t any news of places outside of the Induction Ground being infected with blood poison.\"</p><br/><p>Upon hearing this, Shi Xueman felt slightly at ease.</p><br/><p>\"Are these blazing corals still usable?\" Ai Hui asked Lou Lan. Blazing coral was a high-grade material. It would be a good thing for them if these blazing corals could still be used.</p><br/><p>\"They are useless to us, Ai Hui.\" Lou Lan shattered Ai Hui’s hope. \"Their fast growth rate has sharply reduced their sturdiness, hence, they are very fragile. However, they are very useful to blood fiends. The blazing coral worms may grow, reproduce, and die very quickly, but the blood spiritual force from the blazing corals will continue to exist. The corpses of the blazing coral worms contain the aura of life, enabling the blood spiritual force to be preserved.</p><br/><p>\"In other words, the blazing corals are nourishment for blood fiends?\" Ai Hui’s facial expression changed.</p><br/><p>\"Yes, Ai Hui,\" Lou Lan answered with certainty.</p><br/><p>Ai Hui immediately knew that there would be consequences for barging into the \"pasture\" of the blood fiends. At the same time, he sensed that something was wrong.</p><br/><p>\"Be careful!\"</p><br/>\n</div>"}