{"title": "Chapter 250: Fallen Defenses", "id": 250, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-250-fallen-defenses", "volume_title": "Volume 3", "body": "<h1>Chapter 250: Fallen Defenses</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 250: Fallen Defenses</p><br/><p>Translator: YH Editor: X</p><br/><p>45 people.</p><br/><p>Tian Kuan sorrowfully stared at the two rows of elementalists in front of him, his thoughts a mystery. Five of the 50 survivors had rejected life and chosen death instead.</p><br/><p>45 terrifying and imposing figures who appeared much swifter and fiercer than Yan Hai stood solemnly in front of Tian Kuan. Nothing was stricter than Death’s screening process. This free-for-all involving thousands of people had definitely produced a group of true elites. Although they had just become blood elementalists, the aura they exuded was on a whole different level than Yan Hai.</p><br/><p>Tian Kuan detected a familiar scent in the air. The bloodthirsty glint in their eyes was exactly the same as the blood fiends and was something he could not be more familiar with.</p><br/><p>He was assessing them, and they were sizing him up as well.</p><br/><p>Tian Kuan knew that they would rip him to shreds the moment he revealed any sign of weakness. This bunch of wild beasts had no loyalty nor emotions. Only strength could guarantee their respect and command their obedience.</p><br/><p>Tian Kuan heaved a long sigh.</p><br/><p>He disliked borrowing others’ strength, but this was the only method that would give him enough confidence to carry out his plans.</p><br/><p>As he began to circulate his blood spiritual force, Tian Kuan exuded an indescribable aura that permeated the entire area.</p><br/><p>The 45 survivors were terrified to discover that the blood spiritual force within their bodies was suddenly out of their control. Several of their faces became flushed red as they forcefully attempted to resist Tian Kuan’s aura.</p><br/><p>One of the new blood elementalists felt his knees buckle, and the next thing he knew, he was kneeling down on the ground.</p><br/><p>The rest of them collapsed on their knees one by one like dominoes.</p><br/><p>The sound of men falling to their knees continued until only a handful were still standing. The faces of those standing revealed the violent struggle occurring within. Despite their best efforts, their bodies were eventually overcome by Tian Kuan’s presence, and they too kneeled in front of him.</p><br/><p>From the beginning to the end, Tian Kuan’s facial expression had remained as distressed as ever. To the newly minted blood elementalists kneeling before him, however, Tian Kuan’s face was enigmatic, imposing, and dignified. His small, withered stature towered above them, exerting a pressure so great that they could not breathe.</p><br/><p>\"Life is short and full of sorrow.\"</p><br/><p>He spoke as though he was sighing bitterly. \"Life is tough. Most people don’t deserve to be alive, while some people don’t want to continue living. Life is an endless journey of pain. Just look at yourselves. None of you wish to obey my orders, but you don’t have a choice. All of you are prime examples of life’s suffering. Is there anything that isn’t painful? Did you think that becoming beasts would ease your suffering?\"</p><br/><p>Yan Hai had long since prostrated himself at Tian Kuan’s back. Tian Kuan’s words made his heart race, but also made him realize that his master had actually been treating him quite nicely.</p><br/><p>The freshly baked blood elementalists were trembling uncontrollably while the blood within their bodies surged explosively.</p><br/><p>He was of course different from these guys. His loyalty toward his master was unquestionable!</p><br/><p>Yan Hai firmly believed that his master was aware of his loyalty.</p><br/><p>\"Whoever can demonstrate their usefulness will be allowed to continue living.\"</p><br/><p>Tian Kuan looked even more worried. His words were targeted at his new recruits, but were also intended for himself. Up until now, he had not achieved anything noteworthy.</p><br/><p>He had no idea if the others had been earning brownie points, but he knew he did not have any.</p><br/><p>Failing to meet expectations would leave him in a bad place. This was why he broke his own code and proceeded to recruit new allies.</p><br/><p>Only time would tell whether he would succeed.</p><br/><p>He had a comprehensive plan.</p><br/><p>News of Yu Mingqiu’s arrival swiftly swept across all of Central Pine City.</p><br/><p>A vice division leader from the Thirteen Divisions was someone highly regarded by most people. Furthermore, Yu Mingqiu was well known throughout the Avalon of Five Elements for his prowess. The arrival of such powerful assistance gave the people of Central Pine City hope for the future.</p><br/><p>Back in the mayor’s residence.</p><br/><p>The mayor dismissed all unrelated personnel so that he could have a private discussion with the dean and Vice ivision Leader Yu Mingqiu.</p><br/><p>Ai Hui stood rooted to the spot as though he had not heard the order to withdraw. Seeing that Ai Hui had no intention of leaving just yet, Shi Xueman also remained. Lou Lan stood in one corner, blinking his eyes.</p><br/><p>\"Both of you may go back and rest. You still have the golden needle to handle tomorrow,\" informed Wang Zhen. He felt that the two of them were acting strange, so he smiled and continued, \"Our scouts have found no issues with the other eight nodes. Both of you should take a good rest to prepare for your upcoming assignments.\"</p><br/><p>Ai Hui cheerfully asked, \"Mr. Mayor, our reinforcements aren’t coming anymore, right?\"</p><br/><p>Shi Xueman looked at Wang Zhen as well.</p><br/><p>Wang Zhen replied gravely, \"Why are you spouting such nonsense? Isn’t Vice ivision Leader Yu already here? A vice division leader from the Thirteen Divisions is here in person, wouldn’t you consider that to be reinforcements?\"</p><br/><p>\"But Brother Qiu is here alone.\"</p><br/><p>Ai Hui took a quick glance at Yu Mingqiu. If he wanted to rely on a higher power, he would have to go along with some of Yu Mingqiu’s whims, like calling him \"Brother Qiu.\" Even though Yu Mingqiu was quite eccentric, his status and strength still made him a precious ally.</p><br/><p>\"You should tell us the truth,\" blurted Shi Xueman.</p><br/><p>Wang Zhen was not too happy about being confronted like this.</p><br/><p>Ai Hui did not seem to notice that the mayor was on the verge of flaring up.</p><br/><p>\"A sharp individual like you is indeed worthy of being Mingxiu’s junior.\" Yu Mingqiu suddenly burst out in hearty laughter and broke the awkward atmosphere. \"Since we’re on the same side, I guess there’s no need to hide the truth from you. Having one more person to help think of a solution isn’t such a bad thing either. Perhaps the mayor could enlighten us on the current situation.\"</p><br/><p>Yu Mingqiu was the highest ranked person here, so nobody could refuse his request.</p><br/><p>\"Okay, I shall relay the higher authorities’ message. We won’t be getting anymore reinforcements in the short term. All of the troops that were headed here have been ambushed by a mysterious person and suffered serious casualties. We have received confirmation that one vice divison leader has been killed in action.\"</p><br/><p>Yu Mingqiu’s eyes widened in shock. \"Who was it?\"</p><br/><p>\"They didn’t say, so I have no idea,\" said Wang Zhen, shaking his head.</p><br/><p>Yu Mingqiu was appalled by the damage they had suffered. He could not believe that a vice division leader had actually fallen! Throughout the Avalon of Five Elements’ history, the loss a vice division leader was an extremely rare occurrence.</p><br/><p>His subordinates might have suffered the same fate…</p><br/><p>These thoughts had drained all color from Yu Mingqiu’s face. He subconsciously clenched his fist tightly in a bid to control the intense sadness that welled up inside him.</p><br/><p>\"Our goal now is to execute the ‘treating the city as a piece of cloth’ plan. We have no other options besides this,\" Wang Zhen said in a nolens volens tone. \"This is the only way we can buy ourselves more time. The higher ups should take note of the large casualties though and respond accordingly. Now that Vice Division Leader Yu is here, our city’s strength has increased as well.\"</p><br/><p>Yu Mingqiu shook his head. \"There is no increase whatsoever.\"</p><br/><p>\"What do you mean?\" replied both the dean and the mayor.</p><br/><p>\"I chased a blood elementalist into the city and lost her after we both entered,\" growled Yu Mingqiu. \"It was a lady clad in red. Her strength matched my own, but her skills and techniques were very odd. The energy she tapped into was strangely different from the elemental energy that we use. The two of them have met her and even exchanged blows with her as well.\"</p><br/><p>The dean and the mayor simultaneously turned to Ai Hui and Shi Xueman.</p><br/><p>Ai Hui nodded, \"We almost died at her hands.\"</p><br/><p>A sudden realization struck Yu Mingqiu. Giving his forehead a smack, he said, \"You guys are pretty strong considering how you managed to escape from that she-devil.\"</p><br/><p>\"We got lucky,\" Ai Hui hurriedly replied.</p><br/><p>Wang Zhen paled after listening to Yu Mingqiu’s report. \"You mean someone as strong as Vice Division Leader Yu has entered the city?\"</p><br/><p>\"Yup,\" Yu Mingqiu nodded.</p><br/><p>Wang Zhen’s facial expression changed drastically as he shouted, \"Not good!\"</p><br/><p>Immediately after the mayor’s exclamation, sounds of explosions could be heard from all over the city.</p><br/><p>Everyone in the hall stared at each other blankly.</p><br/><p>One of the mayor’s subordinates ran in hastily. \"The city’s defenses have fallen,\" he informed, visibly crestfallen.</p><br/><p>Wang Zhen forced himself to remain calm. \"Which direction?\" he asked.</p><br/><p>His subordinate stammered, \"All, all of them.\"</p><br/><p>All of their defenses had fallen…</p><br/><p>Wang Zhen was struck dumb by the news, feeling as though he had just been struck by a bolt of lightning. Ai Hui and Shi Xueman looked at each other and saw the terror in the other’s eyes. The destruction of the city’s defenses meant only one thing—the blood fiends would be able to enter the city from any direction.</p><br/><p>There was nothing left to stop them!</p><br/><p>The city’s defense was one of the main reasons why Central Pine City was able to hang on for so long. A complete city defense was absolutely essential for repelling most of the blood fiends. This was especially the case for the larger fiends.</p><br/><p>From now on, the elementalists in the city would have to face increased pressure.</p><br/><p>Blood fiend howls rose and fell like an orchestra. Large groups of them were quickly approaching the city from all directions.</p><br/><p>The high density of elemental energy within the city was like a delicious cake. Waves of delicious scents wafted out of the city, attracting every single blood fiend within its range. The blood coursing the blood fiends’ veins made them strongly attracted to elemental energy. Much like how blood crystals were prized spoils of war for humans, humans were the prized rewards for blood fiends.</p><br/><p>\"Oh my heavens, look up!\"</p><br/><p>Everyone in the courtyard looked up and saw a huge blood red cloud heading toward the city at an alarming speed.</p><br/><p>The sight made everyone pale with fright. Blood birds were rapidly approaching!</p><br/><p>Central Pine City had never suffered that much at the hands of blood birds because of the effectiveness of Wang Zhen’s strategic air defenses. While they had not faced many blood bird attacks, the residents of Central Pine City knew of the threat they posed.</p><br/><p>Most of the city had been reduced to rubble so there was nowhere for people to hide.</p><br/><p>The city’s elementalists were not skillful enough to fight aerial battles against blood birds.</p><br/><p>Yu Mingqiu suavely announced, \"Leave the skies to me!\"</p><br/><p>Even though he knew that the lady in red was waiting to ambush him at his weakest, he understood that there was no time to worry about her anymore.</p><br/><p>The Thirteen Divisions existed to protect the Avalon of Five Elements. He was here to protect the skies, the earth, and the people that lived within this space.</p><br/><p>He took pride in his role as a vice division leader.</p><br/><p>Yu Mingqiu spread his azure wings and soared into the sky. At least there was no chance of losing my direction up here.</p><br/><p>Wang Zhen stared blankly at the figure in the sky. He snapped out of his daze after several seconds and urgently commanded, \"Golden needles! We need to start getting the golden needles in place! Now! We’re running out of time!\"</p><br/><p>Ai Hui looked up at the sky.</p><br/><p>Heavy-set blood clouds loomed over the city, blocking out practically all of the natural light. In front of the swarm was a lonely figure, or rather, a mere speck in the sky.</p><br/><p>Shi Xueman gripped Cirrus so tightly that her knuckles turned white.</p><br/><p>Ai Hui was momentarily overwhelmed by Yu Mingqiu’s noble sacrifice. He smacked his lips and asked, \"Where are the golden needles?\"</p><br/><p>\"The warehouse! The smith is there too! Hurry!\" shouted Wang Zhen. \"I leave the first node in your hands! Quick!\"</p><br/><p>Ai Hui, Shi Xueman, and Lou Lan headed toward the warehouse without hesitation.</p><br/>\n</div>"}