{"title": "Chapter 264: Impossible to Stop Halfway", "id": 264, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-264-impossible-to-stop-halfway", "volume_title": "Volume 3", "body": "<h1>Chapter 264: Impossible to Stop Halfway</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264: Impossible to Stop Halfway</p><br/><p>Translator: TYZ Editor: CakeHermit</p><br/><p>The [Viridescent Flower] was omnipresent. Enchanted green vines meandered about the battlefield unpredictably while lovely and delicate green flowers blossomed on them, resembling an ink wash painting, elegant and beautiful.</p><br/><p>Surprisingly, there was a wide variety of flowers. There were radiant chrysanthemums, beautiful peonies, ravishing plum flowers, and elegant orchids among others. They blossomed on the meandering green vines, blending in harmony.</p><br/><p>The flustered members of the A-1 unit calmed down. Only they knew that the different types of flowers had different meanings to them.</p><br/><p>The chaotic battle scene immediately became clear and orderly, sharply increasing their offensive threat.</p><br/><p>The blood elementalists quickly felt the change in the situation. If they had previously compared their situation to being in a pool of quicksand, then their current situation could be compared to being in a meat grinder.</p><br/><p>Their opponent’s offensive execution was clear and precise while their own offense was often disrupted.</p><br/><p>From the three blood elementalists’ perspectives, the green vines had become exceptionally scary, resembling a monster that had countless tentacles.</p><br/><p>In the blink of an eye, there were several wounds on their bodies. Even though these wounds were not fatal, they were enough to make the blood elementalists felt a strong sense of danger.</p><br/><p>How did the A-1 unit become so powerful?</p><br/><p>The blood elementalists found it very difficult to accept reality. They knew about the A-1 unit before and had even had several interactions with them before becoming blood elementalists. The three of them had been brimming with confidence before this battle as they’d known about the A-1 unit’s fighting capabilities.</p><br/><p>Despite that, what happened during the battle gave them a huge shock.</p><br/><p>How did the A-1 unit become so strong?</p><br/><p>A blood elementalist who could no longer hold on hurriedly sent out a signal to request support.</p><br/><p>\"It’s a pity.\" the red-dressed girl sighed faintly as she watched the battle from afar. Similarly, she could see the terrible situation Tian Kuan was in right now.</p><br/><p>Yan Hai was startled. He asked, \"Miss, what’s there to be pitied?\"</p><br/><p>\"I’m pitying Tian Kuan,\" the red-dressed girl replied with a casual tone.</p><br/><p>\"Sir Tian Kuan?\" Yan Hai was startled again. \"Don’t tell me Miss feels that Sir Tian Kuan will lose this fight?\"</p><br/><p>Yan Hai had a deep fear of Tian Kuan. He saw with his own eyes how Tian Kuan did the impossible. From his perspective, Sir Tian Kuan’s powers were deep and unmeasurable. He also possessed terrifying schemes. How could an individual that possessed both brawn and brains lose?</p><br/><p>Even though the battle had entered a deadlock, the blood elementalists’ side had not yet shown any signs of defeat. Why would Miss assert that Sir Tian Kuan would face defeat?</p><br/><p>Deep down, Yan Hai did not want Sir Tian Kuan to lose. He felt that Sir Tian Kuan had treated him quite well.</p><br/><p>\"Do you know what we need the most right now?\" the red-dressed lady suddenly changed the topic.</p><br/><p>Yan Hai did not know if the ‘we’ that Miss mentioned referred to the god elementalists or her and Sir Tian Kuan. He did not dare to ask and put on an attentive appearance.</p><br/><p>\"It’s a matter of heart.\" the red-dressed girl’s eyes glittered like the stars in the night sky. \"When the elementalists train, they consolidate what they have learned at every step. They have the talent needed to progress steadily. Having this talent allows them to start from a higher point; however, even with talent, they still diligently work hard. Persistent effort overcomes all difficulties. For the path of a god elementalist, it’s a completely different case. We don’t talk about talent. It doesn’t matter even if your body is scarred and battered. We travel between life and death, walking on a tightrope. We need the power of understanding. Life and death are unpredictable. The essence of the path of a god elementalist is to develop his or her mind.\"</p><br/><p>Yan Hai did not really understand what Miss was saying, but he knew that she was trying to teach him something. He felt extremely grateful and replied respectfully, \"Your lowly servant will always bear Miss’s words of wisdom in mind!\"</p><br/><p>\"This realization of mine came about accidentally.\" The red-dressed girl smiled. \"It is thanks to Tian Kuan; without him, how could I have come up with these words of wisdom?\"</p><br/><p>Yan Hai’s face was filled with shock. He did not know how Miss’s realization was linked to Sir Tian Kuan; however, he did know that he himself was too low-leveled. Right now, he still found it very difficult to understand these profound and mysterious words, but he had a feeling that Miss’s words contained extremely powerful knowledge that might be of great help to him in the future.</p><br/><p>He did not dare to lose focus and kept repeating Miss’s words in his mind, without missing a single one.</p><br/><p>The red-dressed girl returned o her usual demeanor and chuckled. \"However, Tian Kuan is a ruthless and determined individual. He definitely will not admit defeat easily.\"</p><br/><p>\"Miss, should we…\" Yan Hai hesitated for a while before he continued speaking. \"Provide some assistance to Sir Tian Kuan?\"</p><br/><p>\"Assistance?\" The red-dressed girl shook her head and replied, \"He doesn’t need assistance.\"</p><br/><p>Yan Hui shut his mouth.</p><br/><p>The red-dressed girl cast a glance at Yan Hai and continued, \"Tian Kuan’s resolution must have wavered because of his injuries. That man from the Infantry Division was indeed an extraordinary individual. Tian Kuan must have already returned to his senses. If he wants to continue progressing, he must win this battle. Otherwise, he is destined to die.\"</p><br/><p>Upon hearing these words, Yan Hai was dumbstruck. He asked again, \"Why can’t he make a comeback?\"</p><br/><p>\"Because this is the path he chose.\" The red-dressed girl was lost in thought. \"He always put his life on the gambling table. It is because of his determination that he was able to make it so far. With his determination, he was able to survive the rounds of blood refinement. If he escapes, he will lose his determination and the gamble, so the next time he carries out blood refinement will be the day he dies.\"</p><br/><p>The red-dressed girl spoke the last sentence with absolute certainty.</p><br/><p>Yan Hai was blown away. He felt that the path of a god elementalist was profound and mysterious.</p><br/><p>\"There is something that you must remember,\" the red-dressed girl said faintly.</p><br/><p>Yan Hai hurriedly bowed his head respectfully and replied, \"Please enlighten your lowly servant.\"</p><br/><p>\"You have to complete the path you chose even if it’s going to kill you,\" the red-dressed girl said plainly.</p><br/><p>A shiver went down Yan Hai’s spine. These words were enlightening. He seemed to have realized something. The blood in his body began to boil, something that he had never felt before. Yan Hai stood on the spot and did not move a single inch of his body, resembling a wooden statue.</p><br/><p>The red-dressed girl cast a glance at him, then withdrew and shifted her gaze to the battle in the distance.</p><br/><p>Hiding in the dark, Tian Kuan’s face was ashen.</p><br/><p>The battle he’d expected to be an absolute victory suddenly entered a mysterious deadlock. Before the battle, he had emphasized Ai Hui. He felt that Ai Hui was the most threatening individual in the A-1 unit. As long as he could get rid of Ai Hui, the rest were just a mob that would fall like dominoes. In the end, he did not expect the most threatening Ai Hui to fall into a trap while the rest of the A-1 unit, whom he had previously regarded as a mob, erupted and put up a strong fight.</p><br/><p>Should he take action himself?</p><br/><p>Tian Kuan’s face was filled with uncertainty, unable to make a decision. There were still four blood elementalists beside him. Should they take part in the battle?</p><br/><p>He had invested a lot this time around. He already felt that it was overkill to use eight blood elementalists against a mere A-1 unit; however, the eventual outcome was completely outside of his expectations.</p><br/><p>He did not intend to reveal himself. Yu Mingqiu was like a sharp sword that hovered in the sky, waiting to strike at any moment. Tian Kuan had personally witnessed Yu Mingqiu’s prowess. He did not want to give his life for Yu Mingqiu to test his arrows.</p><br/><p>Yu Mingqiu being caught up by the blood birds in the sky was a God-given chance to Tian Kuan. It was the reason why he had planned this operation. Furthermore, for the sake of this operation, he had deployed a total of twelve blood elementalists. The rest of the blood elementalists were carrying out their respective missions in various parts of Central Pine City.</p><br/><p>The death rate of the blood elementalists matched well with what he had expected.</p><br/><p>When people first became blood elementalists, their fighting capabilities would rise sharply; however, since they did not train with their new powers at all, they would not know how to use them. Even though their fighting capabilities were greater than those of the ordinary elementalists, they were too few. Sending forty-five blood elementalists into the enormous Central Pine City was like throwing a handful of sand into a lake; it disappeared in the blink of an eye.</p><br/><p>At the moment, he could only sense the presence of twenty-eight blood elementalists.</p><br/><p>It would not surprise him if the missing blood elementalists had been killed. He did not consider them to be of importance.</p><br/><p>They were merely used to create chaos in Central Pine City.</p><br/><p>What Tian Kuan did not expect was that there were some blood elementalists who escaped from the battle. They had disappeared into the woods outside of the city. If not for the fact that the battle was getting increasingly intense, Tian Kuan would not let them off. Right now, however, he did not have the time to pursue them.</p><br/><p>This was a painful lesson for Tian Kuan. It was far too difficult for him to supervise forty-five people. He had underestimated the situation and also did not have the relevant experience to conduct such a strategy. The biggest reason for his failure was that he’d chosen an unfamiliar strategy at such a critical moment.</p><br/><p>With Yu Mingqiu’s arrival, his plan was further disrupted.</p><br/><p>The blood birds in the sky were supposed to play an important role in his plan. Central Pine City had never before faced a legitimate aerial threat. The sudden appearance of the blood birds would have been enough to cause devastating losses in the city.</p><br/><p>He had not expected Yu Mingqiu to come and single-handedly clear out the sky above Central Pine City. Without the biggest, aerial threat, the survivors in Central Pine city were able to organize themselves and fight against the blood fiends. All of them were very experienced in dealing with blood fiends. Even though there was a huge number of blood fiends, the survivors did not collapse like Tian Kuan had expected.</p><br/><p>This had also directly caused huge losses among the blood elementalists. Their enemy was not really powerful, but they had an advantage in terms of manpower.</p><br/><p>It was all that goddamn Yu Mingqiu’s fault!</p><br/><p>Tian Kuan cursed Yu Mingqiu an unknown number of times; however, at this point of time, no matter how much he cursed, it would not help the situation at all. Given the current situation, it was impossible to stop the operation halfway. He was somewhat vexed. He was far too anxious.</p><br/><p>The plan of ‘treating the city as a piece of cloth’ needed nine golden needles to be nailed in nine specific locations. Right now, only one had been nailed and there were eight more left. He would have enough time to strike, but eight of his blood elementalists were currently being held up by the A-1 unit. If he gave up now, the eight blood elementalists would die for nothing.</p><br/><p>Losing another eight blood elementalists would worsen his situation.</p><br/><p>After hesitating for a while, Tian Kuan made his decision and gave the signal to attack.</p><br/><p>The four blood elementalists hiding nearby him moved silently to the battlefront like four ghosts.</p><br/><p>After devouring the blood crystal, the glow in Lou Lan’s eyes suddenly stopped flickering, following which, the bright glow in his eyes began to dim and become dark-red. His dark-red eyes made his pale-white mask calmer and more callous. At this moment, he was like a statue, not moving or making any noise.</p><br/><p>There was no wind, but Lou Lan looked as if he was disintegrating into a gust, sweeping up a sandstorm.</p><br/>\n</div>"}