{"title": "Chapter 272: See You Later", "id": 272, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-272-see-you-later", "volume_title": "Volume 3", "body": "<h1>Chapter 272: See You Later</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 272: See You Later</p><br/><p>Translator: TYZ Editor: X</p><br/><p>Ai Hui casually waltzed into a particular shop.</p><br/><p>When the boss of the shop saw Ai Hui, he immediately yelled, \"Brother Wang!\"</p><br/><p>\"Has the thing I want arrived?\" Ai Hui asked amicably. His fake name was Wang Han, which he came up with to commemorate his master and mistress.</p><br/><p>\"It has arrived, it has arrived. Whatever Brother Wang wants, I will rack my brains to get it for you,\" the boss replied excitedly. The boss had a round face and a pair of pea-sized eyes that were filled with cheerfulness. Whenever he talked, his entire face would become unusually animated.</p><br/><p>However, Ai Hui did not dare to underestimate the boss based on his jovial character. After staying for nearly three years in Peace City, he had yet to have an adequate understanding of the boss.</p><br/><p>There were numerous companies in Peace City, and none of their backgrounds were simple. It was a pity that Qingye’s family only dealt with big businesses, else he would patronize the Sea Pacific Enterprise.</p><br/><p>The boss took out a box, placed it on the counter, and pushed it toward Ai Hui.</p><br/><p>Ai Hui opened the box, and a chilly gust blasted his face. In the box, there was a square-shaped ice brick. The ice brick was sparkling and translucent, a bit smaller than the box itself, and gave off wisps of frosty white gas. Inside the ice brick, there was an ink-black cloud frozen within.</p><br/><p>\"Star-sinking Ink Cloud, one of the best ink clouds. It is stronger and more durable than black clouds. Since it is very heavy, it can’t be used to make azure wings, yet it’s very suitable for making small-sized shields, such as buckler shields or arm guards. Its strength lies in its malleability, but its weakness lies in its low defensive rating when compared to those customized defensive materials.\"</p><br/><p>The boss talked nonstop. He was familiar with all kinds of materials. What impressed Ai Hui the most was that the boss would not only praise the strengths of a particular material, he would also elaborate on its weaknesses. He was a businessman with a good conscience.</p><br/><p>\"How much?\" Ai Hui closed the box and asked bluntly.</p><br/><p>\"200,000 metal elemental energy points or water elemental energy points. If you have fire elemental energy points or earth elemental energy points, then it will be 100,000 points of each.\"</p><br/><p>\"All right, do I pay now or can I use weasel bristle arrows as mortgage?\" Ai Hui nodded his head. The price was reasonable. Peace City was very close to Palette Cloud Village, and there was an endless stream of trading caravans that travelled to and fro between these two places. As such, the local products from Palette Cloud Village were not that expensive.</p><br/><p>Nowadays, the Avalon of Five Elements used elemental energy and blood crystals as its currency.</p><br/><p>After the war broke out, the previous currency had completely collapsed. Elemental energy storage bean pods allowed elemental energy to quickly replace the traditional yuan as currency. Training, war recovery processes, workshop machinery, and everything else needed enormous amount of elemental energy. This was why elemental energy could be used as currency.</p><br/><p>Since the Fire Prairie and Yellow Sand Corner had fallen into the hands of the Blood of God, there was a scarcity of fire elemental energy and earth elemental energy. Therefore, these two energies were worth a lot more.</p><br/><p>After the Blood of God promoted the rearing of blood fiends and started the mass-production of blood crystals, blood crystals quickly became their currency.</p><br/><p>Sometimes, life worked in a funny way. Even though the Blood of God and the Avalon of Five Elements were arch-enemies, both of them used the other’s currency as well. Blood crystals play a significant role in elementalist training and the god elementalists needed to use elemental energy for their training as well.</p><br/><p>\"Weasel bristle arrows!\" the boss answered without hesitation as a wide smile spread across his face. He had been waiting for Ai Hui to say this.</p><br/><p>\"20 weasel bristle arrows. I will have them sent to you in a few days’ time,\" Ai Hui replied.</p><br/><p>Weasel bristle arrows were actually an upgraded version of the bunny hair arrows. Since they were more powerful than bunny hair arrows, their price was higher as well.</p><br/><p>\"No rush, no rush.\" The boss beamed. \"Brother Wang’s weasel bristle arrows are really powerful. It’s just that its name is somewhat awkward-sounding. ‘Weasel bristle’ sounds common. Right now, everyone has given it another name, See You Later\"</p><br/><p>\"See You Later?\" Ai Hui was baffled.</p><br/><p>\"Hahaha, weasel bristle arrows are known as ‘10,000 point arrows’. When you buy this arrow, you will lose tens of thousands of points. It’s so expensive, so who would use it unless it’s the most critical moment? Even if one wants to use it, he or she will only use it during the later part of the fight. Hence, the arrows were renamed as See You Later,\" the boss chuckled.</p><br/><p>(Note: In Chinese, See You Later sounds like ‘ten thousand point arrows. It’s a pun)</p><br/><p>\"See You Later, this is a good name.\" Ai Hui found it funny as well.</p><br/><p>\"Brother Wang, can you give me slightly more arrows?\" The boss whined, \"Every month you give me so few arrows, and I don’t even have enough for my regular customers. Nowadays, I don’t even think about how to make money off these arrows, but rather, I think about how not to offend my customers. Last month, there was a regular customer that I have known for 10 years, and he almost destroyed my store just because I didn’t have enough of these arrows to sell to him. I really can’t offend anymore customers.\"</p><br/><p>\"Don’t think I don’t know how much you sell one arrow for. You can earn at least 10,000 points for one arrow, which is a lot more than what I received. Boss, put yourself in my shoes, I still have to take care of a training hall.\" Ai Hui cast a look of disdain at the boss.</p><br/><p>\"Your training hall?\" A disdainful look appeared on the boss’s face this time around. \"How much money can you make with that training hall? How many students do you have? You’re not doing a decent job! Why don’t you take advantage of the ongoing war and earn more elemental energy points? Nothing is more practical than elemental energy points. The more you have, the sooner you can heal the injury in your body. You’re still so young, and you can’t continue wasting your life like this.\"</p><br/><p>Ai Hui had bought a lot of medicines from this shop and did not hide the fact that he was injured.</p><br/><p>Ai Hui merely smiled and did not retort the boss. The wound to his body could not be solved with elemental energy points alone. Even now, he and Lou Lan had not yet determined what exactly this blood plum blossom was. It appeared to be a parasite that was devouring Ai Hui’s elemental energy, greatly slowing down Ai Hui’s training progress. However, the surprising thing about the blood plum blossom was that it kept on improving Ai Hui’s body.</p><br/><p>Ai Hui’s strength, reaction time, level of sensitivity, and other physical attributes had improved significantly. The weirdest part about this whole process was Ai Hui’s recovery ability. His recovery ability was similar to that of a blood elementalists. Any open wounds he had would rapidly close up and heal without leaving a single scar.</p><br/><p>As long as he could not get rid of the blood plum blossom, half of his life would be in the hands of One Thousand Yuan.</p><br/><p>At this moment, a lightly armored woman entered the shop and asked, \"Boss, do you have See You Later?\"</p><br/><p>Upon hearing this, the boss winked at Ai Hui. Ai Hui smiled, picked up the box, and prepared to leave.</p><br/><p>\"I’m very sorry, you have to make a reservation for See You Later. The process of making the arrows is very difficult and complicated, so there’s a limit to how many can be produced in one batch.\"</p><br/><p>The boss spread out his arms with a helpless look on his face.</p><br/><p>As Ai Hui walked past the woman, he was able to take a closer look at her. She wore purple light armor, and her short hair made her looked neat and tidy. She looked somewhat pretty, but seemed a bit arrogant.</p><br/><p>\"30,000 points per arrow, do you have it or not?\"</p><br/><p>Ai Hui stopped in his tracks as his face turned red.</p><br/><p>\"Umm… Customer, please come in and we will talk about it.\" The boss immediately conceded to the woman.</p><br/><p>Ai Hui cursed in his heart. This bastard obviously still had a stock of the arrows, yet he dared to say that he did not enough even for his regular customers. Bullsh*t!</p><br/><p>After Ai Hui walked past the woman, he turned around and silently mouthed two words at the boss.</p><br/><p>Price increased!</p><br/><p>The boss’s face turned white as he understood what Ai Hui meant.</p><br/><p>Feeling pleased with himself, Ai Hui pushed open the door and left the shop.</p><br/><p>After leaving the store, Ai Hui did not immediately go back to the training hall and walked toward the river bank.</p><br/><p>By the time the Silver Mist River flowed to Peace City, the river water had become very thin. The silver river water began to turn halfway transparent as well. This was something that could not be helped. The Silver Mist River flowed through countless cities in the upper reach. It was already considered lucky that the river was not totally cut off by the time it reached Peace City.</p><br/><p>An elevated passageway that connected the two opposite riverbanks was built to make things easier for people that wanted to collect water or fish artifact remnants from the river.</p><br/><p>People no longer called the discarded artifacts \"sea remains.\" They just called them \"artifact remnants.\" Artifact remnants could be used to make things such as weapons, defensive equipment, armor, or azure wings. The emergence of blood crystals immediately made artifact remnants extremely valuable.</p><br/><p>The shores on both sides of the river were filled with people. Today was the day that the sea discharge was supposed to arrive.</p><br/><p>In the past, the sea lock of the Silver Mist Sea was opened on the first day and the fifteenth day of the month. Now, the sea lock was only opened once a month on the first day. Since Peace City was located on the lower part of the Silver Mist River’s lower reach, it was already the seventeenth day of the month by the time the sea discharge arrived.</p><br/><p>Usually, there were few artifact remnants in the Silver Mist River. Despite the dilution of the sea discharge by the people living in the upper reach, this was the only chance for the people living in Peace City to make profits off of it.</p><br/><p>Luckily, the metal elemental currents in the Silver Mist River were razor-sharp. There was no way people could throw a fishing net into the river to haul up artifact remnants. Otherwise, there would be nothing left for the citizens of Peace City.</p><br/><p>Naturally, the Silver Mist Sea contained the greatest number of artifact remnants. However, the Silver Mist Sea was extremely deep, making it difficult for one to angle for these artifact remnants. Furthermore, the entry fee for the Silver Mist Sea was very expensive because only Heavenly Merit Points would be accepted. 200 Heavenly Merit Points would allow one to stay in the sea for a day and a night. How much profit an individual could make would depend on his or her capabilities. Regardless, not many people would do such thing since 200 Heavenly Merit Points was a huge sum of money.</p><br/><p>Instead of finding a place to sit down, Ai Hui walked up the flight of stairs leading to the mountain beside the elevated passageway.</p><br/><p>This flight of stairs was not that tall, only around 50 meters. After walking up this flight of stairs, there was a leveled hillside with various sized Three Leaves Bamboo Carts parked upon it.</p><br/><p>Ai Hui walked up to the smallest Three Leaves Bamboo Cart and yelled, \"Hey, Old Gao!\"</p><br/><p>A tall and very skinny man, Old Gao had a small pinch of a goatee under his chin. His eyes were squinty and slanted, resembling the eyes of a thief. When he saw Ai Hui, he chuckled. \"Ha, I knew you would come. Just now, I rejected a few guys who wanted to rent my cart just to wait for you to come.\"</p><br/><p>\"Great! Don’t worry, I will pay more for the fare,\" Ai Hui smiled.</p><br/><p>Old Gao had excellent driving technique. His control over the Three Leaves Bamboo Cart was unusually stable, and Ai Hui was his regular customer.</p><br/><p>\"It’s okay if you don’t pay for the fare.\" Old Gao laughed. \"With a single glance, I could tell that the few guys who wanted to rent my cart just now are newbies. They can’t be compared to you, you’re the legendary King of Anglers. Every month I have to depend on your red packet to survive. Recently, my business has not been too good. If it was in the past, when there were two sea discharges per month, I would have led a comfortable life.\"</p><br/><p>According to the custom here, anyone who was able to haul up artifact remnants would have to give a red packet of money to his or her driver. This meant that these wood elemental drivers would benefit from their customers’ good luck as well.</p><br/><p>Among the artifact remnant anglers here, Ai Hui was a rather famous one. He would only appear when the sea discharge arrived and would have a good haul every time. All the anglers called him the King of Anglers, which implied that he would never go home empty-handed.</p><br/><p>Upon seeing Ai Hui, many people standing nearby began to walk over and greet him. These people were mostly businessmen that bought the artifact remnants that were hauled up. Every time, Ai Hui would sell the artifact remnants directly to them if he did not need the remnants.</p><br/><p>Since Ai Hui was renowned for angling up artifact remnants, these businessmen paid great attention to him.</p><br/><p>Ai Hui mixed easily with these people. Even though these businessmen were not tycoons, they were still travellers who frequently obtained bizarre and fantastic artifacts.</p><br/><p>There were also a few unfamiliar young men that took a second glance at Ai Hui.</p><br/><p>After Old Gao finished smoking, he patted his cart and said, \"Brother Wang, get ready. It’s about time.\"</p><br/><p>Ai Hui plucked a grass straw from the ground and put it in his mouth to chew. Then, he jumped into the bamboo cart with the box in hand. His ears were extremely sharp as he could already hear the roar of the sea discharge coming from afar.</p><br/><p>The moment Old Gao stepped into the cart, his jovial demeanor disappeared and was replaced by solemness.</p><br/><p>The Three Leaves Bamboom Cart gracefully flew up from the ground, resembling a lithe and agile swallow.</p><br/><p>The rest of the Three Leaves Bamboo Carts on the hillside started their engines as well. The whooshing sound from the spinning clover above the roofs of the carts started to blend together. Like a pitch-black colony of bees, they flew above the river.</p><br/><p>As Ai Hui’s cart soared above the river, he could clearly see a dazzling silver tidal wave surging toward them from the upper reach of the river.</p><br/>\n</div>"}