{"title": "Chapter 281: Karakorum", "id": 281, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-281-karakorum", "volume_title": "Volume 3", "body": "<h1>Chapter 281: Karakorum</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 281: Karakorum</p><br/><p>Translator: Irene Editor: TYZ/CakeHermit</p><br/><p>When the last sword ray vanished, Ai Hui came out of his highly-concentrated state of mind.</p><br/><p>Clap, clap, clap! A round of applause sounded.</p><br/><p>Interrupted, Ai Hui, who was still feeling the high from his training, raised his head somewhat unhappily only to realize that it was Xiao Shuren.</p><br/><p>\"Sir, your swordplay is exquisite. I have never seen anything like this. It’s a new experience and a great honor. May I know the name of that swordplay?\"</p><br/><p>It was as if Xiao Shuren’s eyes were emitting light. Her originally beautiful complexion carried an extra luster now. Her face was full of admiration, making it difficult for people to refuse.</p><br/><p>Xiao Shuren had confidence in her beauty. It was well-tested and had never before failed her. Whenever she pulled this move, all the men would look at her as if they wanted to swallow her up. They would never reject any of her requests.</p><br/><p>\"Heh heh.\"</p><br/><p>Ai Hui chuckled. It was a pity that he had an elemental energy mask on. The scar on it, coupled with its fake smile, carried an indescribable gloom and coldness.</p><br/><p>Heh heh?</p><br/><p>Xiao Shuren was stunned. What did that mean?</p><br/><p>Although she had been through many significant occasions, she was now at a loss and did not know how to continue.</p><br/><p>An awkward silence ensued.</p><br/><p>As though there was no one around, Ai Hui kept his sword and prepared to exit.</p><br/><p>Xiao Shuren reacted, a fog rising in her eyes. As if she was going to cry, she asked in a pitiful voice, \"Did I disrupt your training?\"</p><br/><p>\"That’s right.\"</p><br/><p>Ai Hui answered matter-of-factly.</p><br/><p>Xiao Shuren’s body turned rigid. That’s right… What’s right? Her cherry lips opened slightly, her complexion stiff. The speech she had prepared so meticulously was stuck in her throat, unable to come out. She had met so many reputable fighters, and no matter how displeased they might be, they would still smile and respond politely with: \"Why do you say that, Miss? It’s such an honor to have you interested.\"</p><br/><p>Why were there such crude and unfeeling people in this world?</p><br/><p>In that moment, this was all Xiao Shuren could think.</p><br/><p>Following which, she thought, perhaps it was because she wasn’t beautiful today?</p><br/><p>If Ai Hui could hear her thoughts, he would lament his misfortune. Miss, just throw out a few hundred thousand elemental energy points and he would be overeager to compliment your angelic beauty. Not to mention the swordplay’s name, you could even get him to impart the skills with some negotiations.</p><br/><p>Thinking back, this was the same as how he treated One Thousand Yuan. There was no pressure at all for him to do the same thing again.</p><br/><p>However, the guard at the entrance became agitated. \"Outrageous! How dare you treat Madam so rudely!\"</p><br/><p>A guard dashed over aggressively. A righteous indignation filled his heart upon seeing his mistress being wronged.</p><br/><p>Seeing this person charging over, Ai Hui’s pupils shrank. He was unable to determine the man’s intention, but as a seasoned fighter, he absolutely would not act passively.</p><br/><p>With a turn of the broad sword in his hand, he became like a spinning top as a round, silver disk swiftly appeared before this guard.</p><br/><p>Xiao Shuren’s face changed greatly as she shouted at the top of her lungs, \"Stop!\"</p><br/><p>The guard only felt the anger of the silver sword ray sweeping over. An intense bloodlust shrouded his whole body as a sky-piercing whistle seemed to approach him.</p><br/><p>He had never before seen such an overbearing swordplay or felt such biting bloodlust. His mind went completely blank.</p><br/><p>Without any warning, the silver, raging wave dispersed like bubbles and left only the dumbstruck, pale-looking guard standing on the field.</p><br/><p>Ai hui’s silhouette had already disappeared.</p><br/><p>Only at the end did Ai Hui realize that he was still on someone else’s boat. He restrained his attack.</p><br/><p>Seeing that Ai Hui was gone, Xiao Shuren regained her composure. She also had no idea where He Lao came out from.</p><br/><p>\"He Lao, what do you think?\" Xiao Shuren asked calmly, without the slightest fear or panic.</p><br/><p>\"Shouldn’t be an enemy,\" He Lao muttered.</p><br/><p>Xiao Shuren nodded. That was also what she thought. If an enemy had the intention to invade their circle, he would think of a way to get close to them, pull strings, and even gain their trust. However, that fellow was so cold and clearly expressed his disinterest in getting close to them.</p><br/><p>She asked directly, \"Did you notice anything about his swordplay?\"</p><br/><p>\"Never seen it before.\" He Lao shook his head. \"The sword ray was like a silver disk, imposing and strong. Shocking indeed. With that outstanding sword technique, it’s no wonder he could make such a big name for himself despite not having yet achieved elemental externalization. I can see that he has already mastered element internalizationl and he can breakthrough to Elemental Externalization at any time. Once he breaks through to elemental externalization, his strength will naturally increase exponentially. Only, he has too heavy a murderous spirit.\"</p><br/><p>Xiao Shuren seemed to be moved by his words. \"He Lao has such high praise for him!\"</p><br/><p>He Lao replied, \"Although swordplay has been slowly recovering its glory for the past two years and there are many swordsmen, only a few are able to attain a higher level of skills.\"</p><br/><p>Xiao Shuren asked thoughtfully, \"Could Chu Zhaoyang be from Karakorum Sword League?\"</p><br/><p>Karakorum Sword League was an organization that had been established in these two years. Members boasted of being the successors of the Karakorum Sect. Karakorum sect was an ancient and faraway sword sect in the Cultivation Era. It had ruled the Cultivation Era for over thousands of years and had a long history.</p><br/><p>The influential appearance of Zuo Mo ended the regime of the Karakorum.</p><br/><p>But as time passed, the swordsmen started regarding Karakorum as the orthodox sect, instead of the more powerful and legendary Void Sword Clan.</p><br/><p>There were countless powerful sects that emerged throughout the history of the Cultivation World, but none had ever been as legendary and resplendent as the Void Sword Clan. Not only did they raise an exceptional evildoer like Zuo Mo, they had also raised geniuses like Wei Sheng, Gong Suncha, and many more. There had been supreme beings, unequalled swordsmen, and champion war generals. Every single disciple was impressive and well-known.</p><br/><p>Capability wise, the Void Sword Clan never fell below third place, but it wasn’t a pure swordsmanship sect. Other than Senior Wei Sheng, Zuo Mo’s training was complex and Gong Suncha was famous for commanding in battles.</p><br/><p>As such, it wasn’t surprising that swordsmen viewed Karakorum as the orthodox sect.</p><br/><p>Regardless of whether they were borrowing the reputation of Karakorum or of the Void Sword Clan, it wasn’t of much use in the elemental energy era. They were simply too ancient and distant. If recovering the glory of the Cultivation Era seemed attractive, recovering the swordsmen’s glory was a little nonsensical. No one admired them for using Karakorum’s fame, but people mocked them excessively instead.</p><br/><p>Nevertheless, the performance of the Karakorum Sword League shocked everybody. In these two years, the swordfighting trend was closely related to the promotional efforts of the Karakorum Sword League. They had gotten hold of a batch of swordsmanship inheritances and attracted and recruited a large number of elementalists in an unbridled manner. Then, after some introductory swordplay manuals started circulating in the market, elementalists found them formidable, instantly triggering the start of the swordfighting trend. Elementalists willing to join Karakorum Sword League would receive guidance from powerful swordmasters. They wouldn’t have to pay such a huge price to learn even higher level, inherited swordplay as well.</p><br/><p>The sword manuals circulated by Karakorum Sword League were evidently written by experts, and as such, attracted a lot of conjectures from all over. Unexpectedly, however, Karakorum Sword League remained very low-profile and did not make any big news.</p><br/><p>According to minor sources, however, there were a number of influences who placed their focus on Karakorum Sword League, but to no avail. Of course, these rumors hadn’t been verified and no one knew if they were true or false.</p><br/><p>The swordsmen were linked to Karakorum Sword League in countless ways.</p><br/><p>Upon witnessing Chu Zhaoyang’s excellent swordplay, Xiao Shuren naturally associated it with Karakorum Sword League.</p><br/><p>\"If he’s from there, he probably holds a high rank,\" He Lao muttered. \"Karakorum Sword League usually keeps a low-profile and the higher ups are even more mysterious, but since you mentioned it, I actually think it’s highly possible.\"</p><br/><p>Meeting Xiao Shuren’s gaze, He Lao said in a low voice, \"It’s not strange at all if Karakorum Sword League came for this.\"</p><br/><p>Xiao Shuren was stunned for a moment before her expression changed slightly. How could she have forgotten such an important thing? She mulled it over for a bit, her expression worsening. \"Karakorum is definitely interested in it!\"</p><br/><p>She was very certain now, that Chu Zhaoyang was definitely a swordsman from Karakorum Sword League!</p><br/><p>He Lao muttered once again, \"Where did Karakorum Sword League get the news from? Supposing that he is a member, why did he act so indifferently?\"</p><br/><p>\"They have many feelers and sources of their own. If Chu Zhaoyang is from Karakorum Sword League, why was he so cold?\" Xiao Shurun repeated He Lao’s words. She had been managing the chamber of commerce for so many years, had garnered deep respect from all the members, and had surpassing talent. \"Either he’s just a senseless person who has no knowledge of swords, or he doesn’t even need to come close to seize the goods. Or, perhaps he was monitoring us and how many more thieves there are?\"</p><br/><p>The more Xiao Shuren thought about it, the more alarmed she was.</p><br/><p>He Lao was alarmed and fidgety as well. \"Let’s take him down? Or else our whereabouts will be exposed?\"</p><br/><p>Xiao Shuren calmed down, her gaze flickering. \"No, perhaps we can make use of this.\"</p><br/><p>Ai Hui didn’t know that his performance had actually led them to the Karakorum Sword League. Had he known, he would not know whether to laugh or cry.</p><br/><p>In the room, Ai Hui was coiling the bandage very seriously.</p><br/><p>He wrapped the bandage around his chest. It had a certain restraining effect when used against the blood plum blossom. This was the only discovery made in roughly three years. The bandage was a gift from his mistress, and he later discovered that it could swallow fresh blood. In the war of Central Pine City, the bandage had developed an eye-shaped pattern.</p><br/><p>Later on, unintentionally, Ai Hui found out that placing the bandage near the boiling blood plum blossom caused it to cool down quickly.</p><br/><p>Ai Hui then realized that the bandage could restrain the blood plum blossom. He’d become wild with joy at the time, but his later discovery calmed his feverish mind.</p><br/><p>If he used the bandage to suppress the blood plum blossom’s break out, it would work for a short period of time before the flower flared up even more intensely.</p><br/><p>Ai Hui had no way out at this point. This wasn’t Peace City.</p><br/><p>The boiling blood plum blossom made him irritable and increased his murderous intent. If he hadn’t held back at the final juncture, that guard would have been sliced in half by his sword.</p><br/><p>But the murderous intent, which had appeared within a split second, had alerted Ai Hui.</p><br/><p>This operation was very crucial and mistakes were unpardonable. Keeping calm was key. An overpowering bloodlust would only turn him into a butcher, and butchers typically did not live long.</p><br/><p>In these three years, he had tried \"feeding\" the blood bandage.</p><br/><p>Chu Zhaoyang wasn’t someone who hadn’t kill before. In this chaotic world, popularity was derived from grappling and killing.</p><br/><p>The bandage reacted only thrice. It was exceptionally picky and was no longer that \"hungry bandage\" that took in everything. Having consumed three tonics, the blood eye on the bandage now had an eyebrow.</p><br/><p>He was curious how did the blood bandage really look like in the Cultivation Era.</p><br/>\n</div>"}