{"title": "Chapter 282: Meridian Sand", "id": 282, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-282-meridian-sand", "volume_title": "Volume 3", "body": "<h1>Chapter 282: Meridian Sand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 282: Meridian Sand</p><br/><p>Translator: Irene Editor: TYZ/KLKL</p><br/><p>The commerce team flew continuously for numerous days and all was calm.</p><br/><p>Ai Hui couldn’t be bothered making friends with Xiao Shuren and the gang and just stayed in his room to meditate. Being stuck on the edge of a breakthrough was simply too irritating but Ai Hui also knew that he shouldn’t rush it. Being hasty made things worse.</p><br/><p>Sometimes, he would sit and stare by the window and enjoy this rare feeling of contentment. He had been hustling and bustling for these three years and often wandered along the boundary between life and death. There was no time for him to appreciate the scenery and be lost in thought.</p><br/><p>He had never forgotten about revenge.</p><br/><p>He had been woken up many times from nightmares. The bloodstained Dragonspine and Teacher’s chest…it was like yesterday. Whenever he woke up at this point in the dream, an inexpressible grief and pressure befell him. It was as if the pitch black, deep night had engulfed the fields, making it impossible to struggle free.</p><br/><p>Falling into the abyss was his choice. He wouldn’t hesitate at all if given another chance.</p><br/><p>The abyss and the dark night were neither able to rescue nor destroy him.</p><br/><p>The Blood of God was so tremendous, even more so than how it looked on the outside. It was deep and profound. Ai Hui took only Lou Lan and the message tree from Vanguard Training Hall when he left Central Pine City. He had a better understanding of the Blood of God than most, and he knew how it was good at being forbearing and unscrupulous.</p><br/><p>Compared to it, Ai Hui was like a tiny cricket with no power to exact revenge. Hope was slim.</p><br/><p>But when it came to certain things, it was more about whether he wanted to do it, rather than whether he could succeed.</p><br/><p>Luckily there was Lou Lan.</p><br/><p>Thinking about Lou Lan made the corners of his lips turn up. Lou Lan was even stronger than before but remained pure and genuine. His vigorous, energetic voice always made Ai Hui feel encouraged.</p><br/><p>Suddenly, the alarm went off, startling Ai Hui.</p><br/><p>He looked out of the window and noticed a ball of white cloud flying toward him rapidly from afar. It looked aggressive and did not seem to harbor any good intentions. But the team’s reaction was fast. The transport wagon placed Auspicious right in the center.</p><br/><p>Elementalists with azure wings flew out one after another.</p><br/><p>Ai Hui involuntarily furrowed his brows.</p><br/><p>The situation did not seem right.</p><br/><p>That ball of white cloud wasn’t a Fiery Floating Cloud but one that belonged to a water elementalist. The team’s reaction was too quick, as if they’d already expected something like this to occur. Their defense was put up in a matter of seconds.</p><br/><p>Ai Hui shivered when his gaze fell upon those guards.</p><br/><p>Their elemental energy waves were stable and steady, and the azure wings on their backs emitted a solid light, seemingly attesting to their abilities. They were obviously elites and had clearly attained elemental externalization.</p><br/><p>Such significant backup made it impossible for Ai Hui to believe that this wasn’t preplanned.</p><br/><p>At this point, Ai Hui already knew that he was just afraid of getting dragged into this whirlpool, even though he had no idea what kind of whirlpool it was.</p><br/><p>Recalling well, he couldn’t help but laugh and rejected the thought that this could be a trap. From start to finish, he’d been making his own choices so no one was to blame.</p><br/><p>Ai Hui didn’t know if he was lucky or unlucky.</p><br/><p>He started to understand why he was being invited onto this Fiery Floating Cloud. It wasn’t because he was reputable, but rather because the other party wanted to keep him around.</p><br/><p>Indeed… a little embarrassing!</p><br/><p>Ai Hui touched his nose and stayed well-behaved in his room.</p><br/><p>Any action on his part might be regarded as threatening.</p><br/><p>He had a keen sixth sense and could vaguely detect the whiff of a faintly discernible odor outside the door. He Lao’s silhouette surfaced in his mind. Ai Hui did not expect He Lao to spy on him personally. That old fellow’s capability was unmeasurable and Ai Hui did not wish to provoke him.</p><br/><p>Ah, who knew that taking this vessel would lead him to this.</p><br/><p>Ai Hui sat leisurely by the window, watching the events unfold like a bystander.</p><br/><p>The team’s display of strength was really something.</p><br/><p>Ai Hui remembered the name of the enterprise –\"Great Wei Enterprise\". He had never heard of it before. Having stayed in Peace City for three years, he’d heard of most chambers, big or small, operating on the trade route. Even though he wasn’t aware of every single enterprise, if the name had appeared a few times more often, he would’ve heard of it at least.</p><br/><p>Yet, he was certain that he’d not heard of Great Wei Enterprise.</p><br/><p>It was unknown whether or not the other party was heading towards Jadeite forest. Ai Hui was somewhat puzzled and decided to find an opportunity to slip off midway. His priority was to head over to Magic Cloud City so he had no time to waste on Great Wei Enterprise.</p><br/><p>The arriving water elementalist was strong and he was hiding among the clouds without revealing his face. The cloud was about as big as Auspicious and looked like a huge monster, its momentum tumultuous and oppressive.</p><br/><p>\"Who has come?\"</p><br/><p>A guard from the enterprise spoke loud and clear.</p><br/><p>The other party did not respond. Instead, countless bright arrows shot out from the clouds toward the guards.</p><br/><p>The guards did not panic. They each did what they did best. Some used weapons to brandish a sheet of lightscreen, some were surrounded in eggshell-like light screen, while others laid out a sheet of sea of fire. Ai Hui was dazzled by them all.</p><br/><p>Ding ding ding!</p><br/><p>The concentrated collision sounds never stopped. When the specks of light hit the guards’ surrounding light rays,</p><br/><p>Ai Hui saw clearly the shocking power of the light arrows. They were raindrops the size of green beans, were uncountable and covered an extremely wide area. The rain fell incessantly, filling the skies with sharp whistling noises.</p><br/><p>Ai Hui smacked his lips. This was truly a large-scale moving fort.</p><br/><p>Attaining elemental internalization opened the access between the Nature and the human body. Upon attaining elemental externalization, an elementalist can borrow the elemental energies from the Nature to increase his powers. Where vapor filled the air, like in Palette Cloud Village, water elementalists would undoubtedly best be able to unleash their powers.</p><br/><p>When faraway, the environment played a major role in affecting one’s combat abilities.</p><br/><p>The water elementalists at sea, earth elementalists in the desert, wood elementalists in the forest, fire elementalists in the midst of earth fire and metal elementalists in the city… you were never to cross paths with them there unless necessary. They were enemies no one wanted to face.</p><br/><p>This person trained with clouds and mist. Where there was plenty of vapor, his abilities rose dramatically.</p><br/><p>But the guards of Great Wei Enterprise weren’t willing to be passive. They spread their azure wings and dispersed, before flying toward that ball of cloud from all directions.</p><br/><p>They were like an agile flock of birds drawing handsome light traces in the sky, their murderous intent intense.</p><br/><p>A blue fireball was thrown into the clouds.</p><br/><p>Boom!</p><br/><p>Like cotton, the cloud burst into flames, the blue blaze spreading across the clouds.</p><br/><p>\"[Icy Flames]!\"</p><br/><p>A stifled groan sounded from within the clouds as they shook strongly like the vibrations of huge drums and gongs, causing everybody’s ears to go numb.</p><br/><p>Ai Hui was astounded as well. Up till now, he had discovered nine types of [Icy Flames] and the inheritances of these nine types of [Icy Flames] were all in Icy Flames Division at Fire Prairie.</p><br/><p>[Icy Flame], as the name implied, was cold. Generally water restrained fire, but [Icy Flame] was water’s mortal enemy.</p><br/><p>Ye Baiyi commanded the [Icy Flames] Division with help from the Blood of God, and took with him practically every elementalist that practiced [Icy Flames]. Although Elders Guild had a backup copy of every [Icy Flames] inheritance, the most proficient practitioners of [Icy Flames] in this present age were all under the Blood of God.</p><br/><p>The Elders Guild had wanted to rebuild [Icy Flames] Division for a long time now but had been unable to do so because of this.</p><br/><p>Tradition was treasurable for sure, but no matter how much it tried to replace old with new, the Thirteen Divisions were forever the real masters .They could exchange skills and learn from one another. With many people training together, there were sufficient supplies of materials to create all kinds of new experiments.</p><br/><p>As such, in this aspect, Avalon of Five Elements was behind by over ten years, or even longer.</p><br/><p>\"Such a pity that [Icy Flames] Division betrayed Avalon of Five Elements!\"</p><br/><p>A cold groan sounded from within the clouds as an immeasurable amount of water vapor gathered from all directions and inflated the cloud at a shocking speed. Where it was in contact with the [Icy Flames], it transformed into a cloud whip and belted towards the elementalists in the sky.</p><br/><p>The cloud whip burned continuously but also grew at an even faster speed.</p><br/><p>The guards’ faces changed. Even the fire elementalist who threw the [Icy Flames] was shocked as well and he quickly retreated. Getting [Icy Flames] on himself meant trouble.</p><br/><p>Countless bright blade lights flew toward the small mountain-like cloud like fast javelins, their sharp, silver arrow light accompanied by balls of raging flames.</p><br/><p>But it had no effect, as if a clay ox had just entered the sea and disappeared.</p><br/><p>Among the many offensive attack moves, the balls of raging flames seemed unremarkable. The clouds and mist swallowed it up in one mouthful.</p><br/><p>Icy Flames was slightly more troublesome as the raging flames would only be restrained by a water elementalist. These elementalists were having a headache.</p><br/><p>Sure enough, the raging flames continued shrinking and melting. Clap! They collapsed and a ball of clear, yellow sand flowed out.</p><br/><p>This lump of yellow sand was abnormally dry. Once it fell and landed among the clouds, it started to absorb the surrounding vapor rapidly.</p><br/><p>It was like a yellow bottomless pit, as an immeasurable amount of clouds and mist were ingested non-stop.</p><br/><p>\"Meridian sand!\"</p><br/><p>The hidden, mysterious water elementalist between the clouds was, for the first time, emotionally stirred. He felt a hint of fear.</p><br/><p>Meridian sand was known to be the driest sand and was an extremely precious type of earth sand. It was made of sand, soil and mainly rock, and had the widest range of uses in all sand types. Yellow Sand Corner was known for producing all kinds of sand but even then, Meridian sand was extremely uncommon there.</p><br/><p>Ai Hui, who had been observing leisurely, stood up for the first time, his eyes opened wide.</p><br/><p>Uncommon meant expensive!</p><br/><p>Ai Hui was stunned by Great Wei Enterprise’s way of handling business. Because of Lou Lan, Ai Hui had a much better understanding of sand types and materials. Lou Lan had a very big sand core but his body hindered his performance. Ai Hui had always wanted to upgrade Lou Lan’s body, so he was very aware of the market situation with regard to sand materials.</p><br/><p>Ever since Yellow Sand Corner fell into the hands of the enemy, the price of sand materials rose at least five times and some good materials just kept getting more and more expensive, without limit. Mostly, materials were out of stock and he couldn’t buy them even if he wished.</p><br/><p>Meridian sand was one of those.</p><br/><p>If he could give Lou Lan the Meridian sand, Lou Lan would instantly become the water elementalists’ mortal enemy.</p><br/><p>This was an material that Ai Hui had not even dared to set his heart on obtaining, yet Great Wei Enterprise actually used it for battling. Watching it made Ai Hui bleed inside. He wanted so badly to dash up and fight the water elementalist, then snatch the sand over.</p><br/><p>A pity it was being abused this way.</p><br/><p>Meridian sand’s formidability was astonishing. The small, mountain-like layers of cloud were actually being firmly sucked in by a small lump of meridian sand, unable to struggle free at all.</p><br/><p>The clouds shrank rapidly and the water elementalist’s body was finally revealed. It was a middle-aged man, his face overwhelmed with shock at this point.</p><br/><p>Losing the clouds as a shield, he had no strength to resist at all.</p><br/><p>A few guards had already closed in on him from different directions, ready to nab him alive.</p><br/><p>Suddenly, the middle-aged water elementalist revealed an eerie smile as a pool of fresh blood spilled out of his mouth.</p><br/><p>The guards’ faces changed greatly. He increased his speed and charged over but the water elementalist was no longer alive.</p><br/><p>Just then, He Lao’s voice sounded. \"Mister Chu, Madam’s requested a meeting with you.\"</p><br/><p>Ai Hui shivered inwardly, his scalp going slightly numb.</p><br/>\n</div>"}