{"title": "Chapter 289: A Turn of Events", "id": 289, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-289-a-turn-of-events", "volume_title": "Volume 3", "body": "<h1>Chapter 289: A Turn of Events</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 289: A Turn of Events</p><br/><p>Translator: TYZ Editor: TYZ/CakeHermit</p><br/><p>After changing back to his original appearance, a calm look appeared on Ai Hui’s face. He swaggered along the street and no one cared about him at all.</p><br/><p>Nowadays, Ai Hui was slightly wealthy. Naturally, he had no qualms about buying things. He found the shop he was looking for, went in, replenished his equipment, and left the shop without any hesitation. No matter how chaotic the situation had become, he still had to get to Magic Cloud City first before he could decide on doing anything.</p><br/><p>Along the way, no one noticed him. No matter which angle one looked at him from, he bore no resemblance to Chu Zhaoyang. He had a youthful face, muddy yellow azure wings, and attained Elemental Externalization. No one would suspect him of being Chu Zhaoyang.</p><br/><p>However, Ai Hui was still extremely vexed. Along the way, he encountered several people who asked him whether or not he had seen a middle-aged man with a pair of silver-colored azure wings. It was at this moment that he realized how infamous Chu Zhaoyang had become.</p><br/><p>He had a deep hatred for Great Wei Enterprise.</p><br/><p>They’d better not bump into him. Humph.</p><br/><p>After a few days, when Ai Hui landed in Magic Cloud City, before he could even keep his azure wings, he heard a sneer from nearby.</p><br/><p>\"Another fellow who fantasizes about getting rich. Does he think Chu Zhaoyang is really that stupid? Why would he come here when he knows that there are so many people waiting for him? Bandit Chu purposely came up with this diversion tactic and has already made his escape!\"</p><br/><p>\"Money is the root of all evil! Look at him, he’s still so young. It’s understandable why he’s doing this.\"</p><br/><p>...</p><br/><p>When Ai Hui heard the whispers between the two men, he stumbled as he was landing on the ground.</p><br/><p>Alright, I will pretend I never heard what they said.</p><br/><p>Ai Hui consoled himself. However, after he had walked a few meters, he started to feel really uncomfortable. Everyone on the street had their eyes twinkling brightly, skeptically and warily examining each other. There were even some people who occasionally twitched their noses to sniff at each other, looking extremely like hunting dogs.</p><br/><p>Having travelled extensively for so many years, this was the first time Ai Hui came across such a scene.</p><br/><p>Everyone was mad...</p><br/><p>Ai Hui was filled with helplessness and agony. How could he communicate with others like this? When he saw the wanted poster on the street and saw the astronomical reward of ten thousand essence elemental beans being offered, for a moment, he had the urge to give himself up to Great Wei Enterprise.</p><br/><p>Troublesome!</p><br/><p>No matter how dull Ai Hui was, he still knew how troublesome the situation he faced was.</p><br/><p>Ai Hui felt unsure about his contact. If he was also interested in capturing Ai Hui for the reward or coveted the so-called ancient treasure, then Ai Hui would be in danger.</p><br/><p>At this very moment, Ai Hui heard someone yelling, \"Caught! Caught!\"</p><br/><p>Ai Hui could feel that the street was about to erupt into a commotion.</p><br/><p>\"Has Chu Zhaoyang been caught?\"</p><br/><p>\"Who caught him?\"</p><br/><p>\"Where? Where? Which bastard was so lucky?\"</p><br/><p>...</p><br/><p>Everyone was annoyed. They could only look on helplessly as the windfall of ten thousand essence beans disappeared into thin air.</p><br/><p>\"No, it’s Great Wei Enterprise that was caught. The ancient treasure was in their hands all along and the Chu Zhaoyang incident is a cock-and-bull story set up by them!\"</p><br/><p>\"Woah, the Great Wei Enterprise is so cunning! Thief crying thief!\"</p><br/><p>\"Too treacherous! Serves them right! I have said it before, how can Chu Zhaoyang be so stupid? If he really wants to steal something, why would he tell other people about his destination?\"</p><br/><p>\"You don’t say? That’s hindsight! Aren’t you here in the end?\"</p><br/><p>\"Why are you all still talking about Chu Zhaoyang? What exactly is the ancient treasure? It’s in whose hands now?\"</p><br/><p>\"Karakorum!\"</p><br/><p>\"Karakorum is rich this time around!\"</p><br/><p>Upon hearing the bits and pieces of everyone’s discussion, Ai Hui was between laughter and tears. Nothing could describe what he was feeling now. First, he boarded a caravan and was made a scapegoat. Then, the incident got blown out of proportion. In the end, Great Wei Enterprise got into big trouble.</p><br/><p>He rejoiced in Great Wei Enterprise’s misfortune. They deserved it.</p><br/><p>Great Wei Enterprise never expected themselves to screw up this badly.</p><br/><p>Ai Hui heaved a sigh of relief. He had spent so much effort building the identity of Chu Zhaoyang and this identity was extremely important to his subsequent operations. He would vomit blood if he could not use it anymore.</p><br/><p>This incident reminded him that he should make a few more identities. Preparedness averts perils. In case something like this happened in the future again, he would not be stuck with just one identity.</p><br/><p>Instead of going straight to the meeting point, he stayed in Magic Cloud City.</p><br/><p>After two more days, no one talked about Chu Zhaoyang anymore. The whole city was filled with heated discussions on Karakorum and the ancient treasure. Some said that the ancient treasure was actually an ancient sword art that had belonged to Karakorum in the past. Some also said that the ancient treasure was an exceptional elixir. There was not only one, but a hundred of them.</p><br/><p>Anyway, the main idea of every discussion was that Karakorum struck a windfall and swordsmanship was going to make the big time.</p><br/><p>Ai Hui also learned that almost all of Great Wei Enterprise’s experts had been killed. The captain, Madam Xiao, was nowhere to be found and no one knew whether or not she was alive. A lot of people lamented at the thought of her. It would be a pity if such a great beauty died just like that.</p><br/><p>It would be a real pity if she was just nowhere to be found, Ai Hui mumbled to himself.</p><br/><p>He thought about how he had been set up by them. Alright, now he did not even have the chance to take revenge after being made a scapegoat for so long. Of course, he had long forgotten about the one hundred essence elemental beans they had given him that day.</p><br/><p>After making sure the coast was clear, Ai Hui put on Chu Zhaoyang’s elemental mask and walked onto the street.</p><br/><p>\"Eh, isn’t that Chu Zhaoyang? Sigh… There go my ten thousand essence elemental beans.\"</p><br/><p>\"Forget it. He was able to blow up the Auspicious and escape. You will only be seeking death if you take him on.\"</p><br/><p>\"Forget it, he’s not worth it.\"</p><br/><p>...</p><br/><p>Upon hearing these words, Ai Hui was finally at ease. It was just that he felt these people seemed to be looking at him with disdain. Perhaps it was his misperception.</p><br/><p>After roaming around the city for quite a while and making sure no one was following him, Ai Hui walked into an alley. After making several turns, he reached a huge residence. The large vermillion entrance doors were tightly shut. Ai Hui knocked on the door.</p><br/><p>After a while, the door opened and a muscular man appeared. When he saw it was Ai Hui, he said expressionlessly, \"You’re late.\"</p><br/><p>\"There’s nothing I could do about it,\" Ai Hui replied helplessly. \"You should know about my situation.\"</p><br/><p>The muscular man grinned and stepped aside for Ai Hui to enter.</p><br/><p>Ai Hui walked into the courtyard and looked around. The courtyard was unadorned and filled with various kinds of flowers and plants. Deep down, however, Ai Hui knew that these beautiful flowers and plants were actually hidden killing machines.</p><br/><p>This muscular man, who looked like a blacksmith, was actually a wood elementalist, a very powerful one. Ai Hui had once witnessed a rather powerful guy try to fight with this wood elementalist and end up dying on the spot.</p><br/><p>He did not know the muscular guy’s real name. Everyone called him Hua Kui (In Chinese, it means Queen of Flowers).</p><br/><p>Whenever Ai Hui thought about the muscular man being named Hua Kui, his hair stood on end.</p><br/><p>\"The rest have left.\" Hua Kui cast a glance at Ai Hui and said, \"Since you have a valid reason this time around, the higher-ups won’t pursue the matter of you being late. However, this shall not be taken as a precedent.\"</p><br/><p>Ai Hui furrowed his eyebrows and his face turned ashen. \"Of course. I know this.\"</p><br/><p>Hua Kui was not angry and smiled. \"It seems like you have attained elemental externalization. Congratulations.\"</p><br/><p>He had never seen anyone in the organization that had merely attained elemental internalization complete so many missions before.</p><br/><p>\"My reward,\" Ai Hui replied, not wanting to waste any time.</p><br/><p>\"You did a great job for your last mission. The higher-ups have decided to double your reward.\" Hua Kui passed a piece of leaf to Ai Hui. \"This is the information on the secret arts of blood elementalists that you wanted. Actually, given your scope of authority, you have no right to read this information, but the higher-ups made an exception for you. Of course, this information is from three years ago. It is unknown whether or not they have developed other secret arts during these three years. Remember, don’t leak this information out. I don’t need to remind you of the consequences.\"</p><br/><p>Excitement arose in Ai Hui’s heart. The information from three years ago was more than enough for him.</p><br/><p>He acted nonchalant and kept the piece of leaf. Then, with an unhappy tone, he said, \"It seems like you have a lot to say today.\"</p><br/><p>Hua Kui chuckled and continued, \"The second reward is an opportunity for you to learn something new.\"</p><br/><p>\"An opportunity to learn? A swordsmanship inheritance?\" Ai Hui’s eyes lit up. \"Don’t use some trash to fool me.\"</p><br/><p>Hua Kui smiled and replied, \"For a swordsmanship inheritance, you will have to depend on yourself. However, we can send you to Karakorum to train in [Sword Formation] for a week. How about it? Are you interested?\"</p><br/><p>\"Karakorum is our ally?\" Ai Hui’s eyes shrunk.</p><br/><p>Hua Kui smiled and did not say anything.</p><br/><p>Three years ago, when Ai Hui left Central Pine City, he brought along the message tree in Vanguard Training Hall. The organization that the old prisoner was a part of was called Assembly of Patriarchs. This organization was the arch-enemy of the Blood of God. The enmity between the two organizations could be traced back to the ancient past.</p><br/><p>Ai Hui knew that one man was not enough to deal with the Blood of God. He had too little knowledge of the Blood of God.</p><br/><p>Since the old prisoner’s organization was the arch-enemy of the Blood of God, then they must have a lot of information about them.</p><br/><p>Furthermore, the old prisoner had told Ai Hui that the blood plum blossom on his chest must be a secret art of the blood elementalists.</p><br/><p>However, when Ai Hui suggested joining the Assembly of Patriarchs, the old prisoner had raised a strong objection. This surprised Ai Hui. The old prisoner did not give him many details, but he revealed his suspicion and lack of trust towards the organization. This made Ai Hui realize that there was more than meets the eye with regards to the organization. </p><br/><p>Putting the blood elementalist’s secret art that was on Ai Hui’s body into consideration, the old prisoner and Ai Hui decided to use a fake identity for the latter to use to enter the organization. The old prisoner used to be a core member of the Assembly of Patriarchs and he knew everything about the organization.</p><br/><p>The Assembly of Patriarchs’ stringency and prudence exceeded Ai Hui’s expectations. If not for the old prisoner’s assistance, Ai Hui’s situation would have been very dangerous.</p><br/><p>With the old prisoner’s guidance, Ai Hui started from the position of an external member and rose through the ranks. After spending two years in the organization and completing numerous missions for them, he finally became an official member.</p><br/><p>Deep down, Ai Hui suspected a long time ago that Karakorum was tightly linked to the Assembly of Patriarchs. Swordsmanship inheritances!</p><br/><p>When Ai Hui first discovered that the Assembly of Patriarchs possessed a huge amount of swordsmanship inheritances, he had been startled.</p><br/><p>Swordsmanship had been irrelevant for many years. Even sword moves like the three moves from his sword pill were extremely hard to find. As such, how could Ai Hui not feel shocked when he suddenly discovered an organization that possessed so many sword inheritances?</p><br/><p>Ai Hui soon realized that the Assembly of Patriarchs had been experimenting with their swordsmanship inheritances and obtained a lot of desirable outcomes. What surprised him the most was that the outside world had zero knowledge about what they were doing at all. It was at this moment that he realized that he had underestimated the Assembly of Patriarchs in the past.</p><br/><p>With the sudden appearance of Karakorum, Ai Hui suspected that the Assembly of Patriarchs might have something to do with Karakorum. He could not help but feel suspicious about the sudden appearance of a long-lost sword art in an organization that specialized in swordsmanship.</p><br/><p>Today, his doubts had finally been confirmed.</p><br/><p>Hua Kui did not admit nor deny it. He merely cackled. \"Sword Formation was a secret sword art of Karakorum. Even though it can’t be compared to the sword arts in the Cultivation Era, it is still very powerful. Every time it is activated, two hundred essence elemental beans will be consumed. It is usually reserved for those core disciples to practise. You have made a bountiful gain this time around.\"</p><br/><p>Two hundred essence elemental beans!</p><br/><p>Ai Hui’s eyes widened in an instant.</p><br/><p>\"I will go!\"</p><br/>\n</div>"}