{"title": "Chapter 300: The Allure of Red Muslin", "id": 300, "volume": 3, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-300-the-allure-of-red-muslin", "volume_title": "Volume 3", "body": "<h1>Chapter 300: The Allure of Red Muslin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 300: The Allure of Red Muslin</p><br/><p>Translator: Irene Editor: TYZ/KLKL</p><br/><p>Sha family did not attack them directly, this took Ai Hui by surprise.</p><br/><p>They must be preparing for a big move!</p><br/><p>He had to be better prepared. Unassured Ai Hui was like a diligent bee. The details he had been too lazy to ponder over are filling his mind up.</p><br/><p>He was still unaware that Sha Wuyuan, whom he murdered, was the in charge of Sha family’s branch.</p><br/><p>After Sha Wuyuan’s death, Peace City’s Sha family branch was leaderless. Plus, Ai Hui’s ruthlessness intimidated the remaining people and none of them dared to make a move.</p><br/><p>What made them feel more at ease was the fact that Sha family’s elite troops were all deployed and were rushing to Peace City without resting at all.</p><br/><p>Sha Wuyuan’s violent death on the street shook Sha family greatly.</p><br/><p>With a big dip in Sha family’s strength, Sha Wuyuan was considered the cream of the crop. Or else, he wouldn’t be sent to lead the fight and be the in-charge.</p><br/><p>It wasn’t Sha Wu Yuan’s death that shocked Sha family but the absolutely unrestrained and powerful attack Wang Han had displayed.</p><br/><p>In the eyes of Wang Han, Sha family meant nothing.</p><br/><p>This was a ruthless and firm, exceedingly strong, reckless yet calm and meticulous enemy!</p><br/><p>Sha family was having a headache already.</p><br/><p>Enemies like Wang Han were those they did not want to provoke. Even when the family was at its peak, these kind of enemies were to be avoided, as learnt from past mistakes.</p><br/><p>There used to be a well-celebrated An family that developed an animosity towards a misfortuned earth elementalist. For twenty years, that elementalist harassed and attacked the family perpetually. An family brought together many to hunt him down but he was extremely crafty and managed to escape every time. What followed was an even more intense revenge operation as An family branch kept getting wrecked. Their disciples were killed and the enterprise was burnt.</p><br/><p>Each revenge added a wound to the colossal An family.</p><br/><p>After twenty years of feud and blood loss, the colossus finally succumbed and collapsed. On the twenty second year, this earth elementalist secretly persuaded seven less powerful clans to join forces to dismember An family, causing it to perish.</p><br/><p>No one knew this period of history better than Sha family since they had been one of the seven clans. Sha family’s sudden rise in status also attributed to that military campaign against An family.</p><br/><p>Revenge exacted, the earth elementalist went on to become a grandmaster five years later. He then accepted Elders Guild’s invitation and became the leader of Lordsand Division for twelve years. Within these twelve years, Lordsand Division leapt its way up from the bottom, into becoming the head of the Thirteen Divisions. The younger generation he carefully natured was as brilliant as he was and in the next sixty years, Lordsand Division maintained its position as the top three.</p><br/><p>Historically speaking, this earth elementalist was a legendary Grandmaster, whom countless other earth elementalists worshipped greatly, and his name was Mo Qishi, Lord Mo of Sand.</p><br/><p>Leading Lordsand Division, Mo Qishi charged to the frontline. It was a piece of news that shocked the Wilderness, immediately causing them to pull back over 900 miles. He was then crowned Lord Mo of Sand, a name that rose to extreme fame. An family’s land had already became ruins where weeds grew rampantly and filled with jackdaws’ calls. The bones that covered the fields were left unburied.</p><br/><p>If Sha family knew how powerful Wang Han was, they would never have provoked him.</p><br/><p>It was a pity that this world did not allow what ifs.</p><br/><p>Sha family’s only choice was to calm the dangers before the bloom of Wang Han’s feather wings. The family’s current situation was even more dangerous than that of An family’s.</p><br/><p>Sha family was like a patient gasping for oxygen. They could not afford to fail.</p><br/><p>But their enemy was craftier than they had imagined. He had seen through their weakness.</p><br/><p>\"Ah, if you ask me how melancholy I am now, I can tell you I feel like a poor man who is gifting his head away!\"</p><br/><p>A sorrowful cry sounded in the shabby training hall. Ai Hui looked at the organized spoils of war in front of him, his face full of anxiety. Didn’t Sha Wuyuan have a high position in the family? A significant figure?</p><br/><p>‘Sha Wuyuan, Sha Wuyuan… Are these scraps that you carried around worthy of your identity?\"</p><br/><p>As compared to Shi Youguang, the items found on Sha Wuyuan was simply unpresentable.</p><br/><p>Sha family was really in a bad state, as evident from Sha Wuyuan’s belongings. There wasn’t even a sand compass. Ai Hui stroked his chin as he was thinking about how he could get rid of the melancholy caused by his poverty-stricken self.</p><br/><p>He was crazily poor!</p><br/><p>War was indeed a gold-swallowing monster. Although he did not once hesitate when fixing up the place, once it was completed he felt a piercing pain. It was like he was a starving beast, searching for food everywhere.</p><br/><p>Since Sha Wuyuan was to be stationed here first, he should’ve prepared many things including money.</p><br/><p>Yet, Sha family had yet to make a move. They were most likely still on the road preparing their big move, which required time.</p><br/><p>Wouldn’t Sha family branch be empty at this time?</p><br/><p>Ai Hui’s eyes lit up and without a word, he dashed into the warehouse and pulled the fat housekeeper out. Even before he could question anything, the fat housekeeper started pissing in his pants, his tears carried the music down his nose. As if pouring beans out from a bag, he revealed everything he knew.</p><br/><p>Sha Wuyuan was the in-charge of Sha family branch and also the strongest member within the frontline troops. Sha family branch was located at a compound in the east of the city, where there were huge volume of goods and money. Their mission was to construct the house ahead of time for the arrival of Sha family’s main army force.</p><br/><p>This fellow even revealed the exact positions of the guards in full details.</p><br/><p>The information he forced out of the fat housekeeper proved his assumption right. The branch was meaningless and Sha family was in a bad state. Ai Hui could even gauge the strength of Sha family from Sha Wuyuan’s position in the household.</p><br/><p>Being cautious, Ai Hui questioned a few other guards and received unanimous information. The housekeeper wasn’t lying.</p><br/><p>Without hesitation, Ai Hui took this fleeting chance and headed towards the Sha family branch when the sky turned dark.</p><br/><p>There were no starlight amid the pitch black sky. The Starry Gem Swordwing Ai Hui carried with him transformed into a deep black color allowing Ai Hui to silently glide across the sky like a big black bat.</p><br/><p>The city below was brightly lit and filled with pedestrians. The construction site outside the city was buzzing with activities.</p><br/><p>What a great time for murder and arson!</p><br/><p>Shortly, Ai Hui arrived and stopped above Sha family’s compound.</p><br/><p>The yard was a typical one within this locality, which had a garden that was roughly two acre big. Previously the land in Peace City wasn’t worth much, but highly priced these days.</p><br/><p>The compound was also brightly lit and dog barks could be heard occasionally. There was an elementalist guard standing atop the arrow tower, which was built at the last moment. There was an inexpressibly tense atmosphere that surrounded the whole compound.</p><br/><p>Sha Wuyuan’s death caused panic to the branch. Everyone was feeling jittery and extremely nervous.</p><br/><p>Ai Hui saw gaps and loopholes everywhere. For example, there wasn’t any warning indicator neither was a light zone that showed where flying was prohibited built.</p><br/><p>Ai Hui chose not to infiltrate. Instead, he chose a more provoking move.</p><br/><p>The Starry Gem Swordwing on his back opened up in a swift movement and he shot up into the sky like a sharp arrow.</p><br/><p>Ai Hui only stopped when he was thousands of meters above. The golden wind up in the sky was bitingly cold, just like knives. However, it no longer caused any disturbance to him.</p><br/><p>Holding the Dragonspine, Ai Hui loosened up his body, allowing it to drop like a meteorite.</p><br/><p>His descending speed increased continuously as he fixed his gaze on the compound that he was about to land on.</p><br/><p>His wings were majestic and motionless. A spark lit up at the edge of the wings, illuminating Ai Hui’s cold eyes. His grave as stone face was filled with murder lust.</p><br/><p>The spark became brighter as Ai Hui’s speed increased continuously.</p><br/><p>People on the ground started to notice something peculiar in the sky and many stopped to look up. The spark that was descending was like a meteor that lit up people’s faces, causing them faintly discernable.</p><br/><p>Their eyes were all wide open.</p><br/><p>That was…</p><br/><p>A whistle sounded and in a flash, the sky rumbled and shook, as if there was a hurricane rolling in and sweeping across Peace City.</p><br/><p>Countless people rushed out of their rooms and looked towards the sky.</p><br/><p>Boom!</p><br/><p>The sparks surrounded Ai Hui burst into flames. The fiery blaze that flickered and swayed amid the surging airflow was like a demonic fire from netherworld, enveloping Ai Hui completely.</p><br/><p>The rumble was deafening and Ai Hui, who was wrapped in raging flames, had cold-as-ice eyes that were expressionless, desolate and deep.</p><br/><p>Suddenly, a speck of ray lit up from the depths of his dark as night pupils. It was as if a little glow had just lit up in a faraway, absolutely dark place.</p><br/><p>Ai Hui used his sword suddenly.</p><br/><p>He thrusted the sword out unhurriedly. Dragonspine was as heavy as a thousand catties and the elemental energy in his whole body was stimulated to its greatest point as every bit of his muscle was engaged. Sweat poured out but it evaporated into mist in the blink of an eye, and the mist disappeared into the raging blaze.</p><br/><p>In the eyes of the audience below, the ball of flames seemed to be stretched, by a pair of invisible hands, into an elliptic shape with its front being slightly sharp.</p><br/><p>The strange thing was, as the flames dimmed gradually, the sword ray burned even fiercer, like a red hot branding iron.</p><br/><p>Just then, the silhouette wrapped in flames revealed itself.</p><br/><p>Rushing out of the room and looking up into the sky, Su Huaijun shouted as her pupils shrunk, \"It’s him!\"</p><br/><p>Wide in shock, the three young ones simultaneously cried out in alarm while looking at that figure in the sky, \"Teacher!\"</p><br/><p>Fu family members were all stunned upon witnessing this scene. Fu Yonghao called out in surprise, \"Wang Han!\"</p><br/><p>The rest were all overwhelmed with shock.</p><br/><p>By now, those in the Sha family compound had gotten a clear view of that meteor-like figure in the sky and were all panic-stricken. They were like a nest of ants, frenetically gathering close together.</p><br/><p>The sword in Ai Hui’s hand trembled incessantly but did not take away his focus. His control over the sword was now instinctive thanks to the arduous trainings he had been through. His move had been majorly improvised but his profound accumulation were like dried firewood, ready to ignite and blaze up the moment an inspirational spark appeared.</p><br/><p>The elemental energy circulated within his body.His sword seemed to possess a boundless, attractive force as all of the newly born flames entered Dragonspine’s sword ray.</p><br/><p>The hurricane-like rumbling turned into a mosquito-like lingering sound and finally into a silence that belonged to the night. Everyone couldn’t help but to hold their breaths as the whole scene unfolded before them. They were bound to remember this for life.</p><br/><p>The figure that dove down from the the vast dark sky carried a red hot sword ray, and the aftermath it stirred up was like a long, dull red muslin that covered several hundred meters.</p><br/><p>As the whistling sound gradually softened, the red muslin seemed particularly alluring.</p><br/><p>Time seemed to stop at this point where amid the silence, people were staring blankly at the breathtaking scene that happened in the sky.</p><br/><p>The more beautiful things were, the more dangerous it was.</p><br/>\n</div>"}