{"title": "Chapter 314: A Jinai", "id": 314, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-314-a-jinai", "volume_title": "Volume 4", "body": "<h1>Chapter 314: A Jinai</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 314: A Jinai</p><br/><p>Translator: Irene Editor: TYZ/KLKL</p><br/><p>The news quickly spread all over Peace City thanks to the efforts of those involved.</p><br/><p>Jiang Wei got hold of the news early on and felt somewhat anxious. He knew of Dragonrise’s good reputation of course. It was the first time in the Avalon of Five Elements that a battle master had established a training hall. Among his colleagues, there was no lack of sons from Silver City’s influential officials. He’d heard that Dragonrise Training Hall’s background was far from simple.</p><br/><p>Citizens coined this match the battle between the training halls. Dragonrise Training Hall wasn’t willing to let Swordsman Training Hall snatch their limelight and was determined to re-establish their reputation through this method.</p><br/><p>Jiang Wei wasn’t sure why, but he smelled danger coming from the seemingly honorable war between the training halls.</p><br/><p>In three years, not only had he been on the front line and participated in countless battles against the blood elementalists, he also witnessed many scheming fights. Places which seemed unremarkable were usually unexpectedly dangerous.</p><br/><p>Jiang Wei straightened out his thoughts once more but found nothing amiss.</p><br/><p>He heaved a sigh of relief. Perhaps he was just being overly suspicious.</p><br/><p>The soldiers under him reported that someone was here to visit.</p><br/><p>He stopped himself from overthinking, got up and walked to the main hall, where a tall and sturdy man stood in the center. Upon getting a clear look, Jiang Wei couldn’t help but smile. He walked forward with big steps and gave a solid hug to the visitor. \"A Jinai! Long time no see! I’m so happy to see you!\"</p><br/><p>A Jinai grew a thick, forest green beard. He had deep set, brown eyes and a high nose bridge. These features were the evidence of his Grass Clan’s blood from the Old Territory.</p><br/><p>Grass Clan was one of the better clans in Old Territory, because each year there would be at least some youngsters who would qualify to enter the Avalon of Five Elements. Most of them moved on to become wood elementalists upon entering the avalon.</p><br/><p>A Jina used to be Jiang Wei’s team leader, but was promoted to the back as he’d sustained an injury from accomplishing a meritorious deed for the team. A Jinai took great care of Jiang Wei in the past, so naturally Jiang Wei was extremely glad to see his ex team leader.</p><br/><p>\"Looks like I’ll have to call you master soon,\" A Jinai’s resounding laughter filled the hall. \"Elders Guild must really have faith in you to hand such a huge responsibility over to you!\"</p><br/><p>Jiang Wei smiled. \"Don’t tease me, A Jinai. I’m not living as comfortably as you. You’re living the life of an immortal.\"</p><br/><p>\"How so? I’m so busy I could die.\" A Jinai saw the doubt in Jiang Wei’s gaze and smacked his head. \"I forgot to mention that I’m no longer a civil servant but am moving about and around the Ling’s residence.\"</p><br/><p>Jiang Wei was slightly taken aback but congratulated him instantly. \"How amazing for you to be socially connected to them. No wonder you look so well-nourished.\"</p><br/><p>Influential families were further divided into different ranks. There were two top-notch metal elementalist families in Silver Mist Sea, being the Ling residence and Gong residence. Their statuses were similar to that of Shi family and Lian family of Palette Cloud Village. These four families were currently the most well-guarded residences in the whole of the Avalon of Five Elements. Earth, metal and wood elementalists were all declining in strength and struggling badly.</p><br/><p>It wasn’t easy to be accepted by the Ling residence. These influential families held up unimaginably high barriers against outsiders. But similarly, their capabilities were beyond imagination.</p><br/><p>Although A Jinai tried hard to restrain himself, he couldn’t help but feel a little pleased. \"I’m still far from your level. Plus, you’re still a single man. I wonder how many people have their eyes on you. Haha, you’re shy now, have a sweetheart?\"</p><br/><p>Jiang Wei gave a bitter laugh. \"I’m on the front line everyday so how is that possible?\"</p><br/><p>A Jinai clapped his palms together, laughing, \"That’s good!\"</p><br/><p>Jiang Wei said, displeased, \"Such gloating. Looks like we will have to talk with our fists.\"</p><br/><p>This was A Jinai’s catchphrase from years back. Jiang Wei’s voice imitation cause A Jinai to burst into hearty laughter.</p><br/><p>Laughter faded as A Jinai said with a chuckle, \"You’re a rare commodity now. The second daughter of Ling Third Master is about your age and there’s nothing to say about her looks other than that she’s as beautiful as a fairy. She really admires you after hearing about you. How about that? Such an opportunity comes only once in a blue moon!\"</p><br/><p>Jiang Wei said in all seriousness, \"Stop joking with me, A Jinai. What have I accomplished? I’m unworthy of her.\"</p><br/><p>Instead of getting angry, A Jinai smiled. \"In the past, definitely not. But your prospects are boundless now that you are likely to win success and recognition in future. It’s not at all strange that the Ling family thinks highly of you.\"</p><br/><p>Jiang Wei shook his head. \"I’ve no intention of talking about love matters now.\"</p><br/><p>\"This is not about love.\" A Jinai wiped the smile off his face and said solemnly, \"You must know that there will not be such a chance again if you miss it. You need to get recognition from the Elders Guild, but your current background is not good enough. You can only enter a noble position if you marry Ling Third Master’s second daughter and borrow her power.\"</p><br/><p>Jiang Wei remained silent.</p><br/><p>A Jinai couldn’t help but try to persuade him earnestly once more, \"You’ve been through many things so why are you still so naive? How can you be safe in this chaotic, tough world when you are all alone with no backing from anyone? You’re far from the center and are unaware of lots of insider news. You do know of God-subduing Peak right?\"</p><br/><p>Jiang Wei nodded. \"I’ve seen it.\"</p><br/><p>A Jinai added, \"What do you think of it?\"</p><br/><p>Jiang Wei replied with a low voice, \"Treasure of the nation!\"</p><br/><p>\"That’s right,\" A Jinai gave a nod. \"A few of those on the front line will provide a solid defense. The next few years will be for the avalon to recuperate and accumulate strength. Rebuilding the lesser Avalon of Five Elements and Thirteen Divisions are two of the agendas. The top priority is Master’s Glory.</p><br/><p>\"Five hundred high-aptitude youngsters with sufficient moral characters will be selected in the so called Master’s Glory to receive special training from Elders Guild and eventually become Masters.\"</p><br/><p>\"How is this possible! How can a Master be cultivated so easily?\" Jiang Wei shook his head.</p><br/><p>A Jinai questioned, \"The power of Elders Guild is unfathomable. It’s not something we can figure out. Take God-subduing Peak for example, have you ever imagined that something like this could actually be made?\"</p><br/><p>Jiang Wei was quiet.</p><br/><p>God-subduing Peak was indeed very impressive . As a seasoned soldier with rich experience, he knew very clearly that if this big fellow were to be on the frontline, it could be of tremendous use and help.</p><br/><p>\"I might as well share some insider news with you. You’re one of the five hundred seeds. But have you thought about it? What happens when these people appear? How many empty seats will there be after reconstruction of the Thirteen Divisions? It will be difficult to get a good position if you don’t have any backing. You might get eliminated even with good qualifications. I’m not trying to scare you,\" A Jinai watched Jiang Wei attentively before continuing, \"Perhaps other families will find you, but who offers better terms than the Ling residence? Who’s stronger than them? Ling residence is an influential family with a seat in Elders Guild.\"</p><br/><p>Jiang Wei asked all of a sudden, \"Is Ai Hui one of the seeds?\"</p><br/><p>With Jiang Wei looking straight at him, A Jinai hesitated a little before shaking his head. \"No.\"</p><br/><p>\"But why?\"</p><br/><p>\"I’m not in the position to ask for details,\" A Jinai shook his head before adding, meaningfully, \"I know you’re a sentimental person and you’re not going to like what I’m about to say, but I still have to remind you. Stay away from him if you wanna climb up.\"</p><br/><p>\"I understand.\" Jiang Wei looked calm, without any hint of joy or anger. \"A Jinai, this issue is too important. I’ll need some time to consider.\"</p><br/><p>A Jinai nodded and warned, \"You’re a smart man. I believe you’ll make the right decision. Do not reject an influential families’ symbol of peace. Not now, not ever. This world belongs to them.\"</p><br/><p>\"Thank you, A Jinai.\"</p><br/><p>Jiang Wei walked A Jinai to the door. Seeing A Jinai’s disappearing figure, Jiang Wei turned around and went back into his room.</p><br/><p>He felt that he’d understood certain things.</p><br/><p>He took out a carefully preserved pile of leaves and started writing.</p><br/><p>…..</p><br/><p>\"Dragonrise Training Hall?\"</p><br/><p>Ai Hui read the written challenge over and over again but could not wrap his head around it. \"Lou Lan, have we ever met them?\"</p><br/><p>Lou Lan answered in all certainty, \"No.\"</p><br/><p>\"So they’re just bored?\" Ai Hui tossed the written challenge aside, mumbling to himself, \"Challenging as he pleases? Is there such a thing? Lou Lan, go hang a sign: Five hundred essence elemental beans per challenge.\"</p><br/><p>Fu Yonghao, who was initially just listening in to their conservation couldn’t help but jump in, \"Five hundred essence elemental beans? Why not just rob somebody?\"</p><br/><p>Ai Hui looked at him as though he was looking at a fool. \"It is tiring to rob. How good is it to have people bringing money to our doorstep!\"</p><br/><p>Fu Yonghao became flustered. \"You…\"</p><br/><p>Ai Hui turned around and asked the Three Smalls, \"Is he done with his training?\"</p><br/><p>\"No,\" they shook their heads in harmony.</p><br/><p>Harboring ill intentions, Ai Hui instructed, \"I’ll double your trainings if he doesn’t finish his today.\"</p><br/><p>Fu Yonghao blew up. \"Despicable…\"</p><br/><p>Before he could finish his words, he was manhandled by three pale-faced kids. They were aware that Teacher meant every word he said and definitely wasn’t joking.</p><br/><p>Ai Hui shook his head, muttering, \"There’s a problem.\"</p><br/><p>He was in the limelight for recently defeating the Sha family so what kind of concussed brains would want to find trouble with him at this point in time?</p><br/><p>Unless there was a deep feud, ordinary conflicts would not push them to knock on his door now. Ai Hui simply could not believe that they were initiating a battle when there was no strong animosity between both parties. Something must be going on.</p><br/><p>But whether or not that was the case, friendly matches weren’t a problem as long as they came with the money.</p><br/><p>If they weren’t going to pay up but still came over to challenge, he would have to take the money from them himself!</p><br/><p>Ai Hui quickly forgot about this matter.</p><br/><p>The signboard on the hall’s entrance obviously became another hot topic of the city. It was the first time people heard that accepting challenges could actually be chargeable.</p><br/><p>Everybody was moved by Ai Hui’s money-making talent. He was a natural profiteer and was compulsively money-minded.</p><br/><p>Branch Master Miao had apparently been feeling extremely terrible the last two days and many teachers had been unlucky enough to step on his toes and receive a dressing-down.</p><br/><p>Everyone was very curious as to what would happen to Miao Hai.</p><br/><p>Was he going to pay up? Or not?</p><br/><p>They realized that whether or not he took the money out, it was going to be extremely embarrassing.</p><br/><p>Even gambling dens started to take bets. Will he pay up? Will he challenge successfully? Betters were all eager to find out.</p><br/><p>In regards to these rumors, Ai Hui only smiled and paid no heed to them. He was baffled by another matter.</p><br/>\n</div>"}