{"title": "Chapter 312: A Group of People", "id": 312, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-312-a-group-of-people", "volume_title": "Volume 4", "body": "<h1>Chapter 312: A Group of People</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312: A Group of People</p><br/><p>Translator: JL Editor: TYZ/CakeHermit</p><br/><p>\"I can’t believe it is actually him.\"</p><br/><p>Su Huaijun gave a soft sigh. While her emotions were in a mess, she felt a sense of relief as well. How could an unknown being defeat the Sha family? After knowing Wang Han’s true identity, she was more at ease. To her, information on Wang Han was the most important, regardless of what his background was.</p><br/><p>\"What should we do next? Should Qingye still go to the training hall?\" Father Su was feeling conflicted as well.</p><br/><p>No matter how controversial Ai Hui might be, his prestige and capability were proven. Before, the Three Smalls had been able to combine forces and block one of Sha Wuyuan’s moves. This was sufficient to prove that Ai Hui was good at teaching his students.</p><br/><p>He was not highly regarded in his family, otherwise he would not have been sent to Peace City many years back. He was extremely happy that Qingye was able to practice under a famous master. At the same time, he was also worried that this might clash with his family’s interest. He had been doing business for a long time and knew how complicated Ai Hui’s background was.</p><br/><p>Su Huaijun did not have the least bit of hesitation and said, \"Let’s go and see our master.\"</p><br/><p>Looking at father Su’s happy, yet worried expression, she knew he had some doubts. She quickly said, \"You need not worry about it. Even though there are many disputes over Ai Hui, you should not underestimate the people supporting him. Those that make him an enemy are extremely foolish.\"</p><br/><p>Su Qingye’s father was surprised. \"He has such capability?\"</p><br/><p>\"The place which bore the brunt of the blood disaster was the Induction Ground. None of the students managed to survive and the Avalon of Five Elements’ backup strength was heavily cut off. These people from Central Pine City went through such a hard battle and performed tremendously. How are they not valuable? Those lucky survivors from the battle, especially those in the A1-unit that was led by Ai Hui, have gained a lot in these three years. A few of them have ascended rapidly and Jiang Wei is one of them. The Thirteen Divisions which was severely impacted will definitely be rebuilt in the future. The many vacancies that will open up will probably be filled by those from the A1-unit.\"</p><br/><p>Su Huaijun seemed to have thought of something and sat in silence. Following which, she sighed \"Ai Hui’s prestige in the eyes of the survivors from Central Pine City is something we will never be able to understand.\"</p><br/><p>\"Old Xu, guess who is near Peace City?\"</p><br/><p>\"You have heard the news? Ge Laohei is here! I have already requested something from him.\"</p><br/><p>\"You are so efficient! I only received the news today. Thank goodness we finally have news of him.\"</p><br/><p>\"Yes, it has been three years. Time flies. If not for the fact that I am really busy, I would have gone to Peace City myself. Mingfeng has already left for Peace City. You can look for him too.\"</p><br/><p>\"Alright, I will go look for them.\"</p><br/><p>\"Peace City! He is in Peace City!\"</p><br/><p>\"I did not manage to thank him personally previously. I have always been thinking about it.\"</p><br/><p>The dazzle of the message tree periodically lit up within the crowd of people. Those who had partners in the same city gathered and formed an even larger group. They sat together drinking wine while reminiscing about the past. The blood and fire from three years ago contributed to their fear and despair. They talked about witnessing their own relatives and those students lying in a pool of blood. Soon, tears started rolling.</p><br/><p>The more they drank, the more drunk they got. They cried and laughed together.</p><br/><p>The memories that were buried deep inside their hearts surfaced. The longing for their family members had never ceased and was ignited by the alcohol.</p><br/><p>They sobbed silently.</p><br/><p>They had their arms around each other’s shoulders while singing at the top of their voices.</p><br/><p>They were like a herd of wild wolves that shouted towards the sky, \"Lightning Blade! Lightning Blade! Lightning Blade!\"</p><br/><p>None of them had forgotten the Central Pine City of three years ago, just like none of them will ever, ever forget the lonely silhouette of the youth who faced the blood fiends during the Battle of Long Street. They would never forget the person who fought in the battle in the Heaven Pit. Similarly, they were unable to forget the scene where that youth stabbed the enemy in the back while soaring in the sky. They could not forget the back view of that youth who kneeled in front of the tombstone under the torrential rain.</p><br/><p>It was a figure they would never, ever forget, and a feeling that only they could understand.</p><br/><p>That was enough for them.</p><br/><p>…..</p><br/><p>She Yu leaned on the railings and unknowingly caught a glimpse of a silhouette walking hurriedly. She gave a light gasp in surprise.</p><br/><p>Quan Minglong who was next to her looked over as well and said smilingly, \"Ah, Master Duanmu. After Young Master Duanmu lost to my lady, he set up a society called the Society of Excellence. Compared to the past, he is keeping a low-profile now.</p><br/><p>The relationship between Quan Minglong and She Yu became tense after he was mocked in public by She Yu. For an unknown reason, however, She Yu personally visited him and apologised. She also attempted to butter him up whenever possible at the various public areas. Pretty soon, his initial hard feelings towards her dissipated.</p><br/><p>Hearing the words \"Society of Excellence\", her body turned rigid and she gave a sigh. Duanmu Huanghun had yet to forget about the Induction Ground.</p><br/><p>She suddenly thought of Ai Hui. That chap should still remember too, right?</p><br/><p>The hatred between Ai Hui and the Blood of God was deeper than the ocean.</p><br/><p>However, who would care about the deep hatred of a flower slave?</p><br/><p>She pretended to be surprised and said, \"God Nation and Jadeite forest was just about to form a sincere collaboration. The Society of Excellence is ill-timed.\"</p><br/><p>Quan Minglong said harshly, \"Isn’t that the case! There are many higher-ups who are displeased with him. However, he usually acts like that. He is usually arrogant and despotic, he does not take the big picture into account. Let’s see how he salvages the situation in the future!\"</p><br/><p>She Yu covered her mouth and laughed daintily. \"I can smell the jealousy over here.\"</p><br/><p>Quan Minglong let out a huge guffaw and was not the least bit angry. Instead, he liked being teased by She Yu. All the other women who talked to him always spoke respectfully to him.</p><br/><p>He continued, \"I have no other choice. He is the Jadeite Young Master as well as a genius, so he can afford to neglect his responsibilities. People like me, however, still need to work hard.\"</p><br/><p>While saying the above, Quan Minglong’s face was proud. In fact, he had the ability to be proud. Prior to knowing She Yu, he’d lived life like a monk who was obsessed with training. In the Quan family famous for living it up, he was like a weirdo.</p><br/><p>After witnessing first-hand the battle between Duanmu Huanghun and She Yu, he realized the disparity between him and Duanmu Huanghun in strength was not too far apart. This spurred him further. Also, Duanmu Huanghun breaking hearts everywhere he went enforced his notion that Duanmu Huanghun was the perfect example of someone who was not serious.</p><br/><p>Every time he saw She Yu’s beautiful and alluring face, a ball of fire rose in his heart. He wanted to become stronger, he wanted to defeat Duanmu Huanghun, and he wanted to get the beauty in front of him.</p><br/><p>Facing Quan Minglong’s greedy and passionate gaze, She Yu lightly ruffled her fringe. Hearing Quan Minglong’s heavy breathing, she said carelessly, \"Life is so boring. Does Minglong know about anything interesting recently? Share so we can pass the time.\"</p><br/><p>Quan Minglong let out a smile. He was already prepared for this. \"There are actually two items, and they are both related to our Jadeite Young Master.\"</p><br/><p>Astounded, She Yu said, \"Minglong, say it quickly!\"</p><br/><p>She Yu’s look of anticipation allowed Quan Minglong to feel that his hard work had not gone to waste and he replied, \"The diplomatic mission from the Avalon of Five Elements is about to arrive and the one leading the team is Shi Xueman, who once fought alongside our Jadeite Young Master. She Yu, you are going to have a new opponent now. I heard that they have also brought with them a powerful weapon called God-subduing Peak.\"</p><br/><p>\"God-subduing Peak?\" She Yu was slightly surprised, but gave a cold laugh. \"Let’s see how they are going to subdue us.\"</p><br/><p>\"Many of them are displeased that the Elders are using such a method to showcase their power,\" Quan Minglong replied.</p><br/><p>She Yu blinked while saying, \"Shi Xueman is a one in a million beauty. Doesn’t Minglong want to take a look?\"</p><br/><p>Quan Minglong replied firmly, \"I only have She Yu in my eyes. Nothing can waver my heart!\"</p><br/><p>She Yu’s glance wandered and she asked, \"What about the second item?\"</p><br/><p>A flicker of disappointment flashed across Quan Minglong’s eyes. He had expressed his admiration toward She Yu many times, but has never received a response. He knew that he should not rush into this and regained his composure. \"Our Jadeite Young Master had another comrade who has also recently come into the picture. It is the person who killed his own teacher and who is currently very famous. Birds of a feather indeed flock together. Looking at the Jadeite Young Master’s choice of friends, we can see his character…\"</p><br/><p>\"Are you referring to Ai Hui?\"</p><br/><p>Quan Minglong was somewhat surprised that his words were stopped so abruptly. Then he realized that She Yu’s expression was rather strange. He continued, \"So She Yu has heard about this incident before. It is indeed Ai Hui. Many of the people from the Avalon of Five Elements do not want to meet him. Apparently, many of the Elders were extremely disdainful of him. The Sha Family is also in decline. They actually lost to a scum like Ai Hui. Ai Hui had been living undercover for three years. If not for the Sha Family, everyone would have forgotten about him.\"</p><br/><p>He suddenly thought of something. She Yu had been at the battle in Central Pine City. \"Could it be that She Yu has met him before?\"</p><br/><p>She Yu’s expression was flickering. She was not listening to what Quan Minglong was saying.</p><br/><p>The first thing she thought of was the [Life and Death Flower Sacrificial Art]. Subsequently she thought of how she had almost achieved success, but ultimately failed. Previously, she was anxious that she could not manage to find any trace of Ai Hui despite using all her resources. Now that Ai Hui was gaining everyone’s attention, however, she became even more worried and anxious.</p><br/><p>Damn it!</p><br/><p>Is that chap crazy? Doesn’t he know that his reputation was poor?</p><br/><p>She thought of how her investment might go to waste and became frantic because their lives were tied. If Ai Hui was to meet with any mishaps, her life would also be lost.</p><br/><p>She had never been passive; instead she had been looking for Ai Hui on the sly, not daring to be the least bit flamboyant.</p><br/><p>Even when she’d been unable to find him, she hadn’t been worried.</p><br/><p>As long as the Flower of Life did not ignite, even though she might meet with some injuries, it would not be life-threatening. The Flower of Life would only ignite when the Flower of Destruction ripened. Currently, almost nothing could prevent the ripening of the Flower of Destruction.</p><br/><p>Despite this, the Flower of Life had been about to ignite, but was not yet ripened.</p><br/><p>It was the problem she worried about the most.</p><br/><p>Even for a person who was usually calm and composed, when she thought about the fact that she might lose her life at any moment due to that damn chap, her thoughts went into a whirl and she felt the chills.</p><br/><p>What should she do?</p><br/><p>Ask for help? Nobody would be able to help her. If any blood elementalist was to learn that her [Life and Death Flower Sacrificial Art] was successful, she would become a lamb waiting to be slaughtered.</p><br/><p>No! She will not let any mishap befall Ai Hui!</p><br/><p>Ruthlessness flashed past her eyes. She calmed down and her mind rotated at high speeds.</p><br/>\n</div>"}