{"title": "Chapter 333: A Test", "id": 333, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-333-a-test", "volume_title": "Volume 4", "body": "<h1>Chapter 333: A Test</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 333: A Test</p><br/><p>Translator: YH Editor: TYZ/CakeHermit</p><br/><p>Droves of elementalists were all over the place. The sky was filled with bamboo carts that looked like swarms of bees.</p><br/><p>Everyone had completely dismissed the bleak future, looking short-sightedly at the exciting missions they were about to complete. Everybody talked and dreamt of a better life.</p><br/><p>Ai Hui watched coldly from the sidelines.</p><br/><p>The Avalon of Five Elements had built their advantage over the Wilderness for hundreds of years. People were still afraid of the deepest parts of the Wilderness, but as long as one didn’t venture too far in, the Wilderness was really just an expansive hunting ground.</p><br/><p>Where else would all the dire beast materials come from? How else could so many hunting groups continue to thrive?</p><br/><p>The fear of the deepest areas in the Wilderness was all in their minds. They were only afraid because no one else had set foot there before. If the elementalists truly wanted to delve deeper, dire beasts wouldn’t be able to do anything to stop them. What’s more, the Thirteen Divisions had joined the hunting groups in the Wilderness. Combined, their strength would be more than sufficient to take down any dire beasts they encountered. It looked as though the Avalon of Five Elements was primed to take over the Wilderness.</p><br/><p>This was the most popular view of the masses.</p><br/><p>Ai Hui, who had spent three years in the Wilderness, knew how outrageous this idea was.</p><br/><p>The elites of the Thirteen Divisions were definitely much more powerful than the elementalists in the hunting groups, but this wasn’t necessarily a good thing.</p><br/><p>Why did the hunting groups recruit so many untrained laborers from the Old Territory? Even with the appalling death rate of the laborers, why weren’t they stopping?</p><br/><p>The dire beasts’ sensitivity to elementalists was far beyond the elementalists’ sensitivity to dire beasts. In other words, dire beasts were born with much keener sensing abilities. The more powerful the elementalist, the more outstanding they would appear in the Wilderness.</p><br/><p>Only those with strength as impressive as the Grandmasters and Masters could make the dire beasts flee without even putting up a fight. All other elementalists below the rank of Master would attract stronger and larger amounts of dire beasts the stronger the elementalists were.</p><br/><p>Having had so many encounters with dire beasts, Ai Hui knew that they weren’t as stupid as people believed. In fact, the dire beasts were extremely cunning and sharp, banding together to fight against larger groups of elementalists.</p><br/><p>This was the main reason why Ai Hui didn’t rush to send everyone in.</p><br/><p>The first wave of elementalists would definitely suffer the heaviest casualties.</p><br/><p>Sensational news was constantly being spread through the grapevines. All these fake news stories were probably being spread intentionally. All these passionate people rushing in probably didn’t know that they were just being used as cannon fodder.</p><br/><p>Ai Hui guessed that the Elders Guild was probably in on this, but chose to let it slide.</p><br/><p>To the Elders Guild, using such an approach to reduce the number of elite elementalists lost was a great idea.</p><br/><p>Ai Hui shook his head as he didn’t have the power to dissuade these people. They were completely blinded by wealth and merits.</p><br/><p>He hurried along at a moderate pace, leaving the main road at times to explore and trudge along the mountain paths. He took his time to advance, slotting in time to train along the way. He had ample time and did not need to hurry.</p><br/><p>Well into the night, Ai Hui stood on top of a cliff and faced a sea of clouds. He held onto his sword while he stood motionless. Starlight bathed his entire body, making him shimmer.</p><br/><p>If one looked closely enough, he or she would realize that Ai Hui was utterly motionless. In actual fact, his body was quivering almost imperceptibly with every breath he took.</p><br/><p>The Skyheart Flaming Lotus Lamp in Ai Hui’s sky palace was rotating slowly. The scriptures surrounding the lamp’s flame flowed around like light. Ai Hui’s bodily rhythm, his breathing rhythm, as well as the flame’s rhythm, were all synchronized.</p><br/><p>Soft light shined through the circular scripture, magnifying the words. The magnified words cycled throughout his body unobstructed. These words from the scripture had a strange pull on the starlight, making it congeal and create a layer of light on Ai Hui’s body.</p><br/><p>The Skyheart Flaming Lotus Lamp in his sky palace had gained an additional two petals, bringing the number from four to six. Looks like Lou Lan’s Eight Treasures Porridge was indeed effective.</p><br/><p>Attaining all nine petals would allow one to achieve the [Skyheart Pure Body], which protects it’s user from all evils and grants the ability to break all illusions.</p><br/><p>Ai Hui could feel the changes in his body. The soft, bright light and the circulating scripture text were constantly coursing through his flesh. He would occasionally see tiny puffs of black smoke rising and disappearing in the blink of an eye.</p><br/><p>His mind and body had a translucent quality to them and felt extremely pure.</p><br/><p>Ai Hui was inexplicably surprised. This phenomena was mentioned in the Skyheart Flaming Lotus Lamp’s scripture and was called [Glazed Body]. While [Glazed Body] couldn’t match up to the [Skyheart Pure Body], it already granted him some interesting benefits.</p><br/><p>He intuitively begun a Circulatory Cycle Revolution and felt the elemental energy sword pills within his body become even more refined. They had lost all traces of their sharp edge and now flowed smoothly throughout the revolution. A faint attractive force was now present between the elemental energy sword pills, turning them into somewhat of a necklace made of magnetic pearls.</p><br/><p>In addition, Ai Hui’s body seemed to contain a whirlpool within it that generated a suction force on the elemental energy in the environment. This was indicative of his now increased rates of improvement and recovery.</p><br/><p>As the black mist dispersed, Ai Hui’s flesh and blood felt much purer. Although it didn’t increase his strength, his muscles and tendons were evidently more resilient than before. His physical strength also appeared to recover at a much greater rate than before.</p><br/><p>His [Copper Skin ]had transformed as well. It was now the colour of jade and had a shiny new lustre.</p><br/><p>Ai Hui felt extremely refreshed; it felt as though he was back in the sword embryo’s state. His sixth sense felt unnaturally keen, allowing him to capture even the slightest changes in his surroundings.</p><br/><p>The metal winds atop the cliff were very strong. While they contained only weak traces of metal elemental energy, the winds were unyielding and ceaseless.</p><br/><p>Metal elemental energy from the surroundings was accumulating around Ai Hui’s body. His body was soon surrounded by countless silver needles, giving one the impression of a large school of whitebaits swimming relentlessly around him. As the silver glow grew brighter, the starlight became dimmer.</p><br/><p>Unknowingly, Ai Hui’s mind wandered off with the wind.</p><br/><p>Floating and sinking, rising and falling, gathering and scattering; Ai Hui no longer knew where he was.</p><br/><p>He was abruptly awoken by an intense beam of light that shone right into his eyes.</p><br/><p>Ai Hui saw the rising sun leap out from beneath the sea of clouds. The orange sunlight illuminated his face from the horizon as he smiled at the majestic sight before him.</p><br/><p>He sheathed his sword and stood up. The entire night’s worth of practice did not leave him the least bit sore. Instead, he felt unspeakably refreshed and at peace.</p><br/><p>It had been a while since he achieved elemental externalization, but last night’s experience was completely different from anything he had experienced before. He was thoroughly intrigued by it.</p><br/><p>Achieving elemental internalization required constant practice over long periods of time. Elemental externalization required a profound understanding of the heavens and the earth; the blind accumulation of elemental energy was no longer of any use.</p><br/><p>Many elementalists were unable to become accustomed to this external connection with the environment.</p><br/><p>Relaxing his control on the surrounding metal elemental energy, Ai Hui watched it slowly disperse into the wind. He jumped off the cliff and spread his Starry Gem Swordwings, soaring through the air before plunging into the sea of clouds.</p><br/><p>After flying for hundreds of kilometers, he finally landed at noon.</p><br/><p>He was lucky to catch a bharal for lunch. He lit a bonfire and started to roast it according to Lou Lan’s teachings. Under chef Lou Lan’s tutelage, Ai Hui’s cooking skill had become pretty good.</p><br/><p>The aroma of the various spices mixed with the bharal’s grease was simply irresistible.</p><br/><p>Travellers passed by every once in awhile. They all appeared to be heading towards the Wilderness.</p><br/><p>\"Are you the Silverwheel Swordsman, Mr. Chu Zhaoyang?\" asked a middle-aged man who happened to be passing by. He looked like a housekeeper.</p><br/><p>Ai Hui felt a bit helpless. He had met several groups of people who greeted him along the way. The whole incident with the Great Wei Caravan had made him famous and widely recognized.</p><br/><p>Ai Hui stared at the roast, carefully rotating the grill without lifting his head. He replied, \"I am indeed Chu Zhaoyang, do you need something?\"</p><br/><p>\"My master would like to ask whether Mr. Chu is heading into the Wilderness. If Mr. Chu is going in, my master is willing to pay…\"</p><br/><p>Ai Hui interrupted the housekeeper. \"I’m not going into the Wilderness.\"</p><br/><p>This again…</p><br/><p>Along the way, he had met a couple of guys who wanted to hire him.</p><br/><p>After a satisfying lunch, Ai Hui decided not to waste anymore time on the ground and flew directly to Silver City, his destination.</p><br/><p>Hua Kui’s meeting locations were always different. Ai Hui was surprised that they were going to meet at Silver City this time around.</p><br/><p>Due to their past discussions about having him join the headquarters, Ai Hui couldn’t help but wonder if the Assembly of Patriarchs had their headquarters here in Silver City.</p><br/><p>Ai Hui had been to Silver City twice. Both times, however, he had had matters to attend to and so entered and left the city hastily.</p><br/><p>Heading towards the exact address given to him by Hua Kui, Ai Hui managed to find him swiftly. Once again, they were meeting in a courtyard filled with vast varieties of plants and flowers.</p><br/><p>Hua Kui was very pleased to see Ai Hui. Among his acquaintances, Chu Zhaoyang was the most eye-catching individual. Hua Kui saw him as someone truly worthy of further grooming. From the information he received from the organization, Chu Zhaoyang seemed like someone who had a deep feud with the Blood of God.</p><br/><p>Hua Kui curiously asked, \"Why do you suddenly want to join the headquarters when you weren’t willing to do so previously?\"</p><br/><p>Ai Hui knew that while Hua Kui appeared to be asking this casually, his response would determine whether or not he could join the headquarters. He was, however, well prepared to answer something like that. \"The incident with the Great Wei Caravan helped me to realize something - it is difficult to survive without a strong backer.\"</p><br/><p>Hua Kui burst out in laughter. \"I believe you were just terribly unlucky that time, but what you say is true. If you had joined the headquarters then, the issue with the Great Wei Caravan would have been settled with a single order. Joining the headquarters isn’t going to be simple, I’m afraid. You’ll have to pass a test first.\"</p><br/><p>\"What kind of test?\"</p><br/><p>Ai Hui had already guessed that there would be a test.</p><br/><p>\"You have to find a way to join the Karakorum Sword League.\" Hua Kui continued, \"It’s just nice that you haven’t used your opportunity to practice the Karakorum Sword League’s sword formations.\"</p><br/><p>Cold fear gripped Ai Hui’s heart. How did he know about this? Clearly they had someone within the Karakorum Sword League. Ai Hui nonchalantly asked, \"Isn’t it easy to join the Karakorum Sword League?\"</p><br/><p>Hua Kui explained, \"It’s only easy to become an ordinary external disciple. You need to find a way to get into the main institution. Once you’re a part of them, you pass the test. If you fail, you’ll have to wait until next year.\"</p><br/><p>Ai Hui promptly nodded. \"I understand.\"</p><br/>\n</div>"}