{"title": "Chapter 343: Grass Hall", "id": 343, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-343-grass-hall", "volume_title": "Volume 4", "body": "<h1>Chapter 343: Grass Hall</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 343: Grass Hall</p><br/><p>Translator: TYZ Editor: TYZ/KLKL</p><br/><p>Immediately, the Assembly of Patriarchs seemed more powerful and mysterious in Ai Hui’s eyes. This was not something that an ordinary organization could achieve.</p><br/><p>Furthermore, the Assembly of Patriarchs’ ability to develop a completely new energy system, fusion elemental energy, had displayed its amazing strength and accumulated wisdom over the years.</p><br/><p>Wealth could be earned in one night, but things like fusion elemental energy and patriarch grass needed a long period of time and the effort of numerous geniuses’ to be developed. The amount of manpower and resources expended to develop these two things was astronomical.</p><br/><p>What Ai Hui saw from the Assembly of Patriarchs was only the tip of the iceberg, and he was already shocked.</p><br/><p>He guessed that the technology of patriarch grass might have been developed from message trees, but it definitely needed more improvements. Ai Hui had already regained his composure, \"Hi, how may I address you?\"</p><br/><p>Because of Lou Lan, Ai Hui clearly knew how to communicate with a sand puppet. The method of communicating with a sand puppet was actually very simple. One could just speak his or her mind and ask any questions. There was no need for one to adorn his or her language nor be tactful with his or her words. It was better for one to be as direct as possible when it came to communicating with a sand puppet.</p><br/><p>\"You can call me Manager.\"</p><br/><p>\"Okay, Manager,\" Ai Hui addressed the sand puppet accordingly, \"Can you introduce this place to me? This is my first time here.\"</p><br/><p>\"Alright, Swordsman,\" Manager nodded and waved his right hand. The great, serene hall and the countless hall pillars behind him disappeared and materialized into a black mist. Following which, the black mist transformed in a wall. Pieces of wooden slabs were hanging on the wall. Small, densely-packed words were written on the wooden slabs, giving off an extraordinary glow.</p><br/><p>Manager began to introduce the place, \"This place is known as the Grass Hall. From today onwards, missions will be issued from this place. Upon joining the headquarters, you will be supervised by the headquarters even if you’re not online. The difficulty of the missions will directly correspond to your base level. Right now, due to special circumstances, you already have one mission and that is to protect Karakorum Sword League The reward for completing the mission can be obtained from here as well.\"</p><br/><p>Upon hearing these words, Ai Hui was extremely shocked, \"This place is real?\"</p><br/><p>\"If you think that this place is real, then it is real,\" Manager’s words were rather abstruse. He then continued, \"We will give you a key. This key is a specially processed earth elemental hoop. You can activate it from any place, at anytime to obtain your rewards.\"</p><br/><p>\"A sand compass?\" Ai Hui asked.</p><br/><p>Manager nodded his head and replied, \"It is a device that’s much more complicated than a sand compass. To be exact, it is also known as sea urchin sand compass. It is a brand new type of enchanted sand compass. Every sea urchin spine corresponds to an earth elemental space. Currently, the Assembly of Patriarchs and Elders Guild are the only ones that possess this device.\"</p><br/><p>\"The Elders Guild has it too?\" Ai Hui widened his eyes. He felt a lot of his perspectives regarding the Assembly of Patriarchs had been completely overturned after joining the headquarters. He used to think that Elders Guild was decaying and decadent. He did not expect them to possess such a powerful device.</p><br/><p>\"Yes,\" Manager did not explain much about the Elders Guild and continued, \"In the future, you can sell your spoils of war and purchase weapons and inheritances in Grass Hall as well.\"</p><br/><p>Manager waved his hand and the wall behind transformed into black mist.Dazzling artifacts appeared and hovered within the black mist, looking extremely magnificent. Ai Hi almost drooled upon this magnificent sight.</p><br/><p>\"There are absolute arts too,\" Manager waved his hand again and countless light orbs hovered behind him. Each light orb had a faint shadow flickering within it. Manager continued, \"In Grass Hall an absolute art will be twenty-five percent cheaper than a similar one sold by the Elders Guild, and it’s one level higher in terms of quality in Grass Hall. We accept Heaven Merit Points as payment as well. Our prices are much more fair than the market prices too.</p><br/><p>Ai Hui was flabbergasted. To his surprise, this place sold Elders Guild’s absolute arts at a cheaper price and accepted Heaven Merit Points as payment. He was speechless.</p><br/><p>\"Of course, you can also buy training techniques for fusion elemental energy here. In addition, you are allowed to purchase our Heaven-grade weapons too. We also have the Hall of Ancient Records, where the seniors’ knowledge, reading notes and travel notes are contained. Most of the ancient records are free to read, only a small amount of them charge a fee.\"</p><br/><p>Upon hearing the words \"Hall of Ancient Records\", Ai Hui quickly asked, \"Can I take a look?\"</p><br/><p>\"Of course,\" Manager waved his hand and the black mist behind him transformed into a tall, unadorned bamboo tower. Four bold and forceful words were written on it, \"Hall of Ancient Records\".</p><br/><p>Ai Hui heaved a sigh of relief upon seeing that the tower had multiple levels. His gaze fell upon the seventh level.</p><br/><p>\"Can I enter?\" Ai Hui pointed to the Hall of Ancient Records.</p><br/><p>\"No problem,\" Manager nodded his head, \"However, I have to remind you that your current amount of fusion elemental energy only allows you to stay in Grass Hall for up to one hour. If you want to stay longer, please continue to work hard to develop your fusion elemental energy.\"</p><br/><p>\"Thank you for your reminder,\" Ai Hui bade Manager farewell and entered the Hall of Ancient Records.</p><br/><p>As Ai Hui reached the entrance of the bamboo tower, he suddenly stopped in his tracks. His gaze fell upon the words \"Hall of Ancient Records\", which were inscribed on a wooden signboard.</p><br/><p>The handwriting of these words… seemed somewhat familiar...</p><br/><p>Wait, didn’t he feel the handwriting of some other word was also familiar previously? He quickly remembered that it was the word \"Karakorum\" written on the wooden signboard hung above the entrance of Karakorum Sword League.</p><br/><p>He carefully compared the handwriting between the four words \"Hall of Ancient Records\" and the word \"Karakorum\". Indeed, their handwritings looked remarkably similar.</p><br/><p>The simple and forceful brushstrokes contained an unrestrained sword glint, conveying a sharp and intense killing intent.</p><br/><p>\"Hall of Ancient Records\" and \"Karakorum\" should have be written by the same person. However, why would he feel a sense of familiarity from these words? He must have seen this handwriting somewhere in the past. Ai Hui was very confident about his intuition. After racking his brain, he finally knew why he found the handwriting of these words familiar.</p><br/><p>Vanguard Training Hall.</p><br/><p>There was a signboard hung at the entrance of Central Pine City’s Vanguard Training Hall as well. When he first moved to the training hall, the signboard was covered in dust and cobwebs. He had to clean it before hanging it on the wall of the lobby. The handwriting of the words \"Vanguard Training Hall\", \"Hall of Ancient Records\" and \"Karakorum\" looked remarkably similar to him, and as such, he felt that he had seen the handwriting somewhere in the past.</p><br/><p>Could the inscriptions on these three signboards be written by the same person?</p><br/><p>If that was the case, things were getting more interesting.</p><br/><p>The owner of Vanguard Training Hall was called Heng Bingfeng and he had disappeared for many years. Given the fact that the ancient message tree at the training hall was able to connect with the old man, there was a high possibility that Heng Bingfeng might be from the Assembly of Patriarchs.</p><br/><p>If the inscription on the wooden signboard of Karakorum was written by Heng Bingfeng, it only showed two things.</p><br/><p>First, Heng Bingfeng was still alive.</p><br/><p>Second, Heng Bingfeng was still in the Assembly of Patriarchs, or his relationship with the Assembly had yet to break. There was a very deep relationship between Karakorum and the Assembly of Patriarchs. This was also why Hua Kui wanted Ai Hui to protect Karakorum.</p><br/><p>Ai Hui had decided to ask the old fellow about Heng Bingfeng after he returned to the Swordsman Training Hall.</p><br/><p>Several bizarre thoughts emerged in Ai Hui’s mind.</p><br/><p>After leaving Central Pine City many years ago, Heng Bingfeng had vanished without a trace and never returned. He left such an important message tree in the training hall and he did not even come back to retrieve it. This somewhat puzzled Ai Hui.</p><br/><p>Ai Hui also thought of Master Shao. In his mind, Master Shao had always been a very mysterious individual. The more he knew about Master Shao, the more powerful he felt Master Shao was. Every sand puppet Ai Hui had encountered, including Grass Hall’s Manager, was not as powerful as Lou Lan. Then, there was also the sand core, Midnight, of which Lou Lan could not fully utilize its powers.</p><br/><p>Was it a coincidence that Master Shao lived beside Vanguard Training Hall? What was the relationship between Master Shao and Heng Bingfeng?</p><br/><p>Ai Hui could not help but shake his head. It seemed that the more he knew, the more doubts he had.</p><br/><p>\"I’m very sorry, your fusion elemental energy has run out, you will have to leave the Grass Hall. Goodbye, Swordsman.\"</p><br/><p>Manager’s voice rang across Ai Hui’s ears and he returned to his senses. Before Ai Hui could react, his vision blurred and his surroundings disappeared.</p><br/><p>The glow of the patriarch grass vanished and he was back in his room.</p><br/><p>It appeared that fusion elemental energy was the key to establishing a foothold in the Assembly of Patriarchs.</p><br/><p>The information he obtained today was somewhat too much. The unfathomable depths of the Assembly of Patriarchs and the conjecture regarding Heng Bingfeng had overwhelmed Ai Hui greatly.</p><br/><p>After around ten minutes, he finally calmed down. For someone who had powerful self-control like Ai Hui, this kind of situation seldom happened to him.</p><br/><p>He threw all these distracting thoughts to the back of his mind. Actually, both Karakorum and the Assembly of Patriarchs had nothing much to do with him. The Assembly of Patriarchs was only a channel for him to gather information. With the addition of Grass Hall now, this process became much more efficient.</p><br/><p>Right now, the most important thing for him to do was to find that notebook as soon as possible.</p><br/><p>He guessed that the old fellow would be more interested in the topic of Heng Bingfeng.</p><br/><p>After Ai Hui regained his composure, he flipped open the prototype inheritance that Karakorum Savant had passed him. Very soon, he became engrossed in it.</p><br/><p>Karakorum Savant had great achievements in the field of swordsmanship. Unlike Ai Hui, who learnt swordsmanship by putting together various pieces of knowledge from everywhere, Karakorum Savant seemed to have learnt swordsmanship systematically. Ai Hui could see some of his own techniques in the inheritance. For example, [Oblique Slash] and [Heavenly Thrust]. There was also a move that was somewhat similar to his [Crescent Moon] but much weaker in power. </p><br/><p>The inheritance also contained a lot of Karakorum Savant’s insights into swordsmanship. For example, it specifically talked about the transformation of Yin and Yang, enlightening Ai Hui on this topic.</p><br/><p>Ai Hui was completely engrossed in it. This was the first time he saw such a systematic and detailed swordplay manual.</p><br/><p>Even though there were several areas that needed further improvements, the contents of the swordplay manual were enough for it to be considered a prototype. In an era where swordsmanship was irrelevant, this inheritance was extremely valuable.</p><br/><p>Like a drug addict, Ai Hui was completely obsessed with the swordplay manual.</p><br/><p>There were some ideas mentioned in the manual that Ai Hui had already verified, but there were also some that he had never thought of. These novel ideas threw him into a deep thinking process. Whenever he understood something or came across a marvellous insight, he could not help but exclaim in admiration. Those areas that he could not understand distressed him, causing him to furrow his eyebrows and mumble to himself. In order to focus on comprehending the inheritance, he shut his door and declined to meet any visitor.</p><br/><p>All the teachers in Karakorum Sword League knew Chu Zhaoyang was reading a prototype inheritance. Everyone was filled with the expectation that Chu Zhaoyang could add on more insights and knowledge to this incomplete inheritance.</p><br/><p>Numerous pairs of eyes were staring at the tightly shut door.</p><br/><p>…..</p><br/><p>Silver Mist Sea, Pagoda of Hidden Edge.</p><br/><p>A domineering old voice emitted from the light orb, \"What do you think about this proposal?\"</p><br/><p>Tong Gui bowed and answered, \"It’s an opportunity for us. We can secretly send some people over.\"</p><br/><p>\"Then we will send unknown individuals.\"</p><br/><p>\"Yes. But I’m afraid that we can’t stop them and will blow up the issue.\"</p><br/><p>\"If they can’t be stopped, then they can’t be stopped. It’s their business and it got nothing to do with all of you. Your mission is to make sure Silver City is safe.\"</p><br/><p>\"What about the Great Elder…\"</p><br/><p>\"Don’t worry, the Great Elder is still the Avalon of Five Elements’ Great Elder.\"</p><br/><p>\"Subordinate understands.\"</p><br/>\n</div>"}