{"title": "Chapter 350: What Tier?", "id": 350, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-350-what-tier", "volume_title": "Volume 4", "body": "<h1>Chapter 350: What Tier?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 350: What Tier?</p><br/><p>Translator: TYZ Editor: TYZ/KLKL</p><br/><p>Su Huaijun held a jade bamboo stick in her hand. The verdant bamboo stick seemed to be made of jasper. The few pieces of verdant and glistening leaves on it swayed lightly, looking as if they had just fallen off a bamboo tree.</p><br/><p>Sanmu Su Family.</p><br/><p>Ai Hui did not know much about the Sanmu Su Family. All he knew was that this family was a well-known family in Jadeite Forest in the past. Eventually, they left Jadeite Forest and stayed in the Avalon of Five Elements.</p><br/><p>From the restraining fear Sha Wuyuan had for Su Huaijun previously, he could tell that Sanmu Su Family was rather powerful.</p><br/><p>There were too many aristocratic families in the Avalon of Five Elements. Unless he personally knew members from a particular aristocratic family, like how he knew Duanmu Huanghun and Shi Xueman, he would definitely not know the social status of that family.</p><br/><p>After spending three years with Su Qingye, Ai Hui knew his character very well. To Ai Hui, a person’s character mattered the most. As for a person’s family background, he did not really care.</p><br/><p>Ai Hui had heard from Su Qingye that his aunt was very powerful.</p><br/><p>He certainly did not expect he would face her one day.</p><br/><p>Standing opposite him, Su Huaijun had a solemn look on her face. After watching Chu Zhaoyang’s previous performance, she did not dare to underestimate him.</p><br/><p>\"Mr Chu, your guidance will be appreciated,\" Su Huaijun said with a deep voice.</p><br/><p>Ai Hui brandished the Snow Cherry in his hand as his brain went to work. Su Huaijun and Fu family’s oldest daughter had seen the real Ai Hui in action before. To prevent them from finding out his true identity, he could not use the same sword moves that he’d used in the past.</p><br/><p>He was somewhat glad that he had just read Chief’s sword encyclopedia and learnt a lot from it.</p><br/><p>Ai Hui was slightly excited. He had not officially sorted out the insights he gained and most of them were still scattered and fragmentary. With such an excellent sparring partner now, it was an extremely rare chance for him to do it now!</p><br/><p>Which move should he use?</p><br/><p>\"Give me a moment,\" Ai Hui said subconsciously.</p><br/><p>Su Huaijun was stunned. This was the first time she’d encountered such a situation. Did her opponent just ask her to wait in the middle of a competition?</p><br/><p>All the onlookers went in an uproar.</p><br/><p>\"Ha, he dares to ask for a moment?\"</p><br/><p>\"Don’t tell me he wants to use the toilet! Hahahaha, that’s a lousy excuse!\"</p><br/><p>\"If you’re afraid, just admit defeat! Stop wasting everybody’s time!\"</p><br/><p>\"Maybe he has some crafty plots!\"</p><br/><p>...</p><br/><p>In the arena, Su Huaijun felt slightly embarrassed. Wasn’t it embarrassing to challenge someone like this? Since young, she had been through a lot of competitions and she had never been so embarrassed like this before.</p><br/><p>Ai Hui, who had been in deep thought, suddenly had his eyes light up. He had thought of a good move to use. Then, he raised his head and told Su Huaijun, \"I’m ready.\"</p><br/><p>Ready...</p><br/><p>Su Huaijun nodded her head with a blank look on her face, \"Mr Chu, your guidance will be appreciated.\"</p><br/><p>\"Here I come,\" Ai Hui boasted shamelessly. However, he did not move forward and stood at his original spot. Following which, he flicked the Snow Cherry in his hand.</p><br/><p>The air around the pinkish tip of Snow Cherry suddenly became distorted. The sword tip looked as if it was emitting energy ripples. Suddenly, six palm-sized crescent moons shot out from the energy ripples.</p><br/><p>[Six Moons]!</p><br/><p>Ai Hui’s newly developed move.</p><br/><p>Su Huaijun’s eyes shrunk as all her distracting thoughts disappeared.</p><br/><p>The commotion from the onlookers had completely disappeared as well. Everyone widened their eyes and looked at the six dancing sword gleams. Even though the sword gleams were only palm-sized, their razor-sharp aura was able to engulf the entire arena. They were fast and nimble, resembling six flying bats. They flew so fast through the air that one could only see their afterimages.</p><br/><p>What kind of swordsmanship was this?</p><br/><p>Before the onlookers could resolve their doubts, Su Huaijun had already sensed the danger that was approaching and she began to move.</p><br/><p>A glint flashed across Su Huaijun’s eyes and she pointed her jade bamboo stick towards Ai Hui.</p><br/><p>A burst of green light erupted from the jade bamboo stick and exploded in the air. The burst of green light transformed into a green-colored glowing net that suddenly appeared on top of Ai Hui.</p><br/><p>The faint green glow from the net was in perpetual motion, dancing and flowing. The area it covered was extremely huge.</p><br/><p>All the onlookers bolted upright. They did not expect Su Huaijun to start off with an ultimate move. [Inescapable Net] was one of Sanmu Su Family’s ultimate moves. The threads that made up the green net were as thin and fine as hairs, making the net look as if it would break any moment. In reality, they were impenetrable by swords or spears. No matter how hard one tried to escape from it, he would still be a trapped fly.</p><br/><p>Chu Zhaoyang raised his head and looked at the glowing net that was floating down slowly. He looked as if he was dumbfounded at the sight of the glowing net, remaining motionless.</p><br/><p>The slow-moving speed of the green glowing net was just an illusion.</p><br/><p>Those who had sharp eyes had already noticed that a few strands of green glow from the net were already embedded in the ground.</p><br/><p>Chu Zhaoyang was finished.</p><br/><p>This thought flashed across everyone’s minds. Once [Inescapable Net] embedded its roots in the ground, no one could break from it.</p><br/><p>The glowing net started to expand and become thicker. In the blink of an eye, the glowing net looked as if it was made up of thick and solid vines. Surprisingly, pieces of verdant bamboo leaves began to grow on the glowing net.</p><br/><p>Chu Zhaoyang stared blankly at the sky above his head.</p><br/><p>Disdain and disappointment appeared on the faces of the onlookers one by one. This competition had already ended. Chu Zhaoyang had admitted defeat.</p><br/><p>Every bamboo leaf was like a single razor blade. When the bamboo leaves started to fall, a great danger descended upon Chu Zhaoyang. If this was a real fight, the trapped Chu Zhaoyang would be sliced to smithereens.</p><br/><p>The countless bamboo leaves gave rise to countless killing intents.</p><br/><p>A disappointed look appeared on Su Huaijun’s face as well. Previously, after she saw how Chu Zhaoyang defeated Gui Hu, she still thought that he was rather powerful. That was why she decided to challenge him. However, she did not expect him to stay motionless and fail to put up any resistance. A competition like this was far too boring.</p><br/><p>Suddenly, Chu Zhaoyang’s murmurs rang across her ears. She was stunned.</p><br/><p>\"Which tier should I start from?\"</p><br/><p>\"Forget it, I will start from the first tier. Save time and brainpower.\"</p><br/><p>Tier? What tier? Su Huaijun’s mind was filled with doubt. She widened her eyes and looked at the trapped Chi Zhaoyang. Could it be that… he had some countermoves?</p><br/><p>Such a pity, it’s too late for any countermoves!</p><br/><p>She felt pity for Chu Zhaoyang in silence. Once the [Inescapable Net] embedded its roots in the ground, anyone who was trapped inside the net had practically zero chance of breaking out of it.</p><br/><p>Chu Zhaoyang continued to mumble to himself. He did not look at Su Huaijun and brandished his sword by himself.</p><br/><p>\"Thirty-six plum blossoms are easier to count but I don’t have thirty-six now. I only have six now, maybe I can make a simplified version.\"</p><br/><p>The six sword gleams swirling around Chu Zhaoyang suddenly began to spin faster. Swoosh swoosh swoosh. Deafening sonic booms resounded through the air. The six sword gleams intertwined together in the air. Woosh. The bamboo leaves that were falling towards Chu Zhaoyang were grinded to smithereens by the six sword gleams.</p><br/><p>Su Huaijun’s eyes lit up. She could sense an unpredictable killing intent coming from the intertwining sword gleams.</p><br/><p>Interesting!</p><br/><p>The onlookers broke into discussion as well.</p><br/><p>\"What kind of swordsmanship is that?\"</p><br/><p>\"I’m not sure.\"</p><br/><p>\"It’s too late.\"</p><br/><p>\"That’s true!\"</p><br/><p>...</p><br/><p>Indeed, the six sword gleams swirling around Chu Zhaoyang were gradually suppressed by the falling bamboo leaves.</p><br/><p>At this moment, Su Huaijun heard Chu Zhaoyang murmuring again.</p><br/><p>\"It’s not powerful enough. Seems like I got to move it up to the second tier.\"</p><br/><p>Second tier?</p><br/><p>The doubt in Su Huaijun became stronger. This time around, she was sure that she hadn’t wrongly heard his words. What exactly is second tier?</p><br/><p>The six sword gleams suddenly transformed. Zoom. Intertwining wind and flames were swirling around Chu Zhaoyang now, appearing brilliant and powerful. Every sword gleam was accompanied by intertwining wind and flames. They were moving extremely fast and giving off scorching heat.</p><br/><p>Numerous bamboo leaves burst into flames with a loud rumble.</p><br/><p>The [Inescapable Net] was being stimulated. This time around, not only bamboo leaves grew out of it, but there were bamboo branches growing out of it as well.</p><br/><p>Deafening sonic booms rang across the air. The bamboo branches were like arrows, piercing through the protective screen of wind and flames in an instant.</p><br/><p>\"Eh? It still can be transformed? The third tier!\"</p><br/><p>Su Huaijun felt that she was going to go crazy soon. Third tier… what exactly is third tier?</p><br/><p>None of the onlookers were talking now. Even though they could hear Chu Zhaoyang’s murmurs, they could see the successive changes of his sword moves. They noticed the current situation was far from what they had expected it to be.</p><br/><p>Chu Zhaoyang seemed like...he had the power of resistance.</p><br/><p>But it might just be his final struggle.</p><br/><p>The onlookers quickly came to this conclusion. After all, this was the [Inescapable Net]. Even if Gui Hu was the one that was trapped in it, he would not be able to break out of it.</p><br/><p>When Chu Zhaoyang completely depleted his elemental energy, he would become a slave to the [Inescapable Net] like a physically exhausted wild animal.</p><br/><p>However, Ai Hui was actually immersing himself in the pleasure of simulating sword formations. </p><br/><p>The sword formations that he had destroyed previously were extremely exquisite. The feelings of simulating sword formations and destroying sword formations were completely different. A sword formation could be destroyed just by identifying its loopholes and weaknesses. However, to simulate a sword formation, one needed to have a deep understanding towards swordsmanship and sword formation.</p><br/><p>\"Okay, there’s something wrong with this area. Alright, I have to increase its power.\"</p><br/><p>\"I get it now, there’s something else in this area.\"</p><br/><p>...</p><br/><p>Ai Hui, who was lost in his own world, continued to mumble to himself. The number of crescent moons he had now could not be compared to the number of grass swords used in the sword formation. As such, it was not an easy task to simulate the sword formation. If not for those few detailed descriptions and explanations on sword formations in Karakorum Savant’s swordplay encyclopedia, Ai Hui would not have had such a deep understanding of sword formations.</p><br/><p>Because of the quantity issue, there were a lot of limitations in using just six crescent moons to simulate a sword formation. However, the six crescent moons were sword gleams and they were naturally more powerful than grass swords. New insights made Ai Hui’s eyes lit up.</p><br/><p>The powerful and ever-changing [Inescapable net] forced Ai Hui to speed up his thinking process. He was racking his brain on how to increase the power of his sword formation.</p><br/><p>A dead silence swept across the onlookers. Everyone was staring in shock at the arena. They no longer had the thought that Chu Zhaoyang would face an imminent defeat.</p><br/><p>During the previous sword formation, Chu Zhaoyang had displayed how swordsmanship could be used in a battlefield.</p><br/><p>Everyone felt as if they were in a battlefield. They could see corpses and blood everywhere. Thousands of men and horses were fighting and colliding against each other. A feeling of devastation engulfed them.</p><br/><p>Even though they were young masters and mistresses from prestigious families, most of them had seen blood before. However, they had never seen such devastating and desperate swordsmanship before.</p><br/><p>Chu Zhaoyang, who was trapped in the [Inescapable Net], was like a valiant general that was fighting with his life, bold and powerful.</p><br/><p>Chu Zhaoyang suddenly stopped what he was doing.</p><br/><p>\"It’s still not working... That means I have to move it up to the fourth tier!\"</p><br/><p>Su Huaijun had already become numb at this point of time.</p><br/><p>Fourth tier… what was he doing?</p><br/><p>The fourth tier was the [Big Dipper Sword Formation]. This was also the sword formation that Ai Hui had the most understanding of. However, he only had six crescent moons. [Big Dipper] needed a total of seven entities to work.</p><br/><p>Suddenly, Ai hui hit upon an inspiration. He could count himself as one entity and there would be seven entities in total.</p><br/><p>The [Big Dipper Sword Formation] was being channelled noiselessly. Ai Hui stood in the centre of the formation with his eyes flickering.</p><br/><p>The [Big Dipper Sword Formation] gave him a completely different feeling. For the previous three sword formations, he could clearly sense their tardiness and see their loopholes.</p><br/><p>He could infuse some of the marvellous ideas from these three formations into his own swordplay but he could not completely simulate them.</p><br/><p>However, Ai Hui could feel that [Big Dipper Sword Formation] was not a sword formation, but rather, a sword move!</p><br/><p>That’s right!</p><br/><p>The six sword gleams flew rapidly through the air. Ai Hui, who was standing in the middle of the formation, emitted a glow from his eyes.</p><br/><p>No matter how the sword gleams danced and flew, the aura of [Big Dipper] continued to exist.</p><br/><p>Very soon, Ai Hui could see the marvel of this move.</p><br/><p>It was as if the Big Dipper, in the depths of space, had shot out a streak of starlight. A faint lingering aura of death spiralled around the streak of starlight, cold and awe-inspiring.</p><br/><p>The trembling Su Huaijun was overwhelmed with horror. She immediately made a hasty retreat!</p><br/><p>Her [Inescapable Net] collapsed with a loud bang. An intense sword gleam engulfed the entire arena like a flash flood.</p><br/><p>Everything that stood thirty metres within Ai Hui was completely obliterated to a fine powder.</p><br/><p>Not a single voice could be heard.</p><br/>\n</div>"}