{"title": "Chapter 360: Reunion", "id": 360, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-360-reunion", "volume_title": "Volume 4", "body": "<h1>Chapter 360: Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 360: Reunion</p><br/><p>Translator: TYZ Editor: X/TYZ</p><br/><p>Silver City was really not a good place to be.</p><br/><p>This was not the first time Ai Hui had such a feeling. It was as if he was born to loathe this place.</p><br/><p>At this point in time, the dining hall was like a boiling cauldron of voices. Faces were intoxicated. Anything that was put into one’s mouth was either delicious food or fine wine. Anybody that one saw with his eyes was a beauty.</p><br/><p>In this place, other than getting drunk and making a ruckus with everyone, there was nothing else one could do. Everyone’s face brimmed with joy, completely lacking in vigilance. Everyone knew what distance to maintain from each other to make sure they, themselves, were safe and that the other party was comfortable.</p><br/><p>Just like the fine wine and delicious food, exquisite lies and fake smiles could be found everywhere.</p><br/><p>As compared to tonight’s banquet, the last party Ai Hui had in the Swordsman Training Hall was simple and crude. A party that was specially for savage people, to be exact.</p><br/><p>Everyone had had their arms around each other’s shoulders while eating, drinking, babbling nonsense. There had been no elegance to speak of. No one had to worry about bragging and talking about their troubles. If one wanted to cry, then he or she would cry. If one wanted to laugh, then he or she would laugh. Everyone had acted like an idiot.</p><br/><p>Ai Hui had never missed that moment more than now.</p><br/><p>In this place, everyone put on a mask and tried their best to outperform each other. An exquisite crystal chandelier hung high above their heads, looking grand and resplendent. Even though there were so many people around Ai Hui, he still felt lonely.</p><br/><p>Silver City was like an exceptionally beautiful lake. The surface of the lake was like a mirror, reflecting the image of the sky perfectly. However, beneath the tranquil lake, there were numerous invisible whirlpools. These whirlpools were the prestigious aristocratic families.</p><br/><p>The aristocratic families’ influence could be found everywhere in Silver City. Their tentacles had extended to every nook and cranny of Silver City.</p><br/><p>The moment one stepped into Silver City, he or she would be swept into one of these whirlpools. No one could avoid this fate. It was normal to lack the freedom to act independently in this place. Even the mighty Madam Ye and Fu Huaien were in this situation as well.</p><br/><p>Silver City might look like an beautiful and alluring painting, but in reality, it was a pale and hollow painting. Just like how the beautiful and visionary speech that Madam Ye previously gave had already been forgotten by everyone. Everyone looked to the two individuals battling in the arena with their bloodshot, intoxicated eyes. </p><br/><p>Other than immersing himself in the food, what else could Ai Hui do?</p><br/><p>He wished he could leave this place now.</p><br/><p>He was not someone who would back away from any problem or danger he encountered. However, for some unknown reason, in this brightly-lit, fully-packed, and bustling dining hall, his urge to run away and leave this place became even stronger.</p><br/><p>Unfortunately, he had not found the notebook yet.</p><br/><p>He continued to gobble up the food. Only by doing this could he get rid of the bad feeling within him.</p><br/><p>At this moment, a feeling of extreme danger suddenly arose in Ai Hui’s heart, freezing his body momentarily. After one second, his body loosened up. He pretended to drink water and raised his head, slowly scanning his surrounding.</p><br/><p>The feeling of danger was extremely strong. The premonition in Ai Hui’s heart did not disappear and became stronger instead.</p><br/><p>Ai Hui appeared no different from the rest. However, he was extremely focused, and his body was preparing itself for something to happen. If anything bad was to happen, he would be ready to strike.</p><br/><p>The feeling of danger became faintly discernable. Ai Hui, an experienced individual, knew that the danger was not targeting him. The weird thing was that he indistinctly sensed a familiar aura.</p><br/><p>If the danger was not targeting him, then who was it targeting?</p><br/><p>Ai Hui’s brain began to operate rapidly as his gaze continued sweeping across his surroundings. Suddenly, a thought flashed across his mind. Who was the one that was most likely to be assassinated?</p><br/><p>Ai Hui turned his head around abruptly and looked at Madam Ye, who was seated at the seat of honor.</p><br/><p>If a crisis occurred, the one who was most likely to be targeted… must be Madam Ye!</p><br/><p>Madam Ye was chatting happily with Fu Huaien. The unfathomable old woman guarded her from behind. Her vigilant gaze scanned through her surroundings every now and then.</p><br/><p>Ai Hui’s eyes were extremely sharp. He immediately noticed a servant that was getting closer to Madam Ye. The servant was holding a plate of piping hot food, appearing as if nothing was out of the ordinary.</p><br/><p>Was he being too paranoid?</p><br/><p>At this moment, the servant happened to turn around and face Ai Hui.</p><br/><p>Ai Hui’s eye pupils shrunk. The servant’s eyes contained a tinge of blood-red demonic glow.</p><br/><p>The Blood of God!</p><br/><p>Horrified, Ai Hui stood up abruptly and yelled, \"Be careful!\"</p><br/><p>He finally understood why he sensed danger. He was extremely sensitive to blood spiritual force. His instinctive hatred for the Blood of God was embedded within his body.</p><br/><p>The old woman reacted the fastest. Just as Ai Hui stood up, she was already protecting Madam Ye.</p><br/><p>When the servant saw that his surprise attack had failed, a look of determination appeared on his face.</p><br/><p>His body inflated rapidly like a balloon, and his face became distorted, appearing extremely hideous.</p><br/><p>\"What is that?\"</p><br/><p>\"Oh my god!\"</p><br/><p>The old woman’s facial expression changed drastically.</p><br/><p>10 meters away from her, the inflated servant exploded with a loud boom</p><br/><p>A glaring red light momentarily blinded everyone. A terrifying aura engulfed the entire dining hall. Blood-curdling screams and cries of alarm could be heard incessantly.</p><br/><p>Ai Hui reacted extremely fast. Immediately, he flipped up the ironwood table in front of him with his foot and crouched down. The table acted like a big shield in front of him.</p><br/><p>Thud, thud, thud!</p><br/><p>The sound of densely-packed collisions fell nonstop on his ears. Numerous bumps began to appear on the bottom of the sturdy table. Pieces of torn flesh rapidly flew by him like arrows that were launched from a bow.</p><br/><p>The people surrounding Ai Hui collapsed in an instant.</p><br/><p>The air in the dining hall was pervaded with the uniquely sweet smell of blood poison. Ai Hui’s eyes suddenly reddened. His inner hatred for the Blood of God caused him to involuntarily tremble. The entire hall seemed to be shrouded in a red blood mist.</p><br/><p>At this moment, the blood plum blossom on Ai Hui’s chest trembled, freezing his body.</p><br/><p>This was…</p><br/><p>Ai Hui widened his eyes. He suddenly realized that One Thousand Yuan was nearby!</p><br/><p>The old woman received the most damage from the servant’s explosion. She had endured more than half of the impact from the blast. Her hair was dishevelled and blood flowed out from the corner of her mouth, making her look extremely pathetic. </p><br/><p>\"Protect Madam!\"</p><br/><p>The old woman let of a bellow and a miserable shriek at almost the same time. Amid the blood mist, two figures could be seen separating upon making contact.</p><br/><p>Not good!</p><br/><p>Ai Hui’s facial expression changed drastically. He felt really stupid. Other than Madam Ye, who else could One Thousand Yuan possibly target?</p><br/><p>With a pair of glaring eyes, the old woman stood motionlessly in front of Madam Ye.</p><br/><p>Suddenly, a streak of blood shot out from her neck. Following which, blood began to flow out of her neck like gushing spring water. She then collapsed onto the ground with a loud bang.</p><br/><p>Was… was she dead?</p><br/><p>Ai Hui was flabbergasted. The old woman’s strength was unfathomable, and he suspected that she was at least at the level of a Master. However, a Master like her had just collapsed right in front of him. Even a Master could be so fragile when hit with a carefully planned assassination attempt.</p><br/><p>For the first time, panic was written all over Madam Ye’s face. When she saw the old woman collapse to the ground, the panic on her face turned into fear.</p><br/><p>Out of the corner of his eye, Ai Hui suddenly saw a weird-looking figure dashing silently toward Madam Ye.</p><br/><p>One Thousand Yuan!</p><br/><p>She was trying to kill Madam Ye!</p><br/><p>\"Stop!\"</p><br/><p>\"Be careful!\"</p><br/><p>Jiu Gui and Prince both cried out in alarm. They were seated at the entrance and far away from Madam Ye. As such, when they witnessed this horrifying scene, they were unable to do anything, regardless of how much they wanted to. They could only cry out a warning.</p><br/><p>Damn it!</p><br/><p>Without hesitation, Ai Hui dashed forward. Sticking close to the wall, he pounced forward like a ferocious tiger. As he flew up into air, he unleashed a snow-white sword gleam that streaked across the dining hall.</p><br/><p>Fu Yongwu was very lucky. Because of the location where he was seated, his brother, Fu Renxuan, had blocked most of the attack. However, this unforeseen event still left him in shock.</p><br/><p>Suddenly, a dazzling cold sword gleam flashed across his eyes.</p><br/><p>He quickly returned to his senses and saw Chu Zhaoyang’s tiger-like back and the biting-cold sword gleam.</p><br/><p>The image of the silvery light expanded rapidly in Madam Ye’s vision, A terrifying killing intent overwhelmed her, causing her brain and body to freeze. </p><br/><p>Chu Zhaoyang’s cold scarred face suddenly increased in size from her perspective. His pair of eyes were filled with a deep-rooted hatred and the viciousness of a predator. The dazzling sword gleam was so cold that it did not contain a single tinge of warmth.</p><br/><p>Is he… trying to kill me?</p><br/><p>The fear on Madam Ye’s face grew at a visible speed, resembling the expanding ripples on a pond after a rock had been thrown into it.</p><br/><p>The figure that silently dashed toward Madam Ye flicked her hand.</p><br/><p>Clink!</p><br/><p>At the instant when Ai Hui made contact with the figure, the Silverfold Plum in his hand appeared as if it had been pierced into a whirlpool of void. A powerful attractive force was sucking him into the whirlpool. The glow in Ai Hui’s eyes flickered and that mysterious force disappeared.</p><br/><p>At this moment, Ai Hui was certain that the lady disguised as a servant girl was She Yu!</p><br/><p>The Demonic Girl of God Nation!</p><br/><p>Wearing an elemental mask on her face, She Yu looked like an ordinary servant girl. However, as her eyes lit up, a tinge of liveliness flashed across her plain-looking face</p><br/><p>The servant girl’s mouth curled into an enigmatic smile. Her tongue involuntarily licked her luscious bright-colored lips, resembling a predator that had discovered traces of its prey.</p><br/><p>So you were here!</p><br/><p>The surging energy wave from the collision knocked Madam Ye a few steps back. When she stabilized herself, she noticed a figure was standing in front of her and protecting her. By this point, Madam Ye had realized that Chu Zhaoyang had just saved her. A tinge of gratitude appeared within her eyes.</p><br/><p>Jiu Gui spat out a cloud of wine mist. A horseman dashed out of the wine mist and charged at servant in front of Chu Zhaoyang.</p><br/><p>Prince flew up into the air and raised his great sword over his head. Locking on to his target, he pumped all his energy into this attack!</p><br/><p>The third person to react was actually Su Huaijun. She waved her hand and threw out her jade bamboo stick.</p><br/><p>The bamboo stick landed beside Madam Ye’s feet and began to grow. Following which, a green-colored light screen was released and enshrouded Madam Ye.</p><br/><p>She Yu winked at Ai Hui. Then, her body trembled in an odd way, looking as if she was breaking away from some kind of restriction. Suddenly, the charging wine mist horseman and Prince’s overhead slash both completely lost their target.</p><br/><p>The enemy was initially there, but they could not accurately target her.</p><br/><p>The empty space in front of Chu Zhaoyang pissed off Prince so much that he almost vomited blood.</p><br/><p>Meanwhile, the wine mist horseman dissipated into the air.</p><br/><p>Under everyone’s watchful eyes, the servant girl vanished into thin air.</p><br/><p>Those who saw this sight felt a cold shiver run down their spines.</p><br/><p>Only Ai Hui saw what She Yu silently mouthed to him before she disappeared. The chilliness within his heart became more intense.</p><br/><p>\"I will be back for you.\"</p><br/>\n</div>"}