{"title": "Chapter 376: Destiny", "id": 376, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-376-destiny", "volume_title": "Volume 4", "body": "<h1>Chapter 376: Destiny</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 376: Destiny</p><br/><p>Translator: TYZ Editor: TYZ/KLKL</p><br/><p>In Silver City, high in the sky, there was a man and a woman floating on a cloud.</p><br/><p>The woman’s deep green and white robe was fluttering loudly, while the veil on her face was drifting in the wind behind her. Karakorum Savant was holding a sword with one hand. The silver-white azure wings on her back were light and dazzling. They were covered with exquisite feather-shaped patterns, looking unimaginably beautiful.</p><br/><p>Beside her, there was a tall and burly man. He was wearing a silver-white mask on his face. The mask was so well-polished that it looked sleek and glossy. There was a simple and unadorned word engraved onto his forehead, \"Infantry\".</p><br/><p>Behind the mask, his exposed eyes were deep and reserved.</p><br/><p>The most attractive part of his body was his arms. He had a pair of muscular, metallic arms. From his shoulders down, everything was made of metal. The joints were elegantly built. Mysterious and complicated veined patterns were engraved all over his two arms.</p><br/><p>Similarly, the azure wings on his back were also silver-white in color. However, his azure wings had a bigger framework and were sturdier and stronger than Karakorum Savant’s.</p><br/><p>\"Senior, let’s go down.\"</p><br/><p>Karakorum Savant’s voice was very light, so much so that it sounded as if it could be carried away by the drifting wind. Beneath her veil, her beautiful eyes emitted a faint glow that seemed to bring an indescribable sense of hope.</p><br/><p>The burly man could hear her light and gentle voice clearly. He nodded his head and replied, \"I will be at the front. Take care of your safety.\"</p><br/><p>\"Ok,\" Karakorum Savant replied.</p><br/><p>The burly man spread the azure wings on his back. Like a vigorous winged dragon, he swooped down from the sky.</p><br/><p>As the thick and solid azure wings flapped, they produced a heavy wind sound.</p><br/><p>His speed increased. The eyes that his silver-white mask exposed remained deep and composed.</p><br/><p>As he got nearer to the ground, the azure wings on his back withdrew. Like a meteor, he was approaching the ground at a terrifying speed. His entire body was lit up with a dazzling blaze. The blaze was flickering non-stop and the light it emitted was reflected in his eyes.</p><br/><p>The sharp sound of wind rapidly became deep and trembling. The blaze became increasingly intense as it was stroked by the fluttering wind. The deep, trembling, whizzing sound of wind was combined with the whirring sound of the intense blaze.</p><br/><p>Everyone on the ground immediately sensed something strange and raised their heads.</p><br/><p>A faintly discernable figure that was engulfed in flames was falling from the sky like a meteor. His momentum was terrifying.</p><br/><p>Everyone’s facial expressions changed drastically. This person did not show any sign of slowing down. On the contrary, he was still increasing his speed.</p><br/><p>A similar thought appeared in everyone’s mind. Was this man crazy?</p><br/><p>Flying down at such a high speed would make it impossible for him to slow down before he landed. The powerful impact would smash his body to smithereens on first contact.</p><br/><p>The flight speed of the fire-engulfed figure did not change the slightest bit. The two eyes that his mask revealed were calm and deep.</p><br/><p>Following which, his body began to transform. An intense, metallic luster rapidly extended over the surface of his body. In the blink of an eye, his entire body was covered with an intense, copper-yellow luster.</p><br/><p>[Copper Skin]!</p><br/><p>The most basic level of body-tempering looked completely different on his body. The copper-yellow luster gradually became brighter, eventually becoming silver-white in color. The clothes on his body emitted a silver-white luster as well, as if they were made up of thin pieces of silver. Under the illumination from the blaze around his body, his clothes became blinding to the eye.</p><br/><p>Everyone’s facial expressions changed. Without any hesitation, they quickly retreated to safety.</p><br/><p>This fellow was going to land without slowing down his speed!</p><br/><p>A streak of blaze descended from the sky with 10,000 newtons of force.</p><br/><p>Boom!</p><br/><p>An earth-shaking explosion erupted and released a terrifying shock wave that was mixed with flames and debris. The shock wave rushed towards everyone like a whizzing iron wall filled with chaotic elemental energy.</p><br/><p>She Yu disappeared into the air like a wisp of smoke and appeared a hundred meters away from the explosion.</p><br/><p>Old Ling shrieked and flew towards the sky abruptly. His figure flew higher and higher before barely avoiding the whizzing, violent shock wave.</p><br/><p>Ai Hui’s reaction was extremely fast as well. He could already sense the presence of the person when they were still in the sky. Then, when the person began to swoop down from the sky, Ai Hui immediately knew what he was trying to do.</p><br/><p>Ai Hui knew because he had used a similar type of move before. The only difference was Ai Hui used a sword move to negate the recoiling impact, while the man used his body to do it.</p><br/><p>Previously, Ai Hui was already very impressed by Gui Hu’s tempered body. However, in front of this freak, Gui Hu’s tempered body was not even worth mentioning.</p><br/><p>This was too sick!</p><br/><p>At the first instance, Ai Hui dragged Xiao Shuren along with him and made a hasty retreat.</p><br/><p>Initially, Xiao Shuren still did not know what was going on. However, when she saw the descending streak of blaze in the sky, her facial expression changed. As she retreated with Chu Zhaoyang, she saw the surrounding walls in the courtyard being destroyed by the shock wave. The walls collapsed and a wave of debris flew towards her like a grey-colored monster that was baring its fangs and brandishing its claws at her.</p><br/><p>In an instant, her face turned deathly pale.</p><br/><p>At the most critical moment, her vision went dark. She had being dragged into a tall drain by Chu Zhaoyang. The whizzing shock wave blew over the top of her head while the ground trembled. Xiao Shuren’s mind went blank as her body shivered with cold involuntarily.</p><br/><p>The one who suffered the most was Qing Feng. He had just sustained huge losses after being severely injured by Chu Zhaoyang. Hence, when such a powerful attack suddenly came, he could not react in time. As the violent shock wave swept across the courtyard and hit him, he felt as if he had collided head-on with a monster that was charging wildly.</p><br/><p>With a groan, he suddenly burrowed his feet into the ground. Like a tree that had embedded its roots deep into the earth, he held on tightly to the ground.</p><br/><p>Crackle, rattle. The rain-like debris hit his body and produced sparks that flew in all directions. His body was swaying violently but luckily his feet had grown roots to stabilize his body by force.</p><br/><p>He felt that he had been swept into a hurricane.</p><br/><p>Crack, crack, crack!</p><br/><p>Every second felt like forever.</p><br/><p>Huff, puff, huff. Qing Feng was panting heavily as he held on tightly to the ground. At this moment, he looked extremely pathetic. The previously bright and clean surface of his lotus roots was covered with cracks now.</p><br/><p>When he raised his head, the cracks on the surface of his lotus roots disappeared and became as good as new. However, Qing Feng knew that it was only the surface that had recovered. In reality, his body was severely damaged. After he returned home, he would have to stay in the lotus pond for a period of time to have his body completely healed.</p><br/><p>However, now was not the time to think about that.</p><br/><p>His gaze was fixated on the half-crouching, silver-colored, burly man in the middle of the courtyard.</p><br/><p>The entire body of that man emitted an intense, metallic luster. He looked like a metal man that was cast out of silver. His sturdy muscles resembled the most perfect masterpiece of a classical sculptor.</p><br/><p>Any pose he made was filled with the beauty of power.</p><br/><p>The most attractive part of his body was his silver-colored metallic arms. The exquisite veined patterns on his arms exuded an indescribable surrealness. By taking a single glance at them, Qing Feng could tell that they had been made by a master.</p><br/><p>When the silver-colored burly man stood up straight, Qing Feng could see the simple and unadorned word carved on his forehead.</p><br/><p>\"Infantry!\" Qing Feng’s pupils dilated.</p><br/><p>Infantry Division was one of the Thirteen Divisions. Was the word \"Infantry\" engraved on his forehead referring to Infantry Division? What unique meaning did it convey?</p><br/><p>Suddenly, a phantom appeared behind the silver-colored burly man. It was She Yu and her eyes were filled with killing intent.</p><br/><p>Similarly, when she saw the word \"Infantry\" on the man’s forehead, her heart skipped a beat. Certain secret information emerged in her mind and her killing intent arose all of a sudden.</p><br/><p>A cold shiver went down She Yu’s spine as she sensed something was wrong.</p><br/><p>A cold and sharp aura locked onto her from above her head.</p><br/><p>The other party had an ally with him!</p><br/><p>She made a prompt decision. Following which, her body became light and wavy, like a willow branch fluttering in the wind. Suddenly, her body split into three phantasms that flew away in three different directions.</p><br/><p>A cold dazzling sword gleam descended from the sky. Its crisp and clear sword chime gave off an aura of killing intent that engulfed the place.</p><br/><p>The three phantasms could not escape in time and were pierced by the sword gleam. They vaporized into three clouds of black-colored mist and vanished into thin air.</p><br/><p>A hundred meters away, She Yu was looking with fear at the veiled lady that was holding a sword.</p><br/><p>Karakorum Savant!</p><br/><p>The first master swordsman in the Avalon of Five Elements.</p><br/><p>When everyone saw Karakorum Savant, everyone immediately thought of one name, Madam Ye!</p><br/><p>Karakorum Savant’s relationship with the Ye Residence was very deep. Was it a coincidence, or was it pre-planned that Karakorum Savant brought such a powerful assistant all of a sudden?</p><br/><p>Everyone’s faces turned slightly ugly.</p><br/><p>Old Ling’s gaze was fixated on the silver-colored burly man. He looked like he’d thought of something and his facial expression changed slightly. With killing intent in his eyes, he suddenly said, \"Shall we join hands?\"</p><br/><p>At this point of time, arrogance could no longer be found on Qing Feng’s face. He replied, \"Let’s kill these two persons first!\"</p><br/><p>\"I second that,\" She Yu smiled lovably.</p><br/><p>The three of them immediately spread apart and surrounded the two people.</p><br/><p>The silver-colored burly man did not show any sign of fear and remained calm and cool-headed. Karakorum Savant held her sword firmly as her gaze remained calm and composed as well.</p><br/><p>Ai Hui dragged Xiao Shuren along with him and hid behind a half-destroyed wall. He felt that life was really unpredictable. Just a moment ago, She Yu was engaged in a bitter battle with Old Ling. But now, they had joined hands.</p><br/><p>When Ai Hui saw his chief and the silver-colored burly man, he instantly felt at ease. The two of them were really too powerful!</p><br/><p>However, for some unknown reason, the silver-colored burly man gave Ai Hui a mysterious sense of familiarity.</p><br/><p>…..</p><br/><p>At Beast Venom Temple, the hall where the blood pool was situated was spacious and empty.</p><br/><p>The scarlet red, thick and bloody water in the pool had become clear without any impurities.</p><br/><p>There was a man lying at the bottom of the pool. His body was naked and his eyes were tightly closed. His long black hair was scattered and wavy, resembling graceful seaweed at the bottom of a sea.</p><br/><p>He slowly opened his eyes. The world gradually became clearer in his vision. Through the clear water of the pool, he saw a beautiful mural on the domed ceiling. The mural depicted the story of a man who defeated a monster and kept it as a pet. It showed red-colored blood, a blood-stained weapon and numerous hollow tree trunks that were flowing with blood. He seemed to have seen his own destiny.</p><br/><p>He sighed in his heart as his body slowly rose from the pool.</p><br/><p>When his head left the surface of the water, cold and crisp air filled his lungs. The familiar water elemental energy that filled his body had disappeared and was replaced by a unfamiliar power.</p><br/><p>It was a type of scorching and surging power that made him stronger than before.</p><br/><p>He did not feel surprised or happy at all. All he felt was emptiness and despair.</p><br/><p>‘Since I have already accepted it, I can’t be wishy-washy about it,’ he told himself.</p><br/><p>His gaze landed upon the water coffin on the side of the pool. His heart skipped a beat when he saw the vague yet familiar figure lying in the water coffin.</p><br/><p>He stood up and stepped onto the surface of the water. Under his feet, the water was like a level road.</p><br/><p>He walked to the water coffin and stared at the girl lying within it. That beautiful and familiar face made him feel as if he had gone back to the past.</p><br/><p>If only… things could go back to the way they were, then how good would that be...</p><br/><p>\"I’m very sorry. When we found her, her body was already badly injured and incomplete. Luckily, she hasn’t died yet.\"</p><br/><p>A voice came from behind his back.</p><br/><p>The voice belonged to a shabby-looking scholar. It was the master of Beast Venom Temple, Nangong Wulian.</p><br/><p>The man did not turn his head and asked, \"Have you healed her?\"</p><br/><p>Nangong Wulian smiled, \"It’s very difficult, I can only try my best.\"</p><br/><p>\"What do you need me to do?\" the man asked plainly.</p><br/><p>Nangong Wulian threw him a red-and-black mask and he caught it.</p><br/><p>The color of the black was deep and dark like the night sky, while the color of the red was blazing like scorching flames.</p><br/><p>\"From today onwards, you are the Red Devil!\"</p><br/><p>Nangong Wulian’s fanatic voice echoed through the spacious and empty hall.</p><br/><p>Without saying a word, under the gazes from the hero and the monster in the mural on the domed roof, the man put on the red-and-black mask.</p><br/>\n</div>"}