{"title": "Chapter 377: An Old Friend", "id": 377, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-377-an-old-friend", "volume_title": "Volume 4", "body": "<h1>Chapter 377: An Old Friend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 377: An Old Friend</p><br/><p>Translator: TYZ Editor: TYZ/KLKL</p><br/><p>Ai Hui dragged Xiao Shuren along with him and hid behind a wall. All his attention was caught by the intense battle.</p><br/><p>Chief and Silver Soldier could actually withstand the combined offenses from Old Ling, Qing Feng and She Yu.</p><br/><p>Karakorum Savant’s robe was fluttering and her veil was dancing. Her beautiful eyes remained calm and composed. The elegance of the first ever master swordsman had been displayed without restraint. The sword in her hand emitted an extreme chilliness. Every time she brandished her sword, she would unleash a sword gleam that criss-crossed in the air.</p><br/><p>Ai Hui had no choice but to admit that Karakorum Savant’s swordplay and her understanding of swordsmanship were better and more powerful than his.</p><br/><p>For example, sword formations. Ai Hui always utilized sword formations in his sword moves as he felt that sword formations would be an important aspect of swordsmanship in the future. But compared to Ai Hui, Karakorum Savant’s sword moves could display traces of sword formations at will.</p><br/><p>She used sword formations with more flexibility and ease than Ai Hui did. One could tell that her understanding of swordsmanship was much deeper than Ai Hui’s.</p><br/><p>Furthermore, her fighting style lit up Ai Hui’s eyes as well.</p><br/><p>Her body moved along with her sword.</p><br/><p>Her body seemed to be weightless, behaving as if she was the tassel that hung on her sword hilt. As her sword moves lit up and whizzed towards her target, she hid herself behind the sword gleam and flew along with it.</p><br/><p>Immediately, AI Hui could see the marvel behind this unique fighting style.</p><br/><p>The range of a sword gleam was not as far as an arrow’s. However, in terms of short-distance explosive power, it was much stronger than an arrow’s. Accompanied by the sharpness of a sword gleam, this kind of explosive power was extremely deadly at short distances.</p><br/><p>And by hiding herself behind the sword gleam, she could reduce her exposed surface area, making it nearly impossible for her enemy to land an attack on her. Karakorum Savant’s enemy had to first destroy the sword gleam before he or she could attack her.</p><br/><p>Of course, this kind of fighting style had its weakness too.</p><br/><p>Even though this fighting style was fast and precise, it was too straightforward and lacked variability. As long as the opponent could dodge the sword gleam and launch an indirect attack, they could obtain the opportunity to injure Karakorum Savant.</p><br/><p>However, with Silver Soldier by Karakorum Savant’s side, this kind of simple and direct fighting style immediately became extremely powerful.</p><br/><p>Karakorum Savant moved like a flying treasure sword that swirled around Silver Soldier. At this point of time, Silver Soldier was surrounded by a streak of sword gleam that was striking its enemies from all directions unpredictably.</p><br/><p>Silver Soldier’s burly body was like an unreasonable monster. When an ordinary attack landed on his shiny silvery body, it could not even leave a single scratch on him. His metal-made arms were changing its form unpredictably. Sword, fist, hammer, polearm, axe, truncheon….</p><br/><p>A variety of moves were unleashed in an innumerable succession.</p><br/><p>However, even so, this was not enough to cause trouble for his opponents. The most troublesome aspect of his offense was that his variety of moves was accompanied by a straight-on and explosive attacking style. This type of offense was overwhelming and terrifying for his opponents.</p><br/><p>No one dared to fight him head-on. Old Ling, who was metal-attributed just like Silver Soldier, had his face turn ugly after exchanging a few blows with him.</p><br/><p>Qing Feng was suppressed by him until the point that he no longer had any fighting fervor in him. Right now, he only focused on dodging Silver Soldier’s attacks. After his nether lotus seeds were severely damaged by Ai Hui, he’ lost his trump card and his strength had reduced sharply. This put him in an extremely pathetic state.</p><br/><p>Karakorum Savant swept up streaks of biting-cold sword gleams around Silver Soldier. There were a few times where She Yu tried to mount a sneak attack on Silver Soldier but failed to find an opening to attack. Instead, she was almost injured by the swirling sword gleams.</p><br/><p>The injury that Old Ling had previously inflicted on She Yu was making her movements sluggish at this point of time.</p><br/><p>Even when Karakorum Savant and Silver Soldier fought against three experts at once, they did not succumb to a disadvantageous position. Ai Hui could not take his eyes off the intense battle.</p><br/><p>To be able to see such an intense battle between experts was a once-in-a-lifetime opportunity. It was highly beneficial for Ai Hui to be able to observe and learn from the battle while on the sideline.</p><br/><p>Ai Hui was not surprised at Karakorum Savant’s superb swordsmanship. However, he was slightly shocked at how powerful Silver Soldier was. From what he knew of Infantry Division, they were not really popular among the public.</p><br/><p>Even though Infantry Division was part of Thirteen Divisions and was one of the two major metal elemental divisions, their status differed greatly from Sky Edge Division, the other metal elemental division.</p><br/><p>Sky Edge Division’s fighting capabilities were more outstanding and their inheritances were more formidable than Infantry Division’s. There were a lot of areas in which Sky Edge Division was better than Infantry Division. Honestly speaking, Infantry Division was a ‘laborers’ division. The missions and things they did were strenuous and unrewarding.</p><br/><p>There were many reasons why Infantry Division was not popular. However, the main reason was their choice of training specialization. Infantry Division specialized in body-tempering. Out of so many specializations, body-tempering was the most challenging and arduous.</p><br/><p>At the initial stage, practicing body-tempering was relatively less difficult. However, as one progressed along this path, the difficulty of practising body-tempering increased sharply. Furthermore, when it came to battles, the elementalists from Infantry Division would usually play the role of meat shields in the front line. This caused their casualty rate to be extremely high. The tasks they did were difficult and tiring. It was no wonder that they were so unpopular. </p><br/><p>And because of all these reasons, Infantry Division was the lowest ranking division among the Thirteen Divisions.</p><br/><p>Ai Hui knew little about Infantry Division. The only person he knew from Infantry Division was Brother Li Wei, whom he’d first met in Central City.</p><br/><p>As this thought emerged in his mind, Ai Hui was suddenly stunned.</p><br/><p>He raised his head abruptly and started at the view of Silver Soldier’s back.</p><br/><p>Countless fragmented memories appeared in his mind. These blurred fragmented memories began to stack on top of the silver figure.</p><br/><p>Ai Hui stared blankly at the silver, burly figure and found him to be more and more familiar.</p><br/><p>Brother Li Wei… He did not!</p><br/><p>Ai Hui’s mind went blank upon realizing that Li Wei did not die.</p><br/><p>Three years ago, when the blood catastrophe had just broken out, there were only two elites from Thirteen Divisions. They were Li Wei and Zhou Xiaoxi. Zhou Xiaoxi was the one that accompanied Ai Hui and the other students to Garden of Life. After the blood catastrophe broke out, Zhou Xiaoxi, who was then infected with blood poison, had to seek reinforcements for the students by himself. Eventually, he met with a mishap and died. As for Brother Li Wei, he’d disappeared without a trace after taking part in an operation.</p><br/><p>Senior Mingxiu had grieved over Li Wei’s death for a long time.</p><br/><p>He did not expect Brother Li Wei to still be alive...</p><br/><p>Ai Hui’s gaze landed upon Li Wei’s metallic arms. It was then he remembered that Brother Li Wei lost his arms during the fight with Tian Kuan three years ago. Eventually, Ai Hui calmed himself down from the excitement. The silvery figure looked more unfamiliar than familiar.</p><br/><p>He was exuding such an invincible and overbearing aura. Brother Li Wei had changed completely.</p><br/><p>Brother Li Wei was not the only one who had changed completely. If the old Brother Li Wei saw what he had transformed into now, he would be surprised as well, right?</p><br/><p>In troubled times, everything was changing every day. Every life was as fragile as a blade of grass. If one did not want to die, he or she had to become stronger at all costs.</p><br/><p>Would Brother Li Wei still remember Senior Mingxiu?</p><br/><p>The excitement in Ai Hui’s heart had disappeared and was replaced by an indescribable tinge of sadness.</p><br/><p>He did not want to know the answer at all.</p><br/><p>Suddenly, Xiao Shuren, who was in his embrace, fidgeted and said, \"You are hugging me too tight.\"</p><br/><p>Ai Hui returned to his senses and warily tightened his sword against her neck. Previously, in a moment of desperation to avoid the impact from Li Wei’s landing, he’d dragged Xiao Shuren with him and made a hasty retreat.</p><br/><p>At this point of time, both of them were in a rather dubious position. To restrain Xiao Shuren and prevent her from getting injured by the shock wave, Ai Hui pressed her against his chest and placed his Silverfold Plum on her neck.</p><br/><p>\"Don’t move about!\"</p><br/><p>Ai Hui warned her coldly. He loosened his grip as he could hear Xiao Shuren had slight difficulty breathing properly.</p><br/><p>Xiao Shuren panted heavily. She looked extremely pathetic now. Her head and face were filthy with dirt and her fringe was messy. Even so, her beauty still could not be concealed.</p><br/><p>Ai Hui was extremely wary of her. Every movement Xiao Shuren made, he would react to it. No matter what ancient treasure she had, he did not care about it at all. This woman was cunning and vile. A slight moment of carelessness would cause him to fall into her trap.</p><br/><p>\"Let’s make a deal,\" said Xiao Shuren calmly as she composed her breathing.</p><br/><p>\"You better not play any tricks,\" Ai Hui said coldly as doubt filled his mind.</p><br/><p>\"A person who is about to die has no reason to do that,\" Xiao Shuren smiled sadly and continued, \"Don’t tell me, does Mr Chu still think that I can continue to live?\"</p><br/><p>Ai Hui was stunned.</p><br/><p>…..</p><br/><p>On the platform at the center of the pool, Xiaobao had a blank look on his face. He did not know what was going on.</p><br/><p>Bendy strips of dazzling light appeared on his body. These translucent light strips swirled around his body like meandering roads on a mountain.</p><br/><p>[Sinuous Aqua Body]!</p><br/><p>This was a body constitution unique to the Gu Family.</p><br/><p>Great Elder widened his eyes. One could see the excitement and happiness in his eyes.</p><br/><p>One by one, everyone on the side of the pool widened their eyes as well. Nine sinuous traces! It was the most outstanding level of body constitution in [Sinuous Aqua Body]</p><br/><p>Very soon, a look of marvel appeared on their faces.</p><br/><p>However, they also felt that it was a great pity for a mentally challenged boy to have such an excellent body constitution. The gods were really too cruel to the Gu Family. However, even if Xiaobao wasn’t too smart, as long as he was physically healthy and he could make use of his natural gift, his future would be limitless with the backing of Great Elder.</p><br/><p>The Gu Family was unlikely to go so far as to go without having a qualified successor to carry on its undertaking.</p><br/><p>A look of disappointment flashed across Elder Ling’s face.</p><br/><p>Great Elder was very emotional. Even though he tried to suppress his emotions, those who knew him well could still see how emotional he was. The malicious rumor that had been spreading the last few days had taken a toll on his mind. Even though he kept telling himself that it was only a plot set up by his enemies, he was still disturbed by it.</p><br/><p>His only son had died young and his grandson was born with a mental disability. These no doubt made him feel forlorn. However, no matter how big of a weakness Xiaobao had, he was still his only grandson and mental support.</p><br/><p>The vicious rumor found his weakness so easily.</p><br/><p>At this point of time, Great Elder looked at Xiaobao with a gaze which was filled with a mixture of love and guilt.</p><br/><p>When he shifted his gaze to Madam Ye, he felt even more guilty. All these years, his daughter-in-law had been taking care of Xiaobao by herself, and she still had to go through such unredressed injustice. However, he knew that he was mainly responsible for this incident as well. He had a lot of things that he wanted to say, but could not do so.</p><br/><p>Madam Ye understood how he felt and smiled gently. Even at this point of time, she was still composed and virtuous</p><br/><p>Elder Ling cast a glance at Elder Song, who shook his head to imply that the result was real. Elder Ling was extremely disappointed. He thought he would obtain a good opportunity this time around. If Great Elder’s family was involved in a scandal at this point of time, Great Elder would not be able to stay in his position for long.</p><br/><p>Even though Elder Ling was disappointed deep down, his face was brimming with joy. He said in a loud voice, \"I told you so. We watched Lin-er grow up, how can we not know her character?\"</p><br/><p>Yuchi Ba smiled, \"That’s right. Why would one doubt Ye Residence’s family values? Their family values are matchless! I can’t fathom how there are people who actually believe in such an absurd rumor. This time around, with everyone present as witness, no one can harass Xiaobao with such a rumor again.\"</p><br/><p>The speaker had no particular intention in saying this, but the listener read his own meaning into it. Great Elder felt more guilty upon hearing what Yuchi Ba said. However, he still felt more anger than guilt. With a cold voice, he said, \"Everyone, please be my witness. If I find out who started the rumor, I will not hesitate to punish him ruthlessly.\"</p><br/><p>\"Indeed! That person has to be punished! A rumor like this is far too malicious!\"</p><br/><p>\"The person who started this rumor is too malicious! The person deserves to die!\"</p><br/><p>The rest agreed as well.</p><br/><p>Madam Ling’s face turned deathly white. She stared at Xiaobao and could not believe her eyes. How could it be? How could it be? She definitely would not make a mistake!</p><br/><p>Madam Ye smiled as usual. Her gentleness could make one enchanted with her.</p><br/><p>At this moment, a scout from Sky Edge Division walked to Tong Kui and whispered something in his ear. Tong Kui’s body froze momentarily. Then he walked silently to Yuchi Ba. Everyone present was an influential individual and all of them were shrewd and sharp. At once, they knew something was wrong.</p><br/><p>A premonition arose in Great Elder’s mind. He withdrew his smile and asked, \"What has happened?\"</p><br/><p>Yuchi Ba nodded his head and told Tong Gui, \"Report everything to Great Elder.\"</p><br/><p>Tong Kui bowed and replied, \"Yes. Ye Residence has been attacked.\"</p><br/><p>An absolute silence descended upon everyone.</p><br/>\n</div>"}