{"title": "Chapter 386: A Free Gift", "id": 386, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-386-a-free-gift", "volume_title": "Volume 4", "body": "<h1>Chapter 386: A Free Gift</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 386: A Free Gift</p><br/><p>Translator: Cynthia Editor: TYZ/KLKL</p><br/><p>Zhao Boan was fleeing for his life and his brain was completely blank.</p><br/><p>He had just witnessed his caravan being cleared up within a very short period of time. Yes, it was \"cleared up\", as if the guards he’d hired with a large sum of money were nothing more than rubbish and were cleared up immediately by a broom.</p><br/><p>And his enemy was only one person.</p><br/><p>Zhao Boan’s heart was like dead ashes.</p><br/><p>He had spent all his savings and a huge loan he borrowed in order to knock together this caravan, which was fully loaded with wood elemental materials. If he’d managed to make it to the Wilderness, he could have made at least ten times profit.</p><br/><p>If he succeeded, he would become famous. But if he failed, he would be doomed eternally.</p><br/><p>The huge amount of debt would kill him. All the creditors would come to him and take away everything he had, including his life.</p><br/><p>He didn’t want to die.</p><br/><p>He tried to negotiate with the looter and implored him to let him go. But the looter seemed to have heard nothing. All his guards had run for their lives, as life was the most critical thing at this critical moment.</p><br/><p>Zhao Boan, however, could not escape. Without the goods, he was dead meat anyway.</p><br/><p>Pale-faced, he was shivering all over and was stammering to beg for mercy. But the next scene he saw made him desperate.</p><br/><p>The person removed his cloak, and it turned out to be a grass-lotus puppet. It opened the carriage gates of the Three Leaves Bamboo Carts and poured all the materials into its mouth. Its grass and lotus body was not strong, but was like a bottomless pit that could never be filled.</p><br/><p>The grass-lotus puppet poured the wood elemental materials from each cart, one by one, into his mouth.</p><br/><p>Zhao Boan became more and more desperate. When half of the materials were gone, Zhao Boan knew he was finished.</p><br/><p>But as soon as this idea occurred to him, he was no longer afraid, and suddenly broke out into curses.</p><br/><p>He was not good at cursing at all, but he racked his brains to collect all the curses in his mind and used them on the puppet.</p><br/><p>The grass-lotus puppet was stunned, and came to his senses only after a while. He was irritated, and rushed towards Zhao Boan furiously.</p><br/><p>Zhao Boan thought he no longer cared about life or death, but when he was faced with the ferocious grass-lotus puppet, his mind went blank and all his courage was gone. He howled in fear and turned to run at once.</p><br/><p>The instinct to survive didn’t leave him any room to think further.</p><br/><p>Zhao Boan never knew that he could run so fast, like a mad dog. Even the grass-lotus puppet was left far behind him.</p><br/><p>Just at this moment, he noticed that someone was not far in front of him. Like a drowning man who grabbed a straw, he would not miss the chance and shouted loudly, \"Help! Help!\"</p><br/><p>Qing Feng also noticed the figure in the front, but he didn’t intend to stop at all. He was also outraged.</p><br/><p>His mission had completely failed. The Ling Residence collapsed, the ancient treasure was missing, Xiao Shuren committed suicide, Qing Feng himself was severely injured, and the nether lotus seeds suffered a great loss.</p><br/><p>Qing Feng had been working for Grandmaster Dai and had accomplished numerous tasks. This was the first time that he had been so awkward. He was an arrogant guy, and the failures were a slap in the face.</p><br/><p>He was furious and resentful.</p><br/><p>If his opponent was Karakorum Savant, he would not be so furious. After all, it would be normal for him to lose to the first ever master swordsman ever.</p><br/><p>But who was Chu Zhaoyang?</p><br/><p>A nobody!</p><br/><p>He was wounded by a nobody’s sword!</p><br/><p>Not only his body, but his mind and spirit had also been wounded by this accident. These days he always woke up with nightmares at midnight. Fragmentary mind and spirit were taboos for elementalists, because mental recovery was far more difficult than physical recovery.</p><br/><p>The sky palace had always been the most mysterious palace.</p><br/><p>Moreover, Qing Feng was a grass-lotus puppet. His body was not his own, but consisted of grass and lotus, and therefore rejected his mind in many aspects. Many of his weird behaviors were due to such rejections.</p><br/><p>Usually he had to take medicine to restrain these adverse reactions.</p><br/><p>The medicine was prescribed by his master, who once told him frankly that so far he could not solve the problem of adverse reactions.</p><br/><p>After the injury, all the adverse reactions that had been restrained before immediately reappeared. Qing Feng realized that his body was like a broken machine that went out of control now and then. Sometimes his hands and feet came loose and became knotted grass ropes, or his body lost balance. Such incidents occurred endlessly. Otherwise he would have already killed this little bug.</p><br/><p>The wood elemental materials he had devoured had largely restored his elemental energy. Although not as effective as his master’s mud pool, the wood elemental energy he extracted from the materials was nourishing for his body.</p><br/><p>This place was far away from the dangerous Silver City. So there was nothing to fear.</p><br/><p>Silver City was really horrible. It seemed to be a shabby house that might fall down at any moment, but once you stepped into it, you would find that crisis and traps were everywhere.</p><br/><p>Seeing the figure ahead, Qing Feng didn’t pay much attention. He wouldn’t bother to kill them both.</p><br/><p>It was a pity that eating human beings could not restore his elemental energy. Qing Feng licked his lips in disappointment.</p><br/><p>Wood elemental materials were hard to find, but elementalists were everywhere.</p><br/><p>Qing Feng was annoyed that Zhao Boan cried for help and hid behind some passer-by.</p><br/><p>Little Bug, if you thought that anyone is competent to fight against me, then you’re too naive!</p><br/><p>With a grim smile, Qing Feng said ambiguously, \"I didn’t want to kill you. You asked for it!\"</p><br/><p>Qing Feng opened his palms and the grass cords stretched and almost covered Ai Hui like five whips.</p><br/><p>He was wounded by Chu Zhaoyang, which made him resentful towards all swordsmen. Now that he saw a bone sword in Ai Hui’s hand, his killing intent was stronger than ever.</p><br/><p>Ai Hui was happy when he realized, after a glance, that Qing Feng hadn’t recovered from his injuries. Ai Hui had absorbed two elemental elixirs in the last few days that greatly improved his elemental level. Moreover, he was devoted to in summarizing his understandings which largely improved his swordsmanship.</p><br/><p>So he shouted loudly, in a similar tone to Qing Feng, \"I didn’t want to kill you. You asked for it!\"</p><br/><p>And the Dragonspine directly confronted the grass cords.</p><br/><p>Qing Feng was surprised by Ai Hui’s shout, and became more furious.</p><br/><p>Their speeds were very fast. The five grass cords constituted a thick net and swept towards Ai Hui like a violent storm. But to his surprise, his enemy was not slower than him at all.</p><br/><p>The thick sounds of crashing was like rain rattling on banana leaves.</p><br/><p>Ripples of elemental energy appeared, spread and were smashed between them.</p><br/><p>At this moment, Qing Feng realized something weird. This guy’s swordsmanship was good!</p><br/><p>He couldn’t figure it out why so many strong swordsmen had emerged all of a sudden. They seemed to be neck and neck, but Qing Feng already wanted to quit, since he hadn’t fully recovered and he still feared swordsmen from the bottom of his heart.</p><br/><p>So once he encountered a master-hand, he wanted to escape.</p><br/><p>But then he noticed, in fear, an attraction to his grass cords coming from the guy’s sword. His grass cords were sucked in, making him unable to escape.</p><br/><p>What kind of swordsmanship was it?</p><br/><p>He felt more fearful.</p><br/><p>But Ai Hui felt fine. After all, Qing Feng had a solid foundation and great strength. The grass cords that stretched from his fingers were like the tentacles of an octopus that were extremely flexible and fast.</p><br/><p>Ai Hui realized that his stabs could hardly follow the grass cords’ speed. He had never met with an enemy whose attacks were so fast. With such a high frequency, there was no time for him to use any fancy moves, and he could only fight back with the basic stabbing attack.</p><br/><p>Crack, crack, crack!</p><br/><p>Sounds of explosions could be heard up in the sky. Each collision was accompanied by a light that flickered between the two.</p><br/><p>Realizing that he was on the disadvantageous side, he put his other hand into the fight. Ten grass cords immediately caught Ai Hui unprepared and whipped him several times.</p><br/><p>Qing Feng was overjoyed. The ten grass cords attacked towards Ai Hui at the speed of lightning.</p><br/><p>Ai Hui was awkward dodging the attack and was almost pierced by the cords several times.</p><br/><p>This made Qing Feng more excited. As long as his enemy was pierced by his grass cord, his blood could be drained within a short period of time.</p><br/><p>The ten grass cords were even more faster and transformed into an illusory image.</p><br/><p>Crack, crack, crack!</p><br/><p>The sound became louder, and the light shrouding Ai Hui became brighter.</p><br/><p>One second, two seconds…five seconds…ten seconds…</p><br/><p>Qing Feng found, in astonishment, that Ai Hui was wobbling and seemed as if he was about to fall, but he never really fell.</p><br/><p>Damn it! Why?</p><br/><p>Qing Deng began to feel anxious. His elemental energy was being consumed fast. He had accumulated this energy from the elemental materials he had just devoured.</p><br/><p>Once his elemental energy was used up, he could not even run for his life.</p><br/><p>So he suddenly started an even faster attack that suppressed Ai Hui and made him very awkward. But this time, he didn’t hesitate and decided to turn and run at once.</p><br/><p>Wheeze, wheeze, wheeze…</p><br/><p>Ai Hui was soaked in sweat. This was the first time that he’d encountered such a high-frequency attack. If it were not for the improvement of his swordsmanship, he would be doomed this time.</p><br/><p>But luckily, he managed to withstand the attack. When his enemy’s moves were at their fastest, he totally reacted with his instincts. The speed at which he stabbed with his swords was faster than his thinking.</p><br/><p>Under such high pressure, Ai Hui could feel the change in his moves. His stabs became faster, and the gestures and angles of his attack became more reasonable.</p><br/><p>Ai Hui, soaked in sweat, breathed heavily. He stared at Qing Feng who was running away as if he was a priceless treasure.</p><br/><p>Trying to escape?</p><br/><p>Ai Hui smiled evilly. No precious things could escape from him!</p><br/><p>Flapping his Starry Gem Swordwings, he rushed forward like lightning.</p><br/><p>The Dragonspine was as flexible as a snake. It stabbed forward and kept dispersing the air in front of Ai Hui to reduce the resistance. Thus, Ai Hui’s speed was again raised to a higher level.</p><br/><p>Qing Feng, who was fleeing, heard the thundering sound behind him. He turned back and was scared by what he saw.</p><br/><p>Behind them, Zhao Boan was dumbstruck to see that the grass-lotus puppet that was trying to kill him was now running for his life in a huge panic.</p><br/><p>And then, the swordsman also rushed out at an amazing speed. He watched the swordsman speeding up and up and up in a supernatural way. Suddenly, after a deafening thunder, the air around him suddenly exploded, creating a ring-shaped shock wave.</p><br/><p>The ring-shaped shock wave seemed to freeze in the air, but the figure in the circle disappeared.</p><br/>\n</div>"}