{"title": "Chapter 384: Awkward Silence", "id": 384, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-384-awkward-silence", "volume_title": "Volume 4", "body": "<h1>Chapter 384: Awkward Silence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 384: Awkward Silence</p><br/><p>Translator: Irene Editor: TYZ/KLKL</p><br/><p>Peace City, Swordsman Training Hall.</p><br/><p>\"Morning, has everyone seen the latest news through the mirage bean pod?\" Fatty pulled a chair out and sat down before shouting, \"Lou Lan, a cup of tea, thanks!\"</p><br/><p>\"Morning Fatty, any sugar for you?\"</p><br/><p>Fatty smiled widely. \" More, please. Thanks, Lou Lan.\"</p><br/><p>Among these people, they had to fawn and favor Lou Lan the most, since he had control over their elemental food.</p><br/><p>Lou Lan poured a cup of tea and placed it in front of Fatty after adding some sugar. \"Fatty, your tea.\"</p><br/><p>\"Fatty, you have to cut down on sugar,\" Sang Zijun persuaded. \"You’re severely overweight.\"</p><br/><p>Fatty took a big gulp without the least care in the world. \"Little Sang Sang, life is shoooort,\" he cried, dragging out the last syllable.</p><br/><p>Jiang Wei sipped on his tea before commenting, \"What Madam Ye has done has probably made her rather popular, but at the same time she’s probably offended all the other aristocratic families.\"</p><br/><p>His indifferent tone carried a trace of admiration.</p><br/><p>In these past two days, Madam Ye announced her plan of Master’s Glory and opened it to the whole of the Avalon of Five Elements. Anyone could enter Master’s Glory regardless of their origin and background as long as they were gifted, capable, and passed the initial selection.</p><br/><p>Immediately upon the release of the news, it captured the whole Avalon of Five Elements’s attention.</p><br/><p>The aristocratic families kept quiet, but the new citizens were celebrating.</p><br/><p>The treatment of new citizens was incomparable to aristocratic families in all aspects. Past selections had always favored the aristocratic families and the new citizens had long felt resentful. But at that time, the Avalon of Five Elements did not believe in internal worries and foreign aggressions, so the higher-ups did not pay attention to the new citizens’ appeals. In regard to their attitude toward new citizens, the higher-ups were split.</p><br/><p>Some felt that new citizens occupied the majority of the Avalon of Five Elements and so they had to be treated better since they were the future of the Avalon of Five Elements. Others, however, believed that the new citizens were unable to represent the Avalon of Five Elements. They were often associated with Old Territory and hence unable to truly fight for the Avalon of Five Elements. Ye Baiyi was the best example.</p><br/><p>Madam Ye’s move evoked an intense response from the new citizens because they saw it as a new beginning.</p><br/><p>Jiang Wei was a new citizen and naturally admired Madam Ye’s conduct.</p><br/><p>Duanmu Huanghun sneered. \"Don’t be naive, is it really open to the public just because she says so? She’s already made deals with other aristocratic families. They have a silent agreement and she’s merely placating the public with these words. But, this woman is formidable indeed.\"</p><br/><p>Jiang Wei knew that Duanmu Huanghun was right but he didn’t mind. He was worried about something else. \"I wonder if she can stabilize the situation? Is Master’s Glory really that powerful?\"</p><br/><p>\"Do not participate in it.\"</p><br/><p>Shi Xueman’s voice sounded from behind the group. Her hair was wet and a white towel was hung around her neck. She’d just come out of the shower after a training session.</p><br/><p>Lou Lan was very happy to see her. \"Morning, Xueman. Breakfast for you?\"</p><br/><p>Shi Xueman smiled. \"Morning, Lou Lan. One set please. Thank you!\"</p><br/><p>A gossipy expression flashed across Fatty’s face. \"Any inside news?\"</p><br/><p>Those around had a curious look on their face too. Why would Iron Lady say that? They knew that she had special news and connections.</p><br/><p>\"My teacher warned me repeatedly.\" Shi Xueman tore the pastry into smaller pieces and ate them seriously.</p><br/><p>The atmosphere instantly became solemn. Shi Xueman’s teacher was Grandmaster An Muda. A Grandmaster’s repeated warnings about Master’s Glory toward his student surprised everyone.</p><br/><p>Shi Xueman continued, \"Teacher’s words have always been more reserved, but I understand the meaning behind them. Do not ask me for the reason because I don’t know either. Teacher did not mention it.\"</p><br/><p>Everyone pondered over her words.</p><br/><p>Shi Xueman turned toward Duanmu Huanghun. \"Didn’t your teacher say anything, Bangwan?\"</p><br/><p>\"No.\" Duanmu Huanghun shook his head and said self-mockingly, \"My teacher… Hah, he’s most probably forgotten about me already. But that’s good too, or else I wouldn’t be standing here.\"</p><br/><p>\"Ignore Master’s Glory. Although I think Madam Ye is powerful, only time will show the results.\" Shi Xueman added, \"The situation at the front line isn’t too good.\"</p><br/><p>\"What happened?\"</p><br/><p>Everyone was more concerned about the front line than the complicated internal fightings and schemings that were going on in Silver City.</p><br/><p>Shi Xueman ate her pastry seriously without even lifting her head. \"There’s a powerful figure named Red Devil in Blood of God now. We’ve lost a lot because of him.\"</p><br/><p>Jiang Wei asked in shock, \"Even Shi Beihai?\"</p><br/><p>Shi Xueman placed her food down and answered gravely, \"It appears that he is avoiding a fight with Father by keeping away from Father’s protection zone. Cloud Cicada Division sustained greater losses, with a few captains and a vice division leader injured, so Father suspects the opponent is an acquaintance.\"</p><br/><p>Everyone looked extremely solemn.</p><br/><p>The captains of the Thirteen Divisions were all the cream of the crop. They were basically powerful players with excellent skills. As for the vice division leaders, they were either Masters or pseudo Masters. Yu Jin and Tong Gui, for example, were just a step away from becoming Masters and could break through at any time.</p><br/><p>Duanmu Huanghun asked abruptly, \"Are the combat masters activated yet?\"</p><br/><p>Shi Xueman replied, \"Yes but the opponent is very sly and seems to be very familiar with our habits, hence they escaped a few times. Plus, the Masters who have had a match with him are very worried as his skills are improving extremely quickly.\"</p><br/><p>The daily affairs of a combat division were mostly managed by three vice division leaders. When a vice division leader became a Master, they could either choose to continue serving their role, or if they wished for more time to train, they would become combat masters.</p><br/><p>Combat masters had nothing much to take care of so they had ample time to train, and adequate resources were provided as well. Only important missions would require them to step up.</p><br/><p>For those who were certain about going down the training path, becoming a combat master was a very decent choice.</p><br/><p>Even the division leaders had to show respect toward the combat masters. The former had no power to press the latter into service, and the number of combat masters in a combat division would depend on the capability of the division leader.</p><br/><p>North Sea Division used to have only one combat master, but after wielding power, Shi Beihai managed to increase the count to six. He quickly won the support of his troops and North Sea Division lept to the top within a short period of time.</p><br/><p>Jiang Wei asked, \"What about God-subduing Peak?\"</p><br/><p>His experience on God-subduing Peak had left a deep impression.</p><br/><p>\"The opponent’s found its weakness and Father is really worried about this.\" Shi Xueman added, \"God-subduing peak is very powerful but isn’t very effective when dealing with a single, small target.\"</p><br/><p>Duanmu Huanghun spoke up after some thinking, \"They might have been told by Ye Baiyi. No one would be more familiar with your father and his subordinates than him.\"</p><br/><p>The situation at the front line was what everyone was concerned about. Failing to keep hold meant a disaster for everyone. How could there be intact eggs when the whole nest had collapsed?</p><br/><p>An awkward silence filled the table.</p><br/><p>In response, Wang Xiaoshan hurriedly changed the topic, \"How’s the Wilderness expansion project coming along?\"</p><br/><p>\"Luckily we weren’t the first batch to go,\" Fatty commented with an exaggerated look on his face. \"You don’t know how many died there, it was disastrous.\"</p><br/><p>Dunmu Huanghun laughed grimly. \"The higher-ups meant for this to happen. It doesn’t matter how many cannon fodders lose their lives.\"</p><br/><p>Another awkward silence took over as no one knew what to say.</p><br/><p>Shi Xueman finished her food, pulled out her chair and stood up. \"I’ve gathered some inheritances and absolute arts so go choose from them yourselves. We have to use whatever time we have to train before Ai Hui comes back! Lou Lan, supervise Fatty.\"</p><br/><p>Lou Lan cheered, \"No problem!\"</p><br/><p>With a defeated look on his face, Fatty asked, \"Why me again?\"</p><br/><p>\"Do you want to learn the absolute arts?\"</p><br/><p>\"Yeah…\"</p><br/><p>\"Then practice hard. Lou Lan, draw up a training plan!\"</p><br/><p>\"No problem!\"</p><br/><p>Duanmu Huanghun seemed to have realized something and started mumbling to himself, \"I know! The aristocratic families suffered great losses and are starting to face a manpower shortage. They would need to replenish themselves with new, fresh blood in order to live on! No wonder no one objected to Madam Ye’s plan…\"</p><br/><p>Everyone looked at him before resuming their respective work.</p><br/><p>Awkward silence.</p><br/><p>Standing in the training hall’s garden, everyone looked at the mountainous pile of books and was astonished. They looked at Shi Xueman somewhat suspiciously. To the aristocratic families, absolute arts were the real riches. They were the key to their continued existence.</p><br/><p>\"Most of these are from my family’s collection. I took all of them out with the permission of father. They’re yours to keep so please treasure them and practice hard.\"</p><br/><p>Everyone looked at her but no one dared to make a move. Even Fatty, the money grubber, had a solemn look on his face.</p><br/><p>Shi Xueman looked carefree. \"This is all of the family’s inheritance, but what would become of the family if the Avalon of Five Elements is destroyed? These books won’t mean anything when that happens. They would be no different from the artifact remnants left over from the Cultivation Era. In that case, we might as well make use of them when they’ve still got value. There’s nothing to lose.\"</p><br/><p>The doubt vanished from the faces of those who were listening, and was replaced by smiles and excitement. Everyone was looking forward to it.</p><br/><p>\"Haha, if only aristocratic families were as good as Iron Lady’s family!\"</p><br/><p>\"That name is not for you to call! Kneel before your goddess!\"</p><br/><p>\"Long live the Goddess!\"</p><br/><p>...</p><br/><p>A faint smile appeared on Shi Xueman’s face. She set the gaze far away, worry somewhat filling her heart.</p><br/><p>How was Ai Hui doing? He shouldn’t be in trouble right?</p><br/><p>At this point, she laughed involuntarily.</p><br/><p>Why was she even worried about that when she should be worrying about the trouble her people might cause him?</p><br/><p>She said, in all alertness, \"From today onwards, increase your training capacity by thirty percent.\"</p><br/><p>Cheers instantly turned into cries.</p><br/><p>\"Nooo, Goddess!\"</p><br/><p>\"You’re asking us to die!\"</p><br/><p>Shi Xueman responded with a steady face, \"I will train with you guys and increase mine by forty percent.\"</p><br/><p>\"Ahh let me die. I don’t want the absolute arts anymore.\"</p><br/><p>\"Ahhhhhhh, my ideal goddess is gone just like that. Scary Iron Lady has returned!\"</p><br/><p>No one knew when, but Duanmu Huanghun was already squatting before the pile of books.</p><br/><p>\"I’ve seen this.\"</p><br/><p>\"Learned this.\"</p><br/><p>\"Seen it.\"</p><br/><p>\"Done it.\"</p><br/><p>...</p><br/><p>\"Eh, this is new. Yes, I haven’t seen it. Interesting. Oh, I’ve read it.\"</p><br/><p>Awkward silence.</p><br/>\n</div>"}