{"title": "Chapter 383: Choice and Path", "id": 383, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-383-choice-and-path", "volume_title": "Volume 4", "body": "<h1>Chapter 383: Choice and Path</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 383: Choice and Path</p><br/><p>Translator: Irene Editor: TYZ/KLKL</p><br/><p>The stone statue was gone, replaced by black armor.</p><br/><p>Ai Hui had never seen this type of armor.</p><br/><p>It looked like a human skeleton, its whole body made up of a type of unknown black bone. It was dark and rough. These black bones of different sizes were actually naturally woven together. Completely sealed off, the skull had a slightly indented surface and its empty eye sockets were like two black whirlpools, mildly captivating. A ring of sharp bone grew on top of the head, pointing straight at the sky like a crown.</p><br/><p>There was a pair of wide, black wings attached to the back of the armor. Thin, black spicules grew on the solid framework and covered it like black feathered wings.</p><br/><p>Rough, evil, strong… what a freak!</p><br/><p>Ai Hui swallowed his saliva with some difficulty. Thinking about what he’d just seen made his heart feel weak. There’s no way this black armor is the demonic god’s body… right?</p><br/><p>A body becoming an armor… How economical!</p><br/><p>No matter how he looked at it, the black armor before his eyes possessed an evil aura that suited villains guilty of heinous crimes.</p><br/><p>Ai Hui felt his mind was in a state of confusion as there was too much information to take in. The scenes he’d seen were likely to be messages left by the demonic god.</p><br/><p>But, demonic god reviving? Sounded like a load of bull crap.</p><br/><p>Alright, since that was the case, he would play along seriously.</p><br/><p>He sorted his thoughts out according to his own understanding of these chaotic, primitive, blurry and strange images.</p><br/><p>The bandage used to be the canvas which the demonic god was painted on, and the demonic god came alive and walked out of the portrait after some thousands of years of worship. Some time passed again and the demonic god realized how terrifying the world was, upon witnessing a big battle between cultivators. And the demonic god was spooked!</p><br/><p>At this point, Ai Hui paused and suddenly felt that the demonic god wasn’t very scary after all. His tensed heart loosened up significantly.</p><br/><p>A demonic god that knew fear seemed less threatening indeed.</p><br/><p>After being frightened, the demonic god stayed devotedly in the valley and even cleaned up the battlefield and picked up a bunch of artifacts remnants, remnant books about spells and so on.</p><br/><p>Momentarily, Ai Hui felt close to the demonic god. They spoke the same language and even the cleaning up of the battlefield was something he did often.</p><br/><p>The demonic god trained diligently for countless years and when he finally felt a surge in his abilities, he got ready to step out of the valley. Yet, he realized that the skies were about to fall apart and the spiritual force in the world was dissipating. Thus, unwilling to die just like that, the demonic god started preparing his revival plan, in the hope of dodging this major ordeal.</p><br/><p>Ai Hui felt an indescribable sympathy toward the demonic god. Having landed in this plight, he did seem a little pitiful.</p><br/><p>He’d undergone thousands of years of formation before arriving on this world, and had been frightened, by the cultivators’ battle, into residing and training in the valley for yet another thousands of years. And as he was finally about to leave, the heavenly law started to crumble...</p><br/><p>Pitiful. How pitiful!</p><br/><p>Ai Hui looked at the black armor ruefully before placing it simply into the sand compass. He also placed the remaining drop of the demonic god’s blood back into the sand compass.</p><br/><p>To feel sorrowful was one thing and to gloat was another. Ai Hui had not lost his reason.</p><br/><p>He was dealing with a demonic god.</p><br/><p>It would be foolish of him to underestimate a demonic god.</p><br/><p>Was what he’d seen real? Debatable. It was certain, however, that regardless of authenticity, the images were what the demonic god wanted him to see.</p><br/><p>The demonic god could easily pull him into that fantasyland, so surely he could also easily create confusing scenarios. If those scenes were false, what would the demonic god’s intentions be?</p><br/><p>Ai Hui did not want to risk his life testing the demonic god’s limits.</p><br/><p>Especially in regards to his revival plan, the demonic god would definitely achieve it by hook or by crook. The liquid sealed within the crystal was the demonic god’s blood and also the seed for his revival.</p><br/><p>How would the demonic god be revived?</p><br/><p>Ai Hui felt that the likeliest method was to seize another’s body!</p><br/><p>Perhaps he was thinking too much, but Ai Hui did not want to take the risk. Except, the bandage had been following him for a long time and had even saved his life, so it was definitely safe.</p><br/><p>However, be it the blood of the demonic god or the black armor, nothing was certain about them.</p><br/><p>Ai Hui’s abilities were going through a period of steady improvement. To be exact, it was currently in a skyrocketing phase, so it wasn’t worth taking this risk.</p><br/><p>Choosing the demonic god’s blood could either bring him instant success or leave him with no hope of reprieve.</p><br/><p>Ai Hui hoped that he would never need to use them because that would mean that he was in a perilous situation, so precarious that he had to place his bets on them.</p><br/><p>Ai Hui was delighted. It was as if he’d finished a film from the mirage bean pod, and the story within was a very memorable one which filled him with sorrow and tears.</p><br/><p>At least the scene was rather huge.</p><br/><p>The battle scene between the cultivators was really shocking. Seeing the sky-shattering rays produced by the swordsmen really made Ai Hui’s own sword rays seem like tiny bean sprouts.</p><br/><p>The pleasure he’d felt from his recent breakthrough vanished in a puff of smoke.</p><br/><p>Shaking his head, Ai Hui sat himself down again, activated the patriarch grass and entered Grass Hall. As usual, he stepped into the Hall of Ancient Records to look for information. The fusion elemental energy within his body was about to be used up, but he still wasn’t able to find anything.</p><br/><p>He saw that there was still half a shelf left to look through, but this time he wasn’t overly impatient. Instead, he felt hopeful.</p><br/><p>Having witnessed the cultivators’ battle, Ai Hui’s restless heart regained its calm.</p><br/><p>Many things seemed insignificant when viewed from a historical perspective. How many people today would even remember the names of those cultivators who had the ability to destroy the world?</p><br/><p>Legends belonged to heroes, and he was just an ordinary man.</p><br/><p>He checked through the information steadily and trained steadily. He did his utmost best every single day, and left worrying about the outcome to the future.</p><br/><p>Feeling peaceful, Ai Hui waited for his elemental energy to recover before starting his sword training.</p><br/><p>He’d read the swordplay manuals and had witnessed the swordsmanship of Karakorum Savant, the first ever master swordsman in the whole of the Avalon of Five Elements’s history. He had also seen the exceptional sword consciousness sealed within the Ye Residence, he’d crashed his way through sword formations, fought with the Ling residence, She Yu and even the grass-lotus puppet, Qing Feng…</p><br/><p>He had learned a lot and felt more appreciative. He needed time to confirm the swordsmanship insights he’d gained during this period.</p><br/><p>As such, Ai Hui stayed in this nameless valley to search for the notebook, train, ponder and consume the elemental energy from the remaining elemental elixirs.</p><br/><p>His days were extremely packed, but he did not feel tired at all. In fact, he felt very enriched. His method of using his sword to absorb elemental energy had been perfected and named [Sword-style Breathing Technique].</p><br/><p>The elemental energy sword pills were strengthening non-stop, along with the range from which Ai Hui’s sword rays could attack. The range had increased from its initial six hundred feet to over nine hundred feet.</p><br/><p>These few days, Ai Hui had been using this move to hunt, and the nearby prey in flight had all been taken down.</p><br/><p>Swordsmanship wasn’t like archery. Ai Hui had no intention of blindly increasing his range of attack.</p><br/><p>The most unique aspect of swordsmanship was its variability. In the Cultivation Era, swordsmen produced the most variable kinds of systems. Ai Hui had to find his own, and this was the greatest problem he was currently facing.</p><br/><p>His sword moves weren’t weak. With the addition of [Sword-style Breathing Technique], his moves became even more outstanding. But his moves, from [Heavenly Thrust] to</p><br/><p>[Oblique Slash], [Crescent Moon] to [Six Moons] and [Dust Fall], [Night Epiphyllum], [Gale Bat Slash], [Red Muslin], [Sword Chime], [Fragmented Sword], [Three Yin Yang Sword Ring] and so on, did not form a system. Some were moves from the sword pill, while others were created in passing. They were all powerful moves but were very scattered and did not form a system.</p><br/><p>Ai Hui tried to form his own system, a huge task to undertake. There wouldn’t be any effect short term but it was extremely important to him in the long run.</p><br/><p>Karakorum Savant served as the best example.</p><br/><p>Yet, his circumstances were more challenging than Karakorum Savant’s. Her swordsmanship originated from the Ye Residence, and Ye Lin had been perfecting this project unceasingly for generations. Thus, Karakorum Savant had been practicing the completed system of swordsmanship since young. She became the first ever master swordsman largely due to Ye Residence’s swordsmanship inheritances. The hard work of many generations finally bore fruits.</p><br/><p>Ai Hui wasn’t so lucky. From the time he’s stepped into the Wilderness to the day he met Karakorum Savant, whatever insights he’d gained in regard to swordsmanship were obtained personally.</p><br/><p>He was walking a different path.</p><br/><p>Ai Hui was very clear of the fact that his path was different from that of Karakorum Savant. He would read swordplay manuals and try to understand sword formations, but instead of imitating, he tried developing his own moves from his comprehension of things.</p><br/><p>This was an arduous, rugged path, but Ai Hui did not hesitate at all.</p><br/><p>As Ai Hui was training hard in the valley, the Avalon of Five Elements was experiencing raging turbulence.</p><br/><p>The series of changes dazzled everyone.</p><br/><p>The battle between the Ling and Ye families erupted and then ended abruptly. Great Elder’s profound scheme and terrifying means of doing things intimidated numerous aristocratic families. Elder Ling resigned from his post in the Elders Guild and was dispatched to the front line. Such a huge residence disappeared just like that. Its sudden collapse had everyone sighing and feeling terrified.</p><br/><p>Were there aristocratic families who dared to believe they were stronger than the Ling family?</p><br/><p>But the Elders in the Elders Guild were mostly reserved and dared not to act rashly.</p><br/><p>Madam Ye’s prestige soared. Because of her splendid performance in this \"riot\", she started moving to the foreground. She received her first mission to host Master’s Glory.</p><br/><p>No one had objections. Great Elder was in his most powerful state now, so standing up to him now meant death.</p><br/><p>Many were guessing that Great Elder was laying a path for Madam Ye. As the host of Master’s Glory, wouldn’t she also become half a teacher of the Avalon of Five Elements’s future Masters?</p><br/><p>Great Elder did not pull back. What he did next confirmed people’s guess.</p><br/><p>Great Elder headed toward the Pagoda of Hidden Edge, which was deep within Silver Mist Sea, to have a deep, overnight conservation with Yuchi Ba before leaving the next morning.</p><br/><p>Three days later, Karakorum Savant was appointed as the division leader of Sky Edge Division and she was renamed \"Karakorum Polaris\".</p><br/><p>Two more days passed and Silver Soldier became the division leader of Infantry Division. Fame followed merit and he started rebuilding his combat division.</p><br/><p>Within a short period of time, a small team that had surrounded Madam Ye appeared within the people’s field of vision. The path laid down for her by Great Elder was a clear display of his intentions.</p><br/><p>Soon after the circulation of Madam Ye’s brave speech, she became an overnight sensation, leaving many to look forward to her performance.</p><br/><p>Just as everyone was waiting for Madam Ye to take action, Madam Ye did something that shocked the world.</p><br/>\n</div>"}