{"title": "Chapter 389: Inquiring Information", "id": 389, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-389-inquiring-information", "volume_title": "Volume 4", "body": "<h1>Chapter 389: Inquiring Information</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 389: Inquiring Information</p><br/><p>Translator: Cynthia Editor: TYZ/CakeHermit</p><br/><p>Zhao Boan said reverently, \"Boss, we are close to Crooked River City, where craftsmen are the most reputable. I heard that the living conditions of the local craftsmen is not good, especially in recent days. One reason is that they are short of raw materials and it’s hard to collect all the ingredients, among which the wood elemental materials are the easiest to find, but the earth and fire elemental materials have almost disappeared from the market. As a result, they cannot produce anything but simple and primary goods. The other reason is that the trade route is cut off now and the total population has dropped, so buyers are very few. Now, their incomes can barely support their families, which has driven many people to find opportunities in the Wilderness, although the majority are still hesitating about it.\"</p><br/><p>Hearing what he said, Ai Hui couldn’t understand. \"What is holding them back?\"</p><br/><p>Zhao Boan explained, \"The climate of the Wilderness is unpredictable and there are no cities of a proper scale located there. Even if they go, they do not have the ability to build a workshop in those conditions. In addition, there have recently been many casualties in the Wilderness. It will be extremely risky for them since they cannot protect themselves if they run into danger. That’s why they are still hesitating.\"</p><br/><p>Ai Hui said in a low voice, \"We will be going to the Wilderness in the near future. If anyone wants to go with us, we can guarantee his or her safety. In your opinion, what kind of craftsman do we need?\"</p><br/><p>This answer excited Zhao Boan. Although he foresaw that Boss would go to the Wilderness, he was still thrilled when he admitted it in person.</p><br/><p>Taking a deep breath, he calmed down and said after thinking for a second, \"My understanding of Boss is limited, so I can only give opinions from my point of view. The Wilderness is home to numerous dire beasts that will be our daily targets for hunting, so elementalists who have the ability to turn dire beast corpses into food are essential to our team.\"</p><br/><p>Ai Hui nodded and said, \"We don’t need extra hands on that.\"</p><br/><p>Ai Hui could deal with the dire beasts and Lou Lan was good at cooking.</p><br/><p>Zhao Boan continued, \"We need masons for building camps and constructing a city.\"</p><br/><p>Ai Hui nodded again, \"We have an expert in that field as well.\"</p><br/><p>Wang Xiaoshan was outstanding and trustworthy in that respect, for he had been practicing his skill throughout these years.</p><br/><p>That did not surprise Zhao Boan. His boss seemed wealthy, so it was impossible that he was all alone. He continued, \"In that case, we need several craftsmen who can produce weapons, especially weapon craftsmen who are familiar with metal elemental energy and Grass-grade weapons, craftsmen who are familiar with wood elemental energy. Also, we need farmers with high-standard skills so that more people can count on them. Besides these, two physicians specializing in wood and water elemental energy respectively are also required. Herbalists are also essential to us, because the Wilderness will be short of all kinds of herbs for a long period of time.\"</p><br/><p>Ai Hui thought about it and asked, \"What is the current price for hiring these elementalists?\"</p><br/><p>Zhao Boan had compiled a detailed and comprehensive report. \"Different prices for different professionals. The price for physicians is the highest, and the better physicians have already been employed by others. According to the market, to hire a physician, we have to pay about five hundred Heaven Merit Points each year for at least 3 years. After all, Wilderness is our destination, so risks are unavoidable.\"</p><br/><p>Ai Hui was shocked by the price, \"So expensive!\"</p><br/><p>Then it would be one thousand five hundred Heaven Merits Points for three years, which was a great deal of money.</p><br/><p>He had twelve thousand Heaven Merit Points with him in total, so that was a tenth of his wealth altogether.</p><br/><p>Zhao Boan nodded. \"That is so. Physicians have always been popular because they are vital to every team. Physicians with rich experience have long since been hired.\"</p><br/><p>Ai Hui said without hesitation, \"We have physicians. How about others?\"</p><br/><p>Lou Lan was equipped with high-standard healing skills.</p><br/><p>Zhao Boan relaxed and continued, \"Good. The physicians within our pool of choice barely meet the average standard. As for the other professionals, herbalists are not cheap - about three hundred Heaven Merit Points per year. The Jadeite Forest has almost all the high-class herbalists, but normally they are not willing to go to the wilderness. Farmers are easy to find, but the superior ones also live in the Jadeite Forest. Their price is acceptable, which is one hundred Heaven Merit Points per year. We need at least five. Those who can plant elemental energy beans will cost even more, at least five hundred Heaven Merit Points per year, and are hard to find. Grass-grade weapon craftsmen and weapon craftsmen can be hired at two hundred Heaven Merit Points per year. Their price is cheaper because Grass-grade weapon craftsmen can only produce low-level weapons and weapon craftsmen lack the necessary materials.\"</p><br/><p>Ai Hui did the math and said, \"We need an herbalist, five farmers, a Grass-grade weapon craftsman and a weapon craftsman, which makes the price amount to one thousand two hundred Heaven Merit Points per year.\"</p><br/><p>Ai Hui didn’t bother to count in farmers who could plant elemental energy beans.</p><br/><p>Zhao Boan reminded Ai Hui, \"Those prices are only for the average professionals. Superior ones would charge double or even higher. Besides, we’d better get a cook, because the Wilderness is short on elemental energy beans. It will be more practical for us to take elemental energy food to support our practice.\"</p><br/><p>Ai Hui smiled and said, \"We have an excellent cook.\"</p><br/><p>Who could be a better cook than Lou Lan?</p><br/><p>Ai Hui thought for a second. \"You are from the Jadeite Forest, so you should be familiar with Asakusa City.\"</p><br/><p>Zhao Boan responded quickly, \"Yes.\"</p><br/><p>Ai Hui said, \"Our destination is Asakusa City, so we will hire farmers and herbalists there. We can seek out weapon craftsmen and Grass-grade weapon craftsmen in the cities we will pass by on our journey. If there are any proper ones, we can hire them.\"</p><br/><p>Ai Hui and Lou Lan were capable of making weapons, but Ai Hui couldn’t spend much time on doing so. Producing weapons would cost too much time that could be used to practice and Lou Lan was already overloaded.</p><br/><p>Zhao Boan nodded and bore it in mind.</p><br/><p>\"Are you going to the Asakusa City?\"</p><br/><p>Qing Feng asked from behind Ai Hui.</p><br/><p>Ai Hui turned around and said, \"Yes, do you have enemies there?\"</p><br/><p>Qing Feng didn’t answer and was lost in his thought.</p><br/><p>Crooked River City was a small city located on the riverbank of the branch of the Silver Mist River. The city was surrounded by the river on three sides; it encircled the city in an \"n\" shape and the city had been named after it.</p><br/><p>This unique feature of the landscape infused Crooked River City with intensive metal elemental energy, which was beneficial to producing weapons. That was why the city was home to plenty of weapon craftsmen and Grass-grade weapon craftsmen.</p><br/><p>The weapons of Crooked River City enjoyed a certain reputation in the Silver Mist Sea.</p><br/><p>Unfortunately, as a branch channel, the Crooked River’s metal elemental energy was weaker than that of the trunk stream. Although the advantage of the landscape improved its metal elemental energy, it was hard for the city to further enhance its metal elemental energy.</p><br/><p>Workshops along the Crooked River were all closed except for a few. The whole place was desolate.</p><br/><p>In order to practice, Ai Hui found an independent courtyard so that others would not be scared by Qing Feng’s appearance. Zhao Boan was sent to inquire about the market information and hire weapon craftsmen and Grass-grade weapon craftsmen.</p><br/><p>Oddly enough, the Elders Guild had issued an order to arrest She Yu, but there was no such thing for Qing Feng.</p><br/><p>Ai Hui was curious, so he led the topic to it. \"Those from the Blood of God are under surveillance in the Avalon of Five Elements. Why can you be so free as a disciple of Grandmaster Dai?\"</p><br/><p>Qing Feng smirked. \"Who dares? Although Madam Ye has complained about Grandmaster Dai out loud, she still doesn’t dare to make any trouble with him. An Muda is about to die, so if Grandmaster Dai is offended and wants to strike the Avalon of Five Elements, no one would be safe.\"</p><br/><p>Ai Hui was shocked that An Muda was about to die. This would trigger turmoil in the Avalon of Five Elements. The Avalon of Five Elements could stay peaceful not because of the Elders Guild or God-subduing Peak, but because of An Muda. What would it become if An Muda died?</p><br/><p>This was beyond Ai Hui’s imagination.</p><br/><p>Ai Hui was shocked by the news and his mind wandered the whole day because of it. He finally understood why the Elders Guild had issued the Master’s Glory and the city expansion order. This was the reason.</p><br/><p>Without its patron saint, the Avalon of Five Elements would confront an even tougher situation.</p><br/><p>By nightfall, Zhao Boan had not yet returned and Ai Hui returned to his senses.</p><br/><p>Qing Feng mocked, \"Your subordinate must have fled.\"</p><br/><p>Ai Hui guessed that Zhao Boan must have encountered some accident, because after getting along with him for several days, he believed that Zhao Boan didn’t intend to leave.</p><br/><p>\"Don’t count on me. I’m your sparring partner, not your subordinate.\"</p><br/><p>Qing Feng was gloating obviously.</p><br/><p>Ai Hui glanced him and said, \"You’d better stay here. If you run away, I will report you to the Elders Guild. Let’s see if they really are that scared of Grandmaster Dai.\"</p><br/><p>Hearing that, Qing Feng’s face turned pale. Creating such a disturbance in Silver City, he had been worried all this time that the Elders Guild would hunt him down. Although he was not in the arrest order, he’d heard from the others that the Elders Guild was very likely to choose to arrest him as well. Qing Feng’s power was largely reduced now. If he encountered any powerful elementalists, he would be defeated easily.</p><br/><p>The thought of running away had completely vanished from Qing Feng’s mind. By staying with Ai Hui, he at least didn’t need to worry about his safety.</p><br/><p>Ai Hui flew to the district where many weapon craftsmen lived and asked the shop owners about Zhao Boan. It didn’t take him too long to figure out what had happened.</p><br/><p>Zhao Boan had been kidnapped!</p><br/><p>Ai Hui’s face grew serious.</p><br/><p>Although Zhao Boan was the newly hired manager, he’d already became a member of the team. A team member being kidnapped triggered Ai Hui’s intent to kill, but he didn’t show his anger. Instead, he focused on asking about the minute details of the situation.</p><br/><p>\"What a sad story! Many years ago, Old He produced a Heaven-grade weapon, but it led his whole family to ruin. Some members of the family died and others were severely injured. Only one blind son survived. The son, Blind He, is a brilliant guy. Although blind, he produced a Heaven-grade weapon. Unfortunately, this news was discovered by the bandits of Sky Capital Peak, so they kidnapped him. Your manager unluckily happened to encounter the kidnapping and was also brought away. Don’t bother to think about saving him. Those from Sky Capital Peak are all cruel killers. You will also be killed if you insist on going there. No one here would try to challenge them. Gosh, how can we survive in such troubled times…\"</p><br/><p>Blind He’s workshop was in a total mess, almost ruined.</p><br/><p>In Peace City, the impact of war only influenced the price of commodities. Here, within less than one year, the public security had declined sharply. Bandits were everywhere and could even openly kidnap people. The residents here were too afraid to contend with them.</p><br/><p>Ai Hui knew that as time went by, the situation here would only get worse. The city would be left behind and become a nest of chaos and sin.</p><br/><p>No one could change it.</p><br/><p>Ai Hui thanked the shop owner and left.</p><br/><p>Ai Hui walked back to the street. Having confirmed the location of Sky Capital Peak, he disappeared into the dark night.</p><br/>\n</div>"}