{"title": "Chapter 398: Grass Bandits", "id": 398, "volume": 4, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-398-grass-bandits", "volume_title": "Volume 4", "body": "<h1>Chapter 398: Grass Bandits</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 398: Grass Bandits</p><br/><p>Translator: Irene Editor: TYZ, KLKL</p><br/><p>Qing Feng watched Ai Hui attentively as his sword-style breathing technique posture was simply too odd. While he’d already seen it many times, he just couldn’t help but feel curious. Elemental energy was being absorbed through the sword and added into the circulatory cycle revolution. He’d never heard of such a technique.</p><br/><p>He’d always felt that Ai Hui kept many secrets and behaved mysteriously, but when he tried to recall, he realized that Ai Hui’s actions appeared very normal. What he found weirdest was the fact that he felt a sense of familiarity around Ai Hui, as if he’d seen him somewhere before. But his memory failed him regularly, so even if he felt that he’d seen something before, he simply couldn’t remember the details.</p><br/><p>Ai Hui was the last to complete his circulatory cycle revolution as his sword-style breathing technique needed more time than a regular cycle.</p><br/><p>Seeing that the others were waiting for Ai Hui to complete his circulatory cycle revolution, the waiting elementalists instantly understood that Ai Hui was the leader of this group.</p><br/><p>Ai Hui opened his eyes and saw the elementalists standing respectfully by on side, and knew what was going on.</p><br/><p>But he was still not used to receiving such treatment.</p><br/><p>Because of these elementalists here, Ai Hui knew that they were in Palette Cloud Village and were still quite far from Asakusa City, a fact that made everyone happier.</p><br/><p>Ai Hui asked more about the stowaway business, about how good it was, how many people they could stow away in a day, and so on. These elementalists knew that the small businesses wouldn’t be targeted by this group, so they answered candidly.</p><br/><p>It was through this that Ai Hui gained some insights into the stowaway business.</p><br/><p>They could make seven to eight trips a day, but they weren’t without dangers, especially during the boarding process. It was easy for accidents to happen when there was a crowd. They took flight the moment they sensed something amiss. And they complained more than once about how poor the people from Old Territory were, and how the only thing they could offer as payment was artifact remnants. As such, all they could accumulate at the end of the day was a pile of old remnants.</p><br/><p>The good thing was that the value of these remnants had increased significantly and were easier to sell. The cumbersome part was that they had to head toward larger cities in order to find merchants who would buy them. A lot of their time was spent on this.</p><br/><p>Ai Hui took out some elemental energy beans and gave them to the elementalists as his transportation fee.</p><br/><p>The elementalists were beyond joyful. They hurriedly reminded him that there was a group of Grass Bandits lurking at the edges of Jadeite Forest, waiting to ambush caravans, so he should be extremely careful.</p><br/><p>Bidding them goodbye, Ai Hui waited for the man driving Three Leaves Bamboo Cart and headed toward Jadeite Forest.</p><br/><p>On the cart, Ai Hui asked Zhao Boan, \"Do you know anything about Grass Bandits?\"</p><br/><p>Zhao Boan quickly answered, \"I know a little. The group was created by Zheng Xiaoman, who was ex-Deathgrass Division’s Division Leader Zheng Yuanhong’s adopted daughter. Deathgrass Division had refused to surrender to Da Gangi, and was massacred. It was said that someone secretly leaked the news, so Zheng Xiaoman and some principal members escaped the misfortune and named themselves Grass Bandits. There hadn’t been much movement from them before, but now that the number of citizens in Palette Cloud Village has reduced, they’re becoming more active. Many elementalists, who are displeased with Grandmaster Dai, joined upon hearing the news, so the group has been pretty influential recently. Grass Bandits was most ruthless toward caravans from Deep Sea Enterprise, letting neither the goods nor their people off. They will extort money from big enterprises and let them pass, while they are harmless to small enterprises.\"</p><br/><p>From his speech, it was apparent that he rather admired the Grass Bandits.</p><br/><p>Ai Hui was somewhat surprised. \"These Grass Bandits seem pretty decent?\"</p><br/><p>\"Not bad indeed,\" Zhao Boan explained. \"Although Zheng Xiaoman was a fiery character, she never harmed the innocent. Grass Bandits have strict and righteous laws of conduct, much better than the current Deathgrass Division. Grandmaster Dai often isolates himself, but the greedy fellows beneath him are trying to damage his reputation.\"</p><br/><p>Ai Hui asked, \"Deep Sea Enterprise?\"</p><br/><p>\"No!\" The anger in Zhao Boan’s tone increased a few folds. \"Deep Sea Enterprise gets their hands on all big and small businesses going on in Jadeite Forest. If you want to earn money, you have no choice but to join them, or they will smear your business, seek trouble or frame you. They are unscrupulous in all ways. But if you join them, a big cut of the profits goes to them and gifts must be offered monthly, so your hard work amounts to little eventually. Plus, your whole family will be under strict restrictions in all aspects of life. Any mistake that you make will implicate your family too.\"</p><br/><p>Qing Feng stared blankly for a while before asking, \"It’s that serious?\"</p><br/><p>Zhao Boan looked at him. He’d heard Qing Feng calling himself one of Grandmaster Dai’s fellows and couldn’t help but mock him, \"Those under Grandmaster Dai are naturally flowery, but they are extravagant, wasteful and without substance. Why would they care about our wellbeing? We’re merely commoners.\"</p><br/><p>Ai Hui asked, \"With Deep Sea Enterprise’s abilities, it shouldn’t be difficult to eliminate the Grass Bandits right?\"</p><br/><p>Zhao Boan shook his head. \"Just the opposite. Deep Sea Enterprise has lost many battles and can’t do much to the Grass Bandits. The backbone of the people comes mainly from the old Deathgrass Division. They have a rich family history and imparted many skills, and they are good at handling military affairs. Plus, either out of affection for the Grass Bandits or hatred toward the enterprise’s avariciousness and ruthlessness, many people in Jadeite Forest secretly relay news and information to the Grass Bandits. The enterprise has punished many families for this, but they are unstoppable.\"</p><br/><p>Ai Hui nodded. \"So now that there are fewer people in Palette Cloud Village, Elders Guild isn’t bothered that the Grass Bandits have more freedom to move.\"</p><br/><p>Zhao Boan answered confidently, \"Yes, don’t worry, Sir. As long as it’s not Deep sea Enterprise, the Grass Bandits will not make things difficult for us.\"</p><br/><p>Ai Hui shook his head. \"It’s better that we don’t bump into them.\"</p><br/><p>He just wanted to visit Senior Mingxiu and did not want to complicate things.</p><br/><p>Qing Feng spoke up suddenly, \"Let’s bid our goodbyes if you guys are going to Jadeite Forest.\"</p><br/><p>Ai Hui was taken aback. \"Why?\"</p><br/><p>Qing Feng replied frankly, \"Grass Bandits has nothing against you all, but they will not let me off. Plus, the moment I set foot into Jadeite Forest, Deep Sea Enterprise has its way of tracking me down with their forbidden arts. I see that your sword skills have been stymied by a bottleneck and it’s meaningless to train with me, so let’s bid farewell.\"</p><br/><p>Ai Hui thought over his words for a bit and felt they were logical. He stood up, saying, \"Since that’s the case, goodbye. Take care of your safety and let’s not turn into enemies, hopefully.\"</p><br/><p>Qing Feng shook his head. \"Why would I do that? You are eventually going to become a Grandmaster and will have a limitless future ahead of you. I’m not one to overestimate my capabilities. Farewell!\"</p><br/><p>Finishing his words, he flew down from the cart and disappeared in another direction.</p><br/><p>Ai Hui watched attentively for a bit before retracting his gaze. In this chaotic world, people come and go like duckweeds. Nature messes with people so who could tell the future?</p><br/><p>Without Qing Feng, only Zhao Boan was left controlling the cart.</p><br/><p>Zhao Boan’s speed was evidently much slower than Qing Feng’s, but Ai Hui did not rush him. He pondered over swordsmanship and analyzed them, and when they pitched camp, he would enter Grass Hall to continue his search for the notebook.</p><br/><p>Entering Grass Hall each time, Manager would recommend a few missions to him. The development of the Assembly of Patriarchs had been going extremely well, so the range of missions received was much wider than before. Plus, due to public appraisal between aristocratic families, there was a shortage of manpower. Manager even handed him a letter written by Madam Ye.</p><br/><p>In her letter, Madam Ye told him in all earnesty that there were few whom she could trust over there, and hoped that he would go over to help. She then implicitly suggested that she had much power and influence, and could offer him greater prospects and so on.</p><br/><p>Ai Hui returned a letter, saying that he had decided to travel the world to hone his swordsmanship. He thanked her for her recognition and added that he would express his gratitude if there was a chance and so on.</p><br/><p>As for the recommended missions, he rejected them all.</p><br/><p>His daily life was exceptionally simple.</p><br/><p>Blind He and Mo Zhong had no time to care about him as they placed all their heart into the cart’s tree roots, logs and stones. In Old Territory, they were deficient in elemental energy and were unable to analyze these materials. Now that there was nothing bothering them, they immediately threw themselves into the research.</p><br/><p>Before this, they’d neither been to Old Territory, nor been in touch with materials from there. To them, it was like a whole new world.</p><br/><p>Silent Mo had a lively personality but was quiet and focused when it came to work. She had inherited Mo Zhong’s craftsmanship, and while she seemed inexperienced, it was obvious that she had real talent. She had a natural intuition when it came to plants and for a grass-grade weapon craftsman, this was the greatest gift.</p><br/><p>Weaponsmiths and grass-grade weapon craftsmen were slightly different in that one forged weapons with metal element, whereas the other forged them with wood element. Other than that, they had many similarities.</p><br/><p>Blind He was usually a taciturn person, but when theorizing with Mo Zhong he became a chatterbox and his words were harsh. Mo Zhong, on the other hand, was honest and sincere, but when discussing refinement, he became an angry person who was adamant about his ideas. Any slight disagreements with him and he’d look as if he was about to throw his fist.</p><br/><p>While Zhao Boan came from a family of itinerant merchants, Ai Hui thought that he was much more of a scholar than a qualified merchant. The good thing was that despite his lack of experience, Zhao Boan had been influenced from a young age and had been through practical training. As such, he gradually became a seasoned merchant too.</p><br/><p>The desolate scenes along the way were graver than those in Silver Mist Sea.</p><br/><p>The once busy trade routes were mostly empty and only a few caravans could be seen. This was partly due to the havoc the Grass Bandits had been wrecking, but it was more so the fact that the number of people in Palette Cloud Village had decreased. The cities along the way fell into a slump and caravans’ profits were scanty.</p><br/><p>They could only make significant profits if they transported the goods to the Wilderness. Otherwise, they basically had nothing to earn. But it was a risky task as there were too many bandit attacks. Plus, the Wilderness was no peaceful land. For the groundbreakers, their lives were already on the table, so there wasn’t any way they could resist the temptation of the goods in the caravans. They could easily and willingly take that risk out of desperation.</p><br/><p>The closer they got to Jadeite Forest, the fewer caravans they saw.</p><br/><p>Zhao Boan reminded Ai Hui that they’d already stepped into the territory of the Grass Bandits.</p><br/><p>Although Zhao Boan seemed rather confident in the Grass Bandits from the way he spoke about them, Ai Hui could still tell that he was somewhat nervous.</p><br/><p>Ai Hui wasn’t too worried about himself. He was worried about Senior Mingxiu, who was in Asakusa City. She was from the Lu family and her brother, Lu Chen was one of Grandmaster Dai’s oldest disciples, so even if the Grass Bandits did not hate her to the bone, they would not let her off easy, that was for sure.</p><br/><p>Plus, if they could seize her, they would be able to blackmail the Lu family and demand a ransom.</p><br/><p>He hoped there were enough guards around her. With the Lu family’s status in Jadeite Forest, they probably wouldn’t neglect her safety.</p><br/><p>Ai Hui wasn’t sure if he was feeling slightly uneasy due to the fact that he was about to meet her.</p><br/><p>He had Zhao Boan stop in the closest small town and wait for his return.</p><br/><p>He’d decided to fly into Asakusa City himself to speed things up.</p><br/>\n</div>"}