{"title": "Chapter 418: A Languished Top Student", "id": 418, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-418-a-languished-top-student", "volume_title": "Volume 5", "body": "<h1>Chapter 418: A Languished Top Student</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 418: A Languished Top Student</p><br/><p>Translator: TYZ Editor: TYZ, KLKL</p><br/><p>A perfect square that looked as if it was drawn using a ruler appeared on the black-colored rock.</p><br/><p>Pop. Lou Lan transformed into a fork and pierced effortlessly into the centre of the square on the rock. It felt as if he was piercing into a piece of stewed pork belly. Accompanied by Blind He’s astonished gaze, the fork trembled and pulled out a cube of black rock wobbily.</p><br/><p>The thickness of the back rock cube was at most one meter. It was thicker than what Blind He had expected. The bottom of the black rock cube was dark-red and it was still dripping with lava. For some reason, when one looked at it, he or she would think of a chunk of red braised meat that was dripping glistening braised sauce.</p><br/><p>Of course, Blind He couldn’t link it to a chunk of red braised meat. He was only surprised at the temperature of the earth fire in the square-shaped hole.</p><br/><p>Heat waves blasted his face. Without using his hand, he could clearly gauge the temperature of the earth fire here. The earth fire in this area was much hotter than the previous area’s.</p><br/><p>However, he was still a meticulous weaponsmith.</p><br/><p>Blind He floated down slowly from the air and kneeled on the ground. He inserted his fair and flawless palm into the square-shaped hole and shut his eyes tightly with a solemn look on his face.</p><br/><p>With a bang, Lou Lan transformed back to his usual form and looked curiously at Blind He.</p><br/><p>Lou Lan also knew how to forge weapons. However, his forging skills still paled in comparison to Blind He’s. Most of Lou Lan’s knowledge of weapon-forging came from books. When Master Shao was still around, he spent all his resources on upgrading Lou Lan’s sand core. This was how Lou Lan’s Midnight came about. As for Lou Lan’s second master, Ai Hui, he was also a poor bloke. However, in the process of making See You Laters, Lou Lan had gained a decent amount of experience in weapon-forging.</p><br/><p>Lou Lan was like a baby that was filled with curiosity towards everything new.</p><br/><p>This characteristic of Lou Lan completely set him apart from his master Ai Hui.</p><br/><p>Ai Hui was a practical individual. Whether or not he would be interested in something depended on the utility of thing itself. If it was something that he deemed useless, he wouldn’t be bothered looking at it. However, if it was something that he deemed useful, he would become abnormally greedy and thirsty for it and would try to obtain it at all costs.</p><br/><p>Lou Lan’s eyes were flickering with a red glow. He was recording and analyzing Blind He’s elemental energy flow. Even though there were multiple areas that he did not understand, he still recorded the entire process patiently.</p><br/><p>The new sand core was exceptionally powerful. Lou Lan could feel the surging power that it contained, which resembled the unpredictable, calm and tranquil sea. Even though he still had not figured out how to activate and use this powerful force, up till now, all his abilities had not reached Midnight’s limit.</p><br/><p>Sometimes, Lou Lan would wonder why Master Shao named the new sand core as Midnight. Midnight was the darkest moment of a day and the darkest moment of nighttime. Was the name implying that the sand core was as unpredictable as the darkest moments of nighttime or as bright as the daybreak that would come after midnight?</p><br/><p>Did Master Shao fulfill his wish? How was his life now?</p><br/><p>Distracting thoughts flashed across Lou Lan’s sand core. Sometimes, Lou Lan felt that he behaved lesser and lesser like a sand puppet. It was really abnormal for a sand puppet to have distracting thoughts.</p><br/><p>His gaze returned to Blind He.</p><br/><p>Blind He withdrew his palm and stood up slowly. \"Let’s build the smelting furnace here.\"</p><br/><p>After settling a huge issue, Lou Lan was very happy. \"We shall build the smelting furnace according to Ai Hui’s design?\"</p><br/><p>\"Yes,\" Blind He replied.</p><br/><p>\"Lou Lan shall begin then!\" Lou Lan said cheerfully.</p><br/><p>A faint smile appeared on Blind He’s pale face. He did not say anything, but he was filled with expectations. The earth fire in this area was abundant. This was the best spot to build a smelting furnace. Furthermore, the design of the smelting furnace had been improved by Ai Hui’s modifications.</p><br/><p>That’s right. This was the first time he met a metal elementalist that knew how to modify a smelting furnace to such a successful extent. Even though they had only roughly tested out the modifications, the trial was enough to prove that the fire power of the smelting furnace did increase significantly.</p><br/><p>No wonder Elders Guild would confer the title of Master on Wang Shouchuan. The standard of abilities Ai Hui displayed had certainly enlightened Blind He.</p><br/><p>Blind He was filled with anticipation for the resulting flames produced by the modified smelting furnace coupled with the abundance of earth fire.</p><br/><p>Clink, thud, clink! Lou Lan’s movements were very fast. Very soon, the building process was in full swing.</p><br/><p>Shi Xueman and her counterparts returned to the valley without good news nor bad news.</p><br/><p>The inside of the cave was shaped like an inverted trumpet. The entrance of the cave was small but the inside of the cave was enormous in size. And the powerful metal wind was formed precisely because of the unique shape of the cave.</p><br/><p>There were numerous passageways in the cave. This was also why Iron Lady and her counterparts had to turn back. Scouting a cave was an arduous process that would take up a lot of time.</p><br/><p>There were pros and cons to having a cave that was connected to the outside world. The terrain of the valley was small and narrow. It would be impossible for them to escape if someone had blocked the entrance of the valley. The good thing of to have a cave connected to the outside world was that it provided the best escape route for them. However, the bad thing about the cave was that it also provided a route for dire beasts to invade the valley.</p><br/><p>Therefore, appropriate arrangements had to be made.</p><br/><p>Iron Lady looked at the drifting fog that dazzled with a flash of radiance every now and then above the valley. A look of amazement flashed across her eyes.</p><br/><p>Was this inspired by water candles?</p><br/><p>Sometimes, she really wanted to crack open Ai Hui’s head and see what was contained inside of it.</p><br/><p>She saw that Ai Hui was busy, hence, Iron Lady did not disturb him. She began to deploy sentries and patrols around the valley. Right now, they were situated in the depths of the Wilderness where danger might occur anytime.</p><br/><p>Meanwhile Duanmu Huanghun was leading a team of wood elementalists to perfect the wood elemental defense system. Various types of seeds were meticulously planted in different positions. Using their wood elemental energy, the wood elementalists were able to speed up the growth of the seeds. Within two days, there were lots of young sprouts around the defensive ancient tree.</p><br/><p>If Ai Hui was an unorthodox elementalist, then Duanmu Huanghun would be an orthodox elementalist. Due to the talent he displayed since young, his family had placed high hopes on him. Duanmu family was one of the oldest families in Avalon of Five Elements. Since young, Duanmu Huanghun received the most traditional and orthodox education.</p><br/><p>If Duanmu Huanghun never met Ai Hui or encountered the blood catastrophe, he would have graduated from Induction Ground as the best student and became a role model for all the students in Induction Ground.</p><br/><p>His style of defensive arrangements were very traditional. One could even say it was a classical style. His style of defensive arrangements was completely different from his arrogant and elitist nature.</p><br/><p>In the hands of a so-called genius, any theories or styles could shine brightly and amaze everyone in the world.</p><br/><p>Initially, the rest of the wood elementalists did not find anything special about Duanmu Huanghun’s defensive arrangements. All they could see was that some of his requirements were too demanding and unnecessary.</p><br/><p>For example, every plant must be of a certain distance from each other or the order in which the wood elementalists sped up the growth of the seeds must be correct. On the contrary, the concoctions that Duanmu Huanghun used to prepare these plants were commonly-seen and ordinary. There were nothing special about these concoctions at all.</p><br/><p>However, as time passed, everyone began to shut up. All their complaints had disappeared. Everyone sincerely admired Duanmu Huanghun’s defensive arrangements. They had been convinced by his genius.</p><br/><p>If this was a wood elementalist’s homework or examination in Induction Ground, Duanmu Huanghun would have received full marks. Everyone believed that even the teachers in Induction Ground could not have handled this task better and more impressive than Duanmu Huanghun.</p><br/><p>Perfect! Meticulous! Impregnable!</p><br/><p>His defensive arrangements did not seem to compliment each other, but in reality, they did fit together perfectly. The ideas behind his arrangements were ingenious and the details involved were brilliant. Jiang Wei and his counterparts had been through multiple battles before and they had rich combat experience. As such, they were familiar with storming heavily fortified positions.</p><br/><p>However, when they faced Duanmu Huanghun’s defensive arrangements, their faces turned white with fear.</p><br/><p>Up till now, no matter how hard everyone tested and rehearsed, they could not find a single loophole in his defensive arrangements.</p><br/><p>Just by the make of the distribution chart of the seeds that had been planted and looking at it, everyone’s eyes tangled up. At this point of time, all the wood elementalists then remembered that Duanmu Huanghun was the legendary top student of Induction Ground.</p><br/><p>Didn’t everyone say that he had languished? Didn’t everyone say that he fooled around in brothels day and night? Didn’t everyone say that he was utterly defeated by She Yu?</p><br/><p>All the wood elementalists submissively followed behind the top student, sowing seeds and channelling their elemental energy.</p><br/><p>After being crushed by Duanmu Huanghun’s superb intelligence, everyone seemed to have gone through a mental rollercoaster. Right now, all of them were filled with anticipation. They could not wait to see the facial expression of their enemies when they encountered these fully grown defensive plants.</p><br/><p>Duanmu Huang’s facial expression remained calm. However, deep down, he was actually extremely pleased with himself.</p><br/><p>The time and effort he spent were not in vain!</p><br/><p>He had long thought of how to build an impregnable defense system for the valley. All he wanted was to give Ai Hui a big shock.</p><br/><p>Duanmu Huanghun casted a glance of haughty disdain at Ai Hui. When he saw Ai Hui examined the ground full of sprouts, his mind became restless and his lips curled into a haughty smile.</p><br/><p>Hehe, you must be shocked, right!</p><br/><p>Suddenly, Ai Hui furrowed his eyebrows and said, \"Everyone, stop!\"</p><br/><p>A look of excitement flashed across Duanmu Huanghun’s face. The chance is here. He nonchalantly asked, \"Is there anything wrong?\"</p><br/><p>The rest looked at Ai Hui with a puzzled look. From their perspective, Duanmu Huanghun’s defensive arrangements were perfect.</p><br/><p>Ai Hui looked at Duanmu Huanghun and asked, \"Have you figured out how much wood elemental energy would these arrangements need after three days?\"</p><br/><p>Everyone still remained baffled. However, Duanmu Huanghun’s facial expression had already changed drastically.</p><br/><p>At this moment, all he wanted to do now was to find a hole and hide in it.</p><br/><p>Damn it!</p><br/><p>How could he overlook such an important issue!</p><br/><p>After the growth of these seeds had been sped up, their elemental energy usage would increase sharply. Furthermore, there was a limit to how much wood elemental energy that this wood elemental land could provide. It definitely could not support the growth of so many plants.</p><br/><p>Duanmu Huanghun’s mental arithmetic ability surpassed everyone’s. In a blink of an eye, he had already computed the result. The critical point would not be reached on the third day, but rather, 3pm in the afternoon of the second day.</p><br/><p>Once the supply of wood elemental energy could not keep up with the growth of the plants, the plants would not developed healthily. After they were fully grown, their powers would decrease sharply.</p><br/><p>\"All of you have to wait until my wood elemental energy pool is ready,\" Ai Hui told them.</p><br/><p>After the wood elemental energy pool was built, the supply of wood elemental energy would then rise sharply.</p><br/><p>After finishing his sentence, Ai Hui hastily left to take a look at the building progress of the smelting furnace. He had modified the design of elemental energy pool that Elders Guild had provided. There were a lot of components to be forged. Therefore, he needed the smelting furnace to be built first. Furthermore, he had to consult Blind He on some of the components needed for the five elemental energy pools.</p><br/><p>Duanmu Huanghun’s face turned black, resembling the bottom of a wok.</p><br/><p>An extremely strong aura of anger emitted from his body, causing the rest of the wood elementalists to steer clear of him.</p><br/><p>At this point in time, they definitely must not provoke Duanmu Huanghun.</p><br/>\n</div>"}