{"title": "Chapter 420: Energy-stabilizing Pillars", "id": 420, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-420-energy-stabilizing-pillars", "volume_title": "Volume 5", "body": "<h1>Chapter 420: Energy-stabilizing Pillars</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 420: Energy-stabilizing Pillars</p><br/><p>Translator: TYZ Editor: TYZ, KLKL</p><br/><p>Ai Hui squatted at the volcanic crater and looked at the surging red-colored lava beneath him. Waves of scorching heat hit him in the face while a strong smell of sulfur choked his nose and mouth.</p><br/><p>He squinted his eyes and carefully and examined the fire elemental energy below him. The surging lava had made the fire elemental energy look as if it was in total chaos. However, Ai Hui knew this was not the case in reality.</p><br/><p>This volcano was out of the ordinary and it did not have a name. Since they were going to be staying here for a long time, they had to come up with a name for it. Thus, everyone had decided to call it Blackfish Mouth Volcano.</p><br/><p>The volcano was like a huge black-colored fish that jumped halfway out of the ground. The fish head was facing the sky while the volcanic crater was the mouth of the black-colored fish.</p><br/><p>Pop!</p><br/><p>A sharp and clear popping sound exploded behind Ai Hui. He returned to his senses with a start and turned his head around.</p><br/><p>A ball of sand had rolled to the volcanic crater from the valley and exploded in the air not far away from Ai Hui. It exploded into a clear and distinct line of words made of sand in the air.</p><br/><p>\"Ai Hui, meal time!\"</p><br/><p>At the end of the line of words, there was also a vivid and lifelike sand portrait of Lou Lan. In the sand portrait, Lou Lan was wearing a chef’s robe with a wok in one hand and a ladle in the other hand. The ladle in his hand was pointing to the line of words. On his face, that was covered by a mask, his eyes had curled into two curved slits.</p><br/><p>Ha. Ai Hui could not help but laugh.</p><br/><p>Lou Lan was getting more and more fancy.</p><br/><p>Due to having maintained his facial expression for a long time, Ai Hui’s face muscles were slightly rigid. He rubbed his numb face and jumped down from the volcanic crater. Following which, the Starry Gem Swordwings on his back spread with a whizz. Like a huge, black-colored eagle, he swooped down from the sky and flew towards the valley.</p><br/><p>Looking down from the sky, he could not see the valley. He could only see a continuous stretch of mountain range that was formed by the rocks of the black volcano.</p><br/><p>As Ai Hui flew closer to the surface of the ground, he did not lower his speed. The scene of him smashing into smithereens did not happen as he flew right through the rocks and disappeared.</p><br/><p>A slight chill blasted him in the face as he flew through a layer of fog-formed mirage. The scenery in front of him transformed as an exuberant valley appeared right before his eyes.</p><br/><p>The first thing Ai Hui saw was Fatty licking his plate. The rest were busy eating as well. Other than Lou Lan, no one raised their heads to look at him. Gulping his saliva, Ai Hui landed beside Lou Lan.</p><br/><p>Lou Lan served Ai Hui the long-prepared elemental food and yelled, \"Ai Hui, it has been hard on you!\"</p><br/><p>\"Thank you, Lou Lan,\" Ai Hui carefully took over the food.</p><br/><p>An alluring fragrance seeped into Ai Hui’s nostrils as his mouth uncontrollably overflowed with saliva. Like the rest, Ai Hui wolfed down his food.</p><br/><p>Even though he had eaten Lou Lan’s food many times, he still felt extremely blissful whenever he had his meal cooked by Lou Lan.</p><br/><p>At that point of time, a lot of people were thinking, \"Ai Hui is not important at all, the most important person is Lou Lan! Lou Lan is the morale-booster! Wherever Lou Lan points his ladle at, we will go through fire and tread on water for him! Ai Hui? Who’s that! How can someone like him enjoy the delicious food that Lou Lan makes? Why don’t we split his share among ourselves? We can eat more of Lou Lan’s food that way then…\"</p><br/><p>Those who had finished their meals were staring fiercely at Ai Hui. They were struggling with their emotions. Should they snatch the food from the tiger’s mouth?</p><br/><p>\"Ai Hui, did you make any developments today?\"</p><br/><p>Lou Lan’s voice rang across Ai Hui’s ears. His face was nearly buried in the bowl of food. Everyone’s gaze was fixated on his back.</p><br/><p>\"I still need some more time…\" Ai Hui replied unclearly with food stuffed in his mouth.</p><br/><p>Being situated in the mountain range of the Blackfish Mouth Volcano, the valley had an abundance of fire elemental energy. Right now, Ai Hui’s biggest problem was to figure out how to use this fire elemental energy.</p><br/><p>In theory, as long as the layout where the five elements could engender each other was formed, any type of elemental energy could become the fountainhead of the five elemental cycle. However, this was only proven in theory. In reality, there were still many limitations as to how one could utilize elemental energies.</p><br/><p>Blackfish Mouth Volcano had an abundance of fire elemental energy. However, the fire elemental energy was extremely violent. If Ai Hui wanted to use fire elemental energy, he had to first understand its nature. Just like what his master had told him in the past, he had to find the nodes of the fire elemental energy first.</p><br/><p>Only by understanding how the fire elemental energy was distributed in the area and by identifying the nodes could Ai Hui then put a leash on the ferocious \"beast\" and tame it.</p><br/><p>The defensive system for the valley and the elemental energy pools had been built. All these needed a huge amount of elemental energy, which would be coming from this volcano.</p><br/><p>Right now, they still did not dare to explore the surrounding terrain. If they were to encounter any formidable dire beasts, they could not even retreat back to the valley.</p><br/><p>That was because the valley did not have any defensive capabilities. The fog merely provided them with an illusive mirage.</p><br/><p>Ai Hui quickly finished up his food, leaving the food bowl spotless. The gazes that were gathered upon him shifted elsewhere immediately. Ai Hui raised his head from the food bowl with satisfaction.</p><br/><p>After Ai Hui returned to his senses from the delicious food, he looked around and asked, \"Where’s Blind He? How’s his progress?\"</p><br/><p>\"He is still making energy-stabilizing pillars. Since we need a huge number of them, he is still working on them and has not had his meal yet.\"</p><br/><p>The energy-stabilizing pillar was a structure designed by Ai Hui. It was somewhat similar to the sand pillars that Ai Hui made for Gu Tianning.</p><br/><p>The name of \"energy-stabilizing pillar\" was given by Blind He. Ai Hui thought that Blind He found the name of \"White Cluster Flames\" was given too negligently. Therefore, he decided to let Blind He choose the name this time around.</p><br/><p>Upon hearing Lou Lan’s words, Ai Hui was stunned. This was the first time he’d met someone who was able to resist Lou Lan’s delicious food. Such a high level of focus was indeed formidable. A tinge of shame arose in Ai Hui’s heart. When comparing himself to Blind He, he felt slightly inadequate.</p><br/><p>However, when Ai Hui saw everyone else, the tinge of shame in his heart disappeared into thin air. He said solemnly, \"Where’s his share of food? I will help him finish it!\"</p><br/><p>\"No, Ai Hui,\" Lou Lan shook his head, \"He Wei has forged so many energy-stabilizing pillars and his elemental energy has been greatly depleted. He needs to replenish his elemental energy in time.\"</p><br/><p>Ai Hui was defeated by Lou Lan’s bright and clear gaze. He laughed unctuously and replied, \"Ahh, that’s true, I forgot about that. Otherwise, I would have given him some of my share.\"</p><br/><p>Disdainful sneers broke out around him, unrestrained.</p><br/><p>Ai Hui glared at Iron Lady. What are you laughing at?</p><br/><p>\"Finished.\"</p><br/><p>Blind He’s weary voice suddenly rang across Ai Hui’s ears. Like a weightless ghost, he slowly drifted from Ai Hui’s side to Lou Lan.</p><br/><p>Blind He’s unique way of walking resembled the drifting of a ghost.</p><br/><p>His seemingly weightless body hovered a few centimeters above the ground and moved forward slowly, resembling a ghost. Initially, when everyone saw him moving around like this, their hairs stood on end. However, as time passed, they got used to it.</p><br/><p>Blind He was blind and he created this moving method. Since there were too many obstacles on the ground, hovering a few centimeters above the ground would allow him to avoid these obstacles. Moving around at a slow speed allowed him to utilize his sharp sense of awareness. With a sufficient amount of time, he could avoid obstacles like huge trees or walls.</p><br/><p>Ai Hui was stunned. He blurted out, \"So fast?\"</p><br/><p>In Ai Hui’s modified design plan for the five elemental energy pools, each elemental energy pool would need twelve energy-stabilizing pillars to be set up. Since they had five elemental energy pools, they had a total of sixty energy-stabilizing pillars.</p><br/><p>The design for these energy-stabilizing pillars was much more complicated than Gu Tianning’s sand pillars. Initially, Blind He said that he would need at least five days to complete building sixty energy-stabilizing pillars. In the end, he’d unexpectedly completed them in two days.</p><br/><p>Blind He ignored Ai Hui and smiled at Lou Lan, \"Thank you, Lou Lan.\"</p><br/><p>Following which, Blind He began to eat his food slowly. After a while, he suddenly said, \"The flames are good.\"</p><br/><p>It was at this moment that Ai Hui realized the White Cluster Flames was the reason why the energy-stabilizing pillars could be completed so fast.</p><br/><p>He did not expect the White Cluster Flames to provide such great help to the forging process. This certainly surprised him greatly. Ai Hui was not really well-versed in the art of weapon-forging, however, he certainly knew what it meant when five days’ worth of work was completed in just two days.</p><br/><p>He was palpitating with eagerness. If he could bring about such a huge impact just by modifying a smelting furnace, what would happen if he applied his master’s theories on other things?</p><br/><p>He suddenly realized that his master’ theories had had more potential than what he had expected. Ai Hui was filled with pride and longing for his master. When Ai Hui recalled that his master was a nobody when he was still alive, he made a firm resolution to promote and develop his master’s theories and research works.</p><br/><p>Brimming with emotions, Ai Hui flew towards the smelting furnace.</p><br/><p>The sixty energy-stabilizing pillars were piled up like a small mountain in front of the smelting furnace. Ai Hui landed on the ground and examined the energy-stabilizing pillars carefully.</p><br/><p>As Ai Hui understood his master’s theories more and more, his new designs of the energy-stabilizing pillars became smaller and smaller in size. Their effects were more remarkable as well.</p><br/><p>Every energy-stabilizing pillar was as thin as the size of a fist. Each pillar was one meter in length. Different materials were used for different elemental types of energy-stabilizing pillars. Some were made up of silvery metal, some were carved out of wood and some were made up of rocks. All of them were extremely exquisite and their bodies were covered with complicated and mysterious veined patterns. A faintly discernible glow was circulating through these veined patterns silently, looking like an art piece.</p><br/><p>\"Beautiful!\"</p><br/><p>Shi Xueman’s voice rang across the air as she landed beside Ai Hui. She was admiring the energy-stabilizing pillars as well.</p><br/><p>\"Let’s go and set up the elemental energy pools,\" Ai Hui was high-spirited.</p><br/><p>The rest had also gathered around them by now. Setting up the elemental energy pools was no doubt the most important thing for them to do. With a sufficient supply of elemental energy, their defense system could be activated and they no longer needed to ward off dire beasts with their physical bodies.</p><br/><p>The effects of Ai Hui’s modified smelting furnace were remarkable. Everyone was filled with anticipation. What would Ai Hui’s modified elemental energy pools be like?</p><br/><p>Everyone in the valley went into a frenzy as all of them stopped what they were doing.</p><br/><p>Ai Hui decided to set up the water elemental energy pool first. His partner for this task was Iron Lady.</p><br/><p>The lake in the valley was not really big. Ai Hui had already identified the locations of the nodes.</p><br/><p>Under Ai Hui’s instructions, Iron Lady nailed the energy-stabilizing pillars in the bottom of the lake. This was a task that needed to be carried out meticulously. Not only must she accurately nail the energy-stabilizing pillars in the exact spots, she must also make sure that the pillars were not damaged at all.</p><br/><p>A solemn look was upon Shi Xueman’s face as she cautiously nailed the twelve energy-stabilizing pillars into the nodes. Doing this caused her to be drenched in sweat.</p><br/><p>When the last energy-stabilizing pillar was nailed, Shi Xueman heaved a long sigh of relief. Her tense mind was finally able to relax. Now she was only scared of doing something wrong.</p><br/><p>Now that she thought of how Ai Hui nailed all the golden needles to execute [Treating The City As A Piece Of Cloth] in Central Pine City, she felt that Ai Hui could handle stress and pressure very well.</p><br/><p>At this moment, the ground suddenly trembled.</p><br/><p>Shi Xueman returned to her senses. Everyone’s gaze was directed at the small lake.</p><br/><p>At this point of time, the usually tranquil lake was rolling and surging, resembling a lake of boiling water. Powerful water elemental energy was spreading throughout the valley.</p><br/><p>Ai Hui looked slightly nervous and yelled, \"Stay on guard!\"</p><br/><p>Powerful elemental energy undulations could attract dire beasts easily. However, Ai Hui and the rest were already prepared for this scenario. If a dire beast really appeared, they would have someone to lure it away.</p><br/><p>Everyone was feeling extremely tense now. Fortunately, no dire beasts appeared.</p><br/><p>The boiling lake began to change.</p><br/>\n</div>"}