{"title": "Chapter 439: A Very Angry Iron Lady", "id": 439, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-439-a-very-angry-iron-lady", "volume_title": "Volume 5", "body": "<h1>Chapter 439: A Very Angry Iron Lady</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 439: A Very Angry Iron Lady</p><br/><p>Translator: Irene Editor: TYZ, KLKL</p><br/><p>The chillness Shi Xueman emitted was piercing. The temperature within the tavern lobby dropped abruptly.</p><br/><p>She was angry.</p><br/><p>Those in the lobby had long dispersed. They’d known that something terrible was going to happen the moment Yang Wuchang walked in. Yet, they never would’ve expected that this outsider had actually dared to give him a tight slap.</p><br/><p>Too crazy!</p><br/><p>Their faces were white as a sheet. All they wanted to do was to stand as far as possible. A furious Fickle Yang spoke no reason, so those involved in this would definitely be dead.</p><br/><p>Yang Wuchang had very decent abilities. He’d merely been careless earlier. He was different from other rich fellows who enjoyed life all day. While he was a lowly scum, he never did compromise on his own training. Plus, his uncle was a combat master and often guided him, so his abilities were rather commendable.</p><br/><p>He threw himself toward Shi Xueman.</p><br/><p>To the elementalists, these last two years of training had been the hardest. Elemental energy deficiency was a problem that the majority of the elementalists faced. Things changed ever since Fire Prairie and Yellow Sand Corner fell into the hands of the enemy. The five elemental cycle of life and the concentration of elemental energy in Silver Mist Sea, Palette Cloud Village and Jadeite Forest was starting to decline.</p><br/><p>In the first two years, the change wasn’t as severe. Silver Mist Sea, Palette Cloud Village and Jadeite Forest possessed thousands of years of accumulated elemental energy, and as the saying goes, a thin camel is bigger than a horse, they continued operating tenaciously.</p><br/><p>However, three years passed and the accumulated elemental energy continued to be used up, to the point where it couldn’t be effectively replenished. As such, the concentration of elemental energy started to drop drastically. The mist in Silver Mist Sea thinned and rivers stopped flowing. Palette Cloud Village’s springs started drying up and Jadeite Forest was also conducting effortful searches for solutions.</p><br/><p>When their accumulated energy was about to be exhausted, the situation worsened quicker than people had imagined. Elders Guild attempted to use the lesser Avalon of Five Elements to bring more vitality, but to no avail.</p><br/><p>The enactment of the city expansion order marked the end of the era of Avalon of Five Elements. After a thousand years of elemental energy nourishment, elemental energy was no longer easily obtainable and no longer cheaply-priced.</p><br/><p>People had to establish cities in the Wilderness and build elemental energy pools in order to barely sustain themselves.</p><br/><p>That’s right, barely sustain.</p><br/><p>How many elementalists had been sacrificed because of the city expansion? No one could keep proper count. Each city’s cost was extremely high so it wasn’t without reason that many cities collected high taxes from people entering.</p><br/><p>Even then, any city’s elemental energy concentration wasn’t comparable to the past.</p><br/><p>Many were stuck in their current base level and unable to achieve breakthrough.</p><br/><p>There was a popular saying spreading in the market now. From the beginning of the city expansion order, they’d entered Elemental Desolation Age. This \"desolation\" referred to both the Wilderness and also famine, since the elemental energy was drying up.</p><br/><p>So the city expansion order was regarded as the beginning of the Elemental Desolation Age. That year also became the first year of reign for elemental desolation.</p><br/><p>Could they ever return to the era of Avalon of Five Elements? No one dared to have such extravagant hopes anymore. What about recovering the fallen Fire Prairie and Yellow Sand Corner? You must be joking!</p><br/><p>God Nation’s power was on the rise each day, and yet the Avalon of Five Elements had to resort to seeking shelter in the Wilderness. Protecting themselves was already a challenging task.</p><br/><p>The Avalon of Five Elements was deteriorating fast, leaving people at a loss for words. All they could do was sigh in resignation.</p><br/><p>It was difficult for them to enter a higher base level, but at the same time their battle abilities were obviously improving. As compared to the peaceful and worry-free lifestyle in the Avalon of Five Elements, the Wilderness was full of fresh blood and danger. Weaklings were buried there. Only the strong prevailed.</p><br/><p>Although his uncle was a Master, Yang Wuchang had never slackened off when it came to training.</p><br/><p>This punch was apparently very well controlled, its elemental energy contained. While he looked arrogant and despotic, he was actually very clever and knew how not to overstep his boundaries and irritate the city chief or even trigger an investigation.</p><br/><p>Clearwater City wasn’t just consecrating one Master.</p><br/><p>The sinister look on Yang Wuchang’s face disappeared and was replaced by a thick, murderous and cold aura. He was like a whole different person now.</p><br/><p>The elemental energy surrounding him surged toward Yang Wuchang’s right fist. Fwoom! His right fist rose in flames, rolling intensely, transforming into a brightly colored, suspended tiger head. Its deep roar sounded like a ferocious, hissing tiger that was coming out of the forest.</p><br/><p>Just this hand alone revealed Yang Wuchang’s solid foundational skills.</p><br/><p>[Tiger Roar]!</p><br/><p>[Tiger Roar] wasn’t considered the finest inheritance, but its most unique point was that each strike had to take the shape of a tiger. The tiger-head-like energy blast, from Yang Wuchang’s punch, was splendid and fierce, vivid and lifelike.</p><br/><p>The abrupt roar seemed to have exploded right by the audience’s ears, causing their hairs to stand on end. The calves of those standing near were trembling.</p><br/><p>Those caught off guard were mentally shaken!</p><br/><p>But Shi Xueman remained motionless, her ice cold eyes lighting up. She perceived more than the rest.</p><br/><p>Within a three meter radius from where Yang Wuchang was standing there wasn’t any elemental energy at all, since all of it had been drawn away by his fist. This strange phenomenon was hauntingly familiar. Elemental energy suffocation!</p><br/><p>She never imagined she would be able to see this phenomenon happening on a hooligan.</p><br/><p>But that was all.</p><br/><p>Yang Wuchang’s vile conduct had angered her already and she quickly enlightened them as to what level of an opponent they’d just provoked.</p><br/><p>Shi Xueman did not retrieve Cirrus from her back. Instead, she placed her right palm horizontally, faced down, in front of her chest like a knife.</p><br/><p>Ss!</p><br/><p>The strange sound seemed to have come from the movement of wind from deep within a cave. A layer of light appeared on her snow-white and flawless palm.</p><br/><p>It was as if a gust of wind had just started blowing throughout the whole lobby as the calabash lights hanging on the lobby beams dimmed into a dull yellow, like they could extinguish at anytime.</p><br/><p>What followed after was an indescribably intense feeling of suffocation.</p><br/><p>A few managers’ eyes were about to pop out, their expressions plentiful and varying.</p><br/><p>This… elemental energy suffocation!</p><br/><p>They’d never experienced such an intense and overbearing elemental energy suffocation. In fact, they felt as though the elemental energy within their bodies was about to be drawn out. This suppression made them feel an instinctive fear.</p><br/><p>Yang Wuchang’s eyes revealed fear. He opened his mouth, attempting to call for help but he had no voice. The surrounding space affected by the elemental energy suffocation broke everything that touched it. The tiger head that enveloped his right fist started to distort.</p><br/><p>In the contest of elemental energy he had fallen into an unfavorable position and he knew what it signified.</p><br/><p>Boundless fear, like the violent sea, was about to drown him.</p><br/><p>To others, the air around Shi Xueman seemed to be warping.</p><br/><p>Ai Hui was, at that moment, in shock and admiration. Iron Lady’s plain, non-technical move only displayed her superb control over elemental energy!</p><br/><p>The moment this ability, completely honed through an accumulation of experience, was developed, it could throw people into despair even without technique.</p><br/><p>At that point, Shi Xueman and Ai Hui did not realize what effect this move would produce.</p><br/><p>The elemental energy pool in Clearwater City was a large one. Qiao Meiqi came from a rich family and did not hesitate to splurge on this water elemental energy pool, the largest within the region.</p><br/><p>The sky above Clearwater City was covered in a thick layer of mist, formed from water elemental energy. It also served as the city’s defense layer, which could transmit sunlight but block off the spying eyes of flying dire beasts.</p><br/><p>A moat, connected to an underground spring, surrounded the city and flowed unceasingly.</p><br/><p>Rain sprinkled over the surface of the moat, as if pulling up the curtains around the city. The ring-shaped rain screen outside the city constructed an environment with sealed elemental energy, diverting the obstructed water elemental energy outward. It also possessed great defensive power.</p><br/><p>And every day, there were elite combat elementalists stationed amid the cloud defense layer above the city. These elementalists were tasked to guard against attacks from flying dire beasts and to monitor alterations in elemental energy within the city.</p><br/><p>This wasn’t the era of peace. Bandits were on the rampage and the city had to be vigilant at all times.</p><br/><p>Tu Xiaojun was training among the clouds as usual. He was a water elementalist and being stationed in the cloud defense layer was a lucrative job. The water elemental energy within the cloud defense layer was twice as concentrated as that within the city.</p><br/><p>The only regrettable thing was that he had to check for changes in the city’s elemental energy every hour, hence disrupting his trainings. But he had no complaints and work mustn’t be delayed.</p><br/><p>Tu Xiaojun, who’d just detached himself from his circulatory cycle revolution, was checking for energy changes as usual.</p><br/><p>The concentration of elemental energy wasn’t consistent throughout the city. Some key regions possessed much denser elemental energy. Examples included the mayor’s residence, Masters’ residences and so on.</p><br/><p>Living high, a panoramic view of Clearwater City could be taken in. With such a magnificent field of vision, it was easy for Tu Xiaojun to check, at a glance, the concentration of elemental energy in respective regions</p><br/><p>As a water elementalist, he was extremely sensitive to the water elemental energy concentration. One look was all he needed. Within his field of vision, places with denser energy would be bluer and places with a lower concentration would appear dimmer.</p><br/><p>He scanned across the whole city unhurriedly and did not notice any abnormalities.</p><br/><p>Eh?</p><br/><p>He paused. There was a white space down in the northwestern part of the city.</p><br/><p>He wrinkled his brows, thinking that there was a battle going on.</p><br/><p>The white dot indicated that the concentration of elemental energy was practically zero, a rare phenomenon.</p><br/><p>While many were stuck in their base levels over the past two years, their battle standards had increased greatly. The legendary elemental energy suffocation, which had once been almost unattainable, was now in sight and reachable.</p><br/><p>Survivors were not weaklings.</p><br/><p>But white dots formed from elemental energy suffocations were usually small, rarely expanding over a twelve meter radius. When seen from above, that area appeared no bigger than a needle point.</p><br/><p>The front line separating Clearwater City and the Wilderness was the cruelest place where blood and courage were most abundant.</p><br/><p>It was common for any disagreement to result in flying fists.</p><br/><p>But everyone exercised careful control since the guards weren’t vegetarians. They needed to be swifter and fiercer when dealing with these powerful fellows.</p><br/><p>Overall, Clearwater City was a place with decent security. The mayor was a businessman and absolutely abhorred disorder.</p><br/><p>Also, since the city had two consecrated Masters, evildoers had to think twice before attacking.</p><br/><p>The number of consecrated Masters in a city was directly related to the city’s abilities.</p><br/><p>Wait!</p><br/><p>That white dot was increasing in size. Tu Xiaoqun was stunned and couldn’t help but take a closer look.</p><br/><p>It’d grown in size indeed!</p><br/><p>This area of elemental suffocation covered over thirty square meters!</p><br/><p>Over thirty square meters of elemental energy suffocation!</p><br/><p>Tu Xiaoqun understood what level of abilities this dot signified. He was going through familiar names in his mind, trying to figure out who was responsible for it.</p><br/><p>Before he could get a name out the white dot below grew yet again. Over fifty square meters!</p><br/><p>Fifty square meters!</p><br/><p>Tu Xiaojun inhaled a breath of cold air.</p><br/><p>What happened next was even more unbelievable and shocking.</p><br/><p>Sixty square meters… eighty square meters, ninety square meters, a hundred and fifty square meters…</p><br/><p>It was as if there was a thirsty monster, greedily swallowing up all the surrounding elemental energy.</p><br/><p>Tu Xiaojun was frightened and his face was colorless. Both Masters were out of town… He stared blankly for a few seconds before ringing the emergency alarm frantically.</p><br/><p>The mournful alarm tore through the city, thoroughly invading every corner of it. There was only one possibility.</p><br/><p>Intrusion of a powerful enemy!</p><br/>\n</div>"}