{"title": "Chapter 441: The Bigger the Scene, the Bigger the Earnings", "id": 441, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-441-the-bigger-the-scene-the-bigger-the-earnings", "volume_title": "Volume 5", "body": "<h1>Chapter 441: The Bigger the Scene, the Bigger the Earnings</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 441: The Bigger the Scene, the Bigger the Earnings</p><br/><p>Translator: YH Editor: TYZ, KLKL</p><br/><p>Han Li was alarmed by the siren. He furrowed his brows and walked faster, following the direction the guards were flying in. He did not take to the sky after the alarm sounded, as the sky of the city had become a no-fly zone. Unauthorised flyers would be treated as the enemy and attacked violently.</p><br/><p>He wondered who the assailants were.</p><br/><p>It was common to have disturbances in the city, but to have the alarm activated was another matter.</p><br/><p>If the situation was minor, the invaders would merely be punished as unwelcome guests. Those who caused major disturbances would be seen as an enemy of the city and would be marked for death.</p><br/><p>Who could it be?</p><br/><p>Could it be an enemy of Qiao Meiqi? Han Li’s heart skipped a beat. He walked faster and thought that if this was the case, he might be able to make use of the situation.</p><br/><p>Boom! Boom! Boom!</p><br/><p>A dull, rhythmic sound, like the beating of a drum, could be heard. Han Li was keenly aware of the vibrations moving along the ground. He immediately associated it with heavy weapons, such as heavy hammers or siege rams.</p><br/><p>He hopped lightly onto the roof of a shop and from there, gently bounced across several other roofs until he reached a higher vantage point.</p><br/><p>There were guards forming up in the sky above the city. Even Han Li, who was only there to take a peek, could feel the tremendous pressure.</p><br/><p>The guards were about to act.</p><br/><p>He focused his mind. He was curious to see who the troublemakers were and was contemplating if he should lend them a helping hand. While the saying \"an enemy of my enemy is my friend\" wasn’t always true, actual circumstances usually didn’t stray too far from it.</p><br/><p>Han Li’s eyes opened wide with shock when he looked towards the source of the sound.</p><br/><p>A beautiful lady clad in blue and white armour was continuously punching a thin bubble. The guy within the bubble was completely knocked out.</p><br/><p>Visible ripples would appear on the bubble whenever her snow-white fists struck it.</p><br/><p>Boom! Boom! Boom!</p><br/><p>Han Li was transfixed. He was unable to associate this beautiful, esteemed lady with the sledge hammer-like blows she was dishing out. He recognized the thin bubble as being a Mist Cage, something that only a handful of people were able to create. One of them was Master Yang Xiaodong.</p><br/><p>Han Li had read about Yang Xiaodong before he came and so knew that the man in the bubble wasn’t him. The Mist Cage was still intact, but they lady’s terrifying power was able to penetrate it.</p><br/><p>The man in the bubble was completely overwhelmed by the armour-clad lady’s powerful blows. He was unconscious and foaming at the mouth.</p><br/><p>Was there a need for this much force?</p><br/><p>Despite her terrifying display of force, Han Li actually had thoughts of flirting with her. A moment later, he snapped out of it and shuddered. Just what was he thinking!</p><br/><p>Was an ancient dire beast hidden within that graceful body?</p><br/><p>Flying overhead, more guards arrived. They were bewildered by the chaos below them.</p><br/><p>Being more resilient and powerful than the rest of the guards, the head guard regained his composure in half the time. He recognized the man in the bubble as Yang Wuchang, the nephew of Master Yang. He had heard of the man’s many shady misdeeds and despised him greatly. The head guard however, still had a duty to fulfil. If Yang Wuchang was to die under his watch, Master Yang might blame him for dereliction of duty.</p><br/><p>He ordered, \"Hands off!\"</p><br/><p>By then, the other guards had recovered from their shock as well. They looked at Shi Xueman with fear. Although they were afraid, they didn’t dare to retreat. Unable to advance or retreat, the guards fanned out and surrounded the area.</p><br/><p>The lady below continued to land blow after blow. It was as though she hadn’t realized what was happening.</p><br/><p>\"I’ll have to take action if you don’t stop!\"</p><br/><p>The head guard wavered a little inside. He wasn’t as confident as he looked or sounded, but at this point he had no choice but to advance. He gritted his teeth and signaled his men to get ready.</p><br/><p>\"Hey, hey, hey, am I really that unremarkable?\"</p><br/><p>A languid voice came from below.</p><br/><p>Ai Hui felt a little annoyed that he had been overlooked. There were so many people yet not a single one had bothered to look at him even once. He’d created such an eye-catching scene yet was completely ignored.</p><br/><p>Although Ai Hui wasn’t someone who sought fame and attention, he still felt really unhappy about this.</p><br/><p>It doesn’t pay to be too nice…</p><br/><p>Before he even finished his sigh, the Wintry Jade Blade in Ai Hui’s hand had already traced out several sword rays. Oddly, they didn’t vanish, but instead lingered in the air.</p><br/><p>Haphazardly inserted into the ground were a pretty large number of grass swords. A soft, high-pitched whistle could be heard from the grass swords that were trembling in unison.</p><br/><p>Upon noticing Ai Hui’s movements, the guards became aggressive. They couldn’t quite explain it, but the sight of Ai Hui made them feel threatened.</p><br/><p>\"How dare you!\"</p><br/><p>\"What insolence!\"</p><br/><p>...</p><br/><p>The guards cried out and gathered into a large mass. Below, an innocent-looking young man flashed a bright smile as he gracefully brandished his sword.</p><br/><p>A faint light erupted from the sword’s blade, dancing around the guards.</p><br/><p>\"Welcome!\"</p><br/><p>The young man’s languid voice momentarily lulled the guards into a false sense of comfort.</p><br/><p>His soothing voice was soon swept away by the grass swords’ high-pitched whistle.</p><br/><p>The guards could see bright spots in the sky around them that looked like stars amidst a lightless night sky. Out of nowhere, immensely sharp sword rays began to fly towards them at a high speed.</p><br/><p>Without thinking, the guards instinctively dodged and attempted to deflect the attack.</p><br/><p>The anticipated attack, however, did not take place. The piercing rays vanished, as if they had never existed.</p><br/><p>Have we been fooled?</p><br/><p>After they recovered, the guards noticed that there were many grass swords floating around them. The grass swords were nimbly weaving their way amongst them, like agile fishes swimming down a river.</p><br/><p>What was happening?</p><br/><p>Utterly confused, none of the guards were able to figure out what these grass swords were for. They were emitting a faint light, but did that even matter? Grass swords were weak and unsuitable for large scale attacks.</p><br/><p>What’s more, the grass swords didn’t seem to have any intention of attacking them. They merely drifted through space, completely ignoring the guards’ existence.</p><br/><p>Han Li was so distracted by Shi Xueman that he was taken aback when he heard Ai Hui speak.</p><br/><p>He would never forget that mockery-filled voice for as long as he lived!</p><br/><p>Looking towards the direction of the sound, he saw Ai Hui standing in the middle of many grass swords.</p><br/><p>Han Li was deeply annoyed.</p><br/><p>The smirk on that fellow’s face was incredibly detestable!</p><br/><p>One of the guards had enough of his games and prepared to rush down.</p><br/><p>He felt resistance the moment he tried to move. It was as though they were all suspended in some sort of liquid, making it difficult to move.</p><br/><p>He quickly shouted, \"Be careful, something’s not quite right!\"</p><br/><p>The others were finally waking up from their daze. They were disconcerted upon discovering that their physical and elemental energy movements were hampered.</p><br/><p>\"Crap!\"</p><br/><p>\"Let’s break out!\"</p><br/><p>Their immense collective combat experience allowed the guards to quickly think of a solution. They coordinated their efforts and aggressively attempted to fly out of the area.</p><br/><p>Ai Hui nonchalantly stayed on the ground. He glanced at Shi Xueman who was still happily punching the bubble, and felt a bit sorry for the guy inside.</p><br/><p>He retracted his gaze and looked upwards when he detected the guards’ movements.</p><br/><p>Shi Xueman is obsessed with the bubble.</p><br/><p>It’s rare to see my good friend here actually show interest in something… Please stop trying to disturb her…</p><br/><p>\"The bigger the scene, the bigger the earnings,\" Ai Hui murmured, as he drew a circular sword ray in the air with the Wintry Jade Blade. An indescribable feeling pervaded the air around him.</p><br/><p>The faint light from the floating grass swords began to change. Half of them were shining even brighter, while another half became much dimmer, as though they were covered by a layer of fog.</p><br/><p>The two distinct versions of the grass swords intertwined with each other, creating strange, undulating waves.</p><br/><p>The airborne guards had a grim look on their faces. If they were previously stuck in water, they were now rapidly sinking into quicksand. The resistance they felt was ten times greater than before!</p><br/><p>\"Elemental energy suffocation!\"</p><br/><p>Tu Xiaojun, who was standing guard in the cloud defense layer, was mortified.</p><br/><p>Beneath him, a circular void was expanding wildly. This one was somehow even more terrifying than the elemental energy suffocation from before.</p><br/><p>Two hundred and ten meters…Two hundred and forty meters …Three hundred meters.. </p><br/><p>The huge expanse of nothingness below him left his limbs numb with cold.</p><br/><p>The mayor and the others, who’d just flown over, arrived just in time to see the grass swords flying up into the sky. They hadn’t thought much about the grass swords.</p><br/><p>The old man soon picked up on the mysterious elemental energy waves that were propagating through the air.</p><br/><p>\"Be on your guard! The other party is very powerful!\"</p><br/><p>It was as if the old man had become someone else. His hair was standing on end and his gaze was as solid as a rock. He was emitting strong elemental energy fluctuations and not a trace of his typically leisurely manner could be seen.</p><br/><p>Qiao Meiqi knew that something was up. For the old man to say something like that, the other party must be incredibly strong.</p><br/><p>—— A Master!</p><br/><p>He took a deep bow and begged, \"Respected elder, you must save us! All of my assets are in Clearwater City. I’ll be left with nothing if it’s ruined.\"</p><br/><p>The old man looked at the young lady gravely as he sighed, \"Don’t worry, I’ll not let them mess around.\"</p><br/><p>\"Uncle Qiao, you shouldn’t be too worried,\" the young lady gently reassured Qiao Meiqi.</p><br/><p>Hearing the old man’s words made Qiao Meiqi feel slightly more secure. All they needed to do was to survive for the next two days until the Masters returned. Qiao Meiqi wondered whether he had offended someone recently and was reminded of some gossip he had picked up some days before.</p><br/><p>The old man lowered his tone, \"I’ll go take a look.\"</p><br/><p>Han Li, who was perched atop a high roof, was as pale as a sheet. He stared at the floating grass swords in utter disbelief.</p><br/><p>Hailing from the Karakorum Sword League, he naturally knew exactly what he was looking at. Anyone who had stayed for an extended duration in Karakorum would definitely recognise this.</p><br/><p>Yin Yang Sword Formation!</p><br/><p>However, he had no deeper understanding of it beyond mere recognition.</p><br/><p>He once believed that he would be able to break through the enigmatic Yin Yang Sword Formation, but the sight in front of him shattered every last shred of that belief.</p><br/><p>The Yin Yang Sword Formation was truly beyond his comprehension. It appeared to exist in a realm beyond Karakorum’s understanding.</p><br/><p>Han Li’s world had been turned upside down.</p><br/>\n</div>"}