{"title": "Chapter 459: Battles Of Masters (2)", "id": 459, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-459-battles-of-masters-2", "volume_title": "Volume 5", "body": "<h1>Chapter 459: Battles Of Masters (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 459: Battles Of Masters (2)</p><br/><p>Translator: TYZ Editor: TYZ, KLKL</p><br/><p>Yang Xiaodong seldom took action himself. The guards of Clearwater City were rather powerful elites. Clearwater City was located in the depths of Wilderness and the living conditions here were extremely dreadful. Elementalists that could survive here were neither weak nor stupid.</p><br/><p>After quelling a few brawls in the past, Clearwater City’s public security had been pretty good since then. They also did not encounter any powerful enemies from the outside world. As such, Yang Xiaodong seldom appeared in public.</p><br/><p>Everyone was more familiar with his nephew, Yang Wuchang instead.</p><br/><p>Yang Xiaodong’s betrayal had caused all the guards to loathe him. All of them felt that he was someone who merely fished for fame. However, [Refraction Forest] made them realized that Yang Xiaodong was still a Master, despite his vile character.</p><br/><p>Yang Xiaodong broke out in a cold sweat as well.</p><br/><p>Apparently, the combined attack from the guards was premeditated. If he had not not activated [Refraction Forest] just in time, he would have been destroyed by those densely-packed attacks.</p><br/><p>A blaze of rage suddenly ignited in the panicked Yang Xiaodong’s heart. Having lived like a prince for a long time, he had never encountered such a dangerous situation. It had also been quite a while since someone provoked him like this. Even the mayor Qiao Meiqi talked to him in a polite and respectful tone.</p><br/><p>Yang Xiaodong snorted coldly and the densely-packed prism pillars around him began to move.</p><br/><p>Immediately, countless light beams were reflected off the forest of prism pillars, flickering erratically and dazzling people’s eyes.</p><br/><p>The guards could not help but squint their eyes. These light beams were unusually dazzling, making them feel as if their eyes were being pricked by needles.</p><br/><p>On the ground, there were a lot of water stains that were formed when the water screen collapsed. At this moment, these unremarkable water stains were extremely deadly, behaving like pythons that were hiding in the dark.</p><br/><p>Silently, the water stains gathered together and transformed into numerous, thin ice spears with extremely sharp tips. Without making any noise, they shot towards the guards. At this instance, the sky was filled with dazzling and fascinating light beams, distracting the guards from the impending doom on the ground. The ice spears on the ground were like pythons hiding in the darkness, slowly revealing their poisonous fangs.</p><br/><p>Just as the ice spears were about to pierce through the bodies of the guards, a wisp of mist suddenly appeared. Like a nimble-moving snake, it flashed across the guards.</p><br/><p>The wisp of mist was only as thick as a thumb, but it was exceptionally strong. In the blink of an eye, the sneaky ice spears were completely smashed.</p><br/><p>In the sky, Yang Xiaodong looked at Shi Xueman with shock in his eyes.</p><br/><p>However, Shi Xueman did not have the time to bother about Yang Xiaodong. In front of her, Autumn Water had begun to take action too. She threw out a ragdoll which consisted of five different colors: white, green, black, brown and red.</p><br/><p>The ragdoll looked as if it was made using patches rags that were of five different colors. Its mouth was made up of stitches, making it looking sinister and scary.</p><br/><p>When the ragdoll landed on the ground, it melted like snow and formed a five-colored light spot on the ground’s surface.</p><br/><p>Autumn Water’s eyes flickered as she smiled, \"Come out, King!\"</p><br/><p>The shape of the light spot on the ground began to distort. Following which, a short figure climbed out of the light spot. The figure resembled a seven year old child. Its entire body was slick and slippery, looking as if it had been dyed with a multi-colored fluorescent paint. Its face was flat and multi-colored as well. It had no eyes, ears or nose. It only had a strip of stitches as its mouth.</p><br/><p>When the King appeared, an eerie aura engulfed the entire place.</p><br/><p>\"Kill!\"</p><br/><p>The guards launched their second wave of attacks.</p><br/><p>Since their attacks were ineffective against Yang Xiaodong’s [Refraction Forest], they changed their target and locked onto the multi-colored, man-like doll.</p><br/><p>Boom!</p><br/><p>Dazzling streaks of light engulfed the short and stout doll.</p><br/><p>The violent explosion set the guards’ minds at ease. The odd-looking, short doll should be destroyed by such a concentrated, combined attack.</p><br/><p>However, when the light and smoke cleared away, the guards’ facial expressions changed drastically.</p><br/><p>Not only was King not injured at all, it had increased significantly in size as well. Its stitch-made mouth began to spread apart.</p><br/><p>It was smiling.</p><br/><p>Upon seeing this, the guards were overwhelmed with horror. This weird doll could devour all types of elemental energy.</p><br/><p>[King] was Autumn Water’s Path of Master. Fusion elemental energy’s unique characteristic of not being restrained by any types of elemental energy had been put on full display by Autumn Water.</p><br/><p>This was King, the doll that could devour all types of elemental energy.</p><br/><p>Shi Xueman was roused.</p><br/><p>Her mind was filled with killing intent.</p><br/><p>She had discussed with Ai Hui about fusion elemental energy before. Both of them felt that fusion elemental energy was an extremely powerful force. It had the potential to become an enormous energy system on its own.</p><br/><p>Their conjecture had been verified by what she had just seen. Jiu Gui’s [Sky Palace Possession Technique] was completely different from Autumn Water’s [King]. However, both were remarkable and unfathomable.</p><br/><p>They did not expect the Assembly of Patriarchs to become their enemy.</p><br/><p>Shi Xueman moved extremely fast and appeared out of nowhere beside the doll. With two currents of mist swirling around her Cirrus, she thrusted it towards King.</p><br/><p>The King’s reaction was very fast as it reached out its hand and grabbed the tip of Shi Xueman’s spear.</p><br/><p>Cirrus and King’s hand collided together. At the same time, the mist swirling around Cirrus was heading towards King too.</p><br/><p>The spear tip pierced through King’s palm but it looked as if it felt nothing. Its other hand extended like a rope and lunged towards Shi Xueman.</p><br/><p>However, at this very moment, the mist from Cirrus struck the doll’s palm.</p><br/><p>Boom!</p><br/><p>The doll’s body and its pierced palm disappeared all of a sudden. It was as if a charging, wild beast had slammed into King, causing it to fly backwards through the air.</p><br/><p>Autumn Water’s facial expression changed drastically. She vanished into thin air and appeared beside King.</p><br/><p>King’s colorful right forearm had disappeared. It only had half its right arm left.</p><br/><p>Shi Xueman slowly retracted her Cirrus. This was her Path of Master, [Cloud of Firmament Iron]!</p><br/><p>\"Firmament iron is made up of a very simple raw material, water. The method of forming it is very simple as well, compression. As long as you can compress one thousand buckets of water into one single bucket, firmament iron will be produced. Cloud can be compressed into water, water can be compressed into firmament iron. What about a cloud that is made up of firmament iron?\"</p><br/><p>\"After putting in an immense amount of hard work, even the most ordinary technique can become magnificent.\"</p><br/><p>\"Water can become iron, ice can become steel!\"</p><br/><p>\"For the Shi family, inheritances and absolute arts do not form the foundation of our greatness. It’s our lofty ambitions to put in hard work and the solitude that comes along with it that forms our greatness. It’s all about putting in more hard work, even after you have put in tons of hard work!\"</p><br/><p>\"Focus on your spearmanship and don’t care about other things.\"</p><br/><p>\"This world has nothing to do with you.\"</p><br/><p>After Shi Xueman released the restraint on her base level, a colossal amount of water elemental energy gushed into her body. The elemental energy level in her body kept on rising while her aura kept on intensifying.</p><br/><p>Shi Xueman remembered her father’s words and intentionally restrained her base level all this while. She absorbed the water elemental energy and released the clouds within Cirrus. Following which, she compressed the clouds into water and then compressed the water. She repeated this process over and over again without finding it a hassle. Her goal was to compress Cirrus’s clouds into firmament iron and shatter it into numerous tiny granules. Ultimately, she would use these granules to reconstruct the clouds of her Cirrus and form the real Cloud of Firmament Iron.</p><br/><p>This process was much harder than her father’s process of forming firmament iron. Her workload was a lot more than her father’s as well.</p><br/><p>Until now, she had never formed the real firmament iron.</p><br/><p>However, her spear clouds were already extremely heavy, so much so that they were heavier than steel. The power of her spearmanship had become extremely terrifying as well. Even her most ordinary spear move was exceptionally deadly and formidable.</p><br/><p>This was Shi Xueman. She was an individual that never cut corners and always chose the most challenging path. She overcame all obstacles along her path and progressed steadily.</p><br/><p>She had neither the brilliance of a genius, nor an amazing creativity.</p><br/><p>But her greatness always caused despair in people, as they did not know how to withstand it.</p><br/><p>Autumn Water’s face turned pale-white with agony. Her life was connected to King. If King died, she would die as well.</p><br/><p>This was the unique characteristic of a Path of Master. Path of Master was intolerant of hesitancy and indecisiveness. One could only become a Master by pursuing a path that he or she believed in and committed his or her life to.</p><br/><p>How could one become a Master by fluke?</p><br/><p>Viciousness returned to Autumn Water’s face as she channeled fusion elemental energy into King’s body with all her might. King’s severed right arm began to wiggle and a brand-new forearm regenerated rapidly.</p><br/><p>When Yang Xiaodong saw this, he was overwhelmed with horror.</p><br/><p>Autumn Water’s King set him off in fear and trepidation. It could actually devour its enemy’s elemental energy. King was the bane of all elementalists!</p><br/><p>Shi Xueman was even scarier. Her spear move was plain and simple, but it was extremely deadly.</p><br/><p>Yang Xiaodong could not understand why such a simple-looking spear move was so powerful.</p><br/><p>The guards returned to their senses and began to attack Yang Xiaodong.</p><br/><p>Even though Yang Xiaodong’s [Refraction Forest] could deflect their attacks, it was still better than the doll that could strengthen itself by devouring their elemental energies. They felt that Yang Xiaodong was a better target.</p><br/><p>Yang Xiaodong composed himself. He had decided to place his attention on these guards.</p><br/><p>Shi Xueman could not leave the open-air terrace, otherwise, the guards behind her and the people in the underground mediation room would suffer. When she saw that King was knocked back far away by her spear move, she took in a deep breath of air and thrusted her spear forward.</p><br/><p>Hiss!</p><br/><p>It sounded as if the air was being ripped apart by the thrust of her spear.</p><br/><p>Two long and slender streams of cloud intertwined like two white snakes and shot towards Autumn Water.</p><br/><p>Far away, Autumn Water, who had been channeling fusion elemental energy into King, changed her facial expression drastically. At this moment, a shadow appeared in front of Autumn Water.</p><br/><p>Boom!</p><br/><p>A deafening explosion resounded through the sky as the air in front of Autumn Water suddenly exploded.</p><br/><p>A frail-looking man stood in front of Autumn Water with an indifferent look on his face. His almond-shaped pupils did not have any emotions. His entire body was emitting an intense, savage aura.</p><br/><p>Jiu Gui had regained his energy.</p><br/><p>Bombarding the water screen had put an enormous strain on Jiu Gui’s body. When the water screen collapsed, Jiu Gui had no choice but to rest. However, since Jiu Gui possessed the abilities of a mutated dire beast, he was able to regain his energy at an incredibly fast speed. Most of the mutated dire beasts possessed a powerful regenerative ability. All of them had an extremely vigorous and strong vitality.</p><br/><p>At this point of time, Jiu Gui did not seem tired at all.</p><br/><p>In the sky, Jiu Gui vanished into thin air and appeared before Shi Xueman in almost the same moment.</p><br/><p>Shi Xueman’s Cirrus mysteriously appeared in front of him.</p><br/><p>Jiu Gui dodged slightly to his side and his claw-like fingers lunged towards Shi Xueman’s spear. When his fingers made contact with the clouds spiralling around Cirrus, his body was knocked back over thirty meters. Shi Xueman’s body sank into the ground as countless cracks appeared on the ground beneath her feet, resembling two huge spiderwebs.</p><br/><p>Jiu Gui disappeared once more.</p><br/><p>Shi Xueman thrusted her spear forward once more.</p><br/><p>Boom!</p><br/><p>Another explosion broke out. Dust beneath Shi Xueman’s feet flew up into the air and engulfed her. Once again, Jiu Gui was knocked back thirty meters into the air.</p><br/><p>Jiu Gui’s fingers became oddly distorted, but he did not care about them at all and charged towards Shi Xueman once more.</p><br/><p>Autumn Water observed all the ongoing battles from one side. No one took notice of her as a gleam flashed across her eyes.</p><br/><p>Having regained its fighting capabilities, King silently sank into the ground like a puddle of mud.</p><br/>\n</div>"}