{"title": "Chapter 464: Departure", "id": 464, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-464-departure", "volume_title": "Volume 5", "body": "<h1>Chapter 464: Departure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 464: Departure</p><br/><p>Translator: Irene Editor: TYZ, KLKL</p><br/><p>Ai Hui and the rest had come quietly without anyone’s knowledge, but when they left a huge load team followed. All the load basin beasts were given to them by Qiao Meiqi, together with a group of servants and porters.</p><br/><p>When they first arrived, there was no Master in Central Pine Valley. They had no ability to defend themselves. Ai Hui today, relying on his reputation as the first ever Lightning Master, was able to intimidate their enemies. Plus, Shi Xueman was by his side.</p><br/><p>And there were Mister Dou and Yang Xiaodong, who were held captive, so four Masters were overseeing the place. Coupled with the valley’s defense, no team could ever think of breaking into their territory without at least six or seven Masters on their team.</p><br/><p>Full of confidence, Ai Hui’s display made a good spectacle.</p><br/><p>The masses, upon hearing the news about Thunder City, walked out of their houses to take a look. They stood on both sides of the road, not daring to make a racket. Where the squadron passed the audience bowed their heads in respect.</p><br/><p>They weren’t bowing to the fact that Ai Hui had become the first ever Lightning Master but that he was protecting their homeland.</p><br/><p>Unless they had no choice, who would be willing to wander about miserable and desperate?</p><br/><p>The battle that had happened earlier shook up Beyond Avalon. It wasn’t merely because of the birth of the first ever Lightning Master, but also because it was the first battle between two power figures since the city expansion order and the elementalists’ entrance into the Wilderness.</p><br/><p>A group of thieves and bandits participated in the battle of Skyheart City, thus it was regarded merely as an armed rebellion.</p><br/><p>And the battle of Thunder City was a conquest of power.</p><br/><p>The elementalists had charged into the Wilderness to build their own cities, facing pressure from dire beasts during the whole process. The cities were previously broken into because of these dire beasts and not because of conflicts among the people.</p><br/><p>Probably no one would’ve thought that in future history books there would be a name for this battle, \"Battle of Thunder City\". This battle was viewed by future historians as a turning point.</p><br/><p>The battle marked the start of the chaotic era where Beyond Avalon started invading other cities to conquer them.</p><br/><p>Later on, there were many elaborations on this event.</p><br/><p>Some felt that the root cause was that the elementalists started to become ambitious after settling down in the Wilderness. Others thought that Madam Ye’s rise had evoked much unhappiness and the Assembly of Patriarchs was one of the dissidents. There were also people who believed that the death of Great Elder gave way to the disorder in Beyond Avalon since there was no more leader.</p><br/><p>At this moment, no one knew exactly how impactful and far-reaching this battle was going to be.</p><br/><p>But to the citizens in Thunder City, this battle was more important than all the expounding done in history books.</p><br/><p>Their homeland belonged to them but history belonged to time.</p><br/><p>Not only was Ai Hui protecting their homes, he left a Thunder Mountain. This was one of the deepest cities within the Wilderness, where the mightiest and most dangerous dire beasts resided.</p><br/><p>Every single citizen had a deep understanding of dire beasts.</p><br/><p>Master Ai had pondered and analyzed lightning techniques at Thunder Mountain for consecutive days. Thunder rolled, displaying might and power, and could clearly be heard from miles away.</p><br/><p>Dire beasts’ fear of thunder exceeded that of humans, and elementalists who had been out scouting were all pleasantly surprised. Within a few mile radius practically all dire beasts, even the stronger ones, had vanished.</p><br/><p>They’d all thought that they were on the wrong path.</p><br/><p>Thunder Mountain left a strong thunder aura, which caused dire beasts to stay away instinctively. This region then became a forbidden area for dire beasts. As long as the thunder aura did not disappear, the area around Thunder City would still be a dire-beast-free zone.</p><br/><p>In the Wilderness, nothing was more blissful than being safe. The future of Thunder City was bright. As residents of the city, the citizens benefited the most.</p><br/><p>In this chaotic world, mere citizens’ wishes were being ignored. They, too, knew that Master Ai wasn’t fighting for them, but Thunder City survived because of Master Ai and would benefit for a long time because of him as well.</p><br/><p>He, the legend, was the stars in the sky and they were the grass on the ground. They were worlds apart and weren’t able to associate themselves with him.</p><br/><p>They bowed to him without expecting a response. They did it out of gratitude.</p><br/><p>The closely-packed crowd bowed unceasingly and only the footsteps of the heavy load basin beasts echoed throughout the big street.</p><br/><p>The atmosphere was exceptionally solemn.</p><br/><p>Sitting on a load basin beast, Ai Hui’s smile vanished. He pursed his lips, his expression turning serious. His relaxed posture disappeared too as he automatically straightened his back.</p><br/><p>In that instant he felt somewhat stifled and panicky.</p><br/><p>He did not know the reason, but was unwilling to think about it.</p><br/><p>It wasn’t easy for anybody in this chaotic world, was it?</p><br/><p>Amid the silence the load team left Thunder City and disappeared into the dense Wilderness.</p><br/><p>A short while after they left the city, Ai Hui returned to his usual state. The unhappiness and indescribable emotions were all thrown to the back of his mind. He wasn’t a heroic figure so the mission of saving the world should be left to someone else.</p><br/><p>Ai Hui fiddled with Mister Dou’s walking stick, his face full of curiosity.</p><br/><p>Mister Dou and Yang Xiaodong did not receive any harsh treatment. Their elemental energies were merely being suppressed. Yang Xiaodong had a dark expression on his face and behaved indifferently toward Ai Hui. Mister Dou, on the other hand, was much more straightforward and patient, responding to all the questions he had answers for.</p><br/><p>\"Why does this stick swallow light rays?\"</p><br/><p>Upon hearing Ai Hui’s question Yang Xiaodong couldn’t hold back. \"This isn’t a stick!\"</p><br/><p>With an \"ah\", Ai Hui looked the cane over a few times. With a I’ve-had-my-fare-share-of-experience-so-don’t-try-to-deceive-me look on his face he responded, \"This is obviously a stick.\"</p><br/><p>The veins on Yang Xiaodong’s forehead throbbed. He could only see the repulsiveness in that person and wanted so badly to stick a knife into his bloody face. He clenched his teeth, saying, \"Northern Underworld King Tree!\"</p><br/><p>A rare treasure being called as a stick left Yang Xiaodong feeling horrible, as if he’d just swallowed a fly. While he kept telling himself that he had no choice but to lower his head, since he was under someone else’s roof, he couldn’t help but feel the rage surging within his chest.</p><br/><p>He practically stopped after each word for emphasis.</p><br/><p>Ai Hui exclaimed in realization, \"I understand, it’s a high-grade stick!\"</p><br/><p>Yang Xiaodong flew into a rage. \"You’re the stick!\"</p><br/><p>With a foolish look on his face Ai Hui asked Yang Xiaodong, \"Why the face? Is it such an amazing stick?\"</p><br/><p>Yang Xiaodong turned his face, his body trembling from anger.</p><br/><p>Mister Dou laughed and explained in a slow-moving tone, \"It can absorb light because it is Northern Underworld King Tree. Northern Underworld was a remote and desolate place with no sunlight all day long because there grew a very unique type of tree, \"Dark Tree\". Dark trees live off of light rays as well, but the difference is that they swallow light and spit out darkness. There is a dark layer on their leaves that can swallow all surrounding light. And this one here is the King of Dark Trees. Only one is born out of every hundred thousand trees.\"</p><br/><p>Ai Hui felt as though he was listening to a story. \"Where’s Northern Underworld?\"</p><br/><p>\"No idea.\" Mister Dou shook his head. \"No one knows where it is anymore. Perhaps they couldn’t go there even if they knew. However, many powerful cultivators entered the Northern Underworld during the Cultivation Era.\"</p><br/><p>Ai Hui responded in interest, \"So this is a remnant from the Cultivation Era?\"</p><br/><p>\"What I got was a seed.\" With a reminiscent look on his face he continued, \"At that time I did not know that it was the seed of the King of Dark Trees. I’d thought that it was just an ordinary seed. Even then, to me it was a treasure, so I cherished it very much and spent much effort nurturing it. It was later on, under a fateful coincidence, that I realized it was the King of Dark Trees.\"</p><br/><p>With his eyes lit up Ai Hui stated shamelessly, \"It is mine now.\"</p><br/><p>Yang Xiaodong stood up and howled, \"Shameless!\"</p><br/><p>He knew how important Northern Underworld King Tree was to Mister Dou. Mister Dou was an extremely powerful Master with the Northern Underworld King Tree, but without it he was merely an ordinary elementalist.</p><br/><p>Mister Dou waved his hand, saying, \"Northern Underworld King Tree has been yours ever since you caught me. I have a bold request, however, and am unsure if I can say it.\"</p><br/><p>It was then that Yang Xiaodong remembered he was now a captive. He sat down with a defeated look on his face.</p><br/><p>Ai Hui glanced over at Yang Xiaodong. This gloomy fellow was easily agitated when it came to Mister Dou’s affairs.</p><br/><p>Mister Dou was calm and honest, which in actual fact made Ai Hui admire him. The old knew better indeed.</p><br/><p>Ai Hui became a tad more respectful. \"Please speak.\"</p><br/><p>\"I don’t have much time left to live. The Northern Underworld King Tree would be wasted in my hands. It has an extremely long life and the ancient books mentioned that it will not be destroyed as long as there’s light and that it will only grow each day. It’s only been in my hands for a few decades. It would be a real waste if this were to be buried and disappear.\"</p><br/><p>Yang Xiaodong had calmed down significantly and kept silent. He knew that these words were for him.</p><br/><p>\"I’ve been trying to understand the Northern Underworld King Tree for a few decades and have obtained some insights. I’m willing to pass it all down to you without concealment. I only hope that you can take the children of my stronghold into your care.\"</p><br/><p>Yang Xiaodong’s expression returned to normal. He’d understood the moment Mister Dou spoke. He was, after all, born from the stronghold and knew what Mister Dou was concerned about.\"</p><br/><p>\"Stronghold’s children?\"</p><br/><p>Ai Hui fell into a short daze, but after thinking about it he thought that it was only human nature. He nodded in agreement.</p><br/><p>Everybody then followed Mister Dou to the stronghold.</p><br/><p>Ai Hui looked at the extremely tanned kids who had gathered around. Shocked, he shouted, \"You’re surely formidable, aren’t you? So many of them!\"</p><br/><p>Awkward silence.</p><br/><p>Mister Dou who kept a straight face always, became very emotional for the first time. His face turned rigid, his expression hardened. His whole body stiffened up and his face turned red.</p><br/><p>He opened his mouth but no sound came out because he did not know how to start.</p><br/><p>The rest looked on awkwardly.</p><br/><p>Yang Xiaodong was about to speak up, but Ai Hui had already tapped Mister Dou’s shoulder and said, \"Don’t worry, Old Dou. From now on, Central Pine Valley is home to you and your children. You’re a responsible man, Old Dou! It mustn’t be easy having so many children!\"</p><br/><p>Mister Dou’s face turned redder. He’d experienced a cruel life and had never seen such a scene. He was at a loss.</p><br/><p>He was about to explain himself, but Ai Hui had already turned around and started mingling with the kids, his face full of smiles.</p><br/><p>The little kids were initially very guarded, but quickly warmed up to Ai Hui.</p><br/><p>Mister Dou, whose face was initially flushed, started to calm his emotions down. A smile appeared on the corner of his mouth. He had no regard for the material world but had an exceptionally keen intuition when it came to emotions. He could feel that Ai Hui had not the least bit of enmity toward the children. Even Shi Xueman and Lou Lan were genuinely happy.</p><br/><p>Yang Xiaodong looked at him without speaking a word, but his gloomy face brightened up a little.</p><br/>\n</div>"}