{"title": "Chapter 486: Night Moth Fruit", "id": 486, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-486-night-moth-fruit", "volume_title": "Volume 5", "body": "<h1>Chapter 486: Night Moth Fruit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 486: Night Moth Fruit</p><br/><p>Translator: Irene Editor: X, TYZ</p><br/><p>Night Moth Fruit?</p><br/><p>Ai Hui had not heard of it, but he knew it was powerful.</p><br/><p>The numbness was spreading at an alarming rate, and the elemental energy within his body was actually unable to resist it at all. He had come across many types of poison in the Wilderness, but none were comparable to this.</p><br/><p>Highly toxic types that were effective against dire beasts were rare and correspondingly expensive. Even among the dire beasts that could produce elemental elixirs, he had never encounter one that possessed this grade of poison.</p><br/><p>Ordinary poisons were basically useless against Masters.</p><br/><p>I wonder how much they cost? Must be expensive…</p><br/><p>A thought that even he found silly floated across his mind. Ai Hui’s consciousness started to become indistinct as his field of vision started to blur. Zheng Xiaoman’s scream sounded like an echo from a the valley, traveling further and further away.</p><br/><p>\"… Hahaha, Lightning Master, so what? Let’s die together…\"</p><br/><p>His title had never been a big deal. Ai Hui never felt excited or pleased over his status as a Lightning Master, so her words meant nothing to him. He was , however, bothered by the latter part of her sentence.</p><br/><p>Let’s die together…</p><br/><p>He had no idea why, but an image of Master and Mistress leaving together emerged from within his head. If death was the conclusion, an ending like Master and Mistress’s would be quite beautiful.</p><br/><p>As for this lady whom he wasn’t acquainted with…</p><br/><p>Did she deserve that?</p><br/><p>An indescribably fury rose from his chest and rushed straight to his brain. He didn’t know why he got this angry, but he did. Coming out of nowhere and shouting about wanting to die with him?</p><br/><p>Who did she think she was?</p><br/><p>He felt enraged. It had been a long time since he had been this angry. This unreasonably angry. These three words were fine if Lou Lan had said them. If Iron Lady had said them. If Mingxiu had said them. If Fatty said them. It was even alright for Duanmu Huanghun to say them. Anyone from the Central Pine Faction could say them.</p><br/><p>They were not something any random person had the right to say!</p><br/><p>If he let such a moron get away with it, wouldn’t that mean that he was the bigger moron?</p><br/><p>The anger that was about to explode in his chest snapped Ai Hui out of his fuzzy consciousness and made him more clear-headed. The numbness had intensified, as if there were many hair-like worms drilling toward his elemental energy as well as into his five residences and eight palaces.</p><br/><p>While he clear-headed, he quickly waved a finger of his still mobile right hand, as if thrusting his sword. Swoosh, an arc of electricity appeared on his fingertip.</p><br/><p>He did not know what kind of poison the Night Moth Fruit was, but he knew that other than the elemental energy within his body, there was a huge volume of elemental energy being converted into lightning.</p><br/><p>What kind of poison would be able to endure lightning!</p><br/><p>Since you’re here, don’t ever think about leaving!</p><br/><p>Ai Hui tossed all his apprehensions to the back of his mind, as a frenzy manifested in his eyes.</p><br/><p>To the others, he was a cool-headed, almost cold person who enjoyed taking advantage of others. He was somebody who acted only when he had a plan.</p><br/><p>Not many remembered his wild side. The side that was hidden deep within the calm.</p><br/><p>He jumped off the ground, his figure disappearing before the eyes of those present. A few holes appeared on the roof of a nearby house.</p><br/><p>Shi Xueman was the first to react. She turned around, her ice cold face with bloodlust overflowing as she shouted, \"Grab all of them!\"</p><br/><p>At this point, she couldn’t care less about the Lu Residence.</p><br/><p>Mu Lei’s face warped and as he was about to speak up, Shi Xueman’s ice-cold, yet baleful gaze effectively shut him up. He knew it was self-deprecating to talk about a Master’s dignity at this point. If he made any unusual moves, Shi Xueman and the others wouldn’t hesitate to kill him on the spot.</p><br/><p>He saw the determination in Shi Xueman’s eyes and stopped himself from resisting.</p><br/><p>Uncle Yu raised his arm and called out, \"Put down your weapons, everyone! No resisting!\"</p><br/><p>His mind was currently in a mess as doubts filled his heart. Howy did Zheng Xiaoman blend into the team? The feud between the Grass Bandits and the Lu Residence ran deep because the former’s destruction was directly caused by the latter. Master Lu was furious upon hearing that Mingxiu was almost killed by the Grass Bandits, so he made an all-out effort to wipe them out.</p><br/><p>No matter how much hatred Ai Hui felt toward the Grass Bandits, could it surpass the amount felt by the Lu residence? Giving up on vengeance against the Lu residence, spending so much effort to sneak into the convoy, and coming all this way to seek revenge against Ai Hui?</p><br/><p>A mole! There must be a mole!</p><br/><p>Only those in the Lu residence who had decent ranks knew about Miss’s plan to send gifts to Ai Hui.</p><br/><p>Who could it be? Why?</p><br/><p>Uncle Yu knew that the wisest thing to do now was to cooperate with Shi Xueman and her people’s investigation. He must not resist. Once conflict occurred between both parties, they would fight to the death.</p><br/><p>If anything happened to Ai Hui, Uncle Yu would really be too ashamed to face Miss.</p><br/><p>It wasn’t a big deal if he died. It was the aftermath that would be truly terrifying. The Central Pine Faction was much stronger than imagined. Plus, they had the mighty Le Buleng who harbored enmity toward the Lu residence. By then, Miss would have no regard for the Lu residence either. Uncle Yu knew how important Ai Hui was to her.</p><br/><p>Who was it?</p><br/><p>Uncle Yu broke out in a cold sweat that drenched his back.</p><br/><p>He hadn’t noticed that there was a guard behind him. The guard was thoroughly frightened and drew close to him for support.</p><br/><p>\"Stand properly! No one move!\"</p><br/><p>Hearing Jiang Wei’s order, not only did the guard behind Uncle Yu not stop, he increased his speed. Appearing right behind Uncle Yu in one big stride, his hand was about to smack Uncle Yu’s head.</p><br/><p>Just as his strike was about to land, an unusual and zealous blush appeared on his face. In the next moment, Uncle Yu’s head would split open like a watermelon, its contents spilling out everywhere. His mission would then be completed.</p><br/><p>The hatred between the Lu Residence and the Central Pine Faction would never be dissolved.</p><br/><p>Uncle Yu was a trusted member of the Lu Residence, yet he was going to die within the Central Pine Faction’s territory. Additionally, Ai Hui, the leader of the Central Pine Faction, was going to die from the Lu Residence’s sneak attack.</p><br/><p>This was a deadlock!</p><br/><p>A deadlock that was about to be finished by his own hands. The excitement made his whole body tremble uncontrollably.</p><br/><p>Thump!</p><br/><p>The tactile sensation from his hands made his heart quiver, but an incoming, splashing ball of yellow sand took him by surprise in the next moment.</p><br/><p>Lou Lan!</p><br/><p>Lou Lan blocked his strike at this crucial moment.</p><br/><p>The rest reacted very quickly. Shi Xueman swiftly appeared beside this guard. With her palm opened slightly, she aimed for the guard.</p><br/><p>There was only despair in the guard’s face. He did not even resist.</p><br/><p>Not good, Shi Xueman thought to herself.</p><br/><p>A black layer appeared on the guard’s face. A poisonous pellet had long been placed inside his body, and he would die on the spot when it took effect.</p><br/><p>Shi Xueman looked at the corpse on the ground, her expression grave. Only the fearless would use such a method.</p><br/><p>Uncle Yu’s face was beyond pale. The assassin’s intention was obvious. If he’d died, the enmity between the Lu residence and the Central Pine Faction would never be resolved unless one party was wiped out.</p><br/><p>Who was it exactly?</p><br/><p>He was simultaneously shocked, furious, and determined to seek the truth.</p><br/><p>First the Grass Bandits and now the assassin. There must be a spy in the Lu Residence since both had infiltrated into the convoy.</p><br/><p>Mu Lei, who stood beside Uncle Yu, had observed these events with a cool eye. He felt regretful for being part of this affair. The series of unforeseen events made it apparent that this was a meticulously planned conspiracy.</p><br/><p>So, he decided that it was best to keep his mouth shut.</p><br/><p>Uncle Yu gradually regained his composure. He’d been following his master his whole life and was used to seeing all kinds of incidents. After experiencing the initial shock and anger, he quickly calmed down. He was most worried about the Night Moth Fruit in Ai Hui’s body.</p><br/><p>The Lu Residence was a wood elementalist Famly, so it was only natural for Uncle Yu to know about this poison.</p><br/><p>There were 12 types of highly toxic poisons that could threaten even a Master’s life. They were collectively known as the [12 Taboos].</p><br/><p>The [12 Taboos] received much opposition from Masters and any information regarding their planting methods were sealed off. No matter how small, the moment news was heard regarding the Taboos, Masters would not hesitate to join forces to obtain them.</p><br/><p>The Night Moth Fruit was fourth on the list. It was an existence that greatly influenced a Masters’ behavior.</p><br/><p>Instead of categorizing it as a poisonous object, it could instead be regarded as a peculiar dire beast. This was a point of debate among Masters. Under normal circumstances, the Night Moth Fruit had no vital signs. It was like a dead object. When it exploded, however, the black smoke it released was known as Night Moth Smoke. It would come alive the moment it touched flesh and become thread-like Night Moth Larvae.</p><br/><p>Even the toughest of skin and bones that were able withstand a sword were helpless before the Night Moth Smoke since it disregarded elemental energy defenses. After coming to life and entering the flesh, the elemental energy in an elementalist’s body would become nutrients for the larva.</p><br/><p>These larva appeared in large quantities and could multiply at an alarming rate within an elementalist’s body. They would freely swim and permeate every corner of an elementalist’s five residences and eight palaces.</p><br/><p>When they started to mature, they would assemble somewhere within a Master’s body and transform into a cocoon.</p><br/><p>By then, the Master would already be in the final phase of life as his elemental energy had been completely sucked away. All that remained was his withering flesh. When a Night Moth King broke out from the cocoon, it would gnaw on the lifeless body until the corpse was bare bones.</p><br/><p>The only person who could save Ai Hui was Dai Gang!</p><br/><p>But Dai Gang was tens of thousands of miles away…</p><br/><p>Uncle Yu felt absolutely bitter and pained.</p><br/><p>No one paid them any attention. Shi Xueman waited for them to rush out as she looked toward the sky.</p><br/><p>\"Lou Lan…\"</p><br/><p>Shi Xueman looked at Lou Lan with hope and expectation.</p><br/><p>Lou Lan said dispiritedly, \"I’m unable to analyze it, Xueman.\"</p><br/><p>After that Lou Lan started crying. It was his first time feeling this helpless. He was extremely upset and wondered if the grief he felt was the same as that felt by humans.</p><br/><p>Lou Lan was really, really sad.</p><br/><p>Shi Xueman’s eyes were red. She pursed her lips tightly and patted Lou Lan’s shoulders to console him.</p><br/><p>He hadn’t noticed that his Midnight sand core was starting to destabilize.</p><br/><p>Suddenly, a ball of dazzling silver light blossomed in the sky, its domineering breath enveloping all of Blackfish Mouth Mountain.</p><br/><p>In unison, everyone looked skyward even though the silver light was exceptionally eye-piercing.</p><br/><p>Lou Lan raised his head, the red glow in his eyes started to flicker nonstop.</p><br/><p>Still no results?</p><br/><p>The fact that the only thing he was unable to analyze was the very thing that had poisoned Ai Hui made him feel dejected and extremely anxious. He would definitely know what do now if he was a real doctor like Mingxiu’s brother.</p><br/><p>Mingxiu’s brother…</p><br/><p>Lou Lan suddenly stopped. He crooked his head before breaking into a run.</p><br/>\n</div>"}