{"title": "Chapter 485: An Unforeseen Event", "id": 485, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-485-an-unforeseen-event", "volume_title": "Volume 5", "body": "<h1>Chapter 485: An Unforeseen Event</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 485: An Unforeseen Event</p><br/><p>Translator: Irene Editor: TYZ, KLKL</p><br/><p>\"Xiaoshan is in seclusion. Seems like he’s about to break through.\" Shi Xueman announced joyfully.</p><br/><p>Ai Hui genuinely felt happy for Wang Xiaoshan. \"That’s great! He’s been working hard recently.\"</p><br/><p>Everyone nodded in unison. Building a whole city all by oneself was unheard of. The difficulty and workload he’d taken on was astonishing even to laymen.</p><br/><p>Having accomplished such an unimaginable feat, it wasn’t surprising that he was undergoing a breakthrough.</p><br/><p>Le Buleng shot Ai Hui a glance. \"You’re pretty lucky aye, became significantly stronger.\"</p><br/><p>He couldn’t help but give him two more looks as he was still rather surprised.</p><br/><p>Wang Xiaoshan’s seclusion made him realize the huge potential of Central Pine Faction. Furthermore, these fellows were all so diligent. He had much confidence in the future of this faction.</p><br/><p>But Ai Hui’s progress had him overwhelmed with shock.</p><br/><p>How many days had it been?</p><br/><p>Reasonably, a newly promoted Master would enter a process of steadily ascending improvement. Becoming a Master was like having completed an outline of a piece of art and all that was left was to carve and refine it to perfection.</p><br/><p>A newly promoted Master seldom displayed such a huge increase in abilities.</p><br/><p>Ai Hui was an exception.</p><br/><p>Before, Ai Hui’s energy was extroverted. Now, it was exceptionally well-controlled, except that there was a ring of an aura circling his body, its origin unclear. Was it the sword’s qi? Le Buleng’s eyes glowed slightly, his battlelust stirring endlessly.</p><br/><p>The first master swordsman had just been born and he had yet to spar with her.</p><br/><p>This foreign force made him eager to give it a try.</p><br/><p>He was extremely interested in all kinds of new and unseen forces.</p><br/><p>\"Junior Mu Lei is here to greet Senior!\"</p><br/><p>Mu Lei bowed to Le Buleng respectfully with his waist bent and head lowered.</p><br/><p>Having his thoughts disrupted, Le Buleng pulled a face and asked, \"You are?\"</p><br/><p>For someone whose only goal was to defeat Dai Gang, having an unknown Master stand before him was no different from having an ignorant cow or sheep do the same.</p><br/><p>To slaughter or not to slaughter?</p><br/><p>Mu Lei’s heart jumped, his mouth drying up. \"Fei Yuan is my teacher.\"</p><br/><p>Le Buleng’s expression relaxed a little as a reminiscent look appeared on his face. His tone warmed up instantly. \"You’re a student of Fei Yuan? How’s your teacher doing?\"</p><br/><p>A trace of grief flashed across his eyes. \"He died eight years ago.\"</p><br/><p>Le Buleng sighed. \"He didn’t make it after all. But death is just death. It’s also a delight. He would feel vexed seeing how things have turned out.\"</p><br/><p>Mu Lei knew his teacher’s personality and agreed with Senior Le Buleng. He said in a low voice, \"You’re right.\"</p><br/><p>Le Buleng treated Mu Lei in a friendlier manner, but remained as hostile as ever toward Lu residence’s Uncle Yu. He snorted most of the time and couldn’t be bothered to socialize with him.</p><br/><p>Lu Chen was the first disciple of Dai Gang, so it was only natural for Le Buleng to feel this way. If it had been a decently strong disciple from the Lu residence or Lu Chen in Uncle Yu’s spot, Le Buleng might have even wanted to start trouble with him. But since Uncle Yu was weak, he did not deign to make a move.</p><br/><p>Uncle Yu smiled bitterly. He was knowledgeable and tactful, and knew better than to provoke this old, terrorizing fellow.</p><br/><p>Ai Hui was helpless too. The appearance of this old man made people nervous. He asked quietly, \"How’s Zu Yan?\"</p><br/><p>Shi Xueman nodded her head, saying, \"Not bad. He’s absorbing the fire elemental energy speedily but isn’t awake yet.\"</p><br/><p>In response to the change in topic, Le Buleng waved his hand, adding, \"He’ll wake up once he absorbs sufficient fire elemental energy and becomes a Master.\"</p><br/><p>Ai Hui asked out of curiosity, \"What if he doesn’t?\"</p><br/><p>Le Buleng snorted, \"Then he won’t ever.\"</p><br/><p>Ai Hui clicked his tongue and felt much sympathy for Zu Yan. He also felt that Le Buleng’s answer really fitted his personality. That fellow was so cold and heartless.</p><br/><p>Ai Hui reminded Le Buleng, \"Don’t you need to train, Senior?\"</p><br/><p>Le Buleng glared at him. \"Are you chasing me away, boy?\"</p><br/><p>\"Your time is yours to allocate, Senior.\" Ai Hui continued in all seriousness, \"I believe Mister Dai Gang is feeling very bored right now since he has no opponents.\"</p><br/><p>Despite being aware of Ai Hui’s motive, Le Buleng couldn’t help but let out a groan. \"Bullshit!\"</p><br/><p>Before his words fell, he was already in the air.</p><br/><p>With Le Buleng gone, the atmosphere immediately lightened up. Even Mu Lei let out a breath of relief. He recalled something and retrieved a small wooden case from his sleeves. Handing it over to Ai Hui, he explained, \"This is for Duanmu Huanghun. Sent by his family.\"</p><br/><p>Ai Hui took it and casually passed it to Iron Lady. \"Where’s Bangwan? Why isn’t he around?\"</p><br/><p>Shi Xueman grabbed hold of it and answered, somewhat worriedly, \"He’s in the valley. He’s too anxious.\"</p><br/><p>Ai Hui knew what Duanmu Huanghun was worrying about, but was unable to counsel him since he usually did not listen well to advice to begin with.</p><br/><p>Proud and arrogant, Duanmu Huanghun must be feeling very anxious right now.</p><br/><p>But to become a Master, one mustn’t rush because the more impatient one was, the more easily problems would arise.</p><br/><p>By now, Uncle Yu had already ordered the guards to unload the goods on the beasts. Ai Hui threw the matter to the back of his head and commented excitedly, \"Seems like Senior’s sent some good stuff over.\"</p><br/><p>The guards opened the wooden trunks and a layer of faint light filled the hall immediately.</p><br/><p>Even Uncle Yu’s eyes were wide open in shock. The trunks had been packed personally by Mingxiu, so he wasn’t unaware of the contents. Seeing how each trunk emitted elemental energy waves, he immediately figured that there must be a lot of good stuff inside.</p><br/><p>Mu Lei couldn’t restrain his surprise. He knew how valuable Yuchuan Embroidery was.</p><br/><p>He couldn’t help but feel a lingering fear. If outsiders knew how many Yuchuan Embroideries were in these trunks, someone might’ve taken the risk and looted them out of desperation. Even he himself thought he might be unable to resist the urge.</p><br/><p>The number of Yuchuan Embroideries available on the market was pathetically low. People thought that Yuchuan Embroideries weren’t produced easily and that was why they were so rare. That wasn’t actually the case. The real reason was that Lu Mingxiu couldn’t bear to sell them as she wanted to give them to her junior.</p><br/><p>Lu Mingxiu pampered her junior way too much.</p><br/><p>But just the thought of Han Yuqin and Wang Shouchuan was enough for Mu Lei to feel grief and sigh.</p><br/><p>Ai Hui wasn’t aware of all these things of course. He only felt incomparably touched and cozy.</p><br/><p>The most eye-catching item was an entire set of textiles.</p><br/><p>Mixed with the shining silver silk, the azure wings, made from flowing cloud silk, looked like a reflection created by the sunlight shining onto clear water ripples. It was extremely beautiful and dazzling. The azure wings were joined to a soft, silver armor. There were intricate patterns stacked in layers on top of the wings. Ai Hui saw elemental traces like Rapt Attention, Drawing Element and Wedge-shaped Cloud Armor.</p><br/><p>Rapt Attention allowed him to maintain focus and concentration.</p><br/><p>Drawing Element could help him to draw some elemental energy from metal wind. While the amount it could absorb wasn’t much, he could replenish part of it. This was extremely useful for him when he had to fly long distances.</p><br/><p>Wedge-shaped Cloud Armor was a type of water elemental defensive guard piece, often used on water elemental armors. Shi Xueman had it on hers too.</p><br/><p>Ai Hui’s eyes turned red. He’d thought of Master and Mistress.</p><br/><p>His eyes were on the boots beneath the soft armor and he felt rather surprised. The boots had been woven from scratch and he couldn’t recognize the materials used.</p><br/><p>Ai Hui put them on immediately and they fitted very well. He jumped lightly.</p><br/><p>He almost hit the ceiling. While he was shocked, his eyes quickly lit up. These ordinary looking boots were actually very useful. Ai Hui believed that channeling elemental energy into the boots would increase their effectiveness.</p><br/><p>He suppressed the impulse within him and managed to stop himself from testing it out on the spot.</p><br/><p>This seemingly unremarkable, yet life-saving trick should be kept private.</p><br/><p>Other than the items she’d given Ai Hui, there were a few other quality goods, such as a cloak meant for Shi Xueman, a belt meant for Fatty, a pouch meant for Duanmu Huanghun, a wristband meant for Jiang Wei, an arrow sack meant for Sang Zijun and a hat meant for Wang Xiaoshan. Lou Lan was given the most interesting item. It was an apron with an embroidered image of him holding a ladle in one hand and a wok in the other.</p><br/><p>She’d prepared a gift for every single person that she could remember, so everybody was exceptionally moved.</p><br/><p>Some emotional connections could only be made after going through an experience together.</p><br/><p>Other than these personalised things, the rest of the items were mass produced, yet practical items, such as gloves. There were gloves that could increase strength and gloves that could improve one’s control over elemental energy.</p><br/><p>It was obvious that each item had been prepared with love and utmost care. The wooden elemental ingredients were also things they would need frequently, but were difficult to purchase outside of Jadeite Forest.</p><br/><p>Ai Hui walked past each trunk and looked at each item. Senior did not leave any long messages, but each item had effectively expressed her care and concern.</p><br/><p>He thought about how Mistress had instructed him to protect Senior Mingxiu before she left.</p><br/><p>Ai Hui’s nose started to tingle a little as tears were about to fall down his cheeks.</p><br/><p>\"Ai Hui, Miss mentioned that this item…\"</p><br/><p>The guard spoke while taking out the items on the top. The goods seemed to be pressed at the bottom. Preoccupied with his thoughts and emotions, Ai Hui went over without much thought.</p><br/><p>Uncle Yu saw the redness in Ai Hui’s eyes and felt sad, yet consoled. Those two were like siblings after all.</p><br/><p>Suddenly he heard someone speaking. Wasn’t that guard Zheng Xiao? Could it be that Miss had something to warn him about? No. Zheng Xiao was a guard recommended by the enterprise below and not a guard of the embroidery workshop. If anything, Miss would’ve informed him and not Zheng Xiao.</p><br/><p>Not good!</p><br/><p>Uncle Yu’s face changed. \"Be careful…\"</p><br/><p>Before he could complete his sentence, an unforeseen event took place.</p><br/><p>Gathered before the trunk, Ai Hui heard a soft thud and withdrew quickly.</p><br/><p>The trunk was enveloped by a faint, black smoke.</p><br/><p>Ai Hui shouted, \"Retreat, everybody!\"</p><br/><p>His face started to feel slightly numb. What a potent poison, he thought to himself.</p><br/><p>Lou Lan cried out, \"Ai Hui!\"</p><br/><p>The red glow in his eyes started to flicker. It flashed quicker and quicker, crazier and crazier.</p><br/><p>The others dispersed and surrounded that guard. They looked ferocious and murderous.</p><br/><p>\"Hahaha! It’s useless! You’re dead meat, Ai Hui! It’s Night Moth Fruit! You’re incurable!\"</p><br/><p>Zheng Xiao’s voice became sharp. It was actually a woman.</p><br/><p>Upon hearing those three words \"Night Moth Fruit\", Uncle Yu and Shi Xueman’s faces changed. The rapidly flickering red glow in Lou Lan’s eyes stopped abruptly.</p><br/><p>Ai Hui’s heart sank. He could feel the poison spreading quickly.</p><br/><p>Zheng Xiao unveiled the elemental energy mask on her face and the unfamiliar face of a female was revealed. Only a frenzied madness was present in her face. \"You killed so many of us. The day of redemption is here!\"</p><br/><p>Grass Bandits…</p><br/><p>Uncle Yu recognized the lady and asked in a trembling voice, \"You… you’re Zheng Xiaoman?\"</p><br/><p>The lady laughed but her face started to stiffen up. It was an eerie sight. She replied, \"Who would’ve thought that Uncle Yu would still be able to recognize me. Hahaha, Lightning Master? So what? Let’s all die together…\"</p><br/><p>With her stiff and raised head she fell over, her breath extinguished.</p><br/>\n</div>"}