{"title": "Chapter 492: Dawn of Hope", "id": 492, "volume": 5, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-492-dawn-of-hope", "volume_title": "Volume 5", "body": "<h1>Chapter 492: Dawn of Hope</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 492: Dawn of Hope</p><br/><p>Translator: Irene Editor: TYZ, CakeHermit</p><br/><p>Ai Hui slowly woke up.</p><br/><p>\"Ai Hui’s waking up!\"</p><br/><p>Before he’d opened his eyes, he could hear Lou Lan’s cheer followed by a series of hurried footsteps.</p><br/><p>His blurry vision gradually became clear as familiar and concerned looking faces took shape.</p><br/><p>\"How is it? Are you feeling better?\"</p><br/><p>\"You’re finally awake, Ai Hui. We were so frightened!\"</p><br/><p>\"No knowledge of Night Moth Fruit. How weak.\"</p><br/><p>...</p><br/><p>Everyone greeted Ai Hui messily, but concern was evident in all of their faces. Warmth filled Ai Hui’s heart. He was moved. He wanted to say something, but nothing came out of his mouth. He realized he was completely paralyzed and unable to lift even a finger.</p><br/><p>\"Aye, he can’t seem to talk.\"</p><br/><p>\"Seems like it. He can’t move yet.\"</p><br/><p>\"He’s blinking his eyes. He’s alive.\"</p><br/><p>\"That’s good enough. Let him be. As long as he’s breathing, he’ll be up and jumping in no time.\"</p><br/><p>It was obvious that this joyfully satisfied voice came from Fatty.</p><br/><p>\"Is that right?\"</p><br/><p>\"That’s great!\"</p><br/><p>\"I’m relieved!\"</p><br/><p>\"I think you’re right, Fatty!\"</p><br/><p>Everyone shouted in unison. In the blink of an eye, only Lou Lan was left in the room. Everyone knew very well that Ai Hui had a tenacious vitality. Knowing that he was alive was sufficient to calm their worried hearts and send them back to their own tasks.</p><br/><p>Having just witnessed the fall of An Muda, everyone was aware that the battle was about to start. Never had there been such an intense pressure. People knew that the front line battle could explode at any time and that they could soon be conscripted.</p><br/><p>With regard to battling against the Blood of God, every single member of the Central Pine Faction felt enthusiastic.</p><br/><p>It was a nightmare that had taken away countless lives and even the survivors had mostly lost the will to fight; yet, some would never forget the pain, grief, and despair that it had caused them.</p><br/><p>The seed of hatred had long been planted. It had since sprouted and grown significantly.</p><br/><p>Regardless of the reason for it or what the future held, hatred was hatred and always carried blood.</p><br/><p>People feared battle mainly because they feared death and despair, but these avengers, they had already lost everything and experienced absolute despair. As long as they lived, they would be unable to forget the bloodshed that had taken place in Central Pine City. They wouldn’t forget their classmates, teachers, and the familiar faces which had lay amidst blood pools, being swallowed up by blood fiends one by one.</p><br/><p>All along, living had been worse than being dead.</p><br/><p>Ai Hui had recovered significantly by the second day, proving that their impression of his tenacity was correct. On the third day, Ai Hui could already sit up.</p><br/><p>Seeing himself in this state, Ai Hui could only laugh bitterly. His whole body was wrapped in the bandage. He looked like a living mummy. His bare skin was charred and cracked wounds could be seen all over. Although they had started to scab, it was still a shocking sight.</p><br/><p>\"Don’t worry, Ai Hui. Bangwan’s gotten a lot of materials and I’ve already found some methods to deal with it. The fruit within your body was damaged by lightning so it’s returned to its dormant state. This phenomenon is not relevant to the materials Bangwan’s provided, but I’ve already separated out some laws of its behavior. I’ll treat you for sure, Ai Hui!\"</p><br/><p>Lou Lan supported Ai Hui up while encouraging him.</p><br/><p>Ai Hui smiled, but his face was wrapped in the bandage so only his eyes were exposed.</p><br/><p>Lou Lan caught it, however, and responded happily, \"Lucky there was the bandage to help Ai Hui isolate the lightning strikes, otherwise, you would’ve sustained more injuries.\"</p><br/><p>Since the start, the bandage had saved Ai Hui countless times.</p><br/><p>He thought about Master and Mistress before his mind drifted to Mingxiu and Uncle Yu. There must be a problem, he just knew it. He knew for a fact that Mingxiu would never hurt him. There was no doubt about it.</p><br/><p>But he would have to deal with this matter after his recovery.</p><br/><p>Lou Lan carefully placed Ai Hui under the sunlight.</p><br/><p>Basking in the sun, his whole body felt warm and indescribably comfortable.</p><br/><p>Lou Lan sat by Ai Hui’s side, narrating the events that had unfolded. Ai Hui listened with keen interest, but upon hearing about An Muda’s death and the glorious tracks he’d left, Ai Hui fell into a daze.</p><br/><p>Subconsciously, his gaze fell upon Shi Xueman, who stood not far away and supervised everybody’s training while holding Cirrus.</p><br/><p>Iron Lady must be feeling very upset.</p><br/><p>Ai Hui felt that Iron Lady was really strong. The pain he’d felt when Master and Mistress passed was unforgettable. Ai Hui thought about what An Muda’s death meant for the front line and Iron Lady’s father, Shi Beihai. The situation must be rather tough right now.</p><br/><p>Her teacher had passed and her father was in danger, yet she was unable to help. Such pain was simply too harsh.</p><br/><p>Spear of Heavy Cloud’s training was very structured. What Ai Hui had not expected was for Sword of Lightning’s training to go on as usual. He’d thought that training would have ceased when he’d fallen into a coma.</p><br/><p>He only realized it when he saw Shi Xueman asking Gu Xuan about how effective Sword of Lightning’s training was.</p><br/><p>Only one thought ran through his head. He must recover as soon as possible!</p><br/><p>Seeing how Iron Lady assumed even more heavy responsibilities despite her sorrows and worries, Ai Hui only felt greater respect for her.</p><br/><p>He felt that he, himself, might not have been able to do it.</p><br/><p>Iron Lady looked as calm as always, but right now, this calmness only made Ai Hui feel her unyielding attitude and the powerful force contained in her delicate body.</p><br/><p>Wait. Delicate body… Something is amiss, thought Ai Hui.</p><br/><p>Alright, time to think about how to quickly recover.</p><br/><p>Seeing how everyone was dripping with sweat and working diligently, Ai Hui felt ashamed as he was practically wasting precious time.</p><br/><p>Ai Hui only became aware of just how terrible the condition of his body was when he started checking.</p><br/><p>Almost all of his residences and palaces had been destroyed. The lightning gathered in the cloud layer was simply too intense and had far exceeded what his body could endure. As Lou Lan had said, without the bandage, he would have had close to zero chances of surviving.</p><br/><p>To an elementalist, having his residences and palaces destroyed was no worse than drowning and being reduced to a handicapped person.</p><br/><p>He’d only recently been promoted to a Master and was then suddenly struck by such a destructive force. If he had been any other elementalist, he might never have been able to recover from this setback. His recently gained immense power had vanished. What did it mean to be a Master and what did it mean to lose his status as a Master?</p><br/><p>It was all the more painful since he’d lost something he’d just recently gained. It probably felt equivalent to a fall from heaven into hell.</p><br/><p>Ai Hui did not feel pain and disappointment. Instead, he felt extremely glad and renewed.</p><br/><p>At that time, it had been his only way out.</p><br/><p>At least he was still alive and could think of solutions while basking in the sun.</p><br/><p>Ai Hui was tenacious. The situation before him was horrible, but he understood that there was no time to feel dispirited and in despair. Senior Le Buleng had failed to have a breakthrough eight times and had been more wretched than he was right now; yet, he never stopped trying to get stronger.</p><br/><p>There’s hope where there’s life.</p><br/><p>Judging from the holes in his residences and palaces, Ai Hui could imagine how the sky full of lightning had gathered in his body to destroy the vigor within. He did not just injure his residences and palaces, but also the foundation of his vitality.</p><br/><p>Over eighty percent of his flesh was severely wrecked and might not even recover.</p><br/><p>Heaven never completely barred one’s way. Ai Hui noticed something.</p><br/><p>There was a wisp of silver mist floating quietly within his utterly damaged earth palace. This ball of mist was extremely weak and would have been difficult to detect if not for his attention to detail.</p><br/><p>The silver mist flickered like the mist above the Silver Mist Sea.</p><br/><p>When Ai Hui consciously tried to approach this ball of mist, a thick aura of lightning shook him up.</p><br/><p>He felt rather disappointed. The elemental energy within his body had been exhausted, so of what use was the lightning? Injuries to the five residences and eight palaces were, to elementalists, extremely burdensome, albeit curable. If the five residences and eight palaces were completely destroyed, there was simply no way to reverse it.</p><br/><p>In other words, he would be unable to train his elemental energy from now on.</p><br/><p>Lightning wasn’t of much use to him.</p><br/><p>But why was there a remaining wisp of lightning within his body? He was somewhat suspicious, but on second thought, felt it was natural. Having had his body cleansed by so many lightning strikes, it shouldn’t be surprising that some remained within.</p><br/><p>Wait!</p><br/><p>Ai Hui suddenly realized what was amiss. Finding remnant lightning in his body wasn’t the strange part; why would that remaining wisp be a silver mist?</p><br/><p>Then it hit him.</p><br/><p>That’s right, remnant lightning would never become silver mist!</p><br/><p>His mind kept going back to the silver mist. He felt thankful that he’d once cultivated the sword embryo and Skyheart Flaming Lotus Lamp in his sky palace, as they had strengthened his mind significantly. His body was severely injured, but his mind was working decently well.</p><br/><p>He submerged himself into the silver mist and was wrapped by a familiar sensation.</p><br/><p>Sword aura!</p><br/><p>Ai Hui felt indescribably agitated and his mind became unstable. He shortly broke away from the mist, but was unable to hold back the ecstasy within his heart. He knew what that silver mist was!</p><br/><p>It was the sword embryo in his earth palace. The remnant pieces left by the lightning.</p><br/><p>With the shattering of the sword embryo and the exceptionally dense lightning aura, this peculiar type of silver mist had been formed.</p><br/><p>Ai Hui’s mind spun quickly. He was like an agile and avaricious hunter seeking whatever opportunities he could make use of.</p><br/><p>The bandage, wrapped around his whole body, revealed its eyes. They glowed and flickered within the shadow cast by the sunlight.</p><br/><p>After much thought, he still did not know much. Perhaps it was two hours or four hours later when his mind returned to the silver mist.</p><br/><p>This time, his state of mind was exceptionally calm and he wasn’t irritable or stirred.</p><br/><p>He slowly and carefully felt this wisp of extremely frail silver mist. He moved very slowly and cautiously.</p><br/><p>Soon he was certain that his thought was correct. This extremely weak silver mist was a remnant shattered piece of sword embryo left by the lightning, but there was a subtle difference within.</p><br/><p>The sword embryo in his earth palace had been a sword of lightning that in itself contained very strong lightning attributes.</p><br/><p>The Nature’s lightning that had penetrated his body had been powerful and aggressive, but had had similar properties to the sword embryo. Ai Hui could imagine how the lightning had been instantly absorbed by the sword embryo in his earth palace upon entering his body.</p><br/><p>The huge volume of lightning that had gathered in the sword embryo had far exceeded its level of endurance, hence the sword embryo had been completely wrecked and transformed into mist.</p><br/><p>At the same time, however, channeling a huge volume of lightning meant that the sword embryo had been thoroughly tempered once. No, many times. Even if it was destroyed, the lightning continued to flood his body and the sword embryo mist continued undergoing many rounds of ‘tempering!’\"</p><br/><p>It was no wonder the lightning aura of the silver mist was so dense.</p><br/><p>Bearing and surviving through so many sessions of tempering...</p><br/><p>At this moment, Ai Hui’s eyes were sparkling. He saw the dawn of hope.</p><br/>\n</div>"}