{"title": "Chapter 526: Sword Operator", "id": 526, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-526-sword-operator", "volume_title": "Volume 6", "body": "<h1>Chapter 526: Sword Operator</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 526: Sword Operator</p><br/><p>Translator: Cynthia Editor: TYZ, CakeHermit</p><br/><p>As long as safety precautions were taken, the Pinwheel Sword was actually safe enough to operate.</p><br/><p>The light curtain shrouding the Pinwheel Sword had a strong defensive power. In the durability tests, only the combined bombardment of seven or more sword pagodas could do damage to it.</p><br/><p>With the protection of the light curtain, Ai Hui accelerated his pace.</p><br/><p>There was only one sword operator? Of course not! Everyone should try it at least once. The sword operators who performed well would get double shares of elemental soup, while those who performed poorly would have no elemental soup.</p><br/><p>Gu Xuan was today’s sword operator. At first Ai Hui thought highly of his performance, but during the last stage, however, due to an operating error, the Pinwheel Sword plunged into the ground.</p><br/><p>The Pinwheel Sword’s comprehensive power was incredibly inferior to that of a God-subduing Peak in terms of defense and attack force, but it had one advantage. Its speed.</p><br/><p>The Pinwheel Sword’s speed astounded everyone who witnessed it.</p><br/><p>Flying was nothing new, as nowadays everyone had their own azure wings, but compared to flying with the Pinwheel Sword, flying with azure wings was as slow as a snail. Many believed that the Pinwheel Sword’s name was terrible. It should be named Lightning Sword!</p><br/><p>When flying, the Pinwheel Sword was as fast as a bolt of lightning.</p><br/><p>But as a result of its extreme speed, any inaccuracy when operating it might lead to accident.</p><br/><p>This was too difficult for a new sword operator with no prior experience.</p><br/><p>Ai Hui found that not everyone could do the job. Only those who were talented in perception of speed could adapt to the amazing speed of the Pinwheel Sword. He immediately realized the importance of sword operation, especially to future expansions.</p><br/><p>As a result, Ai Hui specially bestowed a title to the person who was in charge of operating the Pinwheel Sword: sword operator. A sword operator held the same position as a pagoda master. This soon attracted the interest of the other team members. Now there were seven sword pagodas. Ai Hui himself was in charge of the Megrez Sword Pagoda, while the masters and probationary masters of the other six pagodas had already been assigned to different members.</p><br/><p>Now there was one more position.</p><br/><p>Ai Hui gave an inviolable order.</p><br/><p>Everyone must try to operate the Pinwheel Sword at least once, and the others must be in it during the attempt.</p><br/><p>Since there would be no danger at all as long as they were strapped in tightly enough.</p><br/><p>Since then, the Pinwheel Sword had been inserted into both the mountain and ground in various directions and positions.</p><br/><p>No one knew how many times the poor Blackfish Mouth Volcano had been pierced by the Pinwheel Sword these days. The surface of the mountain was full of bumps and hollows, which looked shocking upon being seen. Once, they had even pierced through the entire rock stratum, creating a magma jet that had rushed over three hundred meters into the sky.</p><br/><p>Previously, there might have been some strong dire beasts in the dark eyeing them as prey, but now, there was not a single beast that dared to keep a foothold within three hundred miles.</p><br/><p>At first, the members felt dizzy and vomited a lot, but they later got so used to it, they even thought it was no longer exciting enough.</p><br/><p>Even so, only three were regarded as qualified sword operators.</p><br/><p>To find these three sword operators, the price Ai Hui paid was three Pinwheel Swords.</p><br/><p>The light curtain around the Pinwheel Sword had a strong defensive power, but the sword itself was not tough enough. Sturdy as it was, the materials it was made of were not of a high enough level. After repeatedly enduring such strong impacts, it could not be used for long.</p><br/><p>But it didn’t matter, as the cost to make a Pinwheel Sword was cheap!</p><br/><p>Had he damaged one of the God-subduing Peaks, Ai Hui would be so heartbroken and unable to sleep, but he didn’t really care if one Pinwheel Sword was destroyed. He could easily make a new one.</p><br/><p>Blind He had taken a lot of time and effort to make the first Pinwheel Sword, but to a weapon master of his level, a weapon once produced could be reproduced with little difficulty. Besides, no high-level materials were used to make a Pinwheel Sword. Except for their large size, he encountered no problems when making new swords.</p><br/><p>On top of all this, Master He would not be content with simply copying the original style.</p><br/><p>Since tests were ongoing and materials were consistently provided, why not try more styles? It was almost instinctive for people like Blind He to aim for better quality and faster speed.</p><br/><p>So every time, Blind He would make some changes and adjustments.</p><br/><p>As a result, the current Pinwheel Sword was quite different from what it had been before.</p><br/><p>Previously, the iron frames and fences had been crude, like seven metal baskets carried on a shoulder pole. That was where the name Metal Basket Sword Pagoda had come from. Now it was a wide sword made with lots of Pearblossom Dazzling Silver, and the sword itself had been toughened. The wide sword was like a long field used for martial arts practice. The seven sword pagodas had white walls and dark blue tiles. They were properly distributed according to the locations of the Big Dipper’s seven stars.</p><br/><p>The Pnwheel Sword was located at the end of the tilt.</p><br/><p>Master He also designed a space for the sword operator which could accommodate three sword operators at a time. In this way, even if an operator were to be injured, he or she could soon find a replacement. The operating device was designed as a sword inserted into a ball, so as to match the name of \"sword operator\". Holding the tilt of the sword in hand, a sword operator could easily control the flying direction of the Pinwheel Sword.</p><br/><p>The broadened sword allowed for more space, and Master He added more seashell bags to store snow lava. In this way, the flying distance of the Pinwheel Sword could be largely increased.</p><br/><p>Besides, the Pinwheel Sword was equipped with eight more sword altars, each of which could accommodate six people. Altogether, the sword altars could accommodate forty-eight team members in total. A sword altar could make some low-intensity attacks to support the people in the sword pagoda in case of any casualties.</p><br/><p>To confuse enemies, Unity Swords were hung under the Pinwheel Sword in a circle as spare swords.</p><br/><p>The Unity Swords could resonate, so when flying, the Pinwheel Sword made a clear and melodious chime, like that of a wind chime. Ai Hui and the others also noticed that as long as there were more than thirty-six Unity Swords on the Pinwheel Sword, the chime they could produce was able to influence the elemental energy flow of their enemies.</p><br/><p>An inspiration occurred to Ai Hui. He thought of his [Sword Chime]</p><br/><p>So he spent some time rearranging the Unity Swords, after which the clear sword chimes, when put together, became loud and resonant, like a bell from an old temple deep in the mountains.</p><br/><p>The temple bell-like sword chime had a strong deterrent power towards elemental energy. Gu Xuan and the others had experienced themselves that when the Pinwheel Sword suddenly appeared above their heads and the loud bell rang like an explosion, their minds became totally blank and their elemental energy stopped flowing.</p><br/><p>The cool debut of the Pinwheel Sword made Ai Hui very excited.</p><br/><p>Unfortunately, he didn’t know whether or not the sword chime could influence the blood spiritual force of blood elementalists. This had to be tested on the battlefield.</p><br/><p>After Master He’s improvements, the new Pinwheel Sword became more powerful and had the potential to be a trump card in the war.</p><br/><p>As they adapted to flying on the Pinwheel Sword, the on-sword training finally began.</p><br/><p>Shi Zhiguang was one of the new sword operators, and the one who operated the sword during the first maneuver. The other two operators looked at him with admiration, but since Shi Zhiguang was indeed the most outstanding one of the three, no one had any objections.</p><br/><p>Shi Zhiguang looked excited.</p><br/><p>He used to be an ordinary team member with no special talent. His remarkable performance was beyond even his own expectations. Until today, he still felt like he was in a dream.</p><br/><p>He himself hadn’t known his specialty before, as in a low-speed situation, he was no different from ordinary people. If the speed was increased to or above a certain level, however, he would enter into a stimulated state and the flow of his elemental energy would accelerate uncontrollably. In contrast, the world would appear to slow down in his eyes.</p><br/><p>Shi Zhiguang enjoyed this feeling very much.</p><br/><p>Stepping on the sword, Ai Hui walked to Shi Zhiguang and encouraged him, \"Just do as you are used to.\"</p><br/><p>Shi Zhiguang was excited. \"Yes, Boss!\"</p><br/><p>Previously, as a member of Sword of Lightning, he would kick up a fuss against senior together with everyone else, but this was the first time senior talked to him particularly and in person. He was greatly encouraged, as he could feel Ai Hui’s expectations of him.</p><br/><p>Everyone got ready. They were very serious and cautious towards the first aerial trial.</p><br/><p>Meticulous attention to detail could be seen on everyone’s faces. The Pinwheel Sword was solemn and soundless.</p><br/><p>Ai Hui said in a deep voice, \"Start!\"</p><br/><p>Shi Zhiguang tried to calm himself down. He gently pulled the sword operator and the Pinwheel Sword left the ground, rushing into the sky like a sword ray.</p><br/><p>It made a circle high in the sky. Ai Hui glimpsed satisfiedly at Shi Zhiguang. He marveled in his heart that Shi Zhiguang, whom everyone had thought was average and untalented in every aspect, unexpectedly possessed an excellent gift in speed.</p><br/><p>Ai Hui knew that even he himself could not do as well as Shi Zhiguang. The Pinwheel Sword glided as though on ice, without any jolts. Even the circle it made was perfect.</p><br/><p>\"Everyone, get ready.\"</p><br/><p>Hearing Ai Hui’s warning, the team members held their breath. Ai Hui didn’t use the Edgeless Sword which was of better quality, but he chose a Unity Sword due to its resonant effect.</p><br/><p>Then, hearing a Sword Chime, all of them waved the Unity Swords in their hands at the same time, rippling the air with their sword rays.</p><br/><p>The sword rays were as bright as the snow and gathered at the sword. Ai Hui, who was fully concentrated, suddenly felt the Unity Sword in his hand become heavy.</p><br/><p>He knew this was not because of a change in the sword’s weight, but because of the load created by the two hundred sword rays converging on the sword. He was familiar with such a load, but this time he felt something different.</p><br/><p>It was the resonance of the Unity Swords hanging on the other side of the Pinwheel Sword under his feet.</p><br/><p>But there was hardly any time for him to think more. Under the Imbuement of Sword Cloud status, Ai Hui pushed the Unity Sword in his hand forward gently, as if he was holding a glass full of water.</p><br/><p>The glaring sword ray flew out of the Pinwheel Sword and effortlessly pierced into the mountains not far away, leaving a bottomless hole. Then, accompanied by a tremendous sound, something suddenly exploded and left a huge hole with a diameter of over thirty meters at the entrance.</p><br/><p>A red glint flashed across the black crystal chips on Ai Hui’s eyes.</p><br/><p>It was an amazing surprise that the sword move could have the effect of a shock wave.</p><br/><p>Previously, the sword move could only leave a bottomless hole, the diameter of which was similar to that of a bowl. Now, the large, deep hole at the entrance was the result of the sound explosion alone.</p><br/><p>Ai Hui immediately realized that the sound explosion was actually a follow-up damage which would give them more advantages in actual combat. This also meant that the training done during these days had not been a waste of time. The move had been completed perfectly just now.</p><br/><p>Regardless, Ai Hui knew that this was not enough.</p><br/><p>In the battlefield, flying at a constant speed like this was courting death. The Pinwheel Sword was so conspicuous that once it appeared on the battlefield, it would immediately be targeted by all the enemies. Strong as it was, the defensive power of the light curtain would be of no use on the battlefield. Even the light curtain of the God-subduing Peaks had been broken through, let alone the Pinwheel Sword.</p><br/><p>The only way to survive would be to keep changing their location beyond the predictions of the enemies.</p><br/><p>This was a great challenge not only to Shi Zhiguang, but to all the members in the sword pagodas as well.</p><br/>\n</div>"}