{"title": "Chapter 523: The Boundary of Ring", "id": 523, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-523-the-boundary-of-ring", "volume_title": "Volume 6", "body": "<h1>Chapter 523: The Boundary of Ring</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 523: The Boundary of Ring</p><br/><p>Translator: Cynthia Editor: TYZ, KLKL</p><br/><p>To everyone’s surprise, Ai Hui, with the sword in his hand, jumped onto the Metal Basket Sword Pagoda that was slowly floating up.</p><br/><p>At this moment, Ai Hui was giving off a piercingly cold aura like an unsheathed sword.</p><br/><p>Standing on the pagoda, Ai Hui felt excited. He could feel the strong power contained in the pagoda under his feet. The idea of making a pinwheel came as a flash of ingenuity, but the result was far better than he expected.</p><br/><p>His biggest problem had been figuring out how to control the Ring of Life to maintain its Shouchuan Ring status.</p><br/><p>The pinwheel perfectly solved this problem.</p><br/><p>The blades of the pinwheel were made from five different materials and could effectively control the amount of elemental energy participating in the Ring of Life. With its curly structure, the elemental energy would flow in a vortex. This not only increased the power greatly, but could also maintain a stable output of elemental energy.</p><br/><p>Pinwheel Ring was an original creation by Ai Hui due to his flash of ingenuity as well as his profound accumulation of knowledge day by day.</p><br/><p>An amazing power was transmitted via the multi-colored flowing light at the end of the sword, and the Metal Basket Sword Pagoda was quaking.</p><br/><p>Ai Hui was well prepared. As he expected, the power of the pinwheel would gradually increase until it reached a new equilibrium.</p><br/><p>Then the multi-colored flowing light began to diffuse. It was as if a ball of dough was being rolled out really thinly. It covered the Metal Basket Sword Pagoda like an eggshell and gradually spread to the tip of the sword.</p><br/><p>Everyone was shocked by the miraculous scene. They stopped breathing and widened their eyes as they didn’t want to miss any details.</p><br/><p>When the flowing light converged at the tip of the sword, the whole Metal Basket Sword Pagoda was shrouded by the flowing light. The light was in the shape of a shuttle which was pointed at both ends and wide in the middle. The light was brightest at the ends and pale in the middle.</p><br/><p>\"It’s so gorgeous!\"</p><br/><p>\"Yes, it’s like the God-subduing Peak!\"</p><br/><p>\"But more beautiful than the God-subduing Peak!\"</p><br/><p>The onlookers were excited, and praise could be heard everywhere.</p><br/><p>The Metal Basket Sword Pagoda used to be incredibly hideous, but now it had become so gorgeous like an ugly duckling turned into a white swan. Everyone felt excited at the thought of fighting in such a glaring light shuttle.</p><br/><p>Many people even wanted to jump onto the Metal Basket Sword Pagoda to give it a closer look.</p><br/><p>Ai Hui was carefully observing the light shrouding the Metal Basket Sword Pagoda. The light was a combination of elemental energies of five attributes. When the pinwheel had just started to run, the light was multi-colored, but now it became transparent and colorless as the rotation of the pinwheel stabilized.</p><br/><p>Ai Hui was lost in thought. The integration of five elements seemed like it would be an inevitable trend in the future.</p><br/><p>It had to be admitted that the world was improving. Previously, the integration of five elements was something only achieved by grandmasters, but now it had become a common subject that was studied more often and more deeply by everyone, as elemental energy was not sufficient nowadays.</p><br/><p>The reason was simple. The integration of five elements could produce more power while consuming less elemental energy.</p><br/><p>This reminded Ai Hui of fusion elemental energy. Admittedly, fusion elemental energy, which possessed all the five attributes, was more in accordance with the current situation. Although at the very beginning the training process was slow, its effect grew more and more astonishing as one’s elemental energy level went up. Therefore, its benefit was more obvious in the later stage of training.</p><br/><p>Ai Hui was curious about what would happen if elementalists from Assembly of Patriarchs could become Grandmasters.</p><br/><p>The light was thin and almost totally transparent, but could cut off the external sound.</p><br/><p>Ai Hui felt complacent. He had created the pinwheel ring form of five-element integration. Compared with the God-subduing Peak, it was more elaborate and more elemental-energy efficient. But on the other hand, limited by materials, the comprehensive strength of Pinwheel Sword was undoubtedly inferior to the God-subduing Peak.</p><br/><p>But making something that possessed subtlety like God-subduing Peak and which could even surpass it in some aspects, while using such cheap materials, was enough for Ai Hui to feel proud of himself.</p><br/><p>Ai Hui held the hilt of the sword tightly in his hand and his eyes ran down each corner of the Pinwheel Sword again and again.</p><br/><p>Pinwheel Sword, which was like a name in a fairy tale, would be the new name of the Metal Basket Sword Pagoda.</p><br/><p>Nobody here had the experience of garrisoning the God-subduing Peak like Iron Lady and the rest. Although Ai Hui made this Pinwheel Sword according to his teacher’s theory, it was the first time that he had experienced it himself.</p><br/><p>Standing inside the pinwheel, he could get a more direct and profound feeling.</p><br/><p>The so-called ring force was actually a special type of fusion elemental energy.</p><br/><p>But ring force was produced via elemental traces and pinwheel ring, and was more elaborate than Assembly of Patriarchs’ fusion elemental energy. The latter was balancing the five elements through training.</p><br/><p>It was probably appropriate to describe ring force as the equilibrium within balance.</p><br/><p>Therefore, there were many special features of ring force. For example, Ai Hui found that ring force was different from any other kind of elemental energy. Its shape was like a spindle or a shuttle.</p><br/><p>This reminded Ai Hui of a special noun from the Cultivation Era, which was \"boundary\".</p><br/><p>The ring force released by the pinwheel ring constituted a small boundary, and energy could flow freely within the shuttle-shaped boundary.</p><br/><p>Amazing!</p><br/><p>Now, elemental energy no longer needed to flow according to certain routes. In this shuttle-shaped \"boundary\", it could reach anywhere in no time.</p><br/><p>He realized that this feature of ring force was likely to overturn the current elemental energy system.</p><br/><p>He kept this feature firmly in mind, and decided to study it further later.</p><br/><p>The boundary of the ring had great advantages, such as strong defensive powers. If it was under attack, the force would be shared by the whole boundary of ring. Therefore, unless the boundary broke, it would never be pierced.</p><br/><p>But this also posed a big problem for Ai Hui, as he realized that his normally strong perception was totally cut off by the boundary.</p><br/><p>This was not good!</p><br/><p>With his strong perception, Ai Hui could always sense danger earlier than anyone else, which was necessary for him to survive on the battlefield.</p><br/><p>Rubbing the spot between his eyebrows, he sighed that this problem was beyond his expectations. Although the light shrouding the boundary was thin and almost transparent, Ai Hui knew how hard and firm it was.</p><br/><p>He decided to put this problem aside. With a quick flick of the Edgeless Sword in his hand, a ray of Sword of Lightning flew out from the tip.</p><br/><p>The ray flew out of the light curtain with a roaring sound, and disappeared after gliding a long distance away.</p><br/><p>Ai Hui sighed in relief. The boundary of ring could only cut off one’s perception, but not sword rays.</p><br/><p>But still, there seemed to be some nuance to this.</p><br/><p>Trying to recall every detail when he’d waved the sword just now, Ai Hui thought for a moment and waved his sword again.</p><br/><p>Once again, a sword ray flew out.</p><br/><p>Ai Hui’s eyes lit up as he realised what the nuance was. At first the lightning appeared at the point of the sword, but in the next instant it had already flashed outside of the light curtain.</p><br/><p>It reminded him of the ring force’s feature at once. Now it seemed that not only ring force, but also sword rays could appear instantly at any corner within the boundary of ring.</p><br/><p>What influence would this have in a battle?</p><br/><p>The Pinwheel Sword was indeed designed and made by Ai Hui. But it was a brand new weapon, and many mysteries about it were unknown even to its creator.</p><br/><p>The God-subduing Peak must be garrisoned by a Master. This was not only due to its preciousness, but also because only a Master could make the most of its power. The God-subduing Peak contained abundant elemental energy and only a Master could manage to control it.</p><br/><p>The elemental energy of the Pinwheel Sword, on the other hand, was generated from snow lava. Therefore, it did not necessarily need to be commanded by a master.</p><br/><p>Ai Hui jumped on the seashell cover. Apart from containing Snow Lava, it could also control the speed of infusion of the snow lava into the pinwheel. By increasing this speed, the pinwheel could generate stronger power.</p><br/><p>Like a sword with a pinwheel on its tail, it flew very fast.</p><br/><p>As to controlling the direction, Ai Hui’s method was very simple. In front of the seashell cover there was a bearing, with which the cover could turn in any direction. If the Metal Basket Sword Pagoda was compared to a fish, then the seashell cover and the pinwheel were its tail that could wiggle to control its direction.</p><br/><p>Ai Hui tried to increase the speed.</p><br/><p>The top of the light shuttle suddenly became very bright.</p><br/><p>Ai Hui was dazzled.</p><br/><p>Then, after a huge blare, Ai Hui felt like he was pushed by someone from behind, and then he was thrown forward. Fortunately, he had been holding the sword hilt all the time and was in the state of Imbuement of Sword Cloud.</p><br/><p>He reacted very fast. Within an instant, he stabbed with Edgeless Sword several times.</p><br/><p>Flap, flap, flap.</p><br/><p>The sword continuously hit the steel bars in front of him and made intense sounds. Ai Hui was like a spring. He tried to stabilize himself with the force from the sword.</p><br/><p>When he saw what had happened, he was astounded and took in a breath of chilly air.</p><br/><p>The Pinwheel Sword plunged into the ridge of the Blackfish Mouth Volcano, leaving only less than half of it outside of the ridge.</p><br/><p>Embedded in the ridge, the front part was dark, while the rear part was hanging in the air. From there Ai Hui could see the crowd running towards him in panic.</p><br/><p>Gu Xuan and the others were all dumbstruck.</p><br/><p>They’d just seent the Metal Basket Sword Pagoda disappear after a flash of light. Then there was a huge blare from afar. When they flew into the sky, they were astonished to see the Metal Basket Sword Pagoda was embedded into the hillside.</p><br/><p>Previously, they all thought that the Pinwheel Sword was powerful and glaring. However, having seen the scene where about two thirds of the sword was inserted into the hill, they began to feel chills at the back of their neck.</p><br/><p>Ai Hui climbed out of the Pinwheel Sword and said embarrassedly, \"I’m not yet proficient at controlling it, or else it would be very safe.</p><br/><p>Everyone’s faces looked pale.</p><br/><p>…..</p><br/><p>In the camp of God Nation.</p><br/><p>Nangong Wulian was reproaching someone, \"Don’t bother me with such trivial matters! Fighting in the battlefield is your business. Don’t ask me how! I’m busy and have no time to waste on this bullshit….\"</p><br/><p>Several generals retreated from the camp gloomily.</p><br/><p>They were all furious about being defeated on the frontline, and about their enemy’s boasting of such a win.</p><br/><p>One of them asked, \"Then what do we do now? If we cannot save face, when they want to find somebody to blame later, none of us can escape.\"</p><br/><p>One prudent general who was older in age said, \"Sir hasn’t woken up. So we cannot act rashly…\"</p><br/><p>\"Rash? Our enemy is slapping our face now and we still have to bear it?\"</p><br/><p>\"We must win our glory back! His Majesty cannot bear the existence of any incapable person. Do you want your family to be involved and punished too?\"</p><br/><p>The others were silent.</p><br/><p>\"Sir hasn't woken up. We have no right to dispatch our troops.\"</p><br/><p>Suddenly someone said in a forceful voice, \"Troops? Don’t you hear them saying that an old man is dead in the enemy country, a lone girl is fighting at the front line, new soldiers are defending their territory? Our enemies are a girl and a group of new recruits. Don’t bother to dispatch out troops! I’ll go!\"</p><br/><p>Everyone looked towards where the voice was coming from, and saw a strong man with a fierce look walking towards them.</p><br/><p>\"General Xing!\"</p><br/><p>\"If General Xing confronts our enemies in person, then we are sure to win!\"</p><br/><p>\"We have nothing to worry about now!\"</p><br/><p>Feeling relaxed, people began to express their admiration ardently.</p><br/>\n</div>"}