{"title": "Chapter 534: Fatty’s Talent", "id": 534, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-534-fatty%E2%80%99s-talent", "volume_title": "Volume 6", "body": "<h1>Chapter 534: Fatty’s Talent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 534: Fatty’s Talent</p><br/><p>Translator: TYZ Editor: Lucas, TYZ</p><br/><p>Shi Zhiguang recounted what he felt just now to Ai Hui with excitement. An envious look appeared on everyone’s faces. They could all tell that Shi Zhiguang had an extremely bright future ahead of him.</p><br/><p>He was very fortunate to have discovered an unknown talent that was hidden for many years.</p><br/><p>Everyone possessed a treasure within them.</p><br/><p>But how many people actually unearthed it?</p><br/><p>Even though aristocratic families possessed absolute arts, famed teachers, and an abundance of wealth, very few of them possessed talents. As such, one could well imagine how few talents those ordinary families possessed.</p><br/><p>It was unfortunate that Shi Zhiguang didn’t discover his talent when he was young and had missed the best period of life to practice it. However, compared to other people, he was still considered very lucky to have discovered an unknown talent after so many years.</p><br/><p>At this point in time, Ai Hui had already confirmed that Shi Zhiguang’s talent was speed.</p><br/><p>In normal speed, Shi Zhiguang would not have too much of a reaction. However, when his speed was overly fast or overly slow, he would produce reactions that were completely different from ordinary people’s.</p><br/><p>Everyone gathered around him with curious looks on their faces.</p><br/><p>When they thought of talents, they would think about things like a higher elemental energy connectivity and etc. They had never heard of a talent in speed. Those who were quick-witted were thinking about whether or not did they had some unknown talents as well.</p><br/><p>When Shi Zhiguang was talking, everyone was holding their breaths while listening to him attentively.</p><br/><p>When Shi Zhiguang finished talking, everyone shifted their gazes to Ai Hui.</p><br/><p>In the past, Ai Hui was only known for his powerful strength, superb swordsmanship, and specialization in the theory of elemental traces. After the training session with Shi Zhiguang this time around, all of them realized Ai Hui was a good teacher!</p><br/><p>This discovery roused everyone.</p><br/><p>Everyone hoped that they could discover what their talents were.</p><br/><p>Ai Hui could see the hopeful look on everyone’s faces. After thinking for a while, he said, \"Nowadays, the training system focuses on the five residences and eight palaces. After all, this system has been established for quite a while. Indeed, there are many types of talents. During the Cultivation Era, talents were being classified distinctively. That is because the training system at that time was extremely huge; there were many diversifications and types of tests. For example, if a person was slow-witted but had an unusually high willpower, he or she was suitable for the field of meditation. However, if a person in today’s world is not gifted in the field of elemental energy, he or she will not have much of a future. Take Zhiguang, who has a talent in speed, as an example. If it wasn’t for the fact that our Pinwheel Sword needed a driver, he would not have brought out his talent.\"</p><br/><p>Everyone thought hard and long about Ai Hui’s words. Meanwhile, Shi Zhiguang was nodding his head repeatedly.</p><br/><p>Ai Hui thought of something and his lips behind the bandages that covered his face curled into a grin. \"The most unique talent is probably the talent in escaping.\"</p><br/><p>\"Talent in escaping?\"</p><br/><p>\"Does escaping need talent?\"</p><br/><p>\"Hahaha, this talent is quite practical. The moment you see something not right, quickly turn and escape!\"</p><br/><p>\"Who has this talent? Who has this talent?\"</p><br/><p>Everyone broke into a lively discussion. All of them looked at Ai Hui with curious looks on their faces.</p><br/><p>For a moment, Ai Hui felt as if he had become a teacher, standing on the podium while giving a lesson to his students below. Was he going to become a teacher after teaching them embroidery? Was he taking up the roles of Master and Mistress at the same time?</p><br/><p>\"Everyone knows this person,\" Ai Hui replied.</p><br/><p>\"Boss, stop keeping us in suspense! Quickly tell us who it is!\" Everyone became impatient.</p><br/><p>\"Fatty,\" Ai Hui chuckled.</p><br/><p>\"Fatty?\"</p><br/><p>\"Really?\"</p><br/><p>\"I don’t believe it. With his body size, he is suitable to be a sacrificial victim for those who are escaping.\"</p><br/><p>\"I don’t believe it either.\"</p><br/><p>Everyone shook their heads.</p><br/><p>\"I am really not lying to you. You guys better not underestimate Fatty. Fatty is good at two things. The first is his greed for money, and the second is escaping. I am willing to play a second fiddle to him with regards to these two aspects,\" Ai Hui said solemnly.</p><br/><p>\"Boss, you’re being too humble. With regards to the point of being greedy for money, you definitely will not lose out to Fatty!\" Someone blurted out.</p><br/><p>\"Hahaha! That’s right!\"</p><br/><p>\"Don’t try to make Fatty the scapegoat!\"</p><br/><p>Everyone burst out laughing.</p><br/><p>Drenched in sweat, Ai Hui was exasperated as he said, \"Don’t spoil my reputation. Am I this kind of person?\"</p><br/><p>\"Yes!\" everyone said in unison and dragged out the word.</p><br/><p>They were laughing all over the place.</p><br/><p>Ai Hui remained speechless. When he turned around and saw Lou Lan laughing too, he flew into a rage. \"Lou Lan, have you finished cooking the elemental soup?\"</p><br/><p>\"Ai Hui, you have just finished yours,\" Lou Lan blinked his eyes.</p><br/><p>\".....\" Ai Hui.</p><br/><p>\"Boss, is Fatty’s escaping talent very formidable? Is it like my talent in speed?\" Shi Zhiguang asked curiously.</p><br/><p>\"His is slightly more formidable than yours,\" Ai Hui answered.</p><br/><p>Suddenly, everyone’s curiosity was piqued. For the past few days, all of them had witnessed Shi Zhiguang’s talent with their own eyes. Usually, Shi Zhiguang might appear to be unremarkable. However, when he boarded the Pinwheel Sword and took up the driver’s seat , he became a totally different person. Until now, only Shi Zhiguang was able to make those extremely difficult maneuvers and moves in an utterly short period of time.</p><br/><p>As such, when Boss said that Fatty’s talent was more formidable than Shi Zhiguang’s, everyone’s curiosity was piqued. Boss would never lie about such things.</p><br/><p>Ai Hui smiled. Other than him, no one knew about Fatty’s talent. He explained, \"If you fight alongside Fatty on the battlefield, you will notice a very strange phenomenon. Even when the battlefield is very chaotic, there are a lot of people, and the ongoing battle is very intense, Fatty will always be ignored by everyone. The most extreme case that I have ever see is when we were in the Wilderness. At that time, we were still working as laborers in the Wilderness. One day, while we were setting up camp, a dire beast attacked us. More than one hundred people had died that day. Everyone in Fatty’s unit, except him, had died. I saw with my own eyes that after the dire beast finished biting everyone to death, it walked past Fatty as if it never saw him.\"</p><br/><p>An uproar broke out.</p><br/><p>\"Really?\"</p><br/><p>\"Sounds like bulls**t to me.\"</p><br/><p>\"Boss, are you telling us a fake story?\"</p><br/><p>Everyone reacted strongly. That was because the story did not make sense and none of them had never heard of such a thing before.</p><br/><p>Ai Hui did not get angry and continued, \"At that time, I was like all of you. I myself was stunned and even got injured because of it. From that day onwards, I started to observe Fatty. Eventually, I discovered that there is indeed something strange going on with this fellow. Every time he runs into a dangerous situation, he is able to escape unscathed. Later, I slowly understood what was going on.\"</p><br/><p>Everyone pricked up their ears, fearing that they might miss out on any details.</p><br/><p>\"It is as if he was born with the ability to know which area is dangerous and which area is safe. Subsequently, we were put in the same unit. At that time, I still had not figured out what was going on with Fatty. We managed to dodge dire beasts a few times because of this talent of Fatty’s. Eventually, I understood that Fatty has a talent in escaping, because he is naturally extremely sensitive to smells. Even if he is very close to a dire beast, he is able to hide in the blind spot of that dire beast and dodge it.\"</p><br/><p>\"Ahhhhh…\" Everyone came to a realization.</p><br/><p>Ai Hui continued, \"This innate ability of Fatty is best used when he is escaping. He can use trees, rocks, hills, rivers and etc to hinder a dire beast from locking onto his smell. Unlike humans, most dire beasts don’t rely on their eyes. Instead, they rely on the smells to lock onto their targets.\"</p><br/><p>Everyone looked pensive.</p><br/><p>\"There’s one more reason,\" Ai Hui continued, \"Fatty is timid.\"</p><br/><p>An uproar broke out once more.</p><br/><p>\"Being timid can be a strength too?\"</p><br/><p>\"Boss, are you encouraging us to be timid?\"</p><br/><p>Ai Hui shook his head. After everyone quieted down, he continued, \"Fatty is more timid than ordinary people. Whenever he encounters a dire beast, he will become very scared. To Fatty, fear is also a power. In the state of fear, Fatty can outperform his usual self. Once, I was injured and my unit abandoned me. Fatty was extremely scared at that time. He carried me and ran behind our unit for more than ten days.\"</p><br/><p>Everyone was speechless. This was the first time they had heard this story. Their eyes widened involuntarily and their facial expressions turned shocked.</p><br/><p>No wonder Boss and Fatty had such a deep relationship!</p><br/><p>Ai Hui felt touched as he narrated this story. However, he kept his tone calm as usual and continued, \"Toward the end, he was extremely exhausted and he had almost lost his consciousness. He relied solely on his will to survive. Fatty’s will to survive is a lot stronger than most people’s. This is a strength. Having a strong will to survive allows Fatty to do a lot of things that ordinary people can’t. For example, he was able to carry me for more ten days with his energy completely depleted. I’m inferior to him with regards to this aspect.\"</p><br/><p>Everyone was overwhelmed with shock. They did not expect Fatty, who was usually so lazy and timid, to have such a formidable moment.</p><br/><p>Ai Hui eventually concluded, \"The only reason why I said Fatty is more powerful than Shi Zhiguang was that he discovered his talent at a very early stage. When we were in Wilderness, dangers were everywhere and they happened to stimulate Fatty’s gift. However, Zhiguang, don’t give up. Now, you have your talent. As long as you keep on sharpening it, it will become stronger.\"</p><br/><p>With a determined look on his face, Shi Zhiguang yelled, \"I will continue to work hard!\"</p><br/><p>Ai Hui swept everyone with his gaze and said, \"I will think of other talents and see if there are any ways to test them. However, I can’t promise they will work.\"</p><br/><p>Upon hearing these words, everyone cheered in unison, \"Long live our Boss!\"</p><br/><p>When Ai Hui saw the joy on everyone’s faces, his lips could not help but curl into a smile.</p><br/><p>Just as Ai Hui was analyzing and explaining Fatty’s talent to everyone, in a distant battlefield, Xing Shan was sitting atop a wolf while admiring Fatty’s talent.</p><br/><p>Fatty’s plump and huge figure was a facade. He was more nimble and slithery than a snake. However, this was not the only reason why the division leader of the Ardent Flower Blood Division was full of praise for him. The thing that truly roused Xing Shan was Fatty’s instinctive sensitivity to smells.</p><br/><p>This was an extremely rare talent.</p><br/><p>Smells were harder to detect than elemental energies and blood spiritual force. An outstanding expert could only form this ability after going through countless battles. Xing Shan could tell that Fatty’s strength was around the same as his subordinates’ and yet his performance was unusually impressive.</p><br/><p>This fellow’s sensitivity towards smell was so formidable that he could use obstacles and directional angles to hinder the Chieftain Wolf from locking onto his smell. He used this kind of special technique to escape again and again. One must know that the Chieftain Wolf was one of the most outstanding ardent flower blood wolves bred by the Beast Venom Temple. As a beast, it possessed powerful hunting capabilities and its sensitivity towards smells far exceeded humans’.</p><br/><p>The Chieftain Wolf, which had never failed before, had missed its target again and again today.</p><br/><p>Xing Shan did not expect to encounter such an interesting fellow in this world.</p><br/><p>A sinister smile appeared on his face. Following which, the black, heavy axe in his hand emitted a bloody glow that shot towards Fatty like a tidal wave of blood.</p><br/><p>When the bloody glow left Xing Shan’s heavy axe, Fatty, who had being escaping with all his might, froze in his tracks. A look of despair appeared on his face.</p><br/>\n</div>"}