{"title": "Chapter 489: Chapter 489 - Glorious Footprints", "id": 538, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-489-chapter-489-glorious-footprints", "volume_title": "Volume 6", "body": "<h1>Chapter 489: Chapter 489 - Glorious Footprints</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 489: Chapter 489 - Glorious Footprints</p><br/><p>Translator: Irene Editor: X, TYZ</p><br/><p>An Muda stopped in his tracks and stood high up in the sky for a long time.</p><br/><p>The empty, ice-cold deep space covered his body as elemental energy from all directions approached and gathered. All five types of elemental energy had formed a complete cycle around his body. They coiled and switched around, growing and multiplying without end. Many clockwise and counterclockwise circulations intertwined and surged like waves.</p><br/><p>The perfectly curved horizon in the distance and the endlessly deep void behind were coated by a halo. It was the afterglow of the setting sun.</p><br/><p>The sun set behind him. If he turned his head, he would see a round, bright red fireball parallel to him.</p><br/><p>An Muda did not turn around. Like the sun behind him, he was only left with the afterglow.</p><br/><p>The sun would rise and set on schedule tomorrow, just like today, and the afterglow was its way of bidding farewell to mother earth. An Muda’s afterglow was his final longing for this earth, which he’d been guarding and defending his whole life.</p><br/><p>Even the metal wind was unable to dissolve the grief he felt.</p><br/><p>When he’d just become a Grandmaster, he also stood where he was now, proudly overlooking the vast field beneath his feet. Who would’ve known that it would one day fall into such desolation. If there was anything that grieved him even more, it was probably the fact that he’d lived to witness the dilapidation of the Silver Mist Sea.</p><br/><p>Elementalists retreated into the Wilderness like the tide, exchanging whatever area they could draw vitality from in order to buy more time for themselves.</p><br/><p>The Silver Mist Sea, which had been regarded throughout the years as one of the biggest monuments of the Avalon of Five Elements, was merely a barren valley where not even a single blade of grass grew. There was no dazzling mist, the mud at the bottom of the valley had been turned over, and there were pits everywhere like many festering wounds.</p><br/><p>Before the Elder Guild’s departure, they had wiped out all of the accumulated artifact remnants and left only the useless slit that piled up and dried in this empty valley, waiting to be eroded by time.</p><br/><p>Perhaps one day a rainstorm and deluge would turn this valley, which was once labeled as the sacred land of metal elementalists, back into a lake.</p><br/><p>Wild grass grew on the wide and dry riverbed of the Silver Mist River, which occasionally attracted little birds to peck at them. The place was packed with holes three feet long, appearing like a long scar that stretched across the river.</p><br/><p>Looking down from the sky, the holes were eye-catching and ugly.</p><br/><p>An Muda suddenly recalled Le Buleng’s words.</p><br/><p>So Grandmasters were humans too.</p><br/><p>An Muda mocked himself, his eyes regaining their usual cheer. Once again, he took a step.</p><br/><p>He wanted to leave a last footprint.</p><br/><p>The faraway sky seemed to tremble as the afterglow sprinkled down from time to time like shooting stars.</p><br/><p>Skyheart City was filled with a solemn atmosphere as all the elementalists walked out of their houses and stood on the street for a long time, gazing soullessly in the direction of the Silver Mist Sea.</p><br/><p>Worry was evident on their faces, their expressions gloomy.</p><br/><p>Rumors had long since spread around the street stalls. Everyone was somewhat mentally prepared, but now that the rumors were turning into reality before their very eyes, they were panic-stricken.</p><br/><p>They understood that they could never return to the past.</p><br/><p>The early evenings when the lanterns were first lit, the humble abodes of successive generations, and the days they thought dull were now gone, along with the sounds of footsteps and the glorious track from the distant sky.</p><br/><p>The giant turned its body and a generation came to an end.</p><br/><p>Where did their future lie? Was it within the lush Wilderness where thistles, thorns, and rampaging dire beasts lived? Or was it on the battlefield with the Blood of God? Could they win against the Blood of God? Would they be swallowed up by the Jadeite Forest? Dai Gang was born from the Avalon of Five Elements after all, so he wouldn’t be too harsh on them right?</p><br/><p>Sounds made when calling for birds were heard from an unknown corner and quickly spread.</p><br/><p>A trace of bewilderment and fear appeared on Madam Ye’s face, but she quickly regained her senses and usual calm.</p><br/><p>Nian Tingfeng appeared by her side like an apparition.</p><br/><p>Madam Ye asked, \"What do they think?\"</p><br/><p>Nian Tingfeng responded respectfully, \"They’re willing to fight for you!\"</p><br/><p>Madam Ye smiled in disbelief, but did not question his words. Instead, she ordered, \"Then get them to prepare. Dai Gang will not wait for long.\"</p><br/><p>\"Yes!\"</p><br/><p>Nian Tingfeng agreed, but did not immediately withdraw. He looked, somewhat absent-mindedly, at the glorious tracks left behind.</p><br/><p>That person had done what they were supposed to do.</p><br/><p>…..</p><br/><p>Newlight City.</p><br/><p>Above the Windy Resonant Pagoda that made all sorts of noises, Yuchi Ba gazed in the direction of the Silver Mist Sea. The occasionally trembling sky, the rumbling thunder, and the glorious tracks that led to the territory of the Blood of God.</p><br/><p>Senior An Muda…</p><br/><p>Shame rose within his heart as he mumbled to himself, \"… Sorry Senior. What to do? We no longer want to endure this. We must split. So be it. Everyone minds their own business. The new citizens are living decent lives. We might not win, but are at least fighting for ourselves. We no longer want to be cannon fodder…\"</p><br/><p>As he spoke, the bewilderment in his eyes cleared up and was replaced by zeal.</p><br/><p>He looked toward the enormous and glorious tracks in the far sky and cried, \"After so many years of being cannon fodder, we’ve all had enough!\"</p><br/><p>Even while knowing that Senior An Muda couldn’t hear him, he still wanted to vent the anger and resentment in his heart.</p><br/><p>But why were tears forcing their way out?</p><br/><p>…..</p><br/><p>The mountain ridge of Blackfish Mouth Mountain was packed with people who stood still like statues.</p><br/><p>In the horizon, there was no giant, but dazzling footprints, treading and shattering the clouds as they moved forward.</p><br/><p>Shi Xueman held onto Cirrus tightly, her face a deathly white. Tears blurred her vision, but she pursed her lips firmly to prevent them from falling.</p><br/><p>Her teacher was dying, Ai Hui was severely injured and unconscious, and her father was waiting for assistance at the front line.</p><br/><p>In that instant, an unprecedented grief and feebleness wounded her heart. She wanted to cry so badly.</p><br/><p>But she did not. She’d known since young that crying was useless.</p><br/><p>She wiped her tears. While the glistening teardrops were still visible, there was no more distress and grief, only tough determination. She quietly sorted out her emotions.</p><br/><p>There were many things left to do. She had to manage the Spear of Heavy Cloud’s training and cure Ai Hui. While waiting for a cure for Ai Hui, the Sword of Lightning’s training had to continue.</p><br/><p>Many, many things.</p><br/><p>\"When a Grandmaster is alive, he defeats all heroes under the sky. When he dies, he stirs all clouds under the sky. Look, the sun and moon lose their splendor and the stars dim. The sky is so high, the earth is so vast. All living things gather to grieve. How heroic! How delightful! Living a life without being a Grandmaster is unsatisfying!\" Le Buleng muttered, his voice initially low, but becoming impassioned and resounding as excitement emerged from his grave and skinny face, turning it red.</p><br/><p>Suddenly, he shouted with all his might into the distant sky, \"An Muda, don’t let that Holy Emperor look down on you!\"</p><br/><p>Golden flames rose in his eyes along with a burning sensation in his chest. He turned to Shi Xueman and said, \"Little girl, I’ll hand my rubbish disciple over to you. Hahaha, I’m coming, Grandmaster! If I can’t be one, I’ll become the enemy of one!\"</p><br/><p>After that, he transformed into a flame, flew toward the other side of the sky, disappeared in the blink of an eye.</p><br/><p>Shi Xueman turned around and looked longingly at the glorious tracks left in the sky.</p><br/><p>She must not let his effort go to waste.</p><br/><p>She retracted her gaze and said in a low voice, \"Start training.\"</p><br/><p>…..</p><br/><p>The boundary line between the Silver Mist Sea and Yellow Sand Corner was in an uproar.</p><br/><p>Rumbling, rolling.</p><br/><p>It was as if there was a monster crushing its way through from the faraway horizon.</p><br/><p>Shi Beihai and a few others couldn’t help but walk out of the campground. They raised their heads and looked at the sky behind them. Enormous and illuminated steps appeared in the sky and stayed on the ground, turning into long giant footprints.</p><br/><p>Only those with the sharpest eyesight, Shi Beihai and a few others included, could vaguely catch sight of a silhouette high up in the sky.</p><br/><p>Shi Beihai’s face changed tremendously. \"Senior An Muda!\"</p><br/><p>The faces of a few other observers changed as well when they quickly understood what was going to happen next.</p><br/><p>In private, everyone had been extensively discussing about who An Muda was leaving his final attack for. There could only be two possibilities. One was Dai Gang, and the other was the Holy Emperor of the Blood of God. Everyone believed that the latter was more probable.</p><br/><p>They’d been enthusiastic when in discussion, but now that the time had really come, there was only an inexpressible grief shrouding their hearts.</p><br/><p>Boom!</p><br/><p>A giant footprint stretching across a mile appeared in Ye Baiyi’s army camp.</p><br/><p>The footprint sank a few meters deep. Densely packed tents once filled the area, but with that hit, over a thousand soldiers turned into blood clay before they could even make any sound.</p><br/><p>This scene was too shocking, causing everyone that saw it to freeze in fear.</p><br/><p>When everyone snapped out of their daze, their faces were all as white as a sheet, be it the North Sea Division or Ye Baiyi’s army.</p><br/><p>\"Is this a Grandmaster? Is this the strength of a Grandmaster?\"</p><br/><p>These exact thoughts surfaced in the minds of many.</p><br/><p>Fear, instinctive fear. No matter how brave a soldier was, he could only shudder uncontrollably in the face of such an invincible and inhumane force.</p><br/><p>Ye Baiyi shivered slightly as despair overcame his face. On more than one occasion, he had thought about how to deal with a Grandmaster, but it was only at this moment, when he was really facing one, that he realized all his thoughts had been silly and ridiculous.</p><br/><p>Another two footprints landed.</p><br/><p>There was no sign and no sound. There were no blood-curdling screeches or bone crushing cracks, only booms that rang as the enormous footprints took away thousands of lives.</p><br/><p>The blood elementalists under Ye Baiyi were all elites who dared to participate in such a direct and cruel battle. Yet, in front of this one-sided massacre, they simply had no courage to gather.</p><br/><p>Not good!</p><br/><p>Ye Baiyi was anxious. These three hits happened too quickly, and he had had no time at all to react and adapt.</p><br/><p>There were signs that the army was about to collapse.</p><br/><p>Just then, an imposing voice rang from overhead.</p><br/><p>\"I’m your opponent, An Muda.\"</p><br/><p>These words shook the whole sky and caused it to buzz.</p><br/><p>The army that was just about to crumble started cheering excitedly after two seconds of silence.</p><br/><p>Not a single voice could be heard from the North Sea Division.</p><br/><p>Shi Beihai and others were ashen-faced. Although people were convinced that the Holy Emperor’s abilities were comparable to that of a Grandmaster, they held a slight glimmer of hope since they’d not seen it for themselves.</p><br/><p>Now, that wisp of hope was completely crushed.</p><br/><p>This was bad news.</p><br/><p>Everyone tried hard to search for the Holy Emperor’s silhouette, but to no avail.</p><br/><p>An Muda’s glorious footprints did not halt. He continued advancing toward the Blood of God’s interior.</p><br/><p>\"I really did not expect you to govern the Blood of God so well.\"</p><br/><p>An Muda’s surprised voice echoed throughout the entirety of the Blood of God, but no one could catch sight of his person.</p><br/><p>\"An Muda, if you really pity the people of Beyond Avalon, let them surrender as soon as possible. A meaningless battle is only going to take more innocent lives away.\"</p><br/><p>A faint yet mighty voice reverberated through Blood of God and many blood elementalists started to kneel down.</p><br/><p>An Muda stopped in his tracks.</p><br/><p>Because he’d seen the Holy Emperor.</p><br/><p>Grandmaster to Grandmaster.</p><br/>\n</div>"}