{"title": "Chapter 531: Fatty’s Lethal Weapon", "id": 531, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-531-fatty%E2%80%99s-lethal-weapon", "volume_title": "Volume 6", "body": "<h1>Chapter 531: Fatty’s Lethal Weapon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 531: Fatty’s Lethal Weapon</p><br/><p>Translator: Irene Editor: Lucas, TYZ</p><br/><p>The wind whistled as Zu Chun increased his speed, the surging airflow like cutting knives. His field of vision was shaky, but he fixed his gaze onto that shadow on the ground.</p><br/><p>It was as if the violent force in his blood had been roused.</p><br/><p>Zu Chun wasn’t aware that his eyes were bloodshot. The red light enveloping his wings was as dense as a thick layer of red crystal. His aura was strengthening and a gush of azure air surged upward. It was as if he was seeing himself fly beyond the end of the world, over a void, and across the stars. He used to rule the sky. Pride and agitation spread within his body.</p><br/><p>An enormous spider web lit up beneath the feet of Zu Yan, who was on the ground.</p><br/><p>As if he hadn’t seen it, Zu Yan had sufficient confidence that even [Flaming Heavenly Spider Transformation] would not be able to stop him!</p><br/><p>Bang!</p><br/><p>Just then, with a jolt on his back, it was as if there was a moment of enlightenment. A gush of extremely vigorous force entered his body in an instant. He couldn’t help but emit a stern and long hiss, his breath surging.</p><br/><p>He was wild with joy. He hadn’t expected to undergo a breakthrough at this time!</p><br/><p>The eighteenth column had been unlocked!</p><br/><p>The curled spider web on the ground enveloped Zu Yan like an unbloomed rose whose petals had folded and stacked over one another. The defensive strength displayed by the crisscrossed canine teeth was absolutely intimidating and unbreakable.</p><br/><p>But Zu Chun was full of confidence, and sinister smile surfaced on his lips.</p><br/><p>As if feeling Zu Chun’s murderousness, Zu Yan raised his head once again and got into an odd position.</p><br/><p>His left leg was propped up while his right leg was in a squat, and his upper body was leaning forward.</p><br/><p>The slightly paling blazing flame overflowed from Zu Yan’s eyes. His eyes were completely hidden amidst the flames. At this moment, his expression was calm, as if a fire god was arriving.</p><br/><p>He lifted his face up and fixed his gaze at Zu Chun, who was rapidly plunging downward.</p><br/><p>The red light enveloping Zu Chun’s body was like a sharp, red knife ray. A mournful, sharp hiss filled the whole sky. It was a soul-shaking sound.</p><br/><p>Zu Yan’s right leg slammed onto the ground, effortlessly splitting the mud as if a giant had swung his hatchet and drawn a solid and cold arc.</p><br/><p>The surroundings curled up and a petal-like spider web lifted off the ground simultaneously as if being blown up by the wind. Piece after piece entered the disk slowly, creating a dazzling sight. It was as if the arc had been dyed red as layers of flower patterns folded over one another. It was absolutely exquisite and beautiful, and the red glow on the arc became increasingly introverted.</p><br/><p>Since Induction Ground Time, Zu Yan had already been able to attack with his heavy, axe-like leg, but his execution today was thoroughly different. There had been an intrinsic transformation.</p><br/><p>When that wheel, which looked as if layers of flower patterns had been engraved on it, of red flames shot toward the sky silently, a chill went up Zu Chun’s spine. An unprecedented sense of danger enveloped his heart.</p><br/><p>It hadn’t been an easy journey for Zu Chun to survive till this point and serve as the Ardent Flower Blood Division’s vice division leader. The fear of danger did not urge him to escape. Instead, he knew that when his life was at stake and that the only way to survive was to be even crazier and reckless.</p><br/><p>He placed both hands in front like an ancient, ferocious beast that had been angered. With a sky-filling hiss and devilish red light, he dashed toward that red, flaming arc.</p><br/><p>Both had the same surname and both had the same red ray.</p><br/><p>The difference was that one was devilish and fearful while the other was reserved and refined.</p><br/><p>Like a delayed predestination, the rays collided with a great impact.</p><br/><p>The splendid rays lit up abruptly, filling the sky with a sheet of white. Nothing could be seen. An ear-splitting boom sounded, causing the ground to shake intensely. A pounding windstorm followed, frantically sweeping and ripping everything apart. The solid rock shattered instantly as if smashed by a heavy hammer. Even before its fragments could fly everywhere, they were swallowed up by the wind. Trees also got twisted and shattered instantly, and the mud on the ground was lifted a few meters up as if a monster was trampling forward.</p><br/><p>It felt like judgment day.</p><br/><p>Time seemed to have stopped at this point.</p><br/><p>Some time later, a wild laughter rang in the sky.</p><br/><p>\"Hahahaha!\"</p><br/><p>Zu Chun was covered in blood, but his aura remained strong as he floated in mid air. As he looked at the enormous pit below, his laughter became increasingly wild and arrogant.</p><br/><p>Zu Yan was in a much more sorry state as he struggled his way out of the giant pit. His clothes were torn and there were quite a few wounds all over his body. His right leg was twisted at a weird angle.</p><br/><p>\"Hahahahahaha, that’s all there is to the young master of the Zu family! That’s all there is to [Flaming Heavenly Spider Transformation]!\"</p><br/><p>Zu Chun only felt an indescribable ease and excitement, as if an invisible shackle that had been binding him was broken. It was satisfying.</p><br/><p>From then on, he was no longer the Zu Chun from Zu family’s side faction. He was the vice division leader, Heavenly Roc Wing, Zu Chun, from Ardent Flower Blood Division!</p><br/><p>Boom!</p><br/><p>A dull sound rang from afar.</p><br/><p>Zu Chun was stunned, and before he could look toward the direction of that boom, he felt as if he’d been dealt a blow by a heavy hammer. His body shook uncontrollably.</p><br/><p>When he turned around, he saw a small mountain peak and an odd-looking mini pagoda cannon tube from which black smoke was rising in spirals. The pagoda cannon was propped on Fatty’s shoulder. Fatty was in a half squat position, his body steady as a mountain.</p><br/><p>There was no fear, dread, or cunningness on his face, only complete focus. He was expressionless, with his right cheek stuck close to the scalding cannon tube. Before him was a sturdy trestle that formed a stable triangle with his legs. The cannon tube’s tail was connected to a thick and soft tube which extended to a water tank that contained the clear-as-water snow lava on his back.</p><br/><p>Their eyes met.</p><br/><p>A cold light flashed across Fatty’s eyes.</p><br/><p>Boom!</p><br/><p>Another earth-shattering boom sounded and a dazzling white flame sprayed out from the cannon tube. As if he had suffered a heavy hit, Fatty’s feet sunk ankle deep into the rock. His face was flush red, his round eyes filled with anger, and his whole body’s power activated. Even then, the huge impact still threw his body backward.</p><br/><p>Zu Chun’s body trembled once again as the immense force ripped his body.</p><br/><p>He lowered his head and saw two bowl-sized bloody holes on his chest. Connected to them were two biting disks of moon.</p><br/><p>What a domineering pagoda cannon, and how accurate…</p><br/><p>Could it be Skyheart City’s secret weapon?</p><br/><p>He fell into an unconscious state and dropped down from the sky.</p><br/><p>Fatty was soaked in sweat, and vapor was rising from his body. He was like a freshly roasted pig. His skin was bright red and his sweat was overflowing, but it was as if he was numb. He kept the trestle before him, took down the cannon tube on his shoulder, and disassembled the soft tube. He used a palm carrying elemental energy to wipe across the cannon tube slowly and then it became soft. He then carefully rolled the cannon tube and soft tube up and packed both along with the trestle inside the bag he was carrying.</p><br/><p>The whole process was done meticulously and skillfully.</p><br/><p>After packing, Fatty leapt off the hill nimbly, which was surprising because of his body size.</p><br/><p>With a few jumps, he appeared by Zu Yan’s side. Zu Yan was staggering, still overwhelmed with shock, and out of it.</p><br/><p>Zu Yan was used to seeing Fatty carry that bag all the time. Little did he know that there was a lethal weapon hidden within.</p><br/><p>Zu Yan was already aware that Fatty was an expert in handling the pagoda cannon.</p><br/><p>Yet, Fatty had actually modified it, again and again…</p><br/><p>Zu Yan knew not how to describe this completely innovative single pagoda cannon. Was it considered a weapon? Probably, although it was very different from the weapons Zu Yan was familiar with.</p><br/><p>Without a word, Fatty supported Zu Yan up and lugged him over his shoulder.</p><br/><p>Zu Yan only felt his world spinning, and when he regained his senses, he realized he’d been manhandled.</p><br/><p>\"Put me down, I can walk on my own…\"</p><br/><p>\"Shut up! Don’t attract the army!\"</p><br/><p>Zu Yan was stunned. He’d never heard Fatty using such a stern and serious tone and was caught off guard.</p><br/><p>It seemed effortless for Fatty even though he was carrying a big adult and a big bag at the same time. Another few jumps took him to Zu Chun’s side.</p><br/><p>Zu Yan saw that Zu Chun’s eyes were wide open. It wasn’t a peaceful death. There was also disbelief on his face and two ghastly bloody holes on his chest. Fatty’s cannon had pierced two holes through Zu Chun’s chest. The extremely hot snow lava had scorched all around the holes. This was also why there wasn’t any blood flowing out from the holes.</p><br/><p>Not at peace, the deceased Zu Chun had probably found it difficult to believe that he would actually die by Fatty’s hands.</p><br/><p>Zu Yan thought suddenly.</p><br/><p>He wasn’t confident.</p><br/><p>He’d seen Fatty using it to get rid of powerful blood elementalists and had been shocked by the Hellfire pagoda cannon’s might at that point in time. But the Hellfire Pagoda was cumbersome to set up, since it required a lot of time. Unless it was for a big scale battle or for defending purposes, it wasn’t a favorable piece of equipment, especially in the face of an unexpected attack.</p><br/><p>He hadn’t expected Fatty to modify the pagoda cannon into a weapon that could be used by one person.</p><br/><p>Can’t judge a person by appearance…</p><br/><p>While Zu Yan was in thought, Fatty grabbed Zu Chun up and lugged him over his other shoulder.</p><br/><p>Zu Chun’s wide-open eyes met Zu Yan’s, causing Zu Yan’s hair to stand on end. \"Why are you carrying the corpse?\"</p><br/><p>Fatty explained while dashing, \"To show Xueman and the guys. Maybe they’ll find some useful information. At least we’ll know which combat division he was from.\"</p><br/><p>Zu Yan immediately felt ashamed. As as investigator, he really wasn’t qualified. He was worse than Fatty. An investigator’s responsibility was to source for information related to enemies. He only cared about killing his enemy and got tangled into family affairs, forgetting his responsibilities.</p><br/><p>How careless.</p><br/><p>\"Plus, I haven’t checked the corpse. Isn’t this all for nothing if we waste natural resources… no, leave it to rot? What a pity! I don’t do meaningless businesses.\"</p><br/><p>Fatty dashed wildly with both men on his shoulders. He knew that the commotion from earlier had alarmed both sides. If they did not hurry, they might get chopped into minced meat if other blood elementalists rushed over to investigate.</p><br/><p>Zu Yan was already half crippled and had no strength left.</p><br/><p>Using his pagoda cannon to launch a sneak attack was alright, but to use it in a one on one battle was no different from seeking death. Before he could set up the pagoda cannon, he would’ve been chopped into pieces.</p><br/><p>Fatty was so fast that his legs were producing wind and his face was flush red. Beads of sweat were rolling down his cheeks. He was like an elephant running in the forest.</p><br/><p>Quick, come and save me, Iron Lady!</p><br/>\n</div>"}