{"title": "Chapter 530: The Bird is in the Net", "id": 530, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-530-the-bird-is-in-the-net", "volume_title": "Volume 6", "body": "<h1>Chapter 530: The Bird is in the Net</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 530: The Bird is in the Net</p><br/><p>Translator: Irene Editor: Lucas, TYZ</p><br/><p>\"Can’t you use a little less force? Control the heat, it’s already burnt. How are we going to eat? And you’re a Master. Aren’t you ashamed of calling yourself a Master when you can’t even roast a bird properly?\"</p><br/><p>\"Don't eat it if you don’t want it.\"</p><br/><p>\"I’ll eat, I’ll eat. A Master is cooking personally, so of course I’ll show my support, but in the name of brotherhood, I’m advising you to learn from Lou Lan. Even if you don’t fight in future, at least you can open a roasted chicken stall and live off it. Or you can follow me back to Old Territory and I’ll give you a roasted chicken stall. Aye, I remember how A Hui refused to return to Old Territory. He was made for greater things, and I’ve known it for the longest time. At that time, A Hui…\"</p><br/><p>\"Can’t you even shut your mouth with food?\"</p><br/><p>...</p><br/><p>Zu Chun listened as they quarreled.</p><br/><p>Zu Chun was feeling increasingly certain about his conjecture. Which cannon fodder division? A Hui? Never heard of him. Old Territory? Coming from the countryside, it was no wonder he had little accomplishments. And such a rookie Master, one without even the most basic vigilance, would only give away his life on the battlefield.</p><br/><p>A cold light flashed across Zu Chun’s eyes as he got ready to make a move.</p><br/><p>\"The bird is in the net. All on you, pretty boy.\"</p><br/><p>\"Scram.\"</p><br/><p>Eh? Zu Chun was stunned. Just then, like a ball, the fatty in front put his hands behind his head and leapt forward rapidly. And another person turned around and looked at him expressionlessly.</p><br/><p>The man looked like he was fifteen or sixteen. His skin was quite pale and he looked rather feeble.</p><br/><p>Zu Chun shuddered. To become a Master at such a young age meant that his talent was absolutely extraordinary. Plus… was this a trap?</p><br/><p>A red light lit up beneath his feet.</p><br/><p>He lowered his head and saw a clearly visible red light web. With the pale youth standing right in the center, the criss-crossed red light enveloped a few hundred meters around him like a giant, red spider web.</p><br/><p>The pale youth stood in the middle of the red spider web, watching him coldly like a spider hidden in the dark.</p><br/><p>Zu Yan was rescued by Le Buleng during the blood catastrophe, and because of the occupation of Fire Prairie, which led to a deficiency in fire elemental ingredients, he was unable to train and was sealed in ice by Le Buleng. Having been frozen over and unable to see the sunlight for a long time, a sickly paleness appeared on his face. Furthermore, the ice seal also froze his looks in time, so he still looked as if he was fifteen or sixteen years old.</p><br/><p>Knowing he’d been deceived, Zu Chun was furious, but he quickly calmed down.</p><br/><p>He did not know when he’d been noticed or whether they had special tricks, but at that point, anger wasn’t the solution. A sinister smile surfaced on the corner of his lips and his gaze became cold. He was determined to catch them both and show them what he was capable of.</p><br/><p>He sized his opponent up and felt that he was somewhat familiar-looking, as if he’d seen him somewhere before.</p><br/><p>He stirred. \"May I know your name, Sir?\"</p><br/><p>The man expressionlessly replied, \"Zu Yan.\"</p><br/><p>Zu Chun’s heart jumped. He looked at that faintly familiar face and finally realized why he found it familiar.</p><br/><p>Young Master Zu Yan!</p><br/><p>Hadn’t the Zu family been completely destroyed? Why was Young Master Zu Yan alive? Complicated emotions that were difficult to understand filled his mind. Although he wasn’t aware of what Zu Yan had been through, Zu Yan was indeed standing before him, alive and well.</p><br/><p>Zu Yan’s mind and views of the world were still stuck in the time of Induction Ground, so they were young and tender. In contrast, Fatty, who was hiding far behind Zu Yan, was very experienced. He’d sensed the change in Zu Chun’s expression and demanded, \"Tell us your name too.\"</p><br/><p>Quivering, Zu Chun blurted out, \"Zu Chun.\"</p><br/><p>He immediately regretted revealing his name.</p><br/><p>Indeed, Zu Yan’s face turned grave. He asked coldly, \"Which branch are you from?\"</p><br/><p>The Zu family was a powerful family; it was well-established and still growing, with many side factions. Upon seeing someone from the same family on the battlefield, Zu Yan’s heart felt constricted, as if a ball of fire was stuck in his chest. The Zu family was destroyed, but the branch family was relying on their mortal enemy.</p><br/><p>Zu Chun kept silent for a moment before responding. \"The Hongling Zu Branch.\"</p><br/><p>Zu Yan’s voice was like an echoing, bitingly cold wind. \"There are even branches in the family. The Hongling Zu family is ranked third. The family head is a generous man. I was twelve when I last saw Hongling Zu family’s head, Uncle Ming. Is he still alive?\"</p><br/><p>Zu Yan was a direct descendant of the Zu family, so ever since he was young, he’d been regarded and nurtured as the successor of the family and was well-respected.</p><br/><p>After a long period of silence, Zu Chun shook his head. \"Hongling was surrounded for twenty days, and the situation was hopeless. Refusing to surrender but not wanting the family to be slaughtered, Uncle Ming killed himself. Those with \"Ming\" in their names have all died.\"</p><br/><p>The rage in Zu Yan’s chest was quickly extinguished and overtaken by sorrow.</p><br/><p>Zu Yan almost fainted upon waking up to the news that the whole Zu family had been slaughtered without exception. What followed was a long period of depression and decadence. Seeing Zu Chun reminded him of his family, which threw him into a fury. Knowing that Uncle Ming and the rest refused to surrender and committed suicide calmed him down.</p><br/><p>He’d felt angry because he was of the opinion that the family head had been betrayed.</p><br/><p>And the sorrow he felt now was due to his realization that there was nothing they could’ve done. Zu Yan could understand the despair and helplessness Uncle Ming and the rest must’ve felt when they ended their lives.</p><br/><p>Zu Yan said faintly, \"Go, I’ll pretend we’ve never met.\"</p><br/><p>Fatty opened his mouth, but he swallowed the words that were about to come out.</p><br/><p>Zu Chun shook his head. \"You don’t have to do that, Young Master. There’s no more Hongling Zu family. We’re separate individuals and were areon our own, so since we’ve met, let us have a death match, clean and open, fair and square, so that our friends and families will not be dragged into this.\"</p><br/><p>Zu Yan gave Zu Chun a meaningful look and nodded. \"I’m too soft-hearted.\"</p><br/><p>In these few years, Zu Yan had been like a blank slate. He was inexperienced and was still a melancholy and moody youth. Hearing Zu Chun’s words woke him up. Not only were their lives at stake but their comrades’ as well. If letting Zu Chun go would result in a defeat and the loss of his companions’ lives, he wouldn’t be able to forgive his sin even if he died.</p><br/><p>He reminded himself inwardly.</p><br/><p>Zu Chun inhaled a deep breath, gazing deeply at Zu Yan. \"I’m assuming this is the family’s absolute art [Flaming Heavenly Spider Transformation]?\"</p><br/><p>[Flaming Heavenly Spider Transformation] was the Zu family’s absolute art, and only direct descendants had the right to practice it. Zu Chun had only heard of the name and had never seen it for himself.</p><br/><p>Zu Yan replied, \"That’s right, but there are differences as well.\"</p><br/><p>In Induction Ground, Zu Yan practiced the [Flaming Heavenly Spider Transformation]. It was an absolute art that had undergone generations of deepening and perfecting. Zu Chun hadn’t seen it not only because only descendants weren’t able to practice it, but also because it was an extremely difficult skill to master. It demanded a lot, even from the most talented since it was astonishingly challenging to comprehend.</p><br/><p>In each generation, no more than three people were able to comprehend [Flaming Heavenly Spider Transformation]. But once they were enlightened, their accumulation would constantly deepen with time and turn them into very strong players.</p><br/><p>Due to having been frozen over for many years, the preserved wisp of unextinguished fire element in Zu Yan’s body was extremely pure. This was also the reason why he was able to become a Master so effortlessly upon being replenished with a huge volume of snow lava.</p><br/><p>Zu Chun’s laughter carried on for a while, his vigor rising drastically. \"Young Master’s [Flaming Heavenly Spider Transformation] isn’t the only exception!\"</p><br/><p>Whoosh. He engaged [Heavenly Roc Wings] and his body abruptly vanished.</p><br/><p>Zu Yan’s gaze sharpened. With a snort, he swiftly sprang up from the red spider web and wove a shield-sized spider web before him.</p><br/><p>Bang!</p><br/><p>A blurry afterimage flashed past as a dent appeared on the spider web shield. Sparks flew everywhere.</p><br/><p>\"Interesting indeed!\"</p><br/><p>Zu Chun’s laughter sounded in mid air. Borrowing the force of the spider web shield, he flew up into the sky.</p><br/><p>The durability of the spider web surprised him. As a member of the Zu family’s branch family, it could be said that [Flaming Heavenly Spider Transformation] had a well-known reputation and a special place in his heart. Because of that, he was even more excited to face his opponent. His battlelust was overflowing.</p><br/><p>Returning to the sky, Zu Chun’s hands no longer felt restricted. He felt more carefree.</p><br/><p>[Sky Roc Wings] worked better in the sky.</p><br/><p>With a tremble of the wings on his back, Zu Yan vanished once again.</p><br/><p>He reappeared behind Zu Yan almost immediately like an oblique sword ray, going straight for Zu Yan.</p><br/><p>As if he had eyes behind his head, Zu Yan sprang up from the spider web and stayed in the air.</p><br/><p>A spider web appeared before Zu Chun once again.</p><br/><p>He saw Zu Chun approaching, but he disappeared yet again.</p><br/><p>Zu Yan snorted. Like a poisonous snake that had sensed danger and raised its head, the few spider webs beside his legs gathered to form a big spider web over his head.</p><br/><p>Diving down without dodging, Zu Chun increased his speed and tilted his body slightly. The wings behind his back spread open like a scissors and smashed violently onto the spider web above Zu Yan’s head.</p><br/><p>A devilish, red knife ray sliced the spider web.</p><br/><p>Zu Yan’s face changed and he took a step toward his left.</p><br/><p>The descending red ray sliced Zu Yan’s body into two.</p><br/><p>Snap. The red spider web threads broke.</p><br/><p>Zu Chun did not look the least bit happy. That slice felt strange. Indeed, Zu Yan, who had been split into two, did not bleed at all. Instead, he gradually became blurry.</p><br/><p>Zu Chun caught a glimpse of a shadow out of the corner of his eye.</p><br/><p>Unknowingly, Zu Yan had already appeared a hundred meters away from him.</p><br/><p>Zu Yan looked up. The flickering flame in his eyes could cause one’s heart to palpitate. He raised his right arm, his fingers spread open, and his forefinger pointed at Zu Chun!</p><br/><p>An intense sense of danger rose in Zu Chun’s heart. Without the slightest hesitation, he engaged Heavenly Roc Wings.</p><br/><p>Hiss hiss hiss!</p><br/><p>It sounded like a spitting poisonous snake or a whining of a spider concealed within the darkness. Fire red spider web threads shot toward the sky.</p><br/><p>Zu Yan quickly engaged his wings and flew upward frantically.</p><br/><p>Densely packed red spider web threads chased closely behind him like a swarm of rapidly slithering red snakes.</p><br/><p>Zu Yan, who was on the ground, became a small, black dot, but the red spider web threads showed no indications of giving up.</p><br/><p>Zu Chun had decided. If he wasn’t able to dominate them in the sky, he might as well admit defeat!</p><br/><p>The exquisite red pattern on his Heavenly Roc Wings emitted a devilish, red light. Zu chun’s speed increased drastically and the afterimage in the sky flickered non-stop. His body had become erratic.</p><br/><p>He was like a sharp, red knife ray, plunging into the bitingly cold, golden-wind-filled deep space.</p><br/><p>The red spider web threads quickly became disordered.</p><br/><p>At the same time, a few hundred meters away, a shadow dove from the deep space toward the ground like a sharp arrow.</p><br/>\n</div>"}