{"title": "Chapter 535: Xing Shan’s Strength", "id": 535, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-535-xing-shan%E2%80%99s-strength", "volume_title": "Volume 6", "body": "<h1>Chapter 535: Xing Shan’s Strength</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 535: Xing Shan’s Strength</p><br/><p>Translator: TYZ Editor: Lucas, TYZ</p><br/><p>Being the division leader of the Ardent Flower Blood Division, Xing Shan was definitely very powerful. He had completed twelve rounds of blood refinement. Even though this number paled in comparison to Red Devil’s, it was still the second highest record.</p><br/><p>After leaving the Beast Venom Temple, he did not stop improving himself. Not daring to slack off at all, he trained diligently every day.</p><br/><p>Going through the blood refinement was like taking a gamble. Before the result was revealed, one would never know whether he won or lost. However, if he lost the gamble, he would never have a chance to play again.</p><br/><p>The effort Xing Shan put in had yielded great returns. Twelve rounds of blood refinement had established an extremely solid foundation in him. His blood contained an abundance of precious ingredients. The hard work he put into his training caused the beneficial effects of the ingredients in his blood to be released.</p><br/><p>His strength was increasing steadily over a long period of time.</p><br/><p>Out of 33 vertebrae, he had unlocked 30 of them. Among so many god guards, this was an extremely impressive result.</p><br/><p>Some of Fatty’s talent had amazed him, but that was because he had never seen anything like this before. The disparity between their strength levels was enormous. By waving his axe casually, Xing Shan was able to cut off all of Fatty’s escape routes.</p><br/><p>Fatty might’ve been able to cut off his smell and hinder Xing Shan from catching him, but he was completely helpless against an attack that covered such a wide range.</p><br/><p>There was no way out for him!</p><br/><p>As such, when Xing Shan waved his axe, Fatty immediately knew he was stuck.</p><br/><p>Fatty could not even imagine the disparity between his strength and Xing Shan’s. His heart was filled with despair.</p><br/><p>A strong sense of fear flooded him like a tidal wave.</p><br/><p>Suddenly, he looked as if an idea had erupted within his head. He reached out his hand and plucked out the hose that was connected to the snow lava on his back and stuffed it into his mouth.</p><br/><p>Gulp, gulp!</p><br/><p>Like an incredibly thirsty traveller that was lost in the desert, he began to gulp down the snow lava.</p><br/><p>Zu Yan’s facial expression changed drastically. He cried out in alarm, \"Fatty!\"</p><br/><p>The crystal-clear liquid was snow lava! It was an A-grade fire liquid!</p><br/><p>A drop of it could effortlessly burn through a rock, and Fatty had actually taken two mouthfuls of it.</p><br/><p>He was done for!</p><br/><p>Zu Yan’s head was buzzing and his mind went blank. How could a mortal drink an A-grade fire liquid?</p><br/><p>Following which, Fatty spat out the hose. His face was in daze, looking extremely weird.</p><br/><p>When the snow lava entered his body, his nearly depleted fire elemental energy reacted as if it had been doused with a basin of hot oil, intensifying and becoming extremely violent in an instant.</p><br/><p>An endless stream of flames was emitting from Fatty’s body. These flames were not bright-red. Instead, they were white in color, resembling the blaze flowing in his eyes.</p><br/><p>Fatty’s flushed cheeks suddenly became pale-white, looking as if his blood was being sucked dry. Every now and then, his facial muscles were twitching, making him looked unusually sinister and crazy.</p><br/><p>\"Fatty, why don’t you want to put me down…\" Zu Yan’s cheeks were streaming with tears.</p><br/><p>After he was released from the ice seal, his teacher told him that the world nowadays was much more cruel than before. He felt that he had made enough mental preparations, but it turned out that reality was completely different from his expectations.</p><br/><p>Fatty could hear Zu Yan crying. At this point in time, he had lost his sanity. Suddenly, he made a very weird posture. He raised his right arm perpendicular to his body and straightened it. Then, he bent his left arm and used it to support his right arm.</p><br/><p>When Xing Shan saw that Fatty did not run and turned around instead, a sneer appeared on his face.</p><br/><p>Now you know you can’t escape. Your courage is indeed laudable, but your strength is too weak. You’re merely making a fruitless attempt.</p><br/><p>However, when Xing Shan saw Fatty gulping something and then made a weird posture, he was stunned.</p><br/><p>What inheritance was this?</p><br/><p>Boom!</p><br/><p>A muffled boom resounded through the air.</p><br/><p>Zu Yan, who was previously on Fatty’s shoulder, was tossed into the air by the impact.</p><br/><p>In the mid-air, Zu Yan saw an amazing scene. Fatty’s straightened right arm jerked back like a cannon.</p><br/><p>A white-colored blaze was shooting out from the fist of Fatty’s straightened right arm.</p><br/><p>Zu Yan’s mind went blank. What kind of technique was this?</p><br/><p>Meanwhile, on the opposite side, a cold glint flashed across Xing Shan’s squinted eyes.</p><br/><p>The white blaze did not look very powerful, but it was extremely fast, resembling an attack that was launched by a pagoda cannon. A white burst of light flashed across everyone’s eyes. Following which, the bloody gleam from Xing Shan’s axe crashed into the white blaze, resembling a surging tidal wave that collided against a solid reef.</p><br/><p>Boom!</p><br/><p>A bloody glow rushed towards the sky, making the sky look as if it was raining blood.</p><br/><p>The result of the impact caused everyone to turn pale with fright.</p><br/><p>All of them knew how powerful Boss Xing Shan’s axe was. It would take at least four people to be able to withstand a casual attack from his axe.</p><br/><p>This fatty had actually used such a weird attack to block Boss Xing Shan’s axe!</p><br/><p>Furthermore, Fatty looked as if he was in dire straits just now.</p><br/><p>Just as everyone was feeling astonished, Fatty’s body wobbled, looking as if he was going to collapse.</p><br/><p>So he was just an arrow that had reached the end of its flight!</p><br/><p>A sinister smile appeared on Xing Shan’s face as he raised his heavy axe once more. The Chieftain Wolf beneath broke into a small run. It was repeatedly infuriated by Fatty today. Following which, it began to pick up its speed.</p><br/><p>Thud, thud, thud!</p><br/><p>Every step it took, the earth shook and the mountain trembled. Dirt and flames flew up the air, resembling a hurricane that was devastating the trees and plants in its surroundings.</p><br/><p>\"Die!\"</p><br/><p>A roar echoed through the air. In mid-air, the man and the beast looked as if they had merged together. The axe gleam descended from the sky, resembling a powerful, bloody waterfall. It was accompanied by a terrorizing vibrating whizz. No living things within three hundred metres of Xing Shan could escape unscathed!</p><br/><p>Zu Yan widened his eyes as he looked at the red-colored sky that was rapidly falling towards him. His mind had gone totally blank.</p><br/><p>They were going to die here today…</p><br/><p>Like a wooden puppet, Fatty couldn’t move at all. His face was deathly pale.</p><br/><p>Suddenly, a shrill whistle rang echoed through the air. It sounded as if it came from a distant place. However, in the blink of eye, the whistle appeared to be right here with them.</p><br/><p>A blue-white shadow appeared out of thin air in front of Fatty. The shadow was moving so fast that it appeared blurry. Xing Shan couldn’t see the face of the shadow clearly. He could only see a ponytail fluttering behind it...</p><br/><p>And the tip of a spear that was rapidly expanding in size before his eyes.</p><br/><p>The spear effortlessly pierced through the bloody, waterfall-like axe gleam as if it was a red-colored curtain.</p><br/><p>The blue, firmament-iron-made spear tip collided heavily with the blade of the black, heavy axe.</p><br/><p>Xing Shan felt as if he had been hit by a berserk dire beast. The terrifying attack caused his facial expression to change drastically. Starting from the bottom of his spine, the vertebrae in his back began to light up one by one.</p><br/><p>His eyes widened angrily while his muscles trembled violently. He roared, \"Break!\"</p><br/><p>To his horror, just as the word left his mouth, he discovered that the power coming the spear was becoming stronger and stronger. If his axe gleam was like a surging tidal wave, then the spear tip would be an entire sea!</p><br/><p>How could… it be....</p><br/><p>The scenery on both sides of Xing Shan’s eyes was flashing by, turning into streaks of shadows from his perspective. The Chieftain Wolf beneath him had already entrenched its four limbs in the ground, but it still could not stop despite using all its strength.</p><br/><p>Bang!</p><br/><p>Xing Shan’s back slammed against a huge tree. The huge tree was smashed to smithereens and wood shavings were sent flying through the air. Bang, bang, bang. Xing Shan’s body kept on trembling as he continued to fly backwards and knock down trees and rocks along the way. His gaze was fixated on the blue-white shadow that was pulling apart in distance from him.</p><br/><p>The sounds of dried branches snapping, rocks shattering, and the earth splitting could not conceal the confident and vigorous voice of a girl.</p><br/><p>\"I am Shi Xueman.\"</p><br/><p>To Xing Shan’s horror, before he could even stabilize himself, he realized that the girl in the distance was pointing her spear at him.</p><br/><p>Shi Xueman’s eyes were so cold that they resembled the ice-blue sky above a snowy mountain.</p><br/><p>Suddenly, she disappeared</p><br/><p>Not good!</p><br/><p>Xing Shan’s eyelids twitched as he subconsciously placed his heavy axe in front of him.</p><br/><p>Like the sound of raindrops landing on a banana leaf, a crisp and clear sound of collision resounded through the air.</p><br/><p>Xing Shan’s body trembled. Every spear move Shi Xueman executed was crisp, powerful, and unblockable. Xing Shan had never encountered such an attack before. Every move was plain and simple, resembling a standard thrust. There was no dazzling luster, gorgeous techniques, or unnecessary changes. However, her spear thrusts were still extremely formidable.</p><br/><p>The tens of spear thrusts gathered.</p><br/><p>Xing Shan looked as if he had been struck by a lightning bolt as terrifying power gathered in the blade of his heavy axe. He and the Chieftain Wolf had completely lost control of their bodies.</p><br/><p>However, what everyone saw was completely different.</p><br/><p>Shi Xueman suddenly appeared in front of Xing Shan. At almost the same time, Xing Shan and his mount, who were still flying backwards, disappeared.</p><br/><p>In mid-air, Shi Xueman calmly withdrew her spear with the side of her body facing forward. She looked around and asked, \"Who are you?\"</p><br/><p>The faces of everyone in the Ardent Flower Blood Division had turned white. All of their eyes were filled with fear. No one dared to reply to Shi Xueman.</p><br/><p>Suddenly, a loud rumble resounded through the air behind everyone. Xing Shan and his mount had created a huge trench on the ground.</p><br/><p>Everyone regained their senses and rushed towards Xing Shan like a swarm of bees.</p><br/><p>A two-meter-deep trench appeared on the ground in front of Shi Xueman. It was perfectly straight and extended over several hundred meters. All of the trees and rocks along the trench were reduced to fine powder.</p><br/><p>Zu Yan was dumbstruck as he looked at the scene. He was utterly stunned. This was the first time he was shocked by someone’s might other than his teacher’s.</p><br/><p>Shi Xueman was actually so powerful to such a terrifying extent...</p><br/><p>Even Yang Xiaodong, who was standing behind Shi Xueman, was startled.</p><br/><p>He had fought with her before in the past. At that time, even though she was very powerful, she was only slightly more powerful than him. How could she have grown so much in such a short period of time?</p><br/><p>Yang Xiaodong felt that his training was a waste.</p><br/><p>Shi Xueman landed gracefully on the ground. An ordinary-looking movement from her looked peerlessly magnificent in everyone’s eyes.</p><br/><p>Without turning her head, she said, \"Yang Xiaodong, bring them and leave first.\"</p><br/><p>\"Yes! Division Leader, be careful!\"</p><br/><p>Yang Xiaodong replied. His tone involuntarily carried a tinge of respect.</p><br/><p>He picked the unconscious Fatty and Zu Yan and flew in the direction of of their camp. His heart was twisting at this moment. He wished that he could stay behind and fight with Shi Xueman. However, this was an order, so he had to obey it.</p><br/><p>Zu Yan turned his head around and looked at Shi Xueman too. In the past, he only listened to his teacher’s orders. However, from this moment onwards, he regarded himself as a member of the Spear of Heavy Cloud.</p><br/><p>Zu Yan turned his head back when he could no longer see Shi Xueman. When he saw Fatty, who was in the other arm of Yang Xiaodong, he was shocked.</p><br/><p>Fatty’s hand was holding on to a person… Zu Chun.</p><br/><p>The unconscious Fatty was holding on tightly to Zu Chun’s leg, appearing as if he was holding onto a treasure.</p><br/><p>When… had this fellow picked up the body of Zu Chun...</p><br/>\n</div>"}