{"title": "Chapter 552: Knife", "id": 552, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-552-knife", "volume_title": "Volume 6", "body": "<h1>Chapter 552: Knife</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 552: Knife</p><br/><p>Translator: Irene Editor: X, TYZ</p><br/><p>In a simple room, on a red clay stove, sat a steaming silver pot. It was like an angry little monster spouting thick steam. Mist lingered around, keeping the room especially warm.</p><br/><p>It wasn’t easy for Nian Tingfeng to enjoy a leisurely afternoon just reading books and sipping on tea. He was very relaxed.</p><br/><p>A knock came at the door.</p><br/><p>Nian Tingfeng’s gaze never left the scroll in his hands. He casually called out, \"Come in.\"</p><br/><p>An ordinary looking man walked in and bowed respectfully. \"Boss.\"</p><br/><p>The Surveillance Division was probably the only combat division that took looks into consideration. Members mustn’t be overly handsome, ugly, tall, sturdy, strong, and so on. If you were thrown into a crowd and became impossible to find, then congratulations, the Surveillance Division needs you.</p><br/><p>The Surveillance Division was filled with average looking members. It was difficult to find someone even a little eye-catching.</p><br/><p>Nian Tingfeng asked idly, \"It’s all arranged?\"</p><br/><p>His subordinate reported, \"Yes, we’ve made arrangements with the main news village. Everyone will be able to see how the Spear of Heavy Cloud prevailed over the Ardent Flower Blood Division. We were quite far away, but it was a pretty decent spot.\"</p><br/><p>Nian Tingfeng continued reading his book and replied, \"Praise Shi Xueman more. We must shape her into the hero of elementalists so she can share the burden of our hope.\"</p><br/><p>\"Yes.\"</p><br/><p>\"When the time is ripe, we can discuss the pagoda cannon and make a move from there.\"</p><br/><p>\"Yes.\"</p><br/><p>Noticing that his subordinate wasn’t in high spirits, Nian Tingfeng diverted his gaze and put his scroll down. \"Any problems?\"</p><br/><p>His subordinate kept quiet.</p><br/><p>Nian Tingfeng picked up the silver pot unhurriedly and filled it with water. \"Xiao Lin, how long have you been working for me?\"</p><br/><p>\"16 years, Boss.\"</p><br/><p>Moved, Nian Tingfeng continued, \"Yeah, 16 years. You’re the person I worry about the least. You’ve never hesitated to execute tasks that I have assigned you, no matter how dangerous they were. I did not expect for you to hesitate today.\"</p><br/><p>Guilt flashed across Xiao Lin’s eyes. \"I just feel… they’re fighting so hard at the front line…\"</p><br/><p>Nian Tingfeng interrupted calmly, \"And we’re stabbing knives into their backs? You feel uncomfortable?\"</p><br/><p>Exposed, Xiao Lin answered frankly, \"The situation is so dangerous, but the higher ups are still engrossed in their internal strife. We are at a loss and do not know what stance to take.\"</p><br/><p>Nian Tingfeng explained amiably, \"You guys aren’t the only one feeling this way. I am too, but look at Beyond Avalon. It is like a sheet of loose sand with the cities standing alone. Can they obstruct the Blood of God? It’s true that Shi Xueman is powerful, and it’s an amazing feat that the Spear of Heavy Cloud have accomplished by wiping out the Ardent Flower Blood Division. However, the Ardent Flower Blood Division is only one of the 12 blood division. There are still six god divisions above them. Can Shi Xueman pull strongly against this crazy tide? No. Can Shenwei and Caijue do it? No, because our forces are all too fragmented. Will Shenwei and Caijue take orders? Will the Spear of Heavy Cloud?\"</p><br/><p>Xiao Lin kept silent.</p><br/><p>Nian Tingfeng added, \"What we need now isn’t one or two victories. We must look at the overall situation. On a large scale, what do we need the most? We must unify the forces. Only then might we be able to win. Victory is impossible if we all fight our own battles. As for the person who will unify the forces, I’m not really concerned. So far, I think the likelihood of Madam Ye being that person is the highest.\"</p><br/><p>\"If there’s really a hero, us small figures won’t be able to obstruct him or her. If the so-called hero can’t even get passed us, then hero is not the right term. I don’t actually want to talk about any major principles. There are many reasonings in the world, and they all make their own sense. We are like a knife, so we should just do what knives do. Don’t you think so?\"</p><br/><p>Xiao Lin stayed quiet and hung his head down shortly. \"You words are right.\"</p><br/><p>Nian Tingfeng waved his hand. \"I can't tell when the battle will start. Get everyone to feel at ease. Do things slowly, and look around slowly. We have time. Why be heroic in this chaotic world? This chaotic world is like a sieve, sifting away the unlucky and the weak. We’re part of the sieve. How could this sieve get in the way of a true hero?\"</p><br/><p>Xiao Lin was impressed, his dejected look vanishing. \"I’ll pass on the message to everybody.\"</p><br/><p>Nian Tingfeng warned repeatedly, \"It’s most important to get things done properly. As long as the knife is sharp and serviceable, Madam will need it and the hero will need it too. If the knife is not useful, what use would it be for Madam or the hero?\"</p><br/><p>Xiao Lin was convinced. \"Yes!\"</p><br/><p>…..</p><br/><p>Thunder City, two hours later.</p><br/><p>\"Everyone securely seated?\"</p><br/><p>Gu Xuan’s stern gaze swept across the crowd inside of the Pinwheel Sword. He was having a headache. Boss had instructed him to bring some of the news villages’ reporters back. By bringing so many of them back, would it be considered mission accomplished or not?</p><br/><p>He was uncertain.</p><br/><p>However, he had taken the situation into consideration. Plus, Boss intended that the selection should be done by Qiao Meiqi. They just had to transport the people over as fast as possible.</p><br/><p>Needless to say, the reporters stirred at the news that Qiao Meiqi wanted them to head to the mysterious Central Pine Valley. They quickly packed their belongings and brought sufficient mirage bean pods along.</p><br/><p>The guests at the mayoral residence’s gate also took the chance to express their interest.</p><br/><p>The Central Pine Valley was supremely popular, and everyone wanted to be associated with it. Yet, it was like a tortoise, making it impossible for people to make a move. Those who approached the valley would go missing, their fates unknown.</p><br/><p>Those who wanted to purchase snow lava would have to go to Thunder City.</p><br/><p>Now that there was a chance to head directly to the Central Pine Valley, no one was going to let it slip by. Agitated they shouted things like \"Mayor Qiao, how long are you going to make us wait?\" and \"This isn’t how you do business\" in hopes of traveling along.</p><br/><p>Qiao Meiqi, who was initially worried about the number of reporters, took advantage of the situation and \"reluctantly\" agreed.</p><br/><p>He even took Gu Xuan’s doubt upon himself, making others look at him with a whole new level of respect. He’s an interesting guy indeed!</p><br/><p>Qiao Meiqi was a wise man. Whether there were sufficient people or not, Gu Xuan wouldn’t be affected, but this plank was still going to land on his buttocks. He reckoned that seven reporters wouldn’t satisfy Ai Hui. Bringing more people would at least present a greater chance.</p><br/><p>Everybody boarded the Pinwheel Sword, looking and touching around. They were full of curiosity.</p><br/><p>Yet, many of them were also inwardly being mindful.</p><br/><p>From the snow lava to pagoda cannon, the Central Pine Faction had created one trend after another. Could the Pinwheel Sword be the next craze?</p><br/><p>It was a rare opportunity for them to experience riding in it.</p><br/><p>The seven reporters were even more excited, taking out their mirage bean pods and recording fervently.</p><br/><p>Gu Xuan couldn’t be bothered with them. He declared the seven pagodas as prohibited ground, sending people to stand guard. As he started operating the Pinwheel Sword, the elemental energy wave that it emitted was enough to cover its elemental trace, so no one could tell.</p><br/><p>\"Sit tight! We are setting off!\"</p><br/><p>Gu Xuan was somewhat resentful. There were so few passengers, yet it took two hours just to get everybody seated. How slow. Ever since he started leading his own team, his voice had thickened since he was basically roaring the whole time.</p><br/><p>\"It looks so strange!\"</p><br/><p>\"Yeah, I wonder why.\"</p><br/><p>\"Big dipper. It’s like the big dipper.\"</p><br/><p>\"Swordsmen always have such odd things.\"</p><br/><p>Everyone on board discussed enthusiastically as they looked in all directions, full of curiosity and anticipation. Gu Xuan’s words fell on deaf ears. He wasn’t even a Master so why was he yelling? As everyone was in high spirits, no one bothered with Gu Xuan. They were just looking and touching everything.</p><br/><p>Gu Xuan didn’t look too good. He felt as if he was leading a group of defiant tourists.</p><br/><p>Due to the Sword of Lightning’s training, he had gradually gotten used to a life of strict discipline and tranquility. He wasn’t used to clamorous scenes.</p><br/><p>Luckily, there would not be such missions in future, he consoled himself.</p><br/><p>He yelled toward Shi Zhiguang, who was at the rear, \"Set off!\"</p><br/><p>Shi Zhiguang, too, shouted, \"Set off!\"</p><br/><p>The Pinwheel Sword lifted off the ground with a lightness that contradicted of its bulk. It then sped up and pierced through the clouds like an oblique sword ray. Those inside could feel the experience more directly and intensely.</p><br/><p>\"Ahhhhhhhh!\"</p><br/><p>\"Oh my god, oh my mother!\"</p><br/><p>\"Oh father!\"</p><br/><p>...</p><br/><p>Ear-piercing shrieks echoed. The sudden and sharp acceleration caught everyone off guard. Many of them their lost balance and fell onto the ground like calabashes. It was a mess.</p><br/><p>Gu Xuan snorted lightly, raising his chin. He had deliberately chosen not to remind them.</p><br/><p>Ever since he had started following Ai Hui, he had been slightly infected by his badass style of doing things.</p><br/><p>The passengers were pale, and the more timid ones were trembling uncontrollably in their thighs. They were all familiar with flying, but had never experienced such extreme speed.</p><br/><p>The scenery on both sides flew by at a speed difficult for the naked eye to catch. It was like a brightly-colored optical tape. The rising screen was transparent like crystal, and they could clearly see the light scars and sparks created by the friction between the screen and the violent airflow.</p><br/><p>Even if they were separated by a layer of light screen, everybody couldn’t help but feel alarmed and frightened.</p><br/><p>Wen Yongmin was rather afraid initially. His mind had been blank since they took flight. The tide-like shrieks drowned him, his face was pale, and his whole body was shaking.</p><br/><p>When the flight started stabilizing, however, he regained his senses.</p><br/><p>Excited, the blood returned to his pale face.</p><br/><p>His first reaction was to check his mirage bean pod. Luckily, he had it all recorded. He knew he was going to strike it rich! He could imagine how big of a commotion his video was going to cause!</p><br/><p>He surveyed those around him. Everybody was feeling excited and emotional.</p><br/><p>As a veteran reporter, Wen Yongmin was an expert at digging for news. He had been presented with an extremely rare chance since the Central Pine Valley had always kept a low profile. Wen Yongmin was determined to cherish this opportunity.</p><br/><p>He locked his gaze onto Gu Xuan. This middle-aged man looked like the leader of these people.</p><br/>\n</div>"}