{"title": "Chapter 572: The Utter Defeats At The Front Line", "id": 572, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-572-the-utter-defeats-at-the-front-line", "volume_title": "Volume 6", "body": "<h1>Chapter 572: The Utter Defeats At The Front Line</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 572: The Utter Defeats At The Front Line</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>When Ke Ning retreated along with the Blue Flag Division, he discovered that the area around the Spear of Heavy Cloud’s encampment was packed with people.</p><br/><p>The Blue Flag Division had suffered heavy losses. Less than one-third of its troops had made it back alive. One could say that they had completely lost their ability to fight on the battlefield. However, Ke Ning did not want to go back with his tail between his legs. He brought the remnants of his combat division and encamped at a location that was far away from the Spear of Heavy Cloud’s camp.</p><br/><p>Now that the Blue Flag Division finally had a chance to take a breather, everyone in the combat division heaved a sigh of relief.</p><br/><p>However, they had suffered heavy casualties, so the soldiers were low in morale and dejected. Before they headed toward the battlefield, they were grandiose and smug. They felt that they had obtained the key to victory after modifying the pagoda cannons.</p><br/><p>However, during their first battle with the blood elementalists, they watched their comrades being mowed down like fragile grass. It was then that they realized how wide the strength disparity between them and the blood elementalists was.</p><br/><p>Anguished wails and groans filled every corner of their camp. The survivors were crestfallen and dejected. Ke Ning felt stressed and walked out of the camp alone.</p><br/><p>Li Houtang noticed Ke Ning’s irregular behavior, stopped working, and walked out of the camp as well.</p><br/><p>Ke Ning sat beside a brook not far away from the camp.</p><br/><p>When Li Houtang walked closer to the brook, he heard Ke Ning stifling his crying. Li Houtang sighed and sat beside Ke Ning. Then, he consoled him, \"It’s not your fault. You don’t need to blame yourself.\"</p><br/><p>Ke Ning was like a nephew to him, and he had watched him grow up. Ke Ning had been a very arrogant individual from a very young age. This defeat had dealt a huge blow to him. Li Houtang was very worried that Ke Ning wouldn’t recover from this setback.</p><br/><p>Li Houtang continued to console him, \"There are not many combat divisions that can contend with the blood elementalists. Therefore, there’s nothing embarrassing about losing to them. This place isn’t safe, so it’s better if we retreat as soon as possible. Given the advancing speed of the blood elementalists, they will reach here very soon.\"</p><br/><p>Ke Ning stopped crying and wiped the tears off of his face. Then, he raised his head and said, \"I’m not leaving.\"</p><br/><p>Li Houtang sighed. \"Do you think now is the time to throw a tantrum? This time around, all of the God Nation’s combat divisions have been activated. Who can stop them? Even the Spear of Heavy Cloud, which has God-subduing Peaks, might barely hold them back.\"</p><br/><p>\"If the Spear of Heavy Cloud can’t hold them back, where can we go even if we retreat?\" Ke Ning asked.</p><br/><p>Li Houtang was speechless.</p><br/><p>What Ke Ning said was true. The Spear of Heavy Cloud was the last line of defense. If they couldn’t hold back the flood of blood elementalists, then no one could.</p><br/><p>\"We have to stay…,\" Ke Ning said as his tone became more solemn, \"… and join the Pagoda Cannon Alliance. In reality, our pagoda cannons do cause damage to the enemy forces and are really useful, but our level is too low. By joining the Pagoda Cannon Alliance, we can learn how to really use the pagoda cannons and will definitely increase our offensive power.\"</p><br/><p>\"But I heard Shi Xueman is domineering and arrogant. What if she wants us to hand over the command of our combat division to her if we join the Pagoda Cannon Alliance?\" Li Houtang said in a worried tone.</p><br/><p>\"Then we will hand it over!\" Ke Ning’s tone was determined. Following which, he muttered, \"What’s the point of holding onto the remnants of this combat division?\"</p><br/><p>Li Houtang did not try to persuade Ke Ning anymore. He was right. Their combat division had been broken, while the morale of their troops had reached rock bottom. The devastating defeat had caused many of them to lose the courage to fight the blood elementalists ever again.</p><br/><p>\"So many of our brothers have died. There’s no way I can go back and hide from this fact,\" Ke Ning said as he stared at the brook.</p><br/><p>\"There are so many combat divisions that want to join the Pagoda Cannon Alliance. I’m afraid it won’t be easy for us to do so.\" Li Houtang was slightly worried.</p><br/><p>\"Very soon, there won’t be that many combat divisions,\" Ke Ning muttered.</p><br/><p>\"What do you mean by there won’t that many combat divisions very soon?\" Li Houtang could not help but ask.</p><br/><p>\"What does Uncle Li think of our Blue Flag Division?\" Ke Ning asked.</p><br/><p>\"It can’t be compared to the Spear of Heavy Cloud, but it’s definitely much more powerful than the ordinary combat divisions,\" Li Houtang replied with pride.</p><br/><p>Ke Ning nodded his head. Apparently, he agreed with what Li Houtang said. However, his tone then changed as he continued, \"If we suffered such a devastating defeat, what makes you think that the others won’t suffer the same fate as us?\"</p><br/><p>Li Houtang was stunned.</p><br/><p>Ke Ning continued, \"Uncle Li, you shall see. Soon, there will be a lot of bad news, and more than half of the combat divisions here will run away.\"</p><br/><p>Li Houtang was astounded. He could not help but examine Ke Ning closely.</p><br/><p>Ke Ning’s previously young and tender face seemed to have aged and matured significantly overnight. The arrogance that he used to possess had completely disappeared and was replaced by maturity.</p><br/><p>Li Houtang felt very glad.</p><br/><p>Ke Ning’s words came true.</p><br/><p>The Green Heavy Division was defeated, the Golden Feather Division was defeated, the Poplar Division was defeated…</p><br/><p>More and more combat divisions were utterly defeated. The record for news of these defeats was five different combat division being defeated in one day.</p><br/><p>Currently, the true strength of the enemy forces was gradually surfacing. The enemy troops were split into three separate forces and advanced at the same time.</p><br/><p>The God Tiger Division, which led the Radiance Blood Division and the Bluster Blood Division, and God Tiger Division, which led the Birth Blood Division and the Death Blood Division, served as the left and right wing forces. The God Wolf Division, which led the Silverfrost Division, served as the central force.</p><br/><p>Beyond Avalon’s combat divisions that stationed to oppose these three forces were obliterated. </p><br/><p>The pagoda cannon technology, which everyone placed their hopes on, did not bring about victories.</p><br/><p>The atmosphere suddenly became tense and grave. The retreat of the defeated combat divisions from the front line dealt an extremely huge blow to the morale of Beyond Avalon. According to the survivors, the God Nation’s combat divisions were invincible like God himself. </p><br/><p>The members of various combat divisions felt panic. Various versions of rumors were spreading everywhere.</p><br/><p>Some combat divisions had already sensed that something was wrong and began to retreat. This created a chain reaction and caused an upsurge in the number of retreating combat divisions. Every day, there were combat divisions that decamped and retreated.</p><br/><p>The surrounding area of the Spear of Heavy Cloud’s camp, which was previously packed, was now spacious and empty.</p><br/><p>The atmosphere in the Spear of Heavy Cloud became tense as well.</p><br/><p>Jiang Wei, who had just returned to the camp, did not even have the chance to allow his injuries to recover. He had already begun to prepare for battle. The newly recruited members had been sent to training as well. Originally, these newly recruited members were intended for future deployment, but due to the sudden critical situation, they had to be immediately trained and prepared.</p><br/><p>Inside the camp, the one with the most stress was Fatty.</p><br/><p>Initially, Fatty was filled with enthusiasm. This was especially the case after he learned that Ai Hui would arrive soon. He acted as if he was on steroids. Being able to show off to Ai Hui was a dream that he had had since the days he worked in the Wilderness as a laborer.</p><br/><p>However, as the situation worsened, his intention of showing off to Ai Hui had been thrown to the back of his mind.</p><br/><p>Pagoda cannons were the key weapons they used against blood elementalist combat divisions. This weapon was also the cornerstone for their battle formations and tactics. If something went wrong with the pagoda cannons, they would have to redesign their battle formations and tactics.</p><br/><p>Fatty, who had never taken on such a huge responsibility before, felt as if he was carrying a mountain on his shoulders now.</p><br/><p>Unfortunately, the process of building the pagoda cannons had currently gone astray.</p><br/><p>There was an area in the camp that was specifically converted into a smithy and buzzed with activity. A huge number of blacksmiths that had been conscripted with snow lava as payment were trying to forge real Beehive Heavy Cannons at the moment.</p><br/><p>The heavy cannon that Fatty had previously used for demonstration was a scaled-down prototype. He envisioned the true Beehive Heavy Cannon to be 18 meters in length and three meters in diameter.</p><br/><p>Everyone was unfamiliar with forging pagoda cannons, let alone building the high level Beehive Heavy Cannons. Up until now, they had yet to succeed. Fatty was so anxious that his mouth developed ulcers and his eyes became bloodshot.</p><br/><p>\"Master Fatty, what kind of pagoda can hold such a heavy cannon?\"</p><br/><p>\"Master Fatty, how about we make it smaller? It’s okay if the power is lower!\"</p><br/><p>The blacksmiths kept on trying to persuade Fatty. The consecutive failures had dealt a huge blow to everyone’s morale.</p><br/><p>\"All of you, shut up!\" Fatty’s eyes were inflamed.</p><br/><p>Whenever Fatty flew into a rage, a cold shiver would go down everyone’s spine. All of them lowered their heads in fear.</p><br/><p>Currently, Fatty missed Blind He terribly. Even though Blind He always looked cold and unfriendly, his skills were superb.</p><br/><p>Zu Yan walked over and squatted down to examine the scrapped heavy cannon. Swiftly, he discovered that the problem laid in the beehive-shaped inner chamber. There were many small tears in the inner chamber.</p><br/><p>This was the main reason why the blacksmiths could not forge an actual Beehive Heavy Cannon.</p><br/><p>Zu Yan also racked his brain. His injury had yet to recover completely, and he knew the current situation was critical. There wasn’t much time left for them. If they could not produce enough Beehive Heavy Cannons, their strength would be greatly reduced.</p><br/><p>However, Zu Yan wasn’t a weaponsmith, and he knew nothing about forging weapons. He was not able to gain any further insights even after he stared at the cannon for a long time.</p><br/><p>After he left the smithy, he still could hear Fatty’s thunderous roars. This was the first time Zu Yan had seen Fatty care so much about something. In his eyes, Fatty was someone who never set his heart on doing anything.</p><br/><p>His tyrannical behavior made him look like an entirely different person now.</p><br/><p>Fatty had saved Zu Yan’s life before. As such, he was also racking his brain to think of a solution for Fatty.</p><br/><p>He remembered that Fatty had said there wouldn’t be any problems with forging the Beehive Heavy Cannons as long as they had an outstanding blacksmith. Unfortunately, their blacksmiths were conscripted and weren’t really high-level. Furthermore, the level of a blacksmith couldn’t be increased in a short period of time.</p><br/><p>Should he go and find a formidable blacksmith?</p><br/><p>But where could he find one? Their camp wasn’t near any cities or villages, so how could there be blacksmiths available?</p><br/><p>Suddenly, Zu Yan’s eyes lit up. He knew where he could find blacksmiths, but he soon felt apprehensive. After all, the pagoda cannon forging process was confidential. After thinking it over a second time, he changed his mind. If they were to lose this battle, they would have nothing left. Thus, there was no point for them to keep anything confidential.</p><br/><p>…..</p><br/><p>The current situation was exactly what Ke Ning expected. He had not remained idle. These past few days, he had been encouraging his troops and had given pensions to those soldiers who had lost the will to fight, letting them return home.</p><br/><p>After carrying out this reorganization, he was left with over 100 men in his combat division. His camp was rather empty, but the morale of his men had completely changed. Those soldiers who stayed were hungry for vengeance.</p><br/><p>There was no news from the Pagoda Cannon Alliance. Ke Ning remained patient and did not seek out Shi Xueman. He was waiting for a chance.</p><br/><p>Ke Ning had been observing the Spear of Heavy Cloud from the side. When he saw an elementalist from the Spear of Heavy Cloud walking in his direction, he became energized.</p><br/><p>:\"?\"</p><br/><p>Taking the initiative, he asked this elementalist, \"Has the Pagoda Cannon Alliance begun the recruiting process?\"</p><br/><p>The other party was stunned. Then, he shook his head and answered, \"No.\"</p><br/><p>Ke Ning felt slightly disappointed, but he maintained his patience. Upon seeing that the other party had an anxious look on his face, Ke Ning asked, \"Can I be of any help to you?\"</p><br/><p>\"Do you have any blacksmiths? We need outstanding blacksmiths,\" the other party replied.</p><br/><p>Ke Ning was surprised. The other party was actually looking for blacksmiths. He couldn’t help but ask, \"May I know what the problem is?\"</p><br/><p>The other party did not want to answer his question.</p><br/><p>Ke Ning’s mind jolted. They needed blacksmiths at this moment, but did not want to answer his question, could it be…</p><br/><p>He forced himself to stay calm and said, \"Give me a moment.\"</p><br/><p>He turned around and yelled for Li Houtang.</p><br/><p>The person examined Li Houtang and said politely, \"We need outstanding blacksmiths. May I know your honourable name?\"</p><br/><p>\"My name is Li Houtang. I’m a master weaponsmith,\" Li Houtang replied with pride.</p><br/><p>He was extremely proud of his qualifications.</p><br/><p>The shock that the person initially felt rapidly turned into ecstasy.</p><br/>\n</div>"}