{"title": "Chapter 573: Fish Bone", "id": 573, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-573-fish-bone", "volume_title": "Volume 6", "body": "<h1>Chapter 573: Fish Bone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 573: Fish Bone</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>The situation was worsening much faster than Shi Xueman and the rest expected.</p><br/><p>Shi Xueman, Silver Soldier, and Karakorum Polaris convened an emergency meeting. Important generals from the three combat divisions gathered and discussed how they were planning to deal with the current situation. Everyone had grave looks on their faces.</p><br/><p>\"I have just received news that the Poplar Division and the Green Heaven Division suffered heavy losses and that the Northfield Division was completely destroyed. Up until now, there have been more than 20 combat divisions that are out of action and more than six combat divisions that have been annihilated. According to the survivors, the enemy forces seemed to purposely allow our allies to withdraw when they could have annihilated them,\" Silver Soldier said solemnly.</p><br/><p>\"Purposely allowed them to withdraw?\" Sang Zhijun was shocked.</p><br/><p>\"They are trying to use the defeated soldiers to overwhelm and swamp our defensive line.\" Shi Xueman looked worried after thinking about it.</p><br/><p>Silver Soldier let off a bitter laugh behind his mask and said, \"That’s correct. Right now, the combat divisions at the front line are scared out of their wits and are retreating with all their might. Looking from their positions, the three enemy forces are like a huge cloth bag with our location as the only opening. Every day, numerous combat divisions are retreating through our location.\"</p><br/><p>\"The number of combat divisions around our camp has already reduced greatly. Those opportunists have already run away,\" Jiang Wei said.</p><br/><p>\"It’s good that they ran away. They were just a ticking time bomb.\" Silver Soldier nodded his head.</p><br/><p>The rest nodded their heads as well. Silver Soldier was right. Those combat divisions were nothing but trouble. Not only were they weak, they were insubordinate as well. Just two days ago, Shi Xueman had to personally teach a lesson to a few troublesome combat divisions before they retreated obediently. By not impeding Shi Xueman and her counterparts, these combat divisions were already helping them.</p><br/><p>There was a huge number of such combat divisions. There were different types of people from various cities, and they were unruly. Shi Xueman and her counterparts couldn’t kill them. It was better that they retreated now.</p><br/><p>Even though everyone knew the strategy of the blood elementalists, they could not come up with a solution for the time being.</p><br/><p>\"Can we open up a passage for these combat divisions to retreat through?\" Karakorum Polaris asked.</p><br/><p>Everyone shook their heads. To establish a defensive line, they purposely chose narrow terrain that was easy to guard and hard to attack. On the two flanks of this locations, there was a canyon of unfathomable depth. Violent metal winds blew within this canyons all year round. This location was the famous Windy Pearl Bridges. The canyon was very long, and the surging metal winds formed a barrier that was very difficult to pass. Above the canyon, there were more than 10 naturally-formed stone arches that were not affected by the metal winds. </p><br/><p>This location was called Windy Pearl Bridges because the natural stone bridges were covered with long and narrow cracks, resembling pearl necklaces.</p><br/><p>The width of each stone bridge was different. The narrowest was only a few hundred meters wide while the widest one was a few kilometers wide.</p><br/><p>To reduce the area they had to defend, Silver Soldier purposely used a God-subduing Peak to destroy the other windy bridges and left only the most suitable bridge for them to defend.</p><br/><p>Their defensive plan was built around this Windy Pearl Bridge.</p><br/><p>The canyon was approximately 500 kilometers long. If the enemy didn’t attack through the remaining bridge, they would have to make one very large detour through arduous terrain in order to advance. If it was a typical situation, Shi Xueman and the rest would be worried that the blood elementalists would take the the detour and attack them from their rear. However, the blood elementalists were eager to seek revenge. Therefore, Shi Xueman and the rest felt that the blood elementalists would try to attack through the Windy Pearl Bridge by force.</p><br/><p>Thus, they felt this place was most suitable for defending.</p><br/><p>As they had expected, the enemy forces chose to forcefully attack and advance toward the Windy Pearl Bridge. However, they had not expected the blood elementalists to use the weaker elementalist divisions as a tactic to attack them.</p><br/><p>\"It’s highly likely that the enemy forces will stick close to the retreating forces and use them as cover to get close to us. This way, our offense will be restricted,\" Shi Xueman muttered.</p><br/><p>\"We can only strengthen our defensive line for the time being.\" Silver Soldier could not think of a better solution. When he saw the discouraged looks on everyone’s faces and felt that the atmosphere had become tense, he changed the topic and asked, \"Ai Hui should be arriving soon, right?\"</p><br/><p>Even though Shi Xueman tried her best to restrain her emotions, she still displayed the excitement of a young girl while replying to Silver Soldier, \"Yes, he should be arriving soon.\"</p><br/><p>\"Ai Hui will definitely have a solution!\" Sang Zhijun said.</p><br/><p>When Silver Soldier swept his gaze across everyone, he surprisingly discovered that all of their faces had relaxed.</p><br/><p>It was as if they had a type of… absolute confidence in Ai Hui.</p><br/><p>He suddenly looked forward to Ai Hui’s arrival.</p><br/><p>…..</p><br/><p>\"Just a while longer before we reach the front line.\"</p><br/><p>Qiao Meiqi was very excited. He had placed all his material goods and family members on the Fish Bone. After discarding all his worries, he looked as if he had been reborn and appeared much younger.</p><br/><p>\"Fish Bone\" was the name given by Ai Hui to the floating landmass comprised of Blackfish Mouth Volcano and the Central Pine Valley. The shape of Blackfish Mouth Volcano looked like a leaping black fish with the top-half of its body out of the water. In order to make it fly, Ai Hui had to shave off the outer layer of the volcano, making it skinnier than before. Therefore, Ai Hui renamed it Fish Bone.</p><br/><p>As usual, everyone disdained this name. Let’s look at the name \"God-subduing Peak.\" So domineering! The size of Blackfish Mouth Volcano was much bigger and mightier than any God-subduing Peak, yet its name was so ordinary. Ai Hui should have given it a better name!</p><br/><p>However, Ai Hui had not done so.</p><br/><p>After they set off, they had not stopped to take a single break. They did not try to cover their tracks either. They swaggered in the direction of the Spear of Heavy Cloud’s camp.</p><br/><p>The journey was so smooth that it seemed as if they weren’t in times of chaos.</p><br/><p>\"How come no one asks about us?\"</p><br/><p>\"That’s true, our big black fish is so impressive! How can there be no reactions toward it? No one even bothers to record an image of it.\"</p><br/><p>\"It’s too weird.\"</p><br/><p>When Huo Da heard the members’ mutters, he was slightly amused by them. The members of the Sword of Lightning were basically youngsters who were filled with passion and ambition. Even Huo Da felt very happy being around them.</p><br/><p>Quickly, Huo Da regained his concentration and humbly asked for guidance from Shi Zhiguang, who was training by himself on one side. \"Zhiguang, I still don’t quite understand this embroidery technique.\"</p><br/><p>Shi Zhiguang stopped what he was doing and replied, \"Ahh, reversal embroidery technique. This is quite difficult. The key is to create a reversal and move side by side along with it…\"</p><br/><p>He provided a voluminous answer and did not hide anything from Huo Da. Meanwhile, Huo Da listened to Shi Zhiguang attentively and nodded his head every now and then.</p><br/><p>Initially, when Huo Da came to ask Shi Zhiguang for guidance, the latter was slightly nervous. After all, Huo Da was a Master. When a Master came and asked him for guidance, he felt insecure. However, as they became more familiar with each other, Shi Zhiguang gradually loosened up. Subsequently, Shi Zhiguang fell in love with providing explanations to Huo Da. This was because he realized that when he was explaining to Huo Da, some of his thought processes became clearer.</p><br/><p>It was unknown whether or not the skills of operating the Pinwheel Sword were related to embroidery. Shi Zhiguang was very talented in embroidery and progressed at lightning speed.</p><br/><p>Sometimes, even Ai Hui was surprised. In the future, if Shi Zhiguang no longer wanted to be a sword operator, he could open an embroidery workshop with his embroidery skills.</p><br/><p>In the past, everyone teased Shi Zhiguang about embroidery and called him Embroidery Lady Shi. However, when they saw that Huo Da was also addicted to embroidery, they did not dare to mock Shi Zhiguang anymore. Huo Da was a Master and highly revered. Hence, Shi Zhiguang’s image improved significantly in everyone’s eyes.</p><br/><p>Shi Zhiguang did not feel pleased with himself because of this.</p><br/><p>Master Huo might seek guidance from him, but it was because of this that he understood the might of a Master. Even though Huo Da had just started learning both embroidery and how to operate the Pinwheel Sword, he did not look like a newbie at all. Shi Zhiguang merely mentioned some complicated moves and Huo Da was able to execute them on the spot.</p><br/><p>During the previous battle, they had killed a few Masters. All of them felt unconcerned about Masters.</p><br/><p>What was so great about a Master? Those Masters were still killed by a single sword move!</p><br/><p>Initially, Shi Zhiguang thought like the others. However, after getting to know Huo Da, he felt just how ridiculous the rest of the division members were. They might not have heard of Huo Da’s name, but he was still a Master after all. A Master would always be a terrifying entity.</p><br/><p>A Master’s understanding and control of elemental energy was on a completely different level from theirs.</p><br/><p>Huo Da had a different perspective from them. In this place, he had experienced many brand-new things. The thing that shocked him the most was the Sword of Lightning’s battle tactics, which completely defied the traditional elemental energy channelling technique.</p><br/><p>He wished he to be able to soon operate the Pinwheel Sword. It was a pity that there was only one Pinwheel Sword. They would arrive at the battlefield shortly, and Shi Zhiguang had been training with everyone else. Huo Da had not found a sparring partner yet.</p><br/><p>Meanwhile, Ai Hui sat on a boulder and looked at the glowing Duanmu Huanghun in the bamboo forest nearby.</p><br/><p>Duanmu Huanghun had yet to wake up, and Ai Hui was feeling slightly worried for him. However, after taking a closer look and realizing that Duanmu Huanghun’s breathing and elemental energy undulations were very stable, he felt significantly relieved. </p><br/><p>Lou Lan ran over and yelled cheerfully, \"Ai Hui, we are entering the front line zone and are going to see Xueman soon!\"</p><br/><p>\"Wow, that was fast,\" Ai Hui said as he stood up. \"Lou Lan, let’s go up to the mountain.\"</p><br/><p>Ai Hui and Lou Lan went up to the mountain peak and gazed into the distance.</p><br/><p>Evening soon descended. The color of the setting sun resembled blood, causing the vast earth to be bathed in a bright red luster. The trees looked as if they had been dyed with the color of blood. The wind became stronger and colder, seemingly bringing forth the sound of war from the distant horizon.</p><br/><p>The vast earth was filled with desolation. White bones could be seen scattered throughout the grass and thickets.</p><br/><p>The joy of seeing Iron Lady instantly and unknowingly disappeared.</p><br/><p>When he returned to his senses, he realized that all the division members had gathered behind him.</p><br/><p>He turned around, looked at his soldiers, and yelled, \"Assemble!\"</p><br/><p>Swoosh.</p><br/><p>Everyone looked as if they had woken up from a dream and quickly stood neat and orderly in front of Ai Hui.</p><br/><p>Ai Hui glanced at Huo Da, who stood to one side. Like the other members of the Sword of Lightning, he stood upright and at attention.Ai Hui was surprised. He had not expected the position of sword operator to be such a strong enticement for Huo Da.</p><br/><p>Ai Hui withdrew his emotions and said, \"From today onward, we will be entering the front line zone. I declare that the Sword of Lightning is entering standby mode now.\"</p><br/><p>The glow of the sunset shone on the youthful faces of the division members. Their young and tender faces exuded hope and ambition, completely devoid of fear. The Sword of Lightning’s members had been waiting for this day to come. They were like a bunch of hungry tigers that were finally allowed to enter the battlefield.</p><br/><p>Unfortunately, Ai Hui knew that the Sword of Lightning was more likely to become prey than predator when it set foot upon the battlefield.</p><br/><p>This was war.</p><br/><p>Ai Hui felt disheartened instead of hopeful or ambitious. If it weren’t for the circumstances, he definitely would not have wanted to go to the front line. At least not so soon. Now that he brought his men to the front line, how many of them would actually survive? He did not know the answer to this question. He did not even know whether or not he, himself, would survive.</p><br/><p>Simultaneously, he also did not feel any fear.</p><br/><p>When he thought of the fact that he would shortly be battling the blood elementalists, he felt an eagerness as well. He had never forgotten the blood that Central Pine City had bled. He had never forgotten the vengeance he needed to seek for his master and mistress.</p><br/><p>The depression and the eagerness were two completely different emotions. They intertwined in his heart, causing him to fall silent.</p><br/><p>The members looked at Ai Hui, seldom looking at him like this.</p><br/><p>After thinking about it, Ai Hui said, \"We are going to reach the battlefield soon. The enemy forces are very strong, much stronger than us. Everyone will face death at any time. I can’t promise that I will lead all of you out of the battlefield alive, but I can promise that I will definitely not forsake you and run away by myself.\"</p><br/><p>The members quieted down. The hope and ambition displayed on their faces had disappeared and were replaced by solemnity.</p><br/><p>Ai Hui took in a deep breath of air and said with a serious tone, \"Listen to my commands! Everyone, board the Pinwheel Sword now! Sword of Lightning, prepare to set off for a patrol mission!\"</p><br/><p>\"Yes!\" everyone replied in unison.</p><br/><p>The neat and orderly members of the Sword of Lightning scattered in an instant as they boarded the Pinwheel Sword from all directions.</p><br/><p>The five-colored pinwheel at the back of the Pinwheel Sword began to spin.</p><br/>\n</div>"}