{"title": "Chapter 576: Lightning Razor", "id": 576, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-576-lightning-razor", "volume_title": "Volume 6", "body": "<h1>Chapter 576: Lightning Razor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 576: Lightning Razor</p><br/><p>Translator: Irene Editor: TYZ, KLKL</p><br/><p>Majestic, has swagger, pragmatic.</p><br/><p>At the start, Ai Hui passed them off as a group from Skyheart City, but his sword ray was quickly seen through by everyone. After all other than Sky Edge Division, where Karakorum Polaris was, only Ai Hui’s Sword of Lightning could execute such a powerful sword ray.</p><br/><p>So Ai Hui might as well do it openly.</p><br/><p>While Fishbone didn’t fly very fast, it could cover an extremely wide scope and few combat divisions would be able to escape its radar.</p><br/><p>Qiao Meiqi took the front position. He was a businessman and good at dealing with people. When he engaged in extortion and blackmail he could also quickly grasp the secrets among them.</p><br/><p>\"Safety’s the most important. Everyone must be united! See, what’s your division plan? To supply man, or power?\"</p><br/><p>\"Don’t worry, this isn’t embezzlement. Where did it go? Did you swallow it into your stomach?\"</p><br/><p>\"Elders Guild will remember everybody’s contributions!\"</p><br/><p>\"That isn’t much, brother. Look, we’ve already worked so hard and you’re giving us so little. Are you trying to chase beggars away? Do you want us to take action?\"</p><br/><p>...</p><br/><p>When finally exiting the battle region, everyone in Yellow Sand Division cried tears of joy upon seeing the closest city after their long and difficult trek. And the citizens who saw these shabby, skinny as bones and haggard looking division members were astonished.</p><br/><p>The reporters who came upon hearing the news immediately filled the city up.</p><br/><p>Combat divisions arrived one after another and all the soldiers were like beggars, having no money for even a meal.</p><br/><p>For a while, Sword of Lightning became notorious for its evilness.</p><br/><p>Ai Hui had, too, become the most well-known villain and bandit, an abrupt change in terms of people’s impressions of him. Mirage bean pods containing all kinds of criticisms and condemnation flooded every shop.</p><br/><p>\"Denouncing blood and tears, lawless lands under heaven – Death of Yellow Sand Division’s leader, Hei Yan!\"</p><br/><p>\"How did the formula for God-subduing Peak fall into the hands of this villain? Skyheart City in collusion with Central Pine Valley?\"</p><br/><p>\"Yet another combat division stopped. Innumerable crimes by the Lightning Razor !\"</p><br/><p>...</p><br/><p>Ai Hui’s conduct had exceeded people’s imaginations and was absurd to them. The name \"Lightning Razor\" spread like wildfire and left a deep impression on people as they immediately caught onto it. Even Newlight City, which had just formed an alliance with Central Pine Valley, was now involved and people were running to An Chouchou to protest.</p><br/><p>The mirage bean pod left An Chouchou dumbstruck. He felt as though his heart had been trampled on by thousands of galloping horses.</p><br/><p>\"Has this fellow gone mad?\" he muttered repeatedly, and the responses he received from people around him carried the same disbelief.</p><br/><p>…..</p><br/><p>Skyheart City.</p><br/><p>\"... this is vile and damnable! I’ve never heard of a deed so preposterous and nasty. Not even in the whole of the Avalon of Five Elements’ history! This is a shame to Avalon of Five Elements, a disgrace to us elementalists! Ai Hui is despicable. Through and through a liar, scoundrel, gangster, hoodlum, bandit…\"</p><br/><p>An impassioned division leader who’d survived shouted himself hoarse in a meeting hall.</p><br/><p>When he was done, Madam Ye nodded with an indifferent expression. \"Got it.\"</p><br/><p>The division leader was stunned and fell into a long daze. He had come so far to make a complaint against Ai Hui’s crime and all he received was a \"got it\"?</p><br/><p>Before he could speak, two guards grabbed onto him on both sides and pushed him out of the hall.</p><br/><p>The other officials looked at each other in dismay. They did not know what Madam Ye was thinking. Wasn’t she full of hatred toward Ai Hui?</p><br/><p>With a gentle laugh Madam Ye said, \"Ai Hui’s giving it his all. Initially I didn’t think much of this battle, but it seems like things are getting interesting. This fellow has his ways and has foresight. He doesn’t stick to a pattern. He’s stronger than Shi Xueman and Silver Soldier. It really is surprising how that inflexible old man, Wang Shouchuan, could produce such a powerful disciple.\"</p><br/><p>No one else dared to speak.</p><br/><p>Madam Ye’s expression turned stern. \"In the name of Elders Guild, appoint Ai Hui as the head commander of the front line. He will have the authority to conscript individuals and all divisions must co-operate.\"</p><br/><p>No one could believe their ears.</p><br/><p>Someone anxiously advised, \"Resentment is surging…\"</p><br/><p>\"Shut it!\" Madam Ye berated coldly. She stood up from her seat and swept her gaze across the room. \"Short-sighted fools! Our priority now is to guard the defensive line! Don’t talk about cutting off the supplies to these people. If killing all those idiots is what it takes to keep Ai Hui guarding the front line, why not!\"</p><br/><p>Everyone was stunned and kept quiet out of fear.</p><br/><p>She turned to Nian Tingfeng. \"Go mediate the situation. Keep the public under control. I don’t wish for anyone to be a drag at this point.\"</p><br/><p>\"Yes,\" replied Nian Tingfeng respectfully.</p><br/><p>Madam Ye then asked casually, \"How’s the Wind Mail City matter coming along?\"</p><br/><p>Nian Tingfeng shuddered, clenching his teeth. \"Openly disobeyed an order and is to be beheaded on the spot according to military discipline.\"</p><br/><p>\"Don’t kill as you please, we’re not Ai Hui. He’s pretty capable, would be a waste to behead him.\" She said in a light voice, \"The front line lacks good players now. Let him go. Heard there are some members from Surveillance asking to be drafted? Loyal and brave. Send them all.\"</p><br/><p>Nian Tingfeng bent his head. \"Yes. It is their duty to stay loyal to Elders Guild.\"</p><br/><p>Madam Ye responded amiably, \"Sometimes, you can’t expect everyone to understand you. Some will, but some won’t. If you need to cut them off, what’s there to wait for? Look at Ai Hui. He has a small team, little power, an insignificant name, but when he starts working up a storm he does it well. Why? He is not restricted by conventions and regulations. He just wants to win. Does he care about criticism from the masses? Not at all.\"</p><br/><p>Nian Tingfeng replied respectfully, \"You’re right, Madam.\"</p><br/><p>Madam Ye sighed. \"One must have a steady heart to accomplish things. How else would you get things done? Unable to make demands, but also unable to blindly connive. I’ve seen the hard work you have been putting in these few years and I will not forget.\"</p><br/><p>Nian Tingfeng shed tears of gratitude. \"They might not be able to understand your efforts, but having followed you around everyday, I know how much you’ve done for Elders Guild! I’ll tidy up Surveillance properly when I get back.\"</p><br/><p>…..</p><br/><p>Infantry Division.</p><br/><p>\"This fellow is really reckless, absolutely unrestrained,\"said Karakorum Polaris in amazement.</p><br/><p>Silver Soldier seemed to be forcing a smile as he shook his head. \"I also have no idea what he’s been through in these past years for him to become so extreme. I heard that people outside are calling him Lightning Razor, a name that will probably stick for quite some time.\"</p><br/><p>Karakorum Polaris could hear the concern and worry in her senior’s tone.</p><br/><p>Silver Soldier just shook his head and smiled. \"Forget it, we’ll talk when this is over.\"</p><br/><p>A sigh followed, then he said, \"Spear of Heavy Cloud’s formed its own system, there’s no need for us to worry about them. These last few days I’ve been thinking about our cooperative battle tactics and how everyone can train together.\"</p><br/><p>Karakorum Polaris responded simply, \"Okay.\"</p><br/><p>Her clear voice carried a tinge of happiness. Being able to train with her senior made her happy.</p><br/><p>Spear of Heavy Cloud’s encampment door was shut tight, its security strict.</p><br/><p>All the combat division leaders stood outside the entrance.</p><br/><p>\"Encampment still closed today? Does she not care? Ai Hui’s gone berserk, how disappointing!\"</p><br/><p>\"Care? How could she? Ai Hui’s always been the boss of Central Pine Faction, so even division leader Shi has to listen to him.\"</p><br/><p>\"Hush, quieten down. You dare talk bad about him here, are you tired of living? Two days back a fellow was grumbling a little, talking bad about Razor Ai, and got his legs broken by leader Shi.\"</p><br/><p>\"Is that true? Why so ruthless?\"</p><br/><p>\"Aye, I also don’t think she can control him. Just give me some discount points and I’ll hand over half!\"</p><br/><p>\"Half? Stop dreaming! ‘Razor’ Ai. Do you know what a razor is? He’s not going to give you even a strand of hair.\"</p><br/><p>Shortly after, the door opened.</p><br/><p>Sang Zhijun walked out and said coldly, \"Our leader has given orders. Craftmen who hand over seventy percent of supplies on their own accord will be registered and can get one Spear of Heavy Cloud battle flag to ensure a smooth and safe journey back. Those who are dishonest and fraudulent will be punished for concealing military intelligence. Informers will be rewarded with half the earnings!\"</p><br/><p>A clamor broke out. Concealing intelligence meant instant beheading according to military law. The fact that snitches would be rewarded sent a chill down the spines of those who were interest-driven. The surrounding faces immediately turned grave.</p><br/><p>Even more people started yelling.</p><br/><p>\"Seventy percent! How demanding!\"</p><br/><p>\"Exactly! Fifty! Fifty percent at most!\"</p><br/><p>\"Give us a way out, Leader Shi. We have elderly and young children.\"</p><br/><p>Sang Zhijun remained expressionless. She said coldly, \"Those who stay to fight with us will not need to hand anything over and we will return the supplies.\"</p><br/><p>Everyone shut up immediately.</p><br/><p>Some time later someone spoke up, albeit weakly, \"But seventy percent is simply too harsh.\"</p><br/><p>\"Yeah it is.\"</p><br/><p>Sang Zhijun couldn’t be bothered arguing. \"Go tell Boss Ai Hui yourselves.\"</p><br/><p>Hearing Ai Hui’s name made their hearts jump.</p><br/><p>Someone clenched his teeth, shouting, \"I’ll hand it over! But is the flag really useful?\"</p><br/><p>Sang Zhijun answered, \"Our leader has already written a letter about the situation, to Ai Hui. Those who hand over the supplies are considered as contributors who are feeding the front line. As for the effectiveness of the flag, try and you’ll know. But note that Ai Hui has a fiery temper and it wouldn’t be as easy talking to him.\"</p><br/><p>The audience looked at each other in dismay.</p><br/><p>\"I’ve been admiring Leader Shi for a long time now. It’s only natural that we offer a little something!\"</p><br/><p>\"That’ right! She’s Beyond Avalon’s tower of strength. With our supplies in her hands there’s nothing for us to worry about.\"</p><br/><p>Sang Zhijun kept a cool face and instructed the military materials official to start taking inventory and names.</p><br/><p>Returning to the camping ground, Sang Zhijun plopped onto the chair. Having a mental breakdown she cried out, \"Don’t make me do something like this again, oh my god. I’ve never said anything so shamelessly and self-righteously before. I almost couldn’t go on.\"</p><br/><p>Without even raising her head Shi Xueman responded, \"Now you know how heartless that guy is.\"</p><br/><p>Somewhat puzzled Sang Zhijun asked, \"Why are we doing this?\"</p><br/><p>\"Time.\" Shi Xueman continued staring at the map. \"We must make full use of our time. It takes time to cast the pagoda cannons and practicing how to use it takes time too. Getting them to hand over the supplies themselves would save us a lot of time.\"</p><br/><p>\"Ai Hui’s heart must be aching. Such a huge loss.\"</p><br/><p>Shi Xueman replied indifferently, \"I’m the creditor anyway.\"</p><br/>\n</div>"}