{"title": "Chapter 581: The Bloody Battle At The God Encampment (3)", "id": 581, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-581-the-bloody-battle-at-the-god-encampment-3", "volume_title": "Volume 6", "body": "<h1>Chapter 581: The Bloody Battle At The God Encampment (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 581: The Bloody Battle At The God Encampment (3)</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>Before today, He Nanshan was confident that he could defeat any combat division from Beyond Avalon. General Ye had clearly explained to them the characteristics and weaknesses of every combat division from Beyond Avalon. Their daily training sessions were focused on dealing with elementalist combat divisions.</p><br/><p>It wasn’t a fluke for the god divisions and blood divisions to win so many battles in a row. Other than the physical superiority that blood elementalists had over elementalists, the appropriate adjustments and optimizations made by the god and blood divisions also made them stronger. On the contrary, elementalist combat divisions did not have any substantial improvements and were still stuck with their traditional battle tactics and stratagems.</p><br/><p>The only so-called progress they had made was the Spear of Heavy Cloud’s pagoda cannon technology.</p><br/><p>Due to this \"progress,\" the Spear of Heavy Cloud Division was the only elementalist combat division that could win battles against blood elementalist combat divisions.</p><br/><p>The tidal wave of a new era always came silently and without any signs, but in reality, no one could avoid being swept away by it. Those who were sharp would either search for a high mountain and live a life free of worries or drift with the tide and follow the crowd blindly. Those who were stubborn would struggle and drown, eventually disappearing into the depths of the sea.</p><br/><p>He Nanshan strongly believed that the blood elementalists were on the right track. He had absolute confidence in dealing with elementalist combat divisions.</p><br/><p>However, when he faced the terrifying Dread Division, his confidence wavered.</p><br/><p>This was especially the case when Wan Shenwei led the Dread Division into the heavens and surged toward him. He felt as though a mountain was flying toward him and would crush him to smithereens. The terrifying might caused the air around He Nanshan to freeze.</p><br/><p>As the division leader of a god division, He Nanshan did not lack strength and courage. Even though he was intimidated by the might of Wan Shenwei and the Dread Division, he was able to regain his composure quickly.</p><br/><p>He extended his right palm as his eyes suddenly lit up with a faint red glow. Beneath him, the blood elementalists who had remained motionless all this time immediately erupted with a bloody glow. Following which, their bodies projected streaks of bloody glow.</p><br/><p>The faint red glow in He Nanshan’s eyes spun like a whirlpool.</p><br/><p>The air around him became distorted abruptly, resembling an inflating air bubble.</p><br/><p>The slash attack of the Dread Division landed on the air bubble like a heavy hammer, shattered it, and struck He Nanshan heavily. The attack’s momentum carried it all the way to the blood elementalists beneath He Nanshan.</p><br/><p>Boom!</p><br/><p>An earth-shaking impact caused the soil to fly up more than 30 meters into the air like a fountain.</p><br/><p>Wan Shenwei furrowed his eyebrows slightly and let out a soft gasp of surprise. He felt that the slash attack had not hit the right spot. Even though the scene of soil flying up into the air was spectacular, there seemed to be something wrong with it.</p><br/><p>Subsequently, the soil fell from the sky like raindrops. Other than a horrifyingly deep trench, there weren’t any corpses on the ground.</p><br/><p>Torrential attacks subsequently flew at Wan Shenwei and the Dread Division from all directions.</p><br/><p>Wan Shenwei looked as if he expected to be attacked. Without any hesitation, he led his soldiers and charged forward. The storm of attacks from the blood elementalists missed their targets. Even though the continuous slash attacks from the Dread Division had produced remarkable results, Wan Shenwei did not indulge in the pleasure of massacring the enemy forces. Even though his actions looked rash, his mind was unusually calm. Having been through countless battles, he was able to maintain his rationality and composure in any situation.</p><br/><p>He had not forgotten the original plan.</p><br/><p>He did not care about killing He Nanshan or investigating the odd-looking bubble. Along with the Dread Division, he charged and killed his way toward the central camp like an invincible sword.</p><br/><p>In an unremarkable corner of the camp, an enormous blood bubble suddenly rose from a blood pool. Following which, the blood bubble popped and revealed He Nanshan and his subordinates.</p><br/><p>A fearful look appeared on all of their faces at the same time. Even though they managed to escape, they felt as if they had just taken a trip to the gates of hell when they were locked on by the Dread Division.</p><br/><p>He Nanshan heaved a sigh of relief. They had narrowly escaped.</p><br/><p>The Dread Division was unimaginably powerful.</p><br/><p>The confidence he had in the God Spirit Division was derived not only from the usual training sessions, but from the unique structure of the God Spirit Division as well. Among the six god divisions, there were two that were slightly special. One was the God Spirit Division, while the other was the God Shaman Division.</p><br/><p>A god elementalist’s training emphasized an individual’s body constitution and innate skills more so than an elementalist’s. A person’s potential for success could be determined at the start of his or her training. Among god elementalists, there were many god guards. Compared to the number of god guards, there were much fewer god shamans. The rarest type of god elementalist was the god priest.</p><br/><p>Therefore, in the God Nation, god priests had the highest status, followed by god shamans. God guards had the lowest status.</p><br/><p>He Nanshan was a god priest. His personal escorts were the famous \"Lesser Nanshans.\" The Lesser Nanshans were the only unit in the God Nation that was entirely made up of god priests.</p><br/><p>When he saw the Dread Division charge toward the central camp, he felt happy instead of fearful.</p><br/><p>The central camp was of the utmost importance and would always be the first target of the enemy forces. Therefore, he had set up a huge number of defensive arrangements around the central camp. There were layers of protection and countless traps set up around it, making it impregnable.</p><br/><p>The Dread Division was really too powerful. However, they wouldn’t last long. The constant depletion of their strength would cause them to reveal their weaknesses.</p><br/><p>God priests were not meant to be sacrificed.</p><br/><p>He and the surrounding god priests descended into the blood pool and disappeared.</p><br/><p>The entire encampment was like a surging sea of blood. Roars resounded everywhere. Some contained insanity, some contained hysteria, and some contained resentment, but all of them contained zeal. Some faces were sinisters, some were solemn, and some were cold, but none of them were without fear. The splattering blood and the flares from explosions were equally dazzling. No one avoided the collisions between the gorgeous elemental energy glows and the demonic bloody glows.</p><br/><p>One by one, the blood elementalists fell like reaped wheat.</p><br/><p>Ximen Caijue’s childlike face was cold and emotionless. She pulled and released the bowstring of her small bow with lightning speed.</p><br/><p>No one could see her movements clearly.</p><br/><p>An arrow surrounded by a green glow flew through the densely-packed blood elementalists and appeared at the side of a god priest’s forehead.</p><br/><p>Pop!</p><br/><p>The god priest’s head exploded like a shattered watermelon. The blood elementalists around him were stunned. Following which, they frantically looked for the sniper who had assassinated the god priest.</p><br/><p>Ximen Caijue had long since disappeared from the scene.</p><br/><p>She was like a swift-moving wisp of mist. No one could track her down. The toy-like bow in her hand was like Death itself. It specifically targeted enemy commanders, blood elementalists with an Ability of God, and god priests. Until now, the number of enemy commanders and blood elementalists with an Ability of God who she had slain totaled more than 20 people.</p><br/><p>When an unit of blood elementalists lost their unit leader, their formation would fall into disarray. Even though they still possessed a numerical advantage, the threat they posed was reduced significantly. Blood elementalists with an Ability of God had immense destructive powers, especially when ordinary soldiers were helping them. The most sinister blood elementalists were the seemingly delicate god priests. They were hidden among the crowd, making it very difficult to spot them. Their sudden psychic attacks would cause her soldiers misjudge and make tactical errors. In such an intense battle, where they were severely outnumbered by the enemy forces, tactical errors were enough to cost them their lives.</p><br/><p>Ximen Caijue’s killing efficiency was terrifying, greatly affecting the enemy forces’ operations. Even so, the soldiers of the Judgement Division continued to die one by one. The enemy had far too many men.</p><br/><p>Ximen Caijue’s face was ice-cold. The Judgement Division had never suffered such heavy casualties before, but she wasn’t blinded by anger or grief. They had not invaded the enemy encampment with great difficulty just to commit murder and arson here.</p><br/><p>With her peerless speed and skills, she wasn’t at all worried about being targeted by the enemy forces.</p><br/><p>Soaring high in the sky, she clearly oversaw the entire battlefield.</p><br/><p>The Dread Division was piercing through the enemy forces like an invincible sword while the Judgement Division protected the flanks like \"wings.\" With their flanks protected, the Dread Division was able to push forward with all its might.</p><br/><p>The elementalist who was in charge of protecting the Dread Division’s left flank was an elemental Master who dual-wielded swords. He was like a high-speed spinning top that destroyed everything in its path.</p><br/><p>Meanwhile, the elementalist protecting the Dread Division’s right flank was surrounded by light streaks. The light streaks moved so fast that they blurred. They resembled a school of nimble-moving fish that swam around the elementalist. Every now and then, a light streak would shoot out and someone from the enemy forces would collapse to the ground. These people could only see the blurry tail of a light streak before they died.</p><br/><p>Ring pommel saber, glabella saber, and iron saber were the three sabers of the Judgement Division.</p><br/><p>Looking down from the sky, she could see that the blood elementalists continued to gather in front of the Dread Division. There were also many places illuminated by a faint bloody glow. Nothing could escape Ximen Caijue’s sharp eyes. Was it a trap? However, when Ximen Caijue recalled that the enemy leader had hidden himself, her lips curled into a sneer.</p><br/><p>Suddenly, she disappeared.</p><br/><p>The streaks of bloody glow flitted across the position where she had previously been and missed their target.</p><br/><p>The next moment, Ximen Caijue’s high-pitched and cold voice suddenly rang out in the sky above the Judgement Division, \"Judgement, [Aerial Seal]!\"</p><br/><p>The Judgement Division soldiers heard Ximen Caijue’s order and roared in unison, \"Judgement, [Aerial Seal].\"</p><br/><p>Following which, a spectacular scene appeared on the battlefield.</p><br/><p>Countless light beams rose into the air from the left and right sides of the Judgement Division and arced toward the sky above the Dread Division. In a flash, a sharp whistle engulfed the battlefield.</p><br/><p>Hiding in one corner of the encampment, a feeling of extreme danger rose in He Nanshan’s heart. However, it was now too late for him to react.</p><br/><p>A petite figure suddenly appeared at the rear of the Judgement Division.</p><br/><p>Twang! Twang! Twang!</p><br/><p>The sound of a bowstring being pulled and loosed echoed throughout the encampment.</p><br/><p>Three green arrows pierced through the countless light beams in the sky. The chaotic light beams suddenly gave off a buzz before forming an enormous disk. Within the disk, there were complicated-looking veins. The disk, which resembled a gigantic seal that was carved with utmost care, landed on the densely-packed blood elementalists in front of the Dread Division.</p><br/><p>At this moment, time seemed to freeze.</p><br/><p>Then, intertwining cracks appeared on the bodies of the blood elementalists within the glimmering seal.</p><br/><p>Pffff!</p><br/><p>There was a very soft sound of blood spurting, yet an extremely horrifying and gory scene unfolded before everyone’s eyes. Blood fountained out of the cracks on the blood elementalists’ bodies like a water jet. The few thousand people in the glimmering seal were dismembered piecemeal by the razor-sharp elemental energy.</p><br/><p>Like statues that had been sundered, the body parts of those few thousand people fell to the ground as a lake of blood began to pool.</p><br/><p>This scene, reminiscent of the river Acheron, rendered the surrounding blood elementalists dumbstruck. A momentary dead silence swept across the enormous encampment. The blood elementalists had been through countless battles, but had never seen such a gory, frightening, and hellish scene before.</p><br/><p>The Dread Division seized this opportunity and advanced a few hundred meters.</p><br/><p>They were getting closer to the central camp!</p><br/><p>He Nanshan was stunned. However, his mind jolted, and he quickly yelled, \"Protect the camp! Stop them!\"</p><br/><p>Currently, he no longer wanted to withhold the fact that his plan had been completely foiled by the Dread Division’s earth-shaking offensive. Could he hold back the Dread Division? He was not sure and did not dare to think about it. All he could do was keep on sending soldiers to stop them.</p><br/><p>Ximen Caijue locked onto He Nanshan. However, she had expended too much energy to execute the [Aerial Seal] just now. Furthermore, He Nanshan was heavily guarded as well. Her gaze shifted to the battlefield. The [Aerial Seal] had not only expended a huge amount of her energy, it had also caused the Judgement Division to suffer heavy losses. In the blink of an eye, more than 10 soldiers had been sacrificed.</p><br/><p>Ximen Caijue remained calm. The merciful couldn’t take command of an army. Deaths were bound to happen on the battlefield. Furthermore, this mission was supposed to be perilous. Dying was considered normal while surviving was considered fortunate.</p><br/><p>A good leader, however, had to make sure the sacrifices were meaningful.</p><br/><p>When she saw that the blood elementalists who had surrounded the central camp were now surging toward the Dread Division like a tsunami, her eyes lit up.</p><br/><p>She had accomplished her goal!</p><br/><p>After regaining some of her strength, she entered the battle again.</p><br/>\n</div>"}