{"title": "Chapter 598: Training During Real Battles", "id": 598, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-598-training-during-real-battles", "volume_title": "Volume 6", "body": "<h1>Chapter 598: Training During Real Battles</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 598: Training During Real Battles</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>In the sky in front of the God-subduing Peak, there were more than blood elementalists wearing Rust Plumes. They gathered and dispersed in an extremely nimble and random manner, looking as if they were cruising around the defensive line. However, if one did not pay attention to them, they would suddenly pierce through the defensive line from odd angles like sharp knives. When they were close to the defensive line, they would throw various weird weapons, such as rupture bombs that released blood poison smoke or blood arrows that possessed terrifying penetrative power.</p><br/><p>In the beginning, they caused the soldiers on the God-subduing Peak to panic. However, everyone soon got used to them and were now able to maintain their composure.</p><br/><p>Atop the God-subduing Peak, Fatty’s roars were like thunderclaps that exploded through the air every now and then.</p><br/><p>\"What are all of you shooting at?\"</p><br/><p>\"Li Kui, Ma Xiao, what is going on with your units? Why are you so weak?\"</p><br/><p>\"Bums! How many times have I told all of you: don’t panic, don’t be anxious, observe their rhythm, and don’t be deceived by their rhythm! Look at all of you! What are you shooting at? You have missed every single target!\"</p><br/><p>\"Unit C! Extra training! No food for any of you until you have finished this training!\"</p><br/><p>A wave of groans swept across the God-subduing Peak immediately. The members coming down from the pagoda cannons had an ashen look on their faces. Fatty did not care about them at all. He continued to bellow, \"Unit D, take up your positions! Wake up! Shoot properly!\"</p><br/><p>Unit D’s members looked as if they were about to face a formidable beast. Their facial expressions were tense. The previous three units were punished with extra training sessions, hence the pressure on Unit D was enormous.</p><br/><p>The captain of Unit D was Wu Feng. He was the fire elementalist who had almost burned to ashes in the fire reservoir at Lemon Camping Ground without uttering a word and went into a coma afterward. After Lou Lan treated him, he was able to recover promptly. However, horrible scars were left on his body. His left cheek was bright-red, resembling a ball of flames.</p><br/><p>Lou Lan told Wu Feng that he could help him remove the scars, but Wu Feng refused because he wanted to keep the scars to remind himself of his past every now and then.</p><br/><p>Among the fire elementalists in the Spear of Heavy Cloud, Wu Feng was one of the most hardworking ones. Even though he wasn’t gifted, he was extremely meticulous with the duties given to him. He had never disappointed anyone who gave him a task.</p><br/><p>After the pagoda cannon crews were handed over to Fatty, he quickly got into Fatty’s good graces. Eventually, he was promoted to the position of captain.</p><br/><p>After his promotion, he worked even harder. Whether it was his training sessions or his daily responsibilities, he would put in all his effort to carry them out without slacking off at all.</p><br/><p>Wu Feng had observed the previous three units during their combat mission and had developed some ideas. The previous units missed their targets because their skill level while operating the pagoda cannons was too low. Plus, the enemy units were elites. Although the enemies looked as if they were flying around aimlessly, they maintained a very precise distance between each other in reality. Their Rust Plumes were very nimble as well, making it difficult for the pagoda cannon gunners to predict their flight paths. As a result, the previous three units had missed their targets.</p><br/><p>Before taking up their positions, Wu Feng had already discussed with his members about what to do. In the end, they came with an idea that was not the best, but it all they could come up with. All of them would aim at a single target and engulf its potential escape directions with their shots.</p><br/><p>Even though this idea was somewhat foolish and inefficient, Wu Feng felt that it was a rather good one. They had also discussed the many small details regarding this idea. Now was the time for them to see if their idea worked or not.</p><br/><p>Wu Feng licked his lips and instructed his unit, \"All pagoda cannons, target the third from the left.\"</p><br/><p>Whirrr. All the pagoda cannons pointed at a single target in an instant.</p><br/><p> The target could sense that he was being targeted. He began to change his aerial direction repeatedly. His flight path was very weird and unpredictable.</p><br/><p>Wu Feng’s pagoda cannon started to move up and down accordingly. The rest of the pagoda cannon gunners could not see the target in the sky at all. All of them were just staring at Wu Feng’s pagoda cannon. They tried to make sure their pagoda cannons were pointing at the same direction as Wu Feng’s at all times.</p><br/><p>Snow lava poured into Wu Feng’s pagoda cannon, and the cannon barrel turned bright-red. However, he did not fire his pagoda cannon immediately. He realized there were two pagoda cannons which were not ready yet. The cannoneers for these two pagoda cannons were rookies who were not skilled enough.</p><br/><p>They couldn’t fire their pagoda cannons yet!</p><br/><p>If a pagoda cannon was filled with fire elemental energy, but was not fired, the pagoda cannon gunner for that pagoda cannon had to direct the fire elemental energy into his or her hands. Otherwise, the pagoda cannon would explode.</p><br/><p>Wu Feng’s face twitched, but he remained unconcerned. A red flush extended from his shoulders to the rest of his body, making him look like he was being boiled.</p><br/><p>He did not utter a single word or move his body at all.</p><br/><p>Fatty did not roars this time around. He stared at Wu Feng with an amazed look on his face. This fellow had high endurance! Previously, he promoted Wu Feng because he was cautious and conscientious. Fatty had not expected this fellow to have such outstanding endurance. This was a pleasant surprise for Fatty.</p><br/><p>The conventional training system for elementalists seldom focused on endurance. On the contrary, the new training system valued endurance a lot.</p><br/><p>Back in the day, Ai Hui used the sword pagodas to select swordsmen for his combat division because he wanted to test their endurance. The Pinwheel Sword had clearly shown that endurance was an important factor in the Pagoda Style combat system.</p><br/><p>After Fatty became a Master, his understanding toward endurance became deeper.</p><br/><p>Finally, the last two pagoda cannons were ready.</p><br/><p>Wu Feng roared, \"Fire!\"</p><br/><p>Boom!</p><br/><p>The six pagoda cannons thundered in unison. Six beams of light swiftly engulfed the target in the sky.</p><br/><p>The targeted blood elementalist had already sensed something wasn’t right and tried his best to dodge the incoming attacks. However, the incoming attacks covered such a wide radius, so how could he possibly dodge them all?</p><br/><p>A beam of light brushed past his left chest.</p><br/><p>The left side of his body disappeared, revealing charred flesh and internal organs. He lowered his head and looked blankly at his body. Following which, he let out a blood-curdling scream and fell from the sky.</p><br/><p>\"Good job! One more time!\" Fatty’s roar rang through the air.</p><br/><p>Wu Feng’s blood was racing. He replied loudly with excitement, \"Yes!\"</p><br/><p>Everyone was encouraged by the success of their first salvo, and they became more confident and adept when they fired their second one. Once again, they shot down another enemy.</p><br/><p>After seeing that two of their comrades were shot down in a row, the rest of the blood elementalists dispersed and escaped in a panic. A wave of cheers erupted from the God-subduing Peak.</p><br/><p>Fatty was very excited. His thunderous voice resounded through the air, \"Unit D, you will have twice the usual amount of elemental soup!\"</p><br/><p>Wu Feng and his unit let out an earth-shaking cheer while the other units looked at them with envy in their eyes.</p><br/><p>Next to Fatty, Zu Yan said in a low voice, \"There are two pagoda cannons that are more powerful than the rest.\"</p><br/><p>\"You realized it too?\" Fatty was slightly surprised.</p><br/><p>\"Yes, they have achieved elemental energy resonation, which caused their power to increase significantly.\" Zu Yan’s eyes brightened. \"However, only two pagoda cannons achieved elemental energy resonation. The others just barely failed to do so.\"</p><br/><p>\"How can we make sure they are completely synchronized? It’s already pretty good that two pagoda cannons resonated.\" Fatty looked slightly vexed.</p><br/><p>Elemental energy resonation could increase the power of pagoda cannons. Fatty was extremely interested in this discovery, but it was very difficult to achieve elemental energy resonation. To do so, he would need all the pagoda cannons to be completely synchronized. Wasn’t this logic the same as the principle behind the sword pagodas on the Pinwheel Sword?</p><br/><p>A look of realization flashed across Fatty’s face, but then he furrowed his eyebrows again.</p><br/><p>There were three factors as to why the seven sword pagodas on the Pinwheel Sword could be synchronized completely. First, the members wielded Unity Swords which could react to each other simultaneously. Second, the seven sword pagodas were built on the seven unique star positions. Third, the members simplified their sword moves and repeatedly trained these moves.</p><br/><p>Fatty and the pagoda cannon gunners could only achieve the third factor. They had no way of pulling off the other two factors.</p><br/><p>Seven cannon positions? Different elemental energies had different characteristics. The seven star positions were suitable for sword gleams and could combine seven swords into one. On the other hand, pagoda cannons used another type of elemental energy. The sword method might not work for pagoda cannons.</p><br/><p>\"I might have a solution,\" Zu Yan said hesitantly.</p><br/><p>\"You have a solution? You better not lie to me!\" Fatty looked at Zu Yan with a face full of doubt.</p><br/><p>\"If we want them to be synchronized, we need to have an unifying command system. My [Earth Fire Heavenly Spider Transformation] technique can set up a huge spider web of earth fire. As long as the pagoda cannons are set up on the nodes of the spiderweb, I should be able to transmit commands to them,\" Zu Yan replied to Fatty after thinking for a while.</p><br/><p>Fatty briefly froze before responding, \"That seems like it would work.\"</p><br/><p>\"Do you want to give it a try?\" Zu Yan asked.</p><br/><p>\"We have to give it a try! We have to give it a try!\" Fatty nodded his head repeatedly.</p><br/><p>Then, he continued, \"But we can’t try here. We have to try it behind the defense line.\"</p><br/><p>Zu Yan did not understand why Fatty did not want to try from their forward position..</p><br/><p>\"What if it succeeds? We can’t alert the enemies. We have to give them a surprise,\" Fatty said while chuckling.</p><br/><p>A look of realization dawned upon Zu Yan’s face.</p><br/><p>Atop the God-subduing Peak, at the highest point, Shi Xueman looked at the incensed Fatty and smiled.</p><br/><p>No one would expect this impatient and irascible fatty used to be a coward in the past. Nowadays, one could no longer see the old shadow of the original Fatty. As time passed and one experienced more things, he or she would keep on growing. Everyone grew old, but they went through different experiences. Due to these diverse experiences, they improved themselves differently and succeeded in variety of ways.</p><br/><p>\"Fatty said that since the enemies are trying get a feel for our defensive line, we might as well treat them as target practice. He has been commanding pagoda cannon units one after another to shoot at the enemies. There are many rookies, and it’s a good opportunity for them to experience the atmosphere of real combat,\" Jiang Wei said.</p><br/><p>\"Fatty is like that fellow and never wants to lose out on anything. They are like mosquitoes that will suck every ounce of your blood until you have dried up,\" Shi Xueman said.</p><br/><p>Sang Zhijun knew Shi Xueman was talking about Ai Hui and smiled. Besides her, Jiang Wei was smiling as well.</p><br/><p>Ever since Jiang Wei became a Master, he became more reserved and unfathomable, like an abyss.</p><br/><p>He continued, \"Helian Tianxiao does not seem anxious, he might be waiting for God Tiger Division forces and God Devil Division forces to arrive. Logically speaking, they should have arrived by now, but why have we not detected their presence?\"</p><br/><p>The rest did not know the answer either and came up with various speculations.</p><br/><p>\"Perhaps they encountered other enemies on the way here? No, that can’t be. After all, who is capable of hindering them?\"</p><br/><p>\"Perhaps they are lost?\"</p><br/><p>\"Or maybe they had a change of plan?\"</p><br/><p>\"Who knows? It’s better for them to come later! I think Grandpa Fatty’s idea of training during real battles is very effective. The enemies aren’t anxious and neither are we!\"</p><br/><p>\"Haha, that’s right.\"</p><br/><p>Everyone broke into a lively discussion, but they still could not come up with a proper conclusion.</p><br/><p>Before the God Wolf Division arrived, the atmosphere at the defensive line was very tense. Now that they were here, everyone threw their worries to the back of their minds and focused on the present battle instead. As such, the atmosphere had lightened up significantly.</p><br/><p>Shi Xueman also did not know what the enemies were up to. She muttered, \"We will wait and see.\"</p><br/><p>Suddenly, she asked Sang Zhijun, \"Isn’t today the day that the selection process for sword operators is taking place?\"</p><br/><p>\"Yes, it’s today, but I am not sure what’s going on. I did not send any combat elementalists over and only sent the reserves,\" Sang Zhijun nodded her head and replied.</p><br/><p>\"They are still very young and have a lot of potential. We must seize the opportunity to train more sword operators. Pinwheel Swords are the future,\" Shi Xueman said.</p><br/><p>\"Yes!\" Sang Zhijun quickly nodded her head and replied.</p><br/><p>Both of them were familiar with warfare. After raiding the enemy encampment with a single Pinwheel Sword, they immediately realized its colossal value. They also understood the importance of sword operators.</p><br/><p>Sang Zhijun shot a glance at the enemy encampment. She felt that the enemies most likely wouldn’t attack them for the time being. Then, she said, \"Let’s go and take a look at the selection process.\"</p><br/><p>The others felt curious as well and followed her.</p><br/>\n</div>"}