{"title": "Chapter 595: “The morale of an army is important.”", "id": 595, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-595-the-morale-of-an-army-is-important", "volume_title": "Volume 6", "body": "<h1>Chapter 595: “The morale of an army is important.”</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 595: “The morale of an army is important.”</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>\"I really couldn’t imagine Ai Hui would choose to assault the enemy encampment at that point in time. Even now, when I think about it, I still can’t believe the Sword of Lightning assaulted the encampment of the God Wolf Division and the Silver Frost Division. I have to admit that my mind was blank at the instant he charged the encampment. I feel really ashamed. All along, I felt that I was braver than anyone else, but now I know that I am a coward deep down. Before we charged into the enemy encampment, I still did not understand why Ai Hui became the leader of the Central Pine Faction. Now, I think I know why. One is always willing to follow a person who can bring confidence and courage to everyone in a hopeless situation.\"</p><br/><p>The writing brush in Tong Gui’s hand stopped in its tracks. He was in somewhat of a daze. He was writing this letter to An Chouchou. After a while, he returned to his senses and continued writing the letter.</p><br/><p>\"The Pinwheel Sword is a miraculous masterpiece. It has peerless speed and terrifying offensive capabilities. The only thing that limits it is the position of sword operator. I heard that one needs talent and a unique training system to become a sword operator. Even so, the profession of sword operator has potential and a bright future. The skies of the future belong to the Pinwheel Sword. The combat tactics of the sword pagodas will also redefine the combat styles of elementalists.\"</p><br/><p>\"A bunch of second-rate swordsmen were able to unleash a first-rate attack. Even Karakorum Polaris was surprised. I named the Central Pine Valley’s unique combat style as the Pagoda Style. Pagoda cannons and sword pagodas follow this style. Ai Hui has found the answer to the question of how to use a group of low-level elementalists on the battlefield. The Pagoda Style is innovative and defies conventional battle stratagems.</p><br/><p>\"It will even affect the training methods of elementalists in the future. The need for individual technique and absolute arts will reduce gradually. There will be a greater need for elementalists to have compatibility, synchronization, and endurance. This is the beginning of a new era. It’s my honor to be able to witness and participate in this mission. Newlight City must increase it research on Pagoda Style military strategies. You have an acute foresight. I believe you have already understood what I am saying, and there’s no need for me to give you more details.\"</p><br/><p>Tong Gui’s writing brush stopped in its tracks again. Countless thoughts appeared in his mind. He sighed with sorrow, but felt hopeful and optimistic.</p><br/><p>\"Logically speaking, the strength of both sides did not change much. The enemy’s strength still far surpasses ours. Even so, our side is filled with optimism and fighting spirit. Compared to the dead atmosphere of the past, even though our sky is still covered by dark clouds, we can now see a silver lining. This silver lining is not enough to illuminate the path in front of us, but it’s enough to motivate everyone.</p><br/><p>\"Everyone has begun to believe that Ai Hui’s arrival will bring some changes to the current situation.\"</p><br/><p>\"Even though victories are not guaranteed, no one is scared of fighting blood elementalists anymore.\"</p><br/><p>Tong Gui carefully sealed up the letter and instructed someone to send it to Newlight City.</p><br/><p>When he walked out of his tent, he saw a group of people surrounding Ke Ning. They were listening attentively to Ke Ning’s narration of the Sword of Lightning’s raid at the enemy encampment. This incident had become the hottest discussion topic of the entire defensive line.</p><br/><p>Initially, no one believed it. Fortunately, there were many witnesses. When everyone discovered that it was true, the whole Pagoda Cannon Alliance exploded.</p><br/><p>Due to this incident, the number of elementalists who joined the Pagoda Cannon Alliance increased significantly.</p><br/><p>When Ke Ning discovered this trend, he exaggerated the incident without restraint and recruited a huge number of elementalists.</p><br/><p>Along the way, there were people occasionally greeting Tong Gui, and he returned their greetings. As he walked through the encampment, he could sense the obvious change in atmosphere. Previously, the encampment had a lifeless atmosphere that was rife with pessimism. Nowadays, he would see burly and tough men smile with exultation, looking as if they had excess energy.</p><br/><p>\"Good job! We have to let those blood elementalists know that we are not a bunch of weaklings!\"</p><br/><p>\"It’s a pity I didn’t go along. If I could have seen it with my own eyes, I would die with no regrets!\"</p><br/><p>\"Sir Ai Hui might really be able to overturn the situation.\"</p><br/><p>\"Sir is a true man! Unparalleled courage!\"</p><br/><p>Upon hearing these words, Tong Gui could not help but smile.</p><br/><p>However, when his smile disappeared, he scolded them, \"What are all of you doing here? The Pagoda Cannon Alliance doesn’t need useless people. The blood elementalists are coming and all of you are still slacking here? Go and train now!\"</p><br/><p>Everyone scurried away in panic. Even Ke Ning had a look of embarrassment on his face.</p><br/><p>Tong Gui strode forward and bowed solemnly, \"Sir Ke Ning, time is precious, and the enemies might arrive at any moment. We need to speed up the training process and make sure everyone is accustomed to using the pagoda cannons.\"</p><br/><p>In terms of strength and experience, Tong Gui far surpassed Ke Ning. However, since Ai Hui assigned him and Yu Jin to assist Ke Ning, he could not complain about anything and considered himself as the subordinate of Ke Ning.</p><br/><p>Ke Ning broke into an embarrassed smile. Just as he was about to say something, a blacksmith walked over and asked, \"Who is Ke Ning?\"</p><br/><p>\"I am,\" Ke Ning replied.</p><br/><p>\"12 Beehive Heavy Cannons. Please sign the receipt,\" the blacksmith said.</p><br/><p>In an instant, Ke Ning’s embarrassment disappeared. He asked joyfully, \"Where are the Beehive Heavy Cannons?\"</p><br/><p>When Ke Ning saw the 12 Beehive Heavy Cannons, he almost drooled. Previously, the forging process of the Beehive Heavy Cannons had encountered a hitch. After the arrival of Li Houtang, the problem was solved. Furthermore, because of the team of blacksmiths led by Blind He, the production speed of the Beehive Heavy Cannons began to increase.</p><br/><p>The newly-produced Beehive Heavy Cannons needed to be supplied to the Spear of Heavy Cloud first. The Spear of Heavy Cloud’s defensive line was closer to the enemy, and the pressure they faced was larger. Therefore, they needed the Beehive Heavy Cannons more urgently.</p><br/><p>The daily training sessions of the Pagoda Cannon Alliance involved training with the pagoda cannons that were phased out by the Spear of Heavy Cloud.</p><br/><p>This was also why Ke Ning only now saw the Beehive Heavy Cannons.</p><br/><p>The thick bodies of the heavy cannons were bright-red in color. They looked unusually eye-catching and were filled with an aura of might.</p><br/><p>\"Blind He has made some modifications to the Beehive Heavy Cannons. The length of the barrel was reduced, the amount of snow lava that can be delivered was increased. and the capacity of the fire reservoir has been augmented. Overall, its power has been boosted. This is the first batch of Beehive Heavy Cannons, and they will be replenished in the future. I am here to to build the fire reservoirs. Where should we set up the pagoda cannons?\"</p><br/><p>Ke Ning returned to his senses and quickly replied, \"I will go and ask Sir.\"</p><br/><p>He did not know Ai Hui’s exact plan. Where the pagoda cannons were set up was directly linked to their next battle. He did not know what Ai Hui’s arrangements were for the alliance for the next battle. As such, he did not dare to make decisions for such matters.</p><br/><p>\"Ouch!\"</p><br/><p>Ai Hui’s scream could be heard even from the tent next to his.</p><br/><p>After Lou Lan examined Ai Hui, he said, \"Ai Hui, you have to be more careful next time. Now, the elemental soup is no longer effective for you. Luckily, your body possesses the life force from the Vitality Branches. Otherwise, you would be in danger.\"</p><br/><p>Ai Hui laid on the bed and whispered, \"Next time? Is there still a next time? Since I have done my best, the rest is up to them. Lou Lan, help me up and bring me out to bask in the sunlight. Lying on this bed makes me feel like I am becoming moldy.\"</p><br/><p>\"No problem, Ai Hui,\" Lou Lan nodded his head and yelled cheerfully.</p><br/><p>With a bang, Lou Lan transformed into a ball of soft sand and carried Ai Hui out of his tent.</p><br/><p>When Ai Hui left his tent, the dazzling sunlight caused him to squint his eyes. Compared to the tent, he preferred to be under the sun. Lou Lan moved very carefully. He placed Ai Hui in a comfortable position before leaving to do his work.</p><br/><p>The warm and cozy sunlight shone on Ai Hui’s body. It was a form of pleasure for him.</p><br/><p>Previously, after they had returned to their encampment, he looked as if he was going to collapse after he stepped out of the sword pagoda. During the raid on the enemy encampment, he was overly focused and forgot about his condition. Why did he regret acting like a hero only when he was at his last breath?</p><br/><p>Sigh, one has to think before acting…</p><br/><p>Drowsiness crept over Ai Hui.</p><br/><p>\"Sir! Sir!\"</p><br/><p>Ke Ning’s voice disrupted Ai Hui’s nap. He could not help but open his eyes and ask,\" What’s wrong now?\"</p><br/><p>Ke Ning arrived beside Ai Hui like a gust of wind. With a fawning look on his face, he said, \"Sir, the Beehive Heavy Cannons have arrived. Where should we deploy them?\"</p><br/><p>The Sword of Lightning’s raid on the enemy encampment had completely changed Ke Ning’s impression of Ai Hui. In the past, Ke Ning was the one who badmouthed Ai Hui the most behind his back. Ke Ning used to yearn to return to the Spear of Heavy Cloud day and night because he had not wanted to join this bullsh*t Pagoda Cannon Alliance.</p><br/><p>In contrast, he worshipped Ai Hui nowadays, and his loyalty was unswerving. Whatever Ai Hui said was definitely right!</p><br/><p>Ai Hui’s insane actions and the miraculous battle had established a divine position in Ke Ning’s heart.</p><br/><p>Some people might ask, wasn’t it just a raid? What? Was that a joke? Had anyone done it before? Who could do it? No, no one could do it. Other people wouldn’t even think about it. Initially, Ke Ning thought Ai Hui was crazy and felt he was going to die. Subsequently, he was so nervous that his mind blanked. Eventually, after leaving the enemy encampment safe and sound, he felt incredulous, fearful, and emotional.</p><br/><p>Ke Ning behaved respectfully toward the sick and lazy-looking mummy in front of him, like how a student faced his teacher.</p><br/><p>\"Oh, the Beehive Heavy Cannons,\" Ai Hui casually replied, feeling slightly sleepy.</p><br/><p>Ke Ning nodded his head and said, \"Yes, Sir. Once the Beehive Heavy Cannons are set up, it will be very hard for us to move them again in the future. Should we decide on the defensive positions first before we set them up?\"</p><br/><p>\"Just set them up anywhere you want and train with them first. Given the Pagoda Cannon Alliance’s current level, none of you can go to the front line yet,\" Ai Hui replied lazily.</p><br/><p>With his face flushed in embarrassment, Ke Ning said, \"I’m sorry for not doing a good job. I will definitely supervise and urge everyone to train with the pagoda cannons.\"</p><br/><p>If it had been in the past, he would think that Ai Hui was intentionally nitpicking and trying to shirk responsibility. However, he now believed in everything Ai Hui said. He felt that he, himself, never really did a good job. He was determined to properly train the Pagoda Cannon Alliance and not implicate Ai Hui.</p><br/><p>Ai Hui acknowledged him and continued, \"Don’t scrimp on the snow lava. Train as though you’re in a real battle.\"</p><br/><p>\"Yes! Subordinate will not let Sir down!\" Ke Ning said solemnly.</p><br/><p>After finishing this sentence, Ke Ning left with his head held high.</p><br/><p>Ai Hui was stunned by Ke Ning’s behavior, staring blanking as Ke Ning left. He did not know what had happened to this fellow. It looked as if he had become another person.</p><br/><p>\"The morale of an army is important,\" Xiao Shan appeared out of nowhere beside him and said plainly.</p><br/><p>Ai Hui returned to his senses. All this time, he was annoyed by Xiao Shan’s mysterious behavior and the know-it-all look on his face. He curled his lips and retorted, \"We must have a practical solution. What’s the point of solely depending on morale?\"</p><br/><p>\"That’s true,\" Xiao Shan nodded his head.</p><br/><p>Then, he turned around and walked away.</p><br/><p>Ai Hui was stunned. He… he walked away just like that? What kind of reaction was this? Why didn’t you ask me what solution I have come up with?\"</p><br/><p>Suddenly, a mournful alarm echoed through the encampment.</p><br/><p>Ai Hui sat up straight and looked at the defensive line near the metal wind curtain.</p><br/><p>The most brutal battle was about to begin.</p><br/>\n</div>"}