{"title": "Chapter 599: Selection of Sword Operators", "id": 599, "volume": 6, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-599-selection-of-sword-operators", "volume_title": "Volume 6", "body": "<h1>Chapter 599: Selection of Sword Operators</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 599: Selection of Sword Operators</p><br/><p>Translator: Irene Editor: X, TYZ</p><br/><p>He Min stood among a crowd of youngsters who were about his age. When selecting new blood to replenish its forces, the Spear of Heavy Cloud emphasized its desire to recruit youngsters with potential. These youngsters were like sheets of blank paper, free from bad habits and able to quickly get used to the Spear of Heavy Cloud's style. As long as they were properly nurtured, they would definitely serve as the backbone of the future.</p><br/><p>Regarding talent, the Spear of Heavy Cloud could care less. It focused more on the candidates' nature. The Central Pine Faction was now reputable and famous, but in the past, they had been very ordinary students. Jiang Wei, Wang Xiaoshan, and the rest were all average students and the Central Pine Institution was also an average and secluded academy. Who would've thought that they would gain such fame and recognition?</p><br/><p>As for the replenishment of combat strength, they could select the elites from the defeated troops at the front line. Plus, they had already established and prepared reserves.</p><br/><p>Although Shi Xueman did not have much expectation in terms of talent, youngsters yearned to join the Spear of Heavy Cloud due to its prestige. Whenever Jiang Wei went to recruit from the students, there would always be a huge commotion as the youths were all eager to join. As such, the members they had recruited were all intrinsically outstanding.</p><br/><p>Hearing the ongoing chatter, He Min felt fidgety. He had absolutely no interest in the sword operators. He wanted to be a pagoda cannon gunner. Unfortunately, he wasn't a fire elementalist. All right, even if he couldn't be a pagoda cannon gunner he didn't mind joining one of the other small combat teams.</p><br/><p>With a determined heart, he had come to the Spear of Heavy Cloud and hadn't been disappointed!</p><br/><p>The Spear of Heavy Cloud had countless powerful experts, and its practice sessions were strict. No one was even the slightest bit defiant. Wind Mail City's combat division wasn't even worthy to be compared to the Spear of Heavy Cloud.</p><br/><p>This was a first class combat division!</p><br/><p>\"If I can become a sword operator, I could dash into enemy camp on a Pinwheel Sword!\"</p><br/><p>\"I heard that the Pinwheel Sword is as fast as lightning. I'm looking forward to it!\"</p><br/><p> ...</p><br/><p>Hearing his companions' discussion, He Min felt even more frustrated. Pinwheel Sword, Pinwheel Sword. These fellows only talked about the Pinwheel Sword!</p><br/><p>Of course, He Min had heard about the battle where the Pinwheel Sword charged directly into the enemy camp, but he didn't care for it. Ever since Sir Jiang Wei insisted on bringing him back and ever since he had heard those passionate cries \"We were born with a belief, and we will die by it,\" he had determined that this was the combat division for him and that there were no other heroes.</p><br/><p>He would only fight for the Spear of Heavy Cloud.</p><br/><p>Even if he knew that the Spear of Heavy Cloud and the Pagoda Cannon Alliance were a family, that Ai Hui was the leader of the Central Pine Faction, and that his perseverance seemed ridiculous, it was still how he felt and thought!</p><br/><p>Hmph, he was different from those who groveled before the powerful figures!</p><br/><p>He Min kept silent.</p><br/><p>A tall and sturdy fellow who looked like an iron tower appeared, and everybody immediately closed their mouths.</p><br/><p>This was Shi Zhiguang's first time facing so many kids, so he was rather awkward. He greeted them lightly, \"Hi everyone, I'm Shi Zhiguang, a sword operator of the Pinwheel Sword. We're here today to test if you guys have what it takes to be a sword operator.\"</p><br/><p>Someone raised his hand and asked, \"Sir, what does it take?\"</p><br/><p>This was the first time anyone had called him \"sir.\" Shi Zhiguang blushed, feeling somewhat pleased, yet at a loss. Nevertheless, he was a sword operator and even Master Huo Da asked him for guidance, so how could he lose his cool in front of a young boy?</p><br/><p> \"</p><br/><p>He forced himself to remain calm, puffing his chest out. \"A keen sense of speed and meticulous control of elemental energy.\"</p><br/><p>Seeing that Shi Zhiguang was rather friendly, the other students started raising their hands.</p><br/><p>\"Sir, how does it feel to fly while piloting the Pinwheel Sword?\"</p><br/><p>\"Sir, what were you thinking when you were charging toward the camp?\"</p><br/><p>\"Sir, were you afraid at that moment?\"</p><br/><p>He Min's eyelids drooped as he sighed inwardly at this bunch of novice kids. How embarrassing.</p><br/><p>Shi Zhiguang was a very tolerant person to begin with, so he smiled and answered all the questions, quickly getting familiar with the students.</p><br/><p>Out of the corner of his eye He Min noticed the division leader and her officers approaching and instantly stood up straight in a flash. He searched through the crowd, quickly spotted Jiang Wei, and received a jolt.</p><br/><p>Jiang Wei also noticed He Min's glance. He had a deep impression of the young lad. With a slight smile he called out, \"Work hard, He Min!\"</p><br/><p>He Min only felt a gush of hot blood rush to his brain. He shouted loudly, \"Yes!\"</p><br/><p>Shi Zhiguang hurriedly bowed to Shi Xueman and called out, \"Madam!\"</p><br/><p>He was an honest, straightforward person and had seen Division Leader Shi walking out of the tent while carrying Boss. At that point, everyone had started to discuss how they had done what they were supposed to do and how Shi Xueman would definitely be Boss's wife in the future. Shi Zhiguang felt that their conclusion was correct, so calling her Division Leader Shi seemed too formal. \"Madam\" sounded more friendly.</p><br/><p>Shi Zhiguang had been under Ai Hui's care and guidance, hence he was devoted and loyal toward Ai Hui.</p><br/><p>Shi Xueman blushed a deep red.</p><br/><p>The surroundings became quiet as Jiang Wei, Sang Zhijun, and the rest looked on, somewhat embarrassed. They were impressed by Shi Zhiguang and shocked that he had actually dared to call her that. A sword operator indeed.</p><br/><p>Shi Xueman only felt her face burning. Even her neck and ears were red. If there was a hole in the ground, she would be more than glad to stuff her head inside. Shi Zhiguang's seriousness and genuine expression caused her to be at a loss.</p><br/><p>She bit her lips and forced herself to calm down. \"We are just spectators and curious about how you guys select sword operators. Ignore us, Zhiguang.\"</p><br/><p>Shi Zhiguang hurriedly responded, \"Then I'll continue.\"</p><br/><p>Shi Xueman acted as if nothing had happened. What was the big deal about being called \"Madam?\" Why was her heart beating so fast?</p><br/><p>Out of the corner of Shi Xueman's eye, she caught a glimpse of Sang Zhijun giggling while covering her mouth and couldn't help but glare at her. Yet, she did not realize that she hadn't actually refuted Shi Zhiguang.</p><br/><p>Shi Zhiguang's attention was placed onto the kids once again. He said seriously, \"Come, let's start the test.\"</p><br/><p>Everybody became alert. He Min, especially, had his eyes wide open.</p><br/><p>Initially, he had not been interested in becoming a sword operator, but having been encouraged by Sir Jiang, he felt his blood racing. He had to perform well and not let Sir Jiang Wei down!</p><br/><p>Shi Zhiguang took out a rolled up cloth bag and spread it open in front of everyone. \"The test is very simple.\"</p><br/><p>Everyone pricked up their ears. Even Shi Xueman, Jiang Wei, and the others looked on curiously with their full attention.</p><br/><p>Shi Zhiguang threw a word at them, \"Embroidery!\"</p><br/><p>The opened bag revealed rows glistening silver needles that were neatly arranged.</p><br/><p>Everyone had a sluggish expression on their faces. The word \"embroidery\" had taken them aback.</p><br/><p>He Min stared blankly at the shiny needles, his jaw dropped so wide that an egg could fit inside.</p><br/><p>Shi Zhiguang spoke sincerely, \"An outstanding sword operator is inevitably an outstanding elemental embroidery expert. Both have a lot in common, and one has to be proficient in embroidery in order to be a good sword operator. Embroidery can test the precision of your elemental energy control and your ability to maintain focus over a long period of time. Only those with excellent embroidery skills are fit to become sword operators!\"</p><br/><p>Everybody was speechless and silence fell over the field. Only Shi Zhiguang's voice echoed.</p><br/><p>Shi Zhiguang looked very serious. \"Don't think I'm over exaggerating the effectiveness of embroidery. Master Huo Da is trying hard to study the techniques of embroidery so as to pilot a Pinwheel Sword soon. If even a Master is doing so, all of you should work hard too. All right, come try. It's simple. There are three sections. Controlling the needle to make it fly straight, to fly in circles, and finally to fly slowly. The slower the better.\"</p><br/><p>\"First person!\"</p><br/><p>Already in a working state of mind, Shi Zhiguang operated strictly and meticulously. He had even dared to guide a Master, so of course he wouldn't have stage fright.</p><br/><p>He Min was muddleheaded. He never would've thought that the aptitude test for aspiring sword operators was actually embroidery. Furthermore, from what Shi Zhiguang had said, a sword operator's daily training would most definitely include embroidery!</p><br/><p>Oh god, how terrifying!</p><br/><p>Just the thought of holding an embroidery needle and making the woven cloth fly made him feel cold all over. He would definitely become a target for ridicule. A man doing embroidery was simply too…</p><br/><p>He had never heard of a male embroidery master!</p><br/><p>\"Your turn, He Min.\"</p><br/><p>With an \"oh,\" the muddleheaded He Min walked forward subconsciously.</p><br/><p>An embroidery needle was brought to him.</p><br/><p>\"Come try to make it fly straight.\"</p><br/><p>Seeing that He Min wasn't in the right state of mind, Jiang Wei felt rather worried. He didn't know what He Min was thinking. For people with rich combat experience, they might be shocked and surprised by embroidery, but definitely would not be repulsed.</p><br/><p>Any method of increasing their combat abilities was a good method!</p><br/><p>He Min hadn't regained his senses. He grasped the needle blankly and started channeling his elemental energy subconsciously.</p><br/><p>Shi Zhiguang's voice sounded from the side. \"Not bad! Try making it fly in circles. It's simple, just add a little spin while channeling your elemental energy.\"</p><br/><p>Add a little spin… He Min moved the elemental energy in his hands.</p><br/><p>\"Not bad, not bad!\" Shi Zhiguang's voice carried a tinge of excitement. \"Now try to make it fly slowly. It's very simple, just contain and hold your elemental energy. Cram it forward slowly like how you would with an awl. Slower. That's right, even slower. Good. Excellent!\"</p><br/><p>Shi Zhiguang was full of smiles. \"You've passed! You're selected!\"</p><br/><p>A good seedling!</p><br/><p>He Min's performance was the best out of all students so far!</p><br/><p>Jiang Wei felt happy for He Min. \"Nicely done, He Min!\"</p><br/><p>Still unaware of the situation, He Min instantly became happy upon hearing Sir Jiang Wei's praise.</p><br/><p>\"You're He Min aye?\" Shi Zhiguang smiled while patting his shoulder. \"Report to the sword operator department tomorrow. I'll bring you around later. All right, next.\"</p><br/><p>Shi Zhiguang had a lot of strength. His shoulder pat made He Min's body sway and brought him back to his senses.</p><br/><p>Wait. Report to the sword operator department tomorrow?</p><br/><p>He panicked.</p><br/><p>An image of him waving and directing an embroidery needle floated in his mind…</p><br/>\n</div>"}