{"title": "Chapter 608: 12 Salvos of Heavy Cannon Fire", "id": 608, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-608-12-salvos-of-heavy-cannon-fire", "volume_title": "Volume 7", "body": "<h1>Chapter 608: 12 Salvos of Heavy Cannon Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 608: 12 Salvos of Heavy Cannon Fire</p><br/><p>Translator: TYZ Editor: X, TYZ</p><br/><p>On the God-subduing Peak that was guarded by the Sky Edge Division, everyone nervously looked at the incoming army of broadback batfish in the sky. The sight of 200 broadback batfish suffocated them.</p><br/><p>\"Can Master Fatty hold them back?\"</p><br/><p>\"Should be able to.\"</p><br/><p>Such discussions broke out everywhere in the God-subduing Peak. Everyone felt deeply worried.</p><br/><p>In the crowd, there was a man was was wide-eyed. Like everyone else, he was afraid of missing out on any detail. His name was He Huan. He was one of the earliest members who joined the Karakorum Sword League. He wasn't really gifted, but he was extremely hardworking. Hence, his strength was rather not bad. When Karakorum Polaris was rebuilding the Sky Edge Division, she made him a unit captain.</p><br/><p>He Huan was an ardent individual with a good temperament. He was on good terms with everyone in the Sky Edge Division.</p><br/><p>However, no one knew that one of He Huan's ancestors was a subordinate of the Ye family's ancestors. Being a competent individual who was very interested in military affairs, He Huan was selected by Madam Ye to join the Karakorum Sword League. Back then, Madam Ye wanted him to protect Karakorum Polaris from the dark and therefore put him in the Karakorum Sword League.</p><br/><p>After the Pearl Defensive Line was set up, he received a new mission, which was to observe and record down every aspect of the Central Pine Faction from the dark. He Huan heaved a sigh of relief after receiving this mission. The higher-ups knew the current situation was critical, and they would not sabotage themselves.</p><br/><p>He Huan would not feel any stress if it wasn't an assassination mission. He faithfully recorded down everything he observed. Sometimes, he would even record down his own analysis of what he observed.</p><br/><p>\"Captain He, do think Master Fatty can hold them back?\" a unit member beside He Huan asked him.</p><br/><p>\"He definitely can,\" He Huan replied casually without turning around.</p><br/><p>The other members had huge confidence in He Huan and his insight. Upon hearing these words, all of them heaved a sigh of relief.</p><br/><p>\"If Captain He said Master Fatty can hold them back, that means he definitely can hold them back!\"</p><br/><p>\"We must believe in Captain He!\"</p><br/><p>He Huan's attention was placed entirely on the sky. There was a composed look in his eyes. The Spear of Heavy Cloud's daily training sessions were his main observation target. The scene of Beehive Heavy Cannons firing was extremely spectacular. Whenever the soldiers of the Sky Edge Division were having a rest, they would choose a good spot and spectate the Beehive Heavy Cannons in action. That scene was much more magnificent than fireworks.</p><br/><p>Everyone would also discuss the pagoda cannons' might. Sometimes, He Huan would give his opinions too.</p><br/><p>He Huo did not only observe the might of the Beehive Heavy Cannons. He thoroughly observed every single aspect of the Central Pine Faction. For example the characteristics of the Central Pine Faction's core members.</p><br/><p>Fatty was an underestimated target.</p><br/><p>Before Fatty became a Master, he was widely labeled as \"coward.\" It was only after he became the first ever Pagoda Cannon Master that everyone's impression of him changed.</p><br/><p>However, He Huan's recording and analysis of Fatty was completely different from the consensus from the start.</p><br/><p>Ever since Ai Hui became famous, his past was slowly revealed to the world. Many elementalists who were from his hunting group in the Wilderness back in those days were still alive. Their memories detailed Ai Hui's past experience in the Wilderness.</p><br/><p>Among these memories and descriptions, He Huan discovered something that was overlooked by many people. Most of the elementalists in the hunting group remembered Fatty. Some of them could not even remember Ai Hui very well, yet they had a deep impression of Fatty.</p><br/><p>It was a pity that He Huan could not personally ask other people for their opinions on Fatty. However, this also showed that Fatty wasn't as incompetent as other people thought he was.</p><br/><p>Other than Ai Hui, Fatty was the other survivor. Most people felt that Fatty survived only because Ai Hui protected and took care of him.</p><br/><p>He Huan did not think so.</p><br/><p>He could see that Fatty possess an extraordinary sense of vigilance. Any signs of trouble would cause him to be on high alert. Fatty's arsenal was filled with vileness and treachery. Sneak attacks and traps were this fellow's favorite weapons.</p><br/><p>It was very hard for one to imagine that someone like him could become a Master.</p><br/><p>When He Huan saw the first round of attacks from the Hellfire Pagoda Cannons, he knew Fatty had already set up his trap. He Huan had seen the might of a Beehive Heavy Cannon before. He knew how scary it would be if the Spear of Heavy Cloud's Beehive Heavy Cannons fired all at once.</p><br/><p>The number of broadback batfish in the sky was a few times greater than before. They formed a dense, dark mass in the sky, striking fear and shock into He Huan. In the sky, the fearless, gigantic blood fiends were like a darkish-red tsunami that was filled with anger and insane power.</p><br/><p>However, for some unknown reasons, He Huan was slightly looking forward to seeing the scene of the blaze from the Beehive Heavy Cannons colliding against the darkish-red tsunami. How magnificent would that be!</p><br/><p>He could not help but hold his breath.</p><br/><p>…..</p><br/><p>The Spear of Heavy Cloud pagoda cannon site on the God-subduing Peak.</p><br/><p>The pagoda cannoneers scrambled frantically from the Hellfire Pagoda Cannons to the Beehive Heavy Cannons. They were panting heavily, and their foreheads were beaded with perspiration. Eventually, their breathing calmed down. Everyone held their breaths and had their eyes wide open. The air seemed to have frozen at this moment. The enormous site for Beehive Heavy Cannons was so quiet that one could even hear a pin drop.</p><br/><p>The sound of the broadback batfish flapping with bone-spur-filled wings could be heard clearer and clearer. The air currents produced by their wings had gathered, making the sky look as if it was trembling.</p><br/><p>\"Let them get closer! Listen to my commands!\"</p><br/><p>Fatty's voice was low and deep, but it sounded unusually loud in the silent pagoda cannon site.</p><br/><p>1.5 kilometers!</p><br/><p>Voom, voom, voom!</p><br/><p>The sound of the broadback batfish flapping their wings resembled a gigantic air pump being pumped. Waves of air current from their wings struck the light screen of the God-subduing Peak, causing it to undulate nonstop.</p><br/><p>The pagoda cannoneers could even feel the God-subduing Peak trembling slightly.</p><br/><p>1 kilometer!</p><br/><p>The pagoda cannoneers could clearly see the fury in the eyes of the broadback batfish, their thick and solid white bone spurs, the vine-like and intertwining blood traces on their bodies, and the looks of insanity and malevolence on the faces of the blood elementalists sitting on their backs.</p><br/><p>500 meters!</p><br/><p>The overly close distance between the broadback batfish and the pagoda cannon crews caused the latter's line of sight to be covered with broadback batfish, and they could not even see the sky. It was as though they were placed beneath the darkish-red tsunami and were about to be crushed to smithereens in the next instant!</p><br/><p>Their foreheads were covered with beads of perspiration, and their bodies were drenched in sweat. Even though they tried their best to maintain their composure, their faces were still pale-white. Some people were even licking their dried lips every now and then.</p><br/><p>Opposite from them, when Mo Shaojun saw his subordinates get so close to the God-subduing Peak, a strong sense of uneasiness arose in his heart.</p><br/><p>The God-subduing Peak was too quiet! Something's wrong! The broadback batfish did not face any resistance! </p><br/><p>Is the other party really that confident? Aren't they scared of getting their fingers burned for playing with fire?</p><br/><p>Given such a close distance, even the Hellfire Pagoda Cannons would not be able to hold off the broadback batfish!</p><br/><p>But why was he feeling so uneasy?</p><br/><p>The smile on Mo Shaojun's face disappeared as beads of perspiration appeared on his forehead. He could not help but clench his fist tightly, causing his fingers to turn white. His wide eyes could not blink at all, fearing that he might miss out on some details.</p><br/><p>300 meters!</p><br/><p>\"Attack!\"</p><br/><p>Fatty's voice was unusually low and deep, containing a tinge of chilliness. However, when it rang across the ears of the pagoda cannoneers, whose minds were on the verge of collapse, it sounded like a deafening thunderclap.</p><br/><p>Almost immediately, all the heavy cannons boomed in unison!</p><br/><p>Suddenly, illuminated red lights like streaks of red glowing swords, pierced through the darkish-red tsunami that was formed by the broadback batfish.</p><br/><p>Red glows?</p><br/><p>Mo Shaojun's facial expression changed as his heart palpitated with fear. They were not Hellfire Pagoda Cannons!</p><br/><p>They were too close!</p><br/><p>The Spear of Heavy Cloud's pagoda cannoneers had never hit targets that were so close to them before. They did not even need to aim as the huge bodies of the broadback batfish covered their line of sight.</p><br/><p>It was insane!</p><br/><p>They had never put themselves in such an insane situation before. The enemies were getting closer and closer. The fear and anxiety they had been feeling all this time had reached their limits and erupted at once when Master Fatty gave his command. Everyone's minds were in a daze. They were frantically firing at the darkish-red tsunami that covered their line of sight.</p><br/><p>Their firing rates had reached an unprecedented level.</p><br/><p>The bright-red barrels of the heavy cannons gave off an eerie glow, resembling iron plates had been heated until they turned red.</p><br/><p>The buzz from the high-speed spinning inner chamber of the Beehive Heavy Cannons was mixed with the continuous deafening booms.</p><br/><p>The streaks of red blaze that shot out from the Beehive Heavy Cannons were like red, glowing silk. During the daily training sessions, the streaks of blaze from the Beehive Heavy Cannons would fly for a brief moment before opening up into glowing nets that covered a wide area.</p><br/><p>However, at this point in time, the broadback batfish were too close to the pagoda cannoneers. It was too late for the blazing streaks from the Beehive Heavy Cannons to open up. In a flash, they pierced through the broadback batfish like red glowing swords</p><br/><p>More than 10 broadback batfish in front of them were flooded by hundreds of streaks of heavy cannon fire in the blink of an eye.</p><br/><p>The strong vitality of the broadback batfish was useless against the Beehive Heavy Cannons. Before those broadback batfish could wail in agony, their bodies were already ripped apart by the terrifying blazes from the heavy cannons.</p><br/><p>The attacks from the Beehive Heavy Cannons had perfectly displayed the power of \"heavy.\" If one compared the attack of a Hellfire Pagoda Cannon to an awl that had a powerful penetrating power, the attack of a Beehive Heavy Cannon would be a hammer when it had yet to open up.</p><br/><p>When the attack of a Beehive Heavy Cannon hit a broadback batfish, the latter would freeze momentarily. This showed how terrifying the attack of the Beehive Heavy Cannon was.</p><br/><p>The momentum of the charging broadback batfish was impeded before they were ripped to smithereens in the next moment.</p><br/><p>The heavy cannon fire continued their trajectories and hit the broadback batfish at the rear. Almost immediately, an ensuing second salvo of heavy cannon fire hit the broadback batfish that were now at the vanguard. They froze, were ripped to smithereens, and the heavy cannon fire shots continued on their paths to the broadback batfish at the rear…</p><br/><p>The third salvo!</p><br/><p>The fourth salvo!</p><br/><p> ...</p><br/><p>They had fired 12 salvos in one go!</p><br/><p>This was an unprecedented result, a result that they had never achieved before in training.</p><br/><p>A momentary silence descended upon the Beehive Heavy Cannon site.</p><br/><p>The pagoda cannoneers were panting heavily, their bodies were drenched in sweat, traces of boiling steam engulfed their surroundings, and their eyes were in a daze. Clearly, they had yet to recover from the shock. They had just made a trip to the gates of hell and were still frightened.</p><br/><p>A wail resounded through the air, returning everyone to their senses.</p><br/><p>They raised their heads and looked at the sky. The darkish-red tsunami that covered the sky had disappeared. There was one half-crippled broadback batfish remaining. It was wailing and on the verge of collapse. Half of its body had disappeared. Blood was flowing down its maimed body, dripping from the sky.</p><br/><p>In the quicksand zone in front of the defensive line, fragmented flesh and limbs could be found everywhere, resembling an Asuric hell. A gust of wind blew across the area, and a strong bloody smell that was mixed with an unusually sweet scent assaulted everyone's noses. The pagoda cannoneers, who had just relieved themselves from the fear and insanity of death, could not help but squat down in unison and puke.</p><br/><p>Behind them, the other members of the Spear of Heavy Cloud, the Infantry Division, and the Sky Edge Division could not believe their eyes.</p><br/><p>On the opposite side, Mo Shaojun and everyone in the God Wolf Division and the Silver Frost Division had the same incredulous looks on their faces.</p><br/><p>For a moment, both sides became unsually silent.</p><br/>\n</div>"}