{"title": "Chapter 628: Viridescent Flower, Viridescent Flower", "id": 628, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-628-viridescent-flower-viridescent-flower", "volume_title": "Volume 7", "body": "<h1>Chapter 628: Viridescent Flower, Viridescent Flower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 628: Viridescent Flower, Viridescent Flower</p><br/><p>Translator: Irene Editor: Lucas, TYZ</p><br/><p>The viridescent twining branches fell onto the ground softly like a viridescent feather.</p><br/><p>\"Viridescent flower, viridescent flower, carry me with magnificence. Viridescent flower, viridescent flower, bestow me with poor melons.\"</p><br/><p> .</p><br/><p>Duanmu Huanghun's melodious voice echoed.</p><br/><p>The viridescent flowers extended rapidly like a green carpet spreading outward.</p><br/><p>Helian Tianxiao found Duanmu Huanghun's voice as annoying as the buzzing of a fly. Nevertheless, he had to admit that his judgment had been accurate.</p><br/><p>Duanmu Huanghun's abilities were indeed beyond those of ordinary Masters!</p><br/><p>As one of the richest and most powerful aristocratic families in the former Avalon of Five Elements, not only was the Duanmu family the most influential family in Jadeite Forest, it was also a place the God Nation had always been gathering information from. Duanmu family's [Viridescent Flower] had long history that could be traced back to Cultivation Era. Reportedly, it was inspired by the viridescent flower design on porcelain. When put to use, [Viridescent Flower] indeed validated this claim.</p><br/><p>[Viridescent Flower, Twining Branches] was the most common and ordinary skill among the Duanmu family's absolute art, [Viridescent flower].</p><br/><p>However, Duanmu Huanghun's [Viridescent Flower, Twining Branches] was entirely different. It was no longer made of the frail and flat viridescent flower traces but lively and plump young sprouts.</p><br/><p>He could feel the resistance from the ground.</p><br/><p>The moment God Wolf launched an attack, the soldiers became one with blood spiritual force. Forget about grass, even if there was a mountain before him, Helian Tianxiao had confidence that he could smash it into pieces!</p><br/><p>But he could also clearly feel the resistance coming from the tender viridescent flowers!</p><br/><p>He felt as though he had fallen into a swamp as the resistance all around slowed the soldiers' momentum. This was an extremely dangerous sign! When charging, speed and momentum were key. If they were to lose speed, they would also lose power. No matter how heavy an axe was, it wouldn't chop wood if the handler was unable to raise it.</p><br/><p>They had to get out of this situation!</p><br/><p>Helian Tianxiao shouted, \"Silverfrost Screen!\"</p><br/><p>Without hesitation Song Xiaoqian repeated, \"Silverfrost Screen!\"</p><br/><p>On the battlefield, Silverfrost Division's task was to protect the flanks of God Wolf and sacrifice themselves when needed. This was the Silverfrost Division's mission and job.</p><br/><p>Silverfrost wolves sprinted wildly on both sides and the mist around their hoofs thickened.</p><br/><p>Crash!</p><br/><p>Before them, a long block of ice rose from the ground and extended forward.</p><br/><p>God Wolf leapt onto the ice and continued charging forward!</p><br/><p>The all-round resistance disappeared and God Wolf regained their previous might and momentum.</p><br/><p>Duanmu Huanghun looked on as this happened. He slanted his mouth a little and started to sing.</p><br/><p>\"General and his cavalry, a beauty yet to be married. Viridescent flower remains the same, aging with magnificence.\"</p><br/><p>Covering the land, the viridescent twining branches blossomed simultaneously as bright viridescent flowers bloomed. The sea of grass from earlier instantly became a sea of flowers. When Duanmu reached the notes \"aging with magnificence\", the viridescent flowers exploded and countless petals enveloped the whole battlefield, fluttering everywhere!</p><br/><p>The petals emitted a slight glimmer as they danced in the boundless sky like snowflakes, as if there were beautiful women singing a mournful but alluring song.</p><br/><p>Helian Tianxiao opened his eyes wide in disbelief.</p><br/><p>What Path of Master was this?</p><br/><p>Was this a wood elementalist's move?</p><br/><p>How could it be?</p><br/><p>God Wolf's movement became sluggish as the soldiers' mental state had been affected. The river flow-like blood spiritual force was no longer surging as smoothly as before.</p><br/><p>Such an unimaginable move, such terrifying viridescent flowers… how could they be executed by a freshly promoted Master?</p><br/><p>Damn!</p><br/><p>Helian Tianxiao cursed. He had to break this skill first; otherwise, even if they had managed to charge into the enemy's camp, the soldiers' morale and might would be depleted. What would be the use then?</p><br/><p>Right now time was of the essence!</p><br/><p>The enemy was trying everything they could to obstruct God Wolf in order to stall for time and increase their odds of victory.</p><br/><p>Helian Tianxiao was well aware of this fact, but there was nothing he could do. He had thought that they could make it to the camp in one shot, but obstacles presented themselves one after another, thoroughly pissing him off.</p><br/><p>Duanmu Huanghun's pretentious and arrogant behavior added flames to his already heated heart.</p><br/><p>When has there ever been a mere Master who had dared to act all high and mighty before God Wolf?</p><br/><p>Go to hell!</p><br/><p>Unable to hold back any longer, Helian Tianxiao roared, \"Kill!\"</p><br/><p>He raised the curved knife in his hand and dove toward Duanmu Huanghun.</p><br/><p>The God Wolf soldiers yelled in unison, \"Kill!\"</p><br/><p>Dazzling, red-colored knives rose like a blood wave, carrying a sharp whistle. It was as if a malicious spirit had broken free from the blood sea and pounced onto Duanmu Huanghun.</p><br/><p>Knife rays flew up and the sharp whistle faded. All sounds on the battlefield disappeared and were overtaken by a dead silence.</p><br/><p>The viridescent flower petals fluttered as if being attracted, and gathered from all directions.</p><br/><p>Pff, pff, pff.</p><br/><p>The petals shattered into viridescent fragmented rays upon nearing the terrifying knife rays. The viridescent twining branches grew wildly on the ground, forming walls, but before the knife rays, they too became as frail as paper.</p><br/><p>The blood knife rays swept ferociously across the sky and struck Duanmu Huanghun!</p><br/><p>In his fluttering white garments, Duanmu Haunghun exploded into viridescent fragmented rays with a loud bang. The remaining momentum threw the blood knife rays high up into the sky.</p><br/><p>Helian Tianxiao's eye twitched. They had been played!</p><br/><p>A big sheet of fluttering viridescent flower petals assembled behind Xiao Shan and gang to form a viridescent twining branch embroidery ball. Bang! The embroidery ball exploded, causing the viridescent flower fragmented rays to dance in the breeze as a pale Duanmu Huanghun reappeared.</p><br/><p>How close!</p><br/><p>If he hadn't been more careful, he definitely would've died horribly by that knife. He wouldn't have been able to block off the full strength of God Wolf. Not only would he have failed to do so, but he would also fail to escape once he was being locked down.</p><br/><p>Nevertheless, he could sense that these soldiers' morale was becoming increasingly intimidating. With a raise of his head and a puff of his chest, Duanmu Huanghun courageously flew up. With his floating white garments and handsome face, he looked almost god-like.</p><br/><p>\"Viridescent flower, viridescent flower…\"</p><br/><p>Duanmu Huanghun shouted, but before he could do anything, he saw Helian Tianxiao raising his knife. Duanmu Huanghun quivered and cursed inwardly. Once again, with a clap, he transformed into fluttering viridescent flower petals that dispersed amid the sea of flowers.</p><br/><p>Sword of Lightning. Gu Xuan and gang were waiting patiently for an opportunity.</p><br/><p>God Wolf was moving with full force. It wasn't something they could fight against without Ai Hui's lead. That terrifying knife ray from earlier had shocked them bloodless. However, upon seeing that Duanmu Huanghun had managed to dodge it, they instantly heaved a sigh of relief.</p><br/><p>\"That's it, that's it. Duanmu Huanghun's become a Yu Mingqiu! He's starting to recite poetry!\"</p><br/><p>\"Magnificent I do know, but what about the poor melon? What kind of melon is that? Will one become poor after eating it? It's no wonder Bangwan's always so poor! Boss won't eat it for sure!\"</p><br/><p>\"Whoever dares to offer Boss a piece of poor melon will be dead in one slap! Right, who's that general?\"</p><br/><p>\"Why do you care! The focus should be on the beauty! When did he find himself a belle?\"</p><br/><p>\"Could he be talking about himself?\"</p><br/><p>\"Hmm, seems possible…\"</p><br/><p>Nonsensical discussion filled the air, but that aside, everyone was still impressed by Duanmu Huanghun, who had become so powerful upon returning! They knew how difficult it was to resist God Wolf's blood current, even for a short period of time!</p><br/><p>Unknowingly, the fear and desperation in their hearts had disappeared. What took over was a heroic spirit for having battled against the enemy.</p><br/><p>Wind Mail's power, volcano's combustion, viridescent twining branches' splendor.</p><br/><p>No one retreated. Everybody risked their lives forging forward in unity.</p><br/><p>As members, how could they not feel proud? How could they not?</p><br/><p>Wasn't life but a battle?</p><br/><p>To live without regrets.</p><br/><p>Emotions surging, Gu Xuan forced himself to regain composure. Boss wasn't around, so he would be commanding the team.</p><br/><p>In a low voice, he cut in, \"Shut it, you all!\"</p><br/><p>Everyone quietened down immediately and turned serious, their emotions surging within and their eyes flickering with a strong desire to battle. They no longer felt exhausted and were filled with boundless energy; they had fire in them. However, they had to wait for the perfect opportunity to deal the enemy a fatal blow.</p><br/><p>Gu Xuan continued, \"Zhiguang, move diagonally to the side. The moment Senior Xiao Shan and his team move, we will cut in!\"</p><br/><p>Shi Zhiguang nodded as he gently pressed on his sword hilt. His eyes were like stars in the night sky, but his face was as calm as water.</p><br/><p>The members of Sword of Lightning fixed their gaze on Xiao Shan and gang.</p><br/><p>Not only Sword of Lightning, but the whole battlefield's attention was on them.</p><br/><p>Because the elemental energy wave motion was so intense, it swallowed up elemental energy from miles away. What great power! The sky lantern-like lights from earlier had become even more dazzling. They were like suns that emitted eye-piercing light rays, illuminating the night sky and making it seem like day time.</p><br/><p>Amid the light, a figure could faintly be seen.</p><br/><p>It was becoming blurry bit by bit.</p><br/><p>Helian Tianxiao felt the terrifying wave motion but did not raise his head. Instead, he led his team in their wild charge. He was afraid that if he did look up, he would uncontrollably launch an attack!</p><br/><p>A sense of danger overtook his whole body, making him feel fear and trepidation.</p><br/><p>The best choice now was to charge into the enemy's camp.</p><br/><p>Once they did that, it would be difficult for them to separate, no matter how strong the enemy's moves were.</p><br/><p>Whatever the enemy had done so far was to slow them down. The more this was so, the more they shouldn't stop!</p><br/><p>By now the enemy had already shown all their cards.</p><br/><p>Seeing the camp magnifying in his field of vision, Helian Tianxiao felt uncontrollably agitated.</p><br/><p>The annoying viridescent flowers swept over once again, but this time Helian Tianxiao remained unmoved. The flowers were much weaker than before. Plus, they had already gained momentum and flow, so they were unobstructable.</p><br/><p>Once the heavy axe was lifted, the enemy would be destroyed!</p><br/><p>Just then, the sky dimmed once again.</p><br/><p>Eh?</p><br/><p>Helian Tianxiao raised his head automatically and noticed that the sun had vanished. The scenery around them had disappeared as well. A gentle wind sound surrounded them.</p><br/><p> The wind sound was very subtle, but it made Helian Tianxiao's hair stand on end.</p><br/><p>He raised his arm abruptly and shouted, \"Halt!\"</p><br/><p>The enormous inertia plowed deep scars on the ground, causing mud to fly everywhere. God Wolf and Silverfrost stopped in their tracks and everyone looked around, bewildered.</p><br/><p>They couldn't see anything. Instead, they could only hear the wind. It was so gentle and soft, but absolutely frightening.</p><br/><p>Breeze of Surveillance had arrived right on schedule.</p><br/>\n</div>"}