{"title": "Chapter 635: Cruel Battlefield", "id": 635, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-635-cruel-battlefield", "volume_title": "Volume 7", "body": "<h1>Chapter 635: Cruel Battlefield</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 635: Cruel Battlefield</p><br/><p>Translator: Irene Editor: Lucas, TYZ</p><br/><p>The light sword trembled and was swiftly removed from the earth. It then shot into the sky, leaving an exceptionally eye-grabbing arc of light trace in the night sky.</p><br/><p>Clang clang clang!</p><br/><p>A crisp sword chime sounded incessantly.</p><br/><p>The light swords came out of the ground in succession and transformed into sword lights that shot toward the Silverfrost Blood Division.</p><br/><p>In that moment, the light swords were like rain.</p><br/><p>From the attack of the first light sword to the constant fall of raindrop-like swords, everything happened in the blink of an eye. However, Song Xiaoqian's full attention was captured by the light swords that landed onto the sword formation. The momentum of the light sword was amazingly fast. Not daring to underestimate them, she shouted, \"Flying Wall!\"</p><br/><p>The Silverfrost soldiers already had their arrows on their bows and released them upon her command.</p><br/><p>Boom!</p><br/><p>The bowstrings shook as arrows shot out like dense rain, as if a gush of cold water had been poured out.</p><br/><p>As the silver arrows left their bows, their bodies rapidly developed a layer of white frost that thickened and expanded instantly to form ice beams.</p><br/><p>The ice beams grew at an alarming rate, resulting in an amazing scene on the battlefield.</p><br/><p>The arrow rain expanded like balloons, turning ice beams into ice blocks that eventually blended together to form a giant, ice wall.</p><br/><p>This ice wall of over thirty meters in height, a hundred twenty meters in width, and ten meters in thickness flew forward like a mountain peak with a low whistle. It was like an enormous dire beast, charging into the jungle and the land it trampled on overturn. The swords weren't able to obstruct the wall at all and broken sword pieces flew in all directions like raindrops.</p><br/><p>[Flying Wall] consumed much more energy than the simpler [Ice Wall], but its effect pleased Song Xiaoqian nevertheless.</p><br/><p>The more important thing was that [Flying Wall] could protect them as they continued charging forward.</p><br/><p>Countless actual battles had proven that the moment they lose charging speed, death was the only result.</p><br/><p>Song Xiaoqian was convinced that the death of their enemy was inevitable if they could maintain their speed all the way to the front. Of course, this was true unless he had already been upgraded into a Master.</p><br/><p>Just then, she heard a soft plop and immediately tensed up.</p><br/><p>The light swords had hit the ice wall!</p><br/><p>Her pupils shrank. A bright light speck had appeared on the ice wall before her eyes.</p><br/><p>The next moment, densely packed light specks surfaced on the ice wall like twinkling stars.</p><br/><p>\"Be careful…\"</p><br/><p>Before Song Xiaoqiao could finish her words, the light rays of the specks brightened. Bitingly cold and sharp sword consciousness shot out from between the brows and landed onto the ice wall, causing it to explode into ice bits. The scene of such a huge ice wall shattering into pieces was absolutely magnificent. It was as if the snow mountain had produced an avalanche that raised a thick layer of dust off the ground.</p><br/><p>However, Song Xiaoqian had no time to bother with these.</p><br/><p>Like lightning, a sword light ripped across the sky and landed within the Silverfrost Blood Division in the blink of an eye!</p><br/><p>The white light rays that enveloped the whole army was fragile like paper and unable to obstruct the sword light at all. Like red hot metal, the sword light blinded her vision and left a sharp light scar that seemed to slice open the night sky.</p><br/><p>Pff, pff, pff!</p><br/><p>Even without turning around to look, Song Xiaoqian knew that those were the sounds of the light swords effortlessly piercing through her soldiers' bodies.</p><br/><p>Clap! Her side vision had suddenly been occupied by a splashing lump of exploded flesh. A soldier's brain had just been struck by a light sword.</p><br/><p>Song Xiaoqian remained indifferent, as if her heart was made of stone. Perhaps she would feel sad after the war, but at this moment she was calm and almost cold.</p><br/><p>Had there ever been a battle without casualties?</p><br/><p>A wave of attacks resulted in the fall of over a hundred soldiers!</p><br/><p>It was Song Xiaoqian's first time witnessing such a horrifying attack. Furthermore, this was the result even after they had employed their ice wall as defense. Yet she wasn't too surprised, since she knew that they were about to face a rival, or should she say monster, of a totally different level.</p><br/><p>The first wave of attack had proven a part of her conjecture right.</p><br/><p>God's blood!</p><br/><p>She was a hundred percent certain that the other party had it. Otherwise, there was no way he could penetrate their defense this easily.</p><br/><p>The strict level system of blood elementalists was not only displayed through their power and status but also their ability to suppress force. This was also why Red Devil was able to rise to a prominent position immediately upon his blood refinement.</p><br/><p>Similarly, blood spiritual force of a higher level could completely suppress that of a lower level. Even though he had just completed his blood refinement, Red Devil was fated to become one of the strongest players within the God Nation.</p><br/><p>And the most powerful person in the God Nation was the emperor, His Majesty!</p><br/><p>Originating from the holy object, the force of God's blood was the strongest force in the God Nation. Nothing was comparable.</p><br/><p>The soldiers believed that the enemy had to be extremely powerful to produce such colossal damage, but only Song Xiaoqian knew that apart from his immeasurable abilities, the force of God's blood's restraining effect on the blood spiritual force was the real cause of their heavy casualties.</p><br/><p>The holy object of the God Nation was the main culprit of Silverfrost's disastrous loss. It was rather humiliating.</p><br/><p>Song Xiaoqian had no idea how and where the enemy had gotten hold of God's blood, but there was no other choice than to continue charging with their injuries.</p><br/><p>The crisp sword chimes mixed in with the rumbling of wolves' hoofs.</p><br/><p>The light swords came out of the ground one by one and transformed into dazzling sword lights that dove for the Silverfrost Blood Division.</p><br/><p>Some soldiers would collapse with each step Silverfrost took. In spite of that, their momentum did not weaken.</p><br/><p>Soldiers that had fallen off the back of the wolves had no time to howl since they quickly got trampled by their companions behind.</p><br/><p>Their flesh mixed in with the earth, dying it red.</p><br/><p>No one noticed that their flesh had silently disappeared, as if they'd been swallowed.</p><br/><p>…..</p><br/><p>Within the blood eye's fantasyland, the thick, golden mist was weakening in a speed visible to the naked eye.</p><br/><p>Ai Hui noticed the anomaly and muttered to himself. He understood what was going on.</p><br/><p>The golden mist was the portion within God's blood that he wasn't able to absorb, and he planned to expel it through the sword formation. However, ordinary swords weren't able to endure such an aggressive force and so they broke one after another. Later on, with the nourishment of the flesh of blood fiends, these swords of ordinary quality could absorb the weak force of God's blood to become light swords.</p><br/><p>However, the flesh of blood fiends was obtained through front line battles, so they were limited. As such, an increasing amount of God's blood couldn't be expelled.</p><br/><p>No one had thought about using the corpses of blood elementalists, since they were all humans after all. It was difficult to carry out such an act that challenged their morality.</p><br/><p>Ai Hui, who had been roused by his failure to expel the golden mist, could only guess that something had happened outside.</p><br/><p>But when the Silverfrost Blood Division charged into the sword formation, he immediately sensed it.</p><br/><p>Before he could react, his sword embryo had already started operating upon sensing threat. The next moment, Ai Hui witnessed the magnificent scene of light swords falling like rain.</p><br/><p>The sword formation swallowed the enemy's flesh, catching Ai Hui off guard.</p><br/><p>Again, before he could react, the golden mist that couldn't be drained abruptly weakened.</p><br/><p>Almost simultaneously, swords shot out seemingly substantial light rays from the corners of the sword formations. The surface of the sword bodies started to peel off, revealing the shimmering light swords underneath.</p><br/><p>The crisp sword chimes sounded again as the freshly born light swords rose into the sky and dove toward the enemies.</p><br/><p>The flesh of blood elementalists was much more effective than that of blood fiends.</p><br/><p>The flesh of broadback batfishes, the lowest of all blood fiends, had previously been used. Now, the fleshes within the sword formation were those of blood elementalists and silverfrost wolves, which were of a much higher level compared to the batfishes'. It was especially the case for blood elementalists since their flesh wasn't something blood fiends could match up to.</p><br/><p>Ai Hui's heart turned cold.</p><br/><p>God's blood really was a monster. The portion he had absorbed, which amounted to less than a drop, had been sufficient to strengthen his sword embryo and bring about entirely new changes. The remaining portion, on the other hand, couldn't be expelled out of his system if not for the blood flesh.</p><br/><p>It swallowed all of the blood flesh, be it those of humans or wild beasts.</p><br/><p>Ai Hui supposed that if God's blood had created the God Nation and founded the blood elementalist system, blood elementalists possessing God's blood would be able to swallow other blood elementalists to replenish their own bodies whenever needed.</p><br/><p>The unique properties displayed by God's blood were truly intimidating.</p><br/><p>Ai Hui was getting increasingly convinced that God's blood belonged to the demonic god in the dream sequence he had had, because its force displayed an uninhibited, primitive, callous, deceitful, and beast-like predatory behavior.</p><br/><p>This was also why Ai Hui did not like it at all. Warmth was completely absent. Ai Hui had always believed himself to be a cool fellow who had no regard for the death of others.</p><br/><p>He had never placed value on morality and virtues. He was willing to try anything in order to become stronger. Even then, the traits displayed by God's Blood irked him thoroughly.</p><br/><p>One example would be the blood elementalists' sacrificing of their own comrades in order to save themselves.</p><br/><p>He would rather die than to do something like that.</p><br/><p>Luckily, those forces had been expelled and he wasn't going to turn into a blood elementalist.</p><br/><p>Ai Hui raised his head automatically to look at the giant blood eye on the top of his head.</p><br/><p>Thank you, blood bandage.</p><br/><p>Aye, thinking about Teacher and Mistress again…</p><br/><p>Despite being in a dangerous situation, Ai Hui's thoughts ran wild, causing an indescribable grief.</p><br/><p>He only regained his senses upon realizing that the golden mist before his eyes had weakened significantly. Yet another batch of blood elementalists had become the light swords' nutrients.</p><br/><p>Up till now, he had been a bystander.</p><br/><p>Watching his sword embryo orchestrating the whole battle.</p><br/><p>His entirely transformed sword embryo was exhibiting its power to Ai Hui.</p><br/><p>Song Xiaoqian felt as though they were charging into a group of hornets.</p><br/><p>They couldn't see anything in front as they were completely blinded by the crisscrossed light beams that enveloped them. It was actually a web that had been formed by countless dancing light swords!</p><br/><p>Song Xiaoqian raised the spear in her hands swiftly, coincidentally blocking off an amazingly fast sword light.</p><br/><p>Clang! A clear sound rang as the spear point exploded into a ball of fire.</p><br/><p>Song Xiaoqian's palm burned and she was almost unable to maintain her grip on the spear.</p><br/><p>The light sword shot away, but Song Xiaoqian noticed that it hadn't been damaged even the slightest.</p><br/><p>The force of God's blood contained within that light sword was extremely weak, but it was that very wisp of frail force that pressurized her greatly. The toll it had inflicted on her far exceeded what she usually had to face.</p><br/><p>If this went on, they were going to be destroyed.</p><br/><p>What scared her more was the fact that the number of light swords was increasing, and at an alarming rate. They were all around and uncountable. The striking light scars drawn by them were like light beams that wove into an impenetrable web.</p><br/><p>Her people had only managed to advance a few hundred meters, as if they were stuck in a quagmire.</p><br/><p>Soldiers beside her fell one after another. Song Xiaoqian was no longer able to maintain a calm state of mind. She started to get anxious.</p><br/><p>She tried using all ideas that she could come up with, but to no avail.</p><br/><p>Only approximately half of her soldiers were alive. A three hundred meter advancement took a third of her people down. Such a heavy and rapid loss had never been seen before.</p><br/><p>There was another three hundred meters to go.</p><br/><p>She noticed the look of fear emerging on her soldiers' faces.</p><br/><p>Only three hundred meters more. The last three hundred meters!</p><br/><p>Her gaze was resolute.</p><br/>\n</div>"}