{"title": "Chapter 656: The Idle Duanmu Huanghun", "id": 656, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-656-the-idle-duanmu-huanghun", "volume_title": "Volume 7", "body": "<h1>Chapter 656: The Idle Duanmu Huanghun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 656: The Idle Duanmu Huanghun</p><br/><p>Translator: YH Editor: X, TYZ</p><br/><p>The night was filled with stars sprinkled on the blue dome of heaven, and the splendor of the stars shone on the earth. The brightly lit Fish Bone absorbed all the starlight. Voices wafted down from the peak as blazing red flames soared through the air. They were mining the sealed magma, which would be refined into snow lava to provide enough ammunition for the Pagoda Cannon Alliance.</p><br/><p>The nearby Central Pine Valley was quiet and still, with a gentle mist covering it like a curtain and isolating it from the hustle and bustle of the outside world. However, the splendor of the stars penetrated effortlessly through the mist and gave the valley a veil of light. The fallen leaves from the jade sword bamboo trees were separated from the bamboo branches and rolled in the breeze. From time to time, they would send forth the clear sound of sword chimes and would inject some liveliness into the atmosphere.</p><br/><p>The Central Pine Valley was utterly quiet, and the children were all asleep. Everyone was shocked by the sudden attack from the God Wolf and Silver Frost division previously. Since then, Mr. Dou had ordered all children to stay in the Central Pine Valley.</p><br/><p>Other people hardly came to the Central Pine Valley. Everyone else was unusually and endlessly busy, except for Duanmu Huanghun.</p><br/><p>Duanmu Huanghun did only what was of interest to him. For example, harassing and ambushing the enemy. He was too lazy to bother about things that did not interest him. It was good at the beginning because the enemy was like a silly rhinocereous that got angry at the slightest provocation. Good teamwork between Duanmu Huanghun, the Spear of Heavy Cloud, and the Sword of Lightning resulted in successive victories over the enemy. In particular, after the loss of two blood elementalists with the Ability of God, who were regarded as matchless warriors, the enemy god division unexpectedly turned out to be plain and boring cowards.</p><br/><p>Duanmu Huanghun was suddenly no longer busy at all.</p><br/><p>Only two people could order him around, namely Shi Xueman and Lou Lan. Ai Hui had not left his seclusion, so all matters pertaining to the entire defensive line fell on Shi Xueman. She had a multitude of things to handle and had no time for Duanmu Huanghun.</p><br/><p>Lou Lan was also busy cooking elemental soup and patrolling the sword formations in the valley. He worked diligently and conscientiously. Lou Lan was a good boy who did not like to trouble others and would always find ways to solve his own problems. If help was needed, everyone would be enthusiastic to help him, but Duanmu Huanghun simply had to wait for his turn.</p><br/><p>Duanmu Huanghun was half reclining on a branch, humming a ditty, and enjoying himself. The slight breeze blowing on his face gave him an indescribable sense of comfort. He really liked the tranquillity of the Central Pine Valley. It was like a paradise here, and the war outside did not affect it the slightest bit.</p><br/><p>At this time, lazing around was probably the most beautiful thing in life.</p><br/><p>He thought of the blockhead Ai Hui, who was still struggling in the sword formation. Meanwhile, here he was enjoying this idyllic place.</p><br/><p>He could not help laughing aloud and felt very pleased.</p><br/><p>To be honest, he was very satisfied with the current situation since there was nothing he needed to worry about.</p><br/><p>Since the Jadeite Forest had Teacher to overlook the whole territory, no one dared to attack them. The Duanmu family held a stable position in the Jadeite Forest, so he did not need to worry either. Regarding the war, Shi Xueman was around and only occasionally needed his help. Whether it was the Spear of Heavy Cloud or the Pagoda Cannon Alliance, their structures were stable, their tactics were gradually evolving, and they did not require his involvement. As for the Infantry and Karakorum divisons, what did that have to do with him?</p><br/><p>When he thought it over, it seemed that there was no other better thing to do than to train.</p><br/><p>Duanmu Huanghun reflected for a moment because he did not believe he was actually bored to this extent? He tilted his head, pondered, and had to admit that he was overcome with boredom.</p><br/><p>He thought through it carefully again.</p><br/><p>Well, it seemed like nothing was wrong.</p><br/><p>He was very satisfied with his current condition. Not only his state in life, but also his own condition.</p><br/><p>Strength and advancement in level allowed the once gifted young man to mature.</p><br/><p>Many of his past obsessions were infused with youthful emotions and absurdity. They were witnesses to those hazy green years, coming from vibrant sunshine, disappearing behind in the wind, and leaving a lightly invisible shadow.</p><br/><p>Nevertheless, it was always hard to change the fundamentals.</p><br/><p>At the thought of training, Duanmu Huanghu perked up and sat straight. He stretched out his palm as his previously lethargic look turned serious. His gaze was as sharp as a sword.</p><br/><p>Snap. He snapped his fingers gently.</p><br/><p>A little green light emanated in between his fingers. Fresh and green shoots bloomed from his palm and circled around like a sparkling translucent jade bracelet. Green leaves were swaying like the wind, turning into bits of green light that surrounded his palm.</p><br/><p>It sounded like someone was singing softly as the wind lightly blew by.</p><br/><p>A faint green light appeared and seemed liable to vanish at any moment.</p><br/><p>Duanmu Huanghun was unusually focused. He controlled the faint light surrounding the circle. However, the light only lasted for a few moments before disappearing without a trace.</p><br/><p>It still did not work!</p><br/><p>Duanmu Huanghun frowned slightly and wondered where the problem was.</p><br/><p>He was trying to use the [Viridescent Flower, Twining Branches] to recreate the [Breeze of Surveillance].</p><br/><p>The gorgeous, dazzling, and magnificent rain of light swords surprised and shocked not only Madam Ye, Han Li, and other people, but also Duanmu Huanghun.</p><br/><p>That scoundrel actually… could possess such a formidable killer move?</p><br/><p>He was stupefied and in disbelief for a long time. His happiness from entering closed door cultivation to comprehend the [Viridescent Flower, Twining Branches] technique and his joy from ascending to Master had disappeared without a trace.</p><br/><p>Duanmu Huanghun felt so motivated that he could hardly breathe.</p><br/><p>He was determined to create a killer move that was more powerful than what Ai Hui had! Yes, that was right. Not inferior, but beyond.</p><br/><p>How could the majestic Duanmu Huanghun be worse off than Ai Hui? This was his simplest conclusion!</p><br/><p>After making up his mind, Duanmu Huanghun began to ponder carefully.</p><br/><p>Duanmu Huanghun was arrogant and proud, but definitely not stupid. He had always thought that a man could be angry, but not stupid. He was clear-headed enough to know that it was not a simple task to surpass the rain of light swords.</p><br/><p>He eyed the [Breeze of Surveillance] as a solution.</p><br/><p>The [Breeze of Surveillance] was the most powerful killer move of the Surveillance Division. Rumors said it could deal with Grandmasters, but Duanmu Huanghun had scoffed at this claim when he heard of it previously. His teacher was a Grandmaster, so he was very clear about how powerful a Grandmaster could be.</p><br/><p>Regardless, he was greatly shocked when witnessing how the [Breeze of Surveillance] almost decimated the God Wolf and Silverfrost divisions. If not for the fact that there were too few Surveillance Division soldiers to complete the technique, the God Wolf and Silverfrost divisions would have been completely entombed.</p><br/><p>To be able to destroy the God Wolf and Silverfrost divisions with only one killer move caused his thoughts to wander far away.</p><br/><p>These days, as long as he was free, he would run before the huge glimmering wind lanterns to ponder the mystery. The structure of the glimmering wind lanterns was extremely stable, and it was not empty talk that they could stand for a thousand years. Duanmu Huanghun found great inspiration from this extremely special structure.</p><br/><p>However, after thorough research, he discovered that the complexity of the [Breeze of Surveillance] was far beyond his expectation.</p><br/><p>Duanmu Huanghun was rather proud of his knowledge regarding training. In terms of talent and intellect, he did not think he lost to anyone. Continuously running into walls did not discourage him, but aroused his pride and made him even more determined to unravel the mystery within.</p><br/><p>This was one of the reasons why he liked to be in the Central Pine Valley. The Central Pine Valley was peaceful and had abundant elemental energy, allowing him to do some hard thinking.</p><br/><p>Just a few days ago, he finally made a breakthrough and saw a glimmer of hope.</p><br/><p>The faint green halo on his hand was a miniature version of the [Breeze of Surveillance]. Although there was still a long way to go to fully replicate it, this was certainly a good start.</p><br/><p>More importantly, this was the [Breeze of Surveillance] implemented by the [Viridescent Flower].</p><br/><p>Duanmu Huanghun's ambition was not just to copy the [Breeze of Surveillance]!</p><br/><p>Time in the night quietly passed, and that pair of eyes was always focused on the light, just as before. The green light ray on the palm brightened and extinguished, extinguished and then lit up again.</p><br/><p>…..</p><br/><p>The weak sound of the wind came and went, like it was remembering the swan song of the battlefield.</p><br/><p>Fu Sisi took a commanding view that overlooked the valley. Her deep eyes were brooding with unpredictability.</p><br/><p>Wang Erdan, who was on the ground, was ragged and gasping for air. His face was full of despair, yet unwilling to accept defeat. Unfortunately, he had already been pushed to his limits. Fu Sisi had to admit that from Wan Shenwei down to this nameless soldier, they all had a ruthless and courageous attitude which she secretly admired.</p><br/><p>Even if it was at the end of the road or with an axe on their neck, their attitude was still to counterattack bravely.</p><br/><p>It was this valiant attitude that dragged out the whole situation. Since the mission when Wan Shenwei was used to lure She Yu and the soldiers of the Dread Division were used as bait to constantly misleading the Sky Leaf members, all of this had landed her in such a sorry state.</p><br/><p>She hated the Dream members deep down inside, but at the same time respected them. She had seen many cases where people were indifferent to the lives of others, but seeing them treat their own lives so trivially was a first for her.</p><br/><p>The power of the Sky Leaf Division was far beyond the Dread Division. Yet, they were far behind in terms of attitude.</p><br/><p>Nevertheless, it was finally over.</p><br/><p>Her eyes fell on Ye Baiyi, who was being dragged on the ground, and her beautiful eyes suddenly lit up.</p><br/><p>Out of the ordinary as expected!</p><br/><p>She did not hesitate and gently pointed her fingers at Wang Erdan.</p><br/><p>A faint glow suddenly appeared in front of Wang Erdan.</p><br/><p>Wang Erdan, even at his peak, was not much of a match for Fu Sisi, let alone when in such a pitiful state. Still, he did not give up the slightest hope, and a deep roar came from his throat. He was like a beast on the verge of despair.</p><br/><p>He yanked Ye Baiyi in front of him to act as his shield.</p><br/><p>Fu Sisi's face slightly changed as she realized that this was not good!</p><br/><p>A faint glow which lacked finesse struck Ye Baiyi.</p><br/><p>A humming sound that resembled the twilight morning bells of the remote mountains resounded. A bloody glow suddenly lit up on Ye Baiyi's body. Like a bloody mouth, it swallowed the faint light in one gulp.</p><br/><p>The vigorous force was like an avalanche surging toward Wang Erdan and hit him like lightning. He spat out blood instantly, but he still clung to Ye Baiyi and did not have any intention of letting go at all.</p><br/><p>Feeling very dizzy, he took Ye Baiyi and flew backward a few meters before falling heavily on a rock.</p><br/><p>Wang Erdan grunted as blood spilled out from the corner of his mouth.</p><br/><p>The bloody glow within Fu Sisi grew more intense. There were rumors of Ye Baiyi implanting the Heart of God by using all kinds of magical methods, but seeing it was an extraordinary experience. She did not hold back on the previous strike, but it did not hurt Ye Baiyi at all.</p><br/><p>She fell into a trance and imagined that it was not Ye Baiyi in a deep sleep, but actually a terrible ancient beast inside.</p><br/><p>Fu Sisi immediately returned back to reality. If Ye Baiyi were to wake up now, it would be terrible.</p><br/><p>She deliberately avoided Ye Baiyi, but Wang Erdan seemed to have guessed her intention and wielded Ye Baiyi as a shield, keeping his defense airtight. For a moment, Fu Sisi was shackled and did not know what to do with Wang Erdan.</p><br/><p>Fu Sisi converted her rage into sneering laughter, \" Well, well, well, you really deserve to be from the Dread Division. Wan Shenwei has a bunch of good subordinates! I was able to kill Wan Shenwei and Ximen Caijue. Do you think I'm unable to kill all of you? None of you should even think of living!\"</p><br/><p>Suddenly a deep and vigorous voice spoke out, \"\"Did you kill Wan Shenwei and Ximen Caijue?\".</p><br/>\n</div>"}