{"title": "Chapter 655: Fireball", "id": 655, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-655-fireball", "volume_title": "Volume 7", "body": "<h1>Chapter 655: Fireball</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 655: Fireball</p><br/><p>Translator: YH Editor: X, TYZ</p><br/><p>Yu Mingqiu flew into the sky. The outer corner of his eye caught a glimpse of a few other silhouettes which were continuously rising. These people were mostly foreign to him, and their auras were not weak at all. This did not matter to Yu Mingqiu since he left the Jadeite Forest many years ago and therefore did not recognize the large number of newcomers.</p><br/><p>Although he did not recognize anyone, everyone knew who he was. Yu Mingqiu, the one who indulged in writing inelegant poems daily, was the talk of the entire town. However, those who knew slightly more were aware that although Yu Mingqiu appeared immoral, he was extremely powerful.</p><br/><p>More important was Grandmaster Dai's attitude toward him.</p><br/><p>Of the three disciples of Grandmaster Dai,first disciple Lu Chen was content living a simple life and disliked disturbance to his routine. The third disciple, Duanmu Huanghun, was not in the Grandmaster's good books. As such, they did not have a harmonious relationship with each other. Now, he was located miles away.</p><br/><p>The second disciple, Yu Mingqiu, was the most valued by Grandmaster Dai. Many people speculated that Yu Mingqiu had the highest possibility of being the successor of Grandmaster Dai.</p><br/><p>One wood elementalist spoke loudly from afar, \" Sir, any solution?\"</p><br/><p>His voice sounded worried and also attracted the attention of others.</p><br/><p>Yu Mingqiu shook his head. \"Not yet.\"</p><br/><p>He raised his head, retracted his gaze, and solemnly said, \"It should be somewhere high in the sky. I will take a look. As the metal wind is blowing violently, please take note of your safety.\"</p><br/><p>Just as Yu Mingqiu finished his words, he continued to dash upward into the sky. He noticed that the majority stayed put, and only three people followed him. It was evident that these three were sufficiently confident in their own abilities. Yu Mingqiu did not stop them, merely nodding his head before withdrawing his gaze.</p><br/><p>Soon enough, they entered the metal wind layer. The frantic whizzing noise of the metal wind flooded the entire world. A faint green circular light screen lit up around Yu Mingqiu's body, blocking off the metal wind. </p><br/><p>The tiny sun was out of reach just as before. Yu Mingqiu wore a grave expression because he had never traveled to such a high altitude in the depths of space.</p><br/><p>He continued to ascend through the atmosphere.</p><br/><p>A moment later, another wood elementalist could no longer endure and chose to return.</p><br/><p>Metal chops wood, and metal winds were more harmful toward wood elementalists than other normal elementalists. This caused them to ascend with even greater difficulty.</p><br/><p>In no time, another wood elementalist chose to retreat as well.</p><br/><p>Shortly after, the sole remaining wood elementalist could not tolerate it anymore and descended to the ground. Even though his body was facing downward during the descent, he kept his vision fixed on Yu Mingqiu, who was constantly ascending. His state of mind suffered a huge shock.</p><br/><p>Yu Mingqiu was not considered speedy, but there wasn't the slightest sign of him slowing down since the beginning. It seemed like he was strolling idly. The increasingly violent metal wind did not affect him the slightest bit.</p><br/><p>The news of Yu Mingqiu traversing the Wilderness spread throughout the world. It was a pity that only a few people witnessed it, so his real abilities still remained a mystery.</p><br/><p>Having witnessed it with his own eyes, he suddenly realized Yu Mingqiu's power was unfathomable.</p><br/><p>He was oblivious to the fact that it was not as effortless as Yu Mingqiu displayed it to be. </p><br/><p>It was difficult for Yu Mingqiu to judge the distance between himself and the ground at this moment. An approximate estimate would be at least be over 10 kilometers. As he continued to ascend, the surroundings became peaceful. The whizz of the metal wind was largely reduced, but it was even more dangerous and unpredictable.</p><br/><p>As if he was treading on thin ice, Yu Mingqiu was extremely cautious and stared closely at his own light screen. The light screen seemed as if it had been molded by a pair of invisible hands in the seemingly peaceful void of space. </p><br/><p>He had never been to such high altitude location before. Any slight inattentiveness might cause his light screen to shatter, allowing the gusts of transparent metal wind to tear him into pieces.</p><br/><p>Nevertheless, he finally managed to see his target!</p><br/><p>Yu Mingqiu was utterly stunned. The closer he flew, the greater the shock he felt. Just like a burning island in the void space, an incomparably gigantic fireball was hovering nearby.</p><br/><p>Its size was extremely astonishing, causing Yu Mingqiu to feel his insignificance.</p><br/><p>Standing miles away, stream of heat waves which seemed like turbulent tides slapped against Yu Mingqiu's light screen. The protective sphere of light was just like a wavering bubble that might burst at anytime.</p><br/><p>All of a sudden, a soft plant shoot grew right under Yu Mingqiu's feet. Impressively, it was a fresh and green vine. Just like a Boston ivy, the vine grew rapidly along the internal wall of the light screen. The light screen, which was unstable a moment ago, immediately stabilized. The resplendent green vine integrated with the light screen at a speed which the naked eye could see. It then transformed into a sparkling and translucent pattern which was extremely eye-catching.</p><br/><p>Yu Mingqiu's fixated his vision onto the fireball in front of him and was perplexed.</p><br/><p>What exactly was this fireball? Why would it appear over here?</p><br/><p>On the surface of the fireball, golden flames were spat out continuously. Some of these golden flames even exceeded 300 meters and seemed like enormous fire sickles that swept across the spatial void. They effortlessly bisected the threatening metal wind.</p><br/><p>Yu Mingqiu restrained himself and became even more puzzled.</p><br/><p>What an overbearing fire elemental energy!</p><br/><p>What made him even more shocked was that the aura of the fire elemental energy released by this gigantic fireball was almost equivalent to the fire elemental energy flourished by the sun. It was no wonder that they mistakenly believed there were two suns in the sky.</p><br/><p>Yu Mingqiu moved slowly around the fireball and swept his vision across every inch of it.</p><br/><p>The diameter of the fireball exceeded 10 kilometers and was indeed an enormous structure containing admirable power. Soon enough, the attentive Yu Mingqiu made a new discovery. To his surprise, this fireball was actually absorbing the sun's fire elemental energy!</p><br/><p>When the fireball absorbed fire elemental energy from the sun, it would shrink slightly, and the tongues of flame on its surface would start to dwindle. Seconds later, the fireball would start to expand as scorching blazes extended out with a boom, releasing astonishing heat waves.</p><br/><p>Such a repetitive cycle.</p><br/><p>Yu Mingqiu was bewildered. His first reaction was to wonder if this was a living creature. The rhythmic expansion and contraction reminded him of breathing.</p><br/><p>Could it be a new type of dire beast? Or could it be an ancient dire beast?</p><br/><p>He shivered and felt his mouth go dry. The legendary ancient dire beasts were able to transform nature and were way more powerful than the modern elementalist. It would tantamount to a natural disaster for the Jadeite Forest.</p><br/><p>At this moment, his vision swept past the crack between two tongues of fire, and his pupils abruptly shrank. </p><br/><p>When the tongues of fire started to dwindle, he was able to vaguely see the interior of the fireball. The flames inside the fireball were concentrated and limpid, just like golden glass.</p><br/><p>A shrivelled and skinny figure could be strikingly seen.</p><br/><p>Yu Mingqiu was blown away, and his hair from head to toe stood on end. This intense fear was just like an invisible palm firmly grasping his heart. To his surprise, he was unable to breath at that very moment.</p><br/><p>It was actually a person!</p><br/><p>Unexpectedly, such a terrifying phenomena was a human!</p><br/><p>Who? Who could have such high spending power? </p><br/><p>The first name that popped into Yu Mingqiu's head was his teacher, Grandmaster Dai Gang! However, what teacher trained was wood elemental energy, so it couldn't be him. If it had been such an astonishing amount of wood elemental energy, teacher would definitely be able to achieve it, but such extraordinary fire elemental energy…</p><br/><p>Wait a minute, fire elemental energy!</p><br/><p>Yu Mingqiu froze and the next moment, rigidly staring at the vague silhouette in the fireball. Even though he could only see a fuzzy image, he was still able to make out the figure's short and small statue. </p><br/><p>Hiss. Yu Mingqiu exhaled and became ghastly pale. He already knew this person's identity now.</p><br/><p>Le Buleng!</p><br/><p>The strongest beneath Grandmaster, Le Buleng!</p><br/><p>The tyrannical, yet pure, fire of the sun proved Yu Mingqiu's conjecture.</p><br/><p>Yu Mingqiu still could not understand how Le Buleng achieved this.</p><br/><p>Upon returning to his senses, Yu Mingqiu's expression changed.</p><br/><p>Le Buleng and Teacher's grudge was well known in this world. There could only be one objective for appearing in the Jadeite Forest.</p><br/><p>He was challenging Grandmaster Dai!</p><br/><p>\"Truly spectacular.\"</p><br/><p>An incredulous exclamation could be heard from behind Yu Mingqiu. He quivered and immediately turned around. Unknowingly, a mild middle-aged man appeared behind him.</p><br/><p>Yu Ming Qiu promptly bowed. \"Teacher.\"</p><br/><p>Dai Gang did not reply to him, staring at the fireball before saying, \"I once thought that there were only one and a half people who could be considered my opponent. In the case of the Holy Emperor, it could be said that I met my match. The other half is Le Buleng. He is the only one who has an unyielding attitude, even after facing defeat.\" </p><br/><p>Yu Mingqiu listened attentively and largely approved. As Grandmaster's Dai disciple, he knew more behind the scenes information compared to an ordinary person. In order to challenge Teacher, Le Buleng had invested a lot of effort and deserved respect.</p><br/><p>From the perspective of the challenged, Le Buleng was undoubtedly an enemy. However, Yu Mingqiu was full of respect with regard to confronting such an enemy.</p><br/><p>Dai Gang's tone was solemn as he said, \"It seems like I have overestimated myself and undermined the heroes in the world. After knowing the words that Le Buleng scolded Wan Shenwei with, I felt so contented that I drank 3 cups of wine in a row. Hmph, how could Buleng's ardent flames be compared to a decaying dead tree?\"</p><br/><p>Yu Mingqiu saw that his teacher's mood was considerably good, felt relieved, and smiled. \"I also heard that from Senior Le before, and it felt refreshing! However, compared to Teacher's, my alcohol tolerance… Hehe.\"</p><br/><p>Dai Gang smiled. Among his disciples, Lu Chen was too honest and simple-minded, while Duanmu Huanghun was overly rebellious. Only Yu Mingqiu, who appeared as frivolous, was actually a straightforward and genuine person who he favored.</p><br/><p>Grandmaster Dai praised him, \"To be able to reach this stage, your improvement is tremendous.\"</p><br/><p>Yu Mingqiu replied, \"Nevertheless, Teacher is still awesome. Upon seeing such a situation, I almost chose to escape, but when I thought of Teacher's daily teachings, I became slightly courageous. Even if I had to sacrifice my life, I still had to scout for Teacher. \"</p><br/><p>He swayed his head and recited poems, but his eyeballs were swivelling rapidly. \"However, seeing that teacher has a plan in mind, I am reassured!\"</p><br/><p>Dai Gang had a headache due to Yu Mingqiu's inelegant poems. He coughed lightly and replied, \"A plan in mind? You are underestimating Le Buleng.\"</p><br/><p>Yu Mingqiu stared blankly, \"Why?\" </p><br/><p>Dai Gang responded, \"What Le Buleng trained are the [Grandmaster Obliteration Flames]. I once thought [Grandmaster Obliteration Flames] is just a spate of nonsense. How could it obliterate a Grandmaster? Hehe. The Golden Crow Fire is extremely overbearing, and its practitioners have to first sustain injury. Now, I realized that I have underestimated him. He has decided to go all-out and is determined to fight to the end. If I did not guess wrongly, he wanted to nurture genuine [Grandmaster Obliteration Flames] by converging such a vast amount of Golden Crow Fire.\"</p><br/><p>Yu Mingqiu listened until his scalp felt a little numb. \"This is gambling with one's own life!\"</p><br/><p>\"This is indeed the case for Le Buleng,\" Dai Gang said as a weak glimmer of hope flashed in his unfathomable eyes. \"He had only two options, adapt or die. His bold character, coupled with his disregard for honor, led him to take such action. Let's go. There's no need to be alarmed as things will play out in due time. If he fails, I'll pay my respects. If he succeeds, then the world shall know of one more miracle, and I shall gain a new opponent.\"</p><br/><p>The wind was gentle and violent at the same time, carrying his laughter far away.</p><br/><p>\"Such an honor!\"</p><br/>\n</div>"}