{"title": "Chapter 674: Grey and Green", "id": 674, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-674-grey-and-green", "volume_title": "Volume 7", "body": "<h1>Chapter 674: Grey and Green</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 674: Grey and Green</p><br/><p>Translator: TYZ Editor: Lucas, TYZ</p><br/><p>Streaks of black fire shot through the sky like dozens of black arrows being fired into the distance. Formless ripples emitted from each streak of black flame, rapidly raising the ambient temperature. A strong killing intent pervaded the surroundings.</p><br/><p>Le Buleng's silhouette paced demonically amidst the dark flames.</p><br/><p>He was facing a lotus flower, and a huge one at that.</p><br/><p>With its fifty-foot-long stalk, Le Buleng thought that the lotus strongly resembled a large boat swaying in the wind. Each one of its plump and tender petals was three feet long and they stacked layer upon layer to form an altar of sorts. In the middle of the flower, atop its green core, stood Dai Gang. The petals wrapped around him, providing protection.</p><br/><p>This was [Revival Lotus].</p><br/><p>It had begun as a netherworld lotus seed, but it had blossomed into something much less nefarious under Dai Gang's nurturance and refinement. Dai Gang had just completed his [White Lotus Reviving Technique] and used it as a vessel for incubation. Having shut off from the rest of the world, he proceeded to \"die\" within the lotus for three years and six months.</p><br/><p>When he returned to the realm of the living, Dai Gang was at the level of a Grandmaster. The lotus that had embarked on this mysterious experience with him had completely transformed into something mystical. It was now one of the strongest treasures in the world.</p><br/><p>A streak of black flame struck one of the petals, creating ripples on its surface. The petal began to wither gradually, but a new one immediately grew to take its place.</p><br/><p>Shrouded by the petals, Dai Gang's expression remained solemn. He separated and pressed his palms together, sending a flurry of petals raining down from up above.</p><br/><p>The seemingly gentle rain of flowers was like an illusion. Its fragrance was utterly captivating. Everytime a streak of black flame shot past, the floating flowers would aggregate around it and snuff the fire out.</p><br/><p>To a Grandmaster, everywhere was a battlefield.</p><br/><p>The two of them were either moving like lightning, chasing each other down hundreds of meters, or engaging in terrifying close quarters combat that produced blinding sparks.</p><br/><p>After his initial testing, Le Buleng became more accustomed to his new body. He was unfamiliar with several aspects of his body after undergoing tempering inside the yin furnace. Luckily, his lifetime of combat experience allowed him to quickly get a knack for his new abilities.</p><br/><p>He appeared above the giant lotus in the blink of an eye with black flames on his arm. Instead of shooting out like before, the flames extended down his arm straight towards his palm, forming a pitch black javelin. The javelin was about four feet nine inches long and had a crystal-like quality.</p><br/><p>Le Buleng was extremely composed. With the utmost confidence in his strength, he engaged his core and launched the javelin!</p><br/><p>His figure was frozen in the air, like something out of an ancient mural. The javelin in his hand had vanished.</p><br/><p>A light, bubbling sound spread through the air, and a small hole could be seen on one of the lotus flower's many petals. The javelin that was formed from black flames effortlessly bore through the lotus flower and pierced through Dai Gang's body.</p><br/><p>Dai Gang looked down and saw a puncture wound the size of a small bowl on his abdomen. Wisps of black flame surrounded the wound, corrupting his body and destroying his inner vitality.</p><br/><p>He ignored the wound after giving it a quick glance.</p><br/><p>An injury like this was no big deal to him.</p><br/><p>The wisps of black flame around the wound were quickly extinguished, and the charred flesh where the wound was was rapidly whitening. Dai Gang's damaged tissues were regenerating at a fast pace, and the wound was fully healed in the span of eight breaths.</p><br/><p>Dai Gang furrowed his brows as he tried to track Le Buleng's swift, erratic movements.</p><br/><p>Le Buleng was moving too fast!</p><br/><p>Dai Gang himself was already considerably fast, yet his speed was miles behind Le Buleng's. This was not something unexpected for Dai Gang since he knew that Le Buleng's body had been tempered to the extreme in the Yin Furnace. Le Buleng could possibly have transcended the physical limits of the human body.</p><br/><p>Le Buleng might have praised Dai Gang's [White Lotus Reviving Technique] as something phenomenal, but surely the way he tempered his own body was phenomenal as well?</p><br/><p>Le Buleng appeared to have the upper hand, but he was in fact unable to find a way to deal with Dai Gang. Inflicting normal injuries on Dai Gang was effectively a pointless venture.</p><br/><p>Le Buleng attempted to use other offensive strategies, but nothing seemed to work.</p><br/><p>At this point, both parties understood that they were in a war of attrition.</p><br/><p>Le Buleng was capable of inflicting damage to Dai Gang, but his terrifying regenerative powers made short work of any such injuries. Similarly, Dai Gang did not have any way to deal with the insanely fast and stalwart Le Buleng.</p><br/><p>Le Buleng once again took the initiative in trying to break out of this stalemate. He soared high into the sky like a rocket.</p><br/><p>Dai Gang inevitably looked up. With the glaring sun shining in Dai Gang's eyes, Le Buleng's figure was soon reduced to a small, black dot.</p><br/><p>What was this fellow trying to do?</p><br/><p>Dai Gang did not dare to underestimate his opponent. Even though their previous engagement was slightly restrained, both parties were able to deduce the full extent of the other's strength.</p><br/><p>Hmm?</p><br/><p>Dai Gang's pupils suddenly constricted.</p><br/><p>This is…</p><br/><p>His brightly lit field of view was rapidly turning dark. Looking down from high up above, one would realize that all the sunlight was gathering towards Le Buleng. Le Buleng's immediate surroundings did not get brighter despite that. Counterintuitively, a thick layer of darkness that appeared to have made its way out of the deepest levels of hell surrounded his figure. Like a black hole, the darkness was so profound that even the slightest amount of light was unable to escape its grasp.</p><br/><p>As if colour had been drained from his vision, the world that Dai Gang saw appeared to have been painted in greyscale. The azure blue sky was now grey, and looked empty and desolate. The flora on the ground below had been stripped of all their verdancy, and the land was coloured ash as far as the eye could see. Thick tree trunks looked like they were molded from clay, and the soft leaves and flowers were like grey paper cuttings. The nearby limestone formations lost their hard edges, making it seem as if they were as easy to snap as a dried twig.</p><br/><p>The vibrant world around him became utterly sinister in an instant.</p><br/><p>Dai Gang felt an unfamiliar yet instinctively abhorring energy building up.</p><br/><p>[Yin Furnace]!</p><br/><p>Dai Gang knew that he was in trouble this time.</p><br/><p>This lifeless, desolate world was no illusion, life force was actually gradually being drained from everything around them. Dai Gang could clearly feel a barrier coming between his connection with the Jadeite Forest. The basis of his power lay on his ability to tap on the wood elemental energy within the Jadeite Forest. The life force within the wood elemental energy was the largest source of his strength.</p><br/><p>Affected by Le Buleng's move, Dai Gang felt his body's regenerative ability decrease significantly.</p><br/><p>Things were going to become much harder for a good while.</p><br/><p>A faint smile crept across Dai Gang's face. It had been a long time since he was cornered like this, so much so that he had forgotten what feeling wretched was like. Upon pre-empting the predicament that was about to befall him, an unfamiliar yet novel feeling of excitement began to flourish within his unfaltering heart.</p><br/><p>Amidst the petals, Dai Gang sat down in a full lotus position. His eyes were neither open nor closed and his expression revealed neither joy nor sadness. His calm demeanor betrayed none of the hecticness that life often brings.</p><br/><p>As though time was going backwards, the fully bloomed lotus flower began to close and returned to the bud stage.</p><br/><p>The lotus flower bud that held Dai Gang fell from the sky, planting itself firmly into the ground.</p><br/><p>The lotus flower bud swayed gently in the breeze.</p><br/><p>The hard earth around the bud turned into soft soil at a leisurely pace and water began to surge out from beneath the soil. In the blink of an eye, the entire area above ground was transformed into a gleaming, shallow pond. One by one, tender, green lotus plants sprouted out of the ground. Their leaves promptly spread out as the plants stood erect against the wind.</p><br/><p>The water's gleam and greenness of the plants continued to spread throughout their desolate surroundings at an alarming rate.</p><br/><p>High up in the sky, Le Buleng was indifferent to the scene playing out below.</p><br/><p>He was enjoying himself profusely. Challenging Dai Gang was his lifelong dream, and he was savouring every moment of this fight with a Grandmaster.</p><br/><p>Le Buleng did not take the hardships and obstacles he had experienced before to heart. He viewed each and every challenge from the previous half of his life as fate's way of refining his very being. Not once did he lose hope, give himself up to anger, or whimper in sorrow. His heart was as pure as that of a newborn.</p><br/><p>He closed his eyes unhurriedly.</p><br/><p>From a bird's eye view, one would see a patch of grey about five kilometers wide.</p><br/><p>The sunlight in the region was not simply gathering around Le Buleng. He was, in fact, devouring every last bit of it.</p><br/><p>The thick darkness that surrounded Le Buleng continued to become denser. As he continued to compress the darkness, Le Buleng's silhouette gradually became clearer. His four limbs were the first to peek out of the darkness, followed by his head, and then his lower body. Upon being compressed to the size of a fist, the darkness no longer changed in size. The fist-sized black hole rotated endlessly, inviting onlookers to have a glimpse of hell.</p><br/><p>This was [Yin Furnace]!</p><br/><p>Boundless power poured into Le Buleng's body, causing every strand of his hairs to quiver.</p><br/><p>He opened his eyes.</p><br/><p>Le Buleng's pupils were pitch dark, and looking into them was like staring into the abyss.</p><br/><p>A ridiculously terrifying aura seeped out of Le Buleng's body, sweeping across the land like a mighty hurricane.</p><br/><p>The sound of crashing waves rang out from below in response. Joining in was a chorus of sweet-sounding bell chimes that reverberated through the air. These sounds were coming from the warm, green orbs of light that sat within the lotus leaves.</p><br/><p>While Le Buleng was busy absorbing sunlight, Dai Gang's lotus leaves had spread out all the way to the edges of his grey domain.</p><br/><p>The area had been split into two parts - a colourless, grey void of a sky and a lush, green pond brimming with lotus leaves.</p><br/><p>A lotus flower bud the size of a small mountain stood loftily amidst the field of lotus leaves, swaying ever so slightly in the wind. In the middle of the sky was the black hole that could devour almost all life. The two sides faced each other in seemingly perfect balance.</p><br/><p>The greatest battle in the history of the Avalon of Five Elements was about to begin.</p><br/><p>Le Buleng raised his hand and extended his fingers.</p><br/><p>With a gentle drop of his wrist, a light drizzle began to fall from the sky.</p><br/><p>Streaks of black flame as fine as cow's hair descended from the void. Scattering across the sky, it looked as if a sheer black cloth was covering the sky and separating light from dark.</p><br/><p>Raindrops continuously fell onto the sturdy, green orbs of light that were wrapped by the leaves.</p><br/><p>The fine drizzle grew heavier and heavier, ultimately turning into torrential rain. A sea of black ink was floating up in the sky, unleashing its payload on the ground below.</p><br/><p>The green orbs of light within the lotus leaves began to dwindle bit by bit as the raindrops devoured their glow.</p><br/><p>A soft whimper could be heard as the last wisp of green light was extinguished from one of Dai Gang's leaves.</p><br/><p>Without the protection of the green glow, the black torrential rain hammered directly onto the lotus leaf. The raindrops pierced countless small holes in the leaf, completely destroying it.</p><br/><p>The stalk disappeared soon after.</p><br/><p>Above the endless black torrential rain, Le Buleng hovered in the air like a god. A steady stream of sunlight continued to fuel the Yin Furnace.</p><br/>\n</div>"}