{"title": "Chapter 680: The End of the Epic Battle", "id": 680, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-680-the-end-of-the-epic-battle", "volume_title": "Volume 7", "body": "<h1>Chapter 680: The End of the Epic Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 680: The End of the Epic Battle</p><br/><p>Translator: TYZ Editor: Lucas, TYZ</p><br/><p>Fu Sisi took a deep breath. She knew what she had to do to prevent a massacre.</p><br/><p>The elemental energy within her body was operating at an insane speed. She cupped her palms in front of her chest with a solemn look on her face, the imprint on her palms suddenly lighting up. A burning flame spontaneously appeared in front of her palms.</p><br/><p>The five-colored flame looked terribly weak, as if it was going to be extinguished at any moment.</p><br/><p>Fu Sisi's face lost a bit of color, but the resolve in her eyes only grew brighter. She thrust her palms forward and sent the flame flying towards the continuously expanding blood ball.</p><br/><p>The flame landed silently on top of the half-foot-wide blood ball.</p><br/><p>In the blink of an eye, the crystalline mass of blood turned into a large, ominous-looking five-coloured glass marble.</p><br/><p>Crack!</p><br/><p>A soft, cracking noise could be heard from within the marble.</p><br/><p>Within moments, the marble's surface became lined with hairline cracks and it fell apart with a splendid crash.</p><br/><p>Fu Sisi heaved a sigh of relief.</p><br/><p>That wisp of five-colored flame from before was was known as [Sky Leaf Glass Flame], and it consumed a great deal of heavenly elemental energy.</p><br/><p>Fu Sisi could not afford to care about such expenditures anymore; what was more important was that it worked.</p><br/><p>\"Steady!'</p><br/><p>The middle-aged man's cry caught her attention. She turned around to see something amazing happen.</p><br/><p>The gigantic and ominous-looking blood eye shot out a pillar of red light that enveloped the entire valley. The blood eye was made up of countless mobile blood swords that swam around each other as if they were a school of fish. Even though they moved about deftly, the blood eye's shape remained the same.</p><br/><p>Within the bloody glow, the Five Elemental Pavilion Lock released threads of five-colored vapor as it melted.</p><br/><p>The Assembly of Patriarchs was frantically pouring elemental energy into it.</p><br/><p>Fu Sisi could see that the Five Elemental Pavilion Lock would not hold much longer. She started to feel anxious.</p><br/><p>The Assembly of Patriarchs' [Five Elemental Pavilion Lock] looked strangely like a secret technique that the Sky Leaf Division would possess… Could Master's Glory have something to do with the them?</p><br/><p>She did not know why such a nonsensical thought would pop into her head at this treacherous juncture, but she did not have the luxury of time to ponder over it anyway.</p><br/><p>The Five Elemental Pavilion Lock was disintegrating faster than the Assembly of Patriarchs could channel their elemental energy. The Five Elemental Pavilion Lock was in imminent danger.</p><br/><p>The middle-aged man's face was losing color fast. [Five Elemental Pavilion Lock] was supposed to be used to suppress members of the Sky Leaf Division. It was meant to defend against attacks coming from within it, and not the other way round.</p><br/><p>The thinned-out pavilion lock split into two halves with a pop before completely dissolving in the bloody glow.</p><br/><p>\"Watch out!\"</p><br/><p>Just as Fu Sisi's reminder hit the air, the dense bloody glow rammed directly into the Heavenly Elemental Shield.</p><br/><p>An electrifying sound echoed through the valley!</p><br/><p>Five-colored flames rose out from above the Heavenly Elemental Shield. Where the two met, the bloody glow was dyed multi-colored before being burnt and vanishing in a puff of smoke.</p><br/><p>The Sky Leaf Division's morale soared, but Fu Sisi was not ready to celebrate just yet.</p><br/><p>The dense bloody glow disappeared just as her defensive preparations were complete.</p><br/><p>She was momentarily dazed before she looked towards the Jadeite Forest in surprise.</p><br/><p>Up on the blood eye, Ai Hui gazed upon the distant Jadeite Forest.</p><br/><p>The magnificent glow on the horizon that continued non-stop for three days and three nights was like a glorious fire that seemed to rage on endlessly.</p><br/><p>After the initial excitement, people eventually got used to its presence. The mundane affairs in the everyday lives of the people took precedence over the lofty matters of the Grandmasters. People still brought the topic up occasionally to express their incredulity and attempt to discuss these things that were beyond what they might ever know.</p><br/><p>At the edge of a city, a couple sat side-by-side on a rock atop the peak of a mountain. The gentle evening wind caressed their cheeks as they looked out into the horizon.</p><br/><p>The young man said, \"It's as beautiful as the warm glow of sunset.\"</p><br/><p>The young lady replied, \"It's even more beautiful than that. It's more like nuee ardente, perhaps even beautiful.\"</p><br/><p>\"That's a battle between two Grandmasters, a battle between two of the strongest people in the world.\" The young man's eyes were filled with a powerful yearning.</p><br/><p>In response, the young lady said, \"Do Grandmasters get married and have kids? Do they have people they like?\".</p><br/><p>The young man thought for a moment before answering, \"I doubt it. How can one become a Grandmaster if yoked by the burden of relationships?\".</p><br/><p>\"Humph, I don't believe you. Isn't a Grandmaster still a person? Why can't they have someone that they like?\" the young lady said as she wrinkled her nose.</p><br/><p>The young man said, \"Master once told me that the path to greatness is a lonely one, and that there can only be success with sacrifice. If a Grandmaster's achievements are unparalleled, then the sacrifices he makes must be unparalleled as well.\"</p><br/><p> Entranced by the scene before her, the young lady fell silent. A short while later she whispered, \"Don't become a Grandmaster.\"</p><br/><p>\"You say that as if I have a shot,\" the young man chuckled.</p><br/><p>Turning to face him, the young lady asked seriously, \"Are you going to become a Grandmaster?\"</p><br/><p>The young man frantically surrendered. \"I won't, I won't. Not even if I was offered a chance to. Whoever becomes a Grandmaster is a fool!\"</p><br/><p>The young lady smiled sweetly as she leaned against her boyfriend. Looking down into the peaceful city below, she felt exceptionally tranquil.</p><br/><p>\"You said so yourself.\"</p><br/><p>\"Of course!\"</p><br/><p>A glaring, white light burst forth from the horizon just as he finished his last syllable.</p><br/><p>The young lady cried out in shock and buried her face in the young man's chest. The young man quick-wittedly took her into his arms and rolled them both behind the rock.</p><br/><p>They hid for a long time before peeking out from behind the rock.</p><br/><p>The magnificent glow that had ebbed and flowed was gone. The evening's afterglow enveloped the sky once again.</p><br/><p>They looked at each other in dismay, their faces drained of color.</p><br/><p>As they made their way down the mountain, they noticed that the city was bustling with life. People were making their way out of the houses, leaping onto roofs and taking to the skies to get a better look at the horizon.</p><br/><p>The battle between the two Grandmasters had come to an end.</p><br/><p>Everyone was engaged in intense discussion about what was going on. To them, the battle between Grandmasters was so far away that it felt like nothing more than an interesting piece of news. The more discerning elementalists were, however, filled with worry and unease.</p><br/><p>Deep down they knew that even though the battle was fought far away, its consequences were hanging above them by a thread.</p><br/><p>Now that the battle had ended, was it going to be a meat pie or a guillotine that fell?</p><br/><p>The majestic Cold Palace was as cheerless as usual. Bright and beautiful sunshine lost a great deal of its warmth and color upon shining into the palace.</p><br/><p>Bei Shusheng did not mind this. He leaned against the main doors and waited for the sunlight to enter the palace's hall.</p><br/><p>\"Leisurely aren't we.\".</p><br/><p>A deep voice resounded throughout the air. A figure had seemingly appeared out of nowhere. The man stood with his hands behind his back, standing outside the palace in a casual yet imposing manner.</p><br/><p>Bei Shuisheng stood up and bowed, \"Your Majesty!\".</p><br/><p>\"Dispense the formalities.\" The Holy Emperor walked up to the doorframe and sat down amid the sound of his robes. \"Bring some tea.\"</p><br/><p>Bei Shuisheng smiled and poured a cup of tea. He pushed the teacup across the doorframe and said, \"Please enjoy the tea, Your Majesty.\".</p><br/><p>The Holy Emperor finished his cup in one mouthful, savouring the tea for a good length of time before saying, \"Dai Gang was defeated.\".</p><br/><p>These four words were filled a deep sorrow.</p><br/><p>Leisurely sipping his tea, Bei Shuisheng was shocked by what he had just heard. \"Dai Gang was defeated?\" he blurted out subconsciously.</p><br/><p>\"That's right.\"</p><br/><p>The Holy Emperor pushed the tea cup back across to Bei Shuisheng, signalling for him to pour more tea.</p><br/><p>Bei Shuisheng lifted the teapot hurriedly, spilling a few drops as he poured.</p><br/><p>Seeing Bei Shuisheng turn pale in shock made the Holy Emperor laugh out loud. After regaining his composure, he slowly picked up the teacup.</p><br/><p>Bei Shuisheng was not in the mood to drink tea. He furrowed his brows and muttered to himself, \"How did Dai Gang lose?\".</p><br/><p>The Holy Emperor did not answer and continued savouring his tea.</p><br/><p>Bei Shuisheng repeated his question, this time aloud. \"How did Dai Gang lose?\".</p><br/><p>.Bei Shuisheng's expression was one of utter disbelief.</p><br/><p>The Holy Emperor was thoroughly amused by Bei Shuisheng's expression.</p><br/><p>The Holy Emperor adopted Bei Shusheng when he was just a kid. Ever since he was a child, Bei Shuisheng had demonstrated wisdom and composure years ahead of himself. The Holy Emperor had never seen him like this before.</p><br/><p>Bei Shuisheng raised his head and looked at the Holy Emperor. He repeated himself for the third time, \"How did Dai Gang lose?\".</p><br/><p>The Holy Emperor stopped fooling around and replied, \"I have no idea, but he lost.\".</p><br/><p>He was equally puzzled by the same question. Dai Gang was at the peak of his power, and even the Holy Emperor's chances at defeating him were not high. He would not be able to isolate himself in peace if he did not know that Dai Gang was unable to leave Jadeite Forest.</p><br/><p>How could a newly ascended Grandmaster defeat a Dai Gang, who was at the peak of his power?</p><br/><p>Even fighting for a draw would be difficult.</p><br/><p>Bei Shuisheng slowly digested this piece of news and regained his composure. He mumbled, \"Something unexpected must have happened. Dai Gang must have met with some sort of serious trouble to have lost to Le Buleng. Could Dai Gang have messed up his training?\".</p><br/><p>The Holy Emperor shook his head. \"Dai Gang's methods may seem radical, but they're actually very conservative. Others may have made mistakes, but definitely not him.\".</p><br/><p>Bei Shuisheng softly said, \"Dai Gang's defeat is going to bring some major trouble.\"</p><br/><p>Admiration flashed across the Holy Emperor's eyes. He picked up his teacup and leisurely said, \"Do tell.\"</p><br/><p>Rather than talk about how Dai Gang was defeated, discussion about matters following his defeat was of greater interest to the Holy Emperor. As a ruler, he was not very interested in the smaller details.</p><br/><p>Bei Shuisheng took a while to gather his thoughts.</p><br/><p>The Holy Emperor contentedly sipped his tea and did not rush Bei Shuisheng.</p><br/><p>After a while, Bei Shuisheng's eyes regained their clarity. He suddenly asked, \"How's Le Buleng's condition?\"</p><br/><p>The Holy Emperor was taken aback by the fact that he did not think of this.</p><br/><p>He respected Dai Gang greatly. He felt that the man's talent, intellect, determination, and methods were pretty much on par with his own. Apart from his lack of great ambition, Dai Gang was an excellent individual.</p><br/><p>On the other hand, he disliked Le Buleng's wild personality. Even now, he did not value Le Buleng much.</p><br/><p>Despite that, Le Buleng was still a formidable character. Bei Shuisheng's reminder helped the Holy Emperor identify his own negligence.</p><br/><p>After thinking, he replied, \"Even though he won, Le Buleng must have suffered from grievous injuries. His base level is still unstable since he has just ascended to the rank of Grandmaster. From the way things look, I believe he is in terrible shape.\"</p><br/><p>Bei Shuisheng asked another question, \"Is Dai Gang really dead though?\"</p><br/><p>The Holy Emperor almost blurted out that he could not possibly be alive after such an intense battle. Somehow, the words had stopped right at the edge of his mouth. If the person battling Dai Gang had been the Holy Emperor himself, then there would have been no way he could survive. However, things were different if the victor was Le Buleng.</p><br/><p>That lunatic…</p><br/><p>The Holy Emperor felt a slight headache as he finally realized why he disliked Le Buleng so much. He hated lunatics with a vengeance because they were unpredictable and were capable of doing all sorts of irrational things.</p><br/><p>He rubbed his temples as he replied, \"I have no idea.\"</p><br/><p>Bei Shuisheng guffawed, \"Ha, things are getting interesting.\"</p><br/>\n</div>"}