{"title": "Chapter 689: The Beating Heart", "id": 689, "volume": 7, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-689-the-beating-heart", "volume_title": "Volume 7", "body": "<h1>Chapter 689: The Beating Heart</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 689: The Beating Heart</p><br/><p>Translator: TYZ Editor: Lucas, TYZ</p><br/><p>Thud, thud, thud.</p><br/><p>A sonorous yet restrained sound echoed across the air. It sounded as though a ritual was about to begin. On a high altar, there was a heavy and old-fashioned leather drum. The passing of time had dyed it with a glimmering black color that made it looked as though it was smoldered by flames. A half-naked, muscular man wearing only an animal hide brandished a mallet that was made up of an unknown beast's thigh bone. Every time he beat the drum, his hair would flutter across the air, resembling the licking tongues of fire burning in the braziers around the high altar, wild and devilish.</p><br/><p>A transparent energy ripple propagated from the center of She Yu's body. The air seemed to have frozen, causing one to have difficulty breathing.</p><br/><p>Chi Tong stared at She Yu, looking as though he had seen a ghost.</p><br/><p>Wait, no, he didn't really care about ghosts and spirits.</p><br/><p>He stared at She Yu's chest. A faint, red glow was emitting from her chest. Her fragile-looking skin looked delicate under the red glow, appearing somewhat transparent. If the red glow was absent, her skin would be snow-white and alluring.</p><br/><p>Chi Tong was extremely familiar with the red glow. It had added an aura of extreme danger to this gorgeous and captivating sight.</p><br/><p>Chi Tong could sense a concentrated aura of the God's Blood. No one understood the God's Blood more than him. He could even sense that this red-dressed girl had not fully refined the God's Blood yet.</p><br/><p>If this was really the case, it would be an out-and-out good news to him. If she had fully refined the God's Blood in her body, Chi Tong would have suffered a huge loss.</p><br/><p>But… what was that?</p><br/><p>Something seemed to be devouring the God's Blood in her body.</p><br/><p>Chi Tong wasn't perplexed by the fact that the God's Blood was being devoured, but rather, he was perplexed by that \"something\". He actually did not know anything about it! This made him panic.</p><br/><p>It seemed to exist for only the God's Blood.</p><br/><p>The red-dressed girl did not have much God's Blood in her body. A hair-like trace of the God's Blood was enough to kill a powerful dire beast. However, that \"something\" kept on absorbing the God's Blood in the red-dressed girl's body without apprehension.</p><br/><p>Could it be a dragon's heart? Stop kidding me, how can a piece of trash like a dragon endure my God's Blood?</p><br/><p>Even Chi Tong did not dare to absorb so much God's Blood when he just woke up.</p><br/><p>What the hell was that thing?</p><br/><p>A strong sense of danger engulfed Chi Tong's mind.</p><br/><p>The Assembly of Patriarchs had come up with strategies that specifically focused on him. These strategies were meticulously planned. They involved elemental energy systems, cultivation methods, and even Demonic Consciousness.</p><br/><p>He had witnessed how his fruit of labor that he spent his entire lifetime worth of knowledge and cultivation on became other people's prey. The beating heart beneath her perky chest definitely wasn't something natural. It was a meticulously planned trap, a trap that specifically dealt with the God's Blood. </p><br/><p>Following which, a scene appeared in Chi Tong's mind.</p><br/><p>In a distant past, there was a group of people surrounding the God's Blood. Their eyes were filled with greed and self-restraint at the same time. They did not enshrine and worship the God's Blood. Instead, they were ambitious and arrogant as they tried to tame a boundless ocean.</p><br/><p>This vast and majestic ocean was the power contained in the God's Blood.</p><br/><p>Chi Tong shivered with cold.</p><br/><p>Lunatics! They are a bunch of lunatics!</p><br/><p>Before Chi Tong died in the past, he had come up with different scenarios on the day he was revived. He visualized that people would fear, respect, and revere him. Even if they bore animosity towards him, they would be fearful of him at the same time. Wasn't mankind born with the instinct to revere unknown ancient entities?</p><br/><p>But the reality was different… it was cruel.</p><br/><p>Chi Tong forced himself to calm down. He still did not know who the girl was.</p><br/><p>What exactly is so special about her heart?</p><br/><p>The beating rhythm of her heart was different from before. It was undergoing changes now. If her heart was compared to a boundless and everlasting black hole before, then now it would be an agitated volcano that could erupt at any time.</p><br/><p>Was this kind of thing common or uncommon?</p><br/><p>If it was the former, he still had a chance to struggle for his life. If it was the latter, he would give up all hope.</p><br/><p>Could he snatch it over?</p><br/><p>Chi Tong tried to stop himself from turning around and running away. He needed to verify all the answers himself. He had spent so much time and effort to take over Ai Hui's body and revive, how could he not give it a try?</p><br/><p>After taking a deep breath, he raised his palms. Immediately, a red glow filled the sky.</p><br/><p>…..</p><br/><p>At the Pearl Defensive Line, the three god divisions were resting.</p><br/><p>Recently, many things had happened. Even the eyes of the calmest individual could not help but have a feast. After several discussions, all of the division leaders realized everything that had happened had various deep impacts on the current world situation.</p><br/><p>Putting things in perspective, the battles that happened on the Pearl Defensive Line seemed to have become insignificant. Both the elementalists and the blood elementalists would be completely helpless against a Grandmaster.</p><br/><p>The nature of the war did not change, but rather, the number of Grandmasters in this world had changed.</p><br/><p>The birth of a new Grandmaster could cause many sudden changes in the current situation, making it unpredictable.</p><br/><p>As division leaders, they detested this kind of turn of events utterly. It was as thought the blood they bled, the sweat they shedded and the life-and-death struggles they went through had become worthless overnight.</p><br/><p>It was apt to regard the world situation as a chessboard and everyone else as the chess pieces. Those who were ambitious would still hope they were important chess pieces that could affect the chessboard in one way or another.</p><br/><p>However, it was unreasonable for the chessboard to change just like this.</p><br/><p>The only thing that consoled them was that the situation on the elementalists' side had worsened. Ai Hui's sudden departure had thrown them into a rudderless state. The Sword of Lightning was busy searching for Ai Hui and they were no longer harassing the blood elementalists.</p><br/><p>Since Her Highness She Yu had not reacted yet, they did not dare to make any decisions on their own. Therefore, they were relaxed for the time being.</p><br/><p>Since neither side was in the mood to battle, the Windy Pearl Bridge, which had been engulfed in the flames of war for quite some time, suddenly quietened. It was a rare sight.</p><br/><p>Some people were completely forgotten by everyone else.</p><br/><p>About five kilometers beneath the encampments of the god divisions, there was an underground cavern. Sunlight couldn't reach this place at all, but thanks to the presence of earth fire it wasn't extremely cold. Craggy, oddly shaped, black-colored volcanic rocks could be found everywhere. Due to the constant water corrosion by the underground river, the sturdy volcanic rocks had developed sharp edges. Meanwhile, the volcanic rocks at the other end of the cavern were smooth and rounded thanks to the polishing job done by the metal winds.</p><br/><p>In that direction, there was a crevice that led to the valley beneath the Windy Pearl Bridge. The metal winds from the valley entered the cavern through the crevice and slammed against the irregularly shaped rocks in the cavern, giving off ghost-like wails and wolf-made howls.</p><br/><p>In this vile cavern, where metal winds blew incessantly, earth fire erupted occasionally, and water vapor pervaded the air, there was a group of people sitting calmly on the ground. Their leader was Shi Beihai.</p><br/><p>Above the ground, He Nanshan and his counterparts often discussed the North Sea Division's possible hideouts. They had racked their brains but to no avail. Rescuing Commander Ye was their most important mission, and they did not dare to treat it with negligence.</p><br/><p>However, they did not expect the target they had been arduously searching for to be right beneath their feet, less than five kilometers away.</p><br/><p>The combined presence of water elemental energy, fire elemental energy, and metal elemental energy had caused the environment of the cavern to be extremely vile. However, it also formed an exceptional natural barrier against the outside world.</p><br/><p>Even in such a dire straits, Shi Beihai was still sitting upright and recuperating while having his eyes closed. Ye Baiyi was lying unconscious beside him. There wasn't a single speck of dust on his body and his white robe was sparklessly clean.</p><br/><p>Shi Beihai's composure boosted everyone's confidence.</p><br/><p>Hiding beneath the enemy encampment was a brilliant move that made use of the enemy's blind spot. One would require both courage and luckto pull this off.</p><br/><p>They had never doubted Shi Beihai's courage. However, his luck was exceptionally good as well. This made everyone grin from ear to ear, boosting their morale in the process. For the sake of safety, everyone spoke in a soft volume, but their tones were still very relaxed.</p><br/><p>\"Sigh, whenever I think of the fact that we're sitting beneath their butts, I feel like giving them a stab. What should I do?\"</p><br/><p>\"Most importantly, what should we stab them with? And how should we do it?\"</p><br/><p>\"Both of you are cancerous to the North Sea Division! Hey, Erdan, what's that look on your face? The North Sea Division's culture isn't what you think it is…\"</p><br/><p>\"There's no need for you to explain anything, the North Sea Division is indeed unpredictable.\"</p><br/><p> ...</p><br/><p>Everyone stopped chatting and shifted their gazes to Shi Beihai.</p><br/><p>Shi Beihai opened his eyes and nodded at them. \"Thank you for your hard work. How was it?\"</p><br/><p>The members of the North Sea Division reported their findings one by one.</p><br/><p>The layout of the underground river system was very complicated and there were many tributaries. Almost all of their equipment was used up and they could only rely on themselves to carry out the exploration. As long as they were in this place, they did not need to worry for their safety. However, it wasn't feasible as a long-term plan. As the enemy forces kept on reducing their searching range, the situation would become more and more dangerous for the North Sea Division.</p><br/><p>Shi Beihai wanted to find an underground river that passed through the bottom of the valley. This way, they could return to the elementalists' encampment safely.</p><br/><p>However, the chances were very slim. Shi Beihai had come across several archived files regarding Windy Pearl Bridge. In the past, the Elders Guild had formed a team of people to explore the underground of the Windy Pearl Bridge, but they couldn't find such an underground river.</p><br/><p>His subordinates were utterly tired and bruised. After suffering a crushing defeat, any tinge of hope, even if it was nonexistent, was extremely precious to them.</p><br/><p>Shi Beihai also wanted to know where the tributaries of these underground rivers led to. This way, he could determine which direction to escape to if they encountered dangers.</p><br/><p>The thick layer of soil and the combined presence of the three elemental energies had isolated them from the enemy forces and blocked their perceptive awareness of the outside world at the same time. They did not know that an earth-shaking change had taken place in the outside world and they also did not know that He Nanshan was no longer in the mood to search for them.</p><br/><p>As such, the North Sea Division still maintained a high level of vigilance.</p><br/><p>Suddenly, Ye Baiyi's body moved.</p><br/><p>Everyone in the cavern stopped talking. They turned around and looked at Ye Baiyi's body attentively.</p><br/><p>Ye Baiyi had not moved for many days already. Not even a single strand of his hair moved.</p><br/><p>If it weren't for the faint sound of his heartbeat, everyone would have thought he had died.</p><br/><p>The sudden movement of his body gave everyone a shock. Subconsciously, everyone scattered and surrounded Ye Baiyi's body. They had attentive looks on their faces. As long as Ye Baiyi did something odd, they would attack him without any hesitation.</p><br/><p>Shi Beihai was doing the same thing as well. Even though he cared for his old friendship with Ye Baiyi and he hoped that Ye Baiyi wouldn't die by his hands, he still wouldn't hesitate to kill him to prevent future repercussions.</p><br/><p>Ye Baiyi was mumbling, but his eyes were still closed. His eyebrows were knitted, appearing to be in great pain.</p><br/><p>\"Be careful! His heart!\"</p><br/><p>In the dark, a flickering, faint, red glow emitted from Ye Baiyi's heart.</p><br/>\n</div>"}