{"title": "Chapter 707: Chapter 707 - Spirit Swords", "id": 706, "volume": 8, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-707-chapter-707-spirit-swords", "volume_title": "Volume 8", "body": "<h1>Chapter 707: Chapter 707 - Spirit Swords</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 707: Chapter 707 - Spirit Swords</p><br/><p>Translator: Irene_ Editor: X, TYZ</p><br/><p>As the sword chimes rang, Ai Hui sensed his surroundings.</p><br/><p>The originally indistinct sword mist formed sword rays. As each sword ray solidified, a chime followed after. It was similar to how a chick cracked its shell and made its first chirp.</p><br/><p>The clear, melodious chimes weren't exactly forceful. Instead, they were like fine rays of sunlight that pierced through the cloud layer. Joy sprouted within Ai Hui as he witnessed this.</p><br/><p>The mist around him raged while the incessant chimes penetrated it. Fine green sword rays bored through the mist endlessly. Upon a closer look, one would notice that they were in all different kinds of shapes, none mirroring another. Some were like needles, hooks, willow tree leaves, and eyebrows, while others were like metal stones, sturdy mountains, and light smoke.</p><br/><p>Ai Hui's state of mind was turbulent from the uninterrupted sword chimes, accumulating indescribable emotions within.</p><br/><p>How bumpy was this road of cultivation?</p><br/><p>Ever since swordsmen had lost their form as well as guidance and waned over the years, Ai Hui's understanding of swordsmanship had come from his own sword embryo.</p><br/><p>The method to cultivate the sword embryo was incomplete and cryptic. Since spiritual elements were no longer the same today, Ai Hui's studies and discoveries were mostly accidental. All along, he had been skating on thin ice.</p><br/><p>The mental knot he had accumulated over a long time was like surging undercurrents that grew ferocious and violent, almost bursting out of his chest and shooting up to the highest of heavens!</p><br/><p>Clang!</p><br/><p>The last sword chime sounded so sharp that he could feel a prick in his brain.</p><br/><p>Ai Hui shuddered and opened his eyes.</p><br/><p>With his somewhat perplexed gaze he swept away the haze, revealing a crystal clear, blue sky that looked like sparkling and translucent ice. Countless sword rays cruised around Ai Hui, fast and agile, like a school of fish.</p><br/><p>The golden light flew toward Ai Hui, as violent as a rainstorm. He could clearly see the tip of the ray becoming fatally bright.</p><br/><p>The bubbling air in his chest was about to explode. He channeled energy with some hand motions before releasing it abruptly. The next moment, the sword rays swimming around him entered his body, as if attracted by magnets.</p><br/><p>Absolutely dazzling green rays shot out from his body, as if there was a big green sun within his body. The light rays around him flowed as an enormous green sword shadow, even bigger and taller than Ai Hui, appeared overhead.</p><br/><p>Buzz!</p><br/><p>A low sword chime jolted Ai Hui. Before he could comprehend what was going on, he felt a gush of abundant force binding him and blurring his vision suddenly.</p><br/><p>A bystander would've witnessed this spectacular sight.</p><br/><p>A bright green ray lit up as quickly as it disappeared, just like a lightning bolt. It pierced the ground, illuminating this bizarre world.</p><br/><p>Boom!</p><br/><p>Ai Hui's mind buzzed. He was delirious, but felt uninhibited. It was beyond refreshing.</p><br/><p>Gradually, his vision returned, and he noticed that he was standing in a big pit. It was over 60 meters deep with straight and smooth walls.</p><br/><p>An isolated, green, miniatureature sword cruised not far away from Ai Hui. He fell into a brief daze before snapping out of it, and the green sword flew toward him, landing on his palm. It fit in his palm perfectly and was entirely green. Neither golden nor made of wood, it was of the most ordinary design.</p><br/><p>Was that the sword ray from earlier? Why didn't it disappear?</p><br/><p>Rumble, rumble.</p><br/><p>Outside the pit and in the distance, a low rumble could be heard. It sounded like an alarmed group of beasts fleeing in disarray.</p><br/><p>Ai Hui leaped lightly, flew out of the pit and looked around. He saw a ball of dust that was wrapped by a black airwave and stacked up like a towering wall. It rolled away while crushing everything in its path.</p><br/><p>The green miniature sword followed quickly behind him.</p><br/><p>What about the golden ringed vines?</p><br/><p>The pit was so even and neat that it seemed to have been sliced out with a sharp knife. Ai Hui walked along the path and knew very well how solid the black rock beneath him was.</p><br/><p>Did he… create this earlier?</p><br/><p>He found it hard to believe.</p><br/><p>Suddenly, he caught a glimpse of a golden light from inside of the pit.</p><br/><p>Eh?</p><br/><p>He jumped into the pit and saw a section of broken vine stuck in the ground. It was about a meter long and was as straight as an arrow. The six golden rings around it were the source of that golden light.</p><br/><p>The golden ringed vines had disappeared, leaving only this section.</p><br/><p>Ai Hui pulled it out. It was heavy in his hand. He tried bending it, but it was extremely tough. If he hadn't seen how the vines had captured their prey, he would have simply dismissed it as a golden arrow shaft.</p><br/><p>Although he knew not how it could be utilized, his instincts told him that this broken vine would be a decent treasure.</p><br/><p>As he was about to put it away, the circling miniatureature sword floated over and pecked at the vine.</p><br/><p>Crack!</p><br/><p>Like a biscuit being munched on by a squirrel, the vine in Ai Hui's hand had become one section shorter. Ai Hui was dumbstruck.</p><br/><p>Did his sword… just eat the vine?</p><br/><p>Crack! Crack!</p><br/><p>Before Ai Hui could react, there was only half a section of vine left in his hand. The tougher-than-steel vine was nothing before the miniature sword.</p><br/><p>Upon witnessing this event, he tossed the remaining vine over to the green miniature sword. A few crunches later, there was nothing left.</p><br/><p>Ai Hui was astonished and intrigued. It was a miniature sword transformed from a sword ray, but it acted no differently than a house pet.</p><br/><p>Having had its fill, the sword looked like a puffed up bird that was on the verge of bursting. It swayed, somewhat adorably, in the air like a drunkard.</p><br/><p>Ai Hui couldn't help but let out a grin.</p><br/><p>The swaying sword exploded all of a sudden, splitting into two pieces.</p><br/><p>Two green lights flashed by as the swords circled and danced around Ai Hui.</p><br/><p>The smile on his face stiffened, and his expression turned sluggish.</p><br/><p>Shortly after he regained his senses, Ai Hui whipped his head around, his ferocious gaze landing upon another nearby plant.</p><br/><p>After a resounding sword chime, the ground shook with a loud boom that reverberated through the rolling smoke and dust.</p><br/><p>Inside the massive pit, Ai Hui found a brown stem. He tossed it in midair and saw four green sword rays interweaving. Crack! The stem was gone in no time.</p><br/><p>Ai Hui opened his eyes wide out of fear of missing any detail.</p><br/><p>He felt that the green sword might transform once more.</p><br/><p>The four swords swayed about. Four claps sounded simultaneously as each sword broke into two pieces.</p><br/><p>Eight green flying swords!</p><br/><p>Ai Hui whistled in satisfaction. He advanced forward without stopping. Upon discovering that the essence of those strange plants could feed his swords, Ai Hui basically went wild. Every plant in his path was swept clean.</p><br/><p>Any danger and uncertainty had been forgotten. All he thought about was increasing the number of green swords.</p><br/><p>His sword embryo, born from incorporeal energies, had entered a whole new realm. It was no longer an abstract theory, but a physical sword.</p><br/><p>It was an essential transformation, from an incorporeal sword to a tangible one.</p><br/><p>Ancient swordsmen believed that a sword embryo was produced from a soul, and the cultivation of the embryo was in fact that of the soul. Since there was a spirit in every soul 1 , the sword was also known as spirit sword.</p><br/><p>The generation of a spirit sword meant that it was no longer within the five elements and was shockingly powerful. Since the sword was also birthed from the swordsman's soul, it was a truly vital sword. When it came to the telepathic connection, even the most refined flying sword was no match for a spirit sword.</p><br/><p>Another astonishing quality of the spirit sword was the fact that it could cause direct damage to the enemy's soul.</p><br/><p>Producing a spirit sword was an achievement ancient swordsmen felt proud of.</p><br/><p>Although the cultivation of a sword embryo was a formidable process, it wasn't widely practiced. Cultivation was arduous and difficult to understand, and because of the danger involved, any carelessness would lead to eternal damnation. The ancient reputable families believed in advancing step by step and believed that accumulated knowledge was the key to success. Yet, the cultivation of a sword embryo was unfathomable and ruthless, so the majority of them did not approve of it.</p><br/><p>When a swordsman's ordinary flying sword was damaged, he could simply get another one. Swordsmen who had spent their whole life nourishing just one sword would receive vital damage. When a spirit sword was damaged, however, it meant that its owner's soul would also have been injured. If minor, his soul would be badly damaged, but if serious, his body and soul would both be destroyed.</p><br/><p>Generally speaking, cultivators of the sword embryo had only one spirit sword. The moment they broke through the abstract theory, their spirit sword would become a tangible existence.</p><br/><p>Ai Hui's sword embryo was very different from others—his was formed from a collection of miniature swords.</p><br/><p>The difficulty of his breakthrough was significantly lower, but the spirit sword he had attained was only partially finished. Looking at his lonely spirit swords and thinking about the countless swords within the embryo, Ai Hui knew that his spirit sword was far from completion.</p><br/><p>That being said, even an incomplete spirit sword provided a huge boost to Ai Hui's strength.</p><br/><p>It turned out that this strange place was an exceptionally good training environment. Ai Hui had managed to increase the number of spirit swords to eight just by killing the odd plants along the way and extracting their essences.</p><br/><p>His sword embryo had possessed yin and yang, thus his spirit sword did as well. Out of the eight swords, four were yin and four were yang.</p><br/><p>After figuring out that the green miniature sword was a spirit sword, Ai Hui made a conjecture with regard to this strange place.</p><br/><p>Snowfalls of different colors would occur once in a while, and his spirit sword liked the snow flowers, too. He gathered that these snow flowers offered nourishment for the soul.</p><br/><p>Although the origin of these magical and beautiful snow flowers was unknown, it was a fact that they had created this amazing world.</p><br/><p>Under the nourishment of the snow flowers, the plants started to gain traces of souls. It was no wonder that they would then start terrorizing one another and displaying animal traits. Since the essences of the plants contained souls, they were the ideal food for Ai Hui's spirit swords.</p><br/><p>The human soul is extremely complex, so having the spirit swords swallow a human soul would hinder their growth and cause heterogenization. When that happened, the swords would turn against their owners.</p><br/><p>The cultivation of a sword embryo had always been deemed as unorthodox, but never evil.</p><br/><p>Nevertheless, the souls within these plants were extremely pure and possessed no self-awareness.</p><br/><p>Ai Hui had never heard of such a strange place.</p><br/><p>He thought back to the time before his coma. Could Chi Tong have pulled him into this land?</p><br/><p>He recalled the ancient records that he had seen.</p><br/><p>During the cultivation era, there was a saying that many and all kinds of worlds existed. Each world was like a small heaven and earth system that cultivators could enter and exit.</p><br/><p>Could this land be a place that Chi Tong had left for himself to nourish his soul? That must be right. Chi Tong's [Deathly Seeds of Demonic Consciousness] and seizing of life for resurrection, don't they both require the nourishing of souls?</p><br/><p>This might not be possible for an ordinary person, but as a demonic god, Chi Tong had had a long life and ample preparation for his revival. It made sense for him to locate a world that had yet to collapse and leave behind a few alternate paths.</p><br/><p>It was highly likely that before his death, Chi Tong had vengefully pulled Ai Hui in.</p><br/><p>The more Ai Hui thought about the possibility of his theory, the better he felt. He cast his gaze ahead and noticed that the scenery had changed quite a bit.</p><br/><p>The vast land before him was his very own granary!</p><br/>\n</div>"}