{"title": "Chapter 710: Trouble", "id": 710, "volume": 8, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-710-trouble", "volume_title": "Volume 8", "body": "<h1>Chapter 710: Trouble</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 710: Trouble</p><br/><p>Translator: YHHH Editor: X, TYZ</p><br/><p>It was an old well that was covered in lifelike, ornate carvings of auspicious beasts. Two prominent words, \"subdue demons\", were written on its side using cinnabar. The words sported an unrestrained calligraphic style, was seemingly written with a fine brush, and had an otherworldly feel to it. Having withstood the test of time, the well was in a desolate state, and the once bright red cinnabar had since dulled.</p><br/><p>Five elemental energy stupas, each representing one of the five elements, stood around the ancient well. The spanking new stupas contrasted sharply with the ruins they were erected in. Like lighthouses, lights of different colours shone atop these structures.</p><br/><p>The five elemental lights were aimed downwards to create a complete five elemental energy ring.</p><br/><p>The five different elemental energies coexisted in harmony, shining unceasingly.</p><br/><p>A bone-piercing cold churned sluggishly at the well's opening. It's depth was so great that the bottom of the well could not be seen. Deep inside, the faint outline of a being could be seen.</p><br/><p>A group of people approached the well. Leading them was Hong Rongyan, and Master Shao walked by his side.</p><br/><p>Hong Rongyan gently asked, \"What do you think of this place, Master Shao?\"</p><br/><p>Master Shao looked composed, but his mind was in turmoil. He took a deep breath and spoke, \"I wasn't expecting you to find such a precious location.\".</p><br/><p>He walked up to the well's edge and observed the rolling white fog. Unable to contain his surprise, he declared, \"What an amazing well! Sealing off the stench of Chi Tong's blood with this well is a stroke of genius. It's no wonder nobody else has gone after the lot of you. To which Cultivation Era sect did this place belong to? How did you find this?\".</p><br/><p>Hong Rongyan shook his head, \"There are too many sects to know for sure. We found this place purely by chance, and amid the ruins found this Demon-subduing Well. Everything else had already been reduced to rubble. Checking the ancient records turned up nothing about the origins of this well.\"</p><br/><p>\"Relics from the Cultivation Era are truly something else.\" Master Shao gushed. Changing the topic, he asked, \"Using the well to suppress the essence of Chi Tong's blood while peeling his physical body away using the five elemental energies to extract the divinity within. Is this your plan?\"</p><br/><p>Hong Rongyan bowed in respect, \"Kindly lend us a hand, Master Shao.\"</p><br/><p>Master Shao was not, \"Your plan is already flawless, even I have nothing more to add.\"</p><br/><p>Hong Rongyan smiled, \"We've met with some trouble.\"</p><br/><p>Master Shao was surprised, \"Trouble?\"</p><br/><p>\"The Banner of God.\"</p><br/><p>Master Shao was momentarily stunned, \"Banner of God? Impossible. Chi Tong had abandoned the banner when he severed his karmic ties to achieve reincarnation.\"</p><br/><p>Hong Rongyan sighed ruefully, \"Yeah, that's what the records say as well. Sadly, things are different in reality and this was something even Chi Tong did not expect. His host, Ai Hui, happened to be the new owner of the Banner of God. Through some unknown means, Chi Tong managed to get the banner to protect him once again.\"</p><br/><p>Hearing the name \"Ai Hui\" made Master Shao's eyes light up, but the spark was gone in an instant.</p><br/><p>Hong Rongyan detected Master Shao's subtle reaction and nodded, \"I see you've heard of the Lightning Blade too. Ai Hui is an extremely talented individual, and is easily one of the strongest members of the new generation. It's a pity he met Chi Tong and ended up having his soul devoured and his body taken. The thing is, Ai Hui had cultivated a sword embryo and had a pure, refined mind. Chi Tong's soul was as such damaged in the taking over process, and his body has seen started to fall apart. Sigh, this was supposed to be an optimal opportunity for us, but the Banner of God just had to intervene.\"</p><br/><p>Master Shao laughed out loud after hearing Hong Rongyan's explanation. \"Hahaha, so now you're blocked by the Banner of God? Ai Hui may have been unlucky, but it looks like you guys are even worse off! Hahaha!\"</p><br/><p>Hong Rongyan nodded, \"Indeed, the Banner of God is not something to be trifled with. The fusion elemental energy has worked tirelessly to wear it down but till now it has only shown slight signs of declines.\"</p><br/><p>Master Shao replied matter of factly, \"I'd like to help, but my hands are tied. Besides, the banner has already begun to wear out. You're not long away from breaking through.\"</p><br/><p>The puppet on Autumn Water's shoulder had an indignant look on its face. It shouted, \"Don't play games with us old man!\"</p><br/><p>Master Shao replied calmly, \"Young lady, your mud body cannot withstand much God's Blood. How about I help you with a new one?\"</p><br/><p>He chuckled, \"How about a sand puppet. Maybe a sand puppet will be more suitable.\"</p><br/><p>Autumn Water could barely tolerate having to exist in a mud puppet. Master Shao's words had unintentionally torn her psychological wounds open, sending her into a state of rage. She shouted, \"You're just asking for it aren't you!\"</p><br/><p>Autumn Water's expressionless eyes suddenly glowed with anger.</p><br/><p>\"How dare you disrespect Master Shao!\"</p><br/><p>Hong Rongyan snorted coldly. Autumn Water immediately froze in place, the mud puppet seething with fury.</p><br/><p>Master Shao laughed the matter off.</p><br/><p>Hong Rongyan said to him, \"Please stay and give us some pointers, Master Shao.\"</p><br/><p>\"I'd like to observe some of the Assembly's techniques as well.\" Master Shao replied, sounding slightly interested.</p><br/><p>As their subordinates brought Master Shao away, Autumn Water spoke in an oddly composed manner. \"We don't exactly have any way to make sure he helps. We don't have any information about his granddaughter.\"</p><br/><p>\"Right,\" Hong Rongyan nodded. \"Don't worry, he's interested in both Chi Tong and Ai Hui. He'll give in to temptation and attempt to break Chi Tong down once he joins us.\"</p><br/><p>The mud puppet was curious, \"Master Shao's interest in Chi Tong is expected, but Ai Hui?\"</p><br/><p>\"No idea,\" Hong Rongyan muttered. \"Perhaps there's something special about someone who has managed to cultivate a sword embryo and tame lightning.\"</p><br/><p>The mud puppet seemed to be buzzing with ideas. \"A pity Ai Hui's body is going to be destroyed. Wouldn't it be great if we could forge a God Puppet from his body? Wouldn't it be really powerful?\"</p><br/><p>Hong Rongyan ignored the mud puppet. The Assembly of Patriarch's attention had been focused on Chi Tong's reincarnation, causing Master Shao's matter to progress terribly slowly.</p><br/><p>He rubbed his temples in an attempt to alleviate the growing headache. He had exaggerated when he talked about the Banner of God being weakened. The Banner of God was much more resilient than they had expected. It was giving them considerable trouble.</p><br/><p>That was why Hong Rongyan hoped Master Shao could help.</p><br/><p>Once the head of Beast Venom Palace and the man who created the Heart of God, Master Shao was only second to the Holy Emperor in terms of knowledge about God's Blood.</p><br/><p>Master Shao was however, not one to give in easily to others.</p><br/><p>\"What's happening inside?\"</p><br/><p>\"Nothing has happened.\"</p><br/><p>Theoretically speaking, Ai Hui's valiant mind, combined with the sword embryo, should have been able to greatly damage Chi Tong's soul. What's more, Chi Tong had only just reincarnated, and would have been in a state far from his full power.</p><br/><p>Obstructed by the Banner of God, Hong Rongyan thought of another way around. He was going to focus on Chi Tong's soul instead. Although, destroying Chi Tong's soul would also cost them the opportunity to learn how to cultivate [Deathly Seeds of Demonic Consciousness].</p><br/><p>On the other hand, dragging this operation out was disadvantageous too.</p><br/><p>So many days had passed, but the Banner of God's defensive capabilities were as strong as ever. This meant that Chi Tong's soul had yet to be vanquished.</p><br/><p>Hong Rongyan suddenly felt impatient. If only he could go in and take a look.</p><br/><p>Unfortunately, he did not dare to. </p><br/><p>That was the most dangerous place in this world, the true wilderness.</p><br/><p>*************************************</p><br/><p>Human-faced Marshland.</p><br/><p>The unremarkable underbrush suddenly lit up with countless bubbles of light. At the same time, an eerie howl was let loose into the sky, piercing to one's ears. Ai Hui felt as if an awl had been hammered through his heart, the resulting intense pain nearly causing him to black out.</p><br/><p>He was instinctively aware that he was under attack.</p><br/><p>Silver threads of lightning burst forth from deep behind his eyes, quietly shrouding the area around him with a protective presence. The pain in his chest disappeared, and the piercing sound became more subdued. While still terribly unpleasant, it no longer hurt him and now sounded more like an infant's crying.</p><br/><p>On guard, Ai Hui summoned his spirit swords. He had never heard of a place like the Human-faced Marshland and had no idea where he was. The past few days here had however helped him to understand that danger was lurking behind every corner, and that any dropping his guard was likely to land him in an inescapable mire.</p><br/><p>The glowing underbrush shook vigorously like the spikes on the back of an angry hedgehog .</p><br/><p>Crash.</p><br/><p>The entire underbrush rose up from the ground slowly, as though someone was picking it up. Its true form was gradually being revealed.</p><br/><p>A human face, a grotesque, deformed human face.</p><br/><p>To a seasoned exponent like Ai Hui, beauty was abstract concept that had no place in battle. However, seeing this face made him extremely uncomfortable. It was a discomfort that he could not describe.</p><br/><p>The face had all five facial features present, but it projected an otherworldly presence that was disquieting.</p><br/><p>When considered separately, each of its features were perfectly normal, yet when placed together, they gave a sense of complete dissonance. It felt as if they had all been plucked off different faces, and forced together in a haunting composite image.</p><br/><p>The face was enveloped in a rolling gray fog that matched perfectly with the dull, lifeless marshland. In sharp contrast however, was the face's vibrant glow that shone through parts of the fog, painting an eerie picture that assaulted the senses and screamed evil.</p><br/><p>The dark green underbrush was the face's hair.</p><br/><p>It grinned at Ai Hui.</p><br/><p>A shiver ran down Ai Hui's spine. The face was already bizarre enough, and the smile made it look even more terrifying.</p><br/><p>A formless shockwave pressed against Ai Hui.</p><br/><p>A wisp of cold air entered his body, making him shiver. It exploded into tiny fragments the moment he activated his spirit swords.</p><br/><p>Ai Hui opened his eyes but was unable to move. His body had frozen in place like a statue.</p><br/><p>The glowing face made a loud quacking noise, its facial features scrunched up as if it were both laughing and crying at the same time. It shot something out of its mouth that flew at high speed towards Ai Hui.</p><br/><p>That was its tongue.</p><br/><p>The black tongue shot out like an elasticated rope. At its tip was a pitch black hook that was lined with shiny, sharp teeth on the inside.</p><br/><p>They were moving non-stop, biting away at nothing.</p><br/><p>The tongue hooked itself around Ai Hui, and the teeth dug into his shoulders.</p><br/><p>The face's features were twisting around violently as if crazed by the sight of delicious food. The dark green underbrush shook wildly with excitement.</p><br/><p>Ai Hui's spirit swords sensed the imminent danger and autonomously slashed at the tongue. A bright glint could be seen as the pitch black tongue was sliced in half.</p><br/><p>Half of the tongue was still draped around Ai Hui's shoulders, and the teeth continued to gnaw away.</p><br/><p>The severed ends wiggled as new hooks, complete with razor sharp teeth sprouted out of them.</p><br/><p>Just when things seemed like they could not get any worse, the other bushes present in the marshland began to shudder. Human faces leisurely rose up from the marsh one by one.</p><br/><p>Pained, haunting wails rang out incessantly throughout the marshland.</p><br/>\n</div>"}