{"title": "Chapter 712: Monster", "id": 712, "volume": 8, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-712-monster", "volume_title": "Volume 8", "body": "<h1>Chapter 712: Monster</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 712: Monster</p><br/><p>Translator: YHHH Editor: X, TYZ</p><br/><p>This was the largest snowfall Ai Hui had ever encountered.</p><br/><p>Snowflakes fell from the sky, floating down like crimson feathers. Ai Hui's entire field of view was covered in red and he was unable to see further than thirty meters. The graceful red snowflakes twirled and flitted about the air like professional dancers. Occasionally, a group of snowflakes would seemingly bunch together like a flock of birds, only to be blown apart by a gust of wind, disappearing into the sea of red.</p><br/><p>The gentle breeze caressed his ears, whistling softly like a lover revealing her inner feelings.</p><br/><p>The spirit swords surrounding Ai Hui sprang to life, spinning rapidly around Ai Hui as they chased the red snowflakes. This snowfall was very heavy, with snowflakes that were much larger in size than anything he had seen before. They provided a good source of nourishment for the spirit swords. The swords were frantically moving, as if they were hungry children chasing after sweets and treats.</p><br/><p>The beautiful red snowfall was truly a sight to behold. It brought with it oodles of vitality, nourishing everything it fell upon.</p><br/><p>A storm was brewing atop a small hill about a kilometer away from Ai Hui.</p><br/><p>A deep roar made its way through the falling snow. The sound was filled with thirst, excitement, and danger.</p><br/><p>The hissing sound of the wind became much more prominent and the red snowflakes began to swirl with the surging air currents. They circled around the small hill, gradually increasing in speed. A giant red vortex had formed around the hill, and more and more of the red snowflakes were being sucked into its core.</p><br/><p>In the middle of the vortex was a crouching monster… </p><br/><p>The snowflakes entering the vortex congregated to form a red streak that funneled right into the monster's mouth.</p><br/><p>Ai Hui immediately understood that the monster was devouring massive amounts of the snowflakes using the vortex. He had to admit that it was a highly efficient method, one that made his spirit swords' chase look like a mere game.</p><br/><p>He carefully inched towards the monster, using the dense snowfall as cover.</p><br/><p>Ai Hui suddenly stopped dead in his tracks. He sensed that he was on the precipice of entering the monster's detection zone. He had no idea how he knew, but his intuition had sharpened greatly after digesting parts of [Deathly Seeds of Demonic Consciousness].</p><br/><p>Having moved nearer to the monster, Ai Hui could see it a lot more clearly.</p><br/><p>The vortex acted as a funnel of sorts, directing the torrent of red snowflakes into the mouth of a four-legged beast at its base.</p><br/><p>Ai Hui was unable to see the monster clearly, but could roughly see the shape of a lion or a panther.</p><br/><p>Wild beast!</p><br/><p>Ai Hui was shocked to see a wild beast in this world. Since arriving here, he had only encountered strange plant-related creatures. This was the first wild beast he had seen here. Briefly recounting his encounters, Ai Hui began to catch on to something.</p><br/><p>But this was not the time to go into deep thought. Something odd about the wild beast on top of the hill caught Ai Hui's eye.</p><br/><p>The wild beast's body emanated an intense green glow that was in stark contrast to the red of the landscape.</p><br/><p>As it devoured more of the snowflakes, its green glow became even and even more eye-catching. The wild beast appeared to be trembling within the glow, as if it was in immense pain.</p><br/><p>Roar!</p><br/><p>A pain-filled bellow shook the earth and the sky, penetrating the heavy snowfall to reach even the far ends of the land.</p><br/><p>Within the green glow, the wild beast's figure began to blur. It looked as if a stone sculpture was melting.</p><br/><p>Boom, boom, boom. Sounds of explosions could be heard.</p><br/><p>Ai Hui could barely hear the sounds, but the ensuing shockwaves were clear as day. With each explosion came a powerful shockwave that spread in all directions away from the epicenter.</p><br/><p>The shockwaves were becoming more powerful, a sign that the wild beast was too.</p><br/><p>The booming sounds transitioned into low drum beats, that pulsed steadily like heartbeats.</p><br/><p>Amidst the snow, the glaring green glow began to dull, signalling the end of the wild beast's transformation. The heartbeats faded away as the wild beast adjusted to its newfound strength.</p><br/><p>Ai Hui quietly took a step backwards.</p><br/><p>The wild beast did not give off dangerous vibes before its transformation. Now that it had transformed, Ai Hui's intuition told him otherwise. Provoking it was not a wise choice. Ai Hui stepped back because he was not about to engage in a battle with a dangerous wild beast that he had no information on.</p><br/><p>He decided to sneak away before it noticed him.</p><br/><p>Just as he was taking the first step, the snowfall abruptly stopped. Ai Hui was caught completely off guard as his only cover had vanished without warning.</p><br/><p>The snow had gone as suddenly as it had came. Everything on the field that was obscured was now completely visible.</p><br/><p>With the snow out of his sight, Ai Hui could finally see the wild beast clearly.</p><br/><p>It was something he had never seen before. It looked a little like a blank panther, with a body that was pitch black. Throughout its body, densely packed green traces lined its skin like an ominous tattoo. Long, black scales with green hues covered its body from the abdomen to the back like a pair of hands with fingers interlaced. Its paws were covered in an alluring green blaze.</p><br/><p>Its head was however, the strangest part.</p><br/><p>With short hair and human ears, anyone who saw it from the back would think it was a human head.</p><br/><p>Seeing it from the front would completely dispel this idea. It lacked facial features and only had a thick, flat piece of bone where its face should have been. Looking at it made Ai Hui wonder if someone had chopped off the front half of its head. The only feature it had was the pair of bright green eyes inlaid at the top of the bone.</p><br/><p>A strange feeling welled up within Ai Hui.</p><br/><p>He stared at the monster that was glaring right back at him. The sudden absence of snow allowed the two to have a staring competition.</p><br/><p>The monster's eyes flashed brilliantly.</p><br/><p>Ai Hui reacted immediately, dodging to the side with a tap of his feet.</p><br/><p>A focused beam of light struck the exact spot where he had been standing.</p><br/><p>There was no explosion, but a fifty meter wide pit had appeared around the point where the light beam landed.</p><br/><p>Ai Hui began moving without hesitation, activating his spirit swords with a mental command.</p><br/><p>Closely packed sword chimes rang out one after another as powerful sword rays flew towards the monster. They rained down onto the top of the hill like shooting stars.</p><br/><p>The monster appeared to have been shocked by the incoming attack. However, it managed to promptly react, unleashing an angry howl.</p><br/><p>Ai Hui noticed that it was not a sound that was coming out if its non-existent mouth. The howl was actually a type of psychic attack.</p><br/><p>The monster was clearly in an angry state. It was extremely warlike and appeared to relish the fight that was to come. To the monster, Ai Hui was also a strange, unknown creature that presented a very real threat.</p><br/><p>The green traces throughout its body spontaneously lit up, projecting a complex green pattern up into the air. The lines of light intertwined ceaselessly, weaving themselves into a barrier.</p><br/><p>A sword ray slammed into the green barrier.</p><br/><p>Ripples could be seen on the surface of the barrier where the sword ray had struck.</p><br/><p>Ai Hui felt his spirit sword get stuck in some sort of mire, completely unable to expend its energy. It felt as if the spirit sword had been trapped.</p><br/><p>Ai Hui immediately changed tactics. He split up the remaining spirit swords into groups of two, pairing each yin lightning sword with its yang counterpart. The two different sword types circled around each other, getting faster as they fused into a single sword.</p><br/><p>Yin and yang as one!</p><br/><p>A single silver pillar with coarse lightning running over its surface rammed into the monster's green barrier from high up in the sky.</p><br/><p>Boom!</p><br/><p>A large gaping hole appeared in the barrier as the thunderclap faded into the background.</p><br/><p>Another lightning-infused sword ray made its way through the gaping hole, piercing the monster with absolute accuracy.</p><br/><p>There was no place for compassion in Ai Hui's heart at a time like this. He took the opportunity to unleash every last spirit sword at his disposal against the monster. Sword ray after sword ray struck the monster consecutively.</p><br/><p>Boom, boom, boom!</p><br/><p>The deafening explosions created large air currents around the area.</p><br/><p>Howl!</p><br/><p>A furious howl burst forth from the lightning storm on the top of the hill. Ai Hui could not believe that the monster had survived his attack.</p><br/><p>Feeling uneasy, he subconsciously leapt away and recalled his spirit swords to form a shield in front of him.</p><br/><p>A single green light beam swiftly made its way through the air.</p><br/><p>The two spirit swords in front of him were obliterated in an instant.</p><br/><p>His instinctive reaction had allowed him to survive. The green light beam was deflected to his side, once again creating a large pit where it struck.</p><br/><p>In that instant, Ai Hui thought that he was going to die for sure.</p><br/><p>The monster's offensive capabilities were out of this world. That green light beam reeked strongly of death. Ai Hui had tested the durability of his spirit swords and found that they were practically indestructible. In the face of that beam of light however, they might as well have been made of cardboard.</p><br/><p>Given a second chance, Ai Hui did not attempt to escape. Fleeing in an unfamiliar environment was after all, a poor option.</p><br/><p>Furthermore, the monster definitely knew the terrain better than him.</p><br/><p>Ai Hui himself was slightly injured from the loss of the two spirit swords. This was one of the downsides of cultivating a sword embryo. As powerful as the sword embryo was, its inextricable link to its hosts' consciousness meant that injuring it was akin to injuring its host.</p><br/><p>The ash and dust around the monster settled, revealing its figure. It looked a little wretched, its body burnt an ash grey. Lightning was particularly effective against souls, and there was almost nothing they could do about it. Numerous shallow wounds and gashes plastered its body, not particularly debilitating, but plenty.</p><br/><p>The monster stared right into Ai Hui's eyes. Its glowing green eyes shone brighter than ever, reflecting its anger.</p><br/><p>The monster lowered its body and growled. Dense green light flowed out of the traces on its body as its murderous presence skyrocketed. Visible shockwaves in the form of ripples were forming in the air around the monster.</p><br/><p>Ai Hui did not avoid the monster's gaze and stared right back into its brilliant green eyes. Seventy spirit swords floated around him in a deliberate manner. The swords' awe-inspiring consciousness generated an icy cold aura that hung in the air around them.</p><br/><p>Tensions ran high as the two combatants fixed their gazes upon each other. The air reeked strongly of bloodlust.</p><br/><p>The flames that enveloped the monster's feet raged while the monster arched its back, ready to strike. The green lights drew two indistinct lines in the air that quickly faded.</p><br/><p>Ai Hui readied himself, shifting his footing and altering his balance. A flash of silver exploded deep within his eyes as he opened his fingers and sprang off like an arrow. A deafening sword chime resonated into the sky!</p><br/>\n</div>"}