{"title": "Chapter 715: The End", "id": 715, "volume": 8, "url": "http://boxnovel.org/the-avalon-of-five-elements-chapter-715-the-end", "volume_title": "Volume 8", "body": "<h1>Chapter 715: The End</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 715: The End</p><br/><p>Translator: Atlas Studios Editor: Atlas Studios</p><br/><p>As usual, Han Li returned to the city after his training.</p><br/><p>He casually greeted the noodle store's owner—as he always had—and found a seat on his own. A bowl of piping hot noodles was served shortly; its familiar yet still alluring scent pervading the air around it.</p><br/><p>Han Li overheard the other customers' conversations as he quietly ate his noodles.</p><br/><p>\"There hasn't been much happening lately.\"</p><br/><p>\"Yeah, the fighting on the frontlines have stopped for quite a while.\"</p><br/><p>\"Come to think about it, it's almost been a year.\"</p><br/><p>\"That's true…\"</p><br/><p>\"Nothing new regarding Chi Tong or the Assembly of Patriarchs either. How strange.\"</p><br/><p>\"Maybe they're all dead.\"</p><br/><p>\"What about the Pagoda Cannon Alliance?\"</p><br/><p>\"Nope, it's been a long time since they've even made a peep.\"</p><br/><p>\"This is really odd, I feel as though something big is looming.\"</p><br/><p>\"You and your inauspicious remarks! It has been a long journey to attain this peace…\"</p><br/><p>\"I'm just saying, maybe…\"</p><br/><p>Han Li stopped eating for a moment to think. The past year had indeed been too peaceful.</p><br/><p>Initially, people were still actively searching for the Assembly of Patriarchs and Chi Tong. However, as time went by, nobody could even find a single trace of them. The Assembly of Patriarchs had practically vanished from this world. In the meantime, Skyheart City, God Nation, and Jadeite Forest seemed to have coordinated some sort of self-imposed silence.</p><br/><p>As the major players faded into silence, so did the stories that accompanied them. It was the end of an era.</p><br/><p>Everyone had retreated into seclusion, and the clouds moved quietly with the wind. Perhaps a storm was brewing, or the sky was just waiting for the sun to rise. Maybe the world was just waiting for the dawn of a new era…</p><br/><p>[The End]</p><br/><p>Author's Note: I sincerely apologise that this story has to end this way. My health has been terrible these two years, and this is my personal issue to bear. To all my readers, I'm really sorry.</p><br/>\n</div>"}