{"title": "Chapter 1: I'm Bai Xiaochun", "id": 1, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-1-im-bai-xiaochun", "volume_title": "Volume 1", "body": "<h1>Chapter 1: I'm Bai Xiaochun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Mount Hood lay in the Eastwood Mountain Range, and at its base was a quaint little village. The villagers there lived off the land, and didn’t have much to do with the outside world.</p><br/><p>Currently it was dawn, and the villagers were congregated at the village gate to see off a young man of fifteen or sixteen years of age. He seemed thin and weak, but had a healthy, fair complexion, and an overall charming appearance. He wore an ordinary green robe that had apparently been washed so many times it was nearly worn through. Something about the way he was dressed, plus the innocent look in his eyes, made him seem exceptionally quick-witted.</p><br/><p>His name was Bai Xiaochun.</p><br/><p><span id=\"footnote-ref-1901\"><span>“Dear elders and fellow villagers,” he said, “I am on my way to learn about immortal cultivation. I shall miss all of you!” The young man wore a slightly pained expression, as if he couldn’t bear to part with his fellow villagers. This made him look even more charming than before. </span>[1]</span></p><br/><p>The surrounding villagers exchanged glances, shrugged helplessly, and then pretended to look even more reluctant to see him leave.</p><br/><p>A white-haired old man stepped out of the crowd and said, “Xiaochun, ever since your dad and mom left us, oh so long ago, you... you have been, er--” he paused for a moment “--such a good kid!!” Seeing that Bai Xiaochun hadn’t left yet, he continued, “Don’t tell me you’re not interested in living forever? All you have to do is become an immortal, and then you can live forever! That’s a really, really long time! Well, it’s time for you to leave now. Even a baby eagle must learn to fly eventually. No matter what situations you run into out there, you have to hang in there and keep moving forward. Once you leave the village, you can't come back, because your path will always lie ahead, not behind!”</p><br/><p>The old man patted Bai Xiaochun kindly on the shoulder.</p><br/><p>“Live forever....” Bai Xiaochun murmured. A tremor ran through him, and a look of determination slowly filled his eyes. Under the encouraging gazes of the old man and the other villagers, he nodded his head seriously and looked around at everyone one last time. Finally, he turned and walked away from the village.</p><br/><p>As he disappeared off into the distance, the villagers started to look more and more excited. Their forlorn expressions turned to those of joy, and the kind-faced old man began to tremble. Tears even streamed down his face.</p><br/><p><span id=\"footnote-ref-d714\"><span>“Justice from the heavens! The weasel... is finally gone! Who was it that told him they saw an immortal in the area? Whoever it was, I'm going to give you a huge reward on behalf of the village!” </span>[2]</span></p><br/><p>The village was soon echoing with cries of rejoicing. Some people even took out gongs and drums and began banging them excitedly.</p><br/><p>“The weasel is gone,” someone said, “but oh, my poor chickens. He hated the roosters crowing at dawn, so he somehow got all the kids in the village to eat every chicken we had....”</p><br/><p>“Today is the beginning of a new era!”</p><br/><p>By this point, Bai Xiaochun was still fairly close to the village, and could actually hear the sounds of the gongs and drums. He even caught wind of some of the cries of excitement.</p><br/><p>He stopped in his tracks, a strange expression on his face. After a moment, he cleared his throat and proceeded on his way. Accompanied by the faint sounds of rejoicing, he began to make his way toward Mount Hood.</p><br/><p>Mount Hood wasn’t a very tall mountain, but it was covered with thick vegetation. Therefore, despite the fact that it was dawn, beneath the trees, it was dark and quiet.</p><br/><p>“Double-Dog told me that he was hunting some wild pigs a few days ago and saw an immortal flying around....” Bai Xiaochun proceeded along, heart thumping. Suddenly, a rustling sound could be heard from some nearby shrubs. It almost sounded like a wild pig, and it immediately caused Bai Xiaochun to grow extremely nervous. The hair on the back of his neck stood up straight as he asked, “Who is it? Who’s there?!”</p><br/><p>He quickly pulled four axes and six machetes out of his travel pack, but that in and of itself didn't make him feel much safer, so he also produced a bit of black incense from within his robe, which he clutched tightly in his left hand.</p><br/><p>“Don’t come out!” he shouted, trembling. “Don’t even think about coming out! I've got axes and machetes, and this incense can call lightning from the heavens, and even summon immortals! If you dare to show your face, you're dead!” Finally, he turned and ran toward the mountain path, simultaneously juggling all of the various weapons in his hands. Clanking sounds could eventually be heard as axes and machetes began to fall to the ground left and right.</p><br/><p>Perhaps whatever it was that had been rustling around in the shrubbery really did end up getting frightened by him. The sounds ceased, and no wild animal burst out of the bushes. Bai Xiaochun hurried toward the mountain, wiping the sweat from his brow. By this point, his face was pale, and he was almost considering giving up this crazy idea of climbing the mountain, but then he thought about the incense stick, which his parents had handed down to him before they died. Supposedly, it had been passed down from their ancestors, a gift bestowed by a down-and-out immortal they had saved. Before departing, the immortal had given it to them to pay back the kindness they had shown. Furthermore, the immortal had even promised to take a member of the Bai Clan as a disciple. He told them that merely burning the incense stick would summon him to their side.</p><br/><p>Bai Xiaochun had actually lit the incense stick more than ten times in the past few years, and yet, no immortal had ever shown up. It had eventually reached the point that Bai Xiaochun was starting to suspect whether or not the story about the immortal was even true. Finally, he’d resolved to climb the mountain. For one thing, the incense stick was almost used up, and also, there was the matter of the flying immortal being sighted recently.</p><br/><p>And that was how he ended up in his current situation. His theory was that if he could get a bit closer to the immortal, then perhaps it would be easier for that immortal to sense the incense stick.</p><br/><p>Standing in front of the mountain, he hesitated for a moment, then gritted his teeth and decided to keep going. Thankfully, the mountain wasn’t very high, and it didn't take long to reach the peak, where he stopped, panting. He looked at the village down below, and an emotional expression appeared on his face. Then he glanced at the finger-nail sized bit of black incense. It had clearly been burned on numerous occasions, and was almost completely used up.</p><br/><p>“It’s been three years. Bless me, mom and dad. It <em>has </em>to work this time!” Bai Xiaochun took a deep breath, and then carefully lit the incense. A stiff breeze instantly kicked up, and in the blink of an eye, dark clouds filled the sky. Lightning crackled, and deafening thunder boomed in his ears.</p><br/><p>The majesty of the entire scene caused Bai Xiaochun to tremble, fearful that he might be killed by the lightning. He very nearly spit on the incense to extinguish it, but managed to hold back.</p><br/><p>“I've lit this incense twelve times in the past three years, and this is the thirteenth time. I have to let it burn! Come on, Xiaochun! The lightning won’t kill you. At least probably not....” All twelve times that he had lit the incense in the past, there had been lightning and thunder, and yet no immortal had ever appeared. Each time, he had gotten so scared that he spit on the incense to put it out. He actually found it a bit strange that a supposedly immortal stick of incense could be extinguished with some ordinary saliva.</p><br/><p>Bai Xiaochun sat there shaking in fear as the thunder boomed around him. Suddenly, a streak of light appeared in the air off in the distance.</p><br/><p>It was a middle-aged man wearing luxurious clothing. He had the demeanor of a transcendent being, yet he looked weary and travel-worn. In fact, if you looked closely, his eyes seemed to flicker with extreme exhaustion.</p><br/><p>“Finally I can see exactly what moron has been lighting that incense stick all the time for the past three years!”</p><br/><p>Every time the man thought about what he had experienced during the past few years, he got extremely annoyed. Three years ago, he had sensed the medicinal aura of an incense stick he had given away back when he was in the Qi Condensation stage. That immediately caused him to recall the debt he owed back in the mortal world.</p><br/><p>The first time he flew out in response to the incense stick being lit, he had assumed it would be a simple matter of heading out and then immediately returning. He had never imagined that before even being able to find the incense, its aura would suddenly vanish, severing his connection to it. If it had happened only once, it wouldn’t have been a big deal. However, over the course of three years, the aura had appeared more than ten times.</p><br/><p>Over and over again his search was interrupted, ensuring that he was constantly leaving his sect and then going back. Back and forth, back and forth. It was torment.</p><br/><p>As he closed in on Mount Hood, he caught sight of Bai Xiaochun. Fuming with numerous frustrations, the man landed on the mountain top and waved his hand, instantly extinguishing the sputtering incense stick.</p><br/><p>The thunder ceased, and Bai Xiaochun stared at the man in shock.</p><br/><p>“Are you an immortal?” Bai Xiaochun asked cautiously. Still unsure about what exactly was going on, he slipped his hand behind his back and grabbed an axe.</p><br/><p><span id=\"footnote-ref-b6d3\"><span>“You may call me Li Qinghou. Are you from the Bai Clan?” The middle-aged cultivator’s eyes shone like lightning as he measured up Bai Xiaochun, ignoring the axe behind his back. To him, Bai Xiaochun seemed delicate, almost pretty, and reminded him of his old friend from years ago. Furthermore, his latent talent seemed suitable. Li Qinghou’s anger gradually began to fade. </span>[3]</span></p><br/><p>Bai Xiaochun blinked a few times. Although he was still a bit scared, he sat up straight and quietly said, “Junior most definitely is from the Bai Clan. I'm Bai Xiaochun.”</p><br/><p>“Alright, well tell me this,” Li Qinghou said, his voice cool. “Why did you light that incense so many times over the past three years!?” He very much wanted to know the answer to this question.</p><br/><p>As soon as Bai Xiaochun heard the question, his mind spun as he tried to come up with a good answer. Finally, a melancholic expression appeared on his face, and he looked down toward the village at the bottom of the mountain.</p><br/><p>“Junior is a sentimental and righteous person,” he said. “I simply couldn’t bear to part with my fellow villagers. Every time I lit the incense, I was overwhelmed with feelings of sorrow. The mere thought of leaving them behind was far too painful.”</p><br/><p>Li Qinghou stared in shock. He had never considered such a possibility, and as such, the anger in his heart faded even more. He could tell from this young man’s words alone that he was definitely good material.</p><br/><p>However, the next thing he did was send his divine sense down toward the village, and he heard the sounds of drums and gongs and rejoicing. He even heard the villagers talking about how glad they were that ‘the weasel’ was gone. An unsightly expression appeared on his face, and he felt a headache coming on. He looked back at the charming and pure Bai Xiaochun, who seemed like he wouldn’t hurt a fly, and suddenly realized that this kid was a villain to the core.</p><br/><p>“Tell me the truth!” Li Qinghou said, his voice echoing like thunder. Bai Xiaochun was so frightened that he started shaking.</p><br/><p>“Hey, you can’t blame me!” Bai Xiaochun said, sounding very miserable. “What kind of crappy incense is this anyway!? Every time I lit it, lightning would start crashing around everywhere! I almost got killed on several occasions! In fact, avoiding that lightning thirteen times was quite a feat!”</p><br/><p>Li Qinghou looked silently at Bai Xiaochun.</p><br/><p>“If you were so scared, then why did you light it over ten times?!” he asked.</p><br/><p>“’Cuz I'm scared of dying!” Bai Xiaochun replied indignantly. “Isn’t the point of immortal cultivation to be able to live forever? I want to live forever!”</p><br/><p>Li Qinghou was once again struck speechless. However, he found the kid’s fascination with living forever laudable, and realized that his personality might change a bit after some hard training in the sect.</p><br/><p>After a moment of thought, he waved his sleeve, sweeping Bai Xiaochun up into a beam of light that shot off into the distance.</p><br/><p>“Alright, come with me,” he said.</p><br/><p>“Where are we going?” asked Bai Xiaochun, suddenly realizing that they were flying. “Ah, we're so high....” The ground was very, very far down, causing the blood to drain from his face. He immediately dropped his axe and grabbed onto the Immortal’s leg.</p><br/><p>Li Qinghou looked down at him clutching his leg. Feeling a bit at a loss, he replied, “The Spirit Stream Sect.”</p><div id=\"footnote-1901\"><br/><p>1. Bai Xiaochun’s name in Chinese is  bái xiǎo chún. Bai is a surname which also means “white.” Xiao means “little.” Chun means “pure”<i class=\"fa fa-hand-o-left\"></i></p></div><div id=\"footnote-d714\"><br/><p>2. The word for weasel is literally “white rat wolf,” the first character being the same character as Bai Xiaochun’s surname<i class=\"fa fa-hand-o-left\"></i></p></div><div id=\"footnote-b6d3\"><br/><p>3. Li Qinghou’s name in Chinese is  lǐ qīng hòu. Li is a very common surname, also the same surname as the Li Clan in ISSTH. Qing means “green, blue, black, azure, etc.” Hou means a lot of things including “time” and “wait”<i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}