{"title": "Chapter 7: Bonding the Turtle-Wok", "id": 7, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-7-bonding-the-turtle-wok", "volume_title": "Volume 1", "body": "<h1>Chapter 7: Bonding the Turtle-Wok</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In the following days, Big Fatty Zhang and the others kept a constant eye out on Bai Xiaochun’s thatched hut. As for Bai Xiaochun, breaking through to the second level of Qi Condensation gave him quite a boost in self-confidence, and he continued to focus on cultivation.</p><br/><p>Currently, he was in his room, wiping the sweat from his brow. He was buck naked, gritting his teeth against the pain as he tried to maintain the posture of the third image in the bamboo scroll.</p><br/><p>His qi vessel was no longer a flowing stream, but rather, a small river. It flowed through his body, and with every rotation, cracking sounds would emanate out from inside of him. His previously rotund body was now thin once again, and in fact, he was even thinner than when he had first arrived in the Ovens.</p><br/><p>However, there seemed to be energy building up in his body. As he continued to practice cultivation, the flesh and muscle that covered his skinny frame pulsed with power. In fact, if you listened carefully, you would even be able to hear the sound of his heartbeat echoing about in his room.</p><br/><p>More and more spirit pressure was condensing inside of him, filling Bai Xiaochun with a feeling of increasing power. After several more days passed, the pain increased to point where it was simply too much, and he had to give up.</p><br/><p>He was left panting, eyes completely bloodshot. He had the strong feeling that he simply couldn't continue on this way. Although he naturally absorbed the spiritual power of heaven and earth while cultivating, that flow simply couldn't keep up with how much power he was wasting. Furthermore, the Ovens’ snack arrangement wasn’t a regular occurrence, and only happened on lucky occasions.</p><br/><p>Most other people cultivated the Violet Qi Cauldron Control Art by practicing it once every few days. Even people who were more devoted would only practice it once per day. In contrast, Bai Xiaochun had been practicing nonstop. It was no small wonder that Big Fatty Zhang and the others were shocked. In fact, many Inner Sect disciples would have been astonished to hear about what he was doing.</p><br/><p>However, having reached this level of cultivation still left Bai Xiaochun feeling insecure and uneasy. After all, he was the type of person who would rather be safe than sorry. Finally, he pulled out the grain of spirit rice that he had enhanced and looked at it for a long moment before using an ordinary wok to cook it up. After the spiritual energy began to waft out of it, he quickly gobbled it down.</p><br/><p>As soon as the spirit rice entered his mouth, it turned into a thick blast of spiritual energy that was exponentially more powerful than ordinary spirit rice. In fact, the two types couldn’t even be considered to be on the same level. As the rumbling sounds echoed out inside of him, he began to practice cultivation. He instantly assumed the posture in the third illustration, and at the same time, began to regulate his breathing.</p><br/><p>Half a month later, deep in the night, a tremor ran through Bai Xiaochun, and he opened his eyes. He suddenly realized that at some indeterminable point, he had actually broken through from the second level of Qi Condensation to the third level.</p><br/><p>This development caused him to go wild with joy. Excitement filled his eyes, and he began to laugh uproariously. Examining himself, he realized that the qi vessel inside of him had thoroughly transformed into a small river.</p><br/><p>The small river circulated through his body at high speed, moving far, far faster than it had before. In fact, he could even send the spiritual energy around to different parts of his body, all with a simple thought.</p><br/><p>“The third level of Qi Condensation! That spirit enhancement was incredible!” He rose to his feet, licking his lips at the thought of producing another spirit-enhanced grain of spirit rice. However, it was at this point that he remembered something the bamboo scroll had mentioned about the growth of internal meridians. Right now, he needed to let his body adapt to the expanded meridians, and temporarily couldn’t continue to practice cultivation.</p><br/><p>Putting his idea about the spirit rice on the back burner, he walked out of his room, all the while looking extremely proud of himself. However, almost as soon as he set foot out the door, he caught sight of the little path outside of the Ovens, and the tree with the hole in it. Although it was late at night, the tree was clearly visible in the moonlight.</p><br/><p>“This won’t do. Xu Baocai’s wooden sword is obviously beyond ordinary. Even being in the third level of Qi Condensation won't guarantee my safety!” Frowning, he stood there in thought for a moment before taking out his own multi-colored wooden sword. Then he looked back at the wok inside his room.</p><br/><p>“I think I’ll feel a bit more confident if I do a second spirit enhancement,” he thought. Without any further hesitation, he retrieved some of the Ovens’ spirit wood.</p><br/><p>After getting fully prepared, he stood in front of his mysterious wok and kindled the fire. Once the design on the wok lit up, he tossed the wooden sword inside.</p><br/><p>However, after waiting for quite some time, there didn’t seem to be any reaction. Bai Xiaochun frowned and looked at the design on the turtle-wok, then glanced down and realized that the fire had already burned out. Nothing but ash remained of the wood. Muttering to himself, he went out to find some more spirit wood. However, after burning several more batches, he didn’t see any difference in the wooden sword.</p><br/><p>“These pieces of firewood are all for one-colored flames,” he thought. “Maybe that’s just not hot enough. Maybe I need the heat... of a two-colored flame?” He left his room again and found a piece of violet-colored firewood, which was relatively rare in the Ovens. In fact, after searching for a while, he could only find a single piece.</p><br/><p>After kindling it, the flame appeared, a two-colored flame that was far hotter than a one-colored flame!</p><br/><p>Almost as soon as the two-colored flame touched the surface of the turtle-wok, the second design began to shine brightly. As for the flame itself, it rapidly began to fade away; apparently the power of the flame was being sucked away. Soon, the two-colored flame had burned out, leaving behind nothing but ash. However, the turtle-wok’s second design was now shining brightly.</p><br/><p>“It worked!” he thought, eyes shining. He quickly put the wooden sword back inside, whereupon silver light began to shimmer. This time, it lasted for several breaths of time longer than the first time he had done the spirit enhancement.</p><br/><p>The light began to dim, but then, it suddenly flared up and shot directly toward Bai Xiaochun. This sudden change occurred so quickly that he couldn’t even react. His vision swam with light as an indescribably cold sensation washed through him. It almost felt as if he were being frozen over. There was nothing he could do to stop it from happening; it felt as if the coldness was viciously grabbing at his insides.</p><br/><p>His face went pale, and his vision blurred. It was as if something inside of him was being sucked out and merged into the turtle-wok.</p><br/><p>Finally, the silver light faded away, and within the wok, the wooden sword appeared, sharper than ever. In fact, it was so sharp that looking at it hurt the eyes.</p><br/><p>Although it was still painted gaudily, the veins of the wood inside had already changed. If you scraped away the paint, you would find that they seemed to be filled with starlight, as if the sword had been thoroughly and completely transformed.</p><br/><p>In virtually the same moment as the new wooden sword appeared, thunder crackled in the air above the south bank of the Spirit Stream Sect. It was almost as if the Heavens were rumbling in rage, causing shock to rise up in the hearts of countless cultivators in the Spirit Stream Sect. However, almost as soon as the thunder crackled out, it was gone.</p><br/><p>As the thunder was booming, a second silver design appeared on the wooden sword. After flickering for a moment, the design faded away into the gaudy paint.</p><br/><p>Bai Xiaochun, however, couldn't even look at the sword. He staggered backward, a grim look on his face. After a long moment passed, he recovered his composure, although fear still lingered in his heart.</p><br/><p>“What did it suck out of me...?” he thought, nervously looking at his reflection in the copper mirror on the wall. After examining himself closely for a moment, he rubbed his eyes, then gaped at his reflection, looking as shocked as a wooden chicken.</p><br/><p>There in the mirror, he could see that at the very top of his forehead was a white hair. Although his face didn't look any different, he couldn't shake the feeling that the white hair made him look at least a year older.</p><br/><p>“My lifespan!!” he murmured, aghast.</p><br/><p>“Just now, my lifespan was reduced. My... my...” He wanted to cry, but no tears would come. His whole purpose in learning about cultivation was to live forever. Now, instead of reaching the goal of living forever, he had actually lost one year of his lifespan, which was a huge blow.</p><br/><p>“Screwed.... How could I ever have imagined that I, Bai Xiaochun, would be so careful in life, only to end up screwing myself like this....” He sat there in a daze for a while before finally chuckling bitterly. After calming himself down, he looked back at the turtle-wok, whereupon a strange gleam gradually rose in his eyes. For some reason, after having some of his longevity sucked away, it now felt like there was some sort of connection between him and the wok, as if he could actually control it now.</p><br/><p>Heart thumping, he extended his hand and pointed a finger at it.</p><br/><p>The turtle-wok immediately flickered, shrank down, and flew toward Bai Xiaochun. In the blink of an eye, it disappeared into the tip of his finger. Eyes wide with shock, Bai Xiaochun leapt to his feet and backed up a few steps. He looked down at his finger, and then back at the empty stove.</p><br/><p>“This... this....” He pointed his finger down at the ground, and a black gleam of light flashed, and a clanking sound rang out as the wok appeared once more.</p><br/><p>After experimenting a few more times, his expression flickered from grim, to delighted, to mournful. Finally, he sighed.</p><br/><p>“Well, I can suck this thing into my body, but the price I had to pay was a year of longevity. How come it still seems like I screwed myself?”</p><br/><p>The next day at noon, Bai Xiaochun was trying to figure out a way to get back the longevity which had been sucked away from him. He was in the middle of doing some research when, all of a sudden, he looked up. He had just sensed that there were eight people heading toward the entrance of the Ovens.</p><br/><p>That was something he would never have been able to detect when only in the first level of Qi Condensation. However, now that he was in the third level, he could instantly sense that one of the eight people was none other than Xu Baocai.</p><br/><p>Almost at the same time, Xu Baocai’s voice suddenly rang out, filled with fury and hatred.</p><br/><p>“Bai Xiaochun, you have Elder Brothers to protect you, but so do I! Today, the enmity between the two of us is going to end permanently!”</p><br/>\n</div>"}