{"title": "Chapter 16: Meticulously Careful", "id": 16, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-16-meticulously-careful", "volume_title": "Volume 1", "body": "<h1>Chapter 16: Meticulously Careful</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun lay there in the courtyard, filled with that obsessiveness of his. His body ached, and yet somehow he could tell that his skin was tougher than before. That made him look forward more than ever to becoming an apothecary.</p><br/><p>After laying there in the courtyard for more than an hour, the shaky, painful feeling eventually faded away. Bai Xiaochun crawled into a cross-legged position, eyes flickering as he patted his bag of holding to produce the medicinal pills and medicinal incense.</p><br/><p>After closer inspection, he took a deep breath, looked around furtively, then headed back into the log cabin, where he once again took out the turtle-wok.</p><br/><p>“I could consume this medicinal pill as is. But after I do a spirit enhancement, it should be able to break my cultivation base through from the third level of Qi Condensation to the fourth. It’s too bad that two-colored firewood is so expensive. The Ovens has some, but I'm not longer a servant there anymore, which makes things complicated.” Bai Xiaochun’s excitement regarding the medicinal pill continued to grow. After a bit of thought, he ceased any hesitation and produced a piece of one-colored firewood.</p><br/><p>“I’ll just do a basic enhancement! That’ll be good enough!” He quickly lit the firewood, and the resulting one-colored flame caused the first turtle-wok design to light up. He opened the medicinal pill bottle and poured out the three medicinal pills it contained, all of which were as large as longan fruits.</p><br/><p>After performing three spirit enhancements, flickering silver designs could be seen on the surface of the medicinal pills. He also enhanced the green incense. In the end, he sat there looking at the four different spirit medicines upon which he had performed a basic enhancement. Finally, he placed the incense stick in front of him and then popped the three medicinal pills into his mouth.</p><br/><p>Then he examined the pictures in the Violet Qi Cauldron Control Art manual, and followed the mnemonics as he began to practice cultivation. Soon, the spiritual energy in his body was seething. He could now maintain the posture for much longer than before, and he could feel his cultivation base rising rapidly.</p><br/><p>After the time it takes an incense stick to burn, the little river of spiritual energy inside of him was flowing through his body, and he could sense that he was nearing a breakthrough to the fourth level of Qi Condensation.</p><br/><p>“I just need to hold on for one hundred breaths of time, and I can break through!” He gritted his teeth as he continued to maintain the posture in the fourth picture. His body was swelling up so much that he felt like a ball, and cracking sounds could be heard inside of him. Great beads of sweat were rolling off of him.</p><br/><p>It was at this point that the spiritual energy began to wane. Bai Xiaochun's eyes narrowed in concentration, and he blew a mouthful of spiritual energy onto the green incense stick in front of him.</p><br/><p>As soon as the spiritual energy touched the green incense, it lit up, causing tendrils of green smoke to swirl about like green snakes. They flew through the air, entering into Bai Xiaochun’s eyes, ears, nose, and mouth, and then turning into strong spiritual energy. Within moments, the river of spiritual energy inside of him had doubled in size.</p><br/><p>Rumbling could be heard as a wind-like shockwave rolled out from Bai Xiaochun, spreading out through the cabin and then into the courtyard. His eyes opened, and they shone with pleasure.</p><br/><p>“The fourth level of Qi Condensation!” he exclaimed, laughing.</p><br/><p>He could immediately sense the spiritual energy surging through him, carrying with it a strong life force. He felt more agile, and when he looked down, he saw black filth caked all over his body. That would be the impurities within his body that had just been forced out.</p><br/><p>His body flickered as he floated out of the log cabin. After tidying up the courtyard a bit, he stood there feeling very energized. He quickly performed an incantation gesture and waved his finger, causing his wooden sword to fly out of his bag of holding in a streak of light.</p><br/><p>He sent it flying back and forth, eyes gleaming with satisfaction. The wooden sword was already extraordinary, but now that it was combined with the cultivation base of the fourth level of Qi Condensation, it possessed an even more striking air.</p><br/><p>“Spirit enhancement is pretty awesome. It would be great if I could use a three-colored flame, though. A medicinal pill like that would be incredible!” The more he thought about it, the more miraculous spirit medicine seemed to be. Regardless of whether it was in pill form or incense form, it was definitely an absolute necessity for practicing cultivation.</p><br/><p>“I'm definitely going to become an amazing apothecary! I’ll concoct a Live-Forever Never-Die Pill! Then I’ll enhance it tenfold--no, wait, I’ll enhance it a hundredfold!” Bai Xiaochun's desire to become an apothecary was growing stronger. Suddenly, he slapped his bag of holding to produce a jade slip.</p><br/><p>It was none other than the jade slip given him by Hou Yunfei when they had gone to the 10,000 Medicines Pavilion together. Inside were images of 10,000 types of plants and vegetation. Only Fragrant Cloud Peak had ancient records of this type, and they were something that all apprentice apothecaries had to master.</p><br/><p>Of course, a mere 10,000 types of plants and vegetation was only the beginning. According to Hou Yunfei, after memorizing those, you could acquire another volume.</p><br/><p>With a look of resolve, he circulated his spiritual energy, and images of various types of plants and vegetation rose up in his mind. He was filled with a strange feeling, as if a whole new page of life had opened up in front of him. There were even descriptions of the medicinal plants needed to trade for an Age-Prolonging Longevity-Enhancing Pill.</p><br/><p>After examining the contents of the jade slip, he realized that memorizing each of the 10,000 items wouldn’t really be that difficult. However, he wasn’t just any old person. His goal was to become a great apothecary who could concoct a Live-Forever Never-Die Pill.</p><br/><p>The vicious determination concealed in his personality once again exploded out. This was not just memorizing a simple list; he had to carefully observe all of the details of each type of medicinal plant. Only after understanding a plant fully could he move on to the next one.</p><br/><p>Back when he had been under such pressure because of Xu Baocai, he had practiced cultivation like mad for the better part of half a year. Now, with even grander aspirations, a similar thing was occurring.</p><br/><p>He studied the medicinal plants down to the tiniest detail, until he could close his eyes and recall an image of each and every one.</p><br/><p>However, he still felt as if that wasn’t enough, and wished he could study the actual items to make his research complete. Unfortunately, there was nothing he could do about that. All he could do was carefully research what he had at his disposal, which included the shapes of the leaves and the patterns of the veins.</p><br/><p>Even that wasn't enough for Bai Xiaochun though. He also studied the roots and the fruits. It was almost as if the plants themselves were right in front of him, several times their normal size and dug up out of the ground for him to study.</p><br/><p>After that, he still didn't feel confident enough. Next, he studied the tiny hairs growing on the plants, and even the tiny pore-like openings beneath them.</p><br/><p>Time passed. Soon, a month had gone by. During that time, he spent time every day practicing the fourth level of the Violet Qi Cauldron Control Art, and was getting much more comfortable with his cultivation base. At the same time, he hadn’t forgotten about the Undying Live Forever Technique. Every day, he endured the pain as he ran around his courtyard practicing it, simultaneously memorizing the plants and vegetation from the jade slip. Unfortunately, the jade slip had no table of contents, so he wasn’t sure exactly how many he had memorized so far.</p><br/><p>In addition to exercising in his courtyard, he would often stop by the spirit field in the corner, where he was growing ten medicinal plants.</p><br/><p>These ten plants were spiritwinter bamboo. He had gone to Fragrant Cloud Peak’s Outer Sect disciple Mission Stele half a month before and selected a simple, non-dangerous mission to get them.</p><br/><p>Bai Xiaochun didn't dare to forget what Li Qinghou had told him. Sect disciples needed to complete at least one mission every half year; it was a sect rule that Bai Xiaochun had kept firmly planted in mind.</p><br/><p>The merit point reward for this mission was significant, and could actually be even higher depending on how many goods were turned in at the end. It was a simple mission, but required quite a bit of time wastage; he had to care for the plants for three months before he could hand the mission in.</p><br/><p>Of course, the spiritwinter bamboo could be catalyzed by a cultivator's spiritual energy, which would make it grow faster. Unfortunately, Bai Xiaochun had no time to test that method, and had simply planted the seeds in his spirit field as soon as he had gotten back.</p><br/><p>“You grow so slowly,” he said, looking down at the spirit field. From the description in the jade slip, he knew that spiritwinter bamboo required a lot of spiritual energy to grow properly. If the soil it was growing in didn’t have strong spiritual energy, then the cultivator would need to add spiritual energy personally.</p><br/><p>He squatted down and picked up a handful of soil from the spirit field. After a moment, he muttered, “I bet this spirit field doesn’t have enough spiritual energy, and that's why the spiritwinter bamboo is growing so slowly.</p><br/><p>“What can I do to get the spirit field’s spiritual energy to be a bit stronger...?” After a moment of thought, his expression lit up, and he extended his right hand, within which materialized the turtle-wok.</p><br/><p>He looked at the wok, and then back at the spirit field, and his eyes began to shine.</p><br/><p>“If this wok can enhance anything, then... I should be able to perform a spirit enhancement on the spirit soil, right?” Feeling very curious all of a sudden, he quickly dug up the spiritwinter bamboo seeds, then filled the turtle-wok with spirit soil and produced a piece of one-colored firewood to perform a test.</p><br/><p>Soon, silver light flashed, and the spirit soil in the turtle-wok glowed with the design of a basic spirit enhancement. The light quickly faded, but the spirit soil clearly emanated a much stronger spiritual energy than before.</p><br/><p>Bai Xiaochun was delighted. Not feeling the slightest bit inconvenienced whatsoever, he quickly began to enhance one wokful of spirit soil after another. After more than an hour had passed, when he was just about out of one-colored firewood, the entire spirit field had benefited from a basic spirit enhancement.</p><br/><p>Of course, that was only the top level of soil. He didn't have enough firewood to go any lower. Therefore, because there was no foundation for the spirit soil, after enough time passed, it would gradually return to normal.</p><br/><p>Even so, the current spiritual energy in the spirit field had undergone a heaven-shaking, earth-toppling transformation, and was so strong that it caused a fragrant aroma to swirl about.</p><br/><p>Bai Xiaochun immediately planted the spiritwinter bamboo seeds again, then stood off to the side watching. It didn’t take long before some tiny buds popped up and began to grow rapidly.</p><br/><p>In the blink of an eye, they were almost a meter tall. In fact, if disciples in the sect who were adept at growing medicinal plants saw what was happening, they would certainly gasp. Even if a cultivator skillfully nourished the plants with spiritual energy, they wouldn’t grow so fast.</p><br/><p>After all... no one in the cultivation world had ever been so extravagant as to perform spirit enhancement on soil, all for the purpose of growing ten stalks of spiritwinter bamboo....</p><br/><p>Not even the famous grandmasters of spirit enhancement would ever think to do such a thing; it was simply far too much of a waste.</p><br/><p>Seeing that the spiritwinter bamboo was now growing well, Bai Xiaochun felt very pleased. He turned back and continued to jog around the courtyard, simultaneously studying the plants and vegetation in the jade slip.</p><br/><p>The sun was setting, and the sky grew dark. Considering that the stalks of spiritwinter bamboo had already grown higher than a meter, and had apparently still not reached its full height, it was hard to say... exactly how tall they would be in three months....</p><br/><p>That night, Bai Xiaochun finally put the jade slip down. After vicious hard work, he had finally thoroughly memorized all 10,000 types of plants and vegetation. He had even found some areas in the descriptions of the medicinal plants that revealed how they conflicted with other medicinal plants.</p><br/><p>“Tomorrow morning, I’m going to go get the second volume about plants and vegetation. I wonder what the test at the 10,000 Medicines Pavilion will be like. Can I really pass it?”</p><br/><p>Bai Xiaochun set his chin and flicked his sleeve. He had just been planning on uttering some bold and audacious words, but then, just couldn’t help but feel a bit anxious. Clearing his throat, he picked up the jade slip again and began to study some more. He just couldn’t shake the fear that some problem would come up in the test.</p><br/>\n</div>"}