{"title": "Chapter 19: The Legend of the Weasel", "id": 19, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-19-the-legend-of-the-weasel", "volume_title": "Volume 1", "body": "<h1>Chapter 19: The Legend of the Weasel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The comfortable life of an Outer Sect disciple on Fragrant Cloud Peak was great for Bai Xiaochun. Although he missed the delicious food he had access to back in the Ovens, everything else was quite satisfactory.</p><br/><p>In terms of his progress in cultivation, and his research into plants and vegetation, he truly felt as if he was living life to the fullest. The only downside was that his courtyard residence was relatively remote, and there was no one around to chat with, so he got bored sometimes.</p><br/><p>“Could it be that all cultivators are so lonely?” he thought, sighing as he stood there in the courtyard looking up into the sky. Somehow, he felt much older and more grown up.</p><br/><p>The winds of autumn had passed, and snow had begun to fall occasionally, causing the temperature to drop significantly. Snowflakes drifted about in the air, and the spiritwinter bamboo in Bai Xiaochun’s courtyard was growing strong and healthy. They were now taller than Bai Xiaochun himself, and emerald green in color. They were like a splash of spring in the middle of the winter cold.</p><br/><p>A month had passed since he had taken first place on the first stone stele of plants and vegetation. However, the second volume of plants and vegetation was much more difficult than he'd anticipated, causing his research to slow. But that didn’t change the most important thing to him, which was that Zhou Xinqi never took back the first place spot on the first stone stele. Unfortunately, Bai Xiaochun still felt a lot of pressure to be able to piece together all of the incomplete medicinal plants that he hadn’t been able to before.</p><br/><p>“I have an amazing reputation now. I can't let that wench Zhou Xinqi surpass me.” From that moment, Bai Xiaochun decided that he would continue to work harder and harder until he reached his secret goal of being able to proudly announce in front of everyone that he was Apothecary Turtle.</p><br/><p>Although his progress with the second volume of plants and vegetation was slow, his cultivation of the Undying Live Forever Technique was rapidly nearing the point where he would be able to achieve a full minor circulation.</p><br/><p>Although the pain only continued to get worse, Bai Xiaochun remained completely focused on the terms ‘undying’ and ‘live forever’.</p><br/><p>“Three more days. According to the description of the Undying Live Forever Technique, in three days I’ll be able to complete a minor circulation.” Bai Xiaochun took a deep breath, gritted his teeth, and continued to speed around his courtyard, simultaneously studying the second volume of plants and vegetation.</p><br/><p>The three days passed by quickly. On the evening of the third day, it began to snow, covering the Spirit Stream Sect in a blanket of shimmering silver.</p><br/><p>Bai Xiaochun was in the middle of running when a tremor ran through him, and he suddenly stopped in place. The pain that he had been enduring for the past eighty-one days suddenly vanished.</p><br/><p>A flow of heat exploded through him, converging on his skin, which felt as if it were broiling in an oven.</p><br/><p>The snowflakes melted before they could even get near him, instantly transforming into a white mist.</p><br/><p>“It worked!” he exclaimed ecstatically, despite his dry throat. Although he felt like he was on fire, when he looked down, he saw a black light flowing over his skin, which circulated around him and then vanished.</p><br/><p>He then poked his arm with his right hand, and could tell how incredibly tough it was. His eyes shone, and shook his arms and legs a bit. Instantly, he could tell that he was much faster than before. He started to run forward, then let out a cry of shock as he appeared several meters away in the blink of an eye.</p><br/><p>He could now move twice as fast as he could before. Completely delighted, Bai Xiaochun ran around a bit to test out his new speed, and was very satisfied.</p><br/><p>Without any further hesitation, he used the Undying Live Forever Technique mnemonic to continue practicing cultivation. This new method involved closing his mouth and nose and then attempting to breathe through his skin. An inhalation and exhalation counted as a minor cycle. He needed to practice eighty-one minor cycles per day for eighty-one days to complete a minor circulation.</p><br/><p>If he could accomplish that, then, combined with the painful minor circulation he had already completed, he would have made his initial success in acquiring the Undying Skin.</p><br/><p>After practicing a few times, Bai Xiaochun got the knack of it and struggled to get through one minor cycle. Afterward, his body seemed much more gaunt.</p><br/><p>He also felt incredibly hungry, and gurgling sounds could be heard coming from his stomach. He ignored that, and continued breathing, causing his body to get even skinnier. After breathing in and out fifteen times, his body looked like nothing more than a bag of bones.</p><br/><p>It was as if all the nutrients that existed inside of him had been sucked out of him. However, his skin looked even more resilient than before.</p><br/><p>Bai Xiaochun couldn't hold on any longer. His vision was fading, and his eyes had turned green from the indescribable hunger which filled him. He was so hungry that he could eat an elephant in a single bite.</p><br/><p>“This isn't working, I'm starving to death!!” He looked around, salivating, only to realize that there was nothing in the area to eat except for the verdant bamboo he was growing, which at the moment looked quite attractive.</p><br/><p>Unable to hold back because of the incredible hunger, he sped over to the spiritwinter bamboo and took a big bite out of one of them.</p><br/><p>Crunching sounds could be heard as he ripped out a huge chunk and began to chomp it down. After swallowing, his face twisted, and he shivered from the bitter flavor.</p><br/><p>“Too bitter.... I need to eat some real food....” He suddenly missed the Ovens more than ever. Never before in his life had he ever been this hungry, so hungry that he felt like he was going to faint. His eyes were turning even more green, and he was panting. Finally, he bolted out of the courtyard.</p><br/><p>Racing down the mountain path at top speed, he would occasionally encounter other Outer Sect disciples. To them, it felt like a wind was blowing past their bodies, and they turned in shock to stare at Bai Xiaochun running off into the distance.</p><br/><p>He raced down the mountain, into the servants’ district and straight toward the Ovens. Not wanting to waste time opening the door, he flew over the main gate.</p><br/><p>The Ovens crew was in the middle of cooking. Now that Big Fatty Zhang and Third Fatty Hei were gone, Second Fatty Huang had become the leader. He was currently ladling out some rice gruel into a bowl, when suddenly a wind blasted in his face, and the bowl was gone, to be replaced by Bai Xiaochun’s gaping mouth.</p><br/><p>“Huh?” Second Fatty Huang was startled, and stood there gaping for a moment. Before anybody could say anything, Bai Xiaochun grabbed one of the nearby woks and began to guzzle it down. Apparently that wasn’t enough, because he then simply dunked his head into the wok, draining the rice gruel....</p><br/><p>One wok, two woks, three woks.... Bai Xiaochun rapidly drank down a hundred woks of gruel. He was like a bottomless pit, and still didn't feel close to being full.</p><br/><p>“Still hungry! This isn't working! I'm so hungry... I need meat!” He looked around frantically and quickly caught sight of the mountains of meat that were his Elder Brothers.</p><br/><p>The fatties of the Ovens stared at Bai Xiaochun in shock. They had seen hungry people before, but had never seen someone this hungry. It was like the ghost of a person who had died from starvation.</p><br/><p>Then they realized that he was staring at them and salivating. Second Fatty Huang suddenly backed up rapidly, simultaneously shouting, “Ninth Fatty, quickly, there’s some spirit food in the kitchen that we prepared for Elder Zhou!”</p><br/><p>Bai Xiaochun’s eyes gleamed, and he immediately charged toward the kitchen.</p><br/><p>Outside, Second Fatty Huang and the others exchanged dismayed glances.</p><br/><p>“Did you see that? That’s the fate in store for people who become Outer Sect disciples. Look at how hungry little Junior Brother is....”</p><br/><p>“You could beat me to death before I agree to become an Outer Sect disciple!” The other fatties were all completely determined to hold fast to their decision, although they felt bad for Bai Xiaochun.</p><br/><p>At the moment, Bai Xiaochun was doing his best to control himself and abide by the six lines of truth from the Ovens. He would only nibble the edges, and not eat the entire item. After all, if he broke the rules, that could implicate his Elder Brothers, which was something he would never do.</p><br/><p>After drinking the gruel and nibbling the edges of the spirit food, Bai Xiaochun’s hunger had been reduced a bit. He could deal with it now, so he walked out of the kitchen, wanting to cry but not able to find any tears. This Undying Live Forever Technique was far too terrifying. Although he didn’t have to deal with any pain now, the hunger was enough to drive a person mad.</p><br/><p>“Second Elder Brother....” he said, looking nervously at Second Fatty Huang.</p><br/><p>Seeing that Bai Xiaochun looked normal again, Second Fatty Huang finally felt relieved. He walked up and patted him on the shoulder in sympathy.</p><br/><p>“Little Junior Brother, don't worry. Thankfully, we were already preparing some food for Elder Zhou. Look at how hungry you are! Ai. From now, you come back more often to fill up, alright?”</p><br/><p>Bai Xiaochun was very moved. However, he gritted his teeth and decided that he would do the opposite. After all, one day if he ever reached the point where he lost control, he might end up clearing out the entire Ovens....</p><br/><p>Second Fatty Huang and the others escorted him out, and Bai Xiaochun sighed continuously as he trekked back up Fragrant Cloud Peak. All of a sudden, the wonderful, carefree feeling from before was gone, replaced by despair. He really was scared of starving himself to death now.</p><br/><p>“I wonder if there really were some Spirit Stream Sect disciples who died from starvation in the past. I definitely don't want to be the first.” Scowling miserably, he was in the middle of trying to figure out how to resolve the food and hunger issue when suddenly he heard a rooster crowing off in the distance.</p><br/><p>The sound caused him to pause in place and slowly turn his head to stare in the direction of the crowing.</p><br/><p>“Chickens....” Looking around to ensure that nobody was watching him, he ducked into a nearby thicket, vanishing with a whoosh. Then he began to slink along like a weasel.</p><br/><p>Moments later, he appeared outside the fence that surrounded Fragrant Cloud Peak’s spirit fowl farm. Inside were a group of chickens strutting around arrogantly, as large as calves, with three-colored tails. Bai Xiaochun eyed them with glistening eyes, and began to salivate.</p><br/><p>“Meat....” he murmured, then began to chuckle, a strange sound that, when coupled with his wide smile, was completely terrifying.</p><br/>\n</div>"}