{"title": "Chapter 13: Youre Coming Too!", "id": 13, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-13-youre-coming-too", "volume_title": "Volume 1", "body": "<h1>Chapter 13: Youre Coming Too!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Supervisor’s Department and the Ovens had been at odds for years. There was a lot of friction between the two, but usually things were kept under control. The worst that ever happened were minor injuries.</p><br/><p>The battle over the trial by fire went on for the time it takes an incense stick to burn. Big Fatty Zhang and the others beat Chen Fei and the Supervisors Department squad until they were black and blue. Only when they forked over enough spirit stones to pay for the main gate were they allowed to leave, cursing the entire time.</p><br/><p>Before departing, Chen Fei looked over at Bai Xiaochun standing there on the bamboo fence, and the hatred in his heart grew deeper. As far as he was concerned, ever since Bai Xiaochun showed up, the Ovens had only become more and more repulsive.</p><br/><p>The fight had attracted quite a bit of attention in the servants district. Many of the servants, upon realizing that the Supervisors Department could do nothing to the Ovens, were angrier than ever. However, other servants were like Hou Xiaomei, and felt that what the Ovens had done meant that they would now have a good opportunity in the trials by fire.</p><br/><p>In fact, when the trials by fire started the following month, the Ovens crew proudly made their way to the starting line.</p><br/><p>The surrounding servants looked at them furiously.</p><br/><p>Big Fatty Zhang cleared his throat, looked around at the other servants, and said, “Ladies and gentlemen, if you get to the top more quickly than us, then you won’t have to buy a spot. We're doing this for the good of the sect! A good struggle will bring out the best of the best!”</p><br/><p>He had been instructed by Bai Xiaochun to word things in such a way, and the result was that the surrounding servants clenched their jaws in anger.</p><br/><p>When the bells began to toll, and the trial by fire began, the Ovens crew, as well as all the other servants, began to race up the mountain as if their lives depended on it.</p><br/><p>Soon, the fatties and Bai Xiaochun were so far ahead they couldn’t even be seen. The other servants smiled bitterly, but continued on with the race.</p><br/><p>Apparently, they had taken Big Fatty Zhang’s words to heart….</p><br/><p>Yet again, the Ovens crew succeeded in spectacular fashion, which caused a huge commotion in the servants district. After all, they had profound cultivation bases, and their physical frames were enormous. No one dared to say anything.</p><br/><p>The Ovens was now more in the spotlight than they had ever been. Although they were well known in the servants district, their current fame surpassed anything from past years.</p><br/><p>Another two months passed, and whenever there were trials by fire, the Ovens crew quickly hurried over. As far as they were concerned, that time of the month was their spirit stone payday.</p><br/><p>Bai Xiaochun was also excited by the buildup of spirit stones. He would soon have enough to buy all of the medicinal plants he needed. Eventually, yet another round of trials by fire began.</p><br/><p>It was currently dawn. Big Fatty Zhang, Third Fatty Hei, and all the other fatties woke up early. Bai Xiaochun joined them, and the nine of them sped along, then split into three groups, with the group led by Big Fatty Zhang heading toward Fragrant Cloud Peak.</p><br/><p>However, a group from the Supervisors Department intercepted them en route. No explanations were given, and fighting broke out immediately. The Supervisors Department held the advantage in terms of numbers, leading to a chaotic battle. Soon, the toll of bells could be heard, causing Big Fatty Zhang to grow so anxious that his eyes were shot with blood.</p><br/><p>As soon as the sound of the bells could be heard, the group from the Supervisors Department scattered. Big Fatty Zhang, Bai Xiaochun and Third Fatty Hei were incensed, but had no time to give chase. They immediately sped toward the trial by fire on Fragrant Cloud Peak. When they arrived at the entrance of the path, nobody was there, so they instantly began to race up the mountain.</p><br/><p>“Those Supervisors Department bastards!” cursed Big Fatty Zhang. “Just wait until we’re done here, I’ll call all the Junior Brothers together and we’ll go beat the crap out of ‘em!” He was pushing so hard that the fat in his body was burning away, making him visibly thinner. However, the result was explosive speed.</p><br/><p>Bai Xiaochun was also furious. He only needed a few more spirit stones to reach his goal. Gritting his teeth, he pushed forward with all the speed he could muster. Keeping pace with Big Fatty Zhang and Third Fatty Hei, he shot up the path, passing one servant after another.</p><br/><p>As soon as they reached the top of the mountain, their faces darkened. Standing there at the peak, blocking the entrance, were three people.</p><br/><p>Standing up front was Chen Fei, flanked by two burly men who appeared to be at the third level of Qi Condensation. As soon as they saw Bai Xiaochun and the others, they started laughing uproariously.</p><br/><p>“Big Fatty Zhang and Bai Xiaochun are here! Well, don’t worry, we still have spots left. You want one?”</p><br/><p>Big Fatty Zhang gritted his teeth. Eyes bloodshot, he yelled, “Despicable! Shameless! You flunkies!”</p><br/><p>“Hey, since this isn’t breaking sect rules, then if you people from the Ovens can come here, then so can the Supervisors Department!”</p><br/><p>“Hahaha! This business belongs to the Supervisors Department now!”</p><br/><p>When Bai Xiaochun and the others heard the mocking laughter of Chen Fei and his friends, their rage burned. Now it was obvious why the others from the Supervisors Department had ambushed them on the way here. It was all a big plot!</p><br/><p>Big Fatty Zhang let out a bellow of rage and was just about to attack Chen Fei. As far as he was concerned, a fight at this point was unavoidable. Furthermore, he had no way of knowing how often the same thing would happen again in the future. It was essentially the same as stealing spirit stones from him, which caused his fury to bubble and boil.</p><br/><p>Third Fatty Hei was equally enraged. However, in the same moment that the two of them were about to attack, Bai Xiaochun looked up in thought and then suddenly whispered, “Eldest Brother, run as fast as you can and then push them over the finish line. We might not get any spirit stones this time, but at least the Supervisors Department won’t be able to steal our business in the future!”</p><br/><p>Big Fatty Zhang’s eyes immediately went wild with joy. More than ever, he realized how much of a villain Bai Xiaochun was. Laughing heartily, he suddenly shot forward. Third Fatty Hei followed Big Fatty Zhang, chuckling, eyes shining.</p><br/><p>The path wasn’t very wide, and when Big Fatty Zhang and Third Fatty Hei charged forward together, they were almost like a huge wall.</p><br/><p>A wind kicked up as they sped directly toward Chen Fei and the others.</p><br/><p>Bai Xiaochun followed behind Big Fatty Zhang, letting out a wild whoop.</p><br/><p>Without the slightest hesitation, Chen Fei and his friends attacked. However, it did no good. Big Fatty Zhang and Third Fatty Hei were charging forward like startled wild boars.</p><br/><p>Their dual attack was shocking enough to make ghosts and gods weep. They charged madly forward, slamming into Chen Fei and his friends, forcing them back. Chen Fei and his friends were completely shocked, and when they realized what the Ovens crew was doing, their scalps felt like they were about to explode.</p><br/><p>In any other situation, Chen Fei and his friends would dodge to the side or counterattack. But here, fleeing backward would do no good, and would in fact hasten their defeat.</p><br/><p>As they were pushed back, their faces filled with fury.</p><br/><p>Obviously, they had no desire to become Outer Sect disciples. After being promoted, they would no longer be in the Supervisors Department, and would become ordinary disciples again, losing access to their ill-gotten gains.</p><br/><p>“Elder Brother Zhang, stop it!” blurted Chen Fei, sweat pouring down his forehead. “There’s something I want to say--” However, before he could finish, he was interrupted by Bai Xiaochun.</p><br/><p>“Eldest Brother, keep going! Push them over the finish line!”</p><br/><p>In response, Big Fatty Zhang let out a roar and pushed forward even harder. Third Fatty Hei joined him, and rumbling sounds echoed out as they shoved Chen Fei and two other burly fellows down the narrow path. The first to cross the finish line was one of the burly men, who then stood there at the top of the mountain, wanting to cry, but unable to.</p><br/><p>The other burly fellow let out a miserable scream. Staggering backward, he began to beat his chest in regret.</p><br/><p>Last to cross over was Chen Fei. No matter how he struggled, the path was too narrow, and a boom could be heard as he was forced off the path. He glared back at Big Fatty Zhang and the others, eyes bloodshot and filled with murder.</p><br/><p>“Bai Xiaochun!!” The person they hated the most wasn’t Big Fatty Zhang, but rather Bai Xiaochun, who had come up with the despicable plan to begin with.</p><br/><p>The two Outer Sect disciples at the top of the mountain had been watching as the whole scene played out. They cleared their throats, and then backed up a bit, having nothing to say.</p><br/><p>Big Fatty Zhang and Third Fatty Hei now stood at the finish line, sticking their chests out in pride and laughing heartily.</p><br/><p>“See you later, Chen Fei!” said Big Fatty Zhang, slapping his stomach and causing the fat to jiggle. “Hahaha! Although, not in the servants district! Hahaha! I’ll miss you! Congratulations on becoming an Outer Sect disciple!”</p><br/><p>Chen Fei and his friends very nearly coughed up blood, and in their hearts, they wanted nothing more than to commit murder.</p><br/><p>Bai Xiaochun lifted his chin up, looking very pleased. “There’s no need to thank us, Elder Brothers. Congratulations on becoming the fish which leaped over the dragon gate. As Outer Sect disciples, your meteoric success will be like the galloping divine steed. We Junior Brothers offer sincere congratulations!”</p><br/><p>However, even as his words rang out, a cold harrumph rang out from the top of Fragrant Cloud Peak.</p><br/><p>“There’s no need for congratulations, you’re coming too.”</p><br/><p>Almost as soon as the words entered Bai Xiaochun’s ears, he began to tremble. His eyes filled with fear as a powerful force surged down from further up the mountain, enveloped him, and then began to pull up the mountain.</p><br/><p>Bai Xiaochun let out a miserable shriek, and quickly latched his arms around a tree that bordered the trial by fire.</p><br/><p>“Elder Brothers, save me!” he screamed.</p><br/><p>This development occurred too quickly. Before Big Fatty Zhang and Third Fatty Hei could even react, a cracking sound could be heard as the tree Bai Xiaochun was holding on to split in half. He flew backward like a kite with its string cut, spinning upward toward the top of the mountain. At the same time, a middle-aged man appeared up above, wearing a long blue cloak, looking very threatening despite not looking angry. It was none other than…</p><br/><p>Li Qinghou.</p><br/>\n</div>"}