{"title": "Chapter 37: Heaviness-in-Lightness", "id": 37, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-37-heaviness-in-lightness", "volume_title": "Volume 1", "body": "<h1>Chapter 37: Heaviness-in-Lightness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Ten stone steles, ten 1st place spots!</p><br/><p>The three peaks on the south bank of the Spirit Stream Sect were completely shaken.</p><br/><p>Outside the 10,000 Medicines Pavilion, a buzz of conversation could be heard. People were speeding over from all directions to catch a glimpse of the little turtle in 1st place on all ten stones steles. Gasps rang out.</p><br/><p>“Ten 1st place spots! The little turtle actually did it!”</p><br/><p>“The last time anyone in the Spirit Stream Sect ever took ten 1st place spots in the stone steles was a thousand years ago! How could I ever have imagined that I would see something like this in my life!?”</p><br/><p>Everyone was clamoring in shock, and although many people had predicted that this would happen, it was still a shocking event. That was especially true considering the previous three months, in which one stone stele after another fell into the hands of the little turtle. When people thought about that, they simply couldn’t stay calm.</p><br/><p>“Just who exactly is the little turtle...? In less than half a year, he started from the third stone stele and then swept through all his competition in the rest of them. This guy is totally famous!”</p><br/><p>“His skill with plants and vegetation completely exceeds Zhou Xinqi’s. Maybe in the future, there will even be another master apothecary in addition to Zhou Xinqi!”</p><br/><p>In the same moment that the little turtle secured 1st place on all ten stone steles, the steles began to vibrate, letting off intense rumbling noises that merged together, and then were joined by the sound of a clanging cauldron coming from further up the mountain.</p><br/><p>It was as if someone were striking a medicine cauldron with an enormous log. The muffled booms spread out through all of Fragrant Cloud Peak, and then echoed out to fill the entire south bank of the Spirit Stream Sect. It was accompanied by a medicinal aroma that filled the area, and caused the mists that covered Fragrant Cloud Peak to grow even thicker.</p><br/><p>At the top of Fragrant Cloud Peak was an immortal’s cave where Elder Zhou was in the middle of feeding some of his cherished five-colored spirit birds. When he heard the sound of the cauldron, his eyes lit up with surprise.</p><br/><p>“The Fragrant Cloud Cauldron?” He sent his divine sense out and instantly detected what was happening among the ten stone steles outside the 10,000 Medicines pavilion. His expression immediately flickered, and he stepped out into the air.</p><br/><p>Next, Elder Sun appeared, along with other Foundation Establishment cultivators. All of them had heard the sound of the cauldron, and were now proceeding in the direction of the 10,000 Medicines Pavilion, excited expressions on their faces.</p><br/><p>The last to appear was Li Qinghou, who had been in the middle of meditation. When he heard the sound of the cauldron, his face flickered, and he looked outside. Then, he transformed into a beam of colorful light that shot toward the 10,000 Medicines Pavilion.</p><br/><p>As the sound of the cauldron rang out, the crowd grew even more excited. Both the Outer Sect and Inner Sect disciples of Fragrant Cloud Peak were completely shaken, and many began to rush in the direction of the 10,000 Medicines Pavilion.</p><br/><p>“That's... the sound of the precious treasure of Fragrant Cloud Peak, the Fragrant Cloud Cauldron!”</p><br/><p>“Someone took ten 1st place spots at the 10,000 Medicines Pavilion! That hasn’t happened for a thousand years! This is unheard-of!”</p><br/><p>Excitement even broke out on Green Crest Peak and Violet Cauldron Peak. Big Fatty Zhang was hanging his head as a beautiful, alluring woman berated him. That woman was none other than the old shrew that Big Fatty Zhang had complained to Bai Xiaochun about. As soon as she heard the sound of the cauldron, her expression flickered, and she looked off into the distance. Big Fatty Zhang’s face fell in shock as he did the same thing.</p><br/><p>“The sound of the Fragrant Cloud Cauldron. Could it be that some disciple on Fragrant Cloud Peak has actually gotten perfect results in all of the tests?”</p><br/><p>Similar scenes played out on Green Crest Peak, causing the elders and the peak lord there to look over in astonishment.</p><br/><p>More and more people were filling the area around the 10,000 Medicines Pavilion.</p><br/><p>Bai Xiaochun was there in the crowd, and when he heard the uproar, he looked up at the ten stone steles. Although he didn’t join in with the shouting, his heart was filled with an indescribable feeling. He stood there, a smile growing on his face; not a complacent smile, or a lofty smile, a smile of pure happiness.</p><br/><p>It had taken him more than a year to work this miracle. He had started from the first stone stele, then taken 1st place in all ten. However, having a bunch of 1st place spots didn’t mean much to him in the end. The most important thing was that he had gained a complete mastery over plants and vegetation, as well as the spirit creatures, something that apprentice apothecaries needed to be proficient in.</p><br/><p>He had crafted an unprecedentedly deep foundation. As he thought back to the long days and endless nights he had spent obsessively studying plants and vegetation, and then spirit creatures, Bai Xiaochun sighed emotionally.</p><br/><p>In the entire Spirit Stream Sect, there weren't even any Inner Sect disciples who had such a strong foundation in their skill with plants and vegetation. Currently, Bai Xiaochun was feeling very satisfied.</p><br/><p>Soon, numerous beams of light could be seen flying through the air, all of them emanating powerful cultivation base fluctuations. Among them were Elder Zhou, Elder Sun... and of course Li Qinghou.</p><br/><p>They looked over the ten stone steles, and the little turtle in the 1st place spot, and their eyes began to shine brightly. That was especially true of Li Qinghou. That little turtle design caused him to first start in shock, then begin to laugh loudly, a strange expression on his face. He looked out over the crowd, and caught sight of Bai Xiaochun, after which a glint of praise appeared in his eyes that no one could detect.</p><br/><p>After a long moment passed, he flicked his sleeve and left, quite happy after having guessed that the little turtle belonged to none other than Bai Xiaochun.</p><br/><p>Soon, the other members of the Senior generation left. However, more and more Inner Sect disciples were showing up to stare in shock at the little turtle. After all, they had all risen up from the Outer Sect, and knew very well that only Outer Sect disciples were allowed to challenge the stone steles. They also knew how difficult of a challenge that was.</p><br/><p>“Any Outer Sect disciple who can do this is definitely a Chosen....”</p><br/><p>“Hmph. We’re journeyman apothecaries, so all we care about is spirit medicines. Incredible skill with plants and vegetation is meaningless if you can’t concoct spirit medicine!”</p><br/><p>Some of the Inner Sect disciples clearly admired the little turtle, and others disdained it. However, regardless of their feelings, a deep impression had been made, and in fact, most of them were actually a bit frightened.</p><br/><p>None of them had any idea how skilled this person would be at medicine concocting, but with such a solid foundation, once that person became a journeyman apothecary, his path would certainly be much smoother.</p><br/><p>The uproar continued until eventually Zhou Xinqi showed up. She stood there on her blue flying silk, examining the little turtle. Slowly, the crowd quieted down, and all eyes turned in her direction.</p><br/><p>The sight of the little turtle in the 1st place spot on all of the stone steles caused an unyielding gleam to appear in her eyes. In the past, this was the sort of complicated expression that she caused to appear in the eyes of others, but now, the opposite had happened.</p><br/><p>“Just who are you...?” she murmured through clenched teeth. Although she couldn’t bear to admit it, she had tried hard on numerous occasions to match the mysterious little turtle in terms of skill with plants and vegetation, but his ability was just too profound. As of this moment, she had no confidence whatsoever in being able to surpass him. By now, that little turtle was completely and utterly branded onto her heart.</p><br/><p>“You might be stronger than me with plants and vegetation, but just wait until you become a journeyman apothecary. I refuse to believe that you’ll surpass me when it comes to medicine concocting!” She took a deep breath and calmed herself down. She had already taken the test and been promoted to journeyman apothecary, so after giving the stone steles one last look, she spun and vanished off into the distance.</p><br/><p>After giving the ten stone steles one last look, Bai Xiaochun turned and left. “This is just the first stop along my path to becoming a grandmaster apothecary!”</p><br/><p>The matter of the ten stone steles caused a commotion that lasted for months. People talked about it nonstop, especially when they went to the 10,000 Medicines Pavilion and actually saw the little turtle on the stone steles.</p><br/><p>Meanwhile, Zhou Xinqi’s fans were combing the sect, employing all tactics possible to try to figure out who the little turtle was. That was especially true of the young man surnamed Qian, who was infuriated about the matter.</p><br/><p>The entire south bank of the Spirit Stream Sect was affected. While people were constantly discussing the little turtle, Bai Xiaochun was in his courtyard, eyes bloodshot as he controlled a tree leaf that floated in front of him.</p><br/><p>He was now studying the stage of Heaviness-in-Lightness. Actually, he had repeatedly attempted to do so throughout the past half year, but it wasn’t until now that he had been able to do anything with it.</p><br/><p>Because of how things had ended at the 10,000 Medicines Pavilion, Zhou Xinqi’s fans were constantly searching for him. A sensation of crisis slowly built up within him, so he decided to weather things out in his residence while he worked on Heaviness-in-Lightness.</p><br/><p>“Lightness-in-Heaviness is about speed. Heaviness-in-Lightness... is about control methods!” A thoughtful expression appeared in Bai Xiaochun’s eyes as he pondered everything he had come to understand recently.</p><br/><p>“Or perhaps you could say that such control is actually an eruption of one’s internal spiritual energy!” Bai Xiaochun’s eyes glittered. He was now in the sixth level of Qi Condensation, and his internal spiritual energy was like a huge river. When it came to Lightness-in-Heaviness, he could sustain it indefinitely, and unleash shocking speed.</p><br/><p>He had long since come to understand that the so-called stage of Heaviness-in-Lightness was simply a way of utilizing one's internal spiritual energy. It was like how a flat leaf could be used to pull a small branch up into the air, but a rolled up leaf could hoist up a small rock. Likewise, if you cut a leaf into strips and then braided it into a rope, it would be able to lift even heavier objects.</p><br/><p>Many materials were like that; in the end, the different weights that could be lifted depended simply on how one combined the various elements.</p><br/><p>Heaviness-in-Lightness was just such a technique, and by mastering it, you could reach a new stage.</p><br/><p>Bai Xiaochun thought about the matter for a bit longer, then waved his hand, causing another leaf to fly over, which he began to experiment with. Sometimes the leaf moved quickly, at other times it moved as slowly as if a mountain were crushing onto it. However, he wasn’t getting the result he wanted.</p><br/><p>After one try didn't work, he tried ten times. After ten tries didn't work, he tried a hundred times. After a hundred tries didn’t work... he tried a thousand times.</p><br/><p>He eventually lost track of how many times he had tried. Soon, his courtyard was filled with fragments of leaves which had been destroyed, and he even had to go out looking for new leaves. Eventually, nearly all of the spirit plants on Fragrant Cloud Peak were devoid of leaves, until, on one particular day, Bai Xiaochun’s eyes flickered, and he performed an incantation gesture and pointed out. The leaf in front of him was floating there gently, but when it fell to the ground it sounded like a boulder.</p><br/><p>A huge boom rang out, and the entire courtyard residence shook. It was as if that one leaf weighed hundreds of kilograms.</p><br/><p>“It worked!” Bai Xiaochun’s eyes were shot with blood, but his expression was one of excitement. He suddenly waved his hand, sending his little wooden sword flying out. It turned into a black streak that shot through the air with incredible speed. It was now even more incredible than before, and emanated a shrill whistling sound as it pierced through the air.</p><br/><p>Then, a boom rang out as a huge boulder was shattered to pieces.</p><br/><p>Such incredible power was no longer equivalent to the sixth level of Qi Condensation. Even someone in the seventh level of Qi Condensation would be completely shocked by what had just happened.</p><br/>\n</div>"}