{"title": "Chapter 44: The Sun Is Rising", "id": 44, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-44-the-sun-is-rising", "volume_title": "Volume 1", "body": "<h1>Chapter 44: The Sun Is Rising</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After fully studying the final plant, and resolving all of the issues he had, Bai Xiaochun continued to completely ignore all of the clamor around him. He had focused hard on the information in the jade slip, had become completely immersed in the Dao of plants and vegetation, and had even entered a sort of trance.</p><br/><p>Nothing short of the crash of thunder and lightning would be able to break his concentration, nor did he even glance at the results of the others’ concocting efforts.</p><br/><p>Of course, that attracted the attention of some in the audience, including Xu Baocai. Curious expressions could be seen on their faces as they looked over, clearly wondering why Bai Xiaochun had spent so much longer in his initial observations.</p><br/><p>“This Bai Xiaochun is just too slow. Everyone else is finished and he's just starting. Shouldn't the test be over by now?”</p><br/><p>“Hmm. You know what, I don’t think I ever heard anything about the journeyman apothecary promotion test... having a time limit....” It wasn’t clear who exactly said that last sentence, but when people heard it, they began to turn toward Elder Xu, blank expressions on their faces.</p><br/><p>Elder Xu hesitated for a moment, but the truth was that the journeyman apothecary promotion test really didn’t have any time limit. Therefore, he continued to stand there watching Bai Xiaochun concoct medicine.</p><br/><p>Han Jianye wasn't worried at all, and was even chuckling coldly, eyes flashing with disdain. At first, he had been worried that Bai Xiaochun would be a formidable opponent, but after the way this part of the test had played out, he was convinced that there was no way Bai Xiaochun could surpass him.</p><br/><p>Du Lingfei’s brow was furrowed; Bai Xiaochun rubbed her wrong no matter how she considered the matter.</p><br/><p>Bai Xiaochun’s movements were blindingly fast, and his eyes glowed brightly. To him, the entire world consisted only of that pill furnace. The various medicinal plants rapidly changed form as he kneaded them into pastes, broke them down into powders, or made other preparations. Then, after putting all of the ingredients into the pill furnace, he performed an incantation gesture with his right hand and pointed at the pill furnace, causing the earthflame underneath to burn brightly.</p><br/><p>Two hours flew by, and soon a strong medicinal aroma emanated out from the pill furnace. Bai Xiaochun waved his hand, causing a four-inch-long stick of Inkspirit Incense to fly out. As soon as it landed in his palm, he examined it, and then frowned.</p><br/><p>Everyone in the audience had very serious expressions on their faces, and Elder Xu’s eyes were flickering. However, just when everyone was expecting Bai Xiaochun to start his second batch, they realized that instead, he was simply... studying the incense.</p><br/><p>“What is he doing??”</p><br/><p>“He succeeded! Why hasn’t he started the second batch?”</p><br/><p>Everyone was looking on, stunned.</p><br/><p>As for Bai Xiaochun, he was looking at the Inkspirit Incense, feeling quite unsatisfied. Although he had indeed succeeded, he knew that based on the ingredients he had used, the incense should have been seven inches long.</p><br/><p>“What went wrong?” he thought. Then he contemplated the matter... for six hours.</p><br/><p>Just when everyone was getting to the point where they were running out of patience, Bai Xiaochun’s eyes glittered, and he produced a second set of ingredients and began to concoct. Everyone in the audience anxiously watched him work.</p><br/><p>Yet again, two hours passed. This time, the medicinal aroma was even stronger than before as a five-inch-long stick of Inkspirit Incense flew out.</p><br/><p>Du Lingfei’s face flickered, and shocked expressions could be seen on the faces of both Chen Zi’ang and Zhao Yiduo. As for Han Jianye, his eyes flickered, but his expression remained calm. Only he knew that, inwardly, he was starting to get anxious.</p><br/><p>Of course, what made him anxious was not just that Bai Xiaochun had succeeded two times, but that... he might continue to succeed!</p><br/><p>Under the shocked gazes of all present, Bai Xiaochun flicked his sleeve, sending the third set of medicinal plant ingredients out. His third batch was now beginning, and all of the Outer Sect disciples were watching closely.</p><br/><p>Two hours passed in silence. Suddenly, the pill furnace shuddered, and a medicinal aroma even stronger than before filled the area as a six-inch-long stick of Inkspirit Incense appeared!</p><br/><p>“Three times in a row! How... could this be happening!?!?”</p><br/><p>“How is Bai Xiaochun doing this? Could it be that he has actually concocted Inkspirit Incense before?!” Cries of astonishment could be heard because of the successive successes; people could hardly believe what they were seeing.</p><br/><p>Du Lingfei’s breath came in ragged pants as she glared at Bai Xiaochun, waves of shock battering her heart. Chen Zi’ang and Zhao Yiduo were both gaping dully.</p><br/><p>“Three in a row....” Han Jianye thought, clenching his hands into fists. His eyes were now completely bloodshot. “He must already be familiar with Inkspirit Incense. Well, he got lucky with this batch, but the next batch will be a different story!”</p><br/><p>Just when everyone was expecting Bai Xiaochun to start his fourth batch, he held up the six-inch-long stick of Inkspirit Incense, then frowned and rubbed his chin thoughtfully.</p><br/><p>Then everyone waited... for ten hours.</p><br/><p>If this sort of thing had happened with the first batch, everyone would have left. But after having seen Bai Xiaochun succeed three times in a row, they knew that a fourth success would push him past everyone else to the same level as Han Jianye. That was something everyone was itching to see happen.</p><br/><p>“Bai Xiaochun takes way too long! It’s only a tier-1 spirit medicine! Why does he need so much time to think about it!?”</p><br/><p>Of course, Du Lingfei and Han Jianye were the most invested of all, and were staring dead at Bai Xiaochun, completely unwilling to leave.</p><br/><p>It was at this point that Bai Xiaochun’s eyes glittered brightly. His eyebrows shot up as he waved both hands, sending plants and vegetation flying out as he began his fourth batch. Everyone was now looking on in complete excitement.</p><br/><p>Two hours later, rumbling sounds could be heard, but not the type that indicated a failure had been met. Instead, a powerful blast of medicinal aroma spread out, filling the entire area in the blink of an eye. Then, astonishingly, a seven-inch-long stick of Inkspirit Incense appeared!</p><br/><p>The fourth batch was another success!</p><br/><p>The audience went wild.</p><br/><p>“Four in a row!”</p><br/><p>“I can’t believe something like this actually happened.... Just how many times will Bai Xiaochun actually succeed!?”</p><br/><p>“Two successes are the requirement to pass, and four makes you Chosen! If I remember correctly, Elder Sister Zhou Xinqi got seven successes back when she was promoted!” As the crowd clamored, Du Lingfei’s face turned very unsightly. Although she was aware that Bai Xiaochun’s skill with plants and vegetation far surpassed her own, to see that such a vast gap existed between them in terms of medicine concocting filled her with mixed emotions.</p><br/><p>As for Han Jianye, he was grinding his teeth, and his hands were clenched tightly into balls. He was trembling, and couldn’t bear to believe what he was seeing. And yet, everything was happening right in front of him, making it impossible for him to deny it.</p><br/><p>“Four successes! Four successes has to be his limit. The rest will definitely be failures!”</p><br/><p>Everyone in the audience was now buzzing with speculation regarding how many total successes Bai Xiaochun would achieve. But then, they realized that Bai Xiaochun was simply staring at the Inkspirit Incense.</p><br/><p>“What is this guy doing? He’s doing more studying?!” Although they were a bit chagrined, the audience members weren’t about to leave now. Instead, they sat there, waiting and watching, looking forward to seeing the results of Bai Xiaochun’s next study session.</p><br/><p>Sixteen hours passed before Bai Xiaochun finally took a deep breath. His eyes were completely bloodshot. Although no one else realized it, the fourth batch he had just produced had come very close to failing.</p><br/><p>“This Inkspirit Incense is much, much harder than any of the other spirit medicines I've concocted in the past.” Bai Xiaochun was prudent and meticulous. After thinking back to all the other batches he had produced so far, he identified what the problem was, and after confirming that he could prevent it from happening, began a fifth batch.</p><br/><p>He was completely oblivious to any of the conversations around him; when he was concocting medicine, his level of focus exceeded imagination. It didn’t matter what anybody said, he wouldn’t begin to concoct unless he was absolutely confident in succeeding.</p><br/><p>Everyone in the audience had been sitting here for so long that they were completely exhausted, and were having trouble staying focused, and yet they were now all craning their necks to see what was happening.</p><br/><p>It didn't take long before more rumbling sounds could be heard, and a medicinal aroma spread out in all directions, a fragrant odor that sent shock into the hearts of everyone present.</p><br/><p>The fifth batch was a success!</p><br/><p>Han Jianye sat there dumbfounded, heart overwhelmed with bitterness. After a long moment, he simply sighed quietly.</p><br/><p>This was the moment the crowd had been waiting for. Bai Xiaochun waved his sleeve and began the sixth batch.</p><br/><p>Before long, more rumbling could be heard, and smell of incense spread out. The sixth batch was a success!</p><br/><p>Bai Xiaochun’s eyes glittered. Not pausing for even a moment, he pulled out more medicinal plants and started his seventh batch. However, in almost the exact same instant that he started the seventh batch, an acrid odor suddenly wafted out. It was very faint, and could only be detected by Bai Xiaochun, and yet it caused his heart to begin pounding.</p><br/><p>He performed an incantation gesture with his right hand and pointed out, reducing the earthflame temperature. After manipulating the ingredients with the greatest care, he succeeded with the seventh batch!</p><br/><p>However, this stick was only three inches long, and contained many impurities, leaving it on the verge of being low-grade, almost toxic. However, as far as the audience was concerned, that still counted as a success!</p><br/><p>At this point, the audience was completely and utterly wrapped up in what was happening. Everyone was panting in excitement, especially Xu Baocai, whose eyes glowed with disbelief.</p><br/><p>“Seven successes.... Heavens! Bai Xiaochun actually succeeded seven times!”</p><br/><p>“He’s just as good as Elder Sister Zhou Xinqi! I remember hearing that the only person to ever exceed eight successes was a disciple from years ago named Wang Qingshan, an Elder Brother who is now in the supreme position of being in the legacy echelon!”</p><br/><p>“Succeeding nine times... is completely unheard-of. Nobody has ever done it!”</p><br/><p>The audience was in an uproar, but Bai Xiaochun was sitting there quietly, looking at the pill furnace. His eyes were bloodshot, and by this point, he wasn’t even thinking about the test. He was immersed in thoughts of concocting medicine, and was analyzing the near failure from all angles. Next, he pulled out the ingredients and began to examine them again to try to determine the cause.</p><br/><p>“This spirit plant is called inkfruit, and the ink elements within each one are slightly different....” He held the inkfruit in his hand and continued to observe and analyze it.</p><br/><p>Time passed, and more wry smiles could be seen on the faces of the audience as they realized what was happening. Although they were excited, Bai Xiaochun was so thoughtfully slow in medicine concocting that it could make one bristle with anger.</p><br/><p>And yet, nobody was willing to leave. The Outer Sect disciples all sat there cross-legged, some of them meditating as they waited for Bai Xiaochun. Others were so exhausted that they leaned up against nearby boulders to sleep.</p><br/><p>A strange expression could be seen on the face of Elder Xu. Coughing dryly, he sat there cross-legged, waiting.</p><br/><p>Of course, Du Lingfei and Han Jianye weren’t going to leave. Although Bai Xiaochun left them physically and mentally exhausted, they had no choice but to sit there quietly.</p><br/><p>Everything was very quiet, except for the occasional snores which echoed out. And yet, people were still waiting, and watching Bai Xiaochun. Xu Baocai was among their number.</p><br/><p>Hours passed, during which some people awoke from their sleep to find Bai Xiaochun sitting there in contemplation. They couldn’t help but sigh.</p><br/><p>“I can’t believe he’s still studying.”</p><br/><p>“The sun is rising....”</p><br/><p>Eventually, after more than twenty hours had passed, Bai Xiaochun suddenly looked up, and his eyes were completely bloodshot.</p><br/>\n</div>"}