{"title": "Chapter 46: Mission For The Hall Of Justice!", "id": 46, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-46-mission-for-the-hall-of-justice", "volume_title": "Volume 1", "body": "<h1>Chapter 46: Mission For The Hall Of Justice!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The command medallion was pitch black, and in the very center was the character “Justice,” which emanated a bleak and somber air.</p><br/><p>Even as Bai Xiaochun stared in at it shock, a cold voice echoed out into the workshop.</p><br/><p>“Outer Sect disciple Bai Xiaochun. After an investigation carried out by the Hall of Justice, it has been confirmed that after being in the sect for several years, you have only accomplished a single mission, to raise a spirit plant. Because of this violation of sect rules, you must participate in a mandatory out-of-sect mission, which begins three days from now!”</p><br/><p>From the cold and sinister nature of the voice, it seemed apparent that if Bai Xiaochun refused to comply, he would receive the strictest of punishments!</p><br/><p>“The Hall of Justice!” Bai Xiaochun’s eyes bulged, and his heart began to pound. At the same time, the command medallion transformed into a black glow, and then vanished.</p><br/><p>Everything was dead quiet. Bai Xiaochun’s face flickered with various emotions as he pulled out his identity medallion. Sure enough, he found that a mandatory mission had been added.</p><br/><p>He had completely forgotten about the rule about a minimum number of missions required for disciples on a yearly basis. However, the abrupt arrival of the command medallion from the Hall of Justice was something that Bai Xiaochun found very odd.</p><br/><p>After a moment of thought, he left his workshop, walked out of the Medicine Concocting Pavilion, and headed toward the top of the mountain.</p><br/><p>“Something’s not right here. Why do I feel like a cold wind is running down my back...? Well, I’ve been in the sect for years now, and have never taken the initiative to go see the peak lord. I might as well go pay my respects and see if I can figure out what’s going on.” Bai Xiaochun was wrapped up in very important thoughts the entire way up the mountain. Eventually, he found Li Qinghou’s Daoist assistant, only to discover that Li Qinghou had been out of the sect for several months.</p><br/><p>Bai Xiaochun was feeling very bitter, and very nervous. Instead of returning to the Medicine Concocting Pavilion, he went to find Xu Baocai. After all, Xu Baocai knew everything that was going on in the sect, so perhaps he would have some clue about what was going on.</p><br/><p>Xu Baocai was still an Outer Sect disciple, and lived on a different part of the mountain than Bai Xiaochun. By now it was evening, and not very many people were out and about. Soon, Bai Xiaochun had arrived outside Xu Baocai’s courtyard residence.</p><br/><p>This residence was not as remote as Bai Xiaochun’s, and was clustered together with seven or eight others. Now that it was dark, firelight could be seen shining out from several of the courtyards.</p><br/><p>Bai Xiaochun ducked his head down to make himself inconspicuous. Instead of knocking on the main gate, he flew over the wall, after which he caught sight of Xu Baocai bent over a little notebook, writing.</p><br/><p>“Xu Baocai,” he whispered.</p><br/><p>Xu Baocai was startled, but once he saw who had come, he said, “Oh, hey Elder Brother Bai.”</p><br/><p>A bit confused, he rose to his feet and invited Bai Xiaochun into his room.</p><br/><p>“Elder Brother Bai, weren’t you in secluded meditation in the Medicine Concocting Pavilion?” he asked curiously. “What are you doing out here?”</p><br/><p>“Xu Baocai, what do you know about the Hall of Justice?” Bai Xiaochun asked immediately.</p><br/><p>Seeing the grim expression on Bai Xiaochun's face, Xu Baocai could tell that something was wrong, and quickly responded, “The Hall of Justice? Well, there’s a southern hall and a northern hall, who administer the two different parts of the sect. They oversee the Outer Sect disciples and servants, but usually don’t do anything unless there’s been a serious violation of sect rules.</p><br/><p>“If a violation does occur, they have a lot of power. There are all sorts of punishments they can enforce. In fact, they even have the power to execute traitors. Essentially, the Hall of Justice is like a sword hanging over the necks of the Outer Sect disciples, ensuring that none of us ever dare to violate sect rules.</p><br/><p>“If someone does, and gets noticed by the Hall of Justice, they’ll receive swift and severe punishment....</p><br/><p>“Of course, although the Hall of Justice has a lot of power, that power is limited. As long as you don’t violate sect rules, then you don’t really have to worry about them at all.” As usual, Xu Baocai went on to give a very detailed description of the Hall of Justice to Bai Xiaochun, based on everything that he knew.</p><br/><p>He even went on to tell Bai Xiaochun the grisly fates of some of the disciples who had run afoul of the Hall of Justice.</p><br/><p>“Five hundred years ago, a traitor rose up within the Spirit Stream Sect. The Hall of Justice tracked him down for seven days before finally killing him and wiping out his soul!</p><br/><p>“Three hundred years ago, an Outer Sect disciple flagrantly violated sect rules. Although the Hall of Justice gave him a chance to repent, he ignored it. In the end, the Hall of Justice reported the matter to the sect, and the disciple was punished in the Blackwind Abyss, where to this very day, he is constantly scourged by biting winds.</p><br/><p>“A hundred years ago, the Mount Zhou Society planned an armed rebellion. Despite warnings from the Hall of Justice, they refused to back down. When they finally made their move, the Hall of Justice executed all the cultivators from the Mount Zhou Society, sparing only the mortals.”</p><br/><p>As Bai Xiaochun listened to all of this, his expression grew more unsightly than ever, and his heart began to pound.</p><br/><p>“Are you telling me that normally the Hall of Justice gives a warning first, and resorts to serious punishment only if you don’t repent?”</p><br/><p>“Yeah, exactly. That’s one of the limitations placed upon the Hall of Justice. Otherwise, they would have far too much power.” By this point, Xu Baocai had guessed that the Hall of Justice must have set their eyes on Bai Xiaochun. However, matters pertaining to the Hall of Justice were sensitive, and Xu Baocai was intelligent enough to look out for his own interests. Therefore, although he told Bai Xiaochun what he knew, he didn’t dare to get any more involved than that.</p><br/><p>In the end, just before Bai Xiaochun was about to leave, Xu Baocai hesitated for a moment as he thought about Bai Xiaochun’s skill with plants and vegetation, and then suddenly lowered his voice and asked, “Elder Brother Bai, do you happen to know an Inner Sect disciple from Green Crest Peak named... Qian Dajin? He’s Chen Fei’s older cousin, and he also happens to be a member of the Hall of Justice.”</p><br/><p>After the time it takes an incense stick to burn, Bai Xiaochun left. As he walked along the path in the sect, he looked up at the moon and thought about everything Xu Baocai had said, which only served to confirm what he had already surmised. In the end, he sighed.</p><br/><p>“I didn't offend anyone in the sect!” he thought, clenching his jaw. “Other than Chen Fei, there’s only the fans of Zhou Xinqi.... Qian Dajin. Qian Dajin!” After returning to the Medicine Concocting Pavilion, he sat down cross-legged in the workshop and looked at the pill furnace. Then his face twitched.</p><br/><p>“It’s pretty obvious that me failing to complete a sect mission every year is just an excuse. Something like that wouldn’t be noticed unless someone specifically looked into it, and even still, it isn’t a very big deal. Besides, I couldn’t possibly be the only person in the sect who has done that. Since Qian Dajin is a member of the Hall of Justice, he’s using his public office to avenge private grudges!” After more thought, Bai Xiaochun’s eyes were growing increasingly bloodshot.</p><br/><p>“If I go on this mission, he’ll definitely make sure something happens to me at some point. Why else would he go through all the trouble of setting this up? However, he would still have to be careful to make sure the sect doesn’t find out. Overall, I still have the initiative.</p><br/><p>“If I ignore the mission order, then I would be falling right into his hands. He would be able to take control of the initiative, using his status in the Hall of Justice to directly punish me!”</p><br/><p>Bai Xiaochun thought about it from many directions, but there was no perfect solution. Eventually, he took out his identity medallion and examined the mission. It only took a moment before he realized there was a familiar name in the mission description.</p><br/><p><span>“Hou Yunfei?” Bai Xiaochun’s eyes went wide as he thought back to when he had first become an Outer Sect disciple, and the detailed introduction to the sect Hou Yunfei had given him. Then, he closed his eyes to think more. </span><span id=\"footnote-ref-4511\">[1]</span></p><br/><p>This mission didn't seem to be a difficult one. A few years ago, Hou Yunfei had accepted a mission outside of the sect, and would check back in every month with news. That was a common arrangement for disciples who took on long-term missions.</p><br/><p>However, two months ago, contact was lost, and no news had come back.</p><br/><p>Therefore, this new mission had been handed down. Three Outer Sect disciples would be sent to investigate, with no specific instructions regarding the clues they were to gather.</p><br/><p>Search missions like this were common within the sect. All the disciples had to do was investigate a bit, turn up some clues, and then come back to the sect to let someone follow up further.</p><br/><p>Furthermore, for an Outer Sect disciple to go missing wasn’t a very important matter as far as the sect was concerned. Of course, they were still disciples, so the matter had to be handled eventually.</p><br/><p>That was why missions like this existed in the first place.</p><br/><p>Bai Xiaochun thought about it further, and after weighing all the options and facts, clenched his teeth.</p><br/><p>“Fine, I’ll take the mission.” Panting, eyes bloodshot, he immediately began to concoct more medicine. If he was going to go out of the sect on a mission, then he needed to have a major breakthrough with his Undying Iron Skin.</p><br/><p>Two days later, Bai Xiaochun’s body was shaking, and his skin was vibrating. Suddenly, a wave of blackness spread out across him, which quickly vanished. However, if you looked closely, you could just barely see red streaks of light flashing across him.</p><br/><p>“The black is iron, the red is bronze!”</p><br/><p>When he pushed down on his skin, a sound like ringing metal echoed out. Next, he shot to his feet and confirmed that he was much faster than before.</p><br/><p>After a few more tests, he leaped up into the air and pinched his thumb and index finger together. There were no cracking sounds this time, but rather muffled booms. They weren’t very loud, and yet Bai Xiaochun could tell that this move of his was at least twice as powerful as before.</p><br/><p>“Breakthrough with my Undying Iron Skin!” he thought excitedly. As of this moment, he was a bit more confident regarding the mission.</p><br/><p>“It's too bad I can only concoct tier-1 spirit medicine appropriate for the fifth level of Qi Condensation and lower.” Bai Xiaochun stood there in the workshop feeling a bit disappointed. However, time was limited, and he simply couldn't produce the type of tier-2 spirit medicine appropriate for the eighth level of Qi Condensation and lower.</p><br/><p>Because of that, his cultivation base couldn't progress very much, and remained in the great circle of the sixth level of Qi Condensation.</p><br/><p>“Tomorrow at dawn I leave the sect....” he thought anxiously. This would be his first time truly leaving the sect since he had joined, and he didn’t feel safe at all. In fact, he even took out the shield he had acquired from Chen Fei and performed a threefold spirit enhancement on it. That didn’t leave him feeling very safe, though. Next, he performed spirit enhancements on the leather coats he had worn in the competition.</p><br/><p>After more thought, he went out in the middle of the night and found Big Fatty Zhang, to borrow his big black wok that supposedly had an earthflame spell formation built into it. Even still, he didn’t feel at ease. However, there was nothing more to be done. Looking very anxious, he returned, not to the Medicine Concocting Pavilion, but his courtyard, where he waited for the sun to rise.</p><br/><p>“Qian Dajin, you just wait until I get to Foundation Establishment. Then I’ll show you a thing or two!” Bai Xiaochun was more nervous than ever, and his eyes were completely bloodshot. He was scared of dying, after all, and now that he was no longer a newcomer to the sect, he was well aware of how the cultivation world worked.</p><br/><p>For the entire night, his imagination went wild as he thought about all the bad things that could happen, until eventually... the sun rose.</p><div id=\"footnote-4511\"><br/><p>1. 1. Hou Yunfei showed Bai Xiaochun around the sect in chapter 14 <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}