{"title": "Chapter 54: Principles!", "id": 54, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-54-principles", "volume_title": "Volume 1", "body": "<h1>Chapter 54: Principles!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Seeing that the two sixth level cultivators were fleeing, Bai Xiaochun performed an incantation gesture, then waved his finger. His little wooden sword instantly flew through the air, slashing across the neck of one of the cultivators.</p><br/><p>His companion's eyes instantly shone with an unprecedented level of astonishment and terror.</p><br/><p>They were the ones who were supposed to be doing the chasing and killing, but now... the tables had turned, and they were being cut down!</p><br/><p>In a few short moments, Bai Xiaochun had already killed four people!</p><br/><p>The remaining sixth level cultivator had an ashen face as he went all out to try to escape. His heart was pounding, and he was trembling all over. How could he ever have imagined that the slender, pure and fair Spirit Stream Sect disciple could... be so utterly terrifying?</p><br/><p>Bai Xiaochun’s eyes shone with a savage gleam, and he was just about to give chase when, all of a sudden, a sensation of danger welled up in his heart.</p><br/><p>At the same time, Du Lingfei cried out urgently, “Watch out!”</p><br/><p>Bai Xiaochun immediately leaped backward. In almost the exact same instant, a three-meter tall violet skull shot into the area where he had just been standing, then exploded.</p><br/><p>A boom rang out as the power of explosion blasted out, slamming into Bai Xiaochun. For the first time, his Undying Iron Skin felt pain, and blood even oozed out of his mouth as he flew backward.</p><br/><p>The person to attack him had been none other than Chen Yue, who was in the eighth level of Qi condensation.</p><br/><p>His expression was unsightly, and a very serious look could be seen in his eyes. After saving his fellow clan member from danger, he flashed through the air toward Bai Xiaochun. Behind him were two other cultivators, who were in the sixth level of Qi Condensation. They gritted their teeth and followed along.</p><br/><p>Three people were now charging toward Bai Xiaochun.</p><br/><p>Hou Yunfei wanted to help, but was simply too weak. The attack he had made earlier drained him of the last scrap of spiritual energy he had, and blood was currently seeping out of the corners of his mouth. Unfortunately, he was in no state to fight.</p><br/><p>Du Lingfei had been seriously injured, and as she anxiously watched Bai Xiaochun fighting, she realized that all of the previous hostility and prejudice she had felt toward him were gone.</p><br/><p>Bai Xiaochun’s face was ashen as more blood oozed out of his mouth. He appeared to be on the verge of collapsing, and had seemingly lost much of the speed he had been capable of earlier. Seeing that, Chen Yue and his companions closed in for the kill.</p><br/><p>However, as they closed in, a brutal gleam appeared in Bai Xiaochun’s eyes. While it was true that his Undying Iron Skin couldn't completely block Chen Yue’s attack moments ago, the truth was that it had absorbed the majority of the force of the attack. His current weak state, and even the blood oozing out of his mouth, were all an act.</p><br/><p>In the blink of an eye, he redoubled his speed. Furthermore, instead of retreating, he switched directions, passing Chen Yue toward his true target... the two sixth level Luochen Clan cultivators.</p><br/><p>Chen Yue’s face flickered, and even as he made to block Bai Xiaochun’s path, Bai Xiaochun’s wooden sword shot toward him. Chen Yue performed an incantation gesture and pointed out, summoning the same skull from earlier. Rumbling sounds echoed out, but Chen Yue was incapable of stopping Bai Xiaochun.</p><br/><p>A fierce gleam appeared in Chen Yue’s eyes, and he waved his sleeve, causing a lantern to materialize, which expanded out in a fireball that sped toward Bai Xiaochun.</p><br/><p>At the same time, the two weaker cultivators were crying out in shock and falling back in retreat. However, Bai Xiaochun moved as fast as lightning, and was almost instantly upon one of them, whereupon he reached out with his thumb and index finger, causing a flickering black glow to appear as he pinched his fingers together.</p><br/><p>Throat Crushing Grasp!</p><br/><p>The nearest Luochen Clan cultivator screamed, and then a cracking sound echoed out as his neck was crushed. At the same time, the blisteringly hot fireball was closing in on Bai Xiaochun from behind, and there was clearly no time for him to jump out of the way. Instantly, it slammed into him.</p><br/><p>A sea of flames exploded out, surrounding Bai Xiaochun, and causing both Du Lingfei and Hou Yunfei to shout out in alarm: “Bai Xiaochun!!”</p><br/><p>Further off, the surviving cultivator among the duo seemed delighted at the sight of Bai Xiaochun being consumed by the fire, and even started laughing.</p><br/><p>But then something barreled out from within the sea of flames to appear directly in front of that laughing cultivator. His eyes went wide, and before he could even retreat, Bai Xiaochun kicked down viciously, crushing the man’s head into his torso. He didn’t even have a chance to scream before he was completely dead.</p><br/><p>By this point, Bai Xiaochun was panting, and his eyes were even more shot with blood than before. Wounds riddled his body, and blood was oozing out of his mouth as he slowly looked up to glare at the last member of the Luochen Clan... Chen Yue!</p><br/><p>Being stared at in such a way caused Chen Yue’s heart to prickle. His cultivation base was in the eighth level of Qi Condensation, and he could be considered one of the Chosen in his clan. Although he didn't quite have the status of crown prince, he had the approval of the patriarch and had experienced numerous deadly battles with beasts in the Fallenstar Mountains. Such deadly tempering had given him extraordinary battle prowess.</p><br/><p>As such, he completely looked down upon disciples of the Spirit Stream Sect. Although they far exceed him in terms of status, to him, cultivators from the big sects were like flowers in a flowerpot. Although they had extraordinary divine abilities, when it came to battles of life and death, they couldn't possibly match up to him.</p><br/><p>And yet now, Bai Xiaochun caused terror to well up inside of him. In fact, the moment that Bai Xiaochun’s eyes locked onto him, he felt more frightened than any time he had encountered a wild beast in the Fallenstar Mountains.</p><br/><p>That gaze contained a ferocity that seemed to wish to consume him alive, and caused coldness to spread out in Chen Yue’s heart.</p><br/><p>When he thought about the fact that this person had slaughtered six of his fellow clan members in quick succession, he was completely and utterly shaken. In fact, what was most unbelievable of all was that this person's cultivation base... was merely in the great circle of the sixth level of Qi Condensation.</p><br/><p>“He’s way too powerful and fast! He obviously cultivates some sort of body refinement magic, and has cultivated it to the level that he can kill people in one blow!</p><br/><p>“Furthermore, his defenses are terrifying!</p><br/><p>“He doesn’t have any magical techniques, but his control over his flying sword is incredible. The sword not only moves with unimaginable speed, it’s backed with astonishing power. And that wooden sword is definitely no ordinary item. It’s obviously something so incredible it can kill someone in the sixth level of Qi Condensation!</p><br/><p>“This guy must be a famous Chosen from the Spirit Stream Sect. How come I’ve never heard his name before? Bai Xiaochun!” In his shock, Chen Yue felt a desire to fight burning within him. He waved his hand, causing three fist-sized jade skulls to fly out.</p><br/><p>His expression was very serious as he looked over at Bai Xiaochun.</p><br/><p>“I underestimated you, but that’s not going to happen again. Let’s see which is more powerful, the magical techniques of your Spirit Stream Sect, or the killer ghouls of my Luochen Clan!”</p><br/><p>Even as his words continued to echo out, Chen Yue performed an incantation gesture, causing the three skulls to suddenly begin to scream in very lifelike fashion. They also rapidly grew larger, until each one was fully three meters tall. Then, they all shot toward Bai Xiaochun.</p><br/><p>Bai Xiaochun’s breath came in ragged pants. His mind was a blank, devoid of any thinking. He had forgotten about the possibility of dying, and the only thing he had was the impulse to cut down his opponent.</p><br/><p>As the skulls closed in on him, he quickly performed an incantation gesture with his right hand, then waved his finger, sending his little wooden sword screaming out, to be joined by two other ordinary flying swords. Instantly, massive amounts of sword light filled the area as Bai Xiaochun began his charge.</p><br/><p>There was also a little shield which appeared and began to fly around him, radiating magical light.</p><br/><p>A moment later, Bai Xiaochun and his flying swords slammed into the skulls, causing massive rumbling sounds to echo out. Instantly, fierce fighting broke out between Bai Xiaochun and Chen Yue.</p><br/><p>Chen Yue was in the eighth level of Qi Condensation, with a cultivation base much more profound that Bai Xiaochun’s. However, in terms of power and defense, as the two fought, it became obvious that they were about even.</p><br/><p>Waves of shock battered Du Lingfei’s heart. She was so nervous that her hands were clenched into fists, and her fingernails dug painfully into her palms.</p><br/><p>The annoying Bai Xiaochun she remembered from the competition was nowhere to be seen. He had been replaced by someone with veins of steel, someone who was able to fight with Chen Yue of the Luochen Clan!</p><br/><p>“I misjudged him.... This is the real Bai Xiaochun....</p><br/><p>“He really is afraid of dying, but to come back and fight to the death like he has done takes far more courage than that possessed by most ordinary people....” As she looked at Bai Xiaochun, Du Lingfei’s eyes glowed with increased vigor.</p><br/><p>“Even though he fears death, his heart is strong, and he has principles. Even if he is afraid of getting killed, he won't give up on his companions....”</p><br/><p>Ear-splitting booms rang out constantly. Before long, Bai Xiaochun’s two ordinary flying swords were destroyed. Only his wooden sword remained. However, the three skulls were much dimmer than before, and were clearly significantly damaged as they flew back to Chen Yue.</p><br/><p>Bai Xiaochun took advantage of the opportunity that provided to launch another attack. Blood sprayed out of Chen Yue’s mouth as Bai Xiaochun’s Throat Crushing Grasp latched onto his arm. Cracking sounds rang out as the bones were shattered. However, Chen Yue still managed to spit a tiny sword out of his mouth, which shot toward Bai Xiaochun and stabbed a full inch into his shoulder!</p><br/><p>Not even the Undying Iron Skin could stop it, and blood immediately began to flow. Chen Yue instantly shot backward, but before he could get very far, Bai Xiaochun, eyes bloodshot and completely disregarding his own injuries, gave chase at top speed.</p><br/><p>Chen Yue’s face looked extremely unsightly as he clenched his jaw in the face of the deadly situation that was developing. He quickly performed an incantation gesture and then tapped his forehead, causing his entire body to tremble. Even as all of the qi and blood in his body began to surge violently, he slapped his hand down onto the crown of his head.</p><br/><p>“Bai Xiaochun, someone is going to die today, and it will be either me or you!” On any other occasion, Chen Yue would have already ceased fighting. But this was a critical moment for his clan, and he knew that he had to kill Bai Xiaochun. He quickly spit out some of his life blood, which was voraciously consumed by the three skulls.</p><br/><p>“Ghoul Bloodbath!” he howled as he unleashed his secret magic. The three skulls’ eyes began to glow with mysterious light as they shot toward Chen Yue and began to madly chew away at his flesh and blood as they tried to burrow into his body.</p><br/><p>The bizarre sight caused Du Lingfei and Hou Yunfei to gasp. Simultaneously, Chen Yue let out a miserable howl. His entire body was shaking, and his expression was completely vicious as a black fog roiled out from inside of him, transforming him into a three-meter-tall ghoul!</p><br/><p>“Die!” he roared, shoving his hand out as he shot toward Bai Xiaochun.</p><br/><p>“You’ll be the one to die!” Bai Xiaochun howled. His hands flashed in a double-handed incantation gesture, and then he pointed up into the air. Spiritual energy roiled madly out of him, shooting up into the air to form the shocking image of a cauldron!</p><br/><p>This was none other than...</p><br/><p>Violet Qi Cauldron Summoning!</p><br/>\n</div>"}