{"title": "Chapter 62: Killing a Chicken With a Battle-Axe!", "id": 62, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-62-killing-a-chicken-with-a-battle-axe", "volume_title": "Volume 1", "body": "<h1>Chapter 62: Killing a Chicken With a Battle-Axe!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Deep within the jungle of the nameless mountain range, the rainfall eventually began to lighten. Around evening, it stopped, and the setting sun just managed to create a little bit of a rainbow.</p><br/><p>However, as the sun set, the rainbow gradually faded away.</p><br/><p>The jungle was quiet. Even the stench of blood had vanished. However, the corpse-lined path stretching backward bore testament to the deadly fighting which had played out.</p><br/><p>As Chen Heng slipped away into death, his eyes continued to shine with an unyielding, incredulous expression.</p><br/><p>Next to his corpse, Bai Xiaochun lay still and unmoving. The flame of his life force was roughly ninety percent extinguished, with only a little spark left behind, struggling to stay alive.</p><br/><p>Eventually, footsteps could be heard from off in the distance. Someone was walking through the muddy rainwater and fallen leaves, to eventually come to a stop next to Chen Heng.</p><br/><p>It was an old man wearing a long black robe. He had flowing white hair, and his face was covered with wrinkles, making him seem profoundly ancient. Apparently, he had lived for so long than an aura of death was already seeping out from him.</p><br/><p>“Intense focus has bolstered his soul... he’s dead, and yet his soul hasn’t dispersed. But that won’t last for long.” The man’s voice was raspy, but also vague and bizarre as it echoed out into the jungle. Suddenly, the forehead of Chen Heng’s corpse split open, and a green wisp of qi floated out. It swirled together in midair, forming into the blurry image of a soul, about the size of the palm of a hand.</p><br/><p>This was Chen Heng, although his eyes were blank and he was trembling, as if his mind and consciousness were gone.</p><br/><p>The old man extended a finger, and Chen Heng’s soul flew toward him and disappeared inside.</p><br/><p>After taking away Chen Heng’s soul, the mysterious old man looked over at Bai Xiaochun, mixed emotions playing out on his face. He even seemed to be reminiscing about the past.</p><br/><p>“I never imagined that I would once again lay eyes on... the Undying Live Forever Technique....” He closed his eyes for a moment, and then sighed. That sound seemed to transform his surroundings. Time seemed to suddenly flow differently, as if the entire area were being separated from the rest of the world.</p><br/><p>The innumerable plants in the area suddenly went still, as if in death, and then transformed into ash.</p><br/><p>Chen Heng’s corpse instantly withered up, and within the space of a few breaths of time, was nothing more than a skeleton. Even that turned into dust, which crumbled down into the muddy ground.</p><br/><p>Only Bai Xiaochun wasn't affected. In fact, vast amounts of life force poured into him, rapidly healing his various injuries.</p><br/><p>The old man stood there with his eyes closed, as motionless as a statue. It almost looked... as if he possessed no aura whatsoever, nor any life force. It was like he didn’t exist at all within the world, a discarnate soul who refused to be reborn.</p><br/><p>Meanwhile, in the same moment that Chen Heng died, Patriarch Luochen was back in the Luochen Clan in the Fallenstar Mountains. Suddenly, his eyes snapped open, and an uneasy feeling filled his heart. He looked around at the clan members around him, and could see that quite a few of the eleven cultivators sent out of the clan had been killed. However, when he saw that Chen Heng’s soul still existed, he felt slightly better.</p><br/><p>“They’re only three Outer Sect disciples, how could they have lasted so long...?” he muttered. “So many clan members have been killed. Well, considering the level of Heng’er’s cultivation base, there’s no way they could kill him. Most likely, he’s already wiped them out and is on his way back.” The uneasy feeling still lurked there inside of him, though. Eyes flickering, he sent a few more clan members out to investigate, all of whom were in the seventh level of Qi Condensation.</p><br/><p>Having done that, he took a deep breath.</p><br/><p>“It doesn’t matter now. The Inverse Blood Grand Magic only needs one more day of work!” Gritting his teeth, he suppressed the uneasiness he felt. He knew that there was no backing out of the plan now, and really no other option than to hold on for another day... then everything would be worth it!</p><br/><p>In that same moment, Hou Yunfei was in a valley a bit more than five kilometers away from the border of Patriarch Luochen’s security spell formation. His face was ashen, and he had reached the point where he couldn’t take another step further. Coughing up a mouthful of blood, he collapsed to the ground, chuckling bitterly.</p><br/><p>“Junior Brother Bai... I’m sorry, I can’t save you....” He clenched his hands in anguish and helplessness before passing into unconsciousness.</p><br/><p>In another direction was Du Lingfei, her hair disheveled, her skin sallow. Her qi passageways were almost completely destroyed, and she cut a completely different picture than she had in the past, in her peak of beauty.</p><br/><p>Her eyes were lustreless, and she looked almost like the walking dead. However, a shocking level of willpower kept her staggering forward, clutching a jade slip in her hand. There was only one thought in her head, a thought that wouldn't leave.</p><br/><p>She had to break free and send word to the sect. She had to... save Bai Xiaochun.</p><br/><p>She proceeded along, one step after another. When she fell to the ground, she would crawl back to her feet. Her clothing was torn, her veins were bleeding dry, and she could barely see clearly. And yet... she kept moving forward.</p><br/><p>Time passed. Du Lingfei had long since forgotten about the injured state of her body. She wasn’t thinking about her own life, nor could she even remember how long she had been walking. She proceeded along until suddenly she experienced a sensation like passing through a sheet of water. In that moment, her eyes began to shine brightly.</p><br/><p>“Am I out...?” she murmured through parched, cracked lips. Trembling, she looked at the jade slip clutched in her hands, the jade slip which hadn’t so much as vibrated once during the past half month. But now, it vibrated, as though an invisible connection had suddenly been established... linking her to the sect.</p><br/><p>“The Luochen Clan has turned traitor. Elder Brother Feng died in battle. I'm not sure if Elder Brother Hou is still alive, and Junior Brother Bai... drew the enemy away so that we could escape. I am disciple Du Lingfei, and I beg of the sect... to send backup immediately.” As soon as she finished sending the message, Du Lingfei sagged down into a sitting position. Then she turned to look behind her, tears streaming down her face.</p><br/><p>She would never forget how Bai Xiaochun had returned to fight, as if he had veins of steel. She would never forget the tragic and moving image of him running out to draw the attention of the Luochen Clan. She would never forget everything that had happened on their journey together.</p><br/><p>“Junior Brother Bai, Elder Brother Hou... you have to stay alive....” Du Lingfei wept, her tears falling to the ground in front of her. Eventually, she couldn’t hold on any longer, and collapsed into unconsciousness.</p><br/><p>As Du Lingfei was transmitting her message, the Missions Office back on the Fragrant Cloud Peak in the Spirit Stream Sect was as busy as ever. Outer Sect disciples were running back and forth handling various tasks, and deep within the Missions Office itself, there was a middle-aged man in a Daoist robe who was in the middle of maintaining the records about various missions. Arrayed in front of him was a collection of thousands of jade slips, which contained the information of all sect disciples with open missions.</p><br/><p>Suddenly, one of the jade slips flickered with light. Expression the same as ever, the middle-aged man waved his hand, causing the jade slip to fly over into his hand. After scanning it with divine sense, his eyes went wide, and he shot to his feet.</p><br/><p>“The Luochen Clan has turned traitor!!” he cried, panting. The enormity of such a matter could not be understated. Whether or not it was true or false, he absolutely had to report the matter to his superiors. Holding back such information was a crime punishable by execution, so he didn't dare to dally. He immediately produced a violet jade slip from his robe and transmitted the new intelligence.</p><br/><p>The report was instantly sent to the Hall of Justice. Of course, Qian Dajin worked in the Hall of Justice, but he had a very lowly position, and an intelligence report like this was something he didn’t even qualify to look at. Almost as soon as the report arrived at the Hall of Justice, the entire organization sprang into immediate action. After all, the Hall of Justice was tasked with defending the entire Spirit Stream Sect, and the efficiency with which they went about it was shocking.</p><br/><p>It only took the time it takes an incense stick to burn to verify the authenticity of the report.</p><br/><p>Then, war drums began to sound through the entire south bank. All of the disciples looked around in shock. The Outer Sect disciples didn't know the significance of the war drums, but the Inner Sect disciples on the three mountain peaks all knew, and it caused their expressions to flicker as they looked up from whatever they were doing.</p><br/><p>“What happened?”</p><br/><p>“When the war drums beat, we can’t return to the Spirit Stream Sect until blood is shed and the enemy clan is exterminated!! Heavens....”</p><br/><p>Even as everyone was reeling in shock, the voice of an old man suddenly filled the entire south bank of the Spirit Stream Sect.</p><br/><p>“I am Ouyang Jie of the Hall of Justice. All Inner Sect disciples of the south bank’s three mountain peaks are to immediately cancel all previous missions, activities, and secluded meditation sessions. You have twenty breaths of time to gather at the main gate! Tardiness will not be tolerated!”</p><br/><p>Even as the words left his mouth, the Inner Sect disciples on Green Crest Peak, Fragrant Cloud Peak, and Violet Cauldron Peak immediately dropped whatever tasks they had at hand. Trembling, but without the slightest hesitation, they sprang into motion.</p><br/><p>Even people involved in important tasks didn’t dare to tarry for even a moment. Everyone knew that Ouyang Jie was an elder from the Hall of Justice, and that he was... cold-hearted and merciless!</p><br/><p>He had a Daoist name in addition to his given name; he was known as Daoist Jackal. For him to take the lead in a sect affair meant that something completely infuriating had occurred. It meant... that people needed to die. It meant... that a clan needed to be exterminated!</p><br/><p>Rumbling sounds filled the air as countless figures appeared, speeding toward the main gate. Soon it became clear that among the three mountains of the south bank, there were at least two thousand Inner Sect disciples. Normally, it was a difficult thing to catch sight of one or two, so the sight of so many left the Outer Sect disciples completely shaken.</p><br/><p>There were also several hundred disciples from the Hall of Justice, clad in black robes and led by an old man with bright red hair. That old man radiated intense killing intent, and he was none other than Ouyang Jie.</p><br/><p>Soon, over two thousand people were gathered around the main gate, all of whom wore grim and somber expressions.</p><br/><p>“The Luochen Clan has turned traitor. The sect leader has ordered that their clan... be exterminated all the way down to the chickens and dogs. Activate the Daoseed Teleportation Portal!” Ouyang Jie waved his sleeve, instantly causing a huge pillar of light to rise up from Mount Daoseed, in the middle of the Spirit Stream Sect.</p><br/><p>The light climbed up into the air, transforming into a huge teleportation portal, which instantly enveloped the two thousand disciples. Rumbling could be heard as the teleportation process began.</p><br/><p>The Outer Sect disciples of the south bank gasped, and suddenly, they were filled with sensations of deep pride regarding their sect.</p><br/><p>Compared to the Spirit Stream Sect, the Luochen Clan was small, with only one Foundation Establishment cultivator. And yet, for the sake of a few Outer Sect disciples, the Spirit Stream Sect had mobilized two thousand individuals. Then there was the violent and powerful Ouyang Jie. All of that... was a mighty threat!</p><br/><p>It was a threat to all of the cultivator clans in the territory controlled by the Spirit Stream Sect. The old saying asks, “Why use a battle-axe to kill a chicken?” In this situation, the Spirit Stream Sect provided the answer: “How else do you kill chickens than with battle-axes?!”</p><br/><p>This was a sect that wouldn’t hold back any resources, not even when it came to Outer Sect disciples. That in turn caused the Outer Sect disciples’ loyalty toward their sect to reach new heights.</p><br/><p>The Spirit Stream Sect had stood strong for ten thousand years, growing from a tiny little organization to its current height. Naturally, there were aspects to it that others would find astonishing!</p><br/><p>It was in this moment that, all of a sudden, there on the temple at the very top of Fragrant Cloud Peak, Li Qinghou flew out, face grim, aura murderous. That aura swept out explosively, creating a wild tempest as he shot toward the teleportation portal.</p><br/>\n</div>"}