{"title": "Chapter 63: Crushing The Luochen Clan!", "id": 63, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-63-crushing-the-luochen-clan", "volume_title": "Volume 1", "body": "<h1>Chapter 63: Crushing The Luochen Clan!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It only took Li Qinghou a moment to reach the teleportation portal, where he hovered like an unsheathed blade, radiating an intense murderous aura.</p><br/><p>Ouyang Jie looked over at him, and his pupils constricted slightly. Among the three peak lords on the south bank, Ouyang Jie viewed Li Qinghou as the most important. In fact, he was actually one of the most important people in the entire Spirit Stream Sect.</p><br/><p>Not only was he a master apothecary, his profound natural talents were extremely rare. For example, he had only practiced cultivation for about a hundred years, but had already reached late Foundation Establishment. In fact, it was even said that, within the entire sect, he was the most likely candidate to break through from Foundation Establishment and acquire a Gold Core.</p><br/><p>“I heard that one of those four Outer Sect disciples is connected to Li Qinghou somehow....” Ouyang Jie thought. At the same time, rumbling could be heard from the spell formation, and countless dazzling beams of light rose up. Instantly, the group of two thousand cultivators, including Li Qinghou, became blurry, and then disappeared altogether.</p><br/><p>The journey which had taken Bai Xiaochun and the others several months to complete, occurred in only a few seconds, thanks to the activation of the Spirit Stream Sect’s teleportation portal.</p><br/><p>Rumbling like thunder filled the air over Du Lingfei’s unconscious form. The sky dimmed as something like an invisible hand ripped open a huge rift, revealing the image of an enormous spell formation.</p><br/><p>It descended rapidly to the ground, causing everything to quake in a fifty kilometer area. Blazing, fiery lines appeared in the ground as the shape and design of the spell formation appeared on the surface of the land.</p><br/><p>Within that 50 kilometer area, all grass, rocks, mountains, everything turned into ash, vanishing in an instant. This spell formation was incredibly domineering, and destroyed everything that got in its way.</p><br/><p>Du Lingfei was in that area, and immediately fell under the protection of the spell formation, ensuring she wasn’t harmed at all. Even as the land shook, numerous figures came into view.</p><br/><p>It took only a moment for the more than two thousand Inner Sect disciples from the south bank to appear. There was still enough teleportation power swirling around them for another teleportation to be carried out, but first, Ouyang Jie and Li Qinghou strode forward to the unconscious Du Lingfei. Several female disciples reached her ahead of them, covering her with a set of spare garments and also administering some medicinal pills. With the influx of spiritual energy, Du Lingfei gradually opened her eyes. Her expression was blank, but when she saw all of the forces from the sect surrounding her, she began to weep, and a feeling of excitement flooded through her.</p><br/><p>Furthermore, considering she was an Outer Sect disciple of Fragrant Cloud Peak, when she noticed Peak Lord Li Qinghou standing there, even more tears welled up in her eyes. At the same time, disciples on either side of her helped her to rise to a sitting position.</p><br/><p>“Peak Lord, please rescue Junior Brother Bai....” she implored, face ashen.</p><br/><p>“What happened to him?!” Li Qinghou said, stepping forward to stand directly in front of Du Lingfei. His eyes burned with fury and deep anxiety.</p><br/><p>“Junior Brother Bai... went out on his own to draw the Luochen Clan cultivators away, so that Elder Brother Hou and I could escape. They started chasing after him....” Weeping, she went on to explain the entire situation.</p><br/><p>Few of the surrounding two thousand disciples knew Bai Xiaochun, but as they listened to Du Lingfei’s tale, they were visibly moved. The intense and tragic events even caused them to gasp.</p><br/><p>They learned about how Feng Yan fell in battle to protect his fellow disciples, and how Hou Yunfei and Du Lingfei risked almost certain death to try to escape. They heard about how the Luochen Clan sent out two waves of cultivators in pursuit, including several in the eighth level of Qi Condensation, and one in the ninth....</p><br/><p>Even these members of the Inner Sect would be hard pressed to make it out alive under such circumstances.</p><br/><p>When Du Lingfei talked about Bai Xiaochun, they could sense how devoted and loyal he was. In fact, he was already the type of person who could be considered Chosen.</p><br/><p>He had the option of fleeing on his own, but instead returned to save his fellow disciples. He fought enemies far more powerful than himself, then helped carry his two wounded companions for more than half a month, on a journey of nearly 5,000 kilometers.</p><br/><p>In the end, he chose to sacrifice himself rather than his principles, all to give his fellow disciples a chance to make it out alive. The result was that Du Lingfei was able to send her message. Were it not for that, the sect might not have learned about the traitorous actions of the Luochen Clan until it was too late.</p><br/><p>It didn’t take long before Bai Xiaochun's name had taken root deep within the hearts of the Inner Sect disciples. To them, he was profoundly devoted and loyal, an elegant and even heroic man, someone with veins of steel.</p><br/><p>The people from the Hall of Justice were completely shaken. Among their number was Qian Dajin, whose jaw dropped as he heard Du Lingfei’s story. He almost couldn’t believe that the Bai Xiaochun she was talking about was the same person in his mind. His impulsive plotting earlier had left him nervous about possible investigations on the part of the sect. Although he hadn’t been absolutely sure that Bai Xiaochun was the little turtle, in his pettiness, he would rather kill the wrong person accidentally than risk the right person getting away. As of this moment, he breathed a sigh of relief. With Feng Yan being dead, there was no way word would get out.</p><br/><p>Even the iron-hearted Ouyang Jie, Daoist Jackal, couldn't help but sigh in response to the tale, and a gleam of admiration appeared in his eyes. Considering the level of his cultivation base, he could tell at a glance that Du Lingfei wasn’t making the story up; everything she had said, although perhaps not completely accurate, was the truth.</p><br/><p>“The Spirit Stream Sect cannot permit a disciple such as that to perish in this place!” Ouyang Jie flicked his sleeve and immediately sent several hundred disciples out to search for Hou Yunfei and Bai Xiaochun.</p><br/><p>Li Qinghou slowly looked off into the distance, eyes completely bloodshot, heart aching bitterly. Considering what Bai Xiaochun had done here, Li Qinghou suddenly felt as if he had judged him incorrectly. At the same time, he knew that, considering the circumstances, Bai Xiaochun chances of getting out alive... were small, to say the least.</p><br/><p>“And I was the one who brought you to this sect....” he thought. His murderous aura exploded out with even more intensity. Taking a step forward, he drew upon some of the remaining teleportation power to suddenly vanish in the direction of the Luochen Clan.</p><br/><p>Ouyang Jie sighed. After hearing Du Lingfei’s tale, he knew that the situation did not bode well for Bai Xiaochun. Flickering into motion, he gathered the remaining forces and began another teleportation.</p><br/><p>Rumbling echoed out in all directions as Li Qinghou and Ouyang Jie led nearly two thousand disciples to appear in midair above the Luochen Clan mansion in the Fallenstar Mountains.</p><br/><p>The cloud layers were ripped apart as the teleportation portal became a powerful attack bearing down with intense energy of heaven and earth. Cries of alarm rang out within the mansion as the spell formation descended upon it.</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The spell formation landed, instantly shattering the limestone flooring, transforming it into ash. The mansion itself collapsed into rubble.</p><br/><p>Roars of rage echoed out as numerous figures flew out, expressions of fury and hopelessness on their faces.</p><br/><p>The guardian stone lions and the fruit trees from the courtyard transformed into puppets that instantly went on the offensive. Li Qinghou was the first person to make a move. He waved his sleeve, causing the lions to explode loudly. As for the fruit trees, they trembled, and the fruit began to fall off their branches. However, even as the fruits fled, they were destroyed.</p><br/><p>Rumbling echoed out as the Spirit Stream Sect disciples unleashed mass destruction.</p><br/><p>Li Qinghou shot toward the center of the destroyed Luochen Clan mansion. His right hand flashed with an incantation gesture, and he waved his finger, summoning a green fireball. His hair flew wildly about him as he then sent the fireball blasting down into the ground.</p><br/><p>Flames erupted, smashing into the rubble of the mansion and sweeping it away. The handful of enemy cultivators who had been attacking let out miserable shrieks as they were instantly incinerated.</p><br/><p>Next, Li Qinghou lifted his right foot into the air and stamped it down hard. The land shattered, and a huge crevice was ripped open, revealing the necropolis down below.</p><br/><p>At almost exactly the same time, a vortex of blood spiraled out, followed by the Luochen Clan’s patriarch.</p><br/><p>When the man saw Li Qinghou, his face filled with an expression of despair. The Spirit Stream Sect had arrived too suddenly. The spell formation he was working on was on the cusp of being completed, and had anyone else arrived, he might have been able to delay them for long enough. But unexpectedly, the people who came were none other than Li Qinghou and Ouyang Jie!</p><br/><p>The patriarch fell back, crying out miserably, “Flee! Anyone who can escape, get out of here!”</p><br/><p>Trembling, the Luochen Clan cultivators in the necropolis scattered in all directions. However, Ouyang Jie’s face was expressionless as he waved his hand, sending the Inner Sect disciples after them in pursuit.</p><br/><p>Li Qinghou’s eyes locked onto Patriarch Luochen, and the lake of blood that surrounded him. Ouyang Jie did the same, and then, flames of rage appeared in both mens’ eyes.</p><br/><p>“You slaughtered innocent mortals?” Li Qinghou growled. “The heavens cannot tolerate the existence of a clan like yours!” With that, he waved his sleeve, sending a destructive sea of flames out.</p><br/><p>At the same time, bloodcurdling screams began to rise up as the Spirit Stream Sect disciples began to slaughter and crush the Luochen Clan cultivators.</p><br/><p>Two thousand people versus a few hundred.</p><br/><p>Patriarch Luochen could only watch as everyone in his clan was killed, both descendants from his own bloodline, and members of other bloodlines. Screaming miserably, he fled at top speed in an attempt to escape.</p><br/><p>However, in that instant, he was overwhelmed by Li Qinghou’s sea of flames. Face extremely grim, Li Qinghou clenched his hand into a fist.</p><br/><p>RUMBLE!</p><br/><p>Patriarch Luochen’s screams intensified as he erupted into flames. His flesh and blood were incinerated, and in the blink of an eye, he was reduced to nothing more than ash. Li Qinghou... killed him with one attack!</p><br/><p>When the surrounding Inner Sect disciples saw that, they gasped in shock. Even Ouyang Jie’s eyes went wide in astonishment.</p><br/><p>As Li Qinghou hovered there in midair, he waved his hand again, sending the sea of flames exploding out again. The entire Luochen Clan was engulfed, and everything began to burn. Li Qinghou looked off into the distance, his expression somewhat disconsolate.</p><br/><p>Sighing, he said, “Bai Xiaochun, I, Li Qinghou... have let down your Bai Clan.” In his bitterness, he flew off into the distance. He wasn’t willing to entrust the search for Bai Xiaochun to others. If there was even the slightest hope that he was alive, he himself would search for him.</p><br/><p>Li Qinghou left, flames rising high into the sky behind him. As for the Inner Sect disciples, expressions of excitement began to appear on their faces. Now more than ever, they realized how powerful and glorious their sect was.</p><br/>\n</div>"}