{"title": "Chapter 67: Elder Brother, Wheres Our Master?", "id": 67, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-67-elder-brother-wheres-our-master", "volume_title": "Volume 1", "body": "<h1>Chapter 67: Elder Brother, Wheres Our Master?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Spirit Stream Sect had eight mountain peaks. Four were on the north bank, three were on the south bank, and one was in the middle.... That was Mount Daoseed, which was the public seat of the sect’s power. Normally, Sect Leader Zheng Yuandong would handle sect affairs from that very location.</p><br/><p>Currently, bells were tolling as the Lords of the various mountain peaks of the north and south bank sat tall and straight in the main temple hall. The sect leader was also there, sitting in the center position.</p><br/><p>Soon, Li Qinghou and Ouyang Jie arrived with Bai Xiaochun. They left Bai Xiaochun outside of the temple hall, telling him to wait there as they went in.</p><br/><p>There were four disciples stationed as guards outside the temple, who cast curious glances Bai Xiaochun’s way.</p><br/><p>Bai Xiaochun smiled back at them. This was his first time coming to this place; the spiritual energy was abundant, and the fragrant aroma of plants and flowers filled the air. There were no extraneous sounds in the air; everything was calm and quiet, much different than Fragrant Cloud Peak.</p><br/><p>This was a very important place in the sect, and normally, any disciple who came here would act very cautious and discreet. However, Bai Xiaochun didn't seem to feel any pressure at all, and stood there looking very much at ease.</p><br/><p>The four disciples couldn’t help but sigh at this, and muse that Bai Xiaochun really did deserve to be known as a big shot in the sect, someone who had performed an incredible service. After all, ordinary people could never act so casually in a place like this.</p><br/><p>The truth was that although Bai Xiaochun feared death, after considering the meritorious service he had performed, he knew that he wouldn’t be dying here. Therefore, it was only natural that he wouldn't be afraid. He stuck out his chest, heart filled with anticipation over what his reward might be.</p><br/><p>“Considering the level of service I provided for the sect, they’ll have to give me a medicinal pill to increase my longevity by a hundred years. They’ll most likely give me 1,000,000 merit points too, and probably an incredible immortal’s cave. I'm sure to be promoted to the Inner Sect as well. Hahaha.” The more he thought about it, the more excited he got. After a long moment passed, however, no word came calling him into the temple.</p><br/><p>Bai Xiaochun was a bit taken aback. He continued to wait until he was yawning before, finally, a voice spoke in a somewhat begrudging tone.</p><br/><p>“Bai Xiaochun, come in.”</p><br/><p>His spirits instantly lifted. Taking a deep breath, he tried to look like the picture of a disciple who would go through hell or high water for his sect. Striding into the main temple, he clasped hands and bowed.</p><br/><p>“Disciple Bai Xiaochun from Fragrant Cloud Peak, at your service. Greetings, Sect Leader. Greetings, other Senior members of the sect.”</p><br/><p>After offering formal greetings, Bai Xiaochun looked up. He immediately caught sight of an old man sitting in the middle of the group. He looked threatening without being angry, and wore a long white robe. His cultivation base was completely unreadable.</p><br/><p>He was surrounded by eight others, a group of six men and two women. Li Qinghou and Ouyang Jie were among them, and all of them seemed to be measuring up this Bai Xiaochun who had somehow returned alive.</p><br/><p>Their eyes lingered on his garments. Considering the power of their eyesight, it was instantly obvious to them that Bai Xiaochun’s clothing had not been intentionally torn, but that he had truly experienced a deadly battle.</p><br/><p>They also noticed how pure and fair he seemed. He spoke courteously, and was neither haughty nor overly humble. From the expression on his face, he seemed completely at ease.</p><br/><p>Although none of them reacted at all to what they were seeing, inwardly, their impressions of Bai Xiaochun improved even more. However, a few were still somewhat suspicious of exactly what had occurred.</p><br/><p>Li Qinghou looked at Bai Xiaochun and then slowly said, “Bai Xiaochun, please explain in detail everything involved with the mission to the Luochen Clan, from start to finish.”</p><br/><p>Looking very serious, Bai Xiaochun calmly recounted everything that had occurred, from beginning to end. He left out the incident with the black-robed old man; that was his secret to keep.</p><br/><p>He wove Feng Yan sacrificing himself into the story, as well as the various difficulties they had faced. He was an intelligent person, so he didn’t mention anything at all of what he had done that was worthy of merit, but instead continued to praise Feng Yan, Du Lingfei and Hou Yunfei.</p><br/><p>“It’s all my fault for being useless,” he said. “Elder Brother Feng died trying to save me. It’s all my fault....”</p><br/><p>The more he went on in this way, the more the sect leader and the others’ eyes shone with approval. Of course, these people had practiced cultivation for many years, and were as crafty as devils. From the moment Bai Xiaochun came back wearing that one particular set of clothing, they could tell what type of person he was. Even so, their praise only continued to grow.</p><br/><p>“After he lost consciousness, he just woke up all healed?” the sect leader thought, smiling. He didn’t mind this version of Bai Xiaochun’s explanation. After all, disciples always had secrets to maintain. It was best for them to feel like they belonged in the sect, and exercising absolute control of every aspect of their lives would only serve to have the opposite effect.</p><br/><p>After the story was finished, the sect leader said, “Bai Xiaochun, your reward was already announced several months ago. Back then, you became the Spirit Stream Sect's... Prestige disciple!”</p><br/><p>When the Sect Leader actually spoke the words ‘Prestige disciple’, a strange feeling rose up in his heart. After all, this was the first time there had ever been a living Prestige disciple.</p><br/><p>That was one of the reasons why the discussion had been so difficult earlier. The position of Prestige disciple was extremely important, and had previously only been conferred upon people who had died in battle, never living disciples. And yet, here Bai Xiaochun was right in front of them, healthy and no worse for wear....</p><br/><p>That was one reason why all of them had been so shocked to hear the news that he was alive.</p><br/><p>Furthermore, it was a status that could not just be stripped away. The funeral service had been carried out, and the meritorious service performed. The group had been somewhat perplexed about what to do, and thus had left Bai Xiaochun waiting outside for some time.</p><br/><p>After much discussion, they decided that there was no way to change what had already been announced. In accordance with the sect rules, they would allow Bai Xiaochun to keep that position.</p><br/><p>“Prestige disciple?” Bai Xiaochun asked, looking shocked. He had never heard of any such title before, so he simply stood there, looking blankly at the sect leader and the other Senior sect members. Although all of them had strange expressions on their faces, they didn't say anything else regarding a reward.</p><br/><p>Bai Xiaochun couldn’t hold back from asking, “Uh... that’s it?”</p><br/><p>“That’s it,” replied the Sect Leader, smiling.</p><br/><p>Bai Xiaochun instantly started to get nervous, and then prepared to start explaining how difficult the journey had been, how many times he had almost died. Before he could start, Li Qinghou, who knew Bai Xiaochun better than anyone, cleared his throat and said, “Hurry up and thank the sect leader. The title of Prestige disciple has only been given out ten times throughout the history of the Spirit Stream Sect. You are the only person to get it within the past thousand years.</p><br/><p>“As the Prestige disciple, you rank higher than the Inner Sect, and have the most prestigious glory in the entire Spirit Stream Sect. Your descendants will all have special access to sect resources, and will be Inner Sect disciples from birth. The Spirit Stream Sect will protect your bloodline for all eternity!</p><br/><p>“Currently, there are nine great clans who are part of the Spirit Stream Sect, and all of them are Prestige clans. It’s a truly glorious and honorable position.”</p><br/><p>When Bai Xiaochun heard the explanation, a somewhat sad expression appeared on his face. His spirits suddenly sank, and he looked miserably at Li Qinghou, then back at the sect leader.</p><br/><p>He wasn’t sure what to say. Although the position of Prestige disciple seemed incredible, the truth was that it had been created for the descendants of people who had died. But he was still alive.... Sadly, Bai Xiaochun was now in the unfortunate position of being jealous of his own progeny.</p><br/><p>“Thanks... Sect leader....” he said sadly, lacking the energy to even speak.</p><br/><p>Sect Leader Zheng Yuandong cleared his throat awkwardly. “From this day on, you may address me as Elder Brother sect leader.”</p><br/><p>The matter of having Bai Xiaochun become the apprentice of his own master had been made because he assumed Bai Xiaochun had sacrificed his life. But now that he was alive, it led to a very awkward situation. The sect leader, despite having many years of life under his belt, would now have a twenty-year-old kid calling him Elder Brother. He couldn’t help but sigh inwardly.</p><br/><p>“Really?” Bai Xiaochun asked, his eyes widening. All of a sudden, he felt much, much better. He had entered the temple hall with high expectations, only to have them cruelly crushed. That led to him being in a horrible mood. But now, things had changed.</p><br/><p>“Based on the meritorious service you performed, and considering that you had no formal Master, I took the responsibility to accept you as an apprentice of my own Master. Therefore, from now on you can call me Elder Brother.” The Sect Leader couldn’t feel more awkward.</p><br/><p>Bai Xiaochun took a deep breath, and his eyes filled with excitement. He suddenly was filled with the sensation that the sect truly had treated him well. The sect leader’s Master would most definitely be ranked as a prime elder in the sect, which caused Bai Xiaochun’s eyes to radiate with excitement.</p><br/><p>“From now on,” he thought, “nobody will dare to bully me, not with an awesome Master like that! Hahaha!!” Heart leaping with joy, he clasped hands and bowed deeply.</p><br/><p>“Many thanks, Elder Brother sect leader,” he said, sounding elated. “Elder Brother sect leader, where exactly is our Master? I would love to go pay my respects.”</p><br/><p>A strange expression could be seen on the sect leader’s face as he slowly said, “There’s no hurry in that. There was a portrait made of him before he passed away in meditation, which was enshrined on the back side of the mountain. I've already made arrangements for some people to escort you over there shortly.”</p><br/><p>Bai Xiaochun felt as if he were being struck by lightning. “Passed away in meditation.... Enshrined on the back side of the mountain....”</p><br/><p>His jaw dropped as the words he had just spoken echoed in his mind. After a long moment, he pulled himself together.... The Master he had become apprenticed to... had already passed away.</p><br/><p>“I....” Bai Xiaochun was now starting to seethe with anger, and his mind was buzzing. Once again his heart sank, and he wanted to cry, although no tears would come. It was in a virtual daze that he allowed himself to be led to the rear of the mountain, where he paid formal respects to the portrait of his Master. Afterward, he left Mount Daoseed and returned to Fragrant Cloud Peak.</p><br/><p>On Fragrant Cloud Peak, numerous disciples hurried over to offer greetings. Curious expressions could be seen in their eyes, and someone even kindly took him over to look at his own gravestone.</p><br/><p>When Bai Xiaochun saw the gravestone, everything seemed to go black.</p><br/><p>Eventually, he found himself back in his courtyard, sitting blankly in his log cabin, rage building up within him. “I... I became the apprentice of a painting....”</p><br/><p>Several days later, he was still there, looking miserable. Half a month passed before he managed to collect himself.</p><br/><p>Sighing miserably, he left his residence to look for Big Fatty Zhang, to reminisce about the past. However, as soon as he walked out, he ran into an Outer Sect disciple who instantly clasped hands and bowed deeply.</p><br/><p>“Greetings, Sect Uncle Bai.”</p><br/><p>Bai Xiaochun took a few more steps, then stopped and turned around, eyes shining as he grabbed the Outer Sect disciple and pulled him forward.</p><br/><p>“What did you just call me?”</p><br/><p>“Sect Uncle Bai!” the Outer Sect disciple instantly replied. “Sir, you’re the Junior Brother of the sect leader. D-disciple would naturally call you Sect Uncle Bai!”</p><br/><p>Bai Xiaochun’s fists loosened, and his eyes began to shine even more brightly. His heart also started pounding. This new status of his wasn’t all that bad after all. He had a terrifying level of seniority....</p><br/><p>Licking his lips, he began to laugh, which frightened the Outer Sect disciple so much that he started to edge backward, unsure of what madness had struck Bai Xiaochun.</p><br/><p>Bai Xiaochun suddenly stopped laughing. Clearing his throat, he put on the air of a Senior sect member and nodded slightly at the Outer Sect disciple. Instead of going to look for Big Fatty Zhang, it was with keen anticipation that he headed toward the Missions Office.</p><br/><p>Because... that was where the most people would be.</p><br/><p>Meanwhile, Li Qinghou had returned to Fragrant Cloud Peak, and was in secluded meditation. After seating himself cross-legged, he thought for a bit, and then waved his sleeve. Expression serious, he began to concoct pills.</p><br/><p>“Xiaochun is stubborn and mischievous. I need to prepare a life-saving magical item for him. Unfortunately, I'm not very good at equipment forging, but I can make a batch of Nine Ultimates Pills to trade with the Pill Stream Sect.... When they find out I'm preparing a magical item for a Qi Condensation disciple, and a younger relative at that, they’ll definitely rip me off.” Li Qinghou shook his head, but didn’t mind. In order to concoct Nine Ultimates Pills, he would have to use some of his own heart-blood, but when the thought about how close Bai Xiaochun had come to dying, he settled his qi, cleared his mind, and began preparations to start concocting.</p><br/>\n</div>"}