{"title": "Chapter 75: Ive Been Wrongly Accused!!", "id": 75, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-75-ive-been-wrongly-accused", "volume_title": "Volume 1", "body": "<h1>Chapter 75: Ive Been Wrongly Accused!!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The shocking roar of fury caused even the trees in the area to tremble. Leaves fell, to be picked up by the raging wind, which swept them to and fro.</p><br/><p>When Bai Xiaochun heard the enraged cry, he was so scared he almost jumped straight up into the air. He looked up, and saw the white-haired Elder Zhou hovering up above, veins bulging out all over his neck and face.</p><br/><p>Elder Zhou seemed like a wild beast, and in fact, actually looked quite similar to the way the phoenix had a month ago....</p><br/><p>“Bai Xiaochun, it was you that harmed my phoenix. On this day, even if Li Qinghou tries to interfere, I will teach you a harsh and bitter lesson!” With another thunderous roar, he extended his right hand and made a vicious grasping gesture in Bai Xiaochun's direction.</p><br/><p>That gesture caused the air around Bai Xiaochun to begin to solidify. Bai Xiaochun trembled inwardly and let out a miserable shriek. A silver glow sprang out from his skin, and at the same time, a white light appeared further out as he activated the Divine Crane Shield. From a distance, it almost looked like an eggshell.</p><br/><p>“He’s trying to kill me! He’s trying to kill me!!” As soon as the light enveloped him, he ignored the pressure crushing down from Elder Zhou and unhesitatingly shot off at the highest speed possible.</p><br/><p>“Eee?” murmured Elder Zhou. Although he hadn’t used his full strength, considering he was in the early Foundation Establishment stage, even a fraction of his power should have been enough to prevent any Qi Condensation cultivator from breaking free.</p><br/><p>Looking at the light-wreathed Bai Xiaochun fleeing off into the distance, he roared, “Bai Xiaochun, do you really think I don’t know that you were out to harm me even when you were back in the Ovens? I know that the ginseng root that was meant for my soup was eaten by you, all the way down to the spirit rootlets! I also know that it was your idea to make the bowls shallower. And now you went and fed some medicine to my phoenix! On this very day, I will ensure that you come to understand the severe consequences of stirring up trouble in our sect!”</p><br/><p>With that he gave chase.</p><br/><p>The truth was that all of the elders in the sect knew about the things that went on in the Ovens.</p><br/><p>“You can’t blame me!” Bai Xiaochun shrieked miserably. “That bird of yours stole my medicinal pill! I really had nothing to do with it!” Looking back over his shoulder, he saw the overly aggressive Elder Zhou, his cultivation base unfathomable. Bai Xiaochun immediately pushed forward with as much speed as possible, as if his life depended on it, rapidly transforming into nothing more than a set of afterimages.</p><br/><p>Up in midair, the male phoenix heard Bai Xiaochun’s words, and his feathers immediately stood on end. Letting out a miserable squawk, he pointed his wings at Bai Xiaochun, and if he could talk, he would obviously be crying hysterically to everyone present that it was Bai Xiaochun who had given him the medicine. He most certainly hadn’t stolen it!!</p><br/><p>“Y-you...!” Seeing the phoenix falsely accuse him made Bai Xiaochun feel worse than before. How could he ever have imagined that, given how smart he was, he would one day be framed by a bird?</p><br/><p>Hatred filled his heart. Looking at the bird, he decided firmly in his heart that once this matter was resolved, he would ensure that bird felt what it was like to be humiliated. The bird might be a male, but Bai Xiaochun would find an even manlier bird to teach it a lesson.</p><br/><p>“How dare you quibble over meaningless details!” Elder Zhou said, picking up speed. As he shot toward Bai Xiaochun, he waved his sleeve, causing a massive power to shoot through the air. When it landed on Bai Xiaochun, however, he merely staggered a bit, and then picked up speed as if nothing had happened.</p><br/><p>The scene caused Elder Zhou’s eyes to widen. He had used enough power to send any other Outer Sect disciple tumbling to the ground, and yet Bai Xiaochun treated it as if it were nothing.</p><br/><p>Bai Xiaochun was also shocked. The blow just now had shaken him down to his teeth, and left him trembling. Looking back at Elder Zhou, he quickly produced the Golden Crow Sword and poured some spiritual power into it. The golden crow materialized, and Bai Xiaochun transformed into a golden beam of light that shot up into the air.</p><br/><p>Elder Zhou snorted coldly, and also flew up, joined by his phoenix.</p><br/><p>All of the observing disciples in the area felt quite pleased at the ability to revel in Bai Xiaochun's misfortune. Seeing him flee madly for his life enabled them all to release a bit of the anger which had been festering inside of them.</p><br/><p>Wide smiles blossomed on the faces of Chen Zi’ang and Zhao Yiduo, and Liu Ergou, the so-called Lord Wolf, was so happy that tears streamed down his face.</p><br/><p>“The heavens do have eyes!!” he murmured.</p><br/><p>Flying through the air over Fragrant Cloud Peak, Bai Xiaochun let out a miserable cry. Anyone who wasn’t watching what was happening but heard that scream would be completely shocked.</p><br/><p>“Elder Zhou, your bird’s lying! I’m telling the truth, and he’s making stuff up!” Bai Xiaochun wanted to cry, but no tears would come. He stood atop the golden crow, pushing forward with everything he could muster.</p><br/><p>“Shut up!” Elder Zhou roared. It was bad enough that Bai Xiaochun was constantly saying all kinds of things about his bird, but even worse, there were plenty of people who could hear it, and all of them had odd expressions on their faces. Elder Zhou's right hand flashed with an incantation gesture, causing a blast of air to shoot toward Bai Xiaochun.</p><br/><p>“But it’s true! Your bird is falsely accusing me!” Bai Xiaochun just wanted to resolve the situation, and yet, the blast of air continued to close in, leaving him trembling in fear. Somehow pushing forward with even more speed, he managed to avoid the blast, and it smashed a sizeable hole into a nearby boulder.</p><br/><p>Bai Xiaochun looked over his shoulder at the hole, and his scalp went numb. Finally, he decided to call upon his most powerful backer, “I'm the Junior Brother of the Sect Leader! I'm the apprentice of Daoist Master Spiritsieve!”</p><br/><p>“Nobody can help you now!” Elder Zhou said, glaring. The truth was that he was actually losing a bit of face by personally chasing after Bai Xiaochun. What was even worse was that he hadn’t even touched Bai Xiaochun, who was fleeing like a rabbit whose tail had been stepped on. It was truly a miserable sight.</p><br/><p>Somewhere on Fragrant Cloud Peak, Xu Baocai looked up at what was happening, mixed emotions on his face. Of course, he wasn’t worried about Bai Xiaochun. Rather, he felt bad for Elder Zhou, and couldn’t help but think back to his own past.</p><br/><p>“Stop running, Bai Xiaochun!!” Elder Zhou cried, closing in like a powerful roc. Next to him, his phoenix continued to let out piercing cries, and occasionally pointed at Bai Xiaochun with his wings.</p><br/><p>“I'm a Prestige disciple!” Bai Xiaochun screamed. “I've shed blood for the sect! I’ve performed incredible service!!” As he fled for his life, his words echoed out even to Violet Cauldron Peak. Many people there looked up and saw Bai Xiaochun in full flight, and strange expressions quickly filled their faces. When they realized what was happening, they couldn’t hold back from laughing.</p><br/><p>“That title is given to the dead,” Elder Zhou growled. “I'm going to make you into a true Prestige disciple!” The truth was that he didn’t really plan to kill Bai Xiaochun. He just wanted to teach him a very hard lesson. Hoping to scare him, he waved his hand again, sending out another blast of wind, which caused a vortex to spring up around Bai Xiaochun.</p><br/><p>When Bai Xiaochun heard Elder Zhou’s words, and then saw the wind vortex appear, he screamed even harder than before. He poured all of the spiritual power he could muster into the Golden Crow Sword. Bai Xiaochun burst out from within the vortex, surrounded by golden light, shooting all the way to the midway point between Fragrant Cloud Peak and Mount Daoseed. It was only then that the light began to fade.</p><br/><p>Silver light glittered around him as he charged onward, screaming. He was well aware that Li Qinghou wasn’t in the sect at the moment, and that the only person who could save him was his Elder Brother Sect Leader, which was why he was now heading toward Mount Daoseed.</p><br/><p>Elder Zhou was inwardly shocked that Bai Xiaochun had been able to dodge his attacks so many times, and was now sure that this was one of the reasons he'd been able to make it out alive when being pursued by the Luochen Clan.</p><br/><p>However, considering that there were so many people watching, it left Elder Zhou with little face, and only served to fuel his anger. Unleashing all of his cultivation base, he shot after Bai Xiaochun once again.</p><br/><p>“Elder Brother Sect Leader, save me!” Bai Xiaochun wailed at the top of his lungs. Whistling through the air at top speed, he continued to evade Elder Zhou as he headed toward Mount Daoseed. His incredible agility made him very slippery.</p><br/><p>Of course, if Elder Zhou truly unleashed all of his Foundation Establishment divine abilities and techniques, he would probably have been able to pin Bai Xiaochun down. However, all he wanted to do was teach him a lesson. If he started using magical techniques, and didn’t reign in their power perfectly, he could very well deliver a fatal blow.</p><br/><p>However, at the moment, he couldn’t even hit Bai Xiaochun at all, and yet, Bai Xiaochun was screaming miserably, which caused Elder Zhou to get even more angry. He quickly performed an incantation gesture with his right hand, causing dark clouds to form in the sky above. Thunder crashed as lightning suddenly shot down toward Bai Xiaochun.</p><br/><p>Bai Xiaochun’s eyes were as round as saucers. The terrifying power he sensed within the lightning left his mind somewhat blank. Eyes bloodshot, he performed a double-handed incantation gesture and then pointed out. Instantly, violet qi appeared above his head, which shot toward the lightning.</p><br/><p>Elder Zhou was astonished. He’d set out to simply scare Bai Xiaochun, and although the lightning seemed like an attack, he’d aimed it to land next to Bai Xiaochun, not on him. But now, Bai Xiaochun was actually fighting back against it, causing Elder Zhou to suddenly try to reign the lightning in. Unfortunately, he couldn’t stop all of it.</p><br/><p>Violet qi swirled up from Bai Xiaochun to meet the lightning, and as it did, the image of a cauldron appeared. When it slammed into the lightning, massive rumbling sounds echoed out, shaking everything in the area. The violet qi scattered, and as for the lightning, it dimmed by about half before slamming into the ground.</p><br/><p>Bai Xiaochun’s face went pale, and he let out another plaintive scream.</p><br/><p>“Save me, Elder Brother! Save me, Master! Oh that the spirit of my Master in the heavens would save me!!”</p><br/><p>Elder Zhou stopped in place in midair, looking at Bai Xiaochun in surprise. Just now, he had managed to reduce the power of the lightning by about half, but even the remaining bit should have been enough to seriously injure any Qi Condensation cultivator. And yet, other than causing Bai Xiaochun’s face to go pale, and sending his qi and blood into chaos, it had done little else.</p><br/><p>“That was... Violet Qi Cauldron Summoning,” Elder Zhou murmured to himself. “Du Lingfei and Hou Yunfei both said that Bai Xiaochun had gained enlightenment of Violet Qi Cauldron Summoning, but that level of power exceeds the seventh level of Qi Condensation. The battle prowess this kid can unleash with that technique is incredible!”</p><br/><p>A strange light gleamed in Elder Zhou’s eyes. Now that he realized Bai Xiaochun was a Chosen of this caliber, some of his anger was mitigated. Furthermore, Bai Xiaochun’s ear-splitting screaming left him unsure of whether to laugh or cry. With a cold snort, he once again gave chase.</p><br/><p>“I don’t care if the phoenix was at fault, Bai Xiaochun was the main cause. This kid is stubborn and mischievous; I need to take the chance to scare him into restraint.”</p><br/>\n</div>"}