{"title": "Chapter 72: The Sect Has Rules", "id": 72, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-72-the-sect-has-rules", "volume_title": "Volume 1", "body": "<h1>Chapter 72: The Sect Has Rules</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A few days later, a boom echoed out from Bai Xiaochun’s pill-concocting workstation. Moments later, he appeared, frowning and looking anxious.</p><br/><p>“Although I'm pretty familiar with tier-1 medicinal pills now,” he lamented, “ tier-2 pills are a lot harder....” Other than cultivation, his time recently had mostly been spent on concocting medicines. In his attempt to produce some tier-2 spirit medicines, he’d already used up most of the plants and vegetation in his bag. Unfortunately, the degree of difficulty he was working with was vastly greater than before, and despite being meticulously careful, he had failed consistently.</p><br/><p>Each time he found that he had used too many materials, he would make adjustments. And yet even then, new problems would arise.</p><br/><p>Sighing in despair, he walked out of the Medicine Concocting Pavilion and looked up to find a large host of people sitting there cross-legged. Most of them sat in groups of three to five, with a few groups of ten in sight. The majority were pretty young women, none of whom were familiar to Bai Xiaochun.</p><br/><p>They were all different shapes and sizes, but each one was beautiful in her own way. The lot of them were clearly vying with each other to be the most glamorous, and as soon as they saw Bai Xiaochun emerge, their eyes shone brightly.</p><br/><p>Most had older folks sitting next to them, who also seemed delighted to see Bai Xiaochun. In fact, they all rose to their feet and rushed over in a hubbub.</p><br/><p>Taken aback, and a bit unsure of what was going on, Bai Xiaochun subconsciously stepped back a few paces. “Hey, hold on! What... what are you people doing?”</p><br/><p>“Fellow Daoist Bai, I'm Zhao Tianhai. Zhao Yiduo is my nephew! Hahaha! Fellow Daoist Bai, you truly are a young hero, a man of striking appearance and talent!”</p><br/><p>“Fellow Daoist Bai! What a dragon among men, heroic and extraordinary! A single glance reveals that he’s like a roc soaring among the clouds, someone with unlimited potential. Ahem. I am Sun Yunshan, and these young women are all beauties from my clan. Fellow Daoist, if I'm not mistaken, you’re lacking in terms of maidservants, correct?”</p><br/><p>“Fellow Daoist Bai, I am Zhou Tian. A single glance at you, Fellow Daoist Bai, and I can clearly sense your heroic spirit. You are obviously the future overlord of the eastern cultivation world. We were destined to be friends at first sight. Look at these young women standing next to me. Every single one is a precious pearl of the Zhou Clan....”</p><br/><p>A clamor of voices rang out, each one trying to speak first and loudest. Bai Xiaochun’s eyes went wide, and he retreated a few more steps. However, it only took a moment for him to realize that these people had come to offer their clan daughters to him....</p><br/><p>He wasn’t sure exactly why it was happening, but upon looking the young women over, he could see that all of them were exceptionally beautiful. In fact, many of them could be counted as being his type. The way they were being offered up seemed to indicate that if he didn't accept, he would be refusing to give them face. Instantly, Bai Xiaochun was on guard.</p><br/><p>Of course, he was adept at dealing with people, so he didn’t let any hint of that show on his face. A broad smile appeared, and after exchanging some meaningless pleasantries with the spokesmen from the various cultivator clans, he managed to extricate himself.</p><br/><p>However, before he could reach his residence, he ran into others who had stationed themselves along the way. All of them had similar words to speak with him, and offered him their clan daughters as well as other gifts and promises.</p><br/><p>“Something big must have happened, but what?” he thought. “Could it be that they found out one of my ancestors was an immortal? Maybe I'm not from the mortal world after all. I'm... I'm actually descended from some exalted, powerful individual? Heavens! How could I not have been aware?!” Mind spinning, he hurried along until his residence came in view. However, it was surrounded by a crowd of individuals from various cultivator clans, all of whose eyes glistened with hope. It was as if the mere nod of Bai Xiaochun’s head would cause them to do anything he wished!</p><br/><p>That was especially true of the young women. They all clustered around Bai Xiaochun, glaring antagonistically at each other, pushing and shoving each other back and forth.</p><br/><p>The sight of it all caused Bai Xiaochun’s scalp to go numb. He was completely surrounded, and no matter which way he tried to move, he ran into something soft and warm. They even began to tug at his clothing, causing his heart to pound. Finally, a cold snort rang out, and Hou Xiaomei appeared. Glaring angrily, cheeks puffed, she stormed up to him, shoving the other young women aside.</p><br/><p>“Get out of my way! What do you people think you’re doing!? This is Fragrant Cloud Peak of the Spirit Stream Sect. Don’t you bunch of old coots know how to keep your cool? Get out of my way, all of you. Hey you! Look at you! You’re skinnier than a greenbean! What are you shoving people around for? And you! You’re fatter than a dairy cow! Get the hell out of my way!!” Hou Xiaomei sounded genuinely furious as she pushed aside all of the young women crowding around Bai Xiaochun.</p><br/><p>She was small and delicate, but she was fuming, and seemed to be filled with boundless strength. Facing such opposition, the other young women immediately surrendered and opened a path, crying out in confusion. Hou Xiaomei stormed forward with her hands on her hips, looking like a chili pepper, the words she uttered incisive and damaging.</p><br/><p>Bai Xiaochun took advantage of the moment to hurry into the courtyard. Once inside, he looked down to find that his garments had been tugged at so much that they were about to fall off.</p><br/><p>“Absolutely terrifying!” he thought, gasping. Heart pounding with residual fear, he looked back out through the main gate and saw Hou Xiaomei standing there verbally sparring with the other young women, standing alone against a crowd of dozens.</p><br/><p>Eventually, the responsible members of the cultivator clans couldn’t stand idly by. They finally intervened and suggested to the young women that they leave. Clasping hands respectfully in Bai Xiaochun’s direction, they promised to come back to visit at a later date.</p><br/><p>Soon, it was evening. It was quiet outside of Bai Xiaochun’s gate, but off in the distance, people from various cultivator clans were sitting cross-legged in meditation, seemingly guarding the area.</p><br/><p>All of these people had used various means and methods to come from afar, and also had ways to keep themselves from being driven away.</p><br/><p>Bai Xiaochun was sure that something momentous had occurred. Looking at the quiet scene outside, he eventually dragged Hou Xiaomei into the courtyard.</p><br/><p>To outsiders, Hou Xiaomei was as fiery as a hot pepper, but as soon as Bai Xiaochun’s hand made contact with her, her face turned bright red, and she felt dizzy. Her tiny frame almost went limp as Bai Xiaochun dragged her inside.</p><br/><p>When she spoke, her voice was as soft as the drone of a mosquito. “Big... big bro Xiaochun, there are so many people around, what are you planning to do to me...?”</p><br/><p>“Huh?” Bai Xiaochun said, staring in shock. Seeing Hou Xiaomei’s odd countenance, he could tell that something was wrong with her, and quickly slapped her cheek. When she didn't seem to recover, he slapped her again. Hou Xiaomei immediately regained her senses.</p><br/><p>\"What’s wrong with you!?” she snapped, stamping her foot. However, realizing she had been the one in the wrong, she tossed a jade slip to him, and then turned heel and fled.</p><br/><p>As he watched Hou Xiaomei flee into the distance, Bai Xiaochun stood there wondering what was going on. Finally, he looked down at the jade slip and scanned it with spiritual power. As he did, his eyes went wide. After scanning it again, he stood there in the courtyard, breathing heavily.</p><br/><p>“Prestige clan....”</p><br/><p>The jade slip had been sent to Bai Xiaochun by Hou Yunfei, with Hou Xiaomei being the messenger. The words contained within were the type that almost couldn’t be uttered aloud. They explained why all of the cultivator clans were so interested in Bai Xiaochun’s status as a Prestige disciple, and what had occurred as a result. They also explained that the Hou Clan held an intense hope that Bai Xiaochun’s descendants... would also have the blood of the Hou Clan running in their veins.</p><br/><p>Then Bai Xiaochun thought about how Hou Xiaomei had been acting just now, and he rubbed his chin thoughtfully. Eyes sparkling, he thought, not about Hou Xiaomei, but about his own words from moments ago. Something momentous <em>had </em>occurred!</p><br/><p>“How could I have imagined...? And here I thought the reward for my meritorious service was basically useless. I thought that being the Junior Brother of the sect leader would make me a big hero in the sect, but I never thought that being a Prestige disciple would make me so important on the outside!” He licked his lips, and soon, his heart began to beat faster.</p><br/><p>“I could pick any Daoist partner I wanted! All of their clan resources would be at my disposal.... Finally, I have some real hope to live forever!” Chuckling mischievously, his eyes began to shine. Previously, he had been worried about how to keep up his efforts to concoct tier-2 spirit medicine. But now, people were essentially fighting over the chance to give him gifts.</p><br/><p>“What a pity I can’t accept them all....” he murmured. But then, he was struck with inspiration.</p><br/><p>“Wait a second! Why can’t I accept them all?!” Clearing his throat, he entered his cabin to rest for the evening, thinking the whole time about what to do next. The following morning at dawn, he leapt out of bed, trembling with excitement. After pushing open the gate of the courtyard, he found a whole host of people from various cultivator clans waiting for him.</p><br/><p>“Fellow Daoist Bai....”</p><br/><p>“Greetings, Fellow Daoist Bai. Your humble servant has come upon the request of our clan patriarch to offer formal greetings....”</p><br/><p>Everyone started talking at once, filling the air with a cacophony of sound. Bai Xiaochun stuck his chin up and flicked his sleeve.</p><br/><p>“Alright, enough is enough,” he said, smiling so widely that his eyes became slits. “Everyone come close. Whatever requests you have, we can talk them all out.” With that, he randomly nodded in the direction of one of the clans. The responsible member of the clan rushed forward in delight, dragging a few young women with him.</p><br/><p>The women approached, looking a bit nervous. As for all of the other observing clans, they also seemed nervous, although for different reasons; they quickly began to transmit messages back home.</p><br/><p>Things went on like that for the next clan, and then the next. One by one, all day. Bai Xiaochun met with dozens of them.</p><br/><p>He didn’t choose any of the clan daughters, and yet, neither did he refuse anyone. He merely told them that he needed some time to think, and that the matter was too weighty to decide on a whim. As for all of the ‘introductory gifts,’ he didn’t refuse a single one.</p><br/><p>“I, Bai Xiaochun, always handle all matters in a just and fair manner. Considering that I haven’t yet chosen which honorable clan to ally with in marriage, I truly am unable to accept your gifts.” Those were the words he would speak to each and every clan.</p><br/><p>Of course, the more he spoke in such a way, the more the cultivator clans insisted that he accept their gifts. In fact, they grew even more polite. Many of them went on to say that even if no marriage resulted, they still wished to be good friends. Only then did Bai Xiaochun reluctantly accept the gifts.</p><br/><p>Although they might be fools, the people from these cultivator clans weren’t stupid. They knew that when Bai Xiaochun said he needed to think about the matter, he was most likely just waiting to see which clan would make the best offer.</p><br/><p>That, of course, was within the purvey of expectation. Furthermore, all of them feared that if they didn’t offer their gifts, Bai Xiaochun wouldn’t even consider their clan daughter to be his Daoist partner. The result was that the next day, the crowds hadn’t thinned at all, and in fact, had grown more numerous. Furthermore, some of the cultivator clans even went so far as to say that even if their clan daughter couldn’t become Bai Xiaochun’s Daoist partner, they were still willing for her to be a maidservant to warm his bed at night. As long as she could pass on his bloodline, and he acknowledged them formally, that would be sufficient.</p><br/><p>All of the visiting clans continued to offer more and more gifts. In fact, it got to the point where Bai Xiaochun was getting a bit nervous. Eventually, he truly wanted to refuse, and yet wasn’t able to.</p><br/><p>“Fine, I guess I’ll accept.... Not accepting isn’t really an option, huh?” For seven or eight days in a row, he continued to receive the clans and accept their gifts. Every morning at dawn, he would walk out to find a whole host of people waiting for him.</p><br/><p>Three more days passed. When dawn broke, Bai Xiaochun pushed open the main gate, whereupon his jaw dropped. Shockingly... not a single person could be seen. Everything was peaceful and quiet; as far as the eye could see, the area was empty.</p><br/><p>The only things he could see were some five-colored phoenixes, flying gracefully high above. The phoenixes were the beloved pets of Elder Zhou, and often soared above Fragrant Cloud Peak around dawn. They would usually fly together in a flock, and were especially beautiful. Many disciples were jealous of them.</p><br/><p>Bai Xiaochun rubbed his eyes and looked around. Thinking that perhaps he had opened the gate incorrectly, he went back in, closed it, and then tried again. However, the result was the same.</p><br/><p>“What’s going on?” he thought, shocked. He quickly went off to find Hou Yunfei to ask for an explanation.</p><br/><p>Hou Yunfei sighed and looked at Bai Xiaochun. “Last night, the sect leader issued a Dharmic decree. As your Elder Brother, he notified the cultivator clans... that according to sect rules, you can’t accept a Daoist partner within the next hundred years. Therefore... everyone had no choice but to leave.”</p><br/><p>Bai Xiaochun’s jaw dropped. Feeling very wronged, he said, “No more income.... No more marriage....”</p><br/><p>Hou Yunfei wasn’t sure whether to laugh or cry. A moment later, though, he thought of something, and said, “Xiaochun, a friend of mine from Green Crest Peak told me that you and Shangguan Tianyou have a beef with each other. Is that right? Well, just be aware that Qian Dajin isn’t important at all. However you choose to deal with him, the sect will tacitly agree. But things aren’t so simple when it comes to Shangguan Tianyou!”</p><br/><p>“What do you mean ‘not so simple?’” Bai Xiaochun asked. “Is he more important than me or something?” Having been a member of the Spirit Stream Sect for so many years, Bai Xiaochun was well aware of how the sect tried to train its disciples. They pushed them toward greatness, prohibited deadly conflicts, and encouraged both cooperation and competition. Sect rules governed basic behavior. The elders of the various mountain peaks, as well as the Peak Lords themselves, provided assistance and training. And the Hall of Justice was a looming threat to deter bad behavior. The sect essentially had all aspects under control.</p><br/><p>Of course, considering that between the north and south banks the Spirit Stream Sect had several hundred thousand disciples, it was obviously impossible to micromanage everything. Disciples would have conflicts and fights, and certain improper attitudes were impossible to control. However, the rewards and punishments in place were clear, and anyone who violated them would be strictly dealt with!</p><br/><p>Bai Xiaochun had performed an incredible service for the sect, possessed profound skill with plants and vegetation, and could unleash extraordinary battle prowess. The sect was naturally aware of that, and valued him greatly. Of course, they didn’t cater to his every whim like a servant. If people insulted or provoked him, they wouldn’t leap out to protect him.... No disciple enjoyed such treatment, neither Shangguan Tianyou nor Bai Xiaochun.</p><br/><p>Because of that, Bai Xiaochun was of the belief that Shangguan Tianyou, an arrogant, famous Chosen who other Outer Sect disciple went so far as to call Young Lord, was still not worthy of his own attention.</p><br/><p>After a moment of thought, Hou Yunfei responded, eyes shining as he told Bai Xiaochun everything he knew: “Shangguan Tianyou has great ambitions. He hopes that one day he will be able to enter the legendary Legacy Echelon. As such, he has continuously kept his cultivation base suppressed, keeping him between the Outer and Inner Sects. When the next trial by fire for Chosen from the north and south banks comes, he wants to take first place, and enter the Inner Sect at the top. That will earn him the chance to enter the Legacy Echelon. Were it not for that, he would have long since applied for an ordinary trial by fire to enter the Inner Sect. After all, anyone who reaches the eighth level of Qi Condensation may do so.”</p><br/><p>Shocked, Bai Xiaochun asked, “How come everyone wants to get into the Legacy Echelon? Xu Baocai told me that Zhou Xinqi, Lu Tianlei, and everyone else wants to.”</p><br/><p>“Members of the Legacy Echelon have a similar status to Prestige disciples. However, it's a different branch within the Spirit Stream Sect. You see, the Spirit Stream Sect is different from other sects. We have two branches, one of which focuses on protecting the sect, and one of which focuses on increasing its glory and power!</p><br/><p>“Everyone from the servants to the disciples in the third level of Qi Condensation are lumped together in one lower group. Those from the fourth to the eighth level of Qi Condensation constitute the Outer Sect. At the eighth level, you can apply for a trial by fire to enter the Inner Sect.</p><br/><p>“If you can reach Foundation Establishment... then you can become a Foundation Establishment elder, and maybe even a Peak Lord. After two sixty-year-cycles pass, if you break through to the Gold Core level, then you can become a Prime Elder, responsible for protecting and managing the sect. That is the first branch.</p><br/><p>“The second branch is the Legacy Echelon!</p><br/><p>“There is only one way to get in, and that is... to break through to the Gold Core level before two sixty-year-cycles pass. From then on, you will become a tool to ensure that our sect earns an even greater position in the cultivation world, that it acquires... even more powerful resources and wealth! Anyone who takes first place in the Chosen battles will be in line to enter the Legacy Echelon. I'm not really sure about the exact details, but I do know that there are rules about the whole thing!</p><br/><p>“The only thing is, reaching the Gold Core level before two sixty-year-cycles pass is very, very difficult.... Of the members of the previous generation, the only person who has even come close is Peak Lord Li Qinghou. That's why the sect favors him so much!”</p><br/><p>Bai Xiaochun took a deep breath. This was his first time hearing an explanation of the Legacy Echelon, which also gave him a much clearer understanding of the sect itself. Soon, he left, and as he made his way off, he continued to ponder the matter.</p><br/><p>“Legacy Echelon...?”</p><br/>\n</div>"}