{"title": "Chapter 73: Who Did This!?", "id": 73, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-73-who-did-this", "volume_title": "Volume 1", "body": "<h1>Chapter 73: Who Did This!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Sighing, Bai Xiaochun left Hou Yunfei’s residence and returned to his own courtyard. He looked up at the sky, then around at the surrounding scenery, and thought about the cultivator clans. In his opinion, his Elder Brother Sect Leader had acted a bit domineering, and yet... even though it was now impossible to collect any more gifts, at least there was no need to return the ones he had already taken.</p><br/><p>“Yeah! It’s not my fault! It's the fault of Elder Brother Sect Leader’s Dharmic decree!” Having reached this point in his train of thought, Bai Xiaochun felt a bit better. After organizing all of the gifts, he went down to the market to buy a large quantity of medicinal plant ingredients for tier-2 spirit medicines. Then, he returned to the Medicine Concocting Pavilion to continue his cultivation and concocting work.</p><br/><p>The truth was that originally, Zheng Yuandong didn’t want to get involved in the matter with Bai Xiaochun and the cultivator clans. However, the events had unfolded in shocking fashion. The previous nine Prestige disciples had all been conferred their titles posthumously, after being killed in battle. Furthermore, all of them had been members of various other cultivator clans. Although none of them had ever had any direct descendants, they all had relatives among their various clans. Because of that, no problems had ever arisen, and their clans had smoothly transitioned into being Prestige clans.</p><br/><p>Of course, the sect highly valued and also protected such clans.</p><br/><p>But now, Bai Xiaochun was a living Prestige disciple, a terrifying status to say the least. At first, it hadn’t been obvious, and time had simply passed by. Zheng Yuandong and many others never thought much about what it meant to have a living Prestige scion in their midst, and how enticing such a person would be to the cultivator clans.</p><br/><p>But then, the cultivator clans began to show up in great numbers. At first, Zheng Yuandong had merely observed the goings-on. As far as he was concerned, it didn't really matter which clan Bai Xiaochun picked. How could he have ever imagined that with all the competition, the clans would have gone to the lengths of offering their clan daughters as handmaidens, just to acquire someone with Bai Xiaochun’s bloodline?</p><br/><p>Zheng Yuandong could only imagine what would happen if Bai Xiaochun gave in to the temptation. If that happened... it wouldn’t be long before he could sire hundreds of descendants. According to the clan rules, all first generation descendants of a Prestige disciple were automatically allowed to enter the Inner Sect, and would receive special treatment and training. Furthermore.... after those descendants began to propagate, there would be hundreds of branches of the Prestige clan. Within a few hundred years, the entire Spirit Stream Sect would be filled with the Bai Clan.... The final results would be grave indeed.</p><br/><p>In addition to all that... as long as Bai Xiaochun remained alive, all he had to do was continue to sire offspring, and the matter would never end. He would become a living nightmare for the sect.</p><br/><p>Because of such considerations, Zheng Yuandong held an emergency meeting with the sect elders, including the prime elders. Their joint decision was that Bai Xiaochun could not accept a Daoist partner for a hundred years. Although it was a bit overbearing, Zheng Yuandong felt that there was no other option. He didn’t want to bet everything on Bai Xiaochun’s ability to resist temptation. He could only hope that after a hundred years, Bai Xiaochun would grow up and be a bit more mature.</p><br/><p>Time passed. Soon, a year had gone by.</p><br/><p>During that time, it was almost as if Bai Xiaochun had gone missing from the south bank. Few people ever saw him. He spent all of his time concocting medicine and practicing cultivation. He rarely left the Medicine Concocting Pavilion, where he worked hard at producing tier-2 spirit medicine.</p><br/><p>His cultivation base had also slowly made progress. Soon, he was in the middle of the seventh level of Qi Condensation. Furthermore, he resolved one problem after another when it came to concocting tier-2 spirit medicine.</p><br/><p>The truth was that most other journeyman apothecaries at his level would have long since concocted tier-2 medicines. But Bai Xiaochun was stubborn, and refused to start concocting another batch without first resolving each and every problem he found in the previous batch.</p><br/><p>Eventually, after an entire year, he was finally convinced that he had resolved all of the issues regarding the concoction of tier-2 spirit medicine. With all the problems gone, he began yet another batch.</p><br/><p>“Violet Qi Spirit Ascension Pills!” he exclaimed, eyes bloodshot. They were a tier-2 medicinal pill suitable for the eighth level of Qi Condensation and under. Following the recipe precisely, he selected numerous types of plants and vegetation, organized them carefully, and then began to feed them into the pill furnace.</p><br/><p>After carefully adjusting the earthflame, he kept a close eye on the pill furnace, occasionally adjusting the spiritual energy he fed inside. After six hours passed, the pill furnace suddenly began to shake. A strong medicinal aroma wafted out, and Bai Xiaochun’s eyes began to shine brightly. Leaning toward the pill furnace, he slapped it on the side, whereupon three red medicinal pills flew out.</p><br/><p>“It worked!” he exclaimed excitedly. Grabbing the three pills, he looked them over. But then, his eyes went wide. “Eee? Hold on a second. Something’s not right. According to the description, Violet Qi Spirit Ascension Pills are supposed to be violet. How come these ones are red?”</p><br/><p>After scratching his head for a moment, he lifted the pills up to his nose and inhaled deeply. The medicinal aroma was strong, and contained plenty of spiritual energy. However, the smell was somewhat odd, and considering that they were the incorrect color, he didn’t dare to consume them.</p><br/><p>Sitting there thoughtfully, he thought back to all of the various steps he had taken during the concocting process. Two hours later, his eyes snapped open, and he laughed bitterly.</p><br/><p>“I put in a bit too much superagate flower pollen. That tainted the rest of the medicinal plant ingredients, producing this strange side-effect.” With that, he placed the three red medicinal pills off to the side, and once again began to concoct.</p><br/><p>This time, when the pill furnace began to shake, and the medicinal aroma spread out, a single violet medicinal pill flew out. After examining it closely, an expression of deep satisfaction appeared on Bai Xiaochun’s face.</p><br/><p>He quickly began another batch. In the following days, he continued to produce more batches, until he had a few dozen Violet Qi Spirit Ascension Pills. That having been accomplished, he sat down off to the side, exhausted. After some rest, he produced the red pills and looked at them with some hesitation. As far as he was concerned, each and every one of the pills he had just concocted was very valuable, and furthermore, when it came to ingredients, he was already starting to run short.</p><br/><p>“According to the concocting instructions, as long as the pill is formed, it counts as a success. These red Violet Qi Spirit Ascension Pills have a bit too much superagate flower pollen, which caused their color to change. However, all that means is that they will have lost some effectiveness.” After a moment of hesitation, he slapped his bag of holding to produce a green bamboo needle.</p><br/><p>It was an item he had acquired from the sect for use in medicine concocting, which could be used to make a general assessment of whether any given medicinal pill was toxic or not. After carefully inserting the needle into one of the red medicinal pills, he waited for a moment, then pulled it back out. The bamboo needle looked exactly the same as before, as opposed to being black.</p><br/><p>“Not toxic!” he said with a sigh of relief. However, out of caution, he still chose not to consume any of the red pills. Instead, he held them in hand as he left the Medicine Concocting Pavilion. Outside in the dawn air, he began to walk down one of the small paths that wound through the sect.</p><br/><p>Up above, he could see a flock of five-colored phoenixes gliding elegantly through the air, occasionally making piercing cries that echoed out. Ignoring the phoenixes, he headed toward one of the local spirit tail chicken farms, where he acquired a spirit tail chicken. After returning to his courtyard, he put the chicken down and then tossed one of the red medicinal pills out in front of it.</p><br/><p>The spirit tail chicken had originally been sitting there looking a bit tired. But then it caught sight of the red medicinal pill. A tremor ran through it, and it suddenly leapt to its feet, rushed forward and pecked down toward the pill.</p><br/><p>However, it was at this exact moment that an intensely powerful cry rang out from up above. Then, a powerful wind gusted by, and before the spirit tail chicken could reach the pill, it was blown off of its feet.</p><br/><p>A bit frightened, Bai Xiaochun leaped backward. At the same time, the five-colored phoenixes closed in from up above, eyes wide, fighting amongst themselves the entire way. Finally, one of the strongest among the group, a male, succeeded in shoving aside his companions, whereupon he snapped up the medicinal pill and swallowed it down.</p><br/><p>Looking with contempt at the spirit tail chicken that had been blown off to the side, the phoenix then flew up gracefully into the air. Bai Xiaochun wasn’t sure whether to laugh or cry. Eyes wide, he could do nothing but watch as the phoenix ascended upward.</p><br/><p>However, after flying only a short way, the elegant phoenix began to shake, and then let out a protracted wail. His eyes turned bright red as they filled with veins of blood. All of his feathers suddenly stood on end, making him look like a fireball that was about to explode.</p><br/><p>Even more shocking was that the powerful male phoenix’s muscles began to swell and ripple. Cracking sounds emanated out as the entire phoenix grew larger. Most notable of all was how the feathered area between his two legs suddenly bulged with something hard and rod-like....</p><br/><p>A very peculiar expression could be seen on the face of the male phoenix as he looked around at the other phoenixes.</p><br/><p>The other phoenixes trembled, and were about to scatter, when the male phoenix charged madly toward them. Next, miserable shrieks began to ring out.</p><br/><p>Bai Xiaochun stood there in his courtyard, looking on aghast as the bulging male phoenix... violated all of the other phoenixes. Moments later, unsated, the phoenix turned in his direction, his eyes burning just as red as before, his entire body seemingly bursting with flames.</p><br/><p>Terrified, Bai Xiaochun fled, barely able to hold back from screaming.</p><br/><p>Thankfully, the phoenix was actually targeting, not him, but the spirit tail chicken....</p><br/><p>Soon after, he watched as the male phoenix flew back toward the top of the mountain, clamoring loudly the entire way. Only after that did Bai Xiaochun wipe the sweat off of his brow.</p><br/><p>“Simply terrifying....” he thought, looking down at the remaining two medicinal pills he held in hand. “Just what kind of medicinal pills are these!?!?” His heart began to pound as he realized that they must be some type of aphrodisiac. Clearly... they were also very effective.</p><br/><p>**</p><br/><p>That day was a day that would never be forgotten by the disciples of Fragrant Cloud Peak....</p><br/><p>All birds on the mountain, regardless of what type they were, were ravaged by Elder Zhou’s maddened phoenix.... Countless disciples watched as one bird after another let out miserable shrieks. Although the birds tried as best they could to escape, none of them were a match for Elder Zhou’s phoenix. None managed to flee....</p><br/><p>The villainous phoenix didn't even spare the spirit tail chickens, much less the other birds that Elder Zhou had raised. Anything on the mountain with wings... experienced a living nightmare that day.</p><br/><p>All of the disciples were talking about the matter, and their hearts trembled. Soon, word spread to Violet Cauldron Peak and Green Crest Peak. Some people even came over to see the miraculous events which were unfolding for themselves.</p><br/><p>“Did you hear that over on Fragrant Cloud Peak, one of Elder Zhou's phoenixes went mad? It started pouncing on any bird it saw....”</p><br/><p>“I saw it with my own eyes. What a savage phoenix! It didn’t even spare the passing magpies....”</p><br/><p>“Just what was Elder Zhou doing, huh? How could he let his phoenix act like that...?”</p><br/><p>“It was really infuriating, you know? That phoenix seemed really turned on! It pounced on some of those birds over and over again. It was brutal!”</p><br/><p>When Bai Xiaochun heard the talk going around the sect, he began to tremble, and even felt a bit guilty.</p><br/><p>“It isn’t my fault....” he said to himself. “It’s really not my fault.... I was trying to give that pill to the spirit tail chicken.... That phoenix stole it!” Feeling wronged, he hurried back to the Medicine Concocting Pavilion. After some thought, he came to the conclusion that there was no way anyone would figure out what had happened.</p><br/><p>There he sat in the Medicine Concocting Pavilion, sighing as he pulled out the remaining two red medicinal pills, which he then looked at thoughtfully.</p><br/><p>“These medicinal pills are actually really powerful. Maybe I could use them as trump cards in a fight.... If I ever run into some wild beasts in the future, I'll have nothing to fear.</p><br/><p>“Well, if I want to use them as trump cards, then I better create another pill which can incite intense desire in females. The two can complement each other.” Bai Xiaochun could well imagine how two such pills could work together. If he encountered some dangerous beast in the future, he would merely throw a pill in one direction and then run off in the other.</p><br/><p>It was an exciting prospect, but the downside was that he had no medicinal formula to work with. After pondering the matter for a while, and considering all of the various types of plants and vegetation that he knew about, he mentally prepared his own medicine formula.</p><br/><p>About the time that Bai Xiaochun was considering how to create his own medicine formula, Elder Zhou returned to his residence at the top of Fragrant Cloud Peak. There, he stared at the ravaged and listless phoenixes, and then turned his head to see the male phoenix off in the distance, pouncing on a spirit tail chicken. Miserable shrieks then began to ring out.</p><br/><p>Elder Zhou’s mind almost exploded. Trembling violently, he stood there feeling as if the entire world were spinning around him. Enraged, he cried out, “Who did this!?!?”</p><br/>\n</div>"}