{"title": "Chapter 80: The Talents of Big Fatty Zhang", "id": 80, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-80-the-talents-of-big-fatty-zhang", "volume_title": "Volume 1", "body": "<h1>Chapter 80: The Talents of Big Fatty Zhang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Now that he had plenty of spirit stones, Bai Xiaochun didn't want to worry about the issue of the little turtle any more. His heart had already been pierced a thousand times over by what had occurred. Now, the only thing left to do was go to the Medicine Concocting Pavilion and heal by immersing himself in pill concocting.</p><br/><p>By this point, Bai Xiaochun’s ability to concoct tier-2 spirit medicine had been refined to perfection. His success rate was shockingly high, and he was already beginning to work on tier-3 medicine.</p><br/><p>Rumbling sounds filled his workstation as he went about his work. On one occasion, something completely unexpected occurred when the pill furnace rocketed into the air and slammed into the wall, causing a huge boom to echo out and leaving a small crater behind.</p><br/><p>However, that was almost nothing compared to the time when a failed batch of pills exploded and sent out smoke that not even the workshop’s protective spell formation could stop. It filled nearly half of the Medicine Concocting Pavilion, causing everyone inside to run out, coughing and cursing the entire time.</p><br/><p>Shocked, Bai Xiaochun also ran out in similar fashion, and in the end, no one was completely sure who had caused the entire disaster.</p><br/><p>Feeling quite frustrated, Bai Xiaochun carefully returned to his workstation and began to work on another batch of tier-3 spirit medicine. Gradually, a strange expression appeared on his face as he realized he often tended to produce bizarre spirit medicines. For example, there was the time he created the medicine which had attracted hordes of ants. And then there was his Aphrodisiac Pill....</p><br/><p>The truth was, all of the mystery pills he concocted were all terrifying.</p><br/><p>“Could it be because I refuse to use a set medicine formula in my concocting? Every time I do my work, I follow my instincts, and that’s what leads to the strange transformations? Or maybe I’m just so naturally talented that God is jealous and intentionally causes problems for me?” Currently, a few dozen brightly colored medicinal pills were laid out in front of Bai Xiaochun, which he looked down at, frowning.</p><br/><p>None of them were spherical. Some were cube-shaped, and others looked like malformed lumps of clay. Clearly, they were not ordinary spirit medicines, and yet, each and every one let off a strong medicinal aroma....</p><br/><p>Even if Bai Xiaochun were a hundred times braver than he was, he wouldn’t dare to personally consume any of them. It was impossible to say what unimaginable effects they might produce.</p><br/><p>“I want to achieve the ultimate pinnacle in the Dao of medicine. I am like a cloud in the sky, floating about effortlessly, ignoring the material world. The Dao of medicine is a path strewn with obstacles, so I must not fear. I just have to endure. That is the new me, a new Bai Xiaochun.” With that, determination appeared on his face. Looking as if he were searching for the deeper truths in life, he put the pills away and once again began his concocting work.</p><br/><p>He spent nearly half a day on the next batch. Unfortunately, he had reached the point where there were few types of medicine that he could continue to work on. It was simply too dangerous. His pill furnace would explode every time, leaving significant damage in its wake. Scowling, he paid some spirit stones in compensation, at which time he was politely asked to leave the Medicine Concocting Pavilion.</p><br/><p>He was just about to call upon his status as the Junior Brother of the sect leader and demand to be allowed to stay, when he realized that Big Fatty Zhang had messaged him via jade slip. Apparently he'd come to Bai Xiaochun’s residence looking for him, and was wondering where he'd gone off to.</p><br/><p>Seeing that Big Fatty Zhang had come to visit, Bai Xiaochun left the Medicine Concocting Pavilion. Sighing, he began to walk down one of the narrow mountain paths.</p><br/><p>“If I want to pursue the Dao of medicine to the pinnacle, then I will surely face obstacles along the way. I, Bai Xiaochun, am like a floating cloud. I will not surrender!” Sticking his chest out and raising his head, he walked forward for a bit until he realized that something seemed off. At this time of day, the sect was usually a busy place. But right now, Fragrant Cloud Peak was very quiet. Looking around, he noticed that not a single disciple of the sixth level of Qi Condensation or higher could be seen. Everyone present was of the fifth level or lower.</p><br/><p>Shocked, he hurried back to his residence. Even as he approached from a distance, he saw a tall, skinny young man pacing back and forth excitedly in front of the main gate.</p><br/><p>That young man was none other than Big Fatty Zhang, who had lost a significant amount of weight.</p><br/><p>“Eldest Brother,” Bai Xiaochun exclaimed in greeting, hurrying forward.</p><br/><p>“Ninth Junior Brother!” Big Fatty Zhang replied, turning to look at Bai Xiaochun and laughing loudly. Big Fatty Zhang didn't care at all that Bai Xiaochun was now the Junior Brother of the sect leader. To Big Fatty Zhang, he was still his little Junior Brother.</p><br/><p>Bai Xiaochun dragged him into the courtyard, where they sat down to chat. Curious, Bai Xiaochun said, “Eldest Brother, you hardly ever come to visit. What brought you over? Is there something you need my help with? Just say the word!”</p><br/><p>Bai Xiaochun had long since come to view Big Fatty Zhang as a true older brother. Whenever he thought back to their days together in the Ovens, he was always left with a warm feeling.</p><br/><p>Big Fatty Zhang cleared his throat, but was unable to prevent the excitement and pride from showing on his face. Looking over, he slapped himself proudly on the chest. Back in the Ovens, it would have resulted in the sound of jiggling flesh, but now, only the creaking of bones could be heard. Even still, Big Fatty Zhang seemed enlivened.</p><br/><p>“Ninth Junior Brother, I have a huge secret to tell you!”</p><br/><p>As soon as Bai Xiaochun heard that a huge secret was involved, his eyes went wide, and he began to pay rapt attention.</p><br/><p>Sounding very lofty, Big Fatty Zhang went on to say, “From now on, I, Big Fatty Zhang, am definitely going to be famous in the Spirit Stream Sect. Everyone will know my name. Tons of disciples will be trying to get on my good side. In fact, even the Foundation Establishment seniors will probably treat me with the utmost respect.”</p><br/><p>“Oh?” Bai Xiaochun said, looking surprised. “What’s going on? Are you also the little turtle?”</p><br/><p>Glowing with exuberation, Big Fatty Zhang took a deep breath and lowered his voice. “Little turtle? Pshh. Ninth Junior Brother, you know that my Master is the Peak Lord of Violet Cauldron Peak, Xu Meixiang, right?”</p><br/><p>Bai Xiaochun nodded. He had known who Big Fatty Zhang’s master was for some time, and also knew that she was the reason he had lost so much weight. She didn’t like fat people, although that had also led Bai Xiaochun to consider some other strange possibilities regarding the situation.</p><br/><p>“Do you know what my Master is best at?” Big Fatty Zhang continued. “Spirit enhancement! And do you know what I'm studying from my Master? Spirit enhancement!</p><br/><p>“Hahaha! I, Big Fatty Zhang, happen to be blessed with incredible natural talent when it comes to spirit enhancement. My talent is so extraordinary that even my Master was completely shocked, and praised me to no end! Today, she actually said that it would only be a few more years before I’m the number one grandmaster of spirit enhancement in the entire Spirit Stream Sect!” Big Fatty Zhang rose to his feet, looking excitedly up into the sky, boiling with excitement. It was as if he were the most important being in existence.</p><br/><p>Bai Xiaochun blinked. Seeing Big Fatty Zhang’s mighty pose, he quickly plastered an adoring expression on his face and exclaimed, “Spirit enhancement?!”</p><br/><p>Bai Xiaochun’s reaction made Big Fatty Zhang even happier. Slapping his shoulder, he said, “Ninth Junior Brother, from here on out, lots of people are going to be asking me to do spirit enhancements. If I don't like them, I’ll refuse no matter what. If I do like them, then I’ll charge them an arm and a leg! But you and Third Fatty are both from the Ovens. For the rest of my life, I won’t charge you a single spirit stone. We’re family, so as long as you provide the ingredients, I’ll perform spirit enhancements for you for free!”</p><br/><p>Big Fatty Zhang seemed high-spirited and full of mettle. From the moment he arrived at Violet Cauldron Peak, he had felt suppressed, but now that he knew he had a talent for spirit enhancement, he was elated. This was actually the first time he had ever come to visit Bai Xiaochun.</p><br/><p>“Elder Brother, you’re incredible!!” Bai Xiaochun exclaimed, looking ecstatic.</p><br/><p>“Come, come,” said Big Fatty Zhang. “Give me something, anything. I’ll do a onefold enhancement right here. With one of my weapons, you’ll definitely get into the south bank’s top ten during the qualifying rounds a few months from now. Then you can represent the south bank to fight the north bank in the Chosen battles!”</p><br/><p>“Uh....” Bai Xiaochun blinked a few times. Seeing how excited Big Fatty Zhang was, he fished around in his bag of holding for a bit, and then pulled out one of the Spirit Stream Sect’s ordinary flying swords, of which he had a few. He quickly handed it over to Big Fatty Zhang.</p><br/><p>Big Fatty Zhang took a deep breath and then slapped his bag of holding, causing a few pieces of ore to fly out, which then floated around the sword.</p><br/><p>Then he closed his eyes, and unleashed the explosive power of his cultivation base. Although his cultivation base couldn’t quite match up to Bai Xiaochun’s, he was already in the great circle of the sixth level of Qi Condensation. His hair whipped about as he waved his left hand, causing silver light to shine out.</p><br/><p>As soon as the light appeared, a wind sprang up, and the entire area seemed to fill with fluctuations of spiritual energy. The energy streamed toward the pieces of ore, which filtered the energy before it passed on toward Big Fatty Zhang’s left hand. At the same time, the pieces of ore began to melt. In a short time, they were already half gone.</p><br/><p>Bai Xiaochun’s eyes flickered. This was his first time ever watching as someone performed a spirit enhancement, and the process was very different than when he used the turtle-wok. Apparently, the spirit enhancer would communicate directly with heaven and earth, and then filter its explosive power through the ore to soften it.</p><br/><p>Soon, Big Fatty Zhang began to shake. After enough time passed for half an incense stick to burn, he took a deep breath, and his eyes snapped open. Then, blinding silver light shot out from his hand to sweep over the sword.</p><br/><p>“Spirit Actuation!”</p><br/><p>The air seemed to vibrate as the silver light shooting out from Big Fatty Zhang’s hand bored into the flying sword. In the blink of an eye, the entire sword had turned silver.</p><br/><p>The sight was shocking to say the least, and Bai Xiaochun couldn’t help but gasp.</p><br/><p>Panting, Big Fatty Zhang handed the flying sword over to Bai Xiaochun.</p><br/><p>“Take it,” he said, his voice brimming with confidence. “The sword’s spirit has already been actuated. If you pour some more spiritual power into it to do a spirit test, the silver designs should appear!” With that, he mopped the sweat off of his forehead.</p><br/><p>Bai Xiaochun took the flying sword and then excitedly poured some spiritual power into it. Instantly, cracking sounds could be heard as silver lines appeared on the surface of the sword. Moments later though, they faded away, and then cracks began to spread out, as if the sword couldn’t contain the energy of heaven and earth which had been imbued into it. A moment later, it had transformed into nothing but a lump of slag.</p><br/><p>“Huh?” Bai Xiaochun said, looking surprised. Big Fatty Zhang’s jaw dropped, and the two of them exchanged glances.</p><br/><p>Bai Xiaochun cleared his throat, and was just about to say that it had been a low quality sword to begin with, when Big Fatty Zhang grabbed it and looked it over with wide eyes. After a moment, he stamped his foot angrily.</p><br/><p>“I made a mistake. I didn't control the fusion with the spirit iron. The energy of heaven and earth was a bit too volatile. Ah, it doesn’t matter. Alright Ninth Junior Brother, give me another flying sword, I’ll try again.” Big Fatty Zhang stared at Bai Xiaochun with bloodshot eyes.</p><br/><p>Bai Xiaochun produced another flying sword, whereupon Big Fatty Zhang took a deep breath. Expression very serious, he went through the process again, until the sword glowed with silver light. Then he handed it back to Bai Xiaochun.</p><br/><p>“Why don’t... why don’t you do the test, Eldest Brother?” Bai Xiaochun said hesitantly.</p><br/><p>Voice solemn, Big Fatty Zhang said, “The first major rule of spirit enhancement is that unless the object belongs to the spirit enhancer, then he must not do the spirit test himself! It's a set rule that I can’t violate. If I break the taboo, it will lead to endless troubles.”</p><br/><p>Seeing how determined Big Fatty Zhang was, Bai Xiaochun nervously took the sword. He truly wanted it to work this time, otherwise it would be a significant blow to Big Fatty Zhang.</p><br/><p>After a moment of thought, he said, “Hm... Eldest Brother, why don’t you wait here for a moment. I'll go to into my room to do the test. I think I put too much thought into it before and got too nervous.”</p><br/>\n</div>"}