{"title": "Chapter 93: What a Useful Pill", "id": 93, "volume": 1, "url": "http://boxnovel.org/a-will-eternal-chapter-93-what-a-useful-pill", "volume_title": "Volume 1", "body": "<h1>Chapter 93: What a Useful Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In the second battle zone, Ghostfang was just on the verge of waving his finger through the air a second time. He could defeat most people with the single wave of a finger, but not Gongsun Yun.</p><br/><p>As for Gongsun Yun, he dashed backward at top speed and barked that he conceded. He had been able to stand up to one of Ghostfang's finger attacks, but any more, and he would suffer serious injuries. Knowing that he had no chance of taking first place, he decided that contending for second place would be the best thing to do.</p><br/><p>Clasping his hands to Ghostfang, he left the arena floor. As he did, he glanced over in the direction of Gongsun Wan’er, and frowned.</p><br/><p>Ghostfang’s expression was placid as he left the arena floor and returned to where he had been standing all along. When he looked over at Bai Xiaochun and all of his defenses, a strange gleam appeared in his eyes.</p><br/><p>The audience members from the south bank were all looking down, averting their gazes from the scene playing out on the arena floor.... Embarrassed, they actually felt sorry for the north bank.</p><br/><p>The north bank disciples were going crazy....</p><br/><p>Gongsun Wan’er was frantic, screaming as she launched one attack after another at Bai Xiaochun, using every technique she could think of. She unleashed countless divine abilities and magical techniques, and yet, nothing could break Bai Xiaochun's defenses.</p><br/><p>After all, his final line of defense was the black bracelet, a life-saving magic that could protect him from a blow by a Foundation Establishment cultivator. After the time it takes an incense stick to burn, Gongsun Wan’er coughed up a mouthful of blood and collapsed onto the ground, staring at Bai Xiaochun with listless despair.</p><br/><p>She was about to summon her phoenix when Bai Xiaochun looked over at her and suddenly produced a medicinal pill, which he began to toss up and down in his palm....</p><br/><p>Furious, Gongsun Wan’er clenched her hands into fists.</p><br/><p>“I concede!!’ she said begrudgingly, eyes flickering with defiance.</p><br/><p>Clasping hands and looking as superior as possible, he said, “You let me win. It seems you know what's best, and didn’t force me to attack!”</p><br/><p>In response to his words, tears leaked out of the eyes of the south bank disciples. Gongsun Wan’er was so mad she was shaking. Gritting her teeth, she stalked off of the arena floor.</p><br/><p>It was at this point that the battle between Shangguan Tianyou and Xu Song reached its conclusion. Shangguan Tianyou’s sword descended, and intense light shone out in all directions. Xu Song’s five beasts were all in bad shape, and he himself staggered backward several paces, looking at Shangguan Tianyou in admiration.</p><br/><p>“It turns out sword spirit bodies really are pretty incredible!” he said, blood oozing out of his mouth. Finally, he turned and walked off of the arena floor.</p><br/><p>Shangguan Tianyou didn't respond. Instead, he looked over at Ghostfang, his eyes glittering, completely convinced of who his only true opponent was!</p><br/><p>“Presumably, he feels the same way I do,\" he thought, \"that fighting against these other people is simply boring.” Shangguan Tianyou retrieved his flying sword and looked over at Bai Xiaochun. When he saw all of his defenses, a gleam of scorn appeared in his eyes. Finally, he walked off of the arena floor, accompanied by the cheers of the south bank disciples.</p><br/><p>At the same time, Bai Xiaochun walked proudly back to his spot.</p><br/><p>The first set of matches of the third round was over. The victors were Ghostfang, Shangguan Tianyou, and Bai Xiaochun, with the losers being Xu Song and the Gongsun siblings.</p><br/><p>Of course, not many people had paid much attention to the victories won by Shangguan Tianyou and Ghostfang. Most people had been focused on Bai Xiaochun’s repeated shamelessness.</p><br/><p>Bai Xiaochun had succeeded... in completely altering the atmosphere of the competition. In fact, it was hard to say exactly how much he had influenced the sect as a whole....</p><br/><p>The north bank disciples’ eyes were bright red, their hands clenched into fists as they glared at Bai Xiaochun. As tens of thousands of eyes stared at him, he scratched his nose, pretending not to notice.</p><br/><p>Gongsun Wan’er was so angry she was shaking. Her brother, Gongsun Yun, murmured something to her, after which she clenched her teeth and sat down cross-legged to restore her energy. Everyone else soon followed suit.</p><br/><p>The rest period lasted for the time it takes three incense sticks to burn. After that, the second match of the third round formally began!</p><br/><p>In the first battle region, Ghostfang was up against Gongsun Wan’er. As soon as she stepped into the battle region and faced the expressionless Ghostfang, she conceded. She couldn’t afford to be injured, lest it affect her subsequent matches.</p><br/><p>With Gongsun Wan’er having conceded, Ghostfang took another victory.</p><br/><p>Meanwhile, in the second battle region, booms echoed out as Shangguan Tianyou fought Gongsun Yun, who had managed to stand up to Ghostfang for one finger attack. Bugs poured out of Gongsun Yun’s sleeves, blotting out the sky as they rushed toward Shangguan Tianyou.</p><br/><p>Shangguan Tianyou’s expression turned slightly more somber as he waved his right hand, sending a flying sword buzzing out, bursting with sword qi.</p><br/><p>It should have been a battle that everyone watched closely. However... audiences from both the south bank and the north bank were all staring at the third battle zone.</p><br/><p>That was where Bai Xiaochun had loftily taken the stage to fight against Xu Song!</p><br/><p>Xu Song looked over at him with a cold smile.</p><br/><p>“You might be good with medicinal pills and defenses. But now that you’ve met me, you’re doomed to meet a painful end!” With that, Xu Song waved his hand violently through the air, causing cracking sounds to ring out as three beasts appeared out of thin air. One of them was a three-meter-tall gorilla, another was a huge tiger, and the last... was a gigantic bat.</p><br/><p>As soon as they appeared, they radiated powerful energy that would crush even someone in the ninth level of Qi Condensation.</p><br/><p>“Alright, Bai Xiaochun, let’s see if your defenses can stand up to a sustained volley by my three battle beasts!” Smiling viciously, he prepared to attack.</p><br/><p>“Why don’t you concede?” Bai Xiaochun said. Sighing, he produced an Aphrodisiac Pill and looked sympathetically over at Xu Song.</p><br/><p>The north bank disciples were thrown into fits of rage.</p><br/><p>“He said it again!”</p><br/><p>“Eradicate Bai Xiaochun!”</p><br/><p>When Xu Song saw the medicinal pill, he threw his head back and laughed uproariously. Face filled with derision and even complacency, he said, “I knew all along that you would try to use that shameless medicinal pill. Did you really think I would come unprepared? I set these three battle beast aside just for you. They’re all female!”</p><br/><p>It was because of this that Xu Song was so confident, convinced that he would be able to give the north bank a chance to get revenge.</p><br/><p>When the north bank disciples heard his words, they instantly got excited, and began to cheer for Xu Song.</p><br/><p>Bai Xiaochun’s heart thumped, and his eyes turned up in thought. After a moment, he looked back at Xu Song, eyes filled with sympathy as he said, “This medicinal pill is effective on humans too, not just animals.”</p><br/><p>With that, he looked meaningfully at Xu Song’s three female battle beasts.</p><br/><p>His words sent the north bank disciples into complete silence. They stared in shock, subconsciously visualizing certain scenes in their mind, cruel scenes that caused them to gasp.</p><br/><p>Xu Song’s eyes went wide, and his mind filled with thunderous rumbling. His face drained of blood as he contemplated how both Beihan Lie and Gongsun Wan’er had both lost. He suddenly realized that if what Bai Xiaochun said was true, and the medicinal pill’s aphrodisiac effects worked on people.... He swallowed nervously. Without even thinking about it, he edged away from his three battle beasts, trembling. In turn, the three battle beasts, intelligent as they were, looked over at Xu Song and also began to tremble.</p><br/><p>Without the slightest hesitation, Xu Song quickly put them away, not daring to bet that Bai Xiaochun was bluffing. Even though he had the feeling that Bai Xiaochun was most likely lying, he didn’t want to risk it.</p><br/><p>Even as the trembling Xu Song put away his battle beasts, Bai Xiaochun strode forward. Light flickered as his defenses went up, and as he closed in on Xu Song, he reached his right hand back and then waved it out in front of him.</p><br/><p>A blast of power surged out. Xu Song’s strength lay in his control of beasts, and at the moment, he didn’t dare to use even a single one. That cut his effective power in half, and made it impossible for him to stand up to Bai Xiaochun. He was instantly sent flying, blood spraying out of his mouth. When he staggered to a stop, rage and humiliation filled his eyes as he shrieked that he conceded.</p><br/><p>Bai Xiaochun blinked and then cleared his throat. Clasping hands and bowing, he strutted off the arena floor amidst the countless enraged curses from the north bank disciples.</p><br/><p>“Bai Xiaochun, y-y-you...”</p><br/><p>“That damned medicinal pill ought to be destroyed!”</p><br/><p>“Heavens! I’ll pay ten spirit stones to anyone who can take down Bai Xiaochun!”</p><br/><p>“I’ll put in fifty spirit stones! Take him out!” The north bank was going crazy, and countless people began to shout out that they would add spirit stones as well. Soon the total was over 10,000. The shocked south bank disciples looked at Bai Xiaochun, their admiration for him growing by leaps and bounds.</p><br/><p>The huge bounty caused Bai Xiaochun’s face to flicker, and he hurried to escape the arena floor. It felt like a cold wind was blowing up his back, especially when the total bounty passed 20,000 spirit stones. His heart began to thump.</p><br/><p>“You people are so unreasonable!” he said loudly, hoping to explain. “Every single time I go out there, I always give them a chance to concede!”</p><br/><p>His explanation only further enraged the north bank disciples, and soon the spirit stone bounty reached 30,000. Up overhead, the phoenix reveled in Bai Xiaochun’s misfortune, and let out continuous piercing cries.</p><br/><p>The elders on the balcony were getting more and more amused.</p><br/><p>“I'm a Prestige disciple!” Bai Xiaochun cried threateningly. “I'm the Junior Brother of the sect leader. If anybody tries to put a bounty on me, I’ll have my Master kick them out of the sect!”</p><br/><p>Then... the north bank disciples went even crazier. It was hard to say who lost control first, but a flying sword appeared and shot toward the arena floor. Countless north bank disciples all produced various magical items, and their battle beasts roared as if they were preparing to fight a bloody war.</p><br/><p>Bai Xiaochun fled in terror. Thankfully, the sect elders on the balcony couldn't let matters go any further. With a single glance, they held back the north bank disciples.</p><br/><p>It was around this time that the battle between Shangguan Tianyou and Gongsun Yun ended. Shangguan Tianyou had used three flying swords, and Gongsun Yun had gone all out with everything he possessed. In the end, Gongsun Yun conceded, ending the fight.</p><br/><p>Shangguan Tianyou was slightly out of breath. Gongsun Yun had been strong enough that he had been forced to really start fighting hard. When he left the arena floor and noticed how enraged the north bank disciples were, he frowned and looked over at Bai Xiaochun. Although his eyes flickered with contempt, his heart twinged with jealousy.</p><br/><p>“Relying only on medicinal pills and defenses? I can’t believe we’ve reached the same stage! Hmph!” With that, Shangguan Tianyou sat down cross-legged and closed his eyes to do breathing exercises.</p><br/>\n</div>"}