{"title": "Chapter 116: The Founder Appears!!", "id": 116, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-116-the-founder-appears", "volume_title": "Volume 2", "body": "<h1>Chapter 116: The Founder Appears!!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>On Mount Daoseed, the cave where Bai Xiaochun’s Master had been interred was surrounded by tens of thousands of disciples, all of whom were glaring daggers. It was a restricted area, but the fact that they came as part of such a huge mob gave them the courage to enter.</p><br/><p>“Bai Xiaochun, get the hell out here right now!”</p><br/><p>“Show your face!!”</p><br/><p>“Bai Xiaochun, you villainous scoundrel, god will punish you this day! We will punish you this day!”</p><br/><p>However, even as the sound of their voices rang out, someone inside the cave itself bellowed, “Pipe down!”</p><br/><p>The powerful shout was backed by the full power of Bai Xiaochun’s cultivation base, causing it to echo out like thunder, completely crushing the sound of all other voices.</p><br/><p>Simultaneously, the slender Bai Xiaochun appeared, striding solemnly out of the cave.</p><br/><p>When the congregated disciples of the three mountain peaks saw him, they immediately hefted the rocks they held in their hands, angrily preparing to pelt him. But then, Bai Xiaochun let out a powerful shout and thrust a portrait out in front of him.</p><br/><p>It was the portrait of his Master.... It was also Zheng Yuandong’s Master, a Spirit Stream Sect patriarch from the previous generation.</p><br/><p>Although somewhat nervous, Bai Xiaochun bellowed, “What gall! If anyone dares to harm the portrait of my Master, Elder Brother Sect Leader and I will fight you to the death!”</p><br/><p>When the mob saw Bai Xiaochun crouching behind the portrait of his master, they went stiff, and many of them gasped. Not a single one dared to hurl a rock.</p><br/><p>That portrait depicted a patriarch of the sect, the Master of the sect leader himself. If any of them dared to harm it, it could only be imagined how wrathfully Zheng Yuandong would respond. Furthermore, it was certain that not a single peak lord would interfere.</p><br/><p>The disciples were so enraged they were about to blow their tops, and yet, they didn't dare to do a thing. “Completely shameless!!”</p><br/><p>Seeing that his tactic was working, Bai Xiaochun breathed a sigh of relief. Holding the portrait high, he glared around at the mob.</p><br/><p>“You people listen and listen well. I really didn't do it on purpose, I--”</p><br/><p>If Bai Xiaochun hadn’t tried to explain the situation, things would have gone much smoother. But as soon as he opened his mouth, the crowd started to lose control.</p><br/><p>“Y-y-you, you always say you didn’t do it on purpose! Fragrant Cloud Peak got attacked by lightning, and you said it wasn't on purpose. Violet Cauldron Peak and Green Crest Peak got drenched with acid rain, and it wasn’t on purpose. And now you’re saying the same thing again!”</p><br/><p>“This is ridiculous!!”</p><br/><p>Bai Xiaochun quickly waved around the portrait of his master. Sounding genuinely apologetic, he continued, “My Master just visited me in a dream and told me he forgives me! I guarantee, this is the last time. There absolutely, positively won’t be another--”</p><br/><p>To hear Bai Xiaochun shamelessly claim that his deceased Master had visited him in his dreams enraged the crowd even further.</p><br/><p>“I can't take this anymore! I'm gonna beat him black and blue!”</p><br/><p>“Even if he was the sect leader’s son, I’d still beat the crap out of him!”</p><br/><p>“Take Bai Xiaochun down!!”</p><br/><p>It was at this point that numerous streams of Foundation Establishment divine sense suddenly swept across the area.</p><br/><p>Moments later, several dozen people flew down from the summit of Mount Daoseed. There were elders of the various mountains, peak lords, and even Zheng Yuandong.</p><br/><p>Seeing what was happening, Zheng Yuandong shouted in a rage-filled voice that echoed like thunder: \"Leave this place immediately!!”</p><br/><p>The ear-splitting sound of his voice struck fear into the hearts of everyone present, even Shangguan Tianyou and the other Chosen. Trembling in fear, they withdrew.</p><br/><p>Bai Xiaochun’s spirits were rising rapidly. He was just about to say something when Zheng Yuandong looked over at him with a ferocious glare.</p><br/><p>“Bai Xiaochun, as your Elder Brother, I won’t let anyone else beat you, but I can certainly give you a thrashing!” With that, he shot in Bai Xiaochun’s direction. Bai Xiaochun’s scalp began to tingle so hard it felt like it might explode. He was just about to brandish the portrait of his master when Zheng Yuandong swished his sleeve, causing the portrait to fly over to him.</p><br/><p>Bai Xiaochun let out a shriek, and a pair of wings sprouted out behind him as he prepared to flee. However, before he could get very far, a powerful smacking sound rang out, which was Zheng Yuandong’s palm making contact with his rear end.</p><br/><p>Searing pain swept through him, and he screamed. Looking like he was about to cry, he shrieked, “Save me, Uncle Li! My Elder Brother’s trying to kill me!!”</p><br/><p>Li Qinghou’s eyelid twitched, and he pretended not to have heard. Zheng Yuandong's fury had not been sated in the least; seeing Bai Xiaochun waving around the portrait of his master had him fuming, so next, he unleashed a kick.</p><br/><p>Bai Xiaochun screamed again, sounding even more anguished than before.</p><br/><p>“Save me, Master! Save me!!”</p><br/><p>Seeing Zheng Yuandong beating Bai Xiaochun caused the anger among the onlookers to slowly fade. Soon, strange expressions appeared on the faces of the elders, and they began to cough dryly.</p><br/><p>“This is a personal matter with the sect leader and his family....”</p><br/><p>“Right, right. Oh, I have some medicinal pills in the furnace, I’ll take my leave now.” Hiding their smiles, the elders began to disperse.</p><br/><p>Soon, only Li Qinghou and Xu Meixiang were left hovering in midair. As Li Qinghou watched Bai Xiaochun off in the distance, he seemed a bit emotional. After all, he had high expectations for Bai Xiaochun.</p><br/><p>Xu Meixiang looked over at Li Qinghou, her gaze soft. “In his heart, he views you as his father,” she said softly. “Are you really willing to abandon him to the north bank?”</p><br/><p>Li Qinghou shifted his gaze from Bai Xiaochun to Xu Meixiang. Shaking his head slightly, he said, “All the things Xiaochun did don’t really matter. Deep down, he’s a good person. Furthermore, I can tell that he really is sorry for everything.... Sending him to the north bank as punishment isn’t really necessary.</p><br/><p>“But I was being honest with what I said to the sect leader earlier. Ever since he got the Waterswamp Kingdom from the north bank, I’ve been thinking about the matter. Bai Xiaochun’s latent talent is superb. The ideal situation would be for him to combine the best aspects of both banks. Besides, if he can successfully cultivate the Waterswamp Kingdom, and reach the great circle of the tenth level of Qi Condensation within a few years, well... then maybe we can accelerate the opening of the Fallen Sword Abyss. In that case, he might be able to forge a new path for himself.”</p><br/><p>“The Fallen Sword Abyss?” Xu Meixiang replied, looking shocked. “One of the three Holy Lands of the Four Great Sects in the eastern Lower Reaches of the Heavenspan River.... Supposedly, there are even traces of heavenstring energy there. Whenever we open it, all of the Four Great Sects of the eastern reaches, the Blood Stream Sect, the Pill Stream Sect, the Profound Stream Sect, and our Spirit Stream Sect, will send in disciples from the tenth level of Qi Condensation to participate in a bloody struggle....”</p><br/><p>“That bloody struggle is necessary....” Li Qinghou said with a light sigh. “If he doesn’t master the Waterswamp Kingdom, I won’t let him go. But if he does, then he absolutely must go. Cultivation is a long, blood-soaked path. Only the fit survive and prosper. He needs to learn to deal with that, not shirk from it.” With that, the two of them turned and left.</p><br/><p>That day, Bai Xiaochun’s screams filled the sect. Zheng Yuandong was dead set on teaching him a lesson, not as the sect leader, but as his Elder Brother.</p><br/><p>Late that night, Bai Xiaochun, his nose bloodied and his face swollen, trudged along behind Zheng Yuandong as they returned to their Master’s cave.</p><br/><p>“On your knees!” Zheng Yuandong said, glaring. “Apologize to Master!” Bai Xiaochun was so frightened that he immediately plopped down to his knees in front of the portrait.</p><br/><p>“Master, I apologize....” Bai Xiaochun felt so swollen he thought he might burst at any moment, especially his buttocks. “Master,” he continued, on the verge of tears, “when all of those disciples came to beat me up, you felt sorry for me, and visited me in a dream. Sir, I tried to tell Elder Brother, but he didn't believe me....</p><br/><p>“Master, why don’t you visit Elder Brother in his dreams tonight, and tell him the truth...?” Zheng Yuandong stood off to the side, unsure of whether to laugh or cry. He had a mind to beat him, but when he thought about how terrifyingly tough Bai Xiaochun’s skin was, his hand ached a bit, and he held back.</p><br/><p>“Kneel here for three months,” he said. “That’s your punishment for the disaster of 10,000 Snakes Valley!” He had no other choice but to do this, for the sake of the disciples of the three mountain peaks. With that, he gave a cold harrumph, and then swished his sleeve, causing a medicinal pill to tumble out. Pretending he hadn’t noticed the pill, he turned and left.</p><br/><p>Seeing that Zheng Yuandong was leaving, Bai Xiaochun immediately let out an anguished cry. He was about to start complaining to his Master about everything, but first, he looked around to make sure that the miraculously stealthy rabbit wasn’t around.</p><br/><p>“Oh, woe is me, Master....</p><br/><p>“Elder Brother beat me so hard... my butt hurts so bad. Look. Look! I'm swollen all over!</p><br/><p>“This is so unfair! I really didn’t do any of it on purpose.... I didn’t... huh?” It was at this point that he noticed a medicinal pill on the ground, which was none other than the pill Zheng Yuandong had just left behind.</p><br/><p>“A high-grade tier-three Energy Building Pill!”</p><br/><p>Eyes shining, he quickly looked around outside the cave, then sat down off to the side. Feeling a bit bored, he consumed the pill and then began to focus on cultivation.</p><br/><p>About that time, something happened that none of the disciples or even the peak lords in the sect noticed. Behind Mount Daoseed, in a wide-open, empty area, everything suddenly began to distort.</p><br/><p>Moments later, the distortions vanished. However, what was now faintly visible, right there behind Mount Daoseed, was... another mountain peak!</p><br/><p>It was... the ninth mountain peak of the Spirit Stream Sect. Although the sect leader was aware of its existence, even he hadn’t noticed the strange distortions from moments before.</p><br/><p>The ninth mountain peak of the Spirit Stream Sect was incomparably quiet and peaceful, and all of the plants and vegetation that covered it were pitch black. At the summit of the mountain, atop a black peach tree, was a monkey, sitting there quietly, mixed emotions visible in its eyes.</p><br/><p>If Bai Xiaochun were there, he would recognize it instantly. Astonishingly... it was the same thoughtful monkey that had eaten one of his mystery pills, and that he had released into the wild some time ago.</p><br/><p>Eventually, the monkey sighed.</p><br/><p>“I know you’re there,” he said. “Might as well stop hiding.”</p><br/><p>As soon as the monkey spoke, the air behind him distorted, and an old man appeared, tall, wearing a long violet robe. He stepped out of thin air, looking almost like an ordinary mortal, with seemingly no cultivation base power whatsoever emanating off of him. At the same time, however, he almost looked like a Paragon, standing right there!</p><br/><p>A strange expression appeared on the old man’s face as he came to stand off to the side. A moment later, a third eye opened on his forehead, and he looked down at the monkey. “You are...?”</p><br/><p>The monkey turned to look at the old man, eyes gleaming with profound light. “You don’t recognize me, my apprentice? Or perhaps I should call you the founding patriarch of the Spirit Stream Sect?”</p><br/><p>Astonishingly, this old man was the same person who had led the Spirit Stream Sect to its position as one of the Four Great Sects, its founding patriarch! Currently, he seemed to be in a state of shock. Pupils constricting, he took a deep breath, disbelief flashing across his face.</p><br/><p>“Impossible. You... you died! What are you doing back?!?!?!”</p><br/><p>Despite his status in the sect, his cultivation base, and his level of willpower, he couldn’t help but gasp. Deep down inside, in the depths of his soul, he was sure that this was indeed his enigmatic Master who had passed away 10,000 years ago.</p><br/><p>The monkey said nothing. He looked over at Mount Daoseed, and his gaze passed through the mountain into a cave, where Bai Xiaochun sat meditating. Although no one would ever be able to tell, within the monkey’s eyes could be seen... a rare trace of reverence.</p><br/><p>“I'm not sure how I came to be here. Perhaps it was young Bai Xiaochun’s medicinal pill. Or perhaps... some other mysterious force guided his hand... to bring me back. In any case, I am not the only one to have returned.”</p><br/><p>The violet-robed old man followed the monkey’s line of sight to Mount Daoseed, and saw Bai Xiaochun sitting there.</p><br/><p>“A Qi Condensation disciple? How could he have done this!?” The old man still couldn't quite believe what was happening.</p><br/><p>“Frigidsect!\" the monkey barked. \"Do you remember why I gave you that name?! Do you remember why your Master gave you such a heaven-defying mission? Why I ensured that you could exist for 10,000 years?! Answer me!” The monkey’s eyes shone with a piercing, menacing light. It even seemed as though thunder were rumbling in the area. However, the effects were apparently confined to a thirty meter area around them. Not even the other patriarchs on the ninth mountain peak were aware of anything strange.</p><br/><p>The violet-robed old man, the founding patriarch of the Spirit Stream Sect, shivered slightly as he recalled memories from 10,000 years ago. Despite how many years had passed, he remembered things clearly. He was old, but with his Master here in front of him, he suddenly felt like a young man again. He stood straight and tall, his face flushed a bit, looking almost like a soldier as he responded, “Sir, I remember. My mission is to guard the true spirit, to ensure that the Spirit Stream Sect becomes one of the sects in the Middle Reaches of the eastern Heavenspan River, and then, a sect of the Upper Reaches. After that, we must invade the northern Heavenspan River, fight our way through its Upper Reaches, and eradicate the Nine Heavens Cloud Lightning Sect. Return to our ancestral home, restore the glory of the Frigid School!”</p><br/><p>“So, you do remember our ancestral home, and the true spirit,” the monkey said, a strange look in its eyes. “Well then, take a look at the magical symbol beneath Fragrant Cloud Peak!”</p><br/><p>Frigidsect looked over at Fragrant Cloud Peak and immediately frowned. Hidden within each of the eight mountain peaks of the Spirit Stream Sect was a complex magical symbol, which collectively were the lifeblood of the Spirit Stream Sect. The extreme importance of those magical symbols was difficult to describe with words.</p><br/><p>However, Frigidsect didn’t notice anything out of the ordinary about Fragrant Cloud Peak’s magical symbol.</p><br/><p>The monkey sighed softly, and the profound look in his eyes grew even stronger.</p><br/><p>“You can't see it, huh...? It seems I came back a bit too late. Someone else returned before me and sent their dark disciple to use the variations of plants and vegetation... to alter the spell formation.</p><br/><p>\"The primeval magical symbol beneath Fragrant Cloud Peak was tampered with, and reversing the situation with my current power wasn’t really possible. The only thing I could do was use what little strength I have left at my disposal to guide Bai Xiaochun into inciting the spirit snakes. Then things can recover naturally.”</p><br/>\n</div>"}