{"title": "Chapter 115: No! Dont Spread That!", "id": 115, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-115-no-dont-spread-that", "volume_title": "Volume 2", "body": "<h1>Chapter 115: No! Dont Spread That!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Not a single snake was left in 10,000 Snakes Valley. Bai Xiaochun stood there inside the spell formation, looking around at the surrounding emptiness. Suddenly, a tremor ran through him as everything around him began to quake violently. Screaming, he shot out at top speed through the mouth of the cave.</p><br/><p>His scalp was numb, and he was shaking; he knew that this time... the chaos he had unleashed was too severe. All of the snakes in 10,000 Snakes Valley had escaped, and the mere thought shook him to his core.</p><br/><p>“I’m done for. Finished. Kaput....” On the verge of tears, he raced out of 10,000 Snakes Valley, where he instantly caught wind of the countless enraged shouts coming from the three mountain peaks. Furthermore, he heard numerous people calling his name.</p><br/><p>Tugging at his hair, he couldn’t stop thinking that he really was innocent in the whole affair, maligned to the extreme.</p><br/><p>“I really didn’t do it on purpose.... I was just... I was just trying to make the snakes a bit cuter, that’s all.” He was sniffling a bit, and his heart was pounding. If he had the power, he would instantly change his appearance so that no one could recognize him.</p><br/><p>“What do I do?” he murmured to himself. “What do I do...? There’s nothing left to do. I can only go to Master’s cave and hide. Nobody will think to look for me there....” With that, he slapped his bag of holding to produce a new set of clothes. After changing, wings sprouted from his back, and he sped as fast as he could move toward Mount Daoseed.</p><br/><p>The three mountains were in the grip of pandemonium. Howls and roars echoed out constantly. Bai Xiaochun deeply regretted having become so famous recently. Virtually everyone knew him, so all he could do was duck his head down and speed along as quickly as possible. As he moved along, if the wind even moved a branch, he would avoid it for fear it was someone about to pop out and see him.</p><br/><p>Of course, because of the general chaos, nobody noticed him passing. Everyone was in the middle of fleeing from the horned snakes. When Bai Xiaochun saw how maddened everyone was, his heart began to pound. However, he managed to take advantage of the chaos to speed to Mount Daoseed without being noticed. He arrived out of breath, fear lingering in his heart. Moments later, he was approaching the cave in which his Master had passed away into meditation.</p><br/><p>To other people, it was a restricted area, but Bai Xiaochun could come and go as he wished. A cloud of dust rose up into the air behind him as he raced into the cave and dropped to the ground in front of his master’s portrait.</p><br/><p>“I really didn’t do it on purpose....” he said, sniffing. “Master, you know I'm a good person, right?” Bai Xiaochun looked up miserably at the image of his Master, a smiling man who had the demeanor of a transcendent being.</p><br/><p>By this point, the elders of the three mountains had sprung into action. Li Qinghou, Xu Meixiang, the sect leader, and even the peak lord of Green Crest Peak all appeared. Under their leadership, they managed to capture all of the horned snakes. Soon, the three mountains began to calm down.</p><br/><p>After the Foundation Establishment cultivators ended the snakepocalypse, the disciples of the three mountains, a massive mob of tens of thousands of people, all charged toward 10,000 Snakes Valley, bursting with anger. Seeing how the valley had been almost completely destroyed, and unable to find any traces of Bai Xiaochun, they quickly expanded the search to cover the rest of the south bank.</p><br/><p>There was no organization of the affair; everyone instinctively took to action. Thankfully for Bai Xiaochun, he had reacted quickly, otherwise he would quickly have been apprehended.</p><br/><p>“Take Bai Xiaochun down!!”</p><br/><p>“And that talking rabbit too! That thing has to die!”</p><br/><p>“Take Bai Xiaochun down! Take the talking rabbit down!”</p><br/><p>After several hours passed, the entire area had been turned upside down, and yet nobody had seen a single trace of Bai Xiaochun. The disciples’ eyes were turning bright red, and some of them even left the sect to search outside, their anger building.</p><br/><p>“We're going to find you, Bai Xiaochun!”</p><br/><p>“Even if you run to the ends of the earth, we’ll track you down!”</p><br/><p>“Dammit! Where could he possibly be hiding!?” Countless roars echoed out in all directions, gradually reaching the ears of Bai Xiaochun on Mount Daoseed, who shivered constantly.</p><br/><p>“Hey, I got screwed here too! It's all that damn rabbit’s fault. I-I-I... I didn’t want any of this!” Bai Xiaochun sat there nervously, sighing constantly. After waiting for some time, and having noticed that the uproar outside seemed to have died down a bit, he looked at the portrait of his Master, heart pounding. Then he began to kowtow.</p><br/><p>“Master, sir, please bless and protect me, and prevent those villains from finding me....” After some time passed, he crept up to the mouth of the cave, and after ensuring the shouting outside had indeed died down, breathed a sigh of relief.</p><br/><p>“Bai Xiaochun’s wits come out on top again!” he said with a chuckle. “Nobody will ever think to come looking for me in my master’s cave.</p><br/><p>“But this isn’t really a solution. I’ll have to leave eventually.... What do I do, what do I do...?” Suddenly, he had the feeling that someone was watching him. He looked back toward the mouth of the cave, and saw... the talking rabbit, its ears swiveled to point directly at him.</p><br/><p>In the instant that he saw the rabbit, his eyes went wide. How could he ever have imagined that the thing could move with such unbelievable stealth? It had actually managed to enter even this restricted area. All of a sudden, Bai Xiaochun thought back to what he had just been saying to himself, and all his hair stood on end. Shrieking miserably, he cried out, “No! Don’t spread that....”</p><br/><p>But then, a whooshing sound could be heard as the rabbit vanished. An instant later, it was far off in the distance, crying out its usual repertoire of passages. However, a new one had been added onto the end.</p><br/><p>“Master, sir, please bless and protect me, and prevent those villains from finding me....</p><br/><p>“Bai Xiaochun’s wits come out on top again! Nobody will ever think to come looking for me in my master’s cave.</p><br/><p>“But this isn’t really a solution. I’ll have to leave eventually.... What do I do, what do I do...?</p><br/><p>“No! Don’t spread that....”</p><br/><p>Bai Xiaochun felt as if he had just been struck by lightning. He stood there mutely, watching the rabbit vanish into the distance, shouting as it ran along. His mind began to spin.</p><br/><p>“Damn that rabbit!” he raged. “I'm gonna skin it alive!!”</p><br/><p>By this point, the disciples of the south bank had searched just about everywhere, but hadn’t found a single trace of Bai Xiaochun. Eventually, they began to suppress their wrath and speculate about where exactly he might be.</p><br/><p>“Where could Bai Xiaochun be hiding? The whole sect has been searching, and there’s not even a record of him leaving the area. That means he definitely has to be on the south bank.</p><br/><p>“Fragrant Cloud Peak. Green Crest Peak. Violet Cauldron Peak. We’ve searched every nook and cranny, every mansion and immortal's cave!!”</p><br/><p>“We even turned the servants district inside out. Don't tell me Bai Xiaochun burrowed underground somewhere?!?!”</p><br/><p>However, even as their wrath burned hot, a rabbit suddenly appeared, running along at top speed and calling out at the top of its lungs. When it got to the last line, it sounded particularly despairing.</p><br/><p>“No! Don’t spread that....”</p><br/><p>When people heard it, their jaws dropped, and their heads turned to look in the direction of the rabbit. As for the people like Shangguan Tianyou and Lu Tianlei, they clenched their fists and burst into motion. Other disciples threw their heads back and laughed uproariously.</p><br/><p>“Good rabbit!!”</p><br/><p>“That rabbit is a real mischief-maker, but it’s finally gone and done something good!”</p><br/><p>“Fine, I won’t kill that rabbit today. Instead, I’ll kill Bai Xiaochun....”</p><br/><p>Soon, tens of thousands of disciples were streaming toward Mount Daoseed, fists clenched tightly, murderous auras raging.</p><br/><p>Bai Xiaochun sat there in the cave, burning with hatred toward the talking rabbit. He hated it even more than he hated Elder Zhou’s phoenix. Trembling, he was just about to set to flight, when he heard a huge commotion further down the mountain. Looking down, he saw countless figures speeding in his direction. Scalp tingling, he backed up to hide as deep as he could in the cave.</p><br/><p>“I’m done for. Finished. Kaput....” As he sat there in front of his Master’s portrait, he suddenly started to get very angry.</p><br/><p>“Master, can’t you help me, sir? Send your soul down, otherwise... I, a Prestige disciple who has shed my own blood for the sect will be beaten to-- what?” In his moment of despair, he glanced up at the portrait, and suddenly, his eyes began to shine. He slapped his thigh.</p><br/><p>“Hahaha! Many thanks for your reminder, Master. Disciple understands!”</p><br/><p>It was at around this time that Sect Leader Zheng Yuandong was presiding over a meeting in the great hall atop Mount Daoseed. The peak lords of the south bank and all the elders were all there, and all of them had serious looks on their faces.</p><br/><p>They had already been there for two hours, during which time Zheng Yuandong had been explaining his thoughts regarding Bai Xiaochun.</p><br/><p>“Sect leader, please reconsider carefully. J-Junior... Junior Brother Bai has astounding innate talent. Assigning him to the south bank is a real waste!”</p><br/><p>“That’s right. Junior Brother Bai might have you as his Senior Brother, sect leader, but we’re all a big family. We know that you aren’t taking sides. A genius cultivator like that should definitely be placed in a position with greater prospects, like the north bank. That’s where Junior Brother Bai can truly unleash his heavenly talent!”</p><br/><p>It wasn’t just the three peak lords who were going on in this manner, the elders joined in as well.</p><br/><p>The headache Zheng Yuandong was experiencing couldn't be more bitter. The Spirit Stream Sect had been quiet for two years; how could he ever have imagined the Bai Xiaochun would be the source of so much turmoil? This time, the disaster of 10,000 Snakes Valley left him thoroughly convinced of how good Bai Xiaochun was at causing disasters.</p><br/><p>He had the feeling that since Bai Xiaochun was a disciple of the south bank, and had already caused the trouble he had, things probably couldn’t get much worse. On the other hand, if he reassigned him to the north bank... it was likely that the next time he had a meeting like this, it would be with the peak lords and elders of both banks together.</p><br/><p>Clearing his throat, he said, “Junior Brother Bai might be naughty and mischievous, but he is a Prestige disciple. Ahem. He’s also very young. Let’s leave him on the south bank. I have a lot of faith in you south bank people.”</p><br/><p>Eyes bloodshot, Elder Zhou looked over and said, “Sect leader, we beg of you....”</p><br/><p>Li Qinghou clasped hands toward Zheng Yuandong. Sighing, he said, “Sect leader, Xiaochun has been practicing the Waterswamp Kingdom. To truly understand that technique, he really should go to the north bank to observe many different types of beasts. In the past 10,000 years, not many people have succeeded in it. Furthermore, after joining the sect, Bai Xiaochun now only lacks a life essence spirit. I think... going to the north bank would be for the best.”</p><br/><p>“That’s right!” said the peak lord from Green Crest Peak. “Sect leader, Bai Xiaochun cultivates the Waterswamp Kingdom, and he’s an official Chosen, on the verge of true enlightenment. Looking back at the history of the Spirit Stream Sect, he’s truly in a unique position!”</p><br/><p>“Sect leader,” Elder Zhou said, “please don’t interfere with Junior Brother Bai’s progress. It could be a loss the likes of which the sect hasn’t sustained in 10,000 years!” All of the other elders joined in to express their agreement.</p><br/><p>Seeing how intent everyone was, Zheng Yuandong knew that clinging to his original idea wouldn’t be easy. After a moment of hesitation, he smiled wryly and prepared to come up with another way to refuse them. However, it was at that point that a disciple called out from outside the hall.</p><br/><p>“Sect leader, something bad is happening.... Sect Uncle Bai is in the patriarch’s cave.... He’s... he’s....”</p><br/><p>Jaws dropped within the hall, and numerous streams of divine sense flew out toward the cave. When they saw the situation, strange expressions appeared on their faces. Zheng Yuandong immediately had a bad feeling. When his divine sense entered the cave, his eyes went so wide they almost bulged out of his skull. Then, a tremor of rage erupted within him.</p><br/><p>“That little brat! Fine. I accept your proposal. Send him to the north bank!!”</p><br/>\n</div>"}