{"title": "Chapter 111: Making Contact with the Shackles", "id": 111, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-111-making-contact-with-the-shackles", "volume_title": "Volume 2", "body": "<h1>Chapter 111: Making Contact with the Shackles</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It was deep in the night, and the moon hung bright in the sky. It was very dark inside the cave, but Bai Xiaochun could hear a cacophony of slithering and hissing outside. It was hair-raisingly terrifying.</p><br/><p>The stone hut was small, and other than the earthflame formation and the pill furnace, was completely empty.</p><br/><p>Bai Xiaochun sighed and activated the earthflame formation, causing the light of flames to flicker out around him. That made him feel a bit better. He was the type of person who tended to get used to new environments easily. Although he was scared, he knew he had to adapt. A moment later, he peered into the bag of holding Li Qinghou had left him, whereupon his eyes went wide.</p><br/><p>It was filled with a massive quantity of medicinal plants, some of which cost a huge amount of merit points to acquire from the sect. There were even a few that he recognized from the five volumes of plants and vegetation as types that the sect didn't offer.</p><br/><p>There was a huge variety of all types of medicinal plants, too many to count. If he used them carefully, he would be able to concoct not only tier-3 spirit medicines, but possibly even tier-4 spirit medicines.</p><br/><p>Getting excited, he heated up the pill furnace and then began concocting some medicine. As long as he could distract himself from the sounds coming from outside, he could still continue his research. This time, he was sure that he would be able to reduce the impurities in the tier-3 medicine below ninety percent.</p><br/><p>Time passed. Three months later, Bai Xiaochun’s hair was disheveled, and he had completely forgotten where he was. He was utterly focused on medicine concocting, and as for the black smoke which resulted in acid rain on the outside, it was actually refreshingly nourishing to the vipers in the cave. The snakes struggled to be the first to breathe it in, after which they emitted deafening hisses.</p><br/><p>Bai Xiaochun didn’t pay any attention to that, though. He was at a critical point in his concocting, and had reduced the impurities in the toxic pills all the way down to ninety-one or ninety-two percent. Just a bit further, and he would have succeeded in reaching his goal.</p><br/><p>His eyes were bloodshot as he madly concocted medicine. In the blink of an eye, three more months passed.</p><br/><p>He had now been living in the snake cave for half a year. In addition to his concocting, he practiced cultivation. He was now able to fully unleash the Waterswamp Kingdom, which resulted in incredible pressure. Unfortunately, he was completely incapable of summoning his life essence spirit.</p><br/><p>He’d also grown accustomed to the snakes. He would even take the occasional walk outside of the stone hut. The snakes would eye him coldly, ready to pounce the instant he set foot outside of the spell formation shield.</p><br/><p>Li Qinghou occasionally came to check in on Bai Xiaochun in secret. After coming to the conclusion that Bai Xiaochun was safe, he breathed a sigh of relief.</p><br/><p>Because Bai Xiaochun hadn’t been seen for half a year, the south bank quieted back down. There was no thunder or lightning, no noxious clouds, no acid rain. Everyone enjoyed the peace and tranquility.</p><br/><p>Occasionally, people would think about Bai Xiaochun, but most people had heard that Li Qinghou took him to 10,000 Snakes Valley. Furthermore, whenever people considering breaking sect rules, they would think of Bai Xiaochun and say to themselves, “I can't pull a Bai Xiaochun! This is wrong. If Bai Xiaochun did something like that, he would definitely be punished. I should rethink things.”</p><br/><p>Time passed. Another six months. It had now been a full year since Bai Xiaochun had disappeared from the public eye. Even Zheng Yuandong was sighing.</p><br/><p>“Sending Bai Xiaochun to 10,000 Snakes Valley was definitely the right thing to do,” he thought. “The only things there are snakes. He won’t be able to cause problems for anyone.”</p><br/><p>However, whether it was Zheng Yuandong, Li Qinghou, or the disciples of the three mountain peaks, all of them... had clearly underestimated Bai Xiaochun....</p><br/><p>On one particular day, Bai Xiaochun was there in his stone hut, having just finished concocting a batch of medicinal pills. There was no black smoke. The pill inside the furnace was no longer a toxic pill, but rather, an eighty-nine percent impure low-grade medicinal pill!</p><br/><p>Although it would be considered low-grade even among other low-grade pills, it was still completely different than a toxic pill.</p><br/><p>Excited, he threw his head back and laughed uproariously. After trying another batch, he confirmed his success. At long last, when it came to tier-3 spirit medicine... he could succeed one hundred percent of the time!</p><br/><p>With this level of mastery of tier-3 spirit medicine, even pill formulas he hadn’t encountered before would have a perfect success rate after he solved any minor problems which cropped up.</p><br/><p>Thoroughly stirred up, he rushed out of the stone hut, laughing proudly. He had paid a very heavy price, and spent a huge amount of time, to reach this point.</p><br/><p>Actually, now that he thought about it, even being thrown into the snake cave was worth it!</p><br/><p>He took a deep breath, swished his sleeve, and looked with disdain... at the snakes surrounding him.</p><br/><p>“Next comes cultivation. I need to reach the ninth level of Qi Condensation, and get my Undying Gold Skin!!” Feeling very proud of himself, he returned to the stone hut, where he once again began to concoct medicine.</p><br/><p>Pulling out his turtle-wok, he performed spirit enhancements on all of the medicinal pills he had produced, then consumed them.</p><br/><p>His cultivation base increased steadily. He had already been in the great circle of the eighth level of Qi Condensation, just a sliver away from breaking through to the next level. A month later, as he sat there cross-legged meditating, visualizing an enormous war mammoth, his cultivation base exploded with power. The spiritual power within him thrummed like a hundred rivers flowing together into a sea.</p><br/><p>After closer inspection, the sea actually looked like a dragon, as though a dragon had actually come to exist inside of him. As it circulated through his qi vessels, his fleshly body emitted cracking sounds, and the image of a mammoth appeared behind him.</p><br/><p>It was a huge beast with long fur, rising up on its hind legs to let out a powerful roar. When it slammed its feet down onto the ground, ripples spread out through the air, causing the nearby snakes to tremble. The eight bloodgod cobras’ eyes shone with piercing light, their scales stood on end, and the hoods on their heads opened wide.</p><br/><p>Bai Xiaochun had been observing the image of the mammoth from the Dragon Mammoth Sea-Forming Scripture. The resulting surge of spiritual power pushed his cultivation base all the way from the eighth level of Qi Condensation into the ninth!</p><br/><p>The power of his fleshly body rocketed up, and his qi and blood flowed rapidly. He actually seemed to grow a bit larger as every bit of flesh and muscle flourished.</p><br/><p>Apparently because of his Undying Live Forever Technique, his silver skin flickered, and something strange happened. It was as if his fleshly body had come into contact with a type of shackle, a barrier that someone with an ordinary body couldn’t break through!</p><br/><p>Rumbling filled his mind, and everything felt like it was spinning. It was like he was a bottle which, after being filled with water, had more water forced into it, causing the bottle to begin to shake and crack.</p><br/><p>A tremor ran through him, and his eyes snapped open to reveal an astonishing, piercing light.</p><br/><p>If any ordinary disciple in the Qi Condensation stage could see Bai Xiaochun right now, that person would be shaken to the core. Although the pressure he exuded was not that of a Foundation Establishment cultivator it would still cause anyone to tremble in capitulation.</p><br/><p>It was like a pressure which could crush down on all living things!</p><br/><p>“Everyone has shackles,” he murmured. “Regardless of the level of cultivation base or fleshly body, there are shackles which people cannot break through.... So, the shackles mentioned in the Dragon Mammoth Sea-Forming Scripture... are the same shackles I heard about before!</p><br/><p>“In the Dragon Mammoth Sea-Forming Scripture... the power of the mammoth represents the body, and can push a person’s fleshly body to the very pinnacle. The power of the dragon represents the spirit, and can push a person’s cultivation base to the limit of Qi Condensation. That is the purpose of the first and second levels, to reach the pinnacle, not to make contact with the shackle. When cultivating the third level, the dragon and the mammoth combine and rise even higher, and that is when contact with the shackle can be made. By borrowing power from the meridians of heaven and earth, as well as a Foundation Establishment Pill, one can break through, form a sea of qi, and... reach Foundation Establishment!</p><br/><p>“Obviously, not just anyone can cultivate the Dragon Mammoth Sea-Forming Scripture. Only people who have cultivated both their spirit and their body all the way the eighth level of Qi Condensation can successfully do so.</p><br/><p>“My Undying Live Forever Technique might be incomplete, and only contain the Undying Skin. But as that mysterious senior said when he saved me, if I reach the level of Undying Gold Skin, I can make contact with the first shackle. When that happens, if I can break through it, it will be good fortune for me.</p><br/><p>“What I’ve sensed today must be that so-called... shackle!” Bai Xiaochun’s eyes shone so brightly that they were like lamps inside the dark stone hut.</p><br/><p>“The founding patriarch created the Dragon Mammoth Sea-Forming Scripture. By cultivating it to the very end, you can combine the dragon and the mammoth, and make contact with the shackle. However, making contact is the limit.</p><br/><p>“In the first volume of the Undying Codex, the Undying Gold Skin can also make contact with the shackle, but that is the limit there as well. Only by breaking through the shackle after making contact can you go on to cultivate the second volume, the Undying Heavenly King!</p><br/><p>“Right now, though, I've only successfully cultivated the first level of the Dragon Mammoth Sea-Forming Scripture, and my Undying Skin is only at the peak of silver. Once I experience a breakthrough, I should meet the requirements... to make contact with the shackle!” Bai Xiaochun was panting by this point.</p><br/><p>“Actually, making a breakthrough with either technique... should enable me to make contact with the first shackle!” Excited, Bai Xiaochun thought the matter over again, and realized something even more exciting.</p><br/><p>“If this analysis is correct, I wonder what level my fleshly body will be at if I break through with both the Undying Gold Skin and the Dragon and Mammoth?”</p><br/><p>Although he couldn’t be sure of the answer, he was filled with intense anticipation. Taking a deep breath, he produced some medicinal pills to restore his vital energy, then began to cultivate the Undying Live Forever Technique.</p><br/><p>The flickering silver light inside of him was gradually filling with strands of gold. They were faint at first, but they indicated that his Undying Live Forever Technique was on the threshold of the Undying Gold Skin.</p><br/><p>After the time it takes an incense stick to burn, he finished his session of cultivation and excitedly emerged from the stone hut. Looking around the cave, he subconsciously adopted the posture of a hero, flicking his sleeve and murmuring, “I'm already in the ninth level of Qi Condensation. Just wait until I break through that first shackle. When that happens, not a single person in the eighth level of Qi Condensation will be a match for me!”</p><br/><p>Sighing to himself, he suddenly noticed the masses of snakes around him, and how they were slithering and hissing, some of them even spitting venom.</p><br/><p>Off in the distance were the bloodgod cobras, who were in the eighth level of Qi Condensation. One of them suddenly shot forward, only to bounce off of the spell formation’s shield.</p><br/><p>Stunned, Bai Xiaochun glared around at the hissing snakes, angry at how they were constantly spitting out venom.</p><br/><p>“You really think Lord Bai has no way to deal with you? Don’t push me, you bunch of--”</p><br/><p>Before he could finish speaking, a whole group of snakes launched themselves into the air and then slammed into the shield right in front of him.</p><br/><p>“That’s it, you pushed me!” he howled, rushing back into the stone hut.</p><br/>\n</div>"}