{"title": "Chapter 113: Something Really Bad.", "id": 113, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-113-something-really-bad", "volume_title": "Volume 2", "body": "<h1>Chapter 113: Something Really Bad.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There was something strange about this particular tier-3 spirit medicine. As for its overall quality, shockingly, it had surpassed the low-grade to reach mid-grade. Bai Xiaochun was ecstatic, and immediately forgot about how depressed he was because of the rabbit.</p><br/><p>Holding the pill in his hand, his excitement grew until he was panting, and his eyes glittering.</p><br/><p>“This pill is a spirit medicine that can change the fate of 10,000 Snakes Valley.... It will teach all of these snakes... how to shut their mouths!” Even as a proud smile spread across his face, he suddenly remembered the rabbit, and his heart thumped. But then the violent hisses of the snakes reached his ears, as well as the sound of snakes slamming into the spell formation shield.</p><br/><p>“Pipe down!” he growled, glaring over at them. With that, he produced the turtle-wok and performed a spirit enhancement.... Furthermore, he didn't stop at a twofold enhancement; he drew upon his few remaining spirit tails to perform a threefold enhancement.</p><br/><p>Silver light glittered, and many of the impurities in the medicinal pill were removed; shockingly, it rose from mid-grade to premium-grade!</p><br/><p>Medicinal pill in hand, Bai Xiaochun strode out of the stone hut to stand at the edge of the spell formation, where he looked at the countless snakes spraying venom and slamming into the shield.</p><br/><p>“Half a year ago, Lord Bai told you that I would show you how awesome I am. Don’t forget. You forced me to do this!” With that, he waved his hand, sending the medicinal pill shooting out of the spell formation to land in the middle of all the snakes.</p><br/><p>He had added a drop of his own blood to the mixture, so as soon as the pill flew out, countless snakes pounced, struggling amongst each other to be the one to swallow it down. The snake to win out in the end was in the fourth level of Qi Condensation, a cloudy-eyed death viper. As soon as it swallowed the pill, a tremor ran through it, and its eyes began to shine with a strange light.</p><br/><p>Bai Xiaochun looked over excitedly, but before anything else could happen, one of the bloodgod cobras charged forth. Considering it was in the eighth level of Qi Condensation, it crushed numerous other snakes that got in its path, reducing them to nothing more than a gory paste. Then, it swallowed the cloudy-eyed death viper in a single gulp.</p><br/><p>Bai Xiaochun’s eyes went wide as he looked over at the bloodgod cobra, which looked back at him with cold eyes before slithering to a rocky outcropping, where it coiled up.</p><br/><p>Bai Xiaochun was starting to get nervous, but had no choice other than to wait and see what else happened. After the time it takes an incense stick to burn, the bloodgod cobra suddenly shivered. Apparently, it wanted to open its mouth, but there was something very sticky keeping it shut. It struggled mightily, and managed to open its mouth a crack, revealing sticky strands stretching between its lips and fangs.</p><br/><p>Bai Xiaochun was delighted to see that his work was a success, and eagerly awaited the second effect of the spirit medicine to start working.</p><br/><p>Yet again, enough time passed for an incense stick to burn. The bloodgod cobra’s mouth was now completely sealed shut. Its eyes were bulging out of its head, and instead of being cold and vicious, they now looked like the eyes of a goldfish. The snake seemed confused, and instead of being fierce like before, it seemed slightly cute....</p><br/><p>Soon, poofing sounds could be heard from the bloodgod cobra, like that of flatulence. A pink gaseous substance appeared, which rapidly transformed into a fog that spread out in all directions.</p><br/><p>More poofing sounds could be heard; apparently the bloodgod cobra was not yet finished expelling gas. Bai Xiaochun looked on excitedly as the process continued for the rest of the day.</p><br/><p>Other than the area within the spell formation, the entire cave was now filled with a pink haze, which the other snakes inhaled. Gradually, a sticky substance began to build up in their mouths, and their eyes began to bulge. Soon, the next set of snakes began to pass gas.</p><br/><p>Eventually, the poofing sounds rang out like muffled thunder, echoing out about the cave constantly. As the haze filled the subterranean chamber, all the of the snakes came to be affected.</p><br/><p>Even the snakes deepest within the chamber, whose glittering eyes Bai Xiaochun found the most frightening, began to emit poofing sounds.</p><br/><p>A few days later, the haze faded away. Bai Xiaochun stood there in the spell formation, looking around at the silent snake cave. There was no hissing, no venom spraying around. The mouths of all the snakes were shut tight, and their blank eyes bulged with confusion.</p><br/><p>Bai Xiaochun threw his head back and laughed uproariously. Sticking his chin up proudly, he naturally assumed the sullen manner of a lonely hero and swished his sleeve.</p><br/><p>“With the snap of a finger, I shut the mouths of all the snakes in 10,000 Snakes Valley. As for that profoundly consummate pill of mine, I shall hereby name it... the Shut Your Trap Pill!”</p><br/><p>The lonely hero strode out from within the spell formation into the hordes of lovely little snakes. As he looked around, he smiled happily and felt like even more of a hero. But then he noticed a one-step viper off in the distance who was glowing red, almost as if its body were heating up. Then, in the strangest of developments, it suddenly started thrashing around violently.</p><br/><p>Now that the one-step viper’s mouth was stopped up, it couldn’t hiss, and even seemed impervious to pain. Soon, its skin was lacerated and bleeding, and yet it didn't stop thrashing around.</p><br/><p>Shocked, Bai Xiaochun had a mind to intervene, but the one-step viper truly seemed to have gone mad. Then, Bai Xiaochun’s face fell as more snakes in the vicinity all started turning red and thrashing around. The heat emanating from them even caused the air to ripple and distort.</p><br/><p>Most conspicuous of all was the bloodgod cobra, which had grown much larger since consuming the medicinal pill, and was thrashing about with particular violence.</p><br/><p>In the depths of the cave, rumbling sounds began to echo out, and soon all of the snakes were thrashing around with maddened violence. Some of them even launched themselves into the air and slammed into the stone walls.</p><br/><p>Bai Xiaochun's eyes were wide as saucers as he dove back into the spell formation. Instantly, the countless surrounding snakes began to batter against the spell formation shield as if they were insane. The mere sight of it caused Bai Xiaochun’s scalp to grow numb.</p><br/><p>“Oh man, this is bad. These snakes are going crazy. If they keep thrashing around, something really bad is going to happen!” Bai Xiaochun was starting to get very nervous. His original intention had simply been to get the snakes to close their mouths; he had never imagined that something like this would result. As soon as he thought about how angry Li Qinghou would be when he saw the current state of the snakes, he began to tremble.</p><br/><p>He ran anxiously back into the stone hut and began to concoct a medicinal pill. He produced vast amounts of medicinal plants, hoping to concoct some remedy to solve the problem. No longer was he proudly complacent like before. Instead, he looked like he was about to cry, and frightened out of his mind. A few days later, he charged out of the stone hut, hair disheveled, eyes bloodshot.</p><br/><p>He had three medicinal pills in his hand, which he had concocted over the past three sleepless days and nights. What he hoped was that these pills would calm the snakes down, and at least buy him some time to concoct a true antidote.</p><br/><p>The scene which met his eyes as he emerged was shocking. All of the snakes were writhing and thrashing in complete madness. The stone walls were cracked and smashed, and many of the snakes were covered in bloody wounds.</p><br/><p>Bai Xiaochun really was about ready to cry. He quickly tossed out the medicinal pills, which exploded in midair, causing a mist to spread out over the snakes. Almost immediately, they calmed down, and their wounds even began to heal....</p><br/><p>A few days later, the snakes were still calm, and the thrashing behaviour hadn’t returned. Finally, Bai Xiaochun breathed a sigh of relief.</p><br/><p>“You nearly scared Lord Bai to death! I thought something bad was going to happen. Humph! Well, with my skill in the Dao of medicine, this was pretty much a non-event!” Feeling very proud of himself, Bai Xiaochun was about to go about working on an antidote when he suddenly stopped in place and swallowed hard, looking at one particular snake off in the distance.</p><br/><p>It was a cloudy-eyed death viper, and now that it had recovered completely, it began to emanate a shocking aura. The fluctuations were not that of the cultivation base, but rather, its fleshly body. It suddenly twitched, hitting a nearby boulder and smashing it to pieces.</p><br/><p>Bai Xiaochun’s widened. There were quite a few cloudy-eyed death vipers in the cave, and although their venom was deadly to the extreme, their bodies were relatively weak. They definitely shouldn’t be this strong physically, and yet, his eyes weren’t deceiving him.</p><br/><p>Panting, he looked around at the other snakes, and sweat began to drip down his forehead.</p><br/><p>“How is this possible?” he muttered hoarsely.</p><br/><p>More snakes began to twitch, and then erupt with fleshly body power. They weren’t thrashing about, and yet, even their slightest movement caused the ground to tremble. Boulders were shattered as if the snakes were whips in the hands of almighty beings, whips that could smash any obstacle to pieces.</p><br/><p>They all possessed seemingly unlimited fleshly body power, and even worse, some of them were starting to head in his direction.</p><br/><p>Before, the spell formation could stop them easily, but now it began to tremble and emanate cracking sounds. If that spell formation broke, Bai Xiaochun couldn't even imagine how he would possibly deal with so many infinitely powerful snakes.</p><br/><p>It was then that the bloodgod cobra, which had an even stronger fleshly body than the other snakes, slammed into the spell formation. At the same time, the head of another snake appeared from the very depths of the cave. The snake stared at Bai Xiaochun with bulging eyes.</p><br/><p>The head was enormous, roughly three meters long; as such, it was only possible to imagine how long the rest of the snake was. Terrified, Bai Xiaochun screamed and ran back into the stone hut to start concocting another temporary remedy.</p><br/>\n</div>"}