{"title": "Chapter 119: Its Spring, and I Planted My Beastbirth Seed", "id": 119, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-119-its-spring-and-i-planted-my-beastbirth-seed", "volume_title": "Volume 2", "body": "<h1>Chapter 119: Its Spring, and I Planted My Beastbirth Seed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After a moment of silence, he made his decision. “I've come to the north bank to study. I have to keep a low profile!”</p><br/><p>With that, he poured some spiritual power into the jade slip Sun Wen had given him. Soon afterward, nearly a thousand glowing lights appeared in his mind, each one of which was one of the beasts located in the area.</p><br/><p>“So, I'm supposed to take care of these beasts....” Soon, his eyes began to shine. Whether it was because of his knowledge of the five volumes of spirit creatures, or his wondrous battles with the other Chosen from the north bank, he was very interested in the beasts here.</p><br/><p>Seeing that the blue sky was beginning to turn into the amber of evening, he hurried outside. The calls of beasts could be heard within the jungle. It was spring, and everything was alive and full of energy. A gentle breeze blew past, carrying the fragrance of flowers. Using the jade slip, Bai Xiaochun began to explore the jungle and look for beasts.</p><br/><p>“Highbrow beast!!</p><br/><p>“Waterspout dragon?!?! Their organs can be used to as the base of tier-4 spirit medicines!</p><br/><p>“Is that... a cloudmist mink? Not only are they incredibly quick, their fur can be turned into defensive magical devices.” The more Bai Xiaochun looked around, the more excited he got. He was finally getting a chance to personally see some of the animals he had only studied in the five volumes of spirit creatures. Seeing pictures and seeing them in real life were completely different experiences. Already, his mastery of the five volumes of spirit creatures was growing.</p><br/><p>He saw a six-meter-tall monkey, a huge bear that could blend into its surroundings, a fierce winged tiger, and even a thirty-meter-long pangolin which sped by right in front of him.</p><br/><p>The beasts were all wild in nature, and initially treated him with hostility. But when they sensed the aura on his jade slip, they stopped paying him any attention.</p><br/><p>Bai Xiaochun looked around excitedly at all of the wild beasts. Soon, he realized that the jade slip made it so that the animals didn’t care about him, not even the most vicious of them. That was when he started trying to approach them. However, they reacted with irritation when he got too close.</p><br/><p>After a moment of thought, he decided that he wouldn’t try to push things too far. When night fell, he returned to the honor guard station.</p><br/><p>The following morning at dawn, he got up early. Using the jade slip as his guide, he flew here and there in the jungle, observing the animals. Time passed. Soon, Bai Xiaochun had been on the north bank for half a month.</p><br/><p>During that time, he never left the Beast Conservatory, and as such, no matter how much the other disciples wanted to cause problems for him, they were unable to.</p><br/><p>That half month was a wonderful time for Bai Xiaochun. Every day, he would excitedly go out to personally observe animals that he had learned of in the five volumes of spirit creatures. He was already coming to realize how certain aspects of his medicine concocting were lacking.</p><br/><p>“Before, I focused only on plants and vegetation. I never even thought about the spirit creature ingredients. By adding them in, I can create even more transformations in my medicine. Couple that with the techniques of mutual augmentation and suppression, and my concocting will be much better than before.” Currently, he was flying excitedly through the jungle when he caught sight of a flying tiger, laying on the ground panting. One of its legs was wounded and bleeding, apparently having been injured while hunting.</p><br/><p>When Bai Xiaochun hurried over, the flying tiger let out a powerful roar. However, Bai Xiaochun managed to push his hand down onto its back, ensuring that it couldn't move even if it wanted to. After all, his fleshly body strength was terrifying, even compared to the flying tiger’s.</p><br/><p>“Don't move, I’ll help you with that wound.” Bai Xiaochun quickly cleaned the wound, and then put some medicinal powder on it. Finally, he released the tiger.</p><br/><p>It flew up into the air, and then roared at Bai Xiaochun. A moment later, though, it looked in shock at its previously wounded leg. With a final glance at Bai Xiaochun, it flew off into the distance.</p><br/><p>Smiling, Bai Xiaochun watched it fly off.</p><br/><p>After finishing his day of observing the beasts, he returned to his residence. Up above, the sky was starting to grow dark. Standing there, he retrieved a wooden box from his bag of holding.</p><br/><p>After opening it, he produced a fist-sized seed which pulsed with a strong life force, almost like a heartbeat. It was even possible to see something squirming around inside.</p><br/><p>“Beastbirth Seed!” he murmured, eyes shining brightly. He had acquired this item back when the Luochen Clan had turned traitor. It had been inside the bag of holding of one of the Luochen Clan cultivators. Of course, it was a legendary item within the cultivation world.</p><br/><p>In the years that followed, Bai Xiaochun had done some research into the item, and had learned from the five volumes of spirit creatures that if it absorbed the quintessence of one or more beasts, it could naturally give birth to a bloodline descendent of those very beasts.</p><br/><p>Back on the south bank, Bai Xiaochun had considered what it would be like to have his own battle beast, but had never been able to meet all the requirements. Now that he was here on the north bank, however, he did.</p><br/><p>“A Beastbirth Seed can give birth to a baby beast. However, an ordinary beast wouldn’t be fitting for me as a Prestige disciple and the Junior Brother of the sect leader. I need to tend to this Beastbirth Seed very carefully. After it blooms, I’ll collect the quintessence of all the most powerful beasts. That way, it will give birth... to a beast that has the inherited the strong suits of all beasts! It will be unprecedented since ancient times, and something no one will ever see in the future.... It will be the ultimate battle beast!” Eyes shining with brilliant light, and feeling in higher spirits than ever, he took a deep breath and took the wooden box back to the rear courtyard of the honor guard station.</p><br/><p>There, he had set up a small garden to grow spirit plants, which was located within the protective spell formation of the honor guard station. He had even performed a threefold spirit enhancement on the spirit soil, just to be safe.</p><br/><p>He carefully buried the Beastbirth Seed in the ground, eyes shining with anticipation.</p><br/><p>“According to the information in the five volumes of spirit creatures, it won’t take too long for the Beastbirth Seed to grow....” He stayed in the garden looking at the spot where he'd planted the seed until night fell. When it was dark, he left. Moments later though, he returned. Only after checking that the spell formation’s defenses were all in order did he finally go back inside.</p><br/><p>He didn’t rest well that night, and went out frequently to check on the spot where he'd planted the seed.</p><br/><p>Another half month passed before he finally managed to get his excitement and anticipation under control, and devote himself fully to observing the beasts. Other than that, he had his daily cultivation routine, and his study of the sect rules.</p><br/><p>Occasionally, other north bank disciples would show up in the Beast Conservatory. They would pay some merit points at the stone stele for an opportunity to observe the beasts, or to attempt to bond them as battle beasts.</p><br/><p>However, Bai Xiaochun kept the rear courtyard under tight guard. He had even made some adjustments to the spell formation nodes to ensure that no one could trample the garden.</p><br/><p>Time passed. Half a year went by in complete peace and quiet.</p><br/><p>During that time, Bai Xiaochun never stepped out of the Beast Conservatory even once. He spent all day in the jungle, with the beasts as his companions. He treated injuries among quite a few of them, and even created some simple medicinal pills for them that got their qi and blood pumping healthily.</p><br/><p>Because of Bai Xiaochun’s constant care, and his medicinal pills, the beasts soon began to develop a good relationship with him. As they grew more accepting, it became easier to approach them more closely and observe them in more detail. Although he didn't bond any of them, they became very similar to battle beasts, and would listen to every word he spoke.</p><br/><p>One day as he was strolling along through the jungle, three north bank disciples approached the stone stele outside the honor guard station. After purchasing three days’ worth of time in the Beast Conservatory, they entered the jungle.</p><br/><p>One of them was the previous honor guard, Inner Sect disciple Sun Wen, who had handed his duties over to Bai Xiaochun half a year before.</p><br/><p>He was flanked by two Outer Sect disciples, one male and one female. The male disciple was short and babyfaced, while the female disciple was young, with a curvaceous body and a beautiful face.</p><br/><p>Looking around excitedly, the young woman said, “Thanks, Elder Brother Sun. With you here, I'm much more confident in getting my own battle beast.” She looked over at Sun Wen with open admiration.</p><br/><p>“Yeah, that’s right,” said the short male disciple, equally excited. “Elder Brother Sun is an Inner Sect disciple, and served as honor guard in the Beast Conservatory for several years. He’s adept at controlling the beasts here. I'm sure they all remember exactly who he is.”</p><br/><p>“I think you’re exaggerating a bit,” Sun Wen replied, although he seemed very pleased. “Although it is true that I can command many of the beasts here. If you see one you like, I’ll see what I can do. I'm sure I can at least spare you some effort.</p><br/><p>“However, you have to remember that there are ten particular battle beasts here with fiery tempers. For example, there’s the skyflame bear, the nightstalker ape, the scarlet flying tiger, and worse of all, the plated mountain juggernaut. Sometimes, people need to be careful even when they come here with protection. Remember not to provoke any of the beasts.” When Sun Wen looked at the female disciple, his heart surged a bit, but inwardly, he sighed.</p><br/><p>There was a lot of under-the-table profit to be made in the Beast Conservatory, especially if you were posted there. You could help people find the right beasts using the jade slip, and could even make it easier for them to bond them.</p><br/><p>If he’d had his way, he would never have left his post. However, the sect had given him no other choice than to hand it over to Bai Xiaochun, a decision which he resented. Thinking about these things, he led the other two disciples into the jungle, and before long, they had seen quite a few beasts. Many of them came to Sun Wen when he called out to them; clearly, they still remembered him.</p><br/><p>“How about this kiwi-deer?</p><br/><p>“What about that flying cloudmouse? That’s considered one of the top six hundred beasts here. Want it?</p><br/><p>“You two have pretty good luck. This saber-toothed mustang ranks in the top three hundred. When I first saw it, years ago, it wasn’t even close to being this big.</p><br/><p>“Eee? It’s a dancing flame butterfly! Hahaha! It’s in the top three hundred, and can cast hallucination magic. Do you want that one?” As they walked along, the two disciples looked at Sun Wen with admiration bordering on worship. Many of the beasts in the area, upon catching sight of him, would stop what they were doing, as if they were simply waiting to be bonded.</p><br/><p>The male disciple excitedly picked the saber-toothed mustang, but the female disciple hesitated a bit before abandoning the dancing flame butterfly. She turned to Sun Wen, clearly hoping to get a better beast.</p><br/><p>“Elder Brother Sun, are there any that are in the top two hundred?”</p><br/><p>“Don’t aim too high,” Sun Wen said in a serious tone. “Battle beasts in the top two hundred are very difficult to tame. Even after serving as the honor guard here for years, I was never able to successfully command them. I bet the new honor guard hasn’t even been a third as successful as me. In all of the sect, not a single Qi Condensation disciple could tame such an animal. The two of you should be careful about which beasts you try to control. It can be a very dangerous thing. You--” Before he could finish speaking, the young woman’s eyes went wide, and she pointed excitedly toward a nearby boulder.</p><br/><p>“Elder Brother Sun, quick, look over there. It’s a flying tiger!!” Assuming that since Sun Wen was with her, she didn’t have anything to worry about, she began to perform an incantation gesture without even thinking about it. Instantly, the shamanic powers of the north bank were unleashed, and began to shoot toward the flying tiger.</p><br/><p>When Sun Wen turned, he saw a winged tiger lounging on the nearby boulder, looking at the three of them with ruthless coldness.</p><br/><p>“Scarlet flying tiger!! Dammit! It usually doesn’t show up here. It’s one of the top ten battle beasts!” His eyes widened, and then he realized that the female disciple was trying to cast shamanic magic on it, and his heart trembled. Grabbing the two Outer Sect disciples, he fell back at top speed. He had only been leading the two Outer Sect disciples into areas where the beasts were relatively docile. The sect wanted the beasts to maintain their wild nature, and because of that, the Beast Conservatory could be a very dangerous place, especially for Outer Sect disciples. Normally, they would only come in when escorted by someone from the Inner Sect.</p><br/><p>The flying tiger leapt to its feet and let out a roar as powerful as thunder. When the shamanic power hit it, the power instantly dispersed. However, the tiger’s eyes turned bright red as it shot toward the group of three.</p><br/><p>“Not good!!” Shocked, Sun Wen could only watch as the tiger flew up into the air, causing wind to blast out in all directions as power equivalent to the ninth level of Qi Condensation rose up. The two Outer Sect disciples were shocked, and were already shaking in terror. Sun Wen gritted his teeth and pulled out a jade slip to call for help.</p><br/><p>However, it was at that moment that a surprised voice could be heard from off in the distance.</p><br/><p>“Eee? Tigger, stop being so naughty. Down, boy!”</p><br/>\n</div>"}