{"title": "Chapter 120: Fight Me, Bai Xiaochun!", "id": 120, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-120-fight-me-bai-xiaochun", "volume_title": "Volume 2", "body": "<h1>Chapter 120: Fight Me, Bai Xiaochun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As soon as his voice echoed out, the aggressive flying tiger shuddered, and then immediately dropped down to the ground, kicking up a significant cloud of dust. There it lay, tail swishing back and forth, its tongue stuck out of its mouth, looking over at an enormous figure approaching from the distance.</p><br/><p>It was a gigantic, thirty-meter-long pangolin, with cold green eyes and a brutally murderous aura.</p><br/><p>These developments occurred so quickly that Sun Wen simply gaped in shock, and the two Outer Sect disciples behind him gasped.</p><br/><p>The female disciple was completely dumbstruck; to have seen the flying tiger suddenly become so docile, only to have the huge pangolin arrive, left her wondering if all of these things were really happening. She simply couldn’t imagine how the flying tiger which had caused her Elder Brother Sun to flee at top speed could be ordered down with a single sentence. Its current charming appearance was a complete contrast with the brutal ferocity it had exhibited moments before.</p><br/><p>“One of the ten great battle beasts?” murmured the male Outer Sect disciple. Looking at the enormous pangolin, he couldn’t help but gasp in shock.</p><br/><p>“Plated... mountain... juggernaut....” Sun Wen was also shocked by the sight of the enormous pangolin. Even the mere pressure which radiated off of it was shocking. However, what struck him with even more shock was the person he saw sitting on the pangolin’s back.</p><br/><p>“It’s you!” he choked.</p><br/><p>Perched on the pangolin’s back was Bai Xiaochun. As the pangolin neared, he rose to his feet and leaped into the air, landing next to the flying tiger and bopping it on the head.</p><br/><p>“Are you going around scaring people again!?” Bai Xiaochun said, sounding cross. The flying tiger blinked, then lowered its head and licked Bai Xiaochun's leg. Sun Wen felt as though his brain were being struck by lightning, and the two Outer Sect disciples behind him were flabbergasted.</p><br/><p>“Sorry, guys,” Bai Xiaochun said. “Tigger isn’t really that bad. He’s just a bit naughty and likes to scare people. Tigger, you apologize this instant!” With that, he gave the flying tiger’s paw a soft kick.</p><br/><p>Looking a bit annoyed, the flying tiger turned its head toward Sun Wen and let out a roar. Although it didn’t roar at the top of its lungs, it still sounded like thunder, and caused Sun Wen and the others to tremble inwardly.</p><br/><p>Bai Xiaochun looked at the group of three, and pretended that he didn't recognize Sun Wen, even though he did. Smiling, he said, “Are you guys here to select battle beasts?”</p><br/><p>“Yeah, we're... we’re here to select battle beasts....” the female disciple said, swallowing hard, fear flickering in her eyes as she looked at Bai Xiaochun. The fact that battle beasts which frightened her Elder Brother Sun could become as charming as little puppies was completely terrifying.</p><br/><p>“Ah, I see,” Bai Xiaochun replied. “Well maybe we were destined to meet here. I might as well give you a hand.” Clearing his throat, and looking very enthusiastic, he threw his head back and let out a powerful roar.</p><br/><p>As the roar echoed out into the jungle, the ground began to tremble. Moments later, an enormous ape crashed into view, coming to a stop directly in front of Bai Xiaochun. Grinning at him, it beat its chest with its fist and howled at the top of its lungs.</p><br/><p>“You go stand over there, Apie,” Bai Xiaochun said, waving his hand, “you’re not their type.” The huge ape moped off to the side, face downcast.</p><br/><p>Sun Wen was left shaking. He immediately recognized the ape as one of the ten great battle beasts, the fierce nightstalker ape. He had once personally witnessed this very nightstalker ape crush the head of a waterwood lion. It was an explosively violent creature.</p><br/><p>And yet, in front of Bai Xiaochun, it was docile and charming, something that Sun Wen would never have dreamed could be possible.</p><br/><p>A moment later, a huge bear tromped up, stood on its hind legs in front of Bai Xiaochun and then started dancing back and forth.</p><br/><p>“Teddy, we have guests!” Bai Xiaochun said, starting to get a bit frustrated. “Settle down!” The bear looked over at Sun Wen and the others, and let out a powerful roar.</p><br/><p>“Sky... skyflame bear. I can’t believe it’s dancing....” Sun Wen’s vision was swimming, and his mind reeled from the massive waves of shock that battered it. As for the two Outer Sect disciples, however shaken they were before, they were now ten times more so, and were filled with unprecedented terror.</p><br/><p>Then, the ground started to shake even harder as one beast after another appeared. A huge horde of hundreds of beasts assembled, none of them the docile type that Sun Wen had found before. These beasts were all fierce and terrifying.</p><br/><p>Sun Wen and the Outer Sect disciples instantly went weak at the knees. As for the Outer Sect disciples, their faces were ashen as sensations of imminent crisis filled them from head to toe.</p><br/><p>“Very well,” Bai Xiaochun said, trying to sound profound. “Take your pick.” He coughed lightly.</p><br/><p>Sun Wen was at a complete loss. He simply couldn’t imagine what Bai Xiaochun might have done to make all of these beasts follow his orders, and in a mere half a year at that.</p><br/><p>The fact that Sun Wen had been stationed here for years left him feeling bitter inside. The sharp contrast between himself and Bai Xiaochun was bad enough for him, there was no need to even mention the deep regret felt by the male Outer Sect disciple.</p><br/><p>He admired all of the beasts present, and was filled with bitterness that he had carelessly selected one already. If he had merely waited a bit longer, he might have met this miraculous Elder Brother, and stumbled into incredible good fortune. But now... he had no such chance.</p><br/><p>The female disciple was trembling in disbelief. She quickly pointed at a huge black condor, which let out a piercing cry. Normally, it was fierce to the extreme, but around Bai Xiaochun, that changed. It allowed the young woman’s shamanic magic to pour into it, slowly bonding it to her. After that, it took to flight, soaring above them through the air.</p><br/><p>Bai Xiaochun laughed, and then waved his hand. Instantly, the rest of the beasts dispersed, and he jumped back up onto the pangolin’s back. The pangolin let out a roar and turned to carry Bai Xiaochun off into the distance.</p><br/><p>Almost unwilling to believe that she had succeeded, the young woman called out, “Elder Brother, what’s your name?”</p><br/><p>Bai Xiaochun immediately felt quite proud of himself. Sticking his chin up, he naturally assumed the melancholy posture of a lonely hero. Swishing his sleeve, he said, “Call me... Bai Xiaochun.”</p><br/><p>Clasping his hands behind his back, he stood there atop the pangolin, hair swaying in the wind, looking a bit depressed. After all of his years of practice, he had become very good at assuming this look.</p><br/><p>The image she was seeing was instantly branded deep into the female disciple’s mind.</p><br/><p>“Bai Xiaochun? Why does that name sound so familiar...?” The male disciple’s jaw dropped, and his eyes went wide with incredulity. “The archenemy of the north bank!!”</p><br/><p>The female disciple gasped, suddenly remembering why Bai Xiaochun’s name was so familiar. However, it seemed completely impossible to correlate the archenemy of the north bank with this lonely, melancholy figure in front of her.</p><br/><p>Finally, Sun Wen led them out of the Beast Conservatory.</p><br/><p>Back in the jungle, Bai Xiaochun sat down on the pangolin’s back. With no one there to look at him, he sloughed off the lonely hero look and began to proudly hum a little tune. At the same time, he tossed out medicinal pills to the nearby creatures.</p><br/><p>In addition to how he dutifully cared for them, one of the reasons the beasts had become so docile around him during the past half year was his medicinal pills.</p><br/><p>Because of the pills, the beasts felt stronger and more energetic than ever, causing them to like him and grow closer to him on a daily basis.</p><br/><p>Of course, not all of the beasts had the same reaction. There were some that were extremely cautious. However, Bai Xiaochun didn’t care. All in all, his half year in the Beast Conservatory had been one of complete happiness.</p><br/><p>Recently, his Beastbirth Seed had even sprouted, filling him with intense excitement.</p><br/><p>Good things just kept happening one after another. He had also come to find that his Waterswamp Kingdom was progressing, and although his life essence spirit hadn’t appeared yet, the technique itself was growing more ferocious.</p><br/><p>The way things were going, Bai Xiaochun had the feeling that his cultivation of the Waterswamp Kingdom would definitely lead to the appearance of a life essence spirit. The main thing he was curious about was what type of beast it would be.</p><br/><p>He couldn't stop thinking about what it would be like to have a complete Waterswamp Kingdom, a top secret magic that was of the same caliber as Ghostfang’s Ghosts Haunt the Night. He also wondered what his battle prowess would be.</p><br/><p>Filled with anticipation, he focused on cultivation for another month. By this time, he had been on the north bank for the better part of a year. Although he never left the Beast Conservatory and kept a low profile, stories about him taming the beasts began to spread among the disciples outside.</p><br/><p>That news, as well as stories about Bai Xiaochun’s past deeds, became one of the most common conversation topics among the north bank disciples. The scene that had played out during the Chosen battles caused countless disciples to gnash their teeth. The thought of what had occurred with Beihan Lie left them feeling as if they were being stabbed in the heart. Then they would look at their own battle beasts, and the pain would become indelible shadows across their hearts.</p><br/><p>One day, Beihan Lie finally emerged from secluded meditation. There he stood in his immortal's cave, his eyes wide as he looked at a jade slip which had arrived half a year ago, informing him that Bai Xiaochun had come to the north bank. Baring his teeth, he crushed the jade slip.</p><br/><p>“Bai Xiaochun, the humiliation you heaped upon me will be cleansed today! You might be strong, but I’ve made a lot of progress in the years since then. Unheard-of progress!! I've finally pushed my Sunset Incantation to the third level! I'm invincible under Foundation Establishment!” His cultivation base erupted, and it was at the great circle of the ninth level of Qi Condensation. After the intense provocation from years ago, he had gone mad with his cultivation, until he was in a state of frenzied hysteria.</p><br/><p>“Bai Xiaochun!!” Beihan Lie threw his head back and roared, bursting out from his immortal's cave. Many people noticed what was happening, especially the Gongsun siblings and Xu Song.</p><br/><p>“So powerful!! He actually pushed the Sunset Incantation all the way to the third level! Nobody's done that for the past thousand years! He’s grown, but then again, so have we. It's hard to say how much more powerful he is compared to back then!”</p><br/><p>“Anybody who experienced such a tragedy would surely relive it every day and go mad, just like he did.”</p><br/><p>Even as the Chosen observed Beihan Lie with trembling hearts, he transformed into a beam of light that shot toward one of the most popular locations on the north bank, the centrally located trial platform.</p><br/><p>The trial platform was actually a clawed stone hand attached to the statue of an enormous, ferocious beast. The statue itself was thirty meters tall, vicious to the extreme, and even seemed to emanate the air of battle. It looked something like an upright crocodile, covered with scales, with three rows of sharp spikes running down its back. Even more shocking was that the clawed hand made up more than half of its entire body.</p><br/><p>Its left hand was somewhat eroded from the wind and rain, but its right hand stretched up as if to rip apart the heavens!</p><br/><p>The trial platform was the palm of that right hand!</p><br/><p>The statue had been discovered four thousand years ago in the Spirit Stream Sect’s Ancient Beast Chasm. It had taken quite a bit of work to extract it and set it up in its current location, where it became the north bank’s popular trial platform.</p><br/><p>Currently, Beihan Lie stood on the trial platform, eyes shining with the desire to fight. Throwing his head back, he howled, “I'm putting up all of the merit points I have. 37,000! I hereby challenge Bai Xiaochun!” As the words left his mouth, the trial platform began to tremble, and the air distorted as a paper crane materialized! Without the slightest delay, it shot at top speed in the direction of the Beast Conservatory!</p><br/><p>The north bank trail platform was a very famous place in the Spirit Stream Sect. Even the disciples in the south bank had heard of it. According to the rules of the trial platform, anyone could pay some merit points to issue a challenge to anyone else on the north bank. Once they did so, a paper crane would appear, which would fly to notify the other party of the challenge.</p><br/><p>The challenge would remain in effect for half a year. If the challenged party accepted, the fight would begin immediately. If the challenged party won the fight, they got to keep the merit points. If they lost, there was no merit point penalty.</p><br/><p>It was also possible to refuse the challenge. If that happened, then half a year later, the challenge would be nullified, and the merit points would be returned to the challenger. However, during that half year time period, the challenger could not retract the challenge.</p><br/><p>Because of those rules, the challengers ended up being in a very passive position. However, that made things fair.</p><br/>\n</div>"}