{"title": "Chapter 138: Bruisers Hobby....", "id": 138, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-138-bruisers-hobby", "volume_title": "Volume 2", "body": "<h1>Chapter 138: Bruisers Hobby....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Up in midair, the white-robed old man sighed. He knew that this creature would never accept any other master, not for its entire life. Even if someone tried to force it to do so, its dependence on Bai Xiaochun was part of its blood, and would always be a powerful hindrance.</p><br/><p>In this world, it would only have one master, for all eternity... Bai Xiaochun.</p><br/><p>Even if Bai Xiaochun perished one day, the beast would never, ever forget him.</p><br/><p>There was no bonding magic at work; the two of them had a deep relationship that surpassed any such bond. The white-robed old man shook his head and looked deeply at Bai Xiaochun, musing to himself that he deserved to have such a relationship. He had created this battle beast, and during the most dangerous period of its life, had stayed by its side, constantly encouraging it.</p><br/><p>“Perhaps the only thing that could truly move a sixth order bloodline battle beast to accept someone is the kind of pure-hearted sincerity this kid has. He didn’t have any schemes, just a strong desire that the beast keep on living.</p><br/><p>“I hope... that this kid can remain pure-hearted like this for the rest of his life. Hopefully no unexpected event changes that heart of his, years down the line.” The man turned to leave, looking somewhat melancholy as he thought back to how pure and inexperienced he had been when he took his first steps into the world of cultivation.</p><br/><p>Eventually, the crowds began to depart. The female disciples were reluctant to leave; the little beast's wide, charming eyes were completely captivating. However, the beast didn’t spare a single glance for the female disciples.</p><br/><p>The peak lords looked enviously at the newborn little beast, and then reluctantly left. Soon, the Beast Conservatory was quiet. Bai Xiaochun was left alone with the newly born beast and the big black dog, which had also been shoved off to the side by the crowd earlier.</p><br/><p>Bai Xiaochun was grinning from ear to ear as he petted the little creature’s head. It had the body of a horse, the head of a dragon, black reptilian scales, the clawed feet of a pangolin, and even more shocking, its teeth emanated a seven-colored glow.</p><br/><p>As for its solitary horn, it looked just like the Heavenhorn ink dragon’s, long and sharp.</p><br/><p>If you looked closely, you could find things about it that were similar to other animals. Apparently, things had ended up exactly as Bai Xiaochun wanted; the best parts of countless battle beasts had formed together... into a completely unique and unheard-of living being.</p><br/><p>“From now on, you are Bai Xiaochun’s battle beast! Don’t worry, I'm going to take you everywhere in the cultivation world!” Laughing, he petted Bruiser’s head, who lay there next to him, looking up at him with wide, charming eyes.</p><br/><p>The black dog hurried over as well. It always had its guard up, and would never forget its hatred for Bai Xiaochun, but with Bruiser here, its expression was both protective and fearful at the same time.</p><br/><p>Bruiser looked over curiously at the dog, and after a moment, seemed to accept it.</p><br/><p>Time passed. During the following month, Bai Xiaochun frequently took Bruiser out of the Beast Conservatory on walks around the north bank. He would lead the way, and Bruiser would follow along, looking around curiously at his surroundings.</p><br/><p>The black dog would trail behind in secret, watching protectively over Bruiser.</p><br/><p>When passing disciples caught sight of Bai Xiaochun, and then Bruiser, their expression were those of amazement, jealousy, and other mixed emotions. Many of the female disciples were immediately taken in by Bruiser’s charming appearance.</p><br/><p>Bruiser was a little nervous at first, and stuck very closely to Bai Xiaochun, who walked along with his hands clasped proudly behind his back.</p><br/><p>“My little Bruiser is beloved by all,” he thought. “He gets that from me.” Clearing his throat, he took Bruiser to many of the crowded places on the north bank. The eyes of so many disciples on him caused his heart to swell with pride and happiness. Sticking his chin up, he took Bruiser here and there, until he was familiar with the whole north bank.</p><br/><p>Gradually, Bruiser’s fear and nervousness faded away, and he began to frolic along happily when they went on their walks. However, he tried to keep his chin stuck up in the air, apparently in imitation of Bai Xiaochun. Even the look in his eye was one of loftiness and pride. He almost seemed to be showing off, as if he wasn’t afraid of anything in the world as long as Bai Xiaochun was there.</p><br/><p>The sight of it left passing disciples quite shocked. Soon, it became apparent that Bruiser had a strange personality. When he realized people were looking at him, and if he was in a good mood, he would simply start stamping back and forth in irritation. If he was in a bad mood, he would bare his teeth and let out a fierce roar.</p><br/><p>During the month that passed, Bruiser grew relatively slowly. However, in terms of his speed, power, and the strength of his bite, whenever he had a chance to show them off, people were completely shocked.</p><br/><p>Actually, his speed was on equal footing with the black dog, and he was powerful enough to knock the 30-meter-long pangolin from the Beast Conservatory back a few meters. In terms of intelligence, he had already reached a shocking level. He was now as smart as a teenaged human, and in many ways, even smarter than that.</p><br/><p>To Bai Xiaochun’s delight, Bruiser was adept at controlling fire. Furthermore, the flames which emanated from his feet grew more intense, especially when he was moving quickly. The flames were currently black, like the fires of the underworld.</p><br/><p>Because of his fantastic nature, and his charming appearance and wide eyes, even the elders and peak lords doted on Bruiser. They would often send over gifts of spirit medicines and foods suitable for battle beasts.</p><br/><p>However, as Bruiser grew older, Bai Xiaochun discovered something very odd. There was... an eccentric strangeness to his personality....</p><br/><p>Currently, Xu Song was standing on the path up ahead of Bai Xiaochun, looking at Bruiser, who was roaring at him, all the scales on his body standing on end, black flames surging out beneath his feet. Xu Song was shocked; all he had done was look over at Bruiser, who had almost instantly lost his temper and seemed to be on the verge of biting him.</p><br/><p>“Bai Xiaochun,” he said, annoyed, “your battle beast is....” But then he thought about how much the elders and peak lord doted upon Bruiser, and he backed up a few steps. Before he could even finish speaking, Gongsun Wan’er appeared, coming from the other direction. Bruiser, who had just been baring his fangs and brandishing his claws, looked over at Gongsun Wan’er, and his eyes glittered. Looking more charming than ever, he eagerly rushed over toward her.</p><br/><p>He began to follow alongside her as she walked, yipping meekly and wagging his tail like a dog. When he brushed up against her leg, she smiled, then knelt down and picked him up in her arms. Bruiser’s eyes shone brightly as he buried himself in Gongsun Wan’er’s chest and wriggled around back and forth. Gongsun Wan’er laughed, and from the expression on Bruiser’s little face, he was clearly enjoying himself.</p><br/><p>Xu Song’s eyes went wide, and Bai Xiaochun chuckled wryly. During the past half month or so, he had noticed that Bruiser would always bare his fangs at the male disciples, seemingly ready to bite them without hesitation if they touched him. However, when it came to the female disciples, he would always act very charming and couldn’t wait to be held in their embrace.</p><br/><p>Bai Xiaochun wasn’t sure why this was, and could only attribute it to Bruiser’s bloodline. The only explanation that made sense was that he had inherited this hobby somehow.</p><br/><p>This behavior only continued to intensify, to the point where it was a bit preposterous. Bruiser would treat the male and female disciples completely differently. The male disciples were left speechless, and many of them even began to envy Bruiser. As for the female disciples, he had already rubbed up against more than half of them....</p><br/><p>If that were all there were to the matter, it might not have been a big deal. But soon, Bai Xiaochun went into secluded meditation to break through to the great circle of the tenth level of Qi Condensation. During that time, Bruiser’s hobbies changed. The black dog would often take it to the places on the north bank where the female disciples would bathe, and they would look on in secret.</p><br/><p>The black dog only found it mildly interesting, but Bruiser quickly grew addicted. Eventually, he became familiar with the bathing routines of the female disciples, and would excitedly rush out of the Beast Conservatory in the morning, and wouldn’t return until the sky was dark.</p><br/><p>It was hard to say how many female disciples he could see bathing during a full day....</p><br/><p>Of course, Bai Xiaochun was focused on his secluded meditation, and the advancement of his cultivation base, so he didn’t pay much attention to what was happening.</p><br/><p><span>Another month passed, and Bruiser’s habits changed yet again. In addition to being held in the close embrace of the female disciples, and secretly watching them bathe, he developed a new taste.... When watching the female disciples bathe, he would secretly take away their bras... and then hide them in a safe location. </span><span id=\"footnote-ref-668a\">[1]</span></p><br/><p>Eventually, the female disciples realized that a lot of their bras were going missing, and it reached the point where virtually all of them had experienced such a thing.</p><br/><p>Of course, Bruiser was very fast, and the black dog was also there to keep watch. Therefore, during its month of bra-stealing activities, not a single clue was left behind. Considering how cute Bruiser was, not a single female disciple ever suspected him.</p><br/><p>“A sex maniac has appeared on the north bank! He specializes in stealing the female disciples’ bras!!”</p><br/><p>“Dammit! It’s definitely some sex fiend. Junior Sister Sun has already lost ten bras!!”</p><br/><p>“I already did some looking into the matter, and according to my calculations, several thousand bras have already gone missing. This person really has some unique taste. He isn’t destroying them, he's collecting them! Find him! We definitely have to find him!”</p><br/><p>The situation with the missing bras got worse and worse. Eventually, the female disciples joined forces in their anger, and began to scour the entire north bank for clues. They even got assistance from the battle squirrel of one of the elders from Archway Peak, who was adept at performing searches. The entire north bank was under intense scrutiny, and even many male disciples joined the effort, filled with righteous indignation.</p><br/><p>They searched all four mountain peaks, as well as many other locations. Eventually, someone suggested going to the Beast Conservatory.</p><br/><p>Before long, a horde of disciples was making their way in that very direction.</p><br/><p>Meanwhile, Bai Xiaochun was in the honor guard station, fully focused on his meditation, reveling in the wonderful feeling of his cultivation base rising.</p><div id=\"footnote-668a\"><br/><p>1. 1. The undergarment referred to here is a \"dudou,\" a traditional Chinese bra that more resembles a bodice than a modern bra <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}