{"title": "Chapter 144: Lord Bai Is Gonna Fight You To The Death", "id": 144, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-144-lord-bai-is-gonna-fight-you-to-the-death", "volume_title": "Volume 2", "body": "<h1>Chapter 144: Lord Bai Is Gonna Fight You To The Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There was no way to ensure that you wouldn’t be ambushed after entering. One could only rely on one’s skills and abilities to stay safe. Jade slips could not be used to send messages to those on the outside either. However, if several people from one sect all entered at the same time, they would be safe from anything except a brutal, large-scale ambush.</p><br/><p>After four disciples entered the opening, Hou Yunfei chose to go in. Just before stepping inside, he asked a favor of Bai Xiaochun.</p><br/><p>“If anything unexpected happens to me inside, please take care of my clan Junior Brother, Hou Yunqing.” Hou Yunqing was one of the most important younger clan members, although he wasn’t a member of the Spirit Stream Sect, but rather, had stayed in the clan to further his cultivation.</p><br/><p>Bai Xiaochun quickly comforted Hou Yunfei and told him not to be so depressing. Then he furtively handed him a paper talisman. Hou Yunfei was initially startled, but after looking at the talisman for a moment, was quite moved. With a final nod to Bai Xiaochun, he stepped into the entrance.</p><br/><p>As soon as he disappeared, the gap went dark, indicating that it was no longer possible to use it as an entrance. Bai Xiaochun was a bit worried about Hou Yunfei, but considering the entrance had closed, there was little more to be done. With that, he led the group onward.</p><br/><p>They proceeded along for the time it takes an incense stick to burn, chatting and laughing about Bai Xiaochun’s antics on the south bank. They also talked about their hopes and ambitions for the future. When Bai Xiaochun slapped his chest and told them that his dream was to live forever, they all chuckled. Zhou Youdao loudly declared that his dream was to become a patriarch of the Spirit Stream Sect.</p><br/><p>They were on the brutal and deadly path to Foundation Establishment, but as of this moment, they were able to relax slightly. With Bai Xiaochun in the lead, they didn’t suffer any setbacks. Any gap they caught sight of was quickly taken over.</p><br/><p>“Get him, boys!” Bai Xiaochun would cry.</p><br/><p>“Hey, this place belongs to us!”</p><br/><p>“Buzz off, this place is ours!”</p><br/><p>“Well, what’s this? How dare you glare at me? Get him, boys!”</p><br/><p>Booms rang out constantly. At the same time, the number of Spirit Stream Sect disciples grew smaller and smaller. Every time one of them entered one of the gaps, they would express deep gratitude toward Bai Xiaochun. At the same time, the fact that the disciples would leap into action at the simple wave of his hand left Bai Xiaochun feeling very moved.</p><br/><p>“So, this is what it feels like to be Chosen. No wonder so many people want to be one.” Even as he sighed about the matter, they approached another area with gaps in the sword. Unexpectedly, there was a large group of people fighting each other in the area. Even more shocking, there were a total of three gaps visible, and six powerful Blood Stream Sect disciples were holding them against nine disciples from the other two sects.</p><br/><p>At the moment, the fighting had reached a deadlock. When Bai Xiaochun saw what was happening, his eyes glittered, and the remaining dozen or so Spirit Stream Sect disciples behind him all started to get excited. Without any further hesitation, Bai Xiaochun shouted, “Hey, this place belongs to us!”</p><br/><p>The Blood Stream Sect disciples had been carrying out a mission for their sect to guard this location for as long as they could. They were already exhausted, so when they saw so many people from the Spirit Stream Sect arriving, their expressions flickered, and yet they didn’t flee. Instead, they vanished into the gaps.</p><br/><p>The surrounding disciples from the Pill Stream Sect and the Profound Stream Sect were just about to charge into the entrances when they were bombarded by magical techniques and divine abilities, shoving them back. A moment later, Bai Xiaochun and the other Spirit Stream Sect disciples were blocking the way.</p><br/><p>Aware that they had the advantage of numbers, Bai Xiaochun proudly said, “Humph! Be good little disciples and buzz off! Lord Bai is in a good mood today, so he won’t cause you any further trouble!”</p><br/><p>The faces of the disciples from the other sects twitched.</p><br/><p>“It’s him again!!”</p><br/><p>“His name is Bai Xiaochun. What a villain! This is the third time he’s snatched an entrance from me!”</p><br/><p>“Dammit! This is the second time for me. If it weren’t for him, I’d already be in the world of the sword!”</p><br/><p>Because the group consisted of people from different sects, they were reluctant to join forces. Besides, even if they did, they would still be outnumbered by the Spirit Stream Sect. Eyes blazing with rage and helplessness, they watched as the Spirit Stream Sect disciples vanished into the three gaps.</p><br/><p>Feeling very pleased, Bai Xiaochun watched five disciples enter the first gap before it went dark. Three people vanished into the second gap. As far as he was concerned, he was performing a great service for the sect.</p><br/><p>As of this point, his mission was accomplished. Clearing his throat, he joined the final five Spirit Stream Sect disciples as they approached the third entrance. The surrounding disciples from the Pill Stream Sect and the Profound Stream Sect looked on, aware that by this point, it was too late to do anything about the situation.</p><br/><p>Besides, even if the gap didn’t go dark after the Spirit Stream Sect entered, they still wouldn’t dare to enter for fear of an ambush on the other side.</p><br/><p>Just as they were about to depart to look for another gap, their eyes widened, and their jaws dropped in shock. Then, cold, murderous smiles appeared on their faces.</p><br/><p>Just now, when the fifth Spirit Stream Sect disciple entered the passageway, and Bai Xiaochun attempted to step in... it went dark.</p><br/><p>“No way!!” Bai Xiaochun said, astonished. As he was shoved roughly out of the entrance, he swallowed and looked over his shoulder. There stood the group of disciples from the other sects, eyes flashing menacingly as they slowly walked toward him.</p><br/><p>Each and every one was in the great circle of the tenth level of Qi Condensation, and in their own sects, they were Chosen who everyone looked up to. Although they weren’t the type who other disciples despaired of ever surpassing, they were still far beyond ordinary in terms of their natural talent.</p><br/><p>“Why don’t you go in, Bai Xiaochun? Hurry up, step into the entrance.”</p><br/><p>“Yeah. If you don’t, we’ll help you. Maybe if we cut you into pieces, then you’ll fit in.”</p><br/><p>“Hahaha! You’re finally gonna get what you paid for. You and your gang robbed me of three entrances. Now what are you gonna do?!” Cold laughter and murderous auras spread out to fill the area. By this point, Bai Xiaochun was a common enemy that all the disciples hated.</p><br/><p>He took a deep breath, and as the group prepared to attack, he smacked his bag of holding, producing a fistful of paper talismans which he slapped down all over himself. Instantly, blinding light radiated out as Bai Xiaochun created a 60-meter-wide world of brightness!</p><br/><p>The popping sounds of shields being summoned turned into a deafening cacophony that filled the entire area.</p><br/><p>The other disciples’ eyes went wide, and their minds reeled. They almost couldn’t believe what they were seeing. Bright, multicolored light filled a 60-meter-wide area as more than a hundred shields appeared. All of the disciples’ scalps were tingling in shock; this was something the likes of which they had never seen in their entire young lives.</p><br/><p>“How... how many talisman shields is that?”</p><br/><p>“Heavens! How rich is this guy? Dammit! Even if we had ten times as many people here, we wouldn’t be able to break through those shields!” Trembling on the verge of madness, the disciples stared at Bai Xiaochun with increasing astonishment.</p><br/><p>As for Bai Xiaochun, he stood there, chest puffed out, hands clasped behind his back, chin stuck up, expression somewhat melancholy, like a lonely hero....</p><br/><p>“Very well, you bunch of bullies, bring it on!” he said loudly. “Lord Bai is gonna fight you to the death!” From his tone of voice, it really seemed like he was ready to fight to the death.</p><br/><p>Even as the words left his mouth, the Protomagnetic Wings popped out of the big black wok on his back, and he blurred into motion, slamming into the closest disciple, a long-faced young man from the Profound Stream Sect.</p><br/><p>More precisely, Bai Xiaochun didn't slam into the young man; his shields did. A full 60 meters away from Bai Xiaochun, a miserable shriek echoed out, and the young man was sent flying backward for some distance before he managed to grind to a halt. Wiping the blood from his mouth, he looked over at Bai Xiaochun’s shields, then sighed and left sullenly.</p><br/><p>There was really no other option... even he knew that he couldn't single-handedly break through Bai Xiaochun’s shields. Draining his energy in such a way would be pointless, and would only delay his ability to enter the world of the sword.</p><br/><p>Everyone else was completely shaken by what they saw. Feeling completely helpless when it came to Bai Xiaochun, they began to disperse, fleeing in every direction at top speed.</p><br/><p>Considering that there wasn’t even an entrance to struggle over, none of them were inclined to fight Bai Xiaochun to the death.</p><br/><p>“Hey, don’t run! I'm ready to fight till the bitter end! You bunch of bullies! Get back here!” Bai Xiaochun continued to call out at the top of his lungs, but it only caused the other disciples to move more quickly.</p><br/><p>Soon, Bai Xiaochun was alone, standing there blinking. Although surviving the combined attack of the enemy disciples had wasted some time, staying on track toward Earthstring Foundation Establishment was the most important thing.</p><br/><p>With that, he began to pull the paper talismans off and put them back into his bag of holding. Most of them had only burned through half of their charge, and thus, could still be used later.</p><br/><p>Bai Xiaochun stuck his chin up and swished his sleeve like a lonely hero.</p><br/><p>“Bai Xiaochun is not to be trifled with!”</p><br/><p>With that, he flickered into motion, making his way down through the cracks and crevices as he tried to find another gap leading into the huge sword.</p><br/><p>Of course, when it came to entering the sword world earlier or later, there were pros and cons to both.</p><br/><p>Those who entered sooner would be able to start killing the earthstring banebeasts sooner, and begin collecting the earthstring energy. However, those people would find themselves higher up in the world of the sword, where the banebeasts didn’t have much earthstring energy in them. The banebeasts further down in the world of the sword could have ten times as much earthstring energy or even more.</p><br/><p>It required a large collection of earthstring energy to form the earthstring capture crystal.</p><br/><p>Another thing to consider was that the world of the sword was enormous, and also contained banesouls. Because banesouls had to be avoided, it was actually possible to proceed downward with greater speed if one was outside the sword.</p><br/><p>The downside to being outside of the sword was that the cold became increasingly intense the further down you went. Eventually, it became so cold that Qi Condensation disciples couldn’t survive. At a certain point, there was no other option than to enter the world of the sword, for one’s own safety. In the end, the decision of when exactly to enter the sword was up to each individual's power and strength, and their own determination of what was best for them.</p><br/><p>Bai Xiaochun already had a rather high level of cold resistance, and now that he thought about it, it made sense to go down as far as he could before choosing an entrance. That would actually put him ahead of many of the people who were already in the sword.</p><br/><p>Time passed. Bai Xiaochun moved at top speed, almost a blur. He wasn’t even aware of it, but he had already passed almost all of the other Qi Condensation disciples who had already entered the sword. The cold grew more and more intense, until he was starting to get stiff. Eventually, he reached the point where going too much further might end up injuring him.</p><br/><p>He took a deep breath as he looked down into the pitch black below.</p><br/><p>“I think I can go another 300 meters....” He tried to use some paper talismans to stave off the cold, but they did little good. Shaking his head, he started looking around for a gap. All of a sudden, he noticed a spot roughly 90 meters down, where a young man was standing next to the body of the sword.</p><br/><p>As soon as the young man sensed Bai Xiaochun, he looked over, and their gazes locked. Bai Xiaochun immediately recognized who this cold and vicious young man was.</p><br/><p>“Blood Stream Sect. Song Que!”</p><br/><p>“Spirit Stream Sect. Bai Xiaochun!”</p><br/>\n</div>"}