{"title": "Chapter 149: Whether Sect Uncle Bai Wants It To Or Not", "id": 149, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-149-whether-sect-uncle-bai-wants-it-to-or-not", "volume_title": "Volume 2", "body": "<h1>Chapter 149: Whether Sect Uncle Bai Wants It To Or Not</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“That’s not a banesoul, that’s an evil ghost!” Heart pounding with fear, Bai Xiaochun fled at top speed. Moments ago, when his gaze met the young girl’s, he had instantly been filled with a sensation of deadly crisis. The feeling had been so intense that it felt like every inch of his flesh and every drop of his blood was screaming in terror.</p><br/><p>He was filled with the premonition that if he ran any slower, he would die!</p><br/><p>That deathly feeling left him shaking visibly, panting, his eyes bloodshot as he pushed forward faster and faster, flying ever deeper into the depths of the Fallen Sword World.</p><br/><p>The next day, he looked over his shoulder to confirm that he wasn’t being chased by any banesouls, especially the little girl. When he saw that he was alone, he let out a long sigh of relief. However, fear still lingered in his heart regarding the events of the previous day.</p><br/><p>“Something was really fishy about that girl in the white dress!” he thought, scowling miserably. “At first she looked like all the other banesouls, but after she ate that mystery pill, her aura completely changed! Just where exactly did I go wrong with that batch of pills?”</p><br/><p>He thought about giving up on the idea, but the truth was that his medicinal pill had attracted the banebeasts. In the end, he couldn’t just give up that easily. Gritting his teeth, he went out to find more banebeasts to research. At the same time, he studied the medicine formula he had used. Three days later, after making some adjustments, he steeled himself and once again pulled out a pill furnace to start concocting.</p><br/><p>This time, there wasn’t any thunder, nor any other strange signs. Four violet medicinal pills appeared, which he carefully took outside to test, preparing ahead of time for what to do if banesouls showed up.</p><br/><p>Soon, ripples filled the area as one banebeast after another appeared. However, Bai Xiaochun didn't dare to make a move on them. He flew away at top speed, and then studied the area carefully.</p><br/><p>Before long, the medicinal pill had attracted over twenty banebeasts, and not a single banesoul had appeared. Finally, Bai Xiaochun breathed a sigh of relief, and even started to get excited.</p><br/><p>“It worked!” he exclaimed, laughing loudly. As he removed the paper talismans he had stuck all over himself, the glow of the shields faded, and he hurried over to the banebeasts. Soon, his wooden sword transformed into flashing beams of light as the fighting began.</p><br/><p>One banebeast after another fell in death, and Bai Xiaochun’s eyes shone with wild delight as the streams of earthstring energy flew into his Dao bottle.</p><br/><p>After slaughtering the entire group, he looked in satisfaction at the gray liquid inside the bottle. In a very short moment, he had added more liquid into the bottle than he had in the past several days.</p><br/><p>Taking a deep breath, he headed to another area. There, he threw out another medicinal pill and sure enough, banebeasts began to flock to the area. Laughing heartily, Bai Xiaochun immediately began to cut them down.</p><br/><p>Time passed. Because of the medicinal pills, the gray liquid in Bai Xiaochun’s Dao bottle continued to build up at a shocking rate. Now he was collecting earthstring energy far more quickly than anyone else. A few days later, it had been a full month since Bai Xiaochun entered the Fallen Sword World. As for his Dao bottle, it was now eighty percent full of earthstring energy.</p><br/><p>“Only twenty percent to go!” he thought, more excited than ever. He wasn’t sure how others were faring in their collection efforts, but he doubted many of them had surpassed him.</p><br/><p>However, being the perfectionist that he was, he decided that the best thing would be to fill ten percent in a single shot!</p><br/><p>“I need more banebeasts!” Licking his lips, he headed further down into the Fallen Sword World until he found a wide-open plain. There, he took a deep breath and then pulled out two medicinal pills. Hoping to attract even more banebeasts than before, he crushed the pills and then scattered them around.</p><br/><p>It didn't take long before the air rippled as numerous banebeasts appeared. Bai Xiaochun immediately began to attack them, causing rumbling booms to fill the area. Every banebeast he slew caused earthstring energy to stream into his Dao bottle.</p><br/><p>Because of how he had crushed the pills, and also because of the favorable position he had chosen, which was close to the deepest parts of the Fallen Sword World, there were plenty of slumbering banebeasts in the area.</p><br/><p>Soon, it wasn’t a group of dozens that was converging on the area, it was closer to a hundred. Almost all of them were mid-level, with a few here and there that were high-level, the type that would normally require an entire group of Chosen to take down.</p><br/><p>Bai Xiaochun’s speed in killing the banebeasts couldn’t match the speed with which new ones appeared on the scene. Soon, there were two hundred gathered in the area, and their numbers only continued to grow. Any cultivator who managed to catch sight of such a huge number of banebeasts would go wild with joy.</p><br/><p>In fact, some of the disciples of the four sects did notice what was happening, and gathered on the periphery to snag whatever beasts they could. One of them was a young man who attacked with utter ruthlessness, and immediately caused quite a stir among the nearby Pill Stream Sect disciples. Eventually, Bai Xiaochun noticed him, and recognized him as the number one Chosen from the Pill Stream Sect, Fang Lin!</p><br/><p>Bai Xiaochun wasn’t too happy that he had drawn all these banebeasts here only to have other people slaughter and take them. However, considering that he couldn’t even keep up with the growing numbers, he simply gave a cold harrumph and then ignored them.</p><br/><p>Gradually, a group of over forty cultivators had gathered in the area. It was only at that point that they managed to get on equal footing with the banebeasts. Elated, they began to join forces to make things go even faster.</p><br/><p>That was especially true of some of the Spirit Stream Sect disciples. When they got close to Bai Xiaochun, he made sure to take care of them, ensuring that their harvest was even greater than before.</p><br/><p>Bai Xiaochun excitedly watched the earthstring liquid building up in his Dao bottle. Soon, it was ninety percent full. However, it was at that exact moment that more than ten beams of light suddenly appeared up in the air.</p><br/><p>They wore matching robes, those of the Profound Stream Sect, and leading them was a burly man surrounded by swirling electricity.</p><br/><p>The surrounding disciples’ faces flickered, except for Fang Lin’s. He simply continued to slaughter the banebeasts, not even bothering to look over.</p><br/><p>“Lei Shan!”</p><br/><p>“The number two Chosen of the Profound Stream Sect! Dammit! If he came by himself it might not be a big deal, but look at how many people he has with him!”</p><br/><p>Even as everyone looked on with mixed expressions, Lei Shan glanced out over all the banebeasts, and his eyes lit up with joy. He’d heard from some fellow Profound Stream Sect disciples that a strange tide of banebeasts had appeared, which was why he had hurried over in this direction.</p><br/><p>“Only forty percent of my bottle is empty. When it’s full, I can form the earthstring capture crystal. I can probably do that by killing all of these banebeasts here!” Lei Shan threw his head back and laughed uproariously. When the Profound Stream Sect disciples at his side realized what he intended to do, one of them, a long-faced young man, chuckled darkly and stepped forward.</p><br/><p>“Listen up!” he bellowed to the disciples in the area. “If you’re not from the Profound Stream Sect, beat it immediately! This place is our territory now!” The disciples from the other three sects bristled with rage, while the Profound Stream Sect disciples began to laugh as they joined Lei Shan’s group. By that point, they were roughly thirty strong.</p><br/><p>Under Lei Shan’s leadership, the group of thirty prepared drive everyone away, and fight with deadly force against any who resisted. Chaos quickly ensued.</p><br/><p>“You have ten breaths of time of time to get the hell out of here, and leave your Dao bottles behind!”</p><br/><p>“If you don’t want to go, then be prepared to lose your life!” As the Profound Stream Sect disciples glared around them, the Blood Stream Sect disciples exchanged glances and then began to fall back.</p><br/><p>Most of the Blood Stream Sect were on their own, like lone wolves, and didn’t want to provoke Lei Shan.</p><br/><p>The Pill Stream Sect disciples were at a bit of a loss, and had no other choice than to fall back. Lei Shan hesitated for a moment when he realized that Fang Lin was in the crowd. He still suspected that the terrifying magical massacre which had been carried out a month before had been enacted by Fang Lin, and thus, didn’t wish to provoke him.</p><br/><p>Because of the terrifying nature of the battlefield he had come across, he decided to simply let the Pill Stream Sect disciples leave. As for Fang Lin, he resolved not to do anything to offend him personally.</p><br/><p>As the Blood Stream Sect and Pill Stream Sect disciples fled, the Spirit Stream Sect disciples turned to see what Bai Xiaochun would do.</p><br/><p>Bai Xiaochun was incensed, but the group led by Lei Shan was simply too large. He only had about ten people on his side, and if they got into a fight, he knew that while he might be able to make it out unscathed, they would have a harder time. There would likely be many serious injuries and even deaths.</p><br/><p>“Alright, let’s go,” he said. “It's just a flood of beasts, after all. Your Sect Uncle will go start another one for you!” Gritting his teeth, he was just about to leave when Lei Shan looked over and suddenly laughed.</p><br/><p>The Blood Stream Sect disciples were ferocious, and he didn't have any wish to tangle with them. As for Fang Lin from the Pill Stream Sect, he also preferred to steer clear of him. But when it came to the Spirit Stream Sect, once he realized it was Bai Xiaochun he was dealing with, as well as a few ordinary disciples, he recalled the information from his sect about Bai Xiaochun, and his expression became one of derision.</p><br/><p>“You people from the Spirit Stream Sect can leave,” he said, his eyes flickering with killing intent, “but your Dao bottles stay behind! Comply, or don't even think about leaving!” The Spirit Stream Sect disciples’ faces fell, and Bai Xiaochun’s anger grew.</p><br/><p>“You wanna steal my animals and then rob my Dao bottle? You people are nothing but bullies!”</p><br/><p>With a cold snort, Lei Shan began to fly toward the Spirit Stream Sect disciples, joined by the rest of the Profound Stream Sect, who were cackling viciously. “If you're being bullied, you should blame the fact that you don't have any powerful experts on your side!”</p><br/><p>“Sect Uncle Bai!”</p><br/><p>“Sect Uncle Bai, what do we do now?!” The Spirit Stream Sect disciples were trembling in anxiety, and Bai Xiaochun’s eyes were completely bloodshot. Suddenly, he lifted his right hand, within which could be seen a black medicinal pill, the very same pill which could attract banesouls.</p><br/><p>Expression somber, eyes bloodshot, he turned to the Spirit Stream Sect disciples and said, “Just wait until I throw out this medicinal pill, and then you guys--”</p><br/><p>However, before he could finish speaking, the surrounding Spirit Stream Sect disciples gasped, the terror on their faces vastly exceeding their terror at seeing the Profound Stream Sect closing in. They immediately began to flee at top speed.</p><br/><p>“Is that the legendary Aphrodisiac Pill!?”</p><br/><p>“Heavens! No wonder he can control the banebeasts!”</p><br/><p>“Sect Uncle Bai is a god! The only thing that determines whether that pill works on the banebeasts is whether Sect Uncle Bai wants it to or not! Let’s get out of here! If we're too slow, we’re dead!”</p><br/>\n</div>"}