{"title": "Chapter 154: Striving for a Great Dao!", "id": 154, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-154-striving-for-a-great-dao", "volume_title": "Volume 2", "body": "<h1>Chapter 154: Striving for a Great Dao!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There were few limitations when it came to the techniques which could be used to create a Tideflow. In all the years which had passed since ancient times, only three rules had come to be identified in that regard. The first rule was that the techniques used for the Tideflow had to be completely mastered down to the tiniest detail. Without that level of success, the Tideflow would be a failure.</p><br/><p>It wasn’t easy to master a technique to that level; it required a significant expenditure of both physical resources and mental energy.</p><br/><p>The second rule was that with every Tideflow, only one technique of any given level of power could be used effectively. Adding in extra techniques would not help successfully achieve the Tideflow.</p><br/><p>The third rule was that each successive Tideflow was more difficult, and the requirements for success were thus more stringent.</p><br/><p>In most sects, there were few techniques that could propel a disciple past the fifth Tideflow and into the sixth. Such techniques were essentially secret magics, and the foundation of the true power of the sect.</p><br/><p>Therefore, the real test was how the sect distributed its techniques, and how deep their resources went. For example, in the Spirit Stream Sect, the south bank’s Violet Qi Cauldron Control Art and the north bank’s Heavenspan Elephant Control Art had to be cultivated to the point of mastering Violet Qi Cauldron Summoning or the Heavenspan Elephant Body respectively, otherwise only the first Tideflow would be successful.</p><br/><p>Only Violet Qi Cauldron Summoning and the Heavenspan Elephant Body would suffice for the second Tideflow. At the same time, because Violet Cauldron Peak on the south bank and Sunset Peak on the north bank were the home to those two techniques, as long as disciples from there had other powerful techniques to call upon, they could reach the third through fifth Tideflows. However, after that point, it would be easier to find a phoenix feather or a qilin horn than to find ordinary techniques which could help. At that point, only secret magics could be called upon.</p><br/><p>As for the disciples from the other mountain peaks, after reaching the eighth level of Qi Condensation and joining the Inner Sect, they would have access to a second, more powerful technique that they could use to prepare for further Tideflows.</p><br/><p>Whichever technique the disciple chose to branch out into was extremely important, and was one of the key factors determining how many Tideflows they could achieve.</p><br/><p>Generally speaking, the very minimum was two Tideflows, although three was also possible. Depending on the circumstances, four wasn’t out of the question.</p><br/><p>Even the weakest of disciples were usually able to reach three Tideflows during Earthstring Foundation Establishment. In some extreme circumstances, some powerful disciples would reach six. However, from ancient times until the present, only nine disciples from the Spirit Stream Sect had ever reached six tideflows by cultivating a second technique. Of course, those nine disciples all went on to be unique and stunning figures during their time.</p><br/><p>Unfortunately, after cultivating that second technique, there was nothing else that could be used for further Tideflows. Only secret magics could be used, which was how the ten great secret magics of the Spirit Stream Sect came to be.</p><br/><p>The ten secret magics could be used for the fifth Tideflow on. There were even some secret magics, such as Ghosts Haunt the Night and the Waterswamp Kingdom, which on rare occasions could actually form more than one Tideflow.</p><br/><p>As a result, Spirit Stream Sect disciples with outstanding latent talent all had the chance to reach eight Tideflows! Even the weakest disciples could get four!</p><br/><p>That showed the power and resources of the Spirit Stream Sect! Of course, the other three sects were similar. In the end, the true question was which of the disciples of the various generations would be able to reach the absolute pinnacle.</p><br/><p>As for nine Tideflows, that was the legendary peak of Earthstring Foundation Establishment. Among all of the Four Great Sects, there had only been one person in the last 10,000 years who had done such a thing.</p><br/><p>That person was Master Limitless from the Blood Stream Sect, who succeeded 800 years ago.</p><br/><p>The peak of Earthstring Foundation Establishment was a realm of incredible power that was incredibly difficult to reach, but not impossible. Although Heavenstring Foundation Establishment surpassed Earthstring Foundation Establishment, it was something that could only be acquired by random chance and luck. No path existed which could be followed to that end.</p><br/><p>Bai Xiaochun took a deep breath, and his eyes shone with bright light. He had studied up on the Tideflows already, and could sense that the sea of mist had collapsed and formed his first spiritual sea. If he wanted to, he could abandon further Tideflows, and instantly end his Earthstring Foundation Establishment as a success.</p><br/><p>He would get his 200 years of longevity, but unfortunately, would be incredibly weak among Earthstring Foundation Establishment cultivators. Bai Xiaochun had no desire whatsoever to be weak. In the cultivation world, the law of the jungle prevailed. Regardless of whether or not he liked it, he knew that it was unavoidable.</p><br/><p>He didn’t like fighting and killing, but sometimes, there was no other option!</p><br/><p>“Because I mastered the Violet Qi Cauldron Summoning of the Violet Qi Cauldron Control Art, I can use that for my second Tideflow!” Bai Xiaochun took a deep breath, and suddenly, his spiritual sea began to rotate rapidly. The surrounding earthstring energy instantly began to rumble in his direction once again, shaking everything around him as a second whirlpool formed inside of him.</p><br/><p>The lake up above crashed and seethed as a second vortex appeared up above. It was merely an outline at first, but it was clearly larger than the first vortex, ensuring that numerous disciples looked up to watch.</p><br/><p>“The second Tideflow. Presumably, all of the people here should be able to reach at least three or four Tideflows. Each one will be bigger than the one before, and will require even more earthstring energy!”</p><br/><p>“Dammit! This guy is reaching Foundation Establishment too quickly. That means there’s going to be less earthstring energy, maybe not even enough for me to reach Foundation Establishment!”</p><br/><p>Even as everyone else in the Fallen Sword World grew more and more anxious, another massive rumbling sound echoed out from another direction. There, in the middle of a distant mountain range, another tornado rose up into the sky to connect with the heavens. Another vortex was forming!</p><br/><p>As the vortex expanded, the earthstring energy in the world began to rush toward it. Now Bai Xiaochun was sharing the earthstring energy with a second person.</p><br/><p>In that distant mountain range was an immortal's cave, where Fang Lin sat, an expression of extreme focus on his face.</p><br/><p>Everyone was shocked by this new development. None of them could ever have imagined that a second person would begin a Tideflow within only two hours or so of the first.</p><br/><p>Bloodshot eyes could be seen as everyone began to fight even more fiercely for earthstring energy.</p><br/><p>It wasn’t that none of them had considered trying to kill the two who were in the middle of Foundation Establishment; at the moment, the others hadn’t reached a state of despair, and simply didn’t want to waste time on such an effort.</p><br/><p>Two hours later, powerful rumbling sounds echoed out from Fang Lin’s region as his first Tideflow ended, and the second began. Another two hours after that, the lake above Bai Xiaochun exploded as his second Tideflow ended.</p><br/><p>As that happened, a second spiritual sea appeared above the first one, and his energy skyrocketed, making him like a burning fire on a dark night.</p><br/><p>He took a deep breath as he realized that he had reached the limits of the Violet Qi Cauldron Control Art; it would not be enough for a third Tideflow. Closing his eyes, he cast his senses inward, and saw a towering violet cauldron within each of his two spiritual seas. Both of them emanated powerful pressure.</p><br/><p>“For my third Tideflow, I’ll have to use the Dragon Mammoth Sea-Forming Scripture!” His eyes flickered as the roars of a dragon and a mammoth could be heard echoing out from the lake to fill the area. His third Tideflow had begun!</p><br/><p>A third whirlpool appeared inside of him, which exerted even stronger force than the first two. As that force spread out into the world, massive amounts of earthstring energy were sucked toward him.</p><br/><p>Gradually, a third vortex appeared in the sky, within which a swirling dragon could be seen. When the disciples in the other parts of the world looked over, they instantly caught sight of the dragon.</p><br/><p>“What technique is that?”</p><br/><p>“That's the Dragon Mammoth Sea-Forming Scripture! The first person to reach Foundation Establishment is from the Spirit Stream Sect!!”</p><br/><p>“Heavens! I can’t believe it’s the Spirit Stream Sect. Who is it? Ghostfang maybe? Shangguan Tianyou?”</p><br/><p>“Is it Bai Xiaochun?” The disciples from all four of the sects were shocked, but among the Spirit Stream Sect disciples, there was a stir of excitement.</p><br/><p>Shangguan Tianyou looked up with bloodshot eyes and let out a maddened roar as he stared at the huge dragon in the vortex connecting to the heavens. “That’s not Ghostfang. It's Bai Xiaochun!!”</p><br/><p>Gnashing his teeth, he turned to find more enemy disciples to slaughter.</p><br/><p>Another two hours passed, and Fang Lin finished his second Tideflow. Another vortex appeared above him, within which was a huge cauldron. It was bronze, and covered with carvings of suns, moons, and stars. It seemed profoundly ancient, as if it were capable of melting all of heaven and earth.</p><br/><p>It was none other than the Heaven-Earth Furnace Cauldron!</p><br/><p>As soon as the cauldron became visible, everyone knew who it was that had reached Foundation Establishment second.</p><br/><p>“It’s Fang Lin from the Pill Stream Sect!!”</p><br/><p>It was at that very moment that a third tornado suddenly shot up into the sky to connect to the heavens.</p><br/><p>A third person was reaching Foundation Establishment!</p><br/><p>Almost immediately, the vortex turned the color of blood. From the look of things, it had to be Song Que!</p><br/><p>“Heavens! Song Que from the Blood Stream Sect!!”</p><br/><p>“He can kill Foundation Establishment cultivators, and is the first person to provoke a strange sign with his first Tideflow. I heard that Master Limitless did the same thing 800 years ago!”</p><br/><p>“Maybe Song Que is going to follow the example of Master Limitless, and reach the peak of Earthstring Foundation Establishment, nine Tideflows!”</p><br/><p>Now, three vortexes were vying for the earthstring energy, sending it surging in three different directions. But then... a fourth tornado sprang up in the depths of the Fallen Sword World.</p><br/>\n</div>"}