{"title": "Chapter 164: So What!?", "id": 164, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-164-so-what", "volume_title": "Volume 2", "body": "<h1>Chapter 164: So What!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun had tangled with the Blood Stream Sect before, and even back then, he could tell that their magical techniques were like the name of their sect: something akin to a devilish Dao. Assuming that the Spirit Stream Sect’s information about the Blood Stream Sect was correct and not an exaggeration, then their magical techniques really were bizarre to the extreme!</p><br/><p>Whether it was the huge hand that appeared behind the body refinement cultivator, which Bai Xiaochun found so strangely familiar, or the gargoyles, or the corpse-refining magic of Xu Xiaoshan, all of them seemed to abound with intensely murderous auras.</p><br/><p>As Xu Xiaoshan closed in, he waved his finger at Bai Xiaochun, and the nine black-haired zombies shot toward Bai Xiaochun like nine meteors.</p><br/><p>The aura of death they exuded rose high into the air, and they let out piercing cries that locked down the entire area around Bai Xiaochun.</p><br/><p>Bai Xiaochun's eyes glittered as he sprang into motion, golden light shining around him. His two fingers flickered like lightning as they shot out and crushed down onto the neck of one of the black-haired zombies.</p><br/><p>A cracking sound could be heard, and the zombie’s head tilted to the side, but it wasn’t dead. It punched out at Bai Xiaochun, who leapt to the side, hair flying around him as he shoved out with his palm.</p><br/><p>That motion was backed by the explosive power of nine Tideflows, creating a gale-force wind that swept out in all directions. The power of the dragon and mammoth also appeared, becoming a powerful attack which shoved all of the black-haired zombies away. Then, Bai Xiaochun launched himself toward Xu Xiaoshan.</p><br/><p>Xu Xiaoshan’s pupils constricted as Bai Xiaochun unleashed a fist strike.</p><br/><p>A boom rang out, and Xu Xiaoshan coughed up a mouthful of blood, simultaneously unleashing a host of defensive magical items. Despite all of his defenses, he was still seriously injured and thrown back several hundred meters by the power of the fist.</p><br/><p>At the same time, Ghostfang and Shangguan Tianyou unleashed a combined attack.</p><br/><p>Bai Xiaochun didn’t pause for even a moment. Turning, he unleashed all possible speed to escape. He knew he couldn’t easily defeat Ghostfang, Xu Xiaoshan, and Shangguan Tianyou at the same time, and also didn’t want to let them fire off any truly deadly attacks.</p><br/><p>Even as he fled, the disciples from the other three sects closed in. Although they all coveted the heavenstring energy, considering that Bai Xiaochun had it, they didn’t dare to try to attack him on their own. However, as a group, they were confident enough to try to slow him down and give Ghostfang, Xu Xiaoshan and Shangguan Tianyou a chance go at him.</p><br/><p>If that happened, it wouldn’t necessarily be impossible for them to get the heavenstring energy in the end!</p><br/><p>Many of the Profound Stream Sect disciples also possessed shadow projections. They could unleash illusory images, some weak, some strong, that allowed them to attack Bai Xiaochun from a distance.</p><br/><p>The Pill Stream Sect disciples also had their own unique methods of attack, including poisons, exploding pills, and the like.</p><br/><p>The glow of magical techniques surrounded Bai Xiaochun constantly, and booms filled the air. A grave expression could be seen on his face. Even with his Undying Gold Skin, the bombardment was a big headache.</p><br/><p>“You people really are looking to die!” Killing intent flickered in his eyes as he suddenly transformed into a long streak of light that shot toward the surrounding disciples. In the blink of an eye, he slammed into one of the Profound Stream Sect disciples, who spun off to the side and then exploded.</p><br/><p>With that, Bai Xiaochun emerged from the blockade, but even as he did, a voice could be heard coming from up ahead.</p><br/><p>“Bai Xiaochun, we might be from the same sect, but that doesn’t mean we can't fight over heavenstring energy!” It was Beihan Lie, striding forward with a burning sun held in his outstretched hand, a sun which was rapidly turning black. Apparently, this was his Sunset Incantation.</p><br/><p>“Beihan Lie!” Bai Xiaochun said, frowning. Almost at the same moment that Beihan Lie attacked, a beam of light appeared off in the distance, sending a screaming wind blasting out in all directions, which was filled with the power of the Exterminating Obliteration Technique. It was none other than Nine-Isles.</p><br/><p>He didn’t care that he was injured, or that Bai Xiaochun was unnaturally powerful. He still was ready to fight.</p><br/><p>He unleashed his attack in almost perfect unison with Beihan Lie. Magical symbols of obliteration exploded out, joining the pitch black sun to race toward Bai Xiaochun.</p><br/><p>The massive explosion made it impossible for Bai Xiaochun to proceed forward. Moments later, Ghostfang, Xu Xiaoshan, and Shangguan Tianyou arrived, and soon he was dealing with five besiegers.</p><br/><p>Each and every one of those five people was a spectacular Chosen among Chosen, and when they joined forces, their power was beyond description.</p><br/><p>The other disciples in the area now felt a bit of hope. More than a hundred people closed in from all sides, joining forces to try to kill Bai Xiaochun and snatch the heavenstring energy.</p><br/><p>“Bai Xiaochun, you might be strong, but you can’t beat all of us together. Hand over that heavenstring energy!”</p><br/><p>“Bai Xiaochun, Heaven-Dao Foundation Establishment is too important. We’d fight anybody who had that energy. There is no such thing as a fellow disciple in this situation. It’s survival of the fittest!”</p><br/><p>“Give up that heavenstring energy!”</p><br/><p>Even as people shouted out, Ghostfang blurred into motion, exploding with energy as he unleashed the power of his cultivation base. Shockingly, he transformed into a ghost finger! Although it was only a finger, it was huge compared to the ghost hand from before. It filled half the sky, and caused everything to shake violently as it crushed down toward Bai Xiaochun.</p><br/><p>Shangguan Tianyou’s eyes flickered with intense killing intent. After taking a deep breath, he sent sword qi streaming out of all of the pores on his body. It was almost as if his own qi, blood, soul, and cultivation base were manifesting externally, transforming into an enormous heavenly sword that slashed down toward Bai Xiaochun.</p><br/><p>Xu Xiaoshan let out a powerful roar as his forehead split open. Unexpectedly, a beam of blood-colored light shot out, which transformed into a black-haired zombie. It seemed ancient, and as soon as it appeared, an aura of death spread out that distorted the entire area. Brandishing its long, claw-like fingernails and razor-sharp fangs, it leaped toward Bai Xiaochun.</p><br/><p>Things weren’t over yet, though. Beihan Lie gritted his teeth and closed his eyes, causing black flames to erupt off of him. They covered his body, spreading wider and wider as he transformed into a black sun which soared up into the air and then dropped down toward Bai Xiaochun.</p><br/><p>Then there was Nine-Isles. A piercing whistling sound could be heard as he performed a double-handed incantation gesture. Magical symbols streamed out, each one of which burst with the power of the Exterminating Obliteration Technique. The magical symbols then rapidly formed together into a single thread that seemed capable of slicing through anything and everything. Nine-Isles was left ashen-faced and coughing up blood. He even seemed to age visibly.</p><br/><p>Five top Chosen were all attacking simultaneously!</p><br/><p>In addition to them were a host of Qi Condensation disciples, all of whom launched their most powerful magical techniques. The entire area lit up with colorful lights as countless divine abilities bore down on Bai Xiaochun.</p><br/><p>The intense danger of the situation caused Bai Xiaochun to gasp. By this point, he had already assimilated about half of the heavenstring energy, and it was coursing through his qi passageways into his nine spiritual seas. If he tried to stop the process at this point, it could have serious negative ramifications.</p><br/><p>Besides, he wasn’t willing to give up the heavenstring energy after just having acquired it. Furthermore, when it came to five top Chosen attacking him at the same time, he had one reaction:</p><br/><p><em>So what?!</em></p><br/><p>Eyes glittering, he took a deep breath and closed his eyes. Even as the countless divine abilities and magical techniques rumbled toward him, he lifted both hands into the air and then murmured two words!</p><br/><p>“Waterswamp... Kingdom!”</p><br/><p>This would be his first time unleashing the complete Waterswamp Kingdom with a Foundation Establishment cultivation base!</p><br/><p>As soon as the words left his mouth, everything in the area turned hazy. In the blink of an eye, heaven and earth vanished, and the area became a huge watery swamp. Water vapor filled the area, to the point where hair and clothes alike dripped with moisture.</p><br/><p>An indescribably powerful aura roiled out, something that far exceeded early Foundation Establishment. This was more like mid Foundation Establishment!</p><br/><p>A magical technique like this, which seemingly broke past the level of one’s cultivation base... was a secret magic!</p><br/><p>Of course, there were weak secret magics and strong ones. And although the Waterswamp Kingdom and Ghosts Haunt the Night were equally famous, Bai Xiaochun was at the peak of Earthstring Foundation Establishment. He had already gained enlightenment of his life essence spirit, and had even broken through the first shackle of mortality. Because of all those reasons, his Waterswamp Kingdom vastly exceeded Ghostfang’s Ghosts Haunt the Night!</p><br/><p>When he unleashed it, it could destroy the heavens and crush the earth!</p><br/><p>The faces of the five great Chosen all fell, and the reaction of the other cultivators was exactly the same. In that very instant, all of their magics were locked down and began to tremble on the verge of destruction.</p><br/><p>“We can’t let him keep this up!”</p><br/><p>“Attack!!” Everyone was crying out in alarm. At the same time, the magical techniques of the five great Chosen sped up. Rumbling sounds could be heard as they descended upon Bai Xiaochun. However, that was when Bai Xiaochun’s eyes suddenly snapped open!</p><br/><p>Instantly, an enormous mountain peak appeared that could shake heaven and earth. It rose up from the 30,000-meter-wide waterswamp, superseding the world, rising high up into the sky!</p><br/><p>The mountain peak was vastly enormous, and erupted with a shocking aura that could topple mountains and drain seas. Indescribable pressure pushed down onto everything, crushing everything in its path!</p><br/><p>It was as if it wished to flatten everything in existence!</p><br/><p>The magical techniques of the five great Chosen were destroyed like dried weeds!</p><br/><p>Blood sprayed out of the mouths of the five Chosen, and expressions of astonishment could be seen on their faces. They were sent flying away, their bodies completely beyond their own control. As for the Qi Condensation cultivators, they let out bloodcurdling screams as the pressure crushed down onto them. One by one, they began to explode, blood spraying out like blooming flowers!</p><br/><p>They were being crushed out of existence, destroyed in body and soul!</p><br/>\n</div>"}