{"title": "Chapter 169: Hou Yunqing Never Lies", "id": 169, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-169-hou-yunqing-never-lies", "volume_title": "Volume 2", "body": "<h1>Chapter 169: Hou Yunqing Never Lies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Surprised, Bai Xiaochun turned to look at the young man.</p><br/><p>“I am your humble servant, Hou Yunqing,” the young man said politely, a broad smile covering his face. “I happen to be the owner of this little shop. Brother, I can see that you’re an extraordinary person, a dragon amongst men. If you see something you like, Brother, just take it, on the house. Think of it as a gift between friends.” [1. Back in chapter 144, Hou Yunfei mentioned Hou Yunqing, a close relative in his clan]</p><br/><p>“Are you serious?!” Bai Xiaochun looked at Hou Yunqing, blinking.</p><br/><p>“Of course I'm serious! Hou Yunqing never lies.”</p><br/><p>Bai Xiaochun responded with a sarcastic chuckle. Having no reason to refuse a free gift, he casually pointed at the heavenly dragon robe.</p><br/><p>The salesperson looked at Hou Yunqing, who smiled and nodded. The salesperson shrugged in disbelief as he handed the heavenly dragon robe over to Bai Xiaochun. Bai Xiaochun threw it on, and immediately looked completely different than before.</p><br/><p>Hou Yunqing laughed heartily and said, “Brother, the heavenly dragon robe definitely suits you perfectly. It almost looks as if it was custom tailored just for you! You really know how to pick clothes for yourself!”</p><br/><p>“You think so too?” Bai Xiaochun replied, smoothing out the robe. He was very pleased, and couldn’t help but think that the clothes they wore back at the sect were far too shabby. He had already fallen in love with this new world of luxury and sensual pleasure.</p><br/><p>Hou Yunqing was so taken aback by Bai Xiaochun’s response that he didn't know what to say next. Finally, he cleared his throat and changed the subject.</p><br/><p>“Brother, there’s a banquet tonight here in Eastwood City. Emissary Du Lingfei from the Spirit Stream Sect has reached the end of her commission and will be returning to her sect, so a big banquet is being held in her honor. If you don’t have anything else to do, Brother, why don’t you come along? It’ll be a lot of fun.”</p><br/><p>Bai Xiaochun looked at Hou Yunqing with an enigmatic smile for a moment and then voiced his agreement.</p><br/><p>Hou Yunqing knew that he was being a bit presumptuous, but also wanted to take advantage of the golden opportunity which had presented itself, and didn’t have time to come up with any better tactics. Smiling, he led Bai Xiaochun out of the shop and onto the street.</p><br/><p>As soon as they stepped out, Bai Xiaochun noticed that they were being followed by eight bodyguards, all of whom were in the fifth level of Qi Condensation. They were rogue cultivators, but they clearly were adept killers, as they radiated powerful murderous auras.</p><br/><p>Hou Yunqing looked at Bai Xiaochun out of the corner of his eye and said, “You know, Emissary Du Lingfei from the Spirit Stream Sect is as beautiful as an immortal. Not only is her cultivation base very high, she’s spectacularly good-looking. In fact, she’s one of the top ten goddesses in the Eastwood Continent. With her as emissary here, the ten clans maintained completely harmonious relations. Not a single problem ever cropped up. She handled her duties with great finesse.”</p><br/><p>This was Bai Xiaochun’s first time hearing about Du Lingfei’s affairs in Eastwood City, and he was immediately intrigued. “She sounds incredible!”</p><br/><p>“Oh, she’s incredible, alright. Very incredible! Famous young men from cultivator clans all over the Eastwood Continent have tried to earn her favor. In my opinion, though, there isn’t a single clan that’s worthy of her. Only few people in the Spirit Stream Sect itself could be counted deserving. To be honest, there’s really only one person good enough for her!” Hou Yunqing sighed.</p><br/><p>“Who’s that?!” Bai Xiaochun asked, blinking.</p><br/><p>“Oh, he’s a rare Chosen in the Spirit Stream Sect, the type that only comes along once every 10,000 years. He's a Prestige disciple, and the Junior Brother of the sect leader. His name has rocked both the north and south banks of the Spirit Stream Sect, and he’s popular among countless disciples. His name is... Bai Xiaochun!” Hou Yunqing’s expression was one of reverence, although he seemed to be working hard to suppress his zeal. As for the bodyguards, they all had strange expressions on their faces. They had worked for Hou Yunqing for many years, but this was their first time hearing him speak like this. They couldn’t help but look over at Bai Xiaochun, curiosity gnawing at their hearts.</p><br/><p>Bai Xiaochun coughed dryly. Looking very thoughtful, he said, “You’re right, Bai Xiaochun truly is extraordinary.”</p><br/><p>Then he gave Hou Yunqing another enigmatic smile.</p><br/><p>Either Hou Yunqing didn’t notice Bai Xiaochun’s thoughtful look, or he did notice and pretended not to.</p><br/><p>“Extraordinary?” he continued excitedly. “He’s more than that. He’s a true Chosen, a superstar, the type of person all the female disciples in the Spirit Stream Sect want as a Daoist partner. As for the male disciples, they all want to be his friend. He’s the jewel of the Spirit Stream Sect. I’ve even heard some people say that after coming back from the Foundation Establishment Holy Lands, he’s reached Earthstring Foundation Establishment.</p><br/><p>“A person like that is like a full moon on a dark night. All people can do is look up at him in amazement. What a pity that my own latent talent is just average. Otherwise, I’d go looking for him myself and offer to be his follower for life, to be at his beck and call at all hours of the day.”</p><br/><p>Bai Xiaochun was almost blushing by this point. However, Hou Yunqing seemed really caught up in his excitement, and Bai Xiaochun didn't want to interrupt him. Therefore, he allowed him to keep speaking in this vein for quite some time, even giving him an encouraging look now and then.</p><br/><p>Hou Yunqing kept it up all the way to the banquet, coming up with new and flowery ways to praise Bai Xiaochun the entire time. At one point, he ran out of things to say, but Bai Xiaochun gave him an encouraging look, and he gritted his teeth and racked his brains to come up with more. The nonstop talking was rather exhausting....</p><br/><p>As Bai Xiaochun and Hou Yunqing were heading toward the banquet, large numbers of disciples and elders from the Spirit Stream Sect were out scouring the Eastwood Continent. Their main goal was to track down the disciples who had been teleported out of the Fallen Sword Abyss, and find out what exactly had occurred.</p><br/><p>A group of Inner Sect disciples was making their way along the edge of a jungle when they happened to find a disciple who had been knocked unconscious during the teleportation process. They quickly revived him.</p><br/><p>The first words that came out of his mouth were enough to shock all of the rescuers.</p><br/><p>“Sect Uncle Bai Xiaochun reached Heaven-Dao Foundation Establishment!!”</p><br/><p>The words struck the hearts of the listeners like bolts of lightning. All of them gasped. It was earth-shattering news, so without the slightest hesitation, they sent messages back to the sect.</p><br/><p>Soon, more and more disciples who had been teleported out of the Fallen Sword Abyss turned up. Furthermore, the news that was getting sent back to the sect was all the same.</p><br/><p>Bai Xiaochun had reached Heaven-Dao Foundation Establishment!</p><br/><p>He had struck despair into the hearts of the disciples of the other three sects. He had slaughtered Zhao Rou and Fang Lin of the Pill Stream Sect, had seriously injured Nine-Isles, had successfully wrested all the heavenstring energy from Song Que, and had risen to Heaven-Dao Foundation Establishment!</p><br/><p>Some people were even saying that he had killed Lei Shan from the Profound Stream Sect.</p><br/><p>As the information trickled back, the Spirit Stream Sect was thrown into a huge commotion. The elders, the seven peak lords, the sect leader... all of them were both stunned and, at the same time, wildly elated. Earlier, they had been nervous, unsure of which disciple from which sect had reached Heaven-Dao Foundation Establishment. In fact, many had been convinced that it would be someone from the Blood Stream Sect.</p><br/><p>Word had even been sent to the spies in the Blood Stream Sect to try to kill certain disciples there.</p><br/><p>But now, everyone was shaken to find that the person who had reached Heaven-Dao Foundation Establishment... actually came from the Spirit Stream Sect. And it was... Bai Xiaochun!</p><br/><p>Li Qinghou and the sect leader were beside themselves with joy. The prime elders were completely shaken. Next, the entire sect was mobilized, with one mission.</p><br/><p>“Find Bai Xiaochun. Immediately send word back to the sect if you do. Protect him and escort him home!”</p><br/><p>At the same time, the Spirit Stream Sect locked down all disciples who were suspected of being spies. They were well aware that once the other three sects got word of what had occurred, they would do anything to try to kill Bai Xiaochun!</p><br/><p>The cultivator clans in the area were closely connected to the Spirit Stream Sect, and as such, it was essentially impossible to keep word from spreading. Soon, everyone had caught wind of what was going on. The patriarchs of the various clans were completely shaken. Eyes bloodshot, they sent the members of their clans out in all directions to try to find Bai Xiaochun.</p><br/><p>After all, they knew that he could have been teleported anywhere on the Eastwood Continent.</p><br/><p>If they got lucky and he was teleported into their territory, and they found him first, they would be able to invite him to visit their clan personally. That would be a huge honor in and of itself, considering he was a Heaven-Dao Foundation Establishment cultivator now.</p><br/><p>There would also be the possibility of some of their clan members striking up friendships with him, which would also be of enormous benefit to the clan.</p><br/><p>Even more enticing than that, though, was the possibility that Bai Xiaochun might take a liking to one of the female clan members, and take her as a Daoist partner. If that happened, not even the sect leader would be able to do anything about it.</p><br/><p>“Dispatch everyone. Find him! Bai Xiaochun might have been teleported into our territory!”</p><br/><p>As the cultivator clans were dispatching people to search, Bai Xiaochun and Hou Yunqing finally arrived at the banquet.</p><br/><p>It was being hosted in a sprawling mansion that covered over ten acres of land. The walls were magnificently decorated, and the grounds were filled with pine trees and decorative rock formations. In one area near the center, pavilions had been set up, as well as a three-story pagoda that looked almost like a palace. Decorated with dragons and phoenixes, it was tasteful and elegant, yet clearly wildly expensive.</p><br/><p>A din of voices could be heard, and servants bustled back and forth carrying all sorts of fine liquor and fresh fruit to the elegantly attired guests.</p><br/><p>There were well over a hundred guests present, men and women, young and old. Some sat alone, others in groups of three to five.</p><br/><p>Guards were posted at the main entrance, where a valet cheerfully greeted the new arrivals. For those he didn’t recognize, he would accept their invitation cards, make a record of their arrival, and then show them inside.</p><br/><p>As soon as Hou Yunqing appeared, the valet greeted him respectfully and escorted him inside. Bai Xiaochun walked along by his side, looking around curiously at the banquet. This was his first time attending such an affair.</p><br/><p>One of the first things he saw was a muscular man off in the distance, chatting and laughing with a pretty young woman as they all walked along toward Hou Yunqing. The man wore a long violet robe that was clearly very expensive. His face had a healthy glow to it, and he wore rings of holding on all of his fingers. Seven or eight jade pendants could be seen on his person, and he looked every bit like a rich playboy.</p><br/>\n</div>"}