{"title": "Chapter 187: Song Que Has An Aunt....", "id": 187, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-187-song-que-has-an-aunt", "volume_title": "Volume 2", "body": "<h1>Chapter 187: Song Que Has An Aunt....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“A trifling Earthstring Foundation Establishment cultivator gets to be called Young Lady? I'm a Heavenstring Foundation Establishment cultivator, and I don't get to be called Young Lord in the Spirit Stream Sect!” Irritated and envious, Bai Xiaochun took advantage of the moment to ask imposter Nightcrypt what he knew about Xuemei.</p><br/><p>Imposter Nightcrypt was trembling in fear because of Xuemei, but once he heard Bai Xiaochun’s question, he immediately launched into an explanation.</p><br/><p>“Young Lady Xuemei has a very impressive background. She’s the only daughter of the most recently promoted of the Blood Stream Sect’s eight patriarchs, Patriarch Limitless. She has shocking latent talent, and is even more famous than Song Que!</p><br/><p>“When she was in Qi Condensation, she spent most of her time cultivating on Ancestor Peak, and rarely came outside. She must be out and about in the sect now because she's reached Foundation Establishment.</p><br/><p>“Patriarch Limitless originally came from Middle Peak, so word has it that Young Lady Xuemei was always supposed to be an elder there. Presumably, she’s going to try to fight for the position of Middle Peak blood master!”</p><br/><p>Bai Xiaochun was already struck somewhat speechless by what he was being told.</p><br/><p>“In every generation,” imposter Nightcrypt continued, “the Blood Stream Sect has four blood masters, one for each mountain peak. The fighting over the position on the other three peaks has already ended, but the position on Middle Peak is still open. Now that Young Lady Xuemei has reached Foundation Establishment, her next step will be to vie with the Middle Peak grand elder to take the status of blood master.</p><br/><p>“If Song Que had reached Heaven-Dao Foundation Establishment, he would have qualified for the position, but since he's only at the Earthstring level, the Song Clan won't let him go up against his aunt.”</p><br/><p>“His aunt?” Bai Xiaochun asked, shocked.</p><br/><p>“Yeah,” replied imposter Nightcrypt. “Middle Peak Grand Elder Song Junwan is Song Que’s aunt!” Suddenly, his tone turned even more enigmatic than before. “Senior Bai, since we're talking about blood masters, there’s a secret I need to tell you. Did you know that there’s a position even higher than blood master? Well, of course there’s the blood ripper level, but there’s something even higher than that. I’m pretty sure it’s even above the patriarch level. Have you heard of it?”</p><br/><p>Bai Xiaochun couldn’t help but be intrigued by the imposter Nightcrypt’s mysterious tone of voice. “What is it?” he asked.</p><br/><p>Imposter Nightcrypt cleared his throat and then proudly went on to say, “According to the legends, above the patriarch level is the Blood Devil!”</p><br/><p>“Blood Devil?” Bai Xiaochun’s heart began to pound. It was a title that seemed completely domineering. Even just hearing it mentioned caused his skin to crawl, almost as if he had seen a real devil.</p><br/><p>“Hmph. See how powerful the Blood Stream Sect is? Let me tell you, anyone who can get a blood crystal from one of the mountain peaks of the Blood Stream Sect can become a blood master. The exception is Ancestor Peak, of course. As for the blood crystals, they come from the body of the Blood Ancestor, in the Heavenspan River, whose holy hand serves as the foundation of the entire sect!</p><br/><p>“According to the legend, the body of the Blood Ancestor doesn’t just contain blood crystals, it also contains a secret legacy!</p><br/><p>“Whoever takes that legacy will become the Blood Devil, and will lead the Blood Stream Sect into founding a new legend!</p><br/><p>“Of course, it’s just a legend. Don’t take it too seriously. A lot of people in the sect think it’s just a story.” Imposter Nightcrypt sighed.</p><br/><p>Bai Xiaochun took a deep breath, and his heart thumped with excitement. Most other people might think that the legend was nothing more than a story, but he didn’t believe that. As far as he was concerned, it was entirely likely that the giant Blood Ancestor beneath the Heavenspan River might have an extraordinary legacy waiting to be taken.</p><br/><p>By this point, the blood palanquin had made its way off into the distance in the direction of Ancestor Peak. The Foundation Establishment cultivators gradually dispersed, and everyone down on the ground breathed sighs of relief.</p><br/><p>Zhao Wuchang’s eyes glittered with envy.</p><br/><p>“You’ve really got guts,” he said. “It’s a good thing Young Lady Xuemei didn’t see you looking at her. She definitely would have dug your eyes out if she had, and maybe even beaten you to death.”</p><br/><p>“So overbearing!” Bai Xiaochun said with a nod. Inwardly, he couldn’t help but feel a bit of disdain, but he didn’t let it show on his face. With that, Zhao Wuchang led the way to the meeting.</p><br/><p>Near the border of the back of the hand was an immortal's cave belonging to a disciple who had gone to the Lone Hell Pocket Realm but failed to gather enough earthstring energy to form even a single Tideflow.</p><br/><p>Although he had failed, his cultivation base had improved some, and he ended up being known as one of the top disciples among those who had failed.</p><br/><p>As soon as Bai Xiaochun entered the immortal's cave, he saw a dozen or so other disciples in the great circle of Qi Condensation, all of them angrily complaining to each other.</p><br/><p>“If ever get a chance, I'm definitely going to kill that Lin Mu from the Pill Stream Sect. The only reason I failed was because he took so much earthstring energy!”</p><br/><p>“ Lin Mu really is vicious. I heard that, to advance his cultivation, he actually planted Dao seeds in other Pill Stream Sect disciples. He brought a whole generation of disciples to ruin for his own benefit!”</p><br/><p>“Lin Mu might be bad, and Shui Fang from the Profound Stream Sect is pretty vicious, but they’re basically ants compared to the most infuriating person of all. Bai Xiaochun from the Fallen Sword Abyss!!”</p><br/><p>“That Bai Xiaochun is a true devil. He’s fiercer than anyone in the Blood Stream Sect! Only a few people came back alive from the Fallen Sword Abyss. Can the other two Holy Lands compare to that?!”</p><br/><p>“I heard that Bai Xiaochun cuts people down as casually as scything wheat! He’s so overbearing he even drinks their blood after he kills them! All he has to do is bump you, and you explode!”</p><br/><p>When Bai Xiaochun walked in to hear people talking about him, his heart thumped, but after reminding himself that he was there as Nightcrypt, he calmed himself and joined the group.</p><br/><p>The other disciples nodded in greeting, and continued to tell stories about Bai Xiaochun.</p><br/><p>“Bai Xiaochun is my mortal enemy for life!” Zhao Wuchang said, clenching his hands into fists so hard that veins popped out on them. Even as he gritted his teeth in anger, lingering fear could be seen in his eyes.</p><br/><p>“Don’t worry, Elder Brother Zhao,” one of the disciples said comfortingly. “I heard the sect leader has already put an official bounty out on Bai Xiaochun. Whoever brings in his head will be rewarded with a precious treasure, and will also get a Gold Core fruit!” The other disciples seemed excited at the prospect, but Bai Xiaochun’s eyes went wide, and his heart began to pound even harder.</p><br/><p>“Gold Core fruit?” he thought. “That can significantly increase the chances of reaching Core Formation! This Blood Stream Sect is too vicious!!”</p><br/><p>Even as he gasped inwardly, another of the Blood Stream Sect disciples chuckled coldly and said, “That’s nothing. A few days ago I heard that the three great blood masters were dispatched to hunt down Bai Xiaochun. If he dares to step out of the Spirit Stream Sect, he’ll be killed beyond the shadow of a doubt!”</p><br/><p>Even as everyone in the immortal's cave was grinding their teeth and cursing, people realized that Bai Xiaochun hadn’t said anything. Zhao Wuchang looked over in surprise.</p><br/><p>“Junior Brother Nightcrypt, why haven’t you chimed in? You almost got killed by Bai Xiaochun. What do you think about him?” Everyone turned to look at Bai Xiaochun.</p><br/><p>Bai Xiaochun had been trembling inwardly with fear, but as soon as he heard Zhao Wuchang address him, he stuck his chest out and smacked it with his palm. Expression fierce to the extreme, and eyes completely bloodshot, he said, “I’ll tell you how things stand between me and Bai Xiaochun. In the end, either he’ll be dead, or I will! Don’t even talk about Bai Xiaochun in front of me! My entire purpose in life is to put him to an untimely end!”</p><br/><p>He then continued to express his determination to kill Bai Xiaochun, his wording growing more and more vicious. The other disciples started to nod, and some of them, including Zhao Wuchang, felt like he was expressing their sentiments perfectly.</p><br/><p>The conversation continued, and soon the topic changed, whereupon Bai Xiaochun breathed an inward sigh of relief. The Blood Stream Sect really was proving to be a dangerous place, and he had already begun to miss the Spirit Stream Sect.</p><br/><p>At one point, there was a lull in the conversation, whereupon the owner of the immortal's cave, the most powerful of the disciples present, looked around and then said, “There’s something important I need to tell you all. I've made some inquiries, and learned that the sect has already decided what to do with those of us who failed in the Foundation Establishment Holy Lands. Apparently, they’re going to give us another chance!”</p><br/><p>Instantly, the other disciples looked at him with serious expressions.</p><br/><p>“Assuming it's a chance to reach Mortal-Dao Foundation Establishment,” he continued, “then that means we would need a Foundation Establishment Pill. Most likely, this opportunity will come in the form of a trial by fire in which we compete for that pill!</p><br/><p>“I was also told that not everyone will get a chance to participate in the trial by fire. Before it starts, we will be given missions by the sect, and only those who complete their mission will be qualified to join the competition.”</p><br/><p>Bai Xiaochun blinked, and then pretended to look both thoughtful and sinister at the same time.</p><br/><p>The owner of the immortal's cave looked around at everyone, eyes flashing, then continued, “Friends, don't forget that we aren’t the only ones who failed in the Holy Lands. There are some loners out there who refused to join our team. We need to join forces to eliminate them, and make sure that one of us gets the Foundation Establishment Pill!”</p><br/><p>It was impossible to say what people were actually thinking, but on the surface, everyone seemed to support the idea. After voicing their assent, they chatted some more about sect news before dispersing.</p><br/><p>Bai Xiaochun walked along through the sect, the sky above him slowly growing dark. As he thought about the matter of the trial by fire, he realized that he should try to figure out a way to prevent the others from successfully reaching Foundation Establishment. For all intents and purposes, the Blood Stream Sect was the enemy of the Spirit Stream Sect.</p><br/><p>As he strolled along thinking, his eyes suddenly flashed, and he spun around, right hand shooting out to grab a person who had been walking behind him. That person hadn’t anticipated that he would be so quick, and failed to evade his hand. However, what Bai Xiaochun ended up grabbing was that person's chest.</p><br/><p>“You naughty devil! What, you want to do it right here?” It was a middle-aged woman, her face crisscrossed with scars. One of the scars even ran from the top of her forehead all the way through both of her lips. Standing there with the moonlight spilling down onto her, she almost looked like a poltergeist.</p><br/><p>Her cultivation base was in the tenth level of Qi Condensation, and a flirtatious look could be seen in her eyes.</p><br/><p>Bai Xiaochun stared in shock, and then quickly pulled his hand back.</p><br/><p>“Well, that’s fine,” the woman said. “If you want things like that, I'll follow your lead....” She cocked her eyebrow coquettishly, and was just about to remove her garments when Bai Xiaochun fled in the opposite direction.</p><br/><p>“Dammit, Nightcrypt,” he said, “how many girlfriends do you have in this sect!?” The woman called out for him to come back, but Bai Xiaochun didn’t even stop running.</p><br/><p>“I'm not really sure,” imposter Nightcrypt replied in a fearful tone. “Surviving in the Blood Stream Sect isn’t an easy thing. Over the years, I hooked up with anyone who could give me medicinal pills....”</p><br/><p>Bai Xiaochun’s eyes went blank.</p><br/>\n</div>"}