{"title": "Chapter 185: Secrets of the Blood Stream Sect", "id": 185, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-185-secrets-of-the-blood-stream-sect", "volume_title": "Volume 2", "body": "<h1>Chapter 185: Secrets of the Blood Stream Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It took some time for Bai Xiaochun to calm himself down. After he did, he continued on toward the sect itself. Soon, beams of light could be seen flying around near him, all of them Blood Stream Sect disciples, as well as Foundation Establishment elders and Dharma protectors.</p><br/><p>The Foundation Establishment cultivators all radiated powerful murderous auras, and flew with incredible speed. They seemed domineering, rude, and completely headstrong. Everywhere they went, the Inner Sect disciples bowed their heads and clasped hands respectfully, not daring to show the least bit of disrespect.</p><br/><p>One Foundation Establishment cultivator apparently thought Bai Xiaochun was in his way, so he waved his sleeve, sending a powerful gust of wind against him. Thankfully, Bai Xiaochun was very quick on the uptake, and immediately pretended to be blasted off to the side. He even managed to cause some blood to ooze out of the corners of his mouth.</p><br/><p>The Foundation Establishment cultivator completely ignored him as he passed on by.</p><br/><p>Other Inner Sect disciples in the area barely seemed to notice. Further down on the arm, where the servants lived, the servants would occasionally look up into the air at the Inner Sect disciples and Foundation Establishment cultivators, their expressions those of complete awe.</p><br/><p>“So overbearing!” Bai Xiaochun thought. At first, it didn’t seem possible that the entire sect could be this way, but he quickly reminded himself that he was in the Blood Stream Sect, and flew along toward the hand itself.</p><br/><p>As he neared, he saw a shimmering, blood-colored light that was clearly a spell formation. When he passed through it, it flickered, but did nothing to block his way. A moment later, he was inside the spell formation and on the hand.</p><br/><p>“Passed the first test!” he thought, taking a deep breath. The light he had just passed through was the Blood Stream Sect’s defensive spell formation, which would immediately detect anyone who wasn’t a disciple of the sect.</p><br/><p>The back of the hand was huge. Bai Xiaochun quickly realized that it was actually about as large as the south and north banks of the Spirit Stream Sect put together. That only served to further his understanding of how powerful the Blood Stream Sect was.</p><br/><p>Only Inner Sect disciples were allowed onto the back of the hand. Outer Sect disciples could not enter without an authentication device. If they tried to, they would be severely punished. The lightest punishment for such an offense was a flogging, with more serious violators having a limb severed. The punishments were brutal, but that was how the twisted Blood Stream Sect operated. The differences between the levels were strictly enforced.</p><br/><p>Bai Xiaochun had been nervous at first, but after reaching the hand itself, and feeling the intimate connection between it and his Undying Live Forever Technique, he felt increasingly shaken.</p><br/><p>“How could this be possible...?” He still almost couldn’t believe what he was feeling. However, he soon had to acknowledge a shocking truth.</p><br/><p>“This hand cultivated the Undying Live Forever Technique!!” More precisely, beneath the surface of the Heavenspan River was a giant who had indeed cultivated the Undying Live Forever Technique!</p><br/><p>Clearly, that giant had reached an extremely high level, which meant that the skin on the hand and arm was actually Undying Skin!</p><br/><p>From the cracks and crevices that now existed in that Undying Skin, it was possible to see what appeared to be soil, which was the giant’s Undying Flesh. Even further down, in a location it was not possible to see, were the bones, which were Undying Bones!</p><br/><p>However, what was most shocking to Bai Xiaochun was that the blood waterfalls which poured down from the five mountain peaks represented the highest realm of the Undying Codex, Undying Blood!</p><br/><p>“Heavens! The Blood Stream Sect is built on the arm of a giant who cultivated the Undying Live Forever Technique! Furthermore, the techniques they cultivate were obviously passed down by the earliest members of the Blood Stream Sect, and were based on the arm itself. That means that their techniques all stem from the same Undying Live Forever Technique that I cultivate!!”</p><br/><p>Based on what he knew, the first volume of the Undying Live Forever Technique was not very rare. Many sects had it. However, because it was so difficult to cultivate, few people ever succeeded with the Undying Gold Skin.</p><br/><p>Fewer people, if any, could have gone beyond that to accomplish what Bai Xiaochun had in breaking the first shackle of mortality. In fact, it was highly likely that nobody in the entire Blood Stream Sect actually knew about the relationship between the blood hand and the Undying Live Forever Technique.</p><br/><p>Bai Xiaochun felt completely confident that only someone who had Undying Gold Skin and had also broken through the first shackle of mortality would be able to sense the call of the hand.</p><br/><p>He knew that his conjectures might not be completely accurate, but he was confident that as he came to understand more about the Blood Stream Sect, he would be able to get answers to his questions, perhaps even first-hand verification.</p><br/><p>“No wonder the blood sphere that Song Que used in the Fallen Sword World felt so familiar....” The reason why the exploding blood sphere Song Que had used against him felt so familiar was because it was actually made from Undying Blood. It was only after reaching Foundation Establishment that Song Que had been able to forcibly unleash that special magic of the Blood Stream Sect.</p><br/><p>“That’s also why all of the Blood Stream Sect disciples in general seemed so familiar. Now it all makes sense....” Mind reeling with shock, he followed imposter Nightcrypt’s instructions, going to the Internal Affairs Bureau to get an identity jade pendant, and record his return to the Blood Stream Sect. As he approached, a beam of light shot toward him, which transformed into an old man.</p><br/><p>He had a Foundation Establishment cultivation base, and when he looked Bai Xiaochun up and down with cold eyes, Bai Xiaochun immediately got nervous. Clasping hands respectfully, he quickly inquired of imposter Nightcrypt, and learned that this old man was the elder in charge of the Internal Affairs Bureau.</p><br/><p>“Disciple Nightcrypt offers greetings, Elder Han!”</p><br/><p>“What took you so long to get back!?” Elder Han asked coolly.</p><br/><p>“Disciple was seriously injured,” he replied cautiously. “I found a place to hole up and recuperate, and only just recently felt up to returning.” After a moment of thought, he slapped his bag of holding and produced a rather large collection of spirit stones, which he placed in front of Elder Han.</p><br/><p>“Elder Han, I got these in the Fallen Sword World. Please, take them. I hope you can be a bit flexible with me for returning late....” Bai Xiaochun blinked a few times.</p><br/><p>Elder Han’s eyes went wide, but a moment later he waved his sleeve, and the spirit stones disappeared. Looking at Bai Xiaochun again for a moment, he nodded.</p><br/><p>“A few of you took your time coming back. Well, now that you’re here, focus on your cultivation. You’ll get another chance to reach Mortal-Dao Foundation Establishment, eventually. Very well, be off now.”</p><br/><p>Bai Xiaochun immediately took his leave. Elder Han watched him leave, musing to himself that this Nightcrypt seemed to have learned a thing or two in the Fallen Sword Abyss.</p><br/><p>“Alright, since he’s gotten a bit smarter, I won’t make things harder for him. He really should receive ten lashes for coming back late!” Turning, Elder Han vanished.</p><br/><p>Imposter Nightcrypt was also taken aback. The way Bai Xiaochun so casually bribed Elder Han caused him to gasp. All of a sudden, he realized that Bai Xiaochun seemed very well suited to life in the Blood Stream Sect.</p><br/><p>Bai Xiaochun walked along in the sect, marveling at everything he saw around him. Unfortunately, everyone was very cold and indifferent, and stuck to themselves as they hurried along. Many had vigilant looks on their faces, as if they were always on guard.</p><br/><p>On four or five occasions along the way, he saw two disciples engaged in fierce fighting, apparently struggling over medicinal pills. Murderous auras raged as they seemed intent on taking each others’ lives.</p><br/><p>Audiences often gathered to watch such conflicts, but everyone also kept an eye out in case someone attacked them.</p><br/><p>He saw one person coughing up blood so badly it seemed shattered internal organs might come out.</p><br/><p>“The Spirit Stream Sect really is way better than this,” Bai Xiaochun thought. “Everyone gets along there. It's so wonderful. The Blood Stream Sect is so dangerous! One slip of the tongue and you might get attacked....”</p><br/><p>He walked along feeling very nervous. Thankfully, Nightcrypt wasn’t very well-known in the sect, and his cultivation base was only in the great circle of the tenth level of Qi Condensation. Nobody took the initiative to attack him, a trend he encouraged by looking as fierce as possible.</p><br/><p>Just as he was almost at Nightcrypt’s immortal's cave, he passed a group of five female disciples. One of them, a tough-looking big-boned girl, caught sight of him and then hurried over, accompanied by the giggling of her companions.</p><br/><p>“Nightcrypt!” the girl said in a loud, hoarse voice.</p><br/><p>Bai Xiaochun turned in shock to look at the unfamiliar young woman. She was stocky, with a pockmarked face, and was walking toward him with swaying hips, and eyes that gleamed with what appeared to be deep desire.</p><br/><p>“Do I know you?” Bai Xiaochun asked.</p><br/><p>“You naughty devil!” she said, glaring. “Don't pretend you don’t know who I am! Come here and give me a smile!” Chuckling, she reached out and stroked Bai Xiaochun’s cheek.</p><br/><p>Her action and her chuckle caused Bai Xiaochun to gasp and take a step back.</p><br/><p>“Well well,” the girl continued, “a little trip to the Fallen Sword Abyss and you already forgot about me? Hurry up and get back to my immortal's cave. I have plenty of medicinal pills for you.” The stocky girl licked her lips and took a step forward as if she planned to drag him to her immortal's cave.</p><br/><p>Bai Xiaochun’s scalp was tingling so hard it felt like it might explode. Flicking his sleeve, he blocked her path.</p><br/><p>“Don’t you touch me!” he cried.</p><br/><p>“I see how it is, Nightcrypt. How dare you! Hpmh. Just wait and see what happens when you come crawling back to me!” Giving him an angry glare, she turned and stalked off.</p><br/><p>Bai Xiaochun finally breathed a sigh of relief, simultaneously asking imposter Nightcrypt who the girl was.</p><br/><p>“Senior, please don’t be angry,” was the hasty reply. “She’s just a girlfriend of mine in the sect....”</p><br/><p>Bai Xiaochun almost couldn't believe it. “Girlfriend? Uh, you have really strange taste.”</p><br/><p>Nightcrypt was actually very good-looking, albeit somewhat cold. Bai Xiaochun almost couldn’t believe that he would be in a relationship with the husky girl.</p><br/><p>“Senior, there’s something I never mentioned,” imposter Nightcrypt said, sounding like he was about to cry. “After I became an Inner Sect disciple, my cultivation went really slowly, and I needed a lot of medicinal pills. I really had no other choice. Elder Sister Sun is from one of the cultivator clans, and has access to lots of pills. I didn't have any other option than to get on her good side....”</p><br/>\n</div>"}