{"title": "Chapter 190: Green Zombies", "id": 190, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-190-green-zombies", "volume_title": "Volume 2", "body": "<h1>Chapter 190: Green Zombies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun was getting really mad. He stood there facing off with the zombie, filled with frustration that it just wouldn’t turn white.</p><br/><p>Spinning around, he began to throw medicinal plants into the pill furnace, including special Blood Stream Sect plants. Changing the pill formula once more, he began to madly devote himself to concocting.</p><br/><p>His hair was in complete disarray, and he had already forgotten that he wasn’t in the Spirit Stream Sect. He was completely immersed in concocting medicine to the point of bedeviled madness. His eyes burned red, and even imposter Nightcrypt’s soul was trembling. He almost felt like he was back in the Fallen Sword World, and didn't dare to interrupt Bai Xiaochun in even the smallest way.</p><br/><p>“This Bai Xiaochun is crazy!” he thought.</p><br/><p>As Bai Xiaochun worked on his new spirit medicine, Xu Xiaoshan was in another location in the corpse refinery, dejectedly pondering a certain issue that had cropped up over the past half year or so. For some reason, the corpse-refining blood serum in his corpse refinery was draining away much more quickly than usual.</p><br/><p>“What’s going on?” he thought. It was quite a headache to investigate the matter, considering that there were over a thousand corpses being refined at any given time. In any case, the blood serum drainage rate was still within acceptable limits.</p><br/><p>“Ah, whatever. I guess it just means that I’ll be able to upgrade my corpse refinery sooner than expected.” With that, he put the matter aside.</p><br/><p>A month later, Bai Xiaochun was there in the corpse cave, looking at the pill furnace and cackling. He had even poured his own blood into the mixture to make this batch of medicinal incense. Hopefully, his blood would incite the blood qi of the enormous hand to produce shocking transformations!</p><br/><p>He slapped the side of the pill furnace, and a pungent smoke poured out, which he waved to the side. When he saw the finger-nail-sized chunk of white incense inside, he threw his head back and laughed uproariously.</p><br/><p>“This time it will definitely turn white!” He carefully picked the incense up to examine it closely. Although it was very small, it was actually more powerful than any of the other types of incense he had produced up to this point.</p><br/><p>In fact, not even the strength of all the previous chunks of incense added together could equal this one.</p><br/><p>“At long last, I will produce my pallid zombie!” he roared. Waving his hand, he sent the finger-nail-sized chunk of incense flying toward the corpse. It instantly shot through all the hair to land on the zombie’s forehead, where it began to burn, releasing a dense white smoke.</p><br/><p>The smoke spread out rapidly, and in response, Bai Xiaochun shot backward. At a certain point, it stopped expanding, but was so thick that nothing was visible inside of it. However, indescribably terrifying howls could be heard echoing out.</p><br/><p>Somehow, there even seemed to be a bit of joy within the howls.</p><br/><p>Bai Xiaochun was starting to get even more excited than before. Meanwhile, Xu Xiaoshan was in his room in the corpse refinery, looking very anxious as he stood in front of an old man, who was sitting there on one of the chairs in the room, staring at him coldly.</p><br/><p>The old man wore a voluminous gray robe that was embroidered with the image of a mountain peak. If you looked closely, it was none other than Corpse Peak. A vicious zombie face could be seen on the sleeve of the old man’s robe, which looked extremely realistic as he flicked his sleeve.</p><br/><p>The old man had disheveled hair, and his face was covered with scars, but he radiated an intense life force. Apparently, his true age was different than his appearance made him out to be.</p><br/><p>His cultivation base wasn't in the Gold Core stage, but he was at the very peak of Foundation Establishment, and in fact, was already in the quasi-Core stage. He was only a sliver away from reaching Core Formation.</p><br/><p>Xu Xiaoshan cleared his throat and hurriedly explained, “Grand elder, don’t I still have some time left? Don’t worry. I, Xu Xiaoshan, have been taking care of this corpse refinery for almost a year now. How could I not pay the spirit stones I owe? In three months, the first batch of zombies will be ready, and I’ll pay you back, both principal and interest!”</p><br/><p>He had never imagined that the grand elder of Corpse Peak would personally come to ask him about the expenses related to the corpse refinery.</p><br/><p>“Elder Xu,” the grand elder said, “I truly hope that you will do as you say. If the time comes and you don’t pay what you owe, it won’t matter that you have a patriarch backing you. I’ll still hold you accountable for the losses!”</p><br/><p>With that, Corpse Peak’s grand elder turned to leave.</p><br/><p>But then, the door suddenly slammed open, and a flustered young man burst in.</p><br/><p>“What gall!” Xu Xiaoshan barked, looking over with a grim face. Just when he'd managed to get the grand elder off his back, this flunky barged in to cause problems.</p><br/><p>However, even as his killing intent raged, he noticed how terrified the young man looked.</p><br/><p>“Young Lord, something really bad is happening!! Almost thirty percent of the corpse-refining blood serum has vanished, all at once!!” The ashen-faced young man seemed to on the verge of tears. He was responsible for keeping the records regarding the corpse-refining blood serum, and when he saw such a massive reduction, he wasn’t sure what to do. It was only when he finished speaking that he noticed that Young Lord Xu Xiaoshan wasn’t alone. The old man in the room seemed a bit familiar, and when he looked at him more closely, his mind suddenly began to reel.</p><br/><p>“G-g-grand Elder....”</p><br/><p>When Xu Xiaoshan heard what was happening, his scalp began to tingle so hard it felt like it might explode.</p><br/><p>“Thirty percent?!?!” he asked, eyes turning bloodshot. He immediately raced out to check the blood serum altar. As for the grand elder, he looked completely taken aback. Even at a critical point in the corpse-refining process, there would never be such a drastic loss in blood serum, not unless an incredibly powerful zombie were being produced.</p><br/><p>“A thirty percent loss?” he thought. Without hesitation, he burst into motion.</p><br/><p>Soon, Xu Xiaoshan was at the blood serum altar. There, a huge blood cistern could be seen with over a thousand channels leading out into different corpse caves. As soon as Xu Xiaoshan appeared, the disciples in charge of the altar looked over. Ashen-faced, they clasped hands in greeting.</p><br/><p>Xu Xiaoshan didn't even hear them talking. He stared down into the huge cistern, thinking back to the day before, when it had been mostly full. But now, half of that amount was gone....</p><br/><p>“How is this possible?!?!” he thought, beginning to tremble. The blood serum had to be purchased at significant cost, and what he was seeing in front of his own eyes caused his vision to begin to fade. But then, he watched as almost all of the remaining serum drained away, revealing the bottom of the cistern and leaving it completely empty....</p><br/><p>All of the blood serum could be seen flowing into one particular channel....</p><br/><p>“That leads to Nightcrypt’s corpse cave!!” Bursting with a murderous aura, he let out a howl of rage and sped away from the blood serum altar and toward Bai Xiaochun’s corpse cave.</p><br/><p>In that very corpse cave, Bai Xiaochun was watching as the white smoke began to clear. Heart bursting with joy, he was just about to take a step forward when suddenly, his face fell, and his eyes went wide with disbelief.</p><br/><p>“What’s going on!?!?” he said. He rubbed his eyes, not daring to believe what he was seeing. There within the white smoke were numerous green hairs, twisting and turning as they floated in the air.</p><br/><p>Some of them were actually boring into the walls of the cave.</p><br/><p>Bai Xiaochun felt his scalp tingling. He quickly opened his third eye and looked into the smoke. As of this moment, the cistern wasn’t even visible any more, nor was the corpse. All he saw was a huge, green hairball!</p><br/><p>The hair wasn’t just spreading out to fill the corpse cave; some of it had pierced into the walls, and was spreading out to who-knew-where.</p><br/><p>“Is that hair?” Bai Xiaochun thought, backing up as fast as possible, his mind spinning.</p><br/><p>In that very moment, cries of shock and alarm began to ring out from the more than one thousand other corpse caves.</p><br/><p>“What’s going on!?!?”</p><br/><p>“Heavens! What happened? What are these green strands!?!?”</p><br/><p>“Dammit! What are these green strands doing in my corpse cave!?!?”</p><br/><p>It was then that a massive rumbling sound rose up that could shake heaven and earth, filling the entire corpse refinery.</p><br/><p>The corpse caves began to collapse as green strands of hair raced in. Next, the green hair pierced into the bodies of the zombies that were still in the middle of being produced. Then, the hair on those zombies’ heads began to turn green, even the ones that already had white hair.</p><br/><p>But that was nothing. Some of the hair stabbed into the ground. It couldn’t go very deep though, so it would pop out of the ground some distance away before stabbing back in.</p><br/><p>Xu Xiaoshan watched in shock as the corpse refinery began to fall to pieces. Furthermore, the trees in the area were all starting to grow green hair as well, as were the rocks, plants, flowers, and other buildings. Everything was turning green.</p><br/><p>As the corpse refinery collapsed, more green hair appeared and spread out in all directions. Countless disciples appeared, fleeing with looks of shock and terror on their faces.</p><br/><p>“What is this stuff?! My refined corpse! I worked for two years on that thing! Now those green strands showed up and turned it green!!”</p><br/><p>“Who did this!?!?” As people began to cry out in madness, a look of terror appeared on Bai Xiaochun face. He flew out of the corpse cave, leaving behind an exploding mass of green hair.</p><br/><p>“Nightcrypt, what did you do!?” Xu Xiaoshan bellowed, shaking in anger.</p><br/><p>As soon as the words left his mouth, everyone in the area turned to look at Bai Xiaochun.</p><br/><p>Bai Xiaochun knew that, yet again, he had provoked a catastrophe. Heart pounding with fear, he let out a miserable shriek and then said, “What is that stuff? Dammit! Who did this? My refined corpse! I’ve been working hard on it for half a year!”</p><br/><p>Everyone around him stared at him in shock.</p><br/><p>“How dare you try to trick an elder like me! You’re dead!” Xu Xiaoshan’s eyes flickered with killing intent as he cackled in rage. Waving his hand, he sent the power of his Earthstring spiritual seas into motion. Tideflow power erupted out, along with a raging murderous aura. In the blink of an eye, deadly fluctuations were racing toward Bai Xiaochun.</p><br/><p>Not a single person did anything to prevent what was happening. As for the grand elder of Corpse Peak, he merely frowned.</p><br/><p>Bai Xiaochun’s face fell. He couldn’t simply reveal his true cultivation base, but if he didn’t, then based on Nightcrypt’s current level of power, this attack should kill him beyond the shadow of a doubt.</p><br/><p>However, even in Bai Xiaochun’s moment of terror, countless howls began to rise up from the corpse caves!</p><br/><p>Something very strange was happening!</p><br/>\n</div>"}