{"title": "Chapter 191: Rewards from Corpse Peak", "id": 191, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-191-rewards-from-corpse-peak", "volume_title": "Volume 2", "body": "<h1>Chapter 191: Rewards from Corpse Peak</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Green hair burst out from the corpse caves, from the ground, from the plants and trees, even from the rocks, swirling through the air to form a huge barrier in front of Bai Xiaochun, which blocked Xu Xiaoshan's attack.</p><br/><p>A huge boom echoed out, and countless green hairs were destroyed. However, Xu Xiaoshan’s attack was weakened significantly.</p><br/><p>Everyone in the area gasped, but then, before any cries of shock could ring out....</p><br/><p>Numerous figures shot out from the rubble of the corpse caves, howling as they flew to stand in front of Bai Xiaochun.</p><br/><p>One zombie after another appeared. They all looked different, and had different levels of power and different types of auras. However, there was one similarity between all of them, and that was that they had green hair!</p><br/><p>“Dammit! That’s <em>my </em>refined corpse!! Nightcrypt, I'm gonna kill you!”</p><br/><p>“Impossible! Why is my zombie protecting Nightcrypt?!?!”</p><br/><p>“What’s going on here!?!? Nightcrypt, are you looking to die?!?!” The crowd was in a complete rage. Many of them even pulled out their corpse-controlling jade slips, but they quickly found that they couldn’t exert any control over their corpses whatsoever.</p><br/><p>Xu Xiaoshan’s face was a mass of shock. His attack had been powerful, but there were now over a hundred refined corpses standing in front of Bai Xiaochun. Even if he had attacked with more power than he did, it still wouldn't have done any good.</p><br/><p>Rumbling sounds echoed out as a few dozen corpses exploded. Then, the deadly fluctuations faded away. Bai Xiaochun stood there stock still, as he had been the entire time, looking around blankly.</p><br/><p>More refined corpses were crawling out of the rubble of the corpse refinery. Soon, more than a thousand had gathered, clustered around Bai Xiaochun, all of them looking at Xu Xiaoshan and howling at the tops of their lungs.</p><br/><p>Earlier, everyone in the area had been crying out in shock, but now, they weren’t uttering even a single peep. As the disciples stared at the strange scene, they began to slowly back up, their scalps tingling with fear. The raging, murderous aura that erupted from the ranks of zombies left them completely and utterly shocked.</p><br/><p>Xu Xiaoshan almost couldn’t believe what he was seeing.</p><br/><p>As for the grand elder of Corpse Peak, he looked on with glaring eyes. After reaching Foundation Establishment, he had fought and struggled for years before finally becoming the grand elder of Corpse Peak, which he had presided over for more than a hundred years now. Considering how many refined corpses he had seen over the years, he believed himself to understand more about them than even some Core Formation cultivators.</p><br/><p>However, what he was seeing now, more than a thousand zombies all protecting Bai Xiaochun, caused his eyes to shine with intense light.</p><br/><p>“How is he doing this?!?!” he thought</p><br/><p>As for Bai Xiaochun, he stood there on the verge of tears.</p><br/><p>“I'm finished,” he thought. “Kaput. I destroyed the corpse refinery, and then for some reason all these corpses decided to ignore their own masters and protect me. It only took a moment for me to offend more than a thousand disciples. Is this gonna force me to abandon the sect? What do I do? What do I do...?”</p><br/><p>Bai Xiaochun was well aware that this was not the Spirit Stream Sect. This was the Blood Stream Sect, and he could only imagine what his punishment for this catastrophe would be. Maybe they would beat him to death!</p><br/><p>He could also sense the killing intent in the eyes of the surrounding disciples. However, it was at this point that, all of a sudden, the corpses behind him all howled, and then cleared a path.</p><br/><p>A tall, green figure appeared in the depths of the destroyed corpse refinery. As it strode forward, sharp claws could be seen, which glinted like razor-sharp blades. The bizarre-looking figure had green skin and protruding fangs which were terrifying to behold.</p><br/><p>It had a mass of green hair that was so long it was impossible to judge its length. Many of the hairs actually connected to other corpses, whereas some of it simply floated around in the area.</p><br/><p>Bai Xiaochun stared in shock as the green zombie walked forward to stand behind him, where it remained motionless, radiating a powerful, murderous aura.</p><br/><p>The surrounding disciples gasped yet again.</p><br/><p>“That green zombie is controlling the other zombies! I can’t believe it!!”</p><br/><p>“Heavens! How come I never knew about green zombies before? This is completely unprecedented!”</p><br/><p>“That green zombie is incredible! It’s only as strong as the seventh or eighth level of Qi Condensation, but look at how it can control all the other zombies! Simply terrifying!”</p><br/><p>Xu Xiaoshan was left gasping at the sight, and soon, his eyes were shining brightly. However, before he could say anything, laughter filled the air, and its source was none other than Corpse Peak’s grand elder.</p><br/><p>“Wonderful,” he said, sounding very excited. “Simply wonderful!” He blurred into motion, and a moment later, was standing right in front of the green zombie.</p><br/><p>Instantly, incredible pressure spilled out from him, causing all the surrounding zombies to tremble. However, they didn’t stop their howling. The grand elder didn’t seem to mind. He couldn’t stop looking at the green zombie, almost as if it were a gem. He seemed to be getting more and more excited.</p><br/><p>“You’re called Nightcrypt?” he asked, turning to look at Bai Xiaochun, the same look in his eye as when he had been looking at the zombie.</p><br/><p>Bai Xiaochun didn’t know who this person was, but he quickly put on a very serious expression. Clasping hands and bowing, he said, “Disciple Nightcrypt at your service. Greetings, Senior!”</p><br/><p>“Let’s call this an emerald zombie. Did you refine it? And how?”</p><br/><p>Bai Xiaochun blinked a few times. The truth was that he really didn't know exactly why the zombie refining process led to the zombie looking or acting this way. But he quickly recorded the formula he had used onto a jade slip, which he then handed over.</p><br/><p>After a moment of consideration, he performed a quick, secret test to see if he could connect mentally with the emerald zombie. Presumably, because the medicine contained some of his own blood, he could.</p><br/><p>In the hopes of reducing whatever his punishment might be, he also handed over the jade slip that could control the emerald zombie.</p><br/><p>Of course, he had already noticed the reactions of the other disciples upon seeing this old man, and how respectful their expressions became. Obviously, he was someone very important.</p><br/><p>The grand elder took the jade slips and looked them over. Eyes burning with passion, he laughed heartily, and then gazed at Bai Xiaochun with admiration.</p><br/><p>“Nightcrypt, I am the grand elder of Corpse Peak. You did a great job here. Splendid, really. You created a brand new type of zombie. I need to go back to study the method for some time to determine how to reproduce it. You have performed a great service for Corpse Peak!</p><br/><p>“So what if you destroyed a measly corpse refinery? They’re easily replaceable. Besides, you didn’t do it on purpose, and in the end, nobody was killed. Actually, even if you had accidentally killed some people, it would all have been in the service of the sect, and wouldn’t have mattered at all!</p><br/><p>“Elders, award him with 5,000 spirit stones and 30,000 merit points. Also, spread the word that anyone who dares to steal spirit stones from him will be considered my personal enemy!” Laughing excitedly, and eyes shining with praise, the grand elder turned and left with the emerald zombie.</p><br/><p>“Huh?” Bai Xiaochun stood there watching as the grand elder left. The surrounding disciples were all enraged, but could do nothing more than grit their teeth and disperse. They had all seen the encouraging look in the eyes of the grand elder. One of the Corpse Peak elders walked over to give Bai Xiaochun 5,000 spirit stones, and also transferred 30,000 merit points to his identification medallion.</p><br/><p>Although Xu Xiaoshan wasn’t very happy, he plastered a smile onto his face and hurried over to chat. From his wording, it was obvious that he hoped to get a copy of the formulas, so Bai Xiaochun magnanimously gifted him with one. After all, the formula was only in the early stages of development, and wasn’t really worth much.</p><br/><p>Xu Xiaoshan was delighted, and immediately gave Bai Xiaochun high marks on his mission assignment. Looking like he had just acquired a precious treasure, he hurried away.</p><br/><p>Bai Xiaochun looked at the emptiness around him, and the wreckage of the corpse refinery, and took a deep breath. He had been completely braced to be punished, only to have everything happen opposite of his expectations. All of a sudden, he realized that this place really was very different from the Spirit Stream Sect.</p><br/><p>“The Blood Stream Sect is great! The giant’s hand is connected to my cultivation, I can work on the Undying Heavenly King much more quickly here than anywhere else, and if I cause problems because of pill concocting, the sect doesn’t punish me, it rewards me!” He sighed. Obviously, if he had done this same thing and not produced that zombie, then the grand elder of Corpse Peak would have been incensed. Most likely, not even death would have been able to wipe away the offense.</p><br/><p>All the grand elder cared about was the result. As for what happened along the way, he didn’t care at all, not even what happened to bystanders!</p><br/><p>However, there was one thing Bai Xiaochun wasn’t sure about, and that was whether or not the attitude of the grand elder of Corpse Peak reflected the attitude of the entire leadership of the Blood Stream Sect. Or were there people who wouldn't tolerate him tormenting other disciples, regardless of the potential gains?</p><br/><p>Either way, the Blood Stream Sect was essentially a devilish sect that valued being straightforward and merciless!</p><br/><p>They didn’t believe that a person achieving their Dao could benefit everyone. They believed that success came only after climbing a mountain of bones!</p><br/><p>Sighing, Bai Xiaochun headed back toward his immortal's cave. Now that he had accomplished his mission, he simply had to wait for all the other disciples to do the same, and then he would be able to participate in the Foundation Establishment trial by fire.</p><br/><p>It was currently evening, and as he strolled through the sect, he happened to notice a huge stone stele off in the distance, roughly as tall as three people put together. A young woman was sitting cross-legged at the base of the stele, her hair and garments fluttering gently in the wind. There was something oddly appealing about her as she sat there.</p><br/><p>She wore a blood-colored mask, decorated with a plum blossom. As she looked off into the distance, a wistful, even melancholic expression could be seen in her eyes.</p><br/><p>Bai Xiaochun recognized her immediately. Lots of people in the sect gossiped about this very young woman, who was Young Lady Xuemei.</p><br/><p>As for the huge stone stele, it was oddly misshapen, as though it weren’t complete. The more he looked at it, the more he realized that it looked like a section of a wall. It was actually a place where disciples of the Blood Stream Sect would sometimes go to seek enlightenment, a location as famous as the Precipice of Never-Ending Blood. It was the Holy Pill Wall Fragment!</p><br/><p>Supposedly, people who sought enlightenment here could see a projection of someone concocting medicine. If they gained enlightenment, they would acquire a deeper understanding of the Dao of medicine. According to the story, the Blood Stream Sect had looted the wall from the Pill Stream Sect 10,000 years ago.</p><br/><p>Although the Blood Stream Sect didn’t have many apothecaries, 8,000 years ago, a genius arose within the sect. He created a mystical medicine called the Undying Blood Pill, which shook the entire sect. Of course, he accomplished all of that thanks to the wall fragment.</p><br/><p>Few people ever gained enlightenment from the Holy Pill Wall Fragment. Even imposter Nightcrypt had tried his hand at it, only to fail. As Bai Xiaochun walked by, he couldn’t help but glance at Xuemei and the wall.</p><br/><p>Xuemei seemed to sense him looking at her, and her eyes flashed beneath her mask. She looked over at Bai Xiaochun, radiating coldness and arrogance, as if she were a higher being, an immortal or a devil looking at an ant. Without saying a word, she turned and transformed into a beam of blood-colored light that shot toward Ancestor Peak.</p><br/><p>Being looked at in such a condescending fashion left Bai Xiaochun very angry. Xuemei was clearly far too arrogant for her own good.</p><br/><p>“What's so special about you, huh? Lord Bai is already at Heaven-Dao Foundation Establishment. If I showed my true face, you’d be scared to death!” Grumbling to himself, he stuck his chin up and flicked his sleeve. “One of these days, Bai Xiaochun will snap his finger and reduce you to ash!”</p><br/>\n</div>"}