{"title": "Chapter 200: Young Lady Xuemei, What A Coincidence...", "id": 200, "volume": 2, "url": "http://boxnovel.org/a-will-eternal-chapter-200-young-lady-xuemei-what-a-coincidence", "volume_title": "Volume 2", "body": "<h1>Chapter 200: Young Lady Xuemei, What A Coincidence...</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xuemei became a beam of light that shot through the night at astonishing speed, whistling through the air toward Middle Peak. Almost instantly, Middle Peak filled with echoing rumbles.</p><br/><p>Xuemei had always been a very domineering figure in the sect. That was simply how she acted, and others had always accepted that since her father was Patriarch Limitless.</p><br/><p>Xuemei had come to realize that years ago, and thus, always did everything in intentionally overbearing fashion. As she arrived, the rumbling in the lower finger of Middle Peak caused all of the Foundation Establishment Dharma protectors and elders to emerge from their immortal's caves. Shocked, they looked up to see Xuemei flying through the air.</p><br/><p>She whistled along, just barely visible within the blood-colored light that surrounded her. Anyone who looked closely might be able to see her eyes beneath her blood-colored mask, flickering with cold arrogance!</p><br/><p>Everyone was instantly shaken.</p><br/><p>“I can’t believe Young Lady Xuemei has returned to Middle Peak!”</p><br/><p>“Technically, she’s an elder of Middle Peak, but she doesn’t get along with Grand Elder Song Junwan, so she almost never appears here!”</p><br/><p>“Eee? Where is she headed...?”</p><br/><p>As people turned to look in the direction she was flying, they realized that there was a large accumulation of blood qi there. In fact, much of the blood qi on the mountain peak seemed to be slowly moving in that direction, causing a blood-colored light to illuminate the sky.</p><br/><p>All of the Foundation Establishment cultivators’ eyes flickered.</p><br/><p>“That’s where Young Lady Xuemei’s immortal's cave is. The blood qi....”</p><br/><p>“Could it be that Young Lady Xuemei has produced some valuable treasure?!”</p><br/><p>Everyone had their own speculations as they flew up into the air and headed toward the immortal's cave.</p><br/><p>At the moment, Bai Xiaochun was in the middle of absorbing the blood qi from inside the immortal's cave. As he did, his Undying Live Forever Technique rapidly built up power. His fleshly body grew stronger, and although he looked the same physically, he was getting more powerful by the moment.</p><br/><p>“The first level of the Undying Heavenly King, ten mammoths Berserk Ghost Body!” Bai Xiaochun excitedly focused on the sensation of his physical body getting explosively more powerful.</p><br/><p>Eight mammoths. Nine mammoths. Soon, he had reached the power level of ten mammoths!</p><br/><p>Bai Xiaochun’s mind filled with rumbling sounds, and cracking sounds rose up that only he could hear.</p><br/><p>At the same time, his flesh and blood exploded with tingling pain, almost as if freezing water were rushing through him. His body shook as the feeling spread out, filling him completely. He subconsciously took in another breath, and the tingling pain began to retract, slowly concentrating on one location in the pit of his stomach!</p><br/><p>There, it transformed into a boundless energy!</p><br/><p>That energy was formed from the intense trembling which wracked his entire body. At the same time, his flesh and blood became a vortex which madly sucked in all of the blood qi in the immortal's cave!</p><br/><p>The blood qi raced toward him like stampeding horses; even the blood qi outside of the immortal's cave began to rumble toward him!</p><br/><p>Bai Xiaochun was shaken, and even as he felt himself getting more and more powerful, a sensation of foreboding suddenly rose up in his heart.</p><br/><p>In the past, he had always controlled himself, and only absorbed a small amount of local blood qi. Moments ago, he had been attempting to absorb only the blood qi in the immortal's cave, which would have prevented any blood-colored light from rising into the air, thus making it very difficult for anyone to detect him.</p><br/><p>But now, the ten mammoths Berserk Ghost Body of the Undying Heavenly King had formed, and he had lost control. His body became a vortex, sucking in all of the blood qi, and causing blood-colored light to shine up visibly into the sky.</p><br/><p>He tried to stop it from happening, but was too late. As his body transformed, blood qi poured into him, and rumbling sounds echoed out in his mind. His body continued to tremble harder and harder, and his strength rose explosively.</p><br/><p>Soon, the power solidified. The strength of ten mammoths formed the Berserk Ghost Body!!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>Bai Xiaochun’s eyes opened wide, and the image of a berserk ghost appeared behind him. Although it was blurry, that was only because it was still in the process of taking shape. Within a few months, it would be incredibly clear.</p><br/><p>A sense of limitless power filled every inch of him, and yet, there was no time for him to revel in any excitement. He knew that the blood-colored light shining up into the air would surely attract attention.</p><br/><p>“The Blood Stream Sect people are too domineering! You even have to walk on eggshells when simply practicing cultivation!” He was really starting to get nervous, and was well aware that plenty of people in the Blood Stream Sect hated him already. If they found him here, they would be murderously enraged, and the consequences were too horrible to even contemplate.</p><br/><p>Just when he was about to flee, a beam of blood-colored light appeared, shooting down toward his location like lightning.</p><br/><p>In the blink of an eye, a young woman appeared in front of Bai Xiaochun. She wore a blood-colored gown and a mask of the same color, decorated with the image of a plum blossom.</p><br/><p>Xuemei looked into the immortal's cave with a blank expression. Never could she have imagined that someone in the Blood Stream Sect would dare to trifle with her.</p><br/><p>The mere idea of someone practicing cultivation right at the doorstep of her immortal's cave was completely outrageous, and she didn't know how to react. She couldn’t even think of anyone in the Lower Reaches of the cultivation world who would have the gall to do such a thing....</p><br/><p>She could sense that the blood bottle in her immortal's cave was already empty, and in fact, the blood qi had been drained from it so completely that the bottle was on the verge of shattering.</p><br/><p>That bottle had been at work for more than ten years, but had been completely drained in a single night. Even as she stood there, trembling and panting, the last bit of blood qi left the immortal's cave and entered Bai Xiaochun.</p><br/><p>Xuemei’s phoenix-like eyes radiated murderous coldness as she turned to look at him.</p><br/><p>“Young Lady Xuemei, what a coincidence....” Bai Xiaochun said, feeling a bit guilty. Seeing how furious she was, his first thought was to say that he was just passing by. However, all of the blood qi in the area was still rushing toward him because of his effort to reach the first level of the Undying Heavenly King, and there was nothing he could do to stop that. On the verge of tears, he could think of nothing else to do but change the topic.</p><br/><p>“This is your immortal's cave? Why don't we talk things over, I can compensate you....” Before he could say anything else, numerous figures appeared, which were the Foundation Establishment Dharma protectors and elders of Middle Peak’s lower finger. It only took a moment for them to sense the lowered levels of blood qi in the area, and see the strands of blood qi streaming into Bai Xiaochun.</p><br/><p>As they realized the implications of what they were seeing, they looked at Bai Xiaochun with murderous glares.</p><br/><p>“It was Nightcrypt! He's the reason why the blood qi has been in decline for the past few days....”</p><br/><p>“You’re the reason why I got hit by so many backlashes recently!!”</p><br/><p>“So this guy did it! Dammit, it was definitely him!”</p><br/><p>As their murderous gazes fell onto Bai Xiaochun, he began to shiver.</p><br/><p>“Um, hey there Brothers and Sisters. We're all on the same side here, how about I provide some compensation...?” Beads of sweat popped out on his forehead as he prepared to offer an explanation. Before he could, Xuemei lifted her chin, waved her sleeve, and pointed directly at Bai Xiaochun.</p><br/><p>“Kill him,” she said, her voice as cold as ice. She only spoke two words, but from those words it was possible to tell how coldly arrogant she was. It was almost like she had just ordered the death of an ant.</p><br/><p>When the surrounding Foundation Establishment cultivators heard her words, their killing intent spiked. Part of that was because of their trust in Xuemei’s ability to protect them, and part of it was because they had been driven mad because of the blood qi recently.</p><br/><p>Now that they knew who was responsible, how could they not want to kill him? In fact, even if Bai Xiaochun wasn’t actually responsible, he had to be connected to the matter in some way.</p><br/><p>Almost as soon as the words left Xuemei’s mouth, the entire group attacked at the same time. In the blink of an eye, numerous divine abilities and magical techniques appeared. Countless streams of blood-colored sword qi all shot toward Bai Xiaochun.</p><br/><p>Seeing himself being attacked by a whole group of Foundation Establishment cultivators left Bai Xiaochun’s scalp tingling so hard it felt like it would explode. Even with the first level of the Undying Heavenly King, he could do nothing but flee in the face of such an attack.</p><br/><p>“You people are all bullies!” he shouted defiantly. “If you think you’re tough, why don’t you fight me one-on-one!?”</p><br/><p>Bai Xiaochun was already scared witless; clearly these people really were trying to kill him!</p><br/><p>“Outrageous! It's just a bit of blood qi, isn’t it? I'm a Foundation Establishment cultivator of the Blood Stream Sect! I can’t believe you people are trying to kill me! Are you trying to force me out of the sect!?” Trembling and screaming, he sped away from the countless divine abilities and magical techniques. In his mind, Xuemei really was being too domineering; he'd even offered compensation, but all she did was wave her sleeve and stick her chin up into the air. That was his trademark!</p><br/><p>Booms filled the darkness of night as the entire lower finger of Middle Peak erupted into chaos. Numerous Foundation Establishment cultivators all flew after Bai Xiaochun, killing intent raging.</p><br/><p>However, Bai Xiaochun sped along as fast as a rabbit whose tail had been stepped on.</p><br/><p>“They’re trying to kill me! Help....” Feeling completely maligned, he picked up speed as more and more people joined the chase.</p><br/><p>The only one who didn't was Xuemei. Gritting her teeth, she walked into her immortal's cave to examine the blood bottle. After a moment, she suppressed her killing intent and adjusted the spell formation to make sure that the bottle wouldn’t break because of the lack of blood qi.</p><br/><p>Meanwhile, the entire lower finger was in an uproar, and Bai Xiaochun’s screams rose up into the air, joined by shouts of rage.</p><br/><p>“How can this guy run so fast!?”</p><br/><p>“I'm going to cut him into a million pieces!!”</p><br/><p>“Nightcrypt, I, Master God-Diviner, won’t stop until you’re dead!”</p><br/><p>Despite how the Foundation Establishment cultivators gave chase, Bai Xiaochun was too fast, and Middle Peak was too big. He raced back and forth for a full two hours, until he finally managed to shake all of the Foundation Establishment cultivators.</p><br/><p>“He’s hiding somewhere!”</p><br/><p>“Yeah, but he can't hide forever....”</p><br/><p>“Don’t worry, I, Master God-Diviner, might be injured, but I can still take the risk to divine his location!” Gritting his teeth, Master God-Diviner snorted coldly and began the process of divining Bai Xiaochun’s location.</p><br/><p>After a moment passed, his eyes turned even more bloodshot than before, and he suddenly pointed off into the distance. As he did, a blood-colored butterfly flew out of the tip of his finger, which the enraged crowd began to follow.</p><br/><p>At the moment, Bai Xiaochun was hiding in a relatively remote immortal's cave, scowling and sighing.</p><br/><p>“I didn’t know that was Xuemei’s immortal's cave! I thought it was vacant, and just didn't want it to go to waste. I didn't do it on purpose.” He wanted to fight back, but considering how many people were angry at him, he knew he couldn’t. It was at that point that a blood-colored butterfly suddenly appeared in front of him. Without any hesitation, he burst off at top speed.</p><br/><p>As he did, the space where he had just been standing was blasted by countless magical techniques and divine abilities. If he had been even a bit slower, he would definitely have been injured.</p><br/><p>Numerous Foundation Establishment cultivators were in the area, and although some of them were of a mind to block his path, he was too quick, and sped away.</p><br/><p>Once again, another big chase ensued on Middle Peak.</p><br/><p>An hour later, and the crowd had once again lost him. Master God-Diviner’s right hand flashed with an incantation gesture, and a blood-colored butterfly once again sought out Bai Xiaochun.</p><br/><p>“Nightcrypt won’t escape. How could he possibly evade my divination magic!”</p><br/><p>Over and over again, Bai Xiaochun came to find that no matter where he hid, the blood-colored butterfly would find him, and the enraged Foundation Establishment cultivators would be close behind.</p><br/><p>Eventually, he heard Master God-Diviner speaking, and realized that it was his auguries that were revealing his location. That left Bai Xiaochun grumbling in frustration, and yet, there was nothing he could do about it. Although imposter Nightcrypt had studied some divination magic before, he was a novice, and had no idea how to deal with Master God-Diviner.</p><br/><p>“These people are all villains! The Spirit Stream Sect is way better. Even with lightning and acid raid, all they did was throw some rocks. But here, the tiniest things gets them all fighting and killing! What bullies!” Sighing, Bai Xiaochun thought about how much he missed the Spirit Stream Sect.</p><br/>\n</div>"}