{"title": "Chapter 215: Divination With The Snap Of A Finger!", "id": 215, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-215-divination-with-the-snap-of-a-finger", "volume_title": "Volume 3", "body": "<h1>Chapter 215: Divination With The Snap Of A Finger!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"background-color: initial; font-size: 0.875rem\">Even as Bai Xiaochun was staring in shock at Lu Tianlei, he heard Song Junwan mention his name, and his ears twitched.</span></p><br/><p>He wasn’t the only one. The other cultivators from the Blood Stream Sect went completely silent and looked over at Song Junwan. Bai Xiaochun was completely infamous in the Blood Stream Sect. Not only had he stolen heavenstring energy from Song Que, he had slaughtered countless of their fellow disciples in the Fallen Sword Abyss. For these and other reasons, he was a very important figure who was quite well-known.</p><br/><p>“Grand Elder Song, your timing is a bit off,” Xu Meixiang said sadly. “Junior Brother Bai is currently in secluded meditation.”</p><br/><p>Song Junwan smiled. Shaking her head, she sighed wistfully and said, “I heard Bai Xiaochun is a mysterious and enigmatic figure, a unique genius. What a pity that I won’t be able to meet him.”</p><br/><p>Her good looks combined with her display of emotion made her seem extraordinarily attractive. Although Xu Meixiang was gorgeous in her own way, she seemed almost average in comparison to Song Junwan.</p><br/><p>The crowd from the Blood Stream Sect were well aware of how terrifying Song Junwan could be, so they quickly bowed their heads. However, the Spirit Stream Sect cultivators hadn’t been prepared for Song Junwan’s beauty, and couldn’t help but look over at her, somewhat dazed. Lu Tianlei’s eyes shone especially brightly.</p><br/><p>Xu Meixiang’s eyes glittered as she said, “Grand Elder Song, with a natural born charmer like you in the sect, how do Blood Stream Sect disciples on Middle Peak ever focus on cultivation?”</p><br/><p>Her words instantly shook the Spirit Stream Sect cultivators out of their reveries.</p><br/><p>Bai Xiaochun sighed. Feeling more proud than ever, he suddenly wished he could rip off his mask and tell the vixen Song Junwan, “Enough with your scheming, Song Junwan! Lord Bai is right here!”</p><br/><p>He looked over a bit contemptuously at Lu Tianlei, who still seemed to be partially in a daze. Then he congratulated himself on his wisdom of getting Song Junwan to change clothes. If she had worn the smoking hot outfit she used to wear, Lu Tianlei would likely have coughed up mouthfuls of blood.</p><br/><p>Even as Bai Xiaochun sighed inwardly, Song Junwan covered her mouth with her hand and laughed lightly. Seemingly unaware of the sarcasm in Xu Meixiang’s words, she looked over at the south bank of the Spirit Stream Sect and said, “I heard that Bai Xiaochun started out on Fragrant Cloud Peak. Peak Lord Xu, do you think it would be possible to go take a quick tour?”</p><br/><p>Xu Meixiang had no reason to refuse. In fact, her mission was to show the Blood Stream Sect people around. With a nod, she led them toward Fragrant Cloud Peak.</p><br/><p>As they neared, a beam of light flew toward them, within which was a young woman. She wore a long blue gown, and was exceptionally good-looking. She almost looked like a celestial goddess. She was none other than Zhou Xinqi.</p><br/><p>Many of the Blood Stream Sect disciples recognized her, and their expressions turned very serious.</p><br/><p>“Greetings, peak lord,” she said calmly, hands clasped respectfully. Then she looked over at the people from the Blood Stream Sect.</p><br/><p>Xu Meixiang smiled and said, “Xinqi, this is Grand Elder Song Junwan from Middle Peak in the Blood Stream Sect. Would you mind showing us around Fragrant Cloud Peak?”</p><br/><p>Zhou Xinqi nodded, then led the group onward.</p><br/><p>They started at the foot of the mountain, taking a route that had already been planned out in advance by the sect. Everything that the Blood Stream Sect was able to see had been specially arranged by the Spirit Stream Sect for certain reasons.</p><br/><p>Even the disciples who they encountered along the way had been placed there by special arrangement.</p><br/><p>Bai Xiaochun looked around at Fragrant Cloud Peak, at all the plants and trees, at Zhou Xinqi as she led them along, and sighed inwardly.</p><br/><p>“I, Bai Xiaochun, really have become too famous. Everybody has heard about me. Even Song Junwan came from far, far away just to meet me. Ai. I really need to keep a lower profile. Being famous is really annoying.”</p><br/><p>He sighed the whole way. Eventually, about halfway through the tour, Song Junwan frowned slightly and said, “Peak Lord Xu, Fellow Daoist Zhou, since Heaven-Dao Foundation Establishment expert Bai Xiaochun started out on Fragrant Cloud Peak, do you think it would possible for us to take a look at his old immortal's cave?”</p><br/><p>Zhou Xinqi frowned and looked at Xu Meixiang. Xu Meixiang’s eyes glittered, and she returned Song Junwan’s gaze with a smile.</p><br/><p>“I've heard of someone from Middle Peak in the Blood Stream Sect,” she said, “someone called Master God-Diviner, an expert in consulting the heavens. Considering the excellent reputation of this Fellow Daoist, what do you say we let him perform some divinations to locate the immortal's cave of my Junior Brother Bai?”</p><br/><p>Xu Meixiang looked over at Master God-Diviner.</p><br/><p>Master God-Diviner’s expression was cold and aloof, and inwardly he was feeling very proud of himself.</p><br/><p>Song Junwan’s eyes narrowed slightly, but after some thought she turned to Master God-Diviner and nodded.</p><br/><p>Master God-Diviner cleared his throat, reminding himself that this was his chance to shine, and that he had to take advantage of it. He had to show off his abilities to the fullest extent.</p><br/><p>“I might not have powerful combat magic, but when it comes to divining things from the heavens, I'm the best there is, and nobody even dares to call themselves second in line to me!” Glancing contemptuously over at Bai Xiaochun, Master God-Diviner took a few steps forward. As everyone from both the Spirit Stream Sect and the Blood Stream Sect looked on, he lifted his right hand and performed an incantation gesture.</p><br/><p>At the same time, his eyes seemed to flicker with the shining light of augury. Muttering to himself, his hand flashed faster and faster, and images seemed to be flickering through his eyes. But then a mist seemed to cover his eyes, making it impossible for him to see clearly.</p><br/><p>“So, it’s protected by a spell formation!” Master God-Diviner said, chuckling coldly. Apparently he was prepared for this. Slapping his bag of holding, he produced a gray chunk of bone that radiated the power of Time. Pressing down hard onto the piece of bone, he performed more auguries.</p><br/><p>Gray wisps of smoke rose up from the bone, which Master God-Diviner breathed in. Off to the side, Xu Meixiang and everyone else was watching with bated breath.</p><br/><p>Master God-Diviner’s face slowly turned very pale, and beads of sweat popped out on his forehead. Moments later, his eyes opened wide; to his surprise, none of his efforts so far had produced any results. Not even his ancient chunk of bone was capable of penetrating the Spirit Stream Sect’s terrifyingly powerful spell formation. It was so strong that it resisted all intrusive augury magics.</p><br/><p>In fact, he could tell that if he performed any further auguries, he would be hit with a backlash that would severely drain him mentally, and potentially even wither him to the point of death. Not daring to continue any further, he gave up. Eyes flashing, he looked over at Bai Xiaochun, who seemed to be enjoying the show.</p><br/><p>Killing intent rose up inside of Master God-Diviner. Stepping back, he turned to Song Junwan and clasped hands formally. “Along the way here, Junior Brother Nightcrypt said that he knows everything about the starry sky and the Yellow Springs. He said that he could wave his sleeve and figure out everything there is to know. Although I, Master God-Diviner, cannot determine the location of Bai Xiaochun’s immortal's cave here on Fragrant Cloud Peak, perhaps Junior Brother Nightcrypt can divine its location. With his immortal divination magic, he will surely be able to succeed with little effort. Isn’t that right, <em>Junior Brother Nightcrypt</em>?”</p><br/><p>With that, he stared coldly at Bai Xiaochun.</p><br/><p>Bai Xiaochun was a bit taken aback. He had merely been enjoying the show, and had never imagined that the shameless Master God-Diviner would pull him into the matter after his own failure. Master God-Diviner’s pale, sweaty face made it clear how difficult, and even dangerous, it would be to perform auguries here.</p><br/><p>Xu Meixiang looked over curiously at Bai Xiaochun. Zhou Xinqi’s gaze was ice cold, and the others from the Spirit Stream Sect had very serious looks on their faces. As for the group from the Blood Stream Sect, all of them seemed very interested in what would happen next.</p><br/><p>Song Junwan frowned, and was about to say something when Master God-Diviner laughed coldly and said, “Junior Brother Nightcrypt, on the way here you said you knew everything about everything. What’s wrong? Too scared to perform auguries now? Could it be that everything you said before was mere boasting? If you can divine the location of Bai Xiaochun’s immortal’s cave, then I, Master God-Diviner, will gracefully concede defeat. In fact, I’ll even bow to you as an inferior!”</p><br/><p>In response to Master God-Diviner’s words, silence reigned.</p><br/><p>The Spirit Stream Sect seemed pleased to see the infighting between members of the Blood Stream Sect, especially between two famous individuals like Nightcrypt and Master God-Diviner. As far as they were concerned, it was a good thing.</p><br/><p>On the Blood Stream Sect side, they were just as willing to see Nightcrypt make a fool of himself. That was especially true considering how Master God-Diviner had worded things, which ensured that none of them would say a single word to intervene.</p><br/><p>Song Junwan’s eyes narrowed further. She was not happy at all about what Master God-Diviner was doing, and it caused her eyes to shine with cold light.</p><br/><p>Seeing everyone looking at him, Bai Xiaochun blinked. How could he not know the location of his own immortal's cave? Furthermore, it wouldn’t hurt at all to take everyone over to see it; there was nothing inside to look at anyway, considering it had long since been reduced to ruins.</p><br/><p>Therefore, he proudly stuck his chin up and looked contemptuously over at Master God-Diviner. Clearing his throat, he took a few steps forward and coolly said, “Fine. I, Nightcrypt, have always preferred to keep a low profile. I was never interested in revealing my true skills and abilities here in the Spirit Stream Sect. After all, once I do, it will surely lead to countless headaches.</p><br/><p>“However, since Master God-Diviner is taking things so seriously, then I guess I have no choice than to perform some divination!” Waving his sleeve, his eyes began to show with a profound light, and he seemed to seethe with explosive energy.</p><br/><p>His hair suddenly whipped about in the air, but instead of performing incantation gestures or muttering to himself, he simply closed his eyes and raised his hands into the air. It almost seemed as if he were communing with heaven and earth, becoming one with the world around him.</p><br/><p>The sight caused Master God-Diviner to chuckle coldly under the belief that Bai Xiaochun was simply trying to dazzle everyone with meaningless tricks.</p><br/><p>“I couldn’t detect even the slightest fluctuations,” he thought. “What makes you think you can divine anything?!”</p><br/><p>One breath of time after another passed. After about twenty, Master God-Diviner’s smile grew even colder, and the surrounding cultivators were starting to feel a bit skeptical. But then, Bai Xiaochun’s eyes snapped open, and they shone with bright, mysterious light. Without any hesitation, he pointed off into the distance. “There! Follow me!”</p><br/><p>Striding forward, he led the crowd through Fragrant Cloud Peak until they reached a location that seemed to be nothing more than a pile of rubble.</p><br/><p>“This is Bai Xiaochun’s immortal's cave!” he declared proudly, his voice so decisive that it could sever nails and chop iron.</p><br/><p>“Are you joking!?” Master God-Diviner said in a bitingly cynical voice. “This pile of rocks is Bai Xiaochun’s immortal's cave?” Even as he began to laugh coldly, he suddenly felt as if something were off. Looking around at the Spirit Stream Sect cultivators, his eyes widened.</p><br/><p>Zhou Xinqi’s jaw had dropped, and Xu Meixiang was gasping. Big Fatty Zhang trembled visibly, and the other Spirit Stream Sect cultivators seemed equally taken aback. All of them were looking at Bai Xiaochun, their eyes shining with indescribably bright light. Obviously, they were surprised, shaken even, by the enigmatic performance of Nightcrypt.</p><br/><p>That was especially true of Zhou Xinqi and Xu Meixiang. They were familiar with the workings of the spell formation, and couldn’t imagine how powerful a divination magic would have to be to penetrate it.</p><br/><p>When the Blood Stream Sect people saw the expressions on the faces of the Spirit Stream Sect cultivators, they realized that Nightcrypt had correctly divined the location of Bai Xiaochun’s immortal's cave. Instantly, their hearts swelled with shock. Although most Blood Stream Sect cultivators could perform a bit of divination magic, most of them were complete novices. It was rare for someone like Master God-Diviner to come along who could master the arts. And yet, Nightcrypt had just completely crushed Master God-Diviner. It was a completely shocking turn of events.</p><br/><p>Song Junwan was equally stunned. Looking over at Bai Xiaochun, her expression grew more complex than before. Never could she have imagined that he would actually successfully perform the divination.</p><br/><p>Master God-Diviner was flabbergasted, and began to tremble in disbelief. “Impossible. This is impossible....”</p><br/>\n</div>"}