{"title": "Chapter 210: Grand Elder, Please Behave Yourself!", "id": 210, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-210-grand-elder-please-behave-yourself", "volume_title": "Volume 3", "body": "<h1>Chapter 210: Grand Elder, Please Behave Yourself!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun sighed and looked down at his immortal's cave, pondering his miserable existence. Since arriving in the Blood Stream Sect, he’d had two immortal's caves destroyed.</p><br/><p>“These people are savages! One slip of the tongue and they destroy your immortal's cave!” Shaking his head, he looked over furiously at the blood trees.</p><br/><p>The blood trees had been completely useless; they’d been so scared that they didn’t even offer a warning. Now that he was glaring at them, they were shivering and attempting to look as ingratiating as possible.</p><br/><p>Bai Xiaochun was not in a good mood. After glaring at the trees well and good, he warned them that if something like this happened again, he would tear them up by the roots once and for all. After the trembling trees promised that they would behave better in the future, Bai Xiaochun finally let them off the hook.</p><br/><p>It took the rest of the night to clean up the mess that was the remains of his immortal's cave. Around dawn, he used spiritual power to repair some of the damage, and then used the rest of the day to recover.</p><br/><p>As he sat there cross-legged in the immortal's cave, he thought about the situation, and came to the conclusion that Xuemei probably wouldn't come back for him any time soon. As long as he stayed on the mountain, he shouldn’t have any trouble.</p><br/><p>“Just wait until I get that relic of eternal indestructibility!” he said, snorting coldly. “Then I’ll show that hussy Xuemei how awesome I really am!” Then he thought about all the secrets he'd heard, and was suddenly worried again.</p><br/><p>“It should be fine, right…?” he thought, trying to comfort himself. However, three days later, he happened to hear that a random disciple had been summoned by the grand elder, and had been punished severely for no apparent reason. Bai Xiaochun immediately started to get more nervous.</p><br/><p>From what he remembered, that disciple had been one of the group who heard all of the secrets.</p><br/><p>Another day went by, and Bai Xiaochun heard about a disciple who had somehow provoked Xuemei. Apparently, she had punished him by tossing him into Blood Prison. Bai Xiaochun began to pant in shock.</p><br/><p>“I'm finished. Kaput. The shrews are starting to tie up all the loose ends!” Bai Xiaochun anxiously tried to get more information about what was happening. During that time, he heard plenty of rumors about cultivators being imprisoned by Xuemei or dispatched by the grand elder to the Profound Stream Sect or Pill Stream Sect on spy missions....</p><br/><p>Most unbelievable was a tale about one of the cultivators who was summoned to the upper finger for an audience with the grand elder, and then was suddenly killed.</p><br/><p>“That cultivator must have been a complete idiot,” Bai Xiaochun thought. After hearing everything that was happening with the cultivators who had heard the secrets, Bai Xiaochun trembled with fear. He even thought about simply fleeing, but couldn’t bring himself to do so.</p><br/><p>“It wasn’t my fault that I heard that stuff! Ai.” He didn’t want to hear the secrets of Xuemei’s past, or know how many people Song Junwan had been in relationships with!</p><br/><p>After a few more days passed, no more stories popped up about people being punished, and Bai Xiaochun started to relax.</p><br/><p>The next day, as he was in the middle of cultivating the Undying Live Forever Technique, his expression flickered, and he suddenly turned his head. Outside of his immortal's cave, a cold voice suddenly rang out, “Nightcrypt, the grand elder has requested your presence.”</p><br/><p>As soon as Bai Xiaochun heard that, his heart seized. Trembling in fear, he opened the door a crack to look at the person outside.</p><br/><p>Beyond the trembling blood trees stood an old man wearing a blood-colored robe decorated with complex golden designs. He had his hands clasped behind his back, and from the fluctuations of his cultivation base, he was in the late Foundation Establishment stage.</p><br/><p>When Bai Xiaochun saw the blood-colored robe and the golden designs, he knew exactly who this person was. He occupied a position second only to the grand elder, and definitely much higher than Dharma protectors or regular elders. He was a bloodstreak elder! “A bloodstreak elder! C-could he be here to silence me?!”</p><br/><p>Usually there were ten or so bloodstreak elders on every mountain, and they cooperated with the grand elder to maintain order.</p><br/><p>Bai Xiaochun looked like he was about to cry. His mind replayed all of the stories he'd heard about the cultivators who had been punished over the past weeks, and he got so nervous that his face went pale.</p><br/><p>“What do I do? What do I do!?”</p><br/><p>The bloodstreak elder was starting to get impatient, and called out, “Nightcrypt, what's with the dillydallying? I’ll give you three breaths of time to get out here!”</p><br/><p>Grimacing, Bai Xiaochun hesitated for a moment, but finally realized there was nothing he could do. Gritting his teeth, he walked out of the immortal’s cave. The bloodstreak elder glared at him, clearly displeased with Bai Xiaochun’s slowness. With a cold snort, he led the way toward the upper finger.</p><br/><p>Bai Xiaochun followed along, mind racing with plans for how to deal with the situation. His nervousness only continued to mount as he followed the bloodstreak elder to Song Junwan’s immortal's cave.</p><br/><p>The grounds were expansive, and covered with blood-red roses that filled the air with a fragrant aroma. Nine blood waterfalls could be seen in the area, which poured into a blood lake. A stone path led across the lake to the area behind the waterfalls, where a mysterious immortal's cave was located.</p><br/><p>Only after passing through the waterfalls would one be able to actually see the door of the immortal's cave, which was pitch black. Four young attendants stood there silently on guard. Within the waters of the blood lake, it was possible to see strange fish swimming about. When they occasionally leaped out of the water, vicious teeth and spined fins could be seen before they splashed down out of sight.</p><br/><p>“Go in, the grand elder is waiting for you,” the bloodstreak elder said coolly. Then he sat down cross-legged off to the side.</p><br/><p>Bai Xiaochun looked around nervously. Of course, it wasn’t lost on him that this location was his ultimate goal in the Blood Stream Sect. The relic of eternal indestructibility was located beneath this very immortal's cave.</p><br/><p>Sighing, he walked carefully along the path, his heart pounding in his chest. Eventually, he passed through the waterfalls, and was in front of the door.</p><br/><p>The four young attendants looked at him coldly, but didn’t say anything.</p><br/><p>Bai Xiaochun gritted his teeth, and tried to convince himself that the patriarchs knew who he was, so if Song Junwan wanted to make a move against him, they would surely intervene. After all, he had already accomplished an Inverse Blood Ancestral Awakening!</p><br/><p>Clearing his throat, he clasped hands and bowed.</p><br/><p>“Nightcrypt is here to offer greetings, Big Sis Song.”</p><br/><p>Song Junwan’s voice drifted out from the immortal's cave in response. “Come in.”</p><br/><p>Her voice sounded as lovely as ever to Bai Xiaochun, but there also seemed something vaguely sinister about it. Having no other choice, he braced himself, pushed open the door, and entered.</p><br/><p>A delicate fragrance met him as he stepped into the luxuriously decorated immortal's cave. Glowing pearls were inlaid in the ceiling, while the floor was green and scintillated like a gem. There was strong blood qi, as well as abundant spiritual energy, so much so that it made everything a bit hazy.</p><br/><p>It was impossible to say how many side rooms there were, but the grand hall in the middle had a hot spring, from which steam rose up into the air. Floating there in the water was a woman, her body just barely visible underneath the surface. She almost looked like a mermaid as she swayed back and forth, her curves so prominent that Bai Xiaochun’s tongue immediately stuck to the roof of his mouth.</p><br/><p>“Vixen!” he thought. “Don’t even think of making a pass at Bai Xiaochun! You can't fool me. This is obviously a trap. If I stare at you, you’ll accuse me of offending you!” Gritting his teeth, he forced his gaze down, refusing to look at her.</p><br/><p>“Come on in!” Song Junwan said. Bai Xiaochun walked forward, head bowed, until he was at the edge of the water. At that point, it became impossible to look down, so instead, he looked up to study the glowing pearls overhead. Expression somber, he could just barely see her body out of the corner of his eyes. Heart trembling, he yet again cursed the vixen....</p><br/><p>Song Junwan could see what he was doing, and chuckled flirtatiously. Then, the sound of rippling water could be heard as she swam to the edge of the hot spring and stepped out. Draping a blood-red bathrobe over herself, she walked over to Bai Xiaochun, then reached out with her jade-like finger and tugged his chin down.</p><br/><p>“What's wrong, Little Bro Nightcrypt? No lewd stare for me today?” Her breath smelled like an orchid, and considering how close she was, it was impossible for him not to see her milky white skin. It was a very enticing scene, something almost impossible to describe with words. Anyone who laid eyes on her in this situation would surely be struck mute.</p><br/><p>Her eyes sparkled like spring rain, and were both profoundly deep and endlessly charming. It almost seemed like looking into them would leave a man eternally lost within their depths, unable to think, unable to free himself.</p><br/><p>Song Junwan slowly leaned over and blew gently into Bai Xiaochun’s ear, and her hot breath made him shiver all the way down to his bones and even his soul.</p><br/><p>He almost couldn’t take it. He shivered under the intense stimulation, and even started to pant. By this point his eyes were completely bloodshot. Song Junwan appeared to be smiling, and yet, there was something disdainful and cold in her eyes. Just when she seemed to be on the verge of saying something else….</p><br/><p>Bai Xiaochun took a few steps back. Instead of looking up at the ceiling, he stared directly into her eyes. His own eyes were bloodshot, his face distorted almost as if with pain.</p><br/><p>“Grand elder,” he said, almost growling, “please behave yourself!” A look of disappointment appeared in his eyes, something like bitter heartbreak. He almost seemed like he couldn’t believe what he was seeing. Song Junwan, who had been on the verge of speaking, suddenly stared back at him in shock, and the coldness in her eyes vanished.</p><br/><p>“Grand elder, in my heart, you are holy, like the moon in the sky, eternally sacred, so beautiful that even someone who spotted you from afar would be envious.” He looked hurt, and although his words were spoken softly, they filled the whole immortal's cave.</p><br/>\n</div>"}