{"title": "Chapter 214: I'm Back....", "id": 214, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-214-im-back", "volume_title": "Volume 3", "body": "<h1>Chapter 214: I'm Back....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun could do nothing more than glare one final time at Master God-Diviner, and then begrudgingly stand up and walk over to the grand elder. Further up ahead, the Song Clan patriarch sat there, his back straight, radiating the sensation of a vicious wild beast. Bai Xiaochun couldn’t help but sweat and get even more nervous than before.</p><br/><p>“Big Sis Song, you look really pretty today!” he said quickly. The two bloodstreak elders sitting nearby looked over with strange expressions on their faces. Even the Song Clan patriarch seemed surprised, and frowned.</p><br/><p>Song Junwan blushed slightly, then glared at Bai Xiaochun. “Enough with the smooth talk. Sit down and be quiet.”</p><br/><p>Bai Xiaochun was growing increasingly confused by Song Junwan’s odd behavior. It was very different than how she had acted three days ago. After much thought, he still couldn't come up with any reasons why she would be behaving in such a way. Finally, he just sat there looking around, and occasionally glancing down at the ground.</p><br/><p>Soon, he saw a boundless mountain range down below. From this vantage point, the towering mountain peaks seemed to make up a spell formation.</p><br/><p>“The Luochen Mountains....” he thought. This was the area that lay between the Blood Stream Sect and the Spirit Stream Sect. More accurately, it was the border of Spirit Stream Sect territory. “I can't believe we got here so quickly.”</p><br/><p>Shocked, he looked down at the blood cloud. As it sped through the Luochen Mountains, powerful fluctuations seemed to rise up from the mountains, surrounding the blood cloud, locking down onto it, and following it as it proceeded along.</p><br/><p>Clearly, the Spirit Stream Sect was in control of the Blood Stream Sect’s movements now. The Song Clan patriarch’s expression was the same as ever as he sat there meditating. Bai Xiaochun thought about it for a moment, and came to the realization that the Blood Stream Sect’s diplomatic mission must have come about only after initial communications with the Spirit Stream Sect.</p><br/><p>As the blood cloud sped along, Bai Xiaochun watched the familiar scenery speeding past. He saw a huge giant, a roc-like bird, and an enormous crocodile splashing in the Heavenspan River, only half of its gigantic body visible.</p><br/><p>When the gigantic creatures saw the blood mist, they shied away from it, as though it contained some powerful entity that terrified them.</p><br/><p>Shocked, Bai Xiaochun looked over at the Song Clan patriarch. However, he didn't say anything. The familiar scenery whizzed by, and soon they were closing in on the Spirit Stream Sect. Bai Xiaochun’s heart instantly leapt.</p><br/><p>Even as Bai Xiaochun reveled in his excitement, Song Junwan’s voice drifted into his ears. “I heard that you had quite a few girlfriends in the Blood Stream Sect over the years. Is that true?”</p><br/><p>Her voice was cold enough to pierce his bones, like a chill air that left Bai Xiaochun shivering. He looked over in shock at Song Junwan, who simply snorted coldly. Rising to her feet, she ignored Bai Xiaochun as she walked over to confer with the Song Clan patriarch.</p><br/><p>The bloodstreak elders did the same thing, and suddenly, Bai Xiaochun’s anxiety increased. Feeling more wronged than ever, he now realized why Song Junwan had treated him so coldly.</p><br/><p>“It’s only been three days, and that shrew actually did a background check on me!?” Sighing in his heart, he thought back to the romantic escapades of imposter Nightcrypt, who hadn't even been able to accurately recount how many there had been....</p><br/><p>Before long, the blood cloud began to slow down, and the Spirit Stream Sect spread out in front of their eyes. The Blood Stream Sect disciples rose to their feet, radiating brutality and power as they looked coldly at the Spirit Stream Sect.</p><br/><p>At the same time, pillars of light shot up from the eight mountain peaks of the Spirit Stream Sect, creating an enormous vortex in the sky. Deafening rumbles echoed out as heaven-shaking, earth-shattering energy surged. The south and north banks of the Spirit Stream Sect both erupted with power, making heaven and earth seem like a raging sea filled with towering waves.</p><br/><p>Within the vortex, an eye appeared, which radiated boundless pressure as it stared at the Song Clan patriarch on the blood cloud.</p><br/><p>The people from the Blood Stream Sect became like rowboats on a stormy sea, hovering on the verge of collapse because of the surge of energy of heaven and earth. Their faces flickered, except for that of the Song Clan patriarch, whose expression remained calm the entire time.</p><br/><p>Slowly, his eyes opened, and in that instant, two beams of explosive light shot out. Mountain-toppling, sea-draining power spread out, and as the patriarch rose to his feet, he flicked his sleeve and took a step out into midair.</p><br/><p>When his foot landed, he was in front of the heavenly vortex up above. Apparently, he was single-handedly resisting the boundless power therein!</p><br/><p>A white-robed, middle-aged man stepped out from the turbid eye in the middle of the vortex. Clasping hands, he smiled and said, “Fellow Daoist Song Yunwen!”</p><br/><p>Bai Xiaochun immediately recognized him. It was the same man who had appeared to offer assistance on the day Bruiser had come to life. He was one of the patriarchs of the Spirit Stream Sect, a man with unfathomable energy that seemed roughly equivalent to the Song Clan patriarch’s.</p><br/><p>“Fellow Daoist Li Zimo!” The Song Clan patriarch smiled as he clasped hands in greeting. The two of them exchanged a glance, and then stepped into the vortex.</p><br/><p>Bai Xiaochun took a deep breath. Although he’d always taken the Song Clan patriarch to be amazing, it was now extremely clear how incredible he was. Obviously, he wouldn’t have come to the Spirit Stream Sect alone if he weren’t completely confident in his own strength.</p><br/><p>As the patriarchs entered the vortex, beams of light shot out from both the south and north banks of the Spirit Stream Sect as numerous figures gathered in front of the blood cloud.</p><br/><p>The person in the lead was not Zheng Yuandong, but rather, Xu Meixiang. Next to her was the old woman from Irispetal Peak, who was flanked by Beihan Lie and some other young woman that Bai Xiaochun had never seen before.</p><br/><p>Next to Xu Meixiang were Big Fatty Zhang and Lu Tianlei.</p><br/><p>Further back were several dozen Foundation Establishment cultivators from the south and north banks. Virtually all of them were familiar to Bai Xiaochun, especially those whom he had assisted in the Fallen Sword Abyss.</p><br/><p>“Middle Peak grand elder, you have come from afar to visit,” Xu Meixiang said with a smile. “The sect leader is in secluded meditation, so I’ve come to receive you. Please, follow me!” Xu Meixiang's gaze swept over the crowd and seemed to linger on a few particular individuals, Bai Xiaochun included.</p><br/><p>Song Junwan smiled slightly and replied. “Peak Lord Xu, there’s no need for such courtesy. Please lead the way!”</p><br/><p>With that, she stepped off the blood cloud. Bai Xiaochun and the other cultivators from the Blood Stream Sect followed close behind. The gazes of the Spirit Stream Sect cultivators were not welcoming. Although the Blood Stream Sect cultivators had their murderous auras, the Spirit Stream Sect cultivators’ eyes flickered with killing intent.</p><br/><p>Clearly, this generation of Foundation Establishment experts from the Spirit Stream Sect had all experienced fighting and bloodshed. They had a large number of Earthstring Foundation Establishment cultivators, and although Song Junwan had been aware of this fact, the sight of it caused her eyes to widen.</p><br/><p>Song Junwan and Xu Meixiang took the lead, chatting conversationally, but simultaneously probing each other for information. As for the two bloodstreak elders, they were accompanied by the old woman from Irispetal Peak.</p><br/><p>The other cultivators were all escorted by various people from the Spirit Stream Sect, who seemed to be forcibly restraining themselves.</p><br/><p>Bai Xiaochun was joined by no ordinary cultivator, but rather, by north bank Chosen Beihan Lie. His expression was somber, his gaze penetrating, and he seemed to be constantly on guard as he proceeded along next to Bai Xiaochun.</p><br/><p>Bai Xiaochun sighed. For some reason, he suddenly felt the intense urge to call out greetings to everyone he knew.</p><br/><p>The group flew into the Spirit Stream Sect to Mount Daoseed. After landing, the people from the south and north banks stared icily at the group from the Blood Stream Sect. A somber, murderous aura was slowly building up.</p><br/><p>“Ah, it's so great to be home. Especially when nobody can recognize you!” Bai Xiaochun looked around excitedly, and his gaze was drawn repeatedly back to the unfamiliar young woman who accompanied the old woman from Irispetal Peak.</p><br/><p>She was strikingly beautiful, and Bai Xiaochun was surprised that he had never seen her before.</p><br/><p>“Looks like the north bank must have some new blood,” he thought, feeling more than ever like a member of the Senior generation. Sighing in satisfaction, he looked over at Big Fatty Zhang.</p><br/><p>“I can’t believe Big Fatty Zhang is in the tenth level of Qi Condensation....” he thought, sighing emotionally. However, every time Bai Xiaochun turned his attention to a different person, Beihan Lie would get very nervous, and would tense up vigilantly, and seem to radiate a brutal, bloodthirsty air. He couldn’t help but be shaken by the various stories he'd heard about this Nightcrypt.</p><br/><p>“According to the rumors, this Nightcrypt is particularly vicious,” he thought. “He cuts people down like scything wheat! He’s quite the womanizer, and apparently has very low standards. People say he loves the taste of human blood, and demands to drink it every day. Furthermore, he won't rest until he’s sated his desire for women. On a daily basis! This guy is a complete and utter devil! Not only does he have a multifarious personality, he’s completely and utterly brutal. Dammit! He’s looking at Junior Sister Fang and Big Fatty Zhang! Just what is he planning...?” Even as Beihan Lie’s anxiety grew, Bai Xiaochun looked over at him and smiled.</p><br/><p>To Beihan Lie, Nightcrypt’s smile seemed cruel and ferocious. But then he realized that even as Nightcrypt smiled at him, he raised his eyebrow, almost as if he were flirting! Beihan Lie gasped, and his expression flickered.</p><br/><p>“No need to get nervous,” Bai Xiaochun quickly said. If he hadn’t said anything, nothing would have happened, but since he did, Beihan Lie’s right hand flashed with an incantation gesture, and a magical item shimmered into being.</p><br/><p>He wasn't the only one to react in such a way. Other Spirit Stream Sect cultivators could detect what was happening, and looked over menacingly at Bai Xiaochun.</p><br/><p>Bai Xiaochun frowned. As far as he was concerned, he had just been saying hello to an old friend. However, even Song Junwan and Xu Meixiang could sense what was happening. When they looked back, Xu Meixiang’s eyes widened. Big Fatty Zhang and Lu Tianlei looked over with grim expressions, and even the old woman from Irispetal Peak reacted similarly.</p><br/><p>Everyone from the Spirit Stream Sect had heard information about the infamous Nightcrypt, and had even seen pictures of him, so they immediately recognized him. That was especially true of Lu Tianlei. With a challenging gleam in his eyes, he flew over toward Bai Xiaochun, whereupon he took his place next to Beihan Lie. Clearly, Nightcrypt’s reputation in the Spirit Stream Sect was one of complete and utter ferocity.</p><br/><p>Bai Xiaochun glared at Lu Tianlei. Things weren’t like they had been long ago in the Spirit Stream Sect, and Bai Xiaochun couldn’t believe that Lu Tianlei would actually have the gall to challenge him openly.</p><br/><p>“Who might that be…?” Xu Meixiang said, pretending not to know.</p><br/><p>“That’s my Junior Brother Nightcrypt,” Song Junwan replied with a smile. Then she changed the subject. “I've heard that the Spirit Stream Sect’s legacy echelon-designate reached Heaven-Dao Foundation Establishment? Would it be possible to pay Bai Xiaochun a visit?”</p><br/>\n</div>"}