{"title": "Chapter 221: The Dao of All-Creation Plants and Vegetation", "id": 221, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-221-the-dao-of-all-creation-plants-and-vegetation", "volume_title": "Volume 3", "body": "<h1>Chapter 221: The Dao of All-Creation Plants and Vegetation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The green pillar of light shot up into the heavens, causing everything to tremble. Even the blood qi in the area was blasted away. Instantly, the whole Blood Stream Sect was shaken.</p><br/><p>Middle Peak Grand Elder Song Junwan was in the middle of meditating when suddenly, her eyes opened. Shocked, she rushed out of her immortal's cave to look at the green light, and quickly realized that it was coming from the Holy Pill Wall Fragment.</p><br/><p>“Nightcrypt is over there seeking enlightenment. Don’t tell me....” Heart trembling, she flew into the air. It wasn’t just her; numerous beams of light sped from the various mountain peaks toward the Holy Pill Wall Fragment.</p><br/><p>There were even streams of divine sense that flowed out from Ancestor Peak. Instantly, everyone saw Bai Xiaochun, in a deep trance, expression blank. He even seemed to be somewhat intoxicated. Anybody who looked at him could tell that he was in the middle of being enlightened by the wall fragment!</p><br/><p>“Every few hundred years, someone succeeds in gaining enlightenment. But nobody has ever caused green light to shoot up from the wall fragment!”</p><br/><p>“I remember reading in the ancient records about how the Daoist Blood Sage received enlightenment 8,000 years ago. Green light appeared back then.... Could it be that this is the same kind of enlightenment?”</p><br/><p>“I can’t believe Nightcrypt is so gifted in the Dao of medicine!”</p><br/><p>“I remember him concocting medicine a few times in the past. If he can gain enlightenment from the wall fragment, then in the future, the Blood Stream Sect might have another grandmaster apothecary!!”</p><br/><p>It wasn’t just the prime elders who took note of what was happening. Two pairs of eyes flashed like lightning as they looked over at Bai Xiaochun.</p><br/><p>One of them belonged to Patriarch Limitless, the other, to the Song Clan patriarch!</p><br/><p>Strange light could be seen in those eyes, and they seemed moved. Soon, it became apparent that countless figures were converging on the wall fragment, so the Song Clan patriarch quickly said, “Song Junwan, stand as Dharma protector for Nightcrypt. If anyone tries to interfere, kill them immediately!”</p><br/><p>The Song Clan patriarch’s voice was as cold as ice, and rang out for all to hear. Immediately, the cultivators near Bai Xiaochun backed up, hearts pounding in fear. Some of them had actually been contemplating whether or not they should interfere, but now they pushed such thoughts aside.</p><br/><p>Song Junwan took a deep breath. Clasping hands in respect toward Ancestor Peak, she took a few steps forward and sat down cross-legged next to Bai Xiaochun to serve as Dharma protector.</p><br/><p>Other cultivators who were under the personal command of Song Junwan also sat down cross-legged, forming a wider perimeter, staring coldly at the other surrounding cultivators.</p><br/><p>With Song Junwan serving as Dharma protector, and a warning having been uttered by a patriarch, the crowd began to thin. Soon, the area was very quiet.</p><br/><p>Word spread about Nightcrypt gaining enlightenment from the wall fragment. During the following month, cultivators would come on a daily basis to observe what was happening. As for Song Junwan, her eyes were increasingly bloodshot, and she also seemed in a daze, as if the only thing that existed were Bai Xiaochun and the wall fragment.</p><br/><p>“Nightcrypt reached Inverse Blood Ancestral Awakening,” she thought, “and also has terrifying abilities in divination. Now it seems he’s a genius in the Dao of medicine. Lots of disciples study this wall fragment, but very few people can succeed, and even fewer provoke a reaction from the wall! Just what Dao of medicine is Nightcrypt gaining enlightenment of?” Her eyes glittered even more profoundly than before as she realized that yet again, her earlier assumptions about Nightcrypt had been incorrect.</p><br/><p>He seemed simple enough, as if he could be judged at a single glance. However, Song Junwan had to admit that what she had seen, and what she knew, was just the tip of the iceberg.</p><br/><p>“How could a person like this slip through Qi Condensation completely unnoticed? Did he really spend all that time building up and preparing?” No matter how she considered the matter, she couldn't come up with an answer. At the same time, the gleam in her eyes as she looked at Bai Xiaochun continued to deepen.</p><br/><p>Time passed. Another month went by, and Bai Xiaochun had forgotten about himself. He was completely focused on the apothecary, and his process of concocting medicine.</p><br/><p>He watched him over and over again, and the closer he examined him, the clearer the figure became. Eventually, the image turned into a different person, and soon, the concocting methods were different again.</p><br/><p>Generally speaking, theories regarding the Dao of medicine were the same. However, when it came to the plant and vegetation pills, or the pill concocting methods, they changed from person to person. The people changed, the methods changed, but the foundation was the same.</p><br/><p>A tremor ran through Bai Xiaochun as he saw one figure after another concocting medicine. Each one used the same general principles to form the exact type of medicinal strength they needed.</p><br/><p>It was as if a huge door were opening in Bai Xiaochun’s mind. At a certain point, he subconsciously extended his hands and began to mimic what he was seeing inside the wall.</p><br/><p>As his hands moved, a green field of light appeared around him, which attracted the green light shining from the stone wall. Soon, the two were connected.</p><br/><p>Bai Xiaochun’s mind filled with rumbling sounds as countless bodies of knowledge regarding the Dao of medicine flowed into his mind through the light.</p><br/><p>The group on Ancestor Peak was shaken, and based on the levels of their cultivation bases, they could actually sense what was happening.</p><br/><p>“A legacy!”</p><br/><p>“No wonder the Pill Stream Sect has tried so hard over the years to get that wall fragment back. If the Daoist Blood Sage hadn’t expressed his dying order to never return the wall for all eternity, it would probably have been sent back long ago.”</p><br/><p>“So this wall contains a legacy of the Pill Stream Sect’s Dao of medicine. Now that I think about, doesn’t the Pill Stream Sect also have a wall fragment?” The Blood Stream Sect patriarchs exchanged glances, and all of them could see how deeply moved the others were.</p><br/><p>Bai Xiaochun’s mind was wracked with pain as he accepted the legacy. He was left trembling, his eyes completely bloodshot, and he even cried out at the top of his lungs.</p><br/><p>However, he wasn’t willing to give up. Even a glimpse at the knowledge of the Dao of medicine he was receiving was completely shocking.</p><br/><p>“Use heaven and earth as the pill cauldron. Use all creation as the plants and vegetation. Bequeath soul seeds. Create medicines of good fortune!”</p><br/><p>Bai Xiaochun’s mind was battered by towering waves of shock. Suddenly, he thought back to the Pill Stream Sect disciple he’d killed, Fang Lin. The Heaven-Earth Furnace Cauldron he’d used was obviously what was referred to in the first line of the wall fragment legacy!</p><br/><p>He also thought back to what had occurred when Fang Lin died, and the face of the young man he’d seen, which resembled a yin-yang symbol. Apparently, Fang Lin had unknowingly been infected with a soul seed! [1. Fang Lin died in chapter 160.]</p><br/><p>Back in the heat of the moment, Bai Xiaochun had mostly ignored that young man with the yin-yang face. However, he hadn’t forgotten the incident, and had always remained suspicious about it. Now, he realized that what he had seen was a manifestation of Soul Seed Bequeathal!</p><br/><p>Furthermore, the legacy he was receiving now was the technique of All-Creation Plants and Vegetation!</p><br/><p>Heaven-Earth Furnace Cauldron, All-Creation Plants and Vegetation, Soul Seed Bequeathal! These three divine abilities were the fundamental Dao which served as the foundation of the Pill Stream Sect!</p><br/><p>Unfortunately, the Blood Stream Sect had robbed them of half of their wall fragment. Perhaps the lack of the All-Creation Plants and Vegetation technique was why the Pill Stream Sect had been in a state of gradual decline for so long.</p><br/><p>“By using all creation as plants and vegetation, the transformations of the plants and vegetation can be used to form any type of medicinal effect! A Dao of medicine like this is unimaginable!” Bai Xiaochun was panting. Never could he possibly have guessed that his attempt to pretend to get enlightenment would result in him actually receiving a legacy magic.</p><br/><p>As the legacy was passed on, the light shining up from the wall fragment grew weaker and weaker, and the green glow around him grew stronger and stronger. A few days later, the light around the wall faded, and Bai Xiaochun’s eyes snapped open. The intense green light around him caused rumbling like that of thunder to echo out. At the same time, the images of countless plants and vegetation swirled around him, continuously merging with each other, continuously transforming.</p><br/><p>The bizarre signs that the disciples of the Blood Stream Sect were seeing left them shocked. It was easy to imagine how, even as soon as the following day, Nightcrypt’s name would once again rock the Blood Stream Sect. Even the other sects would surely hear about what was happening, and Nightcrypt would become even more famous in the eastern Lower Reaches of the cultivation world.</p><br/><p>“Nightcrypt....” Song Junwan murmured, rising to her feet. An expression of concern could be seen in her eyes as she looked at Bai Xiaochun. He was much thinner than he had been before, his face sunken in a bit, seemingly little more than flesh and bones. And yet, his eyes shone with brilliant light.</p><br/><p>He looked over at Song Junwan and nodded. Before she could say anything, he said, “I need to concoct some medicine!”</p><br/><p>He needed to take the information that was sinking into his mind and apply it to medicine concocting as soon as possible, to firmly fix the sensation of the All-Creation Plants and Vegetation technique into his heart. Under the eyes of all present, he flew into the air toward Middle Peak. Even the patriarchs on Ancestor Peak had expressions of anticipation on their faces as they watched him go.</p><br/><p>Back in his immortal's cave, he immediately went into secluded meditation. He didn’t have a lot of plants and vegetation on him at the moment, but it was without hesitation that he produced a pill furnace and began to concoct, not spirit medicine, but plants and vegetation pills.</p><br/><p>Through this process of concocting, he became much more confident in manipulating the plants and vegetation to produce specific levels of medicinal strength. The legacy branding in his mind grew deeper. He was so focused that he completely ignored matters like sleep and eating. At the same time, the exact effect he had hoped to produce within the sect could be seen. The Song Clan patriarch arranged for large quantities of plants and vegetation to be delivered to him, along with piles of bloodflame stones.</p><br/><p>All of the resources of the Blood Stream Sect were being called upon to ensure that Bai Xiaochun quickly mastered the legacy he had received. Many of the medicinal plants he was given were very rare, and would fetch exorbitant prices on the outside, or even be the subject of fierce fighting.</p><br/><p>But now, it was without hesitation that the sect handed them over.</p><br/><p>They even sent over an apothecary attendant, who respectfully said, “Grandmaster, the patriarch sent me to explain that this is only the first set of ingredients. More medicinal plants are on the way!”</p><br/><p>Because of the steady flow of medicinal plants, Bai Xiaochun experienced no delays in his mastery of the legacy. As he concocted more plant and vegetation pills, his eyes shone with more intense light. At the same time, his skill in the Dao of medicine advanced by leaps and bounds.</p><br/><p>Bai Xiaochun was even delighted to discover that there were aspects of the Frigid School Medicine Manual that he didn’t understand before, but were now clear. In fact, there was an entire section on the first page that now made complete sense!</p><br/><p>“I have the feeling that I can finally concoct a tier-4 medicinal pill! Maybe even tier-5!”</p><br/><p>Tier-4 medicinal pills were a dividing mark between journeyman apothecaries and master apothecaries!</p><br/>\n</div>"}