{"title": "Chapter 222: I Must Concoct Medicine!", "id": 222, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-222-i-must-concoct-medicine", "volume_title": "Volume 3", "body": "<h1>Chapter 222: I Must Concoct Medicine!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I must concoct medicine!” Bai Xiaochun’s eyes shone with intense focus. The enlightenment he had gained from the Holy Pill Wall Fragment, and the abstruse information from the Frigid School Medicine Manual, caused his skill in the Dao of medicine to break through from the point of being able to concoct tier-3 medicines. He was now fairly certain he could concoct tier-4 medicines!</p><br/><p>In the eastern Lower Reaches of the cultivation world, tier-4 spirit medicines were virtually priceless. Foundation Establishment cultivators absolutely required them, the most obvious example being Foundation Establishment Pills!</p><br/><p>Foundation Establishment Pills were tier-4 spirit medicines, and were very difficult to concoct. In fact, anyone who could successfully concoct them would be viewed as a master apothecary!</p><br/><p>Master apothecaries were rare. The Blood Stream Sect had been home to a few in the past, but not anymore. It was the same with the Profound Stream Sect. Obviously, the Pill Stream Sect had them, and in fact, they even had grandmaster apothecaries, who were on a similar level as prime elders.</p><br/><p>Other than the master apothecaries in the Pill Stream Sect, the only other one was in the Spirit Stream Sect, and that was Li Qinghou!</p><br/><p>But now, Bai Xiaochun was at the peak of the tier-3 level, and was on the verge of breaking through to the tier-4 level. Theoretically, the knowledge he possessed already gave him what he needed to break through. Taking a deep breath, he extended his right hand and opened the bag of holding that the sect had provided, which contained all sorts of plants and vegetation. Almost immediately, he gasped, and the more he studied the contents of the bag, the more shaken he was.</p><br/><p>“Is this dragonspirit root? I can’t believe it’s over 700 years old...</p><br/><p>“This is peacedevil leaf!! More than 400 years old....</p><br/><p>“Revelation fruit. Dao-immortal blossom....” It seemed like each of the medicinal plants he'd been given was more valuable than the one before it, and more rare. From the plants and vegetation he was being given, it was obvious how important the Blood Stream Sect viewed him to be. It actually exceeded his expectations.</p><br/><p>He couldn’t help but feel a bit conflicted. On the one hand, the Blood Stream Sect really had treated him amazingly. On the other hand, he couldn’t forget that he was from the Spirit Stream Sect....</p><br/><p>Even as he wavered back and forth about what to do, he looked at the most recent delivery, which included two bags of holding.</p><br/><p>One of them contained pill furnaces, the other contained the Blood Stream Sect’s unique bloodflame stones!</p><br/><p>Bloodflame stones were similar to the earthflame crystals from the Spirit Stream Sect, except even more domineering. The intense heat they emitted was a necessity for medicine concocting, and although they were unique to the Blood Stream Sect, after some examination, Bai Xiaochun confirmed that they could produce three-colored flame.</p><br/><p>Although he would have preferred fuel for four-colored flame, three-colored flame was still satisfactory. Finally, he made his decision. He would concoct pills, and secretly keep some of them for himself.</p><br/><p>As for the four-leaf clovers he had harvested some time back, he still had them in his bag of holding. However, he didn’t dare to use the turtle-wok in the Blood Stream Sect, for fear of mishaps.</p><br/><p>After looking closer at the bag with the pill furnaces, Bai Xiaochun was even more shocked than he had been by all of the valuable medicinal plants. Eyes wide, he said, “How many pill furnaces are in here?”</p><br/><p>Mind reeling, he counted over 100 pill furnaces. There were large ones and small ones, new ones and old ones. The mere sight of them left Bai Xiaochun's vision swimming.</p><br/><p>There were even a few dozen pill furnaces which were clearly magical devices, and others contained strong medicinal aromas that indicated they had been frequently used by apothecaries in the past.</p><br/><p>“Did they rob all of these?” he thought, rubbing his eyes. After further examination, he realized that almost all of the pill furnaces were marked with a symbol like a cauldron, which was the sign of the Pill Stream Sect.</p><br/><p>Obviously, these were pill furnaces that the Blood Stream Sect had robbed from Pill Stream Sect disciples over the years....</p><br/><p>In addition to the pill furnaces, there were some jade slips in the bag of holding. After examining them, Bai Xiaochun’s mind was yet again sent spinning. It actually took quite a while for him to recover. Those jade slips were clearly incredibly valuable.</p><br/><p>They were inscribed with countless medicine formulas!</p><br/><p>Some of them were even tier-5 formulas....</p><br/><p>Bai Xiaochun sighed emotionally, and his eyes shone with intense light. To have so many medicinal plants and so many pill furnaces right there in front of him left him completely excited. Rubbing his hands together, he immediately pulled out a pill furnace and some bloodflame stones. After igniting the stones with some spiritual power, a blood-colored flame lit the room.</p><br/><p>“Concoct medicine. Must concoct medicine!” He didn’t start with the Foundation Establishment Pill. Instead, he studied the formula for something called a Spirit-Tempering Crystallizing Pill, after which he began to concoct it.</p><br/><p>Time passed. In the blink of an eye, half a month went by. Bai Xiaochun never went outside even once, and soon his hair was completely disheveled. He was completely immersed within his medicine concocting. He failed over and over again as he built up experience and performed experiments. He pursued new trains of thought, and every time he came up with a new idea, he would laugh out loud with joy.</p><br/><p>As his laughter echoed out of the immortal's cave, the blood trees shivered, and any Middle Peak cultivators who happened to be passing by would be surprised, but mostly dismissive.</p><br/><p>Most of the cultivators on Middle Peak had some sort of beef with Bai Xiaochun, although none of them would ever dare to reveal that publically. However, as time passed, all sorts of gossip spread.</p><br/><p>“So what if he gained enlightenment of the wall fragment? Does he really think he's going to concoct some sort of amazing spirit medicine?”</p><br/><p>“Hmph. I heard that all of the plant and vegetation resources in the whole sect were sent over to Nightcrypt. He’s just digging his own grave. He’s going to fail completely, or at best concoct some ordinary spirit medicine. Either way, he’s screwed!”</p><br/><p>“Who cares about medicine concocting? I don’t even understand why the sect thinks it's important!”</p><br/><p>However, Song Junwan and the three other grand elders, as well as the prime elders on Ancestor Peak, were filled with anticipation. Even the Song Clan patriarch felt the same way, and was constantly looking over toward Middle Peak.</p><br/><p>Ten days passed. Bai Xiaochun’s extended time in seclusion was being viewed with increasing derision by the Middle Peak cultivators. Of course, most of that was jealously. They were jealous of his relationship with the grand elder, jealous that the sect cared so much about him, and jealous that he was being gifted with so many plant and vegetation resources.</p><br/><p>However, his overall level of power was extraordinary, and everyone knew it. Because of the Inverse Blood Ancestral Awakening, he had already surpassed the power of a Mortal-Dao Foundation Establishment Dharma protector. The Earthstring Foundation Establishment elders were starting to feel threatened, and even the late Foundation Establishment experts were worried.</p><br/><p>Another three days passed....</p><br/><p>Bai Xiaochun had been working at medicine concocting for a full month straight. Inside his immortal's cave, he was working like mad, his eyes bloodshot as he paced back and forth around the pill furnace. He never stopped concocting. He would draw upon the plants and vegetation he had access to as he aimed for the medical strength he desired. Each time he failed, he would see new hope for success.</p><br/><p>“This time I'm definitely going to succeed!” he said hoarsely, licking his lips and staring at the pill furnace. Several more hours passed, and then the pill furnace began to tremble. A medicinal aroma spread out, and Bai Xiaochun’s eyes shone with anticipation. Moments later, though, his excitement turned into fear.</p><br/><p>“What’s going on!?” he said, eyes widening. In the instant that the spirit medicine was supposed to emerge, the pill furnace suddenly began to heat up. Apparently, the strength of the pill was causing instability, which was affecting the pill furnace itself. Even the bloodflame stones were being influenced, which was causing the heat spike. Instantly, a sensation of intense danger filled Bai Xiaochun’s heart.</p><br/><p>Cracking sounds rang out, and the pill furnace began to shake violently. Fissures spread out across its surface, which were filled with shining, blood-colored fire. From the look of things, the pill furnace was about to explode.</p><br/><p>A shocking force was building up inside, causing the pill furnace to bulge dramatically....</p><br/><p>“It’s gonna blow!!” he gasped, his scalp tingling. This was a tier-4 spirit medicine, something far beyond tier-2 or tier-3 medicines.</p><br/><p>Even an exploding tier-3 spirit medicine was completely shocking, but the idea of how much force the detonation of a tier-4 spirit medicine would release caused Bai Xiaochun’s pupils to constrict. From the aura that was emanating from the pill furnace, Bai Xiaochun could tell that it had force comparable to a Foundation Establishment cultivator.</p><br/><p>There was no time to sit around thinking about what to do. Shrieking, Bai Xiaochun reached out and grabbed the bulging furnace, then drew upon the full power of his cultivation base to burst outside and hurl it up into the air.</p><br/><p>“Everybody watch out!” he cried at the top of his lungs. The pill furnace sailed up above Middle Peak, and then exploded, releasing a thunderous boom that shook heaven and earth. A shockwave also blasted out, sweeping over everything in sight.</p><br/><p>As the pill furnace exploded, medicinal dregs shot out in all directions. Even more terrifying was that the burning shrapnel created by the exploding furnace rained down in all directions.</p><br/><p>Countless Middle Peak disciples were badly frightened, and rushed out to see what was happening.</p><br/><p>“What’s wrong?!”</p><br/><p>“What happened?!”</p><br/><p>“Is the Spirit Stream Sect attacking us?!”</p><br/><p>In their shock, they looked up and saw flames streaking through sky like falling stars to land in various locations around Middle Peak. As each bit slammed into the ground, booms echoed out.</p><br/><p>Soon, cries of alarm rose up into the air. Wherever the destroyed remnants of the pill furnace landed, flames rose up. There were even some unfortunate cultivators who caught on fire and began to scream at the tops of their lungs.</p><br/><p>All of Middle Peak was thrown into chaos. Song Junwan was shaken, and when she rushed out, she saw Middle Peak engulfed in flames. She could smell the acrid odor of a destroyed medicinal pill, and could also see the chunks of the pill furnace raining down.</p><br/><p>“Is this what happens when you concoct medicine?” she thought with a gasp. “I can’t believe medicine concocting is so terrifying!” In her mind, medicine concocting should be a calm, peaceful activity, and even if something went wrong, there shouldn’t be a huge disaster like this.</p><br/><p>If disciples of the Spirit Stream Sect were present, they would definitely understand what was happening, and would probably even feel bad for the Blood Stream Sect and say, “Disaster strikes once Sect Uncle Bai starts concocting medicine.”</p><br/>\n</div>"}