{"title": "Chapter 228: Excuse Me... Are You Immortal Grass?", "id": 228, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-228-excuse-me-are-you-immortal-grass", "volume_title": "Volume 3", "body": "<h1>Chapter 228: Excuse Me... Are You Immortal Grass?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Strange incidents like this soon began to occur in other locations on Corpse Peak. Cultivators emerged from their immortal's caves, some of them with serious expressions, some of them howling out loud, some of them seemingly enraptured. A few even waved their arms around and laughed uproariously.</p><br/><p>One cultivator stood in front of a large tree, expression twisted with rage as he gesticulated wildly and howled, “Halt! If you make a move, I’ll kill you instantly!”</p><br/><p>Off in the distance, another cultivator with disheveled hair threw his head back and laughed uproariously. “Hahaha! I've finally reached Core Formation. From now on, call me prime elder!”</p><br/><p>There was another cultivator who stood stiffly in front of one of his own refined corpse, howling. Apparently, he thought that he was the refined corpse, and that his refined corpse was the master.</p><br/><p>Strange scenes like these played out everywhere. As for the cultivators who weren’t affected, they looked around, expressions of shock and terror filling their faces.</p><br/><p>“What’s going on!?!?”</p><br/><p>“Heavens! What’s happening!?!?”</p><br/><p>“Dammit! What happened!?” The unaffected cultivators almost felt like they themselves were going crazy. The shocking scenes playing out around them soon caused blank expressions to appear on their faces.</p><br/><p>Xu Xiaoshan was in the crowd, flying along in terror until he happened to reach a large boulder. Looking around fearfully, he turned to the boulder and said, “Did you see? Something big is happening! All of the disciples are hallucinating! This is bad, we have to go tell the grand elder!” After a moment of silence, Xu Xiaoshan glared at the boulder. “Eee? Why aren’t you talking?”</p><br/><p>Another moment passed. “Y-y-you’re a hallucination?!” Looking terrified, Xu Xiaoshan flew off in a different direction until he found a refined corpse.</p><br/><p>A tremor ran through him and he said, “Patriarch!! Sir, you have to hurry. Something big is happening. Everyone is hallucinating!”</p><br/><p>Even as Xu Xiaoshan cried out in alarm, another Corpse Peak cultivator off in the distance suddenly threw his head back and laughed uproariously. Looking around with contempt and arrogance, he said, “Trifling Blood Stream Sect! How dare you challenge me, Bai Xiaochun! Listen up everyone. I am Bai Xiaochun, Heaven-Dao Foundation Establishment expert. Yes. Bai Xiaochun!” He then proceeded to strut along arrogantly through the crowd, telling everyone he saw that he was Bai Xiaochun....</p><br/><p>All of Corpse Peak was descending into complete chaos. The grand elder and the bloodstreak elders all rushed outside in shock, and when they saw what was happening, they gasped.</p><br/><p>“What’s going on!?!?”</p><br/><p>Even as the grand elder began to rotate his cultivation base, the Corpse Peak blood master appeared up above, staring around in complete confusion.</p><br/><p>“They're all hallucinating!!” the blood master murmured incredulously. As for the bloodstreak elders, they strode out to take control, but then their expressions turned blank.</p><br/><p>One of them clutched the sides of his head and began to weep loudly. Another squatted down, put his hands on either side of his head, and stuck his index fingers up like rabbit ears. After looking around quizzically, he began hopping around like a rabbit....</p><br/><p>Another of them ran off at top speed toward a certain immortal's cave where a young cultivator had buried himself up to the waist. The bloodstreak elder quickly squatted down next to the young cultivator and stared at him with a serious expression.</p><br/><p>The blood master and the grand elder felt their scalps tingling in fear. Then they looked over in the direction where Bai Xiaochun was concocting medicine, expressions of shock on their faces.</p><br/><p>“Could all this be caused by Nightcrypt’s concocting!?!?”</p><br/><p>“Even concocting medicine shouldn’t cause something as terrifying as this to occur!!” The grand elder gasped, and just when he was about to say something, his expression suddenly went blank. Letting out a piercing cry, he stretched his arms out like wings and flew up into the air. Occasionally, he would swoop down and grab a cultivator, let out an odd cry, and then toss them back to the ground.</p><br/><p>Apparently, he thought he was an eagle. As he soared through the air, he would use his sharp eyes to spot cultivators down below, and then swoop down and grab them.</p><br/><p>The blood master’s scalp was tingling so hard it felt like it might explode. He immediately flew high up into the air, unwilling to be anywhere near Corpse Peak, his eyes shining with terror.</p><br/><p>“How could this be happening!?!?!?”</p><br/><p>The people paying the closest attention to Corpse Peak were the cultivators of Middle Peak. As soon as things started to unravel, they flew over to take a look. When they saw the bizarre spectacle playing out, they began to gasp and back up, not daring to get too close.</p><br/><p>“Plaguedevil finally unleashed the whirlwind!”</p><br/><p>“This is horrifying! What’s wrong with them? Don’t tell me they’re hallucinating?!?!”</p><br/><p>“Hallucinations like that must draw upon their deepest desires....”</p><br/><p>“Heavens! I can’t believe one of them keeps saying he’s Bai Xiaochun! What does he want, deep down inside? To become Bai Xiaochun?”</p><br/><p>Song Que flew up into the air and looked over at Corpse Peak, gasping. The first person he saw was Xu Xiaoshan, who was prostrating himself in front of a refined corpse, calling it patriarch. Shortly afterward, Xu Xiaoshan flew off in a different direction, reaching a relatively wide-open section of Corpse Peak, where he suddenly flopped to the ground and stopped moving.</p><br/><p>The Middle Peak cultivators weren’t the only ones to notice that something strange was going on. Soon, people from Nameless Peak and Lesser Marsh Peak realized that something odd was happening, and flew over to check out the situation. When they saw what was playing out, they all gasped.</p><br/><p>“Who is that one lunatic over there? He’s actually making a pass at his own refined corpse!!”</p><br/><p>“Isn’t that the grand elder of Corpse Peak? Why is he screeching like a bird? Does he really think he’s an eagle? Heavens! He’s swooping down toward one of the bloodstreak elders! Eee? He missed him!”</p><br/><p>“Does that bloodstreak elder think he’s a rabbit or something?”</p><br/><p>“And look at that guy who buried himself up to the waist. What is he doing? And what is that bloodstreak elder doing next to him? He’s not even moving at all!”</p><br/><p>The cultivators from the three other mountain peaks were flabbergasted. Eventually Song Junwan appeared, and when she looked over at Corpse Peak, she gasped.</p><br/><p>As of this moment, the cultivators of Middle Peak felt mixed emotions regarding Nightcrypt. For some reason, they got the feeling that he had actually treated them quite well. The worst they had dealt with was some exploding furnaces and a bit of diarrhea. The situation with Corpse Peak was simply terrifying....</p><br/><p>The Corpse Peak blood master felt like crying, but no tears would come. He looked around blankly at everything that was happening, and felt like he might go crazy at any moment too.</p><br/><p>Even as everyone was shaking in terror, Ancestor Peak finally took note of the situation. Meanwhile, the young cultivator who had first been affected, the one who had stuck his hands into the air and started swaying back and forth, suddenly looked at the bloodstreak elder who was squatting next to him, unmoving.</p><br/><p>The young cultivator was actually very curious about this. He had noticed the bloodstreak elder arrive earlier, but after much thought, couldn’t identify him. Finally, he decided to ask directly, to dispel his confusion. After a moment of hesitation, the young cultivator asked, “Excuse me, are you immortal grass?”</p><br/><p>“No, of course not,” the bloodstreak elder replied solemnly. “I'm an immortal chicken egg!”</p><br/><p>Even as Corpse Peak was filled with pandemonium, Bai Xiaochun was down in the necropolis, howling at the top of his lungs. At the same time, his emerald zombie shivered as two medicinal pills appeared in its dantian region.</p><br/><p>One of them was the Inverse Blood Corpse Refining Pill, and the other was a smaller synchronization version.</p><br/><p>An excited expression appeared on Bai Xiaochun’s face. His right hand flashed with an incantation gesture, and the synchronization pill flew out. Capturing it in a medicinal pill bottle, Bai Xiaochun examined it closely, and then got even more excited than before.</p><br/><p>“It worked!” Feeling very proud of his work, he collected up his emerald zombie and then pushed open the door of the necropolis.</p><br/><p>As soon as he walked out of the immortal's cave, he heard the clamor off in the distance. However, considering that nobody had gathered near his immortal's cave, he felt very much at ease.</p><br/><p>“Seems the black smoke wasn’t a big deal after all, huh?” Sighing, he began to walk along the path, but then suddenly stopped in place. Some distance off was a bloodstreak elder hopping along in his direction.</p><br/><p>Bai Xiaochun stared in shock, and even wondered if he was seeing things. Heart pounding, he rubbed his eyes and looked over to see a Foundation Establishment cultivator laughing maniacally as he attacked a nearby tree. Then he saw a younger cultivator walking along on his hands....</p><br/><p>There was even one cultivator who he had never seen before, laughing proudly as he declared that he was Bai Xiaochun. Strolling over with hands clasped behind his back, the man glared at Bai Xiaochun and said, “Recognize me? I'm Bai Xiaochun!”</p><br/><p>Bai Xiaochun’s eyes went wide, and his scalp began to tingle. As he looked around, he realized that almost all of the cultivators on Corpse Peak were behaving very strangely.</p><br/><p>“Why are they all acting so crazy?” Fear rising up inside of him, he was just about to flee when suddenly, he saw Xu Xiaoshan lying off in the distance, still and unmoving.</p><br/><p>As far as Bai Xiaochun was concerned, Xu Xiaoshan was a friend, so he hurried over to see if he could help. Just as he reached him, and was preparing to investigate, Xu Xiaoshan’s eyes snapped open.</p><br/><p>“Don’t move!\" he whispered. \"Everyone on Corpse Peak is crazy. They’re hallucinating! I almost can’t believe it, but I was just talking to a boulder a few minutes ago. I even thought a refined corpse was one of the patriarchs!</p><br/><p>“Thankfully, I, Xu Xiaoshan, have exceptional latent talent, as well as tons of magical items. That’s how I recovered so quickly.”</p><br/><p>“You’re not crazy?!” Bai Xiaochun asked jubilantly.</p><br/><p>“Get out of here!” Xu Xiaoshan replied immediately. “Forget about me. I'm pretty sure all of this is happening because of that eagle up there. I'm trying to lure it down here, and then I’ll kill it. Everything will be fine after that.” With that, he peered up into the sky.</p><br/><p>Bai Xiaochun subconsciously looked up into the sky, his mind spinning. Soon, he saw the grand elder, arms spread wide as he soared to and fro, occasionally letting out a piercing cry.</p><br/><p>Bai Xiaochun looked around blankly. Meanwhile, everyone outside of Corpse Peak saw Bai Xiaochun, and their eyes began to widen.</p><br/><p>That was especially true of Corpse Peak’s blood master. He began to seethe with killing intent as he roared, “Nightcrypt!!”</p><br/><p>As the blood master’s cry echoed out, blood-colored light surged out around him, and he shot toward Bai Xiaochun like a beam of light. Within the blink of an eye, he was only about 150 meters away.</p><br/><p>Bai Xiaochun’s heart began to pound, and just when he was about to run away at top speed, Xu Xiaoshan threw his head back and laughed uproariously. Eyes shining, he leapt up into the air.</p><br/><p>“The eagle didn’t come, but a blood chicken did! It was all worth it!”</p><br/>\n</div>"}