{"title": "Chapter 232: The Power of Four Ghosts", "id": 232, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-232-the-power-of-four-ghosts", "volume_title": "Volume 3", "body": "<h1>Chapter 232: The Power of Four Ghosts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun didn't feel that it was appropriate to stay in the immortal's cave any longer. Looking over at the grim-faced Song Junwan, he gave a soft sigh, then bid her farewell. Song Junwan hesitated for a moment, and then nodded. After offering some more apologies for Song Que’s behavior, she said, “We have a few more months before the war. Middle Peak is going to have its trial by fire for the position of blood master. When the time comes, I hope you’ll be able to help me.”</p><br/><p>Her eyes shone with keen anticipation.</p><br/><p>Bai Xiaochun looked back at her, his own eyes flashing. After a moment passed, he nodded, then left.</p><br/><p>Once outside of the immortal's cave, his heart swelled with pride. Taking a deep breath, he reveled in his satisfaction at having mopped the floor with Song Que.</p><br/><p>“Hmmmphh! From now on, Que’er, I'm your Clan Uncle!” Feeling wonderful, but expression pale and grim, he returned thoughtfully to his immortal's cave on the lower finger.</p><br/><p>Once inside, he stretched lazily, thinking about how he now outranked Song Que. Then he waved his wide sleeve.</p><br/><p>“Ah, whatever. As a member of the Senior generation, it’s my job to help educate the youngsters.” Sitting down cross-legged, he put aside the matters of the day and began to practice cultivation.</p><br/><p>At the same time, he was continuously analyzing the methods of concocting tier-4 spirit medicines. Although his recent concocting efforts had been a success, he still didn’t feel completely content with the results.</p><br/><p>“Must have been problems with the pill furnaces....” he thought with a sigh. The more he thought about it, the more he realized that his ideas regarding concocting medicine would cause virtually any pill furnace to explode.</p><br/><p>The only thing he could do to prevent that from happening was to try to make the medicine less powerful. However, that would limit him to making the medicine about half as strong as he could, which left him feeling somewhat apathetic.</p><br/><p>“What a pity,” he thought with a sigh. “I guess my medicine concocting will be limited in this way for now.” Considering there was nothing to be done about the matter, he decided that he would just have to wait until he got back to the Spirit Stream Sect. Then he could ask Li Qinghou about the situation.</p><br/><p>When it came to cultivation, he didn't waste any time. During the following days, he spent all day absorbing blood qi and working on the second volume of the Undying Live Forever Technique, the Undying Heavenly King.</p><br/><p>The first level of the Undying Heavenly King was the ten mammoths Berserk Ghost Body, which he had already completed perfectly. The second level was the ten ghosts Heavenly Demon Body. Because of his diligent hard work, and also the fact that the Blood Stream Sect was a Holy Land for the Undying Live Forever Technique, his continuous absorption of blood qi soon helped him break through to the power level of four ghosts!</p><br/><p>Although he had no way to test out how strong he actually was, based on some basic calculations, Bai Xiaochun was convinced that he was terrifyingly powerful.</p><br/><p>In fact, he was sure that he was strong enough to beat almost anything that might cross his path. He was so strong in terms of his flesh and blood that he was nearly invincible. Not only were his offensive capabilities enough to rock mountains and rivers, he had colossal defenses as well.</p><br/><p>Song Que’s all-out attack earlier had felt like nothing more than a scratch to Bai Xiaochun, and the blood he had coughed up had been forcibly pushed out by drawing upon the power of his own spiritual seas.</p><br/><p>And then there was the divine ability which came with the Undying Heavenly King, the Mountain Shaking Bash. Although he hadn’t come across many chances to practice it, on the few occasions when he had, he could sense how shockingly powerful it was.</p><br/><p>In fact, he was convinced that if he unleashed it to full effect, he really could bash a hole into a gigantic mountain! When it came to bashing into people, well, it was obvious what fate they would meet.</p><br/><p>“At this point, I think I'm actually more powerful than one of those heavenly demons!” He suddenly scooped his hand down into the stone floor, and it felt like he was scooping up some tofu. There was almost no sensation at all as he pulled out a chunk of rock and then crushed it into ash.</p><br/><p>When he thought about how much more powerful he was than before, his excitement rose. Every time he absorbed blood qi, he felt indescribably wonderful. He also worked on his Blood Annihilation World, and although he didn’t actually notice, he was getting much quicker at forming blood swords. The blood swords he formed were also more powerful.</p><br/><p>When he absorbed blood qi, he almost felt like he was at one with Middle Peak, as if he himself could shake the mountain itself.</p><br/><p>Of course, he didn’t dare an actual attempt, for fear that things could quickly get out of control.</p><br/><p>As for his Violet Qi Heavenspan Incantation, his fundamental technique, and the only truly hidden Daoist magic in the Spirit Stream Sect, it was as the saying went: everything is difficult at the beginning, but gets easier as time progresses. Originally, he had needed help with the Heavenspan River water, but after passing into the middle level of the technique, and having successfully absorbed a drop into his spiritual seas, he now had some measure of control over the Heavenspan River water. Directly absorbing water from the Heavenspan River was something completely and utterly domineering, a trait which was now showing through in Bai Xiaochun’s cultivation.</p><br/><p>Now that he was in mid Foundation Establishment, he could actually absorb a full cup of Heavenspan River water. It was there above his fourth spiritual sea, rapidly being absorbed. With the help of some medicinal pills, Bai Xiaochun helped the process along, and could sense that his aura was becoming more and more like the Heavenspan River’s.</p><br/><p>Bai Xiaochun had the strange feeling that his current level of power didn’t quite make him invincible within Foundation Establishment, but would surely allow him to crush almost any opponents who came his way.</p><br/><p>After coming to the Blood Stream Sect, he had not unleashed his Heavenspan Dharma Eye on many occasions. However, he continued to cultivate it, making it grow more and more itchy, and at the same time, more powerful. Bai Xiaochun had the feeling that once he opened that eye and revealed its power, it would shake heaven and earth.</p><br/><p>The only things Bai Xiaochun wasn’t very satisfied with were his Human Controlling Grand Magic and protomagnetic power. After beginning to cultivate the Violet Qi Heavenspan Incantation, his strength in control power had grown, but was still relatively limited.</p><br/><p>He had spent a lot of time studying protomagnetic power, and had never given up on his plans to develop it. However, he seemed to have reached a barrier that he couldn’t pass.</p><br/><p>It was very frustrating, but there was nothing he could do about it other than spend some time every day on study and contemplation regarding how to progress.</p><br/><p>There was one other thing that he spent time thinking about, and that was the Middle Peak blood master trial by fire that Song Junwan had mentioned, and how she wanted his help.</p><br/><p>“If Song Junwan becomes blood master, then it stands to reason that the grand elder position will open up. Usually, someone would be promoted from among the bloodstreak elders. However, I bet that if someone was famous enough, they might be considered even if they weren’t a bloodstreak elder already!”</p><br/><p>By this point in time, Bai Xiaochun had suffered enough at the hands of the talking rabbit that he only delivered internal monologues. However, his eyes still shone brightly at the thought of the grand elder position opening up.</p><br/><p>That would be his greatest chance to successfully acquire the relic of eternal indestructibility, and then finally be able to leave the Blood Stream Sect.</p><br/><p>“I'm already just as famous in the Blood Stream Sect as Song Que is, which means I'm already above the bloodstreak elders. I'm probably not famous enough to directly become grand elder, though. In the next few months, I need to do something to make myself even more famous. Whether it’s good or bad, I need to convince people that, despite only being in Mortal-Dao Foundation Establishment, I'm still a shocking and incredible expert!” His eyes began to shine even more brightly than before.</p><br/><p>And that was how the days passed. The war between the Profound Stream Sect and the Pill Stream Sect had already reached the point where both sects had mobilized all of their forces.</p><br/><p>Rumors about the war swirled. Some stories were true, some were false, but they all left the Blood Stream Sect disciples in shock. At the same time, the war preparations in the Blood Stream Sect were nearing completion, and disciples were already being dispatched from the sect to parts unknown.</p><br/><p>Bai Xiaochun could see the blood clouds which hovered over the sect growing larger, and building up pressure to a terrifying degree. Even the blood qi within the sect seemed to be growing stronger.</p><br/><p>Despite the fact that Bai Xiaochun was in secluded meditation and rarely emerged, stories about Nightcrypt continued to spread, and they only grew more fantastic as time went on.</p><br/><p>For some reason, a lot of people knew why Song Que had been punished by being sent into secluded meditation. There even seemed to be some hidden force trying to get people riled up against Nightcrypt. As time progressed, the cultivators of Middle Peak continued to grow both more hateful of him, and more fearful.</p><br/><p>People even began to talk about how Nightcrypt and Young Lady Xuemei didn’t get along, and many people hoped that she would eventually put him in his place.</p><br/><p>“Young Lady Xuemei, please come out and teach Nightcrypt a lesson!”</p><br/><p>“Nightcrypt is so terrifying! Everyone on Middle Peak and Corpse Peak is miserable because of him....”</p><br/><p>“Middle Peak’s grand elder always takes Nightcrypt’s side. Young Lady Xuemei, please come out and cut him down!”</p><br/><p>Xuemei got requests like that just about every day. At the same time, stories about Nightcrypt continued to spread. Eventually, it reached the point where many people viewed him as something on the level of a devil king.</p><br/><p>However, there wasn’t much Xuemei could do. Nightcrypt was favored by the patriarchs, skilled in the Dao of medicine, extremely famous, and had a reputation that put him on the same level as Song Que.</p><br/><p>A person like that wasn't somebody that Xuemei could openly make a move against. Furthermore, she could sense that he possessed extraordinary battle prowess, and knew that if she fought him, she wouldn’t be able to beat him quickly.</p><br/><p>So she sat down cross-legged in her immortal's cave, eyes flashing coldly as she contemplated the matter. It wasn’t lost on her that someone was trying to provoke her into killing Nightcrypt.</p><br/><p>In the end, she didn’t care who it was that was doing such a thing. After all, she already wanted to kill Nightcrypt.</p><br/><p>“It won’t be long now before the blood master trial by fire begins, and that slut Song Junwan and I will finally face off. Song Junwan is probably counting on Nightcrypt to help her, so getting rid of him would be a boon for me.” Xuemei chuckled coldly, the killing intent in her eyes growing more intense.</p><br/><p>“Nightcrypt never made much of a name for himself before. But after he came back from the Fallen Sword Abyss, he suddenly rose to the top. It's almost like he's a different person. So very strange!</p><br/><p>“There’s definitely something fishy going on with him. Definitely! I just need to find out what it is!” Since she knew she wasn’t a match for him openly, it was time to start plotting. At a point when the sect was just on the verge of going to war, the potential for destructive consequences was even greater.</p><br/>\n</div>"}