{"title": "Chapter 250: Die!", "id": 250, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-250-die", "volume_title": "Volume 3", "body": "<h1>Chapter 250: Die!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"background-color: initial; font-size: 0.875rem\">Song Junwan had said to pay special attention to three of Xuemei’s Dharma protectors. One of them was Xiao Qing, who was on the very cusp of Core Formation. Perhaps because of certain conditions in the Blood Wasteland itself, it was difficult for him to break through here. However, one could imagine that even after half of a breakthrough, he would still be powerful enough to dominate anyone else.</span></p><br/><p>The second person Song Junwan had mentioned was Zhang Yunshan. The third was the very person who was closing in on Bai Xiaochun at this very moment... Yang Hongwu!</p><br/><p>Yang Hongwu’s cultivation base was in the late Foundation Establishment stage, and he had a powerful magical treasure. It was essentially a precious relic that could unleash terrifying power that exceeded his current cultivation base realm. With that item, he was virtually invincible to anyone in the same realm as him.</p><br/><p>Up to this point in his cultivation, Bai Xiaochun had never possessed any powerful magical treasures other than the turtle-wok. Had he remained in the Spirit Stream Sect, he would definitely have been bequeathed one by the sect itself when he reached late Foundation Establishment. However, he had left when he was still in early Foundation Establishment, before he qualified for such a reward.</p><br/><p>After all, such powerful magical treasures were generally not given to anyone under late Foundation Establishment. Not only would such a person have difficulty unleashing the full potential of the item, there was also the risk that it could be robbed from them.</p><br/><p>Bai Xiaochun’s pupils constricted; almost as soon as the smoke began to spread out from Yang Hongwu’s incense, it filled his mind with a sense of imminent crisis. His fleshly body power was incredibly high, which lessened the sensation of danger, and yet, he was still jumpy with fear.</p><br/><p>From what he could sense, if that power continued to build up, then it could seriously affect him in a negative way. By this point, his eyes were completely bloodshot.</p><br/><p>“There are too many people and too many eyes in this place. So many techniques that I just can’t use....” Bai Xiaochun gritted his teeth, and then began to draw upon the Undying Heavenly King. His hands flashed in a double-handed incantation gesture, and moments later, a bizarre power surged out from the palms of his hands.</p><br/><p>It was the power of gravity and repulsion, which he could just barely unleash. He had only ever scraped the surface of protomagnetic power, but was still able to call upon it when needed.</p><br/><p>Bai Xiaochun let out a hoarse shout as the two streams of power burst out, then converged together to form a powerful force of repulsion. He was immediately pushed backward at top speed, and in the blink of an eye, was speeding off into the distance.</p><br/><p>Even as he did, the smoke coming from Yang Hongwu’s incense sliced through the air into the spot he had just occupied. Considering how it seemed to slash rifts everywhere it went, it was obvious that if Bai Xiaochun had been even a bit slower, he would have been cut to pieces.</p><br/><p>Xuemei’s Dharma protectors frowned, and killing intent flickered in Yang Hongwu’s eyes. Bai Xiaochun had already evaded him twice, even with his powerful magical treasure. That was something he found to be highly unusual.</p><br/><p>“Measly Mortal-Dao mid Foundation Establishment. I can’t believe he actually evaded me twice.... Seems like he’s harboring a lot of secrets.” Yang Hongwu took a deep breath, and then his chest caved in. Suddenly, his speed skyrocketed, pushing him past all of the other cultivators, transforming him into a beam of light that shot directly after Bai Xiaochun.</p><br/><p>He breathed in, but never exhaled, and then, a few moments later, he took another deep breath. Yet again, his chest caved in, and his speed increased, closing the distance between himself and Bai Xiaochun.</p><br/><p>Seeing Yang Hongwu speed up toward him, Bai Xiaochun’s eyes grew even more bloodshot than before.</p><br/><p>“You think I’m so easy to pick on?!” he shouted. Suddenly he spun in place, and instead of fleeing, barreled toward Yang Hongwu.</p><br/><p>He shot faster than a bolt of lightning, appearing directly in front of Yang Hongwu and unleashing a punch with his right hand.</p><br/><p>Killing intent flickered in Yang Hongwu’s eyes as he extended his own right hand. The incense burned, and smoke swirled out toward Bai Xiaochun.</p><br/><p>“So, you wanted to lure me out to fight alone? Fine, take your shot!” Yang Hongwu laughed coldly as his powerful magical treasure spewed out even more smoke, creating a web of death that caused Bai Xiaochun’s scalp to tingle so hard it felt like it might explode. And yet, he didn’t dodge to the side. As the smoke bore down on him, he poured even more power into his fist strike.</p><br/><p>Rumbling sounds could be heard as the energy of the second level of Bai Xiaochun’s Undying Heavenly King erupted out. The power of seven berserk ghosts could shake mountains, and at this moment, it caused sonic booms to echo out. The massive outpouring of power even caused a massive wind to spring up.</p><br/><p>From a distance, the scene playing out was completely shocking. As Bai Xiaochun punched out, the image of a berserk ghost appeared behind him. This was no ordinary berserk ghost; it was like the king of all berserk ghosts, and it howled at the top of its lungs as Bai Xiaochun punched out.</p><br/><p>Shockingly, the smoke which filled the area immediately began to shrink back as if it were about to be destroyed!</p><br/><p>Although all of this takes some time to describe, it actually happened in the time it takes a spark to fly off of a piece of flint. Rumbling sounds echoed out as the massive blast slammed into Yang Hongwu. Blood oozed out of the corners of his mouth as he was shoved backward. His eyes suddenly shone with intense fear. Obviously, he had been aware that Nightcrypt possessed shocking battle prowess, but had still been confident enough to fight him alone. As of this moment, though, he could see that Nightcrypt was even more terrifying than he had realized before.</p><br/><p>Blood also sprayed out of Bai Xiaochun’s mouth, and he felt like his body was about to be torn to pieces by the web of death. The power of Yang Hongwu’s magical treasure slashed into the image of the berserk ghost, and yet, the power of Bai Xiaochun’s Undying Heavenly King ensured that he wasn’t seriously injured, much less ripped to shreds. It took some effort, but he managed to wrench free from the smoke, destroying it in the process.</p><br/><p>Even as the wisps of smoke dissipated, the air not too far away from Bai Xiaochun distorted, and someone materialized. It was a young man with a fan in his hand. His expression was dark and somber, and his eyes flickered with killing intent. Without any hesitation, he waved his fan in Bai Xiaochun's direction.</p><br/><p>Wind screamed, transforming into a tornado that connected the sky and the land as it raced toward Bai Xiaochun.</p><br/><p>“Zhang Yunshan!” Bai Xiaochun’s pupils constricted from the sensation of imminent crisis. Throwing his head back, he roared, and his energy began to rise as another berserk ghost appeared behind him, then a third, and a fourth....</p><br/><p>In the blink of an eye, seven berserk ghosts had appeared, causing heaven and earth to shake violently. All of them threw their heads back and bellowed. Although the terrifying energy they were releasing wasn't quite enough to form the Heavenly Demon Body, it was enough to create.... a giant hand!</p><br/><p>It was a giant, pale white hand, not the clawed hand of a ghost, but rather a heavenly demon hand!</p><br/><p>It was as pale as death, and the outlines of scales could just barely be seen on its surface, as well as vicious-looking bone spurs. As soon as the hand appeared, it smashed out toward Zhang Yunshan!</p><br/><p>The first thing it hit was the tornado. A huge boom echoed out as the tornado shattered, and at the same time, the heavenly demon hand flickered and faded a bit. However, it wasn't destroyed.</p><br/><p>Another boom could be heard, and blood oozed out of the corners of Zhang Yunshan’s mouth. Even as he flew back at top speed, the heavenly demon hand faded away. Bai Xiaochun’s face was ashen, and he coughed up another mouthful of blood. His eyes were crimson, making him look cruel and vicious to the extreme. With a quick glance at Yang Hongwu and Zhang Yunshan, he turned and sped off into the distance.</p><br/><p>Yang Hongwu hesitated for a moment, wiping the blood from his mouth. At the moment, he was too shaken to chase after Bai Xiaochun. The power that had just been unleashed, especially in that last attack, left him with the sinking feeling that Nightcrypt... hadn’t even called upon his full battle prowess.</p><br/><p>Even Zhang Yunshan’s sneak attack had done nothing more than cause Nightcrypt to unleash even more power.</p><br/><p>“Just how many secrets does this guy have...?!” Yang Hongwu took a deep breath. As for the youthful-looking Zhang Yunshan, his face was equally grim as he watched Bai Xiaochun flee.</p><br/><p>The rest of the pursuers were completely shocked, and all hesitated. After a moment passed, though, Zhang Yunshan and Yang Hongwu exchanged a glance, and then their eyes flickered as they led the group in pursuit.</p><br/><p>Bai Xiaochun’s face was ashen as he sped along. On the outside, he seemed vicious and cruel, with his clothes stained with blood. However, inside, he was listless and panting.</p><br/><p>“What a bunch of bullies. If I didn’t have to be careful to keep my secret identity, I could wipe the floor with them.... Dammit. There are still six more hours left before this thing is over....” His anxiety increased as the seventh hour neared.</p><br/><p>This time, he was mentally prepared. At the top of the hour, when the key was just about to appear, and he was just about to flee, he heard one of Song Junwan’s other Dharma protectors crying out.</p><br/><p>“Nightcrypt, don’t absorb any more keys! Give them to us!”</p><br/><p>“Nightcrypt, stop it!” Song Que howled.</p><br/><p>It was at that exact moment that the fourth key popped out, and immediately began to speed toward Bai Xiaochun. It was almost as if he were a magnet, and no matter what he wanted, the keys would fly in his direction, transform into blood qi, and incite his Undying Heavenly King.</p><br/><p>“Nightcrypt, are you... are you looking to die?!?!” Song Que was furious, and the other Dharma protectors felt like they were going insane. Once they saw Bai Xiaochun starting to absorb the fourth key, they couldn’t hold back any longer.</p><br/><p>After all... they weren’t sure if the keys still counted as being won by their team if Bai Xiaochun absorbed them. If they did, then things were fine. But if they didn’t, then when the wind of extermination swept through the wasteland... well, Song Que and the others didn’t dare to gamble on the outcome.</p><br/><p>“I don’t want this either....” Bai Xiaochun wailed. His original plan had been to hide somewhere in the Blood Wasteland and let everyone fight it out, then snatch one of the keys toward the end. But now, all of his plans were laid to ruin.</p><br/>\n</div>"}