{"title": "Chapter 261: Come Out, Du Xuemei!", "id": 261, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-261-come-out-du-xuemei", "volume_title": "Volume 3", "body": "<h1>Chapter 261: Come Out, Du Xuemei!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun also had the premonition that a single thought on his part could unleash blood qi to bolster anyone who cultivated with the help of the Blood Ancestor, and lead to an explosive rise in battle prowess.</p><br/><p>The mere idea left Bai Xiaochun’s heart pounding. After blinking a few times, he couldn’t help but imagine what it would be like to shock the entire Blood Stream Sect with the wave of a hand.</p><br/><p>But then he imagined another scene in which, after raising his hand, the Blood Stream Sect went crazy trying to kill him....</p><br/><p>Of course, imposter Nightcrypt could see everything that Bai Xiaochun was seeing, and couldn’t help but tremble and let out an incredulous shriek. “Blood... Blood Devil!! Heavens! I can’t believe... that you’ve become the Blood Devil!!”</p><br/><p>The Blood Devil was a legend in the Blood Stream Sect. Supposedly, he would either lead the Blood Stream Sect to glory, or completely destroy it!</p><br/><p>As soon as imposter Nightcrypt’s voice rang out in Bai Xiaochun’s mind, Bai Xiaochun took a deep breath, and his expression turned very serious.</p><br/><p>“Quiet down!” he said, patting his bag of holding and looking around, heart pulsing with both excitement and anxiety.</p><br/><p>“My original purpose was to become the grand elder.... Then I became a blood master, a development I could handle. Who could have imagined that I would become the Blood Devil...?” Although he couldn’t help but feel wonderful, he was also scowling.</p><br/><p>After all, some people in the sect would happily welcome the Blood Devil, whereas others... wouldn’t permit him to exist, and would do anything to kill him!</p><br/><p>“I definitely can’t let anyone in the Blood Stream Sect know what’s happened.... Ai. Being too outstanding is really annoying sometimes.” Sighing, he stuck his chin up and waved his sleeve, looking very much like a lonely hero.</p><br/><p>“With the snap of a finger, I, Bai Xiaochun, reduced the Blood Stream Sect to ashes....” He sighed, thinking about how he had accomplished something in the Blood Stream Sect... that he would never have been able to accomplish in the Spirit Stream Sect.</p><br/><p>As he thought back to everything he had done here, he sighed even more. Then he remembered that beneath Xuemei’s mask was Du Lingfei’s face, and a profound gleam appeared in his eyes.</p><br/><p>“Xuemei... Du Lingfei!” Taking a deep breath, he took a step forward and drew upon the legacy within him. Instantly, a vortex appeared in front of him, which he stepped into and vanished.</p><br/><p>When he rematerialized, he was outside of the Blood Ancestor’s body, hovering in midair above the Blood Stream Sect, within the convergence of the blood qi that resembled his face.</p><br/><p>Numerous people were wrapped up in their speculations about what was happening, and as soon as they caught sight of him, cries of surprise rang out.</p><br/><p>“He’s come out!!”</p><br/><p>“He stayed inside the Blood Ancestor’s body for much longer than any of the other blood masters. Could it be that he found some other sort of good fortune?”</p><br/><p>“Hmm. Nightcrypt definitely seems a lot more powerful than he was before....”</p><br/><p>Song Que grumbled bitterly. Xu Xiaoshan sighed. Master God-Diviner stood there trembling. Numerous gazes were all focused on Bai Xiaochun. Everyone was wrapped up in their own thoughts. However, the cultivators from Middle Peak were shaking, and the pressure that radiated out from Bai Xiaochun caused them to involuntarily bow their heads and then drop down to kowtow.</p><br/><p>The entire Blood Stream Sect was shaken. Bai Xiaochun hovered in midair, looking down at all the disciples and their reactions. He enjoyed being the center of attention, and on any other occasion would have assumed the pose of a member of the Senior generation. But at the moment, he was somewhat distracted. In fact, his attention was soon drawn to Ancestor Peak.</p><br/><p>There, he could sense Xuemei’s aura.</p><br/><p>Whether it was because of becoming a blood master, or the Blood Devil, Bai Xiaochun was pleased to some extent, but not as much as he might have been, and the reason for that was Du Lingfei.</p><br/><p>“So, Du Lingfei is Xuemei....” he murmured to himself. “And Xuemei is Patriarch Limitless’s only daughter, with a very high position in the Blood Stream Sect....”</p><br/><p>Although Bai Xiaochun could never have predicted that Xuemei would be Du Lingfei, now that he thought about it, it did make sense.</p><br/><p>After another moment of thought, his eyes flashed, and he transformed into a beam of light that shot toward Ancestor Peak. As he neared, numerous streams of divine sense appeared to examine him, but none blocked his path.</p><br/><p>Without the slightest hesitation, he stepped onto the mountain and then began to follow Xuemei's aura to her immortal's cave.</p><br/><p>It was surrounded by a grove of plum trees, and was closed tight. Apparently, Xuemei didn’t want to see anyone at the moment.</p><br/><p>Bai Xiaochun stood at the border of the plum tree grove, looking at the large door. He wanted to see Xuemei, and ask her a question!</p><br/><p>From the moment that Du Lingfei had disappeared, all the way until Sect Leader Zheng Yuandong had identified her as the spy in the sect, that question had been burning in Bai Xiaochun’s heart.</p><br/><p>He wanted to know whether the things that had occurred back in the Spirit Stream Sect, especially the connection that had appeared between them when they were being chased by the Luochen Clan... were real or not!</p><br/><p>“Xuemei, come out and see me!!” he said loudly, his voice echoing among the plum trees. The people on Ancestor Peak who were watching him all heard what he said.</p><br/><p>Inside the immortal's cave, Xuemei also heard. However, even after waiting for some time, Bai Xiaochun got no response.</p><br/><p>“Du Xuemei, come out and see me!!” he said again. This time, he spoke even more loudly. By this point, all of the patriarchs on Ancestor Peak were watching the scene, as were the prime elders, and the blood rippers in their secluded meditation facilities.</p><br/><p>They weren’t sure exactly what had occurred between Xuemei and Nightcrypt, but they could well imagine what sorts of things might have happened in the struggle between her and Song Junwan, a struggle that ended with Nightcrypt becoming the blood master.</p><br/><p>Time passed. Several hours later, there was still no response from within Xuemei’s immortal's cave. Bai Xiaochun stood outside of the plum tree grove, surrounded by silence, his expression gradually turning grimmer and grimmer.</p><br/><p>Shaking his head bitterly, he gave one last look at the immortal's cave within the grove of plum trees, then slowly turned and left. If she didn't want to see him, then he didn’t want to stand around uselessly.</p><br/><p>Before he could leave Ancestor Peak, though, a beam of light flew down to meet him. A figure soon became visible, and it was none other than Song Junwan.</p><br/><p>Bai Xiaochun stopped in place and looked up at her. When their gazes met, he could see the mixed emotions in her eyes. Although she had thrown her command medallion to him, and had also said she would support him if he stopped Xuemei and became blood master himself, it was still impossible for her to cover up the complex emotions that she felt.</p><br/><p>“I....” he began nervously. However, before he could say anything else, Song Junwan clasped hands and bowed.</p><br/><p>“Song Junwan offers greetings, Blood Master. Please tarry a moment, the Song Clan patriarch wishes to see you!”</p><br/><p>Bai Xiaochun stood there thoughtfully for a moment, then buried the matter of Du Lingfei deep in his heart; he didn't feel like thinking about it any longer. Instead, he considered the situation at hand. Even though he had technically become the blood master, if the sect itself didn’t approve of the situation, anything could happen.</p><br/><p>“My goal here is to get the relic of eternal indestructibility....” he thought. “I can’t stop Du Lingfei if she wishes to reveal my identity. If she doesn’t, though, then I have to pass the next test, which means seeing the Song Clan patriarch!” His thoughts were in chaos, but he managed to pull himself together and nod in response to Song Junwan. Then the two of them headed toward the Song Clan patriarch’s immortal's cave on Ancestor Peak.</p><br/><p>Song Junwan maintained her silence along the way, and Bai Xiaochun wasn’t really sure what to say. When they reached the entrance to the immortal's cave, Song Junwan stopped and looked over at him.</p><br/><p>“I don’t regret what I promised,” she said. “I've already explained everything to the patriarch. In my heart, you are the blood master. As for how the patriarch views the matter, I’ve done everything I can to convince him to agree with me.”</p><br/><p>Bai Xiaochun nodded. Then, taking a deep breath, he gritted his teeth and walked into the immortal's cave. As he passed her, Song Junwan hesitated for a moment, and then added one more thought.</p><br/><p>“There have been times in the past when outsiders acquired the position of blood master. You... can take a hard stance with him.” With that, she turned and left.</p><br/><p>Bai Xiaochun watched her leave, then continued on into the immortal's cave. Before long, he was in the cave’s main hall. The first thing he saw was the Song Clan Patriarch, sitting cross-legged on a stone dais!</p><br/><p>The patriarch seemed to emanate a feeling of profound age, and was surrounded by intangible fluctuations. As soon as Bai Xiaochun neared, he felt incredible pressure weighing down on him.</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The pressure from the patriarch’s cultivation base caused Bai Xiaochun to stop in his tracks, trembling. It felt as though countless mountains were crushing down onto him, and forced him to push back with all the might his cultivation base could muster.</p><br/><p>After a moment, the pressure suddenly vanished, causing Bai Xiaochun’s cultivation base power to suddenly run wild inside of him. The heavenly demon appeared behind him, and his mid Foundation Establishment cultivation base erupted.</p><br/><p>In that moment, the Song Clan patriarch opened his eyes, and his shining gaze came to settle on Bai Xiaochun, seemingly piercing into the deepest layers of his heart.</p><br/><p>Thankfully, Bai Xiaochun had his heaven-defying mask. Despite the fact that he had lost control of his cultivation base, the mask still concealed his true level. The Song Clan patriarch looked him up and down, and apparently didn’t notice anything out of the ordinary.</p><br/><p>The entire process only lasted for a few breaths’ worth of time, but to Bai Xiaochun, it seemed much longer than that. Sweat was rolling down his face by the time the Song Clan patriarch retracted his piercing gaze. At that point, Bai Xiaochun took a deep breath, clasped hands and bowed deeply.</p><br/><p>“Nightcrypt offers greetings, Patriarch.”</p><br/>\n</div>"}