{"title": "Chapter 274: Once Upon A Time, I Was Also A Crazy Teen!", "id": 274, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-274-once-upon-a-time-i-was-also-a-crazy-teen", "volume_title": "Volume 3", "body": "<h1>Chapter 274: Once Upon A Time, I Was Also A Crazy Teen!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After leaving the bank of the Heavenspan River, Bai Xiaochun was in very high spirits. He decided that he needed to remember that saying; it was definitely very useful.</p><br/><p>“Hmmmmph! In the future, whenever I see things I don’t like, I can use that phrase to scare people. It will definitely put people in their place!” After returning to the Beast Conservatory, he thought some more about how to refine the River-Defying Pill, and after hesitating a bit, he gritted his teeth and started working.</p><br/><p>To make the River-Defying Pill, he needed to use his own body as the furnace. On the second day of his efforts, he screamed, and then poofing sounds could be heard, after which he flew out of his room.</p><br/><p>Even after emerging out into the open, more poofing sounds could be heard coming from behind him.</p><br/><p>“How could this be happening...?” he said. His insides felt like they were completely filled with swirling gas. The process of expelling it frightened Bruiser so much that he fled. Before long, the entire honor guard station was filled with a noxious odor.</p><br/><p>Bai Xiaochun was scowling on the verge of tears. The effects of the gas continued for almost the entire day before fading away. Bai Xiaochun was so frightened that he didn’t dare to perform any more tests.</p><br/><p>“That thing is definitely not meant to be concocted by people. Terrifying! I always blow up furnaces when I concoct medicine. But if I use myself as the furnace to concoct a River-Defying Pill, then what happens if there’s an explosion...?” Having reached this point in his train of thought, Bai Xiaochun felt more terrified than before. Worried that he might lose his poor little life, he decided to give up.</p><br/><p>“I'm definitely not going to concoct that pill!” When he thought about the day of misery he had just endured, he suddenly had an inkling of what it must feel like to be a bystander to his own pill concocting.</p><br/><p>Even as he stood there sighing, several beams of light appeared outside of the Beast Conservatory. It was Big Fatty Zhang, Third Fatty Hei, and Xu Baocai. Almost Immediately, they detected the noxious odor filling the honor guard station.</p><br/><p>“What’s that smell?” Big Fatty Zhang said, eyes wide.</p><br/><p>“Is that...?” Xu Baocai looked shocked. Then he seemed to think of something so outrageous that he immediately dismissed the notion.</p><br/><p>Third Fatty Hei was actually a slender young woman. Her skin wasn’t very fair, but she was tall and heroic-looking. At the moment, even she was frowning.</p><br/><p>Bai Xiaochun started to blush, and then cleared his throat.</p><br/><p>“Oh, that’s Bruiser. He ate some bad meat the other day.”</p><br/><p>Bruiser was currently standing off in the distance, and when he heard what Bai Xiaochun was saying, he was about to howl. However, a glare from Bai Xiaochun caused him to sit down dejectedly and stare at the group.</p><br/><p>Seeing that Big Fatty Zhang and the others were still suspicious, Bai Xiaochun quickly changed the subject.</p><br/><p>“So anyway, what are you guys doing here?”</p><br/><p>Declining to press Bai Xiaochun about the noxious odor, Big Fatty Zhang looked over and said, “We came to bid you farewell. Tomorrow, the third wave will teleport away, and we three are part of it.”</p><br/><p>When Bai Xiaochun heard that, his heart trembled. Big Fatty Zhang, Third Fatty Hei, and Xu Baocai had all experienced significant advances in their cultivation base while he was in the Blood Stream Sect. As of this point, all of them were Inner Sect disciples.</p><br/><p>None of them had reached Foundation Establishment yet, only the great circle of Qi Condensation. People like that wouldn't be of much use on the battlefield. However, a large group of them together would be able to power a spell formation, something that could unleash terrifying energy.</p><br/><p>Unsure of what to say, Bai Xiaochun maintained his silence. The entire group felt as if a great weight were settling onto their shoulders.</p><br/><p>“We might not necessarily lose this war,” Third Fatty Hei said. “Since we have to fight, then we might as well work together to cut down the enemy!” Her words seemed to lift the spirits of Big Fatty Zhang and Xu Baocai.</p><br/><p>Bai Xiaochun looked around at his friends, and then thought about the comrades who had died in the Fallen Sword Abyss. He simply couldn’t imagine what it would be like to see Big Fatty Zhang and his other close friends falling in battle. He didn't want to see anybody die in the fighting. He didn’t want any war. He just wanted everyone to keep living together happily.</p><br/><p>“Don’t look like that, Xiaochun,” Big Fatty Zhang said. “We're not necessarily going to die. Come, come. We haven’t had a drink together in a long time. Let’s get drunk!” Laughing heartily, he produced a flagon of alcohol from his bag of holding. Everyone sat down and began to drink.</p><br/><p>Time passed, and as they chatted, the heavy mood from before lifted. Laughing the whole time, Big Fatty Zhang talked about all of Bai Xiaochun’s misadventures when he had joined the sect. Eventually, he reached the subject of the spirit tail chickens.</p><br/><p>“Now hold on,” Bai Xiaochun said. “Those spirit tail chickens are just delicious.... Man, I miss them.”</p><br/><p>“I blame you two for dragging me into that!” Third Fatty Hei said, her face flushing. She had also participated in the Chicken-Thieving Fiend scandal, and had been severely berated by her Master because of it.</p><br/><p>Xu Baocai beat his chest in lamentation regarding the matter of the blood notice he’d given to Bai Xiaochun. At some point, somebody suggested that they actually go steal a chicken, and before they knew it, they had rushed over to the south bank. A short while later, they had a few chickens in hand, which they began to roast over an open flame.</p><br/><p>As evening fell, Big Fatty Zhang suggested that they go back to the Ovens. The Ovens crew was delighted to see everyone, especially the fatties from years before who were still working there. Without any hesitation, large amounts of food and alcohol were produced.</p><br/><p>As the sound of laughter and chatting rose up into the air, Hou Xiaomei arrived. Bai Xiaochun pulled her over to sit next to him, and as she drank, her lovely face grew more flushed, and as a result, more attractive.</p><br/><p>Chen Fei even showed up, albeit uninvited. The night wore on, and soon, Bai Xiaochun was drunk.</p><br/><p>Feeling more relaxed than ever, he pointed at Third Fatty Hei and yelled, “Third Girly, you bastard, I always thought you were a dude! I can’t believe you turned out to be a girl!”</p><br/><p>Third Fatty Hei glared at him, then snorted coldly and took a drink.</p><br/><p>“Hey, Big Fatty, do you remember that Elder Sister with the pock-marked face? You know, the one who brought me here to the Ovens? You said something about the magpies singing. You had a huge crush on her. Remember? Well, what happened? Come on, tell us the truth!”</p><br/><p>“Xu Baocai, that blood notice of yours scared your Sect Uncle Bai half to death!”</p><br/><p>“Chen Fei, you momma’s boy, I can’t believe you tried to ambush me. Hummmphh!”</p><br/><p>“Bai Xiaochun, whenever we split the food loot, you always ate the most!”</p><br/><p>“Yeah, that’s right! By the way, did you know that the story about making the bowl bottoms thicker has become a legend here in the Ovens!?”</p><br/><p>“Hahaha! Remember when we blocked the paths to the finish line...?”</p><br/><p>“I'm sorry for what I did, Sect Uncle Bai...”</p><br/><p>Everyone was jumping into the conversation.</p><br/><p>Eventually, Big Fatty Zhang pulled out his wok, placed it down next to him, and excitedly yelled, “I would rather starve to death in the Ovens--”</p><br/><p>“--than go climb the ladder in the Outer Sect!!” Bai Xiaochun finished at the top of his lungs. Third Fatty Hei and the other fatties all howled in response.</p><br/><p>Although Xu Baocai wasn’t from the Ovens crew, he also joined in. Even Chen Fei was moved, and soon, everyone was yelling at the tops of their lungs.</p><br/><p>At one point, Bai Xiaochun raised his flagon of alcohol and said, “<em>Fruits and herbs of a magical nature; Nibble the edges but spare the stem; Slice the meat thin when there’s some to butcher; As for the bones, leave some flesh on them; Spirit congee? Water it down until it’s thin; Fine wine? Half a cup will do you in!</em>”</p><br/><p>“Wait, hold on, hold on!” Big Fatty Zhang said. “We can’t just have six lines of truth. We need to add two more lines. Let’s see. <em>Make the bowl bottoms thicker by a thumb. Give all the chickens to Bai Xiaochun!</em>”</p><br/><p>Big Fatty Zhang roared with laughter and slapped Bai Xiaochun’s shoulder. Then he staggered off to the side and slumped down to the ground, completely drunk.</p><br/><p>It was rare to have a situation where everyone completely enjoyed themselves. However, a war was coming, and nobody was sure whether or not they would live to see the end of it. Therefore, they spent the night forgetting about their worries, drinking and yelling and laughing.</p><br/><p>The sound of the commotion drew more attention, and people rushed over to see what was happening. Before long, a raucous party was underway in the Ovens.</p><br/><p>Hou Xiaomei remained glued to Bai Xiaochun’s side. Of course, the effects of the spirit alcohol were something that even cultivators couldn’t ignore, and slowly, she was getting drunk too.</p><br/><p>By the time the third watch came, the Ovens was getting quiet, but Bai Xiaochun forced his eyes to remain open. Looking around at the quiet scene around him, his eyes began to shine.</p><br/><p>Picking up a flagon of alcohol, he guzzled down a mouthful, then slowly looked at all the unconscious figures around him. It was almost as if he were trying to commit their faces to memory. His grip on the alcohol flagon grew tighter, as if he were trying to forever brand this one moment of time into his heart. Or perhaps it was because there was a burgeoning determination inside of him to change the world around him into something else....</p><br/><p>Eventually, his legs wobbled, and he slumped down into sleep. However, he continued to grip the flagon so hard that veins bulged out on the back of his hand.</p><br/><p>At dawn, brilliant pillars of light climbed up from Irispetal Peak and Violet Cauldron Peak. Rumbling filled the air as numerous figures flew toward the mountain peaks.</p><br/><p>Big Fatty Zhang, Third Fatty Hei, Xu Baocai, and Chen Fei were among them. There were also legacy echelon cultivators and patriarchs. The third wave of nearly 30,000 cultivators was soon gone, teleported away.</p><br/><p>Bai Xiaochun lay there in the Ovens, watching as Big Fatty Zhang and his other friends left. An intense determination burned deep in his eyes.</p><br/><p>Hou Xiaomei was still by his side. “Big bro Xiaochun…” she said softly. “I'm in the fourth wave.”</p><br/><p>Bai Xiaochun clasped her hand in his. Voice soft but determined, he said, “I’ll always be here for you!”</p><br/><p>Now that the third wave had left, the Spirit Stream Sect was almost half empty. At the same time, the sect’s spell formations were almost completely activated.</p><br/><p>A few days later, Sunset Peak, Archway Peak, and Fragrant Cloud Peak, the final three mountain peaks, all erupted with heaven-shaking, earth-shattering pillars of light.</p><br/><p>As of this point, all of the spell formations in the Spirit Stream Sect had been fully activated, and the sect was completely locked down tight.</p><br/><p>Patriarch Ironwood appeared, along with the remaining legacy echelon cultivators and prime elders. Zheng Yuandong was there, along with Li Qinghou, Xu Meixiang, and the other peak lords.</p><br/><p>Most of the elders, Inner Sect disciples, and Outer Sect disciples also appeared. This was the fourth wave.</p><br/><p>There would be a fifth wave, with the most powerful reserves of the sect, but this fourth wave was the largest so far. There were nearly 50,000 people present.</p><br/><p>Bai Xiaochun looked at the pillars of light and took a deep breath. As he emerged from the Beast Conservatory, Bruiser followed him, and he didn’t look as frisky as usual. Apparently, he realized that war was coming. He and Bai Xiaochun then shot toward the nearest pillar of light.</p><br/><p>A large crowd was present. When Bai Xiaochun showed up, and people recognized him, many of them edged closer to him. Although he was naughty and mischievous, the stories about what he had done in the Fallen Sword Abyss proved that when danger came, he was the person to trust!</p><br/><p>The Spirit Stream Sect had chosen the Luochen Mountains as the battlefield, where they could rely on their spell formation. In the region between the sect and the mountains, eight lines of defense had been set up to fall back on in case the Luochen Mountains were lost.</p><br/><p>This war would not be one of schemes and plots. It was a battle in which veins of steel were a necessity. People would be fighting to the death, and they would make it hard for the Blood Stream Sect to push them into retreat. They would show that picking on the Spirit Stream Sect was something that could not be done lightly!</p><br/><p>Soon, everyone was present, and the teleportation began!</p><br/><p>Brilliant light shot up into the air. It was as if a huge hand had grabbed everyone from the three mountain peaks and then carried them to the border with the Blood Stream Sect. The destination was...</p><br/><p>The Luochen Mountains!</p><br/>\n</div>"}