{"title": "Chapter 282: I Really Get It!", "id": 282, "volume": 3, "url": "http://boxnovel.org/a-will-eternal-chapter-282-i-really-get-it", "volume_title": "Volume 3", "body": "<h1>Chapter 282: I Really Get It!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The blood masters of Lesser Marsh Peak, Corpse Peak, and Nameless Peak were shaking visibly, and blue veins were bulging out on their necks and faces. They could instantly sense an indescribable pressure crushing down onto them, wresting away their blood master powers!</p><br/><p>Their ability to control the cultivators of their own mountain peaks was being taken away, and there was nothing they could do to stop it. In the briefest of instants, they went from occupying a high and lofty position, to being nothing more than ordinary cultivators.</p><br/><p>The grand elders of the same three mountain peaks were equally cowed.</p><br/><p>Song Junwan’s face paled, and her eyes shone with disbelief. The fact that Bai Xiaochun and Nightcrypt were one and the same was a development that had shaken countless people, but that shock was like nothing compared to what they were experiencing now.</p><br/><p>“Impossible!!”</p><br/><p>“I'm the blood master of Corpse Peak!!”</p><br/><p>“What exactly is going on? I can’t believe a simple gesture on his part can suppress all of us!!”</p><br/><p>Considering the blood masters and grand elders were reacting in that way, there was no need to even considering how the other cultivators felt. Master God-Diviner, Jia Lie, Song Que, Xu Xiaoshan, and everyone else in the Blood Stream Sect were completely rocked. It didn't matter what they wanted to happen; they had all cultivated based on the Blood Ancestor, and as such, were now being crushed by Bai Xiaochun!</p><br/><p>Bai Xiaochun waved his hand, causing a vortex to spring up and an enormous blood-colored arm to appear, and that one act changed the entire situation on the battlefield!</p><br/><p>Boundless and shocking rumbling sounds echoed out as everyone from the Blood Stream Sect, including Outer Sect disciples, Inner Sect disciples, the cultivators who inhabited the four mountain peaks, the prime elders, and even the blood rippers and patriarchs, were affected.</p><br/><p>All of them were shaken, and their faces fell. It would be an understatement to say that in their world, the sun and moon had gone dark!</p><br/><p>All of the Blood Stream Sect’s glory and power was fading. No longer did they have the advantage in any sense of the word. They were weakening, and because of the sudden turnaround, countless disciples’ minds began to collapse. Chaos instantly gripped the Blood Stream Sect.</p><br/><p>As the chaos spread, it quickly became apparent that the Blood Stream Sect was on the verge of collapsing.</p><br/><p>It was in that moment that someone, it was impossible to say who, suddenly let out a cry of terror that echoed in all directions.</p><br/><p>“The Blood Lord!! This is the power of the legendary Blood Lord!!”</p><br/><p>“Heavens! Nightcrypt.... Bai Xiaochun.... I can’t believe he's actually become the Blood Lord!!”</p><br/><p>“Blood Devil....” Such cries began to echo out one after another. Everyone was shaking inwardly, and those who hadn’t been quick to realize what was happening were dumbstruck as they heard what the others were saying. The patriarchs up the sky felt their strength fading away, and their faces flickered as they began to cry out.</p><br/><p>“I can’t believe the Blood Devil is real!!”</p><br/><p>“The Blood Lord has come! Nightcrypt acquired the Blood Lord legacy!!”</p><br/><p>“How... how can we keep fighting now?!?!”</p><br/><p>Amidst the chaos, the cultivators of the Blood Stream Sect all began to look up into the sky at the person who was single-handedly suppressing all of them: Bai Xiaochun!</p><br/><p>Bai Xiaochun’s hair was whipping about in the wind as he hovered there. Although he looked slightly more impressive than a blood master, he still didn’t seem capable of altering the tide of a deadly battle such as the one which was about to be fought.</p><br/><p>And yet....</p><br/><p>Everything had already changed. Someone who could single-handedly suppress an entire sect was not a person who could be disregarded. He was not a person who could be ignored!</p><br/><p>Bai Xiaochun took a deep breath. With the Spirit Stream Sect cultivators behind him, he stared out at the Blood Stream Sect, and although his raspy voice wasn’t very loud, it somehow filled the entire battlefield.</p><br/><p>“Now will you people listen to me...? Blood Stream Sect, if you really want to exterminate the Spirit Stream Sect, then you’ll have to do so over my dead body!” Bai Xiaochun’s energy erupted, causing blood-colored light to shoot high into the sky. At the same time, the pressure weighing down on the Blood Stream Sect increased, and his words seemed to crash like thunder in their ears.</p><br/><p>The refined corpses were trembling, and one by one, began to bow their heads. The grand lich’s eyes seemed to burn with sparks of flame as it threw its head back and roared, flying through the air to stand in front of Bai Xiaochun.</p><br/><p>His emerald zombie let out a similar howl, causing countless green hairs to shoot out into the surrounding zombies. In response, the other zombies’ pupils dilated, and they suddenly turned on their masters in the Blood Stream Sect!</p><br/><p>Things weren’t over yet. Among the cloud of gargoyles was one seemingly ordinary gargoyle who suddenly let out an ear-piercing cry, causing all of the other gargoyles to similarly turn on the Blood Stream Sect and bare their fangs!!</p><br/><p>Now, not only had the Blood Stream Sect’s cultivators been suppressed, more than half of the power at their disposal had been taken away from them!</p><br/><p>The Blood Stream Sect patriarchs looked at Bai Xiaochun with ashen faces and unprecedentedly complex expressions.</p><br/><p>“He's the Blood Lord!”</p><br/><p>Whether it was the arch-patriarch, Patriarch Limitless or even the Song Clan patriarch, the complex emotions in their eyes were completely beyond description. Had they known earlier that Nightcrypt was the Blood Lord, then the war definitely wouldn’t have ended up like this.</p><br/><p>There were mixed attitudes in the Blood Stream Sect regarding the legendary Blood Devil. Some people longed for him to appear, others did not. If the Blood Lord turned out to be an ordinary disciple, then he could be easily controlled and restricted, and could be forced to only do things that would benefit the Blood Stream Sect.... But now, contrary to all expectations, Bai Xiaochun turned out to be the Blood Lord.</p><br/><p>The Song Clan patriarch maintained bitter silence. The arch-patriarch seemed to be in a daze. Nobody knew what to think. As for Patriarch Limitless, he said nothing, and yet a bizarre light flickered in his eyes. Off to the side, Patriarch Droughtflame had his head bowed low, making it impossible for anyone to read his expression.</p><br/><p>Song Junwan was in the crowd, looking at Bai Xiaochun with a smile that was vastly more bitter than the bitterness in the hearts of anyone around her. As she looked up at Bai Xiaochun, she was struck with the sensation that the gap between them was only continuing to grow wider.</p><br/><p>She slowly bowed her head. She wanted to be able to hide, to be able to flee; as of this moment, she had no desire whatsoever to even see Bai Xiaochun.</p><br/><p>When Bai Xiaochun saw the silence of the Blood Stream Sect, the mixed expressions on the faces of the patriarchs, and the gloominess of Song Junwan, his heart prickled with pain. However, there was nothing else he could do.</p><br/><p>He had been nervous from the very beginning until now. Finally, from what he could tell, there was no way that the fighting could continue.</p><br/><p>“There isn't any need to fight each other,” he said softly. “I can represent the Spirit Stream Sect on your behalf to--”</p><br/><p>However, before he could finish speaking, a droning sound rose up into the air from the Spirit Stream Sect side of the battlefield as intense fluctuations sprang up from the grand spell formation in the Luochen Mountains!</p><br/><p>Bai Xiaochun’s eyes went wide, and he looked over his shoulder to see that all of the patriarchs had strange expressions on their faces!</p><br/><p>That was especially true of the founding patriarch, whose eyes glittered with brilliant light. He had been shaken by everything which had occurred; never could he possibly have imagined that Bai Xiaochun would not only be a blood master, but would also have become the Blood Stream Sect’s legendary Blood Lord!!</p><br/><p>The importance of someone like that couldn’t be understated. Not only could he suppress the Blood Stream Sect and reverse the tide of battle, he could provide them with an opportunity the likes of which could rarely be come across!!</p><br/><p>To see that opportunity right in front of them caused the five patriarchs of the Spirit Stream Sect to be completely shaken. Of course they cared about Bai Xiaochun, but at the same time, this was a matter that pertained to the survival of their sect. In a moment like this, they were willing to betray their consciences for the benefit of the sect! After exchanging glances with the other patriarchs, the founding patriarch threw his head back and laughed.</p><br/><p>“Excellent! Bai Xiaochun, you have performed a great service for the sect today. Henceforth, you are a member of the legacy echelon, and are also the junior patriarch!</p><br/><p>“Spirit Stream Sect, attack! Exterminate the Blood Stream Sect!!” The founding patriarch immediately waved his hand, and the four other patriarchs shot in the direction of the Blood Stream Sect’s patriarchs. At the same time, the spell formation in the Luochen Mountains began to shine with glittering light, and the giant incarnations, after a brief pause, charged forth, roaring. Countless battle beasts from the north bank howled. That group of battle beasts comprised roughly thirty percent of the prowess of the Spirit Stream Sect, and they were currently pouring out to cover heaven and earth.</p><br/><p>This was an opportunity to mobilize the entire sect to inflict heavy losses on the Blood Stream Sect, and create a foundation for the Spirit Stream Sect that would last for 10,000 years.</p><br/><p>The Blood Stream Sect was completely shaken. Almost simultaneously, all of them let out unyielding roars. However, there was nowhere to retreat to, and their hearts were all filled with grief, as well as profound hatred for Bai Xiaochun.</p><br/><p>“I despise you, Nightcrypt!!”</p><br/><p>“Who cares about blood masters and Blood Lords? You say you represent the Spirit Stream Sect? Hahaha! Nightcrypt... you’re <em>nothing</em>!”</p><br/><p>“Nightcrypt, even if I die in battle today, my ghost will haunt you for generations to come!!”</p><br/><p>As their bitter laughter rang out, the three blood masters, the prime elders, and the blood rippers drew upon all the battle prowess they could muster. As for the patriarchs, they gritted their teeth and let out anguished howls.</p><br/><p>Bai Xiaochun stared in shock at the Spirit Stream Sect patriarchs. Never could he have imagined that the Spirit Stream Sect would choose to attack in this moment. Staggering backward, he suddenly began to laugh, a laughter that almost seemed to be weeping.</p><br/><p>“How naïve of me. I thought that suppressing one side would end the war. How wrong I was....</p><br/><p>“I get it now... I really, truly get it.... I overestimated my position. I misjudged my own status. Well then, Spirit Stream Sect, you’re my family, but as of this moment, I need to show you the true limits of my power!”</p><br/><p>Looking up, his hair whipping about him, he waved his right hand in the direction of the Spirit Stream Sect....</p><br/><p>He was calling someone!</p><br/><p>“Bruiser!!”</p><br/>\n</div>"}