{"title": "Chapter 308: Yin-Yang Ravens", "id": 308, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-308-yin-yang-ravens", "volume_title": "Volume 4", "body": "<h1>Chapter 308: Yin-Yang Ravens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Powerful tremors ran across the surface of the spell formation shield. When the Heavenhorn Sword struck it, dazzling silver light shot out, and the shield distorted visibly. The entire spell formation teetered, and although it didn’t collapse, it clearly experienced a significant drainage of spiritual power.</p><br/><p>At the same time, the patriarchs of the Spirit and Blood Stream Sects, as well as the Gold Core cultivators, were joined by large numbers of Foundation Establishment experts to unleash powerful attacks.</p><br/><p>The enraged Bai Xiaochun also charged forth, continuously unleashing his blood qi to keep the Blood Stream Sect cultivators at their peak. Bruiser was at his side, equally furious. Howling, he released his beast king aura, causing countless battle beasts to go mad as they attacked the spell formation.</p><br/><p>Gargoyles, refined corpses, blood swords and violet cauldrons could be seen everywhere. Then the Spirit Stream Sect’s ninth mountain peak appeared, causing everything to shake violently.... The mountains themselves began to crack and crumble!</p><br/><p>Blood clouds spread out, instantly staining the mountains and the city red. On the other side of the mountain range, the remnants of the Pill Stream Sect were attacking with full force, battering the rear portion of the spell formation to the point of destruction!</p><br/><p>From the look of it, the spell formation couldn’t hold on for much longer, and in fact, the only way to prevent it from collapsing was to reduce its range.</p><br/><p>The Blood Stream Sect’s arch-patriarch had a very grim look on his face. The deadly crisis that had just befallen Bai Xiaochun left him feeling both anxious and furious. “Profound Stream Sect.... I'm not interested in waiting around for you to unleash your true reserve powers. Let’s see if you still dare to hold back under the force of the Blood Stream Sect’s reserve powers!”</p><br/><p>The arch-patriarch was the Blood Stream Sect’s only cultivator in the great circle of the Nascent Soul. His fury was something that could only be stood up to by the Spirit Stream Sect’s founding patriarch and patriarch Crimsonsoul of the Profound Stream Sect.</p><br/><p>Those three were all in the great circle, and thus, vastly more powerful than any of the other Nascent Soul cultivators.</p><br/><p>The arch-patriarch performed an incantation gesture with his right hand and then pointed his finger up into the sky. Voice resounding like heavenly thunder, he shouted, “Blood Stream Night Effigy!”</p><br/><p>As the words left his mouth, the sky began to vibrate, and a red bolt of lightning suddenly appeared. As it streaked through the sky, it slashed open a huge rift, within which appeared a bizarre scarecrow with glowing red eyes!</p><br/><p>Cruel cackling echoed out from the mouth of the wicked-looking scarecrow. In one hand it held a patch of human skin, and in the other, a steelyard balance. As soon as it appeared, intense and shocking pressure roiled out to fill heaven and earth.</p><br/><p>That pressure alone caused the spell formation to begin to tremble on the verge of collapse.</p><br/><p>The Blood Stream Sect cultivators gasped, and then their eyes shone with strange light. This was none other than the true reserve power of the Blood Stream Sect.</p><br/><p>The reserve powers were the foundation of any sect!</p><br/><p>Countless red lightning bolts crashed in the sky above as the scarecrow suddenly vanished. When it reappeared, it was right outside of the spell formation shield, where it lifted its right hand up. As it did, the steelyard balance grew immeasurably large, and then, within the weighing tray, an image appeared.</p><br/><p>Upon closer examination, that image proved to be the entire mountain range that the Profound Stream Sect’s city was built into!</p><br/><p>Then, the steelyard balance began to move, as though it were weighing the importance of the mountain range and the city!</p><br/><p>The ground quaked and the mountains trembled. The city began to sway back and forth. Cracks appeared in the spell formation shield, almost as though heaven and earth were weighing the city!</p><br/><p>Once the weighing process was over, the mountain range and the city would be reduced to ashes!</p><br/><p>Bai Xiaochun took a deep breath. To see the bizarre image of the scarecrow, and the quaking mountains and city, made him realize that reserve powers of this level were something that not even patriarchs could deal with.</p><br/><p>“I wonder what the true reserve power of the Spirit Stream Sect is like?” he thought, his mind reeling. The patriarchs of the Profound Stream Sect had very serious expressions on their faces. Patriarch Crimsonsoul’s eyes flickered, and then he suddenly extended his right hand and slammed it down onto the ground.</p><br/><p>The resulting boom caused everything to tremble. Countless rocks and rubble suddenly leapt up into the air as an altar rose up from a square in the middle of the city.</p><br/><p>“Exalted Celestial Incense!” Patriarch Crimsonsoul roared. At the same time, a thumb-sized chunk of black incense appeared on the surface of the altar!</p><br/><p>It radiated an incredibly ancient air, as though it had existed for countless years. Furthermore, it had obviously been lit on many occasions in the past; now, only a small bit remained....</p><br/><p>As soon as it appeared, it began to burn, sending delicate streams of green smoke out through the spell formation, where they began to form into an image!</p><br/><p>Instantly, the scarecrow’s red eyes began to glow even more brightly than before. It only took a brief moment for the image of green smoke to coalesce into the form of a cultivator!</p><br/><p>He appeared to be a middle-aged man wearing a Daoist robe and Daoist headgear. He bore the demeanor of a transcendent being, and seemed graceful in a way that surpassed the mortal world. From the aura and energy that exploded out from him, he almost seemed to be fused with heaven and earth. Instantly, the blood clouds in the sky began to churn, and the ninth mountain peak began to tremble.</p><br/><p>Then the middle-aged cultivator waved his finger, and everything began to distort. The steelyard balance in the hand of the scarecrow exploded violently, making it impossible to continue the weighing process. Everyone was completely and utterly astounded.</p><br/><p>The eyes of the Spirit Stream Sect’s founding patriarch gleamed with bright light. He knew that the Profound Stream Sect’s reserve power was extraordinary, and now that he was able to witness it with his own eyes, he thought back to some of the stories he'd heard, and instantly realized the truth. “The power of the Deva Realm!!”</p><br/><p>Bai Xiaochun’s heart was shaken. He looked at the man made from smoke, and could feel the terrifying pressure radiating off of him. A moment later, he realized that just looking at him filled his eyes with pain, and caused his mind to reel.</p><br/><p>To him, it seemed as this man had replaced the heavens, and was he himself heavenly might!</p><br/><p>The scarecrow’s eyes began to glow with increasingly intense redness. Letting loose a powerful shriek, it took the patch of human skin it held in its left hand and then swung it around to cover its own body! In the blink of an eye, the scarecrow transformed into a child, which opened its mouth in terrifying fashion as it lunged at the middle-aged man. The conflict between these two ultimate reserve powers was causing everything under the sky to shake violently!</p><br/><p>Lights flashed in the sky, and a huge wind kicked up, accompanied by thunderous booms. The founding patriarch of the Spirit Stream Sect didn't hesitate at all to also perform an incantation gesture, then wave his hand upward!</p><br/><p>“Spirit Stream Yang Raven!”</p><br/><p>The founding patriarch’s words were accompanied by cacophonous rumbling sounds. It was as if two hands were ripping open the heavens to reveal a bright, clear sky beyond. There, the shocking image of a white sun could be seen!</p><br/><p>Within the white sun was a black raven. The raven’s eyes opened, and they emitted blinding light. Then it cawed in deafening fashion!</p><br/><p>Even as ripples flowed out from the raven, it took a deep breath, completely absorbing the white sun. Then it became a streak of light like a shooting star that headed in the direction of the spell formation shield.</p><br/><p>“Pill Stream Sect, produce your reserve power!!” shouted Patriarch Crimsonsoul, his expression vicious. Instantly, one of the sealed Pill Stream Sect cultivators in the city, a former patriarch of the Pill Stream Sect, gritted his teeth and then waved his hand.</p><br/><p>Rumbling filled all creation as the sky once again opened up in the exact same position where the white sun had appeared. However, this time, what appeared was something completely different: a black sun!</p><br/><p>The instant the black sun appeared, it cast darkness everywhere below. Most strangely of all, within the black sun was a bird that looked almost exactly the same as the Spirit Stream Sect’s raven!</p><br/><p>However, this raven was actually white!</p><br/><p>All cultivators who could see what was happening were gasping in shock. Many of them had eyes as wide as saucers. The fact that the reserve powers of the Spirit Stream Sect and the Pill Stream Sect were so similar made it obvious that the two sects were connected somehow!</p><br/><p>Bai Xiaochun’s eyes went wide as he watched the white raven open its mouth and suck in the black sun. Then, eyes gleaming as if with hatred for an archenemy, it shot toward the Spirit Stream Sect’s black raven. When the two collided, a massive boom shook everything in the area.</p><br/><p>The Blood Stream Sect’s arch-patriarch suddenly thought back to a rumor he’d heard. “Yin-Yang Ravens!”</p><br/><p>Supposedly, when the Spirit Stream Sect made its foray into the Lower Reaches 10,000 years ago, they had possessed no reserve power. Later, they had joined forces with the Pill Stream Sect, which was when they suddenly came to have a spirit treasure!</p><br/><p>“Either way, this battle is almost over,” thought the arch-patriarch. “There’s no way the Profound Stream Sect has a third reserve treasure.” The Blood Stream Sect’s arch-patriarch exchanged a glance with the Spirit Stream Sect’s founding patriarch, and they nodded to each other. The truth was that they could have made a massive attack like this earlier on. However, they had drawn things out to give the Spirit and Blood Stream Sects a chance to fight together. At the same time, they were able to chip away at the morale of the Profound Stream Sect. After all, their goal was not to wipe out the Profound Stream Sect, but rather, to absorb it!</p><br/><p>Now that the Profound Stream Sect had revealed their reserve power, there was no suspense at all left in the war.</p><br/><p>The Spirit Stream Sect’s founding patriarch waved his sleeve, and then spoke in a voice as cold as ice: “Profound Stream Sect, do you surrender?!”</p><br/>\n</div>"}