{"title": "Chapter 311: That... Scar!!", "id": 311, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-311-that-scar", "volume_title": "Volume 4", "body": "<h1>Chapter 311: That... Scar!!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The moon cast shafts of white light down onto the earth below, creating a scene of both biting coldness and gentle softness. Overall, it was breathtakingly beautiful.</p><br/><p>Xuemei looked very striking as she stood there in front of the door to the spirit abode. She wore a voluminous robe, but the curves of her body were still visible beneath the fabric. She looked very beautiful.</p><br/><p>Her voice was soft, but at the same time, slightly raspy in a way that almost made Bai Xiaochun’s ears itch....</p><br/><p>Last time, it didn’t matter what Bai Xiaochun said when he tried to get her to come out of her immortal's cave, she had remained inside. To see her suddenly appear right out in the open caused him to smile.</p><br/><p>“Last time you refused to see me. This time, there’s nowhere for you to escape to.”</p><br/><p>The familiar way in which he spoke to her, not even bothering to address her, caused her to look deeply at him, a strange light gleaming in her eyes. Although she wore a mask, making it impossible to see her facial features, there was something about her that seemed very weak.</p><br/><p>“Many thanks for your kindness in saving my life, Blood Master. When you came to my immortal's cave last time, I was injured, and had just lost the struggle to become blood master. I felt blank inside, and didn’t feel up to facing you. Please forgive me.” With that, she clasped hands and bowed deeply. As she did, her sleeve slipped down, revealing a scar on her hand that had clearly been there for some time. As she bent over, some of her curves became even more prominent than before, and Bai Xiaochun couldn’t help but take a look.</p><br/><p>Bai Xiaochun cleared his throat and said, “Why are you being so polite, boo? Take off that mask so I can see you.”</p><br/><p>Excitement building in his heart, he took a step toward the door.</p><br/><p>Xuemei’s eyes widened. Never could she have imagined that Bai Xiaochun would say something like that, nor that he would start walking toward her. Without even thinking about it, she stepped backward.</p><br/><p>Suddenly, her knees went weak, and she staggered a bit. Eyes flashing with anger, she said, “Blood Master, please behave yourself. You showed great kindness by saving me, but that doesn’t give you the right to dishonor me! I'm Xuemei, not some ‘boo’.”</p><br/><p>“Cut the crap!” Bai Xiaochun said, feeling less than pleased. He took another step forward, unleashing the power of his cultivation base to flash forward with incredible speed. In the briefest of instants, he was right in front of Xuemei.</p><br/><p>At any other time, Xuemei’s cultivation base would have been strong enough to resist him. But she was still recovering from a grievous injury, and wasn’t a match for him in any way. In the blink of an eye, he reached out, grabbed her mask, and pulled it off!</p><br/><p>As her mask was plucked off of her face, black hair spilled down her shoulders like a waterfall. Bai Xiaochun threw the mask off to the side, and her face was revealed, ashen, with starkly cold beauty. She was clearly angry, but was so weak that her anger didn't burn as hot as it might have.</p><br/><p>Although she wasn’t soul-shakingly beautiful, her classic good looks were enough to put her on the same level as Song Junwan!</p><br/><p>However, this person was not Du Lingfei!</p><br/><p>Xuemei backed away further. Her face was pale, and her hair was disheveled. She was even trembling. Eyes flaring with coldness, she pointed at Bai Xiaochun and said, “What do you think you’re doing, Nightcrypt!?!?”</p><br/><p>Because of her overall weakness, the coldness in her eyes seemed more like humiliation.</p><br/><p>When Bai Xiaochun saw her face, his expression flickered wildly, and a murderous aura sprang up around him. His eyes were instantly shot with blood.</p><br/><p>“If you’re not my boo,” he said, “then who are you?!?!” His mind was spinning with shock and anxiety.</p><br/><p>Xuemei’s expression became even more icily angry than before. She almost couldn’t believe the way Bai Xiaochun was acting. She had emerged to thank him for saving her life. But unexpectedly, he had ripped off her mask, and then started talking like a madman. Backing up again, a fierce look appeared in her eyes.</p><br/><p>“Have you gone crazy, Nightcrypt? I'll say it again. I’m not your boo! I'm Xuemei!”</p><br/><p>“You’re not Xuemei!!” Bai Xiaochun’s heart and mind were in chaos, and he felt like he was going insane. As he stared at Xuemei’s face, he thought back to what he had occurred inside the Blood Ancestor. The last time that mask had fallen off her face, a very different face had been revealed!</p><br/><p>“What do you mean I'm not Xuemei? What are you talking about?!” Xuemei continued to edge away nervously. She suddenly got the feeling that this version of Bai Xiaochun was very, very dangerous, like a bolt of lightning just waiting to strike.</p><br/><p>“Who are you?” Bai Xiaochun shouted at the retreating Xuemei. “Why are you pretending to be Xuemei? Where’s the real Xuemei!?!?” He needed answers. He couldn't accept a situation in which he walked away without an explanation. Flying forward, he reached out and, to Xuemei’s horror, attempted to grab her arm.</p><br/><p>However, it was in that moment that a light cough suddenly filled the spirit abode. To Bai Xiaochun, that light cough felt like thunder rumbling in his ears.</p><br/><p>He staggered in place, and Xuemei managed to duck out of reach of the hand he had been reaching out toward her. She quickly performed a double-handed incantation gesture, causing the flickering image of a plum blossom to appear in front of her. She was now radiating a prickly killing intent, her mind seething with rage toward Bai Xiaochun.</p><br/><p>Bai Xiaochun shook his head violently, but the rumbling sound inside of him didn't stop. Face pale, he stopped in place and looked at the middle-aged man who was walking out of the room behind Xuemei.</p><br/><p>He had stern features, and looked as dangerous as an unsheathed sword. Shocking pressure rolled into the room with him, making it impossible for Bai Xiaochun to even take a step.</p><br/><p>“Patriarch Limitless!” Bai Xiaochun said, his pupils constricting. At any other moment, he would have been trembling in fear to face the pressure of a Nascent Soul patriarch, but at the moment he didn’t care.</p><br/><p>Patriarch Limitless had a very serious look on his face as he walked forward and patted Xuemei on the shoulder. Xuemei didn't seem pleased, but didn’t dare to defy her father, and reigned in her killing aura.</p><br/><p>“Father,” she said by way of greeting. Settling her qi and blood, she dissipated the blood-colored plum blossom.</p><br/><p>“Patriarch Limitless, look at your daughter!” Bai Xiaochun said, glaring at him. “She's not Xuemei!”</p><br/><p>Clearly, he was so enraged that, despite the pressure weighing down on him, he wasn't willing to back down.</p><br/><p>Patriarch Limitless looked coldly at Bai Xiaochun and said nothing. However, the longer he went without talking, the more pressure roiled out. Bai Xiaochun began to tremble, until finally, he let out a roar, causing streams of blood qi to erupt out. That was blood qi from the Blood Ancestor, and when it fused with Bai Xiaochun, his energy grew even more powerful. It rose up higher and higher, until he was on a similar level as Patriarch Limitless!</p><br/><p>Xuemei’s heart trembled as she looked at Bai Xiaochun, and then her father. There was a strange light in her father’s eyes that she recognized. When that light appeared, it meant that the person he was looking at was very important.</p><br/><p>“I only have one daughter, and this is her!” Patriarch Limitless swished his sleeve, causing his own energy to dissipate.</p><br/><p>In response to Patriarch Limitless’s words, Bai Xiaochun’s face drained of blood. However, he still wasn't willing to give in, and said, “I saw Xuemei's face in the heart cavity, and she didn’t look like that!”</p><br/><p>“Take a close look at my daughter’s face,” Patriarch Limitless said. Although he spoke calmly, it was in a voice that could clearly tolerate no arguments. It was like heavenly thunder pounding in Bai Xiaochun’s mind.</p><br/><p>Heart quivering, Bai Xiaochun took a deep breath and looked closely at Xuemei. Then he looked back at Patriarch Limitless. Finally, he took a few steps back, a look of confusion building up on his face.</p><br/><p>The facial features of Patriarch Limitless and Xuemei were very similar. Most likely, even mortals would be able to notice the similarities, much less cultivators, who had much keener senses. Obviously, this was a father and a daughter!</p><br/><p>The look on Bai Xiaochun’s face grew even more blank. He thought back to what Du Lingfei looked like, and then compared it to Patriarch Limitless, and realized that the two of them didn’t look anything alike.</p><br/><p>“Then who did I see back in the heart cavity?” He staggered backward again, almost as if he had been struck physically. The confusion in his eyes grew more intense. He simply couldn’t believe how everything was playing out. He suddenly started wondering if he was remembering things wrong....</p><br/><p>If the woman in front of him really was Xuemei, then how could he have seen Du Lingfei in the heart cavity? Who exactly was Du Lingfei?!</p><br/><p>Bai Xiaochun bitterly recalled everything which had occurred in the trial by fire for blood master. Gradually, he began to tremble as he thought back to the events which had played out in the Blood Wasteland. In the moment before the teleportation, he remembered seeing a wound on Xuemei’s hand, and also remembered that blood had been dripping down from behind her mask. Clearly, she had been wounded!</p><br/><p>However, once they reached the tunnel beyond, Xuemei’s wound had disappeared, and there was no blood on her face. In fact, all of her injuries had been healed!</p><br/><p>Back then, he had assumed that she had used some special technique to heal herself, and hadn't paid much attention to the situation. But now, he realized that there was something very strange about the whole thing!!</p><br/><p>Heart pounding, he looked up at Xuemei’s hand, and then, began to shake. Right there on her hand was a scar, plainly visible for anyone to see!!</p><br/><p>The sight of that scar caused incredible waves of shock to batter Bai Xiaochun’s heart!</p><br/><p>At that point, Patriarch Limitless’s face turned somber, and he slowly said, “So, it seems you saw the mysterious person in question....”</p><br/>\n</div>"}