{"title": "Chapter 319: Swallowed Up", "id": 319, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-319-swallowed-up", "volume_title": "Volume 4", "body": "<h1>Chapter 319: Swallowed Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The figure flying toward him looked very familiar. The beam of light it created as it shot through the air was dazzling, and its voice echoed about in grand fashion.</p><br/><p>It was none other than the little turtle.</p><br/><p>Bai Xiaochun’s jaw dropped, and his hair began to stand on end. He felt like his mind was being struck by 100,000 bolts of lightning, with accompanying thunder pounding into his ears. He immediately let out a shout of alarm.</p><br/><p>“When did you get out of my bag of hold--”</p><br/><p>Before he could finish speaking, he saw what was happening behind the little turtle. The mountain peak was exploding into a cascade of rocks and rubble. The ground trembled, and numerous birds and beasts fled in terror as a gargantuan toad emerged from under the surface of the earth.</p><br/><p>The toad was huge, more than 30,000-meters long.... As it flew up into the air, it blotted out the sun, and cast an enormous shadow down onto the ground. At the same time, an aura of indescribable madness and brutality echoed out!</p><br/><p>The toad’s eyes were crimson with fury as it glared down at the flea-sized little turtle. Then it let out a howl that caused the grounds to shake violently and the sky to distort!</p><br/><p>AAOOOWWW!</p><br/><p>The air was torn to shreds as a sonic boom rolled out in all directions.</p><br/><p>As the little turtle barreled along, it also seemed enraged, and let loose a torrent of abuse.</p><br/><p>“What are you screaming for? I know you’re male! You’re not even worthy of your own parents, you degenerate! Last time Lord Turtle was around, you were just a tadpole, and I could have crushed you to death in a second! No wait. I could have crushed your dad to death! No wait. Crushed your grandpa!!”</p><br/><p>The toad’s eyes burned with bright red light as it slammed down onto the ground, causing everything within 3,000 meters of it to collapse. Crevices snaked out like spiderwebs as the toad then launched itself back up into the air, flying madly toward the little turtle.</p><br/><p>Bai Xiaochun’s hair whipped around him madly, and he was sent staggering backward, screaming the entire time.</p><br/><p>“Damn you, you bastard turtle! I hate you!!” Bai Xiaochun appeared to be on the verge of tears. The toad seemed ferocious and brutal to the extreme. Although it wasn’t as terrifying as the golden crocodile, it definitely was the type of creature to avoid provoking. And yet, the little turtle had managed to completely enrage it. Bai Xiaochun wanted to kill the little turtle, especially for the fact that he was flying straight toward him. Feeling very much like he was going crazy, he unleashed all the speed he could muster to flee in the opposite direction.</p><br/><p>He used his Heavenly Demon Body, his wings, and what little of the powers of gravity and repulsion he could control. Then he added the Mountain Shaking Bash, going all out to become nothing more than a blur of afterimages.</p><br/><p>Although the speed he was capable of couldn’t be described as slow, the little turtle was faster. In the blink of an eye, he was right next to Bai Xiaochun.</p><br/><p>Looking over at him, he stuck his bottom lip out mockingly and said, “What are you scared of? Lord Turtle’s here! Years ago, I crushed tons of those tadpoles. Aiya. Lord Turtle is tired now. I need to rest for a bit. Don’t disturb me, or else I’ll insult you to death!” The little turtle yawned, then became a blur of light that vanished into Bai Xiaochun’s bag of holding.</p><br/><p>In the moment before disappearing, he hollered, “Hey little tadpole! If you think you’ve got what it takes, go ahead and fight with my master! Don’t come looking for me until you can beat him!”</p><br/><p>Bai Xiaochun howled in rage, and was just going to start cursing the little turtle when an even more intense roar echoed out behind him, and he looked back to see the huge toad glaring at him with utter madness!</p><br/><p>Looking back down at his bag of holding, tears welled up in his eyes. “I'm sorry!” he said. “Lord Turtle, please, let me off the hook! I actually really like turtles....” However, the little turtle didn’t respond at all.</p><br/><p>Bai Xiaochun was wracked with grief. He thought back to the golden crocodile, and realized that if things kept going on like they were, the little turtle might cost him his poor little life....</p><br/><p>“You’ll get what you deserve one of these days!!” he howled as he sped into motion again. “Senior Heavenhorn, save me!!”</p><br/><p>Off in the distance, the Heavenhorn ink dragon was still soaring about in the air. As soon as it heard the cry of the toad, it looked over in surprise, and its eyes widened.</p><br/><p>Then it heard Bai Xiaochun, and saw him fleeing at top speed, and all of the scales on its body stood on end.</p><br/><p>“Dammit!” it roared. “How did you manage to get the old toad so pissed off!?!?” The Heavenhorn ink dragon was actually trembling inwardly. Although it seemed like a powerful creature, there were some older beasts within this world that even it didn’t dare to provoke. As it turned out, this toad was one of them.</p><br/><p>“Stay away!” the dragon cried. “Don’t come over here!” Of course, Bai Xiaochun wasn't listening, and sped in the direction of the dragon as quickly as he could.</p><br/><p>Even as the Heavenhorn ink dragon trembled, the toad let out another roar. Then, the terrified dragon’s eyes turned bright red, almost as if it were on the verge of unleashing its fury.</p><br/><p>Bai Xiaochun was instantly moved at how well the old dragon was treating him, and pushed forward with greater speed.</p><br/><p>“Senior Heavenhorn, how kind and virtuous of you! I, Bai Xiaochun, will always remember this, and I’ll definitely pay you back once I get to the sect....”</p><br/><p>Bai Xiaochun’s gratitude seemingly knew no ends. From what he could tell, the dragon still must be grateful for how much he’d helped it all those years back. Suddenly, the toad roared again, but this time, it also shot out its tongue, which was indescribably long, and moved with a speed that was difficult to put into words.</p><br/><p>In the blink of an eye, the Heavenhorn ink dragon had become the target. Clearly, the toad wanted to wipe out the dragon first, and then take care of Bai Xiaochun afterward.</p><br/><p>The dragon’s eyes went wide as an intense sensation of deadly crisis surged through it.</p><br/><p>“Fellow Daoist Toad, did this punk provoke you? I’ll take care of him for you! Kiddo, how dare you provoke my big bro. Do you have a death wish!?” Although the Heavenhorn ink dragon’s words echoed out in dramatic fashion, inwardly, it was trembling. As for the old toad, it seemed taken aback. Its tongue stopped moving, and instead of continuing to attack the Heavenhorn ink dragon, it suddenly shot toward Bai Xiaochun. Before he could react, it wrapped around him and hauled him off of his feet.</p><br/><p>Bai Xiaochun screamed. Although he wanted to weep, the tears wouldn’t come. Before he could do anything else, the sound of rushing wind blasted past his ears, and everything turned dark.</p><br/><p>All the Heavenhorn ink dragon could see was the huge tongue wrap around Bai Xiaochun and then, in the blink of an eye, roll back up into the toad’s mouth.</p><br/><p>The Heavenhorn ink dragon was trembling, but it put an ingratiating smile on its face as the toad glared at it, then turned and hopped off into the distance.</p><br/><p>After confirming that the toad was gone, the Heavenhorn ink dragon took a deep breath.</p><br/><p>“That's it. Game over. Young Bai Xiaochun was eaten by the old toad. Although, now that I think about it, the toad takes a long time digesting things. Bai Xiaochun’s fleshly body is pretty tough. He should be safe for a while.” The dragon quickly reached out to make contact with the patriarchs in the hopes of rescuing Bai Xiaochun as quickly as possible.</p><br/><p>**</p><br/><p>Bai Xiaochun was now inside the toad. Everything around him was black at first, but slowly his vision adjusted, whereupon his face drained of blood. He was surrounded by mucus and other fluids. Everything was wriggling. It was too terrifying to even describe with words, and furthermore, a horrifically acidic odor filled the air that caused Bai Xiaochun to nearly throw up.</p><br/><p>He was currently plastered down against a swath of flesh, and when he tried to lift his arm, numerous strings of mucus spread out and drooped down.</p><br/><p>“Heaven-damned little turtle, I hate you!!” To his horror, he realized that his clothing was slowly dissolving. Thankfully, his Undying Live Forever Technique and powerful fleshy body ensured that he was not harmed.</p><br/><p>It took a lot of effort, but he managed to struggle into a sitting position. Then he rose to his feet and looked around, frowning.</p><br/><p>“That toad definitely swallowed me up. I must be inside of it now....” Sighing in despair, he was just about to try to walk out, when he realized that the way ahead was completely sealed shut. Anger surging, he performed an incantation gesture with his right hand and summoned a blood qi sword. Without any hesitation he slashed it down in front of him.</p><br/><p>“Open up!”</p><br/><p>A sound rang out like metal scraping on metal, and not a single scratch was visible.</p><br/><p>“This won’t work. I need to figure out some other way to open the toad's mouth. I guess I should go further in. Maybe... dammit! Could it be that the world-famous cultivator Bai Xiaochun... will have to use the back door?!” Scowling on the verge of tears, he kept struggling to make a decision. He tried using the teleportation jade slip, but found that it didn't work in this location. Sighing piteously, he began to make his way further into the depths.</p><br/><p>His clothing continued to melt. Thankfully, his fleshly body was strong enough that he could hold on for the moment. As he walked along, his feet stuck to the sticky ground, causing him to almost throw up on multiple occasions.</p><br/><p>“I'm gonna kill you, little turtle!!” Enraged, he rifled through his bag of holding several times, but wasn’t able to find even a trace of the little turtle.</p><br/>\n</div>"}