{"title": "Chapter 314: I Live For The Sect", "id": 314, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-314-i-live-for-the-sect", "volume_title": "Volume 4", "body": "<h1>Chapter 314: I Live For The Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The patriarchs of the River-Defying Sect exchanged enthusiastic glances. Then the arch-patriarch of the Blood Stream Division clasped hands and bowed deeply.</p><br/><p>“We will comply with any decree!”</p><br/><p>The ancient voice then continued: “The Starry Sky Dao Polarity Sect approves your petition to go to war, and permits you to destroy the Sky River Court and take over its position.”</p><br/><p>Each word spoken by the voice boomed like thunder, echoing out in all directions. When the last words were spoken, a golden beam of light shot toward the arch-patriarch, coming to a stop in front of him in the form of a jade slip!</p><br/><p>Simultaneously, the vortex vanished. It was as if the giant figure from before had never been there. After a brief moment of silence, the arch-patriarch lifted the golden jade slip high above his head!</p><br/><p>As he did, all of the cultivators of the River-Defying Sect, as well as all of the other cultivators who had come to observe the ceremony, broke out into uproarious cheering!</p><br/><p>“Victory belongs to the River-Defying Sect!”</p><br/><p>“Victory belongs to the River-Defying Sect!!”</p><br/><p>“Victory belongs to the River-Defying Sect!!!”</p><br/><p>The cacophony of their cheers echoed out to fill the entire world around them. The cultivators of the River-Defying Sect were extremely excited, especially those from the Spirit Stream Division and the Blood Stream Division. Of course, their enthusiasm quickly rubbed off on the disciples of the Profound and Pill Stream Divisions. Soon, all eyes were filled with confidence and anticipation.</p><br/><p>After all, the best way for new allies to get used to each other was to fight side by side in war!</p><br/><p>Under the bloody grindstone that was war, the four sects would truly become one, would truly transform, and would truly achieve glory!</p><br/><p>Even as everyone was cheering at the tops of their lungs, the arch-patriarch’s gaze swept across the crowd and came to rest on Bai Xiaochun. Then he spoke out in a voice that instantly suppressed all other noise, becoming the only thing people heard! “Bai Xiaochun, step forward for the official conferring ceremony!”</p><br/><p>Bai Xiaochun shivered. The atmosphere already had his blood boiling, so he took a deep breath to calm himself, then strode out in front of the seventeen Nascent Soul patriarchs.</p><br/><p>“Disciple Bai Xiaochun offers greetings, Patriarchs!” As he clasped hands and bowed, his expression was somber, and a murderous aura slowly began to build up around him. He seemed as firm and unyielding as iron, like a celestial warrior who had seen hundreds of battles, a person possessing unmatchable energy.</p><br/><p>His features were somehow chiseled and grim, and deep in his eyes, stars, moons, and other heavenly bodies swirled about. The power of his blood qi flowed out, creating a blood-colored suit of armor around him, complete with a blood-colored cape!</p><br/><p>As of this moment, Bai Xiaochun did not seem timid or cowardly, nor even the least bit naughty or mischievous. He stood as straight and tall as a mountain peak, and seemed as profound and deep as the ocean!</p><br/><p>Everyone watching the scene was shaken, especially the cultivators who were just seeing him for the first time. They gasped, and looks of profound respect appeared in their eyes. They had all heard of Bai Xiaochun, and knew that he was the person responsible for all the momentous changes in the eastern Lower Reaches of the cultivation world!</p><br/><p>Now that they could see him for the first time in person, he looked exactly like the cool, collected Chosen that they had imagined. The same thing was going through all of their minds: he was obviously a person who lived up to his reputation!</p><br/><p>“So that’s Bai Xiaochun?! He’s the ultimate Chosen!”</p><br/><p>“I’ve only heard some stories about this Bai Xiaochun. Some people say that he’s wise, intelligent, and courageous, a natural-born prodigy, a star who shines with boundless light! However, I've also heard more than a few people say that he’s a greedy coward, completely despicable and shameless....”</p><br/><p>“People like him are bound to be the subject of plenty of jealousy. Now that I think about it, I also heard some bad stories about him. But those stories are probably just made-up.”</p><br/><p>The people who knew him best were the cultivators from the Blood Stream Sect and the Spirit Stream Sect. Many of those cultivators were looking at him with wide eyes, almost as if they didn’t even recognize him. Big Fatty Zhang gasped, and Hou Yunfei shook his head with a smile. Xu Baocai and many of Bai Xiaochun’s other friends were all simply sighing at how skilled he had become at striking the right pose at the right time.</p><br/><p>Bai Xiaochun felt very proud of himself, and was completely filled with anticipation at the glorious scene which would play out when he officially became the junior patriarch. However, none of those emotions showed on his face. His expression was somber, and his veins of steel were pulsing. He stood there coolly, looking just like he had when he was Nightcrypt. People immediately began to cheer. All the while, strange expressions could be seen on the faces of the seventeen patriarchs. However, inwardly, they were relieved. Many of them had been worried that Bai Xiaochun might act the way he had when he’d met with them earlier, and ruin the ceremony.</p><br/><p>“Bai Xiaochun, as the junior patriarch of the River-Defying Sect, you must shoulder a weighty responsibility. Henceforth, you are a core element of our sect. Your life, your honor, and everything else about you are all inextricably linked with the sect.</p><br/><p>“The glory of the sect is also your glory! The shame of the sect is also your shame! Likewise, your glory and shame will belong to the sect!</p><br/><p>“No matter where you go, no matter how much time passes, your home, your roots, and your everything… are the sect!</p><br/><p>“If the day ever comes that the sect falls, it will be your responsibility to restore it! If the day ever comes that the sect basks in unheard-of glory, it will be your responsibility to defend it! You must ensure that the River-Defying Sect never becomes divided, and never loses its heart and soul!</p><br/><p>“Bai Xiaochun, are you prepared to shoulder such responsibility? Your answer please!” The arch-patriarch’s expression was unprecedentedly calm as he spoke in a voice as explosive as thunder, a voice which caused all hearts to tremble.</p><br/><p>Bai Xiaochun shivered, and suddenly, all of his pride and complacency vanished. His desire to bask in glory faded away, and he stood there quietly, looking, in rare fashion, truly solemn and respectful.</p><br/><p>He suddenly realized that the position of junior patriarch wasn’t just about glory and fame. It was a serious responsibility. For the rest of his life, he would never able to separate himself from or part ways with the River-Defying Sect.</p><br/><p>It would be his home, and also, the most precious thing in his life. Bai Xiaochun suddenly found himself in a bit of a reverie. He thought back to Mount Hood in the Eastwood Mountains. He thought about his relatives in the village he had grown up in. He thought about how he had held his parents’ hands as they passed away. He thought about all the times he’d lit that stick of incense. He thought about everything he'd done in the Spirit Stream Sect and the Blood Stream Sect.</p><br/><p>Without even thinking about it, he looked over at Li Qinghou among the legacy echelon cultivators. Li Qinghou’s heart was filled with pride, pride that the same Bai Xiaochun he had brought to the sect was now grown up. To see Bai Xiaochun where he was now, and to see him looking over at him, caused Li Qinghou’s face to fill with a smile of deep gratification.</p><br/><p>When Bai Xiaochun saw Li Qinghou smile, he took a deep breath, and an expression of determination filled his face. Looking back at the Blood Stream Division’s arch-patriarch, he clasped hands formally.</p><br/><p>“Yes. I'm prepared.” He spoke the words slowly, because they were words of utmost importance. After speaking them, the gazes fixed upon him didn't make him feel grand and impressive. Instead, he felt as if a very heavy responsibility had just come to rest on his shoulders!</p><br/><p>The arch-patriarch gave Bai Xiaochun a profound look. Because of his age and his cultivation base, he could see that Bai Xiaochun had spoken from the bottom of his heart, with complete sincerity. The arch-patriarch nodded, and then looked over at the founding patriarch of the Spirit Stream Division. Both patriarchs could see the looks of determination in each other’s eyes.</p><br/><p>Without any hesitation, the arch-patriarch said, “On this day, Bai Xiaochun is conferred with the title of junior patriarch of the River-Defying Sect!”</p><br/><p>Trembling, the cultivators of the River-Defying Sect clasped hands and bowed to Bai Xiaochun.</p><br/><p>“Greetings, Junior Patriarch!”</p><br/><p>It wasn’t just the Outer and Inner Sect disciples who bowed. The Foundation Establishment cultivators and the Gold Core experts also joined in. The junior patriarch of the sect occupied a position second only to the patriarchs themselves. It was even higher than the legacy echelon!</p><br/><p>Song Que and the other Chosen all had no choice other than to bow their heads. Shangguan Tianyou’s hands were clenched tightly, and bitterness gripped his heart, but he had no other options available.</p><br/><p>Then, a thunderous rumbling filled the air as the countless other cultivators in the audience also offered formal greetings.</p><br/><p>“Greetings, Junior Patriarch of the River-Defying Sect!”</p><br/><p>The deafening sound flowed out to fill heaven and earth, causing everything to tremble. Bai Xiaochun looked around, his heart surging. From the look on his face, he had many things he wished to say, and yet, wasn’t sure how to express them.</p><br/><p>A moment passed, and his thoughts slowly coalesced into a single sentence. Although he didn’t speak it out loud, it settled down onto his heart, like an indelible mark that would be there for the rest of his life.</p><br/><p>“I live for the sect!”</p><br/><p>He only spoke the words in his heart, but from the expression on his face, the River-Defying Sect’s Nascent Soul patriarchs could tell what he was thinking. As they looked back at him, their eyes were filled with reminiscence, encouragement, and deep sighs.</p><br/><p>Meanwhile, on the roof of a certain spirit abode within the city, a monkey could be seen, sitting there, looking up at the goings-on with a faint smile on his face.</p><br/><p>“The sect isn’t going to let you down, kid!” the monkey murmured. Sitting next to the monkey was a rabbit, who was also staring up into the sky.</p><br/>\n</div>"}