{"title": "Chapter 323: Gathering At The Blood Stream Sect!", "id": 323, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-323-gathering-at-the-blood-stream-sect", "volume_title": "Volume 4", "body": "<h1>Chapter 323: Gathering At The Blood Stream Sect!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Now that the patriarchs and the legacy echelon cultivators were back, the final work on the Heavenspan Battleships began. Everyone in the sect helped out as the deva beast spine was used to craft the keels of the ships!</p><br/><p>There were a total of three, each one a different size. The largest was 300,000 meters long, and completely awe-inspiring in appearance. It hadn't started moving yet, but it looked like a gigantic mountain that caused all of the Spirit Stream Sect disciples who saw it to tremble in awe and reverence!</p><br/><p>And that was just based on its appearance! The largest of the Heavenspan Battleships emanated a shocking aura that surpassed that of a Nascent Soul patriarch. It was at a completely different level altogether; the aura of a deva!</p><br/><p>After the Nascent Soul stage was the Deva Realm. This battleship had been made with the spine of a deva beast, and even though it couldn’t necessarily unleash the full might of the Deva Realm, it was still incredibly powerful. It would make their trip up the Heavenspan River much safer. That, coupled with the Dharmic decree from the riversource Starry Sky Dao Polarity Sect, would ensure that they faced almost no hazards along the way.</p><br/><p>Of course, the largest of the battleships was big enough to contain all of the Spirit Stream Sect cultivators who were going to war!</p><br/><p>The second of the battleships was a bit smaller, being only 210,000 meters in length, and had been prepared specifically for the Profound Stream Sect. The last of the battleships was the smallest, being only 90,000 meters long. However, it had been constructed in the same fashion as the largest, and radiated the aura of the Deva Realm.</p><br/><p>Before leaving their temporary headquarters, the patriarchs of the four sects had already agreed that the Blood Stream Division didn’t need a Heavenspan Battleship. Apparently, they had their own way of traveling up the Heavenspan River.</p><br/><p>When the third Battleship was completed, all the disciples in the Spirit Stream Division felt shaken. Everyone knew that the most critical part of the war was coming!</p><br/><p>They would soon travel up the river to destroy the Sky River Court and take its place!</p><br/><p>Bai Xiaochun had no desire to see anyone die. However, he was no saint either, and didn’t allow such feelings to extend to people he didn’t even know. What he cared about were his family and friends!</p><br/><p>Half a month later, the founding patriarch’s voice echoed out through the sect, accompanied by the tolling of bells. “All disciples of the River-Defying Sect’s Spirit Stream Division who have been assigned to fight will now board the battleship! Our next destination is the Blood Stream Division, further up the Heavenspan River!”</p><br/><p>The Spirit Stream Division instantly stirred into action. There was no chaos. Thanks to the arrangements made by Sect Leader Zheng Yuandong, as well as the various peak lords, all disciples and battle beasts boarded the battleship in an orderly fashion.</p><br/><p>The precious treasures and reserve powers of the sect were also loaded onto the battleship. Bai Xiaochun even saw a familiar coffin, which was now covered. Under the patriarch’s care, it was placed in a secret location on the battleship!</p><br/><p>Bai Xiaochun knew at a glance that the coffin contained the true spirit!</p><br/><p>“They’re even bringing the true spirit....” he murmured to himself. The Spirit Stream Division was clearly going all out in this war effort!</p><br/><p>It took three full days to move the Spirit Stream Division’s ninth mountain peak onto the battleship. By this point, the Spirit Stream Sect seemed empty. There were only some Outer Sect disciples left behind to operate the grand spell formation and protect the headquarters.</p><br/><p>The two unused battleships vanished by means of the teleportation power of the ninth mountain peak.</p><br/><p>Bai Xiaochun stood on the battleship looking back at the old headquarters, a profound look in his eyes. Hou Xiaomei stood next to him. Looking a bit scared, she edged closer.</p><br/><p>Heaven-shaking, earth-shattering rumbling sounds then echoed out as the Spirit Stream Division’s Heavenspan Battleship vanished!</p><br/><p>When it reappeared, it was beyond the Luochen Mountains, which was the limit of its teleportation power. As soon as it appeared in Blood Stream Division territory, the people who had been sent out to receive the Spirit Stream Division bowed respectfully, and at the same time, gasped in shock at the sight of the huge ship.</p><br/><p>It wasn’t just them. Any living beings in the area who could see the Heavenspan Battleship with its deva pressure were shocked. Everything went completely silent.</p><br/><p>The Blood Stream Division disciple led the way. Rumbling sounds echoed out that could break all barriers as the Heavenspan Battleship headed in the direction of the Blood Stream Division headquarters.</p><br/><p>As Bai Xiaochun stood there at the front of the battleship looking out at the lands in front of him, he felt a great sense of familiarity. The battleship was incredibly fast, even faster than Nascent Soul patriarchs. It only took about six hours before the Heavenspan River became visible off in the distance. There, the hand of the Blood Ancestor could be seen stretching out of the river, forming the mountain peaks of the former Blood Stream Sect!</p><br/><p>For most cultivators of the Spirit Stream Division, this was their first time seeing the headquarters of the Blood Stream Division. Although they had heard stories, to see it personally was completely different, and all of them were left astonished.</p><br/><p>“That’s a hand!!”</p><br/><p>“Heavens! I can’t believe there’s actually a huge hand stretching out of the Heavenspan River. If the five fingers of that hand can each make a whole mountain peak, then how big is the rest of the giant...?”</p><br/><p>“So this is the Blood Stream Division, huh...?”</p><br/><p>Even as everyone marveled, the Heavenspan Battleship slowly approached the headquarters. The Profound Stream Division and the Pill Stream Division had not been tasked with creating their own Heavenspan Battleships, so they had long since come to the Blood Stream Division headquarters and set up camp outside. Earlier, the camps and the sect headquarters had been quite bustling, but the arrival of the Heavenspan Battleship changed that. Now everyone was looking over and gasping in shock.</p><br/><p>Even the cultivators of the Blood Stream Division had that reaction.</p><br/><p>The Spirit Stream Division was shaken by the sight of the huge hand, and the Blood Stream Division was shaken by the Heavenspan Battleship. Even the patriarchs of the other three divisions were taken aback, and their eyes began to shine brightly.</p><br/><p>“A deva beast’s spine as the keel, crafted into a Heavenspan Battleship!!”</p><br/><p>“The Spirit Stream Division truly is adept at keeping secrets. Of our four divisions, they are the best at concealing their resources!”</p><br/><p>Even as everyone gave voice to their astonishment, the 300,000-meter-long Heavenspan Battleship descended into the Heavenspan River itself. Massive golden waves rolled about, leading to quite a bit of nervousness on the part of the onlookers. Eventually, though, the huge battleship came to rest calmly on the surface of the Heavenspan River!</p><br/><p>The water didn't corrode the ship or hurt it in any way. The Deva Realm aura rolled out, and even the vicious spirits which inhabited the waters avoided it....</p><br/><p>At first, silence reigned, but then, wild cheering broke out. Although most gazes shone brightly, Patriarch Crimsonsoul from the Profound Stream Division didn't seem very happy, and gave a cold harrumph.</p><br/><p>“Patriarch Frigidsect, we gave you enough materials to make at least five Heavenspan Battleships!”</p><br/><p>“Don’t be so impatient, Crimsonsoul. I’ve already made all the preparations for the Profound Stream Division and the Pill Stream Division.” The founding patriarch of the Spirit Stream Sect laughed heartily as he waved his hand. Immediately, a second battleship appeared and began to descend toward the Heavenspan River, followed by a third.</p><br/><p>Finally, a smile broke out on Patriarch Crimsonsoul’s face, and his eyes burned with anticipation as he looked at the 210,000-meter-long Heavenspan Battleship. As for all of the materials he had provided, that didn’t matter anymore. A battleship with the might of a Deva Realm beast was far more than worth it.</p><br/><p>As for the patriarchs of the Pill Stream Division, they felt slightly left out. However, their 90,000-meter battleship was still formidable, and they knew they were the weakest of the four divisions.</p><br/><p>As Bai Xiaochun looked around at everything that was happening, the gathering of the four divisions of the sect, and the familiar Blood Stream Division headquarters, he felt more content than ever.</p><br/><p>“With my help, four great sects united and became the River-Defying Sect. Maybe the name isn’t that amazing, but it was my idea!” As he looked around proudly, he happened to catch sight of Song Junwan on Middle Peak.</p><br/><p>She was smiling as she looked over at Bai Xiaochun, and he was just about to wave to her when he suddenly found that he couldn’t move his arm. Looking over, he realized that Hou Xiaomei was casually holding it in her own arm. First, she glared at Song Junwan, and then she pointed up into the sky and excitedly said, “Look, big bro Xiaochun, an irispetal ibis!”</p><br/><p>Without even thinking about it, Bai Xiaochun looked up and saw a bird flying through the air. Suddenly he shivered....</p><br/><p>Meanwhile, Chen Manyao was standing behind one of the patriarchs in the Pill Stream Division’s camp, looking at the battleships. When she saw Bai Xiaochun, an imperceptible flicker passed through her eyes, but then it vanished. A moment later, her skin began to prickle as she realized that someone was looking at her, someone who was on the Spirit Stream Division’s battleship.</p><br/><p>It wasn’t Bai Xiaochun, but rather, another disciple in the Spirit Stream Division, a graceful, beautiful young woman!</p><br/><p>She wore a long green garment that did little to conceal her curvaceous form. An unreadable expression could be seen on her face, as well as an enigmatic smile.</p><br/><p>Chen Manyao suddenly felt icy cold, inside and out. There was an instinctual terror that rose up inside of her. Her heart began to beat, and she quickly averted her gaze.</p><br/><p>“Who is she...? How come her gaze is so terrifying!?!?”</p><br/>\n</div>"}