{"title": "Chapter 334: Completely Crushed!", "id": 334, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-334-completely-crushed", "volume_title": "Volume 4", "body": "<h1>Chapter 334: Completely Crushed!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Looking to die!?!?” the young woman said with an enraged laugh, the killing intent in her eyes bursting with intensity. Her cultivation base was in the great circle of Foundation Establishment, and she was an extremely adept killer. In fact, she had killed quite a few other cultivators in the great circle. Were it not for the fact that she was on a special, urgent mission, and Bai Xiaochun was clearly beyond ordinary, she would never have just fled.</p><br/><p>And yet, here he was, blocking her path as if he didn’t know what was good for him!</p><br/><p>Bai Xiaochun’s expression was placid, but his eyes were bloodshot, and he was surrounded by a strong murderous aura that caused the Blood Annihilation World to ripple and distort. Without the slightest hesitation, he waved his finger in the direction of Elder Zhou’s corpse.</p><br/><p>Instantly, all of Elder Zhou’s shed blood began to merge together and float up into the air, where it turned into a blood-colored sword!</p><br/><p>Staring at the woman, he said, “Don’t get anxious.... It will only take a moment for me to cut you down with this sword!”</p><br/><p>In response, the woman’s laughter grew louder. And yet, for some reason, perhaps because of the expression on Bai Xiaochun’s face, she felt unease growing inside of her.</p><br/><p>“Since you have a death wish,” she said, “I guess I’ll help you get what you want!” Eyes flickering with killing intent, she performed a double-handed incantation gesture. Instantly, her body blurred, and nine streams of black mist erupted out, which began to gobble up the spiritual energy in the area. In the blink of an eye, the nine streams of mist had become nine enormous waves, racing toward Bai Xiaochun from nine different directions.</p><br/><p>Apparently, if those nine waves converged upon each other, they would explode with shocking power!</p><br/><p>Although all of this takes a bit of time to describe, the young woman attacked with surgical precision and quickness. In the time it takes a spark to fly off of a piece of flint, the nine waves were locked down on Bai Xiaochun and closing in rapidly.</p><br/><p>Bai Xiaochun’s eyes flickered with cold light, and his heart burned with lingering pain. The death of Elder Zhou, and the anguish of the phoenix, gave him an even clearer understanding about war, and about cultivation. Within the bitterness visible in his eyes, a killing intent erupted out. Instead of backing away from the waves, he lifted his right hand and waved it out in front of him.</p><br/><p>In response, a surge of violet qi erupted, whizzing through the air to form a huge, 300-meter-wide violet cauldron that settled around him protectively.</p><br/><p>BOOM!</p><br/><p>A deafening boom rang out as the nine waves slammed into the huge cauldron.</p><br/><p>The cauldron began to tremble; the force of each successive wave was greater than the wave before it, and from the look of things, the cauldron was about to collapse.</p><br/><p>“Die!” said the young woman, hovering some distance off in the air. At the same time, she lifted her right hand and viciously stabbed out with her index finger.</p><br/><p>In response, the nine waves swirled and transformed into countless black leaves. The leaves began to spin around the enormous cauldron, emitting an incisive aura that slashed at it like countless sharp blades.</p><br/><p>Rumbling echoed out, and the cauldron shook even more violently than before. Finally, the slashing of the leaves caused the cauldron to shatter, allowing the leaves to speed inside toward Bai Xiaochun.</p><br/><p>Bai Xiaochun watched all of this happen without commenting. The woman’s magical techniques were strange, and she was clearly no stranger to magical combat. However, he didn’t care about any of that. Taking a deep breath, he slapped his bag of holding and produced a black parasol.</p><br/><p>It was none other than the Eternal Parasol!</p><br/><p>Without any hesitation, he lifted it over his head and opened it!</p><br/><p>His cultivation base erupted with the power of nine crystallized spiritual seas. Streams of Heaven-Dao aura also swirled about, seemingly connecting him to heaven and earth. Strange ripples even appeared in the sky above the battlefield.</p><br/><p>The huge black parasol almost seemed like the night itself as it spread out to cover Bai Xiaochun. At the same time, he poured his cultivation base power into it, causing a black glow to spread out.</p><br/><p>That glow was the black of night!</p><br/><p>At the same time, an astonishing gravitational force erupted out, causing the young woman’s face to flicker. Then she cried out in alarm as her body began to tremble and then wither rapidly. White streams of mist began to pour out from her eyes, ears, nose, and mouth, which were then sucked relentlessly toward the black parasol.</p><br/><p>Those streams of mist were her life force!!</p><br/><p>“What is that thing!?” she shrieked, shaking violently. She tried to back away, but seemed locked in place in midair. No matter how she struggled, she couldn’t prevent her life force from streaming out of her. Even as her hair began to turn white, she suddenly bit down on her tongue, unleashing the power of self-detonation!</p><br/><p>Her right eye exploded, sending blood spraying out in all directions. However, the force of the explosion ripped her free from the gravitational force, shoving her backward by several dozen meters. There, she coughed up more blood, then glared at Bai Xiaochun with venomous hatred and, at the same time, fear. Of course, most of her terror was because of the Eternal Parasol.</p><br/><p>Almost immediately, her body began to turn translucent as she prepared to fade into the air and make her escape. Her only desire now was to escape the Blood Annihilation World and then leave this place.</p><br/><p>Without any hesitation, Bai Xiaochun put away the Eternal Parasol and shot after her at top speed. Inwardly, he was bemoaning the fact that his ruse hadn’t played out exactly as he'd wished. He’d intentionally provoked her into attacking with the hopes that he could use his Eternal Parasol to drain her life force.</p><br/><p>However, this young woman was a Chosen of the Sky River Court, on the very cusp of reaching the Gold Core stage. Not only was she more than an ordinary cultivator, but Bai Xiaochun’s current cultivation base made it difficult for him to control the parasol. Because of that, she managed to escape.</p><br/><p>Even as he bore down on her with lightning speed, she began to fade away, until only ripples were visible in the spot where she had just been.</p><br/><p>“You’re not getting away!” he said, his voice filled with an intense coldness that even he didn’t realize was there, a coldness like the dead of winter. As the coldness spread out, he opened his Heavenspan Dharma Eye.</p><br/><p>As soon as he looked around with his third eye, he unhesitatingly clenched his fist and unleashed a fist strike directly to his left.</p><br/><p>A boom rang out, and the air distorted. The young woman suddenly became visible, blood oozing out of her mouth, a look of incredulity and terror on her face.</p><br/><p>“How did he find me!?!?” The young woman’s heart was starting to pound. She had been injured again, and was now incapable of fleeing. “Dammit, how could the River-Defying Sect have a cultivator like this? His cultivation base isn't weak, nor is his fleshly body. His magical techniques are bizarre, and he obviously has a lot of experience fighting. He’s actually managed to pin me down!!” Because of Bai Xiaochun’s strange techniques, she was incapable of fleeing the Blood Annihilation World. Suddenly, her left eye was shot with blood as she realized that instead of fleeing, she had to risk everything in a fight to the death!</p><br/><p>“Inverse Blood Sky Spirit!” she shrieked. Instantly, all of the blood in her body began to flow in reverse, causing an intense energy to rise up from within her. At the same time, a powerful aura of plants and vegetation began to spread out.</p><br/><p>From a distance, she appeared to be surrounded by scintillating, emerald-colored light. Numerous types of plants and vegetation began to grow around her, almost as if she were becoming one with the jungle around her. Then the plants began to twist and distort as they shot through the air toward Bai Xiaochun.</p><br/><p>It was almost as if Bai Xiaochun wasn’t just fighting this young woman, but rather all of the plants in the jungle around him!</p><br/><p>“Let’s see how you handle this!” she said, her killing intent surging. Countless leaves, vines, and flowers became a tempest hundreds of meters in diameter. As they swept out, the Blood Annihilation World began to emit creaking noises as it teetered on the verge of collapse.</p><br/><p>Cultivators on both sides of the conflict in the area all noticed, and were shocked.</p><br/><p>“I’ll show you exactly how I handle it!” Bai Xiaochun replied, his expression growing even more icy than before. Taking a deep breath, he reached out with both hands and performed an incantation gesture. As the tempest of vegetation closed in, he swept his hands violently through the air, simultaneously uttering three words!</p><br/><p>“Magic Plant... Arsenal!”</p><br/><p>BZZZZZZ!</p><br/><p>His hair whipped about him as his energy soared, and he drew upon his great circle cultivation base, his Heaven-Dao aura, and his skill in the Dao of medicine, to use the very magic that Li Qinghou had bestowed upon him, the Magic Plant Arsenal!</p><br/><p>Buzzing sounds filled the air as the vegetation around him suddenly stopped in place and began to tremble. It was almost as if two forces of will were battling it out within the tempest, vying for control over the plants and vegetation!</p><br/><p>“Impossible!!” the young woman gasped, her face falling.</p><br/>\n</div>"}