{"title": "Chapter 330: Locking Down the Dire Skybanyan!", "id": 330, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-330-locking-down-the-dire-skybanyan", "volume_title": "Volume 4", "body": "<h1>Chapter 330: Locking Down the Dire Skybanyan!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>For the River-Defying Sect, there was one key to this battle.</p><br/><p>The Dire Skybanyan!</p><br/><p>The attacks from the Heavenspan Battleships had one purpose: to clear the way for Bai Xiaochun to reach the Dire Skybanyan.</p><br/><p>The three beams of light cut through everything like razor-sharp knives slicing through bamboo. When they slammed into the Dire Skybanyan, the tree trembled and let out a bitter cry that caused blood to ooze out of the mouths of any cultivators in the vicinity.</p><br/><p>However, it didn’t affect the Blood Ancestor at all. Under Bai Xiaochun’s control, the Blood Ancestor leaped high into the air to appear directly in front of the ancient skybanyan. Then, a giant fist formed and slammed into the tree with the force of ten mountains.</p><br/><p>A huge boom echoed out, and the gigantic tree trembled even more violently. Suddenly, enormous waves surged out on the surface of the Heavenspan River as a 30-meter-wide root exploded out. It was over 3,000 meters long and razor-sharp, causing whistling sounds to echo out as it sped toward the Blood Ancestor.</p><br/><p>SMASH!</p><br/><p>The Blood Ancestor wasn’t hurt, but many of the Blood Stream Division cultivators inside coughed up blood from the force of the blow, and had to struggle to prevent their cultivation bases from surging out of control. Bai Xiaochun knew that time was limited, so he quickly unleashed another fist strike.</p><br/><p>It was a fist strike that could seriously injure even a Nascent Soul cultivator, but the Dire Skybanyan did not fall!</p><br/><p>And yet, the ancient tree was shocked by the threatening power of the Blood Ancestor, and could tell that only a small portion was being used. If the Blood Ancestor’s full battle prowess were unleashed, a single fist strike would be more than enough to cause the Dire Skybanyan to explode into countless fragments!</p><br/><p>Even still, the small portion of power being used was still shocking. Although the tree wasn't confident in being able to harm the giant, it was sure that it could kill the person inside who was controlling it!</p><br/><p>At the moment, it was willing to pay any price to do just that! As Bai Xiaochun battered it, the tree began to sway back and forth. As for the cultivators of the Sky River Court, it was with complete shock, and fully bloodshot eyes, that they attempted to intervene.</p><br/><p>It was in that moment of crisis that a second root shot out toward the Blood Ancestor, then a third and a fourth.</p><br/><p>Whistling screams filled the air, and Bai Xiaochun gritted his teeth. Considering he was in the heart cavity, the brunt of the attacks were being borne by others. Even still, blood was oozing out of Bai Xiaochun’s mouth, and on top of that, the power of the attacks was increasing.</p><br/><p>Moments later, a fifth root appeared, then more, until there were eight. The cultivators inside the Blood Ancestor were having a hard time sustaining such force, and many of them were lapsing into unconsciousness. As a result, Bai Xiaochun’s control over the Blood Ancestor was beginning to falter.</p><br/><p>However, the sustained barrage by the Blood Ancestor had knocked open a gap in the trunk of the Dire Skybanyan!</p><br/><p>“I can’t keep things up like this!” Bai Xiaochun thought, eyes flickering. Roaring at the top of his lungs, he stretched the Blood Ancestor's hands out, shoving them into the gap that had opened, and then exerted all the strength he could muster to rip the opening wider!</p><br/><p>An ear-piercing ripping sound echoed out, causing numerous Sky River Court cultivators on both banks of the river to let out bloodcurdling screams. Even the Nascent Soul cultivators fighting up in the air were shocked.</p><br/><p>Bai Xiaochun ripped the gap open to double its previous size, causing the screams of the Dire Skybanyan to echo high into the heavens.</p><br/><p>As the huge tree struggled, the waters of the Heavenspan River water seethed, and massive waves rolled out as a gigantic root erupted into the air.</p><br/><p>When the huge root slammed into the Blood Ancestor, Bai Xiaochun felt like he was about to pass out. Many of the other cultivators inside the Blood Ancestor coughed up blood. Bai Xiaochun could sense his control over the Blood Ancestor slipping away.</p><br/><p>It was in that very moment that two enormous, 30,000-meter-long roots suddenly rose up from within the Heavenspan River.</p><br/><p>They were clearly different from the other roots; they were the main roots of the Dire Skybanyan! They were like enormous pillars, one on the right, one on the left, smashing toward the Blood Ancestor!</p><br/><p>It was a critical moment in which there was no time for pondering or consideration. Bai Xiaochun’s eyes were bright red, and he was operating fully on instinct. The Blood Ancestor’s left hand reached out to grab the huge root on the left side. Clamping it under the Blood Ancestor's left armpit, Bai Xiaochun sent the right hand out to grab the other root and do the same!</p><br/><p>Rumbling sounds echoed out from the right and left. Bai Xiaochun’s face was as white as a sheet of paper as he exercised the last bit of control he was capable of... to bend the Blood Ancestor’s legs!</p><br/><p>“Maybe I can’t kill you, but I can lock you down!” The Blood Ancestor gripped the two main roots tightly, then began to sink down into the river!</p><br/><p>Intense rumbling sounds could be heard as the Blood Ancestor sank below the surface of the Heavenspan River, holding the two roots as he descended toward the river bottom. No matter how the Dire Skybanyan struggled, it was incapable of preventing this from happening.</p><br/><p>ROAR!!</p><br/><p>The Dire Skybanyan was going mad, but was helpless. In the blink of an eye, the sinking Blood Ancestor caused the Dire Skybanyan to begin to tilt over.</p><br/><p>Now that it was locked in place, it was difficult for the Dire Skybanyan to struggle, let alone unleash its most powerful divine abilities. Taking advantage of the moment, Bai Xiaochun opened the Blood Ancestor's mouth and let out a shocking roar from beneath the surface of the Heavenspan River.</p><br/><p>Instantly, a blast of air carved out a tunnel within the water, within which appeared numerous Blood Stream Division cultivators. Borrowing the force of the blast of air, they shot out into the open. Gold Core cultivators, Foundation Establishment experts, patriarchs, and even vast numbers of Outer and Inner Sect disciples all burst out into the open.</p><br/><p>All of them had injuries, but as soon as they bathed in the light cast by the Pill Stream Division’s cauldron, their wounds began to mend. Clearly, they had been prepared for this moment. As soon as they were out in the open, members of the other three divisions rushed to aid them, and many of them grouped up into the Blood Stream Division’s locust-like battle formations.</p><br/><p>The Nascent Soul cultivators, including Master Godwind, Patriarch Limitless, and the Song Clan patriarch, all roared and transformed into beams of light that went to join the Nascent Soul battles.</p><br/><p>Although all of them were injured in various ways, as soon as they joined the fighting, the Nascent Soul battles became like the Gold Core battles, and favored the River-Defying Sect!</p><br/><p>As for the Gold Core battles, they became even more one-sided.</p><br/><p>The last person to fly out of the Blood Ancestor’s mouth was Bai Xiaochun, blood spraying out of his mouth. As soon as he was visible, eight cultivators from the Spirit Stream Division shot toward him.</p><br/><p>These eight were no strangers to Bai Xiaochun. They were the same compatriots with whom he had formed the ninth spell formation of Mount Daoseed. Without the slightest hesitation, they closed in on Bai Xiaochun, and immediately, the light of a spell formation appeared.</p><br/><p>“Form up!” Bai Xiaochun roared. Instantly, light rose up around the nine of them, becoming a 300-meter-tall giant, which leaped into the air. As it sailed upward, its right hand shot out, and a blood-colored greatsword appeared. That sword was formed from the blood qi of the cultivators of Middle Peak!</p><br/><p>Bai Xiaochun raised the sword high into the air and then slashed it down, whereupon it sliced a nearby skybanyan into two parts!</p><br/><p>RUMBLE!</p><br/><p>Everything shook wildly, and all onlookers were completely shaken by the preparation and teamwork shown by the River-Defying Sect.</p><br/><p>That was especially true of the audience of cultivator clans and smaller sects. Their minds were completely spinning, and their scalps were tingling with shock.</p><br/><p>The power and determination shown by the River-Defying Sect left them completely shaken down to their souls.</p><br/><p>The battle between the Blood Ancestor and the Dire Skybanyan was something no one would ever be able to forget for their entire lives. Whether it was that fight, or the fighting with the Nascent Soul cultivators or the Gold Core experts, it was clear that the Sky River Court had the disadvantage!</p><br/><p>All of the cultivators from the clans and sects were left gasping, their eyes shining with strange light.</p><br/>\n</div>"}