{"title": "Chapter 346: The Mysterious Power Appears Again!", "id": 346, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-346-the-mysterious-power-appears-again", "volume_title": "Volume 4", "body": "<h1>Chapter 346: The Mysterious Power Appears Again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A few days later, the work on the sect headquarters continued. No more incidents occurred, and everyone would have quickly forgotten about it were it not for the fact that Bai Xiaochun only appeared in the open blanketed with paper talismans.</p><br/><p>Xu Baocai and some of his other friends were very curious about the situation, and Bai Xiaochun couldn’t simply refuse to tell them the truth of the matter. Therefore, he used a variety of vague wording to explain that the River-Defying Sect was being haunted by a ghost.</p><br/><p>Xu Baocai and the others were quite frightened, and soon started imitating Bai Xiaochun, plastering all sorts of paper talismans on themselves to ward off evil spirits. Of course, they didn't quite use as many as Bai Xiaochun did....</p><br/><p>Bai Xiaochun’s talismans covered virtually every inch of his body other than his face.</p><br/><p>When he went out and about, jaws would drop, and eyes would go wide.</p><br/><p>Whether it was Zhou Xinqi or Ghostfang, Song Que or Nine-Isles, all of them were completely taken aback. One evening when Bai Xiaochun was strutting about festooned with talismans, he happened to run into Gongsun Wan’er.</p><br/><p>Even she was shocked by Bai Xiaochun’s appearance. Jaw dropping, she blurted, “Elder Brother Xiaochun, what are you....”</p><br/><p>“Well, if it isn’t Junior Sister Gongsun.” Bai Xiaochun looked her up and down, then glanced around furtively, stepped closer, and whispered, “Look, I’m gonna tell you something that you have to keep secret. The River-Defying Sect is haunted by a ghost! That's why I have all these paper talismans on, to ward off evil spirits.”</p><br/><p>Gongsun Wan’er’s eyes went even wider. A moment passed, and she jokingly looked him up and down, then reached out and rubbed some of the talismans. Finally, she forced a smile onto her face, promised that she wouldn’t tell anyone else, and left.</p><br/><p>Feeling very pleased with himself, Bai Xiaochun continued on his way.</p><br/><p>Eventually, everyone was talking about the matter of the sect being haunted. By the time the patriarchs of the four divisions realized what was happening, it was too late to quell the rumors. Bai Xiaochun’s eye-catching appearance left them frustrated and shaking their heads wryly.</p><br/><p>“He’s at Gold Core, and he’s still scared of ghosts....”</p><br/><p>“Besides, that ghost is so terrifyingly powerful that those paper talismans he’s wearing would be completely useless against it.”</p><br/><p>Chuckling dryly, the patriarchs decided to just ignore the matter. A few more days passed, and when Bai Xiaochun realized that no further incidents were forthcoming, he finally started to feel more at ease.</p><br/><p>Sighing emotionally, he said, “It doesn’t matter what demons or devils or ghosts come around, with my special anti-evil clothing, they’ll all be turned into nothing but ash. Ai. Yet again, I've saved the sect. Nobody even knows the true extent of what I, the junior patriarch of the River-Defying Sect, have done to help out all my other fellow disciples!” It was currently late at the night, and he was sitting cross-legged in his immortal's cave, meditating.</p><br/><p>However, even as the words left his mouth, ripples spread out across the floor. They were strange ripples that seemed to be separating the area from the world outside, and they were accompanied by a frigid coldness.</p><br/><p>The sudden development caused Bai Xiaochun’s eyes to widen, and a shrill shriek to escape his lips. He leapt to his feet, slapping his bag of holding and producing a huge stack of evil-warding paper talismans.</p><br/><p>“Get out of here! Stay away! I'm dangerous! I'm wearing hundreds of evil-warding talismans!!” However, even as he backed up, trembling, a red beam of light shot out of his bag of holding, which was none other than the mask he had worn during his time as Nightcrypt.</p><br/><p>The mask was vibrating, and emanating ripples, and soon, the voice of an old man began to speak from within the mask.</p><br/><p>“You--”</p><br/><p>“‘You’ who?!” Bai Xiaochun shrieked. Without any hesitation, he threw the entire stack of paper talismans at the mask, and then poured all of the Heaven-Dao Gold Core power he could into it. Within that stack were talismans of sealing, crushing, and warding, and once the power hit them, they virtually exploded.</p><br/><p>Rumbling filled the air, and the mask trembled as countless paper talismans slapped down onto it. Whatever connection it had with the ground was severed, and the mask fell down. In that same moment, the fluctuations vanished, and everything went back to normal.</p><br/><p>Beads of sweat covered Bai Xiaochun’s forehead. Even in the heat of the moment, he knew that the voice which had spoken was not the ghost he feared, but rather, the mysterious group that was behind the mask....</p><br/><p>A moment later, the soul of imposter Nightcrypt flew out of the mask, trembling with fear. Looking at Bai Xiaochun, he cried, “They came! They really came....</p><br/><p>“We’re finished, Bai Xiaochun, finished! You took the relic of eternal indestructibility, and now the mysterious power is after us!</p><br/><p>“We're dead for sure.... There’s no way they’ll show leniency to betrayers. They’ll probably skin us alive and turn us into fertilizer....”</p><br/><p>“Shut up!” Bai Xiaochun barked, annoyed and surprised at the same time. However, he also felt somewhat guilty. After all, he really had taken away the little turtle.</p><br/><p>“Dammit. I'm not even wearing the mask! How could they have tracked me down anyway!?” He thought about simply throwing the mask away, but couldn’t quite bring himself to get rid of something so precious. Besides, the soul of imposter Nightcrypt was still stuck inside, so if he threw it away, he would be screwing him over too.</p><br/><p>“What... what do we do, Bai Xiaochun?” If imposter Nightcrypt weren’t a soul body, he would definitely have been leaking tears.</p><br/><p>Bai Xiaochun looked anxiously at imposter Nightcrypt, then took a moment to think about the situation. Despite some consideration, he couldn't come up with any solution other than to hand the mask over to the patriarchs.</p><br/><p>“What a pity to get rid of a treasure like this that can change your appearance.” Bai Xiaochun wasn’t sure about what to do. Another half a month went by, and when nothing else happened with the mask, he finally started to calm down.</p><br/><p>**</p><br/><p>The work on the sect headquarters was approaching its conclusion.</p><br/><p>The patriarchs were also reaching the end of their discussions about how to handle the situation in the Lower Reaches, as well as the territory currently under the control of the River-Defying Sect.</p><br/><p>Most importantly, they were finalizing all the official sect rules.</p><br/><p>According to the new arrangement, one of the four divisions would be formally in charge of the sect for a two-hundred-year period. After those two hundred years, the sect affairs would pass to the next division. The same arrangement would determine who the sect leader was. The first division to wield leadership power in the sect was the Spirit Stream Division. No longer was Zheng Yuandong to be the leader of the Spirit Stream Division, he was to be the sect leader of the entire River-Defying Sect!</p><br/><p>Although his cultivation base was a bit lacking, he was more than qualified to handle the responsibilities!</p><br/><p>In fact, with the agreement and help of the patriarchs, Zheng Yuandong decided to sacrifice his potential for future growth to make an immediate breakthrough into Core Formation. Furthermore, he made arrangements for Li Qinghou to succeed him as the second sect leader, one hundred years later.</p><br/><p>At the end of the Spirit Stream Division’s two hundred years of leadership, the Blood Stream Division would take over. After that would come the Profound Stream Division, and then finally the Pill Stream Division.</p><br/><p>None of the patriarchs were opposed to the arrangement!</p><br/><p>Soon, the sect headquarters was completed. The Blood Ancestor and the Dire Skybanyan stood tall, and the four mountain ranges spread out in all directions. The last step was to activate the grand spell formation, and then everything would be finished!</p><br/><p>The cheering was deafening. A month before, the three Heavenspan Battleships had been sent downriver to the Lower Reaches, and had returned with the disciples who had been unable to fight in the war for various reasons.</p><br/><p>With all the disciples present, the River-Defying Sect now had well over 1,000,000 members. It was quite a bustling place.</p><br/><p>A grand ceremony was held to commemorate the occasion, and numerous invitations were sent out into the Middle Reaches to the other three great sects, as well as certain ancient cultivator clans.</p><br/><p>The formalities lasted for seven days. The Starry River Court, Dao River Court and Polarity River Court all sent people to offer formal congratulations. Not a single one of the cultivator clans failed to send representatives.</p><br/><p>As for the four major sects who had risen up in the Lower Reaches, they also sent representatives with congratulations and gifts. During that seven-day period, the River-Defying Sect was the talk of the entire Middle Reaches.</p><br/><p>As the junior patriarch of the sect, Bai Xiaochun obviously had a very high standing, and was the subject of much attention. He made public appearances every day, wearing ceremonial clothing and showing off his veins of steel. He could not have glittered with any greater glory than he did. Bai Xiaochun quickly fell in love with his role. However, the patriarchs, as well as Li Qinghou, only got more nervous, fearing that he would reveal his true nature in front of all the crowds.</p><br/><p>However, no one noticed any such clues. He chatted with people wittily, and was definitely the center of attention. Whenever he intentionally unleashed his murderous aura, everyone in the area was shocked.</p><br/><p>The patriarchs were very pleased with his performance, and Bai Xiaochun was quite proud of himself. To him, it was actually a very simple matter to put on such an act. Seven days later, the ceremonies ended, the visitors left, and the sect quieted down.</p><br/><p>At the moment, the biggest problem facing the River-Defying Sect was...</p><br/><p>They had no Deva Realm cultivator!</p><br/><p>The other three great sects in the Middle Reaches all had a Deva Realm patriarch to oversee the sect. That was the only way to truly be a great sect, and it was a fatal weakness for the River-Defying Sect!</p><br/>\n</div>"}