{"title": "Chapter 370: I'm Gonna Kill You, Bai Xiaochun!", "id": 370, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-370-im-gonna-kill-you-bai-xiaochun", "volume_title": "Volume 4", "body": "<h1>Chapter 370: I'm Gonna Kill You, Bai Xiaochun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 370: I'm Gonna Kill You, Bai Xiaochun!</strong></p><br/><p>“Screw the hell off!” Bai Xiaochun roared, unleashing the Mountain Shaking Bash, sending him barreling toward Chen Yunshan with explosive speed.</p><br/><p>They were both moving incredibly quickly, but Bai Xiaochun had the advantage. As he closed in, he stretched out his left leg and tapped his big toe on Chen Yunshan. A deafening boom echoed out, as well as a miserable shriek from Chen Yunshan as he was sent flying. At the same time, golden strands appeared on the surface of his body, apparently some sort of restrictive spell that was boring into Chen Yunshan and sealing his flesh and blood.</p><br/><p>“You think a bit too much of yourself! One of my toes can send you flying!” Bai Xiaochun’s left shoe had exploded, revealing the fact that his big toe was flickering with golden light. Brushing off his robe, he produced a new shoe, put it on, then continued to flee.</p><br/><p>Behind him, the enraged cultivators of the Starry River Court helped the trembling Chen Yunshan to his feet. Even as he coughed up a mouthful of blood, he realized that his cultivation base had been sealed, making it completely impossible for him to use it at all. Eyes flaring with madness, he howled, “Fellow Daoists from the Starry River Court, set up the formation and kill this guy. Fellow Daoists from the Polarity River Court and Dao River Court, if we don’t join forces and cut him down, how can we ever live down the humiliation of this day!?!?”</p><br/><p>The cultivators of the Starry River Court exchanged glances and then nodded. Unleashing the power of their cultivation bases, they called upon the same stream of starlight they had used to deal with the defensive spells earlier, sending it shooting toward Bai Xiaochun with incredible speed.</p><br/><p>As that happened, the group from the Polarity River Court looked at each other, then howled, sending devil qi surging out to form a gigantic head.</p><br/><p>The vicious-looking head let out a fierce howl, causing intense pressure to weigh down all around it as it shot after Bai Xiaochun.</p><br/><p>The cultivators from the Dao River Court weren’t any more willing to let the situation drop. If they did, they could only imagine what would happen upon returning to their sect: they wouldn’t even be able to look anyone else in the eye! Moments later, intense rumbling sounds echoed out as the illusory giant appeared again.</p><br/><p>Howling, the giant began to charge toward Bai Xiaochun.</p><br/><p>From a distance, it was possible to see a stream of starlight, a gigantic head, and an enormous giant, all three of them deadly divine abilities, closing in on Bai Xiaochun.</p><br/><p>Bai Xiaochun’s scalp was tingling so hard it felt like it might explode.</p><br/><p>“You guys are really serious, aren’t you?! I can’t believe... you’re actually using spell formations against me!!” By this point, his Undying Live Forever Technique was in full operation, and he was flying along as fast as his Heaven-Dao Gold Core could push him.</p><br/><p>Unfortunately, the combined divine abilities of the three sects were even faster than that. Moments later, intense rumbling sounds could be heard as the stream of starlight appeared in front of him.</p><br/><p>Bai Xiaochun trembled, and blood oozed out of the corners of his mouth. Before he could do anything else, though, the huge head closed in, spitting out a blast of frigid devil qi that surrounded him, making it almost impossible to move, and freezing the blood that spilled out of his mouth. Before he could recover, the giant unleashed a fist strike onto him.</p><br/><p>BOOM!</p><br/><p>Frozen blood shot out of Bai Xiaochun’s mouth as he was flung backward, his hair in wild disarray and his eyes completely bloodshot. As he flew through the air, he slapped his bag of holding, producing a fistful of medicinal pills with he hurled into the air behind him.</p><br/><p>Those medicinal pills contained all sorts of strange properties, and as soon as they exploded, they immediately caused problems for all the pursuing cultivators. Bai Xiaochun continued to flee, so nervous that he was bordering on madness.</p><br/><p>“Dammit! Why hasn’t the teleportation started!? Patriarchs, I'm about to lose my poor little life!!” Tears welled up in his eyes as he watched the cultivators of the three sects building up another volley of divine abilities.</p><br/><p>“What are you scared of?” the little turtle said disdainfully. “I'm still here! Just throw me at them. They’re just using some lame Dharma Idols and magical projections, that’s all. Lord Turtle has destroyed so many of those kinds of things that he can’t even remember how many.”</p><br/><p>Bai Xiaochun threw his head back and roared, “You people push things too far!!”</p><br/><p>A murderous aura erupted out from him as he reached his hand back and then hurled the little turtle out as hard as he could.</p><br/><p>BOOM!</p><br/><p>The little turtle instantly appeared in front of the Dao River Court’s giant, which could do nothing to stop him. In the blink of an eye, he had pierced through the giant and was heading toward the Dao River Court cultivators who were operating it.</p><br/><p>This time, the little turtle struck a female disciple. She was the type of person who radiated an extraordinary air, and despite her killing aura, she was quite beautiful. But then, an enormous smacking sound rang out as the little turtle hit her right in the middle of the face.</p><br/><p>Tears leaked out of her eyes from the pain, and she let out an agonized shriek. Then, she realized that everyone was looking over at her with odd looks on their faces. Heart pounding, she pulled a mirror out of her bag of holding, and when she looked at herself, she screamed in bloodcurdling fashion.</p><br/><p>“I'm gonna kill you, Bai Xiaochun!!!” she raved, her hair flying about in disarray. Without any hesitation, she shot after Bai Xiaochun as fast as she could. Unfortunately, he was far too quick and agile.</p><br/><p>The young woman’s impulsive action instantly affected the other cultivators who were operating the giant.</p><br/><p>As for Bai Xiaochun, considering how effective this tactic was, he quickly grabbed the little turtle and threw him out again.</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>Then, Bai Xiaochun went crazy, constantly tossing out the little turtle to fight back against the magical techniques and divine abilities.</p><br/><p>Before long, more than half of his pursuers had little turtle marks on their faces, chests, waists, stomachs, and even some... on their rear ends.</p><br/><p>The mark of the little turtle was actually a very terrifying thing; even if he hit their clothing, the mark would pass through and end up on their skin. The marks even glowed, as if they were worried that people might not notice them.</p><br/><p>Not even thick clothes or powerful magical defenses were capable of stopping the little turtle marks from glowing brightly. There was one young female disciple who got hit on the chest, and nearly collapsed when everyone looked over to see her and the glowing turtle mark there....</p><br/><p>People used all sorts of defensive magical items when the little turtle closed in, but they were all useless. The terrifying little turtle was causing everyone in the battle to go crazy.</p><br/><p>The divine abilities and magical techniques they were unleashing were influenced by their surging emotions, or perhaps by the turtle marks. In any case, they eventually just faded away.</p><br/><p>“There’s too many of you for me to beat in a fight, but I can sure embarrass you guys to death!” Bai Xiaochun was shocked, and initially felt that the little turtle was being too vicious. However, as soon as he thought about how these people were trying to kill him, he angrily yelled, “Little turtle, are you sure those marks of yours can’t be erased?”</p><br/><p>“Don't worry,” the little turtle said proudly, “not even a demigod could erase them!”</p><br/><p>With that, Bai Xiaochun glanced back at the cultivators who had no marks on them, seemingly itching to get at them.</p><br/><p>“Great! They were the ones who pushed things too far, so they can’t blame me for this!” Gritting his teeth, he hurled the little turtle out again, sending him flying toward one of the unstruck cultivators.</p><br/><p>Those unmarked cultivators were currently hesitating a bit. However, they had convinced themselves that the marks couldn’t possibly be indelible. In their minds, they would certainly be able to find a way to deal with them after returning to the sect. Even if they couldn’t, surely someone from the elder generation would be able to help them. Therefore, it was with burning rage that they continued to chase after Bai Xiaochun.</p><br/><p>Booms rang out continuously as all of them were branded with the mark of the little turtle. Furthermore, all of their powerful divine abilities and magical techniques were faltering. The stream of starlight collapsed, followed by the huge head. Then the Dao River Court’s giant fell into pieces.</p><br/><p>The only thing chasing Bai Xiaochun now was a mob of enraged cultivators, all of whom had turtle marks on them.</p><br/><p>“I swear to the heavens, I'm gonna kill you, Bai Xiaochun!”</p><br/><p>“Dammit! If I don’t kill you today, I'm not surnamed Liu!!”</p><br/><p>Bai Xiaochun’s powerful fleshly body was being pushed to its limit. He was coughing up blood and covered with wounds, and yet, his counterattacks were incisive and penetrating.</p><br/><p>Whether it was his own attacks, or the little turtle marks, he had pushed everyone to the absolute limits of fury.</p><br/><p>Thankfully, it was in that moment that teleportation power began to fill the legacy zone.</p><br/><p>Beams of teleportation light began to rise up, and the mob of pursuers suddenly stopped in place. If they didn’t enter those teleportation lights before the time limit was reached, they would lose their chance to leave, and not even their sects would be able to do anything to save them. As of this moment, they had to abandon any hopes of killing Bai Xiaochun.</p><br/><p>Having been forced to give up, they stared at Bai Xiaochun with such murderous glares that it seemed they were trying to cut him to pieces with their eyes.</p><br/><p>Bai Xiaochun breathed a huge sigh of relief as he leaped into one of the teleportation lights. Looking over his shoulder, it was with great pride that he looked at the little turtle marks glittering on all of his opponents.</p><br/><p>“Hmph! You guys are the ones who pissed me off! When I attack, I frighten even myself!”</p><br/><p>The little turtle looked at the crowd of enemies and seemed completely satisfied. He even appeared to be sighing. From the look of it, he was more proud of himself than Bai Xiaochun was.</p><br/><p>--</p><br/><p><strong>Translator:</strong> Deathblade.<strong> Chinese language consultant:</strong> ASI a.k.a. Beerblade. <strong>Editor:</strong> GNE. <strong>Memes:</strong> Logan. <strong>Meme archives:</strong> Tocsin. <strong>Transcendent Patrons:</strong> Daoist Elder N, BLE, ttre208. <strong>AWE Glossary</strong>. <strong>Xianxia-inspired T-shirts</strong>.</p><br/>\n</div>"}