{"title": "Chapter 375: Bai Xiaochuns Dao Protectors....", "id": 375, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-375-bai-xiaochuns-dao-protectors", "volume_title": "Volume 4", "body": "<h1>Chapter 375: Bai Xiaochuns Dao Protectors....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 375: Bai Xiaochun’s Dao Protectors....</strong></p><br/><p>Bai Xiaochun felt as if his heart were withering. Looking up again at Frigidsect to make sure he wasn’t pulling a prank, he finally exclaimed, “Why did you make me so outstanding, oh heavens? I can’t believe that even the Starry Sky Dao Polarity Sect can’t do without me!”</p><br/><p>Moments ago, Frigidsect had been feeling sad, but after hearing Bai Xiaochun’s words, he could do nothing but cough dryly. Now that he thought about it, in some ways, sending Bai Xiaochun to the Starry Sky Dao Polarity Sect wasn’t that bad of a choice after all.</p><br/><p>“You leave in three days,” he said. “Take this command medallion. It gives you the authority to select any Dao protectors from your current generation to accompany you....” With that, he handed Bai Xiaochun the command medallion and then turned to leave. Before walking out the door, he added one final reminder.</p><br/><p>“You can select, at most, five Dao Protectors. The Starry Sky Dao Polarity Sect won’t allow any more than that.”</p><br/><p>Bai Xiaochun stood amidst the ruins of his immortal's cave, watching Frigidsect leave. Then he slumped down, somewhat in a daze. After wrestling with his thoughts for an hour, he watched the sun rise and then finally sighed.</p><br/><p>“Ah, whatever. Since the Starry Sky Dao Polarity Sect wishes for me to come, then I guess I’ll go check things out.” Although he was still a bit depressed, the idea of being able to select his own Dao Protectors was an exciting thought.</p><br/><p>“I'm not going to take Bruiser with me,” he murmured. “The Starry Sky Dao Polarity Sect is too much of a strange and dangerous place.</p><br/><p>“So. Dao protectors, hm? Who should I pick? I'm going to be in a strange place, so I’ll definitely need someone good at digging up information!” With that, he began to think about everyone he knew.</p><br/><p>“They’ll need to be quick-witted, and good at making discreet inquiries. I need someone who’ll be able to find out about everything in the Starry Sky Dao Polarity Sect, and quickly at that. I’ll need to know all the rumors! It will definitely require a pure genius....”</p><br/><p>Suddenly, he slapped his thigh, and his eyes began to shine. “Xu Baocai!”</p><br/><p>Back in the Spirit Stream Sect, Xu Baocai had always been adept at rooting out information. He knew who all the top beauties in the sect were, and how they were ranked. Bai Xiaochun also remembered how, whenever Xu Baocai got some new information, he would make a record of it in his little notebook.</p><br/><p>“He prefers to hand-write things instead of using jade slips. Only a person completely dedicated to his work would do that. Yeah, nobody would be fit for this position other than Xu Baocai!” Chuckling, Bai Xiaochun thought about how quickly Xu Baocai had fit into the River-Defying Sect as a whole, and how he knew about all the gossip and news. In fact, whenever Bai Xiaochun wanted to know anything, he was completely confident in being able to get an answer from Xu Baocai.</p><br/><p>Without any further hesitation, he shot through the air toward the mountains of the Spirit Stream Division. As he neared Xu Baocai’s immortal's cave, he saw Xu Baocai standing outside, his eyes sparkling like gems, and his expression one of intense sorrow. Almost immediately, Xu Baocai began to wail, “Sect Uncle Bai, I'm going to miss you so much! I heard that you’re going to become a hostage in the Starry Sky Dao Polarity Sect. Who knows when we’ll meet again, Sect Uncle Bai? You take care of yourself!!”</p><br/><p>“Wow, you got the news that quickly?” Bai Xiaochun said, surprised. He had just been informed himself, and yet somehow, Xu Baocai already knew.</p><br/><p>“Yeah, that’s right,” Xu Baocai said proudly. “Nobody knows more about what's going on in the River-Defying Sect than Xu Baocai. Wherever I go, I find out all the secrets. I have countless ways of ferreting out information.” This was actually what Xu Baocai was most proud of, and he couldn’t tolerate when people doubted his abilities.</p><br/><p>“But don’t worry, Sect Uncle Bai,” he continued in a serious tone. “I’ll continue to make sure everyone knows about all of your stories. All the new recruits in the sect will hear everything about you.” Inwardly, he was feeling very pleased. The recent events in which virtually all the female disciples in the sect had become infatuated with Bai Xiaochun had left him very depressed. As far as he was concerned, with Bai Xiaochun around, it would be very difficult to get a Daoist partner of his own. All of the girls he liked turned out to be smitten with Bai Xiaochun, which left him feeling very down.</p><br/><p>As soon as he'd heard that Bai Xiaochun would be leaving for the Starry Sky Dao Polarity Sect, his heart had swelled with excitement.</p><br/><p>Bai Xiaochun was actually very pleased by what he had just heard. Clasping Xu Baocai’s shoulder tightly, a look of both sincerity and sorrow appeared on his face as he said, “Listen, my brother, I was actually hesitating before. After all, the Starry Sky Dao Polarity Sect will be an unfamiliar place, and I didn’t want to drag any of my sect brothers and sisters into this situation with me. But after what you said just now, I completely understand!”</p><br/><p>“Huh?” Xu Baocai suddenly realized that he hadn’t gotten all the information, and that something about the situation was clearly off.</p><br/><p>He opened his mouth to speak, but before he could, Bai Xiaochun said, “I need a Dao protector who can help me get information in the Starry Sky Dao Polarity Sect, and that person is you!”</p><br/><p>A tremor ran through Xu Baocai, and his eyes widened. Suddenly, he understood everything, and his face fell. “Sect Uncle Bai, um, my cultivation base is a bit low....”</p><br/><p>Bai Xiaochun waved his hand dismissively. “I need someone who can get information, not someone with a high cultivation base!”</p><br/><p>“B-but... but I'm really clumsy....”</p><br/><p>“Ah, don’t worry about it. As long as you can root up all the secrets and get all the news about the places we go to, that will be enough. Besides, I'm well acquainted with your brave personality. The blood notice from years ago proved that. Alright, don't bother with any pretence of refusing. I know you’ll miss me too much if I leave you behind. Therefore, the matter is settled!” Bai Xiaochun laughed heartily, but then he noticed that Xu Baocai’s face was a bit ashen, and he appeared to be on the verge of refusing. Therefore, Bai Xiaochun quickly pulled out the command medallion Frigidsect had given him and waved it in front of Xu Baocai’s face.</p><br/><p>“A patriarch’s command medallion!” Xu Baocai said with a gasp. He was completely and utterly thunderstruck, and unsure of how to react. After a long moment passed, he felt like he was about to cry; he knew that he couldn’t refuse even if he wanted to. All of a sudden, he felt a bit sick to the stomach.</p><br/><p>Bai Xiaochun put his arm around Xu Baocai’s shoulder and the cleared his throat. Chuckling, he said, “Don’t worry, I’ll take care of everything. Come, come, Little Treasure. You know everything about the sect, so help me analyze the situation a bit. Which other dependable disciples do you think I should bring with me?”</p><br/><p>Xu Baocai appeared to be on the verge of tears. The thought of going to the unfamiliar Starry Sky Dao Polarity Sect was a terrifying thing. However, despite how much he didn't wish to go, he didn’t have a choice. Based on what Bai Xiaochun had just said, it appeared that they would be able to drag some other people into the situation with them, which helped Xu Baocai focus.</p><br/><p>Gritting his teeth, he pondered the situation for a moment, and soon thought of Master God-Diviner. Xu Baocai and Master God-Diviner had developed a bit of a grudge between each other, and Master God-Diviner had even given him a nasty look before. Both of them had happened to like the same female disciple at one point, but in the end Master God-Diviner won her over. Sadly, Xu Baocai’s cultivation base was too low, so he had been forced to accept the situation. However, he never forgot about what had occurred.</p><br/><p>Therefore, when he realized that he had a chance to drag others into the situation with him, the first person he thought about was Master God-Diviner.</p><br/><p>“Well,” he said, “we’ll need someone good at divination and fortune-telling. He’ll need to have a high cultivation base, too. That way, when danger comes, he can divine the details ahead of time and we can figure out the best way to protect ourselves. If I were going to pick someone, I would definitely pick Master God-Diviner from the Blood Stream Division!”</p><br/><p>“You’re absolutely right. We definitely need someone who can perform divination!” Bai Xiaochun was fully convinced. Grabbing Xu Baocai, he headed toward the Blood Stream Division to find Master God-Diviner.</p><br/><p>To their surprise, when they reached Master God-Diviner’s immortal's cave, they found him standing outside, his hands clasped behind his back, looking up into the sky. His bags were already packed and lined up next to him, and apparently, he had been waiting for them.</p><br/><p>“So, you’re finally here,” he said calmly. He seemed completely cool and collected, almost as if he belonged in a higher world.</p><br/><p>Looking a bit melancholy, he flicked his sleeve and said, “I long since divined that tribulation was coming my way. It was decreed by fate that I would leave the sect for a period of years, and that the tribulation would come during that time. Considering that someone from the Starry Sky Dao Polarity Sect came to visit, it was obvious that my tribulation was nigh.”</p><br/><p>With that, he looked over at Bai Xiaochun and Xu Baocai, his countenance completely otherworldly. “It doesn’t matter where you’re going. I will accompany you; it is my tribulation, and it has been decreed by fate!”</p><br/><p>Xu Baocai couldn’t help but gasp at the sight of Master God-Diviner, standing there with his robe fluttering in the wind, looking like some sort of transcendent being. The words he had just spoken were enough to shock just about everyone.</p><br/><p>Bai Xiaochun had a look of complete incredulity on his face as he said, “I... I can’t believe you actually divined that we were coming!”</p><br/><p>But then, he walked a few circles around Master God-Diviner, who suddenly recalled how terrifying Bai Xiaochun could be, and started to get a bit nervous.</p><br/><p>“Alright, Master Snortsnort,” Bai Xiaochun said, “answer me this. Can you divine where I'm going to hit you in a just a moment!?”</p><br/><p>“I--” Master God-Diviner’s face turned pale, and he instantly began to curse in his heart. He had complete and utter confidence that Bai Xiaochun would do just as he had said and launch a blow. Master God-Diviner suddenly shrank down, and instead of looking like a transcendent being, he reverted to his normal appearance. In fact, he even looked a bit devious.</p><br/><p>Smiling, he said, “I was just kidding around with you, Junior Patriarch! Actually, sir, Master Godwind came last night and told me to get ready for you to come, and that I had to do whatever you told me. I was so excited at the prospect of accompanying you, Junior Patriarch, that I couldn’t sleep the whole night. Therefore, I decided to just pack my bags and wait for you.”</p><br/><p>Bai Xiaochun laughed heartily and clapped Master God-Diviner on the shoulder. From the expression on his face, he clearly seemed very pleased with himself, and also was reveling in how much more intelligent he was than Master God-Diviner. As for Master God-Diviner, he appeared to be on the verge of crying. Worried that Bai Xiaochun would press the matter, he quickly offered a reminder.</p><br/><p>“Junior Patriarch, Xu Baocai and I won’t be enough. We need someone with us who's really good at fighting!”</p><br/><p>--</p><br/><p><strong>Translator:</strong> Deathblade.<strong> Chinese language consultant:</strong> ASI a.k.a. Beerblade. <strong>Editor:</strong> GNE. <strong>Memes:</strong> Logan. <strong>Meme archives:</strong> Tocsin. <strong>Transcendent Patrons:</strong> Daoist Elder N, BLE, ttre208. <strong>AWE Glossary</strong>. <strong>Xianxia-inspired T-shirts</strong>.</p><br/>\n</div>"}