{"title": "Chapter 389: People Can Live Like This?", "id": 389, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-389-people-can-live-like-this", "volume_title": "Volume 4", "body": "<h1>Chapter 389: People Can Live Like This?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 389: People Can Live Like This?</strong></p><br/><p>“Things here are so expensive!” That was Bai Xiaochun a year ago, when he first arrived in Sky City.</p><br/><p>“Hey, this looks pretty nice. It's a bit expensive but... ah, whatever, I’ll just grin and bear it!” That was Bai Xiaochun during his days profiting from the Ultra Fasting Aid Pills.</p><br/><p>“This looks great! I’ll take it!” That was Bai Xiaochun when the Azure Dragon Society was beginning to rise to prominence in the north district.</p><br/><p>And now....</p><br/><p>Currently, Bai Xiaochun was in the Magic Pavilion, looking at about a hundred magical items on display. Sounding very pleased with himself, he began to point at some of the objects. “This one. That one. Oh, that one too.... Those are the three I <em>don’t</em> want. I’ll take everything else!”</p><br/><p>The shop attendants were sweating, and their hearts pounding at having such a rich and important person to deal with.</p><br/><p>Bai Xiaochun really couldn’t help but live so extravagantly. Whether it was in terms of food, clothing, or anything else, he only got the best. If you added up the value of everything he was currently wearing, it would be valued at something around 7-800,000 merit points. In fact, if he wanted to be promoted to the rainbow district, it would be a very simple thing.</p><br/><p>But Bai Xiaochun couldn't bear to leave Sky City, and was convinced that life on the rainbow definitely wouldn’t be as nice. In fact, he had even made some inquiries, and had been informed that his suspicious were correct; nobody on the rainbow lived like he did now. Therefore, he had made up his mind to spend the rest of his time as a hostage in Sky City.</p><br/><p>“Only an idiot would go to that rainbow!” he thought, humming a little tune as he swaggered through the crowd. When people in the north district caught sight of him, expressions of both envy and respect could be seen in their eyes. He was beside himself with delight, and couldn't stop thinking about how outstanding he was. Everywhere he went, he ended up being the center of attention.</p><br/><p>The truth was, he didn’t really care much about the money, and didn’t even pay much attention to how much the Azure Dragon Society was saving up. As long as there were enough merit points to keep the Azure Dragon Society running, he didn’t care.</p><br/><p>However, there were a few aspects to his wonderful life that he wasn’t too pleased about. Because the Azure Dragon Society had expanded so quickly, their new recruits were a mix of good and bad. Other organizations within Sky City had sent people to infiltrate them, and that was especially true of the Celestial Sky Society.</p><br/><p>Furthermore, as the Azure Dragon Society expanded into the other three districts, rumors began to spread.</p><br/><p>Some rumors claimed that Bai Xiaochun was none other than the Apothecary Bai from the east district. Others focused on how wicked and violent the Azure Dragon Society was. The third type of common rumor focused on how harmful and addictive the Fantasy Pills supposedly were.</p><br/><p>In the end, virtually all of the rumors were about the Azure Dragon Society and Bai Xiaochun, like a wide net slowly being stretched out over the both of them.</p><br/><p>Master God-Diviner quickly caught on to this. Other than the first small group of cultivators who had made up the original Azure Dragon Society, few people ever saw him. He was Bai Xiaochun’s trusted adviser who lurked in the shadows, unseen by the public. When Bai Xiaochun got Master God-Diviner’s report about the rumors, he took it very seriously. He was well aware of the devious ways of the Celestial Sky Society, and could well imagine that their lack of action during the past few months was because they were waiting for the right moment to deliver a fatal blow.</p><br/><p>Considering how seriously Bai Xiaochun took the matter, Master God-Diviner did so as well. He quickly mobilized all of the Azure Dragon Society to try to counteract the rumors. Unfortunately, their work did little to quell the gossip, and in fact, it grew even worse.</p><br/><p>One evening, Bai Xiaochun was enjoying his evening meal, an exotic spread of the finest delicacies piled up as high as mountains... with two lovely female cultivators there to serve him.</p><br/><p>Master God-Diviner also sat at the table, providing his usual daily report regarding the affairs of the Azure Dragon Society. That was when the news came in....</p><br/><p>“Boss, the investigations we started running a few days ago identified one of the main sources of the rumors. We captured him and brought him in, and now we just need you to come decide what to do, boss!”</p><br/><p>Bai Xiaochun grunted an acknowledgement as he continued to munch on the chicken leg he had just picked up.</p><br/><p>Master God-Diviner smacked his hand down onto the table and gave a cold harrumph. “Bring him here! Let’s see who it is that had the gall to stir up trouble for us!”</p><br/><p>Before long, shrill shrieks of terror could be heard, drawing closer and closer to the room where Bai Xiaochun and Master God-Diviner were eating dinner.</p><br/><p>“Fellow Daoists of the Azure Dragon Society, spare me! I'm sorry... really, I'm truly sorry....” The shrieking grew louder and louder as two burly Azure Dragon Society cultivators dragged a young man with disheveled hair into the room.</p><br/><p>The young man didn’t struggle at all as the two burly cultivators forced him onto his knees. Not daring to look up, he continued to whimper and cry for mercy.</p><br/><p>“Spare me, Boss Azure Dragon. I’m sorry, sir, really, I won’t ever dare to do it again....</p><br/><p>“I was a fool to work for the Celestial Sky Society. Please, forgive me, Boss Azure Dragon....” The young man’s wails were truly inspiring of pity.</p><br/><p>However, as the young man prattled on, Bai Xiaochun stopped gnawing on the chicken leg and looked closer at him. Next to him, Master God-Diviner’s eyes widened.</p><br/><p>Then, the two of them exchanged a glance. Both of them had simultaneously realized that, unexpectedly... the young cultivator begging for mercy... was Xu Baocai!</p><br/><p>He had been beaten up, his nose swollen and his hair completely disheveled. His voice was hoarse, and he still hadn’t even dared to lift his head.</p><br/><p>A strange expression appeared on Bai Xiaochun’s face. Clearing his throat, he finished the chicken leg and then suddenly yelled, “Xu Baocai!!”</p><br/><p>Xu Baocai had been kneeling there with his head bowed. In response to Bai Xiaochun’s sudden outburst, he screamed and prepared to continue begging for mercy. However, the voice from just now seemed very familiar, and without even thinking about it, he looked up... to find an unfamiliar face behind the mounds of exquisite delicacies on the table.</p><br/><p>The other face at the table was not unfamiliar, though. Shocked, he realized that the second person sitting there was Master God-Diviner.</p><br/><p>Xu Baocai’s jaw dropped, and a blank expression filled his eyes. In that moment, the unfamiliar face suddenly blurred, and then... he was looking at a face that was anything but unfamiliar.</p><br/><p>Xu Baocai’s mind was spinning, and a look of complete and utter incredulity could be seen on his face.</p><br/><p>“Bai--” he shrieked. However, before he could finish his sentence, a chicken leg shot through the air and entered his mouth.</p><br/><p>Coughing dryly, Bai Xiaochun smiled and said, “How did you get yourself in such a bad situation, Xu Baocai? I mean, I thought I had it bad, but obviously, you have it <em>way </em>worse than me.”</p><br/><p>After seeing Bai Xiaochun’s reaction, the two men holding Xu Baocai released him. Aware that some things weren’t meant for their ears, they quickly departed.</p><br/><p>Xu Baocai’s eyes were completely bloodshot from crying. As he looked at Bai Xiaochun with his glittering magical treasures, his face glowing with health, his table full of spirit food, Xu Baocai began to pant. The combined value of all of that wasn't quite enough to rise to the yellow-robed disciple level, but it was very close. In sharp contrast, the income he made from selling information couldn’t reach that level in a sixty-year-cycle!</p><br/><p>Furthermore, the fact that Bai Xiaochun was now Boss Azure Dragon was completely mind-blowing, to the point where tears began to leak out of his eyes....</p><br/><p>In addition to all that, the two women waiting upon Bai Xiaochun weren’t actual people, they were ingeniously crafted puppets. Xu Baocai trembled at that. Such life-like puppets were astronomically expensive.</p><br/><p>Xu Baocai also couldn’t help but notice all of the glittering magical treasures that Master God-Diviner was wearing, and how his cultivation base fluctuations were clearly at a higher level than the last time they had met. Much to Xu Baocai’s bitterness, Master God-Diviner was obviously getting very close to Core Formation.</p><br/><p>By now, he was filled with deep and utter regret regarding his earlier decision to leave the group. As he thought back to the rough and bitter days he had experienced trying to gather and sell information, he almost couldn’t believe he had been so arrogant. Furthermore, how could he have missed the fact that Bai Xiaochun had become the boss of the Azure Dragon Society? The mere thought of how leaving Bai Xiaochun had caused him to lose out on this incredible opportunity left him extremely bitter.</p><br/><p>“Junior Patriarch, I really messed up....” he said, staring up piteously at Bai Xiaochun. As of this moment, he had decided in his heart that he would stick with Bai Xiaochun no matter what, even if he tried to drive him away.</p><br/><p>“Ah, whatever,” Bai Xiaochun said, waving his hand in grandly dismissive fashion. “I brought you here with me, didn’t I? Therefore, I'm responsible for you. You might have mercilessly dumped me early on, but I'm a magnanimous person. From now on, you stick with me, alright?”</p><br/><p>Tears of gratitude immediately began to pour down Xu Baocai’s face. As for Master God-Diviner, he cleared his throat awkwardly. After all, the words Bai Xiaochun had just uttered sounded quite familiar to him....</p><br/><p>“It’s getting late,” Bai Xiaochun said, “so why don’t you go rest up? Tomorrow we can reminisce a bit about old times.” Having finished eating, Bai Xiaochun waved his hand, and one of the serving girls came over to wipe his mouth with a handkerchief. Sighing, he stuck his chin up and looked at the girl, then said, “Let’s go. Carry me over to my pill concocting station.”</p><br/><p>The two serving girls picked Bai Xiaochun up and floated away. He didn't even need to walk at this point....</p><br/><p>Master God-Diviner quickly rose to his feet, clasped hands, and bowed. Then, in a voice which sounded well-rehearsed, said, “Farewell, m'lord....”</p><br/><p>This display left Xu Baocai shocked into stupefaction. How could he ever have imagined that life could be lived in such a way...?</p><br/><p>--</p><br/><p><strong>Translator:</strong> Deathblade.<strong> Chinese language consultant:</strong> ASI a.k.a. Beerblade. <strong>Editor:</strong> GNE. <strong>Memes:</strong> Logan. <strong>Meme archives:</strong> Tocsin. <strong>Transcendent Patrons:</strong> Daoist Elder N, BLE, ttre208. <strong>AWE Glossary</strong>. <strong>Xianxia-inspired T-shirts</strong>.</p><br/><p>--</p><br/><p>Hi everyone, I sometimes get requests for help from people interested in writing their own Chinese fantasy stories, so I made a video talking about how to make authentic Chinese names. There are also quite a few interesting tidbits of information about Chinese names within the video, even if you're not interested in creating names for a character. Check out the video here.</p><br/>\n</div>"}