{"title": "Chapter 392: Dao Protector Reunion", "id": 392, "volume": 4, "url": "http://boxnovel.org/a-will-eternal-chapter-392-dao-protector-reunion", "volume_title": "Volume 4", "body": "<h1>Chapter 392: Dao Protector Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 392: Dao Protector Reunion</strong></p><br/><p>In Big Fatty Zhang’s mind, this clan chief was a completely domineering figure, and he had never before seen him act this way or speak with such courtesy. In this part of the city, he was the kind of person who could bring a torrent of trouble to anyone who bothered him. Not only was he an orange-robed disciple, he was also the chief of an entire cultivator clan!</p><br/><p>Supposedly, this clan had once produced a cultivator who went all the way to the Nascent Soul stage, and although he had long since perished, he had left an impression on the cultivators in this part of the city that continued on down to this day.</p><br/><p>Big Fatty Zhang had started out very confident in being able to make a living with his spirit enhancement abilities, but after a string of failures, including one very important magical item belonging to this clan chief, he had ended up being imprisoned in their clan headquarters. Half a year had gone by, and Big Fatty Zhang felt like he was descending into insanity. He didn’t do anything other than perform spirit enhancements, and never got enough food to make him full. Were it not for his intense determination to keep living, he probably would have long since died from hunger and exhaustion.</p><br/><p>He was instinctively afraid of the clan chief already, but to hear the man speak his own name left Big Fatty Zhang trembling even harder than before. However, deep in his heart, he also felt anger, and that seeped into his eyes. If looks could kill, then the way he was staring at this clan chief right now would cause the man to explode violently.</p><br/><p>“Um... Fellow Daoist, please, just tell me. Are you Zhang Dahai?!” The clan chief’s anxiety was mounting, and he didn’t dare to even think about simply killing the young spirit enhancer to silence him. The Azure Dragon Society was too big and powerful, and the matter would definitely be found out eventually. If the boss found out he’d imprisoned Zhang Dahai, only to kill him later, the entire clan would be doomed.</p><br/><p>“Yeah, that’s right!” Big Fatty Zhang yelled. “I'm Zhang Dahai!!”</p><br/><p>The clan chief felt like his head was about to explode. He started shaking physically, and his pupils constricted into tiny dots. To see him reacting this way gave Big Fatty Zhang a very bad feeling. Suddenly feeling weak at the knees, he cursed inwardly and was just about to say something more when the clan chief unexpectedly spun to face the clan servant he had just knocked to the side.</p><br/><p>“You dumbass servant!” he shouted. “Don’t you remember how I told you this young man was an honored guest? You’re supposed to respect guests! You were instructed to take care of him, but instead, you used him to screw me over!!” With that, he raised his hand and slapped the servant again, sending him spinning off to the side once more.</p><br/><p>Blood sprayed out of the servant’s mouth, along with a bitter scream. Completely bewildered by why his master would suddenly act this way, he was just about to beg for mercy when the clan chief yelled, “Men, get this servant out of my sight! Cripple his cultivation base and throw him into the dungeon!”</p><br/><p>With that, the clan chief hurried over and helped Big Fatty Zhang to his feet. Smiling at him amiably, he tried to sound as apologetic as possible as he said, “Brother Zhang, all of this was a big mistake. If you want me to execute that servant, just say the word!</p><br/><p>“Ai, you must have had it so difficult these days, Brother Zhang.” Patting the dust off of the dumbfounded Big Fatty Zhang’s shoulders, the clan chief supported him by the arm as he led the way to the clan’s main hall.</p><br/><p>Raising his voice, he called out, “Prepare the best spirit food and the finest liquor as my apology to Brother Zhang!”</p><br/><p>Within moments, the entire clan was buzzing with activity. Although everyone was scratching their heads in confusion, none of them dared to question what was happening. An entire table of spirit food was prepared, and the clan chief himself waited upon Big Fatty Zhang. He even called over some female clan members to sit next to him.</p><br/><p>Big Fatty Zhang was more taken aback than ever at this sudden change of events. Never had the clan chief acted so politely, and he couldn’t fathom why he would be acting like this. However, after seeing all the spirit food on the table, he put the matter out of mind and immediately began wolfing it down.</p><br/><p>The clan chief stood off to one side, trembling inwardly, but keeping a smile plastered on his face as he continuously served new dishes. Furthermore, the beautiful female clan members continued to give Big Fatty Zhang meaningful glances. Although they were somewhat confused about why they had been told to do this, they didn’t hold back, and one of them even began to gently massage his neck. The others kept his drinking glass full, and even chatted with him in subdued tones.</p><br/><p>Although Big Fatty Zhang was feeling very nervous about what was going on, he simply gritted his teeth, threw caution to the wind, and enjoyed what was happening.</p><br/><p>Two hours later, Big Fatty Zhang had eaten and drunk to his heart’s content. Finally, he slapped the table and looked over at the clan chief with a glare.</p><br/><p>“Alright, just what is going on here!?”</p><br/><p>The clan chief couldn’t keep the bitterness out of his voice as he replied, “Brother Zhang, what happened before really was a big mistake on my part. Please, don't take it to heart.” Clasping his hands, he eyed the female clan members, then gritted his teeth and continued, “Brother Zhang, if you don’t despise them too much, why not just take these daughters of the clan as your own!?”</p><br/><p>The young women gasped, and opened their mouths to protest, but the clan chief’s fierce glare kept them silent.</p><br/><p>Big Fatty Zhang was scared speechless, and more nervous than ever. He simply couldn’t decide what to do. After a moment passed, he asked, “Why are you doing this...?”</p><br/><p>Considering how Big Fatty Zhang was pressing the issue, the clan chief didn’t dare to try to pull the wool over his eyes. Taking a deep breath, he said, “Brother Zhang, the boss of the Azure Dragon Society is scouring the city looking for you....”</p><br/><p>“Azure Dragon Society?” Big Fatty Zhang said, looking confused. He had been imprisoned back when the Azure Dragon Society was first starting to rise to prominence. Back then, there had been plenty of people who had never even heard of them, including Big Fatty Zhang.</p><br/><p>Considering the expression on Big Fatty Zhang’s face, the clan chief quickly explained how, during the past few months, the Azure Dragon Society had risen to the heights of glory. Big Fatty Zhang was now shaking harder than ever.</p><br/><p>“Somebody important like that is looking for me?” He grabbed a big flagon of alcohol and took a long drink.</p><br/><p>Before long, evening was falling. Peppering Big Fatty Zhang with nonstop apologies, the clan chief led him out and toward the north district to finally meet the illustrious Boss Azure Dragon.</p><br/><p>Along the way, Big Fatty Zhang heard a lot of people on the street talking about the Azure Dragon Society, and his nervousness grew. Soon, the moon hung high overhead, and the two of them were in the north district, right outside of a sprawling immortal's cave.</p><br/><p>It had eighteen enormous stone golems standing guard outside, along with countless cultivators. Inside, it was just barely possible to see rank upon rank of powerful cultivators patrolling about.</p><br/><p>Glittering spell formations surrounded the immortal's cave, and high in the sky above it was a magical projection of an azure dragon. It was extremely realistic, and a mere glance at it would be enough to fill anyone’s heart with shock.</p><br/><p>“Th-this... this is the Azure Dragon Society?” Big Fatty Zhang asked hesitantly. The clan chief nodded. Of course, this wasn’t the clan chief’s first time coming here, but he was still extremely nervous.</p><br/><p>Big Fatty Zhang was already having trouble breathing, and truly could not fathom why an important person like the boss of the Azure Dragon Society would possibly be looking for him. However, he had no choice but to follow the clan chief as he cautiously headed toward the main gate and reported in.</p><br/><p>Before he could even finish making an explanation, three beams of light shot out from inside the Azure Dragon Society. The person in the lead had a long orange robe on, and wore a beautiful headdress embroidered with an azure dragon. It was none other than Bai Xiaochun!</p><br/><p>He was festooned with various defensive jade jewelry, and glittered with dazzling magical treasures. He even had a halo hovering above his head, and couldn’t have looked more impressive. Flanking him were Xu Baocai and Master God-Diviner. By this point, Xu Baocai looked very different than he had when he'd first been reunited with Bai Xiaochun. His face had a healthy glow, and he was also covered with all sorts of glittering treasures. He looked like the picture of riches and honor.</p><br/><p>As soon as Bai Xiaochun appeared, the Azure Dragon Society was thrown into a hubbub. Cultivators and maidservants poured out from inside the immortal's cave, and the cultivators who were already outside trembled and dropped to their knees to kowtow.</p><br/><p>“Greetings, Boss!”</p><br/><p>“Greetings, Boss!!” Their cries created a rumbling like that of thunder. At that point, Big Fatty Zhang realized to his shock that the clan chief next to him had also dropped to his knees and was kowtowing.</p><br/><p>Big Fatty Zhang was the only one left standing, his eyes wide as he stared in shock at Master God-Diviner, Xu Baocai, and Bai Xiaochun.</p><br/><p>“Ninth Fatty!!” Big Fatty Zhang said, completely flabbergasted.</p><br/><p>“Eldest Brother!” Bai Xiaochun cried. Laughing loudly, he stepped forward and embraced Big Fatty Zhang. Big Fatty Zhang returned the embrace heartily, looking like he had just been reunited with family.</p><br/><p>When the clan chief from the little cultivator clan saw that, his heart shook with fear that Big Fatty Zhang would try to get revenge on him, and put a look of ultimate remorse and supplication on his face.</p><br/><p>Big Fatty Zhang was so excited that he didn’t even notice how the clan chief was looking at him. His laughter mingled with Bai Xiaochun’s as the two of them excitedly headed toward the immortal's cave.</p><br/><p>--</p><br/><p><strong>Translator:</strong> Deathblade. (Follow me on Twitter, Facebook, Instagram, Google+, YouTube, Pinterest)</p><br/><p><strong>Editor:</strong> GNE. <strong>Memes:</strong> Logan. <strong>Meme archives:</strong> Tocsin. <strong>Chinese language consultant:</strong> ASI a.k.a. Beerblade. <strong>Transcendent Patrons:</strong> Daoist Elder N, BLE, ttre208. <strong>AWE Glossary</strong>. <strong>Xianxia-inspired T-shirts</strong>.</p><br/><p>--</p><br/><p>Hey everyone, I had some T-shirt designs made for the Dao of Alchemy, the Dao of Alcohol, and the Dao of Swords. Check them out here. I don't make much off of the sale of the shirts, only a small percentage, which I put back into getting more designs done. Don't forget that the link to my shop is always in the credits of the chapters.</p><br/>\n</div>"}