{"title": "Chapter 401: Incredible Gall!", "id": 401, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-401-incredible-gall", "volume_title": "Volume 5", "body": "<h1>Chapter 401: Incredible Gall!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Song Que opened his eyes later that night to find himself lying in one of the rooms of the tavern. After looking around blankly for a moment, he realized that the events which had occurred earlier in the day were no hallucination. On the one hand, he almost felt like crying, but on the other hand, his rage burned hot.</p><br/><p>“How could this be happening...? I... I worked myself to the bone for an entire year. I skimped on food and clothing! I risked my life....</p><br/><p>“And Bai Xiaochun.... Why? Why?! WHY?!?!” By now, tears really were threatening to well up in Song Que’s eyes. As he thought back over his life, he realized that it had consisted of two main segments.</p><br/><p>The first part of his life had been flush with success. He had been a Chosen of the Blood Stream Sect, with unlimited prospects for the future. However, that part of his life had ended when he had met Bai Xiaochun, and then the second part began, a life of humiliation and suffering.</p><br/><p>“I wasn’t his equal in the Fallen Sword Abyss, in the Blood Stream Sect, or in the River-Defying Sect. And now the same thing is happening here in the Starry Sky Dao Polarity Sect. I... I don’t match up to him in any way!!” Enraged, Song Que decided that he simply didn’t have the face to stick around. Gritting his teeth, he walked out of the room and flew up into the air to leave.</p><br/><p>But then, with no warning whatsoever, a beam of light exploded out from Sky Quarter Rainbow and shot down toward him. Stunned, he quickly checked his merit points, and then his eyes widened.</p><br/><p>Sure enough, he had more than 2,000,000 merit points, which was far more than the required amount to become a yellow-robed disciple. In fact, it was enough that he didn’t need to personally go hand them in; the Starry Sky Dao Polarity Sect’s spell formation would automatically promote him to the rainbow district.</p><br/><p>Those were the rules in the Starry Sky Dao Polarity Sect.</p><br/><p>As the light descended, all of the cultivators in Sky City could see it, and it caused their eyes to shine with envy and hope. As for Song Que, mixed emotions could be seen on his face as he looked back down at the tavern below. Even he wasn’t sure exactly what he was thinking.</p><br/><p>He was the first among the River-Defying Sect group to become a yellow-robed disciple, and the first to be promoted to the rainbow district. However, in the end, he was actually the biggest loser.</p><br/><p>Even as he stewed in his thoughts, Bai Xiaochun emerged and looked up at him. Clearing his throat, he gave a farewell wave of his hand.</p><br/><p>“Focus on your cultivation when you get up there. Don’t lose face for your aunt and me! If you run into any problems, or if anyone bullies you, make sure to tell me. As your uncle, I'm family! Make sure to stay in touch....”</p><br/><p>Song Que’s mixed emotions got even more complicated upon hearing that. Glaring at Bai Xiaochun, he sighed as the beam of light surrounded him, and he vanished in the direction of the Sky Quarter Rainbow. After he left, the only thing that remained behind was a seven-colored glow that caused all onlookers’ hearts to surge with the desire to experience the same thing themselves.</p><br/><p>Having seen Song Que off, Bai Xiaochun returned to his room feeling wonderful about himself for his good deeds. He could only imagine the look on Song Junwan’s face after he returned and told her how he’d cared for her nephew.</p><br/><p>“Que’er sure is lucky to have an uncle like me!” Feeling very much like a magnanimous member of the Senior generation, he sat down cross-legged to work on his Frigid School Will-Evolving Incantation.</p><br/><p>Now that he was in the Frigid Adept level, his cultivation speed had increased, which led to a greater energy drainage. As such, he had to eat a shocking amount of spirit food every day.</p><br/><p>Since he had plenty of food to replenish his energy, he decided that in terms of his Undying Tendons, it was time to move on to his head. Bai Xiaochun felt that the fist was the most obvious weapon to use in combat, and at the moment, the speed and power of his left leg was already sufficient for use in a fight. As for what an opponent would be least on guard against, the head seemed the best choice.</p><br/><p>The thought of suddenly headbutting someone in the middle of a fight got him very excited, so it was with great enthusiasm that he set about refining the tendons in his head.</p><br/><p>Business in the tavern had stabilized, and fewer incidents occurred. The Azure Dragon Society’s profits had also evened out, and they were starting to build up some savings. By now, they were something of a unique organization within Sky City.</p><br/><p>They were very famous and powerful, and were essentially on equal footing with the Celestial Sky Society. They had far surpassed the old version of the Azure Dragon Society.</p><br/><p>However, as it became clear that the Live Forever Tavern was going to be a part of Sky City for a long time, the leaders in the Celestial Sky Society felt like they were going crazy. Sadly for them, the tavern was built on private property, and none of their plans to deal with the situation had any effect.</p><br/><p>Even if they tried to physically fight it out with Bai Xiaochun, they would lose, and besides, that would be a violation of sect rules. The only thing they could do was bring the matter to the attention of their superiors in the deva clan they were part of.</p><br/><p>It had been a year since the Celestial Sky Society’s income had begun to decline, and at long last, the elder in the clan who managed outside affairs took note. After reading the latest report from the Celestial Sky Society, he snorted coldly and said, “Trifling orange-robed disciple! What tremendous gall! Bully people if you want, but how dare you steal things that belong to our clan!”</p><br/><p>This particular elder was a Nascent Soul cultivator, and although he wasn’t one of the most important people in the clan, his words carried a lot of weight. After a bit of thought, he decided that it would be best not to do anything rashly, so he took out a jade slip to do a bit of research into why Bai Xiaochun had been given personal property.</p><br/><p>“The Sky Quarter peak lord traded it to him for the formula for Fantasy Pills. Well, I don’t care if this Bai Xiaochun has some connections to the Sky Quarter peak lord, I’m going to go teach him a lesson anyway!” Flicking his sleeve, he was just about issue some orders to go beat up Bai Xiaochun and take back the land when, all of a sudden, a piercing sound rose up outside of his room.</p><br/><p>Moments later, a violet jade slip flew through the spell formation protecting his room, then came to a stop right in front of him.</p><br/><p>The Nascent Soul elder’s face fell when he looked at the jade slip and saw the character “Heaven” inscribed on it. Trembling, he reached out with both hands to respectfully accept the jade slip, then scanned it with divine sense. As he did, his eyes widened.</p><br/><p>“What... what kind of backer does this Bai Xiaochun have...?” Violet light spilled out of the jade slip, and it vanished.</p><br/><p>When the jade slip was gone, the Nascent Soul elder's face returned to normal, although a bit of fear could still be seen lingering in his eyes. He immediately ceased any thoughts of issuing orders to the clan, and at the same time, felt his anger rising at the realization that he had almost done something which would have brought harm to the clan as a whole. Snorting coldly, he immediately sent people to bring the boss of the Celestial Sky Society up to the rainbow for a meeting.</p><br/><p>The boss of the Celestial Sky Society was a middle-aged man who, when he was told a Nascent Soul elder from the deva clan had summoned him, hurried over to the teleportation portal as quickly as possible. His initial assumption was that he would be given orders to go beat up Bai Xiaochun and take back the entrance to the necropolis. However, what he found was that the ashen-faced Nascent Soul elder had called him up to issue a tongue-lashing.</p><br/><p>“I can’t believe you annoyed me with such a small matter as this. Why didn’t you just take care of it yourself!?!?”</p><br/><p>The Nascent Soul elder was virtually yelling, causing the boss of the Celestial Sky Society to tremble with fear. After voicing numerous subservient words, he hurried away, almost on the verge of tears. Whenever he had to deal with Bai Xiaochun, it felt like no matter how much power he had on his side, he would always end up hitting his head against the wall.</p><br/><p>“What did he mean <em>small matter</em>...? Boss Azure Dragon has personal property! I’m just a Core Formation cultivator! How can an outer clan member like me deal with something like that?” Sighing continuously at the unfairness of it all, he walked through the clan courtyard, musing that since the clan didn’t seem to care about the matter, he probably shouldn’t do anything to provoke Bai Xiaochun.</p><br/><p>“Ah whatever. If this is how the clan wants things to be, then fine.” Just when he was about to teleport back to Sky City, he looked over and saw a young man in an extravagant yellow robe, walking along with a group of other cultivators.</p><br/><p>This young man had a high place in the clan, and the arrogant expression on his face fit him perfectly because of it. The boss of the Celestial Sky Society instantly recognized him as a clan Chosen, Li Yuansheng, who had reached Core Formation in less than a hundred years. A few years ago, when he was still in Foundation Establishment, he had come to Sky City to collect some merit points from the Celestial Sky Society, which was why the boss remembered him so clearly. The boss immediately clasped hands and called out a greeting as the group passed by.</p><br/><p>Li Yuansheng stopped and looked over. Recalling their last meeting, he said, “What brings you here?”</p><br/><p>The boss of the Celestial Sky Society felt his heart pounding with excitement. Immediately, he launched into a very vivid account of the frustrating matter of Boss Azure Dragon.</p><br/><p>Li Yuansheng’s friends immediately began to make some teasing comments.</p><br/><p>“Brother Li, does your clan really just let people steal their business!?”</p><br/><p>“How amusing, the boss of the Azure Dragon Society is a mere core Formation cultivator, and yet he dares to steal from the tiger’s mouth?”</p><br/><p>The boss of the Celestial Sky Society clasped hands and bowed deeply, then said, “Young Lord, could you please take charge of the situation?!”</p><br/><p>Li Yuansheng’s eyes flickered, especially because of the words just spoken by the other cultivators. Snorting coldly, he said, “Well, I’m bored today anyway, so I might as well go check the situation out myself. I can't believe this guy has such incredible gall!”</p><br/>\n</div>"}