{"title": "Chapter 407: Hall of... of Devil Slayers?", "id": 407, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-407-hall-of-of-devil-slayers", "volume_title": "Volume 5", "body": "<h1>Chapter 407: Hall of... of Devil Slayers?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A thoughtful expression could be seen on Bai Xiaochun’s face as he watched Song Que hurrying off. Before long, though, a slight smile could be seen.</p><br/><p>By this point, Bai Xiaochun didn’t view Song Que as being any sort of rival. In fact, he actually believed Song Que’s life to be a bit rough. He went around all the time trying to look tough, surrounded by a murderous aura, constantly looking to pick fights.</p><br/><p>Bai Xiaochun wouldn’t forget how he had come to offer these warnings. After some thought, he came to the conclusion that, based on what Song Que had told him, it was likely that Li Yuansheng was looking for an opportunity to cause problems for him because of the matters with the Celestial Sky Society.</p><br/><p>Unfortunately, knowing the identity of the person targeting him didn’t really provide much help. After all, it would be impossible to prepare for all of the ways Li Yuansheng could get to him in the Starry Sky Dao Polarity Sect. The only thing he could do was be as cautious as possible.</p><br/><p>“If we were in the River-Defying Sect, I’d definitely show him a thing or two!” Bai Xiaochun let out a harrumph and proceeded to ponder how he would handle the situation if he were in Li Yuansheng’s shoes. After a moment, his eyes suddenly lit up.</p><br/><p>“The Hall Selection Forum!!” he thought, a tremor passing through him. The more he thought about it, the grimmer his expression grew, and the more certain he was that the Hall Selection Forum was where Li Yuansheng would try to make a move on him. However, Bai Xiaochun couldn't think of any way to counter such a move. At one point, he even considered trying to reach out to the Sky Quarter peak lord.</p><br/><p>Unfortunately, without being expressly summoned by the peak lord, it was impossible to gain access to the inner ring. Even a simple visit to offer greetings had to be approved by the peak lord, and despite going on several occasions to do just that, Bai Xiaochun was never allowed to enter, and was forced to return gloomily to his immortal’s cave.</p><br/><p>He basically had no options at the moment, so he simply decided to wait it out until his Dao protectors arrived. Soon, Master God-Diviner, Big Fatty Zhang, and Chen Manyao all paid the requisite number of merit points to get their promotions.</p><br/><p>Xu Baocai was the only one who stayed behind. After all, business in the tavern still had to be managed. The tavern itself was the main reason everyone had been able to get up to the rainbow district to begin with, and someone had to stay behind to run it, at least for a while.</p><br/><p>After being received by the disciples at the welcoming platform, the Dao protectors got their clothing and identity medallions and then went to find Bai Xiaochun. It was a happy reunion, even for Chen Manyao. After working closely with Bai Xiaochun and everyone else, and gaining the approval of Bai Xiaochun himself, she was now considered to be part of their circle of friends.</p><br/><p>After the initial reunion was over, they all sat down in Bai Xiaochun’s immortal's cave. First, the Dao protectors explained how things had gone in the tavern after he left, and then he told them about everything that had happened to him. When he was finished, he said, “And so, I need all of your help to figure out what to do about the Hall Selection Forum.”</p><br/><p>Master God-Diviner and Big Fatty Zhang frowned in thought, but unfortunately, they were new here, and couldn’t think of a single countermeasure to take. Eventually, they looked over at Chen Manyao.</p><br/><p>Bai Xiaochun did the same thing. Chen Manyao was from the Wildlands, and knew other agents in the Starry Sky Dao Polarity Sect, so she was obviously the best-equipped to provide a solution.</p><br/><p>Chen Manyao smiled. “Don’t worry, Xiaochun. I should be able to take care of the situation. Just tell me which hall you want to join.”</p><br/><p>Bai Xiaochun was so happy that he almost couldn’t hold back from leaping forward and hugging her. Laughing heartily, he said, “You’re so awesome, Yao’er! Alright. I want to join the Hall of Defenders!”</p><br/><p>Chen Manyao’s face turned a bit red, and after glaring at Bai Xiaochun for a moment, she pulled out a jade slip to make contact with her comrades in the Starry Sky Dao Polarity Sect. After a moment passed, she gave Bai Xiaochun a smile of confirmation, which got him even more excited. At that point, Big Fatty Zhang said that he wanted to join the Hall of Spirit Enhancement, and as for Master God-Diviner, he wanted to get into the Hall of Magical Techniques.</p><br/><p>Later, the Dao protectors left. At long last, Bai Xiaochun didn’t feel completely lonely any more. In fact, his cultivation speed even seemed to pick up, and before he knew it, three months had passed.</p><br/><p>Including his first month, that meant four months had gone by, and it was time for Sky Quarter Rainbow’s yearly Hall Selection Forum.</p><br/><p>That morning at dawn, the sound of tolling bells filled Sky Quarter Rainbow, and all of the disciples who had been promoted to the yellow robe level in the past year all made their way out of their immortal's caves, looking both solemn and apprehensive.</p><br/><p>All of them knew that their fates for the following years would be determined on this day. Whichever hall they ended up joining would determine how they grew in the years to come, and would also have a huge influence on how long they managed to stay alive. Because of that, all of them were completely on edge.</p><br/><p>Of course, the rules of the Starry Sky Dao Polarity Sect were strict. The ten halls selected who would join them, not the other way around. Because the new disciples had absolutely no say in the matter, they could only wait nervously until the announcements were made.</p><br/><p>Bai Xiaochun had long since straightened his clothing in preparation for the event. As soon as the bells began to toll, he strolled out of his immortal's cave glowing with excitement, visualizing what it would be like to join the Hall of Defenders.</p><br/><p>Over the past few months, he had spent some merit points to get a bit more detailed information about the various halls, and knew that the Hall of Defenders could only be described as wonderful. They were tasked with defending Sky Quarter Rainbow as a whole. However, considering that Sky Quarter Rainbow was in the middle of the Starry Sky Dao Polarity Sect, the chances of someone invading the place were virtually zero. Because of that, the cultivators who were members of the Hall of the Defenders tended to enforce sect rules within the rainbow district itself.</p><br/><p>They were a very impressive group, similar to the Hall of Justice back in the Spirit Stream Sect.</p><br/><p>Bai Xiaochun was very excited about the prospect, and was sure that as a member of the Hall of Defenders, he would surely become very famous on Sky Quarter Rainbow.</p><br/><p>It didn’t take long before more than 200 newly promoted yellow-robed disciples were hurrying toward the inner ring.</p><br/><p>For most disciples, the Hall Selection Forum was the only time they would ever be able to visit the inner ring, where a huge square existed atop the seven-colored mountain there.</p><br/><p>Of course, this was Bai Xiaochun’s second time to the inner ring, so things were somewhat familiar to him. Upon entering the square, he caught sight of Big Fatty Zhang, Master God-Diviner, Chen Manyao, and even Song Que.</p><br/><p>Although he was able to catch their eyes, they were separated by enough distance that it wasn’t possible to exchange words. The entire square was filled with a very somber air. Before long, the sound of bells faded away, and silence filled the air for a moment before ten beams of light appeared out of nowhere and shot down toward the ground.</p><br/><p>Instantly, crushing pressure filled the area, causing the faces of Bai Xiaochun and all the other disciples to flicker; it felt as if their bodies were being pushed down into the ground. At the same time, ten cultivators appeared.</p><br/><p>Some were men, some women, some seemed old, some did not, but all were Nascent Soul cultivators. Three of the women were beautiful, and yet looked very stoic. Somehow, such expressions only made them seem more attractive.</p><br/><p>As for the others, some had faces wrinkled with age, whereas others looked like young men or women. Some appeared to be kind and amiable, while others were surrounded by murderous auras, and seemed like very vicious characters.</p><br/><p>“Greetings, Hallmasters!” It was hard to say who spoke first, but soon, all of the gathered disciples were bowing their heads and calling out greetings to the ten Nascent Soul cultivators who were the hallmasters of Sky Quarter.</p><br/><p>Bai Xiaochun did the same, peering out of the corner of his eye at the ten Nascent Soul cultivators and wondering which one was the hallmaster of the Hall of Defenders. At the same time, he couldn’t help but gasp at the power of the Starry Sky Dao Polarity Sect. Even Sky Quarter Rainbow alone had enough power to dominate any sect in the Middle Reaches, assuming that sect didn’t have a deva.</p><br/><p>“And they have three other rainbows just like Sky Quarter,” he thought, shaken. “There’s also Starry Quarter, Polarity Quarter, and Dao Quarter....”</p><br/><p>At that point, one of the ten Nascent Soul cultivators said, “And now, you will come to join the hallmaster who calls your name.”</p><br/><p>“Chen Biao!”</p><br/><p>“Xu Ke!”</p><br/><p>“Zhou Songli!”</p><br/><p>As the names of the disciples were called out, they respectfully hurried over to the side of whichever Nascent Soul cultivator had called them.</p><br/><p>“Song Que!” said one of the fierce-looking Nascent Soul cultivators. Song Que took a deep breath and flew over. Eventually, Chen Manyao was called by one of the beautiful women, and by some lucky chance, Big Fatty Zhang was called by one of the other beauties.</p><br/><p>Master God-Diviner wasn’t sure if luck was with him when he got called by an icy-faced young man. As the crowd began to thin, Bai Xiaochun’s nervousness grew, and he continued to flash glances in the direction of the Nascent Soul cultivators, hoping to remind them of his presence.</p><br/><p>Unfortunately, the Nascent Soul Daoist masters all had completely expressionless faces, and none of them were even looking in his direction. Furthermore, Bai Xiaochun soon realized that, unexpectedly, there was one among the Nascent Soul cultivators who hadn’t said a single word so far.</p><br/><p>He was a kindly-faced old man, who looked over the dwindling group of cultivators with a wide smile that did nothing to reveal what he was thinking.</p><br/><p>It didn’t take long before the group of more than 200 had been whittled down to less than a dozen or so. Bai Xiaochun stood there, blinking, wondering what exactly was happening. Then he looked over at Chen Manyao and realized that she was wearing a look of shock, at which point, his heart began to sink.</p><br/><p>By now, the nine Nascent Soul Daoist masters weren’t saying anything else, and in fact, were all looking at the kindly-faced old man. The beautiful Nascent Soul cultivator who had selected Big Fatty Zhang smiled and said, “Brother Feng, we're finished with our selections.”</p><br/><p>The old man laughed heartily and then swished his sleeve.</p><br/><p>“Alright. If you don’t want this group, then I’ll take them.” He waved his finger, causing seven-colored light to spread out beneath the feet of Bai Xiaochun and the others and carry them over to his side.</p><br/><p>“Very well then,” he said with a smile. “I’ll take my leave now.” The other Nascent Soul cultivators called out farewell as he carried Bai Xiaochun and the others off into the distance.</p><br/><p>Bai Xiaochun’s heart was pounding as he looked around at the other cultivators and then nervously asked, “Senior, which hall are we?”</p><br/><p>The old man turned and looked back at him, and the kindness that was on his face before was now nowhere to be seen. His smile was sinister, and he suddenly possessed a powerful, murderous aura that caused Bai Xiaochun to gasp. “Congratulations on being selected by the Hall of Devil Slayers!”</p><br/><p>“The Hall... of Devil Slayers...?” Bai Xiaochun said, his eyes widening in terror. Never could he have imagined that after calling upon the help of Chen Manyao, he would actually be taken away by the Hall of Devil Slayers. Instantly, rage boiled up inside of him.</p><br/><p>The other disciples around him had a variety of expressions on their faces, and none of them looked happy.</p><br/><p>“Throughout the history of Sky Quarter Rainbow, the most dangerous hall of all is the Hall of Devil Slayers. They also have the highest casualty rate!”</p><br/><p>“Heavens.... I heard that a few decades ago, the Hall of Devil Slayers went on a mission outside the sect, and thousands of disciples died in the briefest of moments....”</p><br/><p>“I heard that the disciples in the Hall of Devil Slayers all get sent out on missions to assassinate enemies, and can get killed at the drop of a hat....”</p><br/><p>“Noooo....”</p><br/>\n</div>"}