{"title": "Chapter 417: The Ravine of Endless Mountains", "id": 417, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-417-the-ravine-of-endless-mountains", "volume_title": "Volume 5", "body": "<h1>Chapter 417: The Ravine of Endless Mountains</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun was currently in line at the teleportation portal which led to Myriad Star Rainbow. Since he had time to spare, he looked up at the three sections of the rainbow up above. Recently, he had spent a bit of time getting more familiar with the Starry Sky Dao Polarity Superstars arrangement.</p><br/><p>Those who qualified to be listed as stars on that rainbow were true Chosen who received special treatment from the sect, and access to resources far beyond what was available to ordinary disciples. There were even special items that could only be purchased on Myriad Star Rainbow, and only by those on the list.</p><br/><p>Bai Xiaochun had recently learned that the trials by fire in the seven layers of the rainbow were all very dangerous, and that every year, disciples ended up dying within them.</p><br/><p>“Those trials by fire seem really dangerous,” Bai Xiaochun thought. “I really don’t get why so many people want to participate in all that fighting and stuff.”</p><br/><p>And yet, there was never a shortage of disciples willing to take on the challenge.</p><br/><p>One of the reasons had to do with the incredible rewards available once someone got onto the list. Of course, there were also prizes that were awarded for simply getting on the list to begin with, such as merit points and various rare items.</p><br/><p>Bai Xiaochun looked at the different colors of the rainbow, and eventually his eyes came to rest on the top level, the violet one, and the eight stars which rested there. Those stars were the highest of them all, and when Bai Xiaochun realized that everyone seemed to be staring at them, he couldn’t help but be skeptical.</p><br/><p>“Let’s see who’s in first place....” He looked up at the highest star in the violet section of the rainbow, and a moment later, a name appeared in his mind.</p><br/><p>“Zhao Tianjiao!” Bai Xiaochun’s eyes went wide. He had never seen someone with a name like this before, which literally meant “Chosen.” It was a very domineering name, and yet, Bai Xiaochun couldn’t help but tartly mutter to himself, “Not as good as my name....”</p><br/><p>Next, he looked at the second star on the rainbow, and moments later, another name appeared in his mind. This one was obviously a Daoist name.</p><br/><p>“Heretic!” Bai Xiaochun gasped, and yet again, felt a bit annoyed. “What kind of a crappy name is that? Heretic schmeretic….”</p><br/><p>With that, he moved on to the third name.</p><br/><p>“Chen Yueshan....” It was obvious at a glance that this name belonged to a female cultivator. Just as Bai Xiaochun was about to continue down the list, people started pushing him from behind. The area around the Myriad Star Rainbow teleportation portal was usually quite crowded, so people weren’t happy about someone blocking the way.</p><br/><p>Looking away from the rainbow, Bai Xiaochun proceeded along in line until he reached the teleportation portal. After vanishing, he reappeared on Myriad Star Rainbow.</p><br/><p>This was his first time here, but he had come well-prepared. He had acquired a map of the place in the Hall of Devil Slayers, and after confirming his location on it, he flew up into the air.</p><br/><p>There were cultivators everywhere, most of them having come from the third level rainbows either to practice cultivation or to attempt to get into the Starry Sky Dao Polarity Superstars.</p><br/><p>“This place is pretty busy!” Bai Xiaochun thought in surprise. It was a lot louder here than on Sky Quarter Rainbow. Bai Xiaochun even spotted some vendor stalls which had been set up by disciples to peddle various items. Such stalls seemed very popular.</p><br/><p>As for the locations set aside for special types of cultivation, almost all of them had lines of disciples waiting to enter. Some of those lines had hundreds of disciples in them, which was definitely something new to Bai Xiaochun. As he made his way along, he eventually reached the special location set aside for cultivating the Living Mountain Incantation.</p><br/><p>It was a desolate, weed-choked ravine, next to the entrance of which was a greenish-black boulder. Sitting on top of the boulder was a gaunt middle-aged man with a jaw that jutted out like an ape's. His skin was so tan it was almost black, and from a distance, he almost looked like a monkey wearing human clothing.</p><br/><p>Bai Xiaochun blinked a few times, and couldn’t help but stare a bit at the odd-looking man. Clearly, he was a Core Formation cultivator, and yet there was something about him that made him seem extremely powerful, something that Bai Xiaochun couldn't quite put his finger on. It was almost as if there was some terrifying energy in him that was somehow impossible to release into the open.</p><br/><p>And yet, Bai Xiaochun had the distinct premonition that if this man actually attacked someone, that power would indeed erupt, and when it did, it might even be enough to fight someone in the Nascent Soul stage.</p><br/><p>“The Starry Sky Dao Polarity Sect really is a terrifying place....” he thought. “Even the random guards are completely spine-tingling.” At that point, Bai Xiaochun looked around and realized how cold and desolate this place was. Nobody was lined up to get in, and after a moment, he even wondered if he had somehow lost his way and was in the wrong place. However, after double-checking his map, he was certain that he was in the right place.</p><br/><p>As he stood there, the man on the boulder suddenly opened his eyes and spoke in a grating, ear-piercing voice. “The Valley of Floating Flowers is on the right. The Peak of Green Cliffs is to the left. The Pool of Emerald Waters is behind me. And up ahead is the Crag of Martial Sealing.”</p><br/><p>“Um, thanks, Elder Brother,” Bai Xiaochun replied, “but I'm actually on my way to the Ravine of Endless Mountains.”</p><br/><p>“Really?” the man said, looking a bit shocked. After looking Bai Xiaochun up and down, his eyes suddenly sparkled.</p><br/><p>“You cultivate the Living Mountain Incantation?”</p><br/><p>Bai Xiaochun immediately nodded.</p><br/><p>The man chuckled, and the look in his eyes softened. With that, he performed an incantation gesture with his right hand and then waved his finger at the adjacent ravine. Instantly, the ravine trembled, and then began to ripple and distort. Suddenly, an enormous stone hand stretched out from the valley, over 30 meters wide. Apparently, the hand was waiting for Bai Xiaochun to step onto it.</p><br/><p>The man looked back at Bai Xiaochun and said, “It’s been a long time since anyone cultivated the Living Mountain Incantation.</p><br/><p>“It is not a technique, but rather, a divine ability focused on becoming a human mountain, and thus having access to unlimited power. It is divided into four levels, those levels being the Mortal Mountain, the Earth Mountain, the Heaven Mountain, and finally, the ultimate level... the Immortal Mountain!</p><br/><p>“The key to this type of cultivation is the mountain meld. After all, mountains have spirits, and in this ravine you will find countless mountains. Find one with whom you are connected by destiny, and then gain enlightenment of that mountain’s spirit. If you succeed, you can unleash the power of the Living Mountain!” The man waved his finger, and a deafening roar filled Bai Xiaochun’s ears as more information about the Living Mountain Incantation poured into his mind.</p><br/><p>Expression somber, Bai Xiaochun clasped hands and bowed deeply to the man.</p><br/><p>“Many thanks for your help, Elder Brother. Might I request to know your honored name?”</p><br/><p>“You can just call me... Stonemountain!”</p><br/><p>Stonemountain smiled faintly and then closed his eyes and went back to meditating, looking very much like a stone monkey.</p><br/><p>Bai Xiaochun once again bowed, then took a deep breath and hopped onto the huge stone hand which had stretched out from inside the ravine. As soon as he did, the hand closed into a fist around him, then pulled him into the ravine. Moments later, the hand began to fade away, and as it did, the ripples that had appeared moments ago faded away, and the ravine looked as desolate as it always had.</p><br/><p>Bai Xiaochun’s vision swam a bit, and rumbling echoed in his ears. However, all of that soon faded away, and when he could see clearly, he realized to his shock that he was in a completely unfamiliar world.</p><br/><p>The sky was a bluish-green color, and down below... was a boundless sea of clouds, with countless mountain peaks poking up through them. To see so many mountain peaks stretching as far as the eye could see was indeed very shocking.</p><br/><p>“The Ravine of Endless Mountains....” he thought, shaken. After flying around a bit, he did just as Stonemountain had said and began to search for a mountain that was connected to him by destiny.</p><br/><p>“How am I supposed to know if we're connected by destiny, though?” he murmured to himself, feeling a bit confused. “Do I just find a mountain that looks good to me?”</p><br/><p>As he flew along over the sea of clouds, he looked this way and that for an eye-catching mountain.</p><br/><p>As Bai Xiaochun flew along through the Ravine of Endless Mountains, outside on Sky Quarter Rainbow, Song Que was sitting cross-legged in his immortal's cave, his eyes shining brightly.</p><br/><p>“Finally.... I've finally reached the moment of Core Formation!” Currently, he had numerous spell formations set up around him, and had already notified his hall of what he was doing. He had also procured some medicinal pills designed specifically for Core Formation. Popping one into his mouth, he closed his eyes and prepared to make his breakthrough.</p><br/><p>Half a month after Song Que, Chen Manyao also began to break through to Core Formation!</p><br/><p>Two days after that, Master God-Diviner... also started to make his breakthrough!</p><br/><p>Other than Big Fatty Zhang and Xu Baocai, all of the Dao protectors who had followed Bai Xiaochun to the Starry Sky Dao Polarity Sect were making their attempts to break through to Core Formation.</p><br/><p>The three in that group had already made extensive preparations. Combined with the fact that the Starry Sky Dao Polarity Sect was a riversource sect with abundant spiritual energy, it made it much easier for them to attempt their breakthroughs. As for Chen Manyao and Master God-Diviner, the vast amount of merit points at the disposal of the Azure Dragon Society also had something to do with it.</p><br/><p>As for Big Fatty Zhang, he couldn't come close to the others in terms of preparations, but Bai Xiaochun had been sure to take care of him, and had set aside plenty of merit points for him to use. As such, his cultivation base had now reached the great circle of Foundation Establishment.</p><br/><p>That meant that for him, Core Formation was just around the corner!</p><br/>\n</div>"}