{"title": "Chapter 428: Dont Try To Convince Me!", "id": 428, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-428-dont-try-to-convince-me", "volume_title": "Volume 5", "body": "<h1>Chapter 428: Dont Try To Convince Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There was a whole crowd of people outside who were spending merit points to watch Bai Xiaochun in the cyan trial by fire.</p><br/><p>When they saw him screaming in the face of the endless sea of souls, strange expressions appeared on everyone’s faces. This trial by fire was a bit different than the ones before it; it tested one's ability to endure the attacks of the vengeful souls, and for how long.</p><br/><p>Everyone had assumed that, considering Bai Xiaochun’s extraordinary performances before, he would surely pass this trial in some amazing way. But then they saw him fleeing in fear, leading first to shock on their part, and then sighing.</p><br/><p>“Well, it’s no wonder Bai Xiaochun’s momentum faltered here. After all, this trial by fire is connected to the Wildlands, and is designed to prepare us disciples for what exists out there. Even Eldest Brother Zhao Tianjiao had trouble on his first run. It wasn’t until later that he managed to take 1st place.”</p><br/><p>“Exactly. You know, according to a story I heard, all of the souls in the cyan trial by fire were actually brought here from the Wildlands....”</p><br/><p>“The fact that Bai Xiaochun got all the way into the top 500 on his first attempt at the Starry Sky Dao Polarity Superstars trials is extraordinary. It looks to me like he’s ranked at over 490! Now that he's in the top 500, he’s not a Chosen of the Halls, he’s a Chosen of the Quarters! That's a completely different status altogether!”</p><br/><p>Even as the discussions raged, Bai Xiaochun appeared in a white column of light at the main gate of the Starry Sky Dao Polarity Superstars trials by fire. As soon as he appeared, countless disciples looked over, gazes filled with envy and other mixed emotions. To see so many people looking at him with open jealousy caused Bai Xiaochun first to blink a few times, and then begin to calm down from his frenzy of moments ago.</p><br/><p>“They were all watching me?” he thought, starting to get excited. Looking up at the rankings, he could see his star in the green section, in the top 500.</p><br/><p>“No wonder everyone was watching me....” he thought, clearing his throat at the thought of how awesome he was. Puffing his chest out a bit, he tried to look as much like a Chosen as possible.</p><br/><p>“They were all watching me. I really am too outstanding. Ai. I should keep a lower profile. I am a hostage after all.” Feeling incredibly wonderful at being the center of so much attention, and completely forgetting about his hectic final moments in the cyan trial by fire, he stuck his chin up, swished his sleeve, and strutted away.</p><br/><p>As he walked along, the eyes of the disciples who looked in his direction shone with respect. He could have simply flown along, but considering his new reputation as a Chosen in the top 500 of the Starry Sky Dao Polarity Superstars, he realized that he shouldn’t be so arrogant. Instead, he decided to give as many fellow disciples as possible a chance to meet him and offer formal greetings up close.</p><br/><p>“Yet again I think of the bigger picture,” he thought proudly. Everyone was quick to make way for him, leaving Bai Xiaochun feeling more pleased than ever. In fact, he even took the opportunity to wave to the nearby disciples.</p><br/><p>“Hello everyone!” Bai Xiaochun really felt like he was at the pinnacle of existence, with the only disappointing thing being that only a few hundred people were present.</p><br/><p>“If only there were a few more people around,” he thought. Sighing, he strolled away through the crowds. One of the members of that very crowd was a young woman who was currently watching Bai Xiaochun walk off.</p><br/><p>She wore a long green robe, and was the type of cold person that no one was willing to get close to. There was even a sinister, frigid aura around her that made people standing in the area feel uncomfortable and unsettled.</p><br/><p>She had been watching Bai Xiaochun closely the entire time, and when he had started acting proud moments ago, she had chuckled and placed her hand over her mouth. Right now, her eyes were glittering with a very strange light.</p><br/><p>Looking up at the entrance to the Starry Sky Dao Polarity Superstars trials, she murmured, “They do seem pretty interesting.”</p><br/><p>That young woman was none other than Gongsun Wan’er!</p><br/><p>She had parted ways with Bai Xiaochun almost as soon as they had arrived in the Starry Sky Dao Polarity Sect. She had long since been promoted to Sky Quarter Rainbow, and was now a green-robed disciple. As of this moment, her eyes were sparkling with profound light; clearly, she was very interested in the Starry Sky Dao Polarity Superstars.</p><br/><p>Bai Xiaochun slowly made his way along Myriad Star Rainbow, clearing his throat to draw the attention of any groups of disciples he encountered. When he got back to Sky Quarter Rainbow, voices assailed him the moment he began to materialize in the teleportation portal.</p><br/><p>“It’s Bai Xiaochun!”</p><br/><p>“He ranks at over 490 in the Starry Sky Dao Polarity Superstars. Bai Xiaochun!”</p><br/><p>After the effects of the teleportation faded away, he saw a large group of people gathered outside, their eyes shining with admiration and fervor.</p><br/><p>The exclamations being uttered got Bai Xiaochun even more excited than he had been. Right now, he felt more like a Chosen than he ever had. Smiling faintly, he walked out, waving to the crowd.</p><br/><p>“Hello, all of you!</p><br/><p>“Keep up the good work, everyone.</p><br/><p>“This isn’t my honor and glory, Fellow Daoists, it's honor and glory for Sky Quarter!”</p><br/><p>Every wave of his hand caused more oohs and ahs to be heard. However, what was somewhat confusing to the cultivators near the teleportation portal was that Bai Xiaochun was simply standing there. Soon, strange expressions could be seen on their faces.</p><br/><p>“Why isn't Bai Xiaochun leaving?”</p><br/><p>“There’s something strange about his facial expression. Why does he seem so different from all the other Chosen I've seen...?” When Bai Xiaochun saw their expressions, and realized what was happening, he waved his hand a final time and then left.</p><br/><p>The entire way back to his immortal's cave, he walked very slowly, taking the time to smile and nod to everyone he encountered. Quite a few people had been paying attention to his run through the trials, but the Starry Sky Dao Polarity Sect was a vast organization, and there were still plenty of people who hadn’t heard about what happened. As for those people, they returned his smiles with blank stares.</p><br/><p>Bai Xiaochun wasn’t too happy about that, and actually wished he had someone to go spread word about him. After all, considering how awesome and respectable he was, it wouldn’t be appropriate for him to go praising himself.</p><br/><p>“This won’t work! Word spreads far too slowly in the Starry Sky Dao Polarity Sect. I need to think of a method to remedy this.” After arriving back at his immortal's cave, he thought back to the matter of his personal glory, and how to get more people to learn of it.</p><br/><p>“I brought Xu Baocai along, not just to get information, but to spread it. Leaving him down in Sky City is a big waste.” With that thought in mind, he sent a message to Xu Baocai telling him to handle matters in the tavern and then get promoted as quickly as possible to come help.</p><br/><p>Xu Baocai was thrilled at the prospect of his talents finally being used to the fullest extent possible. After thinking about the matter for a short while, he decided that he needed to convince Bai Xiaochun of how important he was, and quickly composed a response.</p><br/><p>“Junior patriarch, I have an idea. As you know, I’m very familiar with this sort of thing, and based on my understanding of the situation, I would bet that people are going to come offer formal greetings soon. Remember, when they show up, you have to pretend that you’re not happy with your performance, and emphasize that you plan to go challenge the trials again. The more you do that, the more people will be convinced of your future potential. And don't forget, <em>do not</em> try to show off in front of the people who come to visit.”</p><br/><p>After receiving Xu Baocai’s message, Bai Xiaochun was convinced that it was great advice. Therefore, after a bit of thought, he opened the door of his immortal's cave and stood there to keep an eye out for any passersby or visitors.</p><br/><p>“Ai, what a headache. Based on what Xu Baocai said, there will probably be a lot of people coming to offer formal greetings soon.” Sighing, he pulled his magical mirror out of his bag of holding and looked himself over. Then he put it away and clasped his hands behind his back, putting a somber, thoughtful expression onto his face. He even seemed to be seeking enlightenment as he stared up into the sky.</p><br/><p>Before long, two beams of light appeared, which were none other than Master God-Diviner and Big Fatty Zhang. In the short time which had passed recently, Big Fatty Zhang was already in the great circle of Foundation Establishment, and was surrounded by some faint, seemingly illusory mist that was quite shocking in appearance.</p><br/><p>As for Master God-Diviner, he was in the early Core Formation stage, and was equally spectacular-looking. They had both been quite shaken by Bai Xiaochun’s performance, and as for his current appearance as he stood there outside of his immortal’s cave, it was beyond ordinary. He seemed lofty to an extreme degree, especially the way the wind caused the hem of his garment to stir slowly, along with his long, black hair. Considering the profound look in his eye, he seemed to have the air of a transcendent being, someone who didn’t even belong in the mortal world.</p><br/><p>“Junior Patriarch....”</p><br/><p>“Xiaochun....”</p><br/><p>Before Big Fatty Zhang and Master God-Diviner could do anything other than call out a greeting, Bai Xiaochun swished his sleeve, looking both determined and unhappy.</p><br/><p>Glancing at them out of the corner of his eye, he said, “Don’t try to convince me!”</p><br/><p>Instantly, Big Fatty Zhang and Master God-Diviner’s eyes went wide.</p><br/>\n</div>"}