{"title": "Chapter 423: No Stopping", "id": 423, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-423-no-stopping", "volume_title": "Volume 5", "body": "<h1>Chapter 423: No Stopping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun was currently only about 3,000 meters away from the exit of the orange trial by fire. Considering the speed he was capable of, it would only take a bit of effort for him to proceed on to the yellow trial.</p><br/><p>In fact, there were many other disciples in the area who, despite trying their very best, couldn’t make it past the wind and divine abilities to reach the very spot he was standing in.</p><br/><p>Many of them were shocked that he had made it through so quickly, but none of them were paying much attention to him. After all, they were more concerned with their own situation; the slightest lapse in concentration could leave them crushed to death in an instant.</p><br/><p>Because of the intense danger, all of the other disciples were essentially risking their lives.</p><br/><p>The contrast between all the other disciples, and Bai Xiaochun, who was simply standing there watching the stone golems fight, was very obvious, and some of the cultivators on the outside who were watching him were taken aback.</p><br/><p>“What's wrong with this Bai Xiaochun? He didn't do anything very special in this section, but he did go really fast. Why doesn’t he just go out through the exit?!”</p><br/><p>“This guy is pretty incredible. He's already in the top 10,000, and once he gets to the yellow section of the rainbow, he’ll instantly be in the top 5,000!”</p><br/><p>“What’s he doing just standing there?”</p><br/><p>As the cultivators on the outside looked on, puzzled, Bai Xiaochun was still trying to decide what to do. As he stood there, various key aspects to the Living Mountain Incantation were unlocked within his mind, and with each second that passed, it became clearer that this was an opportunity he could not afford to pass up on.</p><br/><p>Unfortunately, his divine sense was restricted within the trial by fire, and could only spread out a few hundred meters. Only being able to observe the giants with his naked eyes was almost like looking at them through a veil.</p><br/><p>“If I could get a bit closer, and observe them with divine sense, then I'm pretty sure I could come to understand these stone golems in a much more complete sense!” Eyes bloodshot, he struggled back and forth for a short time before gritting his teeth. “If worst comes to worst, I can just use the seven-colored jade pendant to teleport to safety!”</p><br/><p>With that, he burst into motion, not toward the exit, but in the opposite direction!</p><br/><p>Everyone looking on was immediately shocked, but before anyone even had a chance to cry out in shock, Bai Xiaochun became a beam of light speeding across the ground of the orange trial by fire. All of the other cultivators within the trial by fire looked on with wide eyes.</p><br/><p>“What is he doing...?”</p><br/><p>At the same time, Bai Xiaochun shot along, heading directly toward the stone golems, and then, maintaining his incredible speed, he began to fly up the legs of the nearest one.</p><br/><p>From a distance, Bai Xiaochun looked like a tiny bug compared to the enormous stone golem. And yet, he was extremely agile, and quickly scrambled and leapt his way up to the giant's back. Eventually, he reached something of an outcropping where, despite the swaying of the giant’s movements, he was able to settle down cross-legged and send his divine sense out to observe the giant.</p><br/><p>By this point, everyone was gasping in shock; both the cultivators in the trial by fire, and the audiences outside watching events play out on the projected screens.</p><br/><p>“He... he jumped up onto the giant itself?”</p><br/><p>“Is this Bai Xiaochun crazy?!”</p><br/><p>“Wait, is he going to start practicing cultivation? Heavens! What is he thinking? Most people try to get out of that place as quickly as possible. But he actually went backward, and now is going so far as to practice cultivation. It's a trial by fire, not a place for cultivation!” Bai Xiaochun’s actions were causing a huge stir both inside and outside of the trial by fire.</p><br/><p>Meanwhile, Zhao Yidong’s star was not the subject of much attention anymore. Bai Xiaochun’s actions, despite the fact that he was only in the orange trial by fire, were leading to profound shock among the audience.</p><br/><p>As time passed, word continued to spread through the cultivators of the Starry Sky Dao Polarity Sect, and even more people began to pay attention to what was happening.</p><br/><p>As for Song Que, he was in the middle of a session of meditation, when suddenly his bag of holding began to vibrate. Opening his eyes, he produced a jade slip from inside that had a short message from one of his friends. After scanning it, his eyes went wide, and he shot to his feet.</p><br/><p>“Bai Xiaochun?!” Without any hesitation, he rushed out of his immortal’s cave and looked over at the orange section of the rainbow overhead. Upon finding one particularly bright star, he focused on it, and moments later, Bai Xiaochun’s name appeared in his head.</p><br/><p>As the commotion in the outside world spread, Bai Xiaochun was inside the trial by fire, doing his best to stay in one place on the back of the giant. Enduring the screaming winds, he sent his divine sense pouring out to observe the internal structure of the stone golem.</p><br/><p>There was no more suitable place to study this stone golem than the position he had occupied!</p><br/><p>“To meld with the mountain,” he murmured, “you have to understand it first!” With that, he rose to his feet and began to climb higher up through the cracks and crevices on the back of the stone golem. The entire time, the stone golem was engaged in fierce fighting with its opponent, swaying back and forth amidst heaven-rending, earth-crushing rumbling sounds.</p><br/><p>On a few occasions, Bai Xiaochun was almost hurled off of the surface of the stone golem, especially whenever the other stone golem landed a blow on it, which caused everything around him to shake violently.</p><br/><p>Once, the opposite stone giant attacked with a fist strike that summoned a divine ability, leaving Bai Xiaochun coughing up blood. Despite being relatively hidden among the crevices on the giant's back, he still felt as if his inner organs were vibrating on the point of collapse.</p><br/><p>And yet, determination filled his eyes. Tightening his grip on the rocky surface, he once again sent some divine sense out to understand more about the stone golem.</p><br/><p>Everyone watching the scene was left gasping, and even the two stone giants had noticed him. However, other than strange gleams which appeared in their eyes, they did nothing, and simply continued to fight.</p><br/><p>Meanwhile, in another location on Myriad Star Rainbow, outside of the Ravine of Endless Mountains, Stonemountain was sitting cross-legged on the same greenish-black boulder. Slowly, his eyes opened, and he looked in the direction of the Starry Sky Dao Polarity Superstars trials, his gaze coming to rest on Bai Xiaochun’s star on the orange portion of the rainbow. Gradually, a strange light rose up in the man’s eyes, and a smile broke out on his face.</p><br/><p>“Now that’s clever,” he murmured quietly.</p><br/><p>Back inside the orange trial by fire, Bai Xiaochun took a deep breath and climbed higher up the giant. By now, he had a fairly thorough understanding of the internal makeup of the enormous stone creature, except for its head. Of course, that was the most dangerous area of all. But Bai Xiaochun was currently engulfed within the Living Mountain Incantation, in much the same way that he often lost himself in concocting medicine. It was with a seeming complete lack of the fear of death that he flew higher, even as the two stone golems battered at each other endlessly.</p><br/><p>Wings appeared behind him as he pushed on with greater speed, and he even relied on the Mountain Shaking Bash and the Undying Tendons in his left leg. Sonic booms echoed out, and a series of afterimages stretched out behind him as he shot upward to appear on top of the stone golem’s head. Winds battered him, making it almost impossible to stand still, but he grabbed onto one of the stone hairs sticking out of the giant’s head, and then sent his divine sense out with reckless abandon.</p><br/><p>Apparently, the stone golem did not like its head being interfered with. Frowning, it jerked its head to the side, causing a violent wind to rise up within the trial by fire. Instantly, the other cultivators within the trial began to emit agonized shrieks, and quickly began to crush their jade pendants to teleport away.</p><br/><p>Bai Xiaochun finally couldn’t hold on any longer, and was flung off of the giant’s head. At the same time, the huge stone golem began to swing its mountain-like hand toward Bai Xiaochun, almost the way a human would in an attempt to grab a fly out of the air.</p><br/><p>As Bai Xiaochun watched the huge hand filling his field of vision, his eyes suddenly flashed with enlightenment.</p><br/><p>“Spirit-meld!” Bai Xiaochun roared, his hands flashing in a double-handed incantation gesture as he used the spirit-melding techniques described in the Living Mountain Incantation. He had attempted this same thing numerous time in the Ravine of Endless Mountains, and had failed each time. But this time, he suddenly felt something stirring in his mind, a connection of sorts with this enormous stone golem.</p><br/><p>It was a unique, indescribable connection, almost as if he were melded with the emotions of the giant. He could feel how ancient it was, and could feel its madness and bitterness. He could also sense how much it hated this world, and especially the Starry Sky Dao Polarity Sect.</p><br/><p>A tremor ran through Bai Xiaochun, and the same thing happened to the stone golem. Its eyes shone with bright light as it looked at Bai Xiaochun, and suddenly, instead of trying to grab Bai Xiaochun, it swatted at him!</p><br/><p>Instantly, Bai Xiaochun was sent flying through the air, spinning head over heels toward the exit of the orange trial by fire!</p><br/><p>Bai Xiaochun barely had time to pant before he was within the teleportation range of the exit, and was sucked away toward the yellow trial by fire. In the moments before he faded away, he looked back to see both of the stone giants standing there staring at him.</p><br/><p>Moments later, intense rumbling sounds once again echoed out. Apparently, their performance would not conclude for all eternity. They would not rest until they died!</p><br/>\n</div>"}