{"title": "Chapter 436: Battling Gongsun Waner!", "id": 436, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-436-battling-gongsun-waner", "volume_title": "Volume 5", "body": "<h1>Chapter 436: Battling Gongsun Waner!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>That simple gesture, backed by the Frigid School Will-Evolving Incantation, as well as his Gold Core, caused frigid qi from the Frigid Adept level to surge out, distorting the air as it shot to meet the four-colored ice flower.</p><br/><p>When they made contact, a huge boom echoed out in all directions. Three of the flower’s petals shattered into ash, but the final one only grew larger, transforming into an ice blade that sliced through Bai Xiaochun’s frigid qi and continued onward.</p><br/><p>The shocking speed of the ice blade caused Bai Xiaochun’s expression to flicker. After making contact with the ice flower, his Frigid Adept power had been almost completely sucked away, and as the ice blade neared, the intense cold caused his blood to begin to freeze up. Thankfully, in addition to his Heaven-Dao Gold Core, he also had his Undying Heavenly King Core, which vibrated as it stimulated his fleshly body power.</p><br/><p>As the ice blade neared, Bai Xiaochun howled and clenched his right hand into a fist, which he punched out at the ice blade.</p><br/><p>A huge boom could be heard as the ice blade shattered into bits. At the same time, Bai Xiaochun coughed up a mouthful of blood and then looked down to see the flesh of his right hand shredded and bleeding. However, now was not the time to retreat. Instead, he blurred into motion, heading directly toward the statue of Gongsun Wan’er, unleashing more frigid qi and using his frigid shadows to perform a minor teleportation.</p><br/><p>Shockingly, he appeared right in front of the expressionless Gongsun Wan’er, whereupon his left leg swept out in a kick, backed by the full fleshly body power of his Undying Tendons.</p><br/><p>In the same moment that Bai Xiaochun attacked, Gongsun Wan’er, seemingly ignoring him, performed an incantation gesture with her left hand and then pushed her finger down onto her forehead. As she did, a burst of frigid qi emerged that vastly surpassed that from before.</p><br/><p>Everything around her instantly froze, and at the same time, an enormous ice hand materialized behind her, which shot toward Bai Xiaochun as if to grab him!</p><br/><p>Bai Xiaochun had already sent his foot flying through the air with explosive power, so it smashed into the ice hand, destroying most of it. However, the hand still continued onward to slam into Bai Xiaochun.</p><br/><p>Bai Xiaochun was sent spinning backward, blood spraying from his mouth. And yet, his eyes shone with ferocious light as he completely ignored his own injuries and once again summoned a frigid shadow as he prepared to teleport to safety.</p><br/><p>As he did, his expression flickered as he realized that Gongsun Wan’er’s frigid qi had formed something like a sealing power, a barrier that obstructed his ability to change locations with his frigid shadows.</p><br/><p>As for the mostly destroyed ice hand, it quickly repaired itself, and then began to grow larger. In the blink of an eye, it was fully 300 meters tall, and once again began to rumble through the air toward Bai Xiaochun.</p><br/><p>Up to this point, Bai Xiaochun hadn’t even been able to get close to Gongsun Wan’er, who currently stood behind the ice hand, staring at him coldly.</p><br/><p>The ice hand closed in, growing larger the entire time, until it was more than 3,000 meters tall. Bai Xiaochun’s pupils constricted as he realized that he wasn’t sure what to do at this point. For the entire time during this fight, he had been reacting, and had yet to take the initiative. If he couldn’t turn things around, then he would surely meet defeat.</p><br/><p>“So, you want to compete in terms of frigid qi...? Fine, let’s do it!” Anxiety for the safety of Big Fatty Zhang was the most important thing right now, so Bai Xiaochun knew that if he couldn’t defeat this statue of Gongsun Wan’er, he wouldn’t get into the violet trial. Therefore, he took a deep breath and then drew upon a vast amount of frigid qi from his Gold Core, all of which he converged upon his right hand, causing it to turn a deep blue color.</p><br/><p>Then, he shoved his blue hand directly toward the ground!</p><br/><p>“Frigid... mountain!!” Rumbling sounds echoed out as the frigid qi exploded downward toward the ground, causing a mountain of ice to form, and freezing everything in the area.</p><br/><p>Even as the ice hand closed in, the mountain of ice rose up hundreds of meters into the air. Then, the two forces met.</p><br/><p>He was drawing upon so much frigid qi that his qi passageways were pulsing with pain, and yet, he didn’t seem to notice. He was drawing upon virtually all of the frigid qi his Gold Core was capable of, completely regardless of the consequences. It almost seemed like an insane suicide attack!</p><br/><p>The ice mountain continued to grow rapidly, until it was also 3,000 meters tall. That was when the ice hand reached it!</p><br/><p>“Detonate!!” Bai Xiaochun shouted, his eyes bloodshot.</p><br/><p>BOOOOOOOOOMMM!</p><br/><p>The ice hand shattered and the ice mountain exploded, sending a powerful shockwave out in all directions. Blood sprayed out of Bai Xiaochun’s mouth as he was sent tumbling backward, and for the first time... the statue of Gongsun Wan’er was harmed by Bai Xiaochun seemingly insane attack.</p><br/><p>Popping sounds emanated out as a tremor ran through her. Shockingly, Gongsun Wan’er’s forehead split open, a crack that ran all the way down to her mouth, and was completely terrifying in appearance.</p><br/><p>The battle had only just begun, but had already reached a completely shocking level. Everyone watching outside was glued to the action, especially because of the fact that Gongsun Wan’er had only recently become famous by breaking into the top 10. Furthermore, Bai Xiaochun’s cultivation base was only in the mid Gold Core stage, putting him at a clear disadvantage. Everyone watching the fight was completely shocked.</p><br/><p>“Mid Gold Core stage versus late Gold Core! This Bai Xiaochun... has really been hiding his strength!”</p><br/><p>“He has frigid qi, and so does Gongsun Wan’er. This battle is going to be determined by who has better control!”</p><br/><p>“I never thought that this Bai Xiaochun... would get so far!”</p><br/><p>All of the top 100 Starry Sky Dao Polarity Superstars who heard about the matter were moved, and instantly stopped whatever type of cultivation they were currently practicing to watch.</p><br/><p>Fights like this were not often seen, and in fact, even the superstars in the top 10 came out of their immortal's caves to observe.</p><br/><p>In the battlefield that was the blue trial by fire, Bai Xiaochun was gasping for breath as he stared at the statue of Gongsun Wan’er. Gongsun Wan’er had used frigid qi when he fought her back in the Spirit Stream Sect, but her control of it in this battle was on a completely different level. She used it with a finesse that left Bai Xiaochun completely shocked.</p><br/><p>He wasn’t sure what method she used to cultivate frigid qi, but however she did it, the results were astonishing, and seemed to surpass his own Frigid Adept powers. In addition to that, their cultivation bases were not on the same level. He was in the mid Gold Core stage, and despite how close he was to a breakthrough, he was not in the late stage.</p><br/><p>As for Gongsun Wan’er, considering the fluctuations of her cultivation base, it was obvious... that she was in late Core Formation!</p><br/><p>“It doesn’t matter,” he said, his eyes glittering with cold light. “I have to win this fight!” He had just used all of the frigid qi at his disposal in a near-suicidal attack, which had resulted in wounding his opponent. As of now, the situation was different than before, and this was the moment in which he needed to clinch a victory.</p><br/><p>With that, he blurred into motion, using the fleshly body power of his left leg to shoot forward at incredible speed. As he did, he slapped his bag of holding, causing numerous flying swords to emerge, all of which had received multiple spirit enhancements. At the same time, a flash of black light could be seen, which was none other than his Renegade Dragon Horn!</p><br/><p>The Renegade Dragon Horn formed the center of a sword formation that descended like rain toward the statue of Gongsun Wan’er. At the same time, Bai Xiaochun’s right hand shot out in a gripping motion that flashed with black light: the Throat Crushing Grasp!</p><br/><p>However, even as the sword formation descend onto Gongsun Wan’er, the statue’s eyes flashed and her right hand shot up, ripping into her own throat and then, in completely shocking fashion... dragging a spine-like bone sword out of her own body!!</p><br/><p>As the bone sword appeared out in the open, a sound like that of countless screaming souls filled the entire blue trial by fire. As for Bai Xiaochun, he was instantly filled with a sense of profound and deadly danger.</p><br/><p>Everyone on the outside devolved into cries of shock and astonishment.</p><br/><p>At the same time, the statue of Gongsun Wan’er didn’t hesitate for even an instant before slashing the bone sword viciously toward Bai Xiaochun’s incoming sword formation!</p><br/><p>The air shattered around the bone sword, as though heaven and earth were about to be destroyed. Everything in the area turned black, with the starkly white bone of the sword shone so brightly that it became the only light in the dimension.</p><br/><p>One by one, the flying swords began to shatter into pieces, until only the Renegade Dragon Horn was left. Even that couldn’t last for very long before cracks spread out on its surface and it began to collapse. In the final moment, it was sent spinning off to the side as the bone sword slashed toward Bai Xiaochun with shocking power!</p><br/><p>“So, this is your trump card, huh?!” Bai Xiaochun murmured, his pupils constricting. At the same time, he slapped his bag of holding, causing a black scale to fly out and block the path of the bone sword. Simultaneously, he took a deep breath and then stretched both hands out wide before pushing them down toward the ground. Eyes shining with bizarre light, it was with the softest of voices that he said, “Waterswamp!”</p><br/>\n</div>"}