{"title": "Chapter 438: Cultivation Base Breakthrough!", "id": 438, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-438-cultivation-base-breakthrough", "volume_title": "Volume 5", "body": "<h1>Chapter 438: Cultivation Base Breakthrough!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As soon as Bai Xiaochun shouted “die,” a scene of violent destruction played out in front of the eyes of all onlookers. Bai Xiaochun shot forward in a beam of blue light, drawing upon the Living Mountain Incantation and leaping forward with...</p><br/><p>The Mountain Shaking Bash!</p><br/><p>The strength of the stone golem bolstered Bai Xiaochun’s fleshly body, making it vastly more powerful than before, to a virtually indescribable degree. Furthermore, he moved so quickly that it almost seemed like a teleportation.</p><br/><p>He pierced through the frigid qi, unleashing a series of sonic booms that crushed everything around him before appearing directly in front of Gongsun Wan’er!</p><br/><p>The statue had already been seriously damaged, and of course, was only a statue, not the true Gongsun Wan’er. As such, it was completely incapable of dodging or evading the attack. Instead, her hands flashed in a double-handed incantation gesture as she attempted to block the strike!</p><br/><p>Bai Xiaochun’s eyes were bright red as he put everything on the line in this last-ditch effort. If he couldn’t secure victory at this point, then not only would he lose his chance to advance to the violet trial, but he would also be unable to rescue Big Fatty Zhang!</p><br/><p>That was not an outcome he could accept.</p><br/><p>There was only one thought in his mind....</p><br/><p>“I have to win!!!” Howling, he closed in, using the stone golem’s body to launch a spinning kick with his left leg, which slammed directly into the ice giant summoned by Gongsun Wan’er’s statue.</p><br/><p>The power of that kick was backed by the fleshly body power of the Undying Live Forever Technique, as well as the Living Mountain Incantation and the Mountain Shaking Bash. Furthermore, it also contained his Undying Hex. It was... a devastatingly deadly attack!</p><br/><p>Rumbling sounds echoed out as the foot sailed through the air, causing the entire blue trial by fire to tremble. The statue of Gongsun Wan’er attempted to use both arms to block the incoming left foot, but as soon as it made contact, the statue’s arms began to collapse. Bai Xiaochun’s foot smashed through them like a boulder crushing a drinking glass to land directly on the statue’s chest!</p><br/><p>Almost instantly, the statue’s chest began to cave in, and then cracks spread out in all directions. However, the statue wasn’t dead yet; all Bai Xiaochun had managed to do so far was destroy an outer layer of ice shields. Although the statue was seriously damaged, it was still able to defend itself.</p><br/><p>However, as the statue fell back, Bai Xiaochun drew once again upon the power of the stone golem to launch into another Mountain Shaking Bash, fueling it further with the power of his left leg. This time, he sent the stone golem’s hand shooting out, its thumb and forefinger glittering with black light.</p><br/><p>It was none other than... the Throat Crushing Grasp!</p><br/><p>Rumbling echoed out as the throat of the statue was crushed, and then... the entire statue began to fall apart....</p><br/><p>The final move had come as fast as lightning, and was delivered with ruthless efficiency. In the blink of an eye, the ice giant was destroyed, and the statue shattered!</p><br/><p>As that happened, a beam of teleportation light shot down, which was none other than the entrance to the violet trial!</p><br/><p>Simultaneously, Bai Xiaochun’s Living Mountain Incantation faded away, and the stone golem vanished. Bai Xiaochun was revealed in person, his face ashen as he floated down to the ground. Clearly, he was having trouble standing, and even coughed up three consecutive mouthfuls of blood. Despite his seeming weakness, though, his eyes shone with a gleam of determination that left everyone in the audience completely shaken.</p><br/><p>“He... won?!?!”</p><br/><p>“A mid Core Formation cultivator fought someone in the late Core Formation stage, and actually won?!?!”</p><br/><p>“Heavens! He just beat the statue of Gongsun Wan’er! Doesn't that mean... that he qualifies to enter the violet trial? He’s going to become... the tenth superstar to be on the violet portion of the Starry Sky Dao Polarity Sect rainbow!?!?”</p><br/><p>Outside of the trials, everyone was devolving into a huge commotion. Nearly half of the entire Starry Sky Dao Polarity Sect was shaken to the core, even more so than when Gongsun Wan’er had recently challenged the trials.</p><br/><p>An uproar was sweeping through the sect, and especially through Sky Quarter Rainbow, where Bai Xiaochun came from. The hubbub there was far more intense than in other locations.</p><br/><p>Back on that very rainbow, Song Que was standing outside of his immortal's cave, his hands clenched tightly into fists. It was difficult to read his expression, but his heart was filled with bitterness. He simply could not bring himself to admit that he didn’t measure up to Bai Xiaochun, but the endless succession of evidence had pushed him to the brink of collapse.</p><br/><p>Xu Baocai, Master God-Diviner, and Chen Manyao were all shaken deeply. Although all of them knew that Bai Xiaochun was no ordinary cultivator, never could they have imagined that he was this incredible.</p><br/><p>Gongsun Wan’er was also on Sky Quarter Rainbow, sitting outside of her immortal's cave on a boulder, looking up toward the Starry Sky Dao Polarity Superstars trials. She had just watched the entire fight play out between her statue and Bai Xiaochun, and at the moment, a strange expression could be seen on her face. In fact, when her statue collapsed, she actually smiled.</p><br/><p>“So, my sweetie is as awesome as ever!” She even clapped her hands softly, a mysterious light flickering in her eyes.</p><br/><p>Outside of Sky Quarter Rainbow were Chen Yueshan and Heretic, both of whom were superstars and chosen from the top 3. They were completely shaken by the battle they had just witnessed. As for Chen Yueshan, her eyes shone with a mysterious light, whereas Heretic simply snorted coldly. Although he didn’t say anything, the arrogant look in his eyes couldn’t have been clearer.</p><br/><p>Even Nascent Soul cultivators in the sect had been watching, and were moved by Bai Xiaochun’s actions. As of this moment, it was correct to say that within the Starry Sky Dao Polarity Sect... there wasn't a single person who didn’t know Bai Xiaochun!!</p><br/><p>However, even as everyone devolved into exclamations and discussion, someone suddenly cried out.</p><br/><p>“No, wait... look at Bai Xiaochun. He’s... he’s starting to practice cultivation!!”</p><br/><p>In response, more people looked over and saw what was happening. “Frigid qi. Look at the frigid qi....”</p><br/><p>Bai Xiaochun really was practicing cultivation, although it wasn’t intentional. After Gongsun Wan’er’s statue was destroyed, frigid qi began to spread out from it and fill the blue trial by fire. And since it had nowhere else to go, it began to stream toward Bai Xiaochun.</p><br/><p>Whether Bai Xiaochun wanted it or not, the frigid qi began to pour into his body, sweeping through his qi passageways and heading toward... his Heaven-Dao Gold Core!</p><br/><p>It was strong frigid qi, and in the blink of an eye, it transformed into a vortex with Bai Xiaochun at the center!</p><br/><p>As it rushed into his Gold Core, it filled it to thirty percent capacity, then forty percent, fifty percent, sixty percent....</p><br/><p>As more frigid qi rushed into him, he trembled at the sensation of his cultivation base rising. Before, he had been at the peak of mid Core Formation, but as of this moment, he was breaking through into late Core Formation!</p><br/><p>It took only a short moment for the overall frigid qi in his Gold Core to reach sixty percent, and yet, it hadn’t stopped!!</p><br/><p>His Gold Core was made from nine spiritual seas, sixty percent of which were now a world of intense coldness. And then... Bai Xiaochun shivered, threw his head back and let loose a long cry as his frigid qi reached... seventy percent!!</p><br/><p>The Frigid School Will-Evolving Incantation involved gathering frigid qi into the Gold Core, which meant that thirty percent was the peak of the early stage, and sixty percent was the peak of the mid stage.</p><br/><p>Earlier, his overall level of frigid qi had reached roughly sixty percent, but now... having reached seventy percent, intense rumbling sounds exploded within him as his cultivation base released shocking power.</p><br/><p>This was... the late Gold Core stage!!</p><br/><p>And things weren’t over yet! More frigid qi poured into him, pushing his Gold Core frigid qi past seventy percent to eighty percent!</p><br/><p>When the final bit of frigid qi was sucked in, his Gold Core frigid qi capacity had reached eighty-five percent, and his cultivation base was still climbing. As of now, he was very close to reaching one hundred percent capacity and being at... the great circle of the Gold Core stage!!</p><br/><p>As his cultivation base rose and his energy surged, the blue trial by fire shook violently, and on the outside, the star that represented Bai Xiaochun shone with blinding light!</p><br/><p>Everyone outside was completely shaken!</p><br/><p>“This Bai Xiaochun, he... he actually just had a breakthrough!!”</p><br/><p>“Late Core Formation! He just reached late Core Formation!!”</p><br/><p>“He could fight late Core Formation when he was only in mid Core Formation. Now that he’s in the late stage, doesn’t that mean he could fight someone in the great circle!?!?”</p><br/><p>“What good fortune.... It’s all because he cultivates a technique that uses frigid qi. By absorbing the excess frigid qi from Gongsun Wan’er’s statue, he was able to break through!”</p><br/>\n</div>"}