{"title": "Chapter 446: Dinner? Tonight?", "id": 446, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-446-dinner-tonight", "volume_title": "Volume 5", "body": "<h1>Chapter 446: Dinner? Tonight?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Days passed. Song Que, Master God-Diviner and Chen Manyao all had their own personal space in Bai Xiaochun’s cabin, and were able to enjoy the treatment that only cultivators in the top ten of the Starry Sky Dao Polarity Superstars could receive. Filled with gratitude, they did their best to focus on their cultivation.</p><br/><p>Bai Xiaochun wasn’t very far from the great circle of Core Formation, and couldn’t help but feel that he was already quite formidable. Therefore, he spent most of his time basking in the sun on his balcony and looking out at the sea, which was exactly what he was doing right now.</p><br/><p>The main deck of the ship wasn’t very far above Bai Xiaochun’s balcony, and among the cultivators there was Gongsun Wan’er, who was apparently also staring out at the sea.</p><br/><p>Bai Xiaochun finally looked away from the sea water and then took a long swig of spirit alcohol.</p><br/><p>“Now this is the life!” he said with a sigh. Behind him were two puppet hand maidens who were massaging his shoulders.</p><br/><p>Occasionally, huge waves would roll across the surface of the water, but at the moment, it looked more like a beautiful golden mirror. By this point, Bai Xiaochun was used to the wind, and as for the sea water, because of the techniques he cultivated, it wouldn’t harm him unless he was exposed to it for long periods of time.</p><br/><p>Furthermore, because of the spell formation built into the battleship, the incredibly intense spiritual energy in the water was softened and purified before entering the ship.</p><br/><p>Sighing, Bai Xiaochun looked back at his huge cabin, and saw Song Que, Master God-Diviner, and Chen Manyao all sitting cross-legged in meditation, apparently completely focused on their cultivation. Feeling a bit bored, he decided that he should probably go find someone to chat with.</p><br/><p>“These guys are too focused on cultivation. This half a year is a time to enjoy things. Once we reach our destination, we’ll be heading into the outposts of the Starry Sky Dao Polarity Sect, and the Great Wall.... Things definitely won’t be as comfortable there.</p><br/><p>“Wouldn’t it be great if Xu Baocai were here?” Taking another drink of spirit alcohol, he was just contemplating how to alleviate his boredom when, all of a sudden, he saw a golden flash of light off in the distance.</p><br/><p>Some distance away, a school of golden fish had just leapt up out of the sea water, flashing through the air like golden sparks before splashing back down into the water.</p><br/><p>Considering how sharp Bai Xiaochun’s vision was, he could see the fish quite clearly, and was able to tell that they were about as long as a human arm. They were covered with glittering golden scales, and most shocking of all, had two heads! Furthermore, those two heads weren’t located next to each other. Rather, the second head was where a fish's tail would normally be.</p><br/><p>“Golden loaches!!” Bai Xiaochun exclaimed, shooting to his feet. He recognized these strange fish from one of the volumes of spirit creatures he had studied in the Spirit Stream Sect, and knew that they were a very rare type of spirit fish!</p><br/><p>Such spirit fish didn’t need to be refined into medicinal pills to be consumed as food. They were a precious material of heaven and earth that could strengthen the qi passageways and bolster divine sense. Fish like that could be very useful for cultivators, and if they were older than a hundred years of age, could even help when stepping into the Nascent Soul stage.</p><br/><p>As Bai Xiaochun looked excitedly out at the sea, the school of golden loaches once again broke the surface of the water. Then a huge amount of water exploded up as a fish ten times larger than any of the other ones launched itself up into the air.</p><br/><p>Just like the other fish, it was golden in color and had two heads. However, there was something ancient to this one, as though it had lived for a very long time. Furthermore, its scales glittered with a golden light that surpassed the other fish.</p><br/><p>“A hundred-year-old golden loach!!” Gasping, Bai Xiaochun waved his hand, sending a stream of frigid qi out which instantly wrapped around the fish. However, a stream of power shot back toward him, destabilizing his cultivation base and very nearly dragging him off of the balcony.</p><br/><p>Expression flickering, he quickly called out at the top of his lungs, “Que’er, Master Snortsnort, Little Manyao, hurry up and help me! I hooked a precious treasure here!”</p><br/><p>Song Que, Master God-Diviner, and Chen Manyao immediately opened their eyes from meditation. Song Que seemed a bit irritated, and Master God-Diviner was also slightly annoyed. As for Chen Manyao, she had the same smile on her face that she usually did. However, when all of them looked over and saw the huge loach leaping into and out of the water, their eyes went wide. Song Que was the first to rush out, followed by Chen Manyao and Master God-Diviner.</p><br/><p>“Hurry up and help me!” Bai Xiaochun said excitedly. “If we can catch this fish, we’ll have a great dinner tonight!” With that, he poured some more cultivation base power into his efforts. Thankfully, as a member of the Spirit Stream Sect, he had been cultivating control power for quite some time, and was very familiar with it. Therefore, despite the fact that the fish had already dropped back down under the surface of the water, he still managed to maintain a connection to it.</p><br/><p>The struggling of the enormous fish was causing huge waves to roll out, along with intense crashing sounds. Thankfully, Song Que and the others quickly arrived to help. Song Que’s right hand flashed with an incantation gesture, and a shadow spread out from his feet and into the water. Although the water weakened it a bit, it still managed to shoot directly toward the huge fish.</p><br/><p>Master God-Diviner also performing an incantation gesture as he unleashed the power of a magical item.</p><br/><p>Chen Manyao’s actions were the strangest of all; after performing an incantation gesture, she opened her mouth and spat out a pink cloud, which rapidly shrank down into the shape of a mist hawk that let out a piercing cry as it dove toward the fish.</p><br/><p>Bai Xiaochun let out a whoop of excitement. Moments ago, he had been bored, but now everything had changed.</p><br/><p>“Come on everybody, don’t hold anything back!” he shouted. “We can’t let this fish get away!” Bai Xiaochun’s excitement was rubbing off on the others, whose hearts began to pound. Considering how much this huge fish was struggling, they all could tell that it wasn’t anything ordinary.</p><br/><p>The fish struggled mightily, even letting out muffled cries that reached the cultivators who were gathered on the deck. As for Gongsun Wan’er, she wasn’t too far away from Bai Xiaochun’s position, and when she looked down, she could actually see the fish, as well as Bai Xiaochun and his Dao protectors.</p><br/><p>Laughing softly in amusement, she waved her finger in the direction of the huge fish, unleashing her own cultivation base power to aid Bai Xiaochun and the others.</p><br/><p>Bai Xiaochun sensed that Gongsun Wan’er was helping them, and was quite moved.</p><br/><p>“Wan’er!” he shouted. “Help us reel in this fish and we’ll all have a great dinner!”</p><br/><p>Gongsun Wan’er looked down at Bai Xiaochun, smiled, and said, “Dinner? You mean tonight?”</p><br/><p>“Yeah!” he replied, not thinking much about her question. Under the combined efforts of the group, the struggling fish slowly weakened, and soon, they managed to heave it up out of the water toward the battleship.</p><br/><p>Laughing excitedly, Bai Xiaochun extended his hands to grab the fish. Simultaneously, excited smiles broke out on the faces of Song Que, Master God-Diviner and even Chen Manyao. Although catching his huge fish hadn't involved any danger, they were out in the middle of the Heavenspan Sea, and had worked quite hard to succeed.</p><br/><p>However, even as the huge fish flew through the air, a figure burst into motion from the deck, moving like lightning to unleash his great circle Core Formation cultivation base power. Before anyone could do anything, he had waved his finger in the direction of the fish.</p><br/><p>Instantly, a huge hand appeared in the middle of the air, which rumbled toward the exhausted fish, and then hit it with such intense power that it instantly died!</p><br/><p>Next, the hand wrapped around the fish and pulled it back toward a young man on the deck of the ship, who swished his sleeve to pull the fish into his bag of holding.</p><br/><p>“What are you doing!?” Bai Xiaochun shouted, enraged. Unable to react in time, he had no choice but to fly up to the deck, fuming with anger. Song Que, Master God-Diviner, and Chen Manyao all joined him, where they confronted the young man face-to-face.</p><br/><p>“Hey,” Bai Xiaochun said, “we saw that fish first, and we're the ones who weakened it. We were just about to grab it, you thief!”</p><br/><p>Shockingly, the young man in front of them had once been in the top 3 of the Starry Sky Dao Polarity Superstars, but was now in 5th place. His name was... Ji Fang!</p><br/><p>“Are you kidding me?” Ji Fang said, a cruel expression twisting his face. “I have the fish now. It’s mine!” Of course, he completely ignored Song Que and the others, and only looked at Bai Xiaochun and Gongsun Wan’er, albeit with complete scorn.</p><br/>\n</div>"}