{"title": "Chapter 441: Soul Hunting Expedition", "id": 441, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-441-soul-hunting-expedition", "volume_title": "Volume 5", "body": "<h1>Chapter 441: Soul Hunting Expedition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Everything was turning up, and Bai Xiaochun’s mood was improving. Considering that, he now felt up to public appearances, and not just on Sky Quarter Rainbow. He went to the other rainbow districts as well, and the adulation he received left him feeling quite pleased. From what he could tell, he was almost at the ultimate peak of life.</p><br/><p>“Ai. With the snap of a finger, I, Bai Xiaochun reduced the Starry Sky Dao Polarity Superstars to ashes. What a headache. Imposter Nightcrypt, why do think I’m so outstanding?” Before leaving his immortal’s cave, he would always pull out his copper mirror to examine himself, and when he was in a good mood, he would always ask this same question of imposter Nightcrypt.</p><br/><p>As for imposter Nightcrypt, every time he heard that question, he felt as if he were covered with goosebumps. And yet, he would still plaster on a smile and rack his brains to come up with some new words of flattery to please Bai Xiaochun.</p><br/><p>The little turtle always seemed to be busy, and never came out even once to say anything sarcastic. As such, Bai Xiaochun felt more wonderful than ever at being here in the Starry Sky Dao Polarity Sect.</p><br/><p>Unfortunately, good things never last forever. Another half a month went by, and a Dharmic decree came down from the demigod rainbow!</p><br/><p>It happened one morning when Bai Xiaochun emerged from his immortal's cave in very high spirits. He looked at the distant sea, felt the breeze caressing his face, and took a deep, contented breath. Patting his bag of holding, he produced his copper mirror.</p><br/><p>Clearing his throat, he said, “Hey Nightsies, come, come, explain to me why Lord Bai gets praised wherever he goes.”</p><br/><p>Of course, he was just getting ready to go strolling about to receive some praise and adulation.</p><br/><p>Poor Imposter Nightcrypt was on the verge of crying. Over the course of the last half month, he had scraped the bottom of the barrel in his attempts to come up with new material, and his existence was now a torment that made life almost unbearable.</p><br/><p>“Master, please spare me....” he groveled piteously.</p><br/><p>Bai Xiaochun was not very pleased by his reaction. Glaring, he was just about to respond when, all of a sudden, thunderous rumbling filled the air, causing everything to shake. Colors flashed in the sky, and a screaming wind kicked up. All of the rainbows were shaking, including the deva rainbow and Myriad Star Rainbow.</p><br/><p>Everyone from the devas down to the Qi Condensation disciples were completely shaken, and no matter what they were doing at the moment, looked up with flickering expressions.</p><br/><p>Startled, Bai Xiaochun almost dropped his copper mirror as he looked up into the sky, astonishment and confusion playing out on his face.</p><br/><p>“What’s going on!?”</p><br/><p>A moment later, a profoundly dignified and ancient voice echoed out from the demigod rainbow to fill the entire Starry Sky Dao Polarity Sect.</p><br/><p>“A Heavenspan imperial decree has been issued, and a soul-hunting expedition will begin. In one month, the Starry Sky Battleship will set sail for the Wildlands!”</p><br/><p>Every single word spoken by that ancient voice almost seemed like natural law, causing all creation to fill with rumbling sounds, and all hearts to be shaken. As for Bai Xiaochun, he wasn't quite sure exactly what the voice was talking about.</p><br/><p>After all, he had only just entered the top 10 of the Starry Sky Dao Polarity Superstars, and didn’t have a very complete understanding of how things worked for that group. However, as for everyone else who was in the top 100, they couldn’t hold back their excitement upon hearing the announcement.</p><br/><p>“The soul-hunting expedition is finally going to happen!!”</p><br/><p>“After this trial by fire, I’ll definitely be able to step into the Nascent Soul stage!!”</p><br/><p>“Hahaha! I've been waiting for this day for a long time now!”</p><br/><p>On Starry Quarter Rainbow, atop a mountain peak covered with endless flames, was 3rd place holder Chen Yueshan, who rose to her feet, her long hair swirling around her as her eyes burned with passion.</p><br/><p>“The soul hunt....”</p><br/><p>On Polarity Quarter Rainbow, 2nd place holder Heretic, one of the top superstars in the sect, was fighting a host of vengeful souls at the bottom of a deep cistern. Suddenly, a tremor passed through him, and his eyes began to shine with excitement.</p><br/><p>“It’s finally happening, huh...? Alright, Zhao Tianjiao, now we can finally see which of us will get a deva soul, and then step into the Nascent Soul stage!! It's definitely going to be me!”</p><br/><p>As waves of astonishment swept through the Starry Sky Dao Polarity Sect, somewhere outside of the sect, in a seemingly endless mountain range, a young man walked along beneath the trees. He was tall and slender, with a very cold expression, and a greatsword strapped to his back. The reek of blood surrounded him as he walked, as if he had slaughtered countless enemies on his journey.</p><br/><p>Shockingly, he held a head in his hand. It was the head of an old man, his expression twisted viciously, and emanating an aura that indicated his cultivation level when he had been alive: the Nascent Soul stage!!</p><br/><p>As the young man strode through the trees, he suddenly stopped in place and produced a jade slip from his bag of holding. Upon looking at the information in the slip, his eyes shone with a gaze so bright and corrosive that the surrounding plants and vegetation began to wither and die.</p><br/><p>“So, the soul-hunting expedition that I’ve been waiting for is finally happening!!” The young man’s gaze intensified, and the destructive effect on the plants and vegetation spread. In the blink of an eye, everything in an entire 3,000-meter area withered away into death!</p><br/><p>This young man was none other than the 1st place holder among the Starry Sky Dao Polarity Superstars, Zhao Tianjiao!</p><br/><p>After the news about the soul-hunting expedition came down from the demigod rainbow, the sect leader quickly sent out a number of orders, as did the peak lords from the four rainbow districts.</p><br/><p>All sorts of information began to spread through the sect, until everyone was bubbling with gossip.</p><br/><p>After hearing some of the talk, Bai Xiaochun still wasn’t completely sure of all the details, and quickly summoned Xu Baocai.</p><br/><p>As soon as he stepped into Bai Xiaochun’s immortal's cave, he said, “Junior Patriarch, this is something big. Very big!!”</p><br/><p>“Alright,” Bai Xiaochun said nervously, “hurry up and explain exactly what this soul-hunting expedition is!”</p><br/><p>Sounding very excited, Xu Baocai said, “Junior Patriarch, I already got all the information. The soul-hunting expedition is basically good fortune for all Core Formation cultivators preparing to step into the Nascent Soul stage!”</p><br/><p>“Huh?” Bai Xiaochun said, looking surprised. “Good fortune?”</p><br/><p>Based on some of the information he'd heard, the soul-hunting expedition, although not anything like a death sentence, was definitely very dangerous.</p><br/><p>“That’s right!” Xu Baocai continued. “I just heard about it myself. If you want to break through from Core Formation into the Nascent Soul stage, you have to do it by one of three ways. First is by using a Nascent Soul Pill, which is the mortal-tier method. The second method is by using five elements deva beast souls, which is the earth-tier method. Last is the most legendary of all, the heaven-tier method, in which you use five elements deva souls. However, that final method is virtually impossible!”</p><br/><p>“If you stay inside the sect, even reaching the earth-tier Nascent Soul stage is quite difficult. After all, deva beast souls are rare just like deva souls.</p><br/><p>“However, things are different in the Wildlands. Supposedly, there is a river in the Wildlands which is similar to the Heavenspan River. The difference is that it is a river that the living cannot see. It’s an underworld river, a path that all the souls from the entire world travel after death!</p><br/><p>“Because of that, souls are a lot more common in the Wildlands. In fact, they’re everywhere. Within that literally uncountable number of souls, it’s possible to find, not only deva beast souls, but also deva souls!!</p><br/><p>“And that’s why the place is the ultimate place of good fortune for Core Formation cultivators!!” From the level of Xu Baocai’s excitement as he spoke, it was evident that he would leap at the chance to be qualified to go the Wildlands.</p><br/><p>“The Wildlands....” Bai Xiaochun said. The truth was that Bai Xiaochun knew a bit more about the Wildlands than Xu Baocai did, and the first thing that popped into this mind was that something seemed strange about this trial by fire. It was definitely not as simple as it sounded.</p><br/><p>After all, there weren’t just souls in the Wildlands, there were also cultivators!!</p><br/><p>“This soul-hunting expedition is going to happen in the Wildlands. That ancient battleship is going to sail across the Heavenspan Sea toward another path which leads to the Wildlands!” Xu Baocai pointed to the huge, mysterious battleship at the top of the waterfall.</p><br/><p>Bai Xiaochun looked up at the ship, and was shaken as he recalled something Chen Manyao had said back when she had been trying to convince him to let her join his group of Dao protectors. She had mentioned this very ship, and Bai Xiaochun now realized that she must have known about this soul-hunting expedition all along!</p><br/><p>“The only people who qualify to go to the Wildlands on this ten-year-long trial by fire are famous people among the Starry Sky Dao Polarity Superstars. Congratulations, Junior Patriarch. It's hard to say for sure, but when you come back, you’ll probably be a Nascent Soul cultivator!</p><br/><p>“The ultimate goal of the trial by fire is to acquire a deva soul. Anyone who does can bring it back to the sect and exchange it for a complete set of five elements deva beast souls!!</p><br/><p>“Even if you can't get a deva soul, and only get a single deva beast soul, you can still bring it back to the sect and trade it for a precious Nascent Soul Pill!!”</p><br/>\n</div>"}