{"title": "Chapter 464: Bones of Giants", "id": 464, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-464-bones-of-giants", "volume_title": "Volume 5", "body": "<h1>Chapter 464: Bones of Giants</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Since everyone was either not talking, or talking in whispers, Bai Xiaochun decided that the best thing to do was follow the ancient wisdom of imitating the locals. Therefore, he tried to look as cold and aloof as possible, even a bit sinister, all in the hopes of blending into the crowd.</p><br/><p>Before long, things didn’t seem as strange as they had been. Bai Xiaochun felt like he was just like everyone else, and was soon strolling around happily. After a bit of time passed, he stopped in place and looked over at one particular nearby shop.</p><br/><p>“Scattered Souls Pavilion?” After looking at the name of the shop, he peered inside, and saw that the walls were stacked with countless strange-looking bottles. There were also quite a few cultivators inside browsing through the bottles.</p><br/><p>Curious, Bai Xiaochun turned, headed into the shop, and picked a bottle to look at. As soon as he saw what was inside, his eyes widened.</p><br/><p>The bottle contained a mist that was at first tranquil and calm. However, as soon as he looked closely at it, the mist shrank down into the form of a face that glared out murderously at him.</p><br/><p>It was the face of a young woman, viciously contorted into a ferocious expression. A moment after it formed, it banged into the side of the bottle as if it were trying to get at Bai Xiaochun! That face was none other than a vengeful soul!</p><br/><p>It happened with no warning whatsoever, and Bai Xiaochun had been completely unprepared for such a reaction, so he couldn’t hold back from letting out a yelp of surprise. Almost immediately, the surrounding cultivators looked over at him with frowns on their faces. Simultaneously, all of the other bottles in the shop began to tremble and vibrate as the mists inside of them turned into faces that looked at Bai Xiaochun with glaring eyes.</p><br/><p>To see so many vengeful souls staring at him caused Bai Xiaochun’s scalp to tingle with fear. He could also hear strange noises that resembled a mixture of laughter and weeping.</p><br/><p>There were even some voices that seemed to be singing. The sounds swirled and mixed together, seemingly boring all the way down into his soul.</p><br/><p>“Release me!”</p><br/><p>“Hey, big bro, remember me...? We know each other!”</p><br/><p>“I’ve eaten plenty of little kids just like you throughout the years!”</p><br/><p>“Hahaha, bwahahaha...!”</p><br/><p>The voices grew louder and louder until they echoed in Bai Xiaochun’s mind like thunder. At that point, a cold glow appeared in his eyes, and frigid qi began to swirl within him. His right hand flashed with an incantation gesture, and he unleashed the Undying Hex onto his own chest.</p><br/><p>Instantly, all of the sound died away, and everything returned to normal. The vengeful souls in the bottles were still staring at him, but apparently, they could sense that they were incapable of affecting his mind, so they looked away and began to transform back into spheres of mist.</p><br/><p>The other cultivators in the shop also began to look away and return to browsing the bottles.</p><br/><p>Bai Xiaochun took a deep breath and looked around, his gaze eventually coming to rest on a man in the corner of the shop. He was old, and wore a gray robe that matched the color of his hair. Hands clasped behind his back, he walked forward and smiled at Bai Xiaochun.</p><br/><p>“You new here?” he asked quietly.</p><br/><p>Bai Xiaochun nodded, a bit depressed as he realized that he was pretty sure he now knew why the people here didn’t like to talk much.</p><br/><p>“In World City and the lands beyond it, you need to keep your voice down to avoid getting tangled up with vengeful souls. The best thing to do is transmit your voice with divine sense.</p><br/><p>“There are far, far too many vengeful souls out there. Some of them you can see with your eyes, and some not. What you see in these bottles are none other than the souls of the dead. You see, both inside and outside of the Great Wall, souls are the most valuable resource. Whether it’s for cultivation, concocting medicine, or making magical items, you have to use souls.” With another smile and a nod, the old man turned and walked away.</p><br/><p>Bai Xiaochun offered his thanks, and then took a bit more time to look around at the souls. What he found was that Foundation Establishment level souls were the cheapest and most plentiful, with Core Formation souls being more expensive. He didn't see any belonging to Nascent Soul experts.</p><br/><p>Eventually, Bai Xiaochun left and melted back into the crowd. This time, he was even more careful than before as he walked along the moonlit streets. Eventually, he reached another shop that caused him to stop and stare.</p><br/><p>Within that shop, they were selling... savages!</p><br/><p>Just as the bones outside the city had indicated, the savages looked very much like cultivators, except bigger and taller. Most of them were three meters tall or more, and were extremely muscular.</p><br/><p>The savages on display were packed into coffins, and had sealing marks on them rendering them immobile. There were both men and women, and each and every one of them had very impressive fleshly bodies.</p><br/><p>As Bai Xiaochun approached, he was noticed by one of the salesmen, a man with a Foundation Establishment cultivation base and a waxen face. After looking Bai Xiaochun up and down, he clasped hands respectfully and quietly said, “Senior, our Wildlander servants might not be the absolute best available in World City, but they’re definitely top-of-the-line.”</p><br/><p>Bai Xiaochun looked curiously at the savages, and was shocked to find that they had teeth as sharp as wild animals.</p><br/><p>“You see,” continued the salesman, “even down to their teeth and bones, their fleshly bodies are very powerful, making them excellent servants. Furthermore, they’ve been sealed with restrictive spells, so that you can control their life or death with a single thought.”</p><br/><p>“They don’t look like Chen Manyao at all....” Bai Xiaochun thought curiously. He considered purchasing one, but in World City, the only currencies accepted were spirit stones and battle credit. Merit points were completely useless.</p><br/><p>“They’re so incredibly expensive....” he thought.</p><br/><p>Considering how many years the salesman had been working here, he could tell what Bai Xiaochun was thinking. Chuckling softly, he said, “Senior, I'm guessing you’re relatively new to World City. Let me explain: these savages aren’t really very expensive at all. Outside the Great Wall, in the cities inhabited by the savages themselves, captured Foundation Establishment cultivators sell for a price ten times as large as savages of a similar cultivation level!”</p><br/><p>“What?” Bai Xiaochun said, a look of shock appearing on his face. “The savages sell cultivators out there?”</p><br/><p>“Of course!” the salesman replied coolly. “To the savages, cultivators from inside the Great Wall are like the most nourishing type of food available. They don’t have spiritual energy out there, and inside of every cultivator is a spiritual sea. To them, cultivators... are like living spirit stones!”</p><br/><p>Bai Xiaochun’s scalp prickled with fear. The mere thought of being captured by savages outside the Great Wall, and then sucked dry like a spirit stone, left him trembling inside and out.</p><br/><p>“This place is way too dangerous....” he thought. Looking quite displeased, he left the shop, and instead of exploring the city more, went back to the inn.</p><br/><p>Before long, dawn arrived, and Zhao Tianjiao came looking for Bai Xiaochun. It was time to leave World City and head toward the Great Wall itself.</p><br/><p>They moved slower than before. The spiritual energy was getting weaker, making traveling more strenuous, and increasing the amount of time it took to recover from exertion. Furthermore, this leg of the journey was clearly more dangerous than the previous one.</p><br/><p>The lands were actually losing their black tinge, and were almost completely violet, as if they really had been soaked through-and-through with blood. It was the same with the water in the rivers. It was a completely shocking sight to Bai Xiaochun and the others in the group.</p><br/><p>There were mountains here and there, all of them bare of vegetation, as well as the occasional abandoned village. There were also mobs of vengeful souls that flew about, which usually had at least a few dozen that were as powerful as the Core Formation level.</p><br/><p>Thankfully, the vengeful souls weren’t particularly aggressive. Generally speaking, they would just fly by without stopping. Even still, Zhao Tianjiao and the other kept a close eye on them, and obviously, Bai Xiaochun was even more cautious.</p><br/><p>He kept his mouth sewn shut tight, refusing to utter even a peep. Only after the vengeful souls were completely out of sight would he let out a sigh of relief.</p><br/><p>As they proceeded forward, they rarely saw any other cultivators. There were almost no signs of life in this barren wasteland, and even the flora and fauna were few and far between, and were the type that put everyone on guard.</p><br/><p>Each plant or tree they encountered seemed stranger than the last, and more ferocious.</p><br/><p>Bai Xiaochun even saw one huge tree that was literally running along the ground as it chased after a pitch-black, nine-meter-tall spiked leopard. After catching the creature, the tree devoured it alive.</p><br/><p>At one point, an enormous, undead hand shot out of a ravine to grab a passing black eagle, which it crushed into a pulp as it extracted its blood....</p><br/><p>The squishing sounds were enough to cause one’s heart to prickle with shock!</p><br/>\n</div>"}