{"title": "Chapter 462: You People Just Wait!", "id": 462, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-462-you-people-just-wait", "volume_title": "Volume 5", "body": "<h1>Chapter 462: You People Just Wait!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun took a deep breath as a very serious expression played out on his face.</p><br/><p>Back when he was on the eastern Heavenspan River, he had always felt as the River-Defying Sect were still nearby. But now, he was in a completely strange place, with virtually no familiar faces around whatsoever.</p><br/><p>It was with a very somber expression that he looked over at Song Que and his other Dao protectors and said, “In a strange place like this, we have to stick together more than ever! Song Que, Master God-Diviner, Chen Manyao, as my Dao protectors, the time has come to show your true skill and ability!”</p><br/><p>With that, he flicked his sleeve, eyes shining brightly.</p><br/><p>“For the most part, I have been the one to protect the lot of you, whether it was in Sky City or on Sky Quarter Rainbow, and even on the battleship. But now... the time has come for you to protect me. Here’s the plan, we’ll--” Before, he could finish speaking, Chen Manyao cleared her throat.</p><br/><p>“I need to leave now, Xiaochun....”</p><br/><p>“Huh?” Bai Xiaochun blurted.</p><br/><p>“It’s not that I don’t want to stay and help you out. But... you know the situation. I... I want to go home.” She gave him a profound look that seemed to say she didn’t wish to part with him. It even contained other, unique implications. A long moment passed. Then she sighed and took a curtseying bow.</p><br/><p>“We’ll meet again if destiny will have it....” With that, she turned and disappeared into East Sea City. Although her departure was a bit sudden, it wasn’t completely unexpected to Bai Xiaochun. He knew that her home lay beyond the Great Wall, and that one of main reasons for coming with him was because she wanted to return there. She had said as much even back in the River-Defying Sect.</p><br/><p>Bai Xiaochun sighed and looked over at Song Que and Master God-Diviner. Just when he was about to explain his plan to them, Song Que snorted coldly. Looking around at East Sea City, as well as the lands beyond, he thought to himself, “This is the perfect place for me. I, Song Que, am the type of person who likes to live in the middle of extreme danger. The more brutal a place is, the more opportunities there will be for deadly training. That is the only way to get more powerful. This is my chance to crush Bai Xiaochun ten times over!”</p><br/><p>Heart surging with heroic aspirations, and face covered with a look of utter determination, he didn’t even deign to look at Bai Xiaochun as he said, “Bai Xiaochun, whether it was in the Blood Stream Sect, the River-Defying Sect, the Starry Sky Dao Polarity Sect, or on that battleship, I was never able to measure up to you.... But this time, in this place, I will finally surpass you. This is my last opportunity, and I won’t let it slip by!”</p><br/><p>With that, he transformed into a beam of light that shot off into the distance.</p><br/><p>“Que’er....” Bai Xiaochun said, his eyes wide, his body trembling. The scene which was playing out seemed very familiar.... Suddenly very nervous, he looked over at Master God-Diviner.</p><br/><p>“Master God-Diviner, you--”</p><br/><p>“Junior Patriarch... um... I don’t really want to part ways, but I’ve been given some assignments by the Hall of Defenders. Um... see you in ten years, alright?” Master God-Diviner looked a bit embarrassed, but was actually not being deceptive at all. The Hall of Defenders really had given him some assignments.</p><br/><p>After blinking a few times, Master God-Diviner clasped hands and bowed, then flew away.... As of this point, Bai Xiaochun was left standing alone with Gongsun Wan’er. She looked over at him, smiled faintly, then left.</p><br/><p>Bai Xiaochun looked around at the enormous East Sea City, stunned. Nothing looked familiar, and he felt completely alone, and at the same time, angry.</p><br/><p>He also couldn’t help but recall what had happened upon arriving at Sky City in the Starry Sky Dao Polarity Sect, how Song Que and the others all abandoned him....</p><br/><p>“Fine! Want to spread your wings? Go ahead. If you have what it takes, you can come looking for me later!” He was both furious and depressed, a mixture which actually got his fighting spirit quite worked up.</p><br/><p>“I'm definitely going to live it up here, and that’s when you people will realize that abandoning me for the second time was the worst mistake of your lives!” Bai Xiaochun really was very angry at how everyone had just disappeared without a trace, leaving him completely unprepared. Considering what had occurred last time, he had assumed that his Dao protectors would never again abandon him....</p><br/><p>“You eat my food, drink my alcohol, use my stuff!? Fine, you people just wait!” Gritting his teeth, he looked around, scowling on the verge of tears as he tried to decide what to do and where to go. That was when one particular group of six people who had been just about to leave changed directions and headed toward the lonely Bai Xiaochun.</p><br/><p>“Xiaochun!” someone called out. It was none other than Zhao Tianjiao. Bai Xiaochun turned and saw him, as well as Chen Yueshan, who were flanked by two male cultivators and two female cultivators. The two male cultivators were the very same followers of Zhao Tianjiao who had been so impressed by Bai Xiaochun recently.</p><br/><p>As for the female disciples, Bai Xiaochun didn't recognize them, but based on what Zhao Tianjiao had told him early on about Chen Yueshan, he assumed that they were the two good friends of hers who already lived in East Sea City.</p><br/><p>“Elder Brother Zhao,” Bai Xiaochun called out.</p><br/><p>Laughing heartily, Zhao Tianjiao landed next to Bai Xiaochun and clapped him on the shoulder. “What are you doing here alone? If you don’t have anything else to do, why not join us? It’s probably better to stick together anyway. I'm planning to go do a bit of sightseeing and eventually head out past the Great Wall.”</p><br/><p>Smiling faintly, Bai Xiaochun said, “I told my Dao protectors to go their own way. They have their own destinies, and I don’t wish to block their paths to the future. As for me, it’s only natural that I want to tackle the world on my own. Only in that way can my heart be as tranquil as the sky, and my mind as broad as the earth. That is the key to the Dao of the heavens!”</p><br/><p>Chen Yueshan landed next to Zhao Tianjiao, and although she was smiling as she looked at Bai Xiaochun, there was a hint of anger in her eyes. Clearly, Zhao Tianjiao had told her about all the things Bai Xiaochun had taught him.</p><br/><p>Zhao Tianjiao’s two followers immediately bowed with great respect toward Bai Xiaochun, whom they didn’t dare to offend in any way. As for Chen Yueshan’s two friends, they merely sized him up curiously.</p><br/><p>When Chen Yueshan spoke, her voice was soft and pleasant, “Junior Brother Bai, we were just about to leave, but Elder Brother Zhao was worried about you, so we came back to look for you. We were planning to go exploring a bit as well, and it's always safer to travel in numbers, so why don’t you join us?”</p><br/><p>Bai Xiaochun very much liked what he was hearing. Zhao Tianjiao laughed and grabbed his arm, leaving Bai Xiaochun incapable of refusing no matter how much he tried. With that, the group shot up into the air and left East Sea City.</p><br/><p>As soon as they left the city, Bai Xiaochun could tell that there was a difference in the spiritual energy, but it wasn’t very noticeable. After all, they were still very close to the Heavenspan Sea.</p><br/><p>What was noticeable was that the hard-packed soil outside the city was a blackish violet color. It almost looked like it was suffused with countless volumes of blood, making it very sinister in appearance.</p><br/><p>They also saw many craters, one of which had turned into a lake filled with black liquid.</p><br/><p>Chen Yueshan looked around at the blackish violet lands and said, “My father told me that from the time the Starry Sky Dao Polarity Sect was founded until now, the Great Wall has only been breached once. A huge army of Wildlands savages invaded, and the resulting slaughter caused rivers of blood to flow through the lands....”</p><br/><p>Bai Xiaochun already felt a bit uneasy. In addition to the odd-looking soil, there were also strange and terrifying flora and fauna. There were 25-meter-tall trees that, instead of foliage, had huge human heads growing at their tops. Any small creatures who happened to pass by the sinister-looking trees would instantly be gobbled up.</p><br/><p>At one point they happened to see a cloud of black, cottony seeds floating into the air off of a willow tree. When Zhao Tianjiao saw that, his expression flickered.</p><br/><p>“Let’s take the long way around,” he said. “Those are the larvae of bloodsoul ticks! If they get into your skin, they’ll burrow into your body and start feasting on your blood and soul! The only thing that can stop them are city-level spell formations! We would be powerless to defend ourselves!”</p><br/><p>Bai Xiaochun opened his third eye and instantly confirmed that they were indeed not floating seeds, but rather, densely packed insect larvae.</p><br/><p>Everyone was shaken, and quickly fled in the opposite direction. It took them a few days to pass by the area, and despite having avoided the tick larvae, Bai Xiaochun was still trembling in shock. Along their way avoiding the larvae, they had passed what at first appeared to be a pile of rotting bones, but was actually a flock of undead birds which stunk like carrion, and were indescribably ferocious-looking. Just as the flock of undead birds seemed to notice the group of cultivators, and was preparing to attack them, a crevice opened up in the seemingly empty ground beneath them. A powerful gravitational force erupted out, and the entire flock of undead birds was sucked into the crevice. As the crevice closed up, crunching and cracking sounds filled the air.</p><br/><p>By that point, Bai Xiaochun’s heart was pounding, and his face was as ashen as death.</p><br/>\n</div>"}