{"title": "Chapter 477: What Magical Items Were They?!", "id": 477, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-477-what-magical-items-were-they", "volume_title": "Volume 5", "body": "<h1>Chapter 477: What Magical Items Were They?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>One of the young guards was so confident in the level of his cultivation base that he didn’t even take out a defensive magical device. As the surrounding grandmasters continued to scorn Bai Xiaochun....</p><br/><p>The surfaces of two of the five weakened pill furnaces were suddenly covered with nothing but cracks. Apparently, the energy that had been building up inside them had reached a point that the furnaces couldn’t contain it anymore. Finally, both furnaces exploded.</p><br/><p>A wave of energy immediately burst out, filled with shockingly terrifying power. Shrapnel buzzed out in all directions like meteors, accompanied by a heaven-shaking, earth-shattering boom.</p><br/><p>As the energy wave spread outward, the air distorted, and brightly colored light flashed in heaven and earth. Everyone in the area felt their ears tingling with pain from the intense noise.</p><br/><p>The courtyard’s spell formation was instantly damaged, and although it wasn’t completely destroyed, several enormous holes were punched into it.</p><br/><p>As for the four young guards, their eyes went wide and their mouths opened, but they had no time to do anything else. In the blink of an eye, the energy wave from the two exploding pill furnaces was upon them.</p><br/><p>The three who had taken precautionary actions had it better off. Blood sprayed out of their mouths as they were blown back several hundred meters. There, they slammed into the ground, bones shattered and blood oozing out of their eyes, ears, noses, and mouths. Even their soul flames were flickering, as though their souls might be wrenched out of them at any moment.</p><br/><p>As for the fourth young guard, the cocky one who had failed to take out a defensive magical item, he screamed miserably as the energy blast picked him up and hurled him far off into the distance. No one could even tell where he landed....</p><br/><p>Things weren’t over yet, though. If those four young guards were affected in such a way, it almost wasn’t necessary to mention all of the grandmasters, none of whom had produced any defensive items at all. Despite being outside of the courtyard, they were incapable of fleeing, and as the energy wave continued to spread, miserable screams rang out as they were violently hurled backward.</p><br/><p>Blood sprayed out of their mouths, and their souls seemed to teeter unstably. Each and every one was injured without exception....</p><br/><p>Simultaneously, everything in the area began to shake, and quite a few nearby buildings collapsed. The power that was being unleashed right now was almost unimaginable!</p><br/><p>“This is impossible!!”</p><br/><p>“Heavens! Was that explosion really from a pill furnace?!?!”</p><br/><p>“How could this be happening? What did Bai Xiaochun do to that pill furnace? I've been concocting pills for my entire life, and I've never seen an explosion like that! That was more like some sort of deadly magical attack!!”</p><br/><p>Even as their shrieks rang out, the Armory continued to tremble, and numerous cultivators flew out into the open and looked in the direction of Bai Xiaochun’s residence, shocked expressions on their faces. Bai Xiaochun was quite frightened by what was happening. However, he had been retreating to begin with, and also had an incredibly powerful fleshly body, and furthermore, didn’t hesitate to unleash some frigid qi to protect himself. As such, he was unharmed.</p><br/><p>Even he had been completely unaware that his newly developed medicine formula would cause an explosion of this scale. It was almost on the same level as an attack by a Nascent Soul cultivator.</p><br/><p>Furthermore, the Soul Convergence Pills were designed to affect souls, and therefore, everyone affected felt as if their souls were about to be ripped out of their bodies. Many of them were now staring ahead blankly, as if they had lost the ability to even think.</p><br/><p>And that was the result of only two exploding pill furnaces. It was easy to imagine what could happen if more of them exploded. Most likely, the people in the area would either be ripped to shreds, or at least, sustain incredible damage to their souls.</p><br/><p>“This... this....” A look of blank shock could be seen on Bai Xiaochun’s face as he looked at the remaining three pill furnaces. Cracks were spreading out on their surfaces, and energy was continuing to build up inside of them. Clearly, they were about to explode. Gasping, Bai Xiaochun began to back up.</p><br/><p>It was in that instant that an enraged roar filled the air.</p><br/><p>“Bai Xiaochun!!!” It was like a deafening clap of heavenly thunder that shook everything in the area. Simultaneously, a black-clad figure suddenly teleported into the area from off in the distance.</p><br/><p>It was none other General Bai Lin of the Skin Flayers!</p><br/><p>Feeling both wronged and crestfallen, Bai Xiaochun blurted, “You can't blame me! I warned you about this!”</p><br/><p>After all, he really had offered a warning, only to be disbelieved....</p><br/><p>Moments before, Bai Lin had been on the wall, offering support to the troops as they fought. Because someone had tampered with the Underworld River, there were currently boundless amounts of vengeful souls outside of the Great Wall. The five legions were under a lot of pressure, especially because necromancers had been spotted out in the enemy forces. It was for that very reason that Bai Lin had personally taken charge of the battle.</p><br/><p>However, before the necromancers could make a move, a huge explosion had rocked the Armory, sending out an energy blast that shocked even Bai Lin. Alarmed, he had teleported over, to be met with a scene of complete disaster. Everyone in the area was coughing up blood, and in addition to that, there were three severely damaged pill furnaces that were clearly on the verge of detonating.</p><br/><p>Despite being enraged, there was no time for thought or planning on Bai Lin’s part. Roaring, he grabbed the three pill furnaces, then teleported up to the Great Wall and hurled them out toward the other side.</p><br/><p>Outside of the Great Wall, countless vengeful souls blotted out the sky because of their sheer numbers. Many of them were converging together to form soul emperors that howled at the tops of their lungs as they charged, seemingly oblivious to their own existence or destruction. As the shimmering shield rising up from the wall rippled under the force of the attacks, the cultivators of the five legions poured all the power they could into their magical cannons, sending destructive beams of light out without cease. Unfortunately, there were just too many souls, and the resistance of the cultivators was already proving to be somewhat futile.</p><br/><p>There were also large numbers of savages intermingled amidst the souls, who used their formidable physical bodies to viciously fight their way toward the wall, where they would unhesitatingly self-detonate. As a result, casualties were rising among the five legions.</p><br/><p>It was in that moment that the three scarlet pill furnaces, each one of them roughly three meters tall, sailed through the air like suns, crushing anything in their path.</p><br/><p>Then, they landed on the ground, so many cracks spreading out on their surfaces that it seemed impossible for them to last any longer without exploding!</p><br/><p>The savages seemed shocked that they were being attacked by pill furnaces, which were objects completely unfamiliar to them. One of the savages, who was several dozen meters tall, snorted coldly and flew through the air toward the nearest furnace, upon which he unleashed a mighty fist strike.</p><br/><p>In that instant, the combined forces inside and outside of the furnace proved too much for it to sustain. A boom echoed out that could shake heaven and earth as the furnace exploded, sending burning shrapnel out all over the battlefield. As everything in the area shook violently, countless vengeful soul screamed, and many of the nearby beasts which couldn’t avoid the blast were instantly lit on fire.</p><br/><p>The savage who had just struck the pill furnace screamed as the energy overwhelmed him, wiping out most of his body as he was flung backward.</p><br/><p>However, the explosion itself was not the most powerful aspect of the blast. The medicinal strength of the Soul Convergence Pill was instantly unleashed into a 3,000-meter area, causing all of the vengeful souls to tremble as they were latched onto by a powerful gravitational force. Then, the energy shockwave rolled past, shredding them to bits!</p><br/><p>Everything happened so quickly that the savages and vengeful souls had no time to react. Moments later, the other two pill furnaces exploded, and in the briefest of instants, deafening booms and shrill screams filled the entire battlefield.</p><br/><p>Numerous savages were slain, and countless beasts and souls were ripped apart. Seas of flame erupted out, and enormous, shocking craters were torn into the ground....</p><br/><p>As the blood and gore spread out in all directions, the surviving savages looked around in shock, and even the mostly unintelligent vengeful souls seemed terrified....</p><br/><p>“What were those magical items!?!?”</p><br/><p>“How could this be happening? I've never seen anything like this!” One by one, the savages turned to look at the Great Wall, expressions of profound fear on their faces.</p><br/><p>The truth was that they weren’t the only ones to react in such a way. The cultivators on the Great Wall, not only the Skin Flayers, but also the cultivators from the other four legions, were dumbstruck.</p><br/><p>“What were those things...?”</p><br/><p>“How come they seemed like pill furnaces?”</p><br/><p>“How is that even possible? How could pill furnaces release power like that!?”</p><br/><p>“I'm pretty sure that General Bai Lin of the Skin Flayers personally threw them out! Could it be some sort of newly invented magical item?!?!”</p><br/><p>Everyone was shaken, and in fact, Bai Lin was so shocked that his anger completely dissipated. He stood there looking out blankly at the craters outside of the Great Wall, and the terrified souls and savages, and after a moment, he began to pant. Then, his eyes began to glow with unprecedented brightness, and even joy.</p><br/>\n</div>"}