{"title": "Chapter 489: Assassination Attempt!", "id": 489, "volume": 5, "url": "http://boxnovel.org/a-will-eternal-chapter-489-assassination-attempt", "volume_title": "Volume 5", "body": "<h1>Chapter 489: Assassination Attempt!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A huge boom echoed out as the soul cultivators’ self-detonation sent a huge shockwave rolling out in all directions. At the same time, an illusory figure appeared within the explosion. It was a gray specter riding a black soul horse, and it was moving with speed that far outmatched that of the soul cultivators from moments before. In the blink of an eye, it pierced through the shield and was bearing down on Bai Xiaochun!</p><br/><p>“Quasi-Deva Realm necromancer soul!!” Everything happened so quickly that everyone was rooted in place in shock, with the exception of Bai Lin, who immediately leapt to intercept the enemy. However, the incoming necromancer soul was already resigned to being destroyed, and was holding nothing back in his attack. Stretching his right hand out, he pointed his finger at Bai Xiaochun, sending a green stream of energy out toward him. Even Bai Lin attacking with all the power he could muster only slowed down the green energy, and it was still moving so quickly that no Core Formation cultivator would be able to evade it.</p><br/><p>Bai Xiaochun’s face drained of blood as a sensation of deadly crisis filled him. In that dangerous moment, he roared at the top of his lungs and drew upon the power of the Undying Tendons in both of his legs to fly backward with speed that surpassed the Core Formation level. After putting some distance between himself and the stream of green energy, he drew upon his frigid qi to teleport 300 meters away. Only by doing all of these things was he just barely able to extricate himself from the danger!</p><br/><p>The spot he had once occupied was pierced through by the green energy. Sadly, all of the Skin Flayers within several hundred meters of that spot who were hit by the fluctuations of the energy were instantly transformed into pools of blood....</p><br/><p>None of them even had a chance to scream before they were killed. With the exception of Bai Lin and Bai Xiaochun, everyone was killed instantly. As for the Skin Flayers beyond that radius, their faces went ashen in terror.</p><br/><p>Bai Xiaochun coughed up a mouthful of blood. His bones were all on the verge of being crushed, and even his five yin organs and six yang organs were almost destroyed. And that was just from the fluctuations rolling off of the attack itself!</p><br/><p>Looking around at the pools of blood that were all that remained of the nearby cultivators, Bai Xiaochun’s heart trembled.</p><br/><p>“You--” Before he could say anything else, he coughed up another mouthful of blood. Thankfully, he had a powerful fleshly body and a Gold Core cultivation base. Because of that, he had avoided death. And yet, he still ended up being seriously injured.</p><br/><p>Spitting more blood out of his mouth, he looked over at the illusory necromancer, who was just now being wiped out by the gaze of the enormous eye on the tower.</p><br/><p>Even as the illusory necromancer was destroyed, a look of deep confusion could be seen in his eyes that said, <em>How did he survive? How did he escape death!?!</em></p><br/><p>Originally, the necromancer had assumed that even if Bai Xiaochun managed to avoid the initial attack, being nothing more than a Core Formation cultivator, he would definitely be killed by the resulting fluctuations.</p><br/><p>After all, that necromancer had a quasi-Deva Realm cultivation base, and plus, there had been absolutely no indication that there would be an assassination attempt. In order to guarantee success, the Wildlands had sacrificed more than a hundred savage giants as a distraction, as well as three soul cultivators. In addition to all of that, the assassin was actually the soul of a powerful necromancer. All of that had been done just to try to kill Bai Xiaochun!</p><br/><p>The mere sight of Bai Xiaochun caused all Wildlanders to seethe with hatred, and yet, they had met with nothing but defeat in their effort!</p><br/><p>Sweat was currently pouring down Bai Xiaochun’s forehead. The sensation of imminent death moments ago had been incredibly intense. The three soul cultivators had been extremely powerful, with Nascent Soul cultivation bases. As for the necromancer, he was on the same level as Bai Lin, half a step into the Deva Realm. Because he existed as a soul body, and also had some special techniques on his side, he had been able to get through the shield to deliver a single attack.</p><br/><p>If Bai Lin hadn’t been there, Bai Xiaochun wouldn’t have been able to evade the attack even if he was capable of greater speed than before!</p><br/><p>Bai Lin had a very unsightly expression on his face. Bai Xiaochun had almost been killed right next to him, which was in and of itself a bald-faced provocation. Bai Xiaochun was extremely important to him; perhaps if he had already concocted a large number of Soul Convergence Pills, his loss could be accepted. But at the moment, he hadn’t even started working. For him to die now would have been a huge blow to the cultivators of Great Wall City.</p><br/><p>In his anxiety, he rushed over to Bai Xiaochun and handed him a medicinal pill that glowed with violet light.</p><br/><p>“Take this Godly Vestige Pill!”</p><br/><p>With a single whiff of the pill’s medicinal aroma, Bai Xiaochun was able to identify it as a holy pill that was designed to heal injuries. Without hesitation, he popped it into his mouth, and an instant later, his entire body thrummed with spiritual power and life force. At the same time, all of his wounds and injuries began to fade away.</p><br/><p>It was a miraculous pill the likes of which Bai Xiaochun had never seen before, but he could tell that it was something incredibly valuable. In fact, Bai Lin probably kept it on hand as a life-saving contingency plan for himself. However, at the moment, Bai Xiaochun wasn’t interested in getting more information about that. Turning to Bai Lin, he said, “General Bai, when you invited me to the top of the Great Wall to observe the fighting, you said over and over again that it would be safe!” </p><br/><p>Bai Xiaochun was still feeling a bit jumpy and frightened, so as soon as he finished speaking, he backed a bit further away from the edge of the wall.</p><br/><p>Bai Lin felt horrible. Clasping hands apologetically to Bai Xiaochun, he then glared out at the battlefield with killing intent flickering in his eyes.</p><br/><p>Of course, Bai Xiaochun wasn’t angry at Bai Lin. Were it not for Bai Lin stepping in to help, Bai Xiaochun might not even be alive at the moment. “Can necromancers really just go right through the Great Wall’s shield?” he asked.</p><br/><p>Although Bai Xiaochun’s question had been worded rather vaguely, the point was obvious: he had almost just died. He usually maintained vigilance wherever he went, but because of the spell formation shield protecting the Great Wall, had always assumed that he was safe.</p><br/><p>After a moment of silence, Bai Lin replied, “Most people can't. In fact, necromancers with physical bodies can’t either. Only in soul form can they do such a thing. However, after passing through the shield, the eye on the tower will detect them, and they will be killed within three breaths of time. Therefore, very few necromancers would choose to do such a thing.” </p><br/><p>Forcing his breathing under control, Bai Xiaochun glared out at the battlefield beyond the wall. At the moment, the savages were retreating, as was the tide of souls.</p><br/><p>“Xiaochun, please forgive my carelessness today,” Bai Lin said, turning back to look at Bai Xiaochun. “Why don’t you come with me to see the sect liaison? All you have to do is say the word to him, and any resources you need will be yours.”</p><br/><p>Bai Xiaochun immediately understood Bai Lin’s implication. Bai Lin was giving him an opportunity to stuff his pockets as a way of making up for what had happened. Therefore, he suppressed his anxiety over the events which had just occurred, cast a final hateful glare at the savages, and then followed Bai Lin away.</p><br/><p>Soon, they were back in the city, and heading to the Starry Sky Dao Polarity Sect liaison office. Considering his status, Bai Lin didn’t need to act polite. Striding up to the entrance, he barked, “Song Yiduo, get out here right now!” </p><br/><p>Moments later, a fat, middle-aged man hurried out, huffing and puffing. Clasping his hands in greeting, he said, “What do you need? Just say the word.” </p><br/><p>Bai Lin looked over at Bai Xiaochun and nodded, then stood there looking thoughtfully up into the sky.</p><br/><p>At the moment, Bai Xiaochun felt that the best way to deal with his anxiety was to crush it with cultivation resources. Therefore, he didn’t hesitate to say, “I need 5,000 earthspirit tubers, and each one needs to be at least 500 years old!”</p><br/><p>Song Yiduo shivered like a wild boar whose tail had just been stepped on. Yelping, and fat jiggling, he replied, “500 years old? 5,000 of them? That’s impossible!” </p><br/><p>Ignoring him, Bai Xiaochun continued, “I also need skydragon plums, seven seas ginsengs, wyvern scales, and godglory herbs. 10,000 each!”</p><br/><p>Song Yiduo was about to respond when Bai Xiaochun cut in and added, “Plus, fuel for nine-colored flame. A hundred portions!”</p><br/><p>Song Yiduo’s anger flared. “Impossible! I don’t have those things on hand! Who could?!”</p><br/><p>Completely ignoring Song Yiduo, Bai Xiaochun continued, “Also, I need 10,000 bottles of spirit alcohol designed to replenish the cultivation base!</p><br/><p>“And a hundred Nascent Soul Pills!</p><br/><p>“Oh right. That -- what’s it called? -- Godly Vestige Pill! I want a hundred of them too!”</p><br/><p>By this point, even Bai Lin was getting a bit nervous. From what he could tell, it would probably require sending a message to his grandfather to acquire such a collection.</p><br/><p>As for Song Yiduo, he was wailing inwardly with grief. He was in charge of all the day-to-day affairs in Great Wall City, and if expenditures got too high, he would be punished. Conversely, if he didn’t spend enough to keep the five legions happy, they would get angry.</p><br/><p>Bai Xiaochun waved his hand dismissively and looked over at Bai Lin. After a moment of thought, Bai Lin gave Song Yiduo a wry smile and then dragged him off to the side. First, he started out whispering, but then got angry, and finally, smashed his fist into a nearby ornamental rock, scaring the daylights out of Song Yiduo. Then the two of them walked back to Bai Xiaochun.</p><br/><p>With a wry smile, Bai Lin hustled Bai Xiaochun away, worried that he would start making more demands. “He couldn’t get you the nine-colored flame fuel or the Godly Vestige Pills even if you killed him. Everything else, he can handle. As for the Nascent Soul Pill, I need to think about how to pull that off....”</p><br/>\n</div>"}