{"title": "Chapter 504: The Five Legions Compete", "id": 504, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-504-the-five-legions-compete", "volume_title": "Volume 6", "body": "<h1>Chapter 504: The Five Legions Compete</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The burly man wore a suit of heavy armor, and looked almost like a mountain. His eyes flickered with a brutal gleam as he glared at the old man and the middle-aged cultivator.</p><br/><p>The generals of the Black Demons and the Bane Stars glared back at him, and it almost looked like a fight might break out at any moment.</p><br/><p>“Ummm?” Bai Xiaochun said, blinking a few times. Although he was very pleased by the fact that the generals of these three legions were competing over him, he had to conclude that the offer from the Savage Butcherers seemed the best of them all.</p><br/><p>However, it was in that very instant that another cold snort echoed out, along with a blast of wind that caused intense rumbling sounds to fill the air. Then, numerous bolts of lightning descended from the sky, which swirled together into the form of a white-haired cultivator.</p><br/><p>In the blink of an eye, he was standing there in Bai Xiaochun’s courtyard, lightning crackling beneath his feet, transforming the entire courtyard into something like a lake of lightning.</p><br/><p>Of course, the lightning didn’t harm Bai Xiaochun or his men. However, the faces of the other generals flickered as they were forced to rotate their cultivation bases to keep themselves from harm.</p><br/><p>“What do you think you’re doing, Master Soul Slaughterer?!” shouted the burly man from the Savage Butcherers.</p><br/><p>“What am I doing? Competing with you people, obviously. Grandmaster Bai, why not join the Soul Slaughterers? I can guarantee you ten years of safety, and fifty times your current compensation. Plus, I can ensure that you will be rich and taken care of after you go back to the sect. I’ll give you access to all the medicinal plants and other resources you need, and I’ll even give you a priceless Nascent Soul Pill! All you have to do is nod your head yes, and I’ll hand the pill over immediately!” Even as he spoke, he lifted his right hand, which was holding a crystalline medicinal pill!</p><br/><p>The pill instantly erupted with a shocking medicinal aroma that Zhao Long and the others had no trouble identifying as that of a Nascent Soul Pill. Nascent Soul Pills were one of the most important types of cultivation resources in existence at the Great Wall. They were even hard to get in the Starry Sky Dao Polarity Sect, and extensive records were kept on their distribution. They were second in value only to deva beast souls.</p><br/><p>In fact, most people actually valued them more than deva beast souls. After all, despite the fact that using deva beast souls to step into the Nascent Soul stage would lead to incredible power, it would only work if you possessed all five souls of metal, wood, water, fire, and earth.</p><br/><p>However, any cultivator in the great circle of the Core Formation stage would have a good chance of achieving a breakthrough with a Nascent Soul Pill. Although breaking through using that method came with certain downsides, such as being less powerful than someone who used deva beast souls, it was still the Nascent Soul stage!</p><br/><p>And besides, very few people would be able to build up a full collection of five elements deva beast souls.</p><br/><p>Not even Bai Xiaochun had been able to get his hands on a Nascent Soul Pill since he had arrived in Great Wall City. As such, he knew how valuable they were, and here, this white-haired cultivator was holding one of them in his hand. All he had to do was nod his head, and he could have it!</p><br/><p>How could Bai Xiaochun not be excited about that? His eyes were burning with passion as he looked at the pill; although he didn’t actually plan to step into Nascent Soul using that method, the pill could still be very useful. With it, he could ascend to the great circle of Core Formation almost immediately!</p><br/><p>That would definitely save him a lot of time.</p><br/><p>The other three generals looked at the Nascent Soul Pill, their hearts trembling. It wasn’t that they didn’t have Nascent Soul Pills of their own to offer; they did. However, such pills were so valuable that they couldn’t help but hesitate about what to do.</p><br/><p>The more Bai Xiaochun looked at that Nascent Soul Pill, the brighter his eyes shone. Taking a deep breath, he glanced over at the other three silent generals, and decided that if he hesitated any longer, he might lose this chance. Just when he was about to nod, an enraged shout ripped through the air.</p><br/><p>“Absolutely disgraceful! Screw off, fools!! Dammit, how dare the four of you bastards show up here in Skin Flayers territory and try to steal my people!</p><br/><p>“That’s nothing more than a Nascent Soul Pill! Ignore them, Xiaochun! I’ll give you <em>three </em>Nascent Soul Pills!!” It was none other than Bai Lin, his voice cracking like thunder as he appeared in front of Bai Xiaochun to stare furiously at the four other generals.</p><br/><p>As far as he was concerned, the fact that they had shown up in his territory to brazenly attempt to recruit one of his men was completely embarrassing. Thus, his murderous aura raged as he waved his sleeve, sending a blast of air rumbling toward the other generals.</p><br/><p>Shocked, Bai Xiaochun backed up, and as for Zhao Long and the others, they had long since fled.</p><br/><p>The four generals’ faces fell; clearly, none of them had expected Bai Lin to actually unleash an attack. They immediately drew upon the power of their cultivation bases, and were about to start fighting back, when all of a sudden, a beam of light shot out from the enormous eye atop the pagoda.</p><br/><p>The beam slammed down right in the middle of all five generals, forcing them to back away from each other. At the same time, Chen Hetian’s ancient voice echoed out with icy coldness.</p><br/><p>“You’re dismissed, all of you. The five of you are generals, so start acting like it!”</p><br/><p>Gritting his teeth, Bai Lin glared at the other four generals. The generals, fully aware that they were in the wrong, cleared their throats, then cast longing glances at Bai Xiaochun before turning and leaving.</p><br/><p>Bai Xiaochun blinked a few times, looked around, and then turned his attention to Bai Lin. Feeling a bit embarrassed, he said, “Um, they came looking for me....”</p><br/><p>Face grim, Bai Lin walked over to Bai Xiaochun.</p><br/><p>“Xiaochun, those four bastards are real tricksters. Don’t listen to them. You stay here with me. Don’t worry, I’ll keep you safe, and I’ll keep you supplied with whatever medicinal plants you need. Compensation won’t be a problem either, nor will Nascent Soul Pills!” With that, he winced a bit as he pulled two Nascent Soul Pills out of his bag of holding and handed them over to Bai Xiaochun.</p><br/><p>“I only have two at the moment. Take them. With a bit of time, I can come up with a way to get a third.” Inwardly, Bai Lin was cursing at the fact that he now needed to come up with yet another Nascent Soul Pill. The truth was that they weren’t impossible to acquire, but it always took a long time to save up enough resources to buy one.</p><br/><p>Bai Xiaochun took the two Nascent Soul Pills, his heart quivering with anticipation. Then he looked back at Bai Lin, suddenly struck with how well the general was treating him. And then he thought about how he would be continuing to serve as the man’s subordinate for some time, and his expression suddenly turned very serious. Shaking his head, he said, “What kind of person do you think I am, General?! If I wanted to join one of the other legions, I could have agreed before you showed up. General, don’t you understand why I was buying time?</p><br/><p>“I can’t afford to provoke those four generals! Therefore, I also couldn’t simply refuse them. And that was why I was waiting for you to come take control of the situation!” With that, he flicked his sleeve. Looking more serious than ever, he continued, “General, you have treated me with great kindness. How could I possibly cause difficulties for such a benefactor? Two Nascent Soul Pills are valuable enough on their own. I won’t take a third from you even if you offer it!” With that, he clasped hands and bowed deeply in salute, feeling very pleased with himself. From what he could tell, his words just now had brimmed with righteous intent, and had been worded perfectly.</p><br/><p>Regardless of how much Bai Lin truly trusted what Bai Xiaochun had just said, he was still moved. After looking at Bai Xiaochun for a long moment, he realized that he was definitely the type of person who knew how to act properly in front of others. Taking a deep breath, he said, “Xiaochun, if possible, try to build up enough battle credit over the next ten years to become a major general!</p><br/><p>“If you can reach that rank, your status and position will be completely different. Even your River-Defying Sect’s position will change for the better. When major generals return from the five legions to the sect, they become elders of the Hall of Steel Veins. That’s a status that surpasses the position of anyone in any of the other halls!</p><br/><p>“If you can reach that level, you would be in one of the most powerful groups in the entire Starry Sky Dao Polarity Sect! As long as you didn’t ever betray the sect, you could do almost anything you wanted!” Bai Lin didn’t offer any more detailed explanation than that. After making a few more vague statements, he turned and left.</p><br/><p>Afterward, Bai Xiaochun thoughtfully walked back into his room. Then he pulled out his command medallion and checked how much battle credit was required to be promoted to major general, and gasped.</p><br/><p>“That much...?”</p><br/><p>He was left almost completely speechless. He had no idea how the other major generals had ever managed to get promoted; it took more than a hundred times as much battle credit as it took to get promoted to colonel. That basically implied that it would take a hundred battles such as the one he had just fought in to get that promotion.</p><br/><p>“Well forget that, then,” he thought. “I’ll just stick with being a colonel.” Feeling a bit discouraged, he shook his head and put his command medallion away. Then he pulled out a Nascent Soul Pill, whereupon his eyes yet again began to shine.</p><br/><p>“The great circle of Core Formation....” Trying to keep calm, he set up some restrictive spells around his residence, and then told Zhao Long and the others that he would be going into secluded meditation. By the time all his preparations were complete, it was deep into the night.</p><br/><p>When everything was ready, he slowly put one of the Nascent Soul Pills into his mouth!</p><br/><p>Instantly, he began to tremble, and his mind filled with rumbling sounds. Then, shocking energy of heaven and earth surged through him, converging in the location of his Gold Core.</p><br/>\n</div>"}