{"title": "Chapter 503: Promotion To Colonel!", "id": 503, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-503-promotion-to-colonel", "volume_title": "Volume 6", "body": "<h1>Chapter 503: Promotion To Colonel!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun almost couldn’t believe what he was seeing. In the lands of Heavenspan, the most advanced spirit enhancement he had ever seen was tenfold.</p><br/><p>But now, in a completely unexpected turn of events, he was looking at magical items which had been enhanced far beyond that.</p><br/><p>“There’s something strange going on. Could it be... that the Wildlands harbors some mysterious secret regarding spirit enhancement?!” Even as he pondered the issue, he subconsciously cast his senses toward the turtle-wok inside his finger.</p><br/><p>Most telling of all about the whole thing was that Bai Lin and the other most powerful experts didn't seem to find the matter unusual at all. It was almost as if they were used to seeing necromancers using such spirit enhanced magical items. Furthermore, their eyes burned passionately at the sight of them, and they attacked with greater fervor than before, clearly in the hopes of getting their hands on one of the enhanced treasures.</p><br/><p>Apparently, for the generals and major generals, one of the key things they could gain from battle wasn’t battle credit, but rather, the spirit enhanced treasures of the necromancers.</p><br/><p>The fighting went on for another month, after which the Wildlands finally retreated.... The Great Wall forces didn’t chase after them.</p><br/><p>After all, the Great Wall had suffered extensive losses in this battle as well.</p><br/><p>Neither Chen Hetian nor the red-garbed young woman came out on top in their conflict, and in fact, both received similar injuries. It was only in the moment that the Wildlands armies began to retreat that Bai Xiaochun finally got a good look at the young woman in red.</p><br/><p>She wore a long red garment and had flowing black hair. She seemed very young, and was beautiful in a way that surpassed even Chen Manyao.</p><br/><p>Of greater significance, however, was her cultivation base, which made her radiate an air of nobility that would cause anyone who looked at her to feel their heart pounding in their chest.</p><br/><p>Of course, Bai Xiaochun didn’t really care about any of that. At the moment, he was looking glumly at Li Hongming, who had come to the Armory to visit Bai Xiaochun the very afternoon the fighting ended. Li Hongming had been a colonel to begin with, and still was, but had risen within the ranks of the colonels thanks to his accumulation of battle credit during the fighting.</p><br/><p>“Xiaochun, you’re famous now! Completely famous!! According to the secret reports I saw, the Wildlands has increased the bounty on your head. Do you know what the reward is for your death?</p><br/><p>“A deva beast soul!! Although the reward is only one of them, and it’s not clear what type, that’s still something incredibly valuable. After all, if you can collect enough five elements deva beast souls to meet the requirements of metal, wood, water, fire, and earth, you can step into the Nascent Soul stage!!</p><br/><p>“Only people in the top 10 of the Wildlands Execution List have rewards like that attached to their names. Congratulations! Xiaochun... you’re already in the top 10!</p><br/><p>“The only people even close to you on that list are Nascent Soul cultivators. In fact, you are the only Core Formation cultivator in the top 30!</p><br/><p>“Devil Bai. That's what the Wildlanders call you now!!” Li Hongming was sincerely offering his congratulations to Bai Xiaochun, and had actually hurried over here just to tell him this news. However, Bai Xiaochun was left shaking in fear.</p><br/><p>“A deva beast soul as a reward....” Bai Xiaochun couldn’t help but gasp in shock as his heart began to pound. He could only imagine how badly the savages and soul cultivators in the Wildlands would want to kill him now.</p><br/><p>Li Hongming was left sighing continuously in his heart. When he thought back to the time Bai Xiaochun had first arrived, it would have been impossible to predict that he would become so famous both inside and outside the Great Wall.</p><br/><p>The two of them chatted a bit more about some random things, until eventually Li Hongming could sense that Bai Xiaochun was feeling down. Finally, he patted his shoulder and left.</p><br/><p>Afterward, Bai Xiaochun sat down and sighed.</p><br/><p>“Ah, whatever. No matter where I go, I always put on a breathtaking performance. Ai.... Worst case scenario, I just don’t go outside the Great Wall after this. I’ll stick around until the ten years are up, and then head back to the sect.” Only by comforting himself in this way could he somewhat still his pounding heart.</p><br/><p>And yet, his anxiety just wouldn’t go away. Not only was he worried about the Wildlands soul cultivators trying to get the bounty on his head, but he also couldn’t keep from being nervous about the other cultivators in the five legions. After all, his head was very valuable now....</p><br/><p>Thankfully, he didn’t have to stew in his worries for too long. Now that the fighting was over, the promotions were being handed out. Many cultivators were being promoted from ordinary soldiers to the rank of lieutenant or captain.</p><br/><p>As for Bai Xiaochun, he was one of only two captains who were promoted to colonel!</p><br/><p>Now that he was a colonel, he could occupy both the Armory and his own personal colonel’s command center. Furthermore, in addition to Zhao Long and the original battalion of 100 men... he would now command an additional 900 cultivators!</p><br/><p>It took a huge amount of battle credit to earn a promotion from captain to colonel, which made such promotions very uncommon as a result of only one battle.</p><br/><p>The other captain to receive a promotion to colonel had already been stationed in Great Wall City for a hundred years. The only reason he had finally been able to get his promotion was because he was about to break through into the great circle of Core Formation, and had risked his life in countless battles.</p><br/><p>The truth was that despite how many soul cultivators Bai Xiaochun had cut down, and regardless of the fact that he had slaughtered a tribal chief, he still shouldn’t have had enough battle credit to get promoted. The only reason he was now a colonel was because of his Soul Convergence Pills and pill furnace bombs!</p><br/><p>In that fashion, he had advanced by leaps and bounds, and been promoted to colonel in one fell swoop!</p><br/><p>As an apothecary, he had invented Soul Convergence Pills, which ended up changing the course of the battle. Furthermore, his exploding treasures also shocked everyone near and far. And then there was his battle prowess. After cutting down numerous soul cultivators, and even a tribal chief, it was clear that his fleshly body was similar to the Nascent Soul level. And although he wasn’t a true Nascent Soul expert, he could obviously do things that ordinary Core Formation cultivators could not!</p><br/><p>In addition to all that, he had saved the lives of over 10,000 soldiers, causing countless cultivators to revere him.</p><br/><p>To top it all off, he was now in the top 10 on the Wildlands Execution List!</p><br/><p>All of these various honors and glories were like a shockwave that rolled through all of Great Wall City. In addition, it caused the generals of the other four legions to suddenly view Bai Xiaochun as being vastly more important than he had been before.</p><br/><p>Whoever had Bai Xiaochun in their legion would not only have a valiant warrior, but would also have Soul Convergence Pills and exploding pill furnaces. Plus, they would have someone who thousands upon thousands of other cultivators revered. He was really a comprehensive package.</p><br/><p>The generals of the other four legions were quite excited, and therefore, it was no surprise that on the evening in which Bai Xiaochun was promoted to colonel, a bright beam of light suddenly appeared outside of the Armory.</p><br/><p>Within that beam of light was an old man wearing a pitch-black suit of armor. He pulsed with a black energy, and had the illusory image of a fierce tiger floating above his head. His eyes were bright red, and he seemed to pulse with demonic qi. Overall, he made a very terrifying sight.</p><br/><p>In addition to all that, he had a very profound cultivation base, being half a step into the Deva Realm. Heaven and earth trembled upon his arrival, and all of the cultivators in the Armory looked up and then clasped hands in salute.</p><br/><p>“It's the general of the Black Demons! Greetings, General!”</p><br/><p>Zhao Long and his compatriots were shaken, and as for Bai Xiaochun, he had been in the middle of meditating when he felt the sudden pressure in the area. Walking out, he saw the general of the Black Demons hovering in midair.</p><br/><p>Bai Xiaochun had never interacted personally with the man; they had only seen each other on the battlefield. Feeling a bit surprised to see him here, Bai Xiaochun clasped hands and bowed.</p><br/><p>The old man laughed heartily as he landed in front of Bai Xiaochun, his eyes shining with approval and admiration.</p><br/><p>“Grandmaster Bai, why don’t you join the Black Demons? Whatever compensation they’re giving you here, I’ll triple it!”</p><br/><p>Bai Xiaochun’s jaw dropped. “Uh....” </p><br/><p>He had a lot of freedom in the Skin Flayers, and hadn’t planned to leave. However, this general’s eyes burned as if with fire; clearly, he really wanted Bai Xiaochun to agree to the proposition. Bai Xiaochun hesitated for a moment, and just when he was about to say something else, another beam of light appeared in the sky. Before anyone could say a word, a new voice rang out.</p><br/><p>“Don’t listen to him, Grandmaster Bai. Why don’t you join the Bane Stars? Not only will I offer you ten times your current compensation, but I can also guarantee that you won’t be injured by the Wildlanders even a single time. I definitely won’t let you end up in any critical situations such as those which unfolded before!” Even as the words rang out, a middle-aged man in a crimson robe appeared.</p><br/><p>He was very attractive, and had a warm smile that lacked even the hint of a bad temper; he was almost humble-looking. However, Bai Xiaochun had seen him fight in battle, and knew that his murderous aura was beyond comparison to anyone except for Bai Lin.</p><br/><p>“You’ll guarantee my safety?!” Bai Xiaochun blurted, his heart suddenly pounding. He had just been pondering the issue of how dangerous things were, so to hear the general of the Bane Stars make an offer like that instantly got him excited.</p><br/><p>When the general of the Black Demons saw Bai Xiaochun’s expression, he instantly started to get nervous, and was just about to insert some words when, all of a sudden, a cold snort filled the air.</p><br/><p>“The Black Demons and the Bane Stars are all stingy tightwads, Grandmaster Bai. What’s the use of joining miserly legions like theirs? If you come to the Savage Butcherers, I’ll increase your compensation by twentyfold. I’ll also guarantee your safety, <em>and</em> get you <em>any</em> medicinal plant you need. The same goes for spirit alcohol and medicinal pills. Whatever cultivation resources you require will be at your disposal!” A third beam of light appeared, and as it touched down, a tall, burly man came into view.</p><br/>\n</div>"}