{"title": "Chapter 516: Kill Me First!", "id": 516, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-516-kill-me-first", "volume_title": "Volume 6", "body": "<h1>Chapter 516: Kill Me First!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The old man’s face was a mask of grief, and his heart was filled with ceaseless venomous curses toward Bai Xiaochun. Even though he realized that he was holding a Soul Convergence Pill, he hadn’t yet made any connection to Bai Xiaochun himself. After all, while not every single cultivator in the five legions was armed with Soul Convergence Pills, enough were that they could be considered common.</p><br/><p>“Damned monkey! You’re definitely not going to die a good death!!” Gritting his teeth, he edged closer to the pit, where he looked back to see Bai Xiaochun and the other cultivators waiting nervously, clearly ready to flee at a moment's notice. Immediately, the old man’s heart filled with disgust.</p><br/><p>And yet, he had no other options in front of him. If he did as Bai Xiaochun asked, maybe he would get out of the situation alive. But if he caused problems, he could theoretically revel in the thought of his captors being killed, but he himself would also perish.</p><br/><p>As he stood there at the edge of the pit wavering back and forth about what to do, Bai Xiaochun impatiently cried out in a hushed voice, “Hurry up! We’re all waiting on you!”</p><br/><p><em>Yeah, well keep waiting, bitch!</em> the old man cursed inwardly. Clenching his jaw, he toed the edge of the pit, and was just preparing to jump in when the vengeful souls inside suddenly stopped floating around and then turned to look at him.</p><br/><p>The old man’s scalp was tingling so hard it felt like it might explode, and his mind was spinning into a complete blank. Finally, he let out a shout and simultaneously crushed the medicinal pill. Before any of the souls could do anything, a massive gravitational force sprang out.</p><br/><p>Instantly, more than 10,000 vengeful souls were sucked up, without even a chance to fight back. In the blink of an eye, they became a soul sphere, which the soul cultivator grabbed. However, the other vengeful souls were now riled up, and began howling, even the ones in the depths of the pit. Then, they began to pour out into the open like a massive tempest.</p><br/><p>The old soul cultivator shrieked as he spun around and began to flee. Behind him, a cloud of souls rose up into the air, tens upon tens of thousands of them.</p><br/><p>“Help me!” the old man shrieked as he fled. Feeling angrier than ever at Bai Xiaochun and his men, he headed straight in their direction.</p><br/><p>The old man was quick, but Bai Xiaochun was quicker. In almost the same moment that the old man crushed the Soul Convergence Pill, he and his men began to flee in the opposite direction.</p><br/><p>The old man saw this, but had no other option than to push forward with greater speed. Sadly, his cultivation base had already been sealed and limited, making things very difficult. Behind him, a sea of souls bore down, their howls echoing out in all directions.</p><br/><p>The sensation of deadly crisis that filled him, and the despair, made it so that the old man couldn’t hold back his curses.</p><br/><p>“You won’t die a good death, you monkey! If I become a ghost, I’ll haunt you to the end of your days!!”</p><br/><p>The cultivators were trembling at what they saw, and Bai Xiaochun’s heart was pounding as he fled. As he looked over his shoulder, what he focused on was not the old man, but the huge sea of souls.</p><br/><p>“1,000,000... no, wait, 10,000,000... no wait.... Heavens, how many souls are there!?!?” Bai Xiaochun’s scalp was tingling in terror as he pushed forward with greater speed. As for the old man, there was no time to pay any attention to him, which Bai Xiaochun felt a bit bad about. After all, it was his own greed which had put the man in this situation.</p><br/><p>Even as he smiled bitterly, his expression suddenly flickered, and he looked over his shoulder again to see the old soul cultivator howling as he fled from the souls. But then, after the souls reached a position several hundred meters away from the edge of the pit, they suddenly stopped giving chase. Instead, they flew back up into the sky and then circled back toward the pit, where they vanished. Moments later, everything was quiet again.</p><br/><p>Bai Xiaochun looked on in shock, as did the other cultivators. As for the old man, he felt like he had just survived a deadly catastrophe, and was looking around with incredulous delight.</p><br/><p>“I'm... I'm not dead!!” he muttered as tears of joy streamed down his face. However, before he could even calm down from the thrill of having survived, Bai Xiaochun walked up and gave him an appraising glance.</p><br/><p>The old man suddenly went stiff with anxiety. Considering that he was completely surrounded by Bai Xiaochun’s forces, it was obvious that he couldn’t escape, and all of a sudden, the old man thought back to the curses he had just been uttering. Without any hesitation, he handed the soul sphere over to Bai Xiaochun.</p><br/><p>“Exalted one, I--” However before he could continue with any explanation, Bai Xiaochun began to walk around him slowly, poking and prodding him a bit here and there. The old man’s anxiety quickly mounted.</p><br/><p>“They didn’t chase you very far, did they?” Bai Xiaochun said. “Don’t tell me it's because of some secret of yours?” After circling the man a few times without finding anything out of the ordinary, still seemed suspicious. “Alright, how about this. Considering that the souls don’t seem inclined to chase you, why don't we do a little experiment...?” </p><br/><p>With that, he produced another Soul Convergence Pill and handed it to the old man.</p><br/><p>In response to Bai Xiaochun’s words, the old man nearly exploded. Eyes going wide, he was unable to suppress his rage as he yelled, “No! Fudge, I don’t care if you tell your men to skin me alive, there’s no way I'm going!! Kill me first!!” </p><br/><p>The old man really was angry. Earlier, he had been staring death in the face, the result of which was that he was now hovering on the verge of mental collapse, and even hysteria.</p><br/><p>The surrounding cultivators didn’t feel bad for the man at all. Furthermore, they realized that if the man really would rather die than do as requested, then it would be virtually impossible to force him to help them. Therefore, a few of the cultivators stepped forward with clasped hands.</p><br/><p>“Colonel, allow me to go test things out!”</p><br/><p>“Let me go, Colonel!”</p><br/><p>“Colonel, this experiment was made for me!” </p><br/><p>Bai Xiaochun could immediately tell that these cultivators were trying to return the kindness he had shown them. However, there was no way he would agree. After all, he was most likely in the safest position of them all with his mask.</p><br/><p>Looking over at the pit, he gritted his teeth and said, “Stand down, all of you.” Then he glared at the old man. “And as for you, what are you yelling for? Boy do you have a loud voice.” </p><br/><p>With the wave of a hand, he bound the man up again and then tossed him back to his subordinates. With that, he looked at the pit for a moment before walking toward it.</p><br/><p>Zhao Long and some of the others were just about to try to persuade him not to go, but he was too quick. Even as he flew toward the pit, his voice echoed back into their ears.</p><br/><p>“Get back and wait for me.” When Bai Xiaochun arrived at the edge of the pit, his heart was gripped with anxiety and indecision. Further back, the cultivators of his regiment were waiting nervously, in contrast to the old soul cultivator, who was chuckling coldly and cursing inwardly.</p><br/><p>“I’m a Wildlands soul cultivator, and probably do have some of the aura of Giant Ghost City on me. Those souls didn’t want to chase me, but as for that monkey of a cultivator, he's definitely <em>dead!</em>” Actually, the old man had no idea why the souls had abandoned the chase, but was relatively convinced that his own analysis was correct. Even if it wasn’t, he was still sure that the souls would consume Bai Xiaochun the instant he got too close.</p><br/><p>As he chuckled coldly to himself, and the other cultivators looked on nervously, Bai Xiaochun’s eyes began to shine with determination.</p><br/><p>“I should be fine. They definitely can’t see me!” Rubbing his mask to reassure himself, he took another step forward, and was inside the pit.</p><br/><p>Of course, at the slightest sign of anything wrong, he was prepared to call upon the full strength of his fleshly body power, even to the point of harming himself, to flee. However, as soon as he entered the pit, he realized that the souls weren’t even looking at him. Instead, they simply continued to float around like before.</p><br/><p>The thousand cultivators of his regiment, as well as the old soul cultivator, were all shocked.</p><br/><p>“What’s going on...?”</p><br/><p>Bai Xiaochun was delighted, but continued to maintain vigilance. He proceeded carefully through the throngs of souls, and the entire time, not a single one showed even a hint of paying attention to him.</p><br/><p>Soon, he was deep within the crowd of souls, where he pulled out a Soul Convergence Pill and crushed it.</p><br/><p>Rumbling sounds could be heard as a gravitational force erupted out. In the blink of an eye, more than 10,000 vengeful souls were sucked into a soul sphere, which Bai Xiaochun tossed into his bag of holding. In response, the other souls were thrown into a commotion, which caused Bai Xiaochun to tense up for a moment before he realized that they still weren’t able to see him.</p><br/><p>Even as his subordinates looked on in shock, Bai Xiaochun chuckled, clasped his hands casually behind his back, and stuck his chin up, making himself look just like a lonely hero.</p><br/><p>Everyone looking at him saw what appeared to be tens of millions of souls howling and screaming in madness, ready to destroy everything in their path. There were even some crimson souls of the Nascent Soul level who appeared right by Bai Xiaochun.</p><br/><p>And yet, he calmly waved his hand and collected all of the souls nearby into a soul sphere.</p><br/><p>He looked like a consummate master, completely calm and collected, and in no danger whatsoever!</p><br/>\n</div>"}