{"title": "Chapter 512: Bring It On! Who Dares To Make A Move!?", "id": 512, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-512-bring-it-on-who-dares-to-make-a-move", "volume_title": "Volume 6", "body": "<h1>Chapter 512: Bring It On! Who Dares To Make A Move!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 512: Bring It On! Who Dares To Make A Move!?</p><br/><p>Having made his decision, Bai Xiaochun did his best to keep his excitement under control as he sped off into the distance. This time, instead of avoiding all of the random souls, he would walk right up to them and then grab them with the swish of a sleeve.</p><br/><p>The entire time, not a single soul noticed him at all.</p><br/><p>“Hahaha! Now <em>this</em> is how to get battle credit!” As he went along, he didn’t let a single soul escape.</p><br/><p>His collection continued to increase, especially when he ran into larger groups of souls, which was when he would walk right into the middle of them and crush a Soul Convergence Pill in his hand. With a whoosh, all of the souls would then be sucked into his bag of holding.</p><br/><p>“So sick! This mask is the key to dominating the Wildlands!” Over the course of the next four hours, he continued to move about to and fro picking up souls, until he had well over 10,000. Unfortunately, that was the best he could do without running into a truly large group of souls.</p><br/><p>As for his subordinates who were shadowing him, ready to jump out and protect him at any time, many of them saw him going around collecting the souls, and were somewhat surprised, but took it in as a matter of course.</p><br/><p>From their perspective, Bai Xiaochun was the bane of vengeful souls, and therefore, virtually nothing he did with regard to them would be very surprising.</p><br/><p>Time passed. Eventually, the light of dawn was spreading out across the sky, and Bai Xiaochun was more than a hundred kilometers away from the Great Wall. By this point, he was almost completely beyond the area that could be considered the battlefield, and was truly in the Wildlands.</p><br/><p>All sorts of strange rock formations and ferocious plants could be seen, as well as the occasional beast. He even saw a few savages.</p><br/><p>At one point, Bai Xiaochun caught sight of a soul cultivator in the mountains off to the distance, chasing after a beast of some sort.</p><br/><p>This soul cultivator didn't look much like the ones he had seen on the battlefield. He wore ordinary clothing, and wasn’t very handsome. Based on his aura, he seemed to be in the Core Formation stage, except that the soul power fluctuations coming off of him were not pure, but rather, heterogeneous...</p><br/><p>A few years before, Bai Xiaochun wouldn’t have known what to make of this soul cultivator. But as a colonel of the five legions, he had access to intelligence reports that gave him a much deeper understanding of the Wildlands.</p><br/><p>The soul cultivators in the Wildlands were not united, and in fact grouped together in all sorts of different organizations. There were even some soul cultivators who didn’t belong to any organization, and were like rogue cultivators.</p><br/><p>The most powerful forces in the Wildlands were gathered in metropolises called ‘cities of the kings’. There was even one city that bore the ‘imperial’ designation. The forces who occupied such cities were the ones who fielded the huge armies, and were the home of the type of soul cultivators he had seen before on the field of battle.</p><br/><p>However, people like that were actually the minority. Most soul cultivators were scattered, and did not belong to powerful organizations. Most of the time, they came from small groups that controlled tiny bits of territory in random places. As for the soul cultivator with the heterogenous soul power Bai Xiaochun was looking at now, he was obviously one of those types.</p><br/><p>When Bai Xiaochun realized how far away he was from the Great Wall, he stopped and decided that it would be best to end his mission and go back.</p><br/><p>Just as he was turning around, though, a muffled boom could be heard from the mountains off in the distance. A cloud of dust shot up into the air as one of the mountains actually collapsed, transforming into something like a crater.</p><br/><p>Revealed within that crater was a huge group of souls that almost instantly began to fly out in all directions. Bai Xiaochun’s jaw dropped.</p><br/><p>“What’s going on?” he thought. Almost immediately, other savages and soul cultivators in the area noticed that something strange was going on. When they saw all of the souls suddenly flying out, they began to rush in the direction of the crumbled mountain to try to grab some of them.</p><br/><p>To Bai Xiaochun, souls were essentially battle credit, but they were just as valuable to the Wildlanders. Not only could they be used as weapons to attack the Great Wall, but they were also useful for cultivation in a place where there was no energy of heaven and earth.</p><br/><p>Also, anyone who could get their hands on souls could turn around and sell them to necromancers, who would use them not only for cultivation, but to create soul medicine.</p><br/><p>Furthermore, the areas of the Wildlands closer to the Great Wall would often have more souls because of all the people who died in battle. It was for that very reason that there were giants and soul cultivators lurking around in the area, hoping to collect more souls than was possible in other areas.</p><br/><p>Looking around, Bai Xiaochun could see at least a few dozen savage giants and more than ten soul cultivators, all rushing forward to fight over the souls.</p><br/><p>“There must be tens of thousands of them....” Bai Xiaochun thought. As for the group which was rushing forward to compete over the souls, not a single one was in the Nascent Soul stage. They were all in Foundation Establishment or Core Formation, with the three strongest of them being in the great circle of Core Formation. Therefore, he didn’t hesitate to rush forward along with them, grabbing souls with every step he took.</p><br/><p>“Mine! They’re all mine!”</p><br/><p>The savages and soul cultivators had no idea who Bai Xiaochun was, and assumed he was just another soul cultivator. However, it didn’t take long before they realized that he was grabbing more souls than everyone else. In fact, he was getting about half of them.</p><br/><p>Then, it became apparent that, as he moved about, none of the souls were reacting to him. He would simply reach out and grab them, in quite a contrast to all the effort they were putting forth.</p><br/><p>For those who were in Foundation Establishment, there was little they could do about it, but for the handful who were in the great circle of Core Formation, it didn’t take long for their eyes to flicker with fury and killing intent.</p><br/><p>“Where did this monkey come from? He’s so fast!”</p><br/><p>“Dammit, he's single-handedly grabbing more souls than all of us put together? Does he have a death wish or something?!”</p><br/><p>One of them was an old man in nondescript clothing, whose eyes glittered with violet light. Although there were three soul cultivators in the great circle, the other two seemed to be following this one’s lead as they all turned to look at Bai Xiaochun with coldly glittering eyes.</p><br/><p>There were no formal rules in the Wildlands, where the fittest survived, and the law of the jungle prevailed above all. In the end, strength was the most important. When Bai Xiaochun saw the group of three staring at him, he stopped in place, narrowed his eyes, and looked back at them angrily, his murderous aura on full display.</p><br/><p>If any of them had been in the Nascent Soul stage, he would never have done such a thing, but since they were only in the great circle of Core Formation, how could he possibly fear them?</p><br/><p>That was even more the case considering that he had a thousand subordinates not too far off. All it would take would be a single order, and they would rush over to help him. Therefore, not only was Bai Xiaochun not afraid, he was actually feeling a bit arrogant at the moment. Glaring viciously, and looking very much like he was on the verge of attacking with full force, he roared, “Bring it on! Who dares to make a move on me!?”</p><br/><p>None of the savages or soul cultivators had attacked him to begin with because of his fear-inspiring speed. Now, he looked like some sort of fiendish devil, the type who was used to vicious fighting. Therefore, the old man simply snorted coldly, ignored him, and proceeded on toward the crater.</p><br/><p>The other Core Formation experts did the same, and as for the other soul cultivators and savages in the Foundation Establishment level, they obviously had no intention of provoking him. All of them just continued on toward the crater in the hopes of lucking out and getting some souls.</p><br/><p>Seeing this, Bai Xiaochun chuckled darkly, and then let out a few cold harrumphs.</p><br/><p>“So, they <em>do </em>realize how awesome Lord Bai is. Guess they have some sense after all!” Sticking his chin up, he looked very much like the kind of person who was unparalleled under heaven and could crush anyone in front of him in battle. At this point, he couldn’t just leave and go back to the Great Wall, so he clasped his hands behind his back and headed toward the crater.</p><br/><p>As he got closer to the crater, he was finally able to spot a cave mouth at the bottom of it. That was where all the souls were emerging from. Surprisingly, some of them were even crimson, indicating that they were at the Nascent Soul-level.</p><br/><p>“How could there be so many souls?!” Elated, he leaped forward and began to collect one soul after another. When the soul cultivators and savages in the area saw him snatching so many souls right out from under their noses, their killing intent continued to grow stronger.</p><br/><p>Pursing his lips to suppress his laughter, Bai Xiaochun envisioned what it would be like if they attacked him, and then he suddenly called a thousand cultivators to his side to fight for him. The mere thought of the grandiose spectacle got him so excited he started hoping they would actually attack him.</p><br/><p>“Come on, hurry up and make a move!” he thought. With that, he picked up speed in collecting souls, focusing on those which were in the Nascent Soul level.</p><br/><p>Moments later, the old man in the great circle of Core Formation suddenly grinned in terrifying fashion. All of a sudden, a black mist poured out of him, transforming into the shape of a huge skull around him. Then he began to walk toward Bai Xiaochun.</p><br/><p>However, in that very moment, an intense rumble that far surpassed any sound from before rose up from the crater.</p><br/><p>RUMBLE!</p><br/>\n</div>"}