{"title": "Chapter 521: Turning In The Vengeful Souls", "id": 521, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-521-turning-in-the-vengeful-souls", "volume_title": "Volume 6", "body": "<h1>Chapter 521: Turning In The Vengeful Souls</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When he thought about how impressive and glorious it would be to become a major general, his excitement began to build. With that, he hurried out into the command center, where Zhao Long and the others clasped hands in salute.</p><br/><p>Waving his hand in grand fashion, he tried to sound as heroic as possible as he said, “Come, my brothers. Join me at the pagoda to witness... my promotion to major general!” </p><br/><p>Zhao Long’s eyes went wide, but he quickly began to send messages to call everyone together. Before long, all 1,000 members of Bai Xiaochun’s regiment were notified, and were hurrying over.</p><br/><p>“Brothers,” he said loudly, “once I become a major general, we’ll have more meat to eat and more alcohol to drink!” Then he flew into the air toward the pagoda.</p><br/><p>All the cultivators in the regiment were very excited, and none of them questioned Bai Xiaochun’s words at all. If he said that he was going to become a major general, then they had complete confidence that he would do just that.</p><br/><p>It made quite a grand sight as the entire group clustered around him and flew toward the pagoda.</p><br/><p>The sight of more than a thousand beams of light shooting through Great Wall City captured the attention of quite a few other cultivators. However, many soldiers had looks of derision on their faces. After all, the sight of Bai Xiaochun parading through the city wasn’t anything new. The only surprising thing was how long it had been since they last saw him do it.</p><br/><p>Most of them gave him little more than a single glance. Before long, Bai Xiaochun and his men were outside of the pagoda, where quite a few other cultivators were gathered to either purchase items or turn in souls.</p><br/><p>The arrival of Bai Xiaochun and his men didn’t cause too much of a stir, and most people just continued on with whatever business they had at hand.</p><br/><p>Ignoring them, Bai Xiaochun walked up to the pagoda, took a deep breath, and then flew up into the air, just as he had seen the top chosen do in the past when they handed in vengeful souls. There, he waved his sleeve, producing a soul sphere which he subsequently crushed!</p><br/><p>A boom could be heard as souls poured out from the crushed soul sphere. The sight of so many souls attracted a bit of envy from some of the cultivators present, although most of them weren’t paying much attention.</p><br/><p>“Oh, it’s Bai Xiaochun!”</p><br/><p>As soon as the 10,000 vengeful souls appeared, the giant eye atop the pagoda absorbed them.</p><br/><p>Feeling quite pleased with himself, Bai Xiaochun patted his bag of holding to produce another soul sphere. After crushing it, another 10,000 souls appeared, which the eye absorbed. Then he produced a third sphere, causing quite a few curious eyes to look up at him from below.</p><br/><p>Just when he was about to crush the third soul sphere, a blood-colored beam of light appeared off in the distance, which caused a murderous aura to fill the entire area.</p><br/><p>“That’s... Ji Feng!”</p><br/><p>“Colonel Ji Feng! Back before Bai Xiaochun rose to prominence, he was considered the Core Formation cultivator most likely to become a major general! I wonder which of the two of them will actually succeed?”</p><br/><p>As the crowd buzzed, the beam of light faded away, revealing a young man with long hair, clad in a suit of blood-colored armor.</p><br/><p>That young man was none other than Ji Feng!</p><br/><p>He hovered to a stop in midair on the other side of the huge pagoda, making it possible for him to look Bai Xiaochun right in the eye. When he did, an expression of scorn appeared on his face.</p><br/><p>“Trifling apothecary,” he thought. “Other than a nice cultivation base, what do you have? I, Ji Feng, have too much battle credit to count. What makes you think you deserve to compare yourself to me?!”</p><br/><p>Not only did Ji Feng despise Bai Xiaochun, he despised his Soul Convergence Pills as well. As far as he was concerned, Bai Xiaochun was nothing more than an apothecary who had used some fancy tricks to get into a good position, and didn’t compare to him at all!</p><br/><p>He actually hadn’t planned to hand in any souls today, but after seeing Bai Xiaochun show up, he decided to come put him in his place.</p><br/><p>Bai Xiaochun recognized Ji Feng. Technically speaking, this was their second time encountering each other. The first time had been back when he first got to the Great Wall, and had come to check how much battle credit he had to spend to get certain items. At that time, Ji Feng had handed in 10,000 souls to the pagoda and caused quite a stir. Of course, that was before the advent of Soul Convergence Pills, when getting 10,000 souls together in one place had been quite an accomplishment.</p><br/><p>When Bai Xiaochun saw the scorn in Ji Feng’s eyes, he was actually a bit surprised. “I never did anything to offend you, did I?” he thought.</p><br/><p>But after thinking about it for a moment, he realized what was going on, and glared at Ji Feng.</p><br/><p>Ji Feng looked back at him coldly, and soon, it became obvious that they were having a bit of a showdown.</p><br/><p>When the cultivators down below saw what was happening, their spirits were roused, and they began to pay close attention.</p><br/><p>“They’re having a stand-off!”</p><br/><p>“I'm more of a fan of Colonel Ji Feng. He got his battle credit from climbing mountains of corpses and swimming through seas of blood!”</p><br/><p>“Didn’t Colonel Bai Xiaochun do the same thing though? Forget about the Soul Convergence Pill, for a moment. Do you know how many people he saved in that battle!?”</p><br/><p>As people talked about the matter, and even placed some bets, Ji Feng chuckled coldly and then waved his arm, sending a collection of 100,000 vengeful soul streaming out of his bag of holding. Although the souls were somewhat listless and faded, as soon as they appeared in the open, the huge eye quickly absorbed them.</p><br/><p>“100,000 souls....”</p><br/><p>“Colonel Ji Feng definitely deserves his reputation as a top chosen in the five legions. He doesn’t even use Soul Convergence Pills, but still managed to collect 100,000 souls!”</p><br/><p>After tossing out the 100,000 souls, Ji Feng looked over coldly at Bai Xiaochun, and from the look in his eye, his message was clear. <em>You have souls, right? Well let's have a little contest and see who has the most!</em></p><br/><p>A smile immediately broke out on Bai Xiaochun’s face. Now that he thought about it, handing over souls all by himself was actually pretty boring. But who would have thought that Ji Feng would suddenly show up and want to have a contest? The truth was that Bai Xiaochun loved crushing opponents in this way. Sighing, he waved his hand to send twenty soul spheres flying out.</p><br/><p>A boom rang out as the soul spheres collapsed, sending out a vast cloud of 200,000 souls. Almost as soon as the shocking sight appeared, the huge eye atop the pagoda began to shine brightly, and quickly absorbed them.</p><br/><p>Then, Bai Xiaochun looked over at Ji Feng with an expression of open provocation.</p><br/><p>Ji Feng’s expression turned grim, and he chuckled in disdain. Waving his hand, he sent tens of thousands of souls flying out of his bag of holding. However, he didn't stop there. Having emptied one bag of holding, he pulled out another, opened it, and sent an additional group of tens of thousands of souls out to be absorbed by the huge eye.</p><br/><p>This scene immediately provoked exclamations of shock from the surrounding cultivators.</p><br/><p>“Heavens! Just how many vengeful souls does Colonel Ji Feng have?!”</p><br/><p>“How did he possibly get so many souls...?”</p><br/><p>Everyone else was shocked, but Bai Xiaochun was actually feeling a bit impatient.</p><br/><p>“Alright, how many souls do you have?” he said loudly. “Just spit out the number. Sitting around while you open up a bunch of bags of holding is too boring. How about this. You say a number, and if I can’t produce that many souls, then I’ll admit defeat.”</p><br/><p>The arrogant tone with which he spoke immediately caused the entire area to go quiet.</p><br/><p>“Think you’re really tough stuff, don’t you?” Ji Feng replied. “Well, since you’re asking to be humiliated, then I’ll oblige!” Then his hands blurred as he sent one bag of holding after another flying out, until there were nine of them. “Feast your eyes upon 2,700,000 vengeful souls!”</p><br/><p>Although Ji Feng’s words were spoken with coolness and calm, it was impossible to conceal the arrogance which existed deep in his bones.</p><br/><p>Complete and utter silence met Ji Feng’s words and actions. A few breaths of time passed, and then, with the exception of Bai Xiaochun’s subordinates, everyone devolved into a huge commotion.</p><br/><p>“2,700,000? Heavens!”</p><br/><p>“I can't believe that the exalted Colonel Ji Feng can produce so many souls! That's... that’s as many souls as you’ll see in a small-scale battle outside the Great Wall!” In addition to crying out in surprise, many cultivators began to send messages to their friends, telling them to hurry over to watch the scene playing out.</p><br/><p>“Hurry up, Colonel Ji Feng is handing in 2,700,000 vengeful souls! This kind of thing has never happened before, it’s incredible!!”</p><br/><p>“Get over to the pagoda!”</p><br/><p>Meanwhile, Ji Feng was looking over at Bai Xiaochun with feigned indifference, a faint smile on his face that reflected his confidence in having secured a victory.</p><br/><p>“I don’t have that many souls,” he said, “only about 2,000,000. What about you, Bai Xiaochun...?”</p><br/><p>Sticking his chin up, Bai Xiaochun said, “You’re right, that isn’t very many. Only 2,000,000? A drop in the bucket!” </p><br/><p>Bai Xiaochun felt like he was a top martial arts master fighting a little kid. It was actually a wonderful feeling. Chuckling, he waved his hand.</p><br/><p>300 soul spheres flew out.... But things didn’t stop there. Next came another 300, and then 400.... That was a total of 1,000 soul spheres, all floating there for everyone to see!</p><br/>\n</div>"}