{"title": "Chapter 527: You're The Major General?!", "id": 527, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-527-youre-the-major-general", "volume_title": "Volume 6", "body": "<h1>Chapter 527: You're The Major General?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“The next step is to figure out a way to break through it!” Taking a deep breath, Bai Xiaochun reined in the life force, whereupon his entire body began to glow with black light.</p><br/><p>At the same time, an intense fleshly body power coursed through him, to the point where simply clenching his fist caused cracking sounds to explode out.</p><br/><p>Most shocking of all was the speed he was now capable of. Eyes flickering, he waved his sleeve to open his secluded meditation room, and then took a step out.</p><br/><p>The instant his foot fell, he vanished. Although it almost seemed like a teleportation, it wasn’t. It was just incredible speed that instantly took him out of the room and up into the air above.</p><br/><p>As he hovered there in the air above the 3rd Corps’ garrison, he realized that a bird was flying in front of him, its wings beating very slowly, a look of shock on its face. Then he looked around and noticed that everything around him seemed to be moving in slow motion.</p><br/><p>It was a shocking feeling, and immediately led him to the realization that the speed he was now capable of was so great that it bordered on teleportation.</p><br/><p>“Once you get fast enough, everything gets slow?” he murmured. Because he was now hovering in one place and not moving, everything quickly returned to normal.</p><br/><p>It was at that exact same moment that Zhao Long led Song Que and his two companions in through the main gate of the garrison. As they did, they saw a tall, slender figure hovering in the air above them, radiating shocking energy that made him seem like some devilish god....</p><br/><p>Just as they were looking up at that devilish god, Bai Xiaochun looked down and saw Song Que.</p><br/><p>Instantly, their gazes locked....</p><br/><p>Song Que’s eyes went wide, and he gasped, then quickly looked down. Closing his eyes, he told himself that he had just been seeing things, most likely because of how he had been thinking about crushing Bai Xiaochun recently.</p><br/><p>“That’s definitely it,” he told himself. “Just seeing things....” </p><br/><p>However, even as he struggled to get himself under control, Bai Xiaochun enthusiastically shouted, “Que’er!”</p><br/><p>Bai Xiaochun was so excited he was trembling, and his eyes were shining as brightly as if they were on fire.</p><br/><p>As for Song Que, as soon as he heard “Que’er,” his mind was shaken into emptiness. Any endeavors to convince himself that he had been seeing things vanished into absolute nothingness.</p><br/><p>His attempts to prevent himself from trembling left him looking very stiff and unnatural as he stood there with a blank look on his face, feeling like he was being struck by endless bolts of lightning.</p><br/><p>Bai Xiaochun began to laugh heartily as he dropped down to the ground and then began to hurry over toward Song Que and his two companions.</p><br/><p>It was only at this point that the other cultivators of the 3rd Corps realized that their major general had emerged from meditation. Instantly, the cultivators who made up his personal guard began to fly over in beams of light.</p><br/><p>The first person to reach him was the beautiful Liu Li, accompanied by others of his private guard, who clustered around him and saluted respectfully.</p><br/><p>“Congratulations on emerging from meditation, exalted one!”</p><br/><p>Looking very serious, Zhao Long walked a few steps away from Song Que and his companions, then clasped hands and bowed deeply.</p><br/><p>“Congratulations on emerging from meditation, exalted one!”</p><br/><p>Looking very pleased at the words of congratulations being offered by his personal guard, he hurried up to Song Que.</p><br/><p>Meanwhile, other cultivators in the garrison realized that Bai Xiaochun was out of secluded meditation, whereupon dozens upon dozens of beams of light began to fly in his direction.</p><br/><p>Ten of the beams of light surged with the aura of the great circle of Core Formation, and also radiated profound dignity. They were people who, in any other circumstance, would dominate any area they entered.</p><br/><p>They were the colonels of the 3rd Corps, including Li Hongming. All of them approached and offered respectful greetings.</p><br/><p>“Greetings, Major General!”</p><br/><p>As more and more people arrived and saluted in greeting, Bai Xiaochun came to stand in front of Song Que, his eyes shining with excitement. Everyone in the area could sense how happy he was.</p><br/><p>“It’s really you, Que’er. It’s really you!! How did you get yourself in such a bad situation, Que’er? I mean, I thought I had it bad, but obviously, you have it <em>way</em> worse than me.</p><br/><p>“When we left, your aunt entrusted your safety to me. As your Senior, that’s simply my responsibility. Although you mercilessly cast me to the side in the past, as your uncle, I can be magnanimous when necessary. How about this: forget about going out and doing missions. You stick with me. I'm a major general now, and you can be one of my personal guards!”</p><br/><p>Bai Xiaochun really was excited to be reunited with an old friend. Of course, it was all the better considering how arrogant Song Que had acted upon parting ways. Furthermore, although Bai Xiaochun was very happy to be a major general, he wouldn’t be able to return to the River-Defying Sect any time soon, and it was a bit disappointing to have no old friends around to bask in his glory. Therefore, he was so excited right now he felt like he could explode; it was really one of the most incomparable feelings in the world.</p><br/><p>Song Que’s two companions were clearly in a state of shock as they looked at Bai Xiaochun. Although the clothing he wore was relatively simple, it somehow made him look very impressive. He was almost like the bright moon surrounded by countless lesser, faintly twinkling stars. There was something about him that just seemed innately superior. Although he clearly wasn’t in the Nascent Soul stage, he seemed even more terrifying than if he was. Then they heard everyone calling him major general, and their minds began to spin as they realized that this person in front of them was none other than the major general of the 3rd Corps! Complex, indecipherable emotions immediately began to overwhelm them!!</p><br/><p>Furthermore, they immediately recognized that he was Bai Xiaochun. After all, they were all chosen from the Starry Sky Dao Polarity Superstars, and it would have been harder for Bai Xiaochun to be more famous than he was among their number. They almost couldn’t believe what they were seeing in front of their very eyes, and could do little more than gasp in anxiety. Plus, it was all made even more shocking because this was the first time they had heard that Song Que had such a shocking background. His uncle was a major general!!</p><br/><p>Trembling, they subconsciously bowed their heads, clasped hands, and offered greetings.</p><br/><p>“Greetings, Major General, greetings.”</p><br/><p>A blank look could be seen in Song Que’s eyes as this happened. Everything was developing too quickly, and there was no way he could have prepared himself for this turn of events. Just moments ago, he had been reveling in thoughts of how incredible he himself was, and how he would heap humiliation onto Bai Xiaochun. And now, here Bai Xiaochun was standing right in front of him as a major general....</p><br/><p>Face ashen, Song Que began to stammer, “Bai Xiaochun... how is this even possible? Y-you... you actually became a major general?!” </p><br/><p>He could hardly bring himself to believe that it was true; it was almost as if his life were a huge comedy playing out.</p><br/><p>However, as soon as the words left his mouth, Bai Xiaochun’s personal guards began to frown, clearly not happy at all. Liu Li even let out a cold harrumph. They were crack troops who served a famous officer, and their murderous auras immediately began to rage, crushing down onto Song Que and his companions.</p><br/><p>“How dare you use the major general’s personal name!” Zhao Long shouted. “You can’t just call him by name whenever you wish!”</p><br/><p>Although he approved of Song Que in general, the fact that he would question his commanding officer in this way caused him to immediately lose his temper.</p><br/><p>Li Hongming and the other colonels were also frowning in displeasure, to the point where killing intent rose up in their eyes. In fact, the entire garrison suddenly became like a hulking beast, staring at the three newcomers as if they were about to consume them!</p><br/><p>The sight of so many glares being cast at them caused Song Que and his two companions’ hearts to pound on the verge of bursting. As for the young woman, she immediately flopped to the ground to kowtow, to be joined moments later by the middle-aged man. Based on the intense murderous auras around them, they were certain that if they didn’t do so, they would be killed in body and soul!</p><br/><p>Song Que was trembling, and his face was ashen. He could sense the intensity of the murderous auras just as the other two could, and yet, he wasn’t afraid. Instead, he just stood there staring at Bai Xiaochun, his grief and indignation pushing aside all other thoughts, and his frustration building to the point where it threatened to inundate him like flood waters.</p><br/><p>“This is impossible... it’s simply impossible....”</p><br/>\n</div>"}