{"title": "Chapter 528: Hes Just A Kid", "id": 528, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-528-hes-just-a-kid", "volume_title": "Volume 6", "body": "<h1>Chapter 528: Hes Just A Kid</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Song Que thought back to the first day he had met Bai Xiaochun, and everything which had happened since then. Bai Xiaochun had always been there, hanging over him like thunderclouds of misfortune, impossible to dispel.</p><br/><p>Back in the Fallen Sword Abyss, Bai Xiaochun snatched his heavenstring energy. Then in the Blood Stream Sect, he stole away the position of blood master. Later, he seized control of the lofty title of junior patriarch. Each and every time, Song Que found himself outmaneuvered and defeated.</p><br/><p>After coming to the Starry Sky Dao Polarity Sect, he had mustered his courage and fought on his own as hard as he could, only to be outdone again.</p><br/><p>The same thing happened on the huge battleship. Later, after arriving in a strange land, he had unleashed every scrap of his explosive potential, all in the hopes of rising to prominence. When he did, he would finally crush Bai Xiaochun and put him in his place, make him kneel on the ground, and then crush him underfoot!</p><br/><p>Even in this moment, he could still envision himself stepping on Bai Xiaochun’s chest, shoving his finger in his face, and yelling, “From now on, whenever you see me, you’ll grovel your way off into the distance!”</p><br/><p>And yet, such a thing could only happen in his dreams. Yet again, Song Que found himself being crushed, and not just by a little bit. He was being crushed to a heaven-rending, earth-shattering degree, by a major general!</p><br/><p>Having reached this point in his train of thought, Song Que’s grief and indignation reached the point where tears began to roll down his cheeks.</p><br/><p>Startled at seeing tears on Song Que’s face, Bai Xiaochun spun around and yelled, “What are you people doing? Get rid of those murderous auras! This is my dear nephew! What are you doing trying to frighten him? He’s just a kid!” </p><br/><p>Then, he turned and gave Song Que a warm look, and even reached out to tousle his hair.</p><br/><p>When Song Que heard Bai Xiaochun call him a kid, veins began to bulge out on his neck and face.</p><br/><p>“Bai Xiaochun!!” he roared. Then, blood sprayed out of his mouth, and he toppled backward onto the ground, unconscious.</p><br/><p>This was actually the second time he had passed out in Bai Xiaochun’s presence. The first time was back in Sky City in the Starry Sky Dao Polarity Sect....</p><br/><p>Song Que woke up the next morning. After looking around grimly, he gritted his teeth and prepared to leave. However, as soon as he walked out the door, three cultivators appeared in his path. The one in the lead position was Zhao Long, who leveled a cold stare in his direction.</p><br/><p>“The major general went back into secluded meditation. Before he did, he passed down orders to conscript you into service. From now on, you’re one of the major general’s personal guards. You <em>will</em> accept this assignment!”</p><br/><p>A snarl immediately appeared on Song Que’s lips.</p><br/><p>“Remember your place, Song Que,” Zhao Long continued. “In any other corps of the army, you would have been executed on the spot for the impudence you showed yesterday. Thankfully for you, the major general took pity on you for old time’s sake. Not only did he not punish you, but he also rewarded you by placing you in his personal guard, under my command! From now on, disrespect toward the major general will not be tolerated at all!</p><br/><p>“If you continue to act arrogantly, then for the sake of the major general, I’ll be forced to put you to death!” Zhao Long hadn’t consulted Bai Xiaochun regarding the last part of his speech. After all, he knew that there was a special relationship between the two of them. However, as the leader of Bai Xiaochun’s personal guard, there were some matters that were better to nip in the bud. If it turned out that Song Que didn’t know what was good for him, Zhao Long would definitely risk Bai Xiaochun’s wrath by putting him to death!</p><br/><p>He had been following Bai Xiaochun for years now, and therefore, viewed Bai Xiaochun’s honor and glory as his own responsibility, and would brook no violations against it!</p><br/><p>Song Que could see the killing intent in Zhao Long’s eyes, and could sense the intimidating, murderous intentions within him.</p><br/><p>A tremor passed through him as he realized that everything Zhao Long had just said was no mere threat or exaggeration....</p><br/><p>Another half a month went by, and despite his reluctance, Song Que was getting used to being one of Bai Xiaochun’s personal guards.</p><br/><p>During that half month, Bai Xiaochun spent time stabilizing his Undying Live Forever Technique. At this point, he was at his absolute peak both in terms of fleshly body and cultivation base. Most importantly, he had become more familiar with his ability to move at such incredible speed that the world slowed down around him.</p><br/><p>After emerging from secluded meditation, he headed to his private office in the 3rd Corps to get the latest briefings from his colonels.</p><br/><p>Bai Xiaochun knew that since he was a major general, he had to listen very carefully to the reports. The last to report in was Zhao Long, who explained everything that had occurred in Great Wall City and within the 3rd Corps recently.</p><br/><p>The beautiful Liu Li stood behind Bai Xiaochun, kneading his shoulders. She had been one of Bai Xiaochun’s personal guards for years now, and generally had a cold and icy demeanor. However, whenever Bai Xiaochun was exhausted, she wouldn’t hesitate to give him a soothing massage.</p><br/><p>“Up to now, more than a hundred huge caves have been discovered inside the necropolis. Each one is filled with terrifying skeletons. Two deva beast souls were found there, and big battles erupted because of them. One of them was taken by our side, another was won by the Wildlands.</p><br/><p>“More news came in about half a month ago. Beneath the necropolis with the hundred caves, there is another terrifying area that no one has discovered how to enter yet.” With that, Zhao Long concluded his report. Then he casually added one more item.</p><br/><p>“The new member of your personal guard, Song Que, has been performing satisfactorily. However, he has a bit of a rebellious side, and sometimes refuses to follow orders. As such, sir, I was planning to send him to the necropolis out in the Wildlands to learn a thing or two.”</p><br/><p>Bai Xiaochun shook his head and smiled. “No, no, don’t do anything to put him in real danger. I'm his uncle, you know. Besides, it’s normal for kids to be headstrong sometimes. How about this: I'm planning to go take a trip to World City in a few days. Now that I'm the major general of the 3rd Corps, it’s my responsibility to conscript some new chosen to join our ranks.” Actually, Bai Xiaochun had been planning to do this for some time now. After what had occurred with Song Que, he thirsted to see more eyes bulging out of the faces of people who knew him.</p><br/><p>Zhao Long immediately started to get nervous, and was even thinking of trying to persuade Bai Xiaochun to change his mind. In the end, however, he simply voiced his assent, and went off to make special preparations to ensure that Bai Xiaochun was kept safe.</p><br/><p>Although it wouldn’t be possible to take the entire 3rd Corps on the trip, Zhao Long did have the authority to select five colonels, along with their five regiments, a total of roughly 5,000 soldiers.</p><br/><p>A few days later, Bai Xiaochun submitted a request via jade slip to Bai Lin, asking for permission to go to World City for a recruitment drive. For a major general to leave the city like this was a major event, so obviously, a general had to sign off on it ahead of time.</p><br/><p>Upon reading the request in the jade slip, Bai Lin understood immediately that Bai Xiaochun wanted to go show off a bit, and make sure his companions realized how incredible he was. The truth was that Bai Xiaochun wasn’t the only person who had ever done a thing like that. Even many colonels would do the same type of thing.</p><br/><p>Considering what he knew about Bai Xiaochun’s personality, Bai Lin decided that he might as well just directly approve the request. In fact, he even transmitted some information to Bai Xiaochun, not only giving him some warnings about what to avoid, but teaching him a few things about how to successfully accomplish his goals. Bai Xiaochun was initially shocked, but then realized that it merely went to show how experienced Bai Lin was.</p><br/><p>“We’re here on the front lines,” Bai Lin said, “so the people in World City will definitely be ready to shower you with praise and even gifts. However, don’t push things too far....” He went on to offer a few more words of wisdom before finally approving Bai Xiaochun’s request.</p><br/><p>Another two days passed, and after all of the formalities were taken care of, the gates of Great Wall City opened, and a procession of thousands of black-armored cultivators emerged to head in the direction of the Heavenspan Sea. Right in the middle of all of them, of course, was Bai Xiaochun.</p><br/><p>He wore a golden suit of armor, and looked remarkably intimidating. With the proud wave of an arm, he sent his men into motion.</p><br/><p>Zhao Long and Liu Li flanked him, and Song Que was also there, albeit begrudgingly. The colonels had arranged for the troops to fly through the air in tight formation, and scouts had been sent ahead to make sure they didn’t stumble into danger. Everything had been set up to protect Bai Xiaochun and crush anything that got in their way.</p><br/><p>Even from a great distance, it was possible to detect the heaven-shaking, earth-shattering murderous aura that radiated out from the group!</p><br/><p>Song Que was actually a bit nervous as he looked around at the troops around him. He had come to a better understanding of Great Wall cultivators recently, and it was to his despair that he had come to realize that a group like this could eradicate him in the blink of an eye. He wouldn’t even be able to make them pause in their tracks.</p><br/><p>What left him even more unsettled was that the entire group would leap to obey any command Bai Xiaochun gave them.</p><br/><p>There were even Nascent Soul cultivators within that group of 5,000, including some of the colonels. This was roughly half of the entire 3rd Corps, and wherever they went outside of Great Wall City, vicious animals and plants alike would tremble and not dare to get close.</p><br/><p>Not even the bizarre cloudgyres would dare to appear in front of 5,000 cultivators from Great Wall City.</p><br/><p>Thus, not a single obstacle at all blocked their path as they drew closer and closer to World City.</p><br/>\n</div>"}