{"title": "Chapter 539: Ill Intentions", "id": 539, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-539-ill-intentions", "volume_title": "Volume 6", "body": "<h1>Chapter 539: Ill Intentions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Another two hours went by, during which more and more people appeared near the entrance of the labyrinth. Eventually, a young man arrived who caused the other soul cultivators and savages in the area too look over in shock.</p><br/><p>“Beat it!” he said. The coldness of his words caused everyone in the area to scatter immediately to make way.</p><br/><p>The young man hovering in the air above the entrance to the labyrinth was exceedingly handsome, and wore expensive clothing that made him look very different from the soul cultivators and savages. There was something noble and grand about the way he carried himself.</p><br/><p>He had a star-shaped mark on his forehead, a sigil that pulsed with strange power and caused the young man to radiate a mysterious pressure.</p><br/><p>Strapped to his back was a pitch-black greatbow that had nine silver designs on its surface. Anyone who laid eyes on that weapon would instantly be filled with both fear and envy.</p><br/><p>Soon hushed whispers could be heard in the area. “He’s from one of the aristocratic necromancer clans....” </p><br/><p>Looks of respect soon appeared in the eyes of the soul cultivators, and as for the savages, they trembled as they bowed in greeting.</p><br/><p>In the Wildlands, necromancers occupied extremely high positions, and the aristocratic necromancer clans were extremely powerful, to the point where they were even highly valued by the nobility. [1]</p><br/><p>The easiest way to identify whether a necromancer was a rogue cultivator or from one of the aristocratic clans was to examine his or her forehead. Only necromancers from the aristocratic clans would have ancestral sigils like this young man.</p><br/><p>This young man was not in the Nascent Soul stage, only in the great circle of Core Formation. However, because of his status as an aristocratic necromancer, he was the type of person who commanded respect no matter where he went in the Wildlands.</p><br/><p>His name was Zhou Yixing [2], and as he stood there outside of the entrance of the labyrinth, he completely ignored all of the surrounding soul cultivators and savages. Originally, he hadn’t planned to enter the labyrinth. Neither had he participated in the recent war with the Great Wall. Such things were beneath him. After all, although the clan he came from couldn’t be considered extremely large, it was quite famous in this particular area.</p><br/><p>He only had one reason for coming to the labyrinth: Bai Xiaochun!</p><br/><p>“Although my Zhou Clan might get a complete set of five elements deva beast souls soon, I would never be in the running to get them.... But, if I can kill Bai Xiaochun, then I’ll definitely have those souls for my own. Then, after I reach the Nascent Soul stage, I’ll be able to rise in the necromancer rankings. I can finally try to conjure ten-colored flame, or perhaps even eleven-colored flame. With ten-colored flame, I will rise to the absolute peak of the master necromancer rank. And if I can make eleven-colored flame, then I’ll finally be a terrestrial necromancer!!” With such thoughts on his mind, Zhou Yixing’s eyes sparkled with anticipation, and he flew directly into the entrance to be teleported into the labyrinth.</p><br/><p>By this point, there were fully 200,000 people inside the labyrinth, with only 30,000 of them being from the Great Wall. The rest of that number was comprised of soul cultivators and savages, as well as a few hundred necromancers.</p><br/><p>Although everyone was teleported to different locations throughout the labyrinth, considering there were 200,000 of them, they made a huge splash upon their entrance.</p><br/><p>The labyrinth was essentially a complicated, sprawling maze in which divine sense was severely limited. As for all the people who wanted to track down Bai Xiaochun, they immediately scattered in different directions to look for him, and yet, none of them were able to find a single trace.</p><br/><p>That only made the Wildlanders more anxious, as they worried about the prospect of someone else being the one to find him. Because of that, whenever the Wildlanders ran into cultivators from the Great Wall, they mostly ignored them, not wanting to pull time away from their search.</p><br/><p>Not all of the Wildlanders were searching for Bai Xiaochun. But he had attracted the attention of most of them, and thus, there was much less pressure on the Great Wall cultivators.</p><br/><p>Of course, if the Wildlanders came across a lone Great Wall cultivator, they would attack in the hopes of getting some treasure. It wasn’t limited to the Great Wall forces either; Wildlanders would even attack each other if the opportunity arose.</p><br/><p>At the same time, many strange and bizarre things began to occur in various parts of the labyrinth….</p><br/><p>**</p><br/><p>Bai Xiaochun had long since donned his mask of flesh, and looked like a middle-aged soul cultivator. He was currently creeping along carefully in the labyrinth, terrified of being recognized. Back when he had first entered the place, he had shot through the tunnels at top speed, randomly picking directions in the hope of losing his pursuers. In that he had succeeded, but as a result, he now had no idea where he was. He tried to use some magical techniques in the hopes of figuring a way out, but quickly found out that the labyrinth contained a sealing pressure that made such magics of heaven and earth impossible to use.</p><br/><p>“So what if I’m lost? Everyone else is going to be just as lost as me.” Rubbing his forehead a bit, he looked around at the walls of the tunnels, which all looked exactly the same to him. He almost felt a bit dizzy.</p><br/><p>The tunnels had low ceilings, making it impossible to fly up into the air and get one’s bearings. Plus, divine sense was limited. Bai Xiaochun had even tried blasting his way through the walls, but it had little effect. Even more frustrating was that it was impossible to leave marks on the walls to keep track of which tunnels he had passed through. Worse of all was that the entire place was freezing cold.</p><br/><p>It was a sinister coldness that differed from his frigid qi, and made the entire labyrinth seem like it was a cemetery or graveyard. On numerous occasions, Bai Xiaochun got the sensation that someone was watching him from behind.</p><br/><p>However, whenever he looked over his shoulder, he didn't see anything behind him.</p><br/><p>“What kind of awful place is this...?” he muttered, chewing on his bottom lip. After walking a few more steps, he suddenly stopped in place, his eyes shining with a fierceness that made him seem like a sharp, drawn blade.</p><br/><p>It was in that moment that four figures hurried around a corner up ahead of him. Three of them were soul cultivators, and one was a savage giant who had shrunk his body down to a height of three meters.</p><br/><p>They were obviously a team of some sort, and they all had profound cultivation bases at the great circle of Core Formation. Shockingly, one of the soul cultivators had a partially formed Nascent Soul, indicating that he had failed in his attempt to reach the Nascent Soul stage and was now considered a pseudo-Nascent Soul cultivator.</p><br/><p>Being in the pseudo-Nascent Soul stage had upsides and downsides. The upside was that such a cultivation base was higher than even the great circle of Core Formation. The downside was that if a person with that type of cultivation base wished to complete their Nascent Soul, the difficulty level would be ten times greater than normal.</p><br/><p>This group of four was moving in formation, with the giant taking the lead position, and the three soul cultivators following. Although the soul cultivators weren’t wearing very extravagant clothing, they all had magical items swirling around them.</p><br/><p>One had a green flying sword with six silver designs. The other had a similar sword, except that it was red!</p><br/><p>Clearly, those two swords had both received sixfold spirit enhancements!</p><br/><p>Even more shocking was that the pseudo-Nascent Soul cultivator had a glittering pearl floating above him that had seven silver designs on it!</p><br/><p>The group of four swung around the corner with vigilant expressions on their face, and almost immediately caught sight of Bai Xiaochun with his mask on.</p><br/><p>Bai Xiaochun stood there, staring back at them. This was not the first group of Wildlanders he had come across. He had run into a few other groups along the way, all of whom had simply looked at him for a moment before proceeding along their way.</p><br/><p>Bai Xiaochun and the group of four stood there for a few breaths of time, sizing each other up. Then, Bai Xiaochun backed up a bit to make room for them to pass. The Wildlanders continued forward, eying Bai Xiaochun and his multiple layers of armor. When they were roughly thirty meters away, the giant suddenly turned and started running toward him, cackling madly.</p><br/><p>“They still don't know who I really am,” Bai Xiaochun thought. “They just liked my armor, and since I’m alone, think they can rob me. I need to finish this quickly!” Eyes flashing with cold light as the savage giant closed in, Bai Xiaochun took a step forward with speed that left his opponents completely taken aback.</p><br/><p>Before any of them could see him clearly, they heard a muffled boom, and then the screams of the savage giant, who flew backward through the air for a brief moment before exploding into bits, sending arrow-like streaks of blood toward the soul cultivators.</p><br/><p>When things became clear, they saw Bai Xiaochun standing in the spot once occupied by the savage giant, slowly lowering his fist.</p><br/><p>Their eyes went wide, and their hearts started to pound at the realization that they had provoked a powerful expert. However, it was too late for regrets by this point. All three of the soul cultivators had fought on the field of battle, and knew that when enemies faced each other in a fight, there was only one option.</p><br/><p>The blood streaking toward them contained corrosive toxins, and there was nothing that the three of them could do to negate it. Therefore, the pseudo-Nascent Soul cultivator sent a burst of light streaming out of his pearl, which created a glimmering shield that blocked most of the blood. Then the killing intent of the three soul cultivators began to surge.</p><br/><p>“Die!”</p><br/><p><span class=\"footnote\" id=\"footnote_1\">[1] In English, the words ‘aristocracy’ and ‘nobility’ can be virtually synonymous, but the two Chinese terms being used here are very different. In this case, what I’m translating as ‘aristocratic clans’ is basically referring to rich and powerful clans who have long histories in the area, but aren't necessarily connected to the government. The nobility, on the other hand, would be part of the government or ruling class.</span></p><br/><p><span class=\"footnote\" id=\"footnote_2\">[2] Zhou Yixing’s given name, Yixing, literally means “one star.” </span></p><br/>\n</div>"}