{"title": "Chapter 563: Vanished Without A Trace", "id": 563, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-563-vanished-without-a-trace", "volume_title": "Volume 6", "body": "<h1>Chapter 563: Vanished Without A Trace</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Usually, Mistress Red-Dust was beautiful, with a curvaceous body, the fairest of skin, and entrancing eyes. But right now, she was bedraggled, shaking, and seriously injured. On top of that, she was furious. Never before could she possibly have imagined that Bai Xiaochun would turn out to be so difficult to kill!</p><br/><p>She was covered with red welts, the result of trying to fight in the middle of dealing with a curse. For a beautiful woman like her, such a thing was a heavy price to pay.</p><br/><p>Although she was confident in being able to dispel the effects of the curse eventually, the pain and numbness she felt because of it right now had her going mad with fury.</p><br/><p>“Bai Xiaochun!!” she screamed, her hatred for him taking root in the very marrow of her bones. As of this moment, she could not live under the same sky with him. It didn’t matter that they were still surrounded by the dazzling light of teleportation, the fact that he wasn’t dead yet caused her eyes to shine with insanity as she took another step forward toward him.</p><br/><p>She had to kill him before he teleported away!</p><br/><p>She could never rest easy with him alive. Before, she had disliked him because of his Soul Convergence Pills and exploding pill furnaces, as well as the general humiliation and pain he had caused to the Wildlands.</p><br/><p>Furthermore, the actions of the soul tide and the true spirit in Great Wall City had put a significant dent in her years of accomplishments in the war, which caused further hatred in her heart toward Bai Xiaochun.</p><br/><p>However, considering the level of her cultivation base, and the fact that Bai Xiaochun was like a bug beneath her, none of those things had really mattered very much. He would be killed eventually, and his meddling wouldn’t cause any permanent problems for the war effort.</p><br/><p>But now, things were different!</p><br/><p>If it had been anyone else in that sepulcher, even a Nascent Soul cultivator, they would never have survived in a fight against her.</p><br/><p>And yet Bai Xiaochun had!</p><br/><p>Not only had he survived, he had left her bruised and injured. Plus, he had revealed the fact that he had three deva souls, a fact that left her completely unsettled.</p><br/><p>“He’s keeping some big secret, and if he brings it to fruition, then given enough time, he’ll be so terrifying that today’s events will seem like nothing! He’ll bring about disaster after disaster!</p><br/><p>“I've already reached the point where I can’t live under the same sky as him. How could I possibly let him get away now!?” Gritting her teeth and ignoring the fact that she was already starting to fade away because of the teleportation power, she edged closer to Bai Xiaochun.</p><br/><p>Then she reached out with her hand. This was the moment in which she would eradicate him, ending his life once and for all. Only then would she feel at ease. After all, considering how difficult it had been to kill him in this state, if he grew stronger, he would be even more terrifying.</p><br/><p>It was a moment of critical danger for Bai Xiaochun. Despite being in the middle of teleportation, with his body fading away, at the current speed with which Mistress Red-Dust was moving, it seemed highly likely that she would strike him before he vanished. Then, it wouldn’t matter that he was teleported away; the only thing to be teleported would be a corpse!</p><br/><p>In that moment, Bai Xiaochun’s listless eyes suddenly sparkled, and he drew upon the last little bit of life force he had left.</p><br/><p>He couldn’t move his body, and his cultivation base was completely stagnant. The injuries to his fleshly body were severe. However, he didn’t want to die. He wanted to live! There were so many things he had yet to do in life, and to accomplish them, he needed to live forever!!</p><br/><p>“I want to live forever! I can’t die!!” Roaring inwardly, he closed his two eyes and opened the third eye on his forehead, his Heavenspan Dharma Eye!</p><br/><p>Furthermore, it wasn’t just his true self who did it. Inside of him, his three clones also opened their Heavenspan Dharma Eyes. The power of four Heavenspan Dharma Eyes merged together and shot out toward Mistress Red-Dust!!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>Instantly, control power surged out. Despite the fact that it filled his entire body with intense pain, he ignored that and focused his gaze fully on Mistress Red-Dust!</p><br/><p>Rumbling sounds continued as she lurched to a halt. Although she recovered a moment later, that moment was all the time that was needed.</p><br/><p>Blood oozed out of Bai Xiaochun’s Heavenspan Dharma Eye as the power of teleportation surged. Grabbing the Eternal Parasol just in the nick of time, he vanished.</p><br/><p>As for the magical technique that Mistress Red-Dust had just been preparing, it shot through the space that had previously been occupied by Bai Xiaochun, and did absolutely nothing....</p><br/><p>“Bai Xiaochun!!” she screamed shrilly, her eyes burning with hatred. Then, a moment later, she also vanished.</p><br/><p>At the same time, teleportation light swept through the rest of the labyrinth, causing everyone else to disappear, including Master God-Diviner, Zhao Long, Song Que, and others....</p><br/><p>Great Wall cultivators, soul cultivators, and savage giants alike were all whisked away as the labyrinth collapsed, leaving behind nothing but a huge, sinking crater.</p><br/><p>Within that enormous area, the space that had once been created by the nine black pillars of light was replaced by a single white pillar that shot into the sky and then sent ripples out in all directions.</p><br/><p>Bai Lin and the Great Wall forces, as well as all the people from the Wildlands, all clearly saw what was happening, and were shaken. Furthermore, all of them very much wanted to know what occurred within the labyrinth.</p><br/><p>It wasn’t until a month later that everyone came to know about the teleportation spell formation which had been activated, and how everyone inside had been teleported to different parts of the Wildlands!</p><br/><p>Some people ended up in areas relatively close to the labyrinth, others were sent deep into the Wildlands, to places where transmission jade slips were useless....</p><br/><p>As more and more Great Wall cultivators managed to make it back to Great Wall City, news began to spread about what happened in the trials by fire. Stories of Bai Xiaochun began to be told again, causing the news to resound in Great Wall City and the Wildlands alike....</p><br/><p>He had taken 1st place in the trials by fire!</p><br/><p>He had been the first to enter the sepulcher!</p><br/><p>Later, Mistress Red-Dust also entered the sepulcher, where the two had fought a bitter battle. After the sepulcher collapsed, it was revealed that Bai Xiaochun had apparently survived the fight up to that point!</p><br/><p>But then the teleportation began, and as for whether or not he made out it alive, nobody knew.</p><br/><p>After a second month passed, Mistress Red-Dust increased the reward on Bai Xiaochun’s head to an unheard-of level. Five deva beast souls and one deva soul!</p><br/><p>Both the Wildlands and the Great Wall forces were completely shaken. Not even the Great Wall’s Execution List had a reward so high.</p><br/><p>Bai Xiaochun was now in 1st place on the Wildlands’ Execution List!! It was also in that fashion that the Great Wall forces came to realize that Bai Xiaochun was not dead!</p><br/><p>Currently, Bai Lin sat in Great Wall city, a melancholy look on his face and an alcohol flagon in hand. Sighing emotionally, he murmured, “As long as you're not dead, Xiaochun, I'm happy. I really let you down this time.... Where are you...?”</p><br/><p><strong><em>End of Book 4: A Different Kind Of Hostage</em></strong></p><br/>\n</div>"}