{"title": "Chapter 568: Bring It On! Lets See Whos Scared Of Whom!", "id": 568, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-568-bring-it-on-lets-see-whos-scared-of-whom", "volume_title": "Volume 6", "body": "<h1>Chapter 568: Bring It On! Lets See Whos Scared Of Whom!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After looking through Zhou Yixing’s bag of holding inside and out for quite a bit, he found little else of interest.</p><br/><p>Glaring in irritation, Bai Xiaochun said, “If you’re a direct bloodline clan member of the Zhou Clan, what's the deal with your bag of holding? It's virtually empty!”</p><br/><p>“You’re too late!” Zhou Yixing replied angrily. “Before I ran into you, some other damned brute took away all my stuff!” To have someone rob him and then look down on him with disdain was pushing him to the brink of madness. Never in his wildest dreams could he have imagined ending up this poor state. Once upon a time, his bag of holding had contained nine-colored flame, a fire soul arrow, plenty of soul slaves, and a huge collection of soul medicine.</p><br/><p>However, all of that had either been stolen from him or used up in the labyrinth....</p><br/><p>When Bai Xiaochun saw how angry Zhou Yixing was getting, he narrowed his eyes. He had noticed Zhou Yixing’s use of the term ‘damned brute’, and was fairly certain who he was referring to. Clearing his throat, he ignored Zhou Yixing and then began to examine a few bone slips that he had found in his bag of holding.</p><br/><p>There was quite a bit of information, but most of it was already known to Bai Xiaochun. After quite a bit of searching, he didn’t find any formulas for multicolored flame, which was the main thing he was interested in at the moment.</p><br/><p>However, what he found in the last bone slip left him feeling a bit better. It had a map much larger than the one he currently possessed, which showed almost the entire Wildlands. Although it wasn’t very detailed, it at least made his current situation a bit clearer.</p><br/><p>One thing he noticed was that there were five enormous cities marked on the map. Four of the cities were located in the cardinal directions of east, west, south and north. Those four cities were Nine Serenities City, Giant Ghost City, War Champion City and Spirit Advent City!</p><br/><p>Those four huge cities controlled large areas within the Wildlands. Furthermore, far away in a location between War Champion City and Spirit Advent City was a fifth city, which was listed as the imperial city!</p><br/><p>Lost in thought, he put the bone slip away. After a moment, he looked back at Zhou Yixing.</p><br/><p>Seeing the look in his eye, Zhou Yixing knew that his life or death would be decided within the next few moments. Glaring back angrily at Bai Xiaochun, he snarled, “If you’re gonna kill me, kill me!”</p><br/><p>Chuckling, Bai Xiaochun squatted down in front of Zhou Yixing and said, “Calm down, I just want to ask you some questions. If you answer them well, then I might be pleased enough to spare your life.”</p><br/><p>Worried that his clones might be frightening Zhou Yixing too much, he waved his hand, and they faded away into motes of white light that merged back into his body.</p><br/><p>“If you think I'm going to tell you anything, you might as well stop dreaming right now!” Zhou Yixing shouted, spraying a bit of spittle out of his mouth as he did. “If you’ve got what it takes, just kill me! The necromancers from my clan will definitely avenge my death!” Zhou Yixing knew that this necromancer would likely want to use his soul for necromantic purposes. Therefore, he didn't believe at all that his life would be spared.</p><br/><p>Bitterness filled Zhou Yixing’s heart, but he was ready to die, and therefore, decided to throw caution to the wind and take a stand.</p><br/><p>Zhou Yixing’s raving reaction actually startled Bai Xiaochun, but when spittle almost landed on his face, he started to get mad.</p><br/><p>“You really think you’re tough stuff, don’t you Zhou Yixing!? I didn’t even ask you any questions, you fool, and you’ve already refused to answer!?!?” Bai Xiaochun almost couldn’t believe how brazen Zhou Yixing was acting. Here he was, a prisoner of war, and yet he dared to act like a bully!</p><br/><p>Zhou Yixing chuckled coldly. Convinced that he was about to die, he didn’t even attempt to conceal the scorn in his eyes as he said, “Hmph! I don't care what questions you have. You can forget about getting even a scrap of information out of me. By the way, I might as well tell you that the Zhou Clan has made interrogation and torture into an art. People like me train in that kind of thing from childhood! If you have what it takes, go ahead and see if you can get me to open my mouth. I can’t wait to see you try!”</p><br/><p>That scorn touched a nerve in Bai Xiaochun, whose eyes widened as he slapped his bag of holding. Suddenly, an Aphrodisiac Pill appeared in his hand, and before Zhou Yixing could even see what it was, he shoved it into his mouth. Then he bopped him on his chest, whereupon the pill slid down Zhou Yixing’s throat.</p><br/><p>“I’ll show you what true terror means,” Bai Xiaochun raged, “and then we’ll see if you talk or not!” </p><br/><p>Zhou Yixing was immediately alarmed at the warm currents of energy that began to flow through him. Although he maintained a calm front, inside he began to get nervous. However, he managed to maintain his angry glare at Bai Xiaochun.</p><br/><p>It didn’t take long for an unnatural expression to appear on Zhou Yixing’s face as he felt himself growing hotter and hotter. At the same time, an explosively impulsive urge began to fill him, causing his eyes to turn red. He also began to pant heavily. The torturous feeling caused him to start shaking, and yet, he seemed to possess incredible tenacity that allowed him to endure the feeling. He even managed to continue to stare hatefully at Bai Xiaochun.</p><br/><p>After enough time had passed for an incense stick to burn, Zhou Yixing seemed like he was about to catch on fire, and yet, he hadn't uttered a peep. Bai Xiaochun was actually somewhat moved.</p><br/><p>“Why are you being like this? I just want to ask you a few questions.” Sighing, Bai Xiaochun was just about to try to talk some sense into him when Zhou Yixing suddenly began to cackle madly.</p><br/><p>“Cut the crap! Is this all you can do? What else ya got? Bring it on!” Although his voice quavered a bit, he seemed to brim with self-confidence, and even went so far as to spit a glob of spittle at Bai Xiaochun.</p><br/><p>Bai Xiaochun dodged out of the way, his fury burning. The two of them faced off angrily for a long moment, until finally Bai Xiaochun pointed at him and said, “Alright, you’re forcing my hand, Mr. Zhou!”</p><br/><p>Even as he spoke the words, his wood clone stepped out and flew down the mountain toward the nearby jungle. He returned moments later, whereupon he waved his sleeve, sending a three-meter-long pig-like creature flying toward Zhou Yixing. Its skin was covered with long, thick fur, and it was clearly male.</p><br/><p>The pig-creature looked around warily, and even let out a few squeals, but underneath the pressure that emanated from Bai Xiaochun, it couldn’t even move.</p><br/><p>Zhou Yixing stared at the creature in shock, unsure of exactly what Bai Xiaochun was planning to do. Next, Bai Xiaochun waved his hand, removing Zhou Yixing’s bonds but leaving his cultivation base sealed.</p><br/><p>Zhou Yixing’s expression flickered at the sudden return of mobility, but then his eyes fell onto the pig-creature, and he almost couldn’t hold back from pouncing onto it.</p><br/><p>As he stood there, his eyes crimson, his entire body shaking, beads of sweat popped out all over him. He looked like he was burning up inside, to a degree that far surpassed anything from before.</p><br/><p>“Talk,” Bai Xiaochun said with a sigh. “There’s no reason to be like this. Don’t worry, all you have to do is tell me what I want to know, and I won’t kill you.”</p><br/><p>“I’ll die before I talk. You might as well forget about learning anything from me!!” Zhou Yixing felt like he might explode at any moment. His expression was distorted, and blue veins were bulging out all over him. The intense heat inside of him was something he had never felt in his entire life.</p><br/><p>“You’ve vastly underestimated Lord Zhou’s willpower! It's so strong that even my clan patriarchs praised me for it!” Zhou Yixing was soaked in sweat, and was clearly on the verge of burning up. However, he still managed to back up a bit, and finally, he threw his head back and laughed uproariously, more disdain in his eyes than ever.</p><br/><p>Bai Xiaochun’s expression flickered in surprise, and even some heartfelt admiration for Zhou Yixing. Based on what he could tell, he really did have terrifying willpower and endurance, something that was beyond the grasp of ordinary people.</p><br/><p>“I understand, Fellow Daoist Zhou. Your willpower surpasses that of common folk. Quite amazing. All I wanted to do was ask you a few questions, I really had no choice but to push things this far. Please don’t hold a grudge over what happens next....” Sighing deeply, he looked over at the pig-creature, and then back at Zhou Yixing.</p><br/><p>“I just hope this pig-creature has as much willpower as you do....” Shaking his head, he pulled out an Aphrodisiac Pill, crushed it into powder, and prepared to feed it to the creature.</p><br/><p>When Zhou Yixing saw this, he stopped laughing and stared with eyes so wide they looked like they might explode. He began to pant and even grunt, and the blood drained from his face. His legs were shaking, as if he might collapse at any moment. Although he wasn’t sure exactly what type of medicine he had been given that had driven him into this madness, the thought of the same thing happening to the pig-creature caused his scalp to tingle violently. He didn’t even dare to think about what might happen next.</p><br/><p>He didn’t dare to bet that the pig-creature had any level of willpower, and before long, the thought of what was to come filled his mind with indescribable bitterness. And yet, his lip curled....</p><br/><p>“Bring it on! Let’s see who’s scared of whom!!”</p><br/>\n</div>"}