{"title": "Chapter 579: Rebranding The Mask!", "id": 579, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-579-rebranding-the-mask", "volume_title": "Volume 6", "body": "<h1>Chapter 579: Rebranding The Mask!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Instead of leaving, Li Feng chose to stay in the Blackmountain Tribe, where he planted himself at Bai Xiaochun’s side and leapt to meet his every demand, even if it meant going through hell and high water.</p><br/><p>It put a lot of pressure on Zhou Yixing, and also served to increase his own zeal and devotion.</p><br/><p>Bai Xiaochun didn’t drive Li Feng away. Instead, he wallowed in the wonderful feeling of having two people fawning over him.</p><br/><p>“Ai. I really am just too outstanding. Wherever I go, people kowtow to me left and right. It’s really hard to reject such treatment. I guess I’m just too much of a softy.” Of course, the savages were even more fanatical about Bai Xiaochun than before, and the soul cultivators had begun treating him as if he were some sort of god.</p><br/><p>All the energy of the tribe was focused on fulfilling any request that Bai Xiaochun made, which he found to be a wonderful thing. At the same time, he didn't forget that he had promised to concoct soul medicine for them.</p><br/><p>However, before taking on that task, there was something very important to be done, something that could not be delayed. That very night, he sent his three clones out into the darkness to stand guard, and then sealed his immortal's cave with numerous restrictive spells. Finally, he sat down cross-legged and carefully took off his mask.</p><br/><p>After the mask was off, he looked around vigilantly. Outside, his clones did the same thing. Only after they were all sure that the coast was clear did Bai Xiaochun relax a bit.</p><br/><p>“Now that I can concoct eleven-colored flame, it's time to perform a spirit enhancement on this mask and see if I can remove the branding mark inside and replace it with my own!</p><br/><p>“If I do that, then nobody should be able to find me through it!” Eyes sparkling, he pulled out his turtle-wok and prepared everything from one- to eleven-colored flame. After performing the first ten spirit enhancements, he put the eleven-colored flame into the wok.</p><br/><p>Almost instantly, the wok began to shine with bright golden light that instantly filled the entire immortal's cave. The energy which pulsed within that golden light left Bai Xiaochun feeling completely shaken.</p><br/><p>Thankfully, this wasn’t his first time using eleven-colored flame; he had also done so in the illusory world of the trial by fire. Therefore, he settled his qi and calmed his mind, then waited for the turtle-wok to suck in all of the golden light.  When the time was right, he put the mask into the wok.</p><br/><p>“It’s definitely going to work!” The mask was very important, so of course Bai Xiaochun was very concerned with how things could turn out. His eyes were glued to the mask as the golden light in the wok grew more dazzling and boundless, transforming into countless golden threads that converged on the mask itself.</p><br/><p>Then, they rapidly merged together, covering the mask and causing deep rumbling sounds to echo out in the immortal's cave. Finally, right before his eyes, the mask... began to melt!!</p><br/><p>Within moments, it had transformed into a milky white liquid that emanated a fragrant aroma, a mere whiff of which left Bai Xiaochun feeling enlivened.</p><br/><p>“An elevenfold spirit enhancement returns the object to its essence. That leaf transformed into a tree, whereas this mask... became a drop of essence liquid.” The milky white liquid rapidly formed into a pearl that glowed with soft light. Shockingly, on the surface of that pearl was... a golden design!!</p><br/><p>As the turtle-wok went dark, Bai Xiaochun’s anxiety mounted. Finally, he picked up the pearl, whereupon he could sense an aura within it that contained the power of illusion.</p><br/><p>By merely sensing that aura, he suddenly felt as if he were surrounded by an illusory world. No longer was he in his immortal's cave; he was in a celestial paradise, filled with immortal mountains, immortal cranes, spirit flowers, and mystical mists. It was almost impossible to tell whether it was real or not.</p><br/><p>Thankfully, the sensation quickly passed, and he regained his senses. Then, he looked suspiciously at the pearl he held in his hand.</p><br/><p>“This thing’s powers of illusion surpass that of the old mask by far!! There are probably even more differences that I will have to discover over time.” Heart pounding wildly, he examined the pearl further to ensure that there were no branding marks on it. Only then did he place his own branding mark onto it.</p><br/><p>The white pearl flickered as a link was created between him and it.</p><br/><p>“It worked! I never felt anything like this with the mask!” Laughing heartily, Bai Xiaochun pushed the pearl down onto his forehead, whereupon it vanished into his Heavenspan Dharma Eye. Moments later, his facial features blurred, and then transformed back into Bai Hao’s.</p><br/><p>As of this point, there wasn’t the slightest crack in his mask disguise. Whether it was his soul fluctuations or any other aspect of him, not a single shred of evidence that he was Bai Xiaochun remained.</p><br/><p>In the past, certain almighty figures such as demigods might have been able to notice some abnormalities caused by the mask. But now, not even demigods would pick up on any clues.</p><br/><p>Meanwhile, in the very moment that Bai Xiaochun transformed the mask into a pearl by removing the previous branding mark and replacing it with his own, something happened in a location a vast distance away in the Wildlands.</p><br/><p>In that location was a shocking city that was completely golden and matchlessly large. It almost looked like a golden dragon, emanating an intense pressure that would suppress anything in the area.</p><br/><p>That city... was none other than Arch-Emperor City!</p><br/><p>In the very middle of Arch-Emperor City, floating high in the air, was an area filled with floating clouds that seemed to contain a city of its own within them. It was... the location of the imperial palace!</p><br/><p>Inside the palace, in an extravagantly decorated hall, an old man sat cross-legged in meditation. He wore luxurious clothing, and was the type of person who seemed threatening without being angry. He occupied a very high position, the type who could determine the fates of tens upon tens of thousands of people with a single word.</p><br/><p>His cultivation base was profoundly enigmatic, and even from a distance, he looked like a divine, godly being!!</p><br/><p>The moment the branding mark was erased from the mask, the old man's eyes opened, causing golden light to spill out. Anyone who looked into those eyes would be shaken to the core. As soon as the old man’s cultivation base fluctuations began to roll out, the entire imperial palace began to shake.</p><br/><p>“It's gone....” he murmured, frowning. A moment later, he waved his hand, causing the main door of the palace hall to swing open noiselessly and reveal a middle-aged man, who bowed and scraped his way inside.</p><br/><p>“Grand Heavenmaster, his excellency was startled by your cultivation base fluctuations just now. He has asked your humble servant to come and inquire as to what aroused your wrath....”</p><br/><p>“It seems his excellency is a bit too high strung,” the old man replied. “Now that I think about it, it’s the perfect time for him to go into secluded meditation. That way he can increase his cultivation base a bit and build up some courage. Pass down orders that his excellency will enter a ten-year period of secluded meditation, starting immediately.” With that, the old man closed his eyes.</p><br/><p>Back in the area near Giant Ghost City, Bai Xiaochun was in the Blackmountain Tribe, feeling at his face. Pleased, he called back his three clones, then studied the soulhoarding pagoda for a bit before summoning a large group of vengeful souls.</p><br/><p>Then he waved his hand and pinched his fingers together, creating something like a gravitational force that caused the cloud of souls to converge on his palm. As they formed into a one-colored flame, he spread his arms wide, causing the flame to transform into something that looked like a piece of crystal.</p><br/><p>“So, this is soul medicine?” Bai Xiaochun grabbed the crystal, and could immediately sense the soul power fluctuations coming from it. Then he began to study it a bit more closely.</p><br/><p>“Seems simple enough. The only difficulty lies in how many colors are in the flame.... So, only people who can conjure flame can concoct soul medicine. I just wonder... if you can use real medicine concocting techniques to make the soul medicine even better?” After some thought, he produced a pill furnace, tossed the soul medicine inside, and began to use some of the concocting methods he knew.</p><br/><p>However, nothing happened. Bai Xiaochun even took out some medicinal pills and tried to combine them with the soul medicine. He put quite a bit of effort into it, even adding in some plants and vegetation, and yet, in the end, got little out of it.</p><br/><p>“Well, that doesn't work. It adds a bit of medicinal mist to the soul medicine, but that won’t do much of anything at all. Definitely too much of a waste of resources to provide any help in cultivation. Not worth it.... However, it seems I can get a bit of effect by adding toxic elements.” In the end, he just gave up. Although it seemed like a pity, there really weren’t any significant changes to the soul medicine. In fact, only grandmaster alchemists would even notice the slight changes inside. However, all of this made sense considering the Wildlands was a place devoid of medicinal plants and vegetation.</p><br/>\n</div>"}