{"title": "Chapter 584: A Clue!", "id": 584, "volume": 6, "url": "http://boxnovel.org/a-will-eternal-chapter-584-a-clue", "volume_title": "Volume 6", "body": "<h1>Chapter 584: A Clue!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The seven-story pagoda wasn't very far away, making it easy to see how exquisite it was, glowing like a treasure that illuminated everything around it. That and the restrictive spells that surrounded it indicated that it was a very important place to the Bai Clan.</p><br/><p>As Bai Xiaochun made his way toward the north district, a middle-aged woman stood on a fifth story balcony of the pagoda, her expression icily sinister as she stared down at him.</p><br/><p>She wore expensive clothing woven from spirit thread and embroidered with nine phoenixes, which radiated a soft warmth that indicated it had magical properties designed to enhance a person’s good looks.</p><br/><p>Such clothing was extremely extravagant in the Wildlands. Even in the Heavenspan River regions, it would be the type of clothing that only an upper-class woman would wear. Because of it, this woman would be able to maintain her looks even if she were much older than she was now. She was curvaceous, with the fairest of fair skin, and although she couldn’t be considered spectacularly beautiful, there was something very enticing about her. Unlike many young beauties, she was not the type who would ever yield to an opponent, and radiated an air of maturity and grace.</p><br/><p>As she stared at Bai Xiaochun walking toward the north district, she gritted her teeth with the most malicious venom imaginable. A moment later, a man appeared behind her, wearing black clothing and surrounded by a murderous aura. His eyes glowed red, and overall, he looked like an unsheathed sword waiting to strike. As soon as he appeared behind the woman, he clasped hands and bowed respectfully.</p><br/><p>“Greetings, Madam Cai.”</p><br/><p>Madam Cai didn’t look back at the man. Keeping her eyes fixed on Bai Xiaochun, she growled, “Didn’t you say that the bitch’s son, Bai Hao, was dead?!”</p><br/><p>“Yes,” the man replied in an icy, confident voice. “I hit the kid with my Exterminating Soulbrand. His heart and blood vessels were irreparably damaged. Although I teleported him away and wasn’t able to personally witness him become a corpse, I can guarantee that he was killed, beyond the shadow of a doubt!”</p><br/><p>“Killed beyond the shadow of a doubt? What a wonderful way to put it. Well, take a look over there. Who’s that?!” Erupting in rage-filled laughter, Madam Cai pointed at Bai Xiaochun.</p><br/><p>The man’s eyes widened as he took a few steps forward, following the line of Madam Cai’s finger until he was looking at Bai Xiaochun.</p><br/><p>“Impossible!” he said incredulously.</p><br/><p>“Whether that’s really him or not.... kill him immediately!!” With that, Madam Cai turned to leave.</p><br/><p>The man hesitated for a moment. Although he knew that Madam Cai didn’t like Bai Hao, and had been involved in a power struggle with him, he didn’t understand why she wanted him dead so urgently. “Madam Cai, killing him won’t be hard, but we’re in the Bai Clan. If I kill him right now, it could be... problematic.”</p><br/><p>“That bitch’s son isn’t even a person!” she shrieked. “He’s inhuman! <em>Inhuman!!</em> I don’t care how you do it, just kill him as quickly as possible!! He must not be allowed to grow any further!!” A moment later, she seemed to realize she had lost control. Taking a deep breath, she recovered her composure and walked away without another word.</p><br/><p>The black-garbed man stood there silently, unsure of exactly what Madam Cai meant when she said <em>inhuman</em>. However, the fact that his target had survived being hit with his Exterminating Soulbrand was actually a bit intriguing.</p><br/><p>“I guess this Bai Hao really does have some skill after all,” he mused. “I arranged the entire matter, and even delivered the fatal blow myself. And yet somehow, he didn’t end up dying! And then he dared to come back! Well, you might have escaped by the skin of your teeth last time, but let’s see if you can pull off the same thing again!” </p><br/><p>Chuckling coldly, the man turned to leave. At the same time, he began to pulse with the aura of Core Formation!</p><br/><p>Of course, Bai Xiaochun had no way of knowing the details of what had just been said in the pagoda. Because of the incredible restrictive spells which protected it, he wouldn’t be able to hear anything unless he was also inside of it. Furthermore, if he attempted to use divine sense to do so, the restrictive spells would detect it and react.</p><br/><p>However, despite not being able to hear the conversation between the black-garbed man and the middle-aged women, he had seen them clearly, and had detected the ill will and killing intent with which they looked at him.</p><br/><p>“Well isn’t this interesting....” he murmured to himself. Smiling coldly, he continued on toward the north district. Soon, he came to realize that the north district was far from the city center, and definitely not luxurious. Simple houses filled the entire area, the majority of them occupied by servants who had been attached to the Bai Clan for generations. Most of the people present were old, sick, and generally unhealthy-looking.</p><br/><p>The houses seemed scattered about haphazardly, making the entire place seem vastly different from the east district. As Bai Xiaochun walked along, he realized that fewer people were looking at him with scorn and disgust. Considering that this was a poor and simple part of the clan, Bai Xiaochun was further struck by what kind of life Bai Hao must have lived.</p><br/><p>There were even some people who seemed happy to see him, and stepped forward to greet him with sincere pleasure. This place was definitely very different from the east district.</p><br/><p>“Big Bro Hao....”</p><br/><p>“Young Master Hao!!”</p><br/><p>Bai Hao was obviously welcome here. Furthermore, he didn’t even need to look for his residence. A group of children surrounded him and began to chat happily as they led him to a ramshackle house.</p><br/><p>It was little more than a hut that seemed like it might collapse into rubble at any moment. Thankfully, the entire Bai Clan was protected by a spell formation that prevented the elements from affecting the buildings in the clan, otherwise his hut would have long since been washed away by the rain.</p><br/><p>After entering the hut, he looked around and sighed.</p><br/><p>The only thing inside was a bed. There wasn't even a chair present. It seemed almost impossible to believe that an early Foundation Establishment cultivator would live in a place like this. Whether it was in the Wildlands or in the Heavenspan River region, Foundation Establishment cultivators would always be treated very well no matter where they went.</p><br/><p>“How could Bai Hao end up living like this in his own clan…?” Although Bai Xiaochun already knew a bit about Bai Hao, he simply couldn’t understand the situation. Even though he had been expecting something less than ideal, nothing could have prepared him for this.</p><br/><p>“Either Bai Hao was willing to live like this... or didn’t dare to try to change his situation.... In that case, who is it that wants him dead? That man and woman from just now?” Considering the clothing the woman had been wearing, it was obvious that she occupied a very high position in the clan.</p><br/><p>However, no amount of pondering brought any insight or clues. He just didn’t have enough information. In the end, he shook his head. “I wish I could help you, Bai Hao. But you need to give me something to work with. Help me understand what was going on with you!” </p><br/><p>Sighing, he sat down cross-legged on the dilapidated bed. However, instead of meditating, he sent his divine sense out into the area.</p><br/><p>He also performed some incantation gestures and prepared to place some restrictive spells in the area that no one but him would notice. This was a practice he had grown accustomed to over the years. Whenever he was in a strange place, the most important thing to do at first was make sure he was safe.</p><br/><p>However, almost as soon as he sent his divine sense out, a serious expression appeared in his eyes, and his gaze shifted to an area in the corner of the room. Stepping off the couch, he walked over and squatted down to have a closer look.</p><br/><p>Although this corner of the room looked ordinary in every way, when his divine sense touched it, he could sense the lingering fluctuations of some magical technique.</p><br/><p>They were faint, as though they had been fading away for months now, and were just about to disappear for good. Were it not for the fact that Bai Xiaochun was currently fused with his three clones, quadrupling his divine sense’s sensitivity, then he would never have noticed the traces. Although his current divine sense did not have all the powers that Nascent Soul divine sense did, it was equally acute as that of a Nascent Soul expert.</p><br/><p>After examining the location further, Bai Xiaochun’s eyes lit up with surprise.</p><br/><p>“Someone used some kind of magic here.... It wasn’t very long ago, months at most.... From the look of things, another type of magic was used later to wipe the ground clean. Erase some evidence of something perhaps…?” Curiosity growing, Bai Xiaochun opened his Heavenspan Dharma eye just a crack, and sent violet light spilling out into the confines of the hut.</p><br/><p>After looking at the ground using this method, Bai Xiaochun realized that what had been wiped away with magic was most likely some lines of hand-written text....</p><br/><p>“Interesting,” he murmured. Suddenly, several afterimages appeared, which formed into his three clones. Each clone opened his third eye a crack, causing three more beams of violet light to converge on the same place.</p><br/><p>Thankfully, Bai Xiaochun knew what he was doing, and prevented any of the violet light from leaving the hut, ensuring that no one on the outside would be able to detect what he was doing. Within moments, the line of text which had been wiped away was restored enough that Bai Xiaochun could read it.</p><br/><p>Despite the level of his cultivation base and the extent of his mental control, the mere sight of the text caused him to let out a yelp of surprise!</p><br/><p>“That’s.... That’s....”</p><br/>\n</div>"}