{"title": "Chapter 608: Let The Show Begin", "id": 608, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-608-let-the-show-begin", "volume_title": "Volume 7", "body": "<h1>Chapter 608: Let The Show Begin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Hao had risen to complete prominence. He had crushed Bai Qi and stolen the deva soul, inundating the Bai Clan with floodwaters of astonishment.</p><br/><p>The representatives from the other two clans were astonished to the ultimate degree.</p><br/><p>As for the emissary from Giant Ghost City, his eyes were shining brightly, and he had long since transmitted news back home about what was happening. Earlier, he had assumed the matter had already ended; never could he possibly have imagined that the show... was only just beginning!</p><br/><p>“Master necromancer!”</p><br/><p>“Everyone used to say that Bai Hao was the garbage of the clan, a bastard son who was so lowly he wasn’t worth paying attention to. They even said his latent talent was the worst quality possible. But now, the lowest of the low has practiced cultivation to an unheard-of level!”</p><br/><p>“People said that he was equally untalented in necromancy. But now... he conjured a seven-colored flame in one fell swoop. If that’s not latent talent, then what is?!?!?”</p><br/><p>“Unless... he's an imposter....”</p><br/><p>However, even as everyone reeled in shock, Bai Xiaochun was there in the ancestral land, not yet finished with his flame conjuring.... The wave of his hand caused the seven-colored flame to spread out and gobble up more vengeful souls. The exact method being used would not have been noticeable even to ordinary necromancers, but the grand elder from the Hall of Justice and the other experts all gasped.</p><br/><p>“That’s....”</p><br/><p>A new color could be seen in the seven-colored flame as the sea of fire converged back into Bai Xiaochun’s palm. Then he opened his fingers to reveal... a tongue of eight-colored flame!!</p><br/><p>That, of course, led to even more widespread shock, especially considering how smoothly Bai Xiaochun performed the task. It was almost as if conjuring eight-colored flame could not have been more of a simple task for him.</p><br/><p>The implication caused the clan elders’ eyes to narrow. However, they quickly went wide again as... the eight-colored flame spread out and then gobbled up more vengeful souls, causing another color to appear!</p><br/><p>It was now...</p><br/><p>Nine-colored flame!!</p><br/><p>Before any cries of shock could be heard, Bai Xiaochun casually opened his fingers, causing the nine-colored flame to explode out in all directions.</p><br/><p>Even as he hovered there, surrounded by a sea of fire, more vengeful souls poured out of his soulhoarding pagoda, to be absorbed by the nine-colored flame. Bai Xiaochun closed his hand, then opened it... to reveal fire with ten colors in it!!</p><br/><p>“Ten-colored flame!!”</p><br/><p>“The peak of the master necromancer rank!!”</p><br/><p>“Heavens! Am I seeing things? He went from one-colored flame all the way to ten-colored flame in one quick motion? How is that even possible!?!?” At that point, no one could hold back from crying out in shock. One might think that they would grow numb to the situation, but Bai Xiaochun didn’t give them the time for that. Every move he made stabbed them with astonishment, leaving them incredulous to the point of disbelief. And yet, many of them were now looking forward with anticipation to what was coming next....</p><br/><p>As the cries of astonishment continued to echo out... Bai Xiaochun went on with his work. Eyes shining brightly, he waved his hand to send the ten-colored flame spreading out in all directions. The sky in the ancestral land was on fire as a massive group of vengeful soul burst out from his crystalline soulhoarding pagoda.</p><br/><p>The flames danced, becoming like a huge mouth that consumed the souls. At the same time, the onlookers’ hearts were pounding, their eyes were bulging, and their minds were spinning.</p><br/><p>Nobody needed any help to understand that Bai Xiaochun was attempting to conjure... eleven-colored flame!</p><br/><p>The elders began to hold their breath as the ten-colored flame guzzled down the vengeful souls, and their faces flickered with countless emotions!</p><br/><p>“Can he... can he conjure eleven-colored flame...?”</p><br/><p>“There’s no way!”</p><br/><p>“Eleven-colored flame! That’s the hallmark of terrestrial necromancers! There’s no way that Bai Hao can conjure that level of flame!!”</p><br/><p>After all... not a single one of the clan elders was higher than the master rank, and none of them had any hope of progressing any further.</p><br/><p>And yet, Bai Hao had already surpassed them! With one more step, he would be a terrestrial necromancer, of which there were only two in the clan at the moment, the two grand elders from the Hall of Corrections and the Hall of Justice.</p><br/><p>Not even the clan chief was at the terrestrial rank. Currently, he was staring at the screen on the stone gate, his heart racing with madness as utter incredulity swept over him.</p><br/><p>However, the killing intent in his eyes only intensified; it wouldn’t matter if Bai Hao were more of a chosen than he obviously was, he would still want to kill him!!</p><br/><p>Madam Cai was even more enraged, with venomous hatred in her eyes that seemed to stem from the Nine Serenities underworld!</p><br/><p>Countless eyes were glued to the ten-colored flame, and everyone was panting. As the vengeful souls were fed into the sea of fire, another color gradually appeared.</p><br/><p>In that moment, the gasps ceased... and the entire world went silent.</p><br/><p>Bai Xiaochun closed his fingers, causing the sea of fire to converge on his palm. Then he opened his hand, causing a radiant light to fill the entire ancestral land!</p><br/><p>“Eleven colors!!\"</p><br/><p>“He’s... he’s not a master necromancer, he’s... he’s....”</p><br/><p>“He’s a terrestrial necromancer!!!”</p><br/><p>“Impossible! How could this be happening…?” Everyone in the Bai Clan, from the youngsters to the old-timers, were reeling in astonishment and disbelief.</p><br/><p>“Terrestrial rank!!” The clan elders were trembling, their breath coming in ragged pants as their eyes bulged out of their skulls. What they were seeing now was the most unbelievable thing so far, even more unbelievable than watching Bai Hao kill Bai Qi.</p><br/><p>The two grand elders’ jaws dropped, and their minds spun beyond their control.</p><br/><p>Of course, most agitated of all were Madam Cai and the clan chief. Madam Cai stood there, completely stunned, a look of brutal ferocity frozen on her face. As for the clan chief, he felt like his mind were being struck by hundreds of thousands of lightning bolts, making it impossible for him to do anything other than stand there.</p><br/><p>He had known that Bai Hao had latent talent in flame conjuring. However, latent talent didn’t necessarily manifest into action. But right now, Bai Hao had casually conjured everything from one- to eleven-colored flame, leaving the clan chief shaken to his very core.</p><br/><p>“This can’t be happening!!” he gurgled, his neck turning red from the humiliation and incredulity. It was almost as if that eleven-colored flame were about to burn his world to ashes.</p><br/><p>The two representatives from the great clans and the emissary from Giant Ghost City were all flabbergasted. In all the lands controlled by Giant Ghost City, it would be easier to find a phoenix feather or a qilin horn than to find a terrestrial necromancer this young. As a result, they were all thinking the same thing: “Now <em>that</em>... is the qilin son of the Bai Clan....”</p><br/><p>However, before people could finish their exclamations of shock, Bai Xiaochun once again waved his hand, causing a final wave of vengeful souls to erupt from his soulhoarding pagoda.</p><br/><p>He now had almost no vengeful souls left. However, he had enough to push his eleven-colored flame to the next level. As the flame spread out around him, everyone looking on was stupefied.</p><br/><p>“He’s... he’s going to conjure twelve-colored flame!!”</p><br/><p>“Crazy! This is completely crazy....”</p><br/><p>Bai Xiaochun’s eyes radiated bright light as he looked around at the sea of fire. As the vengeful souls poured into the fire, unstable fluctuations suddenly appeared. Bai Xiaochun was well aware that all he had to do now was stop using the help of a clone, and the sea of fire would stabilize and transform into twelve-colored flame.</p><br/><p>If he continued to try to conjure the flame as he was doing now... then his rain of magical fire would make an appearance again.</p><br/><p>“And that’s exactly what I want!” he murmured through gritted teeth. A ghost image appeared, which was one of his clones. As the clone attempted to suppress the fire, heaven-shaking, earth-shattering light spread out in all directions.</p><br/><p>The light was so bright and dazzling that even the people watching the screen were forced to look away, and were unable to see Bai Xiaochun’s clone.</p><br/><p>Not even the people inside the ancestral land were able to see clearly what was happening. All they could see was... a terrifying, twelve-colored sea of fire!</p><br/><p>In that exact moment, the stone gate that was the entrance into the ancestral land... finally succumbed to the clan chief, and opened!!</p><br/><p>“Time to die, Bai Hao!!” roared the clan chief. As soon as the entrance was opened, he stepped forward!</p><br/><p>Simultaneously, Bai Xiaochun was there in the middle of the sea of fire. Looking up, he saw the huge rift open up, revealing the members of the clan outside of the ancestral land... and the clan chief, preparing to step inside. At that point, a look of madness appeared on Bai Xiaochun’s face.</p><br/><p>“Success or failure all comes down to this!!” Howling, Bai Xiaochun took a step forward, taking the twelve-colored sea of fire with him as... he emerged from the Bai Clan ancestral land!</p><br/>\n</div>"}