{"title": "Chapter 616: I Want Him Alive", "id": 616, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-616-i-want-him-alive", "volume_title": "Volume 7", "body": "<h1>Chapter 616: I Want Him Alive</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“People like this don't deserve compassion!” With that, Bai Xiaochun proceeded along his way. Eventually, he took out the soulship and the violet pennant to study them a bit.</p><br/><p>They were clearly top-quality items, especially the little pennant. To his shock, he found that it was filled with more than 100,000 branding marks, all of them related to speed. Although it was very expensive to use, it could lead to speed of an indescribable level.</p><br/><p>Not even the clan chief could fully utilize its powers. It was just too unimaginably expensive. After some calculations, Bai Xiaochun came to the conclusion that using it for only one breath of time would cost ten portions of mid-grade soul medicine!</p><br/><p>Not even the Bai Clan could pay such a price for long.... Most importantly, all of the sealing marks on the soulship and the violet pennant had been placed there by the Bai Clan's deva patriarch, meaning that they would be impossible for him to fully use without first breaking all of them.</p><br/><p>Even more worthy of note... was that both of the items had benefited from elevenfold spirit enhancements. Bai Xiaochun could see golden designs hidden on both of them. Unfortunately, all of these combined factors indicated that he couldn’t use either of them at the moment.</p><br/><p>“Well, just give me some time. Maybe I can use Heavenspan River water to wear them away....” After some thought, he tossed both of them into his big bucket of Heavenspan River water.</p><br/><p>When not being used, the soulship was small enough to fit in his palm. After tossing it into the bucket, Bai Xiaochun stopped thinking about it and narrowed his eyes.</p><br/><p>“I still have to deal with the sealing mark that was put onto me....” Frowning, he performed a double-handed incantation gesture, then began to slap his hands down all over himself. His qi and blood began to surge in a certain rhythm, pulsing through him as he attempted to cleanse himself. At the same time, he continued to flee.</p><br/><p>Another three days passed. It was afternoon as Bai Xiaochun fled when, all of a sudden, his expression flickered. Looking over his shoulder, he saw a brilliant beam of light streaking through the sky toward him.</p><br/><p>Within that beam of light was an old man on a soulship, moving at incredible speed, his face a mask of vicious, killing intent.</p><br/><p>Although Bai Xiaochun wasn’t sure of the man’s name, he recognized him. He was one of the Bai Clan elders, whose cultivation base was very close to the mid Nascent Soul level. He was also a member of the direct bloodline.</p><br/><p>“Another one? Also alone?” Bai Xiaochun blinked a few times and then cleared his throat, then simply slowed down to a stop.</p><br/><p>As the old man closed in and saw that Bai Xiaochun had the clan chief strung up and hanging over his shoulder, his eyes bulged, and he gasped. Without any hesitation, he lurched to a stop.</p><br/><p>“He captured the clan chief alive!?!? How is this possible?!?!”</p><br/><p>A look of complete incredulity played out on his face. He almost couldn’t believe what he was seeing, and in fact, not even in his wildest dreams could he have pictured the clan chief being captured alive. It was impossible to prevent the fear from rising up in his heart; his cultivation base was lower than the clan chief’s. Considering that the clan chief had already been captured... what would happen to him? Furthermore, when he saw how bedraggled the clan chief looked, his heart was seized with anxiety.</p><br/><p>“I don’t care how it happened, there’s no way I’m going to risk putting myself in danger....” Sweat popping out on his forehead, he unhesitatingly pulled out a teleportation talisman and crushed it....</p><br/><p>Rumbling sounds filled the air as he faded away.</p><br/><p>“Scared him off?” Bai Xiaochun muttered, looking surprised. “Well... he has some common sense, that's for sure. More scared of death than I am. And he’s in the Nascent Soul stage....”</p><br/><p>He had already been prepared to capture him alive and truss him up like the clan chief. Shaking his head, he looked at the clan chief with his closed eyes and gritted teeth, and couldn’t help but smile and sigh.</p><br/><p>“This protective talisman really is useful!” Feeling very pleased with himself, he continued along his way with the clan chief trussed up behind him. From that day on, every time someone from one of the auxiliary bloodlines of the Bai Clan encountered him, they would look at the clan chief, gasp, and then flee.</p><br/><p>As for the clan chief, he preferred to simply remain unconscious....</p><br/><p>The fact that Bai Xiaochun had captured the clan chief alive proved that no one else could do anything to him. After all, no one among them had a higher cultivation base than the clan chief.</p><br/><p>Of course, the people from the direct bloodline were not so easily dissuaded. Considering that they could track him with the divine will seal, they began to team up and attack him in groups!</p><br/><p>When that happened, Bai Xiaochun would fight back and spill blood immediately....</p><br/><p>It wasn’t just members of the Bai Clan who saw him going along with the clan chief trussed up. This was Giant Ghost City territory, so there were many soul cultivators and necromancers who also saw the scene.</p><br/><p>Everyone who did was completely and utterly shocked.</p><br/><p>“Who’s that...? And why does that person he has tied up look like... the chief of the Bai Clan!?”</p><br/><p>“No way....”</p><br/><p>More and more people saw what was happening, and many more heard the rumors. Soon, stories were spreading throughout Giant Ghost City territory.</p><br/><p>At first, the rumors spread quietly, mostly because people couldn’t confirm their validity. But soon, after the representatives from the two clans returned to their homes, as did the emissary from Giant Ghost City, the whispered rumors turned into an explosive torrent of gossip.</p><br/><p>“What?! A qilin son rose up in the Bai Clan and killed Bai Qi? He stole their deva soul, survived an attack by their deva patriarch, and then escaped!?!?”</p><br/><p>“After he escaped, his own father, the clan chief, tried to kill him, but then got captured!? Now the chief is tied up like a dog on his son’s back for everyone to see?!?!?”</p><br/><p>“Heavens! This Bai Hao... really did turn traitor against the Bai Clan!!” The rumors grew more and more intense, until large numbers of people were paying very close attention to what was happening. News also began to spread of how Bai Xiaochun was killing many of the Bai Clan cultivators who had been dispatched to chase him down. Before long, all of Giant Ghost City was in a commotion.</p><br/><p>Within the kingly city, the heavenly marquises and members of the other clans were deeply shaken. Everyone had heard that a qilin son named Bai Hao had emerged from the Bai Clan, and that he had turned traitor, stealing the clan’s deva soul and even capturing his own father. Plus... he had killed many fellow clan members in ruthless fashion!</p><br/><p>“I heard that he suffered in silence in that clan for years, and was bullied constantly. He even came close to death on numerous occasions. However, he endured quietly until they opened their ancestral land, which was when he exploded out in shocking fashion!”</p><br/><p>“That’s nothing. I heard that this Bai Hao has shocking talent in flame conjuring. Also, his cultivation base is in the great circle of Core Formation. He's completely extraordinary!”</p><br/><p>“I can’t believe the Bai Clan is so short-sighted.... But then again, this Bai Hao is clearly a vicious fellow. He actually kidnapped his own father!” Everyone in the area of Giant Ghost City was talking about the matter, and not a single person wasn’t shocked.</p><br/><p>Although very few people had ever even seen Bai Hao, they now had a mental image of him. He was completely sinister, with heaven-defying latent talent. At the same time, he had reviled his own clan, and was completely and utterly ruthless.</p><br/><p>Not only did the clans and the heavenly marquises learn about the matter, but word even spread to the very heart of Giant Ghost City. Located there was an enormous statue, upon the head of which was the royal palace.</p><br/><p>Within the royal palace was a towering figure in a kingly robe, standing at a railing, his hands clasped behind his back. He looked very majestic as he stood there looking out at heaven and earth. He seemed like the personification of the will of the heavens, the type of person who even a deva would tremble in the face of.</p><br/><p>It was as if in his presence, even heaven and earth would acquiesce!</p><br/><p>He bore the appearance of a middle-aged man, his features angular but extremely handsome. He seemed superior in all ways, the type of person who could dominate anything in sight.</p><br/><p><span id=\"footnote-ref-ca9d\"><span>This man... was none other than one of the four heavenly kings, and one of the most powerful people under the Arch-Emperor himself, the Giant Ghost King!! He was a person who towered above all creation, and that was especially so in the current era, in which imperial power was waning. Any of the four heavenly kings were shocking figures who could shake the Wildlands deeply wherever they went! </span>[1]</span></p><br/><p>“Bai Hao....” the Giant Ghost King said softly. “Interesting....” A strange light flickered in his eyes, as if he were thinking. After a moment, he smiled faintly.</p><br/><p>“Duke Deathcrier,” he said loudly, “why don’t you go find this Bai Hao and bring him back here to Giant Ghost City. Arrange for a position for him as well.” The Giant Ghost King’s words were spoken with icy coldness, but at the same time, profound meaning could be seen within his smile.</p><br/><p>Even as his words echoed out, an old man appeared in the left hand of the enormous statue, which was itself another enormous palace.</p><br/><p>He seemed ancient to the extreme, with eyes that shone like the sun and moon. The aura which surrounded seemed to fuse with heaven and earth. Shockingly... this man was in the Deva Realm!</p><br/><p>The old man clasped hands and bowed deeply. “Yes, your majesty!”</p><br/><p>Then he turned his head and simply vanished.</p><br/><p>Chuckling coldly, the Giant Ghost King said, “If the Bai Clan wants him dead, then I want him alive! The three great clans are most likely finishing their preparations.... Let’s see which of them will make the first move!” </p><br/><p>To the Giant Ghost King, Bai Hao was insignificant, and in fact, his life or death didn’t matter at all. However, considering that he was connected to the Bai Clan, it meant that he was the perfect tool to feel them out.</p><div id=\"footnote-ca9d\"><br/><p>1. Hey everyone, a quick note that the heavenly kings mentioned in this chapter are not the same as the \"Undying Heavenly King\" technique that Bai Xiaochun cultivates. In retrospect, I should have named the technique something else. In fact, I'm thinking of going back to make it the \"Undying Celestial King\" technique or maybe something completely different. Until then, though, just please be aware that the 'heavenly kings' of the wildlands are completely unconnected to that technique, at least as far as the Chinese characters go. Since he's already finished with that level of the Undying Codex, I feel like it's not really a big deal at this point. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}