{"title": "Chapter 618: Another Battle With A Deva!", "id": 618, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-618-another-battle-with-a-deva", "volume_title": "Volume 7", "body": "<h1>Chapter 618: Another Battle With A Deva!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This area was still considered to be under the control of Giant Ghost City, and therefore, could be considered to belong to the Giant Ghost King himself. And of course, the Giant Ghost King was a person who surpassed the heavens in terms of status here.</p><br/><p>Bai Xiaochun was reaching the border, however. He could actually see the vast desert off in the distance, a place filled with swirling winds.</p><br/><p>Eyes sparkling because of the enlightenment from Bai Hao’s notes, he gathered his thoughts and then pushed on toward the desert.</p><br/><p>“I’ll head out into the desert for a few months to let the situation calm down. Then I’ll consider whether to come back here, or go to one of the other kingly cities. All of them have teleportation portals that could get me home.... In the meantime, I can spend more time studying Bai Hao's notes.” By this point, he felt that he had made significant progress when it came to thirteen-colored flame, and was getting more confident in succeeding with it.</p><br/><p>It was in that moment that suddenly, his expression flickered, and he looked up into the air. When he did, his pupils constricted as he laid eyes on an enormous vortex rumbling into existence.</p><br/><p>Within a single breath of time, it transformed into a 30,000-meter-wide portal, from within which erupted shocking pressure.</p><br/><p>RUMBLE!</p><br/><p>A tremor ran through the lands, and then all of the soil suddenly went completely still, as if the entire area had been cut away from heaven and earth to become its own special space.</p><br/><p>Bai Xiaochun’s breath caught in his throat, and he felt as if the air around him had solidified. The pressure weighing down made it almost impossible to move.</p><br/><p>The clan chief’s eyes snapped open, and he shouted, “Patriarch!!”</p><br/><p>“This Bai Clan patriarch seems even stronger than Mistress Red-Dust!” Up above in the huge vortex, the image of a face appeared, which was none other than the face of the deva patriarch, staring down coldly at Bai Xiaochun.</p><br/><p>“A Core Formation cultivator dares defy the heavens!?” He spoke exactly eight words, which, as they left his mouth, became eight magical symbols, dazzling and bright, that instantly shot toward Bai Xiaochun.</p><br/><p>As they flew through the air, the symbols transformed into eight giants clad in golden armor.</p><br/><p>Bai Xiaochun was immediately shaken. The deva’s mere words immediately transformed into soldiers willing to follow his every command!</p><br/><p>He now realized... that he had underestimated devas. During his fight with Mistress Red-Dust, she had been affected by a curse, and had been unable to use some of her most powerful divine abilities. Furthermore, she was also on a lesser level than this Bai Clan patriarch.</p><br/><p>It was a moment of critical danger; eight golden-armored giants were bearing down on him, howling and roaring. That was when afterimages blurred around him, not one, but four.</p><br/><p>However, he wasn’t summoning his clones. He was directly drawing on the power of their cultivation bases, fleshly bodies, and divine sense!</p><br/><p>He was making himself four times stronger!!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>Moments before, the pressure surrounding him had been sealing him in place, but now, fissures spread out in the air around him. In almost the same moment that the eight golden-armored giants arrived, he looked up and roared, simultaneously flying backward at top speed.</p><br/><p>Then, a boom echoed out as the eight giants landed in the spot he had just occupied. As they did, they transformed into eight golden chains that sealed the entire area.</p><br/><p>During the process, the clan chief was sent tumbling off to the side, where he coughed up a mouthful of blood before lapsing into unconsciousness.</p><br/><p>“Very interesting.” The deva patriarch’s eyes flickered with surprise. Back in the Bai Clan, his cultivation base had been limited because of his Seven Life-Locking Candles, and he had been unable to personally take charge of the situation. That was why Bai Xiaochun had been able to flee to begin with, and had not actually been completely surprising. But now, here he was in person, and his quarry was still causing problems for him, which he actually found quite interesting.</p><br/><p>The huge face in the vortex began to shrink down until it formed the patriarch himself, hovering there in midair, emanating an aura that seemed capable of causing instant transformations in heaven and earth.</p><br/><p>He wore a white robe, and had an icy cold expression on his face as he looked down at Bai Xiaochun. Then he took a step forward, a step which caused an enormous foot to appear up above in the sky!</p><br/><p>The 3,000-meter-long foot descended, destroying the clouds and causing the lands below to shake. Even the air distorted as the foot rumbled toward Bai Xiaochun.</p><br/><p>The foot caused incredible pressure to weigh down on Bai Xiaochun, almost as if the will of the heavens were crushing onto him!</p><br/><p>There were a few reasons Mistress Red-Dust ended up being at such a disadvantage when they fought. Because of being in the second generation Arch-Emperor’s sepulcher, and because of the curse she had suffered, she wasn’t able to draw upon the power of heaven and earth. Even despite that, Bai Xiaochun had barely been able to escape with his life.</p><br/><p>Now, he could see how truly powerful devas were.... The Bai Clan deva patriarch was fighting right outside his own city, in an area he was very familiar with. He was able to fight with the true power of a deva!</p><br/><p>Bai Xiaochun was shocked, and it only took a moment for him to realize why the Bai Clan patriarch seemed so much stronger than Mistress Red-Dust. There wasn’t time to ponder the situation, though. He was gripped by a sensation of deadly crisis, and knew that if he tried to directly fight against this huge foot, he would likely be wiped out of existence!</p><br/><p>As his mind spun, the foot closed in, and he took a step back. During that process, his body began to fade, and then he suddenly disappeared.</p><br/><p>In the moment he disappeared, the foot landed, crashing into the ground and causing countless amounts of dust and rubble to rise up.</p><br/><p>“You won’t be able to escape from me a second time,” the patriarch said coolly. He waved his hand, causing rumbling sounds to fill the air as another huge vortex appeared.</p><br/><p>The patriarch moved his right hand, causing the vortex to spin and simultaneously echo with thunderous roars. At the same time, a powerful gravitational force erupted, causing the air to distort as the power of time travel appeared!!</p><br/><p>This wasn't the true power of time travel, but it did wrap up everything in the area and pull it toward the vortex with destructive force, including nearby boulders, trees, and even mountains!</p><br/><p>At the same time, some distance off, Bai Xiaochun was fleeing with the power of his Undying Hex. However, as soon as the deva patriarch unleashed his shocking magic, Bai Xiaochun’s face fell, and his technique was interrupted.</p><br/><p>As soon as he appeared in the open, the shocking gravitational force grabbed onto him, and began to drag him backward toward the vortex.</p><br/><p>Even as it did, his eyes sparkled, and he spun in place. Then, afterimages blurred around him as he performed a double-handed incantation gesture and then threw his hands up above him!</p><br/><p>“Waterswamp... Kingdom!”</p><br/><p>His four clones stepped out to surround him, and also unleashed their Waterswamp Kingdoms. Instantly, a watery swamp appeared, and the shocking roar of a beast echoed out from inside. Then, numerous spike-like mountains began to rise up.</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The five curved, mountain-like claws that appeared created a scene that would shock anyone who was able to observe it. As they appeared in the open, the sky dimmed, and they slashed toward the vortex!</p><br/><p>“What is that!?” Up til now, the deva patriarch had remained completely cool and expressionless. But when the life essence spirit of Bai Xiaochun’s Waterswamp Kingdom appeared, his face fell!</p><br/>\n</div>"}