{"title": "Chapter 675: The Old Pervert!", "id": 675, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-675-the-old-pervert", "volume_title": "Volume 7", "body": "<h1>Chapter 675: The Old Pervert!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The mere thought of the Giant Ghost King’s stern, threatening features, and the profound gleam that was always present in his eyes which made it seem like he could peer deep into one's mind, caused Bai Xiaochun to shiver.</p><br/><p>“I'm finished. Kaput....” Deep regret filled his heart, and realized that he really, really should not have gone and performed spirit enhancements on his nascent soul. The entire world knew what had occurred, and the mere thought of that left him weak in the knees.</p><br/><p>And then he contemplated the potential consequences of his actions, and his heart began to race.... Thankfully, he was wearing his mask, and also had years of experience living under cover. Although he feared death as much as he always had, he had long since become an absolute master at keeping up an act.</p><br/><p>“The Giant Ghost King probably doesn’t know my real identity.... If he did, he wouldn't just send a message summoning me to a meeting.... My mask is incredible, so there’s no way anybody can sense my cultivation base fluctuations....” Inwardly, he was grasping at every possible straw to comfort himself, but on the outside, he seemed completely calm. Keeping his hands clasped behind his back, he gave a slight nod to the city guards, and then flew with them toward the royal palace.</p><br/><p>Along the way, his facial expression remained completely normal. However, inside, his mind raced as he tried to figure out why the Giant Ghost King might have summoned him. In the end, he was ninety percent confident that it was just a coincidence, and had nothing to do with his true identity.</p><br/><p>Although that made him feel a bit better, there was still a ten percent chance that he was in grave danger. As a result, he couldn’t wipe the worry away completely. He simply had to force himself to remain calm, and keep his expression neutral as he followed the guards toward the palace.</p><br/><p>The guards treated Bai Xiaochun very respectfully. Upon reaching a certain point, they clasped hands and departed, leaving Bai Xiaochun standing in front of the royal palace. A moment later, he strode inside, and the first thing he heard was the voice of Duke Deathcrier.</p><br/><p>“Your Highness, the Ghost King Orchid has not yet begun to bloom.... Furthermore, the Grand Heavenmaster made it clear to me that he will not open the Necromancer Kettle for us alone....”</p><br/><p>Next came the Giant Ghost King’s voice. “Go back to the Grand Heavenmaster and tell him that the Giant Ghost King agrees to owe him a big favor!”</p><br/><p>“Yes, Your Highness. I’ll go arrange things right away.” A very solemn expression could be seen on Duke Deathcrier’s face as he clasped hands and bowed to the Giant Ghost King. After turning around to leave, he saw Bai Xiaochun entering the palace, and a faint smile appeared on his face. Giving a quick nod to Bai Xiaochun, he left.</p><br/><p>Bai Xiaochun hurried over to the throne, doing his best to keep his anxiety under control. Once in front of the Giant Ghost King, he clasped hands and bowed deeply.</p><br/><p>“My respects, Your Highness!” The Giant Ghost King wore a grim expression on his face, as if he were wrestling with some important matter. When he looked over at Bai Xiaochun, a faint expression of surprise could be seen on his face. </p><br/><p>“Eee? You made a breakthrough?” At first, a look of praise could be seen in his eyes, but after a moment, it turned into something more like suspicion. He was an experienced and shrewd person, with exceptional insight, and had picked up on Bai Xiaochun’s nervousness. Of course, Bai Xiaochun had always been nervous in his presence. The difference was that, in the past, he never did anything to cover it up, whereas now... he was. The Giant Ghost King’s eyes flickered.</p><br/><p>Bai Xiaochun could immediately see the suspicion in the Giant Ghost King’s eyes, and it caused his heart to leap into his throat with the realization that he had slipped up. Considering his personality, the fact that he had just made a cultivation base breakthrough meant that he shouldn’t be walking around looking calm.... His heart began to race, and his nervousness mounted. Suddenly, an idea occurred to him, and he instantly made his decision. Without the slightest hesitation, he made himself seem even more nervous, so nervous that he even seemed scared. In fact, he averted his gaze so that he wasn’t looking at the Giant Ghost King.</p><br/><p>The Giant Ghost King looked at him silently, and as he did, vast pressure began to build up in the grand hall. Bai Xiaochun slowly began to tremble visibly, and sweat began to pour down him. It almost seemed like he couldn’t control himself... which was actually the case. He actually felt as if so much pressure was weighing down on him that he might be crushed into powder.</p><br/><p>As the pressure built, Bai Xiaochun finally moaned, “Your Highness, your humble servant made a grave error.... I didn't want to do it! But the thing is that the three great clans really do have it out for me. If it weren’t for the fact that your humble servant has such an impressive title, I think my poor little life would already have been exterminated.... By the way, the Bai Clan hates me especially deeply.</p><br/><p>“Therefore, your humble servant felt he had no other option. Despite the fact that Your Highness had other plans for the three clans, your humble servant secretly instructed certain people to go cause problems for them....” By this point, Bai Xiaochun really looked like he was about to weep from fear.</p><br/><p>The Giant Ghost King’s eyes widened. He had long since learned of the fact that Bai Xiaochun had sent people to put pressure on the three great clans. Therefore, this display of nervousness put him right in the middle of laughter and tears. Obviously, Bai Xiaochun misunderstood why he had been summoned, and had thus begun to grow nervous.</p><br/><p>“Enough with the histrionics!” the Giant Ghost King said, glaring at Bai Xiaochun.</p><br/><p>His glare instantly caused Bai Xiaochun to calm down inside. Externally, though, he looked up at the Giant Ghost King with glistening eyes.</p><br/><p>The Giant Ghost King could tell that Bai Xiaochun felt wronged, but decided to simply ignore it. Voice casual, he said, “I summoned you here today because of some orders that came down from the Arch-Emperor. An arrest warrant has been issued for Bai Xiaochun, major general from the Great Wall and cultivator from the Starry Sky Dao Polarity Sect. I’m entrusting the matter to you. If Bai Xiaochun appears in the territory I control, you will be sent to arrest him.”</p><br/><p>A serious expression appeared on Bai Xiaochun’s face. Without the slightest hesitation, he stuck his chest out and loudly replied, “Fear not, Your Highness! It was on my path to Giant Ghost City that I heard about this Bai Xiaochun. Hmmmphh! If Devil Bai dares to appear near Giant Ghost City, then your humble servant will apprehend him immediately!” </p><br/><p>His words were spoken with decisiveness that could sever nails and chop iron, and caused the Giant Ghost King to nod in satisfaction.</p><br/><p>“It's not really a big deal, to tell the truth. Unless he actually shows up, just forget about it. However, if you do run into him, be careful. Thankfully, you’ve made a cultivation base breakthrough, so that will help to some degree.” The Giant Ghost King then went on to offer a few more warnings and exhortations about the matter.</p><br/><p>“Your Highness, when it comes to my cultivation base breakthrough, I have you to thank.... If it weren’t for your insistence that I go into secluded meditation, your humble servant would not have succeeded. Your Highness, you truly are divine and mighty, matchless through eternity! The words you spoke to me were like a mystical elixir that pushed me to new heights. Your Highness, I do hope that you summon me more often for audiences, that thusly, my cultivation base can continue to improve with rapid speed!” Bai Xiaochun didn't seem embarrassed at all to have so instinctively launched into a bout of flattery.</p><br/><p>The Giant Ghost King snorted in response to Bai Xiaochun’s words, but inside, actually felt a twinge of pleasure. After all, he couldn’t forget about how Bai Hao had had the audacity to slap him across the side of the head and act in wildly presumptuous fashion. Therefore, this complete reversal was quite pleasing. After all, he was a mighty demigod, the type of person who could control every matter around him. If he wanted to, he could forgive anyone of anything. All of the karma had been resolved. In fact, after his cultivation base was restored, a mere thought on his part had retrieved all of the magical items he’d handed over.</p><br/><p>Everyone respected power, and as for this Bai Hao, even if he got stronger than he was, he would still be at the Giant Ghost King’s beck and call. Therefore, to hear a bit of flattery from him was quite pleasing to the ear.</p><br/><p>In terms of the fact that Bai Xiaochun had formed his nascent soul without any problems, the Giant Ghost King wasn’t interested in prying, nor did he even think to connect him with the wanted fugitive Bai Xiaochun. It wasn’t that the Giant Ghost King wasn’t quick-witted about such things, it was more that Bai Hao had a very clear and well-known background. Therefore, there was no reason to link him to Bai Xiaochun.</p><br/><p>Although the timing was a bit odd, the Giant Ghost King knew that since this Bai Hao had received a drop of his own soul-blood, that would also make it much easier for him to form a nascent soul. As one of the Giant Ghost King’s subordinates, Bai Hao’s power came from the good graces of the king, and for him to get stronger was naturally a good thing. The Giant Ghost King didn’t even bother to look into the matter of the little turtle. </p><br/><p>After their conversation was done, the Giant Ghost King waved his hand to dismiss Bai Xiaochun.</p><br/><p>At this point, Bai Xiaochun was sighing with relief in his heart. Backing up respectfully, he was just preparing to leave when he decided that he needed to make his act even more convincing. Looking over his shoulder, he opened his mouth as if he wanted to say something, but then held back.</p><br/><p>The Giant Ghost King noticed, and said, “What’s wrong now?”</p><br/><p>“Your Highness, might it be a good idea to go put a bit more pressure on the three great clans?” From the look in his eye, Bai Xiaochun seemed like he simply wasn’t willing to drop the matter.</p><br/><p>The Giant Ghost King looked at him grimly for a moment. The truth was that he really did have some special plans in mind for the three great clans. After all, the fact that the incarcerated patriarchs of the Bai and Chen Clans had Deva Realm cultivation bases was of importance to him. Furthermore, the Giant Ghost King knew that if the three great clans fell, other clans would rise in their place, and he didn’t really feel like dealing with weak, rising powers like that.</p><br/><p>However, after Bai Xiaochun made his suggestion, the Giant Ghost King thought about it for a moment, and then recalled the scene of being chased by those three clans.</p><br/><p>“You really were wronged in all of this.... Those three clans have been around for thousands of years, and have deep reserve savings. Perhaps that is what gave them the courage to rebel....” With that, he gave Bai Xiaochun a meaningful look.</p><br/><p>Bai Xiaochun was a bit taken aback, but after analyzing the king's words, his eyes began to shine. Then his heart began to pound as he realized that when the Giant Ghost King said <em>deep reserve savings</em>, he most likely meant that the three great clans were extremely rich.</p><br/><p>Furthermore, that indicated that the king was hinting that he should... go shake them down? Was this his reward for risking life and limb for the Giant Ghost King?</p><br/><p>Although he was excited by the prospect, he decided that he should probably double-check that his understanding was correct. “Fear not, Your Highness. My eyes are as sharp as swords. It doesn’t matter how deep the reserve savings of the three great clans are, your humble servant will see to the bottom of everything.”</p><br/><p>The Giant Ghost King didn’t respond at all, and in fact, even closed his eyes. Inwardly, he was pleased that Bai Xiaochun could pick up on the meaning of his words.</p><br/><p>Bai Xiaochun was immediately enthused by the Giant Ghost King’s reaction, and that it indicated his implicit agreement.... When Bai Xiaochun thought back to how the clans had chased him down, and how he had suddenly risen up in the world, his excitement began to build.</p><br/><p>“A shakedown.... I’ve never done anything like that. How exciting to be able to go shake down an enemy.... However, considering the fact that the Giant Ghost King didn’t issue official orders, it indicates that he wants me to keep things low key....” Clenching his fists excitedly, he turned and walked out of the grand hall.</p><br/><p>Even as he walked out, though, the lounging Giant Ghost King casually murmured, “The Chen Clan is particularly vile. Especially their clan chief. He always gets lucky with the women, and yet he dared to forge a taboo banner... hmph!” </p><br/><p>Although he spoke nearly under his breath, his words reached Bai Xiaochun’s as clear as day.</p><br/><p>In response, Bai Xiaochun’s jaw dropped, and he even stopped walking. Eyes turning up in thought, he realized that there were two aspects to what the Giant Ghost King had said that were important. The first was about the taboo banner, and the second... was when he said <em>lucky with the women</em>....</p><br/><p>As the wheels in his head turned, he murmured to himself, “That old pervert!!” </p><br/><p>Then, face beaming with righteousness, he pretended to have not heard, and strode out of the hall.</p><br/><p>After he left, the Giant Ghost King sat there on his throne, the five fingers of his right hand tapping each other as he calculated something.</p><br/><p>A moment later, he frowned and murmured, “I’m still not exactly sure of the timing. However, based on the date, the Ghost King Orchid in the Necromancer Kettle should be just about ready to bloom.”</p><br/>\n</div>"}