{"title": "Chapter 674: A Huge Sensation", "id": 674, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-674-a-huge-sensation", "volume_title": "Volume 7", "body": "<h1>Chapter 674: A Huge Sensation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Nine Serenities City and War Champion City weren’t the only two cities to be completely shaken. Spirit Advent City was also thrown into a huge commotion. However, there were simply too many heirs to the throne there. In fact, there were more than 10,000 people who could claim a connection to the royal bloodline. Although some among those heirs could be considered chosen, none of them were as spectacular as Gongsun Yi or Zhou Hong. It was actually one of the young women in the city who was the most famous.</p><br/><p>When news reached Giant Ghost City about what was happening in Arch-Emperor City, and that Bai Xiaochun had appeared, it also caused a huge commotion.</p><br/><p>Of course, Bai Xiaochun was unaware of that. His nascent soul sat giddily in the turtle-wok, feeling extremely pleased with how this session of cultivation was going. Eyes sparkling, he waved his finger at his eleven-colored flame.</p><br/><p>“Heh heh. Let’s keep going!” With that, the turtle-wok began to shine with brilliant light again. However, this time it wasn’t silver light, but rather, golden. Moments later, the ten silver designs on his nascent soul vanished, replaced by a single golden design!</p><br/><p>Instantly, his nascent soul grew a bit larger, causing Bai Xiaochun to gasp. Remembering that transformations would usually occur after a tenfold spirit enhancement, he suddenly felt uneasy.</p><br/><p>“My nascent soul isn’t going to change appearance, is it…?” He watched nervously as the golden light faded away, and then inspected his nascent soul. When he found that there were no fundamental changes, he breathed a sigh of relief.</p><br/><p>“Even stronger than before…. Based on how things are going, it seems that a fourteenfold spirit enhancement will be the peak of the early Nascent Soul stage. Normally speaking, even if I had some incredible techniques to use, I would need more than a hundred years to do that….” With those thoughts on his mind, he concluded that this was an opportunity that could not be passed up. Without the slightest hesitation, he began to work on the twelvefold spirit enhancement!</p><br/><p>Rumbling could be heard as a second golden design appeared on his nascent soul, and yet, he didn’t stop there. Soon, a third and fourth design could be seen!!</p><br/><p>A feeling of explosive strength filled his nascent soul along with the fourth golden design. Now he had the feeling that with a bit more effort, he could break through from the early to the mid Nascent Soul stage!</p><br/><p>However, he wasn’t prepared to do that at the moment. At this point, he had no choice but to stop. With that, he opened his eyes and looked down at his nascent soul. The difference between his nascent soul now and how it had been at the beginning was vast!</p><br/><p>“I’ve reached my limit,” murmured. “However, once I perform a fifteenfold spirit enhancement, then I’ll break through into the mid Nascent Soul stage!” Even as he spoke, his nascent soul flew back into his fleshly body.</p><br/><p>When the fourth golden design appeared on his nascent soul, the number fourteen appeared next to the name Bai Xiaochun on the Hell-Emperor Stele back in Arch-Emperor City. When that happened, the observing soul cultivators were stunned to the ultimate degree. None of them could even imagine what would happen if the successor of the Wildlands’ Hell-Emperor turned out to be Bai Xiaochun. It seemed almost too preposterous to consider!</p><br/><p>And yet, by this point, there didn’t seem to be any suspense at all regarding what would happen in the end…. It was at that exact same moment that the explosive aura of a deva suddenly rose up within Arch-Emperor City.</p><br/><p>Brightly-colored light flashed in heaven and earth, and the huge dragon in the clouds above was clearly taken aback as a woman flew up from the Giant Ghost Legion. She was beautiful and curvaceous, and yet possessed a murderous aura that was terrifying to the extreme. Furthermore, her eyes were filled with killing intent and madness. She was none other than… Mistress Red-Dust!</p><br/><p>Her cultivation base had long since recovered, but she had remained in secluded meditation, and was unaware of anything that was happening on the outside. However, her subordinates and high-ranking officers knew of her enmity with Bai Xiaochun, and therefore, had passed the news along to her.</p><br/><p>When she heard what the damnable, detestable Bai Xiaochun had done, it drove her into near madness. She flew at top speed to the Hell-Emperor Stele, where she glared at the name in 1st place, her body trembling and her murderous aura surging.</p><br/><p>When people realized that Mistress Red-Dust had arrived, they bowed their heads and clasped hands in respect. Everyone knew that despite the fact that she had only recently become the newest deva of the generation, her battle prowess was far beyond ordinary!</p><br/><p>“Bai Xiaochun… Bai Xiaochun….” A very grim expression could be seen on her face, and her eyes shone with cold light. As of this moment, she knew that Bai Xiaochun… must have reached the Heaven-Dao Nascent Soul stage. Anger burning, she pulled out a jade slip to send a message to her subordinates and officers.</p><br/><p>“Pay any price to find Bai Xiaochun. I want him alive!!”</p><br/><p>The army responded instantly. Soldiers began to rush to and fro within the army camp, issuing orders in preparation to follow Mistress Red-Dust’s orders and find Bai Xiaochun!</p><br/><p>In another location in Arch-Emperor City was a young woman who, like everyone else, was paying close attention to the situation with the Hell-Emperor Stele. Unlike Mistress Red-Dust, there was no icy coldness in her eyes, only anxiety and concern.</p><br/><p>She was none other than… Chen Manyao from the River-Defying Sect!</p><br/><p>She was a Wildlander, and her Master was a very important person, giving her a unique status in Arch-Emperor City. However, she would never be able to forget everything which had occurred in the River-Defying Sect, the Starry Sky Dao Polarity Sect, or the boat that had sailed across the Heavenspan Sea….</p><br/><p>In the years in which she had been back in the Wildlands, she had often thought back to the familiar faces she remembered from the past. More often than anyone, she thought of Bai Xiaochun.</p><br/><p>Back when she’d first heard that he had gone missing, she had assumed that he was dead, and had slipped into disconsolate melancholy.</p><br/><p>But now, his name had appeared on the stone stele, causing her eyes to sparkle with dazzling light.</p><br/><p>“Where are you, Xiaochun…?”</p><br/><p>Within the imperial palace in Arch-Emperor City was the Grand Heavenmaster, the very same man who had ordered the Arch-Emperor to go into secluded meditation. He was the only person other than the Arch-Emperor who actually held power over the various officials in the dynasty. All of a sudden, the Grand Heavenmaster opened his eyes.</p><br/><p>In that instant, the huge dragon in the air above the city trembled, and all of the powerful experts in the city shivered and retracted their divine sense, fearful of doing anything to offend the Grand Heavenmaster.</p><br/><p>The Grand Heavenmaster’s eyes immediately pierced through all creation to land on the Hell-Emperor Stele, and the name that occupied the 1st place position!</p><br/><p>A moment later, he looked away, and then, issued a new order.</p><br/><p>“Find Bai Xiaochun and bring him to me!”</p><br/><p>The orders came out, not from the Grand Heavenmaster, but rather, under the auspices of the current Arch-Emperor himself! Because of that, even the four heavenly kings had no choice but to acknowledge them….</p><br/><p>Before long, everyone in the Wildlands was searching for Bai Xiaochun.</p><br/><p>Around that time, Bai Xiaochun opened his eyes, causing the entire secluded meditation chamber to fill with something like the crackle of lightning. At the same time, the pressure of the Nascent Soul stage erupted out from him.</p><br/><p>He took a deep breath, a look of delight on his face as he performed a quick inspection of himself. Sure enough, he was in the great circle of the early Nascent Soul stage, and his nascent soul had four golden designs on it. There was no way for him to hold back his pride as he swished his sleeve to open the door of the meditation chamber. Then he swaggered out in grand fashion.</p><br/><p>Even as he was considering going to show off a bit and make sure everyone knew that he was no longer in Core Formation, he sent out his divine sense to find that there was a huge commotion going on around him.</p><br/><p>He could hear people discussing a certain matter, a matter that instantly got him quivering in fear. His previous grandiosity immediately vanished, and all joy evaporated, replaced by alarm and terror.</p><br/><p>“Did you hear? Bai Xiaochun showed up! What, you don’t know who Bai Xiaochun is? Well let me tell you….”</p><br/><p>“He performed a fourteenfold spirit enhancement on his nascent soul! That’s totally crazy! He must have done it with some powerful magical treasure!!”</p><br/><p>“The Arch-Emperor issued orders that everyone in the Wildlands is supposed to find him and capture him alive…. Well, it can’t really be any other way. If he ended up becoming the successor of the Hell-Emperor, it would be like some gigantic joke.”</p><br/><p>When Bai Xiaochun heard what people were talking about, the blood drained from his face, and he almost fell over on his face because of the fear. He staggered backward, suddenly recalling a key piece of information that had slipped his mind…. Anyone who performed a spirit enhancement on their nascent soul would have their name put on display on the Hell-Emperor Stele!!</p><br/><p>“This is big….” he thought. Already, regret was welling up in his heart as he wondered how much of a deadly disaster he had brought upon himself…. Heart pounding with anxiety, he quickly abandoned any ideas of showing off. He also decided that under no circumstances would he let anyone check his nascent soul. Thankfully, because of all the spirit enhancements he had performed, it was extremely powerful. Although people would now be able to sense that he was in the Nascent Soul stage, they wouldn’t be able to see any of the details of his nascent soul.</p><br/><p>With a bit of adjustment with his mask, he made it seem like, instead of being in the great circle of the early Nascent Soul stage, he had actually just made a breakthrough. Even as he did that, several beams of light appeared, patrolling soul cultivators of the city guard. They clasped hands and bowed to him, then one of them said, “His highness the king issued orders that after emerging from secluded meditation, Majordomo Bai is to go see him immediately!”</p><br/><p>“Huh?” Bai Xiaochun blurted, shivering and heart pounding.</p><br/>\n</div>"}