{"title": "Chapter 682: Changes", "id": 682, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-682-changes", "volume_title": "Volume 7", "body": "<h1>Chapter 682: Changes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun pointed in the direction of the Bai Clan, not at the auxiliary bloodline members, but at the encircled direct bloodline!</p><br/><p>His action of pointing his finger was like a crash of thunder. He didn’t make a speech. He didn’t grandstand. He simply pointed.</p><br/><p>Chen Hai was at his side like he had been the entire time, and as soon as Bai Xiaochun pointed out, the man's killing intent soared.</p><br/><p>“Carry out the orders of the exalted majordomo!” Chen Hai’s voice seemed to contain a rain of carnage as he spoke these words. At the same time, he blurred into motion toward the Bai Clan!</p><br/><p>Behind him, tens of thousands of cultivators followed, killing intent raging.</p><br/><p>Among them were dozens of Nascent Soul experts, as well as numerous necromancers. It was an entire army of deadly cultivators descending on the Bai Clan!!</p><br/><p>Fierce fighting broke out instantly, and although everyone in the clan had been prepared for it, it was still unexpected. Blood began to rain down almost immediately.</p><br/><p>“Bai Hao!! You unfilial bastard!!” the clan chief howled, his eyes bloodshot. The clan chief had never expected that things would play out so simply, that no mercy or compassion would be shown at all. After all, this man was Bai Hao’s father!</p><br/><p>He had originally hoped to try to talk matters out, to admit that he was in the wrong. He had hoped to acknowledge that Bai Hao was a member of the clan, and that for the sake of the clan, they should let bygones be bygones.... Of course, from the very beginning, he had also planned to figure out a way to seek revenge later on. But now... all of his plans were pointless.</p><br/><p>Bai Xiaochun did not waste time. He hoisted the blade, and then chopped it down!</p><br/><p>Rumbling sounds could be heard as Chen Hai and his men attacked. Screams began to rise up, as well as pleas for mercy. Although they reached Bai Xiaochun’s ears, he simply looked up into the sky, an unreadable expression on his face. Were Li Qinghou here to see him, or his Elder Brother sect leader, they would be shocked. This was a Bai Xiaochun who was very different from the Bai Xiaochun of the past.</p><br/><p>Although his fundamental personality had not changed, his methods and tactics had most certainly transformed.</p><br/><p>The auxiliary bloodline members looked on silently. They didn’t interfere, nor did they help the direct bloodline. They simply watched. The fifth young lady, the grand elder from the Hall of Justice, and everyone else did the same thing.</p><br/><p>Screams rang out from the direct bloodline clan members. The young servant girl who had scorned Bai Xiaochun was stabbed through the chest with a blade, and died with a look of despair on her face.... The old valet also met his end in horror, his eyes blank.</p><br/><p>All of the people who had scorned Bai Hao were put to death by Chen Hai and his men. They couldn’t even fight back. The direct bloodline elders who had chased after Bai Hao outside the clan or attacked him in Giant Ghost City were overwhelmed by despair. A few of them managed to fight back, but then, stained with blood, howled and tried to flee in various directions.</p><br/><p>“Loose arrows!” Chen Hai growled with a cold smile. Countless soul cultivators suddenly drew greatbows out, and within moments, a cloud of arrows pierced through the air. Then, the fleeing clan elders screamed as they were destroyed in body and soul!</p><br/><p>Bai Xiaochun didn't watch. Instead, he looked up into the sky, motionless and expressionless.</p><br/><p>The grand elder from the Hall of Corrections died with a bitter smile on his face, cut down by Chen Hai and two other Nascent Soul experts. Soon, the only person left standing was the clan chief.</p><br/><p>He looked around at the mountains of corpses, despair filling his face. Then he threw his head back and howled. Throwing all caution to the wind, he transformed into a beam of light that shot directly toward Bai Xiaochun.</p><br/><p>“If I die, I’m taking you with me, you unfilial bastard!!” As he shot through the air, numerous Nascent Soul experts moved to intercept him, and soon, fighting broke out in midair.</p><br/><p>The clan chief fought with utter ferocity, until he was only about 300 meters away from Bai Xiaochun. Soaked in blood, eyes filled with madness, he tried to push forward further, but was then set upon by more Nascent Soul experts.</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The fighting was fierce, and the clan chief was soon coughing up blood as he glared at Bai Hao, who was standing only 150 meters away. He was trembling, and his life force was almost out. His chest was caved in, and his nascent soul almost destroyed. His eyes were even beginning to fade. He was like a lamp running out of oil, unable to continue fighting, barely able to breathe.... And yet, in his madness, he continued to stagger toward Bai Xiaochun.</p><br/><p>Bai Xiaochun slowly looked down from the sky toward the clan chief. </p><br/><p>“Let him come over,” he said. The surrounding soul cultivators immediately stayed their hands and stepped back, allowing the clan chief to approach.</p><br/><p>Oh so slowly, Bai Xiaochun buried the image of the dying Bai Hao into the depths of his heart. Then he focused on the trembling, maddened clan chief.</p><br/><p>“Do you feel any regret at all?” Bai Xiaochun asked softly. “Bai Hao... is also your flesh and blood. Your son.”</p><br/><p>“Yes. I regret letting your mother die so quickly. I should have made her die screaming in pain! And I also regret the day you were born! I should have crushed you to death that instant!!” The clan chief truly had descended into madness, and even began to cackle maniacally. However, as he laughed, the light in his eyes slowly began to fade, until he simply toppled over onto the ground....</p><br/><p>The chief of the Bai Clan was dead!</p><br/><p>The members of the auxiliary bloodline stood there quietly, their heads bowed, their hearts filled with complex emotions and deep melancholy.</p><br/><p>The public square in the middle of the clan was filled with corpses at the moment. But there was still one person left alive. She was spattered with blood and shaking physically, and yet filled with the vilest of hatred. Deranged laughter rose up as she struggled to her feet.</p><br/><p>“Your mother was a slut, you son of a bitch. Get over here. Don’t you hate me? Why don’t you kill me yourself!?!? The only thing I regret is that the people I sent to kill you failed in their task!!”</p><br/><p>She actually should have died earlier, but the Nascent Soul cultivators who took the lead in the slaughter knew that Bai Hao’s enmity with Madam Cai was particularly deep. Therefore, they held back, injuring her and leaving her alive for him to deal with.</p><br/><p>Bai Xiaochun ignored the hysterical Madam Cai, and instead turned to look at Chen Hai.</p><br/><p>“This Madam Cai didn’t just send one assassin. She sent many. Get me their names.” With that, he took a step forward and vanished into the air. When he reappeared, he was in an abandoned courtyard residence somewhere in the Bai Clan.</p><br/><p>The courtyard was choked with weeds, in the midst of which could be seen numerous children’s toys, all of them old and rotting. Also in the courtyard was a well....</p><br/><p>Bai Xiaochun stood there for a long moment before sighing.</p><br/><p>“As Bai Hao’s Master, I am acting on his behalf to execute vengeance on you, Madam Cai.” He waved his hand, and the weeds in the courtyard vanished. The toys turned into dust....</p><br/><p>Ashes to ashes, dust to dust....</p><br/><p>Having accomplished these things, he left. On his way out of the clan, he looked over at the fifth young lady. Sensing his gaze, she looked up at him, and their eyes met.</p><br/><p>“Fifth Elder Sister, why don’t you act as the clan chieftess from now on.... Grand Elder, please offer her your support....”</p><br/><p>With a light sigh, the grand elder from the Hall of Justice looked at Bai Xiaochun and nodded. Then he turned and clasped hands respectfully toward the fifth young lady. As for the other surrounding members of the auxiliary bloodline, they slowly began to awaken from the nightmare of blood, whereupon they too clasped hands to the fifth young lady.</p><br/><p>Of course, Bai Xiaochun took the Bai Clan’s thousand years of reserve savings with him when he returned to Giant Ghost City. Along the way, Chen Hai turned to him and said, “We got the names you asked for. As for Madam Cai... she’s dead.”</p><br/><p>“Heavenly Marquis Chen,” Bai Xiaochun said softly, “might I trouble you to bring the heads of every name on that list to me within three days?” Chen Hai nodded somberly.</p><br/><p>By the time they returned to the city, word was already beginning to spread that the direct bloodline of the Bai Clan had been exterminated. Although it was shocking news, it wasn’t entirely unexpected. And of course, it further impressed upon people how vicious and merciless Bai Hao was.</p><br/><p>The slaughter which had been carried out caused Bai Hao’s reputation to grow. A mere look from him would cause people to immediately stop talking. A snort from him was like heavenly thunder that would resound in the hearts of all present.</p><br/><p>To the powerful organizations in the city, the lost lives of the Bai Clan’s direct bloodline became a clear reminder of what type of person Majordomo Bai was.</p><br/><p>He was in the good graces of the king, a powerful official who existed far above everyone else in the realm....</p><br/><p>Even devas like Duke Deathcrier felt pressure because of him. After all, nobody had done more for the Giant Ghost King than him.</p><br/>\n</div>"}