{"title": "Chapter 704: I'm Back!", "id": 704, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-704-im-back", "volume_title": "Volume 8", "body": "<h1>Chapter 704: I'm Back!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Along the way, Duke Deathcrier was inclined on a few occasions to simply ask about the situation. However, the ill premonition in his heart that continued to grow stronger prevented him from doing so.</p><br/><p>Bai Xiaochun stood next to him, face pale, anxious and doubtful as he continuously looked over their shoulders. Apparently worried that they were going too slowly, he gave constant reminders to pick up speed.</p><br/><p>Everything that was going on got Duke Deathcrier’s heart pounding harder and harder….</p><br/><p>“Just what did this guy do?” he thought, pouring all of the power he could into the giant ghost battleship to keep it moving as quickly as possible.</p><br/><p>After a long moment passed, he finally couldn’t hold it in any longer</p><br/><p>“What did you do?” he asked.</p><br/><p>Bai Xiaochun cleared his throat. Although he was already starting to regret his actions, he was still very proud of what he had accomplished. Sounding very casual, he said, “Oh nothing. I just kidnapped everybody else, and have them here in my bag of holding.”</p><br/><p>“What!?!? Everybody…? You kidnapped them?!” Despite being a deva, Duke Deathcrier’s mind began to spin as though it had been struck with a sledgehammer. Face filled with a look of incredulity, he looked, first at Bai Xiaochun, and then at his bag of holding. Then his cheek twitched.</p><br/><p>“You… you….” He actually couldn’t say anything other than that. However, he knew that the ramifications of what had been done were almost too monumental to calculate. Without even thinking about it, he drew upon one-hundred-twenty percent of his cultivation base to send the giant ghost battleship shooting at top speed through the air.</p><br/><p>Rumbling sounds echoed out as they proceeded along toward their destination….</p><br/><p>**</p><br/><p>As Duke Deathcrier and Bai Xiaochun got closer and closer to Giant Ghost City, the Dao protectors back at the Necromancer Kettle were starting to get a bit impatient.</p><br/><p>That was especially true of the old man from Nine Serenities City, who had a distinct glint in his eyes as he looked at the Necromancer Kettle. Despite being a deva cultivator, the bizarre nature of the Necromancer Kettle made it impossible for him to see what was happening inside.</p><br/><p>Next to him was the old woman who had come with Xu Shan. She was also starting to get more and more nervous, and occasionally turned to look in the direction Bai Xiaochun had fled in.</p><br/><p>“More than half the time has passed. Soon the exit will close. Something seems off….”</p><br/><p>“Even if they continued fighting after the exit opened, an entire hour has passed. After another hour, the exit will close, and then it will be very difficult for them to come out!”</p><br/><p>“Did something unexpected occur inside? No, there’s no way….”</p><br/><p>It wasn’t just the devas who were starting to get suspicious. The other Dao protectors were starting to feel uneasy. All eyes were focused on the Necromancer Kettle as more time ticked by. Anxiety mounted. After all, the chosen who were inside the kettle were all very important people.</p><br/><p>They were all sons and daughters of influential clans and families. Not only were they important in terms of status, their latent talent and cultivation bases were all beyond ordinary. There were even some whose names were on the Hell-Emperor Stele.</p><br/><p>These were the best of the best in their generation in the Wildlands, all of whom were destined to be powerful people in the future. There were some who were already certain to become devas, and it was even very likely that some would become demigods.</p><br/><p>If an accident occurred with even one of those people, it would be major news in the Wildlands. If something unexpected happened to more than ten of them, it would be ten times more shocking of an event….</p><br/><p>Not even the three heavenly kings would be willing to accept responsibility if something like that happened. An accident of that nature would be a blow to the soft spot that existed in all parties involved….</p><br/><p>Now that everyone was thinking along these lines, their unease grew more intense. Furthermore, because the second prince and Chen Manyao were also still inside, the middle-aged man from Arch-Emperor City was also starting to look very nervous.</p><br/><p>Eventually, the Dao protectors got so nervous that they began to cry out in anxious voices. “Time is almost up!! We can’t wait any longer!!”</p><br/><p>The old man from Nine Serenities City looked over at the Dao protector from Arch-Emperor City. Eyes flashing, he said, “Brother Lin, something happened in here!”</p><br/><p>“That's right, Brother Lin,” the old woman from Spirit Advent City said, her voice grating and eerie. “It’s a critical situation. The Necromancer Kettle belongs to the imperial clan. The Grand Heavenmaster must have a way to see inside of it!”</p><br/><p>Before long, almost all eyes had come to rest on that middle-aged man.</p><br/><p>It was quite a bit of pressure for him to deal with. Furthermore, he knew what those gazes represented: nearly eighty percent of the most important groups in the entire Wildlands…. This collection of cultivators was backed by many devas, and three demigods.</p><br/><p>“I’ll need to contact the Grand Heavenmaster and let him make the decision.” He quickly produced a jade slip and sent an urgent message. Moments later, the jade slip glowed with dazzling light, after which he crushed it.</p><br/><p>As the jade slip fell apart, it became flying ash that spread out in all directions, then rose up above them and created a fist-sized vortex. Blue light shone out from the vortex, which shot toward the middle-aged man. When he reached out and grabbed it… it turned into a fist-sized blue mirror!</p><br/><p>The mirror was clearly from ancient times, and was covered with countless faintly-glimmering magical symbols. Despite how old it seemed, it still radiated a heaven-shaking, earth-shattering aura!</p><br/><p>“The Grand Heavenmaster used a secret magic to deliver this mirror to me. I can’t use it on my own.” Taking a deep breath, he looked at the old man from Nine Serenities City and the old woman from Spirit Advent City. “Would the two of you mind providing some assistance?”</p><br/><p>They didn’t hesitate to fly over and unleash the power of their cultivation bases, sending deva auras out that caused heaven and earth to flash with colors.</p><br/><p>As their power entered the mirror, it shone with dazzling light that caused the other Dao protectors in the area to back up nervously. The three cultivators powering the mirror let out hoarse shouts as the blue light transformed into a column that shot directly toward the Necromancer Kettle!</p><br/><p>The air distorted around the blue column of light, which could pass through all restrictive spells and all manner of defenses. Ripples spread out on the surface of the Necromancer Kettle as it slowly… became transparent! Before long, everyone could see everything inside as clear as day…. And then, faces began to fall.</p><br/><p>“There’s nobody there!!”</p><br/><p>“Everyone’s gone!!”</p><br/><p>“How is this possible? There were more than a hundred of them…. Where did they go?!?!” Shouts of alarm could be heard in all directions. The old man from Nine Serenities City and the old woman from Spirit Advent City were so shocked that their cultivation base fluctuations reflected their astonishment.</p><br/><p>Worried that they were seeing things, they sent more power into the mirror, sending its light sweeping back and forth through the lands inside the Necromancer Kettle. Under the power of that light, even the densest of mists were dispersed. And yet… they still couldn’t find a trace of a single one of the chosen!</p><br/><p>The middle-aged man from Arch-Emperor City was shaking, and his mind spun with disbelief.</p><br/><p>“Wait,” someone said. “I can detect the aura of the Giant Ghost King!”</p><br/><p>As everyone began to reach the same conclusion, their eyes turned completely bloodshot, and their hearts began to burn with rage.</p><br/><p>“Everybody went missing, and Bai Hao was the only one to come out. This is definitely the handiwork of the Giant Ghost King!”</p><br/><p>“That Bai Hao is a mere Nascent Soul cultivator. How could he possibly dare to do something like this? It was definitely the Giant Ghost King’s doing!!”</p><br/><p>“Remember how Bai Hao looked when he came out? That must have been an act! Dammit!” Shouts of rage began to ring out. As for the old man from Nine Serenities City and the old woman from Spirit Advent City, both of them resorted to teleportations to rush in the direction Bai Xiaochun had left in.</p><br/><p>Enraged, everyone else began to follow!</p><br/><p>These people were no fools, and they all came to the conclusion that the chosen of their various organizations had been kidnapped by Bai Hao at the behest of the Giant Ghost King. Even more humiliating was the shocking fact that he had escaped from under their very noses.</p><br/><p>However, they didn’t dare to offend the Giant Ghost King, so they had no choice but to vent their anger on Bai Xiaochun.</p><br/><p>Rumbling sounds could be heard, and dazzling light flashed in the sky as more than a hundred powerful experts shot through the air in pursuit.</p><br/><p>Unfortunately for them, they had delayed for far too long. Bai Xiaochun and Duke Deathcrier were on the giant ghost battleship, which Duke Deathcrier was fueling with all the power he could muster. It was a bright beam of light, shooting through the air, closing in on Giant Ghost City!</p><br/><p>When Bai Xiaochun finally caught sight of the city off in the distance, he breathed a sigh of relief. He even started to get a bit excited.</p><br/><p>“Giant Ghost King, you fudge-licking prick. I'm back!!”</p><br/>\n</div>"}