{"title": "Chapter 707: Destiny Brought Us Together....", "id": 707, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-707-destiny-brought-us-together", "volume_title": "Volume 8", "body": "<h1>Chapter 707: Destiny Brought Us Together....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Restoring Bai Hao’s mind was of the utmost importance to Bai Xiaochun. Bai Hao was his apprentice, and if he had never been able to locate his soul, it might have been a different story. But after recovering it, there was no hesitation on his part about what to do.</p><br/><p>If this had happened back when he had first arrived in the Wildlands, it would have been very difficult for him to accomplish what he was now setting out to do. But now, he was a celestial necromancer, and had a vast amount of valuable treasures from the three great clans. Most importantly, he had two secret treasures from those great clans, the lotus seed pod, and the drop of blood.</p><br/><p>Those two secret treasures were specifically designed for use with souls. That was especially true of the blood drop, which was the secret treasure from the reserve savings of the Chen Clan. It could restore all of the memories that existed in the previous life of a soul, and turn that soul into something like a ghost cultivator.</p><br/><p>As for the lotus seed pod, it could be used to form a brand new body. Although he wasn't sure if it would work as well on dead ghosts as it could on living beings, he was determined to try. Despite that, he didn’t take action blithely. The lotus seed pod only had two seeds in it, and there was only one drop of blood. Therefore, he wanted to make sure he was thoroughly prepared before he began.</p><br/><p>In the end… he would only have one chance to succeed.</p><br/><p>In fact, he even paid a visit to the Chen Clan and had a meeting with their new clan chief. After talking the man up, and even offering a bit of compensation, he won him over with his sincerity, and acquired more detailed information on how to use the blood drop.</p><br/><p>After getting all the information he needed and returning, he only felt more nervous than before. “This drop of blood has some mystical powers. It can actually restore the memories of a soul’s previous life…. However, the process is very dangerous, and is very draining on the soul. Perhaps it would be a more certain process if it were a deva soul, but Bai Hao was only in Foundation Establishment when he died…. It’s hard to say whether or not I’ll be able to make it work….”</p><br/><p>However, there was nothing he could do about the matter. Bai Hao's soul was now a vicious entity, nothing more than a soul body that couldn’t practice any form of cultivation.</p><br/><p>Even if he restored his memories, it seemed he would be stuck for all eternity as a Foundation Establishment soul, unable to make any progress.</p><br/><p>“The only thing I can do is use a whole bunch of soul medicine during the blood fusion process…. It will be difficult to pull it off, but the results will definitely be better.” Eyes flashing with determination, he immediately made arrangements to buy up all of the soul medicine in Giant Ghost City.</p><br/><p>After becoming the city’s majordomo, he had been the recipient of numerous gifts, and had also ransacked the three great clans. As a result, he could certainly be considered well off. However, for Bai Hao’s sake, he didn’t hesitate to spend massive amounts of wealth on soul medicine.</p><br/><p>He had already built up a bit from ransacking the three great clans, and now that he spent so much money to acquire more, his stockpile began growing to terrifying proportions.</p><br/><p>As Bai Xiaochun began gobbling up all of the soul medicine in the city, terrifying things were shaking the hearts of all residents.</p><br/><p>More than a hundred powerful experts had come to visit the city, including three devas. All of them had been spitting mad, and yet, kept their anger under control. Instead of charging into the city itself, they settled down cross-legged outside, effectively encircling the whole place.</p><br/><p>And that had only been the beginning…. Afterward, numerous people appeared in the city via its teleportation portal. All of them were the type who had numerous followers, and didn’t bother to even reign in their surging energy as they headed to the royal palace to talk with the Giant Ghost King.</p><br/><p>Before even the first of such meetings concluded, the teleportation portal shone brightly again as more people arrived.</p><br/><p><span id=\"footnote-ref-ebdf\"><span><span id=\"footnote-ref-835e\"><span>A steady stream of dozens of people showed up every day. By this point, more than ten devas had entered the city. Of course, even a single deva was the type of monumental figure who could shake heaven and earth with the mere stomp of a foot. In fact, in the entire world, there weren’t even a total of fifty devas in existence. </span></span></span>[1]</span></p><br/><p>But now, more than ten were in Giant Ghost City, which left Duke Deathcrier with a very sinking feeling. Thankfully the Giant Ghost King hadn’t ordered him to go deal with these people, but had instead invited them to the royal palace to discuss matters.</p><br/><p>When he sent a group away, another would come to replace it. And thus, in a short period of only a few days, everyone in Giant Ghost City slowly grew numb to what was happening. Then guesses and speculations began to run wild. In the end, it was virtually impossible to keep the matter a secret.</p><br/><p>“What? Bai Hao acted on the orders of his highness the king to kidnap all of the chosen and heirs apparent of almost all of the nobility and aristocracy in the Wildlands!?!?”</p><br/><p>“Heavens! Is this Bai Hao addicted to kidnapping, or what?!?! First it was his father, then his highness the king, and now he kidnapped over a hundred chosen in one fell swoop!?”</p><br/><p>“His highness the king is playing a big, complicated game…. I really don’t understand what exactly he's doing.”</p><br/><p>As word spread, countless gasps could be heard in all corners of the city. By now, it was impossible to relate exactly how bold and powerful people took Bai Hao to be.</p><br/><p>Another three days went by, whereupon an intense roar shook heaven and earth in all directions. An enormous battle-axe appeared in the air above Bai Xiaochun’s residence, upon which stood a mighty figure who seemed capable of propping up all creation.</p><br/><p>“Nine Serenities King!” The Giant Ghost King immediately emerged from his royal palace and flew up to confer with the Nine Serenities King. After a moment, the Nine Serenities King’s face turned grim, and he followed the Giant Ghost King into the palace for a time before leaving.</p><br/><p>Soon after came the enormous mountain of flesh that was the Spirit Advent King. After that was the War Champion King. The things which the people of Giant Ghost City were seeing left all of them gaping in shock.</p><br/><p>Seven days passed. Gradually, things at the teleportation portal calmed down a bit. Of course, Bai Xiaochun tried to stay as out-of-sight as possible, and didn’t even dare to make inquiries to find out exactly what had resulted. He knew that the Giant Ghost King was obviously in a horrific mood.</p><br/><p>“Well, you can’t blame me! If you hadn’t screwed me, I wouldn’t have screwed you.” Despite feeling himself to be in the right, he knew who between the two of them was the most powerful. Muttering to himself, he remained in secluded meditation, and continued to buy up soul medicine. At one point, he also secretly took a trip to confer with Mrs. Chen.</p><br/><p>**</p><br/><p>Just as Bai Xiaochun had guessed, the Giant Ghost King was in a foul mood. During the seven days of meetings with various groups, he had sent away all of the various chosen that Bai Xiaochun had kidnapped. Some of the people who had come to retrieve their chosen were the type that the Giant Ghost King could completely disregard. There were even some he could intimidate with a mere look. But there were others who could force him to pay a bit of a price.</p><br/><p>For example, the Spirit Advent King and War Champion King. First, the Giant Ghost King broke the rules of the Necromancer Kettle, and then, due to a freak combination of other factors, had both of their heirs beaten half to death.</p><br/><p>The Nine Serenities King was even harder to calm down. In fact, the smile on his face only grew colder as their discussion proceeded. The Nine Serenities King had attacked the Giant Ghost King during his decay period, and had also broken certain rules himself, which showed his attitude and what he was capable of. Therefore, they were not able to get anywhere in their negotiation. Eventually, the Giant Ghost King called in the War Champion King and the Spirit Advent King to join the discussion, and in the end, the Nine Serenities King had no choice but to grit his teeth angrily and leave.</p><br/><p>The biggest headache of all came when dealing with the second prince. There was simply no way to work around the fact that he was part of the imperial clan. Although that clan was currently in decline, with most of the power being held by the Grand Heavenmaster, the second prince was still a prince. The imperial clan was still not the kind who would brook humiliation, and thus, it was to the Giant Ghost King’s great rancor that he paid a significant price to work everything out.</p><br/><p>The Giant Ghost King was currently standing in a pagoda in the royal palace. Kneading the bridge of his nose, he sighed and murmured, “Finally managed to send them all away.”</p><br/><p>During the process, he had schemed, he had formed alliances, he had used every trick in his book to minimize his losses as much as possible. In the end, he was left feeling exhausted.</p><br/><p>“It’s all the fault of that bastard brat!’ The mere thought of Bai Xiaochun caused his eyes to widen angrily. However, it was at that point that he felt two warm arms wrapping around him from behind. It was none other than Mrs. Chen….</p><br/><p>The Giant Ghost King turned to look at her, and his gaze softened. She took the opportunity to say some nice things about Bai Hao, and as a result, the Giant Ghost King’s anger faded a bit. He also began to think about all the good things Bai Hao had done for him.</p><br/><p>“Well, it certainly cost me, but at least I got the ghost king fruit. I guess it was all worth it! Without Bai Hao on my side, the ghost king fruit would likely have been taken by one of the other three kings. If that had happened, I would have ended up paying ten times the price that I did.” In the end, things did seem to have worked out fairly. Snorting, the Giant Ghost King decided not to worry about the matter anymore.</p><br/><p>**</p><br/><p>Bai Xiaochun waited for a few more days, and when it seemed that the Giant Ghost King wasn't going to be coming for him, he finally started to feel confident about the whole situation. With that, he put even more effort into buying soul medicine, and soon, had the stockpile he needed.</p><br/><p>With that, he gritted his teeth and started his work to restore Bai Hao’s mind!</p><br/><p>Of course, the matter was too sensitive, so he didn't dare to do his work in Giant Ghost City. If any mistakes occurred, the ramifications could be too severe. Therefore, he found a remote location outside of the city where he set up plenty of restrictive spells to make sure no one could see him. His preparations having been made, he settled his mind, pulled his soulhoarding pagoda out of his bag of holding, and then took out Bai Hao’s soul.</p><br/><p>A glowing halo of light surrounded the soul as it floated in Bai Xiaochun’s hand. It seemed confused at first, but quickly came to its senses, looked at Bai Xiaochun and then let loose a soundless howl of rage.</p><br/><p>Then it lunged at the halo as if to break past it and attack him. As for Bai Xiaochun, he looked at Bai Hao's soul, and many complicated emotions filled his heart. Within moments, Bai Hao's eyes began to shine with madness and greed, until Bai Xiaochun finally sighed and unleashed some of the pressure of his cultivation base.</p><br/><p>Instantly, the soul body in the halo shivered and backed down, instinctively fearful of him.</p><br/><p>“It is destiny that brought us together….” Bai Xiaochun murmured.</p><div id=\"footnote-ebdf\"><br/><p>1. To be clear, the text uses the generic word for “world”, which could be interpreted in different ways. Considering the context, it could mean the Wildlands, but more broadly, it could also mean the “world” that includes the Heavenspan region. There is no way to tell definitively from the context. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}