{"title": "Chapter 700: I Can Still Break Through!", "id": 700, "volume": 7, "url": "http://boxnovel.org/a-will-eternal-chapter-700-i-can-still-break-through", "volume_title": "Volume 7", "body": "<h1>Chapter 700: I Can Still Break Through!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A golden hurricane of countless blades descended onto Bai Xiaochun. However, his fleshly body defenses were already at a shocking level, and he also possessed numerous spirit enhanced treasures. Although he wasn’t a complete wild beast when it came to battle, the hurricane was still not enough to stop him.</p><br/><p>Cracking sounds rang out as the golden magical symbols slammed into him, and yet, not much happened as a result. In the blink of an eye, he was right in front of Gongsun Yi, where he clenched his hand into a fist and unleashed a fist strike!</p><br/><p>Before the strike could land, though, golden light shone in Gongsun Yi’s eyes as he called all of the magical symbols back, which then transformed into a huge wall.</p><br/><p>A rumbling boom could be heard, and Bai Xiaochun was stopped in place. The golden wall trembled, and cracks spread out across its surface, but it held fast. Behind it, Gongsun Yi coughed up a huge mouthful of blood, and then took a step toward Bai Xiaochun.</p><br/><p>“Is that all you’ve got, Bai Hao?!” he growled. However, inwardly, he was actually shocked; his cultivation base was under massive pressure, and although he wasn’t sure exactly how this Bai Hao could be so strong, he was convinced that it was because of some strange magical technique.</p><br/><p>However, there was no time to think about the matter at the moment. Relying on his surging battle spirit to suppress the instabilities inside of him, he performed a double-handed incantation gesture and then waved his finger at Bai Xiaochun. Instantly, the golden wall collapsed back into 100,000 magical symbols, which then formed together into the shape of a golden phoenix, which shot toward Bai Xiaochun with a piercing cry.</p><br/><p>“This Junior Champion King’s divine ability is incredible. It must have been given to him by the War Champion King…. I don’t have any Nascent Soul techniques, and the powerful techniques I do have take a lot of spiritual power, otherwise I could crush this Junior Champion King with ease.” Snorting coldly, he assessed Gongsun Yi’s cultivation base, which was beyond the great circle of the Nascent Soul stage, and was approaching the point of being half a step into the Deva Realm</p><br/><p>However, that last gap was not easily bridged, and would require the right set of opportunities to do so, as well as tenacious perseverance. As the golden phoenix bore down on Bai Xiaochun, he reached out into the air and made a grasping motion, summoning his black spear with its sixteenfold spirit enhancement. Not hesitating for a moment, he stabbed it toward the golden phoenix!</p><br/><p>The spear shot forth with heaven-rending, earth-crushing power, causing a string of sonic booms to echo out. Then it stabbed into the phoenix, unleashing a massive detonation. The resulting shockwave sent Gongsun Yi tumbling backward in the opposite direction.</p><br/><p>Then, Bai Xiaochun burst into motion, becoming like a black shooting star that crushed everything in its path as it headed toward Gongsun Yi.</p><br/><p>Gongsun Yi finally shuddered to a stop about 300 meters away, unable to prevent blood from spilling out of his mouth. Then he looked up at Bai Xiaochun, and the desire to do battle that existed in his eyes grew even more intense. Howling, he instantly began to charge back in Bai Xiaochun’s direction.</p><br/><p>“I'm the Junior Champion King. How could I possibly lose to you!?” Eyes bright red, he threw his hands out in front of him, causing the 100,000 magical symbols to form together into the shape of a golden battle-axe. Grabbing it by the haft, he hurled it violently toward Bai Xiaochun.</p><br/><p>Rumbling shook the area as Bai Xiaochun destroyed the battle-axe, causing the 100,000 magical symbols to collapse layer by layer. Although he was shaken, he didn’t slow down at all, and continued on toward Gongsun Yi in a streak of black light!</p><br/><p>As a result of the backlash, blood gushed out of Gongsun Yi’s mouth, and he was flung backward head over heels. Although a bitter chuckle escaped his throat, his desire to do battle had not been reduced in the least bit. Seemingly disregarding any fear of dying, he performed a double-handed incantation gesture to call back all of his 100,000 magical symbols. Dazzling golden light flickered as they teleported into the space in front of him, taking the form of a long golden staff!</p><br/><p>Gongsun Yi gripped the staff and then swung it with all his might, using both the power of his cultivation base and his impressive fleshly body to send something like a golden tempest toward Bai Xiaochun.</p><br/><p>“This Gongsun Yi’s divine ability is really remarkable!” Bai Xiaochun thought, shocked. At the same time, he felt a bit envious about the 100,000 magical symbols. Obviously, though, it was a secret magic of the War Champion King, something that could not be used outside of his organization. The golden staff descended upon him with mountain-toppling, sea-draining power. Abandoning his stabbing attack with his spear, he brandished it in front of him, causing the air to distort as he backed it with both cultivation base and fleshly body power.</p><br/><p>BOOOOOOOOOMMM!</p><br/><p>The resulting collision surpassed anything from before. A waterfall of blood erupted from Gongsun Yi’s mouth, and yet he seemed mad with the desire to do battle. It didn’t matter what injuries he received, he kept on fighting, and refused to retreat.</p><br/><p>This time, instead of forming a staff with his 100,000 magical symbols, he formed them into a hundred separate magical items!</p><br/><p>There were sabers, spears, swords, halberds, hatchets, battle-axes, hooks, tridents, and weapons of every other type. And not a single defensive item could be seen among them. Each and every one radiated an intense, murderous aura, and as Gongsun Yi waved his hand, they all shot toward Bai Xiaochun.</p><br/><p>“Use your trump cards, Bai Hao. Either I die in this battle, or you die!”</p><br/><p>Bai Xiaochun’s expression flickered. This Gongsun Yi possessed an intense desire to do battle, and a bizarre divine ability. He didn't even seem to be afraid of dying either. All of it left Bai Xiaochun feeling very shaken.</p><br/><p>By now, he was finally starting to understand what the true chosen in the Wildlands were like. Of course, all of the people he had captured so easily didn’t count.</p><br/><p>But Gongsun Yi, and even Zhou Hong, despite their flaws, could go berserk in battle, and show tenacious brutality. It was something that Bai Xiaochun hadn’t seen very often back in the Starry Sky Dao Polarity Sect.</p><br/><p>“He’s no match for me, but he still won’t surrender. Now that I think about it, it seems like he really is using me like a grindstone, to temper himself in that precarious location right between life and death….” A gleam of admiration appeared in Bai Xiaochun’s eyes, and he suddenly felt as if he owed some respect to this opponent. As Gongsun Yi closed in with a hundred magical items, all bursting with murderous auras, Bai Xiaochun took a deep breath and waved his hand to get rid of the black spear.</p><br/><p>His decision was to forgo the use of magical items. As he stood there, cracking sounds could be heard from within him as his aura shrank down. His energy and even his soul did the same thing.</p><br/><p>Then, a black vortex appeared around his right hand, which emanated terrifying fluctuations. Simultaneously, a shadowy figure appeared, domineering to the extreme, clad in imperial robes and wearing an imperial crown on his head. Considering the look in his eyes, he clearly felt scorn for everything in heaven and earth.</p><br/><p>“Want to find enlightenment in that spot between life and death? Well I’ll give you the chance!” Bai Xiaochun felt particularly impressed by how awe-inspiring his words were. Clenching his right hand into a fist, he stabilized his aura and then unleashed a fist strike onto Gongsun Yi!</p><br/><p>He didn’t use full power, instead limiting it to roughly fifty percent. But even still, the sky faded, and the mists in the area seethed. The black vortex around his hand expanded, becoming a black hole that shot directly toward Gongsun Yi!</p><br/><p>At the same time, the eyes of the shadowy emperor behind him distorted, causing a domineering air to erupt out as he merged into the fist, and the vortex. This was Bai Xiaochun’s trump card…</p><br/><p>The Undying Emperor’s Fist!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The fist strike made everything in the world seem to slow down. All eyes came to focus on it, and it became the only thing in existence!</p><br/><p>A piercing howl rang out from Gongsun Yi, and his eyes were crimson as he watched the fist approaching, and the black hole. Then he waved both hands out in front of him.</p><br/><p>“Day of the War Champion!” As his voice echoed out like thunder, his one hundred magical items sped up toward Bai Xiaochun’s Undying Emperor’s Fist.</p><br/><p>The instant the two made contact, all of the magical items shattered and were sucked up into the black, incapable of offering any resistance. Then the black hole continued on toward Gongsun Yi as if to swallow him up. Immediately, a sensation of imminent and deadly crisis filled him, battering his heart and mind like an enormous wave.</p><br/><p>However, in that dramatic moment between life and death, Gongsun Yi’s battle spirit did not grow weaker. Quite the opposite; it grew more intense! As it did, rumbling and cracking sounds suddenly echoed out inside of him.</p><br/><p>It was almost as if some sort of shackle within him had been broken; in that moment, a terrifying energy suddenly erupted.</p><br/><p>Countless clouds suddenly appeared up above him, which quickly formed into a face. Gongsun Yi’s face!</p><br/><p>Although it only appeared for a moment, the immense energy that came along with it indicated that he had just achieved a cultivation base breakthrough!!</p><br/><p>He was now half a step into the Deva Realm!!</p><br/>\n</div>"}