{"title": "Chapter 705: What Exactly Did You Do...?", "id": 705, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-705-what-exactly-did-you-do", "volume_title": "Volume 8", "body": "<h1>Chapter 705: What Exactly Did You Do...?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As Bai Xiaochun and Duke Deathcrier were still closing in on the city, the Giant Ghost King was in his royal palace, a very excited expression on his face as he looked at the ghost king fruit which he held in his hand!</p><br/><p>The way that he had acquired the fruit by means of the restrictive spell was a violation of certain rules, and yet, the fruit was simply too important to him. How could he possibly allow it to be acquired by others and then used to threaten him?</p><br/><p>He had really had no other choice than to grit his teeth and proceed with his plan.</p><br/><p>“I finally have all five of the ghost king fruits, and at long last I can remove the five elements flaw from my technique. By being able to switch back and forth between the five elements at will, I will no longer be subjected to the potentially deadly decay period!” With that, he threw his head back and laughed uproariously, his heart filled with intense levels of joy. After years and years of waiting, he had won out, despite being opposed by the united front of all his opponents. The fact that all of his plans and schemes had worked left him feeling very pleased.</p><br/><p>“The Nine Serenities King, War Champion King and Spirit Advent King were all scheming against me, the bastards. I might have broken the rules, but it was only after their plotting. Now I just need to lay low for a while and not give them any reason to cause me any problems. After some time passes, all of the issues can be resolved.” A faint smile could be seen on his face, and a bright gleam passed through his eyes. It was wonderful to have all matters under his control.</p><br/><p>Of course, he had no idea what exactly had occurred in the Necromancer Kettle. The restrictive spell on Bai Xiaochun didn't give him the ability to see what was happening from afar. It was specifically designed to be used the way it had with the Ghost King Orchid. But he wasn’t worried.</p><br/><p>Chuckling, he put the ghost king fruit away and prepared to go into secluded meditation to merge all five of the fruits into his body. Just when he was rising to his feet, his expression flickered, and he looked off into the sky.</p><br/><p>He immediately caught sight of the giant ghost battleship. As soon as it got close enough, two figures leapt off of its deck and flew toward his royal palace.</p><br/><p>Mixed emotions could be seen playing out on Duke Deathcrier’s face, and as for Bai Xiaochun, he seemed both grim and angry.</p><br/><p>“Bai Hao sure got back quickly,” the Giant Ghost King thought. “And he doesn't seem injured at all.” He cleared his throat awkwardly. He knew that he was in the wrong in the matter that had just occurred, and felt like simply avoiding Bai Hao. However, avoiding him wouldn’t resolve the situation, so therefore, he put a somber expression onto his face and then settled back down into his throne to wait.</p><br/><p>Bai Xiaochun shot at top speed toward the giant ghost statue, followed by a hesitant Duke Deathcrier. After reaching the royal palace, Duke Deathcrier clasped hands to Bai Xiaochun, then hurried back to his own residence, not interested at all in participating in the irksome events which were sure to follow.</p><br/><p>“This Bai Hao has got some guts, but I simply can't believe that he would do something like this unless he was acting on the orders of his highness the king…. Just what is his highness thinking? Is he really going to go up against all of the nobility and aristocracy in the Wildlands?” Duke Deathcrier sighed, truly unable to wrap his mind around what was going on.</p><br/><p>As Duke Deathcrier left, Bai Xiaochun hurried onward to the main entrance. At the moment, he was still very angry. After all, were it not for the fact that he was so incredible, his trip to the Necromancer Kettle would have been one of almost certain death.</p><br/><p>And the reason for that was because the Giant Ghost King had screwed him over.</p><br/><p>Gritting his teeth, he took a deep breath and buried his anger inside him, then snorted coldly in his heart and walked into the palace’s main hall.</p><br/><p>Trying to look very maligned, he loudly said, “Bai Hao offers greetings, Your Highness!”</p><br/><p>As soon as he saw Bai Xiaochun, the Giant Ghost King rose from his throne and said, “Ah, you’re back, Hao’er. Hahaha! You really performed a meritorious service this time!”</p><br/><p>He no longer looked somber like before, and even wore a kind smile. He did nothing to hide the praise in his eyes, and seemed like he truly was delighted to see Bai Xiaochun.</p><br/><p>It was also his first time ever addressing him as <em>Hao’er</em>….</p><br/><p>A strange expression could be seen on Bai Xiaochun's face, and he was just about to say something when the Giant Ghost King waved his hand dismissively.</p><br/><p>Stepping down off of the throne dais, it was with caring emotion that he said, “Not hurt at all, I see. Hao’er, you really did a huge favor for me this time. Son, I've already issued orders to throw a spirit banquet for the both of us. Now, tell me what it is you want. As long as it’s in my power, I’ll grant you any favor!”</p><br/><p>That only made Bai Xiaochun angrier though. Raising his voice, he said, “I don’t want any gifts. Those people really bullied me, you hear?! You have no idea, Your Highness. They all ganged up on me, and were clearly trying to kill me. I had no choice but to do something to protect myself. I may have offended some important people, but it was all in your service, Your Highness!”</p><br/><p>Obviously, the Giant Ghost King knew that in a situation in which more than a hundred people were chasing Bai Hao, it would be difficult for him to survive without injuring or even killing a few people. And yet, the Giant Ghost King was confident in being able to resolve any issues that had cropped up. “Ah, don’t worry about it. Everything you did was for me. Fear not. I won’t let anything bad happen to you.”</p><br/><p>The maligned expression remained on Bai Xiaochun’s face, but inwardly, he was starting to feel very pleased with himself. <em>Giant Ghost King, oh Giant Ghost King, you screwed me over first, so you can’t blame me for screwing you right back!</em></p><br/><p>Bai Xiaochun was about to say something more when a buzzing sound could be heard from within the Giant Ghost King's bag of holding.</p><br/><p>“They’re coming after you so quickly?” The Giant Ghost King’s eyes glittered, and a faint smile could be seen on his face as he produced a transmission jade slip from his bag of holding. He had been aware all along that, whatever Bai Xiaochun did in the Necromancer Kettle, it wouldn’t be possible to keep it a secret for very long. Therefore, he had long since prepared for the aftermath. With that, he poured some divine sense into the jade slip to power it up.</p><br/><p>Sounding very calm and composed, he said, “Nine Serenities Ki--”</p><br/><p>However, before he could even finish speaking, the enraged voice of the Nine Serenities King roared out like a volcano to fill the palace hall. “How shameless of you, Giant Ghost King!!”</p><br/><p>Assuming that the Nine Serenities King was talking about the matter of the ghost king fruit, the Giant Ghost King cleared his throat and said, “Nine Serenities King, let me expl--”</p><br/><p>Before he could say anything else, the Nine Serenities King responded in a voice that echoed like destructive thunder. It even caused the air around the Giant Ghost King to distort.</p><br/><p>“I couldn't care less about how you got that fruit, Giant Ghost King. We plotted against you, so we have no right to complain about you fighting back. But considering your status, how could you possibly do something to my son Zhou Hong? You listen to me, Giant Ghost King. The enmity between Nine Serenities City and Giant Ghost City is <em>not</em> over!!” With that, the Nine Serenities King severed the communication.</p><br/><p>The Giant Ghost King’s eyes widened. Thinking back to what Bai Xiaochun had just said, he looked over and said, “You fought with Zhou Hong? Is he dead?”</p><br/><p>Looking like the picture of righteous indignation, Bai Xiaochun replied, “Yeah, I fought with him, that big bully. Hmph! I left him with his poor little life, though.”</p><br/><p>Breathing a sigh of relief, the Giant Ghost King said, “As long as he’s not dead, then it’s fine.”</p><br/><p>At this point, the Giant Ghost King couldn’t help but muse that Bai Hao’s battle prowess really was incredible. Despite being chased by so many people, he still managed to injure Zhou Hong. Just when he was about to continue speaking, his jade slip once again began to vibrate. This time, it shook even more violently than before, and then, even more angry voices could be heard, many of them sounding like they wished to do battle, although not all.</p><br/><p>“Giant Ghost King, my son has always been stubborn and mischievous. He had this tribulation coming! I’ll be there in person shortly to express my gratitude!!”</p><br/><p>“War Champion King!?” The Giant Ghost King’s pupils constricted; of all of the other three heavenly kings, the one he feared the most was the War Champion King. Therefore, he was a bit confused by this latest message, and even more confused about what was going on. Heart thumping, he suddenly had a very bad feeling, and looked over again at Bai Xiaochun.</p><br/><p>“You fought with the Junior Champion King? He’s not dead either?”</p><br/><p>“Oh him?” Bai Xiaochun flicked his hand as if in disgust. Gritting his teeth, he said, “No, he’s not dead. That bastard was a really tough cookie, though.”</p><br/><p>A strange expression could be seen on the Giant Ghost King’s face, but before he could do anything else, his jade slip vibrated again. This time it was the Spirit Advent King, who seemed even angrier than the Nine Serenities King had been.</p><br/><p>“That mysterious daughter of yours is in Arch-Emperor City, isn’t she Giant Ghost King? Nobody else knows, but I do! Well, I think I know where I'm going next! I need to be more like you, you old bastard. Bullying people younger and weaker than you!” As the voice echoed out in the hall, the Giant Ghost King began to pant. Everything was happening too quickly, catching him completely unawares.</p><br/><p>Looking over at Bai Xiaochun, he was just about to ask a certain question when Bai Xiaochun took the initiative to say, “Don't worry, Xu Shan isn’t dead.”</p><br/><p>As the Giant Ghost King looked at Bai Xiaochun, his ill premonition grew more intense. And yet, before he could say anything, the jade slip in his hand began to vibrate over and over again. Countless messages poured in, some bitter, some pleading, some angry.</p><br/><p>The Giant Ghost King’s mind began to spin. Despite being a demigod, the current turn of events had him reeling in shock. Although most of the people who were sending the messages weren’t on the same level as him in terms of cultivation base, there were simply too many of them. It seemed like just about all of the nobility and aristocracy in the lands of the Arch-Emperor were reaching out to him.</p><br/><p>And that wasn’t even mentioning the fact that the other three heavenly kings were involved, and they were on the same level as him.</p><br/><p>Even the imperial clan messaged him, saying that the second prince was missing. The Giant Ghost King was dumbstruck by what was happening. Finally, he looked over at Bai Xiaochun, and weakly asked, “W-what… what exactly did you do in the Necromancer Kettle?”</p><br/>\n</div>"}