{"title": "Chapter 711: Xiaochun Erupts....", "id": 711, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-711-xiaochun-erupts", "volume_title": "Volume 8", "body": "<h1>Chapter 711: Xiaochun Erupts....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun had already been getting nervous. Handing Chen Manyao over was the same as putting his poor little life into the control of other hands. It wasn’t that he distrusted Chen Manyao, but when it came to critical matters of life or death, putting trust in other people wasn’t an option.</p><br/><p>His trust in Bai Hao was unswerving, but… it wasn’t the same with Chen Manyao!</p><br/><p>The Giant Ghost King was getting extremely angry, so much so that the coldness filling Bai Xiaochun’s secluded meditation chamber was tinged with killing intent.</p><br/><p>Bai Xiaochun immediately thought back to what the Giant Ghost King had been like right after he had gotten his cultivation base back; he had hovered there with a metal-type deva soul in hand, and had looked at Bai Xiaochun with utter imperiousness as he asked a single question.</p><br/><p><em>Give me one good reason not to kill you!</em></p><br/><p>Those words had scared Bai Xiaochun witless, and the way the Giant Ghost King looked now reminded him of that very day, and those very words.</p><br/><p>Then he thought about how he had nearly been killed protecting the Giant Ghost King, and how the restrictive spell had weakened his cultivation base back in the Necromancer Kettle. Without his Heaven-Dao Nascent Soul, he would likely have been chased down and killed by the more than one hundred chosen who had been his opponents.</p><br/><p>All of those things weighed down on his heart, and then combined with both the killing intent and freezing pressure from the Giant Ghost King, and his nervousness about what to do with Chen Manyao. He felt like he was stuck between a vicious wolf and a hungry tiger, and it caused his eyes to turn completely bloodshot.</p><br/><p>In any other situation, he would definitely be terrified in this moment, but right now, he didn’t feel like being terrified. Trembling, he glared at the Giant Ghost King and said, “You want to kill me? You want to attack me?”</p><br/><p>He wasn't even terrified in the deepest recesses of his heart. He couldn’t help but think about all his dealings with the Giant Ghost King up til now, and not only did it destabilize his aura, but it made his eyes turn completely crimson. Blue veins bulged out on his face and neck, and he suddenly erupted!</p><br/><p>“Say that again, Giant Ghost King!” he shouted in rage. “What the fudge!? I can’t believe you actually want to kill me!!</p><br/><p>“You want to attack me? I saved your life, Giant Ghost King!! I nearly died, you fool. I got injured over and over again!! And you? You were just testing me out. Testing, testing, testing. Even after your cultivation base was back, you were still testing me. I very nearly got killed before you finally managed to do something. You know what? Fine. Fine, I can accept all that. But then, after all is said and done, you’re <em>still</em> testing me?!?! I bet you’ll still try to test me after I'm dead, won't you!?!?” Bai Xiaochun had completely lost his cool, and was yelling so loud that it had the entire meditation chamber shaking.</p><br/><p>As for the Giant Ghost King, he was completely taken aback by the sudden outburst. He had only been trying to intimidate this Bai Hao a bit, with the goal of scaring him. He had never imagined that the result would be like this.</p><br/><p>“What gall!” he said angrily, glaring at Bai Xiaochun and sending more pressure roiling out.</p><br/><p>“Gall? Actually, I usually don’t have much gall, but today, you bet I do!!” Bai Xiaochun was so angry he was almost jumping up and down, and his voice only kept getting louder.</p><br/><p>“Ever since we got back to the city, my friend, it might have seemed like I was relaxing after a big victory. But the truth is that I did a lot important things for you! When I shook down the three great clans, the best item I recovered was that spiritjade statue. I knew it would help you in your cultivation, so I secretly delivered to you. But nobody knows that! They think I took everything for myself. Lots of people have been sitting around hoping I would mess up so that they could take the chance to kill me!</p><br/><p>“And it's not like you didn’t know, I told you about how worried I was!!” Bai Xiaochun’s yelling had the Giant Ghost King’s chest heaving in rage, and yet, there was nothing he could say by means of retort. Back when Bai Xiaochun had shaken down the three clans, the Giant Ghost King had merely reaped the benefits, and hadn’t thought much about what pressure Bai Xiaochun might have come under because of it.</p><br/><p>“You liked Mrs. Chen, and I didn’t hesitate to send her to you. You’re the Giant Ghost King, with a big reputation to maintain, and I'm Bai Hao, a nameless nobody. So I became the scapegoat. Do you know how badly people talk about Bai Hao nowadays? I might as well have the plague! People say that I'm a wife-stealer and a husband-killer! When I go out in the city, all of the men hide their wives so that I can’t even see them. Pretty much everybody hates me!</p><br/><p>“And it’s not like you didn’t know, I told you about how unfair it all was!!” Bai Xiaochun was physically shaking, not from fear, but because he had thrown caution to the wind. All of the rancor which had built up in him because of the various events connected to the Giant Ghost King had reached the point that he had no choice but to vent his feelings in one big eruption.</p><br/><p>The Giant Ghost King’s rage was reduced again because of what had just been said, and he even started to feel slightly guilty. He had to admit that what Bai Xiaochun was saying was true. The Giant Ghost King did very much care about his reputation, and had also heard about the vile things people in the city were saying about Bai Hao.</p><br/><p>“I told you I didn't want to go to the Necromancer Kettle, but you said the ghost king fruit was of vital importance. So I went. And what happened with the fruit? Hahaha! Much to my surprise, the restrictive spell, and in fact my own trust in you, became a noose around my neck! Do you know how quickly my cultivation base dropped after that restrictive spell unraveled? Can you imagine the bitterness I felt when more than a hundred chosen were all trying their best to kill me? The big bro who I had trusted in actually plotted against me. I almost died in that Necromancer Kettle!</p><br/><p>“And it’s not like you didn’t know about that, I <em>told</em> you!!” The more Bai Xiaochun talked, the more worked up he got. That was especially true of the incident in the Necromancer Kettle, which continued to stab at his heart like a needle. If it weren’t for the fact that he was in the Heaven-Dao Nascent Soul stage, he would definitely have died in there.</p><br/><p>And there was only one ultimate culprit: the Giant Ghost King himself!</p><br/><p>The Giant Ghost King’s mouth was hanging open as if he wanted to respond, and he was still clearly enraged, but at the same time, had nothing to say.</p><br/><p>“Of course, I remember you said that the other three heavenly kings were working together against you, and were trying to blackmail you. So despite the bitterness in my heart, despite the grief, I captured all of those chosen so that you could vent some of your frustration. I handed them all over so that you could blackmail everyone else right back! And you think it was out of ill will that I did that?! If I really had it out for you, I would just have killed all of them. Maybe it would have made things tough for me, but it would have made things <em>really</em> tough for you!</p><br/><p>“And it’s not like you didn’t know. I explained it all to you!!” By this point, Bai Xiaochun’s anger seemed to be tinged with despair, and had the Giant Ghost King hesitating as he thought back to everything that had gone on between the two of them.</p><br/><p>“Let me ask you, Giant Ghost King, have I ever asked anything of you? Which of the things that I've done have hurt you?! And let’s not even get into the Devil Penitentiary! I already risked my life to settle that account. Or was that not enough!?!?” The more Bai Xiaochun yelled, the angrier he got.</p><br/><p>“Even people in the tiniest little clans have multiple wives and multiple concubines. And I just want this one girl! Is that really such a big deal?! One girl, that’s all! And over that, you’re actually willing to attack and kill me!?!?” The bitterness in Bai Xiaochun’s words was such that even the Giant Ghost King was starting to feel… that he really had gone a bit too far….</p><br/><p>After finishing his outburst, Bai Xiaochun started to recover his senses, whereupon he began to sweat all over. His heart was immediately gripped with anxiety, and he began to wail inwardly as his guts twisted in fear.</p><br/><p>“I’m finished,” he thought. “Kaput. I lost control and got all impulsive….” He already felt like he was about to collapse mentally, but realizing that he had already gotten himself into this situation, he couldn’t stop now. Gritting his teeth, he put on the ultimate expression of bitterness.</p><br/><p>“I know,” he said softly. “I know. You’re the king, Your Highness, and a demigod too. I'm a nobody. You can discard me any time you wish. I guess what pains me the most is that I foolishly took you to be a true big bro to me….”</p><br/><p>To see Bai Xiaochun standing in front of him trembling like he was caused a bit of a flush to rise up the Giant Ghost King’s neck. If anybody else had spoken to him like this, he would have done nothing more than snort coldly. However, if there was one person in this heaven and earth who qualified to talk to him like this, and even prevent him from responding, it was Bai Xiaochun.</p><br/><p>And as he thought about the situation, he realized that it was exactly as Bai Xiaochun had said. Bai Xiaochun had served him with loyalty and integrity, and had accomplished all the tasks that he had been assigned. He was also very obedient. Although he tended to be a bit of a brown-noser, the Giant Ghost King actually liked that.</p><br/><p>In fact, most of the rewards he had bestowed upon him were honorary at best. He hadn’t really given him anything substantive. Furthermore, he was a genius when it came to conjuring flame. He was so daring that he had single-handedly thrown his own clan into chaos, and then kidnapped the king. He had been completely on his own when he crushed virtually all of the top chosen in the Wildlands. He was actually such an outstanding person that not even the Giant Ghost King had ever met anyone like him, not even his own daughter. She had a high cultivation base, but when it came to her strategies and tactics, she simply couldn’t measure up.</p><br/><p>The Giant Ghost King knew that someone like this would eventually soar to the highest heights, as long as he didn’t perish or get killed along the way…. If the former happened, then the two of them would be inextricably linked in various ways. Finally, the Giant Ghost King sighed, and in a very calm and reasonable voice, said, “Hao’er, it’s been a long time since I've come to view you as my own son.”</p><br/><p>At this point, Bai Xiaochun sighed inwardly, and knew that the danger was past. “Giant Ghost King, I only have one question. After we got back to the city together, did I ever ask you for anything?”</p><br/><p>The Giant Ghost King didn’t respond at first. Bai Xiaochun hadn’t actually asked for anything other than this one girl…. And if you didn't take into consideration her impressive background, then it really wasn't a very big deal.</p><br/><p>However, Chen Manyao was a personal apprentice of the Grand Heavenmaster. The Grand Heavenmaster had asked about her, and the Giant Ghost King couldn’t ignore him. After a moment wrestling with the issue, determination filled his eyes, and he looked at Bai Xiaochun, convinced he had come up with a good idea.</p><br/><p>“Well, this Bai Hao is completely outstanding, so… might as well do it!”</p><br/><p>After a final moment of thought, the Giant Ghost King sighed and said, “Hao’er, you’re right, I’ve never really given you anything. But, I happen to have a daughter who has a higher cultivation base than Chen Manyao, and is even more beautiful than her. Ten times as beautiful! How about I give her hand to you in marriage!?”</p><br/>\n</div>"}