{"title": "Chapter 747: Get Rid Of The Evil Scourge!", "id": 747, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-747-get-rid-of-the-evil-scourge", "volume_title": "Volume 8", "body": "<h1>Chapter 747: Get Rid Of The Evil Scourge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Strangely enough, after Bai Xiaochun made up his mind, Chen Manyao and Xu Shan did not start fighting. Instead, they staked out their own territory within the shop itself. From the look of it, they were less interested in paying attention to Bai Xiaochun, and more interested in having a competition between the two of them.</p><br/><p>It was a simple type of competition…. They would see who could sell the most soul medicine…. The customers who entered the shop had two choices. Go with the beloved apprentice of the Grand Heavenmaster, or with the cherished daughter of one of the heavenly kings.</p><br/><p>Thankfully, Bai Hao was also present, and was often swarmed with customers because of the situation.</p><br/><p>That got him very nervous. Unfortunately, in this case, the act he was putting on for safety purposes actually ended up forcing him to stay right in the middle of a deadly situation. After all, he was supposed to be an expressionless soul slave. Such a soul slave would not retreat to the back room to ask for help, and therefore, he had no other choice but to brace himself, suppress the shivers he felt because of the incisive gazes of the two young women, and receive the customers.</p><br/><p>The business was in utter chaos by this point…. Chen Manyao and Xu Shan were sticking to their guns, and were even calling on their connections both in Arch-Emperor City and Spirit Advent City. Many soul cultivators who would normally never patronize the shop were now flocking to it to buy soul medicine, many of them in boldly large quantities.</p><br/><p>Of course, profits skyrocketed. Bai Xiaochun was always shocked to hear the nightly reports from Bai Hao about the day’s business. And considering how things were playing out, he was more determined than ever to not step out of the back room for even a moment. Thanks to his continued work with seventeen-colored flame, he was becoming more and more confident and proficient. He even did a few experiments, and although all of them failed, he was confident that success was just around the corner.</p><br/><p>Unfortunately, the situation with Chen Manyao and Xu Shan only continued to escalate. Half a month later, the two young women had called upon so many friends to come buy soul medicine that even the nobility and aristocracy got involved.</p><br/><p>Obviously, both Chen Manyao and Xu Shan were extremely influential. Whether it was their personal status, their place in the power structure of the Wildlands, their cultivation bases, or their good looks, they were both among the best of the best. It was only natural that women like them would have plenty of potential suitors.</p><br/><p>Some people actually placed Chen Manyao and Xu Shan in the same league as Mistress Red-Dust, and regarded the three of them as the three celestial goddesses of the Wildlands. It wasn’t that there weren’t other women who were similarly good-looking, but when all of the factors were considered, those three occupied the pinnacle.</p><br/><p>Even some of the imperial princes were taken with them. It was almost impossible to estimate how many young men had their eye on them.</p><br/><p>When it came to Bai Xiaochun, many young women had originally discounted him because of his connection to Mistress Red-Dust. They knew that the Giant Ghost King had intended for the two of them to be Daoist partners. However, that plan was clearly not working out very well. Now that Chen Manyao and Xu Shan were openly vying for him, many other young women finally began to make their own secret inquiries about the matter. And many of them went over to Borough 89 to confirm for themselves what was happening.</p><br/><p>When they personally saw Chen Manyao and Xu Shan in such open and hostile competition, it really got people thinking. Many people realized that Chen Manyao was acting very differently than she usually did. At the same time, feelings of envy and jealousy toward Bai Xiaochun began to grow even more prominent. Thankfully, he had quite a reputation. Whether it was because of the incredible battle prowess he had put on display in the Necromancer Kettle, or the faint eighteen-colored flame he had produced, many people feared him.</p><br/><p>However… it was roughly at this time that rumors began to spread. They started within the nobility and aristocracy, and slowly began to become more widespread. And of course, with each telling, they got more sensational….</p><br/><p>According to one rumor, Chen Manyao <em>hadn’t</em> fought Bai Hao in the Necromancer Kettle. She had been captured by him, and then taken to a secluded location…. That alone might not have meant much. However, Bai Hao had a horrible reputation in Giant Ghost City. He was a wife-stealer, and clearly a perverted person. And according to what everybody said, those descriptions were no exaggeration. For a man like that to be alone with a sexy woman in a secluded location…. Well, there was little question as to what would happen.</p><br/><p>And that was the perfect explanation for why Chen Manyao, who was normally a quiet and docile girl, would suddenly act so brashly after Bai Hao came to Arch-Emperor City.</p><br/><p>Rumors spread about Xu Shan as well. Supposedly, Bai Hao had used some mysterious method to topple her defenses and win her heart.</p><br/><p>Of course, it only went to prove how incredible he was. After all, he had actually vanquished two of the top three celestial goddesses in one fell swoop.</p><br/><p>Although the rumors started out between only a few people, they spread rapidly until all of the chosen were talking about them!</p><br/><p>In reaction, some of them howled in rage, and others gritted their teeth angrily. Overall, most of them hated Bai Xiaochun down to their marrow. Furthermore, whenever anyone refuted the rumors, there were always people who would vehemently assert that they were true.</p><br/><p>“What kind of a person is this Bai Hao? He steals wives and then kidnapped the peerlessly beautiful Chen Manyao for several days? I think we all know what must have gone on between the two of them during that time.”</p><br/><p>“Yeah, the evidence is conclusive. There’s no other explanation for the strange behavior of both Chen Manyao and Xu Shan. Dammit, this guy is a walking scourge!!”</p><br/><p>The gossip intensified, until eventually there were people claiming that they had actual evidence. And of course, it didn’t take long for the rumors to spread beyond the circle of the nobility and aristocracy. Soon, even the lowliest soul cultivators had heard. It was a scandal that was the talk of the town….</p><br/><p>When Chen Manyao and Xu Shan heard the rumors, they were enraged. However the explanations they provided did no more to stop the flood of rumors than a pebble could stop the tide from coming in.</p><br/><p>Eventually, things reached a breaking point. The Spirit Advent King was so angry that he sent one of his subordinates, his deva-level earthly duke, to Arch-Emperor City to bring Xu Shan home.</p><br/><p>Almost at the same time, Chen Manyao’s Master, the Grand Heavenmaster, issued orders requiring her to return to him, after which he placed her on lockdown.</p><br/><p>Although one might think that the matter would end there, the gossip only intensified. Eventually, the chosen members of the nobility and aristocracy in Arch-Emperor City reached the point where they couldn’t control their rage.</p><br/><p>“This Bai Hao has to die!! Rid the people forever of this evil scourge!!”</p><br/><p>It was hard to say who took up the call first, but before long, all of the chosen were up in arms. Of course, not all of them were mindlessly going along with the mob. Some of them, such as Little Wolfgod and Li Tiansheng, knew exactly what was going on. They were actually hoping to take advantage of the situation to their benefit.</p><br/><p>They egged people on, and also fanned the flames of the rumors. Before long, a crowd of chosen that was about half Nascent Soul cultivators and half Core Formation was marching toward Bai Xiaochun’s shop in Borough 89, killing intent burning!</p><br/><p>Zhou Hong was among them, his eyes glittering coldly. “Let’s see how you fight back this time, Bai Hao! It won’t matter how incredible your battle prowess is…. This isn’t the Necromancer Kettle, so if you hurt or kidnap people, their clans will definitely fight back with full force! If you piss off the upper echelons of leadership in Arch-Emperor Dynasty, then even if the Giant Ghost King wants to save you, he’ll have to pay a heavy price!</p><br/><p>“And if you aren’t on top of your game, then this time… you’ll be cut down like the stray dog you are! Whether you make the first move or not, you’re going to lose, and nobody will be able to save you!”</p><br/><p>Zhou Hong was more excited than ever. He was definitely the type who would seek revenge over the smallest grievance, and being crushed by Bai Xiaochun in the Necromancer Kettle was a humiliation and a nightmare that he could never be rid of. He hated Bai Xiaochun with a passion, and all of his efforts at revenge had failed. But this time, he was certain that he would succeed.</p><br/><p>“I had almost nothing to do with this mob. I just got the ball rolling. If there’s an investigation, I won’t be implicated…. The truth is that he really just pissed too many people off. Maybe I did pull a few strings, but Bai Hao’s true killer won’t be me, it will be all of Arch-Emperor City! Heh heh!” Chuckling sinisterly, Zhou Hong sped along with the mob.</p><br/><p>Hundreds of figures could be seen streaming through the city streets, completely ignoring the city guards as they descended onto Borough 89!</p><br/><p>When people realized who made up that mob, they were completely shocked, even the city guards.</p><br/><p>“Was that Chen Xiong?!”</p><br/><p>“Hey, that’s Little Wolfgod, Li Tiansheng, and… Zhao Dongshan!! They’re all top chosen!!”</p><br/><p>“What are they doing!? It looks like something really important!!”</p><br/>\n</div>"}