{"title": "Chapter 757: Do You Or Do You Not Dare?!", "id": 757, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-757-do-you-or-do-you-not-dare", "volume_title": "Volume 8", "body": "<h1>Chapter 757: Do You Or Do You Not Dare?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>On two occasions, Bai Xiaochun had drained Zhou Hong of life force with absolutely no consequences. In fact, he had actually become famous, and even increased his overall standing as a result. And now, he had caught the attention of the Grand Heavenmaster, and had been given the matchlessly terrifying title of inspections commissioner.</p><br/><p>Zhou Hong wasn’t the only one to be terrified by the situation. Virtually all of the aristocratic chosen were the same. Even their clans as a whole were shaken. A person who had once been a nameless nobody was instantly the focus of all attention, and someone that no one could afford to ignore.</p><br/><p>It was a sudden turn of events that many people had trouble accepting. Of course, news spread rapidly, and before long, the wily old foxes in the aristocracy began to put the puzzle pieces together, and come to an understanding of what the Grand Heavenmaster was thinking….</p><br/><p>“Something big is coming….” It was hard to say who came to this conclusion first, but soon, everyone was talking about it.</p><br/><p>When the Spirit Advent King heard about the situation, he removed any restrictions on his daughter Xu Shan. As for the Nine Serenities King, after Zhou Hong returned, he treated his injuries and then gave strict orders that he wasn’t to set foot out of Nine Serenities City!</p><br/><p>When the Giant Ghost King heard the news, he sat there on his throne for a long moment, various expressions playing out on his face. In the end, he sighed.</p><br/><p>“If the Grand Heavenmaster wants him, can I really refuse…?” He shook his head, mixed emotions visible in his eyes.</p><br/><p>Mistress Red-Dust returned to the Giant Ghost Legion, wrapped up in her own thoughts and speculations about what it all meant.</p><br/><p>Because of one single order given by the Grand Heavenmaster, the entire Arch-Emperor Dynasty was now astir. In fact, somewhere deep in the imperial palace, in a majestic hall, a man sat on an imperial throne, clad in imperial robes. As soon as he heard the news, his hands clenched down onto the dragon-shaped arms of his throne, and his entire body went stiff.</p><br/><p>Meanwhile, Bai Xiaochun followed the black-robed figure through the imperial palace. He was no longer strutting, but rather, looking around vigilantly. Although he was pleased by how things were playing out, he was still fearful and anxious about this Grand Heavenmaster.</p><br/><p>Although Bai Xiaochun couldn’t make out the black-robed man’s face, he could sense how stern and sinister he was. It put quite a bit of pressure onto Bai Xiaochun, and he was just thinking of saying something to ease the tension between the two of them when the man seemed to realize what he was thinking.</p><br/><p>“From now until the moment we reach the Grand Heavenmaster, keep your mouth shut!”</p><br/><p>Bai Xiaochun was not very pleased at how impolite the response to his unspoken question had been. After all, he was now the inspections commissioner. However, considering that this person was a deva, and also had been sent personally by the Grand Heavenmaster, it seemed like a good strategy to just give in to him now. However, there didn't appear to be any need to actually fear him.</p><br/><p>“This shadowy bastard tried to screw me over earlier. Back when he delivered the Dharmic decree, he intentionally made it seem like he wanted to kill me. All to frighten me….” That made Bai Xiaochun even madder, but he knew what to say and how to say it, and therefore kept his expression calm as he followed the black-robed man through the imperial palace.</p><br/><p>The palace was huge, and was as impressive as a celestial paradise, but Bai Xiaochun wasn’t in the mood to enjoy it. He focused on trying to keep track of the path they were following, until eventually, they arrived at the entrance of a grand hall.</p><br/><p>It seemed ordinary, without any ornate decorations. It could even have been described as simple. There was something ancient about it, and in the main courtyard in front of the entrance, there was a cauldron with incense burning in it, the smoke spiraling high up into the sky.</p><br/><p>Not a single person was present, making it seem like the type of place few people would be willing to come to.</p><br/><p>“Wait here.” With that, the black-robed man proceeded forward a few steps before vanishing without a trace. Bai Xiaochun looked at the main door, which was closed, and then around at the silent courtyard. Finally, he stood there quietly waiting. For some reason, the huge hall seemed like an enormous beast staring down at him.</p><br/><p>Bai Xiaochun swallowed hard. It would be impossible not to be nervous in a moment like this. However, after mentally reviewing the situation, he still felt like he should be fine. After all, it wouldn’t be difficult for the Grand Heavenmaster to cause trouble for him if he wanted to. Considering they were in Arch-Emperor City, the man could have apprehended him at any time he wished.</p><br/><p>As he stood there waiting, he tried to decide how to carry himself in this meeting.</p><br/><p>“It probably wouldn’t be a good idea to resort to flattery. The Giant Ghost King likes that kind of thing, but I don’t know enough about the Grand Heavenmaster. What’s the first thing he's going to do? Act awe-inspiring? Or maybe chide me…?” As he sat there stewing in anxious thoughts, he suddenly realized that something seemed off, as if someone were looking at him from above. Slowly looking up, he saw that high up in the clouds, an enormous head was hanging down, looking at him with a curious expression. It was a dragon!</p><br/><p>At the same time, intense pressure descended, pressure that Bai Xiaochun could tell surpassed Chen Haosong. Obviously, this dragon… was comparable to a demigod!</p><br/><p>Bai Xiaochun had seen this very same dragon from afar when he had first arrived at Arch-Emperor City. But now, he was right in front of it, only about 300 meters away. He could see virtually every detail about it, including the sea of scales that covered its body.</p><br/><p>Although Bai Xiaochun was a bit alarmed to be so close to a dragon, he quickly put a smile onto his face, waved, and called out a greeting.</p><br/><p>“Hi there…!” Almost immediately, the dragon’s eyes glittered. Then, Bai Xiaochun sensed a wind blowing against his face, whereupon he discovered that the dragon had dropped its head down further, until it was only a bit more than a meter away from him.</p><br/><p>Bai Xiaochun gasped in shock, and began to tremble at having something so huge right in front of him. He could even feel its breath on him, which was when he realized the dragon was actually sniffing him curiously.</p><br/><p>At this point, he really felt like crying, and took a step back. As he did, the dragon moved forward! Scalp tingling, Bai Xiaochun kept the friendly smile on his face, and was about to say something else when the voice of an old man drifted out from inside the hall.</p><br/><p>“He likes you.”</p><br/><p>Bai Xiaochun turned to find that, at some unknown point, the door to the hall had opened, and visible in its depths was an old man.</p><br/><p>He wore a long white robe, and somehow seemed like a god or divine being. His gaze was the type that seemed to make everything else unimportant, as though a mere glance from him could make the darkest places bright.</p><br/><p>It was a sensation that caused Bai Xiaochun’s heart to tremble. This man was definitely the same man who had been projected into the River-Defying Sect… Chen Manyao’s Master!</p><br/><p>In fact, even if he had never seen him before, Bai Xiaochun would have instantly been able to tell that this was the Grand Heavenmaster. Without any hesitation, he clasped hands and bowed.</p><br/><p>“Your humble servant Bai Hao offers greetings, Grand Heavenmaster!”</p><br/><p>“Come in,” the Grand Heavenmaster said with a slight smile. He wasn’t as intimidating as Bai Xiaochun had imagined, and after a moment, seemed like nothing more than an old man. In fact, after he smiled, that divine sensation on him faded away.</p><br/><p>Obviously, he was very different from the Giant Ghost King, which actually got Bai Xiaochun more nervous as he scrambled to decide how to act. As he walked into the hall, the huge dragon watched him go, then slowly disappeared up into the clouds.</p><br/><p>As Bai Xiaochun walked further into the hall, his anxiety mounted. He really wasn’t sure how to act, but was ready to play it by ear and adjust at a moment’s notice.</p><br/><p>The Grand Heavenmaster didn't seem to care about how nervous Bai Xiaochun was. After looking him up and down, he said, “I asked you here so that I could ask you a question…. Do you or do you not dare… to investigate all the important people in the dynasty, and find out which of them… have interrupted the peaceful cultivation being practiced by the Arch-Emperor?!”</p><br/><p>Although he spoke the words slowly, they caused a strange energy and pressure to build up in the entire hall.</p><br/><p>Bai Xiaochun blinked a few times, already starting to get excited by what he was hearing. Considering that he wanted revenge, the chance to investigate all of the important people in the imperial court was the perfect chance. If he said they were loyal to the Arch-Emperor, then that meant they were, whether they actually were or not!</p><br/><p>Expression brightening, he slapped his chest and passionately declared, “Grand Heavenmaster, there’s no need to ask whether I dare or not. As long as you give the order, I will dare to do anything. Investigate the aristocracy? Ha! I’ll even investigate the Arch-Emperor!”</p><br/><p>A strange, amused expression could be seen on the Grand Heavenmaster as he asked, “Aren’t you afraid of the Arch-Emperor?”</p><br/><p>Bai Xiaochun hesitated for a moment before cautiously asking, “Well, um… what cultivation base does he have?”</p><br/>\n</div>"}