{"title": "Chapter 770: Your Humble Servant Has A Plan", "id": 770, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-770-your-humble-servant-has-a-plan", "volume_title": "Volume 8", "body": "<h1>Chapter 770: Your Humble Servant Has A Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun didn’t even blink a single time in response to the Grand Heavenmaster’s question. Considering how serious the man was acting, he unhesitatingly said, “Grand Heavenmaster, I’d say there’s a high likelihood that <em>all</em> of them are loyal to the imperial clan. And especially Chen Haosong. That bastard is definitely on the side of the Arch-Emperor!”</p><br/><p>Bai Xiaochun was still angry at how much Chen Haosong seemed to want to kill him, and figured this was the perfect opportunity to do something about it.</p><br/><p>Clearing his throat slightly, the Grand Heavenmaster said, “Oh? Do you have any proof?”</p><br/><p>“Proof? Of course! Just moments ago, Chen Haosong clearly wanted to kill me. Grand Heavenmaster, you personally appointed me as the inspections commissioner, and I’m completely and utterly loyal to you. The fact that he actually wants to kill me does a lot to show what he's thinking. Grand Heavenmaster, why don’t we just get rid of them all!”</p><br/><p>The Grand Heavenmaster looked at Bai Xiaochun out of the corner of his eyes. He knew of the petty differences between Chen Haosong and Bai Xiaochun, and also knew what type of person Bai Xiaochun was. Therefore, he simply ignored his urgings, and looked thoughtfully toward the depths of the imperial palace.</p><br/><p>When Bai Xiaochun realized that the Grand Heavenmaster was ignoring him, he sighed inwardly at how indecisive the man was. When you had to kill, it needed to be done without hesitation!</p><br/><p>“If I were him,” he murmured to himself, “I would definitely kill Chen Haosong immediately. There’s no reason to be so wishy-washy about it.” After a bit more time passed, Bai Xiaochun realized that the Grand Heavenmaster was still ignoring him, and seemed lost in thought. Therefore, Bai Xiaochun decided to temporarily forget about what had just happened outside.</p><br/><p>As he did, he began to ponder other matters, such as all of the wealth he had plundered from the Li and Chen Clans. That was when he started wondering if the Grand Heavenmaster was being like the Giant Ghost King, and waiting to get his split.</p><br/><p>“Grand Heavenmaster, the Li and Chen Clans were swimming in wealth. I got a lot of treasure from them, a shocking amount really. I can’t believe some measly heavenly marquises actually had so much money. Obviously, they were well-connected to the Arch-Emperor.” His testing words had absolutely no effect whatsoever. The Grand Heavenmaster still seemed lost in thought, leading Bai Xiaochun to wonder what he was thinking about.</p><br/><p>After a moment of hesitation, he said, “Grand Heavenmaster, I’ll send some people over right away to deliver all of the confiscated treasure….”</p><br/><p>However, the Grand Heavenmaster still didn’t respond. By now, Bai Xiaochun was starting to feel a lot of pressure, and started to wonder if the Grand Heavenmaster suspected him of having taken some things for himself during the shakedowns….</p><br/><p>Clearing his throat, he said, “Um… Grand Heavenmaster, I just remembered that the Li Clan had a sort of spirit mountain….”</p><br/><p>Shockingly, though, the Grand Heavenmaster continued to ignore him.</p><br/><p>Scowling on the verge of tears, Bai Xiaochun said, “Grand Heavenmaster, I just recalled that the Chen Clan had a piece of spirit jade….”</p><br/><p>It was around this time that the Grand Heavenmaster finally looked back at Bai Xiaochun, although he didn't seem to be focusing his eyes, as though he were still staring into space.</p><br/><p>It almost made it seem like he was privy to all of the secrets in the world, a thought that caused Bai Xiaochun’s heart to start thumping.</p><br/><p>“Grand Heavenmaster, it just occurred to me that there was a big batch of soul medicine in the Li Clan….”</p><br/><p>As his words trailed off, the Grand Heavenmaster suddenly spoke in his hoarse voice.</p><br/><p>“Do you know what is the most difficult thing to understand, Bai Hao?” With that, his eyes came into focus, and he turned to look off into the distance.</p><br/><p>His words had Bai Xiaochun feeling more nervous than ever as he tried to determine the meaning of them. Could he be suspecting that Bai Xiaochun had actually embezzled more than what he had just admitted to?</p><br/><p>In his unease, he even contemplated whether or not he should hand over the Rainbow Spirit Thistle from the Li Clan. It was actually very irritating that the Grand Heavenmaster was being so stingy. He hadn’t embezzled that much, and yet the man kept digging away at him.</p><br/><p>Even as he stood there trying to decide what to do, the Grand Heavenmaster continued.</p><br/><p>“The hearts of men! Nothing in the world is more difficult to understand. Wouldn’t you agree, Bai Hao?” There seemed to be some strange power at work within those words. As soon as they entered Bai Xiaochun’s ears, he felt like crying. He almost couldn't believe that the Grand Heavenmaster was being even more stingy than the Giant Ghost King. After all, Bai Xiaochun had done all the work, and yet, the Grand Heavenmaster was taking all the rewards.</p><br/><p>Not daring to hide anything else, he quickly said, “Grand Heavenmaster, it turns out my memory is a bit bad. I just now realized that the Li Clan actually had a stalk of--”</p><br/><p>However, before he could finish, the Grand Heavenmaster interrupted him, his voice hoarse and his pupils as black as night.</p><br/><p>“The hearts of men are unfathomable. And not just the nobility and aristocracy of the Arch-Emperor Dynasty, or the Arch-Emperor himself. I am the same. You know, if it hadn’t been for me, when the Arch-Emperor failed to step into the Demigod Realm all those years ago, the Arch-Emperor Dynasty would have fallen apart…. I cowed the four heavenly kings, and I kept the dynasty in one piece. I repelled the invading forces from the Heavenspan River…. You know, sometimes I think I should follow the example of the Celestial from Heavenspan Island, and just completely eradicate my enemies. Remove the sun and the moon, and leave the sky open and clear!” As these words left his mouth, he straightened up. He was no longer stooped, but rather, stood tall and straight. He pulsed with an energy that was difficult to put into words, and seemed like a completely different person than before. Rumbling sounds filled heaven and earth, and even the light of the sun and moon seemed to fade.</p><br/><p>All of a sudden, the Grand Heavenmaster didn't seem at all like an old man to Bai Xiaochun. He seemed like a giant who could prop up the heavens, as though a single thought on his part could cause the sun and moon to perish, and cast all heaven and earth into darkness!</p><br/><p>The energy was so intense that Bai Xiaochun was forced to take a few steps backward, his heart pounding the entire time. However, the effect only lasted for a moment before the Grand Heavenmaster stooped back down, bowed his head, and sighed.</p><br/><p>The sky returned to normal, and all heaven and earth went still. However, Bai Xiaochun’s heart was still racing, and he was panting. At this point, the Grand Heavenmaster turned to look at him.</p><br/><p>“What did you just say? The Li Clan had a stalk of what?”</p><br/><p>Bai Xiaochun stared back at him in mute shock, proverbial tears welling up in him. At this point, he realized that he had misjudged the situation. The Grand Heavenmaster didn’t care at all about the wealth which had been confiscated during the shakedowns. He had been sighing and thinking, not about the treasure, but rather, about his personal issues. Furthermore, the words he had spoken had never had anything to do with the confiscated wealth.</p><br/><p>Bai Xiaochun swallowed hard as he raced to come up with an idea of how to make sure he could keep everything he had earned during the shakedowns. To have the Grand Heavenmaster's gaze leveled on him caused beads of sweat to appear on his forehead as he nervously said, “Um… what was it the Li Clan had? Ah, that doesn’t matter. Grand Heavenmaster, you are completely right that the hearts of men are unfathomable. However, that's not important! In fact, it doesn't really matter whether or not people are loyal to you, or to the Arch-Emperor!”</p><br/><p>At first, what he said didn't make much sense even to himself. However, as the words left his mouth, an idea began to form more clearly in his mind, and he continued, “The most important thing is what they will do if both you and the Arch-Emperor are present at the same time! Who cares if Chen Haosong and the others are actually loyal to the Arch-Emperor?! Which of them will actually admit that openly?</p><br/><p>“Even if all of the nobility and aristocracy in the entire Arch-Emperor Dynasty are loyal to the Arch-Emperor, why does that matter?! None of them would ever dare to admit to that in your presence! That goes to show that you have them under your thumb!” The more he spoke, the more everything made sense, and the more excited he looked.</p><br/><p>“Grand Heavenmaster, perhaps you can’t force everyone to be loyal to you, nor can you determine for sure who is disloyal. However, what you can do, sir, is make everyone fear you!</p><br/><p>“Grand Heavenmaster, your loyal servant is of the opinion that you don’t need to try to figure out who is loyal to whom. You just need to figure out who they fear the most!” In the end, he was talking so loudly that he was almost yelling. At the same time, the Grand Heavenmaster’s eyes slowly began to narrow in thought. That in turn caused Bai Xiaochun to feel very proud of his words. Not only did they sound wonderful, they were actually packed with many levels of truth.</p><br/><p>Considering that the Grand Heavenmaster was now thinking seriously about his words, Bai Xiaochun couldn’t help but sigh at how unparalleled he was under heaven.</p><br/><p>“In order to protect that medicinal plant from the Li Clan,” he thought, “and also Que’er, I have to go for broke.” Clearing his throat, and feeling like the picture of outstanding righteousness, he struck while the iron was hot.</p><br/><p>“Grand Heavenmaster, your humble servant has a plan….”</p><br/>\n</div>"}