{"title": "Chapter 777: The Formula For Eighteen-Colored Flame!", "id": 777, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-777-the-formula-for-eighteen-colored-flame", "volume_title": "Volume 8", "body": "<h1>Chapter 777: The Formula For Eighteen-Colored Flame!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“You!!” Zhao Xionglin was both taken aback and infuriated. However, the Grand Heavenmaster was still present, so he didn’t dare to lose his temper. He could only stand there panting, face twisted with rage, cursing inwardly at this blatantly open attack.</p><br/><p>“Damn this Bai Hao!” he thought. “He gave me a Foundation Establishment-level soul and is going to demand that I give him a deva soul in return!!” Zhao Xionglin was overwhelmed with anger, grief, and pain. To him, a deva soul was the type of treasure that could be encountered by chance, but never searched for and found.</p><br/><p>After all, deva souls were very useful for anyone attempting to become a deva, and could increase the chances of success significantly. Therefore, what Bai Xiaochun had just done was like adding injury to insult.</p><br/><p>Zhao Xionglin stood there trembling at how horrible things had just become….</p><br/><p>The other aristocrats in the area were stunned as they watched Bai Xiaochun walking off. They could almost feel cold chills running down their backs as they realized that Bai Xiaochun was the type of person who would take any opportunity that came his way.</p><br/><p>“Totally ruthless….”</p><br/><p>“He’s clearly screwing Zhao Xionglin over….”</p><br/><p>“When he goes to get that soul tomorrow… Zhao Xionglin will have to give him a deva soul….”</p><br/><p>Although the Grand Heavenmaster was already some distance away, with his back to the square, he was aware of everything that was happening. When he realized what Bai Xiaochun was doing, his cheek twitched.</p><br/><p>“Ah, whatever,” he thought. “Chalk it up as a reward for him.” Bai Xiaochun’s performance had been spectacular, and left the Grand Heavenmaster feeling very pleased. Therefore, he simply shook his head and continued to leave.</p><br/><p>When Bai Xiaochun saw that the Grand Heavenmaster wasn’t interfering, his eyes lit up with excitement, and he strutted the entire way to Heavenmaster Hall. When they arrived, the Grand Heavenmaster didn’t say much. He just asked Bai Xiaochun to produce his Inspections Manor command medallion, whereupon he waved his finger, sending a black glow into it.</p><br/><p>“Henceforth, you command 3,000 troops! Head back and rest up a bit. Before long… your 3,000 corpse troopers can be mobilized, and then you can go get your reward yourself.” With that, he entered Heavenmaster Hall, not having even turned to look at Bai Xiaochun. Furthermore, he had never said a word about the objects Bai Xiaochun had secreted away from Heavenly Marquises Li and Chen. That alone spoke to the profits Bai Xiaochun would have after shaking down more clans.</p><br/><p>Excited at the prospects, Bai Xiaochun clasped hands and loudly said, “Grand Heavenmaster, for you, Bai Hao will go through hell and high water!”</p><br/><p>After the Grand Heavenmaster disappeared into the hall, Bai Xiaochun turned, feeling profoundly pleased as he left the imperial palace, taking his 1,000 corpse troopers with him. Looking very grand and magnificent, he quickly made his way back to the Inspections Manor.</p><br/><p>As for the heavenly dukes and marquises, and all the other nobility and aristocracy, although they hated him so much their gums itched, when he passed by, they didn’t dare to even look at him the wrong way.</p><br/><p>Back at the Inspections Manor, the first thing he did was use the command medallion to make connections with more of the subterranean coffins.</p><br/><p>Rumbling sounds filled the entire Inspections Manor as 2,000 coffins shot up into the air!</p><br/><p>“Awaken, my army of corpse troopers!” he shouted excitedly. Cracking sounds instantly rang out as the 2,000 coffins opened up, and numerous black-armored, burly men appeared.</p><br/><p>All of them emanated auras of rot, and the weakest among them were in the mid Nascent Soul stage. Furthermore, this time, there were four who were half-devas!</p><br/><p>As the eyes of the corpse troopers opened, heaven-shaking, earth-shattering murderous auras erupted out!</p><br/><p>A black vortex appeared in the air above the Inspections Manor, which instantly attracted much attention from the people nearby.</p><br/><p>“There are more corpse troopers over in the Inspections Manor?!?!”</p><br/><p>“Is that… 2,000 of them? In addition to the original 1,000, Bai Hao now controls an army of 3,000!!”</p><br/><p>“3,000 corpse troopers! That level of power… is terrifying. He alone could start a large-scale war!!”</p><br/><p>Many among the nobility and aristocracy of Arch-Emperor City realized what was happening, and they were shaken. Grim expressions appeared on their faces as they realized that Bai Xiaochun was building up terrifying levels of power.</p><br/><p>Bai Xiaochun was so excited he was trembling, and his eyes shone with bright light. Looking at his 2,000 new corpse troopers, he waved his hand, causing the original 1,000 to fly out. They quickly formed ranks, whereupon the black vortex above the Inspections Manor grew even larger.</p><br/><p>In addition to that, further inspection of the command medallion revealed that, in addition to the 2,000 new corpse troopers, he now had access to a new divine ability.</p><br/><p>After studying it briefly, he sent some divine sense into the medallion, which caused a black glow to appear. The black glow shot toward the corpse trooper who had absorbed some of the toxic gas created by the Heart Of A Woman, and then risen to level of a deva. As soon as the black light touched the corpse trooper, he trembled, and his energy rose. Even as Bai Xiaochun waited in eager anticipation, he threw his head back and roared.</p><br/><p>As he did, his aura returned to the quasi-Deva Realm. However, Bai Xiaochun could tell that, if necessary, he could absorb the auras of other corpse troopers to temporarily go back to that peak level of power!</p><br/><p>This was one of the powers of the inspections commissioner command medallion which he had been gifted!</p><br/><p>“Nobody will dare to provoke me now!” he exclaimed, laughing heartily. Although it wouldn’t be correct to say that he was invincible, it would be as easy for him to take out a deva as it would be to flip over his hand!</p><br/><p>He currently had a quasi-Deva Realm corpse trooper, five who were half-devas, and nearly 3,000 in the Nascent Soul realm. That was enough power… that if Bai Xiaochun returned to the eastern Heavenspan region, he could challenge the Starry Sky Dao Polarity Sect!</p><br/><p>“It was definitely the best choice to side with the Grand Heavenmaster!” Bai Xiaochun couldn’t have been more smugly happy. All of his worries about being glared at by the Arch-Emperor had vanished.</p><br/><p>“I'm definitely a big shot in the Wildlands now! Not very many people are as important as me!” Feeling almost intoxicated, he was just preparing to take his 3,000 corpse troopers out for a stroll in the city to make sure everyone knew how awesome he was, when all of a sudden, Bai Hao’s voice could be heard from inside his bag of holding, and he sounded overjoyed.</p><br/><p>“Master! I finally finished the formula for eighteen-colored flame!”</p><br/><p>Bai Xiaochun’s eyes went wide with excitement, and he even laughed aloud. Today was truly a wonderful day, so wonderful that he decided not to go for a walk. Instead, he set his 3,000 corpse troopers out to stand guard in the area, then went into secluded meditation and sealed himself up tight. At that point, Bai Hao flew out into the open.</p><br/><p>Bai Hao quickly inscribed the formula into a bone slip, then handed it over to Bai Xiaochun, who began to study it with intense anticipation.</p><br/><p>A moment passed, and he retracted his divine sense from the bone slip. After some thought, he looked over at Bai Hao, thinking about how priceless this formula would be anywhere in the Wildlands.</p><br/><p>It would be considered even more valuable than a deva soul!</p><br/><p>Countless people wanted to have that formula. However, it was something that only belonged to clans with earthly necromancers. And clans like that would not lightly hand over the formula!</p><br/><p>“Well done, apprentice,” Bai Xiaochun said sincerely. “If Master can become an earthly necromancer, it will count as an enormous service on your part. What would you like as a reward? Name anything!”</p><br/><p>Bai Hao’s heart swelled at having pleased his Master. To him, Bai Xiaochun was a Master, but more importantly, his only family. Just being able to help him, and see him happy, was enough.</p><br/><p>“Master, I don’t want any reward right now. Let’s worry about that later. The most important thing now is to follow this line of reasoning on to the formula for nineteen-colored flame!” From the determination in Bai Hao’s eyes, it was obvious that he was confident in being able to succeed. Furthermore, he was shaking with excitement at the thought of his Master dominating the Wildlands with that formula.</p><br/><p>“I'm going to do everything in my power to help Master become... a heavenly necromancer!” Having sworn this oath in his heart, he clasped hands formally to Bai Xiaochun, then returned to his soulhoarding pagoda to start working.</p><br/><p>Bai Xiaochun was moved as he looked at the soulhoarding pagoda and sighed. He knew that ghost cultivator techniques were something of great importance to his apprentice, and yet, he had no idea where to get such techniques.</p><br/><p>“Where would I be able to get some ghost cultivator techniques…? There are all types of techniques available in the Heavenspan River region. I bet I could find some there.” Having decided this was the best angle to pursue, he sat down cross-legged and began to get familiar with the formula for eighteen-colored flame.</p><br/><p>The night passed quickly.</p><br/><p>This formula was actually very complicated, but because of his experience within the Flame Harmony realm, in which the faint eighteen-colored flame had become visible, he had a foundation upon which to work.</p><br/><p>Therefore, he actually gained a lot from that single night of study. The mere thought of actually trying to conjure that flame and become an earthly necromancer caused his heart to start racing.</p><br/><p>“However, if I really want to conjure it, I’ll need to do a lot of practicing….” At this point, he looked outside and realized that it was light outside, and remembered that Zhao Xionglin owed him a deva soul. Putting the bone slip away, he stood up, stretched a bit, then stuck his chin up.</p><br/><p>“Alright, Zhao Xionglin, Lord Bai is coming for you!”</p><br/><p>Even as Bai Xiaochun reveled in his success, he had no idea that back in Giant Ghost City, the Giant Ghost King had made a decision.</p><br/><p>After receiving the report from Mistress Red-Dust about what had occurred during the ancestral sacrifices, his eyes had begun to shine brightly.</p><br/><p>“What a genius. I definitely didn’t misjudge this Bai Hao. It’s impossible to say how far he’ll go. He's definitely the perfect son-in-law. I don't care what his background is!</p><br/><p>“Unfortunately, Mo'er’s temper is a problem…. If things keep going the way they have between the two of them, it will be hard for them to get along.” After some thought, his eyes gleamed with a strange light, and he cleared his throat. Then he sent a message to Mistress Red-Dust.</p><br/><p>First, he asked some general questions about her cultivation base, and then he said, “Mo'er, I have a certain technique you can cultivate that will give you a seventy percent chance of breaking through into the mid Deva Realm. However, you’ll need to go into secluded meditation and cultivate it secretly!”</p><br/>\n</div>"}