{"title": "Chapter 781: Dark Undercurrents Appear", "id": 781, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-781-dark-undercurrents-appear", "volume_title": "Volume 8", "body": "<h1>Chapter 781: Dark Undercurrents Appear</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“So you’ve also heard of Inspections Commissioner Bai Hao? He kills people without batting an eyelid. He’s vicious and merciless, and a complete madman!”</p><br/><p>“He’s a self-proclaimed wife-stealer who cheats his superiors and defrauds his subordinates! Everyone says that he’s an unabashed brown-noser who even managed to hoodwink the Giant Ghost King!”</p><br/><p>“He’s very skilled with shakedowns, to the point where he doesn’t even leave the grass behind! He’s shaken down eighteen clans in the Arch-Emperor Dynasty, and is so ruthless everyone hates him!”</p><br/><p>“He's a complete villain who cultivates an evil technique that absorbs life force! You can find people all over the place in Arch-Emperor City who had life force stolen away by him!’</p><br/><p>According to the stories which were spreading through the Wildlands, this Bai Hao was a person who was wicked beyond redemption. In fact, in many of the savage tribes, his name was a very effective tool used to frighten naughty children.</p><br/><p>As for Bai Xiaochun, he didn’t really care at all about that. However, his apprentice did! Bai Hao would occasionally go out into the city, thanks to the infinite shapeshifting abilities that came with being a ghost cultivator. Furthermore, since he was acting as Bai Xiaochun’s soul slave, he could go out and about without attracting any attention, as long as he maintained a stiff appearance. Besides, Bai Xiaochun had arranged for him to be escorted by corpse troopers wherever he went, and therefore, no one ever dared to cause problems for him.</p><br/><p>Bai Xiaochun’s flame conjuring was a very expensive thing. Even with everything he had acquired in the shakedowns, he still couldn’t sustain the work for too long. After all, each attempt required ten tongues of seventeen-colored flame.</p><br/><p>As such, both Bai Hao and Zhou Yixing would often go out to acquire more souls for him to use.</p><br/><p>It was because of such frequent outings that Bai Hao continued to hear more and more stories with his name in them. From what he could tell, his Master really was ruining his name….</p><br/><p>Furthermore, many of the rumors were the type that got Bai Hao worried about potential dangers.</p><br/><p>As for Bai Xiaochun, as his resources drained away, he became more and more confident with eighteen-colored flame. In fact, he was fairly certain that with only a few more sessions of practice, he would succeed!</p><br/><p>He was actually starting to get anxious, and was worrying about the same dangers that Bai Hao had already begun to worry about. After all, he had behaved with complete madness on the day of ancestral sacrifices, to the point where it clearly put him in a position of extreme danger!</p><br/><p>Before, he had been a sharp knife wielded by the Grand Heavenmaster, and had thus benefited from his protection. But now, the Grand Heavenmaster was at the peak of power, and had suppressed everyone. Therefore, the position of inspections commissioner wasn’t as important anymore, and would in fact soon be unnecessary. When the world was at peace, there was no need for razor-sharp knives!</p><br/><p>Bai Xiaochun couldn’t help but worry that the Grand Heavenmaster would eventually just discard him to earn back favor with the nobility and aristocracy. Thankfully, Bai Xiaochun and Bai Hao had discussed the matter, and both agreed that, considering the level of his cultivation base, no matter how great the danger he faced, there was one way he could save himself.</p><br/><p>And that was… to become an earthly necromancer!</p><br/><p>By becoming an earthly necromancer at just the right moment, he could definitely get out of even the most difficult situation!</p><br/><p>“However,” he thought, “both Hao’er and I agree that the Grand Heavenmaster probably won’t get rid of me any time soon…. Maybe I'm just reading into things too deeply. Maybe the Grand Heavenmaster will continue to approve of me more because of everything I've done. Besides, even Hao’er thinks that his attitude might change soon….</p><br/><p>“After all, I was very careful to make sure that ninety percent of what I acquired in the shakedowns was sent to him. I refuse to believe that doing all that didn't make an impression on him. Although those heavenly marquis clans weren’t rich enough to fund the entire nation, they were still fabulously wealthy….” With that, he looked down at the tongue of fire he held in his hand.</p><br/><p>“All of that will be what I rely on for protection…. Maybe nothing will happen. But if there is even the slightest sign of danger, I can rely on the ruthless plan Hao’er came up with…. That plan could buy me some time, but it really is ruthlessly harmful. Although I don’t care too much about my reputation here, it would be best to avoid it if at all possible….</p><br/><p>“However, if the Grand Heavenmaster forces my hand… then I’ll have no other choice but to do it!” Taking a deep breath to still his thoughts, he continued with his flame conjuring.</p><br/><p>Even as Bai Xiaochun was worrying about potential danger, and doing everything he could to succeed with eighteen-colored flame, a pair of eyes like those of a viper had come to focus… on Bai Hao!</p><br/><p>Certain forces had begun to gather every bit of information they could about him, and at the moment, a meeting was taking place somewhere in Arch-Emperor City, in an unassuming private chamber!</p><br/><p>“The soul has no name, but is always at Bai Hao's side….</p><br/><p>“The investigation in Giant Ghost City has concluded, and nobody knows where the soul came from….</p><br/><p>“The first time anyone saw it was in Bai Hao’s spirit enhancement shop….</p><br/><p>“It looks stiff and numb, like ordinary soul slaves usually do….”</p><br/><p>There were thirteen shadowy figures floated within the darkness of the private chamber. It was impossible to see their features clearly, but all of them were gazing steadily at a person who sat in the very middle of them all. She was a beautiful young woman, and she was currently revealing all of the information gleaned from recent investigations into the soul-form Bai Hao.</p><br/><p>If Bai Xiaochun were here, he would immediately recognize this young woman. She was Miao Lin’er!</p><br/><p>She had fought Bai Xiaochun back in the Necromancer Kettle, and had also plotted against him after he arrived in Arch-Emperor City. However, none of her plotting had come to fruition so far.</p><br/><p>“After Bai Hao became the inspections commissioner, the soul disappeared from public view, and remained heavily guarded inside the Inspections Manor. No one was able to get any information about it….</p><br/><p>“However, during the past three months, the soul has been seen out in the city more often. Normally, it is acting on the orders of Bai Hao to purchase souls….</p><br/><p>“It was last seen three days ago…. According to our calculations, that soul will appear at least one more time during the next two weeks!</p><br/><p>“However, it is always escorted by at least 100 corpse troopers. It's the same with Zhou Yixing.” Miao Lin’er spoke slowly and clearly so that everything she said was very easy to understand. Furthermore, she was no longer dressed in the revealing way she had been before, but rather, more modestly.</p><br/><p>“Therefore, I suggest… that we make our move the next time that soul appears out in the open!” With that, she clasped hands and bowed to the thirteen shadowy figures.</p><br/><p>The thirteen figures remained silent for a long moment before one of them spoke.</p><br/><p>“Are you sure that this soul is actually intelligent? If so, how intelligent? Has it been merely putting on an act to fool outsiders?”</p><br/><p>Without the slightest hesitation, Miao Lin’er replied, “Although I’ve only personally seen the soul a few times, I am absolutely certain!”</p><br/><p>Another protracted silence followed, after which another of the shadowy figures spoke in a raspy voice.</p><br/><p>“This soul slave of the mad dog Bai Hao is obviously very important to him…. Therefore, you need to be absolutely certain that it can be used… to conjure eighteen-colored flame!!”</p><br/><p>Miao Lin’er didn't respond at first. Instead, she produced thirteen bone slips from her bag of holding, which she sent flying to the thirteen shadowy figures.</p><br/><p>After catching the jade slips, the shadowy figures studied their contents, and then soon, their eyes began to shine brightly. Clearly, the information they were seeing confirmed the answer to the question that had just been posed.</p><br/><p>With that Miao Lin’er went on, “To our clan, the most important factor to consider in eighteen-colored flame is the flame spark…. With the flame spark, my grandfather can rise to the rank of earthly necromancer! Only after that point would he be able to conjure eighteen-colored flame without the use of this type of soul!</p><br/><p>“Seniors, I can guarantee that all of you will get the formula for eighteen-colored flame afterward. In fact, my grandfather will even swear a Dao oath to that effect!</p><br/><p>“Seniors, clearly you can see that Bai Hao’s days are numbered. The only reason the Grand Heavenmaster is still hesitating about him is that he hasn’t found the right opportunity…. In any case, that doesn’t matter. Bai Hao is already a toothless tiger. If he can’t reign himself in, then we won’t need to do anything. We just need to add a bit of fuel to the fire, and the Grand Heavenmaster will definitely kill him to appease the masses. At that point, Bai Hao's reign of terror will finally be over!”</p><br/><p>Smiling faintly, Miao Lin’er looked around at the silent figures and said, “What the Grand Heavenmaster wants now is stability. Furthermore, what need would he have to get rid of people who have outlived their usefulness, if those people are already dead?”</p><br/><p>Miao Lin’er wasn’t feeling anxious at all as she stood waiting for a response. She was extremely confident, and was sure that nothing unexpected would happen in the plan. The truth was that she hadn’t paid much attention to the soul-form Bai Hao. Because of the powers of Bai Xiaochun’s mask, Bai Hao had always looked like any other soul slave would. It was only when he and Bai Xiaochun were alone together that he would show any signs of being alive.</p><br/><p>However… something had happened during the flame conjuring competition with Sun Yifan and Sima Tao! In the moment that Bai Xiaochun created a faint eighteen-colored flame, Bai Hao had been so emotional that not even the protection of Bai Xiaochun’s mask had been able to conceal it. In that moment, Miao Lin’er had looked over and noticed the change to his facial expression. Furthermore, the technique she cultivated had something to do with souls, which made her even more perceptive than the average cultivator in that regard.</p><br/><p>Miao Lin’er did not belong to the clan of a heavenly marquis, but rather, a heavenly duke. Furthermore… her clan had once given rise to an earthly necromancer!</p><br/>\n</div>"}