{"title": "Chapter 783: Dramatic Events!", "id": 783, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-783-dramatic-events", "volume_title": "Volume 8", "body": "<h1>Chapter 783: Dramatic Events!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The slowdown compared to the 15-meter size was miniscule. In fact, most other people wouldn’t even be able to notice the difference. However, Bai Xiaochun was so focused on the sea of fire that he could immediately notice the difference.</p><br/><p>And yet, even with that change, the flickering colors within the 12-meter sea of fire were still impossible to penetrate with divine sense. Bai Xiaochun’s eyes were bloodshot, and he was trembling physically from the exertion. By now, his cultivation base, his mental faculties, and his ability to shrink the sea of fire were all reaching the limit.</p><br/><p>And yet, he didn’t attempt to shrink the sea of fire down again. He tried yet again to find the eighteenth color. Then he tried a second time, and a third time…. In the short time it takes an incense stick to burn, he was able to glimpse it a total of fourteen times.</p><br/><p>“So, I was right. This time, things are going better. The last time, I was only able to glimpse it nine times. This time, that number has increased to fourteen.”</p><br/><p>His spirits were lifted. However, despite having glimpsed it clearly so many times, he still wasn’t able to reach it with his divine sense. He sighed, then gritted his teeth and gave up on trying to form the eighteen-colored flame with a 12-meter sea of flame. Instead, he chose… to shrink it down again!</p><br/><p>It was almost as if a huge pair of hands were physically pushing the sea of fire in on itself. It began to fluctuate, and even seemed to be teetering on the verge of destabilizing. Bai Xiaochun immediately adjusted his method of control, and when it stabilized, he forced it to shrink from 12 meters… to 9 meters!</p><br/><p>Sweat poured down his forehead, but quickly evaporated into steam thanks to the intense heat of the sea of fire.</p><br/><p>By now, Bai Xiaochun was panting nervously. Shrinking the sea of fire down to 9 meters was something he would only do if absolutely necessary. It was very draining on him mentally, and also caused the sea of fire to behave even more wildly than before.</p><br/><p>Worse of all, his numerous practice sessions had led him to the discovery… that 9 meters was the absolute limit!</p><br/><p>Although it was possible to shrink the fire down to 6 meters, if he did, it would be destroyed moments later.</p><br/><p>After all of his experiments, he was fully convinced that although it was technically possible to shrink the sea of flames down to a size of 6 meters, and that doing so would slow the flickering colors so much that, if he then sent divine sense into it, the result would be the same as had occurred when he was conjuring in the presence of Sima Tao and Sun Yifan. He would create only a dim wisp, not a true flame!</p><br/><p>It was only because of the powers of his mask that, over the course of the past few months, no one had ever sensed it when he created such flame wisps.</p><br/><p>And in the end, what Bai Xiaochun wanted was, not a flame wisp… but a complete eighteen-colored flame!</p><br/><p>“9 is the limit….” he murmured, eyes shining with focused determination. He knew that he couldn’t keep going for very much longer, so he focused all of his mental faculties on searching within that sea of fire for the new flame.</p><br/><p>He did it in methodical fashion, not blindly. After the initial attempt failed, he tried a second time, then a third time…. On the fourth time, when he was certain he had identified the newly added color, he unhesitatingly sent his divine sense exploding out.</p><br/><p>His eyes shone with glittering light as his divine sense fused with his vision, pierced into the 9-meter sea of fire… and latched onto the newly added color.</p><br/><p>As his divine sense merged with the new color, the color became brighter, as though it were struggling with the other seventeen colors. The 9-meter sea of fire rumbled loudly as the other seventeen colors fought as viciously as a nation defending against an invading army!</p><br/><p>But Bai Xiaochun was in control of everything, and refused to allow the other seventeen colors to interfere. Within the shortest of moments, the eighteenth color grew brighter and more shocking.</p><br/><p>The entire room shook violently as… the eighteenth color appeared in full in the 9-meter sea of fire!!</p><br/><p>As of this moment, it was crystal clear that the sea of fire had risen… to the level of eighteen-colored flame!!</p><br/><p>Although it was still in the sea of fire state, all Bai Xiaochun had to do was use his flame conjuring techniques to return it to a state of flame, and that was nothing incredibly difficult!</p><br/><p>For all intents and purposes, he was now looking at an eighteen-colored flame!</p><br/><p>In the instant the eighteenth color appeared in the sea of fire, it was almost as if the fire itself had fused with heaven and earth, instantly causing drastic transformations.</p><br/><p>They were clear signs and portents pointing to the fact that an eighteen-colored flame had been brought into existence!</p><br/><p>Any given eighteen-colored flame was enough to shake all creation, and gave rise to something like heavenly tribulation. If Bai Xiaochun closed his fist down to create the actual flame, then those signs and portents would grow more intense, until visible manifestations could be seen in heaven and earth.</p><br/><p>Even now, in the sea of fire state, there were still incredible fluctuations, although they were currently being covered up by Bai Xiaochun’s mask.</p><br/><p>“It worked!!” he exclaimed, trembling. He had been waiting for this day for a very long time, had spent months doing research, had performed unending experiments, and had spent outrageous amounts of resources. And it had all been for this moment.</p><br/><p>Although his heart was going wild with excitement, he took a few deep breaths, and calmed himself. Then, he began to close his fingers into a fist.</p><br/><p>The 9-meter sea of fire churned and writhed, almost as if something inside of it were screaming. As it began to shrink down into his palm, though, certain fluctuations appeared that caused him to hesitate.</p><br/><p>Those fluctuations were coming from his mask, and were an indication its powers were wavering…. If that happened, and Bai Xiaochun pulled the sea of fire all the way into his palm to create an eighteen-colored flame, then the drastic transformations that resulted would notify everyone in Arch-Emperor City of what had occurred.</p><br/><p>And that would cause problems for his upcoming plan. Eighteen-colored flame was one of his trump cards, and to reveal it too soon would give his enemies the chance to prepare for it.</p><br/><p>Eyes glittering, Bai Xiaochun committed every aspect of this conjuring session to memory, so that he could be completely confident in replicating it in the future. He wouldn’t necessarily be able to succeed every single time, but he would at least have a sixty percent success rate!</p><br/><p>Considering how confident he was feeling, he had to force himself not to go ahead and take the chance and form the flame. However, he could not afford to gamble in this situation. A trump card like this was far too important.</p><br/><p>Therefore, he sighed in regret, then grabbed the sea of fire in a way that caused it to transform… into a portion of soul medicine!</p><br/><p>It was something even more rare in the Wildlands than eighteen-colored flame… supreme-grade soul medicine!!</p><br/><p>In some ways, this portion of soul medicine actually did prove that Bai Xiaochun had broken through to become an earthly necromancer!</p><br/><p>He now had a higher standing than the heavenly marquises and dukes, and was someone even the Grand Heavenmaster would have to treat with respect. He was one of only four… earthly necromancers!!</p><br/><p>“Eighteen-colored flame…. Dammit, if it weren’t for that Hell-Emperor Stele, I would enhance my nascent soul right now…. It's been a long time since I did. That would put me right in the late Nascent Soul stage!” However, doing that would come with other risks. Therefore, he decided to simply wait for the right moment to skyrocket to prominence in one fell swoop.</p><br/><p>It was a lot less glorious to be a powerful person who nobody knew about, and it immediately dampened some of Bai Xiaochun’s excitement over being an earthly necromancer. However, at least he could tell his apprentice. Feeling very proud of himself, he drew upon his mental connection with Bai Hao to call out to him.</p><br/><p>“Apprentice, guess what Master--” However, before he could finish speaking, Bai Hao replied in an anxious voice!!</p><br/><p>“Master, help m--”</p><br/><p>Before he could finish speaking, it was to Bai Xiaochun’s utter shock that their connection… was severed!</p><br/>\n</div>"}