{"title": "Chapter 785: Warmth From The Giant Ghost King", "id": 785, "volume": 8, "url": "http://boxnovel.org/a-will-eternal-chapter-785-warmth-from-the-giant-ghost-king", "volume_title": "Volume 8", "body": "<h1>Chapter 785: Warmth From The Giant Ghost King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The search didn’t last for long. The corpse troopers were like fiendish monsters, who demanded cooperation even if it wasn’t offered. Before long, all of the shops had been thoroughly searched, as had all the people.</p><br/><p>Zhou Yixing’s efforts were particularly speedy and thorough. Because of all the shakedowns he had participated in, he was able to leave virtually no stone unturned.</p><br/><p>Soon, the corpse troopers began to check in.</p><br/><p>“Nothing here.”</p><br/><p>“No clues at all!”</p><br/><p>“Nobody here….”</p><br/><p>After all 3,000 corpse troopers gave their reports, Zhou Yixing nervously approached Bai Xiaochun, lowered his voice, and said, “Milord, we weren’t able to find any clues at all…. We checked all the shops and all the people…. Nobody even saw that soul…. We looked especially closely at those shops over there….”</p><br/><p>The more Zhou Yixing spoke, the softer his voice got, until he trailed off nervously and bowed his head.</p><br/><p>As of this moment, all of the happiness and glory that Bai Xiaochun had felt were gone, replaced by intense coldness and bitter madness.</p><br/><p>And of course, he blamed himself. His best guess was that someone had come to suspect his identity, and had taken Bai Hao in an attempt to get evidence. He also felt guilty; if he hadn’t been so distracted and negligent, he wouldn’t have failed to provide Bai Hao with sufficient protection.</p><br/><p>Most bitter of all was the realization that if he hadn’t been so immersed in flame conjuring, he wouldn’t have needed to send Bai Hao out to get souls.</p><br/><p>“My apprentice… has done so much for me….” Bai Xiaochun’s heart hurt, and it was impossible to keep his emotions under control. He could not comfort himself, and could not even breathe steadily. It was very obvious that this was not just some random misunderstanding, and yet, he had no idea who exactly was targeting him.</p><br/><p>With that, he took out his Inspections Manor command medallion and used its special ability to check the records of Arch-Emperor City going back several months.</p><br/><p>However, no amount of searching produced any clues. The Inspections Manor had access to all of the intelligence reports in the entire city, and yet… he found nothing helpful.</p><br/><p>After all, the Inspections Manor would usually have clues build up after an event occurred, and Bai Hao had gone missing only moments ago. If the Inspections Manor did manage to get some clues, they would likely filter in through reports that would come in days later.</p><br/><p>But Bai Xiaochun couldn’t wait that long. Every breath of time that passed was a moment of danger for Bai Hao, and Bai Xiaochun knew that if he didn’t rescue him, he would live in regret for the rest of his days.</p><br/><p>Anxiety rising to maddening levels, Bai Xiaochun gritted his teeth and took out a transmission jade slip. For the first time since becoming the inspections commissioner… he took the initiative to contact the Giant Ghost King!</p><br/><p>It wasn’t that he hadn’t thought to do so on previous occasions, or that he couldn’t. It was just that, as the inspections commissioner working directly for the Grand Heavenmaster, it wasn’t very appropriate for the two of them to have dealings. After all, the heavenly kings and the Grand Heavenmaster weren’t exactly on good terms. However, he had never forgotten the feelings that had grown between them. And right now, Bai Xiaochun didn’t care about the detriment of direct contact with the Giant Ghost King!</p><br/><p>The events that had played out were too strange, and Bai Xiaochun simply couldn’t come up with any ideas about what might have happened. And for some reason, he had the feeling… that considering not a single scrap of a clue had been left behind, he needed the help of someone with the experience and cultivation base of the Giant Ghost King. A demigod!</p><br/><p>Back in the royal palace in Giant Ghost City, the Giant Ghost King was currently dining with Mrs. Chen. Even as the two of them laughed and chatted, he suddenly frowned and pulled out a jade slip.</p><br/><p>Snorting, he transmitted his voice into the jade slip. “Well, if it isn’t the exalted Inspections Commissioner Bai Hao. What could possibly have caused you to think of me today? If you have something important to say, spit it the hell out.”</p><br/><p>“Your Highness, I’ve run into some trouble….” As soon as Bai Xiaochun’s hoarse, maddened voice reached the ears of the Giant Ghost King, his jaw dropped, and his expression turned serious.</p><br/><p>“Calm down, you little brat. What happened. Tell me everything!” As the Giant Ghost King listened, his eyes began to glow, and intense pressure began to radiate off of him. Gradually, he rose to his feet and walked out onto a balcony overlooking the palace. A grim look could be seen in his eyes as he stood there for a moment, and then responded to Bai Xiaochun.</p><br/><p>“No evidence. No fluctuations. No clues… Those three facts alone are very telling. I know what happened! A demigod made a move against you. It seems unlikely that it would be the Grand Heavenmaster. After all, if he wanted to do something to you, he wouldn’t do so in such a complicated way. He could just wave his hand!</p><br/><p>“However, considering that you’re in Arch-Emperor City, the fact that the deed was done with such seamless perfection indicates that it wasn’t just the work of a demigod. There must have been multiple clans working together to provide support…. That would be the only way to do it without leaving behind even the slightest evidence or clue!</p><br/><p>“Bai Hao, you’ve offended so many people that I don’t think even I can figure out who was behind it….</p><br/><p>“But at the moment, the more you get involved in this situation, the worse it’s going to get…. You’re a smart person, Hao’er…. Why don’t you just come back to Giant Ghost City? Leave that nest of vipers. Let’s see who would dare to plot against you with me around!” Not once during his little speech did the Giant Ghost King ask why this particular soul slave was so important to Bai Xiaochun, or who the soul slave was….</p><br/><p>He had no desire to know, and actually felt that being left in the dark about the matter was the best thing.</p><br/><p>The Giant Ghost King’s message caused a warm feeling to rise up in Bai Xiaochun’s heart. However, he knew that if he went back to Giant Ghost City, that it would cause the hatred of all the nobility and aristocracy to fall upon the Giant Ghost King himself. That was something he didn't want to happen.</p><br/><p>Furthermore, he couldn’t just accept the fact that Bai Hao had gone missing. In fact, his killing intent only continued to grow stronger, and the intense coldness around him more biting.</p><br/><p>“Hang in there, Hao’er,” he said in his heart. “I don’t care what storms arise because of it… Master is going to find you!!”</p><br/><p>He swore this oath with the last bit of warmth that existed in his heart, after which it turned completely ice cold.</p><br/><p>“I don’t care who did this… even if it’s a demigod. When I find out who it is… I’m going to exterminate their entire clan!!”</p><br/><p>Without the slightest hesitation, he flew up into the air, followed by his corpse trooper army and Zhou Yixing. His destination was… the imperial palace!</p><br/><p>Considering that this was a matter which affected all of Arch-Emperor City, the only person who could truly resolve it… was the Grand Heavenmaster!</p><br/><p>Although Bai Xiaochun knew that the Grand Heavenmaster’s stance toward him had changed recently, and that the Inspections Manor was actually relatively weak within the power structure, he currently had no other alternatives.</p><br/><p>“The Grand Heavenmaster treated me well in the past. Perhaps all the things I worried about before are unfounded. Maybe he doesn’t really want to get rid of me….”</p><br/><p>A blood-colored glow could be seen in his eyes as he shot at top speed through the city toward the imperial palace. Upon arrival, he left most of the corpse troopers outside, and only took his Quasi-Deva Realm guard with him as he headed toward Heavenmaster Hall.</p><br/><p>As of this moment, only two hours had passed since his connection to Bai Hao had been severed!</p><br/><p>Most of that time had been wasted while the corpse troopers performed their search. Even still, Bai Xiaochun was reacting about as fast as was possible.</p><br/><p>The Grand Heavenmaster wasn’t alone in Heavenmaster Hall. He was joined by eight other individuals, who were seated in front of him, respectful expressions on their faces as they talked in low tones.</p><br/><p>Two of them were heavenly dukes, with one being Chen Haosong, and the other a middle-aged man with a beautiful, flowing beard. Behind those two were six heavenly marquises.</p><br/><p>Currently, the person speaking to the Grand Heavenmaster was none other than the beautifully bearded man.</p><br/><p>“Grand Heavenmaster, the sects from the Heavenspan region have been particularly active this year. They’ve been building up forces along all four sections of the Great Wall…. According to the clues we’ve unearthed, and the information provided by our spies, we are certain that the Celestial from Heavenspan Island… is preparing for an assault the likes of which comes around only once in a thousand years!”</p><br/><p>It was in this moment that Bai Xiaochun requested to see the Grand Heavenmaster.</p><br/><p>The request was granted, and Bai Xiaochun entered the hall and stood off to the side. As for the bearded man, he glanced briefly at Bai Xiaochun, and the continued speaking to the Grand Heavenmaster.</p><br/><p>“Although the four heavenly kings have their mission to defend the border lands, they can do more than just be a passive threat. They can actively cast fear into the hearts of the enemy! I would like to propose placing more emphasis on watching all four sections of the Great Wall. Furthermore, your humble servant hereby requests to go to the front lines on the northern section of the Great Wall to offer military consultation!”</p><br/><p>The Grand Heavenmaster didn’t respond at first. Instead, he looked over at Bai Xiaochun, whose murderous aura and bloodshot eyes made him seem very different from usual. The Grand Heavenmaster’s brow furrowed….</p><br/>\n</div>"}