{"title": "Chapter 807: Earthly Soul Flame Tribulation", "id": 807, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-807-earthly-soul-flame-tribulation", "volume_title": "Volume 9", "body": "<h1>Chapter 807: Earthly Soul Flame Tribulation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The entire hall was as silent as death…. Bai Xiaochun’s words, plus the scintillating eighteen-colored flame, caused all hearts to pound with indescribable levels of shock. The heavenly dukes and marquises were so stunned that they felt like their minds were being struck by 100,000 bolts of lightning!</p><br/><p>In fact, it was almost as if everyone present had been slapped in the face by a gigantic hand!!</p><br/><p>It didn’t take long for the silence to be broken by exclamations of shock.</p><br/><p>“Impossible. This… this is impossible!!”</p><br/><p>“Eighteen…. eighteen-colored flame….”</p><br/><p>“He’s an earthly necromancer!!”</p><br/><p>“The heavens have no eyes! There’s no way that this is really happening!!”</p><br/><p>The first voice to ring out in the hall was like an ice cube thrown into a vat of boiling oil. Almost immediately, a cacophony of shouting filled the hall. The heavenly marquises’ faces were all as ashen as death, their expressions those of utter disbelief!</p><br/><p>“This isn’t real!!”</p><br/><p>“Dammit, dammit, DAMMIT! I can’t believe he’s actually an earthly necromancer!!”</p><br/><p>“How could this be happening?! He was backed into a corner, faced with deadly calamity, and yet managed to come out on top!?!?!? Where hath gone the laws of the heavens? Where hath gone the truths of the great Dao!?!?”</p><br/><p>The heavenly marquises felt as though their psyches had been battered by entire mountain ranges, and some of them even collapsed mentally.</p><br/><p>It wasn’t that they lacked willpower, or that they were completely brainless. It was merely the fact that Bai Xiaochun had done something completely unexpected and heaven-defying. The decisive and dazzling way he had completely turned the situation around was something that they fundamentally couldn’t accept!</p><br/><p>A moment ago, they had all been absolutely, positively confident that Bai Xiaochun would end up dead. Then, a moment later, that supreme confidence had been crushed into absolutely nothing!</p><br/><p>This was especially true of Zhao Xionglin, who was trembling and twitching, his eyes so bloodshot they were crimson. He looked crazed, possessed, as though the disbelief in his heart was so intense that he literally couldn’t believe what Bai Xiaochun had just done.</p><br/><p>Then, in a rare moment of intelligence, he shouted, “You were always an earthly necromancer, Bai Hao!! You did this on purpose!! You knew before you killed Zhou Wudao that you could conjure eighteen-colored flame. That’s why you were so confident. You did it all on purpose! Dammit! You conned all of us!!”</p><br/><p>Liu Yong was equally unwilling to accept the situation.</p><br/><p>“Shameless! Despicable!!” he shouted. Of course, fear had already come to grip his heart. In his attempt to earn a bit of glory for himself, he had been the one to offend Bai Xiaochun more than anyone else.</p><br/><p>Although not all of the heavenly marquises were completely bowled over, most were. As they shouted, Bai Xiaochun stood there, proud and aloof, looking around with pride as everyone experienced a mental breakdown. Then he thought about how much difficulty they had brought him, and how they had done everything possible to get him killed, and he felt more and more pleased.</p><br/><p>“Now you people know what it really means to be slapped silly, don’t you?!” he said with a thunderous harrumph. “Think you can fight with me?!?! Think you can casually say that my eighteen-colored flame is a counterfeit?! All of you fools can just shut the hell up!” His voice echoed like thunder into the area, causing all of the heavenly marquises who had been shouting and yelling to suddenly close their mouths.</p><br/><p>“With the snap of a finger, I, Bai Xiaochun could reduce all of you to ashes!” Of course, that was what he said in his heart, although he emphasized the unspoken words with the flick of a sleeve.</p><br/><p>He was feeling so pleased that it caused his skin to tingle. He was now free and uninhibited in a way that he had never been before, not even in the Heavenspan River region.</p><br/><p>With such thoughts on his mind, he threw his head back and laughed uproariously. It was laughter that acted like needles stabbing into the hearts of everyone present, leaving them feeling so mocked that they almost couldn’t handle it.</p><br/><p>And yet, Bai Xiaochun didn’t care how maddened they felt. He wanted them to feel that way…. In fact, he felt like he should actually be even more pleased than he already was. Continuing to laugh, he suddenly pointed at Zhao Xionglin.</p><br/><p>“Heavenly Marquis Zhao, what did you say you would do if I conjured an eighteen-colored flame!?!? Come come. Get over here, drop to your knees, and kowtow!”</p><br/><p>By this point, Zhao Xionglin’s face was a dark reddish-purple, and he was gritting his teeth so hard they were about to shatter. At this point, he wished that there were cracks in the ground that he could simply squeeze down into and disappear.</p><br/><p>The heavenly marquises weren’t the only ones to be driven into madness by the eighteen-colored flame. Chen Haosong and the other heavenly dukes were panting in shock. In fact, there were even some who were looking at Bai Xiaochun with expressions of admiration!!</p><br/><p>Although they had their differences with him, as of this moment, they simply couldn’t help but feel some reverence for what he had done!</p><br/><p>Even they had assumed that there was no way for Bai Xiaochun to get out of the situation alive, and yet he had, and in shocking fashion! Now he had earned the respect that they would only give to someone more powerful than themselves.</p><br/><p>In fact, to them, it didn’t matter if it was true that Bai Xiaochun could already conjure eighteen-colored flame before everything happened. In fact, that just went to show how terrifying he really was!</p><br/><p>Not all of the heavenly dukes felt that way. Some had very grim expressions, especially the bearded duke and Chen Haosong, who could do nothing but grit his teeth and refrain from speaking.</p><br/><p>The frustration he felt was driving him mad. He was a powerful expert in the great circle of the Deva Realm. He was a heavenly duke in the Arch-Emperor Dynasty, one of the highest positions possible. And yet, he had been thwarted over and over again by Bai Xiaochun, and then in the moment in which he was sure he would end up dead, <em>this</em> happened. One could only imagine how defeated he felt.</p><br/><p>“I can’t believe that this kid beat me!!” he thought bitterly. By now, he knew that it would not be possible to make a move against Bai Xiaochun casually. All he had done was kill a heavenly marquis. Most people would have to pay a heavy price for such an act, but not an earthly necromancer…… Although he would face some type of punishment, he would definitely not lose his life!</p><br/><p>To be an earthly necromancer meant that he had a dazzling level of protection that no one could do anything about!</p><br/><p>In fact, not even the Grand Heavenmaster would be able to kill Bai Xiaochun, not unless he did it secretly. If he did, the common people in the Arch-Emperor Dynasty would all revolt violently!!</p><br/><p>After all, in the Arch-Emperor Dynasty, earthly necromancers were like rare and valuable gems!</p><br/><p>At the moment, there were only three other earthly necromancers in the Wildlands. They were divine dragons who could only occasionally be glimpsed from afar, wanderers who constantly strove to break through to the next level of necromancy. They were legends! They were all focused solely on doing that which had never been accomplished after Arch-Emperor City moved out into its current location: break through to the heavenly necromancer rank!!</p><br/><p>When an earthly necromancer appeared, the heavenly dukes would treat that person with incredible respect and courtesy, and so would the Grand Heavenmaster. Anyone who dared to kill an earthly necromancer would be messing with the very foundation of the Wildlands!</p><br/><p>Such thoughts were now running through the minds of the heavenly marquises and dukes, as well as the Grand Heavenmaster. The Grand Heavenmaster was looking at Bai Xiaochun, thinking about the two great services he had performed in the past, and feeling profoundly moved and grateful.</p><br/><p>“Completely stunning!!” he murmured inwardly.</p><br/><p>Bai Xiaochun was feeling very, very pleased. This was his most glorious moment so far in the Wildlands, and in fact, he was just preparing to do some more things to aggravate the crowd, when suddenly, a deafening boom rang out!</p><br/><p>It was so loud that it shook the entire imperial palace, and was so shocking that everyone inside Heavenmaster Hall looked up, their gazes piercing through the ceiling to observe the sky overhead.</p><br/><p>What they saw caused everyone’s faces to fall!</p><br/><p>As for Bai Xiaochun, he could immediately sense that something extremely dramatic was occurring in the sky over the imperial palace!!</p><br/><p>“Lightning tribulation!” someone cried out.</p><br/><p>“It’s… Earthly Soul Flame Tribulation!”</p><br/><p>“Hey, wait a second. Bai Hao isn’t actually an earthly necromancer yet! You can only be an earthly necromancer after you transcend Earthly Soul Flame Tribulation!!”</p><br/><p>“Hahaha! We still have a chance!!” Before long, Zhao Xionglin and many of the heavenly marquises were shouting aloud in joy.</p><br/>\n</div>"}