{"title": "Chapter 806: Shaking The Dukes And Marquises!", "id": 806, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-806-shaking-the-dukes-and-marquises", "volume_title": "Volume 9", "body": "<h1>Chapter 806: Shaking The Dukes And Marquises!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As the sea of fire was compressed, it writhed madly. But Bai Xiaochun’s hands contained the power to seal and suppress anything in existence, so even had the fire reacted more violently, he would still have been able to control it.</p><br/><p>The rumbling sounds continued as the sea of fire shrank down to 51 meters. Then it continued on… 45 meters. 39 meters…. Howling, Bai Xiaochun pushed it down smaller and smaller. The sea of fire continued to react with explosive violence, but at this moment, Bai Xiaochun was a sovereign of flame. Under his control, the power of the fire didn’t erupt outward, but was re-focused inward to continue the compression.</p><br/><p>In the shortest of moments, it shrank from 39 meters… to 24 meters!!</p><br/><p>Within moments, it would surely be at 15 meters!!</p><br/><p>As it shrank down… the flickering beginnings of an eighteenth color could be seen!</p><br/><p>Everyone in Heavenmaster Hall waited with bated breath to see what would happen. Although the heavenly marquises couldn’t necessarily see what was happening within the fire, the heavenly dukes and the Grand Heavenmaster absolutely could….</p><br/><p>It was hard to say who did it first, but hisses of amazement could soon be heard.</p><br/><p>When the heavenly marquises heard such sounds, they were taken aback and looked over at the heavenly dukes. Soon, they realized that the ten heavenly dukes all wore expressions of unprecedented solemnity. It was even true of Chen Haosong, whose hands were clenched so tightly into fists… that blue veins bulged out on the backs of his hands!</p><br/><p>The heavenly marquises’ eyes went wide, and yet, before they could even wrap their minds around what it all meant, Bai Xiaochun let out a shout at the top of his lungs.</p><br/><p>“Compress!” His eyes were completely bloodshot as the power of his cultivation base erupted, sent out through both of his hands as he pushed the flame down again, compressing it to a size of… 15 meters!!</p><br/><p>15 meters was a line of demarcation. After this point, as long as he found the new color and latched onto it with his divine sense, then the eighteenth color would appear in full, and an eighteen-colored flame would appear!</p><br/><p>At the moment, it was possible to see that eighteenth color flickering within the 15-meter sea of fire. By now, everyone could see that unimaginable and indescribable new color….</p><br/><p>Although it would only appear for the briefest of moments, it was enough for the heavenly marquises to realize what was happening, and it caused their minds to reel.</p><br/><p>“This… this….”</p><br/><p>“It’s not going to work. He has to fail!”</p><br/><p>“He absolutely must fail!!” The heavenly marquises were starting to get very nervous. Today was the first time they had all joined forces and worked together, and yet something was happening that surpassed anything they could have ever imagined. Although not all of them lost control, many of them couldn’t hold back from shouting in alarm.</p><br/><p>At some point, Hei Ming had come to stand nearby the Grand Heavenmaster. When he heard everyone talking, he waved his hand swiftly through the air, causing the babbling heavenly marquises to shiver and bite their tongues.</p><br/><p>The Grand Heavenmaster looked over at Hei Ming, but didn’t say anything. A moment later, his gaze was back on Bai Xiaochun, the strange light in his eyes growing stronger by the moment. As for the ten heavenly dukes, they could hardly breathe as they waited to see how things would turn out.</p><br/><p>As everyone looked on with rapt attention, Bai Xiaochun sweated profusely and stared deep into the 15-meter sea of fire. After a few breaths of time passed and he failed in his attempts to grab the eighteenth color, he decided that there was no need to waste time. Without any hesitation, he braced himself, and then shrank the sea of fire down again!</p><br/><p>Without any stopping, it compressed to a size of… 9 meters!!</p><br/><p>The 9-meter sea of fire struggled with violent force, causing intense and shocking rumbling sounds to echo out. The flickering of the flames was slowing down, making it possible for people to see it more clearly. As for Bai Xiaochun, his eyes shone with joy as he sent his divine sense shooting into the fire!</p><br/><p>In the blink of an eye, his divine sense was all the way inside the flame, where it latched onto… the eighteenth color!!</p><br/><p>An ear-splitting noise rang out, causing everything to shake. The eighteenth color had seemed weak moments before, but as soon as Bai Xiaochun's divine sense entered it, it exploded with dazzling light. It was as if that color had desired to rise to prominence no matter what the other seventeen colors thought!!</p><br/><p>It was almost like fireworks. Bai Xiaochun threw his head back and laughed uproariously as the eighteenth color grew strong and stable within the 9-meter sea of fire, shining with dazzling intensity alongside the other seventeen colors!!</p><br/><p>Also in that same moment, in the sky above Heavenmaster Hall, the clouds began to swirl as numerous bolts of lightning began to slash back and forth.</p><br/><p>Thunder boomed, shaking all of the imperial palace. Even the golden dragon high in the clouds was shocked, and flew some distance away.</p><br/><p>The booming thunder also reached Heavenmaster Hall. And yet, nobody paid any attention to it at all. They might as well have been deaf. Everyone was filled with waves of shock, completely ignoring everything in the outside world as they focused fully on Bai Xiaochun.</p><br/><p>Bai Xiaochun was feeling quite excited. Even he had never thought that everything would go so smoothly. And because he didn’t use his mask to cover up the effects, everything turned out vastly more shocking than anyone could have imagined. And that was exactly what he wanted!</p><br/><p>Struggling to control his breathing, he flashed a double-handed incantation gesture, causing the eighteen-colored sea of fire to slowly stabilize. Laughing heartily, he reached out toward the 9-meter sea of fire and made a grasping motion.</p><br/><p>“Form!!” he said. The sea of fire rushed down into his hand, and the thunder outside Heavenmaster Hall grew more intense. As for everyone inside the hall, they had seemingly lost the ability to even think, and they stared wordlessly as Bai Xiaochun… collected up the sea of fire!</p><br/><p>It started out at 9 meters, and swirled around and around until it was 6 meters. 3 meters. 2 meters. 1 meters. Half a meter….</p><br/><p>Shouting at the top of his lungs, Bai Xiaochun then slowly closed his fingers around the sea of fire!</p><br/><p>“Time for eighteen-colored flame!!” he shouted, his voice surpassing the heavenly thunder to shake the entire hall. At the same time, the fire disappeared within his fist!!</p><br/><p>The moment that his fingers closed around the fire was one of profound anxiety for everyone inside Heavenmaster Hall. It was almost as if what he held in his hand was not fire, but rather… the hearts of the 89 heavenly marquises, the 10 heavenly dukes, and even the Grand Heavenmaster!!</p><br/><p>All eyes were fixed on his hand, and not a single voice could be heard. The grand hall was completely silent except for the rumble of the heavenly thunder. It was almost as if it existed outside of the passage of time….</p><br/><p>Bai Xiaochun thrummed with excitement and nervousness, and his bloodshot eyes were alive with joy.</p><br/><p>That was especially true when he noticed how everyone was staring at his right hand. He could see the serious look in the eyes of Chen Haosong and the dukes, and the nervousness of Zhao Xionglin and the other marquises. The pride Bai Xiaochun felt in this moment simply couldn’t be described with words.</p><br/><p>He took a deep breath, and under the watchful eyes of all of the surrounding aristocrats, he very, very slowly began to open his fingers…. However, even that tiny motion revealed some of the flame inside, and it provoked sharp gasps.</p><br/><p>Bai Xiaochun could not have been more pleased with the sound. Heart swelling, he continued to move with utmost slowness as he opened his fingers, revealing more and more of the flame, and causing even more gasps to ring out.</p><br/><p>Although he was hoping for more gasps, he could only move his fingers so slowly. Eventually… the full flame was revealed, floating above his palm!</p><br/><p>Raising his voice, he said, “Would anyone like to tell me… how many colors you see in this flame?!?!”</p><br/><p>The words were spoken in an overbearing and domineering tone, the type that brooked no disrespect, and was filled with incredible arrogance!</p><br/><p>The flame in his hand was visible for everyone to see, clear and there for all to behold!!</p><br/><p>Within his pupils, vivid and clear and beautiful, was the reflection of an eighteen-colored flame!</p><br/>\n</div>"}