{"title": "Chapter 819: Fishing!", "id": 819, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-819-fishing", "volume_title": "Volume 9", "body": "<h1>Chapter 819: Fishing!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This person was none other than… Gongsun Wan’er! She looked different, as she was impersonating Bai Xiaochun. But as soon as he laid eyes on her, he recognized her!</p><br/><p>It was mostly because of her smile, the way she licked her lips, and the way she talked about being hungry. The enormity of it all struck him like a lightning bolt.</p><br/><p>He suddenly thought back to the labyrinth, and all of the indescribably terrifying things he had seen there….</p><br/><p>“A ghost….” he thought, shivering uncontrollably. In fact, he almost screamed. Back in the labyrinth, Gongsun Wan’er had revealed everything to him, confirming that she was the very same young girl from the Fallen Sword Abyss, the one with the little teddy bear!</p><br/><p>“Where’s Lei Shan…?” he thought.</p><br/><p>In almost that exact moment, a figure appeared behind Gongsun Wan’er, a tall, burly man!</p><br/><p>However, he was bright red, because of the fact that he had no skin on his body. His face was expressionless, as if he couldn’t even feel pain. As he stood there next to Gongsun Wan’er, he emanated the most terrifying of auras.</p><br/><p>He was none other than… Lei Shan, whom the girl had captured and skinned alive in the Fallen Sword Abyss!!</p><br/><p>Bai Xiaochun’s heart was beginning to pound even harder. He knew how terrifying Gongsun Wan’er was, and was sure that Mistress Red-Dust was not a match for her. Without any hesitation, he pulled out a jade slip to send a message, only to find that the jade slip wouldn’t work.</p><br/><p>His breath stuck in his throat, and he considered whether or not to just flee. From what he could tell, Gongsun Wan’er hadn’t recognized him, and therefore, getting away and sending word to the Giant Ghost King seemed like the best plan at this point.</p><br/><p>However, before he could even begin to flee, Mistress Red-Dust narrowed her eyes and made a grasping motion to summon a red lotus.</p><br/><p>“So, you finally show your face, Bai Xiaochun. Prepare to die!” Although Mistress Red-Dust could tell that there was something different about this Bai Xiaochun than before, she didn’t have time to think about the matter. She quickly performed an incantation gesture, causing deva fluctuations to roll out. Then she waved her finger, and the air rippled as the enormous illusory image of a finger appeared and shot toward Mount Amity.</p><br/><p>In the instant that the finger appeared, Lei Shan looked up, and a brutal gleam could be seen in his eyes. Throwing his head back, he howled, a heaven-rending, earth-crushing sound which rolled out in a wave-like attack. Then he stamped his foot down, causing the third peak of Mount Amity to collapse as he shot upward into the air!</p><br/><p>Intense rumbling sounds echoed out as the sky went dim. Amidst the rushing wind, Mistress Red-Dust’s pupils constricted, and she performed another incantation gesture.</p><br/><p>“Deploy formation!” she shouted.</p><br/><p>Instantly, the more than 10,000 soldiers of the Giant Ghost Legion fanned out around Mount Amity, creating a massive spell formation.</p><br/><p>In order to avoid attracting attention, Bai Xiaochun tried to stick close to one of the soul cultivator soldiers. However, it was in that moment, when the third peak was still crumbling to the ground, that Gongsun Wan’er vanished. When she reappeared, she wasn’t near Mistress Red-Dust, but rather, next to a Core Formation soldier who was powering the spell formation.</p><br/><p>She moved with such incredible speed that the Core Formation soul cultivator couldn’t even react. Gongsun Wan’er breathed in, and the soul cultivator shivered. In the briefest of moments, his body withered up, and soul light emerged from his eyes, ears, nose, and mouth. At that point, he was nothing more than a desiccated corpse….</p><br/><p>His life force, his soul, and everything else about him had been absorbed by Gongsun Wan’er. At that point, eerie laughter rang out over the battlefield, causing all hearts to shudder.</p><br/><p>Bai Xiaochun already felt like he was going crazy from fear, and was wailing inwardly. As for Mistress Red-Dust, her face fell as she performed another incantation gesture, unleashing deva power in a deadly attack on Gongsun Wan’er.</p><br/><p>However, before she could move very far, the burly Lei Shan blurred into motion, striking at her with a meaty fist.</p><br/><p>Booms rang out as Lei Shan and Mistress Red-Dust began fighting. As for Lei Shan, he seemed almost indestructible; although Mistress Red-Dust’s magical techniques slammed into him, his expression didn’t change at all, and he continued to attack without letup.</p><br/><p>“Dammit!!” Mistress Red-Dust said, her expression flickering. Gongsun Wan’er’s laughter continued to float out across the battlefield as she flitted back and forth between the soul cultivators, transforming each and every one into a withered corpse.</p><br/><p>As she did, her aura grew stronger and stronger!</p><br/><p>At this point, Gongsun Wan’er’s voice began to float out. “Your people have just the qi and blood I was looking for, and cultivation base too. The tribal savages have incomplete spiritual and physical souls. Even a hundred of them don’t match up to a single one of you!”</p><br/><p>The Giant Ghost Legion soldiers’ expressions flickered with shock as they realized that their spell formation was completely useless. Furthermore, when their divine abilities landed on Gongsun Wan’er, they didn’t affect her or slow her down at all.</p><br/><p>No one could fight back against her! The soldiers could only watch helplessly as their comrades were shriveled up into corpses and absorbed!</p><br/><p>It was a terrifying sight. Within a very short period of time, hundreds of people had been transformed into dried-up corpses. Even more horrifying was that after absorbing so many soul cultivators, Gongsun Wan’er was transforming. Chuckling bizarrely, she no longer had to teleport back and forth, but instead, sent her hair flying out in all directions, simultaneously attacking nearly a thousand people at once.</p><br/><p>In the blink of an eye, numerous strands of hair had stabbed into the foreheads of the soul cultivators, and began to suck them dry. Screams rang out, but were quickly silenced as everyone became a withered corpse!!</p><br/><p>Gongsun Wan’er’s face glowed more healthily than ever, and her eyes shone with a bizarre light.</p><br/><p>“Still a bit hungry….”</p><br/><p>The remaining Giant Ghost Legion soldiers were visibly shocked, and began to fall back, not willing at all to face this creature in battle. Bai Xiaochun was among them, his heart pounding with vigilance. However, as of this moment, Gongsun Wan’er still didn't seem to have noticed him.</p><br/><p>Gongsun Wan’er retracted her hair from the nearly one thousand corpses, and then took a breath. Meanwhile, Mistress Red-Dust, her eyes shining with red light, performed a double-handed incantation gesture, summoning an enormous figure behind her, a Dharma Idol that bore her visage.</p><br/><p>“Get the hell out of here!” she shouted. The Dharma Idol radiated a murderous air as it performed an incantation gesture, causing it to shine with boundless light and then transform into an enormous red spear which was launched toward Lei Shan.</p><br/><p>Not even Lei Shan could defend against that spear, which stabbed directly into his chest, then carried him flying toward Mount Amity.</p><br/><p>A moment later, he and the spear slammed into the mountain, whereupon a bright red light exploded out, along with heaven-shaking, earth-shattering rumbling sounds. All four of the remaining peaks of the mountain shattered, sending out a shockwave that turned the surrounding jungle into nothing more than ash….</p><br/><p>A moment later, the dust cleared, revealing an enormous crater, at the bottom of which lay Lei Shan, completely motionless, a head-sized hole in his chest!!</p><br/><p>Mistress Red-Dust was left ashen-faced and gasping for breath after unleashing this particular divine ability. However, her phoenix-like eyes shone with murder as she unhesitatingly shot toward Gongsun Wan’er.</p><br/><p>The surrounding soldiers were enlivened at the sight, but not Bai Xiaochun. He knew that Lei Shan was nothing more than a puppet, and that if it took a divine ability the likes of which Mistress Red-Dust had just unleashed to kill him, then that only went to show how difficult it would be to take out Gongsun Wan’er.</p><br/><p>“Well, let’s see what happens,” he thought nervously. “If Mistress Red-Dust can seize the advantage, maybe I’ll jump in and help her…. If not, then I’ll try to get her to escape!” Bai Xiaochun had long since begun to think about making his own escape. However, he had the feeling that unless he did it with the entire group, it would attract unwanted attention from Gongsun Wan’er.</p><br/><p>It was very worrisome that not only had she been following him for such a long time, but she had also begun impersonating him. If Bai Xiaochun didn’t grasp the implications of that, then he didn’t deserve to have practiced cultivation for so long.</p><br/><p>“She’s fishing. Fishing for me!!” The mere thought caused his scalp to tingle violently, and his heart to pound with regret.</p><br/>\n</div>"}