{"title": "Chapter 828: Save Me, Father-In-Law!", "id": 828, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-828-save-me-father-in-law", "volume_title": "Volume 9", "body": "<h1>Chapter 828: Save Me, Father-In-Law!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The moment that Gongsun Wan’er looked in Bai Xiaochun’s direction, he was tens of thousands of kilometers away, fleeing in the heavenly airship. Suddenly, he shivered and looked over his shoulder. Although he couldn’t see anything, from the cold chill that ran up his spine, he was convinced that Gongsun Wan’er was looking at him.</p><br/><p>“She’s coming!!” Expression flickering, he looked over at the unconscious Mistress Red-Dust. Then he pulled out a transmission jade slip, only to find that it still didn't work.</p><br/><p>At this point, he was getting truly flustered and anxious. Whether because of the events in the Fallen Sword Abyss or in the labyrinth, he was completely terrified by the grim specter that was Gongsun Wan’er.</p><br/><p>Worst of all was that he couldn’t tell the true level of her cultivation base. At first, she hadn’t seemed very strong, but the more cultivators she consumed, the more powerful she got, until she reached an unbelievable level.</p><br/><p>She had soundly defeated Mistress Red-Dust, and had even escaped her trump card sealing technique. Bai Xiaochun could only imagine how terrifying she would get as she got stronger.</p><br/><p>“Just where did she come from? Back when she showed up in the Fallen Sword Abyss, she seemed just like all the other banesouls. All she did was eat one of my medicinal pills….” By this point, his heart was filled with regret because of it all. Drawing deeply on his cultivation base, he sent the heavenly airship accelerating forward with greater speed.</p><br/><p>However, despite that great speed, he was fairly certain that he could hear the sound of chuckling behind him. It started very faintly, but then grew more and more clear.</p><br/><p>Heart trembling, he looked over his shoulder and saw a black stream of smoke far off in the distance. As the smoke roiled and churned, it gradually turned into a face… that of Bai Xiaochun!</p><br/><p>However, there was something bizarre and even sinister about it as it closed in with incredible speed. It almost looked like an evil ghost.</p><br/><p>“Ah, so you’re hiding over here, sweetie.” More bizarre chuckling echoed out.</p><br/><p>“I'm not your sweetie!” Bai Xiaochun said, his voice quavering. “Um… you’re just seeing things!” Despite having battle prowess that could crush the early Deva Realm, he was still convinced that he wasn’t a match at all for the bizarre Gongsun Wan’er.</p><br/><p>“What do you mean, seeing things? I've worked hard trying to track you down, sweetie. But then you went and broke my teddy bear! You need to pay me back.” The face of black smoke continued to chuckle, accelerating until it was only a few hundred meters behind the heavenly airship!</p><br/><p>To see it close up had Bai Xiaochun scared out of his mind. His scalp was tingling so violently his hair nearly stood on end, and he was actually shaking down to his toes.</p><br/><p>“No, you’re really seeing things!” Suddenly, he pointed off in a certain direction. “Oh, hey. Arch-Emperor City is right over there! There’s a guy there named Chen Haosong! I bet that’s who you’re looking for…. Oh, there’s also someone named Zhao Xionglin. He’s really tough-looking. One glance, and you’ll be convinced he’s the perfect teddy bear. If you hurry, you’ll be able to find him!”</p><br/><p>Gongsun Wan’er smiled, a sinister smile that caused waves of terror to batter Bai Xiaochun’s mind. At this point, the enormous face’s mouth opened, and the smoke seethed, making the face rapidly grow larger. In the blink of an eye, it was thousands of meters tall, surging forward as if to consume the entire heavenly airship!</p><br/><p>The face seemed to supersede heaven and earth as it lunged forward. Shrieking, Bai Xiaochun grabbed up Mistress Red-Dust and shot away as the mouth closed around the airship.</p><br/><p>From a distance, the heavenly airship was so small that it looked like a scrumptious pastry entering the huge mouth. Then, crunching sounds could be heard as the heavenly airship… was crushed to pieces!</p><br/><p>As for Bai Xiaochun, he was a blur that sped away in the opposite direction, Mistress Red-Dust in his arms.</p><br/><p>“Why are you always so naughty, sweetie? You always have to play hide-and-seek, don’t you…?” More chuckling from Gongsun Wan’er reached Bai Xiaochun’s ears, causing goosebumps to spread out across his skin. He tried to accelerate, but after the enormous face destroyed the heavenly airship, it grew larger, until it was fully 30,000 meters tall!!</p><br/><p>30,000 meters is a size easy to describe with words. But to depict it visually is a different matter. The face was shocking to the extreme as it surpassed all heaven and earth, its ghastly mouth opening wide as it moved toward Bai Xiaochun.</p><br/><p>At the same time, an astonishing gravitational force appeared, causing everything in the area to tremble and shake. Even hills and mountains were ripped up out of the ground!</p><br/><p>Bai Xiaochun shuddered as he tried to push forward, but no amount of speed on his part could fight the gravitational force, and he began to inch inexorably back toward the mouth.</p><br/><p>He wanted to scream and cry, especially considering that the face resembled him in every aspect. The idea of being eaten up by himself was terrifying, to say the least.</p><br/><p>“Complete and utter bullying!!” he shouted, his eyes bloodshot as he held Mistress Red-Dust tight in his arms. As of this moment, a profound sensation of deadly crisis gripped his heart; he knew that he couldn’t rely on luck to save him, and that he couldn’t hesitate. If he didn’t put everything on the line right now, his poor little life would definitely be lost.</p><br/><p>“Do you really think Lord Bai is scared of you, Gongsun Wan’er!?!?” he roared. Although he was still trembling, his veins of steel were now pulsing. The energy in his Powered Bones began to thrum as he called upon his fleshly body power and his late Nascent Soul stage cultivation base. The sky dimmed, and a screaming wind kicked up, sending rocks and dirt flying around everywhere. Although he was not truly a deva, as of this moment, his energy was powerful enough to interfere with the will of the heavens in this area!</p><br/><p>His right hand clenched into a fist, and a black vortex appeared, which immediately sucked away all of his aura. Then, the image of a shadowy emperor appeared behind him.</p><br/><p>Intense rumbling sounds filled the area because of that shadowy figure, which seemed to possess a power of will like that of a deva! It could fuse with the heavens and alter the natural laws of all creation.</p><br/><p>Although all of this takes a bit of time to describe, it took place in the short amount of time it took Bai Xiaochun to turn in place.</p><br/><p>Roaring, Bai Xiaochun suddenly leaped toward the incoming 30,000-meter-tall face… upon which he unleashed a fist strike of mountain-toppling, sea-draining force!!</p><br/><p>The Undying Emperor’s Fist!!</p><br/><p>With double his normal fleshly body power!!</p><br/><p>The shadowy emperor also punched out, and the domineering energy which began to surge was so incredible that the emperor himself began to fade away. Everything was focused on that fist, which Bai Xiaochun directed to land directly onto the huge face.</p><br/><p>A deafening boom erupted out, along with a massive blast of wind. It was almost like earth dragons were spasming under the surface of the ground, which quaked violently as far as the eye could see.</p><br/><p>Blood sprayed out of Bai Xiaochun’s mouth as he tumbled backward several hundred meters. Even as he did, he righted himself, and then sped away as fast as he could.</p><br/><p>As for the face, cracks and fissures appeared on its surface, and then… it collapsed into pieces!</p><br/><p>Those pieces became black smoke, which rapidly formed back together…. to reveal Gongsun Wan’er, disguised as Bai Xiaochun!</p><br/><p>A mysterious light could be seen in her eyes, and a strange smile covered her face.</p><br/><p>“I knew I recognized that smell. You… definitely have traces of that old codger on you….” Chuckling, she prepared to give chase.</p><br/><p>Meanwhile, Bai Xiaochun was speeding along, anxious and ashen-faced.</p><br/><p>It was at this point… that Gongsun Wan’er’s face fell. Turning her head in a certain direction, she saw an enraged figure piercing through the air in her direction.</p><br/><p>“Who is it that dares to lay a finger on my beloved daughter and honorable son-in-law!?!?”</p><br/><p>It was none other than the Giant Ghost King!</p><br/><p>Bai Xiaochun’s eyes went wide with joy, and he immediately shouted, “Father-in-law, save me!”</p><br/>\n</div>"}