{"title": "Chapter 826: Late Nascent Soul Stage", "id": 826, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-826-late-nascent-soul-stage", "volume_title": "Volume 9", "body": "<h1>Chapter 826: Late Nascent Soul Stage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It had been some time since Bai Xiaochun performed a fifteenfold spirit enhancement on his nascent soul, breaking through to the mid Nascent Soul stage. Fearful of pushing things too far, he hadn’t dared to go any further than that. Considering that his name was listed on the Hell-Emperor Stele, everyone in the world would have known if he performed even a single more enhancement.</p><br/><p>Later on, as he came to acquire everything from sixteen- to nineteen-colored flame, he had been forced to do nothing more than look at the product of his hand. He hadn’t dared to enhance his nascent soul, at least not until he found the right opportunity.</p><br/><p>His original plan had been to wait until he could advance directly into becoming a deva. But now… it was a moment of deadly crisis, and there was no time for lengthy consideration about the consequences.</p><br/><p>When it came to keeping his poor little life safe, revealing his identity was of secondary importance. Even more importantly… Gongsun Wan’er was impersonating him. Considering that everyone was paying attention to her, Bai Xiaochun hoped that further enhancing his nascent soul wouldn’t attract as much attention and suspicion.</p><br/><p>“I don’t have time to think about all that stuff!” he thought, his eyes bloodshot. As for how Mistress Red-Dust would react, at the moment, they were both in the same predicament. There would be time to worry about her later. He simply felt too much pressure because of Gongsun Wan’er. She could free herself at any moment, and if she chased them down… the consequences were too grim to contemplate.</p><br/><p>Right now, Bai Xiaochun knew that he had to become as powerful as he possibly could. He needed to cut down the seemingly unkillable Lei Shan, which would give them the opportunity to truly escape.</p><br/><p>Time was extremely limited, and Mistress Red-Dust was severely injured. In fact, every moment that she fought with Lei Shan was one of extreme danger to her. A grim look could be seen on Bai Xiaochun’s face because of the booming sounds of combat from outside. Gritting his teeth, he patted his bag of holding to produce a sixteen-, seventeen-, eighteen- and nineteen-colored flame.</p><br/><p>The appearance of so many multi-colored flames caused the private chamber to instantly turn bright red from the heat. Bai Xiaochun quickly performed an incantation gesture and then touched his head, causing his nascent soul to fly out into the open!</p><br/><p>After reaching the mid Nascent Soul stage, and especially after the fifteenfold spirit enhancement, his nascent soul was much stronger and solid. No longer was it so easily shaken by being outside of his body, nor was it affected by the cold.</p><br/><p>In fact, there was little difference between it and his fleshly body. However, Bai Xiaochun wasn’t really paying attention to that. As soon as he was out in nascent soul form, he sat down cross-legged in his turtle-wok, and then waved his hand in very practiced fashion toward the sixteen-colored flame.</p><br/><p>When the sixteen-colored flame touched the turtle-wok, countless complex designs sprang up on the surface of the wok, and golden light rose up to cover Bai Xiaochun’s nascent soul.</p><br/><p>Intense, ear-splitting rumbling sounds filled his ears. However, it didn’t spill out into the open, where Mistress Red-Dust and Lei Shan were continuing to fight.</p><br/><p>Back in Arch-Emperor City, there weren’t very many cultivators gathered around the Hell-Emperor Stele. The fact that Bai Xiaochun had performed a fifteenfold spirit enhancement on his nascent soul and taken 1st place left everyone in a state of despair. Afterward, few people had the spirit to try to compete….</p><br/><p>As far as most people were concerned, it was a complete miracle that anyone could survive fifteen spirit enhancements…. Virtually no one alive would have the gumption to risk their lives for a competition.</p><br/><p>Although there weren’t as many people around the Hell-Emperor Stele as there had been in the past, there were still a few present. Four or five soul cultivators were in the area, and although they initially weren’t paying attention to the stele, when it suddenly began to shine with black light, all of them looked over with odd expressions in their faces. When they did, their eyes nearly popped out of their skulls.</p><br/><p>“Bai Xiaochun…? He… he did another spirit enhancement on his nascent soul!?!?”</p><br/><p>“This… this….”</p><br/><p>“Sixteenfold. After all this time, he’s actually doing another spirit enhancement? Is he crazy!?!?” None of them could understand why Bai Xiaochun, who already was in 1st place, and who had vastly surpassed the sevenfold spirit enhancement of the 2nd place holder, would continue to risk his life!</p><br/><p>Although they were puzzled, it didn’t stop them from sending messages to people they knew, and before long, word was spreading. It took only a short time for everyone in Arch-Emperor City to be talking about it.</p><br/><p>“Sixteenfold??”</p><br/><p>“Didn’t Goddess Red-Dust go after Bai Xiaochun just recently? How could he be performing spirit enhancements right now!?!?”</p><br/><p>However, even as Arch-Emperor City was rocked by surprise, Bai Xiaochun’s name once again began to glow with black light. When the light faded away, the number next to his name had changed. Instead of sixteen, it read seventeen!!</p><br/><p>“Heavens! He’s doing more enhancements?!”</p><br/><p>“Maybe Goddess Red-Dust has him pushed into a corner so badly that he decided to risk death to perform more spirit enhancements!!”</p><br/><p>Meanwhile, back in the private chamber on the airship, Bai Xiaochun’s nascent soul had seven golden designs on it! Clearly, his aura was more powerful than before, and he was rising up to the peak of the mid Nascent Soul stage!!</p><br/><p>As of this point, he was only a short step away from breaking through to the late Nascent Soul stage. Without the slightest hesitation, he waved his finger, causing the eighteen-colored flame to fly over. As soon as it touched the turtle-wok, a brilliant golden design appeared that surpassed anything up to this point, and filled Bai Xiaochun’s ears with deafening rumbling sounds.</p><br/><p>When the light faded away, Bai Xiaochun’s nascent soul radiated heaven-shaking, earth-shattering energy that caused a whirlwind to pick up in the room. At that point, Bai Xiaochun in nascent soul form opened his eyes. He had achieved a cultivation base breakthrough!</p><br/><p>He was no longer in the mid Nascent Soul stage; he had risen to the late stage!!</p><br/><p>Of course, he could have achieved this breakthrough long ago, even before he left Arch-Emperor City. However, he had been holding back. Now that he had achieved this drastic transformation, his eyes shone with brilliant light, and his aura surged as mightily as the sea. As for his battle prowess, it was far, far higher than before.</p><br/><p>However, things weren’t over yet. Since he had decided to perform spirit enhancements on his nascent soul, he figured he might as well… perform as many as he could. Waving his finger, he pulled the nineteen-colored flame over, which, as soon as it touched his turtle-wok, caused golden light to spill out that was even more dazzling than that from the eighteen-colored flame!</p><br/><p>In fact, the private chamber he was in almost seemed like it had become gold!</p><br/><p>Outside, Mistress Red-Dust’s eyes widened in surprise, and even Lei Shan looked over. Neither of them could sense the fluctuations of spirit enhancement. However, both could tell that a drastically powerful force was brewing in the heavenly airship, something that would likely explode out at any moment.</p><br/><p>Lei Shan’s eyes flickered with black light, and he was just about to fly past Mistress Red-Dust in an attempt to stop whatever was about to begin. However, Mistress Red-Dust seemed enlivened by the newfound hope, and immediately did everything she could to block his way.</p><br/><p>As the rumble of battle grew more intense, countless individuals back in Arch-Emperor City were expressing their shock. A massive uproar was sweeping through the city as people found out that Bai Xiaochun had gone from a fifteenfold enhancement all the way to an eighteenfold one. It was a commotion no less intense than that caused by Bai Xiaochun using Bai Hao’s identity to become an earthly necromancer.</p><br/><p>Countless soul cultivators were flying over to the Hell-Emperor Stele, where they gasped at the sight of Bai Xiaochun’s name at the top of the list, glowing with black light.</p><br/><p>Soon, the light faded away, and yet again, the number next to his name was different. As it became clear, people could see that it read… nineteen!!</p><br/><p>Silence prevailed for only a moment before a massive uproar began!</p><br/><p>“Nineteenfold… that’s impossible!!”</p><br/><p>“Forget about nascent souls, even ordinary magical items are hard to perform nineteenfold spirit enhancements on. In all the Wildlands, there are probably only two or three!! Any one of them would be considered a precious treasure of antiquity in the Arch-Emperor Dynasty!!”</p><br/><p>“Where did this Bai Xiaochun get an eighteen-colored flame, let alone nineteen-colored flame?!?! The only person in the Wildlands who can conjure nineteen-colored flame is Earthmaster Wan Pin!!”</p><br/><p>No greater commotion could have occurred. The Grand Heavenmaster was affected, as was the Arch-Emperor. There was little need to even mention the four heavenly kings. Perhaps such people could overlook the fact that Bai Xiaochun had performed a fifteenfold spirit enhancement on his nascent soul, but a nineteenfold enhancement was something completely awe-inspiring.</p><br/><p>Furthermore, the Giant Ghost King and the Grand Heavenmaster were both aware that the situation involved Mistress Red-Dust, and began to make inquiries.</p><br/><p>However, as they tried to make contact, the Grand Heavenmaster frowned, and the Giant Ghost King’s expression flickered. Then both of them rose to their feet in shock.</p><br/><p>They… couldn’t reach Mistress Red-Dust!!</p><br/><p>“Something's gone wrong!!” The Giant Ghost King’s eyes flickered with a dangerous light as he flew out of Giant Ghost City and sent his divine sense streaming out in all directions. Then, he shot off into the distance, heart gripped with fear and anxiety as he tried to locate his only daughter!</p><br/>\n</div>"}