{"title": "Chapter 835: Cause And Effect", "id": 835, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-835-cause-and-effect", "volume_title": "Volume 9", "body": "<h1>Chapter 835: Cause And Effect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When the gravekeeper pushed his hand out, there was no screaming wind, nor any smoke or fire. However, the entire world seemed to go completely still and silent.</p><br/><p>The sky didn’t tremble. The lands didn’t quake. The winds which had surrounded the gravekeeper vanished. As for all of the countless vengeful souls, their resentment seemed to vanish, and they prostrated themselves in worship to the gravekeeper.</p><br/><p>Everyone who saw what was happening was shaken. As for the little girl, the souls which made up her face scattered as they too prostrated themselves to the gravekeeper.</p><br/><p>Then, an enormous manifestation of the Underworld River appeared, waves glistening as it filled the world. The countless souls which filled the area then began to float toward the river, like stars returning to their place in the sky.</p><br/><p>The face of the girl faded away, revealing the violet conglomeration of blood. A moment later, the face reappeared in the blood, eyes shining with strange light as she looked at the gravekeeper. Then, she unleashed the very same technique that had destabilized the divine souls of the demigods, that which the Grand Heavenmaster had referred to as… Archaean divine magic!</p><br/><p>“So you finally decided to show up, Hell-Emperor!! I knew it! I could sense traces of you on that Bai Xiaochun over there! I knew that if I followed him around long enough, he would lead me to you!!”</p><br/><p>Shocked looks appeared on the faces of all present in response to her words. At the same time, the same sound waves appeared as last time, except instead of spreading out for 500 kilometers, they were focused in an attack on the gravekeeper.</p><br/><p>The girl had previously mentioned Bai Xiaochun, but that had been a dramatic and frenzied moment, leaving people little time to contemplate the implications. But now, he who was like a god to the Wildlanders had appeared, the Hell-Emperor. Therefore, the words which had just been uttered by the girl caused everyone to turn their gazes onto Bai Xiaochun.</p><br/><p>“Bai Xiaochun!?!?”</p><br/><p>“Grandmaster Bai is Bai Xiaochun?!”</p><br/><p>The soul cultivators from Giant Ghost City were all completely shocked, to the point where their jaws hung open….</p><br/><p>“Bai Xiaochun…?” Chen Haosong and the other heavenly dukes had strange expressions on their faces as they looked over at him.</p><br/><p>The Nine Serenities King, War Champion King, and Spirit Advent King were all stunned.</p><br/><p>Only the Grand Heavenmaster and the Giant Ghost King didn't have any reaction, as though this news wasn’t surprising to them at all…. However, mixed emotions could be seen on Mistress Red-Dust’s face.</p><br/><p>Although this possibility had existed in the bottom of her heart for a long time, she hadn’t been willing to devote any thought to it. But now, having heard the little girl essentially say the same thing twice, it caused Mistress Red-Dust to begin to pant. The fact that her own father had given her hand in marriage to Bai Xiaochun… turned her world completely upside down.</p><br/><p>Bai Xiaochun’s heart began to pound because of all the eyes looking at him. However, there was nothing he could do to change how events were playing out. After blinking a few times, he put on a blank expression, as though he didn’t understand what was being talked about. Then he looked around as if trying to figure out who in the crowd was really Bai Xiaochun…. In response, many strange looks could be seen on the faces of the others present.</p><br/><p>At the moment, Bai Xiaochun didn’t have time to worry too much about what exactly everyone was thinking. At long last, he had realized why this ghostly girl had been following him for such a long time… she had been using him to find the Hell-Emperor.</p><br/><p>“No wonder….” Although it was a bit of a shock to find out that the gravekeeper was the Hell-Emperor, when he thought about how mysterious the man was, it all made sense.</p><br/><p>“When she said she noticed traces of Great-Grandpa Gravekeeper on me, was she referring to how he saved me from the Luochen Clan?”</p><br/><p>As Bai Xiaochun was wrestling with these thoughts, the girl’s Ghost Harmonization erupted out, causing the sky between her and the gravekeeper to shatter. The gravekeeper sighed, waving his hand to cause the shattering sky to transform into a huge black hole. The black hole began to explode, releasing power that seemed capable of destroying the entire world. Thankfully, the same world-sealing net existed as had appeared when the Giant Ghost King unleashed his black sun. The illusory net easily dispersed the world-destructive power, and it faded away!</p><br/><p>The gravekeeper shook his head and spoke in an ancient, weary voice, “I’ve been avoiding you at every turn. Why do you insist on hounding me?”</p><br/><p>“If you want me to stop hounding you, then open the Worldgate! Allow me… to leave this place!!” Sound waves continued to stream out, destroying the air as they went along. However, the young girl's bizarre, echoing voice could still be heard.</p><br/><p>Her eyes were filled with focus, determination, and madness. Furthermore, there was no deceit in her words. She was not a person of this world. She had come from beyond the heavens, a discarnate soul who had fallen down into the world along with an enormous sword.</p><br/><p>She had once been confused and unintelligent, with no hope of ever regaining her senses. But then Bai Xiaochun had entered the Fallen Sword Abyss, and she had consumed his medicinal pills. Her soul body had been stimulated, and her mental faculties had recovered. At that point, she remembered everything about her past!</p><br/><p>She found the world she was in a very strange place, and instinctively wanted to keep Bai Xiaochun next to her, considering that he had been the one to restore her mental faculties.</p><br/><p>However, despite the fact that her soul body was indestructible, her battle prowess wasn’t sufficient. Because of that, Bai Xiaochun escaped. She had later escaped the Fallen Sword Abyss to roam the world on her own, whereupon she learned more about the truth of where she was. She eventually came to realize… that if she wanted to escape, if she wanted to get home, she needed the gravekeeper to open the gate to this world.</p><br/><p>Unfortunately, she wasn’t powerful enough to locate the gravekeeper. However, she remembered the traces of the gravekeeper that she had sensed on Bai Xiaochun!</p><br/><p>At that point, she came to the conclusion that Bai Xiaochun… had been looked upon kindly by the gravekeeper. And she also realized that if she followed Bai Xiaochun for long enough, that she would likely find the person she was looking for.</p><br/><p>And that was what led to the entire situation…. It was also why she had sometimes even protected Bai Xiaochun. Unfortunately, after the labyrinth spell formation was activated, something unexpected happened. She lost track of Bai Xiaochun!</p><br/><p>No amount of searching had turned up any clues. Therefore, she eventually decided to impersonate him, all with the goal… of luring him out into the open, and thus, getting access to the gravekeeper!</p><br/><p>It almost didn’t matter how things played out, she would succeed. Furthermore… when Bai Xiaochun had attempted to flee earlier, she had not unleashed the killing techniques she was capable of, all because her true goal was to force the gravekeeper out into the open!</p><br/><p>When the demigods attacked, it was to further her main goal that she had summoned all the souls of the Wildlands, in order to shake the foundation of the world.</p><br/><p>It was something she could not do in the Heavenspan River region. After all… the souls that existed only in the Wildlands were the best tool for her to aid her recovery, and also the best advantage she had in a fight!</p><br/><p>More important than anything else… she had another friend out there somewhere….</p><br/><p>With such thoughts on her mind, she chuckled. Even as her Ghost Harmonization continued, she opened her mouth, causing the air behind her to distort as the enormous head of an evil ghost appeared behind her. The ghost immediately opened its mouth and lunged toward the gravekeeper.</p><br/><p>The evil ghost radiated battle prowess equivalent to a demigod, which left the Grand Heavenmaster and everyone else in the area completely shocked.</p><br/><p>However, the appearance of the gigantic evil ghost only caused the gravekeeper to shake his head. With that, he extended his ancient right hand and pointed at the ghost head.</p><br/><p>All creation began to tremble. The air around the evil ghost then began to collapse, creating what appeared to be the shape of an enormous mouth, which instantly gobbled up the ghost!</p><br/><p>At the same time, the gravekeeper performed an incantation gesture and waved his finger at the girl.</p><br/><p>“Wind!” he said. It was one simple word, but when it came out of the mouth of the gravekeeper, it seemed to contain the power of the natural laws of heaven and earth. Almost immediately, the entire sky filled with a wind capable of destroying all living things!</p><br/><p>The terrifying power in that wind surpassed that of a demigod, and caused even the little girl’s face to fall. As for Bai Xiaochun, his eyes went wide, and he gasped at how unbelievably powerful the gravekeeper was!!</p><br/><p>“The Hell-Emperor….” he murmured to himself.</p><br/><p>Massive energy surged, energy that surpassed the ability of all onlookers to even react to it. When the gravekeeper uttered that single word, wind, it was as if all the wind in the world reacted with explosive fury.</p><br/><p>The world became a place of wind, with the gravekeeper being the eye of the storm, a mountain-toppling, sea-draining vortex that crushed toward the little girl!</p><br/>\n</div>"}