{"title": "Chapter 844: Undying Bones Skyrocket", "id": 844, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-844-undying-bones-skyrocket", "volume_title": "Volume 9", "body": "<h1>Chapter 844: Undying Bones Skyrocket</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Happy for his apprentice, and excited about his new status, he looked down at the hair he held, and his heart yet again began to thump.</p><br/><p>“A lock of the Celestial’s hair… It was the only red hair on his head…. I can only imagine how important a treasured item like this would be to the Celestial….” Having reached this point in his train of thought, Bai Xiaochun glanced around subconsciously.</p><br/><p>The cultivators that had previously been stationed here to guard the Underworld River Restricted Area were nowhere to be seen, leaving him completely alone. Perhaps it was the doing of the gravekeeper, or perhaps they left because of the shocking battle and the destruction of the Great Wall. The entire structure of the Wildlands would be changing. At this point, he gritted his teeth.</p><br/><p>“Fudge. What the hell am I afraid of? Great-Grandpa Gravekeeper gave this to me! It's mine now! Besides, according to what Great-Grandpa Gravekeeper said, if I absorb this life force, my Undying Bones will climb to the very peak. Even if this hair belonged to someone more powerful, I would still absorb it!”</p><br/><p>After the tempering he had experienced in the Wildlands, Bai Xiaochun had become somewhat more courageous than he had been in the past. Therefore, he found an area in the Underworld River Restricted Area that was suitable to hew out a temporary immortal's cave, and then went into seclusion to cultivate!</p><br/><p>**</p><br/><p>Somewhere else in the Wildlands, in what seemed like a different dimension, there was a huge black river that was none other than the Underworld River.</p><br/><p>It was as black as night, and yet, it was still possible to see a huge palace at the very end of the swirling river water.</p><br/><p>The palace was also black, and very sinister in appearance as it rose up over the river water. There was something consummately powerful about it, and there was a constant stream of souls which flew toward it, encircled it, and then vanished on their way to being reincarnated.</p><br/><p>This was none other than the Hell-Emperor Palace!</p><br/><p>This place controlled reincarnation, and determined matters of life and death!</p><br/><p>In one of the grand halls in that palace, two rows of statues could be seen lining the walls, that looked like underworld generals. At the very end of the hall, beyond the statues, was a huge throne made of black bones!</p><br/><p>Suddenly, the gravekeeper appeared, walking through the hall until he was at the throne, upon which he sat down. He was surrounded by a domineering aura, making him seem like a paragon or a god. He wore an imperial crown, as well as a black robe embroidered with an underworld dragon!</p><br/><p>With the wave of a sleeve, he caused Bai Hao to materialize right in front of him.</p><br/><p>He was clearly ill at ease. He looked around at the awe-inspiring hall with its profound aura of death, and then turned to look at the gravekeeper, who sat there on his throne, face completely expressionless. Bai Hao quickly bowed his head and clasped hands in greeting.</p><br/><p>“Bai Hao!” the gravekeeper said, his eyes shining brightly, and his voice echoing like heavenly thunder.</p><br/><p>The gravekeeper seemed very different than he had when talking with Bai Xiaochun earlier. Right now, he absolutely seemed like the mighty Hell-Emperor!</p><br/><p>Bai Hao could tell that, and a very serious expression overtook his face.</p><br/><p>“Listen well, Bai Hao!” the gravekeeper continued, his voice thrumming with mysterious power that pierced into his soul body and resonated with his very soul. Because of this, the gravekeeper would be able to see the tiniest fluctuations in Bai Hao’s soul, and would know instantly whether or not he was lying or telling the truth!</p><br/><p>“Bai Xiaochun is currently your Master, and will be in the future! Although I took it upon myself to change your fate, all I did was place you at Bai Xiaochun’s side. He was the one who took you as an apprentice; it was not my arrangement. It was simply your destiny!</p><br/><p>“Furthermore, the reason you have become my successor is not because I approve of you, but rather… because your Master Bai Xiaochun approves of you!</p><br/><p>“Remember well: your mission is not to guard the Underworld River, nor is it to look over reincarnation. Instead… you are to help your Master in caring for the Underworld River. You are to defend your Master! And if you ever betray him, the Underworld River itself will ensure that you are killed in body and soul!” As he spoke, the gravekeeper’s voice grew louder and louder until it was a crashing boom that caused everything to shake violently, and even caused the water of the Underworld River to vibrate.</p><br/><p>Countless souls began to tremble and shake, and then offer obeisance to the Underworld Palace.</p><br/><p>Bai Hao was shaken, but it was without the slightest hesitation that he said, “The word <em>betray</em> doesn’t exist for Bai Hao!”</p><br/><p>His words were spoken with the utmost solemnity and honesty. In his world, nothing was more important than his Master Bai Xiaochun, who was his only family!</p><br/><p>In fact, he wasn’t offended or worried at all by what the gravekeeper had said. In fact, it conformed perfectly with how he felt. And his answer could not have been more forthright!</p><br/><p>A flicker of praise passed through the gravekeeper’s eyes. This had been his final test of the Bai Hao. The position of Hell-Emperor was too important, and he had to ensure that he didn’t make any mistakes. As of this point, he was convinced that Bai Xiaochun had made the right choice!</p><br/><p>“Next month… you will be the Hell-Emperor!” With that, he waved his finger at Bai Hao, sending his legacy and his divine abilities into him!</p><br/><p>Furthermore, outside of the Underworld Palace, countless magical symbols could be seen, flickering brightly until they transformed into a huge vortex. The spinning of that vortex indicated… that the passing of the legacy had begun!</p><br/><p>As the Hell-Emperor’s legacy began to be passed on, Bai Xiaochun was in his immortal's cave in the Underworld River Restricted Area, absorbing the life force from the Celestial’s blood-hair.</p><br/><p>The Undying Codex was divided into Skin, Muscle, Tendons, Bones, and Blood!</p><br/><p>Bai Xiaochun had started from the foundation and worked all the way up to the fourth volume. And right now, he was in the Powered Bones level. After that came Heavenly Bones, and in the end, the true Undying Bones!</p><br/><p>The key to cultivating his Undying Technique was life force. Only by having access to enough life force could one achieve the meteoric rise that one sought!</p><br/><p>In the past, he had relied on his Eternal Parasol to absorb life force from the Wildlander chosen. That was what had helped him to break through from the Tempered Bones level to Powered Bones.</p><br/><p>But now… with the life force that the Celestial had gone through countless trials and tribulations to cultivate into his blood-hair, Bai Xiaochun was making shocking progress.</p><br/><p>Intense rumbling sounds could be heard, and he shook physically as his bones creaked and cracked. It was as if he were completely changing his skeleton, causing him to rise rapidly through the fourth volume of the Undying Codex.</p><br/><p>In fact, he immediately broke through to the Heavenly Bones level!</p><br/><p>He became like a black hole, absorbing all of the life force from the blood-hair, and then using the Undying Codex techniques to send it rushing into his bones, utterly transforming them!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>No one outside could hear any of the shocking sound, but Bai Xiaochun could hear it as clear as day. Furthermore, he could sense his Heavenly Bones rapidly absorbing the life force that continued to pour into them.</p><br/><p>His Heavenly Bones instantly went into the third stratum, then the fourth, fifth, seventh… and ninth!!</p><br/><p>It was skyrocketing!</p><br/><p>Another breakthrough!</p><br/><p>He was now in the first stratum of the Undying Bones, and yet, had only absorbed a portion of the life force from the Celestial’s blood-hair. Now, that life force continued to propel him through the Undying Bones level!</p><br/><p>The final level of the Undying Bones required a massive amount of life force, more than all three of the previous levels put together. Furthermore, once he reached the peak… it meant that his fleshly body would be at an astonishingly high level!</p><br/><p>His fleshly body would be comparable to a deva! His skin, muscles, and bones… would be at a level that would make them almost impossible to destroy!!</p><br/><p>Later on would come the Undying Blood, which came with dramatic restorative powers. At that point, his fleshly body would be very close to the truly undying level…. Then, he would be at the same level as the Blood Ancestor back in the River-Defying Sect!</p><br/><p>At that point… his cultivation of the Undying Codex would be complete!</p><br/><p>Right now, he relied on the blood-hair of the Celestial to advance by leaps and bounds. His Undying Bones advanced from the first stratum to the fourth, and then continued!!</p><br/><p>Fifth stratum, sixth, seventh….</p><br/>\n</div>"}