{"title": "Chapter 851: Why Wont You Accept It, Song Que?", "id": 851, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-851-why-wont-you-accept-it-song-que", "volume_title": "Volume 9", "body": "<h1>Chapter 851: Why Wont You Accept It, Song Que?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I'm so close to being a deva!” The idea of becoming a deva somehow made the world a more perfect place for Bai Xiaochun. That was especially true when he thought about the fact that the Starry Sky Dao Polarity Sect, a majestic riversource sect, only had five devas. Any one of those five devas could be considered supremely important.</p><br/><p><span id=\"footnote-ref-8b2b\"><span>“They’re all almighty figures who live on the blue rainbow.” The more he thought about it, the more exciting it seemed. Then he thought back to his time at the Great Wall, and how the deva Chen Hetian had so brazenly screwed him over. </span>[1]</span></p><br/><p>“Just wait until I’m back. It won’t be long before I'm a deva. And then… hmmmphh! It’s been decades, but it’s still not too late to get my revenge, Chen Hetian!” Bai Xiaochun felt extraordinary. His time in the Wildlands had propelled him toward the very peak of life. As of this moment, it would be very difficult to find very many chosen in heaven and earth who could match up to him.</p><br/><p>“What a lonely feeling!” Clasping his hands behind his back, he shook his head and savored the wonderful sensation. Then he swaggered out of his immortal's cave and walked over to the unconscious Song Que.</p><br/><p>Just looking at Song Que caused his head to ache. After a bit of thought, he waved his finger, sending a stream of spiritual energy into him. Song Que shivered and slowly opened his eyes. At first, his expression was blank, but when he saw Bai Xiaochun, he began to tremble. His eyes turned bloodshot, and his mind began to spin as he recalled everything that had occurred before he had passed out.</p><br/><p>Bai Xiaochun quickly said, “Let me explain, Que’er, I--”</p><br/><p>However, before he could say anything more, Song Que shouted, “You… you…!”</p><br/><p>The thought of him having become Bai Xiaochun’s pet was the most horrific thing to ever happen in his life. The anger and resentment he felt because of it had him teetering on the verge of completely exploding.</p><br/><p>Bai Xiaochun’s headache worsened. Seeing that Song Que was about to erupt, he scrambled to come up with a plan for what to do. Suddenly, his expression flickered. Instead of looking like he was trying to provide an explanation, he seemed somber, even sorrowful. Before Song Que could say anything, he spoke with such enormous volume that Song Que’s madness was stifled.</p><br/><p>“Song Que, I know you refuse to accept this. But. <em>Why</em> won’t you accept it!? It’s true that I, Bai Xiaochun, have reached incredible heights, in the Blood Stream Sect, the River-Defying Sect, the Starry Sky Dao Polarity Sect, the Great Wall, and here in the Wildlands. But you’ve only seen me in my best moments! Do you know how I got to those moments? I’ll tell you. Fudge! The only reason I reached such heights was by sacrifice!” This sudden outburst by Bai Xiaochun caught Song Que completely off-guard. He had never seen Bai Xiaochun acting like this before.</p><br/><p>“In the Starry Sky Dao Polarity Sect, you people all abandoned me! I had only my own skill and ability to rely on. I started an inn, and even got you promoted to the rainbow district. I didn’t owe you anything back then!</p><br/><p>“At the Great Wall, it was my skill with medicinal pills that saw me reach the rank of major general. Do you think the deva there was a complete idiot? Do you think the sect is full of fools? Do you think they just randomly allowed me to become a major general? No! I earned that rank with my success!” He swished his sleeve to emphasize his words, and his voice thrummed with intense decisiveness. Despite the fact that Song Que was hovering on the verge of madness, he couldn’t help but be shaken by Bai Xiaochun’s words.</p><br/><p>“You saw for yourself how many people in the Wildlands want to kill me, right? Do you know how many deadly crises I faced? All of the nobility and aristocracy hate me down to their marrow! I even risked exposing myself to save you!</p><br/><p>“So what if I tousled your hair? What’s so wrong with that? I'm not allowed to touch your head or something? I don't qualify? Not only am I your uncle, I have a demigod for a father-in-law! I'm the Master of the Hell-Emperor! I'm the overlord of the Wildlands! You want to talk status? I'm on the same level as the Celestial! Who out there dares to talk to me about qualifications?!” By this point, he was shouting. Song Que’s face was devoid of blood, and his humiliation and rage were collapsing. Bai Xiaochun’s tirade caused him to edge backward, his eyes bloodshot, but his heart pounding as if with thunder.</p><br/><p>He had to admit that everything Bai Xiaochun had just said was true. Bai Xiaochun didn’t owe him anything, and yet had blessed him with good fortune. He had even saved him on multiple occasions. In fact, if it weren’t for Bai Xiaochun, Song Que would either be dead, or at the very least, wallowing in abject misery.</p><br/><p>His refusal to accept the truth came mostly from his own pride. And the fact that he didn’t like Bai Xiaochun was because of his own inability to measure up to him!</p><br/><p>As for the last thing Bai Xiaochun had just said, about qualifications, there was literally nothing Song Que could say by way of retort. All he could do there was stand there, his chest heaving.</p><br/><p>When Bai Xiaochun saw that Song Que had been cowed, he breathed an inward sigh of relief. He really had had no other choice than to say what he had. And the fact that it had worked had him feeling quite pleased with himself. However, he kept that somber expression on his face.</p><br/><p>“You don’t have to like me, Song Que. In fact, just think of me as a mountain that you will overturn one day in the future! Bai Xiaochun… will be waiting for you! But… before you acquire the proper qualifications, you <em>will</em> behave!” With that, he waved his sleeve dramatically. His voice resonated in profoundly domineering fashion, and in fact, he even secretly threw in a bit of energy from the Undying Emperor’s Fist. That, coupled with the actual words he had spoken, made him seem like a powerful king or emperor, the type who everyone would respect.</p><br/><p>His devastating verbal attack slammed into Song Que’s mind, causing him to back up a few more paces. Trembling, he looked at Bai Xiaochun and suddenly realized that there was a bit of respect rising up in his heart!</p><br/><p>“I'm going to be leaving the Wildlands and going back to the River-Defying Sect,” Bai Xiaochun continued. “So, Song Que… do you want to come with me? If not, I won’t force you!” Snorting coldly, he looked away from Song Que and began to float slowly up into the air as he waited for a response.</p><br/><p>“Everything I said should work,” he thought. “Ai… what a headache! Oh, Junwan, how truly I care for this nephew of ours!” Blinking a few times, he rubbed the bridge of his nose and sighed.</p><br/><p>As for Song Que, he stood there on the bank of the Underworld River, mixed emotions playing out in his eyes. Finally, he sighed and closed his eyes for a moment. When he opened them, they shone with determination.</p><br/><p>“Sooner or later, I'm going to surpass him!” The truth was, even he didn't believe that. However, he was used to saying such things, and it would feel too strange to not say them. Snorting coldly, Song Que flew up into the air after Bai Xiaochun.</p><br/><p>When Bai Xiaochun saw that, he breathed another inward sigh of relief. The truth was that he felt bad about the mistake he had made in reaching out to to touch Song Que’s head….</p><br/><p>“Well, I didn’t ask him to stick his head out toward me. He did that on his own!” Of course, he didn’t say that out loud. If he did, Song Que would likely explode, and he had just worked hard to calm him down.</p><br/><p>“Ai, he flies off the handle too easily.” Shaking his head, he began to fly off into the distance, Song Que in tow. The two of them flew along silently for some time, heading toward the location where the eastern and northern sections of the Great Wall had once met. That was the location where they would head back to the River-Defying Sect. Their pathway home led through… the Deadmire!</p><br/><p>Based on the speed they were capable of, it would only take a few months for them to reach it!</p><br/><p>Two months passed in the blink of an eye. They didn’t see any cities, only rugged and crumbling mountains and sprawling jungles. There were few soul cultivators, and only the occasional tribe of savage giants.</p><br/><p>Bai Xiaochun was already beginning to sigh at how quietly he was making his departure. It was almost as if no one cared about him….</p><br/><p>“Ah, whatever. Keeping a low profile is always the best thing to do.” Sighing again, he looked off at a distant mountain range. According to the map he had, after passing through those mountains, they would be on the very border of the Wildlands.</p><br/><p>However, even as he was preparing to lead Song Que in that direction, he stopped in place. Song Que, whose expression had been very grim during the last two months, suddenly looked off in a certain direction, his pupils constricting.</p><br/><p>At this point, the two of them realized that, standing right there at the peak of one of the nearby mountains, was a woman! She had long hair and a red robe, and was as beautiful and elegant as an immortal!</p><br/><p>She was none other than… Mistress Red-Dust, Zhou Zimo!</p><div id=\"footnote-8b2b\"><br/><p>1. Hey everyone, this chapter contains a detail that was never included in the original descriptions of the SSDPS. Apparently, each of the seven rainbows is a different color. I need to go back to check earlier references to see if I missed something in the earlier chapters, or if this is indeed a detail that was added later on. I vaguely remember some of the individual rainbows being described as having different colors in them. I will do that at some point, perhaps after the translation is completely done and I got back for a final edit. In any case, the rainbow that the devas live on is the blue one.  <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}