{"title": "Chapter 855: Journey Of Three", "id": 855, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-855-journey-of-three", "volume_title": "Volume 9", "body": "<h1>Chapter 855: Journey Of Three</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><em>Book 6: The Strongest Deva</em></strong></p><br/><p>Bai Xiaochun felt great compassion for the gaunt and bedraggled Master God-Diviner. At the same time, he couldn’t help but compare Mistress Red-Dust with the female savages of this matriarchal tribe.</p><br/><p>When he did that… he suddenly felt blessed.</p><br/><p>Of course, he didn’t show that on his face. Instead, his compassion grew more obvious. And thus, he took Song Que and Master God-Diviner, and left the tribe.</p><br/><p>By means of medicinal pills, Bai Xiaochun helped Master God-Diviner remove the restrictive spell that had been placed on him, and helped him recover from his injured and weakened state. Gradually, the color returned to his face, and more importantly, excitement filled his heart because of his escape from calamity.</p><br/><p>It was as if new life had been breathed into him. He was in a wonderful mood, to the point where the sky even seemed bluer than normal, and the sunshine brighter. Everything was going well. However… that good mood only lasted for a few hours…. After the group of three was a short distance away from the matriarchal tribe, Bai Xiaochun began to talk.</p><br/><p>“Master God-Diviner, you really ended up in a rough situation! Ai. Before running into you, I thought that Que’er had it worst. Who would have thought that you…?” As he sighed, Song Que snorted coldly in his heart, convinced that Bai Xiaochun was preparing to show off to Master God-Diviner.</p><br/><p>And that was exactly right. However, even after the hours which had passed, it was to Bai Xiaochun’s irritation that Master God-Diviner didn’t ask any questions about how he had fared in the Wildlands. His heart itched with the sensation of having his exploits unlauded, and he was starting to get jumpy in the hopes that Master God-Diviner would make some inquiries.</p><br/><p>A strange expression appeared on Master God-Diviner’s face. It had been many years since he had been around Bai Xiaochun, but he knew him well. Furthermore, although he hadn’t looked closely at the cultivation bases of Bai Xiaochun and Song Que earlier, when he did now, he was shocked at their progress. Then he thought about all of the events which had played out back in the Starry Sky Dao Polarity Sect and the Great Wall, and at that point, he decided to change the subject.</p><br/><p>“Ah, don’t worry about me. I’ll recover fine after I do a bit of cultivation.” With that, he laughed heartily and rotated his cultivation base a bit.</p><br/><p>Bai Xiaochun was less than pleased at Master God-Diviner’s complete lack of loyalty. All Bai Xiaochun wanted was to show off a bit, and yet the man wasn’t cooperating at all. That made him suddenly think about Xu Baocai. Xu Baocai would definitely have cooperated!</p><br/><p>Song Que, on the other hand, was very pleased with how Bai Xiaochun was reacting. Time passed, and the three of them got closer and closer to the Deadmire.</p><br/><p>Eventually, when they were only a day away, Master God-Diviner, who still had not given Bai Xiaochun any chances to revel in glory, finally couldn’t hold back from asking a certain question.</p><br/><p>“Um… where exactly are we going?”</p><br/><p>The question caused Song Que’s heart to thump, and he was just about to jump in to provide the answer when Bai Xiaochun’s eyes lit up. Leaping to his feet, he loudly said, “We're going to the Deadmire! That's the way back to the River-Defying Sect. Have you heard of the Deadmire? It's super dangerous! Devas won’t even step inside a single pace, let alone Nascent Soul experts!”</p><br/><p>“The Deadmire?” Master God-Diviner said, his eyes widening. He had indeed heard of the Deadmire, and knew that what Bai Xiaochun had said was no exaggeration. According to what he had heard, not even demigods would dare to set foot inside!</p><br/><p>It was a forbidden region where life did not exist!</p><br/><p>“Why don’t we just go to the Great Wall…?” Master God-Diviner asked, swallowing hard. Although he had divined that he would be saved, he hadn’t come up with any information regarding what would happen afterward. After escaping the greatest calamity of his entire life, he couldn’t help but worry about his fate.</p><br/><p>Off to the side, Song Que sighed. He knew… that nobody would be able to stop Bai Xiaochun from showing off now. And he was right. As soon as the second question left Master God-Diviner’s mouth, Bai Xiaochun’s eyes began to shine even more brightly.</p><br/><p>“Hahaha! So you <em>have</em> heard of it! Alright, Master God-Diviner, listen up while I explain!” Feeling very pleased with himself, he slapped his bag of holding to produce a command medallion.</p><br/><p>At this point, Master God-Diviner’s eyes went a bit blank as he realized that he had given Bai Xiaochun the opportunity he had been looking for….</p><br/><p>“See this? With this command medallion, we can get through the Deadmire easily and safely!” Bai Xiaochun waved the command medallion in front of Master God-Diviner’s face, his eyebrows jumping up and down with excitement.</p><br/><p>“I know what you’re wondering. What kind of command medallion is this? And how did I get it? Well, it’s a long story, but we have plenty of time. I’ll explain everything in detail. It all started back when we were teleported here into the Wildlands….”</p><br/><p>Bai Xiaochun spent most of the following day recounting his adventures in great detail, putting special emphasis on the status and position he had attained.</p><br/><p>At first, Master God-Diviner sighed in regret. However, by the time it got to the part where Bai Xiaochun kidnapped the demigod Giant Ghost King, his eyes nearly popped out of his skull. And eventually, he came to realize that the Giant Ghost King kidnapping was like nothing compared to the rest of the story!</p><br/><p>“Did you just say… that you kidnapped all of the chosen in the Wildlands?!?! And the Giant Ghost King gave you Mistress Red-Dust’s hand in marriage!?</p><br/><p>“You… you actually became the inspections commissioner of the Arch-Emperor Dynasty? And performed countless shakedowns?!?!</p><br/><p>“You helped the Grand Heavenmaster enact a Proclamation of Universal Grace? You’re an earthly necromancer?!?!</p><br/><p>“You…. Heavens! You’re not kidding about this, are you? Your apprentice is the Hell-Emperor?!?!?!” Master God-Diviner was thoroughly shaken, and could hardly believe what he was hearing. The story was so unbelievable it was almost like a fairy tale.</p><br/><p>Bai Xiaochun was very pleased with the look in Master God-Diviner’s eyes. At this point, he finally felt he could leave the Wildlands without any regret in his heart.</p><br/><p>However, he also decided it would be better to err on the side of modesty.</p><br/><p>“Yeah, I did okay. Actually, I wasn’t even trying very hard.” Swishing his sleeve, he stuck his chin up and said, “You know I can reduce most things to ashes with the swish of a sleeve. It’s not the first time.”</p><br/><p>To Master God-Diviner, it felt like thunder crashing in his ears, and the truth was, he didn’t really believe it. But… then he noticed the unsightly expression on Song Que’s face, and how he wasn’t saying anything at all. At that point, Master God-Diviner’s heart was struck by great waves of shock. That was especially true considering the final part of the story regarding Bai Xiaochun’s apprentice being the Hell-Emperor.</p><br/><p>It was to Master God-Diviner's grief and shock that he realized the cruel truth: Bai Xiaochun really did rock all creation wherever he went!</p><br/><p>In the Starry Sky Dao Polarity Sect, he formed a powerful underworld organization!</p><br/><p>At the Great Wall, he fought his way to the coveted rank of major general!</p><br/><p>And in the Wildlands, he shockingly ended up as the Master of the Hell-Emperor!</p><br/><p>Master God-Diviner almost couldn’t wrap his mind around it all. Even just one of the things Bai Xiaochun had done would be enough to shake anyone to the core, let alone all of them together.</p><br/><p>It was roughly evening when the group of three, including the dazed Master God-Diviner, arrived at the location where the Heavenspan River region’s northern and eastern Great Walls had once met. This was the entrance to… a land devoid of life!</p><br/><p>It was actually a towering and winding mountain range that, upon being entered… led to a location no one had ever been to. The Deadmire!</p><br/><p>As soon as they caught sight of the mountains, Bai Xiaochun patted his bag of holding, confident that the gravekeeper had been telling the truth. Gritting his teeth, he flew into the mountains!</p><br/><p>Song Que took a deep breath. He didn’t particularly feel like going into the Deadmire, but knew he had no choice. The Great Wall had collapsed, and the Celestial had sealed the area, making passage back to the Heavenspan region that way impossible.</p><br/><p>If they didn’t go through the Deadmire, it would be impossible to say how long they would have to wait to get home. Eyes flickering with determination, Song Que followed Bai Xiaochun.</p><br/><p>Master God-Diviner shook off his daze, and as he did, his eyes were filled with awe and veneration. To him, Bai Xiaochun actually seemed like a god. As of this moment, he was far more confident in Bai Xiaochun’s ability to traverse the Deadmire than Song Que was, and therefore, it was without hesitation that he followed along!</p><br/>\n</div>"}