{"title": "Chapter 858: The Bizarre Bone Galleon", "id": 858, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-858-the-bizarre-bone-galleon", "volume_title": "Volume 9", "body": "<h1>Chapter 858: The Bizarre Bone Galleon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The River-Defying Sect had been at odds with the other three great sects for years, and now, open conflict was imminent. Even as the fighting was just about to break out, Bai Xiaochun, Song Que and Master God-Diviner were in the Deadmire, struck with terror even as they longed to be back in that very same sect.</p><br/><p>The three of them stood on the deck of the battered and damaged ghost galleon, their expressions flickering as they sized up their surroundings.</p><br/><p>There were holes in the pitch-black deck itself, evidence of what must have surely been a fantastic battle fought at some point in the ancient past. Despite the galleon’s dilapidated state, it still thrummed with a powerful aura that filled Bai Xiaochun with the same type of fear he had experienced when in the presence of the Celestial. In fact, the galleon seemed even a bit more powerful than that!</p><br/><p>It shook him all the way down to his soul!</p><br/><p>After looking around nervously for a moment, Bai Xiaochun blurred into motion, heading toward the side of the galleon, where he planned to simply leap over the edge. Song Que and Master God-Diviner joined him, and yet, as they got close to the edge, a black shield of light sprang up, which they thumped into!</p><br/><p>It didn’t matter that Bai Xiaochun could crush early Deva Realm cultivators, and fight toe-to-toe with those in the mid stage. As soon as he made contact with that shield, he simply bounced right off of it.</p><br/><p>He bashed into it again, and the same thing happened.</p><br/><p>It was the same with Song Que and Master God-Diviner. Panting, they all began to look around, extremely serious expressions on their faces.</p><br/><p>The deck of the galleon was almost completely empty, with no major structures on it whatsoever. There was what appeared to be a cabin or bridge, which was the only way to get to the lower decks. From the look of it, other structures had once existed on the deck, but had long since been destroyed!</p><br/><p>Sticking up from the cabin was the flagpole with those three ghost face flags. And above the doorway was a primitive eight trigrams mirror.</p><br/><p>Other than that, there was nothing else visible.</p><br/><p>Song Que had a very unsightly expression on his face as he began to walk around and inspect the galleon. As for Master God-Diviner, he was gasping for breath and shivering. He had already been in a weak state before, and once on the deck of the galleon, felt something like a boundless coldness seeping into him.</p><br/><p>“Hurry up and do some divinations, Master God-Diviner,” Bai Xiaochun said. “See if you can figure out a way off of this galleon!” He glanced over at the cabin door, and was struck with the feeling that the ghost galleon was in control of his very life. Furthermore, he was convinced that the galleon wanted the three of them to enter the cabin door!</p><br/><p>Master God-Diviner’s terror mounted with every moment that passed. After hearing Bai Xiaochun’s suggestion, he reached into the fold of his robe and pulled out a copper coin, which was a magical item that he used to perform divinations. Normally speaking, he was very protective of the copper coin. In fact, back in that savage tribe where he had been held captive, he had been allowed to keep the coin on his person when performing his duties. As soon as he pulled it out, he drew upon the various magical techniques and divine abilities that he used for divination.</p><br/><p>Unfortunately, it was in that moment that flag with the green-skinned, long-fanged ghost face suddenly rippled.</p><br/><p>As a result, Master God-Diviner’s hand trembled, and the coin slipped through his fingers! It landed on the deck, rolled on its side, and then fell into one of the cracks and disappeared!</p><br/><p>“My magic coin!” Master God-Diviner shrieked. “It's completely one-of-a-kind! It’s my life essence magical item, with my name engraved on it!” He rushed over to the crack into which the coin had fallen, but could see only darkness below. It was impossible to determine where exactly his magic coin had landed. Master God-Diviner immediately began to weep. Even during his torment in the savage tribe, he had managed to keep his copper coin safe, only to lose it on this bizarre galleon.</p><br/><p>The sight of Master God-Diviner losing his copper coin right before trying to divine some important information instantly caused Bai Xiaochun’s mood to drop. After looking around, he finally came to focus on the cabin.</p><br/><p>As for Song Que, he had surveyed the deck and found nothing, and also turned his attention to the cabin. Walking over, he stood in front of the door and examined it with a frown.</p><br/><p>Master God-Diviner had a scowl on his face and tears in his eyes, and was feeling very irritated at Bai Xiaochun. However, he didn’t dare to say anything. Eventually, his gaze came to rest on the cabin, whereupon his eyes lit up.</p><br/><p>His attention was especially drawn to the eight trigrams mirror. The mirror was dark, and did not seem capable of projecting any light or images. Furthermore, there was something eerie and sinister about it. From what Master God-Diviner could tell, it was clearly something extraordinary.</p><br/><p>“That must be some sort of treasure!” he thought. Master God-Diviner’s understanding of the arts of divination led him to the conclusion that this eight trigrams mirror was perfectly suited to him. That was especially true considering how depressed he was at the loss of his magic coin. Eyes widening, he hurried over and reached out toward the mirror.</p><br/><p>“Hold on!!” Bai Xiaochun shouted, surprised at Master God-Diviner’s fearlessness. However, he was too late to interfere. Master God-Diviner had already grabbed the mirror.</p><br/><p>Bai Xiaochun felt his head spinning from how dangerous everything seemed. Even Song Que was struck with fear by Master God-Diviner’s impulsiveness.</p><br/><p>“What are you doing, Master God-Diviner?!” he said, rotating his cultivation base at full readiness. However, nothing unusual happened. The corpses outside continued to pull the galleon along at the same speed as before.</p><br/><p>When it was clear that nothing would happen, Bai Xiaochun breathed a sigh of relief. As for Master God-Diviner, he realized he had acted rashly, and felt a bit guilty. However, he quickly put the eight trigrams mirror into his bag of holding.</p><br/><p>“My magic coin fell into that crack,” he said defensively, “so I’m going to take this copper mirror as a replacement.”</p><br/><p>Bai Xiaochun rubbed the bridge of his nose, and Song Que glared briefly at Master God-Diviner before scanning the deck once again. Then, his eyes flickered with determination.</p><br/><p>“We're on a weird boat that is taking us who-knows-where,” he said. “And it's not letting us off. I say… let’s go below decks and explore a bit. Maybe we can figure out what exactly is going on!” With that, he ignored Bai Xiaochun and Master God-Diviner, and stepped toward the cabin door.</p><br/><p>“Wait a minute, Song Que!!” Bai Xiaochun said loudly.</p><br/><p>However, Song Que completely ignored him, and disappeared into the cabin.</p><br/><p>Bai Xiaochun was starting to get angry at how impulsive Master God-Diviner and Song Que were being. Bai Xiaochun was the leader of the group, right? They should definitely be listening to his orders.</p><br/><p>“Are these guys crazy or something? One glance at some stupid mirror and he puts his life on the line? And the other one runs right off into the jaws of death?!” As Bai Xiaochun stood there feeling anxious, Master God-Diviner hesitated for a moment. The truth was that he was still feeling bad about his magic coin, and for all he knew, it was there below decks, waiting to be found. Gritting his teeth, he walked toward the cabin door.</p><br/><p>“Song Que is right. It doesn't seem like this galleon wants to hurt us. If it did, we would be dead already. The best thing is to check things out below decks.”</p><br/><p>With that, he disappeared into the cabin, leaving Bai Xiaochun completely alone on the main deck.</p><br/><p>His expression grew more unsightly by the moment as he stood there staring at the cabin door. For some reason, it seemed like the sinister and vicious mouth of some evil ghost.</p><br/><p>Suddenly, a cold chill ran up his spine. “Wait a second,” he thought. “Song Que has never been very impulsive. And neither has Master God-Diviner…. If they were, they wouldn’t have survived for so long in the cultivation world. Why did they start acting so unusual on this weird galleon!?”</p><br/><p>He looked around, but didn’t see anything unusual. Off in the distance, the fog was as thick as ever, and everything was as quiet as it usually was.</p><br/><p>After a long moment of hesitant thought, he finally clenched his jaw and made his decision. Since the galleon wasn’t letting him leave, he would enter the cabin. He couldn’t just watch as Song Que and Master God-Diviner delivered themselves up to calamity. Eyes bloodshot, he slapped his bag of holding to produce some spare paper talismans, and then slapped them down all over his body. He also pulled out some suits of armor, which he donned. Then he charged through the door!</p><br/><p>After Bai Xiaochun disappeared into the cabin, the green-skinned, long-fanged ghost face on the middle flag suddenly smiled!</p><br/>\n</div>"}