{"title": "Chapter 856: Singing From The Bone Galleon", "id": 856, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-856-singing-from-the-bone-galleon", "volume_title": "Volume 9", "body": "<h1>Chapter 856: Singing From The Bone Galleon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There were many stories and opinions about how the Heavenspan Realm’s Deadmire had been formed. No consensus had ever been reached, and it was entirely likely that only a handful of people in the entire world knew the truth about its origin.</p><br/><p>For one thing, it was an enigma as to why any living being that entered the area would die. Neither devas nor demigods who entered the Deadmire ever came back… that much was confirmed fact.</p><br/><p>Although there were people who had taken an interest in the Deadmire, and devised certain ways to study it, the only thing that they came to find out was that it was filled with a white sea.</p><br/><p>It was a sea composed, not of water, but… bones!</p><br/><p>From the peaks of the mountains that bordered the Deadmire itself, all one could see was vast, endless fog. Beneath the fog was an endless stretch of white bones that looked almost like a sea of water.</p><br/><p>There were human bones and beast bones, although in general, it was difficult to distinguish exactly what types of bones there were. Furthermore, the entire area was deathly quiet, and filled with a palpable rancor.</p><br/><p>No living beings existed. No sound existed.</p><br/><p>And the silence was terrifying.</p><br/><p>Many of the legends regarding the Deadmire involved some war of epic proportions that was fought even before the world came to exist. Supposedly, the battlefield upon which that war had been fought eventually came to be the sea of bones that was the Deadmire.</p><br/><p>There were actually four Deadmires in the world, and they were all the same….</p><br/><p>In the Deadmire that existed on the border between east and north, it was possible to see three figures. The first was Bai Xiaochun, who trembled in fear and anxiety as he walked across the bones. The crunching sounds that came with each step broke the silence, echoing out in bizarre and eerie fashion.</p><br/><p>Despite his confidence in the gravekeeper, Bai Xiaochun was still terrified, and gripped his command medallion until his hands were white. Following behind him were Song Que and Master God-Diviner, both of whom trembled in anxiety.</p><br/><p>Thankfully, as soon as they had stepped into the Deadmire itself, the command medallion had lit up like a candle, sending light out for dozens of meters in all directions, and pushing the fog away from them.</p><br/><p>That had eased their fear to some extent. As they walked along, the odd crunching of their footsteps echoed out constantly. Considering that they were new to this place, they didn’t dare to attempt flying, and moved along on foot, casting vigilant glances around them as they went.</p><br/><p>Because of the thick fog, it seemed to Bai Xiaochun and his companions that they were walking along through the dead of night, with their small, lit area making them very conspicuous….</p><br/><p>Bai Xiaochun’s face was ashen as he crunched along. Based on what he could tell so far, there really were no living things in the Deadmire.</p><br/><p>Three days passed. Although they weren’t flying, they still moved along quickly. By this point, Song Que seemed used to the crunching of the bones, and the stifling pressure of the fog and darkness. His expression was actually somewhat calm. Master God-Diviner also seemed to be doing well. Bai Xiaochun was the only one who was on full alert.</p><br/><p>Song Que couldn’t help but snort coldly in his heart at Bai Xiaochun’s anxiety. It also seemed to fuel his own bravery, and he began to stomp his feet down a bit louder. However, Bai Xiaochun was not pleased with that.</p><br/><p>Master God-Diviner also happened to feel that his actions were a bit extreme, and quickly said, “Keep it down, Song Que!”</p><br/><p>Song Que snorted, and was just about to offer a retort when, all of a sudden, the hyper-vigilant Bai Xiaochun blurted, “Did you guys hear that?!?!”</p><br/><p>Song Que stopped walking, as did Master God-Diviner. Everyone focused on listening, and although they couldn’t hear anything at first, it only took a moment for both of their faces to fall. Somewhere off in the fog… there was singing!?!?</p><br/><p>It sounded like a woman. However, she was apparently so far away that they couldn't quite make out what she was singing. Regardless, the mere presence of the singing caused Bai Xiaochun’s face to drain of blood.</p><br/><p>“No way. There’s no way that Gongsun Wan’er could have fled to this place, is there!?!?” However, as the singing continued, he realized that it didn’t actually sound like Gongsun Wan’er.</p><br/><p>Song Que and Master God-Diviner looked around nervously, trying to identify the direction the singing was coming from. After a moment, Master God-Diviner’s eyes widened, and he pointed in a certain direction.</p><br/><p>“There!”</p><br/><p>Bai Xiaochun and Song Que immediately turned to look in that direction, which was when they saw… countless corpses! These corpses were not just bones laying around among the other bones, they were walking upright. There were thousands upon thousands of them, bent at the waist, black ropes strung over their shoulders, making them look almost like boatmen pulling a huge galleon!!</p><br/><p>Behind the more than ten thousand human-sized corpses were more than a thousand corpses of giants! All of them had black ropes strung over their shoulders too, and were tugging them along!</p><br/><p>However, there was more! Behind the thousand giants were more than a hundred beast corpses, each one more than 3,000 meters tall! All of the beasts looked different. Shockingly, in the very back, there were three bone dragons!</p><br/><p>To the astonishment of all three cultivators, what next appeared before their eyes, right behind the three bone dragons… was a massive galleon, fully 30,000 meters in length, and crafted entirely of bone!!</p><br/><p>The galleon was pitch black, and in very bad condition, with tattered flags attached to dilapidated flagpoles. However, despite its condition, it still radiated a shocking energy!</p><br/><p>Strangely, despite the fact that the corpses were pulling the galleon across the surface of the sea of bones, no resulting sound could be heard. The entire Deadmire was still completely quiet… with the exception of the sound of singing coming from within the galleon itself!</p><br/><p>Bai Xiaochun was already trembling with intense fear, and had begun to back up.</p><br/><p>“Something's off here,” he said nervously, his face pale white. “What’s a warship like this doing in the Deadmire?! And what are all those corpses pulling it for? This is terrifying! Why don’t we go back. I think… maybe the Great Wall is a better idea after all!” However, even as he words left his mouth, the enormous galleon suddenly vanished….</p><br/><p>The corpses went with it, and even the singing was gone, as if it had never existed to begin with.</p><br/><p>Bai Xiaochun’s jaw dropped.</p><br/><p>Song Que and Master God-Diviner were also frightened. There was something very strange about it all. As for Song Que, when he looked over at Bai Xiaochun and saw how scared he was, his own fear vanished. Snorting derisively, he said, “The Deadmire is supposed to be strange. What’s so scary about some boat?! It was just an illusion, that’s all. Just ignore it and it goes away. What, Bai Xiaochun, are you scared or something?”</p><br/><p>When Bai Xiaochun heard that, he glared back.</p><br/><p>“Me? Scared of ghosts?” He swished his sleeve. “I'm virtually a heavenly necromancer, and the most important ghost in the world is my apprentice. Why would I be afraid of ghosts? Are you kidding me!?”</p><br/><p>Song Que chuckled coldly, but didn’t say anything else. Grabbing Master God-Diviner, he continued on the way they had originally been heading. Master God-Diviner looked back and forth between Song Que and Bai Xiaochun, but did nothing more than smile wryly and follow Song Que.</p><br/><p>“Maybe it really was an illusion….” Bai Xiaochun thought, feeling a bit embarrassed. How could he have ever guessed that a galleon like that would appear so randomly, and then just vanish? Rubbing his nose, he reminded himself that he outranked Song Que, and therefore, needed to watch out for him. Sighing, he hurried along after the other two so that they would remain in the protective perimeter created by his command medallion.</p><br/><p>An entire month flew by, during which time the strange galleon never appeared again. Gradually, Bai Xiaochun was starting to calm down. At the same time, the group began to pick up speed.</p><br/><p>However, only a few days after that, their faces all fell when they yet again heard the sound of a woman singing!</p><br/><p>This time, the song was much clearer. In fact… they could hear the lyrics clearly!</p><br/><p>It was a strange song, the type that could not be forgotten once heard. It told the story of a mother whose arm was eaten by her own child!</p><br/>\n</div>"}