{"title": "Chapter 853: You Absolutely, Positively Must Not Crush That!!!", "id": 853, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-853-you-absolutely-positively-must-not-crush-that", "volume_title": "Volume 9", "body": "<h1>Chapter 853: You Absolutely, Positively Must Not Crush That!!!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>No amount of explanation on the part of Bai Xiaochun could resolve the situation. Mistress Red-Dust refused to believe anything he said. As she attacked and he evaded, they got closer and closer to the distant mountains.</p><br/><p>Song Que watched them go, his heart quivering in both fear and excitement. To see Bai Xiaochun in a predicament like this significantly reduced some of the frustration and humiliation that had been festering there.</p><br/><p>Although he was interested in getting closer to see what exactly was happening, Mistress Red-Dust was on a rampage, and she was a deva. Song Que knew that his own cultivation base wasn’t high enough to get close safely, therefore, after a moment of hesitation, he decided to stay put. Before long, Bai Xiaochun and Mistress Red-Dust vanished into the mountains.</p><br/><p>That particular stretch of mountains was covered with a lush jungle. Currently, booms rang out in the jungle, as well as flashes of bright red light, as Bai Xiaochun fled pell-mell.</p><br/><p>Each and every beam of red light that Mistress Red-Dust launched was powerful enough to severely injure an ordinary cultivator in the great circle of the Nascent Soul stage. But Bai Xiaochun had immense fleshly body power. Therefore, the attacks that hit him didn’t do very much other than destroy portions of his clothes. Before long, he was looking very bedraggled.</p><br/><p>“Don’t be like this, Zimo….” he cried anxiously. Seeing that nothing she did was having any effect, she snorted coldly and then spat out some more magical blood, summoning a host of spears that she sent flying in his direction.</p><br/><p>As the spears flew through the air, they interlocked, creating something like a net of blood. Shocked, Bai Xiaochun fled at top speed; the danger had suppressed the guilt that he felt, and his anger was starting to burn. It was at this point that Mistress Red-Dust performed a double-handed incantation gesture, causing the numerous blood spears to accelerate rapidly toward him.</p><br/><p>Enraged, Bai Xiaochun unleashed a fist strike with his right hand, causing a tempest to spring out and destroy more than half of the spears. However, a portion made it through and slammed into him.</p><br/><p>Shaking physically, he fell back several paces. Although he wasn't seriously injured, his clothing couldn’t stand up to the force, and was mostly destroyed. Some of the blood spears even stabbed into his bag of holding!</p><br/><p>A boom could be heard as his bag of holding was torn open, allowing countless objects to spill out from inside.</p><br/><p>There was multi-colored flame, countless soulhoarding pagodas, and boxes of soul medicine, plus a variety of medicinal pill bottles, pill furnaces, medicinal pills, command medallions, and hosts of other magical items. All in all, there were tens of thousands of items.</p><br/><p>“This is ridiculous, Zhou Zimo!” Waving his sleeve angrily, he began to pull back all the items that had fallen out of his bag of holding.</p><br/><p>Mistress Red-Dust seemed to be on the verge of running out of breath. She knew that she had gone a bit too far, but was too thin-skinned. But to hear Bai Xiaochun insult her the way he had, and the thought of all the bitterness of her recent days, made it impossible for her to calm down.</p><br/><p>“Is all that crappy stuff important to you?” Snorting coldly, she waved her sleeve at some of the miscellaneous items that he hadn’t collected up yet. Instantly, some of the weaker medicinal pills exploded.</p><br/><p>“My medicinal pills!!” he shouted angrily, gritting his teeth. “Y-y-you…!”</p><br/><p>Seeing him reacting in this way was exactly what Mistress Red-Dust wanted. Without paying much attention, she reached out and grabbed a random pink medicinal pill. Considering she had no skill in the Dao of medicine, she had no idea what kind of pill it was.</p><br/><p>However, Bai Xiaochun recognized it immediately, and it caused his eyes to go wide. Gasping, and having no time to worry about the medicinal pills which had just been destroyed, he immediately shouted out, his voice rising a few octaves past normal.</p><br/><p>“Zimo! You need to be very, <em>very</em> careful! Do not crush that pill! If you do, something really bad could happen!!” Tears threatened to leak out of Bai Xiaochun’s eyes. After all, the pill that Mistress Red-Dust had picked up was none other than… an Aphrodisiac Pill!!</p><br/><p>Bai Xiaochun had drawn deeply on his stockpile of Aphrodisiac Pill during his time in the Wildlands, and didn’t have very many left. And yet, somehow, Mistress Red-Dust had managed to grab one of them.</p><br/><p>It was a very weak pill… the slightest pressure would cause it to explode, sending a pink mist out that would affect anything it touched. It was a fact Bai Xiaochun was very well aware of. Based on his experiences in the prisons of the Wildlands, he knew that virtually no one could resist that power. Instantly, his heart began to pound.</p><br/><p>Mistress Red-Dust was taken aback by his reaction, and his words. Looking down, she saw what appeared to be nothing more than an ordinary medicinal pill.</p><br/><p>The moment Mistress Red-Dust looked down, Bai Xiaochun anxiously opened his third eye. When the power of his Heavenspan Dharma Eye erupted out, he immediately used it to wrest control of Mistress Red-Dust’s movements.</p><br/><p>Without the slightest hesitation, he shot forward, using all of the power of his cultivation base and fleshly body. In the blink of an eye, he was right in front of Mistress Red-Dust, reaching out to grab the Aphrodisiac Pill.</p><br/><p>However, a gleam passed through Mistress Red-Dust’s eyes as she slipped out of the control of his Heavenspan Dharma Eye!</p><br/><p>Seeing that Bai Xiaochun was trying to grab the pill, Mistress Red-Dust immediately began to draw her hand back. However, it was in that moment that their two hands collided.</p><br/><p>“No!!” Bai Xiaochun screamed. He had been too late to retract his own hand, and when he saw it slam into Mistress Red-Dust’s, his eyes went wide, and his mind began to spin. As for the Aphrodisiac Pill… it burst open….</p><br/><p>“I'm finished. Kaput….” he wailed inwardly as he lurched backward. However, no matter how fast he moved, he couldn’t avoid the pink mist which spread out to envelop both he and Mistress Red-Dust.</p><br/><p>Bitterness filled his heart, but no amount of screaming could do anything about what was happening. In fact, a moment later, he began to pant…. As for Mistress Red-Dust, her face fell; she wasn’t sure what medicinal pill she had been holding, and did everything she could to avoid breathing in the pink mist. However, there was some strange property to the mist that allowed it to be absorbed through the skin. Almost immediately, a flush covered her face.</p><br/><p>She began to pant, and her eyes opened wide, revealing an expression of terror as she suddenly thought back to the things Bai Xiaochun had done at the Great Wall.</p><br/><p>“What pill was that!?!?” she shrieked, immediately backing away. However, as she moved, she began to tremble; she had been at the epicenter of the pill explosion, and the mist had instantly been absorbed through the palm of her hand.</p><br/><p>She suddenly staggered in place as the mist continued to spread out, enveloping her, causing her mind to spin. At the same time, an uncontrollable heat rose up within her….</p><br/><p>Bai Xiaochun was also in the mist, breathing heavily, struggling against its effects. His bag of holding did not contain an antidote to the Aphrodisiac Pill, but he did have some broad-spectrum neutralization pills. Unfortunately, his bag of holding had exploded, and he hadn’t had the time to gather everything back…. Flying toward the edge of the mist, he began to search frantically for the specific medicinal pills.</p><br/><p>Unfortunately, the Aphrodisiac Pill was simply too powerful. A wave of dizziness hit him, along with a powerful heat inside his body. He was halfway out of the mist by now, and could see a neutralization pill over in the nearby bushes. However, that was when a hand reached out and grabbed his tattered clothing. Moments before, that hand had been as white as jade, but now it was flush from heat. Even as Bai Xiaochun screamed… the hand dragged him back into the mist.</p><br/><p>“No! Aaaiiiieee! Don’t rip my clothes off…. This… this is my first time!!</p><br/><p>“Be more gentle! Aiieee… it hurts….” </p><br/><p>Hair-raising screams escaped Bai Xiaochun’s lips, as though he were experiencing the most dangerous of crises….</p><br/>\n</div>"}