{"title": "Chapter 866: Its Bai Xiaochun!", "id": 866, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-866-its-bai-xiaochun", "volume_title": "Volume 9", "body": "<h1>Chapter 866: Its Bai Xiaochun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Virtually the entire Middle Reaches began to shake because of the voice. Countless embattled cultivators felt their minds reeling. Before anyone could react, Bruiser suddenly shivered, then threw his head back and let out a howl of joy.</p><br/><p>Song Junwan’s jaw dropped, and the despair of death that had existed in her eyes was replaced by incredulity. She suddenly turned to look at the horizon, where an airship was speeding through the air, with a person just barely visible on the deck!</p><br/><p>Of course, a battlefield with tens upon tens of thousands of combatants would obviously be filled with shocking levels of noise. Therefore, Bai Xiaochun’s voice was like a rock dropped into a lake, which only sent a few ripples out. The enemy forces didn’t take it very seriously.</p><br/><p>In fact, a group of several hundred cultivators from the three sects spun and then began to fly toward Bai Xiaochun to block his path. Two in that group were Nascent Soul cultivators, who closed in on him from two different directions.</p><br/><p>Even Song Junwan, after her initial excitement, came to the conclusion that Bai Xiaochun wouldn’t make much of a difference in the fight. Furthermore, the five Nascent Soul cultivators who had been closing in, after their initial pause, snorted coldly and pressed the attack. Two of them focused on Master Limitless, and three on Song Junwan!</p><br/><p>Because she wielded Middle Peak’s blood sword, Song Junwan was able to fight back against Nascent Soul experts. Furthermore, she led a group of Middle Peak disciples who were adept at sword formations that could inflict injuries on anyone under the Nascent Soul stage.</p><br/><p>They were a formidable force that the enemy disciples knew they had to completely crush before they could proceed onward into the sect headquarters.</p><br/><p>The three Nascent Soul experts who were targeting Song Junwan closed in with immense speed. Even at peak condition, the Middle Peak disciples that Song Junwan commanded wouldn’t be able to stop them. Therefore, they could only watch helplessly as Song Junwan… was put in imminent life-or-death danger!</p><br/><p>No one was capable of turning the situation around….</p><br/><p>When Bai Xiaochun saw what was happening, and realized what critical danger the River-Defying Sect was in, he was gripped with uncontrollable madness. Eyes crimson, he pushed the airship forward with such speed that it began to burn up. Then, he slammed into the group of hundreds of disciples who were besieging Song Junwan.</p><br/><p>Rumbling booms echoed out. Of those hundreds of disciples, none could even get close to Bai Xiaochun. In fact, because of the intense flames which surrounded the airship, the entire group was instantly transformed into ash, killed in body and soul!</p><br/><p>The airship shot through the sky like a deadly sword, crushing anything in its path as it descended toward the ground.</p><br/><p>No one could block it, or even get close to it. Any who tried to were wiped out of existence! And then… he arrived right in the middle of the battlefield, next to the Blood Stream Division and Song Junwan!</p><br/><p>He moved so quickly that he arrived just when the three Nascent Soul experts were bearing down on Song Junwan. Before they could actually unleash their attacks, an ear-piercing sound assaulted their ears. Two of them were in the early Nascent Soul stage, and one in the mid stage. They only had time to turn their heads, whereupon they saw nothing but the image of an enormous, burning airship.</p><br/><p>The airship didn’t slow down at all. It slammed into the three Nascent Soul experts, a destructive force that didn't even allow them to cry out in pain. They were engulfed by flame and force, and transformed into nothing more than ash!</p><br/><p>The two cultivators who had been focusing on Master Limitless coughed up blood. Expressions of disbelief appeared on their faces, and their eyes nearly bulged out of their skulls as they began to fall back.</p><br/><p>Bai Xiaochun strode out from the flaming wreckage of the airship to appear in front of Song Junwan. Wrapping his arm around her waist, he waved his hand, isolating nearly a thousand streams of destructive power that had been unleashed by the destroyed airship. Then he sent those streams of destruction smashing into anyone in the area who wasn't a member of the River-Defying Sect.</p><br/><p>Not even the two Nascent Soul cultivators could escape, and were enveloped by pure death.</p><br/><p>Miserable screams erupted onto the battlefield as thousands of cultivators were engulfed by flames, and then burned down to ash!</p><br/><p>Although all of this takes a bit of time to describe, it happened in the briefest of moments. It took only the blink of an eye for Bai Xiaochun to kill five Nascent Soul experts, and thousands of other cultivators.</p><br/><p>It happened so quickly that nobody could even react. Shock immediately began to spread across the battlefield, and countless gazes shifted to focus on Bai Xiaochun.</p><br/><p>After an initial hush, the cultivators from the three sects began to gasp and cry aloud.</p><br/><p>“Heavens!! What just happened!?”</p><br/><p>“Dammit, who is that?!?!”</p><br/><p>“He looks familiar….”</p><br/><p>As the enemy cultivators reacted in shock, the River-Defying Sect disciples began to cry out loud in excitement.</p><br/><p>“Bai Xiaochun! It’s Bai Xiaochun!!”</p><br/><p>“Sect Uncle Bai! It's Sect Uncle Bai!!”</p><br/><p>“Bai Xiaochun!!”</p><br/><p>Before long, everyone was crying Bai Xiaochun’s name. Shangguan Tianyou, Beihan Lie, Patriarch Spirit Stream, Patriarch Blood Stream, the monkey, the rabbit, and countless other people were shaken to the core.</p><br/><p>Powerful experts who had once been chosen in the three sects were now pillars of their respective organizations. Hatred existed in their eyes, for on their faces and other body parts… existed the mark of a turtle!</p><br/><p>The three deva patriarchs all wore frowns, but at the moment, didn’t have time to deal with Bai Xiaochun. Although they were shocked by his sudden appearance on the battlefield, and his unusual battle prowess, they were still confident… that he was only in the great circle of the Nascent Soul stage.</p><br/><p>“Ignore him. Once we destroy the foundation of the River-Defying Sect, then we can kill him!” Having made their mutual decision, the three devas looked away from Bai Xiaochun and continued on with their original plan.</p><br/><p>Patriarch Starry River was the one using the sky-obfuscating hand to unleash crushing power onto Patriarch Spirit Stream, the monkey, the rabbit, and the Blood Ancestor.</p><br/><p>Patriarch Dao River bristled with sword qi, and his eyes glittered with greed as he eyed Bruiser!</p><br/><p>Then there was Patriarch Polarity River, beneath whose feet roiled a black cloud. Under his destructive attacks, the main entrance to the River-Defying Sect was already on the verge of being reduced to ruins!</p><br/><p>Those three devas had already surpassed the will of the heavens, causing the sky to vibrate and the clouds to churn.</p><br/><p>Song Junwan was deeply shaken as she looked up at Bai Xiaochun, her mouth hanging open, but no words coming out. She felt like she was dreaming.</p><br/><p>There were a million things Bai Xiaochun wanted to say to her, but currently, it was a moment of grave crisis for the sect, and there was no time. Waving his hand, he summoned a shimmering shield to surround her, something that not even a deva would be able to break through. Then, he looked over at the three devas who were unleashing unbridled destructive power onto the River-Defying Sect. He knew that they were the key to everything. If he could crush them, the tide of battle would be turned!</p><br/><p>“They’re only in the early Deva Realm. How dare they behave rudely in front of me!” Bai Xiaochun’s eyes were completely bloodshot, especially when he saw all of the streams of sword qi surrounding Patriarch Dao River, and how he was trying so hard to cut down Bruiser. Bai Xiaochun opened his Heavenspan Dharma Eye, sending violet light spilling out. Then, he blurred into motion, moving faster than lightning in the direction of the sect headquarters itself.</p><br/>\n</div>"}