{"title": "Chapter 863: Give It Back", "id": 863, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-863-give-it-back", "volume_title": "Volume 9", "body": "<h1>Chapter 863: Give It Back</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As the River-Defying Sect was being besieged by the three great sects of the Middle Reaches… Bai Xiaochun, Song Que and Master God-Diviner were making their way through the Deadmire, completely unaware of the war. Because of the lingering terror they felt about of the ghost galleon, they flew along as quickly as startled sparrows.</p><br/><p>Their journey was almost over; only a few more hours, and they would be free of the Deadmire. There were so few bones down below that they were already able to see patches of dark soil.</p><br/><p>Bai Xiaochun couldn’t have been more excited. And as for Song Que and Master God-Diviner, the way they had temporarily lost their minds still had them trembling in fear.</p><br/><p>However, as they flew along, Bai Xiaochun’s face suddenly fell as… he yet again heard that singing echoing in the fog behind them!</p><br/><p>The strange sound of it caused everyone’s hair to stand on end. Song Que and Master God-Diviner nearly choked from fear.</p><br/><p>“Dammit, what is the ghost galleon doing back!?” Scalp tingling with fear, Bai Xiaochun grabbed Song Que and Master God-Diviner and pushed forward at top speed.</p><br/><p>This time, they only caught a glimpse of the galleon about 3,000 meters behind them. However, it was still a terrifying moment.</p><br/><p>The first time the ghost galleon had appeared to them, it disappeared 3,000 meters away. The fourth time, it teleported them on board. The fact that it had appeared again at 3,000 meters away was something they didn’t really want to think about. Furthermore, they had to wonder if they might see the galleon again in the following few hours.</p><br/><p>It was a lot of pressure, so much that none of them felt like talking. Expression grave, Bai Xiaochun put all the energy he could into flying along. After the time it takes an incense stick to burn, though, the singing once again reached their ears.</p><br/><p>“What's going on!? Why is it back so soon!?!?” Looking over his shoulder in terror, he saw that the galleon was now 500 meters away. Then it vanished.</p><br/><p>Looking at the galleon this time, he realized that there was no way the massive thing only had two decks. At the very least, it probably had five. As for what would happen if they got teleported on board again, not even the gravekeeper’s command medallion left him feeling very confident.</p><br/><p>There was little need to mention Song Que and Master God-Diviner, whose hearts were pounding with anxiety.</p><br/><p>“Hold on a second,” Bai Xiaochun muttered, “something is off here!” Unfortunately, there was no time to ponder the situation. Heart as taught as a bowstring, he continued to flee, feeling more under pressure than ever. Song Que and Master God-Diviner were actually more nervous than Bai Xiaochun.</p><br/><p>After enough time passed for half an incense stick to burn, the galleon appeared again. And this time it was only 300 meters away!!</p><br/><p>The corpses pulling the galleon led it directly toward Bai Xiaochun, and this time, it didn’t seem at all like the galleon was going to fade away. In fact, as it barreled toward them, the three flags on the cabin flapped, and the green-skinned, long-fanged ghost face suddenly began to laugh noiselessly.</p><br/><p>Despair filled Bai Xiaochun’s eyes, and yet, that was when he happened to look at the cabin door. When he did, his eyes went wide, and an idea popped into his head. Considering the danger they were in, he didn’t hesitate to follow through on the idea. Turning to Master God-Diviner, he shouted, “Master God-Diviner, give back that eight trigrams mirror you took!!”</p><br/><p>As soon as Song Que heard Bai Xiaochun’s words, he thought back to how Master God-Diviner had taken the mirror, and immediately yelled similar words.</p><br/><p>There was no time for Master God-Diviner to even worry about how much it pained him. He quickly pulled the eight trigrams mirror out of his bag of holding and hurled it at the huge galleon with all the force he could muster.</p><br/><p>The mirror became a beam of light that shot directly toward the galleon and, in a very strange coincidence, perhaps because of some unknown power, landed in the exact spot where it had been taken from!</p><br/><p>When that happened, the three wildly flapping flags all suddenly drooped down motionless, and the green-skinned, long-fanged face on the middle flag let out a noiseless howl of defiance.</p><br/><p>At the same time, the countless corpses and the ghost galleon itself all faded away into the fog.</p><br/><p>Bai Xiaochun, Song Que and Master God-Diviner all looked back jumpily to confirm that the galleon was finally gone, whereupon they breathed sighs of relief. Then, Song Que spun and angrily grabbed Master God-Diviner.</p><br/><p>“You nearly got us killed!!” he shouted.</p><br/><p>“What are you yelling for!” Master God-Diviner shot back, his voice quavering a bit. “It’s not like I did it on purpose…. Who knew that ghost galleon would be so stingy? It took my copper coin, so I took the mirror in exchange, that’s all….” As he spoke, his voice became quieter and quieter until it faded away.</p><br/><p>Bai Xiaochun wiped the sweat from his brow. It had been a very dangerous close call, and if he hadn’t thought to remind Master God-Diviner about the mirror, then all three of them would likely have been dragged on board the galleon, never to return.</p><br/><p>Glancing at the angry Song Que and the dispirited Master God-Diviner, he said, “Alright, enough is enough. Let’s worry about it after we’re out of this place!”</p><br/><p>Then he blurred into motion. Song Que gave Master God-Diviner another good glare, then let him go and followed. As for Master God-Diviner, he rubbed his nose in embarrassment and joined them.</p><br/><p>The galleon never returned. An hour later, not a single bone could be seen beneath their feet. They shot out of the mountains, and were in another world. All of them felt as if a big weight had just been lifted from their shoulders.</p><br/><p>As of this moment, they knew… that they were out of the Deadmire!</p><br/><p>“Finally free!” Master God-Diviner whooped. Song Que took a long, deep breath of fresh air. As for Bai Xiaochun, he looked around at the lush vegetation and smiled. There were no vicious plants or terrifying creatures like back in the Wildlands. It almost looked like a celestial paradise, complete with singing birds and blooming flowers.</p><br/><p>Off in the distance, a charming, deer-like animal suddenly looked up at the three of them, and then sprang off into the trees.</p><br/><p>Bai Xiaochun was very pleased with what he could see. Furthermore, there was something here that was very different from the Wildlands…. Spiritual power from the Heavenspan Sea!!</p><br/><p>Although it was faint, it was indescribably stronger than in the Wildlands. He took a deep breath, and cracking sounds filled him as his energy-starved body was repaired.</p><br/><p>“Ah, spiritual energy. It’s been a long time since I could absorb it so freely.” He had been in the Wildlands for so many years that he had almost forgotten what the Heavenspan River region looked like. Even here in the delta region, it was still a wonderful place.</p><br/><p>Master God-Diviner and Song Que both shivered at the sensation of spiritual energy, and complicated emotions could be seen in their eyes.</p><br/><p>“We’re back!” Song Que said.</p><br/><p>“River-Defying Sect, here we come!!” Master God-Diviner said loudly.</p><br/><p>Laughing heartily, Bai Xiaochun waved his hand, sending a flying airship out into the open. It was something he had acquired long ago in the River-Defying Sect, but which didn't work in the Wildlands because of the lack of spiritual energy. “Hahaha! Que’er, Master Snortsnort, my genius has done it again. I'm going… to take you home!”</p><br/><p>Now that the ship had access to spiritual energy, it began to shine with brilliant light. Bai Xiaochun leaped up and took the helm. In rare fashion, Song Que didn’t bristle at all because Bai Xiaochun had called him Que’er. He was simply too excited to get back to the River-Defying Sect, and shot like an arrow onto the airship.</p><br/><p>Master God-Diviner reacted similarly. Moments later, Bai Xiaochun sent his near-deva-level cultivation base power into the ship, and it sped through the air until it was over the horizon!</p><br/>\n</div>"}