{"title": "Chapter 888: Think You Can Leave?", "id": 888, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-888-think-you-can-leave", "volume_title": "Volume 9", "body": "<h1>Chapter 888: Think You Can Leave?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The beam of light that had been Bai Xiaochun’s face moved with indescribable speed, more quickly than anything the disciples of the River-Defying Sect had ever seen!</p><br/><p>Chen Hetian, Li Xiandao and Bai Zhentian were all shocked to the core! Not even they had ever seen anything like it!!</p><br/><p>The bright beam of light shot down and stabbed through Patriarch Dao River’s nascent divinity before he could even react…. He shivered, and his eyes went wide with disbelief as he looked down at his own chest.</p><br/><p>As he did, a huge boom rang out, and his nascent divinity form exploded into absolutely nothing!!</p><br/><p>He had been killed in the blink of an eye!!</p><br/><p>The entire battlefield went deathly silent. The River-Defying Sect, Chen Hetian and the devas, and everyone else was looking at the spot where Patriarch Dao River had been killed. Waves of shock filled everyone present…. It was at this point that everyone realized that, right behind where Patriarch Dao River had previously existed… a person was materializing!</p><br/><p>He had long hair and fair skin, and wore a simple robe. He seemed noble and magnificent, and yet, his eyes were as sharp as the sharpest of swords. He was none other than… Bai Xiaochun!</p><br/><p>“Impossible!!” Chen Hetian gasped.</p><br/><p>Bai Zhentian and Li Xiandao felt as though their minds were being struck by lightning, and their faces fell dramatically in the face of the power on display by Bai Xiaochun!</p><br/><p>“This…” Bai Zhengtian gasped. “Even if Dao River was only in nascent divinity form, he should have been able to evade that blow. Such speed… how is it even possible!?!?”</p><br/><p>“He wasn’t a deva before,” Li Xiandao murmured, “but he most certainly is now!!”</p><br/><p>The fact that Bai Xiaochun had previously not been a deva meant… that it was as a half-deva that he had injured one deva patriarch, crippled another, and killed the last! It was simply terrifying!</p><br/><p>The horrifying significance of it all left Chen Hetian, Li Xiandao and Bai Zhentian completely aghast!</p><br/><p>Patriarch Starry River was shaking violently; his shock surpassed that of Chen Hetian and the others. After all, this was his second time seeing Bai Xiaochun kill a deva!</p><br/><p>In fact, this time, it went even more smoothly than last time. The mere thought of what he had just seen struck him deeply with fear, and caused him to flee as quickly as possible. The last scrap of courage he had possessed was now gone, and if he had his way, he would never again do anything to provoke Bai Xiaochun.</p><br/><p>Even as everyone present reeled in shock, Bai Xiaochun reached out and made a grasping motion in the direction of where Patriarch Dao River had been killed.</p><br/><p>As he did, it was to the utter amazement of all onlookers that a soul shadow appeared. It had a blank look in its eyes, and clearly resembled Patriarch Dao River.</p><br/><p>As it appeared, it began to float up, as if it were about to merge into some unseen vortex. After all, when souls died in the lands of Heavenspan, they would be taken away into the cycle of reincarnation.</p><br/><p>However, before the soul of Patriarch Dao River could float up into the heavens, Bai Xiaochun grabbed it!</p><br/><p>Although no one else present was capable of seeing it, Bai Xiaochun could see that there really was a vortex up above. And in the moment that he reached out to grab the patriarch’s soul, the vortex vanished, as though it had no intention of interfering with his attempt to grab the deva soul!</p><br/><p>As soon as he had it in his hand… he closed his fingers down, causing a yellow crystal to appear!</p><br/><p>Sealed within that crystal was none other than… an earth-type deva soul!</p><br/><p>The cultivators of the River-Defying Sect were both shaken and excited. Patriarch Spirit Stream was bubbling over with joy, and Patriarch Blood Stream’s eyes shone with unprecedented madness.</p><br/><p>“Patriarch Bai!!”</p><br/><p>“Patriarch Bai!!!” The cries of joy which rang out from the River-Defying Sect seemed loud enough to fill all of the eastern Middle Reaches.</p><br/><p>Bruiser howled in delight at how incredibly powerful Bai Xiaochun had become.</p><br/><p>Patriarch Spirit Stream and Patriarch Blood Stream, the patriarchs from the other two divisions, Li Qinghou, and Zheng Yuandong were all beside themselves with joy.</p><br/><p>“The River-Defying Sect finally has a deva!!” All of the powerful experts in the sect were virtually jumping with delight. Although they had been shocked by Bai Xiaochun’s previous level of power, back then, he hadn’t been a deva. Although most people in the sect hadn’t been aware of that fact, Patriarch Spirit Stream had.</p><br/><p>He hadn’t been a deva, but possessed the battle prowess of one. And yet, the leadership of the sect still hadn’t been able to rest easy…. But now, powerful fluctuations filled heaven and earth as Bai Xiaochun’s will surpassed the will of the heavens. Because of that, Patriarch Spirit Stream and the others knew… that Bai Xiaochun was now a deva!!</p><br/><p>The River-Defying Sect cultivators were beside themselves. As for Chen Hetian, Li Xiandao and Bai Zhentian, as well as Patriarch Starry River, the fact that Bai Xiaochun had just harvested a deva soul filled them with such profound shock that their minds went blank.</p><br/><p>“Impossible!!” Chen Hetian breathed. Bai Zhentian and Li Xiandao gasped in astonishment. All three of the devas were filled with fright and terror that defied description.</p><br/><p>What Bai Xiaochun had just done struck them to the deepest level. After all, the only type of person who qualified to both kill a deva and then prevent that person’s soul from entering the cycle of reincarnation was a demigod!</p><br/><p>Neither Chen Hetian, Li Xiandao nor Bai Zhentian could accomplish such a thing. And yet, Bai Xiaochun had done it right in front of them!</p><br/><p>It was almost impossible to describe the levels of shock and fear they felt as a result!</p><br/><p>Astonishingly, Bai Xiaochun seemed to possess energy that could force heaven and earth to capitulate to his desires!</p><br/><p>The truth was that, to most other devas, it would be completely impossible for them to prevent a deva soul from entering the reincarnation cycle of heaven and earth. But to Bai Xiaochun, it took almost no effort. After all… the cycle of reincarnation was part of the Underworld River, and his apprentice was the reigning Hell-Emperor. If he wanted a deva soul… how could the Underworld River possibly vie with him for it?</p><br/><p>Although no one was able to tell, not even Chen Hetian and the other devas, from the way that Bai Xiaochun had attacked and killed Patriarch Dao River, it was clear that he was a rare… Heaven-Dao deva!</p><br/><p>Furthermore, he had broken through using heavenly multicolored flame to perform a twenty-onefold spirit enhancement on his nascent soul!</p><br/><p>Because of that, all early Deva Realm cultivators were beyond weak when compared to him. Even mid Deva Realm experts could be put in their place by him!</p><br/><p>Perhaps he couldn’t be considered the most powerful among all devas, but he was on that path. Throughout all the years which had passed, the only other person to become a Heaven-Dao deva was Daoist Heavenspan, who was also known as the Celestial!</p><br/><p>Now, Bai Xiaochun was the second!</p><br/><p>However, Bai Xiaochun had done something that the Celestial had not. He had performed a twenty-onefold spirit enhancement on his nascent soul using the peak level of flame that could exist in the world. That made Bai Xiaochun the ultimate type of deva!</p><br/><p>He was the only person in all of history to do such a thing!</p><br/><p>Some of it was coincidence, and some of it was because of Bai Xiaochun’s hard work. All of it came together into something beyond belief! In fact, it had been somewhat of a gamble on his part. He hadn’t been completely confident that a twenty-one-colored flame would make him a deva!</p><br/><p>After sensing Bai Xiaochun’s energy, Chen Hetian, Li Xiandao and Bai Zhentian exchanged glances and then retreated en masse, leaving Patriarch Starry River conspicuously out in the open.</p><br/><p>Terrified, Patriarch Starry River made to retreat, simultaneously rejoicing that Bai Xiaochun had chosen to strike down Patriarch Dao River and not himself.</p><br/><p>However, even as the four devas began to back away, Bai Xiaochun turned his head, and his eyes flashed like lightning.</p><br/><p>“You trespassed on the River-Defying Sect… do you really think you can leave without offering compensation?” The coldness and rage in his voice couldn’t have been more apparent. The River-Defying Sect had just been in the deadliest of crises, and everyone knew that if he hadn’t become a deva, the results would have been unimaginable.</p><br/>\n</div>"}