{"title": "Chapter 896: Undying Blood!", "id": 896, "volume": 9, "url": "http://boxnovel.org/a-will-eternal-chapter-896-undying-blood", "volume_title": "Volume 9", "body": "<h1>Chapter 896: Undying Blood!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>No one but Bai Xiaochun could hear the thunderous rumbling sound that filled him. It surpassed heavenly thunder as it echoed through his body, causing him to shake where he sat, blue veins bulging out on his neck and face.</p><br/><p>It really did feel to him like there was a huge mountain pressing down on him. Drawing upon his incredible fleshly body power, he pushed back against that mountain in an attempt to break it.</p><br/><p>The power of qi and blood surged inside of him, and as the rumbling sounds grew more intense, he shouted, “Break!!”</p><br/><p>At that point, the invisible mountain that was the fourth shackle of the human body shattered. All of a sudden, he felt lighter and freer, like a wild stallion who had been unharnessed and let run free.</p><br/><p>There were no bounds or restrictions in place anymore, allowing his qi and blood to flow strong and hard. His meditation chamber began to tremble, and beyond it, the River-Defying Sect as a whole.</p><br/><p>The power of his Undying Bones could be no higher. It surged through him like flood waters, pushing at him, screaming, until he realized that…</p><br/><p>He was about to break past the Undying Bones level!!</p><br/><p>He had truly reached the peak!</p><br/><p>As the saying goes, <em>when one is focused and works hard, good fortune is sure to follow</em>. At this point, the mnemonic for the Undying Blood suddenly appeared, as though it had been branded in his soul and waiting for this moment.</p><br/><p>As he went to work with the mnemonic, the remaining power of the Celestial’s blood-hair sprang into motion. A tremor passed through him, and he withered visibly, growing incredibly gaunt within only a few breaths of time.</p><br/><p>If he hadn’t been prepared for this very outcome, it would have been a big fright.</p><br/><p>“It’s gonna wither me to death!!” He immediately ceased the operation of the Undying Blood. Thankfully, there was nothing about the technique that made that impossible. Even the short moment that had passed left his face ashen, his vision dim, and his ears ringing.</p><br/><p>After a long moment passed, he recovered. However, his face was still pale, and his heart still twitched with lingering fear. After examining himself inside and out, he almost cried.</p><br/><p>“My life force….” His previously thriving life force had been drained by more than half in that brief few breaths of time.</p><br/><p>“It wasn’t this exaggerated before! This… this is even more frightening than Mistress Red-Dust and Song Junwan combined!” Scowling, he contemplated simply giving up on cultivating the Undying Blood.</p><br/><p>He was truly worried that he would accidentally kill himself before mastering it….</p><br/><p>“Don’t tell me I'm going to have to go through another whole situation of using the Eternal Parasol…?” He smacked his forehead in irritation.</p><br/><p>“This Undying Codex is the worst technique ever. Seems to me the point is to turn good people into villains!” Depressed, he thought back to how he had once been a pure and naïve youngster, only to start cultivating the Undying Skin, and turn into the Chicken-Thieving Fiend….</p><br/><p>And then there was his time in the Blood Stream Sect, when he snuck around other people’s immortal's caves, stealing qi and blood for the Undying Heavenly King….</p><br/><p>After that came the Undying Tendons, where he had used pill concocting at the Great Wall as a front to embezzle everything he needed….</p><br/><p>And finally, out in the Wildlands, he had become a vicious hunter of life force to finish the Undying Bones….</p><br/><p>“Is it all worth it? I'm a good person, after all! Maybe mastering the Undying Bones is good enough. It’s pretty awesome on its own….” Sighing, he once again began to review the mnemonic for the Undying Blood.</p><br/><p>The Undying Blood was the final level of the Undying Codex, and was the last step to mastering the full technique!</p><br/><p>The Undying Skin provided incredible defensive powers. The Undying Flesh increased fleshly body power to shocking levels. The Undying Tendons provided explosive speed and power, although that was really only the first step. The Undying Bones was the second in that same vein!</p><br/><p>The effects of that second leap upward were even more obvious. After he had mastered the Undying Bones, his defenses, his speed, his strength, and everything else had reached the peak!</p><br/><p>At that time, he had possessed deva-level fleshly body power, to the point where, combined with his cultivation base, it would have been very difficult for a deva to catch him if he wanted to flee.</p><br/><p>However, at that point, his Undying Codex had not been without flaws, nor had he been unkillable. After all, despite the shocking level of power he commanded, he could be easily drained. Calling upon just his Undying Emperor’s Fist would leave him almost powerless.</p><br/><p>Although he had been tough, and difficult to wound, he still required recovery time if he did get injured. Furthermore, most injuries that affected him would be extremely serious.</p><br/><p>But… now that he could cultivate the Undying Blood, those weaknesses were disappearing.</p><br/><p>Cultivating the Undying Blood was a process in which all of the blood in one’s body was replaced, one drop at a time.</p><br/><p>It might sound dramatic, but once that happened, a person who cultivated the Undying Codex would have a hard time running low on power!</p><br/><p>It was easy to imagine how heaven-shakingly, earth-shatteringly powerful the Undying Emperor’s Fist would be in that situation!</p><br/><p>Of course, the Undying Blood also brought a significant boost in overall fleshly body power. But that was secondary. The most significant benefit was the dramatic improvement of recovery power!!</p><br/><p>After analyzing the information, Bai Xiaochun thought back to what it was like when he used the Undying Emperor’s Fist. And then, he couldn’t help but anticipate what it would be like to use it with the benefits of the Undying Blood.</p><br/><p>And then there were the regeneration benefits. Couple that with the shocking power he would have at his disposal, and he would be a person few people in heaven and earth could kill….</p><br/><p>“Demigods would flee from me, and I could even cause a big headache for the Celestial….” Bai Xiaochun’s anticipation continued to grow. If he could just overcome the difficulties that came along with this type of cultivation, then one day, he would truly be <em>undying</em>. The thought of that caused his eyes to turn completely bloodshot.</p><br/><p>“I don’t care how I do it. It’s all for my goal of being able to live forever…. I'm gonna go for broke!”</p><br/><p>His eyes shone with complete determination. However, he didn’t continue with cultivation at the moment; right now wasn’t the proper time.</p><br/><p>That didn’t mean he couldn’t seek enlightenment of the technique. After all, that would be the best way to ensure that his efforts proceeded smoothly.</p><br/><p>“The Undying Blood… isn’t divided up into levels like the other parts of the codex!</p><br/><p>“Essentially, the point of the Undying Blood is to replace the current blood in one’s body. At that point, every drop of blood inside me will be as boundless as a huge lake!</p><br/><p>“The blood is divided into percentages… Once I replace one hundred percent of my blood… I will have eternally indestructible, Undying Blood!”</p><br/><p>His thorough study of the information and mnemonic of the Undying Blood took several days. At that point, he looked up for a moment, then slapped his bag of holding to produce some medicinal pills.</p><br/><p>“I’m going to try one more time! But this time, I’ll be extra careful!” From his attitude, it almost seemed like he was about to go into a dangerous duel. Eyes bloodshot, he drew upon the power of his fleshly body.</p><br/><p>As he did, he found that, instead of a whirlpool inside of him… there were many whirlpools! Every drop of blood was a whirlpool that ravenously devoured his life force!</p><br/><p>He almost cried when that happened. That was especially true when he found that the power of any medicinal pills he consumed were instantly sucked away by the vortexes.</p><br/><p>He quickly ended the session of cultivation. However, that was when his jaw suddenly dropped, and he looked in the direction of the Blood Stream Division, and… the Blood Ancestor!!</p><br/>\n</div>"}