{"title": "Chapter 901: Chen Hetian", "id": 901, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-901-chen-hetian", "volume_title": "Volume 10", "body": "<h1>Chapter 901: Chen Hetian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I swore all the way back in the Wildlands that I would get my revenge!” A proud expression appeared on Bai Xiaochun’s face as he made his decision. Back at the Great Wall, Chen Hetian had acted with utter impunity. Completely ignoring how important Bai Xiaochun was, he had sent him into that labyrinth, and yet, that was not the end of his persecution. He then went on to oppress the River-Defying Sect.</p><br/><p>“Hmmmphh! Alright, Chen Hetian, this isn’t me looking for revenge, it’s you being an intolerable bully. The matter’s set. When anyone bothers me, I’ll take it out on Chen Hetian!” Swishing his sleeve, he marveled at how important of a figure he was now.</p><br/><p>“I can’t find Big Fatty Zhang, so I’ll take it out on Chen Hetian!</p><br/><p>“If someone thinks about trifling with the River-Defying Sect, I’ll take it out on Chen Hetian!</p><br/><p>“If someone looks at me the wrong way, I’ll take it out on Chen Hetian!</p><br/><p>“If someone plots against me, I’ll take it out on Chen Hetian!”</p><br/><p>Bai Xiaochun was convinced that he was so marvelous, no one would ever truly be able to comprehend the full extent of it.</p><br/><p>That was especially true when he pondered how Chen Hetian would probably go crazy after what he was about to do. He chuckled excitedly.</p><br/><p>And the truth was that was exactly how things would play out. Although he couldn’t kill Chen Hetian, his plan of venting his anger on him if anyone caused problems for him would drive the man crazy.</p><br/><p>Although Chen Hetian was in the mid Deva Realm, in terms of battle prowess, he didn’t match up to Bai Xiaochun at all. The fact that Bai Xiaochun had single-handedly fought five devas, killing two and seriously injuring three, left Chen Hetian completely struck with fear.</p><br/><p>Were that not the case, he wouldn’t have gone into secluded meditation after returning from the River-Defying Sect. And it was the same with Bai Zhentian and Li Xiandao.</p><br/><p>And yet, Chen Hetian clearly didn’t understand how Bai Xiaochun operated…. Never in his wildest dreams could he have imagined that going into hiding wouldn’t stop Bai Xiaochun from coming to cause problems….</p><br/><p>With the swish of a sleeve, Bai Xiaochun shot across the rainbow toward Chen Hetian’s residence.</p><br/><p>Chen Hetian had a sprawling, luxurious estate in the south of the blue rainbow district. Furthermore, he didn’t live there alone; he had quite a few members of his clan in the estate with him.</p><br/><p>All of the devas lived in such a way.</p><br/><p>In the very middle of the sprawling estate was a lake of crystal-clear water, within which lazed a whole school of goldfish. The lake was actually part of the rainbow itself, which was a marvelous thing in and of itself.</p><br/><p>Next to the lake was an ordinary-looking log cabin, which was actually a holy place to the Chen Clan. And as the patriarch of the clan, and a deva, it was only natural that Chen Hetian lived there.</p><br/><p>As Bai Xiaochun whistled through the air, rumbling booms echoed out, and the clouds churned up above. Rippling distortions spread out in all directions from him.</p><br/><p>It immediately attracted a lot of attention from the other disciples. Furthermore, because of the close proximity to where the Starry Sky Dao Polarity Superstars trials were held, many people from there looked over as well.</p><br/><p>“What’s that sound?!”</p><br/><p>“That’s… Patriarch Bai?”</p><br/><p>Within the Chen Clan estate were numerous clan members who noticed the thunderous roar, much to their shock. When they looked over, they saw something like a shooting star rocketing toward them with incredible speed. A moment later, it was right there in the air above them.</p><br/><p>Instantly, the pressure of a deva weighed down in all directions like the will of the heavens, casting the cultivation bases of everyone down below into full chaos.</p><br/><p>The person up above was pure and fair, with a proud expression on his face, and his hands clasped behind his back. His chin was stuck up as though he were the most powerful expert in the world. He was none other than… Bai Xiaochun!</p><br/><p>The fact that so many people were paying attention to him caused Bai Xiaochun to feel very pleased. Raising his voice, he said, “Chen Hetian, get the hell out here and greet Lord Bai!”</p><br/><p>He had intentionally fused with heaven and earth and surpassed heavenly will, which made his voice boom especially loud. It was almost like an attack, a shockwave that caused many Chen Clan cultivators’ faces to fall as they staggered backward.</p><br/><p>Even the disciples by the Starry Sky Dao Polarity Superstars trials could hear his words, and it caused quite a commotion.</p><br/><p>“Elder Bai… went to cause problems for Elder Chen?”</p><br/><p>“From the tone of Elder Bai’s voice, it sounds like he wants to fight!!” The cultivators in the Starry Sky Dao Polarity Sect almost couldn’t believe what they were seeing, and many of them flew up into the air in the hopes of getting a closer look. After all, conflicts between devas, although not completely unheard of, rarely progressed past simple friction.</p><br/><p>As Bai Xiaochun’s voice echoed out, Chen Hetian was seated cross-legged in the log cabin, meditating. Suddenly, his eyes snapped open, and an expression of wrath appeared on his face.</p><br/><p>Before the events at the River-Defying Sect, if anyone had done something like this, he would have snorted coldly, rushed out, and killed the offender immediately. But now, he simply gritted his teeth; after all, he knew that because of Bai Xiaochun’s shocking battle prowess, the two of them weren’t on the same level.</p><br/><p>However, the fact that Chen Hetian was biting his tongue actually made Bai Xiaochun more irritated. Once again, he raised his voice and said, “What’s going on, Chen Hetian? You're a deva, I'm a deva. Here I am at your front door. Don’t tell me you aren’t going to come out and say hi? How insolent!” With that, Bai Xiaochun took an angry step forward, heading into the Chen Clan and toward the log cabin.</p><br/><p>The other Chen Clan cultivators were trembling in their boots, and didn’t dare to interfere.</p><br/><p>Within moments, Bai Xiaochun’s incredible speed had him closing in on the log cabin. In fact, ripples spread out across the surface of the lake, and even the goldfish began to tremble in fear.</p><br/><p>At this point, Chen Hetian couldn't hold back his anger any longer. He blurred into motion, flying up into the air and waving his hand to send a blast of wind at Bai Xiaochun.</p><br/><p>“What are you doing, Bai Xiaochun?!?!”</p><br/><p>At the same time, Bai Xiaochun unleashed a fist strike, striking the wind blast and sending a terrifyingly loud boom out in all directions.</p><br/><p>Chen Hetian grunted and fell back a few paces. However, Bai Xiaochun’s expression remained exactly the same as ever. His fleshly body was so powerful it didn’t seem necessary for him to defend himself. In fact, he continued forward and prepared to unleash another attack.</p><br/><p>“What am I doing? You brought this upon yourself, Chen Hetian! You know exactly what you did!” In the blink of an eye, he was right in front of him.</p><br/><p>Chen Hetian’s face was a mask of grimness as he performed a double-handed incantation gesture to send another attack at Bai Xiaochun. A boom rang out, and Chen Hetian fell back further. However, Bai Xiaochun didn’t slow down at all.</p><br/><p>Bai Xiaochun’s performance so far had Chen Hetian grumbling bitterly in his heart. His anger continued to burn, and yet, he still held back. As he retreated, he said, “The demigod patriarch already issued his orders about the River-Defying Sect, Bai Xiaochun. You’ve already killed Patriarch Starry River and Patriarch Dao River. What are you acting like this for!?!? What happened back at the Great Wall was a misunderstanding!”</p><br/><p>“This has nothing to do with the River-Defying Sect or the Great Wall, Chen Hetian. Don’t play dumb!” Bristling with anger, Bai Xiaochun utilized his Undying Hex, blasting toward Chen Hetian. Performing an incantation gesture with his right hand, he waved, sending frigid qi blasting out, and summoning nine frigid projections. The projections immediately surrounded Chen Hetian on all sides.</p><br/><p>Chen Hetian’s face fell. He quickly waved his hands out in front of him, causing a black shield of light to spring up and block the nine frigid projections. Falling back again, he angrily yelled, “What exactly are you doing, Bai Xiaochun?!?! I'm not playing dumb! Explain yourself!”</p><br/><p>When Bai Xiaochun realized that Chen Hetian’s voice was louder than his own, he felt very displeased. With even greater volume than before, he shouted, “You’re the culprit here, and you want <em>me</em> to explain?! I'm not leaving until things are settled, Chen Hetian!”</p><br/><p>“Y-you… YOU!!” Chen Hetian was absolutely enraged by this point. He could tell that Bai Xiaochun hadn’t come about the River-Defying Sect, and yet, couldn’t think of what it might be about. After returning to the Starry Sky Dao Polarity Sect, Chen Hetian had gone directly into secluded meditation, and had done nothing to provoke Bai Xiaochun since. Therefore, when Bai Xiaochun called him a ‘culprit’, it caused his anger to burn even hotter.</p><br/><p>It was a strange feeling. Chen Hetian was used to bullying other people, but now… he was the one being bullied….</p><br/><p>“Bai Xiaochun!” he raged. “This is complete and utter bullying!!” Even still, he had no idea what he had done to provoke Bai Xiaochun.</p><br/>\n</div>"}