{"title": "Chapter 906: Sun-Moon Vast-Sky Incantation", "id": 906, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-906-sun-moon-vast-sky-incantation", "volume_title": "Volume 10", "body": "<h1>Chapter 906: Sun-Moon Vast-Sky Incantation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As Bai Xiaochun's cultivation base thrummed with power, the face up above emitted more and more pressure. A moment later, he retracted his cultivation base power, and the face vanished.</p><br/><p>“Y-you… you….” Big Fatty Zhang could hardly breathe, to the point where his face turned crimson. Utter disbelief shone in his eyes, and his mind spun as surely as if someone were hitting him in the head.</p><br/><p>Xu Baocai’s reaction was similar. As he thought back to everything that had just happened, suddenly, it all made sense. Li Xiandao’s politeness, and the fact that the Li Clan had suddenly treated him and Big Fatty Zhang like royalty… was all because of Bai Xiaochun’s status in the sect!</p><br/><p>“Bai Xiaochun… is a deva….” Big Fatty Zhang’s heart began to pound with excitement, and then his eyes started shining. He slapped his thigh. “Hahaha! From now on, nobody in the Starry Sky Dao Polarity Sect will dare to mess with me!!”</p><br/><p>Bai Xiaochun was very pleased to see Big Fatty Zhang so excited. Thumping himself on the chest, he said, “That’s right. Nobody in the sect will ever cause problems for either of you, ever again!”</p><br/><p>Xu Baocai had obviously already reached the same conclusion. He couldn’t help but think about all of the female cultivators he had taken a liking to over the years, none of whom had ever paid much attention to him. But things were different now….</p><br/><p>“Now that the junior patriarch is a deva,” he thought, “the fact that I'm so close to him means that those girls will start banging down the door to get to me!” His excitement about what was to come began to soar to epic heights.</p><br/><p>As for Big Fatty Zhang, his heart was racing, both with excitement for Bai Xiaochun, and also anticipation for the future.</p><br/><p>He had endured quite a bit of hardship in the Starry Sky Dao Polarity Sect, mostly because he had no powerful person backing him. He and Xu Baocai had been forced to swallow their anger and act with the utmost caution in everything.</p><br/><p>But now everything had changed. His close friend was a deva patriarch, which meant he had free reign to act however he wanted to in the Starry Sky Dao Polarity Sect.</p><br/><p>And thus, Bai Xiaochun led the elated Big Fatty Zhang and Xu Baocai back to his immortal's cave on the blue rainbow. Now that he was a sect elder and a deva, he had a residence that was roughly the same as those of the other devas.</p><br/><p>The only difference was that he had no clan to occupy the area. And thus, he immediately invited Big Fatty Zhang and Xu Baocai to live with him.</p><br/><p>His residence was filled with countless spectacular buildings and structures, as well as strong spiritual energy from the Heavenspan Sea. As far as Big Fatty Zhang and Xu Baocai were concerned, they were living in a dream now.</p><br/><p>“Xiaochun, I’ve made a decision,” Big Fatty Zhang announced. “We need to have a powerful faction of our own within the Starry Sky Dao Polarity Sect. The other five deva patriarchs all have a bunch of powerful experts working for them, and we need the same thing! I’ve gotten to know a lot of people over the years, so we should have plenty to pick from!”</p><br/><p>“That’s exactly right,” Xu Baocai said. “There are plenty of disciples in the sect who have yet to realize their dreams. Now that you’re a deva, Junior Patriarch, it's the perfect way to give them their shot at glory.” With that, he pulled a little notebook out of the folds of his robe and started flipping through it to identify potential recruits.</p><br/><p>Bai Xiaochun was very pleased with how enthusiastic Big Fatty Zhang and Xu Baocai were acting. After some thought, he decided that they were exactly right. After all, he already missed his army of corpse troopers from back in Arch-Emperor City. Therefore, he immediately gave Big Fatty Zhang and Xu Baocai authorization to start gathering people to form a new faction.</p><br/><p>In fact, at Xu Baocai’s request, he issued a Dharmic decree, giving the two of them the power and authority to do it officially.</p><br/><p>With that, they hurried away, Dharmic decree in hand, eager to make contact with their network in the sect, both to show off, and also to gather people to their side to go harass their enemies.</p><br/><p>With an official Dharmic decree, the sky was the limit!</p><br/><p>Now that he had rescued his friends, Bai Xiaochun could finally relax. Most of the important tasks he had set out to do had now been accomplished.</p><br/><p>With Big Fatty Zhang and Xu Baocai tasked with building up power within the sect, he could relax and start thinking about his cultivation.</p><br/><p>“I need to keep working on my Undying Blood, but that requires a lot of life force…. Now that I'm a deva patriarch, that shouldn’t be too hard to accomplish. But I still need a deva technique.” After some thought, he stood up and vanished, to reappear in a central location on the blue rainbow, where a seven-story pagoda rose high into the air.</p><br/><p>It was called the Starry Sky Pavilion, and was a repository for many of the legacies in the sect. Quite a few divine abilities and magical techniques were kept there. As for the deva-level Daoist magics, they were specifically stored on the seventh story.</p><br/><p>An ordinary disciple could visit the lower six stories if they had a high cultivation base and plenty of merit points.</p><br/><p>But Bai Xiaochun was a prime elder, which meant he had free access to the entire Starry Sky Pavilion. Furthermore, there were no merit point requirements for him. Including him, there were only seven total people in the sect who had such access: the devas, and the demigod patriarch.</p><br/><p>Bai Xiaochun materialized directly on the seventh story of the pagoda. The only thing present there was a simple, unadorned table, in the middle of which rested nine ancient bamboo slips.</p><br/><p>They were clearly items which had existed for countless years, and all of them had cracks covering their surfaces. Obviously, they were all originals, and not copies.</p><br/><p>Surrounding the nine bamboo slips were three rings of jade slips, which contained several dozen different techniques. Obviously, the jade slips were inferior to the bamboo slips, and contained incomplete techniques.</p><br/><p>He sent some divine sense out to scan the various slips, and was shocked by what he discovered. “They're all deva-level Daoist magics?”</p><br/><p>Back in the River-Defying Sect, they only had two deva-level Daoist magics, which were both incomplete.</p><br/><p>But the Starry Sky Dao Polarity Sect had many. Bai Xiaochun now had a much clearer understanding of how deep the reserve powers of the sect ran.</p><br/><p>After scanning all of the techniques with divine sense to get a basic idea of what they were about, he confirmed his previous conjecture that the nine bamboo slips were the most complete of the various techniques. He saw Li Xiandao’s sword technique, Chen Hetian’s devil technique, and Bai Zhentian’s cosmic chessboard.</p><br/><p>Of course, before selecting a given technique, he could only see its basic description, and none of the important details.</p><br/><p>The three concentric rings of jade slips all contained incomplete techniques, with the outermost of the rings containing the least complete of all. Some of the techniques he recognized as ones used by Patriarchs Starry River, Dao River, and Polarity River. There were also some that he had never heard of before.</p><br/><p>“The ones in the middle of the table are the best….” he thought, frowning. After looking at the nine bamboo slips again, he realized that, despite how complete they were, they were all in completely different categories than the techniques he had cultivated up til now. They were core deva-level Daoist magics of the Starry Sky Dao Polarity Sect, and in order to cultivate them, one needed to have a certain foundation of techniques to work upon.</p><br/><p>“Back in Core Formation, I worked on the Frigid School Will-Evolving Incantation. In the Wildlands, I reached the Nascent Soul stage by using spirit enhancement techniques, and therefore didn’t get a special technique. Now that I’m a deva, it’s very important that I get an appropriate Daoist magic.” After more thought, he examined what was available, until something caught his eye on the outermost of the three rings. The only downside to it was how incomplete it was.</p><br/><p>It was called the Sun-Moon Vast-Sky Incantation!</p><br/><p>Just as its impressive name indicated, cultivating it allowed one to produce an additional sun and moon in the sky!</p><br/><p>Supposedly, it was a technique that came from the ancient Arch-Emperor Dynasty. It had been incomplete when discovered, and its true origins had never been determined. However, after much research, it was determined that cultivating it all the way to the ninth level would allow one to break into the Demigod Realm, and consume suns and moons!</p><br/><p>“It’s too bad that this version of the Sun-Moon Vast-Sky Incantation only goes up to the third level…. That would get me to the mid Deva Realm. The rest of the technique… has been lost to the sands of time.” Bai Xiaochun was torn about what to do.</p><br/>\n</div>"}