{"title": "Chapter 927: Evil Intentions", "id": 927, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-927-evil-intentions", "volume_title": "Volume 10", "body": "<h1>Chapter 927: Evil Intentions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The lands that made up the trial by fire were split into four major areas, a desert, a swamp, a plain, and a jungle. They didn’t interlock, but rather, were separated by enormous mountain ranges and other terrain features.</p><br/><p>Although the lands were not endless, they were certainly vast.</p><br/><p>Furthermore, hidden dangers lurked everywhere. That included both natural occurrences like the sandstorm, and bizarre entities of every sort. All of them could be extremely deadly.</p><br/><p>Before entering the trial by fire, the cultivators from the four major rivers had all assumed it would be dangerous. Even still, now that they were inside, they were completely shocked by what they were facing.</p><br/><p>In fact, the word ‘danger’ couldn’t be used to describe the place. It was more like… a land of death!</p><br/><p>Currently, Shi Yan, chosen from the Exalted Zodiac Moon Domination Sect in the west, was traversing the swamp area of the trial by fire. Despite being in the great circle of the Nascent Soul stage, his face was ashen with terror as he proceeded along with the utmost caution.</p><br/><p>His clothing was ripped and torn, and also stained with blood. After teleporting into the trial by fire, he had seen three people killed right in front of him. Most terrifying of all… was that the creatures responsible for those deaths were a variety of leech that lurked in the marsh waters. They traveled in swarms numbering in the thousands, which could, in only a single breath of time, completely cover a cultivator. Upon vanishing back into the swamp, they would leave behind only a dry and desiccated corpse.</p><br/><p>Within moments, countless larvae would burrow into the desiccated corpse and nest inside of it….</p><br/><p>Because of that, Shi Yan was gripped with terror as he proceeded along.</p><br/><p>He wasn’t the only one in the swamp. Sun Wu from the Dragon Totem Ghost Sea Sect was present as well. He was also a chosen, with a cultivation base in the great circle of the Nascent Soul, who bore the physical appearance of an evil ghost. Although he wasn’t currently wounded, he trembled as he stood in place… unwilling to take a single step forward.</p><br/><p>The reason he refused to move was that he was surrounded by more than 10,000 shocking mosquitos!</p><br/><p>The mosquitos were human-sized, and created a thundering rumble with the buzzing of their wings. Were it not for the fact that Sun Wu had a secret magic to keep himself invisible to them, they would have long since sucked the life completely out of him.</p><br/><p>The monkey-like Master Lightning Origin from the Nine Heavens Cloud Lightning Sect was in a similar position in the jungle. An unsightly expression could be seen on his face, which dripped with sweat as he rushed along, chased by a troupe of crimson-eyed monkeys who thrummed with shocking power.</p><br/><p>Big Fatty Zhang, Bai Lin, Zhao Tianjiao, Heretic, Song Que, and many other friends of Bai Xiaochun were in similarly terrifying situations.</p><br/><p>The level of danger in this trial by fire surpassed what anyone could have imagined. Right now, they had no other options than to flee for their lives!</p><br/><p>It was the same with Bai Xiaochun, who sped through the desert at top speed. So far, he had spotted seven sandstorms, all of which radiated incredible power that left his heart pounding in his chest.</p><br/><p>If all he had to deal with were natural disasters, then it might not have been as terrifying. However, Bai Xiaochun’s deva-level divine sense had long since revealed to him that there were terrifying fluctuations hidden within the desert. There were some brutal entities there which seemed to be on the same level as devas. Even worse, there were certain creatures which seemed to be trailing him, as if they were predator and he was prey!</p><br/><p>“This trial by fire is not suitable for Nascent Soul cultivators at all! Only people with deva cultivation bases could possibly be of use here!</p><br/><p>“Dammit! The Celestial used the pretext of selecting an apprentice to gather a whole group of Nascent Soul cultivators to come into a place like this…? Just what is he up to!? This… is definitely not an arcane pocket realm!”</p><br/><p>Bai Xiaochun was really starting to feel nervous, both for Big Fatty Zhang and his other Nascent Soul friends, and also, for Hou Xiaomei.</p><br/><p>Thankfully, Hou Xiaomei was a special guard, and therefore, would likely be in a much safer position than the other cultivators. However, Bai Xiaochun still couldn’t stop worrying about her.</p><br/><p>Even as he sped along, his heart suddenly leapt up into his throat. Without any hesitation, he utilized the Mountain Shaking Bash, bursting forward with speed that bordered on teleportation. In the blink of an eye, he was 300 meters away.</p><br/><p>In almost that exact same instant, numerous booming sounds echoed out as eight crimson figures blurred through the spot he had just occupied.</p><br/><p>As soon as they flew back up into the sky, Bai Xiaochun could see them clearly. Shockingly, they were eight enormous sandworms!</p><br/><p>They looked like crimson maggots, hundreds of meters long, with no eyes, but terrifying, gaping maws, within which glistened row upon row of razor-sharp teeth!</p><br/><p>One of the sandworms had a red aperture on its head that emitted a strange power in the form of a loud cracking sound. From the nature of that aperture, it was obvious that some incredible magical device was imbedded inside of the sandworm. It was the strongest of the bunch, being comparable to the mid Deva Realm. The others were similar to the early Deva Realm. As soon as the entire group regathered up in the air, they turned back in Bai Xiaochun’s direction and shot toward him again, screeching in bizarre voices.</p><br/><p>Bai Xiaochun was already panting in anxiety. If he only had these eight sandworms to worry about, it might not have been a big deal. But he could sense countless similar fluctuations in the surrounding area, all of them rushing toward him at high speed.</p><br/><p>It wouldn’t be long before even more sandworms were upon him.</p><br/><p>The idea of innumerable sandworms beneath the surface of the desert, all closing in on him, caused him to shiver and push forward with renewed speed.</p><br/><p>Unfortunately, no matter how he zigged or zagged, a sandworm would end up bursting out of the ground to block his path. It continued to happen over and over again, until he started to really get angry.</p><br/><p>“Complete and utter bullying!” He knew that he couldn’t keep up this same tactic, otherwise he would never escape, not unless the sandworms just gave up.</p><br/><p>He only had one option… strike fear into their hearts!</p><br/><p>With that, he gritted his teeth and spun to face the group of eight. Howling, he singled out one of the sandworms that was in the early Deva Realm and unleashed a vicious fist strike!</p><br/><p>He didn’t draw upon his cultivation base, only his fleshly body. And yet, that still enabled him to strike with mountain-toppling, sea-draining force. A cultivator in the early Deva Realm would be crushed by this attack, much less a sandworm the likes of these.</p><br/><p>Rumbling sounds echoed out into the far distance as the front half of the sandworm exploded, and the back half dropped down with a thud onto the desert floor, sending sand flying out in all directions.</p><br/><p>When the other sandworms saw that one of their own had been destroyed, they reacted with utter madness. Opening their mouths, they sent countless bolts of lightning shooting out. However, it was at that exact same moment that a figure blurred onto the scene from off in the distance.</p><br/><p>It was none other than one of the twin Master Cloud Lightnings from the Nine Heavens Cloud Lightning Sect. If one considered them to be brothers, then the older brother was the one whose left side was withered, with the right side being strong.</p><br/><p>The younger brother was the opposite. He made a bizarre sight as he shot forward with astonishing speed that seemed even faster than Bai Xiaochun. After all, he was in the mid Deva Realm, and used a secret magic from the Nine Heavens Cloud Lightning Sect to add further speed to his movement. He sped through the desert, pursued by more than 10,000 sandworms, who were dogging him relentlessly, making escape impossible.</p><br/><p>When Master Cloud Lightning noticed Bai Xiaochun, his eyes glittered, especially because of the sandworm with the red aperture on its head.</p><br/><p>He stopped for a brief moment, until the sandworms behind him were almost right on top of him. Then, he turned and shot toward Bai Xiaochun!</p><br/><p>Clearly, he hoped to pass his huge group of sandworms onto Bai Xiaochun!</p><br/>\n</div>"}