{"title": "Chapter 921: The Noble Du Lingfei!", "id": 921, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-921-the-noble-du-lingfei", "volume_title": "Volume 10", "body": "<h1>Chapter 921: The Noble Du Lingfei!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Everybody pay attention to Bai Xiaochun from the Starry Sky Dao Polarity Sect. Just because he’s a deva doesn’t mean that he’ll hold back from fighting Nascent Soul cultivators. You’d be gravely mistaken if you thought he would. According to our intelligence report, he’s a twisted individual who takes delight in bullying people weaker than him. He’s definitely the most powerful deva from the Starry Sky Dao Polarity Sect, and yet, for his entire life, he’s done nothing but oppress those with lower cultivation bases than himself! He’s the epitome of shamelessness, and all of you need to be very careful around him!”</p><br/><p>“All of you need to be on guard against Bai Xiaochun. He's done a lot of very strange things in his life. He served on the Great Wall, then disappeared into the Wildlands for several decades. When he came back safely, he was a deva! What’s most terrifying about him, however, is not his cultivation base. It’s his medicinal pills! According to the limited information we have access to, if he's given the right opportunity, his pill concocting methods can destroy an entire riversource sect!!”</p><br/><p>“Perhaps you people might not have heard of Bai Xiaochun. However, you’ve surely heard of the Fantasy Pills that come from the eastern Heavenspan River. Remember the catastrophes that resulted years ago because of those pills? Well… this guy is the despicable villain who created them!”</p><br/><p>When Bai Xiaochun heard what the people from the other three river branches were saying about him, a strange, embarrassed look appeared on his face. Then he shook his head.</p><br/><p>“I can’t believe I’m so famous…. When did my Fantasy Pill end up reaching the west? Are they the same as the ones from Sky City? And who said I like to bully people with a lower cultivation base than me!? That’s just called playing it safe!!” Despite being slightly irritated, he was generally pleased by how famous he was. Even he hadn't been aware of how far his name had spread.</p><br/><p>“Hmmmphh! If they knew that the Giant Ghost King is my father-in-law, and that my apprentice is the Hell-Emperor, then they would definitely be scared out of their minds!” Thinking in that way made him feel even more pleased.</p><br/><p>However, it was at about this time that he suddenly heard the sound of people talking… from the direction of the Nine Heavens Cloud Lightning Sect.</p><br/><p>“Bai Xiaochun? Hmph. He just got lucky, and became a deva earlier than expected. It won’t be long before I become a deva, and then I’ll definitely defeat him in battle!”</p><br/><p>“He’s pretty good-looking. Too bad he’s a guy.”</p><br/><p>The people who were speaking were Nascent Soul cultivators, and their words were not pleasing at all to Bai Xiaochun. He immediately glared over in their direction, which attracted the attention of the twin Master Cloud Lightnings, who looked back in his direction.</p><br/><p>The instant their gazes met, Bai Xiaochun’s spirits lifted.</p><br/><p>“Hey hey! Another staring contest, huh?!” Obviously, Bai Xiaochun would never willingly be outdone at his own favorite hobby. Therefore, he intensified his glare. However, it was only moments later that he was shocked to find how incredibly intimidating Master Cloud Lightning was.</p><br/><p>“Dammit, there are two of them!”</p><br/><p>The twin Master Cloud Lightnings looked at him coldly with two sets of eyes. Their gazes were incredibly intense, which made it difficult for Bai Xiaochun to stand up to them alone. He quickly called Song Que over to help him. However, before they could team up, the cultivators from the four different battleships all fell silent.</p><br/><p>That was when Bai Xiaochun noticed that a group of people had stepped onto the docks, having just emerged from the majestic mountains that linked to the main part of Heavenspan Island.</p><br/><p>In the lead… was a beautiful young woman wearing a long, violet gown embroidered with nine phoenixes. She had a crimson mark on her forehead, and there was something about her that seemed profoundly noble. When she looked out at everyone, her gaze seemed like the type that no one could defy.</p><br/><p>As soon as Bai Xiaochun saw her, a tremor passed through him, and complicated feelings rose up in his heart. He suddenly had no interest in the staring contest with the twin Master Cloud Lightnings. All he could do was look quietly at the young woman.</p><br/><p>She was none other than Du Lingfei.</p><br/><p>They hadn’t seen each other in a very long time, and for some reason, she seemed more noble than she had in the past. As she stood there, it was clear that she was the focus of all the eyes present.</p><br/><p>There was definitely something different about her, and it couldn’t help but make him feel that she was a bit of a stranger.</p><br/><p>Flanking Du Lingfei were two groups of cultivators. On her left side was a group of female cultivators in red clothing, while on her right side were males cultivators in blue clothing. All of them were spectacularly good-looking.</p><br/><p>A mere glance at the two groups of cultivators would cause anyone’s eyes to glitter. They were dressed alike down to the smallest detail, and were arranged in perfect ranks. Furthermore, they pulsed with incredible energy, as though all of them were capable of drawing upon the might of Heavenspan Island itself. Overall, they were very impressive.</p><br/><p>Bai Xiaochun quickly spotted Hou Xiaomei in one of the groups, and Ghostfang in the other.</p><br/><p>In almost the same moment, Hou Xiaomei caught sight of him, and the faintest shadow of a smile appeared on her face. A sparkle of joy could also be seen in her eye; if it weren’t for the solemn responsibilities she held, she would clearly have run over and hugged Bai Xiaochun.</p><br/><p>Ghostfang also noticed Bai Xiaochun, but his face remained expressionless, and he barely glanced at him.</p><br/><p>When Bai Xiaochun saw Hou Xiaomei safe and unharmed, he breathed a sigh of relief. However, he couldn't shake the mixed emotions that had risen up inside of him because of Du Lingfei.</p><br/><p>At this point, Du Lingfei smiled and said, “Greetings, Fellow Daoists, and welcome to Heavenspan Island.”</p><br/><p>There was a dignity within her voice that was backed by the might of Heavenspan Island, something magical that caused it to penetrate deep into the hearts and minds of everyone present.</p><br/><p>Somber expressions could be seen on the faces of all of the cultivators present. The deva experts all stepped forward, clasped hands and bowed.</p><br/><p>“Well met, Emissary.” The polite words were uttered by the twin Master Cloud Lightnings, Guru Spirit Immortal, and Master Thousand-Ghost. None of them had ever seen Du Lingfei before, but knew that she had a special status, and didn’t dare to say anything that might offend her.</p><br/><p>Bai Xiaochun almost didn’t want to step forward. But considering that he was the deva in charge of the group from the Starry Sky Dao Polarity Sect, he knew he had to. Sighing, he clasped hands and bowed. However, he truly couldn’t think of the right words to speak.</p><br/><p>The other devas noticed this, and were inwardly shocked. However, Du Lingfei's expression softened into a smile when she saw Bai Xiaochun bowing to her. However, she didn't say anything. Instead, she arranged for her special guards to formally receive all of the visitors from the four rivers.</p><br/><p>Each river branch had brought a few hundred people. Added together, there were about a thousand, which made the docks relatively crowded at the moment. However, thanks to Du Lingfei’s arrangements, there was no chaos or confusion.</p><br/><p>“Fellow Daoists, it’s already getting late, so please follow these special guards to your accommodations. Rest up, for early in the morning, when the bells toll seven times, people will come to take you for an audience with the Celestial.” After a moment of thought, she added, “By the way, there are many restricted areas on Heavenspan Island. In order to prevent any unforeseen circumstances, I would like to ask you to remain indoors through the night. Otherwise… the guards in those locations might injure or kill you, and we wouldn’t want that.”</p><br/><p>There was nothing threatening about the way Du Lingfei spoke. In fact, her voice was kind and warm. However, the words themselves struck fear into the hearts of all the cultivators present.</p><br/><p>Even the devas were shaken.</p><br/><p>Heavenspan Island was the nucleus of all the lands of Heavenspan, and although the Celestial’s Palace of the Dao wasn't particularly large, it was clearly as dangerous as a dragon’s pool or a tiger’s den. In fact, even demigod experts who acted improperly would be killed instantly!</p><br/><p>Because of that, the visitors didn’t even need any reminders from Du Lingfei to keep them in line.</p><br/><p>The accommodations that had been arranged for them were not on the large part of the island, but rather, in the buildings which surrounded the docks. Four main areas had been set up, with large buildings set aside for people who had come on formal visits.</p><br/><p>As for the main part of the island, no one was allowed there without the express invitation of the Celestial himself. The only thing they could do was gaze from afar at the three mountain peaks, and the occasional patrols of special guards that wound their way among the countless palace buildings.</p><br/><p>Bai Xiaochun didn’t say anything as the Heavenspan Island special guards made their arrangements. Clearly, Hou Xiaomei wanted to come over, but she had been assigned to a different group, and could only gaze at him through the crowd.</p><br/><p>By evening, the more than 1,000 Nascent Soul cultivators had been taken to their various accommodations by the special guards. As a deva, Bai Xiaochun had a special courtyard residence to himself, which was much closer to the main entrance leading to the mountains of the island.</p><br/><p>The spiritual energy here was strong beyond belief, far stronger than in the Starry Sky Dao Polarity Sect. However, Bai Xiaochun was not in the mood for cultivation. As the sky grew dark, he sat there cross-legged, waiting.</p><br/><p>He was sure that… Du Lingfei would come to visit him this very night!</p><br/>\n</div>"}