{"title": "Chapter 937: Hes Still A Child", "id": 937, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-937-hes-still-a-child", "volume_title": "Volume 10", "body": "<h1>Chapter 937: Hes Still A Child</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The trial by fire was made up of four separate lands: a desert, a swamp, a plain, and a jungle, each of which was filled with all sorts of hidden dangers. As for how many people remained alive from the four rivers, no one knew.</p><br/><p>By now, it was very obvious to Bai Xiaochun why the requirement to enter the trial by fire was set at the Nascent Soul stage…. Anyone under that level wouldn’t even be able to move around.</p><br/><p>Even Nascent Soul cultivators… faced deadly peril at every turn!</p><br/><p>For example, Sun Wu was in the great circle of the Nascent Soul stage, and was considered a top chosen. He was widely viewed as the most likely disciple in his sect to become a deva, and yet he had been placed into a situation of almost certain death at the hands of those wolves.</p><br/><p>Considering how dangerous the trial by fire was, as soon as Bai Xiaochun heard Sun Wu mention the name Song Que, and how he had asked for help, he began to pant. Song Que had always been testy with Bai Xiaochun, and didn’t like him very much, but he was his nephew. That was even more the case now that Bai Xiaochun had taken the next step with Song Junwan.</p><br/><p>If the situation weren’t more dire, Bai Xiaochun might have been inclined to pull a prank on him. But this place was too dangerous. Therefore, he immediately asked Sun Wu to take him to the location where he'd seen Song Que.</p><br/><p>Sun Wu didn’t dare to be deceptive in any way. He immediately told Bai Xiaochun all the details, after which Bai Xiaochun shot in that direction. Sun Wu and Big Fatty Zhang followed along nervously.</p><br/><p>The three of them became bright beams of light that shot through the sky over the swamp.</p><br/><p>Bai Xiaochun was so nervous, and was moving so quickly, that he left Sun Wu and Big Fatty Zhang behind. About half a day passed, and he was already closing in on the location where Song Que was trapped.</p><br/><p>As the fluctuations of his aura spread out into the area, he sent some divine sense out to ascertain the situation. Afterward, he sighed in relief.</p><br/><p>“Que’er sure is a fortunate child!” Sticking his chin up, he mused about how truly lucky Song Que was. After all, whenever he got into danger, Bai Xiaochun always seemed to come rescue him.</p><br/><p>Song Que was currently in a violet pool of water, surrounded by countless floating eyes, each one of which was several meters wide.</p><br/><p>Shockingly, there were cultivators sealed inside many of the eyes….</p><br/><p>There were men and women from all four of the river branches, most of them already skeletons, although a few were in a partial state of decomposition….</p><br/><p>Two of them were still gasping for breath, one of those two being… Song Que.</p><br/><p>Black tendrils of smoke were wrapped around him, almost like snakes, slowly absorbing him. Thankfully, the Song Clan patriarch had given him a legacy treasure from the clan that had kept him alive so far. Without it, he would have long since died.</p><br/><p>The legacy treasure was a cloak, the soft light of which prevented the black smoke from piercing into his body.</p><br/><p>It was clearly a fantastic, powerful item, and yet, as time went on, it was clearly being worn down, and the light it emitted was beginning to grow faint.</p><br/><p>In fact, given the level of Song Que’s cultivation base, not even that cloak should have enabled him to hang on this long. However, for some unknown reason, only a few days ago, the eyes had suddenly become much weaker, almost as if they had aged.</p><br/><p>That had given Song Que some hope, and had helped him use the power of the cloak to hang on a bit longer.</p><br/><p>However, he knew that unless someone came to save him… he would not be able to unseal himself and escape. And that meant that he would definitely meet his end eventually.</p><br/><p>“Don’t tell me that I, Song Que, am actually going to perish in this trial by fire!” he thought bitterly. Already, his joints were growing stiff, and his cultivation base was beginning to fade.</p><br/><p>“I refuse to give in! I still haven’t defeated that damned Bai Xiaochun! I still haven’t trampled him beneath my feet! I still haven’t had my revenge on him! I survived for year after bitter year in the Wildlands, I refuse to believe that a measly trial by fire is going to be the death of me!!</p><br/><p>“I, Song Que, am a person blessed by luck. No matter what deadly crises I’ve faced in my life, I always come out on top. From Qi Condensation all the way to the Nascent Soul stage, it was always like that. I’m not going to die here!” Howling, he struggled to free himself until he went blue in the face. That was when he noticed that, all of a sudden, the surrounding eyes were trembling.</p><br/><p>The eyes who had no cultivators in them blinked in terror, and then turned and vanished into the swamp.</p><br/><p>The violet pool had once contained so many eyes it was impossible to count them all. But now, ninety-nine percent of them were gone…. The few dozen that remained began to blink rapidly to unseal the cultivators and corpses inside of them, spit them out, and then flee.</p><br/><p>The eye which held Song Que seemed particularly hesitant. However, after a moment, Song Que felt a powerful force gripping him, and he was thrown out into the open. Within moments, the eye which had held him sealed for so many days had vanished into the swamp.</p><br/><p>Song Que stood there with a blank expression on his face, looking around in confusion. Everything had happened so quickly that he wasn’t really sure how to react.</p><br/><p>One moment ago, the area had been filled with innumerable vicious eyes, but now… not a single one was in sight. It was almost as if the events of recent days had been a dream.</p><br/><p>“Could it be… could it be that those eyes can only exist for a certain period of time, after which they vanish?” Although he couldn't be sure if his speculation was true, his heart was currently pounding with joy at having escaped certain death. Excited, he began to study his surroundings when, all of a sudden, he looked up into the sky, and his eyes went wide.</p><br/><p>Much of the spiritual power inside of him had been drained away, but he could still focus enough on his eyes to see very clearly that, there, off in the distance… was Bai Xiaochun, smiling broadly.</p><br/><p>It was at that point that Bai Xiaochun's voice reached Song Que’s ears.</p><br/><p>“Hi, Que’er….”</p><br/><p>Song Que’s expression darkened. Then he saw that two people were following Bai Xiaochun, one being Big Fatty Zhang, and the other being Sun Wu, whom Song Que had previously begged for help.</p><br/><p>If by this point Song Que didn’t realize why the eyes had vanished, it would have revealed him to be a complete idiot. Therefore, he simply turned to fly away.</p><br/><p>When Bai Xiaochun saw that Song Que was flying away, he was not happy at all.</p><br/><p>“How could you be so impolite, Que’er!? I can’t believe you didn't even say hello to me!” With that, he made a grasping motion, causing Song Que’s expression to turn even grimmer as he was grabbed by an invisible force and dragged over to Bai Xiaochun.</p><br/><p>Upon seeing Bai Xiaochun, Song Que acted as though he had just caught sight of a diseased animal. That increased Bai Xiaochun’s displeasure, and was also a big loss of face, considering that there were other people present.</p><br/><p>“Que’er, I am a member of the elder generation, and am also your uncle. You know, I’m well within my rights to criticize your actions if I want to!”</p><br/><p>Song Que was feeling very frustrated and depressed. As far as he was concerned, being captured by those vicious eyes had actually been a lot better than being trapped by Bai Xiaochun. After all, the eyes could inflict physical pain, but Bai Xiaochun inflicted mental torture.</p><br/><p>And yet, Song Que didn't say anything. He actually wasn’t sure what to say. His action of turning to leave had actually been instinctual. He hadn’t put any thought into it whatsoever.</p><br/><p>He could tell that Bai Xiaochun was displeased, and therefore, he braced himself and prepared to offer an explanation. It was at around this time that Big Fatty Zhang and Sun Wu arrived. Sun Wu didn't seem to notice the awkwardness of the situation, but Big Fatty Zhang knew Song Que fairly well, and could guess what was going on. He had also heard some of Bai Xiaochun’s words. Therefore, his eyes lit up, and he leaped forward.</p><br/><p>“Xiaochun, Que’er is still just a child. He’s always been the filial type, so what happened just now was probably just a misunderstanding…. Que’er, you need to listen to your Uncle Fatty. What you did just now was wrong. Your Uncle Bai came here to save you, and yet you didn’t even say hello? Look, I know that you’re a good kid. Come offer greetings to your uncle, and then… well, your uncle’s close friends are also members of the senior generation….” From the look in Big Fatty Zhang’s eyes, it was clear that he very much looked forward to what was going to happen next.</p><br/><p>Song Que’s expression turned grimmer as he glared at Big Fatty Zhang. He almost felt like his blood was about to start flowing backwards. For Bai Xiaochun to take advantage of him was one thing, but for Big Fatty Zhang to do the same pushed Song Que to the point where he felt like his head was about to explode.</p><br/><p>And then he thought about the possibility that he would have to call all of Bai Xiaochun’s friends Uncle and Aunt, and his mind began to spin.</p><br/><p>“Big Fatty Zhang!”</p><br/>\n</div>"}