{"title": "Chapter 963: What?! Aaaiiiieee!", "id": 963, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-963-what-aaaiiiieee", "volume_title": "Volume 10", "body": "<h1>Chapter 963: What?! Aaaiiiieee!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Nine Heavens Cloud Lightning Sect had two ice statues, one holding up the pure white Cloud Order, the other holding up the pitch black Lightning Order!</p><br/><p>At the moment, a piercing shriek was echoing out deep within the black cloud that housed the Lightning Order. Of course, it was Bai Xiaochun.</p><br/><p>“I hate the north!!”</p><br/><p>It was a shriek filled with bitterness and defiance. However, no matter how loudly he screamed, his voice did not go beyond… Lightning Penitentiary, where he had been imprisoned for three days already.</p><br/><p>He was already wracked with despair. Within the depths of the black cloud, he was surrounded by layer upon layer of restrictive sealing spells, creating a cell that was only about 30 meters of space in which he could move around.</p><br/><p>Beyond the borders of the cell were innumerable lightning bolts, each one as thick as an arm and abounding with so much destructive power that it caused Bai Xiaochun’s face to go pale.</p><br/><p>“Complete and utter bullying!!” he muttered, shivering as he sat there, looking out at the darkness and the lightning. Calling out to the heavens and cursing the hells brought not even the slightest response. As far as Bai Xiaochun was concerned, this was the unluckiest he had ever been in his entire life.</p><br/><p>“Completely ridiculous. Three-point covenant, four-point covenant, five-point covenant…. All of that I could deal with. But I can’t believe they actually locked me up!” He felt like he was about to go crazy, and couldn’t come up with any effective methods to do anything about the situation.</p><br/><p>Not only could he not escape, every few hours, lightning would gather around his cell and then strike him repeatedly.</p><br/><p>There was only one way to deal with the shocking lightning, and that was to draw upon his cultivation base power. Unfortunately, Lightning Penitentiary was cut off from the spiritual energy of heaven and earth, which led Bai Xiaochun to the conclusion that, eventually, he would run out of power to stave off the lightning.</p><br/><p>“What am I supposed to do?” he sighed. Right now, his main hope was that Du Lingfei would finish her mission soon and come to free him.</p><br/><p>“I'm gonna remember this, you northerners!” he said loudly. “You just wait. After I become a demigod, I'm going to get my revenge!” With that, he let out a roar of frustration.</p><br/><p>However, as soon as he did, a sarcastic chuckle could be heard from off to the side.</p><br/><p>“Become a demigod? Even then you won’t be able to get revenge.”</p><br/><p>“Who’s there?!” Bai Xiaochun said, looking around. His divine sense had been restricted as soon as he was thrown into his cell, but his ordinary senses had not. However, during the past three days, he hadn’t detected any signs of life anywhere nearby.</p><br/><p>As he looked around vigilantly, he saw the clouds off to the side seething, and then gradually turning translucent, revealing another cell roughly 300 meters away.</p><br/><p>It was also thirty meters across, formed by countless restrictive spells. Just like his own cell, it was surrounded by dancing lightning, which occasionally shot into the cell to strike at an emaciated figure who sat there cross-legged!</p><br/><p>It was an old man wearing threadbare garments. He was little more than skin and bones, and his aura was very weak. Whenever the lightning struck him, he would shiver slightly, and yet, his expression never changed. Apparently, while he couldn’t stop the physical torment of the lightning bolts, his mind had long since grown used to the pain.</p><br/><p>His hand was currently settling back down onto his knee; apparently, not even the restrictive spells could completely hold his will in check, allowing him the basic ability to control the clouds around him.</p><br/><p>When Bai Xiaochun looked into the old man’s eyes, it felt like his eyes were being stabbed, eliciting a gasp.</p><br/><p>“Listen, kid, I'm a demigod, and even I'm stuck here. So my advice is that you adjust that little oath of yours. Maybe you can aim for becoming a celestial?” The man grinned, and as his yellowish teeth were illuminated by the lightning, he looked particularly sinister. Bai Xiaochun shivered.</p><br/><p>“I’ve been in here for years now,” the man continued, “and I can tell you that people who get locked up here don’t tend to last for long. Now that I think about it, it's been a while since anybody new came around.</p><br/><p>“Come come, kid. Can you dance? Do a sexy little dance for me, and if I like it, I might just give you a secret magic that can help you deal with the pain.” The old man eyed Bai Xiaochun up and down, eyes shining with a bizarre light as he chuckled.</p><br/><p>Bai Xiaochun had been startled by the man’s sudden appearance, but had now recovered. And he could sense that he and this man were similar in that, after having been locked up, they both got a bit braver.</p><br/><p>Glaring at the man, he said, “Shut up, old man. I worked as a prison guard in the past, and eventually I lost track of how many prisoners like you I mopped the floor with.” Snorting coldly, he stuck his chin up and looked away.</p><br/><p>The old man laughed heartily. “The stubborn type, huh? I really like young bucks like you. You know, 3,000 years ago there was another stubborn punk who got locked up here. He only lasted a month before he was twisting and turning in front of me, begging for my secret magic. Whenever you’re ready, I’ll be waiting for you.”</p><br/><p>Apparently, he was very pleased at the additional amusement that Bai Xiaochun had brought into his life</p><br/><p>Bai Xiaochun was already feeling quite annoyed at this man’s gaze and laughter. After giving him another good glare, he ignored him. After all, he just needed to wait for Du Lingfei to finish her mission, and then she would come back and think of a way to get him out.</p><br/><p>Two hours later, the lightning around his cell began to build up more and more, creating something like a lightning storm around him.</p><br/><p>When the lightning storm struck, he drew upon his cultivation base to defend himself. The sight of all that lightning was really shocking. After all, the destructive power in only one bolt wasn’t anything to really worry about, but from what he could tell, there were hundreds of thousands of them.</p><br/><p>He wasn’t the only one to have to deal with the lightning in that moment. The old man was also struck. However, the man’s expression didn’t so much as flicker because of it. Instead, he looked over at Bai Xiaochun with ill intentions flickering in his eyes.</p><br/><p>“You still have spiritual power now, so you can defend yourself. But in another ten days or so, you’ll run out…. And that’s when you’ll really start to ‘enjoy’ yourself.</p><br/><p>“The power of the lightning builds up over time, you know. Eventually, it reaches the point of being the most horrific suffering in heaven and earth.” Although the old man trembled physically as he spoke, it didn't affect his voice at all.</p><br/><p>“You know what I love to hear the most? The screams of people getting struck by lightning. I just close my eyes and revel in the beauty of it….” Licking his lips, he gazed at Bai Xiaochun, his eyes brimming with malice.</p><br/><p>Bai Xiaochun was in no mood to pay any attention to the man. The lightning continued to strike him for a full hour before finally fading away. In the process, a large portion of his spiritual power was drained away.</p><br/><p>He now only had seventy percent left, a fact that caused an unsightly expression to appear on his face.</p><br/><p>“This isn’t going to work….” he thought, looking around apprehensively at all the lightning. After some calculations, he came to the conclusion that his spiritual power really would be drained in about ten days.</p><br/><p>Although he was confident in his fleshly body power, the fact that this old man, a demigod, was in such tattered shape, left him worried that he wouldn’t be able to match up.</p><br/><p>Five more days flew by. Whenever the lightning struck, his spiritual power levels got lower and lower, and the cackles of the old man grew louder.</p><br/><p>Bai Xiaochun was feeling very frustrated. On the sixth day, however, he suddenly looked up, his eyes bloodshot as he stared at the surrounding lightning bolts.</p><br/><p>He had considered many options, but none had seemed viable. That meant he only had one choice left….</p><br/><p>“Back on the Heavenspan Sea, when Eldest Brother was going through his tribulation, I actually consumed the tribulation cloud. That cloud had lightning in it… and in addition to the destructive power it contained, it also had life force!</p><br/><p>“I’m pretty sure my apprentice was helping me back then, so it’s hard to say… if I can do the same thing in here.” After vacillating for some time, he saw the lightning building up into a storm, and he gritted his teeth.</p><br/><p>“Might as well give it a shot!” He rose to his feet, drawing upon his cultivation base, although not in a way to defend himself.</p><br/><p>Hundreds of thousands of lightning bolts swirled into a massive storm than then pierced into his cell and appeared right in front of him. Just as it was about to smash into him, he roared, opened his mouth, and sucked in a breath!</p><br/><p>The old man was initially stunned, but then began to laugh in mocking fashion.</p><br/><p>“Another fool who thinks he can consume the lightning. Looking to die, huh? Years ago, I called myself the Lightning Ancestor, and was the only rogue cultivator demigod in the north. But not even I dared to try to consume lightning bolts. Over all the years that I’ve been here, I've seen a lot of-- uh… what?” All of a sudden, the old man’s eyes bulged so wide that they nearly dropped out of his head.</p><br/><p>“Freaking… w-w-what… what are you doing?!?!”</p><br/>\n</div>"}