{"title": "Chapter 961: Voracious Moonflower", "id": 961, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-961-voracious-moonflower", "volume_title": "Volume 10", "body": "<h1>Chapter 961: Voracious Moonflower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Smacking his bag of holding, he produced the moonflower seed. “The bone galleon and Ghostmother both come from beyond the heavens. I guess these flowers must come from there too.”</p><br/><p>Examining the seed for a long moment, he began to perfect his plan. Eventually, his eyes began to shine brightly.</p><br/><p>“Hahaha! The heavens never truly bar one’s way!” He couldn’t feel more pleased about the fact that the four-point covenant really didn't say anything prohibiting him from planting flowers.</p><br/><p>Feeling very exhilarated, he walked out of his residence and looked around for a good place to plant the seed. Eventually, he rubbed his chin and murmured, “It probably isn’t safe to plant it outside. These northerners are all so unreasonable…. Ah, whatever. I’ll just plant it inside.” </p><br/><p>Fully convinced that this was the best way to do it, he walked back inside and got to work. Although the ground in the Cloud Order was different from ordinary ground in some ways, in most ways, it was the same. It took a bit of work, but he managed to dig a sizeable hole right in the middle of the room.</p><br/><p>Before long, he reached the white, fluffy soil that made up the land of the cloud, which also caused a bit of frigid qi to emanate up into the room. Eyes sparkling, he carefully placed the moonflower seed down into the cloud soil.</p><br/><p>Having accomplished that, he sat off to the side, eye sparkling with anticipation and excitement. Almost as soon as the cloud soil was piled back over the seed, it began to tremble as if it were alive.</p><br/><p>It was a trembling that stemmed, not from fear, but from excitement. Even Bai Xiaochun could sense how emotional the seed was, and it caused his eyes to shine even more brightly.</p><br/><p>“Be a good little moonflower, now. Grow fast and strong….” Licking his lips, he spent the whole night standing watch. Very shortly after planting the seed, he could see the frigid qi streaming up from the cloud, nourishing it. By morning, the seed had sprouted.</p><br/><p>As of this moment, Bai Xiaochun really felt like he was on an important mission, and spent day and night tending to the newly sprouted moonflower.</p><br/><p>Half a month went by in a flash, and he didn’t leave his residence even once during that time. Meanwhile, the talk around the sect hadn’t died down at all, and the cultivators were watching his residence closely.</p><br/><p>He wasn’t in the mood to eavesdrop; he was completely focused on the moonflower. It was already about a hand high, and even had some tiny leaves. Bai Xiaochun was very happy.</p><br/><p>In terms of the leaf the baby girl had given him, he had already grafted it onto the moonflower. As the moonflower grew, the leaf began to build up frigid qi.</p><br/><p>Everything was going according to plan, and Bai Xiaochun couldn’t help but laugh out loud at how things were going.</p><br/><p>“Hahaha! There’s nothing that Bai Xiaochun can’t figure out how to do!” Feeling more proud of himself than ever, he waited for another seven days to pass. At this point, he started to feel slightly discontent.</p><br/><p>He had come to find that after grafting the leaf onto the moonflower, it was growing much slower.</p><br/><p>“So slow! If things keep going like this, it’ll never get enough frigid qi!” Shaking his head, he contemplated the situation for a bit until he came up with an idea of how to catalyze the plant into faster growth.</p><br/><p>Normally speaking, catalyzing plants was easy to do. There were plenty of methods within the Dao of medicine to do such a thing. The easiest way was to use specific medicinal pills. After thinking about it for a bit longer, he looked around carefully, and then sent his divine sense outside.</p><br/><p>“The four-point covenant says that I can’t concoct pills, or sell them. It doesn't say anything about feeding them to flowers.” With that, he fished around in his bag of holding for a handful of medicinal pills, which he crushed and scattered over the moonflower.</p><br/><p>As soon as the powder landed, the flower twitched and began to glow with bright light. Almost immediately, it began to suck in the powder.</p><br/><p>As it did, the moonflower began to visibly grow faster. In fact, its roots actually extended further down into the cloud.</p><br/><p>That, in turn, allowed it to absorb more frigid qi, which instantly caused the temperature in Bai Xiaochun’s residence to drop.</p><br/><p>Eyes shining with confidence, he took out some more medicinal pills, crushed them, and dropped them onto the moonflower. The moonflower was like a bottomless pit when it came to medicinal pill powder. It continued to grow larger, sending its roots even further down and out, until they filled a 300-meter area.</p><br/><p>Brimming with confidence, Bai Xiaochun continued to feed the plant medicinal pill powder.</p><br/><p>“You like everything! What a precious little flower!” Over the three short days which had passed, the moonflower had consumed over a hundred different types of medicinal pills, and was now over a meter high.</p><br/><p>Its stalk was as thick as an arm, and it had hand-sized leaves. There was also a bud at the top of it which had not yet bloomed. Under Bai Xiaochun’s care, the flower was growing at incredible speed.</p><br/><p>As for the leaf he had grafted onto it, one of its veins now looked like ice, which he was thrilled about. Soon, the moonflower’s roots spread out to fill a 1,500-meter area, which caused Bai Xiaochun’s smile to beam radiantly. Then, he pulled out more medicinal pills and began to crush them.</p><br/><p>If this were the River-Defying Sect or even the Starry Sky Dao Polarity Sect, Bai Xiaochun might have taken some time to think about the effects of the flower on the surroundings. But here in the north, he wasn’t worried about it at all, and in fact, it didn’t even occur to him to check….</p><br/><p>“I'm not violating the four-point covenant!” he told himself. For the following half month, he continuously crushed pills and fed them to the moonflower….</p><br/><p>The moonflower had already reached a shocking height and size, taking up almost all of his residence.</p><br/><p>He couldn’t help but gasp at the sight of it. At the same time, he realized that, thanks to his constant care… the flower looked different from before.</p><br/><p>It almost seemed conscious in a way, and at the same time, apparently liked him. Every time he touched it, the flower would wriggle contentedly.</p><br/><p>When Bai Xiaochun saw that, his eyes glittered.</p><br/><p>“You’re conscious? Alright, be a good flower, now. You need to stop growing, otherwise my room is going to fall apart! Things aren’t easy here in the north, so if you destroyed my house by growing too big, it could really cause some problems.” After offering some more strict warnings, he took out some more medicinal pills to feed the flower. By this point, he didn't even need to crush them. He would just toss them to the flower, which would grab them with its leaves and absorb them directly.</p><br/><p>The flower apparently understood what Bai Xiaochun had told it. From that day on, it didn’t grow any larger within the room. However, its roots continued to expand constantly, voraciously even. By now, its roots had spread throughout the Cloud Order. Furthermore… because moonflowers were not from the Heavenspan Realm, there was something special about them that made them almost impossible to detect. Therefore, no one noticed what was happening.</p><br/><p>However, as it grew, it absorbed more and more frigid qi, to the point where the cultivators in the Cloud Order began to notice that something was off…. First of all was the mere fact that there seemed to be less frigid qi than usual.</p><br/><p>In fact, in some places, the frigid qi was so lacking that the snow began to melt…. Eventually, the devas took notice of what was happening.</p><br/><p>Bai Xiaochun occasionally checked what was happening outside, and when he realized the stir, he patted the moonflower and said, “Moonflower, baby, we don’t have much time left. Sooner or later, something bad’s going to happen. Not that I care about that, but we can’t delay the plan. Is there any way you can grow a bit more quickly? We really need more frigid qi in that leaf.” The moonflower quivered, and sent a very vague message back to him. Bai Xiaochun immediately understood. Eyes shining with determination, he pulled a big stack of medicinal pills out of his bag of holding and began handing them over.</p><br/><p>The moonflower’s leaves eagerly swept up the medicinal pills, after which… a massive rumbling sound filled the entire Cloud Order!</p><br/><p>All of a sudden, green sprouts shot up from the ground all over the Cloud Order. Almost as soon as they appeared, they began to suck in the frigid qi, and at the same time, blossom with tiny flowers that looked like moons.</p><br/><p>Almost immediately, the frigid qi in the Cloud Order experienced a sharp decline!</p><br/><p>The Cloud Order cultivators looked around at the moonflowers, dumbfounded. Within moments, people began to cry out.</p><br/><p>“How could there be plants growing in the Cloud Order?!”</p><br/><p>“What… what kind of flower is that?”</p><br/><p>“Heavens! I’ve never heard of plants appearing in the Cloud Order before…. Aren’t all the plants and vegetation that appear in the north specially adapted for the cold?”</p><br/><p>Soon, the entire Cloud Order was devolving into a huge commotion.</p><br/><p>“It's so hot… why… why am I sweating?!?!?!”</p><br/><p>“Hold on, the frigid qi in the Cloud Order… is so weak!!”</p><br/><p>“Heavens! My igloo, it’s… it's melting!!” </p><br/><p>Because of the sudden decline in frigid qi, the entire Cloud Order was starting to melt. In fact, the resulting liquid began to drip down the arm of the huge ice statue that held up the white cloud.</p><br/><p>The entire sect was soon astir. The devas flew over, expressions of incredulity on their face.</p><br/><p>Before they could even get to the Cloud Order, though, the frigid qi declined so rapidly that all of the ice buildings began to collapse. And that was only the beginning. To everyone’s stupefaction, the thumb of the enormous ice statue, which was now filled with roots… suddenly… began to melt, sending water pouring down the statue….</p><br/><p>That caused the entire white cloud to tilt to one side. As for the devas, they stared at the thumb of the statue in utter shock.</p><br/><p>“Am I… am I seeing things…?” the twin Master Cloud Lightnings murmured.</p><br/><p>Shocked, Feng Chen said, “The pride of the north… the ice statue of the northern battle god… his thumb… is gone?”</p><br/>\n</div>"}