{"title": "Chapter 973: An Answer", "id": 973, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-973-an-answer", "volume_title": "Volume 10", "body": "<h1>Chapter 973: An Answer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>At first, Bai Xiaochun was shocked, but a moment later, a smile split his face.</p><br/><p>“Boo!”</p><br/><p>Even from a distance, Du Lingfei could see that Bai Xiaochun was not injured, and in fact, was jumping up and down in lively fashion. Looking as though she were slightly annoyed by something, she flew down to him.</p><br/><p>“Xiaochun, I can’t believe what you did in the Nine Heavens--”</p><br/><p>“Stop, boo. Stop right there. Let’s just enjoy the happiness of finally being reunited! Don’t even bring up those bastards in the Nine Heavens Cloud Lightning Sect. You have no idea how horrible those people are!” With that, he went on to give a very detailed account of the humiliation he had endured in the sect.</p><br/><p>Du Lingfei sighed. She had originally intended to talk with him about what had occurred, but in the end, she just listened.</p><br/><p>Actually, Du Lingfei had been out on the mission for her father the entire time, and had only returned to the sect a few days before to check on Bai Xiaochun.</p><br/><p>When she arrived, she almost couldn’t believe the situation, and that was even considering how much she knew about Bai Xiaochun and his affinity for causing disasters.</p><br/><p>Furthermore, the disciples in the sect had all given her very strange looks. Therefore, she had gone out to try to find Bai Xiaochun, only to discover that he wasn’t returning any of her messages.</p><br/><p>Eventually, she noticed that one of the ice plains was melting, a curious scene which led her to suspect that Bai Xiaochun might be involved.</p><br/><p>And that was what had led to their reunion.</p><br/><p>Seeing how worked up Bai Xiaochun was getting, Du Lingfei sighed and said, “Alright, alright. I won’t bring it up again. Happy?”</p><br/><p>Then she stepped up to him and began to smooth out his disheveled hair and robes. “I'm almost done with the tasks at hand, but I still have a few things left to do…. You can’t just sit around here, why don’t you come along?”</p><br/><p>She was so close that he instantly caught a whiff of her perfume, causing him to blink a few times in a row. Her skin was as fair as freshly fallen snow, and to have her beautiful face so close to him caused his heart to start beating a bit more rapidly. Although he actually did like the idea of tagging along with her, he also knew that for a true, manly man like himself to be following a woman around wasn’t really proper, unless he was her bodyguard or something similar. Another acceptable reason would be if she asked him several times.</p><br/><p>Sticking his chin up, he said, “I'm doing fine right here. You just go take care of your business.”</p><br/><p>Covering her smile, she looked him up and down. Then she took a step closer and rested her hand on his shoulder.</p><br/><p>“Xiaochun, I’m really very lonely on my own. Come along! Why not?”</p><br/><p>Bai Xiaochun was both very pleased and also quite enjoyed hearing her talk to him like this. However, he maintained his aloof expression.</p><br/><p>“I’ll think about it.”</p><br/><p>Keeping the smile on her face, she lowered her voice a bit and said, “Considering how much that Feng Chen from the Nine Heavens Cloud Lightning Sect is scared of you, as long as I have you around, then he definitely won’t come bothering me. What do you say, Xiaochun?”</p><br/><p>“Well, you got that right!” he replied, feeling even prouder of himself than ever. “If that Feng fellow dares to appear in my presence, I’ll beat him to death! He’s already lost his fleshly body, and exists only as a divine soul. If Master Cloud Lightning and the other devas hadn’t stopped me, I would already have killed him!” With that, he laughed heartily. “Ah, whatever. Since you put it that way, I guess I might as well join you. That will be the easiest way to keep you safe.”</p><br/><p>At this point, Du Lingfei couldn’t hold back any longer, and started laughing. “Of course, of course. My Xiaochun is the most awesome of all. He dared to call the Celestial his father-in-law right to his face….”</p><br/><p>Bai Xiaochun suddenly felt a bit awkward.</p><br/><p>“Well if you want to be my bodyguard,” she said, casting a seductive glance at him as she turned, “then you’d better keep up….” That got Bai Xiaochun’s heart beating even faster. He had always assumed that Song Junwan was the greatest vixen of all, but as it turned out, the seemingly-upstanding Du Lingfei was actually even worse.</p><br/><p>“Get back here, you demoness!” he said loudly, hurrying after her.</p><br/><p>Laughter rang out across the ice plains as the two of them made their way off into the distance.</p><br/><p>It was almost as if they were back in the Spirit Stream Sect…. Above them stretched an azure sky, and around them, endless fields of ice. They were the only living beings visible as they traveled along in that world of silver whiteness.</p><br/><p>Occasionally they would laugh, and occasionally they would lower their voices as they spoke of serious matters. They talked about their experiences and their stories. Eventually, that sense of distance that Bai Xiaochun had felt was gone.</p><br/><p>Du Lingfei was once again the same <em>boo</em> that he remembered from years ago….</p><br/><p>A month later, when they were in the depths of the ice plains, Bai Xiaochun couldn’t hold back from asking a question that had been on his mind for a long time.</p><br/><p>“Boo, what is this mission that dad sent you on?” From the direct way he asked the question, he didn’t seem to feel that it was an inappropriate topic at all.</p><br/><p>“You know,” Du Lingfei said with an enigmatic smile, “I’d really like to see you address him that way the next time you see him in person.”</p><br/><p>Bai Xiaochun laughed dryly. He very much wanted to thump himself on the chest and declare that he absolutely would dare to do exactly that. However, whenever he thought about that blood-hair that he had absorbed, he couldn’t help but feel guilty and nervous. Clearing his throat, he once again asked about what Du Lingfei was doing in the north.</p><br/><p>Du Lingfei was hesitant to answer the question. Her mission was top secret, and the details were not to be discussed. However, Bai Xiaochun’s curious expression got the better of her.</p><br/><p>“I’ll tell you, but you have to promise not to tell anyone else….” Lowering her voice, she continued, “My father sent me here to investigate… some things connected to my Eldest Sister….”</p><br/><p>“You have an Eldest Sister?” Bai Xiaochun said, sounding surprised. Of course, he immediately thought back to the baby girl.</p><br/><p>“You see,” Du Lingfei said, “The Nine Heavens Cloud Lightning Sect wasn’t always the riversource sect here in the north. There used to be another sect called the Frigid School! The demigod matriarch of the Frigid School… was my father’s top apprentice. That’s why I call her Eldest Sister.</p><br/><p>“The Frigid Matriarch betrayed my father, and committed some heinous crimes. Because of their Master-apprentice relationship, my father intended to capture her, not kill her. However, she turned out to be the epitome of malevolence, and continued to plot against him. In the end, it was to his great bitterness that he realized he had to kill her….” Of course, these were things that Du Lingfei had only heard about, not witnessed personally.</p><br/><p>“However, my Eldest Sister was a person of spectacular talent and ability. Years later, my father began to suspect that something peculiar had occurred. Therefore, he sent me here, to where the Frigid School had once existed, to perform a thorough investigation…. He wants to know whether or not that Eldest Sister really did die!</p><br/><p>“The truth is that I’ve been investigating this matter for many years now…. In fact, that’s why I was in the Spirit Stream Sect. The Spirit Stream Sect… was originally founded by the surviving disciples of the Frigid School, who escaped to the east to start a new sect.” She looked over at Bai Xiaochun, who was secretly shaken to the core that she was here in the north because of the baby girl!</p><br/><p>Also, he now understood why the daughter of the mighty Celestial had been in the Spirit Stream Sect!</p><br/><p>“But what were you doing in the trial by fire for blood master in the Blood Stream Sect?” Looking over, he asked another question that had been burning in his heart for a very long time.</p><br/><p>Du Lingfei took her time to respond.</p><br/><p>“Because… the Blood Stream Sect’s Blood Ancestor was… the Daoist partner of my Eldest Sister! If my speculations are correct, the Blood Ancestor died, but my Eldest Sister didn’t. And most likely, she would want to accompany her husband after his death….”</p><br/><p>Her words struck Bai Xiaochun’s mind like countless bolts of lightning. All of a sudden, so many things were made clear.</p><br/><p>Why had the Celestial left the Blood Ancestor in place for so many years?!</p><br/><p>Why had the spell formation protecting the baby girl in the depths of the Spirit Stream Sect been weakened after Du Lingfei left the sect?!</p><br/><p>He now knew the answers to those questions.</p><br/><p>However, there was still one big question that he didn’t know the answer to, and didn’t dare to ask right now…. Why had the Celestial sent his daughter to investigate these matters, instead of doing it himself?</p><br/><p>Considering the shocking level of the Celestial’s own cultivation base, he could easily turn the world upside down to get the information he wanted!</p><br/><p>Furthermore… was the Celestial truly unaware of the existence of that baby girl….</p><br/>\n</div>"}