{"title": "Chapter 985: Thrashing The Old Ghost....", "id": 985, "volume": 10, "url": "http://boxnovel.org/a-will-eternal-chapter-985-thrashing-the-old-ghost", "volume_title": "Volume 10", "body": "<h1>Chapter 985: Thrashing The Old Ghost....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As soon as the ghost face heard those words, he shivered, causing countless streams of black smoke to spread out in all directions.</p><br/><p>However, after a long moment passed, and Bai Xiaochun still hadn’t come out from the wind valleys, the ghost face looked over in shock, then began to curse inwardly.</p><br/><p>Back in the wind valleys, Bai Xiaochun cleared his throat, savoring the feeling of his breakthrough, and the majestic cultivation base power that he now possessed.</p><br/><p>“Late Deva Realm!!” he thought. “I, Bai Xiaochun, am finally in the late Deva Realm!”</p><br/><p>Eyes shining with excitement, he once again raised his voice and said, “Alright, you old ghost. Lord Bai is really coming for you this time!”</p><br/><p>Outside, the ghost face’s expression turned dark with rage. However, since he was made from black smoke, it was difficult to see how dark it actually was….</p><br/><p>By now, Bai Xiaochun could tell that he could reach the eighth of the Cloud Lightning Forefather Transformations.</p><br/><p>“My eighth transformation is actually equivalent to the eleventh!” Although he couldn’t say that he was invincible in all creation, he was definitely close.</p><br/><p>“And my Undying Blood….” Licking his lips, he studied his Undying Blood, and confirmed that he had broken through in that regard as well. As of this moment, sixty percent of the blood in his body was Undying Blood!</p><br/><p>That made his powers of regeneration even more shocking than before. In terms of his own life force, he was now fairly certain that, even if heaven and earth were destroyed around him, he would not be destroyed.</p><br/><p>“This is unheard-of strength!” he thought, feeling more confident in himself than ever. “Nobody under the level of a demigod could beat me!”</p><br/><p>In his pride, he couldn’t help but raise his voice again…. “Alright, old ghost, this time, I really am coming over there!”</p><br/><p>At that point, his eyes suddenly flickered.</p><br/><p>“Why isn’t the old ghost responding to me? It seems his cultivation base really must be dropping….” During the time he had been working on reaching the late Deva Realm, he hadn’t stopped paying any attention to things outside of the wind valleys.</p><br/><p>Because of that, he could sense that, thanks to the pressure of the magical item, the ghost face’s cultivation base had dropped. That, coupled with his taunts from earlier, confirmed everything.</p><br/><p>Eyes shining with determination, he shot into motion, leaving the wind valleys and appearing in the world beyond them.</p><br/><p>Bai Xiaochun seemed like the wind itself, a hurricane that blasted across the lands with explosive power.</p><br/><p>Although he looked quite impressive, he was actually being very cautious, and was ready to fall back at a moment’s notice. But after emerging into the open and blinking a few times, he realized that the ghost face was nowhere to be seen.</p><br/><p>Eyes lighting up, he sent some divine sense out, causing heaven and earth to distort from the sheer force. Within moments, the entire world of the magical item was visible via his late Deva Realm divine sense.</p><br/><p>It only took a moment before he found the ghost face, fleeing in the opposite direction.</p><br/><p>The instant Bai Xiaochun’s divine sense locked onto him, he confirmed that he had dropped into the late Deva Realm.</p><br/><p>Bai Xiaochun immediately roared with laughter, causing all of the anxiety that had built up since he had arrived in the magical item to drain away. He suddenly felt carefree and excited as he began to give chase.</p><br/><p>“Want to race with Lord Bai, eh, you old ghost?” With that, he drew upon the full power of his cultivation base, using the Undying Hex and the Mountain Shaking Bash together to rocket through the air and appear right behind the ghost face.</p><br/><p>The ghost face’s expression was unsightly to the extreme, and fury burned in his heart. Even as he fled in absolute disgrace, he opened his mouth and shouted, causing countless smoke mouths to suddenly shoot toward Bai Xiaochun.</p><br/><p>Shocked, Bai Xiaochun backed up and performed a double-handed incantation gesture, sending frigid qi out to meet the gaping mouths.</p><br/><p>As soon as the two met, the seemingly shocking mouths collapsed into bits of black smoke. Meanwhile, the blast of frigid qi proceeded directly toward the ghost face.</p><br/><p>Cursing bitterly, the ghost face continued to flee. In contrast, Bai Xiaochun’s eyes were shining brightly. Laughing heartily, he clenched his right hand into a fist and punched out.</p><br/><p>Rumbling booms filled the area as the blow hit the ghost face, causing the smoke he was composed of to roil unstably.</p><br/><p>“Don’t push things too far, Bai Xiaochun!”</p><br/><p>“Do you dare to fight with Lord Bai, you old ghost?!?!” With that, he used the eighth Cloud Lightning Forefather Transformation, growing to a height of 240 meters and bursting with energy.</p><br/><p>The moon sigil in his left eye shone radiantly, pushing his battle prowess to even higher heights. Although he wasn’t quite at the demigod level, he was certainly very close.</p><br/><p>Waving his hand, he attacked again, and the ghost face was powerless to fight back. The situation between the two of them had been completely reversed, and despite the fact that the ghost face had known this would happen, it was still difficult to accept it. A boom rang out, and the ghost face was shattered by Bai Xiaochun’s fist strike.</p><br/><p>The innumerable strands of black smoke quickly formed back into the image of the ghost face, who was experiencing something he had never before experienced. Long ago, Ghostmother had relied on the backing of an archaean to capture him, and had also treated him very politely. Here… Bai Xiaochun, a person the ghost face could crush easily were his cultivation base not suppressed, was smacking him around with deadly force.</p><br/><p>The ghost face was so angry that his voice quavered as he shouted, “Don’t force my hand, Bai Xiaochun!!”</p><br/><p>“Fudge, I'm not forcing you to do anything. I'm just beating you!” Bai Xiaochun felt wonderful at having all the stress from before melt away, to be replaced by remarkable joy. Shouting at the top of his lungs, he strode forward and unleashed another fist strike.</p><br/><p>More booms rang out.</p><br/><p>“Who forced you to try to kill me before?!?!” Another fist strike!</p><br/><p>The ghost face couldn't dodge out of the way in time. No amount of shrieking or divine abilities or magical techniques did any good. Yet again, his body collapsed, to be reformed a moment later.</p><br/><p>“Who forced you to chase me into this place?!” Bai Xiaochun struck out with his fist again!</p><br/><p>“Who forced you to keep chasing me once we got stuck inside?!?!</p><br/><p>“I ran into that thundercloud region, and you still wouldn’t let me go!</p><br/><p>“The lightning dispersed, and you started chasing me again!” He emphasized everything he said with a fist strike, each of which caused the ghost face to shatter and reform.</p><br/><p>“I'm gonna kill you, Bai Xiaochun!” the ghost face howled madly. Finally, he couldn't take it anymore, and lunged at Bai Xiaochun.</p><br/><p>However, before he could get close, Bai Xiaochun leaned back and kicked out, planting his foot directly onto the ghost face.</p><br/><p>“Quite the bragger, aren’t we? Still think you can kill me?!” The ghost face broke apart and then formed back together, whereupon Bai Xiaochun shattered him again.</p><br/><p>Finally, he reached out, grabbed the ghost face by his smoke hair, and smashed him down onto the ground. He wasn’t even using divine abilities, only his fleshly body power, and the force of the Cloud Lightning Forefather Transformation.</p><br/><p>Screams rang out as Bai Xiaochun trampled on the ghost face, which shattered and reformed the entire time. Eventually, it burned some life force to try to flee.</p><br/><p>Flicking his sleeve, Bai Xiaochun stuck his chin up and proudly said, “Think you can just run? If I don’t beat the crap out of you until you cry uncle, then my name isn’t Bai Xiaochun!”</p><br/><p>With that, he continued to give chase.</p><br/>\n</div>"}