{"title": "Chapter 1005: A Second Chance", "id": 1005, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1005-a-second-chance", "volume_title": "Volume 11", "body": "<h1>Chapter 1005: A Second Chance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“The Undying Codex truly is extraordinary!” When the Celestial saw how Bai Xiaochun was able to fight back against someone vastly more powerful than himself, and consistently regenerate despite his injuries, he was quite moved.</p><br/><p>“Thankfully, this isn’t my first time encountering someone who has mastered the Undying Codex….” Back on Heavenspan Island, the Celestial’s eyes suddenly flickered with a crystalline glow.</p><br/><p>As he did, Du Lingfei shivered. Even as she stood there, as mute and numb as the walking dead, a crystalline light suddenly shot out from the depths of her eyes, and the two bizarre magical symbols that existed there.</p><br/><p>There was a strange power inside of her that the Celestial seemed capable of drawing upon because of those magical symbols. Back outside of Giant Ghost City, as his hand remained closed around Bai Xiaochun, a crystalline glow suddenly appeared.</p><br/><p>In the blink of an eye… the entire hand turned crystal, and then crushed down harder!</p><br/><p>Rumbling sounds echoed out as Bai Xiaochun, his hair wild and disheveled, called out to the world treasure of the north. Unfortunately, the Frigid Matriarch was still sleeping, and didn’t respond. Worse, it seemed that because of the incredible pressure weighing down on him, his regenerative powers were faltering!</p><br/><p>Whatever magical technique was involved with this crystal seemed to be at complete odds with the Undying Codex!</p><br/><p>Without his regenerative powers working fully, Bai Xiaochun couldn’t stand up to the raw power of the Celestial. A popping sound rang out, and he was crushed!</p><br/><p>At that point, he couldn’t remain conscious, and passed out.</p><br/><p>The Celestial began to slowly retract his hand. As it headed back toward the vortex… everyone in the area looked on, completely shaken.</p><br/><p>Devas and demigods alike were completely floored!</p><br/><p>Everyone from the River-Defying Sect was trembling, and many of them had their hands clenched tightly into fists at their sides. Song Junwan’s face was wet with tears, and yet there was nothing she could do except watch while everything happened. When the vortex disappeared, she coughed up a mouthful of blood and then toppled forward, unconscious.</p><br/><p>As the Celestial’s hand vanished, his voice rang out to fill the Wildlands, cold and emotionless in all aspects.</p><br/><p>“All Heavenspan cultivators are to join forces… and exterminate every living thing in the Wildlands!”</p><br/><p>The Celestial did not like being in a passive position. He preferred to be in control. That much was possible to see from how things had played out with the bone galleon.</p><br/><p>This current matter was playing out exactly the same. All of his hopes were wrapped up with Bai Xiaochun, and although he was only about eighty percent confident in being able to succeed, that didn’t mean he would let his guard down. Since there were still two paths available… he would leave both open to pick from!</p><br/><p>“If neither path works… then since my longevity is running out, I will just bury this world along with me!” With that, his hand vanished completely.</p><br/><p>The cultivators from the Heavenspan region were shaken. However, no matter how tired they were from all the fighting, they had to follow the orders of the Celestial. And of course, there were some who were very enthusiastic about following such orders, and immediately began to fight with murderous fervor!</p><br/><p>The morale of the Wildlanders had suffered a severe blow upon the defeat of the gravekeeper. From what they could tell, there was absolutely no way out for them now….</p><br/><p>The lands of Heavenspan would accept no captives. The Celestial wanted everything in the Wildlands dead, all the way down to the grass and the roots!</p><br/><p>Savages and soul cultivators alike, even the animals, would all be killed.</p><br/><p>The only choice the Wildlanders had now… was to fight to the death!!</p><br/><p>The sound of battle resumed, accompanied by bitter chuckling, roaring laughter, and the sounds of self-detonation…. Blood once again began to stain the ground, and the death count rose…. It seemed as if the end of days had come; the sky was dark, and the lands were shattered. It wouldn’t take long before Giant Ghost City fell, as well as the other three kingly cities. When that happened, the Wildlanders would be forced to retreat… all the way to Arch-Emperor City!</p><br/><p>**</p><br/><p>Far beneath the surface of Heavenspan Island was… an enormous necropolis!</p><br/><p>In the depths of the necropolis was a pool of black liquid surrounded by a huge spell formation, fully 30,000 meters from side to side. It was a spell formation created, not by spirit stones, but by human bones!</p><br/><p>Some of the bones were golden, and some were crystalline… and despite being dead, all of them seemed to radiate an air of holiness!</p><br/><p>Around the perimeter of the pool of liquid were three deep pits, each of which contained a skeleton!</p><br/><p>Shockingly, all of those skeletons were partially gold and partially crystal. Although none were perfectly fused together, the pressure they emitted was enough to cause even demigods to tremble. That pressure… was extremely close to the level of the quasi-celestial Daoist Heavenspan.</p><br/><p>Although none of them were quite as powerful as him, all of them were only about half a step from being in the true Mahayana Realm!</p><br/><p>If the reigning Arch-Emperor were able to see this place, he would instinctively recognize who those three corpses were.</p><br/><p>They were… the remains of the three most powerful Arch-Emperors of the past!</p><br/><p>Clearly, the Celestial had located their sepulchers and exhumed their skeletons, then used them to create the most ultimate of spell formations!</p><br/><p>The rotting, holy bones had been collected throughout the years from people who had cultivated either the Undying Codex or the Live Forever Codex!</p><br/><p>In the very middle of the spell formation, within the black pool of water, Bai Xiaochun sat cross-legged, his eyes closed. He was breathing, but not conscious. The water swirled slowly around him, rippling as magical symbols slowly floated about within.</p><br/><p>The magical symbols almost seemed alive, and many of them would crawl up onto Bai Xiaochun and move around on the surface of his body.</p><br/><p>It was a very ghastly scene, made even worse by the flickering lamps which lit the area.</p><br/><p>All of a sudden, Bai Xiaochun shivered, and then opened his eyes. As soon as he did, the magical symbols that had been crawling all over him flew back into the water, apparently having been startled.</p><br/><p>At first, his expression was blank. However, as he breathed, his eyes began to glitter. Then he looked around at the pool of water, and the bones that made up the spell formation.</p><br/><p>He wanted to rise to his feet, but soon found that he couldn’t control his own body. It was impossible for him to leave the pool of water. Apparently, the energy of the Undying Codex and Live Forever Codex in the bones around him created an aura that disturbed his mind.</p><br/><p>At that point, a raspy voice filled the air. “Don’t struggle. This pool of water… is made from the blood of countless descendants of the Arch-Emperor, back when I drove his dynasty out of the lands of Heavenspan. It's been fermenting here for many, many years.” Bai Xiaochun then saw the air up ahead ripple, and the Celestial walk slowly out into the open.</p><br/><p>The Celestial’s eyes burned with excitement and anticipation as he looked at Bai Xiaochun, as if he were some consummately important medicinal pill to be consumed.</p><br/><p>Panting, Bai Xiaochun looked at the Celestial, his heart pounding with foreboding. Just when he was about to say something, the Celestial looked around at the bones and kept talking.</p><br/><p>“I killed many of these people myself in the final battle at Arch-Emperor City. And some… are cultivators I ran tests on after I started researching the Undying Live Forever Technique.</p><br/><p>“Sadly, despite the fact that the Undying Live Forever Technique is something that anyone can cultivate, for some reason, I am not able to. Perhaps it's because I've killed so many people with the blood of the Arch-Emperor in them.</p><br/><p>“I can only research it by having other people cultivate the technique. I even exhumed the corpses of these three Arch-Emperors, and brought their skeletons here to learn a thing or two from them.</p><br/><p>“You see, I stole the Live Forever Codex from the Arch-Emperor Dynasty. And as for the Undying Codex, the gravekeeper made it public for some reason. Perhaps it was an attempt to resist me, or perhaps an attempt to continue the line of the Arch-Emperor Dynasty. In any case, I added fuel to the fire by making sure the Undying Codex was available in the lands of Heavenspan as well…. The trickiest thing was the Live Forever Codex. It is very, very difficult to cultivate. In fact, few people have ever managed to master it. Most would fail along the way, after which I would place their remains in here to make the best use of them.</p><br/><p>“Over all the years, only two people have ever completely cultivated it. One of them was an apprentice of mine, and the other… is my daughter.” By this point, the Celestial didn't really seem to be talking to Bai Xiaochun, but rather, muttering to himself.</p><br/><p>As Bai Xiaochun listened, his shock mounted until he felt like his head was being struck by lightning. After seeing Du Lingfei’s bones years ago, he had already begun to suspect the truth. But to hear the Celestial say it out loud was a different matter.</p><br/><p>“Sadly, I wasn’t quite prepared last time. Furthermore, my apprentice discovered what was going on. Therefore, my first attempt to concoct an Undying Live Forever Pill was a failure before I even started. But that doesn’t matter. I have a second chance now….”</p><br/><p>With that, he turned to look at Bai Xiaochun with glittering eyes.</p><br/><p>“Fei’er,” he said.</p><br/><p>At that point, Du Lingfei stepped out from behind the Celestial.</p><br/><p>Upon seeing Du Lingfei, a bitter smile spread out across Bai Xiaochun’s face. He understood. He understood everything….</p><br/>\n</div>"}