{"title": "Chapter 1004: Your Destiny!", "id": 1004, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1004-your-destiny", "volume_title": "Volume 11", "body": "<h1>Chapter 1004: Your Destiny!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As the two voices echoed out through heaven and earth, it felt very much like the last time the Celestial and the gravekeeper had fought each other. And this time, they were fighting a battle the likes of which could end the world!</p><br/><p>The Celestial was returning to the Wildlands in much different circumstances than when he had left. He had recovered from his injuries. Furthermore, the gravekeeper was now extremely exhausted.</p><br/><p>However… despite how weak he was, he was still the gravekeeper!</p><br/><p>As the enormous hand stretched up from the earth and slammed into the Celestial’s hand, a massive shockwave rippled out. The sky went dark, and tempests screamed across the lands. Yet again, a certain limit of power was reached, and the protective world net appeared up above!</p><br/><p>As the net appeared to fill the sky, Bai Xiaochun’s expression flickered. He could clearly sense that because of everything that the world net had experienced throughout the years, it was weakening in many places.</p><br/><p>Because of the explosive power being unleashed by the gravekeeper and the Celestial, the only people who could remain in the area were Bai Xiaochun, the Giant Ghost King, and Patriarch Starry Sky.</p><br/><p>Only those three could bear witness to the shocking spectacle of the Celestial and the gravekeeper fighting!</p><br/><p>However, Bai Xiaochun didn’t wish to remain behind. He actually borrowed the momentum of the blast to fall back. The Celestial’s hand shifted as if to follow him, but the gravekeeper’s hand moved to intercept it again.</p><br/><p>The cultivation base power backing those two gargantuan hands vastly surpassed the Demigod Realm. They were in the Mahayana Realm, which was also referred to by some as… the Celestial Realm!</p><br/><p>Years ago, Ghostmother had mentioned that Daoist Heavenspan called himself “the Celestial”, but was in fact only a quasi-celestial. Even still, he could unleash power that could change the face of heaven and earth. Therefore, not only did Bai Xiaochun attempt to flee the area, but the Giant Ghost King and Patriarch Starry Sky also began to back away.</p><br/><p>They could all tell that the gravekeeper was on his last legs, and wouldn't be able to hold out for very much longer. Patriarch Starry Sky hesitated for a moment as he considered whether or not to stop Bai Xiaochun from fleeing. However, considering how the Giant Ghost King was glowering at him, he simply sighed and decided not to make things complicated….</p><br/><p>After all, even he was a bit frightened by the sudden and unexpected appearance of the Celestial.</p><br/><p>“You are weak, gravekeeper,” the Celestial said, his voice laced with arrogance. “You should be in the Underworld River, waiting to die. How dare you show up here and try to interfere with my plans!” The golden light of Heavenspan River water shone out in all directions as the Celestial’s hand once again shot toward the gravekeeper’s hand.</p><br/><p>As the resulting boom echoed out, and Bai Xiaochun accelerated in the opposite direction, a fourth boom could be heard. Looking over his shoulder, he was shocked to see that the earthly hand of the gravekeeper was collapsing into pieces.</p><br/><p>As for the Celestial’s golden hand, it once again filled all heaven and earth as it headed toward Bai Xiaochun.</p><br/><p>“You can’t escape, Bai Xiaochun…. The gravekeeper is forcing me to do this…. It is not my wish, but I have no choice. Therefore… you will submit, and become the medicinal pill I need!”</p><br/><p>Bai Xiaochun knew that he couldn’t escape, and as he stared back at the Celestial’s enormous hand, he had no time to think of anything other than fight!</p><br/><p>“Godkiller!!” Eyes bloodshot, he called upon the trump card that came with his Undying Blood. Now that he had mastered the Undying Codex, he could control the Godkiller technique, and would not lose consciousness when using it.</p><br/><p>As blood qi surged in his body, and he accelerated rapidly, the Celestial laughed coldly.</p><br/><p>“The Arch-Ancestor's secret Undying Codex…. If you had the Live Forever Codex, then not even I would be able to fight you…. But without it, you have no way of escaping the destiny I have prepared for you!” The enormous hand formed from Heavenspan Seawater sent golden light shining out that suppressed Bai Xiaochun’s blood qi and completely ignored the Godkiller technique.</p><br/><p>“Damn you, Celestial!!” Bai Xiaochun howled, throwing his hands out in front of him. Instantly, water vapor erupted out in all directions, turning the area into a huge swamp. Suddenly, a howl erupted into the air that seemed to come from the ancient past, a howl that combined with Bai Xiaochun’s shout to shake everything in the area.</p><br/><p>Curved mountain peaks rose up from that swamp, the manifestation of none other than… the Waterswamp Kingdom.</p><br/><p>Bai Xiaochun’s cultivation base now was in the great circle of the Deva Realm, which meant that his Waterswamp Kingdom was vastly more powerful than before. As the mountain peaks arced through the air, a huge beast hand appeared in full, rushing to meet the golden hand of the Celestial.</p><br/><p>Unfortunately… the fact that Bai Xiaochun was a deva meant that he was vastly below the Celestial. When the Waterswamp Kingdom met the Celestial’s hand, a huge boom echoed out. The Celestial snorted coldly, and the beast hand shattered. A howl of pain and rage erupted out from the watery swamp, which roiled violently, as if the creature inside wished to free itself.</p><br/><p>But the Celestial’s hand was too powerful. Thrumming with energy, it continued onward toward Bai Xiaochun!</p><br/><p>Soon, the entire 5,000-kilometer-area around Bai Xiaochun was nothing more than that hand, closing around him!</p><br/><p>The air shattered as though it were corporeal, causing cracking sounds to echo out. Meanwhile, Bai Xiaochun’s vision was obscured, allowing him to see only the five, mountain-like fingers surrounding him.</p><br/><p>Compared to the size of that hand, he was like nothing more than a bug!</p><br/><p>If the world were likened to a sea, then the Celestial’s hand would be reaching down into that water to pick up the tiny shrimp larva that was Bai Xiaochun.</p><br/><p>There was literally nothing he could do to fight back or resist!</p><br/><p>Blood sprayed out of his mouth because of the intense pressure weighing down on him, and cracking sounds rang out as his bones began to shatter. The watery swamp around him was thoroughly defeated by the golden hand, and simply collapsed!</p><br/><p>There was simply no way for Bai Xiaochun to escape, and as such, a feeling of despair began to grip his heart.</p><br/><p>However, even as the hand closed in around him… black water suddenly appeared out of nowhere!</p><br/><p>In the blink of an eye, it created a shocking Underworld River! A stream of energy erupted from the river, wrapping around Bai Xiaochun as if to take him away.</p><br/><p>“The new Hell-Emperor?” the Celestial said. “If you had 10,000 years to prepare, you might qualify to face me, but right now… you’re simply courting death!” The Heavenspan Seawater that made up the enormous hand exploded, creating a powerful attack that slammed into the Underworld River and crushed it. Bai Xiaochun could even hear a muffled cry of anguish and pain from Bai Hao.</p><br/><p>“Hao’er!!”</p><br/><p>In the blink of an eye, the Heavenspan Seawater overwhelmed the Underworld River water and drove it away. The only thing left was the Celestial’s huge hand, closing in around Bai Xiaochun!</p><br/><p>As it closed into a fist, it seemed prepared to crush anything within its grasp out of existence!</p><br/><p>In that moment, Bai Xiaochun went mad. Although he was already grievously injured, his powers of regeneration defied imagination. Without any hesitation, he resorted to the Cloud Lightning Forefather Transformation!</p><br/><p>“Eleventh Transformation!!”</p><br/><p>As he grew larger, rocks began to fly toward him as he used… the Living Mountain Incantation!</p><br/><p>His fleshly body power skyrocketed, combining with his cultivation base to somehow manage to keep him going. However, he couldn’t hold on for very long. A moment later, his Forefather Transformation and Living Mountain Incantation collapsed, and he was badly injured. With his regeneration powers, he recovered, but in a moment, was back to being injured.</p><br/><p>It was a seemingly endless cycle. In the briefest of moments, he went back and forth from being injured to his peak state about a hundred times! And there seemed to be no end in sight!</p><br/>\n</div>"}