{"title": "Chapter 1002: The Hand Of The Celestial", "id": 1002, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1002-the-hand-of-the-celestial", "volume_title": "Volume 11", "body": "<h1>Chapter 1002: The Hand Of The Celestial</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Patriarch Starry Sky couldn’t help but feel a bit depressed about the situation. After all, under normal circumstances, Bai Xiaochun would be so far beneath him that he would likely be able to kill him, given enough time.</p><br/><p>But… these were not normal circumstances. Bai Xiaochun’s terrifying powers of regeneration essentially negated any injuries. And although his divine abilities and magical techniques were not impossible to defend against, getting hit with them over and over again was profoundly frustrating.</p><br/><p>“Fighting with him isn’t worth it…. You can’t even hurt him!” Patriarch Starry Sky sighed, fairly certain of how the fight would end if it continued to play out.</p><br/><p>With that, he flickered into motion, falling back a bit while his divine soul returned to his body. Clearly, he was agreeing to a ceasefire while here outside of Giant Ghost City.</p><br/><p>When Bai Xiaochun saw that, he sighed, and then looked over at the Giant Ghost King.</p><br/><p>“Now it’s your turn, Giant Ghost, old pal.”</p><br/><p>The Giant Ghost King smiled wryly and shook his head, feeling very much the way that Patriarch Starry Sky did.</p><br/><p>“No, I’ll do whatever you say. A cease fire it is….”</p><br/><p>With the two demigods having made their decision clear, the cultivators on the battlefield began to back away from each other, mixed emotions on their faces.</p><br/><p>The cultivators from the River-Defying Sect likewise stood down. As for the disciples from the Spirit and Blood Stream Divisions, they couldn’t help but think back to how Bai Xiaochun had single-handedly stopped a battle between their sects all those years ago.</p><br/><p>“But can he really stop this war…?” Patriarch Spirit Stream thought.</p><br/><p>When Bai Xiaochun saw the two sides backing away from each other, he sighed in relief. At the same time, the hope in his heart grew stronger.</p><br/><p>“Stopping this battle is only the first step. The next thing I need to do is go talk to the gravekeeper….” Having reached this point in his train of thought, he turned to leave. However, it was at that point that the entire world shuddered, and massive pressure suddenly began to weigh down on the entire area!</p><br/><p>The cultivators from both sides of the conflict were all shocked. Everyone, including the Giant Ghost King and Patriarch Starry Sky, all looked up into the sky.</p><br/><p>There, high above everyone’s heads, was… a gigantic eye!</p><br/><p>The enormous eye was looking down at the battlefield, and specifically… at Bai Xiaochun!</p><br/><p>The presence of the eye made the pressure weighing down seem even more intense. All of a sudden, the countless cultivators down below began to tremble, and felt terror rising up from within their very souls. In fact, they were so shaken that their minds went completely blank.</p><br/><p>It was as if the entire world had gone still, and ceased to exist. The only thing that existed was that gigantic eye!</p><br/><p>The gaze of the eye was cold to the extreme, like the biting freezing iciness of winter!</p><br/><p>It was a gaze that could pierce through anything, and could see into the hearts and minds of everyone, even the devas.</p><br/><p>The powerful Giant Ghost King was actually panting as a result of the eye.</p><br/><p>“The Celestial….” he murmured, backing up, a look of madness appearing in his eyes. He rotated his cultivation base immediately, as though the gaze of that eye put him in such unprecedented danger that he instinctively had to protect himself from it.</p><br/><p>Patriarch Starry Sky was shaking visibly, but in contrast to the Giant Ghost King, he immediately bowed formally to the eye.</p><br/><p>Bai Xiaochun looked up, his aura already unstable, his entire person trembling in terror. He could already tell that the Celestial was more powerful than the last time he had seen him in the north. Although he still was not back to the level he had been when he had fought the gravekeeper, he was close.</p><br/><p>Clearly, acquiring the clone of the laughing-crying ghost face had been of great benefit to his recovery.</p><br/><p>“Well met… Celestial.” Bai Xiaochun felt as if the Celestial could see every aspect of him, inside and out. Thankfully, he wore the World Raiment, and thus somehow had a bit of the will of the world with him. Because of that, he was able to resist the assault of the gaze to some degree. Clasping hands respectfully, he bowed.</p><br/><p>In response to his bow, the gaze of the Celestial suddenly changed. Instead of being ice cold, it became warm in a way that Bai Xiaochun had never experienced before. “Bai. Xiao. Chun….”</p><br/><p>When the Celestial spoke, his voice contained… something encouraging, as well as other mixed emotions!</p><br/><p>Not only could Bai Xiaochun detect those mixed emotions, but the others in the area could as well.</p><br/><p>Far, far away from Giant Ghost City, in the middle of the Heavenspan Sea, right on Heavenspan Island, there at the peak of the mountain, in the Palace of the Dao, the sound of heavy breathing could be heard. Also, two eyes lit up with the brightness of suns.</p><br/><p>The aura of the entire world seemed to tremble as those eyes looked out, and waves began to surge on the surface of the Heavenspan Sea.</p><br/><p>“So… he’s appeared. Of all the times to show up, he picks now.” The Celestial sat cross-legged in the Palace of the Dao, a blood-colored flag stretched out in front of him, within which was the sealed soulclone of the ghost face. The laughing-crying appearance of the face inside the flag was bizarre, to say the least.</p><br/><p>“So those fluctuations I sensed really did indicate that someone mastered the Undying Codex. This Bai Xiaochun… actually did it!</p><br/><p>“He’s ready…. I don’t need to push him anymore. He’s truly ready, even before I've made my final decision….</p><br/><p>“It seems… that when he went missing, he must have gone into hiding somewhere in the north…. And that apprentice of mine is not dead after all… although that's not important now….</p><br/><p>“I really don’t want to take that final step…. She’s my only flesh and blood, after all….” Looking torn, the Celestial cast his gaze out of the Palace of the Dao in the direction of one of the other mountain peaks on Heavenspan Island. Standing there was Du Lingfei, who seemed so forlorn that she was like a mere husk of her old self, as if her divine soul was dead, and only her physical body remained.</p><br/><p>“The war is nearing its end… and I'm not sure if I’ll be able to open the Worldgate. After that damned gravekeeper perishes, will I be able to open the door on my own? Or will it remain closed for all eternity because of his departure? There’s no way to tell ahead of time….</p><br/><p>“Perhaps… this really is my last chance… and my best possibility to succeed… an opportunity just waiting to be taken advantage of….” After a long moment passed, the Celestial’s eyes turned as red as blood, and his expression twisted ferociously.</p><br/><p>“I have to get out of here! Even if the price were higher, I would still pay it. Considering my talents and qualifications, if I were in the world beyond, I could easily make another breakthrough. Then I would reach the true Mahayana Realm. In fact, the Archaean Realm might not even be impossible to reach!</p><br/><p>“And my current longevity… can no longer be increased by the use of longevity pills….” His expression twisted into an even more ferocious display of determination and madness. Having made his decision, he rose to his feet.</p><br/><p>“You’re forcing me to do this, gravekeeper!” He threw his head back and roared, causing the entire world to tremble. The waves on the Heavenspan Sea reached frightening heights. As for Du Lingfei, she shivered, and tears began to stream down her face…. If one looked closely, it would be possible to see two magical symbols hovering deep within her vacant eyes….</p><br/><p>“Xiaochun… I'm sorry….” she murmured, her face as pale as death as tears streamed down her cheeks.</p><br/><p>In that moment, the Celestial reached out in the direction of Giant Ghost City and made a grasping motion!</p><br/><p>A massive vortex sprang into being, with one side on Heavenspan Island, and the other… in the air above Giant Ghost City!</p><br/><p>What had once appeared to be the eye of the Celestial transformed into that other vortex, which span furiously as a huge hand reached out of it toward Bai Xiaochun!</p><br/>\n</div>"}