{"title": "Chapter 1008: How Could You Be So Selfish?", "id": 1008, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1008-how-could-you-be-so-selfish", "volume_title": "Volume 11", "body": "<h1>Chapter 1008: How Could You Be So Selfish?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Celestial’s heart felt like it was about to be ripped to pieces. Things which had once been the most important in his life, but had vanished along the way, were suddenly brought right back to the forefront thanks to Du Lingfei’s words.</p><br/><p>He suddenly saw her as a child, tugging at his garments and calling him <em>daddy</em> in her cute, girly voice…. He wasn’t sure exactly when it happened, but somewhere along the line… she had stopped calling him <em>daddy</em>, and started calling him <em>father</em>.</p><br/><p>“Fei’er….” he said, trembling physically, his pupils constricting.</p><br/><p>After all… this was his daughter, his own flesh and blood.</p><br/><p>The Celestial was the mighty ruler of the entire world, and yet, had never had many Daoist partners. Over all the years, he had never had a son. Du Lingfei was his only daughter, and in fact, his only child.</p><br/><p>The Celestial had been so focused on escaping the Heavenspan Realm that Du Lingfei’s mother had never meant much to him. She had long since passed away.</p><br/><p>The Celestial’s heart was currently being ripped two ways; in one direction by his humanity, and in the other by his desires.</p><br/><p>The part that represented his humanity was screaming at him furiously. “You’re really willing to sacrifice your own flesh and blood just to live a bit longer? Just to get off of this world? Is it really worth it…?”</p><br/><p>On one side was his daughter, and on the other was his longevity, and his deep, insane desire to escape this prison he was in….</p><br/><p>Du Lingfei was currently in the middle of a struggle… and so was the Celestial!</p><br/><p>“Daddy… please….” Du Lingfei had begun to weep. She trembled physically as she fought against the slave seal. Every time she pushed against the magic of the seal, intense force slammed into her mind, making it feel like her soul might collapse at any moment. “Daddy, is it worth it...? I'm your daughter!! I beg you, daddy. I beg you....”</p><br/><p>And yet, she wouldn’t give up. She didn't want to hurt Bai Xiaochun, and also didn't want to see her father like this. In her pain, she was like a helpless child who could do nothing more than beg and plead….</p><br/><p>The father she remembered was not like this. Worse, she couldn't remember when he had changed…. When had he become a stranger, a person who would actually hurt her?</p><br/><p>Upon parting with Bai Xiaochun in the north, she had returned to Heavenspan Island. Gradually, she came to find that her mind was slowing down, and eventually, she heard a complex, emotional howl from the Palace of the Dao. It was her father, the Celestial. That was when she lost control of her own body. And yet, she never lost her consciousness. Eventually, she watched herself consuming Bai Xiaochun’s life force, and watched him dying, and the pain became too much to bear.</p><br/><p>“Daddy….” she said, trembling as the slave seal began to slowly collapse as she fought back against it. However, it was at this point that the Celestial looked up, his eyes burning with madness.</p><br/><p>“Shut up! Shut the hell up!!” As his shout echoed out like thunder, the madness in his eyes grew even more intense, and all the warmth of humanity that existed inside of him was wiped away!</p><br/><p>He shoved his memories of Du Lingfei away as surely as if he had cut them with a blade!</p><br/><p>He was no longer Du Lingfei’s father. He was the Celestial, someone who didn’t care about anything other than his longevity and his hopes for the future!</p><br/><p>“Fuse with Bai Xiaochun. That is your mission. Combine the <em>undying</em> with that which can <em>live forever</em>. That is the entire purpose of your existence!” Face twisting with vicious coldness, he waved his finger out in front of him.</p><br/><p>The slave seals in Du Lingfei’s eyes glowed so brightly they turned red. It was as if her mind was being suppressed, and as she lost control, she slowly reached back out toward the top of Bai Xiaochun’s head.</p><br/><p>As her hand neared, it trembled, and Du Lingfei’s eyes twitched. Despite how furiously the slave seals were controlling her, she was still trying to resist. Crystalline light shone brightly as she murmured, “I… won’t….”</p><br/><p>Tears streamed down her face and fell onto Bai Xiaochun. Blue veins bulged out on her face from the effort of speaking, and bloody wounds could be seen as her skin ripped and tore from the effort of fighting against the slave seals. She looked like she was about to collapse both physically and in terms of her divine sense. And yet, she wouldn’t stop fighting.</p><br/><p>As of this moment, it was possible to see Du Lingfei’s unswerving determination. She had made her decision. She would rather destroy herself than betray what she believed in!</p><br/><p>Bai Xiaochun could barely see what was happening. Virtually all of his life force was gone, and his mind was in chaos. His lips parted to speak, and yet, he didn’t even have the energy to say a single word.</p><br/><p>The tears falling onto his parched skin created rippling waves in his heart….</p><br/><p>When the Celestial saw that Du Lingfei was about to destroy herself, his anger flared.</p><br/><p>“Unfilial bitch!” he shouted, striding forward into the black pool of liquid.</p><br/><p>The black liquid began to swirl about even faster, and the magical symbols all shied away from the Celestial.</p><br/><p>Ignoring them, he stepped up to Du Lingfei and put his left hand onto her head, and then placed his right hand onto Bai Xiaochun’s.</p><br/><p>Tightening his fingers, he pushed both of their heads toward each other!</p><br/><p>“You know, according to my original plan, after I refined you into an Undying Live Forever Pill and left this prison of a world, I would eventually become an archaean, and then figure out a way to resurrect you….</p><br/><p>“Why must you rebel against me? Why?!?!</p><br/><p>“Why do you go so far as to defy me?!?!”</p><br/><p>The Celestial’s twisted expression was terrifying. He radiated a sensation of complete madness. As for Du Lingfei, she tried to fight back, but was powerless to do so. With the Celestial forcing her head toward Bai Xiaochun’s, there was nothing she could do, not even kill herself.</p><br/><p>As the Celestial forced Du Lingfei and Bai Xiaochun closer to each other, the radiant golden and crystalline lights began to swirl together with glittering radiance.</p><br/><p>“All I wanted you to do was consume Bai Xiaochun!” the Celestial raged. “All I asked you to do was become an Undying Live Forever Pill…. If I had any other choice, I wouldn’t do this!” Apparently, it was only by shouting at the top of his lungs that the Celestial could convince himself that what he was saying made sense.</p><br/><p>“I can’t simply gamble that the Worldgate can be opened after the gravekeeper dies. What if it’s sealed for all eternity? At that point, it wouldn’t matter if I got the technique! Therefore, I have no choice but to refine you two into a pill <em>now</em>. Then, I can finally acquire the Undying Live Forever Technique, and be unstoppable!</p><br/><p>“I can’t bet on what I don’t know! If the world ends up sealed, I’ll never be able to change it. I have no choice here. If you were in my position, you would do the same thing!!</p><br/><p>“With that pill… I will no longer be a quasi-celestial. I will be a true celestial! I will conform to the requirements of the will of this world, and will be able to leave!</p><br/><p>“Why are you defying me!?!? You’re just like your Eldest Sister! She defied me too! Why!?!? She did it for the Blood Ancestor, and you for Bai Xiaochun? <em>Why?!?!</em></p><br/><p>“All I have to do is get out of here and become an archaean! Then I can resurrect you!!</p><br/><p>“How can the two of you… be so selfish!!?” The Celestial was screaming so loudly that in the outside world, wild colors flashed in the sky, and raging winds screamed across the Heavenspan Sea, causing huge waves to rise up.</p><br/><p>In the depths of the Palace of the Dao, the Celestial’s energy radiated out, provoked by his emotions. The spell formation was reaching its pinnacle of power, and as the black liquid in the pool spun faster and faster, the bones in the necropolis melted, and began to fuse with Bai Xiaochun and Du Lingfei!</p><br/><p>Apparently, the spell formation was now acting like an enormous pill furnace, refining the ingredients therein to create…</p><br/><p>An Undying Live Forever Pill!</p><br/>\n</div>"}