{"title": "Chapter 1021: Crocodilian Head!", "id": 1021, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1021-crocodilian-head", "volume_title": "Volume 11", "body": "<h1>Chapter 1021: Crocodilian Head!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Daoist Heavenspan was in the nastiest of moods. Originally, he had assumed that the Blood Ancestor wouldn’t be able to delay him for more than a short moment. However, the Blood Ancestor had been saving up life force for 10,000 years, and also had some secret methods imparted to him by the gravekeeper. Combined with his madness and the fact that he had ignited himself for a final burst of power, he had been able to keep Daoist Heavenspan completely locked down.</p><br/><p>“Bai Xiaochun!” Daoist Heavenspan said through gritted teeth. He seemed supremely frustrated, and also no less furious than Bai Xiaochun. Over and over again, he had watched his ultimate desires crushed by the gravekeeper at the last minute, turned into nothing more than pipe dreams.</p><br/><p>However, this time, things were playing out slightly differently!</p><br/><p>In addition to the anger in his eyes, there was something else shining brightly.</p><br/><p>“Who would have thought that you would come here of your own volition? At least you've saved me the trouble of tracking you down myself. At last… I can refine you into an Undying Live Forever Pill!” Licking his lips, he chuckled and waved his hands out in front of him, causing rumbling sounds to fill heaven and earth as the will of the world itself converged on his person. Then, he began to walk toward Bai Xiaochun.</p><br/><p>With every step he took, the will of the world grew stronger, until it became a mountain-toppling, sea-draining pressure that weighed down on Bai Xiaochun.</p><br/><p>Earlier, not even the Blood Ancestor, a descendant of the Arch-Emperors, had been able to stand up to this.</p><br/><p>In fact, it was because of the will of the world that the Blood Ancestor had burned his own blood to get the power he needed to drive his Undying Technique. That was what had enabled him to lock Daoist Heavenspan down for so long.</p><br/><p>But now… the will of the world didn't seem to affect Bai Xiaochun at all! He had mastered the Undying Live Forever Technique, and could now accept the title of Arch-Ancestor. He also conformed to the will of the world, and in fact… was also the ruler of this heaven and earth!</p><br/><p>Bai Xiaochun’s eyes were bright red as he stared at the Celestial walking toward him. His killing intent raged as he too took a step forward, whereupon the will of the world began to bless him!</p><br/><p>It was as if the entire world had been split in two because of Bai Xiaochun and the Celestial. They strode toward each other until they were only 300 meters apart, both of them surging with different aspects of the power of the very world in which they lived!</p><br/><p>BOOOOOOOOOOOOOM!!</p><br/><p>When they slammed into each other, it was like mountains and rivers colliding, creating a deafening boom that echoed out across the frozen Heavenspan Sea. Seemingly incapable of sustaining the force, the sea began to split apart….</p><br/><p>At the same time, Heavenspan Island, which had already been mostly destroyed by Bai Hao’s flames, had reached the point where it couldn’t stand any longer, and collapsed!</p><br/><p>It was a holy land that represented the ultimate authority and power in the Heavenspan Realm, but now… it sank down into the Heavenspan Sea. As it did, a huge whirlpool formed, like a giant mouth of seawater.</p><br/><p>“How amusing!” the Celestial said. With that, he threw his head back and laughed uproariously. Despite having just fought bitterly with the Blood Ancestor, he was clearly just as powerful as before. Striding forward, he pointed up into the sky!</p><br/><p>“Four rivers form the heavenly bones! A golden sea to act as flesh!” His voice seemed to contain the might of the heavens, a boundless power that would force reality to conform to his wishes. All of a sudden, what appeared to be the soul projections of the four rivers of the lands of Heavenspan shot toward the Celestial.</p><br/><p>At the same time, Heavenspan Seawater began to rise up into the sky, taking shape around those souls…. to shape the enormous hand that had caused despair to rise up in Bai Hao’s heart, and kept the Blood Ancestor in check!</p><br/><p>Unfortunately for the Celestial, the gravekeeper had died, and the world was withering away. Because of that, his Daoist magic had faltered during his battle with the Blood Ancestor, and had been destroyed.</p><br/><p>But now, the gravekeeper was gone, along with his influence. As a result, there was now nothing to interfere with the Celestial’s control of the will of the world, despite how it was split. Furthermore, he was far more familiar with that will than Bai Xiaochun.</p><br/><p>The Celestial waved his arm, and the gigantic hand began to fall down onto Bai Xiaochun from above!</p><br/><p>Bai Xiaochun looked up with a very somber expression. He could sense the pure power of the four rivers within that huge hand, as well as the aura of the Heavenspan Sea. Although it looked like nothing but a hand, in truth… it was like all of the lands of Heavenspan combined!</p><br/><p>He could not withstand such a blow! It didn’t matter how powerful his fleshly body was, he would be felled by such power!</p><br/><p>At the same time, he knew that he couldn't compare to the ancient Celestial when it came to control over the power of this world. However, he did not shrink back. Eyes crimson, he looked up at the huge hand, threw his head back and shouted, “Who cares if I can’t match up to you, Celestial!?!?”</p><br/><p>The power of the Live Forever Technique coursed through him, which he then channeled into a Daoist magic called… the Waterswamp Kingdom!</p><br/><p>“Waterswamp!” he said, waving his arm through the air. He was confident that, with his powerful cultivation base, the mysterious divine beast… would come forth with more power than ever before.</p><br/><p>Rumbling sounds immediately echoed out as the Heavenspan Sea… transformed into a vast, watery swamp!!</p><br/><p>“Kingdom!!” Without any hesitation, he slapped his hands together, a sound which was accompanied by the roar of a beast from another world. Heaven and earth trembled from the sound of it, a sound that even the powerful Celestial was shocked to hear.</p><br/><p>It was a howl of excitement and joy, as a moment came which that mysterious beast had been waiting a long time for! Thanks to Bai Xiaochun’s current cultivation base, he could now open a true gap to allow the beast into the world!</p><br/><p>The entire Heavenspan Sea seemed to become a huge mouth that howled with deafening volume. This time, instead of mountain peaks rising up… an entire continent became visible!!</p><br/><p>It was pitch black, not because it was covered with soil, but because it was covered with a forest of scale-like ridges! This continent was so large it was almost impossible to describe!</p><br/><p>Each scale that covered the continent was as large as Heavenspan Island had been! As the continent rose up into the air, it was possible to see that, on its bottom, were row upon row of what looked like inverted mountain peaks!!</p><br/><p>If one looked closely, it was possible to see that this was actually not a continent. And the mountain peaks… were not mountain peaks! They were actually razor-sharp teeth! This continent… was the upper jaw of an enormous beast!!</p><br/><p>Next came the lower jaw…. When it was all visible, it looked like the mouth of a gigantic crocodile, rising up from within the Heavenspan Sea! Furthermore, its eyes were bright red… making them look exactly like Bai Xiaochun’s eyes!!</p><br/><p>The crocodilian head rose up and opened its mouth; compared to it, Bai Xiaochun and the Celestial were like tiny bugs! Howling, the crocodilian head lunged toward the enormous hand of the world… and chomped it up!!</p><br/><p>Bai Xiaochun was deeply shaken by what he was seeing. Looking at the enormous crocodilian head, he couldn’t help but marvel at how everything was playing out. Never could he have imagined that his life essence spirit was so big… that it seemed capable of almost filling the entire world he lived in!</p><br/><p>On any other occasion, he might have been happy, but right now, there was no time for such thoughts. He looked up as the enormous hand of the world met his Waterswamp Kingdom beast, whereupon a heaven-rending, earth-crushing boom erupted out!</p><br/><p>The shockwave created a tempest that filled the entire Heavenspan Sea region as… the hand of the world collapsed into pieces!</p><br/><p>As that happened, almost all of the mountains in the four river regions collapsed. However, Bai Xiaochun’s life essence spirit also couldn’t sustain the force. After chomping down on the hand of the world, it faded away.</p><br/><p>It was gone, not dead, of that Bai Xiaochun was certain. Up til now, his life essence spirit had only come as a projection; he would need a higher cultivation base to summon it in full.</p><br/><p>Eyes glittering, he considered summoning it again, but before he could, the Celestial threw his hands up, an unprecedentedly serious expression on his face. On the finger of one of his hands was a ring which he took off and threw down toward the Heavenspan Sea!</p><br/><p>“Seal!” he shouted coolly.</p><br/>\n</div>"}