{"title": "Chapter 1026: Peerless Daoist Magic!", "id": 1026, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1026-peerless-daoist-magic", "volume_title": "Volume 11", "body": "<h1>Chapter 1026: Peerless Daoist Magic!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun was panting, and his face was ashen. This was his first time unleashing his Live Forever Codex Daoist magic, the Live Forever Lamp. However, he had visualized the process numerous times, and therefore, felt quite proficient in its use. This was one of the things that made the Live Forever Codex so unique: the fact that it could create a peerless Daoist magic based on the individual cultivator .</p><br/><p>However, it was difficult to deal with how draining it was. After unleashing it only once, the power of the Live Forever Codex within him had been drained by more than seventy percent!</p><br/><p>Cultivation base drainage was not something that the powers of the Undying Codex could help with. The Undying Codex only helped him recover from injuries of the fleshly body. The cultivation base could only be restored by means of breathing exercises or similar means.</p><br/><p>The power of this Daoist magic was shocking even to Bai Xiaochun. His eyes flashed like lightning as his gaze fell on the Celestial. As of this moment, the entire world… looked very different!</p><br/><p>The pile of crystal was… the lampstand!</p><br/><p>The massive size of the lampstand was enough to cause pressure to weigh down on anyone who looked at it. Furthermore, the gravitational force it emitted ensured that no entity in existence would dare to get too close to it.</p><br/><p>The heavenly canopy from above had descended, surrounding the lampstand to act as… the lampshade!!</p><br/><p>Countless longevity characters were visible on the lampshade, which represented long life!</p><br/><p>However, all of those things only constituted part of the Live Forever Lamp. The most important part… was right in the middle. The white, glowing candle!</p><br/><p>Daoist Heavenspan’s life force, his body, and everything else that made him up became that white candle! The final bit of the lamp was the spark from Bai Xiaochun’s eyes, which lit the candle, providing the fire and the light!</p><br/><p>As Daoist Heavenspan’s body burned, fiery radiance spilled out, hitting the lampshade and accenting the longevity characters. Furthermore, the powerful gravitational force from the lampstand made it impossible for the Celestial to move a muscle.</p><br/><p>Shockingly, Daoist Heavenspan had become the Live Forever Lamp!</p><br/><p>He trembled violently, his mind and heart assailed by waves of shock. The indescribable sensation of imminent crisis that filled him was stronger than anything he had ever experienced. He could sense that his life force, his body, his cultivation base, and even his soul, were being burned by the Live Forever Lamp. He was wasting away rapidly, and in fact, it was to his shock that, only moments later, he felt unprecedentedly weak.</p><br/><p>“This divine ability…. This Daoist magic….” At this point, he howled like a wild animal. “Insignificant Live Forever Lamp! How dare you burn my soul!!”</p><br/><p>Amidst his struggling, he threw his head back and howled, and Bai Xiaochun stood there looking at him coldly.</p><br/><p>“Alright, Daoist Heavenspan,” he murmured to himself, “it’s about time to use your final trick. The one you thought would earn you the win!”</p><br/><p>Daoist Heavenspan glared back at Bai Xiaochun, burning, his skin and flesh slowly melting until bones became visible beneath. His hair was pure white, and his face was covered in wrinkles, and yet, the madness and insanity in his eyes had not been reduced by even a smidgen.</p><br/><p>“Watch and learn, Bai Xiaochun. Pay attention to how I break your Daoist magic!” He extended both of his burning hands and pushed them together, palm to palm, as if he were praying!</p><br/><p>“Seventh Daogate: Palace of Earth!” As the words left his mouth, a muffled rumble echoed out that seemed to come from far beneath the surface of the ground. Moments later, the energy of the land erupted out!</p><br/><p>The Palace of Earth represented all of the lands in the world!</p><br/><p>Energy poured from every square inch of the ground, which then began to stream toward Daoist Heavenspan!</p><br/><p>The energy of the earth swirled around him, causing the flame to show signs of weakening. As for the crystalline lampstand, it began to darken, as though it would soon turn into ordinary stone!</p><br/><p>It wasn’t just the lampstand that was affected. The lampshade was also affected by the earth energy, and began to turn brown. Within a few breaths of time, it looked like soil! And then, Daoist Heavenspan no longer looked like white wax, and the burning of his life force… ceased!</p><br/><p>A boom rang out that seemed capable of rending heaven and earth in two! The Live Forever Lamp, which had been created with Daoist Heavenspan… exploded into bits!</p><br/><p>“Did you really think you could trap me with that Daoist magic of yours, Bai Xiaochun!?!?” Daoist Heavenspan appeared to be in very bad shape, and was even gasping for breath. But after a moment, he threw his head back and began to laugh maniacally.</p><br/><p>Bai Xiaochun stood in place, not moving, his eyes flickering with cold light, and also… derision.</p><br/><p>“You really think you broke free?” he said, gesturing casually up at the sky.</p><br/><p>In that instant, Daoist Heavenspan’s face fell as he realized that his life force, his cultivation base, and his soul… were still fading away! He suddenly looked up into the sky, his mind reeling as he staggered backward.</p><br/><p>“How is this even possible!?!?”</p><br/><p>High up in the sky… countless Live Forever Lamps had appeared. They stretched to the farthest corners of the Heavenspan Realm, to the point where it was impossible to see where they began or ended….</p><br/><p>And in each of the Live Forever Lamps was a tiny version of Daoist Heavenspan, laughing and crying simultaneously, snarling and howling at the same time!</p><br/><p>The bizarre nature of the sight was terrifying to behold!</p><br/><p>Daoist Heavenspan’s aura suddenly flared to life, and he burst into motion, flying up into the sky and throwing both of his hands out wide.</p><br/><p>“Eighth Daogate: Palace of Heaven!!</p><br/><p>As he unleashed the eighth of his Daogate magics, the entire world went dim, and a massive wind kicked up. At the same time, the Celestial’s hand transformed into a massive, illusory hand that reached up and began to tear open a huge rift.</p><br/><p>As the rift opened, it was as if the sky were being sliced open by an enormous, razor-sharp blade.</p><br/><p>Shocking energy fluctuations poured out, causing the Live Forever Lamps to tremble. Simultaneously, the miniature versions of Daoist Heavenspan within the lamps all howled at the tops of their lungs and joined together… to power the magic of the Palace of Heaven!</p><br/><p>BOOOOOOOOOOOOOM!!</p><br/><p>One by one, the countless Live Forever Lamps began to explode. Within moments, they were gone, and Daoist Heavenspan hovered there, gasping for breath. He was clearly exhausted and profoundly weak, and yet his eyes glittered brightly. As the moments passed, he began to recover, and he turned his gaze to Bai Xiaochun, looking very much like the most domineering figure in all heaven and earth.</p><br/><p>“Unless you have some other trick up your sleeve, Bai Xiaochun, then… the time has come for you to be a good boy and transform into the high-level medicine I need!”</p><br/><p>Bai Xiaochun looked as calm as ever, except for the raging killing intent in his eyes. Then he spoke, and it sounded as if he were saying the funniest thing in the world. “You really think you broke free?”</p><br/><p>Based on what he could tell, the secret move that Daoist Heavenspan believed would gain him victory had still not been employed.</p><br/><p>As for Daoist Heavenspan, a look of blank shock appeared on his face. Backing up, he looked up, and realized that the world net had appeared overhead.</p><br/><p>Then he looked down and realized that the lands below looked almost like an enormous lampstand….</p><br/><p>Countless emotions flickered across his face, and he began to tremble. For the first time, bitterness and regret began to rise up in his heart.</p><br/><p>“This Live Forever Lamp is truly amazing. And the Live Forever Codex, even moreso!”</p><br/><p>As of this moment, the entire Heavenspan Realm had been turned into a gargantuan, unparalleled Live Forever Lamp!!</p><br/><p>The lands below were the lampstand, and the world net was the lampshade. And Daoist Heavenspan… was still the white candle. He… was still burning, providing the lamplight!</p><br/><p>This was… the third form of the Live Forever Lamp!</p><br/><p>First, the self. Second, the heavens. Third, the world!</p><br/><p>It was a peerless Daoist magic!</p><br/><p>Breathtaking and unrivaled!</p><br/>\n</div>"}