{"title": "Chapter 1023: Heavenspan Daogates", "id": 1023, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1023-heavenspan-daogates", "volume_title": "Volume 11", "body": "<h1>Chapter 1023: Heavenspan Daogates</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Unfortunately, only the gravekeeper had the ability to outthink the Celestial. Bai Xiaochun had only spent a few short years on the path of cultivation, making it impossible for him to compare to the Celestial in terms of plotting and scheming. Although he had somewhat of an idea of what the Celestial was thinking, there were too many clues that he couldn’t pick up on.</p><br/><p>Furthermore, there was no time to sit around thinking about the matter. The fight between the two of them was one in which life and death hung in the balance at every moment. Bai Xiaochun couldn’t afford to be distracted, and therefore fully concentrated on the four beasts that were currently charging toward him.</p><br/><p>The gluttonous flood snake and the fantastic crocodile were both fantastically large, and were currently coming at him from the left and the right, clearly intent on ripping him to shreds!</p><br/><p>At the same time, the sludge giant and the gloom bird were coming at him from the front and behind, their piercing cries shattering the air around them!</p><br/><p>All of them radiated the fluctuations of the great circle of the Demigod Realm, giving birth to windstorms that could change the face of heaven and earth. From the look of things, they were not going to give Bai Xiaochun even the shadow of a chance to escape!</p><br/><p>In that moment of crisis, Bai Xiaochun unhesitatingly slapped his bag of holding and said, “Moonflower!”</p><br/><p>The instant the words came out of his mouth, an aura erupted out that, even on its own, surpassed the auras of the four incoming beasts!</p><br/><p>Rumbling sounds could be heard as nine bright green vines shot out at high speed. Following the vines… was an enormous moonflower made of an infinitude of flower petals!</p><br/><p>An aura from beyond the heavens shook the entire area as the huge flower towered overhead! If the gravekeeper were alive, and the world were not withering to death, the world would instinctively attempt to crush this flower. But now… the will of the world was fragmented, and the moonflower erupted with shocking, otherworldly power!</p><br/><p>In fact, it seemed to pulse with something like a Heaven-Dao aura!</p><br/><p>RUUUUUUUUMBLE!</p><br/><p>It was fully 30,000 meters tall, and radiated an aura of complete savagery. In addition, it glittered with brilliant designs…. In that moment, a shocking roar erupted from the moonflower!</p><br/><p><em>Roar!</em></p><br/><p>Everything in the area began to shake, and the tempest that the four beasts had created was ripped to shreds!</p><br/><p>The moonflower didn’t even need any direction from Bai Xiaochun. Even as the roar echoed out, the flower broke up into countless petals that streamed out in order to wipe all traces of the beasts out of existence!</p><br/><p>In the blink of an eye, the moonflower and the four beasts began to fight with utter ferocity.</p><br/><p>Daoist Heavenspan’s eyes glittered in surprise because of Bai Xiaochun’s moonflower. However, he merely glanced at it for a moment before heading directly toward Bai Xiaochun.</p><br/><p>Bai Xiaochun also began to head toward Daoist Heavenspan, and the two of them began to fight. Surrounded by the battling moonflower and four beasts, they performed incantation gestures and unleashed shocking divine abilities and Daoist magics!</p><br/><p>It only took a short time for all parties involved in the fighting to have exchanged thousands of blows.</p><br/><p>Although the moonflower was powerful, it was fighting against four opponents, and was gradually losing ground. Eventually, a howl erupted from inside of the flower, and it exploded, creating something like a sea of dandelion petals that surged toward the four beasts.</p><br/><p>The four beasts’ expressions flickered as they lurched away. Unfortunately for them, they were too slow. In the blink of an eye, they were overwhelmed. The flying seeds slammed into them, boring into their bodies and seemingly drawing them up as food!</p><br/><p>When the four beasts began to scream miserably, Daoist Heavenspan noticed, and frowned. The sight of his four beasts rapidly withering away caused his heart to pound in his chest.</p><br/><p>“What an incredible seed from beyond the heavens!” Snorting coldly, his eyes flashed with determination as he performed an incantation gesture with his right hand. Voice as cold as ice, he said, “World relics, to me!”</p><br/><p>As the words left his mouth, the four beasts suddenly shuddered and exploded into bits!</p><br/><p>From inside of the four beasts emerged millions upon millions of streams of sword energy, which screamed through the air like a tempest and then slashed into Bai Xiaochun. Wounds opened up everywhere, and although his powers of regeneration went to work immediately to heal him, his eyes still widened….</p><br/><p>Then, the sword energy shot back, and became six beams of light that swirled around Daoist Heavenspan. Shockingly… six colorful swords could be seen, all of them unique in design and appearance.</p><br/><p>They seemed incomparably sharp, and Bai Xiaochun could tell from just looking at them that they were ancient and powerful to the extreme!!</p><br/><p>“Were those four beasts embodiments of the Celestial’s magical items…? Wait, no. Maybe the Celestial hid the six ancient swords inside of them…?” Even as he shot backward, the countless flying seeds swirled back, converging into the shape of a damaged and bedraggled moonflower. Its aura was weak, and it looked to be in bad shape thanks to the injuries inflicted by the explosion of sword energy.</p><br/><p>“Interesting….” Daoist Heavenspan said, hovering in midair, looking at Bai Xiaochun with coldly shining eyes.</p><br/><p>“No wonder the gravekeeper chose you…. In all the years, no one other than him has ever forced me to use my life essence Daoswords!</p><br/><p>“The Undying Live Forever Technique has its five shackles and five sealing marks…. Spectacular, to say the least. However, the very reason why I can change my own fate in heaven-defying fashion is… the nine Daogates that I created!</p><br/><p>“I have cultivated these Daogates for my entire life, and they require the use of these six Daoswords to employ…. In fact, it was by using the Daoswords to open the Daogates that I was able to kill the Arch-Emperor and slaughter countless numbers of his people!</p><br/><p>“Today… I will similarly use my life essence Daoswords to open the Daogates and… end your life!” Even as he spoke, his energy began to rise higher and higher. Rumbling sounds filled all creation, and wild colors flashed in the sky. Massive waves covered the surface of the Heavenspan Sea.</p><br/><p>It was as if he had become the origin of all energy and power in the world, as if his every action or move could cause the Heavenspan Realm to respond!</p><br/><p>Bai Xiaochun panted, a sensation of danger filling him the likes of which he had never experienced before. And the source was none other than the Celestial. Based on what he could sense, not even his powers of regeneration would allow him to recover from the next attack!</p><br/><p>And yet, he did not show any signs of backing down. The Celestial had a trump card… but so did Bai Xiaochun!</p><br/><p>The Celestial’s energy caused the entire world to shake around him. Strange light erupted from his eyes as he threw his arms wide and spoke in a voice that filled the world!</p><br/><p>“Daogate… Palace of Water!”</p><br/><p>His words seemed to thrum with the power of a great Dao! As they did, his six swords flew forth, linking together to form a design with three rows!</p><br/><p>The top row featured two swords in a line, with a gap between them!</p><br/><p>The second row featured two swords together, with no gap!</p><br/><p><span id=\"footnote-ref-d990\"><span>The third row looked exactly like the first row! </span>[1]</span></p><br/><p>Even as the design was completed, seemingly infinite streams of water vapor began to rise up from the withered lands of Heavenspan. It was as if all the water in the world… were forming together into an ocean. That much water carried indescribable weight, and all of it began to fall onto Bai Xiaochun!</p><br/><p>Bai Xiaochun backed up in the face of the seemingly endless amount of water filling the sky. It was water that thrummed with destructive power, power that seemed capable of eradicating any life force that got in its way.</p><br/><p>“Celestial magic? Nine Daogates…? Am I supposed to be impressed?!” Eyes bloodshot, he threw his head back and roared, clenching his right hand into a fist that caused a black hole to explode into existence. At the same time, a shadowy emperor appeared behind him, bursting with a domineering air.</p><br/><p>“Undying… Emperor’s Fist!</p><div id=\"footnote-d990\"><br/><p>1. The swords form the shape of one of the eight trigrams which looks like this ☵. It is specifically the “kan” trigram which represents, among other things, water. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}