{"title": "Chapter 1039: Killing A Preceptor!", "id": 1039, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1039-killing-a-preceptor", "volume_title": "Volume 11", "body": "<h1>Chapter 1039: Killing A Preceptor!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><em>Medicinal spiritualization</em> was used to describe techniques in which the spiritual power of heaven and earth was used to extract the life force from plants and vegetation, which was then used to create stronger medicines. It was something that, as an apothecary himself, Bai Xiaochun would sometimes do.</p><br/><p>In terms of <em>blood-spirit fertilization</em>, it was very much as the name indicated. It involved burying people alive in the soil so that the spirit plants could absorb that person’s spirit and blood to grow faster and stronger.</p><br/><p>Only unscrupulous and evil apothecaries would use such methods. Bai Xiaochun had actually seen such evil before in the Wildlands, for example, when Song Que had been turned into a living spirit stone.</p><br/><p>Another blood-spirit fertilization technique he had seen once was a vile method in which a seed was planted into a person’s body, which would then grow inside of them and take them over.</p><br/><p>But what he was looking at right now… was different from either of those two methods he had seen in the past. Growing right in front of the hunchbacked old man… was a crimson plant fully 90 meters tall.</p><br/><p>Despite its size, it only had nine leaves, each of which had serrated edges that almost looked like teeth. In addition to the leaves, there were hundreds of vines, each of which was stabbed into the forehead of one of the bodies, and was sucking its life force away.</p><br/><p>Most of the bodies that floated in the air attached to the vines were severely withered, as though they had been sucked dry by the blood-colored plant.</p><br/><p>All of them had expressions of pain and rage on their faces, their mouths open as if they had been crying out right before death.</p><br/><p>Ninety percent of them truly were dead. However, the remaining ten percent had a bit of energy left. They were like oil lamps flickering on the verge of winking out, the flames of their life force just barely there.</p><br/><p>Some of them had the aura of the Heavenspan Realm on them, but the majority had a unique, holy air that Bai Xiaochun had never encountered before. Presumably, those were people from the Saint-Emperor Dynasty.</p><br/><p>Bai Xiaochun’s divine sense also revealed to him that deeper in the immortal's cave was an enormous pit filled with skeletons and corpses, most of which had that same holy feeling to them. That enormous pit was the main reason that the plants in the immortal's cave grew so well.</p><br/><p>When Bai Xiaochun detected the Heavenspan aura among the hundreds of bodies hanging in the air, his eyes turned as cold as ice.</p><br/><p>“Have a death wish?!” he said, his voice like a biting winter wind that had swept from Crosspeak Prefecture all the way to Cloudsea Prefecture.</p><br/><p>The excited Li Luohai shivered, his expression flickering.</p><br/><p>“Who’s there?!” he blurted, his heart already pounding. Then he took a step forward, as if to leave. Although he had been caught completely by surprise, the fact that a voice had spoken out in this place where no one could possibly enter was extremely telling.</p><br/><p>Considering the level of Li Luohai’s cultivation base, he knew that in all of the third immortal domain… there were no more than three people who could possibly enter his immortal's cave so stealthily!</p><br/><p>And they were all celestials!</p><br/><p>Even as he began to step forward, he could sense something behind him, something whose mere energy fluctuations created a pressure that could shake the world. It was something that could devour even demigods, something that could topple mountains and drain seas. And that energy immediately engulfed him.</p><br/><p>“Noooo!!” It was to his shock and terror that he realized his divine soul was shaking violently. Countless streams of frigid qi entered him through his eyes, ears, nose, mouth, and pores, causing cracking sounds to ring out as his flesh and blood was frozen and shattered, then his energy passageways, and even his bones!</p><br/><p>It only took a few breaths of time before a bloodcurdling scream erupted from Li Luohai’s mouth. Then came a stream of blood as his vision blurred. And finally, he realized that a hand was clamping down onto the top of his head.</p><br/><p>The last thing he heard was the sound of crunching bone!</p><br/><p>Starting with his head, his entire body shattered into pieces. It only took the blink of an eye!!</p><br/><p>Because he was a demigod with abundant life force, it was not easy for him to simply pass out. And therefore, he experienced every single last bit of pain!</p><br/><p>The entire time, Li Luohai never even had a chance to look back to see who it was that had entered his immortal's cave, nor did he have time to send out any divine sense. He had absolutely no idea who it was….</p><br/><p>As his body shattered into bits, and before his divine soul could do anything, a massive pressure crushed down in the area, suppressing the power of reincarnation. As a result, he was unable to enter the cycle of reincarnation, and was snatched up by Bai Xiaochun. He was Bai Xiaochun’s first demigod soul from the Eternal Lands!!</p><br/><p>He wouldn’t have been able to do such a thing in the past. However, after arriving in the Eternal Lands, despite the fact that he had not practiced any cultivation, the powerful energy of heaven and earth had entered him, and caused his cultivation base to advance some.</p><br/><p>It was actually the same with all cultivators from the Heavenspan Realm. After encountering the spiritual energy in the Eternal Lands, all of them slowly began to grow stronger!</p><br/><p>After snatching up the demigod soul, Bai Xiaochun swished his sleeve to throw it in his bag of holding, then turned his gaze toward the corpses attached to the enormous crimson plant.</p><br/><p>The plant was close to being sentient, and shrank back from Bai Xiaochun. However, the powerful fluctuations emanating off of him caused it to simply wither away into death.</p><br/><p>As it did, the corpses began to drop to the ground. Bai Xiaochun walked over to examine them, and among the several hundred, found a single familiar face.</p><br/><p>“Zhou Hong, heir apparent to the Nine Serenities King!” Zhou Hong had plotted against him over and over again in the Wildlands. Bai Xiaochun had thwarted him at every turn, until the point where he reached such a high standing that Zhou Hong was powerless to even plan a strike against him. At that time, Zhou Hong had simply gone into hiding.</p><br/><p>Zhou Hong had not yet breathed his last breath, but unfortunately, the flame of his life force had already gone out. In his last moments, the death of the plant caused a slight backlash of energy that forced his eyes opened, allowing him to see Bai Xiaochun.</p><br/><p>He was surprised, excited, and also sad….</p><br/><p>Both gratitude and grudges alike could be seen in his eyes. He opened his mouth as if to speak, but only managed to smile, and then he closed his eyes forever….</p><br/><p>Bai Xiaochun stood there silently for a long moment. He had hoped to come to the rescue of the people he had seen here, but had clearly come too late. Sighing, he waved his hand to collect Zhou Hong’s corpse, then turned to leave. He left the immortal's cave in a sea of fire.</p><br/><p>Everything inside the cave became ash, with the exception of the valuable medicinal plants. Although they had been grown with the blood and spirit of countless Saint-Emperor Dynasty cultivators, they could still be useful in concocting medicine. It was a true windfall for Bai Xiaochun!</p><br/><p>Eyes flashing with determination, he left.</p><br/><p>“I’ve come late, but I’m going to take all of the people of Heavenspan in this city with me!” As soon as he was out in the open, he sent his divine sense spreading out through the entire city.</p><br/><p>Everyone present, regardless of the level of their cultivation base, shivered, and then their minds went blank. For them… it was as if time had stopped!</p><br/>\n</div>"}