{"title": "Chapter 1057: Dont Say I Didnt Warn You!", "id": 1057, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1057-dont-say-i-didnt-warn-you", "volume_title": "Volume 11", "body": "<h1>Chapter 1057: Dont Say I Didnt Warn You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From the tightness of Heavenly Marquis Liu’s voice, he seemed extremely nervous. His words almost came out as a scream. In response, the thousands of court officials looked over at him with frowns on their faces.</p><br/><p>Bai Xiaochun stopped in place and blinked a few times. As for the Giant Ghost King, his eyes shone with anticipation.</p><br/><p>“So, the fellow finally speaks some truth!” Actually, the Giant Ghost King hoped that Heavenly Marquis Liu would convince the Saint-Emperor to change his mind. If Bai Xiaochun were able to avoid being confined in Saint-Emperor City, it would be much more beneficial to their cause.</p><br/><p>For the first time, Bai Xiaochun wasn't very annoyed by Heavenly Marquis Liu, and actually looked forward to what he was about to say. He was even secretly cheering him on.</p><br/><p>Although the Saint-Emperor wasn’t very pleased, he masked such feelings and turned his warm gaze onto Heavenly Marquis Liu.</p><br/><p>“My dear Minister Liu. What exactly do you mean?”</p><br/><p>Having received the nod of approval from the Saint-Emperor, Heavenly Marquis Liu bowed excitedly, and then spoke out in a much louder voice.</p><br/><p>“Your Majesty, you have no idea the kinds of things this Bai Xiaochun did in the Heavenspan Realm. Sir, it didn't matter where he went, he would always cause a massive disaster, and wreak the cruelest of torments upon the people there!</p><br/><p>“He toyed with the Spirit Stream Sect, toyed with the Blood Stream Sect, and toyed with the River-Defying Sect to no end! Later, he ended up in the Wildlands, where he shook down clans, stole wives, and accumulated a list of 100 major crimes! Afterward, he nearly destroyed the entire Nine Heavens Cloud Lightning Sect. Voices of discontent could be heard everywhere! Men and gods alike were outraged!” Heavenly Marquis Liu was clearly very worked up, and actually had a lot more to say. But by this point, the gathered officials had begun to laugh openly.</p><br/><p>Although they didn’t believe Heavenly Marquis Liu to be lying, they most certainly assumed that he was exaggerating. Besides, although Bai Xiaochun had a quasi-celestial cultivation base, he came from a very small world.</p><br/><p>In sharp contrast, Saint-Emperor City was the capital city of an entire dynasty!</p><br/><p>There were multiple celestials here, as well as the Saint-Emperor himself. Even if Bai Xiaochun were more powerful than he actually was, they didn’t see how anything he could do would possibly cause any major problems.</p><br/><p>The Saint-Emperor gave a hollow chuckle. He felt the same as everyone else. If you threw a monkey into little garden with no other animals in it, then the monkey would definitely seem tough. But throw that same monkey into a lion’s den, and the monkey would have a very different fate.</p><br/><p>Waving his hand to interrupt Heavenly Marquis Liu, he rose to his feet, indicating that court was adjourned.</p><br/><p>Both the Giant Ghost King and Bai Xiaochun were very disappointed. To some extent, Bai Xiaochun was also nervous. He knew that he had the strange ability to cause major disasters, even when he didn't want to. Therefore, he decided that the best thing to do would be to make sure he had some insurance.</p><br/><p>Rushing forward, he called out,</p><br/><p>“Your Majesty, wait a moment!”</p><br/><p>The Saint-Emperor stopped in place and turned to look at him, as did all of the other court officials.</p><br/><p>“Your Majesty,” he said cautiously, “what Liu Yong just said is actually true. To be honest, I’m a bit worried that I might break some rules in the Saint-Emperor Dynasty. In fact… if I, Duke Heavenspan, accidentally violate some rules, what would the punishment be?”</p><br/><p>The Saint-Emperor’s eyes narrowed as he looked back and forth between Bai Xiaochun and Heavenly Marquis Liu, trying to decide if they were working together. From the look of things, both of them were trying to come up with an excuse to get Bai Xiaochun out of Saint-Emperor City.</p><br/><p>“As a duke who has performed meritorious service, as long as you don’t betray the nation, you will not be punished for any action!” Inside, the Saint-Emperor was chuckling coldly. Considering how important Bai Xiaochun was in controlling the people of Heavenspan, there was no way he would simply let him leave.</p><br/><p>Bai Xiaochun was very pleased with the answer he had just been given, but didn’t let it show on his face. Frowning and sighing, he left with the Giant Ghost King.</p><br/><p>As everyone departed, Heavenly Marquis Liu stood there, crestfallen. As far as he was concerned, the Saint-Emperor had just led the wolf right into the henhouse. In the coming days, Saint-Emperor City would likely descend into tragedy, at least until the drums and gongs were broken out, and the Plague God Bai Xiaochun was driven away.</p><br/><p>“Don’t say I didn’t warn you!” he sighed, bemoaning the state of the universe, and pitying the fate of mankind.</p><br/><p>Court was adjourned, and the Saint-Emperor had bestowed the rewards. Before Bai Xiaochun left, the two old men who had been standing at the front of the hall approached him.</p><br/><p>One of them gave him a jade slip which was essentially a key to the blessed land he had been given.</p><br/><p>The other was a colorful belt which would ensure that he didn't feel any pressure from the spirit automaton of the world treasure that was the imperial palace.</p><br/><p>He was also given a ducal robe of the finest quality, a magical item with an impressive aura. Lastly, he was given… a dragonfish!</p><br/><p>The dragonfish was fully three meters long, and was still alive. It had been bound up so that it couldn’t move, and yet its sharp teeth and glaring eyes seemed particularly ferocious.</p><br/><p>Bai Xiaochun looked over the rewards and sighed.</p><br/><p>“This Saint-Emperor is so stingy…. I guess the robe, immortal's cave, and belt are okay, but what did he give me a fish for…?” Shaking his head, he used the jade slip to go find his blessed land, taking the Giant Ghost King with him. It was located on a lotus leaf that had plenty of buildings on it. His blessed land was right in the middle, in a relatively tranquil and quiet locale.</p><br/><p>Although it was called a blessed land, it was actually just a mansion residence. On the upside, the spiritual power of heaven and earth was strong in the area. There were beautiful ornamental rocks, and lovely buildings built in a very impressive and imposing style.</p><br/><p>Bai Xiaochun was happy with the residence. Although it was relatively empty and unfamiliar, he didn’t mind, and therefore just sat down to meditate and familiarize himself with the spiritual energy of heaven and earth here. As for the Giant Ghost King, he looked around briefly, and then left.</p><br/><p>The Giant Ghost King and Bai Xiaochun were very different in some ways. For example, back in the town he had ended up in, Bai Xiaochun never got familiar with anybody. Some of it had to do with the depression he had been in, but some of it was his personality. In contrast, the Giant Ghost King had made friends quickly. From that, it was possible to see how good the Giant Ghost King was at expanding his network. In fact, he could put Xu Baocai to shame.</p><br/><p>And that was exactly what he planned to do here. Even as he made preparations to go to Godsifter Prefecture, he made enquiries and gathered information.</p><br/><p>Before long, the moon hung high in the sky, and Bai Xiaochun awoke from his meditative trance. After looking up into the sky, and then glancing around at the unfamiliar buildings, he realized that he had truly taken his first major step in the Eternal Immortal Domains.</p><br/><p>Sighing, he began to think of many familiar faces.</p><br/><p>“Uncle Li…. Bruiser…. Patriarch Spirit Stream….</p><br/><p>“Song Junwan…. Mistress Red-Dust….</p><br/><p>“Master God-Diviner…. Xu Baocai….” In the end he sighed, thinking about one final name.</p><br/><p>“…Du Lingfei….” Bai Xiaochun wasn’t even sure if Du Lingfei was still alive. Back in the final moments, Daoist Heavenspan had claimed that she was.</p><br/><p>But then the world was destroyed. And the immortal domains were vast and filled with countless people. How could he possibly find her in such an environment?</p><br/><p>“What I need to do now is work hard on my cultivation and break through to the Celestial Realm! In terms of cultivation, I need medicinal pills and the spiritual energy of heaven and earth…. I guess I need to familiarize myself with what type of cultivation resources are available in the Eternal Immortal Domains.” As he settled his thoughts, his eyes began to shine with both anticipation and focus.</p><br/><p>As the night deepened, the Giant Ghost King returned, looking very excited.</p><br/><p>“The fish! That dragonfish!”</p><br/><p>Surprised, Bai Xiaochun looked over at the dragonfish, which was off to the side, still flipping and flopping a bit. From the look in the Giant Ghost King’s eyes, it was like some sort of precious treasure.</p><br/><p>“Xiaochun, that’s no ordinary fish! The Saint-Emperor really wasn’t holding back at all…. Heavenly dragonfish are native only to this heavenly pond. They drink heavenly pondwater, and thus naturally absorb the spiritual energy of heaven and earth. They are also fed with all sorts of precious materials! They’re considered the personal property of the Saint-Emperor!</p><br/><p>“Any cultivator of the celestial level or lower who eats a heavenly dragonfish will experience a major cultivation base boost. As much as from an immortal pill!!”</p><br/><p>“Immortal pill!?” Bai Xiaochun said, his eyes shining. He had just been wondering about where to get the spiritual energy he needed to work on his cultivation. And thus, he and the Giant Ghost King went about roasting the fish….</p><br/><p>As it turned a lovely golden-brown color, a wonderful aroma filled the air. Bai Xiaochun and the Giant Ghost King salivated as they waited for it to finish cooking. And then… they began to eat.</p><br/><p>When he was finished, Bai Xiaochun licked his lips in complete satisfaction and said, “Delicious! Tastes just like spirit tail chicken!”</p><br/>\n</div>"}