{"title": "Chapter 1054: Saint-Emperor City", "id": 1054, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1054-saint-emperor-city", "volume_title": "Volume 11", "body": "<h1>Chapter 1054: Saint-Emperor City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The voice echoed about in a way that made it impossible to determine where exactly it came from. It almost seemed to surpass the flow of time itself. Those who heard it felt a connection to the voice, as though it contained a strange power that instantly calmed them down.</p><br/><p>The Giant Ghost King shivered, and Gongsun Wan’er’s breathing began to steady. As for the demigods who had come from the nearby immortal domain, their eyes shone with reverence as they turned in the direction of Saint-Emperor City, clasped hands, and bowed.</p><br/><p>Gu Tianjun’s expression flickered, and he closed his eyes momentarily. When they opened, there was no trace of killing intent or rage. The only thing that remained was frosty coldness.</p><br/><p>“Come with me, Fellow Daoist Bai!” he said coolly.</p><br/><p>Bai Xiaochun shivered inwardly at the strange qualities of the Saint-Emperor’s voice. At the same time, the sliver of Willpower which had awoken when facing Ghostmother’s celestial Daoist magic stirred yet again.</p><br/><p>“The Saint-Emperor is so powerful!” he thought. However, he didn't let any emotions show on his face. Smiling broadly, he clasped hands and gave a slight bow in the direction of Saint-Emperor City. Then he returned to the battleship, and stood silently on the prow.</p><br/><p>Gu Tianjun cast a cold glance at Bai Xiaochun, but didn’t say anything. A moment later, he turned into a beam of sword light that shot back toward Saint-Emperor City. As for the demigods who had come with him, they also looked over at Bai Xiaochun, but this time, their expressions looked very different from before.</p><br/><p>“This guy… seems different from the other people of Heavenspan that I've seen!” That was what most of the demigods were thinking. Eventually, they looked away, and followed Gu Tianjun to formally escort the newcomers into the Saint-Emperor Dynasty.</p><br/><p>The battleship followed along, leaving the Eternal Sea and heading through the buffeting winds toward Saint-Emperor City.</p><br/><p>Everyone felt a lot of pressure, and no one spoke. Two hours later, the effects of the Saint-Emperor’s voice began to fade from the Giant Ghost King, whereupon a look of astonishment appeared deep in his eyes.</p><br/><p>“From distant Saint-Emperor City, he said a single sentence that put me in a daze for that long?!?!” The Giant Ghost King was shaken, and his fear of the archaean emperors suddenly grew far deeper.</p><br/><p>“It's because this is your first time dealing with an archaean,” Gongsun Wan’er said, smiling faintly. “And you actually benefited from being a Heavenspan cultivator. Someone from the Saint-Emperor Dynasty would find their Willpower affected for days, during which time they would feel fanatical devotion!” Gongsun Wan’er currently had her cultivation base sealed, but that didn’t affect her overall level. She had her Daoseed, and was also from the Vile-Emperor Dynasty, and therefore recovered much more quickly, although not as quickly as Bai Xiaochun.</p><br/><p>“If it ever happens to you again, you won’t be as severely affected, at least not unless the archaean intentionally makes it worse.” After finishing with her explanation, Gongsun Wan’er looked over at Bai Xiaochun, who still stood there at the prow of the ship. Curiosity flickered in her eyes; she was truly interested in Bai Xiaochun's uniqueness.</p><br/><p>“I wonder if what he said is true,” she thought. “Does he really rank as high as the two emperors…. Or does he cultivate some technique that gives him the power to stand up to them!?” As Gongsun Wan’er pondered the matter, the Giant Ghost King regained more of his senses, and also looked over at Bai Xiaochun. All of a sudden, he realized that… maybe Bai Xiaochun really could become the hope of the Heavenspan Realm!</p><br/><p>Bai Xiaochun could sense that the two of them were looking at him. Although his expression remained placid, inwardly he was feeling very pleased with himself. That calmness, and the way he remained steady under pressure earlier, was becoming something of a habit.</p><br/><p>But then he considered that the emperors of the two dynasties were both experts in the Archaean Realm, and his nervousness mounted.</p><br/><p>“This won’t do,” he thought. “If I start getting nervous every time I think about them, how am I supposed to stay in a good mood?” All of a sudden, his eyes lit up.</p><br/><p>“Hold on. These two dynasties have funny names if you think about it. Vile-Emperor Dynasty? Instead of <em>vile</em>, how about <em>smile</em>! Yeah… the Smile-Emperor!</p><br/><p><span id=\"footnote-ref-cc74\"><span>“And instead of Saint-Emperor Dynasty… how about <em>paint</em>? Heh. The Paint-Emperor!” </span>[1]</span></p><br/><p>All of a sudden, he felt much more at ease. He also couldn’t help but turn to Gongsun Wan’er and ask, “Wan'er, does everyone from the Smile-Emperor Dynasty like to smile?”</p><br/><p>“What?” Gongsun Wan’er replied, stunned. Then her eyes hardened into a glare, and any feeling of wonderment from before vanished. After all, never in her life had she ever heard anyone say <em>Smile-Emperor</em> before.</p><br/><p>Gongsun Wan’er’s glare caused Bai Xiaochun to feel slightly awkward, so he quickly looked away and went back to trying to seem grand and proud.</p><br/><p>Down below, mountains and rivers stretched out in all directions…. The immortal domain they had come to also contained the capital city of the Saint-Emperor Dynasty. Therefore, after a few days of travel, they crossed a wide plain and, as evening fell… caught sight of an enormous mountain off in the distance!</p><br/><p>It rose up dramatically into the sky, and had a very distinct outline.</p><br/><p>It was definitely the largest mountain Bai Xiaochun had ever seen before in his life, and took up more than half of the prefecture. In fact, it was roughly half the size of the entire Heavenspan Realm!</p><br/><p>A mortal who tried to climb this mountain wouldn’t be able to reach the top in an entire lifetime!</p><br/><p>It was no exaggeration to say that it connected the earth to the heavens!</p><br/><p>At the very top of the mountain, there was no peak, only a massive heavenly pond!</p><br/><p>Although the pond looked small when compared to the mountain as a whole, it was still huge. Dense mist roiled out from the pond, connecting it to the surrounding clouds and making the entire place seem like a paradise for immortals.</p><br/><p>Lotus leaves floated on the surface of the water, each one seemingly as large as an island. In fact, upon closer inspection, all of the lotus leaves actually had spectacularly luxurious buildings on them!</p><br/><p>There were thousands of such lotus leaves, all of them floating around something even more shocking, which lay at the very middle of the pond. It was a gargantuan lotus flower!</p><br/><p>It was beautiful to the extreme, and emanated a shockingly pleasing aroma. Built onto the petals of the flower were buildings of the most flawless white jade imaginable. This was… the imperial palace!!</p><br/><p>The lotus flower was the palace, the lotus leaves were the city. This was none other than the capital of the Saint-Emperor Dynasty, a place known as… Saint-Emperor City!</p><br/><p>This mountain, this pond, and this city surpassed anything Bai Xiaochun could ever have imagined.</p><br/><p>Bai Xiaochun wasn’t the only one to be shaken. When the Giant Ghost King caught sight of the heavenly pond, his jaw dropped. It was unlike anything that had ever existed in the Heavenspan Realm.</p><br/><p>Gongsun Wan’er was the only one to have little reaction. She had heard of the wonders of Saint-Emperor City before, although in her heart, the capital city of the Vile-Emperor Dynasty was far grander.</p><br/><p>Gu Tianjun didn't react to Bai Xiaochun’s shock, but the demigods were clearly very proud of their capital city, which was the most holy location in the land.</p><br/><p>As the battleship got closer to the pond, Bai Xiaochun noticed numerous dragonfish swimming in the water. Occasionally, they would leap out of the water, and when the evening sun landed on their golden scales, it was a dazzling sight.</p><br/><p>This city amongst the clouds actually surpassed any celestial paradise!</p><br/><p>Soon, the cultivators who lived in Saint-Emperor City noticed the bone lizard battleship sailing through the air above them.</p><br/><p>Within the imperial palace were all of the officials of the imperial court, whom the Saint-Emperor had summoned. When they looked up, some gazes were those of curiosity, while others were hostile. Most were arrogant to the extreme, as if they were the rulers of a massive country looking at common farmers from a tiny nation.</p><br/><p>Even as Bai Xiaochun and his allies prepared to enter Saint-Emperor City itself, a piercing voice echoed out from the imperial palace.</p><br/><p>“The Saint-Emperor has summoned Heavenspan Realm cultivators Bai Xiaochun and Giant Ghost for an audience!”</p><div id=\"footnote-cc74\"><br/><p>1. In this passage I’m trying to keep the spirit of the Chinese, instead of translate it directly. It’s a little bit of rhyming wordplay that sounds silly and funny. If you translated it all directly, it wouldn’t make much sense in English. In the Chinese, the word for Vile-Emperor rhymes almost perfectly with the word for “crab roe”, or at least, the orangeish-yellow soft meat inside of a crab, which is considered somewhat of a delicacy. Then, he picks a word that has a close pronunciation to Saint-Emperor, and also has the character <em>saint</em> as part of the component of one of the characters, but which means “razor clams”. All in all, it’s pretty funny in Chinese, but doesn’t come across in direct translation. Incidentally, Madam Deathblade absolutely loves that orange crab stuff. It’s one of her favorite things to eat. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}