{"title": "Chapter 1071: There Are Still Lotus Roots....", "id": 1071, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1071-there-are-still-lotus-roots", "volume_title": "Volume 11", "body": "<h1>Chapter 1071: There Are Still Lotus Roots....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>No one could ever have predicted that the little turtle who had secretly eaten such a vast number of lotus seeds would be appointed as the Saint-Turtle of the Saint-Emperor Dynasty. Although it seemed completely preposterous, it certainly resolved the issue of the lotus seeds.</p><br/><p>The rewards given to Bai Xiaochun ensured that the matter was already a thing of the past. Everyone was effectively silenced as the Saint-Emperor departed the scene happily. However, unlike past incidents, the officials did nothing to cover up their frustration and anger at Bai Xiaochun as they glared at him.</p><br/><p>After all, the Saint-Emperor hadn’t really lost out on anything in this incident. Only they had….</p><br/><p>Bai Xiaochun was just as stunned by this turn of events as everyone else. However, after thinking about it, he realized that the little turtle must have planned on this from the beginning. He knew that the Saint-Emperor would recognize him immediately if he ever saw him in person.</p><br/><p>That was why the little turtle had dared to so brazenly eat the lotus seeds, and was also why he had so openly declared his relationship with Bai Xiaochun.</p><br/><p>There were still a few things he wasn’t completely sure about, but in the end, now that the incident was concluded, they didn’t really matter.</p><br/><p>Clearing his throat, he looked around at the court officials, stuck his chest out and stood up taller and straighter, and finally, swaggered out of the palace.</p><br/><p>The cultivators’ eyes glittered with cold light as they watched him go. At this point, many of them were coming to realize the reality of the situation…. Early on, they might have been able to come up with ways to have Bai Xiaochun punished, but now, that had changed.</p><br/><p>The little turtle had been appointed the Saint-Turtle, which meant that Bai Xiaochun was even more important than before. As of now, there was no one in Saint-Emperor City who could do a single thing to him.</p><br/><p>Although the Saint-Emperor still had his misgivings, the way events had played out spoke volumes.</p><br/><p>The truth was that if the little turtle’s identity hadn’t been revealed, the Saint-Emperor would have crushed Bai Xiaochun the moment he saw the empty seed pods.</p><br/><p>For the Saint-Emperor, enough was enough. Never before had any cultivator dared to do the things Bai Xiaochun had done in Saint-Emperor City. But the little turtle was too important. That was especially true considering that the Eternal Turtle was rumored to be able to give cultivators better control of Willpower. To the Saint-Emperor, that was beyond crucial, and could give him the edge he needed to break out of the Archaean Realm.</p><br/><p>The mere thought of that caused his heart to race with joy.</p><br/><p>The little turtle had worded things in a very clever way. Although some people might not have picked up on it initially, the Saint-Emperor had understood the implications immediately.</p><br/><p>The Eternal Turtle belonged to Bai Xiaochun!</p><br/><p>Once the Eternal Turtle bonded a master, it couldn’t be changed. Not even killing Bai Xiaochun would do anything, and would in fact enrage the turtle.</p><br/><p>The only way to get the Eternal Turtle to willingly stay in Saint-Emperor City was… to get Bai Xiaochun’s approval!</p><br/><p>The Saint-Emperor knew that everyone had value in some way. Whether they were celestials or demigods, it was the same. Bai Xiaochun was valuable because of his status in the Heavenspan Realm. In fact, in some ways he was even more important than a celestial. When you added in the matter of the Eternal Turtle, it made him so important that the Saint-Emperor even feared him to a degree.</p><br/><p>Although the rest of the officials in Saint-Emperor City didn’t quite understand all of that, they could guess at it.</p><br/><p>“This damned bastard ate tons of heavenly dragonfish, and then a bunch of lotus seeds, and in the end, everything worked out fine for him!”</p><br/><p>“He really is a walking disaster! He defiled the heavenly dragonfish, and then nearly wiped out all of the lotus seeds. And yet his co-conspirator ended up being named the Saint-Turtle!!”</p><br/><p>“He should never have been allowed to stay in Saint-Emperor City!!”</p><br/><p>Filled with various negative thoughts, the crowd dispersed, until Bai Xiaochun was the only one standing there.</p><br/><p>As for Heavenly Marquis Liu, he was already slipping into a major depression. He had just been preparing to list out the 500 crimes that Bai Xiaochun had committed when the Saint-Emperor interrupted him with roaring laughter. He was more stunned now than he had ever been in his entire life.</p><br/><p>“Just like back in the Wildlands….” he thought, shivering.</p><br/><p>Another half a month went by.</p><br/><p>News of the lotus seed incident spread throughout Saint-Emperor City. Furthermore, the fact that there would be no lotus seed auctions had major repercussions in both of the two immortal domains controlled by the Saint-Emperor Dynasty.</p><br/><p>What was even more shocking, though, was the news about the Saint-Turtle, which caused a stir even in the Vile-Emperor Dynasty.</p><br/><p>As for Bai Xiaochun, he was uncharacteristically quiet, spending the entire month consuming lotus seeds and immortal pills to advance his cultivation base.</p><br/><p>Although he didn’t achieve a breakthrough to become a celestial, he was getting closer and closer to that point. By the time the lotus seeds and immortal pills stopped being effective, he was at the very peak of the great circle. Now, it was as if he were right up against a huge, seemingly insurmountable barrier.</p><br/><p>“So close….” he murmured sadly. At this point, he could tell that no amount of slow and steady progress would get him past that wall. He needed something amazing to help him break the barrier down in one shot.</p><br/><p>Meanwhile, much attention was paid to the little turtle. The half a month passed in somewhat of a whirlwind for him. Of course, the Saint-Emperor didn’t cause any problems for him. He only asked that the turtle accompany him for three or four hours a day during cultivation. Other than that, there were no limitations placed on him.</p><br/><p>The little turtle could go about freely in Saint-Emperor City. In fact, he could have or do just about anything he wanted. He could even eat heavenly dragonfish if he felt like it….</p><br/><p>As far as the lotus seeds went… it all depended on the little turtle’s mood. Eventually, he went to talk with Bai Xiaochun about everything that had occurred earlier. When Bai Xiaochun heard the whole story, he was a bit jealous, but didn’t dare to say anything. Even worse, the little turtle’s shell seemed to shine more brightly every time he came to visit, an indication of how well he was eating….</p><br/><p>And that wasn’t even mentioning how the turtle seemed to be gaining a lot of weight….</p><br/><p>“Ai, there’s really nothing I can do, little Xiaochun. You have no idea how rough life is.</p><br/><p>“I’ve eaten so many immortal pills I can hardly stand them anymore. The Saint-Emperor, and even that celestial named Chen Su, stuffs me with them.</p><br/><p>“The worst of them is Gu Tianjun. Can you believe that he gave me an entire harem of female turtles? They’re completely shameless! All they want to do is fight over who will be the first to lay a batch of eggs!</p><br/><p>“It’s so annoying!” Despite the turtle’s sighs, it was impossible for him to conceal how pleased he was with his wonderful life.</p><br/><p>Despite the fact that the little turtle kept providing Bai Xiaochun with a supply of immortal pills and other such things, now that Bai Xiaochun was in the great circle, none of them were enough to break through the barrier that held him back.</p><br/><p>Whatever item it was that could help him break through apparently didn’t exist in the Eternal Lands. If it did, then the Saint-Emperor Dynasty wouldn’t only have four celestials.</p><br/><p>After seeing how proud the little turtle was with himself, Bai Xiaochun thought for a moment, then lowered his voice and said, “Hey little turtle, I know you can eat the dragonfish and the lotus seeds, but what about… the lotus roots down at the bottom of the lake? Can you eat those too?”</p><br/><p>“Lotus roots!?” The little turtle’s eyes suddenly began to shine brightly.</p><br/><p>“I bet they’re more effective than anything else!” Bai Xiaochun was licking his lips just thinking about it. \"How about you go down and grab one? We can try it out together!”</p><br/><p>The little turtle was already looking excited at the prospect. After all, it had only eaten the lotus seeds up to this point.</p><br/><p>Seeing this reaction, Bai Xiaochun decided to strike while the iron was hot, and began to negotiate.</p><br/><p>“50/50?” the little turtle said, glaring. “No way. 90/10!”</p><br/><p>Bai Xiaochun sighed.</p><br/><p>“Listen, little turtle, we’ve known each other for years now. From the Blood Stream Sect to the River-Defying Sect, then the Wildlands. And now here we are in the Eternal Lands. We have to rely on each other to survive! We're partners! You know, in some respects, we're basically family. You ate tens of thousands of lotus seeds, and I didn’t say anything. Now I’m trying to achieve a cultivation base breakthrough! What’s the point in you being so stingy?” It was with bloodshot eyes that Bai Xiaochun tried to appeal to the little turtle’s emotions, even putting a look of pain into his own eyes as he spoke.</p><br/><p>This was the little turtle’s first time seeing Bai Xiaochun talk to him in this way, and he was clearly taken aback. Suddenly feeling a bit sorry, he sighed.</p><br/><p>Sounding hurt, he said, “Ah, whatever. Look, 90/10 it is. 90 for you, 10 for me! I won’t sneak any extra before you make your breakthrough!”</p><br/><p>With that, he turned and blurred into motion toward the heavenly pond.</p><br/><p>At that point, Bai Xiaochun’s eyes began to shine.</p><br/><p>“Who would have thought that <em>this</em> was the way to deal with the little turtle!?”</p><br/>\n</div>"}