{"title": "Chapter 1078: The Damaged Fan Hits!", "id": 1078, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1078-the-damaged-fan-hits", "volume_title": "Volume 11", "body": "<h1>Chapter 1078: The Damaged Fan Hits!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Anyone who could view the scene from out in the void would see something that looked like a burning meteor, descending with shocking energy and momentum!</p><br/><p>The speed involved defied imagination!</p><br/><p>Earlier, despite the fact that the damaged fan had changed trajectory because of Bai Xiaochun, it hadn’t been on course to hit the Eternal Immortal Domains. Furthermore, its speed hadn’t been that shocking. As such, neither the Vile-Emperor nor the Saint-Emperor had noticed it. But now….</p><br/><p>As the fan’s momentum built, and its trajectory became locked in, strange signs began to appear in the Eternal Immortal Domains. The first place to be affected was the Eternal Sea!</p><br/><p>The water was tugged at as if by tidal forces, and rumbling sounds echoed out in all directions. Mist began to rise up from the sea, and the shores of the immortal domain were battered by massive waves.</p><br/><p>The living beings in the Eternal Immortal Domains were all struck with deep shock. Meanwhile, as the Saint-Emperor flew up into the sky, Gu Tianjun and the other two celestials looked up in astonishment. As for Bai Xiaochun, he had just completed his breakthrough and created his Former Will, and had been about to leave his blessed land. That was when he felt an incredible pressure, along with an indescribably intense sensation of crisis.</p><br/><p>“Something dangerous is coming from above!” Blurring into motion, he flew high into the sky!</p><br/><p>It wasn’t just the Saint-Emperor Dynasty in which such things occurred. In Vile-Emperor City, the archaean Vile-Emperor blurred into motion to appear up above, where he headed up to the very limits of the sky.</p><br/><p>He was followed by four beams of light, which were the celestials of his dynasty. Two celestials did not come, one of them being Ghostmother. Of those present, all wore looks of incredulity as they peered high into the sky.</p><br/><p>When people in both of the capital cities saw the dramatic events playing out with the emperors and the celestials, their hearts filled with sensations of unease.</p><br/><p>“That… that’s….”</p><br/><p>“What is that?!?!”</p><br/><p>As people cried out in alarm, they began to look up into the sky, where something like a burning meteor was now visible. Based on their vantage point, it didn't seem to be moving very quickly, although that couldn’t have been less the case.</p><br/><p>The Saint-Emperor and Vile-Emperor teleported to the limits of the world, until they were almost hovering out in the void itself. Their senses were more acute than those of anyone else in the world, and they could also physically see the bright, glowing light of the approaching fan. It was moving so incredibly quickly that it would arrive within only about ten breaths of time.</p><br/><p>Both emperors could tell that the thing was going so fast that… neither of them could possibly stop it!</p><br/><p>It was at this point that both of them breathed sighs of relief. No one else would be able to see it, but because of their incredible cultivation bases, they were able to pick up on clues which pointed to the fact that the fan would not strike the Eternal Immortal Domains, but rather, the enormous sovereign.</p><br/><p>As the fan neared, their hearts calmed to some extent. However, they were still shocked as they realized that the aura of the fan seemed to be that of an archaean.</p><br/><p>Despite the fact that the moment of crisis seemed to have passed, the two of them remained in place just in case something unexpected occurred.</p><br/><p>The Vile-Emperor turned to look at the Saint-Emperor, and spoke in a sinister and cold voice. “It’s big, but it’s nothing more than a damaged archaean treasure. It won’t cause any problems. Now that it's here, though, I’ll take six spots!”</p><br/><p>The Saint-Emperor smiled, and in response to the Vile-Emperor’s coldness, spoke in the warmest of voices. “It’s been a long time since any damaged treasures fell into the Eternal Immortal Domains from the void. If it weren’t for the vortex created by Bai Xiaochun upon becoming a celestial, it would never even have come. The Saint-Emperor Dynasty can claim credit for this damaged fan. Based on that, do you really think I’ll let you have six spots? Impossible!”</p><br/><p>The Vile-Emperor chuckled coldly. Ignoring the Saint-Emperor, he focused on the incoming fan, which was now little more than a streak of light.</p><br/><p>Anyone other than these two who were this close to the fan would likely have been killed. But they were archaeans, and were therefore qualified to observe it from this close distance.</p><br/><p>Closer and closer….</p><br/><p>After a few breaths of time passed, the huge fan slammed into the continent-sized hand of the gigantic sovereign, causing a massive rumbling sound to fill the Eternal Immortal Domains!</p><br/><p>It was louder than heavenly thunder, and caused the five immortal domains to tremble. The Eternal Sea churned and heaved wildly.</p><br/><p>Bai Xiaochun hovered in midair as the deafening sound rolled out, looking up in the direction of the enormous sovereign’s right hand. There, teetering back and forth… was an enormous, damaged fan!</p><br/><p>He could sense something otherworldly about the fan, and the aura which spread out from it into the Eternal Immortal Domains reminded Bai Xiaochun very much of what it felt like to be in the presence of the Saint-Emperor.</p><br/><p>“That’s….” Not too far off, Gu Tianjun and the other celestials were also in the air, shaken as they stared up at the fan.</p><br/><p>“An archaean magical item….”</p><br/><p>“That aura… is described in certain ancient records. It’s the aura of the Immortal from before the great destruction!!”</p><br/><p>It wasn’t just Gu Tianjun and the other celestials who were shaken. The celestials in the Vile-Emperor Dynasty were equally stunned. Even Gongsun Wan’er, who was in a distant location at the moment, was taken aback.</p><br/><p>There were also many demigod experts within the Eternal Immortal Domains who were now staring up at the enormous damaged fan, their eyes burning with passion.</p><br/><p>The enormous hand was not harmed by the fan slamming into it, and in fact, didn’t even move at all in response. But as for the fan, it was severely damaged by the force of the impact. Cracks spread out on its already damaged surface, and then, chunks and rubble began to fall down off it, becoming like blazing meteorites that rained down onto the Eternal Immortal Domains.</p><br/><p>There were millions of chunks of such rubble, all of which shot down with shocking speed and energy.</p><br/><p>In that very moment, both the Saint-Emperor and the Vile-Emperor took action. Their hands blurred with incantation gestures, causing two immense fields of light to shoot out.</p><br/><p>One field was blackish violet, the other was made of five colors, and wherever they went, they transformed the falling rubble into ash. Afterward, both of the emperors sent divine sense out to touch the huge fan.</p><br/><p>Although the huge fan was severely damaged, both the face and the frame of the fan remained intact. As for the image depicted on the face of the fan, it was that of an entire world.</p><br/><p>“It’s a world treasure. Sadly, it’s energy is fading. Who knows how many things it struck on its journey through the stars. It’s already crumbling and worthless.” Both the Vile-Emperor and the Saint-Emperor shook their heads as they continued to scan the fan.</p><br/><p>In the end, they confirmed that the fan did not, in fact, have any of the aura of a sovereign on it. It only contained archaean fluctuations, much the same as the two of them emanated. In fact, it was a bit weaker than that.</p><br/><p>Had the fan been a sovereign-level treasure, they would have been very excited, and would have gone to investigate it themselves. But it was not such a treasure, making it of little interest to the two emperors.</p><br/><p>However, even as they retracted their divine sense, something else happened. Among all of the countless bits of falling rubble that were being destroyed by the divine abilities they had just unleashed, there was a mountain-sized building. When the building was shattered, a lump of decaying black stone shot out from it!</p><br/>\n</div>"}