{"title": "Chapter 1085: I Hate Cheaters!", "id": 1085, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1085-i-hate-cheaters", "volume_title": "Volume 11", "body": "<h1>Chapter 1085: I Hate Cheaters!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun’s vision blurred as he left the world of the sixth level, and returned to the path on the fan rib. Upon rematerializing, he held a feather in his hand, which was the reward for passing the sixth level.</p><br/><p>It seemed like nothing more than an ordinary feather, and not even a close examination revealed anything special about it. Bai Xiaochun could only guess that it might be part of some larger construct. Putting it away, he headed to the seventh level.</p><br/><p>The seventh level was much harder than the previous levels. It was a test, not of the cultivation base, but rather intuition. After all, it was impossible to use divine sense here. The entire seventh level was… a maze.</p><br/><p>“I hate mazes….” he muttered. Two hours later, he found himself teleported back to the square formed by the handle of the fan. He had failed, and currently felt his head swimming from having wandered back and forth in the maze without being able to find the right path.</p><br/><p>As it turned out, there was a time limit to these lower levels. If one spent two hours within a given level without passing it, they would automatically be teleported away.</p><br/><p>There were other devas and demigods who would be teleported out occasionally, most of them having been unable to pass the sixth level. Up to this point, only seven people had made it past the seventh level!</p><br/><p>In addition to Bai Xiaochun and the other celestials, there was only one demigod among that group: Preceptor Seadeep.</p><br/><p>Varied thoughts ran through the heads of the trial-takers.</p><br/><p>“Dammit, this is hard! Especially the sixth level. It's impossible to get past!”</p><br/><p>“These tests are definitely not designed for devas. The sixth level… is definitely suitable for celestials only! Maybe a demigod could pass it… but not many!”</p><br/><p>“I have to get past it! These rewards are so incredible! Especially the reward for the fifth level. I got a bottle of Meridian-Tempering Serum of peerless quality! Back home, a bottle like that would go for over 10,000 spirit stones!!”</p><br/><p>The cultivators of a given dynasty did not mix with those of the other. However, those of shared origins would gather after failing a level to discuss their results with each other. Up to this point, everyone was still excited about the situation, and didn’t worry too much about failing.</p><br/><p>“If the reward for the fifth level is Meridian-Tempering Serum, then what do you think the rewards for the sixth and seventh levels will be? Whatever they are… they’ll probably be more unique and precious than Meridian-Tempering Serum!”</p><br/><p>“We probably don't qualify to even find out. Although, I noticed that Celestial Virūpākṣa seems to be the fastest of us all. He’s already on the tenth level!”</p><br/><p>“Yeah, I saw him going into the tenth level. So far, the rest of the celestials are in the seventh and eighth levels. Up to now, none of them have come back out.”</p><br/><p>Bai Xiaochun was not very happy about what he was hearing, and also had a bad premonition about what was happening.</p><br/><p>“How is that Celestial Virūpākṣa going so fast!? With muscles like that, there’s no way he’s very smart. How did he get through the maze?” The more he thought about it, the more he started to suspect what was happening.</p><br/><p>If things kept going this way, it didn’t seem likely that he would be able to compete with Virūpākṣa. Although he wasn’t quite willing to just give up, in the end, he sighed.</p><br/><p>“Ah, whatever. It just keeps getting harder the further along you go. And I just became a celestial. He has a lot of experience, so if I can’t beat him, I just won’t worry about it. I’ll go through the levels as best I can. Even if I don't get the fan in the end, I’ll at least get some of the other rewards.” It was in this manner that he tried to convince himself not to worry about the situation. Then he started to try to think of a way to get through the maze.</p><br/><p>However, it was at this very moment that the light of teleportation appeared in both the seventh and eighth levels. When that light reached the square formed by the handle of the fan, Gu Tianjun and Prince Ur-Demon appeared.</p><br/><p>Both of them wore very unsightly expressions as they sat down to think and recover. From what Bai Xiaochun had seen, Gu Tianjun had failed in the eighth level, while Prince Ur-Demon was stuck in the seventh.</p><br/><p>“There’s something fishy about that eighth level!” he thought. Even as he pondered the situation, other celestials began to be teleported out.</p><br/><p>One of them was Sima Yunhua, who was stuck in the seventh level, and another was Reverend Devourer, who was teleported back from the eighth level.</p><br/><p>Bai Xiaochun couldn’t dispel his confusion and suspicions. For a moment, he considered going over to Gu Tianjun to ask for some advice, but decided that, considering how much the man didn't like him, it probably wasn’t a good idea.</p><br/><p>At this point, Sima Yunhua gritted his teeth and used some unknown method to communicate with Gu Tianjun and get some information on the seventh level. Afterward, his eyes shone brightly as he headed back into the challenges.</p><br/><p>Prince Ur-Demon did the same thing with Reverend Devourer. After getting the information he needed, he did the same as Sima Yunhua, and headed back into the challenges.</p><br/><p>Bai Xiaochun looked on anxiously to see what was happening, and was stunned to realize that both parties passed the level in the time it takes half an incense stick to burn. Laughing heartily, they then proceeded on to the next levels.</p><br/><p>“So fast!?!?” Bai Xiaochun’s mind raced as he tried to analyze what was going on. Meanwhile, the tenth level suddenly began to shine with bright light.</p><br/><p>All of a sudden, a voice spoke into the minds of all present.</p><br/><p>“The first person to pass the tenth level has acquired Top Contender status, and will henceforth have four hours to pass every level!”</p><br/><p>As the voice faded away, everyone observing on the outside looked around in shock. Meanwhile, the light of teleportation shot out to the square where everyone was standing, and then resolved into the form of Celestial Virūpākṣa.</p><br/><p>As his hulking, tower-like frame came into view, the fan trembled, and the shield protecting the entire area rippled like water.</p><br/><p>Those ripples were caused, not by Virūpākṣa’s cultivation base, but rather… because he had gained Top Contender status by passing the tenth level and gaining the approval of the sovereign’s damaged fan!</p><br/><p>What was most shocking, though was that Celestial Virūpākṣa had been given extra time to pass the levels!</p><br/><p>Based on that, it seemed likely that other privileges would be bestowed upon passing the twentieth level, which would make things even easier for Celestial Virūpākṣa. If things kept going like that, then by the time the three months were over, it was highly likely that Virūpākṣa would become the new owner of the fan!</p><br/><p>If that happened, then not even the Vile-Emperor would be able to take it away from him easily. Perhaps Virūpākṣa could loan it to him or even sell it, but either way, it was good fortune that would likely give him a chance to become an archaean!</p><br/><p>The crowd knew it, and Celestial Virūpākṣa knew it as well. Inside, he was beaming with joy and excitement, although he didn't let that show on his face. However, there was no question that he was very pleased to have acquired the approval of the fan.</p><br/><p>The prickly feeling in Bai Xiaochun’s heart grew even stronger at this point. Snorting softly, he prepared to simply look away, and yet, was too slow. All of a sudden, Celestial Virūpākṣa looked over at him with coldly glittering eyes.</p><br/><p>It was impossible to say what exactly he was thinking, but something like the light of augury flickered in his eyes, and he suddenly chuckled.</p><br/><p>Raising his voice, he said, “You’re stuck at the seventh level, aren’t you Bai Xiaochun? Moron. You’re the only celestial who hasn’t passed it.”</p><br/><p>Everyone else was taken aback. After all, this was Celestial Virūpākṣa’s first time returning from the challenges. And yet apparently, he knew how far everyone else had proceeded.</p><br/><p>Even as suspicions arose, Bai Xiaochun looked sharply at Celestial Virūpākṣa, fully aware of the implications of his words.</p><br/><p>Obviously, he had some unknown way of seeing how far everyone else had progressed.</p><br/><p>Celestial Virūpākṣa could tell that Bai Xiaochun was on to him, but merely laughed coldly.</p><br/><p>“Didn’t you ask me to hit you earlier, Bai Xiaochun? Don’t worry. As soon as I become the owner of this fan, I’ll be happy to oblige!” With that, he chuckled and sat down cross-legged to do some breathing exercises.</p><br/><p>In the resulting silence, the cultivators from both the Vile-Emperor Dynasty and the Saint-Emperor Dynasty all came to realize that the Top Contender status gave more benefits than merely an extension of time.</p><br/><p>As for Bai Xiaochun, he was feeling more irritated than ever.</p><br/><p>“What kind of legacy is this? He’s obviously cheating! Dammit! There’s nothing I hate more in life than cheaters!!”</p><br/>\n</div>"}