{"title": "Chapter 1082: Come On, Hit Me!", "id": 1082, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1082-come-on-hit-me", "volume_title": "Volume 11", "body": "<h1>Chapter 1082: Come On, Hit Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In response to Gu Tianjun speaking out the name ‘Celestial Virūpākṣa’, Bai Xiaochun’s eyes flickered. He had heard of Celestial Virūpākṣa before. The town that Bai Xiaochun had stayed in for a time in the Vile-Emperor Dynasty had been in the immortal domain overseen by him.</p><br/><p>Later, Ghostmother took over that immortal domain. If things had not suddenly changed, it would likely have been Celestial Virūpākṣa that he tangled with. And considering the level of his cultivation base at the time, it would have been difficult for Bai Xiaochun to kidnap him.</p><br/><p>The man was built like a tower, and as he stood there, intense pressure radiated off of him that caused the pupils of Gu Tianjun and Sima Yunhua to constrict.</p><br/><p>“The Vile-Emperor Dynasty sent three celestials…?” Bai Xiaochun thought, blinking a few times. “I guess they could only send six in total.”</p><br/><p>Clearly, the two emperors had come to an agreement about how many people to send.</p><br/><p>Even as Bai Xiaochun considered the matter, Celestial Virūpākṣa looked over at him. Then, he spoke in a cold voice that demanded answers from anyone who heard it.</p><br/><p>“Are you that useless stray dog Bai Xiaochun?”</p><br/><p>From the way the man singled him out, Bai Xiaochun could tell that he had nothing but ill intentions toward him. Furthermore, it seemed highly likely that he hoped to start a conflict that would escalate into an actual fight.</p><br/><p>Otherwise, why would he be so overtly insulting?</p><br/><p>“Does he really want to attack me physically? Maybe use me to put pressure on everyone else?” Alarmed, he tried to decide what to do. Before he could, Prince Ur-Demon stepped forward and looked at Bai Xiaochun, his eyes shining with strange light.</p><br/><p>“I heard that the secret of spirit enhancement is locked inside the blood of the people of Heavenspan. Do you mind… giving me some of your blood to taste?” Bai Xiaochun sucked in a breath. First Celestial Virūpākṣa started causing problems, and now this clearly villainous Prince Ur-Demon was joining in. Bai Xiaochun already had a bad feeling.</p><br/><p>And yet, before that bad feeling could even begin to fade, Reverend Devourer chuckled hoarsely, looked at Bai Xiaochun, and then licked his lips.</p><br/><p>“I'm curious, not only about spirit enhancement, but also the unique flame conjuring techniques of the lands of Heavenspan. Supposedly you use souls as the main ingredient. I asked around, Bai Xiaochun, and everyone said that you are the only heavenly necromancer to ever exist.” A greedy gleam flickered within Reverend Devourer’s eyes.</p><br/><p>At this point, Bai Xiaochun’s heart was pounding harder than ever, and his scalp was tingling like mad. With the vicious-looking Reverend Devourer in the mix, he now had three celestials all focused on him!</p><br/><p>“Dammit! I haven’t even gotten to say anything! I was trying to keep a low profile! I didn’t provoke any of these lunatics, and yet they’re already teaming up to target me?!” Bai Xiaochun was nervous, and scared about being in such a passive position. Glancing over at Gu Tianjun and Sima Yunhua, he could see that they were obviously not going to back him up.</p><br/><p>From their perspective, this was the perfect opportunity to see what Bai Xiaochun’s battle prowess was like now that he had broken through and become a celestial.</p><br/><p>Bai Xiaochun’s anxiety mounted when he realized what they were thinking. Although he was scrambling to try to decide what to do, only a few breaths of time had passed so far. Seeing the three celestials all staring at him, Bai Xiaochun took a deep breath and stepped forward.</p><br/><p>“Time to put everything on the line,” he thought. “I can’t be scared. In fact, I need to strike fear into <em>their</em> hearts. How to do it, though? If they join forces, the probably won't kill me, but would beat me up pretty badly. I guess one upside to this place is that neither divine sense nor ordinary senses work well in this place. I can’t see anything about their level, but they can’t see anything about mine either.” Inwardly anxious, he threw his head back and laughed uproariously. Flicking his sleeve, he stared at the other celestials, battle spirit flickering in his eyes, as well as a bit of derision.</p><br/><p>Sneering, he said, “It's been a long time since anyone has dared to say such things in my presence.”</p><br/><p>He almost seemed to regret that fact, as though he were thinking back to wonderful things from when he was younger.</p><br/><p>“Now that I think about it, the last person who said something like that to me was another celestial from the Vile-Emperor Dynasty. Who was it? Oh, right. Ghostmother.” Chuckling, and seemingly thrumming with battle spirit, he looked at the three celestials, pursing his lips as if to suppress his laughter. Although his heart was racing with anxiety, his eyes shone with utter madness.</p><br/><p>“I've been restraining myself for some time now,” he sighed. “I’d hoped to keep a low profile here in the Eternal Immortal Domains, but, ah, whatever…. Come on. I’ll let one of you to try to make me cough up some blood. If even a drop comes out, then you can keep it!”</p><br/><p>When Celestial Virūpākṣa heard Bai Xiaochun’s words, his eyes flickered with cold light. Smiling viciously, he blurred into motion, placing himself right in front of Bai Xiaochun, upon whom he unleashed a fist strike.</p><br/><p>Bai Xiaochun didn't even attempt to dodge. He knew that he had to strike fear into the hearts of these three celestials from the Vile-Emperor City. If he tried to evade this strike, or fought back, the three of them would surely team up on him.</p><br/><p>As for the damned Gu Tianjun and Sima Yunhua, they seemed content to just watch the excitement. Unless they were personally threatened, they wouldn't do anything to stop it. There was no time for thought or planning. However, he didn’t need to. He had long since donned numerous layers of leather armor, beneath which lurked his turtle-wok….</p><br/><p>He had been prepared from the very beginning to dodge if the fist strike wasn’t aimed at his torso.</p><br/><p>But it was, and therefore, Celestial Virūpākṣa’s fist, which let out a string of sonic booms as it closed in, slammed directly into Bai Xiaochun’s chest!</p><br/><p>Bai Xiaochun didn’t even attempt to move out of the way, causing the eyes of all five of the other celestials to widen.</p><br/><p>And of course, there was no need to even mention the reaction of all the other cultivators present. When the fist landed, Bai Xiaochun didn’t move. A huge boom rang out, and much of his leather armor was destroyed, but he himself was not harmed. Not even a drop of blood oozed out of his mouth.</p><br/><p>In sharp contrast, the towering, burly Celestial Virūpākṣa grunted in pain. To him, it felt as though he had struck an immovable mountain. An indescribably powerful backlash hit him with devastating force, shattering his hand and sending him staggering backward several paces, blood oozing out of his mouth. His five yin organs and six yang organs vibrated dangerously, and his eyes widened as surely as if he had seen a terrifying ghost.</p><br/><p>“How is this even possible!?!?” Celestial Virūpākṣa blurted in shock. “You just became a celestial! Even if you have a strong fleshly body, you shouldn't be able to stand up to a strike like that! You must have some precious treasure, don’t you!?”</p><br/><p>Unfortunately for him, he couldn’t use his divine sense, and therefore had no way to even look for clues to figure out what had just occurred.</p><br/><p>“So weak!” Bai Xiaochun sneered. “Don’t you have any defensive precious treasures to protect you from measly backlashes?!” The madness in his eyes seemed to flare brightly, and he even laughed in joy. That joy was actually real. After all, thanks to his terrifying powers of regeneration, the wounds that he had received moments ago were already healed. As for the turtle-wok, although it was easy to absorb back into his body, it could not be brought back out again so easily.</p><br/><p>Looking very proud, he ripped off the tattered remnants of his leather armor and tossed them off to the side. Taking a confident step forward, he looked at the confused Celestial Virūpākṣa and then laughed maniacally.</p><br/><p>“Come on. Bring it on! Hit me again!” He took a few more threatening steps toward Virūpākṣa, who backed up without even thinking about it. His right hand was completely destroyed, which meant that unless he called upon a unique celestial Daoist magic, there was no way he could do anything to Bai Xiaochun’s fleshly body power, which seemed like a defensive treasure. Ordinary magical techniques and fleshly body power would be useless against him.</p><br/><p>And the horrific backlash had Celestial Virūpākṣa shaking in fear.</p><br/><p>Seeing that his opponent was backing up, Bai Xiaochun laughed madly. Waving his arm dismissively, he turned to Prince Ur-Demon and Reverend Devourer.</p><br/><p>“You’re Prince Ur-Demon, right? Want some of my blood? Well, come on. Hit me and get some!</p><br/><p>“And what about you, Reverend Devourer? Come on, hit me. Hurry up! Hit me!”</p><br/><p>Prince Ur-Demon: “……..”</p><br/><p>Reverend Devourer: “……..”</p><br/>\n</div>"}