{"title": "Chapter 1092: Too Kindhearted", "id": 1092, "volume": 11, "url": "http://boxnovel.org/a-will-eternal-chapter-1092-too-kindhearted", "volume_title": "Volume 11", "body": "<h1>Chapter 1092: Too Kindhearted</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“This is impossible!!” Prince Ur-Demon shrieked, so close to the verge of collapsing mentally that he could do nothing other than stare at the minotaurs around them.</p><br/><p>Despite being a high-ranking celestial in the Vile-Emperor Dynasty, the type of person that countless individuals looked up to in awe, to be surrounded by more than 1,000 minotaur monsters was something he could hardly handle.</p><br/><p>The truth was that this many minotaur monsters… was something that would cause even the Vile-Emperor to gasp if he were here. It was a level of power that could very well destroy the Eternal Immortal Domains as a whole.</p><br/><p>And although they were actually illusory, to Prince Ur-Demon and Reverend Devourer, they seemed very real.</p><br/><p>“Is this really the twentieth level?!?!”</p><br/><p>“This must be the fiftieth or eightieth level. Or maybe the hundredth!!”</p><br/><p>“Why is this happening? This level of difficulty is ridiculous!!”</p><br/><p>Ironically, Celestial Virūpākṣa was taking things even worse than Prince Ur-Demon and Reverend Devourer.</p><br/><p>Those two had never been specifically targeted by Bai Xiaochun, whereas Celestial Virūpākṣa had. His confidence had been crushed earlier, and that was not something that could be recovered from easily. And thus, the situation was even more terrifying for him.</p><br/><p>The only comfort he had was that this time… he had someone to accompany him in misery….</p><br/><p>In their dismay, they fled. Their goal was not to fully escape, but to wait for the teleportation function to activate. After all, despite being mentally crushed by the increase in difficulty in the level, they weren’t afraid of dying. Everyone knew that in this trial by fire, death wasn’t a possibility.</p><br/><p>The worst outcome was failure and injury.</p><br/><p>And these celestials were decisive people by nature. Therefore, they immediately took to flight, giving up on any hope of possibly winning. Besides, running away might help them to avoid some level of injury. As they fled, the minotaur monsters swarmed them.</p><br/><p>However, not even Celestial Virūpākṣa could ever have guessed that the current situation was like nothing compared to the nightmare which was to come….</p><br/><p>Bai Xiaochun was furious at how everything had played out, and furious at Celestial Virūpākṣa for figuring out a better way to cheat than him…. He was also worried about the implications of dealing with a celestial who could find loopholes within the damaged fan’s systems. Therefore, he decided that he absolutely, positively could not allow him to pass the level.</p><br/><p>“It’s too bad you can’t kill people. I guess the best thing to do is trap him in there!” With every moment that passed, he became more convinced that this was the best thing to do. Meanwhile, inside the level, the light of teleportation had begun to build up, causing the three celestials’ eyes to brighten.</p><br/><p>In sharp contrast, Bai Xiaochun was not happy at all. Eyes glittering, he called upon his connection to the damaged fan to limit the teleportation function. Even as Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon began to fade away….</p><br/><p>Rumbling sounds echoed out, and they became clear again. Then, the light of teleportation vanished!</p><br/><p>“Impossible!!”</p><br/><p>“What’s going on?!?!” Gasping, they began to dodge the attacking minotaurs, intense unease rising up in their hearts. They were now more nervous than they had been when they first saw the 1,000 minotaur monsters.</p><br/><p>Bai Xiaochun was very pleased with the level of control he had. Still not completely sure of what he could do, he began to carefully push harder to see what was possible.</p><br/><p>“Lock down the teleportation power. Lock down the teleportation power!!” His thoughts were like orders to the fan. Immediately, ripples filled the twentieth level, to the point where Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon all noticed.</p><br/><p>To their shock, rumbling sounds could be heard, and although it was impossible for the three celestials to understand why it was happening, all teleportation power in the twentieth level… was completely locked down!</p><br/><p>Although it wasn’t permanent, until the spirit automaton awoke, there was no way that Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon would be able to leave the twentieth level!</p><br/><p>“You wanted to challenge this level, right? Well fine then. You can challenge it day and night!” Gritting his teeth, Bai Xiaochun prepared to retract his divine sense, but then stopped.</p><br/><p>“Wait, that’s not quite enough. I want to make sure that even when the spirit automaton wakes up and frees them, those three villains are too worn out to attempt any more challenges.” After some thought, he pulled out a handful of… Aphrodisiac Pills.</p><br/><p>“It's too bad I don’t have many Aphrodisiac Pills left, otherwise I would use some more. Ah, whatever. This should be enough. I refuse to believe that when the dust settles, they’ll have the energy to do anything else!” Snorting coldly, he crushed the pills and sent the dust flying over to the minotaur monsters….</p><br/><p>As the powder spread out… Bai Xiaochun retracted his divine sense. Although he wasn’t interested in watching the results, he couldn’t help but savor the knowledge of what a bitter place the twentieth level would shortly become….</p><br/><p>Although Bai Xiaochun wasn't watching, Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon were right there. After a brief moment, the minotaur monsters suddenly began to charge them with greater fervor.</p><br/><p>Their eyes were bright red, and their howling pants caused the celestials’ scalps to tingle.</p><br/><p>“What’s going on with the minotaur monsters?!?!”</p><br/><p>“Why… why do I have such a bad feeling about this!?!?”</p><br/><p>“Dammit, have they gone crazy or something?”</p><br/><p>To the shock of the celestials, even more bizarre things began to happen to the minotaur monsters. They began to grow larger, with blue veins bulging out all over their bodies. As this happened, their howls reached the point that the celestials were trembling violently in fear.</p><br/><p>“Not good!!”</p><br/><p>From he way the minotaur monsters looked at them, it seemed that they were the most beautiful and enticing things in all creation. Soon, the minotaur monsters began to fight amongst themselves in madness to get to the front of the group.</p><br/><p>As for what happened after that, the story was never publicly revealed….</p><br/><p>Bai Xiaochun didn’t pay much more attention to the twentieth level. He occasionally sent some divine sense over to check on it quickly, and would usually shiver and look away.</p><br/><p>“You can’t blame me. Those three bastards took it upon themselves to mess with me. And they even tried to compete in cheating!” Clearing his throat, he chose to focus his energy on the other cultivators. Over the following days, he got much pleasure from preventing them from advancing through any more levels. Soon, everyone was sighing.</p><br/><p>Half a month passed by in a flash. By now, more than half of the total allotted time had passed. Eventually, people realized that Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon had gone missing, to the shock of everyone, and the unease of the Vile-Emperor Dynasty cultivators.</p><br/><p>Even Gu Tianjun and Sima Yunhua had no idea what was going on, and felt the need to be more on guard than ever.</p><br/><p>When Bai Xiaochun heard everyone whispering about the missing celestials, he started to feel a bit guilty. For a moment, he considered going to check on the twentieth level, but in the end, decided it wasn’t a good idea.</p><br/><p>“I really am just too kindhearted. What would happen if I felt bad and then let them out…? That wouldn’t be good….” Sighing, he once again began to ponder why he had this big weakness….</p><br/>\n</div>"}