{"title": "Chapter 1106: Crazed", "id": 1106, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1106-crazed", "volume_title": "Volume 12", "body": "<h1>Chapter 1106: Crazed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>By the time Bai Xiaochun returned to the capital city, it was daytime. The Giant Ghost King hadn’t slept the entire night. He'd sat there drinking, occasionally looking up at the sky, and fretting over what Bai Xiaochun was doing. He couldn’t stop worrying that he would do something impulsive and cause some sort of disaster.</p><br/><p>The Giant Ghost King detected Bai Xiaochun’s arrival, and hurried out to meet him. Grabbing him by the shoulders, he said, “You….”</p><br/><p>Shrugging the Giant Ghost King off, Bai Xiaochun pulled out a jug of alcohol, took a drink, and then proudly said. “Calm down, old pal. Just wait a bit for the fireworks to start. When Bai Xiaochun makes a move, he never comes up short. Giant Ghost, old pal, you’ll have your position back within seven days!”</p><br/><p>The Giant Ghost King was a bit taken aback by how confident Bai Xiaochun seemed. But then he thought back to all the things Bai Xiaochun had done in the Wildlands, and didn’t feel any more confident. In fact, he felt even more unsettled.</p><br/><p>“You… you killed Marquis Zi Lin?” he asked.</p><br/><p>“Are you kidding me?!” Bai Xiaochun said with a glare, irritated at how much the Giant Ghost King was underestimating him. “I just smeared some muck on his face that he’ll never be able to wash off.”</p><br/><p>Bai Xiaochun’s plan was outrageous and seemingly beyond belief, and that thought made him chuckle. After all, Celestial Aged Spirit was being a real nasty fellow, and as a result, Bai Xiaochun didn’t even want to come up with some perfectly executed scheme. He just wanted to do a bit of muckraking.</p><br/><p>The Giant Ghost King still had no idea what was going on, and for the life of him couldn’t figure out what Bai Xiaochun was up to. However, Bai Xiaochun was clearly not going to give him any details. Therefore, the Giant Ghost King simply had to hope that Bai Xiaochun’s self-confidence was warranted. Perhaps the clouds really would part soon to reveal the blue sky beyond.</p><br/><p>Over the course of the following days, the Giant Ghost King stayed in Bai Xiaochun’s mansion, completely wrapped up in anxiety.</p><br/><p>In contrast, Bai Xiaochun was edgy with excitement to see what would happen.</p><br/><p>On the afternoon of the third day, in the north of the second immortal domain, the door of Gongsun Wan’er’s immortal's cave opened.</p><br/><p>Her expression was the same as ever as she calmly walked out into the open. As a celestial, any public appearance she made would attract quite a bit of attention.</p><br/><p>The first thing she did was issue orders summoning all of the preceptors and devas under her command for a meeting.</p><br/><p>All of the demigods in the five prefectures she commanded jumped to follow her orders. Quickly abandoning whatever other tasks were at hand, they took their devas with them to the meeting.</p><br/><p>Gongsun Wan’er sat in a throne in the position of honor, her eyes closed, her hands resting on the arms of the throne. She was tapping the throne with her index finger, creating a thumping sound that filled the area, causing great pressure to weigh down on her gathered subordinates. None of them even dared to breathe, and just waited there respectfully.</p><br/><p>Enough time passed for an incense stick to burn, during which time the pressure mounted. Finally, she opened her eyes.</p><br/><p>“Thank you all for coming,” she said. “As you know, it was literally overnight that I took over this final northern prefecture in the second immortal domain!”</p><br/><p>Although she spoke slowly and calmly, the truth was that inside, she felt extremely uncomfortable. The incense stick’s worth of time just now had been spent struggling internally, and it was almost an accident that she had begun speaking.</p><br/><p>Her subordinates were immediately taken aback by her words, and were unsure of their implications. A few exchanged awkward glances, but none dared to speak. They just kept their heads bowed and waited for more to come.</p><br/><p>Bracing herself, Gongsun Wan’er went on. “The only reason it went so smoothly is that… the preceptor previously in charge of this prefecture, Marquis Zi Lin of the Saint-Emperor Dynasty, is secretly loyal to the Vile-Emperor Dynasty. I will definitely report the matter to the Vile-Emperor… so that he gets the credit.”</p><br/><p>Even she found these words to be particularly bizarre, but there was nothing else she could do. Rising to her feet, she left the main hall.</p><br/><p>Silence reigned. The demigods and devas all looked around with wide eyes, their jaws hanging open. They had assumed that Ghostmother would summon them to a meeting for some important reason, and simply couldn’t imagine why she would call them here just to say this….</p><br/><p>A long moment passed before everyone recovered enough to start talking. Many a strange expression could be seen on their faces.</p><br/><p>“Did Marquis Zi Lin… offend the exalted Celestial?”</p><br/><p>“That has to be it! And he must have offended her badly!”</p><br/><p>“But considering she's a celestial, couldn’t she just directly kill a trifling figure like Marquis Zi Lin? Why the intrigue…?”</p><br/><p>“Um… besides, isn’t accusing him publicly too obvious? Who would possibly believe it?”</p><br/><p>The demigods and devas alike were all stunned, and no matter how they considered the situation, they could only come to the conclusion… that Ghostmother hated Marquis Zi Lin for some reason.</p><br/><p>However, after talking the matter over, they all agreed that Ghostmother had clearly called them to this meeting because she wanted their help in spreading the information.</p><br/><p>They didn’t need to worry about what happened afterward, they just needed to spread the news as quickly as possible.</p><br/><p>Having come to this agreement, they quickly left and headed back to their respective prefectures, where they worked very hard to make sure the news traveled quickly. Before long, all of the northern prefectures were abuzz with the rumor that Marquis Zi Lin was loyal to the Vile-Emperor Dynasty. Of course, the north was only a subsection of the second immortal domain. And of course, both dynasties had spies in the other. So it only took about four hours for the news to reach the southern prefectures, including the capital city.</p><br/><p>It immediately caused quite a stir, and in fact, everyone who heard it was completely stunned.</p><br/><p>Demigods, devas, Nascent Soul experts, and Core Formation cultivators alike were all completely taken aback.</p><br/><p>The truth was that… this rumor seemed completely fabricated! It was ridiculous!</p><br/><p>“Ghostmother called all of her preceptors together to tell them that? That’s… that’s crazy….”</p><br/><p>“Marquis Zi Lin helped her take over the final northern prefecture? That’s total nonsense! Considering she's a celestial, who could possibly stand against her?”</p><br/><p>“Celestial Ghostmother wants Marquis Zi Lin to get credit for taking over that prefecture? It’s not like Marquis Zi Lin is an idiot! If he wanted to turn traitor, he could have just gone to the other side. Why would he stay in the Saint-Emperor Dynasty?”</p><br/><p>Word spread quickly through the southern part of the second immortal domain. It wasn’t that everybody disbelieved it. There were a few naive people here and there who thought it was true.</p><br/><p>But they were in the minority. Most just turned up their noses disdainfully and assumed it was a smear tactic by Ghostmother!</p><br/><p>And unfortunately, this smear tactic didn’t have any weight at all. It was so ridiculously fake that it made everyone furious….</p><br/><p>However, the incredibly fake nature of the news ensured that some intelligent people realized that there must be more to the story. And at that point, suspicions began to build.</p><br/><p>Of course, the person who was most angered was the new preceptor of Godsifter Prefecture, Marquis Zi Lin himself. When he heard the news, his jaw dropped, and he wasn’t sure whether to laugh or cry. At first, he simply believed himself to have been wrongly accused, but then he realized that someone might be out to hurt him specifically.</p><br/><p>Whoever it was, that person somehow got Celestial Ghostmother to make false charges. And whoever that person was, he would likely have realized that the ridiculous smear tactic wouldn’t work. And yet, he had done it anyway…. The whole situation made Marquis Zi Lin completely furious.</p><br/><p>And of course, he already had his suspicions about who was behind it. Eyes flickering, he murmured, “Don’t tell me it was that King Heavenspan?”</p><br/>\n</div>"}