{"title": "Chapter 1126: Hit The Nail On The Head....", "id": 1126, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1126-hit-the-nail-on-the-head", "volume_title": "Volume 12", "body": "<h1>Chapter 1126: Hit The Nail On The Head....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun couldn't help but be shocked. After all, Mistysea Prefecture had become a place of utmost importance. To the people from the Heavenspan Realm who now lived in the Eternal Immortal Domains, it was like a holy land!</p><br/><p>As long as it stood, it was like a beacon of hope for them!</p><br/><p>Bai Xiaochun’s heart was already pounding as he sent his divine sense out to fill much of Mistysea Prefecture. However, everything seemed ordinary. Rising to his feet, he took a step forward, appearing in the grand hall, outside of which the Grand Heavenmaster stood.</p><br/><p>“I, Situ, request an audience, exalted Celestial! I have an important matter to report!”</p><br/><p>The Grand Heavenmaster’s voice quavered in almost completely undetectable fashion as he spoke, as though the matter of which he spoke was of the most weighty significance. Feeling more alarmed than ever, Bai Xiaochun waved his hand, causing the door of the hall to open. When the Grand Heavenmaster rushed in, he was so anxious that he completely forgot to clasp hands in greeting.</p><br/><p>“Celestial, something bad has happened, and Mistysea Prefecture is in incredible peril!! If we don’t solve this problem, then this foundation we have worked so hard to build will be lost for all time. In fact, it might even completely change our standing within the Saint-Emperor Dynasty!!” His forehead was covered with sweat as he apparently thought back to the recent days in which Bai Xiaochun had gone missing, leaving him and the Giant Ghost King incapable of doing anything. And now, a most critical moment had been reached.</p><br/><p>As far as Bai Xiaochun could remember, the only time an expression like this had appeared on the Grand Heavenmaster’s face was when Arch-Emperor City was being besieged. That fact in itself caused his heart to pound even harder.</p><br/><p>“What happened?!” he asked immediately.</p><br/><p>“Exalted Celestial, Mistysea Prefecture’s reputation as the best place for spirit enhancements has already spread far and wide. However, the Saint-Emperor Dynasty has come to covet us as surely as a hungry man might covet a juicy steak. Clearly, they are only waiting for the right time to swoop in and take control!”</p><br/><p>Bai Xiaochun nearly gasped. Of course, he had long since assumed that something like this would happen, which was why he was trying so hard to achieve a breakthrough.</p><br/><p>“Over the past few months,” the Grand Heavenmaster continued, “it has become apparent that we only have one path available in front of us. If we don’t move forward along that path, we will face profound difficulties. But if we do move forward, then it will only be a matter of time before the Saint-Emperor Dynasty comes for us! Worst of all is that recently, the Saint-Emperor issued a series of decrees that strongly suggest that he is thinking of taking action soon. We have no time to work with!!</p><br/><p>“Exalted Celestial, you absolutely must reach the Archaean Realm in less than half a year. The only other option would be to create a second possible path of action, and do so as quickly as possible. The key to that second method would be to establish relations with the Vile-Emperor Dynasty. If we do that, the Saint-Emperor will have even more misgivings than before, and we can buy ourselves time!</p><br/><p>“Unfortunately, we have no ways to establish relations with the Vile-Emperor Dynasty. That’s especially true considering that the other prefectures in the north all belong to them. And although our spirit enhancement abilities are important to them, that’s not enough for them to open up to us. The Vile-Emperor Dynasty is tightly locked down. The Giant Ghost King and I have been racking our brains recently about what to do, but haven’t been able to think of anything. What do you think, exalted Celestial?” The Grand Heavenmaster seemed to be virtually beating his chest in frustration and helplessness. Bai Xiaochun had also been very nervous throughout the explanation. However, upon reaching the end, he relaxed a bit. After all, although he was still a bit suspicious about his relationship with Gongsun Wan’er, he still knew that he could fall back on that.</p><br/><p>“Ai, you really had me scared there for a minute,” he said. “But in the end, it’s all about the Vile-Emperor Dynasty, right? I’ll just go work out a deal with Gongsun Wan’er. After that… wait…. Hold on a second!” </p><br/><p>However, before he could say anything else, the Grand Heavenmaster cleared his throat. No trace of his previous anxiety could be seen as he looked somberly at Bai Xiaochun, clasped hands and bowed. Speaking at a rapid-fire pace, he said, “Once a celestial speaks, his orders will be strictly enforced. Exalted Celestial, please establish business negotiations with Celestial Ghostmother as soon as possible. The best option would be to get to know her a lot better on a personal level. If things went well, you never know, the Heavenspan Realm might end up with another celestial on our side. In fact, the best thing would be for the two of you to become husband and wife!</p><br/><p>“Well, exalted Celestial, I know that you have just emerged from seclusion. Please rest up a bit. I won’t bother you anymore. I’ll take my leave now….” Chuckling, he bowed his head, and then hurriedly departed from the hall.</p><br/><p>Bai Xiaochun was left there standing by himself, his jaw gaping and his eyes wide.</p><br/><p>“Situ, you old bastard, you conned me!!” Bai Xiaochun wanted to get mad, but somehow couldn’t. Apparently, there was no crisis at all in Mistysea Prefecture. All of the Grand Heavenmaster’s alarmist talk had just been a ruse to try to get Bai Xiaochun get closer to Gongsun Wan’er.</p><br/><p>Clearly, he had heard rumors about their vague relationship. And being the wily fox that he was, he knew that if he made the suggestion directly, Bai Xiaochun would balk. Of course, the truth was that Bai Xiaochun was actually a bit terrified of Gongsun Wan’er.</p><br/><p>The Grand Heavenmaster truly did want to get Gongsun Wan’er to join the Heavenspan Realm. With two celestials on their side, their position in the Eternal Immortal Domains would be stronger than ever!</p><br/><p>Some of what he had said was very true. They couldn’t just rely on trade with the Saint-Emperor Dynasty to keep Mistysea Prefecture going. Even if the Saint-Emperor wasn’t very happy about it, they had to establish trade relations with the Vile-Emperor Dynasty.</p><br/><p>And that was where the crux of it all lay. They needed to prioritize their safety. Otherwise, they could find themselves in a dangerous situation without even realizing it.</p><br/><p>Of course, the Grand Heavenmaster’s other assessments of the danger they were in were not untrue. However, it would be some time before they were actually a material threat.</p><br/><p>After analyzing the matter for a bit, Bai Xiaochun wasn’t sure whether to laugh or cry at how the Grand Heavenmaster had handled the matter. After all, unless it was really important, he didn’t want to have any dealings with Gongsun Wan’er.</p><br/><p>“I always end up having to spank her….” he sighed. What he worried about most was that, one day, the spanking might lead to something even more significant….</p><br/><p>Unfortunately, thanks to the Grand Heavenmaster’s little trick, he had already opened his big mouth. Therefore, it was with a light sigh that he looked north, braced himself, and then disappeared via teleportation.</p><br/><p>To an ordinary cultivator, the prefecture that housed Gongsun Wan’er’s palace of operations was so far away from Mistysea Prefecture that it could take a lifetime to go from one to the other. But for Bai Xiaochun, it only took a few hours.</p><br/><p>Furthermore, thanks to his Undying Hex, no amount of sealing formations did any good to slow him down. By the time he arrived, it was evening. Even as he stood there frowning, trying to decide how to enter, he heard an overly sentimental voice drifting out from inside.</p><br/><p>“Why are you here at such a late hour to see me, sweetie? Could it be that you actually do want to spend the night with me?” Her voice was so pleasant that Bai Xiaochun’s heart immediately trembled. However, by now, he had come to realize that Gongsun Wan’er seemingly had two personalities. One version liked to call him sweetie, and the other was shrewish and murderous.</p><br/><p>“She didn’t use to be like this. Could it be that fusing with Ghostmother changed her in some way?” He already felt a headache coming on. Fearful that the situation would progress like it had the last time he came to see her, he cleared his throat and said, “Stow it, Wan'er. I'm here on official business.”</p><br/><p>“Official business? That’s what you said the first time you visited, but in the end, all you wanted was my help to slander a demigod. Later, we met in Mistysea Prefecture, and you also said it was official business. But then, you ended up taking over my prefecture.” Although her voice was still as flirtatious as ever, there was a bit of anger within it.</p><br/><p>“What, aren’t you even going to come inside? Is the mighty Arch-Ancestor, a majestic celestial, really that cowardly? Ohhh, right. I forgot you’re afraid of ghosts.” Even as her words rang out into the evening, ghostly images appeared from within the palace, and Bai Xiaochun’s headache immediately got worse. The strange thing was that, considering he had his Sutra of Former Reincarnation, you would think she wouldn’t want him to get near her.</p><br/><p>“Don’t tell me she’s bluffing?” he thought, growing more vigilant. </p><br/><p>Sighing dramatically, he stared at the palace and said, “Come on, Wan'er, are you doing this on purpose? Are you really trying to piss me off so that I burst in there, use my Sutra of Former Reincarnation and then start spanking you?” With that, he slipped into a defensive stance of readiness, convinced that his words would provoke her into rushing out to fight him. However, after a moment passed, his jaw dropped when he realized that Gongsun Wan’er… wasn’t saying anything in response.</p><br/><p>“No way…. Don’t tell me I hit the nail on the head?!”</p><br/>\n</div>"}