{"title": "Chapter 1128: Startled", "id": 1128, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1128-startled", "volume_title": "Volume 12", "body": "<h1>Chapter 1128: Startled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Yeah! Grandmaster Zhou is super awesome! I'm sure you’ve heard of him before, Exalted Celestial.” Merely mentioning this Grandmaster Zhou caused Qing’er’s beautiful eyes to light up with reverence. Apparently, she believed this Grandmaster Zhou’s skill in spirit enhancement to be so incredible that he must be world-famous.</p><br/><p>“People say that back in the Heavenspan Realm, Grandmaster Zhou was one of the most powerful spirit enhancers in existence. Everywhere he goes, the people of Heavenspan treat him with the ultimate respect.</p><br/><p>“Furthermore, the natural laws of the Heavenspan Realm showed special favor to him. When his world was destroyed, he wasn’t hurt at all. Even more miraculous is that after he reached the Eternal Immortal Domains, his spirit enhancement abilities grew even more powerful.</p><br/><p>“I also heard that Grandmaster Zhou has a dear acquaintance, a person whom he has been searching for ever since the destruction of his world….</p><br/><p>“Oh, and there’s another thing. I did see him perform a spirit enhancement once. The sky went dim, and wild winds screamed across the lands. His every movement seemed to affect the entire world! And that was when he produced a spirit enhanced treasure!” Qing’er almost couldn’t stop talking about this Grandmaster Zhou, and the look in her eyes grew more and more intense the entire time. From all of that, it became obvious to Bai Xiaochun that she adored him.</p><br/><p>At the same time, his curiosity was piqued, especially about why Qing’er, a cultivator of the Vile-Emperor Dynasty, would be so entranced with a spirit enhancer. He almost couldn’t believe it.</p><br/><p>“How many people are there like you,” he asked, “people who are interested in spirit enhancement?”</p><br/><p>“Oh, tons! We don’t have many spirit enhancers in the Vile-Emperor Dynasty, but every one of them has a very high standing. Any time they make public appearances, they attract huge crowds.</p><br/><p>“Spirit enhancement is really a miraculous thing, and completely unheard-of in the Eternal Lands. It can change something rotten into something magical. It’s too bad that only people with the blood of the Heavenspan Realm can do it, otherwise I would definitely start studying it!</p><br/><p>“In fact, I’ve already decided that when the time comes for me to pick a Daoist partner, I'm definitely going to find a spirit enhancer!” By the time she got to the last part, Qing’er’s face was a bit flush.</p><br/><p>Bai Xiaochun was quite shaken. Back before he had started spending a lot of time in secluded meditation, he didn’t remember spirit enhancers being so popular. Apparently, a lot had changed in the world during his months of seclusion.</p><br/><p>“The Grand Heavenmaster told me from the very beginning that he wanted Mistysea Prefecture to rise to prominence, and also elevate the position of spirit enhancers in the world. But man, he really outdid himself. I can’t believe he changed things so much in such a short time!” Seeing how flush Qing’er’s face was caused Bai Xiaochun to feel somewhat proud.</p><br/><p>But then he realized that this might be the case because of how close this prefecture was to Mistysea Prefecture. Perhaps people in other immortal domains didn’t feel this way at all.</p><br/><p>Either way, it was a good start. Bai Xiaochun was in a great mood, and realized that getting the cultivators of the Eternal Immortal Domains to like spirit enhancers was definitely a good thing. And the more he could do to promote that attitude, the better.</p><br/><p>Having reached this point in his train of thought, he was more interested than ever in this mysterious Grandmaster Zhou. Furthermore, he decided that by using his spirit enhancement abilities to elevate his own position, Grandmaster Zhou had also improved the view of spirit enhancers in general, which was a good thing. The more he thought about it, the more he wanted to meet the man.</p><br/><p>“Qing’er,” he said with a smile, “you said you’ve seen Grandmaster Zhou before, right? Do you think you could take me to see him?”</p><br/><p>Qing’er’s eyes glittered brightly in response. The truth was that if Gongsun Wan’er hadn’t asked her to take care of Bai Xiaochun’s housing arrangements, she would have already gone to watch Grandmaster Zhou perform a spirit enhancement.</p><br/><p>“Sure!” she said, nodding eagerly. “You’re lucky, because today, Grandmaster Zhou will perform a public spirit enhancement. If you want to go watch, Exalted Celestial, I can definitely show you the way.” Bai Xiaochun could see how happy Qing’er was. She seemed like a simple and pure young woman, and all of a sudden, it made him realize that the cultivators in the Eternal Immortal Domains weren’t all unreasonable and fierce.</p><br/><p>And thus, Qing’er led Bai Xiaochun from the mountaintop to the city below. As one of the handmaidens of Celestial Ghostmother, it was only natural that she had special privileges there.</p><br/><p>As for Bai Xiaochun, he didn’t want to reveal his identity. After all, he was in Vile-Emperor Dynasty territory. Therefore, he disguised himself with a magical technique, ensuring that no one other than Gongsun Wan’er would be able to deduce his true identity.</p><br/><p>It was evening, but the streets were still packed with crowds of people. It was very lively. Most of the inhabitants were actually natives to this prefecture, people from local cultivator clans. So to them, there was little difference between living under the Saint-Emperor Dynasty or the Vile-Emperor Dynasty. Regardless of which government controlled the area, this was their home.</p><br/><p>Although the laws of the Vile-Emperor Dynasty were somewhat different, in terms of daily life and cultivation practices, there were few differences. Of course, there were also cultivators who had come from far-off places with Celestial Ghostmother, who hoped to set down roots here in the north of the second immortal domain.</p><br/><p>There was a buzz in the air. Shops were open, with patrons going in and out constantly. Laughter could be heard, as well as the shouts of peddlers hawking their wares.</p><br/><p>In fact, if Bai Xiaochun had been forced to guess, he would have had a hard time determining if this place was under the control of the Vile-Emperor Dynasty or the Saint-Emperor Dynasty. Despite the exciting atmosphere, he was very calm inside. He couldn’t help but think back to the Heavenspan Realm, to the sects he had been a part of, to Mount Hood and the little village at its foot. Back in the Heavenspan Realm, the atmosphere had often been like this as New Years approached.</p><br/><p>Qing’er didn’t notice Bai Xiaochun’s absent-mindedness as she deftly led the way through streets and alleys until they arrived at a large public square.</p><br/><p>On the right sight of the square was a newly constructed mansion residence, with a few hundred people gathered outside. Although most were whispering to each other as they stood there waiting, the collective volume was relatively loud. All eyes shone with anticipation as they stared at the door of the mansion.</p><br/><p>The door was open wide, allowing a view of the main hall within, where a few dozen people waited respectfully. Occasionally they would look at the crowd outside, and occasionally they would look at the middle-aged man seated cross-legged in the position of honor at the far end of the hall.</p><br/><p>He wore a Daoist robe, and despite his somewhat emaciated appearance, had brightly shining eyes. He had the demeanor of a transcendent being as he clasped hands and bowed to one of the people in the hall, who happened to be a demigod.</p><br/><p>This middle-aged man was only in the Nascent Soul stage, and yet, the demigod treated him with utmost respect. Waving his hand, the demigod said, “Grandmaster Zhou, back when I was in Vile-Emperor City, I acquired a threefold spirit enhancement for this flying sword. Despite searching the nation high and low, I couldn’t find anyone to perform the fourth spirit enhancement. If you’re able to do it, Grandmaster Zhou, then I can pay any price you set!”</p><br/><p>An enigmatic smile could be seen on Grandmaster Zhou’s face as he looked back at the demigod.</p><br/><p>“Although I've never personally met Grandmaster Zhang Dahai, I've heard that he can perform fourfold spirit enhancements.”</p><br/><p>Looking a bit embarrassed, the demigod said, “You’ve heard the old saying <em>you can see the divine dragon, but never from head to tail</em>, right? That describes Grandmaster Zhang perfectly. It’s almost impossible to get an audience with him. In fact, I've never even seen him.”</p><br/><p>With that, he clasped hands and bowed again, then went on to promise handsome compensation for the job. After a long moment, Grandmaster Zhou nodded.</p><br/><p>“Very well. Let me see the sword in question.”</p><br/><p>Visibly enlivened, the demigod produced a crimson flying sword, which he handed to Grandmaster Zhou for inspection. It was at around this time that Qing’er and Bai Xiaochun appeared near the door of the mansion.</p><br/><p>Considering the level of his cultivation base, Bai Xiaochun didn’t need to be in the hall to see everything going on inside, including Grandmaster Zhou.</p><br/><p>The instant he saw him, he blinked a few times, and then the corners of his mouth turned up in a smile.</p><br/><p>Qing’er was already gazing at Grandmaster Zhou with a bright expression. “Exalted One,” she said to Bai Xiaochun, “that is the incredible Grandmaster Zhou, our number one spirit enhancer. You must have met him before in the Heavenspan Realm, right?</p><br/><p>“Unfortunately, no one knows his full name. He said long ago that if he ever found that long-lost dear acquaintance, then he would announce his name to the world.”</p><br/><p>“Yeah,” Bai Xiaochun said, nodding. “I know him.” With that, he cleared his throat.</p><br/><p>Perhaps because of a sudden hush in the crowd, the sound of Bai Xiaochun clearing his throat was a bit louder than he had intended it to be. It drifted into the hall, causing Grandmaster Zhou to frown. After all, when he performed spirit enhancements, he required peace and quiet, which was a generally known rule.</p><br/><p>At this point, his eyes shifted from the crimson flying sword to the crowd outside. He looked irritated at first, but when he caught sight of Qing’er, his heart softened a bit. He had long since come to realize that she liked him, and it caused a smile to appear on his face. Then his gaze shifted to the person standing next to her… Bai Xiaochun.</p><br/><p>Suddenly, Grandmaster Zhou’s eyes went wide, and his mind began to spin.</p><br/>\n</div>"}