{"title": "Chapter 1122: Next Up...!", "id": 1122, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1122-next-up", "volume_title": "Volume 12", "body": "<h1>Chapter 1122: Next Up...!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Aphrodisiac Pill, one of Bai Xiaochun three most powerful pills, had proved its formidability on numerous occasions; there could be no doubt that it was peerless in its ability to drive people to complete insanity. If it weren’t for the fact that his stocks were running low, he would have thrown out even more than he had, just to make sure that these bastard apothecaries knew what it meant to tremble in despair.</p><br/><p>Besides, whether it was in terms of the physical size of the pills, or their strength, they were far beyond anything that these diminutive Dark Concocters could bear. Even the relatively small amount that he had tossed out effectively counted for ten times what it normally would have!</p><br/><p>With one flick of his sleeve, Bai Xiaochun deployed roughly one third of the total number of Aphrodisiac Pills he had left in his bag of holding. It was even as the Dark Concocters were still dealing with the Breakup Pills that this new pill arrived, a pill that would lead to a catastrophic tribulation the likes of which they could never conceptualize, even in their wildest imaginings!</p><br/><p>Thumping bangs could be heard as the pills exploded, resulting in something quite different than the explosion of the Breakup Pill, or any other pill for that matter. This pill created a pink smoke that was somehow indescribably enticing. Thanks to repeated testing and improvement over the years, that pink smoke moved with freakish speed, almost instantly covering the entire area.</p><br/><p>Even those imps who were quick to react still felt their hearts beginning to race in unusual fashion. They quickly performed incantation gestures, either utilizing certain techniques to negate medicinal effects, or producing medicinal pills that could create wind, which they hoped would drive the pink smoke away, or melt it. Unfortunately for them, the smoke created by an Aphrodisiac Pill was not the type that could be negated by ordinary wind!</p><br/><p>As the Dark Concocters struggled in complete futility against the Aphrodisiac Pill smoke, time seemed to slow, and all heaven and earth came to be covered with pink smoke.</p><br/><p>In the blink of an eye, it became apparent that no matter what techniques or medicinal pills the Dark Concocters used, they were like peasants meeting an emperor. They were the ones to be driven away as the entire world became pink!</p><br/><p>Some of the imps tried to back up, but by the time they did, it was too late…. Some of them, upon inhaling the smoke, began to shiver in unprecedented fashion, and their eyes turned crimson. From the expressions on their faces, it seemed like they would lose their minds at any moment.</p><br/><p>“What pill was that!?”</p><br/><p>“Heavens! Something’s wrong. Very wrong! Why do I feel myself heating up? What’s going on here?!”</p><br/><p>“Agggghhhh! I'm gonna lose my mind! I can’t control myself! I'm gonna blow. I'm gonna blooowww!”</p><br/><p>Soon, the Dark Concocters had devolved into a complete uproar of madness and disbelief. Many of them simply began howling as if they had gone completely insane.</p><br/><p>Bereft of thinking ability, they were overcome by waves of intense heat, and began to pant heavily. Those among them who were unusually tall and burly seemed to have transformed into something completely different than before. Howling, they turned and pounced on their fellows.</p><br/><p>If everyone within the smoke caused by the Aphrodisiac Pill had been affected, it would have been less horrific…. But there were simply too many imps, and only a portion of them had breathed in the smoke. That meant that many of the imps who were pounced on had never ingested any of the Aphrodisiac Pills….</p><br/><p>Bloodcurdling screams erupted out, as well as bellows of madness and terror!</p><br/><p>“What are you doing? Hey! Y-y-you….”</p><br/><p>“No! Get back! Heavens! How could you be doing this!?!?”</p><br/><p>“Dammit! Five of you at the same time!? Get away from me! Get away!”</p><br/><p>The world was thrown into complete and utter chaos, to the level that it defied description. Anyone who could see it would likely begin to question the meaning of life.</p><br/><p>What was even worse was that many of the imps were still under the effects of the Breakup Pills. When those effects were combined with the effects of the Aphrodisiac Pills, there was no way to dispel them. It would push the victim back and forth between lucidity and mental derangement, a volcanic mental bombardment that few could withstand.</p><br/><p>If that were all there were to it, it might not have been much to worry about. But at the moment, there were simply too many pills in the mix. When the pills that grew hair were added in, along with the Body-Purifying Filth-Expelling Pills, it was like pouring oil onto a fire. Howls of grief, swearing, cursing, agonized shrieks, and other sounds of struggle caused heaven and earth to shake violently.</p><br/><p>Those imps who were some distance away, and had thus managed to avoid being affected as much, had it easier off. But those near the epicenter were in absolute pandemonium.</p><br/><p>To those among the Dark Concocters who were still in possession of their mental faculties, it seemed like they were now in the depths of hell. As they looked around, they trembled, they gasped, and then they focused on Bai Xiaochun, their expressions those of both astonishment and rage.</p><br/><p>“Are you looking to die, test tube?!?!”</p><br/><p>“How dare you duel with us in medicines! You’re dead, test tube! You’re going to lose for sure!!”</p><br/><p>“These medicinal pills might be terrifying, but we can negate them!” </p><br/><p>The lucid imps were shaken, but they were a proud lot, and their confidence bolstered them. Although the Dark Concocters had long since broken up into numerous smaller tribes, they could still work together towards a common purpose when necessary. Therefore, the lucid ones among them began to pull out their most treasured medicines to neutralize the effects of the Aphrodisiac Pills.</p><br/><p>True to their word, they were very skilled, and as the treasured pills flowed out, the toxins were slowly neutralized. The smoke from the Aphrodisiac Pills began to disperse, and its medicinal effects were being suppressed.</p><br/><p>Slowly, the imps who had been affected by the Aphrodisiac Pills began to come to their senses, and when they realized what they were doing, screamed so loudly in rage that the sky went dim.</p><br/><p>Things were going exactly as Bai Xiaochun had predicted. As he hovered there in midair, he laughed coldly, his expression that of complete pride as he waved his sleeve to produce another collection of medicinal pills!</p><br/><p>“Oh Dark Concocters, do you really think that your patriarch would only have those pills on him? As I told you, when I get pissed off, I frighten even myself! Next up, Fantasy Pills!!” </p><br/><p>With that, he tossed out all of the pills he had just produced!</p><br/><p>Rumbling sounds filled the air as the Fantasy Pills were unleashed. Although Fantasy Pills weren’t necessarily as famous as Aphrodisiac Pills, they could technically be considered the first mystery pill that Bai Xiaochun had ever concocted!</p><br/><p>If one said that Aphrodisiac Pills could unleash ultimate catastrophe, then Fantasy Pills could be said to unleash all of the potential of one’s desires. The smoke spread out in the blink of an eye, pushed by the power of Bai Xiaochun’s celestial cultivation base to rapidly fill much of the world around him!</p><br/><p>Tribulation… was nigh!</p><br/><p>Before, there had been some lucid Dark Concocters who could use their vast stores of medicinal pills to aid their maddened fellows. But now… as the smoke from the Fantasy Pills spread, all of them began to tremble, whether they had been lucid or not….</p><br/><p>Gasps could be heard, and eyes went blank, and then… the Dark Concocters began to descend into hallucination.</p><br/><p>One of the imps curled up into a ball and tried to throw himself around like a medicinal pill. “Throw me! I'm a medicinal pill! Hahaha! I'm the first godly pill in all creation!” </p><br/><p>Another one began bashing his head against a nearby rock.</p><br/><p>In another area, a group of five imps linked hands and began to sing.</p><br/><p>They were all going crazy…. The Dark Concocters had gone mad. The final unleashing of the Fantasy Pills completely stripped them of their mental faculties. Because of the stacked effects of the pills, many had long hair, and some were still plagued by horrific flatulence. Those who had been temporarily saved from the Aphrodisiac Pill once again were gripped by its madness. Even powerful gods who saw this scene would be struck by the sheer preposterous nature of what was happening….</p><br/>\n</div>"}