{"title": "Chapter 1133: The Crisis Of Murknine", "id": 1133, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1133-the-crisis-of-murknine", "volume_title": "Volume 12", "body": "<h1>Chapter 1133: The Crisis Of Murknine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As the egg sac formed, a strange aura began to pulse out from within Murknine County, giving birth to a gray mist.</p><br/><p>Normally, Gongsun Wan’er would have personally come to investigate the events in Murknine County, but she was at a critical juncture in her cultivation, and thus had dispatched the two demigods in her stead.</p><br/><p>When it became clear that the demigods weren't coming back, she realized that the situation was worse than she had initially thought.</p><br/><p>At the same time, the gray mist was spreading into Mistysea Prefecture, leading the Grand Heavenmaster and Giant Ghost King to realize that something was going on in the neighboring prefecture.</p><br/><p>There was some power at work within that mist that cultivators couldn’t detect. It turned the lands gray, and even caused crevices to open up. Furthermore, the mist killed anything it touched, even the plants!</p><br/><p>Mistysea Prefecture immediately went on high alert, and the Grand Heavenmaster personally went to the border to investigate, as did the Giant Ghost King and certain other powerful experts. After seeing the situation personally, they came up with a theory about what was to come.</p><br/><p>If the mist wasn’t brought under control, it would only take half a month for it to cover Mistysea Prefecture!</p><br/><p>It was a monumental turn of events. After all, Mistysea Prefecture was in the middle of rapid development, and if the momentum stalled at this early stage, it could have devastating long-term consequences.</p><br/><p>It was at this time that Bai Xiaochun returned from the damaged fan, and sent out his divine sense to notify the Grand Heavenmaster and Giant Ghost King that he was back. Those two had long since come to realize that he had some mysterious reason for disappearing occasionally.</p><br/><p>Of course, neither had presumed to ask about it. Once Bai Xiaochun’s divine sense touched them, they somberly explained the issue with the mist, and Murknine County.</p><br/><p>“The entire county is covered with spiderwebs? And anyone who touches the mist dies!?” Bai Xiaochun was visibly shocked. Clearly, this was not a small matter, and therefore, the first thing he did was send a report to Saint-Emperor City.</p><br/><p>Not wanting to waste time waiting for a response, and worried about how Mistysea Prefecture might be negatively affected, he forced himself not to think about how dangerous the situation was, and flew over to check it out personally. Of course, he brought various subordinates with him, including the Grand Heavenmaster and Giant Ghost King.</p><br/><p>Soon, they were near the border of the prefecture, right outside of the expanding gray mist. When Bai Xiaochun saw it, he felt very shaken.</p><br/><p>“What is that stuff?!” he thought, immediately beginning to curse inwardly. The mist was moving at incredible speed, roughly that of a deva. And his divine sense couldn’t penetrate it at all.</p><br/><p>Back in the Heavenspan Realm, he would have simply fled in the face of this level of danger. But now, he was the most powerful expert in Mistysea Prefecture. How could he possibly run away?</p><br/><p>Torn about what exactly to do, he gritted his teeth and ordered his subordinates to back up. Then he unleashed all of the power of his cultivation base to surround himself in defensive fashion. Finally, he tried to enter the mist to investigate further.</p><br/><p>The Giant Ghost King anxiously considered urging Bai Xiaochun not to do something so dangerous. However, considering that the mist was spreading rapidly into Mistysea Prefecture, both he and the Grand Heavenmaster were very worried.</p><br/><p>“He’ll be fine,” the Grand Heavenmaster said quietly. “He’s a celestial, and he’s very cautious. Considering the level of his cultivation base, he shouldn’t face anything truly deadly.” The Giant Ghost King merely sighed and nodded. And thus, they waited behind as Bai Xiaochun entered the mist. </p><br/><p>As soon as he entered the mist, he felt something dragging against him, almost as if he were walking through seawater, significantly reducing his speed.</p><br/><p>Apparently, there was a powerful pressure weighing down everywhere.</p><br/><p>To his relief, though, his celestial cultivation base made him like a boulder that the seawater could do nothing but flow around.</p><br/><p>Gaining a bit of confidence, he began to pick up speed, and before long was nearing the source of the mist. Murknine County!</p><br/><p>His first impression was that it looked like an enormous, webby egg sac. Furthermore, he found the wicked aura it emanated to be profoundly disquieting.</p><br/><p>“Dammit, what exactly is going on here?” Trembling in fear, he edged closer to Murknine County, keeping an eye on the dense, impenetrable spiderwebs. Considering how uneasy he felt, he didn’t do anything rash, and simply flew along the edge of the county to inspect the webbing.</p><br/><p>After six hours passed, he had almost made a complete circle of the county, but hadn’t found any entrances. Eyes flashing, he considered striking at the web to see how strong it was. But that was when his expression flickered, and he turned to look in a different direction in the mists.</p><br/><p>Gradually, a woman became visible off in the distance, although he couldn’t quite see who she was. When she saw Bai Xiaochun, she approached. Soon, she was close enough to make out her face.</p><br/><p><span>“Gongsun Wan’er,” he said by way of greeting, keeping his voice down. </span><span id=\"footnote-ref-f4e1\">[1]</span></p><br/><p>“Bai Xiaochun!” she replied. Soon she was right in front of him. Obviously, there was no need for an explanation of why the both of them were here.</p><br/><p>Considering how bizarre things were at the moment, Bai Xiaochun was actually happy to have Gongsun Wan’er around. Not wasting any time on small talk, he quickly went on to tell her everything he knew. </p><br/><p>“This mist is expanding with the speed of a deva, corrodes the land it covers, and sucks the life force out of anything it touches. The strangest thing is that it extracts life force by teleporting it away, or at least, by using something that resembles a teleportation.</p><br/><p>“This web is one huge structure with no entrances. I haven’t unleashed any attacks to test it, but I'm guessing that any divine abilities used against it will provoke some sort of response. If we hit it hard enough, maybe we could get through in one shot. Otherwise, it will probably take a long time to get through.” </p><br/><p>Gongsun Wan’er took a moment to digest all the information, then went on to tell Bai Xiaochun a few things she had come to discover.</p><br/><p>Lowering her voice, she said, “Two days ago, I sent two demigods here to investigate. Back then, the webbing hadn’t yet formed into a single structure, and there were ways to get in. However, after the demigods went inside… I never heard from them again!</p><br/><p>“Furthermore, this mist is transforming. I suspect that within three days, it will be expanding at the speed of a demigod. And that’s probably not its full limit!”</p><br/><p>Bai Xiaochun was visibly shocked by this.</p><br/><p>The two of them exchanged a glance. Obviously, there was no time to sit around waiting for either the Vile-Emperor Dynasty or the Saint-Emperor Dynasty to send reinforcements. They had to do something immediately!</p><br/><p>There were few options. Bai Xiaochun gritted his teeth, and Gongsun Wan’er’s eyes flashed with determination. If Gongsun Wan’er had been on her own, she wouldn’t have been willing to face the danger. But considering they were celestials, there were few places in the Eternal Immortal Domains that they could not go.</p><br/><p>They discussed the particulars and came up with a simple plan, and then drew upon the powers of their cultivation bases. Booms rang out as divine abilities were unleashed, striking one particular spot on the webbing.</p><br/><p>A shockwave blasted out in all directions, and the web rippled, seemingly standing up to the power of the combined attack.</p><br/><p>But the web barrier had only been erected recently, and Bai Xiaochun and Gongsun Wan’er were celestials with matchlessly powerful divine abilities. A moment later, the web shuddered, and a hole opened up.</p><br/><p>Instantly, vast quantities of gray mist poured out of the hole, which began to close up the moment it opened.</p><br/><p>“Go!” Gongsun Wan’er said, blurring into motion to enter the hole. Bai Xiaochun suppressed his unease, braced himself, and followed!</p><div id=\"footnote-f4e1\"><br/><p>1. I know this is a really odd place to put this footnote, but I don’t think I’ve ever mentioned that, in Chinese culture, the main way to greet people you know is to say their name. The common word for hello (ni hao), is more used to get someone’s attention, or to greet people who are strangers to you <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}