{"title": "Chapter 1138: Are You Crazy, Bai Xiaochun!?", "id": 1138, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1138-are-you-crazy-bai-xiaochun", "volume_title": "Volume 12", "body": "<h1>Chapter 1138: Are You Crazy, Bai Xiaochun!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This was Bai Xiaochun’s first time seeing Gongsun Wan’er use a magical technique like this. The black vortex radiated an ancient, deathly aura as it became like a huge mouth that widened to consume the huge spider.</p><br/><p>The spider let out an agonized shriek as its body began to collapse into pieces. It only took about ten breaths of time for the entire thing to be completely sucked up by the vortex.</p><br/><p>Bai Xiaochun’s scalp tingled in shock as he watched it happen. After all, the spider had fleshly body power equivalent to a celestial, and yet Gongsun Wan’er’s divine ability completely destroyed it with impunity. Clearly, that divine ability was extraordinary beyond belief.</p><br/><p>Meanwhile, Gongsun Wan’er staggered back a few paces, her face draining of blood; unleashing that ancient vortex had not been any simple task, and had been very draining. And considering how long it took her to unleash it in full, it must not be something that she could casually call upon. Although Bai Xiaochun was now sighing in relief that the fight was over, his fear of Gongsun Wan’er increased.</p><br/><p>“That ability must be unique to Gongsun Wan’er herself. Otherwise, Ghostmother wouldn’t have been so easy to kidnap.” However, now was not the time to sit around contemplating the matter. Eyes flashing, he looked at the egg sac.</p><br/><p>Panting for breath, Gongsun Wan’er also looked in the same direction. There was no need for them to discuss what to do next. In almost the same instant, they both unleashed attacks.</p><br/><p>Gongsun Wan’er summoned her bone battleship, except it was shrunk down to the size of a hand. As soon as it appeared, black smoke shot out from it toward the egg sac. As for Bai Xiaochun, he knew that it was a critical moment, so he summoned the Greatsword of the North and backed it with his early Celestial Realm cultivation base to slash at the egg sac!</p><br/><p>Two trump cards were unleashed, landing on the huge egg sac in almost the exact moment. First was Gongsun Wan’er’s battleship. Although that initial blow didn’t break the exterior of the trembling egg sac, it got twenty percent through!</p><br/><p>Then came Bai Xiaochun’s greatsword, which slashed down from a different angle. Sword qi raged as the egg sac was sliced thirty percent open. Then forty percent, fifty percent, sixty percent…. In the blink of an eye, the egg sac was seventy percent open! As of this moment, its surface was now translucent enough to see something inside, alive and wriggling!</p><br/><p>Meanwhile, a massive booming sound rang out because of their combined attack.</p><br/><p>It was so loud that the vibrations would likely have killed even a deva, and caused blood to spray out of the mouth of a demigod. Even celestials would be shaken. Thankfully, Bai Xiaochun and Gongsun Wan’er were among the most powerful experts in the entire world, and therefore, quickly recovered.</p><br/><p>However, despite nearly being able to break open the egg sac with their combined attacks, they didn’t complete the job. And in the following handful of moments, the egg sac quickly healed itself!</p><br/><p>Such powers of regeneration caused both Bai Xiaochun and Gongsun Wan’er to gasp. </p><br/><p>Of course, Gongsun Wan’er was shaken by the terrifying nature of Bai Xiaochun’s world treasure, but had no time to contemplate the subject right now. The two of them exchanged a glance, then once again unleashed simultaneous attacks. This time, Bai Xiaochun didn’t beat around the bush. He poured fleshly body power and cultivation base power into the Greatsword of the North, as well as various divine abilities and other techniques.</p><br/><p>Gongsun Wan’er popped some medicinal pills into her mouth, bringing some of the color back to her face. Phoenix-like eyes radiating murder, she sent massive amounts of black energy swirling out of her. Yet again, her battleship appeared, and at the same time, it was possible to see something like black veins bulging beneath her skin, indicating that she was going all out!</p><br/><p>As they attacked, the egg sac’s surface was reduced by thirty percent, fifty percent, seventy percent, ninety percent!!</p><br/><p>However, at that point, its ridiculous powers of regeneration kicked in, as well as a backlash defense. Rumbling booms echoed out as Bai Xiaochun and Gongsun Wan’er were sent stumbling backward, and the egg sac once again returned to its normal state, as if nothing had happened!</p><br/><p>“Impossible!!” Gongsun Wan’er breathed. The defensive powers of this egg sac were horrifying, to say the least. Bai Xiaochun stood off to the side, panting for breath, wondering why its powers of regeneration seemed similar to his own powers from the Undying Codex. Although there were some differences, they were definitely very close.</p><br/><p>Clearly, the egg sac was making use of the life force that had been gathered from Murknine County. In fact… it reminded Bai Xiaochun very much of how he had been forced to collect life force when cultivating the Undying Codex.</p><br/><p>Because of all of this, he was starting to wonder… if his Undying Codex was somehow derived from this huge egg sac!</p><br/><p>Otherwise, why did it feel like his technique was somehow connected to it, despite being different!?</p><br/><p>If there had been enough time, Bai Xiaochun and Gongsun Wan’er might have been able to analyze the matter a bit more to figure out how to break the egg sac open. But right now, as the sound of the egg sac's struggling grew louder and louder, it seemed likely that whatever was inside was about to break out!</p><br/><p>Bai Xiaochun and Gongsun Wan’er were visibly worried. Although they couldn’t be absolutely certain of all the circumstances, it seemed likely that whatever being had absorbed all of the life force of Murknine County would be terrifyingly powerful!</p><br/><p>If the mere surface of the egg sac was so heaven-defyingly strong, then it could only be imagined what was inside.</p><br/><p>Gongsun Wan’er’s face was as pale as a sheet, and for the first time since entering Murknine County, she decided that retreat was the best option.</p><br/><p>“Let’s go,” she said. “this is beyond us. I have a feeling that whatever is growing inside of that egg sac is something profoundly wicked. I doubt anything less than an archaean could deal with it. We’ve done all we can!” She began to back up, worried that if they delayed too long, they wouldn’t be able to escape.</p><br/><p>At any other time, Bai Xiaochun would have been the first to suggest leaving. But right now, he simply stood there, staring at the struggling egg sac.</p><br/><p>A crazy idea had begun to brew in his head, an idea that he simply couldn’t stop thinking about. No one but him could possibly have ever come up with such a concept, and it was only because of how the egg sac seemed so similar to the Undying Codex.</p><br/><p>“Time to go for broke!” he shouted, seemingly throwing caution to the wind. He just couldn’t allow Mistysea Prefecture to be brought to ruin, which would most certainly happen if the being inside of the egg sac were allowed to grow to completion.</p><br/><p>Furthermore, considering what he had already done to prevent this thing from entering the world, if it ever succeeded, it would definitely come after him for revenge.</p><br/><p>“If I hadn’t done anything to offend it, maybe I could give up here. But since I already did, I need to go all out to kill it. And if I can’t kill it, I need to make it scared of me!!” He gritted his teeth.</p><br/><p>“Wan’er, help me out here. If this doesn’t work, then we’ll leave!” With that, he hefted the Greatsword of the North and prepared to attack. In resopnse, Gongsun Wan’er nodded and prepared to join him.</p><br/><p>Intense rumbling sounds echoed out as trump cards were yet again unleashed. The attacks slammed into the egg sac, breaking the surface all the way until the ninety percent mark, whereupon the backlash and regeneration began.</p><br/><p>But this time, even as Gongsun Wan’er backed up, Bai Xiaochun ignored the effects of the backlash attack. Blood spraying out of his mouth, he shouted at the top of his lungs as he produced… the Eternal Parasol!</p><br/><p>Even as the egg sac began to repair itself, he viciously stabbed the Eternal Parasol right into it!!</p><br/><p>In that moment, the backlash attack and the powers of regeneration surged. Bai Xiaochun felt like mountains were slamming into him, causing him to shiver and cough up multiple mouthfuls of blood. His own powers of regeneration were in full swing as his own Undying Codex vied with the egg sac!</p><br/><p>At this point, the Eternal Parasol’s ability to absorb life force erupted out. Although the surface of the egg sac had not yet been pierced, a bit of life force had already begun to pour out of it. As Bai Xiaochun shoved the parasol down with all his might, the egg sac’s backlash attack and powers of regeneration continued to rage in conflict.</p><br/><p>Blood flowed out of his mouth like a fountain, much to the astonishment of Gongsun Wan’er.</p><br/><p>“Are you crazy, Bai Xiaochun?!?!”</p><br/><p>Eyes bloodshot, Bai Xiaochun used the Living Mountain Incantation and the Cloud Lightning Forefather Transformation, pushing himself all the way to the peak. Fleshly body power and cultivation base power erupted, until finally the egg sac’s surface reached a limit. Shouting, Bai Xiaochun pushed the pointed tip of the Eternal Parasol… through the surface! A popping sound rang out as its tip stabbed into the interior of the egg sac!</p><br/><p>At that point, life force more powerful than anything Bai Xiaochun had ever encountered in his entire existence began to pour through the Eternal Parasol into him!</p><br/>\n</div>"}