{"title": "Chapter 1149: Feeding The Egg Sac", "id": 1149, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1149-feeding-the-egg-sac", "volume_title": "Volume 12", "body": "<h1>Chapter 1149: Feeding The Egg Sac</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun hovered there quietly with Celestial Aged Spirit. </p><br/><p>Aged Spirit knew that help would come eventually. After all, he understood a bit more about the situation than Bai Xiaochun. But at the same time, he knew that his cultivation base was not high enough to do anything about the catastrophe that was already playing out, other than save those of his people who he already had.</p><br/><p>Eventually, Bai Xiaochun couldn’t even see the end of the spiderwebs. Everything was covered with the stuff, which emanated an aura of rot that wanted to take away all life force that it touched.</p><br/><p>By this point, the spiderweb covered about half of the second immortal domain, and was moving with a speed that only celestials could evade.</p><br/><p>Mixed emotions could be seen in Celestial Aged Spirit’s face, especially defiance. To him, the second immortal domain was home, and now, he was being forced to watch it slowly being destroyed.</p><br/><p>“King Heavenspan, the incident in Murknine County that you reported to me was something both the Saint-Emperor and the Vile-Emperor had predicted would happen. As for the current situation, they have been secretly pulling strings to make it play out exactly like this!</p><br/><p>“That is why your report to the Saint-Emperor went completely unanswered, and also why he prevented the news from spreading. After all, you are not a celestial of the Saint-Emperor Dynasty, and therefore, and are not as in the know as the rest of us!</p><br/><p>“Within that enormous egg sac is… the clone of a sovereign!!” </p><br/><p>When Bai Xiaochun heard that, he turned to look at Celestial Aged Spirit, eyes flashing. “Sovereign?” </p><br/><p>At this point, Celestial Aged Spirit looked up into the sky that hung above the Eternal Immortal Domains, and the enormous giant that filled most of it!</p><br/><p>“Back when the damaged fan came, it hit that enormous sovereign’s hand and knocked off a chunk of black stone. Remember how both emperors went missing after that incident? It was because they were fighting over that stone!</p><br/><p>“Hmph. To an archaean, a chunk of the skin of a sovereign would be extremely valuable. It could very well hold secrets regarding the way to break through to the Sovereign Realm. Even the vaguest of clues would still be indescribably precious, and could drive an archaean to madness!</p><br/><p>“Despite how cautious the two archaeans were in their struggles over the chunk of skin, it managed to escape. Afterward, the two vicious archaeans realized that unless that chunk of skin grew to maturity, the secrets of the Sovereign Realm within it would not be unlocked!</p><br/><p>“They knew that, eventually, it would reach the point where it would begin to devour life force. And thus, they knew that the incident in Murknine County was that very chunk of skin trying to grow.</p><br/><p>“Neither of them were happy with the level of growth it achieved, though, and thus left it to its own designs. They wanted it to grow into a <em>true</em> sovereign clone. In fact… they decided to allow the second immortal domain to become food for it!</p><br/><p>“They’re simply waiting. When the sovereign clone stops growing… that's when they’ll finally show up!” In his fury, Celestial Aged Spirit didn’t hold anything back, and revealed everything he knew to Bai Xiaochun.</p><br/><p>As Bai Xiaochun heard the story being told, he began to breathe heavily, and his heart sank. His eyes also began to glow with intense cold light.</p><br/><p>To be plotted against and abandoned in the end made him feel much the same as when he had been dealing with Daoist Heavenspan.</p><br/><p>“Letting that clone consume so much life from an immortal domain is nothing less than the Saint-Emperor and the Vile-Emperor playing with fire!” Although he had already had speculations that something like this was happening, to hear it right out of Celestial Aged Spirit’s mouth caused Bai Xiaochun’s heart to grow icier with every moment that passed.</p><br/><p>Although he wasn’t the overly compassionate type, to hear that so many lives were being sacrificed was something he just couldn’t take. Even if it was all for the sake of pushing someone into the sovereign realm to fight back against the Enemy from Beyond, it was still too much for him.</p><br/><p>Bai Xiaochun felt profoundly unsettled, and Celestial Aged Spirit’s anger continued to build. Meanwhile, the spiderweb expanded and expanded. It was at around this time that a 3,000-meter-long lightning bolt appeared in the sky, rushing toward them at top speed.</p><br/><p>The sky seemed to rip apart from the shocking sound of the thunder that accompanied it, and even the spiderweb stopped moving for a moment.</p><br/><p>Bai Xiaochun and Celestial Aged Spirit looked up at the lightning bolt to see the Saint-Emperor, his eyes shining with dazzling, holy light.</p><br/><p>Next to him was the cold and ruthless Gu Tianjun, and Sima Yunhua, with a soft, gentle smile on his face. And finally, there was the white-haired but sharp-eyed Chen Su.</p><br/><p>With Celestial Aged Spirit, four celestials from the Saint-Emperor Dynasty were present!</p><br/><p>A flicker of excitement could be seen in the Saint-Emperor’s eyes that he just couldn’t conceal. Completely ignoring Bai Xiaochun and Celestial Aged Spirit, he blurred into motion toward the spiderweb and began to inspect it more closely. Sima Yunhua and the other celestials headed over to Celestial Aged Spirit to offer greetings, and despite how much they disliked Bai Xiaochun, gave him polite nods.</p><br/><p>Before anyone could say anything, an intense rumbling sound filled the sky as a black cloud spread out, quickly settling into the form of a huge statue.</p><br/><p>Towering devil qi surged out from the statue, causing everything to rumble as eight individuals took form!</p><br/><p>One of them wore imperial robes, and an imperial crown. He was middle-aged, the type who looked threatening without being angry. His eyes were especially noteworthy; they seemed to contain the transformations of all heaven and earth, and when he looked at Bai Xiaochun and the other celestials, they couldn’t help but gasp a bit.</p><br/><p>Although Bai Xiaochun had never seen him up close before, he immediately knew that this man was none other than… the Vile-Emperor!</p><br/><p>His imperial garb and archaean aura made him seem like a burning sun hanging in the sky. He actually looked very similar to the Saint-Emperor, just colder and more callous, so much so that it seemed as if he could cause frost to build up everywhere around him. There was also something a bit more domineering about him than the Saint-Emperor.</p><br/><p>If you looked closely, you could see that his pupils consisted of two pitch-black swords.</p><br/><p>He had not come alone any more than the Saint-Emperor had. Behind him hovered seven individuals, some men, some women, but all of them… celestials of the Vile-Emperor Dynasty!</p><br/><p>Gongsun Wan’er. Reverend Devourer. Prince Ur-Demon. Celestial Virūpākṣa. Celestial Deadfall. They were all there. There was also a stooped old woman with brown age-spots on her face. However, all of those people faded into a blur to Bai Xiaochun as he focused on one particular middle-aged man in a black robe!</p><br/><p>He clearly emanated the fluctuations of a celestial, and seemed impressive in a way that was second only to the Vile-Emperor. As soon as Bai Xiaochun saw him, the man saw Bai Xiaochun. They were only about 600 meters away, after all.</p><br/><p>“Daoist Heavenspan!!” Bai Xiaochun growled, his eyes turning bloodshot. This man was none other than Du Lingfei’s father, Daoist Heavenspan!</p><br/><p>“Bai Xiaochun!” Daoist Heavenspan murmured, his eyes narrowing as he looked coldly at Bai Xiaochun.</p><br/><p>Bai Xiaochun had often thought about where he might encounter Daoist Heavenspan again, and whether or not he would be able to control the hatred in his heart.</p><br/><p>And as of this moment, he realized that he couldn’t. It didn’t matter that it wasn't an appropriate moment to take action. The instant he saw Daoist Heavenspan, both his cultivation base and his killing intent seemingly erupted of their own accord.</p><br/><p>He didn’t say anything. He didn’t hesitate. He didn’t hold back. He stepped forward, blurring into motion toward Daoist Heavenspan.</p><br/><p>Daoist Heavenspan didn’t seem surprised at all by this. Eyes flashing with sinister light, he stepped forward and performed an incantation gesture with his right hand, summoning his nine Daogates.</p><br/><p>Dazzling light shone out as the Daogates created a spell formation in front of him. Then he pushed out with his hand, revealing the fluctuations of the early Celestial Realm. However, based on his battle prowess, he was very close to the mid Celestial Realm!</p><br/>\n</div>"}