{"title": "Chapter 1156: Gone!?", "id": 1156, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1156-gone", "volume_title": "Volume 12", "body": "<h1>Chapter 1156: Gone!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun kept pushing his hand down onto his bag of holding as he sped along. Really, he had no other choice but to do that. Despite the lizard having been sealed and placed in his bag of holding, its seemed to be struggling to get out into the open, forcing Bai Xiaochun to add in cultivation base power to keep the bag closed.</p><br/><p>“I need to find somewhere to hole up!” The first thing he thought of was the damaged fan. However, after attempting to make contact, he found that the spiderweb was interfering. Perhaps he could try to forcibly make the teleportation happen, but he was worried something could go wrong, and he might come out on the other end missing an arm or a leg.</p><br/><p>“An arm or a leg I could deal with, but what would happen if my head didn’t get teleported through…?” The mere thought of that scene caused him to shiver.</p><br/><p>“No. If I want to teleport out of here, I need to find a place where the fighting between the clone and the two emperors weakened the spiderweb enough to establish a solid connection.” He didn’t even pause to think about going to the actual exit. Blurring into motion, he began to search.</p><br/><p>The Vile-Emperor Dynasty celestials had no way of easily tracking Bai Xiaochun, but it was different with those from the Saint-Emperor Dynasty. They had many options, especially Chen Su. Although he was not powerful in terms of battle prowess, when it game to augury arts, none of the other celestials were his equal.</p><br/><p>In fact, it hardly took Chen Su any work to get a general direction.</p><br/><p>“There!” he said, his eyes flashing. Gu Tianjun immediately shot into motion, followed by Sima Yunhua and the others. None of them sent messages ahead. After all, they didn’t trust Bai Xiaochun, and were worried that if they notified him ahead of time, he might be prepared, and make it harder for them to get the lizard.</p><br/><p>Although the Saint-Emperor had said that everyone would get a reward as long as the clone was acquired, all of them knew that the rewards… would differ in quality!</p><br/><p>Gu Tianjun was absolutely set on being the one to come out on top, and had even agreed to concede some of the rewards he would get to Chen Su and the others in order to achieve that goal.</p><br/><p>The four of them pushed forward at top speed for about an hour before Chen Su’s eyes began to shine brightly.</p><br/><p>“5,000 kilometers up ahead!” he said, pointing. Gu Tianjun’s eyes shone with cold light as he quickly performed an incantation gesture, sending seven beams of sword light streaking off in that very direction.</p><br/><p>They moved so quickly that they were almost invisible, piercing through those 5,000 kilometers to appear right on top of Bai Xiaochun.</p><br/><p>Bai Xiaochun’s face fell as he leaped backward by about 30 meters. Even as he did, seven beams of light slashed through the spot he had just occupied, causing enormous booming sounds to echo out.</p><br/><p>If he hadn’t acted any faster, although he probably wouldn’t have been killed, he would definitely have been seriously injured.</p><br/><p>“Gu Tianjun!!” he said through gritted teeth. Those seven beams of sword light obviously contained the aura of Gu Tianjun. “You’re obviously trying to rob me!! If you wanted all the credit, you could have messaged me and talked things over. But instead…. you just try to outright rob me!” </p><br/><p>Already, Bai Xiaochun was starting to get angry.</p><br/><p>Bai Xiaochun was very well aware that the celestials of the Saint-Emperor Dynasty were a sanctimonious lot. However, the possible benefits at hand today were enormous. Although the Saint-Emperor had said that everyone would be rewarded, Bai Xiaochun was under no illusions that he, an outsider, would be treated fairly.</p><br/><p>And Gu Tianjun’s actions had just gone to prove that.</p><br/><p>“Complete and utter bullying!” Gritting his teeth, he accelerated, heading to a location off in the distance where the spiderweb seemed particularly weak.</p><br/><p>Although he couldn’t see Gu Tianjun and the others, he could tell that their divine sense was spreading out toward him.</p><br/><p>However, the seven swords were faster than the divine sense, and had already circled back around to attack him again. After dodging them yet again, he continued on toward the weakened portion of the spiderweb. He knew that he would only have one shot at this, and that if he failed, the other celestials would arrive, and he would be forced to hand over the lizard.</p><br/><p>Even with the Greatsword of the North, he couldn’t fight all four of them at the same time. Furthermore, they could afford to rely on resurrection as their ultimate backup, whereas if he perished, he had no such option.</p><br/><p>“Well since they’re pushing things this far, they can’t blame me for cheating. I didn’t want to do this earlier, but now I can do it with a clean conscience!” Even as the seven beams of sword light closed in, followed closely by Gu Tianjun and the other celestials, he took a deep breath and made contact with the damaged fan!</p><br/><p>That single thought caused the air around him to blur and distort. In the blink of an eye, seven swords slashed through the area, followed by streams of divine sense from the celestials, a veritable windstorm of destructive power.</p><br/><p>Unfortunately… not a trace of Bai Xiaochun was anywhere to be seen!</p><br/><p>After a few breaths of time passed, four beams of light appeared off in the distance. The celestials all had somber expressions on their faces, and as soon as they arrived, they sent their divine sense out as high and low and far as possible, looking for clues.</p><br/><p>Gu Tianjun sent his swords slicing through the air in the area, and Chen Su performed incantation gestures to try to get a read on Bai Xiaochun. And yet, to their utter disbelief, Bai Xiaochun… was really nowhere to be seen!</p><br/><p>“Impossible!” Gu Tianjun said, his eyes crimson. Based on his connection to his flying swords earlier, he could say with absolute certainty that Bai Xiaochun had been present. But then, a moment later, he was gone.</p><br/><p>Furthermore, there were no signs of teleportations having been performed in the area. The other celestials simply couldn’t guess how Bai Xiaochun had possibly escaped. Face grim, Gu Tianjun waved his hand, transforming his seven swords into forty-nine swords that slashed out in a furious tempest, kicking up dust as they cut everything to pieces.</p><br/><p>Sima Yunhua and Celestial Aged Spirit did everything they could think of as well, but it did no good. Eventually, the three of them looked over at Chen Su, whose eyes glowed with the light of augury.</p><br/><p>They waited, their hearts pounding as they realized that something seemed very strange about Chen Su. His forehead was covered with sweat, and he was even trembling visibly.</p><br/><p>Eventually, he opened his eyes and coughed up a massive mouthful of blood. Staggering backward, he weakened visibly, and roughly thirty percent of the hair on his head dissolved into ash. Deep wrinkles spread out on his face.</p><br/><p>“Impossible!!” Chen Su murmured, hardly able to deal with the backlash from his failed augury attempt. “Either an archaean is masking his presence, or he’s not in the second immortal domain! Those are the only ways he could completely evade me!!” </p><br/><p>The other celestials’ jaws clenched in response to his words. As for Gu Tianjun, he gritted his teeth and said, “He's got to be hiding somewhere. Let’s split up and search. We have to find him!” </p><br/><p>With that, he blurred into motion to begin searching.</p><br/><p>Sima Yunhua and the others similarly spread out.</p><br/><p>As the celestials from the Vile-Emperor Dynasty locked down the exit, and the forces of the Saint-Emperor Dynasty began to search, Bai Xiaochun appeared on the damaged fan as it sailed through the darkness of the void.</p><br/><p>After quickly checking to make sure that all his limbs and extremities were with him, he breathed a sigh of relief, and then chuckled with pride.</p><br/><p>“Hmmmphh. Think you can track me down here? Keep dreaming!” Flicking his sleeve, he sat down cross-legged, slapped his bag of holding, and brought out the lizard.</p><br/><p>This lizard was actually a part of the fleshly body of a sovereign, and although it was virtually dead, it still had a scrap of life left in it. However, it was clearly beyond recovery, and was even starting to turn stiff with death.</p><br/><p>“This thing isn't bad at all!” Bai Xiaochun said, licking his lips with the realization that he had acquired something that would drive others mad with envy if they knew he had it.</p><br/>\n</div>"}