{"title": "Chapter 1151: Celestial Pill", "id": 1151, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1151-celestial-pill", "volume_title": "Volume 12", "body": "<h1>Chapter 1151: Celestial Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The massive boom caught the attention of all of the celestials outside of the spiderweb, including Bai Xiaochun. Although they were unable to directly see what was happening, from the nature of the sound, they were able to determine that the Vile-Emperor and Saint-Emperor were currently fighting a battle with the sovereign clone!</p><br/><p>“It’s fighting against two archaean emperors…? This clone is so strong!” The booms and vibrations of the battle lasted for a full six hours, leaving both Bai Xiaochun and all of the other celestials shocked.</p><br/><p>Everyone kept their cultivation bases rotating and their guard up, just in case something unusual happened.</p><br/><p>All of them were convinced that with two archaeans working together, everything should go smoothly. However, as time dragged on, their confidence began to waver.</p><br/><p>Apparently, the prevailing thought was that the matter should have been handled much more quickly. Eventually, three days had gone by, during which booms and vibrations continued to shake the spiderweb. Furthermore, although the spiderweb wasn’t expanding, and was in fact shrinking, there were many areas which seemed to be solidifying into something like the surface of an egg.</p><br/><p>This strange sight caused the hearts of Bai Xiaochun and the other celestials to race, and to fill with sensations of increasing unease.</p><br/><p>Close to where Bai Xiaochun was seated were Gu Tianjun and Sima Yunhua. </p><br/><p>“This is taking too long,” Gu Tianjun said in a hushed tone.</p><br/><p>“You wouldn’t think anything too unexpected could have occurred,” Sima Yunhua replied.</p><br/><p>Celestial Aged Spirit was chuckling inwardly in cold schadenfreude, but wasn’t saying anything. As for Bai Xiaochun, he simply sat there thoughtfully. On the other side of the hole, the celestials from the Vile-Emperor Dynasty were similarly engaged in hushed conversations, or were analyzing the situation as best they could.</p><br/><p>Eventually, the fourth day came, and everyone was coming to the conclusion that something strange was going on. It reached the point that Gu Tianjun and Celestial Virūpākṣa were both getting ready to go inside to investigate the situation.</p><br/><p>However, that was when a rumbling boom erupted out that vastly surpassed anything from before. It was like a million lightning bolts striking at the same time. And it was accompanied by a shriek that caused all of the celestial’s minds to spin.</p><br/><p>At that point, two beams of light shot out from the hole in the spiderweb. Before anyone could react, the two beams had separated and appeared in the midst of the forces from the two different dynasties.</p><br/><p>They were none other than the Saint-Emperor and the Vile-Emperor!</p><br/><p>Their faces were ashen, and both were clearly injured, with blood oozing out of their mouths, and their eyes grim.</p><br/><p>All of the celestials looked on, hearts pounding. Before anyone could ask any questions, the Saint-Emperor glanced at Gu Tianjun, Bai Xiaochun and the other celestials, and in a very serious tone said, “The clone of that sovereign is a crimson, reptilian entity. Its cultivation base is in the mid Archaean Realm, just on the verge of a breakthrough!</p><br/><p>“The Vile-Emperor and I joined forces to attack it, and even used our trump cards. In the end, the worst we could do was injure it, and drop its cultivation base down into the Celestial Realm. Seriously wounded, it fled, using some unknown divine ability to evade us completely. No amount of searching turned up any clues.</p><br/><p>“I need the five of you to go in there and search for it. The ideal outcome would be for you to find and capture it. But if necessary… its corpse will do. Either way, you <em>must</em> get it!!</p><br/><p>“If any of you find it, then I’ll reward all five of you with… a Celestial Pill!” The Saint-Emperor knew that if he wanted the full support and cooperation of his celestials, he needed to offer a good reward. Although it pained him to some degree, he didn’t hesitate to do just that!</p><br/><p>“A Celestial Pill!?” Sima Yunhua blurted, unable to restrain himself. Bai Xiaochun wasn’t completely sure of what that was, but considering the name, he could at least guess.</p><br/><p>Seeing Bai Xiaochun’s facial expression, the Saint-Emperor went on to provide further explanation.</p><br/><p>“From the moment the Saint-Emperor Dynasty was founded to this day, I have only concocted a total of seventeen Celestial Pills. As of now, I have nine left. Consuming one will give you a sixty percent chance of achieving a breakthrough within the Celestial Realm!” </p><br/><p>When Bai Xiaochun heard that, his eyes went wide, and his heart started to pound. Apparently, a Celestial Pill could provide him with just as much benefit as the life force he had taken from the egg sac.</p><br/><p>“I can’t believe pills like that exist!!” he thought. The mere looks of excitement on the faces of Gu Tianjun and Celestial Aged Spirit showed what kind of pill it was. After all, they were already in the late Celestial Realm.</p><br/><p>“I wonder if it would help a celestial who was trying to break into the Archaean Realm?” Glancing over at the forces of the Vile-Emperor Dynasty, he could see that those celestials looked equally excited. And of course, Gu Tianjun and the other Saint-Emperor Dynasty forces noticed the same thing.</p><br/><p>Glances were being exchanged on both sides as everyone measured each other up.</p><br/><p>Clearly, although the two archaean emperors had injured the sovereign clone, they had also been severely drained in the process. Furthermore, they were still intent on winning the overall prize. Because of that, both were worried about the other coming out on top, and also worried about the reptilian clone escaping.</p><br/><p>What had been most unexpected in the entire thing was that the sovereign clone turned out to be at the peak of the mid Archaean Realm, which was much more powerful than they had expected. What worried them the most was the possibility that, if it escaped, it would get even stronger, which could lead to a true disaster.</p><br/><p>After much consideration, the two of them came to an agreement. Neither of them would take action. They would stand guard outside in case the sovereign clone tried to escape, and have their subordinates go inside to compete over the chance to capture or kill it.</p><br/><p>Of course, it was obvious that because of how the Vile-Emperor Dynasty’s forces outnumbered the Saint-Emperor Dynasty’s, there must have been some other agreement reached by the two emperors to make up for the disparity. However, Bai Xiaochun couldn’t think of what that might be. In either case, the chance at a Celestial Pill was enticing, and on top of that, he was actually very interested in the sovereign clone that the two archaeans took so seriously.</p><br/><p>“It might contain clues about how to break through to the Archaean Realm…. Although I'm quite a way away from that, it would be a big pity to see that good fortune go to someone else.” Of course, he wasn’t the only one thinking that way. Celestials from both sides were all considering the same thing.</p><br/><p>And yet, no one was willing to get too greedy. Obviously, the two archaeans were aware that one of their subordinates could potentially try to take the prize for themselves. Because of that, it seemed obvious that one of the unspoken prizes up for grabs was a portion of the sovereign clone’s flesh and blood, with the rest going to one of the emperors.</p><br/><p>It was mere conjecture, but seemed highly likely to the celestials.</p><br/><p>After all, such arrangements had been made on more than one occasion in the past.</p><br/><p>“Your Dharmic decree shall be adhered to, Saint-Emperor!” Gu Tianjun said, clasping his hands solemnly. Then he turned into a beam of sword light that shot into the spiderweb. Sima Yunhua, Chen Su, and Celestial Aged Spirit all made similar declarations, and then joined Gu Tianjun to fly inside.</p><br/><p>Similarly, the Vile-Emperor Dynasty celestials, Gongsun Wan’er included, all shot into the hole. Not having any logical reason to refuse to go in, Bai Xiaochun also turned into a beam of light that shot into the world within the spiderweb!</p><br/><p>After they left, the Saint-Emperor and the Vile-Emperor sat down cross-legged and exchanged glances. Then they sent their divine sense out in all directions to make sure the lizard clone didn’t escape from some other location.</p><br/><p>They were not giving it any wiggle room to flee.</p><br/><p>“Might as well stop dreaming,” the Vile-Emperor said suddenly, a cold smile playing out on his face. “That sovereign’s flesh and blood will be going to me. And as per our agreement, I’ll give you twenty percent.”</p><br/><p>The Saint-Emperor looked over, and all of the warmth drained away from him. Looking cold and even furious, he said, “You were the one who intentionally let it go earlier. Otherwise we wouldn’t be in this annoying situation!”</p><br/><p>In response, the Vile-Emperor chuckled. </p><br/><p>“Just wait and see what happens,” he said. Then he closed his eyes.</p><br/>\n</div>"}