{"title": "Chapter 1163: I Ate It!", "id": 1163, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1163-i-ate-it", "volume_title": "Volume 12", "body": "<h1>Chapter 1163: I Ate It!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“It’s never good to show off,” Bai Xiaochun thought. “Gu Tianjun and those others went way too far. Why did they have to go and put all the pieces together?!” Feeling a bit guilty, he sighed inwardly.</p><br/><p>It was a bit embarrassing to have the celestials from both of the imperial dynasties staring at him in this way. After a moment, he couldn’t help but clear his throat a bit.</p><br/><p>“Hey, you’re right! Seems it’s missing the tail!” Suddenly, he smacked his forehead and tried to seem very forgetful. “Ohhhhh. I remember now! My memory isn’t what it used to be! I totally forgot that I have the tail right here.” </p><br/><p>He quickly pulled out the tail of the lizard and threw it over.</p><br/><p>Blinking a few times, he said, “Hey, stop looking at me like that. I really forgot!” </p><br/><p>Gu Tianjun glared at him for a moment longer before looking away, whereas Sima Yunhua, because of the favor just now, could only shake his head and smile wryly. Neither Chen Su nor Aged Spirit could think of anything to say.</p><br/><p>The celestials from the Vile-Emperor Dynasty seemed similarly at a loss for words, although their hatred for Bai Xiaochun continued to mount. Only Gongsun Wan’er maintained a purely cold face, although inwardly, she was laughing.</p><br/><p>Now that the fighting was over and the competition had come to an end, the Saint-Emperor looked at the lizard, and then at Bai Xiaochun, an enigmatic smile playing out on his face.</p><br/><p>“King Heavenspan, why is it that… the tail seems abnormally short?”</p><br/><p>In response to his words, the celestials all looked closer at the lizard, and sure enough, the lizard's tail seemed a bit misshapen, almost as if… it were missing a piece.</p><br/><p>“This Saint-Emperor’s eyes are viciously sharp!” Bai Xiaochun moaned inwardly. However, he maintained a confused expression on his face and looked over at the lizard. After a moment, he smacked his head again.</p><br/><p>“Aiya! Seriously, my memory is getting really bad! Yeah, you’re right. It <em>is</em> missing a piece!” With that, he pulled out another chunk of the lizard from his bag of holding and tossed it over. Seeing the Saint-Emperor looking at him thoughtfully, he said in his most sincere voice, “That’s it. This time I really don’t have any more!” </p><br/><p>After watching all of this play out, the surrounding celestials felt as though they were meeting Bai Xiaochun for the first time. They were actually quite shaken. His tendency to try to pilfer things for himself left them literally speechless.</p><br/><p>And that was especially true when… they realized that the extra chunk he had thrown out didn’t seem to make the tail look whole. Oh so slowly, all of the celestials looked away from the lizard and back to Bai Xiaochun again.</p><br/><p>The Saint-Emperor didn’t say a single word. The enigmatic smile remained on his face, and yet, the ill will in his eyes was readily apparent.</p><br/><p>“I really don’t have any more!” Bai Xiaochun said. This time, he was telling the truth. He really didn’t have any more chunks of flesh in his bag of holding.</p><br/><p>At this point, the Vile-Emperor smiled contemptuously, performed an incantation gesture and pointed out. A ray of black light shot out from his finger, heading directly toward the big lizard.</p><br/><p>The ray of light clearly had some fantastic properties; as soon as it sank into the lizard, its flesh began to wriggle and knit back together. Within a few short moments, it looked like it had never been broken apart!</p><br/><p>However, now it was more obvious than ever that there was still a piece missing from its tail.</p><br/><p>And now… all of the celestials and both of the archaeans were looking at Bai Xiaochun.</p><br/><p>Bai Xiaochun was now alarmed to the very core, and was wailing inwardly. After all, the final piece that was missing was the one he had given to the spirit automaton. Although he was a bit guilty, he reminded himself that he had put himself in a lot of dangerous situations to get this lizard for the Saint-Emperor.</p><br/><p>“It's better to be confident than to try to pull a fast one!” he thought.</p><br/><p>Having reached this point in his train of thought, he took a deep breath and decisively said, “I ate it! I ate that missing piece! That sovereign flesh and blood is good stuff. I got it, and wanted to do a bit of research. In the end, I failed. So I decided to eat a bit to see what it would do. Sadly, it's completely disgusting, and didn’t do anything at all.” </p><br/><p>Inwardly, he was grumbling about how stingy these archaeans were. It was just a tiny chunk, wasn’t it?</p><br/><p>When the surrounding celestials heard Bai Xiaochun freely admitting this, their eyes glittered in satisfaction.</p><br/><p>After all, for a celestial to pilfer a bit of sovereign flesh that was intended for an archaean wasn’t really a very big deal. If Bai Xiaochun had tried to hide the fact, they might come up with other conclusions about what he had done. But considering how directly he was stating things, not even the Saint-Emperor felt the need to investigate the matter further, and simply glared at Bai Xiaochun.</p><br/><p>“I'm surprised he didn’t get killed doing that!” he murmured inwardly. “I can’t believe he dared to eat sovereign flesh!” After that, he ignored Bai Xiaochun and looked over at the Vile-Emperor, with whom he transmitted a short conversation.</p><br/><p>The Saint-Emperor held the upper hand, and the Vile-Emperor would be forced to deal with the fact that he had lost. However, the two of them had come to an agreement ahead of time, and therefore, the Vile-Emperor would still get two portions of the flesh and blood. Before leaving, he cast a frosty glance at Bai Xiaochun, then flicked his sleeve and vanished.</p><br/><p>Celestial Virūpākṣa and his fellows did the same, secretly hating Bai Xiaochun down to their bones. Only Gongsun Wan’er felt differently, although it was impossible to detect that within her gaze.</p><br/><p>The matter of the sovereign clone was now concluded. All of the Saint-Emperor’s celestials, including Bai Xiaochun, received a Celestial Pill for their contributions.</p><br/><p>After everyone left, Bai Xiaochun took advantage of the fact that the northern prefectures were now empty to bring out all of the people who were inside the Greatsword of the North. Not only would Mistysea Prefecture be restored, but Bai Xiaochun took advantage of the extremely rare circumstances to expand his territory. It only took a few months for him to take over all five of the northern prefectures!</p><br/><p>He did it with such speed and ferocity that not even the Vile-Emperor could do anything to stop him. After all, the Vile-Emperor Dynasty had experienced the recent death of a celestial, and although it wasn’t a permanently devastating loss, it was still significant.</p><br/><p>Furthermore, considering the momentum that Bai Xiaochun had built up, only Virūpākṣa could have been sent to oppose him. None of the other celestials qualified.</p><br/><p>Most important of all was the fact that the north of the second immortal domain had been almost completely turned into nothing more than dust. Dead lands like that were of little interest or value to the Vile-Emperor Dynasty.</p><br/><p>The entire thing was a bit annoying to the Saint-Emperor, but considering that he was distracted by the sovereign’s flesh and blood, he wasn’t paying very close attention.</p><br/><p>Another factor that played into the overall situation was that Bai Xiaochun now had a much better relationship with Celestial Aged Spirit, who tacitly approved of his actions.</p><br/><p>And thus, in only a few months, Bai Xiaochun unified the north to a large extent. Although it was mostly a dusty wasteland now, the citizens of Mistysea Prefecture were already working hard to bring things back to normal.</p><br/><p>Bai Xiaochun’s name was even more well-known now, and more people came to know how strong he was.</p><br/><p>“Did you hear? King Heavenspan manage to steal a precious treasure away from all of the other celestials!”</p><br/><p>“The part about the treasure is nothing. There were more than a dozen celestials trying to track him down, but they couldn’t find him for a whole ten days!”</p><br/><p>“When he showed up again, he played his cards so perfectly that all of the celestials in the Saint-Emperor Dynasty started to like him! Then he led them out, and got Celestial Pills for all of them as a reward!”</p><br/><p>“You don’t see that every day!” </p><br/><p>As word spread through the Eternal Immortal Domains, the people of Heavenspan heard, and were deeply inspired.</p><br/><p>Meanwhile, Song Junwan, under the protective care of Bruiser, finally made contact with Patriarch Spirit Stream, Li Qinghou, and those who were with them.</p><br/><p>Everything seemed to be progressing wonderfully until, without any warning at all… an imperial decree was sent to Bai Xiaochun from Saint-Emperor City!!</p><br/>\n</div>"}