{"title": "Chapter 1166: Battle Level", "id": 1166, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1166-battle-level", "volume_title": "Volume 12", "body": "<h1>Chapter 1166: Battle Level</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Fearful of the problems the spirit automaton might cause upon awakening, Bai Xiaochun worked as quickly as possible. Whether it was in terms of speed, or his powers of regeneration, the sovereign flesh he had consumed had helped him to advance by leaps and bounds.</p><br/><p>He put on a great showing, and quickly reached the seventy-eighth level!</p><br/><p>As soon as he entered that level, he felt an intense pressure weighing down on him. There was also a sensation of potential danger that caused him to immediately back up and send his divine sense out to check the area.</p><br/><p>Rumbling sounds could be heard as he was immediately able to see the entire area in his mind.</p><br/><p>It was a very strange world indeed.</p><br/><p>There was no sky or no land, only an endless void, and a stone dais. In front of the stone dais was a huge wooden marionette!</p><br/><p>It was fully 300 meters tall, and as round as a sphere. It also had a face painted onto its head.</p><br/><p>Although Bai Xiaochun couldn’t be certain why, he was sure that there was a very strange aura in this place. After studying it for a moment, his attention was continuously drawn to the marionette.</p><br/><p>Almost as soon as he looked at it closely, it opened its eyes, which glowed with mysterious light. Then, it leapt nimbly into the air, and began to head directly toward him.</p><br/><p>“All I did was look at him!” Bai Xiaochun thought. Alarmed, he fell back, but the marionette was shockingly quick. All it took was a moment for it to be right in front of him. Seeing that he couldn't evade it, he decided that since he had recently improved his fleshly body power, he might as well just start fighting. Clenching his right hand into a fist, he punched out at the marionette.</p><br/><p>It seemed like an ordinary strike, but considering the level of his battle prowess, that fist strike alone would be enough to shove someone in the early Celestial Realm away from him, coughing up blood the entire time. Although it might not kill an opponent like that, it would at least inflict injuries.</p><br/><p>Unexpectedly, the seemingly tough marionette actually couldn’t stand up to a single punch, and exploded.</p><br/><p>Shockingly, the shockwave from its explosion was stronger than its own battle prowess, sending out heaven-shaking, earth-shattering fluctuations in all directions. To Bai Xiaochun, it felt like a wild beast attacking him with full ferocity. Rumbling sounds could be heard everywhere as he tumbled back a few dozen meters before coming to a stop, gasping for breath.</p><br/><p>“What a strong backlash!” Looking up, he realized that another powerful aura had erupted from the spot where the marionette had exploded.</p><br/><p>At that point, he realized that what had exploded was only something like an exterior shell. There was now another marionette standing there, a bit smaller than the one from before!</p><br/><p>This marionette’s aura was stronger, and just like the other one, it attacked the moment it saw him. From the look in its eyes, it seemed like it wouldn’t stop fighting until he was dead, or it was destroyed!</p><br/><p>Frowning, he chose not to back up, but instead, to attack with a fist strike. However, after unleashing the strike, he immediately fell back.</p><br/><p>Unfortunately, no matter how quickly he backed up, the shockwave from the exploding marionette still hit him, causing his qi and blood to vibrate painfully.</p><br/><p>A moment later, an even more powerful aura arose, and he saw another, smaller marionette. At that point, his eyes went wide.</p><br/><p>“Will it ever end?!” he thought, shocked. Presumably, the way to pass the level was to destroy the entire marionette, including all of the layers that made it up.</p><br/><p>“What a weird level. If the spirit automaton is around, that would mean I'm in great danger!” With that, he sent some more divine sense out to scan the area.</p><br/><p>“I bet he is awake…. But based on the timing, he should still be asleep!” By now, his power over the damaged fan had reached the point where he could use it to track down the spirit automaton.</p><br/><p>He was already starting to get anxious, but now was not the time for delays. He should either evacuate the level and accept defeat, or do his best to pass it as quickly as possible.</p><br/><p>Back when he was in Mistysea Prefecture, he would probably have selected the former. But now he was in the Vile-Emperor City, in a position of potential danger. The sooner he got the rewards he sought, the faster he would improve his cultivation base. And if he could pass all the levels and become the true owner of the fan, then he would have a much more stable position in Vile-Emperor City.</p><br/><p>His biggest hope and anticipation was that he would eventually be strong enough to take on archaeans. That way, if he was ever forced into a fight, he would be able to hold his own.</p><br/><p>“Screw it. I'm gonna keep trying. If I can’t make it work, then I’ll just leave!” Gritting his teeth, he shot toward the marionette.</p><br/><p>When he slammed into it, it exploded, and yet again he was hit with a backlash. However, he didn't attempt to do anything to avoid it. Doing so was virtually impossible. And apparently, this level tested one’s ability to withstand backlashes.</p><br/><p>Blood oozed out of the corners of his mouth, but his powers of regeneration immediately went to work. Eyes bloodshot, he immediately set upon the next, smaller marionette.</p><br/><p>With every marionette he killed, another would arise, smaller than before. The cycle repeated itself over and over. Eventually, he had unleashed ten fist strikes.</p><br/><p>Each one had destroyed a marionette, and unleashed a backlash attack. The backlashes were getting stronger and stronger, to the point where even his Undying Codex couldn’t keep up.</p><br/><p>“Considering my powers of regeneration, it seems to me that even if I was in the late Celestial Realm, I would still have problems. Don’t tell me I need to be in the great circle to pass!?!?” Bai Xiaochun refused to believe that the seventy-eighth level would actually be that hard. The next marionette that he destroyed caused a backlash that sent blood spraying out of his mouth. And the marionette which appeared this time looked different from before.</p><br/><p>It was only the size of a palm, and was pure gold. It radiated the aura of the mid Celestial Realm, and had speed that completely defied imagination. It vanished, reappeared right in front of Bai Xiaochun’s chest, and then slammed into him. Before he could even react, he was sent flying hundreds of meters backward.</p><br/><p>Blood sprayed out of his mouth, and even as he struggled to his feet, a streak of golden light slammed into him. Then again, and again! He was really starting to get mad now.</p><br/><p>“Complete and utter bullying!!” This was his first time encountering an opponent with the same cultivation base as himself, but that he couldn’t hit because of their incredible speed.</p><br/><p>Even as the golden streak of light closed in again, he took a deep breath, causing all of his skin to turn the color of blood. A blood mist also spread out from him, into which he seemingly merged.</p><br/><p>Within the mist, his eyes gleamed with sinister coldness, and he spoke in a bloodthirsty voice, “Godkiller!” </p><br/><p>The Godkiller technique was finally being used again!</p><br/><p>Rumbling sounds echoed out as the golden light neared the blood-colored mist. In the blink of an eye, blood-colored light and golden light were intersecting in a shocking display of speed.</p><br/><p>Booms rang out constantly, until the blood mist finally surrounded the golden light. A moment later, there was an explosion, and then a massive backlash that surpassed anything from before!</p><br/><p>The blood mist also collapsed, spreading out into the surrounding void. After about ten breaths of time, everything had gone calm again, and the blood mist formed back to reveal an ashen-faced Bai Xiaochun.</p><br/><p>“Whoa,” he said, blood oozing out of his mouth. At that point, he began to fade away as he left the seventy-eighth level.</p><br/><p>Although he had passed it successfully, he had received a significant injury in the process. From that, he could tell that the levels from this point on were going to be extremely difficult!</p><br/>\n</div>"}