{"title": "Chapter 1173: Returning From A Rewarding Journey", "id": 1173, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1173-returning-from-a-rewarding-journey", "volume_title": "Volume 12", "body": "<h1>Chapter 1173: Returning From A Rewarding Journey</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Vengeful souls were used to striking terror into the hearts of living beings. And this world of death that they existed in had been created for that express purpose.</p><br/><p>But now… Bai Xiaochun had come, the first heavenly necromancer to ever visit this place. With his Soul Convergence Pills, he created a storm the likes of which the damaged fan had never seen, a storm which changed everything….</p><br/><p>Rumbling booms filled the entire world. During his time in the Eternal Immortal Domains, Bai Xiaochun had drawn upon many of the medicinal pills he had in reserve, but none of his Soul Convergence Pills. As such, he had a huge amount on hand.</p><br/><p>Back in the Wildlands, he had made a point of building up a large stockpile. That way, if he ever encountered vengeful souls in random locations, he would be well-equipped to get his hands on them.</p><br/><p>However, there were virtually no souls floating around in the Eternal Immortal Domains. As a result, his hands had often itched to return to their previous habits. And now… he was completely overwhelmed by excitement and joy.</p><br/><p>There were just too many souls! This level was definitely a windfall for Bai Xiaochun, providing him with benefits that surpassed any of the rewards from the previous levels. In fact, even if this level didn’t have a specific reward at the end, it would still be better than any of the other levels.</p><br/><p>To him, the vengeful souls he could acquire were the best reward imaginable.</p><br/><p>“Be a good little soul and don’t run! Lord Bai is a nice fellow, he won’t bully you guys!” Eyes shining, he leapt to and fro, tossing out Soul Convergence Pills and then snatching up the soul spheres they formed to toss into his bag of holding.</p><br/><p>“I’m just scooping up the souls!” The only thing that disappointed him was that he couldn’t collect the souls faster, and that he only had two hands. Worried that he might be expelled from the level, he spared no amount of effort to crazily get as many vengeful souls as he could.</p><br/><p>“Stop right there, all of you. Behave! Dammit, get back here!!” Soon, the amount of vengeful souls had been visibly reduced, while those that remained continued to flee in terror.</p><br/><p>Around the time that Bai Xiaochun had collected about twenty or thirty percent of the vengeful souls, the spirit automaton finally woke up. As soon as his eyes opened, he realized that Bai Xiaochun was in the middle of challenging a level. Sending some divine sense out, he saw the shocking scene playing out in the eighty-fourth level.</p><br/><p>The spirit automaton was so stunned that he almost didn’t dare to believe what he was seeing, and couldn’t even react for an extended time.</p><br/><p>“This… this….” Although he wasn’t actually capable of crying, in this moment, that was exactly what he wanted to do.</p><br/><p>“Heaven-damned Bai Xiaochun!!” he howled. “My souls! _My souls! _The exalted sovereign shed blood, sweat and tears to master the Dao Essence of Life and Death, and then created those souls from nothing!!</p><br/><p>“Heavens! Each of those souls contains some of the Dao Essence of Life and Death! They're priceless!!!” Descending into madness, the spirit automaton sent some divine sense out into the level and unhesitatingly used his authority with the damaged fan to try to get Bai Xiaochun out of the level as quickly as possible.</p><br/><p>Within the world of the level, chaos exploded into being as a massive gravitational force descended from above, wrapped around Bai Xiaochun, and began to drag him forcefully out of the level.</p><br/><p>Bai Xiaochun instantly started getting nervous.</p><br/><p>“What are you doing, you little automaton!? You’re cheating! I haven’t finished with the level yet! Why are you letting me pass?!</p><br/><p>“You’re a spirit automaton! Have some respect! How could you possibly surrender right now? Let me go! I want to rely on my own skills to pass this level!” Unfortunately, Bai Xiaochun wasn’t in control of his own body. The gravitational force dragged him up into the sky, and the souls drew further and further away.</p><br/><p>“You good-for-nothing little automaton!” he shouted in rage. He even drew upon his authority within the damaged fan to try to fight back.</p><br/><p>“Shut up. Shut up! SHUT UP!!” the spirit automaton shouted, not sure of what else to say. As of this point, he and Bai Xiaochun had almost equal levels of authority within the fan, and because of that, Bai Xiaochun managed to force an equilibrium. Then, he started tossing out more pills and collecting up the resulting soul spheres.</p><br/><p>The spirit automaton was enraged to the point of madness. Despite having just awoken, he decided to put everything on the line and potentially injure himself to teleport Bai Xiaochun out of the level.</p><br/><p>When Bai Xiaochun finally vanished, the spirit automaton sagged in exhaustion, his divine sense weakened, his mind drained.</p><br/><p>Although he considered swearing an oath to destroy Bai Xiaochun in the next level, considering how many times he had sworn such oaths, only to have Bai Xiaochun confound him at every turn, he decided that perhaps it wasn’t the best thing to do.</p><br/><p>“He’s like my arch-nemesis!!” Filled with grief, and feeling overwhelmed with exhaustion, he immediately went back to sleep.</p><br/><p>Outside of the level on the damaged fan, Bai Xiaochun reappeared, heart pounding, expression that of rage. He tried to go back into the level, but just as with the world of the Dark Concocters, he was unable to do so. No amount of trying met with even a hint of success. Finally, he simply sighed.</p><br/><p>“That spirit automaton is way too stingy. What’s the big deal about a few souls? This fan is eventually going to be mine anyway! If I'm fine with taking some things that belong to me, what is he getting all bent out of shape for?” Snorting, he patted his bag of holding and checked to make sure that all of the souls were in place. At that point, his heart surged.</p><br/><p>“It's been a long time since I had so many souls….” he thought. Hand fairly itching, he began to conjure some flame. Light flashed as one tongue of multi-colored flame after another appeared. The highest he could go at the moment was fifteen-colored flame, but he did manage to get quite a collection of that.</p><br/><p>After all, the difficulty level grew much higher after fifteen colors, and the process also tended to be much more draining. Although he had acquired a significant number of souls, after some quick calculations, he was fairly certain that he didn’t have enough to conjure up to a twenty-two-colored flame.</p><br/><p>“If I get a bit more, maybe I can get to twenty-two colors.” Eyeing the spark-shaped mark on the back of his hand, he took a deep breath and swore that, after he became the true owner of the damaged fan, he would go back and get all of the souls that remained in the eighty-fourth level.</p><br/><p>It took half a month for him to complete his flame-conjuring session. At that point, he had a much more sizeable collection of multi-colored flame in his bag of holding. Feeling quite pleased, he looked around at the fan and decided that he should probably head back to the Eternal Immortal Domains. After a short rest, he did just that.</p><br/><p>Soon, he materialized back in his private chamber in the embassy in Vile-Emperor City.</p><br/><p>“What a rewarding journey!” High-spirited and full of mettle, he summoned his demigod subordinates to get a report of what had occurred while he was in seclusion. After dismissing them, he crossed his legs and began to practice cultivation.</p><br/><p>Seven days passed in the blink of an eye. His cultivation base was back in top shape, and he was just getting ready to go back to the damaged fan when… an imperial edict came down from Vile-Emperor Palace. Before anyone could even react to it, a sonorous voice echoed out to fill the embassy.</p><br/><p>“The Saint-Emperor Dynasty’s Ambassador Bai is hereby summoned to the palace for an audience with the emperor!!”</p><br/><p>All of the cultivators in the embassy were visibly shocked, and looked over to see how Bai Xiaochun would react.</p><br/><p>Bai Xiaochun was a bit hesitant, and wondered if the Vile-Emperor planned to punish him for the incident with Daoist Heavenspan.</p><br/><p>“There’s no way he’s that narrow-minded, right…?” In the end, he decided that it most likely wasn’t because of that. After all, he was the ambassador of the entire Saint-Emperor Dynasty, and wouldn’t be punished unless he committed some massive crime.</p><br/><p>Perhaps things might have been different if he wasn’t a celestial, but he was, and thus felt very confident.</p><br/><p>“Well it’s not like I can refuse anyway. Whatever. Might as well go check things out!” Still feeling slightly uneasy, he took a breath and headed toward the imperial palace on the dragon’s skull.</p><br/>\n</div>"}