{"title": "Chapter 1177: A Severed Arm In The Void", "id": 1177, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1177-a-severed-arm-in-the-void", "volume_title": "Volume 12", "body": "<h1>Chapter 1177: A Severed Arm In The Void</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun didn’t even remember returning to the embassy. He was virtually soulless, almost like the walking dead. All he could think about was how much he hated being weak, and how much he detested being so useless.</p><br/><p>He felt like his heart had been ripped in two. One part was saying that he couldn’t have done anything to change the situation. But the other part was screaming in rage, telling him that he should have done something to rescue the Arch-Emperor from his pain and misery.</p><br/><p>The mental anguish and torment caused tears to well up in Bai Xiaochun’s eyes, until he felt like he might collapse at any moment. He didn’t feel capable of handling the responsibility that had been thrust upon his shoulders. After all, he usually lived by the seat of his pants, pragmatically handling situations as they arose. But somehow, he had become the hope of everyone from the Heavenspan Realm.</p><br/><p>He didn’t dare to think about what would have happened if, instead of the Arch-Emperor, it had been Li Qinghou, Song Junwan, Mistress Red-Dust or Big Fatty Zhang….</p><br/><p>Then what would have happened…?</p><br/><p>“My cultivation base. It’s all about my cultivation base!! If only I were an archaean….” Eyes bloodshot, he clenched his hands into fists, his determination to become stronger rapidly turning into full-on madness!</p><br/><p>He took out the Greatsword of the North and studied it, thinking back to what the northern Heavenspan River region had been like. After a moment, he pulled out his turtle-wok, and using his new stockpile of multi-colored flame, began to enhance it!</p><br/><p>As more and more spirit designs appeared, the aura of the sword began to change. Eventually, it emanated an air of sharpness, and strength that was profoundly shocking.</p><br/><p>“This sword… is not enough to fight an archaean!” He put away the Greatsword of the North, and then vanished from his private chamber.</p><br/><p>When he reappeared, he was back on the damaged fan. As of this moment, his killing intent and madness had reached the point that he needed to vent, lest he collapse mentally.</p><br/><p>And the best way to vent would be to challenge the levels of the fan!!</p><br/><p>He didn’t even bother to calculate whether or not the spirit automaton was asleep. Without any hesitation, he flew directly into the next level!</p><br/><p>Rumbling sounds echoed out within the world around him as he summoned the Greatsword of the North and unleashed it in a powerful attack. Backed by the power of his fleshly body as well as his cultivation base, he used it to vent his madness and anger by destroying the entire level!</p><br/><p>Eighty-fifth level. Eighty-sixth. Eighty-seventh!</p><br/><p>The levels got harder and harder, but he was in a state of complete madness. It didn’t matter what appeared within the levels, he saw nothing but the color of blood as he unleashed shocking slaughter.</p><br/><p>Kill. Kill! <em>KILL!!!</em></p><br/><p>His killing intent seemed to sink into the depths of his cultivation base, merging with it, pushing him to a higher level than he could have imagined. In the past, it couldn’t have happened. But because of the slaughter he was unleashing, he was being tempered, pushing his battle prowess to an even higher level.</p><br/><p>Eighty-eighth level. Eighty-ninth level….</p><br/><p>By the time he reached the ninetieth level, his wounds were far worse than they had been at any time in the past when challenging the damaged fan. His Undying Codex was operating in shocking fashion, and his attacks were the type that had only been seen previously in the Heavenspan Realm, the type in which he sustained damage to inflict fatal blows.</p><br/><p>It was a unique fighting style that Bai Xiaochun had begun to develop starting in the Luochen Mountains. By now, although it couldn’t be said to have reached a state of perfection, it was certainly getting close to that point.</p><br/><p>His blood boiled as he vented, and the madness in his eyes raged. And it all reached a head in the ninetieth level!</p><br/><p>The ninetieth level was a world of heat and fire, its sky filled with leaden clouds and the glow of fire. The entire world rumbled as lava and flames spewed from the tops of seemingly endless volcanoes that stretched out in all directions.</p><br/><p>Within that violent world roamed three enormous stonebeetles, each one fully 30,000 meters from end to end. As they moved about, they smashed into the occasional volcano, sending lava and fire roiling out in all directions.</p><br/><p>Worst of all was that, although the lava and fire didn’t hurt the stonebeetles, it would melt any rock it touched. In the end, the world was like a sea of molten fire, across which rolled waves of a terrifying nature.</p><br/><p>One of the stonebeetles noticed Bai Xiaochun as soon as he appeared within the world. Roaring, it turned into a blur of afterimages as it shot toward him ravenously.</p><br/><p>On any other occasion, Bai Xiaochun would have dodged out of the way. But this time, he simply waved his hand and utilized the Living Mountain Incantation. The air around him rippled and distorted as massive rocks and boulders flew toward him, rapidly transforming him into a stone golem!</p><br/><p>Instead of backing up to brace for impact, he lunged forward, the deafening roar that erupted from his mouth completely surpassing that of the stonebeetle. Then, the entire world shook and trembled as the other two stonebeetles began to charge toward Bai Xiaochun as well!</p><br/><p>A few days later, he emerged from the ninetieth level, soaked in blood, his right arm missing, and his skull visible on the left side of his face!</p><br/><p>However, instead of the lunacy that had burned in his eyes before, they were now calm, although within the depths of that calm simmered violence and rage.</p><br/><p>After passing the ninetieth level, he returned to the main square of the fan. At that point, he coughed up a massive mouthful of blood, and then toppled forward onto his face. A long moment passed, and then he struggled up into a cross-legged position to do breathing exercises.</p><br/><p>As his cultivation base rotated, and the regenerative powers of his fleshly body worked away, three days passed. Eventually, his arm grew back, and his face healed. At that point, he opened his eyes.</p><br/><p>However, his session of cultivation was not yet over. The blood of the stonebeetles he had fought was shockingly corrosive. As such, it was taking much longer for his powers of regeneration to get him completely back to normal.</p><br/><p>At around that time, a massive tremor suddenly shook the entire damaged fan.</p><br/><p>At the same time, an aura which shocked Bai Xiaochun to the core swept into the damaged fan from the void beyond.</p><br/><p>Shocked, he rose to his feet and walked over to the edge of the fan, where he peered out into the darkness. Eventually, his eyes went wide, and his heart trembled with shock.</p><br/><p>“Is that…?” He gasped as he saw, far out in the darkness of the void, a soft glow of light. As it neared, he could see that it was huge, fully 30,000 meters from one end to the other. There, floating through the void, glowing with light… was a huge arm!!</p><br/><p>It did not look like the arm of a cultivator, but rather, wolf-like, complete with claws!!</p><br/><p>As the arm neared, the entire damaged fan trembled. At the same time, Bai Xiaochun realized that he recognized the aura of the arm!</p><br/><p>“Heavens! That’s a sovereign aura!!” Even as he realized this, a shriek could be heard from behind him, its source being none other than the spirit automaton.</p><br/><p>“Which sovereign? Let me look more closely…. I see. That arm likely belonged to Gao Tianshen from the Wolfdevil Realm…. Yeah, it must be him. He was one of the weakest sovereigns back in the day, and there’s no way I would mistake his aura for someone else's!!</p><br/><p>“Gao Tianshen’s left arm…. Bai Xiaochun, lend me your control over the fan. With the power from that arm, I can increase the speed of the fan, and reunite it with its other half even sooner!! And I promise to only interfere with <em>one</em> of the remaining levels!!” The spirit automaton was so excited that he blurted out some bits of information that should have remained secret to Bai Xiaochun.</p><br/><p>Bai Xiaochun’s eyes flickered, but he didn’t say anything. Although this sovereign’s arm was enticing, he didn’t trust the spirit automaton at all. Even as the damaged fan sped toward the arm, it suddenly moved!</p><br/><p>Unexpectedly, numerous vengeful souls began to stream out from it and head toward the damaged fan, shrieking soundlessly, their eyes filled with greed and madness.</p><br/><p>“Souls!” Bai Xiaochun said, his eyes widening!</p><br/>\n</div>"}