{"title": "Chapter 1180: The Spirit Automaton Makes His Move", "id": 1180, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1180-the-spirit-automaton-makes-his-move", "volume_title": "Volume 12", "body": "<h1>Chapter 1180: The Spirit Automaton Makes His Move</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As time passed, Bai Xiaochun slowly slipped into a state of complete frenzy. It was as if the only thing that existed in his life was his desire to pass the levels in the damaged fan, and to conjure a twenty-three-colored flame.</p><br/><p>He rarely went back to Vile-Emperor City. Because of how focused he was on cultivation, and the rewards he got at the ends of the levels, his cultivation base advanced in shocking fashion.</p><br/><p>In terms of the levels, his progress was not rapid. But considering how hard he was working, and his powers of regeneration, he eventually reached the ninety-sixth, ninety-seventh, and ninety-eighth levels….</p><br/><p>A few days after that, he finally passed the ninety-eighth level and reached… the ninety-ninth level!!</p><br/><p>The spirit automaton never showed his face. However, the more progress Bai Xiaochun made, the more on guard he was. He knew that the automaton would most likely make his move in one of the final two levels.</p><br/><p>Bai Xiaochun’s guess was that it would come in the hundredth level. However, as it turned out, it was when he reached the ninety-ninth level that the spirit automaton woke up for the first time after drawing upon the powers of the damaged fan to acquire that sovereign’s arm.</p><br/><p>“The ninety-ninth level!?” he blurted as soon as he opened his eyes. The truth was that he had left a marker behind in the ninety-ninth level that would awaken him if Bai Xiaochun reached it.</p><br/><p>Under normal circumstances, he would have just rested until he was fully recovered from the extremely draining ordeal. However, he hated Bai Xiaochun so much that he had arranged for a way to be woken up if necessary.</p><br/><p>“Alright, Bai Xiaochun. Lord Automaton is going to make one last-ditch effort to stop you. If you succeed… then I guess I’ll have to resign myself to the fate the heavens have decreed.” The spirit automaton took a deep, shaky breath. He was not confident at all in this, his final attempt to interfere. On too many occasions in the past when he had been completely certain he would come out on top, Bai Xiaochun had gone on to show him what was meant by <em>the unexpected</em>, <em>shamelessness</em>, and … <em>cheating!</em></p><br/><p>By this point, the spirit automaton had actually begun to believe that everything had been fated. Sighing, he vanished from his current position to reappear within the ninety-ninth level.</p><br/><p>**</p><br/><p>Some time earlier…</p><br/><p>The ninety-ninth level… was different from any of the other levels. It consisted of a huge palace hovering in the air, of epic proportions. The main hall of the palace was almost half as large as the entire Saint-Emperor Dynasty. And at the end of the hall was a gigantic statue!</p><br/><p>It depicted a middle-aged man in a Daoist robe, looking off into the distance. The aura of the statue vastly surpassed that of the Archaean Realm, and seemed to coexist with the void itself.</p><br/><p>Bai Xiaochun gasped slightly at the sight of it. He felt shaken, with great pressure weighing down on him that caused him to struggle to breathe. Even his cultivation base felt a bit unstable.</p><br/><p>There was an alcove in the statue's forehead within which rested a throne. A cultivator could be seen sitting on the throne, although at this distance, it was difficult to make out his features even with divine sense, which was limited within the level.</p><br/><p>No matter how hard Bai Xiaochun strained with his divine sense or physical eyes, he couldn’t make out any details, although he was fairly certain that the person on the throne was a sovereign…. Most likely, it was the very person who had created the damaged fan to begin with, the same sovereign who reached enlightenment regarding the Dao Essence of Life and Death.</p><br/><p>It seemed likely that only such a person would be able to occupy a throne like that, which looked out over all of the palace around it.</p><br/><p>Even as Bai Xiaochun strained to make out the details of the impressive figure in the forehead of that statue, a cold voice echoed out into the courtyard of the palace within which he stood.</p><br/><p>“You might as well stop looking.” </p><br/><p>As the words echoed out, Bai Xiaochun suddenly spun in place to find a middle-aged man standing roughly 300 meters behind him!</p><br/><p>He wore simple, homespun clothing, and appeared ordinary in nature. However, he seemed at one with the world, and although he had his hands clasped behind his back, he looked like a black hole that could absorb any and all auras that existed around him.</p><br/><p>“That is the statue of the exalted sovereign,” the man continued, “and in its forehead is a projection of the sovereign himself. He’s looking at you!</p><br/><p>“You are the first person to reach this level in all the years since it was created. Perhaps you do not have the blood of the Immortal World in you, but since you were born in the Eternal World, then you qualify to acquire the legacy.</p><br/><p>“But in order to do so… you have to pass the final two levels!</p><br/><p>“I am no powerful expert, only an archaean. And I'm only here in clone form, not in person, which means that this is my final resting place.</p><br/><p>“Any challenger who can survive one of my fist strikes without dying… can pass this level!” The man didn’t bother to ask whether Bai Xiaochun agreed or not. He stepped forward, clenched his hand into a fist, and struck out at Bai Xiaochun, who was still about 300 meters away!</p><br/><p>In response, the entire ninety-ninth level filled with pressure that vastly surpassed that of a celestial. It was an archaean aura, with fluctuations that could destroy any form of life, that could rip apart the air, that could crush anything. And it was heading directly toward Bai Xiaochun!</p><br/><p>“Archaean!” he blurted. Never could he have imagined that the requirement for this level would be to sustain a direct blow from an archaean and survive!</p><br/><p>There was no time for thought or planning. The pressure from this man filled Bai Xiaochun with a sensation of such crisis that he was instantly scared out of his mind. The power of his fleshly body flared to life as he threw his hands out in front of him, throwing in all the cultivation base power he could manage to push his defenses as high as they could go.</p><br/><p>Rocks and boulders materialized around him as his Living Mountain Incantation took form, transforming him into an enormous stone golem. Then he used the Cloud Lightning Forefather Transformation, causing intense rumbling sounds to fill the air. Unfortunately, that was all that he could do before the explosive fist strike was upon him.</p><br/><p>It was the type of blow that could destroy anything in its path as easily as a boulder crushing a drinking glass. When it was still 30 meters away from him, his body began to vibrate, and the Living Mountain Incantation shattered, sending stone shrapnel flying in all directions. His Cloud Lightning Forefather form was also incapable of withstanding the force, and shattered when the fist was still 24 meters away!</p><br/><p>During the process, blood began to ooze out of the corners of his mouth, and he once again threw his hands out, resorting to his Live Forever Lamp!</p><br/><p>Innumerable Live Forever Lamps appeared, and even Bai Xiaochun transformed into one. It was as if the entire world had become filled with Live Forever Lamps!</p><br/><p>And yet, in comparison to the fist strike, all of that was like a mantis trying to stop a war chariot. The fist was only 15 meters away when the Live Forever Lamps collapsed. Bai Xiaochun was already in bad shape. Blood sprayed out of his mouth as he fell back, summoning the Greatsword of the North and slashing it toward the fist!</p><br/><p>Rumbling sounds echoed out as the enormous sword, which to date had never yet been defeated, was shoved backward by the fist, sending a backlash directly into Bai Xiaochun. By now, the fist strike was only three meters away from him.</p><br/><p>A huge glob of blood sprayed out of his mouth, and he lost his grip on the Greatsword of the North. In the time it takes a spark to fly off of a piece of flint, a shocking moment of crisis had appeared…. The Greatsword of the North was still spinning away from him as the fist strike slammed into him, a destructive vortex of shocking nature.</p><br/><p>In that final moment, a streak of black light shot out, which was none other than the turtle-wok. A massive boom rang out, seemingly violent enough to destroy the entire world. At the same time, Bai Xiaochun felt indescribably destructive power hitting the wok. It was the type of power that could destroy all types of cultivation bases, and instantly pushed his powers of regeneration to the ultimate limit. Blood sprayed out of his mouth as he was sent tumbling off into the distance like a kite with its string cut.</p><br/><p>His five yin organs and six yang organs all vibrated on the point of exploding. Even with the protection provided by the turtle-wok, most of the bones in his body shattered. Then, he slammed into the ground, his vision fading as though he were teetering right at the gates of hell! Without his spectacular powers of regeneration, he would have been killed in body and soul. And that had all come from only a single fist strike by this middle-aged man!</p><br/><p>After sustaining the blow, the turtle-wok turned into a black streak of light that shot back into his body. Clearly, he would not be able to summon it again anytime soon.</p><br/><p>Gasping for breath, he struggled to his feet and looked over at the middle-aged man, who looked back at him as he slowly lowered his fist.</p><br/><p>Smiling in approval, the man said, “You pass the lev--” </p><br/><p>However, in that very moment, his eyes went blank, causing Bai Xiaochun’s heart to begin to pound with a sense of profound dread. The man then spoke again, his tone sharper than before.</p><br/><p>“Any challenger who can survive one of my fist strikes without dying… can pass this level!” With that, he began to unleash another fist strike!</p><br/><p>“Spirit automaton, show your face immediately!” Bai Xiaochun shouted bitterly. “You’re dead!!”</p><br/>\n</div>"}