{"title": "Chapter 1190: Get In My Way? Die!", "id": 1190, "volume": 12, "url": "http://boxnovel.org/a-will-eternal-chapter-1190-get-in-my-way-die", "volume_title": "Volume 12", "body": "<h1>Chapter 1190: Get In My Way? Die!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Up in midair, Bai Xiaochun shoved Celestial Virūpākṣa out of the way with the blood mist of his Godkiller technique, then ignored Prince Ur-Demon and the other celestials as he headed directly toward Vile-Prince Mansion.</p><br/><p>He was completely out of patience, and therefore, anyone who got in his way would either be shoved to the side or killed…. </p><br/><p>No one could stop him!</p><br/><p>Reverend Devourer secretly frowned. He was a slick and evasive person, and in any other circumstances would have simply stood down and let things play out how they would. </p><br/><p>Unfortunately, they were right in the middle of Vile-Emperor City. If Bai Xiaochun got to Vile-Prince Mansion and did something drastic, then the Vile-Emperor would likely be furious. Celestial Virūpākṣa might have it a bit easier because of the fact that he hadn’t been working with the Vile-Prince earlier on. But Reverend Devourer <em>had</em> been working closely with the Vile-Prince, for a while now, and therefore, he had no choice but to try to do something. Thinking back to how things had played out in the incident with the sovereign’s clone, he quickly chose what he hoped would be an effective tactic.</p><br/><p>“Prince Ur-Demon! Daoist Heavenspan! We can't let Bai Xiaochun get into Vile-Prince Mansion. The Vile-Emperor will be out of secluded meditation at any moment!” Even as the words left his mouth, he blurred into motion, drawing on significant cultivation base power to teleport right into Bai Xiaochun’s path.</p><br/><p>Prince Ur-Demon and Daoist Heavenspan both had serious expressions on their faces as they utilized trump cards to help. Bai Xiaochun battered against their resistance several times in a row, but could not get past them. By this point, his murderous aura and burning rage had reached epic heights.</p><br/><p>“Are you people looking to die?!?!” The blood mist of the Godkiller technique shrank down, revealing Bai Xiaochun himself. Without any hesitation, he lunged to slam into Daoist Heavenspan.</p><br/><p>Rumbling sounds echoed out as Daoist Heavenspan tried to leap out of the way, but was hit in the shoulder. Instantly, most of his shoulder and arm were shattered, and blood sprayed out of his mouth. Before he could react, Bai Xiaochun unleashed both the Live Forever Lamp and his Waterswamp Kingdom to prevent Reverend Devourer and Prince Ur-Demon from intervening. Then, killing intent flickered in his eyes as he drew on the Mountain Shaking Bash and his Undying Emperor’s Fist.</p><br/><p>Before the attack hit, Daoist Heavenspan’s eyes suddenly turned black, and black smoke poured out from inside of him to form a defensive barrier.</p><br/><p>It was a powerful obstacle; the fist strike that Bai Xiaochun had used to seriously injure Celestial Deadfall did little more than knock Daoist Heavenspan back by a few hundred meters, completely uninjured. Furthermore, the backlash Bai Xiaochun suffered caused him to grunt in pain. At the same time, tendrils of black smoke began to wrap around him like fetters, causing blood to ooze out of his mouth as he staggered backward, his powers of regeneration working at top speed. Meanwhile, Prince Ur-Demon and Reverend Devourer both looked on with glittering eyes.</p><br/><p>“The perfect opportunity!” Reverend Devourer said, performing an incantation gesture that caused a bright blue sea to materialize around him. The sea quickly transformed into a gaping maw that lunged toward Bai Xiaochun.</p><br/><p>As for Prince Ur-Demon, he also took action, causing a glowing red light to surround him. At the same time, a huge demon appeared at his back, crimson, with two horns sticking out of its head. Snarling, it jumped toward Bai Xiaochun.</p><br/><p>In the face of this seeming crisis, Bai Xiaochun simply chuckled. Eyes shining with madness and determination, he slapped his bag of holding to produce a twenty-two-colored flame!</p><br/><p>Prince Ur-Demon’s face fell, and Reverend Devourer gasped loudly. Neither of them knew exactly what Bai Xiaochun was holding, but the terrifying power they could sense from it left them completely and utterly shaken.</p><br/><p>Furthermore, this was not an ordinary twenty-two-colored flame. It had been conjured with the help of a sovereign’s Dao Essence of Life and Death… and contained some of that very Essence!</p><br/><p>“Not good!”</p><br/><p>“That aura… we can’t let it hit us!!” They immediately fell back, and yet, they were too slow!</p><br/><p>Even as they began to move, Bai Xiaochun crushed the multi-colored flame, causing a massive explosion!</p><br/><p>In that instant, a rumbling sound shook all of Vile-Emperor City, and a powerful shockwave spread out in all directions. Even the bone dragon trembled, and numerous buildings on its surface collapsed.</p><br/><p>And that wasn’t even the most terrifying thing that happened. As the twenty-two-colored flame spread out, it devoured anything it touched. Moments before, a host of cultivators from Vile-Prince Mansion had been in the process of surrounding Bai Xiaochun, and were looking on gleefully as his progress was hindered.</p><br/><p>But then, before they could react, they saw a fire the likes of which they had never seen before in their entire lives. And it was also the last thing they saw. Flames covered them, filling them with indescribable pain before reducing them to nothing but ash….</p><br/><p>The nearby buildings had already been emptied. After all, a battle between celestials was something that weaker cultivators would only dare to observe from afar. However, the buildings that remained were also turned into ash by the burning fire!</p><br/><p>Prince Ur-Demon and Reverend Devourer were the closest to the epicenter, and were forced to draw upon the full power of their cultivation bases to protect themselves. Even still, they suffered significant injuries, and ended up coughing up blood, their eyes filled with shock. As they burst out of the expanding flames, Reverend Devourer moved a bit quicker, with Prince Ur-Demon falling a bit behind.</p><br/><p>If they had been given a straight shot to escape, they would have been able to. However, it was in that moment that a stone golem suddenly stepped out of the fire!!</p><br/><p>The stone golem was apparently not hurt at all by the fire, and in fact, didn’t even pay any attention to it. Howling, it reached out and grabbed the despairing Prince Ur-Demon.</p><br/><p>“Noooo!!” he shrieked, struggling. Unfortunately, he had reacted too slowly, and was soon engulfed by the expanding flames, along with the stone golem.</p><br/><p>Although no one could see what happened afterward, they could hear the agonized shrieking coming from within the fire. Daoist Heavenspan gasped and backed up, and Reverend Devourer shivered in fear as he accelerated away in the opposite direction.</p><br/><p>Celestial Virūpākṣa was further off in the distance, but even he pushed forward with greater speed.</p><br/><p>The fire lasted for about ten breaths of time, after which the stone golem appeared, striding forward. Rock and stone began to crumble off of it until Bai Xiaochun was revealed, injured, but already recovering thanks to his Undying Codex. It took only moments for all of his flesh and blood to be back to normal.</p><br/><p>As he walked along, he dragged the unconscious Prince Ur-Demon along with him.</p><br/><p>Instead of killing him, he tossed him into his bag of holding, then looked around for a moment before once again heading toward Vile-Prince Mansion!</p><br/><p>All of the celestials and demigods in the area, as well as the other cultivators in Vile-Emperor City, were completely stunned by what they had just witnessed. Even Celestial Virūpākṣa was shaken.</p><br/><p>Earlier, he hadn’t been willing to put everything on the line, and was now even less willing. After seeing the eruption of multi-colored flame, he felt fear deep in his heart.</p><br/><p>“It’s not worth it to provoke him, not even for the sake of the Vile-Prince! Besides, I was just asked to buy some time. I’d say I've accomplished that task already!”</p><br/><p>No one was blocking Bai Xiaochun’s path, and the Vile-Emperor had not yet emerged from seclusion. Bai Xiaochun had no time to think about why that might be. Ignoring the exhaustion which was beginning to creep up inside of him, he stepped into Vile-Prince Mansion!</p><br/><p>The instant he did, he saw piles of corpses!</p><br/><p>The corpses, whether they were devas or Nascent Soul cultivators, were all killed in the same way: a spear wound to the forehead!</p><br/><p>Bai Xiaochun quickly sent some divine sense out, until he saw what was happening in the grand hall. There… he saw a familiar face, someone wearing a black robe and wielding a long spear!</p><br/><p>He was so soaked in blood that it dripped off of him and formed a pool around him on the ground!</p><br/>\n</div>"}