{"title": "Chapter 1216: Strong Blood", "id": 1216, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1216-strong-blood", "volume_title": "Volume 13", "body": "<h1>Chapter 1216: Strong Blood</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After seeing Master God-Diviner off, Bai Xiaochun’s life went on as it had up to this point. Right now, the most important thing to him was not cultivation, but rather… the unborn children in Song Junwan and Zhou Zimo.</p><br/><p>No one would dare to violate the taboo of using divine sense to try to determine the sex of the babies. Except for Bai Xiaochun. He had no such reservations, and had long since done so.</p><br/><p>Song Junwan was a bit let down at the news. It might not have been a big deal if Bai Xiaochun weren’t the Arch-Emperor. But given his current identity, it meant that a boy would obviously be slightly more important. And unfortunately, Song Junwan was carrying a girl.</p><br/><p>It would have been easier for her to accept that if Zhou Zimo had also been carrying a girl, but as it turned out, she was carrying a boy. Although Song Junwan was a bit disappointed, she didn’t want Bai Xiaochun to get the wrong idea, and thus hid her feelings. </p><br/><p>The truth was that Bai Xiaochun didn’t care whether his children were boys or girls. He would love them either way. Eventually, he could sense Song Junwan’s feelings, and spent extra time consoling her, and made sure she understood that he didn’t care about that sort of thing.</p><br/><p>Another month went by. Both women were now very close to giving birth, and Bai Xiaochun was getting more and more nervous. Based on the auguries he had performed, the various preparations he had made, and the level of his cultivation base, he was completely and utterly confident that nothing was going to go wrong. And yet, considering that he was about to become a father, he was still worried.</p><br/><p>“I wonder what it will feel like to be a dad?” It was a question that would often pop into his head. Another thing he found himself thinking about was the subject of names.</p><br/><p>“What should we name them…?” Although he had come up with a lot of ideas, he hadn’t made a final decision.</p><br/><p>“Bai Dabao? No, not impressive enough!</p><br/><p>“Bai Chaoda? Nope. His mom wouldn’t agree… <span id=\"footnote-ref-c6a4\">[1]</span></p><br/><p>“Bai Lingfei?” </p><br/><p>That final name made him sigh, both because it made him think of Du Lingfei, and also because of the fact that if he gave that name to his daughter, Song Junwan would likely chop him to pieces.</p><br/><p>Even as he was in the middle of contemplating various names, the Saint-Emperor came for a visit!</p><br/><p>He came completely without advance notice, and in a way that no one in the Arch-Emperor Dynasty except for Bai Xiaochun realized that he was there. The fact that he came just on the verge of the children being born caused Bai Xiaochun’s eyes to flicker. As soon as he detected the fluctuations, he flew up into the air.</p><br/><p>As soon as he was out in the open, he locked his gaze onto a certain location off in the distance, where the Saint-Emperor stepped out of thin air. He had been worried about a misunderstanding, and had thus appeared some distance away, instead of directly within Arch-Emperor City.</p><br/><p>“Second Bro!” he said. Laughing heartily, he stepped forward and embraced Bai Xiaochun.</p><br/><p>Bai Xiaochun was a bit surprised that the Saint-Emperor had come so unexpectedly, and was curious about why he had come. One thing that worried him was that his Archaean Luminescence was still not ready to use again.</p><br/><p>On any other occasion, he would likely have feigned civility. But he was in no mood for that, and got right to the point. “What are you doing here, Big Bro?!” </p><br/><p>“Oh, it’s nothing important. I was just a bit bored, and was contemplating the fact that your children are about to be born. And that got me to thinking that the Vile-Emperor might cause some trouble, so I decided to come stand guard for you.” Even as he spoke, he sent his divine sense down into Arch-Emperor City, as if he were looking for something.</p><br/><p>Frowning, Bai Xiaochun waved his hand, expelling the Saint-Emperor’s divine sense from within the city. Narrowing his eyes, he said, “I appreciate your good intentions, Big Bro, but now's not really a good time.” </p><br/><p>Clearly, Bai Xiaochun wasn’t going to back down. At this point, the Saint-Emperor was starting to feel a bit awkward, and knew that it would be easy for a misunderstanding to occur. However, he really felt the need to take a look around Arch-Emperor City. Sighing, he decided not to risk a misunderstanding.</p><br/><p>“I’ll be perfectly honest, Second Bro. I know it’s a bit rude to barge in like this, but… the Saint-Turtle has gone missing….” As he spoke, he kept a close eye on Bai Xiaochun’s facial expression.</p><br/><p>When Bai Xiaochun heard that the Saint-Turtle was missing, he didn’t have much of a reaction at first. But then his eyes went wide as he realized which Saint-Turtle the Saint-Emperor was talking about….</p><br/><p>“My little turtle? He’s missing?” His surprise was no act. He had absolutely no idea where the little turtle was.</p><br/><p>“Yes,” replied the Saint-Emperor. “Half a month ago, he vanished. I wouldn’t be too worried about it, except for the fact that he stole a bunch of lotus seeds before leaving….” The Saint-Emperor was clearly depressed. For years, the Saint-Turtle had seemed fine, and the Saint-Emperor had actually taken a liking to him. He gave him anything he asked for, and yet in the end, he had disappeared.</p><br/><p>His first reaction was that the little turtle must have gone back to Bai Xiaochun. However, moments ago, his divine sense had managed to sweep through most of Arch-Emperor City before Bai Xiaochun intervened, and the Saint-Emperor hadn’t picked up any traces of the little turtle.</p><br/><p>Furthermore, he could tell that Bai Xiaochun’s reaction had been genuine.</p><br/><p>“Um….” Back when he had formed the initial alliance with the Saint-Emperor Dynasty and the Saint-Emperor himself, he had actually talked with the little turtle, and told him that he would come free him when the time was right, but not in a way that would harm the alliance.</p><br/><p>But because of the impending birth of his children, he had completely forgotten about the turtle. He was also taken by surprise by the fact that the turtle had gone missing. Feeling a bit bad for the Saint-Emperor, and also slightly guilty, he was about to offer some more explanations when his expression flickered, and he looked off toward the horizon.</p><br/><p>Surprised, the Saint-Emperor looked in the same direction.</p><br/><p>Before long, rumbling sounds could be heard as… more than a thousand huge battleships appeared off in the distance!!</p><br/><p>Most of them were about 3,000 meters long, and very impressive. In the front was one particular ship that was 30,000 meters long, which was leading the procession in the direction of Arch-Emperor City.</p><br/><p>At first sight, one might assume it was an invasion. But there was no way that a procession of battleships this large could get from the border of the immortal domain to Arch-Emperor City without anyone noticing, at least not unless it was cloaked by an archaean.</p><br/><p>The procession was being escorted by a large number of cultivators, all of them people of Heavenspan. Strange expressions could be seen on their faces as they proceeded along with the battleships as they headed toward the city.</p><br/><p>When the residents of Arch-Emperor City saw what was happening, expressions of shock appeared on their faces as they assumed that they were under attack. Although the ships were too far away for them to make out the details of who was on them, Bai Xiaochun and the Saint-Emperor could see clearly.</p><br/><p>There were men and women, with women clearly making up the majority. Furthermore, many of them emanated fluctuations that indicated they had the blood of the Heavenspan Realm in them!</p><br/><p>Even more astonishing was how many people there were. The smaller battleships all had hundreds of people on them. And the lead battleship… had tens of thousands.</p><br/><p>“Lu Yuntao!” the Saint-Emperor blurted, shocked.</p><br/><p>“Master God-Diviner!” Bai Xiaochun said simultaneously, his eyes going wide at the sight of Master God-Diviner standing there on the 30,000-meter-long battleship… surrounded by tens of thousands of women. Apparently, these women were his concubines….</p><br/><p>And standing right next to him was a noble-looking woman in formal court attire, whose cultivation base was so high that she was clearly in the great circle of the Demigod Realm. In fact, she was actually a quasi-celestial, making her just as strong as the Grand Heavenmaster!</p><br/><p>This woman was the Lu Yuntao that the Saint-Emperor had just referred to.</p><br/><p>Even in the Eternal Immortal Domains, people with cultivation bases that high were not common, and generally had the most powerful battle prowess aside from celestials.</p><br/><p>Soon, Master God-Diviner noticed Bai Xiaochun hovering there in the air, looking stunned. As for Lu Yuntao, she spotted the Saint-Emperor, and her expression flickered. Taking a deep breath, she clasped Master God-Diviner’s hand and flew off of the battleship toward the dazed Bai Xiaochun and Saint-Emperor.</p><br/><p>“Greetings Arch-Emperor, Saint-Emperor!”</p><br/><p>“Greetings Saint-Emperor, Arch-Emperor!”</p><br/><p>The Saint-Emperor looked at Lu Yuntao, and then at Master God-Diviner, and then finally over at the battleships.</p><br/><p>“You two are…?”</p><br/><p>Not daring to hide the truth, Lu Yuntao clasped hands, bowed, and said, “Saint-Emperor, this… is your humble servant’s family. And this… is your humble servant’s Daoist partner.”</p><div id=\"footnote-c6a4\"><br/><p>1. Dabao literally means “big/grand treasure”. Chaoda means “exceedingly/surpassingly grand/big”. Both of them sound exaggerated and ostentatious, although, not entirely impossible as names <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}