{"title": "Chapter 1227: White Lamp", "id": 1227, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1227-white-lamp", "volume_title": "Volume 13", "body": "<h1>Chapter 1227: White Lamp</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Ten years passed in the blink of an eye.</p><br/><p>Soft light surrounded the fan as it shot through the inky darkness. As it passed along, a glowing trail spread out behind it, making it look almost like a shooting star.</p><br/><p>Bai Xiaochun sat cross-legged on the sovereign's arm, within the face of the fan. Occasionally, he would open his eyes and look out into the void, his eyes sparkling.</p><br/><p>It almost seemed like black was the only color out here. However, during the ten years he had spent traversing the void, he had occasionally encountered ruins or rubble, and collected a good number of souls.</p><br/><p>Although he was anxious to accomplish his goal, there was nothing else he could do to make things go faster. Furthermore, the fan was clearly following a specific course. Although he could change its speed, and could temporarily make it move in another direction, it would always return to its previous course eventually.</p><br/><p>Considering he didn’t have any specific destination in mind, he finally gave up adjusting the direction, and allowed it to fly along as it wished. As it did, he sat there cross-legged, meditating, and working on the formula for twenty-five-colored flame.</p><br/><p>Bai Xiaochi fawned over him the entire time, until Bai Xiaochun finally began to consider letting him change his name.</p><br/><p>Bai Xiaochi was excited about that. Furthermore he had gotten used to flattering Bai Xiaochun, to the point where it was almost an instinct now….</p><br/><p>At the moment, he was standing behind Bai Xiaochun, massaging his shoulders and occasionally checking his facial expression.</p><br/><p>“Am I pushing too hard, milord? I researched some new massage techniques recently that I want to try out.”</p><br/><p>Bai Xiaochi was very pleased with the level of ingratiating. When he was in a good mood, he would reward Bai Xiaochi with a smile, which would get the little spirit automaton excited for an entire day.</p><br/><p>At the moment, it was only possible to summon one archaean slave. But now, the archaean slave’s range wasn’t limited to the world of the fan face. He could now leave that world to stand on the surface of the fan. Although he couldn’t leave the fan, it did make him much more capable of defending it. If the Vile-Emperor somehow managed to find them now, it wouldn’t be as much of a big deal.</p><br/><p>As for dealing with any threatening forces they encountered, the fan had plenty of defenses of its own, all of them quite formidable. In fact, during the past ten years, it had struck ruins or rubble on more than one occasion.</p><br/><p>And thus, Bai Xiaochun’s journey through the void continued. Another three years passed…. He was now almost done with his research into twenty-five-colored flame. Considering the number of souls he had collected, he was able to perform two tests, both of which failed.</p><br/><p>One day as he sat there cross-legged in meditation, a tremor passed through him. Usually, he spent his time with his divine sense spread out to detect objects around him in the void. Right now, his eyes opened, and they shone brightly as he hurried to the edge of the fan to look out into the darkness.</p><br/><p>Bai Xiaochi noticed what was happening, and materialized next to him, where he also looked out excitedly into the void.</p><br/><p>There, far off in the distance, was a dot of white light!</p><br/><p>As it got closer, it was obvious that it was a huge lamp!!</p><br/><p>It was fully 3,000 meters in height, and seemed to just be floating along through the void. At a certain point, Bai Xiaochun’s eyes went wide as he realized that the lamp was being followed by… innumerable souls!</p><br/><p>From what he could tell, there must be hundreds upon hundreds of millions of them. All of them were completely expressionless, and seemed to pulse with an aura of death!</p><br/><p>It was truly a shocking sight to behold.</p><br/><p>After all the years spent traveling through the void, this was Bai Xiaochun’s first time seeing anything like this. Excited, he caused the fan to slow down.</p><br/><p>“So many souls!” he exclaimed, licking his lips. In all of his years searching for souls, this was definitely the largest number yet.</p><br/><p>“Have you ever seen anything like this, Bai Xiaochi?” he asked.</p><br/><p>Although Bai Xiaochi still didn’t like his name, he was so shaken by what he was seeing that he immediately shook his head and said, “Although I spent a lot of my time asleep, milord, I did spend many, many years awake. And I never saw anything like this. Those souls… heavens! Where are they all heading?” </p><br/><p>Bai Xiaochun looked on with narrowed eyes; it was a strange situation, and he didn’t want to do anything too rash.</p><br/><p>It was even stranger considering that the souls didn't seem to have noticed the fan. Carefully issuing another order to the fan, he sent it follow the souls, hoping to figure out where they were going.</p><br/><p>He followed them for several years…. On numerous occasions, the fan would attempt to return to its primary trajectory, until Bai Xiaochun finally ran out of patience and started using Soul Convergence Pill to slowly pilfer the souls.</p><br/><p>The Dark Concocters had been making Soul Convergence Pills day and night, so he had plenty at his disposal. Eventually, he managed to get his hands on all of the hundreds upon hundreds of millions of souls….</p><br/><p>With that many souls, it only took a few more tests to succeed with twenty-five-colored flame, whereupon he continued on to research twenty-six-colored flame.</p><br/><p>Although he was tempted to just let the fan go back to its original course, he was still curious about this lamp’s final destination. For all he knew, there might be even more souls there.</p><br/><p>A few months later, that final destination approached. When Bai Xiaochun saw what it was, his mind began to spin. Right there within the void, in front of the lamp, was an enormous well!!</p><br/><p>It was fully 30,000 meters across, and pulsed with an undulating mist that filled the area! As for the lamp, it flew directly into the well!</p><br/><p>Even more shocking was the fact that he could clearly see other lamps approaching from random directions, more than ten of them. And each one entered the well.</p><br/><p>“So many souls!” he exclaimed excitedly. However, it was such a strange scene that he hesitated about whether or not to try to capture the souls.</p><br/><p>“Heavens! What is this place?!” Bai Xiaochi exclaimed, clearly stunned, and having not a clue about what he was looking at.</p><br/><p>Bai Xiaochun waited there, torn about what to do. However, as he watched the lamps simply disappearing into the well, he couldn’t take it any longer.</p><br/><p>“This mysterious well is probably dangerous,” he said through gritted teeth, “but this place is too good to pass up. I’ll just wait here for a lamp to come along. Only one! As long as I don’t get close to the well, I should be fine!” He couldn’t let this opportunity slip by, especially considering how many souls he needed to continue his work with twenty-six-colored flame. Eyes flickering with madness, he sat down to wait.</p><br/><p>Half a month later, he saw another lamp lazily floating toward the well. Eyes glittering, he sent the fan over to it and then flew out and began to toss out masses of Soul Convergence Pill. Booms could be heard as the souls were quickly taken away by Bai Xiaochun.</p><br/><p>“I'm rich!” he exclaimed. Hurrying back onto the fan, he sat down nervously to see if anything would happen. A few days later, his courage began to build.</p><br/><p>“Hahaha! Nothing happened after all! This place is a blessed land for Bai Xiaochun!” Eyes shining, he decided to wait for another lamp to show up.</p><br/><p>A few days later, it came….</p><br/><p>And thus, Bai Xiaochun madly began to collect souls, completely clearing out any of the lamps which approached.</p><br/><p>However, Bai Xiaochi already had a very bad feeling about what was going on, and frequently warned Bai Xiaochun about what he was doing.</p><br/><p>“You should quit while you’re ahead, milord. I have a bad feeling about this….”</p><br/>\n</div>"}