{"title": "Chapter 1223: Frustrated Bai Xiaochun", "id": 1223, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1223-frustrated-bai-xiaochun", "volume_title": "Volume 13", "body": "<h1>Chapter 1223: Frustrated Bai Xiaochun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From now on, the Arch-Emperor Dynasty would have three celestials!</p><br/><p>Although that still wasn’t as much as the other two imperial dynasties, they were now catching up. When small-scale friction arose, it wouldn’t always fall to Gongsun Wan’er to handle matters. The Grand Heavenmaster and Giant Ghost King would now be able to join the fighting.</p><br/><p>Furthermore, upon discovering how useful Bai Xiaochun’s Future Will was, the Grand Heavenmaster created a whole set of plans that would culminate in the War Champion King and other demigod experts getting a chance to become celestials.</p><br/><p>The Saint-Emperor Dynasty and the Vile-Emperor Dynasty took the matter very seriously. Obviously, when it came to a fighting force of celestials, it wouldn’t be long before the Arch-Emperor Dynasty was in a very good position.</p><br/><p>Despite that knowledge, there was little the other two dynasties could do about the situation. In his fear, the Saint-Emperor chose to try to maintain the best relations possible with Bai Xiaochun, whereas the Vile-Emperor went into secluded meditation.</p><br/><p>Despite the increased threat the Arch-Emperor Dynasty posed within the Eternal Immortal Domains, there were no negative repercussions. They only continued to grow in terms of power and glory.</p><br/><p>It was a huge boost to the demigods who were currently working toward a breakthrough. All of them went crazy in their cultivation, aided by the Grand Heavenmaster and Bai Xiaochun, and the medicinal pills they provided. Their progress was rapid, to say the least.</p><br/><p>As the Arch-Emperor Dynasty continued to grow and develop, five years passed. By this point, Bai Dabao and Bai Xiaoxiao were both seven years old. They were beautiful children, with charming dimples that appeared whenever they smiled or laughed.</p><br/><p>Bai Xiaoxiao’s eyes were particularly bright, and from the look of things, she was going to be exceedingly attractive when she grew up. As for Bai Dabao, he was pure and fair, and had a stubborn air to him. Everyone in Arch-Emperor City loved the children, and treated them like they were chosen from the heavens.</p><br/><p>The imperial palace was their playground, and they were constantly being chased around by special guards and female cultivators, who were always telling them to slow down and stop running….</p><br/><p>The children had been born with shocking natural talents, to the point where even the Grand Heavenmaster was shocked. By the time they were seven, they already had Core Formation cultivation bases. And Bai Xiaoxiao, who was the older sister, was in late Core Formation!</p><br/><p>When it came to fleshly body power, Bai Xiaoxiao’s was rather ordinary, but Bai Dabao had already reached the Nascent Soul level!</p><br/><p>In terms of personality, neither of them were very much like Bai Xiaochun. Bai Xiaoxiao had a fiery temper, whereas Bai Dabao was impulsive, and didn’t seem the least bit afraid of dying. In fact, he was curious about everything, and loved challenging people to fights.</p><br/><p>Bai Xiaochun noticed these things early on, and tried to correct their errant behavior. Unfortunately, no amount of persuasion on his part did any good….</p><br/><p>Neither child was the least bit afraid of him. Conversely, they were terrified of Song Junwan and Zhou Zimo. And Bai Dabao, who wasn’t afraid of anything else in the world, was most definitely afraid of his older sister.</p><br/><p>**</p><br/><p>In an out-of-the-way location within the imperial palace, Bai Xiaoxiao was currently staring furiously at Bai Dabao.</p><br/><p>“This is all your fault Dabao!”</p><br/><p>Bai Dabao stood there, his head hanging, not daring to respond. From the time he had been small all the way until now, when he was seven years old, he had always suffered at the hands of his sister. He always got the short end of the stick. When the two of them caused trouble, it always ended up being his fault, and when they did something praiseworthy, his sister took the credit….</p><br/><p>From their parents’ perspective, she was charming and obedient, but to him, she was a complete and utter tyrant….</p><br/><p>All it took was for her to start crying, and their parents would rush over to comfort her. Meanwhile, he would be forced to stand there, stunned but stubborn, as his parents scolded him.</p><br/><p>On the one hand, Bai Dabao admired his sister, but on the other hand, he feared her. At the same time, he loved her. Whenever she found something new and delicious to eat, or something fun to do, she would always think of him first. Thanks to her temptations, he thought of her as the best sister in the whole world….</p><br/><p>“Do you know how long it took me to come up with this plan?” Bai Xiaoxiao said angrily. “Do you know how much preparation it took? And you actually showed up late by an entire incense stick’s worth of time?! If this doesn’t work out, Dabao, then I'm definitely going to beat you up!”</p><br/><p>“I got held up by my mom!” Bai Dabao said, nearly under his breath. “I… I’ll definitely try extra hard this time, alright?”</p><br/><p>Bai Xiaoxiao nodded firmly in response. Waving her hand, she produced an immortal fruit that pulsed with so much spiritual energy it was obviously extraordinary. Bai Dabao’s eyes instantly went wide. He knew that the immortal food provided by his father was always particularly beneficial for the fleshly body. And unfortunately, he didn’t get many opportunities to eat food like this.</p><br/><p>When Bai Xiaoxiao saw the look of anticipation on her brother’s face, she smiled. “Here, you take it. I don’t practice fleshly body cultivation, so this will help you a lot more than me.”</p><br/><p>Bopping her brother on the head, she handed the fruit to him.</p><br/><p>Bai Dabao eagerly grabbed it and wolfed it down in a single bite. Then he thumped himself on the chest.</p><br/><p>“Don’t worry, sis. I’ll definitely catch you a really awesome pet this time!”</p><br/><p>Eyebrows shooting up in delight, Xiaoxiao proceeded to drag Dabao through the palace to one particular remote location. There, she produced a little flag from her bag of holding, which she waved through the air, creating a small cloud that the two of them hopped on. Then, the cloud proceeded to fly them out of the palace!</p><br/><p>Of course, the imperial palace was strictly locked down by a powerful spell formation. However, spell formations were vulnerable to people who were familiar with their operation. And Bai Xiaoxiao was something of a genius when it came to spell formations. After much study, she had identified a weakness, and created this little flag to be able to get through it.</p><br/><p>Apparently, this was not the first time the two of them had done this. Almost as soon as they vanished, someone stepped out of thin air in the spot they had left from. It was Lu Yuntao, Master God-Diviner’s Daoist partner, who had been secretly keeping an eye on the children. Shaking her head, she vanished.</p><br/><p>Lu Yuntao had since officially become a citizen of the Arch-Emperor Dynasty, and as one of the few female demigods, had been assigned to oversee the palace maids.</p><br/><p>As Dabao and Xiaoxiao grew older and more mischievous, and went to greater lengths to get out of the palace, Lu Yuntao had also gone to greater lengths to keep them safe. No matter how many times Song Junwan and Zhou Zimo lectured the children, Xiaoxiao and Dabao never listened, and always managed to find new ways to cause mischief.</p><br/><p>To Xiaoxiao and Dabao, the rolling plains and endless jungles outside of Arch-Emperor City were the perfect playground. And the numerous vicious beasts that lurked there were the perfect prey.</p><br/><p>Around evening, Xiaoxiao cheered and Dabao huffed for breath as they dragged a massive anaconda back toward the imperial palace.</p><br/><p>It had once been the picture of ferocity, but was now covered with wounds. And whenever it struggled, Dabao would punch or kick it viciously, until it eventually just cowered in fear.</p><br/><p>“If you dare to act up, I’ll beat you to death!” Dabao shouted. “Behave yourself and be a good pet for my sister. Don’t worry, she’ll take good care of you!” After arriving at the palace, they used Xiaoxiao’s flag to get both themselves and the snake back inside.</p><br/><p>The two of them were convinced that no one was the wiser, but the truth was that Bai Xiaochun had been watching the entire time via divine sense. The fact that, at such a young age, they had actually gone out to capture such a terrifying creature caused a frown to appear on his face. He couldn’t help but worry about what disasters might result if they kept doing such things.</p><br/><p>“I know that they’re a bit reckless, but I can’t believe they actually went out and caught a snake like that! I wouldn’t have even thought of doing something so dangerous when I was seven!” Snorting coldly, he decided to go teach his children a big lesson. Vanishing from his private chamber, he stepped out of thin air right in front of Xiaoxiao and Dabao.</p><br/><p>If Song Junwan or Zhou Zimo had appeared, Dabao would have immediately begun to shiver in fear. But considering that it was only his father, he wasn’t the least bit afraid at all. He even glared a bit at Bai Xiaochun.</p><br/><p>Off to the side, Xiaoxiao smiled at him charmingly. </p><br/><p>“Daddy!” she said, rushing forward to hug him.</p><br/><p>Her voice dispelled about seventy percent of Bai Xiaochun’s anger, but he still tried to look angry. Flicking his sleeve, he launched into a quick speech, “Xiaoxiao, Dabao, you can’t do things like this. You listen to your father. You have to be cautious in everything! You can’t be reckless. You only have one life, and you shouldn’t ever risk it. Look at me! That’s how I’ve lived my life! And that’s the only reason I'm still around today, still working on living forever. If I had been as impulsive as you two, I would have lost my poor little life long ago!”</p><br/><p>In response, Xiaoxiao pouted, and Dabao stomped his foot angrily.</p><br/><p>“I totally disagree, dad!” Dabao said. “If anyone gets in my way, I just beat ‘em up! What’s the point in making things so complicated!?”</p><br/>\n</div>"}