{"title": "Chapter 1229: Old Paper Woman", "id": 1229, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1229-old-paper-woman", "volume_title": "Volume 13", "body": "<h1>Chapter 1229: Old Paper Woman</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun had never been in a situation like this before, and it was terrifying. Furthermore, it was the first time out in the void that he had ever felt that he was truly in danger!</p><br/><p>The paper people alone weren’t very worrisome. They were tough to deal with, but he was confident that he could crush them in the end. Even though divine abilities didn’t work on them, his Soul Convergence Pills gave him enough of an edge to defeat them.</p><br/><p>But the bizarre nature of the world itself felt like a sharp blade hanging over his head. If things kept going the way they were, it seemed like he might end up as a paper person himself.</p><br/><p>Even worse than all that were the faces of the old women in the sky, and the mysterious entity who had pushed him into this world to begin with. All of it made his scalp tingle with fear.</p><br/><p>Right now, there was only one thing he wanted: to get out of his place as quickly as possible!</p><br/><p>Therefore, he reached out to the fan and summoned ten shots of Archaean Luminescence, all at one time. Out in the void, the fan shone with dazzling light as ten beams of light shot into the rapidly fading well.</p><br/><p>Rumbling sounds filled the world as the Archaean Luminescence descended, which was equivalent to an archaean expert attacking ten times in a row. In fact, it was such a powerful force that it ripped open a hole in the sky!</p><br/><p>In response, all of the paper people, as well as the souls, let out piercing howls. And yet, almost as soon as it opened up, the hole began to close! Clearly, the damage would be repaired in a very short time!</p><br/><p>Not willing to let the opportunity slip away, Bai Xiaochun drew upon the full power of his cultivation base to speed toward the opening, using Soul Convergence Pills to carve a path through the paper people and the souls that got in his way.</p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Thanks to his incredible speed, he was soon right in front of the hole. As the aura of the outside void entered the paper world through the hole, he was once again able to utilize his divine abilities, and resorted to the Undying Hex and his Mountain Shaking Bash to get another burst of speed. He looked exactly like a shooting star as he shot out of the hole in the final moment before it closed!!</span>By that point, thirty percent of his body had already turned into paper. Thankfully, after reaching the void, his Undying Codex began to repair the damage.</p><br/><p>Before he could breathe a sigh of relief, he heard a coughing sound behind him, followed by muffled howls!</p><br/><p>Bai Xiaochun’s hair immediately stood on end as he realized that the cough must have come from the same person who had shoved him into the well. He immediately began to flee, and even as he did, a huge hand reached out toward him, so withered that it looked like it must belong to a corpse!</p><br/><p>Bai Xiaochun’s heart began to pound wildly; although the hand didn’t give him the sensation that it belonged to a sovereign, it seemed like the peak of the Archaean Realm.</p><br/><p>“What is this thing?!” he thought, on the verge of wailing. Without any hesitation, he drew upon his five remaining shots of Archaean Luminescence and sent them all toward the huge hand.</p><br/><p>Booms rang out as the Archaean Luminescence slammed into the hand, causing it to lurch to a halt. Then, Bai Xiaochun took advantage of the shockwaves from the impact to put more distance between himself and the hand. At the same time, Bai Xiaochi sent the fan shooting toward Bai Xiaochun. Within moments, Bai Xiaochun was back on the fan.</p><br/><p>As his foot touched down, the huge hand recovered, and began to move in the direction of the fan in even more menacing fashion than before.</p><br/><p>Shrieking, Bai Xiaochi scrambled to try to hide inside of the fan itself. Meanwhile, Bai Xiaochun, his face ashen from fear, let out a shout as he took control of the fan and sent it hurtling, not away from the hand, but toward it!</p><br/><p>A massive boom could be heard as the two collided. The huge hand was immediately shoved backward, and the fan was sent spinning off in the opposite direction.</p><br/><p>If that had been all there was to it, Bai Xiaochun might have just commanded the fan to flee. But that was when a second withered hand suddenly materialized and shot toward the fan.</p><br/><p>“Time to put everything on the line!” he shouted. There was no time for fear or hesitation. He knew that if he didn’t go absolutely all out, then the danger would only grow more critical.</p><br/><p>Dazzling light cascaded off of the fan as the arm of the sovereign once again shot out from the fan face. Bai Xiaochun and Bai Xiaochi were yet again cooperating to defend the fan! Even the archaean slave appeared, using the power of the sovereign’s arm to emerge from the fan and shoot toward the menacing enemy!</p><br/><p>The surrounding void trembled as the sovereign’s arm flew out. Meanwhile, the withered hand suddenly stopped moving, seemingly shocked to see something of this level. Unfortunately for the hand, there was no time for it to retreat before the sovereign’s arm hit it.</p><br/><p>A boom could be heard as, for the first time, the withered hand was damaged and began to crumble. However, the sovereign’s arm was also hurt, and the archaean slave was coughing up blood. Both of them spun and returned to the fan face.</p><br/><p>All of this takes a bit of time to describe, but happened in the shortest of moments. Trembling, Bai Xiaochun immediately commanded the fan to flee.</p><br/><p>“Dammit!” Bai Xiaochi shrieked. “This is all your fault! I told you we should have left, but you got greedy!” Unfortunately, the moment of danger had not yet passed. Even as Bai Xiaochi and Bai Xiaochun fled on the fan, a roar of rage echoed out from the well!</p><br/><p>Next, to the complete disbelief of Bai Xiaochun, the well began to grow in size, twisting and distorting as it became… a huge lamp!</p><br/><p>The well was actually just the top portion of the lamp! As the lamp appeared in full, fluctuations rolled out into the void as something vastly larger than the lamp appeared. It was an enormous… old woman, made completely from paper!</p><br/><p>She wore burial clothes, also made from paper, and had a ferocious glint in her eyes.</p><br/><p>“You can’t escape!” she howled in a voice that sounded like countless people speaking at once. Then, she began to walk through the void toward the fan, and Bai Xiaochun.</p><br/><p>Bai Xiaochun was so scared that his eyes bulged, and he felt like weeping.</p><br/><p>“Heavens!” he blurted. “I was just collecting some souls. How did I end up provoking a freak like this!?!?” </p><br/><p>Bai Xiaochi was shrieking just as loudly, urging Bai Xiaochun to flee as quickly as possible.</p><br/><p>“She’s not a sovereign, but she might as well be!” Bai Xiaochun’s heart was pounding, and he was seriously considering retreating to the Eternal Immortal Domains.</p><br/><p>He had actually attempted to do so back in the world of the paper people, but had failed. Now that he was on the fan itself, he was fairly certain that it would work. However, he couldn’t simply leave Song Que and Bai Xiaochi in such danger. Furthermore, it would also cut off the path he had been treading, which he wasn't willing to do.</p><br/><p>Gritting his teeth, he decided that he wouldn’t give up unless there was absolutely no other alternative. Thankfully, the treasured fan was capable of incredible speed, and although the old woman was putting up a good chase, she couldn’t actually catch up.</p><br/><p>Meanwhile, Bai Xiaochun was completely focused on maintaining top speed, aware that if he slipped up, she would catch up to them and slaughter them.</p><br/><p>Scowling on the verge of tears, he kept the fan moving forward. Half a month passed by in a flash, during which time the old woman chased them relentlessly.</p><br/><p>The chase continued. For three years!</p><br/><p>During that time, Bai Xiaochi complained and grumbled constantly.</p><br/><p>Eventually, Bai Xiaochun mostly got used to the situation. Although he wasn’t particularly terrified, he was starting to get very exhausted, to the point where his hair was disheveled, and he had dark circles under his deeply bloodshot eyes.</p><br/><p>After three years, the old woman seemed to be slowing down in her pursuit. Enlivened, Bai Xiaochun gobbled down some medicinal pills and then accelerated. A few months later, he couldn't even see the old woman behind them.</p><br/><p>“So stingy! I just took a few souls, and she chased me for three years because of it?!” The mere thought of those three bitter years filled him with depression.</p><br/>\n</div>"}