{"title": "Chapter 1233: Sovereign Of Antiquity", "id": 1233, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1233-sovereign-of-antiquity", "volume_title": "Volume 13", "body": "<h1>Chapter 1233: Sovereign Of Antiquity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It started out faint, and was difficult to hear clearly, as though it had drifted to this point through countless years of time. It sounded like a man speaking, except that it was impossible to hear the exact words, no matter how Bai Xiaochun focused.</p><br/><p>And yet, that mere voice caused his Time Immemorial Codex to leap with unprecedented vigor. Even the flow of time around him seemed to change.</p><br/><p>Most noteworthy, and most shocking, was that Bai Xiaochun could sense gravity changing because of the voice.</p><br/><p>Although he couldn’t make the voice out clearly, he was convinced… that it contained the answer he had been seeking!</p><br/><p>As his eyes opened, they shone with determination and decisiveness. Blurring into motion, he headed toward a 600-meter-tall hourglass!</p><br/><p>The flow of time here was twenty-thousand times normal speed!!</p><br/><p>It was even easier to see the gravitational fluctuations here, and at the same time, the voice grew clearer, although he still couldn’t make out the exact details. Before long, he moved on to a 900-meter-tall hourglass. Then a 1,200-meter-tall one, and after that, a 1,500-meter-tall one….</p><br/><p>Eventually, he was at a 2,400-meter-tall hourglass, at which point the voice grew even clearer. Bai Xiaochun was fully in a state of madness, and was soon at a 3,000-meter-tall hourglass, where the flow of time… was 100,000 times faster than normal!</p><br/><p>All the while, the voice grew clearer, and yet, he still could not make out the details of what was being said. However, by the time he encountered the one-hundred-thousandfold flow of time, he realized that the gravity in the area wasn’t rigidly set. In fact, it seemed to respond to his presence, a discovery that prompted him to continue on this exact same line of pursuit!</p><br/><p>6,000-meter-tall hourglass. 9,000 meters. 12,000 meters….</p><br/><p>Bai Xiaochun seemed possessed as he crazily selected larger and larger hourglasses. Eventually, he reached a 30,000-meter-tall hourglass, where the flow of time was 1,000,000 times normal. And yet, he was still not able to make out what the voice was saying.</p><br/><p>Although it continued to grow clearer, there was apparently a barrier in place, ensuring that no matter how loudly the speaker spoke, his words could not be heard clearly.</p><br/><p>Not unless… the barrier were broken! Or perhaps when an hourglass was reached that had the potential to break it!</p><br/><p>With that vague voice in his ears, Bai Xiaochun continued to shocking levels of research. 90,000 meters. 180,000 meters. Eventually, he was in front of an hourglass that was 240,000 meters tall!</p><br/><p>In this hourglass, the flow of time reached the shocking level of 8,000,000 times faster than normal. As such, the three months that he spent seeking enlightenment there counted for less than a breath of time.</p><br/><p>Unfortunately, it was already impossible for him to determine if time was truly flowing in accord with his local perspective, or from the outside perspective. As such, the danger he faced continued to mount.</p><br/><p>If he picked an hourglass where the time differential was reversed, then one breath of time for him would count for three months in the outside world!</p><br/><p>Bai Xiaochun was very nearly going insane in his attempt to understand the powers of gravity. As such, once he began to seek enlightenment with the hourglasses taller than 30,000 meters, he was careful to only spend a short time seeking enlightenment with each one. And if the voice didn't grow clearer, he would leave immediately.</p><br/><p>It was dangerous, but he was making incredible progress. The voice was still unclear, but his understanding of gravity was now completely different from before!</p><br/><p>“Gravity is created when the space in the area bends. And the space bends, not because of pre-set conditions, but rather… because of my presence!!</p><br/><p>“As I near the hourglasses, their time differential changes. If I don’t get close to them, the differential remains stationary!!</p><br/><p>“By bending space, and by shaping gravity, the speed of time is changed!!</p><br/><p>“Of course, the ultimate cause is not me, but the fundamental nature of the hourglasses. They have different structures, and contain different dimensions, and even unique starry skies. Thus, the gravity and flow of time within them is different!” His thoughts flickered at lightning speed as he came up with various answers due to his relentless searching. At the moment, he was standing on top of a 240,000-meter-tall hourglass, looking at the world around him. From this vantage point, he could see that there was only one hourglass larger than the one he stood on.</p><br/><p>Far off in the distance, in the very middle of the world, was… an hourglass that was hundreds of thousands of meters tall!!</p><br/><p>Bai Xiaochun had no way to even tell how quickly time flowed in that hourglass. However, he did know that there was no better place in this world to attempt to hear the words of the voice!</p><br/><p>Instead of switching amongst random hourglasses, the best decision, albeit the most dangerous, was with that hourglass.</p><br/><p>After some thought, he shot into motion, eyes bloodshot as he headed toward that gargantuan hourglass. Upon arriving, he was completely and utterly shaken by the flow of time there.</p><br/><p>It was so indescribably powerful that without his powerful cultivation base and shocking fleshly body, plus the powers of regeneration from his Undying Codex, he would likely have been crushed to death immediately.</p><br/><p>Enduring the discomfort, he howled and shot to the top of the hourglass. Taking a shaky breath, he dropped down cross-legged, veins bulging out on his face and neck as he closed his eyes and sent out his divine sense to seek enlightenment!</p><br/><p>Almost immediately, the whispering voice appeared, and this time, it was different from before. It was not muffled, but crisp and clear, as though someone were sitting right next to him, speaking!</p><br/><p>He immediately focused on the voice, whereupon a tremor ran through him, and his mind felt battered as if by enormous waves of shock!!</p><br/><p>The speaker was indeed a man, his voice warm and sincere, as though he were instructing his apprentices about the Dao.</p><br/><p>“Mortal Renegade. Worldly Daoist. The two of you listen well…. What is Essence? To discuss Essences, you must first understand natural laws. Natural laws form the invisible framework of the cosmos in which we exist. Magical techniques and divine abilities are essentially ways of manipulating or drawing upon that framework.</p><br/><p>“As for what constitutes that framework, well, that is where Essences come into the picture. They are shapeless, invisible, and intangible. However, it is only their mysterious construction that allows for all of the countless magical techniques and divine abilities to exist….</p><br/><p>“Essences are essentially the foundation of everything!</p><br/><p>“This leads to another question. What is the Essence of time…?</p><br/><p>“Well, that’s simple. First of all, understand that time and gravity are connected. From an outside perspective, the stronger the gravity, the slower time will flow. However, when it comes to the Essence of time, its true manifestation comes, not through gravity, but rather… relativity!</p><br/><p>“Relativity forms the true core of the Essence of time. If you understand relativity, then you can gain enlightenment of… the Essence of time!</p><br/><p>“Remember, everything… comes down to relativity!</p><br/><p>“Mortal Renegade. Worldly Daoist. Do you understand?”</p><br/><p>The voice crashed within Bai Xiaochun’s mind like great waves of shock. He wasn’t sure who the Mortal Renegade and the Worldly Daoist were. However, merely listening to the short speech filled him with unprecedented levels of understanding!</p><br/><p>It was as if a light went off in his head, as if all of the clues he had gathered up to this point suddenly clicked together thanks to this voice!</p><br/><p>“Relativity. That’s right! It’s about relativity…. Without the outside world to compare to, how could you even know about differences in the flow of time!?!?” Bai Xiaochun threw his head back and laughed uproariously. Although there were still some areas that he wasn't clear on, he was now absolutely certain of why he was able to hear the voice which had just spoken to him!</p><br/><p>That voice belonged to an almighty entity from countless years in the past, who had been speaking to his apprentices about Essences. The reason his voice was able to transmit through all the years was because his Dao was none other than the Essence of time. And he had already become a part of the natural laws of the cosmos around him!</p><br/><p>Therefore, the increased flow of time in this place allowed his voice to echo here for all eternity!</p><br/>\n</div>"}