{"title": "Chapter 1238: Absorbing Memories", "id": 1238, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1238-absorbing-memories", "volume_title": "Volume 13", "body": "<h1>Chapter 1238: Absorbing Memories</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun looked at the sovereign’s head, and as Bai Xiaochi’s voice rang in his ears, he realized that just as the spirit automaton had said, that strange power was indeed the last bit of qi flow from the Immortal World!</p><br/><p>That qi flow had pulled the fan to it, which made sense considering that the qi flow had created the fan in this very location!</p><br/><p>As for his own Daoseed, it thirsted for that power for the same reason Bai Xiaochi had mentioned. If he could absorb the last of the Immortal World’s qi flow, then he could easily break through into the Archaean Realm!</p><br/><p>This was an opportunity that any celestial would go crazy over, good fortune that was rarely encountered. Other than the Eternal Immortal Domains, there were no other worlds in this void who had managed to preserve some of their qi flow through the catastrophe.</p><br/><p>Any other person besides Bai Xiaochun would have had to expend great effort to think of a way to extract that qi flow and absorb it. After all, it would require the approval of the qi flow itself.</p><br/><p>But Bai Xiaochun didn’t need to worry about that. After becoming the owner of the fan, he had gained the approval of the sovereign’s clone projection. In essence, he had already sown karma with the Immortal World.</p><br/><p>Although it seemed like a tenuous connection, it was enough to acquire the approval of the qi flow!</p><br/><p>But now, he faced one main challenge… how to actually extract the qi flow!</p><br/><p>After a bit of analysis, his anticipation was building, and his eyes shone brightly. After all, he had been stuck in the great circle of the Celestial Realm for quite a while now, unable to break through. Therefore, this opportunity, this good fortune, was enough to cause his heart to swell with fervor.</p><br/><p>But as usual, he didn’t act rashly. He first analyzed his surroundings, circling the area on the fan for a while, and even sending his archaean slaves out to explore a bit.</p><br/><p>Only after that did he emerge from the fan and approach the sovereign’s head. As he neared, the pressure mounted, but soon enough, he was only 30 meters away from it.</p><br/><p>At this distance, it wasn’t even possible to see the top of the gigantic head. All he could see was grayish skin, with wrinkles as wide as his arm was long.</p><br/><p>Enduring the uncomfortable pressure, and under the anxious gaze of Bai Xiaochi, he performed an incantation gesture with his right hand and then pushed out toward the sovereign’s head, unleashing the power of his cultivation base in an attempt to extract the qi flow.</p><br/><p>Unfortunately, no amount of cultivation base power provoked any reaction from the qi flow. It was almost as if it didn’t even know Bai Xiaochun existed.</p><br/><p>He tried various divine abilities and magical techniques. He tried biting his tongue and using his own blood. But the qi flow didn’t react in the least. Bai Xiaochun was really starting to get nervous.</p><br/><p>After hesitating for a moment, he took another step forward, using Gravitational Extermination in an attempt to nullify the pressure weighing down from the sovereign’s head, and even unleashing some of the aura of his Undying Sovereign’s Fist. He also transmitted a message to Bai Xiaochi asking for help, who then used the power of the fan to strengthen him.</p><br/><p>And thus, he continued forward step by step. From the 30-meter mark, he reached 24 meters, then 15 meters, then 9 meters. Eventually, he was only one pace away, close enough to reach out and touch the head. By that point, he was trembling, and his face was magenta from the effort.</p><br/><p>Reaching out, he placed his hand onto the skin that was the surface of the sovereign’s head. In that instant, his head began to spin, and he was overwhelmed with what felt like a mountain crushing down on him.</p><br/><p>If he had acquired the qi flow at the price of being crushed a bit, he could have accepted it. But even after touching the head, there was no reaction from the qi flow.</p><br/><p>Coughing up a mouthful of blood, he staggered backward until he was back on the fan. Gasping for breath, he looked over at the sovereign’s head, completely flummoxed by the situation with the qi flow.</p><br/><p>“How do I extract it…?” he thought. Off to the side, Bai Xiaochi looked equally stunned and confused, and had no advice to give.</p><br/><p>Half a month passed, during which time Bai Xiaochun tried everything he could think of. Each time, he met with failure, coughed up blood, and waited to recover before trying again.</p><br/><p>Eventually, he was beginning to lose hope. Sitting there on the fan, he stared at the sovereign’s head, considering if it might be possible to drag it into the face of the fan.</p><br/><p>It did not seem possible to extract the qi flow through ordinary means. As far as destroying the head… not only was he unable, even if he had been, he wouldn’t stoop to that level. He had a bottom line in life, and repaying kindness with enmity was not something he would do. After all, in some ways, the Immortal Imperator was his Master!</p><br/><p>And Bai Xiaochi would obviously not tolerate such profane behavior.</p><br/><p>Bai Xiaochun sat there with a frown on his face for five days, thinking. Eventually, his brow furrowed even more deeply as a new idea occurred to him.</p><br/><p>“There seem to be two possibilities as to why I can’t extract the qi flow…. Either my methods are wrong, or I don’t qualify. If I qualified, then I should be able to just beckon to the qi flow, and have it fly out to me….</p><br/><p>“Therefore, I really only have one choice. I need to… trick the qi flow into thinking that I'm the Immortal Imperator!!” His eyes began to shine brightly at the audacity of the idea. However, the more he thought about it, the more he realized that it seemed like a definite possibility.</p><br/><p>“To trick the qi flow, I could use… my Sutra of Future Pāramitā to connect the Immortal Imperator’s fate to my own…. If that’s not enough, I could use my Sutra of Former Reincarnation to try to gain access to some of the sovereign’s memories, whatever is left in his head….</p><br/><p>“If I can understand his life by experiencing his memories… then I will be him, and he will be me….” After pondering the situation a bit more, he blurred into motion, heading directly toward the sovereign’s head, specifically, the forehead. As he got close, he reached out and touched the skin!</p><br/><p>Next, he performed an incantation gesture with his left hand, unleashing his Sutra of Future Pāramitā. Red strands swirled out into his left hand, transforming into a crimson pāramitā lily. The instant the flower entered the sovereign’s head, Bai Xiaochun’s mind rumbled, and something profoundly ancient filled him.</p><br/><p>At the same time, a trembling scream erupted from his mouth….</p><br/><p>“My head… my head….” After connecting his fate to the sovereign’s, it suddenly felt like his own head had been chopped off. The pain, and the sensation of death, were overwhelmingly realistic.</p><br/><p>Thankfully, he had been prepared for something like this, and managed to hold on to consciousness. Then, to his excitement, the scrap of qi flow began to stir and move in his direction. Although it didn’t come all the way, it covered nearly half the distance.</p><br/><p>Immediately, he brightened up.</p><br/><p>“So, it's working. Well, now I need to see if I can fuse with his memories….” His left hand blurred again as he unleashed the Sutra of Former Reincarnation. The instant he touched the sovereign’s forehead, a tremor passed through him, and his eyes went blank. Suddenly, he didn’t seem like himself, as though his soul were leaving his body, and entering a world filled with mists….</p><br/><p>This world was so huge that Bai Xiaochun began to turn completely blank, forgetting time, forgetting everything around him. Eventually, he felt someone pushing and prodding him.</p><br/><p>“Wake up, Little Chen….”</p><br/>\n</div>"}