{"title": "Chapter 1242: Eternal Spirit", "id": 1242, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1242-eternal-spirit", "volume_title": "Volume 13", "body": "<h1>Chapter 1242: Eternal Spirit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Mortal Renegade didn’t seem to be affected at all by the Worldly Daoist’s shout. He simply looked back at him calmly, almost as if he were already dead. Apparently, he really had severed any and all emotions connected to him.</p><br/><p>It was only after the Worldly Daoist’s voice faded away that he finally spoke.</p><br/><p>“There are two people in my heart, two people who have hindered my pursuit of the great Dao. The first is the woman that both of us fell in love with. The other… is you.”</p><br/><p>This was the first time that Mortal Renegade had actually acknowledged the relationship between himself and the Worldly Daoist. In response, the Worldly Daoist shivered. However, he knew his brother, and therefore, chuckled bitterly and said, “I understand. You killed Junior Sister, and now you’ll kill me…. Afterward, nothing will hinder your pursuit of your Dao!”</p><br/><p>Mortal Renegade looked back at the Worldly Daoist, who was now so weak he couldn’t fight back no matter how much he wanted to, and then nodded.</p><br/><p>“After I kill you,” he said, “I’ll eradicate the Immortal World. Then, I will have no hindrances. As for whether or not the Eternal Flower is a mere myth… well, there’s only one way to find out for sure.</p><br/><p>“Even if it’s not real… all of this still conforms to my Dao!” Not giving the Worldly Daoist a chance to respond, he waved his hand, his eyes flickering coldly as the starry sky around him distorted. Apparently, a natural law was at play, causing an invisible, invincible blade to appear. The blade flashed… and the Worldly Daoist’s head flew off of his body along with a spray of blood!</p><br/><p>Shockingly, the blade was so enormous that the Worldly Daoist’s fleshly body, as well as the body of his wife… were shredded into nothing but drifting ash.</p><br/><p>Only his head remained, and in the final moment before he actually died, he managed to say one more thing!</p><br/><p>“Master once told me that if there really is an Eternal Flower, then after it absorbed all of the desolation and death of this starry sky, it would definitely form its own spirit! You are doomed to lose, Mortal Renegade!!”</p><br/><p>The Mortal Renegade’s expression remained the same as ever. He closed his eyes, and as he did, his aura began to grow stronger. The spheres of the Immortal World had crumbled, and the nine heavens that made up the land mass had fallen into ruin. All living beings had been exterminated, leaving behind only devilish specters….</p><br/><p>The Mortal Renegade’s aura reached an indescribable level, whereupon he opened his eyes, turned, and led his massive army on a rampage to exterminate everything!</p><br/><p>That was where the vision ended. Bai Xiaochun’s eyes opened, and the last of the qi flow flowed into him.</p><br/><p>At the same time, the Worldly Daoist’s head crumbled into ashes and drifted out into the surrounding ruins. As of this day, he finally got his dying wish: to be buried along with the Immortal World.</p><br/><p>Bai Xiaochun stood there, quietly watching the ashes drift away, his mind alive with the memories of the Worldly Daoist, Immortal Imperator.</p><br/><p>Now he knew the truth about the Eternal Immortal Domains, also known as the Eternal Flower, as well as the enormous giant who was sealed outside of them.</p><br/><p>“The Mortal Renegade….” he murmured. He knew much now, but there was also a lot of missing information. However, he was eighty percent confident that his speculations and analysis of those aspects were correct.</p><br/><p>The Mortal Renegade had killed his younger brother, and the woman they both loved. He had wiped out the Immortal World, and then led his army of devilish specters on a path of extermination and destruction….</p><br/><p>In the end, he killed all of the people in the starry sky, and destroyed all of the worlds that existed within it. Just as he had said, he cast the starry sky into complete darkness. And then, just as had been spoken of in the legends, the desolation and death caused the Eternal Flower to bloom.</p><br/><p>According to such legends, the only way for a cultivator to break out of the Sovereign Realm was to use that Eternal Flower, and reach… the Eternal Realm!</p><br/><p>The Mortal Renegade came very, very close to succeeding. He cast the starry sky into darkness, and destroyed everything that existed. The desolation he brought proved the legends true; he personally witnessed the Eternal Flower bloom!</p><br/><p>Just outside of the Eternal Immortal Domains, the Mortal Renegade reached out to grab the Eternal Flower, which he would destroy, absorb, and then use to become Eternal.</p><br/><p>However… something unexpected happened!</p><br/><p>“That was when… just as the Worldly Daoist had said, the Eternal Spirit came to be!” Bai Xiaochun thought back to the stories of the Eternal Mother and the three Eternal Sons. And he thought back to how the Eternal Mother had spoken to him when he became a celestial.</p><br/><p>“I bet I can guess what happened. When the Mortal Renegade reached out for the flower, the Eternal Spirit, another term for the Eternal Mother, was not willing to be destroyed and absorbed. She formed three incarnations, three expressions of her divine sense. They became… the Arch-Lord, Saint-Lord, and Vile-Lord. They were the three Eternal Sons!</p><br/><p>“The three Eternal Sons fought with the Mortal Renegade, backed by the power of the Eternal Mother. In the end, they paid a bitter price to temporarily resolve the crisis and seal their enemy.</p><br/><p>“However, there is one question that remains unanswered. Where did the inhabitants of the Eternal Immortal Domains come from…?” He closed his eyes in thought for some time before coming up with an answer.</p><br/><p>“In order to resolve the impending crisis which would inevitably come, the Eternal Mother turned her three Eternal Sons into statues, and then used her divine sense to create worlds inside of them, filled with countless living beings. Her hope was that, years later, when the Mortal Renegade finally broke free, one of her people would be able to reach the Eternal Realm, and stave off complete calamity!</p><br/><p>“That was the only thing she could do!” Bai Xiaochun couldn’t be sure how much of his speculation was accurate. But based on the clues he had so far, they seemed highly likely to be true.</p><br/><p>After a moment of silence, he sighed. Looking out at the ruins of the Immortal World, and the scattered ashes of the Worldly Daoist, Immortal Imperator, he clasped hands and bowed deeply. Then he returned to his treasured fan.</p><br/><p>Bai Xiaochi seemed about to say something, but held back, and simply stared at the departing ashes, his eyes flickering with grief.</p><br/><p>Bai Xiaochun looked over at him, then quietly said, “I’ll tell you whatever you want to know about the Immortal Imperator’s memories.” </p><br/><p>Bai Xiaochi shook his head. “There’s no need. It's all in the past now.” </p><br/><p>Bai Xiaochun nodded, then sat down cross-legged to examine the qi flow of the Immortal World that now existed within him. Taking a deep breath, he rotated his cultivation base and began his attempt… to break through to the Archaean Realm!!</p><br/><p>Considering there were no living sovereigns, the Archaean Realm was the absolute highest level a cultivator could reach at the moment. However, it was very difficult to do so, a fact made clear considering that there were only two archaeans in the Eternal Immortal Domains.</p><br/><p>All celestials dreamed of succeeding, and yet, none could!</p><br/><p>In the past, Bai Xiaochun had not understood, but now he did. To become an archaean, one not only had to be sufficiently powerful, one also had to acquire the approval of the world!</p><br/><p>Without that approval, any attempts at a breakthrough would fail. As for why there was no third archaean in the Eternal Immortal Domains, Bai Xiaochun already had his speculations.</p><br/><p>“The method of giving approval is by distributing a portion of power of the world, in other words, its qi flow…. But the Eternal Mother is too weak now, like a candle flickering in the wind. She simply can’t sustain the existence of three archaeans! She can only sustain two!” Eyes flickering, he continued to rotate his cultivation base, and sent the qi flow of the Immortal World circulating through his body. As he did, the signs of an imminent breakthrough became clear!</p><br/><p>After all, he was now in the Immortal World, a place that had once been home to the most powerful group of people in all of the starry sky. Even though that world had been reduced to ruins, the remaining qi flow… was enough to propel one person into the Archaean Realm!!</p><br/>\n</div>"}