{"title": "Chapter 1274: The Bell Tolls For The Eternal", "id": 1274, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1274-the-bell-tolls-for-the-eternal", "volume_title": "Volume 13", "body": "<h1>Chapter 1274: The Bell Tolls For The Eternal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“The Eternal Mother!” the Saint-Emperor said with a gasp. Flying out of the turtle-shaped boat, he approached the semi-transparent bell, his expression that of complete excitement.</p><br/><p>Even as an archaean, he was deeply shaken to be able to personally lay eyes on the Eternal Mother, and the shock he felt immediately showed on his face.</p><br/><p>The Eternal Mother represented the will of all the Eternal Immortal Domains. She was the Eternal Flower, the mother of all living beings, the entity which had created everything.</p><br/><p>The Saint-Emperor wasn’t the only one to be excited. Bai Xiaochun approached the bell, and for some reason, it almost felt like he was in the presence of his own mother.</p><br/><p>However, despite the fact that they could both see the brightly glittering light, they couldn’t sense any life force. It was as if the light was simply naturally present, and didn't represent any form of thought or intelligence.</p><br/><p>Bai Xiaochun’s heart sank a bit, and he looked over at the Saint-Emperor, who was currently suppressing his excitement and sending divine sense out to examine the bell. Originally, he had assumed that doing so would be difficult, but as it turned out, nothing blocked his divine sense. It entered the bell with no problem, and touched the light, whereupon it issued a call.</p><br/><p>However, there was no reaction whatsoever. The Saint-Emperor tried a variety of methods to call out to the Eternal Mother, and to wake her up, but none of them worked. Bai Xiaochun tried as well, with the same results. No matter what either of them did, absolutely nothing happened.</p><br/><p>The Saint-Emperor’s expression continued to grow more unsightly, and in his nervousness, the fluctuations of his divine sense grew more intense.</p><br/><p>“Eternal Mother! Please, wake up!!”</p><br/><p>The little turtle watched their efforts as he swam lazily in the Eternal River. Finally, when the Saint-Emperor started calling out, he looked over at him and cleared his throat.</p><br/><p>“There’s no point in yelling. The Eternal Mother is sleeping. She’s actually been asleep for years now. And whenever she wakes up, it’s really just her sending out a bit of divine sense.</p><br/><p>“You could yell until you lose your voices, and waste all your divine sense too, and it still wouldn’t do anything.</p><br/><p>“The only way to wake her up… is to strike the bell. The toll of the bell connects to and represents all living beings….” The little turtle was clearly very pleased in his knowledge about the matter. <span id=\"footnote-ref-1d23\">[1]</span> </p><br/><p>Without any hesitation, the Saint-Emperor stepped forward, performed an incantation gesture, and then struck out toward the bell.</p><br/><p>He used all the power he could muster, causing archaean fluctuations to roll out, as well as an incomparably holy aura, like that of a saint. The energy formed into a multi-colored hand, completely corporeal in nature, which flew forward along with the movement of his hand, to slam into the bell.</p><br/><p>A rumbling boom resulted, causing waves to roll out on the Eternal River. In fact, the Eternal Immortal Domains as a whole began to quake, and waves could even be seen on the Eternal Sea.</p><br/><p>The Saint-Emperor really had gone all out in his strike, unleashing shocking energy and causing deafening booms. However, it seemed to have little effect on the bell. It tolled, but the Eternal Mother did not awaken. And to the Saint-Emperor’s shock, a backlash attack slammed into him with devastatingly destructive power!</p><br/><p>The mighty Saint-Emperor staggered backward several paces, coughing up a massive mouthful of blood, and his face turning ashen. When he finally lurched to a halt, he seemed to be teetering on the verge of collapse.</p><br/><p>“How is this even possible!?!?” he blurted.</p><br/><p>“How could it <em>not</em> be possible?” the little turtle said with a sigh. Looking at the bell with a bit of envy, he continued, “You jumped the gun! Lord Turtle didn’t even finish explaining. Striking the bell is the only option here, but succeeding is easier said than done. The bell has a very powerful backlash. You can hit it as much as you want, and it won’t hurt the bell, but it will certainly hurt you.”</p><br/><p>The Saint-Emperor’s expression was very grim as he ignored the little turtle and looked over anxiously at Bai Xiaochun.</p><br/><p>Bai Xiaochun was now feeling quite leery; it had been a bit of a startle to see that backlash slam into the Saint-Emperor. Now, with the addition of the little turtle’s further explanation, and seeing the Saint-Emperor looking at him, Bai Xiaochun hesitated for a moment.</p><br/><p>“Ah, whatever,” he thought. “I guess if there’s no other way, then I’ll just have to go for broke!” Eyes flashing with determination, he gritted his teeth and began to stride forward. Obviously, he couldn’t hold anything back. If he did, it would reduce the backlash, but would also reduce the overall effectiveness, and would be a waste of energy.</p><br/><p>“My powers of regeneration should keep me going!” Without any hesitation, he clenched his right hand into a fist, causing a shadowy emperor to appear. This was none other than… the Undying Sovereign’s Fist!!</p><br/><p>Heaven and earth shook as a massively domineering aura erupted. The shadowy emperor clenched his hand into a fist just like Bai Xiaochun, fusing with him in the moment right before the fist landed onto the huge bell!!</p><br/><p>Bai Xiaochun was powering this fist strike with all of the energy possible, and when it hit, a boom rang out that vastly surpassed what the Saint-Emperor had elicited.</p><br/><p>The Eternal River in the area exploded into a haze of water droplets, and the shockwave even shoved the little turtle back by a few hundred meters. The Saint-Emperor’s face fell, and he staggered backward again, gasping at the sight of Bai Xiaochun’s attack.</p><br/><p>The Eternal Immortal Domains as a whole trembled physically, and massive rumbling sounds echoed out, leading to widespread shock among all the living beings in the world.</p><br/><p>As for Bai Xiaochun, he grunted, his face falling as the backlash hit him with mountain-toppling, sea-draining force. However, his Undying Codex immediately went to work, and therefore, it was without a moment of pause that he unleashed a second fist strike, before the sound of the first one could even die away.</p><br/><p>The second toll of the bell was like heavenly thunder, causing the bell to shake violently, the little turtle to scream, and the Saint-Emperor to stagger backward again, his face turning completely white.</p><br/><p>And yet, Bai Xiaochun didn’t stop there. Eyes bloodshot, he let loose third fist strike, then a fourth and a fifth…. He seemed to have gone crazy, blood oozing out of his mouth as he continued to punch the bell, until he had reached eight total fist strikes!!</p><br/><p>“Wake up, Eternal Mother!” he roared, his Undying Codex unable to keep up with the backlash. Apparently, nine fist strikes was his limit. The previous eight bell tolls combined with the ninth, causing the sky to tremble and the world to shake.</p><br/><p>“How could he be this strong?!?!” the Saint Emperor thought, blood oozing out of his mouth as he was shoved a full 3,000 meters away. As of this moment, he knew that Bai Xiaochun was unimaginably stronger than himself!!</p><br/><p>The Eternal Immortal Domains had been shaken nine times in a row, causing mountains to crumble and crevices to open up in the ground.</p><br/><p>However, with the ninth toll of the bell, the Eternal Mother finally showed signs of waking up. High in the sky above the Eternal Immortal Domains, an illusory image appeared, an image which depicted Bai Xiaochun striking the bell!</p><br/><p>At that point, all living beings in the lands gasped.</p><br/><p>“The Arch-Emperor!”</p><br/><p>“It’s the Arch-Emperor!! And that ball of light! Why does it seem so familiar? It’s like I'm looking at my own mother….”</p><br/><p>“The Arch-Emperor called it the Eternal Mother. Heavens! Is that really the legendary Eternal Mother?”</p><div id=\"footnote-1d23\"><br/><p>1. There’s a play on words here that is impossible to convey in translation. In Chinese, the “sound of a bell” or the “toll of a bell” is pronounced zhōng shēng, whereas “all living beings” is pronounced zhòng shēng. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}