{"title": "Chapter 1271: Something Is Wrong", "id": 1271, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1271-something-is-wrong", "volume_title": "Volume 13", "body": "<h1>Chapter 1271: Something Is Wrong</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xiaobao’s birth eased much of the tension in the Arch-Emperor Dynasty. It was as if he represented a hope that, despite being intangible, was enough that the people of the three imperial dynasties could at least pray for a better future.</p><br/><p>Unfortunately, the Mortal Renegade still loomed in the sky above, and his weight caused everyone to slowly sink back towards panic.</p><br/><p>In many places in the Eternal Immortal Domains, cultivators began to act in wild and erratic ways. Murders, looting, and other violence broke out, and many people gave up on any attempt to keep their evil side constrained. There were even some people who began to worship the Mortal Renegade, in the hopes that he would show them mercy if they served him.</p><br/><p>Such behavior grew more rampant, to the point where it became obvious that, if things continued, the Eternal Immortal Domains would be cast into complete chaos before the Mortal Renegade even woke up.</p><br/><p>When Bai Xiaochun and the Saint-Emperor realized what was happening, they dispatched celestials to take care of the situation. Although the celestials were somewhat frustrated to be forced to handle such trifles, Bai Xiaochun and the Saint-Emperor felt that it was important to keep the peace.</p><br/><p>Of course, Bai Xiaochun realized that forcibly suppressing such behavior would only work temporarily. Eventually, it would be impossible to do so.</p><br/><p>In the end, there was nothing else to do but sigh about it. Besides, he truly did not want to be distracted at the moment. There were two important things to him right now. The first was spending time with his family, and the second… was crafting a body for Bai Hao.</p><br/><p>It was something he had long since promised himself that he would do. Therefore, in addition to spending time with his family, he ordered all of the possible resources in the Arch-Emperor Dynasty to be focused on finding various precious materials of heaven and earth, objects that, under normal circumstances, cultivators would fight to the death over. However, to Bai Xiaochun, they were merely subcomponents to a larger formula.</p><br/><p>The main medicinal ingredient came from the blood spike that the imposter Vile-Emperor had used in the final moments of their battle!</p><br/><p>Bai Xiaochun had studied the spike in great detail, and had always been suspicious of it. He had even performed spirit enhancements on it to see if it was still connected to the Mortal Renegade. Afterward, he found no evidence that it was. However, to play it safe, he decided not to use the spike itself as the basis for Bai Hao’s new body. Instead, he extracted the life force from it, which he then imbued into the precious materials he had collected. Then, he used the utmost care and precision to transform those materials into a body of plants and vegetation!</p><br/><p>To any other person, it would be a very difficult task, and something that would take a very long time. But Bai Xiaochun already had a bit of control over the Essence of time, which aided him greatly. It took only seven days for him to prepare all of the ingredients, and although he couldn’t craft an actual Dao Body, he was still able to create a vessel that would be very beneficial to any soul that inhabited it.</p><br/><p>It looked exactly like the old Bai Hao, and when Bai Hao’s soul fused into it, and then opened his eyes, he wept with gratitude. Dropping to his knees, he kowtowed fervently.</p><br/><p>“Thank you, Master!”</p><br/><p>Bai Xiaochun smiled. Although the pressure he felt because of the Mortal Renegade was nearly suffocating, as of this moment, he was very happy to see Bai Hao.</p><br/><p>At the moment, life was good. Bai Xiaochun had his family by his side, and Bai Hao was back and able to practice cultivation. Big Fatty Zhang and his other friends were there for him to reminiscence with. Sometimes, Bai Xiaochun would sigh and muse that, if only the Mortal Renegade weren’t there, his life would be almost perfect. The only missing factor would be that he still couldn’t live forever.</p><br/><p>It was at this point that Xiaoxiao made her breakthrough.</p><br/><p>Although Bai Xiaochun hadn’t seen her in a long time, he was the first one in Arch-Emperor City to sense her cultivation base breakthrough. He had been in the middle of listening to the Grand Heavenmaster provide an intelligence report, when suddenly he felt powerful fluctuations coming from his daughter’s secluded meditation facilities. Worried about any potential problems, he didn’t even provide an explanation to the Grand Heavenmaster before vanishing from the palace hall.</p><br/><p>Before the Grand Heavenmaster could react, Bai Xiaochun was inside Xiaoxiao's private chamber!</p><br/><p>Earlier, he had been worried about interrupting her cultivation session, but now that she had broken through, he took advantage of his archaean cultivation base to wave his hand, instantly intertwining his own fate with hers.</p><br/><p>Although he sensed that Xiaoxiao could surpass her tribulation on her own, he was still worried about the possibility of his daughter being hurt. It was at around this time that the Grand Heavenmaster and other experts also sensed what was happening, much to their nervousness. Xiaoxiao was unique, and was the first of a new generation of celestials. Furthermore, considering the potential catastrophe to come, every additional celestial was of great importance in terms of overall power.</p><br/><p>Of course, Song Junwan was even more worried about Xiaoxiao than Bai Xiaochun was, and immediately flew over to her meditation chamber. However, when Song Junwan realized that Bai Xiaochun was already there, she relaxed a bit. As the moments ticked by, Hou Xiaomei, Zhou Zimo, and Gongsun Wan’er also arrived, as well as others.</p><br/><p>Slowly but surely, Xiaoxiao’s aura grew stronger. After only an hour passed, rumbling sounds could be heard as Celestial Tribulation arrived. However, it seemed that the impending awakening of the Mortal Renegade had affected the Eternal Mother, as this tribulation actually contained something dark and evil!</p><br/><p>When Bai Xiaochun sensed that evil energy, he frowned. Moments before, he had been wrestling about what to do, and had been worried that if he interfered, it would be taking away valuable experience from Xiaoxiao. But now, he didn't hesitate for even a moment. Before the tribulation could form up above, a supremely powerful, domineering aura rocketed up from Xiaoxiao’s secluded meditation facilities.</p><br/><p>As it spread out to cover the entire sky, Bai Xiaochun spoke.</p><br/><p>“Tribulation, be gone!”</p><br/><p>Those short words were like a massive hand that swept through the sky and completely eradicated the Celestial Tribulation!</p><br/><p>The sky gradually went back to normal, and Xiaoxiao's aura stabilized. However, what was extremely strange was that, despite having broken through, she had no celestial aura!!</p><br/><p>Even stranger, while it was normal for the Eternal Mother to speak upon the arrival of a new celestial, no such phenomenon occurred!</p><br/><p>An extremely unsightly expression appeared on Bai Xiaochun’s face when he realized what was happening. Meanwhile, Xiaoxiao opened her eyes, and while she was initially confused, when she realized that Bai Xiaochun was there with her, she immediately shot to her feet, looking very delighted.</p><br/><p>“Dad!”</p><br/><p>Bai Xiaochun smiled and tousled her hair. However, he was still concerned; Xiaoxiao had broken through, and yet had not received the approval of the Eternal Mother, and therefore had no celestial aura.</p><br/><p>The only thing he could think of to explain the situation was that… there was something wrong with the Eternal Mother!!</p><br/><p>That only served to cause more pressure to weigh down on him. As for Xiaoxiao, she hesitated for a moment as she probed her cultivation base. Noticing the contemplative expression on Bai Xiaochun’s face, she thought for a moment, and then quietly gave voice to her concerns.</p><br/><p>“Dad, did I break through?”</p><br/><p>“Don’t worry, Xiaoxiao,” he said with a firm nod, “you broke through!” Swishing his sleeve, he opened the door of the private chamber, and then saw everyone standing outside, all of them looking confused and concerned.</p><br/><p>They too had noticed the lack of any response from the Eternal Mother, and were all wondering if they should say anything.</p><br/><p>Standing there, Bai Xiaochun looked off in the direction of the Saint-Emperor Dynasty. Moments later, a beam of holy light appeared, speeding in his direction. Before long, the Saint-Emperor appeared.</p><br/><p>He had an equally unsightly expression on his face, and was clearly unsettled.</p><br/><p>As soon as their gazes met, his voice echoed in Bai Xiaochun’s mind. “Arch-Emperor… something is wrong with the Eternal Mother!!”</p><br/>\n</div>"}