{"title": "Chapter 1281: The Past", "id": 1281, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1281-the-past", "volume_title": "Volume 13", "body": "<h1>Chapter 1281: The Past</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Xiaochun had nothing to say in response to Song Junwan. He knew that she was right. If the Eternal Immortal Domains were destroyed, then considering how powerful the Mortal Renegade was, he would have no problem finding the treasured fan out in the void.</p><br/><p>And given that his Dao was to destroy everything and leave nothing behind, the people on the fan would surely not be allowed to escape.</p><br/><p>If the Mortal Renegade had not been sealed in place outside of the Eternal Immortal Domains, then the damaged version of the fan would not have continued to exist. Even the Hourglass World would have been destroyed.</p><br/><p>“The only thing we can do,” Zhou Zimo said, “is spend time with each other before the final moment arrives…. Bai Xiaochun, there’s a place we’d like to take you to….” Both she and Hou Xiaomei were smiling as they looked at Bai Xiaochun.</p><br/><p>Warmth bubbled up in his heart as he looked back at his Daoist partners. He would treasure these moments, as he knew that time was of the essence. At the most, he could spend a few days with the people he loved. After that, he would have to go into secluded meditation to work on his breakthrough!</p><br/><p>“What place?” he asked, smiling.</p><br/><p>Unbeknownst to him, Song Junwan, Zhou Zimo, Hou Xiaomei and Gongsun Wan’er had prepared a place especially for the people from the Heavenspan Realm.</p><br/><p>Unable to contain his curiosity, Bai Xiaochun sent his divine sense out, and found that there were others present. The Giant Ghost King, the Grand Heavenmaster, Li Qinghou, Patriarch Spirit Stream, Big Fatty Zhang, Xu Baocai, Master God-Diviner, and even Bruiser were there.</p><br/><p>The smiles on their faces only stoked Bai Xiaochun’s curiosity. Together, they left Arch-Emperor City and traveled to a location on the border of the nation. Unable to contain his curiosity, Bai Xiaochun kept his divine sense sweeping out in front of him.</p><br/><p>Eventually, it locked onto something that caused him to shiver, and his heart to pound. Eyes widening, he looked over at everyone who had come to accompany him.</p><br/><p>“You guys….” He almost couldn’t believe what he was seeing. It was something that completely surpassed anything he could have imagined. There, off in the distance, was a prefecture that was roughly the size of the former Heavenspan Realm. Before, it had been empty, but now, it contained four rivers!</p><br/><p>The rivers spread out from a central location, which was filled with seawater. Although it was little more than a lake, it was actually about the same size as the Heavenspan Sea of the past!</p><br/><p>Sects covered the banks of the rivers, and there was also a Great Wall, beyond which was… the former Arch-Emperor City!!</p><br/><p>Shockingly, he was looking at… the Heavenspan Realm!!</p><br/><p>Clearly, much work and effort had gone into transforming this prefecture, and making every aspect of it the same as the Heavenspan Realm. Bai Xiaochun was already feeling deeply shaken.</p><br/><p>Of course, his divine sense had long since reached the point of being able to fill the entire Eternal Immortal Domains. But his attention had not been focused, and he had not noticed this prefecture. And there had been many momentous events since his return. Therefore, it was only at this moment that he realized what his people had been up to in recent times.</p><br/><p>When the Grand Heavenmaster saw Bai Xiaochun’s shock, he chuckled.</p><br/><p>“Your Majesty, you were in secluded meditation for many years, and your empresses came to miss their home. So did I. Therefore, I took it upon myself to gather as many people of Heavenspan as possible. Together, we scoured our memories, and built this place based on them.</p><br/><p>“I had hoped that it would be a beacon of hope for those of us from the Heavenspan Realm. No longer would we feel like strangers in a strange land. Here, we could feel like we were home, and could reminiscence about past times.</p><br/><p>“Sadly, after the construction was complete, a whole string of unexpected events occurred, and we never had time to report the matter to you, Your Majesty. Therefore, we never opened it up to the public.” Clasping hands, the Grand Heavenmaster bowed to Bai Xiaochun.</p><br/><p>Bai Xiaochun’s emotions were astir as he thought back to past times. All of a sudden, it was like a door to the past had been opened right in front of him.</p><br/><p>“Great! Excellent!” Laughing heartily, he flew forward and entered the prefecture, followed by all of his people, whose eyes flickered with reminiscence and emotion.</p><br/><p>As Bai Xiaochun traveled through the new Heavenspan Realm, his heart surged with excitement. Before long, he was in the eastern Heavenspan region, and the first place he visited was Mount Hood!</p><br/><p>It looked more or less how he remembered it. There was even a little village at the foot of the mountain, with a house just like his own.</p><br/><p>On the peak of Mount Hood, he closed his eyes and sank into his memories, flanked by all of his friends and family.</p><br/><p>Eventually, he opened his eyes, and the same smile appeared on his face that had often appeared there when he was younger.</p><br/><p>“I'm not sure if all of you know,” he began softly, “but this was actually where I joined the Spirit Stream Sect…. My father gave me a stick of incense and told me that if I lit it, an immortal would come take me away.</p><br/><p>“The only thing is that, whenever I lit the incense, lightning would fall, which scared me so much that I would instantly give up. It was only on the thirteenth time that I gritted my teeth, lit the incense, and braved the lightning. And that… was when I met Uncle Li.” With that, he looked over at Li Qinghou, much the same way he would have looked at his own father.</p><br/><p>Li Qinghou was old now, with white hair and wrinkles on his face. When he looked at Bai Xiaochun, he smiled, and yet, in his heart, he sighed emotionally.</p><br/><p>“That’s right, you little punk,” he said. “You lit that incense over and over again, and I was never able to get more than halfway there before you gave up. Eventually, I decided that when I found you, I would give you a good thrashing!”</p><br/><p>Bai Xiaochun cleared his throat in embarrassment.</p><br/><p>“There’s no need to bring up that part, Uncle Li….”</p><br/><p>Song Junwan, Hou Xiaomei, and everyone else smiled when they heard the dialogue. After all, this mountain had been constructed based on Li Qinghou’s personal memories.</p><br/><p>“From here, Uncle Li took me to the Spirit Stream Sect….” Turning his head, he looked off into the distance for a moment. Then, he used the extraordinary powers of his cultivation base to take a step forward, and bring everyone with him to the Spirit Stream Sect.</p><br/><p>It looked almost exactly as he remembered it. There was even a gravel path that he walked down, whereupon he found himself in the Ovens.</p><br/><p>“This was where I met Eldest Brother. There were eight fatties back then, but Eldest Brother was the one who jumped out first and scared the living daylights out of me…. Back then, he was like a mountain of flesh!”</p><br/><p>Big Fatty Zhang rubbed his nose awkwardly, but still chuckled a bit.</p><br/><p>“I remember thinking about how skinny you were,” Big Fatty Zhang said, “and that I needed to fatten you up a bit. Who would have thought that your arrival would open up a new door to us Ovens people? That was when we really learned how to pilfer delicacies!”</p><br/><p>For many of the people present, it was their first time hearing of such things, especially Gongsun Wan’er and Zhou Zimo. When Big Fatty Zhang saw how curious they were, he launched into a whole account of what he and Bai Xiaochun had done together in those years. At a certain point, he brought up the Chicken-Thieving Fiend, which was when Hou Xiaomei let out a strangled shout.</p><br/><p>“I can’t believe that <em>you</em> were the Chicken-Thieving Fiend!!”</p><br/><p>Looking even more embarrassed, Bai Xiaochun pointed at one little hut off to the side.</p><br/><p>“See that? That’s where Xu Baocai delivered his blood notice to me. He was really pissed about losing his place in the Ovens, so he threw the blood notice down and challenged me to a fight….”</p><br/><p>Xu Baocai chuckled, but didn’t say anything. At this point, he realized that people weren’t paying attention to him, and seemed more interested in Big Fatty Zhang’s stories about the Chicken-Thieving Fiend. </p><br/><p>At this point, Bai Xiaochun decided to take everyone to the trial platform staircase. At the top, he smiled.</p><br/><p>“This is the exact spot where I met Xiaomei.”</p><br/><p>Hou Xiaomei looked at the steps, and a sweet smile broke out on her face. For her, it was almost like going back in time….</p><br/>\n</div>"}