{"title": "Chapter 1300: Never-Ending Turtle", "id": 1300, "volume": 13, "url": "http://boxnovel.org/a-will-eternal-chapter-1300-never-ending-turtle", "volume_title": "Volume 13", "body": "<h1>Chapter 1300: Never-Ending Turtle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In that moment, Bai Xiaochun’s eyes opened even wider than before, to the point where they nearly popped out of his skull, as a gigantic, crocodilian turtle emerged from the vortex, its berserk eyes bright red, and its expression that of utter ferocity. </p><br/><p>To Bai Xiaochun’s shock, he realized that, other than the size, this turtle looked… exactly like his own life essence spirit!! <span id=\"footnote-ref-def0\">[1]</span></p><br/><p>As soon as the vicious, crocodilian turtle emerged into the open, the vortex began to fade away, along with the face. However, the face said one last thing before it disappeared, in a cold, arrogant voice. </p><br/><p>“The glory of the Vast Expanse Dao Domain is a thing of the past. It is now the age of the Never-Ending Dao Domain! Never-Ending Turtle, destroy Holy Extermination and prevent a second Allheaven from being born!” <span id=\"footnote-ref-e555\">[2]</span></p><br/><p>Almost in unison with the voice, the mysterious energy surged into action, shooting into the vortex before it could disappear. A moment later, a bloodcurdling scream of shock could be heard, followed by complete silence….</p><br/><p>The mysterious energy emerged from the vortex, wiped it out, and then shot toward the crocodilian turtle.</p><br/><p>This was no ordinary turtle; as soon as the mysterious energy approached, it began to shine with golden light, especially its shell. After looking more closely at the shell, Bai Xiaochun’s mind began to spin.</p><br/><p>“That turtle shell…” he murmured, “it looks so familiar….” As soon as the mysterious energy swept over the crocodilian turtle, its body vanished, leaving behind only its shell. Then, the energy seemed to prepare to wipe the shell out of existence, but before it could, an enormous, illusory flower suddenly appeared within the starry sky!</p><br/><p>It was a beautiful flower that shifted back and forth between being illusory and corporeal, and as soon as it appeared, it sucked the turtle shell into it, which the mysterious energy of the starry sky did nothing to prevent. After watching all of this happen, Bai Xiaochun couldn’t help but think of… the little turtle.</p><br/><p>Almost as soon as the flower absorbed the turtle shell, a tiny, newborn turtle materialized on one of the flower’s leaves. He looked around in confusion for a moment, and then faded way into the starry sky along with the flower.</p><br/><p>“The Eternal Turtle….” Bai Xiaochun murmured, deeply shaken as he watched the little turtle vanish along with the flower. This time shift had been profoundly meaningful, and had revealed the origin of both the little turtle and his turtle-wok. As these new truths sank into his mind, Bai Xiaochun’s eyes glittered with enlightenment.</p><br/><p>Even more shocking was how the mysterious energy suddenly swept over him for a moment before heading toward the area where the Eternal Flower had vanished. Afterward, Bai Xiaochun reached out with his hand, confirming that the energy was still there. Then he closed his hand in an attempt to grab it.</p><br/><p>Although he couldn’t explain it, he was sure that the mysterious energy wouldn’t harm him. After all, he had felt it when he became a sovereign, and knew that he had formed a resonance with it.</p><br/><p>In that same instant, the Mortal Renegade suddenly felt profoundly shaken. His sensation was different from Bai Xiaochun’s. He… could not sense that mysterious energy, but that didn’t mean he hadn’t noticed its actions. And now that he saw what Bai Xiaochun was doing, his eyes went wide.</p><br/><p>“He’s going to… impossible!” For the first time, his face completely fell, and his eyes shone with shock. Without the slightest hesitation, he unleashed the full power of his cultivation base, waving his hand to conjure a Finger of Extermination, something that could destroy all life, that could bring nirvanic extermination to anything it touched. And he sent that finger directly toward Bai Xiaochun!</p><br/><p>From a distance, the Finger of Extermination looked like an enormous statue, carrying ultimate death and destruction toward Bai Xiaochun.</p><br/><p>Before, Bai Xiaochun would have simply resorted to another time shift. That would have easily enabled him to evade a trump card like this. But now, he reached out instinctively and made contact with that mysterious energy.</p><br/><p>As he did, he trembled, and his blood began to surge through his veins as his cultivation base raged. Even his soul was shaken as his life was drastically changed on a fundamental level.</p><br/><p>“This… is….” It was impossible for Bai Xiaochun to describe what he was feeling. It was as though the so-called mysterious energy came from the starry sky, from the heavenly bodies, from the worlds, and from all living beings. It was as if… everything within the Eternal Spirit World, all living entities, were part of it!</p><br/><p>“Spirit….” Bai Xiaochun murmured, unsure of exactly why he was saying it. It seemed like an ordinary word, but as soon as he uttered it, that mysterious energy seemed to leap with excitement. Of course, Bai Xiaochun knew that when one was focused and worked hard, good fortune was sure to follow, and therefore, he looked over at the Mortal Renegade, and then extended his finger!</p><br/><p>In response, the Mortal Renegade’s face fell, and his heart filled with an unprecedented level of deadly crisis. He immediately prepared to fall back, but before he could, the mysterious energy shot forward, piercing through the Finger of Extermination and stopping it in its tracks. Then, it closed in on the Mortal Renegade himself. Even as Bai Xiaochun looked on in excitement, the energy swirled around the Mortal Renegade… and without harming him in the least, turned and sped off into the distance….</p><br/><p>“Huh?” the Mortal Renegade blurted in shock.</p><br/><p>“Uh….” Bai Xiaochun said, so stunned and disappointed that beads of sweat broke out on his forehead.</p><br/><p>After a moment of silence, the Mortal Renegade turned to look coldly at Bai Xiaochun. And then, the previously stilled Finger of Extermination continued to rumble toward Bai Xiaochun.</p><br/><p>“Spirit? What kind? Completely unreliable!” By this point, there was no time for him to resort to a time shift; the Finger of Extermination was right on top of him. Eyes widening into a glare, he threw his right hand out, summoning his turtle-wok to block the finger attack. At the same time, he shouted out at the top of his lungs.</p><br/><p>“Waterswamp!!”</p><br/><p>In response to his word, the turtle-wok suddenly began to glitter with bright, golden light that merged into the watery swamp that was forming. That in turn caused the surrounding starry sky to twist and distort as a golden swamp filled the area, vastly surpassing the level of any of the previous swamps.</p><br/><p>“Kingdom!!”</p><br/><p>Intense rumbling sounds echoed out, along with bright golden light, as mountain peaks rose up from the swamp. Next was an enormous, crocodilian head, behind which was a long neck covered with scales that emanated golden light! Following the head and the neck were two indescribably terrifying clawed hands, and then, a huge turtle shell. The instant that shell was out in the open, Bai Xiaochun’s turtle-wok transformed into a golden beam that shot up to his life essence spirit and fused with it!</p><br/><p>As the fusion completed, his life essence spirit shivered, and then let out a hair-raising roar as its aura leaped to a higher level. Then, it climbed completely out of the swamp!</p><br/><p>It was so huge it could prop up the starry sky, its shell radiating golden light, and its expression ferocious to the extreme. It seemed berserk to an unparalleled level! This was… exactly the same crocodilian turtle that had just emerged from the vortex and entered the Eternal World right in front of Bai Xiaochun and the Mortal Renegade!</p><br/><p>Roar!</p><br/><p>Without the slightest hesitation, and lacking even a scrap of fear, the crocodilian turtle shot toward the Finger of Extermination!</p><br/><p>The Mortal Renegade’s expression couldn’t have been more unsightly. Never could he have imagined that Bai Xiaochun would have a divine ability like this at his disposal. After all, even he was trembling in astonishment at the sight of the vicious, explosively violent crocodilian turtle attacking him.</p><div id=\"footnote-def0\"><br/><p>1. I would like to point out that way back in chapter 1021, as well as subsequent chapters, I very intentionally called Bai Xiaochun's life essence spirit \"crocodilian\" and not \"a crocodile\" <i class=\"fa fa-hand-o-left\"></i></p></div><div id=\"footnote-e555\"><br/><p>2. In Chinese, the \"Holy Extermination\" here is made up of two characters that rhyme almost perfectly with the character for “Extermination” in the \"Old Man Extermination\" who appeared or was mentioned at certain points in Renegade Immortal, Pursuit of Truth, and I Shall Seal the Heavens. From the moment the corpse and the battleship appeared earlier in AWE, the Chinese fans were speculating that he was Old Man Extermination. This passage pretty much confirms that. <i class=\"fa fa-hand-o-left\"></i></p></div><br/>\n</div>"}