{"title": "Chapter 1309: Seeing God", "id": 1309, "volume": 14, "url": "http://boxnovel.org/a-will-eternal-chapter-1309-seeing-god", "volume_title": "Volume 14", "body": "<h1>Chapter 1309: Seeing God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After providing the last bit of guidance, Bai Xiaochun didn’t pay any further attention to the living beings in the multitude of worlds in the starry sky. He sat down cross-legged in the place where the Eternal Immortal Domains had disappeared, which, over the years, had gradually become a landmass.</p><br/><p>Bai Xiaochun closed his eyes, and as the years passed, and he remained completely motionless; he became a statue.</p><br/><p>During the process in which life had sprang up from nothing and eventually reached a flourishing state, Bai Xiaochun never once felt the Essence of the Eternal, or the mysterious energy. After the Eternal Flower fell into the River of Time and Space, the Essence of the Eternal faded so much that… perhaps it had vanished completely.</p><br/><p>“After the creation of life,” Bai Xiaochun murmured, “the next step… is enlightenment of Essence.” With that, he sent his divine sense out into the starry sky, and began to seek enlightenment from the natural laws that had risen up along with the countless living beings.</p><br/><p>Years ago, his Dao had been that of lighting up the starry sky to become a sovereign. And he had accomplished that. In fact, he had gone beyond bringing light to the starry sky; he had also brought life back to it.</p><br/><p>But now, he wasn't concerned about his cultivation base. He needed to understand the Essence of all of the multitude of worlds in the starry sky, and then use that understanding to make the Eternal!</p><br/><p>“Wait for me, all of you…. It will be soon, very soon….” As time passed, he became a part of the starry sky itself as he sought the enlightenment he needed.</p><br/><p>This time, it wasn’t 10,000 years that passed. Nor was it 1,000,000. It was longer than that…. Eventually, it reached the point of being incalculable. Among the 1,080,000 worlds in the starry sky, Bai Xiaochun was ancient history, whose existence would only be mentioned in the most ancient of records.</p><br/><p>As generations came and went, people stopped believing in the old legends about the origin of cultivation. People began to believe that their cultivation came from their own power!</p><br/><p>The seeds that Bai Xiaochun had scattered years ago were forgotten by the people of the starry sky. They created new techniques, divine abilities, and schools of magic…. The cultivation world thrived, and wars were fought.</p><br/><p>Years and years passed. Countless talented individuals spent their lives studying the practice of cultivation, noting their errors and mistakes, and passing on information to further generations. Eventually, by building on the failures of past generations… a celestial arose, the first within the 1,080,000 worlds.</p><br/><p>That celestial obtained the approval of the world in which he lived, and tried to do something completely grand and dramatic, something that no one before him had ever done. He tried to break out from the world in which he lived, to step into the starry sky! Sadly, despite spending his whole life in that attempt, and using up all the resources he had managed to accumulate, he failed. </p><br/><p>But eventually, more celestials appeared among the various peoples of the various worlds!</p><br/><p>The cultivation world in this starry sky had entered the age of celestials!</p><br/><p>All celestials dreamed of leaving the worlds they came from and of stepping out into that starry sky. After all, they were convinced that the only way to become more than a celestial was to seek a path in what was beyond the heavens they knew.</p><br/><p>Unfortunately, none of those celestials succeeded. No matter how spectacular they were, when they reached the limits of the heavens, they could do nothing more than take half a step into the starry sky.</p><br/><p>More years passed. As more and more celestials appeared, eventually… one of them reached the Archaean Realm.</p><br/><p>He was an old man, and when he achieved his breakthrough, the sound of his laughter filled his world. Everyone watched in envy and excitement as he floated up toward the limits of the sky.</p><br/><p>“I, Sima Nan, have finally broken through!! This is the legendary… Archaean Realm!!” Laughing heartily, he flew up and stepped out into the starry sky!!</p><br/><p>“The starry sky. The starry sky!” As he hovered there, he looked around, both excited and filled with ambition! His goal: to see the whole starry sky with his own eyes, to search it and find out if other worlds existed. In the years to follow, he would indeed appear in one world after another. </p><br/><p>The cultivation world had entered the era of the starry sky!!</p><br/><p>As the first archaean in the starry sky, he spent more than a thousand years traveling amongst worlds. He visited over ten of them. Considering how powerful his cultivation base was, it was easy for him to conquer them. However, he couldn't take the people of the world away with him, nor could he bring people from his home world there to colonize them. Therefore, he would plunder the worlds he conquered, and then move on.</p><br/><p>The excitement of conquering worlds soon faded. However, in the calm that came afterward, he came to be convinced… that he was the ultimate existence within this starry sky. Unless another archaean appeared, he was definitely the most powerful expert there was!</p><br/><p>“Being invincible is actually fairly lonesome,” he thought, sighing. He was currently sitting cross-legged on a huge sword made of bone, flying through the starry sky, looking for another world to explore. Suddenly, he turned to look in a different direction.</p><br/><p>“Over there…. Is something calling out to me…?” He frowned. This was his first time experiencing anything like this within the starry sky. Confident in the level of his cultivation base, he chuckled coldly, and began to head in the direction of the call.</p><br/><p>“Let’s see who or what dared to try to summon me!” Eyes shining with lofty coldness, he proceeded along for an entire sixty-year-cycle. Sometimes he would grow suspicious about the situation, and about how far away this call was coming from.</p><br/><p>“Just what exactly is calling to me…?” he thought, frowning. Soon, he realized that something strange was happening. The call was actually coming, not from some distant location, but from within his soul. Something was urging his soul to travel to some specific location. However, Sima Nan still felt confident in his cultivation base, and therefore, continued onward at full speed.</p><br/><p>The location he was being called to wasn’t actually as far away as he had thought. After another sixty-year-cycle passed, he noticed a land mass some distance away in the starry sky!</p><br/><p>“Don’t tell me this awful place is another world?” He looked around, chuckling coldly. During the past two sixty-year cycles, the urgings of his soul had come to be quite annoying to him. Sending divine sense out, he confirmed that there was nothing dangerous in the area, and then continued on toward the land mass.</p><br/><p>As Sima Nan landed on the continent, it was to his surprise that he didn’t find any life at all. And yet, the thirst within his soul actually grew more intense. He was feeling extremely suspicious about the whole thing, but had spent two sixty-year cycles to get to this place, and knew he couldn’t just look around briefly, and then leave.</p><br/><p>After a moment of thought, his eyes turned cold, and he blurred into motion, following the tugging of his soul deep into the land mass. Eventually, he caught sight of a mountain!</p><br/><p>It was actually the only mountain on the entire land mass, and at its peak was… a statue of a person, seated cross-legged in meditation!</p><br/><p>The instant Sima Nan saw that statue, he shivered, and his mind began to spin.</p><br/><p>“That statue… that statue….” His soul was shivering in much the same way that a child would when catching sight of his father. Unable to control himself, Sima Nan flew over to the statue and dropped down to kowtow to it.</p><br/><p>To his utter shock, he recognized this statue. It was very similar to statues he had seen among his own people, and even in the peoples of the other worlds he had visited. And it was connected to a legend that only a few people knew of. As for those who had heard of the legend, they all assumed it was a fairy tale of some sort.</p><br/><p>Sima Nan had also believed the same thing. Upon realizing that the gods depicted on numerous worlds, including his own, were all the same, he had felt that something strange was going on, but had eventually dismissed such thoughts. But now, upon seeing this statue, all of those old memories resurfaced.</p><br/><p>Based on the fluctuations of his soul, he knew… that the legends were true!</p><br/><p>This statue had not been placed here by any group or people. Sima Nan could sense that truth based on his cultivation base and his soul. This statue… was alive! When standing in front of it, Sima Nan’s cultivation base felt completely insignificant. He could tell that, with a single thought, this statue could destroy, not just him, but his entire world. Perhaps even the entire starry sky!!</p><br/><p>This statue was the same person who was mentioned in the legends of the worlds Sima Nan had visited. He was the Sun God of ancient times, who was the source of everything that existed!!</p><br/><p>“I’ve… seen God….” Sima Nan murmured. Trembling, he prostrated himself in front of the statue, and remained there, unmoving.</p><br/>\n</div>"}