{"title": "Chapter 9: Never seen something like this", "id": 9, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-9-never-seen-something-like-this", "volume_title": "Volume 1", "body": "<h1>Chapter 9: Never seen something like this</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9: Never seen something like this</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"It's too late.\"</p><br/><p>Lin Fan sighed in helplessness as the city enforcement platoon came to his shop. They say that a single slip can cause you an eternity of sorrow, but Lin Fan had never thought that things would turn out this way.</p><br/><p>The scallion pancakes were so delicious that the customers would not let Lin Fan leave. In the end, he was caught red-handed by the enforcement officers.</p><br/><p>\"You sure are a stubborn brat. Even after getting caught by us time after time, you still have the guts to open your stall here. Do you know that you're ruining our city's image?\"</p><br/><p>\"Standing in front of Lin Fan was a thirty-something-year-old man. He was the city enforcement platoon's leader, Liu Xiao Tian.</p><br/><p>Ever since he had started hawking, Lin Fan had had his cart confiscated thrice, and every one of the three times, it was this Liu Xiao Tian who caught him</p><br/><p>\"Chief Liu, I'm just a first time offender, please have mercy on me.\"</p><br/><p>Lin Fan was fearful of Chief Liu. His nickname was \"Hawker Killer\". If you were caught by him, it didn't matter what kind of tragic story you had, or whatever excuses you gave. He would dish out the appropriate punishment regardless, without a shred of sympathy.</p><br/><p>\"First-time offender? Hmph! Brat, if I include today, you would already have had four offenses. You even ran away from us a few times. Who knows how many times it would be if you hadn't run. Fortunately, these dear citizens were around today to stop you, otherwise, you probably would have run away again, wouldn't you?\" Liu Xiao Tian smiled slyly as he reprimanded Lin Fan. Then, he waved his hand.</p><br/><p>\"Officers, take this cart away.\"</p><br/><p>Liu Xiao Tian then turned to the surrounding crowd and said with a wide smile on his face, \"Thank you for your help, citizens. These hawkers open their stalls illegally, ruining the image of Shanghai. It's thanks to you, the outstanding citizens, that we can have such a beautiful and vibrant city to live in.\"</p><br/><p>Liu Xiao Tian had worked as an enforcement officer for almost 6 years. Due to the stellar results that he produced, he rose to the appointment of platoon leader in just a short period of time.</p><br/><p>City enforcement officials across the country had a bad reputation and many citizens were prejudiced against them.</p><br/><p>There were occasional cases of violence by city enforcement officers across the country, but they were few. Even so, one bad apple can spoil the barrel and these cases caused their reputation to be ruined.</p><br/><p>Liu Xiao Tian's subordinates always carried out their duties with a peaceful and friendly attitude, never resorting to violence. Even if they were attacked, they would not retaliate physically.</p><br/><p>Just as the city enforcement officers were about to take away the hawking cart, those citizens who were in the queue for the scallion pancakes decided that they had had enough.</p><br/><p>\"What are you people doing?\"</p><br/><p>\"This stall cannot be taken away.\"</p><br/><p>\"Yeah! You absolutely cannot take it away, my scallion pancake isn't even ready yet!\"</p><br/><p>\"Hands off! Get your hands off! You city enforcement officers are never around when you're needed, but just have to come at a time like this. You must be doing this on purpose so we can't enjoy our scallion pancakes!\"</p><br/><p>At this moment, the citizens erupted.</p><br/><p>They had waited so long just for these scallion pancakes and it had almost been their turn too, but these city enforcement officials just had to show up now and decide to take away the cart immediately. Did they have any conscience?</p><br/><p>Liu Xiao Tian was in shock. A moment ago, he was had just been complimenting the citizens, but right now, these so-called \"outstanding citizens\" were directing all of their anger towards him and his men.</p><br/><p>\"My dear citizens, this hawker is ruining our city's image. We are all residents of this beautiful city. We wouldn't want that to happen, right…?\" Liu Xiao Tian tried earnestly to persuade them. He couldn't let the relationship between the city enforcement officers and the citizens sour even further.</p><br/><p>We are a big city, an international hub. This is why we must serve our citizens! He thought to himself.</p><br/><p>\"Don't give me that rubbish. Whether the city is beautiful or not, that's the city planners' business. Let me ask you this: What could go wrong if we eat the scallion pancakes?\"</p><br/><p>\"My fellow man, we are well aware of your duties, but sometimes you have to listen to what the people want, right?</p><br/><p>\"That's right! I've been queuing here for 40 minutes. If you just take this stall away, wouldn't that be unfair to us?\"</p><br/><p>\"I'm a doctor. If I don't have these scallion pancakes, I'll be lethargic the whole day. Do you know what kind of impact that will bring? I have an operation to perform this afternoon. If I can't focus, I might commit a mistake. That may lead to major problems, even death. When that happens, I'll be sure to drag you down with me.\"</p><br/><p>…</p><br/><p>Liu Xiao Tian was stupefied. What the heck was going on?</p><br/><p>They were just taking away a hawking cart, why was there so much dispute?</p><br/><p>More and more people surrounded them to spectate the scene. Most of them had no idea what was going on and thought that some big incident had just happened.</p><br/><p>Seeing the words \"city enforcement officer\" triggered them and made them recall the cases of violence by enforcement officers. One by one, the spectators whipped out their cell phones and gathered closer.</p><br/><p>However, they were confused upon taking a closer look. What kind of situation was this? It didn't seem like anything had happened.</p><br/><p>Lin Fan was dumbfounded as well. He had never seen something like this. Customers were disputing against the city enforcement officers for the sake of wanting to have some of his scallion pancakes.</p><br/><p>In fact, looking at the current situation, it seemed like even he wouldn't be able to leave until he served every one of his customers.</p><br/><p>\"Chief, what are we going to do? These people won't let us have the cart,\" one of Liu Xiao Tian's subordinates asked.</p><br/><p>This kind of situation had never happened before. They were at a loss on what to do.</p><br/><p>At this point, even Liu Xiao Tian himself was out of ideas.</p><br/><p>If he just left the hawker alone, that would be against the regulations and it would make him uneasy. However, seeing how the citizens were, it seemed like he wouldn't be able to confiscate the cart even if he wanted to, at least not until they had their scallion pancakes.</p><br/><p>Liu Xiao Tian was in a predicament.</p><br/><p>More importantly, the crowd was getting bigger and bigger. If this dragged on any longer, news of this incident would start reaching the internet. Then, it wouldn't matter who was right or wrong, all the blame would be on the city enforcement officers.</p><br/><p>\"Godd*mmit! What's the matter with these people? All this because of some scallion pancake!\"</p><br/><p>\"Chief…\" Lin Fan said weakly, \"Why don't you just let me make these scallion pancakes for them?\"</p><br/><p>\"No. Rules are rules. You've already broken a law, I have to confiscate your cart.\" Liu Xiao Tian said strictly.</p><br/><p>Lin Fan sighed in frustration. If you're going to be so stubborn, then let's see how you handle this.</p><br/><p>\"Everybody, listen to me. We have to carry out our duties according to the rules and regulations. This hawker has broken the law, if we don't put a stop to it, our city will fall into disarray,\" Liu Xiao Tian reasoned with all his might, hoping the citizens would understand.</p><br/><p>However, to this bunch of impatient citizens, whoever stood in between them and their scallion pancakes was an enemy.</p><br/><p>\"Don't give us that bullshit! If you dare to take away the stall, I will report you!\"</p><br/><p>\"Yeah! If you don't let us have those scallion pancakes, you're basically killing us!\"</p><br/><p>Liu Xiao Tian stared at these citizens who didn't show any sign of backing down. He was at a loss for words.</p><br/><p>The world has changed.</p><br/><p>Since when did situations like this start occurring?</p><br/><p>In the past, hawkers would scurry away in fear of their stalls being confiscated.</p><br/><p>And now, this scallion pancake hawker is just standing there impatiently, indifferent to what is happening as if he has done nothing wrong.</p><br/><p>\"Chief, why don't we just let it go. These citizens look like they've been possessed or something. If we try to take the cart by force and something happens, we would be blamed even if we are right.\"</p><br/><p>\"He's right. These days, the internet is filled with criticism of us city enforcement officers. Let's just look the other way for today. Otherwise, there may be some serious consequences.\"</p><br/><p>Liu Xiao Tian blinked a few times, then finally and reluctantly gave in with a nod of his head.</p><br/><p>Since it's come to this, let's just forget about it.</p><br/><p>\"Go ahead, but after this group of customers, no more,\" Liu Xiao Tian said firmly.</p><br/><p>Lin Fan was astonished. He never thought this Chief Liu would give in.</p><br/><p>With this, the surrounding citizens started rejoicing.</p><br/><p>\"Hey officers, you guys aren't too bad after all!\"</p><br/><p>\"Next time someone dares to talk bad about city enforcement officers online, I'll be the first to object!\"</p><br/><p>\"See? That's how city enforcement officers should be, listening to the people's wishes.\"</p><br/><p>Seeing how the citizens, who had just been protesting against them a moment ago, suddenly praise them like that, Liu Xiao Tian and his men were extremely gratified.</p><br/><p>Alright, alright, let's make an exception just this once.</p><br/>\n</div>"}