{"title": "Chapter 15: The Second Page", "id": 15, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-15-the-second-page", "volume_title": "Volume 1", "body": "<h1>Chapter 15: The Second Page</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: The Second Page</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Zhong Qing Yi left happily with her pancakes. The fermented beancurd vendor was also mercilessly arrested. He was so shocked by Lin Fan possessing a license that he kept looking at it even as he was being taken away.</p><br/><p>In the early afternoon.</p><br/><p>Lin Fan enjoyed a luxurious meal as he immediately went to order two dishes and a soup from a nearby restaurant.</p><br/><p>Lin Fan reflected on his life in the past and compared it to his current life. What kind of life had he been living?</p><br/><p>Lin Fan happily sipped on his beer while eating his meal. He then whipped out his phone, wanting to look at some sensational news.</p><br/><p>\"I don't see any 'breaking news' by the UC news department today. Let's see what else there is…\"</p><br/><p>Lin Fan scrolled through his old and worn out iPhone 4 and paused as if he saw a strange piece of news.</p><br/><p>\"I'm on the news…?\"</p><br/><p>Lin Fan rubbed his eyes and looked in disbelief. He looked again and realized that it was really him. \"Shocking scenes outside Red Star Primary School, scallion pancake vendor bewitched crowds of people…\"</p><br/><p>Lin Fan read through the article closely and clicked on another e-platform app. Just when the app was opened, mesmerizing voices could be heard.</p><br/><p>\"Wow! It's so delicious.\"</p><br/><p>\"Simply delicious.\"</p><br/><p>\"These scallion pancakes are so delicious.\"</p><br/><p>These praises caused Lin Fan to feel rather awkward. Especially after he looked at the people's exaggerated expressions.</p><br/><p>When Lin Fan was selling the pancakes, he did not realize that there was something unusual. But after he saw what was recorded and reported on the news, he realized that it seemed rather rehearsed.</p><br/><p>But Lin Fan was still confident of his scallion pancake making skills and believed that he made delicious pancakes.</p><br/><p>However, he was both angry and helpless when he saw the comments.</p><br/><p>\"These actors' expressions are too exaggerated.\"</p><br/><p>\"Fifty-one people, if there were any more people, it would have been even worse.\"</p><br/><p>\"What era are we living in? Now any profession can be faked!\"</p><br/><p>Fake my a*s, my scallion pancakes are truly delicious.</p><br/><p>Under these circumstances, Lin Fan couldn't take it anymore. He started to leave comments to argue with this group of haters.</p><br/><p>Lin Fan wasn't afraid of these guys taking revenge. If that really happened, he could stuff their mouths with the scallion pancakes and use it to unify their views on these pancakes.</p><br/><p>After spending half an hour in the comments section, Lin Fan proceeded to push his cart slowly back to its original position as he prepared to continue working hard through the afternoon.</p><br/><p>Lin Fan thought that since he was already on the news, he would be able to complete the Encyclopedic task soon. Just thinking about it made him a little excited.</p><br/><p>In the afternoon.</p><br/><p>At various Shanghai news departments.</p><br/><p>\"Xiao Wang, I want you to make a trip to Red Star Primary School to interview the scallion pancake vendor and write an article about it,\" said the head editor.</p><br/><p>\"Alright, head editor.\" Xiao Wang was a new reporter for the company and didn't have many opportunities to interview any well-known people. If he could make a news out of this and upload it onto the internet, it could help to boost his popularity.</p><br/><p>Xiao Wang was envious of the experienced reporters who frequently got to interview famous people and wrote the big headlines.</p><br/><p>\"Scallion pancakes vendor? I finally get to interview someone of decent popularity. But obviously, everything is staged. Looks like I have to find an actor to go with me.\"</p><br/><p>Xiao Wang had everything planned out in his mind, even the article content was all prepared.</p><br/><p>At 4 pm.</p><br/><p>Lin Fan pushed his cart back to its original position outside Red Star Primary school but he realized that the vendors in the vicinity looked at him weirdly.</p><br/><p>\"Kid, you're so awesome.\"</p><br/><p>When Lin Fan was done with setting up his stall, Fraud Tian came over and said something that Lin Fan couldn't understand.</p><br/><p>\"Awesome? Yeah, I'm f*cking awesome,\" Lin Fan replied.</p><br/><p>\"No, tell me honestly, when did you get your license? When you weren't here just now, everyone was discussing about it,\" Fraud Tian asked while looking at the piece of paper glued to Lin Fan's cart.</p><br/><p>As for Fraud Tian, if the license was obtained through legitimate means, he had wanted to go apply for one as well.</p><br/><p>\"Hey, hey, you wanna know how? Simple, just give me $100,\" Lin Fan said as he stretched out his hand.</p><br/><p>\"You wanna ask for money for this? That's hurtful; it's okay, I won't ask further,\" Fraud Tian waved his hand and said.</p><br/><p>Lin Fan took a glimpse of another stall, hit his stall counter repeatedly and said, \"My permanent pass is coming soon. In future, there wouldn't be any more city enforcement officers coming after me. I can finally set up my stall with a peace of mind.\"</p><br/><p>\"Little boss is here, Little boss is here.\"</p><br/><p>When Lin Fan was done setting up his stall, streams of people queued up for his scallion pancakes. Lin Fan recognized that these people were those that had tasted his scallion pancakes before.</p><br/><p>\"Little boss, you're indeed punctual.\"</p><br/><p>\"I can't wait any longer, give me three pancakes.\"</p><br/><p>\"I want six scallion pancakes.\"</p><br/><p>\"A day without your scallion pancakes makes me feel so uncomfortable!\"</p><br/><p>In the blink of an eye, Lin Fan's stall had a long queue in front of it. The other vendors were all envious of him.</p><br/><p>This f*cker simply didn't make sense. He had just set up his stall and he already had so many people queuing for his pancakes. It looked too staged.</p><br/><p>\"F*ck…\"</p><br/><p>Fraud Tian was also shocked by what he was seeing. What exactly was happening? This kid was too good.</p><br/><p>But as people say, having connections with influential people will reap benefits. Fraud Tian then started to promote his stall.</p><br/><p>\"Don't miss out on my amazing fortune-telling. Come, come… Find out your future and reflect on your past deeds.\"</p><br/><p>Just after advertising his fraudulent business, many people actually came over to his stall after getting their pancakes.</p><br/><p>Once Diviner Tian saw that people were coming, he smiled ecstatically like a chrysanthemum flower which had just bloomed.</p><br/><p>Just as Lin Fan was busy making pancakes, someone took a microphone and another person followed behind with a camera.</p><br/><p>\"Hi, I am from a reporter from Shanghai Star Publisher. Are you the famous scallion pancake man?\" Xiao Wang smiled and asked.</p><br/><p>\"The scallion pancake man? Yeah, that's me.\" Lin Fan seemed rather satisfied with the name that he had been given.</p><br/><p>\"Hi scallion pancake man, I am reporter Wang from Shanghai Star Publisher. The things that happened here went viral on the Internet. I heard that each and every one of your customers would make exaggerated facial expressions after eating your scallion pancakes. May I know what's so magical about your scallion pancakes?\" Xiao Wang asked.</p><br/><p>But in his heart, Xiao Wang thought that the crowd who was queueing for the pancakes were just a bunch of actors.</p><br/><p>Even the best chef in the world wouldn't be able to make something so delicious that would make everyone go crazy over it; not to mention a simple scallion pancake.</p><br/><p>\"Hey, reporter, can't you see that Small Boss is busy? Can't you carry out your interview after he's done?\"</p><br/><p>\"Yeah, yeah, you want to find out about the magic behind it right? Let us answer that for him, it's heavenly. It's practically heaven on earth.\"</p><br/><p>\"That's right. You can't understand how delicious it is without trying it for yourself.\"</p><br/><p>The crowd surrounding Xiao Wang had a lively discussion which shocked Xiao Wang. It seemed unusual.</p><br/><p>Xiao Wang merely wanted an interview with Lin Fan. He thought that Lin Fan asked the actors to surround him just to stage an overwhelming response.</p><br/><p>But as he analyzed the situation, he realized that Lin Fan wasn't bothered at all.</p><br/><p>It didn't seem logical at all.</p><br/><p>\"Sorry reporter Wang, I'm kinda busy now,\" Lin Fan smiled and said to Xiao Wang.</p><br/><p>Lin Fan had wanted to be interviewed properly so that he could complete the task to earn the Encyclopedic Points. But at that moment, the thing he had yearned for finally happened.</p><br/><p>After spending the entire noon on the Internet trying to increase his popularity, the task which required him to obtain 'a little popularity' was finally completed.</p><br/><p>The magical Encyclopedia then flipped to the second page.</p><br/><p>Just when Lin Fan read the content on the second page, he was stunned.</p><br/><p>\"You must be kidding me…\"</p><br/>\n</div>"}