{"title": "Chapter 18: A Little Loli Was Saved", "id": 18, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-18-a-little-loli-was-saved", "volume_title": "Volume 1", "body": "<h1>Chapter 18: A Little Loli Was Saved</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 18: A Little Loli Was Saved</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"What's wrong with my granddaughter?\" Aunt Zhang's expression had turned ugly. She was very displeased. Her good mood had been ruined by this youngster. If he didn't have a proper reason behind it, she was going to teach him a lesson.</p><br/><p>\"Aunt Zhang, from Pearl's face, I can tell that something bad will happen tonight. This ominous feeling… no, if you want to avoid it, it'd be best that you go out to have dinner tonight. Don't eat at home regardless of what happens.\"</p><br/><p>\"Note: If the host directly makes changes again…\"</p><br/><p>When Lin Fan heard this, he was startled. Crap! I've barely said anything and it says that I'm being too direct, he thought. Then, he proceeded to change the topic and speak more vaguely.</p><br/><p>\"Aunt Zhang, you believe this brat's blabbering? If it was me, I would give him 2 hard slaps right away. Isn't he cursing your granddaughter?\" At this moment, a Mediterranean man stood by the entrance of the apartment and glared at Lin Fan with disdain.</p><br/><p>It was his neighbor, Old Man Wang. Ever since Lin Fan moved in, they had been on bad terms.</p><br/><p>Aunt Zhang furrowed her brows. It seemed that Lin Fan wasn't being too friendly, and she was starting to feel that he was cursing her granddaughter too.</p><br/><p>Lin Fan took a glance at Old Man Wang and was furious, but he kept quiet and didn't bother to argue. After a moment, he looked over at Aunt Zhang again.</p><br/><p>\"Aunt Zhang, this isn't a joke, you have to believe me. This is about life and death and you have to be careful. Everything I said has a reason behind it, I'm not just making it up,\" Lin Fan said sternly.</p><br/><p>\"Haha, life and death my ass! You probably couldn't fit into the society in Shanghai and now you've gone crazy. Your mental illness must be pretty serious, for you to even try to bluff Aunt Zhang and curse her granddaughter,\" Old Man Wang insulted Lin Fan to his heart's content.</p><br/><p>Old Man Wang couldn't stand this youngster.</p><br/><p>Pale and delicate, with no sense of self-respect. He doesn't even greet me when he sees me. This kid obviously doesn't know what's good for him, thought Old Man Wang.</p><br/><p>In an instant, Old Man Wang's face lit up. He called out, \"Brother Mao, Brother Mao, come and take a look! This brat is cursing your daughter!\"</p><br/><p>At this moment, Pearl Mao's father who was riding his electric bike had just returned. When Old Man Wang saw him, he called out to him with a sadistic gleam in his eyes. Let's teach this brat a lesson, he thought.</p><br/><p>Pearl Mao's father, Mao Zhong Xing, worked at a nearby company. Coming home from work and seeing his Mom and Daughter standing by the road had him curious.</p><br/><p>However, when he heard Old Man Wang's words, he was slightly angry but didn't know what exactly was going on yet.</p><br/><p>When Mao Zhong Xing was young, he hung out with a bad lot and got involved in many fights and conflicts, and took part in many immoral activities. He slept with many different women as well. Eventually, he got arrested and put in jail for 2 years for some incident. After his release, he turned over a new leaf and got married to an honest woman. He taught himself some technical skills and became an IT (Information Technology) manager at a company.</p><br/><p>It wasn't enough to live a luxurious life, but he did manage to raise a healthy family, without having to worry about food or water.</p><br/><p>\"Daddy!\" Pearl Mao's face lit up when she saw him.</p><br/><p>\"What's going on, mummy?\" Mao Zhong Xing parked his electric bike by the side and hugged his daughter.</p><br/><p>Before Aunt Zhang could respond, Old Man Wang pointed towards Lin Fan and accusingly him, \"Brother Mao, this brat is saying that he knows fortune-telling to scare Aunt Zhang. He said something bad will happen to your Daughter tonight. Look how healthy she is, what could possibly happen? He must be trying to curse her!\"</p><br/><p>Mao Zhong Xing was very protective of his Daughter. When he heard this, he snapped, \"You f*cking brat, how dare you curse my Daughter! I'm going to give you a good beating!\"</p><br/><p>Bam!</p><br/><p>Suddenly, Mao Zhong Xing's kicked Lin Fan in his abdomen. Lin Fan couldn't react fast enough and before he knew it, he was kneeling over on the ground.</p><br/><p>F*ck… Lin Fan cursed in his mind. This f*cker here is kind enough to give you a heads up, but you repay me with a kick in the stomach.</p><br/><p>\"What are you doing, Zhong Xing?\" Aunt Zhang immediately tried to restrain him.</p><br/><p>This was Shanghai. If you assaulted someone and the police came, even if it was just some mild injury, you would have to pay at least a $2000 fine or spend a few months in jail.</p><br/><p>\"I'm warning you, brat. If you spout nonsense again, I'll kill you!\" Mao Zhong Xing barked viciously. His daughter was everything to him. He would never let anyone talk bad about her, let alone curse her.</p><br/><p>Lin Fan's temper was now at his limit as well, but seeing how Pearl had been frightened to the point of tears, he didn't want to cause her to be emotionally scarred. He looked over at Mao Zhong Xing.</p><br/><p>\"I'm just giving you a heads up. If you don't believe me, then so be it. When the time comes, even if you begged me, I won't be able to help you.\"</p><br/><p>\"You…\" Seeing how that beat still dared to talk, Mao Zhong Xing was just about to raise his fist and give him another beating, but his daughter, who was still in his embrace, started to cry.</p><br/><p>\"Fine, since you're so great, let's see. If nothing happens tonight, I want you to kneel before me tomorrow.\"</p><br/><p>\"Fine, we'll see who kneels down to who tomorrow.\" Lin Fan didn't want to argue further. His heart was filled with rage but he thought, \"Forget it, he'll be in tears tomorrow.\"</p><br/><p>\"Hehe!\" Old Man Wang was delighted, seeing how Lin Fan had taken a beating.</p><br/><p>Lin Fan gave Old Man Wang a glare but decided to let it go. He had just read Old Man Wang's fortune and saw that he would get beaten up the next day.</p><br/><p>Back in his house, Lin Fan laid on his bed, thinking about his future.</p><br/><p>\"This scallion pancake business can't be done regularly, and I need to find a better place to do my fortune-telling as well. Fraud Tian is always scamming people, but if I get him to help me to make a scene, that shouldn't be a problem.\"</p><br/><p>\"When I see him tomorrow, we can have a good chat.\"</p><br/><p>However, at this moment, what worried Lin Fan the most was whether or not Pearl would avoid the danger. Even though her father made him furious and he wanted to see her father kneel before him, that had nothing to do with the child. He knew that danger was imminent, yet he could only watch it happen. This was something that Lin Fan could not stand doing.</p><br/><p>\"Note: The host cannot personally intervene with heaven's will, or he will be instantly struck by lightning.\"</p><br/><p>Lin Fan barely thought of doing something, when the encyclopedia's distinct sound rang out.</p><br/><p>What a sh*tty day.</p><br/><p>It was 7 pm.</p><br/><p>In Aunt Zhang's home.</p><br/><p>\"Mummy, I'm going out later. I have an appointment with a friend. Tomorrow, I'll take care of that brat properly,\" Mao Zhong Xing grunted as he finished his dinner.</p><br/><p>\"Let it go, we're all neighbors after all. Maybe Lil' Fan doesn't mean bad at all,\" Aunt Zhang replied as she kept the dishes.</p><br/><p>\"Mummy, don't get involved in this. I'm going to leave now,\" Mao Zhong Xing's heart was still filled with rage. His precious and only child had been cursed by someone, how could he just let it go?</p><br/><p>When Mao Zhong Xing left, Aunt Zhang had finished keeping the dishes as well. She took out some color pencils for Pearl. \"Pearl, Granny is going to Granny Shen's house to play some mahjong. You stay at home and have fun drawing, okay?\"</p><br/><p>\"Mmhmm, I got it, Granny,\" Zhu Zhu picked up the color pencils, and then laid down on the table and started to draw.</p><br/><p>After that, Aunt Zhang left the apartment. She had locked all the windows and doors, to be safe.</p><br/><p>Time passed minute by minute, second by second.</p><br/><p>7.30 pm.</p><br/><p>Bang!</p><br/><p>Bam!</p><br/><p>Game over!</p><br/><p>A group of elderly ladies was engrossed in their game of mahjong, all smiles, and laughter.</p><br/><p>\"Old Man Zhang, what's the matter? You seem troubled.</p><br/><p>\"Yeah, weren't you fine just now?</p><br/><p>Aunt Zhang suddenly recalled what the youngster had said just a few hours ago.</p><br/><p>\"Aunt Zhang, I'm afraid something bad will happen to Pearl tonight. This ominous energy…\"</p><br/><p>Aunt Zhang couldn't sit still, something didn't feel right, so she stood up, \"Granny Shen, I have to go back to take a look.\"</p><br/><p>\"Ahhh, what's the matter with you, Aunt Zhang? That was only the first round!\"</p><br/><p>\"I have to go and check on my granddaughter, I'll be back in a bit,\" Aunt Zhang felt uneasy after thinking back about what the youngster said. Without saying much, she rushed straight to her apartment.</p><br/><p>On the way there, Aunt Zhang couldn't help showing signs of anxiety. She kept trying to comfort herself, That youngster Lil' Fan is just trying to scare me. There's no way this fortune-telling is real.</p><br/><p>\"Pearl! Pearl!\" Aunt Zhang started yelling as she reached the apartment door, but there wasn't any response from her granddaughter. The house was quiet.</p><br/><p>Bang!</p><br/><p>Aunt Zhang swung the door open, and suddenly, the pungent smell of smoke entered her nose.</p><br/><p>And with one scan across the living room, she saw her granddaughter lying motionlessly on the floor.</p><br/><p>\"Oh my god! Pearl!\" Aunt Zhang panicked.</p><br/><p>\"Help! Help!\"</p><br/><p>Aunt Zhang had a thunderous voice, and within seconds, her neighbors had all come out from their homes and frantically rushed towards the source.</p><br/><p>…</p><br/><p>And at this moment, Lin Fan stood in the shadows and watched from afar. He heaved a sigh of relief, then took a look at his watch.</p><br/><p>7.30 o'clock, they made it in time.</p><br/><p>According to his vision, Pearl was only discovered after 8 o'clock, but she would have already passed away at 8 o'clock.</p><br/><p>\"Who knew that fortune-telling would be so powerful. Not a minute early, not a minute late.\"</p><br/><p>...</p><br/>\n</div>"}