{"title": "Chapter 27: Weibo Problems", "id": 27, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-27-weibo-problems", "volume_title": "Volume 1", "body": "<h1>Chapter 27: Weibo Problems</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 27: Weibo Problems</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The higher the expectation, the greater the disappointment. Lin Fan thought that the residents would trust him a lot after the whole saga with Mr. Yang helping to advertise for him.</p><br/><p>But what made Lin Fan fed up was that all these residents were just asking about when they would win the lottery…</p><br/><p>Lin Fan finally understood that he over-thought too many things. Mr. Yang winning the lottery had such a great impact on them that besides winning the lottery, they did not care about anything else.</p><br/><p>\"The sky must be falling; how could these people be like that? Who's to say someone had to win the top prize every day? That's just luck, alright? Do you agree, Fraud Tian?\" Lin Fan sighed as he sat on the stool after everyone had left. He was exhausted.</p><br/><p>\"Fraud?\"</p><br/><p>Lin Fan shouted for a few times but did not get any reply. Then, as he turned behind, he only saw Fraud Tian's sly look as if he wanted a favor from him.</p><br/><p>\"Why are you looking at me for?\" Lin Fan asked.</p><br/><p>Then, Fraud Tian suddenly screamed. After that, he said softly, \"Don't tell me you managed to predict the winning ticket...\"</p><br/><p>\"Weren't you there on that afternoon?\" Lin Fan rebutted. He knew that even Fraud Tian wouldn't believe in what had actually happened.</p><br/><p>\"Could it be that there is really a divine fortune-teller in this world? Even the best and most renown fortune-teller from Lian Zhou, Mr. Wu Tian He is a fraud. If you're really able to fortune tell so accurately, you are destined to earn big money!\" Fraud Tian mumbled to himself and seemed a little agitated.</p><br/><p>\"Who is this Wu Tian He?\" Lin Fan asked.</p><br/><p>\"That's the most renown fortune-teller from Lian Zhou. Many court officials and superstars believe him. He's considered to be one of the best in this field of work,\" Fraud Tian said enviously.</p><br/><p>\"Looks like you envy him a lot. Why should you be so envious? I can be that f*cking awesome too. Now that I have $300,000, let's use it tomorrow to go look for him. Let's use an official way to expand our business.\"</p><br/><p>Lin Fan was now filled with noble aspirations. Although the knowledge he had in making scallion pancakes was all fraudulent, this second one was indeed decent.</p><br/><p>He could change someone's life in a sentence. If he had the opportunity to meet someone wealthy, he would have been able to earn big bucks.</p><br/><p>All Lin Fan wanted to do was to earn lots of money so that he could become the Master Lin that everyone respected and then unlock the second page of the encyclopedia. If he received another piece of godly knowledge, then his life would be changed for good.</p><br/><p>Fraud Tian listened to Lin Fan's perfect plan and was mesmerized by it as he thought of the luxurious life he was going to have in the future.</p><br/><p>....</p><br/><p>Lin Fan had packed up his stall early in the afternoon. When Lin Fan returned home, the neighbors welcomed him warmly.</p><br/><p>\"Lil' Fan… No, I mean Master Lin is back!\"</p><br/><p>\"Master Lin's fortune-telling is so d*mn accurate. Elder Zhang really fractured his leg today.\"</p><br/><p>\"Master Lin please look at us and read our fortunes.\"</p><br/><p>Lin Fan was so fed up with these neighbors but he realized that there was nothing more that he could've done. Elder Zhang did not believe in his words and he couldn't have forced him to do so.</p><br/><p>If the other party didn't want to believe him, he wouldn't have been able to help further. But these neighbors were pestering him for their fortunes to be read and that gave Lin Fan a headache. He had previously done it for them and there was nothing significant worth mentioning.</p><br/><p>\"Ladies and gentleman, I have already done it for all of you yesterday. There's really nothing much!\" Lin Fan said as he waved his hand as he tried to brush them aside.</p><br/><p>\"Ugh, we're begging you, Master Lin, please help us once more.\"</p><br/><p>\"Yeah, just once more! Do it more specifically for us.\"</p><br/><p>Lin Fan did not want to waste any more time on them, \"I'm exhausted, I will be busy with the opening of my fortune-telling stall. You guys can come show your support then!\"</p><br/><p>Lin Fan did not help them with another attempt at fortune-telling. They were all rather disappointed. If they had known that Lin Fan was so accurate, they would have paid more attention to him and let him have a more in-depth analysis that day. It was too late for them to regret.</p><br/><p>At some luxurious hall in the night, 8 pm.</p><br/><p>A group of wealthy and ruddy people walked out. The man who was walking in front of everyone else looked really depressed.</p><br/><p>\"Chief Wang, you lost quite a sum of money today. Don't take it to heart, let's play again next time when we have the chance,\" a man smiled and said.</p><br/><p>\"No problem, it's just small money,\" Wang Ming Yang replied with a half-smile. Although he did not seem like he cared about the money he had lost, he was actually furious.</p><br/><p>\"Of course, three million is indeed peanuts to Chief Wang.\"</p><br/><p>\"What's three million dollars to someone like Chief Wang? Anyway, guys, I'll leave first. I'll see you guys again soon!\"</p><br/><p>The people around Chief Wang all left one after another. When everyone was gone, Wang Ming Yang got into his car.</p><br/><p>\"Son of a b*tch, how dare they cheat my money.\"</p><br/><p>To Wang Ming Yang, three million dollars was indeed peanuts. But what infuriated him was the fact that the others had ganged up against him to win a fortune from him. If it was really based on luck, Wang Ming Yang would have had nothing to say but that was clearly a scam. That made him furious. Initially, Wang Ming Yang did not see through their tricks. Then, it got weirder and weirder. For someone like Wang Ming Yang who cared about his pride more than anything, he just continued to finish the game.</p><br/><p>If it was really based on luck or skills, he would have accepted the defeat. \"F*cking hell, take the three million and buy each of yourselves a coffin.\"</p><br/><p>When Wang Ming Yang had reached home, his butler had already prepared his meal.</p><br/><p>At the dining table…</p><br/><p>Wang Ming Yang whipped out his phone and read the news. Then, he opened Weibo and read a few messages. Just before he closed the app, there was a reply which he opened immediately.</p><br/><p>\"Huh?\"</p><br/><p>He was stunned by what he had seen.</p><br/><p>\"Gamble a little for fun; gamble frequently and you'll destroy your life. Also, you'll lose money tomorrow.\"</p><br/><p>Wang Ming Yang noticed that the reply was from the previous day. This made him extremely curious. How could the person have known that he was going to lose money the very next day?</p><br/><p>Then, Wang Ming Yang replied, \"When can I win money?\"</p><br/><p>Wang Ming Yang was not addicted to gambling but he wanted to test the powers of Master Lin. A short while after he had sent his message, Master Lin replied.</p><br/><p>\"Tomorrow afternoon, same place and position.\"</p><br/><p>When Wang Ming Yang saw the message, he smiled subtly and thought that it was impossible to be that accurate. But Wang Ming Yang wanted to see if it was really true.</p><br/><p>\"Alright, if I win tomorrow, I'll donate one million to you.\"</p><br/><p>He sent the message and exited the Weibo app. Then, he made a call to those that had played with him today to arrange for another game the next day.</p><br/><p>...</p><br/><p>Meanwhile…</p><br/><p>Lin Fan read the message and thought to himself, \"The wealthy are indeed domineering.\"</p><br/><p>Besides Wang Ming Yang, nobody else actually contacted for Lin Fan on the Weibo app. Indeed, it was pretty hard to socialize on Weibo. Lin Fan was really envious of Wang Ming Yang for having such an awesome life as he has so much money from his family's inheritance at such a young age.</p><br/><p>He's got such a valiant life.</p><br/>\n</div>"}