{"title": "Chapter 23: One for you, one for me", "id": 23, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-23-one-for-you-one-for-me", "volume_title": "Volume 1", "body": "<h1>Chapter 23: One for you, one for me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 23: One for you, one for me</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>At the roadside stalls.</p><br/><p>\"Hey youngster, why are you so kind-hearted today?\" Fraud Tian asked as he drank his beer. It was as if the sun had risen from the west. Lin Fan had always remembered the fact that he had been cheated of $100 but he still treated him to a mug of beer.</p><br/><p>Lin Fan thought that since he was going to become a Master, he would need followers in future. After all, Huang Tian Ming was already an experienced fraud and he had decent skills. If he could convince him to join him, then things would be better in future.</p><br/><p>\"Fraud Tian, full name: Tian Han Ming. 45 years of age, from Han Dong. You have two brothers and a sister. You're the oldest of them all and both of your parents are still alive. Lastly, you're still single and not married…\"</p><br/><p>Fraud Tian really didn't know what Lin Fan wanted; he just continued eating shelled peanuts. But when he heard Lin Fan's words, he was flabbergasted.</p><br/><p>\"Did you check up on me?\" Tian Han Ming was dumbfounded. He was shocked beyond words when Lin Fan managed to even recite his past happenings to him. That's literally impossible.</p><br/><p>Fraud Tian was shocked. He was also a 'fortune-teller'. Could it be that this man was an even better fraud than him?</p><br/><p>\"You said you're a fortune-teller?\" Fraud Tian said in disbelief. He was in the same trade and he knew that he had to base his assumptions on something; just like 1 + 1 = 2. They had a comprehensive list of principles when it came to fortune-telling. There was a fixed set of rules when it came to one's birth. Everything was written in there and one could discern it easily if they knew how to.</p><br/><p>\"You'd be able to take advantage of someone else with your legs later,\" Lin Fan smiled and said. Fraud Tian was in disbelief. Wasn't that bullsh*t? Taking advantage of someone with my legs? I'd rather use my hands.</p><br/><p>*slam*</p><br/><p>\"Brother Jun reserved this place today, please get out of here,\" a skimpily dressed girl with tattoo-covered arms walked towards them and said arrogantly.</p><br/><p>The small crowd of dispersed customers was from the same place of residence as Brother Jun. When they had heard his name, they were all shocked. Did they just mention Brother Jun, the leader of the biggest gang in their place of residence? It was Brother Wu Bao Jun.</p><br/><p>*Scuffling noises*</p><br/><p>Then, the small crowd of customers all left without saying much. The boss just nodded his head repeatedly upon hearing Wu Bao Jun's infamous name.</p><br/><p>*slam*</p><br/><p>The skimpily dressed woman slammed Lin Fan's table and the beer had spilled all over it. \"Get lost,\" she ordered. Then, she turned around to take orders from her leader and she started to prepare some things. Then, Lin Fan just smiled and asked, \"You can tolerate that?\"</p><br/><p>\"No…?\" Fraud Tian was furious. But they knew that this girl was so arrogant because she had a strong backing. They knew they couldn't start a fight with her.</p><br/><p>\"You see her ass? The left side's yours and right side's mine. Let's give her a kick and run away. How does that sound?\"</p><br/><p>\"Okay, let's do it,\" Fraud Tian said as he nodded.</p><br/><p>\"Okay, let's go.\"</p><br/><p>Then, Lin Fan stood up and settled the 'protection fees' with the woman as she stared at him fiercely.</p><br/><p>Lin Fan was extremely pissed at the way she was looking at him. If he had unlocked the page for martial arts, he would've kicked her in her boobs immediately. After paying the fees, Fraud Tian and Lin Fan stood together behind the woman. They looked at each other and thought of the same thing.</p><br/><p>\"1, 2, 3, kick!\"</p><br/><p>*slam*</p><br/><p>\"Ahh! Who's the b*stard that kicked me in the ass?!\"</p><br/><p>Lin Fan and Fraud Tian kicked her at each side and quickly ran away.</p><br/><p>\"B*tch, you better not get caught by me. If not I'll chop you up,\" the woman shouted with rage.</p><br/><p>The people that were walking past saw what had happened and started to laugh. By this time, Fraud Tian and Lin Fan had already run miles away.</p><br/><p>\"What the… You actually dared to do that?!\"</p><br/><p>\"Want to join me from now on?\"</p><br/><p>\"Okay, but how do we split the money?\"</p><br/><p>\"Monthly pay of $3000 with year-end bonuses,\" Lin Fan said.</p><br/><p>\"You're so heartless. My monthly income from the overhead bridge is not even this little,\" Fraud Tian complained.</p><br/><p>\"What am I?\" Lin Fan asked.</p><br/><p>\"A divine fortune-teller.\"</p><br/><p>\"That's right, I'm a divine fortune-teller. When my reputation increases in future, you'll receive more pay! There's plenty of money waiting for you.</p><br/><p>\"That's true. Fine, I'll do it,\" Fraud Tian said after he thought about it for a while.</p><br/><p>…</p><br/><p>At the small De Yuan district in Shanghai.</p><br/><p>This district in Shanghai was mainly in charge of administrative educational work. Their time belonged to the organization and they could only knock off from work after working hours. Yang Yong Kang had been standing for the whole day as he taught his students. He was a teacher in charge of a class and therefore he had more work to do than others. After a long day of work, he would return home exhausted.</p><br/><p>8:30 pm.</p><br/><p>Yang Yong Kang reached home and rinsed the vegetables that he had just bought, to prepare for dinner. Yang Yong Kang thought he could buy some scallion pancakes from the vendor outside Red Star Primary School but realized that his stall was already closed.</p><br/><p>9 pm.</p><br/><p>Yang Yong Kang ate his dinner alone and read the news on his phone. As he had been helping some of his students financially, he could only lead a simple life. He couldn't afford to eat and drink like a king but he was satisfied with just filling his stomach.</p><br/><p>His two children were working and studying at the same time while attending University. He only had to transfer a bit of money to them as they were capable of earning the rest on their own. Furthermore, they had a scholarship which considerably reduced the burden on Yang Yong Kang.</p><br/><p>It was 9:30 pm. He had finished his dinner and washed the dishes. He wanted to switch off the TV and go to bed but the TV screen attracted his attention.</p><br/><p>\"The first number is 02.\"</p><br/><p>\"04.\"</p><br/><p>\"12,\"</p><br/><p>\"04.\"</p><br/><p>\"12.\"</p><br/><p>Ball rolling sounds could be heard from the TV.</p><br/><p>\"The fourth number is 14.\"</p><br/><p>...</p><br/><p>\"The sixth number is 24.\"</p><br/><p>\"Then, for the last number… If one got all 7 matching numbers, he would win the top prize which was a $15 million dollars in cash.\"</p><br/><p> \"02,04,12....\"</p><br/><p>\"This is the most money that the dual-colored ball lottery has ever offered for the top prize.\"</p><br/><p>It was as if the host's voice had some kind of magical power over everyone. It attracted thousands upon thousands of people to witness the lottery results.</p><br/><p>\"02, 04, 12, …\"</p><br/><p>Then, Yang Yong Kang suddenly remembered the lottery ticket in his wallet. The numbers seemed a little familiar but he wasn't sure of it. The numbers were random and not chosen by him. Therefore he only took a glimpse of it and didn't pay close attention to it.</p><br/><p>He took the lottery ticket out of his wallet and matched the numbers with those on the TV. His suddenly lit up. Even his breathing rate had increased.</p><br/><p>The first six numbers are exactly the same! That…</p><br/><p>\"Alright, the last number is…\"</p><br/><p>6+1, if he could match all the numbers, he would win the top prize!</p><br/><p>Yang Yong Kang had never been interested in lotteries, but this time, he was on the edge of his seat. He held the lottery ticket tightly and waited patiently for the last number to be revealed.</p><br/>\n</div>"}