{"title": "Chapter 37: Let The News Spread", "id": 37, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-37-let-the-news-spread", "volume_title": "Volume 1", "body": "<h1>Chapter 37: Let The News Spread</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 37: Let The News Spread</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The shop didn't have any business.</p><br/><p>Lin Fan casually browsed through his WeiBo, which had been bombarded with hateful messages. But he wasn't bothered by it as if nothing was wrong.</p><br/><p>The more vicious the insults, the more shocking it would be in the end.</p><br/><p>Please carry on with your performance.</p><br/><p>At this moment, Lin Fan noticed that Fraud Tian was just sitting there rotating his wrists as if he was practicing martial arts. To Lin Fan, this Fraud Tian was just acting like a pretentious prick.</p><br/><p>\"What are you doing, fraud?\" asked Lin Fan.</p><br/><p>\"Practicing martial arts,\" Fraud Tian answered without looking. His face was stern, and he looked very different from usual.</p><br/><p>\"You?\" Lin Fan couldn't believe it.</p><br/><p>What a load of bullsh*t! Why would this fraud be practicing martial arts?</p><br/><p>Fraud Tian smiled smugly and then he ceased his martial arts practice, \"The Thirteenth Tian is here.\"</p><br/><p>Just as Lin Fan was about to say something, a little boy looked in sneakily from outside the window. He mustered up his courage and walked into the shop.</p><br/><p>\"Boss, I want a fortune reading.\" The boy looked 11 or 12 years old.</p><br/><p>\"What do you want to know?\" Lin Fan inquired with a smile.</p><br/><p>\"I have an exam tomorrow and I want to cheat. I want to know whether I would get caught,\" explained the boy.</p><br/><p>Lin Fan was surprised as he did not expect that, but since it was just a small matter, he decided to give it a shot.</p><br/><p>…</p><br/><p>\"Boss, will I really get caught?\"</p><br/><p>Lin Fan had read the boy's fortune but the result only made the boy more anxious.</p><br/><p>\"Of course, if you don't believe me, just try it tomorrow,\" answered Lin Fan with a chuckle.</p><br/><p>The little boy sighed, \"Looks like I'll come in last again.\" The little boy then took out $50 from his pocket and placed it on the counter.</p><br/><p>\"Keep the money, kid. This reading is free.\" When Lin Fan saw the $50, he was shocked for a moment.</p><br/><p>What a rich kid!</p><br/><p>The little boy waved his hand, \"I don't need it. It's just a small amount.\"</p><br/><p>Lin Fan stared blankly as the little boy walked away. After a moment, he started laughing to himself.</p><br/><p>\"Kids these days sure have a lot of money. Why don't we go and set up our stall at the primary school entrance? It's a good place to scam money,\" Fraud Tian suggested.</p><br/><p>\"What a great idea,\" Lin Fan remarked sarcastically as he rolled his eyes.</p><br/><p>…</p><br/><p>It was night time.</p><br/><p>Chen Xin Yi and Luo Dan went out for a feast to celebrate and when they got home, they were still ecstatic. Especially Luo Dan, who couldn't contain her excitement.</p><br/><p>\"Xin Yi, today was such an impactful day for me. At first, when I started arguing with that director, I was prepared to get punished by the company and forget my dream of becoming a star.\"</p><br/><p>Luo Dan never thought that there would be such a great change of events. This interview was very important as the company had gone through a lot of trouble to arrange it.</p><br/><p>When she couldn't control her emotions and started quarreling with the director, she had already prepared herself for the worst.</p><br/><p>But who would have thought that everything was seen by Teacher Tao.</p><br/><p>Right now, that memory was still fresh in her mind and she couldn't forget it even if she wanted to.</p><br/><p>\"Listen, Xin Yi, Huang Lu Hao's face turned white when Teacher Tao came. Especially when Teacher Tao pointed her finger at him, it was so intimidating,\" recounted Luo Han enthusiastically. She even started to imitate Teacher Tao.</p><br/><p>\"Huang Lu Hao, get out of my sight now! My novel doesn't need scum like you to have any involvement in it!\" Luo Dan raised her finger, imitating Teacher Tao's tone and expressions.</p><br/><p>\"Alright, alright, Luo Dan. Teacher Tao saw potential in us with one look, we can be main actors in the future,\" said Chen Xin Yi.</p><br/><p>\"But I can't accept it, you're acting as the main female character, while I'm second. I'm naturally gorgeous and full of passion. How could I be suppressed by an evil woman like you?\" Luo Dan said jokingly.</p><br/><p>\"What are you talking about? You've been eating and drinking the whole night while I've been paying the bills. Also, didn't Teacher Tao already say this? Your personality is most suited to the secondary female character,\" said Chen Xin Yi.</p><br/><p>\"Ahhh, success or failure all depends on one's nature. Why must my personality be similar to the secondary female character's? If only it was the main female character instead,\" Luo Dan said pitifully, as if she had been treated unfairly.</p><br/><p>\"Haha, that's all up to God's will and there's nothing you can do about it,\" said Chen Xin Yi.</p><br/><p>Suddenly, Chen Xin Yi jolted up abruptly.</p><br/><p>\"What are you doing, Xin Yi? You nearly scared me to death.\" Luo Dan nearly jumped up in response.</p><br/><p>\"Master Lin,\" Chen Xin Yi said in a serious tone. And without waiting for a reply, she took out her phone and opened Master Lin's WeiBo.</p><br/><p>Just as Xin Yi was thinking about expressing her gratitude to Master Lin, she was momentarily stunned.</p><br/><p>\"Luo Dan, look…\"</p><br/><p>\"What's the matter? But honestly, Master Lin's predictions are really...accurate.\" When Luo Dan saw Master Lin's WeiBo, her voice suddenly choked and she cried out in astonishment.</p><br/><p>The little white rabbit jumped out from the front of her chest.</p><br/><p>\"Damn, what kind of outrageous things must Master Lin have done for his WeiBo to be attacked by people like this?\" Luo Dan didn't care about anything else and only focused on the comments on Master Lin's WeiBo.</p><br/><p>\"Let me see.\"</p><br/><p>\"Xin Yi, I've found it. It turns out Master Lin left comments on many famous celebrities' pages. Moreover, all of his comments have been flagged.\"</p><br/><p>\"Look, this football star is flaming Master Lin\"</p><br/><p>\"This Zhou Li Yun is the headliner for China Fashion Week. She reported Master Lin's comment as well, and it's currently being processed.</p><br/><p>Chen Xin Yi and Luo Dan glanced at each other, with expressions of astonishment on both of their faces, \"Just how many people's fortunes had Master Lin read?\"</p><br/><p>\"Especially this incident about Chen Yu Fan being cheated on. Isn't that just asking for it? He would get scolded for sure!\"</p><br/><p>The two of them were lost for words. Chen Xin Yi had initially wanted to thank Master Lin, but the current situation was way beyond her expectation.</p><br/><p>\"Xin Yi, the circumstances don't seem right. If you were to leave a comment thanking Master Lin now, you would get flamed for sure. We can send him a private message instead!\" Luo Dan said.</p><br/><p>\"Alright,\" Chen Xin Yi nodded in agreement. On the internet, you could do almost anything you wanted, but one thing you mustn't do is to enrage the masses of internet users.</p><br/><p>Although Chen Xin Yi felt that Master Lin's predictions seemed like they were exaggerated to scare people, somehow she still believed that they were true.</p><br/><p>…</p><br/><p>In the house.</p><br/><p>Lin Fan was looking through WeiBo. He had been the topic of discussion on WeiBo for the whole day.</p><br/><p>Some guy with the username \"Autumn Sword Fish Killer\" was especially vicious with his comments about him.</p><br/><p>Private messages:</p><br/><p>Autumn Sword Fish Killer: \"Dumba*s Master, Iets have a fight. I'll show you my strength, you dumba*s.\"</p><br/><p>Autumn Sword Fish Killer: \"I'm telling you that everyone knows about you now. From today onwards, your WeiBo is dead.\"</p><br/><p>Autumn Sword Fish Killer: \"There's only one possible result if you challenge me. That is, you'll die a horrible death.\"</p><br/><p>…</p><br/><p>Autumn Sword Fish Killer had sent him a total of 30 private messages.</p><br/><p>Lin Fan couldn't resist much longer and he wanted to retaliate. But he decided to tolerate it for a little longer. The more he cared about it, the more insults he would receive. He would receive even more insults if he had cared more about it.</p><br/><p>But if this bloke appears before me, I'll send a fist flying towards him and beat him up till he goes home crying to his mother!</p><br/><p>*Ding*</p><br/><p>Another message came in.</p><br/><p>Lin Fan thought it was another hateful message, but when he clicked on it, he smiled.</p><br/><p>\"Master Lin, thank you so much. Today's interview was a huge success. If possible, could you add me on WeChat?\"</p><br/><p>Lin Fan: \"Sure thing.\"</p><br/><p>Spongebob Kawaii Pants: WeChat number g06XXXXXX.\"</p><br/><p>Lin Fan memorized the number. He closed WeiBo, and opened WeChat, then he keyed in the number. A Spongebob Squarepants icon appeared.</p><br/><p>When he sent the request, it was accepted within 3 seconds.</p><br/><p>Chen Xin Yi: \"Master Lin?\"</p><br/><p>Lin Fan \"Yep.\"</p><br/><p>Chen Xin Yi: \"Master, your reading was really accurate. Thank you so much, both my best friend and I passed.\"</p><br/><p>To Chen Xin Yi, a master diviner had to be very old to be able to make such accurate readings, but when she was browsing through Lin Fan's Moments, she was startled. She screenshotted the image.</p><br/><p>Chen Xin Yi: \"Master Lin, you're this young?\"</p><br/><p>Lin Fan: \"Yep.\"</p><br/><p>Lin Fan was acting like an aloof prince charming. He was conserving his words as if they were gold. However, he then thought that it wasn't good to act so aloof, so he added a sentence.</p><br/><p>Lin Fan: \"Even if you hadn't asked, both of you would still have passed. It's fate.\"</p><br/><p>Chen Xin Yi and her best friend lay on the bed as they stared at Lin Fan's photo, \"This Master Lin is so young, and he's rather handsome too! But he replies with \"Yep\" every time as if our beautiful Xin Yi can't even move his heart.</p><br/><p>\"Don't speak nonsense, Master Lin is a noble man. However, his WeiBo situation is rather scary. Why don't we ask him about it?\" Chen Xin Yi asked.</p><br/><p>She proceeded to send him a message.</p><br/><p>\"Master Lin, your WeiBo…\"</p><br/><p>Lin Fan: \"No worries. Let the news spread.\"</p><br/><p>Chen Xin Yi: \"...\"</p><br/>\n</div>"}