{"title": "Chapter 40: I Will Fight You to Death!", "id": 40, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-40-i-will-fight-you-to-death", "volume_title": "Volume 1", "body": "<h1>Chapter 40: I Will Fight You to Death!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40: I Will Fight You to Death!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>At some hospital ward...</p><br/><p>A shapely and tall woman was lying on the white hospital bed with a large and thick cast on her right leg.</p><br/><p>\"Sister Yun, don't think too much. There will always be another opportunity,\" her agent tried to console her.</p><br/><p>The accident was just down to bad luck. Rolling down from the stairs was already bad enough and to have fractured a leg made it even worse. With the huge cast on her right leg, it made it extremely difficult for her to move around, destroying any hopes of making it to the fashion show.</p><br/><p>Zhou Li Yun just lied there with tears streaming down her straight face.</p><br/><p>She had been preparing for the fashion show for quite some time and it had all gone to waste in a moment of folly.</p><br/><p>\"Sister Yun…\" her agent hurriedly passed her paper towels, without knowing how to console her.</p><br/><p>Suddenly, Zhou Li Yun said, \"Pass my phone to me.\" The agent did not know what was going on but just handed her phone over. All that was in Zhou Li Yun's mind was that Weibo text. When she had opened the app, the first thing she saw was, \"You can't make it there… You can't make it there.\"</p><br/><p>Zhou Li Yun knew about this Weibo text long ago. When she had first seen it, she did not think much of it. Naturally, she was unhappy about it and went to archive it. But when the accident really happened, Zhou Li Yun cried. The agent saw the message on Weibo and tried to console her by saying, \"Sister Yun, it must be blind luck, you can't believe in it.\"</p><br/><p>Zhou Li Yun shook her head in response. You gotta believe in these things sometimes. She had known that this Master Lin had left a message on many superstars' Weibo, but the first person to experience something negative was actually her. She was afraid other unlucky occurrences.</p><br/><p>\"It must have been Bei Li's foul mouth.\"</p><br/><p>...</p><br/><p>Meanwhile at a random house…</p><br/><p>Luo Dan was shocked and said, \"Xin Yi, look at this article. Master Lin had predicted Zhou Li Yun's absence at the upcoming fashion show.\"</p><br/><p>Chen Xin Yi was actually looking at her script but when she had heard the news about Master Lin, she immediately put down her treasured script and snatched her phone over to read the article.</p><br/><p>As she scrolled further, her mouth widened bigger. \"He really predicted it… Master Lin is so scary.\" Chen Xin Yi said in disbelief.</p><br/><p>\"It's not scary, it's god-like.\" Luo Dan said in disbelief as well.</p><br/><p>Ever since that incident, they were both labeled as 'actress 1' and 'actress 2'. Also, Teacher Tao's straightforward and direct working style made it such that when everything was fully prepared, they would immediately start filming.</p><br/><p>\"Go take a look at Master Lin's Weibo, those netizens that were scolding Master Lin must all be speechless now.\" Chen Xin Yi said.</p><br/><p>\"I already went to have a look. Master Lin is really a pro. He just lets them scold him and then goes on to prove people wrong with his actions.\"</p><br/><p>…</p><br/><p>Night time...</p><br/><p>Lin Fan came home from the stall and lied down on his bed while playing with his phone. \"Haha, now you know the power of Master Lin.\" Lin Fan said as he looked at his Weibo and smiled as if he had known this was going to happen.</p><br/><p>Zhou Li Yun's incident was the first of many to come. It would become more exciting as the others come true as well.</p><br/><p>Meanwhile in the Weibo app…</p><br/><p>\"Master Lin, you're indeed god-like. I believe you now.\"</p><br/><p>\"Master Lin, please help me out as well!\"</p><br/><p>\"Where did the haters go? What else can you say?\"</p><br/><p>\"To the guy above, looks like you're the fiercest here.\"</p><br/><p>\"*coughs*, staying low-key…\"</p><br/><p>Autumn Sword Fish Killer recently had a large-scale activity which involved writing for a superstar. This had caused many netizens to discuss it throughout the internet. It was well-liked by many people and was considered to be one of the best pieces of work he's done.</p><br/><p>Some of the netizens actually tried to challenge Autumn Sword Fish Killer, they are indeed fearless!</p><br/><p>When he had wanted to reward some of the netizens, he was taken aback by their discussion. \"Bad news, we've gotten smacked right in the face! Master Lin was right, Zhou Li Yun is injured and as a result, couldn't go for the fashion show.\"</p><br/><p>\"What the fuck, are you serious? Out of anger, I've written a few hundred bad comments on that guy's Weibo.\"</p><br/><p>\"Quick, tell Brother Autumn Sword, he has to know about this!\"</p><br/><p>\"We have contacted him. Look, Brother Autumn Sword is online!\"</p><br/><p>When Autumn Sword Fish Killer had read the messages, his big-sized body was fuming in anger. He involuntarily bit his fingernails of the hand that had been touching his feet.</p><br/><p>He had predicted it correctly. Now they're all cocky. But I am Autumn Sword Fish Killer, I have the power to change it all.</p><br/><p>\"I already know about this. Now, we have a mission. We have to put an end to all the discussions about Master Lin. If not, how can the Autumn Sword Army fight back from this?\" Autumn Sword Fish Killer immediately said.</p><br/><p>\"Follow the handsome Brother Autumn Sword.\"</p><br/><p>\"Let's begin the battle, to put an end to Master Lin's Weibo.\"</p><br/><p>…</p><br/><p>In an instant, countless netizens flooded Lin Fan's Weibo.</p><br/><p>\"It's just blind luck, as for Zhou Li Yun's leg, she was already injured. No big deal.\"</p><br/><p>\"He just managed to predict one event correctly, what about the remaining ones?\"</p><br/><p>\"What the person above said is very true.\"</p><br/><p>\"Logical, perhaps he really guessed blindly.\"</p><br/><p>...</p><br/><p>Lin Fan was actually looking at the haters repenting on his Weibo. But he realized that something was wrong. His Weibo was being taken over again. Then, someone messaged him privately. Lin Fan was furious when he took a look at it.</p><br/><p>Autumn Sword Fish Killer said, \"How is it, my Master Lin? My Sword Fish Army is strong, right? Let me tell you, as long as I'm here, your Weibo will never be the same again.\"</p><br/><p>\"Retarded,\" Lin Fan replied instantly.</p><br/><p>When Autumn Sword Fish Killer saw his reply, he got even angrier.</p><br/><p>Autumn Sword was so angry that he had activated all his fanboys to oppress Lin Fan's Weibo. It became a lasting battle for the fanboys. Then, Lin Fan replied with another message and he also sent out a screenshot of Autumn Sword Fish Killer's private message.</p><br/><p>\"Just wait and see; hello to all the fanboys out there.\"</p><br/><p>In an instant, the Weibo text got countless comments. Lin Fan's fan base on Weibo had increased up to ten thousand people. To Lin Fan, it was a tremendous improvement. When Autumn Sword Fish Killer saw the Weibo text, he exploded with rage.</p><br/><p>\"F*ck, how dare you go against me? I swear I will do everything I can till you die.\"</p><br/><p>*crashing sound*</p><br/><p>Just when Autumn Sword Fish Killer was raging, the stool that he was sitting on had broken due to his oversized body. He fell butt first onto the ground. The large impact caused squeezed something out from his body…</p><br/><p>\"Damn it…\"</p><br/><p>The next day…</p><br/><p>Something happened which shocked everyone.</p><br/><p>Lin Fan was in his stall when he read the news. He just laughed it off as if it did not bother him at all.</p><br/><p>But for those netizens had been watching Lin Fan's Weibo closely, it was more than a piece of shocking news.</p><br/><p>...</p><br/>\n</div>"}