{"title": "Chapter 67: It's Good That You Understand the Logic", "id": 67, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-67-its-good-that-you-understand-the-logic", "volume_title": "Volume 1", "body": "<h1>Chapter 67: It's Good That You Understand the Logic</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 67: It's Good That You Understand the Logic</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The shopping centre.</p><br/><p>First floor.</p><br/><p>The men’s bathroom.</p><br/><p>\"Ah! That feels good!\" Lin Fan’s legs were getting a little numb. He had been squatting for at least twenty minutes. His thighs felt like they were on fire. He had to get up soon.</p><br/><p>This shopping centre was a good location. Lin Fan had thought of opening his fortune telling shop here once, but he didn’t have the finances to do so.</p><br/><p>At that moment, someone called out Lin Fan’s name.</p><br/><p>\"Young Fan!\"</p><br/><p>Lin Fan was startled. Who was it?</p><br/><p>The nickname ‘Young Fan’ was his nickname in high school.</p><br/><p>Lin Fan was pleasantly surprised as he turned around. \"Big Tree…\"</p><br/><p>The man in front of him was tall, dark and handsome.</p><br/><p>He never thought that he would meet one of his better friends from high school in the shopping mall.</p><br/><p>\"Ah, Young Fan! It really is you! I didn’t recognize you at first.\" Yan Shu Ren excitedly said. He couldn’t believe that it was his good friend from high school.</p><br/><p>Both of them were good friends in high school. But after they went on to university, they weren’t as close as they used to be.</p><br/><p>Although they didn’t contact each other often, they would still meet up every school holiday at Lin Fan’s house.</p><br/><p>\"Big Tree, you should have told me that you were coming over to Shanghai! I would have brought you around!\" Lin Fan laughed as he said, turning to look at the two girls and one guy behind him.</p><br/><p>\"And who are these three?\" Lin Fan asked.</p><br/><p>\"Young Fan, this is my girlfriend Chen Mei Tong. The other girl is her best friend and this dude is her boyfriend.\"</p><br/><p>\"All looking good!\" Lin Fan said.</p><br/><p>\"Hey fill me up! What are you doing in Shanghai?\" Yan Shu Ren laughed as he asked.</p><br/><p>\"Nothing much, just opened a shop over at Cloud Street passing my days. You’re here on vacation?\" Lin Fan asked cheerily.</p><br/><p>\"You can say that.\" Yan Shu Ren congratulated Lin Fan. \"I didn’t do very well in my exams, so I’m here to look for a job. Just so happens that my girlfriend’s best friend’s boyfriend is quite familiar with the city.\"</p><br/><p>Lin Fan found the situation rather interesting.</p><br/><p>\"Xiao Yan, we should get going.\" Zhang Guo Yang said annoyed, as he stood there. He sized up Lin Fan and gave him a death stare. Lin Fan didn’t want anything to do with that guy.</p><br/><p>Wang Xiao Yan and Chen Mei Tong were best friends, she managed to find a boyfriend with a car and an apartment. She followed him everywhere he went. Not wanting to anger him, she pulled on Chen Mei Tong’s sleeve, motioning her to leave.</p><br/><p>\"Big tree, if you have anything to attend to, please go and do so. I’ll leave you my number and if anything hit me up.\" Lin Fan said.</p><br/><p>\"Alright, we should meet up once I’ve settled down here.\" Yan Shu Ren was annoyed that he had to leave after such a short time of meeting his old friend. What was the hurry? Yan Shu Ren passed his phone number to Lin Fan.</p><br/><p>\"Young Fan, I’ll take my leave.\" Yan Shu Ren said as he waved back.</p><br/><p>Lin Fan grinned at him.</p><br/><p>Lin Fan walked back to his shop after Big tree left.</p><br/><p>...</p><br/><p>\"Big Tree, who’s your friend?\" Chen Mei Tong asked him softly. She met him at university. She didn’t have any self-interest in Lin Fan. She just wanted to know her boyfriend’s friends a little better.</p><br/><p>She looked for her best friend to help Yan Shu Ren. Chen Mei Tong didn’t think much of it at first, but then she started to feel a little uncomfortable.</p><br/><p>Wang Xiao Yan’s boyfriend kept on pressuring Chen Mei Tong’s boyfriend. He seemed to look down on him.</p><br/><p>Although she was her best friend, Chen Mei Tong started feeling like Wang Xiao Yan forcefully dragged her along. It made her feel uncomfortable,</p><br/><p>\"Didn’t he say just now? He opened a shop at Cloud Street.\" Yan Shu Ren replied.</p><br/><p>Chen Mei Tong didn’t ask anymore.</p><br/><p>\"Big Tree, although you’re a university grad, Shanghai is a whole new ball game. I’ll bring you around. Soak it all in.\" Zhang Guo Yang said proudly.</p><br/><p>Yan Shu Ren laughed awkwardly.</p><br/><p>Chen Mei Tong wasn’t looking too good.</p><br/><p>Wang Xiao Yan beamed at her boyfriend with an air of pride.</p><br/><p>...</p><br/><p>The city folk were anxiously waiting for Lin Fan. If he hadn’t come back soon enough, they would probably have gone to the shopping mall to haul him back.</p><br/><p>After tending to all of them, the city folk made their way. Lin Fan stood in front of the counter, tidying things up a little as he prepared to rest.</p><br/><p>A black Cadillac rolled down Cloud Street.</p><br/><p>Wang Xiao Yan pointed at the shop front. \"Hey Big Tree, take a look. Isn’t that your classmate? He’s selling scallion pancakes.\"</p><br/><p>\"Ha, this guy really knows how to blow his trumpet. Just a pancake seller and he claims to have opened his own shop?\" Zhang Guo Yang said arrogantly as he drove his car down the street.</p><br/><p>The atmosphere in the car was a little oppressive. After Wang Xiao Yan’s vanity complex was satisfied, things eased up a little.</p><br/><p>\"Mei Dan, you and your boyfriend should treat Guo Yang and me to a nice meal. That UV shop looks pretty good.\"</p><br/><p>\"Alright, alright...\" Chen Mei Tong’s mood wasn’t right. She blindly agreed without knowing what a UV shop was.</p><br/><p>...</p><br/><p>Night time!</p><br/><p>It was another uneventful day at work. Lin Fan didn’t know what to do about the city folk who just wanted to eat his scallion pancakes.</p><br/><p>‘My fortune telling abilities are the best, yet you guys only know how to eat. What a heartbreaker.’ Lin Fan thought.</p><br/><p>At that moment, his phone rang. It was Yan Shu Ren.</p><br/><p>\"What’s up Big Tree?\" Lin Fan said cheerily.</p><br/><p>\"Young Fan, let me treat you to a meal.\" Yan Shu Ren said.</p><br/><p>\"Oh you don’t have to. Let me treat you instead!\" Lin Fan replied.</p><br/><p>\"You can do that next time. Meet me at a diner called UV. It’s located at Middle Mountain Road. I’m on my way now, although I don’t exactly know where it is. Just come here first, I’ll call you later.\"</p><br/><p>\"Oh? UV diner? I know where it is. I’ll be there.\" Lin Fan faintly remembered that restaurant. \"You don’t have to worry about me. I just closed shop, will be there soon.\"</p><br/><p>Click.</p><br/><p>\"Fraud Tian, I’ll be off first. Can you help me to lock up?\" Lin Fan asked.</p><br/><p>\"Ah. Have fun with your friend. I’ll just go home, alone, and eat my porridge while you dine like a king\" Fraud Tian eavesdropped on his phone conversation with Shu Ren. He wished Lin Fan would bring him along as well.</p><br/><p>\"At least you understand that this is a special occasion. At least you aren’t stupid. I’m gonna go off first, please remember to lock the door.\" Lin Fan took his car keys and walked over to his car before driving off.</p><br/><p>The red wine and sprite cocktail there was not too bad.</p><br/><p>But he didn’t think it was anything special the last time he drank it.</p><br/><p>This time his friend was treating him, so he’d better moderate his spending a little.</p><br/>\n</div>"}