{"title": "Chapter 65: Could These Celebrities Please Take Note?", "id": 65, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-65-could-these-celebrities-please-take-note", "volume_title": "Volume 1", "body": "<h1>Chapter 65: Could These Celebrities Please Take Note?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 65: Could These Celebrities Please Take Note?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>It was nighttime.</p><br/><p>​</p><br/><p>A Weibo post reached the trending page.</p><br/><p>​</p><br/><p>The person who wrote the post was a young person who didn't have many followers on Weibo. However, it attracted a lot of attention when he mentioned Master Lin in the title.</p><br/><p>'The demonic scallion pancakes came from Master Lin, and the audience's reactions deserve an Oscar'</p><br/><p>​</p><br/><p>A small, insignificant post had over seven hundred thousand comments in just a day, almost hitting eight hundred thousand.</p><br/><p>​</p><br/><p>Steven0625: \"What in the name of heaven? A fortune teller that sells scallion pancakes? How much did he pay the people to react? Their reactions looked almost real.\"</p><br/><p>​</p><br/><p>Wind Bridge Night Anchor: \"Master Lin is all hype. Once the hype dies down, he'll find new ways to promote himself. This is absurd.\"</p><br/><p>​</p><br/><p>XiaMao: \"I was with the crowd when they saw Master Lin. Their acting ability was phenomenal. I certainly couldn't have acted like that. I wonder where they hired the actors from.\"</p><br/><p>​</p><br/><p>Most of the Weibo users took this as a joke, and whoever believed it was seen as an idiot</p><br/><p>​</p><br/><p>Helpless Without Love: \"This whole thing has been exaggerated. It's just a scallion pancake. He must be trying to attract attention again.\"</p><br/><p>The netizens thought of the situation as a joke.</p><br/><p>​</p><br/><p>Pro Fisher, 'Garlic Paste': \"You guys shouldn't be in disbelief. Master Lin is actually very accurate at fortune-telling. I ate his scallions pancake today and I must say it was absolutely delicious. You'll regret it if you don't try it. I'm already addicted to it, and I'm gonna queue up for it first thing tomorrow morning.\"</p><br/><p>​</p><br/><p>Wind Bridge Night Anchor in response to Pro Fisher, 'Garlic Paste': \"I know you're getting paid to say this. You should stop doing it, otherwise, I'll wreck you and your taste buds.\"</p><br/><p>​</p><br/><p>King Clown A: \"You guys should believe Pro Fisher, 'Garlic Paste'. Master Lin is really that awesome and his fortune-telling is very accurate. Although I have never eaten his scallion pancakes before, I was passing by and the fragrance was out of this world.\"</p><br/><p>​</p><br/><p>Not long after.</p><br/><p>A heated argument started in the Weibo comments.</p><br/><p>A third of the people believed that it was real while another third didn't believe in it. The remaining third was neutral about the situation.</p><br/><p>​</p><br/><p>Lin Fan was at home scrolling through his Weibo page. When he saw himself in the headlines, his reaction was neutral, as if nothing happened.</p><br/><p>​</p><br/><p>A number of netizens were discussing the issue on their own Weibo pages, talking about the all the possible conspiracy theories.</p><br/><p>​</p><br/><p>Over the past few days, Lin Fan had experienced how sweet success felt.</p><br/><p>​</p><br/><p>And in these few short days, his salary skyrocketed to seventy thousand dollars.</p><br/><p>​</p><br/><p>The old Lin Fan could have never imagined this. Ever since after he obtained the Encyclopedia, everything in his life had changed for the better.</p><br/><p>​</p><br/><p>It was rather satisfying to continue selling scallion pancakes. His Encyclopedic Points had also increased quite a lot too.</p><br/><p>​</p><br/><p>In the past, when he sold scallion pancakes, the townsfolk didn't really pay attention to him.</p><br/><p>Now, they had to understand the scallion pancake knowledge before he would sell them the scallion pancakes</p><br/><p>​</p><br/><p>After selling enough scallion pancakes, he would be able to unlock different types of knowledge classes. When that happens...hehe, it will be unimaginable.</p><br/><p>​</p><br/><p>At that moment, Lin Fan posted something on Weibo.</p><br/><p>​</p><br/><p>\"My main business is fortune telling and my side business is selling scallion pancakes. If you want to taste the world's most delicious scallion pancakes, come down now to Cloud Street, block number 8861.\"</p><br/><p>​</p><br/><p>It immediately got a few comments after Lin Fan pressed enter.</p><br/><p>​</p><br/><p>The most eye-catching comment was by Autumn Sword Fish Killer. He burst out, aggressively flaming Lin Fan.</p><br/><p>Seeing his comment, Lin Fan couldn't help but shake his head feeling disappointed. I'll just let him continue in his madness…</p><br/><p>​</p><br/><p>Lin Fan had a few private messages in his inbox, and one of them caught his eye.</p><br/><p>The name sounded like a celebrity that he knew. Lin Fan initially thought it was a fake account, but after scanning through the profile, he realized that it was the real person.</p><br/><p>\"Master Lin, can I ask you to read my fortune?\"</p><br/><p>​</p><br/><p>Seeing it's content, Lin Fan couldn't help but chuckle. He replied, \"If you want a reading you'll have to come to my doorstep, I don't accept Weibo fortune telling requests anymore.\"</p><br/><p>​</p><br/><p>Just as Lin Fan was about to close his Weibo page, the celebrity replied him.</p><br/><p>​</p><br/><p>\"Do you know who I am? I'm Wang Hua, the celebrity. It's not appropriate for me to show up in public.\"</p><br/><p>​</p><br/><p>Lin Fan was overjoyed, and immediately replied, \"Do you know who I am? I'm Master Lin, and It's not appropriate for me to read anyone's fortune on Weibo. If you want to get your fortune read, come down to my shop and get a queue number. But there is no guarantee that you'll be selected.\"</p><br/><p>​</p><br/><p>The celebrity replied, \"Hehe!\"</p><br/><p>​</p><br/><p>Lin Fan was wary every time he saw 'hehe' being used. It could have been used sarcastically to scold people.</p><br/><p>​</p><br/><p>How could these celebrities, who were always on top of the trends, not know what the two words mean?</p><br/><p>​</p><br/><p>Lin Fan couldn't take it. He immediately replied, \"I bought a watch last year[1].\"</p><br/><p>​</p><br/><p>Celebrity: \"What do you mean by that? How can you scold people like that.\"</p><br/><p>​</p><br/><p>Lin Fan: \"I really bought a watch last year.\"</p><br/><p>​</p><br/><p>Celebrity: \"…\"</p><br/><p>​</p><br/><p>Lin Fan didn't feel like talking to the celebrity. He was only a hyped up celebrity with no substance. He was just looking for trouble.</p><br/><p>​</p><br/><p>Not long after, Lin Fan found himself tagged in a post by the celebrity.</p><br/><p>\"So this is the legendary Master Lin. He really does have substance.\"</p><br/><p>​</p><br/><p>The celebrity posted a screenshot of their chat along with the post. It attracted a lot of attention from Weibo users. At first, Lin Fan wanted to ignore it and let it slide, but the celebrity had made the issue personal and didn't resolve it amicably.</p><br/><p>​</p><br/><p>\"A certain celebrity who is way past his prime should take note: don't think that you can pull your status with me just because I got on the headlines. I treat everyone equally. @TheWorstCelebrityOnEarth.\"</p><br/><p>​</p><br/><p>Lin Fan immediately received a barrage of comments after sending out that post.</p><br/><p>​</p><br/><p>\"6666… The worst celebrity on earth is the 'Legendary General' Wang Hua\"</p><br/><p>​</p><br/><p>\"That's right. These celebrities really are shameless. They decide to cause a ruckus just because Master Lin got onto the headlines.\"</p><br/><p>​</p><br/><p>\"This Wang Hua, I absolutely detest him. He is a terrible hypocrite.\"</p><br/><p>​</p><br/><p>\"Recently, his career has been going down in the slumps. No wonder he went to Master to read his fortune, thinking that he will receive a good reading.\"</p><br/><p>​</p><br/><p>\"Master Lin is a man of principle.\"</p><br/><p>​</p><br/><p>Sitting in his grand mansion, Wang Hua was absolutely furious. F*cking Master Lin, just you wait…</p><br/><p>​</p><br/><p>…</p><br/><p>​</p><br/><p>Lin Fan sat in front of his computer and he was extremely bored. Defending himself was a very natural thing to do, no matter against a celebrity or not.</p><br/><p>​</p><br/><p>His phone rang. As he glanced at the caller ID, it was someone very familiar - his mother.</p><br/><p>​</p><br/><p>\"Yes, mum? What's up?\" Before obtaining the Encyclopedia, Lin Fan had found life to be hopeless and he always thought of going home.</p><br/><p>​</p><br/><p>\"How's everything out there?\" Mother Lin asked.</p><br/><p>​</p><br/><p>\"Rest assured, I'm doing fine. I'll pop by home in October,\" Lin Fan said gleefully.</p><br/><p>​</p><br/><p>\"Don't overwork yourself. If you can't handle things out there, there's always a place for you to rest at home,\" Mother Lin said.</p><br/><p>\"Mum, you're underestimating me! Rest assured, I'll give you a big surprise when I come back home in October,\" Lin Fan said cheerfully.</p><br/><p>\"What kind of surprise? Can't you say it now? Is it that you finally have a girlfriend?\" Mother Lin chuckled.</p><br/><p>​</p><br/><p>\"Don't ask too much, you'll see it when I come visit you guys.\"</p><br/><p>​</p><br/><p>\"Okay, okay, I won't ask too much. Please sleep well and eat more. I can imagine that you're really malnourished right now. Oh, when you get back I'll cook a feast for you!\"</p><br/><p>​</p><br/><p>...</p><br/><p>​</p><br/><p>After chatting for a while longer, Lin Fan put down the phone and charged it before turning in for the night.</p><br/><p>[1]: This is a phrase used by netizens to curse others. In Chinese, it sounds similar to another phrase meaning 'f*ck your mom'.</p><br/>\n</div>"}