{"title": "Chapter 78: Awe-struck", "id": 78, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-78-awe-struck", "volume_title": "Volume 1", "body": "<h1>Chapter 78: Awe-struck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 78: Awe-struck</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Brother, I am here.\" Wang Ming Yang just walked into the shop, took a chair and sat down.</p><br/><p>Lin Fan just smiled, \"An honorable guest indeed. What brings you here today?\"</p><br/><p>Fraud Tian quickly poured a few cups of tea and placed them on the table.</p><br/><p>Wu Yun Gang entered the shop and looked around. He realized that it had nothing special. At the same time, he saw that the Master Lin that Brother Wang had been talking about was actually a young chap. If it was in the past, he wouldn't have believed him. But now, he did.</p><br/><p>\"Hello, Master Lin.\" Wu Yun Gang was an arrogant man but he was polite to Lin Fan.</p><br/><p>Technically, Lin Fan had not helped him before, but Lin Fan had given him an indirect warning before. He could only blame himself for not listening.</p><br/><p>Lin Fan looked at Wu Yun Gang and nodded, \"Please have a seat.\"</p><br/><p>Wang Ming Yang had brought Wu Yun Gang just to see if it was even possible to save him, even though they had to be a little shameless about it.</p><br/><p>Wu Yun Gang sat beside Wang Ming Yang. Nobody would've thought that this small shop would be visited by two multi-billionaires. If they were robbed and kidnapped, the robbers would've become filthy rich.</p><br/><p>\"This time, I brought Brother Wu here to let you have a look to see if there's any way that we could help him,\" Wang Ming Yang said. He was a sincere and loyal friend. He would help his friends no matter how impossible the situation may seem.</p><br/><p>Lin Fan just smiled and said, \"You should know my rules here.\"</p><br/><p>Wang Ming Yang smiled awkwardly and said, \"Of course I know your rules. I didn't mean to make things difficult for you. I personally brought him here to see if we could talk something out.\"</p><br/><p>He knew Lin Fan's rules and knew how he was like. It wouldn't be easy to convince him to change the rules. But since these rules were man-made, he just had to try his luck.</p><br/><p>\"Master, what rule is it? If it's impossible to change them, I can follow the rules.\" Initially, Wu Yun Gang hadn't believed in fortune-telling. He had worked so hard for his whole life and all he depended on was his guts and hard work. He resented those who cheated their way through fortune-telling just to make money.</p><br/><p>But after this incident, he knew that this person recommended by Wang Ming Yang was a remarkable man. To put it in their own terms, Lin Fan was their noble savior. Lin Fan looked at Wang Ming Yang and at the same time, he didn't know whether to laugh or cry about it. He was such a rich man and when he decided to be shameless, it was really quite scary.</p><br/><p>\"You're not a bad person, you're just too arrogant. Since these rules are set by me, we won't follow them today but you can't tell anyone.\" Lin Fan said.</p><br/><p>Wang Ming Yang smiled and gave him a thumbs up. \"Brother, I like that spirit.\"</p><br/><p>Lin Fan shook his head and said, \"Never again\".</p><br/><p>\"Don't worry, just this time. Next time, even if it is me, I will follow the rules and queue up.\" Wang Ming Yang said.</p><br/><p>Wu Yun Gang realized that Master Lin was looking closely at his face. He also studied his palms. \"You're destined to have great fortune.\" Lin Fan said calmly, he wanted to show that he was serious about it.</p><br/><p>Wu Yun Gang smiled bitterly, \"Master, how am I lucky? I am so unfortunate all the time.\" he said. A loss of over a few billion made him feel extremely down. He couldn't even cry even though he was depressed.</p><br/><p>Lin Fan raised his head and said, \"Believe it or not, you'd never be able to get a smooth and successful life all the way. This was a huge loss for you, but it's the only big problem that you'll face in your life.\"</p><br/><p>Wang Ming Yang listened attentively as he sat beside him. Then he interrupted, \"You mean he will overcome this setback and be successful again in future?\"</p><br/><p>Lin Fan just smiled and didn't say much. If he was to say even more, he would be at risk of being struck by lightning.</p><br/><p>\"Chief Wu, you have a 28-year-old lover right?\" Lin Fan asked.</p><br/><p>Wu Yun Gang was stunned. He hadn't expected Master Lin to know that. He hadn't even told anyone about it.</p><br/><p>Wang Ming Yang saw how Wu Yun Gang accepted it with silence and was shocked. He said, \"Brother, if your wife finds out about this, things would be out of control.\"</p><br/><p>\"Sigh, I'm just a man. Sometimes, it's hard to control. A Master indeed, he even knows about this.\"</p><br/><p>Lin Fan blinked several times and said, \"I didn't say it to expose you.\"</p><br/><p>Wu Yun Gang furrowed his brows and was confused. He asked, \"Master, what do you mean by that?\"</p><br/><p>\"Your motive of coming here today was to get a solution but I'm telling you whatever that's happening now is related to her.\"</p><br/><p>\"Your lover took the initiative to get together with you, right?\" Lin Fan asked. Wu Yun Gang nodded and said, \"Yeah, I met her at a wine reception two years ago. This investment project was also by her…\"</p><br/><p>Then, Wu Yun Gang abruptly raised his head in disbelief. \"Master, it can't be, can it? She also lost everything in this project.\" Wu Yun Gang said in shock. Wang Ming Yang was a little confused and he asked, \"Brother, what's her name?\"</p><br/><p>\"Wang Mei Hong.\" Wu Yun Gang said.</p><br/><p>\"D*mn, it's her after all. She tried to convince me to join this project too.\" Wang Ming Yang said angrily. Then, he slapped his thigh and cursed, \"F*ck! Brother, you should've told me you had a lover. Then, this might not have happened.\"</p><br/><p>\"I knew it, it was an investment project for the Beijing. Why would she even look for me?\" Wang Ming Yang said.</p><br/><p>Lin Fan shrugged his shoulders and took a sip of his tea. He didn't bother to explain further since they all understood what had happened.</p><br/><p>Then, Lin Fan took out his phone and opened an app. \"Two hours later, there will be a flight to the Beijing. Do you want to go back first?\"</p><br/><p>Wu Yun Gang was dumbfounded. Just a reminder by Lin Fan and he was awakened.</p><br/><p>\"Yes, I have to rush back. It's no wonder that she has been behaving strangely recently. She said she was in debt and had to use these funds to pay them back. I think she just wanted to run away.\"</p><br/><p>Wu Yun Gang held onto Lin Fan's hands tightly and sincerely said, \"Master, thank you. Thank you so much. I will remember this and I'll come back again once everything is settled.\"</p><br/><p>Then, Wu Yun Gang just took out a credit card from his pocket and said, \"Master, this does not represent my respect and admiration for you. I won't say anymore, I have to rush back.\"</p><br/><p>Lin Fan just kept the card as he felt that he deserved it for helping him. Wang Ming Yang stood up, patted Lin Fan on his shoulders and said, \"Brother, I'm impressed. I will send him to the airport and come back for a chat with you.\"</p><br/><p>\"Whatever you decide to do, you must not hurt her.\" Lin Fan reminded him. Wu Yun Gang just nodded and left.</p><br/><p>After they left, Lin Fan looked at the credit card that he had left behind. Fraud Tian came over and asked, \"How much is there inside it?\"</p><br/><p>\"Do you want to know?\" Lin Fan smiled and asked.</p><br/><p>\"Yeah,\" Fraud Tian immediately nodded and said.</p><br/><p>Lin Fan then opened the banking app and keyed in the details to check the account balance. When Fraud Tian saw how much money there was, he was shocked beyond words.</p><br/><p>\"Haha,\" Lin Fan just smiled. How awesome.</p><br/>\n</div>"}