{"title": "Chapter 95: Can we not talk about Scallion Pancakes?", "id": 95, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-95-can-we-not-talk-about-scallion-pancakes", "volume_title": "Volume 1", "body": "<h1>Chapter 95: Can we not talk about Scallion Pancakes?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 95: Can we not talk about Scallion Pancakes?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Wang Yu Chen's Weibo.</p><br/><p>Autumn Sword Fish Killer had completely overrun her Weibo. All the comment sections were flooded by Autumn Sword Fish Killer's troll army.</p><br/><p>Autumn Sword Fish Killer was really deserving of his reputation. When he gave the command, whatever came out of it was of a huge magnitude.</p><br/><p>\"Pretty face, nice voice. But too bad… you are liked by the wrong person.\" Autumn Sword Fish Killer was beginning to feel a little guilty for trolling her, but he knocked himself back into sense as soon as he thought of persecuting the fraud.</p><br/><p>\"I don't care if you're innocent or not. Since you've walked down this path, you shall bear the wrath of Autumn Sword Fish Killer!\"</p><br/><p>Suppress her!</p><br/><p>Suppress her completely!</p><br/><p>The entire troll army got into action and started searching for more information about Wang Yu Chen.</p><br/><p>He was getting ready for war. As the Chief of the Internet trolls, he had power that no one else could comprehend.</p><br/><p>In a certain music studio.</p><br/><p>Wang Yu Chen was practicing her new song while Ying Jin sat there evaluating her.</p><br/><p>\"Yu Chen, your voice needs to be gentler for the third verse of the song, like this…\" Although Ying Jin didn't look like much, she was actually exceptionally talented. She could identify all the areas that needed improvement just by hearing once.</p><br/><p>Yu Chen nodded as she sang the song again. There was definitely an improvement.</p><br/><p>Ying Jin was considered the queen of the music industry. She managed to get her hands on all the good songs. The songs that Wang Yu Chen sang all came from Ying Jin's songwriter, who was a cut above the rest.</p><br/><p>\"The competition is in two days time. No matter what, you cannot make any mistakes. If you don't make any mistakes, the victory will definitely be yours.\" Ying Jin said.</p><br/><p>She hadn't thought that Wang Yu Chen would make a mistake in the round of 24, but she didn't care that other people called her unfair when she called for a tie.</p><br/><p>However, she didn't dare to give the points that would have made Wang Yu Chen win. Otherwise, a huge uproar would have ensued.</p><br/><p>\"Okay. I got it, Auntie.\" Wang Yu Chen replied.</p><br/><p>\"Call me teacher,\" Ying Jin reminded her.</p><br/><p>Wang Yu Chen nodded. \"Yes, teacher.\"</p><br/><p>\"Good, take a break now.\" Ying Jin said.</p><br/><p>Wang Yu Chen laid on the sofa. If she wasn't practicing her singing, she would be using her phone.</p><br/><p>At that instant, she cried out in surprise.</p><br/><p>\"Why are there so many negative comments on my Weibo?\" Wang Yu Chen looked stunned.</p><br/><p>Before she had started practicing, she had posted a Weibo which got a few likes and encouragements. But after her practice, she found out that people were slandering her Weibo page.</p><br/><p>Ying Jin furrowed her brows as she looked at her page. \"This is the work of Internet trolls.\"</p><br/><p>Even though she was experienced in this industry and occasionally encountered internet trolls, she was still stunned when she saw the comments.</p><br/><p>\"I told you guys. Ying Jin wouldn't give up the idea of having a successor. It is no wonder that this is the reason. Just take a look at this link.\"</p><br/><p>\"What a dirty little secret. Ying Jin and Wang Yu Chen are relatives. Why can't Ying Jin have some shame?\"</p><br/><p>\"One made a mistake, the other was perfect. Yet, they called for a draw. The result tells us the power of having a relative in the judging committee.\"</p><br/><p>\"These two people are very shady.\"</p><br/><p>\"She sang so terribly but she still advanced. Go home!\"</p><br/><p>\"Ying Jin is such a b*tch. Looking at her makes me want to vomit.\"</p><br/><p>…</p><br/><p>Autumn Sword Fish Killer had mobilized the full force of his troll army and was looking for information they could exploit. What they found was that Ying Jin and Wang Yu Chen were related. This was big news! He couldn't hold this information to himself any longer and immediately released it into the Internet.</p><br/><p>If you want to destroy someone, you've got to do it fast. With me, Autumn Sword Fish Killer, around, the end can only be miserable.</p><br/><p>Wang Yu Chen started getting anxious. \"How could they say that about me?\"</p><br/><p>Ying Jin's blood was boiling, but years of dealing with her haters allowed her to remain calm. \"Ignore the trolls. Just practice your hardest and perform your best on the day of the competition. Just take all these comments with a pinch of salt.\"</p><br/><p>Wang Yu Chen didn't have the resolve of Ying Jin. She might have nodded her head in agreement, but she still felt perturbed by the comments on her Weibo.</p><br/><p>Autumn Sword Fish Killer sat at home, scanning Wang Yu Chen's Weibo. He gave a twisted grin. This is just the beginning, there's more to come…</p><br/><p>*Ding!*</p><br/><p>Another private message.</p><br/><p>Autumn Sword Fish Killer laughed at the sender and his belly started to jiggle. His fat buttocks were compressed to a clump as he enveloped the chair. Truth be told, his buttocks were the envy of many men. They were thick, fleshy and soft.</p><br/><p>They were domineering.</p><br/><p>Opening the private message.</p><br/><p>Lin Fan: \"You're going overboard! You even dared to wreck a girl's Weibo. No wonder you can't get a girlfriend, loner.\"</p><br/><p>Autumn Sword Fish Killer burst with rage as he saw the private message. His efforts had not produced the results he wanted, with Lin Fan just casually flipping him off. This b*stard even dares to talk back.</p><br/><p>Despicable. Absolutely despicable.</p><br/><p>Autumn Sword Fish Killer: \"Get the f*ck away. Wang Yu Chen will be absolutely wrecked by me. Just you watch.\"</p><br/><p>In the car.</p><br/><p>Lin Fan was innocent. This issue of Wang Yu Chen's Weibo getting trolled was completely Autumn Sword Fish's doing. It didn't have anything to do with him.</p><br/><p>Lin Fan closed his Weibo and continued driving.</p><br/><p>...</p><br/><p>The Internet was bubbling with activity.</p><br/><p>At first, it had been Teacher Qi Ming's case of angrily leaving the stage after dropping the microphone in the competition 'The New Voice'. The next was the little secret between Wang Yu Chen and Ying Jin.</p><br/><p>These two pieces of news were hotly discussed on the internet, with Han Lu's scandal closely following behind in terms of popularity.</p><br/><p>The headlines.</p><br/><p>'Identity of mysterious man who refused to take up the challenge against Han Lu revealed.'</p><br/><p>'The mysterious man's occupation is…'</p><br/><p>The netizens were enraged as they saw the headlines.</p><br/><p>What the heck was that?</p><br/><p>\"Holy sh*t… I never thought that the mysterious man would be this young.\"</p><br/><p>\"Brilliant! Who exactly is this guy who has people going nuts over his scallion pancakes?\"</p><br/><p>\"Can we discuss the issue of why this mysterious man refused the challenge against Han Lu?\"</p><br/><p>\"Are you stupid? Can't you see that this mysterious man has no time to fight since he's selling scallion pancakes?\"</p><br/><p>\"D*mn, this is my first time seeing somebody give that kind of expression after eating scallion pancakes. Is it really that good?\"</p><br/><p>\"Can everyone be a little more serious? We're talking about whether Chinese martial arts are legit, not about scallion pancakes.\"</p><br/><p>\"Those scallion pancakes are out of this world. If you look closely at the presentation, the skill needed to prepare the shape of the scallion pancake, you can tell it isn't your everyday scallion pancake.\"</p><br/><p>\"You bunch of b*stards, can you guys stop talking about the bloody scallion pancakes?\"</p><br/><p>\"D*mn, which journalist took all these pictures? The expressions of the people look almost over exaggerated.\"</p><br/><p>Everyone realized that the headlines and the comments were talking about completely different things.</p><br/><p>The subject was martial arts, but the comments were about scallion pancakes.</p><br/><p>Was there a mistake?</p><br/><p>Han Lu's Weibo page.</p><br/><p>The Weibo users were commenting on his page.</p><br/><p>\"Han Lu, you got KO-ed by a scallion pancake seller. What do you have to say for yourself?\"</p><br/><p>\"I never thought that the expert martial artist would be a scallion pancake seller.\"</p><br/><p>\"666…You can't even defeat a scallion pancake seller, just give up fighting.\"</p><br/><p>Han Lu kept on waiting for the latest news.</p><br/><p>After seeing the piece of news, Han Lu was confused and, at the same time, seethed with rage.</p><br/><p>D*mn it. God d*mn it!</p><br/><p>Scallion pancakes?</p><br/><p>Mystery man?</p><br/><p>The mystery man is a scallion pancake seller?</p><br/><p>Defeated and dismissed.</p><br/><p>These words were haunting Han Lu.</p><br/><p>At this moment, Han Lu burst with rage.</p><br/><p>Lin Fan was also dumbfounded when he saw the headline.</p><br/><p>\"Since when did I say all these words? All these d*mned reporters, making a mountain out of a molehill…\"</p><br/><p>…</p><br/>\n</div>"}