{"title": "Chapter 96: I’m reporting a fight!", "id": 96, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-96-i%E2%80%99m-reporting-a-fight", "volume_title": "Volume 1", "body": "<h1>Chapter 96: I’m reporting a fight!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 96: I’m reporting a fight!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Chinese Martial Arts Association.</p><br/><p>\"Good, good. He's young and shows promise.\"</p><br/><p>\"What a talented young man. How can he only sell scallion pancakes? We must get him to join the association.\"</p><br/><p>\"This young man is so full of life, yet he is so low-profile\"</p><br/><p>\"Notify the guys over at Shanghai. We've gotta invite him to come over no matter what.\"</p><br/><p>\"We know. We've sent people already.\"</p><br/><p>...</p><br/><p>Team Han Lu.</p><br/><p>\"This guys is too arrogant for his own good...\"</p><br/><p>\"Although Brother Han was defeated by him that day, it's because Brother Han wasn't feeling right that day.\"</p><br/><p>\"How good can a scallion pancake seller be?\"</p><br/><p>\"It must be the press that over exaggerated this situation.\"</p><br/><p>\"Shameless!\"</p><br/><p>\"Despicable!\"</p><br/><p>...</p><br/><p>The general masses.</p><br/><p>\"666...This young man knocked the living daylights out of Han Lu.\"</p><br/><p>\"The master presents himself as an ordinary person. There is no shame in losing.\"</p><br/><p>\"This is absolutely radical!\"</p><br/><p>\"I feel like eating the scallion pancakes after seeing them.\"</p><br/><p>\"Can we not bring up the topic of scallion pancakes? This discussion is on martial arts only.\"</p><br/><p>\"What a beautiful scallion pancake. Just looking at it makes my mouth water.\"</p><br/><p>\"Screw you guys.\"</p><br/><p>...</p><br/><p>The next day!</p><br/><p>Cloud Street.</p><br/><p>Lin Fan sat in his shop. The people had accepted the events that had happened yesterday. Little Boss didn't even hesitate to leave the shop. And he didn't even show up again.</p><br/><p>Fraud Tian emphasized his agony to Lin Fan, \"You've gotta at least give me a warning that you were going to make a run for it. Yesterday was absolutely terrible after you left.\"</p><br/><p>Lin Fan chuckled, \"The feeling of being mobbed by that many people must feel good, right?\"</p><br/><p>Fraud Tian rolled his eyes, \"Feels good my a*s! My OPPO phone almost got destroyed by the people.\"</p><br/><p>Looking at the date, it seemed that Wu Tian He and her father would arrive any time soon. But he wasn't sure if they were on the road or if they had already reached Shanghai.</p><br/><p>When Wu Tian He arrives, the busy days would finally be over. Lin Fan's workload would decrease too.</p><br/><p>\"What's all this ruckus?\" Fraud Tian asked suspiciously. He walked over to the door and got a shock. \"Oh no, those guys are here.\"</p><br/><p>Lin Fan sighed in despair. Can't these people give me some breathing space?</p><br/><p>Outside.</p><br/><p>A group of reporters gathered. They were interviewing a man at that moment.</p><br/><p>\"I'm here to issue a challenge to him,\" Han Lu said aggressively. The reporters were getting excited. This was going to be huge news.</p><br/><p>Han Lu had come personally to issue a challenge. It was all up to Lin Fan to accept it.</p><br/><p>The surrounding shop owners all stood outside their shops.</p><br/><p>\"Looks like Master Lin has another busy day ahead of him.\"</p><br/><p>\"Busy my a*s! These guys are looking for trouble.\"</p><br/><p>\"Everyone, gather around! Master Lin is the superstar of Cloud Street, he won't let us down so easily.\"</p><br/><p>\"Come, come. Let's gather and get Master Lin to come out.</p><br/><p>The other shop owners who were outside their shops rallied together, cheering for Lin Fan to come out.</p><br/><p>Although Lin Fan had never really interacted with the shop owners before, he was still very well liked by the other shop owners. This was because, with Little Boss around attracting more customers, they also got more business.</p><br/><p>Fraud Tian was stunned. \"What do we do now?\"</p><br/><p>Lin Fan felt helpless. \"What else can we do? We'll see what they want.\" </p><br/><p>With the reporters egging him on, Han Lu stood at the door, his eyes bloodthirsty. He scanned the area before finally locking his stare at Lin Fan.</p><br/><p>\"You!\" Han Lu would never forget Lin Fan's face. He gripped a piece of paper with a challenge written on it. \"I challenge you to an official fight. The rules, time, and location are all up to you.\"</p><br/><p>\"An official fight?\" Fraud Tian lit up when he heard it. It had been so long since he had heard someone issuing an official challenge.</p><br/><p>With the change of era, the scene of fighting also changed along with it. Fights these days were done in arenas or cages, and Fraud Tian hadn't fought since in one of those before.</p><br/><p>The reporters snapped a few pictures, capturing the historic moment.</p><br/><p>Lin Fan casually sipped his tea as he replied, \"I do not accept your challenge.\"</p><br/><p>An uproar ensued.</p><br/><p>The reporters had never thought that the situation would end up like this.</p><br/><p>Han Lu furrowed his brows. Ever since he had gotten knocked out by this b*stard, he had become the laughing stock of the Internet. If he didn't clear his name, he could never live with it.</p><br/><p>\"Why? Are you scared that I'll beat you until you're on all fours?\"</p><br/><p>Lin Fan looked at Han Lu and calmly asked, \"Even if you beat me, what will you prove?\"</p><br/><p>\"I'll prove that you're just all show and no substance. I'll prove that you're a fraud,\" Han Lu replied.</p><br/><p>\"I'm only a fortune-teller. Do I have to look for other fortune-tellers to challenge them and prove that they are nothing but frauds?\"</p><br/><p>\"Don't talk so much bullsh*t! Do you accept my challenge? If you don't accept it, please announce in front of the reporters that you're just a fraud and not worthy to be my opponent,\" Han Lu rebutted.</p><br/><p>The crowd couldn't accept it.</p><br/><p>\"Why are you so aggressive? You have already been beaten by Master Lin once. Why would he want to fight you again?\"</p><br/><p>\"Yeah. You got knocked out that day. What else is there to prove?\"</p><br/><p>\"Master Lin doesn't have to accept your challenge. He can just knock you out right here and right now, and let you leave shamefully. You don't have to be so arrogant and aggressive.\"</p><br/><p>\"Yeah, yeah.\"</p><br/><p>Lin Fan felt helpless. Their comments were only making things worse.</p><br/><p>At this moment, a truck pulled up in front of his shop. </p><br/><p>\"Who is Han Lu?\" a loud booming voice emanated. A man wearing sports attire came out of the truck and walked over.</p><br/><p>The reporters rushed forward and crowded the man, throwing a storm of questions at the man.</p><br/><p>\"I am Li Da Fei of Wushan. I challenged you on Weibo a few times, but you never responded since you only fight pushovers. So I've come down today to beat you, to let you know my strength.\" Some of the townsfolk didn't know who Li Da Fei was, but some of the reporters did.</p><br/><p>\"Li Da Fei of Wushan, a practitioner of the Iron Fist, with the ability to break rocks and crush cobblestones. He has received a few awards before and is truly a talented martial artist.\"</p><br/><p>\"How exciting! This is simply too exciting! Li Da Fei versus Han Lu. I didn't think such a big thing would happen.\"</p><br/><p>Evidently, the appearance of Li Da Fei attracted the attention of many reporters.</p><br/><p>Lin Fan was overjoyed. He never thought someone would save him from his predicament.</p><br/><p>Han Lu looked at Li Da Fei before bursting into laughter. \"I don't recognize you at all. I don't want to fight you. Only him.\" Han Lu said as he turned his gaze back to Lin Fan.</p><br/><p>Li Da Fei had brought a few of his disciples along to cheer him on.</p><br/><p>\"Han Lu, you're scared of my master, aren't you?\"</p><br/><p>\"My master challenged you over Weibo a few times, yet, you seemingly avoided him. You must be scared of him!\"</p><br/><p>Li Da Fei motioned for his disciples to stop their provocation. \"I won't hurt you. I will fight you fairly. If you lose, you may never boast of your prowess again. If I lose, I will concede and become your follower.\"</p><br/><p>Han Lu hadn't accepted his challenge.</p><br/><p>The reporters all began to whisper amongst themselves.</p><br/><p>\"Han Lu can't really be this scared of Li Da Fei, can he?\"</p><br/><p>\"It's hard to say. Li Da Fei was featured on China Central Television before and has a few awards under his belt. He really is something else.\"</p><br/><p>\"Could what Li Da Fei said just now be true? That Han Lu only picks fights with pushovers?\"</p><br/><p>\"That seems to be true.\"</p><br/><p>\"It really might be true. Li Da Fei challenged him to fight over Weibo a few times, yet Han Lu just ignored him. I wonder if he has any secrets to hide, or if he wants to hype this fight up. It wouldn't make much news if he just got beaten.\"</p><br/><p>The young and rash Han Lu couldn't take all the speculation that was buzzing over his head. \"Fine, I'll fight you right here, right now!\" Han Lu snapped.</p><br/><p>\"Good.\" Li Da Fei's muscles twisted and contorted like steel ropes as he ripped off his shirt. Although he wasn't exactly very young anymore, his body was still something other people could only dream of.</p><br/><p>Lin Fan and Fraud Tian looked at each other.</p><br/><p>\"This Li Da Fei has true abilities,\" Fraud Tian quipped.</p><br/><p>\"Really?\" Lin Fan raised a brow.</p><br/><p>\"Mmm,\" Fraud Tian nodded.</p><br/><p>The surrounding townsfolk were awestruck.</p><br/><p>\"D*mn, this guy's so old but he's ripped. So cool!\"</p><br/><p>\"Looks like this guy has real talent! Who is this guy?!\"</p><br/><p>\"I did a search on him. He's one of a kind. He started training when he was a little kid, and can even break a cobblestone into half with his bare hands!\"</p><br/><p>\"I did a search on him too! He's quite extraordinary!\"</p><br/><p>…</p><br/><p>Lin Fan whipped out his phone at that moment.</p><br/><p>\"What are you doing?\" Fraud Tian asked.</p><br/><p>\"I'm calling the police. As a concerned citizen, this kind of illegal fights in broad daylight should be reported.\"</p><br/><p>Fraud Tian was stunned.</p><br/><p>\"Hey, Chief Liu. I want to make a police report. There's a fight breaking out along Cloud Street and things are getting out of hand. Yes, it's disrupting the peace here and may be detrimental to the security around here.\"</p><br/><p>\"Great, you'll get a better picture when you get here. There are also reporters here. If news of this were to get out, I fear that the outcome won't be good.\"</p><br/><p>After hanging up.</p><br/><p>Lin Fan dragged a stool over and joined the crowd to watch the fight even though he was a little hesitant.</p><br/><p>Although Han Lu and Li Da Fei were strong, they completely lacked any sense.</p><br/><p>Fighting in broad daylight! This was Shanghai, an international hub! If news of this gets out, the repercussions would be devastating.</p><br/><p>One should be humble and learn to cultivate patience and character.</p><br/>\n</div>"}