{"title": "Chapter 100: Joining the Association", "id": 100, "volume": 1, "url": "http://boxnovel.org/a-valiant-life-chapter-100-joining-the-association", "volume_title": "Volume 1", "body": "<h1>Chapter 100: Joining the Association</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 100: Joining the Association</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>In the shop.</p><br/><p>Wu Tian He asked, \"Master Lin, what will I be doing daily?\"</p><br/><p>In order to change his daughter's fate, Wu Tian He was willing to give up everything he had back in Lian Zhou as long as he could let her have a good life.</p><br/><p>Lin Fan smiled and said, \"It's simple. Just read the fortunes of ten people every day.\"</p><br/><p>Wu Tian He was also a formidable fortune-teller, otherwise, he wouldn't have become the President of the Metaphysics Association. Although this appointment didn't seem like a major one to the commoners, he was like a God to those that studied Metaphysics.</p><br/><p>\"I understand,\" Wu Tian He nodded and said. He read the fortunes of very few people these days as he was afraid that he might get into trouble if he revealed too many secrets. However, now that Master Lin had requested his help, he did not decline his request since he knew that Master Lin had no intentions of harming him.</p><br/><p>\"If you have trouble with some people, you can just speak to me. I will read their fortunes for you,\" Lin Fan said. Wu Tian He had no Encyclopedia and naturally, he wasn't able to deal with major issues like Lin Fan. However, he should have no problem resolving minor ones.</p><br/><p>Wu You Lan stood there and asked, \"What about me?\"</p><br/><p>Lin Fan looked at Wu You Lan and paused for a moment. She was really pretty and it would do no harm for her to just stand around in the shop. \"It's even simpler for you. You just have to do some housekeeping to keep the shop neat and tidy. Also, you have to welcome the customers when they enter the shop. Other than that, there's nothing much for you.\"</p><br/><p>Three pages of the Encyclopedia had already been unlocked and the fortune-telling task had already been completed. But the shop had already been opened and it wasn't logical for him to close the shop so soon.</p><br/><p>On lucky days, he was able to gain one or two Encyclopedic Points from making scallion pancakes. Although it wasn't much, it served as a sustainable influx of Encyclopedic Points.</p><br/><p>Furthermore, Lin Fan did not want to work so hard for the Encyclopedic Points. He wanted to have a peaceful and carefree life.</p><br/><p>Any page of the Encyclopedia was sufficient to grant Lin Fan immense power. If he were to specialize in a particular one, who knew how powerful he would become? But what's the point of working your a*s off when you could just have a simple life and be happy? Lin Fan was having such a carefree and happy life.</p><br/><p>\"Wait for me,\" Lin Fan said. Then, he rushed out of the shop and looked at the poster for a short while. He was holding on to a small signboard as he rushed out of the shop. Lin Fan placed it on the table and looked at it with a face full of satisfaction.</p><br/><p>\"Look at it, what do you think?\" Lin Fan smiled and asked as if he was very proud of what he had done. Fraud Tian and the rest took a good look at the signboard.</p><br/><p>'Master Lin's first disciple</p><br/><p>Wu Tian He</p><br/><p>President of the Metaphysics Association'</p><br/><p>Wu Tian He looked at it and smiled. He was already so old and he was not bothered by the nickname that he had been given.</p><br/><p>\"I think it looks good,\" Wu Tian He said. But if his followers were to find out about this, they might become so enraged that they would vomit blood. They had just gotten a new Grandmaster without any prior notice. Furthermore, Lin Fan was so young.</p><br/><p>If it was really true, they would need to call Lin Fan 'Grandmaster' in future.</p><br/><p>This was unacceptable to them unless they wanted to disrespect their Master's teachings.</p><br/><p>Fraud Tian was in awe as he witnessed what had happened. Then, he pestered Lin Fan and said, \"What about me…?\"</p><br/><p>\"There is one for you. Don't be anxious, look,\" Lin Fan said as he took out another signboard. Fraud Tian smiled and said, \"Not bad, this signboard looks good.\"</p><br/><p>'Master Lin's second disciple</p><br/><p>Tian Han Ming</p><br/><p>Member of the Master Lin shop'</p><br/><p>\"Master Wu, we're going to be fellow disciples from now on. Please teach me your ways,\" Fraud Tian said. Although he was full of tricks and lies, he was earnestly interested in fortune-telling.</p><br/><p>Although Lin Fan wouldn't teach him anything, learning from Wu Tian He was not bad at all. Perhaps he would have the chance of becoming a master fortune-teller in future.</p><br/><p>Wu You Lan sighed. If those uncles and aunties see this, they would definitely cry.</p><br/><p>Her dad had become someone else's disciple in such an unofficial way. Furthermore, her dad didn't even look unhappy about it.</p><br/><p>Wu Tian He wasn't bothered by it as he was convinced of Master Lin's abilities. Even if he really became the disciple of Master Lin, he would have no objections. Lin Fan clapped and said, \"Alright, that's it for our small group. Let's do a good job and we can split the year-end bonus.\"</p><br/><p>\"Oh, right. This is your tag. Just hang it on yourself,\" Lin Fan took out another tag and passed it to Wu You Lan.</p><br/><p>'Wu You Lan</p><br/><p>Receptionist for Master Lin's shop'</p><br/><p>When Wu You Lan saw the tag, she was speechless.</p><br/><p>Lin Fan was in a good mood, \"Alright, as my workers, you will have welfare benefits. Today, I will let you taste my famed scallion pancakes.\"</p><br/><p>He immediately went to the cart and made three scallion pancakes.</p><br/><p>Even though they tasted heavenly, he didn't even want to eat them. Even he wouldn't be able to resist revealing those ridiculous expressions if he ate them.</p><br/><p>Fraud Tian said, \"After so long, I haven't tried these scallion pancakes yet. Usually, when I see people eat them, it looks like they're extremely tasty.\"</p><br/><p>\"Come, have a try,\" Lin Fan said confidently. Wu Tian He, her daughter, and Fraud Tian took a good sniff of the pancakes before they took a bite.</p><br/><p>Then, the shop became extremely silent while Lin Fan proudly watched their expressions. Wu Tian He suddenly became invigorated. It was such a unique feeling and he started to think of beautiful memories.</p><br/><p>*patter*</p><br/><p>Two drops of tears dripped down.</p><br/><p>Fraud Tian exclaimed, \"These pancakes are too good. I… I…\"</p><br/><p>He couldn't even finish his sentence as he lowered his head and froze. The taste of the pancakes made him think of the times when he practiced martial arts under the hot sun with his father.</p><br/><p>Although he got beaten up quite badly, those were the happiest days of his life.</p><br/><p>Wu You Lan just started to blush, as if she was in a burning room.</p><br/><p>Lin Fan just laughed as he thought, This is my ultimate move that nobody can escape from - the magical scallion pancakes. From now on, the fan base of my scallion pancake lovers will have three more people.</p><br/><p>Then, a noise came from outside.</p><br/><p>\"Master Lin, someone's looking for you. I brought him here for you,\" a shop owner brought someone into the shop.</p><br/><p>Lin Fan asked, \"You are?\" He really didn't know who it was.</p><br/><p>As the person came in, he immediately grabbed Master Lin's arms and said, \"Nice to meet you, Master Lin. I am Jiang Fei, from Shanghai's Chinese Martial Arts Association.</p><br/><p>\"Nice to meet you,\" Lin Fan said politely as the other party was also courteous. \"Have a seat,\" Lin Fan added.</p><br/><p>However, Fraud Tian and the rest were still dumbfounded by the scallion pancakes and they were rooted to the seats. Hence, there weren't any empty seats left.</p><br/><p>Jiang Fei looked at the three of them and said, \"Master Lin, it's okay. I'll just stand and talk.\"</p><br/><p>Master Lin nodded and said, \"Alright, what are you here for?\"</p><br/><p>The Shanghai Chinese Martial Arts Association was part of the National Chinese Martial Arts Association. It was a regional division. The headquarters were located in the capital and Lin Fan could roughly guess what was going on.</p><br/><p>Although Lin Fan was a young chap, Jiang Fei did not belittle him. They had studied the video for a long time and they concluded that his skills were indeed real. Then, Jiang Fei said, \"Master Lin, on behalf of the Shanghai Martial Arts Association, I hope you can join us.\"</p><br/><p>Lin Fan was elated. He hadn't expected it to happen just as he had thought. But he was in a dilemma as the Chinese Martial Arts Association didn't have a very good reputation.</p><br/><p>\"I know this may be a little too sudden but we are sincere in recruiting you into our big family,\" Jiang Fei said.</p><br/><p>Lin Fan hesitated for a moment, then said, \"I don't have any real skills and besides, I have a proper job too.\"</p><br/><p>\"You're too modest. If you don't have real skills, then nobody does. Furthermore, we won't interfere with your work. You can come down to our Martial Arts Association any time. It's located in Shanghai. It's pretty nearby,\" Jiang Fei said sincerely. He was very impressed by Lin Fan's skills. At the same time, he was surprised at how humble and modest he was.</p><br/><p>Since he had already put it that way, what else could Lin Fan have said? Besides, it wouldn't bring any harm to him if he were to join the Chinese Martial Arts Association. Everyone had the responsibility to raise awareness for their national culture and to preserve it. He could even earn Encyclopedic Points from it!</p><br/><p>Lin Fan replied, \"Sure, but if there are any activities and I'm not free on that day, I won't participate in them.\"</p><br/><p>Jiang Fei was ecstatic, \"You don't have to worry about that. The Association will not force you to go for them.\"</p><br/><p>Then, Lin Fan filled in the form with his particulars. Jiang Fei was extremely happy to have recruited him. \"Master Lin, when the documents have been processed, I will bring the certificate to you,\" Jiang Fei said excitedly.</p><br/><p>When Jiang Fei left, Lin Fan just smiled to himself. He really hadn't expected himself to be recruited by the Chinese Martial Arts Association. It was a pretty great feeling.</p><br/><p>But as he turned to look at Fraud Tian and the two other people, he was taken aback.</p><br/><p>Just a single scallion pancake made them act as if they had eaten sleeping pills. Unbelievable.</p><br/>\n</div>"}