{"title": "Chapter 114: Things have gotten out of hand", "id": 114, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-114-things-have-gotten-out-of-hand", "volume_title": "Volume 2", "body": "<h1>Chapter 114: Things have gotten out of hand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 114: Things have gotten out of hand</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The netizens all had a heart for those who got treated unfairly or bullied.</p><br/><p>For example, if a normal citizen went to hit a bad person from a random agency, the netizens would be full of praise for the citizen.</p><br/><p>Every one of them had a heart for the weak and this news together with the Han Lu incident had pushed the association into the limelight.</p><br/><p>\"F*cking inhumane dog. I'm enraged after seeing the video.\"</p><br/><p>\"What a stupid association, how could someone like him become a Chairman? He said such hurtful words.\"</p><br/><p>\"So what if they're handicapped? The handicapped can't practice martial arts? In my opinion, such an association doesn't even need to exist. A bunch of clowns trying to destroy the national culture.\"</p><br/><p>\"They're just a bunch of kids, how could he say such a thing? Doesn't he know that such words could cause great psychological trauma to kids?\"</p><br/><p>\"I am a handicapped person too and I'm extremely hurt after watching the video.\"</p><br/><p>The video had been taken by someone in the crowd and the content was heart-wrenching. It showed Wang Yun Jie pointing his finger at the kids and shouting at them. Since he had been drunk, maybe he didn't even know what he was saying.</p><br/><p>The incident was being shared repeatedly and things had gotten out of hand.</p><br/><p>Some of the verified netizens on Weibo (i.e. celebrities or famous people) shared the video too and they even supported it.</p><br/><p>After watching the second half of the video, the netizens started to cheer.</p><br/><p>\"That's right, hit him harder. Who is this man? He's impressive.\"</p><br/><p>\"He deserved to be beaten up.\"</p><br/><p>\"After watching this video, I really want to beat up that fella.\"</p><br/><p>\"Everyone, please do not scold the association. At least it has someone that stood up for the kids. This young man has a sense of justice while Chairman Wang is the true bad apple in the association.\"</p><br/><p>\"I agree, watching the man get stomped right in the face made me feel much better.\"</p><br/><p>\"I really want to know the identity of this man, he's literally my idol.\"</p><br/><p>\"D*mn, this guy is a legend. He only slammed the table once and it broke apart. Although the table wasn't made of iron, it was still really impressive for him to have broken it with just one hit.\"</p><br/><p>\"Legendary, that's real kungfu. I've finally witnessed real kungfu.\"</p><br/><p>\"Even the arrival of the Vice-President didn't have any effect on him. This guy is really a legend. He gave everything to demand an apology for the students.\"</p><br/><p>\"I really want to know the identity of this man. I'm already a fan of him!\"</p><br/><p>...</p><br/><p>*Ring! Ring!*</p><br/><p>His phone rang, it was Jiang Fei.</p><br/><p>\"Master Lin, things have gotten out of hand. Could you come over to the association? There are a lot of reporters at the entrance. Also, Vice-President Guo hopes that you can keep things secret and not blow things up,\" Jiang Fei said.</p><br/><p>Lin Fan chuckled. He was impressed by how quickly the reporters had appeared. Of course, with news like that, how could they just stay still and not do anything about it?</p><br/><p>\"I'm on the way, we can talk when I reach.\"</p><br/><p>In the office of the Chinese Martial Arts Association.</p><br/><p>\"Vice-President Zhang, this matter was indeed a misunderstanding. Yes, yes, Wang Yun Jie was drunk. He didn't mean anything else, please forgive us. Our association will definitely not look down on your people.\"</p><br/><p>Vice-President Guo was extremely busy. He was on the phone with the Vice-President of the Association of the Handicapped who had called to find out about the matter.</p><br/><p>Even the Vice-President of the Association of the Handicapped was prepared to sue the Chinese Martial Arts Association. If the lawsuit were to take place, Vice-President Guo would definitely lose his job.</p><br/><p>After hanging up, Vice-President Guo wiped the sweat from his forehead and immediately made another call.</p><br/><p>\"Be firm. I can't let the reporters act based on hearsay. It won't do our association any good,\" he said to himself.</p><br/><p>Vice-President Guo was extremely angry at Wang Yun Jie and Lin Fan. If not for the two of them, this matter wouldn't have happened.</p><br/><p>\"Wang Yun Jie, you better get to my office now. If you do not resolve this issue for me, you shall be kicked out of the association.\" Vice-President Guo vented all his anger toward Wang Yun Jie.</p><br/><p>Wang Yun Jie had just woken up and he was shocked. He didn't even know what had happened. After making a few calls, he just sat on the bed in shock and rage. He blamed everything on Lin Fan.</p><br/><p>At the entrance of the Chinese Martial Arts Association.</p><br/><p>A group of reporters was being denied entry by the security guards of the building.</p><br/><p>Vice-President Guo hurried over and pulled Jiang Fei aside. Then, he asked, \"Is he here yet?\"</p><br/><p>Jiang Fei replied, \"Yes, he's on the way now.\"</p><br/><p>\"Did you tell him to explain this matter clearly and that he can't cause any more trouble for the association?\" Vice-President Guo asked.</p><br/><p>Jiang Fei nodded and said, \"Yes, I have told him that but he said he'll discuss further with us when he's here.\"</p><br/><p>The guard at the gate, Elder Niu, had witnessed everything but he didn't seem to be very bothered by it.</p><br/><p>Lin Fan drove to the entrance of the Chinese Martial Arts Association and when he saw the situation, he was shocked. There were really a lot of people and it looked like the matter had really been blown up. But it wasn't surprising since the Han Lu incident hadn't been resolved and this incident only made things worse. The reporters definitely wouldn't let go of such juicy news.</p><br/><p>He honked.</p><br/><p>The reporters turned to look at the sportscar but weren't bothered by it. They were only there to interview the relevant parties. But when they saw the person that came out of the car, they were stunned.</p><br/><p>\"It's him! He's the youngster in the video.\"</p><br/><p>Vice-President Guo saw that Lin Fan was finally here and he heaved a sigh of relief. Meanwhile, Jiang Fei didn't know how to handle the situation.</p><br/><p>This matter didn't seem like it would be easily settled.</p><br/><p>Lin Fan was used to being interviewed by reporters and he said calmly, \"Everyone, please do not push. You can ask your questions slowly and I'll try to answer as many as I can.\"</p><br/><p>\"You're Master Lin?\" A reporter asked as he found him very familiar. He remembered that he was the man that KO-ed Han Lu.</p><br/><p>Lin Fan smiled, \"Yeah, that's me.\"</p><br/><p>\"Master Lin, may I know why you joined the association?\" Another reporter asked.</p><br/><p>Lin Fan thought for a moment and said, \"I got invited here and I joined to help to cultivate the Chinese culture to the best of my ability.\"</p><br/><p>Vice-President Guo nodded as he was satisfied with the answer. At the same time, he only thought of one thing, which was to stop the matter from blowing up further. If not, it would really be even harder to resolve.</p><br/><p>\"Master Lin, as for the video that has gone viral on the internet, does it reflect what actually happened?\" Another reporter asked.</p><br/><p>Then, Lin Fan saw Vice-President Guo making eye contact with him, as if he wanted him to be cautious with his words, but he pretended not to see him.</p><br/><p>Lin Fan replied honestly, \"Yes, it's true.\"</p><br/><p>\"Master Lin, what caused you to stand up for them? Some netizens said that it was wrong of you to hit the man. Do you regret doing that?\" The reporter asked.</p><br/><p>Lin Fan laughed and said, \"Regret? Why would I regret it? I didn't even hit him hard. People like him deserve to be taught a lesson. He's the very reason why people have a bad impression of the association.\"</p><br/><p>Vice-President Guo was stunned after hearing his words. He had to stop saying such things!</p><br/><p>But the reporters were extremely excited. They couldn't stop moving as they kept trying to push closer to Lin Fan so that they could ask him questions. They wanted to make the most of their time there.</p><br/><p>\"Master Lin, after joining the Chinese Martial Arts Association, what views do you have?\" A reporter asked.</p><br/><p>This question was extremely important.</p><br/><p>Even Vice-President Guo looked worried as he didn't know what kind of words this man would say.</p><br/><p>Lin Fan just grinned and said, \"As for this question, I don't think it'd be very nice of me to say anything. After all, I've only been here for two days. But after just two days, I actually have quite a lot of things to say.\"</p><br/><p>...</p><br/>\n</div>"}