{"title": "Chapter 136: Stunning the entire audience", "id": 136, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-136-stunning-the-entire-audience", "volume_title": "Volume 2", "body": "<h1>Chapter 136: Stunning the entire audience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 136: Stunning the entire audience</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>In the broadcast room.</p><br/><p>\"D*mn! I didn't watch this for nothing. There's actually a conspiracy in such a small-scale joint performance show.\"</p><br/><p>\"Haha, is this even considered small-scale? Such conspiracies are common. It's just that nobody has ever gotten the courage to say it on stage before.\"</p><br/><p>\"These people are really inhumane! F*cking dogs!\"</p><br/><p>\"Bro, that was a good one. I'm 100% supportive of you!\"</p><br/><p>\"What he said was so true. They really lack fair treatment. I have a colleague who also has only one arm but he is extremely professional when it comes to working and he's always the best. They aren't worse than people with all four limbs and sometimes they're even better than us.\"</p><br/><p>\"This fella must be crazy. The association probably canceled this segment to prevent any problems from occurring. What can a bunch of disabled kids do?\"</p><br/><p>\"To the one above, I hope your whole family dies.\"</p><br/><p>\"Please construct a sentence with 'Can you or can you not…' for the person two comments above me.\"</p><br/><p>\"To the person three comments above me: Can you or can you not f*ck my wife?\"</p><br/><p>\"D*mnnn! 6666…\"</p><br/><p>\"+1.\"</p><br/><p>...</p><br/><p>Lin Fan nodded at the kids and said, \"Give your best effort!\"</p><br/><p>Zhang Tao and his friends were teary-eyed. They weren't stupid and they knew that Instructor Lin had offended a lot of people just to seek justice for them. But he had always been happy in front of them as if the world was always perfect.</p><br/><p>They resisted the urge to cry.</p><br/><p>\"Instructor Lin, thank you. Could you stay with us? We would like to share the stage with you.\"</p><br/><p>Lin Fan was taken aback. Then, he smiled and said, \"Alright.\"</p><br/><p>He didn't reject them for this was already the last time. He had fulfilled his wish by letting them perform in this annual show.</p><br/><p>Lin Fan led the kids as they split into two rows of three; one on the left and the other on the right.</p><br/><p>It was the first time Lin Fan was practicing Ba Gua Zhang in full. The knowledge of the Encyclopedia was already embedded in his mind and thoughts.</p><br/><p>His arms and legs moved elegantly.</p><br/><p>He raised his arms and walked with a swagger. He had such an impressive stage presence. It was real kungfu. It could never be done just by memorizing the movements.</p><br/><p>\"Ha!\"</p><br/><p>The children made a series of loud and crisp shouts as they performed, which raised their vigor.</p><br/><p>Zhang Tao and his friends hadn't had much time to practice. Although they couldn't understand the meaning behind their actions, their actions had no flaws. Furthermore, it created a different effect with Lin Fan leading the stage.</p><br/><p>The continuous changes in actions and movements had stunned and amazed the crowd.</p><br/><p>If it had just been the kids performing the movements, it would have been sufficient to get 70 marks but with Lin Fan leading them and amazing the crowd, it was definitely sufficient to get full marks.</p><br/><p>The audience couldn't take their eyes off them.</p><br/><p>Stunning! Simply stunning!</p><br/><p>These kids were surprisingly fantastic.</p><br/><p>The guests' spirits were lifted and they looked extremely enthusiastic. It was exactly what they had been looking for all evening.</p><br/><p>Fraud Tian was simply stunned by the impressive performance.</p><br/><p>Although he hadn't challenged Lin Fan to a fight before, he could tell that Lin Fan was much stronger than he was. He was a little sad and he wondered how Lin Fan had trained to become so much stronger than himself. How infuriating!</p><br/><p>With Lin Fan leading the performance, it seemed like the children weren't even nervous at all. It was as if they were practicing their movements in their usual classroom setting and they were performing even better than in their training. It was like they had an aura that surrounded them which allowed them to perform at such a high level.</p><br/><p>Backstage.</p><br/><p>Ding De looked at the performance and heaved a sigh. He had to admit that it was a great performance. Even his own students couldn't match up to them.</p><br/><p>They all had elegant performances but Lin Fan and his students had much more stage presence than any of them.</p><br/><p>They were simply more energetic. At that moment, he could feel their energy just from watching Lin Fan and the students perform on stage.</p><br/><p>Ding De just clapped and said, \"Superb…\"</p><br/><p>Yuan Guang and the rest of the Headmasters nodded profusely as they also thought that the performance was marvelous.</p><br/><p>Wang Yun Jie just sat still. He was extremely angry after witnessing what Lin Fan had done. But the current situation left him helpless. He couldn't do anything to salvage the situation.</p><br/><p>The time passed quickly, and finally, the last movement ended.</p><br/><p>The whole crowd became silent. Ten seconds later, every single spectator stood up and clapped extremely loudly. The standing ovation lasted for some time.</p><br/><p>\"Good, that was good! I had such a good time watching that.\"</p><br/><p>\"This is the true quintessence of the nation's culture. Filled with energy along with fantastic stage presence.\"</p><br/><p>\"The previous performances can't even hold a candle to this.\"</p><br/><p>The children were a little sweaty but they smiled and laughed. They couldn't contain their happiness after witnessing that everyone was clapping and cheering for them.</p><br/><p>Even the renowned leaders of the country also stood up and clapped as they smiled. They looked ecstatic.</p><br/><p>Vice-President Guo just stood there awkwardly and didn't know what to do. Everyone was pleasantly surprised by how good the performance turned out to be. It was unlike any other performances.</p><br/><p>As the main person in charge of the event, he had canceled this segment of the performance. Perhaps nobody else besides him would ever believe that there was no conspiracy in this.</p><br/><p>Lin Fan and the children stood on stage and smiled brilliantly at the crowd. Then, he looked at the kids and said, \"Look, they are all clapping for you. You guys have succeeded and obtained the recognition of everyone!\"</p><br/><p>Zhang Tao and the other kids used the only arms they had to wipe their tears as they smiled beautifully. They were extremely joyous and it was a kind of joy that they had never felt before.</p><br/><p>The foreign guests stood up and said, \"Amazing, this must be true kungfu…\"</p><br/><p>Lin Fan took the microphone and spoke softly, \"Thank you…\"</p><br/><p>After that, he walked off the stage. The performance had ended and it was time for him to leave the scene.</p><br/><p>Then, a foreign guest shouted, \"Please hold on for a moment. In Chinese Kungfu, does inner strength count as inner power?\"</p><br/><p>The question stunned the entire crowd and they were secretly laughing at him.</p><br/><p>How could inner strength be considered to be inner power? Besides, they hadn't even witnessed true inner strength. Who knew if it even existed?</p><br/><p>Lin Fan stopped in his tracks and didn't know how to explain. Then, he went to a rostrum and raised his hands to clap gently.</p><br/><p>Then, he lowered his hands and smiled before bringing the kids to leave the stage.</p><br/><p>\"What does that even mean?\"</p><br/><p>The foreign guests were completely dumbfounded. They didn't know what that meant.</p><br/><p>The crowd also didn't understand what had just happened.</p><br/><p>When Lin Fan left the stage, the rostrum on the stage suddenly cracked loudly and collapsed.</p><br/><p>The whole crowd was overwhelmed with shock.</p><br/><p>\"WHAT?!\"</p><br/><p>The foreign guests were stunned and their faces turned red as they said, \"Inner power… It must be inner power…\"</p><br/><p>The crowd was completely stunned. How could it be?</p><br/><p>The stand was made of wood. They had also witnessed that the clap earlier was gentle and it didn't seem to have much strength behind it. However, the stand actually collapsed. Even if a person gave it a hard kick or used a hammer to smash it, it might not have collapsed.</p><br/><p>Meanwhile, the reporters were extremely excited when they witnessed what had happened.</p><br/><p>Breaking news! It's a piece of breaking news!</p><br/><p>The entire crowd simply exploded with excitement.</p><br/>\n</div>"}