{"title": "Chapter 137: Task completed", "id": 137, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-137-task-completed", "volume_title": "Volume 2", "body": "<h1>Chapter 137: Task completed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 137: Task completed</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Instructor Lin, where are you going?\" asked the children.</p><br/><p>Lin Fan smiled and said, \"You guys can head back first. I still have to settle something.\"</p><br/><p>The kids were to take the two luxurious private cars back to the Association for the Handicapped. As for the Chinese Martial Arts Association, it was best for them not go back there.</p><br/><p>As for that day's incident, it was all over. The people back at the Chinese Martial Arts Association couldn't find trouble with Lin Fan anymore.</p><br/><p>Fraud Tian walked over and said, \"Awesome, I'm impressed.\"</p><br/><p>\"It's impossible for you to not be impressed,\" Lin Fan replied.</p><br/><p>Fraud Tian was really impressed by Lin Fan for having the courage to speak up about such an issue on stage.</p><br/><p>Wu You Lan looked at Lin Fan and realized that her impression of him had completely changed. She hadn't expected that he would do something like that for the children.</p><br/><p>Jiang Fei walked over. He looked extremely shocked. He said, \"Instructor Lin, are you going to leave?\"</p><br/><p>Lin Fan nodded and said, \"Yeah, why should I stay? I've realized that this association isn't suitable for me. Please help me write a withdrawal letter. I think they must be praying for that to happen.\"</p><br/><p>Jiang Fei didn't know what to say but he was truly impressed by Instructor Lin. Although Lin Fan was younger than him, he dared to do such a thing which Jiang Fei would never dare to do. For that, he deserved respect.</p><br/><p>\"Is there no other way?\" Jiang Fei didn't want Instructor Lin to leave and if even he wanted to stay, the association wouldn't have been able to do anything to him.</p><br/><p>Lin Fan waved his hands and said, \"Nah, I really don't like it. I have so much to do on a daily basis. I don't have time to spend on things like this.\"</p><br/><p>The current situation had caused a conflict in Lin Fan's heart but it was a good thing that it was finally over.</p><br/><p>He hadn't expected the foreign guest to ask such a question just when he had been about to leave. At that moment, he had been hesitant as he didn't want to explain much. But he felt that something would be missing if he had left the stage just like that. In the end, he decided to just give a blow and put on a show as he left the stage.</p><br/><p>Jiang Fei tried to convince him to stay but Lin Fan was set on leaving the association. He would be crazy to still stay in the association. What was the point? He'd just be quarreling with those idiots in the association. Life as a scallion pancake seller was so carefree, he'd be crazy to stay in the association and be infuriated by the people there.</p><br/><p>Lin Fan waved his hand and said, \"Elder Jiang, perhaps we will meet again.\"</p><br/><p>Then, Lin Fan left with Fraud Tian and the rest as he drove off.</p><br/><p>That was how things would end. As for what had happened, it had nothing to do with him anymore and the association had to settle it on their own.</p><br/><p>In the car.</p><br/><p>Fraud Tian laughed and said, \"But seriously though, that Vice-President Guo must really want to kill you.\"</p><br/><p>Lin Fan casually replied, \"Perhaps he thought he could really suppress me. Anyway, he definitely won't be in the mood for this anymore. Whether he remains as the Vice-President of the association will all boil down to his fate.\"</p><br/><p>Fraud Tian was stunned. He said, \"Tell me honestly, that final blow just now, how did you do it?\"</p><br/><p>Lin Fan was a little surprised, \"You mean you can't do that?\"</p><br/><p>Fraud Tian was speechless, \"D*mn you, you think I'm really a martial arts expert with inner powers?\"</p><br/><p>Lin Fan didn't know how to explain and said, \"Forget it, just treat me like an expert then.\"</p><br/><p>Fraud Tian had nothing else to say.</p><br/><p>...</p><br/><p>Outside the event location.</p><br/><p>Wang Yun Jie ran out in rage. He wanted to kill Lin Fan but there was nobody around when he came out as they had already left. Wang Yun Jie felt like he was going to have a mental breakdown. Things weren't like how they used to be anymore. He'd rather let things be reported to the media. That way, he'd still have a way to survive. But now, what could he do to salvage the situation?</p><br/><p>This fella actually exposed them on stage and the audience was filled with various notable leaders of Shanghai. Things had been immediately made known to the highest ranking leaders and they wouldn't just let things be. He finally understood everything. He finally understood why Lin Fan dared to speak the truth at the joint performance. Lin Fan had seen this day coming all along.</p><br/><p>He had wanted to crush the association's leaders and not give them any way to survive.</p><br/><p>Wang Yun Jie's phone rang. It was from Vice-President Guo.</p><br/><p>Guo Chen said, \"You better f*cking get to the backstage right now. I'll be waiting for you there.\"</p><br/><p>Wang Yun Jie was speechless.</p><br/><p>...</p><br/><p>The next day, the media exploded.</p><br/><p>'Shocking revelation. What we need is a fair chance and not your pity.'</p><br/><p>'A group of kids was treated unfairly by people abusing their power.'</p><br/><p>'The just Instructor Lin took courage to speak up for the children.'</p><br/><p>'The true Master showed his powers again as he stunned the crowd with just one blow.'</p><br/><p>'The foreigners were all dumbfounded as they chanted, 'Kungfu, kungfu!''</p><br/><p>...</p><br/><p>Meanwhile, online.</p><br/><p>\"How shocking. That must be true skills. I tried to smack my own table at home several times and now my palms are red.\"</p><br/><p>\"Impressive, very impressive. It must have stunned so many people.\"</p><br/><p>\"F*ck, I've become such a huge fan of this man. It's so moving.\"</p><br/><p>\"Although it's just a joint-performance, I actually cried from watching it. I feel that the children's smiles after the performance were the most beautiful smiles on earth.\"</p><br/><p>\"If this man hadn't appeared, what would have happened to these kids? Perhaps they'd have been traumatized by this event.\"</p><br/><p>\"I really wonder how that man became the Vice-President of the association. They must be blind!\"</p><br/><p>\"That final blow completely stunned me. I was shocked beyond words.\"</p><br/><p>\"Breaking the rostrum wasn't scary but breaking it with a gentle blow like that was insane. Imagine what would've happened if he used all his power.\"</p><br/><p>\"Let's not talk about other things. This man deserves all our respect.\"</p><br/><p>\"Indeed. He dared to expose everything on stage for a group of children that had little or even no relation to him. Just for his courage, he deserves our respect.\"</p><br/><p>...</p><br/><p>The joint performance yesterday wasn't supposed to be such a huge event. The most that could happen was for it to be reported by some small media platforms. But because of Lin Fan, it had become viral and many people were reporting about it on the news. The content involved the Association of the Handicapped and the Chinese Martial Arts Association as well as the conspiracy behind everything.</p><br/><p>The Association of the Handicapped also expressed their views on this. They felt that these children had been treated unfairly by the Chinese Martial Arts Association. The netizens were all flaming the Chinese Martial Arts Association and wanted to seek justice for them.</p><br/><p>Furthermore, they were just kids. In the eyes of many netizens, they deserved to be protected.</p><br/><p>...</p><br/><p>But nobody had expected such an outcome.</p><br/><p>At Master Lin's shop on Cloud Street.</p><br/><p>\"Fraud, please go have a walk outside and don't come back until I give you a call.\"</p><br/><p>Lin Fan was panicking. The Encyclopedia was about to make life difficult for him again. The third task had been completed but the notification sound came only after he had returned to his shop.</p><br/><p>He was afraid, especially since Fraud Tian was just in front of him. If the next task had something to do with Fraud Tian again, then it'd be really depressing.</p><br/><p>Fraud Tian was shocked. He asked innocently, \"What happened? Why do I have to leave?\"</p><br/><p>Lin Fan anxiously replied, \"Just get out first!\"</p><br/><p>Fraud Tian was really confused, \"No, you have to explain it to me. Otherwise, I wouldn't know what to do outside.\"</p><br/><p>...</p><br/><p>It's too late…</p><br/>\n</div>"}