{"title": "Chapter 131: Chaos broke loose", "id": 131, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-131-chaos-broke-loose", "volume_title": "Volume 2", "body": "<h1>Chapter 131: Chaos broke loose</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131: Chaos broke loose</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>He was really pissed off. These guys were just taking advantage of him.</p><br/><p>Were they blind? Couldn't they see the effort put in?</p><br/><p>However, it was normal. These days, if you had connections, you would succeed. If you had no connections or if you offended someone, no matter how hard you worked or how great you were, you could never go far. Most people could only suck it up and keep the emotions bottled up.</p><br/><p>He wouldn't have cared if it was someone else, but at that moment, he was the one being taken advantage of. Was he so easy to bully?</p><br/><p>The association members who passed by all stared blankly as they saw Master Lin's grave expression.</p><br/><p>\"What's with Master Lin today? He looks like he's angry.\"</p><br/><p>\"Don't you know? The Ba Gua Zhang performance has been canceled.\"</p><br/><p>\"It can't be. Those kids practiced so diligently. The last time I went, it was tear-jerking.\"</p><br/><p>\"So what if it's tear-jerking? Master Lin offended Chairman Wang and his men. Did you think they would forgive him so easily?\"</p><br/><p>\"Now, Master Lin is going to look for them. I think there might be trouble.\"</p><br/><p>\"Let's go. We'll check it out.\"</p><br/><p>...</p><br/><p>They entered the association office building.</p><br/><p>When the association members saw Master Lin in the hall, some of them lowered their heads, some of them stared at him and some of them whispered behind his back.</p><br/><p>Lin Fan stopped in his tracks, \"Guo Chen, Wang Yun Jie and the rest. Where are they?\"</p><br/><p>Complete silence. Nobody dared to answer him. They were all stunned by Master Lin's sternness. He was the image of a man with anger brewing in his heart, on the edge of exploding.</p><br/><p>Lin Fan asked again. This time in a gloomier tone.</p><br/><p>A lady pointed up. \"In the conference room.\"</p><br/><p>This lady knew the outcome regarding the performance. She was very displeased with the committee's decision, but she didn't have a high status. Her words would have just been disregarded. Now that Master Lin had come, she could only help by providing the information.</p><br/><p>Lin Fan nodded. \"Thanks.\"</p><br/><p>Lin Fan went straight upstairs without saying anything else, but everyone could tell that something big was about to take place.</p><br/><p>\"What do we do? Looks like trouble is going to happen.\"</p><br/><p>\"Master Lin has only been in the association for a few days, but everyone knows what a fiery temper he has. He might usually be polite, but now that he's been taken advantage of, he definitely won't just let it be.\"</p><br/><p>\"Should we call the police?\"</p><br/><p>\"What for? Do you want to blow things up even more?\"</p><br/><p>\"Master Lin is actually a really kind person. He's only been in the association for a while, but he's treating the matter regarding the kids with such importance. Do you understand the significance of the performance?\"</p><br/><p>\"Of course. Everyone does except for them.\"</p><br/><p>As they whispered to each other, a loud thud came from above. It sounded a door being kicked open.</p><br/><p>They looked at each other. Something was bound to happen. It couldn't be avoided anymore.</p><br/><p>In the conference room.</p><br/><p>Lin Fan kicked the door open and entered. Vice-President Guo and the rest shuddered when they saw him.</p><br/><p>Wang Yun Jie stood up, \"What are you trying to do? Do you think there are no rules here?\"</p><br/><p>He was extremely displeased with Lin Fan, especially with his current behavior. What the heck was that? Kicking the door open without knocking. Completely disregarding the association's regulations.</p><br/><p>When Lin Fan walked in, he started yelling, \"What the f*ck are you doing? If there are any problems, settle them with me. To take it out on the kids, are you guys still humans?\"</p><br/><p>Wang Yun Jie pointed his finger at Lin Fan, \"Watch your tone. Do you know who you're talking to?\"</p><br/><p>\"Put your hand down.\" Vice-President Guo stood up and rebuked Chairman Wang, then he said, \"Master Lin, this situation is complicated. It's not what you think. Please sit down and let me explain it to you.\"</p><br/><p>The MMA Chairman, Wu Xuan, tried to mediate the situation, \"Master Lin, this is an association. It's not good to act like this. Listen to Vice-President Guo and take a seat. We'll talk it out.\"</p><br/><p>Lin Fan didn't show them any respect, \"Don't interrupt me. I'm here today for Guo Chen and Wang Yun Jie. If the two of you don't clear things out today, don't blame me for what happens.\"</p><br/><p>Wu Xuan shook his head and sat down. He couldn't talk to these young people. He could only sit down and watch.</p><br/><p>Many association members stood along the corridor. They didn't dare to go near, but the noise was so loud that everyone could hear it.</p><br/><p>When they heard Master Lin's words, all of them were shocked. This was an acrimonious tone. And there were names being called out too.</p><br/><p>Guo Chen!</p><br/><p>Wang Yun Jie!</p><br/><p>Something bad was definitely going down. They stood there silently. The whole corridor was completely silent. No one dared to make a sound.</p><br/><p>Lin Fan's behavior made Guo Chen put on a distasteful expression. Wang Yun Jie was even more furious. \"Lin, Don't you have any restraint? This is an association. He is the Vice-President. How could you speak in such a tone? Do you think that just because the headquarters specially invited you into the association, you can do whatever you like?\"</p><br/><p>Vice-President Guo calmed his emotions, \"This matter did indeed start with a lack of consideration on our part, to let Ba Gua Zhang qualify. But now, the situation regarding the performance has changed. The leaders of Shanghai will all be around, along with some distinguished guests. The association must display its best image. This concerns the entire association. Even if we have to remove the Ba Gua Zhang, it can't be helped.\"</p><br/><p>Lin Fan laughed coldly, \"What is 'displaying its best image'? And what do you mean it can't be helped? Even this Wang Yun Jie's f*ck face can be displayed, why do those kids' performance have to be removed?\"</p><br/><p>Vice-President Guo said, \"Master Lin, I hope you can understand the difficulties we face. Those kids have some disabilities and this performance has a high degree of difficulty. If something is to happen during the performance, we can't afford to bear the responsibility.</p><br/><p>Lin Fan sneered, \"Are you blind? High degree of difficulty? If something is to happen? Do you know just how much these kids have put in just to practice for this performance? And now, because of your random and irrelevant concerns, all of it will go to waste. This is inhumane!\"</p><br/><p>Several other committee members turned away. They knew what Master Lin said was true. Those kids had indeed worked very hard.</p><br/><p>\"Lin, I know you're unsatisfied, but if something really goes wrong, would you take responsibility? Vice-President Guo is thinking for the association. For everyone. Don't be so ignorant,\" said Wang Yun Jie.</p><br/><p>Lin Fan immediately kicked the conference table and shouted, \"What kind of Vice-President is he if he can't even bear this responsibility? Give up your seat to someone who has the guts to bear some responsibility! And don't speak as if he's so thoughtful. Just say it honestly! I, Lin Fan, have pissed you guys off and you're now taking your revenge on me. And this performance is your way of getting back at me. If you're men, don't play pretend anymore and just speak the truth!\"</p><br/><p>\"Get out. This is an association, not a place for you to behave so atrociously. I am the Vice-President and I have the authority to choose who participates. Right now, the names have already been confirmed. Even if you make a big ruckus, nothing will change. Get out of my sight now. I'm going to call the headquarters and express my severe reluctance for you to stay in the association.\" Vice-President Guo had lost it. Since becoming Shanghai's association Vice-President, no one had dared to talk to him with such impudence.</p><br/><p>Lin Fan looked at the two of them and said just three words, \"F*ck your mom.\"</p><br/><p>Vice-President Guo and Wang Yun Jie were furious. \"How dare you curse us…\"</p><br/><p>\"Curse you? I'm going to beat you...f*cking hell.\"</p><br/><p>At that moment, chaos broke loose in the conference room.</p><br/>\n</div>"}