{"title": "Chapter 141: A great breakthrough", "id": 141, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-141-a-great-breakthrough", "volume_title": "Volume 2", "body": "<h1>Chapter 141: A great breakthrough</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 141: A great breakthrough</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Cloud Street.</p><br/><p>Lin Fan was laying there, answering a phone call. It was from Elder Jiang. He told Lin Fan to think it through and not be too rash as the association would still welcome him.</p><br/><p>Lin Fan didn't believe this at all. After seeing how he was like, how could the association still welcome him? He wasn't interested anyway and there wasn't a point in staying. The earlier he left, the earlier he could be at ease. That constant struggle would cause even his young heart to rot. He still wanted to live to a hundred years old.</p><br/><p>However, during the phone call, Elder Jiang also revealed that Vice-President Guo and Wang Yun Jie were stepping down due to the Shanghai deputy leader's intervention. The headquarters had given the two of them a severe punishment. They had nearly been sacked. What surprised Lin Fan even more was that the old man who always watched the gate was actually the Shanghai association president sent from the headquarters.</p><br/><p>That old man had really hidden his identity well. He just stayed at the Shanghai association, watching the gate for a year and only the headquarters knew about this. Nobody in the Shanghai association had known. It was definitely a weird situation.</p><br/><p>However, Lin Fan didn't want to think about these matters anymore. He felt that these days were passing by very comfortably. Selling scallion pancakes every day, watching Wu Tian He reading people's fortunes and then giving some advice when something out of the ordinary happened. But at that moment, two people approached the shop.</p><br/><p>One of them was the plump young lady who had been fortunate enough to be chosen by himself earlier that day. Who knew that she was actually a nurse?</p><br/><p>Liang Yuan pointed inside, \"This is it.\"</p><br/><p>Madam Wang had an anxious expression. After scanning through the shop, she grabbed onto Fraud Tian, \"Old Master, can you give me a serving of scallion pancake?\"</p><br/><p>Fraud Tian was stunned, then he pointed at Lin Fan, \"I'm not the one who sells scallion pancakes. He is…\"</p><br/><p>Madam Wang immediately approached Lin Fan, \"Boss, please make me some scallion pancakes.\"</p><br/><p>Lin Fan was curious. He didn't know what was going on. \"Sorry, I only sell ten servings a day. I've already hit today's quota. If you must, come back tomorrow to queue.\"</p><br/><p>Madam Wang panicked. Her daughter was waiting to eat the scallion pancake. \"Boss, I'm begging you! Just one serving!\"</p><br/><p>He had never met such a customer before who would plead with him like that, but he couldn't break his policy just because she was pleading, \"I'm sorry. This is our shop's policy. We only sell ten servings a day. If you must, you can come back tomorrow to queue and try your luck.\"</p><br/><p>Liang Yuan opened her mouth, \"Boss, her daughter has been diagnosed with severe anorexia. She's in the hospital and she won't eat anything, but when I bought her scallion pancakes earlier today, she ate them. Now she's saying that she wants more. Could you please make an exception just this one time?\"</p><br/><p>Lin Fan was in disbelief.</p><br/><p>His scallion pancakes had this kind of effect? A person with severe anorexia could eat his scallion pancakes? How strange!</p><br/><p>Although he had never come across someone with severe anorexia before, he had heard of how frightening anorexia was. Sufferers would have trouble eating any food at all. Even if they tried to force a bit of food in, they would just puke it out.</p><br/><p>Fraud Tian and the rest stared blankly at Lin Fan. They hadn't thought that those scallion pancakes could possibly have such unbelievable ability either.</p><br/><p>The total number of people who suffered from anorexia was increasing every year and the number of deaths caused by anorexia wasn't small either.</p><br/><p>If people found out about his scallion pancakes, it would draw a lot of unwanted attention.</p><br/><p>Lin Fan remained silent for a moment.</p><br/><p>Madam Wang was close to tears. In the few months since her daughter had started suffering from anorexia, she had been emotionally tormented. Now that she had found some hope, she couldn't let go. \"Boss, I'm begging you…\"</p><br/><p>\"Don't be like that…\" He swiftly pulled her by her arm and then pointed at the sheet of paper on the wall, \"You two can take a look at this sheet. Read through it properly and try to understand it. I believe the two of you can pass.\"</p><br/><p>Madam Wang and Liang Yuan didn't really understand Lin Fan's intention, but they went to the entrance and looked at the sheet on the wall.</p><br/><p>It was information about scallion pancakes from the Encyclopedia. Lin Fan's rule was that whoever could understand it would get a serving of scallion pancake.</p><br/><p>Liang Yuan loved to eat, but that didn't mean that she had this kind of talent.</p><br/><p>Madam Wang read through it very seriously. She read through each word very slowly and with much focus.</p><br/><p>\"Encyclopedic points +1\"</p><br/><p>At that moment, Lin Fan received a notification from the Encyclopedia. His Encyclopedic Points had increased.</p><br/><p>\"Alright, you've passed,\" said Lin Fan.</p><br/><p>Even until then, he hadn't found out what criteria the Encyclopedia used to judge if someone understood it. He had tested it several times. Some people had culinary skills but couldn't increase his Encyclopedic Points. Some people had no culinary skills but still managed to increase his Encyclopedic Points.</p><br/><p>Lin Fan didn't bother too much about this. Whether his Encyclopedic Points increased, he left it up to chance. He was in no hurry. Afterall, he was happy with his current life.</p><br/><p>\"Can I buy the scallion pancakes now?\" asked Madam Wang emotionally.</p><br/><p>Lin Fan nodded, \"Yep.\"</p><br/><p>Lin Fan went to the front of his stall. He grabbed the cloth covering his cart and uncovered it. He added some charcoal. He then started the fire, added the oil and then placed the dough inside.</p><br/><p>His actions were swift and without hesitation. Gradually, the scallion pancake started to take shape. The golden brown and crispy outer layer shone in their eyes. It was extraordinarily dazzling.</p><br/><p>The aroma filled the air. Those freshly made scallion pancakes were extremely alluring.</p><br/><p>As Liang Yuan smelled the aroma, her appetite was drawn out. However, she knew that those scallion pancakes weren't for her.</p><br/><p>Lin Fan wrapped up the scallion pancakes. \"Done. Our shop's policy is to only sell ten servings a day.\"</p><br/><p>Madam Wang held the scallion pancakes in her hands as if she was cradling a precious child, \"How much?\"</p><br/><p>Lin Fan replied, \"Fifty.\"</p><br/><p>After paying, Madam Wang and Liang Yuan immediately started the car and left for the hospital.</p><br/><p>Fraud Tian came over and exclaimed, \"Good man! That's amazing! Those scallion pancakes can be eaten by people suffering from anorexia? Just how tasty are they?\"</p><br/><p>Lin Fan shrugged. How would he know? He started to value his scallion pancakes even more.</p><br/><p>Back then, when the Encyclopedia only allowed him to make delicious pancakes, he had never thought that it would be this ridiculously delicious.</p><br/><p>At the hospital.</p><br/><p>Madam Wang got off her car. She rushed into the hospital as if her daughter would get hurt if she was a second late. No one would act like this in this world, but if there was someone, it had to be a mother.</p><br/><p>In the ward.</p><br/><p>\"I want to eat scallion pancakes! Why isn't it here yet?\" Wang Li Li sat on her bed. She had become much more energetic than before and kept crying out that she wanted scallion pancakes.</p><br/><p>Director Zhang still couldn't figure out what was going on.</p><br/><p>What was so different about those scallion pancakes? How could someone suffering from anorexia suddenly develop an appetite for scallion pancakes? Moreover, she would only eat those scallion pancakes.</p><br/><p>Scallion pancakes were full of oil. Anorexic people hated oily food the most. Even the smell of oily food could cause them to puke.</p><br/><p>\"Li Li, Mom's here.\" Madam Wang ran into the ward and took out the piping hot scallion pancake. As she prepared to pass them to her daughter, Director Zhang stopped her, \"Let me have a small piece.\"</p><br/><p>It was the director who made the request. Naturally, Madam Wang didn't reject him.</p><br/><p>Wang Li Li, on the other hand, kept hastening her.</p><br/><p>As soon as she received the pancakes, she bit into it and tore it apart as if the scallion pancake would disappear if she was a second slower.</p><br/><p>When Madam Wang saw that her daughter could finally eat, a wide smile appeared on her face and her eyes turned red. It was all worth it.</p><br/><p>Director Zhang gazed at the thumb-sized piece of scallion pancake in his hand. He furrowed his brows, then took a small bite.</p><br/><p>Suddenly!</p><br/><p>He was stunned. His eyes widened like a bull's eyes as if he had just witnessed something unbelievable.</p><br/><p>He started salivating. He wanted to eat the rest of the piece of scallion pancake, but he resisted the urge. He wanted to bring it back for testing. Just what was hidden inside this scallion pancake? How could it appeal even to a severely anorexic patient?</p><br/><p>If he could figure out the mystery behind it, it would be a great breakthrough for people suffering from anorexia.</p><br/>\n</div>"}