{"title": "Chapter 144: What the heck am I supposed to do?", "id": 144, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-144-what-the-heck-am-i-supposed-to-do", "volume_title": "Volume 2", "body": "<h1>Chapter 144: What the heck am I supposed to do?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 144: What the heck am I supposed to do?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The next day!</p><br/><p>At a newsstand.</p><br/><p>On the newspaper's front page, a single article occupied more than half the page.</p><br/><p>\"Is this for real? Even severe cases of anorexia can be cured.\"</p><br/><p>\"I've heard that anorexia can be compared to cancer. In fact, it can be much more terrifying than cancer.\"</p><br/><p>\"The standard of medical science is getting higher and higher. Soon, there'll be no more diseases that can't be treated.\"</p><br/><p>\"Hey, something's not right. What does severe anorexia have to do with scallion pancakes?\"</p><br/><p>\"What are those reporters doing? This is clearly fake news. How dare they report something like this?\"</p><br/><p>…</p><br/><p>Online.</p><br/><p>\"F*ck your mom, do these editors have nothing else to write about? They're just blindly writing bullshit!\"</p><br/><p>\"Editors, have you been hit in the head? How the heck do you expect me to believe that a scallion pancake enabled a severely anorexic person to start eating again?\"</p><br/><p>\"Come out, editor! I promise I won't beat you to death, but you're clearly making fun of our IQ.\"</p><br/><p>\"Cloud Street's mysterious scallion pancake? Where have I heard this before?\"</p><br/><p>\"Oh, sh*t! Isn't this Cloud Street's Master Lin's scallion pancakes? Even if they're advertising, they can't advertise it like that!\"</p><br/><p>\"I give up. Anyone with half a brain can tell that this can't be true.\"</p><br/><p>...</p><br/><p>On Weibo, a certain large hospital's Professor Li said, \"Absurd. Completely absurd. I've been researching about anorexia for thirty years and I've never heard of a patient who would eat nothing else but scallion pancakes. The full name for anorexia is anorexia nervosa. It is categorized as a psychiatric disorder. Its causes mainly consist of the following: Stress, suffering from a setback in life, trouble adjusting to a new environment or a personal accident resulting in emotional distress. The main symptom is losing one's appetite. Having no interest in any food. A severely anorexic person wouldn't be able to eat anything at all. Now, in order to draw attention, these reporters are stopping at nothing. This report about scallion pancakes is utter nonsense!\"</p><br/><p>This Professor Li had been researching about anorexia for thirty years and was considered a pro both locally and internationally. When he saw this piece of news, he was furious. Weren't they just trying trick people?</p><br/><p>\"I agree with professor Li!\"</p><br/><p>\"Reporters these days have no morals. To even dare to spout such nonsense!\"</p><br/><p>\"Seriously? Scallion pancakes are the cure for anorexia? How did they even think of something so ridiculous?\"</p><br/><p>\"Professor Li has been working in this field for thirty years. He's put in so much time and effort to combat anorexia. And now they say that scallion pancakes can cure anorexia? This is an insult to Professor Li's work.\"</p><br/><p>Professor Li said, \"Thank you, everyone, for your support. Everything must be supported by some evidence. Don't just believe anything you hear, or else the consequences may be severe.\"</p><br/><p>Cloud Street.</p><br/><p>Fraud Tian said, \"It's bad, the news has appeared on the internet.\"</p><br/><p>Lin Fan looked at his phone, \"It's still not too bad. Not many people believe it. We have to end this matter now.\"</p><br/><p>Fraud Tian: \"The people on your Weibo page are all asking if it's you.\"</p><br/><p>Lin Fan couldn't help shaking his head, \"Ignore them. At least majority of them don't believe it. Otherwise, I would have to go into hiding. It's crazy. It's really crazy.\"</p><br/><p>Wu You Lan looked at her phone. If she hadn't seen it personally, she would never have believed the news either.</p><br/><p>However, the reality was right in front of her. She had to believe it. If it was her past self, she would have been pissed off. Who the hell would believe this kind of news? But now that she had seen it with her own eyes, she had to believe it.</p><br/><p>…</p><br/><p>The internet was in an uproar.</p><br/><p>The netizens were all discussing this matter but most of them didn't believe it because it sounded too unreal. If a piece of scallion pancake could make a severely anorexic person eat, then there would be no need for hospitals.</p><br/><p>At that moment, a video quietly appeared on the internet.</p><br/><p>The video was played.</p><br/><p>\"I don't want to eat all these. I want to eat scallion pancakes.\"</p><br/><p>*vomits*</p><br/><p>\"I want to eat scallion pancakes.\"</p><br/><p>…</p><br/><p>In the video, it appeared that there were reporters there. After Wang Li Li finished a serving of rice, she tried some other vegetable, but once it entered her mouth, she puked all of it out. In the end, they could only mix the scallion pancake into the rice. That was the only way to make her eat.</p><br/><p>In the video, Wang Li Li was as thin as a stick. It was shocking. The netizens who saw the video all had their eyes wide open and mouths gaping. Wasn't it commonly said on the internet these days, that if there's no picture, it's just bullshit? Now, there wasn't just a picture, but a video. What else could they say?</p><br/><p>\"Professor Li, what's going on?\"</p><br/><p>\"Professor Li, didn't you say it was impossible? Now there's even a video. We're all confused.\"</p><br/><p>\"Where are you, Professor Li…?\"</p><br/><p>\"Professor Li, come out and say something, won't you…?\"</p><br/><p>Countless netizens were commenting on Professor Li's Weibo, hoping that he would say something about the video. However, Professor Li had already called the media, asking which hospital that was. He wanted to go there and see it for himself.</p><br/><p>When the video was released, he had watched it. After watching it, he didn't want to say a word. He silently removed his previous Weibo post. He still maintained his views, but now, the video was right in front of him. Moreover, there were no cuts in the video. It seemed perfect and flawless.</p><br/><p>This was his field of research. If he didn't go there and clear things out himself, he wouldn't be able to sleep.</p><br/><p>In the afternoon.</p><br/><p>Lin Fan was laying there, taking a little break. Suddenly, he jumped at the sound of Fraud Tian's shouts.</p><br/><p>\"It's bad! Something really happened!\" Fraud Tian had been standing at the entrance, with a cigarette in his mouth and doing some stretches, but suddenly, a large group of reporters came charging from afar. He dropped his cigarette onto the ground and yelled.</p><br/><p>Lin Fan was startled. \"What's going on?\"</p><br/><p>Fraud Tian replied, \"The reporters are here! The reporters are here!\"</p><br/><p>Lin Fan panicked for a moment, then he came to his senses. \"Oh, sh*t! This…\"</p><br/><p>By the time he came to his senses, the reporters had already surrounded the entrance.</p><br/><p>\"This is the place. He is Master Lin.\"</p><br/><p>\"This shop's scallion pancakes are the ones that can make anorexia sufferers eat!\"</p><br/><p>\"Master Lin, your scallion pancakes are able to appeal to anorexia sufferers. What is the secret behind that?\"</p><br/><p>\"Master Lin, please say a few words.\"</p><br/><p>…</p><br/><p>The reporters surrounded Lin Fan and completely blocked out the entrance. No matter what, they had to find out what exactly was going on.</p><br/><p>If they could find out the truth, it would be a huge piece of news.</p><br/><p>A scallion pancake that could cure anorexia. This was a historical moment! And to be able to witness this moment in history was an honor.</p><br/><p>Lin Fan's heart trembled. He furrowed his eyebrows slightly, \"Everyone, please don't push. We'll talk outside. It's too hot in here.\"</p><br/><p>The reporters asked, \"Master Lin, say something. Why do your scallion pancakes have such an effect?\"</p><br/><p>\"Master Lin, do you remember me? I've reported about you before. Your scallion pancakes taste incredible. And now, it's even able to make anorexic people eat. How do you view this matter?\"</p><br/><p>The reporters wouldn't leave without getting Master Lin's views. They had to find out the truth.</p><br/><p>Lin Fan was helpless. What the heck was he supposed to say?</p><br/>\n</div>"}