{"title": "Chapter 158: Development", "id": 158, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-158-development", "volume_title": "Volume 2", "body": "<h1>Chapter 158: Development</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 158: Development</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The next day.</p><br/><p>With the A-list celebrity as its ambassador, Supreme Tiger Electronic Fingerprint Doors surfaced on the marketplace.</p><br/><p>Advertisements on television, Weibo, the business district's big screen...it was an all-around bombardment.</p><br/><p>The townsfolk weren't attracted by the Supreme Tiger Electronic Fingerprint Doors, but they were drawn in by the A-list celebrity. A-list celebrities had large fan bases, especially this A-list celebrity who was extremely beautiful and had a curvy body. When the townsfolk saw this, they naturally feasted their eyes upon her.</p><br/><p>The $2,000,000 reward at the end was another highlight. When the townsfolk saw it, they started bustling with excitement. Although they knew that it was just a sales tactic, the $2,000,000 was still astonishing.</p><br/><p>Some professional locksmiths became very excited, but against this Supreme Tiger Electronic Fingerprint Door, they had no hope. It was practically impossible to unlock this door. It didn't even have a keyhole. How could anyone unlock it?</p><br/><p>The media also started spreading the advertisement. It reached several large platforms. With such a marketing tactic, they were most concerned about whether anyone came to challenge for the $2,000,000.</p><br/><p>'Yue Ma Locks' was a lot quieter. They didn't need to do such large-scale publicizing because their locks had always sold well on the market and were very popular. Their prices were low and their locks could even be bought by commoners. For every 10 homes, there were at least 3 that used 'Yue Ma Locks', hence, they didn't have to invest a large amount of capital into advertising.</p><br/><p>As for the Supreme Tiger Electronic Fingerprint Doors, they were high-end burglar-proof doors. They didn't sell locks alone. They only sold entire sets of doors, which were all custom-made. Most of the townsfolk were not willing to spend so much on them. Hence, Supreme Tiger Electronic Fingerprint Doors was investing a large sum of money into advertising in order to appeal to the common people.</p><br/><p>At Supreme Tiger Electronic Fingerprint Doors Headquarters.</p><br/><p>\"Check out our search rate. This time, we've advertised on all fronts. The results should be good.\"</p><br/><p>\"The numbers are out. Within three hours of sending out our advertisements, the search rate for our products has increased by 200%.\"</p><br/><p>\"Good. That's not bad at all. By tonight, this number will be much higher. Prepare a celebratory gathering for tonight.\"</p><br/><p>…</p><br/><p>The employees at the Supreme Tiger Electronic Fingerprint Doors Headquarters were in jubilation. They had succeeded. Moreover, the locksmiths that took on their challenge were very few. They probably knew how hard it was to unlock Supreme Tiger Electronic Fingerprint Doors.</p><br/><p>Lin Fan wore gloves to cover his injured hands. He strolled around Shanghai Shopping Centre. Since he opened his shop, he hadn't bought any new clothes. Now that he was not short on money anymore, he naturally wanted to buy some good-looking clothes.</p><br/><p>On the internet.</p><br/><p>The video from the previous night appeared.</p><br/><p>At that time, there were no media representatives on site, so they couldn't get any first-hand information. However, they had compiled all the videos provided by the townsfolk and sent them out.</p><br/><p>At first, this video was just circulating around on WeChat and Weibo but eventually, it got more and more viral and appeared on Weibo's Trending List.</p><br/><p>This was all because of a young reporter. When he had nothing to do, he scrolled through his Weibo and saw a video posted by a normal Weibo user.</p><br/><p>He played it.</p><br/><p>There was the sound of a commotion. It looked like an estate. The phone's camera was aimed upwards. Initially, the phone was very shaky and everything was a blur. He couldn't see what was that thing hanging up there. Then, the video became clear, it was a child of one or two years of age, stuck on the window grill.</p><br/><p>In the video, it looked like it was at least twenty-something stories high. If the child fell, it would have been disastrous.</p><br/><p>\"What's wrong with parents these days? How could they bear to just leave a child alone at home?</p><br/><p>The sound of the child's family crying could be heard from the video. He felt furious but at the same time, his heartfelt knotted up. He was anxious for the child in the video, as he didn't know how it would end up.</p><br/><p>Then, the scene changed. It became the scene of a corridor.</p><br/><p>It seemed like it was two separate videos stitched together. The quality of the camera even improved significantly. The image became much clearer.</p><br/><p>In the video, the child's mother was wailing like mad. It was heart-wrenching. The fire engine was jammed on the road and it looked like it might not make it in time. That made him even more anxious.</p><br/><p>Falling from the 28th floor to the 26th floor. If the 26th-floor apartment owner hadn't violated the estate's rules and installed the window grills, the outcome would have been terrible.</p><br/><p>\"Argh, what kind of professional locksmith is this? Why does he need so long to open one burglar-proof door? It's killing me!\"</p><br/><p>In the video, Master Wang was trying his best to unlock the door, but it didn't open even after a long while.</p><br/><p>The young reporter's colleagues had gathered around him, \"What are you watching? You seem so engrossed.\"</p><br/><p>The young reporter said, \"There's a child stuck on the window grills. I still don't know whether he'll be saved. These parents are way too irresponsible.\"</p><br/><p>Then, the group of reporters gathered around him and watched it together.</p><br/><p>\"Yue Ma Lock?\"</p><br/><p>\"My house also uses Yue Ma Lock. It's very difficult to pick. Even Master locksmiths need a long time to unlock it.\"</p><br/><p>\"I know how this will end. He'll take about 300 minutes.\"</p><br/><p>\"Huh? That long? Will the kid still be alive by then?\"</p><br/><p>The reporters' hearts knotted up as they continued watching the video. Then, the scene changed again. A young man shoved the locksmith aside.</p><br/><p>\"Holy sh*t, who's this young man? That's amazing.\"</p><br/><p>\"Looks like we don't need to watch until the end. The child will surely be saved now.\"</p><br/><p>Although the reporters were not at the scene, they felt as if they were in the video. They were very worried and very anxious.</p><br/><p>When the door opened, another door appeared in the video.</p><br/><p>\"F*ck, what's wrong with this family? Why would they install two burglar-proof doors?\"</p><br/><p>\"That locksmith just said that this door is an electronic fingerprint door with no keyhole. It can't possibly be opened unless it's destroyed with brute force.\"</p><br/><p>\"I know about this kind of lock. It's said to be the most difficult to unlock and no one has ever unlocked it before. Unless the owner comes back, there's no way that door will open.</p><br/><p>\"I don't want to watch anymore. This is too heart-wrenching.\"</p><br/><p>The reporters gradually dispersed. They didn't want to see the outcome. But then, suddenly, violent knocking sounds rang out from the phone. It was thunderous.</p><br/><p>The young reporter watched unblinkingly. His eyes widened and his mouth gaped open.</p><br/><p>Those reporters who had left came back upon hearing these sounds. When they saw the video, every single one of them was stunned.</p><br/><p>\"That's way too ferocious.\"</p><br/><p>\"He's striking the door with his bare hands? How's that possible?\"</p><br/><p>Boom!</p><br/><p>Soon after, that electronic fingerprint door collapsed onto the ground. The reporters weren't the only ones shocked, even the people in the video were so stunned that they just stood rooted to the ground.</p><br/><p>Then, the reporters came to their senses and started crying out maniacally.</p><br/><p>\"That's way too awesome!\"</p><br/><p>\"He's not human!\"</p><br/><p>\"Quick! Contact this Weibo user and ask him where this happened. It has to go on the news immediately!\"</p><br/><p>\"Amazing! If I hadn't seen it with my own eyes, I would never have believed it!\"</p><br/><p>Just because of this funny coincidence, the reporters found out about this big piece of news. After some editing and the addition of a caption, the video was posted on the news platforms.</p><br/><p>This situation defied logic. It was unbelievable.</p><br/><p>Soon, it will surely cause huge waves on the internet.</p><br/>\n</div>"}