{"title": "Chapter 152: Stunned!", "id": 152, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-152-stunned", "volume_title": "Volume 2", "body": "<h1>Chapter 152: Stunned!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: Stunned!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Accidents will always catch people off guard.</p><br/><p>Chief Zhang shouted, \"What are you guys doing? What have I done? On what basis are you bringing me in for investigation?\"</p><br/><p>He was confused. What had he done? What rights did these policemen have to arrest him? Could it be that bringing reporters along with him was against the law?</p><br/><p>Chief Zhang's main focus was his scallion pancake business. Even though he had a high net worth, it was mostly because of his fixed assets. He also had a lot of money in his bank. His scallion pancakes were created by his own chefs, which could be a huge benefit. Within a year, his scallion pancakes could become popular throughout China. This could lead to him being one of the richest tycoons around. If his business also became successful in the international market, he would be making tremendous amounts of money, even more so than if he opened a hotel.</p><br/><p>Lin Fan blinked his eyes and looked at the situation unfolding before his eyes. What the heck was going on?</p><br/><p>Don't celebrate too early as things could still go wrong!</p><br/><p>Here's where tragedy strikes. First, you get cocky and then karma strikes.</p><br/><p>Even until then, Chief Zhang was still unable to comprehend the situation.</p><br/><p>The chefs cowardly lowered their heads. How could things have happened so quickly? It didn't even make any sense.</p><br/><p>The reporters flared up. What was going on? They began to get angrier.</p><br/><p>Could it be that Master Lin has a close personal relationship with the police, and doesn't need to be taken away?</p><br/><p>From what they could see, this was the only possibility. What other reason could there be?</p><br/><p>One reporter questioned, \"What happened to Chief Zhang? Why is he being taken in for investigation?\"</p><br/><p>Another said, \"Everybody, I'm a reporter from Shanghai Publications. Chief Zhang is an entrepreneur in the Shanghai food industry. May I ask what wrong has he committed?\"</p><br/><p>There were many discussions among the surrounding residents.</p><br/><p>\"From what I've heard, Master Lin has a great relationship with the police. Could it be that he called the police to ask them to take Chief Zhang away?\"</p><br/><p>\"Exactly! How could they take him in for no rhyme or reason? Chief Zhang didn't commit anything wrong!\"</p><br/><p>\"We should take a photo of this and put it up on the internet. This is violent law enforcement!\"</p><br/><p>\"Taking someone away for no reason. Isn't there any law regarding this?\"</p><br/><p>Chief Zhang composed himself, \"You can take me away, but at least give me a reason! I'm a very honest and upright person. I have done nothing wrong before. What rights do you have to take me away?\"</p><br/><p>Director Zhang spat and pointed at Chief Zhang. \"You said that you are an upright person? Then what did you put into your scallion pancakes?\"</p><br/><p>Chief Zhang was stunned. He innocently asked, \"What do you mean by that? That is my secret recipe, what else could I have added in?\"</p><br/><p>Director Zhang took out a document from his bag. \"What secret recipe are you babbling about? You have so many prohibited ingredients in your scallion pancakes, causing your customers to get addicted to them after eating them. As the boss of a hotel, you knew the consequences yet you still carried on with your plan. Take a look! You've completely exceeded the legal amount! So much so that those who have eaten your scallion pancakes are addicted to it in no time. And yet you still dare call it your secret recipe.\"</p><br/><p>\"How can that be?\" Chief Zhang was stunned. He snatched the document over and scanned through it. He was trembling while looking through the names of the prohibited ingredients. He glared over at the chefs, and angrily shouted at them, \"D*mn you guys! How dare you all do this to me!\"</p><br/><p>He dared not imagine that the chefs actually had the guts to put those ingredients into the scallion pancakes. They could have killed someone! When Chief Zhang thought of the consequences, he was stunned. He knew he was done for. Completely and thoroughly done for.</p><br/><p>He was afraid that if he did not explain the situation correctly, that it had nothing to do with him, he would also be brought into jail.</p><br/><p>\"It was none of our business! We knew nothing about it!\" The chefs shouted. \"He made us do it! We really didn't know anything about it!\"</p><br/><p>When Chief Zhang heard that, he almost spurted out blood. He never imagined that the situation would become like this.</p><br/><p>At this moment, he thought about the entire scallion pancake situation. Like how his customers would squeeze in front of his shop doors like maniacs, dying to eat his scallion pancakes.</p><br/><p>Chief Zhang deeply regretted everything that had happened. As he gave more thought about the situation, he realized that he must have been blinded by the booming sales of his scallion pancakes at the moment. In the past, he would definitely have realized that something was fishy. He only had himself to blame for placing too much trust in the chefs. He never expected that the chefs would do something like that.</p><br/><p>\"You…...all of you!\" Chief Zhang anxiously pointed towards the chefs. If he were to accept all the blame in this issue, he would be completely done for. If there was only one item on the list of prohibited items that were used, he would have let it go. However, those b*stards added so many different items.</p><br/><p>What Chief Zhang didn't know was that the chefs were actually afraid that the result of the sales of the scallion pancakes would not be up to his expectations, and hence decided to band together to create something addictive.</p><br/><p>The chefs yelled, \"We have evidence that it was him who wanted us to use those ingredients! It has nothing to with us!\"</p><br/><p>Chief Zhang, \"...\"</p><br/><p>Liu Xiao Tian shook his head and waved his hand, \"Bring them all away.\"</p><br/><p>Silence befell the place. Stunned, the residents and the reporters didn't make a single movement. Just like in a fairy tale, the few words that were just spoken were all they could think about.</p><br/><p>Director Zhang said, \"Dear residents, if you have consumed the scallion pancakes from Grand Ocean Hotel, I suggest you go for a checkup at Ren He Hospital. We have already set up a special access for such a matter and you can go directly for the checkup. You must take this matter seriously. The ingredients used might have hidden harmful effects on your body. The earlier you get it checked up, the earlier you will recover.\"</p><br/><p>Director Zhang took his leave. He had to go to the Food and Drug Administration to check out what other ingredients these scallion pancakes had. The initial findings were only from the hospital, which would definitely not be comparable to the findings from the Food and Drug Administration.</p><br/><p>The townsfolk:</p><br/><p>\"Why did it turn out like this? How can it be?\"</p><br/><p>\"What the f*ck! He actually dared to put prohibited ingredients into his scallion pancakes?\"</p><br/><p>\"I eat at least ten of them a day. Could I be addicted to it?\"</p><br/><p>\"F*ck! How could he do such a thing!\"</p><br/><p>Frequent customers of Grand Ocean Hotel were shocked. Their faces were white as sheets. It was as if they had seen a ghost. They didn't dare believe that what they had been happily eating all this while were poisonous ingredients.</p><br/><p>\"Haha, this is all too funny. So this was how those scallion pancakes that you've been eating were made?\"</p><br/><p>\"Ahh, I dare not imagine so! How can the boss of such a big hotel dare to do such a thing?\"</p><br/><p>\"I've already said it before. It's still the safest here with Master Lin.\"</p><br/><p>\"Definitely! They can only blame themselves for not believing it. And they still want to say that Master Lin is no good? Master Lin doesn't even have to bother. Even if they don't turn up, he is still able to sell his 10 pieces of scallion pancakes every day.\"</p><br/><p>\"Even if there is no one else, I can buy all the scallion pancakes all by myself, and at the same time I can thank them for their generosity.\"</p><br/><p>\"Everyone take a closer look. We'll see if any of these people are shameless enough to queue up for Master Lin's scallion pancakes tomorrow.\"</p><br/><p>\"Take a look, Master Lin is calm and composed. He doesn't even take this matter to heart. None of this has even affected his mood.\"</p><br/><p>…</p><br/><p>Lin Fan stood outside his door. He tore off the test results sheet from the Food and Drug Administration and pasted it onto the signboard of his cart.</p><br/><p>Such a small action yet it was overbearing.</p><br/><p>Certificate of conformity for food.</p><br/><p>Genuine food for fair prices didn't require any opinions or remarks for justification.</p><br/><p>At this moment, the reporters shifted their gaze towards Master Lin.</p><br/><p>Master Lin took a look around him, then calmly proceeded back into his house to take a sip of his tea.</p><br/><p>What else could be said about the situation?</p><br/>\n</div>"}