{"title": "Chapter 166: Hope to work together again!", "id": 166, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-166-hope-to-work-together-again", "volume_title": "Volume 2", "body": "<h1>Chapter 166: Hope to work together again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 166: Hope to work together again!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The surrounding townsfolk gasped in surprise. They were in awe of Little Boss' ability. After Little Boss' test, they saw that numerous methods couldn't be used to unlock the door. They also gained a new interest in the Supreme Tiger Electronic Fingerprint Doors.</p><br/><p>One of the townsfolk asked curiously, \"Little Boss, I use a Joyful Electronic Burglar-Proof Door at home. How long would you take to unlock it?\"</p><br/><p>Lin Fan laughed as if oblivious to how shocking it sounded, he said, \"Probably one or two minutes, maybe less.\"</p><br/><p>The townsfolk were astounded. They realized that there was almost no door that couldn't be opened by Little Boss. It was rather scary to think about. If Little Boss decided to become a burglar, there was probably not a single home that could keep him out.</p><br/><p>At that moment, the people at Joyful Locks Company, who were watching the broadcast, wanted to vomit blood. They really felt like cutting up that guy who asked the question.</p><br/><p>However, they had nothing to say about Master Lin. They didn't dare to challenge him personally like Chief Zhang did. They didn't have the guts to do it. They understood the quality of their own products all too well.</p><br/><p>The reporters were recording the scene from the side. The situation was nothing like what they had expected. In their eyes, someone had to be defeated in this challenge. They thought that if Master Lin was defeated, everyone would say that he was all talk and no substance. If Supreme Tiger Electronic Fingerprint Doors was defeated, everyone would say that they had bad quality products.</p><br/><p>However, even though the Supreme Tiger Electronic Fingerprint Door was defeated, it seemed that they had gained even more. They stood above all the other electronic doors and their doors became the electronic doors that could resist Master Lin for the longest.</p><br/><p>Due to how widespread the internet had become, and the fact that it was all broadcasted, this just became a perfect advertisement for them.</p><br/><p>Chief Zhong stepped forward and shook Lin Fan's hand, \"I'm in admiration of Master Lin's skills. If possible, could you please leave your number?\"</p><br/><p>Lin Fan laughed, \"Sure.\"</p><br/><p>Then, the two of them traded phone numbers. Although Chief Zhong had lost to Master Lin, he wasn't sore about it at all. In fact, he was delighted. To receive an acknowledgment from Master Lin was more effective than any form of advertisement.</p><br/><p>Although eight minutes wasn't long at all, his Supreme Tiger Electronic Fingerprint Door was the only electronic door that was able to last so long against Master Lin. The other electronic doors only lasted one or two minutes against him and anyone could easily see that.</p><br/><p>Two employees, each holding onto a black suitcase, stood behind Chief Zhong. In those two suitcases was two million dollars of cash.</p><br/><p>Fraud Tian took a glance and was ecstatic. It was all money! He was in admiration of Lin Fan. Lin Fan was not only young, but he also managed to earn so much money so quickly. It really made him envious.</p><br/><p>Chief Zhong said with a smile, \"Master Lin, if one is willing to bet, one must be willing to accept his loss. Please accept the two million dollars.\"</p><br/><p>\"Chief Zhong, that is so courteous of you.\" Lin Fan was smiling so much that his eyes became almost crescent shaped. He made eye contact with Chief Zhong, then patted him on his shoulder to express his gratitude.</p><br/><p>Chief Zhong smiled but said nothing. He sighed in his heart.</p><br/><p>Master Lin is such a sensible person.</p><br/><p>Lin Fan grinned. He could accept the two million dollars with a clear conscience. He had helped them by praising the Supreme Tiger Electronic Fingerprint Doors on broadcast and it was even more effective than shooting a commercial.</p><br/><p>If it was someone else, surely they would have talked down Supreme Tiger Electronic Fingerprint Doors after unlocking the door, instead of praising them like he did. Of course, he wasn't just blindly praising them. It was all truthful. The Supreme Tiger Electronic Fingerprint Doors were indeed worthy of his praise.</p><br/><p>A reporter asked, \"Master Lin, after receiving two million dollars, what are your thoughts?\"</p><br/><p>Lin Fan chuckled, \"I don't really have any thoughts, but I have to say that Chief Zhong is a good man. He is a man of his word and he is willing to accept his loss. Only someone like him can produce quality products like the Supreme Tiger Electronic Fingerprint Doors.\"</p><br/><p>Chief Zhong said, \"You're flattering me. Master Lin is too courteous. To meet the needs of the consumers, I naturally have to be tight on the quality of my goods. When our next product is released, you have to come and do a test for us. Don't even think about evading it!\"</p><br/><p>Lin Fan patted Chief Zhong's shoulder, \"Of course. Whatever is within my capabilities, I will not evade.\"</p><br/><p>Chief Zhong laughed, \"As long as the next product can last nine minutes, it will be our company's greatest improvement.\"</p><br/><p>\"Hahaha…\" the two of them laughed together.</p><br/><p>The reporters looked at the expressions on the two of their faces and were lost for words. This had to be the rumored 'Mutual C*cksucking in Business'.</p><br/><p>What about the big news that they had talked about?</p><br/><p>In the broadcast room.</p><br/><p>\"I'm convinced. What happens after this is just routine.\"</p><br/><p>\"I have a pretty good feeling. I'm prepared to get a Supreme Tiger Electronic Fingerprint Door. The company's boss seems like a good guy. More importantly, their product could withstand Master Lin for eight minutes. That's something to be proud of.\"</p><br/><p>\"I was just thinking...what is there that Master Lin doesn't know how to do?\"</p><br/><p>\"^Master Lin doesn't know how to make children.\"</p><br/><p>\"666!\"</p><br/><p>…</p><br/><p>The surrounding townsfolk all gathered around.</p><br/><p>\"How much do your doors cost? I want one custom-made.\"</p><br/><p>\"My burglar-proof door at home has been used for ten years. It's getting old and I'm ready to replace it.\"</p><br/><p>\"Do you have an exclusive retail shop in Shanghai?\"</p><br/><p>\"I want to buy a door too.\"</p><br/><p>The townsfolk asked incessantly. They appeared to be very interested in the Supreme Tiger Electronic Fingerprint Doors.</p><br/><p>Chief Zhong laughed, \"Alright, alright. Thank you all for your support. We do have an exclusive retail shop in Shanghai. Take this name card to the Shanghai retail shop and enjoy a 30% discount, with free installation on top of that. If there are any issues with the service, give me a call.\"</p><br/><p>After that, Chief Zhong took out a stack of name cards and made a signature behind each of them. He distributed them to the townsfolk. Naturally, the townsfolk were all delighted. The 30% discount moved them and they were all prepared to go take a look.</p><br/><p>Initially, after receiving the two million dollars, Lin Fan wanted to treat Chief Zhong and the rest to a meal. However, they already had airplane tickets booked. It seemed like he would have to wait for another time.</p><br/><p>In the end, Chief Zhong and his employees were perfectly contented. All the reporters had left.</p><br/><p>This report was a little hard to write. The happenings were unusual and unexpected. The reporters had to go back and think it through.</p><br/><p>In the shop.</p><br/><p>\"You have to treat us tonight,\" Fraud Tian murmured. Two million dollars...that kid had become a millionaire.</p><br/><p>Lin Fan chuckled, \"Alright, I'll treat. Everyone is invited.\"</p><br/><p>Fraud Tian became emotional. He could enjoy a big feast once again.</p><br/><p>Zhao Zhong Yang pointed the lens at Lin Fan, \"Master Lin, what thoughts do you have now? Please, share a little with your friends watching the broadcast.\"</p><br/><p>Lin Fan looked at the lens and sniggered, \"Everything happened according to my expectations.\"</p><br/><p>In the broadcast room.</p><br/><p>\"666...I give a hundred points for that comment!\"</p><br/><p>\"Awesome! My brothers, send this man some gifts!\"</p><br/><p>\"Master Lin, tell us, was this all planned? Why was the outcome so different from what we expected?\"</p><br/><p>\"Master locksmith Master Lin. From now on, whoever is Master Lin's neighbor has to be careful. Otherwise, when you're not around, Master Lin might just go to your house and have a nice chat with your wife.\"</p><br/><p>\"I'm begging Master Lin to accept a disciple! I'll become your disciple, Master Lin. I only ask that you pass on these skills to me!\"</p><br/>\n</div>"}