{"title": "Chapter 162: The fans that shout 666", "id": 162, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-162-the-fans-that-shout-666", "volume_title": "Volume 2", "body": "<h1>Chapter 162: The fans that shout 666</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 162: The fans that shout 666</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>At the hospital!</p><br/><p>To Zhao Zhong Yang, today was an anticipated day. He could finally discharge from the hospital after the surgery.</p><br/><p>The doctor said, \"Congratulations, you can be discharged now.\"</p><br/><p>Zhao Zhong Yang, who was lying on the bed with a radiant face, smiled and looked at his handphone camera as he shouted, \"Did you hear that? Your Brother Yang can finally discharge from the hospital.\" </p><br/><p>The fans in the online broadcast room immediately became excited. They had followed Zhong Zhao Yang's health progress since his surgery till now, watching him defeat his illness.</p><br/><p>\"Congratulations Brother Yang for having a new life.\"</p><br/><p>\"I feel like crying. Our Brother Yang is no doubt a person who will live long. He is still so strong.\"</p><br/><p>\"Brother Yang, you should go and broadcast Master Lin in future since he is so famous now.\"</p><br/><p>\"Cool... I support.\"</p><br/><p>... </p><br/><p>The doctor stood there, feeling happy for him too. It was so rare to meet such a kind-hearted patient.</p><br/><p>\"Boy, do exercise more in future and take care of your diet. Also, remember to come back for your check-ups.\"</p><br/><p>Zhao Zhong Yang nodded, \"Thank you, doctor. This period has been tough for you all.\" </p><br/><p>Zhao Zhong Yang parents were over the moon. During this period when he had been in the hospital, they were worried because their son was not as energetic as before. </p><br/><p>After getting discharged from the hospital.</p><br/><p>\"The air outside is still fresher after all,\" Zhao Zhong Yang took a deep breath and turned around, \"Dad, Mum, please go home first. I'm going out to take a walk.\"</p><br/><p>\"Yang Yang, you just got discharged from the hospital. You should take more rest,\" Mother Zhao said worriedly.</p><br/><p>\"Mum, don't be worried. The doctor already said that I should exercise more. There will not be any problems,\" Zhao Zhong Yang said. </p><br/><p>At last, after much convincing, his parents finally left.</p><br/><p>Zhao Zhong Yang shouted at his phone, \"Let's move out! Destination: Master Lin's shop.\"</p><br/><p>… </p><br/><p>At Cloud Street. </p><br/><p>Lin Fan's hand had almost recovered fully and he no longer needed to wear his glove. However, if he used too much force, he would still feel pain. The scallion pancakes could wait. </p><br/><p>The townsfolk who always bought his scallion pancakes also understood that and did not rush Lin Fan. Every day, they would visit Lin Fan to check on his progress. </p><br/><p>Suddenly, a noise came from outside.</p><br/><p>\"Everyone, this is Cloud Street. We have reached Master Lin's shop…\" </p><br/><p>Lin Fan raised his head and walked outside to take a look.</p><br/><p>Zhao Zhong Yang ran in with a smile on his face, \"Master Lin, do you remember me?\"</p><br/><p>Lin Fan smiled \"I remember, you're the broadcaster. How is your recovery coming along? Are you feeling better?\"</p><br/><p>\"Master Lin, thank you for reminding me the other time, if not I would definitely be in a wreck now.\" Zhao Zhong Yang felt very grateful. He took out his camera and faced Lin Fan, \"Everyone, this is Master Lin. Do all of you feel excited?\"</p><br/><p>Inside the broadcast, gifts started coming in, and there was a row of comments '6666…' </p><br/><p>Some of the newcomers did not know who Master Lin was. However, after reading the comments of others, they finally understood the hype surrounding Master Lin.</p><br/><p>Zhao Zhong Yang stood in front of Lin Fan, \"Master Lin, can I stay with you and broadcast in the future?\"</p><br/><p>Lin Fan suspiciously asked, \"Broadcast?\"</p><br/><p>Zhao Zhong Yang nodded, \"Yes, this is broadcasting, to let everyone see your daily life. I promise, I will not interrupt your work and will not tell anyone your secrets.\"</p><br/><p>\"I do not work much every day and do not have any secrets,\" Lin Fan laughed and took Zhao Zhong Yang's phone. He waved to the camera, \"Hello everyone, I'm Master Lin.\" </p><br/><p>At that moment, everyone in the broadcast room got excited.</p><br/><p>\"666…, Master Lin greeted us.\"</p><br/><p>\"I'm so excited and happy. Master Lin finally greeted us.\"</p><br/><p>\"Master Lin is so handsome, I want to give you my baby.\"</p><br/><p>\"Let's not talk so much but just welcome Master Lin, starting with 50 rockets…\"</p><br/><p>Although it was the first time Lin Fan was broadcasting, he was not nervous. He said, \"Thank you 'Little Brother also wants to become God Hao' for your 50 rockets. If you tell me your birth numbers, I can read your fortune for you as your gift.\"</p><br/><p>\"Wah, Brother God Hao, you are so lucky.\"</p><br/><p>\"F*ck, Master Lin himself offered to help you to read your fortune! You have heavenly luck.\"</p><br/><p>Little Brother also wants to become God Hao, \"Thank you, Master Lin, but I do not know what my birth numbers are. However, my birth date is 9 June 1991 and I was born at 7 am.\"</p><br/><p>Lin Fan smiled, \"That is enough.\" </p><br/><p>Zhao Zhong Yang stood by the side, thinking about how great Master Lin was. Not only did he know how to read fortunes, he also broadcasted so well. If Master Lin entered the world of broadcasting, Zhao Zhong Yang himself would not be able to survive. </p><br/><p>Lin Fan put on an act and used his rubbed his fingers together. Everyone who saw this on the screen was surprised.</p><br/><p>\"One look and you would know Master Lin is a great man. His hand gestures are so abnormal.\"</p><br/><p>\"666, it feels like he's so good at everything.\"</p><br/><p>…</p><br/><p>Lin Fan smiled, \"'A little sheep in the morning', your fortune is not bad. Don't worry about eating or drinking. Stay with your current career. After you reach thirty, it will be fruitful. However, this is still quite far ahead. These few days when you have nothing to do, go and take a walk in the park and you might find another female sheep.\"</p><br/><p>\"What a joke, I puked out my 82 years old mineral water, what the heck is this female sheep about.\"</p><br/><p>\"Ha ha, could it be that Brother God Hao wants to f*ck the female sheep?\"</p><br/><p>\"What kind of attitudes do you all have? Master Lin is saying that Brother God Hao has luck with the opposite sex and will be able to exit his single life.\"</p><br/><p>Little Brother also wants to become God Hao said, \"Master Lin, is this true? Don't lie to me. I am an introvert who stays at home every day, and I don't even know any girls.\"</p><br/><p>Lin Fan smiled, \"Go and try. Even if I lied to you, you would still be able to get some fresh air, right?\"</p><br/><p>Little Brother also wants to become God Hao said, \"Thank you, Master Lin. I'm left with little allowance, but I will give you another 10 rockets...\"</p><br/><p>Lin Fan handed the phone to Zhao Zhong Yang. This broadcast was really interesting.</p><br/><p>Inside the broadcast room, some fans also sent gifts.</p><br/><p>\"Master Lin, read my fortune too. I will send 10 rockets.\"</p><br/><p>\"Sob, I am so poor and can only send 1 rocket. Master Lin, help me count mine too.\"</p><br/><p>Zhao Zhong Yang looked at the situation in the broadcast room and pretended to be angry, \"All of you abandoned me. But once Mater Lin started broadcasting, all of you all started giving gifts to him. What about me?\"</p><br/><p>\"Don't be angry, Brother Yang. I will give you 20 rockets.\"</p><br/><p>Zhao Zhong Yang laughed, \"I'm just joking. Since everyone is so familiar, there is no need for gifts. Never thought Master Lin would be so good at broadcasting too. From now on, I will be with Master Lin. Are you all happy?\"</p><br/><p>\"Yes. But even if you are with Master Lin, you still must remember to come online on time.\"</p><br/><p>\"I'm so excited. If Master Lin picks me in the future to give some advice, I would be so happy.\"</p><br/><p>Zhao Zhong Yang smiled, \"All of you think very positively but all these will only be possible if Master Lin agrees. If Master Lin does not agree, I cannot be with him to broadcast. Everyone, let's compliment Master Lin so that I can stay with him and broadcast.\"</p><br/><p>Zhao Zhong Yang looked at Master Lin with a face full of smiles, \"Master Lin, can I broadcast you in future? Don't worry, I'm very obedient and I can take hardships. If there are any troubles, I will be the first one to protect you.\" </p><br/><p>Lin fan laughed and thought that this was very amusing, \"Sure...\"</p><br/><p>Zhao Zhong Yang was very excited, \"Have you heard that? Master Lin agreed...\"</p><br/><p>\"I will shout 666…\"</p><br/>\n</div>"}