{"title": "Chapter 188: The law doesn't apply to dogs", "id": 188, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-188-the-law-doesnt-apply-to-dogs", "volume_title": "Volume 2", "body": "<h1>Chapter 188: The law doesn't apply to dogs</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 188: The law doesn't apply to dogs</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Xiao Ya... Xiao Ya...\" Sister Hong rushed into another room. Laughter was coming from that room.</p><br/><p>As she opened the door, she saw Xiao Ya playing with a bunch of puppies. Tears of joy streamed down her weary face.</p><br/><p>Xiao Ya looked up at Sister Hong. \"Mummy!\" she exclaimed happily. The dogs were frolicking around her.</p><br/><p>Sister Hong rushed up and hugged Xiao Ya, heaving a huge sigh of relief.</p><br/><p>Outside.</p><br/><p>Elder Dog Nicholas was sauntering on his four stubby legs, walking out of the building while wagging his tail.</p><br/><p>\"Woof woof!\"</p><br/><p>Elder Dog Nicholas walked towards Lin Fan. \"Aren't we amazing? When will you give us some of your scallion pancakes?\"</p><br/><p>Lin Fan gave a huge thumbs up. \"Elder Dog, you're really amazing!\"</p><br/><p>The police officers stared in disbelief as they looked at the scene before them. Everything that they thought they knew was all turned upside down.</p><br/><p>In the live broadcast chat.</p><br/><p>\"Elder Dog Nicholas is just too amazing! I'm going to send him a gift.\"</p><br/><p>\"Damn, watching this live broadcast today was totally worth it. I've just witnessed a miracle today.\"</p><br/><p>\"Who said mutts are useless? I'll go and punch that person.\"</p><br/><p>\"Ten burning arrows for him!\"</p><br/><p>\"I can only express my gratitude by sending some gifts. Say no more, take these 20 rockets as a gift!\"</p><br/><p>...</p><br/><p>The police officers looked at Master Lin. They were fortunate to have him, but they never imagined that this was possible. Right now, they had to call an ambulance to tend to the kidnappers.</p><br/><p>\"These bite marks look serious, but I don't think the dogs will get into trouble, will they?\"</p><br/><p>The police officer shook his head. \"The law doesn't apply to dogs.\"</p><br/><p>The police officers detested the kidnappers. They had received their retribution for what they did.</p><br/><p>They would have loved for the kidnappers to bleed to death but they were police officers. Duty came before everything else, so they still had to call an ambulance to tend to the kidnappers.</p><br/><p>Lin Fan looked at Elder Dog Nicholas. \"Why don't you go downstairs and wait for us?\"</p><br/><p>Elder Dog Nicholas barked twice and the other dogs who were playing around immediately walked over as they moved downstairs neatly.</p><br/><p>Elder Dog Nicholas's legs were too short to go downstairs. As he extended his legs to take a step, he rolled down the stairs instead.</p><br/><p>He was in a daze, feeling slightly embarrassed.</p><br/><p>Husky pranced over and held onto Elder Dog Nicholas by his neck, carrying him downstairs.</p><br/><p>Downstairs.</p><br/><p>Husky looked at Elder Dog Nicholas smugly, but this was just an invitation for Elder Dog Nicholas to whack him with his paws.</p><br/><p>Presumptuous!</p><br/><p>...</p><br/><p>Zhao Zhongyang took his phone, recording the terrible state in which the kidnappers were in. \"Everyone take a look. These kidnappers have done terrible things. Just because of money, they have inflicted suffering on others, and it is good that they have received their just deserts.\"</p><br/><p>\"How despicable! They deserve this!\"</p><br/><p>\"Everyone should recognize these dogs. They've done well in wrecking these kidnappers.\"</p><br/><p>\"They deserved to get mauled by the dogs. Not dying is already showing enough mercy. \"</p><br/><p>\"So cool! Although Elder Dog Nicholas has stubby legs, he was still able to wreck the kidnappers. Consider me a fan of Elder Dog Nicholas from now on!\"</p><br/><p>\"+1!\"</p><br/><p>...</p><br/><p>Sister Hong's husband grabbed Lin Fan's hands and thanked him profusely. \"Master Lin, I can't thank you enough. I am forever grateful to you.\"</p><br/><p>Lin fan shook his hands. \"Don't thank me. If you want to thank anyone, it should be all these little dogs here. If not for them, we would never have found her.\"</p><br/><p>Sister Hong's husband nodded his head. \"Yea that's right! I should thank all the dogs who helped us with this!\"</p><br/><p>The male driver lay on the floor whimpering in agony. \"Save me... save me... I've been bitten by dogs... I don't want to die...\".</p><br/><p>Lin Fan looked over at the male driver whose pants were torn into shreds after being bitten by a multitude of dogs. He chuckled. The male driver completely deserved it.</p><br/><p>The kidnappers would never understand how they got caught.</p><br/><p>The emergency medical team arrived at the scene.</p><br/><p>As they surveyed the scene, they couldn't help but gasp in horror. The scene was full of bloodstains and tattered clothes. The smell was repulsive.</p><br/><p>At first, the nurses didn't know who these people were and treated them as per usual. But when they learned that they were kidnappers, their attitude took a turn. One of the nurses 'accidentally' lost control of her hand, causing the stretcher to fall to the ground with a thud. The kidnapper on the stretcher groaned in agony.</p><br/><p>One could pass it off as an accident, but it 'coincidentally' happened to the three kidnappers.</p><br/><p>Downstairs.</p><br/><p>The residents of the small neighborhood didn't know what was going on at first. Upon learning that the three were kidnappers and that they were brought to justice by the dogs, every single one of them applauded loudly.</p><br/><p>It was simply too miraculous. These dogs deserved every single bit of admiration for they were simply too amazing.</p><br/><p>\"Master Lin, what's going to happen to these dogs?\" a police officer asked Lin Fan.</p><br/><p>\"They'll find their own way back,\" Lin Fan grinned.</p><br/><p>The policemen nodded. This case had caused them to be puzzled.</p><br/><p>\"Master Lin, can you actually talk to dogs and understand what they are saying?\" a policeman asked.</p><br/><p>The people who heard that question turned their heads, curious to know the answer.</p><br/><p>\"Just a little bit. To say I completely understand is a little bit overboard.\" LIN fan replied humbly.</p><br/><p>In the eyes of the people, Master Lin was being overly humble. Master Lin's 'little bit' could very much be a good understanding of dog speech.</p><br/><p>\"Elder Dog Nicholas, it's time to go back. Be safe and don't beat the red lights!\" Lin Fan chided Elder Dog Nicholas.</p><br/><p>\"What's a red light?\" Elder Dog Nicholas barked.</p><br/><p>Granted, talking to dogs about traffic rules was as good as talking to the wind.</p><br/><p>Everyone laughed heartily. Now that everything was good, everyone's mood started to lighten up.</p><br/><p>At Cloud Street!</p><br/><p>Lin Fan posted on Weibo, 'A big thanks to everyone who helped out in spreading the news online. The child has been found and the kidnappers have been brought to justice.'</p><br/><p>This garnered a huge response on Weibo. This wasn't any other ordinary case. Any ordinary person would have helped out however they could. The Internet users all heaved a sigh of relief as the case was brought to a close.</p><br/><p>At that moment, Lin Fan kept his phone. What happened next was unexpected.</p><br/><p>More than ten over dogs gathered outside Master Lin's shop with their tails wagging and eyes wide, looking at Lin Fan with puppy eyes.</p><br/><p>Elder Dog Nicholas sat in front of the group, barking.</p><br/><p>\"Give us scallion pancakes! Give us scallion pancakes!\"</p><br/><p>The people walking past all turned their heads, looking at the odd scene that was going on outside Master Lin's shop.</p><br/><p>Lin Fan stood in front of the scallion pancake counter and sighed. A deal's a deal.</p><br/><p>He might have to change the name of scallion pancakes in the future.</p><br/><p>\"Doggie scallion pancakes.\"</p><br/><p>People were already fighting each other over the scallion pancakes. But right now, these dogs could get a scallion pancake as and when they liked without even needing to put up a fight.</p><br/><p>Piping hot servings of scallion pancakes came out of the oven.</p><br/><p>The people who were walking past all started salivating. If only those scallion pancakes were theirs. This batch was for the dogs only, and they didn't have a share in it. The only way of getting it would be to wrestle it from the dogs, but that would just make them a laughing stock.</p><br/>\n</div>"}