{"title": "Chapter 183: Sister Hong's missing daughter", "id": 183, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-183-sister-hongs-missing-daughter", "volume_title": "Volume 2", "body": "<h1>Chapter 183: Sister Hong's missing daughter</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 183: Sister Hong's missing daughter</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>On the opposite side of the road, at Sister Hong's shop, there were several policemen in the shop. The doorway of the shop was surrounded by the shop owners and there were even townsfolk preparing to buy scallion pancakes.</p><br/><p>Lin Fan asked curiously, \"Fraud Tian, what happened over there at Sister Hong's shop?\"</p><br/><p>Fraud Tian took a puff from his cigarette before putting his phone down. He replied, \"I don't know. I'll go over and check it out.\"</p><br/><p>Zhao Zhong Yang pointed his phone camera outside and he said, \"Looks like there's some commotion across the road. I have no idea what is going on.\"</p><br/><p>\"Brother Yang, let's go check it out.\"</p><br/><p>\"When there's trouble, there's Brother Yang. Brother Yang, hurry up and bring us there to take a look.\"</p><br/><p>…</p><br/><p>Lin Fan stood at the doorway and looked on with a puzzled expression. Suddenly, Fraud Tian rushed over and told him, \"Something big has happened, Sister Hong's daughter is gone.\"</p><br/><p>\"How can it be?\" Lin Fan remembered that when he had reached the shop just now, she had still been playing with her poodle, how could she suddenly disappear?</p><br/><p>Wu You Lan walked over to the other side and Lin Fan followed her as he was also curious about what was going on.</p><br/><p>When they got to Sister Hong's shop, the people surrounding the shop were all in deep discussion. They were wondering if the child had been kidnapped, something which was appearing more and more frequently on the news.</p><br/><p>\"What happened?\" Lin Fan stood outside and asked some of the shop owners.</p><br/><p>\"Little Boss, Sister Hong's daughter is missing. She searched for her for 20 minutes, searching the whole of Cloud Street to no avail. Afterward, she reported it to the police and they came down to see what's going on,\" one of the owners replied.</p><br/><p>Lin Fan kept squeezing his way until he made it into the shop. He saw Sister Hong's face streaming with tears, looking completely stunned while she was being questioned by police officers.</p><br/><p>\"My little girl...\" Sister Hong did not know what to do, she was just pinning all her hopes on the police.</p><br/><p>Lin Fan stepped forward and asked, \"Sister Hong, what in the world happened?\"</p><br/><p>When Sister Hong saw Lin Fan, it was like she saw a glimmer of hope. She grabbed Lin Fan's hands and said, \"Little Boss, you've got to help me. My little girl is gone. I've searched all over Cloud Street and I still can't find her.\"</p><br/><p>Lin Fan sympathized with Sister Hong and understood how she was feeling. At that moment, Sister Hong grabbed onto the policeman next to her and very anxiously asked him, \"Have you found her? Have you guys found her yet?\"</p><br/><p>The policeman's palm had been squeezed by Sister Hong until it was red but they were also very anxious themselves. They said to her, \"Calm down, this is not the time for panic. We are going through the video footage right now.\"</p><br/><p>Lin Fan walked to the small room in the back and saw a policeman looking at the screen, staring at the footage from the past half an hour.</p><br/><p>\"Officer sir, how is it? Did you find anything new?\" Lin Fan asked.</p><br/><p>The policeman saw Lin Fan and he was stunned for a moment. He recognized Lin Fan. He had seen him before when he had been working with Chief Liu.</p><br/><p>\"Still nothing so far, Master Lin. I'm still at the part where she is playing with the dog. I'll be reaching the important part soon,\" the policeman replied.</p><br/><p>Lin Fan looked at the monitor and saw a few women in the shop looking at clothing. The little girl was outside the shop playing with her poodle and Sister Hong was interacting with her customers, who were looking at various pieces of clothing.</p><br/><p>\"Hold on,\" Lin Fan said.</p><br/><p>The policeman paused the video and on the screen, there was a lady looking down and walking out of the shop and for some unknown reason, the poodle started following her. Naturally, the little girl followed as well.</p><br/><p>The screen also showed Sister Hong still interacting with her customers, oblivious to the fact that her daughter had left the shop.</p><br/><p>If only they could capture the lady's face and scan it, then they would be able to find her. However, the images captured by the camera were unclear and they could not see the face at all.</p><br/><p>The policeman said, \"The surveillance cameras only capture until this point. We feel that this lady on the screen is extremely suspicious. We must check the cameras on the outside.\"</p><br/><p>Lin Fan replied, \"The surrounding shops all have surveillance cameras installed. Maybe we'll be able to see which direction they went off in.\"</p><br/><p>Afterward, the police left the shop to go to the surrounding shops to check out the surveillance footage.</p><br/><p>Sister Hong was lying down in her shop while Wu You Lan was watching over her. Just as Lin Fan was about to leave the shop and follow the policemen, out of nowhere, Sister Hong had a sudden jolt of energy and ran towards them. She frantically asked them, \"Have you found...have you found her?\"</p><br/><p>Lin Fan tried to comfort her, \"Sister Hong, don't worry, we already have a general idea of what happened. We're going to the shop next door to check out the surveillance footage. Hopefully, we'll find some leads.\"</p><br/><p>Along the street, this was the only shop whose surveillance camera was able to capture what was happening along the road. The rest of the cameras were all pointed towards their own shop's doorway, unable to see anything happening on the road.</p><br/><p>Right now, since they were running out of leads, all the other shop owners were very anxious as well. They had been neighboring Sister Hong's shop for a very long time and they all loved her daughter. They would not be able to rest easy today if they did not know she was okay.</p><br/><p>\"Quick, everyone, go check your surveillance cameras, see if you all can find any leads.\"</p><br/><p>\"Our modern day networking is so advanced, it might be worth a try posting her picture on WeChat to see if we get any leads.\"</p><br/><p>Sister Hong was paralyzed and glued to the floor, her face was pale and lifeless. Afterward, she blamed herself by saying, \"It's all because of me. If my little girl doesn't come back, how am I going to live with myself?\"</p><br/><p>Lin Fan, in an attempt to comfort her, said,\" Sister Hong, don't worry, we will definitely find her.\"</p><br/><p>Fraud Tian brought him to the side and asked, \"Can you use your fortune-telling to read where she is?\"</p><br/><p>Lin Fan shook his head and replied, \"I can't. If only we could get a picture of the lady's face, only then would we have a chance.\"</p><br/><p>Fraud Tian was a little confused and did not get it. He then proceeded to ask Lin Fan, \"Don't they have a picture of the little girl? Why don't you just use that and you'll be able to find her.\"</p><br/><p>Lin Fan replied, \"It's no use, I've tried already. There are way too many possibilities. It's impossible to calculate.\"</p><br/><p>Lin Fan then asked the policeman, \"Can't we just use the cameras along the road? Maybe we'll be able to find something.\"</p><br/><p>The police replied, \"We already have someone on it. However, it's a tough and tedious job. I'm afraid it'll take too long and by they will be long gone.\"</p><br/><p>Sister Hong had already entered a state of complete panic. She had no idea what to do and didn't have any semblance of direction at all.</p><br/><p>\"Sister Hong, post her picture online. Looks like we'll have to rely on the good Samaritans online. Hopefully, they will be able to help us. The manpower will also be much larger,\" Lin Fan said as he himself felt powerless and unable to help. He was not a god after all. If only he knew how to track people, then that would be great.</p><br/><p>\"Yes, yes, post it online. There's still hope.\"</p><br/><p>The surround townsfolk were in deep conservation, all coming up with various ways to try to find her. When faced with this kind of issues, everyone was very caring, especially since, deep down, everyone was still very kind-hearted. Though not a certainty, getting so many hands involved may just lead to this situation taking a turn for the better.</p><br/><p>Zhao Zhong Yang broadcasted to everyone, \" Hello everyone, let's get the search for the girl started. Master Lin has already posted the girl's pictures and features on his Weibo. Everyone, please go online and share it with your social circles. If you guys find the girl, I vow that I, Zhao Zhong Yang, will post a photo of myself in female clothing on my Weibo.\"</p><br/><p>\"D*mn, it must be those child traffickers again. Once we find them, we'll beat them to death.\"</p><br/><p>\"Everyone, quickly go and study her picture as well as spread it around.\"</p><br/><p>\"Even if there wasn't the promise of seeing him crossdress, I'd still help. But now, I feel even more motivated.</p><br/><p>Lin Fan went to post her picture and particulars online, knowing that all that was left now was for him to try his best to find her.</p><br/><p>By now, Lin Fan's Weibo had become very popular. Once the news of the missing girl started spreading, everyone went and posted it around.</p><br/><p>…</p><br/>\n</div>"}