{"title": "Chapter 197: Interrogation", "id": 197, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-197-interrogation", "volume_title": "Volume 2", "body": "<h1>Chapter 197: Interrogation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 197: Interrogation</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Initially, Lin Fan didn't expect to catch such a big fish. When he first saw Wang Shen, he felt that he looked studious and had a look of good fortune. But it was a little weird. After reading his fortune, he was shocked.</p><br/><p>This Wang Shen was actually the mastermind behind a human trafficking organization. He started a service company to cover up his illegal deeds. Who knows how many children he trafficked and how many families he destroyed? In the end, all these sins had been accumulated by him.</p><br/><p>He was indeed a scary figure.</p><br/><p>Those children who got kidnapped practically all got sold to Wang Shen. Meanwhile, Wang Shen was based in Shanghai. On the surface, it looked like he was running a legal business but he was actually doing an illegal business behind the scenes.</p><br/><p>At the police station.</p><br/><p>Liu Xiao Tian pulled Lin Fan to the side, \"Master Lin, I will go lead the report on the other side. You can have a seat here. Wang Shen and the other man have been escorted into the interrogation room. The odds are not really on our side. Also, I am not following procedures for this case. If we can't find any proof, I'm afraid I might be in trouble.\"</p><br/><p>Lin Fan patted Liu Xiao Tian on his shoulder and said, \"Don't worry, I'm here. If anything happens, you can sell scallion pancakes with me.\"</p><br/><p>Lin Fan's first words made Liu Xiao Tian extremely confident. But his next words completely shocked him. Of course, he knew that Master Lin was just kidding. Even if he really lost his job, he wouldn't regret it. Sometimes when you trust someone, you fully trust him/her. If he didn't manage to find any proof, it could only mean that he wasn't capable enough. Justice will eventually prevail.</p><br/><p>Lin Fan just sat there while Liu Xiao Tian went to report to his chief. He didn't know what Liu Xiao Tian was saying to his chief but he took a long time. He only came out after forty minutes and his forehead dripping with sweat.</p><br/><p>Lin Fan stood up and asked, \"How was it?\"</p><br/><p>Liu Xiao Tian smiled, \"The chief believes in you too. He will act as if he doesn't know about this. But this time, we only have 12 hours because of security implications. There isn't any evidence and therefore we can't keep him here.\"</p><br/><p>Lin Fan nodded, \"Have you started the interrogation?\"</p><br/><p>Liu Xiao Tian nodded, \"It has started. But I don't have high hopes for it. If he really is Wang Er Mazi, it wouldn't be easy for an ordinary person to catch up with him. Furthermore, we don't have any evidence. He is definitely feeling relaxed. If we can't find anything wrong, he's going to be the last one laughing.\"</p><br/><p>Lin Fan said firmly, \"There's no 'if', he's definitely the one.\"</p><br/><p>Liu Xiao Tian looked at Lin Fan and asked, \"Why are you so sure?\"</p><br/><p>Lin Fan chuckled, \"I'm a fortune-teller, remember? But now there's no evidence, I doubt you'd believe me.\"</p><br/><p>Liu Xiao Tian nodded. This thing was a precarious situation after all. He was very willing to believe Master Lin but if he went to the higher-ups without any evidence at all, saying that this guy was Wang Er Mazi, saying that he's the leader of the human traffickers and saying that he must be sentenced; if he went to them and just claimed all that, he would be flamed to no end.</p><br/><p>An hour later.</p><br/><p>The interrogating officer came out and shook his head. \"Sir, there's nothing. Are you sure he's the one?\"</p><br/><p>Liu Xiao Tian believed Master Lin but the situation couldn't be confirmed. What else could they find out from him? Then, Liu Xiao Tian said firmly, \"He's the one. It's just that we currently don't have any evidence to arrest him but I guarantee that he's the one.\"</p><br/><p>The interrogating officers sighed in relief. At the same time, they felt a little more motivated. Even the chief was sure of it, this person must definitely be Wang Er Mazi. It's just that he was very slippery. Perhaps they couldn't do anything to him then but they definitely will when they find evidence.</p><br/><p>Lin Fan looked at what was happening and thought that if they continued this blind search, they'd just be wasting their time.</p><br/><p>\"Chief Liu, could I interrogate him myself?\" Lin Fan asked.</p><br/><p>Liu Xiao Tian looked at Master Lin and his expression changed.</p><br/><p>The officer beside him said, \"Chief, this isn't right. Furthermore, Master Lin wouldn't know the code of conduct when in the interrogation room.\"</p><br/><p>\"Master Lin, time is against us. I feel that we should let our professional officers do it. This Wang Shen didn't say much but if we bait him, we will definitely get something out of him.\"</p><br/><p>Lin Fan shook his head and said, \"I'm afraid you guys can't make it in time.\"</p><br/><p>The officers didn't show it but they were a little upset. They were professionals and even they couldn't get anything out of him, what made him think that he could? Of course, they knew that the chief trusted Master Lin a lot. Hence, they didn't say much.</p><br/><p>Liu Xiao Tian remained silent for a moment then he said, \"There's a special way to handle special occurrences. If there's any problem, I'll take responsibility for everything.\"</p><br/><p>In the interrogation room.</p><br/><p>Wang Shen sat there and he looked calm. He didn't seem nervous at all.</p><br/><p>When Lin Fan entered the room, Wang Shen bellowed, \"Young brother, you sure have a lot of connections. You're acting like the police station is your home. When I'm out of here, I'll definitely tell the world about this.\"</p><br/><p>Liu Xiao Tian looked at Wang Shen and said, \"Stop pretending. Tell us the truth. It's better for the both of us.\"</p><br/><p>The puzzled Wang Shen looked at Liu Xiao Tian, \"Chief Liu, you're wrong. I, Wang Shen, am an honest man. I do charitable deeds frequently. Why are you maligning me now? Ask yourself this question: shouldn't you feel guilty for accusing a good and kind citizen like me?\"</p><br/><p>Lin Fan sat down and looked at Wang Shen. \"Chief Wang, stop lying. I already know what kind of person you are. Your service company is indeed decent. You and your late wife used to run this business, right? But retribution came. Your wife died of a terminal illness and she died a painful death. I believe you know the situation better than anyone else.\"</p><br/><p>The eyes are the windows to one's soul. Any changes in one's thinking or feelings could be observed through their eyes. Wang Shen was expressionless as he just stared at Lin Fan. Then, he said, \"I don't know what you're talking about. Please provide evidence before accusing me. If not, I'll teach you a lesson when I get out of here. This is for accusing a good citizen like me.\"</p><br/><p>Wang Shen was a little nervous. He didn't know how this chap managed to know about his past. But judging from the situation, they didn't seem to have any evidence. Why should he be afraid?</p><br/><p>Lin Fan chuckled, \"Chief Wang, don't be nervous. I'm actually a fortune-teller. I've looked at your entire life experience and I also know about your future. Do you want to know?\"</p><br/><p>Wang Shen waved his hands, \"It's all a gimmick. I don't believe it. I'm just going to put it this way. If you have evidence against me, place it in front of me. If not, I'll definitely retaliate when I get out of here.\"</p><br/><p>Lin Fan stood up, \"Chief Liu, let's go.\"</p><br/><p>Liu Xiao Tian was stunned, \"Not asking any more questions?\"</p><br/><p>Lin Fan smiled at Wang Shen, \"Look at him. He's so full of vigor and. He's full of experience. But the guy in the other room won't be this calm. Otherwise, he wouldn't have charged towards me and punched me to let his boss escape.\"</p><br/><p>Wang Shen furrowed his brows and then he said, \"Stop dreaming. He has an intermittent mental illness. We can't rely on his words.\"</p><br/><p>Lin Fan smiled, \"Chief Wang, why are you so nervous? Even if he really tried to accuse you, what could he say?\"</p><br/><p>Liu Xiao Tian was stunned. Then, he looked at Lin Fan and said, \"Yeah, that's right.\"</p><br/><p>Wang Shen took a deep breath and shut his eyes. He didn't speak any further.</p><br/>\n</div>"}