{"title": "Chapter 196: This is a big fish!", "id": 196, "volume": 2, "url": "http://boxnovel.org/a-valiant-life-chapter-196-this-is-a-big-fish", "volume_title": "Volume 2", "body": "<h1>Chapter 196: This is a big fish!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 196: This is a big fish!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Chief Liu and his men arrived. When they saw the situation, they rushed forward.</p><br/><p>When the man who had been standing behind Wang Shen saw that the police had arrived, he ran forward immediately and threw a punch at Lin Fan. Then, he shouted, \"Chief Wang, run away first…\"</p><br/><p>Lin Fan released Wang Shen's hand, then stamped his foot onto the man's stomach, pushing him to the ground.</p><br/><p>Wang Shen just stood there motionlessly. In his heart, he was cursing, \"Run away your sister! Why didn't this f*cking pig brain of mine see this coming?\"</p><br/><p>Lin Fan looked at Wang Shen, \"Your little bro is letting you run. Why don't you run?\"</p><br/><p>Wang Shen smiled steadily, \"Why should I run? I didn't do anything wrong. He has an intermittent mental disorder. When he sees police, he gets triggered easily.\"</p><br/><p>Lin Fan laughed and thought to himself, \"People these days...who knows where they learned this habit from? Every time there's an issue, they blame it on mental illness. If the people really suffering from mental illness knew about this, they would be cursing. They're all locked up in mental hospitals while these guys just use mental illness as an excuse. These guys are on the outside, eating good food and drinking as they like but once something happens, they bring up their 'mental illness'. Couldn't they spare a thought for those really suffering from mental illnesses?\"</p><br/><p>The man lay on the ground, hugging his stomach region. This youngster was really strong. A single kick actually caused him to not be able to stand. He also cursed in his heart, \"Why do I get anxious every time I see the police? At least it seems like everything is fine.\"</p><br/><p>Liu Xiao Tian brought a few policemen over with him. When he heard Master Lin Fan say 'big fish', he couldn't relax. More than a few of his cases had been solved thanks to a word from Master Lin which helped to make the cases clearer. Especially that E-mail Scam case. He finally found the perpetrators and arrested them all, retrieving all the stolen money in the process.</p><br/><p>It was a great service by Master Lin. Sometimes, Liu Xiao Tian even felt that his life was too dream-like. Whenever there was a troublesome case, he would run into Master Lin, then the case would be easily solved. It was so easy.</p><br/><p>\"Master Lin, who is this big fish you were talking about?\" Liu Xiao Tian asked impatiently.</p><br/><p>Lin Fan pointed at Wang Shen, \"That's him…\"</p><br/><p>Liu Xiao Tian looked at Wang Shen and instantly became curious. This man looked so gentle and refined. His face was so peaceful. He didn't seem like a bad guy.</p><br/><p>Wang Shen looked at Liu Xiao Tian and said courteously, \"My fellow man, I think this is a misunderstanding. I, Wang Shen, am just a normal, average joe. I run a service business. How did I become this 'big fish' that this young brother is talking about?\"</p><br/><p>Liu Xiao Tian gave Lin Fan a suspicious look. He didn't know what kind of tricks Master Lin had up his sleeves but he trusted Master Lin, so he looked over at Wang Shen with full alertness.</p><br/><p>As Wang Shen looked at the situation before him, he frowned. It seemed that things had gotten troublesome.</p><br/><p>\"I'm going to make a call.\" Wang Shen shook his head and took out his phone.</p><br/><p>Liu Xiao Tian wanted to say something, but Lin Fan stopped him.</p><br/><p>They had no idea who Wang Shen was calling but he grumbled a few sentences to the phone, then passed it over to Liu Xiao Tian.</p><br/><p>Liu Xiao Tian took over the phone. The person on the other side of the call was one of the leaders of Shanghai. In terms of ranking, he was significantly higher than Liu Xiao Tian. Thus, before Liu Xiao Tian could get a clearer picture, he didn't dare to say too much.</p><br/><p>\"Leader, this matter might require some investigation. If I just let it go now…\" Liu Xiao Tian said hesitantly, but the other side didn't give him a chance to talk.</p><br/><p>The leader: \"Chief Wang is a respectable businessman. You can't just catch who you want to catch and investigate whenever you want to investigate. Don't you know how big of an impact this has?\"</p><br/><p>Liu Xiao Tian furrowed his brows. Things had gotten complicated.</p><br/><p>If Liu Xiao Tian couldn't bring him back, this big fish would be gone.</p><br/><p>Lin Fan gestured for Liu Xiao Tian to pass the phone to him. Liu Xiao Tian hesitated, then pass the phone to Lin Fan. Lin Fan said, \"Leader, right? This Chief Wang could very likely be the man behind the human trafficking incident, Wang Er Mazi. I've turned on the voice recorder. If you choose to believe that this Chief Wang is innocent, then say a word to guarantee it. If it turns out that this gives Wang Er Mazi a chance to escape, then I think you would have to bear the responsibility. How does that sound?\"</p><br/><p>The phone was silent for a moment, \"Who are you? Give the phone back to Liu Xiao Tian.\"</p><br/><p>Lin Fan said, \"I'm Lin Fan from Cloud Street. You may not know me, but you'll know if you just do a search for 'Master Lin'. Right now, you just need to say whether you want to let this man go. If something happens because of this, then the responsibility lies with you.\"</p><br/><p>*beep beep*</p><br/><p>The other side hung up the phone.</p><br/><p>Liu Xiao Tian asked, \"How is it?\"</p><br/><p>\"He hung up.\" Lin Fan passed the phone back to Wang Shen, then said, \"If you don't want people to find out about things, you shouldn't have done it in the first place.\"</p><br/><p>Wang Shen said calmly, \"I don't know what you're talking about but I can certainly tell you that I will sue you and this friend of your for meddling into something with no evidence. I may not be a very influential person, but I have a certain amount of reputation in Shanghai. You will bear responsibility for this.\"</p><br/><p>Liu Xiao Tian pulled Lin Fan aside, \"You say that he's really Wang Er Mazi?\"</p><br/><p>Lin Fan looked at Liu Xiao Tian, \"I say he is. What are you going to do?\"</p><br/><p>Liu Xiao Tian didn't know about this nickname 'Wang Er Mazi' in the past, but after capturing several human traffickers recently, he learned of this name.</p><br/><p>However, this Wang Er Mazi was like a mysterious being. They only knew of this nickname, but they knew nothing about the real person.</p><br/><p>If this man really was Wang Er Mazi, then this matter just turned into something major.</p><br/><p>With a wave of his hand, Liu Xiao Tian said, \"Take him.\"</p><br/><p>Wang Shen took a deep breath and looked at Lin Fan. He never thought that things would turn out this way.</p><br/><p>Lin Fan actually found it very funny. He couldn't help but think about an article he read online recently about a government leader's family. They brought his grandson out to the park to play and due to carelessness, the child went missing. The whole family was frantically searching for him. The leader then made a call to someone in the triads and asked who did it. It turned out that the call really worked because the human traffickers were just about to sell the child when they received the call. In the end, they let the child go.</p><br/><p>Of course, the only one who knew the full truth behind that incident was probably the leader himself.</p><br/><p>Lin Fan could confirm that this Wang Shen was indeed Wang Er Mazi, but that was the only confirmation they had. They still needed more evidence to show that he was guilty. If they couldn't find any evidence, then all of this would have been in vain.</p><br/><p>As Wang Shen boarded the police car, he turned to look at Lin Fan, \"Young brother, sometimes, there's a price to pay for tarnishing someone else's reputation.\"</p><br/><p>\"What price? Get in!\" Liu Xiao Tian shoved Wang Shen's head into the police car, ran back to Lin Fan, \"Master Lin, do you want to go back with us?\"</p><br/><p>Lin Fan felt that this issue probably required his help. It didn't have much to do with him, but this kind of thing was something that concerned everybody. Human trafficking was an abominable thing.</p><br/><p>After that, Lin Fan had a word with Wu You Lan. At the same time, he passed her the car keys and asked them to leave first.</p><br/><p>Wang Yao and that man who was kicked to the ground by Lin Fan were taken away by the police together with Wang Shen.</p><br/><p>Liu Xiao Tian wiped the sweat from his forehead, \"Master Lin, I'm afraid I have to rely on you fully this time.\"</p><br/><p>Lin Fan laughed, then turned to Liu Xiao Tian and looked into the future of his career.</p><br/><p>It was as bright as the Sun at noon.</p><br/><p>What was there to be afraid of?</p><br/><p>...</p><br/>\n</div>"}