{"title": "Chapter 204: Master Lin is really frank", "id": 204, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-204-master-lin-is-really-frank", "volume_title": "Volume 3", "body": "<h1>Chapter 204: Master Lin is really frank</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204: Master Lin is really frank</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Why hasn't it started yet? I'm getting impatient.\"</p><br/><p>\"Soon, soon. This time, I really want to know which awesome motherf*cker that townsman is.\"</p><br/><p>\"It's starting. The leaders are on stage to give a report on the situation.\"</p><br/><p>\"Amazing, this is what it means to solve the problem in one fell swoop.\"</p><br/><p>…</p><br/><p>At that moment, the leaders went on stage to give an overview of the situation regarding the raid on the human traffickers. At the same time, they talked about what progress they had made.</p><br/><p>Lin Fan waited backstage. Liu Xiao Tian was a little nervous. This was the first time for such a big conference to happen and he had to personally go on stage. It was rather nerve-wracking for him.</p><br/><p>\"Master Lin, aren't you nervous at all? There'll be so many reporters below later on!\" asked Liu Xiao Tian.</p><br/><p>Lin Fan laughed, \"What's there to be nervous about? It'll be fine.\"</p><br/><p>It was the first time that Liu Xiao Tian had to do something like this, so naturally, he was nervous. However, Lin Fan was used to it. He didn't even know how many times he had been in the headlines already. This kind of thing was just a small matter to him. Even if he had to answer the reporters' questions, he wasn't nervous about it. He was already a veteran of a hundred battles, this couldn't scare him.</p><br/><p>\"Hey, it's time for you to go on stage,\" said Lin Fan to Liu Xiao Tian.</p><br/><p>Liu Xiao Tian took a deep breath and whispered to spur himself on, \"Come on.\"</p><br/><p>After the incident, Liu Xiao Tian's rank among the police had improved. It had been a major success. Their leaders were all smiles when they heard the news and he even received commendations from the higher-ups.</p><br/><p>Facing this kind of situation for the first time, Liu Xiao Tian stood on the rostrum with his back as straight as a pencil and without any single movement. The leaders put on medals for them. It was a huge honor. Of course, there were many policemen involved that couldn't be on stage, but they had representatives to receive the honor on their behalf.</p><br/><p>Backstage.</p><br/><p>Lin Fan's emotions were relaxed. Soon, he would have to go on stage. He had experienced being in this kind of situations before and he wasn't really nervous. The last time, when he had gone on stage to infuriate the leaders in order to help that group of children, he hadn't been nervous either. This time, he was going on stage for a good thing, so how could he be nervous?</p><br/><p>When he would go on stage in a while, he would probably just say some nonsense or talk about his reflections. It wasn't anything that could trouble him.</p><br/><p>At that moment, the high-pitched voice of the host came from outside.</p><br/><p>\"In this raid on the human traffickers, there was a townsman involved. He captured the leader of the human traffickers and also provided a great service to the police. He's here today at this ceremony, but for his safety, he will be wearing a Monkey King mask when he comes on stage. Now, let us invite…\"</p><br/><p>The broadcast room was in an uproar.</p><br/><p>\"He's coming out! He's finally coming out!\"</p><br/><p>\"I wanted to see who this guy is.\"</p><br/><p>\"D*mn it, he captured our boss. Does he think a mask will help to keep him safe?\"</p><br/><p>\"To the user above, your IP number has been recorded by us. We will be coming to your place to investigate and we seek your cooperation.\"</p><br/><p>\"AH! Mister Internet Police, please forgive me, I was just pretending!\"</p><br/><p>\"Haha, LMAO…\"</p><br/><p>\"Wait a minute, look. Isn't this guy supposed to be wearing a mask? Did he forget?\"</p><br/><p>...</p><br/><p>When the host saw that someone had come on stage, he opened his mouth enthusiastically. But suddenly, he realized it.</p><br/><p>What the f*ck? This guy isn't wearing a mask. Wait, maybe he's a staff member. There's no hurry, let's just wait for now.</p><br/><p>The spectators below were watching curiously. Didn't he say that he would wear a mask? Where did the mask go? Looks like this guy isn't that good citizen that he was talking about.</p><br/><p>Lin Fan was a little confused. He had already come on stage, there should have been applause, but where was the applause?</p><br/><p>He stood on stage and looked at the audience, then he looked at the host. \"Host, what are you looking at?\"</p><br/><p>The host replied, \"I'm waiting for that good citizen to come on stage.\"</p><br/><p>Lin Fan said cheerfully, \"That's me.\"</p><br/><p>The place was filled with commotion. Everyone was in disbelief. Was this guy the good citizen? Did he not want his life? Without even wearing a mask, he strutted on to the stage like that. If the human traffickers recorded his face, he would be in deep trouble.</p><br/><p>The host immediately came forward and whispered to Lin Fan, \"Where's the mask? This is very dangerous for you.\"</p><br/><p>Lin Fan laughed, \"It's not a problem. What's the point of a mask? I'm righteous and open. Those masks are for criminals to wear.\"</p><br/><p>Below the stage.</p><br/><p>Liang Yong's heart trembled. He said, \"Chief Liu, what's going on? Why isn't Master wearing the mask?\"</p><br/><p>Liu Xiao Tian was blushing embarrassedly, \"Master Lin said he doesn't need it. He's not afraid.\"</p><br/><p>Liang Yong was speechless. \"This isn't a game! What if something really happens?\"</p><br/><p>Liang Yong couldn't be blamed for being worried. It was indeed a major incident. Countless human traffickers' had had their plans ruined as a result. Liang Yong was sweating in fear for Master Lin but Master Lin had already revealed himself. It didn't matter what he said anymore. It looked like they would have to strengthen the security at Cloud Street.</p><br/><p>In the broadcast room.</p><br/><p>\"666, who is this guy? Could he be that good citizen?\"</p><br/><p>\"Didn't you hear him? That's him! But he's way too f*cking awesome. He didn't even wear a mask. Nowadays, even people who strike the lottery wear a mask when they receive the prize. This guy is awesome. After doing something so big, he doesn't even wear a mask.\"</p><br/><p>\"Respect.\"</p><br/><p>\"Huh? Why does this guy look so familiar.\"</p><br/><p>\"D*mn, you're right. This guy looks f*cking familiar to me too but I can't quite put my finger on it.\"</p><br/><p>…</p><br/><p>Lin Fan held the microphone in his hand as he said, \"Dear leaders in attendance and reporters, greetings. I am the one who captured Wang Shen. The guys backstage asked me to put on a mask to protect myself but I thought that it wouldn't be right. Firstly, I didn't strike the lottery. Secondly, I didn't commit a crime. There is no need for a mask, so I just came out with my real face.\"</p><br/><p>Haha!</p><br/><p>Roaring laughter came from below the stage. Everyone had given in. The reporters pointed their cameras at Lin Fan. This was the first time they had seen something like this. In the past, there had been other good citizens who had done the police a service but for their own safety, they all wore masks when they appeared in public. They weren't like this guy, going on stage fearlessly with nothing at all.</p><br/><p>The host gained back his senses and stepped forward. \"Hello, hero. This contribution of yours moved us very much. For your own safety, I won't say your name. This incident involving the human traffickers…\"</p><br/><p>Before the host finished talking, Lin Fan waved his hand and interrupted, \"There's no reason not to say my name. I think there are people on the internet who recognize me. I'm Cloud Street's Master Lin, a typical good citizen. Because I've read quite a number of Wu Xia (Martial Arts) novels, I've gained a sense of righteousness. When faced with something like this, I had no qualms. As for those human traffickers, I'm not afraid of them at all. If any of them find me, I'd be delighted because I would be able to capture another human trafficker.\"</p><br/><p>The host was speechless. Big bro, this isn't how the rhythm is supposed to be. You're going too deep. Can we follow the usual tempo? I'll ask and you'll reply. That's how it's supposed to be.</p><br/><p>Some of the leaders below started smiling. This youngster is really frank!</p><br/><p>The broadcast room erupted.</p><br/><p>Some of the netizens finally recalled who that man was.</p><br/>\n</div>"}