{"title": "Chapter 229: Little Blackie needs the full package", "id": 229, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-229-little-blackie-needs-the-full-package", "volume_title": "Volume 3", "body": "<h1>Chapter 229: Little Blackie needs the full package</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 229: Little Blackie needs the full package</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Little Blackie was frustrated. What's with these humans? I clearly did I was told. Why are they asking me to do it again?</p><br/><p>However, at that moment, he suddenly remembered what he had promised Lin Fan and instantly snapped out of it.</p><br/><p>Summer days were extremely hot and this caused an inner fire in Little Blackie. It caused him to become really irritable and aggressive.</p><br/><p>Director Qin was extremely delighted by Little Blackie's performance. This was obvious from the expression on his face though he did not verbally express it. However, this was far from comforting as it added pressure, causing tension in the room.</p><br/><p>Not bad!</p><br/><p>Not bad!</p><br/><p>Xu Zi Le did not think that Lin Fan would actually be able to train Little Blackie till such an extent within such a short amount of time and there was a burning desire in her heart to find out how he did it.</p><br/><p>After the corpse was carried onto the cart the day they should have called it a day. However, Xu Zi Le was far from done and was still full of energy, ready for more scenes.</p><br/><p>The cameraman aimed the camera at Xu Zi Le and the lighting crew shone lights on her, getting ready for the emotional scene which was about to unfold.</p><br/><p>Workers gathered in anticipation. If there were no errors and the scene met Director Qin's standards, they could finally call it a day.</p><br/><p>The rest of the show would be taken at a different location.</p><br/><p>Wang Ming Yang grinned widely, \"Wow Lin Fan! You're really amazing, please teach me how to speak to dogs too!\"</p><br/><p>Lin Fan glanced at him and said, \"You won't be able to master it.\"</p><br/><p>That instantly knocked the idea out of Wang Ming Yang's head. \"What did he even mean by I won't be able to learn it, he's not even willing to teach me.\"</p><br/><p>Xiao Zhang focused the camera on Xu Zi Le. The scene was bound to be amazing, Xu Zi Le's extraordinary acting skills were uncommon for someone who was so young,</p><br/><p>Director Zhang inspected the scene thoroughly. \"Not bad at all… not bad at all… this is perfect!\"</p><br/><p>However, as he lifted his head, he froze.</p><br/><p>What the heck is going on?</p><br/><p>Xu Zi Le knelt by the cart, eyes swollen and read her lines in a solemn tone, not taking note of what was happening beside the cart.</p><br/><p>Little Blackie crouched by the cart and with a sparkle in his eye, he nudged the corpse gently with his head as if he was reminiscing the good old times spent with his owner.</p><br/><p>This was such a saddening moment.</p><br/><p>Little Blackie laid on the cart and raised his head before howling out. The sorrow in the howl and the tears in his eye was absolutely heartbreaking.</p><br/><p>Xiao Zhang who had entirely focused the camera on Little Blackie was stunned by this magical moment. He couldn't help but wonder. How is this possible? How can a dog be able to portray such emotions?</p><br/><p>The lighting technician who had ensured the lighting was flawless could not help but let out a 'woah' in awe.</p><br/><p>\"F**K.\"</p><br/><p>Everyone's attention turned to Director Qin in shock.</p><br/><p>He then asked, \"Was Little Blackie given enough screen time?\"</p><br/><p>Xiao Zhang immediately reacted, \"Director, I didn't manage to capture it…\"</p><br/><p>Director Qin was enraged. \"This scene is an absolute miracle, not only can this qualify as the best scene of the year, it will add at least 3 points to our movie. I can guarantee that the audience will cry till their tears run dry if they see this. But you… have the audacity to miss it out.\"</p><br/><p>The photographer had a look of innocence. After working in the industry for the past 10 years, he was definitely skillful with the camera. Little did he expect to mess it all up twice in a day. What was worse is that he messed it up filming a dog. Who would have actually believed a dog would be better than the lead in acting.</p><br/><p>The lighting technician, \"This dog is way too amazing, how did you even to mess up twice?\"</p><br/><p>\"This… This…\"</p><br/><p>\"After so many years in the industry, I've never seen a dog as smart as Little Blackie! Even the dog who was a big hit in the drama series last year doesn't even come close.\"</p><br/><p>\"Afterall, Little Blackie is just a stray. Could he have picked up acting just by watching us over the years?\"</p><br/><p>At this moment everyone was stunned and started to chatter, discussing how they thought Little Blackie learned how to act. If not for what they had witnessed, they would never have believed that a dog could act like that.\"</p><br/><p>Even teacher Liu was shocked… After all these years working as a trainer, he had never witnessed such intelligence.</p><br/><p>Director Qin sighed to himself muttering under his breath, \"I can't believe we actually failed to capture such an amazing moment. What a waste...\"</p><br/><p>The filming crew were also utterly disappointed in themselves.</p><br/><p>\"Director Qin, don't be too disappointed, we can always just retake the scene,\" Lin Fan comforted.</p><br/><p>Director Qin sighed, \"What Little Blackie had managed to do in the last scene was absolutely stunning. Are you sure that he would be able to achieve the same effect again?\"</p><br/><p>Lin Fan was at a loss for words.</p><br/><p>\"Only you can communicate with the Little Blackie. So… how are we going to achieve a continuous line of service from him?\"</p><br/><p>\"If Little Blackie were to continue acting, I would need assurance that he would be willing to co-operate till the end.\"</p><br/><p>Lin Fan smiled and assured, \"Relax… It will all be fine. Little Blackie might be a stray but trust me, he is a dog who has great work ethics.\"</p><br/><p>Director Qin seeing that Lin Fan was so confident smiled in delight before turning his attention to the crew. \"Alright everyone listens up… I want both Little Blackie and Zi Le to be in the scene. Don't screw this up again. When Little Blackie starts tearing I want all focus to be on him and then we are done. All clear?\"</p><br/><p>If it weren't for Little Blackie's outstanding performance, he would have called it a day. However, with what Little Blackie had just displayed, there was no way he could leave it out of the scene.</p><br/><p>Xiao Zhang nodded his head assuring Director Qin that he would not mess up the shoot this time.</p><br/><p>\"Everyone standby… Lights… Cameras… Action…\" A deep feeling of anticipation filled Director Qin's heart.</p><br/><p>Lin Fan waved to Little Blackie, signaling him to begin acting. Little Blackie instantly knew what to do and started working his magic. It was something about animals being able to display emotions that could really touch the hearts of the audience.</p><br/><p>From what Director Qin had observed, Little Blackie would surely steal the spotlight from the main actor when the series was released and that was something that absolutely could not happen.</p><br/><p>\"Ahh…\" Seeing Little Blackie's performance, Director Qin's excitement shot through the roof.</p><br/><p>Perfect, everything was perfect.</p><br/><p>The cameraman could not help but tremble watching Little Blackie's performance. If he was not behind the camera, carefully witnessing the whole scene, he would never have believed that such a thing was actually possible.</p><br/><p>Under the scrutiny of the camera, Little Blackie's expression was amplified creating a staggering sight.</p><br/><p>The expression on his face was as if he had actually lost his owner. The manifestations of grief, his tears accompanied by his howl rendered a unique atmosphere.</p><br/><p>With such amazing acting from Little Blackie, there was no need for background music to enhance the sadness. His howl could be said to be the perfect background music.</p><br/><p>\"Cut..\"</p><br/><p>Director Qin yelled with a look of excitement on his face. He then turned to Lin Fan and thanked him, saying, \"Thank you so much, I really don't know how to thank you for tonight. No matter what you say, I'm treating you to dinner tonight as an expression of my gratitude.\"</p><br/><p>At this moment, Little Blackie ran over playfully with a look of anticipation on his face.</p><br/><p>Lin Fan smiled and gestured, \"There's really no need to thank me. Just make sure you reward Little Blackie properly.\"</p><br/><p>Director Qin looked towards Little Blackie before turning his attention back to Lin Fan, \"Don't you worry, he is my baby now, I'll take care of him to the best of my ability.\"</p><br/><p>\"Nope… what I and Little Blackie had agreed upon was that you bring him for the 'Full Package'. \"</p><br/><p>Director Qin froze and asked, \"What do you mean by a 'full package'.\"</p><br/><p>Lin Fan smiled, \"Take him for a bath, a massage etc… You get what I mean.\"</p><br/><p>Director Qin really wanted to say he didn't know what Lin Fan meant. But seeing Little Blackie wagging his tail, with his tongue out, he finally understood.</p><br/><p>Lin Fan quietly said to Director Qin, \"If you want him to co-operate in future, you better make sure he gets what he was promised!\"</p><br/><p>Director Qin was dazed but he eventually nodded his head.</p><br/><p>What the actual F**K, who knew that even dogs needed a 'full package'.</p><br/><p>...</p><br/>\n</div>"}