{"title": "Chapter 235: A huge blow", "id": 235, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-235-a-huge-blow", "volume_title": "Volume 3", "body": "<h1>Chapter 235: A huge blow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 235: A huge blow</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>After Bai Ke and Xiao Yan tasted the Mirror Box Tofu, they kept on savoring its extraordinary aftertaste. It was a taste that made people feel carefree and at ease.</p><br/><p>At that moment, they understood just how delicious that Mirror Box Tofu was and why those two tables of diners from the previous night had behaved so maniacally.</p><br/><p>Bai Ke was full of confidence. He believed that he would definitely be able to reproduce that flavor.</p><br/><p>Lin Fan and Xiao Yan stood aside as Bai Ke began to try making the Mirror Box Tofu.</p><br/><p>The steps involved in making this dish weren't complicated and were easy to remember but as Lin Fan saw it, if Bai Ke really wanted to get a grasp of it, he would have to try numerous times.</p><br/><p>Not long after…</p><br/><p>Bai Ke was elated, \"My Mirror Box Tofu is done. My dear gourmets, please have a taste.\"</p><br/><p>Xiao Yan said, \"This one's appearance seems much worse than Brother Lin's. It doesn't look good at all.\"</p><br/><p>Bai Ke smiled embarrassedly, then said, \"Just because it doesn't look good doesn't mean it won't taste good. I believe it will taste very good.\"</p><br/><p>Lin Fan said, \"Let Xiao Yan taste it. As a diner, she will critique this dish.\"</p><br/><p>Xiao Yan picked up her chopsticks and had a try of the dish as Bai Ke waited in anticipation.</p><br/><p>\"The tofu is a little hard and this taste is very sweet,\" said Xiao Yan but when she saw Bai Ke's disappointed expression, she added, \"It's still alright though.\"</p><br/><p>Lin Fan said from the side, \"Xiao Yan, you shouldn't try to praise him. If it's good, it's good. If it's not good, then it's not. We are trying to train him, not lie to him.\"</p><br/><p>Xiao Yan was a little startled, then she understood and her tone changed, \"It tastes bad. It's hard to swallow.\"</p><br/><p>\"Ah…\" Bai Ke was really hurt. It was too big of a hit. \"Even if it's bad, you don't have to put it so bluntly. At least give me a little confidence.\"</p><br/><p>Lin Fan smiled and said, \"That's enough. Honest feedback allows one to improve. Pretense will only make one overconfident. I don't even have to taste your dish to know how it tastes. The tofu was in the wok for too long. The shrimps and pork must be sliced evenly. If some of them are big and some of them are small like this, it'll affect the texture. There were too many condiments. You have to be aware of the flavor. You only need a suitable amount of tomato sauce. It isn't supposed to be so overpowering so why would you make it so sour?\"</p><br/><p>Bai Ke sighed. It was a huge blow to him. Then, he gathered up his confidence and said, \"I don't believe it. Just wait, I'll keep cooking.\"</p><br/><p>Lin Fan smiled as he watched Bai Ke. Although it was a simple dish, to make it well required some effort.</p><br/><p>At that moment, Bai Ke started getting to work again. Although he hadn't reproduced the flavor that Lin Fan made, after trying that dish made by Lin Fan, he had full confidence in this dish.</p><br/><p>Because he knew that if he could make that dish well, it would definitely be a signature dish.</p><br/><p>Lin Fan was a stern teacher. Every sentence from him left Bai Ke overwrought. And he was starting to get stricter. In making a dish, every step is important.</p><br/><p>Appearance, smell, and taste.</p><br/><p>Only with these three attributes can something be considered a real dish.</p><br/><p>\"Cut the tofu precisely. They must be of the same size and the edges cannot be broken. A dish's first impression lies in its appearance. If it doesn't even have this, then it can never be a signature dish.\"</p><br/><p>Bai Ke said, \"Oh, oh, I'll start again.\"</p><br/><p>\"Look at the tofu's outer layer. When it's golden and shiny, remove it from the wok. It'll be overcooked if you wait any longer.\"</p><br/><p>\"The tomato sauce is just a condiment and to add color. You're adding too much. Are you trying to make a tomato tofu?\"</p><br/><p>...</p><br/><p>A great master produces a brilliant disciple. Although Bai Ke wasn't Lin Fan's disciple, Lin Fan was very serious in teaching that dish. It might only be a dish to Lin Fan, but to Bai Ke, it was something important that his restaurant couldn't recover without.</p><br/><p>For Bai Ke's sake, he had to be strict.</p><br/><p>Bai Ke had sweat flowing down his back from being reprimanded by Lin Fan. The pressure was immense. He had wanted to tell Young Fan not to say such harsh words but when he saw the expression on Lin Fan's face, he carried on cooking obediently.</p><br/><p>He realized that Lin Fan's face was really stern and it was a little scary.</p><br/><p>A serving of Mirror Box Tofu was done.</p><br/><p>Lin Fan glanced at him. \"This is important: its appearance is too ugly.\"</p><br/><p>Bai Ke didn't say a word and started cooking again.</p><br/><p>Xiao Yan stood by his side, wiping the sweat from Bai Ke's forehead with a towel.</p><br/><p>The second serving.</p><br/><p>\"Redo it. It's still ugly.\"</p><br/><p>Third serving.</p><br/><p>\"Redo. It looks average.\"</p><br/><p>Fourth serving.\"</p><br/><p>\"Redo. The appearance is okay, but it lacks fragrance.\"</p><br/><p>Fifth serving.</p><br/><p>Sixth serving.</p><br/><p>...</p><br/><p>He reached the twelfth serving.</p><br/><p>Bai Ke looked at Lin Fan in anticipation. He wanted to hear a word of praise. Making twelve servings straight, he was about to fall apart. As fellow young people, he naturally didn't like having his mistakes picked out by someone else.</p><br/><p>But this was different. He knew that Young Fan was doing this for his own sake. Moreover, Young Fan's culinary skills had left him in awe. He had no choice but to give in. Having such a master teaching him to cook was something most people wouldn't be able to get even if they paid for it.</p><br/><p>Those top chefs or whatever simply couldn't compare to Young Fan.</p><br/><p>\"Mmm.\" Lin Fan nodded. When Bai Ke saw this, he was incomparably exhilarated. Then, he hugged Xiao Yan and cried out in joy. However, Lin Fan's next words brought him back down to Earth.</p><br/><p>\"Redo it. The appearance is there, the fragrance is there but the taste still has a long way to go. Keep going.\"</p><br/><p>Xiao Yan tasted it. \"Brother Lin, I think this taste is not bad. It's better than most restaurants.\"</p><br/><p>Lin Fan said coolly, \"It isn't even at a fraction of my standard. It won't make customers stay. Keep going.\"</p><br/><p>Bai Ke sighed, \"Young Fan, please tell me, what fraction of your standard do I need to achieve?\"</p><br/><p>Lin Fan raised a finger, \"Ten percent.\"</p><br/><p>Bai Ke buried his face in his hands. Keep cooking. If you don't go crazy, you're not trying hard enough…</p><br/><p>Time passed very quickly. It was going to be noon very soon.</p><br/><p>During this period, there were customers who came but they were all rejected because Bai Ke was busy cooking. Moreover, the kitchen was in a mess. There were ingredients everywhere.</p><br/><p>…</p><br/><p>The n-th serving.</p><br/><p>Bai Ke wiped the sweat from his forehead, then looked anticipatingly at Lin Fan. This time, he had spent all his effort.</p><br/><p>Lin Fan looked at the Mirror Box Tofu and nodded. \"Appearance and flavor are complete. As for the taste, let me have a try.\"</p><br/><p>Under Bai Ke's anticipatory gaze, Lin Fan took a bite and tasted it. Then, he smiled. \"Not bad. Not bad at all. You've grasped the essence of this dish.\"</p><br/><p>When Bai Ke heard the sound of this compliment, he was so elated that he jumped. \"I did it! I did it!\"</p><br/><p>As Lin Fan watched Bai Ke's elated expression, his heart was filled with joy for Bai Ke as well, but then he said, \"Don't get happy too soon. Do it a few more times. This taste still has a little way to go.\"</p><br/><p>\"Ah!\" Bai Ke looked at Lin Fan with his mouth gaping. Then, he sighed again and carried on cooking.</p><br/><p>Lin Fan said, \"Remember, the flavor is important. You need to take control of the amount of condiments. If it's too little, it'll be tasteless. If it's too much, it'll be too overpowering. If you want this to be a signature dish, you need to put in some effort.</p><br/><p>They carried on all the way to 5 pm.</p><br/><p>When the serving of Mirror Box Tofu was placed in front of Lin Fan, Lin Fan was slightly astonished. He had not thought that Bai Ke would be able to improve at such a rate.</p><br/><p>When Lin Fan tried it, he nodded. \"Not bad, it's already at ten percent of my standard.\"</p><br/><p>In Lin Fan's eyes, this dish still had many inadequacies but for it to make an imprint on diners' memories and to become a signature dish was definitely not an issue. If Bai Ke kept on practicing, he would improve even more and the taste would become even better.</p><br/><p>\"Alright, this standard is enough to satisfy the diners. But you have to keep on practicing from now on. I think it's time to let the diners have a taste,\" said Lin Fan.</p><br/><p>Bai Ke said helplessly, \"But we have no customers.\"</p><br/><p>Lin Fan smiled, \"Go out there and yell 'Half price for dinner and free signature dish'! There will definitely be customers that way.\"</p><br/><p>When Bai Ke heard that, he was delighted. \"You're right!\"</p><br/><p>Xiao Yan tidied up the kitchen as Bai Ke went outside hurriedly to carry out Lin Fan's plan.</p><br/><p>He was now beaming with confidence. It was as if his whole body was charged up with energy.</p><br/>\n</div>"}