{"title": "Chapter 249: Han Lu, can you stop being so shameless?", "id": 249, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-249-han-lu-can-you-stop-being-so-shameless", "volume_title": "Volume 3", "body": "<h1>Chapter 249: Han Lu, can you stop being so shameless?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 249: Han Lu, can you stop being so shameless?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>If Elder Jiang had not mentioned that name, Lin Fan would have forgotten about that person. Han Lu used to be the superstar of the martial arts scene, but after he had been beaten by Lin Fan, he slowly disappeared into the background.</p><br/><p>He wanted Lin Fan to come to the Martial Arts Association to meet him and Lin Fan had no clue on what he wanted.</p><br/><p>His first guess was that this bugger was determined to do better and wanted a rematch, but now that he said that he wasn't going to pick a fight, what could his intentions possibly be?</p><br/><p>It was best not to think too much and just find out when he got there.</p><br/><p>If Han Lu really wants to pick a fight with me, I'll definitely use my 18 Palms of the Descending Dragon technique to knock some sense into him.</p><br/><p>No, I should make a police report first.</p><br/><p>Getting out of bed and washing up.</p><br/><p>Getting out of the house and starting the car.</p><br/><p>Martial Arts Association.</p><br/><p>Han Lu sat at the corner of the large hall, silently keeping to himself while constantly checking his phone. Then, he kept his phone and looked around.</p><br/><p>All the workers in the Martial Arts Association were whispering behind his back.</p><br/><p>\"What's this guy here for?\"</p><br/><p>\"Not sure. I heard that he's looking for Vice-President Lin.\"</p><br/><p>\"Xiao Chen, you need to remove the 'vice' from his title. It's President Lin.\"</p><br/><p>\"Look at him. He looks really angry, especially with him all quiet and sitting in the corner. It is a little scary.\"</p><br/><p>\"I don't think he's angry. I think it's just the way he naturally looks.\"</p><br/><p>\"Either way, we need to be more careful. This guy beat quite a few people up previously. If it wasn't for President Lin's intervention, I don't know what this guy would have done next.\"</p><br/><p>\"Relax. As long as President Lin is around, he won't try anything to pull off anything funny around here.\"</p><br/><p>Jiang Fei sent a report to President Niu before turning up in the large hall. He walked towards Han Lu. \"Why are you looking for President Lin?\"</p><br/><p>Han Lu looked up and met Jiang Fei's eyes. \"I'll tell him when he gets here. Telling you is useless.\"</p><br/><p>Jiang Fei shook his head as he heaved a sigh of helplessness. He had no clue what this bugger wanted here, and the memory of Han Lu's violence still remained fresh in his memory. If not for President Lin's intervention, he couldn't imagine how things would have turned out.</p><br/><p>How could he relax with Han Lu sitting in front of him? If Han Lu were to cause a scene, who would be responsible?</p><br/><p>Han Lu looked up again. \"I see you that guys have made quite a few upgrades around here. All the equipment looks new. The only thing is that the atmosphere here doesn't feel right for training.\"</p><br/><p>Jiang Fei paused for a while, feeling a little awkward. Why had he suddenly made that comment? Could it be that he was trying to sneer at them but couldn't find anything to sneer about? It didn't seem like it. Jiang Fei just remained silent, waiting for the arrival of President Lin.</p><br/><p>Not long after.</p><br/><p>A silhouette appeared in Jiang Fei's field of vision, causing him to burst out with joy. He immediately went forward. \"President Lin, you should come over quickly. I don't know what this guy wants with you.\"</p><br/><p>Lin Fan looked over. It really was that bugger, but his demeanor looked like he didn't want to cause any trouble at all.</p><br/><p>Han Lu immediately dusted himself off and cleared his throat when he saw Lin Fan approach, before walking towards him</p><br/><p>All the members of the association were holding their breath. They didn't know what was going to happen in the next few seconds. In their eyes, Han Lu was a dangerous man with violent tendencies.</p><br/><p>The next second, the members of the association were seemingly confused by what transpired in front of them. What was going on?!</p><br/><p>Han Lu stood in front of Lin Fan, extending his hand outwards. \"Master Lin, how do you do?\"</p><br/><p>An uproar!</p><br/><p>Everyone looked visibly stunned. What was going on? Since when had Han Lu suddenly become so courteous?</p><br/><p>Jiang Fei was also confused by what was happening in front of him.</p><br/><p>Not only had Jiang Fei been taken by surprise, even Lin Fan himself looked a little shocked. He shook Han Lu's hand. \"How may I help you?\"</p><br/><p>He had thought of every outcome in his meeting with Han Lu, but he hadn't counted on Han Lu courteously shaking his hand.</p><br/><p>Han Lu heaved a sigh. \"I want to be your disciple.\"</p><br/><p>An even bigger uproar!</p><br/><p>The members of the association had been holding their teacups, but after hearing what Han Lu said, the teacups fell to the floor as they stared at the scene in shock.</p><br/><p>\"My ears aren't deceiving me, are they?\"</p><br/><p>\"What did Han Lu just say? He wants President Lin to be his master? If news of this were to get out, it would be a huge shocker!\"</p><br/><p>\"Even President Lin is stunned. I bet he never thought that this would happen.\"</p><br/><p>\"Do you think that President Lin will accept him as a disciple?\"</p><br/><p>\"I doubt so. This guy is so despicable. How could President Lin take him as a disciple?\"</p><br/><p>Everyone in the association didn't have a good impression of Han Lu. Although he contributed much to martial arts, the people in the association and the public didn't really like him. He was just egotistical and self-absorbed. Now that this bugger wanted President Lin to be his master, they weren't happy at all and all of them were betting on President Lin to reject him.</p><br/><p>Lin Fan said in an unbelieving tone, \"You must be teasing me, right?</p><br/><p>Han Lu shook his head, his face remaining emotionless and serious. \"I'm being for real here. I want you to be my master and teach me.\"</p><br/><p>\"You even want me to teach you? I think this might not work out, just do whatever you want with your time. I don't have enough time to take disciples.\" Lin Fan waved him away, thereafter looking at Jiang Fei. \"Elder Jiang, I'll let you settle this. I have other business to attend to, so I'll make a move first.\"</p><br/><p>\"Ah!\" Jiang Fei was taken aback. Handing this problem to me is useless. It's Han Lu who wants to be your disciple!</p><br/><p>Lin Fan turned around and started moving off. He didn't have the time to take disciples since he also had other business to take care of.</p><br/><p>Teaching people and having disciples were two very different things. If he were to accept a disciple and if the disciple caused any trouble outside, he would also be implicated. Lin Fan made a decision not to do so.</p><br/><p>Han Lu unhurriedly followed behind Lin Fan, with Jiang Fei following behind as well. Jiang Fei was at a loss on what to do. If Han Lu were to pick a fight, it would mean trouble. But he looked like a changed person, even quietly following behind President Lin, wanting to be his disciple. It was almost like he was teasing.</p><br/><p>\"Stop following me. I'm not accepting any disciples.\" Lin Fan turned around to look at Han Lu helplessly.</p><br/><p>\"No, I'm being serious. It's not that I'm looking down on Chinese martial arts. Ever since I was a kid, I always had the dream of being a master Chinese martial artist, but I have been scammed a few times of my money by 'teachers'. All those guys didn't have any ability at all, and they only knew how to talk b*llshit. So I changed from Chinese martial arts to MMA, thinking that that was the best fighting technique, wanting to prove myself when I got back, until I stumbled upon you…\"</p><br/><p>\"No, I cannot take this responsibility and I don't have the ability to do so. I suggest you go to Mount Wu Tai, Mount Tai, the Yellow Mountains, Shaolin Monasteries, the Wu Dang Sect or even the Qing Chen Sect. I'm confident that they have real fighting techniques over there,\" Lin Fan said hurriedly, wanting to leave the place.</p><br/><p>Han Lu was being genuine. After getting thrown into the police station by Master Lin the last time, he had decided to ask Master Lin to be his master after doing a long self- reflection. He even delivered his question with so much sincerity.</p><br/><p>Lin Fan got into his car, getting ready to leave the place.</p><br/><p>But he realized that Han Lu was standing in front of his car, blocking its way, spreading his body on the bonnet of the car unashamedly. He had to stop Master Lin from leaving.</p><br/><p>\"I'm being really genuine here. I really want you to accept me as your disciple and I want to learn real martial arts,\" Han Lu said, unwavering from his position.</p><br/><p>Lin Fan opened his car window. \"Brother, can you stop fooling around? I really don't have the ability to take any disciples. Even if I did, I don't want to accept any disciples either.</p><br/><p>Han Lu shook his head. \"I don't wish to waste your precious time. Even if you become my teacher for a day, I would hold you in high regard forever. I'll obey you until my last breath.\"</p><br/><p>\"Can you stop being so shameless?\" Lin Fan replied.</p><br/>\n</div>"}