{"title": "Chapter 255: Wonderful, Little Boss", "id": 255, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-255-wonderful-little-boss", "volume_title": "Volume 3", "body": "<h1>Chapter 255: Wonderful, Little Boss</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 255: Wonderful, Little Boss</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>As the number three man in Shanghai, Li Shi Kun was inspecting the situation at Cloud Street while accompanied by the district leader. The other leaders beside them were not high or low ranked but next to these two, they were not much at all. Each of them stood cautiously at the side, accompanying the leader.</p><br/><p>The reporters followed from behind, filming some news. Chu Yuan was a Shanghai reporter. That day, he was following as well. This was an inspection.</p><br/><p>\"Cloud Street is Shanghai's earliest business district. As such, it is symbolic and its surrounding environment must be well-kept. We have to keep the citizen's satisfaction levels above the green.\" Li Shi Kun looked around as he walked. At the same time, he nodded his head constantly. Although Cloud Street was an old-fashioned business district, it had been refurbished several times before. Because of this, it still looked pretty good.</p><br/><p>The district leader nodded as he said, \"Don't worry, sir. We've put in a lot of work in this regard. Although there are businesses everywhere, this place has performed above the standard in terms of security and inflow of people. In particular, Cloud Street is currently at its peak in terms of inflow of people.</p><br/><p>Li Shi Kun nodded contently. Shanghai was already considered a big city. It was no longer suitable for it to take great strides in its development. Hence, it had to go back to its roots and start from within. They had to slowly correct the lack of consideration in the small areas in order to solve the larger issues at hand.</p><br/><p>As of then, Cloud Street, whether it was with regards to its hygiene or its environment as a whole, was performing very well. It gave tourists a sense of comfort and gave each shop a good environment to do business in.</p><br/><p>…</p><br/><p>At that moment, Li Shi Kun stopped in his tracks and looked in front at the snaking queue. An expression of shock appeared on his face. \"District Leader Zhang, what's going on?\"</p><br/><p>Zhang Ming looked at the scene in front and was momentarily stunned as well. He couldn't recover from his daze as his heartbeat quickened. They couldn't be trying to cause trouble, could they? Then, a nervous look appeared on his face and he couldn't answer the question.</p><br/><p>The bodyguards raised their alertness. They thought it would be peaceful but now, a crowd of people had blocked off the street and there was no way to proceed.</p><br/><p>What made them even more anxious was that these people were raising their hands as if pointing at them. Could it be that they were rioting?</p><br/><p>The queuing townsfolk.</p><br/><p>\"Hey, look. What are those people doing?\"</p><br/><p>\"I don't know. Looks like there are reporters. Could it be that some celebrity is here?\"</p><br/><p>\"Have you ever seen a celebrity that dresses like that?\"</p><br/><p>\"Could it be that they're here to buy Little Boss' scallion pancakes as well? They have a lot of people. We can't let them cut the queue.\"</p><br/><p>\"That's right.\"</p><br/><p>...</p><br/><p>Li Shi Kun directed his gaze at Zhang Ming, wanting to know what was going on.</p><br/><p>Zhang Ming, of course, did not know what was going on, so he directed his gaze at the junior leaders.</p><br/><p>The junior leaders all stared back blankly. They had no idea what was going on.</p><br/><p>Chu Yuan, as a reporter, hadn't known about Master Lin at first either. Later on, after he had gotten to know Master Lin at the human trafficking raid's honors ceremony, he had some research on Master Lin. He saw that District Leader Zhang's face was getting unsightly as if he was very nervous, so he stepped forward and said.</p><br/><p>\"Dear leaders, you don't need to be anxious. There is a shop in Cloud Street called 'Master Lin'. that shop's business is flourishing and these people are all here to queue.\"</p><br/><p>Li Shi Kun asked in astonishment, \"It's like this every day?\"</p><br/><p>Chu Yuan nodded, \"Yes, it's like this every day. In fact, based on my knowledge, ever since the Master Lin shop opened, the surrounding shops' sales have all improved by 100-200%.\"</p><br/><p>Although Li Shi Kun wasn't involved in business statistics, he was stunned upon hearing this. Through his many years working in the government, he had heard about business opportunities bringing life to certain regions of districts but he had never heard about a single shop carrying a whole street.</p><br/><p>\"Which news agency are you from?\"</p><br/><p>Chu Yuan replied, \"I'm from Shanghai News Agency, sir. This Master Lin is the informant who aided in the abolishment of the large human trafficking organization recently.\"</p><br/><p>Li Shi Kun had missed that honors ceremony because he had had to go overseas for a conference. He had only heard the news about a hero who helped in the human trafficking raid but he had never seen him in person. When he heard Chu Yuan's words, he was shocked.</p><br/><p>*beep beep*</p><br/><p>\"Hey, people in front. Hurry up and give way please.\"</p><br/><p>At that moment, an electric three-wheeled vehicle with supplies loaded on top drove towards them.</p><br/><p>The bodyguards wanted to pin the man down but Li Shi Kun stopped them. Then, they gave way to the vehicle.</p><br/><p>Li Shi Kun looked at Zhang Ming. \"Do you know about this shop?\"</p><br/><p>Zhang Ming was startled. There was no way he would know about the shop. Then, he shook his head embarrassedly.</p><br/><p>Li Shi Kun then asked Chu Yuan, \"What does this shop do?\"</p><br/><p>It was not such a simple thing, to attract so many townsfolk to queue.</p><br/><p>Chu Yuan replied, \"They sell scallion pancakes. Those scallion pancakes are unbelievably delicious. But there's a rule that they only sell ten servings a day and you even have to draw lots for it. As such, even though there are a lot of people who queue, most of them aren't able to buy it. However, judging by the situation today, something doesn't seem normal. I'm not sure what's the current situation.\"</p><br/><p>Li Shi Kun was shocked. He had never thought that it would be a scallion pancake shop. How could scallion pancakes generate such good business? To get a clearer picture, he decided to go see for himself.</p><br/><p>At that moment, Zhang Ming heaved a sigh of relief. This district was under his management. When he saw so many people, he had gotten a little anxious. He had been worried that something might have happened but now it seemed fine. Everything was alright as long as it wasn't some sort of trouble.</p><br/><p>He looked gratefully at Chu Yuan. This kid wasn't bad at all. He had helped Zhang Ming to evade danger.</p><br/><p>If Li Shi Kun was going to take a look, Zhang Ming obviously had to follow. Similarly, the junior leaders followed them as well. The whole way, they hadn't had much to say. They were supposed to serve as Zhang Ming's back up. In case Zhang Ming couldn't answer any questions, they were supposed to answer for him. The embarrassing part was that none of them had been able to answer the questions.</p><br/><p>Lin fan was making scallion pancakes in front of his cart. The queueing townsfolk were mesmerized by this sight. To them, that day was a great day. They wished really badly that Little Boss would never limit his scallion pancakes again.</p><br/><p>But this would most likely only happen once unless some joyous event were to happen again.</p><br/><p>Looking at the crowd, the queue probably stretched all the way to the Southern Heaven Gate. if it was like this every day, Little Boss would probably tire himself to death.</p><br/><p>He would have to work slowly and steadily at it.</p><br/><p>At that moment, noises came from the crowd.</p><br/><p>\"What are you people doing? If you want to eat scallion pancakes, you have to queue! Where are your morals?\"</p><br/><p>\"Argh, where did these people come from? Hurry up and join the back of the queue. You think we're scared of you just because you have more people?\"</p><br/><p>\"What are you looking at? Yes, you! What's with those eyes? Stop staring…\"</p><br/><p>Chu Yuan was recording the whole situation. When he heard those words, he was stunned.</p><br/><p>Sh*t!</p><br/><p>Are these townsfolk insane? Don't they know who this man is?</p><br/><p>Zhang Ming and the rest were stunned too. They were all leaders but they were being reprimanded by townsfolk for cutting the queue.</p><br/><p>Li Shi Kun had only gone up to take a look. He never thought that the townsfolk would be so riled up. Then, he smiled and said, \"Everyone, we're not cutting the queue. We're just taking a look.</p><br/><p>The townsfolk were not buying it.</p><br/><p>\"We've seen this trick countless times before. Hurry and go to the back!\"</p><br/><p>\"Little Boss' scallion pancakes are so delicious that people nowadays are starting to think of all kinds of tricks.\"</p><br/><p>…</p><br/><p>Lin Fan looked up and glanced at Li Shi Kun. He was slightly surprised, \"A government official?\"</p><br/><p>Li Shi Kun laughed, \"Not bad, youngster. You recognize me?\"</p><br/><p>\"Nope,\" Lin Fan shook his head, \"You just seem like a government official. And not a low ranking one either.\"</p><br/><p>Li Shi Kun chuckled and didn't let it bother him. After that, he looked at the scallion pancake in the cart. \"Your technique is pretty good. And to get so many townsfolk to queue, it must taste exceptional.\"</p><br/><p>Lin Fan smiled. \"That's very courteous of you. I'm just lucky to have their support.\"</p><br/><p>While Li Shi Kun was interacting with Lin Fan, Zhang Ming said to the crowd, \"Everyone, this is Leader Li Shi Kun, the Deputy Mayor of Shanghai. He's here on Cloud Street to inspect, not to cut queues.\"</p><br/><p>When the townsfolk heard this, they were dumbfounded.</p><br/><p>\"A leader…\"</p><br/><p>\"D*mn, I didn't recognize him. And I was wondering why there are so many reporters too.\"</p><br/><p>\"He must have been shocked by the sight of all of us, so he wanted to come to take to look.\"</p><br/><p>\"Wonderful, Little Boss.\"</p><br/><p>...</p><br/>\n</div>"}