{"title": "Chapter 259: What has this got to do with him?", "id": 259, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-259-what-has-this-got-to-do-with-him", "volume_title": "Volume 3", "body": "<h1>Chapter 259: What has this got to do with him?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 259: What has this got to do with him?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>At Xin Yu Commercial Estate Company.</p><br/><p>In the work processing area.</p><br/><p>An old employee chuckled, \"How did things go at Cloud Street? Did the bosses agree to the increase in rental fees?\"</p><br/><p>A middle-aged woman replied, \"I think it's a difficult task. It needs more time. A direct two-fold increase would definitely cause them to feel moody.\"</p><br/><p>Lil' Chen replied, \"What moodiness? There is a 200% increase in the visitor flow in Cloud Street. There have been countless calls for the past few days. Everyone was asking if there were any remaining spaces available for them to start their businesses. It was crazy.\"</p><br/><p>The three people drank a few sips of water after returning.</p><br/><p>\"It wasn't very successful, not many of them agreed,\" said one of the young employees.</p><br/><p>This matter was definitely a difficult one. It was difficult to increase the rental fees without affecting the mood of the bosses.</p><br/><p>Furthermore, Master Lin was involved in this which made it more difficult.</p><br/><p>The old employee said, \"This is normal. Everyone knows the situation at Cloud Street now. Even if they aren't agreeable to it, they have to consider it.\"</p><br/><p>Lil' Chen chuckled, \"Half a year ago, I went to inform them about an increase in rental fees and they were so affected that they almost started a fight with me. But in the end, they still signed the papers.\"</p><br/><p>The middle-aged woman was curious. \"This Master Lin's shop is too awesome. His shop revived Cloud Street. If this matter is settled promptly, we'll be able to have a fatter bonus at the end of the year.\"</p><br/><p>\"We had initially given up on the Cloud Street project but it seems like it's been resurrected. I think we'll have a good time in the future. The property management agency over at Cloud Street has to hire more people and revamp their image. When I went there previously, I saw that there were several illegal methods that they used. It has to be changed.\"</p><br/><p>Then, a middle-aged man came out of the office. He was of an average build and he looked stern. The employees who were having a great time discussing began to lower their heads and continued with their work.</p><br/><p>The leader looked stern and if they were caught talking during work, their salaries would be deducted.</p><br/><p>\"How did it go? Did the shop owners sign the agreement papers?\" the leader asked the three employees.</p><br/><p>These were new employees and since it was summer period, the weather was scorching. He had thought it'd be a good idea for them to go out there and train themselves in the heat.</p><br/><p>An employee replied, \"Director, they weren't agreeable. They said we've gone overboard with the increase in rental fees.\"</p><br/><p>Liu Guo Qiang nodded. \"How many people didn't agree with it?\"</p><br/><p>The employee replied, \"Initially, some of the shop owners agreed to sign it but they changed their minds afterward. They said if the price increased, they wouldn't rent the units anymore.\"</p><br/><p>Liu Guo Qiang laughed and he looked a little upset. \"These shop owners are so greedy. The visitor flow has increased by so much at Cloud Street. How could they still pay the same rent? If they don't wish to continue with their rental, that's fine. There are so many people that want to rent a unit. Alright, go there again tomorrow and record the names of the shop owners that aren't willing to pay. Refund them the contractual money and get them to move out of Cloud Street within five days.\"</p><br/><p>Then, he turned to the employees of the promotions department. \"All of you, call the potential shop owners. Tell them that there are available units now. If they're still interested, they can come over and discuss it.\"</p><br/><p>Everyone in the promotions department replied, \"Alright, Director.\"</p><br/><p>The three young employees spoke again, \"Director Liu, there's one more thing.\"</p><br/><p>Liu Guo Qiang looked at the three of them. \"What is it?\"</p><br/><p>Now that Cloud Street's business had improved drastically, Liu Guo Qiang was delighted. The other business districts probably couldn't match up to Cloud Street.</p><br/><p>When Cloud Street takes the number one spot as the hottest business district, he would be able to stand proud and claim that title.</p><br/><p>An employee said, \"When Master Lin of Cloud Street found out about the increase in rental fees, he wanted to move to another street with the other shop owners.\"</p><br/><p>Liu Guo Qiang looked curious and asked, \"Did you tell him that we were increasing his rental fee?\"</p><br/><p>The employee immediately replied, \"Director, we didn't. We didn't even go to Master Lin's shop. He found out about the increase in rental fees for other shops and wanted to leave the place with them.\"</p><br/><p>The other employees remained speechless as they knew that things had become complicated.</p><br/><p>Cloud Street's achievements were all due to Master Lin.</p><br/><p>\"Hmm, I got it,\" Liu Guo Qiang said as he heaved a sigh. Then, he returned back to his office and called a few people. He wanted to have a meeting.</p><br/><p>He wanted to have a meeting about Master Lin's shop on Cloud Street.</p><br/><p>Now that Cloud Street was doing so well, if they were to charge the same rental fees, they'd be losing out on a lot.</p><br/><p>Soon, the other leaders came and they started to discuss the situation at Cloud Street.</p><br/><p>Liu Guo Qiang looked at all of them. \"The current situation is like this. We have to implement the increase in rental fees. Master Lin and some of the other shop owners aren't agreeable to it. What do you think we should do?\"</p><br/><p>A paunchy man replied, \"That's a little complicated. After all, the visitor flow in Cloud Street is brought about by Master Lin. If he moves away with the other shop owners, it'd be a disaster for us.\"</p><br/><p>The lady beside him paused, then said, \"I think it's impossible. Although the increase in visitor flow in Cloud Street is related to Master Lin's shop, it doesn't have a huge correlation. After my latest investigation, I made a report and all of you can have a look at it.\"</p><br/><p>Soon, she distributed the documents to all the leaders.</p><br/><p>\"You mean it is the increase in the number of residents in the area that caused the increase in visitor flow? And that happened to occur at the same time as Master Lin's shop opening?\" Liu Guo Qiang looked at the papers and asked. He looked like he believed it.</p><br/><p>The lady nodded confidently. \"You could say so. Master Lin's shop is only slightly bigger than 10 square meters. It's such a small shop. According to my investigation, he sells scallion pancakes and reads fortunes. Do you think a small shop like his could bring about such a huge visitor flow? In my opinion, it is largely due to the increase in the number of residents.\"</p><br/><p>\"Furthermore, even if the visitor flow at Cloud Street was brought about by him, we can't be affected by his actions, right? If we were to stay with the same rental fees now and increase it in the future, he would protest against it again. If we increase the fees now and he leaves, it's better than being obstructed by a single person, right?\"</p><br/><p>The others remained silent as they thought that whatever she had just said made sense.</p><br/><p>\"I think it is unlikely to be related to the increase in the number of residents. The residents in the vicinity have already reached its saturation point three months ago. If it's this reason, then three months ago, the visitor flow would have been as much as the current one since Master Lin's shop wasn't opened yet. However, it wasn't. Therefore, I believe this is largely related to Master Lin's shop. I went there to take a look once. There are at least a few hundred people outside his shop every single day. Sometimes, it can even be more than a thousand people. There are enough people to queue until the end of the street. I think we have to think through this matter thoroughly and not do something that we'd regret,\" one of the middle-aged men said.</p><br/><p>The lady frowned, \"Elder Wang, your thinking isn't correct. Even so, we can't be controlled by his shop, right?\"</p><br/><p>Elder Wang shook his head. \"I didn't mean that.\"</p><br/><p>The lady sneered, \"This Master Lin is such a busybody. We increased everyone else's rental fees but his. He doesn't even seem grateful for it and he's thinking of protesting against it with the other shop owners. We, Xin Yu Commercial Real Estate Company, have been in charge of many business districts. We haven't faced such a situation before, have we?\"</p><br/><p>\"I think you're right. We've never faced such a thing before. Therefore, this problem can't be allowed to develop. We have to solve it at its root cause. I believe the increase in visitor flow is completely because of the increase in the number of residents in the area.\"</p><br/><p>Liu Guo Qiang was in a dilemma. It was difficult to judge the situation.</p><br/><p>He had to look for Master Lin to discuss it.</p><br/><p>\"Alright, the meeting has come to an end. I will make a trip to Cloud Street to discuss with Master Lin.\"</p><br/><p>Liu Guo Qiang had always believed that the increase in visitor flow was related to Master Lin.</p><br/><p>If not, he wouldn't have increased the rental fees of the other shop owners only. He was afraid that Master Lin would protest against it and leave Cloud Street.</p><br/><p>Now that things had become like this, he had to do something about it.</p><br/><p>It looked like Master Lin didn't think the same way as an average townsfolk.</p><br/><p>If it was someone else, that person would definitely be extremely grateful and joyous.</p><br/><p>An increase in everyone else's rental fees but mine? How wonderful!</p><br/>\n</div>"}