{"title": "Chapter 264: This isn't a wet market", "id": 264, "volume": 3, "url": "http://boxnovel.org/a-valiant-life-chapter-264-this-isnt-a-wet-market", "volume_title": "Volume 3", "body": "<h1>Chapter 264: This isn't a wet market</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264: This isn't a wet market</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>This b*tch is speaking with such a sh*tty tone.</p><br/><p>Lin Fan glanced at her and didn't care about her. Then, she turned to Liu Guo Qiang. \"Director Liu, this is the best we can do. You can consider it. If not, you may move away.\"</p><br/><p>The townsfolk started to add on.</p><br/><p>\"Little Boss is already making a huge compromise. 30% is quite a lot.\"</p><br/><p>\"That's right. Little Boss already said it, 30% is our best. Furthermore, if Little Boss isn't at Cloud Street, the number of customers will definitely return to normal. When that happens, you'd be depressed and helpless.\"</p><br/><p>\"Director Liu, all of us live nearby. If you really chase Little Boss away, we will definitely not come here again. There are so many business districts in the vicinity and they're so much better than Cloud Street. Without Little Boss, Cloud Street would be nothing.\"</p><br/><p>Liu Guo Qiang was in a dilemma. Their words made sense. He had only managed to understand everything after he had made this trip here personally and saw these townsfolk. This was nothing like what he had imagined.</p><br/><p>If a business district wasn't built on a good plot of land that was attractive enough to the tourists, it had to be built near a place of residence.</p><br/><p>In the past, Cloud Street was definitely pretty popular. But after the development of a few other business districts and a mega business city, the number of customers declined rapidly until recent times. It became popular again after a difficult time and he definitely didn't want to let Cloud Street return to its past state.</p><br/><p> 30%.</p><br/><p>Liu Guo Qiang knew that it was Master Lin's greatest compromise. It all depended on him. He was thinking about it.</p><br/><p>Zhu Xiu Qin stood beside them and she was furious. He actually ignored her?</p><br/><p>*slam*</p><br/><p>The documents were thrown at the table.</p><br/><p>She spoke with a stern tone once again.</p><br/><p>\"30% is impossible. Director Liu, think about it. Xin Yu Commercial Real Estate Company is a big company. If the other business districts behave like this too, we would be jobless in the future,\" Zhu Xiu Qin said.</p><br/><p>\"You are?\" Lin Fan asked.</p><br/><p>Zhu Xiu Qin looked at Lin Fan. So this was the 'famous' Master Lin? She was extremely upset. How could this matter depend on his desire?</p><br/><p>\"Director Zhu from Xin Yu Commercial Real Estate,\" Zhu Xiu Qin said, \"Let me tell you. The increment in rental fees for Cloud Street can't be compromised because of a single person. Director Liu wanted to keep all of you here and so he negotiated it to 80%. It is already our biggest compromise. As for the 30%, that's literally impossible.\"</p><br/><p>The townsfolk were extremely upset.</p><br/><p>\"Why are you so d*mn stubborn? 30% is already quite a lot of money. You guys can't be that greedy.\"</p><br/><p>\"I finally understand why Cloud Street didn't do so well in the past. It's because of these stupid directors. How can they lead us back to our best? I'd be happy if they didn't make us bankrupt.\"</p><br/><p>Zhu Xiu Qin was furious when she heard it. \"How can you say such a thing? What do you mean by 'stupid directors'?\"</p><br/><p>The townsfolk were infuriated. \"What's wrong? I spoke the truth. Look at the other business districts. Did they increase the rental fees like you did?\"</p><br/><p>Zhu Xiu Qin sneered, \"It's our company's decision to increase the rental fees. They didn't do it just as they wished. You guys wouldn't understand it even if I told you. This increment of 80% is settled. If you agree to it, sign the papers. If not, please register for the refund of rental fees.\"</p><br/><p>\"Xin Yu Commercial Real Estate doesn't cheat people or force anyone. We obviously won't compromise because of anyone. We won't return you a single cent less than what you deserve.\"</p><br/><p>Everyone was extremely p*ssed off when Zhu Xiu Qin said that.</p><br/><p>\"You're such an unreasonable woman. If Little Boss and the rest of them leave, we will definitely not return to Cloud Street. It won't be popular anymore,\" a townsfolk said angrily.</p><br/><p>Zhu Xiu Qin waved her hand. \"Regarding its popularity, none of you have any right to speak about it. Xin Yu Commercial Real Estate Company didn't do anything wrong. The increment in rental fees is reasonable. It doesn't matter if Cloud Street isn't popular. The main thing is that our company will definitely not compromise. We have our own procedures to follow.\"</p><br/><p>Liu Guo Qiang frowned. \"Director Zhu, stop talking. Also, why did you bring the registration books? There isn't a conclusion to this whole situation yet. Please return to the office.\"</p><br/><p>Zhu Xiu Qin waved her hand. \"Don't leave. All of you, stay here. We will settle this today.\"</p><br/><p>The employees all looked at each other. What should we do?</p><br/><p>Aren't they just making things difficult for us?</p><br/><p>Lin Fan looked at Liu Guo Qiang, \"Director Liu, just say what you want. Do you accede to our request? If not, we will sign the papers and leave within five days. We won't stay a day longer.\"</p><br/><p>\"This…\" Liu Guo Qiang was in a dilemma. Then, he said, \"Master Lin, why don't we go back and discuss it again? We will have another meeting.\"</p><br/><p>Lin Fan nodded. \"Sure, that's good.\"</p><br/><p>What could be discussed should be discussed and it shouldn't be forced. Nobody owed anyone a living and the best outcome would be a satisfactory one.</p><br/><p>Then, Zhu Xiu Qin stopped him. \"Director Liu, we don't have to discuss it again. 80% is final.\"</p><br/><p>Liu Guo Qiang frowned and he pulled her aside.</p><br/><p>\"Director Zhu, this matter isn't as simple as you think it is. These people live around here and if Master Lin leaves, Cloud Street will definitely lose its popularity,\" Liu Guo Qiang said.</p><br/><p>Zhu Xiu Qin chuckled, \"You're being too anxious. It's just these townsfolk. You think he has such a great impact on Cloud Street? I already said 80% is the best we can do and you agreed to it back in our office. That's the lowest we can go. If not, then it's fine.\"</p><br/><p>Liu Guo Qiang wanted to agree with her but things were not what he had expected.</p><br/><p>Zhu Xiu Qin was considered his subordinate. If Zhu Xiu Qin was above him, then it would have been fine. He would've reprimanded her but Zhu Xiu Qin was a relative of the Vice-President of the company. She was feared by everyone in the company and nobody dared to infuriate her.</p><br/><p>Those that offended her all ended up being sacked. They had no choice at all.</p><br/><p>Lin Fan sat there and the surrounding shop owners came over. \"Little Boss, how did your discussion with them go?\"</p><br/><p>\"I don't know, I think it won't end up well,\" Lin Fan said. If it was only Liu Guo Qiang, they might stand a chance against them but this woman was so forceful and that made things even more difficult.</p><br/><p> Elder Liang said, \"No matter what, the worst that could happen is us leaving this place. That isn't a big deal.\"</p><br/><p>After a while, the two of them returned.</p><br/><p>Liu Guo Qiang said, \"Master Lin, 60%. That's our best already.\"</p><br/><p>After speaking to her for so long, he finally convinced Zhu Xiu Qin to make an exception. He didn't want Master Lin to leave Cloud Street at all and he managed to convince Zhu Xiu Qin for a 60% increase.</p><br/><p>Lin Fan helplessly laughed, \"Director Liu, we're not a wet market here.\"</p><br/><p>Zhu Xiu Qin added, \"60% is our lowest. If you agree to it, sign the papers. If not, just leave. However, I have to warn you about this. There are so many of you leaving and I can assure you that there isn't a business district with so many units available. At the same time, they wouldn't charge as low as Cloud Street.\"</p><br/><p>Lin Fan wanted to reply but the phone rang.</p><br/><p>It was a number that he couldn't recognize.</p><br/><p>He picked the phone up.</p><br/><p>\"Hi, is this Master Lin?\"</p><br/><p>\"Yes, I am.\"</p><br/><p>\"Hi, Master Lin. I am the person in charge of Tian Hong business district. We just built it and we urgently need shops here. I am a fan of your Weibo and I know you are looking for a business district. Therefore, I want to know if you're interested in our area.\"</p><br/><p>Lin Fan chuckled upon hearing his words. Then, he switched on the loudspeaker mode to let everyone hear their conversation.</p><br/><p>\"That's interesting,\" Lin Fan said.</p><br/><p>It looked like the problem that had been affecting them was finally resolved.</p><br/>\n</div>"}