{"title": "Chapter 301: It’ll cause you to be struck by lightning", "id": 301, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-301-it%E2%80%99ll-cause-you-to-be-struck-by-lightning", "volume_title": "Volume 4", "body": "<h1>Chapter 301: It’ll cause you to be struck by lightning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 301: It’ll cause you to be struck by lightning</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>He Cheng Han came before Lin Fan. \"Master Lin, sorry. He's my son…\"</p><br/><p>He hadn't expected it to be his own son. He couldn't do anything about this fella of his. His son had been a sensible boy when he was young but he changed a lot as he grew up.</p><br/><p>In the past, his academic results had been fantastic but he suddenly plateaued halfway. He could skip classes for more than ten days a term and the teachers couldn't do anything about it.</p><br/><p>He knew the reason himself and sometimes he would feel guilty about it.</p><br/><p>Wang Ming Yang also came out of the shop. He smiled. \"Oh, so it's He Xiao Ming.\"</p><br/><p>He Xiao Ming was stunned but he respectfully greeted, \"Hi, Uncle Wang.\"</p><br/><p>Jin Yun Ming came out too.</p><br/><p>\"Hi, Uncle Jin.\"</p><br/><p>Then, the others slowly came out of the shop.</p><br/><p>\"Hi, Uncle Li.\"</p><br/><p>\"Hi, Auntie Zhu.\"</p><br/><p>…</p><br/><p>He was stunned beyond words. Why were there so many people there?</p><br/><p>Wasn't he just a scallion pancake seller? Why were there so many uncles that he knew over there? Even his own dad was there too. Could this be a joke?</p><br/><p>The surrounding townsfolk and the shop owners gathered around. They started to discuss among themselves.</p><br/><p>\"This fella wants to destroy Little Boss's shop?\"</p><br/><p>\"You didn't witness it earlier. This fella was so arrogant. He kicked Master Lin's cart.\"</p><br/><p>He Xiao Ming was a little nervous and he lowered his head. He wanted to shout at them to warn them that it wasn't their business. But he had surrendered to his fate. He didn't dare to do anything about it.</p><br/><p>He Cheng Han looked at Xiao Ming and took a deep breath. \"You scolded Master Lin?\"</p><br/><p>\"I…\" He Xiao Ming was stunned and he didn't know what to say.</p><br/><p>\"I'll kill you! You've been doing nothing every single day and you still dare to come here to cause trouble!\" He Cheng Han didn't wait for him to reply. He immediately raised his hand and was prepared to slap him.</p><br/><p>Lin Fan immediately stopped him. \"Forget it, Chief He. You have to educate children slowly. Furthermore, he's grown up already. You can't resort to violence. There are so many people here. You gotta give him some face.\"</p><br/><p>He Shal Ming raised his head and looked at Lin Fan. He wasn't afraid of his dad hitting him. He was just taken aback that this man who stopped his dad didn't seem much older than him but acted like he was a senior.</p><br/><p>He Cheng Han lowered his hand and sighed, \"Master Lin, it's all because I failed at educating him. I'm sorry.\"</p><br/><p>Lin Fan immediately replied, \"Chief He, what are you talking about? Children are always mischievous. You have to understand that. Just speak to him nicely when you get back. Do not scold or hit him. You have to educate him properly and you can't rush things.\"</p><br/><p>\"Are you already eighteen years old?\" Lin Fan asked.</p><br/><p>He Xiao Ming just lowered his head and didn't reply.</p><br/><p>\"He's asking you a question. Are you deaf?!\" He Cheng Han scolded.</p><br/><p>Wang Ming Yang tried to mediate the situation. \"Chief He, relax. It's normal for Xiao Ming to be a little rebellious at this age. He just has to change.\"</p><br/><p>He Cheng Han waved his hand. He wanted to educate him right there and then.</p><br/><p>He Xiao Ming was still afraid of his dad. Then, he raised his head and answered, \"Yeah.\"</p><br/><p>\"Have you completed your studies?\" Lin Fan asked.</p><br/><p>\"I stopped studying.\" He Xiao Ming shook his head in discontent. He was seething with anger.</p><br/><p>Lin Fan shook his head. \"He's young and he has a decent family background. It's such a pity to stop studying. He should return to school to get more knowledge.\"</p><br/><p>\"I don't feel like studying, what's so good about it? I'm having such a good life now,\" He Xiao Ming replied casually.</p><br/><p>He Cheng Han was infuriated, \"I think you deserve to be hit. Uncle Lin is educating you and you should be listening to him. How dare you argue with him?\"</p><br/><p>He Xiao Ming looked at Lin Fan in discontent. \"How can he be my Uncle…\"</p><br/><p>*slap*</p><br/><p>Suddenly, he slapped him.</p><br/><p>He Cheng Han had slapped Xiao Ming on his face. He was stunned. He just raised his head and looked at He Cheng Han in disbelief.</p><br/><p>He Cheng Han was a little conflicted. It was more of an unbearable feeling. He had given his child everything he wanted since young. He had tolerated him for a long time. But today, his son tried to argue with Master Lin. It wasn't just because of Master Lin. He just hadn't expected his child to not even have any manners.</p><br/><p>Wang Ming Yang and the others were stunned. They hadn't expected Chief He to suddenly slap him.</p><br/><p>\"Xiao Ming…\" He Cheng Han wanted to speak but He Xiao Ming suddenly shouted like a maniac, \"Don't call my name. You don't even know what I need. You slapped me because of an outsider today. I'm already grown up. I'm not like what I used to be. Can't you understand how I feel?\"</p><br/><p>\"Alright, I know. I'm sorry to have disappointed you. But I have to tell you why I did that. You used to be such a fantastic boy in front of others, but I have to tell you that you've become a failure…\"</p><br/><p>He Xiao Ming was infuriated. Then, he just ran away.</p><br/><p>He Cheng Han suddenly looked at Lin Fan. \"Master Lin, sorry for that. It must have seemed like a joke. A new shop's opening became like this because of me…\"</p><br/><p>Lin Fan waved his hand. \"Chief He, don't say that. Everyone is close to each other and we're all friends. I just didn't expect your family to be so complicated. Don't be too furious when you get back. He is still good-natured. You just have to change your teaching methods.\"</p><br/><p>He Cheng Han raised his head. \"Master Lin, is there still hope for my son?\"</p><br/><p>He had done everything there was to do before. He had been in the military and he had held a job before. He had even thought of committing suicide before. He had experienced so many tough times but because of this son of his, he felt so troubled.</p><br/><p>Master Lin just smiled and didn't say anything.</p><br/><p>He Cheng Han didn't know what Master Lin's smile meant and he was feeling a little low.</p><br/><p>…</p><br/><p>At night.</p><br/><p>At a random bridge.</p><br/><p>He Xiao Ming was lying down on the ledge. He had an old picture in his wallet that he had kept for a long time.</p><br/><p>It was a family photo. It was a family of three and the man on the left had been burnt but the remaining piece of the photo was intact.</p><br/><p>There was a child that was smiling innocently as he was holding the hands of his parents.</p><br/><p>*drip*</p><br/><p>He Xiao Ming started to tear up.</p><br/><p>\"Mum, I miss you so much. I feel like visiting you…\" He Xiao Ming started to cry as he thought of what happened in the morning. It made him feel as if there wasn't anyone that cared about him anymore.</p><br/><p>He knew that his girlfriend only liked him for his money. But he realized that there was still someone who would still make an effort to make him happy. It was as if he had returned to the past.</p><br/><p>\"Child, you're not young anymore. Why are you crying here?\" Then, someone came and spoke to him.</p><br/><p>He Xiao Ming was stunned. When he saw who it was, his expression changed. \"What do you want from me? Don't think I that I'll respect you just because you're friends with my dad. Dream on!\"</p><br/><p>Lin Fan smiled. Then, he lay down on the ledge. \"I don't need your respect. I just saw an unwanted child from a distance and he looked like he wanted to jump down. That's why I decided to come over. What's wrong? Do you feel like you were wronged?\"</p><br/><p>He Xiao Ming wiped his tears. \"It has nothing to do with you. Do you believe that I'd beat you up?\"</p><br/><p>Lin Fan pointed downwards. \"How brave. Do you dare to jump?\"</p><br/><p>\"Crazy…\" He Xiao Ming scolded. He realized that he must have been a crazy man.</p><br/><p>Lin Fan shook his head. \"You're the kind of person that doesn't know how lucky you are. You've never empathized with people and you have always been selfish. That's pathetic. Let me ask you this then, do you know why your dad slapped you today?\"</p><br/><p>\"Because he felt that I was a nuisance,\" He Xiao Ming sneered.</p><br/><p>Lin Fan shook his head. \"No, he was actually protecting you.\"</p><br/><p>\"F*ck off. Protecting me? Do I need someone to protect me?\"</p><br/><p>\"Do you know why your dad was so polite to me?\" Lin Fan added.</p><br/><p>He Xiao Ming looked at Lin Fan. \"What are you trying to say?\"</p><br/><p>Lin Fan said helplessly, \"Actually, sometimes I feel like your dad is so miserable. He's never had a good time in his life. Your mum passed away when you were young. Your dad was supposed to have a happy re-marriage but he gave up on it because of you. He didn't expect you to be so selfish. It cost your dad his entire life. In the end, you still think of your dad that way. That's such a pity.\"</p><br/><p>He Xiao Ming was extremely furious. \"You must be crazy. What are you trying to say? Don't try to act like you know everything in front of me. It'll cause you to be struck by lightning.\"</p><br/><p>...</p><br/>\n</div>"}