{"title": "Chapter 318: Eyes wide, mouths gaping", "id": 318, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-318-eyes-wide-mouths-gaping", "volume_title": "Volume 4", "body": "<h1>Chapter 318: Eyes wide, mouths gaping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 318: Eyes wide, mouths gaping</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>In the train, the commuters were holding their phones, mindlessly looking through the news.</p><br/><p>Suddenly, a series of voices rang out.</p><br/><p>\"D*mn, is this real or fake?\" an urbane-looking man gasped in shock as he looked at his phone. The people around him looked at him curiously, wondering what he was doing. Making noise in the middle of a public setting, didn't he have any situational awareness?</p><br/><p>\"Motherf*cker…\"</p><br/><p>From afar, another gasp of shock came and the person who made it was holding his phone too as if he was looking at something.</p><br/><p>The surrounding people became curious. They turned their attention over and looked at the man's phone. The man didn't try to hide it, instead, he displayed his phone openly to everyone.</p><br/><p>\"This looks like the Shanghai World Championships. I didn't pay much attention because I don't really like sports. Could it be that our own people got the gold?\"</p><br/><p>\"Even if he got the gold, there's no need to be so agitated.\"</p><br/><p>\"Hey, what's the meaning of that headline? Seidel got first place but got defeated by a reporter.\"</p><br/><p>\"What's that?\"</p><br/><p>\"Brother, what does the news say? Why are you looking so surprised?\" someone asked.</p><br/><p>The man raised his head and said, \"Take a look at your own phones. I think this news is all over the Internet. In the men's 200m sprint, nine of the World's fastest men competed and our country's Hu Fei Yun only got fifth place. Seidel got first place and even broke the world record in the process but you'd never expect what else happened. Something happened that would make anyone astonished. See for yourself.\"</p><br/><p>The crowd looked at each other, then took out their phones. When they saw the news, all of their jaws dropped. Their eyes widened and mouths gaped.</p><br/><p>\"That's too unreal.\"</p><br/><p>...</p><br/><p>A certain famous male idol.</p><br/><p>\"This time, we'll surely get on Weibo headlines.\"</p><br/><p>\"That's for sure. What we've planned will definitely attract attention. This headline will be simple. Once it garners a certain level of attention, we'll change the whole image and publicize it.\"</p><br/><p>\"We spent quite a sum of money to get on the headlines this time. We had to approach numerous news media agencies.\"</p><br/><p>\"It's not good. Look, this headline isn't ours.\"</p><br/><p>\"How could it be? How could the sports category get in the headlines?\"</p><br/><p>\"F*ck! It's like seeing a ghost.\"</p><br/><p>…</p><br/><p>Netizens.</p><br/><p>\"D*mn! It's exploded! I had entrance tickets to the World Championships but I didn't want to watch so I gave them away. I never expected such a spectacular scene! Why didn't I go?!\"</p><br/><p>\"Who is this guy? Is there a need to be so f*cking awesome? He's carrying the video camera, yet he's running faster than the World champion!\"</p><br/><p>\"Look closely at the video. Seidel is helpless, especially the back half of it. You can clearly see that Seidel didn't even want to run anymore.\"</p><br/><p>\"Haha, I'm dying of laughter. All I want to know is what kind of psychological impact this has on the athletes.\"</p><br/><p>\"This is a very professional reporter. In order to show us the athletes' expressions, he ran in front of them the whole way.\"</p><br/><p>\"That's enough said, I'm going to go have a laugh. Seidel got first place and broke the world record but he's not happy at all. When the race was over, he was completely flabbergasted.\"</p><br/><p>\"Reporter my a*s! That's clearly Master Lin!\"</p><br/><p>\"What Master Lin? Who is that?\"</p><br/><p>\"Go do a Baike search yourself. If you don't even know Master Lin then what on earth are you doing on Weibo? He's a big shot on Weibo. Although he's not that well-known, the things he does are earth-shattering.\"</p><br/><p>\"I just went to see. Isn't he just a f*cking scallion pancake seller and fortune-teller? Why is he a reporter now?\"</p><br/><p>\"...\"</p><br/><p>The Internet instantly erupted.</p><br/><p>Nothing was heard from the National Sports Association's Weibo for the moment. It was as if they hadn't recovered from the shock of the matter.</p><br/><p>On that day, every single athlete simultaneously let out 'painful' expressions.</p><br/><p>The coaches were silent and gloomy. They all had 'helpless' looks on their faces.</p><br/><p>In order to make their athletes run faster, they had thought of all kinds of methods to improve their techniques and to maximize their potentials.</p><br/><p>But at that moment, a reporter holding a video camera had run even faster than Seidel. Was he trying to f*cking scare someone to death?</p><br/><p>Although his timing hasn't been recorded, everyone had seen that he had definitely run under 19 seconds. And that was while carrying a video camera. If he ran without it and just ran straight without holding back, would he hit 18 seconds?</p><br/><p>That was inhuman!</p><br/><p>It was so painful.</p><br/><p>…</p><br/><p>Cloud Street.</p><br/><p>Lin Fan stood leisurely in front of his stall. The previous day's happenings were just as transient as fleeting smoke. They were nothing to him.</p><br/><p>He had just run a little quickly. No big deal. All he wanted to know was whether the task had been completed.</p><br/><p>In order to complete this task, he had thought of all sorts of plans.</p><br/><p>\"Little Boss, you're too f*cking awesome.\"</p><br/><p>\"Yeah! When I saw the news this morning, I was dumbfounded. With one look, I thought to myself, 'Isn't that Little Boss?'\"</p><br/><p>\"How did you run so fast, Little Boss? With your ability, you shouldn't be selling scallion pancakes. You should be a national athlete and terrify all the foreign competitors.\"</p><br/><p>Lin Fan laughed, \"That's not a bad idea. Then I'll stop selling scallion pancakes from now on. I'll just go and run.\"</p><br/><p>The townsfolk gasped in surprise, \"Don't! We were just joking. What's so good about being an athlete? I heard it's very dangerous. It's better to just sell scallion pancakes honestly.\"</p><br/><p>\"Yeah, yeah! Selling scallion pancakes is Little Boss's main profession.\"</p><br/><p>Lin Fan chuckled. He knew the townsfolk would say that. No matter what was compared to the scallion pancakes, they would still choose the scallion pancakes.</p><br/><p>The surrounding shop's owners came gathering around. They realized that Little Boss was getting more and more mysterious. His scallion pancakes were delicious, his fortune-telling was just as godly, his Kung Fu was powerful, he could even talk to animals, his cooking was scrumptious and now, he was even great at running. It was simply terrifying.</p><br/><p>Elder Liang said, \"If Little Boss joins a race, he'll surely place first.</p><br/><p>Elder Zhang said, \"That's for sure. We all saw the video. Little Boss ran even faster than the world champion even while carrying a video camera. If he ran seriously, it would have been insane.\"</p><br/><p>Lin Fan smiled thinly as he waved his hand. \"Gotta stay low-profile…\"</p><br/><p>But sometimes, it was simply not possible to stay low-profile. At times like these, even if he painstakingly tried to hide, he wouldn't be able to contain his own f*cking awesome presence.</p><br/><p>*ring ring*</p><br/><p>Lin Fan saw that a call came. It was from Dad.</p><br/><p>\"Dad, what's up?\" asked Lin Fan.</p><br/><p>\"I saw the news. Isn't that reporter you?\" Dad's voice was a little emotional. He was in disbelief.</p><br/><p>Lin Fan had never thought that even Dad would know. He instantly laughed, \"Yeah. I helped a friend out by being a reporter. I never thought that something like this would happen.\"</p><br/><p>\"Good, good. Your Mom and I both saw it. It was terrific. Are you still busy on your side? I'm getting busy now. Your Mom and I will call you soon.\"</p><br/><p>*clatter*</p><br/><p>He hung up.</p><br/><p>Lin Fan had never thought that even his family would know about the incident. He really didn't know what to say.</p><br/><p>Zhongzhou.</p><br/><p>Papa Lin held his phone with a wide smile on his face. \"I'm going over to Elder Li's place for a bit.\"</p><br/><p>…</p><br/><p>At Elder Li's house entrance. Papa Lin knocked on the door.</p><br/><p>\"I'm coming, I'm coming. Hey, Elder Lin, why are you so free to come to my place today?\" Elder Li didn't know about the incident, hence he asked with a smile.</p><br/><p>Papa Lin laughed, \"Didn't you want to invite me to your house to have a seat the other time? I'm free today so we two brothers should have a chat.\"</p><br/><p>Elder Li didn't have much to do lately and it was hard to reject him so he smiled and said, \"Please, come in…\"</p><br/><p>In the house, the two fifty-something-year-olds sat. Neither of them said anything as if they were waiting for each other to speak.</p><br/><p>Papa Lin took out his phone and looked through it leisurely. Suddenly, he gasped in surprise, \"Elder Li, come over for a moment. I can't see this image clearly. Take a look and see if it looks like my Young Fan.\"</p><br/><p>\"Elder Lin, your eyesight must be deteriorating. Why would Young Fan…\" Elder Li took over the phone and gazed at the image. His expression froze for a moment, then he looked at the article closely. In the end, he quietly handed the phone back to Elder Lin.</p><br/><p>Elder Lin said, \"Elder Li, is that my Young Fan?\"</p><br/><p>Elder Li looked at that hidden smile of Elder Lin's and hesitated for a long time. Then, he finally blurted out, \"Elder Lin, amazing…\"</p><br/><p>Elder Li was speechless. \"...\"</p><br/><p>He thought, This guy came prepared…</p><br/><p>I lose this time.</p><br/>\n</div>"}