{"title": "Chapter 316: I’m a scallion pancake seller!", "id": 316, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-316-i%E2%80%99m-a-scallion-pancake-seller", "volume_title": "Volume 4", "body": "<h1>Chapter 316: I’m a scallion pancake seller!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 316: I’m a scallion pancake seller!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The crowd gasped in disbelief.</p><br/><p>All the netizens who were watching the broadcast were stunned.</p><br/><p>\"What's happening? The reporter ran even faster than the world champion. Is that a joke?\"</p><br/><p>\"I think I'm watching a fake race. That must be it.\"</p><br/><p>\"Can someone tell me what's going on?\"</p><br/><p>\"Who is that reporter? Look at how shocked Seidel is.\"</p><br/><p>\"Who knows? He's pretty d*mn good at stealing the limelight. I was quite sad when Hu Fei Yun was overtaken but now, I'm just laughing at this sight.\"</p><br/><p>\"This was a race among the fastest men on earth. What is this guy doing?\"</p><br/><p>\"Crazy. It's too crazy. The guy is probably not a human.\"</p><br/><p>The crowd was cheering loudly.</p><br/><p>\"Superman, Superman.\"</p><br/><p>\"He ran too d*mn quickly.\"</p><br/><p>\"This is a 200m sprint, why the f*ck is a reporter running so quickly?\"</p><br/><p>At the coaching stands.</p><br/><p>At the China coach's area.</p><br/><p>The coach said, \"What's happening?\"</p><br/><p>At the USA Coach's area.</p><br/><p>\"God, this must be fake. It has to be fake.\"</p><br/><p>At the Jamaica Coach's area.</p><br/><p>\"How is this happening? This reporter ran faster than Seidel. That's impossible.\"</p><br/><p>*Bang!*</p><br/><p>Seidel was still shocked as he passed the finishing line.</p><br/><p>The commentator recovered from his shock. This was a major live broadcasted race. They couldn't just keep quiet. Then, he took a deep breath and exclaimed.</p><br/><p>\"The first place is Seidel from Jamaica.\"</p><br/><p>\"19.17 seconds. He broke his own world record.\"</p><br/><p>Seidel got the first place and he should have been extremely happy. The honor was exceptional this time. He was the fastest man among the nine fastest humans on earth. He had proven that he was the fastest man alive. It was an honor that he had been waiting for.</p><br/><p>But now, he wasn't happy at all.</p><br/><p>When he reached the finishing line, he stared at Lin Fan suspiciously and helplessly. It was as if he was still trying to process what had just happened.</p><br/><p>All the other reporters rushed forward.</p><br/><p>Some reporters went to Seidel to take pictures but there were others who surrounded Lin Fan.</p><br/><p>They had all witnessed what just happened and it was simply too astounding.</p><br/><p>Lin Fan gasped when he saw the crowd around him, \"What are you guys doing? I'm a reporter. You should be filming him.\"</p><br/><p>A reporter replied, \"Hi, you ran so quickly just now. Do you know that?\" A foreign reporter asked excitedly. It was as if he had discovered a piece of big news. It was the first time they had witnessed such a shocking scene. It'd definitely shock the world if it was reported.</p><br/><p>Lin Fan was shocked. \"I ran quickly? I don't think so. I ran at my usual speed.\"</p><br/><p>There were professional video cameras still broadcasting the post-race scenes. Hence, when a lot of reporters surrounded Lin Fan, the cameras also filmed him.</p><br/><p>The online viewers were all shocked when they heard what he said.</p><br/><p>\"Your mom! Is this guy trying to infuriate people? He doesn't know how fast he actually ran. Just like his usual speed? Doesn't he know the contestants he just overtook?\"</p><br/><p>\"I heard from my friends overseas that China is an amazing country and I actually laughed when they said that. That's so stupid. How is our country so amazing? But now I realize that what they said makes sense.\"</p><br/><p>\"If someone else told me that the cameraman ran faster than the world champion, I'd definitely curse him for being an idiot. But now that I've witnessed it with my own eyes, I believe it.\"</p><br/><p>\"F*cking awesome, a true master is among us.\"</p><br/><p>\"The athlete worked hard for his entire life to achieve his results despite the ups and downs. However, this man actually did it so easily. It must have been humiliating for Seidel.\"</p><br/><p>\"Seidel looks like he is in pain. He's probably too shocked by this man. He doesn't even look happy after clinching the top spot.\"</p><br/><p>\"Of course he can't be happy. If he lost to another contestant, it would be better than losing to a bloody cameraman. Would you be happy if you were him?\"</p><br/><p>…</p><br/><p>The foreign reporter asked, \"In the past, did you know that you were this quick? Do you have any relevant experience in track &amp; field?\"</p><br/><p>Lin Fan smiled. \"Nope, I've never had any relevant experience before. These contestants are all internationally recognized. How can a normal man like me beat them? Actually, I'm not a reporter. My friend brought me here to cheer the Chinese athlete on. Something happened and he couldn't enter. That's why I have the camera with me.\"</p><br/><p>D*mn!</p><br/><p>The reporters didn't want to let him off. \"May I know your usual profession? Are you a professional athlete?\"</p><br/><p>Lin Fan shook his head. \"I'm a scallion pancake seller.\"</p><br/><p>The reporters were stunned. \"???\"</p><br/><p>Lin Fan saw that the foreign reporters didn't know what he was saying. Then, he explained, \"It's actually a biscuit stuffed with a lot of ingredients. No, it's actually a kind of bread stuffed with a lot of ingredients.\"</p><br/><p>\"Oh…\" The reporters dragged their voices. \"Do you know the results of your run just now?\"</p><br/><p>Lin Fan looked at them in disbelief. \"Results? What results? I'm a temporary reporter. Only the athletes' results matter. I've never cared about such things. You should interview them. Don't you think they ran extremely quickly? They ran like the wind. The speed was insane. I almost couldn't match up with their pace.\"</p><br/><p>The crowd in the stands was stunned. They started to discuss excitedly. However, they didn't know what Lin Fan was discussing with the reporters. Meanwhile, those who were watching the broadcast online knew what their conversation was about.</p><br/><p>\"D*mn it. This guy is a pro at showing off. He has no expressions in front of the reporters. I really want to tell him that he's already a bloody awesome man. Leave the athletes alone!\"</p><br/><p>\"F*ck. He's a scallion pancake seller? He should be a national athlete. What a pity… Wait, what did he just say?\"</p><br/><p>\"Scallion pancakes… Why do I feel like he's so familiar?\"</p><br/><p>\"D*mn, I know who he is. He's Master Lin from Cloud Street. That's the guy that got famous for selling scallion pancakes.\"</p><br/><p>\"What Master Lin? How do you guys know about him?\"</p><br/><p>\"He's a popular guy in the gourmet food discussion forums. His scallion pancakes can be sold for thousands or even tens of thousands on the forums.\"</p><br/><p>Meanwhile, at Hu Fei Yun's side.</p><br/><p>He came in at fifth place. He had been a little sad initially but now he wasn't sad at all. His small eyes were dazzling in wonder.</p><br/><p>The coach gasped, \"Didn't expect that at all...\"</p><br/><p>Hu Fei Yun replied, \"Coach, what did you not expect?\"</p><br/><p>The coach laughed, \"Although the result isn't really important in this competition, it represents the nations. Seidel is known for his speed. But nobody expected the result to be like this. Although that reporter isn't an athlete, he ran faster than Seidel while carrying a camera. Isn't it a joke? The biggest winner this time is the reporter.\"</p><br/><p>Hu Fei Yun chuckled. Although he had lost the race, the reporter was also a Chinese national, his fellow countryman. It wasn't just about the fact that he had won Seidel. It proved that there was another Chinese that was even faster than himself. Way, way faster.</p><br/>\n</div>"}