{"title": "Chapter 326: The righteous Little Boss!", "id": 326, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-326-the-righteous-little-boss", "volume_title": "Volume 4", "body": "<h1>Chapter 326: The righteous Little Boss!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 326: The righteous Little Boss!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>All the spectators who were sitting around immediately dispersed as they whispered amongst themselves.</p><br/><p>\"Looks like a fight is going to break out.\"</p><br/><p>\"This guy's strength is so impressive. He could lift up that guy with just one hand. That guy has got to be at least 200 pounds.\"</p><br/><p>\"We should back up a little more. Those guys look like hooligans. It'd be suicide to get in their way.\"</p><br/><p>Zhang Yang and the rest all looked on in awe. The had never thought that Xiao Ming would have such an awesome uncle, who was even able to pick up the huge guy with one arm. His strength must have been godly.</p><br/><p>\"F*ck your mum...\" the big guy spurted out in mid-air.</p><br/><p>Lin Fan threw a kick at him, causing the big guy to tumble a few times. The tanned teenager who was standing at the side picked up a beer bottle and aggressively charged forward. \"F*ck you!\"</p><br/><p>Since young, he had never been big-sized but he was aggressive and violent. His demeanor when he held the beer bottle was intimidating to most people.</p><br/><p>Lin Fan grabbed his beer bottle with one hand before scrutinizing him. \"You look like a buffoon. A dog god tattoo and a tattoo of an eye between your brows. How will you ever find a girl next time? It's probably hard enough for you not to be laughed at when walking down the street.\"</p><br/><p>The tanned teenager was stunned momentarily before gaining back his composure. Although he couldn't use his beer bottle as a weapon, he still had his hands. But just as he was about to strike out, Lin Fan slapped him on his cheek, causing him to lose his bearing.</p><br/><p>\"Don't you dare insult my tattoos. This tattoo is of a deity and I spent a few hundred bucks on it. If you continue to insult me, I'll make sure you regret it.\"</p><br/><p>Lin Fan wanted to let this youngster off but at this moment, he paused for a while before looking at the tanned teenager. \"Make me regret it? What are you going to do?\"</p><br/><p>\"I... I...\" The teenager had never thought that this person would be this bold. He was lost for words.</p><br/><p>Zhang Yang was completely in awe. \"Your uncle is so amazing!\" he said as he turned to He Xiao Ming.</p><br/><p>He Xiao Ming was also sold. He had never thought that Uncle Lin was this brilliant.</p><br/><p>Lin Fan turned to look at the few other guys standing at the back. \"You guys better be more humble. Hey, don't you move.\"</p><br/><p>At this moment, Lin Fan fixed his gaze on one of the guys in the gang and when the guy realized it, his face immediately turned anxious as if he had done something horrible and was guilty. His legs were screaming to get out of this place.</p><br/><p>\"Haha, so you want to run, eh?\" Lin Fan immediately dashed forward, kicking the guy to the floor. The other guy standing around him had never thought that this person would hit their friend. They wanted to do something but Lin Fan was just too strong. \"You guys better be a little more humble. Your friend here has broken the law. If you join him, you'll all be accomplices.\"</p><br/><p>All the guys in the gang who were standing around were stunned. They all hesitated for a moment before processing what was happening before them. The big guy whom Lin Fan had kicked on to the ground started becoming more agitated. \"What law did I break? And what are you guys still standing around for? Get him!\"</p><br/><p>Lin Fan felt like he shouldn't waste so much breath talking. He had initially wanted to be a lawful citizen and not engage in conflict, but he now had fewer misgivings about doing otherwise. Furthermore, he discerned that the aggressors were all morons and wouldn't be satisfied until they fought. He had a habit, which he had picked up from his job, of telling how people would behave just by their appearance.</p><br/><p>Lin Fan didn't say anything more as he bent his body, getting ready to strike. He immediately lunged forward, not giving them any time to react.</p><br/><p>The onlookers who were standing around were all in awe. It was like a martial arts movie coming to life in front of their very eyes.</p><br/><p>Absolutely stunning.</p><br/><p>\"Whoa d*mn, this guy is so strong.\"</p><br/><p>\"He just wrecked them in an instant. How frightening!\"</p><br/><p>\"Simply amazing! I've never seen anything like this before!\"</p><br/><p>Zhang Yang immediately went up. \"Uncle, we should leave this place.\"</p><br/><p>He Xiao Ming was worried about the aftermath. If these guys still had more cronies around, it would be a problem if all of them showed up later.</p><br/><p>\"Does it still hurt?\" Lin Fan asked He Xiao Ming.</p><br/><p>He Xiao Ming shook his head. \"It doesn't hurt anymore.\"</p><br/><p>He Xiao Ming had gained immense respect for Lin Fan at that point. He was simply just too powerful. Looking at the guys who were groaning in pain on the floor, he couldn't help but stare at the scene in awe.</p><br/><p>\"Mmm, that's good. We don't have to leave. You guys wait here for a while.\" Lin Fan whipped out his handphone and gave Liu Xiao Tian a call.</p><br/><p>The local police station.</p><br/><p>Liu Xiao Tian was busy settling his most recent case. He couldn't help but feel a sense of dread looking at the piles of case notes before him. \"Inspector, we're still investigating this case. All the closed circuit cameras around the area were just duds, so they aren't of any use at all. It is quite hard to find any evidence or leads,\" a policeman reported.</p><br/><p>\"Can the victim provide any details of the perpetrator?\" Liu Xiao Tian asked.</p><br/><p>The policeman shook his head. \"The victim isn't in a very stable mental state right now. We've arranged for a psychologist to tend to him.\"</p><br/><p>Liu Xiao Tian nodded. \"We must crack this case in three days time. This is the mission assignment.\"</p><br/><p>\"But Inspector, we don't even have a single lead. It is almost impossible to crack this case,\" the policeman replied.</p><br/><p>Liu Xiao Tian wanted to reply, but his phone started ringing.</p><br/><p>*Ding ding*</p><br/><p>Liu Xiao Tian motioned for the policeman to leave the room for a while before picking up. \"What's up, Little Boss?\"</p><br/><p>\"I was at the streetside open-air restaurant eating when a bunch of guys started roughing us up. One of the guys looks like he recently committed a crime. I suggest that you guys come down for a bit to bring them in for questioning.\"</p><br/><p>Liu Xiao Tian was absolutely convinced by Lin Fan. It was a waste that Lin Fan didn't join the police force. Lin Fan would always call in at night and the guys which he reported were always wanted criminals, like the last gambling scammer from before and Brother Long from the illegal gambling dens. They had closed down the underground gambling dens after some investigation. Although they hadn't caught anyone else after that, they had managed to find some gambling equipment at the location.</p><br/><p>\"Alright, I'll send my guys over now,\" Liu Xiao Tian replied.</p><br/><p>\"Hurry, I'm waiting,\" Lin fan replied.</p><br/><p>After hanging up.</p><br/><p>Liu Xiao Tian immediately stood up and left the room before gathering his men. \"You guys, follow me.\"</p><br/><p>\"Inspector, what happened? Did you get a lead?\" a policeman asked.</p><br/><p>Liu Xiao Tian shook his head. \"Nope, Little Boss has helped us catch a few criminals and we're going over now to investigate.\"</p><br/><p>\"I feel that Little Boss is more qualified than all of us to be a police officer. We may not always catch criminals but this guy is dead on accurate. It's almost a miracle.\"</p><br/><p>\"Stop talking so much. Come, let us make our way now.\" Liu Xiao Tian motioned for them to move off. However, he kept on thinking in the back of his mind that if Lin Fan became a police officer, it would do the organization a huge favor, but that was just a thought. Little Boss would never become a police officer.</p><br/><p>The open-air restaurant.</p><br/><p>Lin Fan sat there, watching over the few of the big guys who were groaning on the floor. He let out a sly grin. As a two-time recipient of the Good Citizen Award, he had to take action to deal with these evildoers in society.</p><br/><p>Naturally, he had to use his own strength to bring these evildoers to justice.</p><br/><p>But he didn't know if he was going to receive the Good Citizen Award again this time.</p><br/>\n</div>"}