{"title": "Chapter 329: The troublemaking begins!", "id": 329, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-329-the-troublemaking-begins", "volume_title": "Volume 4", "body": "<h1>Chapter 329: The troublemaking begins!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 329: The troublemaking begins!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Li Mu Ze backed up a little. \"Who is this guy?\"</p><br/><p>All the other celebrities shook their heads. \"No idea.\"</p><br/><p>All the reporters were rapidly taking pictures of what was happening. They now had another piece of news to report, of the townsfolk making a ruckus and Li Mu Ze trying to stop the situation but ending up not getting any face from the townsfolk. Although it wasn't a huge piece of news, it was something that was eye-catching and that was enough.</p><br/><p>Lin Fan stood on the stool, talking into the loud hailer, \"What's up with you guys? There are people who came here to film for a day, so don't come here to make a ruckus. I'm not selling scallion pancakes today, but I'll sell thirty portions tomorrow, so could I ask you guys to not create a scene? I'll rest well today to prepare to make thirty portions tomorrow. I'll definitely be tired from that.\"</p><br/><p>\"Little Boss has a point.\"</p><br/><p>\"Oh man, this must be tough on Little Boss to have to bend over backward for us.\"</p><br/><p>\"Little Boss has spoken. Thirty portions tomorrow, so we better let Little Boss rest well. If he faints from fatigue, we probably won't ever get to eat his scallion pancakes again.\"</p><br/><p>\"Alright, Little Boss. We'll take our leave today. Don't forget about the thirty portions tomorrow, okay?\"</p><br/><p>Lin Fan nodded his head. \"Alright, you guys should get to work early and not disturb the film crew over here.\"</p><br/><p>Under Lin Fan's charge, the problem was solved in an instant without any hiccups.</p><br/><p>All the shop owners beamed radiantly.</p><br/><p>\"Little Boss really knows how to settle problems.\"</p><br/><p>\"That's a given. Apart from Little Boss, no one could have solved this problem.\"</p><br/><p>\"Although that guy was a huge celebrity, this situation could only be solved by Little Boss.\"</p><br/><p>Director Hu let out a smile. \"Master Lin, thank you so much!\"</p><br/><p>Lin Fan sighed helplessly. \"I have to pay a price for all of this. Thirty portions of scallion pancakes are really tiring to make, but as we agreed before, you have to put us in the advertisement spot.\"</p><br/><p>\"Don't you worry. We won't ever go back on our words,\" Director Hu said.</p><br/><p>All the entertainment reporters took pictures of the scene that was unfolding before them. Li Mu Ze hadn't been able to solve this problem, yet some other youngster could solve it. It was simply puzzling.,</p><br/><p>\"This guy looks really capable!\" Huang Yue beamed as she said.</p><br/><p>\"Brother Ze couldn't solve this problem and this random guy could. What an interesting surprise. It seems Director Hu knows this guy. I'll ask him more about it later,\" Yang Tao commented.</p><br/><p>Li Mu Ze stood there awkwardly, giving a forced laugh. Although he tried to put on a brave front, he was still irked on the inside. Who exactly is this guy? How is it possible that that guy could solve something that I couldn't?</p><br/><p>In the end, he didn't think too much. He was a huge superstar and he didn't need to get tangled up in this mess.</p><br/><p>Lin Fan wasn't for chasing idols. Even as the celebrities walked past him, he didn't even flinch. He just walked back to his shop and let Director Hu settle the rest of the filming.</p><br/><p>In the shop. </p><br/><p>\"Elder Dog, are you going to watch them film the show?\" Lin Fan asked Elder Dog Nicholas, who was lying down at the shop front.</p><br/><p>Elder Dog Nicholas turned his head and looked at Lin Fan, before turning back as he continued his nap.</p><br/><p>Elder Dog Nicholas had been depressed the past few days because he hadn't managed to capture the heart of the poodle, and more importantly, both of them didn't match and that made him extra moody. When there were social events, he didn't bring the poodle anymore. She wouldn't go along with him. How lonely!</p><br/><p>The time passed really fast and the atmosphere outside was lively, and much laughter could be heard from the celebrities who were walking around.</p><br/><p>\"Where did Fraud Tian run off to?\" Lin Fan asked.</p><br/><p>\"I think he went to see the celebrities who are walking around. He's been walking around nonstop, so I think he must be tired from that,\" Zhao Zhong Yang replied.</p><br/><p>\"Aren't you going out too? This will be good for your viewers on your live stream,\" Lin Fan asked. </p><br/><p>\"I'll wait here for them to come in. I'm too lazy to go out,\" Zhao Zhong Yang replied.</p><br/><p>\"Haha...\" Lin Fan chuckled. This was the first time he was in this kind of filming situation and there were a lot of cameras around. He had lost interest just by seeing that.</p><br/><p>All the crowd actors were walking around the streets, making the place a little more lively by adding to the numbers. Although they knew who the celebrities were, they weren't as crazy as the fans, who would go straight up to the celebrities to take pictures without asking.</p><br/><p>The shop owners weren't too wild themselves as well. Still, they did take group photos that actually increased the realness of the program, and it was a good effect.</p><br/><p>After some time. </p><br/><p>\"They're coming, they're coming...\" Zhao Zhong Yang immediately livened up.</p><br/><p>\"Who is coming?\" Lin Fan lifted his head to see an anxious Zhao Zhong Yang.</p><br/><p>\"The celebrities are coming because they just got their task. They're coming to this shop!\" Zhao Zhong Yang said enthusiastically before turning to his phone. \"My brothers and sisters, the celebrities will be coming in a few moments time. Sadly, I won't be able to broadcast this due to the programme restrictions. I'll be going off the live stream for a while, but I'll be back to share my experience and some of the pictures that I'll take with them.\"</p><br/><p>\"No, don't do this to us, Brother Yang. Let us see them!\"</p><br/><p>\"D*mn! Right before the climax and he cuts us off. Are you testing us?\"</p><br/><p>\"Brother Yang, please take a few more pictures with them, especially Tang Ying. I absolutely love her!\"</p><br/><p>Zhao Zhong Yang chuckled. \"I'll finish that task for sure.\"</p><br/><p>Thereafter, he switched off his live stream.</p><br/><p>Outside. </p><br/><p>Eight celebrities were standing outside the shop, joyously talking to one another.</p><br/><p>\"I'll definitely win this time. Sister Hong said just now that the hardest shop to conquer is Master Lin's shop, but I'm confident that with my cute personality, I'll be able to make him like me,\" Huang Yue said.</p><br/><p>\"I wouldn't be so sure about that. Who knows? Maybe Master Lin is a fan of mine.\" Yang Tao said.</p><br/><p>\"Well see the final outcome then,\" Li Mu Ze added on.</p><br/><p>... </p><br/><p>The celebrities continued to stand outside the shop talking to one another.</p><br/><p>\"Tang Ying stands the highest chance amongst all of us here. Who knows if Master Lin likes those kinds of small screenplays?\"</p><br/><p>Tang Ying grinned radiantly. \"I'm not so sure about myself, but I'll try my best.\"</p><br/><p>\"Hard work may not always equate to success. I think that the chance of Tang Ying winning is quite low,\" Lu Dao Ren said.</p><br/><p>Tang Ying smiled awkwardly. Her participation in 'Celebrity Family' was already a lucky strike for her. She had originally been unable to make the cut, but one of her other colleagues couldn't make it due to an injury and temporarily pulled out of the show, so Tang Ying was there as her temporary replacement until her colleague recovered.</p><br/><p>In terms of popularity, she couldn't fight with the rest of the celebrities around here, so she trod carefully to make sure that she didn't offend anyone around.</p><br/><p>Her participation in 'Celebrity Family' didn't earn her much. Her only reward was to be able to participate in the show.</p><br/><p>At that moment. </p><br/><p>Lin Fan looked at the eight celebrities who were standing outside his shop before clearing his eyes. \"What are you guys doing here?\"</p><br/><p>Zhao Zhong Yang stood at the corner, looking left and right. He had never seen so many celebrities together up close in his whole life.</p><br/><p>Wu You Lan smiled as she looked at the scene before her. The camera guys were stunned, seeing that that woman was actually prettier than most of these celebrities. It was too good to miss, and so they took a few more scenes with her inside.</p><br/><p>Fraud Tian purposely sat near her as he kept on looking at the cameramen, hoping that he would be featured more.</p><br/><p>\"We've followed a trail of clues and found out that you're the one in Cloud Street who holds the greatest clue. All eight of us have prepared a little performance and the best performance gets the clue from you.\"</p><br/><p>Li Mu Ze looked at Lin Fan, realizing that he was the one that had stolen the limelight from him just now. He was a huge celebrity while Master Lin was just a shop owner. It wasn't even a competition.</p><br/><p>Lin Fan laughed. He had discussed this with Director Hu before, so he knew what role he had to play.</p><br/><p>\"Alright, please begin your performance.\"</p><br/><p>Huang Yue walked up first. \"I'll go first. I'll perform a dance item for Master Lin.\"</p><br/><p>All of a sudden.</p><br/><p>The atmosphere suddenly became humorous. The result of the show was something that was light-hearted and humorous and so her performance was sort of a laughing stock.</p><br/><p>But at that moment, Lin Fan's gaze was directed towards Tang Ying.</p><br/><p>Huang Yue looked at the Lin Fan before breaking out in a little chuckle. \"Looks like Master Lin is attracted to the small cast here. I guess that the precious clue will go to her.\"</p><br/><p>\"This girl here looks like she has a good fortune. Do you mind if I read your fortune for a bit?\" Lin Fan smiled.</p><br/><p>Tang Ying was surprised for a moment before she regained her composure. \"I've seen what you can do. It is my pleasure to be able to get my fortune read by you.\"</p><br/><p>Li Mu Ze stood at the side, interrupting her. \"All these are just scam tactics. You can't possibly believe them. It's already the twenty-first century and I only believe in science.\"</p><br/><p>Tang Ying stood there momentarily frozen after hearing what Li Mu Ze said. She felt like what he said hit the nail on the head.</p><br/><p>Lin Fan looked at Li Mu Ze. \"You shouldn't talk about things you barely know. This person over here is the President of the Metaphysics association. You'll offend him if you say all these things in front of him.\"</p><br/><p>Li Mu Ze looked suspicious, then he laughed. \"Right, right. Why don't you read my fortune, Master Lin?\"</p><br/><p>Lin Fan waved him away. \"I only read the fortunes of those who catch my eye. If their appearance isn't pleasing to the eye, if their thinking is too serious, if they are part of the backstabbing crew, I won't see them. And you fit all three of those categories so I won't read your fortune.\"</p><br/><p>A flurry of reactions! </p><br/><p>Li Mu Ze's face immediately turned black. If he wasn't on camera, he might very well have exploded.</p><br/><p>Furthermore, he was a celebrity. He had never thought that Master Lin words would be more venomous than his own.</p><br/><p>This was creating trouble out of nothing.</p><br/>\n</div>"}