{"title": "Chapter 321: Completing the task in the fastest way", "id": 321, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-321-completing-the-task-in-the-fastest-way", "volume_title": "Volume 4", "body": "<h1>Chapter 321: Completing the task in the fastest way</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 321: Completing the task in the fastest way</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The reporters left and one of them brought back a beautiful memory with him as he left.</p><br/><p>Those mere mortals addicted to the scallion pancake would eventually be unable to resist the grasp of its deliciousness. As for the reporters, Lin Fan could guarantee that from that day on, they would be part of the army of queue-ers.</p><br/><p>Chu Yuan raised a thumb at Lin Fan. F*cking awesome.</p><br/><p>\"Master Lin, what you said today was really scary. Aren't you afraid that something might happen?\" Chu Yuan was puzzled. What Master Lin had done was defying nature.</p><br/><p>Lin Fan gave a curious look and asked, \"What could happen? I didn't do anything. Just speaking truth and facts, I don't think any problems will arise from that.\"</p><br/><p>Chu Yuan was lost for words. If he hadn't had a deep understanding of Master Lin, he really would've burst out cursing, 'Where did this dumbf*ck come from?'</p><br/><p>But at that moment, he was convinced. He raised his thumb once again and said, \"Master Lin, even if my grandpa was next to me, I wouldn't submit to him. I only submit to you.\"</p><br/><p>Lin Fan said very calmly, \"What's there to submit to? The world is filled with all sorts of things. There are many people who don't like showing off.\"</p><br/><p>Chu Yuan nodded. He was convinced by Lin Fan's words.</p><br/><p>Zhao Zhong Yang scurried over while holding his phone as he said, \"Master Lin, everyone wants to see you. They felt that you were really dashing!\"</p><br/><p>Lin Fan waved his hand at the phone and said, \"What's so dashing about me? I only look average.\"</p><br/><p>In the broadcast room, a barrage was launched.</p><br/><p>\"Master Lin is too humble.\"</p><br/><p>\"From now on, you're my idol.\"</p><br/><p>\"I really wish I could fight side by side with Master Lin. Doing cocky things together makes it better.\"</p><br/><p>Fraud Tian glanced at Lin Fan and shook his head. He couldn't see through him. He really couldn't. They had been together for so long but Fraud Tian still couldn't see how this guy was so f*cking awesome. Even in sports, he was so brilliant.</p><br/><p>What Lin Fan was more concerned about at the moment was the ninth page of the Encyclopedia. This task seemed to him like it was easier to complete. It shouldn't be too difficult.</p><br/><p>Meanwhile.</p><br/><p>The leaders at the Sports Association were discussing this matter.</p><br/><p>\"I reckon we should bring in that video camera-carrying-reporter. With such a gift, you have to admit that he's a real talent.\"</p><br/><p>Some people agreed while some disagreed.</p><br/><p>\"This doesn't fit our regulations. Out of our current team members, which of them didn't climb up from the bottom, step by step? If we neglect the rules just because he runs fast, what would happen in the future? Will we not open our mouths about this?\"</p><br/><p>\"I agree. If people hear about this, they will start to think that as long as they can run fast, they won't need to go through our tests and can just become national athletes. What if that happens?\"</p><br/><p>\"From how I see it, someone should contact him and tell him that we think he has potential. Then, get him to slowly start competing from the bottom level and talk with his results.\"</p><br/><p>Someone asked doubtfully, \"And if he refuses?\"</p><br/><p>A leader said, \"Hehe, there are countless people who want to become national athletes. Send someone over to inform him. I can guarantee that this kid will be rejoicing. He will be so grateful that he'll be in tears and he'll cry out that his ancestors have become immortals. Do you believe me?\"</p><br/><p>\"Haha…\"</p><br/><p>The place was filled with laughter. To them, the matter might really turn out that way.</p><br/><p>What a shame...</p><br/><p>The next day!</p><br/><p>News of the Shanghai World Championships was still spreading on the Internet.</p><br/><p>A certain male idol.</p><br/><p>\"Today, we'll definitely get on the trending list. That Master Lin or whatever's incident has passed.\"</p><br/><p>That's right. The headline is ours for sure.\"</p><br/><p>\"Nowadays, there's too much competition for the headlines. Without prior preparation, it's really difficult to get in the headlines.\"</p><br/><p>\"Let's see. Are we in the headlines?\"</p><br/><p>\"Let's wait and see.\"</p><br/><p>\"F*ck! It's this guy again!\"</p><br/><p>\"What's going on? Why aren't we in the headlines? Where did this news appear from?\"</p><br/><p>\"Why is it another headline related to this guy again? Just what kind of method does he use to get in the headlines?\"</p><br/><p>The news on Weibo was on fire once again.</p><br/><p>What Lin Fan had said the previous day simply exploded.</p><br/><p>'Master Lin claims that he is an athletics all-rounder'</p><br/><p>'Master Lin will not become a national athlete'</p><br/><p>'Breaking! Master Lin gives up on becoming a national athlete. The reason is…'</p><br/><p>'Breaking! Master Lin has said that if he joins a race, the rest will forever only be second place'</p><br/><p>The headlines were each more overbearing than the last. Also, UC Breaking News Department had already permeated into other news agencies and they started to use 'Breaking' in their headlines as well. It was a way of attracting the attention of readers.</p><br/><p>\"F*ck! This guy is too arrogant. He doesn't want to join races because if he does, he'll always be first and the rest will only fight for second place. Would you dare to believe that?\"</p><br/><p>\"I believe it. Master Lin just has that much swagger.\"</p><br/><p>\"Motherf*cker. I thought I was arrogant. I never thought that there was someone even more arrogant than me.\"</p><br/><p>\"We admit that he ran faster than Seidel while carrying a video camera but if he says that he's just as good at all the track and field events, I won't believe that nonsense.\"</p><br/><p>\"Whether you all believe it or not, I'll believe everything that Master Lin says.\"</p><br/><p>\"Humble people are always the most frightening. Master Lin's humility has gained my respect.\"</p><br/><p>\"He issued a challenge to all athletes, saying that whoever doesn't believe him can go and challenge him and he even warned them to be mentally prepared. I don't understand that last part.\"</p><br/><p>\"Are you all stupid? He said it so clearly. He means to prepare to get crushed by him. Master Lin is so humble, he can even think of the outcome.\"</p><br/><p>…</p><br/><p>Cloud Street.</p><br/><p>Wu You Lan poured water into Lin Fan's teacup. She said, \"What you said yesterday just went viral.\"</p><br/><p>Lin Fan raised his eyebrows and replied, \"That's expected. I thought about it a little yesterday. I think my humility seems like an exaggeration to others.\"</p><br/><p>Fraud Tian laughed, \"I thought you didn't know. Right now, most of the people on the Internet are flaming you. Do you know how outrageous your words from yesterday were?\"</p><br/><p>\"Is that for real?\" Lin Fan was startled. Then, he unlocked his phone. \"Ahh f*ck. There really are a lot of people flaming me. But forget it. I have to be subtle. Not being scolded would mean that I'm mediocre.\"</p><br/><p>\"There's something wrong with what you just said. I think it should be 'Not being envied means that you're mediocre'.\"</p><br/><p>Lin Fan chuckled, \"The meaning is the same. I have to go do some clarifying on Weibo.\"</p><br/><p>Wu You Lan laughed, \"Could it be that you can't take the pressure and you're going to apologize?\"</p><br/><p>\"Why should I apologize? I didn't say any lies.\" Lin Fan lowered his head and used his phone. He typed a paragraph and sent it out.</p><br/><p>Lin Fan's Weibo: \"In the track and field events, I am truly unmatched. If I really were to participate, the events would be meaningless. Humility causes one to improve. I have always believed in this meritorious tradition.\"</p><br/><p>Everyone looked at Lin Fan and couldn't help but sigh. What was the point of that Weibo post? It would have been better if he hadn't said anything. He would surely get flamed again later on.</p><br/><p>When the netizens saw these words, they immediately started laughing and flaming him. Can you not be so arrogant, Master Lin?</p><br/><p>Being arrogant will cause you to get struck by lightning.</p><br/><p>At that moment, Lin Fan didn't concern himself with all these. He had to get something done first. He had to complete this simple task. This task, to him, was really simple. In fact, it was a little overly simple.</p><br/><p>He made a call.</p><br/><p>Lin Fan said, \"Ming Yang. I have a lot of songs. I want Wu Huan Yue to release an album.\"</p><br/><p>Wang Ming Yang, who was on the other side of the call, was stunned. \"What's going on? Has something upset you?\"</p><br/><p>Lin Fan said, \"Upset my a*s. I'm serious.\"</p><br/><p>Wang Ming Yang had a helpless look on his face as he said, \"Brother, Wu Huan Yue's first album just got released a few days ago and now you want another one. Can't we wait a while?\"</p><br/><p>Lin Fan said, \"It can't wait. Enough talking, I'll go over to find you in the afternoon to discuss this album. We'll attack with quantity, understand?\"</p><br/><p>Wang Ming Yang felt like crying but he had no tears. He really didn't understand. Releasing albums so close together was not right. The impact of the second album wouldn't be as big. It would be a great loss.</p><br/><p>Lin Fan didn't need to take it slow. What Lin Fan needed was speed.</p><br/><p>In order to complete the task and unlock the tenth page, Lin Fan was ready to go all out.</p><br/><p>This ninth page's task was so simple, what was the point of dragging it out? Of course, he had to finish it in the fastest way.</p><br/>\n</div>"}