{"title": "Chapter 324: Forcing an advertisement", "id": 324, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-324-forcing-an-advertisement", "volume_title": "Volume 4", "body": "<h1>Chapter 324: Forcing an advertisement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 324: Forcing an advertisement</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Shanghai Entertainment TV.</p><br/><p>A group of employees had come to Cloud Street to investigate the surrounding environment.</p><br/><p>\"This place is not bad. A newly-constructed commercial street. The environment is good. For this week's show's location, we can choose here,\" said an employee.</p><br/><p>The person-in-charge of the programme, Hu Xing, nodded in agreement. \"It's not bad indeed. Is the person in charge of this place here yet?\"</p><br/><p>\"Leader Hu, we've already called the person beforehand. He should be here soon,\" said an employee.</p><br/><p>Hu Xing nodded and said, \"Mmm, 'Celebrity Family' has pretty good viewer ratings and this place is newly constructed. The outcome of the filming should be good. When the person-in-charge reaches, we'll negotiate with him to temporarily rent these shops.\"</p><br/><p>The show, 'Celebrity Family' involved a group of celebrities being given a fixed sum of money and then completing various tasks with it. This kind of show was a rather new and trendy form of variety show. It received high ratings. This season, they decided to film it here.</p><br/><p>\"Leader Hu, the person-in-charge who we contacted is here,\" said one of the employees.</p><br/><p>Hu Xing looked afar, then walked up with a smile. \"Chief Huang…\"</p><br/><p>When Huang Bin saw the visitor, he smiled and said, \"You must be Leader Hu.\"</p><br/><p>\"Right,\" replied Hu Xing with a nod.</p><br/><p>Huang Bin had never crossed paths with someone involved in variety shows before. When he received the call, he had been startled and started laughing. To have a variety show come to his place was not bad at all, especially when it was 'Celebrity Family'. Then, he came down to Cloud Street personally to discuss this matter.</p><br/><p>Huang Bin said, \"I wonder what Leader Hu is looking for me for.\"</p><br/><p>Leader Hu smiled. \"Chief Huang, we are prepared to shoot a season of our show in this place. Since we want to use this place and you're the boss here, I want to invite you and the business owners to discuss whether or not you could let us use it for a day.\"</p><br/><p>Huang Bin said, \"That's not a problem at all. Our shop owners here are all very friendly. If you have any requests, you can discuss it with them. They will surely be willing to compromise. After all, having celebrities come here is a good thing to them as well.\"</p><br/><p>Leader Hu waved his hand and said, \"Chief Huang, that's not what I meant. What I meant is for them to rent the shops to us for a day for our people to come here and act as the shop owners. After all, this is a show. Without professional actors, I'm afraid they won't be competent enough.\"</p><br/><p>\"Oh, so that's how it is…\" Huang Bin was a little uncertain. Then, he looked at Leader Hu and said, \"It absolutely has to be this place?\"</p><br/><p>Leader Hu nodded. \"Yep, we've already decided. We will film it here. We've already seen all the other commercial districts in Shanghai and not one of them is more suitable than here.\"</p><br/><p>Huang Bin thought for a moment, then said, \"Alright, I'll refer you to a person. If he agrees, then there won't be any problems.\"</p><br/><p>Leader Hu was taken aback. \"His words mean more than yours?\"</p><br/><p>Huang Bin laughed, \"Of course. Don't underestimate him. His words are more powerful than mine. As long as he agrees, I can guarantee you that all the other shop owners will agree. They'll even cooperate with you obediently.\"</p><br/><p>Leader Hu was surprised. \"He's so good?\"</p><br/><p>\"Of course he's good. Let me bring you all there. But you have to remember to watch your tone. Even if the discussion doesn't go smoothly, don't say any rude things and don't cause any conflict,\" said Huang Bin.</p><br/><p>Leader Hu laughed and said, \"Chief Huang is a good man indeed. Don't worry, we are all professionals. Even if the discussion doesn't go smoothly, we won't quarrel.\"</p><br/><p>Huang Bin chuckled and didn't say much. He wasn't afraid for Master Lin, he was afraid for the production crew. All the shop owners here were very courteous towards Master Lin and they were all very united. If something were to happen and each of the shop owners spat once at the production crew, it would be enough to drown them in spit.</p><br/><p>After sending off Leader Song, Lin Fan just lay there leisurely. These days were hard to pass. There were too leisurely. When someone doesn't lack anything in life, he or she suddenly loses all motivation.</p><br/><p>After much thought, Lin Fan decided that Arena of Valor was more fun after all. It was not only a good way to pass time but also to strengthen or make new friendships.</p><br/><p>With Lin Fan as the leader, the four of them formed a team. Wu Tian He didn't know how to play, so he passed.</p><br/><p>Fraud Tian said, \"I'm going in, you guys follow up. Ah f*ck, where are you guys? Why are you still jungling?\"</p><br/><p>Zhao Zhong Yang said, \"I was jungling all along. Why did you go in so quickly?\"</p><br/><p>Lin Fan said, \"Be quiet, stay calm. We can win this. Your motive must be good. This is a game of pushing, don't just keep thinking of killing people.\"</p><br/><p>Wu You Lan said, \"If we don't slay the dragon while we have the advantage and it gets stolen, we'll be finished.\"</p><br/><p>Their teammate said, \"Are you all f*cking stupid? Do you even know how to play this game? If not, then switch off the phone.\"</p><br/><p>...</p><br/><p>The shop was buzzing with activity. Just one game had the four of them fully immersed.</p><br/><p>\"Master Lin…\" Huang Bin brought the people into the shop.</p><br/><p>Lin Fan looked up and instantly smiled. Then, he put his phone down and said to everyone, \"That's enough, let's switch off our phones. Let that guy play by himself.\"</p><br/><p>Their teammate in the game was playing happily when he suddenly realized that all his teammates had stopped moving. Then, he sent out messages in a frenzy. But suddenly, a terrifying thing happened. Zhao Xin left the game. Di Renjie left the game. Lady Zhen left the game. Monkey left the game...</p><br/><p>\"F*ck your moms! I'm going to report all of you…\"</p><br/><p>…</p><br/><p>Huang Bin laughed, \"Master Lin, what are you doing?\"</p><br/><p>Lin Fan waved his hand. \"Just playing a game. Why are you here today, Chief Huang?\"</p><br/><p>Huang Bin referred to the people behind him and said, \"They're here to find you for something so I brought them here.\"</p><br/><p>Lin Fan looked at the people behind and he didn't recognize them. Still, he said with a smile, \"Come, please sit down.\"</p><br/><p>Wu You Lan went to prepare the tea.</p><br/><p>After the new shop renovation, they had a resting area.</p><br/><p>\"Nice to meet you, Master Lin. I'm the person-in-charge of Shanghai Entertainment TV's 'Celebrity Family', Hu Xing. I only realized when I saw this shop that you're the Internet's raved-about Master Lin!\" said Hu Xing with a smile.</p><br/><p>Lin Gan said, \"You flatter me. May I ask what is it that Leader Hu is finding me for?\"</p><br/><p>Hu Xing nodded and explained, \"The situation is as such. I suppose you know about our show 'Celebrity Family'? Right now, we're in the third season and the location we've chosen is your Cloud Street. Hence, I initially wanted to ask Chief Huang for help so we can discuss with all the shop owners. However, Chief Huang said that you're the one in charge here and that as long as you agree, then the rest will be simple. Therefore, I'm here now in hopes of coming to an agreement with you, Master Lin.\"</p><br/><p>\"Haha,\" Master Lin laughed and looked at Huang Bin. \"Chief Huang is too courteous. I am but a tenant. You can tell me more about this matter first. I think there shouldn't be any problems. If there is, I will bring them up. And if you can accept my suggestions, then this matter will be settled.\"</p><br/><p>Leader Hu smiled and said, \"Alright, alright. This is how it is. We want to rent this place for a day for filming the show. The important part is that we've put into consideration that the shop owners here are not entertainment professionals, so I want to replace them with our own people. Of course, we will compensate for this.\"</p><br/><p>Lin Fan thought for a moment and replied, \"I've seen a bit of this show of yours. Let me give a suggestion. I think you shouldn't ask your people to replace the shop owners. Let the shop owners do it. Those people of yours may be actors but honestly, they surely won't be as realistic as the actual shop owners. In fact, I can guarantee that all the shop owners here are very friendly and will definitely cooperate with your work. If you agree on this, then it is settled.\"</p><br/><p>Huang Bin, who was sitting at the side, had never thought that Master Lin was so good at speaking. Moreover, those words he spoke were very reasonable.</p><br/><p>Leader Hu thought for a moment and felt that that was fine as well. \"Alright then. I will take this into proper consideration. This shouldn't be much of a problem. As for the matter of compensation, we can discuss it.\"</p><br/><p>Lin Fan laughed waved his hand, \"Compensation? There's no need for compensation. This kind of thing is good for Cloud Street but you have to do a special feature for our Cloud Street and ask those celebrities to do an advertisement for us. For example, they can say a line during the show like 'Cloud Street is awesome!' or 'The people of Cloud Street are so kind!' or 'Cloud Street's products look really nice!' and that would be fine. I think, to Leader Hu, all these are small matters and if you agree, I'll be able to cooperate properly with you all. I'll make sure you all finish filming happily. How's that?\"</p><br/><p>Huang Bin couldn't help but start laughing in his heart. Master Lin was trying to force an advertisement.</p><br/><p>According to his knowledge, the advertisements in this show were sold to outsiders for millions.</p><br/><p>When Leader Hu heard Master Lin's words, he was stunned. It wasn't a ridiculous request, but he felt that something wasn't right. However, he couldn't quite figure out what wasn't right.</p><br/>\n</div>"}