{"title": "Chapter 339: Terror and chaos", "id": 339, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-339-terror-and-chaos", "volume_title": "Volume 4", "body": "<h1>Chapter 339: Terror and chaos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 339: Terror and chaos</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Lin Fan returned happily and Autumn Sword Fish Killer left with a heavy heart. He felt that something was amiss…</p><br/><p>A few days later.</p><br/><p>The preview of the third episode of 'Celebrity Family' was uploaded online.</p><br/><p>\"D*mn, something's wrong with this week's preview clip. It seems like Li Mu Ze is being flamed.\"</p><br/><p>\"Not just Li Mu Ze. Lu Dao Ren too!\"</p><br/><p>\"Your mom… The production team should eat sh*t. The preview clip is incomplete. What is going on?\"</p><br/><p>\"I quite like this variety show but I don't like Li Mu Ze and Lu Dao Ren at all. I feel like both of them are absolutely disgusting.\"</p><br/><p>\"In my eyes, they can never hide their hidden evil agenda no matter how friendly they seem to be.\"</p><br/><p>\"It shows tonight at 8 PM. I can't wait!\"</p><br/><p>The production team.</p><br/><p>A team member said, \"Director Hu, the number of views for this week's preview clip is even higher than the previous two weeks. Many are looking forward to this week's show.\"</p><br/><p>Director Hu smiled. \"That's normal. If we don't do well this week, it'd be illogical. I know what the viewers are thinking. I read the comments on the websites. Li Mu Ze and Lu Dao Ren got cursed at the most. It's not just about our preview clip. Now, it also involves our titles. They are extremely eye-catching.\"</p><br/><p>\"Haha,\" the team member laughed. \"Director Hu has great vision. It was awesome to film at Cloud Street this week. Perhaps we might even make it big!\"</p><br/><p>Director Hu replied happily, \"Of course. If tomorrow's viewership rate is higher than the past two weeks, I will treat all of you to dinner!\"</p><br/><p>The team members exclaimed, \"Long live Director Hu!\"</p><br/><p>Li Mu Ze's team.</p><br/><p>The manager had seen the preview clip and he was upset. \"The production team of 'Celebrity Family' has gone overboard. They knew that this would affect Mu Ze but they still posted it.\"</p><br/><p>Li Mu Ze looked extremely upset. If it had been released online, he would have nowhere to hide. Although Lu Dao Ren would be accompanying him, he would still be the most embarrassing one in this week's show.</p><br/><p>\"Should we speak to Director Hu to get him to edit that part out? I think we still have time,\" the manager said.</p><br/><p>Li Mu Ze replied, \"It's useless. This fella won't edit it. If he was willing to do so, he'd have done so a long time ago.\"</p><br/><p>The manager said, \"We will look at the situation online when the show is out. For now, let's focus on public relations. Perhaps we'll be able to get through this if we do it well.\"</p><br/><p>Li Mu Ze nodded. \"That's the best we can do now.\"</p><br/><p>Cloud Street.</p><br/><p>Lin Fan looked at his Weibo and everything was peaceful. The current situation had left Autumn Sword Fish Killer helpless.</p><br/><p>He was always extremely bored in his shop and had nothing to do. If he didn't find something to do online, he'd be bored to death.</p><br/><p>*Ding ding!*</p><br/><p>His phone rang.</p><br/><p>He picked up the phone and it was Wang Ming Yang. He said happily, \"Brother, I helped you to ask them. The Nanshan Children's Welfare Institute belongs to the government. It was built recently. For some reason, the institute has been relying on donations. If you're thinking of taking over, it would be almost impossible. If I were to take over it using Eastern Han Group, there should be no problem.\"</p><br/><p>Lin Fan had predicted that. \"That means we can take over it. Please do that and let me manage it. I won't let it affect you.\"</p><br/><p>\"No,\" Wang Ming Yang said, \"You have to think about this seriously. If you take over it, it'll be for a lifetime. Nobody will be interested in it in the future and it'll be difficult for you to get rid of it if you decide to stop managing it. It's a difficult situation.\"</p><br/><p>\"It's not up to me but if you don't want it, you can just donate money. It's a charity after all. Furthermore, you'll boost your reputation by donating too.\"</p><br/><p>Wang Ming Yang and the rest of them had been doing that. They had been donating to charity too but they weren't interested in some welfare institute for children. They just donated whenever the institutes needed money. It would improve their reputations as well. They believed that it would be better for them to just donate.</p><br/><p>It allowed them to appear on the news and get a good reputation. Where else could they find such a good deal?</p><br/><p>Lin Fan replied, \"Alright, it's settled. Help me handle this and just take it that I owe you. I'm extremely serious about this. I've thought through this seriously, it's not a rash decision.\"</p><br/><p>Wang Ming Yang replied, \"Alright, leave it to me. The paperwork will take time. I'll contact you again when it requires your signature. It should be done in two weeks.\"</p><br/><p>Lin Fan chuckled. \"Alright, I'm not worried at all if you're the one processing it. I'll bear this in mind and in the future, I'll advise you if you're destined to run into any trouble.\"</p><br/><p>Wang Ming Yang replied, \"D*mn. You mean that if this didn't happen, you wouldn't advise me when I'm in trouble?.\"</p><br/><p>\"Haha, alright. I was just saying. Don't take it too seriously.\" Lin Fan chuckled.</p><br/><p>The two of them chatted for a while longer and Lin Fan hung up.</p><br/><p>Then, Wu Yun Gang's call came immediately.</p><br/><p>Wu Yun Gang sounded a little low when Lin Fan picked up.</p><br/><p>\"Master Lin, the results are out. Sun Lian Ming didn't listen to you. He was sentenced to six years of imprisonment,\" Wu Yun Gang said helplessly. He hadn't expected things to turn out this way.</p><br/><p>Lin Fan had already predicted that this would happen. \"You have already passed the message to him. He chose this himself and he can't blame others for it. You've done your best.\"</p><br/><p>Wu Yun Gang replied, \"Yeah. Master Lin, can I find out how his future will be?\"</p><br/><p>Lin Fan replied, \"It's hard to say. Everyone can have many different destinies. It's all about the choices that they make. Alright, come to Shanghai and take a break when you're free. Don't be too upset about it.\"</p><br/><p>Then, they talked for a while more and hung up. He hadn't expected things to really turn out this way.</p><br/><p>Sun Lian Ming's fate wasn't supposed to be like this. It was because he hadn't listened to him and chose another path.</p><br/><p>However, it was only a small setback in his life.</p><br/><p>Wu You Lan served a cup full of tea. \"The third episode of 'Celebrity Family' is airing tonight. What do you think of it?\"</p><br/><p>Lin Fan smiled. \"I have predicted it a long time ago. There is going to be a conflict but I'm not afraid.\"</p><br/><p>Zhao Zhong Yang smiled. \"Could this be about Li Mu Ze and Lu Dao Ren?\"</p><br/><p>\"Haha,\" Lin Fan chuckled. Then, he added, \"You're right. But who knows what they'll do?\"</p><br/><p>Zhao Zhong Yang replied, \"My brothers and sisters in the broadcast are also looking forward to it.\"</p><br/><p>At 8 PM.</p><br/><p>A lot of people gathered before their televisions and computers as they prepared to watch the third episode of 'Celebrity Family'.</p><br/><p>This variety show involved interaction between celebrities and it had attracted the attention of countless people.</p><br/><p>The first thirty minutes were normal. The real sh*t happened thirty minutes into the show.</p><br/><p>Everyone was stunned when they saw what was happening.</p><br/><p>In an instant, there was terror and chaos on the internet.</p><br/>\n</div>"}