{"title": "Chapter 337: Very worth it!", "id": 337, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-337-very-worth-it", "volume_title": "Volume 4", "body": "<h1>Chapter 337: Very worth it!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 337: Very worth it!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Wu Hao Yun and Liu Jia Hui wouldn't have dared to imagine what they had just heard. Although they didn't know who these people were in front of them, they were not simple people for sure. But what did they have to do with Ou Bai Qi?</p><br/><p>Wu Heng Liang had never thought that among his son's classmates, there would be such an awesome person. He couldn't help but ask curiously, \"That Ou Bai Qi was your classmate?\"</p><br/><p>The two of them didn't know how to reply. In the end, they could only nod and say, \"Mmm, he was a classmate of ours.\"</p><br/><p>Huang Zhi Qiang started smiling. He exchanged a look with Master Lin, then said, \"Chief Wu, let me do an introduction. This is Chief He. He sells toys but don't look down on him. Chief He's business is very big and he has distributors all around the world. His net worth is in the billions.\"</p><br/><p>He Cheng Han raised his wine cup and smiled. \"Chief Huang, you're flattering me. I'm just someone who sells children's toys. Come, let's wish these two newlyweds a hundred years of happiness together. I wish for things to go your way.\"</p><br/><p>Wu Hao Yun and Liu Jia Hui were startled by his identity. They hastily said, \"Thank you, Chief He, thank you.\"</p><br/><p>Wu Heng Liang was about to give a toast to He Cheng Han when Huang Zhi Qiang said with a smile, \"Chief Wu, don't toast to him yet. This man should be first. I think you should get to know this man, Chief Wang, Wang Ming Yang, of the Eastern Han Organization. We are all impressive people here but even we have to call him our Elder Brother Wang.\"</p><br/><p>Eastern Han Organization had a huge reputation in Shanghai and naturally, Wu Heng Liang had heard of it. He had never thought that he would be able to get to know such an awesome person. He felt extremely blessed.</p><br/><p>Wang Ming Yang smiled. \"Chief Wu, let's have a toast then.\"</p><br/><p>Wu Heng Liang grinned happily and raised his cup. However, at that moment, Lin Fan spoke, \"Ming Yang, are you driving today? Or is your chauffeur driving?\"</p><br/><p>Wang Ming Yang replied, \"I'm driving myself.\"</p><br/><p>Lin Fan said, \"Then drink something else. Don't drink alcohol if you're driving next time. It's dangerous.\"</p><br/><p>Wang Ming Yang smiled. \"Alright, alright. I'll listen to my Big Bro.\" Then, he looked at Wu Heng Liang and said, \"My apologies, Chief Wu. If my Big Bro has spoken, I have to listen. I can only substitute my wine with other drinks.\"</p><br/><p>Wu Heng Liang looked at Lin Fan in astonishment. He hadn't expected this Master Lin to be so respected and he engraved this into his memory. \"Right, right. No drinking and driving. Whatever you say, Chief Wang. Cheers.\"</p><br/><p>Gradually...</p><br/><p>They went around the table and toasted to everyone.</p><br/><p>Lin Fan said, \"Chief Wu must have come to our room first. Today is a joyous occasion, you mustn't neglect your own guests because of us. You all should go and receive your guests. We'll be fine on our own.\"</p><br/><p>Wu Heng Liang understood that they were being asked to go back. He nodded with a smile. \"Alright, then I shan't disturb everyone any longer.\"</p><br/><p>Wu Hao Yun and Liu Jia Hui followed suit and bid goodbye to everyone as well before leaving the room.</p><br/><p>In the room.</p><br/><p>Huang Zhi Qiang said, \"Master Lin, that was carried out beautifully, wasn't it?\"</p><br/><p>Lin Fan smiled and nodded. \"Beautiful indeed.\"</p><br/><p>He Cheng Han asked curiously, \"Who is this Bai Qi? Since when did you have a Chief Technological Director for Internet security? \"</p><br/><p>Lin Fan laughed, \"Now I do. I had to find someone to handle my personal relations on the Internet.\"</p><br/><p>Wang Ming Yang said, \"Although I don't know the full situation, let's not talk anymore. Let's drink to our heart's content. I actually brought a chauffeur today.\"</p><br/><p>…</p><br/><p>Outside.</p><br/><p>Wu Heng Liang asked, \"Hao Yun, why didn't you tell me that you and Jia Hui had such a classmate?\"</p><br/><p>Wu Hao Yun was startled. He looked at Liu Jia Hui, then said, \"Dad, we never knew about this. He never told us.\"</p><br/><p>Wu Heng Liang said, \"Later on, you have to treat that classmate well. I think that classmate of yours has a pretty important place in that Master Lin's heart. Don't do anything bad to him.\"</p><br/><p>At that moment, Wu Hao Yun thought that this situation was f*cked up. What the heck was going on? How had something like this happened? This was something completely beyond his imagination.</p><br/><p>Liu Jia Hui was even more astounded. She had never thought that this kind of situation would show up.</p><br/><p>Wu Heng Liang said, \"Follow me to the elders' tables to propose a toast first. Later on, go to your classmate's table.\"</p><br/><p>At the banquet.</p><br/><p>Zhang Meng Jun sighed, \"This banquet is really not bad. They have seafood, abalone and everything else. Only the wealthy could afford to eat like this.\"</p><br/><p>Autumn Sword Fish Killer had no appetite. He just sat there silently, not even knowing what to think about.</p><br/><p>A male student next to them had drunk a bit and had gotten a little drunk. He said with a grin, \"Bai Qi, back then, you used to be together with Jia Hui. Now that she has married Wu Hao Yun, how do you feel?\"</p><br/><p>Zhang Meng Jun said, \"How many dog years have passed since then? And you're still bringing it up. Is there anyone who hasn't been through a few girlfriends? Don't talk about it. What's the point of bringing that up in such a setting?\"</p><br/><p>The male classmate said, \"I don't have any intentions, I'm just saying. I just never thought that Bai Qi would come.\"</p><br/><p>\"Bai Qi, what exactly do you do now? I really want to know. You do Internet troll work?\"</p><br/><p>Autumn Sword Fish Killer replied, \"Something like that. I handle public relation crises.\"</p><br/><p>\"Hehe, I know about these things. Most of them are cover up jobs. I hate this kind of things. Most of them perform cover-up jobs for people who've done nasty things. I wonder how you've gotten involved in this field.\"</p><br/><p>Autumn Sword Fish Killer smiled awkwardly. \"Just trying to make a living. If the job salaries aren't too far apart, I would never accept nasty jobs.\"</p><br/><p>\"Who wouldn't be bought over by money?\"</p><br/><p>Zhang Meng Jun said, \"Let's talk about something else. If I remember correctly, you all haven't gotten girlfriends yet. Why don't you find one?\"</p><br/><p>\"Sigh, how could I find one? My job stress is so great now, I can barely survive myself.\"</p><br/><p>\"Yeah, I used to have a girlfriend but it was a long-distance relationship and it didn't last long.\"</p><br/><p>\"Hey, let's not talk for now. They're here for a toast.\"</p><br/><p>At that moment, Wu Hao Yun and the rest came to propose a toast.</p><br/><p>Liu Jia Hui looked at Ou Bai Qi in disbelief. She would never have imagined that things would turn out this way.</p><br/><p>Wu Heng Liang said, \"Come, thank you to everyone for gracing this wedding. Let Uncle and Auntie propose a toast to you all.\"</p><br/><p>The crowd said, \"That's courteous of you, Uncle and Auntie.\"</p><br/><p>Autumn Sword Fish Killer forced a thin smile.</p><br/><p>At that moment, Wu Hao Yun patted Autumn Sword Fish Killer's shoulder and said, \"Bai Qi, I really couldn't tell. I never thought that you would be doing so well now.\"</p><br/><p>\"Huh?\" Autumn Sword Fish Killer was taken aback. What does that mean? Is he being sarcastic? Is he mocking me?</p><br/><p>However, when Wu Heng Liang came to pat him on the shoulder, he was dumbfounded.</p><br/><p>\"Bai Qi, you're young and promising. At such a young age, you've become a Chief Technological Director for Internet security. You're all classmates. In the future, you have to support each other, okay? In this society, the realest relationships will always be the friendships among your fellow classmates,\" said Wu Heng Liang. Then, he raised his wine glass, \"Come, Uncle shall toast to you all.\"</p><br/><p>Although Wu Heng Liang was actually proposing a toast to everyone, he touched cups with Autumn Sword Fish Killer.</p><br/><p>Autumn Sword Fish Killer looked up and said, \"Uncle, this job of mine isn't anything great and it's not such a good yielding job.\"</p><br/><p>Wu Heng Liang laughed, \"You're humble, youngster. Your boss, Master Lin, is just next door, eating. Your boss really likes you. And Uncle really must thank you for thinking of Hao Yun and Jia Hui.\"</p><br/><p>At that moment, Autumn Sword Fish Killer was dumbfounded.</p><br/><p>Master Lin?</p><br/><p>I don't seem to know any 'Master Lin's.</p><br/><p>No, that's not right. The only Master Lin I know is that lying fella.</p><br/><p>F*ck, could it really be him?</p><br/><p>Meanwhile, Wu Heng Liang's behavior had drawn the crowd's attention. They weren't stupid. This change of behavior was very abnormal, especially those words that Wu Hao Yun had said previously. It seemed to have a deep meaning.</p><br/><p>Autumn Sword Fish Killer looked at Jia Hui and suddenly realized that she was looking at him with a different expression. It was as if she was in disbelief or astonishment.</p><br/><p>Then, he smiled and said, \"Uncle, this is nothing much…\"</p><br/><p>Since it was like this, he decided to let this misunderstanding carry on.</p><br/><p>Although he wasn't clear what was happening, the situation had already developed to such a stage. What else could he have done? He could only pretend to be a little f*cking awesome</p><br/><p>I, Autumn Sword Fish Killer, am not someone who is easily looked down on. He thought to himself. As for that Master Lin, I'll remember this kindness of yours.</p><br/><p>Meanwhile, in the other room, Lin Fan laughed. Just by saying a few words, he had been able to buy over a person. From that day onwards, he would have someone to pour his heart and soul into helping him with his Internet public relations. This trade was really way too worth it.</p><br/>\n</div>"}