{"title": "Chapter 349: F*ck! This is too unreal!", "id": 349, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-349-fck-this-is-too-unreal", "volume_title": "Volume 4", "body": "<h1>Chapter 349: F*ck! This is too unreal!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 349: F*ck! This is too unreal!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Head Chief Wang knew that this incident would probably be big news. With so many townsfolk around and each of them holding their phones in their hands, this incident would spread, then things would be bad.</p><br/><p>Liu Xiao Tian and his men were there too but this matter didn't concern them.</p><br/><p>This place wasn't under their jurisdiction. However, they would still communicate with the local police station. Especially because these men openly assaulted policemen, they had to be detained.</p><br/><p>In front of all the townsfolk, Head Chief Wang stood forward and spoke. He had to calm the surrounding townsfolk's emotions. This wasn't a matter of who was right or wrong. The city enforcement officers were definitely wrong. They were the cause of it. They had disregarded the law, acted as if they were above everything and behaved arrogantly and despotically, hence, they had to be dealt with severely.</p><br/><p>When they returned to the station, this wouldn't be something that he, as the Head Chief, could bear responsibility for alone. It would require reports to be written by the higher-ups.</p><br/><p>Liu Xiao Tian interacted with Lin Fan for a while and also approached the townsfolk to gather some information. At the same time, he obtained a copy of a video.</p><br/><p>When he watched the video, Liu Xiao Tian's brows furrowed. Afterward, he patted Head Chief Wang on the shoulder. \"You should get a copy of this video. You guys have to bear responsibility for this matter.\"</p><br/><p>Head Chief Wang nodded. They, as city enforcement officers, already had a bad reputation in the society. They even got labeled as bandits by some people and they were often scolded harshly on the Internet. They were often referred to as the 'Chinese characteristics' of socialism.</p><br/><p>They had always tried to correct this view and let the citizens have a deeper understanding of them but there would always be some people who not only didn't safeguard the name of the city enforcement officers but instead, brought shame to it and made it rotten.</p><br/><p>A piece of rat sh*t spoils a whole pot of porridge.</p><br/><p>Liu Xiao Tian said, \"Head Chief Wang, we'll bring these people back. This matter isn't about law enforcement anymore. This has involved the police and it's a criminal case already. We need to investigate.\"</p><br/><p>Head Chief Wang nodded. \"I understand. This matter cannot be taken lightly. They must be severely dealt with.\"</p><br/><p>Liu Xiao Tian pointed at those men and said, \"Strip them of their uniforms before handcuffing them. Don't let them shame this profession.\"</p><br/><p>\"Yes, sir.\" The policemen nodded and moved quickly. Their fellow policemen had taken a beating and they were furious as well.</p><br/><p>…</p><br/><p>After Liu Xiao Tian and the rest left.</p><br/><p>Lin Fan waved his hands. \"Everyone, go back. This matter is over. I believe they will deal with it properly.\"</p><br/><p>At that moment, that peach-selling old man came from behind and said, \"Little Boss, I'm really sorry. Just because of this old man, you all have been troubled.\"</p><br/><p>Lin Fan waved his hand. \"It's not a problem. It wasn't because of you, it was their attitudes. If we weren't the ones who were picked on by them, then it would have been someone else. I would never just sit down and watch something like that happen.\"</p><br/><p>The surrounding shop owners cried out in agreement, \"That's right. This is our duty. We, the people of Cloud Street, have to stand together. In the face of such violent enforcement, if we don't band together, we'll be taken advantage of.\"</p><br/><p>The townsfolk cheered, \"This is the first time I've seen such united business owners.\"</p><br/><p>\"Yeah! We've seen this kind of violent enforcement countless times and each time is infuriating. But still, none of us dare to stand up to it alone.\"</p><br/><p>\"Although I didn't do anything, today was very liberating.\"</p><br/><p>\"Master Lin, please say a few words. I'll be posting this video on the Internet later on.\"</p><br/><p>\"I have a friend who's a reporter. I'm going to send this video to him.</p><br/><p>When Lin Fan heard that, he was delighted. Then, he tidied up his clothing and the surrounding townsfolk pointed their phone cameras at him.</p><br/><p>\"Greetings, everyone. I'm the Master Lin that everyone talks about. What happened today was a special case. I still have full faith in our country. In our socialism with Chinese characteristics, I not only learned how to make scallion pancakes but I also learned to write songs. My composer name is Master Lin. In future, when you see songs composed by me, don't be surprised because that is indeed me…\"</p><br/><p>In the beginning, there had been nothing wrong with his words. But towards the end, something was wrong. Why did this Master Lin start praising himself?</p><br/><p>After some remarks, Lin Fan waved his hand and said, \"Alright, those who want to roam the streets, carry on. This matter is over. I need to go back and rest too. What happened just now was too intense, I'm a little tired.\"</p><br/><p>\"Haha…\"</p><br/><p>Everyone burst into laughter, then they slowly dispersed. The day's happenings had been too f*cking exciting. The shop owners felt that it had been intense too. They had never experienced such an intense situation in their lives before. If this was before, even if they had ten guts, they wouldn't have dared to do what they had done that day.</p><br/><p>Doing things with Master Lin was really refreshing.</p><br/><p>When Lin Fan returned to his shop, someone sent him a copy of the video.</p><br/><p>Lin Fan opened Weibo on his phone and posted the video, adding a caption.</p><br/><p>\"Songwriter Master Lin joins forces with the people to fend off unlawful law enforcers.\"</p><br/><p>This caption appeared to Lin Fan as very domineering and there was nothing wrong with it. He posted it, then closed his Weibo, deciding not to concern himself with it.</p><br/><p>At that moment, waves were gradually rippling through the Internet.</p><br/><p>Anything that concerned the image of the society was sure to attract people's attention.</p><br/><p>Of course, there were many videos on the Internet nowadays that did not represent the full background of the situation. These videos would be spread around groups of people and people who didn't know the full situation would feel that society was really dark. To Lin Fan, it was very likely that this video would be used by some restless fellas to cause suspicion towards society and cause unrest within the country.</p><br/><p>Although that wasn't the immediate outcome, whenever someone saw a video like this, he or she would develop distrust towards the government and feel gloomy about the society. It incited unhappiness towards the country.</p><br/><p>The next day!</p><br/><p>There were waves rippling across the Internet. Many media agencies had reported on the incident.</p><br/><p>The related departments made public announcements very quickly that they were dealing severely with the people involved. Besides removing all of them from their appointments, because they had hit the police and broken the law, they had been detained and were awaiting their hearing.</p><br/><p>The related department's leaders were making public apologies, expressing their apology for the incident and hoping that the majority of the townsfolk would understand them, etc…</p><br/><p>On the Internet.</p><br/><p>\"F*ck! This is unrivaled. It's f*cking awesome. I'm speechless. These guys were way too unbridled.\"</p><br/><p>\"I saw the video. They're the shame of our city enforcement officer department.\"</p><br/><p>\"Qinghai Enforcement Officer Division supports the severe punishment of these law-breaking enforcers.\"</p><br/><p>\"Beijing Enforcement Officer Division, support +1\"</p><br/><p>\"Master Lin looks too dashing in the video. He's my idol!\"</p><br/><p>\"Yeah! Not only Master Lin is caring, even the surround shops' owners are just as caring. They went against these people to such an extent just for a peach-selling old man.\"</p><br/><p>\"Hey, who is this Master Lin? It seems like he's a composer. I did a search on the Internet and found a piece of related news. I never thought that Master Lin was involved not just in this glorious incident but also in many other f*cking awesome incidents.\"</p><br/><p>\"Amazing. I've already updated his Baike page. If anyone is curious about Master Lin, you can go check it out.\"</p><br/><p>\"It turns out that song, 'Sky', was composed by Master Lin. he's amazing indeed.\"</p><br/><p>Cloud Street.</p><br/><p>When Lin Fan reached the shop, a group of reporters came flocking. He had already gotten used to such a scene long ago.</p><br/><p>\"My fellow people, don't be anxious. Take it slow. Don't crowd. If you have questions, ask away.\"</p><br/><p>A reporter asked, \"Master Lin, do you have any thoughts regarding yesterday's incident? Are you satisfied with the public announcements made by the related departments?\"</p><br/><p>Lin Fan said, \"I don't have any thoughts on this. This was a special case. And I'm not satisfied or dissatisfied about the public announcement. That is for the citizens to see. After yesterday's events, it has shown that everyone has a strong sense of justice. The related departments have also actively dealt with the situation. After all, our country is so big. No matter where it is, there is sure to be one or two bad eggs.\"</p><br/><p>While Lin Fan was happily speaking, on the Internet, many people had developed an interest in this Master Lin. Especially after they saw the video, they were prostrating themselves in admiration.</p><br/><p>Some people who didn't know who Master Lin was only realized after watching the video that this hero was a song composer. Then, they instantly gained respect for him.</p><br/><p>One person respected him.</p><br/><p>Two people respected him.</p><br/><p>...</p><br/><p>Ten thousand people respected him.</p><br/><p>Cloud Street.</p><br/><p>Lin Fan was talking to the reporters when suddenly, that cheerful expression changed. A sound rang out in his head.</p><br/><p>F*ck!</p><br/><p>This is too unreal!</p><br/><p>The task…</p><br/><p>...has been completed.</p><br/>\n</div>"}