{"title": "Chapter 352: Task underway", "id": 352, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-352-task-underway", "volume_title": "Volume 4", "body": "<h1>Chapter 352: Task underway</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 352: Task underway</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>In the ward.</p><br/><p>The wife said, \"Old man, what are you thinking about? What's troubling you?\"</p><br/><p>The old man replied, \"It's nothing. It's just that I felt that that youngster was very strange so I was just thinking about it.\"</p><br/><p>The wife was skinning an apple. Although her eyes couldn't see clearly, her movements were not slow. A little disappointment appeared on her wrinkle-covered face as she said, \"Old man, I hope you don't hold anything against me in this lifetime. It was my fault that I couldn't give you a child. If we had had a child, perhaps our grandchildren would be seventeen or eighteen right now.\"</p><br/><p>The old man chuckled. \"What are you thinking about? You're the person I love and it has nothing to do with whether or not you can give me a child. Just being with you in this life has been worth it. What are you crying for? If you cry, you'll become ugly and other people will laugh at you.\"</p><br/><p>The wife held onto the old man's hand and they snuggled up together. After going through these decades of hardship together, their relationship was very good. When the wife was young, there had been a problem with her body and she couldn't give birth. During those times, when a wife couldn't give birth, the couple would most likely end up in a divorce. But this old man didn't turn his back on her. All he wanted was for the two of them to be happy together.</p><br/><p>They didn't even adopt a child. To the old man, adopting someone else's child would just keep reminding his wife of her regrets. It was better not to adopt a child. Then, when the two of them grew old and left the earth, they could leave without any cares or worries.</p><br/><p>…</p><br/><p>Lin Fan exited the hospital and took a cab to the pharmacy to buy some medicine.</p><br/><p>The old man's condition, from the view of Western Medicine, was incurable because the cancer cells had spread throughout his body. If they used chemotherapy, it would only add to his pain.</p><br/><p>What Western Medicine can do, Chinese Medicine cannot. What Chinese medicine can do, Western medicine can't either.</p><br/><p>This kind of illness, in particular, required one to harmonize one's own body and attack from the inside.</p><br/><p>And because of these restricting circumstances, he could only be treated using Chinese Medicine. Using Chinese Medicine, if Lin Fan didn't have the Encyclopedia's mystical boost, he would still have some confidence but he wouldn't know how long it would take. With the Encyclopedia's mystical boost, Lin Fan was a little curious as to what kind of effect it would have.</p><br/><p>The pharmacy.</p><br/><p>Lin Fan grabbed several medications according to what he needed. Before he had obtained the Encyclopedia's knowledge, he hadn't even understood what these medications were for but now, he could see through everything. As he was grabbing and grabbing medicine, Lin Fan's brows suddenly furrowed and his hands stopped moving.</p><br/><p>In the pharmacy, the owner took some medicinao ingredients and placed them on the table. Lin Fan took a look to inspect them. When he saw 'Dragon Bone', he realized that something was wrong.</p><br/><p>\"Boss, come over here,\" said Lin Fan.</p><br/><p>The pharmacy owner had a mustache. He was over fifty years old and his eyes were glimmering. He looked at Lin Fan with a smile and said, \"What is it, youngster?\"</p><br/><p>Lin Fan shook his head and smiled. \"This dragon bone is real dragon bone?\"</p><br/><p>The boss' eyes gleamed, then he smiled and said, \"Of course it's real. My shop, 'Eight Treasures Room', has been dealing with Chinese Medicine for thirty years. We have our reputation as a guarantee that we don't ever sell fake products.\"</p><br/><p>Lin Fan's expression turned grave as he said, \"I'll give you one last chance.\"</p><br/><p>Suddenly, the atmosphere in the place had gotten solemn.</p><br/><p>The pharmacy owner looked at Lin Fan. His heart was thumping furiously. Then, he laughed and said, \"Oh, right, I took the wrong one. This isn't dragon bone, this is something else. I'll get you a new one.\"</p><br/><p>Lin Fan was annoyed. In today's society, Chinese Medicine wasn't recognized and it wasn't because there were no good Chinese doctors but many Chinese medications were fake. Some people, even after taking Chinese medicine for a long time, their illnesses would not be cured. This wasn't a problem with the doctor's diagnosis and treatment, nor with the prescription, but it was the medicine sold by the Chinese Medicine shops. They were fakes and couldn't possibly cure the illnesses.</p><br/><p>There was too much profit to be made in this industry. When the amount of gains was above a certain amount, people would do anything as long as no one died from eating the medicine. In fact, there were very few people nowadays who could differentiate between the real and the fake. Perhaps only the old Chinese doctors could do it.</p><br/><p>That 'Dragon Bone' from before was just calcium oxide mixed with minerals and shaped into a dragon bone shape. What effect could that possibly have?</p><br/><p>The owner took out some new medicine, then he smiled and said, \"This is it. Take a look.\"</p><br/><p>Lin Fan glanced at the owner, then nodded and said, \"Yep, don't make things up. I'm an expert.\"</p><br/><p>\"Hehe,\" the owner laughed and said, \"I wasn't making things up. I just took the wrong thing.\"</p><br/><p>Gecko, water plantain rhizome, Chinese lobelia, self-heal, etc… A total of ten medicinal ingredients.</p><br/><p>Because this owner wasn't very honest, Lin Fan was worried about the other ingredients as well. He personally examined each of them. The owner smiled and said, \"Don't worry, kid. My shop doesn't cheat the young nor the old. Just now, I just accidentally took the wrong thing. Do you think I would really use fake medicine?\"</p><br/><p>Lin Fan laughed. \"Can I brew my medicine here?\"</p><br/><p>The owner nodded. \"Sure, go ahead.\"</p><br/><p>Lin Fan had no tools as of then and could only do it there. The owner watched Lin Fan's medicine boiling technique and control of the fire. His heart was beating profusely. This technique was high-level. He wasn't a newbie. The owner wasn't able to earn much from this sale. He could only hope that he would meet a newbie that he could cheat next.</p><br/><p>Then, Lin Fan portioned the medicine for the old man. He would need to take it ten times.</p><br/><p>After he was done preparing medicine, Lin Fan stood in front of the counter and looked down.</p><br/><p>The owner laughed as he said, \"You want to buy some silver needles, kid? I have some good ones here. The craftsmanship is first-rate. They can be handed down for hundreds of generations. You want to take a look?\"</p><br/><p>Lin Fan waved his hand and said, \"Give me four boxes of these disposable silver needles.\"</p><br/><p>\"Huh?\" The owner stared blankly at Lin Fan. That's too stingy, isn't it? He wants the disposable ones?</p><br/><p>Initially, because he couldn't earn much of a profit from the medicine, he had wanted to earn a larger sum from the needles. He had not expected that this kid wouldn't even give him that chance.</p><br/><p>Then, he lifelessly took four packets of disposable needles and said, \"Four packets. One hundred and sixty in total.\"</p><br/><p>Lin Fan had already paid for the medicine. Then, he handed over 160 dollars. He packaged the brewed medicine and walked away.</p><br/><p>At that moment, customers went into the shop and one of them said, \"Boss, show me your wild lingzhi mushrooms.\"</p><br/><p>Lin Fan looked at the customer. Just as he was about to reach the entrance, he said, \"The two of you must be careful. This shop sells fake medicine. You should take a video and bring it for inspection so that you won't be cheated. After all, those wild lingzhi mushrooms are quite expensive.\"</p><br/><p>\"F*ck…\" When the owner heard that, he was pissed off. The youngster even ended off by f*cking him up. Then, when he realized that the two customers looked a little doubtful, he hurriedly said, \"Don't listen to that kid's nonsense. That's all false information…\"</p><br/><p>The customer said, \"Forget it, let's look elsewhere.\"</p><br/><p>\"There are too many fake wild lingzhi mushrooms nowadays. We should be more careful.\"</p><br/><p>The customers who had been within his grasps had fled away. The owner was furious.</p><br/><p>Meanwhile, Lin Fan headed towards the hospital.</p><br/><p>He wondered if this first patient of his would believe him. Even if he didn't, Lin Fan wouldn't be able to do anything.</p><br/><p>Lin Fan was just doing this sneakily. He didn't dare to do it openly because if he got caught, he would be in deep trouble.</p><br/>\n</div>"}