{"title": "Chapter 350: The tenth page major class of knowledge", "id": 350, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-350-the-tenth-page-major-class-of-knowledge", "volume_title": "Volume 4", "body": "<h1>Chapter 350: The tenth page major class of knowledge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 350: The tenth page major class of knowledge</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"The ninth task has been completed, Encyclopedic Points will be increased by 20 points.\"</p><br/><p>\"Unlocking the tenth page of knowledge. For it's the tenth page of knowledge and as the saying goes 'A perfect ten', a random class of knowledge will be chosen but it will be a major class of knowledge.\"</p><br/><p>At that moment, Lin Fan was stunned. He didn't dare to believe what he had just heard. Since when had the Encyclopedia had a conscience? The tenth page's task would be a major classification of knowledge?</p><br/><p>A major classification of knowledge was incredible. One major classification of knowledge encompassed many sub-classes of knowledge.</p><br/><p>For example, the martial arts classification was a major classification and the Ba Gua Zhang that he possessed was just a sub-class. If he could obtain a major classification in one go, that would simply be nature-defying. He could become a superman in an instant.</p><br/><p>The surrounding reporters saw that Master Lin had stopped talking and became anxious. \"Master Lin…\"</p><br/><p>Lin Fan's expression was grave. He raised his hand and said, \"Everyone, please wait a moment. Give me three minutes. Don't talk.\"</p><br/><p>The reporters had no idea as to what was going on but they saw that Master Lin's expression was very grave. It was as if he was facing a tremendously important situation. Hence, they all held their breaths and silently waited.</p><br/><p>They were guessing.</p><br/><p>Could it be that Master Lin is thinking of something important?</p><br/><p>Or is he thinking of yesterday's incident?</p><br/><p>Meanwhile, Lin Fan was praying in his heart. He wasn't asking to be an immortal or a hero but he wanted a bada*s major classification.</p><br/><p>He knew that no matter what major classification it was, it could turn him into the world's greatest Superman.</p><br/><p>All the knowledge classes that he had gotten up till now were subclasses. To Lin Fan, the language major classification was the most f*cked up. Previously, he had obtained the animal speech class, which was a sub-class of language. If he were to obtain the language major classification, the most he would be able to do was to become a master of all the languages in the world. That wouldn't be worth it at all.</p><br/><p>\"A major classification of knowledge is being chosen, please wait a moment…\"</p><br/><p>Even though it was just a short time, Lin Fan felt like days and even years had passed. If it was going to come, then come. It didn't matter what major classification it was, he could take it. But making him wait was torturous.</p><br/><p>Among all the countless different major classifications, a light was bouncing between them. It was going to land on one of them and select it.</p><br/><p>*Ding!*</p><br/><p>Suddenly, the light stopped. It flickered and it was dazzling.</p><br/><p>\"Unlocking the Medicine major classification. It encompasses Chinese Medicine, Western Medicine and other medical related sub-classes(along with the mystical boost from the Encyclopedia).\"</p><br/><p>\"The Chinese Medicine class is divided into Chinese Medicine Techniques and Chinese Medication.\"</p><br/><p>\"The Western Medicine class is divided into Medicinal Science and Surgical Science.\"</p><br/><p>\"Task unlocked: Become a barefoot doctor, help the public by practicing medicine and go to five different cities.\"</p><br/><p>\"Task rewards: Encyclopedic Points +100 and the ability to unlock the eleventh page of knowledge.\"</p><br/><p>\"Note: Since it is a major knowledge classification, you must immediately involve yourself in the profession.\"</p><br/><p>\"Current Encyclopedic Points: 160\"</p><br/><p>\"The countdown is starting. 60 seconds. You must take action immediately.\"</p><br/><p>…</p><br/><p>\"F*ck!\"</p><br/><p>When Lin Fan heard the task notification, he was completely stunned. This task was too rushed. Why did he have to take action immediately?</p><br/><p>\"59!\"</p><br/><p>\"58!\"</p><br/><p>…</p><br/><p>The reporters saw Lin Fan come back to his senses and they even saw him blurt out a vulgarity. They were all startled. Then, they immediately pressed Lin Fan with all kinds of questions and inquiries.</p><br/><p>Lin Fan didn't have time to boast to the reporters anymore. He turned around and shouted at Fraud Tian and the rest, \"I'm going out for a while. I'll leave the shop to you guys.\"</p><br/><p>Everyone was shocked. They didn't understand what was going on. What does that mean?</p><br/><p>But at that moment, Lin Fan leaped up like a high jumper and leaped past the crowd. Then, his legs began to move as he ran towards the outside. He turned his head around and said, \"I have to do something. I'll only be back after a period of time. You guys look after the shop.\"</p><br/><p>The reporters chased after him.</p><br/><p>Fraud Tian chased after him too. \"Where are you going? At least tell us where!\"</p><br/><p>But Lin Fan was already nowhere to be seen. Not a shadow of him remained.</p><br/><p>Fraud Tian took out his phone and made a call. \"Where on earth are you going?\"</p><br/><p>Lin Fan was already in the rented car. He said, \"I suddenly thought of something exceptionally important. I need to go out for some time. Look after the shop for me.\"</p><br/><p>Fraud Tian asked, \"How many days will you take?\"</p><br/><p>Lin Fan thought for a moment, then said, \"At least ten days.\"</p><br/><p>This was just a rough guess. He really didn't know the exact duration.</p><br/><p>After hanging up, Lin Fan really didn't know what to say.</p><br/><p>This tenth page's task was too f*cked up. He had to take immediate action. He didn't even have time to tidy up his clothes and he hadn't even done any preparations at his workplace. What kind of game was this?</p><br/><p>Cloud Street.</p><br/><p>Wu You Lan had a look of astonishment on her face as she asked, \"Fraud, what did he say?\"</p><br/><p>Fraud Tian shook his head. \"I don't know either. He just said that he'll only be able to come back after ten over days.\"</p><br/><p>Zhao Zhong Yang said, \"It can't be. Such a long time?\"</p><br/><p>Fraud Tian shrugged helplessly. \"I have no idea either. If he goes out for ten over days, what do we do about the shop? Those scallion pancake-buying townsfolk will cause a ruckus for sure!\"</p><br/><p>At that moment, Lin Fan had reached the train station. He bought a ticket. As for which city he would go to, he had no idea. He could only go to whichever city that was near. He didn't want to go too far.</p><br/><p>In the train carriage.</p><br/><p>Lin Fan sat there. He had calmed his emotions down. With so much information in his mind, he couldn't think properly for a moment. He had never thought that the major classification of knowledge that he would get would be this one. This had been completely unexpected. Moreover, this time, the Encyclopedia hadn't even picked someone close to him. It had just picked randomly. Could it be that it would pick a major classification every ten pages?</p><br/><p>If that were true, then it wouldn't be bad at all.</p><br/><p>*cough cough*</p><br/><p>A middle-aged man next to him was covering his mouth as he coughed furiously. Then, he relaxed his chest and things quietened down.</p><br/><p>Because Lin Fan had just gotten this knowledge, he was insanely curious. He couldn't help but look at that middle-aged man. Although in the past, he could use his fortune-telling knowledge to see that this man was sick, he wouldn't have known how to cure him. But now, with one look, it was as if he knew everything like the back of his palm. The kind of illness, the cause of the illness and even how to cure it, he knew all of this.</p><br/><p>The middle-aged man realized that the young man next to him was gazing at him. Then, he nodded and smiled. \"It's a chronic illness.\"</p><br/><p>Lin Fan didn't say anything but just smiled thinly.</p><br/><p>When the train staff passed them, Lin Fan said, \"Please bring me some paper and a pen.\"</p><br/><p>The train staff replied, \"Okay, please wait a moment.\"</p><br/><p>Soon, the paper and pen arrived.</p><br/><p>The task notification had told him to become a barefoot doctor and help the public by practicing medicine. To Lin Fan, this wasn't hard. And it wasn't a bad thing to help people out as well.</p><br/><p>Chinese and Western Medicine both have their advantages. Chinese Medicine is gentle and, using the body as a foundation, it mediates the situation in the body. Western Medicine is efficient but every medicine has its side effects. Between the two classes of medicine, it was hard to say which was better.</p><br/><p>Lin Fan didn't have anything to do at the moment so he decided to treat the man but he didn't have the medications. He wrote down the prescription on the paper and after everything was done, he returned the pen to the train staff.</p><br/><p>After an unknown period of time.</p><br/><p>They reached the destination.</p><br/><p>Suzhou!</p><br/><p>When he got up and was about to get off the train, Lin Fan patted the middle-aged man. \"Brother, I saw that your cough is really bad. It's a lung disease. I'm skilled in medicine so I wrote down some Chinese medications. After you take it a few times, you will be cured.\"</p><br/><p>The middle-aged man looked at Lin Fan and took over the sheet of paper. Then, he laughed and continued walking.</p><br/><p>Lin Fan had never thought that this man would actually believe him. He couldn't help but be delighted.</p><br/><p>But when Lin Fan walked out of the train, he saw that the middle-aged man had crushed the sheet of paper into a ball and threw it to the side.</p><br/><p>The middle-aged man had gone to Shanghai earlier to see a doctor. Even the doctor hadn't been able to promise him anything. Of course, he didn't believe Lin Fan and what he had written on the sheet of paper. He had only taken it earlier so he could leave quickly and not waste time talking to Lin Fan.</p><br/><p>Lin Fan stood at the same place, shaking his head. He was silent.</p><br/><p>He couldn't blame the man. After all, it was common not to trust strangers.</p><br/>\n</div>"}