{"title": "Chapter 357: A little impersonation", "id": 357, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-357-a-little-impersonation", "volume_title": "Volume 4", "body": "<h1>Chapter 357: A little impersonation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 357: A little impersonation</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>On the train!</p><br/><p>He departed from Suzhou, not because there was nothing else to do there but because he felt that there was some danger. It would be best to retreat sooner. According to the Encyclopedia's task, he had to go to five cities.</p><br/><p>He had to quickly change cities. If he got captured in Suzhou and detained and his task completion got delayed, it would be a waste of time.</p><br/><p>During the journey, on the seat next to the corridor, a woman was carrying a child. This child's complexion didn't look too good. It seemed that he was sick. The woman's face looked wan and sallow too, as if she was worried.</p><br/><p>\"Big Sister…\" said Lin Fan, \"About your child's issue, I think you should…\"</p><br/><p>Before Lin Fan finished speaking, the woman glared at Lin Fan with an alert look, then she called the service staff and said something to them.</p><br/><p>\"Mister, could you show us your ID?\" the service staff said.</p><br/><p>Lin Fan shook his head in frustration, then passed him his ID. He had never thought that his goodwill would cause someone to be suspicious about him. Then, he couldn't help but start laughing.</p><br/><p>After that, he didn't say a word for the entire journey.</p><br/><p>He reached Nanjing at nighttime and found a guesthouse to stay at.</p><br/><p>A call came.</p><br/><p>Fraud Tian: \"When are you going to come back? The townsfolk have already started protesting today. We can't contain them.\"</p><br/><p>Lin Fan said, \"Slowly. Hold on a little longer, I'll be back after a period of time.\"</p><br/><p>Fraud Tian cried his heart out, \"Come back sooner! Without you here, some of the townsfolk are looking for me. I haven't been at peace the whole day!\"</p><br/><p>The two of them chatted for a while more, then Lin Fan hung up. He couldn't help but start laughing. He had never thought that going out for a while would cause so many things to happen.</p><br/><p>The next day, at noon.</p><br/><p>Lin Fan ate by himself at a restaurant.</p><br/><p>The television, which was hung on the wall, was showing the news and it drew his attention.</p><br/><p>On the television, the host said, \"Yesterday, at Suzhou Hospital, a rebellion occurred among the patients. The reason behind it was that a cancer patient had met a mysterious man and through the mysterious man's treatment, the cancer cells on his body kept decreasing. According to proof from the hospital, the patient's body is really recovering. This incident has caused a huge impact on the place as countless people want to know what kind of divine person that mysterious man is. Next up, we have our very own reporter interviewing the person at the scene, Uncle Chen…\"</p><br/><p>Lin Fan watched the television as he ate his food. The situation had turned out just as he had expected. He had gotten exposed in the end but they didn't know who he was yet.</p><br/><p>Before the completion of the task, he absolutely could not expose himself.</p><br/><p>After the completion of the task, he was prepared to do the exams for medical qualifications. He had heard that the Chinese medical qualifications were easier to get.</p><br/><p>The surrounding diners were in discussion.</p><br/><p>\"Is this news real or fake? Even cancer can be cured?\"</p><br/><p>\"Who knows? But to appear on television, it should be true.\"</p><br/><p>\"No one knows for sure. It's really unbelievable. That's cancer we're talking about. Could it really be a godly doctor?\"</p><br/><p>\"Let's just care about ourselves. Whether it's a godly doctor or not, it has nothing to do with us. We're not sick, after all.\"</p><br/><p>This incident hadn't caused much of a stir on the Internet, mainly because it was too unreal because it involved a cancer patient. For an average person, if he used his brain to think just a little bit, he would know that this wasn't possible.</p><br/><p>Meanwhile, the hospital's side was actively investigating who that person was but from the hospital's cameras, they could only find some blur images of his face. To find the person using these images was extremely difficult, like finding a needle in the ocean. Who knew when they would be able to find him?</p><br/><p>…</p><br/><p>A certain hospital in Nanjing.</p><br/><p>Lin Fan was hanging around in the hospital, looking for a target. He was looking for patients who couldn't be cured. But after looking for a long time, he couldn't find anyone who would trust him.</p><br/><p>Even when he found a patient, when he started speaking, the patient would run away in fear, thinking he was a trickster. This made him really frustrated.</p><br/><p>Being chosen by such a great godly doctor was fate. It was a shame that they didn't trust him. It really left him helpless.</p><br/><p>At that moment, a series of noises came from in front. When he went to check out the situation, he realized that a pair of parents were tugging on a doctor. \"Doctor, we're begging you, please let the operation later be a success!\"</p><br/><p>The doctor said gravely, \"I will try my best.\"</p><br/><p>When he said this, he didn't have much confidence in himself because the sickness was too rare and the operation was too difficult. But he couldn't cower from it because everyone's hopes were laid upon him.</p><br/><p>The nurses said, \"The reporters are all downstairs, they've already been cordoned off by the security.\"</p><br/><p>The doctor nodded. \"Cordon them off and tell the security that before the operation has been completed, don't let a single reporter in.\"</p><br/><p>The nurse nodded. The parents weren't the only ones anxious about this, the nurses were very nervous as well.</p><br/><p>Lin Fan looked into the ward and saw a little girl lying on the bed. The nurses were tidying up the place, then they lifted her up and onto the movable sick bed and pushed her towards the operation room.</p><br/><p>When Lin Fan looked over, his brows furrowed. Craniopharyngioma, a complicated illness indeed. The chances of surviving it were not high and the operation was extremely difficult. A tiny mishap could cause the loss of her life. The family members probably understood the situation but without the operation, there was no chance at all for the little girl to survive.</p><br/><p>\"Please give way,\" said the nurses pushing the bed.</p><br/><p>On the bed, the little girl kept smiling as if she didn't know what was going on. Then, she pulled her Mama's hand. \"Mama, if I die, could you use my name for your future child? I'm scared that you'll forget me.\"</p><br/><p>The little girl's Mama had tears all over her face, \"Mama and Papa will protect you even if we have to sell our blood and kidneys.\"</p><br/><p>The nurses wiped the tears from their eyes. They loved that little girl. She was different from the other children. This child was very strong, very positive and she constantly wore a smile on her face but they knew that this might be the last time they would see her because according to the experts' analysis, the chance of surviving this operation was less than ten percent. And the chance of it failing was ninety percent.</p><br/><p>Lin Fan looked at the little girl. Then, he looked at that chief surgeon who was going to change and he followed behind him.</p><br/><p>The chief surgeon for this operation was a veteran with twenty years of experience but at that moment, he was very nervous. He couldn't calm down. Although the family had given their signatures to take responsibility for this, this wasn't about whether it would affect him personally. He really wanted to save that cute little girl.</p><br/><p>In the changing room.</p><br/><p>The chief surgeon was changing his clothes when suddenly, he heard the sound of the door opening. He said, \"I'll be done soon. Get the pre-surgery preparations done and make sure there are no issues.\"</p><br/><p>There was no reply.</p><br/><p>The chief surgeon got suspicious. Just as he turned his head around, his vision turned dark and he fainted.</p><br/><p>\"I'm sorry. You'll have to take a little pain.\" Lin Fan lay the chief surgeon down. Then, without saying anything else, he stripped the chief surgeon of his clothes. He saw that there were ropes at the entrance. He was afraid that the chief surgeon might wake up too early so he tied him up.</p><br/><p>The chief surgeon was left with a set of underpants. He was tied up in quite a shameful way and Lin Fan didn't dare to look straight at him.</p><br/><p>After everything had been prepared, Lin Fan put on the big white mask and headed outside. At the same time, he locked the door just in case.</p><br/><p>Such a complicated and difficult operation naturally had to be done by him.</p><br/><p>As long as he completed it, he could move on to a different location.</p><br/><p>...</p><br/>\n</div>"}