{"title": "Chapter 366: The commemoration day", "id": 366, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-366-the-commemoration-day", "volume_title": "Volume 4", "body": "<h1>Chapter 366: The commemoration day</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 366: The commemoration day</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Cloud Street!</p><br/><p>\"Little Boss is back…\"</p><br/><p>\"The Little Boss that disappeared for so long is finally back!\"</p><br/><p>The shop owners and the townsfolk were extremely emotional as they had been waiting for a long time. They had been dreaming of the magical taste of the scallion pancakes ever since Little Boss had disappeared.</p><br/><p>\"Woof, woof!\" Elder Dog Nicholas charged over and wagged his tail. He started going around Lin Fan's legs.</p><br/><p>He was feeling pretty low. He had hustled for so long but the task hadn't been completed. Then, he decided to take it slow. He was already extremely powerful after unlocking a major classification of knowledge. It already made him one of the most powerful human beings on earth. Furthermore, he could live a carefree and happy life. There was no need to overthink things.</p><br/><p>\"Hi guys, it's been long.\" Lin Fan waved at everyone and smiled. He kind of missed them after not seeing them for so long.</p><br/><p>One of the shop owners, Elder Zhang, said, \"Little Boss, do you remember what occasion is coming up?\"</p><br/><p>Lin Fan smiled. \"How could I forget? The 20th of each month is a special day for Cloud Street. Let's prepare ourselves.\"</p><br/><p>\"Haha, we've been looking forward to this day.\" Elder Zhang smiled. Everyone was the same, they also had been looking forward to this day. They could do something meaningful and also taste Little Boss's delicacies. It was like killing two birds with one stone.</p><br/><p>Wu You Lan came out of the shop and looked at Lin Fan with a mellow look. She had missed him after not seeing him in so long.</p><br/><p>\"Woo!\"</p><br/><p>Suddenly, the surrounding shop owners made some weird noises as Wu You Lan hugged Lin Fan. \"Brother Lin, we've missed you.\"</p><br/><p>\"You must be wanting to take advantage of me.\" Lin Fan smiled. \"Actually, I've missed all of you too.\"</p><br/><p>Fraud Tian looked at Lin Fan with a suspicious look. \"We need to have a talk later.\"</p><br/><p>They hadn't known what Lin Fan had gone out for but when they saw the news online, they realized that he had gone to treat patients. Since when did this fella possess medical skills? He even caused an uproar in the society.</p><br/><p>A godly doctor!</p><br/><p>Countless people online were looking for the godly doctor but nobody knew who he was.</p><br/><p>Wu You Lan let go of Lin Fan and smiled. \"Do you know that we've been reading news about you online?\"</p><br/><p>\"Shh, don't say it too loudly. I have to stay low-profile,\" Lin Fan said softly. He felt that this matter was a little complicated and he didn't know how to resolve it if people were to find out about this.</p><br/><p>Wu You Lan nodded. \"Don't worry, we won't tell anyone. But are they true?\"</p><br/><p>Lin Fan smiled mysteriously. \"What do you think?\"</p><br/><p>…</p><br/><p>Zhao Zhong Yang rushed out. \"Everyone, Master Lin is back. You can see his glory in the future again!\"</p><br/><p>Lin Fan waved his hand at the camera with a smile. Although he had wasted his efforts this time, he had gone to five cities to save people and that felt great, especially when he had managed to save those that had been deemed incurable. That feeling couldn't be described by words. It had to be personally experienced.</p><br/><p>In the shop.</p><br/><p>Fraud Tian gasped, \"You're made it big this time. I read the online news and there are a lot of people that are looking for you. If they realize that it's you, I'm afraid this shop will be packed to the brim.\"</p><br/><p>Lin Fan looked at Zhao Zhong Yang. Zhao Zhong Yang nodded. \"The broadcast has been turned off.\"</p><br/><p>\"I won't talk about it now. I don't know what to say. Let's just hide this and not tell anyone,\" Lin Fan said.</p><br/><p>Fraud Tian replied, \"Actually, if we become a clinic, it wouldn't be bad either. Furthermore, I'm not too confident in our hospitals right now.\"</p><br/><p>Lin Fan smiled. \"Why? Did you get harmed there?\"</p><br/><p>Fraud Tian nodded. \"Of course. I went to the hospital when I had slight flu and they wanted to test my blood. They even did some other tests on me. If not for my resilience and vitality, I'd have spent all my money there.\"</p><br/><p>Lin Fan smiled. \"It's all for your own good. It's good to do a check-up once in a while. Alright, I won't speak nonsense anymore. It's getting a little difficult.\"</p><br/><p>\"After settling the stuff here, I'll be going to get a medical certificate. Without it, I can't see patients openly,\" Lin Fan said.</p><br/><p>Fraud Tian smiled. \"There's no hurry. It's already the 20th tomorrow. I've prepared the stuff and the people at the supermarket know that we are going to the children's welfare organization, so they charged us lower prices for these.\"</p><br/><p>Lin Fan nodded. \"Alright, let's go tomorrow. I'll contact the people in charge too.\"</p><br/><p>In the WeChat group.</p><br/><p>Lin Fan posted: \"It's the 20th tomorrow and we will be going to the Nanshan Children's Welfare Institute. Those that lost the bet, please don't forget about it.\"</p><br/><p>A few seconds later, some people replied in the group.</p><br/><p>He Cheng Han: \"Master, don't worry. I've prepared for it a long time ago. There are two thousand toys and a thousand of them are specially handcrafted. They're beautiful.\"</p><br/><p>Jin Yun Ming: \"I've also prepared my gifts. A thousand children's outfits.\"</p><br/><p>\"A hundred laptops have been prepared.\"</p><br/><p>\"A hundred smart learning devices have been prepared.\"</p><br/><p>Zhu Zhu: \"Your gifts are all so expensive. I just bought a lot of tidbits.\"</p><br/><p>Li Hao: \"I prepared a thousand bookshelves. I've already ordered them and they'll be delivered tomorrow.\"</p><br/><p>Lin Fan was stunned. \"D*mn, you guys have been preparing for it!\"</p><br/><p>He Cheng Han: \"Haha, how could we forget? We've remembered it.\"</p><br/><p>\"Thank you, thank you.\" Lin Fan smiled. It was a great feeling. There was power in unity because if they had depended on only one person, they wouldn't have managed this.</p><br/><p>Lin Fan: \"Alright, see you guys tomorrow.\"</p><br/><p>*Ding ding!*</p><br/><p>Then, Wang Ming Yang called.</p><br/><p>Wang Ming Yang said, \"The paperwork has been done. All that's left is for you to sign it.\"</p><br/><p>Lin Fan was shocked. \"So fast?\"</p><br/><p>Wang Ming Yang replied, \"Haha, look at who's processing it. How could it be slow?\"</p><br/><p>Lin Fan nodded. \"Alright, see you there tomorrow and I'll sign it. Thank you so much.\"</p><br/><p>Wang Ming Yang replied, \"You're being too polite. I'm a little unhappy. Why did you thank me? I have to do one or two meaningful deeds in my lifetime.\"</p><br/><p>\"Haha…\"</p><br/><p>Then, they chatted for a while and hung up.</p><br/><p>The next day!</p><br/><p>Cloud Street was extremely crowded and lively. The shops were all closed and there was a huge van at the street entrance. There were some private cars behind it.</p><br/><p>The surrounding townsfolk were stunned when they saw this. They didn't know what was happening.</p><br/>\n</div>"}