{"title": "Chapter 367: A Slight Annoyance", "id": 367, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-367-a-slight-annoyance", "volume_title": "Volume 4", "body": "<h1>Chapter 367: A Slight Annoyance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 367: A Slight Annoyance</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Little Boss, are you selling scallion pancakes today?\"</p><br/><p>\"Why is everyone closed today? Did something happen?\"</p><br/><p>\"What is going on? Aren't they a bit domineering having so many cars here? Could it be that they are having some sort of driving tour?\"</p><br/><p>The surrounding residents were all in deep discussion, having no idea what was going on.</p><br/><p>Lin Fan laughed and said, \"Everyone, I forgot to tell you, on the 20th of each month, the people of Cloud Street will volunteer at the Children's Welfare Institute. On this day, we will all close our shops, I hope you all understand.</p><br/><p>A resident replied, \"So that's how it is. We can definitely understand, this is a very meaningful act.\"</p><br/><p>\"I never knew that the Little Boss was so caring, I want to join in too.\"</p><br/><p>\"Little Boss, we all wish to join in. Are there any requirements?\"</p><br/><p>Lin Fan laughed and replied, \"There are definitely no requirements. It's volunteer work, so whenever you feel like helping, you can go and help. Also, it does not have to be a one-time thing, if anyone wants to come again next time, you can register with us over here.\"</p><br/><p>\"Master Lin…\" At this moment, the reporter, Chu Yuan, appeared in the distance. He was smiling as he said, \"Master Lin, I've come here early because I knew beforehand about the significance of the 20th to the people of Cloud Street.\"</p><br/><p>Lin Fan had not expected that Chu Yuan would come again. \"The big reporter Chu is here to help as well?\"</p><br/><p>Chu Yuan laughed and replied, \"It's only natural that I would. I'm not only here to help out, I'm also here to take pictures. I've managed to fight for a page on the papers for you guys. This act of goodwill must definitely be announced to everyone.\"</p><br/><p>Lin Fan gave Chu Yuan a pat on the shoulder and said, \"Good, I really appreciate it. Come, let's get in the cars and go there early. There are a lot of things to be done today.\"</p><br/><p>\"No problem,\" Chu Yuan replied as he carried his video camera and boarded the car. Although Chu Yuan was just a reporter, he was also a man with a high moral standard. To many reporters, this act of charity was a small scale event. But to Chu Yuan, it was this kind of news that deserved to be broadcasted.</p><br/><p>At the entrance to Nanshan Children's Welfare Institute, Director Huang and a few of his employees were waiting at the door.</p><br/><p>Director Huang said, \"Inspector Liu, I really don't know how to thank you all.\"</p><br/><p>Liu Xiao Tian waved him off and replied, \"You're welcome, Director Huang. However, you don't need to thank me for this, you should be thanking Master Lin. He is a kind-hearted man. Nowadays, there are a lot of Children's Welfare Institutes. Some of them are just out there to scam the government's money and the money of kind-hearted people. Recently, there were two of them that were exposed and sparked a huge controversy, but also caused a huge backlash to those legit organizations.\"</p><br/><p>Director Huang nodded. She was aware of the whole situation. There were a lot of children welfare institutes around and it was super hard to get funding from the government. To many of these institutes, feeding the children 3 meals a day and satisfying their nutritional needs was very tough.</p><br/><p>Inspector Liu looked in the other direction and said, \"who are those people?\"</p><br/><p>Director Huang laughed and replied, \"Those are some hot and rising celebrities. Looks like they've come to the Children's Welfare Institute to express their sympathy but they have been standing there in discussion for a while and have not come in yet.\"</p><br/><p>Liu Xiao Tian's eyebrows furrowed and he said, \"Are they just here for show?\"</p><br/><p>Director Huang replied with an embarrassed laughter and said, \"That could be one of the reasons. Regardless, it is still a good thing. As long as the kids can gain something, it's already pretty good. There isn't really anything wrong with them showing off a little.\"</p><br/><p>At that moment, the celebrities came in with some of the workers.</p><br/><p>At that time, the sun was blistering hot. A few of the male and female celebrities were wearing sunglasses and their staff members were holding umbrellas for them. Then, one of the staff members came over and said, \"Director Huang, we brought some gifts along for the children, however, we need the children to cooperate with us for a bit.\"</p><br/><p>Director Huang replied, \"May I ask what you need them to cooperate with?\"</p><br/><p>The staff member laughed and replied, \"It's very simple. I need the children to hold out the banner that we gave and cheer. Then, get them to pose with our celebrities so we can take a few pictures.\"</p><br/><p>The male actor, Jin Yang, who had just acted in some Han dynasty show, impatiently said, \"Hurry up, the weather is so hot, my skin is going to turn black.\"</p><br/><p>The young lady next to him, who barely looked 20, was also being very self-centered and said, \"This Director Huang is troublesome. Our time is precious and yet she is still having other activities behind. We brought so many gifts for them today, can't she just be more flexible and just cooperate with us for awhile?\"</p><br/><p>Director Huang frowned and felt a bit displeased.</p><br/><p>At this moment, a muscular looking man appeared and said, \"All you celebrities, will it kill you guys to not try to promote yourselves for once? This is a Children's Welfare Institute and all of you all are acting like this just to create an image that you guys are kind. It's disgusting.\"</p><br/><p>With this sentence, all the celebrities were infuriated.</p><br/><p>\"Who are you? What gives you the right to say that to us?\"</p><br/><p>\"You think we're here to promote ourselves? What a joke. We are here to spread our kindness. Also, we are superstars. We just need to spread the word and this Children's Welfare Institute will become famous and more people will be drawn here.\"</p><br/><p>Director Huang pulled the man aside and said, \"Han Lu, don't argue with them.\"</p><br/><p>Han Lu looked at them and said, \"I just can't stand this kind of people. On the outside, they say that they are just here to spread joy but they are just here for self-promotion. They even brought a banner here to have the kids thank them. Do you guys even know their names? Have you guys even interacted with these children? These children are already in a very pitiful state and now they are abused by you disgusting people for self-promotion.\"</p><br/><p>Inspector Liu was standing at the side, feeling very annoyed. He said, \"What are you guys doing? All of you celebrities should just leave, you are all not welcome here.\"</p><br/><p>Looking across, Jin Yang, who was applying makeup, laughed and said, \"You welfare institute people have such bad attitudes. All you all need to do is help us out a little and you can gain our goods. Where else can you find such a good deal? We've been to so many other Children Welfare Institutes and we've never met anyone like you all.\"</p><br/><p>\"F*ck you, are you all looking for a fight?\" Han Lu exploded in anger and he cracked his knuckles. He had been working in the Children's Welfare Institute for almost a month and when he had first started out, someone had told him that Master Lin came often and liked kind people. He had thought that if he was able to do good things here and Master Lin saw it, he would definitely accept take him as his disciple.</p><br/><p>However, in the month that he had been volunteering there, after eating and living with the children, his mindset had gradually changed. He used all the money he had earned from the MMA to buy things for the children and he loved hanging out with them.</p><br/><p>Director Huang grabbed onto Han Lu and said, \"Calm down, don't do anything rash.\"</p><br/><p>She felt that Han Lu was a good man, had a good heart, got along with the children well and he was strong. During times in the Children's Welfare Institute when there were things she could not do, Han Lu could do it. He was also able to keep the Children's Welfare Institute safe as robbers would be too scared to come in. Han Lu would chase them away.</p><br/><p>At this moment, a huge cluster of cars arrived.</p><br/><p>A big truck stopped in front of the Children's Welfare Institute and a small car followed behind.</p><br/><p>Lin Fan smiled as he got off the vehicle and said, \"Inspector Liu, you're here too.\"</p><br/><p>Liu Xiao Tian looked at Lin Fan and smiled. \"I knew you were coming today, so I came down early to wait for you.\"</p><br/><p>When Han Lu saw Lin Fan, his face lit up with a smile. He had completely forgotten about his anger from before.</p><br/><p>When Director Huang saw Master Lin, she also let out a smile.</p><br/><p>Lin Fan looked to the other side and said, \"Hey, what are they doing?\"</p><br/><p>Liu Xiao Tian was about to open his mouth when Han Lu beat him to it and said, \"Master Lin, they are here as an act only. They said they are here to give gifts to the Children's Welfare Institute but they are really just here to use the children for self-promotion.\"</p><br/><p>When Lin Fan looked at Han Lu, his heart groaned a little, wondering why this man was here. However, the situation looked like it was upsetting a lot of people.</p><br/>\n</div>"}