{"title": "Chapter 379: Isn’t this trolling?", "id": 379, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-379-isn%E2%80%99t-this-trolling", "volume_title": "Volume 4", "body": "<h1>Chapter 379: Isn’t this trolling?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 379: Isn’t this trolling?</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The managers thought deep and hard, weighing Master Lin's request against their interests.</p><br/><p>\"Master Lin, although your request isn't that over the board, can I ask how many songs you can give us?\" one of the managers from Ming Guang Records asked Lin Fan politely.</p><br/><p>Lin Fan glanced at him, replying, \"How many?\"</p><br/><p>Zhang Xue Ming looked at Lin Fan. \"Master Lin, we all understand your thought process. You're thinking of using your songs to expose this newbie to more concerts to increase her viewers. Our stars are very popular, and every single concert that they hold is either sold out or at worst, eighty percent sold.\"</p><br/><p>Lin Fan didn't feel like discussing this anymore. He waved them away. \"I don't see what the problem is here. I just have one request. I'll write a song in ten minutes if you accede to my request. If you agree, please stay. If you don't, the door is over there.\"</p><br/><p>Zhang Xue Ming furrowed his brows. \"Master Lin. We can buy your songs for at least tens of thousands each. Furthermore, you'll be credited as the writer of the songs.\"</p><br/><p>Lin Fan shook his head. \"I can write plenty of good songs right now. All I have is just one condition. I'm not here to beg you guys, and you guys are here to get good songs. If you guys are just here to bargain with money, my condition obviously hasn't been heard by you guys.\"</p><br/><p>\"Master Lin, our record label agrees to the condition that you have set. One song for ten minutes of stage time for her,\" a fat person who worked for the record label said.</p><br/><p>\"Alright, good.\" Lin Fan grinned.</p><br/><p>Zhang Xue Ming looked at Lin Fan before finally nodding his head. \"Fine, I'll agree with it too.\"</p><br/><p>The people who had the ability to hold concerts this year were few amongst all the people who were present. In the music industry, good songs were hard to come by, unlike the old days where the composers had paid no attention to outside matters and just devoted themselves to writing songs. Now, there were very few good composers and whenever there was a rumor about a good composer writing a song, that song would be snatched up right away.</p><br/><p>As for reserving songs with the composers, that was very hard as well. Even if one were to make an agreement with a composer beforehand, that agreement might be broken halfway. It was really hard to come by good songs in the music industry now, especially the ones with meaningful lyrics.</p><br/><p>\"Don't worry. I'll write songs for you guys, and they'll definitely be good ones. You can trust me.\"</p><br/><p>The people around nodded their heads. \"Master Lin, we hope that we can have a blissful partnership. When you write a good song next time, we hope that you'll remember us and we'll give you a good and satisfactory price for it.\"</p><br/><p>\"Good talk, good talk,\" Lin Fan laughed, saying, \"I have plenty of good songs swimming in my head right now, but I'm saving them for her.\"</p><br/><p>Wu Huan Yue stood at one corner silently. She was moved to tears. She had never thought that she was regarded so highly by Brother Lin.</p><br/><p>Wu You Lan stood next to Wu Huan Yue, her eyes giving a completely different expression.</p><br/><p>Envy, jealousy, and anger.</p><br/><p>The rest of the deal and procedures were settled by Wang Ming Yang, and the contracts were also handled by him as well.</p><br/><p>Wu Huan Yue was all fired up after knowing about the condition that Lin Fan had set for the people wanting his songs.</p><br/><p>The singers who were able to hold concerts were usually popular. It would be good for Wu Huan Yue to open the concert for them as the opening act. To Lin Fan, all the songs that he was writing were worthless to him, but the Encyclopedia was brimming with loads of good songs, so much so that it was almost too scary.</p><br/><p>\"Brother Lin, I can't thank you enough!\" Wu Huan Yue said to Lin Fan as she teared emotionally.</p><br/><p>Lin Fan casually waved her away. \"Don't thank me now. If you don't accomplish what you set out to do, won't this all go to waste?\"</p><br/><p>Lin Fan had mentioned before that Wu Huan Yue would become popular if she went down the singing route. Thinking about it now, it hadn't been in her fate. With Lin Fan's help, it had gradually changed. Lin Fan was the greatest cause of this.</p><br/><p>Looking at this situation, even he became a little scared.</p><br/><p>\"I won't say anymore.\" Wang Ming Yang patted Lin Fan on the shoulders.</p><br/><p>Lin Fan laughed. \"Alright, I can't keep asking you to help me. Sometimes, I've got to put in some effort as well.\"</p><br/><p>\"Haha…\" Wang Ming Yang chuckled. \"Since when have I helped you out that much? But for real, I've been thinking, what else can you do? When you said that you could write songs, I was stunned. You just look like an ordinary guy, and it never occurred to me that you were a lyrical genius.\"</p><br/><p>Lin Fan was on cloud nine after Wang Ming Yang said that to him, but he remained calm. \"What else can I do? I can do a lot more things than you can imagine, like treating patients. I'm getting ready to get myself a medical certificate tomorrow.\"</p><br/><p>\"No way. Even treating sickness? If you become a certified doctor, I think that you'll probably make people fall sick instead,\" Wang Ming Yang said, awestruck.</p><br/><p>\"Haha, if you don't believe me, don't ask me to treat you next time,\" Lin Fan laughed as he said.</p><br/><p>The scene was jubilant with the long-awaited reunion. Wang Ming Yang and Lin Fan were happily talking while Wu You Lan and Wu Huan Yue were talking amongst themselves. It was a beautiful scene.</p><br/><p>However, whatever the women were speaking to each other about had hidden meanings behind them.</p><br/><p>…</p><br/><p>The next day.</p><br/><p>Ministry of Health.</p><br/><p>Lin Fan stood there in a daze before approaching the counter staff. \"Lady, please don't discriminate here. I have real ability and knowledge, so what if I only graduated from junior college?\"</p><br/><p>The counter staff looked at him, feeling helpless. This guy had been there for over twenty minutes. If not for the fact that he was a tad bit handsome, she would have already called for security. \"Handsome, this isn't an issue of you having the knowledge and ability. It's just that your junior college school certificate isn't a medical degree. If you want to be recognized as a Chinese medicine practitioner, you have to graduate from a nationally recognized school to get your license to practice.\"</p><br/><p>\"Then what else can I do? I can't take the test?\" Lin Fan was feeling a little helpless.</p><br/><p>The counter staff shook her head. \"Nope. The registration is in April, and the test is held in July. It is already past the examination date. On both counts, you don't meet the requirements.\"</p><br/><p>Lin Fan was in a daze again. This wasn't rocket science. If he didn't have the license to practice medicine, it would be impossible to complete the task from the tenth page of the Encyclopedia. If he didn't have a license to practice and still saw patients and got caught for it, he would be in deep trouble and wouldn't even stand a chance against the court of law.</p><br/><p>The counter staff realized that Lin Fan was dead serious and stubborn, so she resorted to her last option. \"Actually, there is one more way around this. You can find yourself a nationally recognized Chinese medicine practitioner and ask to be taken as a disciple. You can participate in the examinations after that. That is your only option. Other than that, I can't really be of any help to you.\"</p><br/><p>Lin Fan couldn't believe it. Become a disciple? D*mn! I, Lin Fan, would never do that! What would be the point of the Encyclopedia if I have to do that?</p><br/><p>Just at that moment, an old man walked past.</p><br/><p>The counter staff looked at the old man, immediately breaking out with a greeting, \"Director Zhao.\"</p><br/><p>The old man nodded and smiled at her before making his way.</p><br/><p>Lin Fan looked at the old man before looking back at the counter staff. \"Is that man over there someone incredible?\"</p><br/><p>The counter staff nodded. \"That's for sure! That man is Director Zhao, the head of the finest Chinese medicine institution in Shanghai. You…\"</p><br/><p>Just as the counter staff had been about to say something, she realized that the young man had already disappeared from her sight.</p><br/>\n</div>"}