{"title": "Chapter 384: There's thunder! Thunder!", "id": 384, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-384-theres-thunder-thunder", "volume_title": "Volume 4", "body": "<h1>Chapter 384: There's thunder! Thunder!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 384: There's thunder! Thunder!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>'Xiao Wang' was an affectionate term that only Zhao Ming Qing used. Everyone else referred to him as 'President Wang'. This was because Xiao Wang was Zhao Ming Qing's student, and he had the position only because of Zhao Ming Qing's connections despite being so young. If it weren't for Zhao Ming Qing's, he wouldn't be where he was today.</p><br/><p>With the president around, the certificate wouldn't have been a problem at all. After calling up the relevant departments, the certificate finally reached Lin Fan's hands. Although it was just a piece of paper, it meant alot more to Lin Fan.</p><br/><p>Sighs of relief.</p><br/><p>Lin Fan arranged the papers neatly and got ready to leave the place.</p><br/><p>Xiao Wang wanted to ask Zhao Ming Qing a few questions but realized that Zhao Ming Qing had already gotten ready to leave the place with Lin Fan. Till now, he still didn't know what was going on and who the young lad was, and why Elder Zhao would call him Teacher.</p><br/><p>Forget it. This was Elder Zhao's business. I would just come off as annoying if I probe too much into this.</p><br/><p>Outside the Ministry of Health.</p><br/><p>\"Teacher, are you satisfied with this?\" Zhao Ming Qing asked, his face full of glee.</p><br/><p>Lin Fan nodded. \"Indeed, I am. I am impressed with the efficiency of the Ministry of Health.\"</p><br/><p>\"When do I formally become your disciple? This needs a huge ceremony!\" Zhao Ming Qing said excitedly.</p><br/><p>Lin Fan nodded. \"Yep, that's for sure. Becoming someone's disciple is a grand occasion.\"</p><br/><p>Zhao Ming Qing was on cloud nine. He finally found someone to teach him the true art of Traditional Chinese Medicine, and he promised himself that he would work harder than ever to complete learn from Master Lin.</p><br/><p>\"Teacher, when will my discipleship start?\"</p><br/><p>Now that the certificate was completed, he felt more comfortable. As far as the discipleship was concerned, he still had to wait, to find the right time to bring it up, otherwise, all of these would go to waste.</p><br/><p>\"This issue isn't urgent, let me think for awhile,\" Lin Fan waved him away, saying.</p><br/><p>Zhao Ming Qing was getting a little worried. \"Teacher, didn't you say just now that you'll accept me as your disciple once I've settled your certificate?\"</p><br/><p>Lin Fan paused for a moment, before looking at Zhao Ming Qing. \"Who said that? I said just now that I would consider. Furthermore, you dare to contradict me even when you haven't become my disciple yet. Imagine what will happen next time when you learn even more things from me!\"</p><br/><p>Zhao Ming Qing immediately put his hands together. \"Teacher, I did not. Can I know when will you consider?\"</p><br/><p>Lin Fan gestured towards the sky, causing Zhao Ming Qing to look at him in confusion. \"Teacher, what is the meaning of that?\"</p><br/><p>\"Look at the sky,\" Lin Fan said calmly.</p><br/><p>\"Teacher, what is the meaning of that?\" Zhao Ming Qing asked, confuddled.</p><br/><p>Lin Fan tilted his head skyward. \"If it is today, let there be thunder, signifying that it is the Heaven's will for you to be my disciple. If there is no lightning, then we'll have to wait for the next time. Let me consider in the meantime.\"</p><br/><p>Zhao Ming Qing tilted his head and looked at the sky, which was clear, azure blue, the sun hanging at the center of the sky. There wasn't a single dark cloud.</p><br/><p>Mu Lao looked upwards as well. \"The sky looks so clear. It doesn't look like there is going to be any lightning.\"</p><br/><p>Lin Fan chuckled to himself. If there were an actual lightning bolt, it was as good as seeing a ghost. Don't you get it? This is my attempt at subtly letting you down.</p><br/><p>The opportunity to become my disciple is over and gone. My own talent is superior! Do you think just anybody can be my disciple?</p><br/><p>Suddenly!</p><br/><p>Rumbling sounds!</p><br/><p>Lin Fan was originally immensely proud of himself, but in that instant, he looked up, seeing a flash of lightning race across the sky.</p><br/><p>\"This...this...\"</p><br/><p>Zhao Ming Qing was completely overjoyed. \"Teacher, there is thunder! Thunder!\"</p><br/><p>\"F*ck!\" Lin Fan was seething with rage. How was this even possible? But Lin Fan kept his cool, replying, \"I know there is thunder.\"</p><br/><p>\"Teacher, does this mean I get to be your disciple now?\" Zhao Ming Qing asked, his face looking at him expectantly. In all his years, this was the fourth time he got this excited.</p><br/><p>Lin Fan stood there and continued to observe the sky, unable to believe what just happened. This phenomenon also attracted the attention of a few other onlookers.</p><br/><p>A promise was a promise, and he could not go back on it.</p><br/><p>\"Yes, you... You may be my disciple,\" Lin Fan stuttered.</p><br/><p>Zhao Ming Qing was elated beyond belief and was at a loss for words. \"Teacher, don't you worry. This is a grand event and I'll let the whole Traditional Chinese Medicine community know that you have become my master and I'll invite everyone that I know to my ceremony. However, I do know alot of people, so if you find this too much a hassle, we can figure out something a little simpler.\"</p><br/><p>Lin Fan looked at Zhao Ming Qing, still in a daze. \"What do you mean by simpler? Now that you're my disciple, everything must be done in broad daylight and everything must be grand. As long as your friend is in the same line of work, you have to invite them.\"</p><br/><p>Zhao Ming Qing nodded his head. \"Alright, alright. Teacher, you don't have to worry about that.\"</p><br/><p>Lin Fan still couldn't get over the fact that there was thunder on such a clear day. \"Alright, I'll go back first. Once you've made the arrangements, look for me on Cloud Street.\"</p><br/><p>Lin Fan got into his car and drove off.</p><br/><p>In the car, Lin Fan whipped out his phone. He frowned as he read the notifications page.</p><br/><p>\"Warning of imminent showers with thunderstorms today...\"</p><br/><p>Rain started to fall!</p><br/><p>Not long after, it started to rain cats and dogs.</p><br/><p>\"F*ck, how could I not have seen this coming? This is my unlucky day!\" Lin Fan shook his head helplessly. But at least, Lin Fan didn't have any problems taking Zhao Ming Qing as his disciple Teaching someone without any basic foundational knowledge would just be a pain in the ass, but teaching an old Traditional Chinese Medicine practitioner with a very solid foundational knowledge would be much more efficient and may even benefit society. It wasn't too bad an option.</p><br/><p>Since I've agreed already, I'll just let it be.</p><br/><p>As far as I am concerned, I don't like students who were all action without any character, and Zhao Ming Qing was not one of them.</p><br/><p>I have to let everyone know that I am the most awesome and legendary Master Lin!</p><br/><p>As long as people had the impression that you were awesome and legendary, it wouldn't matter if you did something stupid.</p><br/><p>Back in the Ministry of Health.</p><br/><p>Zhao Ming Qing Lao Mu were taking shelter from the rain. \"Being someone's disciple really isn't an easy task.\"</p><br/><p>Mu Lao looked at Zhao Ming Qing concerned. \"Elder Zhao, you're already so old, and your Master is so young. If you let everyone know that he was your Master, wouldn't it be bad for you?\"</p><br/><p>\"What's bad about that? Although Teacher is young, his skills and knowledge far surpass mine. Discipleship does not depend on age. If I chose not to do this just because of age, it would be a great loss to me.\"</p><br/><p>\"What about your family? I don't think they will agree with it, especially your sons and daughters,\" Mu Lao said.</p><br/><p>\"Who cares if they agree or disagree with my decision. They can't stop me, and if they do, I'll break their legs,\" Zhao Ming Qing said, his voice raised a little.</p><br/><p>Mu Lao shook his head and laughed. \"Alright. Such an expert at such a young age, it really isn't easy. If I didn't see it with my own eyes, I wouldn't have believed it. Say, do you think the mysterious doctor from the Internet who everyone was going crazy about, could it be him...\"</p><br/><p>Zhao Ming Qing smiled at Mu Lao. \"I'm not so sure. Anyway, I've got to go back and start to prepare for the ceremony, as well as invite all my friends and colleagues.\"</p><br/><p>Mu Lao couldn't imagine what reactions and things would happen on the day itself...</p><br/>\n</div>"}