{"title": "Chapter 399: As long as everyone's happy", "id": 399, "volume": 4, "url": "http://boxnovel.org/a-valiant-life-chapter-399-as-long-as-everyones-happy", "volume_title": "Volume 4", "body": "<h1>Chapter 399: As long as everyone's happy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 399: As long as everyone's happy</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>\"Brother Tao, what's wrong?\" Yue Qiu Ju Shi saw that Tao Shi Gang was stunned. He didn't know what had happened. Then, he turned to the broadcast.</p><br/><p>He only saw a marvelous piece of artwork on the computer screen.</p><br/><p>It wasn't a normal scenic artwork. It had all three themes altogether. There were humans, scenery, flora, and fauna. They were beautifully combined together.</p><br/><p>It was a powerful and magnificent drawing. One look at it and you'd know that it was a special one.</p><br/><p>Lin Fan packed up and placed his pen aside. \"How is it? I think I've completed the artwork for Nanshan Children's Welfare Institute. Everyone, please have a look. It's okay, right?\"</p><br/><p>Zhao Zhong Yang looked at it in disbelief. Although he didn't understand art, he wasn't a blind man. He could at least tell if a drawing was well done or not. Then, he looked at Lin Fan in shock. \"Brother Lin, are you kidding me?\"</p><br/><p>He was utterly shocked. He had been with Lin Fan for quite some time now. He had always been broadcasting at Cloud Street happily every day. At the same time, he had been seriously impressed by the talents of Brother Lin. Now, he was even more shocked that Lin Fan had personally drawn a Chinese traditional artwork. It was something he saw with his own eyes. Furthermore, the drawing was exceptional. It was obvious that it had been drawn by a great master. Although he didn't know much, he had seen a few artists' works before. This drawing could even match up with those pieces of art.</p><br/><p>The crowd in the broadcasting room was speechless. After a while, a commotion started.</p><br/><p>\"D*mn, d*mn…d*mn… The world has gone mad.\"</p><br/><p>\"What am I looking at? Tell me, what is going on?\"</p><br/><p>\"I can't believe it. We were just discussing amongst ourselves and suddenly this came out?\"</p><br/><p>\"Master Lin is too awesome. I think this drawing is magnificent.\"</p><br/><p>\"Although I don't know much about art, this artwork is stunning. It's too good.\"</p><br/><p>\"Master Tao, are you here? Please say something.\"</p><br/><p>\"Yeah, I think it's exceptional but Master Tao is a professional. It should be better for him to judge this piece of art.\"</p><br/><p>...</p><br/><p>The crowd in the broadcasting room were in disbelief. This had been drawn by Master Lin himself and they had personally seen him draw it stroke by stroke.</p><br/><p>Suddenly, there was a frenzy of donations in the broadcast.</p><br/><p>The old man that loves drawing: \"Rockets x50. I'm deeply moved by this artwork. I didn't know that Master Lin was so talented in drawing. I even wanted to teach him about it. I was so wrong.\"</p><br/><p>Along with the donation, his words had shocked the entire crowd in the broadcast room. Lin Fan had received a master's compliment. Even the master was in disbelief. Everyone felt that it was crazy.</p><br/><p>In their study room.</p><br/><p>Yue Qiu Ju Shi looked at the computer closely. He was in disbelief. \"It's unbelievable. Seriously unbelievable. This drawing is exceptional. There are three different themes. He drew it based on his feelings and the pen was just a tool to express his emotions. The entire drawing is clear and precise. If I could see the actual artwork, it'd be incredible.\"</p><br/><p>Tao Shi Gang looked at the magnificent artwork and couldn't take his eyes off it. He was stunned speechless by this piece of art. It might even be the best Chinese artwork he had ever seen.</p><br/><p>He hadn't expected a young chap like him to be able to draw such a marvelous artwork. It was stunning.</p><br/><p>\"Brother Tao, do you know where this artist is at?\" Yue Qiu Ju Shi asked.</p><br/><p>Tao Shi Gang nodded. \"Cloud Street in Shanghai. He's Master Lin. You want to look for him?\"</p><br/><p>Yue Qiu Ju Shi laughed. \"Yeah, I'm in luck today to have met a master like him. I'm prepared to go to Shanghai tomorrow to meet him. If it's possible, I'd like to have that artwork to be placed in my art exhibition. I believe it will bring good reviews.\"</p><br/><p>\"I'll go with you,\" Tao Shi Gang said. He was extremely curious, especially after this had happened, he didn't even feel like drawing anymore. All he could think of was Lin Fan's drawing.</p><br/><p>He had met a great master in the same trade as him and obviously, he would want to meet him to learn about art.</p><br/><p>…</p><br/><p>Nanshan Children's Welfare Institute.</p><br/><p>\"Han Lu, bring the drawing here and show it to the kids.\" Lin Fan chuckled.</p><br/><p>Han Lu, who was standing behind, was also dumbfounded. He realized that what had happened was extremely shocking. At the same time, he respected Master Lin even more and felt that he was too awesome.</p><br/><p>\"Why are you standing there? Quickly come over,\" Lin Fan said.</p><br/><p>Han Lu recovered from his daze. \"Coming!\"</p><br/><p>The artwork was shown on screen and the kids gasped when they saw it.</p><br/><p>\"Look, that's a huge tiger.\"</p><br/><p>\"That's an eagle.\"</p><br/><p>\"That's a gigantic mountain…\"</p><br/><p>There were a lot of things in a single artwork and it looked beautiful.</p><br/><p>\"Teacher, can I touch the tiger?\" Lil' Fatty came over and asked nervously.</p><br/><p>The people in the broadcast room gasped.</p><br/><p>\"How can he touch it? The ink isn't dry yet.\"</p><br/><p>\"Yeah, this drawing is exceptional. If it's ruined by him, it'd be a great loss.\"</p><br/><p>Tao Shi Gang also felt the same way. He held the piece of art in high regard. How could anyone casually touch it? If it were to create an imperfection, the whole drawing would be ruined.</p><br/><p>Some of the nation's greatest artists sold their artworks for huge sums of money. It wasn't exactly because their artworks were magnificent. It was because they were reputable and held high statuses. Therefore, their artworks were valuable. Furthermore, many of them were copies.</p><br/><p>However, these drawings weren't worth collecting because they weren't perfect. On the other hand, Lin Fan's artwork was extremely beautiful. It was one of the best and it was powerful and meaningful. It had a special aura about it.</p><br/><p>\"Alright.\" Lin Fan chuckled. He wasn't even bothered by it. It was just a drawing and he thought that they could just touch it.</p><br/><p>Lil' Fatty wiped his mucus with his finger and he touched the tiger using that finger. Then, the mucus ended up on the artwork. Furthermore, the ink hadn't dried up yet and there was a white mark on it, courtesy of his finger.</p><br/><p>\"I want to touch it too.\"</p><br/><p>\"Me too!\"</p><br/><p>The children rushed forward.</p><br/><p>Lin Fan passed the artwork to Lil' Fatty. \"Go, you guys can touch it.\"</p><br/><p>Lil' Fatty held onto it and smiled. \"I have the drawing. If you guys want to touch it, come with me.\"</p><br/><p>In the broadcasting room.</p><br/><p>Everyone was stunned.</p><br/><p>Tao Shi Gang pressed the voice message button on the app. \"Don't touch it! It's a magnificent artwork. It is worth a few million dollars.\"</p><br/><p>\"D*mn, that stupid fatty deserves to be beaten up. His finger ruined an artwork that's worth a few million dollars.\"</p><br/><p>\"Your mom… When this fatty grows up, he will get his hand chopped off. If it was me, I would definitely buy insurance to protect his finger. It's a million dollar finger.\"</p><br/><p>\"Master Lin's drawing is worth a few million dollars. Does that mean that in the future… That…\"</p><br/><p>\"Jackpot! I just want an artwork from Master Lin next time.\"</p><br/><p>In the study room.</p><br/><p>Tao Shi Gang and Yue Qiu Ju Shi looked at the artwork painfully as it got destroyed right in front of them.</p><br/><p>However, Lin Fan wasn't bothered by it since it had been just a piece of cake to him.</p><br/><p>What mattered was that everyone was happy.</p><br/>\n</div>"}