{"title": "Chapter 401: Revealing incompetence", "id": 401, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-401-revealing-incompetence", "volume_title": "Volume 5", "body": "<h1>Chapter 401: Revealing incompetence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 401: Revealing incompetence</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Zhao Ming Qing didn't quite understand Chinese traditional arts but at that moment, as he stood at the side and looked at his teacher talking to these two people so happily, he couldn't help but be surprised. These two people were from the Chinese Art Association and from Zhao Ming Qing's view, they looked like they had pretty high appointments in the association, especially that Yue Qiu Ju Shi, who wanted to organize an art exhibition. The only ones who could organize art exhibition in the association were people with status. Moreover, his artworks had to be exceptional. Otherwise, he would have been ashamed to put them up for an exhibition.</p><br/><p>Furthermore, he realized that some of the things said by his teacher actually caused the two people to have deep realizations as if they learned something new. Needless to say, his teacher's talent was shocking to him.</p><br/><p>At that moment, he thought of the situation regarding the ceremony. If it wasn't for his teacher's good attitude and him not minding all these, Zhao Ming Qing wouldn't have been able to become his disciple. It would have been a great loss.</p><br/><p>The children were very quiet at that moment, all of them sitting there and drawing. Although their drawings didn't look like anything, in the children's hearts, they had their own world and their own thinking.</p><br/><p>\"The two of us cannot compare to Master Lin in terms of understanding Chinese traditional art. I never thought that someone like Master Lin existed in the Chinese art world. Indeed, the new generations just keep exceeding the old. We're definitely not as great as you.\" During this time of interaction with Lin Fan, Tao Shi Gang had understood that this Master Lin was really exceptional. He was much greater than them in terms of philosophy. Moreover, he even had some new and rather odd philosophies that they had never heard of before.</p><br/><p>Yue Qiu Ju Shi was sitting at the side as he said softly, \"Master Lin, I was wondering if you could teach us a little of that mnemonic chant to learn your procedures. This kind of mnemonic chant, to new people, is a kind of priceless treasure and to us, it's a kind of change in the drawings.\"</p><br/><p>Lin Fan laughed and said, \"No problem, this isn't much at all. Lil' Fatty, come here.\"</p><br/><p>Lil' Fatty, who had paint all over his face, put down the paintbrush and ran over clumsily. As he sucked in his mucus, he asked, \"You called me, teacher…?\"</p><br/><p>\"Mmm.\" Lin Fan rubbed Lil' Fatty's face, then said, \"Recite the mnemonic chant that I taught you to these two grandpas.\"</p><br/><p>Lin Fan had realized that Lil' Fatty's memory was exceptionally good. After teaching him three times, he had remembered the whole thing. It was simply like a photographic memory.</p><br/><p>Little Fatty's nose twitched as he sucked in his mucus once more. \"I can't remember it, Teacher.\"</p><br/><p>\"Mmm?\" Lin Fan looked at Little Fatty suspiciously. His meaning was clear: If you don't recite it, you will be in trouble. When Lil' Fatty saw this, he immediately rubbed his head and said, \"I remember it now, Teacher.\"</p><br/><p>Tao Shi Gang and Yue Qiu Ju Shi couldn't help but start laughing. Then, Lil' Fatty started reciting it in a crisp and loud voice. He didn't have any stage fright.</p><br/><p>Yue Qiu Ju Shi kept nodding. He was very supportive of this mnemonic chant, \"Wonderful, wonderful…\"</p><br/><p>\"Not bad at all. You can go back now,\" said Lin Fan with a nod.</p><br/><p>Lil' Fatty nodded contently. As he went back, he was like a king returning to his kingdom and all the other children surrounded him.</p><br/><p>\"Lil' Fatty, you're awesome!\"</p><br/><p>\"You can remember so much content!\"</p><br/><p>\"I can't remember that at all.\"</p><br/><p>Lil' Fatty said with a flick of his head, \"Of course. It was simple.\"</p><br/><p>Yue Qiu Ju Shi looked at Lin Fan, a little ashamed. He looked as if he wanted to say something but he stopped every time he was about to say it.</p><br/><p>\"Master Yue, is there something you want to say? Why don't you just say it out?\" Lin Fan saw that the elderly man clearly wanted to say something.</p><br/><p>Yue Qiu Ju Shi still felt a little embarrassed but he spoke, \"Master Lin, I'm going to organize an art exhibition soon. Initially, I didn't have enough drawings for the exhibition but I would have enough if I borrow some from Brother Tao. After seeing your masterpieces, I have an idea. I was thinking that Master Lin could do a painting an add it to my collection. Of course, I know this request is a little absurd but with your ability, Master Lin, you shouldn't be so unknown…\"</p><br/><p>Lin Fan smiled and said, \"I thought it was something big. So that's it. That's not a problem but the two of you are masters in the Chinese traditional art world. If I give you a piece, could you two give me a piece each as well?\"</p><br/><p>\"That's good, that's good.\" When Yue Qiu Ju Shi heard that, he was beyond delighted. His head full of white hair seemed to have just gained some fire as it shined gloriously.</p><br/><p>Tao Shi Gang smiled and said, \"Then we'd be taking unfair advantage of you, Master Lin.\"</p><br/><p>Lin Fan waved his hand. \"No one's taking advantage of anyone. We are simply making friends through art.\"</p><br/><p>\"Right, making friends through art. Although I'm older than Master Lin, people in the same industry don't compare ages. We interact with skills.\" Yue Qiu Ju Shi laughed. They really loved art and it could even be said that they loved it so much that they couldn't part with it. In their small circle of artists, they would often interact by trading artworks as well.</p><br/><p>\"Han Lu, go do some preparations,\" said Lin Fan.</p><br/><p>Han Lu witnessed the scene and hastily went to prepare. He was rather unfamiliar with the Chinese art world. He was a fighter, a rather crude man. In this peaceful society, scholars lived better lives than martial artists and they received more respect and admiration.</p><br/><p>This was the first time Zhao Ming Qing had seen his teacher's artworks and he was very curious. As an old Chinese doctor, he usually only cared about Chinese medicine. However, among his group of friends, there were people who liked art, so his house had quite a number of drawings and ink masterpieces, mostly used for decoration.</p><br/><p>Very soon, the tools had all been prepared.</p><br/><p>Lin Fan extended his hand. \"You're guests. Please go first, masters.\"</p><br/><p>Tao Shi Gang said with a smile, \"My specialty lies in landscape drawings. I went to Taishan a while back. The scenery is still fresh in my mind. Taishan is a symbol of the Chinese people, the epitome of Eastern culture. Today, I shall reveal my incompetence and present to you a drawing of the Taishan summit.\"</p><br/><p>Yue Qiu Ju Shi smiled. \"My specialty lies in flowers and birds. I will do a drawing of birds perched on ancient trees.\"</p><br/><p>In front of Master Lin, they had to reveal their true ability. They couldn't try to dupe Master Lin. Hence, the paintings that the two of them were prepared to make were their best artworks.</p><br/><p>Lin Fan and the rest stood aside. Zhao Ming Qing didn't know much about traditional art but, as he saw these masters of the Chinese traditional art world at work, he felt that it was quite enjoyable as well.</p><br/><p>Once the brushes hit the canvas, the paintings started to appear. The two Masters had already planned in advance what they were going to draw.</p><br/><p>Lin Fan kept nodding as he stood at the side. These were indeed masters. Their drawings were really unlike the typical drawings.</p><br/><p>Time passed, minute by minute, second by second. To Tao Shi Gang and Yue Qiu Ju Shi, although their pace was slow, they had to finish it smoothly in one go.</p><br/><p>The two of them were masters of Chinese art. They were very knowledgeable about calligraphy. As Chinese art masters, their calligraphy had to be pretty good.</p><br/><p>Poems were inscribed.</p><br/><p>The brushes descended.</p><br/><p>Two lifelike art pieces appeared before everyone. Then, the two of them took out their seals which they brought with them everywhere they went and stamped the artworks.</p><br/><p>'Presented to an art friend: Master Lin'</p><br/><p>Lin Fan applauded. \"You are indeed masters. These two works have a romantic charm to them. They are masterpieces among masterpieces.\"</p><br/><p>Tao Shi Gang wiped the sweat from his forehead and smiled. \"Master Lin, we've revealed our incompetence.\"</p><br/><p>Lin Fan nodded. \"Since you two masters have already completed your drawings, I shall reveal my incompetence as well.\"</p><br/><p>At that moment, Tao Shi Gang and Yue Qiu Ju Shi stood next to their desks with anticipatory looks on their faces as if they were waiting for something.</p><br/><p>Meanwhile, Zhao Ming Qing saw that his teacher was about to exhibit a great piece of work and was in anticipation as well. Zhao Zhong Yang hurriedly started a broadcast as he witnessed this marvelous scene.</p><br/><p>Lin Fan stood in front of the drawing desk. A smile appeared on his face. \"Master Yue, your specialty is in flowers and birds. Then I shall draw a painting of a hundred birds looking up to a phoenix.\"</p><br/><p>Then, Lin Fan picked up the brush and his hand started moving.</p><br/><p>Suddenly, Tao Shi Gang and the rest felt as if Master Lin's aura had changed. It was as if he was immersed in the artwork. As he drew, the ink was dazzling with a brilliant luster.</p><br/>\n</div>"}