{"title": "Chapter 409 - The Internet has gone mad", "id": 409, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-409-the-internet-has-gone-mad", "volume_title": "Volume 5", "body": "<h1>Chapter 409 - The Internet has gone mad</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 409: The Internet has gone mad</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Early morning!</p><br/><p>Zhao Ming Qing was being spammed with phone calls.</p><br/><p>“Elder Zhao, what are you doing? You mentioned that you’re going to conquer anorexia. Is that true? Or did you get hacked?” a good friend of his asked.</p><br/><p>Zhao Ming Qing was full of confidence. “Of course it’s true. My mentor and I have been researching it intensively. There are some results and I believe the perfect medicine will be coming out soon.”</p><br/><p>“Mentor? Is that the young chap? Elder Zhao, that’s…”</p><br/><p>Zhao Ming Qing laughed confidently. “it’s okay, I know you don’t believe my mentor is amazing. However, I’ll let you guys know of his superior medical skills through this. You have to keep this a secret for me and not publicize it. My mentor hasn’t told me that I can mention his name yet.”</p><br/><p>They hung up after a while. Zhao Ming Qing’s friend sighed after hanging up. He felt that Elder Zhao had gone mad. He didn’t know how this was going to turn out and if someone were to make a big fuss out of it, it would definitely affect Chinese medicine.</p><br/><p>They both were experienced elderly men and they knew that there were baddies online who were anti-government. These people were corrupted and they wanted to destroy things like the national treasures and defame government officials. Those that didn’t know the truth wouldn’t be greatly impacted but things could go really wrong in certain circumstances. This matter had the potential to blow up.</p><br/><p><em>Ding ding!</em></p><br/><p>The phone came again.</p><br/><p>Zhao Ming Qing shook his head. But when he saw it was Elder Mu, he smiled. “Elder Mu, what’s up?”</p><br/><p>“Elder Zhao, you’re curing anorexia with Master Lin?” Elder Mu was shocked.</p><br/><p>Zhao Ming Qing smiled. “Yeah, what is it? Are you not confident in us?”</p><br/><p>There was silence.</p><br/><p>“It’s not that I’m not confident. I have absolutely no confidence. You guys are rushing things. Although anorexia isn’t a terminal illness, my understanding of it is that it is an even more complicated disease. You guys should’ve said it after the prescription is out. You’re attracting unnecessary attention and if this fails, it would be devastating,” Elder Mu said.</p><br/><p>Zhao Ming Qing smiled. “It’s okay, I believe in my mentor and he has made me understand something after guiding me. Let me tell you the truth. He has already come up with the prescription. However, he’s just teaching me about it now to let me understand it. Do you think my teacher would let me do this if he wasn’t confident?”</p><br/><p>Mu Xian shook his head. “Elder Zhao, I realized that you’ve really gone mad. You’ve just had this mentor for a few days and you trust him so much? You gotta have your own way of thinking.”</p><br/><p>Zhao Ming Qing smiled. “Alright, alright. I’ll hang up here. You guys don’t understand.”</p><br/><p>He hung up the call.</p><br/><p>Mu Xian looked at his phone and shook his head helplessly. How could he not understand about Chinese medicine?</p><br/><p>A few calls later, Zhao Ming Qing was still really happy. Although his friends were all worried about him, he wasn’t worried at all because he trusted his mentor.</p><br/><p>On the Internet.</p><br/><p>“D*mn, it’s the first time I’ve seen Chinese medicine being so awesome. It’s really trying to prove something here.”</p><br/><p>“Hey, trust me, this will be gone in a few days and the stupid old Chinese doctor will become a joke.”</p><br/><p>“Coming up with a cure for anorexia is the stupidest joke I’ve ever heard.”</p><br/><p>“I agree. Chinese medicine has already fallen in favor. Just let it die. Why did this clown come up and say something like that? Furthermore, he’s the director of a Chinese medical university.”</p><br/><p>“Haha, the Chinese medical academy is also an empty institute with no substance.”</p><br/><p>“Shanghai’s First Chinese Medical Academy has been around since 1900. It had a lot of great masters in the past but it only started to accept students again after the war in 1975. The student cohort remains steady at about 1300 people. About 20% of them withdraw halfway and only 10% of them stick to becoming a Chinese medical doctor after graduation. The others turn to Western medicine and other professions. There are only a handful of famous Chinese medical doctors. The school became a reputable university after the government supported it. If not for the government, it would be just a small and lousy university.”</p><br/><p>“The person above is right, his statistics are all correct.”</p><br/><p>“I went to read the discussions on other Chinese medical doctors’ Weibo. They don’t think highly of this matter at all.”</p><br/><p>“They’re just waiting for a joke to happen.”</p><br/><p>Cloud Street.</p><br/><p>Fraud Tian and the others didn’t know what was happening between Lin Fan and Zhao Ming Qing. Lin Fan didn’t want to tell them anything about it. However, when they saw what was happening online, they just laughed. Even a fool could tell that people didn’t think highly of Chinese medicine at all.</p><br/><p>Zhao Ming Qing was indeed a pro at Chinese medicine but he couldn’t help to make Chinese medicine a great success.</p><br/><p>Then, Lin Fan posted on Weibo.</p><br/><p>“I believe Chinese medicine will have a prescription to cure anorexia. I’ll just say this. If the prescription doesn’t work, I will eat sh*t on a live broadcast. If the prescription works, all of you have to post good things about Chinese medicine in all your online groups. Does anyone want to bet on this?”</p><br/><p>Lin Fan had a few million fans on Weibo and it immediately caught their attention.</p><br/><p>“666… Master Lin is going to eat sh*t on a broadcast? I’m in.”</p><br/><p>“+1.”</p><br/><p>“Master Lin, take it slow. You’re definitely going to lose this. It’s not too late to withdraw from it.”</p><br/><p>“Too awesome, I’ll bet too.”</p><br/><p>“Master Lin, I’m so impressed. However, sometimes, you still have to look at the situation before acting. Everyone can see that this is an impossible feat.”</p><br/><p>Fraud Tian scrolled through his phone and gasped, “D*mn, you’re playing it too big this time.”</p><br/><p>Wu You Lan was stunned. “Brother Lin, don’t do that. You’ll definitely lose.”</p><br/><p>“Haha.” Lin Fan raised his head and looked extremely calm. “I’ll lose? Let me tell you that it’s impossible for me to lose.”</p><br/><p>It was just anorexia. How difficult could it have been? If not for training Zhao Ming Qing, he would have brought out the prescription already. However, Zhao Ming Qing was making decent progress and he was gradually able to grasp the medicine combinations. He still needed some time to make the prescription work.</p><br/><p>“Alright, take care of the shop. I’ll go out for a while,” Lin Fan waved his hand and said.</p><br/><p>Fraud Tian and the rest didn’t know what he was up to but he had been acting suspiciously. They didn’t know where else he could go besides the children’s welfare institute.</p><br/><p>The web forum of the Shanghai’s First Chinese Medical Academy was also buzzing.</p><br/><p>The students were discussing it intensely.</p><br/><p>“The director is crazy on Weibo. This is a shocking Weibo post about curing anorexia. Do you guys think he can do it?”</p><br/><p>“I don’t believe it. Although Director Zhao has brilliant medical skills, it still can’t beat Western medicine.”</p><br/><p>“It’s too late to regret after entering a Chinese medical university. I’m extremely regretful. I get embarrassed to answer my family and friends back at home when they ask me what I’m currently studying.”</p><br/><p>“I agree. I thought I could get myself a girlfriend in university but there are only guys and that old fella here. It’s hopeless.”</p><br/><p>“Wait till our school becomes a joke. I will definitely withdraw and study again to enroll in another university.”</p><br/><p>“Pathetic, how pathetic. Director Zhao is so old already, why did he cause such a stir on the Internet? He’s going to get himself scolded by everyone.”</p><br/><p>“However, Director Zhao has been secretly researching about something in the lab with a young chap. Do you guys think he’s researching about this?”</p><br/><p>“They’re probably gays.”</p><br/><p>“He’s old and probably has a lot of vitality.”</p><br/><p>“^ can you please be more respectful towards our director?”</p><br/><p>“Haha, anorexia isn’t a normal disease. If it can be cured by just two people, the sun would rise from the west.”</p><br/>\n</div>"}