{"title": "Chapter 406 - A problem arises", "id": 406, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-406-a-problem-arises", "volume_title": "Volume 5", "body": "<h1>Chapter 406 - A problem arises</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 406: A problem arises</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Whenever something happens, reporters are always the first to reach the place.</p><br/><p>Wang Li Li’s case already had a Baike page on the Internet and a number of media agencies had reported about her but later on, there had been no interesting news for them to report throughout the treatment. They just gave updates on her situation every once in a while to let the netizens know how she was doing.</p><br/><p>Now that the specialist group was here, there were reporters drawn to the hospital as well. When the specialist group had reached the hospital, reporters were already there.</p><br/><p>The hospital hadn’t expected the reporters to arrive so quickly.</p><br/><p>Outside the sick ward, reporters surrounded Director Zhang.</p><br/><p>“Director Zhang, now that the specialist group is here, do they have a plan to suppress the illness?”</p><br/><p>“According to our knowledge, the specialist group of the Anorexia Research Centre is one of our country’s main driving forces of anorexia research. Are they confident of completing the treatment?”</p><br/><p>“Director Zhang, could you answer our questions please?”</p><br/><p>The reporters kept asking questions, one after another. They were very concerned about this matter.</p><br/><p>In front of all these reporters, Director Zhang was helpless. There were times when reporters were annoying but there were also times when these reporters had to be thanked.</p><br/><p>For example, in Wang Li Li’s case, if it wasn’t for their reporting, it wouldn’t have drawn all this attention and there wouldn’t have been any donations.</p><br/><p>However, there were times when reporters came over in large crowds, affecting the treatment of the patients. This was like a double-edged sword. The reporters had the power to save people and also to kill people.</p><br/><p>Director Zhang said, “Everyone, please quieten down. The people from the specialist group are now checking on the patient’s condition. If there’s anything you want to know, you may wait for the specialist group to come out, then, you can ask them.</p><br/><p>He didn’t dare to say too much or guarantee that she would be treated back to health. He didn’t dare to say anything at all. Who knew how his words would be reported by the reporters? If things get out of hand, the consequences would be severe.</p><br/><p>At that moment.</p><br/><p>Specialist Chang opened the door and said, “The porridge that I asked for, why is it not here yet?”</p><br/><p>But when he saw the reporters outside, Specialist Chang’s expression changed. He let out a grin. It was as if he wanted to show a fatherly behavior towards the patient in front of the reporters.</p><br/><p>“This is Specialist Chang from the specialist group,” Director Zhang introduced.</p><br/><p>The reporters all went forward, “Specialist Chang, how is the patient’s condition? You’re a specialist from the Haicheng Anorexia Research Centre. Do you have any methods to tackle this illness?”</p><br/><p>“Wang Li Li is considered a severe sufferer of anorexia. The hospital has said that if the treatment isn’t effective, she may only have a month left to live.”</p><br/><p>“Specialist Chang, please say a few words.”</p><br/><p>Specialist Chang faced the reporters with a smile. “My dear reporters, I cannot answer these questions at the moment but you don’t have to worry. Wang Li Li’s condition isn’t the worst that we have seen. The staff of the specialist group is very experienced. We will definitely have methods to treat this illness. Although we may not be able to cure the illness, suppressing its further development isn’t a problem.”</p><br/><p>Lin Fan just stood at the side, watching Specialist Chang put on a show. He acknowledged what Specialist Chang said. These people were specialists after all. Even if they may not be able to cure Wang Li Li, suppressing the illness shouldn’t be a problem.</p><br/><p>Moreover, Wang Li Li’s case had drawn the attention of the Internet. If these specialists could suppress the illness or even successfully cure it, it would be great for them.</p><br/><p>Hence, they had to produce results no matter what.</p><br/><p>A reporter said, “Hello, Specialist Chang. May I know what are the results of your tests?”</p><br/><p>Specialist Chang replied, “I’m sorry, my dear reporter. I cannot comment on that. However, we’ve already deduced that everything is still normal. Right now, we need to feed the patient with some porridge to see her reaction towards light foods.”</p><br/><p>The reporters didn’t understand what he meant but they felt that they would be able to gain some useful news from this.</p><br/><p>Lin Fan raised his head and looked over. “Specialist Chang, in her current state, the patient really can’t consume food like porridge. Her stomach won’t be able to take it.”</p><br/><p>Specialist Chang took a glance at Lin Fan, then ignored him completely. After that, he said a few words to the reporters and returned to the sick ward. Soon after, a nurse went in carrying a bowl of porridge.</p><br/><p>The reporters stood outside the door and some reporters recognized Lin Fan.</p><br/><p>“Master Lin, you said that the patient cannot consume porridge. Why is that?” asked a reporter.</p><br/><p>“The scallion pancake maker, Master Lin. I never thought that you would appear at the hospital.”</p><br/><p>“Master Lin, please say a few words.”</p><br/><p>Lin Fan wasn’t ready to steal the spotlight, so he just said a few words casually, “The patient’s current state is clearly very severe. There hasn’t been any food that has entered her stomach in a long time, hence it is exceptionally weak and vulnerable. Moreover, Wang Li Li is suffering from severe anorexia and she is very resistant towards food. Because of this psychological state, it will affect her nervous system. For example, when someone touches a hot object, he would instantly retract his hand. That is Wang Li Li’s current state. If she consumes the porridge, her stomach would contract and at worst, there would be nasty repercussions. But overall, we have to see how the specialists treat her.”</p><br/><p>The reporters nodded. Although what Master Lin said seemed to make sense, their attention was focused on the specialist group.</p><br/><p>Then, all of them just waited outside the door.</p><br/><p>Zhao Ming Qing arrived soon after. He came to Lin Fan’s side and asked, “Teacher, what is it?”</p><br/><p>Lin Fan said softly, “There’s an anorexia sufferer inside. Later on, I’ll tell you something but it’s not urgent at the moment. You’ve brought the tools that I told you to, right?”</p><br/><p>“I brought them.” Zhao Ming Qing was holding a rectangular wooden box in his hand.</p><br/><p>“Mmm.”</p><br/><p>Although Zhao Ming Qing was the director of Shanghai Chinese Medical Academy and had a high status, the reporters didn’t recognize him. Even Director Zhang didn’t recognize him. They might’ve heard of his name, but they had never seen him before.</p><br/><p>Suddenly.</p><br/><p>A shriek was heard from inside the sick ward.</p><br/><p>When the crowd outside heard this, they panicked. Wang Li Li’s mother, in particular, panicked even more. “What happened? What happened?” Then, she pushed open the door and rushed in, with Director Zhang following close behind. Of course, the reporters all flocked in as well.</p><br/><p>Could something have gone wrong?</p><br/><p>In the ward, the staff of the specialist group seemed to be at a loss. On the sick bed, Wang Li Li was curled up and hugging her stomach as she rolled back and forth, screaming unceasingly.</p><br/><p>Specialist Chang was dumbfounded. How was this possible? He knew that severe anorexia sufferers couldn’t swallow food but porridge is the softest and gentlest of foods. It should have the ability to not harm the stomach. However, after just one mouth of it, this happened.</p><br/><p>Madam Wang was very anxious. “Specialist Chang, what’s happening to my daughter?”</p><br/><p>“This..this…” Specialist Chang appeared to be at a loss for words. This situation was completely beyond his expectations.</p><br/><p>Director Zhang rushed forward and took a look. He was a Western doctor, not a Chinese doctor. He simply couldn’t figure out what the problem was. Then, he hastily shouted, “Quick! Send the patient for a check. Find out what exactly is going on.”</p><br/><p>Lin Fan said to Zhao Ming Qing, “Go. Place needles at the Nei Guan, Zhong Wan, and Zu San Li acupuncture points. Place them one inch deep and gently turn them clockwise three times.”</p><br/><p>Zhao Ming Qing nodded, then went forward. However, he was immediately stopped by Specialist Chang. “Who are you? What are you trying to do?”</p><br/><p>Zhao Ming Qing’s brows furrowed. “Zhao Ming Qing, Director of Shanghai’s First Chinese Medical Academy. I’m going to perform acupuncture on the patient to relieve her pain.”</p><br/><p>Specialist Chang was already at a loss. He didn’t think too much and said, “Chinese Medical Academy? Even our Western Medicine is useless, what do you think you could do? Hurry up and move aside. We need to send her for checks to see what’s going on!”</p><br/><p>At that moment, Director Zhang went forward and asked curiously, “Director Zhao Ming Qing of the Chinese Medical Academy?”</p><br/><p>Zhao Ming Qing nodded. “Mmm. What is it? Is there another Zhao Ming Qing?”</p><br/><p>Director Zhang had heard of Zhao Ming Qing’s name. In the medical world, he had a high status. He couldn’t help but say, “Elder Zhao, please take a look.” Then, he looked over at Specialist Chang. “Specialist Chang, this is a Chinese medical master from Shanghai. His medical skills are exceptional. I think you better move aside for him.”</p><br/><p>If he had to choose who to trust between the two, of course, he would choose Master Zhao Ming Qing.</p><br/><p>At that moment, Wang Li Li’s face turned greenish-pale. She was perspiring non-stop. There was even a chance of her dying from the pain.</p><br/><p>As the reporters filmed the current situation, they felt something grip their hearts. Now that such a problem had arisen, who knew how the situation would turn out?</p><br/>\n</div>"}