{"title": "Chapter 411 - Avoid being hot-tempered", "id": 411, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-411-avoid-being-hot-tempered", "volume_title": "Volume 5", "body": "<h1>Chapter 411 - Avoid being hot-tempered</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 411: Avoid being hot-tempered</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>The next day!</p><br/><p>“Crazy. It’s too crazy. Zhao Ming Qing actually used a young chap to test the medicine just to come up with a prescription. This is so unethical.”</p><br/><p>“He’s so inhumane. How could he think of something like that?”</p><br/><p>“Who filmed this? It looks like it was filmed using an iPhone. Couldn’t you have used a camera with better quality? You should’ve used our local brands.”</p><br/><p>“It’s too scary. Where are the relevant authorities? They should arrest this old and inhumane beast.”</p><br/><p>“Infuriating, it’s so infuriating.”</p><br/><p>The video caused an uproar on the Internet.</p><br/><p>Some people re-posted the video on WeChat and some even edited it and made it seem even worse.</p><br/><p>“This is an inhumane beast who doesn’t deserve to be a Chinese medical doctor. He’s the director of the university and he used a human as a test subject. The medicine is 30% poisonous. This action is too incorrigible. Chinese medicine is so lousy today because of people like him. Everyone, please re-post this and let’s kill this man.”</p><br/><p>The crowd that was there just for fun started to discuss it too.</p><br/><p>“It’s so scary. What’s wrong with the government? How could they let someone like him become the director of the Chinese medical university?”</p><br/><p>“Haha, that’s just how the society works. You can get anything you want as long as you’re powerful.</p><br/><p>“We are taxpayers and the money’s being used to harm others.”</p><br/><p>The post got re-posted countless times.</p><br/><p>The impact of the video became even greater when it appeared online.</p><br/><p>Those students were stunned as they hadn’t realized that it would cause such a situation. They immediately went to the web forum to delete it. However, it was useless. The video had been re-posted everywhere.</p><br/><p>A lot of WeChat and QQ groups re-posted it.</p><br/><p>The discussion got blown up even further.</p><br/><p>Those that didn’t know the truth also started to re-post it on Weibo. This video also appeared on the news.</p><br/><p>In the research lab.</p><br/><p>Lin Fan was teaching Zhao Ming Qing and he didn’t know about the matter yet. Zhao Ming Qing was in the preliminary stages after what he had said yesterday. He was going to get the right combination soon.</p><br/><p>At the same time, he felt that Chinese medicine was profound and deep.</p><br/><p>Every single combination could have a different effect.</p><br/><p><em>Ding ding!</em></p><br/><p>Then, Zhao Ming Qing’s phone rang. He picked it up.</p><br/><p>“Elder Zhao, are you mad? You actually used a human as a test subject? Do you know how much of an impact this would cause?” a good friend of his said.</p><br/><p>Zhao Ming Qing was stunned and he asked curiously, “Where did you hear this from? I used a human as a test subject?”</p><br/><p>“Stop denying it. Look at the news online. This matter was broadcasted to everyone. Chinese medicine is going to be greatly affected. If something bad is to happen, you’re the one to blame.”</p><br/><p>Then, the call was hung up.</p><br/><p>Zhao Ming Qing was stunned and Lin Fan asked curiously, “What’s wrong?”</p><br/><p>“Teacher, I don’t know. My friend called me and told me that I used a human as a test subject. The internet is in a huge craze but I don’t know anything about it.” Zhao Ming Qing was stunned. He was just researching with his teacher. How had this happened?</p><br/><p>Lin Fan immediately understood. He thought of something and took out his phone. Indeed, the news was filled with the video of Zhao Ming Qing. The headlines were awful. Then, he passed the phone to Zhao Ming Qing. “Indeed, it must have been taken by the students yesterday. They must have posted it online and someone re-posted it and made it seem worse. Those that don’t know the truth think that you’re up to no good.”</p><br/><p>Zhao Ming Qing took the phone and was furious after watching the video. “How could they do this to malign me?”</p><br/><p>“Be quiet. Do not be angry. It’s a taboo to be angry in Chinese medicine. Just let them say what they want. You should continue doing it and ignore what they’re saying,” Lin Fan said.</p><br/><p>Zhao Ming Qing took a deep breath. “Thank you for your teaching. Ming Qing will not be affected by this. I’ll let them say what they want.”</p><br/><p>Lin Fan nodded his head and opened his own Weibo. Then, he frowned.</p><br/><p>“Motherf<em>ckers. Even I got scolded for it. D</em>mn, I can’t take it,” Lin Fan shouted.</p><br/><p>Zhao Ming Qing was stunned. “Teacher?”</p><br/><p>His mentor had just asked him to calm down but he himself was now fuming with rage.</p><br/><p>Lin Fan waved his hand. “Just go ahead. Your mentor is young and hot-tempered. Let me vent my anger. Just continue with your research.”</p><br/><p>Zhao Ming Qing looked at his mentor and nodded. He realized that the good thing about being a mentor was that he could do whatever he wanted.</p><br/><p>Then, Lin Fan was extremely furious. Those netizens who didn’t know anything were too horrible.</p><br/><p>“Stupid f*cker. You’re so supportive of Chinese medicine. Don’t you know that this old fella is using a young chap as a test subject?”</p><br/><p>“Hmph, you’re still so supportive. I wish you were the test subject.”</p><br/><p>“Fool, I didn’t know a fool like you existed. Master Lin? I think you’re just a clown.”</p><br/><p>“Why don’t you ask your whole family to become test subjects for this old hag?”</p><br/><p>Lin Fan tapped away on his screen. “You bunch of stupid idiots. Just wait till I shut all of you up. Don’t even try to apologize when that happens. Some of you even scolded me. You must be asking for trouble. If you were standing in front of me, I’d definitely kick you until your head breaks.”</p><br/><p>“Haha, he’s even scolding us. This f*cker must be a stupid idiot.”</p><br/><p>“Master Lin, I am neutral about this. I do not think highly of Chinese medicine regarding this. Look, this old Chinese medical doctor is a scammer. He used a human as a test subject. How inhumane.”</p><br/><p>“Master Lin, I address you as Master Lin because I respect you. You have to be objective about this. The video is out. Don’t try to deny it.”</p><br/><p>“Yeah, I thought that this Chinese medical doctor was a saint but he’s just an inhumane beast.”</p><br/><p>“Master Lin, f*ck your whole family.”</p><br/><p>…</p><br/><p>Lin Fan was just lying there, waiting to be shot.</p><br/><p>In a certain small house, Autumn Sword Fish Killer scrolled through Lin Fan’s Weibo and was extremely happy.</p><br/><p>The Gods were fair after all. Karma would always get the baddies. It was just a matter of time.</p><br/><p><em>Ding ding!</em></p><br/><p>The phone rang.</p><br/><p>Autumn Sword Fish Killer saw that it was Lin Fan’s call and he immediately switched on a voice changer. “Hi, the number you have dialed is not in service. Please call again later, …”</p><br/><p>“Haha!” Autumn Sword Fish Killer laughed and his belly started to jiggle up and down.</p><br/><p><em>Ding!</em></p><br/><p>A message came.</p><br/><p>Autumn Sword Fish Killer was stunned when he saw it. “You think you’re awesome now? Don’t worry, your salary will be deducted. Negative $2000 for the next month. If you call me back within the next minute, I’ll increase your salary by $100.”</p><br/><p>He immediately called him.</p><br/><p>“Boss, I was in a tunnel and there wasn’t any reception. I’ll be home in ten minutes and I’ll go against those idiots immediately. I assure you that they’ll not be of any threat to you,” Autumn Sword Fish Killer said.</p><br/><p>Lin Fan said, “Yeah, do a good job. I am impressed by you. They actually have the guts to roast me. I can’t take it. You have to settle it for me.”</p><br/><p>“Yes, I will,” Autumn Sword Fish Killer replied.</p><br/><p>Lin Fan looked at his Weibo and heaved a sigh. It was something he couldn’t take and he had to do something about it.</p><br/><p>“Ming Qing, you have to come up with the prescription today. We’ll let them know our true power tomorrow,” Lin Fan said furiously.</p><br/><p>Zhao Ming Qing nodded. “Yes, teacher.”</p><br/>\n</div>"}