{"title": "Chapter 427 - He strikes again", "id": 427, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-427-he-strikes-again", "volume_title": "Volume 5", "body": "<h1>Chapter 427 - He strikes again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 427: He strikes again</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Wu Yun Gang was a little embarrassed when he arrived. It wasn’t because he wasn’t capable. It was because this incident involved a Korean celebrity who was famous in China which caused a major commotion.</p><br/><p>Therefore, the people that Wu Yun Gang approached found it to be risky for him to be released. Hence, they didn’t want to take the risk.</p><br/><p>“Chief Wu, it’s okay. You tried your best. Anyway, we’re already out.” Lin Fan looked at Wu Yun Gang’s embarrassed look and smiled.</p><br/><p>Wu Yun Gang replied awkwardly, “It’s not that. It’s just that I’m actually helpless even though this is considered to be my territory. That’s shameful.”</p><br/><p>Lin Fan waved his hand. “It’s okay. Let’s not talk about this. Let’s have a meal together, we haven’t met in a long time. I want to hear about your investment project with Ming Yang.”</p><br/><p>Wu Yun Gang smiled. “This project would be a success with Master Lin’s guidance.”</p><br/><p>Wang Ming Yang smiled. “Of course. When we were at the airport, I told him about it and this project will earn us millions of dollars!”</p><br/><p>“Really?” Wu Yun Gang gasped in shock.</p><br/><p>“Of course.” Wang Ming Yang trusted Lin Fan a lot.</p><br/><p>Lin Fan waved his hand. “Don’t be happy too early. You have to be calm. If you’re not focused, things can change.”</p><br/><p>“Understood, understood.”</p><br/><p>Wu Yun Gang was familiar with the places in Beijing and naturally, he brought Wang Ming Yang and Lin Fan to the best and most high-end places. It was incredible to be traveling with a young and wealthy man.</p><br/><p>They ate till 11 pm and were extremely full. Wu Yun Gang booked a suite for Wang Ming Yang and Lin Fan and they went to have a rest.</p><br/><p>The next day!</p><br/><p>News articles came out.</p><br/><p>Jin Xuan Ming’s incident was far from over. It had initially been a minor incident but he was a Korean celebrity. The reporters from China were waiting anxiously for any new information to report.</p><br/><p>Lin Fan’s answers from yesterday’s interview were also released to the public. The outsiders saw him as a cocky man. However, Lin Fan felt that it was still better to stay low-key.</p><br/><p>At the hospital.</p><br/><p>Jin Xuan Ming was extremely devastated. It was an indescribable feeling. He dreamt that he had attracted a lot of fans and the concert ticket prices skyrocketed. In the end, he took bags of money back to Korea and became famous there too.</p><br/><p>However, he opened his eyes and realized it was just a dream.</p><br/><p>Jin Xuan Ming had come to China after signing a temporary contract with a managerial company. This company was in charge of the corporate arrangements. However, he was bedridden and he couldn’t attend any event at all. It was a huge blow to Jin Xuan Ming.</p><br/><p>He lay on his bed and used his phone.</p><br/><p>He used a software that could translate the content into different languages.</p><br/><p>Weibo was an extremely important social media platform for networking. He felt better after reading the translated comments of his fans in China. He felt that he could still make a return if he still had these hardcore fans and that his fame wouldn’t just vanish.</p><br/><p>“My dear babies, I am well. Thank you for your good wishes.” Jin Xuan Ming posted and smiled when he saw the comments of the Chinese fans.</p><br/><p>It was such a great feeling. He had never felt this way in Korea because he was just a small fry back there.</p><br/><p>However, things were different in China. He felt extremely great here.</p><br/><p>Furthermore, he knew that some of the senior celebrities had come to China and earned a lot of money. However, they had been banned because they spoke too much. Therefore, he decided to not tell anyone about his true feelings about things.</p><br/><p>He wanted to wait till he earned enough money before going back to Korea. Then, he could speak about it on the Korean variety shows.</p><br/><p>He even thought of what to say.</p><br/><p>‘The Chinese are dumb and rich. Any small celebrities from Korea can go there and beat the celebrities there.’</p><br/><p>Then, his manager came in. “Xuan Ming, how are you feeling?”</p><br/><p>Jin Xuan Ming nodded. “I feel better, how’re things on the Internet?”</p><br/><p>The manager replied, “Let me have a look.”</p><br/><p>When he opened the latest news article, the manager was stunned.</p><br/><p>Jin Xuan Ming saw his expression and was a little curious. He frowned as he took his phone to read the news. When the news was translated into Korean, his expression changed.</p><br/><p>“Scumbag…” Jin Xuan Ming scolded. He was enraged. “These Chinese people are too shameless.”</p><br/><p>“And these paparazzi, how could they say such things? Incorrigible.”</p><br/><p>The manager tried to console him after seeing that he was breathing heavily, “Xuan Ming, don’t be too anxious. The doctor said that you have to rest well.”</p><br/><p>Jin Xuan Ming replied, “I want to attend the corporate events.”</p><br/><p>The manager was stunned. “What did you say?”</p><br/><p>Jin Xuan Ming replied, “I can’t be defeated by a Chinese. I want to attend the corporate events. If I lie down here for a month, the world would forget about me. The losses would be too great to imagine. Please make arrangements for me. I will attend any corporate event.”</p><br/><p>“But your health…” The manager hesitated.</p><br/><p>“I’m okay. I’ll just sit in a wheelchair. The Chinese fans can be easily deceived. What do you think they’d do if I were to perform while I’m sick?”</p><br/><p>The manager smiled. “They’d definitely be even more amazed. At the same time, you’d definitely become an idol. You should stir up some of their emotions and perhaps you’d reap even greater benefits.”</p><br/><p>Jin Xuan Ming smiled. “That’s right. That’s what I meant.”</p><br/><p>The manager got even more excited as she thought about it. That was the best way they could deal with the situation. Letting Xuan Ming appear in front of the fans in such a state would definitely move them. Ultimately, they’d definitely cheer for him.</p><br/><p>On the Internet.</p><br/><p>The netizens were discussing intensely after reading the news. More people started to comment on Lin Fan’s Weibo.</p><br/><p>“666… Master Lin is my idol.”</p><br/><p>“Haha, that’s hilarious. Master Lin’s words are so infuriating. However, I feel so excited after listening to him.”</p><br/><p>“He said they could take his life since he didn’t have money. Who would be capable enough to take Master Lin’s life? Anyone who tries would probably be badly beaten up.”</p><br/><p>“I’m impressed. Master Lin has such a wide network. It’s even helped him out of the police station.”</p><br/><p>“I want to find out what Jin Xuan Ming thinks of this.”</p><br/><p>“He’s probably too traumatized.”</p><br/><p>“Where did Master Lin go? He should appear in a situation like this.”</p><br/><p>At that instant.</p><br/><p>Lin Fan woke up but he wasn’t bothered by what was happening. He felt that the most important thing now was to attend the National Arts Exhibition.</p><br/>\n</div>"}