{"title": "Chapter 431 - Bravo, burglars", "id": 431, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-431-bravo-burglars", "volume_title": "Volume 5", "body": "<h1>Chapter 431 - Bravo, burglars</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 431 – Bravo, burglars</p><br/><p>Translator:JTJTY97 | Editor: JTJTY97 /Sparrow Translations</p><br/><p>“Why is it so messy?” Yue Qiu Ju Shi came out from the private room and when he saw what had happened, he was stunned. What had happened to his art exhibition?</p><br/><p>Tao Shi Gang held onto the artwork that Master Lin had drawn like it was his precious treasure.</p><br/><p>Zheng Zhong Shan and the others looked at the artwork in Tao Shi Gang’s hands and thought about having it too but it was an artwork that had been given to him by Master Lin. Even if they wanted it, they couldn’t have it. They just hoped to know Master Lin better in the future so that they might be able to have one too.</p><br/><p>They had just witnessed the birth of another exquisite drawing and they were extremely excited. At that moment, the most excited person was Tao Shi Gang.</p><br/><p>Lin Fan said that he would give Tao Shi Gang an artwork one day and he had fulfilled his words.</p><br/><p>However, everyone was stunned at the current situation except Lin Fan.</p><br/><p>“What happened?” Tao Shi Gang hugged the artwork tightly in shock. It was as if he had seen a ghost.</p><br/><p>The security officer ran over. “Master Yue Qiu, the artwork… It’s been stolen.”</p><br/><p>“What?” Master Yue Qiu was stunned. “Which drawing? Which one is it?”</p><br/><p>The security officer said, “Your drawing didn’t get stolen. It was the ‘Hundred birds looking up to the Phoenix’ drawing.”</p><br/><p>Yue Qiu Ju Shi’s face turned red and he started to pant heavily. His legs started to tremble as if he couldn’t stand up straight anymore. “Artwork… Artwork… My artwork…”</p><br/><p>Tao Shi Gang and the others were stunned, “Elder Yue…”</p><br/><p>Lin Fan grabbed onto Yue Qiu Ju Shi and pressed a few acupuncture points on his back to relieve him of stress. Then, he consoled him, “Don’t be anxious. It’s okay to lose it as long as you’re safe. I’ll help you to make another one next time.”</p><br/><p>Yue Qiu Ju Shi looked like he was about to cry. “Master Lin, that’s your first ever artwork. It has a deep meaning. I took care of it like a treasure. How could these people steal it? They should have told me if they wanted an artwork. I’d offer them all of mine.”</p><br/><p>“Did anyone manage to get it back?” Yue Qiu Ju Shi shouted at the security officers.</p><br/><p>He was extremely anxious and his forehead was dripping with sweat.</p><br/><p>The security officer replied, “His partners have run away but there’s still a culprit here. I have sealed all the entrances and as long as he’s here, we’ll definitely arrest him.”</p><br/><p>“Quick, go…” Yue Qiu Ju Shi said anxiously.</p><br/><p>Tao Shi Gang and the others tried to console him. They didn’t even know what to say anymore. They hadn’t expected something like that to happen to his art exhibition.</p><br/><p>These criminals were also knowledgeable and they could appreciate Master Lin’s artwork. They could tell that it was the most valuable one.</p><br/><p>Everyone was extremely helpless.</p><br/><p>Lin Fan gently patted Yue Qiu Ju Shi on his shoulder. “Don’t be anxious. I’ll draw another one for you now. It’s not good to be angry.”</p><br/><p>Yue Qiu Ju Shi looked at Lin Fan and wanted to cry. It was an artwork that he loved a lot and sometimes he would even dream about it. However, it was now stolen.</p><br/><p>If he had known about this, he wouldn’t have organized the art exhibition and put this artwork up for display.</p><br/><p>But it was too late to say anything now.</p><br/><p>Lin Fan looked at everyone that remained and they all looked shocked. Then, a man looked towards Lin Fan and realized that Lin Fan was smiling at him mysteriously. His heart shifted. Could he know that I’m one of the accomplices?</p><br/><p>No, it can’t be. Then, the man didn’t want to stay any longer. He lowered his head before leaving the room.</p><br/><p>Lin Fan was secretly laughing in his heart.</p><br/><p>It was worth it…</p><br/><p>On the eighteenth floor of the art exhibition center.</p><br/><p>The lift stopped.</p><br/><p>The man walked out of the lift calmly and walked towards the toilet. He took out a new set of clothes from the dustbin and went into the toilet. When he left the toilet, he became a bearded man.</p><br/><p>Then, he continued to a safe place on the nineteenth floor.</p><br/><p>Haha, you want to catch me? Think again. The man smiled to himself and he thought that he was going to escape.</p><br/><p>They had already been observing the situation when they heard that Yue Qiu Ju Shi was going to organize an art exhibition.</p><br/><p>The Chinese Arts Association had a lot of grandmasters who organized art exhibitions but they knew that some of these artists were scammers. Their artworks were sold via auctions and some of the highest prices were offered by themselves.</p><br/><p>They spent some money on the needed paperwork and were able to raise the price of their artworks. That was what most of them were doing.</p><br/><p>However, these artworks would only be bought by those who didn’t know how to appreciate art. Those that knew how to appreciate art would have already known about the scam.</p><br/><p>However, Yue Qiu Ju Shi was different. His artworks were extremely valuable and he was considered to be a trendsetter in the Chinese Arts Association.</p><br/><p>Especially the price of the ‘Hundred flowers’ drawing which a lot of collectors wanted. It had a high price and everyone knew about it but Yue Qiu Ju Shi didn’t want to sell it. Some of the collectors were thus unhappy but they couldn’t do anything about it.</p><br/><p>Their target had changed to the ‘Hundred birds looking up to the Phoenix’ drawing.</p><br/><p>He came to a secluded window and opened it carefully. There was a rope that was connected to the opposite building.</p><br/><p>Then, he turned behind and smirked.</p><br/><p>“Goodbye, idiots.”</p><br/><p><em>Zoom!</em></p><br/><p>He jumped and vanished.</p><br/><p>On the eighteenth floor of the opposite building.</p><br/><p>Jin Xuan Ming was on the stage and there was a window behind him. He was greeting his fans and talking about what had happened.</p><br/><p>Nothing that he was saying was captivating. However, these hardcore fans were crazy. They probably even thought that the saliva that he was spitting was fragrant.</p><br/><p>He was extremely happy and those fans were completely mesmerized by the story that he had made up.</p><br/><p>The manager stood at the side and translated, “When I just became a celebrity, I had a performance to attend but I was having a 42-degree fever. Still, I overcame the illness with my will and performed because I didn’t want to disappoint my fans…”</p><br/><p>A person probably can’t do anything when he has a 42-degree fever. As long as a person used some brains to think about this stupid story, they’d realize how ridiculous it sounded. However, these hardcore fans couldn’t even tell. They were gasping in shock as if they believed everything he was saying.</p><br/><p>“Oppa, you’re so professional. It’s such a joy to be your fan.”</p><br/><p>“Oppa will always be my male idol.”</p><br/><p>The fans were cheering loudly.</p><br/><p>Jin Xuan Ming sat in the wheelchair and smiled. However, his happiness didn’t last long.</p><br/><p><em>smash</em></p><br/><p>The glass behind him suddenly broke and a man flew inwards. He kicked the wheelchair and Jin Xuan Ming was thrown off.</p><br/><p>“D*mn, why is there someone here?” the man was shocked. It was as if he was still in a daze. Before their mission had started, they had checked on the location and there wasn’t supposed to be anyone there. What was happening? Why were there so many people?</p><br/><p>However, he didn’t care much about it.</p><br/><p>The crowd started to gasp. They were all shocked and the situation became chaotic.</p><br/><p>The man immediately threw a smoke grenade and he took off his clothes in the smoke before escaping.</p><br/><p>“D*mn, the smoke from the smoke grenade is so thick. I can’t even see what’s in front of me.” The man waved his hands and tried to sweep the smoke away.</p><br/><p>“!#@!, !#@!…” a series of Korean words could be heard.</p><br/><p>The man furrowed his brows and realized he was stepping on the hand of a man. He wanted to apologize but he realized that this man was speaking Korean. Then, he got infuriated. “F*cking Korean, I hate Koreans.”</p><br/><p>Then, he immediately kicked Jin Xuan Ming’s face and left hurriedly.</p><br/><p>Jin Xuan Ming fainted and his face was covered in blood. His nose which had gone through plastic surgery became slanted.</p><br/><p>The situation was extremely chaotic and the thick smoke covered the place. Nobody could find Jin Xuan Ming.</p><br/><p>…</p><br/>\n</div>"}