{"title": "Chapter 445 - Give me an explanation!", "id": 445, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-445-give-me-an-explanation", "volume_title": "Volume 5", "body": "<h1>Chapter 445 - Give me an explanation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 445: Give me an explanation!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>Wang Ming Yang couldn’t recall what had happened the previous night. How did that situation end off and how did he get here?</p><br/><p>These questions filled Wang Ming Yang’s mind. If he didn’t clarify these matters, he wouldn’t be at peace.</p><br/><p>There were just too many suspicious points. Why did he sleep naked? It didn’t make sense! Did someone do something to him?</p><br/><p>Just as he was about to open the door, Wang Ming Yang subconsciously touched his butt. It didn’t hurt much. There shouldn’t be a problem.</p><br/><p>He opened the door.</p><br/><p>When Wang Ming Yang saw Lin Fan, he was startled. “Hey, brother, why are you here?”</p><br/><p>Lin fan shook his head, “Sigh, Ming Yang. Do you really not know what happened last night?”</p><br/><p>Wang Ming Yang scratched his head. “I was just about to ask you. What the heck happened last night? Why don’t I remember anything?” Then, he looked at Wu Yun Gang and asked, “Yun gang, I was fine yesterday, right?”</p><br/><p>Wu Yun Gang just stood there and didn’t say a word. He shook his head regretfully.</p><br/><p>“Why are you shaking your head?” Wang Ming Yang couldn’t understand it. What did that head-shaking mean? What exactly had happened to him? Could something have really happened?</p><br/><p>Wun Yun Gang sighed, “You should ask Master Lin regarding this matter. I shan’t speak about it.”</p><br/><p>Wang Ming Yang looked at Lin Fan and deep in his heart, he felt that something wasn’t right. He couldn’t help but be worried. “Could it be that something really happened?”</p><br/><p>Lin Fan nodded regretfully as well. “Ming Yang, I couldn’t tell. I really couldn’t tell. I never thought that after drinking, you actually like to take off your clothes and expose your body in front of others. That situation was a little terrifying. If we hadn’t stopped you in time, you would have really stripped yourself completely naked.”</p><br/><p>When he heard the first part, Wang Ming Yang felt that it wasn’t quite right. However, when he heard the back part, his whole face turned white.</p><br/><p>“That can’t be true, right?” Wang Ming Yang’s throat moved slightly as he asked fearfully.</p><br/><p>“Ask yourself that question,” said Lin Fan in a disdainful tone. “If it’s not true, then why were you butt naked when you woke up? However, you don’t need to worry too much. We didn’t let you embarrass yourself in public. Yun Gang and I dragged you back immediately. I even have a video that I will be sending to you. Later on, go take a look for yourself. After watching it, tell me your thoughts.”</p><br/><p>Lin Fan, of course, couldn’t hand his phone over to Wang Ming Yang. This was to prevent him from deleting the original video after watching it. That would make his efforts from the previous night a waste.</p><br/><p>Wang Ming Yang took out his own phone. When he played the video, noises came from the phone that sounded like ghosts wailing and wolves howling. This voice was rather familiar too. When he saw the face of the person in the video, he was flabbergasted.</p><br/><p>“F*ck, how could this be? How could I become like that? Oh god, my reputation!” Wang Ming Yang had gotten completely dumbfounded. If this video was spread, he would be laughed at.</p><br/><p>Not many people might have known him in Beijing but it was different in Shanghai. It might even go on the headlines.</p><br/><p>He could even imagine what the headline would be.</p><br/><p>‘Billionaire makes a scene after getting drunk…’</p><br/><p>…</p><br/><p>Wang Ming Yang put down his phone and remained stunned for another two seconds before yelling, “No, hurry up and delete this video! Don’t ever let it leak out, otherwise, my reputation will be ruined!”</p><br/><p>Lin Fan immediately guarded his phone and smiled, “I can’t. I have to save this video. In future, I’ll let you watch it again when I have the chance. Deleting this video is not possible.”</p><br/><p>“F*ck! We’re brothers! How could you do this? Hurry up and delete it, I’m begging you! This is too dangerous!” Wang Ming Yang was on the verge of crying. He never thought that he had been like that the previous night. It wasn’t right! How could he be someone like that?</p><br/><p>Lin Fan laughed, “Stop dreaming. But honestly, did you go crazy yesterday? Why did you drink so much? Didn’t you know that those guys were messing with you on purpose?”</p><br/><p>Wang Ming Yang was a little embarrassed. “This…this… Actually, I didn’t expect things to turn out this way but those guys had authority. If I didn’t give them any face, the jointly-organized event by Yun Gang and I would be very difficult.”</p><br/><p>Lin Fan patted Wang Ming Yang on the shoulder. “Alright, it would be very difficult eh? Last night, if Yun Gang hadn’t called me, I probably would have had to bury your corpse. That’s enough talking for now. Go and rest for a while. I have to go out for a bit. I’m going back to Shanghai tomorrow. How long are you going to stay here?”</p><br/><p>“You’re leaving so soon?” Wang Ming Yang asked in a surprised tone.</p><br/><p>“Do you think I have nothing to do like you? Cloud Street is about to collapse without me. If I don’t hurry back, something will really happen.” Just thinking about the situation at Cloud Street gave Lin Fan a headache. While he had been at Beijing, no scallion pancakes had been sold. Those townsfolk came every day but didn’t see him. They might even soon develop intentions to kill him.</p><br/><p>“I’m going out for a bit. Go and rest. As for this video, I’ll take care of it for now. In future, I’ll decide whether or not to delete it based on your performance,” said Lin Fan as he waved his hand.</p><br/><p>Wang Ming Yang asked, “Where are you going?”</p><br/><p>Without turning back, Lin Fan replied, “Returning a favor for you. If I had known that you would cause so much trouble, I would never have followed you here to Beijing. But there’s no choice since you’re my brother. You’re like an insect that I just can’t get rid off.”</p><br/><p>When Wang Ming Yang heard this, he exploded, “F*ck, I’m an insect? How am I following you? But who are you returning a favor to anyway? Why don’t I know about this?”</p><br/><p>“Hey, hey, we haven’t finished talking. At least give me a rough explanation! At least let me understand the situation a little!”</p><br/><p>Wang Ming Yang saw watched as Lin Fan walked away without turning back. He sighed helplessly, then, he looked over at Wu Yun Gang and said, “Yun Gang, what exactly is going on?”</p><br/><p>“Sigh…” Wu Yun Gang sighed as well, expressing his helplessness.</p><br/><p>Wang Ming Yang couldn’t understand it and his heart was not at peace at all. “Don’t sigh! Hurry up and explain things to me.”</p><br/><p>Wu Yun Gang looked at Lin Fan and lost his desire to speak. Then, he sighed once more, “Sigh, it’s hard to speak. Ming Yang, just listen to me. Don’t ask anymore. It’ll always be better not to know. I’m afraid that you might not be able to take it.”</p><br/><p>“F*ck…” The more Wu Yun Gang behaved like that, the more curious Wang Ming Yang got. What the heck had happened? These two guys were acting way too mysteriously. Even if he had embarrassed himself, they still should have told him the full situation. If they just stayed mysterious like this and didn’t say anything, how the heck would he know?</p><br/><p>However, he had a rough understanding of what had happened. The previous night’s happenings were probably not simple.</p><br/><p>Those three ‘Young’-whatever, didn’t seem like simple people at all. And since Wu Yun Gang had called Lin Fan to bring him back, it was clear that that situation had developed to stage that even Wu Yun Gang couldn’t handle.</p><br/><p>However, something still wasn’t right. Other than Wu Yun Gang, who else did Lin Fan know from Beijing?</p><br/>\n</div>"}