{"title": "Chapter 442 - I'll give it back to all of you", "id": 442, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-442-ill-give-it-back-to-all-of-you", "volume_title": "Volume 5", "body": "<h1>Chapter 442 - I'll give it back to all of you</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 442: I’ll give it back to all of you</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>As Jin Sheng Wen’s sister-in-law, she had some of her sister’s power and that was why she could manage everything at Tian Yun Villa. Furthermore, there was an untold story between her brother-in-law and her.</p><br/><p>She had been a normal villager but she gradually became in power. She had gone through a lot of difficulties to reach her current status.</p><br/><p>Also, she was extremely good at analyzing things and she could find out about things just by observing.</p><br/><p>She could tell that something had happened by looking at her brother-in-law’s face. Her brother-in-law was stunned. It wasn’t because the other party was extremely rich; her brother-in-law wouldn’t be fearful of that. That could only mean that the other party was extremely powerful and influential.</p><br/><p>The man standing at the entrance had taken out a small book and she didn’t know what it was but after her brother-in-law saw it, he looked terrible. It was definitely something that he was fearful of.</p><br/><p>Lil’ Wang hated things like this. After being with Elder Zheng for so long, he knew that this was something Elder Zheng hated the most too. That was when the younger generation played dirty tricks based on connections which were established by the older generations.</p><br/><p>Master Lin was still reprimanding Young Master Jiang and he felt that it was a job well done.</p><br/><p>“I told you to stand straight. Do you understand what that means?” Lil’ Wang glared at Jin Sheng Wen and said.</p><br/><p>Jin Sheng Wen was one of the most influential people in Beijing and he hadn’t been commanded like that before. However, he couldn’t do anything because the backing of the person in front of him was ten or even a hundred times more powerful than him.</p><br/><p>Then, Jin Sheng Wen stood there firmly and looked more serious than ever.</p><br/><p>However, he was extremely curious about the identity of the man inside to have such a strong backing. For someone to have such a strong backing in Beijing, he had to be extremely well-known.</p><br/><p>Meanwhile, Young Master Jiang and the others were part of the younger generation in Beijing and they definitely didn’t know who these people were. However, the current situation was that Young Master Jiang was the one being reprimanded. It showed how ignorant he was.</p><br/><p>“Brother Wen, what are you doing? Why aren’t you going inside to save Young Master Jiang?” Young Master Zhao and the others were anxious. Something had happened in Brother Wen’s territory but he wasn’t doing anything about it. What exactly was happening?</p><br/><p>Sister Yan silently nudged Young Master Zhao and the others and shook her head. She wanted them to not ask too many questions. She already understood what was happening. Her brother-in-law was behaving himself because he couldn’t afford to offend the person inside.</p><br/><p>Young Master Zhao and the others were frequent guests of Tian Yun Villa. Naturally, she couldn’t let them be involved in this.</p><br/><p>Young Master Zhao and the others weren’t fools. They gradually knew what was happening after looking at how the situation had changed.</p><br/><p>However, it was impossible. They hadn’t even recognized the person earlier. How powerful could he be? He had managed to stop everyone. Even Jin Sheng Wen was standing there and could do nothing about it.</p><br/><p>In the private room.</p><br/><p>“Jin Sheng Wen, f*ck your mom. I’m having trouble in your territory and you’re not even coming in. Remember this. I’ll definitely teach you a lesson!” Young Master Jiang shouted from the private room.</p><br/><p>He was indeed furious. He hadn’t expected Jin Sheng Wen to treat him like this.</p><br/><p>However, he knew that based on his own ability, he couldn’t do anything to Jin Sheng Wen. However, he was furious and scolding Jin Sheng Wen was all he could do.</p><br/><p>Jin Sheng Wen stood there motionlessly and expressionlessly. He couldn’t get involved in this and he didn’t want to be involved at all. If the identity of the other party was true, then he wouldn’t be capable of going against him at all.</p><br/><p>Going against people like him would definitely cause Jin Sheng Wen to lose his entire empire in a night and he might even end up in jail and lose all his possessions. His years of hard work would disappear overnight.</p><br/><p>Lin Fan was furious and he had not even vented all his anger yet. He looked at Young Master Jiang who was crippled on the ground and he kicked him aside. Then, he went out. Young Master Jiang was the mastermind but the others could forget about running away as well.</p><br/><p>Lil’ Wang moved aside. “Master Lin, is it resolved?”</p><br/><p>Lin Fan waved his hand. “No. It will be soon though.”</p><br/><p>Wu Yun Gang quickly went forward when he saw Master Lin. He was amazed by what he saw. He understood that Master Lin was an extraordinary person.</p><br/><p>The person standing at the door was Master Lin’s acquaintance and he had taken out something that frightened Jin Sheng Wen so much that he stood still.</p><br/><p>“Master Lin,” Wu Yun Gang wanted to tell him something but was interrupted by Lin Fan. “Take good care of Ming Yang, leave this to me.”</p><br/><p>Then, he looked at Young Master Zhao and the others. He pointed and said, “All of you, come in now.”</p><br/><p>The three of them glanced at each other and thought of how miserable Young Master Jiang looked. Then, they were extremely anxious and didn’t dare to enter.</p><br/><p>Lin Fan immediately dragged two of them by the neck into the private room. When Young Master Ma saw that, he quickly ran away.</p><br/><p>However, Lin Fan didn’t notice that at all.</p><br/><p>When Young Master Zhao and Young Master Huang entered the private room and saw the state of Young Master Jiang, they were trembling in fear. They wondered how much he had tortured Young Master Jiang for him to end up like this. The room was filthy; it was filled with alcohol and vomit.</p><br/><p>The two of them stood there and looked at each other in fear.</p><br/><p>“Kneel down,” Lin Fan said.</p><br/><p>Young Master Zhao and Young Master Huang swallowed their saliva forcefully. They realized that the person in front of them looked extremely fierce and they didn’t dare to go against him. They immediately kneeled down.</p><br/><p>Lin Fan immediately placed two bottles of wine in front of the two of them and pointed. “Drink, I’m toasting the both of you.”</p><br/><p>Young Master Zhao raised his head and said weakly, “It’ll kill us.”</p><br/><p>“Drink,” Lin Fan stood up and said sternly, “It must have felt great bullying my friend, right? Now, it’s my turn to bully all of you. Drink and remember that nobody gets to reject the toast of Lin Fan.”</p><br/><p>The two of them looked at each other and didn’t drink it. “Don’t go overboard, we…”</p><br/><p>“Alright, since you don’t want to drink, I’ll feed the both of you. But I wonder if you will end up like him,” Lin Fan said. He didn’t want to let go of anyone who bullied Wang Ming Yang.</p><br/><p>He would do everything it took to return the favor, even if it was ten or a hundred times worse.</p><br/><p>That was Lin Fan’s way of protecting his friends.</p><br/><p>The others could try to convince him to not do anything but it didn’t matter who tried to beg him. He wouldn’t let go of anyone that bullied his friends.</p><br/><p>Young Master Zhao and Young Master Huang were helpless. Although they weren’t the most powerful individuals in Beijing, they could be said to be lawless youngsters. If someone were to tell them that they’d encounter such a situation, they probably wouldn’t believe it.</p><br/><p>They definitely would never believe that.</p><br/><p>However, that was exactly what was happening and they had to give in.</p><br/><p>Lin Fan took a bottle of wine and walked out. “Remember, finish every single drop and if I find out that you guys poured any of it away, I’ll prepare another bottle for you.”</p><br/><p>The two of them looked at Lin Fan and they were shocked.</p><br/><p>Their voices started to tremble, “We won’t, we won’t…”</p><br/>\n</div>"}