{"title": "Chapter 447 - Shocked!", "id": 447, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-447-shocked", "volume_title": "Volume 5", "body": "<h1>Chapter 447 - Shocked!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 447: Shocked!</p><br/><p>Translator: Sparrow Translations Editor: Sparrow Translations</p><br/><p>It wasn’t that Elder Zheng’s grandson’s appearance was stunning but the angle at which one of his legs was bent wasn’t quite right.</p><br/><p>“Elder Lin, this is my grandson, Lil’ Bao. Lil’ Bao, greet Uncle Lin.” Elder Zheng picked his grandson up from his wheelchair as he grinned cheerily.</p><br/><p>“Uncle Lin,” Lil’ Bao blinked a few times before greeting him innocently.</p><br/><p>Lin Fan smiled as he touched Lil’ Bao’s head. “Good boy.”</p><br/><p>“Xiu Fang, Master Lin is around today so you have to prepare some good dishes,” said Elder Zheng with a smile. He was in a good mood today. He had gotten what he wanted. That painting really made him very satisfied. Compared to Yue Qiu Ju Shi and Tao Shi Gang’s paintings, it was definitely much better.</p><br/><p>“Alright, alright.” Elder Zheng’s wife smiled. There were very few young people who could impress her husband. And there was probably no other youngster whom he would invite to stay for a meal.</p><br/><p>Hence, even if she didn’t understand what was so special about this young man, she liked him very much because he made Elder Zheng happy.</p><br/><p>Lin Fan waved his hand and said, “Elder Zheng, no need to trouble yourselves. I won’t be having a meal here.”</p><br/><p>“What trouble would it be? Just having a meal is no trouble at all. The two of us can have a nice chat. Later on, we’ll give them a call as well. We need to get them to send you the Association’s certificate,” said Elder Zheng with a smile.</p><br/><p>Lin Fan decided not to say too much. He nodded and said, “Alright then, I shan’t be too courteous.”</p><br/><p>Elder Zheng instantly laughed, “That’s more like it.”</p><br/><p>When Elder Zheng’s wife heard this, she immediately got to work. She left Lil’ Bao to Elder Zheng’s care.</p><br/><p>Lin Fan kept observing Lil’ Bao’s leg. One of his legs had a bend between the thigh and the calf. It was similar to someone with ‘pigeon-toes’. However, it was much more severe. It affected his walking. His other leg, however, was perfectly normal.</p><br/><p>Elder Zheng noticed that Lin Fan kept looking at his grandson’s leg, so he said, “Sigh, this kid has been like this since birth. Now the doctors are saying that his inner-nerves have been damaged. As for the complete explanation, I don’t remember too clearly but with the current medical standards, the chance of recovering from this is quite small.”</p><br/><p>Lin Fan nodded. This kind of situation had gone on for so many years. With Elder Zheng’s power, he probably had already looked for the world’s best doctors. But for his grandson to still be like this, it must have been because there was no way to treat it. Otherwise, this problem wouldn’t have dragged on for so long.</p><br/><p>“Elder Zheng, allow me to feel his leg for a moment,” said Lin Fan.</p><br/><p>“Alright.” Elder Zheng didn’t think too much of it. This kind of situation was common. For example, when Yue Qiu Ju Shi and Tao Shi Gang came to visit his place, they had similar requests as well.</p><br/><p>It was a pain for this child.</p><br/><p>Lin Fan touched Lil’ Bao’s leg and the area around his knee joint. An idea gradually formed in his mind. Then, he casually said, “Elder Zheng, I’m going to buy something with Lil’ Wang. I’ll be back in a bit.”</p><br/><p>“But what? You can just send Lil’ Wang to buy it,” said Elder Zheng with a smile.</p><br/><p>“No need. He wouldn’t know. Only I know about it.” Lin Fan waved his hand. It was better not to say too much.</p><br/><p>After all, saying too much wouldn’t do any good. It would even cause an ill-feeling in Elder Zheng’s heart.</p><br/><p>He had seen the world’s best doctors and still couldn’t treat him. What could this young man possibly do? Hence, it was best to stay subtle about it.</p><br/><p>Lil Wang had been on standby in the residence the whole time. When Lin Fan said he wanted to buy something, he drove the car over.</p><br/><p>“Elder Lin, don’t come back too late. Don’t take too long,” urged Elder Zheng.</p><br/><p>Lin Fan nodded, “Alright. I’ll be quick.”</p><br/><p>In the car.</p><br/><p>Lil’ Wang asked, “Master Lin, where do you want to go?”</p><br/><p>Lin Fan smiled and replied, “Go to the nearest Chinese medical hall.”</p><br/><p>Lil’ Wang nodded without asking much. He immediately started the car and drove off. Although Master Lin was young, he was highly regarded by Elder Zheng. Hence, his attitude towards Master Lin was one of respect. He wouldn’t underestimate him because of his age. If he did that and it got discovered by Elder Zheng, Elder Zheng would be extremely disappointed in him.</p><br/><p>“Old man, where’s that Lil’ Lin?”</p><br/><p>Elder Zheng said, “He went with Lil’ Wang to go and buy something. He’ll be back soon. I have to go contact Elder Tao and the rest. You do your work first.”</p><br/><p>…</p><br/><p>At the urban district.</p><br/><p>Lil’ Wang stopped his car. “Master Lin, that’s the shop. The one in front.”</p><br/><p>Lin Fan nodded, “Alright, wait for me for a while. I’ll be back very soon.”</p><br/><p>“No problem. Take your time, Master Lin. As long as we go back before lunch, it’s fine.” said Lil’ Wang.</p><br/><p>When he saw Master Lin enter the shop, Lil’ Wang started to think. He wondered what Master Lin wanted to do in a Chinese medical hall. But after thinking for a long while, he still couldn’t think of any reasons.</p><br/><p>In the Chinese medical hall.</p><br/><p>Lin fan looked at the things at the counter. In his mind, he was thinking about Lil’ Bao’s condition.</p><br/><p>This kind of condition was a little complicated. Of course, it was only complicated if he didn’t have the Encyclopedia’s mystical boost. But with the mystical powers, it was not a problem at all.</p><br/><p>It was just that the procedures required were a little bit complicated.</p><br/><p>“Boss, please get me these,” said Lin Fan after thinking it through.</p><br/><p>“Alright.”</p><br/><p>…</p><br/><p>Soon after.</p><br/><p>Lin Fan exited the shop. There was nothing in his hands. When he entered the car, Lil’ Wang gazed at Master Lin, not knowing what he had bought.</p><br/><p>“Master Lin, did you not manage to get what you needed? We can go somewhere else to look,” said Lil’ Wang warmly.</p><br/><p>Lin Fan waved his hand and smiled. “No need. I’ve already bought it.”</p><br/><p>Lil’ Wang took once more surprised glance at Lin Fan. If he had bought it already, then where was it? But after thinking for a while, he thought it was better not to think too much about this.</p><br/><p>Lin Fan naturally couldn’t hold the item in his hands. He had hidden it inside his clothes pocket so that it wouldn’t be discovered. If it was to be discovered, it would be troublesome.</p><br/><p>To Lin Fan, helping to treat illnesses felt pretty good.</p><br/><p>He thought to himself that when he went back, he had to work hard to complete the task.</p><br/><p>He had been stuck at this task for some time now. If he still didn’t complete it, he would become useless soon.</p><br/><p>At Noon!</p><br/><p>Lunchtime.</p><br/><p>Tao Shi Gang, Yue Qiu Ju Shi and a few other masters had gathered over there. When they had arrived early and had nothing to do, Elder Zheng purposely brought them over to his study room to look at the newly-made painting by Lin Fan. He was clearly showing it off.</p><br/><p>When Tai Shi Gang and Yue Qiu Ju Shi saw this large painting, they were astounded. It was a painting that comprised of mountain streams, flowers, birds, and people.</p><br/><p>They didn’t even have something like this and they never expected Elder Zheng to obtain it. How could they not have been jealous?</p><br/><p>Then, Lin Fan noticed that everyone looked at him in a slightly different light now.</p><br/><p>During the meal, everyone chatted very cheerily.</p><br/><p>But on that day, it seemed that Elder Zheng’s alcohol tolerance was very low. He only drank just a little. Clearly, it was because he was in his own home and it was only noon, so he exercised some restraint.</p><br/><p>After Lil’ Bao had been fed, he was carried upstairs to sleep.</p><br/><p>Lin Fan saw that it was about time. He got up and used the excuse of going to the toilet to go upstairs.</p><br/><p>It was roughly twenty minutes before he came back downstairs. However, he didn’t draw any attention. Meanwhile, Elder Zheng’s wife was in the kitchen preparing dishes as well so she didn’t notice.</p><br/><p>…</p><br/><p>After the meal.</p><br/><p>“Elder Zheng, we’ll be leaving first,” said Lin Fan with a smile.</p><br/><p>Elder Zheng replied cheerfully, “Alright. Elder Lin, the next time you’re in Beijing, be sure to give me a call.”</p><br/><p>Lin Fan nodded with a smile. This Elder Zheng was very hospitable. Although they had only known each other for a while, their relationship felt close.</p><br/><p>Everyone left the place.</p><br/><p>Elder Zheng sat on the sofa and couldn’t help but laugh, “Wife, today has been a happy day.”</p><br/><p>The wife tidied up the dining table. She said with a smile, “It’s good that you’re happy…”</p><br/><p>“Grandpa, Grandma…I want to pee.” At that moment, a series of voices came from upstairs.</p><br/><p>“Lil’ Bao, Grandpa is coming,” replied Elder Zheng.</p><br/><p>But at that moment.</p><br/><p>Elder Zheng, who had already stood up, took one more look in front and was completely stunned.</p><br/><p>“Grandpa, Lil’ Bao wants to pee,” yelled Lil’ Bao in a daze.</p><br/><p>The wife said, “Old man, what are you standing there for? Hurry up and…”</p><br/><p>Suddenly.</p><br/><p>Xiu Fang’s hands stopped moving. Her gaze fell on that little silhouette by the staircase. The bowls and chopsticks in her hands fell onto the ground.</p><br/>\n</div>"}