{"title": "Chapter 459 - Act first, report afterward", "id": 459, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-459-act-first-report-afterward", "volume_title": "Volume 5", "body": "<h1>Chapter 459 - Act first, report afterward</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The next day!</p><br/><p>At Shanghai’s First Chinese Medical Academy.</p><br/><p>A long-distance bus had stopped at the entrance of the academy. As the director, Zhao Ming Qing was waiting at the entrance.</p><br/><p>At the same time, there was a pair of students standing beside Zhao Ming Qing, one male and one female. The male was Qiu Jie, 24 years of age. He was in year 4 and he was about to graduate. However, he was prepared to continue studying and following an experienced Chinese doctor.</p><br/><p>The other student was about the same age as Qiu Jie. She looked delicate and pretty although she wasn’t considered a beautiful lady.</p><br/><p>The two of them stood beside Director Zhao and their eyes were filled with anticipation for their journey.</p><br/><p>Zhao Ming Qing felt a little helpless. He didn’t expect to not even have five students gathered together. If it were to continue like this, perhaps the academy might really have to close down.</p><br/><p>The students there weren’t focused on their studies anymore.</p><br/><p>“Director, are we waiting for anyone else?” Qiu Jie asked.</p><br/><p>He was respectful to the director and his greatest hope was to be Zhao Ming Qing’s disciple. However, he didn’t have the courage to ask because Director Zhao seemed so powerful and he was just a poor student. What rights did he have?</p><br/><p>“Mmm, relax. We’ll go soon,” Zhao Ming Qing replied. He was happy to see these two students. They were the only two students that were willing to join. It showed that they loved Chinese medicine.</p><br/><p>Actually, he could have forced the students to join but he felt that there wasn’t a need to do so. Furthermore, this career required perseverance and passion. They had to love their job and constantly want to learn more knowledge</p><br/><p>The students that walked past were discussing what was happening at the entrance.</p><br/><p>“How pathetic, there are only two participants. Isn’t it humiliating for the director?”</p><br/><p>“Who can be blamed? This kind of voluntary medical work is extremely tough. They’d be out in the sun most of the time.”</p><br/><p>“My class teacher asked if anyone wanted to join. Although he sounded a little forceful, nobody bothered about him.”</p><br/><p>“Ours too. We’re not even afraid of losing the graduation certificate. Why would we be afraid of our teacher forcing us? I know those two people are the top two students in school. The second student had double the score of the third student. I heard the third student is preparing to go overseas for Western medicine. He didn’t get a score that was good enough to enter the school previously. However, he used Chinese medicine as a stepping stone to enter.”</p><br/><p>“Let’s not stand at the entrance. If the director sees us and catches us, we’d be miserable.”</p><br/><p>“Yeah, yeah. Let’s disperse.”</p><br/><p>To the students, this type of activity was a total waste of time. Although it was organized by the director, they weren’t interested. They’d rather use the time to do other things like surfing the Internet and go shopping with their girlfriends.</p><br/><p>Then, a car stopped outside the entrance.</p><br/><p>Lin Fan alighted the car and waved to Zhao Ming Qing. Zhao Ming Qing went forward, “Teacher…”</p><br/><p>“How many people are there?” Lin Fan asked.</p><br/><p>Zhao Ming Qing answered embarrassedly, “There are only two.”</p><br/><p>Lin Fan didn’t expect it to be like that. Then, he waved his hand casually, “It’s okay, I’m fine with two. If there are too many people, it would be difficult to handle. Let’s go to Jiangning.”</p><br/><p>“Alright.” Zhao Ming Qing didn’t want to ask much. He just followed where his mentor told him to go.</p><br/><p>There were tools and accessories on the big bus and it was what they needed during treatments and consultations.</p><br/><p>Qiu Jie and Zhang Tong Tong looked at the young man and realized he was about the same age as them. However, it seemed like he was close to the director. They wondered what was the relationship between the two of them. Could he be from the school too?</p><br/><p>However, it didn’t seem like anyone in school drove a Mercedes.</p><br/><p>…</p><br/><p>Cloud Street.</p><br/><p>Fraud Tian looked at the time and it was already 8.30 am but Lin Fan wasn’t there yet. Then, he thought of what had happened a few days ago and felt that something was wrong.</p><br/><p>Then, townsfolk started to gather at the entrance of the shop.</p><br/><p>As it was only 8.30am, the townsfolk weren’t anxious. They just stood outside and chatted.</p><br/><p>“I wonder how many pieces Little Boss is going to sell today. Will it still be twenty?”</p><br/><p>“Of course. Little Boss is so kind. He’ll definitely sell twenty pieces.”</p><br/><p>“Don’t talk about it. You managed to buy it two days in a row. We’re so envious of you.”</p><br/><p>“Haha, can’t help it. I’m too lucky.”</p><br/><p>“In the past, ten scallion pancakes were not enough and Little Boss suddenly became so kind to increase it by ten. We’re so blessed.”</p><br/><p>“Fraud, are you sick? Why do you look so pale?”</p><br/><p>Fraud Tian lowered his head and looked at the time. Then, he waved his hand, “No, no. I’m just wondering why he isn’t here yet.”</p><br/><p>“Why are you so anxious? It’s only 8.30 am. Little Boss only comes around 9. Let’s just wait for a while.”</p><br/><p>Fraud Tian’s heart was beating extremely quickly. He felt that something was wrong.</p><br/><p>Their so-called ‘kind Little Boss’ might not be that kind after all.</p><br/><p>Something was definitely fishy.</p><br/><p>He was lazy to even make ten pieces of scallion pancakes. There wouldn’t be any reason for him to make twenty. It couldn’t have been because he was kind.</p><br/><p>Ding ding!</p><br/><p>Then, Fraud Tian saw Lin Fan’s phone call.</p><br/><p>Suddenly, he felt that this call seemed fishy.</p><br/><p>However, he had to pick it up.</p><br/><p>“Hello, Fraud, I won’t be coming to the shop for a period of time. Let the townsfolk know about it…” Before Lin Fan could finish, he was suddenly interrupted by Fraud Tian.</p><br/><p>“Where are you now?”</p><br/><p>Lin Fan said, “I’m in the car, leaving Shanghai soon.”</p><br/><p>“What the f*ck!” Fraud Tian felt like collapsing. It happened again. He knew that this fella wouldn’t be so kind all of a sudden. Everything was planned. He was simply acting first and reporting it afterward. He wanted to tell everyone after he left so that Fraud would be the one picking up after his mess.</p><br/><p>“Alright, let’s not talk about it. I didn’t have a good sleep last night. Please help me settle the things at the shop. I’ll be back in about twenty days,” Lin Fan said.</p><br/><p>*beep*</p><br/><p>The phone call ended.</p><br/><p>Fraud Tian held onto the phone and didn’t know what to say. Then, he looked at the townsfolk and swallowed his saliva forcefully. He felt so miserable.</p><br/><p>“I hate you…”</p><br/><p>In the car.</p><br/><p>Lin Fan smiled. He couldn’t have mentioned where he was going. Otherwise, he wouldn’t be allowed to leave.</p><br/><p>He left the things to Fraud Tian as he believed that he would be able to handle it well.</p><br/><p>He opened up Weibo.</p><br/><p>“Jiang Ning, I am coming…”</p><br/><p>There were comments in an instant.</p><br/><p>“Little Boss, quickly come back. You’re so heartless.”</p><br/><p>“Little Boss, quickly come back. You’re so heartless.”</p><br/><p>…</p><br/><p>Suddenly, everyone in the comments posted that.</p><br/><p>“D*mn, I got discovered so quickly.” Lin Fan felt helpless. He had already left and there was no way he could return.</p><br/><p>He wanted to quickly finish the task.</p><br/><p>Wait for me, the eleventh page of Encyclopedic Knowledge.</p><br/><p>“Teacher…” Zhao Ming Qing called.</p><br/><p>When Qiu Jie and Zhang Tong Tong heard that, they were stunned. It was as if they had heard it wrong.</p><br/><p>Lin Fan didn’t reply Zhao Ming Qing. He just smiled, “Your director is my student. I organized this trip. The two of you have to learn and give your best.”</p><br/><p>The two of them were stunned speechless.</p><br/><p>It was too shocking.</p></div>\n</div>"}