{"title": "Chapter 456 - Little fish takes the bait!", "id": 456, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-456-little-fish-takes-the-bait", "volume_title": "Volume 5", "body": "<h1>Chapter 456 - Little fish takes the bait!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Sister Hong said with a face of astonishment, “Little Boss, those words you said to Elder Chen at the hospital were all true?”</p><br/><p>“What words?” asked Lin Fan with a grin.</p><br/><p>Elder Zhang couldn’t help but chip in, “You said that if you treated him, he would be able to get discharged the next day. Those words.”</p><br/><p>They were already in so much shock that they didn’t know what to say. They just felt that everything seemed too unreal. This amazing Little Boss, who sold scallion pancakes and read fortunes, could now treat illnesses as well. Moreover, it wasn’t just any illness.</p><br/><p>When they heard about this, their minds were blown.</p><br/><p>“It’s true,” replied Lin Fan. This was a very simple matter but Elder Chen didn’t trust him. This left him with no choice. Anyway, it didn’t have a large impact. He could just let the hospital treat him.</p><br/><p>Because Shanghai was a large city, the medical expertise in this hospital was quite good. The level of expertise they had couldn’t be compared to hospitals in county-level cities or third-rate cities.</p><br/><p>Elder Liang chuckled, “This Elder Chen just missed out on a great opportunity.”</p><br/><p>Sister Hong shook her head helplessly, “Sigh, I used to wonder why Little Boss told us back then to look for him if there was anything wrong with our bodies. So this was the reason.”</p><br/><p>Lin Fan smiled, “As the saying goes, don’t let your own fertile water flow into others’ fields. We are all family. If there were any problems with your healths, I surely would not spare any effort to treat you all. But don’t think too much about this matter. In future, if you have any health issues, come and look for me. However, this is only limited to you and your family members.”</p><br/><p>“Haha,” everyone started laughing, “Why do we feel like the greatest fortune that we’ve attained in our lives is getting to know Little Boss?”</p><br/><p>Lin Fan said brazenly, “That is indeed a fortunate thing.”</p><br/><p>The shop owners exchanged a few more words before Zhao Ming Qing came over. “Teacher, these two are my old friends, Zhou Qing Quan and Wang Tian Feng.”</p><br/><p>Lin Fan looked at the two of them and smiled, “Nice to meet you. Let’s chat over there.”</p><br/><p>Zhou Qing Quan and Wang Tian Feng looked at Lin Fan and couldn’t help but sigh in their hearts. He’s young. He’s really too young. If it wasn’t for Elder Zhao, they would never have dared to believe this.</p><br/><p>But even Elder Zhao didn’t believe it at first. If he hadn’t been tied to the tree by his teacher back then, this would never have happened.</p><br/><p>At the resting area by the side.</p><br/><p>Zhou Qing Quan said warmly, “Master Lin, we keep hearing from Elder Zhao about you. Elder Zhao really admires and respects your medical expertise to no end. I was also fortunate enough to see one or two pages of that ‘Various Types of Typhoid’. Although it was only one or two pages, I really feel that your medical expertise far exceeds ours by a large margin.”</p><br/><p>Lin Fan looked at Zhou Qing Quan, then at Zhao Ming Qing. He felt that these two guys probably wanted to see him because they had seen Zhao Ming Qing’s copy of the ‘Various Types of Typhoid’.</p><br/><p>“President Zhou, Vice-President Wang, you want a copy of it?” asked Lin Fan.</p><br/><p>Zhao Ming Qing said, “Teacher, don’t listen to them. That’s just the way they are.”</p><br/><p>Zhao Qing Quan was slightly startled, “This…this…” It wasn’t easy to reply him. However, Lin Fan had said it so bluntly that they had to reply. “Master Lin, this ‘Various Types of Typhoid’ is a great medical writing. We would definitely be interested.”</p><br/><p>Zhao Ming Qing got angry. “Elder Zhou, you two are too cunning. I’m giving you an introduction but you two just want ‘Various Types of Typhoid’ from my teacher.”</p><br/><p>Lin Fan was silent as he thought about something in his heart. If this ‘Various Types of Typhoid’ was to be distributed and Chinese doctors from everywhere were able to read it and understand its information, then Lin Fan would surely earn Encyclopedic Points.</p><br/><p>When he thought about this, Lin Fan’s face became serious as he said, “Ming Qing.”</p><br/><p>“Teacher,” responded Zhao Ming Qing.</p><br/><p>“Our Chinese medicine has been declining because we’ve valued it too much as our own. Sooner or later, ‘Various Types of Typhoid’ has to be distributed to the masses to benefit Chinese medicine. When you go back, photocopy the original version for them and let them bring it back with them,” said Lin Fan.</p><br/><p>When Zhou Qing Quan and Wang Tian Feng heard this, they were extremely excited. Then, they looked at Lin Fan and praised him with a changed tone, “Master Lin, your moral values in medicine are truly unmatched. We respect you. If you don’t mind, why don’t you join the Chinese Medical Association?”</p><br/><p>Wang Tian Feng added, “If Master Lin joins the Chinese Medical Association, I, Wang Tian Feng, am willing to give you my appointment as Vice-President.”</p><br/><p>An appointment as Vice-President was really not low.</p><br/><p>Zhao Ming Qing nodded. He was content. On this condition, it was worth giving up the great medical writing, ‘Various Types of Typhoid’. However, he knew that his teacher had a habit of staying ordinary. He didn’t care much for such things and was probably going to reject the offer.</p><br/><p>Lin Fan was delighted. Yet another appointment as Vice-President of an association. How fun.</p><br/><p>“Alright, since it’s like this, it’s not nice for me to reject the offer. Joining the Chinese Medical Association and doing my part for Chinese medicine is a responsibility of mine. I shall accept the appointment as Association Vice-President,” Lin Fan accepted with no hesitation.</p><br/><p>By joining three associations, he received a significant pay each month. It would be pointless not to accept it so he chose to join.</p><br/><p>Zhou Qing Quan started smiling, “Elder Wang, you don’t have to give up your place as Vice-President. It’s very normal to have two Vice-Presidents. Master Lin, please wait for us to go back to Beijing before we prepare the documents. We’ll do it as soon as possible.</p><br/><p>Lin fan waved his hand, “There’s no rush. However, do study ‘Various Types of Typhoid’ properly. You can even pass it on to other people who are interested in Chinese medicine.”</p><br/><p>Zhou Qing Quan was moved by Lin Fan’s moral principles.</p><br/><p>He thought to himself, “Look, this is what it means to be a Master. Such a masterpiece and he so casually shares it with us without asking for anything in return. His only request is for it to be passed down to even more Chinese doctors.”</p><br/><p>When Zhou Qing Quan heard this, he had an urge to start crying.</p><br/><p>He thought of some of the old doctors in the association who, when they discovered a type of medicine or a certain piece of knowledge, would try everything they could to keep it to themselves. When compared to this Master Lin, the difference was simply too huge.</p><br/><p>Meanwhile, Lin Fan was thinking in his heart, “Hurry up and come to me, Encyclopedic Points!” At that moment, he only had five pitiful points. Unbelievable!</p><br/><p>But Lin Fan had an idea. If these two old men went out with him to complete his task as well, that would be great.</p><br/><p>Moreover, when he went out, if he was to be alone, he would definitely spend his own money. But if he brought these two with him, he would be able to spend public money instead.</p><br/><p>At that moment, Lin Fan cleared his throat and said, “Ming Qing, prepare yourself. In a few days, you will be going with me to five cities. We’ll be volunteering to treat the sick without taking any repayment. Treating various illnesses will help your medical skills to improve greatly.”</p><br/><p>Zhao Ming Qing nodded. He was very excited. “Don’t worry, teacher. I’ve already done the preparations.”</p><br/><p>To him, following his teacher to go out and practice medicine was the fastest way to improve his medical abilities. If he came across anything he didn’t understand, he could ask his teacher. He would be luckiest if he came across more difficult and challenging illnesses.</p><br/><p>He believed that with his teacher’s abilities, no illness could be an issue.</p><br/><p>Indeed…</p><br/><p>When Zhou Qing Quan heard this, his eyes lit up.</p><br/><p>“Master Lin, what are you two talking about?” he asked curiously.</p><br/><p>Lin Fan laughed in his heart. The little fish has taken the bait.</p></div>\n</div>"}