{"title": "Chapter 465 - Things have gotten big", "id": 465, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-465-things-have-gotten-big", "volume_title": "Volume 5", "body": "<h1>Chapter 465 - Things have gotten big</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The in-patient department of the hospital sprang to life.</p><br/><p>“Did you guys hear about it? There is a godly doctor that is giving free treatment at the entrance of the hospital.”</p><br/><p>A patient that was suffering from a serious condition and had spent a lot on his hospital bills said, “So what if it’s free? Can he cure me?”</p><br/><p>“He might really be able to. I just walked past the other ward and someone there was packing his things. He was preparing to be discharged. Furthermore, he really looked like he has recovered.”</p><br/><p>“Really?”</p><br/><p>“Yeah, I saw it with my own eyes.”</p><br/><p>“He is Elder Wang, from that ward. He was the first one to visit the booth. He has been discharged. After that, the others went there too and now they’re preparing to be discharged.”</p><br/><p>“Take it slow. Don’t be too anxious. This matter has not been spread around yet. Wait till we’re cured before we spread it to the others.”</p><br/><p>Wang Xi Zhu’s friends wanted to just try their luck there. However, after going there, they realized that their health had improved greatly after being treated by the godly doctor. They were way better than before.</p><br/><p>The key factor was that one was able to feel the effects almost immediately.</p><br/><p>They felt that it seemed incredibly unbelievable.</p><br/><p>At the same time, the godly doctor gave them some prescriptions and the medicine prescribed was cheap. As long as they took their medicine regularly, their illnesses would be cured.</p><br/><p>…</p><br/><p>Things had gotten big this time. Initially, Lin Fan had wanted to be low-key about it. He didn’t want the effects to take place so quickly. However, as he thought about it further, he realized that there was no need to be low-profile.</p><br/><p>He wasn’t stealing or snatching anything and he wouldn’t be caught for that.</p><br/><p>The Encyclopedia’s mystical boost was insanely powerful. The effects could be seen almost immediately and the patients would feel like their bodies have been changed.</p><br/><p>The changes to their bodies only brought joy to them and that was what he ought to do.</p><br/><p>Zhao Ming Qing had been in shock since the start. His eyes had not left his mentor. They knew some of the conditions of the patients but these conditions seemed to be no big deal for his mentor. It seemed like they were too easy for him. He cured them of their illnesses in a blink of an eye.</p><br/><p>“Teacher, the patient’s condition earlier…” Zhao Ming Qing wanted to say that although the patient didn’t suffer from cancer, it was a condition that had a high death rate. His teacher had managed to use Chinese medicine and cure it within such a short timeframe and then prescribe medicine for the patient. Zhao Ming Qing was shocked.</p><br/><p>“Don’t talk about it. Just watch,” Lin Fan knew that they were all amazed.</p><br/><p>Zhao Ming Qing nodded. This situation made him wonder if Chinese medicine was a godly skill. He personally was not at that standard. However, his teacher was treating serious illnesses like they were nothing. It was becoming a scary situation.</p><br/><p>Qiu Jie sighed, “There are more patients now.”</p><br/><p>Zhang Tong Tong nodded, “Yeah, there wasn’t anyone earlier. There are more than ten people now.”</p><br/><p>Although the two of them didn’t know what they were doing, they had been recording everything down in their notebooks. They felt that the content that they had written was an invaluable treasure in the world of Chinese medicine.</p><br/><p>They were in luck to be able to follow their Director and Teacher Lin.</p><br/><p>There were more and more people on the road and a lot of people stopped to see what was happening.</p><br/><p>They felt that it was a bizarre situation. The Citizens’ Hospital was just there. But the sick people didn’t go to the hospital to see the doctors there. They were visiting this small booth to seek treatment instead. It didn’t make sense, especially because the voluntary medical workers looked to be Chinese medical doctors.</p><br/><p>It wasn’t because they looked down on Chinese medicine. They felt that Chinese medicine wasn’t as powerful as Western medicine. Treatment of some illnesses was too slow and some were even too painful.</p><br/><p>Time passed by slowly.</p><br/><p>The news of the godly doctor outside the Citizens’ Hospital started to spread in the hospital.</p><br/><p>A lot of patients felt that it was unbelievable after hearing about it. Some of them didn’t believe it. However, when they saw some of the patients packing up and preparing to be discharged, they were shocked.</p><br/><p>The nurses in the hospital realized that a lot of patients were being discharged.</p><br/><p>“What’s happening today? Why are so many patients being discharged?”</p><br/><p>“I don’t know. Ward 805’s patients have all been discharged. They look much better than before.”</p><br/><p>“I heard they’re spreading rumors of the booth outside the hospital. They’re curing illnesses for free and a lot of patients have gone there. Furthermore, when they returned from the booth, they started to process the paperwork for their discharge. They didn’t want to stay here anymore.”</p><br/><p>“That can’t be. A godly doctor at the entrance of our hospital? We are the Citizens’ Hospital, who could it be?”</p><br/><p>“I don’t know. The Chief Nurse has already gone to report this to the Director. If this continues, everyone would leave this hospital.”</p><br/><p>At the Director’s office.</p><br/><p>The Chief Nurse rushed over, “Director, it’s not good. A lot of patients are discharging and we currently don’t know what is going on.”</p><br/><p>The Director was stunned when he heard it, “A lot of patients are discharging? Did something happen in the hospital?”</p><br/><p>The Chief Nurse shook her head, “No, I don’t even know what the full situation right now. There are more than ten patients that have discharged. Also, these ten patients suffer from serious conditions.”</p><br/><p>The Director remained silent, “Did they give up on treatment and thus decide to leave?”</p><br/><p>“I don’t think so. I heard the nurses say that those patients were ecstatic when they were processing the paperwork for their discharge,” the Chief Nurse said.</p><br/><p>The Director picked up the phone and called the doctors on duty, “Doctor Li, what’s the situation like over there? Why are the patients being discharged?”</p><br/><p>Doctor Li replied, “Director, I was just about to tell you about it. I heard that there is a godly doctor that set up a booth for voluntary medical work at the entrance of our hospital. A lot of patients went there to seek treatment. After that, they came back to the hospital to process their discharge.”</p><br/><p>“Rubbish. He can’t be so powerful that everyone got cured immediately. Quickly tell the nurses to keep the emotions of those patients in check. I will go to the entrance now to see who he is. This person dares to scam people at the entrance of a hospital. What are the security guards doing?!” The Director sounded a little angry.</p><br/><p>This was the Citizens’ Hospital. How could they tolerate such an incident?</p><br/><p>If something were to happen, their hospital would be doomed. Even if it wasn’t their personnel, the rumors would blur things out when they get spread to the public.</p><br/><p>At the entrance of the hospital.</p><br/><p>Lin Fan wrote down the prescription, “Take it three times a day. Drink one bowl of this with three bowls of water. I think you have to take it for two weeks to be cured completely. If you’re worried, you can come to the hospital every three days for a check-up.”</p><br/><p>“No need, no need. Godly doctor, when you helped me with the acupuncture earlier, I felt so good. Initially, I thought everyone was talking rubbish and I didn’t believe them. Now, I believe all of it. I will remember to eat the medicine regularly,” the patient said emotionally.</p><br/><p>He had been lying in the hospital for a month and his condition had been fluctuating. He had been extremely anxious.</p><br/><p>However, it was different now. He felt that he was cured after seeing this godly doctor.</p><br/><p>Of course, these were just the thoughts of the patient. His condition wasn’t completely healed yet. He had to consume medicine to improve it.</p><br/><p>Lin Fan silently accepted the nickname, ‘Godly doctor’. He was indeed one. There was no problem with that.</p><br/><p>“What are you doing?” Then, a loud and stern voice came from the right side.</p><br/><p>The Director brought some people and went towards them.</p><br/><p>He felt the need to stop this situation.</p></div>\n</div>"}