{"title": "Chapter 486 - You are the expert", "id": 486, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-486-you-are-the-expert", "volume_title": "Volume 5", "body": "<h1>Chapter 486 - You are the expert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Little Brother Bao picked up the wine bottle on the table, then apologetically looked at everyone and said, “Teachers, school leaders, and students, I, Little Brother Bao, have caused a massive inconvenience for you all. This is my fault and I’ll punish myself by drinking three glasses. I’m really sorry to the teachers for this misunderstanding and tonight’s bill will be settled by me.</p><br/><p>If his boss knew about this, that he bullied the people close to the Godly Doctor, he might as well cut off his own leg.</p><br/><p>Although he relied on the gambling den to feed his family, it was his brother who dragged him into this. Also, his brother’s temper was really bad. Although he was not lower in the hierarchy than his brother, if his brother were to hit him, he would not dare to say a thing.</p><br/><p>However, thinking back to his youth, if it was not for his brother taking care of him, he could have already been dead.</p><br/><p>The surrounding students also let sighs of relief. The whole thing had scared them to death but it appeared to be over.</p><br/><p>However, they were still pretty shocked. When they looked at Lin Fan, it was really weird as he had changed so much.</p><br/><p>His scallion pancakes being so delicious had already made them really surprised and now, he turned out to be a Godly Doctor. The change was really too drastic.</p><br/><p>Lin Fan felt helpless. He had planned to show some heroism in front of his classmates today, but he never thought that the situation would be settled so quickly and in such a mysterious fashion.</p><br/><p>Was it that helpful having the title of Godly Doctor?</p><br/><p>It made him a little unhappy.</p><br/><p>His plan had been ruined.</p><br/><p>When he was halfway through showing his force and was about to show his true strength, the opposition became terrified. It was a boring outcome, really too boring.</p><br/><p>“You better return my teacher’s money,” Lin Fan said.</p><br/><p>Little Brother Bao nodded and smiled, “That’s a given. I will personally send the money to her doorstep. I’ve disturbed your teacher’s birthday today, that’s my fault. Right now, I’ll leave you all to be. If there’s anything else, you can come and find me.”</p><br/><p>Afterward, Little Brother Bao left the scene. He had been slapped by Lin Fan but he would not take that to heart. To be taught a lesson by the Godly Doctor was something that should happen. Anyway, if his brother were to know about this, he would slap him a few times as well.</p><br/><p>“Teacher Xia, this was just a small interruption, why don’t you continue?” Lin Fan said.</p><br/><p>Teacher Xia was very grateful and replied, “Lil’ Fan, I can’t thank you enough.”</p><br/><p>Lin Fan waved her off and said with a smile, “No need, no need, it’s just a small matter.”</p><br/><p>The surrounding classmates were really all in shock. The felt that Lin Fan had become more awesome, being able to resolve the whole situation. However, regarding the Jiangning Godly Doctor situation, they had all heard about it but to hear that it was Lin Fan, it left them flabbergasted and it was unimaginable.</p><br/><p>They were all bustling with noise and excitement after all of this.</p><br/><p>Lin Fan looked at Brother Qiang Qiang and knew that there was definitely a reason for her coming here to find himself. Otherwise, she would not have appeared. As the situation was resolved already, everyone else naturally went back to having fun. The hotel room was filled with amusement and people eating. Brother Qiang Qiang had booked the most high-end karaoke room for Teacher Xia, free of charge.</p><br/><p>He wanted to reject it at first, but after some thought, he remembered that Teacher Xia was his teacher and her reputation was pretty important so he did not say a thing.</p><br/><p>The school leaders’ opinions of Teacher Xia had changed also. They had a sort of feeling that the teacher was relying on her student’s riches and honor to stand up.</p><br/><p>In the private room, Wang Zhen and the rest of them were in high spirits while Lin Fan and Brother Qiang Qiang were alone.</p><br/><p>Inside the office, Lin Fan was trying to analyze Brother Qiang Qiang. “Brother Qiang Qiang, you name is a little amusing, I’ve never seen anyone call himself that.”</p><br/><p>Brother Qiang Qiang’s lips were perfectly red and teeth perfectly white, so even her smile was perfect. However, it was ruined by her temperament. She replied, “A name is just a title and that’s all. As far as it goes, Brother Qiang Qiang is my name.”</p><br/><p>“However, my real name is Liu Xu. The thing is that no one knows it and I’m hoping that the godly doctor won’t spread that.”</p><br/><p>Lin Fan nodded and said, “I am not the type to gossip.”</p><br/><p>Brother Qiang Qiang replied, “Godly doctor, I’ll get straight to the point. I…”</p><br/><p>Lin Fan waved him off and said, “There’s no need to say it, I know it already. Whenever I’m attending to my patients, they don’t have to tell me their illness and I’d know it already. When I first laid eyes on you, I knew what was wrong already.”</p><br/><p>Brother Qiang Qiang laughed and said, “You are the expert and the godly doctor, you have my full trust to do whatever you need to. Tell me whatever the price is.”</p><br/><p>Brother Qiang Qiang’s condition was very serious. Lin Fan had no intention of seeing any more patients, however, Brother Qiang Qiang, who had perfect features as well as a slim body had a huge hormonal problem. If she had been a girl from birth, then how could she have these problems?</p><br/><p>Even if Lin Fan did not think that way, the millions of youngsters in society would definitely think that way.</p><br/><p>Wasn’t that a huge pity?</p><br/><p>Lin Fan waved him off and said, “My work is out of good will, so my services are all free. Relax, in this situation, there are only two problems, one being your body and the other being your mind.”</p><br/><p>Brother Qiang Qiang laughed, she could not help becoming really happy. This illness had always been her greatest headache.</p><br/><p>From birth, she had already known what gender she was meant to be.</p><br/><p>She had seen countless doctors and taken countless amounts of medicine, all to no avail.</p><br/><p>She wanted to become a true man. However, she was not willing to accept the kind of treatment they do in Thailand and she had no intentions of becoming their plaything. As long as she could grow a mustache as well as get rid of her menstrual cycle she would be satisfied because to her, that was a very troublesome thing.</p><br/><p>Also, she felt that her female parts were too prominent. She thought they were too big and wanted to make them smaller.</p><br/><p>Without operating, these wishes would not be possible. However, she did not want to go under the knife.</p><br/><p>Now that she had seen that Jiangning had a godly doctor, she wanted to try her luck. After hearing the confidence from him, she could not help feeling happy. All she had to do was let the expert go to work and she could relax.</p><br/><p>“Do you need anything for this medical treatment?” Brother Qiang Qiang asked.</p><br/><p>Lin Fan waved her off and said, “No need. All I need are some silver needles and I will prescribe you with some medication. You just need to diligently eat it for a month and you’ll be fine.”</p><br/><p>“So long?” Brother Qiang Qiang curiously asked.</p><br/><p>Lin Fan laughed and said, “This is considered long? To be able to change your body is a very difficult thing since it has been accumulated in your body for such a long period of time. To want to have it cured in a short amount of time is not something that is possible.”</p><br/><p>Brother Qiang Qiang nodded and said, “That’s true. Okay, godly doctor, I have some silver needles here, I’ll get someone to send them over.”</p><br/><p>Regarding Brother Qiang Qiang’s issues, Lin Fan could not just sit back and do nothing. To have perfect features and then be in a situation like this, where she had an interest in women but not in men, was a scary thing.</p><br/><p>To have such good features but not be able to enjoy them because of physical and mental issues, was really a sad thing.</p><br/><p>But, she was lucky to have met a godly doctor like Lin Fan, who could easily solve this.</p><br/><p>Brother Qiang Qiang said, “Godly doctor, I feel like I have to tell you about my condition.”</p><br/><p>Lin Fan waved her off and said, “No need to use your own words. Experts are experts. I am an expert so let me do what I have to. All you need to do is eat medicine for a month and after that, you’ll see the effects of my expertise.”</p><br/><p>Quickly, the needles arrived.</p><br/><p>Lin Fan was about to begin his treatment when he said, “Brother Qiang Qiang, you must remember that while taking the medicine for this month, there will be side effects, however, they will go away with time.”</p><br/><p>“Yea, I know,” Brother Qiang Qiang nodded. Her mind was filled with anticipation as the time she had been waiting so long for was finally here.</p><br/><p>She did not really care about the opinions of the people at home because, in life, you have to put your own needs first.</p></div>\n</div>"}