{"title": "Chapter 481 - The Start of The Gathering", "id": 481, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-481-the-start-of-the-gathering", "volume_title": "Volume 5", "body": "<h1>Chapter 481 - The Start of The Gathering</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter481thestartofthegathering\">Chapter 481: The Start of The Gathering</h3><br/><p><strong>Translator:</strong> Sparrow Translations <strong>Editor:</strong> Sparrow Translations</p><br/><p>Two days later.</p><br/><p>Lin Fan and his group had already visited every single hospital in the Jiangning district. In this time, they had seen a countless number of sick people and as long as they were sick they would treat them. Also, they had yet to meet anyone like Wu Tao.</p><br/><p>However, the thing that gave Lin Fan a little excitement was that the ‘Various Types of Typhoid’ had given him 100 Encyclopaedic Points.</p><br/><p>It looked like Zhou Qing Quan and his group had already begun to spread it around. However, the number of doctors who could understand the “Typhoid Illness Discussion” was few. But hopefully, over time, there would be amazing benefits from it.</p><br/><p>At this moment, Qiu Jie cried out in surprise, “Master Lin, something huge has happened.”</p><br/><p>“What?” Lin Fan curiously asked, wondering what could possibly be happening at this moment as they had been here doing their medical treatments and had not gone anywhere else. Could it be that something just appeared out of nowhere?</p><br/><p>“Look,” Qiu Jie said as he took out his phone.</p><br/><p>When Lin Fan saw the news he was extremely surprised, saying, “It can’t be.”</p><br/><p>Qiu Jie expression was still one of disbelief. He did not think that things would turn out this way. He replied, “Yes, it is.”</p><br/><p>Lin Fan looked at the news carefully. He knew that this was really a major incident. Wu Tao was done for. Not only was he done for, there were many people who had been implicated also and these people were not just any average people.</p><br/><p>When Wu Tao joined the election, he had done some bribery and some of the other people involved in the election were involved with the bribing as well. There were tens of people who gave money in exchange for the votes. The total sum of money involved added up to 100 million and the number was still rising as more data was being collected. Since it involved many of the staff members, they were feeling pretty afraid.</p><br/><p>However, this did not appear to be of much concern to him.</p><br/><p>“Xiao Jie, don’t you think that this does not involve us?” Lin Fan asked.</p><br/><p>Qiu Jie had a foolish look as he looked at Lin Fan, wondering how could it not concern them. But when he saw the look in Lin Fan’s eyes, he nodded and replied, “Mmm, it has nothing to do with Master Lin at all.”</p><br/><p>Lin Fan smiled and said, “It’s like it said, how could this possibly concern us? Don’t think about it, continue to treat the sick.”</p><br/><p>Qiu Jie felt a little helpless and scared inside. He knew that it did not involve Master Lin but it did concern him a little. Also, this was very important and it was the last straw. However, since Master Lin did not want to talk about it, he would not bring it up anymore.</p><br/><p>However, he did have a little sympathy when thinking about Wu Tao.</p><br/><p>Why would they insist on threatening Master Lin? Also, why would they want to implicate so many people? If their attitudes were a little better at the start, they probably wouldn’t have gotten into so much trouble.</p><br/><p>What should be said about this?</p><br/><p>You may have avoided the disaster but you cannot hide from your sins forever.</p><br/><p>This situation had a very nasty impact. It caused a massive stir online as no one had thought it would turn out like this. But when they saw the government announcement, they were all shocked. U.p.dated by . com</p><br/><p>Due to this small issue that was drawn into a big issue, Jiangning blew up on the Internet.</p><br/><p>And right now, the appointment holders in Jiangning were all scared that they would be brought out for questioning.</p><br/><p>The whole situation was not resolved yet and the authorities were still investigating.</p><br/><p>5 pm.</p><br/><p>They closed the stall and went back.</p><br/><p>The hotel.</p><br/><p>Zhao Ming Qing asked, “Master, do you have anything on tonight?”</p><br/><p>Lin Fan nodded and said, “Mmm, a classmates’ meeting and it’s also one of the teachers’ birthday so I’m required to be there. Ah, right, I forgot to prepare the present. I’m going to go out to get a gift, you guys rest early, we’ll be in a different city tomorrow.”</p><br/><p>Today was the last stop in Jiangning. After attending the student’s gathering, he was going to leave.</p><br/><p>He never thought that even though he had not seen his university classmates in a while that he would miss them.</p><br/><p>They had always been teasing him and this time, he was going to surprise them.</p><br/><p>Zhao Ming Qing saw how energetic his teacher was and before he could say anything, his teacher had left already. He had really wanted to tell his teacher to be careful of his safety. But he did not have the chance to.</p><br/><p>At this moment, Lin Fan went straight to an art shop and told the owner he wanted to use his area for a while to complete a painting. If he did not prepare a gift for his teacher, Teacher Xia, it would definitely be very wrong.</p><br/><p>He thought that buying an expensive gift was too tacky and after a lot of thought decided that a painting was the best since it was cheap and it showed effort.</p><br/><p>The shop owner had no idea that this young man was part of the Chinese Art Association and was laughing at him at the start. However, in the end, his face was in shock like he had seen a ghost.</p><br/><p>‘Peace and Prosperity’, Lin Fan had managed to display his superb skills.</p><br/><p>Within his painting were birds and flowers, which symbolizes luck.</p><br/><p>He did not see the point of adding peaches to the painting, which represent long life, as he felt Teacher Xia was still young, in her forties, and was a female so adding peaches would be seen as a complete joke. Also, if she were to hang it on the wall, it would be seen as unseasonal once her birthday ended compared to other more modest paintings.</p><br/><p>When Lin Fan left the store, the boss was standing at the door, in complete shock saying, “This is a master…”</p><br/><p>Although he was just the boss of an art shop, he had done his research on Chinese art. Was this an amazing artist that had just suddenly appeared? When he turned around and looked at the empty table, he felt a bit of regret. If he had known earlier, he would have asked him to do a painting for him.</p><br/><p>Lin Fan unlocked his phone and looked at the group chat.</p><br/><p>“Happy birthday Teacher Xia.”</p><br/><p>“Teacher Xia, may you have your youth forever.”</p><br/><p>“The red packets are here, everyone quickly come to the hotel.”</p><br/><p>“That’s right, @Lin Fan @Rich man @Wang Zhen, only you guys are left, why aren’t you all here yet?”</p><br/><p>Lin Fan replied, “On the way, I’m reaching soon.”</p><br/><p>Rich man: “Traffic jam, reaching soon.”</p><br/><p>Wang Zhen: “Had to work overtime, but I’m reaching soon.”</p><br/><p>“Sh*t, Lin Fan is incredible now, he has shocked all of us.”</p><br/><p>“Brother Fan is not average at all. He’s so f*cking awesome on the Internet.”</p><br/><p>Rich man said: “That what happens when you’re famous, he has definitely risen above us.”</p><br/><p>Rich man was Lin Fan’s university classmate. When the two of them were classmates, they had a lot of disagreements and would argue a lot. Lin Fan did not think that even now, after graduating that he would still make sarcastic remarks about him and Lin Fan could not take it.”</p><br/><p>“Chen Xiang, I’ll stuff your mouth with my scallion pancakes, then you’ll see how great I am,” Lin Fan replied.</p><br/><p>Rich man: “I can’t eat your scallion pancakes. If I do, I’d start barking like a dog.”</p><br/><p>“Amazing, my brother.”</p><br/><p>“Lin Fan, no matter what happens, you definitely need to let Chen Xiang try your scallion pancakes. We can sit and watch Chen Xiang bark.”</p><br/><p>Rich man: “F*ck off, are you all just trying to piss me off?”</p><br/><p>Teacher Xia: “What are you guys still arguing about? What time are you all going to reach?”</p><br/><p>Rich man: “Happy birthday, Teacher Xia. I’m reaching soon.”</p><br/><p>Lin Fan: “Teacher Xia, I’m reaching soon too, I’ll be there in 20 minutes at most.”</p><br/><p>Teacher Xia: “Come quickly, we are waiting for you all.”</p><br/><p>Although their class was a little messy, their form teacher was really nice to them, frequently organizing reunions. Thus, when it came to Teacher Xia’s birthday, a majority of them were willing to join in.</p><br/><p>However, there were some who did not join. These people did not need to be cared about. After graduation, they had never bothered to open up to the group.</p><br/>\n</div>"}