{"title": "Chapter 497 - A perfect solution", "id": 497, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-497-a-perfect-solution", "volume_title": "Volume 5", "body": "<h1>Chapter 497 - A perfect solution</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Nanshan Children’s Welfare Institute.</p><br/><p>Zhang Long had been waiting at the entrance, accompanied by several technical personnel from WeChat’s operations department.</p><br/><p>Director Huang was by the side, accompanying them as well. Up till now, she didn’t understand what Master Lin was doing this for. What did gathering funds for the children’s education have to do with WeChat?</p><br/><p>A Mercedes-Benz came to a halt.</p><br/><p>When Lin Fan saw Zhang Long and the rest, he waved. “Chief Zhang.”</p><br/><p>Zhang Long had done his research on Lin Fan and when he found out that this Master Lin was THAT Master Lin, he was a little shaken. This Master Lin was that godly doctor who went viral on the Internet a while ago.</p><br/><p>Also, there were his scallion pancakes and other things that were astonishing as well.</p><br/><p>“Nice to meet you, Master Lin.” Zhang Long went forward immediately and shook his hand. This was the first time they had met in person. As the WeChat’s operations person-in-charge, as long as he didn’t do any bad things, he was naturally unafraid of anybody. However, this Master Lin seemed like a legend and it made him want to get to know this Master Lin.</p><br/><p>Lin Fan said courteously, “I’ve troubled you all to come all the way here. Please, come in.”</p><br/><p>“You are too courteous, Master Lin,” Zhang Long said. The other technical personnel nodded as well and followed behind as they all entered Nanshan Children’s Welfare Institute together.</p><br/><p>Lin Fan pointed to the front, “At Nanshan Children’s Welfare Institute, most of the children were once rescued from the hands of human traffickers. Some of them are already not too young and they need to start receiving an education. However, the number of children is rather high and it doesn’t seem possible to send them all to the public schools. That’s why I think we should rely on ourselves and form a school here for the children to undergo education. Of course, the capital required is not small, so I’d like to ask for Chief Zhang’s help.”</p><br/><p>Zhang Long didn’t interrupt him but kept on nodding. After he heard everything, he sighed, “Master Lin is truly admirable. This is a good deed. These children are really pitiful. Since Master Lin thinks so highly of WeChat, we naturally won’t spare any effort in helping you, Master Lin.”</p><br/><p>“Haha,” Lin Fan laughed, “Chief Zhang, please follow me.”</p><br/><p>Very quickly, everyone reached the drawing room.</p><br/><p>The children’s laughs filled everyone’s ears.</p><br/><p>Lin Fan led Chief Zhang and the rest as they walked at the back, looking at the children’s artworks. Then, Lin Fan said, “My plan is for the children’s artworks to be placed on your platform for auction. As for the overall procedural methods, please help us with that, Chief Zhang.”.</p><br/><p>Zhang Long was silent for a moment as his mind started brainstorming for a method of operation. Meanwhile, the other technical personnel were thinking as well.</p><br/><p>At that moment, one of the personnel said, “Chief Zhang, we could scan the children’s artworks and make an emoji package and then collect fees based on usage. What do you think?”</p><br/><p>“I don’t think that’s possible. That kind of method isn’t suitable for these artworks. However, I do think that since it’s for a group of children, we can use our platform. Netizens nowadays are very kind and they are protective and supportive of underprivileged groups.”</p><br/><p>Zhang Long nodded, indicating his agreement. Then, he said, “What do you all think about this? We scan the artworks and carry out some editing. Then, we place them on the platform and sell them for one dollar each as a charity sale. Don’t be angry, Master Lin, but these children’s artworks, if I say it in a harsh manner, are definitely not suitable for show. However, if you look at them another way, they look a little like splash-ink paintings and would be pretty good as phone wallpapers.</p><br/><p>“One dollar isn’t much. If we sell them for one dollar each, I believe the result will be pretty good.”</p><br/><p>The technical personnel were thinking, considering whether Chief Zhang’s plan would work. Then, their final conclusion was that it definitely would.</p><br/><p>“Chief Zhang, that’s a great plan.”</p><br/><p>“One dollar isn’t too much. Anyone who uses WeChat would be able to bear to pay that much.”</p><br/><p>“Moreover, it’s to support the children of the Welfare Institute. It’s a charitable deed. It will definitely work.”</p><br/><p>Lin Fan hadn’t said anything. Leaving it to the professionals was definitely not a problem. Then, he said, “Chief Zhang, how do you reckon we should split the profit?”.</p><br/><p>There is no such thing as a free meal in the world. Although Lin Fan had relied on Elder Zheng’s connections to get Zhang Long here, he couldn’t just make Zhang Long do work for him for free.</p><br/><p>When Zhang Long heard this, he hastily waved his hand. “Master Lin, you are looking down on us. Although we are a business company, with charity, we would do whatever we can to help. If we take any of the profits and it is found out by the public, we would get flamed to death.</p><br/><p>What kind of joke was that?</p><br/><p>If they were to take any of the profit, not only would the netizens flame them. Even that old man, Elder Zheng, wouldn’t forgive them.</p><br/><p>Although not much would happen, if he really wanted to punish them, he would have lots of methods to do so.</p><br/><p>Lin Fan nodded, “Thank you very much then.”</p><br/><p>Zhang Long said with a smile, “Everyone has a responsibility to do charitable deeds. Later on, I’ll get someone to collect the children’s artwork and bring them to Beijing to scan them onto the computer. A period of time will be needed but don’t worry. I guarantee it’ll be done within a month.</p><br/><p>“Alright.” Lin Fan nodded. Although a month was a little long, at least the matter would be resolved. The children’s education was a significant matter. Currently, the Children’s Welfare Institute had all the basic necessities but they were just lacking in education. If they could resolve this, then nothing would be an issue.</p><br/><p>Zhang Long instructed his workers, “Go and collect the artworks. Don’t damage them. Then immediately head back to Beijing and take care of this. I’ll communicate with the development department and get them to develop a webpage for these artworks.</p><br/><p>Now that the plan had been settled, all that was left was for them to put in the work.</p><br/><p>Since Zhang Long was willing to help, Lin Fan was naturally very courteous towards him. “Chief Zhang, later on, why don’t you stay for a meal? I have to thank you all properly for this.”</p><br/><p>Zhang Long smiled, “Master Lin, I’ll pass up on the meal. This kind of matter cannot be dragged on. It wouldn’t be too late to have a meal after the task has been completed.”</p><br/><p>Lin Fan said with a smile, “Alright. Well, thank you for the trouble, Chief Zhang.”</p><br/><p>Han Lu had been watching from the side all along. He never thought that Master Lin would think of such a plan.</p><br/><p>But he had to admire Master Lin. Such a plan might really work.</p><br/><p>Chief Zhang and the rest still had to register the names of the children. When displaying the artworks, they had to include the names and ages of the children who made them as well.</p><br/><p>They worked all the way until nighttime.</p><br/><p>Everything had been settled. Zhang Long and his men rushed back to Beijing overnight and didn’t stay in Shanghai.</p><br/><p>Lin Fan had originally been thinking of bringing them out for a meal or even personally cooking for them. But he never thought Chief Zhang would be so professionally dedicated. They had left before even eating.</p><br/><p>Lin Fan had to give this kind of boss a thumbs up. Although it was partly because of Elder Zheng, he couldn’t think that that was the only reason Chief Zhang helped them.</p><br/><p>With one look, he could tell that Chief Zhang was sincere and he wasn’t doing it just because of Elder Zheng.</p><br/><p>Now that there was a solution to the Welfare Institute matter, Lin Fan finally let out a breath of relief. A troublesome matter had been taken care of.</p><br/><p>But now, he had to focus on teaching the children Chinese arts.</p><br/><p>He still had to rely on them to earn him Encyclopedic Points.</p><br/><p>Moreover, learning Chinese arts would be a great help to them. Becoming masters of Chinese arts would not be impossible for the children.</p></div>\n</div>"}