{"title": "Chapter 490 - I’m setting the industry’s benchmark, understand?", "id": 490, "volume": 5, "url": "http://boxnovel.org/a-valiant-life-chapter-490-i%E2%80%99m-setting-the-industry%E2%80%99s-benchmark-understand", "volume_title": "Volume 5", "body": "<h1>Chapter 490 - I’m setting the industry’s benchmark, understand?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The enthusiasm over volunteer medical work had not gone away yet but the Wu Tao situation was dominating the headlines. This was a big issue but if it was back in the old times, the news would not have spread to such a large extent. However, since it was the age of the internet, if something happened today, by tomorrow, the whole world would know about it. It was truly a terrifying prospect.</p><br/><p>Also, this issue caused by this one person, Wu Tao, had implicated so many people. This was something everyone thought was unbelievable.</p><br/><p>Whenever Lin Fan looked at the news, he would laugh. He knew a long time ago that there would be he would and up in jail and it would be a severe sentence. Wu Tao had been insistent on going against Lin Fan. That was simply asking for death.</p><br/><p>At this moment, Wu You Lan came over and poured tea for Lin Fan. Then, she sat opposite Lin Fan, both hands under her chin, staring at him with her eyes wide open and with a twinkle in them.</p><br/><p>Lin Fan sipped the tea, smiled and said, “You Lan, what are you doing? I can see a love-struck gleam in your eyes.”</p><br/><p>“Pah! You are the one who is love-struck. I’m just here trying to study you and see what other things you are hiding from me,” Wu You Lan replied.</p><br/><p>Lin Fan smiled and said, “If you guys didn’t ask, you guys would not know. Actually, I do have one thing that I have been hiding from you guys. Do you see my two hands?”</p><br/><p>Wu You Lan nodded and replied, “Yes I do. So what?”</p><br/><p>“Let me tell you. My two hands are really good at scrubbing backs, it’s really very comfortable,” Lin Fan said. Thinking about the 11th page of knowledge made him feel like crying.</p><br/><p>When Wu You Lan heard that, her cheeks turned red and she said, “Brother Lin, you went out for awhile and then… then, forget it,” Wu You Lan said as she dejectedly went to hide in the corner.</p><br/><p>“What’s is it? I’m telling the truth,” Lin Fan helplessly said.</p><br/><p>“When it comes to back scrubbing, there really isn’t anyone better than me. When I was going through tough times back then, I used to scrub backs in Xiaohong’s bath center. My technique was so good that there was a long line of people chasing me to scrub their backs. It’s a pity that my interests did not lie in back scrubbing. If not, I would have become the most famous back scrubber in the nation,” Fraud Tian said as he reminisced about the past. He could not help letting out a sigh.</p><br/><p>Lin Fan looked at Fraud Tian. He really despised how Fraud Tian seemed to have such exotic talents.</p><br/><p>You are a Fraud and yet you still insist on being multi-talented. Do you not know that this will be the death of some people?</p><br/><p>“Shall we go to the bathroom and have a contest?” Fraud Tian smiled and said.</p><br/><p>Lin Fan shot a glance at him and said, “Who would want to compete with you? I’m going for a stroll, you guys take care of the shop.”</p><br/><p>Outside the shop.</p><br/><p>Lin Fan went to end of Cloud Street. There was a bath center there. Although the place was not very big in size, it had a good enough reputation. The boss was a short and fat person who was very likable. Although Lin Fan interact with the guy much, he had come to queue at Lin Fan’s shop many times before. After some time, they had become familiar with each other.</p><br/><p>“Little Boss, how come you have the time to come here?” at the bath center’s entrance, the boss, Elder Zeng asked with a smile on his face.</p><br/><p>Lin Fan smiled and said, “I was thinking of you so I came over to find you.”</p><br/><p>Zeng Wei was happy at that moment. He knew what Little Boss stood for in Cloud Street so he spoke to him in a very welcoming manner, saying, “Little Boss, I bought some good teas recently, do you want to try some?”</p><br/><p>Lin Fan had initially been planning to find a bathhouse. If he was going to go to someone else’s house for it, he might as well go to his neighbors’ one. He then smiled and said, “Looks like I’ll have to trouble you to do that.”</p><br/><p>…</p><br/><p>Zeng Wei brewed the tea, poured it for him and said, “Please, try it.”</p><br/><p>Lin Fan had no idea how to judge tea so he took a sip and said, “Not bad, not bad. Oh yes, Elder Zeng, how has your business been, recently?”</p><br/><p>Zeng Wei shook his head and said, “Passable. It hasn’t been doing poorly but hasn’t been earning much money either. Looks like you’re having trouble believing what I’m saying.”</p><br/><p>Lin Fan nodded and said, “It is a little hard to believe. The shop’s decor isn’t bad and the location is quite good. How can you not be earning money?”</p><br/><p>Zeng Wei laughed and said, “It’s because I don’t have that thing. You should know what it is.”</p><br/><p>“Haha,” Lin Fan smiled and said, “I know, I know.”</p><br/><p>He was talking about prostitutes, wasn’t he?</p><br/><p>However, it was true. Here in Shanghai, this field was well developed. Eight out of every ten of these bathhouses would have such an item. As for the other two, they depended entirely on their own capabilities.</p><br/><p>“When I first opened this store, I had analyzed the situation. What I saw were many laborers that came to Shanghai. However, what I did not realize is that when people came to these bathhouses, they were also there to relax. Not just relax, but to do that also. So, given that I don’t provide that, how can I compete with others? Look at that Golden Phoenix Bath Centre. Their one night of business is equal to a month of mine. Don’t you think that is scary?” Zeng Wei said. Zeng Wei admired them but would not dare to do something like that because if he got caught, it would be a tragedy.</p><br/><p>“They are that amazing?” Lin Fan exclaimed.</p><br/><p>“Definitely. They are not just amazing but they are simply money grabbing. You see, their lowest price is 698 dollars and the highest goes up to 1288. There are even times where they are at full capacity. Also, if you want to go for higher quality, it can go up to two or three thousand dollars. However, that’s other people’s business. I’ll just mind my own, I don’t have the guts to do something like that.”</p><br/><p>Lin Fan nodded and then asked, “Oh yeah, I’m prepared to work here as a back-scrubber, what do you think of that?”</p><br/><p>“Sure,” Zeng Wei laughed and said. Then, his expression changed and he was dumbfounded as he looked at Lin Fan and said, “Little Boss, what did you say just now?”</p><br/><p>Lin Fan blinked his eyes and then said, “I want to come here and work as a back scrubber, what do you think of that?”</p><br/><p>Zeng Wei had a stupid look on his face as he looked at Lin Fan and said, “Little Boss, you aren’t pulling my leg right? How can my small little shop…”</p><br/><p>Lin Fan cut him off and said, “So will you let me? We are all neighbors, I won’t joke with you like that.”</p><br/><p>“You know how to scrub backs?” Zeng Wei doubtfully asked.</p><br/><p>“What a joke. My back scrubbing skills are the best in the world. As long as I come here to work, your business will turn around and increase more than tens of times,” Lin Fan boasted.</p><br/><p>Regarding Little Boss’ request, he did not reject it. Even if Little Boss did not know how to do it, he still had to agree since it was the Little Boss asking.</p><br/><p>Also, Little Boss was so popular around Cloud Street and everyone admired him. So he might be able to bring some extra business along.</p><br/><p>“Okay, then it’s a deal. You can relax, I guarantee that I am not wrong,” Lin Fan said as he got up. “I shan’t bother you anymore, I’m going to buy some goods. As for wages, you need not bother about that.”</p><br/><p>Zeng Wei was still in shock and he said, “Little Boss, why are you doing this?”</p><br/><p>Lin Fan very seriously replied, “To experience every profession. To leave a legend in this industry. To become the benchmark in this industry. I don’t think you will understand. That’s all, I shall take my leave.”</p><br/><p>Zeng Wei still had that retarded look on his face as he stared at Lin Fan. He had already been left in a daze by him. He still did not understand what was going on and even after much thought, he still did not get it. He felt that Little Boss was really too impulsive, acting so fast and not giving people any time to react.</p><br/><p>However, the fact that Little Boss agreed to come to his bath center and experience it would definitely help him out a lot.</p><br/><p>Thinking about it made him feel a little happy.</p><br/><p>The next day!</p><br/><p>A group of unexpected guests arrived in front of the shop.</p><br/><p>Lin Fan was astonished. What in the world was going on?</p></div>\n</div>"}