{"title": "Chapter 505 - Captured a small fish!", "id": 505, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-505-captured-a-small-fish", "volume_title": "Volume 6", "body": "<h1>Chapter 505 - Captured a small fish!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Huh?”</p><br/><p>Elder Zeng brought the skinny man to his shop’s entrance but suddenly, when he saw that the shop was packed with people, his expression changed. His eyes widened in astonishment as if he couldn’t believe it.</p><br/><p>“This is my shop?”</p><br/><p>Zeng Wei was very suspicious about what he was seeing. He raised his head and looked at the signboard. It was indeed his own shop.</p><br/><p>The skinny man looked at the situation and was delighted. With a bit of surprise, he said, “Boss Zeng, you’re too greedy, aren’t you? Your business is doing so well but you still say that it’s doing badly. Were you playing with me? I understand now. We can recalculate the splitting of profits. I will definitely make you satisfied.”</p><br/><p>There were already so many people just in the lounge. It was simply dazzling. If this was the market, then the market would be making an insane profit.</p><br/><p>It was unbelievable.</p><br/><p>The skinny man’s prostitutes were all very beautiful.</p><br/><p>As long as it was a man, he would be seduced by those prostitutes.</p><br/><p>Men knew men best. In the bathhouse, excluding those who come looking for prostitutes, any man who drank just a little bit of alcohol would be seduced by the prostitutes.</p><br/><p>Even some shy young men might be a little afraid at first but as long as the prostitutes were a little more spontaneous in seducing them, it wasn’t a problem.</p><br/><p>Zeng Wei stuttered, “This…”</p><br/><p>He didn’t know what was going on. How did things suddenly become like this?</p><br/><p>It didn’t make sense!</p><br/><p>“Elder Zeng,” Lin Fan had been chatting with Liu Xiao Tian when he saw Elder Zeng. He called out, “Where have you been? Why haven’t I seen you in the shop?”</p><br/><p>Zeng Wei went forward immediately. “Little Boss, this situation…”</p><br/><p>Xiao He saw that her boss had returned and a look of excitement appeared on her face. “Boss, business has been great the past few days. Little Boss’s back-scrubbing techniques are amazing. These people are all here to look for Little Boss.”</p><br/><p>She was an employee here and it was only natural for her to be happy that the business was doing well. It meant that the year-end bonus would be greater.</p><br/><p>Zeng Wei looked at Lin Fan in astonishment. “Little Boss, you…”</p><br/><p>Lin Fan smiled, then patted Zeng Wei on the shoulder. “How is it? Amazing, isn’t it? Back then, I told you that if I became a back-scrubber at your place, your business would bloom. It has only been a few days. Just four or five days and the business is already doing so well. Do you have any thoughts?”</p><br/><p>Thoughts?</p><br/><p>Thoughts my a*s!</p><br/><p>To Zeng Wei, this was like an illusion. He simply couldn’t believe it.</p><br/><p>How could he not have known that his own bathhouse business had so many clients that it was even scary? He had to say that it a little shocking.</p><br/><p>At that time, several guests came out and went to make payment at the front desk.</p><br/><p>“Little Sister, Your back-scrubbers here have pretty good technique. Their scrubs are really comfortable. Although the rest can’t compare to that young Little Bro’s scrubbing, this is still the first time I’ve had such a comfortable back-scrub in Shanghai.”</p><br/><p>“Indeed. I will definitely come back frequently next time. The environment is pretty good, the service is pretty good and the place is clean too. There’s no murky atmosphere here.”</p><br/><p>“Nowadays, it’s very difficult to find such a clean and good bathhouse with good back-scrubbers. Next time, I’ll call my friends along to have a try. This is what true back-scrubbing should be like. Those other bathhouses that claim to have amazing back-scrubs simply cannot even compare to this.”</p><br/><p>Xiao He smiled happily as she replied, “Thank you for the praise. We will keep getting better.”</p><br/><p>Elder Zeng’s bathhouse had taken the traditional path. The lowest fee was 68 dollars, which included the cost of the private room. After the bath, one could opt for the back-scrub or full-body massage, which were also included in the lowest fee. Hence, it was very affordable.</p><br/><p>While Lin Fan was around these few days, he had talked to the other technical workers as well, such as the masseurs. Although Lin Fan was just a back-scrubber, his methods could be applied to other fields as well. After the other workers learned some of his techniques, they made the customers very satisfied.</p><br/><p>This was the first time that Elder Zeng had seen his business doing so well. He stood in his original spot, completely dumbfounded. He felt that it was inconceivable. If he hadn’t seen it for himself, he would never have believed this.</p><br/><p>Lin Fan gave a surprised look at the skinny man next to Elder Zeng. “Elder Zeng, this wasn’t right of you.”</p><br/><p>Zeng Wei was startled. “What is it, Little Boss?”</p><br/><p>Lin Fan said with a smile, “Could it be that you were thinking of doing ‘that’?”</p><br/><p>“I…” Zeng Wei was a little embarrassed.</p><br/><p>The skinny man didn’t know what was going on but he had been completely stunned by the number of people there. He was in disbelief.</p><br/><p>“Boss Zeng, have you considered it yet? A better split of the profits such as fifty-fifty wouldn’t be an issue as long as you can guarantee the business would be like this every day,” said the skinny man excitedly. Even a shop with prostitutes couldn’t compare to this with regards to the number of customers.</p><br/><p>If it could always be like this, then becoming rich wouldn’t be too much to achieve.</p><br/><p>Zeng Wei smiled awkwardly and didn’t reply. He looked at Little Boss’s eyes and was a little embarrassed.</p><br/><p>Lin Fan shrugged and said, “Elder Liu, I’ll leave this to you.”</p><br/><p>Liu Xiao Tian, as an Inspector, had seen all kinds of situations. With one look at that skinny man, he could tell that this person wasn’t a good person.</p><br/><p>These were discerning eyes.</p><br/><p>“Hey, kid, do you know who I am?” Liu Xiao Tian asked the skinny man.</p><br/><p>The skinny man took a look at Liu Xiao Tian and shook his head. “I don’t know but you must be a friend of Boss Zeng. I’m having business discussions with Boss Zeng. Once we reach an agreement, it would be a great joy.”</p><br/><p>“What business are you discussing?” asked Liu Xiao Tian with a smile.</p><br/><p>The skinny man didn’t think much and just replied, “What else could it be, in a bathhouse? Men should all know. You should know, right?”</p><br/><p>Liu Xiao Tian shook his head, “I really don’t know. Please explain.”</p><br/><p>The skinny man was a little displeased but he really wanted to settle this business deal with Boss Zeng. He said, “I’m talking about that. Prostitutes…”</p><br/><p>“Oh…” Liu Xiao Tian nodded, “Then do you know who I am?”</p><br/><p>“Big Bro, I really don’t know,” said the skinny man. He had no idea what was going on. Why did this man keep asking him if he knew him?</p><br/><p>Liu Xiao Tian took out his ID and placed it in front of the skinny man. “Do you know who I am now?”</p><br/><p>The skinny man took a look and his expression slowly changed.</p><br/><p>Inspector Liu of the local police station!</p><br/><p>F*ck!</p><br/><p>He had screwed up.</p><br/><p>The skinny man was astounded. He slowly took a few steps back. “Sorry, Boss Zeng. I have somewhere to go. I gotta go now…”</p><br/><p>Just as his legs started moving, Liu Xiao Tian dashed forward and grabbed him, pinning him down. “You’re good. Even when I’m around, you dare to promote such things. Looks like I won’t know the severity of the situation until I bring you in for questioning.”</p><br/><p>“Ah!” The skinny man cried out as he was being pressed down.</p><br/><p>Lin Fan smiled and said, “Inspector Liu, you really are lucky. Just coming out here to have a chat with me and you conveniently managed to catch a small fish. This will cause other people in your profession to be really jealous. I shan’t disturb you from carrying out your work. But I can guarantee that this bathhouse definitely abides by the law. Elder Zeng is a lawful man. That, I can guarantee.”</p><br/><p>Zeng Wei nodded, “Yes, yes…”</p><br/><p>“Since Master Lin has guaranteed it, of course, I will believe it. Boss Zeng, lawful businesses are the right way to go. Don’t be tempted by those crooked and evil ways. You may be able to get away with it for a while but you can’t get away forever,” said Liu Xiao Tian with a smile. Of course, he knew what was really going on. But since Master Lin had spoken, he had to give him some face.</p><br/><p>Zeng Wei stood there, nodding, “Yes, yes. I have always been doing lawful business.”</p><br/><p>…</p></div>\n</div>"}