{"title": "Chapter 519 - Crush them all the way!", "id": 519, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-519-crush-them-all-the-way", "volume_title": "Volume 6", "body": "<h1>Chapter 519 - Crush them all the way!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The police station.</p><br/><p>Liu Xiao Tian immediately called Bureau Chief Qin.</p><br/><p>“Bureau Chief, something big has happened.”</p><br/><p>“What is it?” Chief Qin asked.</p><br/><p>“Master Lin wants to hack his way to find out who cheated the old lady. More importantly, he said he wanted to hack into the bank system and access the police account but this is illegal.” Liu Xiao Tian said anxiously.</p><br/><p>“Haha,” Chief Qin laughed. “Little Tian, you’re just too innocent and you trust this Master Lin too much. Do you think all those guys who designed the system are rookies? Master Lin is just one person. Without any preparation, do you think he can hack the system? You’re really looking down on all those computer geniuses. Don’t get your hopes up too high. Master Lin is just saying that out of good intention.”</p><br/><p>Liu Xiao Tian was still a little worried, but he realized what Chief Qin said did have some logic to it. The people who designed the bank system weren’t rookies. It wasn’t going to be easy at all to hack into their system. “But Chief, what if he could actually do it?”</p><br/><p>“If he could do it by himself, I’ll give it to him. I’ll leave this problem to him. Don’t think too much, I still have meetings to attend. Alright, I’ll hang up now. You better do what you need to do.”</p><br/><p>He hung up.</p><br/><p>Liu Xiao Tian was still worried, but with the Chief’s green light, he felt a little more at ease.</p><br/><p>…</p><br/><p>Lin Fan dialed Elder Zheng’s number…</p><br/><p>“Elder Lin, how’s everything going? Are you calling me because you want to come to Beijing?” Elder Zheng chuckled on the phone.</p><br/><p>“Elder Zheng, I just need to ask you one thing. Did you see the news today about that seventy-something-year-old lady who got cheated?”</p><br/><p>“What news is that? I didn’t really pay any attention to it,” Elder Zheng replied in an unsure tone.</p><br/><p>“Say, don’t you think this is rather despicable? When I saw that news, my heart went out to her. It is just too despicable,” Lin Fan said, too impatient to explain the whole situation to him.</p><br/><p>Elder Zheng’s tone was heavy. “There are still things like this happening? If this happened to me, I’d kill those guys with a bullet each, but wait a minute. What are you going to do? If you need my help, I’m all yours. Although I’m old, I’m still useful.”</p><br/><p>“I don’t really need your help. I just need to ask you this. If I found those cheaters, do you think I’d be doing the right thing?” Lin Fan asked.</p><br/><p>“Definitely. Elder Lin, what is your plan?” Elder Zheng replied</p><br/><p>“It’s a secret, an absolute secret. However, what I’m about to do may just break a few national laws. So you see, me calling you now is to see if you would agree and support what I am about to do.”</p><br/><p>After living for so long, Elder Zheng knew exactly what moral conundrum Lin Fan was getting at. “I understand. Let me tell you, the bottom line is this. As long as you don’t hurt anyone innocent, compromise the people’s interest or cause any trouble for the country, I think that there shouldn’t be any moral issue with breaking a few laws.”</p><br/><p>“Really?” Lin Fan said excitedly. A big shot was a big shot, and the way he handled things was far less rigid and more logical compared to most people.</p><br/><p>“Truer than white gold. What do you think?” Elder Zheng laughed.</p><br/><p>Lin Fan was now full of confidence. “Elder Zheng, I must thank you. However, after I do this, I will definitely face the consequences. Why don’t you let them lock me up for a month?”</p><br/><p>Elder Zheng was puzzled. What exactly did Elder Lin want to do? Didn’t he already say that as long as he followed the three golden rules, there wouldn’t be any problem? What did Elder Lin mean when he said that he had to be locked up for one month after he accomplished what he was going to do? He didn’t think too much after that.</p><br/><p>“Don’t worry, as long as you don’t break those three golden rules, I, Elder Zheng will be your guarantor.”</p><br/><p>“Great, thank you so much!” Lin Fan said.</p><br/><p>The phone hung up.</p><br/><p>Lin Fans heart was full of energy and fighting spirit as he readied himself for what was about to come.</p><br/><p>Cloud Street!</p><br/><p>“Where did you go? Did you settle the problem?” Fraud Tian hurried over, asking Lin Fan.</p><br/><p>“We’ll see in awhile,” Lin Fan chuckled, not saying anymore after that.</p><br/><p>Thereafter, he took out his phone and wrote a post on Weibo.</p><br/><p>“I, Master Lin, am about to do something in the name of justice. In the face of evil, I cannot back down. I am about to make a move and seek justice for the old lady.”</p><br/><p>The netizens were all stunned.</p><br/><p>“666… this is really about to go down…”</p><br/><p>“Master Lin is about to defy the odds again.”</p><br/><p>“Keep calm and absolutely do not use violence.”</p><br/><p>“Lin Fan is about to burst out, and the world is about to shake.”</p><br/><p>“Damn, Master Lin. If you can solve this, my pet dog is yours.”</p><br/><p>…</p><br/><p>Sitting in front of the computer.</p><br/><p>Lin Fan combed his hair backward and cracked his knuckles, readying himself.</p><br/><p>Wu You Lan looked at him curiously. “Brother Lin, what are you doing?”</p><br/><p>I’m about to fight a virtual battle,” Lin Fan replied calmly.</p><br/><p>“Ah?” Wu You Lan stood there stunned, not quite understanding what Brother Lin was saying.</p><br/><p>Zhao Zhong Yang stood there shocked, and under Lin Fan’s instructions, he turned off his live broadcast. He stood next to Brother Lin, looking at him as his fingers flew across the keyboard mercilessly.</p><br/><p>“This is unimaginable…” everyone said, shocked. All they saw was Lin Fan’s ten fingers dancing across the keyboard without any hesitation.</p><br/><p>This was Autumn Sword Fish Killers consummate skill, the phantom butterfly hands. But compared to Autumn Sword Fish Killer, it was much more graceful and high-end.</p><br/><p>Lin Fan laughed coldly. In his twenty plus years of existence, he had never done a more intense battle than this.</p><br/><p>*pattering sounds*</p><br/><p>“You’re going to destroy the computer,” Fraud Tian exclaimed, as he saw the numerous lines of gibberish on the computer screen.</p><br/><p>Zhao Zhong Yang was experienced with computers and knew what the screen was showing. But he realized that Brother Lin’s skills were too superior for him to even understand. He looked on, confused and unable to understand what Lin Fan was typing.</p><br/><p>Lin Fan only knew how to attack but not conceal himself. With that in mind, he didn’t have any misgivings as he went on an all out direct attack on the system.</p><br/><p>Violence, speed, and complete suppression.</p><br/><p>In some city, a middle-aged woman rode her electric scooter to a bank deposit machine.</p><br/><p>She had just received a call, with the other party telling her that she had won a lucky draw and all she had to do now was transfer twenty thousand dollars to claim her prize money of one hundred and eighty thousand dollars.</p><br/><p>She had her suspicions at first, but the other party managed to convince her by telling her about which lucky draw she had entered, her name and which city she stayed in.</p><br/><p>She really had entered that lucky draw back then.</p><br/><p>When she heard that the prize money was one hundred and eighty thousand dollars, she was moved and decided to try her luck.</p><br/><p>Just as she pressed the send button to transfer the money to the other party, she realized that the deposit machine had something wrong with it.</p><br/><p>The screen was frozen and after loading a while, it still didn’t move.</p><br/><p>Suddenly!</p><br/><p>A sentence appeared on the ATM screen, causing her to be utterly shocked.</p><br/><p>“This bank account belongs to a cheater, do not remit money to this account.”</p><br/><p>Just at this moment, the ATM page went back to the first screen, showing that the transaction had failed.</p><br/><p>Am I seeing things?</p><br/><p>Thereafter, without hesitation, she inputted the bank account of the other party, preparing to send money over again.</p><br/><p>This time, her face turned pale.</p><br/><p>Notification:</p><br/><p>“Are you mentally handicapped? This bank account belongs to a scammer.”</p><br/><p>“Ah!” the middle-aged woman exclaimed, immediately pressing the emergency help button next to the ATM.</p><br/><p>“Quickly come, your ATM machine has some problems. It just called me mentally handicapped…”</p><br/><p>The bank staff was speechless.</p></div>\n</div>"}