{"title": "Chapter 514 - Clinging to the powerful and influential", "id": 514, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-514-clinging-to-the-powerful-and-influential", "volume_title": "Volume 6", "body": "<h1>Chapter 514 - Clinging to the powerful and influential</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After leaving the Eastern Han Group.</p><br/><p>Wang Ming Yang immediately called to ask what had happened. After Xu Zi Le told him about what had happened, he was probably extremely frightened.</p><br/><p>However, Lin Fan wasn’t capable a ‘spirit possession’ master. He couldn’t have explained it. He could only go on Baidu and search it up. After all, the Internet was filled with such information.</p><br/><p>After Wang Ming Yang rested for a day, he immediately returned to his old home. He felt that Zhao Shan must have had something to tell him. Returning home was the right thing to do.</p><br/><p>A few days had passed. Lin Fan had been writing teaching materials and he had completed a few of them.</p><br/><p>According to the knowledge in the Encyclopedia, some of the content in the Chinese Medicine foundational teaching materials that he had borrowed wasn’t up to scratch. However, after he made some corrections, the teaching materials had become perfect.</p><br/><p>Wu You Lan smiled, “How is the writing going?”</p><br/><p>Lin Fan nodded, “I’ve already completed two books. I’m working on another one now.”</p><br/><p>Wu You Lan’s eyes looked as if they were glimmering. She realized that Brother Lin was really multi-talented. He seemed as if he knew everything. Especially Chinese Medicine, which was such a difficult thing to master but yet he was able to do it so well. It was shocking.</p><br/><p>However, what Wu You Lan was frustrated about was her relationship with Brother Lin. It didn’t have much progress. Every time she wanted to initiate something, it was interrupted by another event.</p><br/><p>She always thought that her greatest enemy was Wu Huan Yue but she had been watching the news. Recently, Wu Huan Yue had been busy attending large-scale events. She wouldn’t have had time to visit Brother Lin. To Wu You Lan, she had to be wary of the other lustful women out there. However, she was already the closest to Brother Lin and she was naturally in the best position.</p><br/><p>Her figure and complexion were perfect.</p><br/><p>Confidence!</p><br/><p>She had to have confidence. She had to believe that she was the perfect one for him.</p><br/><p>Wu You Lan sat there and looked at Lin Fan as if she was admiring him. Lin Fan felt a little awkward. This lady’s stare was starting to get offensive.</p><br/><p>He felt like he was being exposed.</p><br/><p>Ding ding!</p><br/><p>Zhao Ming Qing called.</p><br/><p>“Teacher, how is the composition of the teaching materials? Is it successful?” Zhao Ming Qing asked with anticipation.</p><br/><p>This had a huge impact on the world of Chinese medicine. Just because of his mentor’s theories, there had been an uproar in the world of Chinese medicine. Furthermore, the Chinese Medicine Association would always be on his side. Therefore, his mentor’s theories were definitely supported.</p><br/><p>Furthermore, Zhou Qing Quan, the President of the Chinese Medicine Association was fully supportive of his mentor’s views and ideas. He felt that they had to improve on the past bad habits.</p><br/><p>Since the President had spoken about this, nobody else dared to say anything.</p><br/><p>However, the people from the Education Department were worried. Although this matter had nothing to do with them, they were the ones that published the teaching materials. They couldn’t say anything even though they were suffering. The public wouldn’t have believed them.</p><br/><p>Lin Fan smiled, “I finished two books already. If you’re interested, you can come to my shop.”</p><br/><p>Zhao Ming Qing was elated when he heard that. He felt that his mentor was extremely swift. “I will make my way there now.”</p><br/><p>After hanging up, Lin Fan continued to write and he thought about things.</p><br/><p>Ding ding!</p><br/><p>Wang Ming Yang called.</p><br/><p>Lin Fan felt that he was receiving a lot of calls everyday. His phone bills must have been crazy.</p><br/><p>Wang Ming Yang had gone back to his old home. This matter had affected him a lot. After he had first left his old home in the past, he had never returned until now.</p><br/><p>Lin Fan asked, “How did it go? How’s Zhao Shan’s family?”</p><br/><p>Wang Ming Yang said sadly, “After returning to my old home, I looked around for a while and realized that Zhao Shan’s family had moved away. I found out from the police station that their family is in a dire situation. It’s all my fault. I haven’t thought about this at all. The house that they’re living in is extremely torn and tattered. I think I’ll have to be here for some time to build a nice house for them. I was very much responsible for Zhao Shan’s death.”</p><br/><p>Lin Fan said, “Alright, don’t think too much about it. It has already happened. You have to manage this matter properly. The conflict in your heart has been resolved and you don’t have to think about it anymore.”</p><br/><p>“Okay.” Wang Ming Yang agreed with what he said. He wanted to manage this matter properly. After all, Zhao Shan’s family had lost their sole breadwinner and their future was ruined.</p><br/><p>Lin Fan didn’t want to ask anything more about it. This matter wasn’t something that happened to him often and there was no need for him to be thinking about it.</p><br/><p>After chatting with Wang Ming Yang for a little more, he hung up.</p><br/><p>After a moment.</p><br/><p>Zhao Ming Qing came over ecstatically. “Teacher, where are the teaching materials?”</p><br/><p>Lin Fan chuckled, “The teaching materials are all you think about.”</p><br/><p>Zhao Ming Qing smiled embarrassedly, “No, I’m just a little excited. After all, these materials are composed by my mentor. They’re definitely of superior quality. It is beneficial to the entire world of Chinese Medicine.”</p><br/><p>“Alright, stop praising me. Just look at them.” Lin Fan handed two books to him. He didn’t mention how good these books were but they were definitely flawless.</p><br/><p>Even a beginner would be able to understand them. Even beginners would understand what Chinese Medicine was all about and what was the main purpose of it.</p><br/><p>‘Foundational Chinese Medicine’</p><br/><p>Zhao Ming Qing flipped to the first page and read it slowly. Lin Fan didn’t disturb him after that, he just continued writing another book.</p><br/><p>Wu You Lan poured a cup of tea for him. Meanwhile, Wu Tian He looked at Zhao Ming Qing. He finally understood the power of Master Lin.</p><br/><p>In Lianzhou, Wu Tian He was considered a powerful individual. However, he realized that he wasn’t that powerful after all.</p><br/><p>He was now just reading fortunes in this small shop and it was a decent job. He could chat with people and talk about life. Furthermore, his daughter was right by him and he felt that his life was blissful.</p><br/><p>However, what Wu Tian He hadn’t expected was to have met a good friend like Fraud Tian in the later years of his life.</p><br/><p>He was someone who had a drastically different mindset.</p><br/><p>However, when the two of them were together, they could actually click with one another.</p><br/><p>“Awesome!”</p><br/><p>Suddenly, Zhao Ming Qing shouted. He looked at Lin Fan in awe. “Teacher, this is so well-written. This ‘Foundational Chinese Medicine’ accurately depicts the humble beginnings of Chinese medicine. This is way better than the old teaching materials.”</p><br/><p>“It’s not surprising. Is this your first day knowing me? It has to be well-written. If not, would I be qualified enough to be your mentor?” Lin Fan said.</p><br/><p>Zhao Ming Qing smiled awkwardly, “That is right. I was just too emotional. This is a great masterpiece and it will be a valuable treasure to any Chinese medical practitioner. To us, it will definitely be extremely beneficial too. It will strengthen our foundation and give us a deeper understanding of Chinese medicine.”</p><br/><p>Zhao Ming Qing wasn’t just praising Lin Fan, he was speaking the truth.</p><br/><p>Then, Zhao Ming Qing sighed. It was good to have a mentor. He could always have a strong support and he found relief in having one.</p><br/><p>Although he was an old man, he was young at heart.</p><br/><p>He felt that there weren’t any problems with clinging onto someone as powerful and influential as him.</p></div>\n</div>"}