{"title": "Chapter 541 - Fists are the only truth", "id": 541, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-541-fists-are-the-only-truth", "volume_title": "Volume 6", "body": "<h1>Chapter 541 - Fists are the only truth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The surrounding shop owners went forward hastily, “Little Boss, stay calm. You have to stay calm.”</p><br/><p>Fraud Tian said softly by the side, “You can’t hit them. Girls are naturally seen as more vulnerable on the Internet. You’ll get flamed to death.”</p><br/><p>This was the first time Wu You Lan had seen Lin Fan hit a girl. Suddenly, she was at a loss.</p><br/><p>Such individuality.</p><br/><p>Lin Fan said, “Let me tell you, I hit you because I want to let you know that you should think before you speak. Don’t think that just because you’re females, you won’t get hit. This is all I’ll say today. Apologize to Auntie Gao. As for the matter between you and I, you can come look for me anytime. I’ll slowly play with you.”</p><br/><p>Such dominance.</p><br/><p>The shop owners were all stunned. They always knew that Little Boss was very dominant but they couldn’t tell that he could be this dominant. It was simply scary.</p><br/><p>If they hadn’t seen this for themselves, they wouldn’t have dared to believe that Little Boss would actually be this dominant.</p><br/><p>But this matter has already happened. He had hit someone and there was probably going to be some repercussion.</p><br/><p>The two girls were a little scared now. They never thought that this man would dare to hit them. Initially, they were relying on the assumption that no one would dare to hit them because this was Shanghai and hitting someone was a crime.</p><br/><p>Lin Fan’s brows furrowed, “Did you hear what I said?”</p><br/><p>“Ah! Don’t hit us.” The taller girl’s eyes had turned red and she was already completely frightened. She let out a miserable expression and gave off a feeling of someone who needed protection.</p><br/><p>The surrounding shop owners looked at the two girls and couldn’t help but shake their heads and laugh. Where did that arrogance from before go to? Who knew they would turn so weak so quickly?</p><br/><p>“Don’t show this kind of disgusting expression as if I’m bullying you. Did you hear what I said or not?” Lin Fan said in a stern tone.</p><br/><p>The shorter girl nodded, “We heard it, we heard it.”</p><br/><p>“That’s good. Now apologize to this Auntie and clean up the dog feces on the floor. As for me hitting you, I admit to it. You can do whatever you like. I’ll cooperate willingly, okay?” Lin Fan wasn’t afraid of all this. They were asking for a beating and reasoning with them was not an option at that moment. The only reasoning they needed was to get hit.</p><br/><p>Auntie Gao was at a loss for words, “Little Boss, I…”</p><br/><p>Lin Fan waved his hand, “It’s nothing. I’ll resolve this matter. We, the people of Cloud Street, will not be bullied. Isn’t that right, everyone?”</p><br/><p>“That’s right, don’t worry Sister Gao. Little Boss will resolve this matter.”</p><br/><p>“These two ladies are too despicable. I don’t know how they were raised. It’s considered a good thing that they were hit by Little Boss. If it was somewhere else, it wouldn’t have been the same.”</p><br/><p>“I heard that in some places, they don’t care if you’re male or female, they’ll hit you till half your body is paralyzed.”</p><br/><p>“That kind of thing indeed exists.”</p><br/><p>…</p><br/><p>The two girls stood up, trembling. They had really been frightened. As they looked at Lin Fan, their faces were pale and they said weakly, “Don’t hit us anymore. We’ll apologize.”</p><br/><p>“Hurry up then. What are you dawdling for?” Lin Fan said strictly.</p><br/><p>The two of them went in front of Auntie Gao and said, “Sorry, Auntie. We didn’t do it on purpose.”</p><br/><p>Auntie Gao didn’t say much. She just nodded.</p><br/><p>Lin Fan pointed at the dog feces on the ground, “Clean it up.”</p><br/><p>The two of them were a little reluctant but seeing Lin Fan’s fierce look, they took out tissues from their bags and wrapped up the dog feces. Then, they threw it into the rubbish bin at the side. “Brother, is that okay?”</p><br/><p>“Remember, it was me who hit you. If you want to come looking, then look for me. If I find out that you dare to trouble this Auntie after this, I’ll make you face the consequences, understand?” Lin Fan said.</p><br/><p>“We understand, we understand.” The two of them hurriedly nodded.</p><br/><p>“Scram.”</p><br/><p>The two of them immediately carried their little dogs and left the place. However, as they turned around, the two of them had rage in their hearts. They felt an urge to kill Lin Fan.</p><br/><p>Then, they ran away without turning back at all.</p><br/><p>Lin Fan took a deep breath to calm himself down. “D*mn, they even said that I was being cheated on. I don’t even have a girlfriend. I don’t even meet the prerequisite.”</p><br/><p>Auntie Gao said gratefully, “Little Boss, I’m really so thankful for you.”</p><br/><p>Lin Fan waved his hand, “It was nothing. This kind of people just deserves a beating. Otherwise, they won’t know the limit. Don’t worry. If they come causing trouble for you, just tell me.”</p><br/><p>“They won’t. I don’t think they will,” said Auntie Gao.</p><br/><p>The shop owners laughed, “Little Boss is indeed the most dominant. This kind of people really deserve to be beaten but we didn’t have the guts, unlike Little Boss.”</p><br/><p>“Although hitting women isn’t good, sometimes, you have to look at the situation. They were both spoiled kids.”</p><br/><p>“I wonder which idiot said that men cannot hit women no matter what. How can this kind of people not be beaten?”</p><br/><p>“That’s true.”</p><br/><p>“Everyone, time to disperse. There’s nothing to see anymore.”</p><br/><p>Lil’ Fatty Chang went in front of Master Lin. “Uncle Lin, don’t worry. If anything happens in Cloud Street in future, I’ll let you know immediately.”</p><br/><p>Lin Fan patted Lil’ Fatty Chang on the head. “Mmm, not bad. In future, you’ll be responsible for safeguarding the peace of Cloud Street. Don’t let me down.”</p><br/><p>Lil’ Fatty Change looked up at Uncle Lin. His eyes were filled with boundless hope as he said loudly, “Don’t worry, Uncle Lin! With me around, Cloud Street will definitely be peaceful. I promise that I’ll definitely carry out my responsibility.”</p><br/><p>“Go on then. Look for me if there’s anything in future,” said Lin Fan.</p><br/><p>“Yes.” Lil’ Fatty smiled with exceptional joy. He had finally gained Uncle Lin’s recognition. Who would dare to bully him anymore in future?</p><br/><p>Haha!</p><br/><p>Outside Cloud Street.</p><br/><p>The two girls hadn’t left yet. They were clenching their teeth as one of them said, “B*stard. He actually dared to hit me. I have to tell my boyfriend.”</p><br/><p>“I haven’t been beaten in my whole life before. What rights does he have? I have to tell my father.”</p><br/><p>The taller girl nodded, “Right, tell Uncle.”</p><br/><p>Lin Fan knew that this matter definitely wouldn’t end so easily. But he didn’t let it bother him. It was just a small matter.</p><br/><p>Fraud Tian raised his thumb. “Awesome. I thought you would have tender feelings for females. I never thought that you would hit her.”</p><br/><p>Lin Fan shrugged, “It’s not that I don’t have tender feelings for females but this kind of people really deserves to be hit. If they were male, they would definitely have to be carried out of this place today.”</p><br/><p>Wu Tian He said, “Next time, you shouldn’t hit them if it’s avoidable. That situation just now would have been resolved easily by calling the police.”</p><br/><p>Lin Fan waved his hand. “Calling the police would only mediate things. The two girls would definitely not repent. When reasoning can’t be used, fists are the only way to resolve things. If there are any issues, then come. I, Lin Fan, have never been afraid. I’ve even been imprisoned before, who would I be scared of?”</p><br/><p>Wu You Lan said worriedly, “Brother Lin, you can’t be imprisoned again. We’d be very worried.”</p><br/><p>Lin Fan nodded, “Mmm, got it.”</p><br/><p>For some reason, Wu You Lan suddenly said, “And don’t let those words bother you. No one will cheat on you.”</p><br/><p>“Er?” Lin Fan was taken aback. “What did you just say?”</p><br/><p>“Nothing much. Oh yes, I recently met a very good friend,” Wu You Lan said.</p><br/><p>Lin Fan didn’t really pay attention. He casually replied, “That’s a good thing. It’s not bad to go shopping with friends when you’re free. What’s your friend’s name?”</p><br/><p>Wu You Lan smiled, “Liu Xu.”</p><br/><p>Lin Fan was dumbfounded.</p><br/><p>“Liu Xu?”</p><br/><p>Motherf*cker, isn’t that Brother Qiang Qiang?</p></div>\n</div>"}