{"title": "Chapter 545 - I’ll slowly play with you", "id": 545, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-545-i%E2%80%99ll-slowly-play-with-you", "volume_title": "Volume 6", "body": "<h1>Chapter 545 - I’ll slowly play with you</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Professor Yang’s speech ended.</p><br/><p>One of the specialists smiled as he said, “Master Lin, we are all together here. This time, we’re receiving a favor from you and next time, we’ll return the favor. We hope you’ll give us some face.”</p><br/><p>Another professor smiled, “These foundational teaching materials will be passed on for hundreds of generations. We are all common people and we wish for them to be passed down. If you agree, from now on, you’ll be one of us. Any teaching materials written by you will be strongly promoted by us.”</p><br/><p>Professor Yang, who was on the stage, said, “Master Lin, we really recognize your talents. As long as you have our support, you will have a smooth sail in the medical world. In a period of time, there will be an International Medical Exchange Gathering. We can nominate you to join. It will be a great opportunity to become famous on the international stage.”</p><br/><p>They were coaxing and pestering Lin Fan to make him agree.</p><br/><p>Zhao Ming Qing was so angry that his whole body was trembling. He had heard that these people were messed up and that they would do anything for fame. Some young and talented people have had their achievements stolen by this older generation before. However, they could only suck it up. Even if they tried to protest, they didn’t have the power to do so.</p><br/><p>Zhao Ming Qing had never expected such an incident to happen to his own teacher.</p><br/><p>He understood that if they fell out with these professors, the outcome would not be pleasant.</p><br/><p>At that moment, Professor Yang looked curiously at Lin Fan, “Master Lin, what are you doing?”</p><br/><p>Lin Fan held his phone and turned it in a circular motion. “What am I doing? Can’t you see? I’m recording a video.”</p><br/><p>Professor Yang’s expression turned slightly ugly but he maintained his cool. “Master Lin, there are rules here. I hope you understand.”</p><br/><p>Lin Fan kept his phone and instantly exploded, “Understand your mom! You old b*stards, don’t you have any f*cking shame? I initially thought that you all were friendly. It turns out you all want to f*ck me up. Let me tell you that that’s not possible. The teaching materials that I’ve written are mine. Don’t even think of signing your names. Let’s go, Ming Qing…”</p><br/><p>Zhao Ming Qing gave a cold ‘Hmph’. Despicable. Shameless. They actually dared to take away his teacher’s achievements. They had to be dreaming.</p><br/><p>Professor Yang had a displeased look on his face but he couldn’t stop Lin Fan from leaving. Then, his voice turned grave, “Master Lin, wait a moment. If there’s anything, we can discuss it.”</p><br/><p>“What’s there to talk about? There’s nothing to talk about. I told you, if you want to sign your names, then you can keep dreaming. Look at you old people, thinking about your personal fame and benefits all day. These teaching materials are written by me. They have nothing to do with you,” responded Lin Fan. Repulsive, simply repulsive. If he had known, he would never have come here.</p><br/><p>The specialized professors sitting below said, “Master Lin, calm your anger. We can talk through this slowly.”</p><br/><p>“Yeah. For your teaching materials to be distributed it has to have our agreement as well. If we don’t agree, your teaching materials wouldn’t be distributed so easily.”</p><br/><p>“In this industry, you have to understand this. Master Lin, do you understand?”</p><br/><p>Lin Fan looked at him, “Understand your sister. I don’t f*cking understand. If it’s not going to be distributed, then so be it. I have nothing to be afraid of.”</p><br/><p>“Master Lin, we’re talking nicely to you. Could you not speak so vulgarly?”</p><br/><p>“Ignorant, simply ignorant!”</p><br/><p>Lin Fan was very unhappy now. “I want to speak vulgarly, so what? Let me tell you, these teaching materials are written by me. If you dare to do anything, I won’t forgive you.”</p><br/><p>A rage had already risen up in Professor Yang’s heart. This kind of young kid really didn’t know what was good for him. It looked like he had never lost out before. He should have been able to take something like this. However, Professor Yang had to stay calm. He couldn’t get too agitated. Otherwise, if something big happened, he would be a laughing stock</p><br/><p>“Master Lin, I hope that you can calm down. Actually, there’s something else. We’ve already done a test distribution of the teaching materials. It’s not possible to suddenly take them back. It would affect everyone here. You should understand the importance of this,” said Professor Yang.</p><br/><p>This was equivalent to acting first and reporting afterward. They had not discussed this with Lin Fan at all. They had done a test distribution, with the ten names added to the credits. If they take it back, it would really become a big joke.</p><br/><p>Zhao Ming Qing had been quiet the whole while but when he heard this, he couldn’t help but bellow, “You all are bandits! You actually did a test distribution…”</p><br/><p>He hated such behavior very much but he had never expected that these guys would do a test distribution. If they had already done a test distribution, then it was already in the waters. It would be hard to go back.</p><br/><p>If the outside world found out, there would be very negative public opinion.</p><br/><p>This burst of rage was followed by peace and quiet.</p><br/><p>Lin Fan was now very calm. “Professor Yang, you distributed my teaching materials without my permission?”</p><br/><p>Professor Yang was a little embarrassed. “Master Lin, I know that you’re very angry but you can tell us any conditions that you have and we will satisfy them. The test distribution was something that all of us, after much discussion have decided upon. We hope that you can calm down.”</p><br/><p>“We can give you even more compensation. For example, we can let you enter the International Medical Teaching Material Writing Association or we could organize a National Medical Conference for you. You would be able to become well-known in the national medical scene in a short amount of time…”</p><br/><p>“Alright, just shut up. Since all of you are old, I won’t use violence against you. If you were twenty or thirty years younger, you would all be lying on the ground.” Lin Fan didn’t want to talk anymore. He was prepared to leave.</p><br/><p>What kind of game was this? Without even giving a heads up, they had added their names to the teaching materials and even did a f*cking test distribution.</p><br/><p>The leader, who had been hiding backstage the whole while was dumbfounded. He never expected things to turn out like this.</p><br/><p>They hadn’t even reached an agreement.</p><br/><p>“What is going on with you all? I went out for a while and you all started arguing.” He quickly came out from the backstage. He had to suppress the matter. If this got out of hand, things would be bad.</p><br/><p>With his back facing Lin Fan, Professor Yang nodded at the leader. His meaning was clear, they couldn’t resolve this and they needed his help.</p><br/><p>The Education Department’s leader smiled as he went forward and patted Lin Fan on his shoulder. “What’s going on, Master Lin? Why are you angry? What’s there that can’t be talked through slowly?”</p><br/><p>Lin Fan glanced at him, “I think you know what’s the situation.”</p><br/><p>The leader was silent for a moment, then he nodded, “I know. It isn’t good for me to talk too much about this but I hope that Master Lin can give me some face. Everyone will owe you a favor for this. You should know too, this…”</p><br/><p>He didn’t finish talking.</p><br/><p>Lin Fan waved his hand and interrupted, “Don’t talk about all this. I have never liked for people to owe me favors. Moreover, what I can’t do by myself can’t be done by them. This matter, let us slowly resolve it.”</p><br/><p>The leader hastily stopped Lin Fan, “Master Lin, what’s the point of being so rigid? If things really get out of hand, it won’t be any good to the medical world. These are all professors with high morals and virtues. Won’t you offend all of them? It won’t be any good to you in future. Therefore, I hope that you can reconsider. It is just a signing of names.”</p><br/><p>“Ming Qing, let’s go.” Lin Fan left without turning back.</p><br/><p>Zhao Ming Qing gave everyone one last look before leaving as well.</p><br/><p>After they left, everyone else started raging.</p><br/><p>“What kind of game is this? Who does he think he is?”</p><br/><p>“Professor Yang, is he for real?”</p><br/><p>Professor Yang was clueless. The leader shook his head, “I don’t think anything will happen. He is a smart man and he should know what to do. If things really get out of hand, he would be everyone’s public enemy and he won’t be able to do anything in future. As for that Zhao Ming Qing, I’ll talk to him. He should be able to understand.”</p><br/><p>Everyone let out breaths of relief. As long as everything was fine.</p><br/><p>But this kid really was too rigid in his way of thinking. They had done this kind of thing many times before but they had never come across such a situation.</p><br/><p>Moreover, in this industry, there were no conditions that couldn’t be settled upon. The only thing was whether everyone could be satisfied.</p><br/><p>Outside.</p><br/><p>Lin Fan was extremely upset. His pleasant mood had been ruined completely by these guys.</p><br/><p>“Calm down, Teacher. It’s not worth it to be angry with these people. If your health is affected because of this, it wouldn’t be worth it.”</p><br/><p>Lin Fan looked at the conference building. “If you all want to play, I’ll slowly play with you.”</p></div>\n</div>"}