{"title": "Chapter 549 - We’ve Been Impatient From The Start", "id": 549, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-549-we%E2%80%99ve-been-impatient-from-the-start", "volume_title": "Volume 6", "body": "<h1>Chapter 549 - We’ve Been Impatient From The Start</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Senior Professors were discussing amongst themselves, and their moods were good. They had already dominated the internet sphere.</p><br/><p>What Godly Doctor brat? He just collapsed at the first blow! How much could one person do against them? From what they knew, it was like taking candy from a baby.</p><br/><p>Everyone’s mood was good.</p><br/><p>However, Professor Yang was still worried. He felt uncomfortable on the inside, and he couldn’t figure out what was causing it.</p><br/><p>One of the Specialists smiled at him, “Professor Yang, what’s the matter? What are you thinking about?”</p><br/><p>Professor Yang shook his head. “Not sure, I just feel that something isn’t right, but I can’t figure out why.”</p><br/><p>“Heh? What couldn’t be right now? Do you think that brat can change everything by himself? Look at all the comments online! They are all in favor of us! However, that brat does have some fans and they did help to speak up for him. But compared to the millions of people using the internet, the number of fans he has can’t even compare.”</p><br/><p>“The argument has fallen in our favor. What is there to worry about?”</p><br/><p>“What else can we say? We continue to promote our cause. His name has already been trampled on by us. However, we cannot be too narrow-minded and have to continue to do what we are doing, promoting the book with our names to all the Chinese Medicine institutions. Furthermore, I’ve already discussed with some people. When they promote the book, I asked them to single out his name and to say all the bad things about him.”</p><br/><p>“Haha, this tactic is just brilliant.”</p><br/><p>“Eh, this kid looks like he has accepted his place. Looks like someone is scared.”</p><br/><p>“We can’t just leave it like this. We need to add some fuel to the flames.”</p><br/><p>Professor Yang sat down at one corner. He was forgetting something but he didn’t know what!</p><br/><p>…</p><br/><p>Newspaper Office.</p><br/><p>The journalists made their way back.</p><br/><p>“We got ourselves a huge piece of news!”</p><br/><p>“What news?”</p><br/><p>“All those Senior Professors were the ones who purposely defrauded Master Lin, and we have video graphic proof.”</p><br/><p>After the Editor in Chief finished watching the video, his facial expression turned solemn. “These people are just too despicable. I thought that journalists were good at distorting truths, but these guys are just way craftier and sneaky. No, this cannot happen. Master Lin is the pride of Shanghai and we must get this video out to protect him.”</p><br/><p>“No, we can’t do that. Master Lin instructed us not to upload the video if the Senior Professors made an official apology. He said that if this video were to get out, the impact would be huge.”</p><br/><p>The Editor in Chief gave a serious look. “Pay attention to the situation online. If any of those Senior Professors decide to come out to slander Master Lin, upload the video immediately. Put it on the biggest billboard and let the whole world see it.”</p><br/><p>“Understood.”</p><br/><p>The Editor in Chief’s instructions was handed down to every single newspaper office in the nation.</p><br/><p>Shanghai’s first Chinese Medicine Institution.</p><br/><p>Zhao Ming Qing was panting with rage in his office.</p><br/><p>“Director, this is the new material handed to us by the Ministry of Education. Let us do an introduction to it.” the headmaster of the school came over, showing Zhao Ming Qing the new books.</p><br/><p>Zhao Ming Qing was in a bad mood. The new teaching material was perfect, albeit the authorship of the book, and that made him really angry. “You can give an introduction to the book, but remove all the names of the authors except for Lin Fan’s name.”</p><br/><p>The headmaster said worried. “That isn’t a good thing to do. These books were issued by the Ministry of Education.”</p><br/><p>“I don’t give a damn. I’m the director of this institution and I say that you bring it back and get the authorship changed before you do the introduction. Do I make myself clear?”</p><br/><p>The headmaster nodded. Alright, since the director has spoken, so be it.</p><br/><p>Online.</p><br/><p>“Why is Master Lin still keeping silent?”</p><br/><p>“Yea, it has been quite a long time. All these old farts are just despicable.”</p><br/><p>“I’m afraid that Master Lin may have admitted defeat.”</p><br/><p>“What rubbish? If Master Lin admits defeat, I’ll eat my own d*ck.”</p><br/><p>“That isn’t rubbish. Have you seen what kind of people the Senior Professors are? They have connections throughout the whole industry and no one would dare to say anything against them.</p><br/><p>“Isn’t he a member of the Chinese Medicine Association? How come there is no one inside to help voice out Master Lin’s problem?”</p><br/><p>“What do you guys know about it? Everyone knows them and holds them in high regard. Helping Master Lin would be as good as betraying a friend, and so the best solution was to keep quiet, as if the problem didn’t happen at all.”</p><br/><p>“Dammit, as the member of the twelve most loyal fans of Master Lin, I simply cannot take this. I already wrote hundreds of comments on the Weibo pages of the Senior Professors and I’m ready to do more.”</p><br/><p>The current situation was really messy. Most people didn’t know what was going on, but the fans of Master Lin continued to remain loyal and trusted him absolutely. The only problem was that they were outnumbered by the other netizens and couldn’t scold the senior professors enough to make an impact.</p><br/><p>After all, Master Lin was just one person, and he was against a group of powerful men- he would definitely be crushed.</p><br/><p>The internet was still siding on the side against Master Lin.</p><br/><p>Cloud Street.</p><br/><p>“Mum, there isn’t a problem. It’s really minor,” Lin Fan said over the phone.</p><br/><p>“This isn’t a small issue. Your dad already said those guys are Senior Professors! How could you fight with those Senior Professors?” Lin Fan’s mother said over the phone, worried about her son.</p><br/><p>“There isn’t anything wrong. Your son just wrote some educational material and all of them decided to add their names to the authorship of the books without my approval, and so a conflict broke out.”</p><br/><p>“What is the meaning of that? You were the one to write the book, why do they have to sign their names as well?” Lin Fan’s mother asked, puzzled.</p><br/><p>Lin Fan chuckled. “They wanted to ride on my prestige and popularity.”</p><br/><p>“What? These buggers dare to cheapen the hard work of my son? Don’t worry son, your father and I are your biggest supporters. Don’t be scared of them, but of course, don’t break the law again.” Mother Lin said.</p><br/><p>“I know. Don’t you worry,” Lin Fan helplessly said. Could it be that all they thought of him was him loving to break the law?</p><br/><p>Thereafter, Lin Fan opened his Weibo, and he couldn’t stand the sight of it.</p><br/><p>The group of Senior Professors continued to bash Lin Fan online and they had a lot of supporters. Although some of them didn’t bash him directly, their posts conveyed the meaning that Lin Fan was wrong, narrow-minded and only cared about his fame.</p><br/><p>And this problem was getting out of hand.</p><br/><p>There were even a few bigshots who came to criticize Lin Fan.</p><br/><p>“He has the skills of a fine doctor but no morals. He isn’t suited to be in this industry.”</p><br/><p>That comment was rather critical, but Lin Fan just brushed it off. This b*stard, I’ll let you have your fill now. You will regret it later.</p><br/><p>“Editor in Chief, should we post the video now? All those Senior Professors are getting out of hand. We have to play our trump card.”</p><br/><p>“Mm, it is time. Didn’t Master Lin say it? If they apologize, he’ll let them go, but if they don’t…”</p><br/><p>Every single news agency started getting into motion.</p><br/><p>They had been waiting impatiently, their hands holding on to the important evidence that Lin Fan had sent them, yet unable to expose it. This was slowly killing them on the inside.</p><br/><p>But now, those Senior Professors were getting out of hand. All they ever did whole day was rant about Lin Fan online, and it was time to take action against them.</p><br/><p>Once they released the video for everyone to watch, it would be over for the Senior Professors, and as if it wasn’t enough, the Editor in Chief took up the pen himself to write the news article, preparing for a huge storm.</p></div>\n</div>"}