{"title": "Chapter 556 - An awesome youngster", "id": 556, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-556-an-awesome-youngster", "volume_title": "Volume 6", "body": "<h1>Chapter 556 - An awesome youngster</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What are they even singing?” Wang Ming Yang looked at the five of them and said, “It’s time for us to leave. It’s pretty late now.”</p><br/><p>Lin Fan didn’t really want to leave yet. “It’s okay, let’s play a little longer.”</p><br/><p>“What’s so fun about this? Let them stay here, that’s it,” Wang Ming Yang said. He’d rather go back home to rest than to stay there and waste time with them.</p><br/><p>The five people that were kneeling down looked at Lin Fan in fear, “We have sung the song. Can we leave now?”</p><br/><p>They really wanted to leave the place.</p><br/><p>They had already been exposed and the consequences were going to be severe. They wanted to run away quickly. If they were to be caught, they’d be doomed.</p><br/><p>Lin Fan chuckled, “You call that singing? That’s worse than crying. Don’t even think about running away today. Kneel here.”</p><br/><p>“Huh?” The five of them were stunned. Then, they said, “Don’t go overboard.”</p><br/><p>“Haha, fool.” Lin Fan smiled. Then, he looked at the big patch of red paint on the wall. “What are we going to do about that? Are you going to leave it there till someone cleans it up tomorrow?”</p><br/><p>Wang Ming Yang patted Lin Fan on his shoulder, “Let someone clean it tomorrow. It’s good enough to have caught these people today. Let’s go back to sleep. If not, we won’t be able to wake up tomorrow.”</p><br/><p>They had wasted an hour on these idiots and it was already 3 am in the morning.</p><br/><p>At that moment, a cleaner drove a cleaning vehicle past them and when she saw what was on the wall, her face changed.</p><br/><p>“What are you guys doing?” The cleaner was a little nervous. This place was going to have VIPs in a few hours’ time. When she saw the red paint on the wall, she was stunned. If this were to be found out, someone was going to die.</p><br/><p>It was going to be extremely humiliating.</p><br/><p>Although she was just a cleaner, she knew that when the VIPs arrived in a few hours, a lot of reporters would be there too. If the foreign reporters were to take any pictures of this and spread it across the globe, the country would be shamed.</p><br/><p>Wang Ming Yang’s chauffeur knew that Chief Wang and Master Lin were a little drunk. He went forward to the cleaner, “Auntie, the situation was like this…”</p><br/><p>The driver told her everything and when the cleaner heard it, she looked at the five youngsters that were kneeling down. Her face changed again.</p><br/><p>“Hey, why did you guys do that?” The cleaner took out some tools from the toolbox. “There will be VIPs coming here at 9 am. If the VIPs were to see this place in this state, something is going to happen. You guys… You guys.”</p><br/><p>Lin Fan was a little curious when he heard that, “Auntie, what VIPs?”</p><br/><p>The cleaner said anxiously, “At 9 in the morning, Japanese VIPs will be here to look at this place. Foreign reporters will be here too. If people were to see this, what do you think will happen? People will be infuriated and our nation will be humiliated. An important anti-Japanese place had been ruined like this. It’s going to be crazy.”</p><br/><p>The cleaner immediately took out the cleaning tools and started to clean the stains on the wall. As she cleaned it, she realized that something was wrong. “This is oil paint…”</p><br/><p>The wall’s surface was thick and viscous and it became even worse as she cleaned further. It wasn’t going to work out.</p><br/><p>The cleaner didn’t know what to do and she was extremely nervous.</p><br/><p>Within the broadcast room.</p><br/><p>“D*mn, something’s going to happen later.”</p><br/><p>“These f*ckers. I really want to kill all of them. What are they going to do to resolve this?”</p><br/><p>“Look, the cleaner looks as if she is going to cry. If this were to be found out, she’s going to get punished.”</p><br/><p>“Quickly get people to clean it overnight. Hopefully, it would be cleaned finish in time.”</p><br/><p>“How could it be? These f*ckers caused a mess on a large surface area. Furthermore, oil paint isn’t easily cleaned up. Even if an army of people were here, it would be useless.”</p><br/><p>Wang Ming Yang looked at the few of them and his face became stern. “I am going to teach all of you a lesson.”</p><br/><p>The five youngsters were extremely scared when they saw his face.</p><br/><p>Lin Fan immediately waved his hand, “Ming Yang, don’t be anxious. Let me think about it.”</p><br/><p>“How could I not be anxious? Look, it’s already 3+ in the morning. We don’t even have six hours. If this were to be found in the morning, it would be a joke,” Wang Ming Yang said.</p><br/><p>Then, as he and Lin Fan were thinking about it, the five of them actually wanted to escape.</p><br/><p>Lin Fan immediately went forward, “Kneel down there.”</p><br/><p>The five of them realized that they suddenly couldn’t move at all. Their toes couldn’t move and that was extremely frightening.</p><br/><p>Lin Fan went to the cleaner, “Auntie, leave this to me. I have a way to clean this up.”</p><br/><p>The cleaner looked at Lin Fan, “Young chap, do you really have a way? I think there isn’t enough time.”</p><br/><p>“Don’t worry. Let me try,” Lin Fan said. Then, he took a cloth from the auntie’s hand and went towards his car.</p><br/><p>In the broadcasting room.</p><br/><p>“Master Lin, what are you doing?”</p><br/><p>“I don’t know. But I feel like there isn’t enough time. Oil paint is so difficult to clean.”</p><br/><p>“In the past, I spent half the day trying to clean oil paint stains on my floor. Furthermore, there aren’t any suitable tools to use here. It’s so difficult to clean.”</p><br/><p>“D*mn, what is he doing?”</p><br/><p>Then, Lin Fan opened his car’s oil tank and placed the cloth into it to let it soak up the car’s petrol.</p><br/><p>Wang Ming Yang asked curiously, “What are you doing? Can that clean this up?”</p><br/><p>Lin Fan smiled, “Of course.”</p><br/><p>Indeed, if he only relied on car petrol, nothing would’ve worked. However, he had the mystical boost of the Encyclopedia. Even if he didn’t use the car petrol, there wouldn’t have been a problem.</p><br/><p>As everyone looked at him in shock, Lin Fan started to wipe the wall. The mystical boost of the Encyclopedia was being used.</p><br/><p>The red oil paint was gradually disappearing.</p><br/><p>In an instant, the netizens who were watching the broadcast went crazy.</p><br/><p>“D*mn, that works?”</p><br/><p>“Haha, anything is possible for Master Lin.”</p><br/><p>The cleaner realized that it really worked and she heaved a sigh of relief. Then, he began to mimic Lin Fan’s actions. However, she frowned, “Young chap, why is it so different when I wipe it?”</p><br/><p>Lin Fan smiled. It was a difficult question to answer. However, he was Master Lin.</p><br/><p>“Auntie, just let me do it. I have a special technique. I won’t brag about it. I am the best at cleaning. Second to none. Just help me keep a lookout and bring some water for me.”</p><br/><p>The netizens in the broadcasting room were moved when they saw Lin Fan kneel down and bend over to clean the wall. His clothes were also stained with oil paint.</p><br/><p>“I feel like Master Lin is so handsome.”</p><br/><p>“Thank God for Master Lin passing by here. If not, the consequences would be unimaginable.”</p><br/><p>“Like it, you have to like it!”</p><br/><p>“That’s right. I didn’t expect Master Lin to be so good at cleaning. He is indeed a tough man.”</p><br/><p>“That’s too sexy.”</p><br/><p>The cleaner was moved when she saw that, “Young chap, thank you so much.”</p><br/><p>Lin Fan smiled, “It’s okay, it’s an easy task. Give me a clean cloth.”</p><br/><p>Wang Ming Yang and the chauffeur started to help out too. There wasn’t a lot of water. They immediately went to a 24h convenience store to buy a few boxes of water.</p><br/><p>What shocked them was that no matter how they cleaned it, it wasn’t as good as Master Lin. Those areas that Lin Fan had cleaned actually shined when the light was pointed at it. That shocked everybody.</p><br/><p>An hour later.</p><br/><p>Lin Fan’s clothes were extremely dirty while the wall had become really clean. It was even cleaner than before.</p><br/><p>“D*mn, are my eyes playing tricks on me? Why do I feel like this wall is newly built? Do you guys feel the same way?”</p><br/><p>“Yeah, look. It’s so clean!”</p><br/><p>“That’s scary.”</p><br/><p>The wall had been cleaned and the cleaner smiled. She shook Lin Fan’s hand to thank him, “Young chap, thank you so much.”</p><br/><p>Lin Fan’s hands were stained with oil paint. He just smiled. Then, Wang Ming Yang took some paper towels and wiped the sweat off Lin Fan’s forehead. “You’re too awesome.”</p><br/><p>“It’s only about 4 am. Since it’s already cleaned, let’s clean up everything here. After all, there is an event tomorrow and we have to present the best side to others. Let’s go!” Lin Fan said happily.</p><br/><p>They hustled till it was almost 5 am.</p><br/><p>When they cleaned the last corner, Lin Fan looked at the outer wall of Sihang and smiled. “Look, how is it?”</p><br/><p>Then, the crowd was stunned by what they saw.</p><br/><p>Wang Ming Yang said, “How did you even clean that?”</p><br/><p>The cleaner was extremely shocked too. She had been in this profession for really long but she had not seen someone who could clean so well. It was crazy.</p><br/><p>The netizens in the live broadcast chat room had been watching them right from the start. Although it wasn’t mindblowing, they were simply stunned when they saw the cleaned walls. The viewers in the live broadcast chat room started to increase in numbers. The number of viewers actually doubled.</p><br/><p>Lin Fan washed off the oil paint stains from his hand and smiled, “Alright, it’s done. Ming Yang, let’s go.”</p><br/><p>Then, he waved towards the netizens watching the live stream. “It has been cleaned but we can’t let these people go. We have to ensure that they face the punishment they deserve. Auntie, I’ll leave this to you. If the police officers are here, leave it to them. There are pictures of their crime here.”</p><br/><p>“Alright, I know that.” The cleaner nodded.</p><br/><p>Lin Fan smiled, “Let’s go home and sleep. We’ve been working through the night.”</p><br/><p>“Young chap, what’s your name?” The cleaner asked.</p><br/><p>Lin Fan waved his hand and didn’t want to say anything.</p><br/><p>The cleaner auntie heaved a sigh, “You’re such an awesome youngster. You’re not leaving your name after doing such a good deed…”</p><br/><p>However, the netizens in the live broadcast chat room were unsettled.</p><br/><p>“He is Lin Fan.”</p><br/><p>“He is called Master Lin…”</p></div>\n</div>"}