{"title": "Chapter 557 - This knowledge classification is unbelievable", "id": 557, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-557-this-knowledge-classification-is-unbelievable", "volume_title": "Volume 6", "body": "<h1>Chapter 557 - This knowledge classification is unbelievable</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the morning!</p><br/><p>At 9 o’clock.</p><br/><p>Sihang was extremely crowded. The notable leaders from Shanghai accompanied the VIPs there.</p><br/><p>When the notable leader from Shanghai saw Sihang, his eyes glimmered. He felt that it was incredible. This was somewhere he had been to before but it looked magnificent.</p><br/><p>It was simply too clean.</p><br/><p>The VIPs were stunned when they saw it too. Then, they asked the cleaners of Sihang. They were shocked by how clean it was and they were impressed.</p><br/><p>This made Shanghai’s notable leader extremely happy. He wanted to praise the leader of Sihang after the event.</p><br/><p>At the police station!</p><br/><p>The five people were being detained. The police officers looked at the content on the phone and were furious. They looked at the five people differently.</p><br/><p>If not for their attire, they might even have beaten them up.</p><br/><p>However, the way of the Heavens is fair and nobody can escape from it. They managed to arrest these people at 6 am after the public reported about them.</p><br/><p>When they arrived at the scene, the five of them were kneeling there and they couldn’t get up until half an hour later.</p><br/><p>According to the cleaner, those scums were reprimanded by someone but she didn’t know who he was.</p><br/><p>On the Internet.</p><br/><p>The video surfaced online.</p><br/><p>Countless people were infuriated when they saw the video. They wanted to kill those people. However, the situation changed.</p><br/><p>Lin Fan and the others came to teach those people a lesson. The first few parts of the video showed the two of them beating them up. It was entertaining and they felt like they had vented their anger on them.</p><br/><p>In the end, the segment about cleaning had left many of them impressed.</p><br/><p>“The first few parts of this video were infuriating but the last part is comforting.”</p><br/><p>“If these f*ckers appeared in front of me, I would definitely kill them.”</p><br/><p>“Haha, these fellas were unlucky enough to have met Master Lin. They’d probably be handicapped if they weren’t dead.”</p><br/><p>“Master Lin is too incredible. I’ve been convinced by him. I’m going to be a lifetime fan.”</p><br/><p>“I am at Sihang now. You don’t know how clean this place is. It’s literally spotless.”</p><br/><p>“That’s a little exaggerated.”</p><br/><p>“It isn’t.”</p><br/><p>The netizens were discussing it online.</p><br/><p>Even the reporters were praising the place for how clean it was.</p><br/><p>The matter didn’t have a huge impact. Although it wasn’t perfectly resolved, Sihang’s relevant leaders were extremely affected by this incident and it could be seen from their speech.</p><br/><p>These ‘Japanese activists’ were considered to be famous. Some of them were students but since this incident, perhaps they wouldn’t be accepted by any schools.</p><br/><p>This would leave a mark on their lives forever.</p><br/><p>Lin Fan didn’t know the outcome but even if he knew about it, he wouldn’t say anything about it.</p><br/><p>Some matters can be done, but others must not.</p><br/><p>Or there would never be a way back.</p><br/><p>At Cloud Street.</p><br/><p>The townsfolk gathered in front of Master Lin’s shop.</p><br/><p>“Why isn’t Little Boss back yet?”</p><br/><p>The townsfolk that knew what had happened said, “Don’t have to wait for him anymore. I think Little Boss will only be here late at night.”</p><br/><p>“Why? How did you know that?”</p><br/><p>“Didn’t you guys read the news? Little Boss met a group of people wearing Japanese army uniform who took pictures outside Sihang. They even splashed paint. Little Boss apprehended them and taught them a lesson. Then, he cleaned up the paint and only left at 5 am. It’s only 9 am now, we should let Little Boss have some rest.”</p><br/><p>“Huh? There has been such a thing? I didn’t know that.”</p><br/><p>“Look at the news, it’s been reported. Little Boss did it beautifully.”</p><br/><p>“Since it was like that, we shouldn’t wait any longer. Let Little Boss sleep then.”</p><br/><p>Fraud Tian stood at the door and was a little bitter. It was as if he was thinking about why Lin Fan didn’t bring him along for supper. However, the townsfolk actually agreed to let Little Boss have a rest today. That was a rare occurrence.</p><br/><p>“Fraud, if Little Boss comes to the shop, please let us know.”</p><br/><p>Fraud Tian nodded. “Okay. Also, don’t call me Fraud. Call me Master Tian.”</p><br/><p>The crowd laughed. “You can’t even match up to Little Boss. We’ll call you Fraud first. When you’ve promoted, then we’ll call you Master.”</p><br/><p>Wu You Lan read the news online and was elated when she realized that Brother Lin had done another good deed.</p><br/><p>In his house!</p><br/><p>Lin Fan was sleeping but he was suddenly awakened by a voice. Then, he sat on his bed.</p><br/><p>“D*mn, it’s here…”</p><br/><p>“The thirteenth page of knowledge has been completed. There will be an increase of 20 Encyclopedic Points.”</p><br/><p>“Unlocking the fourteenth page of knowledge. As it is the fourteenth page, it will be related to someone that is close to the host.”</p><br/><p>Lin Fan rubbed his eyes. He was extremely tired so it was hard for him to be excited that he was going to unlock a new page of knowledge.</p><br/><p>“Zhao Mingqing is extremely impressed by the host. Hence, the major classification of pill creation would be unlocked. It will be related to the creation of an intelligence pill. (Your mystical boost of the Encyclopedia will be strengthened)”</p><br/><p>“Task: To come up with a perfect intelligence pill.”</p><br/><p>“Task reward: Encyclopedic Points +30, the fifteenth knowledge page will be unlocked. The Encyclopedia’s departmental store will now be opened.”</p><br/><p>“Note: Since it is a small mythical knowledge classification and isn’t represented in modern society, the host doesn’t have to use the previous career’s knowledge.”</p><br/><p>“Current Encyclopedic Points: 340.”</p><br/><p>At the instant.</p><br/><p>Lin Fan stood up. His eyes glimmered.</p><br/><p>What?</p><br/><p>A small mythical knowledge classification?</p><br/><p>How could it be?</p><br/><p>When he received the Encyclopedia, he knew that there were the xianxia and wuxia classification but he wasn’t bothered by them at all because these classifications wouldn’t be useful in the modern society.</p><br/><p>However, he was stunned. He listened carefully to the Encyclopedia and it said that he unlocked a small mythical knowledge classification.</p><br/><p>This was a little frightening.</p><br/><p>Lin Fan looked at the fourteenth page of knowledge and was extremely stunned. It was as if he had seen a ghost.</p><br/><p>“Haha…”</p><br/><p>Then, Lin Fan started to laugh. This was in defiance of the natural order of things. It’s simply unbelievable.</p><br/><p>After more than ten knowledge classifications, he actually unlocked a small mythical knowledge classification. Although it was under the major classification of pill creation, it was still unbelievable.</p><br/><p>He had to figure out what was the matter with his student.</p><br/><p>Lin Fan immediately called Zhao Mingqing.</p><br/><p>“Mingqing, did you develop a new interest recently?” Lin Fan asked.</p><br/><p>Zhao Mingqing replied, “Teacher, you told me to develop an interest before. I am an old man and I am not suited for those that are too time-consuming. Therefore, I looked up my old books and I have been studying one recently. It’s a fictional book which talks about the creation of pills in the ancient times. I read more about it and realized that it was the essence of Chinese medicine. Although it doesn’t have much value, some of the theories are extremely logical.”</p><br/><p>Lin Fan was elated when he heard that. He couldn’t wait to start on it. “Mingqing, your mentor loves you so much. You have a great hobby. You have to continue studying it. Your mentor will be 100% supportive.”</p><br/><p>Zhao Mingqing didn’t understand what was happening, “Teacher, this…”</p><br/><p>Beep! Beep!</p><br/><p>The phone call ended.</p></div>\n</div>"}