{"title": "Chapter 551 - You win this time!", "id": 551, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-551-you-win-this-time", "volume_title": "Volume 6", "body": "<h1>Chapter 551 - You win this time!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cloud Street!</p><br/><p>Lin Fan was bumping around, looking outside. “There should be some people coming over later. I hope you guys don’t mind.” Lin Fan smiled.</p><br/><p>“Who’s coming? How do you know there will be people coming later?” Fraud Tian said, looking puzzled.</p><br/><p>“If they don’t come, something would be seriously wrong. The only thing is that I never thought that the video would be released that fast.”</p><br/><p>Fraud Tian understood what Lin Fan was saying. “Those b*stards won’t get any hospitality from us later, no chairs and no tea for them. They’re just going to stand.”</p><br/><p>Wu You Lan nodded her head in agreement. They couldn’t give them any grace at all.</p><br/><p>Just as Lin Fan predicted, a group of Senior Professors streamed towards Lin Fan’s shop.</p><br/><p>The Senior Professors stood outside the door, looking into the shop. Some of them were sulking terribly, but given the current situation, they couldn’t pit their might against Lin Fan anymore- it would just be suicide.</p><br/><p>Before they came, Professor Yang had prepared beforehand, his face beaming with friendliness. “Master Lin, we had to come down personally.”</p><br/><p>“Oh? If you have anything to say, just say it. I don’t really know you guys that well, so it wouldn’t make a difference if you guys came or not,” Lin Fan said, scanning the crowd.</p><br/><p>The professors cringed, that sentence was just so disrespectful.</p><br/><p>Regardless, they were the top of the Chinese Medicine business. They had good standings in the community and their network spread far and wide, and to be treated like this by Master Lin was something different.</p><br/><p>Professor Yang smiled awkwardly as he walked into the shop. Eyeing one of the stools, he walked over towards it, wanting to sit down before speaking to Master Lin.</p><br/><p>Just as he was about to sit, Fraud Tian put his foot on their chair, not even looking at him, treating them as if they weren’t there.</p><br/><p>This embarrassing moment made Professor unsure on what to do.</p><br/><p>Lin Fan chuckled. He wasn’t a man of big attitude, but he was someone who bore grudges. To those who wronged him, he sought never to give them any face.</p><br/><p>Although the people from the other party were elderly, a grudge was still a grudge. It wouldn’t make a difference even if they were young.</p><br/><p>Lin Fan took up his tea cup, slowly sipping from it. “Professor Yang, if you have something to say, say it. I’m rather busy.”</p><br/><p>“Master Lin, this is Professor Yang, how can you not give him any face at all?” one of the younger professors exclaimed, his face black with anger.</p><br/><p>Lin Fan looked up, wiping his face. “Your reputation is what you make it to be, but if you guys keep on thinking that just because you’re elderly and more senior and so you can defraud me, then you are terribly wrong. If you have something to say, please say it, otherwise please leave. I don’t have that much time to deal with you guys now.”</p><br/><p>Professor Yang put up his hands, signalling to the rest to shut up. Thereafter, he turned to Lin Fan. “Master Lin, do you really want to blow this issue up so big?”</p><br/><p>“Don’t think so much. I’m not the trouble maker here. This was completely your fault and has nothing to do with me. I’m the victim here- I was the one who wrote those books and you guys just signed your name on the authorship without my permission, and now you come here acting as if I owe you guys?”</p><br/><p>Professor Yang stayed silent. Just as he was about to speak, another noise broke his chain of thought.</p><br/><p>“Uncle Lin, I want to report that…” Lil’ Fatty raced over.</p><br/><p>Lin Fan lit up as he saw Lil’ Fatty. “Lil’ Fatty Chang, what is the problem?”</p><br/><p>Lil’ Fatty Chang’s shirt was dusty, and he looked like he had just been in a fight. “Zhang Xiao Hui copied my homework and so I went to tell his dad. In the end, Zhao Xiao Hui beat me up and I couldn’t fight back at all.”</p><br/><p>Lin Fan smiled, as he continued his conversation with Lil’ Fatty Chang, completely ignoring the presence of the Senior Professors, as if they were invisible.</p><br/><p>“Lil’ Fatty, could you stand one side first. We have to discuss with Master Lin about adult matters, please don’t disturb us,” one of the senior professors said strictly.</p><br/><p>Lil’ Fatty Chang looked at the people who were standing around with disgust. “I know you guys. You guys are the ones who tried to steal the credit from Uncle Lin. You guys are adults and are completely shameless. If something doesn’t belong to you, you shouldn’t take iit”</p><br/><p>“You little brat…”</p><br/><p>Seeing that the Senior Professors were going to scold him, Lil’ Fatty Chang went and hid behind Uncle Lin.</p><br/><p>“What do you guys want? Are you guys here to bully the residents of Cloud Street?” Lin Fan said, looking at them annoyed.</p><br/><p>“Master Lin, please don’t be angry. This is just a misunderstanding. Let us just discuss the issue at hand,” Professor Yang said.</p><br/><p>Alright, then let’s talk about this. What’s up with all the other professors here, who just came here to scold Lil’ Fatty. You guys are so old and still dare to bully little kids. You guys should apologise. If you don’t, I don’t think we have much else to say,” Lin Fan said, looking pissed.</p><br/><p>“Haha,” Lil’ Fatty Chang laughed, his face looking gleeful. “You want to bully me, you’ve got to go through my Uncle Lin first.”</p><br/><p>Professor Yang didn’t want to drag this small issue on since it was a complete waste of time. “Quickly, apologise to him.”</p><br/><p>The other senior professors looked at Lil’ Fatty, finally caving in, realising that apologising was the only way out.</p><br/><p>Thereafter, Lin Fan asked Lil’ Fatty to play at one corner, as he turned towards the senior professors, wanting to hear what they had to say.</p><br/><p>“Master Lin, we can discuss this issue now. The video has spread online and it has quite a huge impact on us. We didn’t think this through well enough and we didn’t discuss with you our reasons before doing it, so we hope that you won’t take offense because of it.”</p><br/><p>“Ah,” Lin Fan chuckled. “Professor yang, you guys are really sincere. Now that the video is out and the damage is irreversible, you still want to come to me to ask me not to take offense at al. I’ll tell you guys that I am unmoved by force or persuasion. All I care about is your attitude, and so if you guys would personally apologise to me in Weibo and admit that this was your fault, I am willing to forgive you guys. As for the video online, I have no control over it, since it wasn’t me who posted it, but all the same. If you wish to continue bickering, by all means.”</p><br/><p>“The apology we can do, but the video has to be deleted,” Professor Yang said.</p><br/><p>“Do you think it’s possible? The video was posted by the journalists and I’m only an ordinary person. How much power do you think I have over them to ask them to delete the video? I won’t discuss this further. Now, apology on Weibo, and I will forgive you guys.”</p><br/><p>Professor Yang’s face was heavy and solemn. If they apologised, it would mean that they would admit that they were in the wrong. It almost looked ridiculous, to have a bunch of respected Senior Professors to apologise to a young person.</p><br/><p>The other Senior Professors were discussing privately at the back. There was no way that they were going to apologise, they would just be shamed and embarrassed.</p><br/><p>“Master Lin, I know that you are a member of the Chinese Medicine Association, and I am rather friendly with Zhou Qing Quan. I hope that you would do this for my sake. If Zhou Qing Quan knew that you troubled us this much, it wouldn’t be a very good reflection on you, and would probably even affect your career progression in the future,” Professor Yang said.</p><br/><p>“Right, I’ll just ask you guys one thing. Before you guys came to look for me, did you try to get some inside information on me?” Lin Fan looked at Professor Yang, his head tilted.</p><br/><p>Professor Yang was stunned, not understanding what Master Lin meant. What insider information? What was there to know?</p><br/><p>“Come, I have Zhou Qing Quan’s number here. I’ll give him a call. As long as he tells me that he is on your side, I, Master Lin will not say anything else and will write off your wrongs immediately,” Lin Fan said, immediately taking out his phone.</p><br/><p>Lin Fan scrolled to one of his contacts and made a call.</p><br/><p>Speaker phone.</p><br/><p>“Master Lin?”</p><br/><p>Lin Fan looked at Professor Yang.</p><br/><p>Professor Yang looked back at Lin Fan, thereafter taking the phone from him. “Elder Zhou, this is Elder Yang. I’m standing next to Master Lin here. Could you pass your verdict on this? This case has a huge impact on us and as long as you say that you are on our side, Master Lin says that this case would be over.”</p><br/><p>Elder Zhou who was far away somewhere in the Capital City, was dumbfounded when he received the call. This call was meant to accuse Master Lin of being in the wrong. How could he not know Master Lin’s hidden meaning in his call?</p><br/><p>Suddenly, there was some ruckus going on on the other side of the phone.</p><br/><p>“Ah, not good, my heart problem is acting up again…ah…”</p><br/><p>“Plop!”</p><br/><p>The phone hung up.</p><br/><p>The people who were standing around were stunned, and Professor Yang didn’t know what to say. This…</p><br/><p>“Alright, what did you want to say just now? Otherwise, please issue a public apology on Weibo and I’ll forgive you guys. If not, we can bring this before the court of law,” Lin Fan said.</p><br/><p>“Also, I, Lin Fan, bear grudges but I also treat people kindly if they do the same. With you guys defrauding me, I’ll make sure you guys regret your decision all the way to the court if you don’t issue an apology. I’m giving you this one chance, please choose wisely. Alright, I won’t say anymore, talking to you guys is a waste of time. I still have to go to the Children’s Welfare Institute.” Lin Fan got up, preparing to leave. This issue didn’t need to be discussed, and any further discussion would have been a waste of time.</p><br/><p>“You’re still so young, and you really want to burn so many bridges now?”</p><br/><p>Lin Fan smiled, “I’m not afraid of that. Oh, I forgot to tell you guys that Chinese Medicine is actually my side job. My main profession is actually selling scallion pancakes. I’m not scared of you guys. If you want to smother and shut me out, go ahead, as if I care.”</p><br/><p>Professor Yang and the rest had never met such a rascal in their lives before who wasn’t scared of anything or anyone. If Lin Fan was concerned about this Chinese Medicine career, he would have at least tried not to offend the Senior Professors, but since he didn’t fear them at all, the Senior Professors couldn’t do anything about it.</p><br/><p>An apology would end this. If this case went to the courts, it would cause much more complications.</p><br/><p>This may even affect the harmony of the population.</p><br/><p>If it reached to that point, their reputations would really go down the drain.</p><br/><p>“Apology in Weibo it is.” Professor Yang thought deeply, finally making his decision.</p><br/><p>Lin Fan was full of smiles, immediately going out of his shop. “Alright, please do this as soon as possible, and please address me properly and say things directly, otherwise it wouldn’t count. Let’s hope we never cross paths against, and anyway I’m too lazy to meet you guys again.”</p><br/><p>…</p><br/><p>All the other senior professors looked at Professor Yang. “Do we really have to apologise?”</p><br/><p>Professor Yang heaved a sigh. “What other options do you guys have? If we really pursue this, me may come to regret it.”</p><br/><p>Professor Yang had already made his decision to kill this b*stard.</p><br/><p>Completely shut out and smother him, such that he’ll never be able to show his face outside ever again.</p><br/><p>For Lin Fan, this wasn’t even an issue for him. If they wanted to so something, it didn’t matter to him, since he barely knew them anyway.</p><br/><p>His main profession was a scallion pancake seller, and he still hadn’t completed his cleaning task yet, and he was still looking for spare time to complete it.</p><br/><p>He didn’t have time to deal with those Senior Professors b*llshit.</p><br/><p>…</p><br/><p>Weibo.</p><br/><p>Everyone was reacting in a frenzy.</p><br/><p>Professor Yang: “I express my deepest apologies to Master Lin. I have caused you alot of trouble and for that I am sorry…”</p><br/><p>A whole essay…</p><br/><p>The content of the apology was rather long.</p><br/><p>With Professor Yang as their unwilling leader, all the Senior Professors didn’t have a choice. It was unfortunate for them that the other party was so stubborn and didn’t even fear them at all.</p><br/><p>Professor Wang: “…”</p><br/><p>Professor Zhang: “…”</p><br/><p>The netizens all started laughing as they saw what had just happened.</p><br/><p>Lin Fan replied on Weibo.</p><br/><p>“Since you guys have apologised, I won’t pursue this matter anymore. You guys are respected Senior Professors, and so I’ll say one thing. You should rely on your own abilities and talents to succeed instead of taking credit for other people’s work. Learn humbly and work hard to come up with your own material. Resorting to such underhand tactics won’t pay off.”</p><br/><p>“Pff!”</p><br/><p>The netizens all couldn’t help but laugh. Master Lin was just too awesome.</p><br/><p>Professor Yang’s face turned sour after seeing Lin Fans reply. They were people of high standing and authority and they had just been schooled by someone so young. How embarrassing!</p><br/><p>But they could only endure this shame.</p><br/><p>You win this time!</p></div>\n</div>"}