{"title": "Chapter 560 - Don’t sow discord between Elder Dog and me", "id": 560, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-560-don%E2%80%99t-sow-discord-between-elder-dog-and-me", "volume_title": "Volume 6", "body": "<h1>Chapter 560 - Don’t sow discord between Elder Dog and me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The first experiment actually ended in the high-pressure cooker exploding.</p><br/><p>Although it was a failure, it was promising. At least he managed to create a defective Little Intelligence pill.</p><br/><p>However, it wasn’t really useful.</p><br/><p>He had only nine servings of ingredients left and he had to continue trying.</p><br/><p>However, he was heartbroken when he saw the state of his car. It had accompanied him for so many years and now it was ruined.</p><br/><p>He immediately called Wang Ming Yang.</p><br/><p>“Ming Yang, my car broke down,” Lin Fan said. At this moment, he could only find a young and wealthy man. Wealthy men like him had many cars and it wouldn’t be a problem to get him another one.</p><br/><p>Wang Ming Yang sounded as if it wasn’t a big deal. “Just get a new one then. I’ll get my assistant to send you my Jeep.”</p><br/><p>“Alright, a Jeep would be decent.” Lin Fan was satisfied with that offer.</p><br/><p>Then, Wang Ming Yang asked worriedly, “Why did it break down? Did you get into an accident?”</p><br/><p>“Can you not say that? What do you mean by an accident? I ruined it while creating a pill. If I didn’t react in time, I’d be ruined like the car. The metal shards would have pierced through me,” Lin Fan said.</p><br/><p>“Huh?” Wang Ming Yang was stunned. What did he say he was doing? Creating a pill?</p><br/><p>However, as he thought of how abnormal some of his friend’s actions were, he didn’t think too much about it. If he were to discuss it, he might go crazy from it.</p><br/><p>However, he still had the urge to ask him. “Bro, if you manage to create a pill for eternal life, please keep it for me.”</p><br/><p>“Of course. No problem at all. Alright, I’ll hang up now. I have to go study it.”</p><br/><p>After chatting with Wang Ming Yang for a while, he hung up. He had more important things to do.</p><br/><p>It was going to be nighttime soon.</p><br/><p>At home.</p><br/><p>Lin Fan opened the Encyclopedia and looked for methods to create the pill. He managed to find it but when he saw the trade value, he was stunned. It was literally a robbery!</p><br/><p>1000 Encyclopedic Points. He’d rather be dead.</p><br/><p>Furthermore, it wasn’t a one-time trade. This Encyclopedia was a little despicable.</p><br/><p>It was as if he knew how to make all the delicacies in the world but he didn’t know how to turn on the stove.</p><br/><p>He was extremely anxious and he started to sweat profusely.</p><br/><p>He lied down on the sofa and took out his phone. He went to Baidu and asked a question.</p><br/><p>“I am fascinated with pill creation. I would like to ask all the experts if you have any ideas about pill creation.”</p><br/><p>He spent a bit of money to push the question to the top of the trending list.</p><br/><p>One should never underestimate the intelligence of netizens. They could potentially provide important support and assistance.</p><br/><p>After waiting for a while, nobody replied. Lin Fan didn’t want to think too much about it. He just went to sleep and hoped for answers tomorrow morning.</p><br/><p>The next day!</p><br/><p>In the morning.</p><br/><p>Lin Fan woke up and quickly switched on his phone.</p><br/><p>When he read what he saw, he was stunned.</p><br/><p>“Sir, it’s not that easy to craft pills. You need several chemical elements. For example, mercury, sulfur, and lead, etc… With those, you’d be able to create the three divine pills.”</p><br/><p>“^ Are you an idiot? How could you suggest those oxides? Would you dare to eat a pill made of those elements? If you dare to eat it, I’ll call you daddy.”</p><br/><p>Lin Fan read the comments and realized that none of them seemed legitimate.</p><br/><p>The ancient art of pill creation was incredible. People could craft all sorts of divine pills. However, most of them were scams. They used sulfur, Five Minerals Powder, arsenic trioxide, etc. They treated these chemicals like divine pills but they ended up losing their lives.</p><br/><p>This is mythological alchemy by the Encyclopedia. It was nothing like in the ancient times. They were totally different things and couldn’t be compared to each other.</p><br/><p>Finally, there was a comment that caught Lin Fan’s eyes.</p><br/><p>“I’ve tried making pills before. It is totally possible with the current technology. For example, by using an induction cooker and placing the ingredients into it. You can plug it into a socket and the pills would be made after seven to eight hours. However, I’ve never tried it before. It’s just possible according to theory. You can give it a shot.”</p><br/><p>“^ An induction cooker won’t work. You have to use a pressure cooker. It would compress the essence of the ingredients inward and it would definitely be more stable.”</p><br/><p>Lin Fan read on further and decided to reward the fella who suggested the use of an induction cooker with the best answer.</p><br/><p>The person that suggested to use a pressure cooker should go to hell. He was almost killed by it the day before.</p><br/><p>At Cloud Street.</p><br/><p>Wang Ming Yang’s secretary sent the Jeep over. It was parked outside the shop. Fraud Tian was admiring it and he started to touch it with his bare hands. He wanted to have a seat inside.</p><br/><p>The secretary was waiting outside and when he saw the ruined Mercedes, he was extremely shocked. The door seemed to have been pierced through by something sharp. There was a crack. At the same time, he didn’t understand what Master Lin went through. How did it end up like that?</p><br/><p>“Master Lin, please keep the car keys. I will drive this old car away,” the assistant said politely.</p><br/><p>Lin Fan smiled and nodded, “Alright, sorry for the trouble.”</p><br/><p>The secretary waved his hand, “No worries.”</p><br/><p>When he left, Fraud Tian said enviously, “Where did you get this car from? Why do you always have luxurious cars?”</p><br/><p>Lin Fan smiled, “I just requested for it from Wang Ming Yang. How is it? Is it better than before?”</p><br/><p>Fraud Tian nodded. “Yeah, it’s really better than before. Can I use it for a few days?”</p><br/><p>Lin Fan looked at Fraud Tian and said, “No.”</p><br/><p>“Fine, I’ll lock the door then.”</p><br/><p>In the morning, the townsfolk had already gathered there. Lin Fan started to get busy. However, he was just thinking about concocting the pill. He wasn’t going to feel comfortable until he finally created the Little Intelligence pill.</p><br/><p>He completed his scallion pancakes job.</p><br/><p>Lin Fan squatted at the entrance and smiled, “Elder Dog, do you want something good?”</p><br/><p>Elder Dog Nicholas looked at Lin Fan and lowered his head to rest. However, he would glance at Sister Hong’s shop occasionally.</p><br/><p>His ‘dog wife’ was there and she was pregnant. He had to protect her own wife and not let her be disturbed.</p><br/><p>Elder Dog wasn’t being cooperative and Lin Fan felt helpless. However, the defective Little Intelligence pill had to be consumed by someone close to him.</p><br/><p>Elder Dog was the best candidate for the pill.</p><br/><p>Lin Fan took out the white Intelligence pill and placed it on his palm. “Elder Dog, come and have a lick. This is a superb item and you would become a deity if you consume it.”</p><br/><p>Elder Dog looked at Lin Fan and sniffed it. It didn’t have any smell. “What kind of rubbish is this? Just take it away from me.”</p><br/><p>Lin Fan was stunned. He didn’t expect Elder Dog to have looked down on him. Elder Dog actually said that it was rubbish. He couldn’t tolerate it anymore.</p><br/><p>Fraud Tian came over, “What is that?”</p><br/><p>Lin Fan said proudly, “This is the divine pill that I created.”</p><br/><p>“Oh, really?” Fraud Tian was a little stunned. Then, he looked at the white pill. “Are you going to let Elder Dog be your guinea pig?”</p><br/><p>Lin Fan said sternly, “How could that be? Elder Dog has been working hard in our shop. He’s always been looking after the door. I would definitely give the best stuff to Elder Dog. What do you mean by he’s a guinea pig? Are you trying to sow discord between Elder Dog and me?”</p><br/><p>Fraud Tian looked at Lin Fan, “Alright, ‘reward’ him then. Only a stupid dog like him would believe you.”</p><br/><p>Lin Fan didn’t say anything. When he finally created the Intelligence pill, he definitely wouldn’t give it to Fraud Tian. He wanted him to be the stupidest man in the shop.</p><br/><p>Elder Dog was frustrated by Lin Fan. He was blocking his view of the entrance. Then, he immediately swallowed the pill and lied down quietly.</p><br/><p>Lin Fan asked curiously, “Elder Dog, do you feel anything?”</p><br/><p>Elder Dog barked, “Get lost!”</p></div>\n</div>"}