{"title": "Chapter 564 - Never mess with pits again", "id": 564, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-564-never-mess-with-pits-again", "volume_title": "Volume 6", "body": "<h1>Chapter 564 - Never mess with pits again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Crafting the little intelligence pills made him feel at a loss. If he were to have higher grade pills in the future, how f*cked up would those be? Indeed, this game of mythical classifications wasn’t easy to play.</p><br/><p>As for the pressure cooker explosions, he had already figured it out.</p><br/><p>The pressure inside keeps building up and the essence of the herbal medicine permeates within it. If you have X-ray vision, you would realize that just before the explosion, a vortex forms inside and the essence of the herbal medicine condenses together. At the moment of explosion, it turns into a pill.</p><br/><p>That was the theory behind it. As for why this happens, who knows?</p><br/><p>In front of the pit, Lin Fan gently picks up the pill with two fingers from inside the pit.</p><br/><p>“Hey, not bad.” A grin spread across Lin Fan’s face. It was a complete little intelligence pill. Although it was just a normal little intelligence pill, it was much better than the one before. It didn’t have cracks and was very complete.</p><br/><p>Then, he continued to inspect the remaining six pits.</p><br/><p>There were four defective little intelligence pills and three normal little intelligence pills. There wasn’t a single perfect little intelligence pill. That was a little depressing.</p><br/><p>However, this made Lin Fan realize for the first time that crafting pills wasn’t such an easy task.</p><br/><p>Moreover, the stability of using pressure cooker was low and many defective products would be produced. However, this experiment at least showed that pressure cookers could definitely be used to create pills.</p><br/><p>Defective little intelligence pill: The effectiveness is next to nothing. It is basically useless.</p><br/><p>Normal little intelligence pill: Has slight use. However, the user must constantly use his/her brain and raise the activity level of the brain.</p><br/><p>He placed the little intelligence pills in his pocket. He decided not to craft any more pills before he found an alchemy furnace. The ingredients were super expensive and more importantly, it was too f*cking dangerous.</p><br/><p>Lin Fan took a look at his Hummer and embarrassedly shook his head. If Wang Ming Yang found out that Lin Fan had ruined another car, he might just collapse.</p><br/><p>It was getting late. Lin Fan didn’t think too much and just went straight home to rest.</p><br/><p>The next day!</p><br/><p>In the early morning.</p><br/><p>Cloud Street.</p><br/><p>,”,,,?”</p><br/><p>,,,,,.</p><br/><p>Fraud Tian cried out in a surprised tone, “D*mn, kid, what were you doing last night? Wasn’t it fine yesterday? How did it become like this?”</p><br/><p>The Hummer still looked domineering when he saw it the previous day, but today, he saw that it has been completely ruined. There were scars and scratches all over the car’s body. It was as if it had taken some serious damage. It was beyond recognition and it was hard to even look at.</p><br/><p>Lin Fan sighed, “It’s a long story. I shan’t say. I shan’t say.”</p><br/><p>Lin Fan felt helpless too. This wasn’t what he wanted to see either. Who knew it would turn out this way?</p><br/><p>Now, he didn’t know what to say to Wang Ming Yang. His skin wasn’t thick enough. He had spoiled two cars in two days, was he even human?</p><br/><p>Zhao Zhong Yang asked, “Brother Lin, where did you go yesterday? There’s news about you on this website.”</p><br/><p>“Is that so?” Lin Fan looked over curiously.</p><br/><p>It turned out that the previous day’s incident had already been reported. The evil behind the scenes had also been exposed and made known to the public. He was getting cursed at by countless netizens.</p><br/><p>For him to do such a thing, it naturally stirred up the netizens.</p><br/><p>Lin Fan didn’t bother much about these things. He was just waiting.</p><br/><p>At that moment.</p><br/><p>A middle-aged lady was carrying a child and looking around Cloud Street. There were so many shops and she didn’t know where the godly doctor’s shop was.</p><br/><p>“Big Bro, may I know where the godly doctor’s shop is?” Xie Mei asked a little anxiously. She couldn’t be disappointed once again. She had gone through incident after incident. If this was all fake, she didn’t know if she would be able to take it.</p><br/><p>The middle-aged man was startled, “Hey, aren’t you the lady on the news yesterday? Oh right, your child is sick. Little Boss must have agreed to see your daughter. Come with me, I’ll bring you to Little Boss.”</p><br/><p>Xie Mei didn’t expect him to be so kind. She asked nervously, “Big Bro, who’s Little Boss? I’m looking for the godly doctor.”</p><br/><p>“Hehe, Little Boss is the godly doctor. Let me tell you, although Little Boss is a little lazy, he’s very kind-hearted. But don’t tell Little Boss that I said that he’s lazy. After all, our people here always praise Little Boss for being hardworking,” said the middle-aged man with a laugh. He actually wasn’t from around here, but after coming to Cloud Street for a few times, it turns out that he really liked this place a lot. The people here were exceptionally good and he liked them very much.</p><br/><p>Sometimes, when he went into a shop and didn’t buy anything, the shop owners would still be very courteous. Moreover, the people here were all very sincere, unlike people from outside.</p><br/><p>More importantly, they had Little Boss and Little Boss’s scallion pancakes here. He had moved here from somewhere else because of this.</p><br/><p>The feeling here was great and he really loved it.</p><br/><p>Xie Mei followed the man cautiously. Meanwhile, the middle-aged man seemed very familiar with everyone around. He greeted them, “The pitiful child from yesterday’s news is here. Little Boss is going to treat the child.”</p><br/><p>“Ah? Then I have to go and see!”</p><br/><p>“I was furious when I saw the news today. How can there be such disgusting people?”</p><br/><p>“Yeah, it’s fortunate that Little Boss came across them. Otherwise, this would’ve been heartbreaking.”</p><br/><p>“Big Sister, you can’t trust other people so easily next time. Look, if you hadn’t met Little Boss, then things would’ve been bad.”</p><br/><p>As part of Cloud Street, they felt proud of themselves. Some of their businesses were developing very well and they could already start expanding their shops. However, they couldn’t bear to leave Cloud Street, hence, they had stayed here all the way. Even if they couldn’t earn more money, they felt that it was worth it.”</p><br/><p>This kind of feeling was hard to describe. It just felt as if they would regret it for the rest of their lives if they left Cloud Street.</p><br/><p>As Xie Mei saw all these strangers acting so friendly towards her, she slowly relaxed as well.</p><br/><p>“Thank you, everyone.”</p><br/><p>A group of shop owners gathered around the shop entrance. “Little Boss, she’s here. Hurry up and see the child. She’s in a pitiful state.”</p><br/><p>“If Little Boss personally treats her, it would be exceptional. This kid would be in luck.”</p><br/><p>Lin Fan waved his hand, “Alright, alright. I’m just treating her illness. Don’t you all have to run your businesses?”</p><br/><p>“Our businesses aren’t urgent. We have not seen Little boss treat someone’s illness before!.”</p><br/><p>“Yeah!”</p><br/><p>Lin Fan chuckled. He didn’t say much else. Since they wanted to watch, we would let them watch.</p><br/><p>Xie Mei went in front of Lin Fan and said, “Godly doctor…”</p><br/><p>“Hand me the child. Don’t worry, there won’t be any problems,” Lin Fan assured her as best as he could. With such an amazing Godly Doctor like him, what could go wrong?</p><br/><p>The child was only several months old. She didn’t even know how to speak yet and she had already gotten this illness. Everyone around them was sighing emotionally.</p><br/><p>How pitiful.</p><br/><p>However, since Little Boss was going to treat her, everything was going to be fine.</p><br/><p>He lifted the child’s eyelids and everyone spectating gasped in shock. They saw that on her eyeball, there was an obvious white spot. Moreover, there were red streaks around the spot. It looked a little scary.</p><br/><p>Xie Mei asked nervously, “Godly Doctor, there’s no need to remove her eye, right?”</p><br/><p>She had been to many hospitals and the doctors had all suggested she have the child’s eye removed. Because that was the method that had the highest chance of success.</p><br/><p>Lin Fan waved his hand, “Removing her eye is something I would do only if there were no other options. After all, if we wait until the cancer cells spread to the brain, it would be too late. But don’t worry, I’ll treat her and I’ll definitely give your child back in a perfectly healthy state.”</p><br/><p>Xie Mei had no other choice. She had already tried all her other options. She would rather die than have her child’s eye removed.</p></div>\n</div>"}