{"title": "Chapter 579 - Discovering a big secret", "id": 579, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-579-discovering-a-big-secret", "volume_title": "Volume 6", "body": "<h1>Chapter 579 - Discovering a big secret</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the private room.</p><br/><p>Elder Dog hadn’t been discovered by anyone. He hid behind the corner of the sofa motionlessly. Then, he slowly stuck out his dog head and observed the surrounding situation.</p><br/><p>After the waiters finished serving the wine, he would go out.</p><br/><p>There were a total of four people in the private room and Li Hu was surprisingly one of them. The other three people didn’t look like good people. Although they didn’t look fierce, there was darkness within their eyes. Also, their eyes kept looking around alertly. They were very vigilant. If anything happened, they would definitely leave immediately.</p><br/><p>One of them, a long-haired man, was playing with a wine glass in his hands. “Brother Hu, this is a big business deal. It just depends on whether you can take it.”</p><br/><p>Li Hu laughed softly, “Long Hair, don’t talk about whether I can take it. It’s whether you can do it or not. Don’t be like the last time, talking so much but unable to back it up with action.”</p><br/><p>Long Hair was a little embarrassed. But he seemed to have a lot of confidence this time. “Last time was last time. This time, I’m serious. I will bring the goods. You’re a salesperson. This time, you have someone great to help you. As long as you dare to do it, the reward will be unimaginable.”</p><br/><p>Li Hu looked at him and smiled, “Alright, alright. Enough said, let’s drink. Today, you all have come to look for me, it’s an honor. Let me take care of all the expenses.”</p><br/><p>Long Hair and the other two men exchanged looks as if they were talking with their eyes. He placed a hand on Li Hu’s thigh and said, “Brother Hu, I’m serious. You should consider it.”</p><br/><p>Li Hu shook his head and smiled, “Long Hair, I’m someone who does honest business.” But then, his expression suddenly changed. There was a white packet of things on his thigh.</p><br/><p>Long Hair smiled as he looked at Li Hu, “Brother Hu, you can take a look.”</p><br/><p>At that moment, as Li Hu placed his hand on his thigh, the door was opened.</p><br/><p>The waiter said, “Chief Li…”</p><br/><p>Li Hu waved his hand, indicating for the waiter to leave.</p><br/><p>This had initially been arranged by him, for the waiter to come in and check on the situation. In case something happened, at least it would be discovered.</p><br/><p>Long Hair seemed to realize the situation. “Brother Hu, this time I came with sincerity.”</p><br/><p>Li Hu was silent for a moment, then he loosened his hand. Looking at the item in his hand, his expression changed. “Are these new goods?”</p><br/><p>Long Hair smiled, “Mmm, they’re new goods. Authentic new goods. You can have as much as you want. This is just a sample. Brother Hu can have a try. As long as Brother Hu agrees, there will be a never-ending source of income. It will definitely satisfy you.”</p><br/><p>Li Hu was a little emotional. “Long Hair, according to my knowledge, you can’t possibly obtain these goods. A while back, someone smuggled them into Shanghai and he is now wanted by the police. Don’t tell me that you got it from there. If that’s the case, I wouldn’t dare to accept this.”,</p><br/><p>“Haha…” Long Hair laughed, “Brother Hu, if you’re going to be like this, then there’s no need to talk anymore. You know too that not just one person dares to do this in Shanghai. In the past, I’ve relied on your wealth and I’ve received your grace. Now that I have something good, you were the first person I looked for. If you really don’t want it, I won’t force you.”</p><br/><p>Li Hu paused for a moment before saying, “Alright, let’s arrange a meeting for me to take a look. I want to confirm it.”</p><br/><p>Long Hair waved his hand, “That’s not possible. You know the rules. It’s not convenient. Tomorrow night, we’ll still meet here and make the first transaction.”</p><br/><p>“Okay. Let’s drink. Enough talk about this. Although this place is safe, there are various kinds of people here,” said Li Hu.</p><br/><p>“Right, right.” Long Hair smiled. The two other people were silent but they had let out smiles as well.</p><br/><p>Li Hu’s gaze fell on these two men once again. He had never seen them before and he didn’t know where Long Hair met them.</p><br/><p>…</p><br/><p>Downstairs.</p><br/><p>Lin Fan had been waiting for a long time. Why wasn’t Elder Dog out yet? Could it be that something had gone wrong?</p><br/><p>Just as he was about to go up to take a look, Elder Dog appeared at his feet.</p><br/><p>Lin Fan was delighted. He picked Elder Dog up into an embrace and they retreated together.</p><br/><p>Outside.</p><br/><p>“Elder Dog, how’s the situation? Did you hear anything?” asked Lin Fan curiously. He didn’t know the full situation and he hoped that Elder Dog had heard some useful information.</p><br/><p>Although he knew that Li Hu was going to do something big soon, he wasn’t sure of what information they would be able to scout out that night.</p><br/><p>“Woof woof~” Elder Dog barked, “Can’t take it, can’t take it. The reward is big. I’m an honest man. Very authentic new goods…”</p><br/><p>Lin Fan stared at Elder Dog stupidly. What kind of game was this?</p><br/><p>What use would it be if he didn’t understand any of it?</p><br/><p>Lin Fan was disappointed in Elder Dog. He couldn’t expect too much. If he thought that Elder Dog would be able to understand what those people had said, then he was undoubtedly an idiot that was dreaming.</p><br/><p>However, when he realized that Elder Dog had an anticipatory look on his face, he was stunned. This face was so mischievous. It was as if he had some sort of hidden agenda.</p><br/><p>Lin Fan raised a finger, “Ten servings.”</p><br/><p>When Elder Dog Nicholas saw Lin Fan raise his finger, he had become energized but when he heard that he would only get ten servings, his legs softened and he lay flat on the ground as if he was very exhausted.</p><br/><p>At that moment, Lin Fan understood. Elder Dog had turned bad.</p><br/><p>Lin Fan patted Elder Dog on the head. “Twenty servings, that’s the most. If you don’t agree, then forget it. Although you’re a dog, you have to know that even a dog mustn’t be too greedy.”</p><br/><p>“Woof woof~” Elder Dog barked excitedly, “Brother Hu, this is a big business deal. It just depends on whether you can take it…”</p><br/><p>Lin Fan never expected that Elder Dog was hiding so much. Elder Dog had clearly remembered it but he had been acting like he hadn’t. What a f*cking devil.</p><br/><p>Meanwhile, Lin Fan listened closely and his expression slowly changed.</p><br/><p>Judging by Elder Dog’s description, although they hadn’t said explicitly what was going on, Lin Fan understood.</p><br/><p>“Drugs.”</p><br/><p>And from this, he realized in astonishment that there seemed to be many big secrets hidden among this.</p><br/><p>Wanted by the Shanghai police.</p><br/><p>Wasn’t that the same guy that Liu Xiao Tian had mentioned?</p><br/><p>How did that guy get implicated in this?</p><br/><p>“Hey, this is interesting, coming to such a place with a mutt.” At that moment, a sly laughing voice rang out.</p><br/><p>Lin Fan looked up at the person. Long Hair glared at Lin Fan. “What are you looking at, kid? If you look anymore, I’ll beat you up.”</p><br/><p>The man by his side said, “Don’t cause trouble.”</p><br/><p>Long Hair’s expression changed. He became cautious. “Yes…yes.”</p><br/><p>Then, the three men passed by Lin Fan’s front.</p><br/><p>Lin Fan looked at the three men and a grin appeared on his face. These three men had something to do with Li Hu.</p><br/><p>As one of them lowered his head to board the car, his shirt collar slipped down and the tattoo on his neck was revealed.</p><br/><p>“Scorpion!”</p><br/><p>Lin Fan suddenly recalled the image that Liu Xiao Tian had shown him. Although he hadn’t seen the person’s face clearly, Liu Xiao Tian had described him clearly. The distinctive feature of the drug lord was the scorpion on his neck.</p><br/><p>In an instant.</p><br/><p>The three men drove off.</p><br/><p>Lin Fan didn’t chase them because he knew that they would be back the next day.</p><br/><p>“Beautifully done, Elder Dog. Let’s go home.” Lin Fan smiled.</p><br/><p>Elder Dog barked. Thinking about the next day’s scallion pancakes, he was filled with delight.</p></div>\n</div>"}