{"title": "Chapter 581 - I'm a righteous little citizen", "id": 581, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-581-im-a-righteous-little-citizen", "volume_title": "Volume 6", "body": "<h1>Chapter 581 - I'm a righteous little citizen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the entrance of the toilet.</p><br/><p>Lin Fan stopped in his tracks. Then, he looked at Elder Dog. Elder Dog dutifully raised his dog legs and dashed in without hesitation.</p><br/><p>Scorpion quickly lowered his head. Just as he was about to strike, he realized it was just a mutt. He heaved a breath of relief but after that, his alertness rose once again as he fixed his gaze on the entrance.</p><br/><p>Elder Dog was charging straight at him but he never thought that this guy would dare to just ignore Elder Dog. Elder Dog couldn’t stand it.</p><br/><p>“Woof woof~” Elder Dog barked, “Hurry up and come in, this guy is hiding behind the entrance.”</p><br/><p>Scorpion glared at Elder Dog Nicholas and wanted to tell him to shut up. Then, he focused all his energy on watching the entrance. Once the opposition walks in, he would immediately throw a fist at him.</p><br/><p>Lin Fan smiled and immediately strode in.</p><br/><p>A gust of wind from the punch came at Lin Fan.</p><br/><p>Of course, punches can’t possibly produce gusts of wind.</p><br/><p>*patter*</p><br/><p>Lin Fan raised a hand and grabbed Scorpion’s fist. He smiled, “Your strength is pretty good.”</p><br/><p>However, that relaxed expression of his said otherwise, that the punch wasn’t even the least bit strong.</p><br/><p>Scorpion’s expression changed drastically. This was inconceivable. He had never expected Lin Fan to easily catch his punch.</p><br/><p>The toilet was a small area and it wasn’t enough for him to fight as he wanted. But then, he sent a kick flying towards Lin Fan next.</p><br/><p>“Hehe, drug lord, you’re a wanted criminal. You’re done for.” Lin Fan smiled cheerfully as if he wasn’t even bothered by his opponent.</p><br/><p>Quickly and easily, he subdued Scorpion.</p><br/><p>Scorpion was dumbfounded. He said in disbelief, “What kind of person are you? Are you a policeman?”</p><br/><p>Lin Fan replied, “Nope.”</p><br/><p>When he heard that Lin Fan wasn’t a policeman, Scorpion let out a breath of relief. If he had been a policeman, Scorpion would be done for.</p><br/><p>Scorpion gazed at Lin Fan, “What exactly do you want? I don’t think I’ve ever offended you, right?”</p><br/><p>“Nope.” Lin Fan shook his head.</p><br/><p>Scorpion said, “Then why do you want to capture me?”</p><br/><p>Lin Fan was silent for a moment before saying righteously, “Because I’m a good citizen.”</p><br/><p>Scorpion: “???”</p><br/><p>He was a little dumbfounded. What the heck did this guy mean?</p><br/><p>Lin Fan smiled, “I’m a good citizen. Everyone has a part to play in safeguarding the peace and order of Shanghai. You, a big drug lord, have been captured by me. Later on, I’ll take you to the police station and let you spend some time in jail to reflect properly.”</p><br/><p>Scorpion struggled for a bit. “Brother, if there’s anything, we can talk it through. Don’t be rash. What exactly do you want? As long as you release me, I can fulfill any request you have.”</p><br/><p>Lin Fan shook his head, “No, you can’t fulfill it.” Then, he grinned, “As long as I hand you over to the police, I can get another Good Citizen Award. And if I’m lucky, they might even organize another Honors Ceremony. That would feel amazing.”</p><br/><p>“Haha!” Lin Fan laughed, “Do you know what the Good Citizen Award represents? It represents honor.”</p><br/><p>Scorpion was dumbfounded. He realized that this guy in front of him might be an idiot.</p><br/><p>Good Citizen Award?</p><br/><p>What kind of f*cked up reason was that?</p><br/><p>Suddenly, Scorpion realized that he couldn’t move anymore. His limbs felt as if they were being held down. Fear instantly rushed into his heart. He felt that he might have his downfall right here on this day.</p><br/><p>Lin Fan carried Scorpion to the inside of the toilet and closed the door. “Wait here. Don’t be too anxious. Things will be over soon.”</p><br/><p>Scorpion wanted to open his mouth and tell Lin Fan that as long as he released him, he could give Lin Fan an unlimited amount of money and wealth. However, his throat felt like it was blocked. He couldn’t speak at all.</p><br/><p>This time he had come to Shanghai, it was to open up a marketplace here. He could have sent a subordinate here but because he was worried, he came here himself.</p><br/><p>But somehow, the Shanghai police found out that he had infiltrated the city. There was probably a spy. He had initially been planning to wait until the matter ended before going back to investigate this. However, he had never expected to meet his downfall right here today.</p><br/><p>In the private room.</p><br/><p>Li Hu was holding the goods as he took a look. He nodded contently, “Not bad. But the amount…”</p><br/><p>Long Hair said, “Brother Hu, don’t worry. There is a huge amount. Sell off these first so you know our sincerity. Next time, any amount you want won’t be a problem.”</p><br/><p>“Haha,” Li Hu laughed and patted Long Hair on the shoulder. “Brother, I haven’t seen you for so many years and your connections have grown so broad. In future, if you have any good products, you have to think of this brother of yours.”</p><br/><p>Long Hair nodded, “That’s for sure. Who doesn’t know how powerful you are in Shanghai, Brother Hu? As long as Brother Hu is taking care of this, our source of customers will be never-ending. Brother Hu even has men inside the government itself.”</p><br/><p>Li Hu chuckled and didn’t say much. He knew what Long Hair was talking about.</p><br/><p>These areas owned by him had never been investigated before, mainly because he had connections with the people in the government. However, what those people had always thought was that Li Hu was just working in the service industry. They didn’t know he was involved in drugs. If they found out, things would not be the same.</p><br/><p>After all, nobody dared to keep such a secret.</p><br/><p>However, Li Hu was prepared now. If there were to be a check, he would be able to find out immediately and safely evade it.</p><br/><p>At that moment, the private room door was opened.</p><br/><p>Li Hu’s expression changed. “Who let you in?”</p><br/><p>But when he saw who it was, he was stunned. “Master Lin…”</p><br/><p>Lin Fan smiled, “Hehe, the criminals and the drugs are all here. It seems to me that you are all done for.”</p><br/><p>When he heard this, Li Hu’s expression turned gloomy. “You know what we are doing?”</p><br/><p>“Of course.” Lin Fan smiled.</p><br/><p>“You want to report us?” Li Hu asked once again.</p><br/><p>“For sure. Aren’t you talking rubbish? If I take you all down, it would be a great merit. The Good Citizen Award will definitely come to me,” said Lin Fan.</p><br/><p>At that moment, the intent of killing rose in Li Hu’s heart.</p><br/><p>Although the repercussions of killing someone were troublesome, if the matter were to be exposed, they would really be done for.</p><br/><p>Li Hu said gloomily, “Okay, okay. The Huangpu River will receive another departed spirit tonight.”</p><br/><p>Lin Fan seemed to not be bothered by the three of them at all. He took out his phone and pressed a few buttons. Then, Li Hu’s voice rang out from his phone.</p><br/><p>“I’ve collected evidence once again. You want to kill me. This time, you are really done for. You would be lucky if you are only sentenced to a lifetime in prison.” Lin Fan smiled. This guy had to receive the death sentence together with that Scorpion.</p><br/><p>Li Hu said, “It seems that you are set on going against me until the end.”</p><br/><p>Lin Fan waved his hand. “You’re wrong. I’m not set on going against you. But as a righteous little citizen of Shanghai, I have to strike down every crime I see.”</p><br/><p>“Go to hell!”</p><br/><p>At that moment, the man next to Long Hair immediately charged towards Lin Fan.</p><br/><p>But to Lin Fan, these people only had strong bodies. Against an expert like himself, the man was easily flipped over and suppressed.</p><br/><p>When Long Hair saw this, his heart thumped furiously. He never expected this guy to be so powerful.</p><br/><p>“Brother Hu, what on earth is going on?” Long Hair was panic-stricken. That man was Scorpion’s best fighter. He was very strong but against Lin Fan, he seemed powerless and he had been instantly beaten down. It was terrifying.</p><br/><p>How would Li Hu have known what was going on? He had no idea either.</p><br/><p>As for that ‘Good Citizen’ or whatever, to hell with it!</p><br/><p>Lin Fan was full of energy. His eyes gleamed with excitement. “Anyone who tries to come between me and the Good Citizen Award will be taken down.”</p><br/><p>F*ck!</p><br/><p>Long Hair and Li Hu were both no match for Lin Fan. they were instantly knocked out. They didn’t even have a chance to strike back.</p><br/><p>Lin Fan clasped his hands together, then looked at the box on the table.</p><br/><p>“You guys relay have big guts. Just these are enough to take your life. You’re all done for.” Lin Fan took out his phone. Of course, he would leave the task of wrapping this thing up to Liu Xiao Tian.</p></div>\n</div>"}