{"title": "Chapter 582 - Bursting with awesomeness", "id": 582, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-582-bursting-with-awesomeness", "volume_title": "Volume 6", "body": "<h1>Chapter 582 - Bursting with awesomeness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The waiter went towards the private room, carrying the wine.</p><br/><p>His boss had just pressed the service bell. He knew that his boss must have wanted some wine, so he had already prepared everything and was going over.</p><br/><p>He pushed the door open.</p><br/><p>Lin Fan was grabbing onto Li Hu and singing a song. He was very engrossed in it.</p><br/><p>“Friends walk together for their entire lives…”</p><br/><p>The waiter was a little puzzled. Hadn’t there only been three people? Why were there four now?</p><br/><p>And his boss was sitting there motionlessly. Why were his eyes shifting left and right?</p><br/><p>However, he didn’t dare to ask anything. He put the wine down and left the room.</p><br/><p>After the waiter left, Lin Fan laughed, “You really aren’t obedient. If I wasn’t so smart, I would have been discovered.”</p><br/><p>Li Hu had lost all hope. He had never expected this guy to be so perverse. Also, that waiter was really too stupid.</p><br/><p>At the local police station.</p><br/><p>Liu Xiao Tian was busy at work. He was in a conference with a group of other police officers.</p><br/><p>“This matter must be resolved as soon as possible. It isn’t good news that Scorpion has appeared in Shanghai. I hope that you guys can find some clues, even if it’s just a small lead,” the Station Chief said as he stood on the stage. To them, this was a crucial period.</p><br/><p>“Inspector Liu, I wish for you to work a little harder. Scorpion is very dangerous. You should know the outcome if he is to do something in Shanghai.”</p><br/><p>Liu Xiao Tian nodded, “I understand, Station Chief.”</p><br/><p>…</p><br/><p>The conference ended.</p><br/><p>Every police officer felt the weight of a heavy rock on their shoulders. They had been hard pressed with work lately but they hadn’t even found a single lead.</p><br/><p>It was mainly because Scorpion left too little leads. They only knew that he had a scorpion tattoo on his neck. Even though he was in the great city of Shanghai, trying to find him was like trying to find a needle in a haystack.</p><br/><p>“Inspector, what do we do now?” asked the policemen.</p><br/><p>Liu Xiao Tian said, “Go back and keep working overtime. Organize the information. Send people to each location to investigate. We have to locate this Scorpion.”</p><br/><p>“Yes, Inspector.”</p><br/><p>*ring, ring*</p><br/><p>Just as Liu Xiao Tian was having a headache, his phone rang.</p><br/><p>“Inspector Liu, what are you doing now? Are you busy?”</p><br/><p>Liu Xiao Tian said, “Sigh, Master Lin, what do you think? Since this guy came to Shanghai, the whole Shanghai police force hasn’t been able to rest. We’re all looking for him.”</p><br/><p>Lin Fan said, “Do you think that if I find him, I would get a Good Citizen Award? Or perhaps they’ll organize an Honors Ceremony for me?”</p><br/><p>Liu Xiao Tian smiled, “Master Lin, if you find him, don’t even talk about Good Citizen Awards, you’d get any kind of glory you want. You may not know but this Scorpion is a drug lord who is wanted across the country. Who knows how many of our comrades from the drug enforcement teams sacrifice their lives every year in order to capture him?”</p><br/><p>“Is it that serious?” asked Lin Fan calmly.</p><br/><p>“Of course it’s serious. He’s one of the most wanted criminals,” said Liu Xiao Tian.</p><br/><p>At that moment, Lin Fan felt great. He hadn’t thought that Scorpion was a super big fish. “Inspector Liu, don’t say that I don’t look after you. Bring your men and come to XX Bar right now. I’ll give you a heavenly surprise.”</p><br/><p>“What do you mean?” Liu Xiao Tian was startled. He was also filled with anticipation.</p><br/><p>Lin Fan said, “You’ll know when you reach. Don’t forget to bring more men.”</p><br/><p>*clatter*</p><br/><p>The phone was hung up.</p><br/><p>Liu Xiao Tian sat there immersed in his thoughts. Then, he quickly sprang up. He suddenly remembered that it seemed that every time Master Lin called him, he wouldn’t let him down.</p><br/><p>Could it be…</p><br/><p>“Quick, assemble the men and follow me,” Liu Xiao Tian issued the ordered. The policemen who were working all looked up, wondering what had happened.</p><br/><p>“What are you waiting for? There’s been a lead. Hurry up!”</p><br/><p>At that moment, the policemen recovered from their dazes.</p><br/><p>“D*mn, what lead?”</p><br/><p>“How is that possible? Could it be a mistake?”</p><br/><p>“Who knows? Hurry up and assemble. We’ll know once we get there.”</p><br/><p>…</p><br/><p>In the private room.</p><br/><p>When he had the opportunity, Lin Fan had dragged Scorpion from the toilet to the private room.</p><br/><p>When Long Hair saw Scorpion, he was shocked. He had never expected that even his boss would be caught.</p><br/><p>Lin Fan clapped his hands. “Alright, now you’re all gathered. The police will be here soon. You can chat while you’re in prison.”</p><br/><p>Scorpion had never expected himself to fall to this guy in Shanghai. No matter how much he thought, he just couldn’t understand what the heck was going on.</p><br/><p>Elder Dog Nicholas sat at the side, eating a bowl of fruits.</p><br/><p>Lin Fan was singing a song as he sat there waiting for the police to arrive.</p><br/><p>Soon after.</p><br/><p>The sound of police cars came from the outside.</p><br/><p>Countless men and women were startled when they saw this. They had no idea what was going on.</p><br/><p>Upon reaching the location, Liu Xiao Tian issued orders, “Surround the area. Check the IDs of all personnel leaving or entering the place. Capture any suspicious person you see.”</p><br/><p>“Yes, sir.”</p><br/><p>Not far away.</p><br/><p>Some reporters were secretly taking photos of a celebrity. But when they realized that the situation didn’t seem right, there became curious.</p><br/><p>“What’s going on?”</p><br/><p>“Why are there so many policemen?”</p><br/><p>“No idea.”</p><br/><p>“Looks like something big has happened. Let’s hurry up and go take a look.”</p><br/><p>Liu Xiao Tian was on the phone, “Master Lin, where are you?”</p><br/><p>Lin Fan replied, “Second floor, private room. I can hear the commotion outside from here. Come on in.”</p><br/><p>Liu Xiao Tian had an eager look on his face. What exactly was it going to be? Then, he brought a team of men and rushed inside. “Follow me. The remaining men, watch the entrance. Don’t let anyone in.”</p><br/><p>“Yes, sir.”</p><br/><p>…</p><br/><p>Lin Fan looked at Li Hu and the rest. “The police is here. You’re all done for.”</p><br/><p>Although they couldn’t say anything, their eyes gleamed with boundless rage.</p><br/><p>Bam!</p><br/><p>Liu Xiao Tian came bursting through the door. The inside was slightly dim, so he immediately turned on the lights. He asked impatiently, “Master Lin, what’s going on?”</p><br/><p>Lin Fan smiled, “See for yourself. Look who it is.”</p><br/><p>Liu Xiao Tian looked at the people in front and was a little puzzled. They couldn’t recognize these men. However, when he saw the two boxes on the table, he was completely dumbfounded.</p><br/><p>There were a lot of white packets and there was even cash.</p><br/><p>“These are drugs.” Liu Xiao Tian was astounded. “Master Lin, you really are amazing. You’ve discovered the scene of a drug transaction.”</p><br/><p>Lin Fan looked at Liu Xiao Tian and said, “F*ck, I’m not telling you to look at that. I’m telling you to look at this.” He pulled Scorpion’s shirt collar down. “Look, what’s this?”</p><br/><p>Liu Xiao Tian was startled. “What? Scorpion…”</p><br/><p>Lin Fan nodded proudly, “That’s right. This is Scorpion. The criminals and their illegal goods are all here. These four guys were in the middle of a drug transaction and they’ve been taken down by me. Don’t you think this is a great service?”</p><br/><p>Liu Xiao Tian was speechless. It even felt difficult to breathe.</p><br/><p>How was this possible?</p><br/><p>The whole of Shanghai’s police force had been deployed but they hadn’t even found a single lead on Scorpion but Master Lin actually discovered him. On top of that, the drugs were also discovered.</p><br/><p>If the rest of the police force was to find out, they might find a hole to hide.</p><br/><p>It was simply humiliating.</p><br/><p>Liu Xiao Tian raised his thumb. “Awesome, Master Lin, you’re really too awesome. I’m already in such admiration that I would kneel down to you. This service is so great that it is boundless.”</p><br/><p>Lin Fan smiled proudly, “That’s good. In order to capture these guys, I’ve been taken advantage of by this dog. You have to let me know about the Good Citizen Award and the Honors Ceremony. I need to prepare myself mentally.”</p><br/><p>Elder Dog Nicholas protested. “When did I take advantage of you? Without me, you would never have found them,” he thought.</p><br/><p>Liu Xiao Tian was at a loss for words.</p><br/><p>However, now wasn’t the time to think about all this. He had to quickly bring detain these people and bring them back for questioning.</p><br/><p>…</p></div>\n</div>"}