{"title": "Chapter 592 - You can always try your luck", "id": 592, "volume": 6, "url": "http://boxnovel.org/a-valiant-life-chapter-592-you-can-always-try-your-luck", "volume_title": "Volume 6", "body": "<h1>Chapter 592 - You can always try your luck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the hospital!</p><br/><p>Chang Hai Ge looked at his legs. He was completely stupefied. There were no feelings in his legs. No feelings at all.</p><br/><p>“My legs!” When he woke up, the situation had already been like this.</p><br/><p>In the ward, he was surrounded by a group of people.</p><br/><p>Zhou Bing was blaming himself, “Brother Chang, I didn’t expect it. I really didn’t expect that this would happen.”</p><br/><p>Just at that instant that something happened to Chang Hai Ge, he was already stunned. He never thought that it would be true. That something bad would really happen.</p><br/><p>Getting Brother Chang hurt wasn’t his intention, but rather, it was because he didn’t believe what the nobleman had said. Therefore, he used his words to provoke Brother Chang. If he were to know beforehand that such a thing would happen, he would have told him not to do it.</p><br/><p>Young Shen grabbed Zhou Bing’s collar, “Are you f*cking sick? Brother Chang had already said before that he didn’t want to participate. But you just had to provoke him. Now, look what happened! What are you going to do?”</p><br/><p>The crowd held their breath. They were ashamed and were blaming themselves. Even if were to be harshly scolded by Chang Hai Ge, they wouldn’t retaliate.</p><br/><p>What they didn’t understand was why the tree would collapse. There wasn’t even any heavy rain or strong winds. It was perfectly fine! How did it turn out this way?</p><br/><p>Right now, Chang Hai Ge didn’t have any time to care about them. “Doctor! Come over here!”</p><br/><p>The doctor knew that this person wasn’t to be irritated anymore. When the patient came over, a whole group of wealthy-looking people followed the ambulance over.</p><br/><p>“How is my leg? What exactly happened?” Chang Hai Ge raged on. He was still so young. Nothing bad could happen to him, or else he would have to be a cripple for the rest of his life!</p><br/><p>At the same time, he was in deep regret. In his heart, he was shouting, “Master Lin, I didn’t listen to your words!”</p><br/><p>If the Heavens were to give him another chance, he dared to swear that he would no longer participate in any more dangerous activities and even to stay at home the whole day, afraid to go out.</p><br/><p>The doctor hesitated for a moment, “Mr. Chang, please be mentally prepared. When you came out of the accident, because your legs were squashed for too long, it caused your nerves to be severed. Therefore, if you want to preserve your life, you’re going to have to… amputate it.”</p><br/><p>It was a bolt from the blue!</p><br/><p>Chang Hai Ge was stunned. His expression was one of shock and fear, “What did you say, doctor? I have to undergo amputation?”</p><br/><p>To Chang Hai Ge, the word ‘amputate’ was as good as taking his life away.</p><br/><p>The doctor nodded. “By today’s level of medical technology, there’s no way we can heal it. If you do not go for amputation, the blood vessels would become clogged and it would pose a risk to your life.”</p><br/><p>Chang Hai Ge’s face was momentarily drained of all color. His throat was shaking. He wanted to burst out in rage, but the word ‘amputate’ had shocked him speechless.</p><br/><p>The door was pushed open.</p><br/><p>A man and a lady walked in.</p><br/><p>When the middle-aged man walked in, he scanned the surroundings. In the end, his gaze landed on to Chang Hai Ge, who was lying on the bed.</p><br/><p>“Dad…Mom…” When Chang Hai Ge saw them, he wanted to cry.</p><br/><p>When Mother Chang saw this, her face was one of love and regret. “Son, what happened to you? Weren’t you okay? How could something like this happen?”</p><br/><p>Zhou Bing walked up, “Uncle Chang, I’m sorry. It’s all my fault. If only…”</p><br/><p>*Slap*</p><br/><p>Father Chang slapped Zhou Bing on his face. He was shaking with fury. He might have seen a lot of things happen before but at the moment, it was hard for him to contain the anger in his heart.</p><br/><p>He only had one son. And now that he heard that he needed an amputation, wouldn’t it mean that he would be useless in future?</p><br/><p>The room was in complete silence.</p><br/><p>Zhou Bing lowered his head. He didn’t dare to block his face. Even though he was slapped by Father Chang in front of the crowd, he knew that it was his fault. If only he did not provoke Brother Chang into participating, none of this would have happened.</p><br/><p>“Uncle Chang, Auntie Chang. It’s all my fault. If you want to beat me, please do.” Zhou Bing was feeling uncomfortable on the inside. Even though he had already quarreled with Chang Hai Ge, but they knew each other since young and had grown up playing with each other. Even though in the eyes of the adults, they might just be rich sons idling about and wasting their time, but he knew Brother Chang as well as he knew himself.</p><br/><p>They wanted to go crazy when they were still young. When they age, they wouldn’t have such chances anymore.</p><br/><p>Father Chang didn’t even look at him. He immediately said, “Get lost.”</p><br/><p>Zhou Bing didn’t dare to say anything else. He went to stand outside. Leaving wasn’t an option. Even though this matter was an accident, but it wouldn’t have happened if he didn’t provoke Brother Chang.</p><br/><p>Chang Hai Ge was so scared that he was sweating. “Dad, Mom, you have to save me. I cannot undergo amputation, I cannot!”</p><br/><p>Father Chang wouldn’t agree to his son’s amputation. However, that is the doctor’s only suggestion. Doing it would at least be able to save his life.</p><br/><p>At this moment, Father Chang looked at the doctor, “Is amputation the only way?”</p><br/><p>The doctor nodded, “It’s the only way.”</p><br/><p>If only the doctors were present at the accident site or if the firefighting officers removed the tree from him immediately. Then, there might still be a chance to keep his two legs, but it was too late now.</p><br/><p>The legs are like the brain. If the brain did not have enough fresh air, causing the brain to be lacking in oxygen, it would result in death.</p><br/><p>It works the same for the legs. If the blood is unable to flow, it would result in becoming useless.</p><br/><p>Mother Chang urgently said, “No! There’s no way we’ll agree to amputation. If he undergoes amputation, it would be over… His life would be over.”</p><br/><p>Father Chang sighed. “Doctor, let’s outside.”</p><br/><p>They were in Beijing, the Capital of the nation. The medical equipment here was the best. If even the doctor said there was no other way, then there really was no other way.</p><br/><p>Shen Ming accompanied Chang Hai Ge, “Brother Chang, don’t think too much about it…”</p><br/><p>Chang Hai Ge replied, “How do you expect me to accept it! It’s amputation! This is about amputation! I would become a cripple in future. How am I supposed to accept it?”</p><br/><p>Shen Ming sighed. What should we do now? The nobleman had already advised him and yet Brother Chang didn’t listen to him. Now that something had happened, what could they do about it?</p><br/><p>This was completely his own fault.</p><br/><p>If the nobleman were to know of this, he would probably only say one sentence.</p><br/><p>“You deserved it.”</p><br/><p>…</p><br/><p>Outside.</p><br/><p>Father Chang was interacting with the doctor. They were talking about the amputation and they agreed upon prosthetics. With the current level of technology, prosthetics might still affect him. But if he has enough practice, he shouldn’t have a problem getting around.</p><br/><p>The situation was already like that. What else could he do?</p><br/><p>Amputation was the only way. Do you expect him to just watch his son throw his life away?</p><br/><p>At this moment, a figure appeared in the hospital.</p><br/><p>Zou Tian Fu had just received the news that the little partner that he just began to work with got into an accident. He was stunned. Didn’t Master Lin say that he shouldn’t play around? Why did he still do it then?</p><br/><p>If this was like in previous times, he wouldn’t have come.</p><br/><p>However, since Chang Hai Ge decided to follow him, he would definitely have to come and take a look.</p><br/><p>Father Chang stood outside, talking to the doctor. When he saw that Zou Tian Fu had come, he frowned. Naturally, he recognized Zou Tian Fu, but Zou Tian Fu did not necessarily recognize Father Chang.</p><br/><p>However, with the current situation, Father Chang didn’t have the mood to greet Zou Tian Fu.</p><br/><p>Outside the door, the two of them locked gaze momentarily. Zou Tian Fu nodded his head, then proceeded to go into the room.</p><br/><p>“Chang Hai Ge, what happened to you? Didn’t Master Lin tell you that you shouldn’t participate in any dangerous activities? Why didn’t you listen to him?” Zou Tian Fu spoke to the spiritless Chang Hai Ge.</p><br/><p>“Young Master.” Chang Hai Ge lowered his head. “I regret it. I deeply regret it. However, it’s all too late. The doctor said I have to undergo amputation.”</p><br/><p>Zou Tian Fu frowned. Amputation?</p><br/><p>Wouldn’t that make him a cripple?</p><br/><p>When they saw Zou Tian Fu, the surrounding friends didn’t dare breathe a single word.</p><br/><p>Even though they may be very rich, but compared to Young Master Zou, they are lacking way behind.</p><br/><p>Zou Tian Fu said, “This is very serious.”</p><br/><p>Chang Hai Ge lowered his head. He didn’t say anything. He too knew that it was very serious. He knew that his life was over.</p><br/><p>“However, you can always try your luck!” Zou Tian Fu said.</p><br/><p>“What?” Chang Hai Ge immediately turned his head to face Young Master Zou. He didn’t know what his words meant.</p></div>\n</div>"}