{"title": "Chapter 607 - I better pretend to faint", "id": 607, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-607-i-better-pretend-to-faint", "volume_title": "Volume 7", "body": "<h1>Chapter 607 - I better pretend to faint</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The feast ended.</p><br/><p>During this period, Liu Xu’s heart had been like a volcano on the verge of eruption. She had long passed her tolerance limit. If she weren’t so worried about all the people around, she would’ve started quarrelling with Lin Fan long ago.</p><br/><p>As Liu Xu’s assistant, Wang Xin didn’t sit at the table but she stood at the side, listening. She had found out about these people’s backgrounds. She had never thought that the man next to Chief Liu knew so many people.</p><br/><p>She was now filled with hope for the future. She could finally realize her ambition and she would put her all into it.</p><br/><p>He Cheng Han said, “Gathering with everyone once again is really something to be happy about. And what’s more important is Chief Liu’s opening. Master Lin informed us too late. Otherwise, we would have prepared generous gifts. But it isn’t too late yet. I shall become a member here and top up two hundred thousand to my account.”</p><br/><p>Li Hao said, “That’s not bad. The environment here is very good and so is the service. There are food and entertainment in one place. In future, if I have any social events, this shall be my first choice as a venue. I’ll top up two hundred thousand as well, to give Chief Liu a boost.”</p><br/><p>“Haha, if you two are becoming members, then I have to as well. If Brother He tops up two hundred thousand, I cannot top up more than that but nor can I top us less. I’ll top up two hundred thousand too.”</p><br/><p>At the dining table, everyone was chatting. This time, they had gotten notice of the opening ceremony a little late and they hadn’t prepared for it, so they had to become members.</p><br/><p>Initially, Lin Fan had been feeling pleased with his own resourcefulness but suddenly, when he heard this, he was stunned.</p><br/><p>Oh f*ck!</p><br/><p>Could it be that this group of guys have too much money and don’t know how else to spend it?</p><br/><p>On the other hand, Liu Xu was smiling. It was a very delightful smile. Especially when she looked at Lin Fan, there was a deep meaning behind that smile.</p><br/><p>When Wang Xin heard this, her mood surged. She had not expected these old bosses to want to become members. This astounded her.</p><br/><p>It wasn’t because of how much they paid.</p><br/><p>But it was because they actually signed up for the membership. This showed that they would come back to spend their money in future.</p><br/><p>For a high-end entertainment hotel to truly become popular, social connections and inflow of guests were important.</p><br/><p>If the people who would come were all big shots, other people would naturally think of running into people that they want to meet here. They would definitely rush to become members as well. This would help the hotel to expand more easily.</p><br/><p>Several million were paid.</p><br/><p>This left her speechless.</p><br/><p>Lin Fan didn’t want to say anything. This incident was really f*cked up.</p><br/><p>Liu Xu said softly, “I’m sorry. It seems like I’ve won this round.”</p><br/><p>Lin Fan chuckled, “There’s no hurry. There’ll be more opportunities in future.”</p><br/><p>Although the two of them were at war with each other, everything was very peaceful. Especially to the shop owners of Cloud Street, this day had been a really happy day.</p><br/><p>This had been a delightful meal. And after eating, they had even gone to sing. This day, during which they had been able to completely let loose, made their bodies and hearts feel comforted.</p><br/><p>The opening ceremony ended.</p><br/><p>Outside the hotel.</p><br/><p>Lin Fan said, “I don’t know what to say to all of you.”</p><br/><p>He Cheng Han smiled, “Master Lin, you really think we don’t know the situation? I, Elder He, don’t dare to say too much but my judgments of people are very accurate. Whether you and Chief Liu have that kind of relationship, you think I don’t know?”</p><br/><p>“Although we don’t know what you two are doing, we are your friends. She’s having an opening ceremony and since we came, we couldn’t embarrass you.”</p><br/><p>Wang Ming Yang patted Lin Fan on the shoulder and said, “Elder He is right. We did this to let her know that you are respected. This is our way of supporting your reputation. But really, this Chief Liu is pretty good looking. Not only is her mannerism good, she’s really feminine. She has a kind of flair that other women don’t have.”</p><br/><p>Lin Fan sighed. He really couldn’t understand what they were thinking. “Alright, let’s not talk about this. Oh yeah, have any of you gotten involved in a thorny situation lately? Now that I’m here, you can tell me and I’ll help you take a look.”</p><br/><p>“Nope.”</p><br/><p>“Everything has been smooth sailing lately.”</p><br/><p>“The last fortune-reading that you gave me is still proving its use even now.”</p><br/><p>No one had encountered any problems. As long as they didn’t take any major steps, they basically wouldn’t be met with any trouble.</p><br/><p>Lin Fan nodded, “Alright then. That’s good. If you just do things steadily, your fortunes won’t be bad.”</p><br/><p>At this moment, a man walked over from afar.</p><br/><p>“Hi, brothers. I’d like to ask for directions. How do I go here?” the man asked as he patted Lin Fan on the shoulder.</p><br/><p>Lin Fan looked at the map. “Over here, just…”</p><br/><p>“Don’t move.”</p><br/><p>Suddenly, the man whispered into Lin Fan’s ear. Lin Fan felt something pressing against his back.</p><br/><p>A gun!</p><br/><p>That was Lin Fan’s first thought.</p><br/><p>When met with such a situation, he would have to be lying if he said he wasn’t nervous. Although he had the Encyclopedia, he was still human. If he took a bullet, he would still lose his life.</p><br/><p>However, with his abilities, he could definitely take down the man. But the man’s next words dispelled that idea.</p><br/><p>“I’m warning you. You better not move. I’ve already done my research. You are very powerful but I’m not the only person here. If you move, these friends of yours would be in danger.”</p><br/><p>Wang Ming Yang and the rest were still talking cheerfully. They hadn’t noticed this situation. However, they realized that Lin Fan looked a little strange.</p><br/><p>“What’s up with you?” Wang Ming Yang was about to go forward.</p><br/><p>Lin Fan said, “Don’t move. Just stand there.”</p><br/><p>Wang Ming Yang realized that something was wrong. Then, he looked at the man behind Lin Fan. “Brother, who are you? Why are you looking for him?”</p><br/><p>An MPV stopped at the side of the road.</p><br/><p>The man said softly, “Don’t even think of making any small movements. Just come with me obediently. If you do anything else, these friends of yours will lose their lives.”</p><br/><p>Lin Fan looked around. There weren’t many people around but he frowned. Although those people didn’t seem like a problem, he could tell that these people were very vicious. It was as if they would kill without batting an eye.</p><br/><p>“Don’t you all move. Listen to me,” said Lin Fan.</p><br/><p>Wu You Lan and Wu Huan Yue wanted to say something but Lin Fan glared at them.</p><br/><p>The man threatened him all the way until they reached the MPV. A hand reached out from inside the vehicle and pulled Lin Fan in.</p><br/><p>Bam!</p><br/><p>Once the door closed, the vehicle immediately went off.</p><br/><p>“F*ck!” Wang Ming Yang cried out in shock, “Call the police, quick!”</p><br/><p>Wu You Lan and Wu Huan Yue’s expressions changed. “Brother Lin…”</p><br/><p>At that moment, they knew that this was a kidnapping case.</p><br/><p>In the vehicle.</p><br/><p>Lin Fan’s hands and legs were tied up.</p><br/><p>The man who had pointed the gun at Lin Fan’s back said, “Master Lin, the righteous little citizen, you didn’t expect this, did you?”</p><br/><p>Lin Fan was calm and composed. “I indeed didn’t expect this. I didn’t expect you all to come so soon. You were sent by Scorpion, weren’t you?”</p><br/><p>The man replied, “It’s good that you know.”</p><br/><p>Of course, he knew. He had found out just by thinking a little.</p><br/><p>Although the human trafficking organization was huge, they wouldn’t do something so menacing. The only one capable of this was that ‘Scorpion’. As a drug lord, he definitely had vicious people under him.</p><br/><p>Lin Fan had screwed ‘Scorpion’ over and his buddies definitely wouldn’t just let it be.</p><br/><p>Bam!</p><br/><p>Just as Lin Fan was thinking about all this, a heavy blow struck his head.</p><br/><p>It didn’t hurt at all.</p><br/><p>But he knew that the opposition had wanted to knock him unconscious. He had to pretend to faint, otherwise, he would definitely be hit a few more times.</p><br/><p>Faint!</p><br/><p>It’s better to just pretend to faint.</p><br/><p>…</p></div>\n</div>"}