{"title": "Chapter 605 - Take your dog paws away", "id": 605, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-605-take-your-dog-paws-away", "volume_title": "Volume 7", "body": "<h1>Chapter 605 - Take your dog paws away</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Jin Yun Min had never expected to run into Master Lin here. He couldn’t help but get excited as he asked, “Master Lin, you know Chief Xu?”</p><br/><p>Lin Fan shook his head, “I don’t. I’m here today to attend Chief Liu’s opening ceremony.”</p><br/><p>“Oh.” Jin Yun Min took a look at the hotel, then at Liu Xu, who was at the side. With one look, he had formed some thoughts in his head. Could it be that such a beautiful lady with such good qualities have some kind of relationship with Master Lin?</p><br/><p>Of course, that was definitely not possible.</p><br/><p>“Sigh, Master Lin, why didn’t you let everyone know? It would’ve been good to get everyone here to congratulate Chief Liu,” complained Jin Yun Min.</p><br/><p>Ever since that gathering at Nanshan Children’s Welfare Institute, they had never gathered again. Now, Master Lin was definitely not average anymore. Compared to when they had just met him, he had become much more amazing.</p><br/><p>He had initially thought that Master Lin looked down on them.</p><br/><p>But now that he had seen Master Lin, he could tell that Master Lin was still as warm and kind. That dispelled his worry. Master Lin was still the same old Master Lin.</p><br/><p>Just as Lin Fan was about to speak, Liu Xu interrupted. She grumbled, “I initially wanted him to help me call some people over but he said that it was too troublesome. Now, there’s basically no one at my opening ceremony. It’s so embarrassing.”</p><br/><p>F*ck!</p><br/><p>Lin Fan had not expected this Liu Xu to be so heartless. He had only taken advantage of her a little and now, she had started taking her revenge mercilessly.</p><br/><p>Indeed!</p><br/><p>When Jin Yun Min heard this, he couldn’t stand it. “Master Lin, why are you being so modest with us? Don’t worry, Chief Liu. I’ll inform them right now. If they knew that Master Lin didn’t call them over because he was afraid that it would be troublesome, they would definitely think that Master Lin is looking down on them.”</p><br/><p>Liu Xu smiled, “Chief Jin, wouldn’t that be too troublesome?”</p><br/><p>“Not at all, not at all.” Jin Yun Min waved his hand. His phone was dialing. “Chief Xu, why don’t you go back first? I’ll stay here for a while.”</p><br/><p>The current situation had left Chief Xu completely dumbfounded. What was going on?</p><br/><p>This situation wasn’t quite right.</p><br/><p>Jin Yun Min was his guest but now, he was going to stay here?</p><br/><p>What kind of person was that kid? He actually got respect from Chief Jin and Chief Jin even personally made calls to call people over.</p><br/><p>Even his relationship with Jin Yun Min wasn’t that good. They had only met at a gathering, exchanged numbers and gradually done some business with each other.</p><br/><p>And this Chief Jin was a pretty good person. Regardless of the relationship, he would treat everyone courteously. He was very honorable.</p><br/><p>The call got through.</p><br/><p>“Elder He, hurry down to Long River Road. Master Lin is here at an opening ceremony and he actually didn’t let us know. If I hadn’t caught him, I wouldn’t have known either. Let the others know while you’re at it. I’ll wait here for you.”</p><br/><p>“Li Hao, what are you doing? Eating? Stop eating and hurry down to Long River Road. Master Lin…”</p><br/><p>Jin Yun Min made several tens of calls consecutively.</p><br/><p>Lin Fan felt that he had been entrapped by Liu Xu this time. He hastily said, “Chief Jin, there’s no need to call so many people. You…”</p><br/><p>Before he could finish his sentence, Jin Yun Min interrupted, “Master Lin, that won’t do. We haven’t gathered together in so long. Isn’t today perfect? Chief Liu is opening her hotel, how could we not come here to congratulate her?”</p><br/><p>“Me and her…” Lin Fan was about to explain the situation but this Jin Yun Min was too headstrong. He didn’t give Lin Fan a chance to explain it at all. He gave a f*cking boorish laugh and said, “I understand, no need to say it. I understand…”</p><br/><p>“Understand my a*s!” Lin Fan was close to tears. This time, he had been planning to mercilessly f*ck Liu Xu up. But he had never expected to run into Jin Yun Min.</p><br/><p>Especially now, in the end, he had probably f*cked himself up.</p><br/><p>At that moment, Liu Xu laughed. She laughed very happily. Then, she looked at Chief Xu. “My apologies, it seems that there will be people coming over to my side.”</p><br/><p>“Ah.” Chief Xu was already completely dumbfounded. He didn’t even know what to say. “Chief Jin, why not…”</p><br/><p>Jin Yun Min waved his hand. “Chief Xu, you should go back first. I haven’t seen these old brothers for some time now. I shall be here for this opening ceremony. Next time, I’ll treat you to some wine as compensation.”</p><br/><p>Jin Yun Min had already said this much, what else could Xu Ming say?</p><br/><p>He looked at Lin Fan once more. Just who on earth was this guy? Why was he given so much respect?</p><br/><p>Chief Xu was still a little unwilling to give up. He still wanted to see who exactly would be coming.</p><br/><p>Soon after.</p><br/><p>Cars started appearing in their view. These cars, as compared to the previous ones were significantly different. Compared to the previous ones, it was simply like heaven and earth.</p><br/><p>He Cheng Han got off the car and waved at Lin Fan. “Master Lin, this isn’t your usual self. Such a big event and you didn’t even call us. Are you looking down on us?”</p><br/><p>Li Hao said, “Yeah! If Elder Jin hadn’t informed us, we wouldn’t even know.”</p><br/><p>Lin Fan sighed. What else could he say? There were all here already, what was there to explain? He felt especially helpless when he saw Liu Xu’s proud smile. She had f*cked him up and taken her revenge on him.</p><br/><p>“Chief He, Chief Li, that’s not what I meant. Sigh…I shan’t say more. You’re all already here, so let’s treat this as a gathering then.”</p><br/><p>Lin Fan didn’t want to say anymore. It would be useless to say more as they were already here. What could he possibly do? Ask them to leave?</p><br/><p>When Xu Ming saw the people who came, he was a little shocked. He didn’t recognize Li Hao but he did recognize He Cheng Han.</p><br/><p>Only two people had reached and there was already one that he knew he couldn’t compare to. Moreover, Chief Jin had made tens of calls. If they all came, then it would be insane.</p><br/><p>Thinking back to before, he had to give his own wisdom a thumbs up. It was lucky that he hadn’t laughed at them. Otherwise, he would’ve been humiliated.</p><br/><p>Especially when he saw Lin Fan’s face, Xu Ming had an urge to puke out blood. So many big shots had come and yet this guys was showing an expression that said ‘What are you all doing here?’.</p><br/><p>This was just driving him crazy.</p><br/><p>Although Xu Ming wanted very much to stay here and get to know more people, the opposite party didn’t wish for him to stay.</p><br/><p>“Chief Jin, I shall take my leave then. Next time, let’s have a proper meetup,” said Xu Ming.</p><br/><p>Jin Yun Min nodded, “Alright, Chief Xu. See you next time then. Sorry about this. My brothers are all here and it wouldn’t be nice for me to leave.”</p><br/><p>Xu Ming replied, “I understand, I understand.”</p><br/><p>Gradually, everyone came.</p><br/><p>In the end, even Wang Ming Yang reached the scene.</p><br/><p>Liu Xu let out a smile. It was a proud smile and also a happy smile.</p><br/><p>Regardless of who it was, there was a bit of vanity in every person.</p><br/><p>That included Liu Xu.</p><br/><p>Her initially lifeless opening ceremony had, at this moment, become bustling with life.</p><br/><p>Wang Xin looked at the scene before her and was stunned. When did so many big shots suddenly appear?</p><br/><p>Liu Xu went forward suddenly and pulled on Lin Fan’s arm. She opened her lips slightly and said, “Won’t you give me an introduction?”</p><br/><p>F*ck!</p><br/><p>This woman f*cked me up!</p><br/><p>No, I absolutely must not let her have her way.</p><br/><p>Since it’s like this, don’t blame me.</p><br/><p>Lin Fan’s arm moved and held onto Liu Xu’s slender waist. It was really soft and tender. He couldn’t help but give it a pinch. “Alright, I’ll give you an introduction.”</p><br/><p>Liu Xu’s expression changed. Then, she leaned over and said softly, “If you pinch me again, I’ll cut off your dog paws.”</p><br/><p>Lin Fan was all smiles as he whispered, “I’m not that easily taken advantage of.”</p><br/><p>Wu Huan Yue went forward. “You Lan, the two of them…?”</p><br/><p>Wu You Lan said, “They’re battling each other.”</p><br/><p>“Huh?” Wu You Lan was startled. She didn’t quite understand it.</p></div>\n</div>"}