{"title": "Chapter 602 - Eliminate in one fell swoop", "id": 602, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-602-eliminate-in-one-fell-swoop", "volume_title": "Volume 7", "body": "<h1>Chapter 602 - Eliminate in one fell swoop</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Encyclopedic Points: 4015</p><br/><p>He wasn’t too far away from having 7400 Encyclopedic Points now. This time, the teaching materials were distributed just in time. Perhaps he would be able to complete the task soon.</p><br/><p>Meanwhile, Lil’ Fatty became the first person in the Children’s Welfare Institute to use the little intelligence pill. Who knew what kind of changes would happen?</p><br/><p>There were numerous good things in the Encyclopedia’s Department Store. Just looking at them made Lin Fan want to get them. However, in order to complete the task, he had to resist the urge. Just 3000 more Encyclopedic Points and he would be done.</p><br/><p>Cloud Street!</p><br/><p>Lin Fan would pay attention to the trend of his Encyclopedic Points every day. It kept increasing bit by bit and to him, every bit was very exciting to observe.</p><br/><p>“Did something happen lately, Brother Lin? Why are you so happy?”</p><br/><p>Wu You Lan had realized that something had been off about Brother Lin lately. It seemed as if some kind of great and joyous event had happened. He had been smiling cheerfully all the time as if he had come across something that made him happy.</p><br/><p>Why was he so happy? Of course, he couldn’t tell them. Even if he told them, no one would believe him.</p><br/><p>“Haven’t you heard before that being happy frequently makes you live a little longer? That’s why I have to smile a little every day.” Lin Fan felt that he sounded a little stupid. Who would believe such a reason?</p><br/><p>Elder Dog Nicholas had been laying there the whole time. Then, he raised his head and laughed with his teeth baring. However, a dog laughing looked as comical as anything could be.</p><br/><p>Elder Dog had become smart. It was the effect of the little intelligence pill.</p><br/><p>Lin Fan gazed at him. “Elder Dog, don’t laugh. Once you laugh, your saliva starts splattering all around. Quickly go and find your dog wife, don’t let her be snatched away.”</p><br/><p>Elder Dog glared at Lin Fan and barked a few times to express his displeasure. However, he still lay there like a good dog and gazed afar.</p><br/><p>*Da da*</p><br/><p>The sound of high heels rapidly hitting the ground could be heard. A beautiful scene appeared before everyone.</p><br/><p>When Wu You Lan saw who had come, a smile appeared on her face as she went forward. “Liu Xu, why are you here?”</p><br/><p>Liu Xu glanced at Lin Fan before fixing her gaze on Wu You Lan. “I came to issue you an invitation. I bought a hotel in Shanghai and I want to invite you to attend our opening ceremony.”</p><br/><p>“Wow!” Wu You Lan was astonished. She had a pretty good family background, especially because Wu Tian He’s fortune-telling was so godly. Over in Lianzhou, they had been distinguished guests of countless influential officials. Naturally, she wouldn’t be shocked in the face of a little wealth and power. However, Liu Xu had just bought a hotel as she liked. This made Wu You Lan a little shocked.</p><br/><p>“You really bought it?”</p><br/><p>Liu Xu nodded. When her smile burst forth, it was emotionally moving. “Of course. Didn’t I say that I would establish myself in Shanghai? It’s more because a certain someone isn’t true to his word, so I can’t leave Shanghai.”</p><br/><p>Lin Fan was a little speechless. This Brother Qiang Qiang was biting him and not letting go. She was really establishing herself in Shanghai.</p><br/><p>Wu You Lan smiled awkwardly. Naturally, she knew about the situation between Liu Xu and Brother Lin. But she never thought that Liu Xu would do that.</p><br/><p>Initially, she had been a little afraid about whether Liu Xu would make her girlfriend but later on, she stopped worrying. As long as she stayed true to her original intention, she would be fine.</p><br/><p>Her goal was to be together with Brother Lin.</p><br/><p>“Oh, right. I even invited someone to perform at the event.” Liu Xu smiled mysteriously. Her eyes were fixed on Lin Fan.</p><br/><p>Lin Fan felt a little helpless. What did inviting someone have anything to do with him? But when Liu Xu said that person’s name, he lost his cool.</p><br/><p>“The popular celebrity singer, Wu Huan Yue,” said Liu Xu, “The opening ceremony has to be grand. And Wu Huan Yue is a celebrity singer from Shanghai too. Inviting her to perform is a pretty good choice.”</p><br/><p>F*ck!,</p><br/><p>Lin Fan felt that this Liu Xu was trying to eliminate all of the people close to him in one fell swoop. She didn’t give him a chance to retaliate at all.</p><br/><p>“It’s her…” When Wu You Lan heard that name, she felt a little unpleasant. That was her strongest competitor for Brother Lin.</p><br/><p>Especially because Wu Huan Yue was now a celebrity, it was as if she had a certain splendor to her. Perhaps Wu You Lan wasn’t even a worthy competitor.</p><br/><p>However, Wu You Lan was always by Lin Fan’s side. That should have given her an edge.</p><br/><p>At that moment, Wu You Lan started thinking ridiculous thoughts.</p><br/><p>Lin Fan sighed. His expression was strange. “Liu Xu, is there a need for that? You should try to understand this situation.</p><br/><p>Liu Xu smiled, “Godly Doctor Lin, what do you mean by that? There are no hard feelings between us. I just want to establish myself in Shanghai. Is that not okay?”</p><br/><p>Lin Fan replied, “Of course that’s fine. You are very welcome to do that.”</p><br/><p>However, he was cursing in his heart. Welcome my a*s. This lady had bad intentions and something was definitely going to happen.</p><br/><p>But really, this Liu Xu, after regaining her female style, was really beautiful. It was something that Wu You Lan, a young little flower, couldn’t compare to. Her demeanor and her mannerism were releasing an aura of maturity. It was very attractive.</p><br/><p>Her wavy, long hair, her fiery red lips and especially her leather clothing, were really something else.</p><br/><p>Wu You Lan asked, “Will Brother Lin be going as well?”</p><br/><p>Liu Xu said, “I only gave you an invitation. If the Godly Doctor wants to go, he can go on his own. Although I can’t give him an invitation, he is still very welcome.”</p><br/><p>“Cheh,” Lin Fan grumbled in his heart. Why would he want to go? Even if she invited him, he wouldn’t go. He would rather save himself the trouble.</p><br/><p>After Liu Xu left, Wu You Lan went to Lin Fan’s side and smiled cheerily, “Brother Lin, when will the misunderstanding between you and Sister Liu Xu be resolved?”</p><br/><p>Lin Fan replied, “What misunderstanding is there between us? She just keeps wanting to trouble me. Think about it. For a male to turn into a female is simple. But for a female to turn to a male, where would you find something like that? Don’t you think so?? And look how good she is now. She’s not just not thanking me but she even wants to deliberately cause trouble for me.”</p><br/><p>Wu You Lan pouted. “Sister Liu Xu isn’t causing trouble for you. But Brother Lin, what you just said is really bad. If Sister Liu Xu had heard that, she would probably start quarreling with you again.</p><br/><p>“But are you really not going?”</p><br/><p>Lin Fan waved his hand and said, “I’ll see when the time comes. If I’m in a good mood, I’ll go take a look. If not, then I won’t go.”</p><br/><p>Wu You Lan smiled, “Brother Lin, if you don’t go, I’d be very bored.”</p><br/><p>At that moment, Fraud Tian sneakily leaned over with a look of eagerness on his face. “Can I go?”</p><br/><p>Before Lin Fan could open his mouth, Wu You Lan shook her head and said, “You can’t go.”</p><br/><p>Fraud Tian sighed, “Sigh, you’re too cold. Back then, I’ve fought everyone in the cities and in the countrysides and I was unmatched. There were countless people who would invite me to ceremonies. But now, sigh…I shan’t say it.”</p><br/><p>Everyone couldn’t help but start laughing. But Lin Fan knew that this Fraud Tian was thinking about his past once again.</p><br/><p>Afterward.</p><br/><p>Lin Fan gave Wang Ming Yang a call.</p><br/><p>“Ming Yang, how could you agree to Liu Xu and allow Wu Huan Yue to do a commercial performance at her opening?”</p><br/><p>Wang Ming Yang, “Huh? What is it? Are you on bad terms with her? She offered a pretty high price. I thought it would be a waste not to earn this money, so I agreed. Is there a problem? If there is, I will back out now.”</p><br/><p>“No need. Since you’ve already agreed, then just stick to it.”</p><br/><p>After hanging up, Lin Fan shook his head. This Liu Xu’s ability to gather information was quite amazing. She actually found out that Lin Fan knew Wu Huan Yue.</p><br/><p>And she had come to his shop today, seemingly to tell him to watch out. Otherwise, everyone close to him would be eliminated in one fell swoop.</p><br/><p>This kind of opponent couldn’t be ignored.</p><br/><p>Although she was a little lady, she was very dangerous.</p></div>\n</div>"}