{"title": "Chapter 604 - The feeling is mutual", "id": 604, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-604-the-feeling-is-mutual", "volume_title": "Volume 7", "body": "<h1>Chapter 604 - The feeling is mutual</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Chief Xu chuckled in his heart and didn’t say much. He wanted to see just who this guy could call over.</p><br/><p>Cloud Street!</p><br/><p>Elder Zhang said, “Everyone, I have an important notice. Little Boss is calling us to go attend an opening ceremony. Food and drinks are all included and it’s a high-end hotel.”</p><br/><p>Elder Liang said, “Little Boss is finally thinking about us. He actually thinks about us when there’s something so good.”</p><br/><p>“Cheh. You say it as if Little Boss is very stingy. When has Little Boss ever not thought about us?”</p><br/><p>When Fraud Tian heard about this, he immediately made a move.</p><br/><p>“What’s everyone still waiting for? Hurry up and go!”</p><br/><p>He was in a beautiful mood. He had never expected that kid to have some conscience, to remember them when there’s something so good. All his previous discontentment instantly vanished.</p><br/><p>“Do we need red packets if we’re attending an opening ceremony?”</p><br/><p>“Little Boss said that there’s no need. As long as we go, it’s fine.”</p><br/><p>“That’s really great.”</p><br/><p>…</p><br/><p>Dongyue Entertainment Hotel.</p><br/><p>Lin Fan was all smiles. He waved his phone as he said, “I’ve called people over already. For your hotel opening to be so lifeless is really pitiful. But when they come, they will have their expectations. Your food and drinks have to be up to standard.”</p><br/><p>Liu Xu chuckled, “How could I possibly not have enough to eat here?”</p><br/><p>Liu Xu stayed silent as he stood at the side. He wanted to see just what kind of people would come. According to what he saw, this kid had a pretty good car and he seemed to have some money. The mysterious feeling that he was getting didn’t feel right. It was hard to say if he would be embarrassed by this kid. Naturally, he had to see just who that kid had called.</p><br/><p>“Brother Lin.” Just as everyone was waiting, a female voice came from afar.</p><br/><p>Wu Huan Yue had been very busy lately. She hadn’t visited Shanghai the whole time. This time, she came to Shanghai mainly because she had taken up this activity. Initially, she had planned to go to Cloud Street but this trip was really too hurried. She had no choice but to wait until the activity ended before going to Cloud Street to look for Brother Lin.</p><br/><p>When Wu You Lan heard that voice, her expression changed. Her strong competitor was here.</p><br/><p>Very soon, a very lively silhouette appeared in front of Lin Fan. Because she was now a public figure, she had to be a little more careful, so she was wearing a mask. Anyone not too familiar with her wouldn’t have been able to recognize her.</p><br/><p>Chief Xu saw that someone had come. Although he couldn’t see her whole face, her pupils gave off a quick-witted feel. She seemed like a beautiful lady. Of course, he didn’t think that she was a celebrity.</p><br/><p>Lin Fan smiled, “Huan Yue, you haven’t come to see me lately. It can’t be that because you’re famous now, you don’t know me anymore, right?”</p><br/><p>This was just a joke but it made Wu Huan Yue panic.</p><br/><p>“No, I didn’t…” Wu Huan Yue anxiously tried to explain herself. “I didn’t forget you, I have always been wanting to come and visit Brother Lin but I haven’t been in Shanghai at all. I…”</p><br/><p>As she spoke, Wu Huan Yue was almost to the point of tears. What she was most afraid of was for Brother Lin to become unfamiliar with her after being apart for so long. When she had heard what he said, how could she have kept her cool?</p><br/><p>Wu You Lan had always treated Wu Huan Yue as her strongest fellow competitor but at that moment, Wu Huan Yue had been made to cry by a single sentence from Lin Fan. Wu You Lan said in a displeased tone, “Brother Lin, you’re being too mean…”</p><br/><p>Lin Fan hadn’t expected things to turn out like this. He hurriedly comforted her, “Huan Yue, I was joking. Why did you take it so seriously? You have to control yourself, you aren’t an average person anymore.”</p><br/><p>Wu Huan Yue said, “Brother Lin, I really didn’t.”</p><br/><p>Lin Fan patted Wu Huan Yue on the head and said, “I know. I was just joking just now. Why do you get nervous so easily, you little girl?”</p><br/><p>Chief Xu was starting to get displeased. Just what was this kid’s background. Something didn’t seem quite right about this situation. She could understand that little lady beside him but what was up with that little lady with the mask? Although he couldn’t see her whole face, just by seeing her slim and tall physique and her eyes, he could tell that he was definitely a beautiful lady.</p><br/><p>F*ck!</p><br/><p>How could young guys these days be so well-liked by beautiful ladies?</p><br/><p>Wu Huan Yue said, “Brother Lin, you’re so mean!”</p><br/><p>When she said ‘you’re so mean’, Lin Fan’s heart softened and he couldn’t quite take it. It seemed that this little girl had become more mature after mixing around in the entertainment circle.</p><br/><p>However, doing anything immoral with her was definitely not possible. Would Wang Ming Yang dare to let someone do that with Wu Huan Yue? Lin Fan didn’t even have to think. He knew that it was completely impossible.</p><br/><p>At that moment, car after car stopped at the entrance of the hotel.</p><br/><p>These cars were all worth around two or three hundred thousand. To normal people, they were pretty good but to a wealthy man like Chief Xu, they were simply unpresentable.</p><br/><p>“Little Boss…we’re here.” Elder Zhang was the first to get off the car. He waved at them.</p><br/><p>Lin Fan smiled and said, “The people I called are here.”</p><br/><p>Chief Xu turned around and took a close look. He couldn’t help but burst into laughter with a ‘pfft’ sound. “Kid, these are the people you called?”</p><br/><p>Lin Fan nodded, “What is it? Is there an issue?”</p><br/><p>Chief Xu laughed, “No, there’s no issue at all.”</p><br/><p>He was about to laugh to death. He had never thought that these would be the people that the kid called. Looking at the cars and looking at the way they dressed, these people were definitely not influential people.</p><br/><p>He could randomly pick a guest at his opening ceremony and that guest would completely overwhelm these guys.</p><br/><p>“Chief Liu, how about this? If you’re interested, you can come over to my side to take a look,” said Chief Xu. He didn’t want to stay here any longer. This was a complete joke.</p><br/><p>Liu Xu glared at Lin Fan. She had expected this guy to call some reliable people over. She had never expected him to call his Cloud Street neighbors over.</p><br/><p>He wasn’t helping her at all. They were clearly here just to eat and drink.</p><br/><p>Lin Fan greeted the guests, “You guys came really quickly. Today is Chief Liu’s opening ceremony. Everyone, congratulate her. I’ve talked to Chief Liu, today’s food, drinks, and entertainment will all be covered by her. Play to your hearts’ content!”</p><br/><p>Elder Zhang said, “Congratulations, Chief Liu!”</p><br/><p>Fraud Tian said, “This hotel is really beautiful. For Chief Liu to be so capable at such a young age, it is really shocking.”</p><br/><p>“Congratulations.”</p><br/><p>“I wish for your business to prosper!”</p><br/><p>There weren’t a lot of people from Cloud Street but there were still several hundred. When they came all at once, Liu Xu’s jaw dropped.</p><br/><p>Although she had kept her cool the whole time, she couldn’t take it anymore. Then, she glared menacingly at Lin Fan.</p><br/><p>This sh*tty Godly Doctor. She had initially thought that he was here to help her out of her embarrassment. She had never thought that he was here to f*ck her up.</p><br/><p>Wang Xin, who was standing at the side, was dumbfounded. She asked weakly, “Chief Liu, what do we do?”</p><br/><p>Lin Fan said peculiarly, “Chief Liu, you won’t go back on your word, right? If this isn’t alright, I can pay for this myself.”</p><br/><p>Liu Xu took a deep breath, then waved her hand. “Later on, bring everyone in and take good care of them.”</p><br/><p>Wang Xin nodded, “Yes, Chief Liu.”</p><br/><p>Chief Liu said quietly, “You’re heartless.”</p><br/><p>Lin Fan smiled calmly, “The feeling is mutual.”</p><br/><p>At that moment, a man walked over from afar.</p><br/><p>“Chief Xu, why did you leave during the opening ceremony? Everyone is waiting for you,” said Jin Yun Min with a smile.</p><br/><p>“Chief Liu, this is Chief Jin, my good friend.” Then, Xu Ming greeted Jin Yun Min, “Chief Jin, I’ll be there in a bit.”</p><br/><p>Jin Yun Min said with a smile, “Chief Xu, today is your opening ceremony. If you aren’t there, it would be meaningless. Hey…”</p><br/><p>“Hey!” Lin Fan’s and Jin Yun Min’s eyes met.</p><br/><p>“Master Lin…”</p><br/><p>“Chief Jin.”</p><br/><p>The two of them were surprised. They had never expected to see each other here.</p><br/><p>And as they were in astonishment, Chief Xu was stunned as well. What was going on? Did these two know each other?</p></div>\n</div>"}