{"title": "Chapter 610 - Pity, such a pity", "id": 610, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-610-pity-such-a-pity", "volume_title": "Volume 7", "body": "<h1>Chapter 610 - Pity, such a pity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the police station.</p><br/><p>Ding ding!</p><br/><p>The loud ringing of the phone broke the long-lasting silence.</p><br/><p>“Chief, it is the criminals on the line,” Liu Xiao Tian said. This phone call was made from Lu Li to Lu Zhong Ming’s phone.</p><br/><p>Qin Ju nodded and said, “Answer it and then track where it is coming from.”</p><br/><p>“Got it.”</p><br/><p>Wang Ming Yang was standing there. When he heard that the criminals had called, his heart started to race.</p><br/><p>Qin Ju said, “What do you plan on doing?”</p><br/><p>Brother Qiang said, “It’s simple. If you want them to be safe then release ‘Scorpion’. I need you guys to release ‘Scorpion’ at anywhere that I say within an hour. If not, I will not be able to guarantee the safety of the two hostages.”</p><br/><p>Qin Ju said, “Let me hear their voices, if not I won’t agree to this.”</p><br/><p>Brother Qiang said, “Hey, let’s get this clear. I am not the one pleading with you, you are the one pleading with me. If you have not released the ‘scorpion’ within an hour, you can get ready to take their corpses and I will let you know where to pick them up.”</p><br/><p>Busy signal.</p><br/><p>“Hello? Hello?” Qin Ju said then he put down the phone. “Did you manage to track them down?”</p><br/><p>The technical staff shook his head and said, “No, I could not find them.”</p><br/><p>“D*mn it,” Qin Ju said. He had not imagined that these drug dealers would be so cunning. Now that the hostages were in their hands, no good could come from that.</p><br/><p>Liu Xiao Tian said, “Chief, then are we going to trade ‘Scorpion’ for them?”</p><br/><p>Qin Ju replied, “These drug dealers are ruthless and merciless. I’m just scared that even if we trade them for ‘Scorpion’, it is still hard for us to guarantee the safety of the hostages. Regardless of which, we need to keep these hostages alive, even if it means letting ‘Scorpion’ go. If we let him go, we can still catch him again, but if the hostages die, we can’t get their lives back.”</p><br/><p>Liu Xiao Tian nodded, “Got it chief.”</p><br/><p>Qin Ju nodded and then said, “In order to conduct the exchange, we will have to do it face to face. Only when necessary then we will let ‘Scorpion’ go. Also, remember, the moment ‘Scorpion’ is released, send someone to follow him.”</p><br/><p>“Got it.”</p><br/><p>Wang Ming Yang was very anxious and he was staring with his eyes wide open. THen he realized that he was powerless and could only wait for news from the police.</p><br/><p>Lu Zhong Ming was seated there too. On the outside, he looked calm and composed. However, the tight grip in his two hands showed that he was nervous inside.</p><br/><p>He only had this one son, something could not possibly happen to him.</p><br/><p>Especially since he knew that the opposition were drug dealers, using his son to threaten the police and gain something in return. Upon knowing this, he was scared things would turn for the worse.</p><br/><p>If it was just kidnapping, that was fine as they would only be after money and would not kill them. However, it was nothing like that. Even if they got the man they wanted, they could still hurt his son.</p><br/><p>“Qin Ju, regardless of what happens, you have to keep my son safe,” Lu Zhong Ming said.</p><br/><p>Qin Ju said, “Relax, we, as the police, will definitely do our best.”</p><br/><p>Wang Ming Yang said, “And my brother too, he better be safe also. If anything happens, I will risk my life and join in the rescue also.”</p><br/><p>…</p><br/><p>In a remote and desolate area.</p><br/><p>“Brother Qiang, are they going to release him?”</p><br/><p>Li Qiang sneered, “Even if they didn’t want to, they will have to. It is not something they can afford not to do.”</p><br/><p>This time of infiltrating Shanghai, they had prepared well. Even if they were to be exposed, it mattered. At worst, they just would not be able to enter the country anymore.</p><br/><p>In the prison.</p><br/><p>‘Scorpion’ was in his prison attire and was under interrogation. However, ‘Scorpion’ was very calm. Regardless of what the interrogator asked him, he would not answer. However, at times he would give some basic information, stuff that the police knew already.</p><br/><p>Captain Huang Gang of the criminal police department brought Liu Xiao Tian here. When ‘Scorpion’ saw him, he let out a smile and then glared at the two of them. He said, “Police officers, has something happened and you guys are here for my help?”</p><br/><p>“Scorpion, did you know from the start that people would come and save you?” Liu Xiao Tian asked.</p><br/><p>“Hehe,”‘Scorpion’ laughed. His laughter was very calm.</p><br/><p>Then, Liu Xiao Tian shot a glance at Huang Gang. It looked like this was a little problematic. It seemed like ‘Scorpion’ knew that people were coming to save him.</p><br/><p>From the moment he was captured, ‘scorpion’ knew that nothing will happen to him, if not he would not be so calm.</p><br/><p>Also, ‘Scorpion’ knew that he had a lot of secrets, so the police would not do anything to him. If they wanted to extract information out of him, they had to keep him alive.</p><br/><p>…</p><br/><p>In the warehouse.</p><br/><p>Lin Fan looked at Wu Wei and kept shaking his head and said, “A pity, such a pity.”</p><br/><p>Lin Fan’s words made Wu Wei shiver from head to toe. Wu Wei could not help making his voice more solemn and said, “What is a pity? Can’t you just finish your sentence in one go?”</p><br/><p>Chen Hu said, “Why are you being so rash? Just listen to what the master has to say.”</p><br/><p>He had some appreciation towards Lin Fan. He never thought that Lin Fan was so talented. When Lin Fan spoke, it stunned him, also, his words hit close to his heart.</p><br/><p>When he carefully thought about the past, it was really like he said.</p><br/><p>If he did not go down this path, it was uncertain that he would still be like that.</p><br/><p>Lin Fan looked at him and said, “You have done too many bad things in your life. Although retribution has not fallen onto yourself, by looking at your daughter, I’m afraid that it is not as encouraging.”</p><br/><p>Wu Wei was stunned. His expression looked a bit like he was scared to speak when he said, “You know my daughter?”</p><br/><p>At this moment, it was not just Wu Wei who was dumbfounded, Chen Hu was also. He knew about his daughter, but besides him and a few others, no one else knew about her.</p><br/><p>But now, this Master Lin knew all about it. It was certainly a little scary.</p><br/><p>Also, they swore that they had no idea who this Master Lin was.</p><br/><p>“Haha. You guys can’t look me in the eye anymore, can you? Who am I? I am Master Lin. I said I knew about your daughter and I even knew about her illness. Also, based on the fortunes, her condition does not look too good. Who asked you to commit so many bad deeds? A pity, really such a pity,” Lin Fan shook his head and said.</p><br/><p>Lu Li blanky looked at Lin Fan. He suddenly felt that the situation was a little off. What was up with these kidnappers? Why are they chatting with Lin Fan so happily?</p><br/><p>Wu Wei was going crazy and said, “Pity? What is so pitiful?”</p><br/><p>Lin Fan shook his head, replying, “I am not pitying your daughter’s condition but rather, if you did not get into the drug dealing business, your daughter would certainly have a more optimistic future. But right now, it’s too late.”</p><br/><p>“How can it be? Wu Wei daughter’s illness. But that is…” Jin He was extremely stunned. When he had not finished, Lin Fan interrupted him.</p><br/><p>“No buts. To me, there is no incurable disease in this world. But regardless, you guys do what you are supposed to do. Chairman Lu and I are just hostages, so we should behave like one,” Lin Fan replied.</p><br/><p>Lu Li very urgently said, “Brother Lin, keep talking to them, chatting with them.”</p><br/><p>To Lu Li, he had accepted it now. He never thought that this Master Lin had the ability to sway these kidnappers. This capability was really beyond words.</p><br/><p>However, looking at the way Lin Fan was, he did not look willing to speak.</p><br/><p>But he was helpless and he didn’t know what to do..</p></div>\n</div>"}