{"title": "Chapter 614 - Are you scared?", "id": 614, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-614-are-you-scared", "volume_title": "Volume 7", "body": "<h1>Chapter 614 - Are you scared?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At Cloud Street!</p><br/><p>The shop owners had all come back early. Little Boss was in trouble so they were extremely worried and had no mood to play around.</p><br/><p>Wu You Lan and Wu Huan Yue were all in tears. Sister Hong was by their sides trying to comfort them. Even Liu Xu was by Wu You Lan’s side.</p><br/><p>Wu You Lan deeply felt that she was responsible. She said, “It’s all my fault. I was so insistent on Brother Lin following me. He did not want to go at first, probably because he had seen the future and that something bad would happen to him. But I… It’s all my fault.”</p><br/><p>If Lin Fan was here, he would definitely tell her, “Little Sister, you’re thinking too much. Life is too unpredictable.”</p><br/><p>Liu Xu patted her on the back and said, “Don’t cry. How could anything possibly happen to him?”</p><br/><p>Wu You Lan just shook her head. She had no idea what message she was trying to convey but she just shook her head anyway.</p><br/><p>At that moment, Liu Xu began to take greater notice of her tone. Wu You Lan was so sad right now so if she were to say something that despite having good intentions but was not nice sounding, it could make You Lan angry. However, she did not know what to say so she just tried to comfort her.</p><br/><p>As for whether she was worried or not, she was definitely worried. Regardless of what people say, he did attend her store’s opening ceremony and cheered her on. To add on to that, he was kidnapped in front of her store so she definitely felt very apologetic.</p><br/><p>Fraud Tian said, “How could the little guy get into trouble. He normally gets into so much trouble without even provoking anyone and yet not a god d*mn thing has happened to him. This time, it will definitely be the same.”</p><br/><p>Zhao Zhong Yang nodded and said, “Yes. Brother Lin has a lot of good fortune and the police are also trying to rescue him. There should not be any issues.”</p><br/><p>The shop owners were all worried. Little Boss was such a good person, how could anything happen to him? If something really did happen to him, then God must be blind.</p><br/><p>“Where’s the boss, I want to buy…” a customer shouted at the entrance to Sister Hong’s store.</p><br/><p>Sister Hong definitely did not have the mood to do any business right now so she rejected him, saying, “I’m very sorry, I’m not doing any business today.”</p><br/><p>The customer took a glimpse and felt apprehensive inside. His purchase was actually rejected. It was a confusing situation.</p><br/><p>Everyone surrounded the entrance to the store. They were comforting each other and praying for protection. They were all awaiting news from the police.</p><br/><p>“What are you guys doing?”</p><br/><p>Suddenly, a voice which raised everyone’s spirits rang from afar.</p><br/><p>Everyone’s eyes all shifted to the source of the sound and then they all erupted in cheer.</p><br/><p>“D*mn, Little Boss, you are actually unharmed.”</p><br/><p>“Bless the Lord, Little Boss has finally returned.”</p><br/><p>“I knew nothing would happen to Little Boss.”</p><br/><p>“It was guaranteed. You guys have not seen the kind of hardship Little Boss has gone through in his life. He has tangled with so many people and yet has never been beaten by anyone before. This kind of situation is nothing to him.”</p><br/><p>When Wu You Lan and Wu Huan Yue saw Lin Fan, their expressions changed from sad and gloomy to extremely happy. They raced towards Lin Fan and into his embrace.</p><br/><p>“Brother Lin, you have finally returned.”</p><br/><p>Having someone to hug on both his left and right, this was not a very good situation for him. He had initially planned to push them aside and tell them to conduct themselves properly. However, when he saw how they behaved, he laughed saying, “What do you mean by finally returned? I just went out to settle somethings and you guys were so scared. Okay, okay, so many people are watching, it’s not a good image.”</p><br/><p>Lin Fan patted them on their heads and his face started to let out a huge smile. He was the type of guy who had the chance to hug two girls at the same time.</p><br/><p>The surrounding shop owners all laughed.</p><br/><p>“Little Boss is really fortunate.”</p><br/><p>“Wow, his luck with the ladies is really one to be admired.”</p><br/><p>“What? Do you admire him? Do you dare to say that again?”</p><br/><p>“My dear wife, I did not say anything. I was only lamenting for a bit.”</p><br/><p>“Hmph, how dare you.”</p><br/><p>Lin Fan’s return caused Wu You Lan and Wu Huan Yue to breath a sigh of relief. As long as he was okay then everything was good.</p><br/><p>At this moment, Lin Fan looked at Liu Xu and said, “Hey, Chief Liu, why are you here also? Could it be that you were worried about me also?”</p><br/><p>Liu Xu stared at Lin Fan with her eyes wide open and said, “Hmph, I was here to see You Lan. Don’t think so much. You Lan, I’m going to make a move first.”</p><br/><p>You Lan said, “Sister Liu Xu, are you not going to stay awhile?”</p><br/><p>Liu Xu waved her hand and said, “The hotel just opened and needs help. Besides, I’m scared some of them won’t like it if I stay too long.”</p><br/><p>Lin Fan looked at her and helplessly laughed.</p><br/><p>Wu You Lan said, “Brother Lin, Sister Liu Xu was also very worried, if not she wouldn’t have come over.”</p><br/><p>Lin Fan said, “Women, I can’t understand them. Okay, it’s all settled already. Everyone, disperse and get back to work. Gathering here isn’t a good thing anyway.”</p><br/><p>Everyone exchanged a few sentences with Lin Fan and then left the area.</p><br/><p>This whole situation was not reported outside. Only the people of Cloud Street, as well as a few bosses, knew about this. This rest was kept in the dark.</p><br/><p>Also, Lin Fan did not really want this news to get out. He did not see the point of it and it would just make people worry.</p><br/><p>Especially his own parents. If they found out that he was kidnapped in Shanghai, even if they did not kill him, they would drag him back home. That way, when it came to his parents, he only let them know about the good things. Thus, giving them a chance to brag to their neighbors as well as not having to worry so much.</p><br/><p>…</p><br/><p>At the police station!</p><br/><p>The interrogation began.</p><br/><p>These drug dealers were all shot in the leg and had to undergo surgery. To ensure that these drug dealers would not escape, the police also tightened their surveillance.</p><br/><p>Also, this situation brought about some huge repercussions. The higher-ups in the police department thought it was very important to try and extract as much information as they could from the mouths of these drug dealers.</p><br/><p>The police also tried getting people to infiltrate Myanmar as well as the Golden Triangle but the results were not good. They were not able to obtain any useful information.</p><br/><p>Since he had Lin Fan, Wu Wei had no reason to hide anything. He started to tell them everything that he knew. This was so that they would go to Myanmar and bring his sick daughter over here for treatment.</p><br/><p>With Wu Wei, the police obtained a lot of previously unknown information. Also, this information was all very important. It went without saying that this caused them to make huge progress in the fight against these drug dealers.</p><br/><p>However, when Qin Ju has interrogating a certain mercenary, he received a piece of information which left even him dumbfounded.</p><br/><p>He could bend bullets?</p><br/><p>Does he take us policemen as idiots?</p><br/><p>If he could bend bullets then you might as well say he can make them spin.</p><br/><p>However, when Qin Ju interrogated all of the drug dealers, he finally got a clearer picture of the situation.</p><br/><p>It seemed like he could really bend bullets.</p><br/><p>This went against all laws of science.</p><br/><p>Master Lin being able to shoot a gun was already something that was hard to imagine.</p><br/><p>Thus, because he did not want to cause unnecessary trouble, Qin Ju did not press further into this. So much so that he did not even write this down in his report.</p><br/><p>A few months later.</p><br/><p>At Cloud Street.</p><br/><p>Lin Fan was lying down and looking at the Encyclopedia. The smile on his face was larger than normal.</p><br/><p>Encyclopedic points; 8500.</p><br/><p>At this moment, Lin Fan really wanted to stand up and shout.</p><br/><p>“Are you guys scared?”</p><br/><p>It did not matter if other people were scared or not, he himself was already scared.</p><br/><p>The learning material that was in here was really too amazing. The encyclopedic points were also too easy to get.</p><br/><p>“I’m going to go for a walk, you guys look after the store,” Lin Fan said. He was feeling a little impatient. He wanted to go down to the Children’s Welfare Institute and let all the children see how awesome his perfect quality Little Intelligence Pill was.</p></div>\n</div>"}