{"title": "Chapter 636 - This Thing Just Got Huge", "id": 636, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-636-this-thing-just-got-huge", "volume_title": "Volume 7", "body": "<h1>Chapter 636 - This Thing Just Got Huge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the police station.</p><br/><p>Chen Chang Ping was elated. He never thought the day would come where he would see Ma Mu Feng sitting opposite him getting interrogated. The list of things that he had done was just too long.</p><br/><p>“Commander Chen, with all that he had done. What is the punishment for it?” Lin Fan asked.</p><br/><p>“Either a life sentence or death penalty, but there is a higher chance of the death penalty,” Chen Chang Ping answered.</p><br/><p>Facing a person like that, Chen Chang Ping thought that the law was still insufficient to deal with this, and the only other option was violence. But he thought maybe forget it, since Ma Mu Feng had never personally killed anyone before, and so if he had let the law settle him,</p><br/><p>Ma Mu Feng had many backers and supporters and even if all of them got dug up, they would probably deny everything and call the case a huge injustice.</p><br/><p>If it going to turn out like that, it was going to be really messy.</p><br/><p>At this moment, a police officer rushed into the room, his face full of panic.</p><br/><p>“Commander Chen, there are a lot of reporters outside right now. They say that it was Liu Ren who called them over and they want to come in now to conduct an interview.”</p><br/><p>This decision couldn’t be handled by him and had to be brought up to higher authorities to decide if it was wise to do so. If the journalists came with a threatening attitude, who knows what the journalists would do.</p><br/><p>Chen Chang Ping looked at Lin Fan, motioning for his opinion.</p><br/><p>Although he was the head at the police station and it was his responsibility to make the call, the day was just too weird for him to think rationally anymore.</p><br/><p>Ma Mu Feng who was Qing Zhou’s Godfather Ma, who had committed countless atrocities had gone to the police station that day to confess his crimes and to surrender himself to the authorities. It was almost unbelievable and everyone in the police station thought that they were dreaming. The only rational thing that Commander Chen could do was to seek Lin Fan for guidance.</p><br/><p>“Commander Chen, you have seen the current situation. Ma Mu Feng definitely has backers and supporters behind him, and they are definitely not to be trifled with. If you just settle this issue privately, I’m afraid that you might not have enough authority and power to control this situation. Why don’t you let the journalists come to make this situation public? If more people knew about this, the backers and supporters would have less power over you. Furthermore, the people of Qing Zhou have been scared their entire lives. It’s time to give them some happiness in their lives,” Lin Fan said.</p><br/><p>“Let them in,” Chen Chang Ping said, nodding his head. Whatever Lin Fan said made a lot of sense.</p><br/><p>The policemen nodded their heads. “Yes sir!”</p><br/><p>…</p><br/><p>The journalists had been waiting outside for quite a while but within that short period, they managed to piece together the brief information of the case.</p><br/><p>Ma Qing Zhou really came to give himself up and he did it of his own accord. It was almost unimaginable.</p><br/><p>At that moment, they were all elated.</p><br/><p>Ma Qing Zhou had committed countless crimes in Qing Zhou and the news agencies had all been suppressed. They didn’t dare to report anything about him. If they did, they would have disappeared the very next day.</p><br/><p>But it was different now. Ma Qing Zhou had come willingly to give himself up and had even asked the press to come to report the news. This was the opportunity of a lifetime.</p><br/><p>With the go-ahead from the policemen, the group of journalists streamed into the police station.</p><br/><p>“Over there. Ma Qing Zhou is over there.”</p><br/><p>“Do you guys want to go over? That is Godfather Ma over there.”</p><br/><p>“He’s the one who called for us, and we are journalists. Of course we have to go there.”</p><br/><p>“Yea, and this is the police station. What can he do to us?”</p><br/><p>Ma Mu Feng beamed gleefully as he saw the journalists arrive. Thereafter, he looked at Chen Chang Ping. “Commander Chen, could I have a word with the journalists?”</p><br/><p>Chen Ping Chang furrowed his brows, thinking deeply. He didn’t know what Ma Qing Zhou was up to, but after seeing Lin Fan nod his head, he felt more at ease. “Alright.”</p><br/><p>The policemen who were standing at the side decided to stay close to protect the journalists. After all, he was a dangerous criminal.</p><br/><p>Ma Qing Zhou got up from his seat and walked towards the journalists.</p><br/><p>The journalists were a little anxious. Some of them gulped in fear as they saw Godfather Ma walk towards them. This was the Godfather Ma, the most feared entity in Qing Zhou, who controlled almost everything inside.</p><br/><p>If the interview for that day wasn’t about Godfather Ma giving himself up to the authorities and was something else, even the most courageous of journalists wouldn’t dare to go close to him.</p><br/><p>Suddenly!</p><br/><p>Ma Qing Zhou got on all fours, kneeling on the ground, his face looking pained. “Over here, I apologize to every single citizen of Qing Zhou. I am truly the scum of the society and an evil man who has done many evil things. I’ve broken up families, stole and killed people. I am deeply apologetic. I am not seeking for your forgiveness, but I just hope to get this off my chest!”</p><br/><p>Complete silence!</p><br/><p>Everyone at the scene was silent.</p><br/><p>The journalists all took a step back when Ma Qing Zhou kneeled down before them, afraid of what he might have done.</p><br/><p>But looking at Ma Qing Zhou kneeling down and hearing what he just said, everyone just stood there shocked.</p><br/><p>Jotting down furiously!</p><br/><p>Click!</p><br/><p>Cameras all pointed forward.</p><br/><p>This was huge news! Absolute huge news!</p><br/><p>Even in a million years, they would never have imagined this possible.</p><br/><p>The big shot of Qing Zhou was kneeled before them, apologizing for what he had done. It was as if the sun was about to rise form the west.</p><br/><p>Ma Qing Zhou stood up. “I have committed many bad things and I am tormented by every single one of them. After meeting Master Lin, I have received insight and have understood the error of my ways. I want to start to atone for my crimes and today, I have taken the first step by coming here to surrender myself to the authorities.”</p><br/><p>The journalists all looked at Ma Qing Zhou in shock.</p><br/><p>At this moment, the journalists all started going berserk.</p><br/><p>“Godfather Ma, can we ask who this Master Lin is?”</p><br/><p>“Why do you want to give yourself up to the authorities?”</p><br/><p>“You control the whole of Qing Zhou and no one dared to oppose you. Did someone backstab you?”</p><br/><p>…</p><br/><p>At this moment, any trace of fear vanished from the journalists. They started firing questions liberally after realizing that Ma Qing Zhou was really here to give himself up.</p><br/><p>With Ma Qing Zhou being a character of such high power and influence, seeing him kneel before them was almost like a dream.</p><br/><p>But what other explanation was there for his actions, except that it was genuine?</p><br/><p>“I’ll give an answer. Master Lin is this gentleman standing next to me. He comes from Shanghai and came to meet me personally. I had suffered from an incurable disease and he didn’t want to cure me, and so I devised a plan to submerge someone under the river as blackmail. Thereafter, Master Lin talked some sense into me and made me realize the error of my ways. What I have done is unforgivable but I can start to make up for it by taking the first step to confess and give myself up to the authorities.”</p><br/><p>The journalists directed their cameras to Lin Fan, but Lin Fan waved them away. “There is no need to interview me. He is the star of the show today. Just interview him.”</p><br/><p>For the journalists, they decided to just take a few pictures of Lin Fan. They really respected him, since it was an almost impossible and unimaginable task to get the Godfather Ma to give himself up.</p><br/><p>Even a senior monk wouldn’t have been able to talk any sense into Ma Qing Zhou.</p><br/><p>Ma Qing Zhou continued to talk about the crimes that he had committed in the past, and the journalists broke out in cold sweat as they heard what he said. It was just too terrifying.</p><br/><p>If it wasn’t Ma Qing Zhou himself who was talking, no one would have dared to believe what they were hearing.</p><br/><p>Furthermore, they never realized how corrupted and messy Qing Zhou was.</p><br/><p>At this moment, both the journalists and the policemen were recording down what Ma Qing Zhou was saying.</p><br/><p>The people that he had mentioned and the people implicated in his crimes were many.</p></div>\n</div>"}