{"title": "Chapter 648 - Tigers Are Gentle Creatures", "id": 648, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-648-tigers-are-gentle-creatures", "volume_title": "Volume 7", "body": "<h1>Chapter 648 - Tigers Are Gentle Creatures</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The zoo workers were also stunned. There was only one person but now there were two people. Although the tigers have been raised in captivity, any tiger would have a wild side to it.</p><br/><p>The tigers already wanted to attack the man. If not for the gunshots of the air rifle, the man would’ve been dead by now.</p><br/><p>“It’s finished…” A zoo worker scratched his head with both of his hands. If people died at the zoo, the zoo would probably have to close down.</p><br/><p>“Save me!” Zhu Shou Jun’s face was filled with tears and mucus. “I know I was wrong and I shouldn’t have evaded payment of the tickets. Save me!”</p><br/><p>If he had known that things would turn out this way, he wouldn’t have dared to jump over the wall. However, it was too late now.</p><br/><p>The other tourists were also stunned in disbelief.</p><br/><p>“This fella is literally asking for it.”</p><br/><p>“How could it be? He just jumped down a platform that’s at least four to five meters high. He seems totally fine.”</p><br/><p>“Is the anesthetic gun here yet? If all five tigers were to attack him at once, the consequences would be unimaginable.”</p><br/><p>The tigers were alarmed when they saw that a stranger had entered their home. They roared and slowly moved towards him. It was as if they could attack him anytime.</p><br/><p>Wu You Lan was stunned speechless. She kept screaming in fear. She didn’t expect Brother Lin to jump down to save him.</p><br/><p>She knew that Brother Lin was awesome but he was facing tigers now.</p><br/><p>Lin Fan walked over slowly and calmly. It was just five ‘small’ tigers, there was nothing to be afraid of.</p><br/><p>Who was he?</p><br/><p>He was the invincible Master Lin.</p><br/><p>However, the situation was a little difficult. The five tigers weren’t really friendly and they were looking at Lin Fan and the other man like they were food.</p><br/><p>“Tiger bros, please remain calm and give me some face. Don’t move,” Lin Fan said.</p><br/><p>The tourists above were stunned.</p><br/><p>“D*mn! Is this man insane? He is actually talking to the tigers.”</p><br/><p>“Anyone would’ve known that tigers are extremely wild and feisty. I don’t want to think of the consequences of this.”</p><br/><p>The tigers just ignored Lin Fan. They were still being overcome by their wild nature. Tigers would normally scare the hell out of their preys. Hence, they were pretty surprised at Lin Fan who was calm and steady.</p><br/><p>The three tigers who were initially lying down and looking at the man started to get up and walk towards the two of them.</p><br/><p>Lin Fan waved to them, “Hey, you, come to me. Don’t let your back face the tigers. Lean towards me.”</p><br/><p>Zhu Shou Jun was scared speechless. Now that someone was talking to him, his jelly legs managed to get himself up and he walked towards Lin Fan slowly.</p><br/><p>The tourists above held their breaths.</p><br/><p>“That man has stood up!”</p><br/><p>“Remain calm. The anesthetic gun will be here soon.”</p><br/><p>“The anesthetic gun will be here in at least ten minutes.”</p><br/><p>When Zhu Shou Jun was going to reach Lin Fan, he immediately turned his head around and ran towards Lin Fan. His only hope was to stay close to him. He was simply shocked beyond words.</p><br/><p>The tiger jumped towards him and tore his clothes but he managed to dodge the palm of the tigers. If not, his neck would’ve been ripped apart by now.</p><br/><p>However, when Zhu Shou Jun turned around, one of the tigers charged towards him.</p><br/><p>To the tigers, the moment their prey turned their backs on them, it was the best time to strike.</p><br/><p>“Ah! The tiger is going to him!”</p><br/><p>“Oh my, someone’s going to die!”</p><br/><p>“Quick, fire the gun! Fire the gun!”</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The gunshots were being fired but the tigers realized that the guns were useless against them and they just ignored it.</p><br/><p>Zhu Shou Jun’s face turned pale when he heard the screams from the platform. He knew that something was wrong and that he was going to die.</p><br/><p>He didn’t expect to endanger his life just to save some money. Then, he closed his eyes and waited for the tiger to strike.</p><br/><p>Then, the crowd became quiet and nothing said anything.</p><br/><p>“What happened?” Zhu Shou Jun’s eyes were closed and he was in doubt. Could he have died already? The crowd was silent but why was there no pain?</p><br/><p>Then, the crowd on the platform started to gasp after seeing what was happening.</p><br/><p>“D*mn!”</p><br/><p>“What did I just see? How is that possible?”</p><br/><p>“Who is this fella? He is so impressive.”</p><br/><p>“That’s a tiger. He actually carried it with one hand?”</p><br/><p>“Look, the tiger’s hind legs look to be struggling and they’re on the ground. It looks pretty painful.”</p><br/><p>Then, even the zoo workers were stunned speechless.</p><br/><p>Lin Fan held onto the tiger’s neck with one hand and use the other hand to carry it. The tiger’s body was bigger and its hind legs would still be on the floor if Lin Fan were to carry it.</p><br/><p>“Tiger bro, what are you trying to do? Did I allow you to attack us sneakily? You better know your place. If not, I’ll break your head,” Lin Fan reprimanded. He patted the tiger’s head with the other hand furiously and the tiger was stunned.</p><br/><p>Damn!</p><br/><p>He carried the tiger with one hand and whacked the tiger’s head furiously.</p><br/><p>How could that be? That didn’t seem realistic.</p><br/><p>The tiger roared, “Destroy this prey.”</p><br/><p>To others, the tiger’s roar just meant that it was furious. However, Lin Fan understood what the tiger was saying. He immediately replied, “You’re asking for help to destroy me? I’ll let you have a taste of what’s to come.”</p><br/><p>The other four tigers rushed over when they heard their ally’s request. They couldn’t have just stayed there and watched. They immediately charged towards him.</p><br/><p>“D*mn, those four tigers rushed over.”</p><br/><p>“He’s doomed.”</p><br/><p>“Your mum!”</p><br/><p>However, the gasps didn’t last for long. Everyone became silent and some of them even knelt down.</p><br/><p>“Mum, I just saw Superman!”</p><br/><p>“Can someone tell me what’s going on?”</p><br/><p>With Lin Fan’s powers, he could flatten the tigers into pancakes with just one blow. However, he thought that it was pretty violent. Furthermore, tigers naturally had a wild nature. How could he blame the tigers for the man’s fault?</p><br/><p>Hence, he decided to be lenient towards the tigers.</p><br/><p>He immediately slapped the tigers and they all fainted.</p><br/><p>Then, he rode one of the tigers, “You better watch yourselves. If not, I’ll swallow you.”</p><br/><p>The tiger naturally didn’t understand human language but it managed to understand what the prey was saying. When it thought of how the prey was going to swallow it, the tiger was scared.</p><br/><p>*cries*</p><br/><p>The tiger that was being carried by Lin Fan gave up. It was fearful and it didn’t want to be swallowed alive.</p><br/><p>When Lin Fan saw that the tiger started to behave itself, he patted its head gently and said, “Not bad, that’s the way. Now, lie down.”</p><br/><p>As they were facing such a fearsome prey, the other tigers started to be more alert.</p><br/><p>Lin Fan immediately went forward and picked up two tigers. Then, he raised them up and their hind legs were struggling to reach the floor. Their wild eyes started to look fearful.</p><br/><p>“Wow…”</p><br/><p>“How can this prey be so strong?”</p><br/><p>“Tigers will never be enslaved!” A tiger roared. However, when it saw the eyes of the prey, it lowered its head and whimpered.</p><br/><p>“Tigers like us are gentle creatures.”</p><br/><p>…</p></div>\n</div>"}