{"title": "Chapter 651 - Stick Your Hand Out", "id": 651, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-651-stick-your-hand-out", "volume_title": "Volume 7", "body": "<h1>Chapter 651 - Stick Your Hand Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Xu Zi Le had not expected this guy to not only humiliate her but also humiliate her wife. How could she stand it? Then, her expression turned cold as she said, “Chief Chen, please conduct yourself with a little more dignity.”</p><br/><p>Chen He shook his head and smiled, “What? Are you angry? Superstar Xu, I’m only saying the truth. I have to say that you have some abilities, for you to get Wang Ming Yang to protect you. However, you have to be clear that Wang Ming Yang may treat you all very well but I, Chen He, am just so f*cked up.”</p><br/><p>Bam!</p><br/><p>Suddenly, Chen He slammed the table. Everything had been fine but suddenly, he had lost his temper. Everyone was astonished.</p><br/><p>Everyone at the site shifted their gazes over.</p><br/><p>Chen He’s tone became cold as well. “Let me ask you one last time. Are you going to drink this wine or not?”</p><br/><p>Xu Zi Le did not hesitate. “No.”</p><br/><p>Pa!</p><br/><p>Unexpectedly, Chen He flung his palm straight at Xu Zi Le, slapping her onto the ground.</p><br/><p>That middle-aged man was the Director. When he saw this, he was alarmed. He quickly held Chen He back. “Chief Chen, don’t be angry. Don’t be angry.”</p><br/><p>Xue Er immediately squatted down next to Xu Zi Le. “Are you okay, Sister Xu?”</p><br/><p>It was very common for celebrities to be taken advantage of by investors.</p><br/><p>And being hit by an investor was a very normal thing.</p><br/><p>Xue Er knew this well. Even she had been hit by the Director before when she was not performing well. But that was when she wasn’t very famous. If she became famous, this kind of thing wouldn’t happen.</p><br/><p>Meanwhile, Sister Xu was quite famous. The only people who would dare to hit her would be investors, especially investors who were capable. They wouldn’t care how popular she was and they would just hit her if they wanted to. Celebrities, even if they have to suffer, can only suck it up.</p><br/><p>Xue Er glared at Chen He. “How could you hit her?”</p><br/><p>The Director was still holding Chen He back. “Chief Chen, please calm yourself down. Don’t hit her. Don’t hit.”</p><br/><p>Chen He pointed at Xu Zi Le and bellowed, “You f*cking whore! I, Chen He, took the initiative to come here but you aren’t tactful at all. Don’t think that you can be lawless just because you rely on Wang Ming Yang. In my eyes, you’re just a whore, understand?”</p><br/><p>“I’m looking forward to seeing if Wang Ming Yang will dare to challenge me just because of you.”</p><br/><p>The surrounding performers and staff didn’t dare to make a sound. This was something that they were sorrowful about, having to face these wealthy people. Even if they were incomparably glorious in front of average people, behind the scenes, they were the victims of countless crimes and they all suffered a lot.</p><br/><p>Xu Zi Le covered her cheek with one hand as she glared furiously at Chen He.</p><br/><p>Chen He scolded her, “What are you looking at? Let me tell you, Xu Zi Le, you’re just a whore to me. Let me ask you again, are you going to drink it or not?”</p><br/><p>The Director was trembling with fear. “She’ll drink it, she’ll drink it. Don’t be angry, Chief Chen. She’ll drink the wine.”</p><br/><p>Xue Er stood in front of Xu Zi Le and said, “Chief Chen, I’ll drink on Sister Xu’s behalf.”</p><br/><p>“Scram off. You have no say in this,” said Chen He angrily.</p><br/><p>Xu Zi Le’s eyes were gleaming with rage. She roared, “I won’t drink it.”</p><br/><p>“Motherf*cker!” Chen He had lost it.</p><br/><p>The Director hugged Chen He’s waist, shouting, “Calm down, Chief Chen, calm down. Run, Zi Le. Leave this to us.” Then, he looked at some of the male performers at the side. “What are you all standing there for? Hurry up and hold Chief Chen down!”</p><br/><p>Chen He glared at everyone at the side. “Whoever dares to come, don’t even think of being in the entertainment industry anymore.”</p><br/><p>When they heard this, everyone was frightened and they just stood in their original spots. They weren’t willing to offend a big shot just for Xu Zi Le.</p><br/><p>“F*ck!” When the Director saw this, he cursed in his heart.</p><br/><p>Since ancient times, actors have always been very fickle. So this situation did make sense.</p><br/><p>Xue Er quickly pulled on Xu Zi Le. “Sister Xu, let’s go, quick!”</p><br/><p>Xu Zi Le stood there stubbornly. “I won’t go. Mr. Chen, if you have the ability, then beat me to death. Otherwise, I’ll definitely have my revenge.”</p><br/><p>Chen He had never seen a female celebrity who dared to challenge him like that before.</p><br/><p>“You…”</p><br/><p>*creak*</p><br/><p>At that moment, the banquet room’s door was pushed open.</p><br/><p>Lin Fan stood at the entrance. There were quite a number of tables inside. “Little Sister, where are you?”</p><br/><p>When Xu Zi Le heard his voice, she was delighted. “Big Bro, I’m over here!”</p><br/><p>Lin Fan’s eyes shifted over. She saw that thing were in a mess over there. Then, he frowned. It seemed that something had happened. There was even a man there who was shouting.</p><br/><p>Everyone looked over at Lin Fan. Some of the celebrities were startled. They had always paid attention to Weibo. Wasn’t this Master Lin?</p><br/><p>Although Master Lin wasn’t involved in the entertainment industry, he wasn’t any less famous than them.</p><br/><p>The things he did, in particular, were very impressive and they were very astounding.</p><br/><p>This Xu Zi Le’s Big Bro was Master Lin?</p><br/><p>And Master Lin called Xu Zi Le his Little Sister. Does that mean that Master Lin was Wang Ming Yang’s Brother?</p><br/><p>When the Director saw him, he quickly said, “Master Lin, this is Chief Chen. There’s been a conflict between him and Zi Le but it’s fine now.”</p><br/><p>Lin Fan frowned as he saw Xu Zi Le covering her cheek. He asked, “What happened to your face?”</p><br/><p>Xu Zi Le had been putting on a strong front but now, it disappeared. Her tears flowed down as she said, “Brother, he told me to drink with him. I refused, so he hit me.”</p><br/><p>At first, when Wang Ming Yang and Brother Lin weren’t around, she was all alone and without support, so she could only put on a strong front. Now that Brother Lin had come, a weak girl like her could not put on a strong front any longer. Her tears naturally came crashing down.</p><br/><p>When Lin Fan heard this, he was instantly furious. Xu Zi Le called him her Brother, so she saw her as his own sibling. Even he wouldn’t bear to hit her and yet, a fat pig had hit her. This was f*cking outrageous.</p><br/><p>“Skinny man, let him go,” said Lin Fan.</p><br/><p>The Director said, “Master Lin, it’s just a misunderstanding. A misunderstanding!”</p><br/><p>Lin fan said once more, “I told you to let him go. I don’t wish to repeat myself again.”</p><br/><p>Facing Lin Fan’s gaze, the Director became nervous. Then, he let go of Chen He.</p><br/><p>Chen He immediately came to Lin Fan’s front. “You’re the whore’s…”</p><br/><p>Pa!</p><br/><p>Lin Fan immediately raised his hand and slapped Chen He. Chen He was stunned. In disbelief, he said, “You dare to hit me?”</p><br/><p>Pa!</p><br/><p>Another slap.</p><br/><p>Chen He stumbled backwards while Lin Fan walked him down, step by step. With every step, another slap was flung out at Chen He.</p><br/><p>Chen He had never expected himself to be beaten by this kid in Shanghai. At that moment, both his eyes were bright red as he bellowed, “Don’t you f*cking know who I am?”</p><br/><p>Pa!</p><br/><p>“F*ck your mom! Who the hell are you?”</p><br/><p>Pa!</p><br/><p>One of them kept shouting while the other kept slapping.</p><br/><p>Everyone’s jaws dropped. There was pin-drop silence in the place.</p><br/><p>They didn’t dare to believe it. Master Lin, without saying a word, just came and started dishing out a beating. Moreover, it was a very dominant beating.</p><br/><p>Chen He’s head was spinning.</p><br/><p>Lin Fan said, “Talk. Keep talking.”</p><br/><p>“I’ll talk about your mom…”</p><br/><p>Pa!</p><br/><p>Lin Fan stood in front of Chen He very calmly. His eyes were steady. “Talk. I told you to keep talking.”</p><br/><p>At that moment, that calm and dominant aura from Lin Fan made everyone stunned.</p><br/><p>What a dominant man!</p><br/><p>At that moment, they understood that Xu Zi Le’s greatest pillar of support was probably not Wang Ming Yang but it was this Big Bro who would beat others up without saying a word.</p><br/><p>“You won’t talk anymore? Alright then. Let’s start discussing proper matters. Xu Zi Le is my Little Sister. If you slap her, you’re slapping me. Which hand did you slap her with? Stick out that hand.” Lin Fan was composed, his tone was calm but even so, it was enough to send a chill down everyone’s spine.</p><br/><p>This chill went all the way from their feet to their heads and all the way up to the highest heavens.</p><br/><p>Terrifying.</p></div>\n</div>"}