{"title": "Chapter 656 - Instantly Furious", "id": 656, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-656-instantly-furious", "volume_title": "Volume 7", "body": "<h1>Chapter 656 - Instantly Furious</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Back home.</p><br/><p>Of course, Lin Fan knew what Xu Zi Le was thinking. However, Wang Ming Yang knew him well. He had already said so much, how could Wang Ming Yang not understand?</p><br/><p>But when Wang Ming Yang had looked into Lin Fan’s eyes, it was clear that he understood.</p><br/><p>It was good that he did because that would save Lin Fan from having to say it too directly.</p><br/><p>Nighttime!</p><br/><p>Many people couldn’t fall asleep.</p><br/><p>Of course, there’s no need to talk about Wang Ming Yang and Xu Zi Le. (Use your own imagination)</p><br/><p>Qiao Xue was laying on the bed, thinking about what had happened in the day. Chen He was a big shot. Since the production, she had noticed Chen He looking at her in a peculiar way. However, she didn’t experience his treachery. It could be said that she had dodged a bullet.</p><br/><p>Qiao Xue couldn’t help but think of that Master Lin. She didn’t know him too well. She had only seen him on Weibo before meeting him in person for the first time that night. She couldn’t help but feel slightly curious.</p><br/><p>Especially during the banquet, that dominant image of him had seeped into her heart. It was unlike anything she had seen before.</p><br/><p>“What kind of person is he exactly?” thought Qiao Xue curiously. Her long hair hung on her shoulders as she leaned on the back of the bed. Then, she took out the phone to see comments about Master Lin on the Internet.</p><br/><p>Gradually, she got immersed in the Internet. Because to her, many of those things done by Master Lin were inconceivable.</p><br/><p>…</p><br/><p>“Head, I’ll take my revenge. Tails, I won’t take my revenge.” Chen He couldn’t fall asleep. Every night when he slept, he would call a young lady over to accompany him but tonight, he was well-behaved for the first time. He held a coin in his hand as he kept flipping it around on his palm.</p><br/><p>He couldn’t stand tonight’s humiliation but he had no choice but to stand it. Every time he closed his eyes, his mind was filled with that guy’s horrifying smile.</p><br/><p>“F*ck, let’s do it.” He placed the coin on his thumb and flicked it up into the air. The coin kept turning in the air as Chen He watched it unblinkingly. His expression was grave. He wondered if it would be Heads or Tails.</p><br/><p>There was complete silence as the coin fell onto the bed mattress.</p><br/><p>Chen He’s pupils contracted. A look of disbelief was in his eyes.</p><br/><p>“How can that be?”</p><br/><p>Quietly lying on the mattress, the side facing upwards was…</p><br/><p>Heads!</p><br/><p>“F*ck! Even if it’s heads, I won’t take revenge. Time to sleep.” Chen He decided not to think too much. He would go to the airport early the next morning and quickly leave this troublesome place. However, he still hadn’t done an important thing.</p><br/><p>He took out his phone and made a call to Director Jin. He told Director Jin that that day’s matter was not to be spread.</p><br/><p>He didn’t dare to show any discontentment towards Master Lin but to people like Director Jin, he would always be the fearsome Chen He.</p><br/><p>…</p><br/><p>Several days later!</p><br/><p>Cloud Street.</p><br/><p>Elder Liang came over. “Little Boss, what are you doing? When I passed by just now, I saw you using your phone. Now that I’m back, you’re still using your phone.”</p><br/><p>“Shush!” Lin Fan placed his index finger on his mouth, indicating silence. “Today, the results of the Youth Chinese Arts Cup are being released. I’m refreshing the webpage. They said it would be out at 2 pm but it’s already 2.05 pm now.”</p><br/><p>“The results are being released today?” Elder Liang was surprised. Then, he saw that Little Boss was still using his phone and hurriedly said, “What are you still using your phone for? Come to my place and use my computer.”</p><br/><p>Since that incident a while ago, the Internet Safety Department had one request for Lin Fan, which was for him not to use his computer skills anymore. He was still allowed to surf the Internet normally. However, he had not gotten his computer back, nor had he bought a new one.</p><br/><p>Lin Fan was someone who was true to his word. He would never go back on his promises. Since he said that he wouldn’t use his computer skills anymore, he definitely wouldn’t use them.</p><br/><p>“Let’s go.” Lin Fan did not hesitate at all. He immediately followed Elder Liang.</p><br/><p>Wu You Lan and the rest followed along as well. Nanshan Children’s Welfare Institute wasn’t just Lin Fan’s blood and sweat. It was theirs too. The cared very much about those children.</p><br/><p>Now that the results were going to be released, naturally, they had to see it.</p><br/><p>Elder Liang’s shop.</p><br/><p>The Internet page was being refreshed.</p><br/><p>Gradually, Elder Zhang and Sister Hong came as well. They were all gathered there, staring at the computer.</p><br/><p>Sister Hong said, “Why aren’t the results out yet? It’s already 2.10 pm now.”</p><br/><p>Elder Zhang said, “Don’t be impatient. This isn’t the college entrance exams. Maybe their website is delayed.”</p><br/><p>Zhao Zhong Yang said, “It can’t be that the results announcer is asleep right? It’s already past the time.”</p><br/><p>“Sigh, be patient. It’s out! It’s out!” Elder Liang cried out in surprise. Then, he immediately looked at the first prize.</p><br/><p>Lin Fan looked at the screen.</p><br/><p>First Prize: Wang Hao Yang (Beijing)</p><br/><p>“Hey, the first prize winner isn’t from our Children’s Welfare Institute. What’s going on?” said Fraud Tian in surprise.</p><br/><p>Lin Fan felt a bit of sorrow but it quickly dispersed. If they didn’t get the first prize, then so be it. Perhaps that child from Beijing was really amazing. Although Lil’ Fatty was very talented. He wasn’t the only talented child in the country.</p><br/><p>“Let’s look at the second prize.” Lin Fan was in anticipation.</p><br/><p>Second Prize: Lil’ Fatty (Shanghai), Wang Hong Hong (Shanghai), Zhang Meng (Shanghai)…</p><br/><p>Lin Fan smiled, “This Lil’ Fatty is pretty good. Although he didn’t get the first prize, second prize is amazing too. The others are amazing too. Our Nanshan Children’s Welfare Institute has really taken the spotlight.”</p><br/><p>Elder Liang said, “Don’t be anxious. Let’s look at the third prize too. And there’s even the Merit Award.”</p><br/><p>They scrolled down.</p><br/><p>“Wow,” Elder Liang gasped in shock, “Look, all the Third Prize winners are from our Nanshan Children’s Welfare Institute too. And look at the Merit Award. The number of people awarded is too high, isn’t it?”</p><br/><p>Lin Fan looked closely and started laughing. “I knew it. All of our Nanshan Children’s Welfare Institute children have won prizes. They’re awesome.”</p><br/><p>“Weren’t there only supposed to be fifty names for the Merit Award?” asked Sister Hong in a puzzled tone.</p><br/><p>Elder Zhang barged into the conversation, “It must be because our children are amazing. Their art prices look too good and the judges must have felt that it would be a shame for them not to get any prizes, so they increased the quota. Don’t you guys think so?”</p><br/><p>Lin Fan nodded, “Mmm, that’s right. These judges from the Chinese Arts Association really know how to do things. But for all the names to be from our children, when the parents of other children sees this, they’ll be furious. They’ll definitely think that there is some sort of shady deal involved.”</p><br/><p>Wu You Lan looked at Lin Fan. “Brother Lin, actually, I can see that you’re a little sad that Lil’ Fatty didn’t get the first prize. You’ve always thought that Lil’ Fatty would get the first prize, haven’t you?”</p><br/><p>Lin Fan didn’t try to hide the truth.</p><br/><p>“Mmm, I have a lot of confidence in Lil’ Fatty. This kid hasn’t had enough experience in the arts but be has attained the freehand brushwork skill that other people have much trouble grasping. At his age, there aren’t many people who can do it. It shouldn’t have been a problem for him to win the first prize and I never expected him not to win it. It’s a bit of a shame,” said Lin Fan.</p><br/><p>Fraud Tian didn’t understand all this. “What’s that freehand brushwork that you’re talking about? I don’t understand.”</p><br/><p>Lin Fan smiled, “To let the heart feel and the brush go freely, without paying much attention to the lines. That is freehand brushwork. Chinese art is divided into fine brushwork and freehand brushwork. Fine brushwork focuses on the beauty of the lines and it is very meticulous. But when compared, freehand brushwork will always win.”</p><br/><p>They had never known all this before but after listening to Little Boss’s explanation, they all understood. It meant that Lil’ Fatty was really amazing and most people wouldn’t be able to beat him.</p><br/><p>Lin Fan said, “Oh right, let me take a look at Lil’ Fatty’s artwork.”</p><br/><p>Elder Liang clicked on an image and an artwork appeared on the screen.</p><br/><p>Lin Fan frowned. “This doesn’t make sense. The freehand brushing technique in this artwork is very strong. It’s definitely not something a six-year-old can grasp. If this only got him second prize, how great must the first prize winner be? Elder Liang, let’s take a look at the first prize artwork.”</p><br/><p>But when the first prize artwork was displayed, Lin Fan was startled. He instantly blurted out vulgarities, “F*ck! This was a f*cking shady deal. This artwork, compared to Lil’ Fatty’s, is a few levels lower. And they dare to give it first place? This is absurd!”</p><br/><p>“What? Little Boss, what shady deal are you talking about?”</p><br/><p>“Hey, something seems wrong. I don’t understand Chinese Art but Lil’ Fatty’s artwork looks much more pleasing than this one. It has more emotion.”</p><br/><p>Wu You Lan realized that Lin Fan was making an ugly expression and was a little angry as well. She pulled on Lin Fan’s sleeve. “Brother Lin, there’s a shady deal behind this?”</p><br/><p>Lin Fan nodded, “Mmm.”</p><br/><p>He didn’t want to say more. If the person who had beat Lil’ Fatty had been better than him, Lin Fan wouldn’t have anything to say. If Lil’ Fatty really was inferior in skill, then it would be okay to lose.</p><br/><p>But what the heck was this?</p><br/><p>They couldn’t tell Lin Fan that he didn’t understand art. In Chinese Arts, if Lin Fan claimed to be second, no one would dare to claim to be first.</p><br/><p>He was that dominant.</p></div>\n</div>"}