{"title": "Chapter 664 - Steady As F*ck", "id": 664, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-664-steady-as-fck", "volume_title": "Volume 7", "body": "<h1>Chapter 664 - Steady As F*ck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lin Fan looked at the three of them curiously, “I knew the three of you were up to no good. This time, you guys pretended to ask me to return to the association. I think you came for something else.”</p><br/><p>Zheng Zhong Shan couldn’t tolerate it after hearing that. Wasn’t he trying to malign him? He immediately stood up, “Elder Lin, you can scold or hit me but you can’t humiliate me.”</p><br/><p>“I didn’t humiliate you.” Lin Fan was a little confused. However, he was laughing in his heart as he saw Elder Zheng’s anxious face.</p><br/><p>Usually, people who knew Elder Zheng wouldn’t dare to treat him with so much disrespect.</p><br/><p>Elder Zheng wouldn’t act this way to an average person too. This form of interaction was only possible between close friends.</p><br/><p>If it was seen by others, they would probably be stunned.</p><br/><p>Zheng Zhong Shan said seriously, “The three of us came to mainly ask you to return to the association. It wasn’t because of any stupid reason. You’re definitely more important than that.”</p><br/><p>“Yeah, yeah!” Yue Qiu Ju Shi and Tao Shi Gang nodded in agreement with Elder Zheng’s explanation.</p><br/><p>*giggle*</p><br/><p>Lin Fan couldn’t take it and he started laughing, “Alright, alright. Those that don’t understand you would probably think all of you are insincere. I won’t say anything more about this matter. Tell me about the Chinese Arts incident then.”</p><br/><p>“Haha, I knew our Elder Lin isn’t a narrow-minded person. If anyone said that Elder Lin was a narrow-minded person, he would be destroyed in front of me. Wouldn’t he be humiliating our Elder Lin?” Zheng Zhong Shan was smiling from ear to ear.</p><br/><p>Yue Qiu Ju Shi and Tao Shi Gang looked at Elder Zheng in disbelief. Wasn’t he the one that said Elder Lin was narrow-minded?</p><br/><p>However, at least things were okay now. That ‘incident’ wasn’t considered to be one anymore.</p><br/><p>“Alright, alright. Don’t play dumb anymore. Do you think I can’t see through your tricks? I think the only person that would say that I’m narrow-minded is Elder Zheng,” Lin Fan chuckled.</p><br/><p>Zheng Zhong Shan felt like he was being maligned, “Forget it. I’ll just take one for the team then. Actually, this international exhibition doesn’t involve us. After all, the most popular form of artwork overseas is oil painting. However, I didn’t expect the fella from the Japanese arts industry to say that Chinese Arts isn’t qualified to be on stage. He said that it’s all trash and even if we were to join the international exhibition, we’d be at the bottom. Look, do you think I can tolerate that?”</p><br/><p>“Furthermore, that isn’t it. Those fellas from the Korean arts industry are really arrogant. They said that our Chinese Arts came from them. They said they’ll show us the true Chinese Arts. Do you think I can tolerate those words? Of course I can’t tolerate it. In the past, I carried guns… Forget it, I’ll not talk about it anymore. It’s peacetime now. I won’t say these words to ruin the atmosphere here.” Elder Zheng was furious but he finally calmed himself down.</p><br/><p>Yue Qiu Ju Shi and Tao Shi Gang sat aside and looked like they wouldn’t give up unless they prove themselves.</p><br/><p>Lin Fan looked at them in doubt, “Can you guys be honest? Why do I feel like it’s fake?”</p><br/><p>Zheng Zhong Shan coughed gently, “I just exaggerated it a bit but I swear that the meaning is there. We can lose to anyone on the international scene but the Japanese and Koreans. The older generation of artists didn’t just draw to pass time. We draw to prove ourselves during important moments like this. We have to prove the might of our country so that the citizens would be proud of the country’s national treasures. Therefore, I really hope that Brother Lin can represent us and crush them with your artwork.”</p><br/><p>“Are you done?” Lin Fan looked at Zheng Zhong Shan and asked. Elder Zheng kept talking about doing the nation proud and it was hard to resist.</p><br/><p>“I’m done,” Zheng Zhong Shan nodded and felt that he said it with gusto. If someone else were to hear his words, he would definitely promise to do the nation proud of him. However, why was Brother Lin so calm about it? That seemed a little weird.</p><br/><p>Lin Fan nodded, “Alright, since Elder Zheng is here personally, if I were to reject you, I wouldn’t be giving you any face. I don’t want to wake up to an army of troops. Isn’t that scary?”</p><br/><p>Elder Zheng was a little embarrassed, “Elder Lin, how can you think of it that way? My power is to be used to protect my good friends, not to destroy them. However, I really just want you to draw a good artwork to show them. But I think you look really energetic, how many are you prepared to draw?”</p><br/><p>Lin Fan smiled and asked, “How many do you want me to draw?”</p><br/><p>Zheng Zhong Shan and the others looked at each other. It was as if they were asking each other, “Should we get one for ourselves too?”</p><br/><p>Lin Fan realized what they were hinting at and he was furious. He immediately started shouting at them.</p><br/><p>“The three of you, don’t be too greedy. One for each of you? Do you want me to die from anger? I’ll probably give nine or ten pieces,” Lin Fan said after thinking about it. He felt that the number of artworks wasn’t that bad. Furthermore, in order to boost his reputation, he had to choose the best artworks. The average ones couldn’t match up to the others.</p><br/><p>“What?” The three of them were stunned when they heard his reply. They asked in disbelief, “Elder Lin, how many did you say? 10?”</p><br/><p>The three of them looked pretty unhappy. Lin Fan glared at them, “Don’t be too greedy. Ten pieces of artwork is good enough. If I were to draw anymore, it’d be too many.”</p><br/><p>Zheng Zhong Shan waved his hand anxiously and hugged Lin Fan involuntarily, “Elder Lin, I, Elder Zheng, has never been impressed by anyone before. But today, I am extremely impressed by you. You are a God in my eyes. Ten pieces of artwork… I think all of them would be blown away by your skills.”</p><br/><p>Then, they looked like they were about to cry. They just wanted an artwork initially but they didn’t expect Elder Lin to be so generous. He immediately said that he would draw ten artworks. They were ecstatic and couldn’t wait for it.</p><br/><p>Lin Fan pushed Elder Zheng aside, “When do you need it by?”</p><br/><p>“In a month’s time. But we have to get them fifteen days earlier from you to send them to the gallery. Do you have enough time?” Elder Zheng asked.</p><br/><p>“Fifteen days?” Lin Fan hesitated for a moment. Then, he nodded, “Yeah, there’s enough time. Don’t worry.”</p><br/><p>“Slow and steady.”</p></div>\n</div>"}