{"title": "Chapter 680 - Best Way to Draw Their Hatred", "id": 680, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-680-best-way-to-draw-their-hatred", "volume_title": "Volume 7", "body": "<h1>Chapter 680 - Best Way to Draw Their Hatred</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 680: Best Way to Draw Their Hatred</h3><br/><p>The reason they were here was to settle some affairs. As far as this Wu Ya Ting goes, she was just incidentally here as well.</p><br/><p>But regardless, this was Wu Yun Gang’s niece, so she was also someone he knew. Thus, he definitely could not let anything happen to her.</p><br/><p>He felt like he had a better understanding of the situation now. If he had not appeared today, Wu Ya Ting definitely would have been taken away.</p><br/><p>From what he saw in past, this Wu Ya Ting was going to die. Maybe she would live one or two days. But, once she dies, Wu Yun Gang would definitely want them to pay with their lives. However, the man who was going to kill Wu Ya Ting had a very deep background and Wu Yun Gang would not be able to take him on himself. He would have to implicate Wang Ming Yang. All of this would only lead to one outcome. Wang Ming Yang, who was loyal to Wu Yun Gang, would join in to attack this man and it goes without saying that they would be utterly destroyed.</p><br/><p>Of course, this would only be the outcome if nothing changed. Now that he had appeared, the script had to change.</p><br/><p>RIght now, Lin Fan was only thinking of one thing and that was how he would draw out this hatred.</p><br/><p>Su Fang naturally did not let her guard down just because this man said he was related to Wu Ya Ting. She had seen Ya Ting’s uncle before and it was not the young man standing in front of her.</p><br/><p>Lin Fan sensed the alarm in Su Fang’s eyes. He smiled and said, “I am her uncle, Wu Yun Gang’s friend. I just met him this afternoon.”</p><br/><p>Wu Ya Ting was still in a daze. She slowly opened her eyes and said, “Uncle Lin, what are you doing here?”</p><br/><p>After saying this, she fainted. Then, Su Fang momentarily relaxed. She had never thought that this young man was actually Ya Ting’s uncle. Although she did not really understand what was going on, she felt like she was safe now.</p><br/><p>“Uncle Lin, they got Ya Ting drunk. They were thinking of…” She did not finish her sentence before Lin Fan cut her off and said, “Yeah, I know. Just leave the situation here to me.”</p><br/><p>…</p><br/><p>Chang Hai Ge and Shen Ming were pushing around and arguing with them with no fear at all. Although the opposite party had four men opposing them, the two of them had been involved in such matters for years. How could they be afraid of these b*stards?</p><br/><p>“What are you guys trying to do? Playing around with girls and then getting them drunk? You guys should be ashamed. Let me tell you, if you’re smart, you’d leave now. If not, whether you believe it or not, I can make one phone call and get a 180 of my brothers here and get you guys to kneel right here,” Chang Hai Ge aggressively said.</p><br/><p>Master Lin was behind him, so he could not be terrified. If talk did not work, he would get into action.</p><br/><p>Wang Hao furrowed his brows. He had never thought that the situation would turn out like this. It was really unexpected. The two men in front him had so much confidence in their tone and attitude. They were definitely not like any normal person.</p><br/><p>He was not like one of those sons of big clans who had strong backing. He could only open a nightclub and only knew a few people who were supporting him. From knowing them, he increased his own backing.</p><br/><p>Wang Hao did not know what to say and just said, “Who are you people?”</p><br/><p>“I am not someone you can afford to mess with,” Chang Hai Ge raised his head and said with a dominant tone. It was the tone of a rich and arrogant man.</p><br/><p>Although he did not know where these 4 people were from, he could not lose to them in terms of how imposing he was. He had to leave his opposition shaking.</p><br/><p>He had to let them know that the man standing in front of them was a big shot in Beijing.</p><br/><p>“Get out of the way,” Liang Hong Tian said unhappily. Just as he had been about to get his hands on this delicacy, his moment was ruined by others. He definitely could not stand it anymore.</p><br/><p>Wang Hong nodded. He respectfully stood aside and let Brother Liang settle this. Brother Liang did not even need him to do anything.</p><br/><p>Liang Hong Tian looked at these two men. Since the lighting was not too good, he could not clearly see who they were. He felt like he had seen these two before but he could not figure out when he had seen them.</p><br/><p>But to him, if he could not figure out who they were, they were just trash.</p><br/><p>“I am Liang Hong TIan, who are you guys?”</p><br/><p>When Liang Hong Tian introduced himself, Chang Hai Ge and Shen Ming were stunned. It was as if they were scared.</p><br/><p>Especially Chang Hai Ge, who said in surprise, “Liang Hong Tian from the Liang family?”</p><br/><p>After saying that, Chang Hai Ge was filled with regret. He had lost his imposing appearance. If this man was really from the Liang family, this really bad. This was someone that he and Shen Ming could not afford to mess with.</p><br/><p>Liang Hong Tian sneered. The corners of his mouth raised as he playfully looked at the two of them and said, “Oh! I didn’t think that you guys knew about the Liang Family. From what I know, there is only one Liang Hong Tian here in Beijing, am I right?”</p><br/><p>When he said this sentence, Chang Hai Ge and Shen Ming’s expressions changed.</p><br/><p>The Liang family had always been extraordinary here in Beijing. They had previously had three influential people in the family and they were very powerful. Also, this Liang Hong Tian was the direct descendant of the Liang Family. Although they did not know the details, they knew the Liang Family was a very big clan.</p><br/><p>Most people with authority only came from families of three. Their families could not be considered as big clans.</p><br/><p>However, this Liang Family was like no other. The previous generation had given birth to a lot of children. Furthermore, every single one of them became a big shot. As the family continued to develop, it became a lot bigger in size. As a result, there were people from the Liang family everywhere. Thus, their influence and power were huge.</p><br/><p>This was someone they could not provoke. Although they were old-timers, they could not overcome this Liang family.</p><br/><p>Chang Hai Ge was momentarily silent. Shen Ming quietly went to Master Lin’s side and whispered, “Master Lin, there’s a small problem. Beijing’s Liang family is not one to be messed with. Why don’t we give Young Master Zou a call? Only he can help us. Brother Chang and I have our hands tied.”</p><br/><p>Lin Fan naturally knew that the opposition had a very powerful background. If not, the opposition would not have beaten down Wu Yun Gang and Wang Ming Yan in his vision. However, since it was like this, all the more he could not let this chance go.</p><br/><p>He had to completely suppress the enemy.</p><br/><p>He may not have been good at other things but drawing hatred was like a walk in the park for him.</p><br/><p>If it was in the past, Chang Hai Ge would have been completely scared and immediately become like a child, but he could not do that today.</p><br/><p>Master Lin had called for his support. He could not be terrified. So what if it was the Liang family? He was a man of great loyalty, so he could not lose face here.</p><br/><p>“So it is Young Liang. This fellow Master Lin is good friends with Young Master Zou, so I hope that Young Liang will give us some face and let her go,” Chang Hai Ge’s tone was a lot weaker now. Going against Liang Hong Tian, he did not even have the right to tie his shoe. However, he hoped that bringing out Young Master Zou’s name would have some use.</p><br/><p>“Oh. I was wondering why you look so familiar. Turns out you are one of Zou Tian Fu’s followers. Just now was awesome. I, Liang Hong Tian, have been roaming around Beijing for so long and have never had anyone challenge me at all. However, I’ll have to give you guys face today. Also, I wasn’t going to do anything, I was only going to send her home. What other things could I do?” Liang Hong Tian laughed and said. But when his gaze shifted to Lin Fan, it was gleaming with playfulness.</p><br/><p>“Yes, Yes. We know all about you, Young Liang. Then I’ll have to thank you, Young Liang, for giving us face,” Chang Hai Ge let out a sigh of relief. At least the situation was resolved.</p><br/><p>However, before Chang Hai Ge had time to react, he was fiercely slapped in the face by Liang Hong Tian. He was momentarily stunned. A fire started to burn inside him but he had to control himself.</p><br/><p>Liang Hong Tian gently patted Chang Hai Ge’s face and said, “I gave you this slap to tell you that you should not be too arrogant in Beijing. If I really wanted to hit you, even Zou Tian Fu wouldn’t be able to protect you, understood?”</p><br/><p>“Young Liang, I understand,” Chang Hai Ge gave a very awkward smile. His strength was not at the same level as this man’s and that slap had let him recognize that.</p><br/><p>When Shen Ming saw Brother Chang getting slapped, he was raging inside. However, the opposition was from the Liang family so he could only bottle his rage.</p><br/><p>Liang Hong Tian looked around and said, “Let’s go. This is boring…”</p><br/><p>Chang Hai Ge sighed in relief. It was finally over. Although he got a slap on the face and lost a bit of face in front of Master Lin, it was all worth it. However, this feeling did not last long as he got a surprise from Master Lin.</p><br/><p>At that moment, Lin Fan finally thought of the best way to draw their hatred. It was simple, direct and violent.</p><br/><p>“Hold on…”</p><br/>\n</div>"}