{"title": "Chapter 699 - That Person Is Me", "id": 699, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-699-that-person-is-me", "volume_title": "Volume 7", "body": "<h1>Chapter 699 - That Person Is Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>On other websites.</p><br/><p>“D*mn, is that true? Could this news be fake?”</p><br/><p>“How could it be fake? There are pictures. What else does she have to say?”</p><br/><p>“Wu Huan Yue is my favorite singer. She looks so pure and innocent and she is my female idol. I didn’t expect this to happen at all. Furthermore, it was with a man and another woman. That’s disgusting.”</p><br/><p>“I couldn’t tell. You can never judge a book by its cover. She looks so innocent but she’s actually so dirty-minded.”</p><br/><p>“Who is this man? He must have had a good time. I wonder what happened yesterday night.”</p><br/><p>“Don’t say it anymore. My heart hurts. I am going to delete all her songs. I feel disgusted listening to her voice.”</p><br/><p>“F*ck your mum, Wu Huan Yue. Don’t you feel sorry for Master Lin? Master Lin wrote so many songs for you and you did this to him. F*ck your mum! Brothers, let’s go. Let’s flame her on her Weibo.”</p><br/><p>“I’m heartbroken for Master Lin.”</p><br/><p>“Me too.”</p><br/><p>“The industry is indeed one that stains even the purest of people. Look at these women, I wonder how many people have taken advantage of them.”</p><br/><p>…</p><br/><p>Wu Huan Yue’s group of backup fans.</p><br/><p>“Brothers, I’m leaving. I’m not going to be a fan of Yue Yue. It’s not worth it.”</p><br/><p>“Me too, it’s disgusting.”</p><br/><p>“I didn’t know she’s like that. I regret being her fan.”</p><br/><p>Her agent quickly replied, “Don’t leave. This may not be true. Everyone, don’t be affected by it.”</p><br/><p>No matter how hard she tried to explain the situation, it was useless.</p><br/><p>“How could this be? There are pictures as evidence.”</p><br/><p>“Yeah, I am a fan of Master Lin and Wu Huan Yue. How could she do this to Master Lin? Master Lin wrote so many songs for her and she went to have a threesome with another woman and man.”</p><br/><p>“It’s disgusting. We have to stop her.”</p><br/><p>A lot of people started to leave the group.</p><br/><p>…</p><br/><p>Gradually, hundreds of people left the group that had two thousand people at first. The others also started to leave the group. Those that remained in the group were probably not awake yet. They probably still didn’t know what had happened.</p><br/><p>…</p><br/><p>Shanghai Eastern Han Group.</p><br/><p>Wang Ming Yang looked at the news on the Internet and was stunned. He didn’t expect it to happen at all. Then, he looked at the picture of Wu Huan Yue and sighed.</p><br/><p>If it was another celebrity, he would have started to scold him or her. However, he couldn’t possibly scold Wu Huan Yue. Furthermore, he knew who the man in the picture was. It was definitely his brother.</p><br/><p>He was speechless. Bro, why were you having a threesome? You should’ve said it. I could’ve arranged a good location for you. How could you bring two women into your house? This is infuriating.</p><br/><p>Huan Yue hadn’t expected this to happen. She wasn’t heartbroken because her career had just been ruined. It was because the matter wasn’t like what the Internet had reported.</p><br/><p>She couldn’t tolerate the hateful messages of the public.</p><br/><p>“That’s not what happened,” Wu Huan Yue said in a grievance.</p><br/><p>Wang Ming Yang consoled her, “Hey, I know that’s not what happened. However, that’s the Internet for you. We can’t stop the others from saying what they want. Even if we say it, who would believe us? Nobody would believe us. I’ll think of a way to resolve this. I’m afraid we can’t just publish an official message to improve public relations this time. It would be insufficient.”</p><br/><p>If a celebrity did it with his or her spouse, it wouldn’t be that bad. After all, the celebrity could still get married to him or her.</p><br/><p>However, the current situation wasn’t like that. It was a threesome. To a celebrity, that was suicidal.</p><br/><p>Furthermore, what made the situation worse was that other celebrities started to raise awareness, Especially Ying Jin, which made things even worse.</p><br/><p>Wang Ming Yang massaged his head as he was having a bad headache.</p><br/><p>Wu Huan Yue lowered her head, “How about I withdraw from the industry?”</p><br/><p>Wang Ming Yang waved his hand, “Don’t be anxious. Let me think about this. It’s because you rose to fame too quickly and people are jealous. Now that something like this has happened, a lot of people are trying to bring you down with it. Don’t think too much about it. Just ignore the messages online. As a strong celebrity, you have to be able to tolerate these things.”</p><br/><p>Wu Huan Yue nodded but she was feeling really uncomfortable. She looked at some of the posts on Weibo. There were all sorts of hateful messages. It wasn’t something that she could tolerate easily.</p><br/><p>“Right, how are your backup fans?” Wang Ming Yang asked.</p><br/><p>Wu Huan Yue said sadly, “Most of them have left.”</p><br/><p>“If that’s the case…” Wang Ming Yang thought for a moment before picking up his phone. “How’s the public relations group? Have they thought of something yet?”</p><br/><p>…</p><br/><p>Dai Jun Ming, as the king of the paparazzi, started to laugh. He had become famous again.</p><br/><p>Then, a lot of people started to post on Weibo.</p><br/><p>“Do you have uncensored pictures so that we can see who the other two people are?”</p><br/><p>“Yeah, we’re all waiting for it.”</p><br/><p>“Did you capture any other shots? Like their positions in bed?”</p><br/><p>“Wu Huan Yue is so pretty and has such a good figure. It was definitely intense.”</p><br/><p>“^ I’m hard from reading that.”</p><br/><p>Dai Jun Ming laughed before posting something.</p><br/><p>“I’ll post the uncensored picture tonight at 12 am.”</p><br/><p>Many people were stunned by the shocking news.</p><br/><p>Cloud Street.</p><br/><p>Lin Fan arrived at his shop and realized that Wu You Lan looked rather pale.</p><br/><p>“You Lan, what’s wrong? Why do you look so frail and haggard? Did something happen?” Lin Fan didn’t know what had happened online. He hadn’t read the news before coming to the shop.</p><br/><p>Wu You Lan said worriedly, “Brother Lin, Huan Yue is in trouble. We stayed over at your place the night before yesterday. People took pictures of us and posted them online. The entire internet is scolding Huan Yue now.”</p><br/><p>“Huh?” Lin Fan was stunned. He was in disbelief, “What’s happening?”</p><br/><p>Then, he took out his phone and opened Weibo. Wu Huan Yue’s news was the top one on the trending list.</p><br/><p>However, what was the fourth one on the list about?</p><br/><p>‘Did Master Lin get cuckolded?’</p><br/><p>F*ck you mum, I don’t even have a girlfriend. How could I be cuckolded?</p><br/><p>He looked at the other top searches.</p><br/><p>‘Ying Jin suggested banishing Wu Huan Yue from the music industry.’</p><br/><p>Then, Lin Fan didn’t understand what was happening. What did this matter have to do with Ying Jin?</p><br/><p>He wasn’t in a rush as he opened these trending searches. He looked at the messages on his Weibo and was furious. What were these people doing? The messages were ridiculous.</p><br/><p>‘Let’s have a moment of silence for Master Lin.”</p><br/><p>“Master Lin, don’t cry.”</p><br/><p>“This type of woman isn’t worth it.”</p><br/><p>“The ‘green cuckolding hat’ descended from the Heavens. You can’t hide from it.”</p><br/><p>“Everyone, let’s flame Wu Huan Yue on her Weibo to seek justice for Master Lin.”</p><br/><p>“I realized that Master Lin has been feeling low lately. He hasn’t been posting a lot on Weibo. I was afraid that something like this might have happened. He must be hiding this because of Wu Huan Yue’s career. It has to be like this.”</p><br/><p>“Master Lin is such a good man. We’re all heartbroken for him.”</p><br/><p>“D*mn, we have to avenge Master Lin.”</p><br/><p>…</p><br/><p>After reading some of the posts, Lin Fan was dumbfounded. What were they talking about?</p><br/><p>Then, he opened some of the top searches.</p><br/><p>What threesome?</p><br/><p>Who censored the pictures? Wasn’t the man in the picture him?</p><br/><p>The situation was abnormal. Why did they censor the picture? Didn’t that create a false alarm?</p><br/><p>Then, Lin Fan was prepared to make things clear although he didn’t know why the person censored his face. Perhaps it was to protect him. However, as Justice Fan, he had to do something about this. He couldn’t just let people on the Internet scold a lady.</p><br/><p>“The man in the picture is me. We only shared an apartment as friends. We’re all pure. Do not think of it that way.”</p><br/><p>When the post was published, the Internet went crazy again.</p></div>\n</div>"}