{"title": "Chapter 693 - Get Out, I’m Not Going To Paint", "id": 693, "volume": 7, "url": "http://boxnovel.org/a-valiant-life-chapter-693-get-out-i%E2%80%99m-not-going-to-paint", "volume_title": "Volume 7", "body": "<h1>Chapter 693 - Get Out, I’m Not Going To Paint</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the afternoon.</p><br/><p>Wu You Lan and Wu Huan Yue gathered beside Lin Fan and discussed interesting things.</p><br/><p>Zhao Zhong Yang sneakily went beside Fraud Tian, “Fraud, I’m just wondering if you feel the same way. Do you think the shop feels a little weird today? It has an evil vibe.”</p><br/><p>Fraud Tian looked, “Are you stupid? Can’t you tell?”</p><br/><p>Zhao Zhong Yang looked at the two girls in front and nodded, “I understand now. That’s probably why.” Then, he said enviously, “Sigh, I’m still single while Brother Lin has two girls that are interested in him. That’s so infuriating.”</p><br/><p>Fraud Tian replied, “Haha, don’t be envious. My Ba Gua Zhang skills are absolutely incredible but I’m still single even until today. Don’t be in such a rush. We’ll support each other in the future and we’ll be good.”</p><br/><p>“Ew! Who would want to support you? I’d rather leave my home.” Zhao Zhong Yang looked at Fraud Tian’s eyes which seemed to be harboring some evil thoughts. He knew that Fraud Tian was thinking of living a bachelor’s life.</p><br/><p>…</p><br/><p>“May I know if Master Lin is here?” Then, two guests came to the shop.</p><br/><p>Fraud Tian replied, “Yes, may I know who you are?”</p><br/><p>“Oh, we’re from Jiangning. We would like to meet Master Lin,” one of the guys said. Then, the other middle-aged man didn’t say anything. It was obvious that this man was the boss of the other man that spoke.</p><br/><p>Fraud Tian said, “Someone’s looking for you.”</p><br/><p>Lin Fan raised his head, “I am Master Lin. Why are you looking for me?”</p><br/><p>Then, the middle-aged man that didn’t speak looked in awe. He smiled and went forward, “Hi, Master Lin, I am from Jiangning. This is my name card. This time, I am here to request for an artwork from you. Of course, I will satisfy your asking price.”</p><br/><p>Lin Fan took the name card and looked at it.</p><br/><p>“Jiangning Long Teng Estate Development Corporation, Director, Li Jian Ming.”</p><br/><p>Li Jian Ming smiled, “Yeah, that is me.”</p><br/><p>Ever since Master Lin’s artworks got collected by the nation’s museum, his reputation soared. The average citizens were just stunned and awed by it. However, to some of the wealthy men, they hoped to get an artwork from him to hang in their offices to gain some face.</p><br/><p>Furthermore, in order to get an artwork from a great master, one just had to offer money. With money, how could anyone resist it? Especially since he knew that Master Lin was a youngster, he was even more confident of getting an artwork from him. After all, which youngster didn’t like money?</p><br/><p>Then, Lin Fan returned the name card to him, “I’m not going to draw. Go back home.”</p><br/><p>Li Jian Ming was stunned. He hasn’t expected that at all. “I came here from Jiangning. Are you going to reject me just like that?”</p><br/><p>Lin Fan raised his hand, “What else do you want then?”</p><br/><p>Li Jian Ming hadn’t expected to be rejected so directly. “Offer me any price. With the current market prices, your artworks are worth $30 million. I don’t want such big artworks. I just want a painting of Mount Tai.”</p><br/><p>Lin Fan immediately waved his hand. He didn’t want to draw at all. He knew that a lot of people would be here to request for his artworks. However, he hadn’t expected someone to come so quickly.</p><br/><p>“I’m not selling any artworks now. Fraud, please send them out.”</p><br/><p>Fraud Tian went before the two of them, “Leave, please. If you’d like to buy scallion pancakes, you can come back tomorrow. If you’d like to get your fortunes read, you can get it done now. We’re not selling any artworks.”</p><br/><p>In the end, the two of them left.</p><br/><p>Lin Fan smiled helplessly, “Look, things can happen so quickly.”</p><br/><p>Fraud Tian was stunned, “Bro, they offered $30 million. One artwork and you’d get $30 million!”</p><br/><p>“Haha, there are wealthy men everywhere. If I am to draw for just anyone that asks, I’d just be a low-cost worker,” Lin Fan said.</p><br/><p>Then, Fraud Tian understood it. “I see. I understand now. You want to make it rarer now so that when the prices increase in the future, you can make a huge sum next time.”</p><br/><p>Lin Fan looked at Fraud Tian and felt that he thought too much about it. The only reason he didn’t want to draw was that he was lazy.</p><br/><p>At 6 pm.</p><br/><p>“Time to close the shop!” Lin Fan stretched himself and moved his neck. Although he hadn’t done anything much in the afternoon, he was exhausted. He admired himself for being able to sit still for so long.</p><br/><p>Wu Huan Yue said, “Brother Lin, can we go to your place to cook some food?”</p><br/><p>Lin Fan replied, “My house isn’t that big.”</p><br/><p>Wu Huan Yue smiled, “If it’s not that big, it would be more homely and cozy. Don’t you guys think so?”</p><br/><p>Fraud Tian nodded, “Yeah, that’s right.”</p><br/><p>Zhao Zhong Yang was praying for that to happen. He had been craving for Brother Lin’s food for a long time.</p><br/><p>Wu Tian He smiled, “I haven’t eaten Master Lin’s food for some time already. Now that Wu Huan Yue is back, I am in luck!”</p><br/><p>They were seriously impressed with Lin Fan’s culinary skills. Those that ate his food before would definitely say that they were the best on earth.</p><br/><p>Obviously, Lin Fan could tell what they were thinking about. “Alright then, I’ll let you guys taste my culinary skills today. Huan Yue and You Lan can go and purchase the groceries.”</p><br/><p>Wu Huan Yue was stunned, “Brother Lin, what about all of you?”</p><br/><p>Lin Fan smiled, “We’ll definitely be waiting at home for all of you. You are the only two girls here. I can’t ask the elderly men here to go instead.”</p><br/><p>“Alright then,” Wu Huan Yue said helplessly. They were just lazy.</p><br/><p>“Let’s go!” Lin Fan waved his hand and everyone boarded the car. They went towards his house.</p><br/><p>At 7:30 pm.</p><br/><p>Lin Fan was busy cooking in the kitchen.</p><br/><p>Everyone was sitting outside, watching the television and he was the only one cooking.</p><br/><p>The Encyclopedia’s knowledge wasn’t a joke. The dishes that he prepared were incredibly delicious. Not a single person would be able to take their eyes off the dishes.</p><br/><p>“The dishes are ready, we can eat now.”</p><br/><p>Wu Huan Yue smelled the aroma and couldn’t wait to start eating, “Brother Lin, I wish I could eat these dishes for the rest of my life.”</p><br/><p>Wu You Lan looked at Wu Huan Yue and thought to herself, “How could she say it so directly? That’s disgusting.”</p><br/><p>Lin Fan immediately rejected her, “That’s not possible. You don’t know how difficult it is to cook. I am still waiting for all of you to cook for me in the future.”</p><br/><p>Suddenly, Wu Huan Yue smiled, “Alright, alright. I’ll cook for Brother Lin next time.”</p><br/><p>Lin Fan smiled, “Let’s eat!”</p><br/><p>If it had been anyone else who cooked, they would definitely be chatting at the table. However, Lin Fan had made the dishes and everyone couldn’t stop after eating their first bite.</p><br/><p>They were quietly eating and drinking and their chopsticks didn’t stop moving at all.</p><br/><p>At 10 pm.</p><br/><p>Everything was over.</p><br/><p>Fraud Tian and the others were prepared to leave.</p><br/><p>However, Wu Huan Yue and Wu You Lan weren’t prepared to leave yet.</p><br/><p>“Dad, you can go back first. We’ll be here to help Brother Lin clean up.”</p><br/><p>Wu Huan Yue was definitely going to stay behind to help out too.</p><br/><p>Fraud Tian said in awe, “Wow, I’m envious. Forget it, let’s not stay here. Elder Wu, what are you looking at? Your daughter just asked us to leave.”</p><br/><p>Zhao Zhong Yang didn’t think too much about it. The meal was simply too delicious.</p><br/><p>However, after sending them off.</p><br/><p>Wu You Lan and Wu Huan Yue started to clean up and keep the table and chairs. Meanwhile, Lin Fan sat on the sofa to rest.</p><br/><p>It had been a pretty exhausting day.</p></div>\n</div>"}