{"title": "Chapter 702 - Adoption Time", "id": 702, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-702-adoption-time", "volume_title": "Volume 8", "body": "<h1>Chapter 702 - Adoption Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“I’m digging, I’m digging…” Lil’ Fatty sang as he brandished the plastic spade in his hands. He dug a huge hole at his feet, and he was beyond enthusiastic. That moment, he ran to Lin Fan’s side, tugging his hands. “Uncle Lin, quickly take a look! How does this hole look?”</p><br/><p>Lin Fan chuckled- this Lil’ Fatty was lively with so much youthful energy. He turned to look at the hole, he was taken aback. “Lil’ Fatty, are you trying to plant a tree?”</p><br/><p>“Ah, I watched a TV program, and they all showed that a deep hole needed to be dug.”</p><br/><p>Lin Fan patted Lil’ Fatty on the head. “We aren’t trying to plant any trees now. We are just planting flowers. The hole doesn’t need to be this deep, but you did very well! Now that your tasks are over, you can help your other friends.”</p><br/><p>Lil’ Fatty’s face lit up after hearing Uncle Lin’s praise. “Eh, I’ll go and help them now!”</p><br/><p>Without any hesitation, Lil’ Fatty raced off to a girl’s side. “Come, let me help you. I have so much strength! Uncle Lin just praised me just now!”</p><br/><p>“Eh, Brother Fatty is so good!”</p><br/><p>“That’s for sure! You are my favorite person!”</p><br/><p>Lin Fan sighed. Once Lil’ Fatty grew up, he would have his own set of problems. However, what was important was that he grew up to be mature with a good heart.</p><br/><p>The flowers were still young sprouts and needed careful attention and care. The children loved working hands-on the most, and there were a total of 365 of them, one for each child. Lin Fan had to carefully explain every single detail to the children to get them to do this task properly.</p><br/><p>As long as ten of the children understood what he was saying, his work was done.</p><br/><p>The same day, Shanghai High-Speed Rail Station.</p><br/><p>A middle-aged couple arrived in Shanghai.</p><br/><p>“Hubby, your brother’s kids are in Shanghai?” Qiu Yan Lan asked.</p><br/><p>The middle-aged man nodded his head, his face looking pained as if he had a serious illness. “Yep, in Shanghai’s Nanshan Children’s Welfare Institute. Didn’t the police tell us that when we went to inquire?”</p><br/><p>The policeman had told them a few days back that the middle-aged man’s brother had been rescued from the child traffickers. Since his brother had passed away from a car accident a few years back, and his wife had remarried and refused to pick the child up, the police had approached the couple to ask if they were interested to adopt the child.</p><br/><p>Why in their right minds would they agree to that request? They were getting by in life and to adopt a kid that wasn’t their own? It was a clear decision.</p><br/><p>However, the fortunes were as unpredictable as the weather. The middle-aged had gone for a health checkup and found out that he had early-stage leukemia, and desperately needed a bone marrow transplant.</p><br/><p>Unfortunately for him, there wasn’t a single person who had genetic compatibility with him. Amongst his relatives, the person with the closest match to his was his brother who had passed away, and so that option was taken away from him.</p><br/><p>After waiting for a bone marrow donor for more than a month without news, he started getting a little worried.</p><br/><p>Suddenly, he remembered that his brother had an orphaned child in the orphanage, and after discussing it with his wife, he decided to adopt him and thereafter, take him to the hospital for a bone marrow compatibility check.</p><br/><p>Qiu Yan Lan looked worried. “Do you think that the other people would agree with this move? If they knew that we decided to do this for your health, this…”</p><br/><p>The middle-aged man looked at his wife. “If you don’t say anything, and I don’t say anything, who would find out? Furthermore, I’m his uncle and there wouldn’t be a problem if I were to take his father’s place and adopt him. We are doing the orphanage a favor- one less child off their hands is one less mouth to feed!”</p><br/><p>“That’s true,” Qiu Yan Lan nodded her head. “What’s the most important is to get you cured.”</p><br/><p>Wang Cheng Shan nodded back. “Let us first go to the police station and let the officers there bring us to the orphanage. We cannot delay this any longer. We need to check this earlier so that I won’t worry so much.”</p><br/><p>The couple walked out of the High-Speed Rail Station and made their way directly to the police station.</p><br/><p>…</p><br/><p>Nanshan Children’s Welfare Institute.</p><br/><p>“Brother Fatty, could you help me? I can’t seem to be able to dig this hole,” a boy a little smaller than Lil’ Fatty gestured to him, tugging his sleeves.</p><br/><p>Lil’ Fatty looked at the boy, looking a little unwilling. Thereafter, he said, his face full of gusto, “You are a man, and men don’t back down from a little hard work. Keep on trying!”</p><br/><p>The little boy heaved a sigh, his face looking tired. Thereafter, he went back to where he was originally digging the hole, continuing to do what he was doing.</p><br/><p>At this moment, a girl with braided hair came up to Lil’ Fatty, “Brother Fatty, I also can’t seem to dig this hole.”</p><br/><p>Lil Fatty’s reaction was completely different now. He beat his breast, “No problem, come let me help you.”</p><br/><p>Without any hesitation, Lil’ Fatty picked up his shovel and started going at the soil, diligently digging up the soil.</p><br/><p>And at this moment, Lil’ Fatty’s unfairness towards guys and girls could be seen so clearly.</p><br/><p>Lin Fan didn’t say anything as he saw what had happened, but he realized that Lil’ Fatty had to tone down a lot when he grew up, otherwise it would reflect badly on him.</p><br/><p>Director Huang stood there with Han Lu, chuckling to themselves. For Director Huang, her only wish was for the children in the orphanage to feel blessed and loved.</p><br/><p>The children in the orphanage had never experienced the love of their parents and had to be independent from such a young age. And so, the staff at the orphanage had to take up the responsibility to make sure that the children grew up well and were loved.</p><br/><p>Looking at the smiles on the children’s faces, Director Huang’s heart was bursting with joy. Working at the Children’s Welfare Institute was such a blessing for her as she poured out all her energy to run the place. Every time she found out that one of the children grew up to become a useful person in society, her heart would be especially glad.</p><br/><p>She didn’t ask for the children at the orphanage to pay them back. All she asked for was that the children would grow up to be healthy and happy.</p><br/><p>She stood there, looking at Master Lin and Han Lu with confidence. She took comfort in the fact that even if she became invalid, there would still be people who had big hearts to serve in the orphanage.</p><br/><p>All her friends called her stupid, but she didn’t think it was like that. Life was short and although some people found meaning in earning money, she believed that there was a greater meaning in nurturing the next generation of children. Even if the children had grown up and lived the Children’s Welfare Institute but never came back to visit, she wouldn’t hold a grudge against them.</p><br/><p>In the afternoon.</p><br/><p>Lin Fan didn’t go back to his shop but continued to eat with the children in the orphanage. Thereafter, he continued with his work, continuing to plant the flowers.</p><br/><p>He was happy that the children were working hard and that they were showing a kind of enthusiasm that he had never seen before.</p><br/><p>“Director Huang, could I trouble you to open the door?” At this moment, a police officer hollered from the outside.</p><br/><p>Director Huang looked out of the window suspiciously, but she still went to open the door. “Yes, how may I help you?”</p><br/><p>Lin Fan also saw what was going on, but didn’t know what the three of the uninvited guests wanted.</p><br/><p>As the police officer explained the whole situation, Lin Fan paid close attention.</p><br/><p>“Director Huang, this couple is from Qing He and is the older brother of Wang Yang Yang’s father. This is his wife. They had come to the police station and wanted to adopt Wang Yang Yang, and so I brought them over.”</p><br/><p>“You’ve verified their identities?” Director Huang looked at the police officer, thereafter scanning the couple.</p><br/><p>It wasn’t that Director Huang didn’t believe them, but she didn’t wish for the children to be sent back to the thieves’ lair just after being rescued and housed in the orphanage.</p><br/><p>The police officer nodded his head. “Yep, we’ve cross-checked all their identities and there is no problem. Both of them have stable jobs and they are indeed Wang Yang Yang’s relatives.”</p><br/><p>…</p></div>\n</div>"}