{"title": "Chapter 722 - Trouble", "id": 722, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-722-trouble", "volume_title": "Volume 8", "body": "<h1>Chapter 722 - Trouble</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>They went around and visited many different places.</p><br/><p>Black Sands Bay.</p><br/><p>The waves crashed onto the shore, where only a few people were walking about. Yun Xue Tao spread her hands wide, savoring the rush of sea breeze that was blowing against her frame.</p><br/><p>“I haven’t felt this free in a very, very long time,” Yun Xue Tao said, chuckling.</p><br/><p>“Xue Tao, isn’t it easy to find time to relax for what you are currently doing now? ”</p><br/><p>“Brother Lin, you don’t know much about me. The things that I have to deal with in the casino every day is already such a headache- I have to handle everything, no matter small or big. And I can’t afford to be careless about the decisions I make, and occasionally, Grandpa would just tell me what to do and that would lighten my load by a lot,” Yun Xue Tao said, her eyes closed as she continued to take in the sea breeze, which continued to caress her cheeks.</p><br/><p>She raised her legs, tiptoeing. She leaned forward and spread her arms open as if she were hugging the entire world.</p><br/><p>As every second passed, the night grew increasingly darker.</p><br/><p>“Brother Lin, let’s go back. Grandpa is already waiting at home, and it isn’t good to keep him up waiting for me, ” Yun Xue Tao said.</p><br/><p>Lin Fan checked the time- it was indeed getting late.</p><br/><p>“Alright,” Lin Fan said, nodding his head, “I should be leaving Hao Jiang tomorrow for Shanghai.”</p><br/><p>“Won’t you stay awhile longer?” Yun Xue Tao said.</p><br/><p>“I shouldn’t stay too long. I still have things to tend to back in Shanghai,” Lin Fan said.</p><br/><p>“Oh,” Yun Xue Tao didn’t say anything more.</p><br/><p>…</p><br/><p>The little winding street was eerily quiet. Just at that moment, a loud, ear-piercing sound spread through the air.</p><br/><p>A bread van jam braked in front of both of them, blocking the path of the road.</p><br/><p>“Not good. Looks like we’ve been followed,” Yun Xue Tao said, her facial expression changing, looking terrified.</p><br/><p>Lin Fan shook his head, “Not looks like. We have been followed.”</p><br/><p>He never thought that this could happen to him in his visit to Hao Jiang. However, something wasn’t right- who had so much bravery to mess with the little princess of the Yun Family? Did that person have a death wish?</p><br/><p>Although the security in the region was decent, it was still rather lacking in the Yu Long area. Occasionally, gang-related crimes happened around the area and it was uncontrollable.</p><br/><p>Yun Xue Tao reacted quickly and rushed into her car with Lin Fan, wanting to leave quickly. However, the exit of the street was blocked off by another vehicle.</p><br/><p>At that moment, a group of people got out of the two bread trucks which had blocked their paths. The people were holding knives and they marched over intimidatingly.</p><br/><p>For the group of thugs, the people in the car were like turtles in a jar. There was no escape and they could just butcher them anytime.</p><br/><p>Yun Xue Tao had seen her fair share of violence. However, in the face of danger, she still couldn’t help but feel terrified.</p><br/><p>Pa!</p><br/><p>Pa!</p><br/><p>The doors of Yun Xue Tao’s cars were locked. Thereafter, she mustered all her courage, “We must not get out of this car. I’m going to call for help now.”</p><br/><p>In their current situation, there were about forty-five people surrounding them. If they all started swarming them, the consequence would have been unimaginable.</p><br/><p>Although Yun Xue Tao tried her best to put on a strong front, her hands were trembling as she started dialing the numbers into her phone.</p><br/><p>“Miss Yun, what a lovely surprise! What brings such a fine and elegant lady here?” Zhang Yuan walked up over to the car, a cigarette clasped between his teeth, his eyes twinkling with a menacing glare.</p><br/><p>“It’s him,” Yun Xue Tao said, looking shocked. She didn’t believe what she was seeing- that person had been kicked out of Hao Jiang. How could he come back?</p><br/><p>How did he get past the checkpoint?</p><br/><p>Although Yun Xue Tao didn’t talk at all, Zhang Yuan could read her easily. “Miss Yun, you must be wondering how I managed to come back right? I’ll tell you, I swam back here.”</p><br/><p>Thereafter, Zhang Yuan glared at Lin Fan, “You, pale face! Aren’t you the person with the amazing gambling skills? I’ll cut off your hands today.”</p><br/><p>After hearing that, Lin Fan couldn’t help but laugh on the inside.</p><br/><p>He never thought he would face such a muddy situation.</p><br/><p>They were completely outnumbered, and none of those people resembled even in the slightest bit a Saint. They all looked like evil, bloodthirsty hounds.</p><br/><p>Yun Xue Tao took a deep breath, calming herself down. “Brother Lin, don’t worry. This is Hao Jiang. They can’t do anything to you with me protecting you.”</p><br/><p>Lin Fan raised his brow. This was the first time any woman had ever said that they were going to protect him. What a weird feeling.</p><br/><p>Yun Xue Tao’s next move caused Lin Fan to be completely stunned.</p><br/><p>“Brother Lin, stay in the car. I’ll settle this,” Yun Xue Tao said, as she opened the car door and got out. She tried to put on a brave front, but her trembling body gave her away.</p><br/><p>“This is Hao Jiang. What do you guys think you can do? If you want money, just say it,” Yun Xue Tao said.</p><br/><p>Just at this moment, one of the goons shouted out, his face twisted into a smile, “Brother Zhang, I want to f*ck her.”</p><br/><p>Another goon echoed, “Me too. She’s so hot, it’s just too attractive.”</p><br/><p>“Hehe. If all of you guys want to f*ck her, whose child will she bear afterward?”</p><br/><p>“Haha…”</p><br/><p>All the filthy talk caused Yun Xue Tao to seethe with anger as her clenched her jaw. Her breathing became a little more jarred.</p><br/><p>“Miss Yun, did you hear that? All my brothers here want to make love to you. Why don’t you satisfy them? I’ll let you off after that,” Zhang Yuan said, stroking his chin.</p><br/><p>“Don’t be ridiculous,” Yun Xue tao said, her voice booming. If she could, she would have shot everyone dead.</p><br/><p>“Come on! We were only kidding, Miss Yun. You are such a sweet and pretty young lady, how could I bear to let so many people touch you? If anything, I’ll be the one who gets to do it. However, I have a request I have to make right now and I need your help. I wonder if you will accede to my request?” Zhang Yuan asked.</p><br/><p>“What is it?” Yun Xue Tao said, looking annoyed. How was she going to navigate out of this mess? These people were lawless and if she were to wait for the sun to rise, it would have been too late.</p><br/><p>“Very simple. I want to invest in the casino. I have brought all the contracts with me, so now I just want to see if you would give me any face at all.”</p><br/><p>“Keep on dreaming,” Yun Xue Tao hissed.</p><br/><p>Zhang Yuan laughed coldly. “Then you can’t blame me for what happens next. My brothers here haven’t touched a female in a very long time. If they do anything to you, don’t blame me for what happens. And this little pale face guy, he’ll be tossed into the trash. What a shame if that happens.”</p><br/><p>At this moment, Lin Fan had heard enough. He got out of the car immediately.</p><br/><p>“Brother Lin, get back into the car. I’ll deal with this situation myself.” Thereafter, she glared at Zhang Yuan, “Alright, I’ll agree to your request, but you have to let us out safely.”</p><br/><p>Her plan was just to satisfy the other party’s request temporarily. Once she got back to her home, she was going to make those thugs pay. Investing in the Yun Family casino? Not a chance.</p><br/><p>“Alright! A wise man submits to circumstances, and you are indeed the Miss Yun which I have heard so much about. Of course, to prevent you from going back on your word, I have to have some form of insurance. You will come into my car and we can have a little fun. Of course, I’ll take a few sexy photos of you, and if you ever go back on your word, I will spread all that to the world.”</p><br/><p>“You…” Yun Xue Tao was about to complete her sentence when Lin Fan cut her off.</p><br/><p>“You think that just because you have some of your goons here that you can get anything you want from us? You are greatly mistaken,” Lin fan said, standing in front of Yun Xue Tao.</p><br/><p>“Kill that b*stard,” Zhang Yuan commanded, after hearing what Lin Fan said.</p><br/><p>“Stop… ”</p><br/><p>Yun Xue Tao panicked in that instant. However, the thugs rushed forward as they brandished their knives, not bothering about what she said.</p></div>\n</div>"}