{"title": "Chapter 739 - You Regret It Now, Don’t You?", "id": 739, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-739-you-regret-it-now-don%E2%80%99t-you", "volume_title": "Volume 8", "body": "<h1>Chapter 739 - You Regret It Now, Don’t You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What’s wrong?” Wu You Lan asked with a curious tone.</p><br/><p>Lin Fan replied, “There was an idiot who just asked me to buy that evidence for ten million. Unless my brain has been broken, I would never agree to that.”</p><br/><p>Fraud Tian came over, “Wow. It’s so shady?”</p><br/><p>Lin Fan felt helpless. “Isn’t that just nonsense? If he had offered it for one thousand, I would have considered it.”</p><br/><p>Thinking about it now, perhaps that guy was the champion of that competition, Yang Jie. Besides him, who would have evidence?</p><br/><p>But how did that guy manage to find him?</p><br/><p>That guy should have gone to look for Ying Jin. she was a wealthy person. For the evidence, she would definitely be willing to pay a large price. But judging by the looks of things, their negotiations must have broken down.</p><br/><p>This evidence, to Lin Fan, was something that he could do without. Whether he had the evidence or not, he would still infuriate Ying Jin.</p><br/><p>Afterward, he didn’t think of much more. He gave a call to Wang Ming Yang.</p><br/><p>“Ming Yang, I’ve picked a good young talent for you.”</p><br/><p>“Male or female?”</p><br/><p>“Male. Chen Rui An. He’s quite capable and he will be popular in future.”</p><br/><p>“Huh? A male?”</p><br/><p>“What’s wrong with a male?”</p><br/><p>“No, nothing. I trust you. Whatever you choose, I’ll take it. Oh right, you are really amazing. Because of you, ‘Strongest Heavenly Voice’ has exploded in popularity.”</p><br/><p>Lin Fan chuckled, “It’s just alright. It wasn’t all thanks to me.”</p><br/><p>Although he said this, anyone with eyes would have been able to tell that the popularity of ‘Strongest Heavenly Voice” had everything to do with him.</p><br/><p>Night time.</p><br/><p>“It’s going to start.”</p><br/><p>“Yeah, I’ve been waiting for a long time. The previous two episodes were really too good. I just love watching Master Lin piss other people off.”</p><br/><p>“Haha, I’m dying of laughter. That woman, Ying Jin, is not even doing anything but she’s just being shot.”</p><br/><p>“What do you mean by that? She’s not a good person. Master Lin is overly-righteous and he would absolutely not let go of such an evil person.”</p><br/><p>“I have a feeling that this Chen Rui An will become very popular. And he’ll cling to Master Lin’s big legs.”</p><br/><p>At the scene of the show.</p><br/><p>Hao Jian Yang patted Lin Fan on the shoulder. “Teacher Lin, you have to do your best tonight. You’ve only got one student as of now. Look at them. They have quite a few students already.”</p><br/><p>Lin Fan smiled, “No problem. I’m not here to win first place. I just hope to find a few good, young talents.”</p><br/><p>At this moment, Zhao Li and Liu Ying Dong arrived. When they saw Lin Fan, they couldn’t help but glare at him.</p><br/><p>Things had exceeded their expectations. Sister Ying had been dragged into this and she had been accused by him.</p><br/><p>You would know this just by looking at the Weibo comments.</p><br/><p>Although Sister Ying was a big shot in the musical world, she still couldn’t afford such accusations.</p><br/><p>In the past, Sister Ying had been scolded so many times but she always managed to find an excuse to get by. But now, it was different. With this kid here, stirring sh*t, the situation had changed.</p><br/><p>Lin Fan spontaneously greeted them, “Teacher Zhao, why don’t you give a greeting when you see me? No matter what, we’re still fellow mentors.”</p><br/><p>Zhao Li glared at him. “Hmph. Working with you is a humiliation.”</p><br/><p>Lin Fan shrugged helplessly. Meanwhile, Huo Jian Yang shook his head. He had participated in so many variety shows and it was not that he had never seen a conflict between mentors before. However, this conflict had blown up so much and it was a first for him.</p><br/><p>8 pm.</p><br/><p>The show started.</p><br/><p>The host went on stage and delivered the opening speech.</p><br/><p>“Let’s invite the contestant on stage.”</p><br/><p>When Lin Fan joined this show, his initial goal had been to carry out his duties properly. Now, his goal was to find some good, young talents for Wang Ming Yang.</p><br/><p>From the start until now, he had only seen Chen Rui An who was able to become popular. As for the other contestants, although they weren’t bad, they still had a ways to go to reach the standard.</p><br/><p>The first contestant was very cute. And she was a cute little girl.</p><br/><p>When the cute little girl went on stage, her gaze landed on Lin Fan.</p><br/><p>“666…it seems that this little girl has fallen into Master Lin’s grasps. I wonder if Master Lin will accept her.”</p><br/><p>“Of course he will. If he doesn’t, lightning will strike him.”</p><br/><p>“F*ck, look at that. Master Lin looks indifferent. Is he even a man?”</p><br/><p>The song ended.</p><br/><p>The cute little girl saw that Teacher Lin did not flash his light and she looked a little disappointed.</p><br/><p>Instead, all three of the other mentors flashed their lights.</p><br/><p>The host went on stage and said with a smile, “What is your name? When you went on stage just now, you didn’t give an introduction. Were you too nervous?”</p><br/><p>The cute little girl smiled. When those men, who were glued to their computers at home, saw that smile, their hearts melted.</p><br/><p>“No, I just wanted to give my introduction after I finished singing. Hello, everyone. I’m Zhang Chi. I come from Shenzhen and I’m 18 this year. I’m a student.”</p><br/><p>The host said, “Alright. Now that three mentors have shined their light for you, which one are you willing to join?”</p><br/><p>Zhang Chi said, “Can I ask Teacher Lin a question?”</p><br/><p>The host looked at Lin Fan and Lin Fan nodded. “Go ahead.”</p><br/><p>Zhang Chi was a little disappointed. “Teacher Lin, I admire you very much. I’ve heard all the songs that you composed for Wu Huan Yue and I really admire your talent. Which part of my performance just now wasn’t good enough, such that you felt that it wasn’t worth shining your light?”</p><br/><p>The place was filled with ‘D*mn!’s.</p><br/><p>That cute little girl had said it so bluntly but unexpectedly, Teacher Lin still looked indifferent. Was that really alright?</p><br/><p>Lin Fan was taken aback. Then, he gave an answer that caused the crowd to burst out in laughter, “What do you mean by that? I’ve already shone my light.” Then, he got off the chair and looked at it. He cried out in surprise, “D*mn. I pressed it just now. Why didn’t it light up?”</p><br/><p>When Zhang Chi heard Teacher Lin’s reply, a smile appeared on her face. “Teacher Lin, you flashed your light for me?”</p><br/><p>Lin Fan nodded, “Of course. You sing very well and your voice is pretty good. But what’s wrong with this light? Host, is this light spoiled?”</p><br/><p>The host was startled. “It can’t be, can it? Get the staff to take a look, quickly.”</p><br/><p>This was the bad thing about live broadcasts. When something happened during the show, there was no way to salvage the situation.</p><br/><p>“Haha. I knew it. She sang so well, how could Master Lin not flash his light?”</p><br/><p>“Now, Master Lin has two contestants. Moreover, they’re both singers that I like very much.”</p><br/><p>A staff member said, “The connection wasn’t good. It’s fine now.”</p><br/><p>Then, Lin Fan tapped the light button. “Alright, it’s lighted up.”</p><br/><p>The host said, “Dear contestant, have you decided that you will be going to Teacher Lin’s team?”</p><br/><p>Just as Zhang Chi was about to speak, Zhao Li interrupted, “Zhang Chi, I like your voice very much. I wish for you to join my team. I will sign you and nurture you into an outstanding singer. How does that sound?”</p><br/><p>“D*mn. That woman has shown up unexpectedly.”</p><br/><p>“Awesome. She’s trying to snatch someone from Master Lin.”</p><br/><p>Lin Fan had not expected that Zhao Li would give such conditions. Then, he looked at Zhang Chi. He would let her decide for herself.</p><br/><p>However, he was cursing in his heart. That woman, Zhao Li, was f*cking sinister. No wonder she got along so well with Ying Jin.</p><br/><p>He could give similar conditions to the contestant as well but he wanted to see how strong this contestant’s will was.</p><br/><p>If she had already wanted to pick Lin Fan but changed her mind because of benefits, then it would be fine not to take her.</p><br/><p>Zhang Chi had not expected Teacher Zhao to give such conditions. An excited expression appeared on her face. However, she quickly hid that excitement.</p><br/><p>“Teacher Cui, I choose…”</p><br/><p>Everyone held their breaths, wondering how it would turn out.</p><br/><p>“Zhao Li. Teacher Zhao.”</p><br/><p>Uproar!</p><br/><p>No one had expected this cute little girl to change her mind so quickly.</p><br/><p>Some people were unhappy. They felt that this little girl was too snobbish.</p><br/><p>Zhao Li smiled and took a glance at Lin Fan. Her eyes were clearly challenging him.</p><br/><p>Zhang Chi looked at Lin Fan. “Sorry, Teacher Lin.”</p><br/><p>Lin Fan waved his hand. “No problem. I can only say that you and I are not fated, nor are you fated with the Eastern Han Group.”</p><br/><p>Initially, the audience had still been very displeased but when they heard this, they became puzzled. They wondered what Master Lin meant by that.</p><br/><p>Under the puzzled gazes of Zhang Chi and everyone else, Lin Fan spoke calmly.</p><br/><p>“This time, as a mentor, I’m not only here to shine my light for the contestants, but I also want to pick out some contestants with potential to sign them to Eastern Han Group and sing songs composed by me that will be promoted on the market. Initially, Chen Rui An was the only one and I wanted to take you in as well. It’s a shame that you have chosen Teacher Zhao. That can’t be helped. I can only say that it is not fated.”</p><br/><p>Lin Fan made a helpless expression. But in his heart, he was secretly laughing.</p><br/><p>It’s a great loss, isn’t it?</p><br/><p>You regret it now, don’t you?</p><br/><p>Indeed, when Zhang Chi heard this, her expression slowly changed into one of regret.</p><br/><p>The audience, on the other hand, started laughing. They were laughing at this Zhang Chi for missing out on this opportunity.</p><br/><p>Although Zhao Li was powerful, she was nowhere near as great as Eastern Han Group. Moreover, Zhang Chi would have been able to sing songs produced by Master Lin. This loss was way too cruel.</p><br/><p>Everyone knew that every song composed by Master Lin was sure to become a hit.</p><br/><p>Wu Huan Yue was an example of that.</p></div>\n</div>"}