{"title": "Chapter 745 - This Was Provoking Oneself", "id": 745, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-745-this-was-provoking-oneself", "volume_title": "Volume 8", "body": "<h1>Chapter 745 - This Was Provoking Oneself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the venue of the ‘Strongest Heavenly Voice’.</p><br/><p>When Lin Fan arrived at the venue, there was immediately a thunderous round of applause.</p><br/><p>Lin Fan was shocked, and with some suspicions, he smiled, “What are you all doing? It’s as if you guys love me so much for saving the world once again.”</p><br/><p>The crowd laughed. Someone from the audience shouted, “Master Lin! You did it too beautifully! Awesome!”</p><br/><p>Almost immediately after, another person from the audience shouted, “You have to expose the dirty dealings!”</p><br/><p>“Oh, so that’s what you guys are clapping about.” Lin Fan laughed. Thereafter, he waved his hand, “These so-called dirty dealings are exactly what I can’t stand the most. Don’t you guys think so? Someone who has practiced so hard and so seriously, with the potential to get a better placing, was dropped out of the competition all because of some dirty dealings. This would have cast a huge shadow of doubt in his heart. Therefore, when we are met with such a situation, we have to deal with it sternly, to let them know those dirty dealings should not exist!”</p><br/><p>“Well said!”</p><br/><p>“I admire no one else but Master Lin.”</p><br/><p>“On a normal basis, Ying Jin seemed to be very honorable. Who knew she would have the ability to pull such underhanded means.”</p><br/><p>“We have to boycott her.”</p><br/><p>…</p><br/><p>Listening to the noise, Lin Fan felt that he stood on the side of justice. After which, he looked directly at Liu Ying Dong who was sitting at the judge’s panel.</p><br/><p>Ever since the Ying Jin issue happened, all he did was sit there, depressed. When his gaze met Lin Fan’s, he seemed to avoid it and tried to hide away.</p><br/><p>“Hey!”</p><br/><p>Lin Fan was very happy. This fellow must have thoroughly experienced his awesomeness.</p><br/><p>Looking at Liu Ying Dong’s appearance, he definitely has some dirty dealings as well.</p><br/><p>Perhaps he was afraid that his own dirty dealings would be exposed as well.</p><br/><p>Liu Ying Dong was going frantic. He never expected that the situation would escalate to such a level. His fellow was actually able to cause Ying Jin to have her reputation swept away. Even though at this moment, he still hasn’t done it, but from what he can see, it wasn’t too far away.</p><br/><p>It was only a small matter. No one thought it would develop to such an extent.</p><br/><p>He had heard that the brand which Sister Ying was representing wanted her to pay a penalty. This was a big deal.</p><br/><p>After all, there were certain requirements stated in the endorsement contract.</p><br/><p>One of the requirements stated was not to do anything that would harm the image of the company, which would result in negative effects.</p><br/><p>He had already seen the news online. The netizens had a strong reaction to this matter. Some of the companies started to take down the logos of the spokesperson in order to cut losses.</p><br/><p>Liu Ying Dong felt that he couldn’t mess around. He really couldn’t mess around.</p><br/><p>Looking around at the judges’ panel, Zhao Li wasn’t here as well. He didn’t know what happened to her.</p><br/><p>Zhao Li was also called out in this matter involving the dirty dealings. However, the reporters only wanted to catch Ying Jin because her reputation was higher. Moreover, Zhao Li also didn’t reveal anything in front of the reporters. So there wasn’t much news from her.</p><br/><p>However, everyone knew that it wasn’t only Ying Jin that was involved in the dirty dealings, but Zhao Li as well.</p><br/><p>Huo Jian Xiang lightly tapped Lin Fan. It was unfathomable and unbelievable.</p><br/><p>“Master Lin, you are indeed awesome. It’s virtually impossible for her to get on good public relations this time.”</p><br/><p>Lin Fan laughed, “What public relations? The evidence has already been exposed. There’s no way she’ll be able to clear her name.”</p><br/><p>Huo Jian Xiang said with good intentions, “Master Lin, from an objective point of view, I feel that what you’ve done is enough. After all, if you want to stay in this circle, you can’t offend too many people.”</p><br/><p>Lin Fan replied calmly, “I don’t quite understand what you’re saying. I didn’t do anything. It’s the netizens who don’t wish to forgive her. I can’t do anything. As for this circle, I don’t have the intentions to stay for long.”</p><br/><p>Huo Jian Xiang didn’t say anything else. He only casually said those words, and it wasn’t as if he sided with Ying Jin. He said those words through his many years of experience and wanted to express his thoughts on the effect of this event.</p><br/><p>Lin Fan understood him, but it didn’t matter. He was originally just selling scallion pancakes.</p><br/><p>As for the mentor job, it was already his Nth number of job.</p><br/><p>In the broadcasting room.</p><br/><p>“Hey, that’s strange. Why isn’t Zhao Li here yet?”</p><br/><p>“Something has already happened to her. Would she still have the face to come here?”</p><br/><p>“If she dares to come, I can guarantee you that Master Lin would hate her to death.”</p><br/><p>“I’d support Master Lin doing hat. She isn’t a very good person, and is often very arrogant.”</p><br/><p>At the backstage.</p><br/><p>The deputy stage director was getting nervous, “Zhao Li isn’t here yet?”</p><br/><p>One of the workers said, “I’ve just contacted her. She’s on her way here. However, deputy stage manager, would there really be no problem with her here?”</p><br/><p>The deputy stage manager had a face of helplessness, “What else can we do? Unless we cancel this show.”</p><br/><p>Not before long.</p><br/><p>Zhao Li appeared at the venue for the Strongest Heavenly Voice.</p><br/><p>When the audience saw Zhao Li, they immediately started jeering.</p><br/><p>Zhao Li maintained an ordinary expression, however, she was feeling uncomparably awkward. She didn’t know what to say.</p><br/><p>She heard the comments from the audience.</p><br/><p>*scoffs*</p><br/><p>“She actually has the face to show up here.”</p><br/><p>“Someone that meddles with dirty dealings actually dares to turn up. Her skin must be really thick.”</p><br/><p>“Let her leave! We don’t wish to see a mentor that has meddles with dirty dealings!”</p><br/><p>Listening to these words, she gradually became more gloomy. However, she thought of something.</p><br/><p>You guys don’t wish to see me? However, I have to make an appearance on this show and put up a normal act. I’ll let you all know that I just won’t leave even though you guys want me to, just so I can piss all of you off.</p><br/><p>When she thought of this, she smiled and raised her hand. She acted as if nothing had happened, “I’m so sorry, there was a bit of delay on the roads which caused me to be late.”</p><br/><p>The audience fumed momentarily when they heard this.</p><br/><p>Zhao Li didn’t have a single bit of self-awareness.</p><br/><p>Despicable. Extremely despicable!</p><br/><p>Lin Fan looked at Zhao Li and smiled. He had played this matter regarding the dirty dealings very well. His main target was Ying Jin. As for Zhao Li, she was an extra.</p><br/><p>However, looking at the appearance of Zhao Li, he was afraid that it wouldn’t be easy for her.</p><br/><p>Zhao Li’s blood started to boil the moment she saw Lin Fan. However, no matter how angry she was, she couldn’t show it.</p><br/><p>Everything that has happened till date has all happened because of that b*stard.</p><br/><p>If it weren’t for him, none of this would have happened.</p><br/><p>When she thought about the group of reporters awaiting her, she felt scared.</p><br/><p>She was in denial about losing her reputation. Ever since Sister Ying held that reporters conference, the matter didn’t end there, but instead, it became even more intense. So much so that she could just collapse.</p><br/><p>“Teacher Zhao, why does your expression look so bad? Could it be because of the dirty dealings that caused you to look so sick?” Lin Fan asked her bluntly through the microphone.</p><br/><p>Zhao Li didn’t expect that this b*stard would ask such a blunt question. He even used the f*cking microphone.</p><br/><p>Is he afraid that no one can hear him?</p><br/><p>However at this moment, she laughed awkwardly, “Thank you for your concern Master Lin, but I’m doing well.”</p><br/><p>“Oh.” Lin Fan profoundly said. “Dirty and healthy.”</p><br/><p>In the broadcasting room.</p><br/><p>“Haha, I’m laughing my *ss off. Master Lin isn’t giving her any face at all.”</p><br/><p>“This is the way to do it! Zhao Li isn’t that good a person.”</p><br/><p>“Let me ask you, are you sick?”</p><br/><p>“Why do I feel that there is something not quite right about this “Dirty and healthy”?”</p><br/><p>“I feel the same way.”</p><br/><p>…</p></div>\n</div>"}