{"title": "Chapter 740 - The Blame Must Be Shouldered", "id": 740, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-740-the-blame-must-be-shouldered", "volume_title": "Volume 8", "body": "<h1>Chapter 740 - The Blame Must Be Shouldered</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Why do I feel like that contestant feels like dying?”</p><br/><p>“Isn’t that obvious? She actually dumped our cute, little Master Lin. Isn’t she just insulting us?”</p><br/><p>“Haha, this move by Master Lin was simply too good. He let you change your mind but now you regret it, don’t you?”</p><br/><p>“This little girl is really nothing much. She looks to cute but she changes her mind so quickly. She has hurt our Master Lin’s heart.”</p><br/><p>It was just as the audience was saying. Zhang Chi was filled with regret. However, there is no medicine for regret. She could only return backstage helplessly.</p><br/><p>Some of the other contestants looked at Zhang Chi and let out sadistic smiles.</p><br/><p>As Zhang Chi saw these smiles, she couldn’t help but frown and she muttered in her heart, “What kind of game is this?”</p><br/><p>After Zhang Chi left.</p><br/><p>A group of contestants who were about to go on stage gathered together and whispered among themselves.</p><br/><p>“I never thought that we’ve all been cheated. This young lady looks so cute but she’s actually so scheming.”</p><br/><p>“When she just arrived, she treated us so politely and courteously and she even told us that she wanted to join Teacher Lin’s team. I never thought that once Zhao Li offered some benefits, she would immediately go back on her words. She’s really too snobbish.”</p><br/><p>“She must be dying of regret now. Who would’ve thought that Master Lin represents the Eastern Han Group? Moreover, she would even have gotten to sing Master Lin’s personally composed songs. Master Lin’s songs are what countless singers dream of getting their hands on. Someone even said before that no matter who sings his songs, they would still become famous across the musical world.”</p><br/><p>“I hope I get chosen by Master Lin. Then, I would be able to sign to that company.”</p><br/><p>“Me too.”</p><br/><p>In the toilet.</p><br/><p>Zhang Chi couldn’t hold back her tears anymore. She felt as if she had been wronged. If she had known earlier, she would have pressed on with her decision.</p><br/><p>However, she had never thought that Teacher Lin had been hiding such a deep secret. If she had known that she would have gotten a contract, she would not have changed her mind no matter what kind of benefits Zhao Li offered.</p><br/><p>…</p><br/><p>On the stage, another contestant was about to go up.</p><br/><p>Zhao Li looked at Lin Fan. “Sorry, Teacher Lin. I really like that contestant very much, so I had to take her by force.”</p><br/><p>Lin Fan waved his hand indifferently. “It’s not a problem, as long as you like her. Although that contestant is good, she’s not someone I have to have no matter what.”</p><br/><p>Zhao Li was all smiles. Although she had not managed to humiliate this guy, she had managed to snatch away the person that he wanted. She felt great on the inside.</p><br/><p>Right now, the trending news on the Internet wasn’t only about Ying Jin, but also about her.</p><br/><p>The song theft incident had not ended. The Internet was abuzz over this incident. Moreover, the direction of opinions had started to change. Most netizens had started to have doubts about the truth.</p><br/><p>Even on her Weibo, countless people were flaming her, urging her to confess the truth.</p><br/><p>She was so angry that she wanted to curse at them. But according to Sister Ying’s instruction, she was supposed to ignore them. The more she cared about them, the cockier those people would become.</p><br/><p>Sometimes, Zhao Li really wanted to kill Lin Fan. However, she could only think about it. Even if she really wanted to do it, she didn’t have the capabilities.</p><br/><p>Even Sister Ying couldn’t do anything to him. What could she possibly do?</p><br/><p>…</p><br/><p>Huo Jian Yang said softly, “Teacher Lin, you should take some contestants. You only have one contestant as of now. Later on, you won’t be able to make it with only one contestant in your team. There aren’t many left to choose from now. You have to seize these opportunities.”</p><br/><p>Lin Fan nodded, “Mmm, I know. I just haven’t seen any suitable ones yet.”</p><br/><p>Huo Jian Yang felt a little helpless. To him, some of the contestants had been very good but Teacher Lin didn’t want them. This really left him helpless.</p><br/><p>But what he didn’t know was that Lin Fan would only choose the best contestants as well as those who were most capable of becoming popular. It was very important for him to give Wang Ming Yang some good, young blood.</p><br/><p>After all, he was Wang Ming Yang’s brother. If he didn’t look out for Wang Ming Yang, who would?</p><br/><p>The host, Cui Wei, said, “Let’s invite the next contestant on stage.”</p><br/><p>During this period of time, there had already been quite a few contestants who had gone up on stage. However, they were not to Lin Fan’s taste. They were far from meeting Lin Fan’s standards.</p><br/><p>At this moment, a cute-looking girl stepped on stage. Her round face was very adorable.</p><br/><p>“Hello, dear mentors. I’m Chen Yuan and I come from Yanhai. I’m twenty this year. I’ve gotten a flu today, so my throat might be…” the contestant was speaking.</p><br/><p>“Alright, this is a singing competition. No need for all these excuses,” said Zhao Li as she waved her hand unhappily.</p><br/><p>Chen Yuan was startled. She was very nervous. Her hands gripped tightly on the microphone as she looked a little embarrassed.</p><br/><p>Lin Fan saw this and said, “Teacher Zhao, what you did isn’t right. She just said that she has gotten a flu. Why must you be so angry? My dear beautiful little lady, you don’t need to care about this crazy old woman. Give us a good performance. I have high hopes for you.”</p><br/><p>“What did you say?” Zhao Li stood up furiously and glared at Lin Fan. She had not thought that this guy would call her a crazy old woman on live broadcast.</p><br/><p>“Oh no, I’m sorry. It slipped out of my mouth. I forgot that this is a live broadcast,” said Lin Fan apologetically. However, that smile on his face was just asking for someone to beat him up.</p><br/><p>The audience laughed.</p><br/><p>“D*mn! Teacher Lin really doesn’t feel comfortable without causing trouble for a single day.”</p><br/><p>“That girl just said that she’s having a flu. It’s not like she was insulting Zhao Li. Why would Zhao Li be so angry?”</p><br/><p>“Her anger was drawn out by Master Lin, of course. From the start of the competition until now, not a single day has passed peacefully. She has gotten flamed every single day. It’s already good that she hasn’t fallen apart.”</p><br/><p>“That makes sense. This blame must be shouldered by Master Lin.”</p><br/><p>Zhao Li sat down furiously. Her expression was extremely ugly. Liu Ying Dong just sat there silently. He had become clever as he stopped going against Master Lin.</p><br/><p>Even Ying Jin and Zhao Li were unable to overwhelm Master Lin. how would he be able to do anything?</p><br/><p>He decided to just finish recording the show obediently so that he would be able to leave this d*mned place.</p><br/><p>Although Chen Yuan was nervous, she had already done her preparations. She would just forget everything else and pour her emotions into her song.</p><br/><p>Although she was having the flu and her voice sounded a little coarse, you could tell that her foundation was very good.</p><br/><p>What made Lin Fan to fancy her even more was that she would be able to become popular in future.</p><br/><p>As long as she could become popular, that was enough.</p><br/><p>Chen Yuan’s voice slowly faded. She looked at the four mentors. She was a little disappointed. A little unresigned. A little regretful.</p><br/><p>She had not expected that not a single mentor’s light would light up.</p><br/><p>Zhao Li had her arms folded as she stared at Chen Yuan. It seemed that she had no intention of flashing her light.</p><br/><p>Meanwhile, Huo Jian Yang wanted to look at the remaining contestants before choosing a few with voices that he liked. Of course, he could tell that this young lady’s fundamentals were very good.</p><br/><p>The song had ended and Chen Yuan was about to take a bow and leave the stage.</p><br/><p>Suddenly, Lin Fan pressed the button and turned on his light. “Sorry, I forgot to turn on the light. I think very highly of you.”</p><br/><p>Pa!</p><br/><p>At that moment, Zhao Li turned on her light too.</p><br/><p>“I like your voice very much. If you join me, I can nurture you into a star in the musical world.”</p><br/><p>Of course, Zhao Li was just boasting. She just wanted to let Lin Fan know that she would snatch whoever he wanted from him.</p><br/><p>Chen Yuan covered her mouth as she stood on stage. She had not expected that when she had lost all hope, there would actually be mentors who would shine their lights for her.</p><br/><p>Before the host even got on stage, Chen Yuan said excitedly, “I want to join Teacher Lin’s side.”</p><br/><p>When Lin Fan heard this, he couldn’t help but laugh. Then, he looked at Zhao Li. “Teacher Li, sometimes, you shouldn’t be too self-confident.”</p><br/><p>“You…” Zhao Li looked away and didn’t say more.</p><br/><p>“You win this time. But this kind of contestant will never enter the finals,” Zhao Li thought.</p></div>\n</div>"}