{"title": "Chapter 744 - The Outburst Is Rather Intense", "id": 744, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-744-the-outburst-is-rather-intense", "volume_title": "Volume 8", "body": "<h1>Chapter 744 - The Outburst Is Rather Intense</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The reporter’s conference ended.</p><br/><p>At the backstage.</p><br/><p>Her manager stood respectfully at one side whilst carrying tissue. Right now, she didn’t really dare to touch Ying Jin.</p><br/><p>Ying Jin wiped away her tears. She had a cold expression on her face, which caused many to fear of looking at her.</p><br/><p>“Sister Ying, has everything been settled?” Her manager asked in a hushed tone. From what she saw, it should be rather successful. Sister Ying cried very badly and looked very regretful. She even saw some reporters look away as if they couldn’t take watching her cry anymore.</p><br/><p>However, if only she knew that these reporters looked away because they could not bear to watch her directly, she wouldn’t have asked these questions.</p><br/><p>“Are you an id*ot?” Ying Jin lifted her head and looked at her manager. “With your level of IQ, I’m already doing you a favor by putting you as my manager. Get out of my way!”</p><br/><p>Her manager stood awkwardly at one side. She felt like crying. Being Ying Jin’s manager, she has endured a lot.</p><br/><p>She was treated like a dog.</p><br/><p>She knew that Ying Jin only chose her to be her manager because she listened to instructions and she also wasn’t very bright.</p><br/><p>Just take a look at the other celebrities. They held their managers in such high regard. They have not treated them anything like the way she was.</p><br/><p>Every time they were in a group, she saw how lucky the other managers were, and she would feel a pang of jealousy.</p><br/><p>From other people’s perspective, when they heard that she was Ying Jin’s manager, they would feel that it was very high-end with good welfare. However, only she knew that she was just another dog.</p><br/><p>The surrounding bodyguards looked at her with sympathy, but they didn’t dare to say anything.</p><br/><p>*Ring ring*</p><br/><p>At this moment, Ying Jin’s phone began to ring.</p><br/><p>“Everyone, get out.” Ying Jin said. She only picked up the call when everyone left.</p><br/><p>“Has the matter been resolved?”</p><br/><p>“The reporters just left. I don’t know what the situation would be like. I can’t take this anymore. I need him to pay the price as well.”</p><br/><p>“I’ve already sent people to Shanghai. We’d give that fellow something to remember deeply. I never knew that there’d be such idiots. Just because they have a slight bit of skills, they forget what they’re truly capable of.”</p><br/><p>Ying Jin nodded her head in contentment. However, she was still raging internally. If it weren’t for Lin Fan, she wouldn’t be in such a predicament.</p><br/><p>As for that scum, Yang Jie. If only she knew where she went, or else she’d definitely give him a hard time.</p><br/><p>The next day.</p><br/><p>Cloud Street.</p><br/><p>Pfft.</p><br/><p>Lin Fan read the news on his phone. He couldn’t help but stand up.</p><br/><p>“Take a look! This meddling woman just doesn’t want any face.” Lin Fan didn’t think that someone could be so shameless. He was especially blinded when he watched the video.</p><br/><p>“I can only blame myself for being too young and foolish. I just couldn’t resist.”</p><br/><p>It was almost as if he couldn’t hold his phone steady after listening to the nauseating voice coming from his phone.</p><br/><p>Fraud Tian surrounded him. “Aiyo, this voice sounds rather delicate. If she were to be my wife, I’d hit her three times a day. Morning, afternoon, and at night!”</p><br/><p>“You b*stard. Very hardcore.” Lin Fan gave up a thumbs up. Much respect indeed.</p><br/><p>“She’s alright. Although her nose is rather large.” Fraud Tian was clear and logical with his comments.</p><br/><p>Zhao Zhong Yan ridiculed, “This Ying Jin can sure put up an act. Brother Lin. You don’t think the netizens would forgive her just like this?”</p><br/><p>Lin Fan laughed out loud, “Do you think the netizens are idiots? When it comes to people’s emotions, no matter how pitiful one can be, they wouldn’t be forgiven so easily.”</p><br/><p>“Moreover, look at this Ying Jin. In the entertainment circle, she gets exactly what she wants. She’s too bossy. I’m sure there are many people waiting for her downfall.”</p><br/><p>Even though he didn’t mix around in this circle, everyone knew that no matter how awesome of a person you are, if you’re a hypocrite and a bully, there would definitely be people around who wanted to chop you down.</p><br/><p>On Weibo.</p><br/><p>“F*ck! Her crying is f*cking disgusting.”</p><br/><p>“She’s already so old, yet she still calls herself young. How childish. She really doesn’t want her face.”</p><br/><p>“Get her out of the music industry, as well as variety shows. If she appears on any of those shows, we wouldn’t watch them!”</p><br/><p>“Well said! I’m not going to buy any product that she represents for any more!”</p><br/><p>“Don’t act pitiful.”</p><br/><p>“Get out of the music industry!”</p><br/><p>…</p><br/><p>It was buzzing online. At this moment, the netizens rallied together to boycott Ying Jin.</p><br/><p>Looking at this matter, the people within the industry thought that she should just give up. She wouldn’t be able to wash her name off this dirty secrets of hers. If she were in her twenties, people might just forgive her.</p><br/><p>However, right now, it was virtually impossible.</p><br/><p>Within the circle of a few singers.</p><br/><p>“Regarding this matter, Ying Jin is done for.”</p><br/><p>“That can’t be possible. With her position, no matter what they say, nothing can happen to her.”</p><br/><p>“Why not? The dirty secrets have already been exposed. No matter how high her position is, it wouldn’t be of any use.”</p><br/><p>“With Master Lin hot on Ying Jin’s tail, she won’t be able to solve this matter by simple means.”</p><br/><p>“I really admire this Master Lin. Even though I haven’t met him in person, through this matter, I can tell that he is very valiant.”</p><br/><p>“Stop joking around. Why don’t you go and look him up online? This guy is extremely popular and has many fans. Ordinary people wouldn’t dare to go against him. I’ve totally forgotten how Ying Jin got into this fight with Master Lin.”</p><br/><p>“This started even before Wu Huan Yue made her debut when she first joined the competition.”</p><br/><p>“Wu Huan Yue is really lucky to have met such someone so influential. He writes such amazing lyrics and yet he does not seem to want the money. He also looks like he is very devoted. I wonder what kind of position Master Lin enjoys?”</p><br/><p>“Don’t spout nonsense. I don’t think anything along that line has happened.”</p><br/><p>“Who would believe that nothing happened? Wu Huan Yue has an impressive figure. She’s beautiful and alluring. Especially that *ss. Even us women would want a bit of that action.”</p><br/><p>“You have a good eye.”</p><br/><p>At the hotel.</p><br/><p>Ying Jin looked at the discussions on Weibo. Her face was pale. She stood up fiercely and walked towards her manager.</p><br/><p>Her manager, who was waiting for someone, saw that Ying Jin was walking towards her. She became slightly nervous, “Sister… Sister Ying.”</p><br/><p>*Slap!*</p><br/><p>She slapped her manager directly on her face without any hesitation.</p><br/><p>“How despicable can you be? You stupid scoundrel! How dare you say this about me.”</p><br/><p>Ying Jin was extremely furious. This was the first time she had been met with such a situation since becoming famous. In the past, she was able to tolerate the netizens’ scoldings and pretend as if nothing happened.</p><br/><p>However, this time, she couldn’t take it anymore.</p><br/><p>This was because this time, the evidence was exposed, and she was feeling rather lacking in confidence.</p><br/><p>From being all high and mighty to having nothing at all. She could not stand it at all.</p><br/><p>Just at this moment, the phone rang.</p><br/><p>Her manager saw the notification on the phone, and weakly said, “Sister Ying, its a call from Ju Lai Mei.”</p><br/><p>Ju Lai Mei was the company she was the ambassador for. The endorsement amount was eighty million for three years.</p><br/><p>“Pick it up,” Ying Jin glared at her. She hasn’t entirely calmed down.</p><br/><p>Her manager picked up the call, “Hello.”</p><br/><p>Slowly, the expression of her manager turned to one of fear and shock.</p><br/><p>Ying Jin asked, “What happened?”</p><br/><p>Her manager didn’t dare to say anything. She turned her back against Ying Jin. Fearing that she’d be hit again, she carefully said, “Ying Jin, Ju Lai Mei said that you have violated their contract. Right now, there’s a conflict online asking them to terminate their contract with you, as well as to pay them back. At the same time, based on the contract, you are to pay an additional of ten million as a penalty. If you aren’t going to pay them, they said they’d see you in court.”</p><br/><p>“F*ck them!” Ying Jin couldn’t take it anymore. She took the ashtray in front of her and smashed it on her manager’s head.</p><br/><p>There was a scream of agony.</p><br/><p>Fresh blood dripped everywhere.</p></div>\n</div>"}