{"title": "Chapter 758 - Everything has been settled", "id": 758, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-758-everything-has-been-settled", "volume_title": "Volume 8", "body": "<h1>Chapter 758 - Everything has been settled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cloud Street.</p><br/><p>When Lin Fan arrived, he was surrounded by all the shop owners.</p><br/><p>“Little Boss, you have to take responsibility for this.”</p><br/><p>“Yes, we supported your show but then you made us cry. This is not justifiable.”</p><br/><p>“I suggest that you sing for us again. Then we will be able to write off your debt.”</p><br/><p>Lin Fan stared at them with his mouth open.</p><br/><p>“What are guys trying to do? You guys want to listen to me sing? Are you all not doing business anymore?”</p><br/><p>He felt very helpless towards these neighbors that liked to get in on the action. Wasn’t it just him singing a song? Why did they have to make such a big fuss?</p><br/><p>“I’m willing not to do any business just to listen to Little Boss sing a song.” one of the shop owners said.</p><br/><p>“Sh*t,” Lin Fan was feeling a little impatient. They were so aggressive and making such a big fuss. “Everyone scram, I’ll do it another time.”</p><br/><p>He could not help feeling that this situation had taken a very unexpected turn. He had also seen that situation online and realized that this whole scene was a little scary.</p><br/><p>In the past, he only wrote lyrics and did not sing.</p><br/><p>To others, it did not really draw them in. However, after last night’s trouble, all the netizens started to think of him and wanted him to keep coming up with music.</p><br/><p>He himself did not want to become a famous singer. His ultimate goal was to just take care of this small store, sell scallion pancakes to sustain himself and then cause a surge at the Nanshan Children’s Welfare Institute.</p><br/><p>Where did the simpler days go?</p><br/><p>He’ll never get it back again.</p><br/><p>However, last night, that b*stard Wang Ming Yang almost tormented him to death.</p><br/><p>In the end, he had no choice but to give in. He agreed to finish ‘Kiss Goodbye’ with the accompanying instrumentals and publish it. And from this onwards, he would not disturb him again.</p><br/><p>He felt that this task would be accomplished as quickly as a rocket.</p><br/><p>At this moment, the townsfolk all came over, queued up and prepared to buy the scallion pancakes.</p><br/><p>Lin Fan laughed, “Everyone please don’t be anxious, it’s coming soon.”</p><br/><p>The townsfolk said, “Little Boss, how about you don’t sell scallion pancakes today? You can sing us a song and we will leave.”</p><br/><p>Lin Fan was stunned. Will something like that work?</p><br/><p>However, he felt that he couldn’t do that as he still had to sell scallion pancakes.</p><br/><p>If not, how will he pay the rent every day?</p><br/><p>“I’m not going to sing today. The song should be coming out in a few days time. When it does, you guys can listen to it online,” Lin Fan said.</p><br/><p>“Really?” some of them refused to believe him.</p><br/><p>Lin Fan replied them, “Why would I lie to you guys?”</p><br/><p>Very obviously, when the townsfolk heard this, they got extremely excited. They had really been fascinated by Little Boss’ song and they could not wait to hear it every single day.</p><br/><p>After hearing his song, they felt that all other songs were not interesting anymore.</p><br/><p>After he had finished his work, Lin Fan could finally relax.</p><br/><p>“You guys look after the store, I’m going out for awhile,” Lin Fan instructed them. Then, he got into his car and headed towards where Wang Ming Yang was.</p><br/><p>He wanted to just quickly get this recording over and done with. When he was finished with it, his task should also be completed.</p><br/><p>He knew that the Encyclopedia’s mythical boost was strong but he didn’t think that it would be this strong.</p><br/><p>Merely just one song and it had such a huge impact.</p><br/><p>At the Eastern Group.</p><br/><p>“Hello, Master Lin,” the receptionist saw Lin Fan and immediately stood up.</p><br/><p>Lin Fan smiled and said, “Is Director Wang here?”</p><br/><p>“Yes, he is,” the receptionist said.</p><br/><p>Lin Fan nodded, “Okay, keep doing your job, I’m going to go up myself.”</p><br/><p>To the receptionist, she definitely recognized Master Lin. It was the boss’ good friend. So when he came here, naturally there would be no obstructions for him.</p><br/><p>Especially since a countless number of people had heard the song that Master Lin sang last night.</p><br/><p>She herself had naturally become a fangirl of Lin Fan.</p><br/><p>Wang Ming Yang gave a sheepish laugh and said, “Who’s bothering you? We are brothers. No one else can do this other than you. However, to be honest, your song is extremely amazing. You are my man.”</p><br/><p>“Okay, okay, stop it. Is everyone here already?” Lin Fan asked. His main purpose was to get the accompanying instrumental for ‘Kiss Goodbye’, record it perfectly and put it online.</p><br/><p>Wang Ming Yang said, “When I’m handling things, there’s no need to worry about anything. The people were here a long time ago. Come, let’s go to the office.”</p><br/><p>In the office.</p><br/><p>The staff were all busy at work. When Lin Fan entered the scene, he could clearly feel that the staff were looking at him differently, like they were filled with admiration.</p><br/><p>“Teacher Lin.”</p><br/><p>“Hello, Teacher Lin.”</p><br/><p>…</p><br/><p>Although Lin Fan was young, his abilities went without saying. They really admired him.</p><br/><p>“Everyone, sorry to bother you guys. I’ll write the scores for the accompaniment down and then you guys can play it,” Lin Fan said. Then he took a pen and a piece of paper and started writing down the scores for the accompaniment for ‘Kiss Goodbye’.</p><br/><p>Everyone fixated their gaze on him. Some of them gasped. They were all extremely astonished.</p><br/><p>“Done,” Lin Fan said as he put his pen down.</p><br/><p>Wang Ming Yang was stunned and said, “That’s it?”</p><br/><p>Lin Fan replied, “What else do you want?”</p><br/><p>Wang Ming Yang said with astonishment, “If we add all of this then won’t this song not be a godly song anymore?”</p><br/><p>A staff member said, “Actually, the song is very good. However, besides Master Lin, I’m afraid no one else will be able to reach this level. Also, other singers probably won’t dare to cover this song. There are many good singers here and none of them dares to touch it.”</p><br/><p>To the staff members, they already considered themselves to be lucky to be able to see such a godly song.</p><br/><p>Also, to some of these singers, even if they wanted to sing it, they would not dare to as they would only embarrass themselves.</p><br/><p>The original piece was very strong. They definitely wouldn’t want to humiliate themselves.</p><br/><p>Lin Fan said, “Okay, let’s work together.”</p><br/><p>“What?” The staff were stunned. “Master Lin, you know how to operate these as well?”</p><br/><p>Lin Fan smiled and said, “Of course. If I didn’t know how to, what else can I play with?”</p><br/><p>The staff members didn’t say much but they had their doubts.</p><br/><p>However, after a while, one by one, they started to believe him.</p><br/><p>When they got to work, they realized that Master Lin was really disgusting. He was actually better than them. He had zero problems with all the different types of equipment.</p><br/><p>Being more experienced than the experienced. It was really scary.</p><br/><p>Wang Ming Yang was very proud. That was what his brother was like. All knowing and being awesome at everything.</p><br/><p>He didn’t even know if there was anything this guy couldn’t do.</p><br/><p>One hour later.</p><br/><p>The accompaniment was done.</p><br/><p>All of the staff looked at Lin Fan in shock. If it were them, it would have taken a few hours to do. But right now, he had finished it in this short amount of time. If they were to tell others about this, it would scare them to death.</p><br/><p>Especially since the accompaniment was already very good, but Teacher Lin was not satisfied with it. He decided to redo it. To them, the accompaniment he did initially was already very good.</p><br/><p>His expectations were really too high.</p><br/><p>If it were them, they would not have such a high expectation.</p></div>\n</div>"}