{"title": "Chapter 751 - One After Another", "id": 751, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-751-one-after-another", "volume_title": "Volume 8", "body": "<h1>Chapter 751 - One After Another</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>When Zhao Li sent out this Weibo, everyone had read it.</p><br/><p>Everyone in the entertainment circle took notice of it.</p><br/><p>Everyone in different large circles started talking about it.</p><br/><p>“Something serious has happened today.”</p><br/><p>“Indeed. Ying Jin was completely involved in public opinions. None of the public relations dared to take over from her. It couldn’t be over just like this, could it?”</p><br/><p>“It isn’t a good time to talk about it now. However, it was mostly completed. But right now, Zhao Li has stood out, and has pushed everything onto Ying Jin.”</p><br/><p>“Scary. Master Lin is too scary. He’s obviously not in the circle of people, yet he could actually force Ying Jin into such a state.”</p><br/><p>“Lucky for me, I’m an actor. If we were in the music industry, we’d have to be really careful.”</p><br/><p>“Where are the people who were previously clinging to Ying Jin? None of them dares to come out and speak out for her.”</p><br/><p>“As of right now, whoever dares to speak up is a fool. In any case, we have to remember to be polite to Master Lin when we run into him. He is very vicious and doesn’t follow the rulebook.”</p><br/><p>“That’s exactly right. Ying Jin is backed by Godfather Liu of the Northeast. It is impossible for ordinary people not to give face to him. As everyone heard from the recording just now, he simply does not give any face to anyone.”</p><br/><p>…</p><br/><p>This event is probably the most talked about news in the entertainment industry.</p><br/><p>When have we ever seen a senior in the music industry get entrapped to such a state?</p><br/><p>When Ying Jin saw Zhao Li’s Weibo, her face turned solid green. It was as if she lost her soul. She didn’t expect to get backstabbed by one of her own.</p><br/><p>She made a call.</p><br/><p>It got cut.</p><br/><p>She tried calling again.</p><br/><p>It got cut.</p><br/><p>Zhao Li was feeling empty. She didn’t dare to pick up Ying Jin’s call. But this had to be done. If she didn’t push the responsibility away to get the forgiveness of the netizens, she was afraid that after they chased Ying Jin off the stage, she’ll be next.</p><br/><p>However, Ying Jin kept calling, one after another. Zhao Li hesitated for a long time, but finally decided to pick up the call.</p><br/><p>Immediately after she picked up the call, she could hear Ying Jin shouting over the phone.</p><br/><p>“Zhao Li you sl*t! How dare you betray me.”</p><br/><p>“You f*cking sl*t. You actually dare to do such a despicable thing?”</p><br/><p>…</p><br/><p>All sorts of vulgarities starting coming out from Ying Jin’s mouth.</p><br/><p>Zhao Li was also on the verge of exploding in rage. In an instant, she furiously shouted, “Ying Jin, please mind your words. When have I betrayed you? That was exactly what happened. If it weren’t for you, I wouldn’t have received this sum of money.”</p><br/><p>“I, Zhao Li, don’t owe you anything! The matter has already happened, and I’m merely stating the facts. I’m hanging up. Don’t ever contact me in future.”</p><br/><p>*smash*</p><br/><p>After hanging up the call, she realized that her heart was pumping very fast. She didn’t know where she got the courage to talk back to Ying Jin. Moreover, after she said those words, she felt that she had finally put down a stone that has been weighing on her chest.</p><br/><p>“Sl*t! F*cking sl*t!” Ying Jin was crazily smashing things around her. She never expected that of all people, Zhao Li would betray her as well.</p><br/><p>After her fit, she lifelessly laid on her sofa, feeling as if she was finished. She didn’t know what she could do.</p><br/><p>Everyone was closely following this matter. To them, this might just be more interesting than any movie.</p><br/><p>However, before long.</p><br/><p>Something else happened.</p><br/><p>This led to Ying Jin giving up all the fight left in her.</p><br/><p>On Weibo.</p><br/><p>“I am Ying Jin’s manager, but that was all in past. This is because I can no longer stand it. Ying Jin has a violent personality. She hits me whenever she wants. She has dirty secrets involved in every variety show that she has participated in before. For every participant that she doesn’t like, she would do her best to suppress them, not giving them any chance at all. For example…”</p><br/><p>This Weibo was extremely long. When it was first published on Weibo, it didn’t quite attract the attention of many. However, within a short span of time, it was discovered by others that this was Ying Jin’s manager’s Weibo, and the netizens began re-posting it.</p><br/><p>“D*mn, I didn’t think that Ying Jin was so vicious. She actually beat her own manager till such a state.”</p><br/><p>“Look at her face, it’s practically ruined. She’s a really vicious woman.”</p><br/><p>“Ying Jin should get out of the entertainment circle.”</p><br/><p>“That’s right. She should be blocked.”</p><br/><p>“I support blocking.”</p><br/><p>The information that Ying Jin’s manager exposed was more vicious than any others. She completely exposed all of Ying Jin’s dirty secrets.</p><br/><p>Ying Jin would never have expected in her life that her manager, whom she saw as weak in her eyes, would ever dare to do such a thing.</p><br/><p>After she got beaten by Ying Jin, she went to the hospital.</p><br/><p>The doctor diagnosed that even after the wound on her face recovers, it would leave behind a very deep scar.</p><br/><p>To any women, they wouldn’t be able to tolerate this. Especially if they haven’t been married. If she looked like this, she wouldn’t be able to find a husband in future.</p><br/><p>When a cowardly person rages, she would be scarier than anyone else.</p><br/><p>Ying Jin would never be able to come back after all the responsibility was thrown onto her.</p><br/><p>At night.</p><br/><p>At the venue for Strongest Heavenly Voice.</p><br/><p>When Lin Fan appeared, the crowd cheered extremely loudly.</p><br/><p>“Master Lin, you did well this time!”</p><br/><p>“Haha! Ying Jin is suffering the consequences of her own mistakes! She shouldn’t even think of washing her name of this.”</p><br/><p>The audience was very excited.</p><br/><p>Lin Fan smiled while waving his hand. He didn’t take this matter seriously. In his view, it was just a small matter, and it wasn’t worth being in the limelight for.</p><br/><p>Before long.</p><br/><p>Zhao Li also appeared, but the audience didn’t say anything.</p><br/><p>The audience was normal and Zhao Li heaved a sigh of relief. The only thing was that she felt extremely frightened looking at Lin Fan.</p><br/><p>She was now scared of facing Lin Fan.</p><br/><p>Lin Fan realized that Zhao Li was looking at him, and he couldn’t help but smile.</p><br/><p>He didn’t expect this lady to be so vicious. Even though her method of pushing the blame was rough, it was done well. The netizens were all very kind-hearted. When they realized that Zhao Li knew she was in the wrong, as well as donating a huge sum of money, they briefly forgave her.</p><br/><p>However, from their perspective, if Master Lin were still to be angry with Zhao Li, they would definitely support him.</p><br/><p>Liu Ying Dong ran into Zhao Li. He had a strange look in his eyes. He didn’t expect that Zhao Li would actually dare to backstab others.</p><br/><p>In order to protect himself, he decided that he would temporarily cease all contact with Zhao Li.</p><br/><p>This matter was made a huge deal. Practically everyone in the entertainment circle knew about it.</p><br/><p>Everyone in Shanghai TV was panic-stricken. It was lucky that they managed to switch Ying Jin out of the show, or else, the outcome would be unimaginable.</p><br/><p>The host went up the stage. Previously, he could be a bit more casual with Lin Fan. However, now, he was a bit more cautious. He didn’t expect Master Lin to be so harsh and actually dared to break Ying Jin down.</p><br/><p>The show started.</p><br/><p>“Let’s welcome the contestants up the stage!”</p><br/><p>Lin Fan sat at the judges’ panel. He realized that the situation today was a little different.</p><br/><p>Both the contestants and the host were more respectful towards him. He could tell just from the conversations with them.</p><br/><p>However, he decided to forget it. He was an easy-going person, but others were actually scared of him.</p><br/><p>Even though he didn’t usually follow the rulebook, he was still kind-hearted.</p><br/><p>He just didn’t get it.</p><br/><p>The next day.</p><br/><p>There was an announcement from a company.</p><br/><p>The announcement was regarding a blocking.</p><br/><p>After an entire day of processing, it has finally come to an end.</p><br/><p>The involved department couldn’t take it anymore. In order to appease the popular opinion, they deciding to go through with the blocking of Ying Jin.</p><br/><p>This was the first time the department was blocking an important figure.</p><br/><p>They took down all the endorsement, songs, movies, etc, never to be seen again.</p><br/><p>Moreover, the blocking process was still kept hidden.</p><br/><p>However, when Ying Jin found out about this, she felt extremely giddy.</p><br/><p>She was finished.</p><br/><p>She was completely done for.</p></div>\n</div>"}