{"title": "Chapter 759 - My Chance To Be Alone And Free", "id": 759, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-759-my-chance-to-be-alone-and-free", "volume_title": "Volume 8", "body": "<h1>Chapter 759 - My Chance To Be Alone And Free</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the music studio.</p><br/><p>All the preparations were in order.</p><br/><p>Outside the studio, it was filled with people waiting eagerly. They did not know what the song would be like after adding the accompaniment and they were very curious.</p><br/><p>Lin Fan lifted his hand and gave the ‘ok’ signal.</p><br/><p>The accompaniment started playing.</p><br/><p>Lin Fan closed his eyes and slowly opened his mouth.</p><br/><p>The expression of the staff members changed in an instant. The feelings of grief inside them were being drawn out.</p><br/><p>At that moment, everyone was in tears.</p><br/><p>The people outside stayed calm in the face of this weird sight. They could not hear the sounds while standing outside but when they saw the expression of the staff members, they knew that the emotions the song gave were even stronger now.</p><br/><p>“Too good,” one of the staff members exclaimed. He could not hold back his tears. Even so, he still had to do his job.</p><br/><p>If outsiders saw this, they would definitely be very shocked. They would feel that this was exaggerated.</p><br/><p>Lin Fan felt that the song was even better now. Especially when it reached the main part of the song. Even he himself felt some changes in his feelings.</p><br/><p>The song finished.</p><br/><p>It was a perfect ending.</p><br/><p>Lin Fan put his headphones down and smiled and said, “How was it? Let’s listen to it again.”</p><br/><p>The staff members who were sitting on the chair and listening were still in a daze. It took them awhile before they managed to react.</p><br/><p>“It’s nice. It’s really very nice. It’s even better than the version on the show without the accompaniment. I felt that my emotions were going to jump out of my body. It really made people unable to whole back their tears. This is the best song I’ve ever heard in my life.”</p><br/><p>“No, I think we should be talking about his voice. I think no matter what song Teacher Lin sings, it will still reach this height.”</p><br/><p>When everyone heard this, they were all extremely stunned.</p><br/><p>It was really too much.</p><br/><p>Wang Ming Yang did not really care much about anything else. He just immediately broadcasted the song.</p><br/><p>When the song played, everyone abruptly shook.</p><br/><p>No one said a thing. They could not control themselves and were lost in the lyrics.</p><br/><p>Wang Ming Yang said, “Sh*t, they’ve already heard this so many times and yet they are still the same every time.”</p><br/><p>Lin Fan saw the situation outside. He just quietly watched on and waited for them to finish listening.</p><br/><p>From the top to the bottom, no one could resist the magical power of this song.</p><br/><p>When the lyrics were finished.</p><br/><p>Everyone was all lost in the ambiance. Then suddenly, they erupted into a applause.</p><br/><p>Wang Ming Yang was even more excited as he grabbed onto Lin Fan’s shoulder. He said, “Brother, this is really amazing. How about you become a singer? I’ll immediately be your manager and we can break into the worldwide music industry.”</p><br/><p>Lin Fan patted Wang Ming Yang on his hand and said, “That’s enough. You b*stard, all you think about is selling me. Now that this song has been recorded finished, there’s nothing else for me to do. I’m going to leave. Oh, yes, put this song online for me.”</p><br/><p>Wang Ming Yang was stunned. He replied, “It’s such a nice song. Why don’t you release it as an album?”</p><br/><p>Lin Fan waved him off and said, “There’s no need. Put it online first. If you really want to release it in an album then you can do so.”</p><br/><p>Right now, he was only concerned about completing his task. So much so that he did not care about whatever benefits that this song could give.</p><br/><p>In any case, he was indifferent to it. It wasn’t a very big loss.</p><br/><p>If it was any other person, Wang Ming Yang would definitely say that they had a problem with their brain. Why wouldn’t they want to make it an album and earn a lot of money?</p><br/><p>However, this person in front of him was his brother. If he wanted to be crazy, he will be crazy with him. If he said to put it online, then he would put it online. He would definitely have no hesitation.</p><br/><p>The next day.</p><br/><p>The song reached every single major music station without any disturbance.</p><br/><p>On a taxi.</p><br/><p>“Driver, go to the airport,” a man anxiously said, then he immediately made a phone call.</p><br/><p>“Xiao Li, I’m coming to the airport now, wait for me to send you off.”</p><br/><p>The voice on the other end of the phone was very calm and said, “Okay. Hurry up, I’ll wait for you.”</p><br/><p>After hanging up.</p><br/><p>The young man was very happy. That girl was his girlfriend and they had been together for two years. However, he suddenly got the news that she was going overseas for studies. He did not want her to go but he was also very excited. From now on there would be no one to watch after him and he could go wild again.</p><br/><p>He naturally had to give his girlfriend the idea that he wanted her to stay behind. He had even directly said it to his girlfriend. However, she did not agree to it and was insistent on going overseas.</p><br/><p>In the end, he could only just agree to it.</p><br/><p>He definitely felt that his time of freedom had come. As for whether this long distance relationship would work, he had never thought of that before. He trusted his girlfriend and he trusted himself. Thus, all he thought about was having a period of time where no one would be looking after him.</p><br/><p>Right now, the chance was in front of his eyes and it definitely made him very excited.</p><br/><p>Xiao Li looked at her phone and sighed. It wasn’t compulsory for her to go. Although studying overseas was very important, but if she compared it to her relationship, she treasured her relationship more.</p><br/><p>However, she was about to leave and her boyfriend was not a single bit hurt. Although he had told her not to go, it was always in an inquisitive tone. It was as if he was okay with her going or not going. However, if she could, it was best for her not to abandon her studies.</p><br/><p>In Xiao Li’s eyes, her boyfriend did not treasure her at all. If he were to cry in front of her, she would definitely not go.</p><br/><p>It would show that her boyfriend could not bear to have her leave.</p><br/><p>It was a pity that he did not.</p><br/><p>In the taxi.</p><br/><p>The driver said, “Young man, are you going to the airport to send someone off?”</p><br/><p>The young man said, “Yes. My girlfriend is going overseas to study so I’m sending her off.”</p><br/><p>Afterward, he did not say anything and just took out his phone and tuned into the music radio station. He was getting ready to listen to a few songs.</p><br/><p>At this moment, he saw that there was a new song. He was momentarily very curious. It was high in the rankings so it should be pretty good.</p><br/><p>Then, he put on his earphones and then laid down to listen to it.</p><br/><p>The driver felt a little apprehensive when he looked at the young man. His girlfriend was going to go overseas to study and the chances of them breaking up were pretty high. However, this young man did not look too upset about it.</p><br/><p>Suddenly.</p><br/><p>The driver saw from his rearview mirror that the young man did not look too right.</p><br/><p>He was crying.</p><br/><p>Sh*t, this young man is crying.</p><br/><p>He saw the young man rubbing his eyes like he was trying to stop himself from crying. However, more and more tears started flowing. It was as if he was very hurt.</p><br/><p>Zhang He was dumbfounded.</p><br/><p>He did not know why he was crying after listening to this song.</p><br/><p>However, it was like his heart was in pain and he could not hold back his tears.</p><br/><p>The rhythm and his voice were all reverberating in his ear.</p><br/><p>As he kept listening on, he was crying with more and more pain.</p><br/><p>He was just short of going into a loud wail.</p><br/><p>The driver looked at this scene and regardless of what he was feeling just now, he still felt bad for this young man.</p><br/><p>When he was talking on the phone, he was clearly very normal. He never thought that after that phone call, he would actually cry so badly.</p><br/><p>He must be really hurt and did not want her to leave.</p><br/><p>Half an hour later.</p><br/><p>The driver was already very moved.</p><br/><p>This young man had already been crying for half an hour and his eyes were completely red.</p><br/><p>But, what he did not know was the Zhang He was wearing earphones. He did not want to listen to that song but he could not control himself. As he listened to the song, again and again, his feelings became deeper and deeper each time, and he wanted to cry more and more.</p><br/><p>“Young man, don’t cry anymore. We’re at the airport already. The fee is one hundred dollars,” the driver said.</p><br/><p>Zhang He nodded. He quickly paid the fee and then got off the taxi.</p><br/><p>At this moment, he saw a silhouette in front of him and rushed towards it.</p><br/><p>When Xiao Li saw that her boyfriend took so long to come, she was burning inside. However, she suddenly realized that her boyfriend’s eyes were very red.</p><br/><p>“Were you crying just now?” Xiao Li could not help feeling sorry for him and was very moved inside. He had actually cried. He was on the road alone and was crying.</p><br/><p>“No I wasn’t,” Zhang He rubbed his eyes. He really did not want to cry. Who in the world sang that song? Why does it make people want to cry more and more?</p><br/><p>Xiao Li hugged Zhang He and said, “Stop trying to lie to me. You were clearly crying just now. I’m not going anymore. I’m not going overseas to study. I’m going to stay here to keep you company.”</p><br/><p>At this moment, the driver came over.</p><br/><p>“Young lady, this young man is not bad. When he was sitting in my taxi on the way here, he was crying all the way. Even I, an old-timer, was moved. Don’t leave. You guys should stay together,” the driver said.</p><br/><p>Xiao Li nodded and said, “Yes, I’m not going anymore.”</p><br/><p>Zhang He, “???”</p><br/><p>Motherf*cker, who is the b*stard that sang this song?</p><br/><p>I’m not reluctant to let her go.</p><br/><p>My chance to be alone and free…</p></div>\n</div>"}