{"title": "Chapter 753 - The End Of The Competition", "id": 753, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-753-the-end-of-the-competition", "volume_title": "Volume 8", "body": "<h1>Chapter 753 - The End Of The Competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After a few days.</p><br/><p>The rating of the ‘Strongest Heavenly Voice’ finally broke into the top 5.</p><br/><p>This was all thanks to Ying Jin. If it weren’t for Ying Jin bringing about so much discussion, this rating definitely would not have broken the top 5.</p><br/><p>To the viewers of Shanghai TV, Ying Jin had finally done something good.</p><br/><p>On the scene.</p><br/><p>“Master Lin,” Zhao Li had become a lot better recently. She was so welcoming when she saw Lin Fan. There wasn’t that aggressiveness that was there initially.</p><br/><p>Ever since Ying Jin left, she had surprisingly turned over a new leaf. Although there were still people online who hated her, a majority of them had forgiven her. This made Zhao Li surprised and happy at the same time.</p><br/><p>She felt that all her efforts had not gone to waste.</p><br/><p>Of course, the situation would not be settled that easily. Her reputation within the circle was affected after she betrayed Ying Jin. However, even so, Zhao Li felt pretty satisfied.</p><br/><p>When Liu Ying Dong found out that Ying Jin had been blocked, he gradually started to communicate with Zhao Li. When things were starting to happen, the first thing he thought about was to protect himself.</p><br/><p>Now that Ying Jin was done with, he was not apprehensive about this anymore. At the same time, he had become more honest. When he saw Lin Fan before the competition started, he was also very respectful and not impudent like before.</p><br/><p>Everyone in the circle knew that Master Lin was a vicious man who did not speak much. He was even able to deal with Ying Jin. If he wanted to deal with them, it would be easy to do.</p><br/><p>However, everyone felt that Ying Jin’s bitter experience was quite a pity. It was not easy to climb up to such a high position and then collapse to the bottom in a flash, out of everyone’s sights.</p><br/><p>The possibility of her turning over a new leaf and coming back was very low.</p><br/><p>This situation had a very big impact. This was especially so since her manager had stabbed her in the back, exposing many dirty secrets. Ever since then, those who had been implicated fiercely before rushed to start repairing public relations, hoping that this situation will have as small of an impact as possible.</p><br/><p>However, are the netizens id*ots?</p><br/><p>Couldn’t they see that something was fishy?</p><br/><p>…</p><br/><p>“‘Strongest Heavenly Voice’ is already in the finals. I don’t want this to end!”</p><br/><p>“Yes, I did not think that time would pass so quickly. I still want to see Master Lin continue performing.”</p><br/><p>“Who do you guys think the champion will be this time? I feel that Master Lin is simply the beneficiary of the students and he has four amazing singers in his hands. Also, I feel that they are the best sounding contestants in the whole competition.”</p><br/><p>“It’s definitely Master Lin. Have you not seen who is Master Lin?”</p><br/><p>“I feel that Chen Rui An has the highest chance of winning.”</p><br/><p>“I feel that Chen Rui An has the best chance. At the start, he had a cold and he still sounded so good. Now that he’s recovered, he sounds even better.”</p><br/><p>“Why so anxious? It’s going to start soon. The finals are tonight.”</p><br/><p>…</p><br/><p>The presenter Cui Wei was already on stage. At this moment, he felt a huge amount of pressure. ‘Strongest Heavenly Voice’ was different from anything he had ever hosted before.</p><br/><p>Especially this Master Lin who frequently came up with different things.</p><br/><p>“Dear audience, today is the finals of the ‘Strongest Heavenly Voice’. All four of Teacher Lin’s contestants have reached the finals. Teacher Zhao has two students and Teacher Huo and Liu only have one. Who is the one with the strongest heavenly voice? We will have to find out.”</p><br/><p>“Now let’s invite Teacher Lin’s student Chen Rui An on stage!”</p><br/><p>…</p><br/><p>Chen Rui An was very happy to reach this far. Even if he did not win, he would not be hurt.</p><br/><p>It was his dream to be able to sing on stage. Also, he was able to get the guidance of Teacher Lin. Although the results were not out yet, he had already managed to sign a contract.</p><br/><p>“Go Rui An! We love you.”</p><br/><p>There was a huge applause. Throughout this period, Chen Rui An had gained quite a number fans.</p><br/><p>In the face of the applause from his fans, he waved them off and indicated to them that he would do this best.</p><br/><p>Wang Ming Yang was sitting on the stage. Since it was the finals, he was also on site. He wanted to see how the people his brother had chosen would turn out.</p><br/><p>Chen Rui An was decent looking and had a good aura about him, making Wang Ming Yang very satisfied. Just as long as he could control himself and push himself, then that would be enough.</p><br/><p>Wang Ming Yang was in a lot of industries. The estate industry was becoming more saturated, and as a result, he started to shift his gaze towards the entertainment industry, ready to earn a lot of money.</p><br/><p>Although he had a lot of talented people under him, the number of performers were pathetic.</p><br/><p>Only Xu Zi Le and Wu Huan Yue were good enough.</p><br/><p>Thus, the talents in his hands were definitely far from enough.</p><br/><p>…</p><br/><p>Huo Jian Xiang turned and looked at Lin Fan and said, “Teacher Lin, who do you think will be the champion this time?”</p><br/><p>Lin Fan laughed and said, “Do I still need to think? It’s definitely going to be one of my students.”</p><br/><p>Huo Jian Xiang shook his head and said, “I don’t think it’s certain. My students are every bit as good as yours.”</p><br/><p>“You only have one student who made it to the finals, what guarantee do you have?” Lin Fan confidently said.</p><br/><p>Huo Jian Xiang helplessly said, “If it wasn’t for all the students wanting to go to you I would have more than one who would make it to the finals.”</p><br/><p>Lin Fan also helplessly said, “That can’t be helped. I’m too charming.”</p><br/><p>Huo Jian Xiang wanted to puke. This was a bullsh*t type of charm. If not for him going out and directly signing contracts with them, these students would not be flocking towards him.</p><br/><p>However, all these didn’t matter. They were just the mentors. Whoever got the champion didn’t matter and as long as they did their job well it would be good enough.</p><br/><p>As far as whether the ‘Strongest Heavenly Voice’ would have a second season, that was uncertain. However, given the current reception, there was a good chance there would be.</p><br/><p>It’s a miracle for a singing competition to break into the top five in ratings during this time.</p><br/><p>Of course, everyone could see that this miracle was related to Master Lin. If it weren’t for Master Lin, the ratings definitely would not have reached such a high level.</p><br/><p>Today was a night of merriment. A countless number of people were at their television and computer screens, all wanting to know which student would be the champion.</p><br/><p>Approaching the end.</p><br/><p>The host, Cui Wei was standing on stage.</p><br/><p>A countless number of people were holding their breaths as the champion was going to be announced.</p><br/><p>Lin Fan took the microphone and shouted, “Little Cui, don’t stall any longer, hurry up and announce it, everyone is so anxious.”</p><br/><p>Everyone cheered along.</p><br/><p>“Yes, hurry up and announce it, we are all so anxious.”</p><br/><p>“Stop stalling.”</p><br/><p>“Don’t go into another commercial, it is killing me.”</p><br/><p>The thing about the ‘Strongest Heavenly Voice’ which annoyed people the most was that every time, at the most critical time, they would have a commercial break. This made them want to kill the organizers.</p><br/><p>However, this time, Cui Wei was very quick.</p><br/><p>“Okay, since Teacher Lin has spoken up, I won’t stall any longer. The champion is…”</p><br/><p>“Chen Rui An!”</p><br/><p>There was a huge uproar.</p><br/><p>Everyone in the crowd started to get excited.</p><br/><p>Lin Fan laughed and applauded, saying, “I said it already. The champion will definitely be from my group and you did not believe me.”</p><br/><p>Zhao Li and Liu Ying Dong were somewhat disappointed but weren’t too sad.</p><br/><p>Even though they announced the second and third places, but compared to the first place, people definitely did not care as much. However, to the contestants, they were already very satisfied.</p><br/><p>Chen Rui An stood on stage. His expression was of complete happiness and excitement.</p><br/><p>“Thank you, Teacher Lin, thank you, everyone, thank you,” Chen Rui An was so emotional that he was about to cry.</p><br/><p>He never thought that he would actually become the champion.</p></div>\n</div>"}