{"title": "Chapter 765 - I No Longer Do Fortune-Telling", "id": 765, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-765-i-no-longer-do-fortune-telling", "volume_title": "Volume 8", "body": "<h1>Chapter 765 - I No Longer Do Fortune-Telling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Just as Lin Fan was deep in thought, someone approached him unexpectedly.</p><br/><p>He Xiao Li stood at the entrance anxiously but her eyes were filled with gratitude.</p><br/><p>“Teacher Lin,” He Xiao Li said. She didn’t know what else to say.</p><br/><p>She had a lot to tell Teacher Lin but she didn’t know how to start.</p><br/><p>“What is it?” Lin Fan didn’t have a good impression of He Xiao Li and he didn’t want to seem too welcoming. However, since she realized her mistakes and regretted her decisions, he was willing to forgive her.</p><br/><p>He Xiao Li bowed to thank him when she saw that Teacher Lin wasn’t really welcoming to her.</p><br/><p>“Teacher Lin, thank you. If not for you, I would have regretted it my whole life. Thank you for letting me come to my senses.”</p><br/><p>Lin Fan looked a little better and he waved his hands, “It’s okay. Just treat your dad well in the future. He’s the only one that treats you so well.”</p><br/><p>He Xiao Li nodded forcefully, “Yes, I will. I’m prepared to let my dad live with me in Shanghai. I’ll never have the same thoughts again.”</p><br/><p>Lin Fan didn’t have much to say to He Xiao Li. This was actually a really small incident to him but it was very important to He Xiao Li.</p><br/><p>It was normal for her to be so grateful for him.</p><br/><p>He Xiao Li knew that Teacher Lin didn’t really want to talk to her. After thanking him, she left immediately.</p><br/><p>Wu You Lan said, “Brother Lin, did you write a song based on her?”</p><br/><p>Lin Fan nodded, “Yeah, it’s her.”</p><br/><p>Wu You Lan looked at the silhouette that had walked far away, “Thankfully you managed to wake her senses up.”</p><br/><p>Lin Fan laughed, “I just happened to see the problem on the streets and I had to help them. This small matter isn’t a problem.”</p><br/><p>“In any case, I just think Brother Lin is the most righteous person,” Wu You Lan praised him.</p><br/><p>Lin Fan felt great, “Of course, does that need to be said? I have a heart of justice and everyone knows that. Who doesn’t know that I, Lin Fan is a righteous person?”</p><br/><p>Zhao Zhong Yang was live streaming this, and when he heard that, he was stunned.</p><br/><p>,,.</p><br/><p>It wasn’t because he felt that Brother Lin said something wrong. It was just that he was praising himself and it was really unbearable.</p><br/><p>The fans in the live streaming room started to write comments.</p><br/><p>“66666…”</p><br/><p>“It’s a form of pleasure to be able to hear Master Lin praise himself.”</p><br/><p>“I really envy Brother Yang for being able to listen to Master Lin’s lessons. I’m so envious.”</p><br/><p>“Master Lin is humorous. However, it’s true. I used both of Master Lin’s songs as my ringtone. From now on, whoever calls me will hear me crying.”</p><br/><p>“^ Impressive, that’s unbeatable.”</p><br/><p>…</p><br/><p>Then, a luxurious car was parked outside. When Fraud Tian saw the car, he became more alert. “A wealthy youngster is here.”</p><br/><p>He loved the wealthy youngsters who were generous. They always gave him stacks of money which made him really happy.</p><br/><p>Usually, not many wealthy youngsters would visit Cloud Street. However, if they were to come to Cloud Street, they would definitely be at Master Lin’s shop.</p><br/><p>Lin Fan took a glance, “This car looks good, it’s probably really expensive.”</p><br/><p>Wu You Lan replied, “I’ve seen this car before. It’s almost $10million. The net worth of this person must be frightening to be able to afford this car. But why would someone like him come to Cloud Street?”</p><br/><p>Fraud Tian replied, “What else? He’s definitely here for us.”</p><br/><p>Zhao Zhong Yang pointed his camera to the luxurious car outside.</p><br/><p>The netizens gasped when they saw it. The car looked formidable. It was really shocking to see such a nice and luxurious vehicle.</p><br/><p>Lin Fan looked at the car and he was suspicious. He wondered who came but the likelihood of the person coming to look for him was high.</p><br/><p>In recent times, there weren’t many people who came to look for him and his life had been rather relaxing.</p><br/><p>The car door opened.</p><br/><p>A middle-aged man walked out from the car. He looked to be in his early sixties. He wore a tuxedo and he looked like a force to be reckoned with.</p><br/><p>“Hey, isn’t this the Director of SAIC Motor Corporation Limited?” Zhao Zhong Yang asked.</p><br/><p>Lin Fan replied, “Do you know him?”</p><br/><p>Zhao Zhong Yang replied, “Yeah, I saw him on a finance and economics programme before. He is a wealthy owner of a large electrical appliance company. His listed company is in the top fifty wealthiest companies in the nation.”</p><br/><p>Some of the shop owners of Cloud Street looked at the luxurious car and wondered which big shot came.</p><br/><p>However, they didn’t recognize him.</p><br/><p>Although some people used the electrical appliances of this big shot’s company before, they didn’t necessarily know him.</p><br/><p>His bodyguards formed a circle and they surrounded him.</p><br/><p>The middle-aged man looked at the signboard of the shop. Then, he nodded and entered the shop.</p><br/><p>Fraud Tian went forward and smiled, “Sir, please…”</p><br/><p>Zhao Zhong Yang immediately switched off his broadcast. He didn’t dare to live stream such a big shot as he was afraid that something bad might happen.</p><br/><p>After all, big shots were always cautious with their actions and words. If he were to mess up and offend him, things would go out of hand.</p><br/><p>Lin Fan just sat there calmly. Although he knew that this man was a big shot, he remained calm.</p><br/><p>“You are…?” Lin Fan took the initiative and asked.</p><br/><p>“Hi, Master Lin. I am Huang Guo Hui, the Director of SAIC Motor Corporation Limited. I am here today to seek your help,” Huang Guo Hui smiled and said.</p><br/><p>Lin Fan smiled, “All I do is sell scallion pancakes. What can I help you with?”</p><br/><p>Huang Guo Hui waved his hand, “I heard that Master Lin’s fortune telling abilities are second to none. Initially, I was doubtful of it but after I did some research, I truly believe it. Therefore, I’m here today to ask if Master Lin could read my fortune. More specifically, for the next three years.”</p><br/><p>Lin Fan smiled and waved his hand, “I’m not reading fortunes anymore. If you’d really like to have your fortune read, you can approach this Master here instead. He is Wu Tian He, the President of the Metaphysics Society.”</p><br/><p>Huang Guo Hui looked at Wu Tian He and smiled, “If he were to help me this time, I’d have met Mr. Wu twice.”</p><br/><p>Wu Tian He looked at him and nodded, “Director Huang’s fortune is really good. I’ve helped to read his fortune ten years ago.”</p><br/><p>Lin Fan didn’t expect Wu Tian He to know Huang Guo Hui.</p><br/><p>It was as if Wu Tian He could tell that Lin Fan was confused. He explained, “Ten years ago, I read Director Huang’s fortune. He is full of wealth and he was destined for a big career. I didn’t expect him to have such a big company now.”</p><br/><p>Lin Fan understood it now. Wu Tian He was famous ten years ago and it wasn’t a surprise that Huang Guo Hui had asked Wu Tian He to read his fortune.</p><br/><p>Huang Guo Hui was at Cloud Street to ask Master Lin to read his fortune.</p><br/><p>He had known about Lin Fan’s existence but he wasn’t a believer. After doing some research, he realized that Wu Tian He had willingly offered his services in the small shop to be a fortune teller. He felt that it was a little strange.</p><br/><p>Although Wu Tian He wasn’t really rich, he was gifted in Metaphysics. Master Lin must have been an extraordinary man to be able to get him to willingly stay in his shop.</p><br/><p>According to his research, Master Lin was said to be way better than Wu Tian He in fortune telling. He could change someone’s life just by reading their fortunes as he could tell what was going to happen. It was extremely law-defying and he could change whatever that was going to happen.</p><br/><p>This shocked Huang Guo Hui and therefore, he decided to come to Shanghai to let Master Lin read his fortune.</p><br/><p>In the past two years, the economy didn’t seem to be very good. He wanted to develop a new real estate but he hadn’t been doing well. He wanted to look for a new target. Hence, he decided to look for Master Lin for his guidance.</p></div>\n</div>"}