{"title": "Chapter 778 - Can't hide the truth", "id": 778, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-778-cant-hide-the-truth", "volume_title": "Volume 8", "body": "<h1>Chapter 778 - Can't hide the truth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At Cloud Street!</p><br/><p>Lin Fan appeared with Elder Dog. but when he reached the shop, he felt that something wasn’t right.</p><br/><p>Wu You Lan cried out in shock, “Brother Lin, isn’t that little dog who was on the news today Elder Dog?”</p><br/><p>Fraud Tian looked at them suspiciously. He had not expected this dog to be so brave. If it hadn’t been for the news, he wouldn’t have been able to tell.</p><br/><p>Lin Fan felt helpless. “You’ve all guessed it, haven’t you?”</p><br/><p>After confirming it.</p><br/><p>Wu You Lan embraced Elder Dog excitedly, looking left and right. “I was wondering yesterday what Elder Dog went through, why he was so dirty and even injured. I never thought that he was a heroic dog who charged into a fire to save an infant.”</p><br/><p>“Woof woof!”</p><br/><p>Elder Dog barked proudly.</p><br/><p>To Lin Fan, if it hadn’t been for the ‘Righteous Pet Food’, Elder Dog wouldn’t have been able to escape from the fire after he went in. Even if he had managed to escape, he would have become a barbecued dog.</p><br/><p>Zhao Zhong Yang took out his phone excitedly. “Everyone on the Internet is looking for Elder Dog right now. If I tell everyone on broadcast, it would be amazing.”</p><br/><p>“Don’t. Don’t ever do that. This matter cannot be spread, otherwise, it would be troublesome,” said Lin Fan hastily. If other people found out that Elder Dog was the little dog who had charged into the fire, Cloud Street would become clogged up with people.</p><br/><p>If that happened, it would be f*cked up.</p><br/><p>He just wanted to live a quiet and peaceful life. How could he allow such a troublesome thing to happen?</p><br/><p>At this moment.</p><br/><p>The surrounding shop owners gradually came over one by one.</p><br/><p>Elder Liang looked at Elder Dog with contemplation in his eyes. “When I saw Elder Dog yesterday, his body was all black as if he had been burned by a fire. Could it be that the dog on the news is Elder Dog?”</p><br/><p>Lin Fan laughed awkwardly, “You must be mistaken, Elder Liang. Look at him, does he really seem like that dog?”</p><br/><p>Woof woof!</p><br/><p>Elder Dog couldn’t stand it. Although one should do good without seeking recognition, he couldn’t just allow his good deed to be overlooked just like that. The good deed had been done by him and he had to admit to it.</p><br/><p>Elder Liang said, “Look, Little Boss. Elder Dog is starting to admit it. I think it must have been Elder Dog.”</p><br/><p>Sister Hong came as well. “Little Boss, was it Elder Dog who did it?”</p><br/><p>Elder Chen said, “Yeah, we saw Elder Dog all black yesterday. I must have been Elder Dog.”</p><br/><p>Lin Fan saw that he could not hide it anymore. He was at a loss. “Shh, be quiet. Don’t be so open about this incident. It’s not good.”</p><br/><p>At that moment, the crowd understood. It seemed that Master Lin didn’t want people to know. But after thinking about it, they agreed with Master Lin. For a dog to be so brave and fierce, it would shock everyone. If people found out, things would be unimaginable.</p><br/><p>“What’s the situation on the Internet right now?” asked Elder Liang.</p><br/><p>Lin Fan shook his head, “I’m not sure. I don’t know if it’ll be discovered.</p><br/><p>Zhao Zhong Yang said, “I feel that it’s dangerous. Elder Dog has previously appeared on the news before and he even has his own fan club. Although there aren’t many people inside and quite some time has passed since then, it’s hard to say if they will discover this.”</p><br/><p>Indeed.</p><br/><p>After hearing Zhao Zhong Yang’s analysis, Lin Fan felt that it was very likely to happen. One should never underestimate the netizens of the Internet.</p><br/><p>If they really want to find the truth, they’ll even dig out news from ten years ago.</p><br/><p>On the Internet.</p><br/><p>“After watching the video, my blood is pumping. Although it’s just a dog, this dog is a hero in my heart.”</p><br/><p>“Let those people who look down on mutts see this. This is an authentic Chinese Countryside Dog from our great country of China. Can those other dogs, who only know how to eat, drink and destroy things, even compare to it?”</p><br/><p>“There is no comparison. Those dogs would run away once they see the fire.”</p><br/><p>“I don’t care about other people but if any of my friends dare to ask me out to eat dog meat in future, I’ll cut them to death.”</p><br/><p>“Since you say it like that, you must have really liked eating dog meat in the past.”</p><br/><p>“You shouldn’t look back at the past. Let’s not talk about this. I’m going to go buy some paper money to burn.”</p><br/><p>“Does anyone know who this dog belongs to?”</p><br/><p>“No idea. There are so many mutts in the country, Who would know which family it belongs to?”</p><br/><p>“Stop looking for him. He has already been added to a pot and cooked by me. I’ll show you some photos.” A netizen satirically sent a few photos of a mutt being thrown into a pot.</p><br/><p>At this moment, netizens who saw the photo could not stand it.</p><br/><p>“F*ck your mom, you f*cking idiot!”</p><br/><p>“Did you try so hard to become famous that you became crazy? Don’t let me find out who you are. Otherwise, I’ll kill you.”</p><br/><p>“His identity is already out. This guy is a university student studying at XX University and staying in XX Hostel.</p><br/><p>This satirical person had probably not expected himself to be taught a lesson by the other netizens so quickly.</p><br/><p>Everyone on the Internet was searching for that mysterious mutt.</p><br/><p>On that evening.</p><br/><p>A certain animal expert was being a guest on a talk show.</p><br/><p>“According to the situation shown in the video, this Chinese Countryside Dog is very clever. It must have been through training, otherwise, it wouldn’t have been able to do all this. And what makes me even more surprised is that this dog isn’t big but he was able to bring the infant down to the ground floor from the 21st floor. I just can’t understand this part.”</p><br/><p>The host said, “You mean that this Chinese Countryside Dog is very unusual?”</p><br/><p>“Yes, it is very unusual. Just from this incident, you can tell that this dog is very pragmatic. Its intelligence can be considered the highest among all dog breeds. Even trained and specialized dogs cannot compare.”</p><br/><p>The host said, “But according to our knowledge, Chinese Countryside Dogs have one of the lowest intelligence levels among all dog breeds in the world. How did this dog become so clever?”</p><br/><p>The expert smiled, “There’s actually nothing much to it. There are clever dogs and stupid dogs just like with humans. Not everyone can be clever. Hence, I have never believed in such rankings of intelligence.”</p><br/><p>This topic was very hot on the Internet.</p><br/><p>Chinese Countryside Dogs had become popular. Countless people who used to look down on Chinese Countryside Dogs had developed new attitudes towards them.</p><br/><p>And just within a day…</p><br/><p>Something even more terrifying happened.</p><br/><p>Some dog meat shops that ran at night received unexpected guests. In the end, the conflicts were only resolved when the police arrived.</p><br/><p>And such incidents were happening across the country. A campaign to protect Chinese Countryside Dogs had begun.</p><br/><p>But still, no one found that little dog who appeared in the video.</p><br/><p>The next day!</p><br/><p>Cloud Street.</p><br/><p>Lin Fan opened the news.</p><br/><p>When he saw the news headlines, he was completely flabbergasted.</p><br/><p>‘The dog who charged into a fire to save an infant has become famous.’</p><br/><p>‘Experts say that this dog has very high IQ. It may even have surpassed IQ of a thirteen-year-old teenager.’</p><br/><p>‘The heroic dog’s true identity.’</p><br/><p>‘A woman who drives a BMW says that she saw that mutt before the fire happened. It helped her to expose a scam.’</p><br/><p>On the Internet.</p><br/><p>“Did you see the news? Before going to the scene of the fire, the heroic dog appeared on a certain road.”</p><br/><p>“I saw it. With some speculation, we will be able to find out where this dog came from.”</p><br/><p>“Wait, I just remembered something. I’ve watched the video tens of times and I realized that this dog looks particularly similar to a dog I’ve seen before. Wait a moment. Let me find the news article from that time.”</p><br/><p>“^Is this true? Everyone here is searching for the dog right now. Don’t try to cheat us.”</p><br/><p>“I’d be a b*stard if I tried to cheat you. I really just thought about it. Wait for me. I’ll find that news article. You guys can take a look if it’s true.”</p><br/><p>What Lin Fan was most worried about had happened.</p><br/><p>In the face of countless netizens who were searching for the truth, paper cannot be used to contain the fire.</p></div>\n</div>"}