{"title": "Chapter 777 - Elder Dog becomes famous!", "id": 777, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-777-elder-dog-becomes-famous", "volume_title": "Volume 8", "body": "<h1>Chapter 777 - Elder Dog becomes famous!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In front of the television.</p><br/><p>Countless citizens were sitting at their dining tables, watching the television. When they saw this scene, they were completely dumbfounded.</p><br/><p>“Is this news network broadcasting the wrong news?”</p><br/><p>“A mutt charged up to the 21st floor and brought that infant down. I want to ask, how is this possible?”</p><br/><p>“This is unimaginable.”</p><br/><p>Those who were sitting at their dining tables almost spat out all the food in their mouths.</p><br/><p>To them, these news networks usually broadcast legit news. How could they broadcast such a thing?</p><br/><p>Using their brains to think, they arrived at the conclusion that it wasn’t possible.</p><br/><p>The news had not come out on the Internet yet. However, small snippets of information were already spreading.</p><br/><p>Wechat groups.</p><br/><p>QQ groups.</p><br/><p>Etc.</p><br/><p>Various social media platforms were filled with talk about this incident.</p><br/><p>Some believed it while some immediately said that it wasn’t possible.</p><br/><p>If there’s no picture, it’s not true. Although the news channels had already broadcasted it, it still made people suspicious.</p><br/><p>Discussions swept across the Internet.</p><br/><p>At the news agency.</p><br/><p>“Everyone will work overtime tonight. We have to rush this piece of news.”</p><br/><p>“Got it.”</p><br/><p>“This mutt is really amazing. It actually rescued that infant.”</p><br/><p>“If we didn’t have this on-site video, I really wouldn’t believe it.”</p><br/><p>“But this video was really expensive. We spent a thousand dollars to obtain it.”</p><br/><p>“It’s our fault for not taking a video at the scene. We only captured some photos.”</p><br/><p>…</p><br/><p>Just as the discussions were burning up outside, Lin Fan started studying Elder Dog.</p><br/><p>Lin Fan spread Elder Dog’s four limbs and looked left and right. However, he couldn’t find anything different.</p><br/><p>“It looks like it’s deeply hidden,” mumbled Lin Fan to himself. Elder Dog’s current state definitely did not seem right.</p><br/><p>Elder Dog barked.</p><br/><p>“I want to eat that thing from yesterday.”</p><br/><p>Lin Fan got momentarily pissed. “F*ck, you really have high requests. Do you know how expensive that thing was? You actually want to eat it again.”</p><br/><p>The first-grade Encyclopedic Department Store was really powerful.</p><br/><p>That ‘Righteous Pet Food’ cost 100 Encyclopedic Points. When it reaches grade two, wouldn’t it be nature-defying?</p><br/><p>*sob sob*</p><br/><p>Elder Dog was very upset.</p><br/><p>“Alright, alright, I’ll give you one more grain.” Lin Fan wanted to see for himself what changes Elder Dog would undergo after eating the ‘Righteous Pet Food’ as well.</p><br/><p>He endured the pain of exchanging his Encyclopedic Points for the ‘Righteous Pet Food’ again.</p><br/><p>100 Encyclopedic Points were gone just like that.</p><br/><p>When Elder Dog saw it, his eyes lit up. He immediately placed the pet food in front of his face and licked it.</p><br/><p>“Stop licking it. Hurry up and swallow it.” Lin Fan didn’t want to see Elder Dog licking it. He wanted to see want kind of nature-defying effects it had.</p><br/><p>Elder Dog seemed not to hear this as he continued licking it maniacally.</p><br/><p>Lin Fan couldn’t stand it any longer. Then, he said sternly, “Just try licking it one more time. If you do, don’t even think about eating it anymore in future.”</p><br/><p>To Elder Dog, if he couldn’t eat this delicious ‘Righteous Pet Food’ anymore, it would be the same as dying.</p><br/><p>Then, under Lin Fan’s gaze, he swallowed the ‘Righteous Pet Food’ in one go.</p><br/><p>Lin Fan stared unblinkingly at him. Where’s the miracle? There must be something unusual.</p><br/><p>In an instant.</p><br/><p>Elder Dog, who had been perfectly fine, suddenly fell to the ground. His four dog limbs were erect as he kept on twitching.</p><br/><p>“Oh d*mn. Something like this could happen?” Lin Fan wasn’t worried at all. Elder Dog had already eaten one grain the previous day and he had been fine. This proved that there were no problems with the pet food.</p><br/><p>At that moment, Lin Fan realized that the fur that he had just cut that day were starting to slowly grow out again.</p><br/><p>Those paws that had been hurt were gradually healing.</p><br/><p>A slight glow surrounded Elder Dog. with Lin Fan’s current abilities, he could feel a kind of mysterious power changing Elder Dog’s physique.</p><br/><p>The effect of the Great Animal Spell was to seize Elder Dog.</p><br/><p>Then, this ‘Righteous Pet Food’ was to raise Elder Dog’s ability.</p><br/><p>This process continued for close to an hour before it slowly died down.</p><br/><p>Elder Dog lay on the ground and slept. He seemed to be digesting it. Lin Fan didn’t interrupt. He now understood that this ‘Righteous Pet Food’ was not normal.</p><br/><p>It was really worth the 100 Encyclopedic Points.</p><br/><p>…</p><br/><p>The next day!</p><br/><p>The news about Elder Dog’s rescue had spread everywhere.</p><br/><p>Weibo.</p><br/><p>“D*mn! D*mn!”</p><br/><p>“Is this news true? It doesn’t seem possible at all.”</p><br/><p>“I woke up to this piece of news early in the morning. I didn’t even eat my breakfast, I just stared at my phone with my mouth gaping.”</p><br/><p>“When did this happen? It couldn’t have happened yesterday, right?”</p><br/><p>“It did happen yesterday. I was there when it happened. Our flat was on fire and the fire spread from the 24th floor to the 20th floor. And this infant was on the 21st floor at the time. Even the firefighting team had given up hope because the infant really could not be saved. Then, a mutt that came from nowhere ran up and came back down soon after, carrying an infant in its mouth.”</p><br/><p>“This is mystical. It’s a miracle!”</p><br/><p>“All this is true. There are photos, videos, everything. I saw it for myself. Otherwise, I wouldn’t have believed it.”</p><br/><p>When they saw the news on the Internet, everyone was shocked.</p><br/><p>They felt as if it was inconceivable.</p><br/><p>The news was telling them that a mutt had charged up 21 floors and rescued an infant. They simply could not picture this in their minds. How had this dog gotten through the fire in the building? And how had it withstood the heat?</p><br/><p>Most importantly, how had the dog brought out the infant from the fire and still come out alive? To them, this was simply impossible.</p><br/><p>If it had been a human instead of a mutt in this piece of news, perhaps it would have made the top ten trending list. However, because it was a mutt, it became number one on trending.</p><br/><p>Countless people saw the news and were astounded.</p><br/><p>Especially after opening Baidu and doing a search, various news headlines appeared.</p><br/><p>‘The bold and powerful godly dog charged into the fire and rescued the infant to safety.’</p><br/><p>‘Breaking! Mutt charged into a fire. The real reason he went in is…’</p><br/><p>‘The entire nation is searching for the courageous Chinese Countryside Dog.’</p><br/><p>…</p><br/><p>Dog-lovers.</p><br/><p>“Everyone, spread the news. Look, this is the kind of dog that people are eating.”</p><br/><p>“When I saw the news, I was so moved that I didn’t know what to say. I really love this courageous little dog. It charged into the fire courageously and saved the infant.”</p><br/><p>“When I reached the end of the article, I was almost crying. Look, that originally clean and white little dog came out pitch-black. Even his paws were injured.”</p><br/><p>“What happened afterward? Does anyone know where this dog is now?”</p><br/><p>“No idea. After this dog rescued the infant, it left. No one knows where it went.”</p><br/><p>Then, something even more insane happened.</p><br/><p>Someone formed the Heroic Godly Dog organization. In this organization, everyone was a fan of the dog in the video.</p><br/><p>“Requesting for information on this dog’s current location. If anyone knows, I’m willing to pay ten thousand dollars.”</p><br/><p>“What a courageous little dog. I want to bring it home.”</p><br/><p>“There are many people who want to bring it home now. A dog that understands human nature and can save people. I’m afraid everyone will fight over it.”</p></div>\n</div>"}