{"title": "Chapter 774 - Hopeless", "id": 774, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-774-hopeless", "volume_title": "Volume 8", "body": "<h1>Chapter 774 - Hopeless</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Elder Dog dashed along the road, then stopped. He sniffed the air.</p><br/><p>Dogs have very sensitive noses and they are able to smell things that humans are not. Elder Dog realized that his nose seemed to have become even more powerful. He could now smell things that he couldn’t before.</p><br/><p>Moreover, he could smell things from very, very far away.</p><br/><p>Suddenly, Elder Dog’s gaze was fixed on his front. He had smelled a strange scent. Although it was very far away, he was sure that he smelled it.</p><br/><p>He even smelled the smell of terror emitted by humans.</p><br/><p>Woof woof!</p><br/><p>Elder Dog started dashing at a high speed. The more he ran, the faster he got. He surpassed the speed of a typical dog.</p><br/><p>If Lin Fan was here, he would definitely cry out in shock.</p><br/><p>This was f*cking impossible.</p><br/><p>This speed was too great. It wasn’t a speed that a dog should be able to achieve. He was probably even faster than a cheetah, which was supposedly the fastest in the animal kingdom.</p><br/><p>A cheetah’s speed could reach 100km/h in just a few seconds.</p><br/><p>And Elder Dog had probably already achieved that.</p><br/><p>Moreover, even as he ran, Elder Dog didn’t seem tired at all. He seemed to not even be using any physical strength.</p><br/><p>The previous night’s Great Animal Spell had not been useless. In fact, it had been very useful. But that ‘Righteous Pet Food’ had had an even greater effect. Otherwise, how could it have been so expensive for just one grain?</p><br/><p>Lin Fan hadn’t thought too much. Otherwise, he would have realized that there was no way the Encyclopedia’s Department Store would sell something useless at such a high price.</p><br/><p>In this Department Store, the ‘Righteous Pet Food’ could be considered one of the most expensive items.</p><br/><p>If it was solely for filling one’s stomach, then it would be trash.</p><br/><p>…</p><br/><p>Fire engine sirens rang out on the road.</p><br/><p>The cars on the road all moved aside. The drivers had all already seen that thick black smoke ahead and they knew that a fire must have started somewhere. Hence, they all moved aside for the fire engine to pass.</p><br/><p>In front of a twenty-something-story building, the sky was covered with black smoke. The fire was getting more and more intense.</p><br/><p>Many people in the building immediately went down when they discovered the fire. Especially because it was during the working hours, not many people were inside.</p><br/><p>Even the people inside had all ran out.</p><br/><p>Some of them were wearing just their underwear as they stood below the building, looking at the scene. Their jaws had dropped. How did this fire start all of a sudden?</p><br/><p>The fire engine had reached and they had started evacuating the public. They were in the midst of firefighting.</p><br/><p>“Chief, we’ve confirmed that all the residents have been evacuated,” reported one of the firefighters.</p><br/><p>“What’s the situation inside?” asked the Chief.</p><br/><p>“This apartment building is newly-built. It hasn’t been fully occupied yet. We’ve just informed the gas company to turn off the gas supply to this block in order to prevent an explosion. However, some of the residents don’t have gas pipes installed and they’re still using gas cylinders. If the fire becomes too intense, it might cause an explosion.”</p><br/><p>“Right now, the flames are mainly concentrated on the twenty-first, twenty-second, twenty-third and twenty-fourth floors. According to insiders, the fire started on the twenty-fourth floor and it has already spread to the twenty-first floor.”</p><br/><p>Bam!</p><br/><p>Just as he said this, an explosion happened on the twenty-second floor.</p><br/><p>It completely shattered the windows on the outside and shards of glass came crashing down from the sky.</p><br/><p>In the building, a team of firefighters had already gone in to tackle the fire.</p><br/><p>Over the walkie-talkie.</p><br/><p>“Chief, the fire inside is too strong and the smoke is too thick. We can’t see the path ahead,” said a firefighter as he panted heavily. The lift could not be taken anymore. Going up there through the staircase had used up too much of their energy, especially with all the equipment they were carrying. They could no longer push on.</p><br/><p>Bam!</p><br/><p>From the walkie-talkie came another explosion sound.</p><br/><p>The Chief looked up and saw that another household had exploded. He couldn’t help but become worried. “Hurry up and retreat.”</p><br/><p>At that moment, a cry of shock emerged from the crowd.</p><br/><p>“Look! The fire is spreading. It has reached the twentieth floor.”</p><br/><p>The Chief took a look and became anxious. The direction of the wind was not in their favor and it was causing the fire to spread very quickly. Especially because this was a residential building, there were many flammable objects.</p><br/><p>Also, he had just received a piece of information. This was considered a high-grade apartment building. Many residents used wooden interior decorations. Even the furniture and walls were made using real wood. These were all made of an exceptionally flammable material.</p><br/><p>Soon after.</p><br/><p>The firefighters emerged from the building.</p><br/><p>Each of them seemed to be drained. They were really too exhausted. All these equipment they were carrying were very heavy. Especially with the climbing of stairs, it made them even more exhausted.</p><br/><p>The water cannon was shooting a stream of water from the outside. Although it had temporarily suppressed the fire, it could not control it.</p><br/><p>At this moment, a firefighter ran over in a panic. “Chief, not good, a man just said that his two-month-old child is still in the building.”</p><br/><p>“What?” When the Chief heard this, he was dumbfounded. “Hurry up and bring him here.”</p><br/><p>Then, a young couple ran over frantically. Before the Chief firefighter asked anything, they said, “We stay in room 2103 on the twenty-first floor. Our child is still in the bedroom. Hurry up and save him!”</p><br/><p>The young couple was completely in a panic. When the man had found out about the fire, he had immediately rushed back. Meanwhile, the woman had been out to buy vegetables, leaving their child in the cradle. She had not brought their child out. When she saw the building on fire, she ran back frantically.</p><br/><p>The Chief firefighter was dumbfounded. He had not expected that there would be an infant left inside. How had this happened?</p><br/><p>Infants have weaker respiratory systems. If the baby was to stay inside for too long, even if the fire didn’t burn it to death, the smoke would choke it to death.</p><br/><p>At that moment, the Chief firefighter didn’t think too much. He had only one thought and that was to dispatch someone to break in through the window on the twenty-first floor.</p><br/><p>*wailing sound*</p><br/><p>The young mother was so frightened that she fell to the ground, paralyzed with fear. Then, she wanted to charge into the building but she was stopped by the firefighters.</p><br/><p>The man, on the other hand, was able to maintain his calm. However, you could tell from his frantic expression that he was very nervous too.</p><br/><p>The crowd was very worried as well.</p><br/><p>“There’s still an infant on the twenty-first floor. Will he be able to survive?”</p><br/><p>“I don’t know. The fire is very big now. I feel that he’s in danger.”</p><br/><p>“Argh, why wasn’t there an adult at home. If there was someone at home, the baby could have been carried down.”</p><br/><p>“Who would have expected a fire?”</p><br/><p>Woof woof!</p><br/><p>At that moment, Elder Dog Nicholas appeared. He barked a few times before charging towards the building’s staircase.</p><br/><p>When one of the townsfolk saw the dog, he shouted, “A dog just ran in!”</p><br/><p>“Come out, little dog. There’s a fire!”</p><br/><p>But very soon, the dog had disappeared.</p><br/><p>When Elder Dog Nicholas reached the scene, he smelled that something was wrong.</p><br/><p>He could smell an infant’s scent in the building. The scent belonged to a human. As the Righteous Elder Dog Nicholas, how could he just watch and do nothing as someone was dying?</p><br/><p>That righteous mission spurred him on. He had to accomplish this rescue mission.</p><br/><p>Meanwhile, everyone else wasn’t concerned about the life of a dog. They were completely focused on looking at the twenty-first floor.</p><br/><p>The firefighters started to get to work.</p><br/><p>But an embarrassing thing happened.</p><br/><p>“Chief, there’s trouble. Our ladder can only reach up to 56 meters. It can’t reach the twenty-first floor at all,” said one of the firefighters nervously.</p><br/><p>“Use the water cannon to extinguish the fire or reduce the flames. Enter from the eighteenth floor.”</p><br/><p>Bam!</p><br/><p>Just as he finished saying this, another explosion happened. It caused the ladder to start shaking. It could not get close to the building at all.</p><br/><p>At this moment, everyone was panicking.</p><br/><p>Especially to the firefighters, this challenge was too great.</p><br/><p>The child’s father could not take it any longer. He fell to the ground and stared emotionlessly at the flame-engulfed building.</p><br/><p>“It’s hopeless…”</p></div>\n</div>"}