{"title": "Chapter 787 - It's nothing much", "id": 787, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-787-its-nothing-much", "volume_title": "Volume 8", "body": "<h1>Chapter 787 - It's nothing much</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the conference room.</p><br/><p>“You saw that too. We can’t do anything about it besides seeking help from the leader.” Lin Fan looked at Leader Wang helplessly. This matter wouldn’t be resolved by an average citizen.</p><br/><p>Unless they were to go to arbitration.</p><br/><p>However, who could afford to waste so much time?</p><br/><p>Leader Wang was frustrated. This matter was really troublesome and even he might be useless for it. However, the reporters were all waiting. If he were to do nothing about it, things were going to get worse.</p><br/><p>“I’ll make a call to ask about it,” Leader Wang said. Then, he dialed the number that was given.</p><br/><p>The phone call got through.</p><br/><p>“Hello, is this Manager Wu? I am the director of the Ministry of Manpower, Wang Shan.” He had the ‘accent’ of a government official and one would know he was a public service leader after hearing his voice.</p><br/><p>Indeed, Manager Wu was stunned. He immediately greeted politely, “Hi, Leader Wang.”</p><br/><p>“What is happening at the construction site in Chao Hai Road? Why aren’t the workers paid? You have to know that we care a lot about the workers’ salary problems. The documents have been passed down the chain of command,” Leader Wang said.</p><br/><p>Manager Wu didn’t know what to say. “Leader, you don’t know how helpless we are. We signed a contract with external companies and we gave them the funds on time. They didn’t give the salaries and we can’t do anything about that. They can only look for the labor services company. I hope Leader Wang can understand our situation.”</p><br/><p>Manager Wu dared to speak rudely to Lin Fan but didn’t dare to do so to Wang Shan. After all, he was a leader from the Ministry of Manpower.</p><br/><p>Of course, this was just a temporary show since it involved his interests. Perhaps he wouldn’t have given face if it didn’t concern him.</p><br/><p>Wang Shan said, “So, does that mean that you don’t care about this?”</p><br/><p>Manager Wu continued to act, “We want to be involved but we don’t have the power to do anything. We signed a contract with the construction company. Everything has been given to them. Hence, we really can’t do anything about their salaries.”</p><br/><p>“Alright, let’s go to labor arbitration then.” Wang Shan didn’t want to talk too much. As the leader, he knew what the problem was.</p><br/><p>It was just that arbitration needed time and he had to think of something to temporarily resolve the shortage of funds.</p><br/><p>Manager Wu was stunned after hearing that, “Leader Wang, wait. Do we have to go there?”</p><br/><p>Wang Shan said, “Let me ask you this. Did you develop that plot of land?”</p><br/><p>“Yes. It’s developed by our company,” Manager Wu admitted.</p><br/><p>“Then that’s good. This time, the workers have come here to complain about their salaries. The government takes this very seriously. We have the right to be doubtful of your company’s ability. We will seriously consider this and assess your company to see if it is useful to the development of Shanghai,” Wang Shan said with a stern tone.</p><br/><p>This matter wasn’t really serious initially but Master Lin and the reporters had joined in.</p><br/><p>If this were to be reported, things would definitely go out of hand.</p><br/><p>If he didn’t do anything, who knew what the reports would say about him?</p><br/><p>They might say that the person in charge was incapable.</p><br/><p>If so, people would definitely lose their jobs.</p><br/><p>With respect to the situation with the Mother Earth Real Estate Corporation, the Ministry of Manpower didn’t have any power to handle it. However, other departments will not be quiet about it.</p><br/><p>Manager Wu wasn’t stupid. When he heard that, he was anxious.</p><br/><p>“Leader Wang, that…”</p><br/><p>He hadn’t finished his sentence but Leader Wang had hung up the call.</p><br/><p>Wang Shan sighed, “Everyone, the Ministry of Manpower would definitely follow up with this problem. I will send someone to the labor services company, construction company, and real estate developers to discuss with them about this.”</p><br/><p>He was prepared to invite them over for ‘tea’.</p><br/><p>This was at least something for the workers.</p><br/><p>The workers were really satisfied with what he did.</p><br/><p>They had been to the Ministry of Manpower but all they did was fill in some forms. Then, the people just pushed the blame around before everything returned to ground zero. However, now a leader was involved and even reporters were there too.</p><br/><p>They felt that they had to thank Master Lin. If not for him, they wouldn’t have been able to reach this stage.</p><br/><p>Lin Fan didn’t expect the problem to be so complicated and difficult to handle.</p><br/><p>Young Zhao said, “Master Lin, thank you so much.”</p><br/><p>Lin Fan waved his hand, “What for? This matter isn’t resolved yet. When it is over, you can thank me then.”</p><br/><p>Young Zhao smiled and didn’t say anything else but he was really happy. He was determined to be a hardcore fan of Master Lin.</p><br/><p>“Leader Wang, thank you so much,” Lin Fan said.</p><br/><p>Wang Shan said, “Master Lin, I will definitely watch over this and give you an answer in three times. Alright?”</p><br/><p>“Yes.”</p><br/><p>They left the headquarters of the Ministry of Manpower.</p><br/><p>However, this matter was far from over. They had to follow up with it closely.</p><br/><p>In the car.</p><br/><p>Lin Fan was furious, “D*mn it, I get angrier the more I think about it.”</p><br/><p>Zhao Zhong Yang said helplessly, “What can we do? We have to follow the chain of command.”</p><br/><p>Lin Fan didn’t say anything. He just ranted on Weibo.</p><br/><p>“What’s the point of Mother Earth Real Estate Corporation developing estates when the company has no money? They didn’t give the workers their salaries and kept pushing the blame around. It isn’t an honest company. Everyone, please take note when you’re buying houses.”</p><br/><p>He said it really directly.</p><br/><p>Others wouldn’t have dared to say it so directly. They were afraid of being sued.</p><br/><p>However, Lin Fan wasn’t afraid. If they dared to sue him, he was confident of going against them.</p><br/><p>On Weibo.</p><br/><p>“D*mn, Master Lin seems really furious today.”</p><br/><p>“Yeah, I haven’t seen Master Lin so furious before.”</p><br/><p>“What is Mother Earth Corporation doing? They actually made Master Lin so angry.”</p><br/><p>“Those that owed salaries deserved to die.”</p><br/><p>…</p><br/><p>At night.</p><br/><p>At a random luxurious feast.</p><br/><p>Zhou Guo Sheng was the boss of Mother Earth Real Estate Corporation.</p><br/><p>He was eating with a bunch of directors and they were discussing some corporate matters.</p><br/><p>One of the directors smiled, “Director Zhou, your company got in the headlines today.”</p><br/><p>Zhou Guo Sheng smiled, “What is it? Why didn’t I know anything about it?”</p><br/><p>“Director Zhou, you really don’t know about it?”</p><br/><p>Zhou Guo Sheng replied, “I really don’t know anything. Tell me, what is it?”</p><br/><p>“Look at Master Lin’s Weibo. The matter was blown up. I’m impressed by your calmness.”</p><br/><p>Zhou Guo Sheng was confused. He took out his phone and looked at Weibo.</p><br/><p>He was a rather frequent user of Weibo and he knew who Master Lin was. However, when he saw the post, the smile on his face slowly disappeared.</p><br/><p>Owed salaries?</p><br/><p>How could that be?</p><br/><p>However, there were other directors around and Zhou Guo Sheng didn’t want to seem too agitated. He placed his phone down and faked a smile.</p><br/><p>“Nothing much, this is a small matter. I don’t know what Master Lin is doing. Let’s eat and drink. Let the others resolve this.”</p><br/><p>One of the directors smiled, “Elder Zhou, are you really not going to care about this? Master Lin isn’t really a kind man. If he were to start flaming you on Weibo, things are going to get worse.”</p><br/><p>“What’s the point of caring about this? We are real estate developers. The houses are there. They’d be there regardless of whether people buy them or not. How could this affect their decisions? This will be resolved by tomorrow.” Zhou Guo Sheng sounded really calm.</p><br/><p>Although he was furious, he didn’t seem to care too much about it.</p></div>\n</div>"}