{"title": "Chapter 797 - Going home", "id": 797, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-797-going-home", "volume_title": "Volume 8", "body": "<h1>Chapter 797 - Going home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Mama Lin asked, “What’s going on?”</p><br/><p>Papa Lin was dumbfounded as well. “I don’t know. He didn’t tell me about this.”</p><br/><p>“Grandpa Zhao…” The children immediately ran over excitedly when they saw Zhao Ming Qing. Usually, Grandpa Zhao would come here to check on their bodies. He would even teach them some knowledge about Chinese Medicine. The children really liked him very much.</p><br/><p>Zhao Ming Qing smiled with his eyes squinted. He quickly took out a bag. It seemed that he had come prepared.</p><br/><p>He gave the children one red packet each.</p><br/><p>People who dared to come to the Children’s Welfare Institute for a New Year visit were all wealthy people and courageous people. Without giving at least ten thousand dollars, they wouldn’t be able to leave.</p><br/><p>“Lil’ Fan, what’s going on?” asked Mama Lin worriedly. Had her son cheated this old man? This man was so old but he was her son’s disciple. If other people knew about this, wouldn’t he be scolded?</p><br/><p>Lin Fan knew why his Mom was asking this. He smiled, “Mom, it’s not a problem. Ming Qing is the Director of the Chinese Medical Academy. He studies Chinese Medicine and my Chinese Medical achievements are greater, so I took him as my disciple so we can discuss Chinese Medicine together.”</p><br/><p>In the past, Zhao Ming Qing might not have been the best in the country at Chinese Medicine but after this period of learning, he had basically obtained that title of the best. Of course, that’s if you don’t take Lin Fan into consideration.</p><br/><p>“When did you learn Chinese Medicine?” Mama Lin looked at Lin Fan in surprise. She felt that this son of her’s was too mysterious. Why hadn’t she known about all this in the past?</p><br/><p>However, all parents hope for their children to be amazing. Hence, she was very pleased.</p><br/><p>Zhao Ming Qing looked at his teacher’s parents and went forward to warmly greet them. This greeting made Papa Lin and Mama Lin a little embarrassed but to Zhao Ming Qing, it was only right.</p><br/><p>Zhao Ming Qing’s children sighed. They had become used to their father being the disciple of a young man and they had accepted it. They understood Lin Fan’s abilities. He was really a talented and knowledgeable person.</p><br/><p>However, he was just too young. When they weren’t with their father, they didn’t feel much but under their father’s gaze, they could only force themselves to go forward and deliver their New Year wishes.</p><br/><p>“Master Lin, we’re here to pay you a New Year visit.” At that moment, cars arrived outside.</p><br/><p>He Cheng Han had come with his son.</p><br/><p>He was now very pleased with his son. His son had started working from the very bottom of his company and become more mature. This was all thanks to Master Lin.</p><br/><p>If Master Lin hadn’t given him counsel, he would probably never have seen his son turn over a new leaf.</p><br/><p>“Happy New Year, Chief He,” said Lin Fan with a smile.</p><br/><p>Soon after, the entrepreneurial bosses arrived. This made the Welfare Institute become even more lively and each of them had brought red packets for the children.</p><br/><p>As for how much there was in each red packet, who knew? But each person had probably tens of thousands in total into those red packets.</p><br/><p>This put Lin Fan at a loss for words.</p><br/><p>At night.</p><br/><p>Mama Lin had not recovered from the shock of what happened in the day. She had not thought that her son actually knew so many people.</p><br/><p>“Lil’ Fan, who were those people that came today?” asked Mama Lin.</p><br/><p>Looking at those people’s vehicles and clothing, they were clearly not average people. Moreover, they gave so generously and were so friendly with Lin Fan as if they had known him for a long time.</p><br/><p>Papa Lin nodded, “Yeah, yeah. Although we don’t know them, your Dad knows that all those cars were not cheap.”</p><br/><p>Lin Fan said helplessly, “They’re all friends of mine and they’re pretty good people. They knew that I didn’t go back to our old home for the New Year so they came to pay a visit. No need to think too much. There’s not much to it.”</p><br/><p>These words managed to calm his parents down as they didn’t know about the situation. But if outsiders were to find out about it, they would be shocked.</p><br/><p>If one was to kidnap any of those people, one would become rich.</p><br/><p>In fact, one would become very rich.</p><br/><p>“Make sure you don’t make friends with bad people,” said Mama Lin worriedly.</p><br/><p>Lin Fan smiled, “You don’t have to worry. How could you not trust your own son? These aren’t bad people. They’re all friends. And the fact that the Welfare Institute has been able to run so smoothly is thanks in part to their help as well.”</p><br/><p>“That’s good, that’s good.” After getting reassurance, his parents could relax for now.</p><br/><p>They were really afraid of their son meeting bad people or getting bad influence.</p><br/><p>The second day of the New Year.</p><br/><p>Lin Fan woke up early in the morning and prepared to drive back to Zhongzhou with his parents.</p><br/><p>Meanwhile, Wu You Lan and the rest were at the Welfare Institute, helping Director Huang to take care of the children.</p><br/><p>In Lin Fan’s view, it seemed at after the New Year celebrations, it seemed that this New Year was going to be even better.</p><br/><p>He had to put in the extra effort and work hard as well.</p><br/><p>In the afternoon.</p><br/><p>They finally arrived in Zhongzhou.</p><br/><p>When they reached the apartment block, the air was filled with the flavor of Chinese New Year.</p><br/><p>“Let’s go. We’re going to pay your Uncle Li a New Year visit.” When they reached home, Papa Lin was in a pretty good mood. It seemed that he was very happy that he was going to see Elder Li.</p><br/><p>He had many things he wanted to say. He had experienced many things in Shanghai and he had to brag about them to Elder Li.</p><br/><p>Mama Lin scolded him, “We’ve just got home and you can’t wait to go to Elder Li’s place already. Let me tell you, don’t show off in front of him. There’s nothing wrong if it’s just you and Elder Li but his son and wife will be around as well. Don’t let them have any bad opinions about us.”</p><br/><p>Papa Lin said, “I know. No need for you to tell me. I know it myself.”</p><br/><p>Upstairs, they rang the doorbell.</p><br/><p>“Elder Li, open up!” Papa Lin shouted as he stood outside the entrance. Soon after, a voice came from inside, “Coming, coming.”</p><br/><p>The door opened.</p><br/><p>Lin Fan smiled, “Happy New Year, Uncle Li.”</p><br/><p>“Ah, Lil’ Fan is back. Come, come, come in.” Uncle Li pushed the door open. Then, he shouted to his wife who was in the kitchen, “Lil’ Fan and the rest are here. Hurry up and prepare some tea.”</p><br/><p>A delighted voice came from the kitchen, “Lil’ Fan and the rest are here?”</p><br/><p>“Elder Li, let me tell you, this time that I went to Shanghai…” As Papa Lin was taking off his shoes, he couldn’t help but want to talk about his experiences. But before he finished, he was interrupted by Mama Lin.</p><br/><p>“You talk too much. Shut up.”</p><br/><p>Papa Lin laughed embarrassedly. Then, he sneakily glared at his wife. “Elder Li, let’s talk later on.”</p><br/><p>Lin Fan was a little embarrassed as he stood at the side. “Uncle Li, please don’t mind my Dad. That’s just how he is.”</p><br/><p>Uncle Li was in a pretty good mood. “No problem, no problem. That’s how your Dad is. I’ve known him for so many years. How could I now know?”</p><br/><p>Papa Lin was pleased. “Heard that? Elder Li doesn’t mind it at all. It’s just you two who care about all this.”</p><br/><p>Lin Fan smiled and didn’t say more. However, he was in a pretty good mood as well. His Mom was really right about his Dad. His Dad didn’t have many friends and Uncle Li was indeed the most reliable.</p><br/><p>When a person reaches his middle years, he has to have a few friends to brag to and maintain a carefree heart. That way, he would be free of diseases.</p><br/><p>After entering the house.</p><br/><p>Lin Fan looked around and asked in a puzzled tone, ” Uncle Li, where are Brother Li and his wife?”</p><br/><p>“They went out to do something. They should be back soon,” said Uncle Li.</p><br/><p>“Oh…”</p></div>\n</div>"}