{"title": "Chapter 803 - This person is rather arrogant", "id": 803, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-803-this-person-is-rather-arrogant", "volume_title": "Volume 9", "body": "<h1>Chapter 803 - This person is rather arrogant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the Japan Broadcasting Station.</p><br/><p>“I’m looking forward to Zhenping Yiming’s interview on Shanghai TV’s show!”</p><br/><p>“Haha! I feel like laughing whenever I think about this. Zhenping Yiming just needs to put up a show in front of the Chinese to help us gain some glory.”</p><br/><p>“We should suppress their overconfident attitude. Do they really think that they’re invincible?”</p><br/><p>“When does the show begin? I can’t wait to see Zhenping Yiming show off in front of the Chinese.”</p><br/><p>“It’s going to start soon. Don’t be anxious.”</p><br/><p>…</p><br/><p>At the China Network.</p><br/><p>“Holy sh*t! Has Shanghai TV’s brain been eaten? Of all people to invite, they had to invite a Japanese competitor. What dogs. I’ll hate them for life!”</p><br/><p>“Isn’t this just hitting us in the face?”</p><br/><p>“I’m so angry. I’m not going to watch this show anymore.”</p><br/><p>“I’ve been looking forward to this. I really want to watch this show!”</p><br/><p>“^ Are you sick? What so good about this show? Please kill this son of a b*tch.”</p><br/><p>“Why? Didn’t you guys know that Master Lin would be taking part in it? He’s a guest!”</p><br/><p>“F*ck! Is that true?”</p><br/><p>“Didn’t you guys read Shanghai TV’s official Weibo? Master Lin’s name is on the guest list!”</p><br/><p>“Sh*t! I’m going to watch it only for Master Lin. I really hope he comes back to the show.”</p><br/><p>“My *ss! Even though Master Lin is awesome, he doesn’t know how to play table tennis. If he goes up, wouldn’t he just be embarrassing himself?”</p><br/><p>“That’s right.”</p><br/><p>…</p><br/><p>The Internet was buzzing with activity. They had enough of Shanghai TV’s stupid actions. Of all people to invite, they actually invited that b*stard. Do they think that there’s no one better in our own country?</p><br/><p>Many people heard of this, and they decided to give a negative feedback to Shanghai TV.</p><br/><p>Many people left angry comments on the Shanghai TV’s official Weibo. This led to the managers of the Weibo account to feel very awkward. They didn’t know what to do. Even if they were to delete the comments, they wouldn’t be fast enough.</p><br/><p>In the end, they could only disregard them.</p><br/><p>…</p><br/><p>The show started.</p><br/><p>Lin Fan expressionlessly sat at the guest table. He had no interest in whatever that was going to happen.</p><br/><p>The host went up on stage, and announced, “Welcome everybody to the show! I am the host, Fang Yun. Let’s welcome the champion of the Asian Championships, Zhenping Yiming, up on stage!</p><br/><p>There was a thunderous applause.</p><br/><p>In the broadcasting room.</p><br/><p>“What the f*ck? Are these people ret*rded? Why are they clapping?”</p><br/><p>“F*ck! One look and I can tell that this is government propaganda, and the audience are all just fillers!”</p><br/><p>“This Shanghai TV must be sick! If I were to watch their show in the future, I’d eat sh*t!”</p><br/><p>At the Japan Broadcasting Station.</p><br/><p>“Haha, these Chinese are clapping rather loudly.”</p><br/><p>“Not bad, not bad. The king has arrived.”</p><br/><p>…</p><br/><p>Zhenping Yiming was all smiles when he went up on stage. After which, he used Japanese to greet the audience.</p><br/><p>On the stage, there were two sofas. One for the host, and the other for Zhenping Yiming.</p><br/><p>In Lin Fan’s view, Zhenping Yiming was very young. He looked to be about twenty-odd years old. He had a slightly proud expression. The smile on his face showed just how excited he was.</p><br/><p>After all, in Japan, he was already labeled a hero having defeated the undefeated hero of China.</p><br/><p>The host said, “Hello.”</p><br/><p>Zhenping Yiming replied, “Hello to you, host.”</p><br/><p>The host asked, “May I ask how old are you as of today?”</p><br/><p>Zhenping Yiming replied very proudly, “Twenty-five.”</p><br/><p>The host said, “That’s really young, yet you are able to clinch champion in the Asian Championships. This is really something to be proud about.”</p><br/><p>Zhenping Yiming answered, “I’m not really proud of it. This is because, before the competition, I already had the confidence that I’d win the championships. Hence, it was expected.”</p><br/><p>Then the netizens heard this, they started scolding him. They wanted to kill this person. However, there was no way to. Behind this screen, they could only scold him.</p><br/><p>In the Japan Broadcasting Station.</p><br/><p>The Japanese audience started flaring up.</p><br/><p>“Haha! Zhenping Yiming is really awesome! His words are just too much!”</p><br/><p>“The confidence to win the championships. Whichever member of the Chinese team is only a stepping stone!”</p><br/><p>“Continue watching! Zhenping Yiming is helping us to swell our ego!”</p><br/><p>“Look at those guests. Their expression is very ugly. I’ll bet that they’re very unhappy.”</p><br/><p>“I’m happy that they aren’t happy.”</p><br/><p>…</p><br/><p>The host laughed awkwardly. Even though his words made some people angry, but as the host, he had to ensure his composure.</p><br/><p>“May I ask, who did you think the strongest competitor was the previous Asian Championships?”</p><br/><p>Zhengping Yiming was momentarily silent, thereafter, he said arrogantly, “I don’t think I played against any strong opponent. From what I can see, the strongest opponent was myself. I was only able to win the championships because I managed to defeat myself.”</p><br/><p>Japan.</p><br/><p>“Well said! To Zhenping Yiming, the strongest opponent is himself!”</p><br/><p>“He crushed the opponent by an absolute margin of 3-1. Who can be his match?”</p><br/><p>The host had thoughts of mocking him, but he decided to continue asking, “In the finals, you played against Xu Song. Do you think that he pressured you in any way?”</p><br/><p>Zhenping Yiming laughed arrogantly, “Pressure? No. There wasn’t any sort of pressure. If there was any pressure, I wouldn’t have won him by three is to one.”</p><br/><p>On the Internet.</p><br/><p>“F*ck! This b*stard is too arrogant. He only won it once, is there a need to be like this?”</p><br/><p>“How I wish I could f*cking kill him now.”</p><br/><p>“Don’t stop me! I must teach him how to be a person today.”</p><br/><p>Lin Fan frowned. This b*stard was rather arrogant.</p><br/><p>The host didn’t expect this contestant to be so arrogant. He completely didn’t put anyone in his eyes. He quickly changed to the topic of the question.</p><br/><p>“May I ask what made you decide to walk the path of table tennis?”</p><br/><p>Zhenping Yiming laughed, “When I was in middle school, I heard that table tennis was always controlled by the Chinese and there was a myth that they are unbeatable. However, I am a person that likes to bust the myths. As a result, I started practicing table tennis, all the way to this Asian Championships, where I found out that this myth wasn’t true and they could be defeated.”</p><br/><p>“F*ck!”</p><br/><p>Although the audience were just fillers, when they heard such arrogant words, they couldn’t take it anymore. Even though they were being paid to be fillers, but they were still Chinese. A small Japanese could be so arrogant. They felt that if this were to go on, they would be sick.</p><br/><p>But very quickly, they were suppressed by the employees.</p><br/><p>“Master Lin, this person is too arrogant!” All the guests couldn’t take it anymore. They felt as if their blood was boiling.</p><br/><p>Lin Fan nodded his head, “Yes. This person is indeed arrogant.”</p><br/><p>At the Japan Broadcasting Station.</p><br/><p>“Haha! I’m going to laugh to death! Let’s see who dares to look down on us now!”</p><br/><p>“What ‘unbeatable myth’? In the face of Zhenping Yiming, it’s all just a joke.”</p><br/><p>To Zhenping Yiming, he knew what he was saying.</p><br/><p>However, it didn’t matter to him. He was a Japanese. All he needed to do was to let the Japanese fans be happy. He didn’t care about the Chinese.</p><br/><p>Who cares if they hated him?</p><br/><p>It wasn’t like he relied on them to live.</p><br/><p>At the backstage.</p><br/><p>Director Liu was rather angry, “What’s going on? Didn’t we talk about this before? How could he say these things?”</p><br/><p>The employees by his side were all rather awkward. They didn’t know what to do.</p><br/><p>Everything was made clear before this. However, they didn’t expect the other party to not follow the guideline.”</p><br/><p>The nation’s athletes all gathered together to watch the show, and while watching it, they had very nasty expressions on their faces.</p><br/><p>It was especially so for Xu Song. He lowered his head, his face faced filled with guilt.</p><br/><p>His coach patted Xu Song on the shoulder, “Don’t be stressed. We didn’t expect your injury to recur during this competition. It’ll be okay the next time. Let’s just let him be cocky for now.”</p><br/><p>Xu Song nodded his head. He was blaming himself and was crying very badly.</p><br/><p>Moreover, every word said during the show just gave him more stress.</p></div>\n</div>"}