{"title": "Chapter 800 - Awesome bragging", "id": 800, "volume": 8, "url": "http://boxnovel.org/a-valiant-life-chapter-800-awesome-bragging", "volume_title": "Volume 8", "body": "<h1>Chapter 800 - Awesome bragging</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Dinner was finished.</p><br/><p>The two families were elated, especially Brother Li, who had been heavy-hearted before. Now, that expression of joy was all over his face. His troubles had been resolved. There was nothing more to worry about.</p><br/><p>However, he had not thought that the Lil’ Fan that he knew in the past had become so amazing. This was completely unexpected.</p><br/><p>Although he had always been watching the news on the Internet about how amazing Master Lin was, he had never thought much of it. He thought that it was just another way of living that Lil’ Fan had. There were many people nowadays that hyped themselves up on the Internet to earn money.</p><br/><p>When they saw the news, they had sincerely felt happy for Lin Fan. After all, when one became famous, one would be able to earn money.</p><br/><p>But it was only now that they understood that Lil’ Fan did not hype himself up. He was really amazing.</p><br/><p>Lu Corporation. It was THAT Lu Corporation!</p><br/><p>With his academic records, it was completely insufficient for him to get a good appointment in Lu Corporation. If it hadn’t been for Lil’ Fan’s strong connections, he would never be able to get employed with just a few words. Moreover, he had even been given an above average managerial appointment.</p><br/><p>They returned home.</p><br/><p>Papa Lin had drunk quite a bit. He was in a very good mood. He shouted as he looked at Mama Lin, “Did you see that? Our son is so amazing! He even knows the boss of Lu Corporation.”</p><br/><p>Lin Fan was a little embarrassed. This wasn’t something worth being proud of. He was going to have to return this favor in future.</p><br/><p>But it didn’t matter. As long as his Dad was happy, it was fine. If his family was happy, he would be happy too.</p><br/><p>Mama Lin glared at Papa Lin. “Okay, you’re amazing.” Then, she looked at Lin Fan. “Son, will you have to do anything after asking for this favor?”</p><br/><p>Lin Fan smiled and waved his hand. “It’s not a problem. Brother Li is capable as well. I only provided a better job for him. Uncle Li’s family has always been good to us. As the saying goes, close neighbors are better than distant relatives. Uncle Li’s family’s relationship with us is even better than our relationship with some relatives. Even though I’m not at home usually, we should still help each other out.”</p><br/><p>Mama Lin nodded, “That’s true.”</p><br/><p>At Uncle Li’s home.</p><br/><p>“Son, were you hiding something from us before?” Although Uncle Li had drunk quite a lot, his mind was still very clear. How could he not understand his own son?</p><br/><p>Even if his son had hidden it even better, those expressions wouldn’t be able to escape Uncle Li’s eyes.</p><br/><p>Li Feng was a little embarrassed. He was ashamed to speak. It was his wife, Tian Yu Hui who spoke, “Husband, Dad has already asked. Since there’s no problem anymore, why don’t you just say it?”</p><br/><p>Li Feng stopped hiding the truth. He explained the entire situation to his family.</p><br/><p>After hearing it, Uncle Li and Aunty Li were both angry. Then, Uncle Li sighed, “It’s lucky that Lil’ Fan helped you. I was wondering why Lil’ Fan would suddenly introduce a job to you. It turns out that he had seen through it already. He didn’t even say it openly, it was probably to save you some face.”</p><br/><p>“I know. I can see it now as well,” said Li Feng with a nod. He was very grateful to Lin Fan.</p><br/><p>Suddenly, Uncle Li started laughing, “That guy, Elder Lin, always brags to me all day and night. I never thought that I would really have to rely on him this time. In future, I’ll just endure it and continue listening to his boasting.”</p><br/><p>Aunty Li said, “What are you talking about? They helped us so much. Shouldn’t you be thanking him?”</p><br/><p>Uncle Li said, “Of course. We’ll have to have a good meal tomorrow to thank Lil’ Fan. Then, he looked at his son. “Lil’ Feng, work hard from now on. Don’t make things hard for Lil’ Fan, okay? Also, if something happens, tell us. If it has to do with work, what would we possibly say? Don’t keep things to yourself.”</p><br/><p>Li Feng nodded, “I got it, Dad.”</p><br/><p>It was clear that Li Feng and Tian Yu Hui were both very happy. This was a glimmer of hope that appeared in their darkest hour. As for that Chief Zhu, he could f*ck off.</p><br/><p>That Chief Zhu had even wanted to have sex with his wife. He was simply asking for death.</p><br/><p>…</p><br/><p>After returning to his old home, of course, Lin Fan had to visit relatives.</p><br/><p>At the end of the New Year celebrations, all the townsfolk that had gone home for the New Year gradually returned to their work.</p><br/><p>Lin Fan didn’t stay for long either.</p><br/><p>“Dad, Mom, you guys can go back. I’m going back to Shanghai,” Lin Fan said and waved.</p><br/><p>Papa Lin said, “Be careful of your safety. If you get tired, take a break at the rest area. Don’t drive if you’re tired.”</p><br/><p>Lin Fan said, “I know. No need to worry.”</p><br/><p>Mama Lin couldn’t quite bear to see him leave. “You’ve only been back for a while and you’re leaving again.”</p><br/><p>Papa Lin said, “What are you anxious about? When our son has a wife, we can go and see her. Let our son go out and find a wife.”</p><br/><p>Lin Fan was embarrassed. Then, he waved and stepped on the gas pedal, leaving the apartment block.</p><br/><p>The next day!</p><br/><p>At Cloud Street.</p><br/><p>“Hello, Little Boss. How was the New Year break?”</p><br/><p>“We haven’t seen you for over ten days. We really missed you.”</p><br/><p>“Little Boss looks pretty energetic today. It seems that you’ve had a comfortable New Year break.”</p><br/><p>Lin Fan greeted each of his neighbors. “You guys are complimenting me right after the New Year break. Is this really good?”</p><br/><p>Elder Liang smiled, “How is this not good? I went back to my old home and boasted to my relatives and friends. They were all very jealous and they wanted to come here to open shops. But this isn’t somewhere that anyone can open their shops.”</p><br/><p>“You don’t say, Elder Liang. When I went home and my son found out that I’m Little Boss’ neighbor, he worshipped me to death. He really wanted to come to Shanghai to see Little Boss. I told him that if he gets top ten for his exams, I would bring him to Shanghai to see Little Boss.”</p><br/><p>Lin Fan said, “If that’s the case, then if your son ever gets top ten for his exams, that would be thanks to me. You would have to treat me to a meal.”</p><br/><p>“Little Boss, if that brat really gets top ten, I would even treat you to ten meals.”</p><br/><p>Elder Liang said, “Elder Wang, stop bragging. Your heart would ache if that really happens.”</p><br/><p>Elder Wang said, “Why would my heart ache? Elder Liang, you really underestimate others. When that really happens, I’ll show you my ability.”</p><br/><p>Lin Fan looked at this scene and smiled brilliantly. These kinds of days were what his life should really be.</p><br/><p>A New Year had begun. He had to put in some more effort.</p><br/><p>There were many things that needed him to work on them.</p><br/><p>At that moment, his phone rang. He looked at the display and saw that it was Brother Li. It seemed that the matter had succeeded.</p><br/><p>He answered the phone.</p><br/><p>“Lil’ Fan, I’ve gone there already. The people here are very good and the work is very good too.” Li Feng was very emotional. It was as if he had not expected things to be so good.</p><br/><p>Lin Fan said, “That’s good. It’s good as long as you’re content. I was afraid that you wouldn’t be satisfied.”</p><br/><p>Li Feng said, “How could I not be satisfied? This is really too great. Thank you, Lil’ Fan.”</p><br/><p>Lin Fan smiled, “What’s there to thank me for? We’re family. As long as you’re satisfied, it’s all good.”</p><br/><p>Then, they chatted for a while more before hanging up.</p><br/><p>He was very grateful to Lu Li. The efficiency that he had carried this thing out was too great.</p><br/><p>For Brother Li to start work so smoothly, Lu Li must have made calls beforehand to talk to the leaders of the Zhongzhou branch office. Once the big leader had personally called, they would have to pay attention to this matter.</p><br/><p>At the very least, this would guarantee that Brother Li would never be bullied at his new job.</p><br/><p>…</p></div>\n</div>"}