{"title": "Chapter 813 - Filled with anticipation", "id": 813, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-813-filled-with-anticipation", "volume_title": "Volume 9", "body": "<h1>Chapter 813 - Filled with anticipation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At Cloud Street!</p><br/><p>Henry Wang looked at the Baidu navigator. He took several buses before arriving at his destination.</p><br/><p>Then, he saw a cleaner cleaning the road and he went forward, “Sorry, may I know where is Master Lin’s shop?”</p><br/><p>The cleaner was ecstatic when she saw that it was a Caucasian. “Are you here to buy scallion pancakes?”</p><br/><p>“Yes,” Henry Wang nodded.</p><br/><p>The cleaner held onto the broom and said, “Young man, I think you should forget about it today. Master Lin only sells scallion pancakes in the morning. I think you’ve missed the timing.”</p><br/><p>Henry Wang replied, “May I know where is his shop?”</p><br/><p>He didn’t expect the Chinese lady to be so chatty. He wanted to end the conversation quickly, or else he didn’t know when it would end.</p><br/><p>The cleaner was clearly not going to tell him the answer immediately, “Master Lin’s scallion pancakes are seriously terrific. I would smell the aroma every morning when I come to clean the streets. It is unbearable. When you place it in your mouth, the taste is… literally indescribable.”</p><br/><p>“I…”</p><br/><p>“I know, you’re just here to try your luck. Let me warn you that it is really difficult. People have come and queued for an entire month and they still didn’t manage to buy it. They almost went crazy,” the cleaner lady rambled on.</p><br/><p>She didn’t want to let go of this Caucasian in front of her.</p><br/><p>However, this Caucasian seemed really young.</p><br/><p>“Young man, are you married?”</p><br/><p>Henry Wang was stunned. She wasn’t answering his question at all. He just wanted to find out where Master Lin’s shop was. It had nothing to do with his marital status.</p><br/><p>Then, Elder Liang walked past, “Woman, he’s asking about the location of Master Lin’s shop. Are you trying to matchmake your daughter again?”</p><br/><p>The cleaner lady smiled upon seeing Elder Liang, “I think he looks decent so I just wanted to ask.”</p><br/><p>Elder Liang smiled. Then, he looked at the Caucasian, “Master Lin’s shop is just in front.”</p><br/><p>“Thank you,” Henry Wang said and nodded. Then, he walked towards the shop. He was feeling a little fearful.</p><br/><p>At the entrance of Master Lin’s shop.</p><br/><p>Henry Wang looked at it and was a little stunned. What kind of shop was that?</p><br/><p>It didn’t look like one that made delicacies.</p><br/><p>“May I know if this is Master Lin’s scallion pancake shop?” Henry Wang asked. He had to ask if it was the right shop.</p><br/><p>Fraud Tian was smoking at the entrance and when he saw someone approaching the shop, he immediately went forward, “Yes, this is the famous Master Lin scallion pancake shop. However, the timing for the scallion pancakes has passed. Do you want to have your fortune read?”</p><br/><p>Henry Wang looked around, “I think you don’t seem like you sell delicacies. Where is the cooking set up?”</p><br/><p>Fraud Tian smiled, “We don’t need to set up anything. We just need a pushcart. Do you want to have your fortune read? You can come here again tomorrow to buy the scallion pancakes.”</p><br/><p>Henry Wang was really doubtful. It didn’t even look like a proper scallion pancake shop. How delicious could their scallion pancakes be if they didn’t have a proper shop?</p><br/><p>He felt like he got cheated again.</p><br/><p>However, those people that he just met really recommended the scallion pancakes here. He was really curious and he felt that there was something he hadn’t found out yet.</p><br/><p>At the same time, he thought of something.</p><br/><p>Never judge a book by its cover.</p><br/><p>Just because a shop looked ordinary, he couldn’t belittle it. However, he really wanted to roast the shop owners. They could’ve made the shop look better.</p><br/><p>“I am not here to have my fortune read. I am here to buy scallion pancakes,” Henry Wang said.</p><br/><p>Fraud Tian was disinterested when he heard that he wasn’t there to have his fortune read. “Since you’re not here for fortune-telling, come back here tomorrow for scallion pancakes.”</p><br/><p>“What time tomorrow?” Henry Wang asked.</p><br/><p>Fraud Tian replied, “9 am tomorrow.”</p><br/><p>To Henry Wang, he had to try it once regardless of what happened. “Alright, sorry for the inconvenience. I will be back tomorrow.”</p><br/><p>Then, he left.</p><br/><p>Fraud Tian shook his head, “This Caucasian is so ignorant. He might not even buy any pancakes when he comes here tomorrow.”</p><br/><p>Lin Fan stood up, “Alright, look after the shop. I will be heading to the Children’s Welfare Institute.”</p><br/><p>Lin Fan’s life was pretty routine now. He only went home, Cloud Street and the Children’s Welfare Institute.</p><br/><p>He didn’t have anything else to do besides these things.</p><br/><p>The next day!</p><br/><p>In the morning.</p><br/><p>Henry Wang went there early in the morning. He didn’t understand the reason for the shop’s rules and regulations. Why would they open at 9 am and only sell ten scallion pancakes every morning? Furthermore, would people really be there to buy them?</p><br/><p>However, when he reached the shop, he was instantly stunned.</p><br/><p>What the f*ck?</p><br/><p>What was going on? Why were there so many people?</p><br/><p>Those townsfolk that were queuing up started to look at Henry Wang in confusion.</p><br/><p>“D*mn, Master Lin’s scallion pancakes are awesome. Even a Caucasian is here to queue for them.”</p><br/><p>“I’ve never seen him before. He must be new here. Who is going to tell him about the rules here?”</p><br/><p>“I’ll do it. We have to tell him about it since he is new here so that he won’t do anything that he would regret.”</p><br/><p>Although everyone was there to buy scallion pancakes, they were still the ‘seniors’ and they had to explain things to the first timer.</p><br/><p>This was the experience that they had accumulated from spending their mornings there.</p><br/><p>Initially, there were people who queued up for the scallion pancakes for a long time but didn’t manage to get them. They were furious and wanted to smash Master Lin’s pushcart. The townsfolk didn’t want to let that repeat again. How could they let someone so arrogant misbehave in front of Master Lin?</p><br/><p>They had to prevent it right from the start.</p><br/><p>Of course, they couldn’t have done it in a friendly way.</p><br/><p>Hence, it was ultimately for the peace and harmony of the situation there.</p><br/><p>Some of the experienced people grouped together and whenever there were first-timers, they would go forward to speak to the person.</p><br/><p>Initially, they explained that they had to be patient for Master Lin’s scallion pancakes. It depended on their luck. If they weren’t lucky, they wouldn’t be able to get it even after waiting for a month.</p><br/><p>Hence, they had to tell them to behave themselves if that were to happen. They could choose to leave but they should never pretend like they own the place.</p><br/><p>Especially since this first-timer was a Caucasian, they felt that they had to communicate effectively with him. If this foreign friend were to blow up right there, it would definitely be a messy affair.</p><br/><p>Henry Wang didn’t expect these people to be so welcoming. They hadn’t seen him before and they actually came forward to speak to him.</p><br/><p>After hearing what they said, Henry Wang smiled and nodded.</p><br/><p>“Don’t worry, I won’t do that. Rules are rules and I will obey them.”</p><br/><p>The townsfolk that were queueing up were relieved after hearing that.</p><br/><p>Lin Fan stood at the pushcart and he was preparing the first scallion pancake.</p><br/><p>Henry Wang was being trapped in the crowd and he couldn’t see what was happening. Suddenly, there was an aroma in the air. It was something he had never smelled before.</p><br/><p>It was simply unbelievable.</p><br/><p>Then, he saw a youngster holding the first scallion pancake in his hands. He took a bite and everyone stared at him with envy.</p><br/><p>Henry Wang was shocked by what followed after that. The normal-looking youngster suddenly looked abnormal.</p><br/><p>His expressions looked really exaggerated.</p><br/><p>“How could that be?” Henry Wang was in disbelief. The youngster’s looked as if he just had an orgasm.</p><br/><p>Could the scallion pancake be that delicious?</p><br/><p>Then, he was filled with even more anticipation.</p></div>\n</div>"}