{"title": "Chapter 817 - This is food from the Heavens", "id": 817, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-817-this-is-food-from-the-heavens", "volume_title": "Volume 9", "body": "<h1>Chapter 817 - This is food from the Heavens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The poster on the wall wasn’t really useful anymore. He had obtained the Encyclopedic Points that he deserved.</p><br/><p>Therefore, he hasn’t been relying on it to get his Encyclopedic Points. However, he still kept it on the wall so that it could help him to gain some Encyclopedic Points whenever he was lucky.</p><br/><p>Henry looked at his colleagues, “Quick, come and have a look.”</p><br/><p>The other Michelin critics weren’t interested at all. They didn’t want to eat such food. They felt that Henry was pranking them and it wasn’t fun.</p><br/><p>It was just… that they had been colleagues for many years and they didn’t know what to say to him.</p><br/><p>Furthermore, Henry was considered to be their manager. They could only play along with it.</p><br/><p>Worthy of three Michelin stars?</p><br/><p>If other food critics were to find out about this, they’d probably be infuriated.</p><br/><p>Because this was a form of humiliation to them.</p><br/><p>Furthermore, it was just scallion pancakes. They weren’t some special delicacy. It was totally ridiculous.</p><br/><p>Henry Wang didn’t say much. He quickly read the poster on the wall. He didn’t expect such a thing to exist.</p><br/><p>Initially, he thought that the poster would contain difficult information to digest. However, he realized that it was just the recipe for the scallion pancakes.</p><br/><p>When Henry’s colleagues saw that, they shook their heads.</p><br/><p>They didn’t know what had happened to Henry. It was as if he had been possessed. It was shocking.</p><br/><p>Encyclopedic Points +1.</p><br/><p>Lin Fan didn’t expect Henry Wang to be so smart. He merely read it once and he understood it. Of course, Lin Fan was happy.</p><br/><p>He didn’t like anything else but Encyclopedic Points.</p><br/><p>“Alright, you’ve understood it. You can get a scallion pancake,” Lin Fan said.</p><br/><p>When Henry Wang heard that, he stared at Lin Fan in disbelief, “That’s it?”</p><br/><p>Lin Fan nodded, “Yeah, that’s it.”</p><br/><p>“D*mn!”</p><br/><p>Henry Wang was stunned. He didn’t expect it to be completed just like that.</p><br/><p>It wasn’t what he had expected.</p><br/><p>He spent $20,000 on a scallion pancake a few days ago. Today, he just looked at a poster and could buy one for just $50. That…</p><br/><p>He didn’t know what to say anymore.</p><br/><p>He felt as if his brains must have been smashed by a door.</p><br/><p>However, he didn’t want to think about it anymore because he had gotten what he wanted. That was to taste the delicious dish.</p><br/><p>However, when he realized that his friends weren’t looking at the poster, he got anxious.</p><br/><p>“Oh my God, what are you doing? Can you please read the poster seriously? You won’t regret it, trust me.”</p><br/><p>One of the colleagues shook his head, “Henry, you’re making it really difficult to believe. This shop is really… you shouldn’t be thinking about it at all.”</p><br/><p>All of them didn’t think highly of the shop at all. They felt that Henry had gone mad.</p><br/><p>If they were to award this shop with three Michelin stars, people would probably think they were crazy.</p><br/><p>Lin Tan knew that those people were food critics from the Michelin company. However, he didn’t really care about that. He didn’t want to become famous. He could probably get three Michelin stars on his own and convince all of them that his shop was worthy of that. However, he didn’t see the need for that.</p><br/><p>He wanted to stay low-profile and he didn’t want to become famous for it.</p><br/><p>Henry didn’t want to say anything else. He just wanted to taste the food to stun those that didn’t believe him.</p><br/><p>“Boss, can I have one scallion pancake please?” Henry Wang said.</p><br/><p>Lin Fan smiled and started to make a scallion pancake.</p><br/><p>Henry looked at him and watched closely. It was his first time being so close to the making of the scallion pancake. He wanted to see how it was made.</p><br/><p>Simply ordinary.</p><br/><p>He could only use those words to describe the process. He didn’t believe it. How could an ordinary process make such delicious scallion pancakes?</p><br/><p>When Henry’s colleagues saw that, they were in disdain. They felt like Henry was wasting their time on an ordinary thing.</p><br/><p>If the reporters of food magazines were to know that they were there, they would definitely be a laughing stock. Were the Michelin food critics so bored that they had nothing else to taste besides this?</p><br/><p>Henry continued to watch closely. If he didn’t taste the scallion pancakes himself, he probably would have believed that the food was difficult to swallow. However, since he had tried it, he was filled with anticipation.</p><br/><p>Lin Fan coughed gently, “Have you heard of ‘returning to one’s natural state’?”</p><br/><p>Henry was stunned. “I’ve seen it in Wuxia novels. It’s when someone lets go of all his moves and only uses the simplest one to cause the greatest damage. Right?”</p><br/><p>“Yes, you can think of it that way. Looks like you know a lot about wuxia novels,” Lin Fan said.</p><br/><p>Henry smiled, “Yeah, I have a friend who is a drug addict. He got rid of his addiction by reading Chinese fantasy novels. He has already stopped taking drugs and he spends his days waiting for the author to update the novel. I would read it sometimes too. It’s called ‘the lonely undefeated’. Have you seen it before?”</p><br/><p>Lin Fan shook his head, “Nope.” However, he was judging the name of the book. He felt that it must have been written by an idiot. The name of the novel was so stupid.</p><br/><p>“Although my actions look ordinary, each action has a purpose. They’re not for show. Do you smell the aroma?”</p><br/><p>Henry was stunned. He took a sniff, “I think I smell it.”</p><br/><p>Henry’s colleagues just looked at him disdainfully. He must have gone crazy. Where was the aroma?</p><br/><p>Lin Fan looked at Henry and felt that he was probably lying. Aroma my a*s. He hadn’t even used the mystical boost of the Encyclopedia.</p><br/><p>Then, Lin Fan started to use the mystical boost of the Encyclopedia.</p><br/><p>In an instant, an aroma filled the air.</p><br/><p>The crowd that was looking at him disdainfully was now in disbelief. They looked at the ordinary scallion pancakes in shock and disbelief.</p><br/><p>They could confirm that the aroma was coming from the scallion pancake.</p><br/><p>After a short moment.</p><br/><p>Lin Fan felt that there was a need for some special effects. “Here, the scallion pancake is ready.”</p><br/><p>*clatter!*</p><br/><p>In that instant, it was as if the group of Michelin food critics had seen something extraordinary.</p><br/><p>They rubbed their eyes in disbelief.</p><br/><p>They felt as if they saw rays of light emerging from the scallion pancake.</p><br/><p>“It’s glowing. It’s really glowing!” Henry was ecstatic. He felt that it was a miracle to see a glowing delicacy.</p><br/><p>An aroma filled the air.</p><br/><p>The aroma started to spread.</p><br/><p>It was as if the entire Cloud Street was engulfed with the aroma.</p><br/><p>Many of the shoppers stopped in their tracks, “Where is the smell coming from?”</p><br/><p>“I can’t take it anymore. I’m so hungry.”</p><br/><p>“I think it’s from there.”</p><br/><p>Lin Fan took out a plastic bag and placed the scallion pancake into the packaging. Then, he passed it to Henry who was mesmerized, “Alright, you can taste it now.”</p><br/><p>Henry stretched out his trembling hands. He couldn’t control himself anymore. Then, he looked at his colleagues, “Do you smell that? Did you see that? This is what I call a delicacy. It is not from this world. Only the Gods can taste such deliciousness from Heaven.”</p><br/><p>The surrounding townsfolk didn’t see the rays of light but when they heard what this foreigner said, they were dumbfounded.</p><br/><p>“Do you think these people have gone mad?”</p><br/><p>“Why do I not understand what they’re saying?”</p><br/><p>“It’s okay if you don’t understand it. I feel like Little Boss is pretending to be awesome again.”</p></div>\n</div>"}