{"title": "Chapter 846 - How is he going to survive?", "id": 846, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-846-how-is-he-going-to-survive", "volume_title": "Volume 9", "body": "<h1>Chapter 846 - How is he going to survive?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the dining table.</p><br/><p>Lin Fan just treated it like a normal outing. He drank and feasted. He probably wouldn’t be able to drive home later.</p><br/><p>Chen Chang Sheng was really happy. He raised his glass, “Master Lin, I’ll give you a toast. Let me introduce you to a friend of mine.”</p><br/><p>Then, Chen Chang Sheng pointed to a middle-aged man beside him, “This is my secondary school classmate. He is currently working in the food and beverages industry in Zhongzhou. This time, he came to Shanghai to visit me and I arranged for us to meet up together.”</p><br/><p>The man stood up and smiled, “Hi, Master Lin, I am Xu Fei Yuan. I have heard of Master Lin’s name. This time, it’s my honor to meet all of you here, including Master Lin. I am finishing this glass of wine as a form of respect.”</p><br/><p>“Oh, so you’re from the same village,” Lin Fan smiled and said.</p><br/><p>Xu Fei Yuan had been doing really well in Zhongzhou. This time, he came to Shanghai to catch up with his classmate and perhaps boost his business. When he heard that a lot of wealthy men were gathering for a meal, he was really excited about it.</p><br/><p>Especially when he heard that one of them was Master Lin. He couldn’t contain his excitement at all.</p><br/><p>He didn’t really dare to speak at the table as he was afraid of offending people. He only started to speak when Chen Chang Sheng introduced him to everyone else. That was when he introduced himself to the others.</p><br/><p>Wang Ming Yang and the others were friendly and they gave Chen Chang Sheng face. “Since you’re Chief Chen’s friend, you’re our friend now. You don’t have to be too formal. We can talk about anything.”</p><br/><p>Although Xu Fei Yuan was pretty well to do, he couldn’t match up to the wealth of the people at the table.</p><br/><p>After hearing that, he became livelier. He started toasting everyone and tried to make friends with them.</p><br/><p>After three rounds of drinking.</p><br/><p>Everyone started to talk about other random things.</p><br/><p>Chen Chang Sheng’s face was red. He patted Xu Fei Yuan’s shoulder, “I heard your restaurant just had two new dishes and they’re really popular now. Is it being sold to the other cities?”</p><br/><p>When Xu Fei Yuan heard that, he smiled, “Brother Chen, these two dishes are really decent. They helped me to expand my market outreach. These dishes can be said to be my signature dishes.”</p><br/><p>“Haha, if we’re talking about cooking, we should mention that Master Lin is a superb cook. Those that have tried his food before will never be able to forget its taste,” He Cheng Han said and laughed.</p><br/><p>He had eaten Lin Fan’s food before and he had been craving for it ever since then.</p><br/><p>Xu Fei Yuan was a little drunk and he started to talk more, “Actually, these two dishes weren’t mine initially. They belong to a small restaurant. There was once I returned home from working overseas and I was hungry. I found a random restaurant to have my meal in. That was when I found the treasure. These two dishes were really delicious. Then, I told them to cease operations and let me be the chef there. If not, they could sell the recipe to me.”</p><br/><p>“Guess what happened next.”</p><br/><p>Jin Yun Ming smiled, “Did you fight with them over it?”</p><br/><p>Those that discussed business deals would discuss things first. If they couldn’t reach a common agreement, they would think of other ways to get what they wanted.</p><br/><p>“Not really. I saw that they were hiring people. Hence, I sent my head chef down to work for them. You should know what the outcome was like by now,” Xu Fei Yuan laughed.</p><br/><p>Every time he thought about it, he felt that he was really smart for doing that.</p><br/><p>“That was superb. He learned a new skill and that is irreplaceable,” He Cheng Han laughed. He felt that this fella was pretty smart.</p><br/><p>Xu Fei Yuan waved his hands modestly, “It wasn’t superb. That was just a corporate move. My head chef worked in their kitchen for a month and he watched everything that they did. He slowly managed to master the skills and patented the dishes.”</p><br/><p>“The small restaurant didn’t patent the dishes?” someone asked.</p><br/><p>Xu Fei Yuan smiled, “Why would those people know the importance of a patent? My restaurants now depend on these two dishes and they are gradually expanding to other markets. It also has different packages. We use vacuum packaging for deliveries and the income is pretty good.”</p><br/><p>The others were envious of him. They didn’t expect this fella to be so lucky. He actually made a fortune after eating a meal. Where would they be able to find such a good deal?</p><br/><p>Lin Fan interrupted, “Does that mean the small restaurant is out of business?”</p><br/><p>He couldn’t get used to such a behavior.</p><br/><p>Meanwhile, He Cheng Han and the others were stunned. They knew that Master Lin loved to stand up for the weak. He didn’t like to befriend those that did evil things.</p><br/><p>The things that they said earlier were just for bragging rights.</p><br/><p>However, Xu Fei Yuan didn’t know that. He just wanted to show his determination in front of all of them.</p><br/><p>“That can’t be helped. That’s how businesses work. After I got the patent rights, I stopped them from selling these two dishes. If they wanted to sell them, they had to pay. Because of this, we went to court but I had all the evidence. Obviously, I won the case.”</p><br/><p>Lin Fan furrowed his brows. He wondered why this person was so cunning.</p><br/><p>Chen Chang Sheng realized that Master Lin was a little unhappy and it was probably because of what he was saying. He immediately nudged his friend and asked him to stop talking about it.</p><br/><p>“Alright, alright. Let’s not talk about that. Let’s talk about something else,” Chen Chang Sheng tried to change the topic.</p><br/><p>Lin Fan knocked the table, “Chief Xu, what are the two dishes called?”</p><br/><p>Chen Chang Sheng knew that something was wrong when he heard Master Lin asking about it. Then, he looked at Wang Ming Yang.</p><br/><p>However, Wang Ming Yang just shook his head. It was clear that he should stay out of this matter.</p><br/><p>Meanwhile, He Cheng Han and the others didn’t say anything else. They just looked at each other. They knew that Master Lin was probably unhappy because of what he said. They looked at Chen Chang Sheng and wondered why he asked someone like him over for dinner.</p><br/><p>They thought about it further.</p><br/><p>It was really pretty despicable.</p><br/><p>He had a big organization and he still bullied a small restaurant. It was shameful to even speak of it.</p><br/><p>Xu Fei Yuan smiled, “Oh, these two dishes are called, ‘Mirror Box Tofu’ and ‘Cherry Pork’. They’re really delicious. Next time, I’ll let everyone try them.”</p><br/><p>When Lin Fan heard that, his face changed.</p><br/><p>Wang Ming Yang was observing his best friend’s expressions. When he saw his face changed, he knew that something was wrong.</p><br/><p>Sh*t was about to go down.</p><br/><p>This time, Lin Fan took out his phone and called someone.</p><br/><p>“Everyone, please keep quiet. I’m making a call,” Lin Fan said to everyone.</p><br/><p>Then, there was silence in the private room.</p><br/><p>Soon, the person picked up.</p><br/><p>“Ke, how’s life?” Lin Fan asked calmly.</p><br/><p>The person on the phone remained silent for a moment. Then, he smiled, “I’m doing pretty well. How’s life in Shanghai recently? I read the news about you heading to the northeast. Are you okay?”</p><br/><p>“I’m fine. I’m back in Shanghai now. How’s business recently?” Lin Fan asked.</p><br/><p>Bai Ke hesitated for a moment, “It’s pretty good. Business is good. Don’t worry. Tell me when you’re in Zhongzhou next time. I will welcome you warmly.”</p><br/><p>Bai Ke was really depressed and lifeless. However, since his classmate called him, he had to sound energetic.</p><br/><p>However, he felt like he let him down.</p><br/><p>“Alright, I’ll hang up now. I have something to handle here,” said Lin Fan.</p><br/><p>“Okay.”</p><br/><p>After hanging up.</p><br/><p>Lin Fan smiled and stood up. “Just as everyone’s here today, I’ll cook two dishes for everyone to try. How’s that?”</p><br/><p>Wang Ming Yang smiled and nodded, “Sure.”</p><br/><p>…</p></div>\n</div>"}