{"title": "Chapter 841 - This has nothing to do with me", "id": 841, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-841-this-has-nothing-to-do-with-me", "volume_title": "Volume 9", "body": "<h1>Chapter 841 - This has nothing to do with me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p> “F*ck!”</p><br/><p>“They’re playing around with the law. They’re just trampling all over the law!”</p><br/><p>“Did you guys save this video?”</p><br/><p>“I’ve saved it long ago, from start to end. I didn’t even miss a single moment.”</p><br/><p>“Hurry up and tag the @InternetPolice! F*ck, I’ve thought that it was shady all along but this is the first time I’ve heard someone talk about something so shady so matter-of-factly. My eyes have been opened. I will never believe that this world is fulll of love anymore.”</p><br/><p>“Nothing bad will happen to Master Lin, right? If he gets discovered, he might get chopped to death.”</p><br/><p>“F*ck, should we call the police?”</p><br/><p>“F*ck, things have gotten big.”</p><br/><p>…</p><br/><p>Everyone watching the live broadcast was dumbfounded. They had never thought that things would turn out like this. But when the opposite party personally admitted it, they realized that this was how things actually were.</p><br/><p>The person-in-charge of the broadcast platform had placed this broadcast on their homepage the whole time. The number of viewers had already reached several million. These were all real viewers. It could be said that most of the real viewers on that platform had been drawn to this broadcast.</p><br/><p>Some of the other popular broadcasters realized that their viewers were decreasing in number and they had no idea what was going on. But when they heard that Master Lin was personally doing a broadcast, they immediately stopped broadcasting and clicked on Master Lin’s broadcast instead.</p><br/><p>Millions of netizens had seen the process of the three men chatting.</p><br/><p>Also, quite a number of reporters were among the viewers. When they witnessed this scene, they felt their breathing quicken. This was really huge news!</p><br/><p>If it was to get exposed, it would cause an unimaginable earthquake.</p><br/><p>…</p><br/><p>In the private room.</p><br/><p>Godfather Qin came back from the toilet. When he saw Lil’ Liu and Master Lin chatting so merrily, he couldn’t help but smile, “Lil’ Liu, what are you talking to Master Lin about? You seem so happy.”</p><br/><p>Godfather Liu was already high from drinking. His eyes were squinting in joy.</p><br/><p>“Godfather Qin, I’m telling Brother Lin about this incident. I’m telling him that if Godfather Qin didn’t help me by making use of your connections, I would’ve been executed for hiding so much drugs. That’s why…”</p><br/><p>*bam!*</p><br/><p>Before Godfather Liu finished, his head was slapped by Godfather Qin’s palm.</p><br/><p>“What rubbish are you talking about?” Godfather Qin glared at Lil’ Liu, then looked alertly at Lin Fan. He had felt that something wasn’t quite right from the start.</p><br/><p>But since the beginning, he had not realized what was wrong.</p><br/><p>Now that he heard Lil’ Liu say that, he had a bad premonition.</p><br/><p>Godfather Liu looked at Godfather Qin unhappily. “Why did you hit me?”</p><br/><p>If it had been anyone else, he would’ve cut the opposite party to death. But this was Godfather Qin. Even if he was upset, he didn’t dare to show it.</p><br/><p>“Just because we’re eating your food and drinking your wine, do you feel very proud of what you’ve done?” Godfather Qin reprimanded him. Then, he looked at Lin Fan. “Master Lin, my apologies. This kid doesn’t learn from his mistakes.”</p><br/><p>Lin Fan smiled, “No problem. I feel that Godfather Liu has a genuine personality. Come, Godfather Liu, let’s give the camera a smile.”</p><br/><p>“Alright, this is good.” Godfather Liu smiled. Then, he put his arm around Lin Fan and smiled brightly. Then, he said in a puzzled tone, “Brother Lin, aren’t we taking a picture? Why are there so many words on the screen?”</p><br/><p>Lin Fan said indifferently, “Oh, it’s nothing. This is just the ‘bullet screen’. Don’t mind it.”</p><br/><p>Godfather Liu shook his head. His vision was a little blur. As he looked at the words on the screen, he started reading them out loud, “Dou…Yu Live Broadcast. What’s that?”</p><br/><p>In the broadcast room.</p><br/><p>“666…is this guy an idiot? He doesn’t even know what’s a live broadcast?”</p><br/><p>“That’s very normal. How would grown-ups know about what young people play around with?”</p><br/><p>“Haha, I’m dying of laughter. These two guys don’t even know that they are done for. They are still taking group photos with Master Lin.”</p><br/><p>“Master Lin is f*cking sinister! He’s f*cking them up so badly.”</p><br/><p>“What do you mean f*cking them up? This is righteousness. Against such evil, this is how you should treat them.”</p><br/><p>…</p><br/><p>Lin Fan smiled, “This is a live broadcast. Let’s see…there are several million watching. Godfather Liu, we’re really popular!”</p><br/><p>“Popular? What do you mean by that?” Godfather Liu was still dumbfounded.</p><br/><p>But when Godfather Qin heard this, he could no longer keep his calm. His eyes instantly changed. Then, he bellowed, “You’re screwing with us!”</p><br/><p>Lin Fan stood up and backed up to the side. “Mmm. Godfather Qin is Godfather Qin after all. Actually, I’m not screwing with you. But I just have a habit of broadcasting. That’s why, since I walked into this room, every move and every action by anyone of us has been exposed to the eyes of the masses of netizens.”</p><br/><p>Godfather Liu still looked dumbfounded. Then, he looked at Godfather Qin with a puzzled face. “What’s going on?”</p><br/><p>Godfather Qin immediately stomped Godfather Liu onto the ground. “You idiot! You still don’t know what has happened. Don’t you know what you’ve said? And now, everyone knows about it.”</p><br/><p>At that moment, a chill entered Godfather Liu’s body. He suddenly woke up from his daze. He looked at Lin Fan in disbelief. Why would his Brother Lin, who had been drinking and chatting happily with him a moment ago, betray him?”</p><br/><p>“You…” Godfather Liu stood up and glared at Lin Fan furiously. He roared, “I’ll kill you!”</p><br/><p>He could guarantee that today, this guy would not step out of this place.</p><br/><p>Lin Fan shrugged. “This is the era of high-technology. Broadcasting is the best way to obtain evidence. But Godfather Qin, even though you’ve been implicated in this, you’ll only be in prison for a few years at most. But if he kills me, you’ll be an accomplice. With your age, you may not leave the prison alive like this. So what happens next depends on you.”</p><br/><p>Godfather Qin looked at Lin Fan with his teeth clenched. There was no way to reverse the situation now. Anyway, more importantly, he didn’t even know what that b*stard Lil’ Liu had said.</p><br/><p>At that moment.</p><br/><p>Lin Fan held his phone and pointed the camera at the two men. “My righteous fans, you’ve all seen it. If I get killed by them today, you guys have to bear witness.”</p><br/><p>In the broadcast room.</p><br/><p>“F*ck! Master Lin is in danger!”</p><br/><p>“Who’s in the Northeast? Hurry up and go save Master Lin!”</p><br/><p>“F*ck! Hurry up and run! Things have gone out of hand!”</p><br/><p>…</p><br/><p>“What on earth do you want to do?” Godfather Qin said to Lin Fan. He was on the verge of falling apart. He had not expected this kid to have such guts. He had actually used live broadcast to expose the entire situation to the public.</p><br/><p>Lin Fan said in a helpless tone, “Godfather Qin, I think you’ve misunderstood. It’s not about what I want right now. It’s about what the relevant departments want. Even if I want to turn things back to the way they were, it’s too late now. I’ve broadcasted it and so many people have seen it. Even if the richest person in the world tried to bribe them, he wouldn’t have enough money. So listen to what I say. Take out your phone and call the police on your own. Then, put your hands behind your head, squat down, and wait for the police to come.”</p><br/><p>“When that time comes, confess honestly. You might get a second chance.”</p><br/><p>“F*ck your mom.” Godfather Liu could not stand it. He became rash and swung the wine bottle towards Lin Fan’s head.</p><br/><p>When the people in the broadcast room saw this, they were on the edges of their seat, fearing for what was about to happen.</p><br/><p>*bam!*</p><br/><p>Lin Fan raised his leg and swung it against Godfather Liu’s side. Godfather Liu slammed against the wall heavily before falling to the ground.</p><br/><p>“You guys have to testify for me. I’m just doing self-defense. I wasn’t the one to initiate the attack.”</p><br/><p>The netizens in the broadcast room burst into laughter.</p><br/><p>“F*ck, I just remembered that Master Lin is the Vice-President of the Chinese Martial Arts Association. His strength is overwhelming.”</p><br/><p>…</p></div>\n</div>"}