{"title": "Chapter 859 - Don't doubt your lives", "id": 859, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-859-dont-doubt-your-lives", "volume_title": "Volume 9", "body": "<h1>Chapter 859 - Don't doubt your lives</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After Lin Fan set off from Cloud Street, a group of reporters came in different vehicles.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>A reporter immediately stretched his head out of the window, “Where is Master Lin?”</p><br/><p>Fraud Tian replied, “He just left…”</p><br/><p>Then, one of the reporters shouted, “He is there! I see his car! Quickly catch up with it.”</p><br/><p>When the reporter heard that, he quickly made a U-turn and chased after it. The other vehicles also followed him.</p><br/><p>They didn’t expect Master Lin to have taken action so quickly. They almost didn’t have enough time to react.</p><br/><p>However, it was lucky that they managed to catch up with him.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“What do you think Master Lin is going to use to treat her?”</p><br/><p>“Who am I supposed to ask? If I knew the answer, I wouldn’t have rushed here.”</p><br/><p>“Some of the professionals have expressed their thoughts online. They said that it’s literally impossible.”</p><br/><p>“Who knows? I don’t want to go against those professionals blindly.”</p><br/><p>They were really convinced by Master Lin’s power. The professionals had claimed a lot of things to be impossible only for Master Lin to prove them wrong.</p><br/><p>On the internet.</p><br/><p>Shanghai’s best plastic surgeon immediately expressed his thoughts online.</p><br/><p>“In this situation, her face is already so severely burned that it is impossible to cure with the current technology. Master Lin was simply bullsh*tting. I have been a plastic surgeon for twenty over years and I definitely don’t believe that Master Lin can help this female student regain her looks. It’s impossible now and even ten years from now. If anyone of you doesn’t feel confident in your looks, you can come and look for me. We are professional and our doctors are the best from all around the world. We can give you the perfect looks that you want. Please call the number below for inquiries.”</p><br/><p>This surgeon spoke about this matter to gain some popularity.</p><br/><p>The plastic surgery industry had really stiff competition. If he didn’t think of something to boost his popularity, it would have been difficult to survive.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“I feel that his words are really logical. Her face is so badly burned. If he can help her regain her looks, I’ll broadcast myself eating sh*t.”</p><br/><p>“I don’t know what to say about Master Lin. I think he is overconfident. I wonder who gave him so much confidence.”</p><br/><p>“You’re a bunch of idiots. Is Master Lin someone that you can understand? If you don’t believe in him, just wait for your face to get smacked.”</p><br/><p>“Haha, come at us. I’ll put my face on the line for him to smack. I want to see how he’s going to cure it.”</p><br/><p>“That’s right. This professional has more than twenty years of experience. How could he be wrong?”</p><br/><p>“Even if she were to go to Korea, she wouldn’t be able to fix her face.”</p><br/><p>“Guys, don’t argue with these idiots. Let’s just wait for Master Lin’s good news.”</p><br/><p>“Yeah, let’s wait.”</p><br/><p>…</p><br/><p>The discussion online wasn’t really intense. However, an interesting poll appeared on Weibo.</p><br/><p>It was about whether the student could regain her looks.</p><br/><p>She will recover: 15032 votes.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>She won’t recover: 52101 votes.</p><br/><p>The community on Weibo was paying close attention to this too. After all, it was about Master Lin. Now that there was a poll feature, they wanted to see what people thought about it.</p><br/><p>Of course, a lot of people felt that it was impossible.</p><br/><p>However, Lin Fan’s fans had to believe it even if they didn’t. Even if they were to lose, they still had to show their support for Master Lin.</p><br/><p>At the hospital.</p><br/><p>Lin Fan parked his car and looked at the nervous Jin Shan Ping. He smiled, “Don’t be too nervous. Be confident. Let’s go.”</p><br/><p>“Okay.” Jin Shan Ping nodded and tried to encourage herself.</p><br/><p>Regardless of the final outcome, she was already in her worst state. Why should she be afraid of it becoming worse?</p><br/><p>“Master Lin…”</p><br/><p>Lin Fan raised his head and turned around. He was stunned by what he saw and he sighed. The group of reporters was really crazy. They actually followed him there.</p><br/><p>“What are you doing?” Lin Fan smiled and asked.</p><br/><p>The reporters looked at Master Lin ecstatically, “Master Lin, yesterday, you said that you’re going to treat student Jin’s face. May I know how you’re going to do it? Some of the professional plastic surgeons expressed their thoughts online and they said that it’s impossible.”</p><br/><p>Lin Fan was stunned. He didn’t know who he had offended. What did this have to do with those professionals?</p><br/><p>“How am I supposed to answer this? I am not on the same level as them. They want to improvise people’s faces but I want to regain her looks. Therefore, they can’t understand my methods at all.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He didn’t care about what the professionals said. They felt that what Master Lin said made sense too.</p><br/><p>He was really young and it was infuriating to compare him to the experienced professionals.</p><br/><p>“Master Lin, may I know how you’re going to treat student Jin’s face?” A reporter asked.</p><br/><p>Lin Fan wanted to pretend to be awesome and say that he was going to use a medicinal pill. However, it would have sounded crazy. Therefore, he had decided to stay low-key.</p><br/><p>“I’m going to use the tools in the hospital and a medicinal pill that I specially crafted.” He felt that it was better to put it that way.</p><br/><p>When the reporters heard that, they were stunned.</p><br/><p>What did Master Lin just say?</p><br/><p>He said that he was going to use the hospital’s tools and a medicinal pill.</p><br/><p>Lin Fan felt that the expressions of the reporters seemed a little weird. He wondered if he had shocked them.</p><br/><p>“Master Lin, how long would she need to recover?” The reporters asked.</p><br/><p>Lin Fan was fearless. He didn’t even need to think about how many days he required. The medicinal pill had immediate effects. Furthermore, he loved to play with people’s thoughts. He immediately raised one finger.</p><br/><p>The reporters were stunned, “One month?”</p><br/><p>Lin Fan shook his head, “One day.”</p><br/><p>*clatter!*</p><br/><p>The reporters felt that Master Lin was crazy. He wasn’t treating a cold. He was trying to regain his looks.</p><br/><p>Even if the best plastic surgeon were to perform the surgery, she would need a long time to recover.</p><br/><p>What did they just hear?</p><br/><p>Who would believe that she would only require one day to recover?</p><br/><p>Lin Fan smiled, “Alright, don’t say too much. Time is precious. I’ll speak to you after this.”</p><br/><p>He had the medicinal pill and he wasn’t afraid of others knowing about it.</p><br/><p>“Let’s go,” Lin Fan smiled and said.</p><br/><p>Jin Shan Ping was really stunned. She just nodded and followed Lin Fan. She just heard what he said and she was also in disbelief.</p><br/><p>The Director of the hospital knew that the Godly Doctor Lin was coming to the hospital and he needed a surgical theatre. He immediately agreed to his request without any hesitation.</p><br/><p>However, Lin Fan didn’t want anyone to see this surgery.</p><br/><p>Because if they were to see it, Lin Fan was afraid that they would question themselves about life.</p></div>\n</div>"}