{"title": "Chapter 850 - Come if you dare", "id": 850, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-850-come-if-you-dare", "volume_title": "Volume 9", "body": "<h1>Chapter 850 - Come if you dare</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>On Weibo.</p><br/><p>Lin Fan realized that he suddenly had a lot of people visiting his page and they were flaming him.</p><br/><p>“F*ck your mom. What a loser Master Lin. What does our school incident have anything to do with you?”</p><br/><p>“That’s right. Do you think you can do this because you’re a little famous? You’re nothing but child’s play in our eyes.”</p><br/><p>“Haha, how righteous. If you’re so righteous, ask the girl to be your wife. Idiot.”</p><br/><p>“Someone like him actually has a group of hardcore fans. That’s so hilarious. He even said that people from our school are idiots. I think you’re the real idiot.”</p><br/><p>Jin He University had quite a lot of students that were involved in this. They knew who Master Lin was but they were all youngsters. They were fearless and they somehow hated those that were famous.</p><br/><p>The more famous you were, the more you would be flamed when you do something controversial.</p><br/><p>However, they didn’t think about something.</p><br/><p>Lin Fan’s righteous fans didn’t just remain silent. They immediately retaliated.</p><br/><p>“D*mn, these losers came to our territory to cause trouble. Brothers, let’s go.”</p><br/><p>“F*ck your moms. These bunch of losers should look at where they are. They must be tired of living.”</p><br/><p>“Let’s destroy them.”</p><br/><p>In an instant, Lin Fan’s Weibo became really chaotic. Of course, those that came to flame got drowned in the comments of his fans.</p><br/><p>Lin Fan shook his head, “Sigh, why do people have such bad character? When I was in University, I was so different.”</p><br/><p>The reporters were observing the situation online. When they saw Master Lin speaking up about this, they were ecstatic.</p><br/><p>The things that Master Lin was involved in would definitely be nice to watch.</p><br/><p>However, Jin He University didn’t care about that. They had already sent their notice and they had to keep to it. They couldn’t withdraw the expulsion letter because people objected it.</p><br/><p>This matter had too many students’ objection. A lot of University students also said that if she didn’t leave the school, they would leave instead.</p><br/><p>At Jin He University.</p><br/><p>At a random female hostel. A group of fashionable and pretty female students was gathered together and all of them were smiling.</p><br/><p>One of the students looked really happy and she felt great.</p><br/><p>“Look, this matter had been blown up. I don’t believe the fella wouldn’t get out of here.”</p><br/><p>“I didn’t expect the thing we started for fun had become like this. It has such a great impact.”</p><br/><p>“Haha, she’s so dishonest. We already asked her to join us as a form of respect but she rejected us.”</p><br/><p>“You’re our big sister indeed. This method is so good. Spreading rumors in our school and sending pictures to scare all the guys. Now that the school can’t take it anymore, they have to expel her.”</p><br/><p>“However, Master Lin came out to speak about it on Weibo. He said that what the school did was discriminatory. What do you think?”</p><br/><p>“Haha, he’s an outsider. Whatever comments would be useless. He’s just being a busybody. He probably doesn’t even have a girlfriend.”</p><br/><p>“Do you think Master Lin is gay?”</p><br/><p>“Haha, that’s possible.”</p><br/><p>Then, in another hostel nearby.</p><br/><p>A disfigured lady was sitting there with her head lowered. She was the student that was about to be expelled.</p><br/><p>Jin Shan Ping didn’t know what to do. She knew what was happening in school. She lived alone in the hostel and nobody was willing to stay with her. Even her classmates stayed away from her.</p><br/><p>In class, she sat alone and people ignored her. Even the teachers ignored her. Everyone despised him.</p><br/><p>She was already used to the situation. She had been facing this situation since high school. However, it was a little different then as she had a caring teacher. It made her feel that at least someone in school cared about her.</p><br/><p>However, things were different after coming to University.</p><br/><p>Everyone hid from her.</p><br/><p>Suddenly!</p><br/><p>She heard some noises from outside and she began to tremble in fear.</p><br/><p>“Get out of the school.”</p><br/><p>“Jin Shan Ping, please leave and return us our good school.”</p><br/><p>Those that stayed in the hostel opened their windows and looked at what was happening outside.</p><br/><p>A group of people was holding sign boards and shouting towards the female hostel.</p><br/><p>The content on the signboard was ‘Jin Shan Ping, please leave our school. You’ve scared us.’</p><br/><p>The content was really hurtful.</p><br/><p>Those students that weren’t involved in this felt that these people were too much. However, they couldn’t do anything about it. Besides standing up for her online, they were helpless.</p><br/><p>“How could they do that?”</p><br/><p>“Yeah. Although I don’t really want to know her, I don’t feel that she’s repulsive. I think Jin Shan Ping has great character. She often helps to throw away the rubbish at the entrance of our hostel.”</p><br/><p>“Sigh, what can we do? I heard she ran into a fire three years ago to save her neighbor’s kid. That’s how she got burnt.”</p><br/><p>The people were chanting non-stop outside.</p><br/><p>“Jin Shan Ping, please leave. Return us our beautiful school.”</p><br/><p>Those chants were really loud and a lot of students gathered to watch. Some even started recording it while others also joined in. After all, the spectators didn’t understand the gravity of the situation. When things didn’t happen to them directly, they wouldn’t know how much it hurt.</p><br/><p>A random northeastern girl couldn’t take it anymore. She opened her window and shouted, “You guys are too much. How could you be so disgusting? I think all of you are polluting the school environment.”</p><br/><p>A girl that stayed with her immediately dragged her back. “Don’t scold them. It’ll get you into trouble.”</p><br/><p>Below the hostel.</p><br/><p>“What are you shouting about? If you’re brave, come down and talk to us.”</p><br/><p>“I know which hostel you belong to. Girls, let’s go and teach her a lesson,” shouted a girl below the hostel.</p><br/><p>The northeastern girl immediately took out a large sword from her wardrobe that she used for arts performances. She said angrily, “F*cking losers. If you have guts, get up here now. If I don’t slice you open, I would jump down from here.”</p><br/><p>After she said that, a lot of people got cared.</p><br/><p>“Let’s ignore her and continue shouting.” Some girls were frightened and they didn’t want to mess with her anymore. Their main aim was to drive Jin Shan Ping out.</p><br/><p>The school management had found out about this situation.</p><br/><p>They immediately sent people over.</p><br/><p>They didn’t expect the students to have dared to do such a thing in school. If this were to be reported, people would definitely laugh at them.</p><br/><p>They had already sent her an official request for her to leave the school. After all, they couldn’t have done anything else besides that.</p><br/><p>These students were causing so much trouble. Did they really want to blow this matter up even more?</p></div>\n</div>"}