{"title": "Chapter 863 - Such lousy bragging", "id": 863, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-863-such-lousy-bragging", "volume_title": "Volume 9", "body": "<h1>Chapter 863 - Such lousy bragging</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Jin Shan Ping came to Lin Fan and shouted, “Master Lin…”</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan smiled and looked at her, “How is it? You look the same as before, right?”</p><br/><p>Fraud Tian and the others were stunned after hearing the name and seeing her face.</p><br/><p>“This is Jin Shan Ping? The girl that got burned?”</p><br/><p>They thought that her looks would only be improved slightly. However, they were stunned by what they saw.</p><br/><p>Were she even the same person as before?</p><br/><p>Zhao Zhong Yang was in disbelief, “You’re Jin Shan Ping?”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Jin Shan Ping round it difficult to contain her emotions, “Yeah, I am Jin Shan Ping. I have to thank Master Lin for everything.”</p><br/><p>After hearing that, Zhao Zhong Yang didn’t know what to say.</p><br/><p>Unbelievable!</p><br/><p>It was really unbelievable!</p><br/><p>“Master Lin, thank you so much,” Jin Shan Ping said with utmost gratitude. She immediately kneeled in front of Lin Fan without any hesitation. She said sincerely, “Master Lin, if not for you, my future would have been affected. Thank you for giving me a new life.”</p><br/><p>Then, the reporters quickly recorded what was happening.</p><br/><p>They were really happy for her. She recovered really quickly and she wouldn’t be laughed at anymore.</p><br/><p>She could do everything like a normal human being.</p><br/><p>Jin Shan Ping kneeled to thank Master Lin and it was an understandable action. It was as if she had been given a new life. If not for Master Lin’s help, Jin Shan Ping’s life would probably be in shambles.</p><br/><p>Even if her results in school were really good, it would have been useless.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>That was because no company would want to hire a girl that looked like her. Even if they were to hire her, it would be out of pity. They wouldn’t let her be at the forefront of the company’s operations.</p><br/><p>“Quick, get up. You don’t have to do this. It was a simple task.” Lin Fan felt a little embarrassed. Not many people had kneeled before him and it was even more embarrassing to have a lady do that.</p><br/><p>Jin Shan Ping was really grateful for Lin Fan. It couldn’t be described with words.</p><br/><p>The excitement was like winning the lottery.</p><br/><p>Then, the reporters surrounded Lin Fan.</p><br/><p>“Master Lin, may I know how you did that?”</p><br/><p>“Can you please tell us? We really want to know.”</p><br/><p>“Master Lin, that’s really unbelievable. If We didn’t see it with our own eyes, we wouldn’t have believed it.”</p><br/><p>The reporters were in horrified and shocked. They had encountered a lot of weird occurrences as reporters but they had never seen anything like this.</p><br/><p>Lin Fan thought about it for a moment but he didn’t know what to say to the reporters.</p><br/><p>“Actually, it’s not really impossible. I told you that I used the medicinal pill that I crafted to treat Jin Shan Ping.”</p><br/><p>The reporters were even more curious when they heard about the medicinal pill.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Master Lin, what medicinal pill is it? It is so powerful.”</p><br/><p>Lin Fan said calmly, “I named it as The Beautifying Pill. Of course, it is very effective by it still depends on my medical skills.”</p><br/><p>The reporter added, “Master Lin, does that mean that it can treat burn marks on a person’s face of any severity?”</p><br/><p>“Theoretically, yes. However, I need to be attending to the person. If not, it would be impossible.”</p><br/><p>The reporters were stunned. They didn’t expect such a medicinal pill to exist.</p><br/><p>“Master Lin, may I know how you crafted the medicinal pills?”</p><br/><p>Lin Fan didn’t really know how to answer that question. However, since he was given the opportunity to act like he was an awesome man, he didn’t want to miss it.”</p><br/><p>“My reporter friend, I don’t really know how to answer this question of yours. Since you asked it, I’ll try to answer it. Everyone knows that my medical skills are second to none. The medicinal pills require knowledge about Chinese medicine. Of course, this is entirely different from the ancient crafting of medicinal pills. It isn’t what you’re thinking about,” Lin Fan answered.</p><br/><p>If someone dared to say that they had the best medical skills, the person would probably be flamed to death.</p><br/><p>However, as Master Lin was the one who said it, they couldn’t argue about it because it was the truth.</p><br/><p>They had to accept it.</p><br/><p>Then, another reporter asked, “Master Lin, may I know if the medicinal pills will be available in the market?”</p><br/><p>Lin Fan shook his head, “Nope. It is really difficult to craft these pills and it involves a lot of steps. Furthermore, only I can do it.”</p><br/><p>The reporters felt that it was a pity. However, they didn’t bother too much about it. They continued to ask more questions.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Master Lin? Can you tell us why your medical skills are so good?”</p><br/><p>When Lin Fan heard that, he smiled, “Because I’m already an awesome individual.”</p><br/><p>Fraud Tian was helplessly looking at them. These reporters were actually creating the perfect environment for this fella to pretend to be awesome.</p><br/><p>He was envious and jealous.</p><br/><p>Lin Fan was being pestered by the reporters until about 6 pm.</p><br/><p>Lin Fan didn’t say much about it. Sometimes, it felt like a sin to be so popular.</p><br/><p>He felt that it was a really normal occurrence but the reporters felt that it was an impossible dream come true.</p><br/><p>It was an unrealistic event.</p><br/><p>He sent the reporters off.</p><br/><p>Lin Fan smiled. He felt that the day was really great.</p><br/><p>Fraud Tian looked at Lin Fan, “Do you feel really good?”</p><br/><p>Lin Fan chuckled, “What do you think?”</p><br/><p>Wasn’t that a stupid question? He acted like he was an awesome individual for the entire time in front of the reporters. How could he be feeling upset?</p><br/><p>Fraud Tian looked at Lin Fan grudgingly. He was really envious and jealous of him. He wondered why he didn’t receive such treatment. He really wanted to be like this fella and act like he was an awesome man in front of reporters.</p><br/><p>If he could experience that once, it would have been good enough.</p><br/><p>The next day!</p><br/><p>The Internet was peaceful and quiet.</p><br/><p>The reporters hadn’t posted the news online yet. It was as if they had a mutual agreement with each other about it.</p><br/><p>The poll on Weibo.</p><br/><p>There were a few million people that voted that it was impossible.</p><br/><p>“Haha, where’s the news? Why isn’t there any news about it?”</p><br/><p>“Isn’t she dreaming? How can she recover from that?”</p><br/><p>“Master Lin is going to be shamed.”</p><br/><p>“Her injuries are so serious. If she could recover from it, it’d be crazy.”</p><br/><p>Those professional plastic surgeons also expressed their thoughts.</p><br/><p>Shanghai Angel Beauty Services: Considering the severity of the burns, the current technology will not be able to let her recover 100%. Our company will use other parts of her body to do a transplant for her recovery. With Jin Shan Ping’s condition, we are confident of helping her recover by 50% or so.</p><br/><p>“666… They’re indeed a big company that has undergone professional training in Korea.”</p><br/><p>“Haha, it’s a joke. Master Lin should’ve done research before bragging about it. Ask, I can’t believe a few hundred thousand people voted that they believe she’d recover fully. I have to say that these hardcore fans are too scary.”</p><br/><p>“That’s right. I’ve never had a good impression of Master Lin. He’s too arrogant. He thinks that nothing is impossible for him. Look at the situation now. It’s impossible for him to brag about it anymore.”</p><br/><p>Those that always supported Master Lin hadn’t come out to speak about it yet. They were curious as to why there was no follow up to the matter.</p><br/><p>A new headline also appeared on Weibo.</p><br/><p>‘Master Lin, you should stop with your bragging.’</p><br/><p>Although it didn’t manage to enter the trending list, it was still one of the top five most popular news.</p><br/><p>…</p></div>\n</div>"}