{"title": "Chapter 878 - The priests are going to be moved again", "id": 878, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-878-the-priests-are-going-to-be-moved-again", "volume_title": "Volume 9", "body": "<h1>Chapter 878 - The priests are going to be moved again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The ‘Silent Priest’ stood in silence and shock. There was a slight feeling of hurt. He felt that he was going to be defeated again.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He had been at the Daoist Temple for more than ten years and he had been the most knowledgeable priest for the longest time. He had been living a happy life. However, he didn’t feel any happiness now. He felt as if his life was going to change.</p><br/><p>Lin Fan waved his hand at them and looked at the ‘Silent Priest’. He needed to tell the priests about the situation. It wasn’t easy to meet people that he could interact and exchange knowledge with.</p><br/><p>“Everyone, please look here. Although it may seem ordinary, if you look at it closely, you will be able to figure something out about the disease,” Lin Fan said as he pointed at the back of Mu Hui Min’s neck.</p><br/><p>Although the ‘Silent Priest’ was feeling uneasy, he still stared intently. Gradually, he understood what Lin Fan was trying to explain. He hadn’t expected to be able to find such information on the back of her neck.</p><br/><p>He was pretty impressed with this youngster.</p><br/><p>“Look here,” Lin Fan said and pointed.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The ‘Silent Priest’ looked closely. His furrowed brows gradually relaxed. He realized that he was slowly understanding the situation.</p><br/><p>The others didn’t say anything and everyone was listening attentively.</p><br/><p>Mu Hui Min’s family members were especially excited. They felt that their daughter’s illness was finally going to be cured.</p><br/><p>Master Lin was working together with the ‘Silent Priest’. What disease could be too difficult for them to cure?</p><br/><p>The ‘Silent Priest’ took up a brush and wrote what he wanted to say on a piece of paper. He started to write even faster as he continued writing the analysis of her illness.</p><br/><p>Lin Fan looked at the content that he was writing and nodded. “Yes, your analysis is correct. That is indeed the case. However, that is just the first case. There is another possibility. Don’t worry, we can continue slowly.”</p><br/><p>Then, the situation seemed like an exchange of knowledge between Master Lin and the ‘Silent Priest’.</p><br/><p>Although the ‘Silent Priest’ could not talk, he wrote rapidly.</p><br/><p>If there were professional medical experts there, they would probably be stunned speechless. The content that they were discussing would probably confuse many experts.</p><br/><p>Some might even find it impossible.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>After some time, the ‘Silent Priest’ felt that all his confusion had been resolved and he smiled. Then, he took his brush and wrote: ‘Give me another six months.’</p><br/><p>Mu Dao Xiong and the others were so anxious that they didn’t know what to say. Their daughter could finally recover. She could finally do without the wheelchair.</p><br/><p>They couldn’t contain the excitement within themselves and they started to show their gratitude.</p><br/><p>The ‘Silent Priest’ was in a good mood and he nodded towards Lin Fan. Lin Fan’s explanation and analysis had been logical, which enlightened him to come up with a feasible treatment plan.</p><br/><p>This round could be considered a draw.</p><br/><p>However, the smile on the ‘Silent Priest”s face suddenly disappeared. He just looked dumbfounded.</p><br/><p>“There’s no need to wait for six months. I have a medicinal pill that is suitable to cure it,” Lin Fan said and smiled. The exchange of knowledge had already been successful. If he were to let the priests research and develop the medicinal prescription, it would mean that they wouldn’t have time to interact with him.</p><br/><p>The ‘Silent Priest’ looked at Lin Fan in shock. After explaining her situation, he actually had the cure. What had been the point of explaining things to him then? Had it just been to teach him?</p><br/><p>Lin Fan placed the medicinal pill in Mu Hui Min’s mouth and pressed several parts of her body. Then, he smiled, stood beside her and waited patiently.</p><br/><p>Mu Dao Xiong and the others stared at her nervously. They wondered what was going to happen.</p><br/><p>The ‘Silent Priest’ knew that it was all over when he saw Lin Fan take out the medicinal pill.</p><br/><p>Initially, he had wanted to use this chance to win Lin Fan. However, it seemed like that was impossible now.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Pill concoction?</p><br/><p>He hadn’t expected this fella to even know how to concoct pills. He really wanted to ask what did he not know how to do.</p><br/><p>Suddenly!</p><br/><p>Mu Hui Min’s expression changed.</p><br/><p>“It is done,” Lin Fan smiled and said. He knew that the problem was resolved. The medicinal pill was in effect.</p><br/><p>The ‘Silent Priest’ looked at her in shock. <em>How can it be? Why was it so quick?</em></p><br/><p>He felt that it was literally impossible for that to happen.</p><br/><p>However, the truth was right before his eyes. He had to believe it.</p><br/><p>“Dad, mum…” Mu Hui Min gradually regained her senses and cried out gently after looking at the people around her.</p><br/><p>“My daughter, you’ve finally recovered.” Mu Hui Min’s mother was clearly very emotional. She was finally done enduring the days of suffering.</p><br/><p>The others also gasped and shouted.</p><br/><p>“Godly Doctor Lin is incredible. His medical skills are amazing.”</p><br/><p>“Yeah, I only dare to believe it after witnessing it. It’s so incredible.”</p><br/><p>“Did you take a video of that?”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Yeah. I took a video right from the start. However, isn’t Master Lin supposed to be in Shanghai? Why is he here?”</p><br/><p>…</p><br/><p>Mu Dao Xiong went forward and grabbed Lin Fan’s hands in gratitude. “Master Lin, thank you so much. Really.”</p><br/><p>Lin Fan smiled. “You don’t have to thank me. It was just an opportunity for me to share knowledge with the priests around here. Her illness is indeed really rare but it is cured now. You don’t have to worry.”</p><br/><p>The ‘Silent Priest’ felt a little embarrassed. He had just lost again.</p><br/><p>He felt that it hadn’t been a medical discussion. It had felt more like a teacher sharing his knowledge with his students. That feeling made him really helpless.</p><br/><p>Mu Hui Min was still pretty weak after regaining her senses. However, she was ecstatic when she saw Lin Fan. “Master Lin, you must be Master Lin…”</p><br/><p>Lin Fan nodded calmly at the ecstatic lady.</p><br/><p>Mu Hui Min said, “Master Lin, I am a fan of yours and I have been looking at your Weibo. I know everything about you.”</p><br/><p>“That isn’t worthy of being mentioned. Perhaps we share some affinity,” Lin Fan smiled and said.</p><br/><p>Mu Hui Min nodded happily. “I am a fan of yours. I didn’t expect you to personally cure my illness. I am really happy.”</p><br/><p>Lin Fan replied, “It’s okay, don’t be overly excited. You have to take care of yourself.”</p><br/><p>“Yes, yes.” Mu Hui Min nodded. She had been reading about Master Lin and she felt that he was completely different from those that lusted for money and women.</p><br/><p>He dared to speak up for people and scolded people whenever things made him unhappy. She really liked his personality.</p><br/><p>She was especially happy since her idol had just cured her of her illness. She wanted to boast to her friends after she returned back home.</p><br/><p>Her friends knew how much she worshipped Master Lin. Also, many of her friends also liked Master Lin. If they knew about what had happened to her, they would probably be really envious of her.</p><br/><p>“Master Lin, please keep this.” Mu Dao Xiong took out a card and handed it to him. He didn’t feel that this matter could be resolved with money just because he was rich.</p><br/><p>His actions were really respectful and he wasn’t condescending.</p><br/><p>“Alright, then don’t mind if I do.” Lin Fan didn’t reject his gift. He took it and said, “The ‘Silent Priest’ also contributed a lot. Please do not forget his contributions.”</p><br/><p>“Of course.” Mu Dao Xiong took out another card without any hesitation.</p><br/><p>Lin Fan felt that, in order to develop a friendship, he shouldn’t be the only one to be rewarded. He felt that this gesture of his was going to move the priests there.</p><br/><p>The ‘Silent Priest’: “…”</p><br/><p>…</p></div>\n</div>"}