{"title": "Chapter 883 - With a little hard work", "id": 883, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-883-with-a-little-hard-work", "volume_title": "Volume 9", "body": "<h1>Chapter 883 - With a little hard work</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The situation here today at Cloud Street was something Lin Fan had anticipated.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>After a long night of thinking, he had already gotten his thoughts straight. His dad had been right. With greater capabilities came greater responsibility. Since he had this capability, he had to use it to make the world a better place.</p><br/><p>Furthermore, his own student’s greatest wish for his life was to let Chinese medicine become recognized on an international scale.</p><br/><p>Since his disciple had been so good to him, he definitely wanted to help him fulfill his dream.</p><br/><p>He did not want to hide it anymore and was going to come out clean.</p><br/><p>“Wow! Master Lin is here.”</p><br/><p>“Master Lin, over here.”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Master Lin, save me…”</p><br/><p>When Lin Fan reached, the entire scene erupted. The reporters all rushed to surround LIn Fan. The people who were on the outside all tried to squeeze their way in and touch Lin Fan.</p><br/><p>The situation had definitely blown up. Hiding was definitely not an option. Furthermore, there were so many people at the scene. If they kept pushing around and someone were to get trampled on, it would not be good.</p><br/><p>Beneath all this noise, the townsfolk were all very well-behaved and just stood at their original spots.</p><br/><p>“Excuse me for a moment,” Lin Fan said.</p><br/><p>He was really not in a good position to speak to them.</p><br/><p>There were way too many people and they had already filled Cloud Street to the brim.</p><br/><p>When he reached the entrance to his shop, Lin Fan glanced at Zhao Ming Qing and nodded. He looked at the situation in front of him and jumped up, grabbing onto the frame of the building with his palm. Then, he stood up on the roof of the building.</p><br/><p>He sighed in relief. He felt like he could address them a lot better from here.</p><br/><p>“Okay, I know why you guys have come here. That’s right. And I’m going to talk to you guys honestly and say that I have indeed defeated Leukemia,” Lin Fan opened his mouth and said.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>With this sentence, the spirits of everyone on the scene was lifted. All those family members of Leukemia patients became so worked up that they started crying.</p><br/><p>That was the sentence they were here to hear.</p><br/><p>Even those medical specialists and professors were very surprised when they heard that. Then, some of them who could not accept it said, “What kind of proof do you have? Can you prove that what you’re saying is true?”</p><br/><p>Lin Fan cut straight to the chase and said, “Those who don’t believe me can leave. I said that I have defeated it and that means that I have defeated it. If you don’t believe me, you can leave. You can just take it as if nothing ever happened.”</p><br/><p>A few of the of the townsfolk looked towards where the sounds of the doubters came from and yelled, “If you don’t believe him then leave. How dare you still question him.”</p><br/><p>“That’s right.”</p><br/><p>“Master Lin, we believe you.”</p><br/><p>The expressions of the medical specialists did not look too good. However, they did not leave. They felt very suspicious inside. Even if they did not believe it, it was happening. They felt like Leukemia was a really severe disease, so they could not believe that it was so easily beaten.</p><br/><p>One of the reporters rushed to ask, “Master Lin, how did you manage to defeat Leukemia?”</p><br/><p>Lin Fan replied, “My reporter brother, you should know that I used a pill. It is classified as Chinese medicine.”</p><br/><p>“Medicinal pills!”</p><br/><p>Everyone was astonished. To have this news right from Master Lin’s mouth was a lot more astonishing than when they saw it on the news.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Chinese medicine is pseudoscience. Concocting pills is a pseudoscience within a pseudoscience. Don’t believe him,” the medical specialists who spoke up just now spoke up again, “You are speaking off the cuff and deceiving everyone.”</p><br/><p>Lin Fan a little unhappy. He replied, “Which hospital are these people from? Come, please get them away from here. I said it already, those who don’t believe me should leave.”</p><br/><p>At this moment, the eyes of everyone fell onto the medical specialists. They were all filled with resentment.</p><br/><p>“If you guys dare to say another word of rubbish, I’ll beat you guys up.”</p><br/><p>Bombarded by the fury of everyone, the medical specialists shut their mouths. They were just in complete disapproval of this. Also, they had not thought that these townsfolk would get so worked up.</p><br/><p>They decided to be a bit more well-behaved. If not, they would incur the rage of the crowd and get beaten up.</p><br/><p>Another reporter rushed to ask, “Master Lin, if this pill is released to the world, how much would it cost?”</p><br/><p>Lin Fan waved his hand and said, “Don’t talk to me about money. I don’t have any interest in money. If it is possible, I hope to make it free.”</p><br/><p>With this sentence, everyone in the crowd was touched.</p><br/><p>The reporters also started to look at Lin Fan in a greater light. The words he as saying were really too beautiful.</p><br/><p>‘I don’t have any interest in money…’</p><br/><p>However, this sentence was not just Lin Fan trying to boast. He really had no interest in money. He was already regularly spending a lot of money each day but he had so much money that he could not spend it all anyway.</p><br/><p>“Everyone, calm down. Actually, there’s something I want to say.” The moment Lin Fan opened his mouth and spoke, the entire crowd quietened down and listened to what Master Lin had to say.</p><br/><p>“The quantity of the pill is very limited. I only concocted 11 of them and now I’m only left with 10. There are so many people here so I will definitely not be able to satisfy the needs of everyone. Needless to say, there isn’t enough for the entire country’s population of Leukemia patients. Some of you might be thinking that I can just continue to concoct the pills. However, it is not easy to concoct pills, so it won’t be possible for me to spread the pill across the nation.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“When the news of this came out, I was stunned myself. Although I am unmatched in my medical proficiency, I won’t be able to use this pill to cure everyone.”</p><br/><p>Even when clarifying the situation, he did not forget to boast a little bit.</p><br/><p>There were so many doctors on the scene and when they heard this guy boast in front of all of them that he was unmatched in his medical proficiency, they were cursing madly on the inside. However, they did not say a word because the reckless words of his were actually pretty reasonable, so they had no response to that at all.</p><br/><p>The only thing was, the townsfolk refused to believe all of this.</p><br/><p>There were only 10 pills and the pills were not going to be able to be mass produced.</p><br/><p>What did that mean?</p><br/><p>It meant that only the small number of lucky people would get it.</p><br/><p>At this moment, the townsfolk were filled with despair. They had been given a ray of hope which, in the end, was forcibly taken away from them.</p><br/><p>A reporter said, “Master Lin, does that mean that there is no other way?”</p><br/><p>“Let me finish.” Lin Fan took in everything that had unfolded in front of him and could not help sighing. The most disappointing thing was that there had been clearly a huge amount of hope in them which had all turned into despair.</p><br/><p>“Actually, you guys need not worry too much. Although the pill will not be able to become widespread, I have already reached out to my student. We are prepared, as a duo, to concentrate on coming up with a prescription. We will do all we can to develop a prescription,” Lin Fan calmly said.</p><br/><p>Those townsfolk who had initially been filled with despair regained their endless amount of hope after hearing that sentence.</p><br/><p>The reporters all rushed to ask, “Master Lin, how long will this take?”</p><br/><p>Lin Fan said, “Relax. In order to make all these Leukemia patients healthy again, we will try to develop it as quickly as possible.”</p><br/><p>A reporter replied, “Master Lin, is there a high chance?”</p><br/><p>Lin Fan sighed and helplessly said, “It is high…”</p><br/><p>If he did not say that, he would not know how else to reply.</p><br/><p>Of course, he felt that if he was a bit more serious, it should not be too big of a problem.</p><br/><p>…</p></div>\n</div>"}