{"title": "Chapter 897 - What the hell am I fishing up?", "id": 897, "volume": 9, "url": "http://boxnovel.org/a-valiant-life-chapter-897-what-the-hell-am-i-fishing-up", "volume_title": "Volume 9", "body": "<h1>Chapter 897 - What the hell am I fishing up?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lin Fan hadn’t expected that Zhao Ming Qing would get sent somewhere else. It didn’t make sense at all. Could it be because they hadn’t handed over the prescription to the higher-ups?</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>If that was really the case, then those people were way too petty.</p><br/><p>Zhao Ming Qing said, “Teacher, the higher-ups have already chosen a new Director for the academy. I have no choice but to go.”</p><br/><p>“What? That’s ridiculous!” Lin Fan was taken aback. Then, he said, “Just retire then. In the future, just focus on studying Chinese medicine with me. When the time is right, we can go and do some volunteer clinical work. That would be much better than being in the school. Moreover, at your age, you should take care of yourself more.”</p><br/><p>When Zhao Ming Qing heard this, he smiled. “Alright then, Teacher, I’ll go and apply for retirement. I should’ve retired a long time ago but I just couldn’t let go of my work. Now that someone has taken over, I can rest well. In the future, I’ll put my all into learning from Teacher.”</p><br/><p>Lin Fan nodded. “Yup, go and tell the higher-ups. After you’re done, come and fish with me in the afternoon.”</p><br/><p>Zhao Ming Qing was surprised. “Teacher, you like fishing?”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“It’s to cultivate one’s mind and spirit.” Lin Fan was lazy to say too much. It was just to go and test out his major classification of knowledge.</p><br/><p>Zhao Ming Qing didn’t think too much of it. He felt that his teacher really had lots of interests and hobbies. He actually liked fishing too. However, Zhao Ming Qing hadn’t fished in a long time and felt that it would be a pretty good way to relax.</p><br/><p>After hanging up.</p><br/><p>Lin Fan had wanted to rage on Weibo a little but decided not to in the end. What was the point of losing his temper? Retirement might be a good thing for Zhao Ming Qing.</p><br/><p>However, those people’s actions were really dirty. He decided to slowly deal with them in the future.</p><br/><p>Zhao Zhong Yang asked curiously, “What’s wrong, Brother Lin?”</p><br/><p>Lin Fan shook his head. “Nothing. It’s just that Ming Qing got appointed to some random place, so I told him to just retire. What’s the point of going? Staying in Shanghai is the best.”</p><br/><p>“It can’t be. Director Zhao put his heart and soul into the Chinese medicine profession. Why would he get sent away?” Zhao Zhong Yang couldn’t quite believe it. Especially after being one of the participants in the development of the leukemia prescription, for Zhao Ming Qing to get sent away like that was unreasonable.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Not only had he not gotten promoted, but he got sent to somewhere worse. Who would be able to stand something like that?</p><br/><p>“Hehe,” Lin Fan just gave a little laugh and didn’t say anything else.</p><br/><p>Meanwhile, after Zhao Ming Qing had spoken to his teacher, he gave his superior a call, talking about his retirement decision. When the leader heard this, he even pretended to persuade Zhao Ming Qing to stay, talking about how the organization had entrusted him with this task and that he was the only one capable of handling it.</p><br/><p>He spoke a great deal of nonsense. About the importance of the task, the organization’s trust in Zhao Ming Qing, etc…</p><br/><p>But in the end, he accepted Zhao Ming Qing’s retirement decision without hesitation. His words had all been just formalities. Since Zhao Ming Qing wanted to retire, he could just retire.</p><br/><p>When Zhao Ming Qing heard that the opposite party accepted it, he heaved a sigh of relief. A large burden had been lifted off his chest.</p><br/><p>When he had taken up the appointment of Director of Shanghai Chinese Medical Academy, he had been cautious and conscientious, never daring to do too much. All he wanted was for every student to learn some useful knowledge. Now that he had suddenly left his appointment, he felt a sense of loss.</p><br/><p>But this was good too. In the future, he would finally be able to focus on learning Chinese medicine from his teacher.</p><br/><p>He could now put everything else away and let himself rest and recuperate.</p><br/><p>In the afternoon!</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>By the river.</p><br/><p>Lin Fan had bought two fishing rods from the fishing gear shop and some bait before coming to where he had arranged to meet Zhao Ming Qing.</p><br/><p>“Ming Qing.” In the distance. He saw Zhao Ming Qing standing there, gazing at the riverbank.</p><br/><p>Zhao Ming Qing saw his teacher and instantly smiled. He hurried over and said, “Teacher.”</p><br/><p>Lin Fan patted Zhao Ming Qing’s shoulder and said, “Don’t think too much. I think this may not be a bad thing.”</p><br/><p>“I’m fine, Teacher. It’s just that there’s a sense of loss in my heart,” said Zhao Ming Qing.</p><br/><p>Lin Fan smiled. Then, he passed a fishing rod to Zhao Ming Qing and the two of them sat down by the river. “Don’t think about it. Calm your heart and fish. Let’s see if we’ll be able to make some fish soup today.”</p><br/><p>“I haven’t fished in a long time. I’m a little rusty,” said Zhao Ming Qing with a chuckle. Then, he cast the fishing line into the water and waited silently.</p><br/><p>Meanwhile, as Lin Fan held the fishing rod, he felt a peculiar feeling. It was a strange and indescribable feeling but he could tell that it was very different from normal fishing.</p><br/><p>The Encyclopedia’s mystical power was flowing through the rod, all the way to the fishing line.</p><br/><p>Lin Fan hadn’t managed to catch anything yet but he wasn’t in a hurry. “Ming Qing, when do you plan to go to the mountain area?”</p><br/><p>Zhao Ming Qing thought for a moment. “I’ll wait a while more. Recently, there have been downpours over there and the paths are difficult to walk on now. Maybe in one or two months.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Don’t tire yourself too much. Even I’m worried about your body,” said Lin Fan.</p><br/><p>When he heard this. Zhao Ming Qing was so touched that he almost cried. “Teacher, I’ll take care of myself.”</p><br/><p>Lin Fan was actually very content with his disciple of his. Zhao Ming Qing was respectful and obedient to him. The only thing was that his body was a little old. Looking at Zhao Ming Qing, Lin Fan could feel the life in his body slowly depleting.</p><br/><p>Lin Fan really wanted to craft a vitality pill for Zhao Ming Qing, but the ingredients for this kind of pill didn’t even exist in this world.</p><br/><p>Just as Lin Fan was thinking about all this, Zhao Ming Qing called out in surprise, “It’s taken the bait!”</p><br/><p>Zhao Ming Qing stood up and slowly pulled his fishing line back. Then, he slowly raised it up. A small fish was hanging from his hook.</p><br/><p>“Look, Teacher, I caught a fish. Although I haven’t fished in a long time, my skills haven’t deteriorated.” On Zhao Ming Qing’s wrinkled face, a bright smile appeared.</p><br/><p>Under the sunlight, he looked as excited as a child.</p><br/><p><em>Huh?</em></p><br/><p>“Teacher, you’ve got a fish on your hook too!” Zhao Ming Qing cried out.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan felt a slight tug on his fishing line. He was instantly delighted. Then, he immediately pulled the rod.</p><br/><p>His heart was filled with delight. His disciple had already managed to catch something. As the teacher, how could he not catch anything?</p><br/><p>“It’s coming. This guy is pretty strong. Looks like it’s a big fish.” Lin Fan pulled on the rod excitedly and that ‘big fish’ finally emerged from the water.</p><br/><p>The two of them gazed in anticipation.</p><br/><p>But under the sunlight, the thing that he pulled up was glaring.</p><br/><p>It was red…</p><br/><p>A bra…</p><br/><p>The smile on Lin Fan’s face disappeared and he started cursing madly in his heart.</p><br/><p>Zhao Ming Qing burst out in laughter. “Teacher, that… Haha…”</p><br/><p>“Don’t laugh. Be serious.” Lin Fan stared it and didn’t have the energy to pull the bra back. He hadn’t expected to catch such a thing.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p><em>Where the hell did this thing come from?</em></p><br/><p>He removed the wet bra from the hook. He took a look at it and was about to throw it back but at this moment, he was stunned.</p><br/><p>Because he saw a marking on this bra that was a little strange.</p><br/><p>‘Production date: Year 2088’</p><br/><p>‘Effect: From A to D, increasing your confidence.’</p><br/><p>Lin Fan: “…”</p></div>\n</div>"}