{"title": "Chapter 903 - I won’t attend to this", "id": 903, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-903-i-won%E2%80%99t-attend-to-this", "volume_title": "Volume 10", "body": "<h1>Chapter 903 - I won’t attend to this</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The next day!</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Cloud Street</p><br/><p>“Brother Lin, the message you got me to deliver yesterday received a lot of registrations,” Zhao Zhong Yang said.</p><br/><p>Lin Fan asked curiously, “How many people are there?”</p><br/><p>“There are a lot of them. I think there are about 100 people. However, I don’t know how many of them are trolling us,” Zhao Zhong Yang said.</p><br/><p>“Alright. Please reply to them and get their personal information with the school that they are in. Get them to send it over. Also, get their salary expectations. Write everything clearly and organize the information. I will take a look at them.” He hadn’t expected this to be so popular with the people.</p><br/><p>Although he was not some superstar celebrity, he was pretty well known on the Internet. That gave him some extra points.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>However, it was all meaningless. The important thing was that the welfare benefits he provided had to be enough for them to make a living.</p><br/><p>Although it was a welfare organization, people couldn’t be taken advantage of. If not, even if people were willing to stay there, they wouldn’t be willing to stay there for life.</p><br/><p>“Alright, sure.” Zhao Zhong Yang nodded and proceeded.</p><br/><p>In the afternoon!</p><br/><p>Beside the river.</p><br/><p>Lin Fan had switched to a different location because he knew that people were going to look for him. He felt that there were only two possibilities.</p><br/><p>When the kid took out the medicinal pill, the others would guess that it was him. The second possibility was that they might come to the riverside to look for him.</p><br/><p>However, the first possibility was very likely.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Because the news about his medicinal pills had gone viral. If they were doctors, they would be able to guess it.</p><br/><p>However, he wasn’t afraid of it. He was prepared to deny everything and give some stupid reason to shake them off.</p><br/><p>Now that Zhao Ming Qing had retired, he wasn’t busy at all. He had called Lin Fan today to initiate a fishing session.</p><br/><p>Lin Fan initially hadn’t wanted to agree to it. After all, it would prevent him from using his ability fully. However, he felt that it was still okay since he was not in a rush. There were going to be a lot of opportunities for him to fish.</p><br/><p>The youngster and the old man sat there together.</p><br/><p>“Ming Qing, how do you feel? Do you feel relaxed after letting go of everything?” Lin Fan asked.</p><br/><p>Zhao Ming Qing nodded. “Yeah, it’s relaxing. I feel as if I’m a different person.”</p><br/><p>“That’s great. That way, you can improve your mood and become healthier,” Lin Fan said.</p><br/><p>*Ding ding!*</p><br/><p>Lin Fan looked at the display on his phone and smiled. Then, he picked up the call, “Elder Zheng, why did you think of calling me?”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Zheng Zhong Shan was situated in Beijing and the main form of communication was via phone calls. He would call him a few times a month but not too often.</p><br/><p>Zheng Zhong Shan laughed. “Elder Lin, why can’t I call you?”</p><br/><p>“Of course you can. I’m just curious. How’s your health now? Still going strong, I suppose?” Lin Fan asked. They usually spoke to each other about arts and literature. At the same time, they could get along with each other the best in the Chinese Arts Association. They usually just made small talk with the other members but there wasn’t anyone else that they could really get along with.</p><br/><p>“Going strong. I’m going strong. With such a godly doctor like you, even if I were to fall sick, I wouldn’t have to be afraid.”</p><br/><p>“Elder Zheng, your tone suggests that something is wrong. Tell me what it is. With our relationship, there’s no need to beat about the bush,” Lin Fan said. He wouldn’t reject Elder Zheng if he were to ask of a favor. After all, he had helped Lin Fan a lot too.</p><br/><p>Zhao Ming Qing was listening attentively beside him. He knew that the person on the phone was definitely not an ordinary man. After all, he could tell that from the way they addressed each other.</p><br/><p>“An old friend of mine has been in poor health recently. I would like you to take a look at him,” Zheng Zhong Shan said.</p><br/><p>Lin Fan knew that it had something to do with treating illnesses again. However, the fact that this man was friends with Elder Zheng meant that he wasn’t an ordinary man too. Then, he asked, “Who is the powerful man that made you ask for a favor?”</p><br/><p>Elder Zheng smiled. “Ma Jun Guo. He used to be my teammate.”</p><br/><p>“Ma Jun Guo?”</p><br/><p>The name was quite unfamiliar.</p><br/><p>Zhao Ming Qing was shocked, “The former Director of the nation’s Health Department…”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan was stunned. Then, he asked, “Elder Zheng, was he from the Health Department?”</p><br/><p>“Yes. However, he has retired. He’s the same as me now, just trying to be healthy. However, he doesn’t really like Chinese Arts. He prefers Chinese chess,” Elder Zheng said. He didn’t know the relationship between Lin Fan and the Health Department. If he had known about it, things would probably have become complicated and he wouldn’t have said that.</p><br/><p>“Elder Zheng, did you read the news recently?” Lin Fan asked.</p><br/><p>“No, why?” Zheng Zhong Shan was stunned. He didn’t know what Elder Lin meant.</p><br/><p>Lin Fan was against the Health Department and although they didn’t flame each other, it didn’t mean that they had forgiven one another.</p><br/><p>“Elder Zheng, I can’t help you with this. I really hate the people from the Health Department,” Lin Fan said directly. He didn’t want to hide anything from him. If this person hadn’t been from the health department, Lin Fan would’ve agreed to help.</p><br/><p>If Lin Fan really treated him, then what would that mean?</p><br/><p>He had been bullied by them and now they wanted him to treat their illness? He couldn’t take it.</p><br/><p>Zheng Zhong Shan was stunned. He asked curiously, “No, Elder Lin, listen to me. What’s the situation? Why are you in conflict with the Health Department? Don’t worry. Just tell me about it and I will resolve it for you.”</p><br/><p>Lin Fan replied, “That’s okay. Actually, I was in a good mood. Now that you’ve mentioned this, I feel annoyed again. I will hang up first. There are a lot of great doctors now. You can get your friend to choose someone else. Also, I am not an imperial physician.”</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Zheng Zhong Shan felt that the matter had become complicated and Elder Lin sounded agitated. “Elder Lin, don’t be agitated. We can talk things over.”</p><br/><p>“I’m not agitated. I’m just unhappy. I’ll be hanging up now. I’m fishing.” Lin Fan immediately hung up.</p><br/><p>Zhao Ming Qing was a little worried. “Teacher, there won’t be a problem, right?”</p><br/><p>“Nope. Let’s fish.” Lin Fan waved his hands.</p><br/><p>Beijing.</p><br/><p>Zheng Zhong Shan was stunned. He was confused about it. Then, he went to his study room to read the news.</p><br/><p>He did a search and everything was there for him to read.</p><br/><p>After reading everything, he finally understood the situation.</p><br/><p>He understood why Elder Lin hated the people from the Health Department. If it had been himself, he would hate them too.</p><br/><p>Then, he picked up his phone.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Elder Ma, let me ask you something. Did the current leader of the Health Department send you a gift?” Elder Zheng asked directly.</p><br/><p>Ma Jun Guo was stunned. He replied, “Elder Zheng, what do you mean by that?”</p><br/><p>Zheng Zhong Shan replied, “What else? If you didn’t receive a gift, why did you promote him to such a high position?”</p><br/><p>“No, Elder Zheng, you can’t accuse me.” Ma Jun Guo was anxious. That was clearly an accusation.</p><br/><p>“I looked for Elder Lin for you and when he heard that you’re from the Health Department, he didn’t even want to give me face. Go and read the news on the Internet and call me back. Tell me how you’re going to resolve this. Even I am angry now after reading the news…”</p><br/><p>Ma Jun Guo was speechless.</p></div>\n</div>"}