{"title": "Chapter 901 - I want to buy Da Luo Jin Xian", "id": 901, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-901-i-want-to-buy-da-luo-jin-xian", "volume_title": "Volume 10", "body": "<h1>Chapter 901 - I want to buy Da Luo Jin Xian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>By the river.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan took out various equipment from the car. He saw that quite a number of people were around, so he avoided them. He didn’t want others to see him fishing up all kinds of strange items. If people saw Master Lin fishing up a bra, they would die of laughter.</p><br/><p>He cast the fishing line and waited quietly. He knew that this required time and he wondered what would come up this time.</p><br/><p>In the distance, a seven-year-old boy passed by a small shop. He stood outside the entrance for a long while before going in.</p><br/><p>“Uncle, do you have Da Luo Jin Xian* for sale?” asked the little boy, staring at the shop owner with his big, round eyes. He was small in size, even shorter than the counter.</p><br/><p>The owner, who was playing with his computer, waved his hand and said, “Nope, nope.”</p><br/><p>The little boy was disappointed. Then, he went over to another small shop.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Auntie, do you have Da Luo Jin Xian for sale?” asked the little boy eagerly.</p><br/><p>The female owner looked at the little boy and couldn’t help but laugh. This boy was really amusing. “Child, Auntie doesn’t have it here.”</p><br/><p>The little boy left, disappointed. But he didn’t stop. He went to shop after shop to keep on asking.</p><br/><p>“Where did you come from, kid? Scram! Don’t bother us.”</p><br/><p>“No, no. Hurry up and leave.”</p><br/><p>“Whose family is this kid from? So naughty. Hurry up and leave.”</p><br/><p>The little boy went asking at many different shops and some of the owners waved him off impatiently. They felt like this kid was here to cause trouble. And some owners did not even bother with him.</p><br/><p>By the river.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The harvest this time was pretty good. Lin Fan had managed to fish up two items. One was a medicinal pill which didn’t belong to this world. When he fished it up, he knew at once. This was a healing pill, and the medicinal power it possessed was enough to cure all diseases that currently existed.</p><br/><p>This angling class of knowledge was really mystical. It could even be considered the most mystical among all of the classes of knowledge that Lin Fan possessed.</p><br/><p>The second item was a medicinal ingredient. A hundred-year-old piece of Chinese knotweed. When he fished it up and saw this sh*t-looking object, he had wondered what the heck it was. But when it entered his hands, he knew that this was a hundred-year-old Chinese knotweed. This made Lin Fan very excited.</p><br/><p>For him to be able to obtain these things that didn’t even exist, he felt really fortunate.</p><br/><p>Looking at the time, it was about time to leave. He had a clearer idea about the angling class of knowledge now. If he was lucky, he would be able to fish something up in an hour. If not, he might not even be able to get anything in two hours. And in between, some fish might even get hooked. It was pretty f*cked up.</p><br/><p>Just as Lin Fan was about to keep his fishing rod, a soft and immature voice came from behind.</p><br/><p>“Hello, Uncle…”</p><br/><p>Lin Fan turned around and saw a little kid staring at him, looking exhausted. He was a little curious. Then, he smiled and said, “What is it, kid?”</p><br/><p>This was a little strange. Where were this kid’s parents? Why didn’t they take care of him?</p><br/><p>“Uncle, do you know where I can buy Da Luo Jin Xian?”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>*Pfft!*</p><br/><p>When Lin Fan heard this, he burst into laughter. <em>Where is this kid from? Why is he so amusing? Da Luo Jin Xian? F*ck, who taught him about that?</em></p><br/><p>But Lin Fan didn’t say that there was no place that sold it. Instead, he decided to play along with the kid. “I know.”</p><br/><p>When the little boy heard this, he was so moved that he nearly cried. “Where is it, Uncle?”</p><br/><p>Lin Fan smiled. “Let me ask you, what do you want to buy Da Luo Jin Xian for? This isn’t something you can buy so easily.”</p><br/><p>The little boy really wanted to buy Da Luo Jin Xian, so he hurriedly answered, “I wanted to buy Da Luo Jin Xian for my uncle to eat. My uncle is sick and all the aunties say only Da Luo Jin Xian can save my uncle.”</p><br/><p>Lin Fan was startled. He couldn’t quite make sense of it.</p><br/><p>“Where are your parents?” asked Lin Fan.</p><br/><p>The little boy said, My dad and mom are in a faraway place and now, I only have my uncle with me. Uncle, please tell me quickly, won’t you?”</p><br/><p>When Lin Fan heard this, he was momentarily stunned. Then, he read the kid’s fortune, looking very closely. He was slowly taken aback. He could already see it.</p><br/><p>Pitiful. It was really pitiful.</p><br/><p>“What’s wrong with your uncle?” Lin Fan continued to ask.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The little boy appeared very excited. He had asked around for so long and finally, someone knew what he wanted.</p><br/><p>“My uncle was working when he fell from a high place. He has been on the sickbed since and never woke up. I want to buy Da Luo Jin Xian for my uncle so he’ll wake up,” explained the little boy.</p><br/><p>Lin Fan sighed, then patted the little boy’s head. “Good boy. Your uncle is lucky to have a nephew like you.”</p><br/><p>“Uncle, can you tell me where to buy it?” asked the little boy.</p><br/><p>Lin Fan smiled. “Kid, you’re in luck. Uncle has one with me right now.”</p><br/><p>He was going to give the medicinal pill that he had fished up to the kid. This pill was a priceless treasure to others but to Lin Fan, it was just a pill. He could craft another one anyway.</p><br/><p>The little boy jumped up in excitement. Then, he became a little nervous. “Uncle, how much are you selling it for?”</p><br/><p>Of course, Lin Fan could tell that the kid was nervous. “Uncle will give it to you as a gift.”</p><br/><p>The little boy immediately shook his head. “No way. My Uncle told me that I can’t just take things from people. I have to use my own money.”</p><br/><p>This little kid’s uncle had taught him pretty well.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Alright then. How much money do you have?” Lin Fan asked.</p><br/><p>The little boy inserted his white little hand into his pocket and took out a very old ten dollar note. Then, he asked cautiously, “Uncle, I only have ten dollars. Is it enough?”</p><br/><p>“Kid, you really are lucky. Uncle was just going to sell it for ten dollars. Here you go…” Lin Fan took out that pill from his pocket and placed it into the kid’s palm. “Take care of it. This is Da Luo Jin Xian. It’s very valuable. When you go back, put it into your uncle’s mouth and he’ll wake up very soon.”</p><br/><p>The way Lin Fan saw it, this kid probably wanted to buy Da Luo Jin Xian because many people had said, ‘Only Da Luo Jin Xian can save him now’. There must have been no other way to save his uncle.</p><br/><p>How would this kid have known what Da Luo Jin Xian was?</p><br/><p>“Uncle, here’s the money.” The little boy handed the money over to Lin Fan.</p><br/><p>Lin Fan kept the money and smiled. “Alright, how about Uncle send you home?”</p><br/><p>“No need, Uncle. I can go back myself. It’s very near.” The little boy shook his head. Then, he said in a grateful tone, “Thank you very much, Uncle. I’m leaving now. See you again.”</p><br/><p>Lin Fan waved at the little boy. “See you. Watch out for cars on the way home.”</p><br/><p>“Yep, I know.” Having bought the ‘Da Luo Jin Xian’, the little boy was elated and excited. As he walked with his short little legs, there was a skip in his step. At the same time, he kept the ‘Da Luo Jin Xian’ well protected for fear that it might drop.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan chuckled. Then, he kept his things in his car before leaving.</p><br/><p>…</p><br/><p>(*Note: Da Luo Jin Xian is the title of a Daoist deity.)</p></div>\n</div>"}