{"title": "Chapter 915 - A perfect conclusion", "id": 915, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-915-a-perfect-conclusion", "volume_title": "Volume 10", "body": "<h1>Chapter 915 - A perfect conclusion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Master Lin’s silence had made many people think that there must have been corruption involved in the matter, causing Master Lin to feel ashamed. That was why he had nothing to say when faced with the reporters.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Some celebrities in the entertainment industry were discussing it within their small personal groups as well.</p><br/><p>“This Master Lin has really fallen.”</p><br/><p>“The news on the Internet is way too hot. Everyone is talking about this matter. It seems that no matter what, as long as it is related to Master Lin, it will get in the headlines.”</p><br/><p>“What do you think about this incident? This Master Lin can’t really be this kind of person, can he?”</p><br/><p>“Who knows? But everyone makes mistakes. For this Master Lin to do something wrong is normal too. But because he’s a public figure, people won’t let it go so easily. That’s why things have turned out this way.”</p><br/><p>“I took a look at this matter. Those who got chosen aren’t that good-looking either. How could there be corruption involved?”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Who knows? Maybe he prefers women like that.”</p><br/><p>“Hehe…”</p><br/><p>Suddenly!</p><br/><p>Within the chat group, a celebrity spoke.</p><br/><p>“F*ck, I’m shocked. Hurry up and look at Master Lin’s Weibo.”</p><br/><p>“What is it?”</p><br/><p>“The tide has turned, it really has.”</p><br/><p>When they saw this, the other celebrities hurriedly went to take a look. Although it didn’t have anything to do with them, they were very nosy. Especially because it was related to Master Lin, it made them very interested.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Master Lin’s dedicated fans were overwrought. Regarding the situation on the Internet, they were extremely anxious. They had no idea why their idol wouldn’t explain himself. But they couldn’t just sit idly by. Hence, they were engaged in a flame war with those haters.</p><br/><p>It could be said that they were fighting a dark and gloomy battle.</p><br/><p>“You bunch of idiots. You’re still trying to clear his name? Let’s see you try!”</p><br/><p>“The more you try, the worse it gets. You’re saying that he read their fortunes? I think your idol has lost it.”</p><br/><p>“F*ck off! Everyone knows that Master Lin can read fortunes. He must have predicted something.”</p><br/><p>“You scum. Master Lin has done so many good deeds. He even developed a prescription for leukemia and publicized it freely. Yet, you still have the audacity to flame him.”</p><br/><p>“Developing the prescription doesn’t have sh*t to do with me. I don’t have leukemia anyway. I don’t need that prescription.”</p><br/><p>Facing such haters, they really couldn’t overcome them with words. No matter what they said, the haters wouldn’t believe them.</p><br/><p>“Haha, Master Lin has explained things. He has slapped you all in the face beautifully. Go and take a look! Then, tell me whether you still want to flame him.”</p><br/><p>In the middle of the intense argument, this comment suddenly appeared.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“D*mn, Master Lin has explained himself? I have to go and take a look.”</p><br/><p>At that moment, everyone rushed to Master Lin’s Weibo page.</p><br/><p>When they saw the post, they were all stunned.</p><br/><p>Lin Fan: “Initially, I didn’t want to say much on this matter because there was no need at all, nor did I want to cause trouble for anyone. However, the way things have developed has already gone beyond my expectations. As for those who failed to be hired, I am deeply disappointed. Since it has come to this, I can only reveal the conditions with which I picked my teachers.”</p><br/><p>“As everyone knows, I was choosing teachers for my welfare institute. And what children in welfare institutes lack in comparison to other children is a warm family. Therefore, when I was choosing teachers, I didn’t place emphasis on the applicants’ academic qualifications. Instead, I was looking at whether they were kind-hearted. To me, kindness is much more important than any academic qualification.”</p><br/><p>“The videos below are of the test that I had prepared for the applicants at the entrance of the welfare institute. I am very satisfied. Out of a hundred applicants, there were thirty who met my requirements.”</p><br/><p>“Seeing a child in need and stepping forward to help without minding the interview time. When I saw that, I already decided to hire them.”</p><br/><p>There were several videos that had been posted. And under each video, there was a description.</p><br/><p>Most people opened the first video and played it.</p><br/><p>In the video, a plump child was standing there and crying, about twenty meters away from the welfare institute. At the entrance, the applicants had gathered there. When the gates to the welfare institute were opened, some applicants chose to go and help that child while others completely ignored him and just went in for the interview.</p><br/><p>Another video showed the evil tyrant played by Zhao Tian Shan. This scene appeared on everyone’s screens.</p><br/><p>They watched each video very seriously. Although they were quiet, they understood what was happening on the display completely.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>After watching all the videos, everyone was silent.</p><br/><p>The fans who had kept their faith in Lin Fan the whole time started smiling happily. They were incomparably delighted because Master Lin turned out to still be the same Master Lin they knew. Nothing had changed.</p><br/><p>Meanwhile, those haters’ faces had turned pale. They felt that they had made a fool of themselves. This was completely different from what they had expected.</p><br/><p>“D*mn, I told you so. Master Lin definitely would not do such an unfair thing.”</p><br/><p>“Well played. This test was strict but I support it. This is a children’s welfare institute. Academic qualifications are not important at all. A child standing there by himself would surely make you feel unsettled but out of all these applicants, some of them actually acted like they didn’t see him. Between the interview and helping the child in need, they chose the interview. That’s why they failed.”</p><br/><p>“Motherf*ckers. I feel like I’ve been played by those people who failed to get chosen. This is f*cking outrageous. I can’t take it, I have to go and flame them.”</p><br/><p>“Forget it. Look at Master Lin’s post. He has already said the final word. This matter has concluded. There’s no need to cause trouble for anyone.”</p><br/><p>“I just can’t swallow this. I have to apologize to that Jiang Hui. I scolded her so harshly just now.”</p><br/><p>“Hurry up and go. Don’t be too rash next time. I knew that things would turn around, so I just waited all this while.”</p><br/><p>Those people who had not been hired were all stunned when they saw Master Lin’s Weibo. They had not expected things to turn out like this at all.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>At the entrance of the welfare institute, that child that they had seen had actually been the test itself. And because they had been in such a rush to go for the interview, they had chosen to neglect him.</p><br/><p>At that moment, they understood why they hadn’t been chosen.</p><br/><p>Some of them felt extremely guilty. When they looked at the posts that they had made on Weibo before, they felt as if they had been slapped in the face now.</p><br/><p>“I’m willing to pass down what I’ve learned to the little flowers of our country…”</p><br/><p>Now that they looked at it, these words were simply too disgusting.</p><br/><p>Then, some of them started to post apologies.</p><br/><p>Looking at this situation, Lin Fan shook his head. This matter really made him feel a little helpless.</p><br/><p>It had been a small matter but such a big deal had been made out of it. It was hard to imagine that this would happen.</p><br/><p>It seemed that he would have to be a little more careful in future.</p><br/><p>He had to reveal to the public what had to be revealed after all. The power of the Internet was not to be underestimated.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div></div>\n</div>"}