{"title": "Chapter 928 - Master Lin’s social circle is quite insane", "id": 928, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-928-master-lin%E2%80%99s-social-circle-is-quite-insane", "volume_title": "Volume 10", "body": "<h1>Chapter 928 - Master Lin’s social circle is quite insane</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The reporters had been waiting for a long time. That opening speech earlier had been supposed to make them feel bored but unexpectedly, a great piece of news had emerged from it and they were all very excited.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Now that they saw Master Lin walking towards them, they quickly kept their things and ran over hurriedly.</p><br/><p>They naturally had many questions in their hearts and most of them were about what had just happened.</p><br/><p>After all, others may not have recognized that man from before but they recognized him. That Chen Shi was in charge of the Education Department but just now, Master Lin hadn’t given him any face at all. Of course, it would be embarrassing for him.</p><br/><p>The reporters wondered if he would take revenge and make things hard for Master Lin.</p><br/><p>A reporter said, “Hello, Master Lin. May I know why you were against what Leader Chen Shi said previously? Is it because you don’t trust them?”</p><br/><p>Lin Fan replied with a smile, “It’s not that I don’t trust them but I don’t want to make things so troublesome. This is a welfare institute and all I want is to nurture the children. We don’t need to follow the standard way or whatever. If I choose my own teachers, I don’t have to worry.”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Another reporter asked, “Master Lin, do you have any other prospects for the welfare institute?”</p><br/><p>Lin Fan thought for a moment before answering, “My prospect is naturally for the welfare institute to keep improving. I want to build a library and I also want to build an apartment building for the teachers. Of course, the latter will have a great cost. I’m still quite poor and I need to earn money slowly. But there’s no hurry. It will eventually be realized.”</p><br/><p>The reporters were all stunned. They hadn’t expected Master Lin to have such ideas. He actually wanted to build an apartment building for the teachers. This made them very envious.</p><br/><p>If other people said such a thing, they probably wouldn’t believe it but they trusted Master Lin very much. After all, out of all the things he had said he would do in the past, there was practically none that he hadn’t actually done.</p><br/><p>A reporter said, “Master Lin, according to what we know, there are now many collectors who are willing to fork out large sums to attain a piece of your artworks. If you lack money, you could sell a piece.”</p><br/><p>Lin Fan chuckled. “I haven’t thought of that before. But if I draw too much, there would be too many of my artworks. Moreover, I haven’t died yet. How much could my artworks cost?”</p><br/><p>Of course, Lin Fan was just being humble.</p><br/><p>The number of his artworks that had been given out was not many. The museum only had ten, Elder Zheng and the rest had several pieces, and he had given his ex-teacher a piece. There were actually very few pieces.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He knew that the price of his artworks had inflated greatly and there were indeed many collectors who wanted one. However, he wasn’t very bothered by these things. Anyway, there were many ways to solve this problem of money. There was no need to go down this path.</p><br/><p>After all, his artworks were not so easily obtained.</p><br/><p>When the surrounding entrepreneurs heard this, all of them wanted to beg for one of his treasures but sadly, they couldn’t open their mouths.</p><br/><p>Then, the reporters continued asking a few more questions.</p><br/><p>Lin Fan waved his hand. “Alright, dear reporters, let’s end the interview here. If there’s anything else, we’ll talk about it next time, okay?”</p><br/><p>If someone else said these words, the reporters would curse frenziedly, ‘As if there’d be a next time!’</p><br/><p>But since it was Master Lin who said it, they believed him, because Master Lin was someone who people would never stop worrying about.</p><br/><p>The news that erupted around him was always ridiculous. If he went one week without appearing on the news, they would become suspicious. Would that even be the same Master Lin that they knew?</p><br/><p>Education department!</p><br/><p>“Impudent! Just impudent!” Chen Shi started raging upon his return. His secretary stood at the side, not daring to say a single word. He could only listen quietly.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The secretary resented Master Lin now. <em>Things were perfectly fine, why did you have to agitate our leader?</em></p><br/><p>Now, they were out of luck. The leader’s rage would definitely be taken out on them.</p><br/><p>But honestly, this Master Lin was really quite f*cked up. Anyone without a social problem would have known what to do.</p><br/><p>He could have kept quiet during the leader’s speech and waited until it was over to discuss it. How could he just reject on the spot and not give the leader any face at all?</p><br/><p>“Go, help me to gather the information. We’ll have a meeting tomorrow,” said Chen Shi.</p><br/><p>“Yes.” The secretary nodded. He didn’t dare to show any hesitation at all. Since the leader had said so, he had to go to the reporters at once and gather the information they needed.</p><br/><p>The opening ceremony at the welfare institute ended. Those thirty teachers were all very excited.</p><br/><p>In the teachers’ chat group.</p><br/><p>Jiang Hui: “Did you all hear what Master Lin said to the reporters today? About how we’ll have a teachers’ apartment building in future?”</p><br/><p>“I heard it. I was shocked at that moment. This is Shanghai! Will Master Lin really build an apartment building for us?”</p><br/><p>“I think it’s possible. Master Lin always stays true to his words. That’s something that I’ve discovered from observing him all this while.”</p><br/><p>“Actually, we don’t need to talk about these things. I’m really exceptionally pleased with this job. The welfare benefits are great, so, even without the apartment building, I’ve already decided to stick to it all the way.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Think about it. If we nurture these children, won’t we have a great sense of satisfaction? This is something that we won’t be able to enjoy in other schools. Moreover, I don’t really enjoy socializing. If I go to other schools, I’m afraid I would be pushed aside. Anyway, I’m just going to stay here.”</p><br/><p>“Me too. Trust in Master Lin. He will definitely keep improving the welfare institute.”</p><br/><p>“Haha, I know that Chen Shi from before. Who would’ve thought that Master Lin would anger him so harshly? I’m delighted. In the past, a fellow student of mine reported some problems in our school. Later on, that Chen Shi notified the school about it and that fellow student of mine got kicked out of the school.”</p><br/><p>“Haha…”</p><br/><p>To these hired teachers, Lin Fan’s words today had given them a lot of hope for the future. They wondered how things would turn out.</p><br/><p>But according to their thoughts, things would turn out amazing.</p><br/><p>The next day!</p><br/><p>The news appeared on the Internet.</p><br/><p>‘Nanshan Children’s Welfare Institute’s teaching block has completed its construction. Master Lin’s networks appear for the first time.’</p><br/><p>‘A gathering of big shots, all to join in the opening ceremony of a teaching block.’</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>‘Chen Shi personally goes to Nanshan Children’s Welfare Institute but is angered by Master Lin on the spot and leaves in a rage.’</p><br/><p>‘Master Lin claims that he wants to build a library and a teachers’ apartment building for his welfare institute.’</p><br/><p>‘Breaking! A secret among Master Lin and various big shots that has to be said!’</p><br/><p>When the netizens saw these articles, they were all stunned. Initially, they thought that it was a very normal thing but upon further reading, things became very abnormal.</p><br/><p>“D*mn! I didn’t think that my company’s boss was friends with Master Lin. My God, if I keep being a hater and I’m discovered by Master Lin, he might tell my boss and I would be dead.”</p><br/><p>“^good luck. That might really happen.”</p><br/><p>“D*mn, look at that. Isn’t that the successor of Lu Corporation, our country’s top organization? I didn’t expect even him to go.”</p><br/><p>“Master Lin is really respected, so much so that it’s scary.”</p><br/><p>“D*mn, my boss is there too. This motherf*cker…”</p><br/><p>“^are you Shanghainese?”</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Yeah, I work in Shanghai.”</p><br/><p>“Sh*t, could it be that all the entrepreneurs in Shanghai are Master Lin’s friends?”</p><br/><p>“…”</p></div>\n</div>"}