{"title": "Chapter 949 - Stockpiling", "id": 949, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-949-stockpiling", "volume_title": "Volume 10", "body": "<h1>Chapter 949 - Stockpiling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The next day!</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Zhao Ming Qing went to Cloud Street early in the morning full of energy.</p><br/><p>When Lin Fan reached the shop, he was a little confused. He couldn’t quite understand and he wondered why this good disciple of his was here so early in the morning.</p><br/><p>“Ming Qing, you are…?” Lin Fan questioned.</p><br/><p>Zhao Ming Qing smiled. “Teacher, please do your work first. Afterward, I’ll speak to you.”</p><br/><p>Lin Fan had no idea what Zhao Ming Qing was on about but the townsfolk had come. He had to go and sell his scallion pancakes.</p><br/><p>After all the scallion pancakes had been sold, Lin Fan looked at Zhao Ming Qing. He kept feeling as if something wasn’t right. He took a sip of tea and said, “Can you tell me what it is now?”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Teacher, do you remember what you promised me?” asked Zhao Ming Qing eagerly.</p><br/><p>Lin Fan was taken aback and a little confused. “What did I promise you?”</p><br/><p>“I’m talking about that. You promised me that you would bring me to develop new prescriptions together. Look, my health is great now. We don’t have much to do anytime soon either. Teacher, what disease do you think we can conquer? I’ve already done all the preparations to enter into the business of developing prescriptions,” Zhao Ming Qing said excitedly.</p><br/><p>To him, developing more prescriptions and solving more problems was the most important thing.</p><br/><p>Even after he dies, he would be able to enter the underworld with a smile on his face.</p><br/><p>“This…” When Lin Fan heard that, he felt uneasy. <em>Developing prescriptions? That’s a huge undertaking! Without half a month’s time, it definitely can’t be done. And that’s if we fully immerse ourselves into it. Only then would we stand a chance at all.</em></p><br/><p>But looking at Zhao Ming Qing, Lin Fan felt that there was a problem. This guy had totally believed him.</p><br/><p>At that time, he had said those things just to give his disciple some motivation to persevere. Now that things were fine, he naturally didn’t need that motivation anymore.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Ming Qing, this matter is a little complicated.” Lin Fan couldn’t think of a good way to resolve this issue at the moment. If he said it too bluntly, he was afraid that it would affect his disciple’s view of him.</p><br/><p>As the respected teacher, how could he go back on his words?</p><br/><p>However, he really didn’t want to develop any more prescriptions. Every f*cking time he developed a prescription, problems would arise. How was he supposed to deal with all that?</p><br/><p>Zhao Ming Qing gazed at his teacher as he felt that his teacher’s tone lacked a bit of confidence. It seemed as if he was trying to avoid it. Zhao Ming Qing quickly refuted, “Teacher, could it be that you were lying to me?”</p><br/><p>Lin Fan’s expression turned serious. “What do you mean ‘lying’? Do you think I’m the kind of person who would lie?”</p><br/><p>Zhao Ming Qing shook his head. “No. In my eyes, Teacher is the most trustworthy person. I believe that, under Teacher’s guidance, we will definitely be able to conquer more diseases.”</p><br/><p>“Teacher, recently, I’ve listed many diseases and these are all rather common. Please take a look at which target we should start aiming towards.” Zhao Ming Qing took out a stack of papers from his bag.</p><br/><p>Lin Fan just took one look before he started cursing in his heart.</p><br/><p><em>It has really come. All these diseases are not just any simple diseases!</em></p><br/><p>‘Diabetes. Affects a wide range of people, especially young females. Diabetes has a great impact on pregnancy and it may even be passed down to the next generation.’</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Etc.</p><br/><p>All kinds of diseases were listed on the papers, amounting to over ten diseases. Moreover, they were all not minor diseases. If they were to start researching the listed diseases, Lin Fan was afraid that he might die from overworking.</p><br/><p>But really, this disciple of his was way too engrossed in it. The information about each disease had been written in great detail. Also, he had even written his thoughts about treating the diseases. Although his methods might not work out, they at least gave them a direction to work towards.</p><br/><p>“This is very well done,” Lin Fan complimented.</p><br/><p><em>But even if it’s well done, you didn’t have to be so serious about it.</em></p><br/><p>Fraud Tian came over and took a look. Then, he let out a ‘Wow!’ in amazement. He felt that it was really amazing.</p><br/><p>“Teacher, when do you think we should start?” asked Zhao Ming Qing.</p><br/><p>Lin Fan replied, “Let’s wait a few days. I’ve been tired recently. Let me rest for a bit first.”</p><br/><p>After Zhao Ming Qing left, Lin Fan immediately let out a deep breath. He had a strong desire to give himself a few slaps.</p><br/><p><em>Why did I have to talk so much rubbish? Now I’m in trouble.</em></p><br/><p>“You’re not going to stand him up, are you?” Fraud Tian chuckled.</p><br/><p>Lin Fan sighed, “Sigh, I have no choice. What am I supposed to do now? What a headache.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Fraud Tian said, “I would like to help you but I can’t. You were the one who promised him. Now, you have to reap what you sowed. Just thinking about it is making me tired too. But if you’re going to research a disease, you can research Alzheimer’s disease. Recently, I’ve been feeling like my mind is a little slow and it’s not quite working properly.”</p><br/><p>“That’s enough. Fraud, you’re not that old and your brain is already not working properly. I think that your brain probably hasn’t changed at all. It’s just been like that all along,” said Lin Fan.</p><br/><p>“That’s not possible. When I was young, I was very clever. Now, my mind is deteriorating.”</p><br/><p>Lin Fan was speechless.</p><br/><p>He really had nothing to say.</p><br/><p>In the next few days, Zhao Ming Qing came over every day. Every time, he would talk about matters related to the research.</p><br/><p>This made Lin Fan feel that he couldn’t let things continue this way. Could it be that he would really have to develop a new prescription?</p><br/><p>But he had a feeling that if he continued developing prescriptions, it would make many people want to kill him.</p><br/><p>After all, it would cause many people to lose their means of earning money.</p><br/><p>…</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>In a certain city’s People’s Hospital.</p><br/><p>In a ward.</p><br/><p>The doctor said, “We don’t have this medicine right now. You need to go and look for it yourself. Afterward, bring it back and we’ll inject it for you.”</p><br/><p>The pair of young parents were bewildered. “Doctor, how could the hospital not have this medicine?”</p><br/><p>The doctor said, “It can’t be helped. This medicine is scarce and it’s very difficult to purchase. Even our hospital only managed to obtain a bit of it. Now, it has already been used up.”</p><br/><p>The young parents had brought their several-month-old child to the hospital. Their child was suffering from infantile spasms and he needed to be injected with adrenocorticotropic hormones (ACTH).</p><br/><p>“Then what should we do?” The young parents were panicky. They had no idea where to find that medicine. If even the hospital didn’t have it, how could they, as normal people, buy it?</p><br/><p>The doctor said, “This medicine is manufactured by Shanghai First Pharmaceutical Company. You can go there and ask if they have any stock.”</p><br/><p>Hearing the doctor’s words, the young parents nodded anxiously. Then, they quickly contacted the manufacturing company.</p><br/><p>“Hello, is this Shanghai First Pharmaceutical Company?”</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Yes, may I know who this is?”</p><br/><p>“Oh, this is the situation. My child is suffering from infantile spasms. We want to buy a box of ACTH for injection purposes. May I know if you have any?”</p><br/><p>“Oh, we have already run out of this medicine. After manufacturing, it has been distributed to various retailers. You can go and check the retailers. Where are you from? I can give you the contact of your local retailer.”</p><br/><p>They couldn’t accept such an outcome. They could only take down the contact number and give their own provincial retailer a call.</p><br/><p>They made the call and someone picked up.</p><br/><p>They immediately described their situation.</p><br/><p>“I’m sorry, we’ve already distributed the medicine to the local hospitals. Right now, we don’t have any stock.”</p><br/><p>“You’re saying that your hospital doesn’t have any left? Then that would be a little troublesome. Oh right, I’ll give you a website. They have all kinds of medicine for sale there. You can go and check if they have it. But I can’t guarantee anything.”</p><br/><p>“Alright, remember that website.”</p><br/><p>This pair of young parents had not expected that the medicine would be so hard to buy.</p><br/><p>Meanwhile, when the retailer hung up the phone, he chuckled.</p><br/><p>This medicine hadn’t been valuable in the past but ever since it had been discovered that it was very effective against infantile spasms, its value had spiked upwards.</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>A box had ten doses. Each dose had been over seven dollars. Later on, they realized that this price was too low and they wouldn’t earn money, so they hoarded the goods and put them up on the Internet.</p><br/><p>To them, there was only this much stock. If you didn’t want to buy it, you could just leave.</p><br/><p>After all, other than from here, it was hard to purchase it.</p></div>\n</div>"}