{"title": "Chapter 946 - I've just recovered!", "id": 946, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-946-ive-just-recovered", "volume_title": "Volume 10", "body": "<h1>Chapter 946 - I've just recovered!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Elder My watched from the side. His heart had gotten completely still as he felt that a miracle was about to happen.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He had no idea why he was thinking that. Perhaps it was because of his faith in Master Lin.</p><br/><p>Chen Xiang Bei, who was outside, had fallen flat on the ground. He looked into the ward, wondering what had happened. His men wanted to charge in but were stopped by him.</p><br/><p>It had happened too quickly. So quickly that he couldn’t react at all.</p><br/><p>“Teacher, I’m tired.” After seeing Lin Fan, Zhao Ming Qing’s final wish had been fulfilled. His enduring will was gradually fading. He would soon be unable to hold on to this body of his.</p><br/><p>“Don’t be tired. Why would you be tired? Do you know where I’ve been, disappearing for these few days? Let me tell you. I’ve been to numerous dangerous places to retrieve something good for you. Aren’t you excited to see what it is?” Lin Fan said with a smile.</p><br/><p>Zhao Ming Qing smiled. He felt that he would soon lose even the strength to speak.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>But hearing what his teacher said, he was curious. “What is it…?”</p><br/><p>Lin Fan didn’t keep him in suspense. He revealed a pill in his palm. This pill was unlike other medicinal pills. It emanated a thick white mist. And this white mist kept surrounding the pill. “Come, swallow it. This is a good thing. It was very hard to obtain.”</p><br/><p>“You’re in great luck this time.”</p><br/><p>When Elder Mu and the rest saw that thing, they were all puzzled and surprised, wondering what the heck it was.</p><br/><p>But this item had been brought by Master Lin. It couldn’t have been something simple.</p><br/><p>Zhao Ming Qing swallowed the pill in one go. His throat moved and suddenly, his expression went blank. He felt as if a great change had occurred in his body.</p><br/><p>Lin Fan had been checking Zhao Ming Qing’s condition the whole time. After the pill entered his body, its medicinal properties were dispersed and they spread throughout his body, into every organ.</p><br/><p>His aged organs seemed to suck in the vitality and start functioning again.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p><em>How mystical. </em>Lin Fan gasped in shock. The pill was indeed insanely mystical. It couldn’t even be looked at normally.</p><br/><p>Zhao Ming Qing felt his body clearly changing. Even his voice had changed. It was now full of energy. It was loud and resonant.</p><br/><p>Lin Fan asked with a smile, “How is it? Does it feel very comfortable?”</p><br/><p>His appearance hadn’t changed but his organs had become youthful. With the support of the medicinal power, his organs were teeming with vitality.</p><br/><p>It turned out that this was how the pill increased one’s lifespan.</p><br/><p>“Mmm, it feels comfortable. I’ve never felt so comfortable before.” Zhao Ming Qing nodded. He knew that this was a pill crafted by his teacher but this pill was unlike those that he had seen before. The difference was simply too huge.</p><br/><p>Lin Fan said, “That’s good. This thing was very hard to obtain. It is thanks to my luck that I managed to obtain it. I dived tens of thousands of meters into the sea, into the dark and murky waters to find it. My head is even hurting a little…”</p><br/><p>Zhao Ming Qing asked, “Teacher, can you even withstand the pressure at that depth?”</p><br/><p>*Cough cough!* Lin Fan coughed, then said, “Ming Qing, when your teacher speaks, you cannot rebut. Don’t you know that?”</p><br/><p>Zhao Ming Qing really felt that his body had changed. It felt just like a young person’s body. When he heard his teacher’s words, he quickly admitted his fault. “Right, right. What Teacher is saying is right. It is my mistake.”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Mmm, as long as you know your mistake, it’s fine. I won’t be petty about it. I even went to a ten thousand meters high mountain to find a ten-thousand-year-old snow lotus. You don’t know but that snow lotus…”</p><br/><p>Elder Mu watched from behind and he couldn’t help but laugh. This teacher was so unreliable but that student was pretending to listen so attentively.</p><br/><p>This strange scene really left him helpless.</p><br/><p>But looking at the situation, it seemed that there were really no problems anymore. Ming Qing had really recovered.</p><br/><p>Looking at his complexion and his liveliness, it was as if he was a completely different person. Even when he had been healthy before, he hadn’t been like this.</p><br/><p>Zhao Shi couldn’t resist crying. “Thank you, Master Lin. You’ve saved Ming Qing. Thank you…”</p><br/><p>Lin Fan waved his hand. “No problem. Ming Qing is my disciple. If I didn’t save him, who would? How could I just watch him while he was in trouble?”</p><br/><p>Zhao Ming Qing was really so touched that he started crying. He could see that his teacher had disappeared these few days because he had been busy helping him. To have such a teacher, he felt really too fortunate.</p><br/><p>Outside, Zhao Li Xing and the rest had seen the situation inside. They were also crying tears of joy. <em>He’s back. He’s finally back.</em></p><br/><p>Hearing their dad’s voice that was full of vigor, it was clear that he had completely changed from when he had been on the verge of death a moment ago.</p><br/><p>…</p><br/><p>When the doctors and directors of the hospital heard the news, they rushed over hurriedly.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>When they saw Elder Zhao, who had been on the verge of death a while ago, suddenly energetic again, they were dumbfounded. To them, it was impossible.</p><br/><p>But when they saw Master Lin, they understood.</p><br/><p>It seemed that all of this was thanks to Master Lin.</p><br/><p>Initially, they wanted to do a check-up on Zhao Ming Qing but Lin Fan declined.</p><br/><p>What was there to check?</p><br/><p>In such a situation, how could they even check him? If they checked him, wouldn’t that scare them to death?</p><br/><p>Since his teacher wouldn’t allow the check-up, Zhao Ming Qing declined as well.</p><br/><p>To the hospital staff, it was a shame. They knew about Master Lin. It wouldn’t be an overstatement to call him a godly doctor. His supreme medical ability was well-known throughout the medical world.</p><br/><p>He was accomplished in both Chinese and Western medicine, the first person to achieve mastery of both schools of medicine. He was an unmatched and irreplaceable being.</p><br/><p>…</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Teacher, that person outside has been looking for you the whole time,” said Zhao Ming Qing, “I think it’s very urgent.”</p><br/><p>Lin Fan looked at the guy who he had flung out of the ward. His brows furrowed. “You were sent here by Zheng Zhong Shan?”</p><br/><p>When Chen Xiang Bei heard this, he immediately shook his head. “Elder Zheng didn’t send me. I came here of my own will. I wish for Master Lin’s help. Please come with me.”</p><br/><p>“Going with you is not possible. I’ve never liked to get involved with complicated people. But I have promised Elder Zheng. That person will definitely be saved. Ming Qing, you shall follow him back to Beijing.”</p><br/><p>Zhao Ming Qing said, “Teacher, I’ve just recovered.”</p><br/><p>Lin Fan rebutted, “What do you mean you’ve just recovered? Your body is in excellent shape. You don’t even need to recuperate. Just follow him to Beijing to take a look. If you come across something that you can’t solve, give me a call and we’ll discuss it.”</p><br/><p>When Chen Xiang Bei heard that Master Lin wouldn’t be going, he became anxious. “Master Lin, this time, we really need you to go.”</p><br/><p>Lin Fan waved him off. “You don’t need me. My disciple will be able to resolve it. Don’t look down on a student taught by me. Even if you put all your imperial physicians together, they won’t even amount to my disciple. Do you believe me?”</p><br/><p>When he said such a confident statement, Zhao Ming Qing became embarrassed.</p><br/><p>Teacher <em>is overstating my abilities.</em></p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p><em>How could my medical skills even be that good?</em></p><br/><p>But Zhao Ming Qing couldn’t see the picture clearly himself. He was able to treat numerous major illnesses but to him, those that he could treat were simple, while those that he couldn’t treat were difficult. Hence, he lacked confidence in his own abilities.</p><br/><p>But Lin Fan understood the situation. Zhao Ming Qing’s current medical ability compared to his past medical ability was like heaven and earth.</p><br/><p>In the past, he was just relatively good amongst the old generation of Chinese doctors. But now, he had reached another domain of Chinese medicine.</p><br/><p>It was only him who couldn’t feel it yet.</p><br/><p>After all, the onlooker sees most clearly.</p></div>\n</div>"}