{"title": "Chapter 956 - In the face of money, it collapses with a single blow", "id": 956, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-956-in-the-face-of-money-it-collapses-with-a-single-blow", "volume_title": "Volume 10", "body": "<h1>Chapter 956 - In the face of money, it collapses with a single blow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Although it was their first time meeting, Wang Ke Hao was able to let loose at the dining table. They chatted about a lot of things.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Lin Fan hadn’t expected that he had developed to the point where other people would visit him when they came to Shanghai to shoot a film. He wasn’t quite accustomed to such a change.</p><br/><p>Could it be that he had already become a being that couldn’t be ignored by others?</p><br/><p>“Master Lin, are you interested to make an appearance in this film?” Wang Ke Hao threw out the offer. He wanted to add some luster to his film.</p><br/><p>Lin Fan smiled. ” I don’t even know how to act. I’d affect the whole film.”</p><br/><p>Wang Ke Hao immediately waved his hand. “Don’t worry, don’t worry. Just show your face as a special guest. There’s no need for any interactions.”</p><br/><p>Lin Fan said, “We’ll see.”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Wang Ke Hao smiled delightedly. He decided to stop there as was appropriate. This was still their first meeting but during this first meeting, they had got along very well. In the future, they could interact more and bring their relationship closer.</p><br/><p>Li Meng Hua and Zheng Long occasionally added in a few words. They knew as well that Master Lin was not an average person.</p><br/><p>But Li Meng Hua didn’t have a Weibo account. Even if he did, it would have been managed by his management and he wouldn’t pay much attention to it.</p><br/><p>…</p><br/><p>Haojiang.</p><br/><p>Wang Wen had already lost so much that his eyes were red and his hands and feet were chilly. He was in the VIP area. In here, the bets were all pretty big.</p><br/><p>“Give me another 10 million!” Wang Wen shouted in a deep voice.</p><br/><p>Her female companions who had been by his side had gradually left. They felt that this guy was going to be in trouble. He had lost too terribly and his flow of emotions wasn’t quite right.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Brother Jun, that guy wants to borrow money again,” a subordinate said.</p><br/><p>Brother Jun asked, “How much has it been already?”</p><br/><p>The subordinate said, “With taxes, it’s already 100 million.”</p><br/><p>Brother Jun nodded. “Mmm. Let’s have a talk with him first.</p><br/><p>Wang Wen couldn’t accept his loss. It had completely gotten to his head, especially because the person who shared the gambling table with him had a kind of challenging gaze as he looked at him. This made Wang Wen very unhappy.</p><br/><p>He wanted to continue gambling but he was already out of cash and he could only borrow money. As long as he broke even, everything would come back.</p><br/><p>Brother Jun said, “Young Master Wang, we can’t lend you the money at this moment.”</p><br/><p>Wang Wen instantly snapped when he heard this, “What do you mean by that? Are you saying that I won’t be able to afford the repayment?”</p><br/><p>Brother Jun was a loan provider but they were always very polite towards VIP guests. After all, they would like these guests to patronize them again in the future.</p><br/><p>“Young Master Wang, you’ve misunderstood me. Of course it’s not like that but right now, if you include taxes, you already owe us 100 million. If possible, we wish that you could give a call home to pay us the interest first,” said Brother Jun.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Wang Wen had wanted to say something but suddenly, when he heard this, his expression changed dramatically. He looked at Brother Jun in disbelief. “I only borrowed so little. How could it be 100 million?”</p><br/><p>Brother Jun smiled. “Young Master Wang, this is clearly written in black and white. You’ve borrowed a total of 43 million. The interest is compounded hourly. There is no mistake. If you don’t believe me, you can see for yourself.</p><br/><p>“Are you guys scamming me?” Wang Wen barked. He wasn’t an idiot. The interest had inflated so much, were they trying to kill him?</p><br/><p>Brother Jun’s expression changed. “Young Master Wang, what do you mean by that? How have we scammed you? We lent you 43 million for you to recover. If you won with this 43 million and earned a few hundred million, you wouldn’t have to pay us any additional at all. We’re just collecting some interest. How can you say that we’re scamming you?”</p><br/><p>“If we didn’t lend you the money, you wouldn’t have been able to win back your losses even if you wanted to. Now that your luck has been bad and you’ve lost everything, we can’t just take nothing in return for lending you money.”</p><br/><p>“Let me just ask you one thing. Are you going to repay us or not?”</p><br/><p>The atmosphere had suddenly gotten tense.</p><br/><p>Wang Wen replied, “Repay my a*s. You guys are scamming me. I’m not repaying.</p><br/><p>Brother Jun took a deep breath and waved his hand. His subordinates immediately came forward and pinned Wang Wen down. Then, they dragged him out of the place.</p><br/><p>Facing the other guests, Brother Jun said apologetically, “Excuse us, everyone. We’ve disturbed you. Please continue.”</p><br/><p>In the office.</p><br/><p>Wang Wen was struggling as he yelled, “Let go of me! What are you trying to do? I want to call the police!”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>*Smack!*</p><br/><p>One of the subordinates immediately slapped his face. “What are you talking about? You’ve borrowed money but you’re not admitting it. Be honest.”</p><br/><p>Brother Jun waved his hand, indicating for his subordinates to back off. Then, he looked down on Wang Wen as he said, “Young Master Wang, right now, you can choose whether you want to call your family to bring the money over. If not, according to the contract, one hand is for 50 million. Since you owe 100 million, it will be two hands. You choose.”</p><br/><p>Looking at Brother Jun’s terrifying expression, Wang Wen swallowed his saliva. “Brother Jun, wait a moment. If there’s anything, let’s talk it through. This 100 million is really too much. Can I just return you what I borrowed?”</p><br/><p>Brother Lin instantly burst out laughing. “Do you think that’s possible? What do you treat this as? Do you think we’re a charity bank? We gave you money to earn back your losses but you lost again. Do you think we’d just let it be?”</p><br/><p>“50 million. I’ll give you 50 million. How about 70 million? We’ll treat it as interest,” said Wang Wen hurriedly.</p><br/><p>Right now, he was a little frightened just thinking about it. How could he have lost 100 million just like that?</p><br/><p>*Smack!*</p><br/><p>Before he could finish speaking.</p><br/><p>Brother Jun’s palm was flung at his face. “Are you a beggar? You took the money so easily before. Look closely at the agreement. Did we force you to borrow the money?”</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The contract was placed in front of him. There weren’t many conditions but the interest rates were clearly written.</p><br/><p>Small sums had their own interest rates.</p><br/><p>Big sums had their own interest rates.</p><br/><p>With these kinds of big gambles in particular, after borrowing money, it would be fine if you won, but if you lost, the interest would really be terrifying. It would be way more than the amount borrowed.</p><br/><p>*Clang!*</p><br/><p>A blade was put on the table.</p><br/><p>“Don’t worry. If you don’t repay us, it will only be two hands. We have professional doctors here and there won’t be any problems. If you don’t want to lose any body parts, just call home and tell them to bring us money,” said Brother Jun.</p><br/><p>The smooth and sharp blade glimmered under the light.</p><br/><p>If he lost both hands, wouldn’t he become handicapped for the rest of his life?</p><br/><p>“I’ll make the call. I’ll call my friend.” Wang Wen anxiously picked up the phone. He didn’t dare to call his family right now. He immediately called his friends who were second generation celebrities.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Brother Jun warned him, “Young Master Wang, I’d advise you that it’s best to call your family. Otherwise, you might end up losing friends on top of losing money.”</p><br/><p>Wang Wen didn’t bother as he continued to make calls.</p><br/><p>A call went through.</p><br/><p>“Big Long, it’s me, Wang Wen. Do you have any money right now? Lend me some.”</p><br/><p>“I need 100 million.”</p><br/><p>Before he could say more, the call was hung up.</p><br/><p>Wang Wen gritted his teeth. <em>D*mn it. Once I talk about borrowing money, you play dead. Back then, when you said you wanted to appear in my dad’s film, I was the one who helped you. F*ck! You’re a fake friend.</em></p><br/><p>Then, he continued making calls.</p><br/><p>At this moment, when calling to borrow money, it was the greatest test of friendship.</p><br/><p>Friendships that he felt were more important than money were all collapsing with a single blow when the subject of borrowing money was brought up.</p><br/><p>Hence, if you value your friendships, remember this! Don’t ask to borrow money.</p></div>\n</div>"}