{"title": "Chapter 965 - This event isn’t very well organized", "id": 965, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-965-this-event-isn%E2%80%99t-very-well-organized", "volume_title": "Volume 10", "body": "<h1>Chapter 965 - This event isn’t very well organized</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Silence!</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The Nobel Prize Award Ceremony was suddenly enveloped in silence. This kind of thing had never happened before. And there had never been a recipient who had felt that he shouldn’t receive the award.</p><br/><p>However, this incident had really happened and it shocked everyone. They didn’t dare to believe it.</p><br/><p>The Nobel Foundation Chairman was stupefied as well. He didn’t even know what to say. Since the establishment of the award until then, there had never been an incident like this.</p><br/><p>Hall felt that he had done what he was supposed to do.</p><br/><p>Perhaps God had known that he would receive the award and that was why he had encountered that mystical Chinese medicine prescription. From that encounter, he had found out that, amongst his fellow Nobel Prize nominees, there was a Chinese medicine master from China.</p><br/><p>Perhaps this had all been arranged by the heavens.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Hence, Hall had felt that he had a need to explain everything.</p><br/><p>Hall slowly walked down the stage. Everyone’s gazes were fixed on Hall.</p><br/><p>Uproar!</p><br/><p>After the momentary silence, a series of shocked gasps erupted.</p><br/><p>There were people who didn’t dare to believe it as well as people who felt that Hall had gone mad.</p><br/><p>Conquering leukemia?</p><br/><p>How could they not have known if something like that had happened?</p><br/><p>Then, some people started searching the stage to identify that Chinese medicine master from China. However, regretfully, there was no Chinese medicine master to be seen.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Hall, you’ve gone mad,” when Hall returned to his seat, the scientist next to him cried out in disbelief.</p><br/><p>“Buddy, I haven’t gone mad. I was only saying the truth. When compared to the cure for leukemia, my research findings are not even worth mentioning. This is a breakthrough that has brought fortune to everyone. If someone is to get the award, it should only be him,” said Hall.</p><br/><p>“This…”</p><br/><p>The scientist didn’t know what to say. This had really happened too suddenly. He wasn’t even able to respond in time.</p><br/><p>China.</p><br/><p>“D*mn. I respect this old man for being a real man.”</p><br/><p>“I didn’t think that this scientist’s attitude would be so good. He was clearly the award recipient but he decided to say the truth in the end.”</p><br/><p>“Perhaps he did this in order to gain Master Lin’s favor.”</p><br/><p>“There’s no way not to respect that guy who brought the prescription overseas. He has indirectly helped Master Lin greatly.”</p><br/><p>“Haha. Chinese medicine has finally reached the international stage. Of course, I’m only talking about Master Lin. We can forget about the rest.”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“But there’s still Master Lin’s disciple, Director Zhao Ming Qing. He’s also an old Chinese doctor with high moral standing.”</p><br/><p>“Then how will this situation be resolved now? Will they really change the decision and present the award again?”</p><br/><p>“Who knows?”</p><br/><p>Japan!</p><br/><p>The netizens were stunned as they watched the broadcast.</p><br/><p>“What? Leukemia can be cured?”</p><br/><p>“That’s unbelievable. If it wasn’t a scientist that said it, I wouldn’t believe it.”</p><br/><p>“I’ve seen a news article about this from China but I didn’t pay much attention to it before. I thought that it was a made-up story. But I didn’t think that it would actually be true.”</p><br/><p>“I don’t believe this. Chinese medicine can cure leukemia? That must be today’s biggest joke.”</p><br/><p>America!</p><br/><p>“What is Hall doing? The prize has already been presented to him but he gave it to a Chinese man?”</p><br/><p>“Conquered leukemia? My God, I really don’t believe it.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“If what Hall said is true, I support him. He’s doing the right thing.”</p><br/><p>“What is going on with the Nobel Prize Judging Committee? If it’s really as Hall said, then that Chinese medicine master from China should have received the award.”</p><br/><p>“He conquered leukemia? Is that for real? I have a friend who’s suffering from leukemia. Where should I buy the medicine for him?”</p><br/><p>“Go to Chinatown and find a Chinese medicine shop. They should know.”</p><br/><p>…</p><br/><p>Cloud Street.</p><br/><p>Lin Fan was a little dazed. He hadn’t expected that things would end up like this. That old man had actually brought him up.</p><br/><p>Elder Liang said excitedly, “Look! Even the recipient said it. The award should be given to Master Lin.”</p><br/><p>Zhao Zhong Yang said, “But what are they going to do now? Can they change the award winner after presenting it halfway like this?”</p><br/><p>Elder Chen said, “They should just change it. What’s there to it? They were the ones who made a mistake. If they just change it, it’ll be fine.”</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>When Lin Fan heard what they said, he was momentarily lost for words. Then, he continued watching the broadcast, wondering what would happen.</p><br/><p>On-site!</p><br/><p>The Nobel Foundation seemed to not have expected this situation as well.</p><br/><p>The King of Sweden sat there, discussing softly with the people beside him.</p><br/><p>The Foundation Chairman had a blank look on his face. Then, he hurried on stage and said, “Everyone, please quieten down.” Afterward, he glared angrily at Hall as is to say ‘Brother, you’re really awesome. Now that you’ve opened up this can of worms, how are we going to clean it up?”</p><br/><p>But Hall wasn’t bothered at all. He had only said what he was supposed to say.</p><br/><p>Right now, this was being broadcasted live. If they didn’t handle it well, it would affect the Nobel Foundation greatly.</p><br/><p>“Right now, let us, the Nobel Foundation, explain the situation. We have seriously discussed the research findings of Lin Fan from China. However, as we analyzed the theory behind his research, we were completely unable to find any legitimate theories. Therefore…” the Foundation Chairman started to explain.</p><br/><p>However, he was saying the truth. Back then, when he had found out that leukemia had been cured, he hadn’t believed it. Later on, after research, he realized that they weren’t able to analyze the theory behind the cure. Also, they didn’t have a deep understanding of the medicine’s effect.</p><br/><p>However, the anorexia cure had been verified and it was indeed effective.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>In the end, after considering many factors, they only put Lin Fan into the nominee list but didn’t give him the award.</p><br/><p>Now that the award recipient, Hall, had spoken, saying that he felt that he shouldn’t receive the award, it had put them in an awkward situation.</p><br/><p>This was a live broadcast. Such an impromptu explanation was very awkward. But not explaining it wasn’t possible either.</p><br/><p>The other scientists still couldn’t understand the situation at the moment but they had etched this into their memories.</p><br/><p>The Chinese medicine master who had developed a prescription for leukemia. When they went back, they had to look him up.</p><br/><p>The Foundation Chairman said, “Chinese medicine master, Lin Fan, should be here right now. Could I please invite you on stage to give an explanation of the theory behind your findings? If it can be explained, then it is indeed a mistake on the Nobel Foundation’s part. We are willing to bear the blame and reflect on our mistake.”</p><br/><p>When he said this, everyone there started looking around, searching for that Chinese medicine master from China.</p><br/><p>“Could I please invite Lin Fan on stage?” the Foundation Chairman repeated. No one answered.</p><br/><p>The place entered an awkward silence.</p><br/><p>Meanwhile, when the Chinese netizens saw this scene, they burst out laughing.</p><br/><p>“Go on stage my a*s! He’s not even there, how will he go on stage?”</p><br/><p>“Master Lin is still at Cloud Street! He’s f*cking thousands of miles away. Even if he flies there, he won’t make it.”</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“This is awkward and painful to watch. This event isn’t very well organized.”</p></div>\n</div>"}