{"title": "Chapter 980 - The association is going to be screwed", "id": 980, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-980-the-association-is-going-to-be-screwed", "volume_title": "Volume 10", "body": "<h1>Chapter 980 - The association is going to be screwed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Chinese Medical Association. In the office.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>At that moment, there was a ruckus inside.</p><br/><p>Zhou Qing Quan and Wang Tian Feng looked at the people around. Some were sitting down with gloomy looks on their faces while others were standing around or pacing back and forth.</p><br/><p>“Vice-Chairman Zhou, you have to tell Chairman Lin that he can’t do something like this. It will cause the association which has been painstakingly built up to collapse again,” an old member said painfully as if what Chairman Lin had done was a big mistake.</p><br/><p>The others agreed with him.</p><br/><p>“Yeah! Our association has progressed to where it is now through steady progress. We have never taken big strides. Now that Chairman Lin has taken up his appointment, he’s cutting all of us off. Even if we haven’t contributed, we have suffered to get here. This is heartbreaking to everyone!”</p><br/><p>“That’s right. It can’t go on like this. The other associations are all watching us. If we do such a thing, we’ll become a joke for the rest of our lives.”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Sigh, I really regret it. I’ve been in the association for eleven years, cautiously and conscientiously working but now, our memberships are going to be frozen all of a sudden. Didn’t he consider our feelings at all?”</p><br/><p>Zhou Qing Quan and Wang Tian Feng listened to everyone’s complaints.</p><br/><p>They felt a great deal of stress. It was as if they were walking on a tightrope.</p><br/><p>If they were not careful even for a moment, they would be in trouble.</p><br/><p>However, Master Lin had already talked to them about this beforehand. He had told them to push any problems towards him.</p><br/><p>At that moment, Zhou Qing Quan started to speak, “Everyone, quieten down and calm your hearts. This is indeed a rather rash action but Chairman Lin’s intentions are good. I believe that everyone knows that, right?”</p><br/><p>“Vice-Chairman Zhou, how could this be good? Do you know how many phone calls I received this morning from people saying that they wanted to leave the association? They’re saying that the association has hurt their feelings and they don’t ever want to join anymore.”</p><br/><p>“Same here. Elder Yang and Elder Chen are so pi*sed that they’re just lying at home.”</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“I don’t agree with this reform. It’s really too ridiculous. I suggest that we remove Master Lin from his appointment and choose a new Chairman.”</p><br/><p>“Yeah, I agree as well.”</p><br/><p>Zhou Qing Quan and Wang Tian Feng looked at each other. They hadn’t expected that these people wanted to overthrow Master Lin. But it was a shame. That was already not possible.</p><br/><p>“The documents for Master Lin’s appointment as Chairman have already been submitted. We cannot remove him from his post. When we selected him as Chairman, you all voted in agreement. If you want to remove him from his post, the association will become a real joke,” said Zhou Qing Quan.</p><br/><p>Wang Tian Feng added, “Since things are like this, we’ll have a talk with Chairman Lin. Hopefully, we’ll be able to mediate things. Is that alright?”</p><br/><p>The crowd looked at each other. In the end, they nodded and said, “Alright. We’re only so agitated because we want what’s best for the association.”</p><br/><p>Wang Tian Feng smiled. “Of course. Everyone here is a senior member of the association. Who doesn’t want to see the association to well?”</p><br/><p>The didn’t say much else. They had already stated their thoughts and they would just have to see how Zhou Qing Quan and Wang Tian Feng handled the rest.</p><br/><p>Right now, they were filled with regret. If they had known, they would never have agreed to let Lin Fan become the Chairman even if they died.</p><br/><p>How long had it been since he had become the Chairman?</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Not even two days. And he was already making such a harsh move.</p><br/><p>After everyone left, Zhou Qing Quan and Wang Tian Feng looked at each other.</p><br/><p>“Look. When it has to do with benefits, all the greedy people come out.” Zhou Qing Quan sighed. He had already known about this but in the past, he hadn’t dared to take action. Now that Master Lin was in charge, he immediately cut them off and those members had started to panic.</p><br/><p>“I think that there’s someone behind this that’s adding fuel to the fire. If no one said anything, they wouldn’t have all come at the same time,” said Wang Tian Feng.</p><br/><p>Zhou Qing Quan nodded. “But the good thing is that the higher departments haven’t stopped us. Otherwise, it would be hard to continue.”</p><br/><p>“I don’t think they will. Master Lin is the Chairman now. To put it bluntly, they are afraid of Master Lin too. They don’t want to find trouble for themselves.” This was what Wang Tian Feng believed. But what he said was indeed true.</p><br/><p>There were departments that managed the association. However, those departments didn’t dare to manage it anymore.</p><br/><p>Master Lin was way too ferocious. He wouldn’t give anybody any respect. If they tried to managed him, they would end up in trouble, so they just decided to sit back and watch the show.</p><br/><p>Cloud Street!</p><br/><p>Lin Fan was making a call. He was contacting people that he hadn’t contacted in a long time, the people of the National Internet Safety Bureau.</p><br/><p>“Yes, help me out. The behind-the-scenes management of the Chinese Medical Association has to be changed. If I wasn’t banned from the Internet, I would have done it myself long ago. I wouldn’t have trouble you guys.”</p><br/><p>“Master Lin, don’t say that. You aren’t troubling us. Since you’ve instructed us, we’ll work overtime today and we’ll definitely get it done.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Alright then. Go into the system and make a backup of the member name list. This name list has to be able to be found with a search. It must also…”</p><br/><p>Lin Fan started to instruct them. If he had done it himself, it definitely wouldn’t have been a problem. But thinking about how he wasn’t allowed to touch a computer, he definitely had to abide to the rule.</p><br/><p>Moreover, he was close to the people in the National Internet Safety Bureau, so he could get them to help him.</p><br/><p>As for those who were hooting on the Internet, he wasn’t bothered by them at all.</p><br/><p><em>Let’s look at this guy.</em></p><br/><p>A senior member of the Chinese Medical Association, Senior Professor wang, had been ranting on Weibo. His words were ferocious and filled with disdain.</p><br/><p>“I’m firmly against this reform. It will harm our association and harm Chinese medicine. If it is implemented, I would rather leave the association and never come back.”</p><br/><p><em>There’s also this one, another senior member.</em></p><br/><p>“All is lost. The association is unlucky to have chosen the wrong Chairman…”</p><br/><p><em>All is lost? Why isn’t your life lost then?</em></p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>…</p><br/><p>Zhao Ming Qing had come to Cloud Street because the situation was getting complicated.</p><br/><p>“Teacher, I just found out that the former Vice-Chairman of the Chinese Medical Association is very displeased about this matter. Right now, majority of the association members have received instructions from him to protest,” said Zhao Ming Qing worriedly.</p><br/><p>“Oh.” Lin Fan nodded but wasn’t bothered at all. “Oh yeah, Ming Qing, look at the exam script that I wrote last night. How is it?”</p><br/><p>Zhao Ming Qing looked at his teacher in astonishment. “Teacher, you really aren’t bothered at all?”</p><br/><p>Lin Fan replied, “What’s there to bother about? If me bothering about it will stop him from being so cocky, I would definitely bother about it. Since it’s useless, what’s the point? Don’t you agree?”</p><br/><p>Zhao Ming Qing had no argument to that. He felt that his teacher really made sense.</p><br/><p>But if it hadn’t come from his teacher, he felt that whoever said it had to be really stupid.</p><br/><p>Because this matter wasn’t something so easily handled.</p><br/><p>Now, things were becoming controversial. Everyone was divided. Some of the association members had already spoken out in protest.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Most people wouldn’t have been able to withstand the pressure.</p><br/><p>For his teacher to still be so calm now, Zhao Ming Qing was really in awe.</p></div>\n</div>"}