{"title": "Chapter 989 - A good person will live a life of peace", "id": 989, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-989-a-good-person-will-live-a-life-of-peace", "volume_title": "Volume 10", "body": "<h1>Chapter 989 - A good person will live a life of peace</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lin Fan was already very famous now. He was an idol in many young people’s hearts.</p><br/><p>Besides studying, Wang Ying would always read the news on the Internet. Since last year, she had noticed this fearless and ever-righteous Master Lin. Since then, she had been filled with curiosity.</p><br/><p>Earlier on, she had had some doubts about Master Lin. She had felt that Master Lin had been overly domineering for making an old man heartbroken. But now, she had already realized her mistake.</p><br/><p>Now that she saw her idol, how could she not be excited? Especially since her idol had spontaneously called for her.</p><br/><p>“Master Lin, I’m a fan of yours,” Wang Ying exclaimed excitedly.</p><br/><p>Lin Fan smiled. “It’s an honor to have a fan like you.</p><br/><p>Wang Ying was a little shy. Then, she asked curiously, “Master Lin, is there something that made you call me?”</p><br/><p>Lin Fan explained, “I saw what you just did. Actually, you helped that cleaner but those people snatched the credit.”</p><br/><p>Wang Ying said, “I don’t mind all that. As long as the uncle wakes up, it’s good. Moreover, they helped the uncle as well.”</p><br/><p>Lin Fan hadn’t expected Wang Ying to reply like this. He was mumbling in his heart. <em>There are actually still such people in this world. </em>Suddenly, he felt as if this task wouldn’t be so easy to complete.</p><br/><p>But he decided not to think about that for now. When that comes, he would think about how to resolve that. Right now, he had to resolve the situation at hand.</p><br/><p>“Looking at how hurried you are, I can predict that you are going to an interview,” Lin Fan said with a smile.</p><br/><p>*Pfft!*</p><br/><p>Wang Ying looked at Lin Fan as he pretended to read her fortune and couldn’t help but laugh. Then, she nodded. “Mmm. I have another interview later on. I just got rejected on the spot before this but I won’t give up.”</p><br/><p>“You’re very enthusiastic. This is for you.” Lin Fan took out the product of his first try at carving and passed it to her.</p><br/><p>Wang Ying’s jaw dropped as she looked at it in disbelief. “Master Lin, this is a gift for me?”</p><br/><p>Looking at that wooden carving, she was stunned. She hadn’t expected Master Lin to give her a gift. Moreover, the wooden carving looked very good. Although she could quite understand what was carved into it, she felt that it was probably a god or Buddha.</p><br/><p>Lin Fan nodded. “Mmm. You’re a kindhearted young lady. This wooden carving will bring you good fortune. If you bring it with you, your interview might even turn out successful and bring you a life of fortune.”</p><br/><p>Wang Ying really loved that wooden carving. Especially since it had been given to her by her idol, she really adored it.</p><br/><p>But she realized that what Master Lin had said was a little unreal. She couldn’t help but look at her idol doubtfully.</p><br/><p>Lin Fan smiled. “Trust me. Bring it with you. You will receive a blessing. Alright, I’m going. All the best.”</p><br/><p>Before Wang Ying could respond, her idol had turned and left.</p><br/><p>Then, she looked at the wooden carving which was only as long as her finger and couldn’t help but be a little lost. What was going on? But somehow, as she looked at the wooden carving, she felt as if her heart was at peace.</p><br/><p>Lin Fan returned to the car. He didn’t know if it would be useful. Then, he didn’t think too much and just drove straight back to Cloud Street.</p><br/><p>…</p><br/><p>A certain listed company.</p><br/><p>The competition amongst applicants was great this time. There were very many interviewees and their educational backgrounds were all impressive. Most of them had degrees and there were also many of them who had masters degrees.</p><br/><p>To emerge victorious in such a competitive application, it was simply too difficult.</p><br/><p>It was as if ten thousand soldiers were crossing a wooden bridge and only one would make it across.</p><br/><p>Cloud Street.</p><br/><p>Lin Fan carried all the materials that he had bought into the shop.</p><br/><p>Fraud Tian looked at all these things and couldn’t help but ask suspiciously, “Kid, why did you buy all this wood?”</p><br/><p>Lin Fan looked at Fraud Tian helplessly. “These are for carving. If you don’t understand, don’t ask.”</p><br/><p>Zhao Zhong Yang, who had been playing with his phone all along, became curious. “Brother Lin, you know how to carve wood?”</p><br/><p>Lin Fan smiled. “Yes. I learned it today.”</p><br/><p>Wu You Lan stood behind Lin Fan and said proudly, “Nothing is too difficult for Brother Lin. Even if it’s building a rocket, I believe Brother Lin can do it.”</p><br/><p>Lin Fan felt helpless. Although it wasn’t impossible, saying it so bluntly made him a little embarrassed.</p><br/><p>Fraud Tian said, “You Lan, sometimes, you can’t brag as you like about his awesomeness. If you brag too much, it would be meaningless.”</p><br/><p>Wu You Lan’s face turned red as if she felt that her bragging had been a little too much.</p><br/><p>Lin Fan retorted, “Bragging? What You Lan said is the truth. Even if I can’t build it now, it doesn’t mean I won’t be able to build it in the future. You Lan, you have great vision. I think that you’re brilliant.”</p><br/><p>Wu You Lan’s heart was filled with delight. Then, she shot Fraud Tian a glare. “Brother Lin is the best.”</p><br/><p>To Lin Fan, having a true fan was something that made him very happy sometimes. Moreover, he felt very proud.</p><br/><p>You Lan is pretty good. I haven’t taken care of her for nothing.</p><br/><p>Fraud Tian shook his head and sighed. Comparing people to each other would make one go mad. This kid really made him envious. He wasn’t just amazing but he also had ladies who mindlessly followed him.</p><br/><p>Thinking about his own life, besides knowing Ba Gua Zhang, Fraud Tian didn’t have much to show for.</p><br/><p>He decided not to think about it. The more he thought about it the worse his mood would become.</p><br/><p>Nighttime.</p><br/><p>As a member of Lin Fan’s army of fans, Wang Ying was elated after having met Master Lin that day. What made her even happier was that she had managed to fight her way through and emerge victorious among hundreds of applicants. She had been hired on the spot during the interview.</p><br/><p>To Wang Ying, that was simply inconceivable, because this kind of big company typically informed the applicants of their application outcome by mail. They would typically never hire someone on the spot.</p><br/><p>She felt that it was inconceivable that she had been hired. Her performance hadn’t been outstanding. It had been much weaker than other people’s performances.</p><br/><p>She had no idea why she had been hired.</p><br/><p>There was only one strange thing.</p><br/><p>An old auntie had applied as well and she had sat next to the old auntie. When she went to get some water to drink, she brought a cup of water for the old auntie as well. Later on, they started to chat casually and that old auntie asked her a lot of questions and even looked at her resume.</p><br/><p>Then, the old auntie left all of a sudden.</p><br/><p>Then, she it was her turn for the interview, it went smoothly, seemingly without any obstacles. And that was how she passed.</p><br/><p>When she went home, she took out the gift from her idol and happily held it in her hand. She eagerly took out her phone and took a photo.</p><br/><p>Weibo.</p><br/><p>Wang Ying: “Today, it has been one good thing after another. I’ve never had such good luck in my life. Thank you to my idol for giving me this present. It is very lucky. I actually passed such a difficult interview. I will definitely keep this present safely @MasterLin.”</p><br/><p>After sending that post, Wang Ying started fading out into her dreams.</p><br/><p>In her sleep.</p><br/><p>That wooden carving that had been placed on the table seemed to be slightly different. It emitted a mystical power that enveloped Wang Ying’s body as if causing some sort of change.</p></div>\n</div>"}