{"title": "Chapter 1008 - This place is very unhygienic", "id": 1008, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1008-this-place-is-very-unhygienic", "volume_title": "Volume 11", "body": "<h1>Chapter 1008 - This place is very unhygienic</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Soon after, the boss’s voice rang out from the kitchen.</p><br/><p>“Excuse me, please come and collect your noodles.”</p><br/><p>When the middle-aged woman heard this, she slammed the table, expressing her displeasure. “What is it? I’m paying for these noodles but I still have to collect them myself? Serve them to me.”</p><br/><p>As the boss was filling up the last bowl with noodles, he heard this and sighed. However, he wasn’t petty about it. One should never argue with unreasonable people because no matter what you say, you would never win the argument.</p><br/><p>Then, he carried a bowl of noodles in each hand and brought two bowls to the table before going to get the last bowl.</p><br/><p>As the boss was about to leave the table, that middle-aged woman said unkindly, “Stand there and don’t move.”</p><br/><p>The boss stopped, wondering what this woman was going to do. At that moment, he saw the woman place all the beef into a separate bowl. She raised her head and looked at the boss. “I want to ask you this. We’re spending money to eat your noodles and helping you to earn money. What did you mean when you said that you won’t sell your noodles.”</p><br/><p>The boss said, “Lady, what you’re saying isn’t right. Although I sell noodles to make a living, your child is simply too rude. How can you educate him this way?”</p><br/><p>*Clatter!*</p><br/><p>The middle-aged woman slammed the table furiously. “How I educate him has nothing to do with you. Just sell your d*mn noodles and mind your own business.”</p><br/><p>“Can’t you speak nicely? As a parent, how can you say such things in front of your child?” The boss had not expected this parent to be so unreasonable. It was completely out of his expectations.</p><br/><p>Lin Fan, who was at the side, furrowed his brows. He felt that this woman was really outrageous. If she behaved this way, how could the child possibly be well-educated?</p><br/><p>The two other middle-aged women at the other table hadn’t left yet. At this moment, they spoke up for the boss, “You can’t educate your child like this. If you don’t educate him well from young, he’ll become useless when he grows old.”</p><br/><p>Then, the mother picked up a pair of chopsticks and threw it at them furiously. “What did you say? Who are you saying will become useless? Your whole family will become useless, not mine! That’s because you are not capable at all. This is just the way my child is. In the future, even if a hole appears in the sky, I will patch up that hole for my child.”</p><br/><p>The two middle-aged women had been frightened by this woman’s actions and they didn’t dare to say more. To them, this woman was really a brute.</p><br/><p>Moreover, she was unreasonable. They didn’t dare to anger such a person for fear of getting burned.</p><br/><p>At this moment, the middle-aged man looked at that granny. “And you, old hag, how can you get bullied even when you’re bringing your grandson out for lunch? How useless are you?”</p><br/><p>When Lin Fan heard these words, he couldn’t take it any longer. “You really don’t know what’s good for you.”</p><br/><p>“What? All of you just want to go against me today, don’t you? You all want to help this boss, don’t you? Alright then. Well done to all of you.”</p><br/><p>“Right now, I’m going to make a report. I’m going to report your shop for being unhygienic and dirty.”</p><br/><p>After saying that, the woman took out her phone and dialed a number.</p><br/><p>When the boss saw this, he instantly panicked. “You can’t just slander me like that! How is my shop not clean? I always clean my shop up after every customer. I wash my equipment every day. The kitchen is cleaned every day too. How can you say that my shop is unhygienic?”</p><br/><p>“How? I can say anything I want,” barked the woman arrogantly. Her expression was tyrannical. As she displayed her dominance, it was as if she saw everyone else as inferior.</p><br/><p>The boss was furious now and also upset. He felt that it was really hard to be a good person. He had meddled into something and now he was in trouble.</p><br/><p>Seeing someone’s child misbehaving and saying a few words had caused him such trouble.</p><br/><p>At that moment, the call got through.</p><br/><p>“Hello, I want to make a report. There’s a noodle shop that has terrible hygiene. Come here quickly,” said the middle-aged woman unrestrainedly. Then, she stated the address of this place.</p><br/><p>As the boss stood at the side, he was so anxious that he didn’t know what to do. This was slander. It was plain slander.</p><br/><p>Lin Fan maintained his cool as he quietly waited. He wanted to see just what this woman could do.</p><br/><p>Within ten minutes, a government car arrived. It was from the Food Hygiene Administration.</p><br/><p>A group of workers walked over. When they saw this woman, they nodded at her but they acted as if they didn’t know each other. One of the workers, a tall and lanky man, shouted, “Who called to make the report?”</p><br/><p>“It was me,” said the middle-aged woman. Then she stood up and pointed to the surroundings. “I discovered that the hygiene in this shop is very poor.”</p><br/><p>Lin Fan laughed in his heart. She had just made the call and those people had come immediately. Either the people in this department were very serious about their work and they took the public’s reports very seriously or these people knew the woman.</p><br/><p>Lin Fan chose to believe the latter.</p><br/><p>When the middle-aged boss saw that they had really come, he became nervous. There was no problem with his shop. There was definitely no problem.</p><br/><p>“There are no problems with my shop. She’s falsely accusing me.”</p><br/><p>The lanky worker waved his hand. “That’s not for you to say. Your shop’s environment will tell us if there is a problem or not. Since someone has reported, we have to do a proper check. Go and check the kitchen.”</p><br/><p>The men at the side who were in working attire nodded their heads before heading into the kitchen.</p><br/><p>The boss looked at the middle-aged woman and frowned. He couldn’t figure out just what was going on.</p><br/><p>As for the women sitting at the other table, they shook their heads. They felt that this vixen definitely had connections. Otherwise, this wouldn’t be happening. Those workers had arrived too quickly, so much so that it wasn’t believable.</p><br/><p>These days, even if someone called an emergency ambulance to save someone’s life, it wouldn’t arrive so quickly.</p><br/><p>Could it be that they took an airplane here?</p><br/><p>At that moment, voices came from the kitchen.</p><br/><p>“The ventilator is dirty.”</p><br/><p>“There’s dust here.”</p><br/><p>“What bit this thing? It looks like it was bitten by rats.</p><br/><p>“There are spider webs in the corner.”</p><br/><p>When the boss heard this, he was so enraged that his face turned red. “That’s not possible. I definitely cleaned it up well.”</p><br/><p>The workers moved the kitchen counter away and pointed at the deepest end. “Not possible? Why don’t you come and take a look for yourself?”</p><br/><p>When the boss saw that the workers had actually moved the kitchen counter away to look at the corner, he was lost for words. Were they reviewing a five-star hotel or something?</p><br/><p>He was just a noodle seller.</p><br/><p>He didn’t dare to guarantee that every corner was sparkling clean but he dared to guarantee that he cleaned the place up every day. The place was hygienic and there definitely wouldn’t be rubbish left in the kitchen overnight.</p></div>\n</div>"}