{"title": "Chapter 1007 - Undisciplined and out of control", "id": 1007, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1007-undisciplined-and-out-of-control", "volume_title": "Volume 11", "body": "<h1>Chapter 1007 - Undisciplined and out of control</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After Wang Ming Yang left, Lin Fan’s mood was exceptionally good. Having a good friend was a great thing after all.</p><br/><p>He was feeling a little hungry. He saw a noodle shop by the road that was pretty well decorated. Although it was a little small, he thought that it must have had a good business.</p><br/><p>He stopped the car by the road.</p><br/><p>“He Family Noodles.”</p><br/><p>This was the name on the signboard. It represented family harmony and prosperity.</p><br/><p>As he walked in, a group of people at a table were eating.</p><br/><p>“Boss, give me a bowl of prawn noodles,” Lin Fan hollered as he sat down.</p><br/><p>“Got it.” When the middle-aged boss behind the counter heard this, he went into the kitchen. The kitchen wasn’t sealed off, so one could see the inside clearly from the outside.</p><br/><p>It was a good and clean environment.</p><br/><p>At that moment, an old granny with a child walked into the shop. “Boss, two bowls of beef noodles.”</p><br/><p>“Okay, got it,” the boss shouted from the kitchen.</p><br/><p>“Granny, I’m so tired. Carry me on the way back.” This child appeared to be a first grader in primary school. As he sat on the chair, his hands were restless. He picked up the toothpicks from the table and poured all of them out from the container to play with them.</p><br/><p>“Alright, Granny will carry you. You can’t play with this. Put it back,” said the granny helplessly.</p><br/><p>The child was upset. “No, I want to play.”</p><br/><p>As Lin Fan saw this, he shook his head. He felt that this child was really playful. However, he didn’t think too much about that. Instead, he was thinking about where he should go after eating the noodles.</p><br/><p>He could make use of this time to go around to take a look and see if there were any suitable people to give the carvings to. This was a good plan to kill two birds with one stone.</p><br/><p>“The prawn noodles are done. Please come over to collect it,” said the boss from the kitchen.</p><br/><p>There were no waiters in the shop, so the customers had to serve themselves. Lin Fan stood up and went to the counter to collect the noodles.</p><br/><p>“The beef noodles are done,” the boss shouted once more.</p><br/><p>The granny said to her grandson, “Be obedient. Don’t move. Granny is going to collect the noodles.”</p><br/><p>Lin Fan put a spoonful of noodles into his mouth. He felt that the taste was really pretty good. It seemed that his eye for a good eatery was pretty good.</p><br/><p>At that moment, the child’s voice at the side drew Lin Fan’s attention.</p><br/><p>The child stared at his granny’s bowl and frowned. “Granny, did you not give all your beef to me today?”</p><br/><p>The granny smiled. “Of course I did. Before carrying the bowls over, I already put all the beef in your bowl.”</p><br/><p>The child was upset as he shouted loudly, “You’re lying! You’re definitely hiding your beef. I have much less beef here than I did last time.”</p><br/><p>Then, he picked up his chopsticks and stuck them in his granny’s bowl, searching for hidden pieces of beef. As he did this, some of the noodles spilled onto the table.</p><br/><p>The granny had a look of helplessness on her face. “You really don’t listen.” Then, she picked up the noodles from the table with her chopsticks and placed them back into the bowl.</p><br/><p>When the child saw that there was no more beef, his legs kicked the air in frustration. “I don’t believe you. You must have secretly eaten it. How can you do that? I won’t eat anymore. I won’t eat!”</p><br/><p>When the boss heard these voices, he came out. Seeing that it was a kid, he felt that this kid was a little tyrant, undisciplined and out of control.</p><br/><p>Lin Fan stopped eating and said to the child, “Child, you can’t treat your granny like this.”</p><br/><p>“What does this have to do with you? Just eat your own noodles,” the boy barked at Lin Fan rudely as his neck turned red.</p><br/><p>When Lin Fan heard this, he was so angry that he wanted to give the boy a few slaps. But he resisted the urge. If it wasn’t a little boy, he definitely would have taught him a lesson.</p><br/><p>The granny nodded at Lin Fan. “Sorry. I’m sorry. This child is spoiled.”</p><br/><p>Lin Fan felt a strong disapproval. <em>You know that he’s spoiled but you’re still spoiling him further.</em></p><br/><p>Then, the granny sighed. “If you don’t eat, you’ll be hungry. Granny will buy you another bowl.” It seemed that she had no other way to deal with this grandson.</p><br/><p>The middle-aged boss, who was nearby, saw this and was filled with anger.<em>How can a little child behave like this? His education has really failed.</em></p><br/><p>Without waiting for the granny to say anything, the boss said, “Sorry, I don’t sell my noodles to children who don’t know manners.”</p><br/><p>When the granny heard this, she sat down helplessly. Seeing that her grandson was still angry, her voice became weak. “Granny really didn’t eat it. I gave it all to you.”</p><br/><p>At that moment, as the child sat there, he was so angry that a vein had appeared on his forehead. With his little hand, he swept the two bowls of noodles onto the ground. Then, he picked up his school bag and stormed out of the place without turning back at all. The granny followed behind, chasing after him hastily.</p><br/><p>“Sigh. Children nowadays are all spoiled. If he’s like this now, who knows how he’ll be in the future?” When the middle-aged boss saw this, he was so furious that his face turned red. He carried some cleaning equipment over to clean up the spilled noodles.</p><br/><p>Lin Fan shook his head as he ate his noodles. “Boss, what you did just now was right.”</p><br/><p>The boss looked at Lin Fan and put on a wide smile. “Sigh. I only did that because I wanted the child to know his mistake. I also wanted his granny to know that she can’t treat a child like that. But looking at what happened, it seems that it didn’t work at all.”</p><br/><p>At another table, two middle-aged women who had almost finished eating shook their heads. “If my child behaved like that, I would beat him until he kneels. That child was out of control. I wonder what kind of family produced a child like that. This is really unacceptable.”</p><br/><p>“Yeah. That child is simply a little tyrant. His education has failed.”</p><br/><p>The middle-aged boss sighed. “Two good bowls of noodles have gone to waste. Right now, in some places, children don’t even have food to eat. They might only get a bowl of porridge a day. Meanwhile, children in cities throw their food away if they can’t finish it. They develop such habits of wastage from a young age that will be hard to change when they grow old.”</p><br/><p>Lin Fan looked closely at the boss. He hadn’t noticed before that this boss was actually a kindhearted person. This boss would make handmade noodles each year and vacuum pack them before sending them to some rural areas.</p><br/><p>He was a good person but he didn’t really suit the task. This middle-aged boss’s life was great. He had a son and a daughter and there were no calamities in his future.</p><br/><p>The middle-aged man cleared up the spilled noodles, then placed them into a box before placing this box outside, next to the plants. It seemed that he was giving the food to stray animals to eat.</p><br/><p>“Please carry on eating.” The boss smiled apologetically to the people inside the shop. Then, he placed all the toothpicks on the table back into the container.</p><br/><p>Lin Fan shook his head. He wondered which family this child belonged to. To raise a child to such a state, that family had really failed.</p><br/><p>After some time.</p><br/><p>Lin Fan had almost finished his noodles. As he was preparing to pay the bill, three people entered the place.</p><br/><p>Among these three, two of them were the granny and the child. The third person was a middle-aged woman.</p><br/><p>“Give me three bowls of noodles.” The middle-aged woman sat down. Meanwhile, the child arrogantly sat by her side. As for that granny, it seemed that she had been reprimanded and her eyes were a little red.</p><br/><p>When the boss saw this, he didn’t say much as he just went into the kitchen to prepare the noodles.</p><br/><p>Lin Fan was in no hurry to leave. He wanted to see what these people were going to do.</p></div>\n</div>"}