{"title": "Chapter 1000 - On site of the award presentation", "id": 1000, "volume": 10, "url": "http://boxnovel.org/a-valiant-life-chapter-1000-on-site-of-the-award-presentation", "volume_title": "Volume 10", "body": "<h1>Chapter 1000 - On site of the award presentation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Elder Dog’s fan group.</p><br/><p>“Elder Dog has already reached the venue.”</p><br/><p>“Haha, I didn’t think Elder Dog would actually reach such a stage. From now on, he will be a famous dog throughout the country and he will eventually be known to the world.”</p><br/><p>“Very good. I believe that ambitious goal will one day be met.”</p><br/><p>“I wonder how Master Lin raised Elder Dog, to make Elder Dog so smart and so righteous.”</p><br/><p>“Sigh. When I raised a dog that was exactly the same as Elder Dog, it was really too stupid. But I really loved it. He was loyal to me.”</p><br/><p>“I have one too. Although it isn’t good-looking, it is really fun to play with.”</p><br/><p>“The two little sisters above me, go easy on the dogs. If you want to play, you can play with me.”</p><br/><p>“F*ck off. Admin, come and kick this guy out.”</p><br/><p>Elder Dog had become famous and he even had his own fan group. Although they usually didn’t do much, Elder Dog was in all of their hearts. After all, to them, Elder Dog was really too brave and he was extremely smart too. He was very likeable.</p><br/><p>Cloud Street!</p><br/><p>The shop owners seemed to have arranged beforehand not to go home but to gather here together. Because there were too many people, they had divided themselves into several shops to watch the show.</p><br/><p>Although nighttime was the peak period, Elder Dog was worth stopping their businesses for.</p><br/><p>“Sigh, when will Little Boss and Elder Dog come out?”</p><br/><p>“What’s the hurry? Just watch slowly. Can’t you see that the programme is about to begin?”</p><br/><p>“Haha, I never thought that out of all of us in Cloud Street, Elder Dog would be the one getting an award. Actually, I feel like Little Boss could get this award too.”</p><br/><p>“I think so too. With the things that Little Boss has done, getting the award is not a problem at all. But perhaps it will happen next year. The programme crew might be thinking that it would be hard to explain giving two awards to the both of them, so they decided to give the award to Little Boss next year.”</p><br/><p>“That’s really possible.”</p><br/><p>“Hush. Let’s not talk for now. We have to watch closely. I’m getting a little nervous. I wonder when they will come out.”</p><br/><p>Some tourists who had come to Cloud Street to buy things saw that most of the shops were closed and felt that it was very strange. When they saw a group of shop owners gathered in a shop, they wanted to ask the shop owners if they were going to open their shops. However, they were immediately rejected by the shop owners.</p><br/><p>This was their first time shopping here. Meeting such strange shop owners, they were speechless.</p><br/><p>In the hospital.</p><br/><p>Zhou Jun had been bitten by Elder Dog and he was still lying on the hospital bed, letting his injury recover. Right now, he was watching a video on his phone and it was Touching China’s Top Ten People Award Ceremony. He kept on cursing to himself.</p><br/><p>“D*mned dog. How much money was spent so you could get the award?”</p><br/><p>After being bitten by Elder Dog, the fury in his heart hadn’t subsided. He just wanted to brutally kill this dog. His father had used his connections to get someone to attack the dogs but who would have known that this dog actually had such an identity. When they found out, they had been dumbfounded.</p><br/><p>In his rage, he watched the live broadcast. He wanted to see the reason this dog had won the award.</p><br/><p>At the venue!</p><br/><p>Lin Fan interacted with the programme leader for a while before the leader went out.</p><br/><p>“Doggy, you’re really awesome this time,” said Lin Fan with a grin. Thinking of the impact this doggy would bring in the future, he was slightly curious. He wondered how things would be.</p><br/><p>Soon after, noise came from outside. When he turned on the backstage television, it showed the situation on stage.</p><br/><p>At that moment, a male host came from behind the curtains to deliver the opening speech. The venue was totally silent as everyone waited quietly.</p><br/><p>As Lin Fan sat backstage and watched, his heart started to grow heavy. In here, they were displaying the most beautiful moments of humanity.</p><br/><p>The first recipient was an old man who sharpened blades. He was already close to eighty and he lived in a small town. His daily income was from sharpening blades. Some days, he wouldn’t earn any money at all. Some days, he would earn around eight or seven dollars.</p><br/><p>And one time, when he found out that a place had been hit by a natural disaster, he immediately donated all the money that he had saved, amounting to just over a thousand dollars, to the charity organization.</p><br/><p>Although it wasn’t much, not many people had such a big heart.</p><br/><p>As time passed, Lin Fan just sat there watching the whole time. The emotions in his heart were deep. At that moment, a staff member came to call them.</p><br/><p>Lin Fan got up and gestured to Elder Dog. “Doggy, let’s go. It’s your turn.”</p><br/><p>In front of their televisions, all the spectators were thinking about one thing. It was going to be that dog next.</p><br/><p>At the scene.</p><br/><p>The audience that had been watching the whole time started to whisper amongst themselves. Before they came, they had already known that this time, one of the awards would be given to a dog. To them, it was inconceivable and some even found it unacceptable.</p><br/><p>Some people were about to leave. This wasn’t because they didn’t respect the programme but they felt that the programme crew was screwing around with them.</p><br/><p>The previous nine recipients had all done touching things that they all respected. But now, the final recipient could only make them laugh.</p><br/><p>The host saw the situation and was powerless as well. When he had found out about this matter, he had been shocked as well. He felt that the programme crew had make a mistake. It was only later on that he found out that it was all true.</p><br/><p>“Through all these years, people from all professions and industries have come here before but this time, we have an exceptional award recipient. He can’t speak but he has a loyal voice. He doesn’t eat exotic delicacies, but to him, any food is an exotic delicacy.”</p><br/><p>“He is man’s best friend and man’s loyal companion.”</p><br/><p>“A fire is merciless and we all know to avoid it. The smarter we are, the more we would feel the terror of a fire. But with his small little stature, he charged into a fire and disregarded the engulfing flames. He charged through all of it into a twenty-something-storey building that was on fire. He placed a newborn infant in his mouth and protected it through the flames. He brought it back to safety and into the sight of people. With his small body, he rescued a life and he saved a family. Even with his whole body burnt and covered in soot, he was fearless. In the end, he left under the gazes of many people.</p><br/><p>Those people who had been about to leave just stood there with their eyes gaping as they looked at the video shown on stage.</p><br/><p><em>This…</em></p><br/><p>At the same time, people in front of their televisions at home who had been waiting to watch a joke happen were completely flabbergasted.</p><br/><p>“F*ck! Is this real?”</p><br/><p>“I don’t know but it seems real.”</p><br/><p>“This dog is so brave. It really saved an infant.”</p><br/><p>“F*ck me. His fur was all burnt. This dog is too brave.”</p></div>\n</div>"}