{"title": "Chapter 1012 - It will bring you good luck", "id": 1012, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1012-it-will-bring-you-good-luck", "volume_title": "Volume 11", "body": "<h1>Chapter 1012 - It will bring you good luck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The tramp was about to extend his hand but he suddenly remembered that his hand was dirty. Then, he pointed to his left palm with his right hand before dusting off his hands, meaning to say that his hand was dirty.</p><br/><p>*Clatter!*</p><br/><p>Without hesitation, under the astonished gaze of the tramp, Lin Fan went and shook his hand. “Hello.”</p><br/><p>The tramp saw that this man was smiling at him, so he smiled happily as well. Although he couldn’t hear anything, he could see that this person had probably said ‘Hello’.</p><br/><p>Then, he tried to say something but he could only make a strange sound. Still, his meaning was clear.</p><br/><p>He was saying ‘Hello’.</p><br/><p>Lin Fan took out the wooden carving and held it in front of the tramp. “For you. It will bring you good luck.”</p><br/><p>The tramp looked at the beautiful and exquisite wooden carving and was stunned for a moment. He couldn’t understand what this person meant. It seemed that this man was giving this thing to him but he couldn’t accept it.</p><br/><p>He waved his hands and shook his head.</p><br/><p>Lin Fan felt that communicating was really inconvenient for this person who couldn’t speak. Then, he squatted down and pointed at his throat and ear. “I can cure you of your deafness and muteness. Do you believe me?”</p><br/><p>The tramp looked at Lin Fan with no idea what he had just said. However, he saw that this person had pointed to his throat and ears and his expression was slightly sorrowful too. But then, this sorrowful expression disappeared with a blink and was replaced by a face full of smiles.</p><br/><p>To Lin Fan, it was really hard to communicate. Then, an idea appeared in his mind. He took out his phone and immediately started typing. After typing, he held the phone in front of the tramp.</p><br/><p>The tramp saw the words on the phone and was stunned.</p><br/><p>‘I can help you cure your deafness and muteness. If you are willing to trust me, I can have a try.’</p><br/><p>These words had brought a huge shock to the tramp. He couldn’t believe it.</p><br/><p>Lin Fan looked at him and nodded as if waiting for his reply.</p><br/><p>The tramp hesitated for a moment before finally nodding his head as if he didn’t want to disappoint Lin Fan and he didn’t want to reject Lin Fan’s goodwill.</p><br/><p>He knew that this was impossible because he had been born with this condition. Although he hadn’t been to a hospital to get it checked, this was something that he had found out about.</p><br/><p>After receiving his approval, Lin Fan pinched the tramp’s throat with his fingers. Although it was a very normal technique, he was actually checking the cause of the tramp’s condition.</p><br/><p>Then, he chuckled. The Encyclopedia’s mystical boost went through his hands and deep into the tramp’s body. At the same time, his inner power formed sharp lines which pierced into the tramp’s acupuncture points.</p><br/><p>The tramp suddenly felt that his skin was very itchy. It was as if something had pierced his skin.</p><br/><p>This kind of feeling was very strange. It was as if there was something flowing through his body.</p><br/><p>After some time, Lin Fan stopped his actions. Then, he smiled at the tramp. “See if you can speak.”</p><br/><p>The tramp looked at Lin Fan. Although he felt that what just happened had been strange, he still felt that there was no way he could speak.</p><br/><p>Suddenly!</p><br/><p>He was astonished at the thought of his ability to hear.</p><br/><p>How could that be? How could he actually hear things?</p><br/><p>“I…” There was a look of disbelief on the tramp’s face as he opened his mouth. But because he had never spoken before, he didn’t know how he should do it. All these years, he had been reading those beautiful words in his heart but when he wanted to speak, it was as if he had been stifled.</p><br/><p>Lin Fan could only do this much. As for those legs that had been cut off, he couldn’t do anything about that. Then, he passed the wooden carving over.</p><br/><p>“This is for you. It will bring you luck.”</p><br/><p>“As long as you stay true to yourself, it will give you an exceptional life.”</p><br/><p>The tramp wanted to say more but then, he realized that this man had stood up and was walking into the distance. Meanwhile, the man’s voice kept ringing in his ears.”</p><br/><p>“Take care of it. It will really bring you luck.”</p><br/><p>In the end, he could only stare blankly as the man slowly disappeared from his sight.</p><br/><p>Then, he lowered his head and looked at the wooden carving. He looked around as if he was wondering if this was a dream. All of this was unbelievable.</p><br/><p>“I can speak now.”</p><br/><p>“I can hear sounds.”</p><br/><p>At that moment, in the public square, this tramp’s excited expression was as if he had never expected this day to come.</p><br/><p>Then, he held tightly onto the wooden carving in his hand and gazed into the distance as if he wanted to remember that silhouette for the rest of his life.</p><br/><p>Lin Fan’s heart was filled with delight as well. He had such absolute powers and he was able to help so many people.</p><br/><p>Especially when he saw the looks of disbelief or shock of people’s faces, he felt great.</p><br/><p>The next day!</p><br/><p>Lin Fan appeared at Cloud Street as usual.</p><br/><p>On the Internet, a piece of news had appeared.</p><br/><p>A certain reporter had published a set of photos. They were photos of that tramp in the public square, pushing damaged or abandoned sharing bikes to the bike-sharing area one after another.</p><br/><p>At the same time, this reporter generously praised the man for this incident.</p><br/><p>It had actually drawn the attention of the boss of the bike-sharing company, who posted a statement on their official Weibo. He said that he was willing to hire this man and he would give him all the welfare benefits that any normal employee would receive. Also, they would even provide him with any support he needed for his first period of work.</p><br/><p>To the netizens, this was a righteous way to use his capabilities and they sent a series of positive comments.</p><br/><p>When Lin Fan saw this Weibo post, he even specially reposted it and left seven words as a comment.</p><br/><p>“Good people will live a life of peace.”</p><br/><p>When the bike-sharing company’s boss saw that Master Lin had reposted his Weibo post, he was exhilarated.</p><br/><p>Although Master Lin wasn’t very well-known in his line of business, anyone who followed Master Lin knew that Master Lin’s circle of friends was very broad. Also, Master Lin had never reposted other people’s Weibo posts in history. Now, his own Weibo post had been reposted.</p><br/><p>This kind of recognition really made him feel amazing.</p><br/><p>At the public square.</p><br/><p>That tramp was doing his usual activities as usual. Especially because he had met someone who had cured his deafness and muteness, the smile on his face was even brighter than usual.</p><br/><p>When the bike-sharing company’s boss came over, he was dumbfounded. He didn’t dare to believe it.</p><br/><p>The boss actually wanted to hire him as an employee to manage the bikes in this area. He would earn several thousand a month and the company would even pay for his insurance and accommodation.</p><br/><p>To the tramp, this was completely unimaginable.</p><br/><p>At that moment, he placed his hand into his clothes pocket. In there was the wooden carving that had been given to him the previous day.</p><br/><p>In his mind, that man’s words resounded.</p><br/><p>It will bring you good luck.</p><br/><p>…</p></div>\n</div>"}