{"title": "Chapter 1013 - Quick-witted maneuver", "id": 1013, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1013-quick-witted-maneuver", "volume_title": "Volume 11", "body": "<h1>Chapter 1013 - Quick-witted maneuver</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Wu You Lan said curiously, “Brother Lin, what are you laughing about? Is there something good that happened?”</p><br/><p>Lin Fan smiled as he said, “No, I just saw a piece of news and it’s really heartwarming. This is really good.”</p><br/><p>To a normal person, this might be a very normal thing. However, Lin Fan’s meeting with that tramp the previous day had changed that person’s life.</p><br/><p>He was also secretly proud of it. This thing that he produced was quite amazing. It produced results so quickly.</p><br/><p>Zhao Zhong Yang, who was using his phone, started talking to himself, “D*mn, there’s a new influenza.”</p><br/><p>Lin Fan asked, “What influenza?”</p><br/><p>Zhao Zhong Yang shook his head. “I don’t know. I think it’s the newest one. Many people from a small town are infected. This article doesn’t describe much. It just advises people to watch their hygiene.”</p><br/><p>Fraud Tian said, “This kind of thing typically gets wiped out very quickly. Our country’s medical treatments are quite advanced.”</p><br/><p>Lin Fan stayed there for a while more before he prepared to leave and find a target.</p><br/><p>He had already realized that, if you pay more attention sometimes, you would be able to discover some things that have been neglected in the past.</p><br/><p>“I’m going out.”</p><br/><p>Lin Fan gave everyone a holler before leaving the shop.</p><br/><p>Fraud Tian watched Lin Fan’s back view as he left. He said curiously, “What has this kid been doing recently? He keeps going out. Could it be that he has found a girl outside?”</p><br/><p>*Cough cough cough*</p><br/><p>When Zhao Zhong Yang heard that, he immediately started coughing. “Fraud, are you trying you find trouble for yourself?”</p><br/><p>Fraud Tian said, “What do you mean by that?” But just as he said that, he sensed a strong killing intent directed at him. He looked over and laughed before slapping his own mouth. “This mouth of mine really likes to talk rubbish.”</p><br/><p>“I was just bullsh*ting. Pretend I didn’t say anything.”</p><br/><p>Wu You Lan glared at Fraud Tian and snorted three times coldly as if to say ‘You better watch yourself.’</p><br/><p>Outside!</p><br/><p>Lin Fan was driving his car and thinking where he should look. Shanghai was so big. This kind of situation was not uncommon.</p><br/><p>*Screech*</p><br/><p>A sports car appeared next to him. It was also waiting for the traffic light.</p><br/><p>The light turned green.</p><br/><p>They accelerated.</p><br/><p>In front, a man was driving a battery-powered vehicle. A child was sitting at the front of the vehicle. The traffic light was now red and the vehicle was supposed to turn, so it waited there.</p><br/><p>But the child in the vehicle was not obedient. She thought they had reached, so she jumped off the electric vehicle and ran to the left side.</p><br/><p>When that man realized that the child was running on the road, he panicked and quickly got off the vehicle to chase the child. Especially when he saw a few cars speeding towards them, his spirit left his body.</p><br/><p>Lin Fan had been in a carefree mood at first but suddenly, he saw the situation in front and was given a violent shock. A child was running in front of him and, judging by his momentum, Lin Fan wouldn’t collide with him but that car next to his would very likely run over the child.</p><br/><p>Especially because the horsepower of this sports car was rather high.</p><br/><p>Without thinking, he jerked the steering wheel to the side and banged his car onto that sports car. He jammed the brakes to position his car perpendicular to the road to block off the cars behind.</p><br/><p>He looked at the situation. It was f*cking dangerous.</p><br/><p>The traffic police had seen the situation from the start and he had wanted to run over to help but it had been too late. He hadn’t expected a car to push aside the car next to it and block the road.</p><br/><p>In his heart, he was praising this driver’s quick-wittedness.</p><br/><p>In the sports car.</p><br/><p>A young man was sprawled on the steering wheel. His head was hurting a little. When he realized his car had been knocked into, he flew into a rage as he flung open the door.</p><br/><p>When he saw the state of his car, he started cursing out loud.</p><br/><p>“F*ck your mom! Are you f*cking blind? You’ll have to sell your house to repay me now.” Huang Zhen was furious. He felt that this was really f*cked up. Someone actually dared to purposely collide with his car.</p><br/><p>Usually, when other drivers saw his car, they would stay far away from it in fear of even touching it.</p><br/><p>If they just scratched it a little, they would vomit blood.</p><br/><p>Now, someone actually dared to bang into his car purposely.</p><br/><p>Lin Fan got off his car and walked a few steps to that adult and the child in front. “Is the child alright?”</p><br/><p>The adult was in a pretty severe state of shock. He shook his head. “He’s fine, he’s fine. Thank you so much.”</p><br/><p>The situation had been way too dangerous. He also knew that if it hadn’t been for this person in front of him who banged into the sports car, the outcome would have been horrifying.</p><br/><p>After all, the cars behind couldn’t see the situation in front. Even if they had managed to dodge the sports car, they wouldn’t be able to dodge the subsequent cars.</p><br/><p>The traffic police ran over in a hurry and patted Lin Fan on the shoulder. “You’re way too awesome. In such a critical moment, you actually thought of such a solution.”</p><br/><p>Huang Zhen was fuming as he walked over. He shoved Lin Fan furiously. “Do you have a f*cking problem? Pay for my car!”</p><br/><p>But Lin Fan didn’t move at all from Huang Zhen’s shove. Instead, Huang Zhen felt as if he had pushed a concrete wall. Even his wrist was hurting a little.</p><br/><p>The traffic police had wanted to see how this quick-witted hero looked. But when he saw the owner of that sports car in a rage, he hurriedly said, “Youngster, don’t be rash. This was a special case. If he hadn’t knocked your car aside, you would have run over this child.”</p><br/><p>“What kind of joke is that? So what if I run over him? This brat was asking for death himself. You couldn’t have blamed me for running him over,” Huang Zhen answered without thinking.</p><br/><p>“How can you say such things?” The traffic police frowned as he felt that this young man’s words were too brutal.</p><br/><p>Lin Fan turned away from the traffic police and the sports car driver. He patted the child’s head. “Little girl, don’t run around as you like from now on.”</p><br/><p>“Thank you, thank you,” the adult kept on thanking him. However, there was still fear in his heart. This situation had been caused by his daughter and the car which had been banged into was a luxurious car. How could he possibly pay for the damages?</p><br/><p>“Alright, there’s nothing else for you here. Go on.” Lin Fan said with a smile.</p><br/><p>Huang Zhen had been quarreling with the traffic police the whole time when he suddenly heard Lin Fan say that.</p><br/><p>He actually told that battery-powered vehicle driver to go. Then, Huang Zhen barked, “Who agreed to let them go? Don’t move! Before we settle this matter, nobody will leave.”</p><br/><p>Lin Fan turned around and looked at that young man. “Why do you speak without thinking?”</p><br/><p>At that moment, the traffic policeman took a closer look at the hero’s face and was startled. He gasped in disbelief, “Master Lin…”</p><br/><p>Lin Fan nodded at him.</p><br/><p>Meanwhile, when Huang hen found out that this was Master Lin, he was startled as well. However, thinking about how his beloved car had been damaged to such a state, he was still furious.</p><br/><p>“Good, you’re a famous person. That’s good. Let them go then. You will handle this matter for me.”</p></div>\n</div>"}