{"title": "Chapter 1031 - Don't you know about Meitu Xiu Xiu?", "id": 1031, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1031-dont-you-know-about-meitu-xiu-xiu", "volume_title": "Volume 11", "body": "<h1>Chapter 1031 - Don't you know about Meitu Xiu Xiu?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cloud Street!</p><br/><p>Lin Fan was looking at the comments about his back view on the Internet. He felt that what these people said wasn’t quite right. It was just a little flawed.</p><br/><p>What did they mean when they said the influenza was easy and wasn’t much at all? Lin Fan wouldn’t admit to that. They were completely denouncing him falsely. It had clearly been very difficult to cure the influenza.</p><br/><p>As for him being brave and taking on a huge undertaking, of course he would admit to that.</p><br/><p>After all, that was exactly the kind of person he was.</p><br/><p>Wu You Lan went behind Lin Fan and massaged his shoulders with her slender fingers. Her tender lips opened slightly. “Brother Lin, everyone on the Internet is praising you.”</p><br/><p>Lin Fan leaned back pleasurably. These days were really comfortable and they passed by very easily. “They’re not praising me, they’re falsely accusing me.”</p><br/><p>Then, he pointed at one of the comments unhappily.</p><br/><p>“Look at this comment. It’s saying that I’m slapping those specialists in the face. Do you think that’s right?”</p><br/><p>“And this one is even worse. It’s saying that I cured the influenza very easily but I purposely waited until the second day. If this isn’t a false accusation, I don’t know what it is.”</p><br/><p>“And this one is actually saying that I ruined many pharmacy businesses. I just treated the illness, I don’t even sell medicine. How could I have ruined their businesses?”</p><br/><p>These comments came one after another. All kinds of random comments left him lost for words.</p><br/><p>Fraud Tian glanced at Lin Fan. “How many people have you offended altogether by resolving this matter?”</p><br/><p>Lin Fan nodded. “It seems that I’ve offended some people again. I heard that these pharmacies were starting to hoard the medications again but they didn’t expect me to cure the influenza.”</p><br/><p>Zhao Zhong Yang said angrily, “These pharmacies are really ridiculous. They just raise the price as they like. Now that they can’t sell the medications that they’ve hoarded, it’s not Brother Lin’s fault.”</p><br/><p>Wu You Lan nodded as well. “That’s right. These people were thinking of making money out of other people’s suffering. Luckily, the influenza didn’t spread outside. Otherwise, who knows how much of other people’s hard-earned money they would have earned?”</p><br/><p>Lin Fan locked his phone and decided to stop caring about this matter.</p><br/><p>“Let them be then. There’s nothing to be afraid of.”</p><br/><p>*Ding ding*</p><br/><p>At that moment, his phone rang.</p><br/><p>Lin Fan indicated for everyone to stop talking for a moment.</p><br/><p>“My mom is calling. Wait a moment.”</p><br/><p>Then, he answered the call.</p><br/><p>“Mom, what is it?”</p><br/><p>Mama Lin, who was on the other end of the call, sounded a little strange. “Son, can’t your mom call you if I’m free?”</p><br/><p>Lin Fan replied, “Mom, when did I ever say that? This is just what I usually say when I answer calls.”</p><br/><p>After being told off by his mother, he really felt that he had been wrong to say that. How could he speak to his mother like that?</p><br/><p>Wu You Lan was very quiet but she was listening the whole time. She knew that Auntie was always trying to get Brother Lin to find a girlfriend. She was anxious as well as she didn’t know who would end up with Brother Lin in the end.</p><br/><p>Mama Lin said, “Alright, Mom won’t talk to you about this. Think about it, is there something you’re forgetting?”</p><br/><p>Lin Fan was taken aback and a little confused. <em>What did I forget?</em></p><br/><p>“Mom, is it that I haven’t gone back in a long time?”</p><br/><p>“Think again.”</p><br/><p>Lin Fan racked his brain thinking. “Mom, I really can’t think of anything. It’s better if you just tell me.”</p><br/><p>“Sigh, you brat. Your dad is turning fifty. Did you forget?” said Mama Lin, “We always remember your birthday but not you’ve even forgotten your dad’s birthday.”</p><br/><p>After his mother’s reminder, Lin Fan suddenly realized it. In his heart, he felt guilty as well. “Mom, I was wrong. I was really wrong. I can’t believe I forgot such a big event. It’s my fault. I’ll go back tomorrow.”</p><br/><p>“Mmm. Your dad didn’t want to do anything but I thought that it wasn’t right. Although your dad doesn’t have many skills, he still raised this family up. This person who has such a large ego and keeps on bragging about his son every day can’t suddenly be left alone on his fiftieth birthday.”</p><br/><p>Lin Fan replied, “Mmm, I got it. I’ll organize it.”</p><br/><p>“Oh, right. Have you found a girlfriend yet? Hurry up and bring her back for us to see. Even if you’re doing well, if you can’t find a girlfriend, it would be useless.”</p><br/><p>Lin Fan had no words. “Mom, I’m hanging up. I’ll come back tomorrow.”</p><br/><p>Without waiting for his mother to say more, he immediately hung up.</p><br/><p>Fraud Tian glanced at Lin Fan. “What is it? Are you leaving Shanghai again?”</p><br/><p>Lin Fan replied, “Mmm. My dad is turning fifty. I have to go back to make preparations for it. I nearly forgot and my mom had to remind me. I really didn’t do my part as a son.”</p><br/><p>Fraud Tian nodded. “You really didn’t do your part as a son. To forget such a big event. It’s fine. Leave the shop to me. I guarantee that it’ll be lively.”</p><br/><p>Lin Fan thought for a moment. “Alright, this shop will be left to you guys. I’m going out to buy something for my dad. I have to go and choose a birthday present.”</p><br/><p>Wu You Lan started to get restless. “Brother Lin, do you need me to accompany you?”</p><br/><p>Lin Fan waved his hand. “No need. I’ll just go myself.”</p><br/><p>Not being able to follow Brother Lin to buy the present, she felt a little depressed.</p><br/><p>Lin Fan started his car and drove off.</p><br/><p>In his heart, he was thinking about what he should buy.</p><br/><p>He reached the shopping mall and glanced around. He hadn’t thought of what to buy yet.</p><br/><p>But when he passed by a gold shop, he stopped in his tracks. In his mind, he recalled something from when he had been over ten years old. His dad had said something at home.</p><br/><p>‘In the future, if my son can give me a gold bracelet when I turn fifty, that would be great.’</p><br/><p>Later on, Lin Fan had gone to a mediocre university. After graduating, he hadn’t been able to find a good job either. That gold bracelet had never been mentioned by his father again.</p><br/><p>Perhaps his father didn’t want to give him too much pressure.</p><br/><p>Now, he was doing pretty well in Shanghai and so many things had happened. But his dad had kept the same old mindset and perhaps he still didn’t want to bring it up.</p><br/><p>Lin Fan entered the shop.</p><br/><p>In front of the counter, the staff member was all smiles. “Sir, may I ask what you need?”</p><br/><p>Lin Fan said, “Show me the gold bracelets for men.”</p><br/><p>The staff member asked, “Is this for yourself or for someone a little older?”</p><br/><p>Lin Fan replied, “For someone older.”</p><br/><p>The staff member said warmly, “Please come and take a look over here. These are all our latest models. They’re very suitable for older men.”</p><br/><p>Lin Fan took a close look. He had to pick a good-looking one. Then, he pointed at one of them. “Let me take a look at this one.”</p><br/><p>The staff member smiled as he took out that bracelet. “Sir, this is our shop’s newest model. It’s usually gifted to the older generation by the younger generation. It portrays a message of family harmony and prosperity.”</p><br/><p>Lin Fan took a look at it and was quite pleased. “I’ll take this one then. Help me to wrap it up.”</p><br/><p>“Alright.”</p><br/><p>This bracelet cost $25,000. It wasn’t too expensive.</p><br/><p>After Lin Fan left the shop, the staff member looked at the colleague next to him. “Do you feel as if that man that just came looked a bit like that Master Lin? Do you think they look alike?”</p><br/><p>“How can that be? Think about Master Lin’s status and identity. How could he buy a $25,000 bracelet? If he buys a bracelet, he would buy a more expensive one. But really, they do look a little alike. He just looks a little uglier than how Master Lin looks in his Weibo profile picture.”</p><br/><p>If Lin Fan knew what these people said, he would surely yell out.</p><br/><p><em>Don’t you know that there’s something called Meitu Xiu Xiu*?</em></p><br/><p>(*Note: Meitu Xiu Xiu is a photo editing application that is popular in China.)</p></div>\n</div>"}