{"title": "Chapter 1039 - What Is The Meaning Of This?", "id": 1039, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1039-what-is-the-meaning-of-this", "volume_title": "Volume 11", "body": "<h1>Chapter 1039 - What Is The Meaning Of This?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the lift.</p><br/><p>Everyone was deep in discussion, however, Lin Fan’s dad remained silent. These were his classmates that he had not seen in a very long time, thus, he did not feel like talking about his son that much. It was completely in contrast to his normal self that liked to show off.</p><br/><p>Given the circumstances, he held his friendships with his classmates in high regard. After all, they had come from all sorts of distant places to Zhongzhou, thus it would have been really inappropriate for him to just boast in front of them.</p><br/><p>After the lift reached their floor.</p><br/><p>Huang Yun Ge stepped out of the lift, then looked around and said, “Wow, not bad.” Then, he came in front of his father and said, “Dad, your classmate really poured out his hard earning savings into this. Having a banquet for his birthday and even choosing such a high-end location. However, it is nothing compared to the places I’ve been to.”</p><br/><p>Huang Ting shot him a glare and did not say anything before he walked into the banquet hall.</p><br/><p>The banquet hall had filled up with people a long time ago. However, Lin Fan’s father had saved his classmates a table near the front, truly showing how much he valued them.</p><br/><p>Two tables were just enough for them.</p><br/><p>Huang Ting said, “Elder Lin, what’s up?”</p><br/><p>Lin Fan’s father replied, “Nothing much. I was just wondering where my son wandered off to. He was just here a moment ago.”</p><br/><p>Huang Ting laughed and replied, “I have never seen your son before. How is he? Has he found a wife yet?”</p><br/><p>“Nope. Only when he finds one will I finally be able to relax. But for now, he is still single,” Elder Lin helplessly said, “After all, if he were to get married quickly, he’ll have kids faster. In that case, his mum and I will still be able to take care of his kids. If he delays further, by the time we are old, we won’t have the energy to take care of them anymore.”</p><br/><p>“Uncle, I know a lot of girls. I know way too many of those super rich girls. How about we find a day and I’ll introduce them to him?” Huang Yun Ge laughed and said.</p><br/><p>Lin Fan mother, who was nearby, was super excited when she heard that and she said, “You know a lot of girls? What are their characters like? She has to be very patient as well as very sensible.”</p><br/><p>Huang Yun Ge heard that and rolled his eyes. He really wanted to say to her that it was not for her son to choose. Furthermore, it was not even guaranteed that the girl would like him.</p><br/><p>“Auntie, we can discuss this next time,” Huang Yun Ge said as he waved her off. It was very evident that he did not want to talk to her anymore. After all, he did not feel like he would be able to fulfill her requests.</p><br/><p>With regards to the rich girls that he knew, some of them had good tempers and some had bad tempers. As for being sensible or whatever, they could just forget about it.</p><br/><p>At that moment, Huang Ting did not say anything. However, when he heard that Elder Lin’s son did not have a girlfriend, he became a little suspicious. Then, he turned to the person beside him and asked.</p><br/><p>“What does Elder Lin’s son do in Shanghai?”</p><br/><p>“I have no idea. I think he opened a small shop in Shanghai. He probably isn’t earning that much.”</p><br/><p>“Elder Ting, what’s your company doing right now?”</p><br/><p>“Are you lacking people in any department? Is there any opening for me?”</p><br/><p>Essentially, this group of classmates all had their complete attention on Huang Ting. Today, their main goal of coming to the party was to chat and reminisce about the past with Huang Ting and hopefully get closer to him.</p><br/><p>When Elder Lin came over, the whole place was filled with discussion, however, none them said anything to him at all.</p><br/><p>Lin Fan had finished talking on the phone when suddenly, he realized that everyone had left. He felt a little lost and didn’t know what to do so he just decided to head upstairs.</p><br/><p>When he reached the dining table, he said, “Dad, can we start already?”</p><br/><p>His father replied, “Yes, we can begin now. Come, let me introduce you to a few of my close friends. This is Uncle Huang.”</p><br/><p>Lin Fan locked eyes with Huang Ting. Then, he walked across and said, “Hello, Uncle Huang.”</p><br/><p>When the rest of the classmates saw that Elder Lin’s son knew how to be respectful and had personally walked over to Elder Ting, they all nodded. They all were thinking that this son of Elder Lin was not shy at all and knew who the big fish here was. His attitude was also pretty good.</p><br/><p>Huang Yun Ge laughed. He felt like this young man was really smart, knowing that the key figure at this table was his father. However, he felt like this young man was a little familiar but he could not remember where he had seen him before.</p><br/><p>“You’re not bad, young man. Hey, I have a pretty good relationship with your father so if you have any problems in the future, you can just get your dad to get in touch with me,” Huang Ting said as he nodded with satisfaction. He could tell that this young man had a very good spirit and was very polite as well.</p><br/><p>Lin Fan smiled and replied, “Thank you for your concern, Uncle Ting. You are my father’s former classmate and his friend. Naturally, as part of the younger generation, I have to show you respect.”</p><br/><p>The surrounding people were all filled with envy. If they knew something like this would happen, they would have brought their sons as well. They had never thought that Elder Lin’s son would actually be able to get into Huang Ting’s good books.</p><br/><p>If he wanted to change jobs in the future, it definitely would not be a problem at all.</p><br/><p>Lin Fan’s father spoke again, “And this is Uncle Huang’s son.”</p><br/><p>Lin Fan looked at the young man next to him, nodded, extended his hand and said, “Hello, welcome.”</p><br/><p>Huang Yun Ge remained seated and extended his hand as well before saying, “I heard that you live in Shanghai. If you need help finding a girlfriend, you can come and find me. I know a lot of girls so I can introduce some of them to you. If you can nail any one of them, you’ll be set for life.”</p><br/><p>Lin Fan laughed and said, “Next time, next time.” Then, he took one look at everyone around the table before saying, “Dad, I’m going to go ask the waiters to start serving the dishes, you guys can continue with your conversations.”</p><br/><p>After Lin Fan left.</p><br/><p>Huang Ting smiled and said, “Elder Lin, your son is really not bad. He is really so much more sensible than my son. Young people should have that kind of manners.”</p><br/><p>Lin Fan’s father waved his hand and said, “That’s not true. I think Little Huang is not bad as well. If my son had half the charisma of Little Huang, he would definitely easily find a girlfriend.”</p><br/><p>Huang Yun Ge laughed and said, “Uncle, relax. After this, I’ll send him a text message. Next time, I’ll teach him how to talk to girls. I guarantee you that he will be able to find a girlfriend.</p><br/><p>“Okay, okay,” Lin Fan’s father smiled and said.</p><br/><p>After doing his business, Lin Fan sat down next to his father as the banquet formally began.</p><br/><p>Suddenly.</p><br/><p>There was a huge ruckus from outside. It was as if there was a helicopter flying overhead.</p><br/><p>“What happened? What’s with all that noise?”</p><br/><p>“Look! There are so many helicopters outside.”</p><br/><p>At that moment, some people rushed to the window and looked at what was going on outside. When they saw what was happening, they were all dumbfounded. They gave it a quick count and realized that there were tens of helicopters all hovering in the airspace nearby.</p><br/><p>The guests all looked outside, not knowing what was going on.</p><br/><p>Then, from the helicopters, a banner was starting to be deployed. When everyone saw what was written on the banner, they immediately turned around and looked at Elder Lin.</p><br/><p>“Elder Lin, you must be kidding, right? Having helicopters come for your 50th birthday.”</p><br/><p>“Huh?” Elder Lin was stunned. It was as if he did not realize what was going on.</p><br/><p>Lin Fan heard what they said and immediately went to take a look at the helicopters. After that, he immediately slapped his forehead. He did not even have to think about it for too long before he knew which b*stard was responsible for this.</p><br/><p>“Weird. What is the meaning of this?” Huang Yun Ge said in astonishment.</p><br/><p>Even all his classmates were in shock. It was as if they could not process what was going on.</p><br/><p>*Bam!*</p><br/><p>The banquet hall’s doors were suddenly opened.</p><br/><p>Everyone’s eyes shifted to the doorway and saw that there was no one there.</p><br/><p>Suddenly, a figure appeared.</p><br/><p>However, it was not just one person. It was a whole group of people.</p><br/><p>Every single one of them was nicely dressed in a suit and they were each holding a present as they walked.</p><br/><p>Lin Fan took a look at these b*stards and really did not want to say anything.</p><br/><p><em>Motherf*cker. Why did you come?</em></p><br/><p>Wang Ming Yang led them into the hall. After that, he stretched out his hand and pointed at Lin Fan. The people behind him all followed his direction and one by one walked towards him and stood in a line.</p><br/><p>The people in the banquet hall were all dumbfounded. They did not know what this was about and had no idea what was going on.</p><br/><p>Wang Ming Yang opened his mouth and said, “Uncle, he is really not very thoughtful. Your 50th birthday and yet he did not even inform me at all. If not for me finding out about it on Weibo, I would’ve been left in the dark about this.”</p><br/><p>Lin Fan looked at this whole group of b*stards and he was completely lost as he said, “What are you guys doing…”</p><br/><p>“What are we doing? Can’t you see for yourself?” Wang Ming Yang said. Then, he looked at everyone and said, “Come, guys, say your lines.”</p><br/><p>Then, the group of them all said in unison, “We wish you, Elder Lin, a happy 50th birthday. May you live to an old age and have many more birthdays to come.”</p><br/><p>Lin Fan’s father was still in complete shock about everything that was unfolding in front of his eyes. It was as if he still did not understand what was going on.</p><br/><p>Wang Ming Yang immediately stepped forward and came in front of Lin Fan’s father and said, “Uncle, this gift is from me, a pure gold God of Longevity sculpture. It took me a lot of effort to buy this. It was one of the prized possessions of the shop so he told me that it was not for sale. However, the moment I saw it, I knew that I had to buy it and give it to you for your birthday. So after some convincing, I managed to buy it from the shop.”</p><br/><p>“Uncle, do you like it?”</p><br/><p>Lin Fan’s father was still in shock and had yet to recover.</p><br/><p>As for the surrounding people, they were all the same, all clueless as to what was going on.</p></div>\n</div>"}