{"title": "Chapter 1030 - Nothing wrong with that at all", "id": 1030, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1030-nothing-wrong-with-that-at-all", "volume_title": "Volume 11", "body": "<h1>Chapter 1030 - Nothing wrong with that at all</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Those pharmacists, who had been talking about how much they had earned a moment ago, now wanted to cry.</p><br/><p>Their opportunity to become rich had been taken away from them. It had been such a good opportunity but the influenza got conquered all of a sudden.</p><br/><p>If the influenza had been allowed to continue longer, they would have earned so much money</p><br/><p>Now, after just a few days, the influenza hadn’t even reached its peak. Hence, many pharmacies had been hoarding the medications, getting ready to sell them at a high price when the influenza completely erupted.</p><br/><p>Even selling the medications for ten times the original price wouldn’t be a problem if that happened.</p><br/><p>Because there were simply too many people buying it . If they decreased the supply, the market would naturally increase the price</p><br/><p>But now, everything had been ruined.</p><br/><p>“Sigh, I’m going to kill myself. I hoarded over two hundred thousand dollars worth of medications. Who’s going to buy them now?”</p><br/><p>“Two hundred thousand? I bought over three hundred thousand! Who am I going to cry to?”</p><br/><p>“I even have a slight urge to kill this Lin now. He ruined our market.”</p><br/><p>“That’s right. If it wasn’t for him, we would’ve definitely earned a fortune from this influenza. Look, it’s been so many days and the influenza hadn’t been conquered before he came. It was obviously a troublesome illness.”</p><br/><p>“I’m done. This pharmacy business isn’t suitable for me. I’ve been screwed too much.”</p><br/><p>Meanwhile, at the bottom of Lin Fan’s Weibo page, the number of haters increased as well. The things they said were strange and random but they just wanted to flame him. But to Lin Fan and his huge fan group, they were just a joke. Whenever he made a move, it was earth-shattering.</p><br/><p>Huang Yun Town.</p><br/><p>Lin Fan wasn’t going to stay here any longer. He was prepared to rush back to Shanghai. But before he left, he had to do something.</p><br/><p>“Mayor Niu, this is for you,” said Lin Fan as he took out a wooden carving.</p><br/><p>Mayor Niu looked at the wooden carving suspiciously. “Master Lin, this is…?</p><br/><p>“Just a little something for you. Carry it with you or put it at home and it will bring you good luck. You want the town to be rid of poverty, don’t you? This might just be able to help you,” said Lin Fan with a grin.</p><br/><p>He could tell that this Mayor Niu was a very kindhearted person but he was quite miserable. He had been a mayor for so long and, although he worked very hard, he couldn’t help the town progress. Moreover, the town even seemed to get poorer and poorer.</p><br/><p>Sometimes, things like Feng Shui do make a bit of sense.</p><br/><p>But with Lin Fan’s wooden carving, all these wouldn’t be problems anymore.</p><br/><p>Mayor Niu held the wooden carving in his hand and replied, “Alright. Thank you, Master Lin.”</p><br/><p>Lin Fan went into the car smiling. “Alright, I’ll be leaving now. When the city medical workers come and brew the medicine according to the prescription, the people will definitely be fine.”</p><br/><p>“Master Lin, aren’t you going to stay a while?” shouted Li Chong.</p><br/><p>“Nah. I’m leaving. I have nothing more to do here so I shan’t disturb you all from your work.” Lin Fan waved and then left along with Zhao Ming Qing.</p><br/><p>If he stayed, he would only be drawing attention and not being of much use at all. It was better to hurry back to Shanghai.</p><br/><p>In the car.</p><br/><p>Zhao Ming Qing looked at Lin Fan with a look of helplessness. “Teacher, this time, I didn’t learn anything at all.”</p><br/><p>Lin Fan was a little embarrassed. That seemed to really be the case. He had solved the problem too quickly without giving his student a chance at all.</p><br/><p>It was mainly because he had been afraid that Zhao Ming Qing would get infected. Also, he didn’t want to waste any time in that situation. But as the teacher, how could he let his student feel as if nothing had been learned?</p><br/><p>He coughed gently a few times.</p><br/><p>“Ming Qing, who says that you didn’t learn anything? You did learn something. Think about it, what did you learn?” said Lin Fan, as if trying to guide him.</p><br/><p>Zhao Ming Qing was stunned. He really didn’t feel as if he had learned anything. Then, he looked at Lin Fan. “Teacher, could you say it more directly? I really don’t understand.”</p><br/><p>“Forget about it then. Go back and think about it properly. I won’t say too much. Concentrate on driving and don’t be distracted,” said Lin Fan with a wave of his hand. <em>Since he doesn’t understand it, let him slowly think.</em></p><br/><p>But even Lin Fan didn’t know what Zhao Ming Qing had learned.</p><br/><p>Cloud Street!</p><br/><p>Fraud Tian and the rest had been following the news the whole time. When they saw that the influenza had been conquered, besides Wu You Lan who was very excited, the rest of them looked completely indifferent.</p><br/><p>It was as if they had been shocked too much that they were already used to it.</p><br/><p>“Mmm, this kid is amazing. He accomplished another thing.”</p><br/><p>“Brother Lin is just that amazing. Fraud, do you want to follow me to dinner tonight? Let me tell you. There will be girls.”</p><br/><p>“Get lost. Don’t try to trick me. If I follow you, you’ll make me pay.”</p><br/><p>Zhao Zhong Yang sighed. “Forget it then. Don’t say that I didn’t invite you. This time, the girl is really not bad. And she’s thinking of finding an older guy too.”</p><br/><p>Fraud Tian was sitting there and smoking his cigarette as his heart started to shift. Then, he looked at Zhao Zhong Yang. “Is it true? You’re not lying to me?*</p><br/><p>“Sigh, we’re friends aren’t we? If you don’t trust me, who can you trust?”</p><br/><p>“Alright then. I’ll trust you one more time.” Fraud Tian thought about it and felt that he wasn’t young anymore. He had to find a partner. Nowadays, young girls all liked older men. Perhaps he would really be suitable for her.</p><br/><p>The next day!</p><br/><p>On the Internet, the news was announced. A full-scale report was made about the incident that had happened in Huang Yun Town.</p><br/><p>Nowt that the influenza had been cured, the people from the various departments had no more worries.</p><br/><p>But these people were really grateful towards Master Lin. To them, this Master Lin was really amazing to be able to solve the issue so quickly.</p><br/><p>Initially, when they had seen someone exposing the incident on the Internet, they had lost their minds. After all, they had been controlling the news regarding this incident. If it had been widely spread, it would’ve caused panic.</p><br/><p>Hence, they had suppressed the news all along to prevent unnecessary panic.</p><br/><p>Now that things were fine and the matter was resolved, they could openly speak about this subject.</p><br/><p>On the Internet, reporters released an image.</p><br/><p>This image was the back view captured by Li Chong. Master Lin was carrying the medicine box on his back with both hands in his pockets as he walked towards the panic-stricken Huang Yun Town.</p><br/><p>When this photo was released, countless people reposted it.</p><br/><p>“This back view of Master Lin is too d*mn dashing.”</p><br/><p>“I get a feeling when I look at this back view. It’s as if this matter, to Master Lin, is something that can easily be resolved.”</p><br/><p>“Haha, you really make a lot of sense. When I take a close look, I feel that too.”</p><br/><p>“Can you be more serious? What I see is a kind of undertaking as well as bravery. No one dared to go to the scene but Master Lin went in without a second thought.”</p><br/><p>“You shouldn’t think too much. Actually, they’re right. Master Lin was probably thinking at that time that the influenza is just a joke. Look at how Master Lin is dressed. He’s not even wearing any protective attire. In Master Lin’s eyes, this isn’t even a problem at all.”</p><br/><p>Some netizens were completely convinced when they saw this comment.</p><br/><p>They felt that there was nothing wrong with it at all.</p></div>\n</div>"}