{"title": "Chapter 1057 - This is really going to blow up", "id": 1057, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1057-this-is-really-going-to-blow-up", "volume_title": "Volume 11", "body": "<h1>Chapter 1057 - This is really going to blow up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Seeing injustice, Lin Fan yelled out. However, this ‘Stop’ had no effect.</p><br/><p>After all, those people felt that he was just a normal person meddling with something he wasn’t related to. They completely ignored him.</p><br/><p>Lin Fan was getting upset. “Stop.”</p><br/><p>At that moment, his voice was raised and it shook the two security guards.</p><br/><p>“You two big guys treat an old man like that. If your children see this, how ashamed would they feel?” said Lin Fan.</p><br/><p>“Hey, it’s Master Lin.” Among the spectators, one of them had recognized Lin Fan. After all, there weren’t many people in Shanghai who didn’t know who Master Lin was.</p><br/><p>This ‘handsome’ face, in particular, refreshed the memories of many of them.</p><br/><p>“Master Lin, I always buy scallion pancakes from your place.”</p><br/><p>One of the townsfolk took out his phone. With a ‘kacha’ sound, he snapped a photo as he spoke excitedly.</p><br/><p>Lin Fan nodded. He hadn’t expected that he would even run into fans of his scallion pancakes here. It felt pretty good.</p><br/><p>When the two security guards had heard Lin Fan’s words, they had been stunned. Afterward, when they heard that this was Master Lin, they immediately let the old man go. They knew who Master Lin was. He was a famous man.</p><br/><p>Now that this famous man had spoken, how could they dare to act unbridled?</p><br/><p>Lin Fan stepped forward and supported the old man. “What’s your situation?”</p><br/><p>The old man passed the photocopied sheet to Lin Fan. “Youngster, take a look. This was given to me by them. They said it’s a contract I agreed to, to loan my money to some kind of start-up. But I have never signed such a thing. Moreover, this name on the sheet wasn’t even signed by me.”</p><br/><p>Lin Fan looked at the piece of paper in his hand very closely. The date that the money would be returned was really ridiculous. It was thirty years later.</p><br/><p>Then, he looked over at that woman. “What’s going on?”</p><br/><p>That middle-aged woman was an employee here. When she heard Lin Fan’s words, she knew that this was Master Lin so she didn’t want to make a big deal out of it. After all, Master Lin was not someone to be angered.</p><br/><p>“This was signed by himself,” replied the woman simply.</p><br/><p>The old man immediately retorted, “How could it have been signed by me? I didn’t even sign it. Back then, I just deposited my money here. I didn’t do anything else.”</p><br/><p>“Give me back my money.”</p><br/><p>Lin Fan appeased the old man, “Be patient. I’ll help you to clarify things.” Then, he looked at the woman. “I hope you can help to check it out. See what exactly is going on.”</p><br/><p>The middle-aged woman shook her head. “We’ve already checked. The document in his hands is what we found. This has nothing to do with us. We still have things to do. If you have any problems, look for the related personnel.”</p><br/><p>After saying that, she left in a hurry. She didn’t want to stay here any longer.</p><br/><p>“You…” Lin Fan had just opened his mouth when the middle-aged lady left along with the two security guards without turning back.</p><br/><p>The surrounding townsfolk gathered around.</p><br/><p>“Master Lin, this situation is hard to resolve.”</p><br/><p>“Yeah. They’re really firm about this. Even if you look for the related person in charge, you wouldn’t be able to find him.”</p><br/><p>“I feel that the old man will just have to count himself as unlucky.”</p><br/><p>The townsfolk started a commotion.</p><br/><p>Lin Fan felt that since he had come across this, he had to help the old man resolve it. After all, this money had not been gotten so easily. He couldn’t just let them do whatever they wanted.</p><br/><p>“I’ll go in to take a look,” said Lin Fan.</p><br/><p>The old man followed closely behind as he wanted to have a word as well. He had already been here for a long time. Since a month ago, he had started coming over to question them.</p><br/><p>In the beginning, the people here would still receive him and treat him nicely but later on, they had stopped welcoming him. Even if he spoke to them, they would act as if they didn’t hear it.</p><br/><p>Inside, the middle-aged woman was talking to someone. When she saw that Master Lin had come in with that old man, she purposely avoided them and went to another place.</p><br/><p>Lin Fan brought the old man to the reception counter. Then, he took out the document.</p><br/><p>“May I ask what’s going on? He clearly didn’t sign all this. Why did something like this happen?”</p><br/><p>That employee seemed to already know the situation. He shook his head. “Sorry, I don’t know what’s going on either. Why don’t you ask at the service booth?”</p><br/><p>Lin Fan took a deep breath before taking the old man to the booth. At the booth, that person saw Lin Fan and the old man walking here and immediately left his original seat. At the same time, his ‘Temporarily Occupied’ sign lighted up.</p><br/><p>Those who were handling their work all waved their hand also as they acted as if they didn’t know anything.</p><br/><p>After walking a whole round, everybody ignored them.</p><br/><p>The old man saw this situation and was anxious. He sat down on the ground furiously. “What am I going to do? This is the money I’ve painstakingly saved over decades!”</p><br/><p>Some of the people who were handling their own businesses saw this situation and shook their heads. They had seen many such cases before. However, they had never seen anyone that could do anything to the bank.</p><br/><p>But they would rather put their money with the bank than keep it themselves. After all, they felt that such cases were rare and it definitely wouldn’t happen to them.</p><br/><p>At that moment, a townsman walked over.</p><br/><p>“Master Lin, you shouldn’t care about this. It can’t be helped.”</p><br/><p>Lin Fan smiled. “It’s fine. I don’t believe that.”</p><br/><p>Outside!</p><br/><p>That middle-aged woman was making a call. “Director, that old man is here again.”</p><br/><p>“Ignore him. It’s all written in black and white. He can’t just do whatever he wants,” said the Director impatiently.</p><br/><p>“But we can’t just let him cause a ruckus here every day. And Master Lin is here too. He seems to be helping that old man,” said the middle-aged woman.</p><br/><p>“Master Lin?” The Director had not expected that Master Lin would get involved in this. Then, he thought about it. “Alright, just ignore it for now. Even if it’s Master Lin, he can’t do anything about it.”</p><br/><p>“Mmm, I got it,” replied the middle-aged woman.</p><br/><p>She looked inside. They were still there. She wasn’t about to go in again, so she just hid outside. She had really been troubled by this. How could she not know what was going on inside? It was all just procedures.</p><br/><p>Lin Fan looked around and felt that, sometimes, one man’s power was really limited.</p><br/><p>Then, he took out his phone and made a call.</p><br/><p>“Hello, I’m Master Lin. I want to report an incident. At Rong Mao. Yes, I’ll wait for you.”</p><br/><p>After hanging up, he made another call.</p><br/><p>“‘Today News Agency’, I’m Master Lin. I want to report an incident. I’m at Rong Mao now.”</p><br/><p>One after another, he made tens of calls before he finally stopped.</p><br/><p>The old man looked at Master Lin. “Who did you call?”</p><br/><p>Lin Fan grinned. “Reporters.”</p><br/><p>“It’s useless. Reporters are useless. I’ve already tried all these methods,” said the old man as he shook his head.</p><br/><p>Lin Fan replied, “It won’t hurt to try, right?”</p><br/><p>The surrounding townsfolk were all stunned.</p><br/><p>They had counted that Master Lin had made a total of thirty-two calls. Didn’t that mean that he had called thirty-two news agencies? This was really going to blow up.</p>\n</div>"}