{"title": "Chapter 1053 - A target has appeared", "id": 1053, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1053-a-target-has-appeared", "volume_title": "Volume 11", "body": "<h1>Chapter 1053 - A target has appeared</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lin Fan chuckled after hanging up. He hadn’t expected this call from Autumn Sword Fish Killer. It seemed that thing hadn’t been going that guy’s way.</p><br/><p>If things had been going his way, Lin Fan could guarantee that that guy would definitely not come back to him.</p><br/><p>Zhao Zhong Yang raised his head. “Brother Lin, who was that from?”</p><br/><p>Lin Fan replied, “It was my Chief of Internet trolls. He got screwed for hacking in computer games, so he wants to start being an Internet troll again.”</p><br/><p>“Haha,” Zhao Zhong Yang burst into laughter. “I know about this. Recently, it was quite a big deal. There was a huge commotion about it. I didn’t think that he actually got involved too.”</p><br/><p>At that moment, Lin Fan looked over at Wu You Lan. He felt that You Lan’s expression wasn’t quite pleasant. She looked like she was feeling sorry about something.</p><br/><p>“You Lan, what’s wrong?”</p><br/><p>Wu You Lan placed her phone in front of Lin Fan. “Brother Lin, look at this piece of news. This guy is really pitiful. He’s already fifty but he isn’t married. He has been selling fruits all along to support some less-fortunate students. Now, they’ve discovered that he has a disease and this story has been published on the Internet, asking everyone to donate money to help him. I just donated a thousand dollars.”</p><br/><p>Lin Fan looked at that news article and read the content closely. Then, he stared at the image for a while and suddenly stood up.</p><br/><p>“Brother Lin, where are you going?” asked Wu You Lan.</p><br/><p>Lin Fan replied, “I’m going to make a trip to the hospital. There’s something I have to do.”</p><br/><p>Although he hadn’t said it clearly, Wu You Lan suddenly realized what he meant.</p><br/><p>“Oh, that’s right. If Brother Lin makes a move, he’ll definitely be able to treat this disease.”</p><br/><p>Lin Fan chuckled. Treating the disease was a part of it. The other reason he was going there was that this man fulfilled the conditions for the task. As of now, the task hadn’t been completed yet. The chance of finding someone on the streets who fulfilled the conditions was too low.</p><br/><p>Moreover, he suddenly realized that Wu You Lan was simply like his lucky star. A lot of times, she would see the news and tell him about such incidents.</p><br/><p>“Wait here in the shop. I’ll go out for a bit before coming back. It’s even just in Shanghai. That’s convenient,” said Lin Fan with a grin. Then, he drove off.</p><br/><p>The hospital!</p><br/><p>On the sickbed, Liu Shan was lying down. Through the window, he looked at the scenery outside.</p><br/><p>A nurse walked in. She knew about this patient. His case had even drawn a report from the reporters the previous day. She had heard that he was a good person who had always been single. Besides leaving a bit of money for his day-to-day expenses, he basically donated all of his money to ‘Project Hope’. Moreover, he had even taken on the responsibility of paying for two university students’ school fees.</p><br/><p>The nurse really didn’t know what to say about such a person. There were a number of people like him in society. He already knew that his financial background wasn’t great. If he kept his money, perhaps he would have been able to have a more comfortable life. Instead, he donated what little money he had to help those university students. She really couldn’t understand that.</p><br/><p>“How are you? Is there anywhere that feels uncomfortable?” The nurse was over forty as well. She was one of the older nurses in the hospital.</p><br/><p>“There’s nowhere uncomfortable. Nurse, when can I be discharged?” asked Liu Shan.</p><br/><p>The nurse smiled. “Just wait. The operation hasn’t even been done yet. I think it’ll be at least a month.”</p><br/><p>“The operation fee must be very high. Since I have nothing wrong at the moment, I think I should be discharged first.” Liu Shan thought about it for a moment. Besides the previous pain which had made him faint on the street, he really didn’t feel any major discomfort.</p><br/><p>The nurse hadn’t expected him to still be thinking about the medical fees. “Don’t worry about all this. The reporters already came and they started a donation campaign for you. Our hospital will waive the taxes too. Don’t worry. We won’t make you pay a single cent.”</p><br/><p>“Oh right. I’m a little curious. You weren’t doing very well previously, why didn’t you leave more money for yourself? You still donated to the students,” the nurse asked. “There are so many wealthy people in society nowadays. You shouldn’t be the one who has to donate.”</p><br/><p>Liu Shan chuckled. “That’s not right of you to say. I don’t care what others do. I understand the disadvantages of not being able to study. Look at me. I didn’t get to study and I can only rely on selling fruits to make a living. Those students have poor family backgrounds. If they don’t study, they’ll end up like me.”</p><br/><p>The nurse looked at Liu Shan and said, “I heard from the reporters that the students you are supporting are studying in Shanghai. Now that you’re sick, why don’t they come and visit you?”</p><br/><p>Liu Shan seemed not to mind it. “What’s the point of visiting? Academics are the most important. It’s not like it’s some kind of big disease.”</p><br/><p>The nurse wanted to say that the two students he was supporting were ingrates. However, she didn’t say it. She felt that it would hurt his feelings if she said it.</p><br/><p>*Knock knock!*</p><br/><p>At that moment, a knocking sound could be heard from the door. A young man walked in. this young man looked young and immature. With one look, one could tell that he was a student. “Papa Liu, I’m here to see you.”</p><br/><p>Liu Shan saw him and immediately said, “Wang Hao, why are you here? Aren’t you supposed to be attending your class?”</p><br/><p>Wang Hao was dressed plainly. He was a kid from the mountain area. These few years, he had been able to attend a university thanks to this Papa Liu who had supported him.</p><br/><p>When he heard that Papa Liu had fallen ill, he had rushed here immediately.</p><br/><p>Liu Shan looked at the fruits in Wang Hao’s hands and his expression changed. “Why did you buy fruits? I’m a fruit seller. What a waste of money.”</p><br/><p>When the nurse saw that a kid had really come to see him, she smiled. “The kid bought something for you out of goodwill. How can you start berating him?”</p><br/><p>Wang Hao wasn’t angry at all. It was as if he was really accepting the teachings of a father.</p><br/><p>“Then should I go back and ask for a refund?” Wang Hao was at a loss and he didn’t know what to do.</p><br/><p>Looking at Wang Hao’s expression, Liu Shan couldn’t bring himself to be angry. “Alright, since you’ve already bought it, that’s that. Come here and sit. Don’t you have classes today?”</p><br/><p>Wang Hao shook his head. “I have no classes today. I saw the news on the Internet, so I came here.”</p><br/><p>Then, as if he suddenly thought of something, he hurriedly took out an envelope from his pocket. “Papa Liu, this is money donated by my classmates. They told me to bring it to you.”</p><br/><p>The nurse smiled. “That’s pretty good. It looks like there are many loving people around. Wang Hao, where’s the other kid that your Papa Liu supports?”</p><br/><p>When Wang Hao heard that, he instantly became a little angry and a little helpless at the same time. “I already informed him but he said that he has classes today and he can’t come.”</p><br/><p>“Sigh.” When the nurse heard this, she laughed bitterly in her heart. <em>It’s an ingrate after all.</em></p><br/><p>Liu Shan wasn’t bothered by it. “Mmm. If he has classes, he should attend them. Studying is more important. If he misses a class, it would probably delay his progress.”</p><br/><p>Wang Hao didn’t say much. He knew that it wasn’t a valid excuse at all. That person just didn’t want to come.</p><br/><p>*Knock knock*</p><br/><p>“Is Mister Liu Shan around?” At that moment, a voice came from outside the door as everyone was still chatting.</p><br/><p>The nurse said, “He’s here. Please come in.”</p><br/><p>Lin Fan was standing at the door. When he heard the reply, he pushed open the door and walked in with a smile.</p></div>\n</div>"}