{"title": "Chapter 1059 - Master Lin is a powerful individual", "id": 1059, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1059-master-lin-is-a-powerful-individual", "volume_title": "Volume 11", "body": "<h1>Chapter 1059 - Master Lin is a powerful individual</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Wang Xiu hadn’t expected Master Lin to say such things. “I don’t know about these. You have to ask the related personnel.”</p><br/><p>“Then who is the related personnel? Can you call him out?” asked Lin Fan.</p><br/><p>Wang Xiu felt that this Master Lin was hard to deal with. She shook her head. “I’m just in charge of the lobby. As for who the related personnel is, I don’t know either. You’ll have to wait for the related personnel to come.”</p><br/><p>“Then who is the related personnel? When will they come?” Lin Fan continued to question.</p><br/><p>Being questioned repeatedly like that, Wang Xiu felt that she was unable to face the reporters and Master Lin.</p><br/><p>“This…this…” Wang Xiu’s heart was trembling a little but her strong professional qualities allowed her to steady herself. “The related personnel have applied for a leave of absence. They’re temporarily not around.”</p><br/><p>Lin Fan said, “Then who will be responsible for this now? Please inform whoever can be responsible to come here. You guys push the responsibility around when met with a problem, saying that this person is not here or that person is not here. How can anyone trust you?”</p><br/><p>The reporters aimed their camera lenses at the scene. They had had colleagues come here to interview the bank before but the bank had always avoided answering their questions.</p><br/><p>But today, it was different. Master Lin had personally come to the scene and was aggressively tackling the issue. His meaning was clear. Without a proper explanation, this matter would not be over.</p><br/><p>The old man was just watching as the scene unfolded before him. This was something he would have never dared to imagine. He had gone through so much trouble in the past because of this problem, speaking countless words and causing a ruckus every time but it had all been useless.</p><br/><p>The bank simply didn’t care and they hadn’t even been bothered by him.</p><br/><p>They had even sent their security guards to chase him away.</p><br/><p>But now, with so many reporters here, even the security guards didn’t dare to come.</p><br/><p>Facing Master Lin’s unending questions, Wang Xiu swallowed her saliva and said, “The Director will be here in a moment. He’s already on the way.”</p><br/><p>Lin Fan smiled. “Look. When encountered with a problem, you even have to call a director who’s not around to come and take responsibility. You have such a big building here, is the director the only one who can take responsibility?”</p><br/><p>The reporters started laughing as they recorded this sentence from Master Lin. They had even thought of a headline for this piece of news.</p><br/><p>‘Master Lin’s merciless taunting.’</p><br/><p>Wang Xiu’s face turned greenish-pale. She felt as if she had no words to reply.</p><br/><p>If it wasn’t Master Lin, she might have had lots of things to say.</p><br/><p>But facing Master Lin, she suddenly didn’t know how to open her mouth. It was as if anything she said would be used against her.</p><br/><p>Fortunately, when the Director found out that a large wave of reporters had come, he had started to rush down.</p><br/><p>With the Director’s plentiful experience, he would definitely be able to settle this issue.</p><br/><p>Soon after.</p><br/><p>A balding middle-aged man hastily came in as if he was in a big rush. There was even perspiration on his forehead.</p><br/><p>Seeing all these reporters, he steadied his heart. Then, he looked at Master Lin, who was standing there, and immediately went forward. Courteously, he extended his hand. “Master Lin, hello, hello.”</p><br/><p>Lin Fan shook his hand very casually. “You’re the director here?”</p><br/><p>“Yes, I’m the Director. My surname is Jin,” said Director Jin with a smile. Then, he looked at Wang Xiu and immediately instructed, “Hurry up and get some chairs. And pour some water for us.”</p><br/><p>“Yes.” Wang Xiu nodded.</p><br/><p>“No need. We don’t need to sit, nor am I thirsty. I just came here to clarify the situation. What exactly is going on? You’re the director here, you should know, right?” asked Lin Fan.</p><br/><p>The reporters snapped some pictures yet again to record this moment. They had thought of another headline.</p><br/><p>‘Master Lin wages war against Director Jin.’</p><br/><p>Director Jin smiled embarrassedly. “Of course, of course. She’s just the lobby manager, so she doesn’t understand the inner department’s matters. That’s why she doesn’t know what exactly is going on.”</p><br/><p>Lin Fan took over the photocopied document from the old man’s hands. “Then, Director Jin, please take a look. What exactly is going on?”</p><br/><p>He didn’t need to say anymore. With one look at Director Jin, he could already see that he was corrupt. He was really corrupt.</p><br/><p>For this kind of person to be here instead of in jail, it could already be considered a miracle.</p><br/><p>Director Jin looked at the document in his hands as if he was studying it closely. Then, he said with a calm expression, “Master Lin, this document is very normal. It’s one of the projects we are doing. And this signature has been signed personally by this old man. There’s no issue at all.”</p><br/><p>Lin Fan smiled. “There’s no issue? Then why doesn’t he know about it? And what the hell is up with the thirty years?”</p><br/><p>Director Jin said, “This is a loan to a start-up company. The return is quite high but the duration is a little longer. But this has definitely been signed by the old man. He’s already old so he must have forgotten.”</p><br/><p>Lin Fan looked at the old man and said helplessly, “Old man, do you have children?”</p><br/><p>The old man shook his head. “No. My wife had an illness when she was young, so she couldn’t give birth. We’ve never had children. I want to withdraw my money now because I want to go to the nursing home with my wife.”</p><br/><p>“Director Jin, did you hear that? He doesn’t have any children and he’s already so old. Thirty years later, who will he give the money to? Or is the money supposed to just stay with you guys?” asked Lin Fan.</p><br/><p>When Director Jin heard that, he was embarrassed. He hadn’t expected this question. But when he was about to speak, Lin Fan interrupted.</p><br/><p>“Director Jin, actually, there’s no need to fuss over this. When signing this kind of contract, there’s always a video recording of the scene, isn’t there? Just show us the video and it’ll be settled. If there’s a video, I am willing to take responsibility for all the trouble I’ve caused you,” said Lin Fan.</p><br/><p>“Sigh, Master Lin, you haven’t caused us any trouble at all.” Director Jin tried to go along with Lin Fan’s words and avoid the main topic.</p><br/><p>But he couldn’t avoid it. Lin Fan immediately said, “Let’s just talk about the video. Do you have it?”</p><br/><p>Director Jin grumbled in his heart. This was a difficult situation to deal with. Then, he smiled. “The employee in charge of the videos isn’t around today. And there was a fire that happened in the video storage room a while ago, so some videos seemed to have been lost. I don’t know if the video is still there.”</p><br/><p>Lin Fan hadn’t expected this Director Jin to keep such a calm expression while saying these things. He had to give him some credit for that.</p><br/><p>“Then is the video still here or not?” questioned Lin Fan.</p><br/><p>Director Jin chuckled but didn’t reply immediately. He appeared to think for a moment before saying, “I have to go and check about that. Why don’t I give you an answer tomorrow?”</p><br/><p>The reporters were all recording the scene as they felt that there was a big problem.</p><br/><p>This Director Jin spoke so ambiguously as if he was avoiding something.</p><br/><p>“Director Jin, could it be that you took a bribe from the start-up company, so you’re giving them this loan? Or did you do it by yourself to earn some extra interest?” Lin Fan wasn’t afraid of offending anyone. He just said it directly.</p><br/><p>When Director Jin heard that, his expression changed dramatically. “That’s not possible. That’s completely not possible. We wouldn’t do such a thing.”</p><br/><p>Lin Fan opened his palm. “Then show us the video.”</p><br/><p>“I…” Director Jin was stunned.</p><br/><p>What could he possibly do now? He couldn’t even run away since the reporters were all around.</p><br/><p>He couldn’t take out the proof because it didn’t even exist.</p><br/><p>This matter wasn’t just involving him. There were others involved as well.</p><br/><p><em>No, I have to stay calm. At least drag this out until tomorrow and let the other leaders think of a solution. I’m out of ideas.</em></p><br/><p>If it had been an ordinary citizen or just a normal reporter, he wouldn’t have cared at all.</p><br/><p>He could have just said a few words over the phone to put them off.</p><br/><p>But it was different now. This Master Lin was a powerful individual.</p></div>\n</div>"}