{"title": "Chapter 1066 - Turns Out That I Had Such An Impact", "id": 1066, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1066-turns-out-that-i-had-such-an-impact", "volume_title": "Volume 11", "body": "<h1>Chapter 1066 - Turns Out That I Had Such An Impact</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lin Fan looked at Wu You Lan’s astonished face and smiled. “What is it?”</p><br/><p>Wu You Lan came back to her senses.” It’s nothing. It’s just that I never thought that even a reseller would give us tickets.”</p><br/><p>Lin Fan said, “They’ve earned a lot from reselling scallion pancakes at Cloud Street. Giving us some front row seat tickets can be considered a form of gratitude.”</p><br/><p>Wu You Lan covered her mouth as she giggled. “I think they want to get closer to you, Brother Lin.”</p><br/><p>“Alright, enough talk. Let’s go and join the queue,” said Lin Fan. There weren’t too many people queuing now. It was just the right time to join.</p><br/><p>“Hey, Master Lin.”</p><br/><p>At that moment, a voice came from behind.</p><br/><p>Lin Fan turned around and took a look but he was taken aback. “You are…?”</p><br/><p>Wu You Lan thought for a moment, then realized. “You’re the coach of Golden Flowers, Wu Ze.”</p><br/><p>Wu Ze smiled. “Yes, I’m the coach of Golden Flowers, Wu Ze. I didn’t think that someone would recognize me. Master Lin, are you two here to watch the game too?”</p><br/><p>Lin Fan nodded. “Yeah.”</p><br/><p>Lin Fan hadn’t thought that the coach of this team would recognize him. It seemed that his fame was pretty good.</p><br/><p>Wu Ze smiled and said, “Master Lin, why don’t you two come with me and go inside to watch? My players have been frequently talking about you lately. If they know that Master Lin is watching them play, they would definitely be pumped up.”</p><br/><p>“Do I really have such an impact?” Lin Fan laughed, not expecting to hear that.</p><br/><p>Wu Ze said, “Of course. You’re their idol. They always look at your Weibo page whenever they go on Weibo. They even say frequently that it would be great if Master Lin could watch them play. That’s why I didn’t quite dare to confirm that it was you when I saw you from afar. I rushed over here to see and it turns out that it really is you.”</p><br/><p>Wu You Lan said excitedly, “Brother Lin, let’s go inside to watch, okay? We’ll get a better view from inside.”</p><br/><p>Lin Fan started to chuckle. “Alright, then we’ll go inside. Coach Wu, it wouldn’t bring you any trouble, would it?”</p><br/><p>Wu Ze waved his hand. “No, not at all. Don’t worry.”</p><br/><p>“Alright then, please bring us,” said Lin Fan. Then, they followed the coach inside. This would be an interesting experience.</p><br/><p>Without saying more, the two of them followed Coach Wu in. They went through a special passage and the staff did not stop them. However, they seemed to recognize Lin Fan as their eyes kept following him.</p><br/><p>When they reached the changing room.</p><br/><p>Lin Fan and Wu You Lan waited outside while Coach Wu went in to take a look first. After all, Wu You Lan was a lady. If there were people who hadn’t dressed up yet, it would be embarrassing.</p><br/><p>“Master Lin, Lady Wu, come in,” said Wu Ze.</p><br/><p>When Lin Fan walked in, he could clearly feel that the players inside were very excited.</p><br/><p>“Wow, it really is Master Lin.”</p><br/><p>“Coach, Master Lin is really here to watch our match.”</p><br/><p>“Master Lin, I really worship you. I always look at your Weibo and every time I see something related to you, I always cheer you on.”</p><br/><p>At that moment, the players all surrounded Lin Fan. Although some of them were older than Lin Fan, they were full of admiration as they stood in front of their idol.</p><br/><p>Sometimes, they would become anxious when they saw the incidents that Master Lin faced. After all, those incidents were way too scary.</p><br/><p>But everytime Master Lin resolved those situations, they would be deeply shocked and filled with awe.</p><br/><p>Along the way, they completely turned into fans of Lin Fan.</p><br/><p>Lin Fan smiled and said, “It’s our first time meeting. Hello, everyone.”</p><br/><p>The players all smiled back. “Hello, Master Lin.”</p><br/><p>Lin Fan nodded. “This time, everyone must work hard. Do your best.”</p><br/><p>At that moment, all the players became pumped up. One of them yelled in a deep voice.</p><br/><p>“Come on! Master Lin is here, we have to win! Otherwise, it would be a shame!”</p><br/><p>“That’s right. We have to win this game.”</p><br/><p>Because of Lin Fan’s arrival, everyone’s fighting spirit was high.</p><br/><p>At that moment, the match was about to begin. The players had to enter the stadium.</p><br/><p>Wu Ze said, “Master Lin, let’s go.”</p><br/><p>Lin Fan nodded. “Alright.”</p><br/><p>The stadium was already packed with people. The tickets had already been sold out. Who knew how many people hadn’t managed to buy the tickets and were waiting outside?</p><br/><p>That was the reason the resellers were buying the tickets for a high price.</p><br/><p>This match wasn’t an average match. It was a match between Golden Flowers and Japan’s Yokohama F. Marinos.</p><br/><p>When Lin Fan and Wu You Lan came out, the place was filled with roaring cheers and it was a sea of red.</p><br/><p>Wu You Lan said, “The atmosphere is amazing watching from here.”</p><br/><p>Lin Fan nodded. “It is indeed.”</p><br/><p>As the coach, Wu Ze saw this match with great importance. And he realized that, since Master Lin’s appearance, the players were filled with energy and focus.</p><br/><p>Sitting on the coach’s seat, he quietly awaited the start of the competition.</p><br/><p>Reporters were there to capture and record the scene.</p><br/><p>Huang Jun was a broadcaster who specialized in broadcasting various competitions for the netizens.</p><br/><p>“My Internet friends, this time, we’re broadcasting Golden Flowers against Japan’s Yokohama F. Marinos. Right now, the players have already stepped on the field and match is about to begin.”</p><br/><p>“D*mn. Let’s beat the Japanese team!”</p><br/><p>“That’s right. Destroy them!”</p><br/><p>“Come on! Come on!”</p><br/><p>“If Golden Flowers wins this, I’ll send you a rocket, host.”</p><br/><p>Huang Jun looked at the screen and said, “This match can be considered a fierce battle between giants. Yokohama F. Marinos is very strong. Back in 2003, they won Golden Flowers 2-0. Now, after over a decade, I wonder how these two teams compare to each other. However, I believe that Golden Flowers will definitely be able to avenge themselves today and wash away their shame from the last defeat.”</p><br/><p>“Host, 6666…”</p><br/><p>“I almost wanted to kill the host just now. Luckily, the host said those things at the end.”</p><br/><p>“Brothers, if they don’t win this time, I’ll broadcast myself eating sh*t.”</p><br/><p>At that moment, Huang Jun’s gaze suddenly turned towards Golden Flowers’ coaches’ seats. Instantly, his brows furrowed as if he didn’t dare to confirm it.</p><br/><p>“Host, what the f*ck are you doing? Why isn’t the camera lens moving at all?”</p><br/><p>“Yeah! Host, what’s up with you? Don’t doze off!”</p><br/><p>“Hurry up and let us see the surroundings. Are you there?”</p><br/><p>Huang Jun seemed to have realized something. “Everyone, help me to take a look. That person sitting at the coaches’ seats, is that Master Lin? Why do I feel like it looks like him?”</p><br/><p>“What? Master Lin?”</p><br/><p>“Host, don’t talk nonsense. Aim your camera at him and let me use my eagle’s eye to take a look.”</p><br/><p>At that moment, Huang Jun aimed his camera at the coaches’ seats.</p><br/><p>“D*mn, how can we see from so far away?”</p><br/><p>“F*ck. Host, couldn’t you buy a ticket for a seat closer to the front? Right now, we can’t even see a single person clearly.”</p><br/><p>Huang Jun was dumbfounded. “You’re blaming me?”</p><br/><p>“If I don’t blame you, who would I blame?”</p><br/><p>“But looking at the rough silhouette, it does look like Master Lin. Still, I can’t confirm it.”</p><br/><p>“Enough looking. The match is starting.”</p><br/><p>At that moment, the match officially began.</p></div>\n</div>"}