{"title": "Chapter 1077 - A direct scolding", "id": 1077, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1077-a-direct-scolding", "volume_title": "Volume 11", "body": "<h1>Chapter 1077 - A direct scolding</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The next day!</p><br/><p>Various news articles appeared on the Internet. Even the headlines on Weibo had been bought.</p><br/><p>Feiyue Entertainment Company had prepared amply to pave a way for Wang Mei Tian.</p><br/><p>Some of the netizens saw the news on the Internet and were stunned. They didn’t quite understand what was up with this news.</p><br/><p>‘Wu Huan Yue isn’t releasing albums, Master Lin has run out of ideas. Let us wait in anticipation for Wang Mei Tian’s new album.’</p><br/><p>‘Songs composed by the collaborative efforts of ten top masters will soon be materialized.’</p><br/><p>‘Wang Mei Tian’s voice is on par with Wu Huan Yue’s.’</p><br/><p>‘The new generation’s musical star, Wang Mei Tian, will soon be releasing her new album.’</p><br/><p>“D*mn. What’s going on? Why did all these news articles suddenly appear overnight? Are they trying to step over Master Lin and Wu Huan Yue?”</p><br/><p>“Haha, our Mei Tian is really too strong.”</p><br/><p>“Master Lin? Wu Huan Yue? Just crush them completely.”</p><br/><p>“Wu Huan Yue hasn’t released an album in a long time. Could it be that Master Lin has really run out of ideas?”</p><br/><p>“That’s rubbish. How is that possible? Wu Huan Yue hasn’t been releasing albums because she has been shooting films. How would she have the time to make new albums?”</p><br/><p>“Bullsh*t. I think she doesn’t have any good songs. Think about how many good songs Master Lin has come up with in the past. I’m afraid that he has already used up all of his songs.”</p><br/><p>“But who is this Wang Mei Tian? Do any of you know her?”</p><br/><p>“Go and do a search on the Internet. She’s the champion of the latest season of ‘The New Voice’. She has quite a lot of fans.”</p><br/><p>Cloud Street!</p><br/><p>Just as Lin Fan had finished making his scallion pancakes and was sitting there to rest, he realized that Wu You Lan appeared angry as she looked at her phone. He asked curiously, “You Lan, what have you seen now? Why are you so angry?”</p><br/><p>He was really curious as he wondered what kind of news had made Wu You Lan this angry. It was really peculiar.</p><br/><p>“Brother Lin, look at this news. Aren’t they trying to step over Huan Yue and you in order to rise to fame?” Wu You Lan hurriedly brought her phone over and put it in front of Lin Fan.</p><br/><p>Lin Fan looked at the news and made an amused expression. He felt that it was really strange. He was even given a shock.</p><br/><p>It was as if he had been shot while lying on the ground.</p><br/><p>“These guys are a little unbridled,” said Lin Fan with a sigh. He hadn’t expected that someone would use him as a stepping stone. It was truly strange.</p><br/><p>Wu You Lan nodded. “They’re not just a little unbridled. They’re extremely unbridled.”</p><br/><p>“Brother Lin, look at this Wang Mei Tian’s Weibo. She’s even replying to her fans and saying that you’re already done and you can’t compose any more good songs for Wu Huan Yue. Look,” said Wu You Lan as she pointed at her phone.</p><br/><p>Lin Fan took a look. These comments were really interesting.</p><br/><p>Fans: “Idol, do you think Master Lin is done? And is Wu Huan Yue shooting films because she knows that she won’t get any more good songs?”</p><br/><p>Wang Mei Tian: “That’s right. Your guess is spot on. Master Lin’s songs are all decent but he can’t compose any more songs like before. This time, I have ten masters collaborating to compose classics for me. They’ll be released in a while. I hope that you all will support me.”</p><br/><p>Fans: “Yes, we will definitely support you.”</p><br/><p>But Lin Fan saw that some of his fans were going over there to flame her too. At the same time, he saw that his Chief of Internet Trolls was bravely waging war in the comments section too.</p><br/><p>Although he had already been outnumbered and surrounded, he wasn’t panicking at all. He was calmly breaking through their defense.</p><br/><p>Lin Fan didn’t bother about all this. Instead, he took out the songs from his drawer. “I’m going out for a bit.”</p><br/><p>Wu You Lan asked, “Brother Lin, where are you going?”</p><br/><p>Lin Fan waved that piece of paper in his hand. “These are songs that I wrote yesterday. I’m going to bring them over to Wang Ming Yang. I didn’t think that, just when I started writing songs, news related to this would suddenly appear. It’s really strange.”</p><br/><p>Zhao Zhong Yang laughed. “When these songs are released, they’ll probably be astounded.”</p><br/><p>Fraud Tian shook his head. “Why are there still people in this world who would go against you? Aren’t they just asking for trouble?”</p><br/><p>Lin Fan chuckled and didn’t say more. He just drove his car and set off towards Wang Ming Yang’s location.</p><br/><p>Eastern Han Group.</p><br/><p>Wang Ming Yang was looking at the news on the Internet and feeling very displeased. He knew about this Feiyue Entertainment Company and he had interacted with them before.</p><br/><p>Then, he made a call to them.</p><br/><p>“Chief Chen, you’re going overboard, aren’t you?” Wang Ming Yang said right off the bat.</p><br/><p>Chief Chen said in a surprised tone, “Chief Wang, I don’t quite understand what you’re saying. How am I going overboard?”</p><br/><p>Wang Ming Yang said, “You’re still pretending. Don’t you know about the news on the Internet? Don’t you think that it’s bad to step over others?”</p><br/><p>Chief Chen then realized what was going on. “Oh, so that’s what Chief Wang is talking about. I didn’t know about that either. But I wasn’t meaning to step over you. This is all a misunderstanding.”</p><br/><p>“F*ck. Can’t you speak properly? You even stepped over my brother. You must not want to f*cking live anymore, you piece of sh*t.” Wang Ming Yang had been able to control his temper at first but now, he was just cursing and swearing over the phone, not giving any respect to the opposition.</p><br/><p>Chief Chen’s expression instantly changed. “Chief Wang, what are you saying? Why are you scolding me? Don’t you have any morals?”</p><br/><p>“F*ck your mom. You better not let me see you. Otherwise, I’ll knock all of your teeth out. You’re even trying to create hype by saying that my brother is done for. I think you must have gone blind.” Wang Ming Yang was just raging. He felt as if he wouldn’t be satisfied if he didn’t release his anger on this guy.</p><br/><p>Although this Feiyue Entertainment Company was quite powerful, he wasn’t afraid. They could come at him if they wanted. He wasn’t afraid.</p><br/><p>*Clatter!*</p><br/><p>The opposite party hung up. It seemed that he couldn’t take Wang Ming Yang’s scolding anymore.</p><br/><p>“Hmph. You’re lucky that you hung up fast enough. Otherwise, I would scold you to death.” Wang Ming Yang took one last look at his phone before looking away. He was furious about this incident. He hadn’t expected that he would get stepped on by others. This feeling really made him upset.</p><br/><p>If they had only talked about Wu Huan Yue leaving the musical industry, he would’ve been able to stand it. But now, they were saying that his brother was done for. He couldn’t f*cking stand such a thing.</p><br/><p>If he didn’t give the opposition a good scolding, his name wouldn’t be Wang Ming Yang.</p><br/><p>At that moment, Lin Fan walked over. “Ming Yang, what are you doing? I heard you scolding someone from far away.”</p><br/><p>Wang Ming Yang heard his voice and was delighted. “Brother, you’re here. Come, quick. These people are too unbridled. I just scolded them directly.”</p><br/><p>Lin Fan smiled. “Sigh, we have to take this slow. There’s no hurry. When will Huan Yue be back?”</p><br/><p>Wang Ming Yang said, “She’ll be back tomorrow. How are those songs?”</p><br/><p>Lin Fan replied, “I rushed them out overnight. I’m dying of fatigue. Hurry up and move aside. Let me sit down and rest.”</p></div>\n</div>"}