{"title": "Chapter 1075 - This isn’t f*cking right", "id": 1075, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1075-this-isn%E2%80%99t-fcking-right", "volume_title": "Volume 11", "body": "<h1>Chapter 1075 - This isn’t f*cking right</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The questions went down one by one. The sports reporters really didn’t want to say more. They felt that these answers were too scary.</p><br/><p>In the end, the sports reporters backed off. They had completely given in.</p><br/><p>The entertainment reporters shook their heads as they saw the sports reporters leave.</p><br/><p>“These guys really don’t understand Master Lin.”</p><br/><p>“Yeah. If they understood Master Lin fully, they would know how true what Master Lin said is.”</p><br/><p>“We have to give Master Lin a thumbs up. He answered perfectly.”</p><br/><p>Lin Fan saw that the entertainment reporters hadn’t left and he was curious. “What are you all doing? This is sports news. Could it be that you want to report it too?”</p><br/><p>“Hehe, Master Lin, as long as it’s news, we will report it. But they’ve already asked all the questions. Why don’t you just say a few words and brag a little,” said one of the reporters.</p><br/><p>They had really interviewed Lin Fan too many times. Each time something happened, they would be there. Hence, they were used to it.</p><br/><p>“Alright then.” Lin Fan was helpless. Since it was like this, he decided to say everything at once. It would also be a way of making things clear for these reporters.</p><br/><p>After all the reporters left, he finally heaved a sigh of relief.</p><br/><p>Meanwhile, the shop owners laughed. “Little Boss, your words really shocked those sports reporters. They probably think you were just boasting.”</p><br/><p>Lin Fan shrugged. “What can I do about it? I wasn’t even boasting. I was just speaking the truth. Sometimes, even when I speak the truth, no one believes me. They would rather believe it if I lie to them. These days are tough.”</p><br/><p>“Hahahaha…”</p><br/><p>Everyone burst into laughter. They had already long gotten used to such situations.</p><br/><p>Back at the shop, Wu You Lan was lying down and playing with her phone.</p><br/><p>Lin Fan asked curiously, “What are you playing?”</p><br/><p>Wu You Lan replied, “Brother Lin, I’m buying tickets. I’m thinking that we should organize an activity for our shop, like going for a vacation or something.”</p><br/><p>When Fraud Tian heard that, his eyes lit up. “That’s a good suggestion. I strongly approve of it.”</p><br/><p>Zhao Zhong Yang chuckled cheerily as well. “Actually, I want to go out to play too. We haven’t been out together before.”</p><br/><p>The usually-quiet Wu Tian He smiled. “I’m already old. Going out to explore would help me to relax.”</p><br/><p>Lin Fan saw that everyone agreed to it and he thought about it. “Alright then, let’s go. You Lan, pick a good place and we’ll go when the time comes. Put it at a later date. Don’t make it so rushed.”</p><br/><p>Wu You Lan heard that and smiled elatedly. “Okay, okay!”</p><br/><p>She hadn’t expected Brother Lin to really agree. She felt delighted.</p><br/><p>Lin Fan chuckled. From the opening of the shop until now, he had indeed not gone out to play with everyone before. It wasn’t right of him as the boss. In order to be a good boss, he had to bring his employees out to play.</p><br/><p>Nighttime!</p><br/><p>In hundreds of thousands of households, families were watching the television.</p><br/><p>In a certain household.</p><br/><p>“Hey, Dad, change to the sports channel. Let’s watch football,” said the son.</p><br/><p>“Son, I thought that you didn’t like watching these things.”</p><br/><p>The son replied, “Dad, you must not know this. I heard that Master Lin played in this match and he was really awesome. We have to take a look and see just how awesome he was.”</p><br/><p>Of course, the father had to agree to the son’s request. Then, he changed the channel to take a look.</p><br/><p>Such scenarios were going on in various households. Due to the spread of the news, everyone was very curious as to what the match was like.</p><br/><p>Although they hadn’t watched it live, watching it on television was not bad either.</p><br/><p>On the Internet.</p><br/><p>“The sports channel will be broadcasting it tonight. It will be broadcasted on the broadcasting platforms online too. Has everyone prepared your melon seeds and beers?</p><br/><p>“I already know the outcome of the match but I’m still thrilled. I want to see just how awesome Master Lin’s goalkeeping is.”</p><br/><p>“This match has been said to be a match like no other. I’m thrilled as well.”</p><br/><p>“Same here. I never thought that Master Lin would become a goalkeeper. I was nearly scared to death when I heard it.”</p><br/><p>“Haha. Thinking about how badly the Yokohama F. Marinos have been beaten, I really want to laugh.”</p><br/><p>At that moment, the match began. Everyone sat there as they watched. The first ten minutes were very normal and nothing much was going on. But when that goalkeeper got injured, everyone knew that the important part was coming.</p><br/><p>Even the commentator’s voice started to tremble as if he knew what was going to happen. The commentator hadn’t shown much emotion initially but at this moment, his voice was suddenly filled with tremendous fighting spirit.</p><br/><p>“To the audience in front of your televisions, the Golden Flowers goalkeeper has stepped off the field. Now…”</p><br/><p>*Pfft!*</p><br/><p>The audience watching the match all spat out water from their mouths. <em>What kind of genius is this? He’s so excited that the Golden Flowers goalkeeper got injured. Isn’t he afraid of being beaten to death?</em></p><br/><p>The show carried on. Meanwhile, the citizens who were watching the match were discussing with their friends.</p><br/><p>But near the end of the match, everyone was completely silent. Their jaws had dropped and their eyes were gaping.</p><br/><p>With this expression, they just sat there until the match ended and they still hadn’t recovered.</p><br/><p>A full five minutes or perhaps even ten minutes had passed before some people regained their senses. And when they regained their senses, the first thing they said was…</p><br/><p>“D*mn!”</p><br/><p>Then, all of them charged to the Internet and started posting their comments.</p><br/><p>To them, it was simply as if they had seen a ghost. It was terrifying. It was simply terrifying.</p><br/><p>If they hadn’t seen it personally, they definitely wouldn’t believe it.</p><br/><p>In their eyes, Master Lin’s performance had been like a god’s. With him defending the goal, scoring was just a dream. In their hearts, they even felt that Tanaka Hiroshi was really pitiful.</p><br/><p>Because that guy had shot so many balls but, in the end, he had just knelt to the ground and he had even started to doubt his life.</p><br/><p>The next day.</p><br/><p>The sports reporters reported their interview with Master Lin. Most of them felt that Master Lin was too arrogant and they criticized him negatively.</p><br/><p>According to common logic, people would start flaming Master Lin online.</p><br/><p>But something that the sports reporters hadn’t expected happened.</p><br/><p>In the end, they were the ones who were flamed online. Moreover, the comments really left them speechless.</p><br/><p>“What Master Lin said is completely right. He is number one in the world.”</p><br/><p>“Sigh. Master Lin is being so humble again. After watching the match yesterday, I think he might even be number one in the universe.”</p><br/><p>“Well said. I think so too.”</p><br/><p>“Do these sports reporters even know how to write? Coach Wu Ze’s vision is great. He was able to see Master Lin’s ability with one look.”</p><br/><p>“Number one in the world. He has proven it with his actions. Let’s see if anyone can prove otherwise.”</p></div>\n</div>"}