{"title": "Chapter 1074 - Don’t you think that you’re being too arrogant?", "id": 1074, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1074-don%E2%80%99t-you-think-that-you%E2%80%99re-being-too-arrogant", "volume_title": "Volume 11", "body": "<h1>Chapter 1074 - Don’t you think that you’re being too arrogant?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The shop owners carried the plastic chairs out. The entertainment reporters weren’t shy at all. They took over the chairs, placed them down, and sat down in an orderly manner.</p><br/><p>They were very familiar with Master Lin as well as those shop owners.</p><br/><p>Master Lin had already said it, so of course, they had to do as he said, because Master Lin would definitely give them the opportunity to interview him.</p><br/><p>But the sports reporters seldom came into contact with Master Lin, so they didn’t sit down. They even felt that it wasn’t very good. But when they saw that the entertainment reporters had all sat down, they were dumbfounded.</p><br/><p>An entertainment reporter looked at them and said, “Why aren’t you all sitting? How will Master Lin answer our questions if you don’t sit? With one look, I can tell that you guys haven’t interacted with Master Lin much before.”</p><br/><p>“Yeah. Our relationship with Master Lin is solid. Interviewing him is a common occurrence. Without coming here at least seven or eight times a month, I wouldn’t feel comfortable.”</p><br/><p>When the sports reporters heard these words, they were a little surprised. Then, they took some chairs and sat down as well.</p><br/><p>Lin Fan heaved a sigh of relief. They had finally settled down. Then, he stood in front of the reporters and said, “Alright. I said I would let you interview me, so let’s do it. Ask your questions one by one in an orderly manner. Don’t rush it. I’ll definitely give you your chance.”</p><br/><p>Some of the townsfolk came to watch the show. They had already seen this kind of situation many times before. Those who came here often, in particular, had seen reporters come countless times.</p><br/><p>They knew that Little Boss and the reporters were inseparable.</p><br/><p>A sports reporter spoke, “Master Lin, are you going to conquer the entire sports world?”</p><br/><p>Lin Fan shook his head. “No. I have no such intentions.”</p><br/><p>He would have to be crazy to enter the sports world. It was too tiring. He would much rather enjoy the comfort of running his shop.</p><br/><p>At that moment, a female reporter asked, “Master Lin, what are your thoughts about what Coach Wu Ze said? He said that you’re the top goalkeeper in the world, the number one in the world. Do you think that this brings pressure to you or is Coach Wu just flattering you?”</p><br/><p>This question was quite deep but Lin Fan had not expected Wu Ze to think so highly of him and give such positive criticism.</p><br/><p>Although Lin Fan was someone who liked to stay low-key, he wasn’t someone who liked to lie either.</p><br/><p>Moreover, Coach Wu had already said so much. If Lin Fan didn’t admit to it, he wouldn’t be giving Coach Wu face. Hence, after some thought, Lin Fan decided to give a clear answer.</p><br/><p>To that female reporter, Master Lin was probably thinking about how to tactfully express that he wasn’t at that level. After all, most people would be extremely humble in front of cameras. Humility is a virtue.</p><br/><p>But suddenly, when she heard Master Lin’s reply, she was completely dumbfounded.</p><br/><p>Lin Fan said very seriously, “Actually, what Coach Wu Ze said is right. Although I’m not a part of the sports world, after this match, I feel that goalkeeping is too simple. I didn’t even use my full abilities. If he says that I’m the number one in the world, I’ll admit to that. After all, I’m not someone who likes to lie. Sometimes, being too humble can be artificial.”</p><br/><p>At that moment, the place went completely silent. Not a single person spoke.</p><br/><p>The surrounding shop owners nodded calmly as they felt that what Little Boss said was completely right. What he said was the truth. Seeing that Little Boss was still the same as he had been before, they were able to relax.</p><br/><p>If Little Boss suddenly became humble, they would really be afraid that Little Boss had gone through something that caused his personality to change.</p><br/><p>“F*cking awesome!” an entertainment reporter exclaimed. They were very familiar with Master Lin. Naturally, they knew what kind of person Master Lin was.</p><br/><p>In their hearts, Master Lin was the embodiment of wisdom and charm. He was someone worthy of worship.</p><br/><p>They felt that Master Lin had answered this question pretty well. Moreover, they could feel that Master Lin was actually already being very humble.</p><br/><p>But to the sports reporters, that answer had left them completely dumbfounded.</p><br/><p>“Master Lin, regarding that answer, don’t you think that you’re being too arrogant?” a male reporter asked. He felt that Master Lin’s reply had been too arrogant.</p><br/><p><em>What do you mean that goalkeeping is too simple? It’s not simple at all!</em></p><br/><p>As for Lin Fan saying that he hadn’t used his full abilities, they felt that he was simply bragging too much.</p><br/><p>Lin Fan shook his head. “My dear reporter, there’s no need to go on further about questions that I’ve already answered. The situation is indeed as such.”</p><br/><p>“I give in.” That reporter was speechless. He could only shake his head and continue recording.</p><br/><p>At that moment, another reporter raised his hand. “Master Lin, since your goalkeeping is so awesome, why don’t you become a goalkeeper? If it’s really as you say and you’re number one in the world, you could definitely lead the team to greater heights.”</p><br/><p>This was something that all the other reporters wanted to ask as well.</p><br/><p>After all, since Master Lin had said that he was so awesome, why didn’t he just do it? They simply couldn’t understand.</p><br/><p>Lin Fan smiled. “My dear reporter, this is a very good question. Why don’t I join official competitions? That’s because I feel that I can’t do it.”</p><br/><p>Before he finished speaking, the reporter hurriedly prompted, “Master Lin, with your abilities, many teams would welcome you.”</p><br/><p>“No. Let me finish.” Lin Fan waved his hand and said, “Football is a great activity. Like any other competition, it is only meaningful if there are wins and losses. If I become a professional player, it wouldn’t be worth watching anymore because no one would be able to score at all with me defending the goal post. I’m afraid that it would ruin the sport. So, for the sake of this sport, I won’t join.”</p><br/><p>“D*mn!”</p><br/><p>The sports reporters’ jaws all dropped. They had never heard such arrogant words before. If they were to report this, it would scare people to death.</p><br/><p>“F*cking awesome.” The entertainment reporters applauded as they felt that Master Lin had said it too well.</p><br/><p>One of the reporters asked, “Master Lin, don’t you think that you’re being too arrogant by saying those things?”</p><br/><p>Lin Fan looked at that reporter and answered, “This isn’t being arrogant. It’s the truth. My medical skills are awesome, aren’t they? But I won’t be a doctor. My drawings are awesome, aren’t they? But I won’t become an artist. My martial art skills are amazing, aren’t they? But I won’t become a martial artist. That’s because I don’t want to ruin these industries. For these industries to have reached their current states, it hasn’t been easy.”</p><br/><p>When the sports reporters heard this reply, they were completely astounded.</p><br/><p>Meanwhile, the entertainment reporters just nodded. They felt that what Master Lin said made a lot of sense and there was nothing wrong at all. They truly believed in those words without a doubt.</p><br/><p>They had followed Master Lin all along. Regarding how f*cking awesome Master Lin was, they understood best.</p></div>\n</div>"}