{"title": "Chapter 1073 - Don’t be impulsive, impulse is a devil", "id": 1073, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1073-don%E2%80%99t-be-impulsive-impulse-is-a-devil", "volume_title": "Volume 11", "body": "<h1>Chapter 1073 - Don’t be impulsive, impulse is a devil</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The next day!</p><br/><p>The sports news agencies were reporting unrestrainedly.</p><br/><p>‘Yesterday, in the match between the Yokohama F. Marinos and the Golden Flowers, a shocking scene erupted.’</p><br/><p>‘The mysterious goalkeeper is actually him…’</p><br/><p>‘Wu Ze said: He’s number one in the world. No one can compare to him.’</p><br/><p>‘This is something that has never happened before. It has left many people wondering if this is still the same sport that they used to know.’</p><br/><p>‘Master Lin, please stop hiding things from us. What else do you know? Tell us all of it at once.’</p><br/><p>‘Perhaps this man will haunt the Yokohama F. Marinos forever.’</p><br/><p>When these articles were released, countless people who didn’t watch football were drawn in because these titles were pretty good. They were very domineering and they made people want to read on.</p><br/><p>When the netizens saw these articles, one by one, they all went crazy.</p><br/><p>“D*mn! Can someone tell me whether this is true?”</p><br/><p>“Master Lin? Don’t f*cking tease me. Is this for real?”</p><br/><p>“That goalkeeper from yesterday’s match was Master Lin?”</p><br/><p>“How is that possible? Why would Master Lin appear there?”</p><br/><p>“This is true. Even Wu Ze has personally admitted it.”</p><br/><p>“But this is too domineering, isn’t it? Number one in the world… That’s too much.”</p><br/><p>“^you weren’t at the scene. If you were, you would know that that isn’t an exaggeration at all. He was just that dominant.”</p><br/><p>At that moment, on the forums, chat groups, and Weibo, this matter regarding Master Lin was circulating.</p><br/><p>In particular, many people had taken those GIFs and edited them, adding words.</p><br/><p>For example, to that GIF of Lin Fan tossing the ball back to Tanaka Hiroshi, someone added the words: ‘Here’s another chance for you to do better.’</p><br/><p>The netizens took several images and played around by editing them. They even sent these edited images to various groups and spread them.</p><br/><p>Some netizens, who hadn’t paid much attention to this, saw the images and were very curious. They wondered where these images came from and why they were so brilliant.</p><br/><p>On a Japanese website.</p><br/><p>“The Yokohama F. Marinos actually lost. That’s not possible.”</p><br/><p>“I saw the match. That Chinese goalkeeper was really terrifying. He’s simply a demon.”</p><br/><p>“It’s him. It’s him again.”</p><br/><p>“What do you mean?”</p><br/><p>“This guy’s table tennis skills are amazing as well. He defeated our champion and, even now, our champion hasn’t recovered. This Chinese man is too terrifying.”</p><br/><p>“We have to protest. This person is clearly hacking. He’s breaking the rules of the game.”</p><br/><p>“That’s right. I won’t watch any competitions that he participates in in the future because he’s simply a demon.”</p><br/><p>To these Japanese football fans, this was really unbelievable. Their favorite football team had been completely thrashed by this person.</p><br/><p>Moreover, they had already received the broadcast of the match. Those who had watched it were all speechless. They felt that it was too embarrassing and shameful.</p><br/><p>Cloud Street!</p><br/><p>Lin Fan was in the shop and the shop owners started gathering.</p><br/><p>“Little Boss, you’re defying nature.” Elder Liang’s expression was one of astonishment. He had seen the news and he hadn’t expected that Little Boss could be so domineering. Little Boss had gone to play football and even created such a miracle. How had the news put it?</p><br/><p>The number one goalkeeper in the world. Much better than the other top goalkeepers in the world. This was a huge honor.</p><br/><p>Lin Fan sighed helplessly. He hadn’t expected this incident to cause such a huge stir. But the good thing was that the reporters gave him face. They must have known that he was very busy so they didn’t come to interview him.</p><br/><p>But soon after he thought of that, an astonishing thing happened.</p><br/><p>“Master Lin…” In the distance, a group of reporters charged over while carrying their cameras. When the townsfolk saw this, they were all dumbfounded. <em>This is too f*cking vicious!</em></p><br/><p>The reporters flew over like a hurricane.</p><br/><p><em>D*mn. I was just praising you guys but you’ve come here yet again. I’ll never praise you again in the future. Speak of the devil indeed. </em>Lin Fan was cursing in his heart. He hadn’t expected this at all.</p><br/><p>In an instant, the reporters completely surrounded the shop. These reporters were all sports reporters, not the usual reporters who interviewed Lin Fan for random gossip.</p><br/><p>“Master Lin, how did you learn your goalkeeping skills?”</p><br/><p>“Master Lin, are you going to enter the sports industry?”</p><br/><p>The reporters were maniacally asking questions one by one. Some of them had even climbed onto the table, wanting badly to get something out of Lin Fan.</p><br/><p>“Don’t push, don’t push. Everyone, calm down,” Lin Fan shouted as he backed off.</p><br/><p>In his life, he had never been afraid of anyone else, but he was afraid of these reporters. These reporters would disregard all else in order to obtain news.</p><br/><p><em>Look at this guy. He’s so f*cking graceful that he has climbed onto the table. In order to obtain news, these people will think of all sorts of ways.</em></p><br/><p><em>And look at that guy. He’s using his buff body to push through everyone else.</em></p><br/><p>The surrounding shop owners backed off frantically. Regarding this incident, they looked as if they didn’t want any part of it.</p><br/><p>They had seen reporters many times before but the reporters this time looked unfamiliar. And looking at their names, the shop owners understood that these were sports reporters.</p><br/><p>“Master Lin…”</p><br/><p>At that moment, voices echoed from the distance once again. A group of entertainment reporters could be seen approaching the shop. One of them cried out in surprise, “D*mn! We’re late. They reached here earlier than us. Brothers, charge forward with me!”</p><br/><p>Lin Fan was completely dumbfounded. <em>What the heck are you all doing? Are you trying to defy nature?</em></p><br/><p><em>Aren’t you afraid of ruining my shop?</em></p><br/><p>“Nobody move…” Lin Fan didn’t think too much. For his own safety, he bellowed loudly and he even incorporated a bit of his power into that shout.</p><br/><p>This voice exploded in the reporters’ ears and left them in a daze. It was simply terrifying.</p><br/><p>Then, each of them just stood there obediently, looking at Master Lin with wide eyes. They hadn’t expected Master Lin’s voice to be so loud, to be able to shake all of them.</p><br/><p>Lin Fan raised his hand. “My dear reporters, please proceed outside. If you have questions, ask them one by one. We’ll just have a simple press conference today, okay?”</p><br/><p>“Look. If you behave like this, you won’t be able to interview me at all. Moreover, a stampede could easily happen. If someone gets injured, it wouldn’t be worth it.”</p><br/><p>Lin Fan spoke slowly and firmly, trying to guide the situation.</p><br/><p>The reporters nodded as they felt that Master Lin made sense. One of the reporters who was amidst the crowd cried out, “Give me some space, I can’t breathe!”</p><br/><p>At that moment, the reporters all exited the shop.</p><br/><p>Lin Fan looked at the shop owners and said, “Bring some chairs over for the reporters to sit down. We’ll talk slowly. Let’s not be impulsive. Impulse is a devil.”</p><br/><p>He was really afraid.</p><br/><p>Regarding yesterday’s incident, he really felt helpless.</p></div>\n</div>"}