{"title": "Chapter 1076 - Stepping stone", "id": 1076, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1076-stepping-stone", "volume_title": "Volume 11", "body": "<h1>Chapter 1076 - Stepping stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cloud Street!</p><br/><p>Lin Fan was talking to Wang Ming Yang on the phone.</p><br/><p>“Brother, you really are awesome. In front of the reporters, you don’t even know how to be a little more humble,” said Wang Ming Yang with a smile. He had seen the news and he felt that it was quite domineering. Any average person definitely wouldn’t have spoken like that.</p><br/><p>Lin Fan smiled. “It was alright. That’s just how I am. Oh yes, how’s that matter? Are you taking care of it?”</p><br/><p>Wang Ming Yang sighed. “If it’s something you want me to do, how could I not get it done? Don’t worry, I’m on it. But it requires some time. These things require endorsement.”</p><br/><p>Lin Fan said, “Alright. As long as you get it done, it’s fine. I will definitely give you a big pleasant surprise.”</p><br/><p>“Oh, right. Didn’t you say that you were going to prepare new songs for Huan Yue? I think it’s about time. Right now, her album has been on the Internet for some time and she can’t sustain her popularity just by relying on her old songs. She has to produce some new songs,” said Wang Ming Yang.</p><br/><p>Lin Fan thought about it. He didn’t have much to do anyway. “Alright, no problem. I’ll write the songs and send them to you tomorrow.”</p><br/><p>The two of them chatted a while more before they hung up.</p><br/><p>Right now, the most important thing to Lin Fan was the matter regarding Nanshan Children’s Welfare Institute. But this research lab still required some time to prepare. He had already written down the materials needed. With Wang Ming Yang’s capabilities, it shouldn’t be much of a problem.</p><br/><p><em>Songs. Let’s think about what songs I should write.</em></p><br/><p>His mind was now filled with songs. He could write as many songs as he wanted but he still had to choose.</p><br/><p>Wu You Lan was indeed a singer envied by the entire entertainment industry. Other people would think of all sorts of options to obtain a song but she had such a great support from Master Lin. She could have as many songs as she wanted. This really made other people upset.</p><br/><p>Feiyue Entertainment Company.</p><br/><p>At that moment, in the conference room, a group of people was seated. In this group, there was a young lady. She had a proud appearance as she sat there. The people around her were discussing.</p><br/><p>This company was quite powerful in the entertainment industry. It had brought up many popular singers. In the musical world, it had a strong ability to create stars.</p><br/><p>Then, the man who was sitting in the middle looked at that young lady. “Wang Mei Tian, have you chosen any songs? Are there any that you like among these songs?”</p><br/><p>Wang Tian Mei had a sweet and pretty face. She smiled. “Chief Chen, I’ve already chosen. I feel that these songs are quite suitable for me.</p><br/><p>Chief Chen smiled and said, “That’s good. These songs were all composed by professional masters. Other people wouldn’t be able to get them even if they wanted to.”</p><br/><p>Wang Mei Tian smiled back. She liked these songs very much. Moreover, she felt that these songs were all classics.</p><br/><p>Chief Chen looked at another person and said, “Are the public relations ready? The campaign has to be the biggest and the most eye-catching.”</p><br/><p>“Don’t worry, Chief Chen. We’re already prepared. We’ve thought of a few ideas. Please see which is most suitable.” The person in charge of promoting took out some examples and passed them to Chief Chen to see.</p><br/><p>Chief Chen took a look before saying, “This first one won’t do it. I feel that we would be stepping over Wu Huan Yue if we do this. I’m afraid it would create a negative impact.”</p><br/><p>“The second one is possible. Composed by the collaborative efforts of ten top masters. That’s a good heading. It’ll work.”</p><br/><p>“The third one isn’t possible. Don’t offend Master Lin. This person is evil, we can’t offend him.”</p><br/><p>Wang Mei Tian walked over and looked from behind. “Chief Chen, I feel that the first one will work. I feel that I’m not far off from Wu Huan Yue. She just debuted earlier than me. I feel that the first idea is suitable.”</p><br/><p>Chief Chen looked at Wang Mei Tian, then at the first option again. He thought for a moment before saying, “Mmm. That does make sense. Since you’re fine with it, let’s do it.”</p><br/><p>“Although it’s a little risky, it could make you gain popularity quickly. With these classics on top of that, there won’t be any problems at all.”</p><br/><p>Wang Mei Tian nodded very contently. She knew about that Wu Huan Yue and she felt that Wu Huan Yue was just lucky. With her capabilities, surpassing Wu Huan Yue wouldn’t be difficult at all.</p><br/><p>The promoter said from the side, “Chief Chen, actually, we can try using this news involving Master Lin too. Look, Master Lin hasn’t written any new songs for Wu Huan Yue in so long. He has probably used up all of his ideas. We can use that to our advantage. It definitely will not go wrong.”</p><br/><p>Chief Chen nodded. “Mmm. That makes sense. In so long, Wu Huan Yue hasn’t released any new songs. It seems that Master Lin has not written any satisfactory songs in this period. We’ll say that Master Lin has run out of ideas but we won’t directly attack him. Even Master Lin’s fans won’t be able to do anything about it. And in order to see how our songs are, those fans will definitely come and listen. If we can convert one out of ten of them, we would have won.”</p><br/><p>“Right. Chief Chen is right. I agree,” the promoter said with a smile. He felt that this was a great plan. Although it would draw some criticism, that wouldn’t be a problem. There were many celebrities who looked for all sorts of ways to hype themselves up in order to gain popularity.</p><br/><p>Wang Mei Tian smiled with great confidence. “I believe in myself. I’ll definitely become even more popular than Wu Huan Yue.”</p><br/><p>Chief Chen and the promoter smiled as they exchanged looks. This Wang Mei Tian was the champion of a certain competition and she had then signed a contract with them. She was considered Wu Huan Yue’s junior but to them, this Wang Mei Tian was pretty capable.</p><br/><p>As the surrounding people saw this, they didn’t say much.</p><br/><p>This Wang Mei Tian had gotten Chief Chen’s support because their relationship was not a normal one.</p><br/><p>Otherwise, which company would treat a newbie like that?</p><br/><p>But they had to admit that Wu Huan Yue had been busy shooting movies and television shows and she had completely neglected her singing career.</p><br/><p>Moreover, Master Lin had not composed new albums for Wu Huan Yue either. It seemed that there hadn’t been any news from them in a while. To them, Master Lin was probably out of ideas.</p><br/><p>Wu Huan Yue still had fans and many of them were waiting for new songs. But after so long without new songs, the fans were a little impatient.</p><br/><p>Hence, when they saw this situation, they wanted to pull some of Wu Huan Yue’s fans over to their side.</p><br/><p>Of course, this would require them to generate some hype and also create some antics on the Internet.</p><br/><p>Cloud Street.</p><br/><p>“I’m finally done writing.” Lin Fan looked at the content on the paper and laughed contently. These songs had been hard to pick. Picking suitable songs among all those songs was really not easy.</p><br/><p>Then, he tossed the paper into a drawer. Tomorrow, he would deliver it to Wang Ming Yang.</p><br/><p>These ten songs, that were invaluable to others, had been tossed casually into the drawer. If other people knew this, they would definitely be cursing.</p></div>\n</div>"}