{"title": "Chapter 1087 - Who are you trying to poison?", "id": 1087, "volume": 11, "url": "http://boxnovel.org/a-valiant-life-chapter-1087-who-are-you-trying-to-poison", "volume_title": "Volume 11", "body": "<h1>Chapter 1087 - Who are you trying to poison?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Tianshu Milk Headquarters.</p><br/><p>“You f*cking…” When the relevant person in charge saw the sheet of paper, his blood rushed to his head and his face turned bright red. His eyes were burning with fury.</p><br/><p>The employees were trembling as they didn’t dare to look at the leader. This time, they were f*cked.</p><br/><p>“We didn’t expect this either,” said one of the employees softly. They couldn’t be blamed. If anything, their good luck should be blamed for making them select the good products for testing.</p><br/><p>But it didn’t seem possible. There had never been problems in the past. How could there be a problem this time?</p><br/><p>Was there a problem in the working process or was there corruption in one of the departments that had led to this change?</p><br/><p>“You didn’t expect it? Why didn’t you expect it?” the leader bellowed furiously. He wanted to just swallow these guys whole.</p><br/><p>Suddenly, he realized that they were simply digging their own grave.</p><br/><p><em>No, I have to salvage the situation. Otherwise, it will really be too late.</em></p><br/><p>Without caring about the employees, he immediately made a call to Master Lin.</p><br/><p>Lin Fan was just using his phone and about to post the test results onto the Internet when his phone rang. He helplessly answered the call.</p><br/><p>“Hello, who is it?”</p><br/><p>The person on the other end of the call sounded very gentle as if he knew he had done something wrong. “Master Lin, hello. I’m Ma Guo Fu from Tianshu Milk Company. This whole incident was because of us. It was our negligence. Could you just forget about it? I’ll immediately send people to retrieve the goods. Do you think that’s fine?”</p><br/><p>Lin Fan instantly started laughing upon hearing that. “I think that’s a very difficult thing.”</p><br/><p>Ma Guo Fu was powerless now. But no matter what, he had to stay calm. He couldn’t let the situation collapse. “Master Lin, give us a chance. This mistake was unexpected. Do you think this is okay? We know that you’ve been criticized on the Internet lately. We’re willing to compensate you for that. We just hope that Master Lin will be merciful and let this matter slip.”</p><br/><p>“Do you think it’d be okay if we settle this matter ourselves?”</p><br/><p>“No,” Lin Fan directly rejected.</p><br/><p>Ma Guo Fu was taken aback. “Master Lin, you’re a public figure and we’re a large corporation. We’ll likely interact with each other again in the future. There’s no need to be like this, is there?”</p><br/><p>“There is. There really is a need. Also, I’m not a public figure. I’m just a shop owner. I just know more people than the average person,” said Lin Fan.</p><br/><p>“You…” Ma Guo Fu didn’t know what to say anymore. But right now, his fate was in Master Lin’s hands. He couldn’t possibly refute.</p><br/><p>“Tell us. What do you want to do?”</p><br/><p>Lin Fan pondered for a moment. “I don’t want to do anything. I have to be responsible for the masses. I have to publicize the test results. Oh right, I can’t talk to you anymore. I feel that talking to you is just a waste of time. Who knows how many people have drunk your milk during this time that we’ve been talking? I’m hanging up.”</p><br/><p>*Clatter!*</p><br/><p>Ma Guo Fu heard the beeping sound from the phone. At that moment, he just stood there stupidly.</p><br/><p>The Quality Inspection Head Office had just released the test results and they also included a deep reflection.</p><br/><p>When the netizens saw this, they were completely stunned as if they had seen a ghost.</p><br/><p>The Quality Inspection Head Office’s leader was looking at the situation on the Internet as well. When he saw Master Lin post the test results shortly after them, he heaved a sigh of relief. He thought that it was just as they had thought. Master Lin had indeed been waiting for them.</p><br/><p>Touched. Grateful.</p><br/><p>He didn’t even know how to thank Master Lin. Master Lin was completely taking care of them.</p><br/><p>When Lin Fan saw the situation on the Internet, he was startled. It was really fast. He hadn’t expected the Quality Inspection Head Office to release the test results so quickly.</p><br/><p>Netizens.</p><br/><p>Initially, they had been discussing this matter on the Internet. After all, this was a very severe matter. Moreover, there hadn’t been any evidence at all and they had no idea who to believe.</p><br/><p>“D*mn! Hurry up and take a look at the Quality Inspection Head Office’s Weibo. They’ve released the test results!”</p><br/><p>“Master Lin has posted it too. They’ve done it one after the other.”</p><br/><p>“D*mn! It can’t be. There really is a problem with Tianshu Milk. I’ve drunk it for a few days.”</p><br/><p>“Sh*t. I suggest that you go to the hospital to clean your intestines quickly. Otherwise, you’ll get cancer.”</p><br/><p>“F*ck off. Who are you trying to scare? My intestines have terrible absorption. It’ll be excreted soon. I won’t absorb the toxins.”</p><br/><p>“666…”</p><br/><p>When Ma Guo Fu saw the Quality Inspection Head Office’s public statement, he was stunned. Right now, he only had one thought in his mind. They were really in deep trouble. Moreover, they were probably beyond hope.</p><br/><p>And when he saw Master Lin’s Weibo post, it was as if a ball of fire was about to burst out of his heart.</p><br/><p>“F*ck your mom…”</p><br/><p>He was really enraged. If it hadn’t been for this Master Lin, things wouldn’t have turned out this way.</p><br/><p>Wang Mei Tian was at home, drinking some milk. At the same time, she scrolled through Weibo. She was filled with confidence for her future. Tianshu Milk wanted her to be their brand ambassador. And when she looked at her Weibo comments, they were all supporting her.</p><br/><p>This made her feel as if she was about to reach the pinnacle of life.</p><br/><p>“Hey, what’s this?” At that moment, Wang Mei Tian saw a Weibo post that was being reposted maniacally.</p><br/><p>“Test results reveal that Tianshu Milk contains a 200% excess of aflatoxins. The evidence is clear. The Quality Inspection Head Office has apologized publicly.”</p><br/><p>*Pfft!*</p><br/><p>She had just taken a mouthful of milk but before she swallowed it, she spat it all out. Her snow-white face turned green.</p><br/><p>“An excess of carcinogens?” Wang Mei Tian looked at the delicious bottle of milk in her hand and was completely dumbfounded. Then, as if she had seen a ghost, she threw the bottle into the dustbin.</p><br/><p>“How is this possible? How did things turn out this way? It can’t be!”</p><br/><p>She didn’t dare to believe what had happened. How could there have been an excess of carcinogens? There must have been a mistake.</p><br/><p>But when she saw the Weibo comments, she was completely dazed.</p><br/><p>“Hahaha. Do you feel good, Wang Mei Tian? Do you feel happy drinking that toxic milk?”</p><br/><p>“F*ck. You f*cking donated ten thousand boxes to the mountainous areas. Are you trying to poison all those children? You monster.”</p><br/><p>“Master Lin already said that it was toxic but you were so f*cking stubborn. Why are you just so stubborn?”</p><br/><p>“You’re screwed. When this incident started, you tried so hard to suck up to Tianshu Milk Company, causing people to trust Tianshu Milk. Now that the truth is out, what will you do?”</p><br/><p>“And you want us to support your album? Keep dreaming.”</p><br/><p>“D*mn. I actually didn’t trust Master Lin. I regret it so much.”</p><br/><p>At that moment, Wang Mei Tian looked at the situation on Weibo and was completely stupefied.</p></div>\n</div>"}