{"title": "Chapter 1109 - He’s really going", "id": 1109, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1109-he%E2%80%99s-really-going", "volume_title": "Volume 12", "body": "<h1>Chapter 1109 - He’s really going</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Cloud Street!</p><br/><p>Zhao Zhong Yang looked at his phone in shock. Then, he looked up at Lin Fan.</p><br/><p>“Brother Lin, what are you going to do?”</p><br/><p>Under his gaze, Lin Fan stood up. His expression was very stern. It was as if he was about to go into battle.</p><br/><p>“What else am I going to do? Of course I’m going to Beijing. If I say I’m going to crush them, I’m going to crush them.”</p><br/><p>Lin Fan was fearless. This incident had made him furious. In the past, the Shanghai association had been in shambles. Now, it had slowly developed and, after the Kunlun Mountain incident, it had suddenly become popular.</p><br/><p>This wasn’t just due to Lin Fan’s efforts. It was also the effort of the whole Shanghai association.</p><br/><p>Now that the headquarters had given the order to transfer President Niu away and have someone else to take over, weren’t they just leeching off of the Shanghai association’s efforts?</p><br/><p>Lin Fan knew about the situation at the Beijing association. If he were to quarrel with them on Weibo, it would only make President Niu feel pressured and he would resign in the end.</p><br/><p>If that were to happen, they would be taken advantage of by the Beijing association.</p><br/><p>Hence, at this moment, Lin Fan had to use his overbearing hands and quick feet to go over to the Beijing association to see what exactly was going on over there.</p><br/><p>If they really were so impudent, he would crush them.</p><br/><p>“Brother Lin, don’t be rash,” Zhao Zhong Yang shouted anxiously. He believed that Brother Lin would really crush them if he said he would. He definitely hadn’t just said it casually on the Internet.</p><br/><p>“Look after the shop. I may not be back tonight.”</p><br/><p>Lin Fan threw those words out before leaving the shop and driving off.</p><br/><p>Zhao Zhong Yang looked at Fraud Tian helplessly. “Fraud, why didn’t you try and stop him?”</p><br/><p>Fraud Tian blinked a few times. “What use would that be?”</p><br/><p>Zhao Zhong Yang was momentarily lost for words. They really wouldn’t be able to stop him even if they tried.</p><br/><p>Wu You Lan covered her mouth as she laughed. She wasn’t bothered by this. But to Zhao Zhong Yang, this wasn’t the time to laugh. He didn’t even know what to say anymore.</p><br/><p>“Don’t worry. Brother Lin knows what he’s doing. After so long, have you ever seen Brother Lin act rashly?”</p><br/><p>Wu You Lan spoke with a smile. She had been with Lin Fan for so long. She felt that this matter would definitely be resolved perfectly.</p><br/><p>“How has he never acted rashly?” As Zhao Zhong Yang thought about some of Brother Lin’s past events, he felt that Brother Lin had never considered the outcome of his actions.</p><br/><p>In the past, when he hacked the Internet, he had spent a month in prison.</p><br/><p>Then, Zhao Zhong Yang went to the entrance and saw a car driving off into the distance.</p><br/><p>“This time, the Beijing association is seriously screwed,” said Zhao Zhong Yang with a sigh. He didn’t know what to say anymore.</p><br/><p>The Shanghai association.</p><br/><p>As Jiang Fei looked at the news on Weibo, especially the argument between President Lin and the Beijing association, his expression changed dramatically.</p><br/><p>“President Lin is going to crush the Beijing association…”</p><br/><p>Wang Yun Jie was startled as he looked at Jiang Fei. “How can that be? President Lin can’t be that rash.”</p><br/><p>Jiang Fei shook his head. “Take a look at his Weibo. They’re already arguing there.”</p><br/><p>Wang Yun Jie took a look, then looked up. “It can’t be, can it? Maybe President Lin is just saying this to vent his anger.”</p><br/><p>“Do you think that’s possible?”</p><br/><p>“Er…” Wang Yun Jie swallowed his saliva. To him, President Lin was unpredictable. In the past, before President Lin had become famous, he had beaten up all of them in the association office.</p><br/><p>As for now, his temper definitely hadn’t changed. He might really be going to crush the Beijing association.</p><br/><p>If the Beijing association were to respond nicely, perhaps it would be fine. But if they were to have a bad attitude, things would really turn out terribly.</p><br/><p>On the Internet. Weibo.</p><br/><p>“D*mn. Could Master Lin really be going to crush the Beijing association? There are crouching tigers and hidden dragons over there. There are lots of experts. If he goes alone, won’t he get bullied to death?”</p><br/><p>“^You must be dreaming. Crouching tigers and hidden dragons? I think they’re just a bunch of snakes and rats. Don’t you know about Master Lin’s strength? He could probably send them flying with a single kick.”</p><br/><p>“^How can you call them snakes and rats? You should be calling them shrimp soldiers and crab generals*.”</p><br/><p>“^Brothers, you’re both idiots. Your language teachers will probably die early.”</p><br/><p>“Hehe. He’s just shooting his mouth. Do you really think he would dare to go to Beijing?”</p><br/><p>“That’s right. The Beijing association isn’t afraid of him. They’re clearly not even bothered by this.”</p><br/><p>At that moment, Lin Fan’s Weibo was updated.</p><br/><p>No words were said.</p><br/><p>It was just a picture of an airplane ticket.</p><br/><p>And the destination was Beijing.</p><br/><p>When the netizens saw this, they completely lost it.</p><br/><p>“D*mn. Is he trying to f*cking defy nature?”</p><br/><p>“Motherf*cker. He’s really going. Must he be so fierce? Isn’t it just a normal online argument? Is there a need to go to this extent?.”</p><br/><p>“You must all be new. Who do you think Master Lin is? Whenever there’s a conflict, he would definitely treat it very seriously.”</p><br/><p>“This time, the Beijing association will have to kneel. If they don’t, I’ll broadcast myself eating sh*t.”</p><br/><p>“Who would still dare to quarrel with this Lin in the future? Just because of a disagreement, he went to buy a ticket to fly to Beijing. This is going to be huge.”</p><br/><p>To the netizens, this had become quite a big deal.</p><br/><p>They had initially thought that Master Lin was just talking big. Perhaps Master Lin was only going to quarrel with the Beijing association on Weibo and it would be resolved in the end.</p><br/><p>But who would have thought that Master Lin would buy an airplane ticket after one disagreement? And he had even posted it on Weibo. He was telling everyone that he was already going there and that they should prepare themselves for it.</p><br/><p>The Beijing association.</p><br/><p>The person who managed their Weibo account looked totally calm. He hadn’t been bothered by the argument with Master Lin.</p><br/><p>“This Shanghai association Vice-President actually dares to be so impudent to the headquarters. Who do you think gave him his appointment? It wasn’t given by us. He’s really unbecoming of a Vice-President.”</p><br/><p>The other man laughed. “Look. He’s saying that he’s coming to Beijing to crush us. Who on Earth gave him the courage to…to…”</p><br/><p>Before he could finish, he suddenly stopped. His eyes widened as he stared at his phone in disbelief.</p><br/><p>The colleague next to him couldn’t help but laugh. Then, he asked curiously, “Why are you stuttering?”</p><br/><p>Suddenly, a cry of shock rang out.</p><br/><p>“D*mn, is this guy trying to defy nature?” That person shot up from his seat with a look of disbelief on his face.</p><br/><p>“What exactly is going on? Did something happen?”</p><br/><p>“Look at this.” That man immediately passed his phone over.</p><br/><p>When the other man saw the picture on the phone, the both of them were completely dumbfounded and they couldn’t react at all.</p><br/><p>From Shanghai to Beijing, it was a two-hour journey. Even if they took into account the time taken to travel from the airport, it would take three hours at most. That meant that, in three hours, Master Lin would be standing at the entrance of the Beijing association.</p><br/><p><em>This…</em></p><br/><p>*Note: Shrimp soldiers and crab generals is the direct translation of a Chinese phrase, used to refer to useless troops.</p></div>\n</div>"}