{"title": "Chapter 1106 - I don’t believe that he won’t become my master for half of my net worth", "id": 1106, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1106-i-don%E2%80%99t-believe-that-he-won%E2%80%99t-become-my-master-for-half-of-my-net-worth", "volume_title": "Volume 12", "body": "<h1>Chapter 1106 - I don’t believe that he won’t become my master for half of my net worth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the car.</p><br/><p>Lin Fan let out a deep breath.</p><br/><p>However, the voices from outside made his heart tremble.</p><br/><p>“Chief, have a safe trip. We will visit you in Shanghai.”</p><br/><p>…</p><br/><p>“I’m f*cked.” Lin Fan felt helpless. <em>What the f*ck is going on? </em>Then, he turned to Zhao Zhong Yang and immediately grabbed his neck. “You talk way too much!”</p><br/><p>“Ah! Save me! Brother Lin, have mercy. I won’t do it again!” Zhao Zhong Yang squealed like a pig being slaughtered.</p><br/><p>Lin Fan pinched Zhao Zhong Yang’s chest. “Do you still dare to do something like that again?”</p><br/><p>“Ah!” Zhao Zhong Yang screamed. “Brother Lin, don’t pinch me. It hurts! I won’t dare to do it again!”</p><br/><p>“You…” When Lin Fan heard Zhao Zhong Yang’s scream, he was dazed. He hadn’t expected this guy to be so noisy.</p><br/><p>When Fraud Tian saw this, he roared with laughter. “Good! You should let this kid know your power.”</p><br/><p>“But honestly, people in the past would agree to have their heads smashed if it meant that they could become the chief but you actually don’t want it.”</p><br/><p>Lin Fan tilted his head over. “If you want to be the chief, you do it.”</p><br/><p>Fraud Tian sighed helplessly. “Even if I want to, those people won’t acknowledge me. Comparing oneself to others will really drive one mad. I’m so strong, why don’t I have such an opportunity?”</p><br/><p>Wu You Lan covered her mouth as she started laughing.</p><br/><p>The association members in the car did the same as well. They were really in admiration of Master Lin. If they hadn’t seen everything for themselves, they wouldn’t have believed it.</p><br/><p>He was proficient in every style of martial art. It was simply terrifying.</p><br/><p>In the past, they had known about Master Lin’s position as the association’s Vice-President but they had no knowledge of his abilities.</p><br/><p>After all, on the news, Master Lin’s biggest strengths had always been medicine, Chinese art, etcetera.</p><br/><p>As for his martial arts, it had only been mentioned a few times on the news.</p><br/><p>But after this incident, they now understood that Master Lin was a super expert. Moreover, it wasn’t as simple as others thought.</p><br/><p>Lin Fan returned to his original position, glaring at Zhao Zhong Yang. “When we go back, I’ll have a good chat with you.”</p><br/><p>Zhao Zhong Yang looked helpless as he was filled with regret. If he had known this would happen, he wouldn’t have said those things. He wondered how Brother Lin was going to settle him when they go back.</p><br/><p>However, when he saw Brother Lin take out his phone, Zhao Zhong Yang started smiling again. “Brother Lin, are you looking at the news? Right now, the news on the Internet is very viral. I’m looking too. Do you want me to tell you about it?”</p><br/><p>Lin Fan glanced at him. “No. It’s not like I can’t read.”</p><br/><p>At that moment, Zhao Zhong Yang had a thought in his mind. He was thinking that he would have to find a place to hide when they return.</p><br/><p>On the Internet.</p><br/><p>This video had made a tremendous impact. Countless netizens had already kneeled in submission after watching this shocking video.</p><br/><p>“He’s really too strong. Is this Master Lin still human?”</p><br/><p>“I don’t know if he’s human but I know that Master Lin’s awesomeness is out of this world.”</p><br/><p>“I’m a martial arts hobbyist. I’ve seen all of these techniques before and I feel that Master Lin is better at all of them than the people I’ve seen. He can probably kill someone.”</p><br/><p>“^Don’t act like you know everything. You speak as if you understand all about this.”</p><br/><p>“I really understand it. You’re all just looking at the surface of the video but I can see that every punch and every kick from Master Lin would at least break several bones if it hit someone. And they would even be sent flying through five or six meters.”</p><br/><p>“F*ck, stop bragging. I don’t believe that he’s that strong.”</p><br/><p>“Don’t believe me then. It’s useless to try and explain it to you guys.</p><br/><p>On a certain martial arts web forum.</p><br/><p>A thread had been all the way at the top.</p><br/><p>‘At the Kunlun Mountain Martial Arts Meet, true experts will gather.’</p><br/><p>This thread hadn’t been about Lin Fan at first. It had been in anticipation of the event at Kunlun Mountain. Over ten thousand comments were talking about how excited they were.</p><br/><p>But now, this thread had been overtaken by another thread.</p><br/><p>‘Master Lin appears at the Kunlun Mountain Martial Arts Meet and erupts in a frenzy. How could anyone not submit?’</p><br/><p>Many people saw this thread and were curious, wondering what was up with this Master Lin.</p><br/><p>But when they clicked the thread, they were completely dumbfounded.</p><br/><p>A three-hour long video which had not been edited at all. To these crazy martial arts fanatics, it wasn’t dull at all to watch it from beginning to end in one go.</p><br/><p>And after this thread appeared, there were no replies within the first three hours.</p><br/><p>But after three hours, the thread completely blew up.</p><br/><p>“D*mn, is this real? This is way too domineering. Is this real or is it made using special effects?”</p><br/><p>“It definitely wasn’t made using special effects. It came from a certain broadcast. It’s 100% genuine.”</p><br/><p>“My God. This Master Lin is defying nature. He’s so domineering.”</p><br/><p>“Can any boss tell us how many styles of martial arts Master Lin displayed?”</p><br/><p>“I’m known as someone who understands martial arts completely but I have to say that I only managed to understand sixty-seven styles of martial arts. As for the rest, I couldn’t figure it out. But according to the report from that side, Master Lin displayed close to two hundred martial arts styles. It’s several tens more than the number of styles authenticated by our country. How scary is that?”</p><br/><p>“I think this authentication was done in the eighties. Afterward, they stopped gathering information about this. I have to say that the country doesn’t really value our martial arts.”</p><br/><p>“Amazing. My blood is boiling after watching the video. I heard that Master Lin is the Shanghai association’s Vice-President. I want to look for Master Lin and ask him to take me as his disciple.”</p><br/><p>“^Don’t be absurd. Master Lin doesn’t take disciples.”</p><br/><p>“He doesn’t take disciples? My net worth is a few hundred million. I’ll give him half of my wealth and ask him to take me as his disciple. Do you think it would be a problem?”</p><br/><p>“Hahaha. I’m not looking down on you but even if you place all your wealth in front of Master Lin, I’ll take it as my loss if you can get Master Lin to even glance at you. I think you should just go to sleep. Stop bragging.”</p><br/><p>“Yeah. You don’t even know Master Lin’s identity and you’re bragging to us over here. Go and do some research.”</p><br/><p>To them, Master Lin was a f*cking awesome character. He had opened a shop in Shanghai and that street had become a must-visit place in Shanghai. His capability was unmatched.</p><br/><p>To them, if Master Lin was willing, there would probably be countless people who would invest in his business.</p><br/><p>And this guy was thinking of becoming Master Lin’s disciple by offering half of his wealth. That was simply a dream.</p><br/><p>Shanghai Satellite TV Network’s Chief.</p><br/><p>“Kunlun Mountain Martial Arts Meet. This has a great selling point.” He had an idea. If it could succeed, perhaps he would be able to reach a new peak in viewership.</p><br/><p>However, he still couldn’t figure it out yet. He had to think it through properly.</p><br/><p>When that happens, if he could invite Master Lin over, their viewership would be guaranteed.</p><br/><p><em>I have to plan it out properly.</em></p></div>\n</div>"}