{"title": "Chapter 1117 - How awesome is that?", "id": 1117, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1117-how-awesome-is-that", "volume_title": "Volume 12", "body": "<h1>Chapter 1117 - How awesome is that?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Watching Master Lin’s back view as he left.</p><br/><p>Zhou Qing stood in his original position, completely dumbfounded. Then, he looked at the video recorded on his phone and he couldn’t wait to post it.</p><br/><p><em>Domineering. This is way too domineering.</em></p><br/><p>He had destroyed the association and still wanted them to pay for his airplane ticket. He was simply not letting them live at all.</p><br/><p>Then, Zhou Qing glanced at the situation in the conference hall. Vice-President Jiang was straining his throat, screaming and shouting that he had been wronged. He had really been hurting but after Master Lin left, he suddenly stopped hurting.</p><br/><p>Meanwhile, the other people in the association started viewing Vice-President Jiang in a different light. They felt as if this whole thing was an act.</p><br/><p>Initially, when they had seen him lying on the ground and screaming, they had thought that Master Lin had really gone hard on him and it had made them furious. After all, this was their association. If Master Lin bullied someone in front of them, wouldn’t it mean that he didn’t have any respect for them?</p><br/><p>But now, just as Master Lin left, Vice-President Jiang had bounced back up with vigor and he looked perfectly fine. This really made them speechless. <em>Even if you want to act, you should act a little longer. You can’t just stand up like nothing is wrong right after he left.</em></p><br/><p>Zhou Qing had recorded this scene and he was going to post it on the Internet later on. He would be able to create another stir.</p><br/><p>The netizens were getting anxious from waiting.</p><br/><p>“Ah, what exactly is going on? How is Master Lin’s discussion with the Beijing association going?”</p><br/><p>“Yeah, I’m dying from the suspense.”</p><br/><p>“A minute has passed long ago. Could it be that Master Lin has crushed the association and even the Internet celebrity has been innocently attacked?”</p><br/><p>“It’s possible. It’s very likely. I never thought that reporting the news for us would actually involve life risks. This is really scary.”</p><br/><p>“It’s here, it’s here. Quick, go on Weibo. The video is out.”</p><br/><p>At that moment, Zhou Qing had swiftly posted the video on Weibo. The netizens immediately played the video to see what exactly had happened.</p><br/><p>But when they saw it, everyone’s jaws dropped.</p><br/><p>“D*mn. That’s too domineering. The Beijing Association President has finally cowered under the pressure from Master Lin.”</p><br/><p>“Haha, I’m dying of laughter. That guy lying on the floor was just acting. He was screaming and wailing miserably a moment ago. I didn’t think he would suddenly be alright.”</p><br/><p>“Motherf*cker. Master Lin is shameless. He bullied that person so badly and he still asked for an airplane ticket. That’s simply too shameless.”</p><br/><p>“I can laugh at this joke for a whole year. Internet celebrity, why don’t you follow Master Lin? We want to know what he’s going to do now.”</p><br/><p>Zhou Qing saw that the number of viewers had increased once again and he was delighted. When he saw that comment, he realized that he should follow Master Lin.</p><br/><p>But when he reached the association entrance, he realized that Master Lin had already disappeared long ago.</p><br/><p>At that moment, he felt a little lost.</p><br/><p>“Why didn’t I think about it from the start? Now, he’s gone.” Zhou Qing was a little regretful. If he had followed Master Lin and had a good chat with Master Lin, he would have been able to make a video. How great would that have been? His number of viewers would have been able to soar even higher.</p><br/><p>Shanghai association.</p><br/><p>Jiang Fei and the rest were staring blankly as they sat there. The whole office was silent and there wasn’t even a single sound. Everyone had been shocked.</p><br/><p>“This… Jiang Fei swallowed his saliva and wanted to say something but he didn’t know what to say.</p><br/><p>Instead, Wang Yun Jie spoke, “Does this mean that our President Niu doesn’t have to be transferred away now?”</p><br/><p>Jiang Fei nodded. “Mmm. I think so. Didn’t you watch the video? I think that President Chen said that he wouldn’t be transferred anymore.”</p><br/><p>“Haha,” Wang Yun Jie laughed. “Master Lin is really too awesome. He actually managed to make the association lower their heads like this and change their order. I have no choice but to submit to him now.”</p><br/><p>“Let’s go. We have to hurry up and inform President Niu. He probably doesn’t know about this.” Jiang Fei stood up. He was quite excited as he thought about telling President Niu about this.</p><br/><p>President Niu had put in his all since coming to the Shanghai association and he had painstakingly built up the association gradually. If he were to get transferred, even if he was even more positive, he definitely wouldn’t be happy.</p><br/><p>But things were good now. Everything had been resolved and he didn’t have to leave the Shanghai association anymore.</p><br/><p>Communications were the hardest part. It hadn’t been easy for them to establish rapport with President Niu. If he were to get transferred and another President were to come, they felt that it would be really hard to communicate.</p><br/><p>“Right, right. We have to inform President Niu. But do you think we should speak the truth?” Wang Yun Jie said worriedly, “If we speak the truth, President Niu would definitely think that President Lin charged over to the headquarters single-handedly to cause a big ruckus all for him. He would definitely feel guilty.”</p><br/><p>Jiang Fei pondered for a moment before replying, “Let’s not tell him for now. We’ll say that the Beijing association has changed their minds. As for whether he will find out in the future, let’s leave that for the future.”</p><br/><p>“Alright. We’ll do that then.” Wang Yun Jie took a sip of tea before following Jiang Fei out to look for President Niu.</p><br/><p>The airport.</p><br/><p>Lin Fan went straight to get his ticket. His heart was hurting very much. Buying a ticket for a same-day flight was very expensive. Although he had some money now, he couldn’t play around like this.</p><br/><p>His money had been earned by selling his scallion pancakes one by one.</p><br/><p>But now, the situation had been resolved and he felt relieved. President Niu had to stay in Shanghai. How could those people just do whatever they wanted?</p><br/><p>Perhaps most people would be able to take it and accept their orders. However, since Lin Fan had met with this situation, of course he couldn’t take it.</p><br/><p>Then, Lin Fan took out his phone and made a Weibo post.</p><br/><p>“This matter ends here. As for other self-proclaimed righteous people, don’t challenge me casually. I’m a petty person and I will very likely meet you face-to-face to chat.”</p><br/><p>When this Weibo post was sent, a large number of comments from the netizens were instantly drawn. Moreover, the netizens couldn’t stop giggling when they saw it.</p><br/><p>“I’m dying of laughter. Master Lin is taking a prevention jab beforehand.”</p><br/><p>“That’s for sure. No matter what, the Beijing association is the headquarters. There will definitely be people who can’t get used to Master Lin’s actions and they will criticize him on the Internet. Now, Master Lin is saying bluntly that he will take it seriously if they criticize him.”</p><br/><p>“If Master Lin didn’t go straight to the Beijing association, perhaps there would really be people criticizing Master Lin on the Internet. But now that this has happened, those people probably have to think twice about whether they should do it.”</p><br/><p>“Well said. Master Lin’s formidable and domineering way of doing things has already shocked everyone. I can’t help but admire Master Lin. Who else would dare to be so unbridled?”</p><br/><p>“That’s the Beijing association. There are lots of big figures over there. Now that not a single one of them dares to speak out, it proves that our Master Lin is really f*cking awesome.”</p><br/><p>…</p></div>\n</div>"}