{"title": "Chapter 1116 - Simply a waste of my time", "id": 1116, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1116-simply-a-waste-of-my-time", "volume_title": "Volume 12", "body": "<h1>Chapter 1116 - Simply a waste of my time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Weibo.</p><br/><p>Zhou Qing’s fingers were trembling a little as he posted the video that he had just recorded. He was in shock. He hadn’t expected Master Lin to really make a move on them.</p><br/><p>This was really nature-defying. They had to submit to him.</p><br/><p>The netizens who had been paying attention saw this video and sucked in a breath of cold air.</p><br/><p>Amongst them, Lin Fan’s fans were gasping in shock.</p><br/><p>“D*mn. Master Lin has erupted. That Vice-President is really stupid. Why wouldn’t our Master Lin dare to hit him? He even spontaneously offered his face for Master Lin to hit. Isn’t that asking for death?”</p><br/><p>“When I saw this video, I nearly laughed out loud.”</p><br/><p>“Haha, I’m dying of laughter. I’m giving Master Lin a thumbs up. His f*cking awesomeness needs no explanation.”</p><br/><p>“Master Lin is really domineering. He said that he would crush them if they didn’t answer him in a minute. Who else would dare to say something like that? I think the only one who would dare to say it is Master Lin.”</p><br/><p>“Boss, please continue recording videos. Let us see what happens next.”</p><br/><p>At the Shanghai association, Jiang Fei and Wang Yun Jie weren’t the only ones following the incident. Even the normal members were following it. When they saw the video, they were completely dumbfounded.</p><br/><p>“That looks like Vice-President Jiang. He came to our Shanghai association before. I still remember that he was really arrogant back then.”</p><br/><p>“I remember. Back then, our Vice-President Guo just followed behind him and did whatever he said. Now that he’s been beaten down by Master Lin, it makes me want to laugh.”</p><br/><p>Lin Fan looked at the time. “Hurry up. There are twenty more seconds.”</p><br/><p>“Ah! Lin, you actually dare to hit me. I’m going to call the police to capture you,” Vice-President Jiang yelled as he felt an excruciating pain in his shoulder.</p><br/><p>President Chen stared blankly at the scene. He hadn’t expected this Master Lin to really act out violently. How was this possible? Anyone in his right mind would know that hitting others was not right.</p><br/><p>But to President Chen, this Lin seemed perfectly normal and his brain seemed normal too. He was very clever but he had actually beaten someone in front of a crowd and in front of a leader. This was really hard to understand.</p><br/><p>“Ah, this is just a small matter. Why did it have to come to this?” the Beijing leader tried to mediate as the middleman. This matter had developed in a strange way to him. However, if he had to take sides, of course he would take the side of the strong.</p><br/><p>To him, this Master Lin was very strong.</p><br/><p>Hence, he only had one thought in his mind: <em>Those association people must have made a mistake.</em></p><br/><p>Lin Fan took a glance at Vice-President Jiang and completely ignored him.</p><br/><p>President Chen was feeling helpless. “Master Lin, you can’t just hit someone. We are a martial arts association, we can’t bully others using our martial arts. We really should discuss this matter nicely.”</p><br/><p>“Ten more seconds.”</p><br/><p>“Master Lin, the impact of this matter is really not good. Regarding the order, we need to investigate properly too.” President Chen was getting anxious and helpless. <em>How can someone be like this?</em></p><br/><p>“Alright, time’s up. I’m going to start crushing. Please prepare yourselves.” Lin Fan started stretching his muscles.</p><br/><p>A creaking sound rang out. It was the sound of his muscles and bones moving.</p><br/><p>“We’ll change. We’ll change the order.”</p><br/><p>Just as Lin Fan was about to make a move, President Chen spoke in a panic. It was as if he didn’t even consider it. He had already given in.</p><br/><p>At the same time, he swore to the heavens that he definitely wouldn’t come into contact with this Lin in the future. This Lin was completely unreasonable and he had caused grief to President Chen.</p><br/><p>When those words had been said, President Chen heaved a sigh.</p><br/><p>Lin Fan smiled. “That’s more like it. What was the point of letting the situation develop to such a stage? We’re all cultured people and we shouldn’t fight. Alright, President Chen, I shan’t disturb your conference anymore. Please carry on.”</p><br/><p>“My dear leader, thank you for the support. If you come to Shanghai in the future, give me a holler.”</p><br/><p>When the leader heard that, he smiled and nodded. “Okay, okay. I really do want to have a good exchange with Master Lin.”</p><br/><p>Lin Fan turned around and waved. “I’ll be saying goodbye now, everyone. That door at the main entrance has been struck down but it shouldn’t be broken. If you reinstall it, it should still work.”</p><br/><p>After saying that, Lin Fan left.</p><br/><p>The people at the scene looked at each other. They seemed to be in a daze.</p><br/><p><em>What the heck was that?</em></p><br/><p>“F*ck! How impudent. He’s really too impudent. As the Shanghai association Vice-President, how could that guy be like this?”</p><br/><p>Some of the people who had stayed neutral before started standing out and speaking in harsh voices.</p><br/><p>Previously, Lin Fan had been here and they hadn’t dared to say much. But now that Lin Fan had left, they were fearless.</p><br/><p>Regarding this matter, they had really given in. Their President had been forced to surrender. This made them feel helpless.</p><br/><p>It was mainly because they weren’t able to win Lin Fan in a fight. If they could, things would not have turned out like this.</p><br/><p>“Hey, it doesn’t hurt anymore.” At that moment, Vice-President Jiang stood up and moved his body around. Everything felt normal.</p><br/><p>His shoulder was fine now. Previously, it had been hurting badly.</p><br/><p>But suddenly, he realized that something wasn’t right. He felt countless gazes lock on to him.</p><br/><p>The association members immediately started whispering amongst themselves.</p><br/><p>“D*mn, Vice-President Jiang is such a coward. He was rolling around in pain just a while ago but once Master Lin left, he’s perfectly fine.”</p><br/><p>“His acting was too real. I really thought that Master Lin struck him hard. Who knew it was fake?”</p><br/><p>“Sigh. I didn’t think that Vice-President Jiang would be so afraid of Master Lin that he would just lie on the ground and act like he was done for.”</p><br/><p>“Master Lin is Master Lin after all. He completely shocked Vice-President Jiang.”</p><br/><p>“I’ve had a big change in my impression of Vice-President Jiang. He used to be so imposing but when he met Master Lin, he screamed in pain like a coward.”</p><br/><p>When Vice-President Jiang heard all these small voices, he felt humiliated. He strained his voice as he shouted.</p><br/><p>“It’s not what you think. I was really in excruciating pain just now.”</p><br/><p>Everyone nodded, expressing that they understood. After all, the opponent had been Master Lin. It was very normal to be afraid.</p><br/><p>But looking at the crowd’s expressions, Vice-President Jiang felt a fury in his heart. These f*cking <em>…</em></p><br/><p><em>Forget it, forget it.</em></p><br/><p>Vice-President Jiang had admitted defeat. What else could he say? All he could say was that he hadn’t been acting. He had really been in excruciating pain.</p><br/><p>At that moment, he saw President Chen looking at him as if to say: <em>You’re really awesome. </em>Vice-President Jiang had an urge to puke out blood.</p><br/><p>In the end, everyone thought that he had been acting.</p><br/><p><em>F*ck!</em></p><br/><p><em>Must all of you be like this?</em></p><br/><p>Outside.</p><br/><p>Zhou Qing saw Master Lin come out and he immediately went forward.</p><br/><p>“Hello, Master Lin. I’m an Internet celebrity on Weibo. May I know if you have anything to say regarding this matter?”</p><br/><p>Lin Fan shook his head. “I have nothing to say. It was simply a waste of my time and my airplane fee. I didn’t even ask them for money.”</p><br/><p>Zhou Qing: “…”</p></div>\n</div>"}