{"title": "Chapter 1129 - Brother is f*cking awesome", "id": 1129, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1129-brother-is-fcking-awesome", "volume_title": "Volume 12", "body": "<h1>Chapter 1129 - Brother is f*cking awesome</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Wang Ming Yang looked at his brother in astonishment. He hadn’t expected his brother to splash water on the opposite party’s face without hesitation.</p><br/><p>The opposite party was the young master of Huaizhou’s Chu Family, the future inheritor of a huge business empire.</p><br/><p>Even though Wang Ming Yang had become very reputable in Shanghai, it was difficult for him to go against this person.</p><br/><p>Initially, when this person had come, Wang Ming Yang hadn’t known how to resolve this. As for submitting to the opposition, he definitely wouldn’t do it. Even if he were to lose his whole fortune and become bankrupt, he would never submit to anyone.</p><br/><p>“Ming Yang,” Lin Fan spoke.</p><br/><p>“Yeah?” Wang Ming Yang looked at Lin Fan, wondering what his brother had to say.</p><br/><p>“I have to say this. He brought a few people into your territory and you let him bully you? In the future, when you come across such situations, there’s no need to think twice. Just teach him a lesson first before you do anything else. If anything happens, you still have me, don’t you?”</p><br/><p>Lin Fan shook his head helplessly. This brother of his had gotten nervous so easily. The opposition had come into his brother’s territory but his brother was actually a little frightened. That wasn’t his style at all.</p><br/><p>Chu Shen stood rooted to the ground as if he was dumbfounded. It seemed as if he couldn’t believe that this guy would dare to do such a thing to him.</p><br/><p>“Master Lin, you’ve gone overboard.”</p><br/><p>He growled in a deep tone. A flame had burned up in his heart. He had a kind of indescribable fury in him. As Huaizhou’s Chu Family’s young master, he was a business emperor in Huaizhou. Who knew how many people’s lives revolved around him?</p><br/><p>Even some leaders would be extremely respectful towards him.</p><br/><p>Because one word from him could affect these leaders’ careers.</p><br/><p>No matter where he was, he would be treated as a high and mighty being.</p><br/><p>“Overboard? You must be joking with me,” said Lin Fan with a laugh. He would never care about anyone’s status. He wasn’t bothered at all by how capable this person was.</p><br/><p>Wang Ming Yang had wanted to tell his brother about this guy’s background and identity. However, he felt that he would make his brother lose face if he were to say it, so he resisted the urge.</p><br/><p>Also, he was prepared. If some kind of big problem were to arise out of this, he would bear the responsibility together with his brother.</p><br/><p>The bodyguards behind Chu Shen looked at Lin Fan. If it had been an average person, they would’ve made a move on him long ago. But now, they didn’t dare to do anything at all because the person standing in front of them was a publicly recognized master in the martial arts world.</p><br/><p>This Master Lin had even been called the chief of the martial arts circles at the exchange meet at Kunlun Mountain.</p><br/><p>Lin Fan looked at Chu Shen’s enraged expression and couldn’t help but laugh. “Tell me. Why were you looking for my brother?”</p><br/><p>Chu Shen wiped the water from his face. He didn’t divert his gaze at all as he stared straight at Lin Fan. His expression gave off a sense that he was not giving in.</p><br/><p>“Master Lin, you really are amazing. Are you not going to give me any face at all?”</p><br/><p>He didn’t answer Lin Fan’s question as he spoke in a cold tone.</p><br/><p>He knew that this Master Lin was quite capable. Although he had no money and authority, he had a great influence on the Internet and on the society.</p><br/><p>“What do you mean by ‘face’?” Lin Fan asked curiously. Then, he looked at Wang Ming Yang. “Ming Yang, he says that I should give him face. What do you think this ‘face’ means?”</p><br/><p>Wang Ming Yang looked at Lin Fan as his heart started thumping. His brother was going all the way this time. However, to him, this felt f*cking great.</p><br/><p>This Chu Shen was a big shot who had come here and acted impudently. Wang Ming Yang had actually been suppressed by the opposition and hadn’t known what to do. However, his brother had come and put the opposition back in his place.</p><br/><p><em>Awesome. This feels way too awesome.</em></p><br/><p><em>But this feels a bit like I’m bullying others using my relationship with my brother. Cheh! What am I thinking? That’s not it. It’s just that my brother is f*cking awesome and I’m basking in some of his light.</em></p><br/><p>“I don’t know. How much does this ‘face’ cost? Give me one of those,” said Wang Ming Yang with a chuckle. He looked at Chu Shen proudly as if to say ‘Come at me. If you dare, come at me. With my brother here, I’m not afraid of you.’</p><br/><p>To Chu Shen, this proud expression was really infuriating.</p><br/><p>“You guys…” Chu Shen clenched his teeth furiously. His eyes seemed like they were emitting flames. “Master Lin, you’ve gone overboard. Do you really think you can act lawlessly as long as you’re in Shanghai?”</p><br/><p>“That’s right. You’re right. I can act lawlessly in Shanghai and you can’t do anything about it,” Lin Fan spread his arms open and said in a helpless tone.</p><br/><p>When Chu Shen looked at Master Lin, he had an urge to viciously beat Master Lin up but he resisted it.</p><br/><p>He wanted to reason with Master Lin right now but Master Lin was playing around with him.</p><br/><p>The situation had suddenly changed.</p><br/><p>He could play around with Wang Ming Yang as he liked.</p><br/><p>But as for this Master Lin, he felt helpless. It was as if he had no idea where to even start.</p><br/><p>“Master Lin, you run a shop along Cloud Street. You…”</p><br/><p>Before he could finish, Lin Fan interrupted.</p><br/><p>“What is it? Are you going to buy the whole of Cloud Street and chase me away? Go ahead. If you have the money, please buy it, boss. I don’t mind. But I wouldn’t be able to guarantee that you would be able to buy it,” said Lin Fan with a slightly regretful tone.</p><br/><p>Chu Shen’s face turned completely red. Just as he wanted to say something more, one of the bodyguards behind him leaned over and whispered.</p><br/><p>“This Master Lin is not simple. He’s very strong. We can’t win against him in a fight. Chief, let’s go.”</p><br/><p>Hearing that, Chu Shen became even more furious.</p><br/><p>“Not simple? Do you think he dares to hit me?”</p><br/><p>*Slap*</p><br/><p>Just as those words were said, a crisp slapping sound rang out.</p><br/><p>At that instant, the scene turned completely silent.</p><br/><p>Wang Ming Yang’s eyes gaped wide open as he stared blankly at Lin Fan. He hadn’t expected his brother to really make a move.</p><br/><p>Meanwhile, those bodyguards were stunned as well. They stood rooted to the ground and didn’t know what to do. Their boss had just been hit.</p><br/><p>Lin Fan flicked his hand. “What a cheap person. Why did you have to challenge me?”</p><br/><p>“You…” Chu Shen turned his head around and glared at Lin Fan with a maniacal look. “You actually dare to hit me.”</p><br/><p>“Why wouldn’t I dare? Ming Yang, why is he here?” Lin Fan looked at Wang Ming Yang and asked.</p><br/><p>Wang Ming Yang was still in shock. “He came to see if I dare to beat him until he looks like a pig.”</p><br/><p>Lin Fan nodded. “That means he came to ask for a beating. And now he’s asking me if I dare to hit him?”</p><br/><p>Then, Lin Fan went forward, extended his hand and patted Chu Shen’s cheek. “Kid, let me tell you this. Ming Yang is my brother. If you bully him, you’re bullying me. Anyone he wants to beat up is someone I want to beat up. You asked him if he dares to beat you until you look like a pig. I’m telling you now that he dares. And he’s not the only one that dares. I dare too. So, is there still anything you’re unhappy about?”</p></div>\n</div>"}