{"title": "Chapter 1140 - This is too fast, isn’t it?", "id": 1140, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1140-this-is-too-fast-isn%E2%80%99t-it", "volume_title": "Volume 12", "body": "<h1>Chapter 1140 - This is too fast, isn’t it?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“D*mn. This makes me a little excited.”</p><br/><p>Lin Fan looked at the equipment all around as well as the materials and was a little moved. He really didn’t understand all these but the knowledge in his mind was no joke.</p><br/><p>Developing those things was not a problem at all. And they would even be much more impressive than those artificial limbs that currently existed.</p><br/><p>“Alright, let’s get to work. High-tech goods will soon be produced by my hands.”</p><br/><p>Outside!</p><br/><p>The secretary was a little doubtful. “Chief Wang, do you think that Master Lin will really be able to develop them?”</p><br/><p>Wang Ming Yang smiled. “Who knows? Of course, it’d be good if he does but if he isn’t able to, it wouldn’t be a problem either. In the future, I would have something to ridicule him about.”</p><br/><p>“Huh?” The secretary’s mouth gaped. She really couldn’t understand rich people. <em>So much has been spent. Isn’t he worried about the outcome of the production?</em></p><br/><p>Sometimes, the employees would gossip amongst themselves. <em>What kind of relationship does Chief Wang and Master Lin share exactly? Could it be ‘that’ kind of relationship?</em></p><br/><p>But they would stop their gossiping there because it simply wasn’t possible. It was the kind of situation that would only happen in legends.</p><br/><p>Wang Ming Yang took a last glance before shutting the door. Then, he left with a smile.</p><br/><p>He was no longer responsible for what was left. It was his brother’s responsibility now. He wouldn’t be able to help anyway.</p><br/><p>On the Internet.</p><br/><p>Many netizens were discussing. After so many days, Master Lin had posted on Weibo again. He had even said that the research lab had been prepared and he was going to start developing the perfect artificial limbs.</p><br/><p>“This…”</p><br/><p>“I don’t even know what to say anymore. It looks like Master Lin won’t rest until he dies.”</p><br/><p>“Things had already quietened down but Master Lin has stirred things up again.”</p><br/><p>“Actually, I still believe in Master Lin. The research lab has already been prepared anyway, so let’s just wait and see. He might really be able to succeed.”</p><br/><p>“Do you really still believe that?”</p><br/><p>“I do. I’ve been following Master Lin’s Weibo from the start until now. There have been many things that people thought were not possible but still happened because of Master Lin’s mysticality. That’s why I believe him.”</p><br/><p>The netizens who had been following Lin Fan all along chose to believe him and some of them were even in eager anticipation, wondering what exactly Master Lin would produce.</p><br/><p>Meanwhile, some artificial limb specialists looked at him with tremendous disdain. <em>What a show-off. He has no idea what he’s doing.</em></p><br/><p>They didn’t even want to scold Lin Fan anymore. They felt that it was simply a waste of time.</p><br/><p>At a certain artificial limb company.</p><br/><p>This company specialized in producing artificial limbs. Some of the workers in the production department were discussing amongst themselves.</p><br/><p>“Did you see the news on Weibo?”</p><br/><p>“What news?”</p><br/><p>“I’m talking about that news on Weibo. Master Lin wants to develop perfect artificial limbs.”</p><br/><p>“Cheh. Do you believe that nonsense?”</p><br/><p>“Shhh. Our team leader is coming.”</p><br/><p>This matter had gained a lot of attention on the Internet. Countless people were discussing it.</p><br/><p>To them, Master Lin had really gone mad. It made everyone dumbfounded.</p><br/><p>“Hey, after Master Lin posted this, he disappeared. Why isn’t he giving any updates? The best thing he could do is to do a broadcast.”</p><br/><p>“Are you stupid? Master Lin is already immersed in the development. How could he have time to care about all this?”</p><br/><p>“If he broadcasts it, wouldn’t it affect the development? Just wait and see.”</p><br/><p>At this moment. Cloud Street.</p><br/><p>Wu You Lan was filled with anxiety. “Do you think Brother Lin will succeed?”</p><br/><p>Fraud Tian was sitting at the entrance, smoking a cigarette as he said calmly, “He will.”</p><br/><p>Zha Zhong Yang was taken aback. “Fraud, how are you so sure?”</p><br/><p>“Hehe,” Fraud Tian chuckled. “Tell me then. Have you ever seen him fail at anything?”</p><br/><p>“You have a point.” Zhao Zhong Yang thought about it and felt that it was true. It seemed that there really wasn’t anything that Brother Lin couldn’t do.</p><br/><p>In the research lab.</p><br/><p>Lin Fan was busy working. If there was anyone else there, they would be completely astounded because the way he was working made it seem way too easy.</p><br/><p>He trusted the knowledge in the Encyclopedia. What he was making was different from the products made outside. And the price wouldn’t be high either, just a few thousand dollars for a perfect artificial limb.</p><br/><p>The next day!</p><br/><p>A full day and night passed.</p><br/><p>Wang Ming Yang came to the company and pulled the secretary over. “Has Master Lin come out yet?”</p><br/><p>The secretary shook her head. “He hasn’t. Master Lin hasn’t come out since he entered.”</p><br/><p>“What about food?” Wang Ming Yang asked. “Don’t tell me you didn’t even give him any food.”</p><br/><p>The secretary said, “I brought some food up but when I knocked on the door, there was no response, so I left it outside.”</p><br/><p>“D*mn, my brother is defying nature. Go on with your work. I’ll go up to take a look at the situation.” Wang Ming Yang couldn’t quite understand what his brother was doing. Even if he was addicted to working, he had to come out for a meal and some fresh air.</p><br/><p>But when Wang Ming Yang reached the top floor, he saw the food outside the door.</p><br/><p>“Sigh, is he trying to become immortal?” Wang Ming Yang felt helpless. Then, he entered the passcode.</p><br/><p>But when he entered, he noticed a figure that was busy typing nonstop on the keyboard.</p><br/><p>“What are you…” Wang Ming Yang had just opened his mouth when he noticed those artificial limbs placed in front and he was completely stunned. It was as if he had seen a ghost.</p><br/><p>*Creak!*</p><br/><p>*Creak!*</p><br/><p>Those artificial limbs were moving automatically without anything manipulating them.</p><br/><p>“What did you come in for? Hurry up and get out. I’m not done yet.” Lin Fan became annoyed when he saw Wang Ming Yang. Then, he waved his hand.</p><br/><p>“I…I…” Wang Ming Yang was about to say something but then he was pushed out by Lin Fan.</p><br/><p>“F*ck. At least eat the food!”</p><br/><p>Wang Ming Yang yelled as he stood there. But in front of him was a door.</p><br/><p>Then, his mind was filled with what he had just seen and his face was covered with excitement.</p><br/><p>“Could it really be? Has it really been developed?”</p><br/><p>“But that was too quick, wasn’t it?”</p><br/><p>What he didn’t know was that Lin Fan hadn’t been developing it at all. It had already been developed in his mind. He had simply manufactured it.</p><br/><p>Another day passed.</p><br/><p>The netizens realized that Master Lin still hadn’t appeared.</p><br/><p>Meanwhile, the people who queued for scallion pancakes had found out that Little Boss had gone to develop artificial limbs as well and he wouldn’t be around temporarily. They were dumbfounded by that news.</p><br/><p>“Latest update. Little Boss still isn’t at Cloud Street. It looks like he has really gone to develop artificial limbs. If you ask me, I’m afraid this is going to take quite some time.”</p><br/><p>Some people took photographs of the shop and posted them on Weibo.</p><br/><p>Eastern Han Organization.</p><br/><p>Wang Ming Yang led a few big men and they were carrying a crippled little girl from Nanshan Children’s Welfare Institute. At the same time, they had brought along a wheelchair.</p><br/><p>This was what Lin Fan had requested through a call the previous day. It seemed that he wanted to initiate an experiment. If it succeeds, it would mean that the development had succeeded.</p><br/><p>However, what Wang Ming Yang couldn’t figure out was…</p><br/><p>How was it so f*cking fast?</p></div>\n</div>"}