{"title": "Chapter 1167 - Consider it his misfortune", "id": 1167, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1167-consider-it-his-misfortune", "volume_title": "Volume 12", "body": "<h1>Chapter 1167 - Consider it his misfortune</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>When Zhao Xuan heard those words, his expression changed drastically. He definitely wouldn’t doubt Ma Guo Hui’s power. If Ma Guo Hui wanted to investigate someone, he would definitely find out everything about that person.</p><br/><p>Moreover, Zhao Xuan had quite a dirty background. If he were to get investigated, things would definitely turn out badly.</p><br/><p>Thinking about that, Zhao Xuan struggled frantically. His neck turned red as he squeaked, “Let go of me! Let go of me!”</p><br/><p>He kept struggling harder and harder. It was as if he was getting nervous.</p><br/><p>The big man smiled. “Wow, kid, you’re actually trying to struggle out of my grasp. You must be dreaming.”</p><br/><p>“I’ll hold you down!”</p><br/><p>The big man was very strong. There was no way he would let such a weakling escape from his grasp. If the kid could really escape, that would really be surprising.</p><br/><p>Although this kid had been his boss previously, this boss had made him go against Master Lin. Hence, he no longer treated this boss kindly.</p><br/><p>He had nearly been made to commit a huge offence.</p><br/><p>*Ding ding!*</p><br/><p>Suddenly, a phone rang.</p><br/><p>Zhao Xuan stopped struggling. He was panicking as he stared blankly at the phone. He didn’t want to hear anything related to himself. If it was something bad, he would really be done for.</p><br/><p>Ma Guo Hui didn’t say anything as he just listened to the voice from the phone.</p><br/><p>And this phone was pretty good. Not a single sound leaked out from it.</p><br/><p>This made Zhao Xuan even more terrified as he didn’t know what the caller was saying. He was fearful that the opposite party had found out about him.</p><br/><p>His original plan had been to scam Ma Shao Hao. If Ma Guo Hui were to find out, he wouldn’t be let off easily.</p><br/><p>*Clatter!*</p><br/><p>The call was hung up.</p><br/><p>Ma Guo Hui looked at Zhao Xuan expressionlessly.</p><br/><p>Meanwhile, Zhao Xuan looked back at him, not knowing what was going on exactly. He definitely wouldn’t confess spontaneously. He had even planned to continue playing dumb.</p><br/><p>“Kid, so you’ve actually taken two lives before. That’s good. That’s very impressive.” Ma Guo Hui already knew all of it.</p><br/><p>“What are you talking about? I don’t know what you’re talking about.”</p><br/><p>Zhao Xuan’s face was white as paper as he cried out. He definitely wouldn’t confess.</p><br/><p>Lin Fan said, “Chief Ma, what are you planning to do? Do you want to take him away?”</p><br/><p>Ma Guo Hui smiled. “Master Lin, I run a proper business. This Zhao Xuan has actually taken lives before. I definitely have to take him to the police. I already have the evidence and I even have his identity. I really have to thank you for this, Master Lin. If it weren’t for Master Lin, I really wouldn’t have known that my stupid brat has been mixing with someone like this. Who knows how things would have turned out?”</p><br/><p>Lin Fan smiled. In reality, his warning wasn’t necessary. With Ma Guo Hui’s capability, he would have investigated Zhao Xuan sooner or later.</p><br/><p>But Lin Fan just made it sooner.</p><br/><p>“Let me go!” Zhao Xuan barked. He didn’t doubt Ma Guo Hui’s words. Although he had wiped his trail cleanly, he believed that Ma Guo Hui had definitely found something.</p><br/><p>“Come in.”</p><br/><p>At that moment, two big men walked inside. Judging by their physiques, it seemed that they were Ma Guo Hui’s bodyguards.</p><br/><p>“Grab him and send him to the police station later.”</p><br/><p>“Yes, Boss.”</p><br/><p>Zhao Xuan panicked when he saw this. He wanted to run away, but with so many big shots in front of him, he could only dream of escaping.</p><br/><p>In the broadcast room.</p><br/><p>“D*mn. This is for real? This guy has taken lives before?”</p><br/><p>“Looking at the situation, it’s probably true. I didn’t expect that big shots these days were so powerful. He actually found out everything about him so quickly. That’s too scary, isn’t it?”</p><br/><p>“That’s why keyboard warriors are so dangerous. They can definitely find out all about you if they want to.”</p><br/><p>“That’s true. 6666… I didn’t expect that I would see such a scene on Brother Yang’s broadcast. This is really eye-opening.”</p><br/><p>“I thought that this guy would get taken away by the big shot to be dealt with. I didn’t think he would be sent to the police station instead.”</p><br/><p>“F*ck. You must be living in the past. This is a peaceful society we live in. He wouldn’t just carry out that kind of private punishment. That’s illegal. Sending him to the police is the wisest choice.”</p><br/><p>“That Ma Shao Hao is really fortunate to have come across Master Lin.”</p><br/><p>Zhao Zhong Yang looked at the comments in the broadcast room and laughed happily. It seemed that his Internet buddies were very pleased with the broadcast.</p><br/><p>“Master Lin, why don’t you come with me? I have to do the honors as a host,” said Ma Guo Hui. He really wanted to get to know Master Lin better.</p><br/><p>At the same time, he had a rough idea of Yun Xue Yao’s relationship with Master Lin.</p><br/><p>If Yun Xue Yao could really be together with Master Lin, that would be a pretty good thing.</p><br/><p>“Next time. Right now, I’m just here to have some fun with my staff. If there is time in the future, it would be great if Chief Ma could come over to Shanghai to have some fun too,” said Lin Fan with a smile.</p><br/><p>Then, Ma Guo Hui turned to Ma Shao Hao. “Brat, hurry up and thank Master Lin.”</p><br/><p>“Huh?” Ma Shao Hao was stunned. <em>What the f*ck? Nothing happened and I’m supposed to thank this guy? What the f*ck is going on?</em></p><br/><p>Zhao Xuan was his friend. Although he wasn’t reliable, there was no need to capture him just like that. At the very least, the situation should be explained.</p><br/><p>However, Ma Shao Hao knew that he was f*cked. When he went home, he might receive a harsh beating from his father.</p><br/><p>“What do you mean ‘Huh’? Are you disobeying me?” Ma Guo Hui glared at him. To Ma Shao Hao, this glare was filled with ferocity. It seemed as if his father wanted to take his life.</p><br/><p>Ma Shao Hao was most fearful of his own father. Hence, he didn’t dare to disobey.</p><br/><p>“Thank you.”</p><br/><p>Lin Fan smiled and didn’t reply.</p><br/><p>Ma Guo Hui looked at the situation and had a rough idea of what was going on. “Master Lin, I shan’t disturb your dinner any further. Let’s get together in the future when we have the chance.”</p><br/><p>“Mmm. Alright. Let’s do that.”</p><br/><p>Very soon, Ma Guo Hui left with his people. As for Ma Shao Hao, he now understood that he had no chance of getting revenge for that slap and that shoulder throw in this lifetime.</p><br/><p>“It’s finally settled.” Lin Fan let out a deep sigh. So many problems had popped up just when they were having one meal. It really made him helpless.</p><br/><p>Of course, there was a reason he had done all this. After all, these incidents were related to Yun Xue Yao. Hence, it was best to kill off all the problems in one go.</p><br/><p>As for that Zhao Xuan, it could be considered his misfortune to have come across Lin Fan here.</p></div>\n</div>"}