{"title": "Chapter 1179 - Everyone was stunned", "id": 1179, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1179-everyone-was-stunned", "volume_title": "Volume 12", "body": "<h1>Chapter 1179 - Everyone was stunned</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Lil’ Zhuang, weren’t you in a coma?”</p><br/><p>Some villagers asked in shock. How did Zhou Zhuang awaken? That did not make any sense at all.</p><br/><p>Zhou Zhuang felt a little weak, but Lin Fan managed to help him recover gradually.</p><br/><p>“This is Master Lin, who helped me get out of that. How could you smash his car?”</p><br/><p>“Huh?” The villagers who were smashing the car stopped. They did not expect that at all.</p><br/><p>The man was actually here to save Lil’ Zhuang and they actually smashed his car. How could they be so rash?</p><br/><p>Then, Wang Qin cried. She felt humiliated. “How could you do that?”</p><br/><p>“Hey, don’t cry. We… Sigh, who said that earlier? Why didn’t he make sure of that before announcing it?”</p><br/><p>They really did not know what to do. If they knew earlier, they would not have done that at all.</p><br/><p>Lil’ Zhuang was their good friend. Lin Fan actually saved him but they smashed his car. That… ( .c om )</p><br/><p>“Brother and sister, it’s our fault this time. We were too rash.”</p><br/><p>“Also, Master Lin, thank you for saving Lil’ Zhuang. We did not do that on purpose. Really.”</p><br/><p>Lin Fan looked at the villagers and realised that they felt really guilty. He smiled. “It’s okay. Since it’s a misunderstanding, we don’t have to explain too much. However, please do not be so rash in the future.”</p><br/><p>He could tell that the villagers were not very wealthy, and some of them were wearing pyjamas with holes in the fabric.</p><br/><p>“No, we have to pay. We have to pay the fees needed to repair Master Lin’s car.”</p><br/><p>Some of the villagers said that after feeling remorseful for wrecking his car.</p><br/><p>Lin Fan looked at the car and realised that the damage was not very significant. Hence, he did not even think about asking the villagers to pay.</p><br/><p>“No, it’s fine. Just don’t be so rash in the future,” Lin Fan said.</p><br/><p>However, he realised that he did not think through his actions thoroughly. He actually came into this woman’s house in the middle of the night. Obviously, people would think of it that way.</p><br/><p>From this, he could tell that the villagers were really united.</p><br/><p>Then, Lin Fan and Zhou Zhuang talked for a little while before he entered his car and was prepared to drive off.</p><br/><p>However, just as the car was about to turn away, someone stood in front of it.</p><br/><p>“Master Lin, you can’t leave yet. We have to thank you for saving Lil’ Zhuang.”</p><br/><p>“Yeah, it’s a huge favour.”</p><br/><p>Lin Fan wound the windows down and replied, “It’s okay. I have to rush back to Shanghai. I have things to settle there.”</p><br/><p>“Master Lin, wait.”</p><br/><p>Then, some of the villagers rushed back.</p><br/><p>He did not know what the villagers were up to.</p><br/><p>He was exhausted after such a long drive, but he was happy to have been able to help a family. At the same time, he managed to help a child stay with her family.</p><br/><p>Then, there were cries of chickens.</p><br/><p>The villagers carried a bunch of chickens with their legs tied together.</p><br/><p>“Master Lin, we don’t have anything valuable here. Please accept these chickens. They were raised by us.” the villagers said.</p><br/><p>Lin Fan immediately replied, “No, how can I take anything from you? Please keep them.”</p><br/><p>“No. Master Lin, you have to accept it. We just want to show our gratitude as you helped to save Lil’ Zhuang. Also, we even damaged your car, and it is entirely our fault. We’d feel uneasy if you didn’t accept it.”</p><br/><p>“Yeah, sigh, we did not even confirm things before wrecking it. We were poisoned by anger.”</p><br/><p>“Lil’ Zhuang, sorry, we didn’t know he was here to save you.”</p><br/><p>Lin Fan felt that it was probably impossible for him to leave if he did not accept the chickens.</p><br/><p>The villagers were actually pretty adorable. They felt so bad about damaging his car, and although they were rash in their actions, they were sincerely sorry about it.</p><br/><p>“Alright, I’ll accept it then. However, I’ll only take one. Please keep the rest for yourselves,” Lin Fan said, as he did not want so many chickens.</p><br/><p>However, what he did not expect was that the villagers actually opened the boot of his car and placed all the chickens in it.</p><br/><p>“Master Lin, we’ve placed them in your car.”</p><br/><p>“Just take them. We raised them ourselves and they’re really nutritious.”</p><br/><p>“Yeah.”</p><br/><p>Lin Fan sighed helplessly, “Alright, I’ll take them. It’s getting late. I’ll be leaving now. Perhaps I could see all of you again if fate brings us together. Goodbye!”</p><br/><p>Wang Qin said, “Master Lin, thank you so much for coming such a long way.”</p><br/><p>Lin Fan smiled, “It’s okay, it’s nothing much. If anyone in the village were to contract any serious illness, you may come to look for me again.”</p><br/><p>Then, he just drove off and vanished from their sight.</p><br/><p>( .c om ) The villagers surrounded her and asked, “Wang Qin, how did you know this man?”</p><br/><p>Wang Qin told them about what had happened in Shanghai and also about her desire to send her daughter to the Welfare Institute.</p><br/><p>Then, the villagers fell silent.</p><br/><p>“I didn’t expect that there exists someone as nice as Master Lin in this society.”</p><br/><p>Then, a villager who was using an old smartphone shrieked in surprise.</p><br/><p>The others were stunned after hearing that. Then, they gathered around him.</p><br/><p>“Look, isn’t that Master Lin? The Welfare Institute belongs to him and he’s a doctor. No wonder he’s so impressive.”</p><br/><p>Then, the villagers started to talk about him and forgot about resting.</p><br/><p>They didn’t expect someone so powerful to have visited their village. Furthermore, he was there to save Lil’ Zhuang’s family.</p><br/><p>They felt that he was a great man.</p><br/><p>Lin Fan shook his head helplessly as he drove when he thought about repairing his car.</p><br/><p>He wondered what he should do about the chickens in the boot. He felt that he probably had to make some chicken soup when he got back home.</p><br/><p>That seemed like the only plausible solution.</p><br/><p>The next day!</p><br/><p>At Cloud Street!</p><br/><p>Fraud Tian and the others had arrived at the store early in the morning. The townsfolk had already lined up for scallion pancakes. However, they were curious as to why Master Lin had not arrived yet.</p><br/><p>They wondered what happened to Master Lin.</p><br/><p>Then, a car stopped.</p><br/><p>Fraud Tian gasped when he saw the car. “Bro, what happened to you car?”</p></div>\n</div>"}