{"title": "Chapter 1187 - I’ll personally test it", "id": 1187, "volume": 12, "url": "http://boxnovel.org/a-valiant-life-chapter-1187-i%E2%80%99ll-personally-test-it", "volume_title": "Volume 12", "body": "<h1>Chapter 1187 - I’ll personally test it</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The doors of the laboratory were shut.</p><br/><p>Wang Ming Yang looked at them leave worriedly. Besides trusting his old friend, what else could he do?</p><br/><p>Fraud Tian said, “Don’t worry, he knows what’s going on. Nothing will go wrong.”</p><br/><p>It was the first time that Fraud Tian could say something like that calmly.</p><br/><p>“Sigh, if he knew what’s going on, he wouldn’t have agreed to do this. I am really worried,” said Wang Ming Yang. However, since they had already started on it, there was nothing that he could do.</p><br/><p>“Sorry, I caused all of you to be worried about Master Lin. If we didn’t ask for this…” Zhang Yi Jun said and looked at the laboratories that were sealed.</p><br/><p>Wang Ming Yang shook his head. “It’s okay. He’s just like that. Nobody can stop him. I’ll be leaving now. I’ll only become more anxious if I were to stay here.”</p><br/><p>The students in the academy also started to discuss it.</p><br/><p>“Director Zhao and Master Lin have begun their studies on AIDS. It’s so dangerous!”</p><br/><p>“Yeah, I wonder what the outcome will be. I hope it’s a success.”</p><br/><p>“I’m so scared that I wouldn’t dare to go to the labs again. If I see any blood stains, it would be so dangerous!”</p><br/><p>“What are you saying? Are you doubting Master Lin? I trust him a lot.”</p><br/><p>The students were really proud of their Chinese Medical Academy. After all, they had managed to eradicate a lot of illnesses.</p><br/><p>In the labs.</p><br/><p>Zhao Ming Qing was waiting for Lin Fan’s instructions. He had done his research the night before, and he knew exactly what was going on. However, that was all that he could do.</p><br/><p>“Lil’ Yuan Yuan, please stay here. I have some things to tell Grandpa Zhao,” Lin Fan said.</p><br/><p>“Ok.”</p><br/><p>Yuan Yuan sat there patiently and looked around curiously.</p><br/><p>“Teacher, where should we start from?” Zhao Ming Qing asked. Although he had some ideas, he was not sure of what to do first.</p><br/><p>Lin Fan thought about it for a moment. “Don’t worry, let me think about it. Just take a seat.”</p><br/><p>Zhao Ming Qing looked at his mentor sitting there with his eyes shut. He also followed suit.</p><br/><p>He felt that it was a great idea to think about the problem by closing his eyes. It was as if he could concentrate better.</p><br/><p>Outside.</p><br/><p>The reporters were still there waiting.</p><br/><p>“What do you think about staying here?” A reporter asked.</p><br/><p>“Yeah, I prepared a room to stay in for the weekend to wait for the outcome.”</p><br/><p>“It would be crazy if they succeeded. Perhaps the whole world would be in shock.”</p><br/><p>“Yeah, I wonder what will Master Lin come up with this time.”</p><br/><p>Besides the reporters, the townsfolk were also anxiously looking forward to it.</p><br/><p>A day passed.</p><br/><p>Some news was published.</p><br/><p>“The AIDS patient has met up with Master Lin in Shanghai.”</p><br/><p>“The study has officially begun. Let us wait for the outcome patiently.”</p><br/><p>“Master Lin said that he is really confident of eradicating it. However, nobody knows the details of it.”</p><br/><p>The headlines on Weibo were all about Master Lin. The news about other celebrities were tossed out the window, and there was no chance that they would be in the headlines.</p><br/><p>“I wonder what the outcome will be.”</p><br/><p>“I’m not really confident about it.”</p><br/><p>“I still believe in Master Lin. I think it is possible.”</p><br/><p>“Haha, this stupid Lin is asking for it. I hope he contracts this disease. That would be great.”</p><br/><p>“^ D*mn you. If you dare, announce your address. I will beat the sh*t out of you.”</p><br/><p>“This fella is just a hater. Just ignore him.”</p><br/><p>“D*mn, Master Lin is risking his life to eradicate an illness and there’s an idiot like this online. I hope he gets struck by lightning.”</p><br/><p>The netizens were discussing this matter online, and they were flaming all the haters. Even those that were not huge fans of Master Lin also showed their support for him.</p><br/><p>After all, this would be a great achievement. If they were to still hate him for it, they would be evil beings.</p><br/><p>At Shanghai Chinese Medical Academy.</p><br/><p>More people started to gather outside the school. They were all there after reading the news.</p><br/><p>The students from the academy were rather popular with the people that were gathered outside.</p><br/><p>“Bro, what’s happening inside?” A stranger asked a random student from the academy.</p><br/><p>The student replied, “Our director and Master Lin are in the midst of studying the illness in the labs. We don’t know much about it.”</p><br/><p>“Do you think they will succeed?”</p><br/><p>The student answered, “I think so. Master Lin and our director are really powerful. Nothing can stop them.”</p><br/><p>More people started to flood the place, and the reporters took the opportunity to interview more people to find out about their views.</p><br/><p>Zhang Yi Jun was really anxious, and he did not know what was going on inside. He was becoming more anxious with each passing day.</p><br/><p>If he could, he would have followed them in to watch them conduct their tests.</p><br/><p>In the labs.</p><br/><p>“Teacher, does this work?”</p><br/><p>Lin Fan replied, “No, our deductions were wrong.”</p><br/><p>The smell of the medicine in the labs was rather strong, but Lin Fan managed to make Yuan Yuan fall asleep. Also, he used the major classification of the Wuxia knowledge to help disperse the smell of the medicine so that Yuan Yuan would not be as affected.</p><br/><p>Lin Fan was not afraid to try the medicine, but Zhao Ming Qing was afraid of it.</p><br/><p>“Teacher, is it safe for you to test the medicine like this?”</p><br/><p>He was worried about his mentor. After all, the effects of this preliminary medication was unpredictable.</p><br/><p>Lin Fan smiled. “Don’t worry, I will be fine. You can continue with your work.”</p><br/><p>There was temporarily no progress because he did not have the illness. If he were to have AIDS, it would probably have aided his study of AIDS.</p><br/><p>Of course, he could not just tell Zhao Ming Qing the fact that he wanted to contract the disease.</p><br/><p>If he were to say that, his disciple would probably be shocked to death.</p><br/><p>Furthermore, he would definitely not agree to it.</p><br/><p>So he decided to extract a drop of Yuan Yuan’s blood and fuse it with his wound to see what would happen.</p><br/><p>If he could experience it personally, it would simplify things a lot.</p><br/><p>At night!</p><br/><p>Zhao Ming Qing was sleeping on a simple mattress in the lab.</p><br/><p>Meanwhile, Lin Fan went towards Yuan Yuan and poked her finger with a needle. Then, he fused a droplet of her blood with his own by opening a small cut on his finger.</p><br/><p>Then, he gently touched Yuan Yuan’s finger to remove the small wound.</p><br/><p>He felt that something foreign had entered his body and the power within his body wanted to destroy it. However, he controlled his cells so that the poison could enter his bloodstream.</p></div>\n</div>"}