{"title": "Chapter 1206 - You can have as much as you want", "id": 1206, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1206-you-can-have-as-much-as-you-want", "volume_title": "Volume 13", "body": "<h1>Chapter 1206 - You can have as much as you want</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1206: You can have as much as you want</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>The group of people sat around the dining table which was large enough to fit all of them.</p><br/><p>Lin Fan was surrounded by the ladies, and there was a wine glass in front of him.</p><br/><p>Elder Zheng nudged Yue Qiu Ju Shi with his legs under the table.</p><br/><p>Yue Qiu Ju Shi knew what was going on. They felt that Elder Lin had brought these ladies over to help distribute the amount of work he had to do. This caused them to feel helpless.</p><br/><p>The group of elderly people could not possibly win against these youngsters in drinking. In the end, they would probably be the drunk ones instead.</p><br/><p>“Elder Lin, since you’re here, Elder Zheng took out some of his most treasured wine. It’s been kept for a few decades. Your friends can drink some too.” Yue Qiu Ju Shi felt that it was fine to say that.</p><br/><p>“Yeah, yeah,” Tao Shi Gang added. The ladies seemed rather normal. If one of them had high alcohol tolerance, the elders definitely would not be able to match up to the youngsters.</p><br/><p>Lin Fan clearly knew what they were trying to do. However, he could not let the ladies become drunk.</p><br/><p>“It’s okay, they won’t be drinking. Don’t worry, I will not let them drink on behalf of me. I’ll drink a glass whenever you drink a sip. How’s that?”</p><br/><p>“Really?” Elder Zheng was so stunned that he stood up in disbelief.</p><br/><p>“Yeah, but it has to be this wine. If not, I will not drink it.” Lin Fan chuckled. He was ready to make all of them drunk.</p><br/><p>“Alright, since you said that, we will ensure that you can drink as much as you want,” Elder Zheng said and patted his own chest. He knew that even if this fellow could drink, he could not possibly finish an entire litre of alcohol.</p><br/><p>Allowing Lin Fan to finish his treasured wine was no big deal as long as he drew some artwork for them.</p><br/><p>Yun Xue Yao was a little worried. “Brother Lin, actually, I can drink too. You don’t have to drink so much.”</p><br/><p>“It’s okay. Ladies shouldn’t drink white wine. I don’t even like it anyway,” Lin Fan said.</p><br/><p>Yun Xue Yao knew she could not say anything else to convince Brother Lin. Since he said that he did not like it, she did not want to probe further, concerned that he wouldn’t be happy with her interference.</p><br/><p>“Please don’t drink too much,” Zhao Shi said. The group of elderly men was trying to drink with this youngster. It seemed a little childish.</p><br/><p>However, they could not let Lil’ Lin drink too much. After all, too much alcohol was harmful to the body.</p><br/><p>“I know myself,” Elder Zheng said. Although he really wanted Lin Fan’s artworks, he did not want Lin Fan to drink too much. They knew that alcohol was not a healthy thing to consume.</p><br/><p>Too much of it was really harmful to the body.</p><br/><p>Initially, the dining table was pretty quiet and only a few of them were drinking with Lin Fan. Elder Zheng and the others joined in later.</p><br/><p>“Elder Lin, let’s give a toast to you receiving an award,” Yue Qiu Ju Shi said.</p><br/><p>“Sure.” Lin Fan chuckled. He raised his wine glass and finished it in one gulp.</p><br/><p>“Did you really need to finish it in one gulp? We’re just kidding. Don’t take us too seriously.” Yue Qiu Ju Shi was stunned. He did not expect Elder Lin to finish the wine in one breath. If this carried on, he would probably be drunk in no time.</p><br/><p>“Why? I only drank a little. Are you guys not willing to finish the bottle of wine?” Lin Fan chuckled.</p><br/><p>Elder Zheng could not take it after hearing that. “What do you mean? Just drink. I will supply as much alcohol as you want to drink today.”</p><br/><p>It was as if they were underestimating his drinking ability. He immediately rushed upstairs and brought three more bottles of wine to the dining table.</p><br/><p>“Look, there’s three bottles here. It’s definitely enough for you to drink,” Elder Zheng said.</p><br/><p>Yue Qiu Ju Shi looked at the wine bottles and knew that they were Elder Zheng’s most precious wine. He took out all of the bottles of good wine just for Lin Fan to drink more.</p><br/><p>They felt that one bottle was enough to do the job.</p><br/><p>Lin Fan chuckled. “Haha, Elder Zheng is still as generous as before. I guess I will start drinking now.”</p><br/><p>Wu Huan Yue sneakily nudged Wu You Lan. “Can Brother Lin drink?”</p><br/><p>Wu You Lan smiled and nodded. “Yes, he can. You will see later.”</p><br/><p>She knew that Brother Lin’s alcohol tolerance was really high, but perhaps the few bottles of wine could get him drunk.</p><br/><p>Yun Xue Yao took out her phone and snapped a picture of Lin Fan and the others.</p><br/><p>At the same time, on the Internet.</p><br/><p>The television was replaying Master Lin’s award ceremony.</p><br/><p>Some of the netizens who did not watch the livestream today could watch the replay at night. When they saw what happened, they were stunned.</p><br/><p>“D*mn, what exactly happened just now? I just went to work and this happened?”</p><br/><p>“^ Are you serious? This happened a while ago.”</p><br/><p>“Hey, I did not watch it. I have a rather unique job, and I can only come home at night.”</p><br/><p>“Hahaha, Master Lin is going to be invincible.”</p><br/><p>“The main thing is that the prize presenter is the idol of our hearts. Master Lin is really so powerful that he is receiving recognition from people like him.”</p><br/><p>“Of course. Master Lin did so many great things. He helped improve the lives of countless people. We no longer need to be afraid of illnesses like this in the future.”</p><br/><p>“Yeah, it’s not that we’re the only country benefiting from it. Other countries are too. However, I know that some countries are still not very convinced with Chinese medicine, and they don’t know how to prepare the medicine. They have to get a Chinese physician to help them out.”</p><br/><p>“It’s such a wonderful sight to see. I’m so happy for him.”</p><br/><p>Lin Fan’s fans were really emotional. After all, they were really proud of Master Lin when they saw him receiving the award.</p><br/><p>On Weibo, a lot of verified celebrities started to repost the video and congratulate Master Lin at the same time.</p><br/><p>When Lin Fan used to be active on Weibo, he would often have flame wars with them, but now that something like this happened, it probably would not happen again. They knew that they were asking for death if they were to go against Master Lin.</p><br/><p>As for the celebrities that quarreled with Lin Fan before, they also surrendered and accepted that he was a powerful man.</p><br/><p>After all, what else could they say about him? He became so successful in a short time like this.</p><br/><p>They really could not afford to offend him.</p><br/><p>The shop owners from Cloud Street did not follow them along. They just watched the livestream in the day and watched the replay at night too.</p><br/><p>Some of them even pointed out to their families who Master Lin was.</p><br/><p>Everyone in their families knew who he was. They were really proud of him.</p><br/>\n</div>"}