{"title": "Chapter 1207 - Fulfilling their wishes", "id": 1207, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1207-fulfilling-their-wishes", "volume_title": "Volume 13", "body": "<h1>Chapter 1207 - Fulfilling their wishes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1207: Fulfilling their wishes</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>At that moment, at Elder Zheng’s place, the atmosphere was clearly not right.</p><br/><p><em>gulp</em></p><br/><p>That was the sound of saliva being swallowed.</p><br/><p>Elder Zheng looked at Lin Fan in horror as if he was seeing a ghost. What had he seen? This kid just drank five bottles!</p><br/><p>It wasn’t water either; it was real wine!</p><br/><p>And it wasn’t cheap wine. This wine couldn’t even be bought with money.</p><br/><p>Lin Fan raised the cup and finished it in one gulp. Then, he picked up the bottle and was about to pour another cup. However, he realized that the bottle was already empty.</p><br/><p>“Elder Zheng, the wine has run out. Is there any more?” Lin Fan looked completely normal as if there was nothing wrong at all.</p><br/><p>Yue Qiu Ju Shi and Tao Shi Gang had picked up vegetables with their chopsticks, but they had already forgotten to put the vegetables in their bowls. They were completely stunned. They wouldn’t even be this terrified if they had seen ghosts.</p><br/><p>Elder Lin had drunk five whole bottles — that was three kilograms of wine! Was he trying to scare them to death?</p><br/><p>“Elder Lin, look at this…” Elder Zheng was close to tears. What’s going on? There’s no one on Earth who could possibly drink so much. How could these five bottles be finished so quickly?</p><br/><p>Lin Fan asked curiously, “What’s there to look at? Elder Zheng, could it be that you can’t bear it? I wanted to go back to Shanghai tonight, but I came here just because you called me. If I don’t even have enough wine… Sigh, forget it.”</p><br/><p>He appeared to be disappointed, but he was laughing on the inside. You thought you could get me drunk? Think again.</p><br/><p>Whenever someone asked him to drink, he would finish the cup in one go. Now, Elder Zheng was starting to feel upset.</p><br/><p>Elder Zheng had kept these bottles of wine for a long time, and he usually couldn’t bear to bring them out. Now, Elder Lin had gulped down 5 bottles of wine on his own. If he even finished the remaining few bottles, there would really be no more.</p><br/><p>“Let’s not drink too much. It’s damaging to the body. Elder Lin, you’re still young. We should stop.” No matter what, he couldn’t let this youngster cause him any more harm. This youngster was drinking wine like it was water. It caused his heart to tremble, and he didn’t know what to think anymore.</p><br/><p>If he had known, he would never have let Elder Lin drink this wine.</p><br/><p>“Sigh. I was just starting, but you’re not letting me drink anymore. I’m never coming back here again.” Lin Fan sighed with feigned disappointment.</p><br/><p>It wasn’t that Elder Zheng didn’t want to bring out more wine but that he couldn’t bear to. If this kept going, he wouldn’t be able to take it.</p><br/><p>But at that moment, Lin Fan stood up. “Forget it. There’s no more wine and it’s getting late. It’s time to go.”</p><br/><p>“Don’t!” Elder Zheng immediately raised his hand. How could he let Lin Fan, who had drunk so much, just leave like that? Wouldn’t it mean that he had wasted all his wine? Finally, he shook his head. “Alright, I’ll get more wine. Today, I’ll throw caution to the wind and give you all my wine.”</p><br/><p>Elder Zheng gritted his teeth as he went to get the remaining bottles of wine. As he held them in his hands, his heart ached. This was good wine that he usually could not bear to take out.</p><br/><p>Today, he had run into ill-fate. He had not expected this. If he had known that Elder Lin could drink so much, he would not have brought his wine out. He had even banged his chest and told Elder Lin that he could drink as much as he wanted. Elder Zheng had brought this upon himself.</p><br/><p>“Elder Zheng, that’s generous of you! Where was I? Let’s carry on chatting,” said Lin Fan with a grin. At the same time, he looked happily at Elder Zheng’s dismay. You wanted to get me drunk? I won’t leave until I finish all your wine today.</p><br/><p>Elder Zheng looked as if he had lost all meaning in life. “Where were we? Where did we stop our conversation just now?”</p><br/><p>In his despair, he had forgotten what they had been talking about.</p><br/><p>Yue Qiu Ju Shi and Tao Shi Gang immediately came to their senses. “I think we were saying that, after this ends, everyone should draw something, and we should do an exchange. Isn’t that right, Elder Zheng?”</p><br/><p>Elder Zheng instantly regained his energy. “I think so. Let’s carry on then. We’ll talk after we’re done drinking.”</p><br/><p>Lin Fan smiled and didn’t say anything. Since he had come and drunk so much of Elder Zheng’s wine, giving away a drawing was not a problem.</p><br/><p>Elder Zheng and the rest were in such a rush to finish that they even helped Lin Fan to shoulder some of the load. However, no one besides Lin Fan could drink too much of this wine.</p><br/><p>Wu Huan Yue, Liu Xu, and Yun Xue Yao were already in shock. Is it even human to drink this much?</p><br/><p>Even the Wine God wouldn’t drink this much.</p><br/><p>When they finished…</p><br/><p>Lin Fan wanted to say something, but unexpectedly, Elder Zheng and the rest had fallen asleep with their faces bright red.</p><br/><p>“This…”</p><br/><p>He didn’t know what to say. What was he supposed to do now that they had fallen asleep?</p><br/><p>Lady Zheng smiled. “Lil’ Lin, they’ve all fallen asleep. Why don’t you stay here for tonight then?”</p><br/><p>Lin Fan waved his hand and replied, “Sister Zheng, I shouldn’t stay. I have to bring the ladies back. Let’s carry them into the house first.”</p><br/><p>I’ll let them have a good, long sleep.</p><br/><p>“Sister Zheng, where’s the study room?” asked Lin Fan.</p><br/><p>“It’s next door, why do you ask?” Lady Zheng asked.</p><br/><p>Lin Fan smiled. “I’ll do a drawing. If I don’t draw anything, they’ll hate my guts when they wake up tomorrow.”</p><br/><p>Lady Zheng replied, “Alright, alright. These three just keep harping about artwork all day.”</p><br/><p>In the study room.</p><br/><p>Wu You Lan and the rest came to spectate as well. They were dazzled by all the drawings hanging on the walls.</p><br/><p>Liu Xu and Yun Xue Yao had seen many things in their lives. Naturally, they recognized that these drawings were mostly from extremely famous artists. They were very valuable.</p><br/><p>But right now, these ladies were more excited about what Brother Lin was going to draw.</p><br/><p>Lin Fan stood in front of the drawing table. He thought for a moment about what he should draw. Suddenly, he had an idea. He picked up the brush and his gaze shifted. With an imposing aura, he started to draw.</p><br/><p>Mountains. Water. People.</p><br/><p>The initially-blank canvas gradually became abundant.</p><br/><p>Yun Xue Yao and the rest were seeing Brother Lin draw for the first time. Their eyes widened. Although they couldn’t understand all of it, they could tell that Brother Lin was incredible.</p><br/><p>They also knew that the drawing which had been placed in the museum was recognized as one of the top ten artworks in the world.</p><br/><p>As they watched Brother Lin with his serious expression, they couldn’t help but be captivated.</p><br/><p>Time passed, minute by minute, second by second.</p><br/><p>It was finished in one go.</p><br/><p>Lin Fan had wanted to add a poem but decided not to. Then, he took out a blank piece of paper and wrote a few words. He would let Elder Zheng do it himself when he woke up.</p><br/><p>This drawing contained four people which represented the four of them.</p><br/><p>Four old and one young.</p><br/><p>It also symbolized them getting to know each other through art and becoming friends.</p><br/><p>To Wu Huan Yue and the rest, the people and scenery in the drawing seemed vivid and lifelike.</p><br/><p>“Alright, let’s go back.” Lin Fan smiled. This would definitely make Elder Zheng happy.</p><br/><p>“Okay.”</p><br/><p>The rest of them nodded. Then, along with the chauffeur, they left the place.</p><br/>\n</div>"}