{"title": "Chapter 1217 - Don’t ask irrelevant questions!", "id": 1217, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1217-don%E2%80%99t-ask-irrelevant-questions", "volume_title": "Volume 13", "body": "<h1>Chapter 1217 - Don’t ask irrelevant questions!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1217: Don’t ask irrelevant questions!</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>Wu You Lan saw that Brother Lin’s expression wasn’t quite right, so she asked curiously, “Brother Lin, what’s up with you?”</p><br/><p>Lin Fan sighed. “It’s frustrating. A small move of mine has angered the budding flowers of the nation. In the future, things will be troublesome.”</p><br/><p>“Hehe, there are people who dare to go against you? They must be sick of living.” Fraud Tian laughed. He couldn’t believe it.</p><br/><p>Zhao Zhong Yang said, “Fraud, don’t doubt him. Brother Lin has really made some strong enemies. If he doesn’t resolve it, things will end tragically.”</p><br/><p>“What’s that supposed to mean? Explain it to me.” Fraud Tian was instantly curious as he couldn’t quite understand it.</p><br/><p>Zhao Zhong Yang took out his phone. “Take a look for yourself. This is what Brother Lin posted yesterday that caused a ruckus online. He offended a bunch of 2005s kids. Go and take a look at the news on the Internet. This is the latest hot topic.”</p><br/><p>Fraud Tian couldn’t quite understand what was going on. He unlocked his phone and took a look at the news.</p><br/><p>With one look, he was stunned.</p><br/><p>“My fellow 2005s comrades, did you all get punished last night?”</p><br/><p>After opening up that thread, he saw that the number of replies had reached tens of thousands.</p><br/><p>“I did. I was beaten so badly by my dad last night that I almost couldn’t stand.”</p><br/><p>“I was forced to kneel by my mother for one hour. If she hadn’t taken pity on me, I would have knelt for the whole night.”</p><br/><p>“Sigh. My mom looked at my phone last night. I’m so scared now that I don’t know what to say anymore. Those videos weren’t even shared by me. I just joined a group where they send some videos every day. What am I supposed to do about it?”</p><br/><p>“You guys have it good. My phone was thrown away by my father.”</p><br/><p>“This despicable Master Lin… We have to establish an alliance to battle him to the end.”</p><br/><p>“That’s right. If it wasn’t for his meddling, this wouldn’t have happened to us. This is absolutely unforgivable.”</p><br/><p>When Fraud Tian finished looking at the comments, he looked at Lin Fan with a shocked face. “Kid, this is deep trouble. These are the budding flowers of the future. If you p*ss them off, you’ll be in trouble in the future.”</p><br/><p>Lin Fan was helpless. “Sigh, this isn’t what I wanted either. I just posted a few photos casually. But this problem was caused by them. How could they blame me? I was doing a good deed!”</p><br/><p><em>Ding ding</em></p><br/><p>At that moment, a call from Liu Xiao Tian came.</p><br/><p>“Hello, Chief Liu. Are you calling me because the issue has been resolved?” asked Lin Fan.</p><br/><p>Liu Xiao Tian was clearly exhausted. “Mmm, it’s almost settled. We’ve gotten what we need from the interrogation. Those guys have all confessed too. We’re going to detain them and send them to court as soon as possible. Master Lin, I really have to thank you for this. If it hadn’t been for you, we wouldn’t have realized that such a crime was going on.”</p><br/><p>Lin Fan said, “There’s no need to thank me. What did those primary school students say?”</p><br/><p>Liu Xiao Tian said, “Some of their parents have already been informed. It was all because they didn’t want their parents to have a second child. We’ve sent the relevant personnel to communicate with them in hopes that those parents will pay more attention to this in the future. We can’t help with those matters. We can only rely on the parents.”</p><br/><p>Lin Fan said, “That’s fine. If there’s nothing else, I’m hanging up. I won’t hold you up any longer.”</p><br/><p>Liu Xiao Tian said, “Oh right, those reporters might be going to your place. Early this morning, a group of reporters somehow found out about the incident and came over to us. Right now, they should be going to your side.”</p><br/><p>Just at that moment, noises came from outside.</p><br/><p>Lin Fan said, “Chief Liu, I’m hanging up. They’ve really come too quickly. I don’t even have time to respond.”</p><br/><p>Outside, the reporters were charging towards the shop.</p><br/><p>“Master Lin, we’re here…”</p><br/><p>This was already a habit for the reporters of Shanghai. In fact, they were even in awe of Master Lin. It had only been such a short period of time, but something had happened again.</p><br/><p>And this time, Master Lin and the police had worked together to crack a case involving underage children.</p><br/><p>Lin Fan smiled at the reporters and said, “You guys are way too fast.”</p><br/><p>A reporter waved his hand. “Master Lin, this isn’t fast at all. We have to get a proper interview with you for this incident.”</p><br/><p>Fraud Tian and Zhao Zhong Yang exchanged glances. They were already used to things like this.</p><br/><p>The reporters seemed to be attached to Cloud Street. They would never be away for too long of a time. Moreover, each time they came, it was to look for Master Lin.</p><br/><p>This made them feel very helpless. This kid was just too popular. What could they do about it?</p><br/><p>Lin Fan walked out of the shop. This was already routine to him. “Alright, if you have questions, go ahead and ask them. This is just a small matter. Why are you all so curious about it?”</p><br/><p>“Master Lin, this isn’t a small matter at all. What you discovered has to do with the current state of our society. Those criminals actually have their eyes on underage children!”</p><br/><p>“Master Lin, I’d like to ask how you found out about the whole matter.”</p><br/><p>Lin Fan could only answer their questions one by one. Also, he also decided that he had to give good replies regarding this matter.</p><br/><p>“With my eagle eyes, I can see a problem with just a glance. As for how I saw it, it’s hard for me to say. You guys should understand,” said Lin Fan calmly.</p><br/><p>The reporters nodded. “We understand. Of course we understand.”</p><br/><p>“Master Lin, I heard that this whole incident was because of second pregnancies. How do you think it should be resolved?” asked a reporter.</p><br/><p>Lin Fan replied, “According to my research, if someone wants to have a second child, it’s best to do it when the first child is under five. Children will not have developed competitiveness at that age. Also, giving them siblings from a young age has advantages as well. Otherwise, if the first child is too old, they’ll develop competitiveness and be overly defensive. Then, the parents will have to correct the child’s attitude.”</p><br/><p>A reporter asked, “Master Lin, how many children will you have in the future?”</p><br/><p>Lin Fan was startled. “My comrade, let’s not talk about unrelated topics. We’ll stick to the main topic.”</p><br/><p>“Master Lin, when do you plan to get married? There’s a rumour online that you might not be straight…”</p><br/><p>“Who the f<em>ck said that? I’m not straight? There’s no need to debate about that. Rumours cannot be trusted.” Lin Fan was annoyed now. What the f</em>ck are they talking about? All these questions are unrelated!</p><br/><p>“If you guys want to ask questions, ask relevant questions. Can we not talk about irrelevant topics? What am I supposed to reply? These questions are hard to answer!”</p><br/><p>Lin Fan wanted to beat these reporters to death now. He had not expected things to change so suddenly. They were starting to try and find out his secrets.</p><br/><p>The reporters laughed. Then, they asked a few more questions.</p><br/><p>In the end, Lin Fan finally managed to send the reporters off.</p><br/><p>He had not expected that this incident would draw so many reporters’ attention. It really left him helpless.</p><br/>\n</div>"}