{"title": "Chapter 1211 - No, I don’t want to!", "id": 1211, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1211-no-i-don%E2%80%99t-want-to", "volume_title": "Volume 13", "body": "<h1>Chapter 1211 - No, I don’t want to!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1211: No, I don’t want to!</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>“Don’t do it, Master Lin. You’re a good person. Please, let me go. I can’t go to the police. I can’t!”</p><br/><p>“No! I didn’t even do anything! You don’t have proof, how can you arrest me?”</p><br/><p>Yang Dong was pale with fear. Things had gone horribly wrong and he was completely lost in fear.</p><br/><p>Lin Fan immediately flagged a taxi and shoved Yang Dong into the car. Then, he told the little girl to sit in front.</p><br/><p>“Sir, take us to the police station.”</p><br/><p>The driver didn’t notice anything at first. But suddenly, he realized that something wasn’t right.</p><br/><p>There were a few words he heard that caught his attention.</p><br/><p>“Master Lin, I’m begging you. Let me go!”</p><br/><p>“I wouldn’t dare to do it again. Please don’t take me to the police!”</p><br/><p>“Master Lin, I can’t be exposed. Otherwise, I’ll be done for. I’m begging you!”</p><br/><p>“This is only my first time. It’s really my first time…”</p><br/><p>His face was covered in tears, and his mucus was flowing as he begged Master Lin to let him go. Otherwise, his life was going to end.</p><br/><p>Lin Fan said, “First time? Don’t you know what I’m capable of doing?”</p><br/><p>He hadn’t expected this guy to be so crafty and say that it was his first time.</p><br/><p>The driver asked, “Master Lin, what did this guy do? Could it be that he was trying to sell this little girl?”</p><br/><p>The driver wasn’t overly excited. Even though Master Lin was famous now, it was still easy to find him. One just had to visit Cloud Street to find Master Lin.</p><br/><p>“What he did was even worse than human-trafficking,” said Lin Fan.</p><br/><p>The driver didn’t realize what it was at first. However, from what Yang Dong had said, he managed to get a rough idea. Then, his face turned stern. “Master Lin, did he…”</p><br/><p>He didn’t say it in the end. After all, it would have a bad influence on the little girl.</p><br/><p>“Yes, your guess is right. That’s why I have to take him to the police. Furthermore, it’s not his first time. He’s done it lots of times,” said Lin Fan.</p><br/><p>When the driver heard that, his face turned red in anger. He was a father himself, and he hadn’t thought that such people still existed.</p><br/><p>“What a piece of scum. This kind of person should be taken to the police. How old is this girl? Twelve? Thirteen? What kind to scum would do such things?”</p><br/><p>The driver started scolding him angrily. If he hadn’t been driving, he would have personally taught this scum a lesson.</p><br/><p>At that moment, Yang Dong realized that begging for mercy wouldn’t work. He wanted to jump out of the car. But just as he tried to open the door, he realized that it was locked.</p><br/><p>“Hmph. You thought you could jump out? I’ve already locked the door. Let’s see what you can do,” growled the driver.</p><br/><p>Yang Dong’s eyes were red. “Are you trying to make me die?”</p><br/><p>Lin Fan shook his head. “We’re not trying to make you die. If a person does something wrong, he has to face up to it. And you have to make it up to everyone.”</p><br/><p>“I’m going to go down fighting!” Yang Dong raised his fist and threw it towards Lin Fan.</p><br/><p>“You’ve got guts.” Lin Fan laughed. This was the first time someone dared to make a move against him. Right now, there was no one who didn’t know about his strength. Furthermore, this Yang Dong’s fist was weak and powerless. It was useless.</p><br/><p>Quickly and effortlessly, Lin Fan suppressed Yang Dong and held him against the seat.</p><br/><p>The driver looked in the mirror. “Master Lin, should I stop the car? I’ll let you teach this scum a lesson.”</p><br/><p>Lin Fan replied, “No need for that. Let’s go straight to the police station.”</p><br/><p>The driver said, “Alright. This kind of person should be punished. He seems so refined, but he’s actually just scum. If Master Lin had not exposed him, bad things would have happened.”</p><br/><p>But when the driver saw that the little girl next to him wasn’t talking, he was curious. “Master Lin, why isn’t this girl crying or making any noise?”</p><br/><p>Lin Fan said, “I’ve hypnotized her.”</p><br/><p>When the driver heard that, he was instantly stunned. He hadn’t thought that Master Lin would have such an ability. If he didn’t see it for himself, he wouldn’t dare to believe it.</p><br/><p>“D*mn. I have to go faster. This scum must be taken to the police quickly.”</p><br/><p>The driver steadied himself. The most important thing was safety. Speed came second. He was already getting impatient. He wanted to take this person to the police station immediately.</p><br/><p>However, he didn’t take any photos, nor did he ask too much. After all, this little girl was young. If he shared this on his social media for others to flame this scum, he was afraid that the little girl would be affected. Hence, he resisted.</p><br/><p>Very soon, they reached the police station.</p><br/><p>When Yang Dong saw the police station, he was dazed. He was in despair.</p><br/><p>He knew that he was done for. He was beyond hope.</p><br/><p>At that moment, Yang Dong turned to Master Lin. “I only have one request. Please put a hood over my head.”</p><br/><p>“Okay.” Lin Fan looked at him, then grabbed a transparent plastic bag and placed it on his head before pulling him out of the car.</p><br/><p>The plastic bag made no difference at all.</p><br/><p>“How much for the ride?” Lin Fan took out his wallet to pay.</p><br/><p>The driver immediately waved him off. “Master Lin, there’s no need to pay. If it’s you, how can I accept your money?”</p><br/><p>Lin Fan rebutted, “No. I have to pay you. This is hard-earned money.”</p><br/><p>“Sigh. Master Lin, there are more important matters right now. How can you think of all this? Just pay me once you’re done. I’ll wait for you,” said the driver.</p><br/><p>“Alright.” Lin Fan thought that was fine. Then, he dragged Yang Dong into the police station with Li Xiao Xiao next to him.</p><br/><p>However, as they walked to the police station, the driver stepped on the gas and left.</p><br/><p>“This…” Lin Fan felt helpless. He hadn’t expected the driver to leave without taking his money.</p><br/><p>When a police officer passing by saw Lin Fan, he was curious. “Master Lin, what’s the matter?”</p><br/><p>Lin Fan pointed at Yang Dong. “This guy committed a crime. I caught him and brought him here. Is your Chief Liu here?”</p><br/><p>“He is. I’ll inform him immediately.” The police officer ran into the station. He knew that it wasn’t a small matter since Master Lin had come. It had to be pretty serious.</p><br/><p>When Lin Fan and the rest were about to step into the police station, Yang Dong became completely paralyzed, and he laid on the ground.</p><br/><p>“No, I don’t want to go in. Master Lin, I’m begging you, let me go. I’ll kneel down to you. I can’t go in!” Yang Dong cried. His legs had gone completely soft.</p><br/><p>Lin Fan looked at the miserable Yang Dong and couldn’t help but laugh. Then, he shouted towards the police station. “We’ll need a few guys to carry this guy in.”</p><br/><p>The police officers were very familiar with Master Lin. Then, several buff police officers lifted Yang Dong by his limbs and carried him in.</p><br/><p>They didn’t have to ask what Yang Dong had done. They would find out soon.</p><br/><p>Master Lin was the bane of all criminals. Although he had not arrested any criminals for a while now, they still trusted Master Lin very much.</p><br/><p>Especially since there was a little girl by his side, they knew that it was no small matter.</p><br/><p>And seeing that man in complete fear, they knew that it was a big matter.</p><br/>\n</div>"}