{"title": "Chapter 1212 - These things seem pretty interesting", "id": 1212, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1212-these-things-seem-pretty-interesting", "volume_title": "Volume 13", "body": "<h1>Chapter 1212 - These things seem pretty interesting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1212: These things seem pretty interesting</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>At the local police station.</p><br/><p>Yang Dong sat there with his hands cuffed, and he was looking around anxiously. He could not stop fidgeting. It was obvious that he was anxious.</p><br/><p>Especially since he was guilty, it made sense for him to be anxious.</p><br/><p>He did not expect this to happen at all. If he had known about this earlier, he would not have arranged for a meeting at the Oceanic Love Hotel.</p><br/><p>He would not have been willing to spend money and go over to the hotel.</p><br/><p>Liu Xiao Tian was stunned. “Master Lin, what did you say? This fella wants to…”</p><br/><p>Lin Fan nodded. “Yes. Thankfully, I met him. If not, something bad would have happened. I don’t think this is a simple matter. We have to conduct a thorough investigation.”</p><br/><p>Liu Xiao Tian replied, “Hmm, I know. I will definitely investigate this matter thoroughly. These fellas are crazy. They probably dare to mess with anything.”</p><br/><p>Lin Fan felt the need to find out more. “Let’s go over to see how are things going.”</p><br/><p>“What’s the situation with the girl?” Liu Xiao Tian asked. She had been quiet ever since she came here. It was as if she did not know anything about this matter.</p><br/><p>Lin Fan replied, “I hypnotised her so that she would be quiet. When we finish interrogating the man, we will ask her as well.”</p><br/><p>“Hmm, I see.” Liu Xiao Tian nodded and wanted to see what kind of person this fella was like.</p><br/><p>At the interrogation room.</p><br/><p>A policeman looked at the belongings of the man and wrote down everything he saw.</p><br/><p>“One stocking.”</p><br/><p>“A cat costume.”</p><br/><p>“One set of a school uniform.”</p><br/><p>“A set of sex toys.”</p><br/><p>When he saw these items, the policeman looked at the man in shock. This fella must have been an adventurous man.</p><br/><p>However, when he saw the little girl sitting in the corner, the policeman was furious. The man sitting before him was an inhumane beast.</p><br/><p>“Three Durex condoms.”</p><br/><p>“Two Viagra pills.”</p><br/><p>He continued to write to the checklist of the items that he had possessed. It was embarrassing to even announce some of those items.</p><br/><p>The reporting officer held the pen so firmly that it almost broke.</p><br/><p>He did not expect the man to be so inhumane. Thankfully, Master Lin spotted him. If not for Master Lin, what would have been the outcome?</p><br/><p>It was simply unbelievable.</p><br/><p>“A set of DVDs.”</p><br/><p>That was the last piece of item in the bag.</p><br/><p><em>slam!</em></p><br/><p>Suddenly, the police officer slammed the table furiously. “Tell me, what are these for?!”</p><br/><p>Yang Dong stuttered, “I… They are for me to use. I didn’t do anything.”</p><br/><p>The police officer replied, “You didn’t do anything? I think you planned to do something but you did not manage to succeed. You better tell me the truth.”</p><br/><p>“I really didn’t do anything. I just like to bring these items out. I have this weird habit. If I do not bring these items with me, I would feel insecure. Anyway, is there a law that says that I cannot possess these things?”</p><br/><p>It was as if Yang Dong had planned what to say. Initially, he was still feeling anxious, but he was starting to feel calmer now.</p><br/><p>He understood that if they had no evidence of him doing anything illegal, he would not be affected at all.</p><br/><p>The police officer glared at Yang Dong. “I guess you really don’t want to speak the truth.”</p><br/><p>If he trusted his words, he would have been a fool.</p><br/><p>Who would believe that he had no intentions of doing something bad to the little girl? After all, he was alone with her and he carried such “special” items with him.</p><br/><p>Yang Dong insisted, “What is there to say? Release me now. I did not do anything wrong. I was going to throw these things away. What did you arrest me for?”</p><br/><p>The officer asked, “What about the girl?”</p><br/><p>Yang Dong shook his head. “What is it? I just asked her for directions. Is that illegal?”</p><br/><p>He just wanted to deny everything to save himself.</p><br/><p>Furthermore, they could not do anything to him since they had no evidence of him actually committing a crime yet.</p><br/><p>“Inspector Liu, Master Lin…”</p><br/><p>The police officer nodded at his inspector before saying, “This fella refuses to admit anything. He claims that he does not know the girl and that he only asked her for directions. He also said that he carried these items to throw them away.”</p><br/><p>Liu Xiao Tian replied, “Inform his family and the relevant authorities.”</p><br/><p>“Okay.” The police officer nodded. He had to inform the relevant parties about this as a form of deterrence.</p><br/><p>Indeed, when Yang Dong heard about them informing his parents and the relevant authorities, he was stunned.</p><br/><p>“What are you guys doing? You have no evidence at all. How can you accuse me of these things?”</p><br/><p>Liu Xiao Tian glared at Yang Dong. “I suggest that you tell us the truth now. When we find out everything, it will be too late for you to confess your sins.”</p><br/><p>Yang Dong tried to avoid making eye contact with him and replied, “What is there for me to be truthful about? I did not do anything.”</p><br/><p>The police officer said, “Inspector Liu, this fella is an educated man. He is a manager.”</p><br/><p>Liu Xiao Tian replied, “Alright, inform his family and bring them over.”</p><br/><p>Yang Dong protested furiously, “What are you trying to do? You have no evidence. How could you ask my family over? This will affect my reputation, and I can sue all of you for this.”</p><br/><p>Initially, Lin Fan did not want to say anything, but he still decided to add, “Just look at his mobile phone. Perhaps we can find something in there.”</p><br/><p>When he said that, Liu Xiao Tian immediately replied, “Yeah, we should do that.”</p><br/><p>Yang Dong’s facial expression changed. “This is personal privacy. You can’t do this.”</p><br/><p>“Inspector Liu, there’s a password,” the police officer said.</p><br/><p>Liu Xiao Tian looked at Yang Dong and asked, “What’s the password?”</p><br/><p>Yang Dong shook his head. “Password? I don’t even know whose phone this belongs to. How would I know the password?”</p><br/><p>Liu Xiao Tian looked at him. “I suggest you cooperate with us and stop trying to avoid our questions.”</p><br/><p>Yang Dong raised his voice. “I’m not avoiding anything. This phone does not belong to me. How would I know the password?”</p><br/><p>Lin Fan went forward and asked for the phone. “Let me have a look.”</p><br/><p>The police officer handed the phone to Master Lin, but he did not know what Master Lin wanted to do. It was not the first time that he encountered people like Yang Dong. He wondered what Master Lin was going to do.</p><br/><p>He insisted on remaining quiet and that he did not know anything about the matter. He would probably beg for mercy when the truth was revealed.</p><br/><p>Lin Fan looked at Yang Dong and the phone. Then, he keyed in six characters.</p><br/><p>There was a loud and crisp sound.</p><br/><p>The phone was unlocked.</p><br/><p>When Yang Dong heard that sound, his face turned as white as paper. “How could you know my password?”</p><br/><p>Lin Fan smiled. “That was easy. 123456.”</p><br/><p>“Rubbish! My password is 895714.”</p><br/><p>Suddenly!</p><br/><p>Yang Dong was stunned. Master Lin suddenly took out a phone from his pocket. “Actually, the phone that I just unlocked belongs to me. How would I know the password of your phone?”</p><br/><p>“But I know what it is now.”</p><br/>\n</div>"}