{"title": "Chapter 1219 - For your own safety, it’s best to stay out of it", "id": 1219, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1219-for-your-own-safety-it%E2%80%99s-best-to-stay-out-of-it", "volume_title": "Volume 13", "body": "<h1>Chapter 1219 - For your own safety, it’s best to stay out of it</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1219: For your own safety, it’s best to stay out of it</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>Several days later!</p><br/><p>To Lin Fan, there hadn’t been much going on recently. He would just go to Cloud Street each day to sell some pancakes and show off to everyone a little.</p><br/><p>“Sigh. These days are way too repetitive. It’s really too boring sometimes! I envy Elder Dog. He gets to go out to play every day,” said Zhao Zhong Yang as he played with his phone.</p><br/><p>Lin Fan looked outside. Elder Dog was surrounded by a group of puppies. His face had a look of sadness on it.</p><br/><p>However, because Zhao Zhong Yang couldn’t understand dog speech, he had no idea that Elder Dog was complaining.</p><br/><p>“Get out of my way, you puppies!”</p><br/><p>“Argh, don’t bite that area!”</p><br/><p>Now that he had puppies, Elder Dog couldn’t be free anymore. He had to take care of these puppies before going out. It was really exhausting.</p><br/><p>At that moment, Lin Fan looked at his phone. There was a headline on Weibo.</p><br/><p>“The World English Singing Competition has officially begun. International superstars are waiting for you!”</p><br/><p>When he saw this headline, he was a little curious, so he clicked on it.</p><br/><p>“There is only one Chinese applicant as of now, and her name is Jin Can!”</p><br/><p>Lin Fan was curious about what this World English Singing Competition was about. But after taking a closer look, he understood. It was a global singing competition.</p><br/><p>But who was this Jin Can?</p><br/><p>She sounded unfamiliar. But thinking hard about it, he remembered she was a pretty good singer.</p><br/><p>However, he suddenly realized that something wasn’t right. I haven’t done anything at all! How did I get dragged into this?</p><br/><p>“Sigh, do we have no one else? Is Jin Can the only one who dares to sign up?”</p><br/><p>“What’s going on with that Wu Huan Yue? Hasn’t she received lots of awards recently? Then why isn’t she joining a big competition like this?”</p><br/><p>“This is an international competition. What would a Chinese singer do there? Sing acapella?”</p><br/><p>“Doesn’t she have Master Lin as her composer?”</p><br/><p>“Cheh, Master Lin can’t do anything either. This isn’t Chinese. Master Lin’s English is terrible.”</p><br/><p>“How would you know?”</p><br/><p>“Go and take a look at the Weibo of this Internet celebrity. He has talked about it before.”</p><br/><p>Lin Fan was a little stunned when he saw this. What that person said was true, but saying it so bluntly wasn’t very good, was it?</p><br/><p>Moreover, he had not done anything at all. They couldn’t just talk about him like that. However, he still went to take a look at that Internet celebrity’s account.</p><br/><p>That Internet celebrity’s name was really complex. After looking at it for a long while, he still didn’t understand what it meant. But there was a single post from that Internet celebrity that received many replies.</p><br/><p>“Let me tell you guys about Master Lin’s background. He graduated from a rubbish university. During his school days, he was taking basic English. Even after taking the exam twice, he didn’t pass. And both times, his score was only twenty-something. On his last try, the teacher took pity on him and let him pass. If you ask him to write an English song, he would never be able to do it. It’s just impossible.”</p><br/><p>When Lin Fan saw this post, he was dumbfounded.</p><br/><p>That’s way too harsh, isn’t it? How can he talk about my past like that as if he knows me?</p><br/><p>Isn’t it normal to be bad at English? It’s already difficult to be good at one language. And Chinese is really broad! It’s not so easy to learn two languages at once!</p><br/><p>When he saw the comments below, Lin Fan couldn’t take it anymore.</p><br/><p>“Haha. I’m dying of laughter. This is the first time I’ve heard of someone failing so many times. How bad must his English be?”</p><br/><p>“Yeah, I never thought that the all-knowing Master Lin would fail his English exam. I have to go and ask about this on Master Lin’s Weibo to see if it’s really true!”</p><br/><p>“Brothers, do you feel very proud just because you know English and Master Lin doesn’t? Aren’t you ashamed of digging up Master Lin’s past?”</p><br/><p>“Ah, it seems like we can give up on Master Lin for this international singing competition. Without Master Lin, we’re basically hopeless.”</p><br/><p>“Yeah. Wu Huan Yue was able to become famous all because of Master Lin. Initially, I was waiting for Wu Huan Yue to get rid of Master Lin. I hated and envied Wu Huan Yue. But I didn’t think that the two of them were so close. I am really talented, but I can’t put my talents to good use because I don’t have someone like Master Lin.”</p><br/><p>Lin Fan quickly went back to his own Weibo. Indeed, things had gotten out of hand. Many people were asking about that post on his Weibo. It really left him helpless.</p><br/><p>How the f*ck was he supposed to reply?</p><br/><p>He had never thought that someone would criticize him for this. Then, he thought about it and came up with an idea. It seemed that this was the only way.</p><br/><p>Very soon, he finished typing the reply and posted it.</p><br/><p>“There were too many courses. English is boring, so I neglected it. There’s nothing wrong with that.”</p><br/><p>Although that reason was quite far-fetched, at least he had expressed his thoughts.</p><br/><p>In an instant, fans started commenting.</p><br/><p>“Haha, I’m dying of laughter. Maser Lin has been humiliated and is angry now.”</p><br/><p>“I have to give in. I wouldn’t give in to anyone else, but I give in to Master Lin.”</p><br/><p>“I feel like what Master Lin said makes sense. If he spent too much time learning English, he wouldn’t have been able to cure so many diseases.”</p><br/><p>“What Master Lin said is the truth. There are so many things to learn. Why would he learn English? It’s better to learn something that would be of use to society.”</p><br/><p>“I understand and support him, but it’s a shame. With Master Lin’s talents, if he knew English, he would be able to write amazing English songs. If he did that, Wu Huan Yue would definitely become the champion.</p><br/><p>Lin Fan looked at the comments and calmly accepted them. It seemed that there were still many people that could understand him.</p><br/><p>On Weibo.</p><br/><p>Jin Can posted a comment.</p><br/><p>“I have the best composer who specializes in English songs. I believe I will really become famous. A truly great singer should not be limited to her country because that would prevent her from showing her true abilities.”</p><br/><p>When this comment was posted, it instantly drew a large number of replies.</p><br/><p>“I support you. I support you, Jin Can!”</p><br/><p>“That’s right. You didn’t get the prize last time, but you shouldn’t be saddened. That Wu Huan Yue only relies on Master Lin’s songs. I heard that Master Lin’s English is terrible. Wu Huan Yue is hopeless this time.”</p><br/><p>“That’s right. I trust that Can Can will definitely win the competition.”</p><br/><p>When some celebrities saw Jin Can’s post, they wanted to ‘like’ it as well. But then, they decided not to.</p><br/><p>Although it hadn’t been stated explicitly, it seemed like Jin Can was challenging Master Lin and Wu Huan Yue.</p><br/><p>Hence, for their own safety, they decided not to get involved. It was best to stay a spectator.</p><br/>\n</div>"}