{"title": "Chapter 1225 - You're working too hard", "id": 1225, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1225-youre-working-too-hard", "volume_title": "Volume 13", "body": "<h1>Chapter 1225 - You're working too hard</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1225: You’re working too hard</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>A few days later.</p><br/><p>The news on the internet was still brewing.</p><br/><p>Everyone was talking about how Master Lin had managed to write three songs in twenty minutes.</p><br/><p>It was as if someone was dying to flame him about it.</p><br/><p>Some celebrities were helpless about this incident. They knew that Master Lin was definitely being flamed by someone again. Furthermore, it seemed that the person was not simple this time.</p><br/><p>It carried on for a few days and showed no signs of slowing down.</p><br/><p>If he were to not win any awards in the competition, he would definitely be flamed again.</p><br/><p>The foreigners were not stupid. They probably would think that the songs were terrible since they were written in twenty minutes.</p><br/><p>This could possibly be interpreted differently by others who were not in the same industry.</p><br/><p>However, the celebrities knew about it since they were well-versed in matters like this.</p><br/><p>They were used to seeing people get flamed till they lost everything.</p><br/><p>Some of the celebrities who had conflicts with Master Lin before did not dare to express their thoughts on Weibo, but they were secretly laughing at him.</p><br/><p>Some of them even spent their own money to make the news go viral.</p><br/><p>“The countdown to the start of the international competition has started. Let us see what is to come.”</p><br/><p>When the news was announced, the media was really attentive towards it.</p><br/><p>Wu Huan Yue was practising her singing in the studio every single day.</p><br/><p>“Huan Yue, take a break,” her agent, Yang Qian, said. Something was bound to happen if this continued.</p><br/><p>However, she had to admit that the three songs were really nice; they were even better than the English songs that she listened to.</p><br/><p>Although Wu Huan Yue could not really control her voice for some parts of the songs, when she managed to do it, it was shockingly good.</p><br/><p>“Sister Yang, don’t worry. I can do it,” Wu Huan Yue said.</p><br/><p>Yang Qian was speechless about the situation. She simply did not know what to say. Huan Yue was working too hard. If she damaged her vocal box, things would definitely go wrong.</p><br/><p>However, she had read the news online, and she knew that Wu Huan Yue was working so hard because she did not want Master Lin to be embarrassed.</p><br/><p>However, this matter was something that should not be hastened.</p><br/><p>Another half an hour passed, and Yang Qian went forward to stop her. “Alright, Huan Yue, it’s time to take a break. Don’t exhaust yourself or you will damage your vocal chords. Drink some water.”</p><br/><p>“I…” Wu Huan Yue wanted to say something, but she stopped speaking after looking at Sister Yang’s expression.</p><br/><p>Ten minutes later.</p><br/><p>Yang Qian did not know what to say. Wu Huan Yue had only rested for a short while. It wasn’t sustainable for Wu Huan Yue to only practice or sleep.</p><br/><p>Furthermore, it was normal to have some singing issues when singing English songs for the first time. It was normal to be foreign to it, and it was difficult to sing to the best of her abilities.</p><br/><p>The next day, Yang Qian was witnessing the same situation again. She knew that this was not sustainable, and she quickly called Wang Ming Yang.</p><br/><p>She described the situation over the phone.</p><br/><p>Wang Ming Yang was stunned. He did not expect Wu Huan Yue to be working so hard for it. After Wang Ming Yang spoke to her briefly, she continued to practise singing as if she had forgotten everything they had spoken about.</p><br/><p>In the office.</p><br/><p>Wang Ming Yang was massaging his temples before he picked up his phone to call Lin Fan.</p><br/><p>At Cloud Street.</p><br/><p>Lin Fan was sitting there in boredom. He did not really care about the news on the Internet. He felt that it was too tiring to do so.</p><br/><p>However, he was wondering who was the one doing such a great job of flaming him.</p><br/><p>Although the people flaming him were working really hard at it, they seemed to be slowing down on it.</p><br/><p><em>ring, ring</em></p><br/><p>The phone rang.</p><br/><p>When Lin Fan picked up the phone, he was stunned. He did not expect Wu Huan Yue to be working so hard.</p><br/><p>“I will come over later.”</p><br/><p>After hanging up, he prepared to leave. She did not need to work so hard. All she needed to do was to practise as per usual. It was just a competition, and he did not care about being embarrassed.</p><br/><p>“I will be going out. Please look after the shop,” Lin Fan said to the others.</p><br/><p>At the Shanghai Eastern Han Group.</p><br/><p>“Bro, you’re finally here. You have to resolve this. I can’t do it,” Wang Ming Yang said.</p><br/><p>“I know. I’ll handle it,” Lin Fan said as he walked towards Wu Huan Yue.</p><br/><p>When he entered the studio, he could hear some parts of the songs. They sounded pretty nice.</p><br/><p>“Huan Yue,” Lin Fan said as he opened the door.</p><br/><p>Yang Qian was together with Wu Huan Yue. When she saw Master Lin, she became excited. After all, it was the renowned Master Lin.</p><br/><p>He had done so many ground breaking things.</p><br/><p>“Hey, Brother Lin, why are you here?” Wu Huan Yue smiled and asked.</p><br/><p>“If I didn’t make a trip here, Wu Huan Yue would probably lose her voice,” Lin Fan said as he patted Wu Huan Yue on her head.</p><br/><p>Yang Qian slowly began to leave after seeing that. After all, it was something that she should not be involved in.</p><br/><p>If she heard some noises, she had to pretend like she did not hear anything.</p><br/><p>“How are they? The three songs are okay, right?” Lin Fan asked.</p><br/><p>Wu Huan Yue nodded. “Yeah, Brother Lin is too amazing. These songs are really nice, but I haven’t practised enough. I always fail at some parts. Look, actually, I–”</p><br/><p>“–Alright, let’s not talk about the songs. Let’s go out for a walk,” Lin Fan interrupted.</p><br/><p>“Huh, but the songs…?” Wu Huan Yue was in a dilemma.</p><br/><p>Lin Fan smiled. “It’s okay. I wrote these songs for you. I didn’t write them for you to win awards. It’s not embarrassing at all if you do badly. Don’t let your thoughts get to you. I don’t really care about these things. You don’t have to work so hard.”</p><br/><p>“How can that be? I saw the news online. I will not let them laugh at you,” Wu Huan Yue said firmly.</p><br/><p>“It’s okay. Those people belong to the minority. Don’t you believe in my fans? They wouldn’t care about these things.” Lin Fan had an open mind, and he did not care about this at all.</p><br/><p>If anyone dared to laugh at him, he could kill them in five blows.</p><br/><p>“Let’s go. I’m in a good mood today. We can go out to shop and relax. It’s just a competition. Don’t be nervous.”</p><br/><p>Lin Fan dragged Wu Huan Yue out.</p><br/><p>Wu Huan Yue turned back and looked at the microphone before nodding. “Alright then…”</p><br/>\n</div>"}