{"title": "Chapter 1235 - A perfect performance", "id": 1235, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1235-a-perfect-performance", "volume_title": "Volume 13", "body": "<h1>Chapter 1235 - A perfect performance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1235: A perfect performance</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>One had to listen closely to determine whether a song was good or bad. However, the beginning of the song was also very important.</p><br/><p>When the music started playing, the four judges quieted down. They felt that the song was indeed pretty nice.</p><br/><p>The soft humming was accompanied by the beats.</p><br/><p>Wu Huan Yue closed her eyes for a moment. She just wanted to sing the song to the best of her ability without thinking about anything else.</p><br/><p>She started singing from her heart, and it sounded amazing right from the first note.</p><br/><p>“It’s so perfect.” Lin Fan knew that he succeeded when he heard her voice.</p><br/><p>The beginning was perfect.</p><br/><p>When the song was given to Wang Ming Yang, Lin Fan also had written down how the song should be sung.</p><br/><p>The way she sang and the tune was spot on. At the same time, he wanted her to know the story behind the song.</p><br/><p>In order to sing a song perfectly, she would have to “feel” the lyrics and understand the story.</p><br/><p>The female judge, Abigail, closed her eyes and listened quietly as if she was mesmerised.</p><br/><p>Ralph nodded and listened to the song closely. At the same time, he was stunned. He had never known that a Chinese could sing an English song so well.</p><br/><p>At the changing room.</p><br/><p>You’re reading on B oxnovel.c om Thanks!</p><br/><p>Jin Can was shocked. She knew that she had lost. Wu Huan Yue had a nicer voice, and the song was a classic.</p><br/><p>Those who did not know the lyrics could also feel the melancholy being expressed by the song.</p><br/><p>“How can this be?” Zheng Ya was in disbelief. He did not believe that Master Lin could write a song like this.</p><br/><p>Although Director Zhang did not really understand it, he could tell that it was extraordinary from looking at Zheng Ya’s expression.</p><br/><p>When the song reached its climax, the crowd felt a rush of sadness as they stared at the singer on stage.</p><br/><p>However, nobody said anything, as they did not want to ruin the atmosphere.</p><br/><p>The song was really mesmerising.</p><br/><p>When the song ended, many of the people in the crowd were still mesmerised.</p><br/><p>The other singers were stunned when they heard the song. They had not expected a Chinese singer to be that good.</p><br/><p><em>clap clap</em></p><br/><p>There was a standing ovation. They had thoroughly enjoyed the performance.</p><br/><p>They felt that her voice and the lyrics were perfect for each other.</p><br/><p>They could also feel the sadness and melancholy.</p><br/><p>Some of them were really affected, and they tried to hide their sadness.</p><br/><p>The female judge, Abigail, applauded loudly. There was a big smile on her face, and she was really stunned by this song.</p><br/><p>It was magical. She felt that the song should have been sung during the championship finals instead.</p><br/><p>The other three judges also nodded and stood up while clapping.</p><br/><p>They realised that this Chinese contestant was really good, and they were stunned by the song choice too.</p><br/><p>Abigail took the microphone and asked, “May I know if this is an original song? I’ve never heard it before.”</p><br/><p>“Yes, it’s an original song,” said Wu Huan Yue.</p><br/><p>“That’s impressive,” Abigail gasped. It was as if she wanted to do a cover of the song too.</p><br/><p>However, she controlled herself. Otherwise, she would have discussed the matter with the singer when the performance ended.</p><br/><p>The viewers of the show and the netizens watching the broadcast started to discuss the song after hearing it.</p><br/><p>You’re reading on B oxnovel.c om Thanks!</p><br/><p>They were asking about the name of the singer and finding out about the songs that she had sung before.</p><br/><p>It was because the song had moved them. They were really impressed.</p><br/><p>Soon, they managed to find out who Wu Huan Yue was and the songs that she had sung before.</p><br/><p>They were all in Chinese, but the foreigners felt that they were really nice to listen to even though they did not understand them.</p><br/><p>In the broadcasting room.</p><br/><p>Zhao Zhong Yang said ecstatically, “Bros, tell me how it was!”</p><br/><p>He was really excited. He had not expected Wu Huan Yue to sing so well.</p><br/><p>The netizens hurriedly donated presents.</p><br/><p>“6666… It was magical.”</p><br/><p>“Yeah, I was mesmerised by it. It’s so unexpected.”</p><br/><p>“Although I don’t know what it meant, it sounded amazing.”</p><br/><p>“Wu Huan Yue is unbeatable. That was a huge surprise.”</p><br/><p>“I feel that Master Lin is too overpowered. It’s written by him, and we’ve been doubting his abilities. How did he even write such an amazing song?”</p><br/><p>“Yeah, I’m excited to see what’s to come. I wonder how the songs written by Master Lin will sound like. I think Master Lin is so talented. All the songs that he wrote sound amazing.”</p><br/><p>The netizens started discussing excitedly. Although many of them did not know much about the song, they really liked it.</p><br/><p>It sounded much better than a lot of other English songs.</p><br/><p>Zheng Ya had written a few songs for Jin Can, but when he heard Wu Huan Yue’s song, he realised that it was on a different level.</p><br/><p>“This…”</p><br/><p>Zheng Ya wanted to leave immediately. He knew that he had lost.</p><br/><p>He knew how well Wu Huan Yue had performed.</p><br/><p>It was simply magnificent.</p><br/><p>In the changing room.</p><br/><p>Lin Fan smiled and gave Wu Huan Yue a hug. “That was awesome, really awesome.”</p><br/><p>Wu Huan Yue heaved a sigh of relief. It felt as if the heavy burden on her shoulders disappeared.</p><br/><p>“Brother Lin, really?”</p><br/><p>Lin Fan nodded. “Yeah. Didn’t you hear the applause? If you didn’t sing well, why did they clap so loudly? That was perfect.”</p><br/><p>“Impressive, really impressive.” Fraud Tian did not know much about singing, but he also felt that the song was well performed.</p><br/><p>Wu Huan Yue chuckled. “That’s great. As long as I did not sing badly, everything’s great.”</p><br/><p>It was a relieving moment for Wu Huan Yue. She felt great.</p><br/>\n</div>"}