{"title": "Chapter 1237 - The final competition", "id": 1237, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1237-the-final-competition", "volume_title": "Volume 13", "body": "<h1>Chapter 1237 - The final competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1237: The final competition</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>In the broadcast.</p><br/><p>The netizens went wild.</p><br/><p>“D*mn, 6666… Wu Huan Yue is simply too awesome. She’s the best in our country.”</p><br/><p>“F*ck, it’s all because of Master Lin’s amazing composition.”</p><br/><p>“Yeah, Master Lin is too good. I’m so impressed. How could he write something like this?”</p><br/><p>“Do you think Wu Huan Yue will be the champion?”</p><br/><p>“That’s hard to say, but I think she stands a chance.”</p><br/><p>The netizens were discussing it and trying to find the song online.</p><br/><p>They could not replay the livestream, which made them really anxious.</p><br/><p>They wanted to listen to the song again.</p><br/><p>At the performance venue.</p><br/><p>Some of the foreign singers started a discussion about Wu Huan Yue among themselves. They felt that she was a really good singer. Furthermore, she was singing amazing classics.</p><br/><p>That was something formidable.</p><br/><p>In the changing room.</p><br/><p>Lin Fan walked towards Wu Huan Yue. “That was breathtaking. It was even better than yesterday.”</p><br/><p>Wu Huan Yue chuckled. “Brother Lin, I think I did better than yesterday. I wonder what the result is going to be like. I’m a little nervous.”</p><br/><p>“What’s there to worry about? It’s amazing. Regardless of the results, what matters is that you did your best,” Lin Fan replied.</p><br/><p>“Yeah.” Wu Huan Yue nodded. Now that she had some hope, she wanted to do even better and earn a better result.</p><br/><p>The results were released.</p><br/><p>Wu Huan Yue had done it.</p><br/><p>However, Jin Can did not manage to make it to the next round. It was because there were simply too many amazing candidates to choose from. Everyone had done their best on stage.</p><br/><p>Hence, she was eliminated.</p><br/><p>When she saw Director Zhang, he looked really displeased.</p><br/><p>He was there with only one wish: to defeat Master Lin. However, they had not expected Master Lin’s compositions to be so good.</p><br/><p>Zheng Ya remained quiet. Only two of his songs had been used. The other songs could not be used at all. He felt embarrassed.</p><br/><p>Furthermore, he had even posted online before he had left for the States.</p><br/><p>Meanwhile, Jin Can did not say much either. However, she still smiled and greeted everyone. She did not seem to be as egoistic as before.</p><br/><p>The next day, news articles were posted online on different platforms, and many people were expressing their views on the competition.</p><br/><p>“Wu Huan Yue reached the final round.”</p><br/><p>“I didn’t expect Jin Can to be eliminated. She should be ashamed.”</p><br/><p>“What’s so shameful about it? She has nothing to be ashamed of for being there on stage. She sang pretty well and deserves to be praised. However, Zheng Ya deserves all the hate. Look at what he posted on his Weibo post before he left.”</p><br/><p>“Yeah, who gave this idiot the courage to argue with Master Lin? He should know Master Lin’s power by now.”</p><br/><p>Zheng Ya returned to the hotel and scrolled through Weibo on his phone. When he saw the comments, he was so angry that he almost smashed his phone.</p><br/><p>“Bro, how does it feel to be praising yourself?”</p><br/><p>“Yeah, I know you’re going to delete your account. We’re waiting for it.”</p><br/><p>“If you’re brave enough, reply to our comments. Why do you keep deleting them?”</p><br/><p>“These idiots.” Zheng Ya was enraged. He had not expected so many people to be flaming him.</p><br/><p>Then, he immediately deleted the comments. After all, he had already lost. There was nothing he could do. He could only return back to China on an earlier flight and curse that Wu Huan Yue could not make it further.</p><br/><p>At night.</p><br/><p>It was the final show and the day to determine the winner. Wu Huan Yue just sat there and rested.</p><br/><p>Yang Qian looked at Wu Huan Yue’s calm expression and went to ask Lin Fan, “Master Lin, do you think Wu Huan Yue will win?”</p><br/><p>Lin Fan chuckled. “Who knows? She will do her best.”</p><br/><p>Yang Qian was really nervous because the other singers were incredibly talented too.</p><br/><p>It was difficult to determine who was going to win.</p><br/><p>The hosts on stage announced, “We will determine the winner of the competition tonight. Among the five singers, who will be the champion?”</p><br/><p>Abigail looked at the stage and said, “I wonder what song the Chinese singer will be singing tonight.”</p><br/><p>Ralph hesitated for a moment. “I think it will be even better than before.”</p><br/><p>The two other judges chuckled. “We did not expect a Chinese singer to be one of the five finalists. It’s a rare occurrence.”</p><br/><p>The crowd was also cheering the candidates on.</p><br/><p>Some were even chanting Wu Huan Yue’s name.</p><br/><p>Abigail turned around and smiled. “Look, Wu Huan Yue is clearly the crowd favourite.”</p><br/><p>Ralph replied, “Of course. If I were in the crowd, I would support her too. I hope she can sing something different for us tonight. Among the other four singers, there’s someone that I’m close to, and I hope he wins it.”</p><br/><p>“Hahaha.”</p><br/><p>Soon, the competition started. The first singer was a middle-aged man with long hair.</p><br/><p>Everyone recognised him, as he was a famous rock singer. He was a force to be reckoned with.</p><br/><p>The four judges cheered loudly for him.</p><br/><p>Lin Fan looked at the screen and smiled before saying, “This singer is amazing.”</p><br/><p>Yang Qian replied, “Yeah, he’s famous and incredibly good. I’ve heard his songs before.”</p><br/><p>“Seems like Huan Yue is the last contestant. Is that right?” Lin Fan asked.</p><br/><p>“Yeah,” Wu Huan Yue replied as she opened her eyes. She was well-rested and really wanted to do well in the last round of the competition.</p><br/><p>Soon, the participants slowly made their way on stage. The atmosphere was at its peak. It did not seem like a competition at all. It seemed more like a concert now.</p><br/><p>“Huan Yue, it’s your turn,” Lin Fan said.</p><br/><p>Wu Huan Yue stood up and nodded at Lin Fan before heading to the stage.</p><br/><p>The four judges were really looking forward to her performance.</p><br/><p>“It’s finally her turn. I’m really looking forward to her song,” Abigail said while smiling.</p><br/><p>The other judges wondered how Wu Huan Yue would perform.</p><br/><p>At that moment, Wu Huan Yue appeared on stage.</p><br/><p>“I’m really honored to be performing today,” Wu Huan Yue said.</p><br/><p>The crowd applauded.</p><br/><p>The netizens watching the broadcast were really nervous. It was finally Wu Huan Yue’s turn. The previous singers had performed extremely well.</p><br/><p>Hence, they were nervous because it was a competition among the best singers.</p><br/><p>At the venue.</p><br/><p>“I will be performing ‘Innocence’.”</p><br/><p>The song started to play.</p><br/><p>The four judges looked at each other.</p><br/><p>The style of the song had changed.</p><br/><p>It was different from before, which made them even more excited.</p><br/>\n</div>"}