{"title": "Chapter 1232 - Look for me if something goes wrong", "id": 1232, "volume": 13, "url": "http://boxnovel.org/a-valiant-life-chapter-1232-look-for-me-if-something-goes-wrong", "volume_title": "Volume 13", "body": "<h1>Chapter 1232 - Look for me if something goes wrong</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1232: Look for me if something goes wrong</h2><div class=\"text-right small\"><b>Translator:</b> Atlas Studios <b>Editor:</b> Atlas Studios</div><br/><p>At this moment, the reporters were interviewing Wu Huan Yue.</p><br/><p>They did not ask any random questions. They only asked the normal ones, which also motivated Wu Huan Yue.</p><br/><p>After all, they had a good relationship with Master Lin. They had to take good care of Wu Huan Yue.</p><br/><p>It could be said that the reporters from Shanghai did not flame Wu Huan Yue at all. Those that flamed her were small reporters from incorrigible companies that resorted to those measures for profit.</p><br/><p>Of course, when they met these reporters, they would definitely flame them too. How could they tolerate them?</p><br/><p>“I didn’t expect Master Lin to be so well-liked by the reporters.” Director Zhang walked over and smiled.</p><br/><p>His motive was simple. He wanted the reporters to interview Jin Can too. After all, they were not very famous outside of China.</p><br/><p>Furthermore, they had not been widely reported on in China while they had been overseas.</p><br/><p>“Aren’t you talking rubbish? We obviously like him a lot,” a reporter said. The reporters knew the situation between Wu Huan Yue and Jin Can since they had been at the forefront of the previous incidents.</p><br/><p>They knew what Director Zhang wanted.</p><br/><p>“Good afternoon to all reporters,” Jin Can greeted them with a smile. She was prepared to be interviewed and photographed by the reporters. “This time, I will do my best here.”</p><br/><p>However, the reporters did not even bother about Jin Can. They continued interviewing Wu Huan Yue. That made Jin Can feel a little awkward.</p><br/><p>Jin Can was a little irritated by that.</p><br/><p>“Huan Yue, may I know if you feel acclimatised already?”</p><br/><p>“May I know how you feel about the songs that Master Lin wrote for you?”</p><br/><p>The reporters gathered around Wu Huan Yue and asked questions repeatedly. They simply ignored Jin Can.</p><br/><p>Director Zhang was furious. He had not expected that from the reporters at all. “Which company are all of you from?”</p><br/><p>He wanted to find out so that he could speak to them again when they returned to China.</p><br/><p>The reporters knew what Director Zhang meant when he said that.</p><br/><p>“No worries, just let Director Zhang know your companies. If anything goes wrong, look for me in Cloud Street. If it doesn’t involve breaking the law, I guess I can help.” Lin Fan chuckled.</p><br/><p>The reporters immediately replied to Director Zhang after hearing what Master Lin said.</p><br/><p>“Director Zhang, I’m from Oriental Publishers.”</p><br/><p>“I’m from Shanghai Entertainment.”</p><br/><p>The reporters immediately told him the names of their companies and their own names.</p><br/><p>They felt at ease after hearing what Master Lin said.</p><br/><p>Master Lin was really impactful in the country. He had received a lot of awards and had been recognised by a lot of elders. The bosses of their companies would probably be extremely courteous towards Master Lin too.</p><br/><p>Director Zhang looked at Master Lin in shock. He had not expected him to say something like this.</p><br/><p>It was as if Lin Fan was challenging him to get any to the reporters fired.</p><br/><p>“Let’s go,” Director Zhang commanded as they left. He knew that Master Lin was influential, but not everyone was afraid of him.</p><br/><p>Zheng Ya looked at the reporters unhappily. “These reporters are so rude.”</p><br/><p>“It’s okay. They can continue interviewing her. I want to see what they will do when she gets eliminated,” Director Zhang said.</p><br/><p>Jin Can was also furious, but she did not want to say anything.</p><br/><p>“Alright, we should go in now,” Lin Fan said.</p><br/><p>“Yeah.” Wu Huan Yue nodded. She greeted the other reporters before heading into the venue.</p><br/><p>They followed Wu Huan Yue along and were considered to be working staff. Hence, they could wait for her backstage.</p><br/><p>Lin Fan realised that most of the people there were foreign celebrities.</p><br/><p>The Asians there attracted some attention in the competition since there were so few Asian participants, especially Chinese people.</p><br/><p>The reporters from Shanghai could not enter the venue, so they waited outside.</p><br/><p>“Quickly write the articles to be sent to China. We are at the front line of things.”</p><br/><p>“Do you think Wu Huan Yue and Jin Can can win any awards?”</p><br/><p>“Are you kidding me? Of course not. After all, it’s not something they’re good at. It’s probably just for fun.”</p><br/><p>“Yeah, although we don’t know who are the other participants, I saw that some elders are here too. They are really incredible. Wu Huan Yue and Jin Can practically have zero popularity outside of China. It is difficult for them to compete.”</p><br/><p>The reporters discussed their viewpoints.</p><br/><p>They felt that it was almost impossible to win any awards.</p><br/><p>After all, it was not something that an average person could do.</p><br/><p>In China, on Weibo.</p><br/><p>Some netizens were waiting patiently for the latest news, but there was nothing.</p><br/><p>“D*mn, what are we supposed to look out for? Are the reporters slacking?”</p><br/><p>“Go to this live stream. Brother Yang is broadcasting it live.”</p><br/><p>“F*ck, there’s actually someone broadcasting. One of the youngsters in Master Lin’s shop is a broadcaster who followed him along this time.</p><br/><p>Then, the reporters published the news articles.</p><br/><p>“Arrived at the venue with countless celebrities.”</p><br/><p>“Wu Huan Yue is extremely confident and she will do her best.”</p><br/><p>“Master Lin made a trip there personally. It seems that he treats this competition very seriously.”</p><br/><p>The netizens discussed among themselves in the broadcast room.</p><br/><p>“That’s awesome. If she can win a prize, it will be even better.”</p><br/><p>“Are you dreaming? I think we might not even last past a month.”</p><br/><p>“Don’t worry, Master Lin is here. It’s just the first part of the stream. Don’t underestimate her.”</p><br/><p>“Yeah. I’ll go to the broadcast now. It seems like I can’t possibly sleep today.”</p><br/><p>“Me too. I have to work tomorrow morning too.”</p><br/><p>Zhao Zhong Yang was ready to access Weibo. However, there was a sudden influx of netizens.</p><br/><p>Zhao Zhong Yang managed to bump it to the featured page of Weibo since he was a featured partner.</p><br/><p>In the studio.</p><br/><p>There were some individual seats left after the international models took the seats.</p><br/><p>Wu Huan Yue sat there and took deep breaths. She was feeling a little nervous.</p><br/><p>Lin Fan patted her on her shoulders. “Don’t worry, it’s just a normal competition.”</p><br/><p>“Okay,” Wu Huan Yue said.</p><br/>\n</div>"}