{"title": "Chapter 2: Rebirth", "id": 2, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-2-rebirth", "volume_title": "Volume 1", "body": "<h1>Chapter 2: Rebirth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2: Rebirth</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>“Hu!” Zhang Yang woke up all of a sudden. His breath was rapid as he could only feel the cold sweat around his body. He opened his eyes and looked around, dropping his jaw when he saw the scene in front of him.</p><br/><p>What played out in front of him was a classroom. A room that was capable of fitting hundreds of people. Yet only 30 people occupied this space sparingly. A few of them were reading, chatting, or making a ruckus about who-knows-what. Every one of them were faces that he could doubtlessly recognize. They were all his university coursemates!</p><br/><p>Is this… university?</p><br/><p>“Why I am here? I should be dead.” Zhang Yang’s mind was filled with an endless stream of questions of the unknown.</p><br/><p>“Zhang Yang, what’s going on? Are you not feeling well?” somebody asked.</p><br/><p>Zhang Yang turned his head and looked. He saw a sentimental face with a sincere smile. It was a familiar yet strange feeling. He was Li Shang Yuan, his class representative while he was in university. But… he died 3 years ago in a plane accident!</p><br/><p>Zhang Yang nodded his head unconsciously, as if he was sleep-talking. “I am fine!” He reached out and pinched himself only to feel the lingering sting of the pain. Zhang Yang bared his teeth and inhaled breath of cold air!</p><br/><p>This is definitely not a dream!</p><br/><p>That means I am not dead! And it seems that I have traveled a few years back in time! Zhang Yang took out his phone and saw that the date displayed on it was the year 2034, June 16th.</p><br/><p>Five years!</p><br/><p>God gave him a chance to alter his destiny!</p><br/><p>In that moment, Zhang Yang felt anxious yet excited. He did not care how he rewound time by 5 years, he only knew that this was an opportunity for him to stage a comeback! For a ‘dead person’, nothing could be more precious than this.</p><br/><p>This was his final year in university and in just another 7 or 8 days, he would have graduated and obtained a job. If everything followed its proper course, he would work in a software company and live an easy life without any notable achievements to his name.</p><br/><p>It was only until 2 years later that he started to play the online game ‘God’s Miracle’ that was introduced by a company colleague. At that time, ‘God’s Miracle’ had been operational for more than 2 years. Initially, there were 4 million players connected simultaneously but the number spiked to billions playing online at any time of the day, only ever increasing for every day that passed! As early as half a year after ‘God’s Miracle’ went online, Dream Technology, the team who developed ‘God’s Miracle’ set up an A-Class and S-Class Professional League, providing a stage for professional players to show off their skills.</p><br/><p>Just like any e-Sports scene, the fame of the champions would bring about great advertising effect. Global corporations would then begin to invest in ‘God’s Miracle’, going so far as to sponsor teams to use their name as mascots to their brands. Some might even establish their own teams to participate. The income of a professional player was increasing steadily, no lower than that of a traditional sports celebrity.</p><br/><p>Certainly, in the later stages of the game’s establishment, ‘God’s Miracle’ itself became highly valued in the industrial line. The amount of virtual transactions could even make global corporations feel envious! With each of these corporations building up their own elite team, they had entered into a commercial war of the virtual world.</p><br/><p>Zhang Yang had been athletic since birth. In such a realistic virtual reality game that utilizes brain waves to operate, he could fully unleash his potential which was on par with professional players. He set up his own team and in the second year, he joined a B-Class amateur team. Eventually, one year later, he would then enter an A-Class Professional League!</p><br/><p>After entering the A-Class League, Zhang Yang immediately received a substantial sponsorship from a large corporation which also included a considerable monthly income. In the meantime, he befriended Lin Yu whose in-game-name (IGN)1 was Clear Perfume. Through a minor conflict that got them acquainted, they began on bad terms as they occassionally fought each other but somehow ended up as good friends.</p><br/><p>It was then that Lin Yu began to get involved with Liu Wei. In order to escape the fate of a pre-arranged marriage, she made a deal with her family. As long as she could build a successful career in ‘God’s Miracle’ and share a portion of the glory and profits from the huge industrial chain, her family would no longer intervene in her marriage affairs. And thus, Zhang Yang and Lin Yu worked hard together to develop and strengthen the Clear Water guild in order to participate in the S-Class League.</p><br/><p>Unfortunately, Clear Water was constantly pressured by Myth, a guild led by Liu Wei. Unable to surpass the expectations of their rank, Clear Water’s position was indefinitely stuck as a second-rate guild. This inevitably led to stunted growth in terms of generating revenue for development.</p><br/><p>Compared to other professional players, Zhang Yang joined the game a little too late as well, causing him to fall behind in terms of equipment and level. Even though he may have superior athletic skills, he was still unable to make up for such a huge gap! Furthermore, he had always been a loner and did not have reliable teammates which consequently led to his inability to break through the A-Class League.</p><br/><p>During that time, Liu Wei implemented the Trojan Horse Strategy. He sent a mistress into Clear Water to court Zhang Yang. Zhang Yang and Lin Yu had yet to realize their feelings for each other. Thus, once the hot-blooded Zhang Yang got entangled with the woman, he fell into their trap and almost caused the disbandment of Clear Water.</p><br/><p>Fortunately, Zhang Yang still had a conscience as he felt guilty and lost. During the time he felt depressed, Lin Yu fought back against public complaints and fully supported Zhang Yang. Offering him boundless trust and support, they finally realized their feelings for each other and finally got together.</p><br/><p>Unfortunately, Lin Yu’s business in ‘God’s Miracle’ completely fell through. The elders in the family arranged her marriage with Liu Wei despite her attempts to reject such a proposition. She fought valiantly against the political marriage, but there was nothing that could be done. The only result of her strenuous efforts was that it led to the postponement of her wedding. The events following that caused Zhang Yang to attend the wedding, eventually perishing together with Liu Wei.</p><br/><p>‘Hu!’</p><br/><p>Zhang Yang forced out a breath. Now that he had one chance to do it all over again, he must not allow the same tragedy to repeat itself. If the sole reason the Lin Family would not accept Zhang Yang was because he was powerless, then all of his problems could be solved if he could just obtain status equivalent to the Lin Family. However, to obtain the same status as the Lin Family was not a walk in the park.</p><br/><p>Although Zhang Yang had some fortune in his previous life, he was aware that he was not made for the business world. It was an impossible task for him to become a top entrepreneur nor a successful businessman even if he had the knowledge of future development and trends for the following 5 years. Perhaps, after some of the events were recalled in his mind, he might be able to earn hundreds of thousands of dollars. Nevertheless, it would still be incomparable to them.</p><br/><p>The field in which he was most familiar and proficient in would be ‘Gods Miracle’!</p><br/><p>According to the official statistics of ‘God’s Miracle’ in the ‘5-years game review’, One Sword Stroke was the S-Class League player with the highest income of up to 420 million dollars annually!</p><br/><p>In the review, it was also mentioned that the entire virtual item microtransactions that transacted through the game platform over the 5 years would total up to a whopping 7.9 trillion dollars!</p><br/><p>In reality, Zhang Yang was no prophet but he understood the entire game as a whole. The rise and fall of any materials’ price, the strategy for any dungeon, the tactical strategy for the world boss, the pre-requisite conditions to trigger any hidden quest, all of these information was deeply imprinted inside Zhang Yang’s brain.</p><br/><p>His grand plan was to first set up his own guild to accumulate fame and reputation, preferably making it to the top of the China region, and eventually the top 8 globally. After that, through collecting and monopolizing materials, he could definitely earn a large sum of money. He knew very well that if he was alone, he would be powerless. However, as a guild, it was possible to earn billions of dollars in this godlike game.</p><br/><p>Eventually, the Lin Family would start to seek out alternatives to turn over their aging businesses. When the time is ripe, Zhang Yang would not need to do much and they would personally hand over Lin Yu to him to gain a share of the virtual industry’s fortune!</p><br/><p>As for Zhang Yang, he could achieve his dream of entering the S-Class Professional League to fight for the championship title of the World Team League!</p><br/><p>‘Ta ta ta’</p><br/><p>The clicking sound of the approaching high heels was shrouded by the ringing of the school bell. A beautiful woman walked into the classroom. A formal suit adorned the tall and slender figure. Her complexion spoke volumes of her age, which would be of about 23 to 24 years. She had her long hair tied up into a bun which made her look more or less quite mature.</p><br/><p>“Students, you will all begin to tread your first steps into society and a job in less than 10 days. As your teacher, I bid you the best of fortunes in acquiring a splendid job…”</p><br/><p>Zhang Yang was immersed in his memories, recalling the sweet smile of Lin Yu when the emotions which he suppressed deep within him suddenly erupted like a volcano! Despite it being in the middle of the class, he stood up and rushed out of the classroom. The students stared at his back with stunned eyes. As for the beautiful teacher, she was trembling with rage.</p><br/><p>However, Zhang Yang halted his steps abruptly after exiting the classroom. Presently, he and Lin Yu did not know each other. He could not possibly just rush up to her and announce to her, “Hey, I am your future lover who died and came back in time… come on, let’s fall in love again!”</p><br/><p>I would definitely be treated as a psycho. Bear with it!</p><br/><p>According to ‘history’, Lin Yu would only join one year after ‘God’s Miracle’ began operations. Right now, the only choice he had was to wait. Zhang Yang sighed. Just when he wanted to turn around to return into the classroom, he saw the pretty teacher wearing a scary face with her hands on her hips, blocking the classroom door with her fearsome look.</p><br/><p>“Zhang Yang!” She gritted her teeth as she called Zhang Yang’s name. Her two fists relaxed and clenched alternatingly.</p><br/><p>It was only then that Zhang Yang noticed her. This pretty teacher was Yu Li, the person who he would have a one night stand with. He was drunk at that time and did not have much of an impression of that night. But right now, he could clearly recall that her body was sexually voluptuous! Hidden underneath the suit were the enticing curves of her bodyline!</p><br/><p>By looking at her jade-white neck, his eyes stared instinctively at those well-covered peaks. As a student, Zhang Yang found it difficult to look at his teacher in ‘that way’. A fiery sensation came to him, as if the ‘fierce battle’ between them happened just not too long ago. With that, even if he saw less at the moment, he seemed to be able to see even more clearly!</p><br/><p>He smiled with his teeth wide open and said, “Teacher, I want to go to the restroom!”</p><br/><p>Yu Li was about to go crazy!</p><br/><p>This brat, not only had he rushed out the classroom during class hours without even asking for leave, he even dared to stare at her with those invasive eyes. It made her feel naked and defenseless, as if he could see through her formal attire.</p><br/><p>Angry and abashed, Yu Li pointed towards the restroom and said, “Go!”</p><br/><p>Zhang Yang nodded and dashed off like the wind. He returned to the classroom after loitering around for a while. He greeted Yu Li and sat in his seat. However, Zhang Yang gazed up only to notice that Yu Li was still angry. Although her expression was solemn, there was a hint of flirtatious flush on her jade-white skin.</p><br/><p>Yu Li had always been an attractive woman. She had always been the target of obscenity among the boys. Currently, with such a vulnerable look, it only made all the boys slobber endlessly. Zhang Yang used to be one of those boys who secretly had a crush on Yu Li. But as time went by and more trouble arose, he began to leave behind his days of student romance.</p><br/><p>He wondered. “Miss Yu is so beautiful, why would she work as a hostess? What a waste! If there is a chance, I would definitely help her!”</p><br/><p>Yu Li announced the end of the class after the two-period class session concluded. Before she left the room, she threw a ferocious look at Zhang Yang.</p><br/><p>The students began to make some noise the second the teacher left.</p><br/><p>“Zhang Yang, what are you going to do after graduation?” Li Shang Yuan handed an address book to Zhang Yang. People usually jot down contact numbers when they approached graduation in order to keep in touch in the future.</p><br/><p>Zhang Yang took the book and wrote his home phone number casually. He said, “Probably a professional gamer!”</p><br/><p>“A professional gamer?” A fatty called Zhao Xiao Song squeezed over. His nickname was ‘Chubby Pole’. He said, ”Can you earn money by playing games?”</p><br/><p>“I am not sure about other games, but if it’s ‘God’s Miracle’, it is most definitely possible to earn a lot!” A thin and tall person called Zhou Xiang joined the discussion and continued, “I have a relative working at Dream Technology. According to him, the gaming helmet for ‘God’s Miracle’ had sold more than 500 million units!”</p><br/><p>“What gaming helmet?” Some people came over and asked casually.</p><br/><p>“Tch, don’t tell me you have not watched television or even surfed the web? Advertising for ‘God’s Miracle’ covers the entire globe. It’s the world’s first super virtual reality game in the history. Say goodbye to traditional games. Now you can access the game anywhere and anytime with just a helmet! It’s all thanks to Dream Technology that the game can finally operate this year after more than 10 years of beta testing!” One of the fans of the game spoke emotionally.</p><br/><p>“If it’s really that fun, I will go buy one and try it out later.”</p><br/><p>“Come, let’s do a head count, those who want to play ‘God’s Miracle’ please register. We’ll establish a guild and embark on ‘God’s Miracle’ together!”</p><br/>\n</div>"}