{"title": "Chapter 5: Rapid Leveling", "id": 5, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-5-rapid-leveling", "volume_title": "Volume 1", "body": "<h1>Chapter 5: Rapid Leveling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 5: Rapid Leveling</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Slash!</p><br/><p>Zhang Yang bent down and evaded the monster's attack.</p><br/><p>If other players witnessed this, they would have yelled, \"Impossible!\" or something in a similar manner. In traditional gaming, the Evasion Rate was determined by the system. Even if the player could not move an inch, the evasion could still occur when an attack landed on the player.</p><br/><p>But in ‘God's Miracle', there was no Evasion Rate system. But this did not mean that the player could not evade attacks from monsters or players. The system entrusted this capability to the player, allowing them to make their own decisions.</p><br/><p>If the player's reaction was quick enough, the Evasion Rate would also rise proportionately. However, reaction alone did not determine the Evasion Rate of a player. The other factors that contributed to increasing the evasion rate would be Movement Speed, which was subsequently affected by the Dexterity of the player. The higher the Dexterity, the faster the Movement Speed. That was why Zhang Yang’s investment in Dexterity had not solely increased his Movement Speed but also his Critical Rate!</p><br/><p>Currently, many players were not used to this change while some were even oblivious to it. It was only a month later when a battle recording was uploaded to the forum that the thought of Manual Evasion was gradually made known to these players.</p><br/><p>Zhang Yang let out a soft huff. The Beginner Sword in his hands swung every 2 seconds, until his Rage was raised to 30. This led to Zhang Yang activating his . Half a minute later, the specter transformed into a pillar of light, signaling its defeat.</p><br/><p>'Ding! You have killed undead villagers. 200 EXP gained'</p><br/><p>'Ding! You have obtained 5 Copper pieces! You've obtained Linen x2!'</p><br/><p>He did not obtain a quest item, but it did not matter as he still had to collect more Linen anyway. And up until now, there were no other players that stole his kills! The worst kind of situation for those who aimed to boost their levels was a bad monster to player ratio. This place seemed a little too hellish but for Zhang Yang, it was a heavenly spot.</p><br/><p>After he collected the loot, he continued luring monsters one-by-one to kill them. In a place where monsters were concentrated, Zhang Yang did not use the skill as it would easily engage more than two monsters. Based on his capabilities, Zhang Yang could easily evade the simultaneous attacks from seventeen monsters at once. But because he did not possess any Area of Effect (AoE) attacks, he did not want to waste his efforts to do it.</p><br/><p>Even though grinding Level 4 monsters was slow, the experience points given was high. In 10 minutes or so, he hit Level 3. After he invested his AP in the same manner as before, allocating 4 to Strength and 1 to Dexterity, he pulled out his sword and continued on slashing.</p><br/><p>'Ding! You have obtained Mysterious Black Box'</p><br/><p>[Mysterious Black Box] (Quest Item)</p><br/><p>Description: A complicated magic is engraved on this box. It carries an ancient and evil aura. Perhaps it is wise to bring it back to Village Elder Hu An to inspect!</p><br/><p>Even with his quest completed, he did not want to leave the leveling ground. Now that other players have yet to discover this place, he quickened his pace and continued grinding.</p><br/><p>There were a total of twelve chambers and each chamber had seven to eight monsters inside. He cleared each and every one of them. Alone, his killing speed could not keep up with the monster's spawn rate. Usually, after clearing the 3rd chamber, the 1st chamber would spawn new monsters. Zhang Yang trained and trained and only after he reached Level 4 did a second player finally arrive. Following closely, a third player arrived and no sooner, the fourth.</p><br/><p>When he reached Level 5, the field had more than twenty players. The monster spawn rate could not keep up with this many players. Zhang Yang was satisfied. He looked around and noticed that the highest leveled player among them was 3. He had gained an enormous leading advantage.</p><br/><p>Zhang Yang consolidated the Linen his inventory as he headed back to the village. 20 pieces a stack and he had 19 stacks and a half which could easily be sold for 18 Silver Coins.</p><br/><p>In ‘God's Miracle' 1 Gold Coin was worth 100 Silver Coins and 1 Silver Coin was worth 100 Copper Coins, similar to other traditional games.</p><br/><p>Zhang Yang gained 3000 EXP and a pair of White-tiered gloves after he had surrendered the Mysterious Black Box to Village Elder Hu An. Normally, the Beginner Village quests would not award any good items. Of course, there were exceptions!</p><br/><p>Zhang Yang arrived at a Tailor Shop and found Apprentice Tailor Annie. She had an exclamation mark on her head, indicating an available quest.</p><br/><p>\"Young adventurer! I need a lot of Linen to help increase my skill. If it is not too much trouble, could you help me collect some Linen?\" Annie looked shyly at Zhang Yang, as if she was embarrassed to ask him for his help. This super realistic feature made the Non-Player Characters (NPC) look as though they possessed a conscience. This was also one of the features that made ‘God's Miracle' the greatest game in history.</p><br/><p>'Ding! Annie has a quest for you: A Generous Gift. Will you accept it?'</p><br/><p>Zhang Yang smiled weakly and selected 'Accept'. He then took out a stack of Linen and turned it over.</p><br/><p>\"Ah! Thank you so much! You're such a kind person! With these Linen, I will definitely improve my craft and become an official Master Tailor!\" Annie replied excitedly.</p><br/><p>'Ding! You have completed the quest: A Generous Gift. Gained 5000 EXP!'</p><br/><p>\"Young adventurer, to thank you for your generosity, I'm willing to sew you a cape! I am only able craft a Rough Wolf Pelt Cape, but it can boost your abilities!\" Annie continued as an exclamation mark appeared on her head.</p><br/><p>'Ding! Annie has a quest for you: Annie's Gratitude. Will you accept it?'</p><br/><p>[Annie's Thanks] (Difficulty Level: D)</p><br/><p>Quest Description: Your kindness and generosity moved Annie. She has decided to use her ability to make you a Wolf Pelt Cape. But you must gather 10 Wolf Pelts and 40 Linen as material. You can't make porridge without rice, right?</p><br/><p>Progress: Wolf Pelt 10/10 Linen 40/40</p><br/><p>This was the reason why Zhang Yang first completed the quest 'Clear the Wolves', to hunt for the 10 Wolf Pelts! As for the catacombs, his aim was not only to gather Linen but also to grind levels.</p><br/><p>Annie's quests required the player to be Level 5 before it was available. If it was not Zhang Yang but a regular player, they would have sold their Wolf Pelt to an NPC. Even if they kept them, they would not have accumulated that much!</p><br/><p>When they had achieved Level 5 and was given this quest, they would have to return to the previous location to kill more wolves. Furthermore, based on the ridiculous number of new players, it would be an impossible task. This was in addition to the fact that Linen was only dropped by humanoid-type monsters, and the spectres were the only humanoid monsters around the village…</p><br/><p>Zhang Yang had suffered before, previously he had wasted so much time running up and down to complete this quest. Luckily, that was when the servers had been running for 2 years. The entire Beginner Village was bare and no one was there to compete with him.</p><br/><p>'Ding! You have completed the quest: Annie's Thanks. Gained 5000 EXP!'</p><br/><p>'Ding! You have obtained Wolf Pelt Cape!'</p><br/><p>A flashing black, shiny cape appeared in his inventory as he completed the quest. This was the reward for completing a quest, and also the first Black-Steel equipment any player could get from a quest!</p><br/><p>[Wolf Pelt Cape] (Black-Steel, Cape)</p><br/><p>Vitality: +2</p><br/><p>Strength: +1</p><br/><p>Dexterity: + 1</p><br/><p>Level Requirement: 5</p><br/><p>Note: This cape was obviously made by an apprentice tailor. It is an uncommon, ragged and patchy cape! Is this cape even reliable at all?\"</p><br/><p>Usually, there was yellow text attached to an equipment which included lore for immersion. As for the lore on this cape, the developers must have be trolling to include such a funny description!</p><br/><p>Zhang Yang looked at Annie again. This time, a blue-colored exclamation mark appeared on the shy girl's head! In the game, a blue exclamation mark indicated a repeatable quest.</p><br/><p>'Young adventurer! I need a lot of Linen to help increase my skill. If it is not too much trouble, could you help me collect some Linen?</p><br/><p>Zhang Yang turned over stacks of Linen, one stack a time.</p><br/><p>'Ding! You have completed the quest: A Generous Gift. (Repeatable) Gained 5000 EXP!'</p><br/><p>'Ding! You have completed the quest: A Generous Gift. (Repeatable) Gained 5000 EXP!'</p><br/><p>'Ding! You have…'</p><br/><p>With the system notifications appearing repeatedly, Zhang Yang achieved Level 6 when he turned over his twelfth stack of Linen. The exclamation mark on Annie's head finally disappeared.</p><br/><p>This repeatable quest was only available for players at Level 5.</p><br/><p>In less than half a minute, Zhang Yang leveled up. As of now, the other players should probably be struggling at Level 2 or 3. Even if luck was on their side, they could only be at Level 4. Well, since there were too many people, they were all competing with each other which led to everyone not being able to obtain sufficient monster kills.</p><br/><p>Without stopping, Zhang Yang left the Tailor Shop and headed to the village hall. There, he found Warrior Class Instructor Farion.</p><br/><p>\"Ahh, this is sad. As a Guardian, you don't even have a shield? You embarass me!\" The instructor who looked like he was in his 30s said in contempt, almost spitting on the ground to emphasize his statement.</p><br/><p>Well, it could not be helped. No matter what class a player was at Level 5, they would face this kind of embarrassing moment. For example, if a Berserker came up to him, the man would have said something like, \"Ahh, this is sad. As a Berserker, you are actually holding on to a tattered weapon like that. Do you want to be a woodcutter instead?\"</p><br/><p>And this was the time when the player will receive their first Class Quest and the reward would be a class-specific Black-Steel weapon!</p><br/><p>\"In the name of the God of War and beyond, you must be tested. Only then would I consider instructing you!\" Instructor Farion’s face showed disdain, as he passed Zhang Yang a piece of paper. \"Greenhorn, you are not to return to me unless you have completed the task listed on the paper!\"</p><br/><p>'Ding! You have accepted the quest: A Warrior's Trial.’</p><br/><p>[A Warrior’s Trial] (Difficulty Level: C)</p><br/><p>Quest Description: Fulfill Farion's demands! Greenhorn, you must become a true warrior!</p><br/><p>Progress: Iron Ore 3/200</p><br/><p>What came next would highly depend on luck! Iron Ores could be mined or bought from other players and the difficulty of this quest was due to the time required to complete it.</p><br/><p>This kind of setting would have definitely irked anyone. As beginners, they did not want to have to waste too much time just to complete this. In the near future, the game developers would adjust the completion condition to only 20 Iron Ores.</p><br/><p>But Zhang Yang did not have much time to idle, waiting for the adjustments to be implemented. With that much time, he could have possibly leveled up to Level 10 or even 20.</p><br/><p>Additionally, there was a chance to trigger the Warrior class’ hidden quest.</p><br/>\n</div>"}