{"title": "Chapter 14: Who is the Noob?", "id": 14, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-14-who-is-the-noob", "volume_title": "Volume 1", "body": "<h1>Chapter 14: Who is the Noob?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 14: Who is the Noob?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>“-1!”</p><br/><p>“-1!”</p><br/><p>“-1!”</p><br/><p>3 pathetic damage figures floated across the 3 Gnome Soldiers’ heads. 6 monsters roared at the same time and charged towards Kindling Chest Hair.</p><br/><p>Kindling Chest Hair remained rooted and activated the skill . A white light flashed beneath his feet while a magic circle with a radius of 2 meters appeared. The moment those Gnome Soldiers entered the circle, “-1” and “-2” damage texts flashed above their heads with each passing second.</p><br/><p>[Devotion]: Deals 100% Holy damage to all targets within 10 seconds. Holy damage is categorized as magic damage and is unaffected by Defense.</p><br/><p> and were both very powerful skills. Unfortunately, they would require a significantly higher Strength value to properly deal decent damage. Since Kindling Chest Hair used a pure tank build, he had completely ruined these 2 skills.</p><br/><p>“Alright, everyone start attacking! No one is allowed to slack! I will put out the damage statistics when we’re done! No equipment for the lowest damage dealt!” said Flowery Pants in the party channel as he dashed forward wielding two swords – a Bandit.</p><br/><p>Zhang Yang was an off tank, meaning he was to hold aggro onto monsters and avoid competing with the main tank’s enmity. He had waited until Kindling Chest Hair took on all 6 Gnome Soldiers before rushing forward to take one on.</p><br/><p>“-62!”</p><br/><p>With just one normal attack from Zhang Yang, the monster had immediately turned its head and thrusted the spear raised in its hand towards Zhang Yang.</p><br/><p>Yup, definitely OT! Luckily he was also a tank!</p><br/><p>Kindling Chest Hair was furious and scolded, “Noob, don’t use to pull monsters, do you even know how to play?” He was too self-confident, thinking he had already established a lot of aggro. He thought that the monster had turned around only because Zhang Yang had used .</p><br/><p>“That’s right! If you use too many times, the monster will become immune to it! You f*cking noob!” Prideful Precepts followed.</p><br/><p>These two idiots were hopeless but there was no need to explain his actions as only the truth would prevail!</p><br/><p>The damage dealing team had begun their attack, as fireballs and frost arrows filled the space. All Gnome Soldiers except the one Zhang Yang was luring had ignored Kindling Chest Hair and had made their way towards the attacking team.</p><br/><p>Floral Shorts showed no responsibility as a party leader, abandoning everything after yelling attack, and had only swung both his swords, relishing in the joy of stabbing the monsters’ back. Everyone was attacking their own monster with no intention to draw their attacks together to kill one monster at a time; Kindling Chest Hair’s enmity grabbing skills was too low, causing 5 monsters to go after the OT at the same time!</p><br/><p>“F*ck, the f*ck is our Defender doing? Pull them properly!” A mage who was in the middle of casting a fireball stopped his action and shouted in bewilderment.</p><br/><p>Kindling Chest Hair was terrible at holding aggro though his skills in refuting was not bad at all, arguing back immediately, “F*ck! You OT the monster and dared to complain? Noob! Get the f*ck out!”</p><br/><p>“You’re the noob! If I’m the only one who OT-ed the monster, then it would be fine! But now 5 monsters OT-ed simultaneously! Only you can achieve this sort of wonderful work!” the mage shot back.</p><br/><p>Zhang Yang used and managed to keep up with the monsters that had lost control. He swung his sword and activated , yellow damage text floated across the heads of those 5 monsters at once.</p><br/><p>“-137!”</p><br/><p>“-148!”</p><br/><p>“-145!”</p><br/><p>“-298!”</p><br/><p>“-139!”</p><br/><p>There was an unexpected Critical Strike!</p><br/><p>One monster was stunned from while the remaining four monsters turned back and attacked Zhang Yang.</p><br/><p>“Block!”</p><br/><p>Zhang Yang raised his shield, successfully blocking 4 monsters’ attacks at the same time!</p><br/><p>According to ’s skill description, each use could only block one attack. However, Zhang Yang had wittingly adjusted his position, causing the setup of 4 simultaneous attacks from the monsters. Since the attack gap was too short, the system had considered them as one attack, allowing to successfully ward off all incoming attacks!</p><br/><p>It was unsure if this was considered a bug. The gaming company had long since realized about this but had not removed or patched it. They instead claimed that this particular moment was difficult to master, and so if someone could pull it off they should consider it as a bonus from the system!</p><br/><p>“-45!”</p><br/><p>“-45!”</p><br/><p>“-45!”</p><br/><p>“-45!”</p><br/><p> reflected the damage, as 4 yellow damage text flashed accordingly.</p><br/><p>Zhang Yang raised his shield, aimed towards the stunned monster and bashed it.</p><br/><p>“-105!” !</p><br/><p>At this point, the stunned monster had recovered and the monster Zhang Yang had been pulling initially had also charged forward. Remaining calm, Zhang Yang evaded all 6 monsters’ attacks with a side step, while gathering all the monsters onto a mound through his strategic movement.</p><br/><p>Dodged!</p><br/><p>Dodged!</p><br/><p>Dodged again!</p><br/><p>Zhang Yang’s HP remained untouched since the beginning, easing through the monsters’ bombarding attacks.</p><br/><p>“Expert!” The other five party members who were not from Pride cried in astonishment</p><br/><p>.</p><br/><p>“Oh my God, such high damage, is he really a tank?”</p><br/><p>“No wonder his HP is low. All his AP were added to Strength!”</p><br/><p>“He could only allocate AP in such a way because he was so skillful. Can’t you see that he hasn’t received any damage?”</p><br/><p>Jealousy stemmed froms the fear of comparison!</p><br/><p>Kindling Chest Hair could not hold it in any longer. Holding his war hammer, he ran up to Zhang Yang and used , pulling 3 monsters to himself.</p><br/><p>[Justice Defense] was a Defender’s provoking skill. Each activation could only provoke 3 monsters, forcing them to attack the caster for 2 seconds. This would be why a tanking Defender was much more suitable to pull monsters in a group.</p><br/><p>Kindling Chest Hair unleased all of his high enmity skills on those 3 monsters, earnestly hoping to pull aggro, but after 2 seconds, the monsters had returned to attack Zhang Yang immediately, completely ignoring Kindling Chest Hair!</p><br/><p>Kindling Chest Hair was both embarrassed and angry. He casted once again, right after the 10 seconds cooldown time, only to receive the same result.</p><br/><p>“Defender! Stop pulling! Each time the monster attacks you, your HP drops rapidly. You’re putting a load on the healers!”</p><br/><p>Prideful Babysitter, a Priest from Pride, and the guildless Sacred Knight Ocean Despair were unhappy but it was the latter who complained. Prideful Babysitter had not voiced out due to being in the same guild as Kindling Chest Hair.</p><br/><p>Kindling Chest Hair was infuriated, mentally blocking off the complaints. was activated once again after 10 seconds, annoying Ocean Despair to the point of being speechless.</p><br/><p>Zhang Yang marked one of the Gnome Soldiers and said, “Focus and kill the marked monster!”</p><br/><p>Everyone was cooperative, changing their target and switching to attack the one Zhang Yang had marked. Unfortunately, Floral Shorts and Prideful Precepts had ignored his words and continued to deal damage to their own targeted monster.</p><br/><p>“Pa! Pa!”</p><br/><p>Half a minute later, 2 Gnome Soldiers had fallen under the focus fire.</p><br/><p>Kindling Chest Hair’s face turned sour. As he activated for the fourth time, none of the monsters were affected. – If was used against a monster for too many times in a short period, the monsters would develop an immunity against it.</p><br/><p>“Pa! Pa! Pa! Pa!”</p><br/><p>One by one, the monsters fell and soon after the last was killed, everyone was withdrawn from Combat Mode.</p><br/><p>Zhang Yang frowned as he checked the damage statistics.</p><br/><p>[Damage Statistics]</p><br/><p>1. Zhan Yu, 12354 damage, 41%</p><br/><p>2. Hundred Shots, 4509 damage, 15%</p><br/><p>3. Snowy Death, 3313 damage, 11%</p><br/><p>4. Defiant Monk, 3051 damage, 10%</p><br/><p>5. Flame Emperor, 2422 damage, 8%</p><br/><p>6. Prideful Precepts, 2102 damage, 7%</p><br/><p>7. Floral Shorts, 1893 damage, 6%</p><br/><p>8. Kindling Chest Hair, 1287 damage, 4%</p><br/><p>It was astonishing that Zhang Yang had ranked first in dealing damage. ’s AoE was devastating! The counter attack damage after was also substantial – of course, only a professional player like him could have utilized this skill to also deal AoE damage.</p><br/><p>“Very good. No one died. Hairy, you’ve done well!” Floral Shorts blatantly lied, singing praises of Kindling Chest Hair.</p><br/><p>Flame Emperor chuckled unamused and posted the damage statistics in the party channel.</p><br/><p>There was a moment of silence.</p><br/><p>“F*ck! What is this shit! A Guardian is the top DPS? What a joke! There must be a problem with the system!” Prideful Precepts jumped to his feet and said. How embarrassing, those Pride members, other than the Priest, the other three were the lowest in the damage statistics!</p><br/><p>“Go on! Go on!” Floral Shorts diverted the topic and urged everyone to move forward. Kindling Chest Hair had a grave look and periodically stared at Zhang Yang, his eyes filled with hostility.</p><br/><p>The second wave had much fewer monsters. There were only 2, guarding the corner of a passageway.</p><br/><p>“Noob Warrior! Keep your eyes on me! I’ll teach you how to properly pull a monster!” Kindling Chest Hair had thought that while he might be unable to pull 6 monsters, but since there were only 2 now, it should not be a problem!</p><br/><p>Prideful Precepts chimed in, “Noob, just stand there and don’t move!”</p><br/><p>Zhang Yang lightly smiled and as they had wished, stood still and watched Kindling Chest Hair rush towards the 2 monsters while wielding his war hammer.</p><br/><p>[Executioner Gnome] (Elite)</p><br/><p>Level: 12</p><br/><p>HP: 6000</p><br/><p>In ‘God’s Miracle’, monsters which guarded entrances were known as ‘Gate Gods’, their most notable characteristic being their extraordinary attack power! Killing tanks within seconds was a common feat.</p><br/><p>Prideful Precepts and his gang did not know about this but Zhang Yang understood this piece of information thoroughly. Since Kindling Chest Hair had wanted to send himself straight to death, why should he stop him?</p><br/><p>“Such a pity though, that being killed by monsters would not reduce their levels but would only damage their equipment durability or inflict a very small chance of dropping their equipment. If only it could be the same as PK where death would cost a drop in player’s level!” Zhang Yang thought regrettably.</p><br/><p>Kindling Chest Hair walked a few steps forward and casted on the Executioner Gnome.</p><br/><p>After being attacked, both ‘Gate Gods’ furiously dashed towards Kindling Chest Hair. This time, everyone had learned from their experience and did not engage, as they had the knowledge that a certain someone’s aggro holding could not be trusted.</p><br/><p>“-105!”</p><br/><p>“-97!”</p><br/><p>Both monsters stabbed Kindling Chest Hair with their spears, delivering a significantly high damage, removing a third of Kindling Chest Hair’s HP immediately.</p><br/><p>Kindling Chest Hair was startled. Before he could even react, two more damage texts floated over his head.</p><br/><p>“-99!”</p><br/><p>“-102!”</p><br/><p>“Ding! Executioner Gnome uses !”</p><br/><p>“Ding! Executioner Gnome uses !”</p><br/><p>“-200!”</p><br/><p>“-200!”</p><br/><p>“Ding! Player Kindling Chest Hair has died!”</p><br/><p>Instant kill! F*ck yeah!</p><br/>\n</div>"}