{"title": "Chapter 21: A Piece of Cake", "id": 21, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-21-a-piece-of-cake", "volume_title": "Volume 1", "body": "<h1>Chapter 21: A Piece of Cake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 21: A Piece of Cake</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Once Zhang Yang gave his order to attack, everyone started to deal damage with all their might.</p><br/><p>‘Ding! You are affected by (Stack 1). All damage received increased by 100%, lasts for 12 seconds!’</p><br/><p>Not long after their attacks begun, Zhang Yang had received a debuff effect enveloping his entire body with a dark gas. Zhang Yang did not mind it but Crimson Fire was panicking internally, thinking, “The boss already has a high attack. Adding this stack of debuff means Zhang Yang would be instantly killed in just one strike!”</p><br/><p>However, it was proven that his worries were irrelevant! Zhang Yang was dodging and attacking repeatedly without any sign of panic as he moved around agilely under the boss’ brutal attacks. The scene would have led people to believe that he was just having a stroll in his garden!</p><br/><p>Oh come on, this is a Hard Mode boss! Crimson Fire shouted in his heart. His own guild had formed a so-called elite dungeon explorers team1 but they were wiped2 several times facing this first boss. If it had not been to witness Zhang Yang’s capabilities and to recruit him, he would have remained at the first boss, repeating the round endlessly.</p><br/><p>How could he just dodge the boss’ attacks that easily? Crimson Fire could not comprehend it, as he had observed that Zhang Yang had not spent much effort at all – a slide to the right, a dodge to the left, how relaxed! How was it that the two tanks from his guild became ruthlessly crushed by the boss even though they had given their all?</p><br/><p>“As expected of brother expert!” said Snowy Death with a look of extreme pride on his face, as if he was the one fighting the boss now instead of Zhang Yang.</p><br/><p>As Crimson Fire unrelentingly attacked the boss, his gaze towards Zhang Yang became filled with a burning passion and his desire to recruit Zhang Yang into his guild grew stronger!</p><br/><p>The ease Zhang Yang had in dodging the boss’ attacks was, in fact, built upon his 5 years of experience of metagaming! Based on his instincts, each time the monster had made slight jerk, Zhang Yang would have been noted of where the next attack would come from and could dodge correspondingly in advance. This was all experience and metagame knowledge!</p><br/><p>Suddenly, Black Claw stopped its attacks and turned. With a ‘ptui’, a black spit shot towards Defiant Monk.</p><br/><p>A red damage text with ‘-300’ then floated across Defiant Monk’s head immediately. Luckily his own HP was high enough to withstand the attack. After deducting the 300 points of damage, he was still left with a mere 40 HP. With several heals from both Ocean Despair and Silky Snow, the party returned to its original attacking momentum.</p><br/><p>To be honest, this boss’ key difficulty lay with the tank!</p><br/><p>Due to , the party would usually have two tanks. These two tanks would need to coordinate the aggro to prevent the tank’s death from over stacking on one of them. Once one of the two tanks died, the other tank would surely end up with the same fate – unless the party was strong enough to have killed the boss before any tank had fallen.</p><br/><p>However, Zhang Yang was an exception! Having 5 years of superior metagaming experience, dodging the boss’ fierce attacks was a piece of cake – effortless! He had speculated that even if it were a boss from Hardcore Mode, he could also still perform a 90% and above dodge rate!</p><br/><p>Now that he had solved the issue of the tank’s death, this boss would definitely be a piece of cake!</p><br/><p>90%, 80%, 70%, ...10%!</p><br/><p>Black Claw’s HP ran low and hit rock-bottom in an instance. With one last from Zhang Yang, Black Claw let out a loud growl and fell, popping equipment and gold coins on the ground.</p><br/><p>“It’s over?” Crimson Fire thought he was dreaming. This boss that had taken his guild several hours to defeat was so easily killed by a pub party in just one try?</p><br/><p>How conflicted he was! On one hand, he had wanted Zhang Yang to kill the boss to prove his worth in being recruited; and on the other hand, he did not want the battle to end so soon, as it would only prove that his guild’s elite dungeon explorers team was just a lousy piece of…</p><br/><p>“How was it? I told you brother expert is the greatest!” Both being Bandits, Snowy Death had instinctively felt closer to Crimson Fire, patting his shoulder with a pride-filled face. Crimson Fire could not help but curse internally at him boasting about Zhang Yang’s achievement like it was his.</p><br/><p>“Litte Yang, I’m the ‘Lucky Hand’, let me touch the corpse!” said Fatty Han as he went over immediately to loot the corpse.</p><br/><p>According to an official statement by ‘God’s Miracle’, loots from monsters were determined by players who did the last strike. However, most of the players were still superstitious, choosing to believe that loots would depend on the luck of players who touched the corpse, thus the birth and existence of the terms Lucky Hand and Unlucky Hand.</p><br/><p>Fatty Han touched the corpse and a Roll-the-Dice window for the 3 equipment immediately appeared in front of everyone.</p><br/><p>[Black Claw Rage Fist] (Black-Steel, Fist Gloves)</p><br/><p>Weapon Attack: 15 – 23</p><br/><p>Attack Interval: 1.9 seconds</p><br/><p>Level Requirement: 10</p><br/><p>Both were fist gloves but compared to the pair in Normal Mode, this pair’s Weapon Attack was obviously higher!</p><br/><p>Both Bandits had chosen to roll while the rest of the party passed. Even though both Zhang Yang and Phantom Day could also equip themselves with fist gloves, one had already owned a Level 10 Black-Steel weapon while the other preferred two-handed weapons, so none of them rolled along with the Bandits. In the end, Snowy Death had rolled 87 and won over Crimson Fire’s 82, obtaining the fist gloves.</p><br/><p>Snowy Death happily changed into his newly obtained weapon while flaunting it to Crimson Fire. The players who were not from Lost Paradise had somewhat felt that they were much closer to Zhang Yang, subconsciously ostracizing those from said guild as they felt that Lost Paradise players seemed to have joined for convenience.</p><br/><p>[Dog-faced Helm] (Black-Steel, Heavy Armor)</p><br/><p>Defense: +3</p><br/><p>Vitality: +6</p><br/><p>Strength: +3</p><br/><p>Dexterity: +1</p><br/><p>Level Requirement: 10</p><br/><p>Both Knight and Warrior classes could wear heavy armor but Ocean Despair was a healer and the helm had physical attack attributes so he voluntarily passed.</p><br/><p>Zhang Yang, 47 points.</p><br/><p>Phantom Day, 33 points.</p><br/><p>“Ugh! Unlucky hands!” Phantom Day shook his head in disappointment.</p><br/><p>Zhang Yang put on the helm and his entire face was promptly hidden behind a dog head. At a glance, he looked like an actual standing dog!</p><br/><p>Everyone burst into laughter once they saw him.</p><br/><p>“Little Yang! Wow! You’re so handsome right now!” Fatty Han guffawed.</p><br/><p>Fortunately the game had the option to hide the helm and Zhang Yang checked the option immediately. Only then did the dog face disappear but the party was still holding in their snickers, the corners of their mouths twitching whenever they looked at Zhang Yang’s face.</p><br/><p>[Shiny Heavy Boots] (Black-Steel, Heavy Armor)</p><br/><p>Defense: +3</p><br/><p>Vitality: +5</p><br/><p>Intelligence: +4</p><br/><p>Spirit: +1</p><br/><p>Level Requirement: 10</p><br/><p>This was obviously a Sacred Knight’s equipment, so everyone passed to allow Ocean Despair to obtain it without any hesitation.</p><br/><p>‘Ding! You have received 1 silver coin and 30 copper coins in distribution!’</p><br/><p>After distributing the equipment, the money was collected. This boss was a stingy one, only dropping 13 silver coins.</p><br/><p>The currency control in ‘God’s Miracle’ was fairly strict. Currency inflation was never a problem even in the later stages of the game.</p><br/><p>“Let’s take a look at the damage statistics!” said Phantom Day excitedly. For a lot of players, raiding dungeons provided them with two pleasures in life: first, getting equipment; second, comparing damage!</p><br/><p>When everyone checked the statistics, they were dumbfounded.</p><br/><p>[Damage Statistics]</p><br/><p>1. Zhan Yu, Total Damage 11,345, 21%</p><br/><p>2. Slim and Handsome, Total Damage 8,647, 16%</p><br/><p>3. Phantom Day, Total Damage 7,566, 14%</p><br/><p>4. Crimson Fire, Total Damage 7,027, 13%</p><br/><p>5. Hundred Shots, Total Damage 5,401, 10%</p><br/><p>6. Snowy Death, Total Damage 4,863, 9%</p><br/><p>7. Defiant Monk, Total Damage 4,861, 9%</p><br/><p>8. Flame Emperor, Total Damage 4,328, 8%</p><br/><p>“Zhan Yu! Are you actually a Guardian or a Berserker?” Phantom Day exclaimed. He was so confident that he would place first in dealing damage but he had never guessed that not only could he not place first, he was not even ranked second!</p><br/><p>Fatty Han immediately agreed with him, “Yeah! That’s right! I should’ve been at the top of the list!”</p><br/><p>This fat f*ck had completed a Hidden Class Quest and had obtained . Even though it was only an ‘Average’ score reward skill, he still possessed an additional skill and extra AP compared to his peers. With everyone’s mediocre equipment, the advantage of having a skill would have been magnified.</p><br/><p>Crimson Fire’s eyes burned with passion, he was even more eager to recruit such a talent now! His glinting pair of eyes was as like that of a sex-deprived widower, scaring Snowy Death who had caught a glimpse and had immediately created some distance from him, thinking that the man might have a different orientation in some aspects!</p><br/><p>“Let us continue then!” Zhang Yang swung his sword, leading the team forward.</p><br/><p>He had established an absolute authority, no one had any objection. After around 10 minutes of killing minions with utmost ease, the party had reached the second boss.</p><br/><p>Compared to Normal Mode, this boss had much higher HP and damage, dealt more damage and summoned demon puppets were also more powerful. However, Zhang Yang’s party had also swapped in 3 Lost Paradise elites, boosting their battle power significantly.</p><br/><p>Therefore, Zhang Yang did not care to explain much since the boss’ skills were the same. They only had to follow the same strategy as the one in Normal Mode.</p><br/><p>With an attack command, Zhang Yang led the party and bashed the boss. Within just 4 to 5 minutes, the second boss wailed upon its death and had equipment scattered all over the ground.</p><br/><p>Upon looting the corpse, there were only 1 leather armor and 2 cloth armor with no heavy armor in sight, annoying Phantom Day to the extent of him calling Fatty Han ‘Unlucky Hands’ and declaring that he was not allowed to loot the corpse the next time.</p><br/><p>The party chatted merrily. After they had distributed the equipment, they moved on and had killed the last boss after clearing waves of minions.</p><br/><p>Ever since defeating the first boss Black Claw, no one had any more doubts in clearing Hard Mode! Zhang Yang was ridiculously strong. Everyone had felt that he only had to bring along a healer… no, there was probably no need for a healer, just him alone could have cleared the entire Hard Mode!</p><br/><p>Their challenge now laid within Hardcore Mode!</p><br/><p>Translator Note</p><br/><p>1 A team formed to explore an uncleared dungeon to discover and understand the mechanics of the run. This will aid the top team of a guild in clearing the dungeon with record time.</p><br/>\n</div>"}