{"title": "Chapter 22: Hardcore Mode", "id": 22, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-22-hardcore-mode", "volume_title": "Volume 1", "body": "<h1>Chapter 22: Hardcore Mode</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22: Hardcore Mode</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>“Brother expert, are we still doing Hardcore Mode?” Snowy Death gazed hopefully at Zhang Yang, he was afraid that the latter might say no. It was not just him, the rest of the party was also staring at Zhang Yang with puppy eyes.</p><br/><p>Zhang Yang had proven himself to be capable of challenging, perhaps even clearing Hardcore Mode! As for gamers like them, there was no better glory than having the server announcements spam their names.</p><br/><p>Just imagining the rows of red text from the server announcement hovering was enough to fill one with mind-numbing excitement!</p><br/><p>Zhang Yang laughed and said, “Of course!”</p><br/><p>Hearing his promise, the rest of the party all had delighted smiles.</p><br/><p>“But I need to say something first!” Zhang Yang claimed, “I will need a Smithing recipe that would only be dropped by Hardcore Mode’s hidden boss, Momorermo. If anyone has any objection, speak up now so it won’t be awkward later!”</p><br/><p>“Brother expert, I’m fine with it even if you want to claim all the equipment that dropped, let alone a recipe!” Snowy Death said excitedly.</p><br/><p>A red text server announcement! That would have been much more enticing than any equipment!</p><br/><p>“No problem!” the crowd replied.</p><br/><p>“Alright, let’s go to Hardcore Mode!” Zhang Yang adjusted the dungeon difficulty and said, “Let’s go!”</p><br/><p>One by one, all ten of them stepped through the dungeon entrance of Bangar Crypt for the third time.</p><br/><p>‘Ding! You have entered Bangar Crypt (Hardcore Mode)!’</p><br/><p>“Tsk tsk tsk, Hardcore Mode. Just the announcement alone fills one with gusto!” Defiant Monk laughed as he said, “Are we the first party to challenge Bangar Crypt in Hardcore Mode?”</p><br/><p>“It must be so!” Ocean Despair, too, boasted uncharacteristically.</p><br/><p>“Brother Zhan Yu, how confident are you in clearing Hardcore Mode?” Laced with Crimson Fire’s casual tone of asking was his immense anticipation. As a guildmaster, he was more desperate than anyone else to be announced as the first to clear Hardcore Mode. It would be of tremendous help in spreading the name of his guild!</p><br/><p>At first, Crimson Fire had only wanted to observe Zhang Yang’s capabilities personally to decide what conditions to offer in recruiting him to his guild. However, Zhang Yang’s performance in Hard Mode had already amazed him. If he could also clear Hardcore Mode, this would be an unexpected surprise for Crimson Fire!</p><br/><p>“Bangar Crypt is the game’s first dungeon, so even if it’s Hardcore Mode, it’s not impossibly difficult. As long as we play according to tactics, chances of clearing the dungeon is still very high!” Zhang Yang remained reserved in his speech.</p><br/><p>Crimson Fire, though, was delightfully surprised, “Both Sky High and The Dominators are clearing Hardcore Mode’s first boss, I’ve heard that they have been wiped for over ten times. Can we really surpass them?”</p><br/><p>Sky High and The Dominators were both long standing guilds in games in the China region. Their distinguished existence had been undeniable in past online games, boasting impressive dungeon records! Since ‘God’s Miracle’ was launched, the guilds had also sent their main members into the game. Although Lost Paradise was also a sponsored semi-professional guild, they would only be a lightweight contender in comparison to Sky High and The Dominators.</p><br/><p>Zhang Yang smiled and said, “We should be okay!”</p><br/><p>“I believe in brother expert!” Snowy Death had immediately expressed his trust in Zhang Yang, his faith solid as a rock.</p><br/><p>Zhang Yang straightened up his sword and said, “Well, get ready to fight! Fully utilize your potions if you can, the monsters in Hardcore Mode are very fierce and we’ll need to maximize our DPS!” He stepped forward and used towards the 6 monsters that were standing at the entrance. ‘-70’, a normal attack landed on one of the monsters.</p><br/><p>His Rage rose to 21 points and Zhang Yang used .</p><br/><p>“-144!”</p><br/><p>“-159!”</p><br/><p>“-143!”</p><br/><p>“-900!”</p><br/><p>“-153!”</p><br/><p>“-148!”</p><br/><p>“D*mn!” Phantom Day could not help but cussed as he witnessed a huge “-900” damage text appeared above the monster’s head. It was not just him, the rest were as bewildered!</p><br/><p>Zhang Yang was surprised too. The reason behind such devastating damage was a complete coincidental superimposition of a with a , resulting in a total increase of 600%!</p><br/><p> dealt 3 times more than a regular attack, its trigger rate determined by the Luck attribute.</p><br/><p>Due to the monster’s high defense, classes like Thieves and Hunters who rely on the Dexterity attribute could only deal mediocre damage because a normal attack was a mere 10 or so damage. They could only deal greater damage by casting skills but even then, it would only be 30-50 points of damage at the most. Witnessing such a ridiculously high damage of 900, not a single soul was spared from being dumbfounded.</p><br/><p>“Zhan Yu, now I’m actually glad that you’re not a Berserker! If you had used a two-handed weapon with just now, that damage would have reached 1,500!” Phantom Day patted his chest in relief, he had long since given up the idea of comparing damage output with Zhang Yang!</p><br/><p>Zhang Yang laughed and said, “Amp up the DPS! The faster we clear this, the quicker we get to wrap things up!”</p><br/><p>Zhang Yang had kept something unsaid, which would be the implementation of an ‘Inheritance Patch’ in the future. Once it was released, each class would have an opportunity to obtain an ‘Inheritance’. For example, a Warrior would have the Spirit Swordsman, Barbarian, God of War and so on for Inheritance; a Spirit Swordsman would have a 30% damage increase when sword-typed weapons were used in attacks.</p><br/><p>The most powerful of all was the God of War Inheritance, it would be a unique inheritance where only one person in the whole world could obtain! One of God of War Inheritance’s effects was to grant a Guardian or a Berserker the ability to equip two-handed weapons, dual wield one-handed weapons, or a shield in off-hand slot!</p><br/><p>This meant that as long as Zhang Yang obtained the God of War Inheritance, he could still use two-handed weapons or dual wield one-handed weapons simultaneously! However, the patch would only be launched when players have reached Level 100. That would be at least a year later!</p><br/><p>Everyone was motivated when they had witnessed Zhang Yang’s damage power. There was no one who did not deal their damage to the best of their ability. They knew that they could never be on the same level as this madman but they did not want to lose to everyone else at the very least!</p><br/><p>With this setup, waves after waves of minions were wiped and very soon, the party had arrived at the first boss, Black Claw.</p><br/><p>This was the third time seeing that familiar dog face!</p><br/><p>[Black Claw, Guarding Beast of Crypt Entrance] (Green-Copper Boss)</p><br/><p>Level: 12</p><br/><p>HP: 72,000</p><br/><p>Compared to Normal Mode, the HP was doubled while the rarity had risen from Black-Steel to Green-Copper!</p><br/><p>“F*ck this, that’s over 70,000 HP! It’s crazy!” Fatty Han wiped his saliva and looked at his poor little white pig’s pitiful 300 HP. He could not help but cry. “Little Yang, can I make this boss my pet?”</p><br/><p>“What do you think?” Zhang Yang rolled his eyes at Fatty and said, “This boss still isn’t difficult, it just has higher attack, can now cause over 400 damage. Let’s just hope that it targets our healers less frequently!”</p><br/><p>Zhang Yang’s HP had reached 410 points from obtaining the ‘dog head’. Other than him, only Flame Emperor and Snowy Death had above 400 HP. That would mean once the rest of the party members were in contact with , they would be wiped.</p><br/><p>Zhang Yang pondered and said, “Silky, by all means, make sure everyone with 320 HP and above has . Give up on those with lower HP!”</p><br/><p>Since could absorb 80 points of damage, those with 320 HP and above could still barely survive after receiving with the shield. However, those with less than 320 HP would die from an attack even with . Using on them would only be a waste of MP.</p><br/><p>“Let’s go!” Zhang Yang walked a few steps forward and used towards Black Claw.</p><br/><p>‘-57!’</p><br/><p>A sword slashed and the white damage text floated above the boss’ head.</p><br/><p>Black Claw had recovered quickly and let out a fierce growl, swinging its claws to attack Zhang Yang.</p><br/><p>Zhang Yang hurriedly evaded while swinging the sword in his hand, using another normal attack.</p><br/><p>‘-60!’</p><br/><p>As his Rage rose to 29, Zhang Yang used .</p><br/><p>‘-145!’</p><br/><p>Zhang Yang held back from using because the boss’ attack speed in Hardcore Mode was incredibly fast. Even Zhang Yang could not ensure a 100% evasion rate, so he would only activate when he could not evade the attack in time to keep himself from harm’s way.</p><br/><p>‘Ding! You are affected by (Stack 1). All damage received increased by 100%. Lasts for 12 seconds!’</p><br/><p>Very soon, Zhang Yang was stacked with a number of s.</p><br/><p>The others had already started their attacks on the boss as soon as Zhang Yang had pulled the boss.</p><br/><p>“Ding! You are affected by (Stack 2). All damage received increased by 200%. Lasts for 12 seconds!”</p><br/><p>20 seconds later, Zhang Yang was targeted with the second stack of ! Black Claw’s melee attacks was around 200 in Hardcore Mode and so, along with the debuff, Zhang Yang would have suffered from a 600 points damage which would instantly kill him in just a single attack even with the 20% damage reduction passive skill.</p><br/><p>“Easy?! How could this boss have such rapid attack speed!” Phantom Day exclaimed. In his opinion, he was amazing if he could have dodged just one out of a hundred of the boss’ attacks. But it seemed like the faster the boss attacked, the quicker Zhang Yang’s reflexes became, almost as if the limit for his upgrade in technique and skill was the sky!</p><br/><p>Truthfully, Zhang Yang was far from unleashing his full potential but with the limitation of equipment and insufficient Dexterity, he could only perform to this level!</p><br/><p>Excluding Zhang Yang, the rest of the party members were extremely anxious that he would be wiped out by the boss at any given moment. Their tension was similar to that of tightrope walking, where a slight carelessness would spell doom!</p><br/><p>To err is to be human. Zhang Yang was not a robot, and he eventually made a small mistake. He was just half a step slower!</p><br/><p>A fatal half step!</p><br/><p>Watching the unavoidable massive claw heading inevitably towards Zhang Yang led the party to feel disappointed. However, they had actually let out a sigh of relief in their subconscious minds – To err is to be human, otherwise they would have been God!</p><br/><p>‘Ding! You have blocked Black Claw’s attack!’</p><br/><p>‘-39!’ reflected damage.</p><br/><p>‘-204!’ succeeded in dealing a .</p><br/><p>Under disbelieving gazes, Zhang Yang had displayed an absolute counter. The that he had been saving all this time had ultimately become l, resolutely unraveling the devastating strike!</p><br/><p>“Is that even possible?” Crimson Fire was stunned! He was certain that the 2 tanks in his guild would not have enough time to activate in the event that they failed to dodge an attack!</p><br/><p>After a while of madly attacking Zhang Yang, Black Claw turned his head and spat black venom targeting Hundred Shots.</p><br/><p>‘Ding! Player Hundred Shots has died!’</p><br/><p>Hundred Shots was instantly killed with a devastating 400 damage.</p><br/><p>“Carry on the attack! Or else we’ll all die!” Zhang Yang shouted. He brandished his sword and continued to attack the beast.</p><br/><p>90%, 80%... Black Claw’s HP was slowly reducing.</p><br/><p>‘Ding! Player Phantom Day has died!’</p><br/><p>…</p><br/><p>70%!</p><br/><p>‘Ding! Player Ocean Despair has died!’</p><br/><p>…</p><br/><p>10%!</p><br/><p>‘Ding! Player Crimson Fire has died!’</p><br/><p>When Black Claw’s HP was at its final 10%, Zhang Yang’s party was also at its final 3 players, him, Fatty Han and Silky Snow!</p><br/><p>“Come on!” The 7 players who had fallen cheered.</p><br/><p>8%, 7%, 6%, 5%!</p><br/><p>‘Ding! Player Slim and Handsome has died!’</p><br/><p>“Go all out, Silky, forget shielding and healing, let’s attack together!” Zhang Yang shouted. If he was the sole survivor, the boss’ would definitely target him too. He was sure he could dodge this in Normal or even Hard Mode but the boss’ skill activation speed was too fast in Hardcore Mode. Furthermore, the distance between the two of them was too short, and it would be impossible to dodge!</p><br/><p>Silky Snow complied and immediately began casting .</p><br/><p>4%, 3%!</p><br/><p>‘Ding! Player Silky Snow has died!’</p><br/><p>“Come on!”</p><br/><p>“Kill it!”</p><br/><p>“Pro, you can do it!”</p><br/><p>Fatty Han and the others got excited, shouting as loud as they could. None of them was willing to let all that they had done end in vain at 1%.</p><br/><p>2%!</p><br/><p>1%!</p><br/><p>Suddenly, Black Claw’s attacks paused and the black venom was spat!</p><br/><p>“F*ck!” Everyone cried in their hearts.</p><br/><p>Zhang Yang remained calm and continued slashing with the sword in his hand, dealing another 2 attacks.</p><br/><p>‘-62!’ Normal Attack.</p><br/><p>‘-840!’ , on top of !</p><br/><p>‘Ding! Player Zhan Yu has died!’</p><br/><p>‘Ding! The party you are in has killed Black Claw!’</p><br/><p>The two system notifications rang. Zhang Yang and Black Claw fell at the same time!</p><br/>\n</div>"}