{"title": "Chapter 36: Golden Venomous Python King", "id": 36, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-36-golden-venomous-python-king", "volume_title": "Volume 1", "body": "<h1>Chapter 36: Golden Venomous Python King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 36: Golden Venomous Python King</p><br/><p>Translator: Editor:</p><br/><p>A monster’s most dangerous aspect was not knowing what skill it possessed! Not knowing its skills had naturally meant that there was no was of formulating a counter strategy. Only through constant deaths could a player reveal the monster’s skills one by one!</p><br/><p>This was why Zhang Yang who was familiar with almost all future dungeon bosses’ skills and tactics had a significant competitive edge! Even if he was not skilled, just his thorough understanding of the bosses’ skills would be enough to bring him fame in the server. All the guilds would have wanted to recruit him!</p><br/><p>Right now though, Zhang Yang could only cautiously stare at the Python King, staying alert of any moves it might make. He had never faced this boss before, so he had to wait patiently for the boss’ moves in order to counterattack.</p><br/><p>This was the most passive strategy ever but he had no alternatives for now.</p><br/><p>97%, 94%, 90%, Python King’s HP went down slowly. This Green-Copper monster seemed to have no other special skills, as it kept attacking with its predictable fangs and tails.</p><br/><p>‘Ding! Gold Venomous Python King has used !’</p><br/><p>Just as he thought about how monotonous the fight was, the Python King glided towards Zhang Yang at lightning speed and coiled around him with its golden body.</p><br/><p>Although Zhang Yang had been alert, the skill had no activation sign so he could not have prepared for it. He had been careless to have used which was now in cooldown, so even though he had quickly withdrew, Zhang Yang had still lost to the boss’ speed and was strangled by the huge snake.</p><br/><p>‘-184!’</p><br/><p>Immediately, a red damage text appeared on his head.</p><br/><p>Referring to the battle record: Golden Venomous Python King’s has dealt 184 points of physical damage. 116 HP was reduced.</p><br/><p>Zhang Yang had 20% of damage reduction passive skill and up to 70 points of defense, thus the 300-point damage was reduced to 184 points! He quickly used a red pot and a ‘+100’ floated across.</p><br/><p>88%, 86%, 84%, the boss’ HP continued to decline.</p><br/><p>‘Ding! Golden Venomous Python King has used !’</p><br/><p>Subconsciously, Zhang Yang used immediately and raised his shield.</p><br/><p>‘Ding! You are affected by . Reduces 50 HP every 3 seconds. Lasts for 15 seconds!’</p><br/><p>He had used for nothing! Only then had Zhang Yang realized that the boss’ was of magical-property damage instead of a physical one. The debuff status icon appeared on his avatar at once.</p><br/><p>Crap! DoT again! His high defense had been totally useless!</p><br/><p>‘Ding! Golden Venomous Python King has used !’</p><br/><p>“D*mn!” Zhang Yang cursed out loud. His earlier had been wasted so the effect had disappeared right after 1 second. He had nothing else to block this skill with now!</p><br/><p>‘-184!’</p><br/><p>Another red damage text glided across Zhang Yang’s head while ’s DoT recurred with ‘-40’, reducing his HP to 712 points!</p><br/><p>This was the disadvantage of knowing nothing regarding the boss’ skills! Otherwise, Zhang Yang would at most have been damaged by and could have definitely used against ! Indeed, ignorance is the ultimate enemy of mankind!</p><br/><p>82%, 80%, 78%, Zhang Yang calmed down and continued to hack away intensely.</p><br/><p>20 seconds later, the Python King stretched its mouth wide and spat a dark green venom towards Zhang Yang once again!</p><br/><p>‘Ding! You are affected by . Reduces 50 HP every 3 seconds. Lasts for 15 seconds!’</p><br/><p>Zhang Yang bemoaned inwardly, he could nullify with but he could do nothing against , a magical attack. Although he had 20% damage reduction from his passive, it still dealt significant damage!</p><br/><p>Sigh, if he had brought along a healer, obliterating this boss would have been a piece of cake!</p><br/><p>He was left with 452 HP yet the boss still had 75% of its HP. It seemed impossible to clear.</p><br/><p>He had wanted to give up quickly and get a rematch after finding a healer but Zhang Yang guessed that there might still be skills the boss had yet to cast, so he decided to continue the fight.</p><br/><p>‘Ding! Golden Venomous Python King has used !’</p><br/><p>“!”</p><br/><p>‘-58!’ reflected damage.</p><br/><p>Red pot’s cooldown had completed and Zhang Yang used it at once, causing a ‘+100’ text to pop up.</p><br/><p>71%, 67%, 56%...</p><br/><p>The boss’ defense was high but Zhang Yang’s attack damage was equally substantial. He had brutally slashed the boss’ HP down to 40% but his own HP was also at a sad 92 points. He could only withstand 2 more DoT effect.</p><br/><p>‘-40!’</p><br/><p>Zhang Yang’s HP went down to 52 points.</p><br/><p>3 seconds later, another ‘-40’ floated across his head and he was left with only 12 HP.</p><br/><p>Another DoT was bound to appear when a white light had suddenly flashed by Zhang Yang. A green ‘+154’ text that had never looked any cuter floated across his head at the same time.</p><br/><p>Someone had healed him!</p><br/><p>Zhang Yang turned and saw a lady dressed in white standing by the trunk’s entrance. She was incredibly tall and slender, her especially thin waist highlighted her voluptuous hip with such allure and her pert breasts heavily blessed, being astoundingly ample!</p><br/><p>Character’s physique was not modifiable in the game, which meant that this woman would have the same well-proportioned body in real life!</p><br/><p>Unfortunately, while the lady had a figure that at least 90% of the female population would be jealous of, her face was ordinary. She was not ugly but she had quite a distance to go to call her a beauty! However, her pair of eyes were very beautiful. They were magnetic and faintly enticing.</p><br/><p>“Thank you!” said Zhang Yang quickly. He had a good impression of this lady with a fantastic body but a plain face – if it had been someone greedy, they could have opened the chest while he was battling the boss!</p><br/><p>This lady did not hide her profile. ‘Little Snow, Level 13’, and ‘Lone Desert Smoke’ were the two rows that hovered above her head. Judging from her appearance, she would be around her twenties! The face could be modified though, so Zhang Yang could not be sure if what he had seen was her real face.</p><br/><p>Little Snow smiled and casted another healing spell on Zhang Yang and said, “You’re welcome. I was just passing by! Oh right, where is this? I’m completely lost. I got confused and walked for so long and then I arrived here!”</p><br/><p>The game had a mini map that marked the player’s location. It would be really hard to even ‘get lost’ even if you wanted to! Now that she had actually lost her way into this place, that sounded even more ludicrous! Zhang Yang remembered how the cave’s entrance was properly concealed and had he not accepted the quest which sent him here in search of the Python King’s Nest, he would have given up long ago!</p><br/><p>Terrible sense of direction!</p><br/><p>Zhang Yang concluded in his head as he sent a party invitation to her. In ‘God’s Miracle’, as long as a player has dealt damage to the monster, they would be eligible to obtain its loot. For Sacred Knights and Priests though, they could not get any equipment nor experience just by healing, so they must be in a party with attackers!</p><br/><p>Zhang Yang had intended to ask Ocean Despair for help but since Little Snow had helped him and left a good impression, he had decided to share the loot with her!</p><br/><p>The equipment Little Snow was wearing were not bad. Everything was basically Level 10 Black-Steel equipment. Although Python King was a Level 20 boss, Zhang Yang’s attack nullification ability was incredible. It would be more than enough as long as she healed the HP lost from .</p><br/><p>“Wow, you’re already at Level 18!” Little Snow hesitated before accepting the party invitation. She was surprised when she noticed Zhang Yang’s level, “Why isn’t your name on the Player Level Ranking?”</p><br/><p>“Enlistment is optional!” explained Zhang Yang.</p><br/><p>“Oh!” Little Snow nodded and her eyes shone, “Ah, you are that Zhan Yu! Are you interested to join our guild? Defiant Monk kept praising you!”</p><br/><p>“Defiant Monk?”</p><br/><p>“Eh? You didn’t know Defiant Monk was in our guild?”</p><br/><p>Zhang Yang only knew that Defiant Monk joined a guild but he did not remember clearly which guild it was! He laughed and said, “I see, we’re kinda fated then!”</p><br/><p>Little Snow’s eyes were beguiling, the corners of her mouth raised into a faint smile. She might have looked ordinary but her beautiful eyes made up for everything, outshining her flaws, “Brat, trying to flirt with me?”</p><br/><p>“Brat?” Zhang Yang smiled depreciatingly. Although he was only 22 years old currently, adding the 5 years of his previous life, his mental age was close to a 30-year-old uncle!</p><br/><p>Elder sister who was terrible at directions!</p><br/><p>Zhang Yang quietly amended his evaluation of Little Snow in his heart.</p><br/><p>With the addition of Little Snow, Python King was no longer a threat to Zhang Yang. Even as it used both its skills interchangeably, its death was still imminent!</p><br/><p>5%, 4%, 3%, 2%, 1%!</p><br/><p>As the last drop of the Python King’s HP vanished, it too had fallen to its death.</p><br/><p>‘Ding! The party you are in has killed Golden Venomous Python King! Obtained 30,050 EXP (50 points Party Bonus)!’</p><br/><p>“Eh? This monster is a boss?” Little Snow was very surprised.</p><br/><p>“If it’s not, do we need such a long time to kill it?” Zhang Yang replied stoically. He had thought that killing this boss would induce a system reward, this could have been the first Green-Copper boss in the field! After waiting for some time though, Zhang Yang dropped his head in disappointment as there was no reaction from the system.</p><br/><p>“Eh? It’s not strange since a tank’s attacking damage is low, isn’t it?” Little Snow was indignant.</p><br/><p>This girl, did she not see the boss’ HP? Did she not see the damage he had dealt?</p><br/><p>Zhang Yang sighed and asked, “Where have you been looking all this while?”</p><br/><p>“The tank’s HP bar of course!” Little Snow had a despising look, “If you die, how am I, a Priest, supposed to survive?”</p><br/><p>Made sense.</p><br/><p>Zhang Yang shook his head and said, “OK, let’s loot and share the equipment!”</p><br/><p>He looted and the first equipment came out.</p><br/><p>[Python King’s Hood] (Green-Copper, Cloth Armor)</p><br/><p>Defense: +2</p><br/><p>Vitality: +18</p><br/><p>Intelligent: 9</p><br/><p>Spirit: +3</p><br/><p>Level Requirement: 20</p><br/><p>“This one’s for you!” Zhang Yang passed easily.</p><br/><p>Little Snow darted her eyes and said, “Hey, are you really trying to flirt with me?”</p><br/><p>“Haha”, Zhang Yang laughed dryly, “Can you please not be so narcissistic. I already have someone I like!”</p><br/><p>“Hm. I know that. That person you mentioned must be me!” Little Snow said with an “I know it all” expression.</p><br/>\n</div>"}