{"title": "Chapter 54: The Second First-Clear Achievement", "id": 54, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-54-the-second-first-clear-achievement", "volume_title": "Volume 1", "body": "<h1>Chapter 54: The Second First-Clear Achievement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 54: The Second First-Clear Achievement</p><br/><p>Translator: Editor:</p><br/><p>“Hey! That’s mean!” Drizzler laughed underneath her covered mouth.</p><br/><p>“Little brat! What do you know! This is called deception in war!” Fatty Han was trying mimic the looks of the great philosopher Zhu Ge Liang.</p><br/><p>“Drizzler! That’s called ‘Learning from Experience’! Even in game he would use some kind of trickery to deceit others. Obviously, he would also be a swindler in reality! Drizzler, you must take this chance to learn. Next time, when you see someone like Fatty, you’d better get far, far away from him!”</p><br/><p>Drizzler stood upright and saluted her like a soldier to a captain. “Sir! Yes Sir!”</p><br/><p>Everyone laughed at the cousin’s skit.</p><br/><p>Fatty Han quickly tried to rectify to situation. “Hey! I have the 4 virtues of a youngster! It’s just you guys who could not recognize it!”</p><br/><p>“Which four?” said Hundred Shots. Being the silent type, he rarely participated in talks but since the mood got quite rowdy, he decided to join in.</p><br/><p>“I’m a little greedy!”</p><br/><p>“A little horny!”</p><br/><p>“A little baddie!”</p><br/><p>“A little fatty!”</p><br/><p>“Oh my god…” All four of them pointed their middle fingers at Fatty Han.</p><br/><p>Once that was over, the team revived themselves and ran over to the second boss. Everyone sat outside the boss’s chamber to consume some health recovery items.</p><br/><p>“Alright, all set! Let’s go!”</p><br/><p>! !</p><br/><p>Both Zhang Yang and Drizzle activated at almost the same time. They dashed through the floor and arrived in front of the boss.</p><br/><p>!</p><br/><p>Zhang Yang immediately locked on to the boss’s aggro. He used and a normal attack after, damaging the boss with his sword.</p><br/><p>‘-335!’</p><br/><p>He gained 34 Rage and immediately he used and . Zhang Yang managed to stack two layers of as soon as the two seconds of wore off.</p><br/><p>Earth Spirit Oz grumbled and opened its mouth.</p><br/><p>“Invaders. Oz will not allow you to destroy Lord Marzerway’s plans to destroy all of humanity!” After the opening speech was over, Oz began to charge towards Zhang Yang.</p><br/><p>“Huh… human annihilation. I guess that is the only dream all bad guys could ever have!” Drizzler scoffed.</p><br/><p>“Actually, Marzerway is the victim here. Quite the pity as well.” Zhang Yang explained while he swung his sword.</p><br/><p>“Huh?”</p><br/><p>“Didn’t you read the official introduction?” Zhang Yang sounded disappointed. “Sigh, every dungeon has their own lore!”</p><br/><p>“Well, Fatty here doesn’t care about that. All I want is the equipment!”</p><br/><p>“I just care about the gold pieces!”</p><br/><p>“…”</p><br/><p>“Really?! Come on guys! The developers put their hearts and souls into making this game to be as detailed for the sake of the players! What you have done is spat on the efforts the developers! What a waste of a beautiful game!” Zhang Yang shook his head in disappointment.</p><br/><p>“Tch! What an elderly act. You’ll surely be elderly soon enough!” Drizzler scorned.</p><br/><p>“Alright… Let’s hear it out. What’s the story?” Little Snow resumed her pace, winking about again.</p><br/><p>“In the lore, Marzerway was a famous Spellcaster who was part of a Spellcaster guild in the Empire’s Royal Family. A few years back, he joined the army to fight against the invading specters, leaving behind his loving wife in the hands of a noble. Little did he know that the noble tainted his wife, causing her to grieve, and she eventually killed herself. When Marzerway returned, and found out the truth of his wife’s death, he sought out to have his revenge. Sadly, he was deemed a traitor to the empire. Hated by all, he was imprisoned, waiting to be executed.” Zhang Yang looked around. Everyone was listening carefully.</p><br/><p>“Anguish and despair beyond any human can endure, Marzerway surrendered his soul to the demon and exchanged it for unlimited power. He escaped the prison and desecrated the Snow Sprite City, killing everyone and everything in it! After that, Marzerway occupied the city and summoned countless of elemental monsters to defend the city against the Empire’s army.” Zhang Yang finished his story and look around again. He suddenly yelled.</p><br/><p>“F*ck! Why are you guys just standing there! We’re still in the middle of a fight!”</p><br/><p>The four of them were shaken, as if they were woken up from a dream. Drizzler bit her lips.</p><br/><p>“Aw…Marzerway is quite pity!”</p><br/><p>“Ah… this truly is sad. If only I can get married to someone as loyal as Marzerway… that would be nice!” Little Snow had a yearning kind of tone in her voice.</p><br/><p>‘Cousin! What’s the use if he is just loyal? A true gentleman must be straight forward, brave, handsome and cool! If he is anything like Fatty Han, then you might as well give up.” Drizzler giggled and turned around to make sure he heard what she said.</p><br/><p>Fatty Han shriveled up. He only joked around to cheer the party, and now he made himself public enemy number 1. How did it turn out this way?</p><br/><p>“Foolish intruders! Taste my wrath!” A red glow covered entire Oz’s body, increasing his power by a level.</p><br/><p>‘Ding! Earth Spirit Oz has gain a effect (1 stack). All physical attack is increased by 5%!’</p><br/><p>“Crap! No time to play around anymore guys! Strike him with all you’ve got!”</p><br/><p>‘Ding! Player Zhan Yu received ! Stunned for 2 seconds!’</p><br/><p>‘-305!’</p><br/><p>‘-316!’</p><br/><p>‘-84!’</p><br/><p>‘+120!’</p><br/><p>‘-312!’</p><br/><p>‘+297!’</p><br/><p>‘-301!’</p><br/><p>‘-84!’</p><br/><p>This round, Little Snow used instead of . With only 1.5 second casting time, she could easily heal in between the boss’ furious attack. After enduring that barrage of attack, Zhang Yang’s HP remained at around 900. He then evade one attack, and used on the other, giving Little Snow enough room to cast . After he was healed, his HP was back to 70%.</p><br/><p>90%, 80%.... the boss’ HP dropped continuously and it was not slowing down. However, the boss was also growing in damage. 5%, 10%, 15%...</p><br/><p>“Alright, this is going well. Guys! Maintain this pace and we can surely win this round!” Zhang Yang encouraged the party.</p><br/><p>“Pathetic little intruders! I will crush all if you into smithereens!” Earth Spirit Oz growled. The red glow engulfed his body over and over again and when Oz’s HP reached 10%, he stacked over 12 layers of !</p><br/><p>“Here comes the most dangerous time!”</p><br/><p>‘Ding! Player Zhan Yu received ! Stunned for 2 seconds!’</p><br/><p>‘-487!’</p><br/><p>‘-128!’</p><br/><p>‘+120!’</p><br/><p>‘-482!’</p><br/><p>‘-489!’</p><br/><p>‘+302!’</p><br/><p>‘-128!’</p><br/><p>‘-491!’</p><br/><p>After a serious beating, Zhang Yang’s HP stopped at 57 points! The boss has yet to stop attacking!</p><br/><p>‘Evade!’</p><br/><p>‘!’</p><br/><p>Zhang Yang quickly consumed a bottle of red potion while waiting for Little Snow to heal him.</p><br/><p>‘+399!’</p><br/><p>The potion’s healing only managed to put him out of the danger zone, but he was still not out of trouble!</p><br/><p>9%, 8%, 7%... Death was inevitable!</p><br/><p>4%!</p><br/><p>3%!</p><br/><p>2%!</p><br/><p>1%!</p><br/><p>0%!</p><br/><p>“Oh… L-Lord Mar… Marzerway will resurrect me a-again! I-I will….c-crush…” With its last dying words, Oz came crashing onto the floor.</p><br/><p>“WE DID IT!” Finally, they did it. All of them let out a sigh of relief and cheered.</p><br/><p>‘Ding! You can the party member around had killed Earth Spirit Oz. Obtaining 26,450 Experience points (50 party bonus point)!’</p><br/><p>‘Ding! Your party has successfully conquered Marzerway’s Lair: Front Wing (Hardcore Mode) and obtained the “First Clear” Achievement! This glorious accomplishment will be recorded in the Hardcore First Clear Achievement Board. As the party leader, please name your party!’</p><br/><p>Zhang Yang paused and thought for a while. He turned around and said, “Hey little brat, I’ll key in your guild’s name into this achievement for 1,000 gold pieces! How does that sound?”</p><br/><p>“Wah! Come on, uncle. We’re so close to each other now! Would you still charge us for it?” Drizzler screamed and shouted. To take her money was on the same level as robbing a bank; there would be resistance.</p><br/><p>“Haha! Friendship is one thing, business is another! Come on! Pay up!” Zhang Yang continued to play with her.</p><br/><p>“Awww…” Drizzler then tried to follow Little Snow’s seductive behavior by trying to wink. After so much effort, all she could only manage to close one of her eye. It’s freaking tiresome! Drizzler gave up and stomped the ground. “Ah, well. How about I offer you Little Snow’s nudes! Yeah. You heard it right! Her nudes!”</p><br/><p>Little Snow’s eyebrow twitched. “Ahem! You little witch, what are you blabbering about?” A seductive look naturally formed.</p><br/><p>“Are you for real?!” Fatty Han got excited. Everyone could see a pinkish erotic aura emitting from him.</p><br/><p>“Of course it’s real!” Drizzler patted her chest.</p><br/><p>Little Snow did not really care at first but when she saw Drizzler smiling ear to ear, she began to feel that something was wrong.</p><br/><p>“You couldn’t possibly be serious…”</p><br/><p>“HEHE!”</p><br/><p>“You brat, when did you…?”</p><br/><p>“You always like to leave the door open whenever you take a bath. I was just passing by one time and when you didn’t notice my presence, I took a picture!”</p><br/><p>“Oh no you little witch! YOU’RE SO DEAD WHEN I GET MY HANDS ON YOU!” Little Snow voice became louder.</p><br/><p>Fatty Han took the opportunity to sneak in.</p><br/><p>“Hey, hey Little Drizzler, since WE are also quite close… so…”</p><br/><p>“Hey, hey! We’re not that close!” Drizzler played along.</p><br/><p>Zhang Yang laughed.</p><br/><p>“This time I’ll key in your guild name. The next dungeon, I’ll key in my own guild name!”</p><br/><p>“Eh? When did you join a guild?” Little Snow asked.</p><br/><p>“No. Not yet. After these two dungeons, Fatty Han, Hundred Shots, and I will establish a guild of our own. How about it? Feel like coming over to this side?” Zhang Yang gazed at the two girls. There were fine specimens after all!</p><br/><p>“Why so troublesome?” Drizzler pouted her lips. “Why don’t you come to our guild? I’ll pass the guild master position to you!”</p><br/><p>Zhang Yang was surprised. “Eh? You would do that?”</p><br/><p>“It’s fine! My cousin and I established the guild just for the fun of it. Being a guild master is so troublesome after all. I had to do this and that, manage here and there… Argh! I’d wanted to quit for so long! To think that you could take over my position! I would be glad to pass it to you!” Drizzler sounded very decisive.</p><br/><p>Zhang Yang could never have predicted this outcome.</p><br/><p>“You’d better think this through and through. ‘God’s Miracle’ is not like any other VRMMORPG. In the future, the game will have so many more players joining in! You could basically call this game the ‘second Earth’! If the guild is managed properly, you could earn a living from the income!”</p><br/><p>“Yeah, yeah. How could you talk so much? It’s so annoying! Ain’t that right, cousin?”</p><br/><p>“Em, that’s right. Besides, in less than a month, Drizzler will heading back to school. She won’t have much time to play this game anymore. It’s would be in the best of interest if you took over the guild!” Little Snow nodded.</p><br/><p>Zhang Yang felt bad for those under these two lazy bums. He would not mind to take over the guild’s responsibility at the least. He thought for a while and considered it.</p><br/><p>“Alright then, in that case, add all 3 of us into the guild! Fatty Han, quit your guild now!”</p><br/><p>Fatty Han was a little unwilling, “Sigh… if someone as handsome and cool as me left that guild, I’m afraid those pretty chicks would go crazy without me!”</p><br/><p>‘Ding! Player Drizzler has invited you to join her guild: Lone Desert Smoke. Will you accept her invitation?’</p><br/><p>Zhang Yang entered the guild. After a short while, he saw the guild notification refreshed.</p><br/><p>Player Slim and Handsome has joined the guild.</p><br/><p>Player Hundred Shots has joined the guild.</p><br/><p>Zhang Yang then keyed in the name Lone Desert Smoke as the party name and selected “Confirm”. The server channel then dyed in red again.</p><br/><p>‘Server announcement: Party Lone Desert Smoke has obtained the First Clear Achievement: Marzerway’s Lair, Front Wing (Hardcore mode). This glorious achievement will be recorded in the Hardcore First Clear Achievement Board (China Server)!’</p><br/><p>‘Server announcement: Player Zhan Yu (Party Leader) has obtained the First Clear Achievement: Marzerway’s Lair, Front Wing (Hardcore mode). Obtaining 10 gold pieces, 1 Skill point, and 500 increased all races reputation from the system reward!’</p><br/><p>‘Server announcement: Player Drizzler…’</p><br/>\n</div>"}